{"Reviews": [{"Author": "Reviewer MHM 3-5 \"Reviewer 3-5\"", "ReviewID": "R2EA7BYN2H89P0", "Overall": "3.0", "Content": "I would love to give this device a five star rating. I really would. It's a brilliant device. It is the perfect size for an iPad. It fits comfortably in my hand, and yes, i can even fit it in my pockets still (but I'm a 6' 4\" guy so ladies don't expect the same) The keyboard I type this review with on screen is perfect for typing with thumbs. No need to stretch at all, but the buttons aren't like the iPod or iPhone where if you're not careful you'll mistype frequently. The screen resolution is gorgeous, and I love using this as my contact book and planner. Web browsing is very fast but here's where we come to the issue.If you do a search on Google and Apple forums, you will find a lot of complaints that the iPad Mini won't stay connected to WiFi. The iOS 6.0.2 update was supposed to fix this, but it has not. I find my iPad will connect to the router just fine, but it won't always connect to the Internet. I can have three bars of WiFi reception and still not be able to pull up a web page, use my apps, etc. I have found one person who said he solved this by manually inputting the router data, but I still need to try this. More likely I'm hoping that the first batch of these iPads were \"lemons\" so to speak and I'll go to the Apple Store and try to exchange it. I haven't had this device for even a week so hopefully they'll allow me to do so.I am thinking sometime down the road Apple will patch this. But until they do, I simply can't give it the Five Star review I want to give it. I will update this if I find a solution. If those of you Amazon users find a solution, please let me know with comments!", "Title": "I love this thing! But....", "Date": "January 13, 2013"}, {"Author": "Ah Pui", "ReviewID": "R2PUSUP94CZ3N3", "Overall": "5.0", "Content": "Like some of us, I bought my iPad 3 early this year and really enjoyed it. The entertainment values coupled with the productivities boost make iPad a worthwhile purchase. For iPad mini however, the competitors are real and decisions are harder than ever before. It maybe the most promising tablet of today but does it deserve your hard earned cash?Below is my observations after using it for some time:-perfect form factor. Feather weight, incredibly thin yet feel substantial.-good for games that require lots of maneuverability.-huge number of existing high quality iPad apps available for iPad mini.-most ideal ebook reader period.-act as a portable digital album with enough real estate for detail showcasing.-perfect for work use. Much lighter to carry and pass around showing demos etc.-less awkward for camera use.-less awkward to pull out in the middle of a bus ride and watch a movie.-sustain much longer period of holding without hand straining.-one hand holding. not quite one hand usage but feels great to be able to hold comfortably in one hand.-bring everywhere, use anywhere. almost pocket sized and serve well as nightstand and desk accessory (alarm clock, desk weather display etc).-perfect travel companion. ultra long battery life. easy to pack, carry and use at all times.-perfect notetaker/notepad. In meetings/conferences, easy to carry around and write on.-perfect for children. it may be mini but the most ideal iPad in terms of size and weight for them.minor negatives:-would prefer bigger screen for mindless browsing.-retina hd for video playback won't hurt.-easier to mistype in portrait mode.-some games just look better on the bigger iPad.-Apple may screw us by releasing a retina display iPad mini with the same price early next year.-not an inexpensive tablet. Costs almost the same as a slightly used iPad 3.-complements but does not completely replace the iPad. May need to carry both in same cases.So who should rush out and buy iPad mini now? Road warriors and avid book readers will most benefit from the perfectly sized iPad mini. It weights only 10.88 oz (0.68 pound) which is at least 10% lighter than the nearest 7\" competitor (nexus 7), not to mention much thinner (a ridiculous 30% thinner) and with a larger screen to boost! the most current iPad with its 1.44 pounds, is more than double the weight of mini which maybe significant if you are holding and carrying it all day. gamers may be slightly disappointed since it is equipped with the old A5 processor chip and the non-retina display (1024 x 768) is less than ideal when compared with the current retina (2048 x 1536) iPad. However, the screen resolution is very much comparable to its current 7\" competitors where 1280 x 800 pixels is the norm. But keep in mind that the iPad mini processor (dual core 1.0 Ghz 512mb RAM) is the weakest among its peers (nexus 7 quad core 1.2 GHz 1GB RAM, kindle hd dual core 1.2 GHz 1GB RAM). I doubt any one will notice the difference but performance geeks may beg to differ.I am also a bit disappointed that the iPad mini with its much smaller size and lower screen resolution, does not have significantly better battery life compared to its bigger sibling. I was also hoping to see a micro usb and hdmi port, but that didn't materialize.Photographers rejoice! With its perfect size, we can finally find reasons to use iPad mini as a camera as well. Its 5 MP rear camera resolution is adequate for taking casual pictures as it has the same resolution as its more expensive sibling. Shooting 1080p videos is also supported which is great. It feels really comfortable holding the iPad mini for shooting videos given its ample screen size in an ultra lightweight package. iPad mini beats out all its closest competitors, including google nexus 7 and kindle hd as they have 0 MP. they don't come with rear facing camera at all! Unfortunately wifi-only iPad mini does not come with GPS, otherwise Garmin, watch out! It would have make a perfect portable navigation system. Its the one area where nexus 7 has an edge as it has both NFC and GPS built in. NFC (Near field Communication) is an amazing piece of technology that allows us to use our mobile device as credit card payments and even transferring of data or images to other NFC-enabled devices just by touching. I hope Apple can consider adding this to their future products as this would make iPad mini even more awesome. iPad mini however has a 64 GB storage option (which I recommend) and 4G LTE connectivity option which are not available among its rivals. Mini tablets cross shoppers may also find the iPad mini physical appearance much more appealing. While kindle hd and nexus 7 do feel good in my hands, iPad mini feels even better as the build quality is undeniably more superior. Who doesn't like the sexy unibody aluminum build? The huge library of available iPad apps is also a deciding factor since only a fraction of android apps are designed for tablet use. There is no objective way to measure it, but I just found Apple iOS more user friendly than the android so it maybe more appealing to broader audiences.Now come the most interesting part. iPad mini maybe all great, but does it justify the premium? more specifically, should we pay an extra $130 for it? after all, 7\" kindle fire hd and nexus 7 come at $199 whereas iPad mini is listed at the $329 starting price. to make things harder, is iPad mini too expensive even compared to the new iPad which comes listed at $499 which btw is only 52% more expensive with significantly better specs. With mini tablets especially, physical properties are extremely important. 10% lighter and 30% thinner coupled with 35% more viewing area compared to its 7\" rivals, iPad mini scores huge points in this area. Apple iOS ecosystem with its huge library of high quality iPad apps may add some bonus points as well. All these makes paying an extra $130 worth it. Assuming similar depreciation of 35% like the iPad 3 after 8 months, savvy shoppers who could afford to wait, can get an absolute steal at $215, which is very much comparable to its rivals prices. Comparing iPad mini and iPad is much harder since the new iPad is significantly more powerful with a much larger screen and weight. I would think they target slightly different market and each complements  the other quite well without cannibalizing each other. However, if a retina display iPad mini ever comes out, I won't be surprised if more people choose it over iPad as their only tablet.For people considering trading in their iPad 3 for a mini, a significant drop in text quality may have to be expected. There is no noticeable differences to me while browsing images, however while reading large blocks of text, the drop in text quality is quite pronounced. Text appeared to be fuzzy and less crisp (especially in foreign characters where each character has more strokes), when compared to the razor sharp and clear text in retina display. For me personally, it is a tradeoff I am willing to make for extreme portability with almost identical features.Some people may criticize Apple for essentially releasing the same product year after year, just in slightly different form (may go as far as the original iPod). They are completely missing the point. People just have totally different feelings and emotions, and most certainly unique experiences interacting with different variances of the product. I certainly have as much fun playing with my iPod touch as my iPad mini. I can't wait to hear stories about how people interacted with their mini in ways they haven't done it before. I am sure we can always find novel creative ways to expand the use case scenarios for our beloved iPad mini.Besides practical reasons to owning it, there are aesthetics reasons too. iPad mini is just so beautiful to look at as it is indeed a piece of engineering marvel. I see iPad mini as the perfect travel entertainment device where as iPad is the perfect home entertainment device. Happy hunting!", "Title": "Is iPad mini a worthy purchase? Read on to find out!", "Date": "November 13, 2012"}, {"Author": "David Perez", "ReviewID": "RR4RP1OIUXXIS", "Overall": "5.0", "Content": "I purchased the 32gb LTE version and I am VERY satisfied with my purchase. I have the iPad 4, but wanted something smaller that was a bit more portable for traveling. I am so glad I made this purchase as it met my needs with overwhelming excitement. First, the size makes it feel easier to use for day-to-day activities such as web surfing and checking email. While I can do this with the iPad 4, the mini makes the user experience greater as there is less to tote around and is much much lighter than the iPad 4. After holding the iPad 4 for 30 minutes, it begins to feel like a brick. Holding the mini for 30 minutes doesn't even begin to tire out each of your arms from holding it for almost any period of time.Regarding the screen, it shows beautiful vibrant colors compared to the latest-gen iPad's. Owning both and comparing them side-by-side, I cannot tell the difference in quality while watching the same content on each of the units simultaneously. While I'm sure \"retina display\" is better in one way or another, it's hard to discern with the human eye as to the visual difference between the two. It's like comparing a 720p and a 1080p TV at 10 feet away - both look the same in regards to picture quality because the human eye cannot see the difference. For those that can \"see\" a difference, you must be holding the unit extremely close to your face (closer than just reading distance) or the \"retina display is better\" claim has tricked your mind into thinking you're seeing something that's simply not there. All of my family, including my young children, cannot tell the difference when watching movies or reading text. Even the content on my iPhone 5 seems a bit fuzzy, however when I pinch and zoom, it all goes away. The same is true of my iPad 4 which relates to the iPad mini. Don't let anyone fool you, the picture is gorgeous.As far as the LTE is concerned, it's lightning fast, however it will depend on your area. I can connect at 32mbps down and 9.5 mbps up in my area which is faster than my home broadband connection. I have no trouble hooking up to LTE and I always have a constant signal around my city. In addition, I have zero problems connecting to any wifi source. Here's the link to my screen capture from Speed Test: [...] I have a an iPad 2, iPad 4, iPhone 5's and the iPad mini. Across all platforms, the performance is fantastic albeit the performance on the iPad 2 is much slower in comparison to the mini, even though it has the same processor. My test is Sky Gamblers which plays a bit choppy on my iPad 2, but plays exactly the same as on my iPad 4 with an A6X processor.I added an Otterbox case and it nearly doubled the size of the unit. But WAIT!!!! This is a GOOD thing. It makes the iPad feel extremely comfortable in your hand and you will not lose grip as you may with the unit by itself since it's so thin and sleek. I have Otterbox Defender cases on all of my products mentioned above and swear by them. They are the best investment I've made in regards to accessories.In conclusion, this is one helluva product and I'm glad I purchased it. Do NOT be discouraged by the \"retina display\" hoopla that makes it seems as this is an inferior iPad. It's not in any way, shape or form. Using an iPad 4 to compare performance, the iPad mini mimics the exact performance that the iPad does, for the exception of programs opening about a half-second slower. I can definitely live with that. Hope this review helps.", "Title": "Perfect iPad for my family and I", "Date": "January 4, 2013"}, {"Author": "Patricia A Waddington", "ReviewID": "R2DXZP58NJQILS", "Overall": "1.0", "Content": "I was very excited waiting for this product to come in. I paid just as much for it as I would have directly from apple, so I was not expecting any troubles. Unfortunately, this was not the case. I turn my new iPad mini on and the screen immediately begins flickering and has white streaks through the screen. Garbage. Absolute garbage. Also, this store is unable to do exchanges through amazon, so in order for me to get a working iPad, I now have to take the time to mail the defective one back, wait for the money to be put back on my account, and then place another order (from a different store obviously). I am extremely disappointed.", "Title": "Do Not Buy From This Store", "Date": "October 9, 2013"}, {"Author": "Y. Zhou", "ReviewID": "R3ACF2HMPTS97M", "Overall": "3.0", "Content": "HiBefore I give you the review, let me tell you about my background. I am a college student who is very into tech. I've owned many tablets, and even more phones. I buy them used and sell them used, so I swap between a lot of devices. It's a bad habit, I know, but I really want to find that perfect device.Tablets I've owned:-iPad 1,2,3-Galaxy Tab 10.1-Nexus 7 (2012)I bought the iPad mini because I recently bought an iPhone 5 (from Nexus 4) to compliment my Macbook Air. I always went with Android devices because of how cheap they were, but I decided to splurge on an iOS/Mac ecosystem and see how well they sync together. I chose the iPad Mini because I think that the original iPads are too big. Also I like how thin the bezels are for the mini.So now you know why I bought the mini, here are my list of Pros and Cons.PROS:- Display. Yes I know, it's not retina, but it is still an IPS display. I would take an IPS display with 720p over any other display with 1080p. It's vibrant, colors are sharp. A retina would make it even better, but for me it's not that big of a deal.- Size and weight. So slim and light it's sexy. This is the main reason I picked this Mini over and iPad with retina. All the old iPads I've used, I never find myself using them often because it's tiring to hold them up for anything longer than a few minutes. WIth the mini, it's much easier.- Build quality. The main reason I've always envied apple users, their products are always such beauties.- iPad specific apps. Android tablet apps are just scaled up versions of phone apps, which makes the experience very dull. On the iPad, many apps have iPad versions, which uses the screen real-estate much better.- Internet. Browsing the web in safari is much better experience than on an Android tablet. It's faster, smoother, and everything just fits on the screen.CONS:iTunes. The lack of file management in iOS. This is the MAIN reason I'm having such a frustrating time on the iPad.  I like my iPhone, but dislike the iPad because of iTunes. It boils down to what I do on my iPhone vs what I do on my iPad. On the iPhone, I generally use it to go online, call/text, take pics, siri, youtube, email, etc. Very common stuff. On the iPad however, all I really do is read ebooks and watch videos. Given that, the reason I dislike the iPad is that it relies on iTunes way too much. I can't simply drag and drop video/ebook files into the ipad like I can do with any android device, I have to sync through iTunes. That itself is not that big of a deal, EXCEPT that iTunes only recognizes SOME of the very common files. For example, I have a lot of TV series saved on my Computer. Mostly all TV series files and some movie files are in AVI format, which is an extremely common video file type, but iTunes does not support it. If I wanted to get those files onto  my iPad, I'd have to convert the entire collection from AVI to MP4 individually, then drag them into iTunes, then sync it up with my iPad.Lightning. It's rare, and very expensive. Basically all the microUSB chargers I have are useless now. Not many people have the new 8pin lightning cords lying around, so you're SOL if you go out without your cord and your iPad dies on you. With android devices, there are microUSBs all over my house and in my car, so do most of my friends, so it's no worry. Also the lightning cords are very expensive. Often $20+. MicroUSBs, on the other hand, is often less than $2. The only clear advantage I can see of owning a lightning is that you can plug it in any side you want...big whoop.Lack of stereo speakers. Since I watch videos on it all the time, I wished it had stereo speakers like the Nexus 10 and the new Nexus 7.CONCLUSION:So there's my reasons. I am not a fanboy of android nor apple, they both have their pros and cons. The iPad is still the best tablet to browse the web for, which is probably what a lot of you will do. But if you're like me and sees yourself watching videos on it and reading ebooks, and has a huge library saved in your computer, then you might want to get an android tablet.", "Title": "Coming from Android, geek perspective.", "Date": "July 27, 2013"}, {"Author": "Jeremy Floyd", "ReviewID": "R2JD6ORJRM14S0", "Overall": "4.0", "Content": "Whether this is your first iPad or a replacement to an aging iPad, then you should consider the good, bad and the ugly before adding to your cart. I replaced a 32GB 1G iPad with a 32GB wi-fi mini. So, of course, the mini adds some features right off the bat that make it a major improvement over the 1G, but most importantly, this device travels with me more often than my previous iPad ever did.The GoodThe size! The mini seems perfectly designed for two thumb typing. Even with split-screen dock keyboard, I always found the on-screen keyboard to be cumbersome and difficult.Siri on the iPad is quite convenient as a desktop accessory and a mobile feature.The BadWhen compared side by side with Samsung or the Amazon Fire HD, the device doesn't stack up with display, audio, and peripheral input. This is the bad that everyone points to and there are some features lacking (some of which will not be resolved in future versions).The lightning connector - having apple devices for over a decade has many 30-pin connectors laying around the house. Now we have to lightning connectors in the house, so they are in hot demand. The connector doesn't always fit firmly, so sometimes I check the device to a disappointing 16% charge.The UglyThe display doesn't bother me as much as others, but the lack of retina display has bothered a number of owners. Of course this will be resolved soon.In the end, I would buy it again, and I don't have any regrets knowing that improved features are on the way.", "Title": "The Good, The Bad, and The Ugly of the iPad Mini", "Date": "January 27, 2013"}, {"Author": "Margaux Paschke", "ReviewID": "R3AB1PD2PV51H7", "Overall": "4.0", "Content": "This is a very non-technical review -- the newest version of the iPad rocks with its portability. This iPad mini easily slips into a purse or jacket pocket making it easy to carry around for either a female or male. You get all of the perks of the regular iPad with the extra benefit of being able to carry it around with you everywhere. Simply amazing!I love my iPad and use it more than any other electronic devise but I mourned its lack of portability. The iPad's size is great for watching tv, movies, reading books or light document work but a hassle to carry around. I had to dig out my huge purse to carry it around anywhere and the weight and size was cumbersome. This iPad mini is slimmer, lighter and smaller and oh so convenient to take with me when I leave the house.The smaller size does impact my document usage but since I use it mostly for entertainment, this is really minor for me but will affect those who use the iPad for work. I keep hearing the iPad mini lacks the same power (slower processor) as the iPad but I don't feel it. I've played games on it, watched videos, etc. without any noticeable difference. Maybe power is an issue with heavy document usage? I did deduct a half star for the lower screen resolution than the newest iPad while keeping the price tag around $350. Seriously?  The lower resolution is not so much apparent on iTunes purchases but more visible on home video or other sourced digital media.How does Apple seduce me into wanting their newest product (although, I'm proud so say I avoided their siren's call for the iPhone 5) and after using it, making it the newest best thing I cannot live without? Husband says it makes the regular iPad positively clunky and almost archaic but I think it's more sinister - it makes me appreciate the iPad for home use and the iPad mini for away-from-home use. Great, now I've used up my gift allowance for all of 2013....but you won't find me complaining this Christmas, birthday or anniversary because the iPad mini is worth it!Overall, if you can splurge this is the one thing you really want to spend your money on. As long as you are looking primarily for entertainment value, the iPad mini provides all the same options of the iPad (apps, digital media and dependability) but on a smaller, lighter and more portable scale.", "Title": "AMAZING! 4.5 STARS", "Date": "December 7, 2012"}, {"Author": "Amber Gilles", "ReviewID": "R3CWGQYR57OPU1", "Overall": "5.0", "Content": "I was not planning on buying this product, after seeing the specs with the amazon kindle fire hd I was actually planning on buying that. Better screen, cheaper, etc. after I went to best buy and actually played around with the fire, I hated it. It was bulky and seemed old, you couldn't even take pictures on it! Later, I was at the apple store with my sister while she got her iPhone 5 fixed, and I picked up the mini for the first time. Not only does it feel much more classy and expensive, it was thinner, lighter, and had a perfect screen size. The keyboard is so easy to type on, I'm actually using it right now. When I am using it in public I get a lot of comments because some people haven't seen it yet! When I use iPads they seem so bulky now, I love that the mini uses more screen size on the front and doesn't waste space like the full size ipad! I use the mini basically every moment of the day unless I'm working or with friends. At school, I took notes on it and I am excited to save money on text books next year, the ebooks are cheap and look great! Everyone complains about the screen resolution, but honestly I can't tell the difference, I think it looks the same as my retina I touch. I've never been more happy with a purchase. Tumblr is flawless on this device and so is Netflix! I would definitely recommend this over a full size ipad, save yourself some cash!", "Title": "My most used device", "Date": "May 10, 2013"}, {"Author": "Cmodman", "ReviewID": "R12UDAW88GH2NB", "Overall": "5.0", "Content": "I won't go in detail of the specs, there's plenty out there, so I'll just keep it in simple terms. This will be probably considered biased, being that I have way too many Apple products to count (iMacs, macbooks, mac mini, iphones, ipods, ipads etc..) so if you're not a fan of the truly brilliant company that is Apple, then you probably don't want to read this review.When I first heard of the mini coming out, I thought it was a joke, like really? Isn't that what the iPod touch is for? But when you go and hold this iPad, you truly see the difference between it's brothers and competition, and realize it is a great product in and of itself. The size of the screen is perfect, big enough to enjoy pictures / video, thin and light enough to toss in a bag on the go. I have the big brother New iPad, or iPad 3 or 4, whatever the heck they call it, and this is definitely a great individual product, and not just a scale down.I do have an Kindle Fire HD 7\" and the iPad Mini is wider and longer, so the screen is a bit bigger. It looks great, feels great in your hands, even though I would recommend a case for it to add some girth, because even though it does feel great naked, it just seems way too easy to drop and slip out of your hands.What more can I really say? Quick surfing, mail, chatting, pictures, video, magazines, books, this is a great addition to whatever gadget arsenal you have. I have always stood behind Apple products and can't preach enough how great they are, how easily integrated all their products are together and so on. And not the nonsense chaos and confusion that is Android / PC.If you got an iPad, the iPad mini is still a great addition. If your just getting into the tablet scene, the mini is a great first buy. If you just want something cool, this is for ou.PSI love you Amazon, I am a prime member, I spend way too much money on this website, but why the heck are you guys selling this at $380? It's $329 retail??", "Title": "Apple gets it right, yet again..", "Date": "February 20, 2013"}, {"Author": "MWebb", "ReviewID": "RFLWB92KJYFEY", "Overall": "5.0", "Content": "I was very disappointed when Apple announced the iPad Mini with the same screen resolution as the iPad 2. True, it looks sharper than the iPad 2 at first glance, because the pixels are spread over a considerably smaller screen, but still, when you hold it close at reading distance, you can see the pixels, and the Retina Displays on the other iPads have conditioned me to expect NO pixellation - just sharp, sharp viewing even with nose almost on the screen. If sharper viewing is what you want in a 7\" tablet, you will have to get the Google Nexus 7 or the Kindle HD Fire - Displaymate, which specializes in monitor calibration and reviews, grades both of those competitors higher than the iPad mini. (I will post the link to the Displaymate review in \"Comments.\")But neither the Nexus 7 nor the Kindle HD Fire has perfected the overall \"user experience\" like Apple, or has so many useful, and highly-tuned, Apps.Also, iPad minis are flying off the shelves. Most adults are buying minis for themselve, but a sizeable chunk, like me, are buying them for their kids since they only cost $29 more than the iPod Touch, the previous kids' favorite.Why, if the mini is just shy of perfection and we know (strongly suspect?) that Apple will, indeed, introduce a Retina Display mini next year, is it nevertheless such a big hit this year?Well, first of all, you have to hold it to believe it. It just feels so _right_. The mini is remarkably thin, just like the new iPhone 5 and new iPod Touch (5th gen). This slimness translates into really light weight, and the more squared edges translate into much easier holding. It is considerably bigger, in terms of surface area, than most other 7\" class tablets, but holds just as comfortably in the hand and makes other 7\" class tablets feel clunky and cheap in comparisonApple favored the books and web browsing experiences over movie/tv viewing. The screen is close to 4:3, so 16:9 movies/tv end up being letterboxed. But since the Apple has more square inches of viewing surface than other 7\" class tablets to begin with (the Apple is actually 7.85\" on the diagonal), the net resulting picture is about the same actual size as the \"full screen\" version on other 7\" class tablets.The smaller size with much lighter weight totally changes the viewing/reading experience. Hold it in one hand while you lie in bed and your wrist doesn't feel strained from the weight of a full-sized iPad. With two hands you can view or read for hours, just like on an e-reader.If this had a Retina Display, I'd give it 5 stars, and wish I could give it 6 or 7, it's THAT good.For kids (who read a lot less, and play games a lot more), this IS 5 star, right out of the box. An amazing 10-13 hours of battery life; a good screen, the Apple App universe. It is MUCH better proportioned for kids' smaller hands than the full-sized iPad (which probably feels to their hands like a 12.5\" would feel to us).In terms of hardware, this has the same zippy processor as the iPad 2, but a vastly upgraded camera on both the front and back. The front is now HD FaceTime, the back is 5 megapixels with autofocus (but no flash). It has SIRI. It has 16gb, which should be fine for a lot of \"fat\" video games; the $299 iPod Touch has 32gb, but that is positioned more as a portable media player with emphasis on \"music.\"My 8 y.o. daughter uses this to watch Netflix, watch Amazon Instant Video, do dental surgery (there is a kids App for that? good grief and shades of Little Shop of Horrors!), practice foreign languages, etc., etc., etc. Formerly she borrowed her mom's iPad 2, but she much prefers this, though I can't tell whether that is because it's her \"own\" or because it works better (but she didn't complain that I didn't get her an iPad 2, and that would have cost the same price - iPad 2's were discounted this season, while minis were not).There is a lot of speculation about why Apple didn't come out with a Retina Display on this one out of the box. Here are my thoughts:1. Apple sold a LOT of original iPads and iPad 2s and there wasn't really \"consumer demand\" for the Retina Display on the iPad 3. This was more a technology \"push\" from Apple than a \"must have\" from consumers. As more e-readers transfer their allegiance from reflective \"e-ink\" e-readers to tv-screen style tablets, though, Retina Display or its equivalent is more and more of a \"must have.\"2. Current Retina Display technology on larger devices - above the size of iPhones - calls for really, really bright LED's behind the screen - the \"aperture\" or \"tiny window\" for the pixel is so small on the larger Retina Display screens that you need a stronger light to illuminate it (the transistors have to fit in the same \"cell\" as the display pixel, which is why the \"aperture\" is relatively as well as absolutely smaller). So you need more lights, or larger lights, PLUS a bigger battery to generate all that light. This is why the iPad 3, and even the iPad 4, got heavier, fatter, and ran hotter than the slimmer, cooler iPad 2.- Now there seems to be new screen technology emerging that might solve some of these problems, but apparently the \"yield\" (usable to unusable percentage of production) is very low on the larger versions of these screens (and Apple apparently has a screen shortage even on the lower-tech iPad mini screen).3. In terms of actual usage patterns, some reviewers are reporting they prefer the smaller, lighter iPad mini over the sharper, but larger and heavier, iPad 3 or iPad 4. Yes, they know the screen colors are more accurate on the full-sized iPads, and the screen resolution can't be beat -but what they prefer hauling around is the mini. The mini screen is sharp \"enough.\"4. Early adopters are mostly adults. But based on how my kid has taken to the mini, this is THE computer device the industry has been predicting since the '70's - the computer that will transform education. And, I think, play, at least if you consider it \"transformational\" if kids spend all their game time on a tablet instead of on a Wii or DS etc. Personally, I think there is a real possibility these tablets will change Nintendo into a niche player and drive Sony out of the portable market. I do believe hard-core gamers will stick with  xBox and Playstation, but the market for the mini is potentially much larger than the market for console players. The number of additional kids owning these will more than off-set the number of adults who hold out for a Retina Display. For kids - this is perfect, as is.I am completely fussy, and even I am tempted by the mini. As much as I KNOW Apple will solve the technological and size and weight problems with a mini Retina Display in the near future - in less than a year - I still would like to have one now, because it is so easy to hold and use. I want my kid's iPad mini in a way I NEVER wanted my wife's iPad 2 (I actually preferred the Touch to the iPad 2). It is THE ideal sized cafe/travel tablet/reader, and after spending many, many hours with Android (4.0, 4.1, 4.2) on the MUCH better priced Nexus 7, I STILL prefer the iPad mini.So I can review this - I \"borrowed\" my kid's mini to do so - but I'm going to fight the good fight to resist getting my own. For as long as I can!", "Title": "5 Star for Kids, 4 Star for Adults", "Date": "November 27, 2012"}, {"Author": "Dennis Baker", "ReviewID": "R1NIX3VK2IYE3E", "Overall": "5.0", "Content": "The iPad mini is once of the most impressive pieces of technology I've ever seen. The latest generation of Apple products has really brought production quality to a new level. The mini is ridiculously thin and light, build quality on this is a generation or two ahead of the the iPad retina. This is one of those products you really need to pick up and handle to really appreciate.The display is not retina quality, but it's easily better than the iPad 1 or the iPad 2. Colors are good and brightness is good. I really like that they were able to shrink the bevels on the sides, it keeps the mini portable enough to slide in your pocket in a pinch. It's not comfortable in the back pocket of your jeans, but it fits there for short trips or if you need a hand in a hurry.I haven't pushed performance enough yet so it's hard to say where it sets with regards to that. Trying out a few videos I didn't notice any lag or missed frames and the actual UI is smooth and responsive. Because it's screen is lower resolution, you can still play iPad games on it with a good frame rate.Sound is surprisingly good and loud for a product this size. The only downsize to the sound is the fact that the stereo speakers are placed near each other on one of the narrow sides of the device. In cinema/ landscape orientation, the sound is on one side or the other. Even in portrait orientation, the stereo effect is not great. I tend to listen using headphones so I'm not sure it's a huge issue. It's a 3.5 star sound system, great sound, but frustrating placement.The lightning adaptor is a nice upgrade. You do lose access to older accessories, but it's quicker to use than the 30 pin adaptor (or microUSB, but that's another story). Charging is fast, 30 minutes to top it off which is awesome.------Update ------After a few weeks of use, I've only grown to like this more. It's so small, it's easy to tote along everywhere. I've been doing some photo editing on it and it works fairly well, but sometimes when you are trying complex edits or trying to undo a bunch of things in a row there is a bit of lag. I still haven't noticed the lag on video playback some of the other reviewer mention, but again I don't use YouTube very much.------Comparison Shopping ------The iPad mini shines when:* Apps are a priority (in my case, access to a few specific iPad only apps is a big showstopper)* Weight and portability are a important* You want the rear facing camera (The iPad 4G has this too)* You have invested in Apple accessories* Ease of use is a big concern* A solid, well engineered product appeals to youThe iPad 4th gen shines when:* Reading is your biggest use, the retina display is fantastic and the mini doesn't compete.* You want a future proof product; the A6X chip is a scorcher compared to the mini and it is almost certain to be supported longer.* The bigger size is an assetThe Nexus or the Kindle Shine when:* Price is your biggest concern* Nexus has built in GPS and NFC (though navigation is limited unless you get the 3G version)* You are using it exclusively for web surfing, reading PDFs, and watching videos.* Hack-ability and open-ness are important* You are invested in the Google or Amazon's eco-system", "Title": "Best iPad Mini Ever", "Date": "November 23, 2012"}, {"Author": "Susan \"Susan\"", "ReviewID": "R151BWXP7YT4A8", "Overall": "3.0", "Content": "I pre ordered my iPad mini and have been using it several weeksI travel a lot. So the weight and the size are prefect matches for me. The performance is suprisingly good. Also, the screen isn't that bad and it's better than my iPad2. Once I got my iPad mini, I know I will never go back to my iPad.HOWEVER,It's way TOO MANY crashes. when I load web pages such as google transit, Safari just forced close. Before I can get it back to work I had to try more than three times. I hope iPad mini 2 will have a better specs (they will if they put retina on it) and better performance like every other apple products.", "Title": "Often crashes", "Date": "December 2, 2012"}, {"Author": "Kaye \"km\"", "ReviewID": "R19144N42UZ1GW", "Overall": "4.0", "Content": "I have long used Kindle products (and I mean from first one on the market) and loved them.  I had checked out iPad several years ago and felt that the Kindle Fire was much better.  Recently purchased an iPad mini with 4G LTE  from another vendor to be able to use for a specific purpose - but was very surprised at the changes that have been made to bring the iPad  up to the standards of the Kindle Fire.  I would recommend purchase of the iPad mini.  I gave it a 4 star rating instead of 5 simply because of the cost.", "Title": "Improved over time - Compare with Kindle Fire HD", "Date": "November 13, 2013"}, {"Author": "sicily46", "ReviewID": "R1P2GW65HW9S9J", "Overall": "4.0", "Content": "I received my iPad mini on Sept. 20.  I had a software question so I contacted Apple Support for help.  They told me that my 90-day Apple new-buyer support had already terminated.  They said it had already been registered 3 months earlier by someone else.  That tells me that I was sent a used iPad and was charged a new iPad price.  Now I cannot use Apple Support if I have a problem in the next 90 days.  Also, my 12-month warranty has been reduced to 9 months.  I feel somewhat cheated and I hope this doesn't happen to another customer.  Next time I will buy Apple products from the Apple Store.", "Title": "Not Brand New", "Date": "October 2, 2013"}, {"Author": "tall2010", "ReviewID": "R2UH280WZE9FWD", "Overall": "3.0", "Content": "Coming from an iPad 3 (retina display). Love the Mini's small size but definitelynot the low-resolution display.Got used to the fantastic iPhone 4 and iPad 3 displays, therefore returned the Mini andwaiting for the version with retina display (early 2014?)...", "Title": "Returned it.", "Date": "June 20, 2013"}, {"Author": "Maximus Clean \"Mr. Phantasstik\"", "ReviewID": "RAW8U8G15J7OX", "Overall": "3.0", "Content": "I'm a certified iOS geek.  I've owned every iteration of the iPhone and iPad that's ever come out.  In Black and White.  I wait online and install the system updates (now OTA) the minute they are released.  I tell you this so you will know that I'm really fond of Apple's iOS products.So when the iPad Mini came out, I had to get it to supplement my new, new iPad.  You know what?  It has just not excited me.  It's really not that the 1024x768 resolution is bad, after all, with a smaller screen size, the pixel density increases slightly, but its certainly discernible from the retina display of the new iPads.I just find that the form factor is not so significantly different that I'm amazed and delighted by how much I can do with a smaller device.  Nor am I bowled over by its price.  The stereo speakers are there, but no more noticeably louder than my full-sized iPad with only one speaker.  It's really just there.  In other words, it's more of the same and does not give me the satisfaction of an all-new device.  Now, as I mentioned, I love iOS, and the new betas for iOS 7 will definitely spark some more life into this device, but as I look back and forth between my new, new iPad and my new iPad Mini, all I can do is shrug and say, \"Meh...\"Besides a retina display, what can Apple do to make me espouse the iPad mini as \"magical\"?  It's not hard... I want a louder set of speakers (my wife's 7\" Kindle Fire HD has a booming set of speakers), native apps that not only replace or duplicate the ones on a full size iPad, but rather supplement them so if the two units are together, the functionality increases.  For example, what if any two iPads placed next to each other could extend the screen size?  What if I could place my iPad mini next to my full sized iPad and during Facetime, the iPad mini could show my own face full screen while the large iPad showed the other person's (instead of it being in a little window)?  Finally, they should drop the price by another $50-$75 or, god-forbid, increase the new full sized iPads by $100 to differentiate the price points.Right now, this fanboy is not the world's biggest fan of the iPad mini.  Will I keep it?  Of course, but just until the next one is released.  I have to own each iteration of these devices after all.  However, am I feeling more than just a bit lured by the new Google and Asus tablets...? You'd better believe it.  I'm looking for different, newer, better, more innovative.  One more version, I tell myself... but for the time, I won't recommend an iPad mini if you already own the full-sized iPad.  It's a downgrade.UPDATE: February 2014Now that I also own the iPad Air and Retina iPad Mini, my conclusion is that Apple is starting to fall from grace.  The build quality of the devices continue to be among the industry's very best but innovation seems to have slowed to a near halt.  One more generation of iPhones, iPad and Apple TV for me coming up and if I'm no longer impressed, they will then have lost my business, but more importantly, my brand loyalty.  Having sunk thousands into the Apple ecosystem, I am now realizing they are no longer the company they were between 2007-2011.", "Title": "Meh.. Wait for the retina display version", "Date": "August 1, 2013"}, {"Author": "Panthera \"Dogs believe they are human. Cats b...", "ReviewID": "R2B1U16Z9YHSDC", "Overall": "1.0", "Content": "Buyer Beware! No where in the product description does it say the product you receive may be used. Mine was. The back was scratched even though the ipad was packaged correctly. Not just one scratch but a group of them. In one small section there was a small gouge.I returned it to Amazon the same day it arrived and went to the Apple store to purchase the ipad mini.", "Title": "Product was USED", "Date": "June 25, 2013"}, {"Author": "Wyatt J. Thurston", "ReviewID": "RIEXMZ5OSH022", "Overall": "5.0", "Content": "I have to admit, I've started to become an Apple fanboy. After my poor experience with the Nexus 7 I went with the overpriced iPad. I love my iPhone, but wasn't looking to essentially get a bigger version of it (with a wi-fi only model). While they are very similar devices, I have found unique uses for my iPad. First off, there are an excellent selection of apps, a huge advantage the App store has over Google Play. I have one for taking handwritten notes, organizing my notes, performing sit ups, scanning documents, reading articles, books, and comics, utilizing Google Drive, dating and playing some games. Android devices have many of these features, but not the quantity or quality.The iPad itself performs well. Switching between screens and using the new iOS 7 changes have been fine. Of course, there are some changes I do not like, but that's not particular to this machine. I prefer the mini sized iPad versus the normal size for holding and travel. It's light and doesn't take up much space. The screen is wonderful for reading and takes decent pictures.Overpriced it is, I still think it's a great tablet. When the iPad was revealed years ago I couldn't imagine anyone wanting one. Now owning one I understand the appeal.", "Title": "iPads are the tablets to get", "Date": "November 17, 2013"}, {"Author": "Michael Tiberius Brown", "ReviewID": "R2KMM14JWH7QZ6", "Overall": "3.0", "Content": "First off the advertising that was sent out on this device said over \"275,000 Apps to choose from\" that is incorrect - as I found out calling Apple tech support one day.Although they say they will \"eventually\" make them available to the mini - I believe it to be false advertising myself.Next is the considerable failure on its connectivity to anything other than a mac pc, I have had to remove apps, photos and music and had to reinstall them over more than once - without an explaination from Apple support this takes considerable time.Overall its more sleek and compact than the larger version of the IPAD - but for the amount of headache I've had from it - it will be sometime before I ever buy from Apple again.Their are certainly better and less expensive tablets on the market - ones that you will not have to pay extra once the battery life gives out on your IPAD - guess thats one way Apple can keep its \"loyal\" customers.", "Title": "I'd wait if I was you.", "Date": "December 18, 2012"}, {"Author": "gsisson", "ReviewID": "RILCUTOL62J2I", "Overall": "5.0", "Content": "I'm actually an android user, still prefer the android way. But this hardware is really something. Increadibly fast, very satisfied with the weight. ios7 is amazing.", "Title": "First time using ios", "Date": "October 15, 2013"}, {"Author": "reviewmeister", "ReviewID": "R2WH7DB9RJQU2L", "Overall": "5.0", "Content": "My wife got an iPad 2 as a gift. She has an iPhone as well so she let me use the iPad 2 and I was immediately hooked! The problem with with iPad 2 is it's too big and heavy. So I got myself an iPad mini it's much lighter and easier to lounge at the couch with.Also we have a small house so I thought maybe this could replace our PC. So now we no longer have a home PC. I can do everything I need with my iPad mini. Banking, surfing, bill paying, watch shows etc.Thank you Apple for the mini!It's much better than the regular old bulky iPad", "Title": "BEST MOBILE TABLET", "Date": "October 10, 2013"}, {"Author": "Rio", "ReviewID": "R6FDA4ZG8LCBO", "Overall": "5.0", "Content": "Regardless of the hype Microsoft has given their new Windows platform, the iPad is still the best. I bought the mini to replace my old iPad and after comparing tablets, I stayed with Apple. I love the mini for a number of reasons, primarily because of the operating system and ease of use. Windows is just not as good.", "Title": "iPad Rules!", "Date": "October 10, 2013"}, {"Author": "Kathi R", "ReviewID": "R328G9X83PB95R", "Overall": "5.0", "Content": "I am a happy Apple fan. I have a MacBookPro & an iPhone 4S, 16 GB. A priority for me is having products that do what I want understandably, reliably & w convenient, knowledgable & quick tech support if needed. I have found Apple products are that way so didn't even consider any other brands.I find that the specs for this & the iPhone 4S are somewhat similar--processor, camera, etc & I got the 16 GB version for both.I was using my MacBookPro for business & to show a presentation at the table. But, while very light for a laptop, it still was big to carry around.I find that now I don't even turn on my Mac every day. I can browse email & the web & a lot of apps just fine on it.Since I'm new to the iPad, I wasn't sure just how useful it would be. Well it is. It makes a good e-book reader. Although only have a couple so far. I got the Kindle app since one e-book I wanted needed that format.I also is a very nice size to carry around w me. I got a new purse that is not large but has a pocket on the outside into which the iPad mini in its case just fits.I also like that I can do iMessages on all 3 of my devices & while I can do things on the iPhone, the iPad mini is much easier to read & type on.I bought the Belkin case at BestBuy that looks like a pad folio w snap in holder for the iPad. So its not totally obvious that its an iPad, looks nice & both protects & provides a nice stand for it that works well on table or on my lap.I'm also using my iPad mini rather than a hard cover bible for church, using the YouVersion app. The combo is agile enough to jump around to different passages & easier to carry.As one who is a touch typist, I was concerned about whether I would need an external keyboard, but have found that I can type pretty well on it. Not quite usual fingering--more like several finger typing but have been able to use it to take notes at seminars & meetings. This using the Pages app. I also have purchased the Keynote Ap thinking I would use it, but really use the free Slide Shark to handle a co presentation.  I'm thinking of purchasing the Numbers app. Need to review how to sync the Apple apps between the mini & my Mac.As far as connectors, don't have the myriad of Apple accessories that some are concerned about. I had previously gotten the InCase car charger from the Apple store for my iPhone (after the one I got at Walmart quit working after 8 mo). This is the kind that is in 2 pieces so one plugs into the car power outlet & then any usb plug can plug into it.  So if my iPad Mini needs charging, I can use its cord to plug into the outlet & charge in the car.Also, I bought it at the Apple Store & since I had One to One through my Mac, I could use it to learn my iPhone & my iPad. Unfortunately having recently moved to Portland, OR, the Apple Store is way across town so not as convenient as I was used to. Haven't been there yet. I need to go as sometimes I tap to close a Safari window or click on a link w no response. So should get the touch screen checked (as I did w the touchpad on my previous MacBookPro where they find certain portions not responsive & fixed it, quickly.Speaking of the Apple Store, I like the fact that I have that resource--even though now its less convenient than it was.  This is 1 reason that I like Apple products. If there is an issue,  I remember w other devices (Windows computers & Windows phone) where the service was not very good. My windows phone had major issues (couldn't properly handle daylight savings time & other issues). Verizon people were nice but didn't really help so got runaround & some never did get answers.  They knew a lot of basic stuff, but now w smart phones, they can't know all of them well.Also previously w a device from 1 co & OS from another & then other apps, I have gotten the run around w each blaming the other & being caught between them. Or maybe not even blaming the other but having to make multiple contacts to get an answer.I have found Apple Stores to be on top of things & their service turn around time is very fast--several times faster than they had promised.The other thing w Apple products that I have found is that they just work. I've had hardware & software failures w other computers & phones. I got my iPad Mini I think in early March. Working fine. My iPhone 4S is 22 mo old & working fine (they had to do a reset & upgrade to iOS6 1 time, quickly taken care of at the Apple Store).So for me, having products that do what I want, reliably & w tech support that quickly takes care of any issues that may arise is very important. I had not found that level of reliability & tech support w other products. I expect the same level of continued reliability & service if needed w my iPad Mini.", "Title": "Constantly using my iPad mini, reliable Apple product", "Date": "September 28, 2013"}, {"Author": "A Guy in Indianapolis", "ReviewID": "R3J5LJI5PL2B7Z", "Overall": "5.0", "Content": "Pros: Lightweight but solid-feeling.  Easy to hold in one hand.  Lots of cool apps at the App Store.  Operating system runs fast and rarely crashes.  Movies from Amazon Prime look awesome.  I have pretty much stopped using my PC now that I have this.Cons: High price- I got the 32 gig at Meijer when they were having 35% off if you open a charge account, otherwise I couldn't have afforded it.  Crappy sound through speakers, but ok with earbuds.  Rear facing camera not nearly as high quality as front facing camera.", "Title": "Excellent device", "Date": "September 17, 2013"}, {"Author": "JoeBotts \"bottieri\"", "ReviewID": "R2HSIJ3U6RF9XK", "Overall": "5.0", "Content": "I love this mini-iPad. It's small enough to hold in one hand (as compared to the standard iPad) and yet big enough to actually see and use (as compared to my iPhone).I keep it next to my favorite chair so I can check and respond to email without having to go to my desktop computer.", "Title": "Great little computer", "Date": "September 13, 2013"}, {"Author": "Buck", "ReviewID": "R3SSFN1ZXND1DK", "Overall": "5.0", "Content": "My iPad one original died. Even the 'geniuses' bar couldn't revive it. I didn't know what to do. I was addicted. My only complaint with the original was that it was too big to handily fit on my person. The mini gave me that quality, and more. Additionally, it has 'Siri' and two cameras, which of course the original didn't. The price was half a replacement and all my old aps worked fine. It was easy to pick up where I left off, I just downloaded my latest back-up and it was like I had my original back with all the extra niceties mentioned above. It came overnight, I barely went through withdrawal.", "Title": "This replaced an iPad one/original", "Date": "September 13, 2013"}, {"Author": "::TRIX::", "ReviewID": "RTSZW9NQPT0EC", "Overall": "5.0", "Content": "This is worth it. Plain and simple. RETINA or NO RETINA...who cares! I does exactly what I need it to do and its size and weight are the cherry on top. I only wish I would have bought the 32GB instead, but 16GB is doing me fine for the most part, just have to stream and email certain things instead. I think its for the best though, keeps me focused (which is why I bought this, for work mainly). But I love it!", "Title": "What the iPad should have been when it first came out!", "Date": "September 12, 2013"}, {"Author": "Jonah Koonce", "ReviewID": "R3U0I4J8R3HX6E", "Overall": "5.0", "Content": "I've always loved the iPad, but never bought one for myself because it wasn't really portable enough. I'd rather just use my laptop or my iPod. But now my little iPad is the perfect medium-size for everything that I do. I was at first disappointed that it didn't have a Retina display (most likely will come out in a new model), but honestly I hardly notice. The screen is much sharper than the iPad 2 display. You only see the pixels if you look really hard, but from a normal viewing distance it is unnoticeable. I love my iPad, definitely recommended!", "Title": "Just right for me!", "Date": "September 10, 2013"}, {"Author": "Kimmistu", "ReviewID": "R3FGE5K2G7GJ6O", "Overall": "5.0", "Content": "Love my new mini iPad! Great for travel & the Grandkids! It's a Birthday to myself with a little help from my hubby.", "Title": "Happy Birthday to Me!", "Date": "July 8, 2013"}, {"Author": "Carlos Alberto Poe", "ReviewID": "R3A7DPZ88VL40G", "Overall": "5.0", "Content": "I Was waiting for this size of iPad is very confortable, fast and light weight, in my bed is nice to read, my daughter loves the sound when her music plays.", "Title": "Perfect size and weight", "Date": "July 8, 2013"}, {"Author": "K", "ReviewID": "RUBNP353D5AKU", "Overall": "4.0", "Content": "I am in love!!! i orginally own a ipad 2 and loved it but it felt so heavy! i would ALWAYS leave my ipad 2 at home because it felt too heavy in my purse. 1 day i was out and had my ipad 2 with me and literally stopped what i was doing, drove home just to drop off my ipad 2 because it was hurting my shoulders.so when the ipad mini came out i couldnt wait to get it. but i didnt get it right away because after reading reviews many said it was no reason to upgrade from ipad 2 to ipad mini. but i kept thinking about the ipad mini because im like a tablet is made to be mobile not made to be for home use like a pcso i gave in finally and just got this ipad mini!! and i love it.  there is a difference of screen coming from ipad 2 to ipad mini nut you forget about it by feeling its weight. the ipad mini is soo much lighter than the ipad 2 ! i can now finally take my ipad mini with me in my purse and i dont feel the weight of it at allif you re unsure to get the ipad mini from a ipad 2 do it! you wont regret it.i have ios 7 beta on it and its lovely makes it feel like a whole new systemi take this ipad with me 90 percent of the time the only time i dont take it is when im not carrying a purse. it holds everything for me from my grocery list, to schedules, to movies to photos n etcwhen im out waiting i just pull out my ipad mini and im no longer bored!the ipad mini is a great investment go for it! and the reason why i didnt choose other tablets is 1. i already know apple products since i have an iphone n a macbook 2. although other tablets may be cheaper i dont have patience or nerves for there flawsi brought my mother a tablet another brand and just to set it up for her i hated it. the screen was soo not responsive i had to tap so many times that my fingers hurt. a tocuh is suppose to be that, touch screen and easy to touch and apple has that which why i think its more pricer.anyhow im enjoying my ipad mini and i wish i didnt take so long to get it. its the 1st thing i pic up when i wake up and the last thing before i go to sleepi love it and you will too", "Title": "Its my heart", "Date": "July 3, 2013"}, {"Author": "J. Cartwright \"jcart\"", "ReviewID": "RYTXIAQUEZVY5", "Overall": "5.0", "Content": "This is an iPad 2 on steroids. It's smaller, but faster, has a better camera, and has Siri. Lightweight, fits in a purse or cargo pocket, makes a great GPS device for driving because you can actually see the items on the screen, due to its larger size than any dedicated GPS device. But you'll need a SIM card for live guidance. Otherwise you'll need to plot your course while on wireless somewhere and pull up the saved directions on the way. Or tether it your cell phone if you're able to.This is a great size for kids because its lightweight and the smaller form factor makes it easier for little hands to manage.", "Title": "Perfect size, all the Apple bells and whistles for less", "Date": "June 30, 2013"}, {"Author": "N. Lee \"Kindle lover\"", "ReviewID": "R27KAIG3K2G4RQ", "Overall": "5.0", "Content": "I love it. It has everything my iPad  has and more.  It's lighter too.. No regrets. I am an Apple lover.", "Title": "Better than regular iPad", "Date": "June 29, 2013"}, {"Author": "Andrea Polk", "ReviewID": "R3POL2Q9JHE14R", "Overall": "4.0", "Content": "I have an Apple iPad MC707LL/A (64GB, Wi-Fi, Black) 3rd Generation, iPhone 4S, Apple iPod touch 16GB Black/Silver (5th Generation) NEWEST MODEL, and a Apple TV MD199LL/A which through AirPlay integrates programming and iTunes onto my TV.So why buy the iPad mini?For me it was the 5mp iSight camera (1080P video capable), screen size and portability.  The iSight camera takes fantastic photos, and through Photo Stream (enabled on your device) you are able to share up to 1000 photos with others on your network. (Beautiful video quality too!  Get the Action Movie FX app to have a lot of fun posting to Facebook.)  The iPod touch 5th does have the iSight camera too, but a 4\" screen, which for me is a tad small to see and edit photos as I would like to do.The mini's 7.9\" screen size is very functional for 'on the go' email, photo viewing, games and makes reading my Kindle books (free Kindle app available) much more enjoyable.Overall dimensions of the device make it very slim and lightweight, making slipping it into my purse or backpack a breeze.Height:7.87 inches (200 mm)Width:5.3 inches (134.7 mm)Depth:0.28 inch (7.2 mm)Weight:0.68 pound (308 g)The Apple iPad mini pairs easily with Bluetooth devices like keyboards and headsets too.  I don't really see the point in pairing with a keyboard, as with this screen size typing up a term paper is possible - but not likely.  However, pairing with a stereo Bluetooth headset to enjoy a movie or listen to music works really well and makes for fun entertainment during the morning commute. (Assuming you're not driving!)Facetime (720P) works well on the mini, as does emailing - assuming you have a solid Wifi connection; 802.11a/b/g/n Wi-Fi (802.11n 2.4GHz and 5GHz). NOTE: Many apps and functions of all iOS devices, depend upon Wifi to be enabled and to have a solid connection before they will work correctly.Good news for anyone who wants to enjoy this device.Like the iPad, the mini has accessibility features that allow users with disabilities to use the device.  Including...VoiceOver screen readerGuided AccessSupport for playback of closed-captioned contentAssistiveTouch interface for adaptive accessoriesFull-screen zoom magnificationLarge textOption to invert colorsBuilt-in apps get you started enjoying the mini right out of the box, without having to download apps.  They include...Safari - web browser that's fast and has Google set by default.PhotosApp Store - make sure you have your Apple ID ready to grab free and paid apps.Maps - turn on location in settings to use Wifi for directions.Photo BoothReminders - useful for keeping yourself on track.CameraMailFaceTime - a great alternative to Skype.iTunesMusic - sync with your PC or Mac and make sure 'sync' is checked when you do to upload your music to your device.ClockCalendar - integrates with MS Outlook 2010.Messages - send text, voice or photos to others with 'i' devices, and save on cellular data fees!NewsstandVideosGame CenterContacts - use iCloud to store your contacts, messages, emails, photos and do back-ups.  *Free 5GB of iCloud is yours!NotesSECURITY APP TIP: get the free 'Find My iPhone' app (works with iPads too...) and set up a passcode to limit access to your settings so that this app cannot be disabled should your device be stolen or lost.  By using this free app you are able to locate the device (a general area) when it connects to the Internet.  You can also disable the device so that if stolen, it's not going to be 'enjoyed'!Students, commuters, frequent travelers, and gadget lovers will adore the iPad mini for it's highly portable fun and functionality.Those seeking a tablet for working on spreadsheets or writing a novel, go get an iPad instead.iPad mini cases I like...OtterBox Defender Series Hybrid Case for iPad Mini - Black (77-23834) - for those who want extra 'bump' protection!  The only negative to this one is no 'magnetic' sleep function because it doesn't have a cover, it has a built-in screen protector instead.Snugg iPad Mini Leather Case Cover and Flip Stand with Elastic Hand Strap and Premium Nubuck Fibre Interior ('Distressed' Brown) - Automatically Wakes and Puts the iPad Mini to Sleep - fits well, looks good, and has the sleep/wake feature via a magnetic closure. Well padded, but it doesn't provide the same 'bump and drop' protection as the Otterbox Defender.", "Title": "Portability, great camera, with iPad fun and function", "Date": "June 20, 2013"}, {"Author": "Brandon", "ReviewID": "R30QPM6Q34KTOG", "Overall": "4.0", "Content": "Yes, it doesn't have the retina display but for my uses it doesn't make a lot of difference. Form factor and mobility sold it for me and I couldn't be happier with it.", "Title": "Awesome", "Date": "May 19, 2013"}, {"Author": "Blossom", "ReviewID": "R2I1OZIA0JRT71", "Overall": "5.0", "Content": "I must say that when iPads came out in general I saw no use for them and I am an Apple lover. When I first viewed these in the store, I thought wow it's so small! I must say that now that I've purchased one, it truly is the perfect size. The other one seems too big now! Lol. I will say that it is a bit tough trying to type in landscape mode, but it is doable.Great product.", "Title": "Love it !", "Date": "May 18, 2013"}, {"Author": "Randy Dunbeck \"exmp2uno\"", "ReviewID": "R3MFA0M6YE47RZ", "Overall": "5.0", "Content": "A lot easier to use than I expected. it almost does it all! Compact and versitile, battery life is exceptional. I don't know how I managed without it", "Title": "Awesome", "Date": "May 18, 2013"}, {"Author": "DG", "ReviewID": "R1UZNTH89MF1EF", "Overall": "5.0", "Content": "Love it so much I traded my android phone in for the iPhone 5!  Fits in my purse. Great response time. Awesome picture and sound.", "Title": "Love it!", "Date": "March 25, 2013"}, {"Author": "Alexandre S Steinberg", "ReviewID": "R3CNYJHVKHFUQW", "Overall": "5.0", "Content": "The same great functionality and applications of iPad in a perfect size.The smaller display is enought for most tasks and much better to read on bed or to carry for a meeting.", "Title": "Perfect size!", "Date": "March 24, 2013"}, {"Author": "Amber Mark", "ReviewID": "R1UQ13IIMQU5W", "Overall": "5.0", "Content": "I love the mini. It's so compact and easy to use. Might get one for my 2 year old. She loves fruit ninja!!", "Title": "Perfect size!!", "Date": "March 22, 2013"}, {"Author": "Ronda Corriher", "ReviewID": "RUQCAW18G1KZD", "Overall": "5.0", "Content": "I really love my Ipad mini.  It is lightweight and small enough to carry in my purse.  I take it everywhere.", "Title": "Love it", "Date": "March 20, 2013"}, {"Author": "Tamee33", "ReviewID": "R2FNF9F9AO3EEG", "Overall": "5.0", "Content": "I am just now on the cusp of what this thing can do. The best part is that I can hold it and type at the same time. It fits in my purse, and it runs FAST! Never have had any issues with it, and I've had it since Christmas.", "Title": "Have it! Love it!", "Date": "March 10, 2013"}, {"Author": "Tammy Wynn", "ReviewID": "R1LDA8OW77LA00", "Overall": "5.0", "Content": "Convenient. Highly recommend! Fits in purse but bigger than phone so easier to read than iPhone. Cheaper than iPad! I cloud for family calendar sinc.", "Title": "Convenient, small enough to fit in purse", "Date": "March 10, 2013"}, {"Author": "overbybr", "ReviewID": "R2VY4TD8ROQ6JD", "Overall": "5.0", "Content": "So much better than the standard iPad! The form factor of the Mini is exactly what I have been waiting for, and it will be a gadget that I will keep for a long time. If it breaks, I'll get another one!", "Title": "Awesome!", "Date": "March 5, 2013"}, {"Author": "SanPa", "ReviewID": "R25J6SOTJQYFEV", "Overall": "5.0", "Content": "I bought the mini as a gift for my wife.  She loves it.Why the mini? Because it ergonomically better v.v. less fatigue when hand held, particularly for users with smaller hands.  The CPU responsiveness is good, the screen is sharp with crisp refresh, networking is a cinch to set up, and touch controls while seemingly  less sensitive than a large screen do afford good digital resolution.My wife has been using the iPad at home and on the job.  When used at home, she scans the news and researches topics for future lessons.  At work, she as example used a clever wave motion app to demonstrate physical principles of wave motion to her students.  Predictably, a third of her students had downloaded the app onto their iPhones within 5 minutes ... that's engagement! And, that she's using the iPad to demo scientific principles in the classroom ... very cool per her students.I think this gift earned a few extra brownie points, or at least one get out of the doghouse credit.", "Title": "Its a Hit", "Date": "March 2, 2013"}, {"Author": "OLGA AGUADO", "ReviewID": "R1U68KNQTCGA5Z", "Overall": "5.0", "Content": "Fast, simple, smart, fun, lightweight, dont have Bad luck but have a cloud no the top!This buy is a gift of my mother in your birthday... She have 60 years and she hope learn your emailsIn the ir romm.Se open the box, setting the ipad, connetct the wifi... And enjoyTahonas steve jobs...", "Title": "Power in my hand", "Date": "March 2, 2013"}, {"Author": "Michele A. Hopper", "ReviewID": "R9R4UMXWR7L3Y", "Overall": "5.0", "Content": "It is all I need. I am loving it. I wish I could have gotten one sooner.. the graphic are wonderful. Thank You", "Title": "Ipad", "Date": "February 26, 2013"}, {"Author": "Jen", "ReviewID": "R2F9T9E66U4A1N", "Overall": "5.0", "Content": "Absolutely love my iPad. The mini is a perfect size and can easily fit in a large purse for bringing to work or when traveling. One of my favorite Apple purchases", "Title": "Love my iPad", "Date": "November 3, 2013"}, {"Author": "sondra crist", "ReviewID": "R20905Z13I949H", "Overall": "5.0", "Content": "Loading we pages, especially YouTube, is painfully slow sinc the new IOS7. If it hadn't been, so incredibly quick, before the update, I wouldn't  have known the difference.Mine, also has the quirk, of sometimes randomly deleting all notes, on my notepad.  Annoying, so I have learned, to email notes, to myself, to save them.Other, than those two things, it's like having an iPhone, that's twice as large. I love it and will get a new one, in two years.", "Title": "LOVED my iPad Mini, until the new IOS7 update", "Date": "October 27, 2013"}, {"Author": "Mel", "ReviewID": "R2B4HFLS0D2TRA", "Overall": "5.0", "Content": "Great little device and delivery service was excellent.  Could have waited for the new ipad, but this little machine is great. I like Apple", "Title": "Bought as a gift", "Date": "October 26, 2013"}, {"Author": "Nabeel", "ReviewID": "R18LXGW1NRO2U9", "Overall": "5.0", "Content": "As described. I got it 50 usd cheap and still got the ipad winch was almost new. Actually no one could even tell it was not new as the packing and everything was as good as new one", "Title": "Loved it", "Date": "October 23, 2013"}, {"Author": "Sherie McArthur", "ReviewID": "R125UYRIO0LKJ1", "Overall": "5.0", "Content": "Brought this item as a gift for my mother on her birthday and she absolutely loves it.  It arrived very early which was a plus!", "Title": "Great item, great seller", "Date": "October 23, 2013"}, {"Author": "Dallas", "ReviewID": "R1UH6R6DMMBEAB", "Overall": "5.0", "Content": "I bought this mini iPad remanufactured and it looks brand-new. I don't have any complaints at all so far and have had about three weeks. The battery life impresses me and seems like leaving it turned on, it can last for two days or so before it even gets close to 50%.I like the speed, the way videos look when watching Netflix or Amazon prime, etc. it has not crashed or froze up on me so far.I would definitely recommend buying a case for it, without a doubt. I bought a $20 case and it isn't bad, it just has a hard time staying open and keeping the iPad propped up when watching a movie. So spend a little bit more and get one that definitely keeps it in a position for when you watch movies.", "Title": "I like the size of this better than the regular iPad", "Date": "October 22, 2013"}, {"Author": "William Craig Ramsdell", "ReviewID": "R174C8S9D00Q03", "Overall": "5.0", "Content": "We own several Apple products, iPhones, iPads to Macmini.  The iPad Mini is more convenient to carry than the iPad and with a much bigger screen than the iPhone.", "Title": "Nice Mid-Size iPad", "Date": "October 22, 2013"}, {"Author": "hemi dude", "ReviewID": "R3PJ67UJQG7AC8", "Overall": "5.0", "Content": "The IPad mini arrived in perfect condition sooner than expected!  It looks brand new, fresh out if the box!  A perfect experience!", "Title": "iPad was perfect!!!", "Date": "October 22, 2013"}, {"Author": "Gloria", "ReviewID": "R3K76SYHG0PS4G", "Overall": "5.0", "Content": "We were blown away by this tablet.  It is small yet does so much!!  We use it with an App that allows us to get charts, weather and traffic when we fly our own airplane.  It was compact enough to mount along side our other instruments.  The Apps available are endless and amazing!!  This was a great purchase.", "Title": "The Apps make it the best Copilot!!", "Date": "October 21, 2013"}, {"Author": "PR-EP \"Music Lover\"", "ReviewID": "RQ3VQ9E2NA1KG", "Overall": "5.0", "Content": "I love my iPad Mini - it is exactly what I anticipated.  The retailer who I purchased it from was also top quality.  It shipped right on time and I received it within a matter of days.  I couldn't be happier with both the product and the retailer.", "Title": "Love it!", "Date": "October 20, 2013"}, {"Author": "kristy thompson", "ReviewID": "R202B4H289DQPT", "Overall": "5.0", "Content": "It is perfect. It got here fast and the price was unbeatable. I would highly recommend this company and I will use them again", "Title": "Apple ipad mini refurbished", "Date": "May 1, 2013"}, {"Author": "gmcl", "ReviewID": "R2KGNE9LEV5AMA", "Overall": "5.0", "Content": "I bought this for my fiancee for her birthday and she absolutely loves it, she can't put it down...I think I made a good choice.", "Title": "Great investment", "Date": "May 1, 2013"}, {"Author": "Yvette", "ReviewID": "R1W1KQHR0SALN9", "Overall": "5.0", "Content": "I am enjoying my iPad mini. I can now carry everything I have on my iPad in my purse. The order was delivery with promptness and in great quality.", "Title": "My iPad has a baby", "Date": "April 29, 2013"}, {"Author": "Patrick shuff", "ReviewID": "RRHXTXO7HLRJ6", "Overall": "4.0", "Content": "I've had the original since it first came out and I still absolutely love it and still use it daily for ready books on kindle and consuming news before bed.  The only reason I decided to get another iPad is for facetime.  The mini works as I would expect and the only thing that I do not like is I feel like the battery is somewhat weak compared to the original iPad.", "Title": "Works as expected.  Awesome for reading books and consuming content.", "Date": "April 19, 2013"}, {"Author": "K Garred \"BookGirl41\"", "ReviewID": "R24P4G5AGVOWIL", "Overall": "5.0", "Content": "I had an original ipad and thought it was very nice but the size of the mini is perfect.  I've used this product everyday since I got it.", "Title": "Love the Mini", "Date": "April 11, 2013"}, {"Author": "Soho66 \"Martini\"", "ReviewID": "R1LUWYU1YMAOFW", "Overall": "5.0", "Content": "I am no where near a tech guru.  I have a Samsung Galaxy Stellar and  a Windows based Dell PC.  So purchasing anything Mac is having to learn to do things differently, of course as far as compatibility with apps, etc.  This is a treat for my senses and I love it.  I am just starting to scratch the surface with all that you can do with this product to begin with.  I graduated just before computers started to be used in schools and became the norm for the generation after me.  I learned on an Apple but haven't been able to afford them since. I am good at learning as I go I am not afraid to press the a button and ask questions later to get to where I want to be so I do travel somewhat dangerously but for me that is how I discover the best things on an unknown device.  Push and read directions late is my motto.  Haven't ruined anything irreparably as yet.It is more enjoyable for me and I do understand the price range in comparison to my experiences it does seem fair.  I do think that the Mac offers a much cleaner, organized, classier, user friendly....etc. etc. version above the competition.  I had no idea that the things I can do on this even existed technologically so that should tell you I'm somewhat jaded from lack of my limited tech frontiers and how much things have really changed since 1984 when I graduated.  Trying to keep up is hard because it keeps changing faster and faster.  So I'll hang on until I'm to old to care or remember what my password is.", "Title": "Very pleasantly surprised", "Date": "April 6, 2013"}, {"Author": "V. Suryanarayanan", "ReviewID": "R20VHWT0O24PSF", "Overall": "5.0", "Content": "I love my iPad-mini.  I use it primarily as my reading device and for web browsing.  I also watch Netflix or Amazon videos on it and use all my banking apps.  Great user experience!", "Title": "Great Product", "Date": "April 4, 2013"}, {"Author": "ravenjanee1", "ReviewID": "R2FXYIDP2PIJ0J", "Overall": "5.0", "Content": "The iPad mini 64gb is my 3rd ipad...I've had the first and second ipad and I loved them. I will admit I was the main person saying how stupid it was for apple to come out with an ipad mini and I was wrong! After reading reviews I decided to upgrade my 2nd generation ipad to an ipad mini and I must say I'm impressed. When I went to the apple store I looked at the ipad mini and ipad 4 and I didn't notice a severe difference between the retina screen and ipad mini screen. I love my mini it's so light weight and I put it in my purse and literally take it every where. I use to do the same with my ipad 2nd generation but it was very heavy. If you're looking to buy something that is portable light weight and to replace anything that you already have this is it. I'm a college student and I use my mini more than I use my laptop...I have my textbooks on it write papers read powerpoints listen to lectures and record my teachers in class on it. I also read books magazines and watch tv and movies on it as well as playing games and sketching. \"addicted to sims and cut the rope\". My roommate and I have figured out how to do so much on these ipads that we barely use a computer or paper anymore. I would highly recommend this ipad to anyone. I don't feel like I \"down graded\" at all by replacing my ipad 2 with my mini it was a great trade off. I love it and hope that my review swayed any doubters into purchasing. I'm truly obsessed with it. Griffin Technology Survivor for iPad Mini, Black/Black (GB35918) <<<--- link to my favorite case that I highly recommend as well.", "Title": "Love my mini <3", "Date": "April 3, 2013"}, {"Author": "sgun73 \"Steve\"", "ReviewID": "R1OLGP0FMA0ISN", "Overall": "5.0", "Content": "When I first saw the iPad mini I thought people would be crazy to pay $329. I thought you'd get a lot less in a tablet but spend more money. I was very wrong. After just one day I freaking love this thing. It's such a high level of quality in a smaller size that I could see paying $349 for it. It's almost freakishly thin and light. It might be alien technology actually.I picked up the white version and its fantastic. Awesome aluminum back with a very sharp chrome bezel around the front edges. Even though its not a retina display I have no problem with it at all. The picture quality is still great and the colors and images totally pop. At a foot away you wouldn't know the difference.Great to read books. Great to surf the Internet. Great for sending emails and texts. So solid feeling. It doesn't fit in any other category of smaller tablet. And maybe that's the point. Apple chose to go smaller like the other competitors, but at the same time they paved their own path. I'm using this more than my big iPad now.", "Title": "Totally awesome and well worth the $329 price tag!", "Date": "April 1, 2013"}, {"Author": "Andrew", "ReviewID": "R1CBGWEPP021C4", "Overall": "5.0", "Content": "This is a great iPad mini. Almost the perfect one but thereis no perfect.... The battery life is also amazing. Should be good for personal and or buisness use", "Title": "Amazing", "Date": "April 1, 2013"}, {"Author": "T. Farris", "ReviewID": "R273DIT1UVJXR2", "Overall": "4.0", "Content": "I have this iPad Mini, Motorola Xyboard 8.2 & Samsung Note 10.1 2014 edition. out all the 3 I like the Samsung Note the best. Yeah the iPad is cool but it lack functionality that I believe Apple will never add to their tablets. Multitasking & the S-Pen is a major plus and the resolution is outstanding, Expandable memory, I can go on and on but I don't have the time to do so.I gave the iPad mini to my 9 year old son. He likes it because most of his friend have been brain washed my apple. My son said he would rather have my Samsung or Motorola but those are mine.", "Title": "Apple hype is just that...HYPE.", "Date": "January 1, 2014"}, {"Author": "Mr. J. Gill", "ReviewID": "R3T6CNSTZAKAZO", "Overall": "5.0", "Content": "Realised after I bought it that this was the old ipad and not the new one with retina display. I notified the suppliers who refunded my money immediately and without fuss. Thank you for the excellent service.", "Title": "Not what I wanted but excellent customer service.", "Date": "November 29, 2013"}, {"Author": "Lisa Carter-Harris", "ReviewID": "R3IRWWJWOHTE2B", "Overall": "5.0", "Content": "The iPad Mini is a great little device.  Very versatile and allows me to do multiple things that I would normally do on a laptop on a convenient portable device.", "Title": "Great!!", "Date": "November 26, 2013"}, {"Author": "Cheryl Rios \"cherylm\"", "ReviewID": "R361GVIF7LHDPZ", "Overall": "4.0", "Content": "works great, fits in my purse and the only thing i wish it had was built in wifi, but other than that it is a great tablet.", "Title": "Small but powerful", "Date": "November 19, 2013"}, {"Author": "Rogelio Hernandez", "ReviewID": "R3MFIZD8H1APO5", "Overall": "5.0", "Content": "This ipad was in great condition. i use this everyday, i dont see any scratches and works perfectly as if i bought it brand new from the apple store!!", "Title": "10 out of 10", "Date": "November 4, 2013"}, {"Author": "Lufan Liu", "ReviewID": "R25WILGBESND5C", "Overall": "5.0", "Content": "What else can I say? It came in perfect condition. The packaging was definitely good, and I use this more than I thought I would, even when I already have a smartphone. It's super easy to carry around and I sometimes uses it to take notes in class or check emails real quick.", "Title": "Very good", "Date": "November 4, 2013"}, {"Author": "Joseph Pete", "ReviewID": "R133G1PDANMAZ0", "Overall": "2.0", "Content": "The iPad works as i expected. There is only one problem: the screen is a little squishy in the upper left corner. You can feel the glass press down and it is a little worriesome. Otherwise im pretty happy with it", "Title": "Screen problems", "Date": "November 4, 2013"}, {"Author": "Nicolette Lovett", "ReviewID": "RG4JKA3092H1I", "Overall": "5.0", "Content": "When I was a kid in the 80's, this would've been awesome on long road trips.  I am thankful for technology advancing as it has - this provided my kids with great entertainment while driving and flying and going on vacations this year.  As for the iPad itself - I'm happy with it.  Easy for little hands to handle and it's just like the regular iPad only a bit smaller.  No issues with it at all!", "Title": "Happier vacations and drives!", "Date": "October 15, 2013"}, {"Author": "Alexandra", "ReviewID": "RN75C0UNOPW9K", "Overall": "5.0", "Content": "Love it its amazing most awesomest iPad it works great and feels like a brand new iPad I would recommend buying it to anyone.", "Title": "Awesome", "Date": "March 19, 2013"}, {"Author": "Joe Mama \"teacher/librarian\"", "ReviewID": "R3AAUS3W4XZ9UN", "Overall": "5.0", "Content": "I already own an iPhone, which I have loved (I've had iPhones since 1st generation) and rely on for so much, even though I'm not a big phone caller.For some reason, I just decided I wanted a wifi iPad, mostly for reading books. Well, this is wonderful--download via wifi, but then I've got the book to read when I want. I kept some of my favorite apps that benefit from a larger screen, as well as apps made especially for iPad.Lightweight, easy to hold.", "Title": "GREAT size, great item!", "Date": "March 17, 2013"}, {"Author": "Michael A King", "ReviewID": "R2WEG7N7E613TR", "Overall": "5.0", "Content": "My wife didn't want it but I got it for her for our anniversary.  She loves it, is watching TV in the kitchen on it, reading books so generally all the other gadgets are sitting in the corner unused.  Best $ I've spend on a gift for her so far and I'd recommend this product to anyone who needs to get something useful that will be used every day.", "Title": "I Pad Mini", "Date": "March 16, 2013"}, {"Author": "william leavy", "ReviewID": "R1ZZHMMYOAX19L", "Overall": "5.0", "Content": "Great product. I got another one for my wife because she liked mine so much!The LTE network is very fast and responsive.", "Title": "great product and the  4G LTE is very fast", "Date": "March 16, 2013"}, {"Author": "burrchristina", "ReviewID": "R16F5CRU8BCEGY", "Overall": "5.0", "Content": "I am really enjoying my BRAND new iPad Mini! This is my first Apple purchase. So far so good! Great quality in videos and camera use! The only problems that I have had is getting use to the software, but it will take time to get used to.Fast WiFiCrisp TextBright ScreenThin and perfect sizeSmooth sliding to one page to another", "Title": "New to Apple", "Date": "March 2, 2013"}, {"Author": "M. Latoris \"scrolls like butter\"", "ReviewID": "R20Q3OUGJ9R9OP", "Overall": "5.0", "Content": "I thought the iPad 2 was pretty sweet but this is sensational. It's the real iPad (in my eyes) - so small and light. Phenominal engineering and wonderful, cheap software.  The iPad Mini is amazing.", "Title": "I cuddle with it in bed, every night", "Date": "February 28, 2013"}, {"Author": "sergio cavallo", "ReviewID": "RGHFELEBML3BY", "Overall": "5.0", "Content": "I receivde the package without problem and it works okIs just what I neededThanks for allbest regards", "Title": "I received the package without problem", "Date": "February 19, 2013"}, {"Author": "Salome M. Mittelman", "ReviewID": "R28S820WMYIP8E", "Overall": "5.0", "Content": "I especially love my IPad Mini.  It is a good weight as I have trouble holding things and it is convenient whenever I need  it.", "Title": "Love it", "Date": "January 30, 2013"}, {"Author": "Peaceful_Inhaler", "ReviewID": "R2A4UGBSUOX9VC", "Overall": "5.0", "Content": "Never turn my laptop on anymore.  Everything pulls up fast, so clear.  I never thought idcenjoybanythingvas much as I do my mini iPad.", "Title": "I love it", "Date": "January 25, 2013"}, {"Author": "RJR967", "ReviewID": "R1S1R3CVHGTRP1", "Overall": "4.0", "Content": "...you should buy it from Apple. Don't pay the inflated prices from secondary sellers. $400+ for the basic Mini? Hahaha! It retails for $329.", "Title": "iPad Mini is great, but...", "Date": "December 26, 2012"}, {"Author": "Dan", "ReviewID": "RHALZZUFCB1M3", "Overall": "5.0", "Content": "What can you say about an apple product. Great price great device. I wish I had another on for the wife.", "Title": "Love it", "Date": "June 10, 2014"}, {"Author": "David E.", "ReviewID": "RV8WOMJCN4J1A", "Overall": "5.0", "Content": "The iPad mini is the perfect size. I bought the ipad 3 retina in day one and it broke. It was to big and awkward. The mini is just right.", "Title": "Best model of the iPad in my opinion.", "Date": "May 19, 2014"}, {"Author": "jeremydehner", "ReviewID": "R3GGXFF48JJS3Z", "Overall": "5.0", "Content": "This is perfect my son to play his games on.  It is portable and has good battery life and my wife can control what is installed by using her apple id on the ipad.", "Title": "My son's favorite thing", "Date": "May 19, 2014"}, {"Author": "Tricia Aline Clelland", "ReviewID": "RFS7W60ZO7BTP", "Overall": "5.0", "Content": "I purchased two of these for Christmas last year. They arrived quickly and in perfect shape. I would recommend buying a nice, durable case for them. They work great, and my kids were thrilled. They use them every day.", "Title": "Great product!", "Date": "May 19, 2014"}, {"Author": "Guillermo Arce", "ReviewID": "RSHEXJFQDAKJ1", "Overall": "4.0", "Content": "Works well. Great apps.  Excelent for trips and patient education at my hospital. I will miss the flash. Thank you Apple.", "Title": "I love the mini I pad.", "Date": "May 19, 2014"}, {"Author": "Sam", "ReviewID": "R2TELZKKI31C48", "Overall": "4.0", "Content": "Great buy.  Great to work with.  Item was in excellent condition and showed up very promptly.  Appreciated the extras included like boxes/containers for accessories.  Highly recommend!!!!", "Title": "Great seller", "Date": "May 18, 2014"}, {"Author": "Reader2008", "ReviewID": "R2XOF0I8AUGP2H", "Overall": "4.0", "Content": "I purchased the big IPad when it first came out and didn't like it.  For the last 3 years I have loved my samsung galaxy tab.  The tab was dropped and started acting funny.  This yr it gave out.  I purchased the newer model tab and hated it.  I ended up purchasing this iPad mini off eBay.  It is great.  The tab took a few minutes to turn on and off.  The mini takes less than a second to turn on and off.  Typing without mistakes on the mini is easy because the screen sensitivity is just right.  Scrolling on the mini is easy too.  The sound is not that great on the mini though.  Galaxy tab is louder and the sound tones are better.  The tab picked up a signal everywhere.  I have to cross my fingers that the mini will pick up a signal.  This confuses me since both of them are on Verizon networks.  Would I recommend?  Yes until galaxy tab fixes the mistakes it has made with the current tab models.  Was it worth the cost?  I got the item used. But I do think we are paying more for the apple name instead of the product itself.  With that said I am typing this review on the mini.  It would have taken forever to type this same review on the galaxy tab.", "Title": "Great tablet!", "Date": "May 18, 2014"}, {"Author": "kathleen", "ReviewID": "R2GZKIGG231MWY", "Overall": "5.0", "Content": "This apple iad mini works so well.  I am typing on it right now.  I can use it wherever there is an internet connection,  also love reading books on it.which is most places.", "Title": "Love it", "Date": "May 17, 2014"}, {"Author": "Danielle", "ReviewID": "R3JDBUVAI0S9H0", "Overall": "5.0", "Content": "So glad I got the mini. I love the compact size because it makes it easy to hold for long periods when I'm reading from my kindle app and easier to transport in my big purse. I highly recommend this product!", "Title": "Love my mini", "Date": "May 17, 2014"}, {"Author": "Bruck Giorgis", "ReviewID": "RLCEDHH7Z9XJC", "Overall": "5.0", "Content": "this is really good item. i am happy to have it. i wish i bought the ipad mini with sim card slot.", "Title": "best item", "Date": "May 13, 2014"}, {"Author": "Denise", "ReviewID": "R21VYR30BCL5PV", "Overall": "5.0", "Content": "I purchased this as a Mother's Day gift for my mom and she loves it! And so do I! It's size makes it so much easier to use. It's responsive ,doesn't lag just great. I went with the 1st generation as oppose to retina display because I don't think it's such a huge difference to spend extra money on. I've always been an android user and never pictured myself buying an iPad but I love it! Definitely recommend.! Shipping was also very fast and packaging was excellent!", "Title": "So far loving it!", "Date": "May 13, 2014"}, {"Author": "Cindy Stevens", "ReviewID": "RLPSNUARL4M2D", "Overall": "5.0", "Content": "I was hesitant to purchase an electronic product that was going to be shipped.  It turned out great and I love my iPad mini.", "Title": "Love it", "Date": "May 13, 2014"}, {"Author": "cristy", "ReviewID": "RTUZ4C8YYYVQC", "Overall": "5.0", "Content": "The tablet was perfectly packed, i liked it a lot and I served as a perfect gift for my mother, it was perfect", "Title": "perfect", "Date": "May 12, 2014"}, {"Author": "G Stone", "ReviewID": "R1QTDDP05DBD7D", "Overall": "5.0", "Content": "Bought this mini iPad to replace my 2nd Gen iPad.  It was worth the price.  Doesn't have a retina display but it sill looks great.", "Title": "Great Price!", "Date": "May 12, 2014"}, {"Author": "FAST FRED \"FAST FRED\"", "ReviewID": "R26LAI1IJ9DIWV", "Overall": "5.0", "Content": "Received the IPad mini beforemy trip. I ordered cable and charge plug too.. So far it working great, it take a charge find and was easy to load and setup . If I had to have another one I buy apple not an android.", "Title": "Ipa mini", "Date": "May 11, 2014"}, {"Author": "Joseph Fernandez", "ReviewID": "R16EAI1N5TPOI3", "Overall": "5.0", "Content": "What is not to like about the ipad mini. I had bought it for my mom and she had fell in love with it as well. Best mother's day gift.", "Title": "love it", "Date": "May 10, 2014"}, {"Author": "Victoria", "ReviewID": "R250FT2G7OE7H7", "Overall": "5.0", "Content": "I love this...I am so glad I decided on the Mini...it is so convenient and easy to throw in my Tote or purse.  I have access to all my files and email.  I will not give up my Laptop and am glad I did not decide on the IPad itself...This is perfect.  Resolution is great.", "Title": "Very Pleased", "Date": "May 9, 2014"}, {"Author": "juan", "ReviewID": "R9BUDN6U43S2E", "Overall": "5.0", "Content": "My wife loves it, it's all good. It's exactly what I ordered what my wife wanted and the shipping was fast", "Title": "Mini pad is all good.", "Date": "May 4, 2014"}, {"Author": "Jackson", "ReviewID": "RY1UNTFXXR9GR", "Overall": "5.0", "Content": "Higher cost product, slightly higher than the same type of product prices, but also watch videos and spend it the ideal choice to find information, it is still acceptable.", "Title": "Higher cost", "Date": "May 4, 2014"}, {"Author": "AMANDA", "ReviewID": "R1VJDD8UX8AWKL", "Overall": "5.0", "Content": "I am very happy with this product. I use it daily. I might order another iPad mini for my Grandaughter.", "Title": "IPad mini", "Date": "May 1, 2014"}, {"Author": "Sooze", "ReviewID": "R12F5R3SJVH21O", "Overall": "5.0", "Content": "I replaced a friend's lost Mini I Pad.  What's not to like?  It's size makes it ideal to carry every where so it is like having the knowledge of the world always at your fingertips (or stylus tip).", "Title": "Gift", "Date": "April 29, 2014"}, {"Author": "harrobwil", "ReviewID": "R38JQ7AXSMLJ7B", "Overall": "5.0", "Content": "She says it is just the right size to carry around and it works the same as the larger IPad. It works great!", "Title": "She loves it!", "Date": "April 29, 2014"}, {"Author": "Marian L. Kirk \"L. Kirk\"", "ReviewID": "R30TE652UHNYBJ", "Overall": "5.0", "Content": "I had been wanting an I pad for quite awhile.  I had my Kindle Fire and loved it but last October I switched to an I phone 5c and wanted the I pad mini for the sinking of apps and books between the two.  The mini is great and I use it everyday. I have the Kindle app on the mini in order to read my current book that is on my original Kindle. I love the mini. It is compact and easy to carry everywhere.  The Wi-Fi is great. My 6 year old grandson and I enjoy the apps we have downloaded on it. I like the new tech electronics and this one is at the top of my list.Marian Kirk", "Title": "My New Toy", "Date": "April 29, 2014"}, {"Author": "susan", "ReviewID": "R203LV7EMDPJFC", "Overall": "5.0", "Content": "I love my new ipad. It is very easy to use and is well made and nice looking. I would buy again but maybe get the 4G with more memory.", "Title": "very pleased", "Date": "April 29, 2014"}, {"Author": "Donna Merriman \"DonnaLynn\"", "ReviewID": "R2UOY3DXGS9Q79", "Overall": "5.0", "Content": "I bought the iPad mini as the original is very heavy and harder to handle. I also did not have wifi on my original iPad. I have traveled twice with my iPad mini and it has been awesome. It is exactly the right size and I had no problems using it to check my email and messages while out of town. I actually have been using it everyday as I am now used to the smaller size and find I prefer that to my larger one. Very happy I made this purchase.", "Title": "Awesome", "Date": "April 28, 2014"}, {"Author": "LEAH ASARO", "ReviewID": "R10W2KFJ90I2MR", "Overall": "5.0", "Content": "I like the silver the best, the front border is white. I ordered 2 space grey iPad Minis for my daughters at Christmas. My husband also has silver. Wish I could use more than one app at a time but this works well. Lots of free apps and games. Visual is not affected by the sun as seen on TV.", "Title": "Love my iPad Mini", "Date": "April 6, 2014"}, {"Author": "LIN", "ReviewID": "R3CRKXZZIE12H8", "Overall": "5.0", "Content": "It was a birthday gift for my sister.I got one for my birthday last year and love mine so I thought it would be a great gift for my sister.She loves it !", "Title": "I got one and love it!", "Date": "April 5, 2014"}, {"Author": "Irma", "ReviewID": "R1WYM8KJW9HUE6", "Overall": "5.0", "Content": "Got this one for my daughter she  is Autistic , we took it to disneyland and save our lives! My daughter loved it! So easy to use, perfect size, picture and volume. Very happy :)", "Title": "Love it!", "Date": "April 5, 2014"}, {"Author": "karen lidgard", "ReviewID": "R1MGXS52HTSCQ", "Overall": "5.0", "Content": "This was a gift for my sister and she loves it.  The seller was correct in everything he had stated about it.  Even though it was a store display it was in perfect condition and would buy from him again.", "Title": "Great ipad", "Date": "April 4, 2014"}, {"Author": "Maria Robles", "ReviewID": "R3K6RY6OD2LVF5", "Overall": "5.0", "Content": "Bought this ipad mini for family entertainment.  My 4 year granddaughter has learned so much through it's apple apps!  I would recommend it to anyone who doesn't want to spend too much money but wants to have a variety of educational and entertainment apps.", "Title": "Better than description!", "Date": "April 3, 2014"}, {"Author": "Derek", "ReviewID": "R15GA4PBPDUVF9", "Overall": "5.0", "Content": "Although I found this product very fragile, I am still amazed! Regarding all the things it can do – and it always seems able to perform the tasks I need...Lead tech D", "Title": "Amazing", "Date": "April 3, 2014"}, {"Author": "Khiev Kanel", "ReviewID": "R2D4T4J86TKM53", "Overall": "5.0", "Content": "My mum said, hey it's nice and she usually use it for movie and gaming.Great to use, share me when it have more discount.", "Title": "She love it.", "Date": "April 3, 2014"}, {"Author": "salah", "ReviewID": "R1KYO6UJNNEJGN", "Overall": "5.0", "Content": "Excellent and easy to install and well worth the price paid for the acquiredThank you for the high quality", "Title": "Thank you for the high quality", "Date": "February 6, 2014"}, {"Author": "Justin Griffin", "ReviewID": "R1D91QGNRTBXFL", "Overall": "5.0", "Content": "Great purchase! Battery life is great, screen size is great, all the best thing that Apple could offer. Overall a great buy,", "Title": "Great gift", "Date": "January 23, 2014"}, {"Author": "kathleen valentino", "ReviewID": "R3U0L5H1KXYWAX", "Overall": "5.0", "Content": "Nothing bad to say - does anything I need it to do and is very efficient.I wish the I-phone battery had the life that the iPad mini has.", "Title": "Love the iPad", "Date": "January 22, 2014"}, {"Author": "Raul Vazquez", "ReviewID": "R29N7TDEQFSCEJ", "Overall": "5.0", "Content": "Bought this for my gf as an early Birthday present. First I had bought her the 16 gb but that was just not enough memory so returned it at Walmart and came on Amazon to get the 32 gb because the stores didn't carry anything but the 16. She loves it and has it with her all the time. It's fast, the screen resolution is amazing, all in all it's an amazing Tablet and Apple did a fine job! Have not encountered any problems whatsoever!", "Title": "Amazing Tablet", "Date": "January 22, 2014"}, {"Author": "karin", "ReviewID": "R4BO00PA9MTV8", "Overall": "5.0", "Content": "Awesome ,the product is awesome, look brand new and everything works well. I just need to buy the screen protector and case for the back, the smart cover also looks brand new, it is indeed deserve my money!", "Title": "It is the first time for me to write review on Amazon during this years!", "Date": "January 22, 2014"}, {"Author": "Paola Procopio", "ReviewID": "R28ENNP2IHJCLJ", "Overall": "5.0", "Content": "It is excellent! I am satisfied with my purchase, very nuen product, I recommend it fully! The best ipad ever", "Title": "Love", "Date": "January 7, 2014"}, {"Author": "KiwiCutie", "ReviewID": "R3QDW3I9X5ULM0", "Overall": "5.0", "Content": "Fast Shipping!! Just as described! Great Communication! My daughter is going to love it! I wish I can keep it for myself but Santa might be mad!", "Title": "Perfect", "Date": "December 21, 2013"}, {"Author": "A Customer", "ReviewID": "R478JEUYROC3G", "Overall": "5.0", "Content": "Love it. Still learning things about it but so far I love it. I like the small size, easy to carry around. Can stick it in my pocketbook.", "Title": "BJ", "Date": "December 13, 2013"}, {"Author": "TheMadTwatter", "ReviewID": "R2RD598505T9FJ", "Overall": "5.0", "Content": "I love this iPad. Seriously it's better in this size, I use it for all of my internet needs and makes some apps better, like drawing.", "Title": "Love it", "Date": "December 12, 2013"}, {"Author": "Natalie", "ReviewID": "R1XH69MHVAKP6W", "Overall": "5.0", "Content": "The iPad Mini is perfect. I have had no probems with it whatsoever. The negative reviews surprised me because it's hard for me to imagine anyone NOT loving the Mini. Yes, it's smaller than the regular iPad. But there is nothing that the regular iPad can do that the Mini can't so if you would like the 7\" screen, go for it! The screen is clear, the selection of apps is unbeatable, and I've never had a problem from moving from one place to another. You can't go wrong with th Mini!", "Title": "Perfect!", "Date": "December 11, 2013"}, {"Author": "A Customer", "ReviewID": "RRON520VV6YXY", "Overall": "4.0", "Content": "The mini is great for when my wrists get tired of holding my large iPad because of the weight. However I still love my ipad3 because of the size!!! It does everything the large iPad is capable of.", "Title": "Very useful", "Date": "December 10, 2013"}, {"Author": "A Customer", "ReviewID": "R1ZZ6N2EW3U2CL", "Overall": "5.0", "Content": "Amazing product - great price!  Shipped very carefully as well!  I would highly recommend this product to anyone!  It replaces the need for a computer!  It can do everything and is so small and convenient to take anywhere!  :)", "Title": "Love the IPad Mini", "Date": "December 9, 2013"}, {"Author": "Michael J. Supancich", "ReviewID": "R1GQAZ1J8NODL9", "Overall": "4.0", "Content": "In many respects I prefer the iPad mini over the iPad2 which I have owned for several years. The mini is much lighter and easier to hold and yet it provides a large enough image to read books and do other iPad functions. I purchased this iPad mini for my mother in law who has difficulty holding the heavier iPad2 while reading.", "Title": "A nice sized reader", "Date": "December 9, 2013"}, {"Author": "A Customer", "ReviewID": "R71PX2YTUY4QF", "Overall": "5.0", "Content": "It's the perfect size iPad, I used this for about a year and loved every minute.  Great size while watching mobile video, lightweight easy to carry in a growing bag of electronic accessories.  My two year old loves using the PBS app, recommend a protective carry case for kids.  Other than that it is all you come to expect from a mobile Apple product.", "Title": "Perfect Size iPad", "Date": "December 7, 2013"}, {"Author": "Alita Pope", "ReviewID": "R36INCW3CL519P", "Overall": "4.0", "Content": "The iPad mini is just the right size for my uses. It is small enough for using the touch screen for typing without a sylus, yet large enough to use for reading books. My only negative is the screen may be too small for some websites to view easily. Yet if you are willing to use the zoom mechanism to view part of the website, then this may be the product for you.", "Title": "Can type easily with stylus, easy to transport", "Date": "November 5, 2013"}, {"Author": "Healthy Snacks Inc.", "ReviewID": "R18DFN4ELHC2GU", "Overall": "5.0", "Content": "I just rated the iPhone 5s thinking I was rating the iPad mini, because the were purchased together.  Bottom line is they are both excellent product. Easy to use and is more compatible with many more apps than its competitors. This is my second purchase but I find thus size more comfortable and less bulky than the regular size.", "Title": "Excellent product! Apple delivers every time", "Date": "November 2, 2013"}, {"Author": "Scott Kaufman", "ReviewID": "RTBJZ1TJDR66P", "Overall": "5.0", "Content": "Bought 4 units to use with in-wall dock to control a home automation systemall arrived on-time within a few daysThe smaller size is great compared to the larger iPad.  easier if you are holding in your hand as well as installing in the wall.", "Title": "excellent", "Date": "October 27, 2013"}, {"Author": "Tonyo", "ReviewID": "R1NKMR1W1A3HMA", "Overall": "4.0", "Content": "The iPad mini is the perfect size for my wife. The iPad mini is light and the mat finish of the back makes it easy to hold.", "Title": "Gift for my wife", "Date": "October 19, 2013"}, {"Author": "Aileen Huang", "ReviewID": "R1RTY8HAMBW90V", "Overall": "5.0", "Content": "I am so glad to have bought it!  The cover/case is very well made and matches my mini ipad very well. The price was very reasonable, and the shipping was prompt.With this nice case, like a book cover, protecting my mini ipad, I can use my ipad more conveniently. Everything about this product was so good that here I would like to give it a thumbs up and recommend it to those who need a mini ipad case. This is definitely the one worth getting.", "Title": "Thumb-up and Highly recommended!", "Date": "October 18, 2013"}, {"Author": "Ziggy", "ReviewID": "R3QZJJ3VTQI73Q", "Overall": "5.0", "Content": "This has been one of the best purchases I have made in a long time. I love the compact design of the mini, since it easily fits in my purse and I can bring it anywhere. Apple always has great designs, and their OS are always user friendly and intuitive. I have downloaded game aps and movies for the kids, and I can check my email on the go. Use it for meetings and presentations also.This has also been a life saver on our 11hr flight to Europe last summer.", "Title": "Perfect little gadget", "Date": "October 18, 2013"}, {"Author": "Charmaine Swords", "ReviewID": "REZ3VGKOKPUCY", "Overall": "5.0", "Content": "It was the perfect gift for my daughter as well as myself. I use it when she is at school and I can easily do what I need to do on it. It has probably been the best purchase yet.", "Title": "Awesome", "Date": "October 17, 2013"}, {"Author": "MsD", "ReviewID": "R1PBOOWWEMT2W8", "Overall": "5.0", "Content": "Perfect timing,  awesome product.  Does what it said it would. I ordered a refurbished one and it came looking and functioning as new", "Title": "5 stars for refurbished", "Date": "October 17, 2013"}, {"Author": "Aaron Mangelsen", "ReviewID": "R3VV5AJAGMLJLT", "Overall": "4.0", "Content": "Wonderful technology great for everything and compact. I love apple products for their efficiency and look. Definitely glad I have one", "Title": "I pad mini", "Date": "October 16, 2013"}, {"Author": "GavinGlover94", "ReviewID": "RLVOTQ5TBZCSK", "Overall": "5.0", "Content": "Affordable and works very well. It helps me a lot with music stuff since I'm a music major. Good buy", "Title": "It's a great investment", "Date": "October 6, 2013"}, {"Author": "joanna", "ReviewID": "R3QJSQVIR6OPJ0", "Overall": "5.0", "Content": "Got this for my granddaughter to use in school and it is just prefect for her to study and research with.", "Title": "great for school", "Date": "September 16, 2013"}, {"Author": "Gabriel Goette", "ReviewID": "R1CLQOWF757S55", "Overall": "5.0", "Content": "I love the ipad mini. Good size and performance.The screen is really fine and the best part is the weight.Totally recommended.", "Title": "Really cool", "Date": "September 16, 2013"}, {"Author": "Cheryl Robinson-Roberts", "ReviewID": "R170VPOZC0O0D3", "Overall": "5.0", "Content": "getting used to it love the app store and apps that I've downloaded; alarm clock banking and the like is greathowever, I ordered the one with the Wi-Fi but I think I was sent the wrong one? I can't access at work, so I wanted to be able to get n wherever I am.", "Title": "ipad", "Date": "September 15, 2013"}, {"Author": "Philip Jacob", "ReviewID": "R2GKHHDWMPUSDH", "Overall": "5.0", "Content": "very powerful. no crash. lot of apps you can use. very good resolution to watch pictures and videos . I use this most days to watch videos, updates contacts, etc.", "Title": "very good and reliable", "Date": "September 15, 2013"}, {"Author": "Rene", "ReviewID": "R1NGK8Y0QUS14B", "Overall": "5.0", "Content": "I bought this for my son starting college! We bought and rented his text books on it! It holds plenty of text files and he loves not having to lug his books to and from class! Money well spent!", "Title": "Bought for my college student.", "Date": "September 14, 2013"}, {"Author": "Tonka", "ReviewID": "RALVIIYH42C1Q", "Overall": "5.0", "Content": "Just love it, it's veri nice functional, comfortable, small, easy to use, sound and video aslo very goog, i feel totaly fully satisfysed with my iPad mini.", "Title": "Love it!", "Date": "September 14, 2013"}, {"Author": "Wanting Xie", "ReviewID": "R3EP6ELTS26BIH", "Overall": "5.0", "Content": "It is excellent, and I really love it. It is the same as the picture, and the quality is so nice.", "Title": "Excellent", "Date": "September 13, 2013"}, {"Author": "Robin G", "ReviewID": "R3O3ZDV8QLSFTK", "Overall": "5.0", "Content": "She loves it and hardly ever picks up her iPad original.  The size is great and fits in her purse", "Title": "My wife loves it", "Date": "September 13, 2013"}, {"Author": "Samuelle B. Goulds", "ReviewID": "R2O4LLA7B4JQ9T", "Overall": "5.0", "Content": "This was a gift for my husband who is a pilot and has apps giving him details on airports.  This is the perfect size to keep on his knee so he can easily view the information needed to approach and land his airplane.", "Title": "flying high", "Date": "September 8, 2013"}, {"Author": "shank", "ReviewID": "R1FN6OM3ZDWREY", "Overall": "5.0", "Content": "Still love reading books on my Kindle but this truly is close to being the only device I need for personal use. Not an apple fan and lots to learn about to do things but so far, so good.", "Title": "I like it!", "Date": "September 7, 2013"}, {"Author": "Zara Gabriel", "ReviewID": "R2LUNZ5E0T6PRC", "Overall": "5.0", "Content": "Love this mini ipad!!!  Love the size, just love everything about it.  Use it for everything, emailing, texting, gaming, SHOPPING!!!  Its the perfect size.", "Title": "Luv my mini ipad!!!", "Date": "September 7, 2013"}, {"Author": "Rockstarr82", "ReviewID": "R1QVFX65F7ZE63", "Overall": "5.0", "Content": "Bought this for my fianceé to take to school for taking notes and storing files. She can't get enough of it. This is great if you're the type of person that walks around the house constantly browsing through your phone, or you hate waiting for your desktop/laptop to boot up. I would consider purchasing a second one (may wait for the iPad 5 to drop in Oct though!).", "Title": "Perfect!!", "Date": "September 6, 2013"}, {"Author": "Jimmy Yau \"The review\"", "ReviewID": "R3S7RQPKWBRKTV", "Overall": "5.0", "Content": "I would recommend this item if you don't have too many apps. If you want something simply for browsing the internet then I advise you to get the 16GB model if you want to download a huge selection of movies and music I suggest getting something with more memory. Other than that I definitely would get this, simply because I bought it for internet browsing.", "Title": "Great item for internet browsing.", "Date": "September 6, 2013"}, {"Author": "Mimi B", "ReviewID": "R164U42ZJ3YJ21", "Overall": "5.0", "Content": "Love everything about this tablet. Another masterpiece from apple. It came earlier than expected (fantastic seller) packaged perfectly, brand new and with everything included. Works great, if your thinking about buying one I say do it! You won't be disappointed", "Title": "Ipad mini", "Date": "September 6, 2013"}, {"Author": "Sherry in NC", "ReviewID": "RRLXX8TFU2ALY", "Overall": "5.0", "Content": "I love my iPad mini.  It is small enough to carry around in my purse but big enough to enjoy watching Netflix or Hulu.  Apple is a great company and makes great, quality products.", "Title": "I love it!", "Date": "September 3, 2013"}, {"Author": "Edgar", "ReviewID": "R2I4BGXDBL1S6Y", "Overall": "5.0", "Content": "7 inches is the right size! I used to own an iPad 2, i had to sell it and I replaced it with the mini. Wonderful upgrade, it has all the latest functionalities and it just feels great on the hand.I do not miss retina on a tablet since I never had a retina iPad, but this does work great for me, as an e-reader, facetime, even netflix.", "Title": "Geat Fit!", "Date": "September 3, 2013"}, {"Author": "venus_smrf", "ReviewID": "R192SK0TIACVGR", "Overall": "5.0", "Content": "I bought this for my ten-year-old, who needs a computer for homework and trips, but I think I use it almost as much as she does.I live in the boondocks, and even a trip to the grocery store takes almost two hours each way, so I needed something she could use in the car.  We've loaded a couple of movies on her ipad, and she has a whole bunch of games that keep her occupied.  She also uses this for homework, which frees up my computer and makes things a lot easier on all of us.My only complaint is that this doesn't come with much memory, and it doesn't have a way to add any more.  We used up her memory fairly quickly and had to clear out some things (or move them to her cloud), which wasn't ideal.  Still, definitely worth the money!", "Title": "Great purchase!", "Date": "September 3, 2013"}, {"Author": "Pen Name", "ReviewID": "R3PTKXI00U42FI", "Overall": "4.0", "Content": "The iPad came slightly damaged and this was not described. The box was sealed so I assumed the damage may have occurred during shipping... Contacted the seller who after long deliberation offered a discount which I accepted since the iPad was a gift and returning was a bit complicated... The iPad works fine thus far and since the damage was to the back and a case was bought also we never see it nor are we affected...", "Title": "Came slightly damaged", "Date": "September 2, 2013"}, {"Author": "Michael Appino", "ReviewID": "R24EXSLAPVL3AM", "Overall": "5.0", "Content": "The Mini was as advertised and is so much better to use then the regular Ipad.Light and built well.", "Title": "Great Honest Seller!", "Date": "August 20, 2013"}, {"Author": "Arthur L. Williams \"The Deacon\"", "ReviewID": "R169BU2AAP4SR2", "Overall": "5.0", "Content": "The IPad mini is an outstanding tablet device.  The camera especially takes outstanding pictures.  The slim size and portability are also great features.", "Title": "Minitastic", "Date": "August 20, 2013"}, {"Author": "Feii", "ReviewID": "R32VAPZ0AB8Q3I", "Overall": "5.0", "Content": "It is exactely what I have expected to be. Smaller and lighter than an iPad. I like it. A very good product.", "Title": "Very good. I recommend it.", "Date": "August 18, 2013"}, {"Author": "VOCALMAESTRO", "ReviewID": "R3MFHREJMKF3EH", "Overall": "5.0", "Content": "I love this iPad mini. It's in perfect condition and it works noticibly better than my iPad 1 the camera sound and video quality is first rate", "Title": "I love my iPad mini", "Date": "August 17, 2013"}, {"Author": "Jairo", "ReviewID": "R1HIOF6JZG7NMP", "Overall": "5.0", "Content": "I really like it! And the size is just perfect! I bought it for work and so my son can have a portable video player and gamer. We both like it very much!", "Title": "Great tablet! Fulfills my requirements!", "Date": "August 17, 2013"}, {"Author": "Dan", "ReviewID": "R312O3GL4O086E", "Overall": "5.0", "Content": "I own a full size IPad and the mini performs Just as well as its big brother but in a more convenient size.", "Title": "Great product", "Date": "August 17, 2013"}, {"Author": "S. Boothby", "ReviewID": "R1Q1C5MBG9PMCA", "Overall": "5.0", "Content": "I looooooooooooooove this product! Use it everyday for all kinds of things. Am constantly finding new ways to work it into my mini iPad lifestyle. Yeah! So glad I got the mini because I wouldn't carry the larger one to all the places I take this one. It's so much more useful than a celphone and so much more \"there when I need it\" than my laptop.", "Title": "Does this need another review?", "Date": "August 16, 2013"}, {"Author": "eseavey", "ReviewID": "R31J043WUFM5PK", "Overall": "5.0", "Content": "I love my IPad mini. I was a bit nervous about ordering it online after some reviews I read, but mine came in in perfect shape.", "Title": "Wonderful Product", "Date": "August 5, 2013"}, {"Author": "Ronald C Byrd", "ReviewID": "R1ZZXPS7LEN927", "Overall": "5.0", "Content": "Was what was advertised and shipped in a timely manner.Like the size of the mini vs the full size Ipad.I don't feel color is a big issue, especially if you are putting into a case.", "Title": "Very nice unit", "Date": "August 5, 2013"}, {"Author": "Stop and Smell The Flowers!", "ReviewID": "R1QGKTWWU00MQQ", "Overall": "5.0", "Content": "I got this for my boyfriend for a gift and amazon wrapped it up so nicely and they put my card on their with a bow. My boyfriend is obsessed with it and says the iPad is easy to handle and very light weight.", "Title": "Amazon made this gift with ease!!!", "Date": "August 4, 2013"}, {"Author": "KO", "ReviewID": "RDDEIXSK3AG2B", "Overall": "5.0", "Content": "I like the more compact size compared to the regular-sized ipad. For me there s more than ample screen size to view movies on-the-go and to read books and news magazines", "Title": "Excellent", "Date": "June 10, 2013"}, {"Author": "Daisy G.", "ReviewID": "R1GUO05Z6TMJKN", "Overall": "5.0", "Content": "I love my mini me. I carry it everywhere with me. Listen to music, movies, I read all the time. I still love my kindle fire and my kindle paper white. This however has great apps for all different things. Fits into my satchel, cross-body bag, back pack, my favorite companion on trips.", "Title": "Fabulous", "Date": "May 5, 2013"}, {"Author": "Raul Manresa", "ReviewID": "R2NVH41ZLNPK97", "Overall": "5.0", "Content": "iPad Mini is an excellent Apple product, is more portable than regular iPad so you can carry it with you almost everywhere. Very light and comfortable for reading books and other docs, you can easily edit or create new things using it, as so for making notes. The only limitation would be not having a SIM card adapter, so you must have wi-fi to use everything at 100%.", "Title": "Very nice", "Date": "May 4, 2013"}, {"Author": "B. Miller \"BBShopper\"", "ReviewID": "R2UZQDK0U1J3ZZ", "Overall": "5.0", "Content": "Of course I love the Apple iPad Mini.  It goes everywhere I go, does everything and is especially terrific for travel.", "Title": "My mini", "Date": "May 4, 2013"}, {"Author": "Alex", "ReviewID": "R2A9K010896YKE", "Overall": "5.0", "Content": "It is the solution that apple need it  The size is what finished to motivate to buy it. It is so compact to carry anywhere.", "Title": "Love it", "Date": "May 4, 2013"}, {"Author": "3rdGen7", "ReviewID": "R2BLI28B9XLQWI", "Overall": "5.0", "Content": "Got this as a push presy for the wifey who's preggers .. she loves it so much that i can now watch Speedvision uninterrupted WooHoo !!Great size.. not too big..not too small. if that's what you're worried about..dont.. the original iPad should have been this size.. wayy better.", "Title": "Very Awesome", "Date": "May 4, 2013"}, {"Author": "angel s", "ReviewID": "R3B38XPBL5JN7T", "Overall": "5.0", "Content": "I was a bit scared about not ordering from the apple website but this is the way to go. I got a brand new ipad mini and with the money is saved was able to buy a case and screen protector .", "Title": "Such a good price", "Date": "May 3, 2013"}, {"Author": "C. A. Stonestreet", "ReviewID": "R3MKTSV4U3TRMX", "Overall": "4.0", "Content": "It is a fun thing to have. I like the camera. I went from  a desktop to a tablet, so there is a little bit of a learning curve, but it has been an easy transition. Looking forward to learning more.", "Title": "Pretty nice", "Date": "May 3, 2013"}, {"Author": "Margaret Gase", "ReviewID": "R21UZHUFZQO51F", "Overall": "5.0", "Content": "I enjoy this even more than the regular IPad I had  before.  The size is perfect.  very good graphics and storage", "Title": "very good", "Date": "April 9, 2013"}, {"Author": "BENJAMIN F JOHNSON", "ReviewID": "RUGYVOXIAWCNS", "Overall": "4.0", "Content": "Connection speed slow, and the auto correct spellings is a pain,other wise I like it,it came  in good conditionl I would buy nother", "Title": "Like new", "Date": "April 8, 2013"}, {"Author": "JEROME EICKELSCHULTE", "ReviewID": "R1B2FFKDLINTWI", "Overall": "5.0", "Content": "I bought this for my girlfriend and she loves it. When the I-pad got here, she opened it up and started looking thru everything thing on it. she has a few books on it and really enjoys reading.Thank you very much from me and her.", "Title": "re: I-Pad", "Date": "September 20, 2013"}, {"Author": "Guy Bresler", "ReviewID": "ROWC3TT3OM9NG", "Overall": "4.0", "Content": "Other than not being able to work properly on files and manage files in an easy way - it really is great.", "Title": "Mostly great", "Date": "September 17, 2013"}, {"Author": "Clayster", "ReviewID": "R1JRWWTZRM5ARS", "Overall": "5.0", "Content": "This is my first apple product and am quite impressed.  It's fast, light, thin, and connects easily to wifi.  Perfect size for the kindle app as well, works better than most e-readers for reading purposes.  The screen is actually much larger than the 7\" tablets with the standard aspect ration, and has a nice width to it.  The width to height ratio is more toward the width side of things than most tablets, which I strongly prefer and it means bigger text with news articles and less scrolling.  The resolution isn't great but it's fine because of the small screen.", "Title": "excellent product", "Date": "September 13, 2013"}, {"Author": "Augusto", "ReviewID": "R250U6998TF2K", "Overall": "5.0", "Content": "I have read quite a lot about Apple's corporate philosophy, and I'm just happy to know that their spirit is perfectly reflected through their products. Keep the integrity Jobs guys! :)", "Title": "Apple product, quality product.", "Date": "September 13, 2013"}, {"Author": "fabian morin", "ReviewID": "R13SA26DMJOHQF", "Overall": "5.0", "Content": "I had a Samsung galaxy tab 2 7.0 and loved it till it nolonger worked, so I bought Apple ipad... Love it.  It is the reason there are so many tabs out now, ipad is king for a reason.  Long live ipad", "Title": "love it", "Date": "September 6, 2013"}, {"Author": "Julia \"NewOrleansBelle\"", "ReviewID": "R1VDDXM8CNR0LC", "Overall": "5.0", "Content": "I have always been a fan of gadgets.  When I was growing up, there were few gadgets around to satisfy my gadget need; however, since I have reached my \"golden years\" there are gadgets galore.  My first electronic gadget I bought when was when I was in college - the second time.  A chemistry class was making my little ole numbers-handicapped brain spin.  Then along came the Texas Instruments calculator...WOW, it ran on batteries and figured out things for me.  I was in heaven and so began my love of electronic gadgets.  As a professional I had a plethora of electronic gadgets at my disposal (and I still did anesthesia with a calculator.)  The gadgets did get more complex, and expensive, as I got older and I do have a \"thing\" for laptop computers and have owned several...I prefer to surf in my lounge chair, with the computer in lap, my feet up, and a tv show in front of me as opposed to sitting at a desk, etc. Then I planned a trip to Europe this year.  I wanted to be able to communicate with the folks back home without having to tote my laptop, so what to do.  Well, BINGO...you got it.  I needed an iPad!  And where do I go to purchase all my best \"Good Gadgets\"???  To my laptop and Amazon of course!!!  Didn't take long before I located my sweet, little, cool, white, handy-dandy, baby who computes from my lounge chair and any place else with wi-fi...and she weighs much less than the laptop, even fits in my purse.  With Amazon in charge and freebie electronics actually providing the product for my purchase...WOW, what a deal.  Amazon's usually lightening fast, but I had my little, cool, shiny, new, white, baby in less than 2 days - all securely packed and ready to rumble.  And so we have continued to do sending messages/pictures home from Europe, playing games (which I never did before), and reading my fav magazines...SUCH A DEAL!  Give them a try!  Yall take my word for it...it's great!  They're great.", "Title": "My Latest Gadget, Apple iPad Mini MD533LL/A (64GB, Wi-Fi, White)", "Date": "August 24, 2013"}, {"Author": "TJV", "ReviewID": "R2517JF92F0NUP", "Overall": "4.0", "Content": "Very user friendly and easy to learn and operate. .  However my Apple Ipad Mini  does not take the place my Microsoft laptop.", "Title": "Great Product", "Date": "August 20, 2013"}, {"Author": "Susan Wigley", "ReviewID": "R2GR7ATGIBJSAY", "Overall": "4.0", "Content": "It does everything you expect it to do. I should have bought a 4g model. Wifi in my house is pretty spotty. I am planning to get a booster, which may increase my use. However, I do not like it as an ereader. It hurts my eyes after a very short time. I have enjoyed a Kindle better for that purpose.", "Title": "Great tool but I need 4g model", "Date": "August 18, 2013"}, {"Author": "Mr.Obiwan", "ReviewID": "R12VPI9S061YRU", "Overall": "5.0", "Content": "As i expected comes complete in a plastics wrapped box, with all his stuff in it, the iPad mini works immediately, arrive on time, and apple give us another quality product.", "Title": "Great", "Date": "August 17, 2013"}, {"Author": "iAn0ma1y", "ReviewID": "R2CBFIOE0BX6Y7", "Overall": "5.0", "Content": "It's an ipad. I also have the 4th gen ipad, which feels 5 times heavier. I probably should have just bought the ipad mini in the first place. It is easier to type on. My ipad 4th gen gets a lot more hours on the batter though.", "Title": "iPads are cool", "Date": "July 16, 2013"}, {"Author": "gisela", "ReviewID": "R12MN7Y9PJAJ6T", "Overall": "5.0", "Content": "i got it within the time frame, completely new not a scratch on it I’m in love with it! takes great pictures also", "Title": "on time?", "Date": "May 28, 2014"}, {"Author": "Darci Padilha", "ReviewID": "R2MUER1HTATBQY", "Overall": "2.0", "Content": "Cable is not certified which cause a non charge of the product. Unbelievable how an Apple product can sell with this kind of issue. Please, can anyone guide me how to solve it? Thank you.", "Title": "Issue with Cable", "Date": "May 25, 2014"}, {"Author": "Mary Helm", "ReviewID": "RVG50Q7C2J519", "Overall": "1.0", "Content": "I have not had this pad a year and it died, will not be buying any Apple Items any time soon", "Title": "I Pad Mini", "Date": "March 26, 2014"}, {"Author": "Robert Fischer \"Alone At the Alter\"", "ReviewID": "R13C45EL0283NH", "Overall": "5.0", "Content": "Apple has the best tablets and this is another great one. Gave it to my wife for Christmas and she hasn't put it down. It fits the hand and it fits the budget.", "Title": "Great Tablet", "Date": "December 31, 2013"}, {"Author": "Miosotis Giron E.", "ReviewID": "RGFP10CENHY1J", "Overall": "5.0", "Content": "I purchased my new ipad mini wifi silver/white from WORLDWIDE DISTRIBUTORS for Xmas. I had some doubts about buy it from amazon but i decided to take that risk. The ipad came in brand new conditions without any issues. Camera, speakers,wifi all this stuff works great. I totally recommend this seller fast shipping and goods reviews. I selected standard shipping but the ipad arrive in 2 days!!! I WAS VERY SURPRISED.", "Title": "I love it", "Date": "December 30, 2013"}, {"Author": "katie", "ReviewID": "R14LXM39JN2VHO", "Overall": "5.0", "Content": "Amazing! I was scared to order this type of product from an online source,  but I was  Not disappointed.  It was in perfect condition and I was incredibly pleased!", "Title": "Amazing!", "Date": "September 6, 2013"}, {"Author": "Santiago \"Salvarez\"", "ReviewID": "ROW5Q0J5UTOH2", "Overall": "5.0", "Content": "It more that I expect.  Its a great help for my ebooks and for work out of the office or play in travels.", "Title": "great product", "Date": "September 6, 2013"}, {"Author": "ophelia528", "ReviewID": "RW6TDQ6CWTE0L", "Overall": "5.0", "Content": "I had an iPad 2 for work, but I had to return it when I went on maternity leave, so I thought the iPad Mini would be a good substitute. It's great - an excellent size and weight. I don't miss the larger iPad at all! I truly enjoy using it.", "Title": "Everything I hoped for", "Date": "September 1, 2013"}, {"Author": "Kenneth Dziubek", "ReviewID": "R1IASX009L2SJS", "Overall": "5.0", "Content": "She loves it. Also got her a Logitech keyboard. She loves it. It was the best present that I could give her.", "Title": "Sent it to my wife as present.", "Date": "August 31, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B0096V4BTA", "Features": null, "ImgURL": null, "Name": null}}