{"Reviews": [{"Title": "3rd party seller scams. Your NEW Amazon iPad might be USED. Here's how to tell.", "Author": "Reader44", "ReviewID": "R1CLDLMEVLXZUG", "Overall": "4.0", "Content": "The product itself is fantastic and my stars are based on the product being a great deal and a great device.But for anyone thinking of buying from Amazon, be warned. I purchased one of these for someone on her birthday and it was listed as new.  Amazon seems to only sell iPad minis from third party sellers, not from Amazon.com itself, meaning another company gets the iPads from any source they want, sends them to Amazon, and Amazon ships them. One of these sellers listed an iPad mini slightly above retail price, but cheaper than all of the other iPad minis on Amazon. In fact, when I searched for iPad mini, it was the seller and product page the site automatically directed me to. The page indicated it as new, and sold it to me via Amazon.  When my friend got her iPad mini, it looked new, was packaged and sealed like new, but when she turned it on, it was tied to someone else's icloud account. I called apple and gave them the serial number. Sure enough, the item was used, only had about 60 days left in the warranty (instead of 90) and was registered through Apple to a different customer.  If I wanted a used iPad Mini, I would have paid less. Much less.I even emailed the user who had previously owned it (since her email address via iCloud was showing up when my friend tried to access the app store. I emailed the previous user just to make sure it wasn't a stolen product. She explained that she had purchased it a few weeks back from At&T;, not from Amazon. She wanted a wifi + 3g version, not just wifi, so she returned it and somehow, the third party seller got their hands on it and sold it to me as new.In the defense of of the third party seller, once I got their phone number from Amazon and called them (most seller numbers are not on Amazon, you have to call and request a phone number), they provided a scary explanation: They explained that there are problems with Amazon's FBA system (fulfillment). Sometimes, iPads are returned with nothing but index cards in the box and Amazon thinks there is an iPad inside. Sometimes, products mingle, and so another seller's used iPads might be with a different seller's new iPads. They explained that they have a very legitimate source of iPads and have been selling iPads for years and that this is a rare occurrence, although it has happened before. I have no way of verifying any of this, so I can't blame Amazon or the seller. All I can say is that for such a large purchase, and one that is a gift, you are better off buying from a major retail store that doesn't sell used items at all (or buying from Amazon when it is shipped and sold and fulfilled by Amazon).  Right now, this product is actually on sale at Walmart.Amazon refunded me but now my friend has to return her birthday gift. I recommend buying from someone other than Amazon. For this particular product, it's probably the cheaper route to do that anyway. If you do buy from Amazon, call Apple with your Serial Number and verify it is a new, unregistered product with a full 90 day warranty. Don't get scammed.", "Date": "April 12, 2013"}, {"Title": "A phenomenally portable twist on the iPad that finally breaks the mold of 7\" tablets.", "Author": "Scott Showalter", "ReviewID": "R18KRNCDSS963I", "Overall": "5.0", "Content": "Conceived from its sleek, glossy 10\" counterpart, the new iPad Mini boasts one gigantic new trait over the full-sized iPad: the ability to hold it in one hand. This almost revolutionary twist on the device that sparked a frenzy in the tablet world has finally brought joy to those that have held out hope of such higher portability in an iPad for so long. But does the iPad Mini live up to the hype?  Absolutely.Turns out, the iPad mini is indeed more than simply a shrunk-down iPad, though there may be an argument for it actually resembling something more along the lines of a blown-up iPod touch. In any case, the big question: is the iPad mini right for you? I'll endeavor to answer that for you here by taking you hands-on with the new model, plus I'll share from my past few years of iPad ownership experience altogether, especially for those who haven't yet had an iPad to call their own.Plus, in hopes of making this the most helpful iPad mini review on Amazon, I'll also reveal a treasure trove of info on how you can legitimately download tons of quality apps and games for free!For those interested, I've also compiled two iPad listmania lists:Must-Have iPad Accessories: http://www.amazon.com/lm/R1M3AJDBR2BCA7?tag=1pad-20&ie;=UTF8iPad vs. Other Tablets: http://www.amazon.com/lm/R3QLZ307253XU6?tag=1pad-20&ie;=UTF8My reviews tend to run long, so I've organized information by section, with headings, to help you quickly locate any specific info you're after. For example, see the heading \"Downloading Apps and Games\" for the info on obtaining free apps and games!First, let's compare hardware specs between iPad mini and iPad, and what each means for you:+ Device: iPad mini vs. iPad (4th gen)+ Weight: 0.68 lbs vs. 1.44 lbs -- over twice as light as the iPad+ Thickness: 0.28\" (7.2mm) vs. 0.37\" (9.4mm) -- thin as an iPod touch+ Display: 163 vs. 264 pixels per inch -- less-crisp text, but equally long life for a smaller battery+ Resolution: 1024 x 768 vs. 2048 x 1536 -- half as many pixels as the current iPad, but still sharper than an iPad 2+ Battery: 10 hours (16.3 Wh) vs. 10 hours (45 Wh) -- smaller, lighter battery lasts just as long as the iPad+ Processor: A5 (dual core) vs. A6X (dual core with quad core graphics) -- same as the new iPod touch, but not quite as powerful as the latest iPad, yet it doesn't need to be because the iPad mini display totes a quarter as many pixels!+ Price: The iPad mini has a price tag that is indeed much more attractive than the 10\" iPad. It's actually closer to that of the iPod touch.===== First Impression =====At first sight, there's a feeling of novelty to the iPad Mini, especially if you've used a 10\" iPad or tablet. The more you use it, however, the more you realize that this is the size an iPad was meant to be: perfectly portable. The 10\" iPad is so bulky and heavy in comparison, and I felt uncomfortable, embarrassed and awkward taking it with me and using it places, especially waiting in line. Not so with the iPad mini! It's super light, more than half the weight of the 10\" iPad, and its sleek rounded edges are much more comfortable for carrying than the sharply-tapered edges of the iPad.My initial reaction to the unveiling of the iPad mini was one of slight disappointment, mainly because it was closer to 8\" than to the desired 7\" of other tablets in its class. Why would Apple bother bringing a smaller iPad to market that's still not quite as small as some of the other 7\" tablets floating around? Ah, but I was wrong.Until I held it in my own hand, I failed to realize that Apple had made better use of the iPad mini's size than most 7\" tablets do. What matters in a 7\" tablet class isn't the screen size but the actual device size. The iPad mini is 3mm shorter and 7mm wider than the 7\" Kindle Fire HD, yet it touts nearly an inch more of physical screen size.===== Interaction Experience =====Naturally, the iPad mini shares the iPad's same phenomenal multi-touch interface that is undisputedly second to none. Android tablets and other devices may tout \"multi-touch\" support, but usually this just means they support 2-finger gestures like pinch-style zooming. Apple, on the other hand, gives a whole new meaning to the term, supporting up to ten simultaneous touches, and app developers have certainly leveraged that capacity. For example, one popular app supporting ten simultaneous touches is the Piano app.===== So What Can the iPad mini Actually Do? =====Naturally, there are things you can do with the iPad mini right out of the box. You can browse the Web with Safari, set up your email, download your photos and videos from your computer via iTunes, as well as shoot new photos and videos using either of the two built in cameras. You can also surf YouTube via Apple's built-in YouTube app. There's also an iPod built in, so you can listen to your favorite tunes via the Music app, or download new music, movies and media via the iTunes app. Another popular app is iBooks, which lets you download and read e-books on your iPad mini. You can also jot notes, manage your calendar and contacts. You can even chat face-to-face with other Apple-device users via FaceTime.Of course, the fun and usefulness of the iPad mini doesn't stop there. The App Store app is your portal to unending games and utilities. One thing Apple has been really good at is showing off just what you can do with an iPad, and the same goes for the iPad mini. All iPad apps work on the iPad mini. After all, the iPad mini is still an iPad. App developers have undoubtedly been busy creating unique experiences through their iPad apps, most of which have yet to be rivaled by (or ported to) Android and other tablets.When Apple first announced the iPad they didn't tout it so much as an ebook reader as they did a \"netbook killer\" (due to its ability to surf the web, check email, watch videos, listen to music, and do a lot of the simpler tasks that netbooks were originally designed to do. But along its path to success, it sparked a revolution in the publication and delivery of full-color magazines, news and now even ebooks via Apple's iBooks app. Now, it's quite clear that Apple had the goal of a much more comfortable ebook reading experience in mind when they set out to create the iPad mini. You can easily hold it in one hand, just like a real book, and it's as light as a real book, two traits many users have been hoping to see come to fruition soon.On the other hand, to use the iPad mini for more productive purposes, such as editing office documents, you'll need to download Apple's productivity suite iWork, a trilogy of apps including: Pages (word processing), Numbers (spreadsheets) and Keynote (slideshows). Each of the three apps can be downloaded separately for $9.99 each. Completely reworked for the iPad, the complete iWork suite will set you back a whole thirty bucks. So be aware of that before you go ahead and grab the iPad mini for use with work-related document editing, and so forth.Also note that if you do intend to use the iPad for heavy writing or word-processing purposes, you'll find that your ability to type quickly will be greatly inhibited by the virtual keyboard. Thus, you should snag the external keyboard as well (Note: I'll also explain some typing techniques below). Either way, be prepared to pay more than merely the price for the iPad mini alone. There's clearly more than meets the eye if you intend to transform the iPad mini into something a little more productive than it might be for you out of the box.===== Downloading Apps and Games =====Downloading apps on your iPad mini couldn't be easier. Once you set up your iTunes account with a password and credit card (or iTunes gift card), all you need to do is launch the 'App Store' app, browse or search to find the app you want, tap the download button (usually it says the price rather than 'download', which then changes to 'install app' after you tap it), then tap again to confirm. Enter your password, and voila, you just bought an app. Behind the scenes, Apple then charges your card (or deducts from your gift card balance) the amount of the app plus tax, while you're already off enjoying your new purchase. This ease of access is a blessing and a curse, because you can easily empty your wallet if you're not carefully considering each purchase.All apps in the App Store range in price from Free and 99 cents on up, always incrementing in whole dollar amounts (1.99, 2.99, 3.99, etc). The maximum price for an app is set to $999.99, of which there are only eight currently priced so outrageously. And don't even think of toying with them. Apple does not allow refunds on apps you have purchased--all sales are final!Now for the juicy money-saving secrets of the App Store! With the proper resources, you can legitimately download thousands of high quality apps for free. I do it all the time and it's perfectly legal. You see, Apple allows developers to temporarily put their apps on sale (and even drop the price to free). Usually they do this in hopes that you'll write a rave review for the temporarily-free app. The secret to your success here is having the resources to help you spot these special app sales--so you know when and where to get them during these often extremely-limited-time promotions.In hopes of making this the most helpful review on Amazon for the iPad mini, here's how to obtain these special promotional-sale and temporarily-free apps for yourself!There are several resources you can use, both on the Web and on the iPad mini itself. I prefer to use an app called \"AppShopper\" which lists all apps that recently went on sale or dropped to free. You can filter just iPad apps, or show iPhone apps as well, and you can also filter just the free products or just the sale apps. But so many apps go on sale, making it hard to cut through the clutter, which is where AppShopper truly shines: the \"popular\" tab shows only the most popularly downloaded sale apps. If several other people aren't downloading an app, you won't see it listed there! AppShopper is a phenomenal little gem, and it has gotten me tons of apps FREE! It also has a companion website that lists the same apps. You can even create an account and track the apps you own, so you don't end up trying to redownload them if they go on sale again! It also supports watch lists (via your account) with push notifications, and can alert you whenever an app you're interested in goes on sale. It's a real thing of beauty! There are other apps such as AppZappPush, AppSniper, AppAdvice, Apps Gone Free, and more, but none of them leverage the power of the masses to help you filter out the unwanted apps. Feel free to check them out if you like, though!===== Typing on the iPad mini =====Typing on the iPad mini has certainly become a bit less burdensome than with its 10\" iPad counterpart, especially in the way of thumb-typing. However, typing lengthy messages can still be a concern. Obviously, the iPad mini is no laptop--you won't be speed-typing, so it may not be conducive for heavy usage like typing lengthy emails or blogging, let alone writing this review. With that in mind, there are a couple approaches you can try to determine what typing method is right for you. The ideal method might also change depending on where you are and how the iPad is oriented when using it.Typing Method #1: ThumbsThe most flexible approach is to type with your thumbs, which can be done whether sitting or standing. In portrait mode: grasp the bottom of your iPad with your palms facing each other, and your pinky fingers towards you for the iPad to rest on. To stabilize the iPad and prevent it from flopping over and falling out of your hands, stretch both of your index fingers upwards towards the top of the iPad as much as is comfortable. Using your thumbs, hunt & peck the keys on the virtual keyboard to your heart's content.Alternately, if you press and hold the show/hide button on the bottom right corner of the keyboard, you can choose to split the keyboard, which makes it easier for your thumbs to reach all keys. You can also choose to undock the keyboard, which centers it vertically on the screen, instead of at the bottom. Undocked keyboard can be split or merged, per your preferences.Typing Method #2: Two FingersIf thumb-typing isn't your style, try holding the iPad mini in one hand, like a book, and use your index and middle fingers to go back and forth across the virtual keyboard. Alternately, if the iPad mini is resting on a surface and is in landscape orientation, you could try using two fingers from each hand, but I don't think the iPad mini is big enough to type with your full range of fingers like the 10\" iPad is.Typing Method #3: Speech to TextWith iOS 5 and Siri, Apple has brought us an even more convenient way to type, thanks to Siri! Just hit the microphone icon on the lower-left side of the keyboard, and start speaking. In most cases, your words will be transcribed into the currently active text field, with potentially mis-interpreted words underlined in blue. Just select any such word, and a list of possible alternates will pop up for your choosing.You can also speak most punctuation, such as 'period', 'question mark', 'exclamation mark', 'open-paren', 'close-paren', 'hyphen', 'single quote', 'double quote', 'ellipsis' and more. Siri is built into the iOS software and is a free service, but one caveat of using Siri for speech transcription is that you must be connected to the Web at the time of transcription, because Siri is a primarily Web-based service (albeit a free one). At times, network congestion has been known to hinder the ability for this feature to work properly, but that happens much less frequently now and usually only occurs if your device is connected to a poor cellular signal instead of WiFi.Other methods of typing on the iPad include the external keyboard, as well as third party speech-to-text transcription apps like Dragon, but with Siri's voice transcription feature built in, the latter is no longer necessary.===== Web Browsing =====Alongside email, and spending money in the app store, Web browsing is one of Apple's biggest suggestions for using the device. The iPad mini's small stature is no less capable, and its screen resolution of 1024x768 tends to concur, especially in landscape mode. Most websites are around 800-1000 pixels wide, so when the iPad mini is in landscape orientation, Apple's built-in Safari Web browser or Google's downloadable Chrome app will render any sites that are less than 1024 pixels wide at their intended original size, meaning you see them at their true size, rather than seeing a smaller, more compressed version of the site. Chrome lets you keep an unlimited number of browser tabs in the background, while Safari limits you to 9 tabs (at least until iOS 6 is released).The good thing about Web browsing on the iPad and iPad mini is that you can rotate the orientation. Content on the Web was born to be viewed vertically (in portrait orientation), not horizontally (landscape orientation) as most laptops and desktop computers use. In general, I tend to prefer browsing the Web in portrait mode, since web pages are almost always taller than they are wide. Still, even in portrait mode, the iPad mini allows you to see more content at a still-decent size. Of course, even in portrait orientation, the compressed pages rendered are still easily readable without squinting your eyes, which isn't often the case for Web browsing on the iPhone/iPod Touch. Plus, you can always zoom into any section by quickly double tapping any region of the active page. Even zoomed-in regions are displayed with crisp clarity, and the browser's interface is swift and responsive.However, not all your sites will work desirably on the iPad. Apple closed-mindedly refuses to support Adobe Flash on the iPad (as it has with the iPhone/iPod Touch). Flash content is now being used less and less, in favor of newer content technologies like HTML5's canvas and JavaScript effects, which can emulate some of Flash's most familiar capabilities, but sites using Flash do still exist. Flash is often used for advertising, video playback, browser-based online gaming, and for many other interactive site components, from graphs to product demos. However, the Flash experience on tablets that do support it is still quite poor in the interactivity department, especially considering that Adobe never intended for it to be used on touch screens. Thus, certain Flash content may expect a mouse hover and you can't emulate that with a finger on a touch screen.While I found browsing the Web with a 10\" iPad to be a literal pain in the neck, the lightweight and small stature of the iPad mini has certainly improved the experience. It's easier to handle, to hold upright with a single hand while browsing the web with the other, and it's more comfortable to hold. Since I didn't surf much with my 10\" iPad, I have no qualms about the lack of a retina display. I'd rather have this iPad mini with the same resolution as the iPad 2 and a 10-hour battery life with a much smaller batter, than to have an iPad mini with a retina display and either a 4-hour battery life, or a battery as heavy as that of the 10\" iPad!===== Email, IM and Social Networking =====Email on the iPad mini's Mail app is best viewed in landscape mode, as it allows you to see both your list of messages on the left as well as the selected message itself on the right. It also makes managing emails easier, such as moving messages to other folders (or to the trash). Another reason for landscape mode is to make typing those lengthy emails easier (using typing-method #2 mentioned above).You can have multiple email accounts, including Gmail, Yahoo, AOL, MobileMe, Microsoft Exchange and other custom POP3 and IMAP accounts.Important Note: With the growing number of portable web connecting devices, there is one concern I want to express on your behalf. When you close the Mail app, it continues running in the background, even after disconnecting from one WiFi hotspot and reconnecting to another. My concern with this is that if haven't set up your e-mail with a secure connection, and you connect to a public WiFi hotspot that a malicious user is monitoring, then the instant your mail app connects to the hotspot to check your e-mail, your e-mail credentials may be suddenly compromised. To avoid this you definitely want to be using some kind of secure connection for your e-mail if at all possible. Web-based email such as Gmail typically support this out of the box, and Gmail accounts are the easiest to setup on the iPad mini.===== Media =====If you own an iPhone or iPod Touch, it's comforting to know that you audio/video experience will be similar on the iPad mini. You can watch videos via the YouTube app, which has been updated for the iPad mini to show YouTube HD videos beautifully. While the 1024x768 resolution of the iPad mini is a standard 4:3 ratio, not a widescreen 16:9 ratio, the HD videos as well as other video (including downloads from the iTunes store) display just fine, albeit with black bars. Some may not like that though, but I don't see a wide-screen iPad mini coming to market for a while.The Netflix and Hulu+ apps are great for members of those online video streaming services. Netflix videos stream quickly and even moving the play position back and forth in the timeline, the movie starts playing very quick without much time rebuffering the video. For those who want to watch live TV, I also recommend getting yourself a Slingbox and snagging the SlingPlayer app to stream live TV to your iPad mini. I do that, and it works quite well!===== Photos and Video =====The new iPad mini brings a phenomenal new high-quality 5MP camera to market that picks up where the iPad 2's half-megapixel camera left off. 5 lenses inside the aperture, and the more powerful processor, combine to create the sharpest iPad image yet. Even low-light pictures are better than ever, though there's still room for improvement there. There's also a new iPhoto app from Apple that lets you organize, edit and share your photos right on the iPad mini!Plus, you can now record full-HD (1080p) videos, instead of just the previous 720p videos. Though I must warn you, if you plan to shoot a lot of video with the iPad mini, you'll want to go with a 32GB or 64GB model! These incredibly high-quality videos take up an incredibly large amount of storage space!===== E-Reading =====Whether it's books, magazines or news, the iPad is making an impact on the future of media reading on a whole new level. Apple has been under-emphasizing the e-book and e-publication reading capabilities of the iPad to date, but I feel it's one of the iPad mini's greatest strengths, especially with it being about the size of a book. Magazine, newspaper and now book publishers have been jumping onboard the iPad bandwagon by creating their own iBooks and iPad apps, taking their publications to a whole new level, interactively and financially too.My experiences interacting with some of these digital representations of magazines and newspapers have been a breath of fresh air. Being able to read them on a screen simply isn't enough. The ability to still touch them, combined with a rich interactivity on a level that can't be matched by their printed counterparts has really given new life to what I feared was becoming a dying trade. Of course, another big perk for me has been the ability to save space because now I can keep all my magazines around without ever taking up more than the size of a single book.As far as Amazon ebooks go, you're not losing out by passing up on their Kindle line of tablets, because you have full access to Kindle books on the iPad mini via Amazon's Kindle app. If you read a lot outdoors and don't mind reading in shades of gray rather than in full-color, then perhaps the Kindle Paperwhite (not Kindle Fire) is more your style. Kindle uses e-ink which is much easier to read in the sunlight.All in all, the iPad mini is an great e-reader on a whole new level. Had it touted a retina display, text would be slightly more crisp, albeit at the cost of long battery life. I'll take longer battery life over slightly more crisp text any day. Text on the iPad mini looks fine, unless it's really small, and that's usually only the case for an occasional website, but not ebooks.===== Productivity =====Productivity carries numerous definitions. Usually its \"getting something done\" though some people tend to believe that it's the ability to focus without being distracted, which I see as one of the iPad mini's strengths because of its single-app-at-a-time multitasking approach.In the context of software though, applications that allow you to edit office documents are commonly referred to as productivity software. Apple's own suite of productivity apps, collectively called \"iWork\", lets you do just that. For work-minded individuals, it will probably one of the most popular uses of the iPad mini. There are three apps in all: Pages is a word processing app that allows you to create and edit word processing documents, Numbers allows you to create and edit spreadsheets, and Keynote, which lets you create or edit presentations and slideshows (including PowerPoint files). Keynote has been pretty invaluable in giving personal presentations within small groups or one-on-one meetings with an iPad, but I'm not sure the iPad mini would be as comfortable using for presentations.There's also a productivity category in the App Store dedicated to additional apps geared towards helping you be more productive. Remember, any app that works for the iPhone and iPad will run on the iPad mini, but do note that there are some exceptional productivity apps specifically made or updated for the iPad and iPad mini. Some notable iPad-specific productivity apps include Bento (personal organization/information management), Things (project management), iTeleport (remote desktop/VNC), Layers (drawing/painting), and GoodReader (best PDF+ reader around).===== Gaming =====If you're like me, you probably don't have time for games. Ultimately, I still see the iPad as a productivity device more than as a gaming console. Regardless, the iPhone and iPad changed the game on that. Millions of people use their computers for gaming, and with the iPhone and iPod Touch having taken on a clear role as a gaming console that has been as revolutionary for mobile gaming as the Wii was for living-room gaming, it goes without saying that the iPad mini is, and will continue to be, a decent platform for playing games. Most Android games look terrible on tablet-sized screens, but iPad game developers have taken care of iPad users with good quality iPad versions of most iPhone games. Board games and lap-friendly games are better for the 10\" iPad than the iPad mini. Meanwhile, games heavily dependent on device-rotation and other accelerometer-based interaction are much conducive for use on the iPad mini than the 10\" iPad.===== Printing =====Printing with the iPad mini is really hit-or-miss. Apple's iOS 4 brought the ability to print documents from their devices, but there are some caveats. Your printer must support \"AirPrint\" or, if yours doesn't, you might have success using Printopia software, so long as you have a Mac with a shared printer. Search Google for 'AirPrint' or 'Printopia' for more info and printer compatibility. From there, printing is easy, for apps that support it. The first time you attempt to print something, the iPad mini will walk you through the process of locating the printer and setting up the printing options. For more information about printing with your iPad mini, I'll link to some informative off-site pages in the first comment for this review.===== Security =====With portable devices, there should always be some level of concern regarding the safety and protection of your data. The iPad mini delivers surprisingly well in the area--it provides several layers of security to protect your data. You can require complex passcodes to securely access important information, encrypt data whether stored or transferred over WiFi, and even remotely wipe everything from your iPad instantly in the event of theft or loss (with subscription to Apple's MobileMe service). Apple even provides a free device-location service.===== Praise =====+ Clever use of space to cram an 8\" screen into a 7\" class of device that can be held with one hand!+ Apple continues its trend of creating the best multi-touch experience around. Android doesn't even come close.+ High performance 1GHz A5X processor - provides performance power for cutting-edge gaming and multitasking.+ Multitasks like a dream with iOS 5 and the dual-core A5 processor, despite the same 256MB of memory as the third generation touch.+ Rear camera - 5 megapixel photography goodness, plus it can do HD video.+ 4G LTE - It's clearly the next big thing for improving connection speed when away from WiFi+ Supported on Sprint - previous iPads only supported Verizon and AT&T;+ Lower iPad entry price point===== Caveats =====+ No Retina Display - But at the added benefit of a lighter battery that holds its charge just as long.===== Disappointments =====+ No GPS (or assisted GPS with 4G model) - IP based location just doesn't cut it at times. GPS has no subscription fee or contract to use+ No NFC - Near Field Communications is what powers PayPass in credit cards, and there are certainly uses for it in devices, especially for data transfer, if not for making payments or redeeming passes with the Passbook app.+ No 128GB model - would have been useful for high-res videos, or hold more of those 1080p videos you can shoot+ No USB or SD card slot - for storage expansion, or more importantly, for importing pics from your external camera for use with the new iPhoto app+ No numeric character row in keyboard, despite plenty of space on the iPad and iPad mini's screen.===== The Bottom Line =====There's really not much to complain about in an iPad now. Sure, retina display would be nice, but if we'd been given that, we'd be complaining about battery life, heavy weight or performance issues. Meanwhile, the 10\" iPad has its uses, but portability isn't one of its strong suits. The iPad mini now fills that gap, and it's really been a dream to use. If 10\" is comfortable for you, go with an iPad. As for me, the iPad mini has mostly lived up to my tablet desires.Do you really 'need' the retina display? The honest truth is, no. See, Apple has certainly come to spoil us with its latest and greatest hardware, including the retina display, but I really don't see the iPad mini's less phenomenal display as a real deal breaker. I also a believer that the original iPad or iPad 2 are still great devices if you like the 10\" class of tablet, and they don't have the retina display. So, really, why wait around another year for something better to come along? Then again, there's no absolute guarantee that the next iPad mini will even have that retina display.The bottom line is, don't wait around and waste these precious cycles of your life hoping and betting on something better to come around, when you can always buy the current iPad Mini now, enjoy it now, and resell it down the road. Apple products always hold most of their value for a long time, because they're in such high demand.I hope you've found my hands-on review helpful. Feel free to keep the discussion going via the comments! :)", "Date": "December 2, 2012"}, {"Title": "Slower at buffering video than my I-pad Retina (and the I-pad 2)", "Author": "D. Fichtner", "ReviewID": "R2QAXZKLNZHPDM", "Overall": "3.0", "Content": "First off, I'm not going to rip this thing apart.  I feel the Mini is an absolutely wonderful form-factor, and I recommend it -- just not yet.The good:The size of the mini is just short of an inch wider than your typical competitor.  You might not think this is much, but seriously, it is.  I absolutely love this aspect of it.  In addition, the Mini is just wonderfully light and easy to hold (I have big hands, though).As much as people rip on the screen, it is comfortably bright, and the battery life seems to last quite well, even if brightened up a bit.  No complaints there.The bad:That same screen, as others have said, suffers from its low resolution.  Had this tablet come out a year ago, it would have been earth-shattering.  Now, when other offerings from Android are coming out with far better resolutions, it's just meh (the Apple Mini's contrast and color are still superior to the Nexus 7 by far, though).  If you are someone coming from an I-pad 2, you won't care about the resolution so much.  For everyone else who is used to I-phones with substantially smaller, yet sharper resolutions, you will notice the difference.Also, and this is a big one for me, I have found that the I-pad Mini is slow to buffer YouTube videos.  I'm pretty sure this has to do with it having half of the Ram of its larger pad family members.  Cutting the Ram in half was a big mistake.  It also seems to cause lags in surfing on only some sites that are more graphic intense.  I wasn't sure if this problem was one of my own, so I tried out some other Mini's in the store side-by-side with I-pad 2's and Retinas.  Same thing... slow Youtube buffering.  Quite a bit slower.I want to tell you to buy this thing, but I just can't.  I want to tell you to wait until next year when the tech is there to up resolution and add more Ram.  For the price, the Apple Mini disappoints.", "Date": "November 18, 2012"}, {"Title": "Love it!", "Author": "Jason Baker \"Jason Baker\"", "ReviewID": "R3TPHSA9ZHCJUD", "Overall": "5.0", "Content": "Normally I do not review products that I do not buy at Amazon, but I am making an exception for the iPad Mini.Let me start by stating that all my gadgetry is Apple.  We own an iMac, iPod nano, two iPhones, and an iPad 3.  Suffice to say: we like Apple products.Honestly, the reason I bought the iPad mini 16G, WiFi was: one, it can fit in one hand; two, it is cheaper than a new iPad; and three, because I wanted it.So:  I've stated that I'm a loyal Apple customer and probably will be the rest of my life.  It might be that I'm biased when it comes to Apple products as are a large majority of Apple customers.I was apprehensive at first about the display.  When I found out the Mini wasn't using a Retina display, I nearly didn't buy one.  I love the beautiful resolution of my iPad 3.Apple used the same 1024-by-768 as the iPad 2, BUT the screen is 7.9 inches.  In my opinion the display resolution is great.  Not iPad 3 great, but not as bad as I thought it would be.  I have to agree with Apple and say that the 7.9 inch screen is perfect for a smaller tablet.  +1 for MiniThe Mini is 53% lighter than the iPad and 23% thinner--not a major selling point for me, but not a distraction either.  +1 for MiniThe iSight 5 megapixel camera takes great pictures and shoots decent movies for what it is.  I've tried out the FaceTime and it works great--picture resolution is adequate.  +1 for MiniSpeed:  The dual-core A5 provides this device with plenty of computing power.  I was impressed as I thought the Mini's speed would suffer as Apple was attempting to cheapen the product a bit.  It didn't.  Internet surfing is lightning fast!  +2 for MiniI'm satisfied with the battery life.  Apple says that the Mini has ten hours of battery life and they're pretty close.  +1 for MiniI love the aluminum unibody cover.  The thing is sweet looking: sleek, like I'm in a sci-fi movie using some futuristic device.  I heard one dude say it's sexy.  I'm not sure that I'd go as far as calling a hunk of aluminum, glass, and plastic sexy, but it is easy on the eyes.  Apple nailed it on the aesthetics of the Mini.  +2 for MiniAt first, I was peeved about the Lightning connector (I still am a bit).  All my other devices have the old 30-pin connector.  I have only one cable to charge the Mini and four old cables that will eventually be obsolete.  The smaller port is great though--it looks much better, more compact and I understand why Apple did what they did...but it still sucks when you have multiple other Apple devices with the old port.  Everything has to change sometime, I guess.-1 for Mini (not Apple's fault, my preference)Hey: when the apps and widgets get boring Siri's there to ask millions of important questions to.  Who doesn't love them some Siri?I used an iBlason case to protect the Mini and so far like it:  http://www.amazon.com/i-Blason-ArmorBox-Convertible-Friendly-Protection/dp/B009PPKFNI/ref=cm_cr-mr-titleSo with all that said and much more not mentioned: I'm a fan of the Mini, but I think the device was overpriced a bit.  I still paid the extra $130 over the Kindle Fire HD, because I prefer Apple, but after playing around with a friend's Fire HD 7\", I was impressed with the Fire and the price.In the end it was a matter of preference for me choosing Apple over Kindle.  I'm very satisfied with my purchase of the Mini and my kids love it too.  I would recommend the Mini to anyone and everyone.  Great product!", "Date": "November 6, 2012"}, {"Title": "I Love It!", "Author": "R. C. Bowman", "ReviewID": "R1A9CEFMDUNOVE", "Overall": "5.0", "Content": "I'm an avid reader and a writer who has tried every portable device under the sun. Smart phones (even the large ones) are too small to read comfortably or to type; laptops simply are not portable enough due to short battery lives; and other tablets were uncomfortably large for me (I've got small hands.) I've tried taking notes directly on screens with a stylus; I've tried Bluetooth keyboards; and I've tried typing directly on screens. Everything was either too large or too small. Other, similarly-sized tablets tend to lag, or the battery life is very poor.I've been an Apple holdout for a while. I had a little iBook a long time ago, and the system issues, general uselessness of the battery, the severe problems with transferring Word, Corel, and other word processing documents, and all-around, irritating, proprietary nature of Mac turned me off for several years. Don't get me started on what I thought of the pricing.After doing a lot of research, however, I took a chance on an iPad mini. It was the perfect size (decent screen, super thin, super light) the battery life is supposedly long (it is--seven hours on the brightest screen setting, several days on standby, 10-12 hours with a low or medium bright screen) extremely portable (very, very important) easy to backup (and from the backup, export to different formats if needed) and does exactly what I need it to do (word processing, graphic art, reading, and surfing.) I have never been happier with an electronic device. (I also use it as an iPod. And as a player for my Google Drive. It's fabulous.)To repeat, it's absolutely perfect for me. I can work on it for hours, it's powerful enough for professional art programs, it's great for writing (the native note app, Google Drive, the Corel app, and a couple of others) and it is by far the best screen for reading I've come across.I tried a Bluetooth keyboard, thinking the screen would be too small to type on. The Bluetooth was a dud--it only worked once--but that was a happy accident. The iPad mini is exactly the right size for me to comfortably type onscreen.I have no complaints with Safari. It's super-fast and while it isn't my favorite search engine ever, it naturally does the job. The only issue I had was figuring out how to open a link in a new tab. (This took me a week. I can be a little slow.)Now that the rave is over, there are a couple of caveats.First, while the screen is the perfect size for me to type on, I'm a small female with hands about 2/3 average size, so it may be too small for some people to comfortably type on.Second, there are (as noted by other reviewers) no USB ports. If you need a lot of memory, this is not the device for you. There is no easy way to expand it. This was actually a little disappointing for me, but Google Drive and Dropbox solved the problem for me. (I'm a lucky person who is never far away from a WiFi signal.)Also, there is no way to replace the battery. When it starts dying, it's done.It doesn't have the retina display that comes with the larger iPads. (It's still a better resolution than many other devices, but hey--no retina display is no retina display.)Finally, there isn't really any way to get around the price. It costs more than some laptops, and certainly more than the other tablets of its size.Personally, I think it's worth it. The sheer portability and quality of the item is incredible. The fact that it is literally perfect for everything I need to do makes it even better--for me.I strongly recommend the iPad mini, with one caveat: do your research. Make absolutely sure you know exactly what you need and what you want, and invest in a product that meets that. This is not the item for someone who needs a lot of onboard memory or a ton of power. Someone who wants just to surf or just an e-reader may be better served with another product, too--but then again, maybe not (like I said, this functions as the most delightful e-reader ever.)I love it, and I think most people will. Have fun =)", "Date": "March 20, 2013"}, {"Title": "USED AND DEFECTIVE!!!!", "Author": "reniell gohr", "ReviewID": "R3MX0OHLS59KAT", "Overall": "1.0", "Content": "Bought item for company Christmas party.  The recipient opened package and item would not turn on.  I contacted apple support and they stated that iPad was purchased back in July and registered to another person.  I was sold a used and defective product.  Sending it back for a return.", "Date": "December 12, 2013"}, {"Title": "No Apple products purchased through Amazon Resellers are New", "Author": "treehaven", "ReviewID": "R25M1XLXI62NPS", "Overall": "2.0", "Content": "First off, this re-seller got my Mini out to me on time.  Or actually, Amazon did (I think it was fulfilled by Amazon).The Apple ID numbers were covered up by a sticker attached by the re-seller.  I had to carefully peel this back so I could call Apple and get the smut on this particular device (more on that below).  I wanted to make sure that is was not a repackaged, used device, as others have reviewed, or that it was refurbished, or purchased over 30 days ago (and thus ineligble for AppleCare- also reviewed below).  I was able to peel off the sticker without ruining the plastic wrap, which would have made my return 'opened'.A corner of the box was slightly dinged in, and the plastic wrap on the box looked pretty well scuffed up, and definitely gave the appearance that it had been bounced around quite a bit.I did not open the box, as I found out from Apple that this was not actually a brand new device.I looked for but did not find a Mini sold directly by Amazon.  It appears (and an Apple Tech confirmed this) that Amazon does not sell Apple products, instead relying on resellers to take on that onus.  Is this all cause of the Kindle?What impact does that have on us?  In most cases, you will be ineligible for AppleCare. AppleCare is a huge benefit for most purchasers, covering all types of damage up to 2 years.  If you buy an Apple product from someone other than an Apple store, you can still enroll your device in AppleCare, but it must be done within 30 days of purchase, and it must be done at an Apple store.When you purchase an Apple product through Amazon, you are getting a device that in most cases was purchased by someone like us, at a BestBuy, WalMart, Target, etc, at some point in the recent past.  They then 're-sell' the device on Amazon.  Apple uses the origianl date of purchase from the Apple vendor (the BestBuy, Walmart, Target, etc) to start the 30 day AppleCare counter.  In my case, my Mini arrived on the 30th day from original purchase.  I had 3 hours to get my device down to an Apple store, get it enrolled in AppleCare, or else I would be SOL.  Fortunately, Amazon's incredible return policy enabled me to just go online and in a few clicks print out my free return label.As an FYI, Apple stores are the absolute best way to purchase an Apple device.  Not only are they cheaper (mine was actually the same price, with tax, as it was from Amazon), but they will spend over an hour with you getting it set up, linked to your iTunes, your iPhone, iCloud, etc.  It's an amazing experience, and it's all free with your purchase.I challenge Amazon (and Apple) to combine their two excellent companies and develop a strategy for online buying experience that actually enhances each other's products/services, rather than detract from them as they do now.", "Date": "June 9, 2013"}, {"Title": "Another used iPad Mini sold as new", "Author": "Robert Fisher", "ReviewID": "R2Z7IM6NCKWAUK", "Overall": "1.0", "Content": "I echo Reader44's review (above) about getting a supposedly new iPad Mini from Amazon that turned out to be used.  My Mini arrived on Friday with paperwork showing that it was being provided by Freebie Electronics.  I had no problem getting it configured on my wireless WiFi network Saturday morning.  I then called Verizon and provided the necessary information to connect using 3G.  However, it would not connect even though I had the Verizon logo and three bars on the screen.  I called Verizon back, and another person told me there was a \"problem,\" and I needed to speak with the Fraud Prevention department, which was not open weekends.  Or I could go to a Verizon store and have someone there look at it.  I opted for the latter and drove to the Verizon store in Torrington, CT.  Someone there checked it out, entered some data from the Mini on her computer, and confirmed that the Mini had been previously sold to someone else.  The unit was \"blacklisted\" because that someone had neglected to pay his or her Verizon account.  No, Verizon won't unlock the Mini, so I have to return it to Amazon for a replacement.  Amazon's web site says Freebie Electronics gets 4.9 out of 5 stars, which seems hard to believe if that company makes a habit of providing used electronics to Amazon for sale as new.  Needless to say, I am very disappointed with Amazon. I have bought lots of stuff, not just computers, from Amazon and certainly expected better.", "Date": "September 22, 2013"}, {"Title": "Love it!", "Author": "Jason Baker \"Jason Baker\"", "ReviewID": "R9ACOTU1CLEZZ", "Overall": "5.0", "Content": "Normally I do not review products that I do not buy at Amazon, but I am making an exception for the iPad Mini.Let me start by stating that all my gadgetry is Apple.  We own an iMac, iPod nano, two iPhones, and an iPad 3.  Suffice to say: we like Apple products.Honestly, the reason I bought the iPad mini 16G, WiFi was: one, it can fit in one hand; two, it is cheaper than a new iPad; and three, because I wanted it.So:  I've stated that I'm a loyal Apple customer and probably will be the rest of my life.  It might be that I'm biased when it comes to Apple products as are a large majority of Apple customers.I was apprehensive at first about the display.  When I found out the Mini wasn't using a Retina display, I nearly didn't buy one.  I love the beautiful resolution of my iPad 3.Apple used the same 1024-by-768 as the iPad 2, BUT the screen is 7.9 inches.  In my opinion the display resolution is great.  Not iPad 3 great, but not as bad as I thought it would be.  I have to agree with Apple and say that the 7.9 inch screen is perfect for a smaller tablet.  +1 for MiniThe Mini is 53% lighter than the iPad and 23% thinner--not a major selling point for me, but not a distraction either.  +1 for MiniThe iSight 5 megapixel camera takes great pictures and shoots decent movies for what it is.  I've tried out the FaceTime and it works great--picture resolution is adequate.  +1 for MiniSpeed:  The dual-core A5 provides this device with plenty of computing power.  I was impressed as I thought the Mini's speed would suffer as Apple was attempting to cheapen the product a bit.  It didn't.  Internet surfing is lightning fast!  +2 for MiniI'm satisfied with the battery life.  Apple says that the Mini has ten hours of battery life and they're pretty close.  +1 for MiniI love the aluminum unibody cover.  The thing is sweet looking: sleek, like I'm in a sci-fi movie using some futuristic device.  I heard one dude say it's sexy.  I'm not sure that I'd go as far as calling a hunk of aluminum, glass, and plastic sexy, but it is easy on the eyes.  Apple nailed it on the aesthetics of the Mini.  +2 for MiniAt first, I was peeved about the Lightning connector (I still am a bit).  All my other devices have the old 30-pin connector.  I have only one cable to charge the Mini and four old cables that will eventually be obsolete.  The smaller port is great though--it looks much better, more compact and I understand why Apple did what they did...but it still sucks when you have multiple other Apple devices with the old port.  Everything has to change sometime, I guess.-1 for Mini (not Apple's fault, my preference)Hey: when the apps and widgets get boring Siri's there to ask millions of important questions to.I used an iBlason case to protect the Mini and so far like it:  http://www.amazon.com/i-Blason-ArmorBox-Convertible-Friendly-Protection/dp/B009PPKFNI/ref=cm_cr-mr-titleSo with all that said and much more not mentioned: I'm a fan of the Mini, but I think the device was overpriced a bit.  I still paid the extra $130 over the Kindle Fire HD, because I prefer Apple, but after playing around with a friend's Fire HD 7\", I was impressed with the Fire and the price.In the end it was a matter of preference for me choosing Apple over Kindle.  I'm very satisfied with my purchase of the Mini and my kids love it too.  I would recommend the Mini to anyone and everyone.  Great product!*Update 11-20-12It has been several weeks of heavy use for the Mini and I have very little negative to say about the device.  Again, I bought it because it was Apple and for the Apps and because I like Apple products.I wish the external speakers were a little louder, but one can use headphones and be fine.  For our family's media consumption the A-5 processor is adequate.  The device seems to stream the Time Warner App without buffering or glitches--I really cannot complain.Our Mini is used on and off all day long starting with a fully charged battery in the morning and about 10-15% life at bedtime (9:00pm-10:00pm).  That's using mostly gaming Apps and some video streaming.  For us, that's about right.  If a device's battery can make it through the day, I'm fine with that.", "Date": "November 6, 2012"}, {"Title": "Awesome (read entire thing)", "Author": "Kerrigan Soura", "ReviewID": "RH8MBF7692B4P", "Overall": "5.0", "Content": "iPad mini review  I passionately love the iPad mini. My friends said it was pointless but its not. It is physically smaller than the iPad but it has the same excellent quality. Its a lot lighter than the iPad. You may think its to small it's not, the commercials kind of make it look smaller, you get used to the size very easily. The size is very convenient  and it still feels like the full iPad experience.It is fast as well. The camera is nice and the speakers aren't bad like the iPod touches. I actually prefer the size it's not big and bulky, you can take it out in public and feel a lot less awkward than with a real iPad. If you want a tablet for strictly work use maybe the iPad is a better choice, however if you're just going to use it for a work and games, entertainment, photos etc. I definitely recommend it.Display  It has a gorgeous display. It is not retina display but I've compared devices with and with out retina and there is virtually no difference in the display. It also has an awesome battery life. It isn't less than the iPad. Apple really did go back to the very beginning and put a lot of effort into this device. It is much better than the kindle fire. This device's light weight, beautiful display, fast speed, quality speakers and camera, makes it easy to use, take on the go, present, and enjoy!Camera  It has a camera, the pictures are like cell phone pictures, but if the room which you're in is bright and you give it a second to get focused the camera is magnificent, especially outside on a sunny day!Siri  As you probably know this device includes Siri. Siri I often don't use because I'm not in the habit of it. But when I do remind my self it is helpful. Not only is it helpful but to play around without, it has a (specific) response to everything you say. Also I find it really neat that if I'm typing a document I can just press a button and it types what I say, which is wonderful for rough drafts and stuff! This also works if you're searching something etc.Space & Apps  I got the 16 gb version however the space I had available was only about 13gb, which really wasn't too bad, just take in to consideration, that 3 of the gbs  won't be available for use because of what is already installed (no, you cannot delete what is already installed). So, if you're someone who takes lots of videos, photos, plans to make movies, have apps where a lot of data will be contained (iMovie, pages, etc.) Get the 32 gb one, or you can do what I do is take videos and photos, then upload them onto my computer, then delete the data entirely from my iPad, beacause videos and pictures take up a lot of space, however one or two short videos are fine. Just manage your space, but 16 gb is really a fine amount (I'm only at 7).  The apps on apple devices are magnificent, it's not just fun games, there are some for creating documents, educational ones, apps for teachers, photo editing, the Holy Bible! Even medical apps, that give you instructions for medical emergencies or problems, and there is a really neat one on the brain, apps that help you find your iPad if it's lost!  There also is iMovie, if you are unformiliar which it, it is this really neat program that allows you to make movies, it simple, and looks extremely professional it s only $5 in the App Store, so worth the money!  V.S Other Products  Yes, there are cheaper things like the Gooogle Nexus tablet, Samsung Galaxy Note, KINDLE FIRE, and other android tablets/computer tablets, but if you have any i-device (iPod touch, iPod nano, iPhone, etc.) you know the experience is way different than android and for many people way better. It isn't much more, and I know people who have gotten rid of there other tablets (in perfectly good condition) for the iPad mini. And it also had a variety of e-reading apps. And the computer/tablet devices are neat... but $700 more. Besides flash it has all the abilities as computers (refer to \"Space & Apps\"), and for the few flash-involved I'm sure there is a computer somewhere in your house.  In conclusion, this device is wonderful. I've been exposed and experienced with multiple devices, this is still awesome!  In conclusion, this device is amazing.  I switched several people to the iPad mini. Tablets are all made by intelligent people, but this device is made my geniuses. It has, Siri, good speakers, nice camera, very convenient size, for watching movies viewing photos etc, still light, compact, portable. Beautiful display, cheap price, good battery life, best device ever!", "Date": "May 21, 2013"}, {"Title": "What's not to love", "Author": "Mike", "ReviewID": "R12Z2U98HMAI7C", "Overall": "5.0", "Content": "This I pad mini is great, what I like most is suri is on it and she knows she's the s***.", "Date": "February 23, 2013"}, {"Title": "Made the right choice", "Author": "S. Koets", "ReviewID": "RZRWP0EB16CNF", "Overall": "5.0", "Content": "I debated for a month between the Kindle, Android options and the IPad mini.  I knew from the minute it arrived that we made the right choice.  Satisfaction level with the product gets better and better the more we get to know the device (the only Apple product we own).", "Date": "February 19, 2013"}, {"Title": "Perfect size, easy to set up", "Author": "Kelli Barager", "ReviewID": "R16IOSB1KANX3U", "Overall": "5.0", "Content": "I almost feel bad for people who have to lug around a full size ipad. I highly recommend a mini", "Date": "February 5, 2013"}, {"Title": "$50.00 over Apples MSRP!!!!", "Author": "David M. Garon \"thinkman\"", "ReviewID": "R3VQL1MU042NE2", "Overall": "5.0", "Content": "I can't say enough about this Mini Marvel! It is feather light, yet as full featured as my iPad 2 - only faster. And, as with all Apple products I have purchased over the years, it is totally reliable and the fit and finish is second to none! What I don't understand is why anyone would buy an Apple product from Amazon. I guess a lot of customers are used to really low prices on the products they carry, but in the case of Apple, you are paying more than you would literally anywhere else in the US! Why would you do this to yourselves? Check out Apple.com first to see what a particular product should sell for, and then go to a reputable Authorized Apple Reseller, such as B&H; Photo or MacConnections for the best price. Buy it here and you will be ripped off - mercilessly! CAVEAT EMPTOR.", "Date": "January 23, 2013"}, {"Title": "The item is defective but vendor does not take returns for Apple products. Wonder if it's first quality merchandise??", "Author": "MK", "ReviewID": "R2UHZQWZZ8H0I", "Overall": "1.0", "Content": "I ordered this device and received it promptly but it started having issues with the touch screen. I sent an email to Amazon to the seller about it but have not received any response. The device is useless without the touch screen. It only responds to touch about 1/4 of the time. Can't use the onscreen keyboard as it's pretty hard to use when it doesn't respond to touch. Don't buy Apple products via Amazon/This seller. Go to Apple instead to get working product.", "Date": "October 4, 2013"}, {"Title": "Arrived Fast in Perfect Condition, Great Size", "Author": "T. Hawthorne \"Cropr\"", "ReviewID": "R1OCVNIA1KXUBX", "Overall": "5.0", "Content": "I was hesitant to purchase the ipad mini from a dealer because there were only stock pics and limited description but I'm very happy I took the chance. First, I contacted the seller to ask a question and they replied the same day with an answer so 5 stars for communication. Second, the product arrived in it's original box with the serial number of the device matching the packaging, this exceeded my expectation. Accessories were neatly stowed as if they had never been used. I could find no blemishes on the ipad mini, it looked like new. I took it by my local Apple store to have them check it out and they confirmed that it was like new. They were also able to look it up and tell me when it was originally purchased (Nov) and they registered it to me.I've been using the mini for a few weeks now and I love the size for convenience. It's extremely thin and fits in my purse. I had the Nook Tablet before this and find that they are very similar in size. I also have the iPad 3 and for regular use, I prefer the larger screen. I wanted the mini for travel and it will be perfect. Everything I have on my iPad 3 can be put on my mini so when I travel, I have everything I need. I bought the 32 gig and I currently have 7 full length movies and 25 tv episodes (40+ min each) in addition to 130 songs and 84 apps of which 16 are games so it holds quite a bit of entertainment. I have a little over 2 gigs available. My iPad 3 has 64g so I was worried I'd miss the space.The mini feels much more thin and delicate than my iPad 3 and my Nook Tablet. I worry about it breaking and wish LifeProof had a case out for it. In portrait view, the sides are narrow so holding it just there can be precarious. I let it lay on my palm with my thumb on the narrow edge for more support. The screen size is satisfactory and I've had no screen issues while watching movies. Many say if you are used to the retina display then this will disappoint but I don't have that problem. Movies display in wide width with the ability to increase the size to full screen by zoom. Sound is excellent. Alone it is fine on 5-6 level and with other noise, 7-8 is fine. Camera works with ease and seems to have the same functions as my iPad 3 including front facing camera, zoom and video. Apps made for the iPhone can be increased in size but a little visual quality is lost due to pixelation. IPad apps look great. Overall, I'm extremely satisfied with the product and the seller. I recommend and would definitely purchase again.", "Date": "February 13, 2013"}, {"Title": "Life Changing", "Author": "Dulce Cira", "ReviewID": "RZXSIUHGP2XD3", "Overall": "5.0", "Content": "Man this is an amazing product. Its better than the iPad, I would say. It's much easier to handle because it is not as bulky as the iPad. I feel that I don't even need a laptop anymore. With all the apps out there, I don't think we will be needing laptops pretty soon. This product makes your life easy.Compared to the regular iPad, the mini is light!!!  Now that i take a look at the ipad i think its way too heavy and uncomfortable, makes the mini feel like a feather. Hands down!", "Date": "February 20, 2013"}, {"Title": "Does not live up to it's hype", "Author": "BGH", "ReviewID": "R32Y2JP4Q50BXQ", "Overall": "3.0", "Content": "I  made the mistake of purchasing the iPad mini, mainly because it was more compact to fit in a briefcase. It had great reviews & such, so figured it would be a functional tablet. And it probably is for playing games, music and things like that. But it is really lacking as a tool to use in business.The iPad mini, & I have no reason to believe the iPad is any different, comes without an office suite, a way to easily transfer files from a PC unless you use the Cloud or the iTunes Utility, which for security reasons cannot be used in my business, & few apps are without a cost. In this world, people often have multiple platforms at work & home. Even in the app store, there is no direct link to business apps. You must search for everything. With lots of time, searching & frustration at times, the tablet is now functional. I will not go into the lack of multitasking & other small inconveniences.Trying to get a manual for this unit was another treat! You would think it would be included on the desktop as a PDF file. Every Web search to find a User Manual lead you to links to other sites wanting you to download their PDF, Anti Virus or some other tool bar software. When I finally found a manual but it was specific to the iPad even though the internet search said it was a manual for the iPad Mini. Still haven't found anything very specific to the iPad Mini that I own. I will use the iPad with iOS 6 manual and hopefully it covers everything if there are differences. With Android Tablets it is just a matter of searching for the word pdf and the tablet and up comes your manual. Apple has to tie everything into collateral sales by linking with everyone.Paired with a Bluetooth keyboard, it is easy to put in data & I would recommend adding one. I also find a stylus works better than a finger on this tablet. Thankfully I got the 64G mini or would be in trouble since it is not expandable with a Micro SD card. Bad for consumers who have to pay more for this & only good for Apple's bottom line.I could go on about the iOS vs others, etc. but it comes down to having setup & used a Samsung Galaxy Note 10.1 in a few hours & I saw how easy it was to use, I would never recommend an iPad Mini over the Galaxy Note 10.1 for business use if your business is Windows centric rather than Apple based. Transfers of data is painful when you want to share between the two operating systems.", "Date": "January 27, 2013"}, {"Title": "Nice supplement to MacBook Pro and iPhone", "Author": "B Charles \"duneguy1\"", "ReviewID": "R2NR4NC9VDMFDV", "Overall": "5.0", "Content": "Great addition for bedside web surfing, reading, and light gaming.Pros - super quick web browsing, VERY light weight and very thin, many quality apps (including Kindle), total integration between my MacBook Pro and iPhone, stellar support network, quality tasteful construction.Cons - difficult to find locally - took me about 5 days, price can always be lower, like to see one more size iPad between the regular size and the mini - that would be perfect.It's not fair to compare the iPad Mini to my 1st gen Fire but I will anyway as they both filled my bedside gadgetry niche:  the iPad's Safari blows away the Silk browser all day long, it's quicker and does not lock up on certain pages.  The iPad (feels) about 30% lighter than the Fire.  The app market (not surprisingly) goes to Apple.  However, with that being said, the Fire was and is still a great product for what it is designed.  I am gifting my Fire to someone that has no experience with tablets and predict they will find the Fire quite appropriate and just as enjoyable as I did.", "Date": "November 10, 2012"}, {"Title": "iPad Mini Pro's and Con's", "Author": "daniel", "ReviewID": "R3N957BLJTTZRB", "Overall": "3.0", "Content": "Pro's1.Brilliant design2.Great battery3 Tremendously light and portable4.Extraordinary brushed metal design Con's1.Smaller touch targets2.No retina display3.Expensive compared to other products4.No boxed headphones or dock adapter.", "Date": "November 2, 2013"}, {"Title": "Ipad", "Author": "Dale W.", "ReviewID": "R1BPZDZJRB8BMJ", "Overall": "4.0", "Content": "Very pleased, great tool , however, wish I had opted for a wifi plus 4g model for traveling. .. Next time.", "Date": "December 23, 2013"}, {"Title": "Size doesn't matter!", "Author": "jon", "ReviewID": "R28ZZ8W6DGBSQA", "Overall": "5.0", "Content": "I just opened up my new iPad mini and I have to say I really love it! I am a huge Apple fan seeing as I also own a MacBook Pro and an iPhone so I was already very familiar with the iPad's interface and software. What's great is the fact that Apple makes it so easy to download and manage all your media between their various products. I proceeded to sync all my music, movies and games/apps onto it and then came the fun part: testing everything out. I was pleasantly surprised with the quality of the speakers especially for a tablet. The sound was loud and crystal clear. Movies look absolutely gorgeous even on this model which DOES NOT have the retina display. Since I stream movies through Netflix and Amazon I felt it wasn't worth spending more money on extra hard drive space that wasn't going to get used. Games that I usually play on my iPhone work awesome on the Mini mostly due to the larger display. While some might like the bigger screen on the iPad, this one is just a tad smaller (1.8 inches to be exact) which in all honesty is plenty big in my opinion. When holding the Mini, which you can do with one hand by the way, it definitely feels more like a tablet vs. holding a clipboard like it's larger sibling. I will definitely get a lot of use out of this product. I highly recommend to anyone looking for an awesome portable tablet.", "Date": "December 21, 2013"}, {"Title": "Smaller, lighter weight iPad mini", "Author": "Michael", "ReviewID": "R1RVUU07MRZ1RG", "Overall": "5.0", "Content": "So after already owning two iPads in my household, an iPad 1, which I purchased when the iPad was first released and an iPad 2, which belongs to my wife, it was with reluctance that I was looking in a retail store at the new iPad mini.  After all, do I really need a third iPad?  There was a decent sale at the time and I decided to go for it and I have not regretted the purchase for one minute.Overall, the features, speed, front and rear camera, etc. are very comparable to its larger counterparts, however it is available in this smaller, more lightweight, compact and easier to carry mini form.  I find that taking this with me on a business or personal trip makes the bag much lighter and for equivalent features.  Taking photos with this product is much less awkward looking too than when i see people posing for the full size iPads (I still can't bring myself to do this).  I would say size wise, it is about 70% of the full size iPad but this has no great impact on the ability to read emails or type any differently than the larger iPad.  The full size iPads almost seem too large now that I am accustomed to the compact mini.I don't want to get into all the features of the iPad overall as I have not noticed any differences between this and my other iPads.  I have heard the RAM is less on the mini, but I have not noticed any difference as previously indicated.  It is well integrated with other Apple products, which I love about the iPads.  I can take a picture with my iphone and instantly it appears in my photostream for viewing on my iPad, iMac or AppleTv screensaver.Overall, great buy, even with two other iPads, I don't regret this purchase one bit.", "Date": "December 20, 2013"}, {"Title": "A great addition to  my desktop for use during TV programs", "Author": "B. Erickson", "ReviewID": "R3FAD2PPSL0Y7E", "Overall": "4.0", "Content": "Works great and it's convenient.  Small and easy to carry during travel.  Very easy to use after I got some tips from my grandchildren.", "Date": "November 20, 2013"}, {"Title": "Its an iPad 2.... but smaller!!!", "Author": "GorillaDrummer", "ReviewID": "R3I65JQVB2SEGN", "Overall": "4.0", "Content": "This was a gift for my wife on her birthday. She always wanted an iPad but didn't like the larger display because it didn't fit in her purse. This is basically a smaller iPad 2 with similar features, same processor (Dual Core A5), and cheaper price. If you are a fan of Apple iPads its a great buy.", "Date": "October 5, 2013"}, {"Title": "PCer becomes Apple Convert Overnight", "Author": "RAYMOND P DORNEY", "ReviewID": "R2P1TQ2JYVPL3D", "Overall": "5.0", "Content": "I've always purchased and used a PC both at home and at work.I've also prided myself in fixing the many PC problems I've encountered over the years, but certainly didn't appreciate the time and effort I had to spend on PC problems.I recently bought an ipad mini and love it. I wanted it as a quick access to the internet (wifi) and email.  Though I had never used an Apple before, I was really surprised how everything seemed rather intuitive and how quickly I was using it with ease for so many tasks. I have also found that the ipad mini is everything that it is advertised to be - the long battery life, many available apps, easy to use, etc.  I will soon be needing a new PC and am seriously considering a switch to Apple.  A friend of mine got tired to spending so much time just on keeping his PC updated and protected that he decided to switch to Apple 3 years ago and has never looked back.  I may follow in his footsteps as a result of my experience with Apple's ipad mini.", "Date": "September 17, 2013"}, {"Title": "S I M P L Y  I N C R E D I B L E", "Author": "siafu", "ReviewID": "R3E6EABPK408HO", "Overall": "5.0", "Content": "I've had mine for almost a year of hard use on a daily basis for both work and play. My iPad mini has become an indispensable tool. This is a near perfect and high quality device, built like a tank, sexy design, power easily lasts me all day long in spite of intensive image processing use, excellent display even though it's not retina, extremely functional, I can easily hold and work with it in one hand. If you want a device that works consistently well all the time, then pay the higher price and get an iPad mini - you get what you pay for and it's definitely worth it. The mini has set and maintains the high standard by which other small tablets are measured by. Hold one in your hand, you'll see.", "Date": "August 26, 2013"}, {"Title": "Good product, no more no less.", "Author": "cac22", "ReviewID": "R1V3R818Z92BG1", "Overall": "3.0", "Content": "I got an ipad mini, not from Amazon, but from a reward program, so was basically free. I received the 32GB version. I have to say it is an OK device, but overall, for screen resolution and overall sluggish performance, I still prefer my old Ipad2 and still, my Nexus 7 (first gen) remains king. I was hoping the ipad mini would satisfy my tablet needs, but it just made me want the new Nexus 7 32GB LTE even more...(if only Asus/Google could release it already!)Even I have to say that the edges on the face of the device are rough, not very smooth. I thought that it could be my device only, but stopped at two Apple stores in Greater Toronto area, to find that most Ipad minis on display had same issue.For those Apple fans ready to pounce: I own 4 Iphone 5, an Ipad Mini, an Ipad2, 2 ipod touch 4th gen, so I am giving an honest opinion here, I also own a couple of Android devices, but to me this Ipad mini seems under par...)", "Date": "August 24, 2013"}, {"Title": "Everything and more!", "Author": "DHopewell", "ReviewID": "R3Q5FKW8VL33RC", "Overall": "5.0", "Content": "I had an idea that the iPad Mini would be wonderful but it has exceeded my expectations! It is small, portable, but very powerful. Also, the service from the seller was great! I purchased a refurbished one and it was just as described.", "Date": "July 30, 2013"}, {"Title": "Can't get enough of the Mini!", "Author": "LearnIIBurn", "ReviewID": "RDWNOYZWLEB3F", "Overall": "5.0", "Content": "I absolutely love this tablet! I own many devices in my nerdism and line of work. I have owned an iPad 3, Nexus 7, Chromebook Series 5, all the iPhones, many Android phones by HTC and Samsung and now, my beloved iPad Mini.The thing about the mini is really the size and design. That outweighs everything else for me. It's gorgeous, a pleasure to use, and a pleasure to hold. The bigger iPads, no matter how powerful or brilliant, don't get as much use for me because they are hard to handle. I can never comfortably hold a big iPad for too long without noticing discomfort. Not the the larger iPads aren't wonderful devices, they just end up staying at home for me.The mini goes everywhere with me. It's fast enough to do everything I want it to do. The screen is still great even through non-retina, and I hardly notice the lower resolution at all. It's just a really awesome little device, and should be bought if you are thinking about it. Just buy it, you won't be disappointed.", "Date": "July 22, 2013"}, {"Title": "First time using ios", "Author": "gsisson", "ReviewID": "RILCUTOL62J2I", "Overall": "5.0", "Content": "I'm actually an android user, still prefer the android way. But this hardware is really something. Increadibly fast, very satisfied with the weight. ios7 is amazing.", "Date": "October 15, 2013"}, {"Title": "BEST MOBILE TABLET", "Author": "reviewmeister", "ReviewID": "R2WH7DB9RJQU2L", "Overall": "5.0", "Content": "My wife got an iPad 2 as a gift. She has an iPhone as well so she let me use the iPad 2 and I was immediately hooked! The problem with with iPad 2 is it's too big and heavy. So I got myself an iPad mini it's much lighter and easier to lounge at the couch with.Also we have a small house so I thought maybe this could replace our PC. So now we no longer have a home PC. I can do everything I need with my iPad mini. Banking, surfing, bill paying, watch shows etc.Thank you Apple for the mini!It's much better than the regular old bulky iPad", "Date": "October 10, 2013"}, {"Title": "iPad Rules!", "Author": "Rio", "ReviewID": "R6FDA4ZG8LCBO", "Overall": "5.0", "Content": "Regardless of the hype Microsoft has given their new Windows platform, the iPad is still the best. I bought the mini to replace my old iPad and after comparing tablets, I stayed with Apple. I love the mini for a number of reasons, primarily because of the operating system and ease of use. Windows is just not as good.", "Date": "October 10, 2013"}, {"Title": "Constantly using my iPad mini, reliable Apple product", "Author": "Kathi R", "ReviewID": "R328G9X83PB95R", "Overall": "5.0", "Content": "I am a happy Apple fan. I have a MacBookPro & an iPhone 4S, 16 GB. A priority for me is having products that do what I want understandably, reliably & w convenient, knowledgable & quick tech support if needed. I have found Apple products are that way so didn't even consider any other brands.I find that the specs for this & the iPhone 4S are somewhat similar--processor, camera, etc & I got the 16 GB version for both.I was using my MacBookPro for business & to show a presentation at the table. But, while very light for a laptop, it still was big to carry around.I find that now I don't even turn on my Mac every day. I can browse email & the web & a lot of apps just fine on it.Since I'm new to the iPad, I wasn't sure just how useful it would be. Well it is. It makes a good e-book reader. Although only have a couple so far. I got the Kindle app since one e-book I wanted needed that format.I also is a very nice size to carry around w me. I got a new purse that is not large but has a pocket on the outside into which the iPad mini in its case just fits.I also like that I can do iMessages on all 3 of my devices & while I can do things on the iPhone, the iPad mini is much easier to read & type on.I bought the Belkin case at BestBuy that looks like a pad folio w snap in holder for the iPad. So its not totally obvious that its an iPad, looks nice & both protects & provides a nice stand for it that works well on table or on my lap.I'm also using my iPad mini rather than a hard cover bible for church, using the YouVersion app. The combo is agile enough to jump around to different passages & easier to carry.As one who is a touch typist, I was concerned about whether I would need an external keyboard, but have found that I can type pretty well on it. Not quite usual fingering--more like several finger typing but have been able to use it to take notes at seminars & meetings. This using the Pages app. I also have purchased the Keynote Ap thinking I would use it, but really use the free Slide Shark to handle a co presentation.  I'm thinking of purchasing the Numbers app. Need to review how to sync the Apple apps between the mini & my Mac.As far as connectors, don't have the myriad of Apple accessories that some are concerned about. I had previously gotten the InCase car charger from the Apple store for my iPhone (after the one I got at Walmart quit working after 8 mo). This is the kind that is in 2 pieces so one plugs into the car power outlet & then any usb plug can plug into it.  So if my iPad Mini needs charging, I can use its cord to plug into the outlet & charge in the car.Also, I bought it at the Apple Store & since I had One to One through my Mac, I could use it to learn my iPhone & my iPad. Unfortunately having recently moved to Portland, OR, the Apple Store is way across town so not as convenient as I was used to. Haven't been there yet. I need to go as sometimes I tap to close a Safari window or click on a link w no response. So should get the touch screen checked (as I did w the touchpad on my previous MacBookPro where they find certain portions not responsive & fixed it, quickly.Speaking of the Apple Store, I like the fact that I have that resource--even though now its less convenient than it was.  This is 1 reason that I like Apple products. If there is an issue,  I remember w other devices (Windows computers & Windows phone) where the service was not very good. My windows phone had major issues (couldn't properly handle daylight savings time & other issues). Verizon people were nice but didn't really help so got runaround & some never did get answers.  They knew a lot of basic stuff, but now w smart phones, they can't know all of them well.Also previously w a device from 1 co & OS from another & then other apps, I have gotten the run around w each blaming the other & being caught between them. Or maybe not even blaming the other but having to make multiple contacts to get an answer.I have found Apple Stores to be on top of things & their service turn around time is very fast--several times faster than they had promised.The other thing w Apple products that I have found is that they just work. I've had hardware & software failures w other computers & phones. I got my iPad Mini I think in early March. Working fine. My iPhone 4S is 22 mo old & working fine (they had to do a reset & upgrade to iOS6 1 time, quickly taken care of at the Apple Store).So for me, having products that do what I want, reliably & w tech support that quickly takes care of any issues that may arise is very important. I had not found that level of reliability & tech support w other products. I expect the same level of continued reliability & service if needed w my iPad Mini.", "Date": "September 28, 2013"}, {"Title": "Excellent device", "Author": "A Guy in Indianapolis", "ReviewID": "R3J5LJI5PL2B7Z", "Overall": "5.0", "Content": "Pros: Lightweight but solid-feeling.  Easy to hold in one hand.  Lots of cool apps at the App Store.  Operating system runs fast and rarely crashes.  Movies from Amazon Prime look awesome.  I have pretty much stopped using my PC now that I have this.Cons: High price- I got the 32 gig at Meijer when they were having 35% off if you open a charge account, otherwise I couldn't have afforded it.  Crappy sound through speakers, but ok with earbuds.  Rear facing camera not nearly as high quality as front facing camera.", "Date": "September 17, 2013"}, {"Title": "Great little computer", "Author": "JoeBotts \"bottieri\"", "ReviewID": "R2HSIJ3U6RF9XK", "Overall": "5.0", "Content": "I love this mini-iPad. It's small enough to hold in one hand (as compared to the standard iPad) and yet big enough to actually see and use (as compared to my iPhone).I keep it next to my favorite chair so I can check and respond to email without having to go to my desktop computer.", "Date": "September 13, 2013"}, {"Title": "This replaced an iPad one/original", "Author": "Buck", "ReviewID": "R3SSFN1ZXND1DK", "Overall": "5.0", "Content": "My iPad one original died. Even the 'geniuses' bar couldn't revive it. I didn't know what to do. I was addicted. My only complaint with the original was that it was too big to handily fit on my person. The mini gave me that quality, and more. Additionally, it has 'Siri' and two cameras, which of course the original didn't. The price was half a replacement and all my old aps worked fine. It was easy to pick up where I left off, I just downloaded my latest back-up and it was like I had my original back with all the extra niceties mentioned above. It came overnight, I barely went through withdrawal.", "Date": "September 13, 2013"}, {"Title": "What the iPad should have been when it first came out!", "Author": "::TRIX::", "ReviewID": "RTSZW9NQPT0EC", "Overall": "5.0", "Content": "This is worth it. Plain and simple. RETINA or NO RETINA...who cares! I does exactly what I need it to do and its size and weight are the cherry on top. I only wish I would have bought the 32GB instead, but 16GB is doing me fine for the most part, just have to stream and email certain things instead. I think its for the best though, keeps me focused (which is why I bought this, for work mainly). But I love it!", "Date": "September 12, 2013"}, {"Title": "Just right for me!", "Author": "Jonah Koonce", "ReviewID": "R3U0I4J8R3HX6E", "Overall": "5.0", "Content": "I've always loved the iPad, but never bought one for myself because it wasn't really portable enough. I'd rather just use my laptop or my iPod. But now my little iPad is the perfect medium-size for everything that I do. I was at first disappointed that it didn't have a Retina display (most likely will come out in a new model), but honestly I hardly notice. The screen is much sharper than the iPad 2 display. You only see the pixels if you look really hard, but from a normal viewing distance it is unnoticeable. I love my iPad, definitely recommended!", "Date": "September 10, 2013"}, {"Title": "Not a touch pad fan!!!!", "Author": "Stephen", "ReviewID": "RQIQGQB11M7S6", "Overall": "5.0", "Content": "After half-heartedly trying to get used to touch screen on an iPad (I found it too heavy to hold and use).  But when I got my hands on the iPad mini, well - what a difference.  It operates very close to the same way as the iPad, same apps, etc.  I don't like Mac Mail on the iPad, and have been looking for another email client that I can use with both iMac and iPad.  Tried to do this with Gmail and that was a total disaster.You can't carry the Mini in your pocket (too big) but it slips into any number of places in a carry on back pack, or just carry in your hand.  The picture isn't retina - but it doesn't make any difference at this size - the picture is fantastic.Beware that some of the Apps are cloud based (on any tablet), and when you are out of reach of wi-fi - you flat don't have the app!!!  I learned the hard way on a recent trip.  I don't maintain any phone based connectivity, so I bought this iPad mini with just wi-fi, and find that I don't have trouble finding a hotspot (I use Boingo, and it really helps).Small, but not iPhone small, light (much lighter than the iPad), great picture, tons of apps, great battery life - it is a winner.", "Date": "August 25, 2013"}, {"Title": "Love it!", "Author": "DG", "ReviewID": "R1UZNTH89MF1EF", "Overall": "5.0", "Content": "Love it so much I traded my android phone in for the iPhone 5!  Fits in my purse. Great response time. Awesome picture and sound.", "Date": "March 25, 2013"}, {"Title": "Perfect size!", "Author": "Alexandre S Steinberg", "ReviewID": "R3CNYJHVKHFUQW", "Overall": "5.0", "Content": "The same great functionality and applications of iPad in a perfect size.The smaller display is enought for most tasks and much better to read on bed or to carry for a meeting.", "Date": "March 24, 2013"}, {"Title": "Perfect size!!", "Author": "Amber Mark", "ReviewID": "R1UQ13IIMQU5W", "Overall": "5.0", "Content": "I love the mini. It's so compact and easy to use. Might get one for my 2 year old. She loves fruit ninja!!", "Date": "March 22, 2013"}, {"Title": "Love it", "Author": "Ronda Corriher", "ReviewID": "RUQCAW18G1KZD", "Overall": "5.0", "Content": "I really love my Ipad mini.  It is lightweight and small enough to carry in my purse.  I take it everywhere.", "Date": "March 20, 2013"}, {"Title": "Have it! Love it!", "Author": "Tamee33", "ReviewID": "R2FNF9F9AO3EEG", "Overall": "5.0", "Content": "I am just now on the cusp of what this thing can do. The best part is that I can hold it and type at the same time. It fits in my purse, and it runs FAST! Never have had any issues with it, and I've had it since Christmas.", "Date": "March 10, 2013"}, {"Title": "Convenient, small enough to fit in purse", "Author": "Tammy Wynn", "ReviewID": "R1LDA8OW77LA00", "Overall": "5.0", "Content": "Convenient. Highly recommend! Fits in purse but bigger than phone so easier to read than iPhone. Cheaper than iPad! I cloud for family calendar sinc.", "Date": "March 10, 2013"}, {"Title": "Awesome!", "Author": "overbybr", "ReviewID": "R2VY4TD8ROQ6JD", "Overall": "5.0", "Content": "So much better than the standard iPad! The form factor of the Mini is exactly what I have been waiting for, and it will be a gadget that I will keep for a long time. If it breaks, I'll get another one!", "Date": "March 5, 2013"}, {"Title": "Its a Hit", "Author": "SanPa", "ReviewID": "R25J6SOTJQYFEV", "Overall": "5.0", "Content": "I bought the mini as a gift for my wife.  She loves it.Why the mini? Because it ergonomically better v.v. less fatigue when hand held, particularly for users with smaller hands.  The CPU responsiveness is good, the screen is sharp with crisp refresh, networking is a cinch to set up, and touch controls while seemingly  less sensitive than a large screen do afford good digital resolution.My wife has been using the iPad at home and on the job.  When used at home, she scans the news and researches topics for future lessons.  At work, she as example used a clever wave motion app to demonstrate physical principles of wave motion to her students.  Predictably, a third of her students had downloaded the app onto their iPhones within 5 minutes ... that's engagement! And, that she's using the iPad to demo scientific principles in the classroom ... very cool per her students.I think this gift earned a few extra brownie points, or at least one get out of the doghouse credit.", "Date": "March 2, 2013"}, {"Title": "Power in my hand", "Author": "OLGA AGUADO", "ReviewID": "R1U68KNQTCGA5Z", "Overall": "5.0", "Content": "Fast, simple, smart, fun, lightweight, dont have Bad luck but have a cloud no the top!This buy is a gift of my mother in your birthday... She have 60 years and she hope learn your emailsIn the ir romm.Se open the box, setting the ipad, connetct the wifi... And enjoyTahonas steve jobs...", "Date": "March 2, 2013"}, {"Title": "Ipad", "Author": "Michele A. Hopper", "ReviewID": "R9R4UMXWR7L3Y", "Overall": "5.0", "Content": "It is all I need. I am loving it. I wish I could have gotten one sooner.. the graphic are wonderful. Thank You", "Date": "February 26, 2013"}, {"Title": "Best Tablet on the Market Today", "Author": "Marshall Steeves", "ReviewID": "R3NGVQ29C66WWQ", "Overall": "5.0", "Content": "The iPad mini is a must have.  Hands down.  It is beautiful, aesthetic, easy to use, and intuitive.  There are more than 300,000 apps designed specifically for it and they work beautifully on the high resolution screen.  While it is not Retina, this does not make it any less of a good screen.  It is crisp, clear, and responsive.  The fact that it fits in one hand also ads a level of portability to it that the iPad 4 does not offer at this point.  It is extremely light and thin, as well.  Overall, its aesthetic and simple design, thin and light architecture, and wonderful screen make it a must buy for future tablet owners.", "Date": "February 25, 2013"}, {"Title": "Why \"settle\" for anything less?", "Author": "MikeyInTheD", "ReviewID": "R1VU86FVV4DPPS", "Overall": "5.0", "Content": "Why would you settle for something that \"might\" offer a similar quality or user experience?  I tried a Nook tablet and really disliked it.  I got the iPad mini 16GB Wi-Fi black version for Christmas.  I've been using it a couple months and couldn't be happier.  It performs flawlessly.  The graphics and screen are on-par with any other tablet I've seen.  The one flaw people point out with the iPad mini is the non-Retina display, but I find no fault with the screen.  I have had every iPhone and an iPad 2 and the iPad mini is my favorite Apple product yet.  I don't need the bigger screen of the iPad 4.  I would say anyone desiring a tablet should just go with the best and avoid issues with the complexity of Android or small app market with Nook or Amazon.", "Date": "February 22, 2013"}, {"Title": "Excellent Product", "Author": "Daniela Torres", "ReviewID": "R27FKS0Y9HNLXK", "Overall": "4.0", "Content": "I've purchased this for doing some reading. I have a lot of material in PDF and I wanted to have a good tablet to read on, this is a really awesome tablet for doing that. About the screen, is true, is not a retina display but it doesn't suck at all you can do reading and everything you want to without any kind of issue because of the screen resolution. The apple integrated apps for doing reading and other stuff are really great, the iBook app is awesome for reading PDF you don't need to download anything else is right out of the box. The only problem that I had is that I own a Galaxy SIII and is really shocking how closed an limited you feel when you go from android to iOS, the system is not open at all, is like apple already limited the user to use the tablet the way they want you to use it and not the way you want to use it, you cannot download any material (music, videos, etc) directly from the internet, if u want to do that u can download it from your computer and transfer it to your ipad using itunes. EVERYTHING you want to do you have to doing from itunes, that's the downside. On the other hand the tablet is simply beautiful, super light, super well constructed, super comfortable to use I can't get tired of using it.", "Date": "February 21, 2013"}, {"Title": "Espectacular", "Author": "Patricio", "ReviewID": "R11WEGHPYDW8CW", "Overall": "5.0", "Content": "El iPad Mini me parece espectacular, muy intuitiva, con el tamaño exacto com para leer mientras viajo, la pantalla perfecta para navegar en internet.Lo recomiendo, sobre todo para las personas que viajan.", "Date": "February 21, 2013"}, {"Title": "Love!!!", "Author": "cmdoz", "ReviewID": "R39MJD1VQURGZF", "Overall": "5.0", "Content": "The only issue I've found is the battery doesn't last as long as I'd hoped! Have to charge it often... & since I use it a lot it's kinda inconvenient :))", "Date": "February 21, 2013"}, {"Title": "Wow", "Author": "bobbydigital", "ReviewID": "RY7XFY1CNPDOO", "Overall": "5.0", "Content": "This product totally met my expectations. Way to go Apple. The size is just perfect and allows me to easily use my fingers to interface with the device whilst holding with both hands.", "Date": "February 20, 2013"}, {"Title": "Perfect!", "Author": "Isabel Ortega", "ReviewID": "R23P5EWG5ZVOEJ", "Overall": "5.0", "Content": "I love my iPad mini! It is everything I wanted in a tablet and more. Anyone thinking of buying this, don't hesitate at all!", "Date": "February 10, 2013"}, {"Title": "Good", "Author": "Jose Danies", "ReviewID": "R3L1CR5RUIIJU2", "Overall": "5.0", "Content": "Muy buen producto y entrega a tiempo , lo recomiendo , calidad y servicio , very good, excelente . .", "Date": "February 6, 2013"}, {"Title": "Excelente vendedor", "Author": "Miguel", "ReviewID": "R2SSORMBYX3QN5", "Overall": "5.0", "Content": "El producto llego como lo acordado en el perfil, caja sellada con todos sus elementos en perfecto estado. Envió en el tiempo requerido. Comprado desde Venezuela.", "Date": "February 5, 2013"}, {"Title": "No substitue", "Author": "G Man", "ReviewID": "R7LVA58IV5R09", "Overall": "5.0", "Content": "got this for my wife ( B - day ) present.  when it comes to tablets i could go for any brand really as long as it is functional. Except my wife wanted an ipad and since it arrived before her birthday i was able to surprise her with it.  when it comes to gifts for that special someone you really cant low ball it or substitute.", "Date": "February 2, 2013"}, {"Title": "LOVING IT", "Author": "Kathryn", "ReviewID": "R3AD9SS5FPL0A1", "Overall": "5.0", "Content": "This is the best product. I love how small and lightweight it is. It came quickly. Couldn't ask for a better birthday present to myself!", "Date": "January 29, 2014"}, {"Title": "simply the best", "Author": "drpsp", "ReviewID": "RSTH6CPV55U06", "Overall": "5.0", "Content": "This is the best tool I ever bought for myself. I carry it everywhere, sometimes even leaving the smart phone behind. Available applications are numerous enough to allow me to do almost anything I take a fancy to do on a computer. I sometimes wonder whether my father, an electronics engineer born when radio was born, would take as much pleasure in this spiffy little 21st century machine as I do.", "Date": "January 29, 2014"}, {"Title": "For books and documents", "Author": "JoshTorresDJ \"Torres\"", "ReviewID": "R2PDF5J2ELXX41", "Overall": "5.0", "Content": "You don't need the retina, this iPad mini looks great and has great battery life.If you're getting it for d/l books and working with documents then it is great. If you're into gaming and watch a lot of videos (specially Pixar style of movies) then the retina ipad would be better.", "Date": "January 29, 2014"}, {"Title": "Christmas gift for me", "Author": "A. O'Banion", "ReviewID": "R1MF7HDZI136XU", "Overall": "5.0", "Content": "I bought this with Christmas money and I am so glad I did, I love it!  Everyone in my family has their own ipad and I didn't think I really wanted one but I really do love it and its so much easier to pick it up to check my email or whatever versus turning on the macbook.  I really like the size of this one, so glad I opted for the mini!", "Date": "January 28, 2014"}, {"Title": "Merry Christmas", "Author": "Elizabeth Manning", "ReviewID": "R1J2VZF789ZY56", "Overall": "5.0", "Content": "This Christmas gift came on time for Christmas wrapping, despite being ordered the week before Christmas. My husband loves his Mini. It has done a good job of replacing his dying laptop for watching movies and surfing the internet.", "Date": "January 21, 2014"}, {"Title": "Buy this", "Author": "T. Turzi", "ReviewID": "R2ICM2MK8PPNR4", "Overall": "5.0", "Content": "Buy this.  Don't bother with any of the others - I purchased 2 Kindle models and a Google Nexus before returning and buying the iPad mini.  It's the perfect size to throw in your purse, read, watch movies, shop, etc.  It's integrated with my Mac and iPhone.  I absolutely love it.  No regrets.  Retina display is nice on the more expensive model, but I wasn't comfortable having a $400 device for my kids to destroy.  I bought one for my son and now have since purchased another for my other son and one for myself.  It's perfect.  My boys are also addicted to it!", "Date": "January 20, 2014"}, {"Title": "Such Wow!", "Author": "Rebecca Bracken", "ReviewID": "R2WEU52I15QGQP", "Overall": "5.0", "Content": "Got it for Christmas. Just what I wanted. Great for games, music, and videos. Love the way it fits into a pocket!", "Date": "January 20, 2014"}, {"Title": "Awesome machine", "Author": "Philo Hooke", "ReviewID": "R61IHWLEQJ4LT", "Overall": "5.0", "Content": "Found way more uses for it than I originally intended.Its one of those once you get it you wonder what you did before you ever had one", "Date": "January 20, 2014"}, {"Title": "Very happy with my mini!", "Author": "john macchitelli", "ReviewID": "R30IV0O4FF7FMO", "Overall": "5.0", "Content": "This device works very well and was easy to set up and customize.  Love the size!!I highly recommend it as a reader and versatile tablet.", "Date": "January 20, 2014"}, {"Title": "Why I Like My iPad Mini", "Author": "Botco", "ReviewID": "R368NN9R2VUTV4", "Overall": "5.0", "Content": "I love my iPad mini.  It is better than using my iPhone all of the time to check emails and play games.  Plus a bought a keyboard thsat lets me type,  It fits into most of my pocketbooks for carrying around.", "Date": "January 19, 2014"}, {"Title": "Not Impressed", "Author": "L. Collins", "ReviewID": "R3NC492CHOU2ZC", "Overall": "2.0", "Content": "I've had the Apple iPad mini for about 3 weeks now and in that time I've had nothing but problems with it. From a disturbingly common loss of battery charge after just a short time using it to problems with apps and videos. The iPad just doesn't work like it should and I'm really disappointed by that. I've had an iPad in the past and it worked excellently, so I know it's not the company in general because Apple has always had great technology, but this particular product is just severely disappointing.", "Date": "December 30, 2013"}, {"Title": "Wish List Item a Hit!", "Author": "Marilyn Osborne", "ReviewID": "R3OOYEMIUW6UKX", "Overall": "5.0", "Content": "This Apple iPad mini MD531LL/A in white appeared on my husband's Wish List, so I purchased it as a Christmas gift, knowing he had already done the research on what he wanted. (The Amazon Wish List is a great tool for choosing the perfect gift!) I'm rating it 5 stars because my husband has expressed delight in its performance. The day after Christmas, he began loading his iPad mini with apps he already owned had on his iPhone. Using the iCloud, he downloaded his iTunes, art, and more. Because we also have Apple TV, the iPad mini's screen can be displayed on our TV screen, so he has been demonstrating to me all its features. I'm especially impressed by its detailed graphics, visual effects, and fast performance. It is thin, light, and easy to use! I recommend it for anyone who wants a tablet.", "Date": "December 30, 2013"}, {"Title": "gift", "Author": "ignacio a. llanos jr.", "ReviewID": "R12NL3CGFVJL4Z", "Overall": "5.0", "Content": "this was a Christmas gift for my daughter.... all the accessories works fine with this product ... she loves it.", "Date": "December 30, 2013"}, {"Title": "Good as always", "Author": "Tom", "ReviewID": "R2KAY90IQHDD3Z", "Overall": "5.0", "Content": "Product good as always, Apple makes it easy to setup and get going.No issues and like the white color.  Did not get the retina display, and its fine without it.  No need to spend the extra cash.", "Date": "December 29, 2013"}, {"Title": "My girlfriend loves it!", "Author": "Jessie Garcia", "ReviewID": "RN6OVSG048E0H", "Overall": "5.0", "Content": "I was skeptic about buying this on Amazon but I decided to go for it. Came before Christmas and it came in brand new sealed in the box. My girlfriend loves it. No issues so far.", "Date": "December 26, 2013"}, {"Title": "Best bang for the buck!", "Author": "Warren Nickleson", "ReviewID": "R1FWGLUEEO6X11", "Overall": "5.0", "Content": "Like all of Apples products, this iPad mini is top notch! It has good performance and is second to none!", "Date": "December 25, 2013"}, {"Title": "love love love!", "Author": "Ashley", "ReviewID": "R30UGPOQ2DRJ2D", "Overall": "5.0", "Content": "i own this ipad mini and i love it. it runs smoothly and i have no problems with mine. apps do sometimes run a little more expensive for the ipads rather than on iphone/ipod touches. but i normally stick to the free ones anyway though. i love apple products and in my opinion has the best app store and when there is problems with apps then tend to get updates pretty quickly. they are also very easy to figure out. just be careful if you do drop these with no protection they will shatter! i definitly recommend the ipad mini over any other tablet, the extra money for one is worth it.", "Date": "December 22, 2013"}, {"Title": "Better than I thought", "Author": "Pen Name", "ReviewID": "R2PGTDZGEP0Y4C", "Overall": "4.0", "Content": "Its good so far, wife really likes it. Bought it for her home business and other things to free her up from having to use the PC at home all the time.", "Date": "December 22, 2013"}, {"Title": "its great", "Author": "Awesome", "ReviewID": "R1KN075YXK9IHP", "Overall": "5.0", "Content": "this is the perfect size for those who want keep your games video and music togueter whit a nice picture", "Date": "December 17, 2013"}, {"Title": "For Older Folks to Enjoy As Well", "Author": "Warneika Pettway", "ReviewID": "R1YD0AKTAHQ5OG", "Overall": "5.0", "Content": "Brought for mother. She obsolutely loves it. Uses it all the time. She has an iPhone so was easy to use. Just the right size.", "Date": "December 17, 2013"}, {"Title": "LOVED my iPad Mini, until the new IOS7 update", "Author": "sondra crist", "ReviewID": "R20905Z13I949H", "Overall": "5.0", "Content": "Loading we pages, especially YouTube, is painfully slow sinc the new IOS7. If it hadn't been, so incredibly quick, before the update, I wouldn't  have known the difference.Mine, also has the quirk, of sometimes randomly deleting all notes, on my notepad.  Annoying, so I have learned, to email notes, to myself, to save them.Other, than those two things, it's like having an iPhone, that's twice as large. I love it and will get a new one, in two years.", "Date": "October 27, 2013"}, {"Title": "Bought as a gift", "Author": "Mel", "ReviewID": "R2B4HFLS0D2TRA", "Overall": "5.0", "Content": "Great little device and delivery service was excellent.  Could have waited for the new ipad, but this little machine is great. I like Apple", "Date": "October 26, 2013"}, {"Title": "Loved it", "Author": "Nabeel", "ReviewID": "R18LXGW1NRO2U9", "Overall": "5.0", "Content": "As described. I got it 50 usd cheap and still got the ipad winch was almost new. Actually no one could even tell it was not new as the packing and everything was as good as new one", "Date": "October 23, 2013"}, {"Title": "Great item, great seller", "Author": "Sherie McArthur", "ReviewID": "R125UYRIO0LKJ1", "Overall": "5.0", "Content": "Brought this item as a gift for my mother on her birthday and she absolutely loves it.  It arrived very early which was a plus!", "Date": "October 23, 2013"}, {"Title": "I like the size of this better than the regular iPad", "Author": "Dallas", "ReviewID": "R1UH6R6DMMBEAB", "Overall": "5.0", "Content": "I bought this mini iPad remanufactured and it looks brand-new. I don't have any complaints at all so far and have had about three weeks. The battery life impresses me and seems like leaving it turned on, it can last for two days or so before it even gets close to 50%.I like the speed, the way videos look when watching Netflix or Amazon prime, etc. it has not crashed or froze up on me so far.I would definitely recommend buying a case for it, without a doubt. I bought a $20 case and it isn't bad, it just has a hard time staying open and keeping the iPad propped up when watching a movie. So spend a little bit more and get one that definitely keeps it in a position for when you watch movies.", "Date": "October 22, 2013"}, {"Title": "Nice Mid-Size iPad", "Author": "William Craig Ramsdell", "ReviewID": "R174C8S9D00Q03", "Overall": "5.0", "Content": "We own several Apple products, iPhones, iPads to Macmini.  The iPad Mini is more convenient to carry than the iPad and with a much bigger screen than the iPhone.", "Date": "October 22, 2013"}, {"Title": "iPad was perfect!!!", "Author": "hemi dude", "ReviewID": "R3PJ67UJQG7AC8", "Overall": "5.0", "Content": "The IPad mini arrived in perfect condition sooner than expected!  It looks brand new, fresh out if the box!  A perfect experience!", "Date": "October 22, 2013"}, {"Title": "The Apps make it the best Copilot!!", "Author": "Gloria", "ReviewID": "R3K76SYHG0PS4G", "Overall": "5.0", "Content": "We were blown away by this tablet.  It is small yet does so much!!  We use it with an App that allows us to get charts, weather and traffic when we fly our own airplane.  It was compact enough to mount along side our other instruments.  The Apps available are endless and amazing!!  This was a great purchase.", "Date": "October 21, 2013"}, {"Title": "Love it!", "Author": "PR-EP \"Music Lover\"", "ReviewID": "RQ3VQ9E2NA1KG", "Overall": "5.0", "Content": "I love my iPad Mini - it is exactly what I anticipated.  The retailer who I purchased it from was also top quality.  It shipped right on time and I received it within a matter of days.  I couldn't be happier with both the product and the retailer.", "Date": "October 20, 2013"}, {"Title": "Works great as an e-reader, taking pictures, video and surfing the web", "Author": "J. Madonna", "ReviewID": "R3BZSWA2GX64TJ", "Overall": "5.0", "Content": "This review is for the ipad mini 16GB Wi-Fi in blackI bought this ipad mini for a birthday present for my wife, she has one of the original nooks for reading digital books and an ipod G4 and she wanted a device that would eliminate having to use the nook and ipod, the ipad mini is the perfect solution for this! I was torn between getting the mini or the regular size ipad, I chose the mini because its about the same size as her nook, the ipad mini is thinner than the nook which we have now given to our 12 year old daughter for books she is required to read for school, we'll be giving the ipod to a less fortunate family that cannot afford one as my daughter has her own ipod.The Apple app for reading digital books (called ibooks) is actually better than the nook because books can be read in different orientations. ibooks supports PDF format and epub, epub displays the best as it has options to change the font size etc. Any books that come in PDF can be converted to epub (or other formats) for free on numerous converters found online.Game apps load much faster on the ipad and are much more enjoyable to play than on the ipodThe wireless is much better on the ipad than on the ipod as the ipod kept disconnecting and reconnecting from the Internet on our home network, the ipad mini doesn't have this problem.Surfing the Internet is a breeze as well, my wife never used her ipod to surf the Internet, now that she has the ipad mini she surfs the web frequently.It takes great pictures and video which are then uploaded to FB.We'll be taking the ipad mini with us on a cruise and we'll see how it performs once connected to the wireless network on the ship, we'll be using it to check email etc, I'll be updating this review in regard to performance after the cruise.I have never used the standard size ipad so I cannot compare the mini to the standard ipad.", "Date": "October 19, 2013"}, {"Title": "Ipad Mini", "Author": "BIANCARYAN", "ReviewID": "R2FWSG146E1Z5R", "Overall": "5.0", "Content": "This is my 2nd apple product in which i purchase because I am a college student. I bought it so that I am able to download textbooks and also use for my personal business. Ipad mini works great and I am very happy with this product", "Date": "August 15, 2013"}, {"Title": "I love my Apple iPad Mini", "Author": "Jane Wagner", "ReviewID": "R22AKOD3LYLWKX", "Overall": "5.0", "Content": "I bought it for two main purposes:  reading books and checking/sending email when traveling.  I'm impressed with all the other neat features though.  It does what I wanted and so very much more.  Once I became comfortable with various apps, I was set for much more.  I highly recommend this product.", "Date": "August 11, 2013"}, {"Title": "I love this thing!", "Author": "M. Waters", "ReviewID": "R2QP5SZX2UFS7Y", "Overall": "5.0", "Content": "It's the perfect size, and it's got the Apple OS. What's not to like? Now that I own it, I very rarely use my desktop PC. I can do it all from this perfect sized Ipad, and from anywhere in or around my home with my wireless router. Absolutely NO regrets from this purchase.", "Date": "August 9, 2013"}, {"Title": "You will only have buyers remorse while it is being shipped...", "Author": "sonibill", "ReviewID": "R23X7TRKD2FTZ7", "Overall": "5.0", "Content": "Went back and forth for about 4 months trying to decide to buy a mini or wait or buy a nook or wait or buy a kindle or so on... there are just so many tablets to choose from. Went ahead and invested in a 64gb model which I wouldn't normally do. Happy I did. The ipad goes with me everywhere and consolidates everything I need to do on my laptop as well as providing me much needed entertainment/productivity while I am on contract living in American Samoa. Yes, it can get boring here on the island and the iPad mini lets me read the news, ponder books, study topics, communicate, and basically feel connected to everywhere else in the world. Did I have buyers remorse? Only during the 2 weeks I had to wait for it to get here to the island---now I'm trying to think of a reason to get a black one too. :)", "Date": "August 8, 2013"}, {"Title": "Ipad mini love", "Author": "Karissa", "ReviewID": "R1IXVR2JHPB00I", "Overall": "5.0", "Content": "I bought this for my husbands thirtieth birthday. He loves it!! Happy birthday to him. No complaints what so ever.", "Date": "August 3, 2013"}, {"Title": "Best", "Author": "rhett pwoll", "ReviewID": "R1YQUQ80H2BMTO", "Overall": "5.0", "Content": "Best thing I ever got I've got a iPod I love it it is fast I like it it is cool", "Date": "August 2, 2013"}, {"Title": "nice purchase!", "Author": "Roger", "ReviewID": "R1K9GH7P0QBH4J", "Overall": "5.0", "Content": "it came in a timley manner, box/charger/case was all in tact as promised. this was a smooth tranaction and we are very happy!", "Date": "August 2, 2013"}, {"Title": "just great", "Author": "Temy75", "ReviewID": "R3J6MBB35BOI5X", "Overall": "5.0", "Content": "The screen size is perfect and its weight is so comfortable. Can hold it with one hand so easily and the multi touch is smooth.", "Date": "August 2, 2013"}, {"Title": "So easy & Practical tool", "Author": "M. Galea", "ReviewID": "R288VF341GCWP3", "Overall": "5.0", "Content": "This is my first ever ipad / tablet and I love it. Prompt, to the point, and so much at your fingertips. Excellent.", "Date": "August 1, 2013"}, {"Title": "I love my Apple ipad mini", "Author": "Lee", "ReviewID": "R3182Z8KAPUK5U", "Overall": "5.0", "Content": "I bought my ipad for work and read books and just for fun. I really like how easy it was to get set up with my current AT&T; carrier.", "Date": "July 31, 2013"}, {"Title": "As expected", "Author": "happy mom", "ReviewID": "R18K1CG20Y1FQO", "Overall": "5.0", "Content": "I have anorher ipad, 3 ipods and and iphone & I love all of them. Easy to use. I wasn't sure about gettint it in white but it looks great.", "Date": "July 6, 2013"}, {"Title": "I would not have guessed this was used!", "Author": "Nancy A. Turner", "ReviewID": "R9MM8L029G5DG", "Overall": "5.0", "Content": "IPad mini is a lot of fun to use, the price was very fair. Product just as described. I use it all the time. Delivery was very fast too, I recommend this seller", "Date": "July 6, 2013"}, {"Title": "new to me", "Author": "barbara ariens \"scrapmimi\"", "ReviewID": "R3BWXNZN5AUBYD", "Overall": "4.0", "Content": "First I got a Kindle- charge connection broke , Got a Fire-charge connection wouldn't stay connected. So we gave up on them and got an Apple, Can't telll much different yet but only had three days. Seems fine, nice size, easily read, everything transfered.", "Date": "July 4, 2013"}, {"Title": "Exciting product", "Author": "Moses S.", "ReviewID": "R3LO3U3GZTK0JN", "Overall": "4.0", "Content": "The day it came I ran out the door to get it. When I opened the package it was just as advertised, perfect condition. I bought it refurbished, and the battery doesn't really last ten hours but I'm assuming it is because of the previous use. My only suggestion would be to include an item history with refurbished products, where it came from, any previous use, etc...It does everything I want it to, and more than I thought it could. Very pleased with the item and with the service.", "Date": "July 3, 2013"}, {"Title": "Excellent product", "Author": "Wally40", "ReviewID": "R1JX9V4IK08JYY", "Overall": "5.0", "Content": "Excellent product. I changed my Ipad2 for this Ipad mini. More confortable and simple to travel. Really, it was an excellent decision.", "Date": "July 1, 2013"}, {"Title": "Smaller than i am use to", "Author": "flyfish59", "ReviewID": "R3QRX4VWM1YDLW", "Overall": "5.0", "Content": "I have the standard size ipads but i bought this one with verizon just for out of town travel and to use it as a gps unit on a screen i can see in our motorhome. I wanted a pay as you go tablet that would cost less than having to turn on an air card for for a week here and there", "Date": "July 1, 2013"}, {"Title": "Just what I wanted", "Author": "Jack H. Meili", "ReviewID": "R3DOC93BHN8MPJ", "Overall": "5.0", "Content": "It is fun and easy to use and performs all functions I have need for. Would recommend it to anyone.l", "Date": "June 29, 2013"}, {"Title": "Apple Ipad,", "Author": "Santiago Chantada \"Schantada\"", "ReviewID": "R16VOO0JOHQCYP", "Overall": "5.0", "Content": "Excelent product, i love it, it's just something that i want for some time and is for my wife, i'm sure she will be deligthful using it", "Date": "June 28, 2013"}, {"Title": "Husband loved it.", "Author": "Jamie Lynn McCormick", "ReviewID": "R384FPC3R76S05", "Overall": "5.0", "Content": "I bought this as a birthday gift for my husband. He loved it. It is everything he wanted. His only complaint is that he wishes apple products diddn't require an internet connection to set up in the beginning.", "Date": "June 24, 2013"}, {"Title": "ipad mini", "Author": "suzie Q", "ReviewID": "R391DEI7Z7YRT0", "Overall": "5.0", "Content": "I love this ipad mini and it really serves its purpose!  I certainly would reccomend this product to anyone who is looking to purchase an ipad mini!", "Date": "June 22, 2013"}, {"Title": "Excellent!", "Author": "Pedro Figueroa", "ReviewID": "R1DGFUOOQVGQSG", "Overall": "5.0", "Content": "Received as required. The product was brand new and sealed in it's original box. Excellent product. Thank you very much.", "Date": "March 2, 2013"}, {"Title": "Excellent", "Author": "Jose Luis Diaz", "ReviewID": "RIBWP0W62JUFR", "Overall": "5.0", "Content": "It bring everything they say, I brought one to DR and this machine are simply excellent! You will like it too.", "Date": "March 1, 2013"}, {"Title": "A great product.", "Author": "mel schlaht", "ReviewID": "R3SIDKCVLKD1MY", "Overall": "5.0", "Content": "I love it because it is easy to operate and works just about the same as my desk top computer.  I highly recommend it.", "Date": "March 1, 2013"}, {"Title": "So far so good", "Author": "Joe Feedback", "ReviewID": "RIUFHRKXG4QZF", "Overall": "4.0", "Content": "Great for storing pics to share w/ family members & holidays - no more dragging around old school photobooks.Great for streaming tv shows/movies via WiFi accessability.Great having kwik internet access via WiFi in a rush - - vs. - - booting up a computer & waiting, waiting...I'm still trying to figure out if I can download movies I've purchased on DVD, which I'll get converted digitally to the Cloud.  If I can - it'll be perfect for keeping busy, when needing to kill time (airplane trips, Drs apptments, wife dragging me shopping....)", "Date": "March 1, 2013"}, {"Title": "Love it!", "Author": "Ms. Malice", "ReviewID": "RBTEBSY7SDMFJ", "Overall": "5.0", "Content": "I love this product. I have had no issues at all with it.... I know others have complained about you tube but I have had no issues at all with it....I think that it might be their Internet connection speed......", "Date": "February 28, 2013"}, {"Title": "Her favorite gadget", "Author": "anthony brown", "ReviewID": "R3JYUAN2RM9OMX", "Overall": "5.0", "Content": "I brought this mini for my wife and she just loves it. It's a great size and weight...I would recommend others to invest.", "Date": "February 28, 2013"}, {"Title": "Light, Thin and easy to read, a great product", "Author": "Martin J. Black", "ReviewID": "R26X1X3IDXAKCV", "Overall": "5.0", "Content": "The best facebook and email product.. 1000s of apps that work, easy to use and did I say everything works right out of the box.", "Date": "February 26, 2013"}, {"Title": "Muy bueno", "Author": "beckersanchez", "ReviewID": "R2VEREGZYRHUC0", "Overall": "5.0", "Content": "Excelente el detalle es las aplicaciones de edición de texto que se bajaron de la Apple aunque se compraron adiós hacen perder luego de la edición texto complejos por ejemplo cuando se editan documentos con pie de páginas este se pierden al grabar el archivo.", "Date": "February 5, 2013"}, {"Title": "Absolutely Anazing", "Author": "diego2x2", "ReviewID": "RET8XW62TP0AF", "Overall": "5.0", "Content": "The form factor of the ipad mini is great. I owned the ipad 2 but I sold it so that I could get the ipad mini; best decision I've ever made. It just feels right in your hand, and even though the screen isn't retina it is noticeably better than the ipad 2. The wifi is also better than the ipad 2. This is by far the best ipad yet.", "Date": "February 3, 2013"}, {"Title": "Great size to fit in your carry bag, and lightweight.", "Author": "\"DoctorObvious\"", "ReviewID": "R2ITMY19IAZ7OG", "Overall": "4.0", "Content": "In hunting for MP3 players for personal use,  it seemed like most were over priced for what you get.  I have an iPad with retina display for work, and used and iPod touch before that to  take  to conferences.  For home I wanted something with a big enough screen to watch movies  while traveling, and the usage of apps is seamless among Apple devices.  For now, it is probably  the best device in its class on the market today,  in my opinion, but the price is still more than its competitors.  Apple should be able to make this with a retina display, and get more storage on iPads in general, then they would really be able to  fill a niche between laptops and hand held devices.", "Date": "February 3, 2013"}, {"Title": "Tiny. Consistent. Quality.", "Author": "jwayne", "ReviewID": "R341AHXSJHM4SF", "Overall": "5.0", "Content": "These days Apple is losing the excitement factor over the Android phones and tablets that are fancier and come in enough shapes and sizes to suit your taste. I, myself, have tried the Android phones and tablets but have come back to Apple for two main reasons: Consistency and Quality,I have always wanted an iPad but the cumbersome and awkward size was always the turn off to me. I wanted something easy to carry and put away; the iPad just seemed a bit too large. I eventually gave in to an Android tablet and Enjoyed it to an extent but it became clunky and cluttered. The quality felt a bit too plasticky as well.Then Apple announced the iPad Mini and I was ready to give it a try. THIS DEVICE ROCKS! I cannot say enough good things about it; it's the quality hardware and software Apple is known for. I can always count on my iPad Mini to work and do so like it did the first time, never slowing down.So... If you are in the market for a small tablet and don't mind paying the premium I highly recommend the iPad Mini. Sure, it's a bit more expensive but if you have it know you are paying for a slick device that won't turn into a frustrating paper weight next year. :)", "Date": "May 15, 2013"}, {"Title": "Note required", "Author": "Artem", "ReviewID": "RDV7K5Y8UQBNP", "Overall": "4.0", "Content": "Would be a very useful note to this product: Wi-Fi model have no gps module.Anyway it is excellent thing :)", "Date": "May 14, 2013"}, {"Title": "Moved from the Kindle Fire (1st gen) to the iPad Mini, loving the change", "Author": "Angela Streiff", "ReviewID": "R2BA9H0Y9FUOAS", "Overall": "5.0", "Content": "I bought the original Kindle Fire when it was first released. I was so excited to get it, I pre-ordered in advance so I could have release day delivery. And for the next several months, I loved it. The screen was beautiful. However I had a few scares with it.The first issue I had with the Kindle was on a few occasions, it just didn't turn on. After discovering how to do a hard-reset, I was able to get it back up and running, and just did this whenever it wouldn't turn on again. Then one day while I was playing music on it via the iHeartRadio application, it started to overheat (wasn't aware that the Kindle even could overheat) and after the music that was playing started skipping, it froze up. I picked it up and found the back near the battery hot to the touch. It would not turn off, so I did a hard reset (as suggested by Amazon). After that, it never turned back on. Thankfully, Amazon quickly replaced my Kindle Fire (for free) and when I received my new one, everything was back to normal. However by this time, I had gotten my first iPhone (4s). I was surprised how much faster the internet browser and applications ran on my small phone, compared to the Kindle Fire. So I ended up using my iPhone more often than my Kindle.On month after Amazon replaced my 1st generation Kindle Fire, they released the new line of Kindles. I almost ordered one of the new HD ones, but decided to wait and see how the reviews compared to this iPad mini, which was released around the same time.Now months later, I'm hearing reports from people who did order the new Kindle Fire HD that they too are running into problems here and there with this new version. After doing a lot of research, I discovered that statistically, Apple products have fewer claims for warranty work than other brands. I'm by no means an Apple-Fangirl, and prefer to use Windows PC's in my own home. But I hate having my brand new items break down, even if they are covered by a warranty. When I spend hundreds on something, I just want it to work, and would rather never need to know how how good a warranty is or not. So the statistics of the Apple products having better reliability was the deciding factor.When comparing the Kindle Fire to the iPad mini, I will say that Kindle (especially the new ones) have a more vivid screen. The Kindle screens are beautiful and the colors are amazing. However that's where the majority of the advantages over the Mini ended for me. The iPad mini has nice web browser, the applications work well (less crashing issues), the wireless connection is fast and I didn't have any sort of lag between turning on my Mini and getting online, like I often did with my Kindle. The mini has been everything I hoped it would be, and I love the size.The iPad mini is super thin. So thin, I actually worry at times it's too slim. It's such a nice piece of hardware, I tend to worry that the ultra slim design might make it too delicate. Thankfully, they make cases like the OtterBox Defender Series Hybrid Case for iPad Mini for people like myself who want to put the delicate Mini into a super duty case. I'm glad I did, since it's taken a tumble or two in the last month I've owned it, and inside the case it stays unharmed.I do love the small size of the Mini. I needed something smaller than the large iPad, but also needed something larger than my iPhone. Something that would fit into my handbag, but that I could also easily read, check and reply to my email on. The screen is very responsive and the speakers produce nice sound, better than the iPhone's. The Mini is perfect for me, and I'm so glad decided on it. Everything works just as well or better than I had hopped for, and I've passed my Kindle Fire down to my pre-teen daughter, who loves it.", "Date": "May 4, 2013"}, {"Title": "Small but powerful", "Author": "Leonardo Dugarte", "ReviewID": "R2MUZQGQ6271RJ", "Overall": "5.0", "Content": "Talk about Apple products is to talk about excellence, innovation, design, simplicity, utility. It's a very nice portable device you must have.", "Date": "March 18, 2013"}, {"Title": "comment", "Author": "Zhaoshu Li", "ReviewID": "R19KGW2B1D9PNA", "Overall": "5.0", "Content": "small, light and good-looking,also very useful!White is much better.I use it to read books and surf internet, and also play games.", "Date": "March 12, 2013"}, {"Title": "It was git", "Author": "Nancy J. Chance", "ReviewID": "ROV2QYRBE51F3", "Overall": "5.0", "Content": "I bought it as gift for my son and he loves it. Its very nice .  WE would recommend to anyone", "Date": "March 11, 2013"}, {"Title": "The perfect size", "Author": "Thrive Tech", "ReviewID": "R21QTU22K7C5Y1", "Overall": "5.0", "Content": "After owning a iPad original I decided to finally upgrade.  I never liked the larger 10.1\" platform, just to big and like many NOT one hand friendly, that has changed, oh yes!  After playing with one before buying me and girlfriend decided this is it! We bought 2 and a Apple TV. Best combination ever, really! It's bigger than the basic 7\" tablets floating around.  The build quality is second to none, especially the android tablets.  Performance is great! If on the fence, get off it and click buy now, seriously, it's all that and a bag of chips.  I have not taken laptop out since my original sync, no need, their is about a app for everything, of course the best Apps cost money, but software cost on computers as well.  Great product worthy of your hard earned money, will change your lunch break forever.", "Date": "February 22, 2013"}, {"Title": "Awesome gadget!", "Author": "Garrett W Martin", "ReviewID": "R2O9PVF10QCG77", "Overall": "4.0", "Content": "Perfect size for my needs.  Light, small, yet big enough to amuse one for hours.  It would have been nice if they could have updated the prossesor to be more like the new iPad 3's.  I guess Apple still had plenty of the iPad 2 processors lying around and said, \"Oh, we need more money.\"  The iPad Mini 2 will probably be a 5 star machine.", "Date": "February 19, 2013"}, {"Title": "Get what you pay for", "Author": "KLewis", "ReviewID": "R3IBPVGVS9Q904", "Overall": "5.0", "Content": "Pretty much the iPad mini is just a bigger version of the iPhone 5 or itouuch. Having both of these devices, I still got the iPad mini and it arrived yesterday. It was a gift from my fiancé with a free engraving on the back. To my surprise I was not bored. The full screen keyboard makes it easy for me to type and access websites with ease. Way easier and smoother than my other apple devices. Having Siri is a great plus. I was surprised that this feature was included because of the price. Siri understands pretty much everything I say and makes things a lot quicker. If there is a fact that I don't know, she supplies the information within seconds or opens up safari or various apps that can help.All in all I think this a great buy. If you already have the ipad 2 i see no reason to get this though. Don't bother buying that expensive Smart Cover case from apple, there are tons of them on here that are more reasonably priced.", "Date": "February 19, 2013"}, {"Title": "Perfect size", "Author": "Emilio Garcia", "ReviewID": "RFLTXN4CGPVFF", "Overall": "5.0", "Content": "The size of this iPad mini is just perfect... I don't miss the retina stuff, wich I think got to be great, but I never had anything that has a retina display. Write in this device has now sense. The best feature is the size.", "Date": "February 17, 2013"}, {"Title": "Best Tablet Money Can Buy", "Author": "hdtravel", "ReviewID": "R1LY3TAOYUH01I", "Overall": "5.0", "Content": "Amazing high quality build quality. Just feels SO excellent in your hand.Built to last and amaze with magic.Thin, sleek, light.Perfect screen size. Nice bright, sharp, excellent color screen.Very long battery life.Thousands of apps to amaze you.Extremely highly recommended.", "Date": "November 23, 2012"}, {"Title": "Bought for gf, battery problem. wont charge", "Author": "MM", "ReviewID": "R309GWOJILDKKS", "Overall": "1.0", "Content": "I bought this for my gf and the ipad wont charge. battery problem. Spoke with apple and they are replacing it with a new one. perfect service from apple, but the product is defective. Additionally, the warranty from apple is only good since the first purchase from them, so buying it from sellers other than amazon or apple eat up the warranty time frame. lucky for us, we had a month left.", "Date": "May 14, 2014"}, {"Title": "iPad Return for a Refund?!? NOPE.", "Author": "chrispugh73", "ReviewID": "R3S5R2YGK92COT", "Overall": "2.0", "Content": "I had contacted the seller for information on a refund for the item because my wife was having some difficulty in the operation of the item. So, I thought that because the item has only been used a few times and in new condition and that I had all the original packaging, that the seller would take the item back with little to no problem. The response was that the item had to be returned in it's original packaging, obviously with an unbroken seal to get a full refund. Well, in order to use the item, you have to take it out of the original packaging (duh) and was offered an amount that was a third of what I paid for it; obviously I declined to return the item and downloaded a users guide online for $0. This is the problem: when you order something online you open it and try whatever item you ordered to make sure it works or it fits you or whatever only to find out that the item isn't right and you want to return it - sometimes as in this case it's just not worth it. I'm sorry I didn't just go buy it at Staples or Wal-Mart.UPDATE: Funny enough, after the owner of Always Innovating read my review he sent the following e-mail to me:Always Innovating:I apologize that this transaction did not meet your needs. Customer satisfaction is very important to us, and our feedback % means a lot to our business. If you would like, I can send you a complimentary cover for your ipad ( please let me know what color) if you are able to remove the negative feedback.ThanksMy Reply:Thanks, but I had purchased a cover at the same time I purchased the iPad... I have no need for another cover. Unfortunately, unless you want to refund my money in full as previously requested (minus a restocking fee of course), the review stays. I'm sorry, but I'm sure you could easily resell this item for close to what you sell them at brand newAlways Innovating:If you would like, I can issue you a 10% refund and you can keep the item.ThanksMy Reply:You are totally and completely missing the point. You previously stated that \"Customer satisfaction is very important to you\"; well, I am a customer and I AM NOT satisfied with the product or the way your company conducts business with it's customers. It appears to me that all you seem to care about is a negative review which clearly states the facts. I also noticed a couple of other reviews of dissatisfied customers with similar complaints. It is an insult to offer me a bribe of 10% of the $312.00 I paid in good faith to your company for a product for which I am stuck with because your company refuses to refund my money, unlike many other companies I have dealt with on Amazon. So again, unless you decide to refund the money I paid, I will return the item, (which is in pristine condition) I refuse to help you.Needless to say, I have not gotten a response. It appears as though \"customer satisfaction\" IS NOT A PRIORITY TO ALWAYS INNOVATING.", "Date": "February 12, 2014"}, {"Title": "Don't be cheap!", "Author": "Jerry", "ReviewID": "R3HGK2O9DLPXWG", "Overall": "5.0", "Content": "Excellent quality. Can't go wrong with Apple. You get what you pay for. We found out with other electronic purchases (Samsung). Still kicking myself for going with a galaxy s3 and not the Apple I5 like my girlfriend did. So don't be cheap!", "Date": "January 29, 2014"}, {"Title": "Apple hype is just that...HYPE.", "Author": "T. Farris", "ReviewID": "R273DIT1UVJXR2", "Overall": "4.0", "Content": "I have this iPad Mini, Motorola Xyboard 8.2 & Samsung Note 10.1 2014 edition. out all the 3 I like the Samsung Note the best. Yeah the iPad is cool but it lack functionality that I believe Apple will never add to their tablets. Multitasking & the S-Pen is a major plus and the resolution is outstanding, Expandable memory, I can go on and on but I don't have the time to do so.I gave the iPad mini to my 9 year old son. He likes it because most of his friend have been brain washed my apple. My son said he would rather have my Samsung or Motorola but those are mine.", "Date": "January 1, 2014"}, {"Title": "Not what I wanted but excellent customer service.", "Author": "Mr. J. Gill", "ReviewID": "R3T6CNSTZAKAZO", "Overall": "5.0", "Content": "Realised after I bought it that this was the old ipad and not the new one with retina display. I notified the suppliers who refunded my money immediately and without fuss. Thank you for the excellent service.", "Date": "November 29, 2013"}, {"Title": "Great!!", "Author": "Lisa Carter-Harris", "ReviewID": "R3IRWWJWOHTE2B", "Overall": "5.0", "Content": "The iPad Mini is a great little device.  Very versatile and allows me to do multiple things that I would normally do on a laptop on a convenient portable device.", "Date": "November 26, 2013"}, {"Title": "Small but powerful", "Author": "Cheryl Rios \"cherylm\"", "ReviewID": "R361GVIF7LHDPZ", "Overall": "4.0", "Content": "works great, fits in my purse and the only thing i wish it had was built in wifi, but other than that it is a great tablet.", "Date": "November 19, 2013"}, {"Title": "10 out of 10", "Author": "Rogelio Hernandez", "ReviewID": "R3MFIZD8H1APO5", "Overall": "5.0", "Content": "This ipad was in great condition. i use this everyday, i dont see any scratches and works perfectly as if i bought it brand new from the apple store!!", "Date": "November 4, 2013"}, {"Title": "Very good", "Author": "Lufan Liu", "ReviewID": "R25WILGBESND5C", "Overall": "5.0", "Content": "What else can I say? It came in perfect condition. The packaging was definitely good, and I use this more than I thought I would, even when I already have a smartphone. It's super easy to carry around and I sometimes uses it to take notes in class or check emails real quick.", "Date": "November 4, 2013"}, {"Title": "Screen problems", "Author": "Joseph Pete", "ReviewID": "R133G1PDANMAZ0", "Overall": "2.0", "Content": "The iPad works as i expected. There is only one problem: the screen is a little squishy in the upper left corner. You can feel the glass press down and it is a little worriesome. Otherwise im pretty happy with it", "Date": "November 4, 2013"}, {"Title": "Happier vacations and drives!", "Author": "Nicolette Lovett", "ReviewID": "RG4JKA3092H1I", "Overall": "5.0", "Content": "When I was a kid in the 80's, this would've been awesome on long road trips.  I am thankful for technology advancing as it has - this provided my kids with great entertainment while driving and flying and going on vacations this year.  As for the iPad itself - I'm happy with it.  Easy for little hands to handle and it's just like the regular iPad only a bit smaller.  No issues with it at all!", "Date": "October 15, 2013"}, {"Title": "Great product", "Author": "Del W.", "ReviewID": "RI2D5QIZ4DOKQ", "Overall": "5.0", "Content": "This was a product was a great buy and a fantastic product.  First time iPad user and I am very happy that I bought this product.  It deserved a 5 star due to the quality, purchase price, and great product.", "Date": "October 3, 2013"}, {"Title": "8 Year Old Daughter loves it", "Author": "Jonathan R. Stacey \"jonrstacey\"", "ReviewID": "R1TZTCC6Q3NWYO", "Overall": "5.0", "Content": "I had read that the screen is not as good as the full size ipad, I cannot tell the difference...", "Date": "September 9, 2013"}, {"Title": "I am very happy with my iPad mini!", "Author": "Zita Carroll", "ReviewID": "R3GSSC4Q7ITLZZ", "Overall": "5.0", "Content": "This is everything I had hoped it would be. I like that there are so many accessories that are available for it.  They enhance the iPad's versatility.  I alsolike the size and the light weight of the iPad.", "Date": "July 30, 2013"}, {"Title": "I Pad Mini", "Author": "Mystery reader", "ReviewID": "R3390DHUXS7IVQ", "Overall": "5.0", "Content": "I just love the size and function of this I pad mini.  It does everything I need and more. I get my email, facebook,netflix, dishnet tv,.Internet is fast and I love all the apps I use. Also takes very good pictures except when there is very little light.  Oh, and got all my Kindle library on it also.  Very happy with it.  No problem being used when purchased.", "Date": "July 29, 2013"}, {"Title": "Apple the greatest", "Author": "Bobby Davis \"Mombo\"", "ReviewID": "R1PXC9IQMEIRQR", "Overall": "5.0", "Content": "I've used PCs all my life but apple is better. No viruses don't have to buy a new operating system every two years or so.", "Date": "July 28, 2013"}, {"Title": "love it", "Author": "Israel Lopez", "ReviewID": "R2ACDLDHE95AZ6", "Overall": "5.0", "Content": "nice and small u need to buy a case to keep it safeit gets scratches easliy so protectperfect for a student nice compact and read to go and use it anywheredefinately recommend", "Date": "June 8, 2013"}, {"Title": "good size", "Author": "Lurline W. Threatt", "ReviewID": "R16841KA51EVT0", "Overall": "4.0", "Content": "Got on time. Has good sleek feel to it. My first experience with apple device. Annoying to have to put password in to do most stuff on it. Overall good book. Like my android devices better.", "Date": "May 31, 2013"}, {"Title": "Best size!! I hope It would come with retina screen.", "Author": "DP \"mundodelguy\"", "ReviewID": "R114COFA3FB2XV", "Overall": "3.0", "Content": "I chose the mini model because of its size. It's way better and more comfortable than her bigger sister. The only down side is that the screen is not the bet Apple has to offer. Bummer.", "Date": "May 17, 2013"}, {"Title": "Excellent", "Author": "Corina Harten", "ReviewID": "RNFECWPBMRM3P", "Overall": "5.0", "Content": "I love it, it is perfect for me. I highly recommended to buy it.  The price is best too.  I can enjoy reading and sending emails.", "Date": "June 6, 2014"}, {"Title": "iPad Mini", "Author": "Amber Hurley", "ReviewID": "R1FEBGD2002DC6", "Overall": "5.0", "Content": "I'm really loving my Apple IPad Mini it's a great product to buy or to give as a gift... Amazon is the best", "Date": "June 6, 2014"}, {"Title": "Perfect!", "Author": "Devon Miller", "ReviewID": "R1UJRF9WUIB8P9", "Overall": "5.0", "Content": "I was buying this for my younger brother since he wanted an iPad but when I got it and started using it I realized that I liked it even better than the iPad 2 which I already owned. I ended up keeping the mini for myself and giving my brother the iPad 2 with the bigger screen since that's what he wanted anyways. I love how it fits in my hand just right and is light compared to the iPad 2.", "Date": "June 5, 2014"}, {"Title": "love it", "Author": "Lisa", "ReviewID": "R2LOOMZKPDHX9F", "Overall": "5.0", "Content": "exact item very very happy and pleased with item will recommend it to any one who is interested in getting one", "Date": "June 5, 2014"}, {"Title": "Impressed", "Author": "Fish", "ReviewID": "RLESC8L18XT15", "Overall": "5.0", "Content": "Received this product on time. Got this for my niece for her birthday and she loves it. Great purchase for a good price.", "Date": "June 5, 2014"}, {"Title": "I love my Ipaid mini!!", "Author": "Shannon M McClelland", "ReviewID": "R1PCUKWV8NFYX7", "Overall": "5.0", "Content": "I wasn't sure if I was going to like the IPad mini, but I love it! It is so much lighter than the Ipad!", "Date": "June 5, 2014"}, {"Title": "Awesome as expected from Apple", "Author": "matgzx", "ReviewID": "RO3CN5OWTYLFW", "Overall": "5.0", "Content": "This is a really great iPad, it's size, weight and power make of this one a really great product, retina iPad mini is clearly better but this original iPad mini is a great choice too, having the price in mind.", "Date": "June 4, 2014"}, {"Title": "Love, love, love it!!", "Author": "Lilypons \"lilypons\"", "ReviewID": "RE3TRQBOASP3A", "Overall": "5.0", "Content": "The size is completely portable.  It replaces my Sony eReader perfectly, plus having sooo much more.  Pretty much just like the larger iPad versions, just a bit smaller.  Since I did not buy it on a phone plan, It does need wifi to access to use the web.  I even have the recent MS Office 365 installed on it and love that.  Game play uses the battery quickly, but I think that's pretty much on par with other \"smart\" units.  Otherwise, the battery hangs in there.", "Date": "June 4, 2014"}, {"Title": "Great Product", "Author": "Timothy M Gaffey Jr.", "ReviewID": "R3JSP8KTPBAGEO", "Overall": "5.0", "Content": "Purchased a second one for another member in the house; I already have the mini and the iPad Air was too expensive for what I was looking for.  This has a great, crisp screen on it.  It fully integrates with the iPhone and other Apple products.  If you're looking for something compact that you can take anywhere this is great.  Price was reasonable too.", "Date": "June 4, 2014"}, {"Title": "Happy!!", "Author": "Doreyda Villegas", "ReviewID": "R11PTSPY9G7ZFO", "Overall": "5.0", "Content": "i was scared at first to buy from them, but once i got it eveything was great!! It was just as discribed new in the box and for the price it was so worth it! i would recomend for other people to buy if they are looking for something like an ipad mini. (: Very happy person right now!!!!!", "Date": "June 3, 2014"}, {"Title": "I love it!", "Author": "sienna", "ReviewID": "RYMS73W5XZMEZ", "Overall": "5.0", "Content": "My boyfriend bought me the white iPad mini about 6 months ago and I love it! It's really handy when you're in college and have a tiny little desk! My laptop was too big to fit on my desk but the iPad mini is a perfect size and fits nicely in my purse. Of course when buying one don't forget to get a durable case cause this thing is so thin and light, it's easy to drop.", "Date": "May 14, 2014"}, {"Title": "great product", "Author": "Rafael Botaro", "ReviewID": "R1TWOKSF1K436B", "Overall": "5.0", "Content": "excellent product!fast, efficient, convinientI love this product.  It enables me to run my business and is very portable.", "Date": "May 14, 2014"}, {"Title": "User friendly", "Author": "Mombotalli", "ReviewID": "R1DNAPI7VN7YDJ", "Overall": "5.0", "Content": "Apple products have always claimed to be user friendly and this IPad fits the description.  Clear and bold screen with all the features of modern technical functionality.", "Date": "May 14, 2014"}, {"Title": "best item", "Author": "Bruck Giorgis", "ReviewID": "RLCEDHH7Z9XJC", "Overall": "5.0", "Content": "this is really good item. i am happy to have it. i wish i bought the ipad mini with sim card slot.", "Date": "May 13, 2014"}, {"Title": "So far loving it!", "Author": "Denise", "ReviewID": "R21VYR30BCL5PV", "Overall": "5.0", "Content": "I purchased this as a Mother's Day gift for my mom and she loves it! And so do I! It's size makes it so much easier to use. It's responsive ,doesn't lag just great. I went with the 1st generation as oppose to retina display because I don't think it's such a huge difference to spend extra money on. I've always been an android user and never pictured myself buying an iPad but I love it! Definitely recommend.! Shipping was also very fast and packaging was excellent!", "Date": "May 13, 2014"}, {"Title": "Love it", "Author": "Cindy Stevens", "ReviewID": "RLPSNUARL4M2D", "Overall": "5.0", "Content": "I was hesitant to purchase an electronic product that was going to be shipped.  It turned out great and I love my iPad mini.", "Date": "May 13, 2014"}, {"Title": "perfect", "Author": "cristy", "ReviewID": "RTUZ4C8YYYVQC", "Overall": "5.0", "Content": "The tablet was perfectly packed, i liked it a lot and I served as a perfect gift for my mother, it was perfect", "Date": "May 12, 2014"}, {"Title": "Great Price!", "Author": "G Stone", "ReviewID": "R1QTDDP05DBD7D", "Overall": "5.0", "Content": "Bought this mini iPad to replace my 2nd Gen iPad.  It was worth the price.  Doesn't have a retina display but it sill looks great.", "Date": "May 12, 2014"}, {"Title": "Ipa mini", "Author": "FAST FRED \"FAST FRED\"", "ReviewID": "R26LAI1IJ9DIWV", "Overall": "5.0", "Content": "Received the IPad mini beforemy trip. I ordered cable and charge plug too.. So far it working great, it take a charge find and was easy to load and setup . If I had to have another one I buy apple not an android.", "Date": "May 11, 2014"}, {"Title": "love it", "Author": "Joseph Fernandez", "ReviewID": "R16EAI1N5TPOI3", "Overall": "5.0", "Content": "What is not to like about the ipad mini. I had bought it for my mom and she had fell in love with it as well. Best mother's day gift.", "Date": "May 10, 2014"}, {"Title": "My New Toy", "Author": "Marian L. Kirk \"L. Kirk\"", "ReviewID": "R30TE652UHNYBJ", "Overall": "5.0", "Content": "I had been wanting an I pad for quite awhile.  I had my Kindle Fire and loved it but last October I switched to an I phone 5c and wanted the I pad mini for the sinking of apps and books between the two.  The mini is great and I use it everyday. I have the Kindle app on the mini in order to read my current book that is on my original Kindle. I love the mini. It is compact and easy to carry everywhere.  The Wi-Fi is great. My 6 year old grandson and I enjoy the apps we have downloaded on it. I like the new tech electronics and this one is at the top of my list.Marian Kirk", "Date": "April 29, 2014"}, {"Title": "very pleased", "Author": "susan", "ReviewID": "R203LV7EMDPJFC", "Overall": "5.0", "Content": "I love my new ipad. It is very easy to use and is well made and nice looking. I would buy again but maybe get the 4G with more memory.", "Date": "April 29, 2014"}, {"Title": "Awesome", "Author": "Donna Merriman \"DonnaLynn\"", "ReviewID": "R2UOY3DXGS9Q79", "Overall": "5.0", "Content": "I bought the iPad mini as the original is very heavy and harder to handle. I also did not have wifi on my original iPad. I have traveled twice with my iPad mini and it has been awesome. It is exactly the right size and I had no problems using it to check my email and messages while out of town. I actually have been using it everyday as I am now used to the smaller size and find I prefer that to my larger one. Very happy I made this purchase.", "Date": "April 28, 2014"}, {"Title": "GREAT !!!", "Author": "Melanie Gordon", "ReviewID": "R23DAYJWBDBD4C", "Overall": "5.0", "Content": "I love this. Works exactly like the 10\" but this size is better.  Easier to carry, fits comfortably in my travel case. Works great with the iPhone too...", "Date": "April 28, 2014"}, {"Title": "Just ok.", "Author": "Can s.", "ReviewID": "R3VH29FWJAEUXR", "Overall": "3.0", "Content": "It is light ,chic but Battery life is short,Camera should be 10 mp and slow at buffering.Next time I will buy Samsung,cheaper and powerful.", "Date": "April 28, 2014"}, {"Title": "Don't order if AppleCare is important to you", "Author": "Martin J Dougherty", "ReviewID": "RSQD1EUD5ZNQO", "Overall": "2.0", "Content": "I bought this for my two year old granddaughter.  Kids are tough on these so I wanted to get an AppleCare protection plan in case she broke something.  As soon as it was delivered, I took it to an Apple retail store to buy the program - but Apple says that the AppleCare program must be purchased within 30 days of purchase.  Unfortunately - that means 30 days from when it was directly purchased from Apple.  This was purchased from Apple by a third party vendor and distributed through Amazon more than 30 days before it was shipped to me - so the device was no longer eligible for the AppleCare program.  I have two options - return it to Amazon and purchase another device directly from Apple (this specific model has been discontinued by Apple and is no longer available from them) or I can just give it to my grandkid, along with a really good protective case - and HOPE that my two year old doesn't break it.  Wish us luck.", "Date": "April 27, 2014"}, {"Title": "Bought for my husband", "Author": "nana7", "ReviewID": "RZQQA1RNM5FGF", "Overall": "5.0", "Content": "He loves his new  ipad mini, just the right size for him. Easy for him to use. Very fast. slim not bulky.Arrived way before they said it would come.", "Date": "April 26, 2014"}, {"Title": "Amazing", "Author": "Gave", "ReviewID": "R2212I46RGRQJ8", "Overall": "4.0", "Content": "This is Awesome. One problem is when I got it the box was damaged and the sides of the ipad had scratches and i ordered it new. Other then that this Ipad is Solid", "Date": "April 26, 2014"}, {"Title": "My boys love it!", "Author": "Ahna Mama", "ReviewID": "RUWKWCUF8TW0D", "Overall": "5.0", "Content": "I initially purchased 16GB mini pads from Amazon for my children. I highly suggest not buying anything less than 32 GB as there is never enough storage on 16GB. We were having to delete games or other applications to make room.", "Date": "April 24, 2014"}, {"Title": "Very pleased!", "Author": "Mary Parker", "ReviewID": "R2TMLK1HKS74LV", "Overall": "4.0", "Content": "Ease of use.Even a never before user found it to easy find music, news, and weather!Arthiritic person was able to maneuver the touch screen, even with bent fingers!", "Date": "April 24, 2014"}, {"Title": "Ordered used but came factory wrapped", "Author": "Lee T.", "ReviewID": "R2DEXR592WZXRH", "Overall": "5.0", "Content": "Ordering my electronics used saves me so much money and I'm getting a new quality item. I'm really glad I got the iPad since I already have other Apple products, including my iPhone so the iPad is sharing all of my info and apps from my iPhone. I almost got the Kindle but since I didn't need it to read, it wasn't the best product for me.", "Date": "April 17, 2014"}, {"Title": "Happy with my purchase", "Author": "james bernard", "ReviewID": "RCNAZME6ZSD0K", "Overall": "5.0", "Content": "I am very happy with my purchase !! Love the iPad  !!! Amazon is the perfect place to fine great deals for a cheap price.", "Date": "April 17, 2014"}, {"Title": "Screen shatters easily! Get an Otterbox wih this!", "Author": "G. Grazian", "ReviewID": "R2U80XJV5FANRU", "Overall": "1.0", "Content": "The screen of my ipad mini shattered within 4 months. It costs twice more to repair it than the regular ipad. One repair shop asked $75.00 more than I paid for the ipad. The cheapest place was an online business that asks $180.00 for this repair.I liked the size and functionality of this mini and it suited most of my needs. Unfortunately, I will not buy, again", "Date": "April 16, 2014"}, {"Title": "Awesome", "Author": "Patti OReilly", "ReviewID": "R1K0A3M67H5JR0", "Overall": "5.0", "Content": "I love it. So easy to use. Only wish I could print from it. I use it for reading and searching the web", "Date": "April 16, 2014"}, {"Title": "Exactly what i was looking for", "Author": "Jorge Olazagasti", "ReviewID": "R3EFCA0MEOTNJV", "Overall": "5.0", "Content": "A friend lent me this mini i pad while my desktop was being replaced.I've gotten so fond of it that i bought a new one. it's being used more often than my new desktop! It's great as a portable backup at a price far below local retailers.", "Date": "April 16, 2014"}, {"Title": "How did I get along without it?", "Author": "framusmn", "ReviewID": "R3DS0VK7MI6G4Q", "Overall": "5.0", "Content": "I really like my new iPad mini and so does my granddaughter! I've had a lot of fun trying out all the fabulous apps and games.", "Date": "April 16, 2014"}, {"Title": "Perfect size", "Author": "JCD", "ReviewID": "R2PCS06UP8Y5LB", "Overall": "5.0", "Content": "What a great size!  I bought this for my son and I'm wishing I had bought one for myself.  The size seems more convenient than the iPad.  As with all of the Apple products, this is a great product and very user friendly.", "Date": "April 15, 2014"}, {"Title": "Useful for seniors to read books", "Author": "Loretta Ramseyer", "ReviewID": "RAFH8QYPRXCJJ", "Overall": "5.0", "Content": "I have disabilities that make it hard for me to hold and read books.  The iPad mini makes reading a pleasure again.  A wide variety of books can be read on this iPad.  This size is better than the full size iPad because I can easily hold it in one hand while reading and turning pages.  Another benefit is that the small size fits easily in most  pockets and handbags.", "Date": "April 15, 2014"}, {"Title": "IT's AN IPAD", "Author": "Burninglancer", "ReviewID": "R3UZ29WJQ8ZTS3", "Overall": "5.0", "Content": "what else is their to say IT's and IPAD you know what it does and how it works. so yeah!", "Date": "April 15, 2014"}, {"Title": "Thank you", "Author": "TRE GORDON", "ReviewID": "R2U9OT6A3ST41U", "Overall": "5.0", "Content": "This was a gift for someone and so far it seems to be working fine. If it continues I will be ordering another one down the road for myself. It arrived much faster than expected which I really appreciated. Thank you", "Date": "April 15, 2014"}, {"Title": "Great purchase for my wife!", "Author": "BBQ'r", "ReviewID": "RIZOIY1ZKW2WM", "Overall": "5.0", "Content": "She didn't think she would use it much, now she wonders how she lived without it!Overall, a good purchase for us.", "Date": "April 7, 2014"}, {"Title": "Easy to use.", "Author": "not too tech savy", "ReviewID": "R34TS00CWFLHYU", "Overall": "5.0", "Content": "Had to have a little help from my son, but is easy to use.  It is light and easy to carry.", "Date": "April 7, 2014"}, {"Title": "Love it!", "Author": "Felicia J. Rall", "ReviewID": "RXGAQ04TEP5I2", "Overall": "5.0", "Content": "It fits in all my purses! Works great! The lighting cords break after a few months-but I get cheap ones!", "Date": "April 7, 2014"}, {"Title": "Love my iPad Mini", "Author": "LEAH ASARO", "ReviewID": "R10W2KFJ90I2MR", "Overall": "5.0", "Content": "I like the silver the best, the front border is white. I ordered 2 space grey iPad Minis for my daughters at Christmas. My husband also has silver. Wish I could use more than one app at a time but this works well. Lots of free apps and games. Visual is not affected by the sun as seen on TV.", "Date": "April 6, 2014"}, {"Title": "I got one and love it!", "Author": "LIN", "ReviewID": "R3CRKXZZIE12H8", "Overall": "5.0", "Content": "It was a birthday gift for my sister.I got one for my birthday last year and love mine so I thought it would be a great gift for my sister.She loves it !", "Date": "April 5, 2014"}, {"Title": "Love it!", "Author": "Irma", "ReviewID": "R1WYM8KJW9HUE6", "Overall": "5.0", "Content": "Got this one for my daughter she  is Autistic , we took it to disneyland and save our lives! My daughter loved it! So easy to use, perfect size, picture and volume. Very happy :)", "Date": "April 5, 2014"}, {"Title": "Great ipad", "Author": "karen lidgard", "ReviewID": "R1MGXS52HTSCQ", "Overall": "5.0", "Content": "This was a gift for my sister and she loves it.  The seller was correct in everything he had stated about it.  Even though it was a store display it was in perfect condition and would buy from him again.", "Date": "April 4, 2014"}, {"Title": "Better than description!", "Author": "Maria Robles", "ReviewID": "R3K6RY6OD2LVF5", "Overall": "5.0", "Content": "Bought this ipad mini for family entertainment.  My 4 year granddaughter has learned so much through it's apple apps!  I would recommend it to anyone who doesn't want to spend too much money but wants to have a variety of educational and entertainment apps.", "Date": "April 3, 2014"}, {"Title": "Amazing", "Author": "Derek", "ReviewID": "R15GA4PBPDUVF9", "Overall": "5.0", "Content": "Although I found this product very fragile, I am still amazed! Regarding all the things it can do – and it always seems able to perform the tasks I need...Lead tech D", "Date": "April 3, 2014"}, {"Title": "She love it.", "Author": "Khiev Kanel", "ReviewID": "R2D4T4J86TKM53", "Overall": "5.0", "Content": "My mum said, hey it's nice and she usually use it for movie and gaming.Great to use, share me when it have more discount.", "Date": "April 3, 2014"}, {"Title": "I love my iPad Mimi", "Author": "Angel Rittgarn", "ReviewID": "R121GEUDQCQEXH", "Overall": "5.0", "Content": "This is the perfect tablet for taking everywhere.  It is compact and is light enough to carry in my purse.  I have a lot of music and movies so I was glad I purchased the larger GB.  I would highly recommend the iPad mimi to anyone.  My kids use it as well as my parents when we travel.", "Date": "March 15, 2014"}, {"Title": "I love it!!!", "Author": "Ravous", "ReviewID": "R1444C8VWQA5KW", "Overall": "5.0", "Content": "It was inexpensive and still in great condition just like the buyer said it would be I enjoy every minute of being on it... matter of fact it's the reason I procrastinate so much more when I should be getting stuff done lol", "Date": "March 15, 2014"}, {"Title": "Great", "Author": "Roy Dixon", "ReviewID": "R2CA4SIC3GH3ZD", "Overall": "5.0", "Content": "Wife loves it.  She was having withdrawals since her previous iPad bit the dust after the grandchildren abused it....warranty was out and cheaper to buy a new one.", "Date": "March 14, 2014"}, {"Title": "awesome!", "Author": "Amazon Customer", "ReviewID": "R2KK58OOXHNU64", "Overall": "5.0", "Content": "This is a great product and you couldn't beat the price. It was ordered as a gift and shipping was very fast. The person I bought it for was very happy!", "Date": "March 14, 2014"}, {"Title": "love it", "Author": "aguschang", "ReviewID": "R2NNMVZGBFNTG2", "Overall": "5.0", "Content": "Great product. I so suprise come to my home is like news :). I so happy . I feel like buy in store :)", "Date": "March 13, 2014"}, {"Title": "For me much better that my iPad 2", "Author": "Linyu \"Linyu\"", "ReviewID": "RYOP4BYSCHD62", "Overall": "5.0", "Content": "I have had an iPad 2 since 2012, but due that I am not working right now but moving and traveling a lot wanted to try with the mini version (thought would be more portable and lighter). I  really love it and prefer it rather than the bigger one, this size seem to be much better for me and my needs, is great!", "Date": "March 13, 2014"}, {"Title": "Awesome", "Author": "Jasmine", "ReviewID": "R1SD66KRIB6AJC", "Overall": "5.0", "Content": "Love love love my new iPad mini!!! It came to me just like new and works perfect. No problems at all.", "Date": "March 11, 2014"}, {"Title": "This mini Ipad is Awsome is fast comfortible work like small computer in your hand", "Author": "kong saycocie", "ReviewID": "R11LT94Y9VOQGX", "Overall": "5.0", "Content": "This mini Ipad is Awsome is fast comfortible work like small computer in your hand I like it I use it watching movie and play game and also shopping online", "Date": "March 11, 2014"}, {"Title": "Thank you for all !!!", "Author": "hernan marcano", "ReviewID": "R2M87W7OPA06FI", "Overall": "5.0", "Content": "Excelent dealer !! The ipad mini just time thak you for all received and satisfaced is great machine i liked!!", "Date": "March 10, 2014"}, {"Title": "Awesome product and amazing service!", "Author": "Raecharnelle", "ReviewID": "R29I8JYX6FS7UH", "Overall": "5.0", "Content": "I am thoroughly enjoying my iPad mini. It was a great buy for a great price and the vendor sent me my product in record time.Highly recommended!", "Date": "March 10, 2014"}, {"Title": "iPad Mini", "Author": "Amy L", "ReviewID": "R167O9KX6AEAC0", "Overall": "5.0", "Content": "The mini iPad  was just a good as my regular size iPad but size wise much more convenient to travel with, I also needed the cellular option for travel purposes.  So far I am very pleased with my purchase.  The delivery time was excellent.", "Date": "March 3, 2014"}, {"Title": "Love It!", "Author": "mom", "ReviewID": "R1A1MO1X2776S", "Overall": "5.0", "Content": "Best purchase I have made in a long time.  Sold my android tablet and my Kindle Fire; bought this.  So light weight and portable.  Drop it in my purse and go.  Needed help setting it up to send and receive mail.  Now that it is up and running, I love it.", "Date": "March 2, 2014"}, {"Title": "crashes", "Author": "Savannah Morales", "ReviewID": "R3UHMLONGX0IZL", "Overall": "3.0", "Content": "the appel ipad i got crashes alot ! but i mean a lot. i always need to restart it and fix it up", "Date": "March 1, 2014"}, {"Title": "Very happy", "Author": "David Perez", "ReviewID": "R2PTAFC0K6V45Y", "Overall": "5.0", "Content": "I bought this from amazon warehouse deals and it was awesome I got it at a very good price and it was just like new sealed in the box and everything.", "Date": "March 1, 2014"}, {"Title": "Absolutely love it!", "Author": "Teresa Lacy", "ReviewID": "R1ZWHZO2H4MZMR", "Overall": "5.0", "Content": "Very pleased with the size and convenience of it.  It's perfect for around the house, car and even trips I'm my purse.  I would highly recommend it.", "Date": "March 1, 2014"}, {"Title": "as expected", "Author": "db", "ReviewID": "R1W58OGJEVRKMB", "Overall": "5.0", "Content": "I mean, it's an ipad.  It is exactly as expected.  Fits in a lab coat pocket, or into any purse/bag.", "Date": "March 1, 2014"}, {"Title": "happy birthday", "Author": "Queen", "ReviewID": "R2AS0W8L76E6HL", "Overall": "5.0", "Content": "My son love this also he is 15 so I promised him if he did well in schoolI would get it for his birthday he loves it", "Date": "March 1, 2014"}, {"Title": "great tablet even for children.", "Author": "Paulo A. Borelli", "ReviewID": "R1XEPBDQGQWDDU", "Overall": "5.0", "Content": "lots of games and education tools. My children love it. We have already two for the three children (some disputes occur...).", "Date": "February 28, 2014"}, {"Title": "Love it", "Author": "G. Holmes \"Taking care of the house\"", "ReviewID": "R3J50QOVWRO6QR", "Overall": "5.0", "Content": "It's an ipad -- it's great. It works just like the other ipads that we have and the size is great", "Date": "February 28, 2014"}, {"Title": "iPad mini", "Author": "Jeanine Neilson", "ReviewID": "RIEH1ACJIY7XG", "Overall": "5.0", "Content": "I love this product, I am a recent Apple convert and I'll never go back. Easy to use, set up, and navigation is a breeze! I am so happy with my purchase, it is priced to move the only complaint I have is with the delivery. My iPad mini was left balanced on top of my gate where it could have been stolen or fallen off to break, I was home waiting for it to be delivered and there is no excuse for that. BTW,...it wasn't shipped via a big service or the usps,...", "Date": "February 28, 2014"}, {"Title": "iPad Mini = Great", "Author": "Jaime Clayborne", "ReviewID": "R1K0TDL3DJG933", "Overall": "5.0", "Content": "It's great, I love it, no issues and I will definetly be coming back for more of my electronic needs.", "Date": "February 18, 2014"}, {"Title": "Girlfriend loves it", "Author": "love the water", "ReviewID": "RIIISCX5AJZR3", "Overall": "5.0", "Content": "Got this for my girlfriend since she likes to travel a lot. It is also great for work. Would recommend and purchase again. Happy wife....happy life :)", "Date": "February 17, 2014"}, {"Title": "Perfect size.", "Author": "Sean Anderson", "ReviewID": "R1IJWX7YNYRMDA", "Overall": "5.0", "Content": "Everything you love about your iPhone, but much more useful for at-home time. Light, awesome battery, and the same high hardware quality of any Apple product.", "Date": "February 17, 2014"}, {"Title": "Great product", "Author": "Katie E. Small", "ReviewID": "R2784PPILCYPTR", "Overall": "5.0", "Content": "Exactly what I needed. It's lightweight, portable, easy to use, and came with it's own charging cable. Great product and a better deal than on Apple's site.", "Date": "February 17, 2014"}, {"Title": "Definitely buy it", "Author": "Jhonatan Zepeda", "ReviewID": "R12Y9N165MM8NH", "Overall": "5.0", "Content": "This is a really awesome product.. I'm really happy with it.. I love it..!! I would definitely buy another one..!!", "Date": "February 17, 2014"}, {"Title": "Can't go wrong", "Author": "Pam M.", "ReviewID": "R141ZQS5X0VDK8", "Overall": "5.0", "Content": "What can I say. I love the Ipad mini. Easy to carry and has all the functionality of a full iPad.", "Date": "February 17, 2014"}, {"Title": "Great product, no charging cables", "Author": "Justin Price", "ReviewID": "RP4SX9W1AYX6A", "Overall": "4.0", "Content": "Works great, and is in great condition. Came in plastic bag without charging cables, or headphones. But once I charged it up and used it I am happy", "Date": "February 17, 2014"}, {"Title": "Great product", "Author": "Scott Roseboro", "ReviewID": "R12JUCWQ085HPQ", "Overall": "5.0", "Content": "I have a kindle and an I pod. I checked out other tablets and choose this . Delivery was on time  product was exactly as ordered", "Date": "February 16, 2014"}, {"Title": "Great", "Author": "Nicole M Brennan", "ReviewID": "R33AO05G373SQU", "Overall": "5.0", "Content": "Great tablet.. Love being able to take it everywhere and even fit in my purse if needed. Just what I expected with Apple!", "Date": "February 16, 2014"}, {"Title": "great device for special needs child", "Author": "Sue Kelly", "ReviewID": "R1G61GSID484H0", "Overall": "5.0", "Content": "my son loves it. he has special needs and is able to use it. Good battery life.Suggest getting outterbox case", "Date": "February 15, 2014"}, {"Title": "This was a Christmas gift", "Author": "plantman", "ReviewID": "R2I0JNWXVA1F3M", "Overall": "5.0", "Content": "This was exactly what my son wanted. It works and looks great and has all the features he was wanting.", "Date": "January 10, 2014"}, {"Title": "MY IPAD", "Author": "walter c farlinger", "ReviewID": "R21K437I3T90Q4", "Overall": "5.0", "Content": "IT IS EASY TO OPERATE AND IS USER FRIENDLY.RESPONES WELL TO THE WFI.I LIKE THE FACT THAT IT IS VERY MOBILE.", "Date": "January 10, 2014"}, {"Title": "She Wanted It and I Got It", "Author": "V.L.", "ReviewID": "R385CB8Y04NZ5A", "Overall": "5.0", "Content": "Just a simple present for a very good friend of mine.  She can't put it down,  Thanks.  I maybe next.", "Date": "January 10, 2014"}, {"Title": "Great Christmas", "Author": "BILLIE JEAN", "ReviewID": "RWP74E8UBHB8I", "Overall": "5.0", "Content": "This, Item was the best purchase, I have ever transacted online .I will purchase one more .as a gift to someone.", "Date": "January 9, 2014"}, {"Title": "great product  love it", "Author": "SAM NUNNERY", "ReviewID": "R2PLRB9SBD91SM", "Overall": "5.0", "Content": "i liked everything about this order no problems ipad looks and works great . i also got it fast if i had to buy another one i would not think twice about using this company", "Date": "January 9, 2014"}, {"Title": "Great", "Author": "Brenda J. Eller", "ReviewID": "RVQ4WS0RLKAH7", "Overall": "5.0", "Content": "l love the ipad.  it is so east to use.  I can du so many things with the i pad.  Love †he camera.", "Date": "January 9, 2014"}, {"Title": "everything I expected and more", "Author": "Daniel Del Pino", "ReviewID": "RLPOD30EZBT4Q", "Overall": "5.0", "Content": "This Ipad Mini is a great tool that provides mobility and quick access to a variety of professional and leisure options", "Date": "January 9, 2014"}, {"Title": "I thought it would be too small, I was wrong", "Author": "Chad K", "ReviewID": "R13L87JJVU893", "Overall": "5.0", "Content": "As a lifelong (as in, the lifetime of the tablet) user of the large 9-10 inch tablets, i always assumed the smaller tablet market was futile.  I believed the tablets were too small to enjoy web browsing and media.  I didn't see a need for smaller screens because we had smartphones for that type of portability.  But when the iPad mini was deeply discounted at the release of the mini with retina I gave one a shot.  I must say that the mini is amazing.  I'm writing this review on my mini as my iPad air sits one foot away on the table next to my desktop computer.  The mini fills a void I never thought there was.  Its portable yet large enough to comfortably view the screen.  It fits in your large pockets and can easily be carried around.  Its small enough to type quickly on while being held.  It is simply a beautiful tablet that I wish I had purchased sooner.", "Date": "January 9, 2014"}, {"Title": "Nice product", "Author": "lindsay swarthout", "ReviewID": "R3IID7PWUN4ORZ", "Overall": "5.0", "Content": "I love it  I  am on it all the time  it works great on what I use it for it's better than the big one", "Date": "January 9, 2014"}, {"Title": "What's not to like", "Author": "Dennis Lindsey", "ReviewID": "R219RZ61FAWCD6", "Overall": "5.0", "Content": "It turns on and off easly, lights up nicely, all buttons click or press flawlessly.The glass face is smooth and turns black when off, like weird.The battery last as long as it lasts.Magnets do not adhere to the back as it is not steel.Just like a iPad but smaller.", "Date": "January 9, 2014"}, {"Title": "Apple iPad mini purchase", "Author": "John", "ReviewID": "R1L3EPGWLE2ZHJ", "Overall": "5.0", "Content": "I was very pleased at the timely receipt of my iPad mini! The item arrived carefully packaged and in great shape! My iPad works perfectly and we are very happy!", "Date": "December 30, 2013"}, {"Title": "Great product", "Author": "John Lewis \"DIYer\"", "ReviewID": "R1X98JJ6F07NV", "Overall": "5.0", "Content": "Have other IPads and iPhones, chose this as a Christmas gift.  The recipient loves it, portable size, wonderful display, lots of storage space.", "Date": "December 30, 2013"}, {"Title": "Best out of Five", "Author": "DON PREFONTAINE", "ReviewID": "RX5NWIBC4MSCD", "Overall": "5.0", "Content": "My 5th tablet is the best.First was gen 1 iPad - too big for someone who travels a lot.Second thru fourth were Motorola, Sony, and Asus top-of-the-line Android based - temperamental.Fifth is the mini Retina edition: reliable, very portable with fast access to WiFi, easy configuration for roaming across both sides of the border.", "Date": "December 30, 2013"}, {"Title": "Love Love Love", "Author": "_ayeRain", "ReviewID": "RCNVDRP7GNGPH", "Overall": "5.0", "Content": "My daughter loved it! She won't put it down! Brand new just as descripted! Feel great about the purchase !", "Date": "December 30, 2013"}, {"Title": "Love this device", "Author": "Jeff S. Kravitz", "ReviewID": "R3BFK4HQO0K58U", "Overall": "5.0", "Content": "Got this for my 8 year old son for xmas, should have got me one too. First ipad in our family, this thing is the bomb. He has to fight me for it.Standard shipping got it to me in only 2 days, can't beat that.", "Date": "December 29, 2013"}, {"Title": "iPad mini", "Author": "carolynÃƒâ€šÃ‚Â McQuade", "ReviewID": "R2MVTT1AZOIV2D", "Overall": "5.0", "Content": "Expectations were met.  No problems.  Sealed package.  Nothing was missing.  Works fine.  Mom loves her Christmas present.  Thanks so much!", "Date": "December 29, 2013"}, {"Title": "Love this iPad", "Author": "Joy M. Schaefer", "ReviewID": "RX8MJX178HEPO", "Overall": "5.0", "Content": "Mini is everything iPad was and far more totable. Glad I made the decision to upgrade to the mini ioad", "Date": "December 29, 2013"}, {"Title": "Wonderful", "Author": "Wendy Johnson", "ReviewID": "R3I3NM03DH5SW3", "Overall": "4.0", "Content": "It was what I wanted and what it can do for me love every minute of it thank goodness for internet", "Date": "December 29, 2013"}, {"Title": "Great size!", "Author": "Valeria Quintero", "ReviewID": "R19IYSRFZ871SU", "Overall": "5.0", "Content": "The product came in perfect time and conditions and it works perfectly. Have the best size, is very easy to carry and fit in any bag.", "Date": "December 28, 2013"}, {"Title": "The mini is a giant!", "Author": "Diane Allen", "ReviewID": "R2NKFBCRJAGK81", "Overall": "5.0", "Content": "This was a gift for my grandson, who is five. He is so happy with his ipad! We downloaded all his music and favortie games and pictures onto the ipad before Christmas, so it was ready to go on Christmas morning when he opened it!He plays with it nonstop! He loves it!", "Date": "December 28, 2013"}, {"Title": "Sleek and portable", "Author": "Barbara Burgess", "ReviewID": "R1S8A5666E5TLD", "Overall": "5.0", "Content": "Worth the bucks,  pictures are fantastic.  Love the portability and size.  Lots of free apps too, all I Need is my mini", "Date": "August 31, 2013"}, {"Title": "I love it", "Author": "M.K.B. \"M.B\"", "ReviewID": "R2QUNWRXQFITLV", "Overall": "5.0", "Content": "I wanted a smaller ipad than the original, especially because I travel frequently. This is a perfect size. I love my ipad. I take it with me everywhere.", "Date": "August 31, 2013"}, {"Title": "Apple makes great products", "Author": "Durland E Evans", "ReviewID": "R6AKRYS2DC4EJ", "Overall": "5.0", "Content": "the ipad mini nis great...fast, light, and just right for traveling. Seemlessly interfaces with my iphone 4s which I also love...sorry, microsoft, you don't compare!", "Date": "August 30, 2013"}, {"Title": "Excellent tablet. My soon is using it every day.", "Author": "Jose Luis Valdez", "ReviewID": "R17GK058C972WM", "Overall": "4.0", "Content": "This was a gift for my son. He uses every day, not just to play video games, but also for his homework and he started to reed ebooks. It has a good screen size and is easier to carry than the Ipad.", "Date": "August 30, 2013"}, {"Title": "Terrific product!", "Author": "Maurie", "ReviewID": "R3AKO7M5D9I5ZC", "Overall": "5.0", "Content": "Perfect for anything you do on your laptop or desktop. Couldn't imagine not having one! If you're keeping lots of photos get the 64.", "Date": "August 30, 2013"}, {"Title": "Love it", "Author": "kclady", "ReviewID": "R1WV6C4ADZUE3U", "Overall": "5.0", "Content": "I bought one at the apple store yesterday and I love it. I was unhappy with my current tablet. Upon first use it was obvious to me that the ipad is superior  to everything on the market. I finally understand why everyone loves these thing!. Super fast, a lot of power. I watched movies all night with flawless streaming. AND GUESS WHAT??!?!?  You can watch your amazon unbox videos and movies on it!!!!!  Its the only tablet outside the kindle Fire that allows access to amazon digital movies/tv. !!  main reson i wanted this for i was tired of having 2 tablets. I had a kindle fire and a toshiba excite. now i can sell my other 2 and keep this.Only thing i did not like is it asks you for your password everytime you download an app", "Date": "August 25, 2013"}, {"Title": "Perfect", "Author": "Raina Asid", "ReviewID": "RKI8W300UTG5U", "Overall": "5.0", "Content": "It was good, it gave me a little trouble after it didn't turn on. But going down to the apple store, and it still having warranty. I went down to the apple store and got a brand new one for free.", "Date": "August 23, 2013"}, {"Title": "Awesome", "Author": "Maria Abarca", "ReviewID": "R3D21V6L0SIQHX", "Overall": "5.0", "Content": "Love my ipad mini. Size is really nice cause I can throw in my purse and it is small but big enough to read!", "Date": "August 23, 2013"}, {"Title": "Love it!!!!", "Author": "Gospel Scribe", "ReviewID": "R11NRVKUAWT0IL", "Overall": "5.0", "Content": "I'm not a \"techie\"! But, I'm so glad that I bought this iPad. I've been using an 8 GB iPod for years and have been running out of space. Hence, the need for the switch. The display is clean and crisp. It's nice to have a larger screen to work with. Loaded with all the apps I've grown to love on my iPod. This is a must have for anyone who is intimidated by Androids (like me!)!!!", "Date": "August 23, 2013"}, {"Title": "Awesome!", "Author": "S. Alvarado \"last minute shopper\"", "ReviewID": "R2KIQ1B7KAFTBV", "Overall": "5.0", "Content": "the ipad was received faster than expected and it is in great condition. I also received extra things with it that would normally have to be purchased separetely like a cover with a stylus and the screen protector.", "Date": "August 23, 2013"}, {"Title": "A Great Device", "Author": "James A. Kirk", "ReviewID": "R31NHLFI5IXUWJ", "Overall": "5.0", "Content": "This is a great media device.  It does so many things better and easier than a PC.  It makes picking up my lap top a chore.", "Date": "August 20, 2013"}, {"Title": "Great Honest Seller!", "Author": "Michael Appino", "ReviewID": "R24EXSLAPVL3AM", "Overall": "5.0", "Content": "The Mini was as advertised and is so much better to use then the regular Ipad.Light and built well.", "Date": "August 20, 2013"}, {"Title": "Minitastic", "Author": "Arthur L. Williams \"The Deacon\"", "ReviewID": "R169BU2AAP4SR2", "Overall": "5.0", "Content": "The IPad mini is an outstanding tablet device.  The camera especially takes outstanding pictures.  The slim size and portability are also great features.", "Date": "August 20, 2013"}, {"Title": "Very good. I recommend it.", "Author": "Feii", "ReviewID": "R32VAPZ0AB8Q3I", "Overall": "5.0", "Content": "It is exactely what I have expected to be. Smaller and lighter than an iPad. I like it. A very good product.", "Date": "August 18, 2013"}, {"Title": "I love my iPad mini", "Author": "VOCALMAESTRO", "ReviewID": "R3MFHREJMKF3EH", "Overall": "5.0", "Content": "I love this iPad mini. It's in perfect condition and it works noticibly better than my iPad 1 the camera sound and video quality is first rate", "Date": "August 17, 2013"}, {"Title": "Great tablet! Fulfills my requirements!", "Author": "Jairo", "ReviewID": "R1HIOF6JZG7NMP", "Overall": "5.0", "Content": "I really like it! And the size is just perfect! I bought it for work and so my son can have a portable video player and gamer. We both like it very much!", "Date": "August 17, 2013"}, {"Title": "Great product", "Author": "Dan", "ReviewID": "R312O3GL4O086E", "Overall": "5.0", "Content": "I own a full size IPad and the mini performs Just as well as its big brother but in a more convenient size.", "Date": "August 17, 2013"}, {"Title": "Does this need another review?", "Author": "S. Boothby", "ReviewID": "R1Q1C5MBG9PMCA", "Overall": "5.0", "Content": "I looooooooooooooove this product! Use it everyday for all kinds of things. Am constantly finding new ways to work it into my mini iPad lifestyle. Yeah! So glad I got the mini because I wouldn't carry the larger one to all the places I take this one. It's so much more useful than a celphone and so much more \"there when I need it\" than my laptop.", "Date": "August 16, 2013"}, {"Title": "Best gift for the wife.", "Author": "Gerardo Gutierrez", "ReviewID": "RQ37HKEL44NSL", "Overall": "5.0", "Content": "I got the iPad mini about 6 months ago as a gift for the wive. Beside that she love it, I see her using it constantly so it was money well spent.Very responsive, light, well built. It goes wherever we go and it has been a great travel companion.The charger cable has very small plug at the end and I like the fact that it goes in the iPad in any orientation.It's a very convenient device in every aspect.", "Date": "August 16, 2013"}, {"Title": "It frees you from the computer/laptop!", "Author": "Carlene Inge \"passion reader\"", "ReviewID": "R3S3I5LLED1MPZ", "Overall": "5.0", "Content": "My husband and son love theirs.  They play art games with one another, they research, the connect with friends.  It fits nicely into the hand and is extremely portable and well-protected in the case.  We call my husband's the \"electronic lady\" because he cannot keep his hands off \"her\".  He is however, now researching more with the family for items he needs rather than in his office on the computer.", "Date": "August 15, 2013"}, {"Title": "Better than Std I-Pad", "Author": "RJGUY", "ReviewID": "R72K1UK1R8C45", "Overall": "5.0", "Content": "It's what I hoped it would be - a replacement for my original iPad 2. It's more portable, easier to hold, lighter than the original. It does everything the larger one does. It's larger than a 7\" android tablet. It fits my needs perfectly. And oh yes, it has Sari too!", "Date": "June 2, 2013"}, {"Title": "Awesome", "Author": "Salustiano Arzuaga", "ReviewID": "R1XHKAX008028Y", "Overall": "5.0", "Content": "Just the perfect size in your hands bought it for my wife on mothers day liked it so much im going to have to buy one for myself", "Date": "June 1, 2013"}, {"Title": "good service and delivery", "Author": "Huibing Yang", "ReviewID": "R1789YW65WTWFR", "Overall": "5.0", "Content": "That is a beautiful graduation gift for my daughter. She likes it very much and read a book on the first day she got it. Thanks very much", "Date": "May 29, 2013"}, {"Title": "Good service, fast shipping, but cable and charger does not work", "Author": "Jie Chen", "ReviewID": "R10K5CC8S4WB93", "Overall": "3.0", "Content": "The service of seller was good, fast shipping and nice attitude.But the charger and cable was not orginal and not working after a couple of days. I contacted the seller, he promised to send another charger, but nothing happened later.I have to buy an apple cable myself, which costed me $20 more. Anyway, the ipad mini itself is good.", "Date": "May 29, 2013"}, {"Title": "Great Size", "Author": "Jennifer", "ReviewID": "R42ERCWOIH0QE", "Overall": "5.0", "Content": "Having fought the urge to get an ipad for years due to it's price tag, I am thrilled at the mini's price. I love the smaller size verses the bigger ipads. I use this for college and play. It goes everywhere with me. The only drawback I have with the mini is it is limited in it's storage at 16 GB.", "Date": "May 28, 2013"}, {"Title": "Ipad mini", "Author": "K. Debevc \"IKat2u2\"", "ReviewID": "R1EQ62PVNK2S69", "Overall": "4.0", "Content": "I purchase this IPad mini in order to use it for traveling.  I have the IPad Retina but is to big for carrying in my purse.  It will do everything the bigger IPad will do but the picture is much better on the IPad Retina.  Having a few problems with the wifi staying up and had to call Apple on it.  That still hasn't totally been resolved.  But I will say the Apple people are very easy to work with.  Its sad to say but the price on the Mini was pretty near what I paid for the 10\" Ipad.  All in all I am very satisfied with it and just crossing my fingers that it will work in Europe when I really need it too.", "Date": "May 28, 2013"}, {"Title": "i like it but . . .", "Author": "Karen E. Lane \"klane 55\"", "ReviewID": "R1V4LJ513J5EUM", "Overall": "4.0", "Content": "through the years i have owned various iPods. this is my first Apple product with computer like elements. i live in the mountains where my 3G smart phone has issues with coverage (a 1 foot area in my house that allows me an ok phone call) and wasnt sure if the 4G  and wifi on the iPad would work any better, it doesnt work better in fact it is worse. i try to face time with my grandson and it stops and restarts constantly. right now i'm chalking it up to my inexperience with Apple and will caontact Apple and Verizon for help! immediately. (i even tried it outside the area and had even worse luck)if you are a city person, with towers all around you- go for it!! the screen is amazingly clear. if you're a mountain person and want to use it for internet access, maps etc. - really think about it!", "Date": "May 28, 2013"}, {"Title": "My iPad Mini", "Author": "jarmag", "ReviewID": "R3J4WBBNGTEZNN", "Overall": "5.0", "Content": "I am greatly happy and satisfied to receive the item in well packed condition. It is delivered early from its schedule. The item is exactly the same 16GB Wi-Fi+3G Sprint as I ordered. It is operating very well. Your service is very much satisfactory. Thank you.", "Date": "May 28, 2013"}, {"Title": "Perfect Size, Great price, Apple Quality", "Author": "Damian", "ReviewID": "R2BU8JHMSJV7PI", "Overall": "5.0", "Content": "I was about to buy a Nexus 7, but I really didn't like the screen. I tried some other android tablets about this size but none of them have the quality the iPad mini has. I think its worth to pay a bit more for a more decent screen, as I planned to use it to read and view graphic content like Pinterest, Dribbble, Photojournalism, etc.I really like how much the battery last, It's great that I can have it 2 or 3 days without charging, while I've to charge my mobile phone everyday.The downside is that in Android you've a lot more of free apps. Most of the free apps in iOS have items inside you've to pay to unlock. You may think that's because there are great quality apps, but some of them are just not so great apps insisting on sell you stuff.Finally, I really miss Swype from mi Android phone. It's still a pain for me to write on the ipad, and I see it difficult to get used to it anytime.", "Date": "May 27, 2013"}, {"Title": "Apple iPad Mini", "Author": "Carolyn A. Swafford", "ReviewID": "R3JMYDAGB3IRB7", "Overall": "5.0", "Content": "I absolutely love my iPad mini. The ease and convenience of using it, along with the variety of thing that it can do have made it a real joy to own.", "Date": "May 26, 2013"}, {"Title": "iPad mini", "Author": "Mario Diaz-Bello", "ReviewID": "R15JN0KU2MEVZI", "Overall": "5.0", "Content": "Love this device. The screen is so clear and so much bigger than my iPhone! Really easy to use. Can't live without it.", "Date": "May 10, 2013"}, {"Title": "The Mini is the best", "Author": "Truvor", "ReviewID": "R3H84S7QPQEN3S", "Overall": "5.0", "Content": "I've used iOS devices for several years, and the Mini is by far the best. Better, IMO than the full sized iPad. More useful and more flexible. And unlike Android tablets, iOS devices work brilliantly for music processing apps, like guitar amps and synth apps.", "Date": "May 9, 2013"}, {"Title": "iPad mini", "Author": "Nancy G.", "ReviewID": "R1EL769XALYRWN", "Overall": "5.0", "Content": "I really love this mini iPad. I don't have any other tablets so maybe they would all seen just as fun but it is so speedy, easy to use. I do have a mac book pro so the OS is familiar to me.", "Date": "May 9, 2013"}, {"Title": "Thank You!", "Author": "victoria", "ReviewID": "RK01M7MZ9WDX0", "Overall": "5.0", "Content": "My mother is going to love this! I got in for mothers day, came right on time and I'm super happy with the ipad mini.", "Date": "May 8, 2013"}, {"Title": "Conventient", "Author": "ccazinha", "ReviewID": "R1LYNCKXHPSPV4", "Overall": "5.0", "Content": "Love my ipad mini! It is the perfect portable size! Product works great and is just as described! Way better than the kindle!", "Date": "May 7, 2013"}, {"Title": "very good, it is new!", "Author": "liyuhai", "ReviewID": "R1J7FIOANBF9MW", "Overall": "4.0", "Content": "nice, I like it very much! Lack of earphones, not perfect. Maybe, next time, earphone and ipad can be sold together.", "Date": "May 7, 2013"}, {"Title": "LOVE!", "Author": "Ericka", "ReviewID": "R61ZRND4PCYGQ", "Overall": "5.0", "Content": "I love the Ipad mini! I am not technologically advanced at all, but this has already won my heart! I never wanted anything apple until after grad school, just as a reward for hard work. Luckily, A few peers and I are studying abroad and the professors recommended this product or a kindle. Thus, my apple award came sooner than I would have thought. ENJOY!", "Date": "May 7, 2013"}, {"Title": "I love it!!!", "Author": "Israel Rojas", "ReviewID": "R2EC431QZ5X3LB", "Overall": "5.0", "Content": "For the supplier, the delivery was fast and great quality. And the product: I just love my IPAD, the older models are way too big, but this one is easy to carry in college, at work, etc. I would recommend anyone to buy apple products.", "Date": "May 7, 2013"}, {"Title": "Ipad Mini", "Author": "Gerald Crawford", "ReviewID": "R2EN8DNP2Z1L6I", "Overall": "5.0", "Content": "Item received in good condition.  Working without any problems.  I've used the Ipad for years and wished to try out the Ipad Mini.  Now I have one and I love it.", "Date": "May 6, 2013"}, {"Title": "Product works great", "Author": "Marti Arvin", "ReviewID": "R1SS8FVA0H8VPX", "Overall": "5.0", "Content": "I really like how compact it is. would recommend to others who are looknig for a compact version of the ipad", "Date": "May 6, 2013"}, {"Title": "great device", "Author": "amina", "ReviewID": "R3TUTDBM4DIUDM", "Overall": "4.0", "Content": "I think this ipad is ways better than the previous ones. Yet, i do not find it as fast as a laptop. I need to restart it to make it function better. I have to say that I did not add the verizon option, yet because I am using it with available wi-fi I have at home. But overall, it has many applications that I need for myself and my baby. He loves to see some programs for a few minutes daily. I would say 5-10 mn. I do recommend it for anyone who needs a tablet to facilitate reading and writing on your pdfs. It will not replace the printed book, but it helps a lot to have that boost to keep it going in a pleasant way.  It is just fabulous!", "Date": "April 28, 2013"}, {"Title": "Apple iPod mini review", "Author": "howard", "ReviewID": "R2LUWLGPRMDVHM", "Overall": "5.0", "Content": "Works great ,easier to carry than a laptop. Just what I needed for traveling. Easier to read than my iphone", "Date": "April 28, 2013"}, {"Title": "Love it.  Hubby learning to use it.", "Author": "S. E. Yaddow", "ReviewID": "RW0T2OCCXJW3I", "Overall": "5.0", "Content": "Very happy with the product purchased for my hubby.  He is learning to use it.  Very user friendly for some who isn't computer savvy.", "Date": "April 27, 2013"}, {"Title": "Wow!", "Author": "Donald Graham", "ReviewID": "R1FJOC0A1TJJ5R", "Overall": "5.0", "Content": "I just picked this up and I have been very pleased with it. Other then the normal stuff this thing can do, I can administer my Windows, Mac, and Linux machines all from this iPad. SSH, RDP, Apple Remote Desktop, etc. It pretty much replaces my laptop and it will be even better when I get my SHARKK Apple iPad Mini Keyboard Bluetooth Case Cover Stand. I was a little concerned at first about not having a Retina display, but it looks great to me and if non-Retina keeps the cost down, then why pay extra for what I don't need. I also like that all my premium paid for iPhone apps transferred over to my iPad Mini. I was on the fence about the cellular model that also has the GPS, but I didn't like the price difference. I decided its cheaper to just buy a Dual Electronics external Bluetooth GPS receiver.", "Date": "April 27, 2013"}, {"Title": "4.5 stars", "Author": "Maine", "ReviewID": "R22RWCI9FE0EVQ", "Overall": "4.0", "Content": "though nowhere near as open as my nexus 7, i really like the ipad mini, plus the apps with the apple store. I love the size and feel. Great product", "Date": "April 26, 2013"}, {"Title": "It serves my purpose", "Author": "Miles", "ReviewID": "R1D3AIO0KR564X", "Overall": "5.0", "Content": "Fast. Stable. Easy to use. I could not have made a better choice for a tablet.  Use it and the nexus 7 before you choose the screen scale that suits you most.", "Date": "April 25, 2013"}, {"Title": "Perfect little tool for school", "Author": "K. E. S.", "ReviewID": "R13G9MFHLSOW82", "Overall": "5.0", "Content": "our son uses this for middle school assignments.  Alot of kids do these days (yikes).  He likes the extra gb and it's very handy both for school and for travel (he is on travel sports teams).  He loves it.", "Date": "April 25, 2013"}, {"Title": "A Wonderful Device", "Author": "Vista Verde 5th Grade", "ReviewID": "RRTAIWDVJZAMV", "Overall": "5.0", "Content": "I used to think that the iPad was better than the iPad mini but I was wrong. This device, even though it's small,  can do everything a computer can do. It has bright colors and the graphics are really nice so when my brother is playing minecraft , the screen is super clear and the buttons are easy to use {unlike a real phone it is hard to text}. When I listen to itunes or Pandora, the music sounds super clear without the headphones{unlike the iPod}. Also the iPad mini is super light so I can hold it in one hand and my hand won't get tired. When I study for tests and exams, I use siri/notes and when I talk on notes what ever I say  goes on the paper. It makes it easier to study. This device has great memory and loads super fast so if you buy a game or music it takes only takes a few seconds to load. There are  small things that I don't like about my iPad mini. When I am using the internet or Google, I can barely see the print. Also, it is complicated to set up Imesseges if you don't have great reception. Overall this is a great device and I highly recommend.- Olivia", "Date": "April 25, 2013"}, {"Title": "its an electronic swiss army knife", "Author": "g...", "ReviewID": "RSFGZC65W3Y05", "Overall": "5.0", "Content": "I brought the Verizon version for its hardware. I read the Verizon version will work on other carriers but the same is NOT true of the ATT - so for me its was protecting the resale value.Love the LTE speed.I got the 32 Gb version since the 16 is way to low for me for the books and magazines I read.In a pinch I can use the tethering feature on it if my cable goes out and I dont think verizon cares - as long as I dont suddenly spike on my data usage.  The same cant be said of ATT.The ipad itself is so much easier to handle.  Its sooo much lighter than the regular iPad. after using it I cant get over how heavy the 10 inch one is.I also had a regular sized 32Gb iPad 3 w/ RD. and sold it to get the asus transformer prime. I got it since it had one feature I wanted, the expandable memory. I loved the Prime at first but it was glitchy and got slower over time.  But it was never quite as smooth as polished as iOS. I guess google needs to work on improving their \"photocopier\".I started using my wife's iPad one day and just kept using it since it was so much smoother and it never froze up like the prime.I decide to get a mini since it had just come out and it was cheaper. I got the 32 Gb LTE version for a little more than the base regular wi-fi only ipad with 16 Gb.The non-retina display is not a big deal for me even though I had a iPad 3 and a iphone 4 (replaced w/ a 5). The resolution IS better than a non-retina display iPad but not as good as the ipad 4 w/ RD. Bottom line its good enough to watch movies and view pictures or magazines on.The mini with LTE is the perfect size for using as a gps in the car.  Its way bigger than almost all gps provided in any car right now. Plus it doesnt cost +$2K like it does as an option on a car.Its also the perfect size to use to control my TV as a remote for Apple TV, Comcast (although I have the wrong cable box right now), ...Cons: The only down side thats important to me was the lack of expandable memory. But I did find a fix for that.  I use a Seagate GoFlex Satellite Mobile Wireless Storage 500 GB USB 3.0 External Hard Drive STBF500101 Black. It lets me stream wirelessly up to 500 Gb of movies, music or whatever to my ipad.  It even works if I dont have a wi-fi signal since it generates its own signal.  And upto 3 devices can watch 3 different movies at the same time. pretty cool.", "Date": "April 24, 2013"}, {"Title": "Excellent", "Author": "Lou", "ReviewID": "RSEPJ33AW0539", "Overall": "5.0", "Content": "This device was in real good shape and the kids love it.  This is just the right size for viewing.  Easy to carry with you when goin gto places.", "Date": "April 23, 2013"}, {"Title": "Perfect Perfect Perfect", "Author": "Christopher", "ReviewID": "R3LS7S0CXTZO8H", "Overall": "5.0", "Content": "I have been wanting one for the longest time and always thought the regular iPad was a but large. This came out and I was like \"woah\". I am SO SO happy about my purchase, if you want one...GET the Mini...AWESOME!", "Date": "April 4, 2013"}, {"Title": "Love this size", "Author": "Charlotte Tucker", "ReviewID": "R3RU8GHPPC25EB", "Overall": "5.0", "Content": "Love this size! Amazing product. I did fine that my USB cable has already came loose on one end which makes me sad after what I paid. I would recommend a case that when you are using your pad has a handle on the back. Makes it so much easier to use.", "Date": "April 4, 2013"}, {"Title": "Love the mini", "Author": "R. Cranford \"Robbyn\"", "ReviewID": "RDNVNRY6CY5DQ", "Overall": "5.0", "Content": "This  was to replace my iPad 2, I absolutely love the light weight and the clarity of the picture on it.", "Date": "April 2, 2013"}, {"Title": "No-Brainer", "Author": "Jon Miller", "ReviewID": "RTHA0SWOQTWDW", "Overall": "5.0", "Content": "After hours of tablet research, It came down to quality and price, and this product ended up being chosen, but it should have been a no-brainer. It is the perfect size for anyone. Whether you use it for reading, gaming, business, school, or personal use, this is easily the best tablet you can purchase under $400. I wouldn't recommend anything else.", "Date": "April 2, 2013"}, {"Title": "iPad mini", "Author": "Mel", "ReviewID": "R31Q4H0C3K7WDN", "Overall": "5.0", "Content": "Very nice!  Small yet gets the job done,  it shipped quick and secure with no problems. I love it.  4g works great as well.", "Date": "April 2, 2013"}, {"Title": "Goodbye Ipad, Hello Ipad Mini!!", "Author": "B-Luv", "ReviewID": "R3QUL2T507BHA2", "Overall": "5.0", "Content": "I have a 4th generation Ipod Touch 64gb and an Ipad2 16gb.When the ipad mini was announced, I wasn't impressed.  I was fully satisfied w/ my ipad2. Only thing that was making me consider getting the mini was its portability.  With the ipad2, you have to have it in a case, plus a bag if you don't want to accidentally drop it...plus setting it up, etc...Well, I ordered the mini last week and I haven't been able to put it down!!  I absolutely love this thing!Unexpected surprises...- the weight...it feels like you're holding a piece of cardboard...it's light.- the speakers...they're loud & it doesn't matter whether u place it on its front or back, u can hear them perfectly...and u get stereo speakers that sound soooo much better than my ipad2 and louder, clearer, etc...  I've been listening to music on this way more than on my ipad2...- the cameras...front and back...they are a very nice upgrade and the back camera is nice b/c it doesn't matter whether u take a pic, light or dark, it comes out nicely lighted and clear...  isight camera must use every available slither of light to give u a decent pic in just about any bad lighting situation, which is unexpected coming from a tablet.-typing...for some reason, it seems soooo natural to type on the mini... it's a one and a halfer by its size, but it feel effortless-screen resolution...after reading endless reviews about the mini NOT having a retina display, I almost didn't buy it...BUT I love this screen...it is tight, crisp, and I have no problems reading...in fact, the videos that I watch on here are INCREDIBLE... so, for those of you on the fence about the screen resolution, it's a non-issue as far as I'm concerned...don't cheat yourself, like I almost did...I've been watching videos and finishing them in one sitting...that's how nice the screen is...I see things I didn't notice on my ipad2Sadly, I haven't had the desire to pick up my ipad2 since I got the mini... I will have this thing for a very long time... Oh, and if you decide to get one, get 32gb or 64gb...I have the 64gb and I absolutely love it!!!", "Date": "April 2, 2013"}, {"Title": "Fun!", "Author": "Amazon Customer", "ReviewID": "R5YCAQPR7N8LV", "Overall": "5.0", "Content": "I bought this to help me with school work.  It ihas so many great features.  It is just the right size for my hands.  It had great resolution, so it is easy to see and read.  The camera takes fantastic pictures.  It is easy to use and customize.  There are so many free and inexpensive apps to use with it.  This is a great iPad for anyone.", "Date": "March 29, 2013"}, {"Title": "Awesome!", "Author": "Milan00", "ReviewID": "R171PVA6RSUOVL", "Overall": "5.0", "Content": "Very great product fast shipping! As soon as it came in i started to download apps and browse the internet everything is working fine and fast very slim and lightweight!", "Date": "March 28, 2013"}, {"Title": "Another \"Family Friend\"", "Author": "Anders Johannesson", "ReviewID": "R16CUOAHGG9GGL", "Overall": "5.0", "Content": "There are two schools.1) The Apple way2) The Open wayIf you want an environment where you can work seamlessly in all aspects without \"hurdles\" of upgrading this, upgrading that, is it compatibile with this, do I need a service pack xyz, etc, etc. You know what I mean, Apple has it all.Sure once you're in, \"you*re in\"! Some call it \"locked in to\" even \"trapped\"....well fine.Until anyone else will bring it all together I see no need to look elsewhere for a bigger screen only, faster CPU, only, more MegaPix only etc, etc and to have it \"open\".Last but not the least, the Apple gadgets whatever they are simply look stylish, design cool & sleek in all ends.", "Date": "March 28, 2013"}, {"Title": "Small discrepency in what was said to be included and what was.", "Author": "Decarrabus", "ReviewID": "RZ7YNIRMFEDXY", "Overall": "4.0", "Content": "It did not come with a cable, no big deal I just bought a new one. iPad is in great shape and does what I need it to do. 4 stars", "Date": "March 27, 2013"}, {"Title": "Awesome!", "Author": "Milan00", "ReviewID": "R171PVA6RSUOVL", "Overall": "5.0", "Content": "Very great product fast shipping! As soon as it came in i started to download apps and browse the internet everything is working fine and fast very slim and lightweight!", "Date": "March 28, 2013"}, {"Title": "Another \"Family Friend\"", "Author": "Anders Johannesson", "ReviewID": "R16CUOAHGG9GGL", "Overall": "5.0", "Content": "There are two schools.1) The Apple way2) The Open wayIf you want an environment where you can work seamlessly in all aspects without \"hurdles\" of upgrading this, upgrading that, is it compatibile with this, do I need a service pack xyz, etc, etc. You know what I mean, Apple has it all.Sure once you're in, \"you*re in\"! Some call it \"locked in to\" even \"trapped\"....well fine.Until anyone else will bring it all together I see no need to look elsewhere for a bigger screen only, faster CPU, only, more MegaPix only etc, etc and to have it \"open\".Last but not the least, the Apple gadgets whatever they are simply look stylish, design cool & sleek in all ends.", "Date": "March 28, 2013"}, {"Title": "Small discrepency in what was said to be included and what was.", "Author": "Decarrabus", "ReviewID": "RZ7YNIRMFEDXY", "Overall": "4.0", "Content": "It did not come with a cable, no big deal I just bought a new one. iPad is in great shape and does what I need it to do. 4 stars", "Date": "March 27, 2013"}, {"Title": "Excellent!!!!!", "Author": "Julio", "ReviewID": "R8IY99ZY8VEO7", "Overall": "5.0", "Content": "This is all that I need... I totally fall in love with my mini.... There are not a complain or issue, is magical, is amazing, is the best thing that i ever bougth... Thanks...", "Date": "January 22, 2013"}, {"Title": "A Full-on iPad Only Smaller", "Author": "@dwstill", "ReviewID": "R1OXOL6PW146QL", "Overall": "5.0", "Content": "My iPad mini is a fully capable iPad; it's just smaller. That makes it more portable. I'm still looking for the perfect planner app to complete my intended usage, but I'm confident I'll find it eventually.", "Date": "January 22, 2013"}, {"Title": "The Best invention yet, My mini I Pad!", "Author": "Jenny Stevens", "ReviewID": "R11E65SOEK3LIM", "Overall": "5.0", "Content": "The best invention yet.  We love it in my family  I bought another one so we can share more in my family.", "Date": "January 22, 2013"}, {"Title": "Right size!", "Author": "Philip Thompson", "ReviewID": "R1CRWM56RSOLDL", "Overall": "5.0", "Content": "For me it is the best size. My iPhone is sometimes too small and the original iPad is a litte large. The screen is very clear and easy to read.", "Date": "January 20, 2013"}, {"Title": "This is so well made and works perfectly!", "Author": "Sammy Carr \"macking301\"", "ReviewID": "RTVHBFMYZZSPZ", "Overall": "5.0", "Content": "I have had my iPad mini since day one. It's the white 16 gig wi-fi version. The screen quality is perfect. The size is perfect. The speed is amazing! I do not think you will find a product like this anywhere but Apple. And for the $329.00 I paid, it has SIRI, stereo speakers, microphone and FaceTime for the best video chat in the industry. A steal at the price and despite Amazon brushing the product aside because they sell readers, this is the best of the best. This time Amazon may not be the best place to but this product. Compition makes it underwhelming until you get to the reviews! Get one from Apple or wherever and you will not look back!", "Date": "January 19, 2013"}, {"Title": "You will love the mini iPad!", "Author": "bfaughender", "ReviewID": "R1ZRILX0QNO3LL", "Overall": "5.0", "Content": "It's everything I wanted it to be.  I have an older iPad and knew what to expect.  I just wanted the smaller size.", "Date": "January 19, 2013"}, {"Title": "Pad mini", "Author": "patricia guellar", "ReviewID": "R28JASTUFTD0MC", "Overall": "5.0", "Content": "Love it was very quick getting here and everything they said it would be daughter has a brand new toy", "Date": "January 18, 2013"}, {"Title": "Excellent!!!!!", "Author": "Julio", "ReviewID": "R8IY99ZY8VEO7", "Overall": "5.0", "Content": "This is all that I need... I totally fall in love with my mini.... There are not a complain or issue, is magical, is amazing, is the best thing that i ever bougth... Thanks...", "Date": "January 22, 2013"}, {"Title": "A Full-on iPad Only Smaller", "Author": "@dwstill", "ReviewID": "R1OXOL6PW146QL", "Overall": "5.0", "Content": "My iPad mini is a fully capable iPad; it's just smaller. That makes it more portable. I'm still looking for the perfect planner app to complete my intended usage, but I'm confident I'll find it eventually.", "Date": "January 22, 2013"}, {"Title": "The Best invention yet, My mini I Pad!", "Author": "Jenny Stevens", "ReviewID": "R11E65SOEK3LIM", "Overall": "5.0", "Content": "The best invention yet.  We love it in my family  I bought another one so we can share more in my family.", "Date": "January 22, 2013"}, {"Title": "Right size!", "Author": "Philip Thompson", "ReviewID": "R1CRWM56RSOLDL", "Overall": "5.0", "Content": "For me it is the best size. My iPhone is sometimes too small and the original iPad is a litte large. The screen is very clear and easy to read.", "Date": "January 20, 2013"}, {"Title": "This is so well made and works perfectly!", "Author": "Sammy Carr \"macking301\"", "ReviewID": "RTVHBFMYZZSPZ", "Overall": "5.0", "Content": "I have had my iPad mini since day one. It's the white 16 gig wi-fi version. The screen quality is perfect. The size is perfect. The speed is amazing! I do not think you will find a product like this anywhere but Apple. And for the $329.00 I paid, it has SIRI, stereo speakers, microphone and FaceTime for the best video chat in the industry. A steal at the price and despite Amazon brushing the product aside because they sell readers, this is the best of the best. This time Amazon may not be the best place to but this product. Compition makes it underwhelming until you get to the reviews! Get one from Apple or wherever and you will not look back!", "Date": "January 19, 2013"}, {"Title": "You will love the mini iPad!", "Author": "bfaughender", "ReviewID": "R1ZRILX0QNO3LL", "Overall": "5.0", "Content": "It's everything I wanted it to be.  I have an older iPad and knew what to expect.  I just wanted the smaller size.", "Date": "January 19, 2013"}, {"Title": "Pad mini", "Author": "patricia guellar", "ReviewID": "R28JASTUFTD0MC", "Overall": "5.0", "Content": "Love it was very quick getting here and everything they said it would be daughter has a brand new toy", "Date": "January 18, 2013"}, {"Title": "Love it.....brought it for my grandson who is autistic...........HE LOVES IT.", "Author": "Evelyn Millan", "ReviewID": "R249IT4Y19A1IM", "Overall": "5.0", "Content": "Great teaching tool for children with learning disabilities.  I purchase the Ipad minnie as a backup for his Ipad 4....he likes the Ipad mini better.....who knew...lol.", "Date": "January 18, 2013"}, {"Title": "It was a BIG HIT with my friend!", "Author": "Lisa Crane", "ReviewID": "R2KYAFKL9U1DXL", "Overall": "5.0", "Content": "The iPad mini was a great hit with my friend when I gave it to him at CHristmas.  It works great and looks wonderful.", "Date": "January 17, 2013"}, {"Title": "Bought for a gift", "Author": "JaNele Hales", "ReviewID": "R1LYASS89XKQTT", "Overall": "5.0", "Content": "Love it !  Wish the font at the top and sides could be made bigger.  The main page can be enlarged, but he can't see the top bar and side bar very well.", "Date": "January 15, 2013"}, {"Title": "This product has all the function regular Ipad with reasonable price.", "Author": "Steven Youn", "ReviewID": "R2H0NY311E8NYN", "Overall": "4.0", "Content": "Speed is pretty good and unlike android technology,user friendly devise which I love it most.I will spread words to my friends.", "Date": "September 27, 2013"}, {"Title": "re: I-Pad", "Author": "JEROME EICKELSCHULTE", "ReviewID": "R1B2FFKDLINTWI", "Overall": "5.0", "Content": "I bought this for my girlfriend and she loves it. When the I-pad got here, she opened it up and started looking thru everything thing on it. she has a few books on it and really enjoys reading.Thank you very much from me and her.", "Date": "September 20, 2013"}, {"Title": "Mostly great", "Author": "Guy Bresler", "ReviewID": "ROWC3TT3OM9NG", "Overall": "4.0", "Content": "Other than not being able to work properly on files and manage files in an easy way - it really is great.", "Date": "September 17, 2013"}, {"Title": "excellent product", "Author": "Clayster", "ReviewID": "R1JRWWTZRM5ARS", "Overall": "5.0", "Content": "This is my first apple product and am quite impressed.  It's fast, light, thin, and connects easily to wifi.  Perfect size for the kindle app as well, works better than most e-readers for reading purposes.  The screen is actually much larger than the 7\" tablets with the standard aspect ration, and has a nice width to it.  The width to height ratio is more toward the width side of things than most tablets, which I strongly prefer and it means bigger text with news articles and less scrolling.  The resolution isn't great but it's fine because of the small screen.", "Date": "September 13, 2013"}, {"Title": "Apple product, quality product.", "Author": "Augusto", "ReviewID": "R250U6998TF2K", "Overall": "5.0", "Content": "I have read quite a lot about Apple's corporate philosophy, and I'm just happy to know that their spirit is perfectly reflected through their products. Keep the integrity Jobs guys! :)", "Date": "September 13, 2013"}, {"Title": "love it", "Author": "fabian morin", "ReviewID": "R13SA26DMJOHQF", "Overall": "5.0", "Content": "I had a Samsung galaxy tab 2 7.0 and loved it till it nolonger worked, so I bought Apple ipad... Love it.  It is the reason there are so many tabs out now, ipad is king for a reason.  Long live ipad", "Date": "September 6, 2013"}, {"Title": "My Latest Gadget, Apple iPad Mini MD533LL/A (64GB, Wi-Fi, White)", "Author": "Julia \"NewOrleansBelle\"", "ReviewID": "R1VDDXM8CNR0LC", "Overall": "5.0", "Content": "I have always been a fan of gadgets.  When I was growing up, there were few gadgets around to satisfy my gadget need; however, since I have reached my \"golden years\" there are gadgets galore.  My first electronic gadget I bought when was when I was in college - the second time.  A chemistry class was making my little ole numbers-handicapped brain spin.  Then along came the Texas Instruments calculator...WOW, it ran on batteries and figured out things for me.  I was in heaven and so began my love of electronic gadgets.  As a professional I had a plethora of electronic gadgets at my disposal (and I still did anesthesia with a calculator.)  The gadgets did get more complex, and expensive, as I got older and I do have a \"thing\" for laptop computers and have owned several...I prefer to surf in my lounge chair, with the computer in lap, my feet up, and a tv show in front of me as opposed to sitting at a desk, etc. Then I planned a trip to Europe this year.  I wanted to be able to communicate with the folks back home without having to tote my laptop, so what to do.  Well, BINGO...you got it.  I needed an iPad!  And where do I go to purchase all my best \"Good Gadgets\"???  To my laptop and Amazon of course!!!  Didn't take long before I located my sweet, little, cool, white, handy-dandy, baby who computes from my lounge chair and any place else with wi-fi...and she weighs much less than the laptop, even fits in my purse.  With Amazon in charge and freebie electronics actually providing the product for my purchase...WOW, what a deal.  Amazon's usually lightening fast, but I had my little, cool, shiny, new, white, baby in less than 2 days - all securely packed and ready to rumble.  And so we have continued to do sending messages/pictures home from Europe, playing games (which I never did before), and reading my fav magazines...SUCH A DEAL!  Give them a try!  Yall take my word for it...it's great!  They're great.", "Date": "August 24, 2013"}, {"Title": "Great Product", "Author": "TJV", "ReviewID": "R2517JF92F0NUP", "Overall": "4.0", "Content": "Very user friendly and easy to learn and operate. .  However my Apple Ipad Mini  does not take the place my Microsoft laptop.", "Date": "August 20, 2013"}, {"Title": "Great tool but I need 4g model", "Author": "Susan Wigley", "ReviewID": "R2GR7ATGIBJSAY", "Overall": "4.0", "Content": "It does everything you expect it to do. I should have bought a 4g model. Wifi in my house is pretty spotty. I am planning to get a booster, which may increase my use. However, I do not like it as an ereader. It hurts my eyes after a very short time. I have enjoyed a Kindle better for that purpose.", "Date": "August 18, 2013"}, {"Title": "Great", "Author": "Mr.Obiwan", "ReviewID": "R12VPI9S061YRU", "Overall": "5.0", "Content": "As i expected comes complete in a plastics wrapped box, with all his stuff in it, the iPad mini works immediately, arrive on time, and apple give us another quality product.", "Date": "August 17, 2013"}, {"Title": "My iPad Mini", "Author": "Lou Coop", "ReviewID": "R3JYAOX2OZVPEZ", "Overall": "4.0", "Content": "Easy to use and provide all the connection tools I need.  It allows more mobility without compromising info and ability to respond.  I love the convenient size.", "Date": "June 24, 2013"}, {"Title": "I love my iPad mini", "Author": "Jamie Powell", "ReviewID": "RJ025R1P5Z14M", "Overall": "5.0", "Content": "It was a great buy for the new year. Every Apple store had the mini on back order. I ordered a brand new one for just a few dollars more plus shipping.", "Date": "June 21, 2013"}, {"Title": "Great product just remember", "Author": "Sammie 62", "ReviewID": "R1BU7ZUTHWLCO8", "Overall": "5.0", "Content": "You will need to have the updated apple iTunes to Sinc this with your computer, if your MacBook is too old to update iTunes, you will need to go to an apple store to have them put in the latest iTunes. Don't get talked into buying a later apple operating system ( snow or lion ) the apple story can put in the needed updated iTunes for free.", "Date": "June 21, 2013"}, {"Title": "It's Great", "Author": "R. Oliver \"SunshineNole\"", "ReviewID": "R3D857J8JOJZXK", "Overall": "5.0", "Content": "I bought this after I purchased the Kindle Fire HD 8.9.  The Kindle is heavy (same as the regular iPad).  This is perfect - I was afraid that it would be smaller than I wanted, but it isn't and I find that I use it more often than my kindle.  I'm more familiar with the apps because I have an iPhone (didn't have to repurchase any, like with the Kindle).  I would recommend this to anyone.", "Date": "June 16, 2013"}, {"Title": "what i expected", "Author": "Sofia Aviles", "ReviewID": "R171E7QSDICEW6", "Overall": "5.0", "Content": "i give 5 stars because it's all i was expecting. A perfectly done apple product that works all the time (until now). I have always been an apple fan and i love the ipad mini", "Date": "June 7, 2013"}, {"Title": "Great product!", "Author": "Dirsky", "ReviewID": "R1I99CQ4CJN4XF", "Overall": "5.0", "Content": "I've had the Color Nook, Kindle Fire and Nexus, and while there were features on each of them I liked, the only one that came close to the ipad mini awas the Nexus, but the ipad mini is just faster, clearer and far easier to maneuver than all the others. For me, this was just the one! I love it", "Date": "June 4, 2013"}, {"Title": "Apple Ipad mini", "Author": "Janet", "ReviewID": "R1R1DVQYT2IZKT", "Overall": "4.0", "Content": "I love the portability but the battery doesn't seem to last as long as my kindle fire or my Ipad 2", "Date": "May 29, 2013"}, {"Title": "worked as expected", "Author": "SLeven", "ReviewID": "RCKBQ054YZ399", "Overall": "4.0", "Content": "these mini's are very stylish and slim also light weight it will get your jobs done with exceptions such as easy connectivity to other devices non apple and this world of technology this quality can make you non grata", "Date": "May 15, 2013"}, {"Title": "Apple iPad Mini", "Author": "Amazon Customer", "ReviewID": "R2PCGEA75JRZ0F", "Overall": "2.0", "Content": "Wi-Fi reception poor compared to my regular iPad.  Needed to be closer to router to be in Wi-Fi range.  Also found that Wi-Fi often got dropped and I had to reconnect.  Decided to return the iPad for this reason.", "Date": "May 15, 2013"}, {"Title": "LOVE IT", "Author": "Gaby", "ReviewID": "R2E2F45ARU4N7R", "Overall": "5.0", "Content": "LOVE IT EXCELLET GREAT JUST IN TIME. Great shirt no problems at all whit the product, thanks a lot friends.", "Date": "May 9, 2013"}, {"Title": "Apple Ipad mini", "Author": "cora liburd", "ReviewID": "R1K1BQAPQ5VK5K", "Overall": "4.0", "Content": "I bought this as a gift for someone and they absolutely love it. this was the second one I bought on amazon.", "Date": "March 11, 2014"}, {"Title": "Great as usual", "Author": "Karen W Beck", "ReviewID": "R1WH45TGXL55TR", "Overall": "5.0", "Content": "Bought for my husband. He really didn't want it but he read a book on mine and decided that it was pretty nice. So I got him one and he loves it. He is technically challenged so I am being patient with him.", "Date": "March 9, 2014"}, {"Title": "Great use, a bit small", "Author": "Johanna", "ReviewID": "RVMHGEYQ8BCPM", "Overall": "4.0", "Content": "We got the iPad mini instead of getting another Kindle. It is not as easy to read from as the Kindle; but the added features (like the use of Facetime and similar apps) were what sold us. I just wish we'd gotten the iPad Air since the screen is a bit small.", "Date": "March 7, 2014"}, {"Title": "As Advertised - Brand New", "Author": "Gabriel Negron", "ReviewID": "R21L94KKFGQG6Q", "Overall": "5.0", "Content": "I have been looking to buy an Apple iPad Mini for my wife.  I read reviews.  That said it is not brand new, it has been used, or it came damaged.  I want everyone to know that the product I received was brand new in an Apple Box sealed never open!  Also there is a bar code sticker on the plastic that also says new.  Went to set it up no problems at all.  This was my wife's Valentines Gift.  With two little ones ages 3 /12 and 1 years old.  She has no time to start the laptop log in.  Now she grabs her iPad and does her thing.  Great buy!", "Date": "February 26, 2014"}, {"Title": "So glad we decided on the Ipad mini", "Author": "Shauna Morris", "ReviewID": "R29306RBPIV9HE", "Overall": "5.0", "Content": "We homeschool our son and wanted to get a tablet that he can play his learning apps and games on, as well as watch videos, read books, etc..Something that will grow with him. I know it seems pricey for a child, but if you think about the cost of video game systems and the additional cost of the games for those systems, tablets are actually a great buy for kids. Most apps are under $5 each, and you get learning value along with the fun factor. Plus you can access the library and borrow books, and so much more.The mini is the perfect size for his small hands (he's 6 but the size of a 9 yr old). It's easy to use and the graphics are really nice. Mind you, I'm not a tech junky...but we have had it for over a month and it gets used a few hours each day and we have never had an issue. The charge lasts for a long time also.I recommend getting the Otterbox for it. Especially if a kid is going to be using it! I found the mini sized Otterbox for about $35 here on Amazon. Our only issue with this tablet is that now I want one too!", "Date": "February 26, 2014"}, {"Title": "Awesome!", "Author": "Kimberly Cole", "ReviewID": "R1165AC8TX7VQ7", "Overall": "5.0", "Content": "Works great I love it!! Very small and light. I take it everywhere I go!!!! (: Even my husband and kids love it!", "Date": "February 24, 2014"}, {"Title": "great new i pad", "Author": "Julie Hill", "ReviewID": "R1A9QTN3CK2M7F", "Overall": "5.0", "Content": "this is a a great, new ipad. my husband is pleased with it. i recommend this to anyone looking for an ipad mini", "Date": "February 23, 2014"}, {"Title": "Love my iPad mini", "Author": "kjw", "ReviewID": "R6YDH3XWADCRT", "Overall": "5.0", "Content": "Luv this!! Great product I brought another for husband so nice we got iPhones also what can I say we love apple products", "Date": "February 20, 2014"}, {"Title": "Solid Product", "Author": "Kamari Purcell", "ReviewID": "R2JIU0WV69W1XL", "Overall": "4.0", "Content": "It works extremely week and I am very happy with its performance. It is a good solid product and I am glad I purchased it.", "Date": "February 15, 2014"}, {"Title": "Amazing.", "Author": "PAM IN WILLIAMSTOWN", "ReviewID": "R2YB1KAF5NVBRM", "Overall": "5.0", "Content": "I ordered this from Amazon for my granddaughter.  It is amazing.  Next one will be for my spouse for his birthday and I know soon after that I will want one all for myself!", "Date": "February 14, 2014"}, {"Title": "Awesome!", "Author": "Kimberly Cole", "ReviewID": "R1165AC8TX7VQ7", "Overall": "5.0", "Content": "Works great I love it!! Very small and light. I take it everywhere I go!!!! (: Even my husband and kids love it!", "Date": "February 24, 2014"}, {"Title": "great new i pad", "Author": "Julie Hill", "ReviewID": "R1A9QTN3CK2M7F", "Overall": "5.0", "Content": "this is a a great, new ipad. my husband is pleased with it. i recommend this to anyone looking for an ipad mini", "Date": "February 23, 2014"}, {"Title": "Love my iPad mini", "Author": "kjw", "ReviewID": "R6YDH3XWADCRT", "Overall": "5.0", "Content": "Luv this!! Great product I brought another for husband so nice we got iPhones also what can I say we love apple products", "Date": "February 20, 2014"}, {"Title": "Solid Product", "Author": "Kamari Purcell", "ReviewID": "R2JIU0WV69W1XL", "Overall": "4.0", "Content": "It works extremely week and I am very happy with its performance. It is a good solid product and I am glad I purchased it.", "Date": "February 15, 2014"}, {"Title": "Amazing.", "Author": "PAM IN WILLIAMSTOWN", "ReviewID": "R2YB1KAF5NVBRM", "Overall": "5.0", "Content": "I ordered this from Amazon for my granddaughter.  It is amazing.  Next one will be for my spouse for his birthday and I know soon after that I will want one all for myself!", "Date": "February 14, 2014"}, {"Title": "Who would like an Ipad mini?", "Author": "vera1608", "ReviewID": "R25UFQIRNHCBKR", "Overall": "4.0", "Content": "Got this for my sister for Christmas and best believe she loves it! Sometimes I'll play on it since it's so convenient.", "Date": "February 14, 2014"}, {"Title": "great gift for my kindergartener", "Author": "W.R.N.W", "ReviewID": "R23P434OCCNGG4", "Overall": "5.0", "Content": "yes, that's right we got this for kindergartner and it was the best purchase we made in a long time. we use it for her spelling words, reading books, movies (on weekends) and she even download apps for her favorite games and magazines like highlights... love this is as a learning too and source of entertainment.", "Date": "February 12, 2014"}, {"Title": "Apple iPaD Mini", "Author": "Angel", "ReviewID": "R3LZAK3H45003F", "Overall": "4.0", "Content": "I had a bought a Kindle fire HD for christmas as a gift, but for some reason we were having problems with it. I replaced it with a Mini iPad, no problems and easier to manage.", "Date": "February 11, 2014"}, {"Title": "Excellent product, but needs more information on specific model", "Author": "David Church \"Sliverofhope\"", "ReviewID": "RLP07VD9U9VXE", "Overall": "4.0", "Content": "Great product, of course. It IS an Apple product after all. The seller's description was accurate and delivery was swift.Very happy overall.I had to knock off one star because of the confusion I went through trying to determine the generation model of the ipad before I made the purchase. I had wanted a 2nd gen, 32 gig, ipad mini. However, there was NO information as to whether the ipad listed was a first gen or second gen. Other than a brief comment in the questions area indicating that the seller didn't know.Turns out the ipad that was sent to me is a first gen. Not that it matters really. Right now, there isn't much difference between the two generations. But it would have been helpful to have that important bit of info available.Overall tho, it was a positive experience. I'd buy from the seller again happily.", "Date": "February 7, 2014"}, {"Title": "Think twice.", "Author": "Robert Dasher", "ReviewID": "RBC88WGCJXWYR", "Overall": "3.0", "Content": "Quality is 2nd to none. I have the original IPad, iPhone 5, Kindle Fire and truth be known I did not need the mini. The video and photo functions are great.", "Date": "January 30, 2014"}, {"Title": "My Rating", "Author": "Jerrie Cozart", "ReviewID": "R26B53SFAOH9TC", "Overall": "4.0", "Content": "I chose the iPad mini for its convenience. I do not own a lap top, so I had to go to the desk top to go online! I can now search the web and get my mail anywhere there is wifi!", "Date": "January 8, 2014"}, {"Title": "Excellent value still!", "Author": "Critty Cal", "ReviewID": "RRUG81OOF3ZMV", "Overall": "5.0", "Content": "After having gotten 2 iPad mini retinas, 1 had a pixel issue and the other was pretty flawless, but just incompatible with our Verizon network (sprint mini, useable but unrecognizable device on Verizon). The retina is super speed fast with a nice screen, but am more than perfectly happy with the cellular mini. Having 4g/Lte when I want it is pretty amazing. The speakers on the 1st gen mini are louder and I don't really notice a speed issue. Awesome device and still love it for the portability and the functionality. Screen is the right size for me.", "Date": "January 4, 2014"}, {"Title": "Great gift", "Author": "donna miller", "ReviewID": "R314VLPKME66IB", "Overall": "4.0", "Content": "I bought a mini for my 89 year old mother. She loves it. Very easy for her to handle because of the size.", "Date": "January 4, 2014"}, {"Title": "IPAD...SIMPLY THE BESTY", "Author": "Larry Cadiere \"Mr. Darcy\"", "ReviewID": "R32KTL2GHUO6UZ", "Overall": "5.0", "Content": "Purchased for daughter for Christmas and as expected..PERFECT!! Daughter had been using my Ipad so decided she needed her own and she has not been off of it since she opened for Christmas!!  Another Apple Winner.", "Date": "January 2, 2014"}, {"Title": "Why do you ask for credit information if i am not purchasing anything ?.", "Author": "Forough Farrokhyar", "ReviewID": "RZNJLUWBO46ZM", "Overall": "4.0", "Content": "It is a wonderful device but it is not distressing when it does not allow to install free Apps without asking for your credit information.", "Date": "January 2, 2014"}, {"Title": "Excellent product!!", "Author": "Hugo Martini", "ReviewID": "R1IXIAZ3U1JLLZ", "Overall": "5.0", "Content": "Very slim, light and useful device. Great definition and resolution. Portable, friendly and practical to carry on everywhere. Wi Fi provide me access at an entire net and useful info over the world!!", "Date": "January 2, 2014"}, {"Title": "Best tablet on earth", "Author": "jayson mitchell", "ReviewID": "R83JWTYQOOF2D", "Overall": "5.0", "Content": "Everyone should get one.these are not just a toy! iPads are very under used.you can do more than you can on laptop.i love it.i got this one for my wife just so she would leave mine alone, and I got a iPad 2.she was hooked the first time she used one.", "Date": "January 1, 2014"}, {"Title": "This ipad mini is a gift", "Author": "Maria A. B. Bittencourt", "ReviewID": "R27FHN0ZL8RLTB", "Overall": "5.0", "Content": "Since I am a big fan of Apple and have owned an iPad since it came out, I like to give it as a gift so that I introduce Apple and the creations of that genius that was Steve Jobs, to people that I really care. Another reason was that since I am visiting the U. S., products here are cheaper, besides the fact that Amazon is a most reliable company. Keep the wonderful job you do!", "Date": "December 31, 2013"}, {"Title": "Gift", "Author": "Linda E. Siebert", "ReviewID": "R3JSKHKZ1KXNX0", "Overall": "5.0", "Content": "A must have for children that live either abroad or in other states!!  FaceTime is great fun and a wonderful way to see each other and share.  The gift was for the whole family and I would recommend it to anyone.  There is nothing disappointing about it other then giving only one to a family of 4 can be cause for fighting with children!!", "Date": "December 31, 2013"}, {"Title": "Great Tablet", "Author": "Robert Fischer \"Alone At the Alter\"", "ReviewID": "R13C45EL0283NH", "Overall": "5.0", "Content": "Apple has the best tablets and this is another great one. Gave it to my wife for Christmas and she hasn't put it down. It fits the hand and it fits the budget.", "Date": "December 31, 2013"}, {"Title": "The dictation stinks", "Author": "Beverly Bentley", "ReviewID": "R39DHYZ5K4IAUV", "Overall": "3.0", "Content": "I bought this iPad primarily for the ease of use. But I found that the dictation portion of this iPad stinks! You cannot correct the vocabulary, It will repeat the same spelling over and over regardless of how many times you make corrections. Even if you speak slowly you will still get a lot of words incorrect. There's no backspace key… Only a back delete key. There is a time limit on how long you can actually speak. And the worst part of all you cannot see the words that you're speaking until after the dictation is off.Dictating this review I had to correct at least seven errors.", "Date": "December 28, 2013"}, {"Title": "Apple iPad  Mini Wifi + 4G Meets Needs and Size Concerns", "Author": "Hugh M", "ReviewID": "R1YMH8OBNHO01P", "Overall": "4.0", "Content": "Even those I have used this iPad Mini for a short time...I am seeingthe benefits of  getting the information I want along with a very usagesize.", "Date": "December 25, 2013"}, {"Title": "Awesome", "Author": "Michelle Znidarsic", "ReviewID": "R3NZRJ8EUXE63B", "Overall": "5.0", "Content": "Amazing!!  Steve Jobs knew what he was doing!  Died too young! Now I want to buy onee for the whole family!!", "Date": "December 24, 2013"}, {"Title": "GREATTTTTTTTTTTTTTTTTT", "Author": "Christina", "ReviewID": "R3D8986PUWTB1P", "Overall": "5.0", "Content": "Ordered this as a give away item for convention and it was perfect. This was a must have on all Christmas lists.", "Date": "December 18, 2013"}, {"Title": "works great", "Author": "emzee", "ReviewID": "RZ6TYDXIJY0ML", "Overall": "5.0", "Content": "Though it was refurbished, it has been working perfectly. I use it a lot for my job, and I love it. The size is way more functional than the bigger ones.", "Date": "December 16, 2013"}, {"Title": "Absolutely love it!!!", "Author": "Matt", "ReviewID": "R2531UJCUU3WAT", "Overall": "5.0", "Content": "It's perfect size makes it the perfect tablet for me and the uses I do with it, which is mainly internet surfing. Love it so much I might invest in another one soon lol", "Date": "December 12, 2013"}, {"Title": "Great for kids aside from the price", "Author": "Danielle Moore", "ReviewID": "R10YSF6X3IP0G2", "Overall": "5.0", "Content": "My husband and I are young parents, so we get out and about quite a lot on trips. We take lengthy road trips roughly once a month for fun (more frequently when the weather is nice). And we like to do take these lengthy trips with our three year old, whose patience for the third drive to Canada in one year is...not super good.Enter: iPad Mini, ultimate toddler entertainment device.My son started off as a wee little pudgeball using my iPad 2, and I noticed that he and the iPad had an unnatural connection. The predicable nature of iOS and sensitive touchscreen were easy for his baby brain to puzzle out with trial and error, and the many restriction options allowed me to lock him out of most things he shouldn't get into. He was better at using the thing than I was within weeks, and when that iPad met an untimely death on a concrete floor, we decided to get our son one of his own. The iPad Mini is a much smaller, sleeker device that fits chubbular fists quite easily - a perfect size for children.Armed with a suite of educational apps and Curious George episodes, our son and the iPad have now driven thousands of miles and visited several countries. The battery life lasts us most of a day without being plugged in (and that's with constant video playback). It has quieted innumerable tantrums while on the road in the middle of the Cascades and on the most hideously boring stretch of road known as I5 in southern California. I expect it will also survive our upcoming six hour flight quite nicely.On a less child-oriented level, the screen looks great and the slender device is a pleasure to behold. The white one looks a bit cheaper than the black one, in my opinion, but that's all rather subjective. The software is fast and responsive. The touchscreen is a delight.Note for parents who might want to grab one of these for their children: iOS7 now defaults to showing ALL videos you've ever bought in the video library, including those you haven't downloaded. You can turn this option off in the settings. If you don't want a frustrated child without WiFi trying to download your copy of Dredd 3D, you should really make sure to do that. :) Also, make sure to set the \"require password\" setting from \"15 minutes\" to \"immediately\" so that you don't end up buying a few extra seasons of Curious George. And make sure to turn off in-app purchases, too.Last thoughts: I wish the restrictions were somewhat more comprehensive. You can prevent kiddos from deleting apps, but not from deleting videos, and it's hard to bring Blue's Clues back in the middle of nowhere when he accidentally deletes the whole season. I also wish this tablet were a bit cheaper - it's an awfully expensive device to risk the child throwing it out a window. My son's been surprisingly responsible with his iPad so far, though. Whether the investment is worth it for your family probably depends on the child in question.", "Date": "December 12, 2013"}, {"Title": "ipad mini", "Author": "firefly2550 \"stacy\"", "ReviewID": "R17KBRBOBH259Q", "Overall": "5.0", "Content": "whats not to love about the ipad mini? i have several android tablets and i personally love how simple the ipad is to use and set up i am a video blogger on youtube so i use my ipad to record and upload my videos dont have many apps as i just got it ordered tons of cases and skins for it battery life with full brightness is def an issue when i pulled the lightning charger out for the first time it dropped to 97% is this normal or does my brand new ipad already have a glitch? havent tryed any games yet planning on downloading some soon thats my review for now will update as i use my ipad......", "Date": "December 11, 2013"}, {"Title": "christmas present", "Author": "gary ferrell", "ReviewID": "R2567AQR9E51XV", "Overall": "5.0", "Content": "christmas present for the mrs.she has been waiting this for awhile now,and dont even know that i got her one for christmas!lol", "Date": "December 10, 2013"}, {"Title": "Great Product", "Author": "Vanessa Pavlik", "ReviewID": "R2KKMO13LCUBTO", "Overall": "5.0", "Content": "I bought this product April 2013 for my husbands birthday. He has not had any problems at all with this product. The battery last a long time. It is light weight and easy to use. It arrived very quickly. I love Amazon !!", "Date": "November 24, 2013"}, {"Title": "Bought for 18mo y/o daughter", "Author": "Alexis DeSalvo", "ReviewID": "RFB7S6BHZFJNF", "Overall": "5.0", "Content": "This is the perfect tablet for our toddler. We are able to download learning APPs for her and its SO easy to use. Love the front facing camera option. Works like a gem.", "Date": "October 1, 2013"}, {"Title": "For My Grandson", "Author": "MizD", "ReviewID": "R1GYZPDSCG9GEI", "Overall": "5.0", "Content": "I purchased this for my 8 year old Grandson's birthday.  It came exactly as expected.  His words were \" I have the best Grandma ever!\"  And \" I am s-o-o-o lucky!  My son has said that the IPad is doing great and he is still so thrilled about it.  Thanks !", "Date": "September 24, 2013"}, {"Title": "Amazing stuff", "Author": "Elton Peres", "ReviewID": "ROW47H7RXVJX4", "Overall": "5.0", "Content": "Very easy to buy and was very fast to get in my house.Simple to use and amazing features ... I love it!!!", "Date": "September 22, 2013"}, {"Title": "Apple iPad Mini", "Author": "Deborah M.", "ReviewID": "R2WJL6SHWISGBU", "Overall": "5.0", "Content": "she use it for everything for school for work for setting up my business my daughter loves it its very helpful", "Date": "September 22, 2013"}, {"Title": "Best birthday gift", "Author": "Ximo Zhang", "ReviewID": "R1O1LQZG2EKSPE", "Overall": "5.0", "Content": "my mom said that's the best birthday gift ever!I'm also very happy--now she will not use my iphone for candy crush!", "Date": "September 17, 2013"}, {"Title": "CMG", "Author": "CMG", "ReviewID": "R5XXDKAW0Q1A6", "Overall": "5.0", "Content": "We bought this as a surprise for my daughter's birthday. The order was filled quickly and we are completely satisfied with the product!", "Date": "September 17, 2013"}, {"Title": "Love My I-Pad", "Author": "Margaret P. Johnson", "ReviewID": "RYKQAX2TUFDH4", "Overall": "5.0", "Content": "Always uses my computer often for many things.  Have found it so much easier to use I-Pad and carry it with me.", "Date": "September 8, 2013"}, {"Title": "Amazing!", "Author": "katie", "ReviewID": "R14LXM39JN2VHO", "Overall": "5.0", "Content": "Amazing! I was scared to order this type of product from an online source,  but I was  Not disappointed.  It was in perfect condition and I was incredibly pleased!", "Date": "September 6, 2013"}, {"Title": "great product", "Author": "Santiago \"Salvarez\"", "ReviewID": "ROW5Q0J5UTOH2", "Overall": "5.0", "Content": "It more that I expect.  Its a great help for my ebooks and for work out of the office or play in travels.", "Date": "September 6, 2013"}, {"Title": "Everything I hoped for", "Author": "ophelia528", "ReviewID": "RW6TDQ6CWTE0L", "Overall": "5.0", "Content": "I had an iPad 2 for work, but I had to return it when I went on maternity leave, so I thought the iPad Mini would be a good substitute. It's great - an excellent size and weight. I don't miss the larger iPad at all! I truly enjoy using it.", "Date": "September 1, 2013"}, {"Title": "Beware of third party sellers", "Author": "ROBERT M.", "ReviewID": "R1B3P9D1XTXUK6", "Overall": "1.0", "Content": "Beware of third party sellers. I received mine and  could tell it had been opened. Upon further review I found scratches on the screen. Someone definitely had this unit before me. Don't get me wrong, I'm not reviewing the product. the Ipad mini is awesome. I wouldn't buy any other tablet. Does everything I need it to and is super fast. Very simple to use. The best display layout out there.Just be careful of the seller. I would make sure they have a high rating and its an amazon prime item.", "Date": "May 4, 2014"}, {"Title": "beware of Todays Bite", "Author": "maria palacios", "ReviewID": "R1I4E5T5ZR6U8X", "Overall": "1.0", "Content": "bought an ipda mini on july 8, 2013 and yesterday  April 27, 2014, as the divice was dead I took it to Apple and found out it was not new, it was original sold at a target in california in january 2013 and it was out of warranty.Make sure you are aware that what you are buying is NOT covered by 12 month warranty nor it is really NEW.", "Date": "April 28, 2014"}, {"Title": "wonderful", "Author": "Julio", "ReviewID": "R2KR5CBO7IATOQ", "Overall": "5.0", "Content": "My wife love it, she take it every place she go. No live home with outer it. thank you this product.", "Date": "January 18, 2014"}, {"Title": "Nice tablet", "Author": "cruisegal61", "ReviewID": "R1YN8IN83O9R22", "Overall": "4.0", "Content": "I have both this tablet and the Kindle Fire HD 8.9 (32 G with 4 G A.T.&T.;)  Both are great tablets.  I bought the \"fire\" at the beginning of the year after comparing it and the mini.  The Amazon deal was too good to pass up.  The price was the final determining factor when I purchased my Fire HD 8.9 at the beginning of the year. I have had the mini for a few weeks now and I certainly enjoy it.  For one thing, it is easier to slip into my purse.  It is lighter and smaller than the \"fire\". The podcasts I enjoy are not available with the \"fire\", but I could listen to them on my iPhone 5.  BUT, I must say, overall, I like my Fire HD 8.9 best.  If I were to purchase a tablet today (and could only have one tablet) my choice would be the new Fire HDX 7 inch.  I also would consider the 16G. With cloud storage, it is possible to get along with the 16G.  However, the price difference for the 16G and 32G is certainly more reasonable with the Fire than the iPad. Dollar for dollar Amazon has knocked this one out of the ball park.  The price point is affordable and the tablet is great!!!!  So, watch out Apple, Amazon's Fire HD series is a real competitive contender and certainly more reasonably price.", "Date": "December 27, 2013"}, {"Title": "seller didn't include sim card", "Author": "Hummer", "ReviewID": "R1FHUIVOK2NBNB", "Overall": "2.0", "Content": "Great product but the seller did not include the ATT sim card.This is a big deal when you pay for an ipad with AT&T; service.Amazon is working on the problem for me, will update on results.", "Date": "December 25, 2013"}, {"Title": "Well made, comfortable, but heavy", "Author": "Lawrence P. Stapp \"tacoma200\"", "ReviewID": "R3REW1O6A6OKGA", "Overall": "4.0", "Content": "Very well made, makes the mini much easier to hold on to.  It does add some considerable weight but that's the price for protection.  Very nice feel and grip.", "Date": "November 28, 2013"}, {"Title": "Apple mini", "Author": "fenelle", "ReviewID": "R2YBJQ56Q1VXEO", "Overall": "4.0", "Content": "The product works great I enjoy using it for my business and personal use. It is an asset to what I'm trying to accomplish", "Date": "September 9, 2013"}, {"Title": "Kelley", "Author": "Kelley", "ReviewID": "RBKPW126IN3B0", "Overall": "4.0", "Content": "My daughter loves her IPad mini.  She text me all the time and I didn't have to get involved with buying her a phone!", "Date": "July 23, 2013"}, {"Title": "what's not to love?", "Author": "Lorraine in Taos", "ReviewID": "R2TT1ZUAX2T849", "Overall": "5.0", "Content": "Received my Apple iPad Mini late last week. The learning curve, even for someone who is not a computer nerd, turned out to be fairly short. There are some features still to learn but I'm now up and running quite happily (even wrote a blog post). I added a case and peripherals since I'm an avid photographer and also a writer who wants to be able to use the mini for editing and writing while traveling or cafe-ing. I purchased the Logitech Ultrathin keyboard and the UXWrite app (uses Word and Dropbox to work between computer and iPad). Also, for photo downloading: Apple Lightening readers for memory cards and camera direct. If you only take pics with your iPad or iPhone you don't need this. Since the nearest Apple store is 280 miles round trip I researched and ordered everything through Amazon and it was all efficient and quick. And, oh yes, it fits in a medium-sized handbag!", "Date": "May 20, 2013"}, {"Title": "entrega e manuseio dos produtos", "Author": "edmilson fonseca", "ReviewID": "R35WCXM7XXSDY8", "Overall": "5.0", "Content": "os produtos foram entregues no prazo e chegaram muito bem armazenados.quanto ao site ta de parabéns pela organização dos produtos e facilidade de rastrearo andamento da entrega..", "Date": "March 23, 2013"}, {"Title": "Caro", "Author": "Lavivi", "ReviewID": "R2NZ9H12ML5EQ6", "Overall": "5.0", "Content": "Comes in handy n it's really helpfull and fun for the kids and road trips in the car where ever u go.", "Date": "November 24, 2012"}, {"Title": "The flimsiest smart device I've ever owned.", "Author": "Fey", "ReviewID": "R1ER3C04YCFJO", "Overall": "1.0", "Content": "I told myself I'd never buy an apple, but my school had a sale on this model and I was in some need of a tablet for school, so I grabbed one of these.  Cut to two weeks later, I'm eating with a group of friends and pass an empty cup over the iPad, in its case, and it falls the three inches down to the device. An empty, plastic cup. Three inches. And the glass around the button shatters like satan himself hit it with a hammer. I will never purchase an apple product again.  The cost of screen replacement is literally half of what I spent buying this damn thing.Idevices shatter more easily than a child's dream of being a princess.Definitely sticking with android permanently now.", "Date": "February 4, 2014"}, {"Title": "Great product but have found one pretty big downfall", "Author": "jason", "ReviewID": "R1GG95TKRDB6L1", "Overall": "2.0", "Content": "First, I want to say that I only rated this at 2 stars due to the following... operation wise it worked well; we love the size and convenience, etc.This was/is our first IPad. And every other owner of an Iphone, IPod, Iwhatever... is aware that the glass/screen/digitizer can shatter pretty easily. I changed the digitizer on my 2nd Gen Ipod before and it was a breeze, so that's not a big deal or a big cost ($9 for the IPod touch) digitizer).Shortly after getting our IPad Mini the screen somehow cracked/shattered!!!! We have no idea how it happened and were of course irate. Knowing that the 'basic' warranty wouldn't cover such a repair, I look at how much the screen/digitizer costs (60-179 btw). I found one for around 60. The removal went ok...minus some added difficulty due to the shattered glass. BUT HERE's THE PROBLEM.The Home Button does not come with the digitizer and MUST be transferred to the new one if/when it has to be replaced!  The issue here is that this REQUIRES SOLDERING!!!! Search for it if you'd like: Ipad Mini Home button soldering.  Here's where it gets real bad/funny: all of the videos that I viewed never mention needing to replace the home button; they just show how to take it apart, and put it back together so I didn't think anything of it at until I reached that stage (too late!) So no I have to either find someone local who knows how to do this (no luck so far due to it being pretty new (and super difficult) or send it off and spend some $$$. Here's the best part.... the part that you have to solder the new digitizer to (a circuit) ISNT EVEN AVAILABLE TO PURCHASE SEPARATELY!!! So if anything happens to the super delicate wiring in the removal process, YOU CANT EVEN FIX IT!!!!!!!!!!What confuses me the most is that the ease of which their glass screens break is no secret and is not difficult to have happen.... SO WHY WOULD THEY MAKE IT SOOO DIFFICULT TO FIX ONE OF THE MOST COMMON PROBLEMS!?!?!So, if you have or get an IPad Mini and experience any issue dealing with the Home Button (not responsive, intermittent, stuck, etc.) or the digitizer/glass screen (not responsive, scratch, cracked, or shattered.... all which are fairly common... I wouldn't suggest doing this on your own and be prepared to open the wallet. Most online services offering to replace the digitizer are around $125.I hope that, maybe in the next generation, this is fixed/addressed. For something soo common, this needs to be a plug in solution...not having to find a specialist to solder it back together. My suggestion would be to 1) get a very durable/strong case (otterbox?) and 2) DONT USE THE IPAD UNTIL ITS IN THE CASE!!  ((our case was in the mail heading towards us...))", "Date": "January 21, 2013"}, {"Title": "Terrible", "Author": "Kevin Connelly", "ReviewID": "R35KGA5F4IU0ZK", "Overall": "1.0", "Content": "Got this on time which was ok but i received it with scratches on the screen and there was no charger, earbuds or anything else with it but the iPad and that was received in a damaged box. When i opened up the iPad it had a huge crack and it didn't work at all so i bought a brand new iPad. Also i couldn't ship it back", "Date": "July 12, 2013"}, {"Title": "It is a terrible product.", "Author": "Marissa", "ReviewID": "R3OWZZ0A77WKDC", "Overall": "1.0", "Content": "The earphones and carjack didn't even work, and the case is cheap. I am never ever buying this product again", "Date": "January 7, 2014"}, {"Title": "damaged ipad mini", "Author": "raul humberto rondon peñalver", "ReviewID": "R1DJQ2SU2H9MBE", "Overall": "1.0", "Content": "ipad mini will not start, I had to take at the technical service does not start because the battery,  they cheated me , everything you sell is a scam, now I have no ipad  thieve", "Date": "February 7, 2014"}, {"Title": "Is not cellular", "Author": "Alma Zabala \"HZ\"", "ReviewID": "RHQA3T7LDBH7R", "Overall": "2.0", "Content": "I am not an ipad mini expert and for bouth this one for my husband, I didnt know the difference, Thank God the seller was kind enough to take it back. I need to get the other one instead", "Date": "January 3, 2014"}, {"Title": "Great product.", "Author": "john", "ReviewID": "R34V0U2VNFC8X3", "Overall": "5.0", "Content": "I wonder if the screen is now not glass, but a thin plastic film how that will hurt Corning glass?Will this thin plastic film be used on new TV sets?A company called research frontiers controls the rights to controlling the effect on light passing through the plastic film and should benefit from this change .Refr is on the Nasdaq if you are interested. I own options on2'500 shares, and should be considered a person with a profit motive.", "Date": "September 23, 2013"}, {"Title": "Great", "Author": "francisco", "ReviewID": "R3JFODXB6LR21A", "Overall": "5.0", "Content": "It lasted just the time the company specify it will last to come. Apple isapple so theprodct should not me rated", "Date": "August 27, 2013"}, {"Title": "close but its ok", "Author": "Michael S Hedaitulla", "ReviewID": "R2LMAEZX15IIY3", "Overall": "4.0", "Content": "i ordered a black one and recieved a white one, but its cool, not really a big problem (filter guidelines)", "Date": "July 23, 2013"}, {"Title": "Great product.", "Author": "john", "ReviewID": "R34V0U2VNFC8X3", "Overall": "5.0", "Content": "I wonder if the screen is now not glass, but a thin plastic film how that will hurt Corning glass?Will this thin plastic film be used on new TV sets?A company called research frontiers controls the rights to controlling the effect on light passing through the plastic film and should benefit from this change .Refr is on the Nasdaq if you are interested. I own options on2'500 shares, and should be considered a person with a profit motive.", "Date": "September 23, 2013"}, {"Title": "Great", "Author": "francisco", "ReviewID": "R3JFODXB6LR21A", "Overall": "5.0", "Content": "It lasted just the time the company specify it will last to come. Apple isapple so theprodct should not me rated", "Date": "August 27, 2013"}, {"Title": "close but its ok", "Author": "Michael S Hedaitulla", "ReviewID": "R2LMAEZX15IIY3", "Overall": "4.0", "Content": "i ordered a black one and recieved a white one, but its cool, not really a big problem (filter guidelines)", "Date": "July 23, 2013"}, {"Title": "Apple Ipad Mini", "Author": "Bryan D", "ReviewID": "R2KQQUBFKFD3QL", "Overall": "5.0", "Content": "This has got to be Apple's greatest product yet. Not only does it shield me from the fiery breaths of Medieval dragons but it also allows me to time travel. It also has a pop out toaster and waffle maker. Keep in mind that you have to have your own bread and waffle mix because Apple likes to give you one part but charges you an arm and a leg for the other part.  The only complaint I have it that it doesn't come with proprietary arms to do my dishes and give me back rubs.", "Date": "July 1, 2013"}, {"Title": "BEST SELLER I have ever dealt with (even offered extended return).", "Author": "Tammy Weber", "ReviewID": "R2D4IVFHDPD2TC", "Overall": "5.0", "Content": "Best seller I have ever dealt with.  He extended the return for this iPad mini, because I was giving it for a gift.  Very honest and great communication.  The product was just as described and the shipping was super fast.  Excellent seller.", "Date": "June 21, 2013"}, {"Title": "pretty good except for the easily scratched screen and paint job", "Author": "KINGBEE \"kingbee8404\"", "ReviewID": "RSKFCNCPTZUU1", "Overall": "2.0", "Content": "I love the form factor but I have to say that I'm very disappointed with the durability of the device. Both my screen and back are scratched after dropping my device by accident. I should be happy I didn't get a spider web on my screen but they say the glass is gorilla glass so why is the glass easily scratched? i've dropped my nexus 7 more times than I could count and I have had no scratches on the front and back.I expected durability knowing it's an apple product.", "Date": "January 30, 2013"}, {"Title": "Love it", "Author": "lourdes medellin", "ReviewID": "R2A13B188WM7R1", "Overall": "5.0", "Content": "Esta perfecto, el tamaño, la camara, lo puedo transportar facil, me gusto mucho, las aplicaciones pues ya saben geniales, comprenlo", "Date": "January 17, 2013"}, {"Title": "IPAd Mini", "Author": "Sylvia Herron", "ReviewID": "R10GLFNEA97550", "Overall": "1.0", "Content": "Do not order anything from BMG Logic.  I ordered a NEW Ipad Mini and got a USED one with finger prints and a scratch on the screen.  The back of the IPAD was dirty from finger prints and the package was not sealed in a new box.  Not even the USB cord was wrapped right.If I wanted used I would have ordered used.  I ordered new and paid the price of new.Very disapponted customer.  I am trying to return this item and will get one somewhere else.", "Date": "July 29, 2013"}, {"Title": "Will crack if you look at it.", "Author": "Homero Castellanos \"homero5\"", "ReviewID": "R1TEU5ADRSRCF", "Overall": "1.0", "Content": "The ipad mini isn't really a bad tablet. It does what it's supposed to. No flash but whatever. My qualm is how freaking fragile this thing is. I dropped mine literally a foot of the ground. Cracked on the right corner. Hey apple do ya ever test out your products. Do you think now one is going to drop your swarovski glass? Get a kindle fire for a cheaper price. Pretty much get any tablet other than this. I shouldn't have a $300 portable piece of equipment crack from a one foot fall. This isn't a laptop where you put it on the table. You keep this in your hands. No gracias APPLE!", "Date": "September 9, 2013"}, {"Title": "poor customer service I would not recommend the company to anyone", "Author": "nigel walker", "ReviewID": "RJ4F6GU7J8C7S", "Overall": "1.0", "Content": "I ordered this I pad whilst on hoiday in California. I was staying with friends. I ordered it for them as a thank you. The item had a guaranteed 2 days delivery, whichy was important as I was onyl staying with them for two weeks. After 3 days I started to check the delivery and it stated being despatched. After five days I e-mailed and found that the item had gone out of stock and I hadnt been informed. I have now subsequently returned to the Uk, unable to buy my hosts the I pad I had promised themVery poor service and no update to let me know the item was out of stock....baring in mind I had a 2 day guaranteed delivery", "Date": "May 21, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0096V4PPK"}}