{"Reviews": [{"Author": "Kyle Brotherton", "ReviewID": "R31DUNZA4I10LI", "Overall": "3.0", "Content": "This is my first tablet, and I love it! I bought it largely to stream movies with Netflix (subscription required). Thanks to this tablet, I've also discovered free ebooks and magazines from my local library. I love reading my local newspaper in the free Overdrive app (newspaper subscription required). Checking email, weather reports, and my Hotmail calendar is quick and easy. I'm glad I got a 10\" tablet because magazines, movies, and games can really take advantage of the extra large screen.Over all, I think this tablet is a great value. I would buy it again, and I highly recommend it. Keep in mind that installing a bunch of apps and customizing the tablet may require some extra know-how plus hours (and hours) of your time. I also recommend that you purchase an inexpensive tablet stand (there are several types available on Amazon).I'm probably going to also buy a Kindle e-reader. The e-ink screens are easier on the eyes; and dedicated e-readers are much easier to hold when you're reading a book for several hours.What I like:> Large, beautiful screen> Excellent touch response> Easy to use settings> Convenient buttons for power, volume, and \"back\"> Expandable storage via MicroSD slot> USB connection> Wifi was easy to set up and connect to my home network> Great built-in email client> Great battery life with most apps (several hours)What I dislike:> Cannot access Google Play (a.k.a. Android app store)> Front-facing camera is almost worthless. No flash, can't easily scan QR codes, doesn't work well with Skype app> Built-in speakers are not very loud. You may need to use headphones or an external speaker> Heavy and difficult to hold for long periods of time (like reading a book)> Web pages take a while to load. It's often faster to just turn on my laptop when looking something up> Cannot mount a network drive (or at least I can't figure out how to), although you CAN browse network drives using the included ES File Explorer app> Battery life is too short for reading lots of books (typical problem with color LCD tablets)> No back-facing camera> It takes a while to charge (I feel like it takes several hours, but I haven't timed it)What I use it for:*Note: Some of these apps were hard to find and/or install because this tablet cannot access the Google Play app store.> Watch movies with Netflix app - Netflix subscription required> Listen to music with Pandora app> Read local newspaper with PressReader app - newspaper subscription required> Read ebooks and magazines - borrowed from local library via website (free) - using Overdrive app and Kindle app for ebooks - Zinio app for magazines> Check my Hotmail calendar> Check the weather with Weather.com app (free)> Check email> Check my budget with YNAB app (requires YNAB desktop software)> Surf the web with Firefox app (free)Where I get my apps:> Amazon app store (lots of great free and paid apps)> Aptoide app store (some apps, hit or miss)> papktop.com (some apps, hit or miss)> Getjar (a few apps)> Bing search for the app's \"apk\" file, then transfer the apk file to tablet and install it> Other random app websites (often difficult to use, some may not be entirely legal)Update: I have been using this tablet for a few months. My rating has dropped to a \"3\". Netflix works alright, and so do email apps, magazine apps, weather app, Pandora, etc. Skype doesn't work at all. Web browsing is PAINFULLY slow, and pretty much pointless. Apps freeze all the time. The tablet can't even run the keyboard app smoothly. But the worst part is WiFi. It often loses the wireless connection when I take it more than 40 feet from my router. That is unacceptable. I'm going to sell it and buy a better tablet. Sometimes a good deal just isn't good after all.", "Title": "Great Entry-level Tablet!", "Date": "December 29, 2012"}, {"Author": "Sherri L. Palmer", "ReviewID": "R1K2PKW3W03RIU", "Overall": "1.0", "Content": "I tracked this down, Coby went out of business and bought out by another company. In under 6 months of buying the tablet, it is unusable as the screen shows so much static you can't see what is being displayed.  I tried to get technical support from Coby, but when all emails were returned and the tech support line points to the website for answers, which there are none on the website.. i dug more, and found that the Better Business Bureau has a horrible rating for them, and with more digging I found they were bought out around Aug 2013.  I tracked down the new company and they claim no warranty or support on the previous companies products, Coby.  So this was a complete waste of money and the machine is useless.", "Title": "Coby no longer in business, left with no technical support for any products", "Date": "November 14, 2013"}, {"Author": "Donna", "ReviewID": "R3IAHH3HU0NWU9", "Overall": "1.0", "Content": "I ordered this as a Christmas gift for my mother.  It does not have google play but it was OK for her needs.  She liked it up until a week ago when it just stopped working and would not turn on.  I have tried to reach Coby several times but they do not return emails.  When you call their number listed in the manuel and on their website,  you get a recording instructing you to go to their website and then it hangs up on you.  Please beware,  I googled \"coby complaints\" and everyone listed the exact complaint that I have described here.", "Title": "Don't waste your money", "Date": "September 23, 2013"}, {"Author": "Sara Fabry", "ReviewID": "R2Y8JGAMMPWFXT", "Overall": "2.0", "Content": "the tablet is OK.  the screen responsiveness is not that great. not supporting google play is kind of a pain but maybe not a deal-breaker. however, it seems that the company is more an issue than the actual tablet. i purchased this in april and after about 2wks of regular use it turned itself off and would not charge.  i was able to reset the tablet and did not loose any data. but about 2 months after that the screen turned white and the tablet stopped working.  i contacted customer service and was sent instructions via email.  now 8 weeks later customer service does not respond to methods listed on website (email) automated or otherwise and phone numbers are not answered with in listed business hours (the main customer service number instructs you to go to the website 3 times and hangs up on you). product was returned within warranty requirements and according to emailed instructions. however, it states that the product can be expected to be returned around 6-8 wks after the product reaches savannah, ga. however the product never was delivered through or to Georgia. it has now been 8 wks and I am unable to get a response from the company - phone or email.  i have now made a formal complaint through the BBB.  unfortunately a quick search turns up many other people that have had this problem.  spend the extra $50 or so and get something reputable and reliable.", "Title": "spend the extra $50", "Date": "August 28, 2013"}, {"Author": "Calvin Lee Burke \"Calvin Lee Burke\"", "ReviewID": "R1NBSIPZONI4NM", "Overall": "1.0", "Content": "SUBJECT: COBY PRODUCTS, SUPPORT AND RETURNS...READ THIS and DO NOT BUY ANY COBY PRODUCT, EVER.UPDATE: It is August 1, 2013. This is almost 90 days since my return for exchange. Now they route all calls to a website. More stalling and stealing. Called again, today, 1 August. NO MORE CS call center! No answer at ANY number. No box for messages. No one. THIS IS A RIP-OFF.---------------------------------Read what has happened to me on a standard product return and ask yourself if you need this low-grade music products (purchased on Amazon) causing you the same incredible hassle. They have never e-mailed or called me about any aspect of my return or replacement.Overview: Since May 5th, 2013 when I returned a Coby product they have given me the most BS runaround ever. Not only do their Chinese slave-produced products breakdown easily, but just try to return them!!!Here is what has happened to me since May 5th.(Below this timeline is the letter I sent with the $6.00, Amazon receipt and the product to Coby. Here is the BS this POS company has done to me since.)Sent Letter May 5th. Timeline that followed:Called Coby -- two numbers 877-302-2629 and 912-966-2629 that are both stonewalls. Then FINALLY got CS (customer service - a call center not connected with corporate, or factory or return warehouse)1) Called a week after mailing to ask if they got the return. They had to move. Will take a month to move out to California so the boats from China can deliver these products and they can make more money than from Knowlton, Georgia with reduced shipping. Call back in a month.2) Called one month later they have to close for inventory of new factory. Call back in two weeks. They also said the replacement of the item will be delayed because of shipping from CAL to FL.3) Called two weeks later. The person in charge of reading the CS requests about my status is now on vacation. They don't know exactly when she will be back. Call next week.4) Called next week and the women who processes the requests is nowhere to be found. Call back. \"They are really trying to help.\"5) Called last week to check status and they tell me the product is on back order since October!!5) Called yesterday to see if any progress put in three request to upgrade. I told them I didn't care if the color is pink about now. They said \"they are doing all they can.\"6) At about the 10 week mark, today, I called and was told I was  suppose to call corporate:516-775-8880 and talk to someone named Mike at x113.Not valid.Or call Kate.Not valid.Dialed O for operator.No operator.Told to dial O to leave message.Mailbox full.7)Then I was suppose to call corporate at this number: 912-966-2629 and talk to the same Mike at x113.No answer at 113.Dialed O.No operator.8) Called CS back and they told me \"they were doing all they can.\"9) Called today, 1 August. NO MORE CS call center! No answer at ANY number. No box for messages. No one. THIS IS A RIP-OFF.Now I am going to do all I can:DO NOT BUY ANY COBY PRODUCT, EVER. INVESTIGATE the bastards.In addition, I have already filed complaints wit the Sate of Fl, Division of Consumer Services, and the BBB of Cal and FL.--------------------------------------------HERE IS MY ORIGINAL RETURN LETTER5 May, 2013Coby Electronics CorporationTechnical Support150 Knowlton WaySavannah, GA 31407912-966-2629RE: Return of Model# 620-8GBRed MP3 Player for Replacement.Coby TS:I have owned two Coby MP3 Players. My current is the 620 8GRED and while I enjoy it and it seems to come on, the head sets ALWAYS start distorting or just don't make contact.They just do not seed properly and I usually never get anything, let alone clear sound.I deleted all the personal music and stuff so it is empty.I have tried multiple brands of headsets and plugs (especially Coby) and it his cost me more than the players!! None of them work.Both players still don't work. I threw the 601 into the Atlantic out of frustration and bought the 620. Now it is doing  the same thing. I have to adjust and adjust and it still distorts at the plug-in no matter if it straight or L-shaped Plug.Coby CS told me to send this, my address/phone below, my Amazon receipt (6 months old), the player Coby model#620 8GBRed, and a $6.00 M.O. addressed to Coby.Sincerely,Sxxxxx RxxxxxXxxxxxxxxxxxxXxxxxxxxxxxxxXxxxx3xx xxx xxxx", "Title": "COBY PRODUCTS, SUPPORT AND RETURNS...READ THIS and DO NOT BUY ANY COBY PRODUCT, EVER.", "Date": "August 1, 2013"}, {"Author": "Joseph R. Moore", "ReviewID": "R3T05CRWO8MQXP", "Overall": "4.0", "Content": "Google play is the best app store. Unfortunately the coby system does not accept it.  This would insure a fifth star. Other than that I love my tablet and would recmend it", "Title": "If only it came with google play.", "Date": "June 5, 2013"}, {"Author": "An Avid Reader", "ReviewID": "R3HFI2392O188T", "Overall": "5.0", "Content": "I was looking for a cheap tablet that I can use to study, read books, and take everywhere easily.  I read the other reviews before purchasing this tablet, and I noticed that everyone's complaint was the lack of apps on the tablet.  I rooted my tablet, installed ClockworkMod, a rom with Google Apps included, and after resetting the permissions, I was all set.  took less than 10 mins.  I have app the apps I want installed!!  The tablet itself is not heavy, responds to touch well, and has a great screen.  I would google rooting your Android device before purchasing this table to get full functionality.  It's no point if it's not rooted!", "Title": "This is a great tablet for the price!", "Date": "April 17, 2013"}, {"Author": "Scablo", "ReviewID": "R2AKCEKRO9TBMC", "Overall": "4.0", "Content": "Not a top of the line tablet, but a good starter tablet for my kids.  Display screen is crisp and clear.  Easy enough to use that my little one figured it all out fairly quickly even after only a little instruction.  Would like to give it 5-stars, but it does not work with Google Play and that is a pain. Their version of Google Play is available, but it just is lacking in the available apps so often the kids are upset.  A way around it is Amazon so you can try that, only need an Amazon account.", "Title": "Good for the Cost", "Date": "March 25, 2013"}, {"Author": "Tim", "ReviewID": "R1MPGU69R23RBB", "Overall": "5.0", "Content": "I like it because:It is surprisingly fast,it is VERY lightweight (being an 8\" tablet it is MUCH lighter in weight than a 7\"-SamsungTab2),it is THINNER THAN 7\"SamsungTab2,it has a good wifi connection,it has a good battery life,it has a good vivid screen,it is a multi touch device (five fingers :)and, oh yeah, it is not expensive :)The only downsides are:1) no bluetooth (but it's ok for the price)2) camera is not 5 MP (but once again it's ok for the price)3) no access to the Google market (but it is not a problem for an experienced Android user, even without any rooting)", "Title": "Fast, lightweight, thin, has wifi, good battery life but no bluetooth", "Date": "March 25, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3HZ1EG90VW1T4", "Overall": "5.0", "Content": "This is my first tablet so I can claim no real expertise.  The Coby Kryos MID7048-4 did however meet all my expectations.  My main reason for purchasing this tablet was in order to read E-Books.  I installed Kindle for Android and all works great.  I wasn’t sure that I would like reading on a tablet but soon found that I actually prefer it to paper books, not to mention the convenience of not having books stacked all over the place.  Amazon has tons of books available and if you have an Amazon Prime account many are free and many more are very inexpensive.  Browsing the net is expectedly not as convenient as on a full sized computer, but it is certainly a reasonable option when needed.  The screen resolution is quite good though I know more expensive tablets have higher resolutions.  There are tons of applications available from Amazon and the many other Android App. Stores. I have a 32gb Micro SD card installed which works great.  I also purchased a OTG (On The Go - Male Micro USB to Female Standard USB) cable and have accessed both 16 and 32gb USB flash drives. I have had a little trouble reading the flash drives a couple of times but suspect that it is more the cable than the tablet that is at fault.  I have ordered another, hopefully better, cable.  The touch screen works well with the exception of some difference in where you touch the screen and where it registers on the screen.  This seems to be mostly around the edges of the screen.  Once I turned on the option (in the system settings) that shows a blue dot where your touch is registering I soon learned how to compensate. There have been some minor glitches here and there, but nothing that was more than a minor issue and certainly nothing more than one might expect from ANY computer.I had intended to purchase a keyboard case for the tablet but decided that the screen keyboard worked well enough so as not to need one.  I did purchase a basic case made by Poetic. The first one did not fit properly even though it was said to be for the MID7048-4 as it covered up part of the RH side of the screen.  I returned it and ordered another case also made by Poetic which did fit well and which I am quite happy with.  That case is an ASIN: B00ANGOIR2 (product number).  If you are interested in a case do an Amazon search for B00ANGOIR2 and it should bring it up.  It did at the date of this review.One more thing, do not step on the tablet.  Mine slipped off of the bed and I did not realize it until the crunch.  LOL  Ok, so I didn’t laugh at the time, but I did order another Coby MID7048-4.to replace the unfortunate one.", "Title": "For the price", "Date": "February 23, 2013"}, {"Author": "S. Austin", "ReviewID": "R1ZC5XQAHWTEWX", "Overall": "4.0", "Content": "I bought this tablet as a Christmas present for my tech-savvy six-year old nephew. He has dominated his Mom's IPad so I though it was time for him to get his own and the price was right. I opened it before giving it to him to set it up with games and educational software. Although the reviews for this tablet are mixed, it really depends on what you want to do with the tablet and how much you want to spend. The display is just okay with a resolution of 800x600 and it's a little dim for me. It has a front-facing 0.3 mega-pixel camera - okay for a child. The tablet runs Android 4.0, has 1Gb RAM and a 1GHz processor. It weights 24 ounces, has an HDMI port, a micro SD card slot for up to 32GB of storage and a built-in microphone and speaker. The speaker was just okay and I didn't test the microphone. You don't have access to Google Play but can download apps from Amazon (after you install the Amazon app package) and also some free apps are included in the GetJar app that is installed. The battery charges pretty quickly and WiFi works fine (we didn't see the problems that others noted.)  At a price of less of $120, this is good first table for children and even some adults. I own both an IPad and a Samsung Galaxy tablet primarily for software development purposes but I found this tablet okay for my nephew as a start.", "Title": "Nice little tablet", "Date": "December 30, 2012"}, {"Author": "CLS", "ReviewID": "R3W5AZY2C0TLZN", "Overall": "1.0", "Content": "It is limited in application. It cannot sync with google apps and therefore a callender account cannot be set and google apps cannot be downloaded. As a result you cannot set appointments and events.  It has only a front loading camera. This makes video recording akward. The pluses are the ereader, the games from getjar which the kids love and the skype app. Apart from these I would not recommend buying it.", "Title": "Coby Kyros 7 inch Android Disappointment", "Date": "February 11, 2013"}, {"Author": "Dena L. Headley \"DNA\"", "ReviewID": "RFPVZQL481802", "Overall": "2.0", "Content": "NOT REALLY HAPPY WITH THIS PRODUCT BECAUSE IT DOES NOT HAVE THE GOOGLE PLAY STOREINSTALLED ON IT OR I CANT FIND IT SO I CANT GET APPS FOR THE ANDROID", "Title": "NO GOOGLE PLAY STORE APP", "Date": "February 6, 2013"}, {"Author": "Mayra Mendoza", "ReviewID": "R2A5HVIXHBD18C", "Overall": "2.0", "Content": "After having bought this tablet, I am wishing I hadn't. I wish I had saved up the extra few hundred dollars (maybe less) and purchased a better quality tablet. It's good if you need a tablet for practicality. I am used to the Apple Store and Google Play, having owned both an iphone and an android. So, seeing only \"GetJar\" did not seem that bad. However, the app selection is wanting. I didn't think not having access to that many applications would bother me that much, but it's limiting. I can't even download my beloved Firefox :( It doesn't look good and doesn't have the button in the center. I didn't listen to the other reviews, but you should and spend a little bit more for a better quality tablet.", "Title": "You get what you pay for", "Date": "February 5, 2013"}, {"Author": "victor", "ReviewID": "R3JWGJGKT7TTSX", "Overall": "4.0", "Content": "The hardware is great, very fast, but doesn t include play store. This means apps in this tablet are not very good.", "Title": "Not Play Store", "Date": "February 5, 2013"}, {"Author": "Scarlette", "ReviewID": "R14IFMH2LINDAF", "Overall": "2.0", "Content": "So far I think I like it.  I am very green on this so I have more questions than answers.  I have downloaded several (aps) games but I don't see them when I go to the aps page.  Under favorites it is blank.  How do I connect with facebook?  I put in my e-mail address and password but it doesn't come up.  I did get e-mail to work and the internet.  If anyone can help me I would appreciate it.", "Title": "new to tablets", "Date": "January 31, 2013"}, {"Author": "That giiiirl \"Navyboy78\"", "ReviewID": "R5R5OA03LS9R1", "Overall": "4.0", "Content": "I after doing much research on Coby tablets decided in spite of the one star reviews on here to give it a shot. As other reviewers suggested after my package arrived next day,i  immediately downloaded Amazon store app. I did this by selecting Amazon store app apk. http://www.amazon.com/gp/mas/get/android. That is the link that takes u right to the download. It downloaded fast with no issues and from the Amazon store i downloaded Dolphin hd browser,Netflix (which this tablet does play and well not laggy at all. loads lil slower then id like but movie streaming is seamless.) Yahoo mail app,Aim app, Weather channel app and Angry Birds Space and other assorted apps such as games and Amazon Kindle app for downloading books.All Downloaded with no issues and work fine. This is a pretty good E reader as well. There is a one Second Delay when u switch from Landscape to Portrait view but nothing to complain about. It is flash 11 enabled so u can watch you tube videos it does come with the app already loaded and on your home page and it can play videos from sites like solarmovie.so. As far as Facebook games it can play some but not all. So games like Farmville u will need to get Farmville express since the app was discontinued for some reason for which u can find easily by googling it. The Battery life is a little short as others reviewers did say i get about 3 hrs of battery life before it needs to be charged. Standby time is good however lasting easily 10hrs in standby mode. The camera is ok it is front facing and only 0.3 mp but it does have zoom and can take videos. I downloaded skype and skyped with it and built in mic and Camera are ok not great but  people could see and hear me well. Just not recommended in bright areas it will wash out the camera. The built in web browser is decent but i added Dolphin had which i like better Opera Mini is also a good browser. You cannot get Google Play or app store out of box. You could root this tablet and other reviewers have suggested ways to get it to work i did not try them however. Amazon app store plus other various free ware sites Such as getjar freewarelovers.com etc provide a lot of free apps that work fine. Getjar site is working again not all apps will download but most do and are free.  The screen is clear and bright resolution is very good. It is not laggy at all as of yet and when u type it doesn't have that annoying delay from what u type till it appears in your text block. it types very smoothly. All and all it is a good tablet for the 97 bucks u pay for it. I will update this status if any issues arise after i had it for a couple weeks. The Battery life is Shorter then i would like that is my only complaint as of yet.", "Title": "Great price for a good tablet!!", "Date": "January 28, 2013"}, {"Author": "bmb8548", "ReviewID": "RAYWK2LZQNXDZ", "Overall": "5.0", "Content": "My son, who is 28 years old, loves this think.  He broke his, he is saying it is MUCH better than his last one.", "Title": "GAVE TO MY SON", "Date": "January 26, 2013"}, {"Author": "shirley  reese", "ReviewID": "R1SA04GGMXJZ1", "Overall": "4.0", "Content": "Loved it and it was good for the price.Could not ask for more.I would buy another when the time comes.", "Title": "Even Better", "Date": "January 24, 2013"}, {"Author": "Ishk", "ReviewID": "R24RDQZJL1DODH", "Overall": "4.0", "Content": "My Coby Kyros 10\" is 1.5 yrs old.  I have struggled with it from the get go as I could never figure out how to get Adobe flash on it.  It was very frustrating.Last week I read Amazon's reviews and learned how great the Amazon Store aps work with Androids since the arrival of the Kindle Fire.  So I cleared my Coby (look in the privacy tab) and started over.WOW what a difference!  I can now get everything I want: Netflix, Pandora, Skype, etc.Thanks to so many who talked about it here!", "Title": "Amazon aps", "Date": "January 22, 2013"}, {"Author": "Stephanie", "ReviewID": "R2IE1DX27H6J3R", "Overall": "5.0", "Content": "If you don't need something with a lot of frills and speed then this is more than enough! I wanted something we could take with us on vacations and trips and not worry about lugging around a laptop that could easily break. This Coby Kryos does not feel cheap or flimsy, I was more than happy when it arrived. It is a bit slow on the internet, but no different than a 4G cell phone. The picture quality is also very nice!Also, it does have a USB port, I don't know why people say it doesn't. I just ordered one of the keyboard cases that you can prop up and turn the tablet into a laptop of sorts. The keyboard plugs in via the USB port.", "Title": "Great tablet for the price!", "Date": "January 18, 2013"}, {"Author": "Jordan McGuire", "ReviewID": "R14DY04IYXUOKT", "Overall": "4.0", "Content": "This tablet does all that I need in a tablet computer:-)  it has an ok benchmark rating using antutu .  It plays video really well plays 3d games with ease. Overall pretty good tablet, however I think gogle should rethink letting developers use android without having the licensed versin because most users want acces to goolee play and also other google software. If this tablet had googe play I would give five stars thank you", "Title": "Good tablet for price", "Date": "December 25, 2012"}, {"Author": "Eric Seebach", "ReviewID": "RQTXVWO6DL4TQ", "Overall": "3.0", "Content": "its a good size and cheap don't know what else you can expect out of a tablet this size and price. Does every thing my wife wants it to", "Title": "ok tablet", "Date": "December 25, 2012"}, {"Author": "Maria Quintana", "ReviewID": "R1FPMNIPW97MEQ", "Overall": "3.0", "Content": "I am pleased with the product, but the capacity of the internal memory is not what you say. when connected to the pc, says I have 2GB of memory, not 4GB. Like when I see the memory capacity on the tablet. says 2gb.  :S", "Title": "Good", "Date": "December 25, 2012"}, {"Author": "APR", "ReviewID": "R3K3ZZR4SWTBG9", "Overall": "4.0", "Content": "10.1 inch 16:9 version.The main bad reviews I saw was the lack of google play and multitasking. The lack of google play is true but it did not stop me from getting all the popular apps. Just search the web for the app you want plus the keyword \"apk\". Then download and install. Netflix works flawlessly as well as the youtube \"official\" app, pandora and others. I had them all working within a few hours.Also was able to put all my mp3 on a micro-SD and these play without any trouble.Multitasking: no trouble listening to music while browsing and using other apps.External keyboard works perfect and the tablet (the 16:9 one) has both a full size and micro usb host.For scientists: there is a VerbTex Latex editor that works very well with external keyboard and you can get Anoc app to do Octave (MATLAB) programming. With Connectbot, you can ssh into external servers and edit/run code so you can actually work on these tablets. However, you do need an internet (wifi) connection active for these apps but this is an app limitation so you will have the same issue on anything more expensive.", "Title": "Quite good - no problems getting all apps working including netflix, pandora, etc", "Date": "December 24, 2012"}, {"Author": "Amazon Customer \"aspiring author\"", "ReviewID": "RAPB1TV3DVSS6", "Overall": "4.0", "Content": "I like the tablet, however it is a little slow and I had some issues with my angry birds games, had to reinstall two versions of the game. otherwise, it's good. I have to be careful not to install to many apps, otherwise the whole system seems to slow down.", "Title": "tablet review", "Date": "December 24, 2012"}, {"Author": "sergio", "ReviewID": "R1MUGT5R2BFBWD", "Overall": "5.0", "Content": "Exelente el producto e igual la atencion!!!Es un equipo muy completo lo recomindo, sobre todo para los que gustan de juegos super divertido", "Title": "Tablet", "Date": "December 24, 2012"}, {"Author": "JR", "ReviewID": "R2MDZWGBZP7IGH", "Overall": "4.0", "Content": "Likes:  Very affordable tablet that is simple and easy.  Recommend it for those who are NOT power users or not so tech savvy.  I have a few games on it for entertainment (Word Search, Flow, etc) but mostly use it for reading books (comes with reader installed), work documents (downloaded the Adobe PDF reader from Amazon), checking email.  Really easy to move data/music on and off.  Like not having to mess with ITunes account.  We also bought the 9\" model and like it just as well.Dislike:  camera is not very good.  Have had some difficulty getting a connection at certain wifi spots.  Also my son had othe same 10\" model.  He tried to install some of the bigger games on it and it crashed.  After spending some time on the phone with Tech suport we had to send it back.  (by the way, Coby Tech Support were great!)  He had to end up going with the IPad to handle his gaming-the Android games he was downloading aren't always compatible with the tablet.", "Title": "great tablet for the price", "Date": "December 24, 2012"}, {"Author": "hmm", "ReviewID": "R1WNAMSS7OMHTJ", "Overall": "1.0", "Content": "I got this for my daughter for Christmas. I was putting apps on it and it totally locked up. The power will not even shut off. She is going to be so disppointed.", "Title": "Tore up in one day!", "Date": "December 23, 2012"}, {"Author": "MA VICTORIA", "ReviewID": "R3GECE86FDT3LS", "Overall": "5.0", "Content": "coby works really good, not as fast as samsung galaxy.but for me its perfect for the price. i cant complain, i love it, honestly.", "Title": "coby tablet is pretty good", "Date": "December 23, 2012"}, {"Author": "Donald W. Perry Jr.", "ReviewID": "R14RMPYYPOLFLB", "Overall": "5.0", "Content": "Everyone has an opinion I know, and I am no different.  But this tablet was a gift to my picky wife and she is over the moon with it.  Does everything she wants, big enough so she doesn't have to squint, and affordable enough to not break the bank.  Probably one of the best purchases off Amazon ever.  In fact, I am going to be buying one every month from now on to give to my employees.  Does that tell you how much I liked it ????", "Title": "Great Tablet", "Date": "December 23, 2012"}, {"Author": "Marcelo Chaves Garro.", "ReviewID": "RMHLJCHOBWMSA", "Overall": "5.0", "Content": "El articulo llenó mis expectativas, llegó sumamente rapido y Estoy muy satisfecho con mi compra,  era igual al de la decripcion.", "Title": "excelente!!!", "Date": "December 10, 2012"}, {"Author": "Yvette Deschaine", "ReviewID": "R3GTHX9YZJ6OK4", "Overall": "4.0", "Content": "I bought this as I travel to europe once a year and did not want to bother with my laptop...so far it works great, its harder to get free books for this one then it is for the kindle tho..", "Title": "awesome", "Date": "December 10, 2012"}, {"Author": "Just A Dad", "ReviewID": "R1NPOCZN3EWMJW", "Overall": "4.0", "Content": "You should know that the camera on this device is not for taking pictures. The camera is located on the same side as the display. It is designed for video conferencing application but not movies and pictures.That concern aside it is a great tablet for the money. It costs less than a Sony ereader and does four times as much.Four starts for confusing me about the camera.Here is an update: I have noticed that the corners are not as touch responsive as the middle. This is particularly frustrating on the Getjar appstore because the search function is up in the top corner. You still can't beat the value though.", "Title": "Camera?", "Date": "December 8, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R2SFJ6VF2YBHSP", "Overall": "4.0", "Content": "Coby Kyros you can surf the web, but to download music, videos and other applications its says, you do not have any applicatons, I assume when you pay that sort of money everything should come ready to go., not trying to figure out how to get the stuff loaded in order to have it functioning.But i do like it, however, I also thought that 10.1 would have been bigger, like a square and not oblong.", "Title": "Coby Kyros you can surf the web, but to download music, videos and other applications its says, you do not have any applicatons,", "Date": "December 8, 2012"}, {"Author": "Kaila Brewer", "ReviewID": "R19QVJL6JK7DN5", "Overall": "5.0", "Content": "This tablet was my first tablet ever and i was so happy with it. I paid like 172 dollars for it at the time i ordered it but it was worth the money. I can say that the only things i did not like about this tablet was the fact that it does not support Google Play, YouTube videos were tremendously slow when loading, and the camera quality sucked. Since i got majority of my apps from the Amazon App Store, i was ok with not having Google Play. I never really use YouTube that much either so that was fine with me, and also i never used the camera so this tablet was just right for me. All and all, if you dnt mind not being able to use Google Play then i recommend this tablet for you, especially if you are on a budget and want a nice tablet to have. The games i had worked great and the screen quality is awesome. If you want to get a tablet for a child, this is even better because my 5 year old niece and 6 year old cousin LOVES this tablet and never wants to give it back to me :)", "Title": "Good for a first time tablet", "Date": "December 7, 2012"}, {"Author": "Blanca", "ReviewID": "R1SJU89NYQ2RC2", "Overall": "5.0", "Content": "Unfortunately I was looking to download skype and couldn't, I called them and they do not have the license for skype, so I had to return it... but I truly like it.  Skype was the feature I was hoping for the most.  But is a very good product really!!!...", "Title": "I love it ...", "Date": "December 7, 2012"}, {"Author": "Jim", "ReviewID": "R1KNJ9RQ5GBSQJ", "Overall": "4.0", "Content": "This Coby device does all my wife wanted in a device and still comes in under 100 bucks.  I had a good time setting it up for her.  She can now check email and surf the web without havin to wait until the computer finally decides to finish booting up.  Almost instant gratification.", "Title": "As advertized", "Date": "December 7, 2012"}, {"Author": "Audrey Stone", "ReviewID": "R2JOA3CMT2OZE8", "Overall": "5.0", "Content": "I have an earlier version of this but wanted to be able to download some apps, etc., that required Android 4.0. It was less expensive to buy a new one than it would have been to upgrade the original one!This one fills the bill...for now, at  least. In 2 or 3 years, I may want a 6.0 or whatever comes out next but this does all I need to do currently.Thank you for an excellent shopping adventure.... again!", "Title": "Coby Kyros tablet", "Date": "December 6, 2012"}, {"Author": "Emily Snyder", "ReviewID": "RZSEQ9IQDVYR6", "Overall": "5.0", "Content": "I bought it as a gift for someone and they love it!  I recommend this product as a gift if they want internet on the go.", "Title": "Rating", "Date": "December 4, 2012"}, {"Author": "Marco Vargas \"MarcoVargas\"", "ReviewID": "RMZEK98OJNS3T", "Overall": "5.0", "Content": "exc tablet for the money... as an e-reader its great, as good as any other tablet... the browser is a bit slow when surfing the internet... but i can read any book easily and even play angrybirds with no delay whatsoever", "Title": "EXc", "Date": "December 4, 2012"}, {"Author": "George E. Stratton", "ReviewID": "R3JMUBP5MQHP4I", "Overall": "1.0", "Content": "9-10-2012...I bought this to store and read technical PDF files that I use at my business and in the field every day. It's VERY good for viewing text documents and reading books. The quality seems good and the display is bright and fairly easy to read in the sunlight. The Browser is nice..it's tabbed for multiple page viewing. And having the 10 inch screen has it's advantages. I seldom have to zoom in to read something. I do have trouble viewing flash video in the browser...it just won't do it or I haven't figured it out yet. It does come with a You Tube viewer though and it works nicely. Of course it's being an Android system there are many apps that are fun and useful...you just can't download them from the Google store. Doesn't make sense to me...it's (Google) Android for pitty sake. It just says that it isn't an approved device. Thank goodness for Amazon's Appstore for Androids. You will find most anything you need there. It is a little thick and heavy as tablets go. It isn't an iPad for sure but it works for me...and at a great price, too.5-21-2013...After using it for a few months I have changed my rating from 4 to 1. It was OK as far as reading books and documents, and playing most apps. I had some problems with it though. It gets to where it takes 2 - 5 minutes to load a web page. I called Tech support (no problem getting through)and they told me to try a full reset. I hated to do that because it meant that I would have to re-install ALL of my apps but I did it anyway. It worked so I was happy with it for a short while until it started doing the same thing again. I called them back and they sent me a email explaining how to return it...to include the receipt and a $15.00 money order for return shipping. What really gets me is they state that it will be 6 to 8 weeks to process the claim...WHY SO LONG? It's been 3 full weeks since they received it so I just called and they told me that it still hasn't been entered into the system and that it will probably be a couple more weeks until it does. I'm sorry...that's just unacceptable. Well...I hope I get it back someday. In the mean time I bought a Samsung Galaxy 2 and am enjoying it immensely.8-14-2013...I wish there was a minus star that I could check. I will never buy another Coby device again. It has now been almost 4 months since I returned my tablet to Coby for warranty repair. I WAS able to contact customer care by phone...now even that is unavailable to anyone. You call the PUBLISHED phone number on their website and you get a recording telling you to go to cobyusa.com where the only option you have is to email them...so I did. I have emailed them twice asking them to simply return my tablet. After weeks I have yet to receive even a confirmation that they received my email. I wish I could understand how a company as successful as Coby is could deal with a customer in this manner.I must give Amazon some high praise here. I copied them the last email that I sent Coby. I got an email back from Amazon within hours of when I sent it apologizing for the problem that I have suffered with Coby. Not only that...they have refunded the entire amount that I purchased the tablet for, including tax and shipping. Amazon...you are a class act! I was unable to send return email to them thanking them but I can do that here...Thank you very much. I will defiantly continue buying from Amazon...just not anything Coby.", "Title": "Seems very nice for the money...but read on...", "Date": "September 10, 2012"}, {"Author": "Oilfield Trucker", "ReviewID": "R146AIULKTFSW6", "Overall": "3.0", "Content": "For the money the quality of the item is self isn't bad, but it is not Google approved and any official Google app such as Google Play (Marketplace), maps, etc. will not work with it.  I even downloaded them and tried to run them.  The apps are specifically designed not to run on this device.  I spent a entire day doing research to root the device, but could not find any way to do this either.If you want a movie player or something for surfing the web, this device is fine for that and with the built in USB port, you can use a full sized keyboard or other devices easily.I would have given 4 stars had it been able to run the most popular apps in the world...", "Title": "Not Google Approved", "Date": "September 1, 2012"}, {"Author": "Dissatisfied Customer", "ReviewID": "RGH7M5SGAJPZ9", "Overall": "5.0", "Content": "I purchased this as my first tablet device and then found out after registering that it is \"discontinued\" by the manufacturer! Other than this litle hickup, everything works fine and is a great little device for reading my schol books or serfing the web or even watching a movie (which I stil have to figure out).Again, this is overall a good little devic!", "Title": "Overall a good device", "Date": "August 14, 2012"}, {"Author": "Jenni W Moore", "ReviewID": "RQF5MI9KTC6DL", "Overall": "1.0", "Content": "I bought 2 of these tablets for my nephews for Christmas. As they are kids and I am their Aunt and not their Mom, I wanted to get a tablet that would give them everything they needed without costing an arm and a leg. I did research on these and thought this would be a good option. I was wrong. It does not come with Google Play. You have to root the device to add it. You can add Amazon Appstore pretty simply, but every time the tablets are turned off and back on the appstore as to be uninstalled/reinstalled to work. It comes with an app store called GetJar which online appears to have most of the apps they would want. However, many of these are not compatible with this tablet, including Angry Birds. I am returning these. I would rather spend a little more and get them something with more options.", "Title": "Not Impressed", "Date": "December 23, 2012"}, {"Author": "wayne rush", "ReviewID": "R3A27S7PUSURU8", "Overall": "1.0", "Content": "This tablet is a waste of money the touch screen responce is slow and choppy also wick is slow.bate it", "Title": "Not worth it", "Date": "December 8, 2012"}, {"Author": "SP", "ReviewID": "R1V4YC0I33JPXV", "Overall": "1.0", "Content": "The screen was very slow in responding and some parts of the screen didn't respond at all. It was very badly calibrated, I think. The lack of app support doesn't help either.", "Title": "No good", "Date": "December 6, 2012"}, {"Author": "Robert", "ReviewID": "R27A2KYQME0E99", "Overall": "3.0", "Content": "The Coby Kyros is a okay tablet for the price I wouldn't recommend getting another tablet for the same price cheap tablets out there are more slower than this oneI would Highly recomend the Coby Kyros MID-7042 Because this new Model is More slim but has a Poor Touch response in the sides of the tablet or when opening a new tab.FOR THOSE WHO HAVE A PROBLEM CAUSE OF GOOGLE PLAY. I HAVE THE SOLUTION =) 1Mobile Market most Apps in google market are in this market it. I'll put the Link so you can download the .APk file put in device need a SD Card install and enjoy!! =D[...]", "Title": "Great Tablet for the price but some downs", "Date": "November 27, 2012"}, {"Author": "Cloud \"Wolf\"", "ReviewID": "RMOW0I9RKI7J1", "Overall": "5.0", "Content": "I bought this Coby Kyros Mid-7048-4 model last week. I was impressed the battery was fully charged when I took it out of the box. That was a thoughtful gesture from Amazon. No problems so far. Very fast connecting with Wi-fi and I already put it 18 movies (via 32gb micro sd) and worked well. It has some apps already installed (basics), but lots of possibilities to advance for more apps out there. I bought this mainly for email checking and watching movies. The battery lasted at least 6 hours of movie watching (surprisingly). The only cons is the resolution, 800 x 480.  This could have been a perfect tablet if the resolution is higher; but for a tablet priced less than $100 bucks, you can never go wrong. I compared this tablet for my Blackberry Playbook which I already own (purchased 2 months ago), this Coby Kyros Mid-7048-4 is faster and more RELIABLE than the Playbook. I only have my Playbook for 2 months and now having issues from it. I must say, not all expensive tablets out there, is really worth as they should. I am glad I bought this Coby Kryos Mid-7048. Highly recommended!!! Thanks Amazon for the excellent service! j,sandiego", "Title": "Amazing Coby Kyros Mid-7048-4", "Date": "November 9, 2012"}, {"Author": "kysmom", "ReviewID": "R3KDVFDL4H7BEE", "Overall": "2.0", "Content": "Thankfully Amazon allowed me to replace it..... twice.... when it is working it's not a bad tablet for games and simple things. Not very fast internet loses connection often and freezes often as well. Once games are downloaded the work 95% of the time but also freeze up time to time. My first tablet worked ok for about a month then just stopped charging and holding a charge amazon replaced it. The second one they sent me lasted about a week before little white lines began to run across the screen at random amazon replaced it again thankfully. I am now on #3 have had it about 2 weeks now finding the same problems I had in the beginning before the charging problems and same problems as on the second as far as being slow and freezing often. Not very impressed.", "Title": "\"Eehh\"", "Date": "November 5, 2012"}, {"Author": "K. Counts", "ReviewID": "R13F4SQJYHH2QV", "Overall": "4.0", "Content": "This was a late Mother's Day present for me. I have wanted a tablet for a while but to me a table is a \"want\", in other words not needed if you have an Android phone and a PC. I couldn't ever justify buying one for myself so my wonderful Hubby did it for me!I got the tablet 2 days ago. I am not sure why other people can't download the apps that I have but here is what I did. I opened it up and charged it for a few mins. Then I connected it to my home WiFi with no problem. I d/l Dolphin browser, Amazon App Store, Netflix, and several other apps from amazon.I restarted the Tablet and checked Netflix to see if it worked and it did no problem. Kindle worked and all of the other apps worked. I noticed several reviews stating that Netflix and Kindle wouldn't work and I am not sure why they had problems.The only downfall I see is that the internet is slow and freezes a lot when browsing. I'm not sure if it is the tablet or my internet. I am thinking my router is going bad so that may be the problem. I am searching for a solution online and will update when I figure out which is which.No you can't have Google Play Store but Amazon App Store, 1Mobile, and GetJar are sufficient for me. I have Google Play on my EVO 4G but rarely use it as I prefer Amazon. Amazon also has the Free app of the day and I have gotten many high $$ apps for free from them. IMHO Google Play is overrated.My Man paid one hundred ninety-five dollars for this tablet and I think it was definitely worth it! I would recommend this to anyone wanting a reasonably priced tablet -  totally not worth $400+ for others when you can get this one.I have read you can root and add a Titanium Rom to these tablets to make them run smoother and process faster. I feel sure I will do this someday when I read enough about it to understand how to.", "Title": "I really like it!", "Date": "June 15, 2012"}, {"Author": "mayhem", "ReviewID": "R2J617CWM5UUK3", "Overall": "4.0", "Content": "works fine,little trouble with security password coby help is nonexistent,the price is right.coby gives no tech support and wrong contact numbers", "Title": "inexpensive tablet", "Date": "June 3, 2014"}, {"Author": "debora dunham", "ReviewID": "RS8T1FEWDH4X", "Overall": "1.0", "Content": "this product never worked-it was a gift and when i gave it too my daughter on May 20th. it would never stay charged.  this was $90.00 not will spent.i could not return at the time because of the return policy.i can not replace the bad battery because it is a tablet and can not open to replace.bad deal.", "Title": "product never worked", "Date": "March 31, 2014"}, {"Author": "Olga Hidalgo", "ReviewID": "R94OYQFGDZC5H", "Overall": "4.0", "Content": "So far so good but it took me a while to download apps and so on lool  right  aha t", "Title": "good fair for the price", "Date": "February 5, 2014"}, {"Author": "Anggie Turizo", "ReviewID": "R2K77L4GDRG8WP", "Overall": "5.0", "Content": "choose this rating, because I think it's great the processes to bring the product in good condition to my mailbox", "Title": "excelente", "Date": "February 4, 2014"}, {"Author": "Gus Sosa", "ReviewID": "R1PXC8M4KP18G3", "Overall": "1.0", "Content": "Hardware problems. Internal memory error. This tablet did not last even a year. Do yourself a favor, spend a little more and go for better quality. A good 7 inch tablet can go for as little as $150 made from a well known american brand.", "Title": "I Wouldn't buy it", "Date": "February 3, 2014"}, {"Author": "Edgar A. Zambrano R", "ReviewID": "R9XWQFREHCQ6K", "Overall": "4.0", "Content": "I received the equipment on time, I've been using, it worked well and I am very pleased and happy with his performance .....", "Title": "I'm very happy", "Date": "February 1, 2014"}, {"Author": "Skeeta", "ReviewID": "R2GI3MAVG7IDYR", "Overall": "1.0", "Content": "I got this as a present and it is ok, some nice features....but it came with some glitches..probably a manufactures default..it shuts down on its own when its being used constantly and sometimes it shuts off up to 8 times..spend the extra money and buy a good tablet..i do not recommend this tablet to anyone..but it was a gift..so I can't complain too much..", "Title": "Do not buy", "Date": "January 24, 2014"}, {"Author": "Justa Díaz", "ReviewID": "RK60DUM5AW0GC", "Overall": "5.0", "Content": "Great thing this tablet, it came all the way down to Venezuela in order, perfectly boxes, no details, I totally recommend this article and provider.", "Title": "Excellent!", "Date": "January 7, 2014"}, {"Author": "Margaret Tate", "ReviewID": "RF5GI5XPA1XUL", "Overall": "5.0", "Content": "I just love my new tablet. I've wanting one for a very long time. Easy to use and it was very economical.Thank you.", "Title": "Awesome", "Date": "January 7, 2014"}, {"Author": "Gold", "ReviewID": "R2W9N1KIXH7Q71", "Overall": "4.0", "Content": "It's the best size to use it as a sales portfolio.Pros:Good designit came with android 4.0decent battery lifenice screen resolutionConsDoes not have a front cameraThe camera quality is not goodIt could be a little slow sometimes", "Title": "great tablet for the price", "Date": "January 5, 2014"}, {"Author": "Trena Ethridge", "ReviewID": "RS7XQ6XCQEDAP", "Overall": "5.0", "Content": "Love this android - Have another 9 inch android but this one is so much simpler to use and doesn't require you to \"sign up\" for everything.  It's already on there for you.", "Title": "Coby Android", "Date": "December 30, 2013"}, {"Author": "Laz Dresler", "ReviewID": "R1M9ND0UAHQ19Z", "Overall": "3.0", "Content": "Buyer beware! CobyUSA.com is no longer on line which means no updates and not customer service. Double check my finding but I tried for 2 weeks and the website is all but dead.", "Title": "Yup Its ok, But they went out of Business!", "Date": "December 28, 2013"}, {"Author": "AR \"AR\"", "ReviewID": "R278U2W9I6AAET", "Overall": "1.0", "Content": "I bought this for my son last Christmas.  Oddly, he complained, but not enough to make me immediately toss it.  Well, this Christmas, I just bought him a RCA 7\", 8 GB, Dual core for $69 at Walmart.  He LOVES that.  So I was to take ownership of the Coby.  After one day with it, I had enough.  We factory reset it, I loaded nothing extra on it.  Google Play is only available through quite a bit of work.  The browser crashes constantly.  I don'[t know why my son didn't loudly complain.  He's a good kid, I guess.  As far as this Coby goes.... it's going in the trash.  I would not even give it to someone.  That would be a cruel joke.  I'm dead serious about that.  I've been in IT for 25 years and I've never seen a piece of equipment be such a lemon.  Honestly, I cannot say enough bad things about it and can't find anything good to say.", "Title": "terrible", "Date": "December 27, 2013"}, {"Author": "Jennifer", "ReviewID": "R1PVHNB8IG8NJS", "Overall": "1.0", "Content": "This item has already stopped working!  It will no longer come on.  Not happy!!! It has hardly been used and is only 8 months old. Not right!!!", "Title": "Does not work", "Date": "December 26, 2013"}, {"Author": "caroline waweru", "ReviewID": "R27ZD97M243WQ3", "Overall": "1.0", "Content": "This is the worst product i have purchased. for 1 the battery life is very limited, 2nd the screen is not very clear and the sound quality is horrible, very low. Don't buy it.", "Title": "BAD IDEA", "Date": "December 25, 2013"}, {"Author": "jenny price", "ReviewID": "RPKBTK7T2CWQE", "Overall": "2.0", "Content": "Does not connect to play store.  When I called phones were turned off.  I was had.  Never buy from coby again.", "Title": "not what i thought", "Date": "December 24, 2013"}, {"Author": "pablo barceló", "ReviewID": "R2RK7TF6FE53LA", "Overall": "5.0", "Content": "my wife love this tablet! works very great for her studies some isues whit google play but.. it has his own store to get apps!!", "Title": "very good!! shipped on time my wife love it!!", "Date": "December 18, 2013"}, {"Author": "Melanie M. Montoya", "ReviewID": "R34Y1WI0D9AR85", "Overall": "3.0", "Content": "Find out it very hard to download apps....worked up until now.  It just stopped working :-( SAD ABOUT NOT RETURN OR REFUND....waited money", "Title": "Not a android that's for sure", "Date": "December 18, 2013"}, {"Author": "Erica", "ReviewID": "RRQW4215H999J", "Overall": "2.0", "Content": "Good tablet but the audio stopped working after about 10 months.  I had purchased the square trade though and they sent a check and we bought another tablet.", "Title": "audio stopped working", "Date": "December 17, 2013"}, {"Author": "Jumin Sam", "ReviewID": "R2PO3ZOSGG2RKH", "Overall": "4.0", "Content": "I purchased the tablet for my son who seems to absolutely love it.  It's response time is a bit slow sometimes.  There's also a bit of difficulty downloading certain apps.", "Title": "coby 9.7 review", "Date": "December 17, 2013"}, {"Author": "Tre", "ReviewID": "R2QAY4OWP56PN", "Overall": "3.0", "Content": "The device looks nice and it has some features that I like. Negative- The device shuts off while I'm searching the internet, and it doesnt stay on WIFI with the saved password. I have to continuously type in the password for WIFI connectivity. UGH!!!", "Title": "Coby Kyros 9.7 Android Tablet", "Date": "December 17, 2013"}, {"Author": "Brandon", "ReviewID": "RJUTO6AWJ58KS", "Overall": "2.0", "Content": "Don't waste your money.. this would not power up after 2 mos. Back and forth with Coby saying it's on Amazon to fulfill a refund and Amazon says it's on Coby to repair. To our dismay Coby's warranty is now worthless and has filed bankruptcy. Wish Amazon would of provided some type of customer satisfaction with us on this product, but didn't!!", "Title": "Buyer beware!!", "Date": "December 14, 2013"}, {"Author": "Esther Battle", "ReviewID": "RQRRF43Q7OWZ8", "Overall": "1.0", "Content": "does NOT have Google Play or Google on it to get Netflix !!! :(  can't watch movies very bad product", "Title": "BAD PRODUCT DO NOT RECOMMEND THIS TABLET FOR MOVIES !!!!!!", "Date": "December 12, 2013"}, {"Author": "Silence", "ReviewID": "R3OCPMH5HHJX45", "Overall": "2.0", "Content": "BAD WIFI CONNECTION. DISCONNECT EVERY 40 SECONDS, FOR GAMES ONLY. I ONLY USE THIS FOR PLAYING GAMES AND FOR FUN.", "Title": "GAME ONLY", "Date": "December 11, 2013"}, {"Author": "gouldinggirl", "ReviewID": "R1KI0X14KVWK2P", "Overall": "4.0", "Content": "It is o.k. for just the minimal use,  It runs slow, but I guess that's to be expected with an 8 GB.  Would be great for kids or younger teens.  All in all a good tablet for the price.", "Title": "Good for the price.", "Date": "December 9, 2013"}, {"Author": "caramelgirl", "ReviewID": "R2WWR43CXFYSY5", "Overall": "1.0", "Content": "This item has not worked properly since the first day I purchased it. I had it replaced within a week and the replacement (exactly the same) did not work either. The tablet stays on for no more than 5-10 min fully charged and freezes up and or just cuts off and won't come back on for days at a time. I would not reccommend this item to anyone.", "Title": "BAD ITEM", "Date": "December 3, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3T7ISUHV9OH1C", "Overall": "1.0", "Content": "Horrible product and service!!! I bought two of these for my two grand daughters for Christmas last year.  Within a month, one of them would no longer load apps for do much of anything. I called Coby Repair and they had me do a master reset. The tablet then had no internal memory at all.  They then told me to mail it back with a $15 money order to mail it back.  Well, I mailed it out in the beginning of February 2013.  I got a replacement tablet back in the mail in JULY!!!!!! Ridiculous!!! Now, nearly a year later, my other granddaughter's tablet was doing the same thing where it wouldn't download apps or do much of anything and now it won't even turn on! Grrrrrr! I will NEVER buy from Coby again!", "Title": "Beyond Frustrated", "Date": "December 2, 2013"}, {"Author": "Sansabelt", "ReviewID": "RGVEDDMFKK8GY", "Overall": "4.0", "Content": "I use it for a jukebox in my kitchen.  Does just what I need it to do.  I wish I could get iHeart or TunedIn so I can listen to webradio.  I can't get onto Google Play to add these apps.  But my music needs are satisfied as I added a 16GB microSDHC card and I'm rolling in the tunes.", "Title": "Love it.  Nice for a jukebox.", "Date": "December 1, 2013"}, {"Author": "Boom", "ReviewID": "R3IXDB0G9QRRAI", "Overall": "1.0", "Content": "did not work. while under warranty, called Coby who asked me to send it to them for repair.  this was about 7 months ago.  I was told it would take 6-8 weeks.  when I called or emailed to inquire about the product, there was no response.  I eventually escalated it to the BBB.  they were unsuccessful in contacting the business.  Meanwhile, last month, a report surface that Coby had gone out of the business and had no intention of honoring its warranties.  extremely appalling customer service.  even if you couldn't fix it, at least notify the customers or ship back the products back to them.", "Title": "corrupt company-stay away", "Date": "November 30, 2013"}, {"Author": "R. Dunlow \"hogster\"", "ReviewID": "R3N2SG2QDWVYVV", "Overall": "4.0", "Content": "I got this in June 2013 and am quite satisfied with it so far.  It starts quickly, the OS is simple to operate, and the screen is gorgeous.  The only quibble is that it occasionally quits the browser window, but that seems most likely to be the strength of the signal rather than a COBY issue.  Also, I'm not sure what the descriptor means when it says \"multi-touch\"  screen, it works with my finger very well, but not with the stylus that came with my cover case/keyboard.", "Title": "Operates well, and not JUST for the price point!.", "Date": "November 29, 2013"}, {"Author": "christi", "ReviewID": "R2INE7JE3OWNPC", "Overall": "5.0", "Content": "I bought for my brother who is just getting started using a computer device at all.  it was user friendly and he was very happy with it.  I liked so well I bought another for my 16 year old son and he loves it and it has worked great", "Title": "Works Great!", "Date": "November 26, 2013"}, {"Author": "Lubomyr", "ReviewID": "R3GBOYE7A1VJN2", "Overall": "1.0", "Content": "I bought this junk because it had HDMI and overall not bad technical characteristic. With this tablet I learned a lesson: never buy cheap products from unknown brand. It's extremely slow, even with viewing pictures. Web pages open very slow.", "Title": "Don't waist your money on cheap product!", "Date": "November 26, 2013"}, {"Author": "Conroy Victorine", "ReviewID": "RBQ2DHKOH8KNM", "Overall": "2.0", "Content": "Doesn't use the Android Market natively.  The built in market is limited and most of the apps are really not useful.  If you try to use the Android Market it crashes and freezes.  Even most useful apps like ebooks readers and graphics apps cause the tablet to freeze up and crash.  Definitely would not recommend to anyone.", "Title": "Too Limited!", "Date": "November 23, 2013"}, {"Author": "Viper", "ReviewID": "R1L5JTK9RII51A", "Overall": "4.0", "Content": "The Coby Kryos is not bad we bought it for our daughter and she like it. The price isn't bad but as you know technology changes so fast this will be obsolete in a few months. Overall for a cheap tablet this does the job and seems reliable.", "Title": "Not a bad low end tablet", "Date": "November 23, 2013"}, {"Author": "willi", "ReviewID": "R2K7B4CIA04CVN", "Overall": "5.0", "Content": "Okay, I've had this little gem for about 5 days now. I was looking for a ten inch tab, but didn't have a lot of cash. I already have the Acer Iconia A-100, which is a great tablet. But i wanted a 10 incher. When i first got it, it ran fine but there was no Google App Store, bummer, So I got the Amazon App Store. everything was working fine but when I loaded Netflix it didn't work, the app loaded fine but the screen would just go blank. I called Coby Customer Service and they said it was a problems with Adobe flash not running right? Anyways, with Coby you actually get a live person however, you may not get one that knows anything. So i looked around on the internet and found that this is a problem with the tablet. I also found a solution. A tech advised to reboot the system and erase factory files. Here is the message ---- \"Power the unit off (holding power buttom) and selecting Power off, then hold simultaneusly back button and on buttom 8 seconds,when the android icon appears press the back button, in the menu select wipe data/factory reset pressing home buttom and then press back buttom, in the next screen select \"yes delete all user data\" pressing back buttom, and in the next screen select \"reboot system now\" with the back buttom and wait. IT WORK FOR MY TABLET.\" ------After doing this download the Good e-Reader app store through Getjar. The Good e-Read app store has everything. Netflix now works great on my tablet. I was also able to down load pretty much every app the Google Play Store has. They even have the Google Play Store app. Anyways, after doing this my tablet runs smoother, seems to be faster and everything works. Took this tablet from a 3 to a 5 star. I now love this tablet. Oh, when doing this it will erase things (music, pics, videos) on the tablet but not on the SD Card.", "Title": "good", "Date": "November 20, 2013"}, {"Author": "Denika Watson \"Denika Watson\"", "ReviewID": "R262ES51IV2LSZ", "Overall": "5.0", "Content": "purchased for my mom for a just because gift she just can't put it down she loves it, thank you", "Title": "Money well spent", "Date": "November 18, 2013"}, {"Author": "Terry Huet", "ReviewID": "RDRDPPIJ7VJYV", "Overall": "4.0", "Content": "its quicker than I thought and it connects very well to wifi it has a clear picture and streaming is no problem", "Title": "good buy", "Date": "November 17, 2013"}, {"Author": "Ruth D. Neyra Ornelas \"VeinsOfGlass\"", "ReviewID": "RCO0EO253U47T", "Overall": "2.0", "Content": "Coby has the worst costumer service you can possibly have. My two coby tablet broke and I tried to call costumer service about the warranty and when you call you just get an answering machine telling you to go to the webpage, and then I tried to send an email and my emails where sent back because the address did not existed. Bottom line,  if you buy this just beware it is a disposable product, anything goes wrong with it and you'll have to throw it to the garbage, and worst of all, by my experience it is very likely that it will break very soon after purchase.", "Title": "Horrible costumer support from vendor", "Date": "November 13, 2013"}, {"Author": "LJ", "ReviewID": "R1NZSHBRFKCG01", "Overall": "1.0", "Content": "No one should waste their money on anything made by Coby! The tablets are ****! They don't work. Their own app store is non-existent. Customer service, NOT! 800 number, internet help, NOT!! Want to know why? The company is kapootzed! Defunct! Out of business! See ya later, thanks for your cash! Check the web! [...]The company is no more!", "Title": "Because there's nothing lower than 1 star.....", "Date": "November 12, 2013"}, {"Author": "Gwizard", "ReviewID": "R3IBQWU3MZVGJW", "Overall": "4.0", "Content": "[...]Follow the link if you are any tech savvy to get Google Play and Root on this tablet.I can verify working for this model tablet ONLY.<EDIT: ROOTING MAY CAUSE SCREEN ISSUES>", "Title": "Gapps + Root This Tablet for Full Function", "Date": "November 5, 2013"}, {"Author": "Danny", "ReviewID": "R3I4FWBBOEC3XO", "Overall": "2.0", "Content": "I have ordered Coby Kyros 7-Inch Android 4.0 4 GB Internet Tablet 16:9 Capacitive Multi-Touch Widescreen with Built-In Camera, Black MID7048-4 from GOGEEK USA for my son. Firstly, Gogeek USA did not have the product. A sales representative called and told me they do not have the 4GB and suggested a less memory with an addition of 4GB sd card. I end up getting the wrong product and GOgeek refuse to send me a replacement until they have the  product in their hand. The replacement product DID NOT come with a Built-in camera as the incorrect one was sent to me. As a novice to these devices,little did I know that you cannot save any games on the these SD cards from off the net as the tablet will not allow you to and the sales rep did not explained these cons to me. This was a problem because it defeats the whole purpose of my objective. Secondly, Gogeek customer service was extremely poor. These guys just seems to buy these product and resell them with no profession advice on the product. Thirdly, the Coby product does not come with Googleplay software which allows you to down loads games on the table. I have to pay over $50 bucks in addition to the cost to have these sofwareS loaded on the table because the cost of reshipment to Gogeek USA was too much. I reside out of the USA. Because of the LACK OF PROFESSIONAL CUSTOMER service/ADVICE FROM GOEEK USA I would advise anyone wanting to purchase ANY product from this seller to THINK TWICE before doing so. YOU CAN'T SAY I DID NOT WARN YOU.", "Title": "BAD SERVICE FROM GOGEEK USA", "Date": "November 4, 2013"}, {"Author": "Patrick Gibbs", "ReviewID": "R31AIHGRV1K674", "Overall": "1.0", "Content": "My wife got me one of these for Christmas last year in 2012.  It broke after a month of use.  Then I attempted to use the manufacturer’s warranty.  It has been six months since sending them the broken machine, and $15 for return shipping.  They still haven't honored their agreement.Coby is a poor manufacturer at best.  Their equipment is cheap, and their customer care is feeble.If they are not out of business yet, they will be soon.Do not buy this product.", "Title": "DO NOT BUY THIS PRODUCT", "Date": "November 2, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1F1U1FAITTR2G", "Overall": "2.0", "Content": "I suppose for the price that one pays for this it is not quite surprising that it is given to a few difficulties. I bought this for my mother and within about 2 weeks of having it she has had to \"reset\" it quite a few times. The other day it went off and despite being fully charged decided to stay powered off even when she had turned it on. Do yourself a favour and buy something more expensive that is not likely to give so many difficulties.", "Title": "Too many difficulties", "Date": "September 13, 2013"}, {"Author": "Dan Conger", "ReviewID": "R529HUJD4ZF4V", "Overall": "1.0", "Content": "This Item I have had problems from day one and cannot get it to load a thing and will not work. I have tried everything along with others, now I'm trying to return it and I'm out of the window to return for full refund. Not happy at all.", "Title": "Will not work", "Date": "August 7, 2013"}, {"Author": "Damon B. Cooper", "ReviewID": "R33Q4U3NP0QK09", "Overall": "3.0", "Content": "so I was a little disappointed with this tablet. I wanted a cheap device to carry around to read my med school books on and look up things on the internet.  unfortunately, it doesn't have access to the normal android apps, which is lame.  Plus it doesn't have swipe, also lame.  The battery runs out fast with Wi-Fi on.  I also find it a little sluggish, but it works for the basic things I wanted so it's okay.  It is nothing fancy though.", "Title": "works ok, but very basic", "Date": "August 6, 2013"}, {"Author": "Pelous Pelous", "ReviewID": "R1TGI666RA6NYG", "Overall": "1.0", "Content": "the display broke after 2 months of very light use. need to find out about the guaranty but I am not very optimistic.", "Title": "didn't last very long", "Date": "August 3, 2013"}, {"Author": "Colleen", "ReviewID": "RL74ITLAWGIXE", "Overall": "4.0", "Content": "Just what I wanted for my son's Europe trip;  ebooks, skype, searching for hostels etc!!  Looking forward to using it for myself and husband upon it's return to the U.S.", "Title": "Perfect~", "Date": "August 2, 2013"}, {"Author": "Kathryn", "ReviewID": "R3ERYD56RY5ZPC", "Overall": "1.0", "Content": "I' so sorry I wasted my money on this piece of -------. would like to return it but it wasn't sold by Amazon so I'm stuck with it. Very difficult to play games - touch becomes a \"hit\" many times. As said above \"I hate it\"", "Title": "It is lame - couldn't pull up the browser - was getting 58% WiFi while people next to me with another table were getting 98%", "Date": "August 2, 2013"}, {"Author": "Love to Learn", "ReviewID": "R3PA3O26JDRQYJ", "Overall": "1.0", "Content": "Reviews were decent for this tablet.  Better than others.  So I purchased it.  Never worked good from day one.  Very slow.  The touch screen is not sensitive to the touch.  Can hardly download games and apps.", "Title": "HORRIBBLE", "Date": "July 31, 2013"}, {"Author": "Martha Woodham", "ReviewID": "R1EPF28GRV5D43", "Overall": "1.0", "Content": "It is too slow.....I DON'T LIKE IT....WISH I HAD NOT BOUGHT IT.I guess I can give it to my 4 year old G grandson...He will thinkit to slow too...", "Title": "TOO SLOW", "Date": "July 31, 2013"}, {"Author": "AeroEngineer", "ReviewID": "R3430Q16QR8NPY", "Overall": "2.0", "Content": "I needed a replacement for my mint condition but frozen kobo touch ereader and was certainly not going to give that company my business again and after seeing the prices for limited e-ink readers versus full fledged tablets it's no contest. The major thing is that tablets need a lot more charging than e-ink readers do. I had an Android smartphone a while back before deciding it wasn't worth the monthly plan charges so the OS wasn't a problem. So the Coby Kyros seemed to fit the bill for my needs: it comes with Aldiko ebook reader already installed so I don't even need to be online to get my main use out of it. It's relatively cheap too. It's easy enough to plug into my PC, load up my music, ebooks and movies. I had no major issues with the software as I only wanted an ereader functionality everything else was bonus. There was some stutter here and there while reading books and it would not import some larger pdf file books with lots of pictures but this could be an Aldiko thing. I ran movies and music off my 32gb micro sd card as there's not much room for a lot of those type of files on this, no problems running any of that.I was able to put most of my epub library on there no problem. Aldiko was fairly easy to import my books into once I knew which folder to put them in so it would read the books. I found it to be great for epubs, not that great for pdf's. I particularly liked the feature where it switched the exposure on screen for night reading as it's much easier on the eyes and probably uses less energy since most of the screen is black other than the words. The 16:9 aspect ratio is not the best for holding this as a book for long periods of time I have to say. Also they put the power/vol buttons right where you hold one side of it when in portrait mode for reading, not the best thing but it's not a deal breaker either. It does seem to kick the heat out around there too as my hands got sweaty while reading.I can't comment on the internet part of this since I don't have wifi at home and never needed it while I owned this. The touch screen was pretty responsive. The micro USB port needs to be better positioned as it EASILY gets knocked out while plugged in. I also didn't see a \"charging\" symbol when it was plugged into the PC via USB so I'm not sure if it was charging that way or not, it did fine with the dedicated charger though.I received it from warehouse deals and it was supposed to be in like new condition. Well it was not, the plastic case had a crack down the back that was already half way down and so I returned this for a refund. Coby needs to either use harder plastics, metal or work on their structural design for this item. I went ahead and got another brand and model in the same price range as this one that also has an ereader app as well as has Google play store pre-installed. Pass on this and get a play store item that's designed to be more sturdy for not much more in price. I'm using an efun/walmart nextbook 7\" for the same price brand new as this tablet is used and it's much more sturdy with 8gb of onboard storage and google play, much better.", "Title": "Simple tablet works ok but not very sturdy", "Date": "July 30, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2ZKBC1T2VA80K", "Overall": "3.0", "Content": "I had to send my tablet in to be repaired.  Coby received my tablet on 4/22/13, but I have not received it as of yet.  I was told it would be 4-6 weeks but here I am 3 months later & cannot get a reply from anyone from Coby.  Maybe I'll get hold of the BBB.", "Title": "customer service does not exist", "Date": "July 30, 2013"}, {"Author": "rosetta solomon", "ReviewID": "R2A095X78CZ36Q", "Overall": "5.0", "Content": "I love my Tablet!  It has so many functions that I love.  it's built strong and looks great!  I'm so happy I got it that I don't know what to do with myself.  Thank you Amazon!", "Title": "Work Horse", "Date": "July 29, 2013"}, {"Author": "Texas Greg", "ReviewID": "R2P0L1CJQ7J3I2", "Overall": "2.0", "Content": "Got this about a week ago and I have to say yuck! This tablet is slow to react to programs and does not even work for a lot of the android apps out there. You cannot use google play because this device will not sync. I read that google play can be done but you have to go through some hoops.All in all don't waste your time with this one, spend a little more and get something better.I give it 2 stars because it does have good battery life and and nice screen display", "Title": "Coby tablet is not so good", "Date": "July 27, 2013"}, {"Author": "Constance Campbell", "ReviewID": "R2AQ5COQBA9UJ0", "Overall": "3.0", "Content": "Great for email. Had some trouble downloading free apps. Camera is good. I would recommend for those not wanting he expense of the ipad or other tabs.", "Title": "Good value", "Date": "July 26, 2013"}, {"Author": "amanda", "ReviewID": "R1G48P9FUHUMZE", "Overall": "5.0", "Content": "IM OVERJOYED ABOUT THIS  PRODUCT I FEEL AS THOUGH I HAVE PURCHASED IT BRAND NEW AND ITS CONDITION IS SUPERB", "Title": "GREAT BARGAIN", "Date": "July 26, 2013"}, {"Author": "Alex", "ReviewID": "R1SJZYKPXNC4IO", "Overall": "4.0", "Content": "I found this tablet being a bit slower than you would like a gadget to be, but for this small price it totally worth it. I'm happy with it ability to connect to Internet, but thou it not always keeps wifi connection strong enough to download things. Also, when it is on for couple of hours strait, it starts to act weird, the screen starts blinking and you can not get it under control, unless you turn it off completely. It holds battery pretty well, has a good speed,  strong, loud speakers. It is very simple and easy in use. I like it a lot and as i said before, for this small price, it is a very good deal.", "Title": "Good enough for this price", "Date": "July 25, 2013"}, {"Author": "Ray a Davidson", "ReviewID": "R2UNY704G2TPYQ", "Overall": "5.0", "Content": "I am well pleased with the Coby Kyros 1042.  It meets and exceeds my expectations.  My grand daughter also loves it and is wanting me to buy her one.", "Title": "Very good product", "Date": "July 25, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R115P3O0897IG7", "Overall": "1.0", "Content": "This tablet has major problems and not worth the money. It runs slow and i constantly get the screen that whatever app im using is being unresponsive and shuts it off.", "Title": "CRABY COBY", "Date": "July 25, 2013"}, {"Author": "MD \"md\"", "ReviewID": "R21MGWH01F6XZ2", "Overall": "1.0", "Content": "Please don't buy anything from Coby... spend a little more and go with another brand. I bought one, it was defective. It was still under warranty and I sent it back following all of their instructions. Was told the whole process should take 4-6 weeks. After 6 weeks I had to contact them to find out what the status was. They said mine was defective and they were upgrading it and would be sending a new one. Last I heard they were going to get me tracking info and a ship date. It has now been 11 weeks and I still don't have my tablet or an answer. They are now ignoring my email inquiries. Tried calling and the only thing they could tell me is that they don't know when it will ship and have no way of finding out.", "Title": "Please don't buy anything from Coby", "Date": "July 24, 2013"}, {"Author": "Asok Banerjee \"Asok\"", "ReviewID": "R2JIPK1SSIROOL", "Overall": "2.0", "Content": "It is a nice android tablet for a newbie in the tablet PC. However, there are some serious flaws with the browser. First of all the tablet freezes or shuts down frequently. You can neither download Google Chrome nor can you get Apps from the Google Play Store. Whenever you try to install any App, you will get an error message, \"You have no device\". I contacted the manufacturer and they told me that this model is not compatible for Google play Store, only the models such as 9765 and 1065 Models comes with built-in Chrome and Google play App. Also both the cameras are not good. I am returning mine today.", "Title": "Coby Kyros MID 9740-8 Tablet :do not buy", "Date": "July 24, 2013"}, {"Author": "Melly", "ReviewID": "R3FI2D3L3UJ981", "Overall": "1.0", "Content": "I got this for my daughter. And it stinks. SLOW as can be and want work half the time. Never again!", "Title": "AWEFUL", "Date": "July 24, 2013"}, {"Author": "Cecilia F.", "ReviewID": "RC2BQL93C4V4O", "Overall": "3.0", "Content": "Really nice tablet. The only thing its very slow when you want to brows the internet. Also it tends to have a blackout when playing games.", "Title": "okay tablet", "Date": "July 22, 2013"}, {"Author": "Dennick R. Franken", "ReviewID": "R33DHWB10TS458", "Overall": "5.0", "Content": "Great product. great price for 10\"nice coloring. also bought the lather casing. comes with keyboard (optional). nice case very functional.", "Title": "Great!", "Date": "July 10, 2013"}, {"Author": "King", "ReviewID": "R2C9HCB1KQA1HU", "Overall": "1.0", "Content": "My first electonic item  from the Coby  line  and am not impress. After the impressive  reviews , am disappointed with the, quality. At first, it starts of  as an item you can  work with but  the apps  starts to crash (not responding). The type of response a professional would not and cannot afford to encounter in the middle of an exercise.", "Title": "Not worth it", "Date": "July 9, 2013"}, {"Author": "Deoliveira", "ReviewID": "R2L2RBXUAG1JA2", "Overall": "5.0", "Content": "Attend my daughter's objectives. She loves movies, Utube, videos, check emails, take pictures and other thing to watch. It is very good for her. I like very much.", "Title": "Very nice tablet", "Date": "July 7, 2013"}, {"Author": "woodytick", "ReviewID": "R2F6BHNKVS55KN", "Overall": "5.0", "Content": "i bought this for my 4 yrs old son so he would leave his older brothers & sisters ipads alone. since the day it arrived he has not put it down. the only rest it gets is when its charging or he is asleep. it was well worth the money that i spent on it & would recommend it to anyone.", "Title": "Worth the money", "Date": "July 6, 2013"}, {"Author": "Erle M.", "ReviewID": "RT3K14F40SLHO", "Overall": "2.0", "Content": "Negotiation by Amazon was good and safe and the product arrived fast but when fuimutilizar android modern although it does not come with the Play Store or Market Place, and also does not accept the installation of the same. I tried to download apps through GetJar Tambe and did not succeed. My biggest interest in this product was to install games for my son and so far I'm having a lot of difficulty.The product did not meet my expectation.", "Title": "Did not meet my expectations", "Date": "July 6, 2013"}, {"Author": "Tahzay Huerta", "ReviewID": "RVKY2XR8WZDAG", "Overall": "5.0", "Content": "this has a very good touchscreen and app store but sometimes the apps close on me but i just  relode them and its find the second thing i like about this tablet is the fast wifi and the netflix streaming has very good color when watching videos.", "Title": "it meets expectations", "Date": "July 6, 2013"}, {"Author": "Slatback", "ReviewID": "R32CS5HXNG7FED", "Overall": "1.0", "Content": "What in te world did i buy this table for? Everyday this thing freezes and all of my information is wiped because i have to reset.", "Title": "Keeps freezing", "Date": "July 4, 2013"}, {"Author": "Karen Taylor", "ReviewID": "R2EGY23QEHQB8D", "Overall": "4.0", "Content": "My daughter has really enjoyed this tablet, Although it is used it was all I could purchased for her at that time.", "Title": "My daughters tablet", "Date": "June 29, 2013"}, {"Author": "David Britz \"servo75\"", "ReviewID": "R3P0X0KPC7LVFC", "Overall": "2.0", "Content": "It's not a bad unit overall, but didn't have any access to Google Play.  I tried to \"modify\" it so that it did, but no luck.  The apps selection for this unit was not good at all.", "Title": "Wound up returning it", "Date": "June 29, 2013"}, {"Author": "Ayde P.", "ReviewID": "R37QITOP77AA8B", "Overall": "4.0", "Content": "This product is a good option for the price, good option for childs or persons who cant pay much money.", "Title": "Good product", "Date": "June 28, 2013"}, {"Author": "Landie98", "ReviewID": "R2RWB72SM36N3J", "Overall": "3.0", "Content": "We like this product but we are having problems bringing in certain apps such as Netflix. We already have a Samsung Galaxy but this one was bought for our grandkids and seems a lot harder to learn how to use. We were hoping the girls could watch their shows on Netflix on their own tablet.", "Title": "Tablet", "Date": "June 27, 2013"}, {"Author": "Summer Hutchins", "ReviewID": "R1SBE3G1SN7SEL", "Overall": "1.0", "Content": "Do not recommend this product. The quality was very low. The device operated very slow. There were limited apps. I would pay a few dollars extra for better quality.", "Title": "Not Recommended", "Date": "June 27, 2013"}, {"Author": "Dirty Irons", "ReviewID": "R3UD21AK1XHD9G", "Overall": "2.0", "Content": "It's a nice compact unit, but doesn't function very well. It's slow and the screen is hard to use, you need to tap quite a bit to get it to respond. The internal memory is lacking also.", "Title": "Weak", "Date": "June 27, 2013"}, {"Author": "Rose Rowe", "ReviewID": "R3C7SNI6YR8L8J", "Overall": "2.0", "Content": "I purchased this tablet mainly for the camera but discovered that it has only a front face camera. This defeats the purpose of me taking pictures. For people who like to talk on Skype then this is perfect for it. For folks like me who likes to take pictures of sceneries, people and objects then this is a no, no.", "Title": "Coby 10.1 inch Android Tablet", "Date": "June 26, 2013"}, {"Author": "Nanacat in Raleigh NC \"momcat & more\"", "ReviewID": "RL2H1FB3EUAE1", "Overall": "5.0", "Content": "Great way to feed the growing tech child! Works really well. It's portable and lightweight.Charges quickly and lasts longer than I expected.  Access to games keeps kids productivelybusy in the car.", "Title": "Perfect for the Kids!", "Date": "June 26, 2013"}, {"Author": "Joyce J.", "ReviewID": "R1ACDSVKQV0KM8", "Overall": "4.0", "Content": "Great tablet for the money. This tablet is fast, allowing easy access to websites. Sometimes video frames freeze, but not too much.", "Title": "Coby Kyros 8-inch Android 4.0 4GB Tablet", "Date": "June 24, 2013"}, {"Author": "Clinton Almond", "ReviewID": "R3JZR1X903OG7A", "Overall": "2.0", "Content": "I was very happy to receive this tablet. It had a lot of nice programs on it and I liked the weight and the feel. However, right after I received it, a white line appeared across the top of the screen. I called the number given in the warranty information and was told to ship it to a Georgia address for disposition - either repair or replace. I had to pay $20 to ship and insure and after waiting 8 weeks, and two phone calls, I received a new Coby, which is a different model than the one I originally ordered. The new one has a battery which needs charging sooner than the other and I don't like it nearly as well. I feel, in a way, that I've been ripped off.", "Title": "Not happy with Coby Kyros", "Date": "June 23, 2013"}, {"Author": "Jack Howard \"Jhow\"", "ReviewID": "R2KVX5S80K9KMA", "Overall": "1.0", "Content": "I bought this for my wife so she could use it for e mail.  It worked for that at first and then started saying there was a connection problem and will not download new messages through the e mail button.  The camera lens is on the wrong side of the tablet so if you turn the camera on you are looking at yourself.  I have tried to contact Coby tech service and customer service and they will not even answer.  I will never buy anything with the Coby name on it again.", "Title": "Junk", "Date": "June 22, 2013"}, {"Author": "steve atkinson", "ReviewID": "RDO9V80G65NCM", "Overall": "3.0", "Content": "It is an ok tab, but seems to have problems holding the web.  It continually has you wait fro browser and it will take you all over and you have to use the back button too much.", "Title": "Coby Kyros 10.1 inch tablet", "Date": "June 11, 2013"}, {"Author": "Malissa Mackey", "ReviewID": "RBT3MTF8GXMOF", "Overall": "5.0", "Content": "A friend of mine wanted a simple tablet that was light and easy to use, as well as inexpensive. Got it a day earlier than expected, and it was working just as described. I'm almost tempted to get one for myself.", "Title": "Just what I needed.", "Date": "May 19, 2013"}, {"Author": "LaTania", "ReviewID": "R2FQLVVEL3NI7L", "Overall": "1.0", "Content": "I have ordered many products from Amazon and by far this is the worst.  On the 29th day the screen displayed everything backwards.  When I finally contacted Amazon they told me that my 30 day warranty had expired and I needed to contact the manufacturer.  It took 5 days to get them on the phone because thier voicemail was always full.  When I finally got someone on the phone their system was down.  They took my info but called back  three days later. After that time I had already spoken to a rude employee by the name of Bryan.  Basically he told me that they arent going to send me a new tablet, and people shouldn't expect this product to work like the Ipad.  There are other issues like the Getjar app which does not have a lot of the good apps.  I am just upset because I purchased this so that my sick mom could be entertained as she tries to heal.  I am out of 100 dollars and left to purchase another tablet.", "Title": "Do not purchase", "Date": "May 19, 2013"}, {"Author": "Jose Medina", "ReviewID": "R297ITTMJTB4T", "Overall": "1.0", "Content": "Can't get google play on it. It Claims it has the best app store. Apps are not good. Has app called get jar it's a waste of money. DON'T BUY IT.", "Title": "Not A Good Tablet", "Date": "May 18, 2013"}, {"Author": "KEN", "ReviewID": "R6WGTK7UM5A9M", "Overall": "4.0", "Content": "It takes awhile to boot up other than that it works great. My wife loves to play games on it and check her E-mail.", "Title": "my wife loves it.", "Date": "May 17, 2013"}, {"Author": "MetalleriUM", "ReviewID": "R2AV80YKH3GU70", "Overall": "3.0", "Content": "ok this tablet is for just $130 new and $80 used, i bought this used and to be honest i waste my $80 this tablet is really bad just dont waste your money you can bought one ipad1 used for just $190 and is much better than this peace of junk", "Title": "coby kyros 9 inch", "Date": "May 16, 2013"}, {"Author": "Mom1969", "ReviewID": "R28DLCV92G9RK4", "Overall": "4.0", "Content": "The tablet is pretty good for the value, but I wish I had purchased a more popular brand name. My granddaughter is having trouble downloading certain apps.", "Title": "The tablet is ok.", "Date": "May 16, 2013"}, {"Author": "Andrew F. Vrba", "ReviewID": "R22WT48QXMNCF2", "Overall": "3.0", "Content": "The 8-inch screen is just the right size for gaming, and its HDMI out allows you to use the tablet like a proper game console! Its reasonably fast for the money, and it has a decent battery life. However it has some issues. Because most apps won't allow you to install to an external SD card, you are STUCK with the meager 4gb of storage space. It has NO out of the box Google Play support. This can be remedied, but at the risk of possibly bricking your tablet. While it plays most of Glu Mobile's swankier games just fine, you won't be playing larger, beefier games, due to the limited specs and low storage space. So don't get this tablet if you're wanting to play the likes of NOVA 3 or the Modern Combat series on your big screen. Mine developed a glitch that kept disabling the internal storage, and eventually had to get a refund. That might not happen to everyone's, but buyer beware.So there you have it. It's not the best tablet out there, but if you want a mid-level gaming tablet, you could do much worse!", "Title": "Build quality hurts an overall decent tablet.", "Date": "May 16, 2013"}, {"Author": "Camille Pagee", "ReviewID": "R1HATFITGAWJXL", "Overall": "1.0", "Content": "We purchased a batch of 10 for use in a small office. 3 out of 10 had \"episodes\" of going to an all-white screen and needed to be reset within the first 2 days of very light use (we used them to browse Internet only). We were able to revive 2 of them but the 3rd is a $130 brick, returned promptly. A 4th had the white-screen thing briefly but seemed to recover itself after a long charge. However this one is practically unable to connect to wifi unless you are standing within arm's reach of the router. Forums I browsed seem to feature this complaint regularly.When working, the display is fine and the 'feel' of the device is otherwise deceptively good. However you have a high probability of wasting a trip back to UPS to send it back. **UPDATE** on the same day I wrote this, a second tablet went completely dead. So that makes 2 completely dead at under 1 week of use, 2 that had near-death experiences.", "Title": "4 in 10 chance of total failure", "Date": "May 16, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1NWBF831MWJVE", "Overall": "1.0", "Content": "I was bored riding the train during my commutes. Let's get this straight from the begining, it say Android but it can only download very specific items from it's own websites/app site.  So no Google Play, no Amazon where it was bought.  Which means all my Kindle books/Google books or songs can't be uploaded unless you put them on another device and then drag them to the tablet.  If I could give it a 0 I would but it does have the capabilities of upgrading junk, so that should count for something. Even it's music player is very specific, literally I bought a device between the Ipod touch and the Ipod Shuffle.  It can play music and some apps...so I really should be nicer to it but after owning a Kindle Fire and having to work with the Ipad Mini, this is neither one even it's camera is like from the 80's or something blurry.", "Title": "I would return this crap if I could", "Date": "May 15, 2013"}, {"Author": "lee lawyer", "ReviewID": "RPK0VPLVTRMI1", "Overall": "3.0", "Content": "My coby was great until 4 months later it wouldn't charge anymore. looking for contact info tp try tp get my coby working again", "Title": "Coby died after 4 months of use", "Date": "May 15, 2013"}, {"Author": "Amy M Porter", "ReviewID": "R2Y42YEETM5HFU", "Overall": "4.0", "Content": "Hard to update, but is speedy enough, and can accomplish most things we needed to do with it.  OS needs update!", "Title": "great for the money", "Date": "May 14, 2013"}, {"Author": "T. Henry", "ReviewID": "R2QZUZPHSEJ6VC", "Overall": "4.0", "Content": "ConsThe tablet will not allow me to access my netflix account because it says there is no recognized internet provider found.  Camera is only front facing.ProsWorks great with multiple tabs open.  Speed is moderate.  No issues connecting to any wi-fi.  Sleek design is ideal for storing while traveling.  Battery time is good.", "Title": "Good for the price!", "Date": "May 14, 2013"}, {"Author": "NB \"karoc\"", "ReviewID": "R2NNXBZSCCMVHX", "Overall": "4.0", "Content": "this is a good product. it works well for video, and it has a good storage capacity right from the box. it handles wifi with out a fuss, and picks up wifi hotspots automatically once the pass word is stored.the apps that can be obtained from the slide me store allows you to do just about anything. having the keypad helps a lot.", "Title": "good deal", "Date": "May 13, 2013"}, {"Author": "belize88", "ReviewID": "R1DQVAZ7BCNLKL", "Overall": "5.0", "Content": "This is a great budget friendly tablet. I've recommended for different people and they all love it. It is a nice size too.", "Title": "Great for the budget", "Date": "May 13, 2013"}, {"Author": "Norton Rodriguez", "ReviewID": "R3TB2095BVE3KW", "Overall": "5.0", "Content": "This item was a gift to my Aunt who just needed to check her Emails on the go, told her that one of these was all she needed, and the only thing is that she had to stop on most any fast-food restaurant and your their Wi-Fi.  Last time I heard, she loves the Coby Kyros 8\" Tablet, so no complaints there!  I would recommend it highly.", "Title": "The Coby Kyros arrived fast and worked great!", "Date": "May 12, 2013"}, {"Author": "debbybea", "ReviewID": "R14J7L5DJJRG81", "Overall": "5.0", "Content": "i really enjoy this little tablet kinda wished i would have went with the 10\" one but since I have a laptop besides this really wasn't a problem for me", "Title": "Nice  little item", "Date": "May 11, 2013"}, {"Author": "Kelly Bomgaars", "ReviewID": "R34CNVIP20JRWT", "Overall": "3.0", "Content": "My 12 year old son has downloaded all kinds of apps and plays it every day.  Some apps I wanted were not available?", "Title": "great tablet for kids!", "Date": "May 10, 2013"}, {"Author": "Laurie Gustafson", "ReviewID": "R1RW10UFPM63OJ", "Overall": "1.0", "Content": "The size is great, it always locks up, won,t download apps I wanted, I wish I wouldn't have bought it. The advertizement sounds good but not what the product is at all.", "Title": "Coby Kyros Tablet", "Date": "May 9, 2013"}, {"Author": "forevreyes", "ReviewID": "R3LF6XWMFBU7UB", "Overall": "1.0", "Content": "I had to replace this item twice and both times I received a refurbished one when I purchased a new one. It did not hold a charge for more than five minutes (no joke)!  We also received someone else's email account on the tablet. It would not work at all. Will not be buying that brand again!  DON'T WASTE YOUR MONEY!!!!", "Title": "AWEFUL", "Date": "May 9, 2013"}, {"Author": "phoenix", "ReviewID": "R3KNZ24CR15M1F", "Overall": "2.0", "Content": "I bought a kindle and a playbook from amazon and had no troubles whatsoever so i felt confident purchasing two coby kyros for my kids xmas presents. They worked fine, everything was okay until last week( 4 months later)i realise i couldnt charge the tablets anymore. Apparently the piece for the charging port on the tablet fell back inside into the tablet. So now its got an empty hole where the charger entry is supposed to be. 4 months?? I dont live in the USA so basically my money is dead.I'll be thinking long and very hard before using amazon again.", "Title": "coby kyros", "Date": "April 15, 2013"}, {"Author": "Felicia Adams", "ReviewID": "R3GRMC9VLGK0BO", "Overall": "3.0", "Content": "Its what you pay for...was mislead by another review, but FYI the android market is a NO go on this...also its slow, and has become a paper weight at this point for me. Would be much better with a better market. No point in buying a product that's \"like\" other products if it doesn't measure up... the market doesn't even come close. smh.  Being generous with 3 stars. More like a 2 star, but the seller was great at getting me the product on time.", "Title": "such a waste", "Date": "April 15, 2013"}, {"Author": "Adept Computers \"Gaming freaks\"", "ReviewID": "RDWB6GGBX2UQW", "Overall": "3.0", "Content": "I had to return mine due to technical problems. I really liked this pad too. It was big , light and very thin.Booted up fine and looked great on the desktop. Then I tried to run an app and that's where the trouble started. The machine would lock up, make loud popping noises and finish with a white line racing across the screen before going completely off. That can't be right, I thought. :) So I sent it back.If I were sure it was just a random bad unit, I would have gotten another one because I really did like it. Amazon's return procedure was fantastic and I couldn't be happier with that fact.As an owner of a 7\" pad I can tell you, if you're going to get one, get a 9-10\" and you'll be very happy. After using this Coby I had a hard time going back to the smaller one.", "Title": "Mine had problems but..", "Date": "April 15, 2013"}, {"Author": "Angela Thorpe", "ReviewID": "R3C5YQLSOOMQZR", "Overall": "5.0", "Content": "Just as described, shipped early and Easley to track. I Luv It and the speed on the Coby is super fast!", "Title": "Colby Tablet", "Date": "April 13, 2013"}, {"Author": "Guivee G.", "ReviewID": "R8RO6KCB1TCYK", "Overall": "4.0", "Content": "I bought this for my stepdaughter. She likes it a lot. I checked it out. It seems to work for her. I would buy another given the chance.", "Title": "cool product", "Date": "April 13, 2013"}, {"Author": "bill", "ReviewID": "R3LFIKRMDHS9ZY", "Overall": "3.0", "Content": "work's well for a week or two then it goes blank and I need to push in the reset button.", "Title": "good for the cost", "Date": "April 13, 2013"}, {"Author": "jimena", "ReviewID": "R4AASQYT2VID8", "Overall": "5.0", "Content": "i love it! working good, is so good for the price, i want buy other, really good, thank you so much", "Title": "good", "Date": "April 12, 2013"}, {"Author": "Jorgeny", "ReviewID": "R3NX0Q6ERE3WB2", "Overall": "5.0", "Content": "For basic users it's perfect! Its 7-inch size it's perfect if you wanna comfy go out. If everything you want is working on word, PDF's, e-mails, etc., Coby Kyros' great! Good for entertainment too: facebook, twitter, youtube, games, etc! Gooood speed, highly recommended.", "Title": "Perfect for basic users", "Date": "April 12, 2013"}, {"Author": "Jose Flores", "ReviewID": "R19PAUC9UFQT2C", "Overall": "5.0", "Content": "muy bonita aunque esta marca tiende a recalentar mucho por la parte de atrás y la batería dura muy poquito tiempo cargada", "Title": "exelente", "Date": "April 12, 2013"}, {"Author": "JOSE ROMERO", "ReviewID": "R1I5P8CZ8RK8SC", "Overall": "1.0", "Content": "I have not received the product in time and paid defendant. I demand some remuneration for their lack. 2 days late starting tomorrow", "Title": "product not yet received", "Date": "April 11, 2013"}, {"Author": "Charles Moore", "ReviewID": "R1VHMKQTVTM25", "Overall": "5.0", "Content": "It's a great up date for me.....my son have been telling me dad you need to up date now i have", "Title": "real nice", "Date": "April 11, 2013"}, {"Author": "Joshua", "ReviewID": "R3QKT6OV5EUH97", "Overall": "3.0", "Content": "I got this tablet on the thought that  I Could add the App Store Google Play but Every time I open it The app store closes out on me. I did a little research and found out that I can root the device but there is on root for it yet. so for now i use the amazon app store I had the download it from my Computer and move it to the tablet using the cable it came with.the get jar store sucks. but since i got the amazon app store im fine till a root comes out", "Title": "Tablet is okay", "Date": "April 11, 2013"}, {"Author": "merab", "ReviewID": "R18Y20CAWOT1VP", "Overall": "5.0", "Content": "this is a great product. I'm happy with this seller, I liked it, I did not think that such money can buy toque different goods. all as described and all the accessories, or buy you will not regret", "Title": "это отличи товар", "Date": "April 10, 2013"}, {"Author": "Belle Flores", "ReviewID": "RA0VZ74XEA6CE", "Overall": "1.0", "Content": "We bought two of these for our young kids so that they would leave Mommy's iPad alone & have their own devices to play games and watch Netflix...they have been used maybe a total of three hours since Christmas! They are terrible quality- they constantly freeze up, the kids fingers aren't strong enough for the \"touch capability\", etc...these things are simply pure CRAP. I wouldn't $20 for this \"tablet\"!", "Title": "This thing is useless", "Date": "April 10, 2013"}, {"Author": "Susan Assing", "ReviewID": "R8GVW6T2LJ84M", "Overall": "1.0", "Content": "Don't have the words to describe my disappointment in this product. Didnot get value for my money and was unable to contact anyone to help me fix the problem.", "Title": "Worst Ever", "Date": "April 10, 2013"}, {"Author": "Matthew Marcinik", "ReviewID": "R1EKUOQEJR6IXR", "Overall": "1.0", "Content": "mehi guess its better than nothing. it is slow. it is not well made. I opened mine and there was movement in the case. this is not google approved so forget about google play, development or anything like that. you cant even load mozilla or chrome on it. returned and happy. I got a real android tablet for a couple dollars more", "Title": "crappy craptastic crap", "Date": "April 9, 2013"}, {"Author": "sheylamelian", "ReviewID": "RIG5UX7RXTVZN", "Overall": "4.0", "Content": "Muy buena tablet, buena resolucion y capacidasd, las aplicaciones seve muy bien y se puede descargar Path, Instagram y otras redes sociales", "Title": "A+", "Date": "April 9, 2013"}, {"Author": "Dimitri", "ReviewID": "RSCO67IO574SW", "Overall": "2.0", "Content": "Very bad viewing angles . . . Low dpi . . . No play market . . . But fast interface, and good performance for 2D games . . .", "Title": "Bad screen", "Date": "April 9, 2013"}, {"Author": "Troy", "ReviewID": "R1090OBKDNSMIM", "Overall": "5.0", "Content": "Its the first thing my daughter grabs every morning when she wakes up and it's the first thing my wife grabs when she gets home from work.", "Title": "Wife and Daughter love it", "Date": "April 9, 2013"}, {"Author": "don woods", "ReviewID": "R3K9AIQG6VWX3G", "Overall": "5.0", "Content": "never had a tablet before and i am very pleased with the Coby, I wanted it for Facebook , youtube and espn and all of those plus more it works great. only downside is it doesn't have google play.", "Title": "love it.", "Date": "April 9, 2013"}, {"Author": "Diane L. Stevens", "ReviewID": "R1GFJ76GDE955N", "Overall": "5.0", "Content": "i am using the tablet mainly for sheet music storage.  It is working fine, easy to read, easy to access.", "Title": "Like it a lot!", "Date": "April 8, 2013"}, {"Author": "Joe Lavigne", "ReviewID": "R3JFTNIOH34P2C", "Overall": "3.0", "Content": "Cons : Display is grainy, operating system is choppy, wifi is slow. Pros : 16.9 screen size nice, Ok for a starter tablet. Not what I expected, Their are better China tablets for under $ 200.00 and that includes shipping.", "Title": "Coby koyros ????", "Date": "March 28, 2013"}, {"Author": "Lindsey", "ReviewID": "R1IFE7OMFIKOSR", "Overall": "1.0", "Content": "froze up with in the frist two hours of getting it. all i did was set up my email and work accounts i needed shport cuts to. then it froze made a horrible sound and the only was to get it to shut off was to push the reset button. it continued to freeze up for the next two days. then i returned it.", "Title": "bad", "Date": "March 18, 2013"}, {"Author": "Patricia Garrison", "ReviewID": "R39L72IZXLQ9LK", "Overall": "2.0", "Content": "Every time I try to do the slightest thing the browser say would you like to wait of cancle, over and over again.  I like it when I use a program called team viewer because I use the browser of my laptop through this tablet.  Team viewer allows me to use my laptop from the tablet.  it works faster then.  I am not really liking this and I should return it.", "Title": "bad browser", "Date": "March 18, 2013"}, {"Author": "reddawnn", "ReviewID": "R24K9WXJBF6L6", "Overall": "5.0", "Content": "For the money its a great deal. I got it for the kids to play with, watch videos and stuff like that. I real happy with it.", "Title": "really good", "Date": "March 17, 2013"}, {"Author": "mikhailcharon", "ReviewID": "RFHRSXFMG8F9U", "Overall": "4.0", "Content": "I bought this for my girl friend to use as an eBook reader. That is a task it does admirably. She says its an excellent size for reading textbooks and comics. The speaker volume is a little on the low side.Also, it needs to be hacked to add the Google Play store. And you need the Google Play store to find the apps you need (Adobe Reader). Also, invest in a microSD card because storage is really limited.", "Title": "good tablet for price", "Date": "March 16, 2013"}, {"Author": "larry bennett", "ReviewID": "R2DGU7BQ9H4UNC", "Overall": "1.0", "Content": "bad connection and i have a very high speed dsl nothing will download and you can not get on the internet", "Title": "to slow", "Date": "March 15, 2013"}, {"Author": "Amy", "ReviewID": "R24FHRML7PH871", "Overall": "1.0", "Content": "This tablet constantly crashed.  I had a hard time finding apps.  It is not supported by Google, therefore you cannot easily sync with Google applications and services, aside from email.  You also cannot buy Google play sore apps.  Amazon appstore could be downloaded and installed, but I frequently had to reinstall that app.Was disappointed that the work flexibility I had hoped to gain with this tablet was actually increased frustration and hassle..Got the Samsung Tab 2... love it...", "Title": "Slow and clunky", "Date": "March 15, 2013"}, {"Author": "amanda foringer", "ReviewID": "RKMSRYZ4M3PNZ", "Overall": "5.0", "Content": "very easy to navigate with all the features i need.  great product for the price.  i would reccomend it to anyone wanting a cheaper alternative to the more expensive tablets.", "Title": "wonderful tablet!", "Date": "March 14, 2013"}, {"Author": "yeimi", "ReviewID": "R2DXMYUQN0NPNU", "Overall": "2.0", "Content": "It has good resolution, has some good applications, but it is very very slow, it freezes every 5 minutes. I hope COBY improve its processor and its aplicciones", "Title": "could be better", "Date": "March 13, 2013"}, {"Author": "Bud S \"Bud\"", "ReviewID": "R15R84QP3NR26I", "Overall": "4.0", "Content": "Works well and as advertized.  I added memory and now has plenty of capacity. I would reccomend it as a low cost tablet.", "Title": "Great little tablet", "Date": "March 13, 2013"}, {"Author": "Antonio", "ReviewID": "R1IGX8URBR64LZ", "Overall": "4.0", "Content": "got this tablet for my with for x-mass work great, she uses it in place of her laptop all the time when she's away from home", "Title": "wife's x-mas gift", "Date": "March 13, 2013"}, {"Author": "RTork", "ReviewID": "R5ADNPQOL9XN1", "Overall": "4.0", "Content": "Looking for an inexpensive tablet for my grand kids, good price and so far works great, netflix works great, they like to play minecraft, works great for that.  Grand kids love it.  The charging jack on the unit worries me a bit, very small post, I am afraid it is not very sturdy, so far so good.The only problem I had was when I installed the Amazon app store, i have never been able to get it to work 2 times in a row.  I have to uninstall the app and then re-download it and install it to get it to work.  Dont think it is an issue with the  tablet, but with the App.Overall very happy with my purchase. I have 3 grand kids, may have to get 2 more in the near future.", "Title": "Coby Kryos 8 Inch Android MID8048-4", "Date": "March 4, 2013"}, {"Author": "smt126", "ReviewID": "R3PCZEPKUCPMDJ", "Overall": "1.0", "Content": "I rarely write reviews, but this item really took the cake. I purchase many items online, read a lot of reviews beforehand and try to make an informed judgement. I wasn't looking for anything fancy, just something to stream some music on and maybe browse the internet when bored. The wifi on this thing is horrible. At first I thought maybe it was where I was using it. I then brought out my laptop and got fine reception everywhere. You can't stream netflix, pandora, or even get the apps to load in any kind of fluid motion. It will work great for 20 minutes sometimes and then not at all for the next hour. I probably spent more time troubleshooting it than I did using it. It was a gift from my wife for xmas, and I told her to get me one with the biggest screen, but for the price it should at least be able to perform basic functions that a tablet should.", "Title": "poor tablet", "Date": "March 3, 2013"}, {"Author": "Come_N_Get_It113", "ReviewID": "R3U8VZI780JRFI", "Overall": "1.0", "Content": "No one get this tablet. Horrible battery life. That's one of the main reasons i returned it. And camera has fuzzy picture. Getjar isn't as good as google play.", "Title": "Didn't like it same day i got it", "Date": "March 3, 2013"}, {"Author": "Beverley Allred", "ReviewID": "R7UON7G11G35V", "Overall": "1.0", "Content": "Cheap, flimsy no Google market. I got these for my daughters for Christmas. They both use my tablet regularly with no problems, but these are weird, they have a different android interface, no swipe. The first time I tried to use the usb port it unattached from the mother board now it won't work and we need to factory reset and are unable to because , no usb capabilities. all it does it flashes through every aps she's ever opened. Crap should have went with my gut an bought the Google nexus ones for twice as much money I bet they would still be working. The one that is still working just bugs my daughters for a few idiosyncrasies it has, her biggest complaint is the camera isn't centered it is in the corner. It has a small ac adapter plug", "Title": "Spend a little more you will be glad you did.", "Date": "March 2, 2013"}, {"Author": "William Andes", "ReviewID": "R1KI4FKBZDMBJG", "Overall": "1.0", "Content": "I chose this rating because I ordered one and it kept restarting on me in the middle of a game, so they sent me another one for a replacement and it did the same thing and also the second one was hooked to the wireless, but then the wifi on the tablet went out and stopped connecting.", "Title": "Stinks", "Date": "March 1, 2013"}, {"Author": "Sommer Starr", "ReviewID": "R3FHL5A21WFCS9", "Overall": "1.0", "Content": "I bought this product understanding it was not going to function like an iPad or a Windows tablet.  But so far, the application store, book reader and overall experience is a disappointment.  I am definately sorry i wasted money purchasing this device.", "Title": "Not happy", "Date": "March 1, 2013"}, {"Author": "CHARLES MORGADO", "ReviewID": "R1KI3P0CCEVPEV", "Overall": "4.0", "Content": "I like my tablet coby, is as expected,  the only thing I do not like is that you can not install wireless internet", "Title": "VERY GOOD", "Date": "February 28, 2013"}, {"Author": "AEM", "ReviewID": "RHB50B63TBXY7", "Overall": "3.0", "Content": "this item is not capatible to any of the apts. I can use it to down load NOOK. Which I did. I use it mostly to read books I  buy from  Barnes and Noble books.", "Title": "I should have spent a little more money", "Date": "February 26, 2013"}, {"Author": "sabrina", "ReviewID": "R87SSU6PXR58E", "Overall": "5.0", "Content": "I can do what ever I want to on it. It's a open computer that you can take with you. Not big just the right size.", "Title": "love it", "Date": "February 26, 2013"}, {"Author": "C. Meo \"Bargain Hunter\"", "ReviewID": "R34LETVQJ1RFJK", "Overall": "1.0", "Content": "Coby Kyros 8-Inch Android 4.0 4 GB Internet Tablet 4:3 Capacitive Multi-Touchscreen with Built-In Camera, Black MID8048-4 Great price and Great functioning, HOWEVER, it totally died after 8 weeks for no reason and with minimal usage.(not dropped or scratched)It won't charge or even turn on. UGH!Sending this one back and because I really liked using it I'm going to take a chance on a replacement.Will definitely get back here to update.", "Title": "Died after 8 weeks for no reason....:(", "Date": "February 18, 2013"}, {"Author": "col", "ReviewID": "R1G9KHKHVLST78", "Overall": "1.0", "Content": "bought this as a christmas gift. its 2 months old and now it dosent charge. cant use it. installed apps are not that good. need to have more. dont know what to do with it.", "Title": "not happy", "Date": "February 18, 2013"}, {"Author": "Julie Daniels", "ReviewID": "R2LLSVUNR7SGQ1", "Overall": "3.0", "Content": "I bought this for my son for Christmas, and it is incompatible with Google Play Store (which I knew from reading other ratings), but it's also only semi-compatible with the Amazon App store - I have to uninstall and reinstall the Amazon App store every few days. Also, even though you can get the apps from there, many of them don't run on this tablet. Still, it was relatively cheap, and it still has a lot of apps that do work. If you're looking for something that does everything you want, this isn't the tablet, but if you want to be able to play some games, surf the internet, etc, it works well enough.", "Title": "Limited Apps", "Date": "February 18, 2013"}, {"Author": "Earl D. Joyner", "ReviewID": "R1BLC0495TQED", "Overall": "5.0", "Content": "I cannot imagine why consumer rating companies haven't rated this tablet. It does everything the manufacturer says it will and has a super-great price tag. I reccommend this tablet to anyone who wants a quality product for a reasonable price.", "Title": "Great tablet", "Date": "February 18, 2013"}, {"Author": "yosmar ortiz", "ReviewID": "R3PIC4CCJ98WFW", "Overall": "5.0", "Content": "lo compre y me gusto lo unico que necesita es el sistema de android para descargar los programas y juegos", "Title": "muy practico", "Date": "February 17, 2013"}, {"Author": "shaun moran", "ReviewID": "R2CHMI9UFEB14I", "Overall": "1.0", "Content": "this product stinks had it 3 days and charging jack broke avoid at all costs not a good value stinks", "Title": "this tablet stinks", "Date": "February 17, 2013"}, {"Author": "jacee", "ReviewID": "R2E9CRAGYL6CX9", "Overall": "3.0", "Content": "You need patience to use this tablet to check email and use social network sites. It is also fragile and is currently having problems with the touch screen a short 1 1/2 months after purchase. I'm glad I bought a warrenty, I think I'll be using it frequently. It is a good size and handy to use on the go, fits easily into my purse WITH a protective hard cover, not the sleeve that came with it. I'm not sure if I would buy this again, it was very reasonable in price but I'm not sure if it is even worth what I paid. On the other hand, tablets are fragile...", "Title": "slow and fragile", "Date": "February 16, 2013"}, {"Author": "Ed Wallace", "ReviewID": "R3PB3SZQ5E56UJ", "Overall": "1.0", "Content": "could never get it to load, never got to use it, I got one at the local Best by, and took it back, then ordered one  from Amazon and it did the same thing. I talked to the customer service rep at Coby and was no help, so I sent it back, I still want a tablet but not one made by cobyThank you Ed Wallace", "Title": "Coby sent back", "Date": "February 16, 2013"}, {"Author": "Gregg", "ReviewID": "R2RF62H92HGB92", "Overall": "4.0", "Content": "Overall this tablet was good for the money spent.  It's got plenty of apps and games to search through.  I've had it for over two months and still haven't gotten through all of them.  Easy to use app store and navigation through the menus.  My only problem is sometimes the apps will say they have stopped working, but they will start right back up.  Inconvenient, but not a reason to turn away from this tablet.  I would definitely recommend this product.", "Title": "Fun to have around.", "Date": "February 16, 2013"}, {"Author": "Aaa", "ReviewID": "R1YB5FPDDYUQ0E", "Overall": "3.0", "Content": "the product works good for my 9 years old , every now and then it freezes and have to reset it.", "Title": "I like it", "Date": "February 16, 2013"}, {"Author": "Roy Corrales", "ReviewID": "R2RW9LJKQTLEK", "Overall": "4.0", "Content": "I love this tablet, of course there is other models much better that this one but for the price is unbeatable :)", "Title": "COBY KYROS8", "Date": "February 15, 2013"}, {"Author": "Abraham", "ReviewID": "R3CHB6QYWBQGWN", "Overall": "5.0", "Content": "I can say this product if it was the Christmas present for a nephew, a tablet suitable for children, and also to use it to study and surf the internet, I will buy another.", "Title": "highly recommended", "Date": "February 3, 2013"}, {"Author": "Barbara A. Anthony", "ReviewID": "R9EWLFNP2OP2R", "Overall": "5.0", "Content": "My husband purchase this Coby.  He likes using it and likes the size.  It isn't as fast as my Samsung which does frustrate himfrom time to time.", "Title": "Coby Kyros", "Date": "February 3, 2013"}, {"Author": "T. Bonne", "ReviewID": "R2U1Q702JOAHPE", "Overall": "3.0", "Content": "It has its limits, wish I would have spent more for something better. Maybe something a little bigger would be nice also.", "Title": "Its ok", "Date": "February 3, 2013"}, {"Author": "Paul R", "ReviewID": "R1KZT7TVSYPB1X", "Overall": "5.0", "Content": "No snob appeal brand. Let others pay for big name. Good quality with fabulous English manual. Good price (not bargain) compared to big names.", "Title": "Good brand for the money", "Date": "February 3, 2013"}, {"Author": "Michele Szakacs", "ReviewID": "R2FDRUVE0R8RMC", "Overall": "4.0", "Content": "I would have to say.. .for the price and the basic function I need at my fingertips.  For example: email,music, internet search, and most of all downloading videos and netflix.  It was well worth the price.  :-)", "Title": "basic function for the price.", "Date": "February 2, 2013"}, {"Author": "Veronica", "ReviewID": "R1QV7Z96ANY63E", "Overall": "3.0", "Content": "the coby kyros is a good TABLET but is Poorly Built.The Back Is Plastic and the fist time i dropped it the whole screen came of and jammed my button.Also It Is Very Hard to Put Music And If You Buy I reccomend rooting So You Get The Play Store Getjar Has a Small Selection.", "Title": "Good Tablet But Poor Quality", "Date": "February 2, 2013"}, {"Author": "D. Walston", "ReviewID": "R2T1A5WGZQHPUP", "Overall": "1.0", "Content": "The tablet was purchased as a Christmas gift and the WiFi didn't work out of the box. The tablet has a cheap feel to it and is poorly constructed as well. To get the WiFi problem fixed and because 30 days had elapsed since purchase (waiting for Christmas), I had to ship the unit back to Coby rather than return it, This included shipping at my cost, and a $15 money order to cover shipping & handling back to me.Poor quality and poor service. Don't buy this product.", "Title": "Low price and low quality", "Date": "February 2, 2013"}, {"Author": "My2cents", "ReviewID": "R37J85K2J9WAEY", "Overall": "4.0", "Content": "We purchased this for our 5 year old son because his father was getting an iPad and we wanted him to be able to have his own tablet, so he wouldn't constantly be harassing my husband.  For about a week, we tried using the GetJar store that comes preloaded on the tablet. There simply aren't enough apps to make this very functional for a younger audience. We researched this problem and saw Android tablets almost always need jailbroken to be more useful.  My husband is tech savy and had no problems completing the process. Now that the google play store is available, it is much better.  The processor speed is great for what we need it. We made sure to be a microSD card for extra storage so we can load his movies onto it. It has been nice for our long car trips!  Well worth the $90 price point.", "Title": "Good--If you jailbreak it", "Date": "February 1, 2013"}, {"Author": "Robert Sullenger", "ReviewID": "RH4P050DYAVWG", "Overall": "2.0", "Content": "Can't get google play wife wants scrabble can't get facebook app. Wish I would have known wouldn't have bougth it.", "Title": "Very limited Apps", "Date": "February 1, 2013"}, {"Author": "Carlos Eduardo Arevalo Anzola", "ReviewID": "R2UAJHORCCIRG2", "Overall": "5.0", "Content": "muy bueno el día de entrega fue el dicho sin ningún inconveniente total mente r e c o m e n d a d o", "Title": "Good", "Date": "January 31, 2013"}, {"Author": "Rachel Anderson", "ReviewID": "R3SXA9EVBYOPOV", "Overall": "5.0", "Content": "The children were so happy with gift at Christmas time. The product was as good as I'd hoped it would be. Thanks", "Title": "Awesome", "Date": "January 30, 2013"}, {"Author": "Glen E.", "ReviewID": "R1CQKIHGIG3ZEF", "Overall": "5.0", "Content": "I just bought the 10 inch version of this product about a week ago. I hated it at first and I even filed for a return. On a second thought, I decided to research some helpful hints and forums. DON'T BOTHER TRYING TO FORCE GOOGLE PLAY ONTO THIS DEVICE. IT IS NOT NECESSARY. Simply use the tablet browser to go to the getjar app website and download the getjar app. When you get the getjar app, download the \"good e-book reader\" app. Another great appstore is called mobile 1 app store. Between the three of these appstores, you have access to almost all of the nicer apps that google play has. Mobile 1 appstore has probably the best selection for a google play alternative. Also, get rid of the default browser and get yourself dolphin browser. The default browser is so and crashes frequently, but the problem is solved simply by installing a different browser. Also, the amazon appstore will work on this tablet. Now that I have access to many googleplay apps, I love it.", "Title": "Secrets for success with this item!", "Date": "January 30, 2013"}, {"Author": "Luis Rodriguez", "ReviewID": "R1R565E4IK30KW", "Overall": "5.0", "Content": "Excellent Product. Make a good investment.coby tablet 8. \"It's a good product, very useful for managing information, comfortable, easy to use and versatile.", "Title": "coby tablet 8. \"It is a good product and useful", "Date": "January 30, 2013"}, {"Author": "Debbie Baker", "ReviewID": "R15Y8H9SFL1GBI", "Overall": "1.0", "Content": "I bought 2 of these , one for myself and another for a friend.  They both died within 30 days!!! Just would not power on after being on the charger all night. same thing happened to both about 1 week apart.I plan on getting another Android Tablet but definitely not a Kyros", "Title": "2 Kyros Tablets died within 30 days", "Date": "January 30, 2013"}, {"Author": "Rebecca Wright-Raymo", "ReviewID": "R24E5ZOVHWH1XA", "Overall": "5.0", "Content": "This tablet I bought for my son home from college. He has a laptop as well but likes the compact size of this tablet and the fact that you can take along with you. Only one minor problem:We couldn't figure out at first how to download aps, which I read on other buyers' comments. That problem was quickly solved. Very happy, well-priced, fast shipper.", "Title": "Good for the Price", "Date": "January 30, 2013"}, {"Author": "Ann Loveridge \"a loveridge\"", "ReviewID": "RNKKJUDPYA97F", "Overall": "4.0", "Content": "This was a gift, wish I would have ordered same for me, it's performance and amenities better than what I purchased for me", "Title": "Coby Kyros", "Date": "January 30, 2013"}, {"Author": "Liam", "ReviewID": "R39S2NH2PCPEN3", "Overall": "2.0", "Content": "I was given one on trade so I have no money invested in this.On that note here is my impression.If you have ever held an Ipad, kindle fire, or Nexus 7 then don't get your hopes up on this thing.This is more like holding an Etch-a-Sketch. It is very cheap plastic and the buttons feel like the buttons on the old Tiger handheld games.Their is no Google Play store just this junky getjar app store which has 1/4 of the apps the google play store has.The capacitive touch is terrible. I spent a great deal double or triple tapping icons so they would launch.Also this is running Ice cream sandwich 4.0.3 which is not too bad, but its not good either considering right now you can buy a Nexus 7 for $200 and it is a much more powerful machine with better resolution even though it is only a 7\" screen.Save your money and purchase something else.", "Title": "Pay extra and get a Nexus 10 or Kindle Fire HD.", "Date": "January 30, 2013"}, {"Author": "catherine delvalle", "ReviewID": "R3EJ8BE5HAFNNT", "Overall": "1.0", "Content": "I bought one for my son and I.. Its often very slow and mine isn't working at all..Hardly used it and it's only been a little over a month.. The touch screen if off. I have to constantly go back because it doesn't direct me correctly the first time I touch the screen.. A complete waste of my money..", "Title": "Nothing good about the coby 8 inch", "Date": "January 29, 2013"}, {"Author": "Pen Name", "ReviewID": "R3DOK7CG5LW81V", "Overall": "3.0", "Content": "The tablet is alright. But as far as pictures, its not. Didn't like the camera or how the wallpaper sets the picture up. It was too blurry and big.", "Title": "Tablet", "Date": "January 29, 2013"}, {"Author": "Michael", "ReviewID": "R131I210HQ3AF4", "Overall": "3.0", "Content": "The Coby Kryos is nice for the price but the battery power does not last very long. There are a couple of sites you can download apps from but you cannot access google play apps.", "Title": "Coby Kryos", "Date": "January 20, 2013"}, {"Author": "Debbie", "ReviewID": "R3JTB68JKKFKUJ", "Overall": "4.0", "Content": "the 8\" is  a bit bigger easier to read and has a larger screen.  Draw back is that there are not many covers for it.I seem to have to charge it a lot.  It is not a full computer and at times that is frustrating.  It would not let me put on 'gmail plus and that is frustrating.  I can get on the internet easily when I am out  and most places it is easy to get online.", "Title": "i like thie Colby Kyros", "Date": "January 16, 2013"}, {"Author": "englishoh", "ReviewID": "RCM8PBIQF0D6D", "Overall": "4.0", "Content": "I got this for my wife to read books on because the Kindle white is quite small and only shows one page at a time.  She loved this.  It shows both pages just like a book and is just what she wanted.  The battery life is the only problem.  It's about 3 hours.  So, just about every time she gets done reading she has to recharge the battery.", "Title": "Very nice for the price", "Date": "January 16, 2013"}, {"Author": "hayes1", "ReviewID": "R3DWLPQM8RSV4J", "Overall": "1.0", "Content": "Well I went and bought this thinking it was a good deal till I got it and very disappointed I am im returning it as soon as possible it always say not responding when my laptop never does frustrating me alot so save ur money I wish I did", "Title": "well first things", "Date": "January 16, 2013"}, {"Author": "Limited", "ReviewID": "R27UYQ5W3JO9XS", "Overall": "4.0", "Content": "So far so good.  I bought this for my 8-year old.  He found all the games.  Sometimes it drops a regular wifi connection.  But does really good on the road w/a hotspot (strange).  He enjoys it.", "Title": "The product is gtg", "Date": "January 15, 2013"}, {"Author": "Brigid Washak", "ReviewID": "R29H9632NJAQ2J", "Overall": "5.0", "Content": "Came in the time they told me it would and its everything they said. cahrged it right up and havent had any issues with it. i have to just get use to it because i am an Iphone so switching from apple to android is probably the hardest part of it all", "Title": "came just as i thought", "Date": "January 15, 2013"}, {"Author": "Chris Eric Albrecht", "ReviewID": "RVS2VRF5YALF5", "Overall": "4.0", "Content": "This is a solid but lightweight machine.  Great for browsing the internet, Youtube, Netflix.  Getjar app sight is pathetic.  Poor apps full of adware. Cant use Google Play due to licensing, couldnt get Amazon work as well.  Don't expect too much and you wont be disappointed. Built in wifi seems to lose its connectivity when powered off.  Maybe I should change this review to 3 stars.", "Title": "Adequate", "Date": "January 15, 2013"}, {"Author": "Tnut \"Tina\"", "ReviewID": "R3D25AWYNF1KFC", "Overall": "2.0", "Content": "Well I guess it would be OK really. The only thing is about once a week the thing resets itself and the it's in Chinese. Then I have to go into settings and change it back to English. But then all the Music and Apps were deleted when it reset itself and then you have to go back in reinstall. So I dont think I will be getting another one.", "Title": "Coby Tablet", "Date": "January 15, 2013"}, {"Author": "Nae", "ReviewID": "R1JCVFPI4DTEN4", "Overall": "3.0", "Content": "I find this tablet to run slow. The market isnt so great. Doesnt really any internal storage and needs a micro sd card. I only paid $100 so i guess its great for someone on a restricted budget. If you can afftod a couple hundred more then dont buy this.", "Title": "ok the the money", "Date": "January 15, 2013"}, {"Author": "Les Beasley", "ReviewID": "R1WA5DID25YB9F", "Overall": "5.0", "Content": "I bought this for my wife for Christmas. .She is a novice with these type of things, but she loves to get on our PC and play with her e-mail, facebook etc. This product has a large screen for her and once she learned a little about it, she loves it. I would recommend this to anyone.", "Title": "Great Gift", "Date": "January 15, 2013"}, {"Author": "Kyle Esmeier", "ReviewID": "RH3EN8R62QQVJ", "Overall": "5.0", "Content": "This was a Christmas present for my son. It arrived 2 days before it was scheduled to arrive and the price was $10 cheaper than I could get it at the store.My son loves it.", "Title": "Great Product", "Date": "January 15, 2013"}, {"Author": "Amazon Customer \"Author of the Shifters Series.\"", "ReviewID": "R9R1XYIJ38S9V", "Overall": "3.0", "Content": "I bought this for my husband and set it up for him. finding some of the apps I wanted was tricky like to get the kindle reading app I had to download an app that gave access to the different reading apps but I got it and the kindle app store on it. I have a kindle fire HD which I love, but this was a great alternative at a much cheaper price. I'm glad I bought it.------- updated Jan 21---------- We are now having the same charging problem as I've seen written repeatedly in these reviews. Amazon is willing to replace, but I'm not hopeful it won't just happen with a new one. As an electrician, my husband can fix it but that is not the point. if this defect can be resolved I would still recommend it highly for the price. oh well.", "Title": "you get what you pay for", "Date": "January 11, 2013"}, {"Author": "JEANOT BLAISE", "ReviewID": "R3QBLVNL2KI1B", "Overall": "2.0", "Content": "Heavy compare to other tablets. get heat up pretty quick. It actually shot down since my son over used it. Now, it impossible to turn off.", "Title": "Turn on and Off", "Date": "January 8, 2013"}, {"Author": "carol ahrndt", "ReviewID": "R343GXRPW50P6M", "Overall": "4.0", "Content": "No back camera,  Having trouble getting in Net Flex, Trouble getting a address book, Still working on these..  The info book dosen't tell you how to get things on the tablet..", "Title": "Things I can't get to work on tablet..", "Date": "January 8, 2013"}, {"Author": "Patricia L Pifer", "ReviewID": "R102EAJA3UD401", "Overall": "4.0", "Content": "Bought 2 of these.Worked great out of box.Unfortunately had to return both.Received one replacement so far so good.Waiting on second one.Amazon return policy was fantastic.Hopefully second one will be good also", "Title": "hoping", "Date": "January 8, 2013"}, {"Author": "Joseph J. Schultz \"poetographer1967\"", "ReviewID": "R175AO5Y1M5S1U", "Overall": "1.0", "Content": "I ordered this because a co-worker purchased one and was very happy with his. The first one I ordered was DOA. The second one seemed fine, but after only a month the battery drains from 100% to shutdown after only 90 minutes on WiFi - sometimes not that long! It does not have the Google Play Store available unless you root it, which would be fine if that was known up front. The available browsers (native browser, Dolphin, Opera) are either terrible, or don't interact well with the product. One of the main reasons I got the tablet was ease of blogging, and the Blogger site doesn't run correctly on any of them. The display is... OK. There's this weird shadowing thing that goes on when the screen tilts even a little bit. I know this is a bargain tablet, but I expect it to at least do the things it is built for, and it doesn't even provide the basics reliably. The most disappointing electronics purchase I've ever made.", "Title": "Huge Disappointment", "Date": "January 8, 2013"}, {"Author": "Kimber Reilly", "ReviewID": "R1NCG1H5T3FPDR", "Overall": "5.0", "Content": "Happy with product! However for somereason can not download google play which has many moore apps for my 5yr old to play then the app that is already installed.", "Title": "lOVE IT", "Date": "January 8, 2013"}, {"Author": "J. Pineda", "ReviewID": "R3DYXJQXBNJFKM", "Overall": "1.0", "Content": "The only gripe with this is the fact that it seems to take forever to charge and not long to have its battery depleted, having to wait until its charged again, just a pain. returning it and will probably get an iPad mini.", "Title": "Great tablet, But...", "Date": "January 7, 2013"}, {"Author": "qiana", "ReviewID": "R2VODX9FPAGC1S", "Overall": "1.0", "Content": "I both 2 tablets for my children for xmas.  Within a week, not even I had to send BOTH of them back to the manufactors. A green line appeard down the middle of my sons tablet and would not go away. The jacket for the headphones didnt work. I would plug the headphones in and you could still hear the music playin thru the tablet speakers.  The headphone jack on my daughters tablet didnt work at all. Besides all of that the apps that the have for games are sooo corney.  No good games. I cant even download GooglePlay on this tablet.  I wish I would have never purchased this table.  WOULD NOT RECOMMEND ANYBODY TO BUY THIS PRODUCT.", "Title": "Very Disappointed/ Do not recommend", "Date": "January 7, 2013"}, {"Author": "Monica", "ReviewID": "R11HUZZEL00KU1", "Overall": "5.0", "Content": "First purchase I do hereby seemed serious and responsible ... I recommend it! .. that is why I give it the highest rating ...", "Title": "Excellent purchase", "Date": "January 7, 2013"}, {"Author": "Christopher Rennert", "ReviewID": "R16EJ7OMLPY1WQ", "Overall": "2.0", "Content": "Avoid ant tablet with GetJar as their primary App Store. There are ways around it, but too much for a review. There are better options out there.", "Title": "GetJat is worthless.", "Date": "January 6, 2013"}, {"Author": "Sue C", "ReviewID": "R3CVU9QSENJW8A", "Overall": "3.0", "Content": "The tablet is okay but it does not get Google Play so there are a lot of games that cannot be down loaded. It is slow to down load items at times and you also have to hit down load like 3 times when you download some items", "Title": "Coby Kyros", "Date": "January 6, 2013"}, {"Author": "Mary", "ReviewID": "R2UXATA5F4EWV", "Overall": "5.0", "Content": "It is my first tablet, and I love it! It is just the right size. weight and capacity. Perfect for everybody at home.", "Title": "Excellent job!", "Date": "January 6, 2013"}, {"Author": "ShadaeDaniella", "ReviewID": "R1WTPMYTYKP7HW", "Overall": "4.0", "Content": "This was purchased as a b/day gift for my fiance & he is in love with it! it is easy to navigate and he gets all of his apps & games from GetJar. This was really a good buy.", "Title": "Fantastic gift.", "Date": "January 6, 2013"}, {"Author": "Michel Moncayo", "ReviewID": "R12742ECK8Q7AE", "Overall": "5.0", "Content": "El producto llego en buenas condiciones valiò la pena la espera, espectacular reloj muchas gracias a ustedes son cumplidores gracias", "Title": "nery", "Date": "January 5, 2013"}, {"Author": "CARLOS CABEZA", "ReviewID": "RH0VL14IWJWFX", "Overall": "4.0", "Content": "Me gusto mucho esta tabla! hace el trabajo para la cual fue comprada, rapida, versatil y muy robusta! compre una memoria extraible para compensar el espacio de 16 gb!", "Title": "Muy Buen producto... con un balance precio/calidad", "Date": "January 5, 2013"}, {"Author": "4sapphires", "ReviewID": "RN9ZEZMF69ZRX", "Overall": "5.0", "Content": "I Love it . The touchscreen is great, too. I ordered it specifically for the touchscreen. Its easy to use and its large enough to see whats on the screen.", "Title": "Coby Kyros 10.1 inch Tablet", "Date": "January 5, 2013"}, {"Author": "Delores", "ReviewID": "R1BZ9MN5NNT55T", "Overall": "2.0", "Content": "I was dissapointed to see this tablet only has a front camera. Only after 2 days of using the tablet it malfunctioned and stop working.  I wasted my money on this product.", "Title": "Bad buy", "Date": "January 5, 2013"}, {"Author": "juspassinthrew", "ReviewID": "R2R6YBEANTF8KF", "Overall": "2.0", "Content": "It did not download anything. It got hot and shut off or froze. Dont know why or what caused this to happen. Could not download anything. This and two other different ones did not work, froze or what ever happened. Disapointed in product. Amazon was great though.", "Title": "Loved the idea of it but.........", "Date": "January 5, 2013"}, {"Author": "nikki2880", "ReviewID": "R38YS6F8AIPTWS", "Overall": "5.0", "Content": "I've had this tablet for a week now and just really started playing with it.  I love it.  I'm pretty basic and bought it just to surf the web and download a few apps.  Coby has a solution to the GetJar app on their website with a different android app market to download for this tablet.  I haven't seen netflix and I haven't figured our a way to get google play on it yet but I do think the new app market has a lot to offer.  So far no complaints!!  I will be buying another for my 10 year old son as well.", "Title": "Works great for me!!!!", "Date": "January 5, 2013"}, {"Author": "cposey5", "ReviewID": "R1WHE3OWNY6DQR", "Overall": "4.0", "Content": "Its agreat tablet , The only down side is the one side camera that faces you so you cant see when taking pictures not of your shelf.. otherwise great buy..", "Title": "worth the money", "Date": "January 1, 2013"}, {"Author": "Richard Hamilton", "ReviewID": "R3T3W27ZNML93W", "Overall": "3.0", "Content": "Having trouble download applications but it is helpful in allowing one than one family member to access the internet at time.", "Title": "Very Useful.", "Date": "January 1, 2013"}, {"Author": "jmusmc1998", "ReviewID": "R37ACYVBTDH2K4", "Overall": "3.0", "Content": "this item is alright if you do not want Google play dowload. You can still download games from Amazon which matches Google play but it is slow after loading games. I added 32 gig memory card but did not see a difference in speed.when I restore to factory default it's pretty fast but for some reason after loading games it slows down. however I did download netflix in the movies played fine but just took a minute to load after they loaded the excellent picture. On a 10 inch screen . the only negative thing about this device is you cannot do Google play.", "Title": "Coby Kyros 1042-8", "Date": "December 31, 2012"}, {"Author": "C. Boone \"Parent\"", "ReviewID": "R1SWJPU6CPYO79", "Overall": "2.0", "Content": "We bought four of these - ok if you want only apps on GETJAR.  You can not download as much stuff as you would think as everything is linked to google play and even though this is an android it wont let you download it.  Me and my husband bought one each for us and our boys.  I can not even add their school work apps they have to go through the internet every time.  The screen and keys freeze up and alway says not responding and you click wait and then it works.  It is not our internet bc everything eslse works fine even our kindle.  I wish we had just got one to try out first!  Disappointed that now we have 4.  Cant watch our netflix, etc. GETJAR is down alot so when it is up u have to download all the games and stuff you want then.We learned a lesson stop going the cheaper way out bc it is cheaper for a reason", "Title": "Not happy", "Date": "December 31, 2012"}, {"Author": "Wisconsin", "ReviewID": "R3KWD09ZOF9SQA", "Overall": "5.0", "Content": "Bought as a Christmas gift so I haven't used it myself, but she hasn't put it down yet!  So I'm thinking great gift idea without the huge cost of other tablets.", "Title": "Great gift", "Date": "December 31, 2012"}, {"Author": "Sharon S. White \"Beachgirl\"", "ReviewID": "R3OB76F29L3V60", "Overall": "3.0", "Content": "I was hoping to use this to play Words with Friends, but I can't get it to work for that. It tells me it is misconfigured..", "Title": "Disappointed..", "Date": "December 31, 2012"}, {"Author": "luis paz", "ReviewID": "R42OWYXZFHB6F", "Overall": "5.0", "Content": "compre este articulo y me parece que es muy util y esta en muy buen estado y llego a tiempo", "Title": "en muy buen estado!", "Date": "December 31, 2012"}, {"Author": "Jim", "ReviewID": "R3PZF2UF7MTU4L", "Overall": "2.0", "Content": "Every time I try to load a webpage or access a link, I get \"Browser not responding, do you want to wait/close\" message.", "Title": "Lame browser", "Date": "December 29, 2012"}, {"Author": "lorraine marks", "ReviewID": "R1QG5C7XPBCO0V", "Overall": "2.0", "Content": "I sent this tablet to my grandson for Christmas,  Evan though I  order to late and it arrive after Christmas, my grandson was hert broken . The tablet would not come on.. My daughter called coby Coby customer care  they talk her through,  on what to do. That still did not help....", "Title": "As I received this Product did not Come on at all.", "Date": "December 29, 2012"}, {"Author": "agh industrie", "ReviewID": "R3JSY43AZXQZE2", "Overall": "2.0", "Content": "i love this tablet i just came in the mail today and i opened it right up and was pleased to see it properly pack edged, but there were scratches on the back of it and i liked that it had great speed. the plastic screen protector is very flimsy if you are not careful it will crack very easily like mine did.", "Title": "GOOD PERFORMANCE-TERRIBLE BUILD QUALITY", "Date": "November 7, 2012"}, {"Author": "Ginger B. \"Noire\"", "ReviewID": "R1MYRDBN5Y26E2", "Overall": "3.0", "Content": "I received the device on a Friday afternoon. Up until Tuesday morning, it wouldn't connect to the wi-fi. Every other electronic equipment in my house works fine (and i have at least 3), but this tablet won't connect. It keeps saying \"Out of range\" when I'm sitting only 7 feet from the router.I called Coby on Tuesday morning, and was told to reset the device. It worked fine for about 2 minutes, then same problem started again. It won't connect to the wi-fi!I've only had it for 4 days, so i'm going to give it another 3 days before i send it back.The 9-inch form factor is perfect for me (thus the 2 stars), but the thing has to work!PS: They advertise it as being 1lb, put i put it on a scale, and it's actually 1.25 lbs.Will update soon...*Update 1: June 6, 2012 2-stars rating changed to 3So I returned the first unit to Amazon, and got a replacement. It took 1 hour and $50 for my ISP provider to make the tablet connect to the home wi-fi.Calling Coby customer care for over an hour did not resolve the issue.I had to pay $50 to my ISP provider for them to figure it out for me because the tablet is not their product.I also noticed that the tablet does not come with flash player already installed, so some websites do not work. I've downloaded a flash player from Getjar, yet still no success. I have to spend another half hour or so with their customer service today so they can tell me what to do.So overall this tablet cost me $250, which is 50 bucks way more than I was willing to pay for it. If you add in the over 2 days spent trying to get it to do the number one thing i bought it for (connect to internet), that irks.Depending on the wi-fi settings in your house or wherever you try to connect, this unit might not work. Whereby my old HP Touchpad connects everywhere, every time, without a hitch.**Update 2: June 11, 2012 - 3 stars rating changed to 2I finally found a flash player that works, but it only works with the native browser, not the Google chrome browser that i downloaded.I had to do my own research online to find the right Flash player, because Coby customer support was completely useless. The version that they suggested that i use didn't work, and they became very dismissive over the phone and rushed me off the phone when they saw that what they were suggesting wasn't working. Sad!So all and all, I will go from 3 stars rating to 2 stars because i shouldn't have gone through all that i went through to have this tablet do the No. 1 thing I bought for.It costs me overall $250, too much of my time and a lot of frustration.***Update 3: June 27, 2012 - 2 stars rating changed to 3; Would have given 3.5 if it was possible.Everything now works, except it's very slow. My small laptop with half the Ram of this tablet processes things faster. The tablet is very slow, no matter in what application I'm in, no matter how many applications are running at the same time. The sound is very low as well, so i use the headphones a lot.Not being able to use my Google calendar in it sucks big time! I removed the Google chrome browser and replaced it with Dolphin HD. Much better.So all and all, it took 3 weeks of troubleshooting, extensive internet search, hours over the phone with Coby CS, 2 returns and exchanges to have this thing work properly.If you plan to do anything other than basic internet surfing, you will get frustrated with this tablet if you don't have tons of patience.", "Title": "Seriously?", "Date": "May 29, 2012"}, {"Author": "Dolemite", "ReviewID": "R3AYI7LV3RE1BB", "Overall": "1.0", "Content": "Let me first start by saying that this device is terrible.  Ok, now here is why.1. It is running 4.03 without access to play store.  For some this is not an issue, but most people need apps.  When you hear of an app that you really want, be prepared to not be able to get it.  They give you an app store called get jar, which is a joke.  Get jar has no apps at all.  With some Androids you can manually load Play Store, but this device is locked down.  Impossible.2.  This device is locked down.  I could not even browse files on my own SD card, let alone play a movie or listen to music on my SD card.  When I tried to download a file browser from crap jar I could not find one, but then again I could not search for one.  Every search that actually managed to work came back with the same results.  If I searched for butter I would get angry birds, if I searched for word processor I would get angry birds.  Crap Jar3.  The screen has an issue.  When I would run searches on the web, it would erase what I entered in the search bar when I pressed the search button.  This happened on several different sites, which means that it is the browser or the tablet, and being as I cannot load a different browser I have to live with it.4.  The device is fast, but that is because there is nothing on it.Complete junk.Oh and you might want to carry around a pair of toe nail clippers to get the SD card in and out as regular human fingers just dont seem to cut it.Oh and the usb port is an off standard, so dont go thinking you can use any cables you already own.", "Title": "Stay away", "Date": "August 2, 2012"}, {"Author": "V. mills \"vmia16\"", "ReviewID": "RIIPYD5B51GEL", "Overall": "1.0", "Content": "and it broke. I went over my sister’s house, dropped it and that was all she wrote. Cracks all over the screen rendered it inoperable. It didn’t even fall hard, it fell on carpet. I now have a Visual Land Prestige for going on 6 months. This is a no no. Take heed.", "Title": "I had this for a week", "Date": "May 12, 2014"}, {"Author": "Diaa Nashed", "ReviewID": "R2EW99H2RZCBX9", "Overall": "1.0", "Content": "After less than one month from buying it, it went completely blank. I called Coby and told me to send it send it back to the manufacturer for a warranty repair, I did, but I found out that Coby had gone out of business. They have completely dropped off the face of the Earth and the company does not exist in any form. YOU WILL GET NO MANUFATURER SUPPORT. YOU WILL GET NO WARRENTY FROM COBY. I lost my money and lost all shipping costs for nothing in the end", "Title": "DO NOT BUY IT", "Date": "March 29, 2014"}, {"Author": "Tracy R.", "ReviewID": "R22RX60QEJQ17Z", "Overall": "1.0", "Content": "THIS WAS GREAT AT 1st....I HAD TO HIT THE FACTORY RE-SET 2 x's .....GRAND KIDS LOVED PLAYING THEIR GAMES,..UNTIL IT WENT BLANK, FROZE UP...IT TURNS ON, BUT ALL I GET IS THE \"COBY\" ....NOTHING ELSE, I EVEN TRIED THE RESET BUTTON, NO LUCK....WASTED ALOT OF MONEY ON THIS.....NOW I'M GOING TO SEND IT BACK TO THE MANUFACTURING CO. TO HAVE IT SERVICED......NOT WORTH IT PEOPLE!", "Title": "FROZE UP...", "Date": "March 20, 2014"}, {"Author": "Alma", "ReviewID": "R1X9EYU1FX7BLV", "Overall": "1.0", "Content": "It doesn't even gets WiFi I will recommend to save a bit morep money and buy kindle fire tablet the best tab", "Title": "hard to get wifi and no googlestore", "Date": "January 25, 2014"}, {"Author": "Ballet Mom", "ReviewID": "R2CE67LCA0BUUO", "Overall": "1.0", "Content": "Don't bother buying it.  It doesn't offer a good variety of apps and after light use, three months after I purchased it quit working.  Contacted customer service and they wouldn't do any thing about it.", "Title": "Barely worked for two months", "Date": "January 3, 2014"}, {"Author": "Adalberto", "ReviewID": "R3J5WF6F9F7793", "Overall": "1.0", "Content": "Coby Kyros 7-Inch Android 4.0 4 GB Internet Tablet Capacitive Multi-Touch 16:9 Widescreen with Built-In Camera, Black MID7048-4This model don't has camera anywhere, the screen is difficult to shift it and is very slow.", "Title": "Coby Kyros 7", "Date": "January 3, 2014"}, {"Author": "Meaghan Bledsoe", "ReviewID": "R2E9LHHCCGDUTW", "Overall": "1.0", "Content": "Came with pictures from the previous owner on it and had a crack in the screen.  Stopped working after a month.  Guess you shouldnt buy Coby huh?", "Title": "Coby=Crap", "Date": "November 19, 2013"}, {"Author": "deivis julio", "ReviewID": "R1WKYTQ2Z6YRY3", "Overall": "1.0", "Content": "BUENO EL PRODUCTO ME SALIO DAÑADO CUANDO SE ENCIENDE AL RATO SE APAGA SOLA Y SE INICIA DE NUEVO PERECE QUE FUERA EL SISTEMA", "Title": "DAÑADO", "Date": "April 3, 2013"}, {"Author": "yang", "ReviewID": "R12F9M3DN81OFL", "Overall": "1.0", "Content": "the wifi speed is extremely low!!!even much lower than my smart phone which is not acceptable. my internet speed is 400KB/S,but it takes me 4min to download 4M!!! I cannot use it to watch online video. and the screen is not IPS, thus it provides the user a very narrow angle of vision. I did not return it because of the complex process.", "Title": "really not recommand", "Date": "January 15, 2013"}, {"Author": "Kellena", "ReviewID": "R25JCMPOI0WIRY", "Overall": "3.0", "Content": "I am a student with no laptop and no smartphone.  I have been trying to save money for a tablet for a while, and then received an Amazon gift certificate for Christmas.  This was the only tablet that was completely covered by the gift certificate, and after much soul-searching I decided to \"spend it all in one place\" and go for it.  I am thrilled to be able to see my school's website and class power points on the go - however, it took a lot to get there.The touch screen and on screen keyboard are better than expected.  The wi-fi is intuitive and excellent.  The pre-installed web browser was not supported by my college's online program at all.  I tried installing Chrome (the suggested browser) - however, as noted in most other reviews, this tablet cannot access google play, and play is the only place to download chrome.  So I tried installing firefox from Mozilla's website - which redirected me to google play.  I searched the pre-installed app store - GetJar - however NOTHING I attempted to download from there would work, it would give me an error message.  So then I installed Amazon apps.  That got me *some* apps (many are not even available for download onto this tablet)... however, every time I exited out of Amazon apps and then tried to enter back into it, the appstore wouldn't load and would give me only a black screen and search bar that did nothing.  I worked around this by uninstalling and re-installing Amazon apps each time I wanted to use it, which was tedious.  Meanwhile, I still couldn't get a browser that worked on my school website.  So, all I could do was check my email and facebook, and view pictures from my sd card.  Definitely not worth $100.  A friend found a link to download firefox after some serious searching.  Once I installed firefox, I was able to connect to my school's website and view our online syllabi and power points, but each time a screen loads it still gives me an error message that I must click out of.  That raised this from two stars to three.  Finally, I found. on the Coby wesite, instructions on how to get GetJar to work (you have to access GetJar from the Coby website, not the widget that comes pre-installed).  However, the GetJar site ended up not being worth any of the hassle.  But, Pandora installed and works great.  I can read any office document, but need to pay $15 if I want to be able to CREATE anything, inlcuding any word documents.  Back down to two stars.  I ordered a keyboard/case, and then a usb-to-mini-usb adapter to make it work, and it hooked up instantly and worked with no problems, so that brought it back to three stars.  I am planning on trying the reset described in an earlier review and hoping that google play will then work - but I am not holding my breath.Another serious problem that I have not yet solved is its complete refusal to record sound.  It plays songs fine, but the camera (front facing only, so can really only be used for skyping and the like) is very poor quality, and will NOT record sound.  An email to Coby customer support has gone unanswered.  Apps that have high star ratings don't work either.  So no recording of class lectures with this baby!If you need the ability to compose word documents you will have to pay for an upgrade to the pre-installed office program at $15.  If you want to record sound it will cost you more - perhaps a microphone, or better yet a completely different gadget at $30 or more.  If you want to take pictures, again you will have to buy a different gadget - either a phone with a camera or a camera itself - this one has its camera facing the screen and is poor quality and zero flash.  But if you want to be able to surf the web and check your email on a screen larger than a phone, this one will do it.In summary, had I been able to afford a slightly more new-technology or bigger brand tablet, I would never give this tablet a second thought.  However, considering that if this tablet had not been available I wouldn't have one at all, it isn't all THAT bad.  Better than having none at all, but if you can afford a slightly higher quality brand, do so.", "Title": "Surfing and email, yes.  Word processing and lots of apps, no.", "Date": "January 15, 2013"}, {"Author": "Cherie Shepard", "ReviewID": "RZ9R5RFAWF71W", "Overall": "1.0", "Content": "i bought a keyboard for it and it broke the port office depot said it was a manufacturing error for not being put together properly but coby wont replace it DO NOT BUY!!!!!!!!!!!", "Title": "BROKEN", "Date": "January 15, 2013"}, {"Author": "xxhurley82xx", "ReviewID": "R1LWCK1XBTPVOI", "Overall": "1.0", "Content": "Bought it for my daughter for Christmas.  It turned on for about 20 minutes, then shut off and never turned back on again.  I called Toys R Us and they discontinued that tablet because the manager said he literally had a room full of returns after the holidays.  He explained there had been problems \"left and right\" with that particular tablet and recommended I get a Kindle Fire instead, which I did.  Waste of money; I can't believe they even stock those on shelves knowing what garbage they are.", "Title": "Waste of money - doesn't work", "Date": "January 15, 2013"}, {"Author": "mommyof4", "ReviewID": "R3ARG292GYIN4J", "Overall": "1.0", "Content": "Was not aware that this tablet was not compatible with Google Play. My kids are very disappointed that they can't get the games they wanted. Get Jar is a horrible option and to download free apps from amazon, I still have to put my credit card info in. I'm not ok with that!", "Title": "dislike", "Date": "January 15, 2013"}, {"Author": "whiteh", "ReviewID": "RSG8D3EKIEK6Z", "Overall": "1.0", "Content": "The charging port has broke TWICE. It's sensitive and stupid. Why can't the charging system be like any other charger? I'm not rough by any means. I had shell shock after the first break. Now I just want my money back! Getjar sucks too! Emusic?! Puke music! Nothing would pop up to let me download and I had to give them my cc info just to get my free credit and they charged me 11.99 anyways. totally dissatisfied. It wouldn't let me put 0 stars but my rating is actually -24 stars. I'll spend the extra money and get something better. Shame on you koby kyros. Cheap products = cheaply made. Lesson learned.", "Title": "p.o.s.", "Date": "January 14, 2013"}, {"Author": "Laverne Moore", "ReviewID": "R2BSVS5PHDQEWF", "Overall": "3.0", "Content": "have to be at church this morning! but we thank you all.......and have a blessed day! the kids are enjoying the gift.", "Title": "warm thanks!", "Date": "January 13, 2013"}, {"Author": "Sandra", "ReviewID": "R1VK2TDAZSJZ0J", "Overall": "2.0", "Content": "Bought it thinking I'd have my iPad to myself, but this tablet did not allow the downloads they wanted. :(", "Title": "Boy's Tablets", "Date": "January 13, 2013"}, {"Author": "saz", "ReviewID": "R6AWBEN7O6G", "Overall": "2.0", "Content": "Its a good product for internet browsing only. You cannot install any application because it is not supported by Google Play/market", "Title": "functioning", "Date": "January 13, 2013"}, {"Author": "evans", "ReviewID": "R1ACPYQ774Z9BL", "Overall": "1.0", "Content": "I bought 3 of these for my girls and a friend. Two of them have broken.. the screen just freezes.. Replaced these with the zeetab.. I have a coby 7127 tht i bought myself last year and it wont turn on. Im done with coby their tablets are trash. If you plan on buying one of these tablets do yourself a favor and just spend the extra and get a galaxy tab or kindle fire or zeetab (kids). you have been warned!!!", "Title": "Junk coby 7048", "Date": "January 12, 2013"}, {"Author": "nrg027", "ReviewID": "R3HJ5QLG8EGYEJ", "Overall": "5.0", "Content": "This is a perfect gift or just a starter product for any kid.  Very user friendly, powered by Android 4.0, light weight and affordable.  I'd recommend this tablet for anyone who doesn't want to spend a large sum of money on the more well-known namebrand tablets.  The camera could be a little better, however, it's still a great buy!!", "Title": "Good For The Kids", "Date": "January 11, 2013"}, {"Author": "HG", "ReviewID": "R28K0MXXXBUNFK", "Overall": "1.0", "Content": "This tablet seemed to be meeting my needs: internet access, email, download/play videos. It was, however, a hassle to find download sites for apps without using Google play store.  But the clincher was that after only one week, the screen suddenly went blank (the battery was charged!), and I ended up sending it back.", "Title": "Pooped out", "Date": "January 6, 2013"}, {"Author": "ramona", "ReviewID": "RDVZTHEPEK40", "Overall": "2.0", "Content": "The connection is so poor....really slow and I have a problems to load the apps.... is any body can help me?", "Title": "deception", "Date": "January 4, 2013"}, {"Author": "Sarah", "ReviewID": "R3AXTW1QRFEIYZ", "Overall": "1.0", "Content": "Didn't like it not a good tablet at all. Didn't have all the things I wanted in a tablet, like nexus 7 better..:(", "Title": "coby tablet", "Date": "January 4, 2013"}, {"Author": "Homeschoolin' Mom", "ReviewID": "R1VBX7VMTDGKXJ", "Overall": "1.0", "Content": "We have 2 other android tablets that we really like...a Nexus 7 and an HTC tablet from WalMart.  Both are much better investments.  The tablet was not compatible with several apps my daughter wanted.  Fortunately we discovered this within the first 2 hours of opening the box.  We are returning this.  Save yourself the time and hassle that we've been going through.  Wish we could afford a Kindle Fire though!  :)", "Title": "NOT worth it if you want Facebook or Google Play apps", "Date": "January 2, 2013"}, {"Author": "locard16309", "ReviewID": "RJPUTTA2ATWFM", "Overall": "2.0", "Content": "I purcahased this tablet to use while I sent my zenithink in for repairs. The coby doesn't feel natural in my hand, it's too flat , it  doesn't mesh with my hand. Also I learned the hard way that since it doesn't meet googles android operating system requirements that it is not recognised by the app store and you can't download anything from it. Now this almost makes this tablet a paperweight right there. It does have its own vesion of an app store called the \"get jar\" but it has such a limited selection that its next to useless. If that wasn't enough the browser constantly freezes and I get the dreaded browser not responding prompt and have to push wait and then wait for it to respond. The dictionary is all but empty and the spell check /auto complete appears to have a mind of its own. Having used the zenithink and the samsung for extended periods of time, my opinion is that this tablet is way overpriced and needs a year maybe two in furthur development before its consumer ready.", "Title": "Leaves a lot to be desired", "Date": "December 11, 2012"}, {"Author": "Misty", "ReviewID": "R2CPJ2SI4GCCNZ", "Overall": "1.0", "Content": "I am extremely disappointed with this tablet. It is slow and the screen keeps freezing.  I wish I would have waited and got a laptop. Please do not buy this product.", "Title": "don't waste your money", "Date": "December 7, 2012"}, {"Author": "kailey", "ReviewID": "R27N1P0BBSHJNL", "Overall": "4.0", "Content": "Can i conect it to my hotspot??cuz i have a hot spot on my phone and i want to order this tablet but i need to kno if it can do that?  Any helpers?", "Title": "does it have?", "Date": "December 4, 2012"}, {"Author": "VJ Hamilton", "ReviewID": "RJTVBAL81D1WV", "Overall": "3.0", "Content": "Its not what I expected.  It doesn't do what I needed.  It does not have Google Play so you can not down load  a lot of stuff.", "Title": "Not the best for games", "Date": "December 4, 2012"}, {"Author": "Saisri", "ReviewID": "R1FTHK4YFMIFO2", "Overall": "1.0", "Content": "I bought the tablet thinking that it was great value for the price quoted and also it came from coby and was being sold on Amazon. it worked fine the first time i used and once the battery died, i put it for recharging. That was it - it never worked again. it refused to start and i missed the 30 days return policy as i could not return it back before the expiry date. i think one should not buy a product when it the only one being sold in that price range as every other andriod 4 tablet is being sold at a minimum of 290+ where this was being sold for 100$.", "Title": "Product didnot work after the first recharge", "Date": "December 1, 2012"}, {"Author": "Mark Jackson", "ReviewID": "R3VGT029ECEHTP", "Overall": "1.0", "Content": "If the only reason you buy is for price, you will be happy. If there is anything else, you won't be. Not really compatible", "Title": "Coby", "Date": "November 28, 2012"}, {"Author": "Dr. M. Simmons", "ReviewID": "R3JRB424O95LZ5", "Overall": "1.0", "Content": "I thought I was getting a deal and it turned out to be a waste of money.  It was average while it worked but the batter eventually stopped recharging.  It is impossible to find a charger for this item, that is if it is the charger that is the problem.  Instead of saving money on this purchase I am out $170.00 which could have been used to go toward an iPad.", "Title": "It will not charge", "Date": "November 21, 2012"}, {"Author": "poor", "ReviewID": "R2ZEAZ4LH4R4RR", "Overall": "2.0", "Content": "Not great for the money/apps. Gear apps for kids/games. Not great with some readinngs, no audio, can't even download any audio from this tablet. I am very dissapointed with'it. Good for kids.", "Title": "fair product.", "Date": "October 25, 2012"}, {"Author": "Deejay", "ReviewID": "R1393TWODWBAH2", "Overall": "2.0", "Content": "This tablet is  good for a person who has no knowledge about tablets, a person who would just check emails and surfing the net.Pros:-big screen-cheap-nice to watch movies on it-it acts as a keyboard when writing message-HDMI, USB portsCons:-awkard rectangle shape-horrible app store-pre installed apps suck-no google play or netflix-takes forever to download apps-very slow- Doesn't really recognize your SD card. There is no file app to look through or open up ext sd card files.-speakers are horribleThe only good thing about this tablet is the size don't waste your money. I did download the amazon app store which was better than getjar.", "Title": "A waste of money!", "Date": "August 19, 2012"}, {"Author": "shell6726", "ReviewID": "R3HPSPJLTJP3KG", "Overall": "2.0", "Content": "The Tablet was not user friendly. It was hard to go from folder to folder Surfing the net was equally as hard.", "Title": "coby 10\" tablet", "Date": "August 6, 2012"}, {"Author": "Amazon Customer \"Voracious Reader\"", "ReviewID": "R44ZS7XO0ZTZQ", "Overall": "1.0", "Content": "I returned this tablet the same day I got it. I couldn't load Facebook mobile or Firefox. When viewing my e-mail in it's browser it ran VERY slowly. Didn't like it at all.", "Title": "Slow and no apps", "Date": "July 20, 2012"}, {"Author": "MARYLOU WELCOME", "ReviewID": "R3SH3R7TME6LW2", "Overall": "5.0", "Content": "this product is exelent bought it fr my sister in law she is enjoying this product everyday she look at it", "Title": "love it", "Date": "March 16, 2013"}, {"Author": "jj", "ReviewID": "R1X7J4Q4KMCT7C", "Overall": "1.0", "Content": "Horrible tablet will b returning it doesn't even run all of its own apps very disappointed guess u get what u pay for", "Title": "i wouldnt if i were u", "Date": "December 29, 2012"}, {"Author": "Allison", "ReviewID": "R3FNMNQJNMAF0Y", "Overall": "1.0", "Content": "I ordered two of these for my boys for Christmas, I thought this would be a wonderful Christmas gift.  I got these and immediately wanted to set them up for the boys.  We got them both set up and now I can't get one of them back on.  We have tried to charge it, but it still will not come on.  For $100 I figured I would get a good product the boys could both enjoy.  Now one of my boys has to wait for me to ship it and get a refund so i can go out to best buy and actually buy a tablet i know we can rely on.  This is the worst tablet I have ever seen, I am not happy with this at all.  I will let everyone know not to buy a Coby tablet.  I have used amazon in the past and my boyfriend orders stuff off amazon religiously, but now we are both very unsatisfied.  I do not plan on ordering from Amazon anymore.  I would rather pay the extra money to have a good product I know will be good.  This was a terrible experience I am not willing to take again.  VERY UNHAPPY customer.  :(  I will get a refund for the tablet and never shop on here again.  I thought we actually found an awesome website, but we can't trust it.", "Title": "BAD TABLET!!!", "Date": "December 27, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R3KP3RHH7PSL6T", "Overall": "1.0", "Content": "This product is poor. I bought this for my 9year old son thinking, it's not to spendy, I'll give it a try! I think many parents think the same. DON'T get it! Unless your child did something horrible and you want to punish them by severe disappointment!It has a sub par app store called, get jar. It has junk apps. You can't get google play off of it to make it better. I had to go to amazon and download their app store, it's ok but it's not google play.Getjar also doesn't have Netflix.Oh and by the way it's super buggy, it says if it won't turn on(and at some point it won't, take a paper clip to the reset button. Did that and it still wouldn't turn back on.)A working tablet is a must,having an app store that isn't junk also a must. If you just want to surf the web, watch YouTube or check email you may be happy with it, if it doesn't stop working. Oh, the fb app is junky too...We are Returning it  and spending  the extra money on a better tablet. Nexus 7 or a kindle fire hd.This is not worth the frustration. If I had the choose to buy this or have nothing,I would choose nothing. This is junk.", "Title": "Boo!", "Date": "December 27, 2012"}, {"Author": "tdawn_21", "ReviewID": "R2VPROCHJJ2GBH", "Overall": "1.0", "Content": "I bought two of these for my childrens Christmas.....they are a pieces of Trash.......I have worked all day trying to get an App to instal and nothing will work.....They ruined my childrens Christmas! They will be going back to the store as soon as we can get there!!!  I would NOT recommend any to buy these....Especially for a child Christmas gift...They are left disappointed on Cristmas Day!!!  Thanks COBY KYROS!!!!!!!!!!", "Title": "Piece of junk", "Date": "December 25, 2012"}, {"Author": "David B corman", "ReviewID": "RVQBFF2FT2O8E", "Overall": "1.0", "Content": "I did not listen to other reviews and bought this tablet....  DON'T!  Nothing about it works.  Very disappointed.  It will not connect to WiFi.  The apps are terrible.", "Title": "PIECE OF TRASH", "Date": "December 25, 2012"}, {"Author": "renee123", "ReviewID": "R3BPICFGMCIX9X", "Overall": "1.0", "Content": "This was not a good product I am very unhappy with it I will be calling soon to see if it is to late to return.Terrible!!!!!", "Title": "unsatisfied", "Date": "December 24, 2012"}, {"Author": "M. I. Sanosi", "ReviewID": "R3B7PF5QCX20X9", "Overall": "4.0", "Content": "it doesn't have a rear cameraam really disappointed other issueno Google playcannot view the catagure of external usb connected via OTG+ made in chinai would really know before i buy !other thing .. good appearing high quality nice eBook reader and support my language", "Title": "there is no rear camera !!", "Date": "December 19, 2012"}, {"Author": "Robin Blackburn", "ReviewID": "RZ5PWHU9D9SSI", "Overall": "1.0", "Content": "This is not a tablet you want to buy a waste of money you can't do much of anything on it I am thinking of returning mine to be honest", "Title": "Not what I thought it could do", "Date": "December 17, 2012"}, {"Author": "Edward Ernest", "ReviewID": "RUEBREAHILKA2", "Overall": "1.0", "Content": "The attraction to this device is the screen size and price, but right out of the box it was slow; add a few apps and it only gets slower.It is virtually unusable.", "Title": "Slow.", "Date": "September 25, 2012"}, {"Author": "katc", "ReviewID": "R132M6YYF5NKO4", "Overall": "1.0", "Content": "I am getting the word out about ALL Coby Kyros Tablet... they are a piece of crap and if it was not for me getting it as a anniversary gift for years at my company... i would NEVER buy a Coby Kyros Tables and NEVER recommend these tablets to a friend. They are a piece of crap and are not worth investing in getting one... so anyone who reads this pass it on to everyone you know not to buy a Coby Tablet because they stink like poop and I will pay the money for an iPad anyday before every thinking of getting this brand of tablet.... NO to COBY Tablets EVERYONE... DON'T BUY ONEI have the Coby Kyros MID1042", "Title": "COBY Tablets not worth the money", "Date": "December 7, 2012"}, {"Author": "John E Muniz", "ReviewID": "R2J41U0MCT5C4I", "Overall": "1.0", "Content": "Tablet was returned to seller, didn't use it.Credit was issued a few days later. It was not what I thought it would be like. It was too big for my likings, so I went with a 7\" tablet..", "Title": "10\" Tablet", "Date": "October 6, 2012"}, {"Author": "QUELI PEREZ", "ReviewID": "RMNZBTZWTVS27", "Overall": "3.0", "Content": "IT AN OK TABLET I REALLY EXPECTED SOMETHING A LITTLE BIT BETER...........ITS KIND OF LOW AND HAVE TO PRESS HARD SO IT CAN WORK", "Title": "OK TABLET", "Date": "June 11, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B0093XTHJK", "Features": null, "ImgURL": null, "Name": null}}