{"Reviews": [{"Title": "Great Deal on a Great Product!", "Author": "Amazon Customer", "ReviewID": "R2D25UYA6IR1MP", "Overall": "5.0", "Content": "Have to state this was the second of these I received. First one never should have gotten out the door.Good news here is the great Amazon return policy took it back, refunded my money with shipping almost immediately,and I was able to order this unit the next day for overnight delivery. Great job! No worries ordering this way again!The unit is as advertised. Plain box, the tablet in a bubble bag and a charger. No four color packaging,fancy manuals or start up guides. All that stuff you either throw out or misplace anyway!I charged this one enough to be sure it worked then took it down to the local Verizon store.They happily put in the SIM card, added it to my account (for a fee, of course) as \"customer supplied hardware\",and I was on the way home mapping our drive in 4G glory in about 30 minutes.If the store you are in tells you otherwise, find a different store. I have shopped around the three differentVerizon company stores in my area and this one is the best. Would they \"support\" it? Probably not, I didn't buy it there.They did send an email of \"congratulations on your new tablet\" with links for help on all the features!As for the tablet, I love it! Light, fast, great panel for my bad eyes. I had an original Xoom that met its endwith a water bottle accident. Thankfully I had bought \"the whatever happens it's covered\" warranty online. I didorder a TPU wrap like the original Xoom had on it.I got it on my home Wi-fi, input my Gmail account, then ran the OS upgrade. 30 minutes later, Ice Cream Sandwich! Haha!Configured the included Dijit app to take advantage the built in IR Blaster. Now I control my TV and Receiver from it.Installed \"Universal Remote\" to control my HTPC. Remote Potato for remote viewing. Hulu Plus, Amazon Prime,...andall those Angry Birds that need my help all over again!It was a bummer to lose my constant home digital companion but happy the way this worked out!!", "Date": "March 4, 2013"}, {"Title": "Best Android Tablet Out There", "Author": "J. Johns \"Music Fan\"", "ReviewID": "R2JH7ALXRB3C2L", "Overall": "5.0", "Content": "I tried a few other Android tablets before buying the Xyboard/Xoom.  The build quality, the functionality, the Gorilla  Glass and form factor a great tablet.  For half the price of an iPad and better quality than Samsung, ASUS or Acer, you can't go wrong.  Came with Ice Cream Sandwich installed.  The only negative is indoor photo quality.  Pics are mediocre unless taken outside.  I love this tablet.", "Date": "March 14, 2013"}, {"Title": "So much better than a Samsung", "Author": "Clayton", "ReviewID": "R13INRT630BGC4", "Overall": "5.0", "Content": "The materials, screen, sound, and multi-carrier LTE radio blows the Samsung Galaxy 3 away.  I do wish it had a micro SD card however.  Big miss there.", "Date": "January 16, 2013"}, {"Title": "all in all a good tablet", "Author": "Robby", "ReviewID": "R1SJJCPWBPJ9C3", "Overall": "5.0", "Content": "This tablet is very good for your money. You can spend more on a tablet like a nexus and it will be faster but you also get things from the XYboard that you would not get on others. It has an HDMI port on it which is really nice to have. It also has a sim card slot but no micro sd card slot. The battrey life is 2.5 to 3 hours o constant use with the screen brightness all the way down.  It is great for watching movies on and that sort of stuff. I would recommend it to a friend.The only negatives of this tablet are it is fairly slow, slower than my phone and if an app goes for too long or your browsing reddit for about an hour it will force close", "Date": "December 29, 2013"}, {"Title": "Good product", "Author": "Del", "ReviewID": "R27EM79SLOJM02", "Overall": "5.0", "Content": "Does everything I want it to do and more.  Connects to internet easily.  Wanted to expand the memory but you have to root the system.  Nice screen, and very bright.", "Date": "October 17, 2013"}, {"Title": "WOW. WOW AND MORE WOW.", "Author": "Antoine Q. Mahan \"ANTOINE Q. MAHAN\"", "ReviewID": "R4SPQCQPB5NTS", "Overall": "5.0", "Content": "NO THAT I HAVE IT HOOKED UP TO 4G LTE, THIS TABLET IS SO AMAZING... IT'S LITE AND UNIQUE AND I LOVE IT... THE FRONT BACK CAM IS AWESOME AND IT'S WAY WAY BETTER THAN THE IPAD AND ALL IT'S GENERATIONS... I RECOMMEND THIS TABLET...I AM TRULY ONE SATISFIED CUSTOMER... THANKS AMAZON...ANTOINE Q. MAHAN", "Date": "April 10, 2013"}, {"Title": "Garbage", "Author": "Jerry Duncan", "ReviewID": "R1FK6W130D000A", "Overall": "1.0", "Content": "Have owned one since they were released. Internet access is so slow. Sometimes takes several minutes to get a page. Crashes constantly and don't be surprised when it takes 10 to 15 seconds for the keyboard to respond.Battery life is ok. Speakers are on the back and it is very hard to hear anything, even at full volume. I would avoid this tablet no matter what it costs.", "Date": "September 4, 2013"}, {"Title": "Don't buy from Verizon", "Author": "coolguyace \"Aaron\"", "ReviewID": "RQBMWGT5QA1CO", "Overall": "5.0", "Content": "I bought this from Verizon, I thought I was getting a pretty good deal, until I found out Amazon now sells this for about $300. Ya, I paid about $300 for the tablet itself, but I also had to pay surcharges and $30 monthly for the 4G and 2GB of bandwidth. I have to have it for 6 months, so it ends up costing me about $550 after 6 months at least. And there's more. It cost I think around $70 to return the product because of stocking fees.About the tablet itself, I had it crash already. I can turn it off and back on and it works fine, but it does it occasionally when running the Youtube app. I think it's a great tablet for the price of $300, because I know that's about how much they charge for the Galaxy, which has a smaller screen than the XY Board.", "Date": "April 26, 2013"}, {"Title": "Great Value", "Author": "Jimmy M. Nichols", "ReviewID": "R1R6DZF4QLBJ88", "Overall": "3.0", "Content": "A great price for the tablet.  Although being replaced with a newer model, still a good buy.  I had problems with the device not being able to be connected to a Verizon account because it would not take a sim card.  Fortunately as a prime member I had free return shipping.  So if you plan to connect on 4G, check to make sure it will work before ordering.  It did work great on wifi.", "Date": "July 22, 2013"}, {"Title": "Xyboard", "Author": "SHERON COOK", "ReviewID": "R3SRSXJ1FLGENC", "Overall": "5.0", "Content": "I love my new droid xyboard. My daughter is having a great time using my tablet while we are away from home.", "Date": "February 11, 2013"}, {"Title": "Loved it", "Author": "mokman", "ReviewID": "R309OGD9QI0ARY", "Overall": "5.0", "Content": "However it was not compatible with ATT so I had to return it. I assumed 4G LTE was the same for everyone.", "Date": "April 3, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "MOTOROLA DROID XYBOARD 10.1 16GB VERIZON 4G LTE", "Name": "Motorola Droid XYBoard 10.1\" 16 GB Tablet MZ617-16 / Black - Non-Retail Packaging", "ImgURL": "http://ecx.images-amazon.com/images/I/41lktZC2nCL._SY300_.jpg", "ProductID": "B00AC788TG"}}