{"Reviews": [{"Title": "Not a B & N fan", "Author": "David", "ReviewID": "R1C8ONUN83ZUY6", "Overall": "5.0", "Content": "Using this tablet with a N2A Android chip is a great way to goA N2A chip installed, basically turns thie B & N tablet into a full blown Android tablet allowing for Google Play free apps and all that, as a full android tablet, yes, this is a nice tablet", "Date": "March 21, 2013"}, {"Title": "Perfect tablet, I have two of them.", "Author": "Athir HAtem", "ReviewID": "R34CPGZ1W1HMIQ", "Overall": "5.0", "Content": "It's really good tablet for adults and kids, I can't believe the price is $108 it should be over $150.Fast processing (works faster than Samsung galaxy tab).Nice touch.Perfect speakers.The interface well designed.Fast internet browsing.Fast youtube streaming.No camera.No GPS.", "Date": "July 29, 2013"}, {"Title": "Product is a nice as described!", "Author": "Mom of 3", "ReviewID": "R36HVSM2C5NKMH", "Overall": "5.0", "Content": "After months of indecision for a color e-reader, I opted for this Nook HD. Excellent for magazines which my Nook Simple was not well suited for. This device is a great value for what it delivers. An ipad, even 1st gen, would have been a big overspend for my needs. Item was as described and shipped to me in time estimated.", "Date": "April 15, 2013"}, {"Title": "Surprisingly comfortable reading", "Author": "Malaryn", "ReviewID": "R3MLFLAUV8IRQM", "Overall": "5.0", "Content": "Purchased tablet to read on long commuter trips. Using it more to read, check e-mail, surf the web in bed before going to sleep. Display is adjustable to light levels and crystal clear.  Only wish is that it was able to access the Internet on wider level like cell phones. Have downloaded free books very easily.  I'm very pleased with the NOOK HD.", "Date": "August 4, 2013"}, {"Title": "One of best tablets Available", "Author": "Philip A. Rowe, Jr.", "ReviewID": "R21SVWM23252", "Overall": "4.0", "Content": "Works great !  Beats my older ZTpad for sure.  Would recommend this unit without question.Handy for eMail checking and weather info.", "Date": "October 31, 2013"}, {"Title": "Nook HD is a good tablet", "Author": "doonyf", "ReviewID": "R17DBCPPU6IY3I", "Overall": "5.0", "Content": "The Nook HD is a very good 7\" tablet.  The screen is great.  With Google Play, you can download apps easily.  The only drawback that I've encountered is that apps can't be sideloaded because of the customized Android OS.  You can make it a true Android tablet with a N2A card that can be purchased on the internet.", "Date": "November 3, 2013"}, {"Title": "Great Product, Great Sale.", "Author": "2Blessed4Stress \"Angel\"", "ReviewID": "R2UC4CLK10JQAS", "Overall": "5.0", "Content": "Quality Product, Great Buy, Im so happy I purchased this Item my children are going to love it as a gift. I know they are because I love it.", "Date": "November 26, 2013"}, {"Title": "AMAZING!!!", "Author": "Phyllis Mowrey", "ReviewID": "R39C1UQNLMR4FO", "Overall": "5.0", "Content": "Amazing I absolutley love this product it came fast and was in its original box for $85 what a great deal it also came with a nook case that was perfect!!", "Date": "November 13, 2013"}, {"Title": "Bought as a gift", "Author": "Jen", "ReviewID": "R2R636YRVXXAAM", "Overall": "4.0", "Content": "I bought this as a gift for a friend and was looking to replace her E reader and also wanted her to be able to surf the web if she wanted.  The Nook is great and easy to use.  However, my order guide, email and package all said it was Slate, but actually came to us in White.  Not a big deal, but would rather have Slate.", "Date": "January 2, 2014"}, {"Title": "One of the best value propositions in the Tablet world...yes it is a little outdated but hear me out", "Author": "Bo \"sam\"", "ReviewID": "RY81CT74W3YDY", "Overall": "5.0", "Content": "I've owned an iPad 2G, 3G, Air, and Nexus 7. I am sure that the Nexus 7 2013 version is a better overall device but that device lost my trust early. I bought the 1st Gen Asus Nexus 7, which had some horrible build quality issues with the screen popping out. I assume they corrected that on the second generation; however, it was too distracting for me as a consumer who shelled out $229. They lost me with that, regardless of the internal specs in the latest version. After selling that off I got the Nook HD for $80 brand new/open box. The HD+ looked like an awesome deal as well, but I wanted a smaller screen.This is a value propositions. What you pay for and what you get. Today, everyone is infatuated with internal specs, cameras, etc. that they fail to see the beauty in Hardware design of the Nook. This is an extremely comfortable device to hold in your hand. It's very smooth and also has a groove on the back to more naturally fit the contours of your hand. It is something you have to hold yourself to really get it; the other 7 inch tablets won't get a similar feel without using a case. The screen is gorgeous for a sub $100 tablet (be a vigilant buyer, you'll find deals). Any other tablet in this range will have 1280 x 800 resolution but this boasts 1400 x 900. 1GB of RAM will allow you to have multiple apps open, read, watch movies, go on Facebook, etc; However, unless you are using some task killers and RAM boosters you'll find this catches up somewhat quickly and will slow you down. Just be smart in your use and keep an eye on it.You have access to Google Play, and most (but not all) apps on this device will work. Some personal recommendations are Feedly Reader, Flipbook, Facebook, Facebook Messenger, Flickr, and Accuweather.This is an amazing reader. You can load epubs, movies, and magazines on it as you desire. Give it a shot!", "Date": "May 8, 2014"}, {"Title": ":)", "Author": "cooler", "ReviewID": "R1JZRVELCCECZ0", "Overall": "4.0", "Content": "I have 2 of these I bought them for a 4 and 5 year old they love them easy to set up I did not have to put in my credit card so I don't have to worry about them buying anything....the only thing that I don't like is that it doesn't have a camera", "Date": "January 13, 2014"}, {"Title": "Voice technology", "Author": "Chelle", "ReviewID": "RCIWH6C1EJVWW", "Overall": "2.0", "Content": "We bought as a gift this for our aging Mom who has diminished vision. We were told the voice reading feature was terrific and that is 100% what prompted our purchase.Unfortunately, the person could not demo this tablet for us in store because they were out of stock. She told use to go home and buy it online, as we did. The voice quality is very poor, stilted, hesitant and has no inflection. More personality is available on elevator directions. Needless to say, we are so disappointed that Mom, who was a avid reader- is still unable to enjoy a book at her convenience.", "Date": "January 7, 2014"}, {"Title": "The Greatest.", "Author": "Boni", "ReviewID": "R2LP5BZZ7ODL2H", "Overall": "5.0", "Content": "I had an old Nook, and always loved it for reading. The HD is amazing, and so much more.Great price!", "Date": "November 5, 2013"}, {"Title": "My first e-reader", "Author": "Mohammad H AlRamdan", "ReviewID": "R3RWIMERYNQOLZ", "Overall": "4.0", "Content": "This product is my first tablet and e-reader and believe me, you would love it as both. You would love it even more as an E-reader. the screen is great and it's well designed. You may see it ugly in the first beginning comparing to some other tablets. However, you will probably change your mind in the few next seconds. The OS is easy to use and had no bugs or crushes, it is not that beautiful but it does what it should do, especially if you take this tables as an e-reader in the first place. Notice that you will update your tablet twice. The first one will be done automatically when you first start the nook. The second updating is going to be manually, on the notification bar. By the way, I loved the notification bar and the way they divided it to three parts. You wouldn't regret buying the product.", "Date": "August 25, 2013"}, {"Title": "LOVE", "Author": "Natalie V. Galasso", "ReviewID": "R3MKXJ9FF66GZQ", "Overall": "5.0", "Content": "With all the tablets and apps out we don't really need EReaders anymore.  I am not exactly sure why I wanted a e reader.  I mean,  I have a iPod, iPad, Kindle, Regular Nook,  iPad Mini,  iPhone, Blackberry Playbook.I decided to sell my Kindle Fire and my previous Color nook tablet and upgrade to the snow nook HD and its beautiful,  it also has google apps on here now so we can get a lot of android apps, including the AHEM// Kindle app.I like the nook friends and borrowing books options as well as how clean the OS is.", "Date": "December 1, 2013"}, {"Title": "First time NOOKer", "Author": "Faith", "ReviewID": "RXD9HVVZEX1X3", "Overall": "5.0", "Content": "OH MY GOODNESS!  I own and have been using Dell computers, Dell laptops, MacBook Pro Laptops, and iPads.  I use the Dell laptop, MacBook Pro laptop, and iPad frequently.  I thought about the NOOK a year ago but I was concerned about what it could do because I wanted to do more than merely read books so I didn't take the leap.  I have two email accounts, I use facebook, twitter and other applications.  I started to purchase a MacBook Pro laptop a few months and then I decided to purchase an iPad.  I changed my mind and didn't purchase either.  So I continued to use my iPad and my Dell laptop and read books.  My mother recommended I started using a NOOK to read books late at night. HUH?  Stop using my books?  I love my books!  Call me old fashion but I love my books and turning pages.  I wasn't that enthusiastic about this change until I received this NOOK in the mail several days before the promised date :-).  OH MY!  Holy Moly Donut Shop!  I can read books and everything is in color.  I can easily maneuver throughout my NOOK without any problems.  It is totally user friendly. Friends can lend me books in addition to me purchasing books.  I can use both of my email accounts, Twitter, and Facebook easily. I LOVE IT! I'm so glad I made this transformation. Even though I still adore and will use my Samsung Galaxy Note II - because it is my cellular phone - this NOOK is faster than it.  I love this NOOK and to find it at this price is remarkable.  Thank you Amazon and Barnes and Noble.  If you do not have a NOOK and you like to read books more than anything else......NOOK it!", "Date": "September 26, 2013"}, {"Title": "Poor customer service", "Author": "Keosha King", "ReviewID": "R19L5WMGUSA48B", "Overall": "4.0", "Content": "LOVE my nooks, but disappointed with the distributor. One of my nooks the charging port stop working I contacted B&N; they stated that the warranty was expired and I bought both nooks NEWVnovember 2013. The distributor stated to me that it's no longer there problem and they don't know why B&N; is telling me this.", "Date": "May 7, 2014"}, {"Title": "refurbished?????", "Author": "blake wingfield", "ReviewID": "R25BC9KEOR0YCB", "Overall": "3.0", "Content": "when I received this it had refurbished stickers all over it...which made me mad. and when I bought it off amazon the add said nothing about it being refurbished...false advertising", "Date": "March 23, 2014"}, {"Title": "My Wife Loves It", "Author": "darrenk321", "ReviewID": "R33F52GAI3FW0Q", "Overall": "5.0", "Content": "This purse-sized tablet is almost like having a desk top computer you can carry in where ever you go, and it works great!!", "Date": "March 8, 2014"}, {"Title": "freezes. unresponsive. not happy.", "Author": "Erika Assebbane", "ReviewID": "R1W897FPICTVKX", "Overall": "1.0", "Content": "I bought this tablet for my daughter to stream neflix so I wasn't expecting  much but this thing keeps freezing. Reset I've done. She gets frustrated everytime it does it (I'm mad at this point).  Don't buy from buyspry. You'll get no help from them. I should have just gotten a kindle but I was attracted by the android os and its market place.", "Date": "February 21, 2014"}, {"Title": "Very nice", "Author": "F. Fusager \"fus\"", "ReviewID": "R15OWRO05S2FU7", "Overall": "4.0", "Content": "Light and thin, not flashy but pleasing for the eyes and hands. Beautiful picture and plenty fast for my needs (I also have a 10\"). This is so much nicer than what I expected for this little. I was planning to get the new Nexus for $ 275 when this showed up for $105. Big duh. It even has a SD slot. I installed the Nova app and will leave it at that.", "Date": "October 21, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AGBS1PY"}}