{"Reviews": [{"Title": "RUN!!!! DON'T BUY THIS.....", "Author": "Thickness33", "ReviewID": "R2RDA9DIMJRSGC", "Overall": "1.0", "Content": "I purchased this tablet on Black Friday & got it at the beginning of December. A few weeks later it stopped charging & every since then I've been trying to reach DoublePower via phone (line is ALWAYS busy & the VM is ALWAYS FULL) & via email with no response. Their website says there's a 1 year warranty; however, it's impossible to reach them for any assistance. I've even went so far as filing a BBB complaint, which they never responded to so there's a consumer complaint on their file & I'm sure mine isn't the only one. I now have been unable to use this tablet for over 2 months & am stuck with it!!!", "Date": "February 27, 2013"}, {"Title": "You Get What You Pay For", "Author": "jstpshply", "ReviewID": "R27QOLEQVMASFI", "Overall": "1.0", "Content": "Purchased as a Christmas gift for 10 year old on Cyber Monday for $59. The gift was given early January (along with a protective case). Within a few weeks the unit stopped working, displaying only a blank white screen. In contacting the company, DoublePowerTech.com, I was informed:\"There will be a labor fee $ 50 to fix it since we offer one year warranty on parts on 90 days on labor. We accept money order or check payable to Double Power Technology or any credit/debit card.\"Seriously? They didn't even know what was wrong with it. Poor, poor, poor customer service. Stay away. Stay far, far away. Pay the extra for quality.", "Date": "April 8, 2013"}, {"Title": "A GREAT TABLET - VERY VERSATILE", "Author": "Bill", "ReviewID": "RX7VVZTMNEPY4", "Overall": "5.0", "Content": "The tablet has been used for school and for watching Netflix and Hulu as well as Skype with the front camera. Speakers are good too. All in all, the tablet has done a great job. It's really nice to that you can expand it up to 32 GB.", "Date": "March 20, 2013"}, {"Title": "Don't buy this.", "Author": "Regina Klosterman", "ReviewID": "R1IRMKIGTP43RJ", "Overall": "1.0", "Content": "The battery life is non-existent, and it is often laggy. The browser is so slow as to be almost useless. The lack of responsiveness near the edges of the screen means it is practically impossible at times to close a browser window, select the address bar, or switch to another tab. It's not powerful enough to run the good games (Sims Freeplay, etc). Over all, it's craptastic. Save your money for something better.", "Date": "June 8, 2013"}, {"Title": "Horrible...So disappointed and frustrated", "Author": "Iheartdeals", "ReviewID": "R1GDT637SVNBAC", "Overall": "1.0", "Content": "I purchased this for my daughter as a Christmas present.  It only worked for the 1st day.  Thereafter it keeps turning off by itself.  I read several reviews by several different retailers, so I did my homework... 1/2 people love it and says it works great the other 1/2 hate it because it doesn't work at all.  I took a chance and lost. I would not recommend anyone to purchase this, especially as a gift. You shouldn't have to gamble on electronics... Buyer Beware!!!", "Date": "December 30, 2012"}, {"Title": "Good price tablet", "Author": "JustTheFacts", "ReviewID": "RN8KOV66DX2PW", "Overall": "1.0", "Content": "PROS:- Nice size 7\" tablet measures exactly 196mm x 122mm.- Installed tons of free apps & games from Google Android store.- Good overall performance and speed.- Front facing camera (there is NO back camera) is clear.- Android OS installed works well as expected.- Speaker is clear & sufficient for most uses. Has headphone jacks for privacy.- Has SD card slot for memory expansion.- wi-fi works out of the box, fast & very easy to use.CONS:- Slippery casing made of hard plastic. Feels like a toy.- Standby battery is horrible. 100% in standby went to 79% in 1 day, to 14% in 2 days, in standby with screen off.- The hardkey HOME button's only function is to navigate you back to the Center 'home' page. No other function is available. To turn on/off, bring out of standby, you need to press the POWER button on top of device.- Special charger with a circular 2mm jack. Ability to charge from the usb cable would have been great.- Not a popular brand so hard to find accessories for it, like a case. I purchased a Nexus 7 case since the specs were closest to this device.I bought this from a 'mart' store on black friday 2012 for a good price.It's a good device overall. As a present for my 8 year old, it's perfect. Lowest cost 7\" tablet I could find and easier to handle vs a 10\" tablet. He use to have an ipod touch 4g, but now needs to wear glasses. There are many factors but I'm sure the small ipod touch screen and staring at it for hours at a time contributed to his bad vision. This 7\" is a lot easier on the eyes, yet not too difficult to carry out of the house. Hope the reliability is good. All the ipod touches we owned lasted years with no issues, but that's Apple. Double Power, crossing my fingers.I currently own a LePan 10\" tablet. It's far superior to this tablet, but I do want a 7\" tablet now since it's lighter & easier to carry around. For me, I'm looking at a Nexus 7 or Galaxy tablet. They seem far superior in quality and relibility.*****************  UPDATE  Sept 2013  ******************************************My Double Power Tablet stopped working after 6 months. 1/4 of the screen was dead rendering the entire unit basically useless.  Changed from 4 stars to 1 star. Not recommended.", "Date": "December 13, 2012"}, {"Title": "good tablet", "Author": "Hd fan", "ReviewID": "R1HOVY6V8O980J", "Overall": "4.0", "Content": "i bought a Double Power t-708 & it is very good. not one problem.  good battery life, bright screen, does almost everything my computer does.  the t-711 is even better.  great apps & games.", "Date": "November 29, 2012"}, {"Title": "PRETTY GOOD CHEAP TABLET", "Author": "Denita", "ReviewID": "RKRSJV49AUMRX", "Overall": "5.0", "Content": "I LOVE this tablet i got it for a early Christmas present. I have had 3 other Tablets and had to return them because they where crap. this tablet lets you get apps from google play store and the andriod market as well as appbrain. all the games and software that i have downloaded has worked for me i even have Kindle on the tablet so compared to paying 199 for a kindle my tablet was bought for 79.00 and do just as good as some of the high price tablets on the market. one problem is that if its updating its best to let it update your apps and software then do what you want to do because it will lag. but once the updates are done its runs great. i watch tv and video in hd on mines i just love it its a cheapy and a keepy . hope you enjoy yours as much as i do mines.", "Date": "December 29, 2012"}, {"Title": "For the price...it's OK...but...", "Author": "P. James \"FutureMon\"", "ReviewID": "R19CE93YCU6MS8", "Overall": "3.0", "Content": "The battery life leaves a bit to be desired.  Brand new out of the box and fully charged it runs out of juice after only about an hour of playing Angry Birds (which FYI is a bit laggy on this tablet as well).  Package said it has a 3000MAh battery which should give lots of life.  Perhaps it actually isn't because it fully charges in less than an hour as well...Bought this as a replacement for my 4 year old son who sat on his last one and broke the screen.  For the price, it's OK... Better than not having anything at all and much easier on the wallet if he sits on this one too... :)I did purchase the 2 year warranty on it just in case.Oh and one last note; System settings shows only 2GB of memory...not 4gb....and the 512MB used for the Android OS will get used up by at least half by the base Android OS, so you'll effectively only have about 256 MB to run apps on...hence the \"lag\".", "Date": "August 28, 2013"}, {"Title": "Really good tablet", "Author": "Zebra", "ReviewID": "R1J6IYOO4ZIM38", "Overall": "5.0", "Content": "This is the best tablet ever I really love it so I tell you to get this tablet it's also good for kids because the plastic", "Date": "February 2, 2013"}, {"Title": "Wish I read reviews prior to buying", "Author": "Amazon Customer", "ReviewID": "R2AMPJAPBIZ570", "Overall": "1.0", "Content": "Tablet is two months old. I  received  it Fri. after Christmas and port no longer charges. I just brought another cable and discoveredthat is not the problem. From the reviews I will not try to get it fixed just look at it as you get what you pay for !", "Date": "February 24, 2014"}, {"Title": "Piece of junk", "Author": "Venkata Gadepalli", "ReviewID": "R7VCOXBLWEOIY", "Overall": "1.0", "Content": "Useless piece of junk.  Keeps dropping connection if and when it connects.  Would suggest to save your money and buy something better", "Date": "January 26, 2014"}, {"Title": "MINE STOPPED WORKING AFTER 1MONTH!!!", "Author": "patti", "ReviewID": "R7TQ1JIIRRJ0L", "Overall": "1.0", "Content": "Bought this as xmas present for child who loved having something interactive to keep him occupied.Yesterday it refused to connect to wireless. Then today it wont come on. I have hit the reset button among other suggestions provided on online forums in vain.Please spend money on a different product with better customer service. I know I will!", "Date": "January 23, 2014"}, {"Title": "Very cheaply made please don't purchase", "Author": "Dianne P. Smith", "ReviewID": "R2PF73FKD6V033", "Overall": "1.0", "Content": "After only 6 months of very little use, the inside charger port broke, and now unable to charge the unit at all.  Called DOPO customer service and they would fix the tablet if I mailed it to them and paid $40.00 for the repair.  Well I have read all of the awlful reviews about this product and ask them why they would not repair this item for free since everyone is having the same problem.  No reply, just stated to pay the $40.00, which is more than this product is worth now.  Spend a little more money and purchase a good tablet, make sure to read all reviews, especially regarding these charging ports.", "Date": "September 30, 2013"}, {"Title": "Decent for the price", "Author": "Amazon Customer", "ReviewID": "R3MQ5QF77EEJTS", "Overall": "3.0", "Content": "I bought this tablet on a Black Friday sale,so I was able to get a good deal.  Overall, I wish I had spent more money (even double) and gotten a better tablet.  My kids do not enjoy it because if it has been used at all, it will not have enough battery left to play a game, watch Netflix, etc.  Even on a fresh charge, I would say it goes for about 1 to 1.5 hours max.  Also, just annoying, but when it is plugged in there is no \"assurance\" light that lets you know that it is indeed charging.  When taking it on a road trip, we misplaced the charger.  It is an odd sized charger and no one carries it.  Radio Shack can put together two plugs to make it work...at a cost of thirty dollars.  I ordered an off brand plug that I hope fits it, but haven't received it.  Even that was twelve dollars.  If you can afford it all, get a better device.", "Date": "August 26, 2013"}, {"Title": "Battery going,going,gone", "Author": "db", "ReviewID": "RLGXUQ37DHX22", "Overall": "1.0", "Content": "Black Friday deal that was fine for a month for moderate to low use. Then the use on battery kept getting shorter and shorter. Down to 1/2 hour after only two months and losing about 5 minutes each time it's taken off the charger.", "Date": "March 2, 2013"}, {"Title": "T711 tablet", "Author": "CASHINA", "ReviewID": "R36DDKVMI2DXHE", "Overall": "1.0", "Content": "I bought this tablet for my daughter for Christmas and I am having a hard time getting  online ....i have all of my other tablets and  laptop on line with no problems but this tablet is a pice of work....you touch one thing on the screen and it takes you some were else, I hate this tablet and I recommend that if you are thinking about buying this tablet don't buy you will be making the biggest mistake of your life.", "Date": "December 27, 2012"}, {"Title": "problems with games", "Author": "german", "ReviewID": "R3FHNK4BYEO7PK", "Overall": "2.0", "Content": "Purchased the t711 for both of my kids on cyber Monday. was a good price, but you get what you pay for. Installed angry bird from the Google play store just to find out that you can't open the games afterwards even though the installation was successful. Was in contact with Google play store and they checked everything out on there end and stated that it's the device. The description said that it is compatible with angry birds but it is not. Now we're stuck with two tablets and the kids can not even play some of their favorite games on it. I wish I would have spend the extra money.", "Date": "May 12, 2013"}, {"Title": "decent tablet for the money", "Author": "grimnir", "ReviewID": "R27IRMC43ZAMMD", "Overall": "3.0", "Content": "I picked this up for 60 buck online, and i got out of it what i expected. For the most part, it is a decent little tablet. It is very lightweight, with expandable memory card slot( which was  a necesity for me).  The touch screen isn't the greatest compared to other products, but for the cost I cannot complain. I have been using this for a few months now and havent noticed any problems with the battery life as some others have. Some apps will not work with this tablet unfortunately, but most do.I mainly use this for netflix and streaming the radio, as well as checking facebook and whatnot. If you are looking for something to do serious gaming with, look elsewhere, but if you are a casual user this is great.", "Date": "April 24, 2013"}, {"Title": "NO STARS but Amazon won't allow no stars for review apparently", "Author": "C.G.", "ReviewID": "R2KQRF963Q39WS", "Overall": "1.0", "Content": "I bought this for my Son this Christmas. Worked for 1 day. I bought screen protector & a nook silicone tablet case since there isn't any protection made for this tablet.However, my Son sat in front of me & used it for about 2 hrs. & we had to charge it. I used the charger that came with it & charged it for 5 hrs. like the manual says to. It would not turn on after charge. Just a flash of the boot screen. So I push the reset button as manual instructs & NOTHING...returning product today!Have called customer service twice. They are \"too busy\" to actually talk to me. NO SURPRISE THERE!!!Recorded message says to leave info. & they will contact me. They never did.DO NOT BUY THIS TABLET!", "Date": "December 31, 2012"}, {"Title": "kids love them", "Author": "Hans Oriol", "ReviewID": "R2SH8ILLNL2GVS", "Overall": "4.0", "Content": "Great product for kids if you don't want to get them an iPad. Does the same.Good job for creating this product!", "Date": "March 3, 2013"}, {"Title": "Very low quality", "Author": "Michael", "ReviewID": "RS7BCKEAPILG3", "Overall": "1.0", "Content": "This tablet is very cheap looking and low quality. Display is very small and feel it not last long!! I would rather spend 20$ more.", "Date": "February 5, 2013"}, {"Title": "Buyer Beware", "Author": "andres", "ReviewID": "R3I6IGU187YZZ6", "Overall": "2.0", "Content": "Good screen, and access to apps. HOWEVER. I bought 3 of these for my kids to stop using my phone. some apps work, some dont. Good Luck trying to call their customer support. Which 800 help line you know is always busy and never has live operator to pick up call? I tried to call, cant even leave a message on their answering machine. No help whatsoever.", "Date": "January 3, 2013"}, {"Title": "Great tablet...", "Author": "kaneandky", "ReviewID": "R22KCS8R6R3HRW", "Overall": "5.0", "Content": "We ordered this for our 5 year old and it was a great tablet until he left it under the rug and the screen got cracked. We then ordered another tablet by another company and had to send it back because it was junk.  I liked this one so much that I ended up just ordering him another one...  The touch screen is wonderful for a cheaper tablet and  he is able to put plenty of games on it.", "Date": "August 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AU7SZBE"}}