{"Reviews": [{"Author": "NSB", "ReviewID": "R2J6OMRETQRH25", "Overall": "4.0", "Content": "Ok. We bought this tablet for our daughter for Christmas. She always plays with my Samsung Galaxy Skyrocket so this will be a nice device for her so I can have my phone back. LOLHere is our review of the Ematic Funtab (Purple/Pink):1) This is NOT an iPad or high priced tablet. This tablet is perfect for the age demographic (youth).2) You MUST set-up the wifi before you can do anything. If you already operate an Android you should have no problem setting up the wifi.3) The screen isn't as sensitive to touch and often times when typing the letters/numbers I touched it didn't exactly respond to the selection I was touching and I had to touch it again.4) The wifi connection did drop once but has since not happened again.5) The Zoodles app works perfectly along with all the other pre-installed apps.Lastly, Google Play Store is NOT pre-installed on the tablet. Which is a fail, however, there is a workaround. You will have to download the app via connection to your laptop/desktop.Amazon Appstore, however, can be downloaded directly to the tablet and has the same apps as Google Play Store with a plus of the \"Free App\" of the day feature.Overall, my husband and I so far love this tablet (especially compared to the Nook Color we also got her but returned once we go the Ematic Funtab) for her. It's perfect for her age, 6.5 yrs, but still has the functionality, feel and operating system of the expensive tablets.", "Title": "Good Tablet for Children", "Date": "December 6, 2012"}, {"Author": "Linda Knapik \"internet shopaholic\"", "ReviewID": "RJUVY2EY036TV", "Overall": "1.0", "Content": "I bought this tablet for my grandson.  3 weeks later it stops charging.  I contacted Amazon and was told it was a \"3rd party\" sale.  Ok, so I contacted the seller and after spending $14 in shipping to return the defective tablet, received a replacement 2 weeks later.  This replacement tablet would not charge at all.  It would only turn on if it was plugged in at the same time you turned it on.  It is at this point I realize there are pictures of other people on the tablet and it has another child's name on the screen that it had been setup for.  I assume this \"refurb\" was just a defective model that \"Jake's\" parents had already sent back and was reshipped to me as my replacement.  I again contact customer service at ACTION GEAR and he tells me that he will personally check the next one that goes out after I return the 2nd defective model.  Again I spend another $14 to ship this item to ACTION GEAR and wait 2 weeks to get a replacement - I eagerly open the box to charge it up and a piece of plastic falls to the floor when I take it out of the box.  Yup, it's the on/off button.  I give up, I'm not spending another $14 to ship this crap back to the same crook that sends out this garbage in the first place.I paid $99 for a product described as new and every one of these tablets came with some other families pictures on it.  This is the cut and paste from my account:Items Ordered  Price1 of: Ematic FunTab 4GB 7 Multi-Touch Screen Kids Tablet with Android 4.0 (Blue and Green) [Personal Computers]Condition: NewSold by: Action Gear (seller profile) $99.99Bottom Line:  BEWARE", "Title": "Cheap tablet ~ dishonest customer service - REFURBS sold as new", "Date": "July 22, 2013"}, {"Author": "Srjrn", "ReviewID": "R3JUASP1UFBV2D", "Overall": "4.0", "Content": "I read the reviews before I purchased this for my 5 yr old grand-daughter that loves to play games on my iPhone. I almost didn't order it due to the negative reviews!!! I got it yesterday!  Charged it and this morning I was so thrilled with this product!  I live in a rural area with no wifi! Unless I go to McDonald's haha!!' but, this tablet has over 25 built in apps like angy birds, cut the rope, any smasher, kids abcs, kids animal planet, kids phobics, connect the dot, kids numbers, squabble art, front and back camera and more!! She will b thrilled with what is on it now and we will b able to get iBooks and other apps when we go to a wifi location!!!! Sioohappt that I got this because it is made for kids and the graphics and screens are beautiful ' the touch screen works fine! My 62 yr old husband with no computer background played games with no problem!! Don't hesitate... Order", "Title": "Shew! So relieved!", "Date": "December 18, 2012"}, {"Author": "Attezor", "ReviewID": "R2NTZNMWGC7Z86", "Overall": "3.0", "Content": "EMATIC FUNTABI bought this tablet for my 2 year old daughter. I set it up prior to giving it to her. It was fairly simple. Switching screens from kid mode to mommy mode is a little confusing at first. I found myself \" lost \" a few times. The preloaded apps are nice, and it was fairly simple to put everything else I wanted on it. Which wasn't much, considering the age of my daughter.  The tablet is fast, but dropped wifi a few times. Over all I didn't have any problems with it.It doesn't come with a case, but it has grips on either side that are a nice addition.Kid safe? Nope. Screen broke in a couple of weeks. The glass and the LCD both shattered. The glass and the LCD broke from a 1 1/2 foot drop onto plush carpet. The point of impact was the upper right hand corner, it shattered clear across the screen.I didn't buy this tablet from amazon, and the place I bought it from didn't fulfill the warranty. This isn't the tablets fault obviously, but beware of that if you buy it some place else.  I emailed ematic (3 times) to see if they could fix it for a charge, or if it was covered by some sort of manufactures warranty. It's been a few months and I'm still waiting for a response. Talking to a local shop that repairs screens, they quoted 95$. I paid $50.00 for this tablet the day after thanksgiving.The price of this tablet is great. I'm not sure why the blue is so much more than the pink though.Other than the broken screen, which happens, this is a nice tablet for a child.*******************************************************Nabi 2I bought this tablet (nabi 2) for my 3 year old son. I set it up prior to giving it to him. Set up was easy, \" mommy mode \" is brilliant. The tablet is fast and reliable. I had zero problems with movies and apps. I was able to upload every app I wanted too and make it \" perfect \" in a few hours.One thing I didn't like was that some apps can't be removed from the child screen, and they need to be purchased to play past the trial. The child can't accidental buy anything, but it caused a couple of head aches.The case is thick and easy to grip. We received the alphabet pack as a free gift when we ordered it. Those are also great, my son really enjoyed them.***Kid safe? Not a chance. The screen was broke with in a week. The glass and the LCD broke when my son was playing with the preloaded drum set app. He was hitting the screen with his fingers, having a crazy amount of fun... until it broke. He wasn't hitting it very hard, but apparently hard enough. Nabi will replace the screen for around $80.00, if you don't have a warranty to cover the cost.I read rave reviews for this tablet before I purchased it, perhaps ours was just unlucky.***********************************************************My children are obviously young, they are just starting out with electronics. They were supervised while playing with both the Nabi and funtab. There was no abuse, or rough play with them. They didn't have them long enough for rough play. They broke from pure accidents. An older child might not have the same issues we had with the screens at all.I waited for my son to get a little older and gave him my old Coby Kyros 9.7 inch to play with. It's been six months and the screen is still intact. It was fairly easy to child proof. We don't have a problem with him clicking adds, going to any website let alone an inappropriate one, or buying anything. I simply blocked the Wifi and browsers. He hasn't found his way into the settings or anything like that. (yet) Its far to slow for me, but to use it for the things my son likes to do ( movies, learning apps, low graphic games) it's pretty great.Over all, no tablet is kid safe. No magic screen that won't break. Both kid tablets had in app purchases I couldn't hide. Even if the screens didn't break on the first two tablets, I didn't find anything so special about \"mommy mode\" to pay the extra money for it.", "Title": "Kid safe? Vrs Nabi 2 Vrs Coby Kyros", "Date": "July 17, 2013"}, {"Author": "Sanchia", "ReviewID": "R33KSIQ4B1HBGX", "Overall": "1.0", "Content": "When my daughter first got she loved it. But the quality of item is poor 1st the volume button broke and then the power so she has no way of turning it on know.  I am very disappointed try to return it not luck. I would recommend it anyone the Nabi is the better way to go.", "Title": "Very disappointed", "Date": "October 18, 2013"}, {"Author": "Edith Jordan", "ReviewID": "R2J4HGTIIY5X2C", "Overall": "5.0", "Content": "This Ematic is great.My daughter is learning a lot on it & she's  only 4 years old.Where both learning things on it.", "Title": "Wasted to much time trying to soming different than her cousin had.But I was wrong!", "Date": "January 18, 2013"}, {"Author": "Cathy Strahle", "ReviewID": "R34CWAYRK608HT", "Overall": "1.0", "Content": "The white button for the off and on switch fell off and the tablet freezes on you from time to time.  It is hard to contact customer service for this company for this tablet.", "Title": "Not too happy", "Date": "June 1, 2013"}, {"Author": "Shawn", "ReviewID": "R22IFWHR98VLZC", "Overall": "5.0", "Content": "More than pleased with the tablet.exactly what I thought it would be plenty of preloaded apps and games. My grandson took to it immediately. So much so his brother wants one as well", "Title": "wonderful", "Date": "May 1, 2013"}, {"Author": "Viviana C Escudero", "ReviewID": "R172PI1SD0QY1C", "Overall": "1.0", "Content": "I bought two for my daughters. One lasted a day and broke the other less than a month very low quality!", "Title": "Not recomended", "Date": "October 5, 2013"}, {"Author": "madix", "ReviewID": "R3VHDG380A2SHS", "Overall": "1.0", "Content": "We bought this for our daughter for her 7th birthday, thinking it would be great for her, since it's a \"kids\" tablet.  It worked for a week.  After a week, the charger would no longer plug in, it was just loose in the hole.  So, I went on their website to contact their customer service.  I couldn't find a phone number, so I clicked on the \"Contact Support\" tab.  I filled out the form, and submitted my info.  After submission, it said I would be contacted in 1 business day.  Nothing.  After a week, I contacted them again.  Nothing.  So, yesterday, I went back to the website, found another support tab and emailed again about my 2 previous attempts at contact and asked for at least some kind of answer as to why I hadn't heard anything.  I get an email this morning with the most nasty tone I've ever read.  I was told that I should pay more attention to what I click on and read and fill out because my requests were just ignored because I was filling out the \"business\" forms.  Nowhere on the forms did it say \"business\" or \"commercial\".  Needless to say, this company will never get my business again, and my child will get another tablet.  For the headache that the customer service caused me, it has turned me off to all of their products.", "Title": "Worked great...for a week, and the customer service is the worst", "Date": "October 24, 2013"}, {"Author": "Christie Van Tassell", "ReviewID": "R17RZDJ501BLN1", "Overall": "1.0", "Content": "Too many issues, screen freezes, on/off tab breaks, difficult to get all loaded and ready, cannot get in touch with Ematic, would not recommend unless you are looking for a headache!", "Title": "Too many issues", "Date": "July 26, 2013"}, {"Author": "Nathan p.", "ReviewID": "R3LDHVNAJ5P36P", "Overall": "1.0", "Content": "Got the run around several times from computer brains staff. This was gonna be my grandsons birthday gift.never deal with computer brain again.", "Title": "Computer brain never completed order canceled after 6weeks", "Date": "June 13, 2013"}, {"Author": "L jones", "ReviewID": "R3U1237BG4AFVH", "Overall": "2.0", "Content": "I purchased this for my 4 year old niece for her birthday. I found it to be very limiting and there were very few apps got free and only one free book. I should just purchased a regular tablet. I'm really glad that I didn't pay regular price for it.", "Title": "Not worth it!!!!", "Date": "October 4, 2013"}, {"Author": "staci dillinger", "ReviewID": "R1S33HTBGZOIP0", "Overall": "1.0", "Content": "I got this for my daughter (also bought a blue one for my son). They didn't get to play with either one for more than one day before they were ready for the trash. It was glitching within the first few minutes that we had it opened. I thought maybe since it had been used previously that a good electrical cleaning may fix it. oh no. its just crap. not only were my kids disappointed but imagine my anger to have just spent 160.00 on tow tablets that were trash from the get go. the leapfrog leap pad was my replacement to this and i was extremely happy with that. Not only will i not buy a used item again on amazon, i will also never buy this tablet.", "Title": "Don't waste your time", "Date": "September 25, 2013"}, {"Author": "TheGrim", "ReviewID": "R11F0AYY162AFH", "Overall": "1.0", "Content": "What a worthless piece of crap. We got this for my 9 yr old daughter for Christmas yesterday and within one day of use the power button has already snapped off. I'll be returning this promptly as I've read the reviews and don't wish to deal with their refurbished crap when I paid for something new.In addition you have to pay an annual $40 subscription to use the parental controls.", "Title": "Worthless", "Date": "December 26, 2013"}, {"Author": "Suresh", "ReviewID": "R2INYO0FH8RY24", "Overall": "3.0", "Content": "I had gifted this to my niece. However, this does't come with Google Play Store is a big minus. Even trying to install google playstore or Amazon store doesn't seems to be working.. Need to know good workaround for this to be installed properly.", "Title": "It's okay for me", "Date": "September 25, 2013"}, {"Author": "Joe's Wife", "ReviewID": "R38IBSEGY0EPAL", "Overall": "3.0", "Content": "It would be preferable if \"Kid Mode\" did not require WIFI as I do not maintain connection at home.Games in KidMode are much more accessible to my 3 yr old.  Having to use tablet as is and access apps in the apps folder creates more confusion as there are many there that I had intentionally omitted from her view...Appears that the Zoodles connection requires WIFI or is buggy - first use today so not 100% but initial outlook not overwhelming positive.", "Title": "KidMode - Difficult to \"connect\" to", "Date": "September 23, 2013"}, {"Author": "Dawn", "ReviewID": "RN3MZIJWD3WR", "Overall": "1.0", "Content": "Start button broke shortly after we received it.  They requested it be sent back to them as it would be replaced.  Received the same item back, it was not replaced, and they said the screen was cracked (damaged) and not returnable.  The screen was not cracked when I shipped it back to them.  They demanded that it be sent by certified mail therefore it WAS NOT INSURABLE.  They returned the fun tab with no explainations!  Very unprofessional people to deal with.  Hopefully Amazon will be able to assist me on this matter.", "Title": "Do not deal with these people!", "Date": "September 17, 2013"}, {"Author": "Chigirl", "ReviewID": "R2PHTR8P512RX4", "Overall": "1.0", "Content": "My child used this tablet only ten times out of the year. Why? It's very frustrating to use, contains very poorly designed applications that are buggy, and mediocre touch screen/response.APPSThe ones included are extremely buggy. They either:- freeze up- don't respond to touch at all 90% of the time- require several touches to respond- touch response lag is very unacceptable. Some apps are sensitive to touch while others may require your child to hold down a bit and then let go. This is confusing as you move from app to app.- have bad, poorly designed interfaces. The navigation menu and buttons are either very tiny or very cramped together. So, my child or myself, always end up accidentally touching buttons that we didn't intend to press.- are hard to see. Many of the games are not crisp or clear.The ones that are not included, well, you have to dish out MORE money. $59.95 a year.- I wouldn't know because I refuse to pay Zoodles $59.95/year.- the apps that are included don't work correctly, at all, so why would I foolishly dish out more money. I would hate to find out that my son would continue to have a frustrating experience for apps that don't work.TABLET- The tablet itself appears to be durable but the screen blacked out on us once. We put the tablet aside for a while and my son decided to try it again.- Startup is extremely slow. Sometimes you think it froze but it's actually still loading.- Sometimes, the tablet does freeze up at the Android Ice Cream Sandwich screen.- The plug for the DC power doesn't seem very durable. It doesn't insert all the way into the table.CUSTOMER SERVICEHard to find and then turned out to be non-existent.This tablet had the concept I was looking for but failed miserably in graphical user interface design. The touchscreen lag and buggy applications = complete waste of money.", "Title": "Complete waste of money", "Date": "August 30, 2013"}, {"Author": "Tosha", "ReviewID": "R7YV31ER3Z7UZ", "Overall": "4.0", "Content": "The tablet was great, my daughter loves it!  It has alot of different activities to keep her entertained.  We take it everywhere.", "Title": "Ematic Tablet", "Date": "August 13, 2013"}, {"Author": "Johnny De Gale", "ReviewID": "RYZ5PWVAY1CC8", "Overall": "3.0", "Content": "My niece is loving the product though I was under the impression that there would be more apps loaded and I was not expecting that everything would require wifi access for greater functionality nor was I expecting to have to do online purchases to access certain items.  The security level is great but functionality is online at optimum when online.", "Title": "Some what limiting", "Date": "May 3, 2014"}, {"Author": "Jessica", "ReviewID": "R1SUDVDC2JWAD2", "Overall": "5.0", "Content": "BY FAR THE MOST AMAING PEOPLE I HAVE EVER DEALT WITH!! I WILL DEFINATELY ORDER FROM THESE FOLKS AGAIN AS MUCH AS POSSIBLE!!!", "Title": "GREAT PEOPLE", "Date": "March 27, 2014"}, {"Author": "Gilmara Lima Mendes \"Audible Obsessed wishes ...", "ReviewID": "R2BL57ZZ4UACYU", "Overall": "3.0", "Content": "It is kind of slow. I've had it for over a month now, and I cannot figure out how to download apps or games into it.I did the inicial setting as recommended, but it still shows some games that are not age appropriate for my kid who is 5 years old.", "Title": "I thought it could be a better device.", "Date": "March 14, 2014"}, {"Author": "Tracey", "ReviewID": "R2MX65VIVVFHHD", "Overall": "3.0", "Content": "Shipment came fast and any questions I had were promptly answered. However, I was not impressed with the quality of the product. It easily falls apart, the buttons for the power and volume come out easily and my daughter dropped it after only a day and the screen is now blank, it no longer works. I got an estimate to see how much it would cost to get a new screen and it cost more than I paided for the tablet. Dont take this review bad on the sellers part, I just wasnt happy with the quality of the product. I do not recommend this product.", "Title": "Ematic Tablet", "Date": "March 1, 2014"}, {"Author": "D. Booth \"tddbbs\"", "ReviewID": "R2I93GZDH9J5T0", "Overall": "1.0", "Content": "I bought this for my grandson, it is a great tablet, and tough he dropped it a few times and it kept working. what killed it was the warranty as soon as that runs out so does the tablet. I bought 2 of these for him (my grandson) the second he didn't drop (he's growing up) and it still quit working after the warranty expired. WOULDN'T RECOMMEND!!  it's to bad to because its a great tablet for kids to learn and to play.  I'm going to get him a leapfrog tablet instead!!!", "Title": "Nice while it lasted", "Date": "February 19, 2014"}, {"Author": "Catharine McIntosh", "ReviewID": "R1Q9AM2IK4C59Y", "Overall": "5.0", "Content": "Product exactly what I was looking for. Great value for the price and would recommend to anyone looking for this product.", "Title": "love it", "Date": "February 11, 2014"}, {"Author": "Mrs. Gibson", "ReviewID": "R1BMQUWAZAMQ28", "Overall": "4.0", "Content": "This was a nice tablet. My daughter has enjoyed it. I might buy it again as a gift. This is for younger children though. Maybe ages 1-9 I would say.", "Title": "Nice product and the seller was fabulous and on top of thier game", "Date": "February 11, 2014"}, {"Author": "jennifer guthrie", "ReviewID": "R2OXUX5U1LP7I0", "Overall": "4.0", "Content": "I got this for my 2 yr old and she loves it so far and I can do more games than her Nabi Jr. she does want to use the FunTab over the other and it was have the price.", "Title": "Ematic FunTab", "Date": "February 7, 2014"}, {"Author": "samara hattaway", "ReviewID": "R2VYN8GZXHHX4E", "Overall": "4.0", "Content": "The children like it and it is easy to operate- definitely get protection plan! This is one of three and one already had a crash:)", "Title": "Great toy", "Date": "February 7, 2014"}, {"Author": "Shirley Stoughtenger", "ReviewID": "R1JWQWQKUZOTDG", "Overall": "2.0", "Content": "I am very unhappy with this fun tab because the place where it say recommended apps I am unable to hit on it and have it install the app. I tried calling to figure out what was going on multiple time and I NEVER get a person to answer. The phone just keeps ringing over and over again. On a message it does tell you that the company that provided the apps no longer support the product and you have to go and download another app website. Should not have to go through so much trouble so my daughter can use her new tablet.", "Title": "Very unhappy customer.", "Date": "February 2, 2014"}, {"Author": "crissy", "ReviewID": "R2GP5X77NGNTJ0", "Overall": "3.0", "Content": "The product was good. I have no problem with the tab. But the ad for this product made me believe I was getting a 7 inch tablet. It was actually 4 inches. They need to change the ad and put a 4 inch tab. So people know what there getting!!!", "Title": "They need to clarify size!!!!!", "Date": "December 27, 2013"}, {"Author": "DR Princess", "ReviewID": "R17K9XAM8NS70", "Overall": "4.0", "Content": "It's GREAT for kids! Also it. Was affordable and I received it before Christmas! My daughter loves it! Thank you so much for this product", "Title": "Kids tablet", "Date": "December 25, 2013"}, {"Author": "Nancy", "ReviewID": "R2U5RUWEQMUP7O", "Overall": "3.0", "Content": "My granddaughter loves it something she can call her own and download her own games internet,YouTube she luv that taken pics", "Title": "her own tablet", "Date": "December 23, 2013"}, {"Author": "Osc", "ReviewID": "RN8ELSN1UV8HC", "Overall": "1.0", "Content": "this tablet is not intended for kids, my grandkid dropped it and it opened up and parts are missing and the warranty does not cover it so I recommend not to purchase for small kids as it is not durable for kids my Kindle fire hd is much more durable than this piece of well I'm not going to mention it.", "Title": "Ematic FunTab 4GB 7 Multi-Touch Screen Kids Tablet with Android 4.0 (Pink...", "Date": "December 8, 2013"}, {"Author": "Melissa", "ReviewID": "RT4TT13EJ5X3Q", "Overall": "1.0", "Content": "I got the tablet the other day and within one week the buttons fell off and the screen went out", "Title": "I wish i had re thought before I bought", "Date": "December 3, 2013"}, {"Author": "LEA R CASARES", "ReviewID": "R4PY0ZGL4VZCC", "Overall": "2.0", "Content": "Video chat does not work..which is the entire reason I bought this model. 5yrold likes the games, but I could have bought a leappad if that's all I was looking for.", "Title": "Video chat/video messaging does not work.", "Date": "November 26, 2013"}, {"Author": "mistic", "ReviewID": "R3MAZG3U08C6TP", "Overall": "1.0", "Content": "CONS:Internet connection cuts on and off frequently. I downloaded the amazon app store only to find out i could not press the apps i want. I would tap on an app in the amazon app store and nothing would happen. Browsing on the internet is horrible. The internet will constantly say web page not available. The functionality of the touch sensor is garbage. Also typing is so fustrating because other letters or other buttons are easily mistakenly tapped by my finger. This tablet is a big headache. My son wants to watch videos and is only limited to the 10 min and 5 min clips that comes with this device. He is also limited to the game apps that come with this device as well.Battery life is crap this thing dies out very fast.Pros: This tablet comes with free game apps and free *short* video clips. The tablet is extremely kid friendly. This tablet frequently recommends new apps according to your childs age. This tablet has a kid mode and parent mode. You can set what you want to be allowed in kids mode such as game apps vid clips camera even access or no access to the internet and much more.In conclusion my 7 yr old son is limited to things already installed in this tablet (which is hardly nothing) and that angers the hec out of me. ALl together i paid 125 for this junk. I just recently recieved today a kindle fire hd 7inch and omg my 5 yr old is ecstatic this thing is so sleek and so smooth no problems doing anything! No limits! So many vids and games and apps im able to download and best of all the touch sensor is OMG!! AMAZING!!! Im going to buy another kindle for my 7 yr old and try and return this piece of junk fun tab to back to the seller............. wish me luck..", "Title": "horrible", "Date": "May 25, 2013"}, {"Author": "Dabrink", "ReviewID": "R2EHCRQ5GSPGGA", "Overall": "1.0", "Content": "We used this for about 3 months, and after using the car charge port for the 2nd time, the port itself popped off the product when we tried to unplug the car charger (it wasn't solidly set in the device).  After contacting support through the Facebook page to see if they would stand behind their product, they said, \"they'd take care of it.\"We waited 8 weeks, and after not receiving a new product, we contacted them through Facebook again, and they acted like they didn't know we had already contacted them.  Shortly after that the main charge port did the same thing.  We followed up with more Facebook conversations, and submitting the website form (as instructed).  They didn't even respond or send any type confirmation after filling out the online form.  They have no numbers listed on their site for support - just a form.  When that doesn't work, we had nothing to fall back on.[...]We finally found a number we could dial, called it in, and they manually created a service request for us, but said it would cost $60 to replace the product (which we aren't going to pay for this poorly made piece of junk).", "Title": "Broke just after the 90 day warranty.  Everything else costs $60 to replace (almost as much as the tablet is worth anyway)", "Date": "December 24, 2013"}, {"Author": "DC", "ReviewID": "R1BP6ADH3U5RQU", "Overall": "5.0", "Content": "I purchased this product for my 3 year old grandson and he can't go nowhere without his Tablet.  It came loaded with games and he has mastered just about all of them. This was a great gift for him.", "Title": "Fun Tab", "Date": "June 4, 2013"}, {"Author": "Dalimar", "ReviewID": "R1CI6FTBX30323", "Overall": "1.0", "Content": "I bought two of these for my 4yrs old twin daughters. First it said that they were new, well I received refurbished ones, then, it said ice cream sandwich screen touch, well, it's another lie, we had to tap the screen many, many, many times and still don't worked. Next, I bought a warranty accident protection plan and it doesn't cover refurbished items, solo, I may end up loosing all my money, please don't buy it, it's not worth the money at all, I'm very disappointed.", "Title": "It's not what you expect", "Date": "July 21, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3JZNBI2YLWPJK", "Overall": "4.0", "Content": "Just recently bought this item from a big box store surprisingly cheaper than amazon for that week at least. so far so good for the moment been toying with it for a couple of days.First off this is not an iPad mini or a galaxy tab or anything in that range your paying 100 dollars so don't expect dual core speed or amazing screen resolution . But it is a functioning children's tablet with a lot of great kiddie apps already installed. Supposed to be durable enough for children but im still looking for a case i've got a 6 and 7 yr old they are pretty good at handling my galaxy tablets but why chance it !after more use i will post a more detailed review but so far so good ! screen response i give a 6 on 1-10 but the children wont mind at all . apps i give an 8 . looks i give a 10.", "Title": "It is what it is!", "Date": "December 2, 2012"}, {"Author": "Chuck Erickson", "ReviewID": "R26AUCKZO1HMWG", "Overall": "5.0", "Content": "My son was trying to play games on my tablet, but the process was hard for him to understand, the Ice Cream Sandwich processer makes it so simple for kids to learn and play...awesome product...and it's durable!", "Title": "So Easy to Use!", "Date": "May 13, 2013"}, {"Author": "Cheyenne", "ReviewID": "REML7S5L3E5VJ", "Overall": "5.0", "Content": "This is the perfect tablet for children. I bought this for my 8 year old's birthday and am now planning on buying one for my 11 and 4 year old as well. Great parental control while still allowing optimum tablet play/fun. Able to download and play nearly any app, easy video viewing, safe internet use, good audio playback and tons of fun. My son has dropped it once (right off the bat... go figure) and it sustained no damage. Of course, I warned him not to drop it again... I think we just got really lucky the first time. Great value and a great product for kids.", "Title": "Amazing!!!", "Date": "April 7, 2013"}, {"Author": "Jason Lynch", "ReviewID": "R3Q6KUELVFYX8X", "Overall": "1.0", "Content": "Touch screen on my unit was horrible. Can't install Google play or Amazon app-store and actually get them to work properly. Bought a $79 zeepad for my younger child and it worked better then this tablet for my older child. I see Asus has a memo 7\" pad for 50 bucks more and I am sure it works better then this junk. For $100 I would have expected better performance. Anyone who settles on this tablet for their child is either cheap or has no clue about decent touch response and functionality. I'm pretty tech savvy and this tablet is not worth $50 bucks imo. Waiting for seller to allow return of this bogus tablet.", "Title": "JUNK", "Date": "May 11, 2013"}, {"Author": "Anthony W. Fortune", "ReviewID": "R1X3D8I7RD7ZC0", "Overall": "3.0", "Content": "This is the second one of these I have ordered.  The first I ordered from a different sales outlet(Rakuten), but it was sent by the same vendor.(Altatec) The problem I have is that both of these items were sold as brand new, but in both instances the item came in an unsealed package, and the first one had someone's name written on the box and it was obvious that the ear buds had been used, but at least there was some documentation included in the box.  The second one that I ordered from amazon was also in an unsealed box, no writing on this one but there wasn't a single piece of paper in the box, no quick start guide....nothing.  I must say I was refunded my original purchase price on the first one with no hassle and probably would be able to do the same with the second one but I bought it for a birthday present for my grandson and due to the slow shipping I was already giving it to him late.  I ordered the second one from amazon thinking I would get faster shipping and since it was $15.00  more than the first one I expected it to be brand new with all contents included in a sealed package.  Little did I know that it was coming from the same vendor and I could have ordered it directly from them on their ebay store for a much cheaper price.  The product itself seems to be ok, my grandson is enjoying it so far, it would be better if it would allow you to use the google app store.", "Title": "Unsealed package. No instructions in package.", "Date": "April 18, 2013"}, {"Author": "Stacy Gause", "ReviewID": "R1A1XYZUUBI5XH", "Overall": "4.0", "Content": "I purchased the Ematic Funtab through a large chain retailer at a much cheaper price than on amazon, even though it was not on sell. But my children love this funtab. It is so simple to use. My children are 8,8, and 6. They can all use it with ease. It is very simple to set up and I love Zoodles! Great parental controls. Comes with LOTS of games and books. My children love the video mail feature. My 8 year old son did drop his and broke the screen. And it was no longer usable, so that is one down fall. Ematic will replace the screen but after all is said and done it is cheaper to purchase a new one. So, to sum it up...Great product for the kids just be extra careful to make sure they do not drop it.", "Title": "Great product for kids", "Date": "December 26, 2012"}], "ProductInfo": {"Price": "$249.99", "ProductID": "B00AGKIFGU", "Features": "Zoodles Kid Mode - Award winning Zoodles Kid Mode is a Kid-friendly interface that adapts to your child's age and skill level, provides progress reports for parents to review, and keeps them safe from online threats.\nInteractive Books - Read to your kids from anywhere in the world with interactive story-books. Record yourself reading from any webcam to instantly sent it to the FunTab.\nArt Studio - Kids can create works of art with the built in art studio. Parents can view their children's creations from Zoodles and choose their favorites.\nTop Apps for Kids - The FunTab features top apps such as Angry Birds, Cut the Rope, Fruit Ninja, Where's My Water?, educational apps from Intellijoy, Maxthon's Kid-Safe Browser, and many more!\nVideo Mail - Kids can send a short video message to invited family and friends using the built-in camera. Approved family members can connect with nothing more than an email address and a webcam.", "ImgURL": "http://ecx.images-amazon.com/images/I/41gXDd-Z82L._SX300_.jpg", "Name": "Ematic FunTab 4GB 7 Multi-Touch Screen Kids Tablet with Android 4.0 (Pink and Purple)"}}