{"Reviews": [{"Title": "Everything is awesome, but....", "Author": "CallMeBenny", "ReviewID": "R37P2MXST65CH3", "Overall": "4.0", "Content": "Everything works perfect on here, the only downside is it is not supported by the google play store... very disappointed for that reason, besides that its a great product, on the box it has a google play store icon, but does not support it, kind of misleading if you ask me...", "Date": "February 26, 2013"}, {"Title": "Meets my needs", "Author": "Terri Garlat \"tg\"", "ReviewID": "R18HM4N9U7E5SF", "Overall": "5.0", "Content": "Let's face it, this is not an ipad!  But it does what I need and for the price it's a nifty little tablet.  It seems to lock up quite a bit but for the most part it works well. One downfall I have found is finding accessories for this since it is an off brand tablet.", "Date": "February 14, 2013"}, {"Title": "UPDATED,,, Product dissapointed in end.", "Author": "Arturo G \"AG\"", "ReviewID": "R1F8CPMZ5S5VF9", "Overall": "2.0", "Content": "I bought one of these on ebay,, exact same specs .  It worked great right out of the box, goes on google play, loads and runs apps and has a very nice color screen.  I think it represents a great value in a tablet compared to some of the premium brands that are more than twice the cost!UPDATE:  This item doesn't charge the battery while in use ,, goes dead all the time as a result,,, would not purchase another.......", "Date": "March 3, 2013"}, {"Title": "useless paperweight", "Author": "4kidmama", "ReviewID": "RXM5G3DNTKRLZ", "Overall": "1.0", "Content": "I ordered two of these for my twins 13th birthday and after two months, they wont charge and are no longer useable.  I contacted the seller and since I ordered them before their birthday the 30 day period to return was up and that's it.  So now I have two useless paperweights because I cant charge them so I cant use them.  They did say it was the charger and sent me another charger, but that isnt the problem and never was. Ive tried the USB charger and the one included and they dont charge.  Customer service is terrible, they take forever to respond and dont offer assistance.  Very dissapointed", "Date": "October 23, 2013"}, {"Title": "It's ok", "Author": "G. Lake \"1233fire\"", "ReviewID": "R1O101QHKT6BSV", "Overall": "3.0", "Content": "Product is pretty well made.  Connection speed and navigation speed are pretty slow, but they eventually work. I guess I was expecting a little faster response.", "Date": "August 14, 2013"}, {"Title": "Worst tablet and service ever", "Author": "Catrina", "ReviewID": "R1GPSOIQHQGT75", "Overall": "1.0", "Content": "This tablet is SOOOO slow and extremely glitchy. It's not even worth it for the money. The customer service was terrible and took forever to get my refund. I do not recommend.", "Date": "July 4, 2013"}, {"Title": "TBS 7\" Google Android 4.0.3 Touch Screen Tablet", "Author": "Amazon Customer", "ReviewID": "R1WBZ9JI12805X", "Overall": "1.0", "Content": "This tablet worked only basically as a kindle reader for a few weeks and then it died. No amount of resetting helped to bring it back. It never was able to hook up to the keypad I got for it. Not very pleased with it.", "Date": "June 5, 2013"}, {"Title": "The Review", "Author": "Christopher olson", "ReviewID": "RN6AZ37KWA4D3", "Overall": "4.0", "Content": "Well, I wasn't expecting an ipad quality device when I ordered the TBS 7\" Google Android tablet but amazingly I pretty much got it. Now, I am no tech wiz which actually makes this review even better. I played with the TBS for just a few minutes and had pretty much figured everything out. It is easy to use, has enough functions to keep one busy and is built Ford Tough.The only issues that I have with it is the touch screen is not as sensitive as I had hoped and even with 4g internet it is a little slow. I still give it a 4 star rating.", "Date": "April 5, 2013"}, {"Title": "Good Tablet", "Author": "Francisco Mateos", "ReviewID": "R3AVDJWTQ3IP6G", "Overall": "5.0", "Content": "Good tablet tablet. What i payed for. Despite that it does not come with Google play its a very good and fast tablet. Gave it to my little brother. Me and him love it. 5 stars", "Date": "April 4, 2013"}, {"Title": "door stop", "Author": "Butch", "ReviewID": "R11MA164QVDOLZ", "Overall": "3.0", "Content": "Bought in March, stopped working in August..Geek Squad says I have a door stop now. Trying to get support, but Printed instructions so small cannot read. Amazon blocked DTV when they tried to e mail them", "Date": "April 2, 2013"}], "ProductInfo": {"Price": "$139.99", "Features": "Android 4.0.3 tablet PC with 7 inch multitouch capacitive screen\nHigh performance Cortex A8 ARM Processor\nWifi,Camera,Microphone,Gravity-sensor,free 10$ screen protective film pre-mounted\nBig 8GB Capacity for installing more games, support up to 32GB TF card\nSupport Android apps, games, Netflix,Youtube,Facebook,Gmail and Skype", "Name": "TBS® 7\" inch Google Android 4.0.3 Touch Screen Tablet PC with 1.2GHz, 512MB DDR3, 8GB built-in Capacity and 32G Expandable Micro SD Card Compatible with Youtube /Facebook /SKYPE (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/51wMgLMoUVL._SY300_.jpg", "ProductID": "B00A66YHRK"}}