{"Reviews": [{"Author": "Nina Douglas", "ReviewID": "RO0Y8LMNQYUQY", "Overall": "1.0", "Content": "Now that I have this problem, I'm reading reviews of this system that the power button is not well made and fails.Acer offered to fix it for $275... but I won't be doing that or ever buying an ACER again.", "Title": "Not even a year old - and its dead", "Date": "January 19, 2014"}, {"Author": "Alvin Delisle", "ReviewID": "R3AN8PGKWJ5V0H", "Overall": "4.0", "Content": "It is a good tablet for the reason I got it. It is great for enlarging print so I don't have to use my glasses", "Title": "Great for fine print.", "Date": "November 17, 2013"}, {"Author": "Andrew B. Cummings", "ReviewID": "R2GSOIZ2A8ODFB", "Overall": "4.0", "Content": "I have owned this Tablet for a year now.It works well for what it's for.It's simply a touchscreen netbook,which in my opinion, is much more more practical then a regular netbook or a chrome book.I wouldn't recommend this to students because its it doesn't come with office like the Surface. It does handles windows 8 mode apps pretty well.Most games work really well others simply don't work at all .(ex.Hydro Thunder,and pretty much any game from Gameloft, ie 6 Guns runs laggy and Asphalt 7 doesn't open at all and 8 runs with a weird green tint...) This tablet works very well with windows 8.1 .Its real limits only really show when using regular programs, because of its very low specs but that is to be expected..It comes packed  with Acer bloatware but that is easily removed. Acer actually does updated on this tablet quite often to iron out any issues with it so I don't really have much more glitch or force close issues.The real limits of this tablet is the same as any other windows 8 tablets  laptop or PC ,the store doesn't have much yet but it's growing.", "Title": "A good Tablet with light hiccups.", "Date": "December 20, 2013"}, {"Author": "Angelos", "ReviewID": "R39M0E3KF61G6S", "Overall": "4.0", "Content": "Beautiful display with nice colors and handy size. Fast and kind of smart. Only bad experience the difficulty to bring back the machine to factory settings !!!", "Title": "I quite liked it", "Date": "May 9, 2013"}, {"Author": "Michael P. Weber", "ReviewID": "RR8HA3ZHMGKT4", "Overall": "5.0", "Content": "Only reason I purchased this type of tablet is because I needed it to run Adobe Flash for someones online school. (x86)  I hate Windows and Windows 8 but it works just fine.Someday I will take it back from its user and liberate it with Linux.  Someday.", "Title": "RUNS FLASH - W00T - W00T", "Date": "December 16, 2013"}, {"Author": "meghan decoteau", "ReviewID": "RL1RZ5876NBXQ", "Overall": "1.0", "Content": "I would recommend you just buy the tablet at best buy because it may come with scratches and not all the correct files like mine did.", "Title": "I would recomend just buying the tablet at best buy.", "Date": "October 17, 2013"}], "ProductInfo": {"Price": "$569.99", "ProductID": "B00AIUIAOU", "Features": "Windows 8, 10.1-inch Touch Display\nIntel Atom Z2760 1.5 GHz (1 MB Cache)\n32 GB SSD Drive, 2 GB RAM Memory\n9-hour battery life, 1.27 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41UL6rJ8fKL._SX300_.jpg", "Name": "Acer Iconia W510-1620 10.1-Inch 32 GB Tablet (Silver)"}}