{"Reviews": [{"Author": "George Fore", "ReviewID": "RKMUD4G31O0LN", "Overall": "3.0", "Content": "This was the first item I had ever returned a purchase from Amazon.  I was impressed by other reviews on the Afunta.  It was stated several times that it had a Glass screen;It did not.  They said it was a 9.2\" screen or a little more than the others;It did not.  Other 9\" brands looked identical to the Afunta brand after they sold out. It worked but a charger prong pulled out after first charge.  Next, after charging that took more time than stated, the charge did not hold as long as described.  The WIFI would disconnect often and would have to be restarted. When on, it seemed to work well enough. I was disappointed enough to return and will wait for the newer Nexus Seven and order from Amazon.Amazon notified me right after shipping back they were refunding to my card. Their service was quick and good.George", "Title": "Not totally as described", "Date": "May 17, 2013"}, {"Author": "Jacob D Roell \"Jacob D Roell\"", "ReviewID": "R359WKSA3X1FTN", "Overall": "1.0", "Content": "Worst tablet ever!!!!!!! This tablet is cheaply made piece of pooh. It is so slow. It constantly does random things such as close the app your on or my favorite turns the volume all the way up for no reason. Also the screen cracks super easy on it. DON'T WASTE YOUR TIME EVEN THINKING ABOUT THIS TABLET!!!!!!!!!!!!!", "Title": "Bad oh so bad", "Date": "March 19, 2014"}, {"Author": "Jeff", "ReviewID": "R2A1F233CS226E", "Overall": "2.0", "Content": "I fell in love with the price of this tablet. When I got it in my hand I was not very happy with what I saw. It felt cheap and the cheapoplastic screen already had 2 scratches in it. Buttons feel cheap also. The picture is not good at all. The color looks almost \"washed out\" and you need to view it at a straight direct angle. otherwise the picture looks even worse. The battery only charges to 97% and goesdown very quickly. The price is not a bargain, you are getting exactly what you are paying for.", "Title": "U get what u pay for", "Date": "August 9, 2013"}, {"Author": "Julius B.", "ReviewID": "R2FWELL50FQCST", "Overall": "2.0", "Content": "Are your searching for a big screen tablet that's not gonna hurt your pockets? Well keep looking cause this ain't it!!!  First off the screen is horrible, you have to tilt and angle the tablet to see the screen clearly, trust me you will be disappointed in that. And it lags like crazy!! I mean you literally have to count two or three seconds between touch commands so you don't lag, like if you open up your app drawer,(it lags) then try selecting an app (it lags), try backing out (it lags)... But it's big, it's actually a 9.2 inch screen- it got a star for that... And it plays movies real good- it got a star for that, but the battery is garbage it takes like 6 hrs to charge a full battery and then it dies like in an hour of continuous use...I purchased 2 for me and my wife but I'm just gonna let our 2 toddlers play games on them til they break (LOL) cause it was a wasted purchase man...  If you want a good sized tablet expect to spend at least $200 for a quality one, your not gonna come up like I thought I was going too going cheap, but the seller does do fast processing and gets your order out for swift delivery so I give them credit.", "Title": "LAGGY!!", "Date": "February 26, 2013"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B00AUUOFR4", "Features": null, "ImgURL": "http://ecx.images-amazon.com/images/I/41rdwD3nRHL._SY300_.jpg", "Name": "Afunta® 9.2'' Google Android 4.0 512mb/8gb Tablet Camera Capacitive Multiple Touch Screen G-sensor A13 Tablet, 3d Games Skype Video Calling, Netflix Movies (Single Camera, White)"}}