{"Reviews": [{"Title": "Awesome Android tablet!", "Author": "J. Koenig \"jkoenig24\"", "ReviewID": "R1JTWY8K0AMFU9", "Overall": "4.0", "Content": "I bought a 10\" Motorola XOOM tablet. It has 32GB of installed memory and, I can add another 32GB via a micro SD card. It has a dual core processor which wakes quickly from Sleep but, takes longer than I expected to start up when it's been totally shut down. The power plug is very small. In my opinion, this will be the weak link. I'm very careful using this tablet when plugged in as I think it would be very easy to damage the plug. Fortunately, the battery gives many hours of service so, I generally use it on battery and then, place it somewhere safe for charging. Beautiful bright, clear screen that responds well to my touch. It came with Android 4.1 installed. There is an HDMI port but, it's not standard sized (it's either mini or micro sized. The USB port is also a mini or micro sized). The data transfer / syncing is via the USB port (when not done wirelessly). Only data comes through USB; power must come through the separate power port or docking station. The package I bought included a Bluetooth mouse and keyboard as well as a docking station. When used with those accessories, I pretty much have a 10\" desktop computer! The XOOM I bought can have a Verizon 4G SIM installed for internet access when WiFi is not available. That's actually the primary reason I bought this particular model (my ATT iPhone frequently does NOT get service when I travel). Sadly, Verizon's claim of 2GB of data, without a monthly contract for $30/month didn't pan out. A Verizon company store charged me $155.56! I returned the SIM  (and then got an email saying I owed Verizon $37.13). The store manager simply said \" there was an error (re: the amount I was charged). Of course said \"error\" was in Verizon's favor.  Although the XOOM has been superseded by a newer model (which means you should be able to find good deals on the XOOM), if you're looking for an excellent Android tablet, you won't go wrong with a Motorola XOOM!", "Date": "October 21, 2013"}, {"Title": "Parts Missing on Xoom", "Author": "June", "ReviewID": "R218V77HS138HE", "Overall": "1.0", "Content": "I have not been able to use this Xoom as it arrived with no drawer to put the SIM card in.This unit is no longer being produced and finding the part has so far proved no results.Can you help me please.", "Date": "January 17, 2014"}, {"Title": "I feel like I got over", "Author": "Michael", "ReviewID": "R36QNKKY6PB6N7", "Overall": "5.0", "Content": "For the price,this is one of the best purchases that I've made. I bought this for my wife's birthday and it hasn't left her reach yet. It's a great option to the over priced pads and far superior to the Chinese junk pads. Fact is I also bought 1 for myself.", "Date": "February 1, 2014"}, {"Title": "Rating Motorola XOOM", "Author": "Barnabas Vorreiter", "ReviewID": "R3LLKSV12VTYZR", "Overall": "5.0", "Content": "I have been using Motorola Android products for over the last three years and I have been pleased with the security of the Android operating system.  As a result, though I am still getting to familiarize with the Motorola Xoom, in addition to its secure operating system I like its capacity of operating as a mini PC.Thank you", "Date": "December 30, 2013"}, {"Title": "A Great Little Tablet", "Author": "Roving Craft Shop \"Leonard\"", "ReviewID": "R2WV2RTIK318MD", "Overall": "5.0", "Content": "I'm typing this feedback on the tablet now.  Took the Sim card out of my Verizon MiFi and inserted it in here and immediately got 4G.  Only got 3G on the MiFi.  Been using it everyday since..  Uses it as my WiGfi hotspot.  Price was great also.", "Date": "December 10, 2013"}, {"Title": "Update to Previous 1 Star Review", "Author": "Steve Guss \"SteveG\"", "ReviewID": "R2OQT0387XFE0S", "Overall": "5.0", "Content": "Update from my previous review.  I have since contacted Amazon by phone and they have set it up for me to get a replacement for the defective item.The tablet itself was wonderful until it died I am very happy to be able to continue to use one.", "Date": "December 2, 2013"}, {"Title": "Love it", "Author": "tot", "ReviewID": "R2YR2885Q9YJ1M", "Overall": "5.0", "Content": "I love my xoom it is all that I was looking for,  I put my laptop down for it. I will keep enjoying my tablet and will not exchange it for nothing in the world it was worth the money.", "Date": "November 4, 2013"}, {"Title": "great!", "Author": "Stephen M Knowles", "ReviewID": "R3BVKUQDEQFYFB", "Overall": "5.0", "Content": "he was a huge help great person to work with! stuck with me till i was 100% satisfied! great job!", "Date": "February 16, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AJ1CN82"}}