{"Reviews": [{"Title": "Good Tablet For The Money", "Author": "Michael S. Rainey \"unluckyg33k\"", "ReviewID": "R180C72NKSNM6C", "Overall": "4.0", "Content": "The Good: The sound was something of a surprise, because it is the best that I have heard from a tablet yet. The sound is crisp and clear even when the volume is turned up all the way. The screen is nice, bright, and responsive and made of glass. Most tablets of this price do not have glass screens, let alone 10-point Capacitive screens, as good as this one. Runs perfectly with little or no lag time even with several programs open. The latest Android OS also makes this tablet both easy for beginners and robust enough for seasoned tablet pros.The Bad: Even though it does have two mini-USB ports, one is dedicated to the USB-Network dongle included in the box. These ports are not marked as such and is not clearly indicated that way in the manual included. It does not have support for Bluetooth, so for those who are wanting to use a case with a Bluetooth keyboard, you are out of luck. You will have to use a case with a USB connection, but that will take up the only usable USB slot so you can't have it hooked to your computer and use the keyboard at the same time. Another issue is that the buttons for power and volume can easily be hit and it doesn't take much pressure to do it either.The Excusable: Amazon's website indicates that this is a 1.5GHz dual-core tablet. But according to Zenithink's website this model is a 1.3GHz dual-core tablet. In the grand scheme of things this is not a breaking point but Amazon is misinterpreting the product. I do not know who is at fault but I tend to err on the side of the manufacturer's website being correct. I highly recommend getting at least a 16GB SDCARD with this tablet. Even though it says it has an 8GB storage capacity, it is only capable of holding 1GB of actual programs, which is pretty normal for a tablet in this price range. Anything beyond that would have to be moved to an SDCARD. The camera could be a little better because there are very few options available and neither Amazon's nor the manufacturer's website indicates its resolution. It does fairly well in video chat.The Ugly: Nothing ugly, unless you really utilize Bluetooth.", "Date": "April 17, 2013"}, {"Title": "This is one nice tablet", "Author": "frankinwash", "ReviewID": "R38VPXITHDQHG", "Overall": "5.0", "Content": "I got this C93 for $159.99 and would consider it a steal for $100 more.  I learned the android tablet stuff on 2 HKC 7's (fine 7\" tabs) this past couple months so when I lit this off upon receipt I had some idea what to look for.  10.1 inch is totally superior for me but the wife disagrees as it is too big for her.  I think the larger (and older) person would be much happier with the 10.1.  I also think if you are during Word, Excel or Power Point, you really want the 10.1.  (Kingsoft 5.5 is a fantastic free office app.)  Someone said the ports aren't marked but they are if you look on the beveled edge under the ports.Manual is better than most. Looks like it is only CDMA for 3G. I've ordered A Fosmon case/keyboard which claims to work for this tab... we'll see.Update (8/17/13)  Tablet died today.  Only a lit  blank screen.  We enjoyed it while it worked.  Used it every day.  Have a second one and hope it lasts longer.", "Date": "May 14, 2013"}, {"Title": "Great for the money", "Author": "Helen Tranum", "ReviewID": "R315TTSBXI7Z5Z", "Overall": "5.0", "Content": "Happy with this tablet, I can do everything on tablet that I do on laptop, except watch Amazon streaming video, device does not support Adobe Flash, which is required to watch video at Amazon.  I can watch Net flex and HBO GO. I bought this mainly as a reader, so far, it was a good buy.", "Date": "August 22, 2013"}, {"Title": "GORGEOUS and FAST!", "Author": "Amazon Customer", "ReviewID": "R2HNM951HE2BXF", "Overall": "5.0", "Content": "I'm no tablet novice. Had a Dell Streak 7 when it first came out. I also own a Galaxy Note 2.  So I know expensive and high end -- and THIS baby proves that price and brand matters not!It DOES come with Google Play Store.  The screen is CRYSTAL CLEAR and SUPER bright. Touch sensitive. Internet fast. Design sleek and as sturdy as any expensive brand.Despite a 2 hour battery life (which isn't a deal breaker because anything more, and you may as well use a laptop -- its a TABLET, not a PC -- but you can download the \"Easy Battery Saver\" app), it still deserves 5 stars. This manufacturer has a competitive advantage if consumers catch on and for HALF the price of leading brands!LOVE IT!Update 3/2/14: Still going strong. Not sure why so many bad reviews in recent weeks, but it DOES appear that the product has changed drastically from an aesthetic standpoint.  Mine is white/silver and looks kind of like a rectangular Ipad. Maybe that's the problem.", "Date": "January 2, 2014"}, {"Title": "Excellent tablet for the price", "Author": "CJ", "ReviewID": "R2CS0SS1GCEI47", "Overall": "5.0", "Content": "This was gift for our daughter ( 14). She LOVES it.  Works pretty fast, great graphics, picture is crystal clear HD. Camera is good and the size is great for ebooks, games, movies, etc.. great purchase", "Date": "December 26, 2013"}, {"Title": "Happy 7 year old!", "Author": "Scigurl", "ReviewID": "R2MQA6ZP0L9OAA", "Overall": "4.0", "Content": "We got this tablet for our 7 year old. It is a nice size for viewing/playing children's Apps. The tablet is sturdy and has a great picture and better sound than my iPad. It is a little longer than an iPad and not as fat, therefore it is easier for him to carry and use in the car.  Google play is preloaded and children and adults can easily find apps.The only issues thus far are that the power button can easily be turned on while in transit and that the headphone jack is a bit sensitive. The camera does reverse the image, but this is not an issue for my son. The HD video is amazing and makes up for these minor issues. Nevertheless, for less than $200 you get a great 10.1 inch tablet that uses the latest Android software, is easy to use, and if you are getting it for a child, they get all the perks of an iPad for less than half the price.", "Date": "December 27, 2012"}, {"Title": "Over all great tablet", "Author": "Jfam", "ReviewID": "R7F8FN6H0UEMF", "Overall": "5.0", "Content": "Bought this as a gift. Works great sound is over all great, camera  could be better plays net flixs without a problem ! I would 100% recommend this tablet over all great product for the money !", "Date": "December 26, 2013"}, {"Title": "Great buy", "Author": "Joseph F. Maalouf", "ReviewID": "ROGCROQMAPW8P", "Overall": "5.0", "Content": "I bought this tablet about a week ago, it has performed better than I was expecting. Great value for the money, I do recommend that you add the extended memory chip.", "Date": "February 25, 2013"}, {"Title": "Nice Deal!", "Author": "JB \"JBear\"", "ReviewID": "R3A817LQ9FK6IE", "Overall": "5.0", "Content": "The latest os by Android. Works as advertised. Fast and great screen to view. Good battery life. Get one while they last!", "Date": "January 28, 2013"}, {"Title": "it ok.", "Author": "Pamela", "ReviewID": "R3M4EJ45F32GAV", "Overall": "4.0", "Content": "No bluetooth and all my apps don't work on it.there is not much to say really. Just not what I expected for the price.", "Date": "February 8, 2014"}, {"Title": "Great, but battery is not.", "Author": "C. Holden", "ReviewID": "R1KNWRF7VJJ259", "Overall": "3.0", "Content": "The screen is nice and everything works as well as the expensive brands, but the battery is another matter.  It conks out after a couple of hours.", "Date": "November 27, 2013"}, {"Title": "Can't download App", "Author": "Amazon Customer", "ReviewID": "R27Y94XT1PS2XO", "Overall": "3.0", "Content": "Just got this tablet. The only problem . . does not come with goolge play and i try to download google play its wont let me do. Has anyone have any idea.", "Date": "November 24, 2013"}, {"Title": "Product seems good", "Author": "Kendell Heaps", "ReviewID": "R1C16S0RU5LV5R", "Overall": "3.0", "Content": "I guess it's another example of \"you get what you pay for\"  but I expected that what I paid for would come with at least a power cord.I haven't even had a chance to test the tablet yet, because I have no idea how I'm going to recharge the battery. :-(", "Date": "March 28, 2013"}, {"Title": "Get what you pay for............", "Author": "Stan G.", "ReviewID": "RKAC2BNFQHWOW", "Overall": "1.0", "Content": "As the saying goes, 'You get what you pay for'.  Returned 2 days after receiving it.  Very slow, speakers are nonexistent.  Spend a bit more and get a better quality product.", "Date": "November 10, 2013"}, {"Title": "Screen is not sensitive enough", "Author": "Paul", "ReviewID": "R1NFSHZ1XV7S4U", "Overall": "3.0", "Content": "Other than the screen issue I also have a problem with getting Adobe Flash to load. It is supposedly is alreay on there, but I can't get it to load. I have found versions of Flash that will work, but the device won't let me load it. It says that it is already loaded, which it isn't. Hopefully I will get somebody on Ebay to buy it and put a couple bucks more in to buy a better one.", "Date": "June 18, 2013"}, {"Title": "you get what you pay for.", "Author": "Richard Wardell", "ReviewID": "R2CZLLD3NQMMCQ", "Overall": "2.0", "Content": "Nice tablet for the cost.  That's what I thought for the first month at least.  Now it is still working to some extent, as an email viewer and YouTube viewer.  Problem is it no longer has a functional internal SD card. (No it won't recognize the external one either) So I can't download ANYTHING!  Can't view PDF files on websites.  I could go on.  At first the seller was trying to help, but has stopped.  Do yourself a favor and spend a little more on a quality product.", "Date": "May 22, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00A1HFTRQ"}}