{"Reviews": [{"Title": "good competition", "Author": "Karen S. Salina \"ks001\"", "ReviewID": "R1FNPGJYVOW44Z", "Overall": "5.0", "Content": "I like my lenovo tablet; I got it mostly for work to check my emails, since Big Brother has announced they're watching. I don't watch movies at all, so haven't used it for that. I like the 24/7 computer radio station a lot at work, so the sound is adequate; I didn't expect great stereo sound from a unit like this, but it's audible, clear w/out any static or interference; good reception. I haven't tried the cameras yet, but that's what set it apart from the Kindle HD, which tipped me to buy that one.", "Date": "June 28, 2013"}, {"Title": "locked sim", "Author": "ahmad alhajjaj", "ReviewID": "R2E0RMA1PYRKGW", "Overall": "1.0", "Content": "I am shocked, because there is nothing mentioned about AT&T; locked simcard tablet ,thus now i can't use internet unless there is Wifi ,i bought this product because it has 3g feature which obviously it won't work because it's AT&T; locked product  am really disappointed ,It's not fair ...", "Date": "June 21, 2013"}, {"Title": "Lenovo Ideatab 7 inch 16 GB Tablet", "Author": "MMV", "ReviewID": "R2Y93O09BVE3BR", "Overall": "5.0", "Content": "Great Tablet!  My husband loves it! Easy to operate. Good screen view. Many functions. Use it everyday. Good device to have.", "Date": "July 24, 2013"}, {"Title": "new lenovo 7 inch tablet", "Author": "robert armstrong", "ReviewID": "R1RVQQ3FWD08XN", "Overall": "4.0", "Content": "good tablet more ram but mtk 6575 A9 processor to slow for HD video plays standard video ok screen quality good face on. right side tilt bad .wifi good .amazon streaming video does'nt work with android tablets anymore thats what i was told by amazon after mine quit working but all in all. not bad for price", "Date": "April 9, 2013"}, {"Title": "Like but cant use it on GSM", "Author": "mwebe timothy", "ReviewID": "RFTW7Q72HK7X8", "Overall": "4.0", "Content": "Its ok the only problem is I can't use it on GSM where iam. Its locked and have no idea how to unlock it.", "Date": "December 30, 2013"}, {"Title": "bad bussines for my", "Author": "lucho1109", "ReviewID": "R278XCEAEL56SA", "Overall": "1.0", "Content": "these tablets were blocked by att and I could not unlocking in a nutshell and I lost the money stored tablets of remembrance", "Date": "February 11, 2014"}, {"Title": "The store send me a lenovo tablet used and with a lot o problems", "Author": "Valéria Rios", "ReviewID": "RCR491P6A0PT6", "Overall": "1.0", "Content": "It was impossible to use the tablet because the store send me a terrible machine, with a lot of problems.I propose nobody buys anything at the store online.", "Date": "February 6, 2014"}, {"Title": "Unlocked with ATT not  mentioned other than tiny words at the bottom!!", "Author": "RAMKUMAR JAYARAMAN", "ReviewID": "RM4J3RTE45POU", "Overall": "3.0", "Content": "Hello Is there an option to get the unlock code?Would ATT provide it ??OR any other means to get the code?", "Date": "November 28, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Android 4.0 Ice Cream Sandwich, 7 inches Display\nQualcomm A6 1.0 GHz\n16 GB Flash Memory, 1 GB RAM Memory\n8-hour battery life, 0.88 pounds", "Name": "Lenovo Ideatab A2107 3G 7-Inch 16 GB Tablet (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51jKRhy3WXL._SY300_.jpg", "ProductID": "B00AWASBJA"}}