{"Reviews": [{"Title": "A Real Gem!!", "Author": "Amazon Customer", "ReviewID": "R1XJTKSG3SY6XY", "Overall": "5.0", "Content": "I was very excited when I purchased this tablet as the reviews were so good. I must say that after a few weeks using it and becoming aquainted with it's functions I couldn't be happier with it. There is no hesitation going from one function to the next. Picture is very sharp. The camera isn't the most accurate as it doesn't have a focusing square in the center like my phone so pics have not been sharp enough to save. Sound quality is poor but I use earbuds and they work just fine. Only App I haven't been able to use is HULU Plus. Doesn't have GPS but I have it on my phone so it's not really necessary. Tried to get a GPS App but won't work on it as tablet doesn't have GPS in the Google choices. Definitely a great bargain for the price!!!! I'd buy it again!!", "Date": "March 2, 2013"}, {"Title": "Great", "Author": "keeredd", "ReviewID": "RTBNYKB6NO05Z", "Overall": "5.0", "Content": "One of the best decisions I have ever made. When I bought it I did not know what to expect. It's fast and looks expensive. The battery life lasts longer than I expected. It takes great pictures.", "Date": "February 13, 2013"}, {"Title": "So far I'm very happy ...", "Author": "Amazon Customer", "ReviewID": "R65NOLQSYJ9YT", "Overall": "5.0", "Content": "I purchased a tablet (cheap)from Amazon about 6 months ago and because I didn't know very much about tablets or android, I purchased something that wouldn't really do what I wanted or needed.  My husband purchased himself a tablet for Christmas for a lot of money and he was thrilled with it and wouldn't/couldn't stop talking about it!  I felt pretty stupid for not doing my due diligence on the tablets prior to my original purchase.  Or maybe I was suppose to have that one so I could learn about androids and downloading apps ... needless to say, I am thrilled about this purchase!!  Reasonable price, has all the necessary stuff and after you enable Google you can do everything anyone else can do and then some.  I use Chrome on my laptop, and I was able to get Chrome on my tablet!love, love, love it!! The size will take some getting used to ... I did purchase a sleeve for the tablet and am also very happy about it!  nice fit!  Thanks Amazon for yet another great product.I highly recommend you read as many reviews as you can before buying so you can learn all you can about these tablets.", "Date": "February 3, 2013"}, {"Title": "Excellent Buy", "Author": "Ruth R.", "ReviewID": "RBW1MQ09AUL2U", "Overall": "5.0", "Content": "I just received my Studio 10 had yesterday. Previously I had an IdolPad 10.The Studio 10 is much brighter and faster than the older IdolPad 10.  The older IdolPad 10 had a single 1.0 GHz processor.  With dual core 1.6 GHz processors the Studio 10 is capable of running three times as fast.  It definitely shows.  The Studio 10 searches the Internet much faster and plays videos more smoothly.I need the pad for traveling to other countries. Often there is no wireless Internet service in the hotel rooms but there is an ethernet cable. I purchased a USB to RJ45 LAN Ethernet HUB internet Adapter from eBay  (about 16.00 USD shipped).  It works great. Just plug it into the micro USB port via the supplied adapters that come with your Studio 10.  There is no set up. Just insert the ethernet cable in the hub and you can surf the net.  This particular adapter worked fine for me but I'm sure there are others that work as well just search for USB to RJ45 LAN Ethernet HUB internet Adapter.  Be sure it for Android tablets and for Internet.Before buying this tablet, I went to Best Buy and looked at the variety of tablets on display.  None of the tablets surfed the Internet any faster then the Studio 10.  If the displays were any better, I could not tell. in fact, I was most impressed with the display properties of the Toshiba tablet.  The Studio 10 seems to be on par with the Toshiba. I had planned to buy the ASUS four processor tablet. I'm really glad I did not. It was a lot of extra money with no apparent advantage.The sound is fairly reasonable considering it is a tablet. The cameras is okay.  I gave the tablet five stars  because of the price advantage. For twice the money you can get exactly the same performance with a slightly better camera.The Studio 10 is very thin. it has the same look and feel as the brand name tablets.  I didn't consider higher-resolution cameras an advantage because my cell phone already has a good camera and video built in.  I can't imagine taking a 10 inch tablet around town and using it as a pocket camera.Battery life is excellent. There are three brightness adjustments. I use medium because it is bright enough for most conditions.  It appears to be good for 6 to 8 hours.  I'm sure it will last just as long as the \"up to 10 hour\" tablets. It depends on how you use it.Google Play Store is already set installed and works very well.  I believe the tablet is \"rooted\" which means that you are not restricted to the manufacturers preferred apps.", "Date": "January 31, 2013"}, {"Title": "great for price", "Author": "Lana", "ReviewID": "R2K14WKQCR5T4G", "Overall": "4.0", "Content": "Bought it as a present for my husband BD. Spent some time to install google play apps, only because the user manual is confusing. I followed the instructions and tried to install through SD card. Did not work. It works when you enable \"allow installation of apps from unknown sources\" in security settings, then you can download it from 4share.com. Like the picture quality, fast internet, good sound, works great with key board.", "Date": "January 20, 2013"}, {"Title": "excellent", "Author": "mikey", "ReviewID": "RF360IQX27WZL", "Overall": "5.0", "Content": "Best tablet for the price.  Really quick, and very easy to use.  Kinda wonder why Google was turned off but it is really easy to turn it back on... (you just got to go to the developers menu in settings and scroll down to the bottom to turn it on)  I was really surprised how fast and bright it was.  I looked at 100s of tablets before getting this one and very glad I did", "Date": "January 6, 2013"}, {"Title": "Awsome Tablet", "Author": "njoysafunlife", "ReviewID": "R1JWMVJD5YEZLJ", "Overall": "5.0", "Content": "Awesome tablet, everything I could want, speed, memory, feature packed and solid construction, priced within my budget.  You can't go wrong with this master piece of equipment, it has just as much power as an Ipad at half the cost, I'm am very pleased with this purchase.", "Date": "December 30, 2012"}, {"Title": "Android did not start --  but now it's fixed", "Author": "Amazon Customer \"skygoddess\"", "ReviewID": "RBN7RKTI3HOG4", "Overall": "4.0", "Content": "I bought this in the late March. It was working fine. I was using it mainly to view photos, emails, and reading digital books.  I noticed that when the screen stayed inactive for a while, it freezes. It happened a few times. The only thing I could do anything to this was to turn it off by pressing the switch on the side for several second. When I press the switch button for a few seconds again, it would turn on and starts android. Last night, the screen froze again, showing a photo I was looking at for a while. So I had no choice but to do the force shut down like before. When I try to start the android, by pressing the start button, it showed the start up screen of Idolian, then black screen with android logo. This as far as it goes. I don't want to keep doing this as I'm afraid that it might wear out the hardware. Fortunately, all my important data files are either online or on a mini memory card. But I spent a lot of time adding and setting up apps. Since it's been more than 30 days, I'm not sure, what I can do about this. I'm too busy to do further research right now. I was hoping to bring this to my upcoming vacations business trips. Just so sad....  Before buying this tablet, I read most of these customer reviews, and read about the 30-days return policy. So I paid extra attention not miss the 30 days, and kept checking the functions of this pretty much every day, just using it normally for email and net browsing at home. It's been more than 50 days since purchase, and sure enough the nightmare hit me. I wish the Amazons return policy were not just 30 days. 30 days are not enough to see all these defects. If you don't have extra cash to waste, I wouldn't recommend shopping tablets at Amazon.com to my friends.", "Date": "May 15, 2013"}, {"Title": "Like it better than my son's I-Pad", "Author": "RICHARD W LEE", "ReviewID": "R15YLCGLN26BJL", "Overall": "5.0", "Content": "This tablet is everything I wanted and more. My son has an I-Pad that I would use so I decided to get a tablet for myself. I love the size of the 10 inch screen. I downloaded a movie and it is amazing. I downloaded a book and is was perfect for reading in bed at night. I like to answer surveys for companies for money and I could not do them on the I-pad because it does not have Java but this does. It works great for skype and my youngest son download a siri app on it and it actually works! The camara works pretty good and the video is easy to use. I bought a 16gb sd card and put it in before I even turned it on so its has 32gb which is more than I need but for 15.00 extra, you can't go wrong. I worry about the other reviews talking about the charger and plug so I have been very careful about charging and have not have any problems ( I've only had the tablet a month so far) and the battery life has been as advertised. All this for 300 less than an I-pad make it a great deal.", "Date": "April 7, 2013"}, {"Title": "Great Tablet", "Author": "Karen Johnston", "ReviewID": "R2B7X91EDKG37", "Overall": "5.0", "Content": "I bought this tablet after having an MID Android tablet that had a burned pixel after having it for 3 months. I bought the 9 inch tablet first but decided that I needed a larger tablet. I bought the 10.1 and 16mg tablet which has Jelly Bean. I am very happy with this tablet and would recommend to others. I really like the company who makes this tablet as they are so easy to work with. I give them a high rating when it comes to customer service.", "Date": "March 27, 2013"}, {"Title": "Great tablet!", "Author": "Amazon Customer", "ReviewID": "R3JLIZAB3U5HSB", "Overall": "5.0", "Content": "I already had an ipad and absolutely HATE it!  The Idolian is perfect for me - I like the android system and am able to read anything that I download to my Kindle on it.  This tablet is thin and lightweight, but has everything I was looking for.  I am very glad I purchased this tablet and highly recommend it.  I use it daily.", "Date": "March 27, 2013"}, {"Title": "Wow!", "Author": "Amazon Customer", "ReviewID": "R36P79KDV3U61Z", "Overall": "5.0", "Content": "This tablet is awesome, and Wow what a great price.  My boss's tablet he purchased from Verizon Wireless and with his keyboard he paid $300 minimum more.  This tablet is fast, and is doing all I want it to do just like his except I am grateful I saved a lot of time and money.", "Date": "March 26, 2013"}, {"Title": "A GREAT LITTLE TABLET!!!", "Author": "L. Patterson \"graphic designer\"", "ReviewID": "R2CYTQSOT16HB5", "Overall": "5.0", "Content": "I got this to play my Big Fish and G5 games on and does it ever work GREAT. Charged it up out of the box on Valentine's Day and never had a problem. I have a Kindle Fire HD 8.9\" and sure, the Idolian doesn't have as nice a picture, but it's pretty good and it plays games my Kindle won't (*sigh*). It's fast and I get mail fine and read with my Kindle app. Have downloaded all kinds of stuff to it and works great, including all my weather and news apps. I get about 4+ hours of streaming fun on it. It also does my Netflix fine. Sure the sound is tinny, but for the price, who cares? Want great sound? Get a KFHD!!!! But for $200.00+ it is fine.I won't go into the technical aspects of this tablet, others have done it so much better than I ever could and I don't know anything about computer specs (nor do I particularly care excepting that it DOES run). What the knowledgeable reviewers all say about Google Play is true...it's right there in the settings and once you know to turn it on, it works fine. I would not have known how to do this if not for the tech reviews, so \"Thank You!\"I was going to buy a Galaxy 10, but for the tiny, tiny price, I thought I'd try this Idolian and it has really been a wonderful addition to my nascent tablet family! I sincerely recommend this tablet to anyone who wants to play games on it, read and surf the web who doesn't require a lot of fancy schmantsy stuff in a tablet that does a lot of things that I don't even know about!!! It's like a straight shift, roll down the windows with a handle car; straightforward and no frills, but will get you where you want to go for a GREAT price!!!!", "Date": "March 25, 2013"}, {"Title": "Great buy", "Author": "C.T.F", "ReviewID": "RKZQMFSGF1JRW", "Overall": "5.0", "Content": "I love every thing about this tab. It is fairly easy to navigate and set up. I was able to download numerous apps from the Google store right from the browser.  The WiFi capability is exceptional. It downloads faster than my smart phone on a 4G data plan. I have always being an Android fan and this tablet has made my love for android even stronger;) If you don't have the money for an ipad , for less than half the price you can get about the same value with this tab. The only negative thing is that it has a specific charger that it comes with and doesn't charge with the USB port. I can only charge it when I'm at home. That being said, the battery usually lasts me all day when I am out and about as long as I set reasonable power saving settings. Highly recommended;-)", "Date": "March 24, 2013"}, {"Title": "My Review for the Idolian Studio 10", "Author": "MilanEtiko", "ReviewID": "RKPODHYHSA147", "Overall": "4.0", "Content": "well, i just got this tablet a few days ago and ive been testing the tablet to see how good or bad it is, first of all, it is a pretty nice tablet, how it looks and how it works, it looks as good as the new ipad, galaxy note or galaxy tab 2 just not with a brand name as famous as the others i mentioned but who cares, when you put it inside a case, Bye Bye! name, Besides the brand name on it looks really good. it doesnt look made by some cheap material,to be honest the Specs and the price r awesome.....im giving 4 stars beacuse of the ac/dc adapter it is huge, i mean its big for you to go with your tablet, case and the power charger its not so portable, its not as small as should be, and it doesnt charge the tablet pretty good while using it..... its no a big deal, its a great tablet so far, i totally recomend it....otherwisei know i got a big deal in my case buying this, but i have a question to the sellerwhy a few days after i made my purchase, the tablet got 30 dollars off?", "Date": "February 22, 2013"}, {"Title": "TABLET IDOLIAN", "Author": "CLAUDIA MORALES", "ReviewID": "R15319Z79AYPDM", "Overall": "5.0", "Content": "MUY BUENA LA TABLA DEMASIADO BIEN EL PRODUCTO ESTOY CONFORME CON ESTE PRODUCTO MUCHAS GRACIAS  LA MEMORIA MUY BUENA , EL TAMAÑO DEMAS DE BUENO", "Date": "February 13, 2013"}, {"Title": "WORST CUSTOMER SERVICE EVER EXPERIENCED!", "Author": "Derek", "ReviewID": "RZQOVK438640Z", "Overall": "1.0", "Content": "DO NOT BUY ANY IDOLIAN PRODUCTS!  I previously purchased their 10\" tablet and had an issue with the charging port on the tablet.  It was under warranty so I sent it back to Idolian.  Initially I was told 2-3 days, then 2-3 weeks.  It has now been more than 2 months.  You cannot speak directly to a customer service representative; your only option is to leave a message for a call back within 48 hours, which I did not receive.  I have received several emails from their support team stating time frames of warranty work; they have not followed through with any.  This is not acceptable, the worst customer service ever! Stay away from this company.", "Date": "April 16, 2013"}, {"Title": "Great Tablet", "Author": "Dblhammer", "ReviewID": "R21TII2R9TU1UA", "Overall": "5.0", "Content": "I have had my tablet for a week now.  I am totally impressed with the quality and operation of this unit.  I looked at several different brands, and this one won hands down.  I would recommend this tablet to anyone with no hesitations.", "Date": "January 13, 2013"}, {"Title": "Great Tablet for the Price", "Author": "Robinson Cruz", "ReviewID": "R3HLJREHIETDJB", "Overall": "5.0", "Content": "I think the volume on the internal speaker is good enough, Display is very good crisp images on games, video and pictures, works very smooth and haven't freeze or lag, play store working perfect as well as the google and amazon apps. It's a great tablet for its price.", "Date": "December 26, 2012"}, {"Title": "DO NOT BUY FROM THIS COMPANY.", "Author": "Ronald A. Barkey", "ReviewID": "RCZ6TX5UC3TYK", "Overall": "1.0", "Content": "As other buyers have stated this tablet freezes upon startup and will not get pass the idolian icon. This is what has happened with my tablet which was purchased in January 2013. Within one month the tablet quit working and I contacted Idolian service. After several weeks I got a reply to call them. Then the phone tag started until finally I talked to a Joey Salinas who sent me a firmware update by a download site.The tablet worked for several months until it froze again. This time I requested a RMA to let them repair the tablet. The tablet was shipped to them on Sept 8 and I have been waiting ever since to get my tablet or money back.IT'S BEEN 4 MONTHS!You get an automated reply if you send an email telling me that they are waiting for parts to arrive.People this is 2013-SHIP IT OVERNIGHT! They even have Fedex in China these days so that's the worst excuse I have ever heard.I have contacted the California Attorney General's Office and filed a complaint against this company and I suggest to everyone else who has had problems with this tablet do also.", "Date": "December 10, 2013"}, {"Title": "studio10 idolian tablet", "Author": "robert byrd", "ReviewID": "R2R34AINOAT1IO", "Overall": "2.0", "Content": "I purchased this tablet 1/13/13, It froze on android screen in april 2013, contacted cust/support they send you to download page. If download doesnt work the call back number (9493982203)tells you to leave your number and wait 48 hours no body returned my call. My advise is to stay away from idolian tablets for now, not ready for prime time yet.", "Date": "July 27, 2013"}, {"Title": "please reas very importent", "Author": "ryan gibson", "ReviewID": "R1WO1O8GHEVWGH", "Overall": "4.0", "Content": "For the price you litteraly can't go wrong at least so I thought I bought the tablet back in march for my birthday and worked perfectly for hat I needed it for movies,games, ext Intel one day on start up it got stuck on the boot loader android logo so I called idolian and took several calls to get through but I got through so I told them my problem of It getting stuck on the android logo and they told me to give them my email and they will send the new firmware update so they did and told me to call them back to update my tablet takes about 45 mins and after update my tablet workers anime running on android 4.2.2 from the previous android 4.1.1 would give five stars but customer service is terrible :-)", "Date": "June 10, 2013"}, {"Title": "Studio 10", "Author": "vtinla", "ReviewID": "R7URBCE4Z168P", "Overall": "5.0", "Content": "I have had the Studio 10 tablet for 4 months now and think it's a great tablet for the price. The specs for the tablet is as good if not better the the higher price tablets. The tablet speed is fast and the video is great. I haven't had any problems with the tablet and use it mostly to watch video off the internet. It's true that the front and rear camera arem't much, but who buys a tablet to take pictures? The only con that I have with the tablet is that I can't run the Hulu app on it (Hulu doesn't recognize the device).", "Date": "May 8, 2013"}, {"Title": "Too many problems", "Author": "Frequent Amazon User", "ReviewID": "R1X2ODE0H4YBU6", "Overall": "2.0", "Content": "Before buying this tablet I did read the reviews about it and it did not seem so bad. After purchasing the tablet on 3/1/2013, I did like it at first until I started having to do a factory reset on it every week because my apps would stop responding. I contacted Idolian and they told me I would just have to keep resetting it when my apps stopped responding. After resetting it quite a few times I decided to not put any apps on it, which was really upsetting because that's what I brought it for, but it started to work pretty well since there was nothing on it. I complained to Idolian a couple times about the problems but they told me I had to contact Amazon if I continue to have problems because that's where I purchased it from. But now my charging port on the tablet has stopped working all together, I have brought 2 additional chargers (one from Radio Shack and One Idolian from Amazon) because I thought my charger was just broke but neither one of them work and since my 30 day return window is over and its past April 2nd I can only receive half a refund. I feel like I been robbed, I haven't been able to use the tablet for almost 2 weeks and next time I will just pay the money and invest in something a little more expensive. Buying the tablet and 2 extra chargers cost me around $300 and it all went down the drain in one month.Just invest a little more and buy something worth it!!! I know I will!I am an active Amazon shopper and I have never been so disappointed in a purchase!!!", "Date": "April 16, 2013"}, {"Title": "Worked great for six weeks.", "Author": "harry wood", "ReviewID": "RPMDXVBNDP0CU", "Overall": "1.0", "Content": "I am having to return the tablet because it completely froze up. It won't turn on no matter what you do. I wrote Idolian 3 times before they responded. They said it has a limited warranty and after 6 weeks I am sure that I will get a charge for them repairing it. They responded to me by saying they had e-mailed me back everytime I wrote them. I guess they were using a idolian pad because it took me 3 times to get an answer. I would recommend anyone to research the Idolian online, that is if you can find them.", "Date": "April 10, 2013"}, {"Title": "Good while it lasted.", "Author": "mylittlerune \"mylittlerune\"", "ReviewID": "RCXPKTM61Z96D", "Overall": "1.0", "Content": "First off, it is EASY to get google and google play to work on this, just follow the instructions the other reviewers mentioned about going into the settings.Also, you have to charge the tablet for 4-5 hours BEFORE YOU EVER TURN IT ON!! This is the same for ALL electronics. Some people said they turned it on right out of the box without charging it first, and they thought the tablet battery didn't work. They are dead wrong, they just didn't know what they were doing. Charge it fully first, then the first time you use it, use it until the battery completely drains before charging it again. This will increase your battery life.And you can't just stick the charger in, you have to push it somewhat firmly until you hear a faint click(don't be too rough though). That is why some people complained of loose charger connections. These seem to be the main complaints other people had who rated this with low stars, and they aren't really problems, you just need to know the proper way to use the tablet.Anyways... I adored this tablet for the entire first day I had it. It was perfect, lightning fast, excellent graphics, not too much bloatware, lightweight but quality build, excellent sound(for a tablet). Much better than my laptop in every way imaginable, and somehow it was SO much better than all my friends' $500 tablets.By the second day, I had the same problem several other people have mentioned having. It starts up but gets stuck on the Android load up screen. Hard resets, pressing the factory reset button, charging it for several hours then trying again, waiting a day then trying to start it, starting it over and over, letting it stay on the android start up screen to see if it ever continued(an hour later, still nothing). None of this worked.Luckily, it was still within the time frame to return it to Amazon, but unfortunately by the time I got my refund the price for the tablet just went way up so I can't afford to buy another one to replace it. Hopefully the price will drop back down soon so I can replace it. I have high hopes that the one I got was a dud and a replacement one will work better. It still has better reviews than most other tablets, and has SUCH better specs for this low of a price.We'll see.", "Date": "April 7, 2013"}, {"Title": "Excellent Product !!!", "Author": "Donny Hurtado \"Kntonchino\"", "ReviewID": "R1QS766XU7JWRM", "Overall": "5.0", "Content": "Después de tanto esperar por fin tengo mi Tablet Idolian Studio 10.Lo primero fué cargar la batería por unas 4 horas aproximadamente, al inicializarla la pantalla touch es bastante sensible pero aceptable, la resolución es muy buena, el SO Android 4.1 (Jelly Bean) es rápido y amigable, se puede conectar pendrives por el cable OTG, el sonido es bueno aunque sería mejor si fuese en Stereo. La resolución de las cámaras (frontal y trasera) son buenas para una videoconferencia.Google Play no viene instalada de fabrica, se graba el apk en la memoria y se instala. al acceder a la tienda Google Play ésta reconoce la tablet sin problemasEn verdad recomiendo este tablet. Más adelante vuelvo a comentar sobre esta tablet...After much waiting finally I have my Tablet Idolian Studio 10.The first was to charge the battery for about 4 hours, to initialize the touch screen is quite sensitive but acceptable, the resolution is very good, the Android OS 4.1 (Jelly Bean) is fast and friendly, flash drives can be connected by cable OTG the sound is good but would be better if in Stereo. The resolution of the cameras (front and rear) are good for a videoconference.Google Play not factory installed, is recorded in memory apk and installed. to access the store Google Play it recognizes the tablet without problemsI really recommend this tablet. Later I return to comment on this tablet ...", "Date": "March 26, 2013"}, {"Title": "Nice tablet!", "Author": "R. Eason \"R Eason\"", "ReviewID": "R11FKGBODZ3PVY", "Overall": "4.0", "Content": "I bought this tablet as a replacemnet for my dad's laptop that was stolen.  I figured it would be fine for him since he needed email, casino games, facebook, etc.  I thought if he didn't like it then I'd have a sweet tablet for cheap.THE GOOD:seems powerful and quick, well built, solid.  Runs everything fine.  I ran some games like angry birds and all seems fine.  He likes the tablet and uses it a lot.The BAD:As others have said on here, it took a while to get google stuff setup on tablet...its not ready to roll out of the box.  I had to reset the tablet to factory settings once because the first time i turned on google it was having troubles and was restarting.  Also like others have said...I'm not thrilled that the tablet can only charge with their charger.  When I go on a trip I would like to only carry one USB charger that carges my phone and the tablet.SUMMARY:If you're a little geeky to set the tablet up you will be happy with the tablet.The tablet is roughly the same size as the Dell Streak 10 Pro.  I was able to get a case for that tablet that is almost perfect...the dell is thicker so the idolian is a little loose and i had to take the scissors to make some extra holes for the charger and power buttons.", "Date": "February 27, 2013"}, {"Title": "What's with the google", "Author": "PurlyGates", "ReviewID": "R3UKW17QD45YOS", "Overall": "4.0", "Content": "This tablet is very nice and I really like it.  What I don't like is that android apps have a problem with it unless it's a google app.  I would not have bought it if I had know about \"google world\". It is not for a novice.  I was expecting more battery power longevity. I get very frustrated with all this google stuff.I was under the impression after reading reviews that this was a pretty clean tablet with only a few apps. You have to have google this and google that.  It won't even let me use google maps and navigation.I've used google as my search engine for years and this tablet goes overboard.  If I had wanted a google tablet I would have bought one.The tablet isn't bad just I feel I don't have very much freedom.", "Date": "February 13, 2013"}, {"Title": "10\" IODOLIAN Studio 10 Tablet", "Author": "Gary vannorsdel", "ReviewID": "R2O0HV7HOH52S3", "Overall": "4.0", "Content": "Would have given 5 stars but had to work to find out how to turn on Google. Also screen has some imperfections (like an average screen protector had been added by a lay person).", "Date": "January 2, 2013"}, {"Title": "Junk", "Author": "Cheryl", "ReviewID": "R2P09RWC6SEXQT", "Overall": "1.0", "Content": "I bought this a year ago and have had approximately 3 months of halfway decent use from it. There is absolutely no support, so you are on your own if you buy. I have sent it back 3 times, still does not function properly, shuts off constantly, jumps around from screen to screen, they do not let you know if there are firmware updates. I added a card, bought new plugs, spent a royal fortune in mailing it back to them and they ignore me. Buy at your own risk. I see many people who like theirs in reviews, well I got the lemon and they are oblivious to customer satisfaction.", "Date": "March 21, 2014"}, {"Title": "weak wifi adapter", "Author": "Rock-Mud", "ReviewID": "R40SHYKBX3SIH", "Overall": "3.0", "Content": "The Idolian studio 10 android tablet is overall a good product in most every way in the short term. The one exception for my particular device is that the wifi adapter has always been weak. I could not get a usable signal outside of 15 feet. After only 5 months of use, the wifi adapter is completely useless. It works for maybe 5 seconds and then goes out again. Without the ability to download apps and docs, the device is useless. I hope that I just got a bad adapter and that not all studio 10's are this way.", "Date": "June 29, 2013"}, {"Title": "poor quality, many problems.", "Author": "BigBuyer", "ReviewID": "RGFYH0IJ053A2", "Overall": "1.0", "Content": "Not only does the screen crack easier than even an ipad, it has software issues as well. If you have too many widgets on your home screen(s), it will shut down and not start up again, and if it does manage to turn on again it wont stay on for more than 15 or 20 seconds before all the apps and programs start shutting down due to insuffciant disk space and the entire tablet freezes, witch means there is not enogh time to delete widgets from the home screen. it is awfull, i can no longer use it less than 3 months after purchase, and i would have rather not even bought a tablet, let alone this piece of junk.", "Date": "June 10, 2013"}, {"Title": "lovin it!!!", "Author": "Dorie", "ReviewID": "R3HBPYSF8QEKA1", "Overall": "5.0", "Content": "After reading all the other reviews, I was able to install apps. If not for the reviews I probable would have return this item. Sooooo Glad I kept this tablet. so far so good!!! Thank you Amazon", "Date": "May 18, 2013"}, {"Title": "hi hopes", "Author": "slowsuki", "ReviewID": "R1UDWDUHQYSSKW", "Overall": "2.0", "Content": "just recived this tablet today[refurbished], opend it up , turned it on. battery was charged , screen was yellow and had flashing lines,  to bad i liked the feel of the unit but will not buy another one. tried the reset sevrel times, but no luck..", "Date": "May 3, 2013"}, {"Title": "Good enough", "Author": "Kyle Brackebusch", "ReviewID": "R3QAJEYEVNRMYK", "Overall": "4.0", "Content": "As with others I wish the charger was usb or some thing magnetic that wasn't so easy to break. I don't know this for sure, but I believe one of the reasons this is cheaper than comparable competition is that the screen quality (actual glass) isn't top notch. I have found that it scratches and marks quite easily which is a bummer to find out after the fact. I recommend getting a screen protector at the same time.", "Date": "April 27, 2013"}, {"Title": "Poor design and freezes up regularly", "Author": "Donald Brown", "ReviewID": "R2D6ISE5MD49NB", "Overall": "3.0", "Content": "I have only had this tablet for 2 weeks and it has started freezing up at least every couple days. I have to hold the power button to force it to shut down then restart it. I don't like that it only has 1 speaker and its on the back of the tablet instead of on the edges so any case you use with it muffles the sound. The tablet also does not have GPS so I cant use any apps that require it, which is one of the reasons I bought the tablet. There are a few good points to it though. They do include several types of adapters to use with it and I like that the screen is very sensitive and easy to use.", "Date": "April 22, 2013"}, {"Title": "Love it, but immediate issues with the wall charger.", "Author": "James", "ReviewID": "R8JSSU4K9EPG0", "Overall": "5.0", "Content": "Love it, but immediate issues with the wall charger.I purchased this tablet in February of 2013 and it was my first experience with a tablet. I was extremely satisfied with the screen resolution and the sleekness of the body. However, the wall charger is not dependable. It just recently gave out after only a month’s usage. I would highly recommend this purchase, but buy an extra charger just to be on the safe side.", "Date": "April 10, 2013"}, {"Title": "great", "Author": "Blake C", "ReviewID": "R1LKVW9XIZ6BGT", "Overall": "5.0", "Content": "I'm very happy with my purchase. This is a great tablet. Does everything I need it to and more. I love it!", "Date": "February 27, 2013"}, {"Title": "Great Tablet for 3 Weeks", "Author": "RZA390", "ReviewID": "R275CBFB7F8XWL", "Overall": "2.0", "Content": "I was so excited that about receiving this tablet especially after the good reviews I saw and the fact it was under $260 - can't go wrong, at least I thought.Out of the box, worked exactly as advertised. Display looked great, fast response time, and not a lot of pre-built apps so I didn't have to lose memory on items I was not interested in, which I also liked cause it saved me time from having to \"clean\" up the icons. It had standard android features and easy to setup wifi.  Not too complicated for a user like me (busy, working mom, tech savvy but not expert, and someone that appreciates finding quality items for lower prices- I'm not brand driven.  I like one item that I can carry around to help me stay organized and relax when needed.  I have an iPhone but only 8GB so why I was looking for a tablet).After the first week, the tablet started responding slower. This is after downloading a whole bunch of apps and taking pictures (which btw you can tell you had a very low megapixel camera, bad exposure). I also kept on getting an error message that actions were not being able to complete due to lack of storage. I knew it was impossible- tablet was 16GB (I know you don't get entire space) and had a 16GB SD card so I checked settings and realized that the built in 16 GB was split in two. There was a system storage space then a separate storage space with a majority of the memory, like an internal SD card, then another section for my SD card. I wouldn't care about the split for the internal system if it would allow me transfer between the two but Nope, i had to transfer to my memory card, which was a lil annoying but didn't really bother me.Then a couple days after, after charging the tablet overnight using the charger that came with it, I turned on the tablet and the screen flashed a bright red color on startup, white backgrounds were showing up as a blue color, and tablet felt really hot. So I turned off tablet to allow to cool and when I turned on it was fine. So I got a lil concerned but still not thinking badly about it.  The same issue happened again a few days later, but this time didn't go away (I bared with it for 3 days before I decided to report it and return the item).Since Amazon was great and gave me a hassle-free refund, I started thinking if I wanted to give this tablet a 2nd chance (every brand can have one defective item) so I started thinking of the features I didn't like about it so I would know if I can tolerate it--Had Flixster app but I couldn't download or even play to watch Flixster movies directly to the tablet. When I am with the kids in a place that doesn't have public wifi, it's great being able to pull up movies to entertain. I do it with my iPhone so was hoping it could be done with the tablet.Speakers sounded good but when I used headphones, sound was muffled and was very low. I know it wasn't headphones cause I use with iPhone and portable DVD player and sounds great.Low quality pictures - it didn't advertise better but I'm thinking the low megapixel and the size of the screen just made the picture look more grainy so I think I need a higher megapixel camera.", "Date": "May 18, 2013"}, {"Title": "Very Nice", "Author": "Lewis", "ReviewID": "R2AN9PJZQ0Q4B3", "Overall": "5.0", "Content": "I'm happy with the purchase have not used it much in terms content but slowly getting thier. I will write another review in a month or so.", "Date": "April 2, 2013"}, {"Title": "Not Worth The Money", "Author": "Deidra", "ReviewID": "R3EDJDCLT0HCT1", "Overall": "1.0", "Content": "I purchased this item for personal use and once it arrived I was very pleased with it. However, after 24 hours the tablet completely stopped functioning. It would stop at the start-up screen and it wouldn't go any further. I called amazon and they emailed me a return label and the tablet was shipped back. I would not recommend this item to anyone...complete garbage!", "Date": "March 26, 2013"}, {"Title": "I was in love at first", "Author": "remedy378", "ReviewID": "R37FHL17MPX7SN", "Overall": "4.0", "Content": "I was initially very excited about this product. I really wanted to purchase a product that was American made. I try to support American companies. After reading several reviews and looking at the price point, I determine that I was about to make a good purchase. When I receive it,it was package very nicely and when I took it out of the box, I charged for the time that was required to be charged. Then, I had the opportunity to use it. I was very impressed. It was very fast a responsive. I was instantly in love with this tablet. Allwas well. The only issue Idid have out of it was youtube videos with stop playing half way through, No, about a minute in they would just freeze. But I think it has more to do with the app then it did the tablet. I could go anywhere else on the Internet and watch videos and they were fine. A a little over a week later, it stops charging. It's not the charger. Is the charging port. So needless to say I was a little disappointed I was ait wouldn't have been that big of a deal if I could have used the USB port to charge. That's the only problem that I had, but that is a major problem. Even though I know that I have a year warranty on it, I didn't want to take the chance. So I sent it back got an Asus transformer 300(which only costed 20 dollars more). The studio is a good products but they need to work on the quality of their products.really wanted to love this tablet", "Date": "March 8, 2013"}, {"Title": "Battery would not accept a charge!", "Author": "maynard320", "ReviewID": "R3V9GF87WHAE4Q", "Overall": "1.0", "Content": "This unit had a nice feel and look. The picture was great. However the battery would not accept a charge! I left the unit on charge overnite but to no avail! Also I noticed the google play store was not installed on the unit. I could not get it installed on it as well. But truth be told I did not have too much time to really get into the tablet as the battery was low from the factory.  I sent the unit back to amazon with no problems on their part! I was amazed that shortly after the UPS man picked up the unit I received an email stating my credit card refund was being processed! That was fast! It is hard to give any involved review in the short amount of time I had to explore the tablet.", "Date": "February 19, 2013"}, {"Title": "AWESOME !!!!!", "Author": "Jesus Tirado", "ReviewID": "R187MEODFWZE4H", "Overall": "5.0", "Content": "Doesn't have the Asus, Samsung and other famous brand name but this thing is awesome.  Love it.  Recommend it.  Get it.", "Date": "February 18, 2013"}, {"Title": "Poorly Designed power interface", "Author": "Eileen", "ReviewID": "RVI1IVE4Z304W", "Overall": "1.0", "Content": "I loved this tablet!  Right up until it no longer worked after just 27 days.  The overall rating was 4 stars, but when I looked at the lower ratings I found that the power cord interface was regularly causing issues...and so I returned it.  I received a full refund very quickly, but now I have multiple items that I puchased to compliment the tablet that are useless until I purchase another 10 inch tablet.  I was very disappointed with my purhase.", "Date": "February 18, 2013"}, {"Title": "Should have bought a brand new one!", "Author": "PAM PYLE", "ReviewID": "R2PF35PJZFS14E", "Overall": "3.0", "Content": "I was under the impression that it was suppose to be just like new. But it had a scratch on the front and a couple rubbed areas I cannot get off of the screen! Also I have no instruction book!", "Date": "February 17, 2013"}, {"Title": "It's been a bumpy ride", "Author": "John", "ReviewID": "R2QG7OCWH6TUT7", "Overall": "3.0", "Content": "Before I gave it 4 stars for the price and functionality and I was willing to put up with bugs considering Idolian claims to be releasing a firmware update, but that's changed now because after about 3 months of ownership my tablet died on me. It boots to the white Idolian screen then goes to the android screen and loads forever. I let it sit for an hour before shutting it off just make sure it wouldn't factory reset itself like it did with a previous, similar problem. I filled out one of those tech support claims on their website but after keeping the box and order receipt for 3 months I threw them away so if I need either of those things to send it back to them I'm screwed(my own fault, but products shouldn't crap out after a few months).Supposedly their support is good so I will have to wait and see what happens but I'm already planning on getting something different because I don't have much hope for it.Specifically this: http://www.amazon.com/ASUS-TF300T-A1-BL-10-1-Inch-16GB-Tablet/dp/B0082CPCR4/ref=sr_1_3?s=pc&ie;=UTF8&qid;=1364053792&sr;=1-3or a cheap chromebookIt sucks that real companies like Asus don't make cheaper, slightly watered down products like this Idolain for $80 more its a pretty sweetUPDATE: So,  I found my order number and emailed Idolian's customer support and the we're quick to reply but they weren't so quick when I called. So if you do buy this and need help, email them. They told me to hit the reset button which is apparently supposed to factory reset it. I already diddly that but I tried it again and I had to mail it in. It took about 3 or 4 weeks to come back (ironically, the day I got sick of waiting for it I emailed customer support for an update only for them to email me back within 5 minutes to say it was coming that day). The sent me one in a new box with a set of cords and everything. I like extra cords so I'm kinda forgiving. The tablet itself (which I'm writing this review with) is probably a refurb and there's a slight yellow color on the top of the screen by the camera but other than that it's fine. I still have the same issues as before, putting it in sleep mode disconnects my micro sd card so I kind of stopped using it. Before I had a problem because whenever I turned on my device it would use the stock keyboard instead of swift key so I'd have to set swift key as the default but that doesn't happen anymore.After using this for the last month I've decided to not buy a different tablet because this one is working fine. Of course, now it's even cheaper than when I bought it so it's still an ok deal for this device. If you can't afford anything else, this tablet isn't your worst choice cause otherwise you'll need to spend an extra $100. If you have the money and plan on using your tablet a whole lot then you might want look somewhere else", "Date": "January 26, 2013"}, {"Title": "problems with wifi reception and sd card management", "Author": "Oakparkhiker CA \"Oakparkhiker\"", "ReviewID": "R3I7RZMZ7C2F2G", "Overall": "2.0", "Content": "My unit was unable to connect with my phone's hotspot.  I am returning it.File management for the sd card was unreliable so files could not always be copied or deleted.I liked the design and features very much and am considering reordering it", "Date": "January 19, 2013"}, {"Title": "it really good", "Author": "jj", "ReviewID": "R150HLYY7JW3RI", "Overall": "4.0", "Content": "mines didn't come with google play. and it takes a while to stream youtube videos, but that might be anetwork problemother than that its good.its probably the best in its price range", "Date": "December 29, 2012"}, {"Title": "Love it but Hate it!", "Author": "Rebecca Krause", "ReviewID": "R2VS5XL2JNV8G8", "Overall": "1.0", "Content": "I purchased this tablet on 12/29/2012.  It's estimated arrival date was 1/4/13, however, it did not arrive until 1/7/13.  I opened it and connected the charger right away, however, the battery would not take a charge.  It was a wonderful tablet, but only worked when it was plugged in, not very efficient...Now I have to return it, wait for my refund, and purchase another.  VERY Frustrating, as I was hoping to have a product that worked out of the box, and not one that must be returned.", "Date": "January 10, 2013"}, {"Title": "I Wating", "Author": "Alexandra Infante", "ReviewID": "R13B35F55U3VKC", "Overall": "3.0", "Content": "The screen glass has several scratches and didn't have the plastic screen protector that usually every brand new electronic device has on the screen.27/02/2013 if you like to buy a tablet and use the camera for taking picture, this tablet is not what you want to buy. The picture quality and camcorder is a joke", "Date": "February 26, 2013"}, {"Title": "you should really read this", "Author": "Moonnbeam", "ReviewID": "RQ39U9ASSYWH1", "Overall": "1.0", "Content": "So my other half wanted a tablet really bad, she did a lot of research on them and came across the idolian studio 10, she was pretty convinced it was a good product because there was a bunch of good reviews. I tried convincing her she would be better off with a well known manufacturer such as samsung etc but she wanted this one mainly for the great reviews and the price point. So I bought it for her, received it and she opened it and here is our review.....................did u enjoy the review? Cant review anything if u cant get past the damn opening screen yea? We can't even get past the unlock screen, swipe and motion on the tablet is disengaged, won't work, after about 25 swipes over the unlock button it finally unlocks and freezes, no buttons respond, no back button or anything, so we lock the screen again to see if we can unlock it again, guess what....NOT AGAIN!!!! REALLY?????? Won't unlock again and this time we swiped over the unlock about 35 times and nothing. We cant even power the damn thing off because THAT button doesnt respond either!!! Sitting there frustrated we try rotating the screen, yes it rotated but then that also stopped working...figures. Yes we understand there will be same devices that work flawless which get raving reviews, good for them, this is our story. We have requested a refund on the product and shipping because we paid for 1 day shipping and will leave a seller comment to let you know how the seller responds, and if they refunded our express shipping (sry but thats important) Here is another key point I should of brought up to her, when we were looking at new devices there were also refurbished ones, I believe there were 12 at the time, we waited to buy because we were doing more research, when she wanted to buy a new one the refurbished numbers had gone down to 8....we still waited, when we were ready to buy the refurbished numbers are back at 18...just saying, if those numbers keep going up and up the device cant really be that reliable if u ask me", "Date": "February 27, 2013"}, {"Title": "Promising Start- Disappointing ending", "Author": "Summer's Mom", "ReviewID": "R114DTORV98QFO", "Overall": "2.0", "Content": "Started off very impressive- met or exceeded the ipad 1 and 3! By day 6...freezing/locking up/ factory resest every few hours. No response from Idolian \"customer Service\" and og course, no forums for unknown brand. When flash videos quit playing and FB/Words quit loading, I'm done. Bright side? Thus far, return process has been hassle-free. I'll ship it off tomorrow, and see how long it takes to get the dinero returned!", "Date": "January 17, 2013"}, {"Title": "Typical Chinese Product", "Author": "Rodolfo Paez", "ReviewID": "R2LCRBWYGGELNI", "Overall": "1.0", "Content": "It only worked for a week. It also came without Play Store.  Not Cool!  It was nice when it when it worked that's why I gave it one star.Rudy", "Date": "January 15, 2013"}, {"Title": "The screen glass has several scratches", "Author": "hamid", "ReviewID": "R2W62D3025AJLH", "Overall": "1.0", "Content": "The screen glass has several scratches and didn't have the plastic screen protector that usually every brand new electronic device has on the screen.Update on 12/28/2012, if you like to buy a tablet and use the camera for taking picture, this tablet is not what you want to buy. The picture quality and camcorder is a joke, I am very disappointed.. update on 01/05/2013,the tablet  shut itself off every ones a wile with no reason or freez when I was trying open a video file. More disappointing.", "Date": "December 24, 2012"}, {"Title": "Beware", "Author": "The Redhead", "ReviewID": "R3V5FKIJHBNGP4", "Overall": "1.0", "Content": "This tablet is NOT compatible with Google Play!!  You cannot load any apps, watch any movies (you can't put flash on it either) . It was fast running and easy to set up, but without apps or the ability to watch movies, it wasn't much use to us.  We returned it.", "Date": "January 16, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00A8RKTWO"}}