{"Reviews": [{"Author": "Kevin Remley", "ReviewID": "R1IP588S405WS6", "Overall": "2.0", "Content": "I wouldn't have this if I didn't get it for free.  My work gave it to me as a 5 year gift, thankfully I had no intention of actually using it like a true tablet.  Instead, I've loaded the Kido'z app on it and it's simply used by my kids.The issues are plenty:1)  Slow Wi-Fi - Even when I'm in the same room as the router and the icon shows it has a great signal, anything involving the connection is extremely slow.  Whereas my smartphone being used in the exact same spot has no issues whatsoever.  However, this may be a result of the other hardware in the tablet and leads to the next issue.2)  Slow operation - This tablet cannot do two things at once.  If you are trying to download or install any apps, just set the thing down and come back when it's done.  It cannot handle downloading/installing even one app and be used for anything basic...like swiping through the screens.  It almost completely locks up or takes about 5 to 7 seconds to respond to any touches.  Absolutely terrible.3)  Unresponsive to touch - This is not the current technology used in major smartphones these days.  It usually takes multiple touches for it to recognize anything.4)  Hardly any memory - This is ridiculous.  Sure, it comes with a 4GB SC card...but that's of no use when all apps are default installed to the internal memory that has only 500MB.  Yes, you can go and move certain apps after they are installed to the SD, but not all apps can be moved to the SD card.  Therefore, good luck installing many apps on this thing before you quickly run out of space.Do not buy this for routine tablet use.  It's not worth the money at all.  Spend another $100 or so and get a Nexus 7.", "Title": "Don't Waste Your Money", "Date": "May 2, 2013"}, {"Author": "Krishna Maragh", "ReviewID": "R3DG2V9Z401IM5", "Overall": "1.0", "Content": "I didn't buy it on Amazon, bought it from a local shop for my dad,It stopped charging after some weeks. It wasn't used much.USB charging didn't work either.Will return it soon.", "Title": "Not from Amazon...", "Date": "July 13, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2YRO1DNCHCSAT", "Overall": "1.0", "Content": "I was given this tablet as a gift. I have 2 notebooks, a laptop and a samsung android phone, I am shocked by this. Picks up only a Fair signal from my wi fi. connection lost message so cannot download apps. Just another way to take advantage of poor people. Very sad, had no idea this market even existed.", "Title": "sad", "Date": "September 1, 2013"}, {"Author": "Bernard Jackie", "ReviewID": "R3IB8YK81Z6Y9B", "Overall": "5.0", "Content": "I chose this rating because the product is good and it was received on time. I would recommend this product to anyone of my friends or family because it is good.", "Title": "Good stuff", "Date": "March 21, 2014"}, {"Author": "Allison Lay", "ReviewID": "R1CO7OUWDX274B", "Overall": "3.0", "Content": "When I received it I thought it looked different very cheap feeling.. but other than that my son loves it.. he's 3..", "Title": "good for 3yearolds that dont know better", "Date": "December 31, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00ANHI3OU", "Features": null, "ImgURL": null, "Name": null}}