{"Reviews": [{"Title": "Outstanding for the price (You get what you pay for after all) Details Below", "Author": "Jim Johnson \"Truth Seeker\"", "ReviewID": "R28ZPT8KC74X7I", "Overall": "3.0", "Content": "EDIT:There was a mix-up on specific models.  The review below applies to this specific model --> Proscan Internet Capacitive Included KeyboardDo not buy this one.  Buy the one linked to above.  It is only $10 more and it is much better.  I have heard that this model does not have access to the Google Play store, and struggles with even playing back a movie.*****  Review for slightly different model of same item, available here: Proscan Internet Capacitive Included Keyboard *****Firstly, let me state that the 5-star rating is comparing this table to OTHERS IN ITS CLASS.  This is not a Nexus, Asus, or Samsung tablet.  It is a bargain tablet in the low end range.I have tried several tablets that are below $100 and they were all virtually unusable, except for this one.  That being said, here are the pros and cons as I see it, including the things that make this tablet difficult for some:Pros:1.  The cheapest tablet available that is actually usable2.  If you get a bad one, Amazon will replace it.  Also most brick and mortar stores let you exchange/return as well3.  Runs Android 4+ so you have access to almost all the latest apps4.  Has the Google Play store among others.  Most cheap tablets lack the Google Play Store which cuts you off from the best apps5.  The included keyboard and case (if you're model comes with it) are really nice and work very well.  What a bargain!  I sometimes use the keyboard/case with my Nexus 76.  HDMI output is available so you can stream movies from the internet or an SD card (or home DLNA server) and watch them on your TV7.  The battery lasts for at least 4 hours of continuous use (haven't tested it too much).  It will go a couple days with light use8.  The expandable storage slots are nice9.  Has a capacitive touch screen so you don't have to push hard to get it to register the touch.Cons:1.  The wireless antenna sucks.  It doesn't have the range that the higher end tablets have.  This means that internet browsing will be a bit slower, and you can't be on the outskirts of the range.  It works consistently though as long as you're close enough to the wireless router.2.  The processor is slow, so it is far from snappy and responsive like a Nexus 7.  However, for less than half the price of the N7 you shouldn't expect it to be comparable.3.  USB charging is not available, so you have to use the included wall adapter.4.  If you want to play games with heavy graphics, the tablet will lag and stutter.  My kids play \"My Play Home\" and other graphical yet non-intensive games all the time without problem.5.  Even when close to a wireless source, the download speeds can be too slow for streaming video over the internet.  The best way to watch video is to put it on the SD card and play it with JoeVLC ([...]) or the built in player.Would definitely buy again, very happy with the tablet for the price.", "Date": "June 24, 2013"}, {"Title": "Not so good", "Author": "dhicke", "ReviewID": "R3GW6U5TH7DKE5", "Overall": "2.0", "Content": "Looked like an outstanding bargain: an Android tablet with case and keyboard for under $100. The case and keyboard were great. The tablet looked good and worked fine except when using the internet. Download speed was painfully slow. If we tried to play a video on a web page, it would eventually start playing, then stop for 10 seconds, play for 10 seconds, and so forth. We finally returned it.", "Date": "April 14, 2013"}, {"Title": "very disappointed", "Author": "nikolaus graham", "ReviewID": "R2LCHZDE6N3YPS", "Overall": "2.0", "Content": "Product I received was not the same as advertised. No HDMI port on tablet, but it was advertised to have one. Android Operating system is older version than was advertised. No other issues.", "Date": "April 1, 2013"}, {"Title": "Very good but not childproof", "Author": "Koreen Mazurek", "ReviewID": "R285OQ1DOMWX3L", "Overall": "3.0", "Content": "It lasted me a month.  My 3 year old stepped on it and it was gone.  My father's kindle has lasted more than a year with my three kids handling it (even my 1 year old).  I suggest a stronger and thicker child proof glass.", "Date": "July 27, 2013"}, {"Title": "Wish I could give less than 1 star!", "Author": "The Freelancer2501", "ReviewID": "R3O15C74L5XXMJ", "Overall": "1.0", "Content": "My mother bought one of these without doing any research and gave it as a gift to my sister.  Now I spend way, WAY too much time fixing this forsaken piece of junk!  When it first came out of the box it wouldn't work properly and I had to go through the trouble of finding out how to and running through the ridiculous task of reformatting the device to get it to even START WORKING!  The Klu is incompatible with Google Play, crashes at the drop of hat, almost refuses to keep a charge, won't run most apps installed on it, this monstrosity is a hopeless mess!  Forget the price point, forget the \"you get what you pay for\" BS, just do not, I repeat DO NOT BUY this pitiful excuse for hardware.  Save up, get something from a more reputable company. This thing isn't even worthy to be a coaster!", "Date": "April 17, 2014"}, {"Title": "Good buy hehehe", "Author": "J. Gutierrez \"JG\"", "ReviewID": "R4EB5NN0LHCJI", "Overall": "5.0", "Content": "This is a great buy.  It was a gift.  I couldn't afford a pricier gift.  The price for this tablet was excellent.  The vendor was right.  It may have been used, but it looked like new.  It worked and continues to work just fine.", "Date": "January 12, 2014"}, {"Title": "I HATED IT. I LOST MONEY.", "Author": "Hubert", "ReviewID": "R3AQQG8MSPZOYQ", "Overall": "1.0", "Content": "DID NOT WORK. BATTERY WAS SWELLED UP. NO GOOD. I HAD TO END UP BUYING SOMETHING ELSE FOR MY DAUGHTER.", "Date": "January 11, 2014"}, {"Title": "What a nice Tablet!!", "Author": "Dr. Magaji Adam Mohammed", "ReviewID": "R2HV4IGSZ9XGM1", "Overall": "4.0", "Content": "I bought it with so many things in mind, and surely it was able to satisfy my demands; so i am happy! considering its price its definately a give away!!", "Date": "January 10, 2014"}, {"Title": "review", "Author": "Becky", "ReviewID": "R3VRXH78408WEF", "Overall": "3.0", "Content": "Can not get anything to download and if it does it tells me it is downloaded but am unable to find or finish any download on this.", "Date": "December 29, 2013"}, {"Title": "sucks", "Author": "virginia", "ReviewID": "R142H4ENW1IALU", "Overall": "2.0", "Content": "O don't like it will return it before my days are up i can't download any games the i like because the tablet don't have  google  play.", "Date": "September 18, 2013"}, {"Title": "You get what you pay for", "Author": "marcusgs", "ReviewID": "R4D87PCGLS562", "Overall": "1.0", "Content": "My wife bought me the Proscan 7\" Table (PLT7223GK6)that came with this Keyboard and Case. The Shift Key on the right side fell off within 2 weeks. I call the Customer service number in the Owners manual for the Tablet and they said, the keyboard was not part of their warranty even though it came with the Tablet in the same box and the model number includes the keyboard. I guess my we get what we paid for. I am mad that the customer service would not even provide me any information on how to obtain a replacement shift key for the Keyboard, no contact information. The tablet will not connect to my office visitors Wifi, I get a authentication problem error message and the tablet would not connect with my TV using a HDMI cable Their customer service could not help me with that ether.", "Date": "August 21, 2013"}, {"Title": "dead on arrival", "Author": "panther83", "ReviewID": "R3ID0F21JBUI8D", "Overall": "1.0", "Content": "my grandmother was so exited yesterday 8/25/13 when she went and got 2 of these tablets. because i am good with electronics she asked me to set them up for her. one started up with some kind of blue screen that went black before restarting, it then turned on fine but lagged a lot wile trying to set it up. it took me 2 hrs to do this and after all that the browser wold not work because it couldn't find our router unless we were standing directly beside it. load time was bad and the games lagged bad and so on. now, after all this i was hoping it was just a bad tab and started on the second one. THIS ONE WOULD NOT EVEN TURN ON.  NOTE, the 2 Proscan's were bought as Big Lots not amazon, but after seeing other reviews I don't think it will make any difference on the store they come from. ps if your looking for a good tablet that is under $200 try this one,  Samsung Galaxy Tab 2 (7-Inch, Wi-Fi)  I compared it to kindle fire and it out preformed.", "Date": "August 26, 2013"}, {"Title": "Terrible", "Author": "CT", "ReviewID": "R75N2UIANK69F", "Overall": "2.0", "Content": "This tablet, while not too bad in terms of hardware (though the resolution is pretty bad, and the touchscreen not very sensitive), is a flop. It's a cheap Chinese generic tablet, and is not supported or recognized by google play. It also requires an SD card for the use of certain of my favorite apps, and it's native app store \"GetJar\" is the worst part about this waste of money. Better to pony up the difference in price for a better tablet.", "Date": "March 31, 2013"}, {"Title": "Worst Tablet on the Market", "Author": "ShopperDeb", "ReviewID": "R3VBQVC28QXUCG", "Overall": "1.0", "Content": "I bought this tablet to take in a long trip. This tablet is awful. It was difficult to use, hard to get downloads on and wouldn't let me type accurately. Even  though it was in its own padded case which was then put  in another padded camera bag,  the screen cracked and the entire computer stopped working.! Three weeks old and now I only have my I phone which thankfully always works.Don't waste your money on this product!!!", "Date": "December 11, 2013"}, {"Title": "Its cheap but works", "Author": "ZipSnipe", "ReviewID": "R2KRCJA8D3N9EJ", "Overall": "4.0", "Content": "Bought two of these, one for my 2 year old who loves it and another for the wife.The GetJar is where you down load apps from kinds sucks as 95% of the stuff on there you can't download.But its great for watching YouTube but you need to deselect the HD mode as it will only play about a minute and half of HD and will only play vids 5 to 10 minutes long in regular mode. The hd deselect button is right above the back button so its easy to mistakenly hit the back button which is aggravating.It does have the older vers of Android and I haven't figured out how to get the newer version on it which it desperately needs.But hey for the money its not too bad, it keeps my 2 yr old busy and that alone is worth its weight in gold.", "Date": "April 21, 2013"}, {"Title": "proscan purchased and received 3/26/2013 from amazoon", "Author": "lottie", "ReviewID": "R2MI2JSQQSJAGX", "Overall": "3.0", "Content": "Amazon proscan 7in. Tablet. This tablet appears to be what I want and has amazon appstore loaded in as well as getjar and SAM which have many kid apps for fun an education. My tablet appears to have been defective tho. I am trying another prscan tablet and hope to write a better review. Amazon is replacing that one for me. Great!", "Date": "March 28, 2013"}, {"Title": "Doesnt work", "Author": "frank spencer", "ReviewID": "RGWRCKM0APSKX", "Overall": "1.0", "Content": "It looked great on HSn so I went to Amazon and ordered one, It arrived and it wont do anything but the camera mode. Iwant to return it.", "Date": "September 5, 2013"}, {"Title": "Klu", "Author": "Dolores del Carmen Roldán \"5621spring. Valey ...", "ReviewID": "RUX6O2015Y4UQ", "Overall": "1.0", "Content": "Not ned the orden. Is. Accident  thank. Wat is problem  Is Ok  Dot no  ned tablet.  No cumplen con lo que ofrecen", "Date": "September 4, 2013"}], "ProductInfo": {"Price": "$79.80", "Features": "Connect to the internet on any WiFi Network to browse your favourite sites (802.11 B/G/N)\nProscan 7-Inch Tablet with Google Android 4.0 Ice Cream Sandwich with Built in Camera; 1.2GHz Processor; Capacitive Touch screen - ultra responsive technology\nConnect the tablet to your comuter via HDMI port (cable not included) and enjoy 1080P High Definition video\n4 GB Flash Memory built in - Expandable to 32 GB via micro SD card; USB 2.0 included for high speed file transfer\nView web pages and media in landscape or portrait mode via automatic orientation detection", "Name": "Klu 7-Inch Android Tablet, Capacitive Touch Screen, 1.2 GHz Processor with Built In Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41W9wKLpXYL._SX300_.jpg", "ProductID": "B00AVD4PQQ"}}