{"Reviews": [{"Title": "It's Awesome", "Author": "TealBean7", "ReviewID": "R2M5ST4GJL7WTY", "Overall": "5.0", "Content": "Just got my table yesterday and I haven't put it down. I just got rid of my Ipad2 and decided to purchase the nook because I wanted something smaller. I did a lot of research on different kinds of tablets and finally decided on the nook hd. I love that it has a space for my micro sd card. It is perfect and I am confident that I made the right decision.", "Date": "August 7, 2013"}, {"Title": "Love it.", "Author": "Joan Brown", "ReviewID": "R1SUVG1HEZZM5U", "Overall": "5.0", "Content": "This was an early mothers day gift. Love it. Simple to use. Screen very easy on the eyes. So easy to see. Thanks to the best daughter ever.", "Date": "May 8, 2013"}, {"Title": "Excellent", "Author": "Jenny Fenwick", "ReviewID": "R8GGGG218H9Q0", "Overall": "5.0", "Content": "Bought this for my daughter. I thought it said it was a 9 inch screen but it's 7 instead but it's still a great size. Has everything she wanted.", "Date": "July 27, 2013"}, {"Title": "Great Buy", "Author": "Calvin Raines", "ReviewID": "RYHVAQ29M3A78", "Overall": "5.0", "Content": "Was exactly as describe by seller & my wife absolutely loves it, only thing I worry about is the darn thing gets more attention then me. Haha. Seriously it is in great shape runs perfectly.", "Date": "December 13, 2013"}, {"Title": "Great service and fast shipping.", "Author": "legendarylady \"legendarylady\"", "ReviewID": "R38RYB095SWCAD", "Overall": "5.0", "Content": "This was a gift for my parents and they loved it. She was wanting a tablet but this product gave her everything she would want a tablet for. I own a 7 inch but will soon buy a 9 inch for myself.", "Date": "January 13, 2014"}, {"Title": "Amazing, she loves it!!!", "Author": "TIMOTHY SMITH", "ReviewID": "RLAL5ELJBDL25", "Overall": "5.0", "Content": "Bought as a Christmas gift and it was well received!!  She can't put it down, great choice and great deal!!!", "Date": "January 11, 2014"}, {"Title": "Improved!", "Author": "LaDawn Moore", "ReviewID": "R2CBNR3P8ONHS5", "Overall": "5.0", "Content": "I had the first Nook Color years ago, and found it hard to navigate. I didn't keep it. I gave this Nook HD a try, and so far I've been much happier. It's user friendly,fits nicely in my palm, and easy to shop on and download. I'd recommend it to anyone who want to read with an e-reader, from young to old. It's a great product.", "Date": "May 2, 2014"}, {"Title": "no Minecraft", "Author": "Cara Brown", "ReviewID": "R2QNDRB8KG6VZB", "Overall": "2.0", "Content": "Had difficulty downloading a book.  Could not get mine craft on it which was the reason I bought it for my daughter", "Date": "April 27, 2014"}, {"Title": "nook tablet", "Author": "Barb L. Meberg \"dakota55\"", "ReviewID": "R37JBPVTKGQ92K", "Overall": "5.0", "Content": "am very pleased with the tablet was a big upgrade from the color. Is a lot easier to turn pages and have something to do quick searches on the internet.", "Date": "April 23, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AGBQO7Q"}}