{"Reviews": [{"Author": "m stansberry Virginia", "ReviewID": "R3JI93WTDJXSUI", "Overall": "4.0", "Content": "I gave it a good rating because its nice you get what you pay for the only dislikes are battery life in any tablet sucks works best with really fast WIFI getting used to the touch screen and charging it through USB connection seems faster and more reliable than the AC adapter that came with it the more i use this tablet and the google shopping bag app the more I really like this tablet", "Title": "VERY DECENT TABLET", "Date": "January 23, 2013"}, {"Author": "Roel Isip", "ReviewID": "RI1STCCSUKYQ3", "Overall": "5.0", "Content": "First of all, the delivery was super fast, A+ to that. Tablet overall is awesome for less than a $100. More than what you expect, more than what you have paid for. It tends to be sluggish once in a while, but it is not a factor. Wifi is pretty steady (it doesn't drop) and resolution is great (not as great as the ipad and samsung though). The only problem I have encountered so far are netflix and tunein radio not working at all (for an android 4.0, not likely). Battery is well enough for the entire day used. Touch screen is above average, but not as responsive as the other tablets out there. You just have to get use to it. Speed is also above average, but I do not think it is a 1.2 GHZ as advertised. It could be between 800 to 900 MHZ, but it still gives you a good speed. I still gave this tablet a 5 star.", "Title": "Great Tablet!", "Date": "March 22, 2013"}, {"Author": "Travis Mier", "ReviewID": "R1ZQGAXAOJUWA4", "Overall": "4.0", "Content": "It came in Portuguese language setting.. It took a little while to decipher and figure out how to put into English.  Then once I got all my settings and apps adjusted I am very happy with my purchase. I will be buying more for my nephews for Birthdays This will be a great starter Tablet for them!!!", "Title": "I was a little worried being a generic low priced tablet Yet I've been very happy with the product!!", "Date": "August 17, 2013"}, {"Author": "Best", "ReviewID": "R1YGH33W8GZNEE", "Overall": "5.0", "Content": "This is a great product, easy to use by anyone who is techonolgical challanged. I recommended tihis product for everyone.", "Title": "great product", "Date": "August 31, 2013"}, {"Author": "Sarah Hoots", "ReviewID": "R2JQA61WCGS61R", "Overall": "4.0", "Content": "After only having it 2 weeks, the charger stopped charging. Digital Sound sent me a return label to send it back. Hope the new one lasts longer than the first one.", "Title": "Good Product but", "Date": "April 28, 2013"}, {"Author": "C. Blake \"Picky buyer\"", "ReviewID": "RCOX0Q2NAZE0E", "Overall": "4.0", "Content": "I purchased this tablet thinking it had a sim slot, when it came in it did not.  It was ok to use wherever there is wifi and at home. Mostly used in the car as a music player thru my radio. a little slow at times and gets stuck on some screens, but for less than $100 hey why not..I will end up giving it to my nephew to use around the house..", "Title": "Nice tablet for use at home", "Date": "March 9, 2013"}, {"Author": "mario ben", "ReviewID": "R3P99ICTAF6HSS", "Overall": "1.0", "Content": "Onfe yiu have an issue there is no way to get it fixed first my brand new sd card got stuck in it then the back button is in lock position.  Contacted the seller INDIGO TERRIBLE CUSTOMER SERVICE", "Title": "no.....nono way", "Date": "June 2, 2014"}, {"Author": "Zekoo", "ReviewID": "R7QM8J5ZJLILD", "Overall": "1.0", "Content": "the BLU Touch book is great but the charging port is not good at all.... I have 5 of them that I cannot use of it :(", "Title": "the BLU Touch book is great but the charging port is not good at all.... I have 5 of them that I cannot use of it :(", "Date": "May 11, 2014"}, {"Author": "Robert S.", "ReviewID": "RHBODMUYYW96", "Overall": "4.0", "Content": "Got these for the grandkids for Christmas.  They took to them like flies to manure.  Of course, I had to set up the WiFi and put in the parental blocking.  THEN grandma came back with \"Where's mine?\"  Of course, it works great as a controller for Chromecast (if you use one of the supported apps like Netflix or Hulu+).", "Title": "Did the trick", "Date": "April 19, 2014"}, {"Author": "GovContractor", "ReviewID": "R3VQ42LZO0HR1Y", "Overall": "5.0", "Content": "I bought 3 as gifts.  Not my thing but they were very happy with the applications.  Price was very good.", "Title": "Wife and kids love it.", "Date": "March 13, 2014"}, {"Author": "Carla Cayetano", "ReviewID": "R2CYR3B75AU7LP", "Overall": "1.0", "Content": "camera did not work at alllllllllll this was a gift with someone and i was very disappointed and embarassed to find that the camera was not working on this product", "Title": "defective", "Date": "August 12, 2013"}, {"Author": "Wjhv", "ReviewID": "R18M1VE2320YYI", "Overall": "3.0", "Content": "I must say that I am very impress with the quality and everything but just one little thing. the screen isn't that sensitive and it freezes very often.", "Title": "Great tablet.", "Date": "March 20, 2013"}, {"Author": "DCP 8065DN", "ReviewID": "R38Q514J3ZG7V", "Overall": "5.0", "Content": "Beside the not so strong batteries, everything is even better than expected. Like the rubber cover. Even usb adapter included.", "Title": "even better than expected", "Date": "July 10, 2013"}, {"Author": "Laura", "ReviewID": "R67LO1L1BX6OI", "Overall": "3.0", "Content": "This is a nice tablet for my 11 year old daughter.  However, the battery life is not very long.  It will last longer if the WiFi is off, only a couple hours if you enable the WiFi.  It works with the Google Store so she can add all her Android apps she previously purchased which is a huge bonus.", "Title": "Nice tablet for my child", "Date": "February 10, 2013"}, {"Author": "Mandu Davies", "ReviewID": "R2S1BJM6RJN4RK", "Overall": "1.0", "Content": "amazon should review what people sell here, this product i bought is of no use to me because it does not have english and , i wonder why a product that does have english is sold in america.  am reall disappointed", "Title": "not good enough!", "Date": "October 8, 2013"}, {"Author": "Alain F.", "ReviewID": "R3ITQA0ENQJZLD", "Overall": "3.0", "Content": "Hi,Thanks I have received my tablet, it's ok and looks nice.I did not yet use it, I hope it will be nice for  me. But i'm wondering wether it's only for Wi-fi without sim card. If that is the case, than I will be in trouble because my wi-fi is not working.Thanks", "Title": "Feedback", "Date": "May 13, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00A8NYC62", "Features": null, "ImgURL": null, "Name": null}}