{"Reviews": [{"Author": "DVD Techie \"As you wish...\"", "ReviewID": "RREQ7CHK5K105", "Overall": "1.0", "Content": "This is not at all the tablet described. It is an A7 not A* CPU (only 1ghz NOT 1.2). It also appears to have only 2BG ram NOT 4gb and no keyborad.  I mean if this was advertised as such and $15 bucks less it may be ok, but false advertisement is 0 stars!If the seller reads these reviews, please contact me and Jim.  I spent many hours set up the tablet, so I don't really want to send it back, I just want the promised keyboard.  The specs being a little off aren't that bad since it still works for my son.  If it came with the keyboard i would have given 4 Stars.", "Title": "FRAUD! YOU DO NOT GET WHAT IS DESCRIBED", "Date": "February 7, 2013"}, {"Author": "Allen D. Warren \"ADWarren\"", "ReviewID": "RPZXATD0XZOJ6", "Overall": "1.0", "Content": "This tablet is aweful! keyboard is hard to type with and may not come with it at all! Internet is slow and bad, not very good at searching up things, or finding what you need. If you get an app it will usually not let you get on it at all, will freeze up all the time and not very good with internet related apps. Mostly consisting with twitter, instagram, facebook, groupon, or practically all of them! Freezing up is a major problem!!! Camera is not good a pictures (light and focus problems). Will loose your internet quickly and a lot. I've only had like 5 times that this tablet has actually worked. Always shutting down constantly (on its own or if you have to do it because it freezes up). If you leave it on overnight or just for a few minutes it will probably stop working, like mine did right now! By the way this is coming from a kid!!! Rating is a 0!!!", "Title": "Absolutly aweful!!!!!!!!!!!!", "Date": "May 2, 2013"}, {"Author": "Milly \"good romance\"", "ReviewID": "RDB7TP64KPP2H", "Overall": "1.0", "Content": "DO NOT BUY IT!My husband bought this for me thinking it was better than my old one; which I had for 5 years.  What a waist of money. Is very slow, it locks up for no good reason, and it turns off whenever you least expected.It looks preatty and have good picture quality, but what good is that when you can't even read a book on it!", "Title": "Not worth the money.......", "Date": "November 9, 2013"}, {"Author": "debv", "ReviewID": "R2SYTESHZ44NZH", "Overall": "1.0", "Content": "Cool reader app isn't cool at all. Downloaded a few things to read and screen goes black when I tap the application. App goes in and out at random Bought thru nomorerack who purchased an extra 30 day warrenty on  mybehalf that has not been honored.Manual is written in such small print that I literally need a magnifying glass to read it and there is no troubleshooting section. I have spent hours trying to get this tablet to do some very simple things and I'm ready to use it as a doorstop. Don't waste your money. Spend a few more dollars on a tablet and do NOT purchase thru nomorerack!!", "Title": "Not user friendly at ALL", "Date": "April 5, 2013"}, {"Author": "James Parker \"Jimmy Parker\"", "ReviewID": "R2LDAIDWY6FJ47", "Overall": "2.0", "Content": "Fast service as always when shipped by Amazon.Tablet does come with a cheap case.Not the one shown in pictures. No key board at all came with it.Battery does not hold charge long at all.", "Title": "Not as described.", "Date": "February 6, 2013"}, {"Author": "Tara", "ReviewID": "R1BQ9OYRK8TIAI", "Overall": "1.0", "Content": "I don't know what's wrong with it but it does not work right and I even tried setting it back to factory setting", "Title": "Smh it could do without", "Date": "December 30, 2013"}, {"Author": "Dan", "ReviewID": "R2T09DUQ5LW8HI", "Overall": "1.0", "Content": "This product is beyond terrible! After unlocking the lock the first time I set my combination and went to lock it. However, it would not lock. I tried to set it back to the default combination to start over, it still would not lock. Given how many people have had this same issue I would avoid this lock like the plague. Also to note, rather than wasting the time returning this I decided to see how easy it is to break and it took me under a minute.", "Title": "Terrible lock, locked out after setting combination", "Date": "November 6, 2013"}, {"Author": "martineperard", "ReviewID": "R25RNT01UPC4S6", "Overall": "1.0", "Content": "that s***t rack like omg you dont know how bad i thing is and please dont buy it i mean like nonono", "Title": "ummmmmmmmmm", "Date": "February 27, 2014"}, {"Author": "dianew1213", "ReviewID": "R2L0GT5TTZHRKR", "Overall": "1.0", "Content": "I purchased this tablet to take to the Grand Canyon.  What a waste of money.  the pictures and the video quality was terrible.  the color on the tablet of the pictures were washed out.  these were the worest picture quality that I have every taken.  Don't waste your money.  I am going to request a full refund.  This product should not be sold to the public.  Shame on this company.", "Title": "not good quality", "Date": "June 10, 2013"}, {"Author": "Kimberli Cochran", "ReviewID": "R14Z5426N8087Y", "Overall": "1.0", "Content": "I have had this tablet 4 days and I can't turn it on.  Can't open attachments from emails, not very user friendly.  My wifes samsung galaxy is so much easier to use.", "Title": "don't buy this table", "Date": "November 16, 2013"}, {"Author": "margarita m. soublette", "ReviewID": "RQYVB6TCECDYH", "Overall": "1.0", "Content": "Did not perform the way I needed it, probably would be perfect for a child, to watch movies or play games, not for me.Thank you", "Title": "Not what I thought it was", "Date": "February 21, 2014"}, {"Author": "Fayth4Life", "ReviewID": "R1A1X1303EQ4S3", "Overall": "1.0", "Content": "This tablet would have been alright if it wasn't having issues in less than one month after purchase. Granted, it was very slow from the beginning, but now it will not even stay turned on. It is apparently having some sort of internal glitch that is constantly telling it to power off. After researching, it appears this has been an issue for many. Not at all satisfied with this purchase!!", "Title": "Issues in less than one month", "Date": "January 28, 2014"}, {"Author": "Delia Aray", "ReviewID": "RXAUENUHG80DR", "Overall": "5.0", "Content": "Excellent job, very nice, very fast, i dont have problems whit the buy, in very happy, is a gread job", "Title": "good", "Date": "January 11, 2014"}, {"Author": "Anatoly blinder", "ReviewID": "R1RUPPA2T0C9Z6", "Overall": "1.0", "Content": "Just by swiping my finger across the screen I cut my fingerWhen I look at the screen my eyes bleed out", "Title": "Screen is crap", "Date": "January 10, 2014"}, {"Author": "Stephanie", "ReviewID": "R266Q7U1K368F", "Overall": "1.0", "Content": "This tablet was quite slow and got extremely hot while charging. Poor quality unfortunately because it was a Christmas gift.", "Title": "Don't waste your time", "Date": "January 4, 2014"}, {"Author": "sheila lindsey", "ReviewID": "R130DX6CHAWB19", "Overall": "5.0", "Content": "works great ! i love this it is the best thing i everbought!!go red wings they are the best team in detroit!!!", "Title": "great product", "Date": "January 2, 2014"}, {"Author": "Brian Davidson", "ReviewID": "R1STOMVA3CRDXA", "Overall": "1.0", "Content": "was not all I thought it would be,,,should have gone for one of the name brands,,,but did not have enough money", "Title": "could be better", "Date": "January 1, 2014"}, {"Author": "juthas okari", "ReviewID": "R1Z61K8SPUPJRD", "Overall": "4.0", "Content": "It is ok standard for ordinary person.works well it meets my basic needs.it is portable suit in my jacket .", "Title": "fantastic tab", "Date": "December 25, 2013"}, {"Author": "Thomas F. Mccabe \"horseshoe.mccabe\"", "ReviewID": "R38MD01BXSJFKZ", "Overall": "4.0", "Content": "Great little computer. Audio is too low ,microphone is lowsie. Headphones with mic will fix that. Fast browsing, great for facbook . I don't recomend facebook for android app. This is a good tablet for the money. A little heavier and better quality than my first tablet. Got here in three days!!", "Title": "perty nice", "Date": "June 4, 2013"}, {"Author": "anthony thornton", "ReviewID": "RGF9DLSRAVQLJ", "Overall": "5.0", "Content": "great I love it is so amazing if its all my needsI definitely suggest it to other people to buy it", "Title": "great", "Date": "December 22, 2013"}, {"Author": "Sharply7815", "ReviewID": "R2TSF9FC8U5J4A", "Overall": "1.0", "Content": "I bought this product with the intentions to just use it for reading my kindle and internet usage when carrying my laptop is a burden. This device stopped working within 2 weeks of my purchasing it. It dropped once and the thing fell apart. Put it back together and it was fine. Now the screen won't show up and I can't view anything. A horrible buy....  even for the cheap price", "Title": "Do not get it...", "Date": "May 17, 2013"}, {"Author": "Kathy Sabinske", "ReviewID": "R2Z522JC9OWKB7", "Overall": "5.0", "Content": "if your looking for a tablet this is the one to get, it will do does everything that a kindel will do", "Title": "great tablet", "Date": "April 13, 2013"}], "ProductInfo": {"Price": "$109.00", "ProductID": "B00A8D4FLE", "Features": "Android 4.0 Ice Cream Sandwich, 7 inches Display\nAll winner ARM CORTEX A8 OMAP 3 1.2 GHz\n4 GB Flash Memory, 0.5 GB RAM Memory\n1.4 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/512PJCWXHDL._SY300_.jpg", "Name": "Kocaso M752 7\" Android 4.0 All Winner A13 Cortex A8 1.2GHz 4GB 512MB Dual Camera Capacitive Multi-Touch Tablet PC (Black)"}}