{"Reviews": [{"Author": "M. Sims \"m.sims\"", "ReviewID": "R20M0CASZBILB4", "Overall": "4.0", "Content": "We purchased this tablet for our 10 year old daughter. Our other kids have rooted Nook Color tablets.  This was on sale at HHGregg for $46 right before Christmas.  We knew this was not a main e-reader in the market but thought it was worth the gamble.Like most of you we tried to get it to run in the Android market.  It needs to be rooted to do this so we purchased an sd card and I was ready to dive in to begin to root it, UNTIL I found a tip in an forum to use Amazon instead. VIOLA!! I went into my Amazon account, downloaded the Amazon App and that was it!  I was able to add a free texting program, Angry birds, and many other apps from the Amazon market for FREE.So if you HAVE to have the Android Play app, go right ahead and root your tablet, or take the much easier route and use the App market here, go into the Android store and do the same thing without the hassle.We're loving it!", "Title": "It runs Amazon.Com Android apps!", "Date": "December 29, 2012"}, {"Author": "David Fliegelman", "ReviewID": "R3MOP4XBMKT97J", "Overall": "5.0", "Content": "I have three of these I bought from hh Gregg. They work perfectly if you get the lt 7033 \"D\". Here's the diff. If you order the \"d\", it is already rooted. Just go into the settings menu, tick \"allow apps from outside sources\"  (paraphrased) say who cares to the warning (because, who cares), wander over to Amazon and download their market app, and use it to get Google Play Store. Scamouche' you're there!  The whole thing takes less than 10 minutes!  If you would like step by step instructions (?) Go to the XDA Developers website/bulletin board and search the klu lt 7033 \"d\" and the 2nd and 3rd postings on the page walk you through it.Great tab. Great value. Plus it's rooted. That means you are in command, own it, and can do what you please.  Better , faster processor than the I-pad mini. Nice build quality (much better than lt7052, for instance), great features, and being rooted you can download \"ROM manager\" and delete a lot of the crapplets you are stuck with on non-rooted tabs. This speeds it up. You can also change the launcher to a GO or ADW launcher or even change the mod to something even lower in \"overhead\" like \"cyanogenmod\", \"laytveyit\" , or \"ImUI\" for less overhead and more speed!  I am tweaking on #3 that I am bringing to my friend in the Netherlands. I have been burning all 3 in side by side as I add identical features. After running since Chanukah without powering down, no problem! :-)  ~ de Vlieg", "Title": "don't worry - help is on the way!", "Date": "February 12, 2013"}, {"Author": "Pharm Guy \"Pharm Guy\"", "ReviewID": "RVJ0HLP9O39PP", "Overall": "3.0", "Content": "I bought this tablet when it was on sale and had moderate expectations of its performance; I wanted to use it for some basic web surfing and maybe some apps. I was surprised at how well it works.  Using the amazon app store is easy, fast downloads and haven't had major trouble with the apps yet (some restarts but not a big deal to me).  I think it's worth it if you want an inexpensive tablet for minor uses (I wouldn't watch a movie on it but it's easier to read web pages vs my iPhone).", "Title": "Surprised How Well It Works", "Date": "January 2, 2013"}, {"Author": "Robert Winterode", "ReviewID": "R1HB3VT06Z72WF", "Overall": "5.0", "Content": "This is on a Curtis klu LT7035-j 4.1 jellybean tablet 4G expandable to 32G sd card . I bought this tablet from HHGreg for $69.00 plus tax . It works very good with no lag at all it has a 1.2 G processor . It is only a 4G tablet but it has way more then enough room for games and things I like . I have a sd card with 50 HD movies on it .For myself this cheap tablet is all I need . It is a very good deal for the money . Lets see how long this tablet lasts ?", "Title": "so far so good", "Date": "May 27, 2013"}, {"Author": "rammer", "ReviewID": "R38P0VYFVWL2RO", "Overall": "5.0", "Content": "I have tried newer larger tablets but not one compared to this one that EZCORP sells.  4 words...you will like it!!", "Title": "better than a new one", "Date": "September 27, 2013"}, {"Author": "Shanton", "ReviewID": "R2EQKBKQJ25WDX", "Overall": "1.0", "Content": "It could just be me but it came on and after 100 of messing with it, the tablet keeps cutting off and rebooting I had to put in a memory card in to turn it on and when I pull it out it reboot. So I wouldn't recommended it unless you want a free headphone and usb connector", "Title": "Get a better Tablet", "Date": "November 13, 2013"}, {"Author": "Alan H \"User 919\"", "ReviewID": "R35ENQTS7WLTIY", "Overall": "1.0", "Content": "Just started using this \"tablet\" today.Runs a non-Google Play marketplace with limited apps available.After searching for a work around and got Google Play downloaded, it still didn't work.Spend a few dollars more and get a real tablet, not this cheap crappy thing.Mine is going back first thing tomorrow.", "Title": "Won't run Google Play , Crappy, Going Back Tomorrow", "Date": "December 25, 2012"}, {"Author": "Austin Paul Browning", "ReviewID": "R3PXN2XJGJ5IFG", "Overall": "1.0", "Content": "It has the Android OS, but it isn't support by Android. What that means is you can't shop on the Google Play market. You have to buy your apps on a shady knock-off app market with none of the necessary or popular apps.The display is slightly stretched, so circles are slight ellipses and squares are slight rectangles. If you're looking for a cheap alternative for buying a tablet you will be sorely disappointed if you get this. Do not buy this tablet.", "Title": "Not supported by Android", "Date": "December 22, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B00AGJ2RNS", "Features": null, "ImgURL": null, "Name": null}}