{"Reviews": [{"Title": "Great product...", "Author": "Judy", "ReviewID": "R1K9E6QICBT0LB", "Overall": "4.0", "Content": "Very nice tablet...does what I want with internet and books...tapestries was a bit to understand, and battery life could be better...", "Date": "April 3, 2013"}, {"Title": "great if you get it at deep discount", "Author": "Kelvin Chung", "ReviewID": "R1EAM24ONXJNYU", "Overall": "3.0", "Content": "I recently picked this up at my local walmart for roughly $100 including taxes. I actually rooted it first thing, and put a skin over it. Once that was complete, it was as good as a regular tablet. With that being said, this is not a powerful tablet by any means, but gets the simple task done. Does lag with graphic intest games, sometimes booting does too. I liked the black alot better, some reviews were saying the white one will actually have fadded color and wash out after some time.Speakers gets pretty loud, i can feel the machine vibrate at times. The dim setting is pretty good also, unadvertendly did it once and thought it was broken because of how dark and \"unresponsive\" it was.Keep in mind, i did not purchase this tablet for reading purposes, hence I cannot comment on that end. Be sure to manually go into your amazon account to stop subscription fo you want to as unsubscribing on the email does NOT work", "Date": "April 18, 2014"}, {"Title": "works great", "Author": "jeff lowzik", "ReviewID": "R3O30A3C920GCU", "Overall": "5.0", "Content": "it works great has a nice clear screen.  google play lets you download other E reader apps. great price for a 32gb tablet", "Date": "April 18, 2014"}, {"Title": "Using it now and love it", "Author": "M. M. Amith", "ReviewID": "RQ1HEW23GILX", "Overall": "5.0", "Content": "This is the perfect tablet for me. Everything one could want and wifi only so don't have to pay for data plan.", "Date": "March 21, 2013"}, {"Title": "For my daughter", "Author": "Darrel Clifford Mays", "ReviewID": "R1GTOVG6W2C5A2", "Overall": "5.0", "Content": "This was a gift for my daughter in college that loves to read and she loves it. I have had no bad reports from her to this date.", "Date": "April 9, 2013"}, {"Title": "I love Kobo Arc", "Author": "Jen K", "ReviewID": "R1M07S8YL2TQSX", "Overall": "5.0", "Content": "Just as expected my new Kobo Arc is everything I wanted  plus all the extras. I could not be happier.", "Date": "May 3, 2014"}], "ProductInfo": {"Price": "$336.00", "Features": "Display Size\t7in (17.78 cm)\nHard Drive Capacity\t32 GB\nOperating System\tAndroid\nInternet Connectivity\tWi-Fi", "Name": "Kobo Arc 7\" 32GB Touchscreen Colour eReader with Wi-Fi - White", "ImgURL": "http://ecx.images-amazon.com/images/I/41py97%2BiV9L._SX300_.jpg", "ProductID": "B00AA7ZFZS"}}