{"Reviews": [{"Author": "Lana C", "ReviewID": "R5Z3VQ7YW4NS0", "Overall": "4.0", "Content": "Hello, I didn't buy this tablet through Amazon as it was a gift for my birthday. They come in an array of colors and mine is purple. :) After discovering that Google Play wasn't pre-installed, I came to Amazon to read the reviews in case someone had posted a tip on how to download GP to the tablet, but none of the reviews addressed that.So, I decided to share how I downloaded it. I found this video and used it. It took about 15 minutes. Make sure you choose the correct version for your OS, i.e., Android 4.0 or 4.0.4 (mine), and so on. :)[...]This tablet is great for its class. It has a slight delay of maybe ummm 2 seconds when an app is tapped. It's processor isn't super fast (a nano second), but it's just fine for me. Now that I was able to download my favorite apps, I can watch HBOGO, Showtime and videos very well. It's camera isn't the best, but other reviews on the web say that the video portion is nice. :)  It's too large for me to use as a camera anyway. I have a Samsung G3 for that. :)I hope this is helpful!", "Title": "A Nice Android Tablet!", "Date": "October 2, 2013"}, {"Author": "Bert Murphy", "ReviewID": "R199QKKSX3IHGJ", "Overall": "4.0", "Content": "Satisfied with the performance of the tablet. Bought it four 8yo son for gaming and educational apps. Getjar app had issues downloading games. Does not come with googlepay but it can be installed.", "Title": "Visual Land Connect 9\" Android 4.0 8GB Tablet", "Date": "February 3, 2013"}, {"Author": "Donna Cochran", "ReviewID": "R267MB1KN2VXMJ", "Overall": "5.0", "Content": "Works great and is everything someone could ask for in a smaller tablet! Well worth the money! I recommend that if a person is wanting an affordable tablet, get this one.", "Title": "Bought As A Gift", "Date": "May 31, 2013"}, {"Author": "J. Davis \"Ms Jo\"", "ReviewID": "R2HBEHJUFDYUZL", "Overall": "5.0", "Content": "Walmart is selling this same item for $79.00 in 5 different colors. Just thought I would let someone know. If fact no where else is it for that price with a variety of colors.", "Title": "Walmart has this item...", "Date": "September 27, 2013"}, {"Author": "Dennis A Fitzpatrick", "ReviewID": "R9OB5YIVXVLBG", "Overall": "5.0", "Content": "I ordered this item to help me with my computer and tablet. It has met all my expectations and I hope to do business with this seller again.", "Title": "Good Product", "Date": "July 13, 2013"}, {"Author": "nellie jones", "ReviewID": "R2I9H6NI5S81JX", "Overall": "1.0", "Content": "it never worked right. would not stay on wifi..sent it back to the factory and have not heard a word from them..  I called them they said they would send  me another they have not sent it yet . it has been almost 2 weeks Nellie jones", "Title": "visual land tablet", "Date": "February 3, 2014"}, {"Author": "Michael Harvest", "ReviewID": "R2SBF4AE1O6DCG", "Overall": "3.0", "Content": "I got this for my daughter for Christmas. She likes it alot, because she doesn't have to fight with her brother anymore to play on our tablets. My only complaint is that she can't watch any kind of video on it. Netflix, Youtube, or any app that plays videos.", "Title": "Descent", "Date": "January 27, 2014"}, {"Author": "Cherrie aslaug apple", "ReviewID": "R1GEGPZ50VURAO", "Overall": "4.0", "Content": "I got this as a gift for my mom it was used but sent back and put back to new I set it up for her I like it a lot its a little slow at times tho but perfect for my mother cant really beat that low price Im not rich so this was a great gift with a good price and a starter tablet for my mom we got the keyboard to so she can use it both ways .. ... I tried to get another one used for super cheap but someone got the jump on me ;)", "Title": "Good price", "Date": "January 26, 2014"}, {"Author": "Kelli", "ReviewID": "R27DLRJ4T5MO3J", "Overall": "2.0", "Content": "cant get it to connect to the internet...so not much good was a christmas present so i flunked christmas.. .bad!!!", "Title": "lmight be ok for a computer tech", "Date": "January 19, 2014"}, {"Author": "Miranda Harrah", "ReviewID": "R1ZCUMNKT8EHW1", "Overall": "1.0", "Content": "I purchased two of these as Christmas gifts.  I had high hopes they would be easy to use and be able to put a few games and simple apps on for my grandparents.  They are garbage.  I spend an absurd amount of time trying to figure out why they won't connect to the wifi and find apps that actually work.  I wish I had spent the extra money and purchased something of a better quality.  After using Nooks, iPads, and Kindle's I officially declare this item junk.", "Title": "Do Not Purchase", "Date": "January 16, 2014"}, {"Author": "Nicole G", "ReviewID": "R291TKZEDR69LO", "Overall": "2.0", "Content": "This tablet seems to be adapted for children. It is very slow !!! It takes forever to download anything... very frustrating!!! It was a gift for my husband, who is not too techie so it is not encouraging him to use it.  I would not recommend it.", "Title": "slow slow slow", "Date": "January 12, 2014"}, {"Author": "littlepiglet", "ReviewID": "R1GIND8DFFZ8LK", "Overall": "5.0", "Content": "I AM STILL GETTING USE TO MY NEW TABLET.SURPRISED BY ALL OF THE FEATURES IT HAS.LARGE SCREEN.GREAT BATTERY LIFE.EVEN A GREAT PRICE,I GOT MY MINE USED.WHAT A DEAL.", "Title": "TABLET", "Date": "January 1, 2014"}, {"Author": "Jackie Carlson", "ReviewID": "R22WDSHBWM7AMR", "Overall": "1.0", "Content": "exterior speaker does not work.  So NO sound unless you use ear buds. Very disappointing as it was a gift", "Title": "speaker does not work!", "Date": "December 29, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R27IQYBQ18KH5M", "Overall": "5.0", "Content": "This was a Great Purchase! I have a laptop that runs Windows 8. I have very many issues with this system. I wanted a backup that wasn't constantly updating & something that could still surf the web with. There have been a few glitches, but the android o.s. seems very dependable. It even has a Kindle app that I have downloaded several books too & has games like 'Angry Birds'!", "Title": "Great Purchase!", "Date": "December 28, 2013"}, {"Author": "Jonathan M Kirkham", "ReviewID": "R3SL2WMHMJY2HB", "Overall": "5.0", "Content": "This is a great tablet that works quite well. That tablet has a good battery life, and is easy to use.", "Title": "Very Good Tablet", "Date": "December 27, 2013"}, {"Author": "Charles M. Shieff", "ReviewID": "R1TY1QANDAFN0G", "Overall": "2.0", "Content": "I found this tablet at a major wholesale club for about 1/2 price, and thought it was a great deal. Well, at first it seemed that way, but when I gave it to my 7-year-old daughter for Christmas (after setting up parental controls, and browser), all was well until she opened Netflix (which I neglected to do), and when I logged into my account, I found that there was no video; just audio and subtitles! I spent hours trying uninstalling, re-installing, and downgrading both Flash Player 11 and Netflix! UGH!! If it has Netflix pre-installed, it should just WORK!!! Also, I can't get YouTube videos to play very well, if at all! I don't care about that, since I have parental control app and browser installed.If you don't care about streaming video, this will do OK. Not the greatest, but for for a youngster, just fine.As for the lack of Google Play, since my daughter is only 7, she doesn't (and won't for a long time) have a Google account, so I'm OK without Google Play. The Amazon app store has a wide variety of free apps, and they give out 1 paid app for free daily, from the front page of the Amazon app store.Honestly, I would've rated 4 stars if Netflix and YouTube worked!", "Title": "Too bad Netflix will NOT work!", "Date": "December 26, 2013"}, {"Author": "fatguy1nalittlec0at", "ReviewID": "RX0018GFZ1DLN", "Overall": "2.0", "Content": "I received this tablet as a gift. Although this may be alright for some people as a tablet, I have found it does very little. The netflix app which comes pre-installed does not actually run the netflix software efficiently and as a result you can enjoy about 15 seconds of streaming video before it closes but please bare in mind that you have to wait approximately 3-6 mintues before that video plays.The wireless receiver is not very strong as it registers 1-2 bars when my laptop in the same location has full bars.The internet browser is slow and cumbersome. It takes a long time to appear to load a page, then once it does load if you try to click on a link you will quickly realize it did not finish loading, it just stopped loading the page.the games that came on the tablet run fine, however some that require tilting do not play very well as the motion sensor in the tablet is not very sensitive.All and all if you are thinking of getting a tablet, save your money and buy a different one. This may have a better price than other tablets, however it is poorly made, poorly programmed and is just plain cheap as you quickly find out after turning it on.", "Title": "not a quality tablet as you might expect from a company you have never heard of", "Date": "December 26, 2013"}, {"Author": "Barry", "ReviewID": "R3TNI2CUNKZ4ZR", "Overall": "3.0", "Content": "I have no experience with tablets and do not have a cellphone that goes on the internet. So I had nothing to compare this product to except my experience with computers. But I do know they are separate animals.  Pretty good for the price I would say. Only drawback is that when you first start it up, it takes forever for your email to load up, so for like 10 minutes it is useless until it goes thru all of that. Otherwise I am happy.", "Title": "Decent product.", "Date": "January 13, 2014"}, {"Author": "Teresa Luna \"luna11972\"", "ReviewID": "R1D583NA8JS9LU", "Overall": "4.0", "Content": "This is a great little tablet, I have 2 of these and love them. I was able to load Google Play (with some easy hacking). The only reason I gave it 4 stars is because the screen has serious glare but I am sure with an anti glare screen it would be better. And it is not as fast as my 1gb tablet. Its not slow it just takes apps about 20 seconds to load. Mainly I wish it had google app store on it. Other then that it is a fantastic little tablet. Works great, loads all webpages, watch movies, play games, read books ect. Really worth the money. I dont know why you would pay more for higher end tablets. This this is great. However finding an after market case is providing difficult. I cant find a 9 inch case. Only 7-8 and 10. but i woulnd trade it for anything. I love it!", "Title": "Great Tablet for the price, even against name brand.", "Date": "December 10, 2013"}, {"Author": "deb", "ReviewID": "R25HUCVS9N3A94", "Overall": "2.0", "Content": "was for older parents and tablet kept turning off on own. Downloaded a book to it and took a lot of monkying around to get it to work. It would have been to confusing for parents.", "Title": "Tablet", "Date": "December 2, 2013"}, {"Author": "Chumly", "ReviewID": "R2E5R24VDXIPYR", "Overall": "4.0", "Content": "Mom is going to love this Droid system. Unpacked it and powered it up to connect Wi-Fi and had NO PROBLEMS. Charged the battery for twelve hours and put it back in the box. From what I could tell it is easy to connect and surf and was packed well and shipped fast. Thanks. I have not used it much so a 4 star was for an incomplete evaluation.", "Title": "Mom is going to love this", "Date": "November 23, 2013"}, {"Author": "Frank \"tjcrabtree82\"", "ReviewID": "R22R7N7242OPR4", "Overall": "3.0", "Content": "First of all, to set the record straight, you CANNOT get Google Play on this tablet!!!!! Google Play is not supported on this device and the Google Play website can verify that. This tablet is NOT listed on their site!!!!!!I got this tablet for work so I could update my spreadsheets while out in the field. It could get damaged or stolen, so I wanted a cheap one. This fits the bill, but the other reviews are right, this tablet is slow!!! Its like having and old 90's PC with dial-up all over again. HOWEVER, it does have its uses. It has no problem with my spreadsheets or connecting to my home network to view shared files. It will also run a youtube vid with no problem - once connected to a wireless signal. I can recommend this for someone looking for no frills. But I cannot recommend it for someone who likes fast devices. This is my first tablet and its ok for a starter. I will get a different one for travel/personal use.", "Title": "Its ok for a starter", "Date": "October 15, 2013"}, {"Author": "laflood1121", "ReviewID": "R3SW7BLJ2JFEUR", "Overall": "1.0", "Content": "THIS TABLET WAS A PIECE JUNK. IF YOU PUT IT DOWN FOR 2 SEC IT CUT OFF. ALSO IT DID WORK WITHOUT POWER CORD. ALSO THE NETFLIX SHOULD 0 PICTURE BUT YOU CAN HEAR IT. LIKE I SAID JUNK.", "Title": "JUNK TABLET", "Date": "March 11, 2014"}, {"Author": "Robert Ratliff", "ReviewID": "R2XB43XW9K5PGV", "Overall": "1.0", "Content": "I bought 3 of these for Christmas last year.  Before we had them for a month all 3 of them were dead.  1 wouldn't charge, 1 wouldn't turn on and the 3rd's screen was all messed up.  I contacted the company well within the return time and was told I could send them in to be fixed for $50 plus shipping.  That's what I paid for them in the first place!  I told them that was unacceptable and after getting the run around for a few weeks they ended up coming back to me saying that it was now outside the return period and they would do nothing about it.  I had to file a dispute with my credit card because they refused to stand behind their product.", "Title": "Bought 3, All Were Junk", "Date": "November 29, 2013"}, {"Author": "Jordyn's  mom", "ReviewID": "RE2WB3P19RGBI", "Overall": "1.0", "Content": "I bought this for my daughter's 6th birthday.  Just trying to set it up before i gave it to her was the worst experience.  If it is hard for me to navigate, she would definitely have trouble.  The app store wouldn't download 95% of the apps that I tried to download, kept popping up a retry message.  Also, it was sooooooooooo sssllllllllloooooooowwwwwww!! My daughter would have never used it out of pure frustration.  So, I ended up having to make a late night run to walmart and purchase an entirely different tablet.  The one that I picked was $50 more but so much faster and smoother and she absolutely LOVES her samsung tab 2 7.0.  I would not recommend to anyone unless you are purposely trying to piss them off LOL.", "Title": "The WORST...", "Date": "June 24, 2013"}, {"Author": "Louis J.  Nelson", "ReviewID": "RBEQE4S6NHPXM", "Overall": "1.0", "Content": "Terrible tablet ... Just took a chance with this one. Was I ever disappointed. Purchased for granddaughter's birthday present. Problem is the screen goes blank every 5 to 10 minutes and it takes far more than 2 or 3 seconds holding the start button to get tablet going again. Once restarted 5 to 10 mins. later screen goes blank once again. Have only had tablet 3 days and intend to return it at first light.", "Title": "Looks good, but ....", "Date": "October 20, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00AFYH0GI", "Features": null, "ImgURL": null, "Name": null}}