{"Reviews": [{"Author": "GBack", "ReviewID": "R1VKRVNJRETNNN", "Overall": "4.0", "Content": "So I purchased this item for $60 plus shipping, came out to around $70 bucks.  What did I have to lose?  Open up box, fired it up and picture wasn't bad.  Maybe I scored on a cheap tablet here.  Now I have a Ipad 2, Kindle Fire and a Color Nook and all are receptive to the finger tip.  Not ematic!  After cussing out the screen thinking I got what I paid for, I realized that if I just used a stylist or a finger nail rather than my finger tip it worked just fine.  Time to get to the good bits of this Ice Cream sandwich of an OS.  Straight to the App Shop!  What?!? No Google Play?  Just this crappy Ematic App Shop that offers no good apps that I would be impressed to use.  But before I thought, get what you paid for yet again.  I remember rooting my Color Nook over a year ago and felt I could do the same with this $60 device.  15 minutes later, unicorns and rainbows started to appear.  Google Play in full effect.  Netflix, Pandora, Dropbox were all installed with ease.  My little son now has a tablet to use for himself and if the worse happens....I am only out a small amount compared to other tablets that do the same for twice the price.  I just have to allow myself to give it up now.The only negative I have for this tablet...no bluetooth.So if your looking for a device that does everything a tablet should do but with a low price tag and your not afraid to do a bit of rooting to get you Google Play.  I say do it.", "Title": "For the price...not bad if you know what your doing", "Date": "February 22, 2013"}, {"Author": "Phillip R. Heberer", "ReviewID": "R14RKVH7RH05YF", "Overall": "3.0", "Content": "While  low end on Android specs for hardware, this can  be  adequate for occasional  use, especially when paired with a stylus and USB keyboard like the MK200 or similar case sold elsewhere on Amazon. Regular touch with a finger is frustrating and rarely works.This does NOT use the Google Playstore, and the original App store shipped with it is broken, requiring you  to download an alternative from the support website. Available apps are limited and many popular Android apps are unavailable on the limited app store. Customer Service seems to be dismal if non-existant from all the complaints on the web forums. Better tablets are available for not much more money.", "Title": "Don't expect iPad performance on low end product. This product is okay for entry level.", "Date": "January 8, 2013"}, {"Author": "brandi", "ReviewID": "RQNZURPAJ1CKW", "Overall": "5.0", "Content": "Great product for the price. Arrived  as expected. Android apps can be dowloaded from 1mobile.com. simple and easy to use", "Title": "great product", "Date": "March 17, 2013"}, {"Author": "Latoya Martin", "ReviewID": "R1GBSETLV81RBR", "Overall": "2.0", "Content": "I bought this tablet for my 13-year-old son in December 2012 and loved using it as much as he did. It had good features for the price paid. However, after having the tablet for only 3 months it stopped working and would not boot up even though it's getting power. The screen just stays blank. This was a waste of money and the user guide needs to be more detailed/explanatory so that the device is more user friendly and you don't have to figure out some things on your own.", "Title": "What's Wrong With This Tablet?", "Date": "April 18, 2013"}, {"Author": "raydean12", "ReviewID": "RWTCYJ8YI3XQE", "Overall": "1.0", "Content": "Wish I had of read reviews before buying. Screen doesnt work. I tap it,double tap on it, hold it and it still only works half the time. Most of the time I cant even unlock it since it doesnt recognize my touch. Of course since the touchscreen doesnt work...it is useless...DO NOT BUY THIS TABLET.I bought the Funtab, also made by Ematic..it works better but sometimes the touchscreen doesnt work well either.", "Title": "touch screen issues", "Date": "January 22, 2013"}, {"Author": "C.Martinez19", "ReviewID": "R3FL1MWPH583FZ", "Overall": "1.0", "Content": "Tablet is decent and could be a good tablet but touchscreen is resistive not capacitive so you have to press on them. Ok well if you plan on getting this tablet make sure you buy some sort of extended warranty like from walmart if bought there or other possible because Ematic support is one of the worst. I sent an email and didn't get a respond till like a week later. If you go to BBB better business bureau or some other reviews you'll see that there is a problem with their support. I finally had gotten a call today but they insisted on me sending the tablet to them so they can fix it but they would charge for it. I did not want that as touchscreen wasn't very responsive and I tried getting them to give me a link to the firmware but they said its not possible. I asked to talk to someone else and they said I couldn't and they can't provide the firmware. If you look closely they are probably a Chinese company here or a Chinese product importer that puts their name of Ematic in the products especially after it resembles the appearance of several Chinese tablets. Tablet could be better but many are defective or get damaged easily and with their terrible support I give them 1 star.", "Title": "Ematic Support sucks", "Date": "January 9, 2013"}, {"Author": "A. Ramsey \"A. Wayne Ramsey\"", "ReviewID": "R33O8450U0EJ1D", "Overall": "3.0", "Content": "The Ematic Genesis tablet computer might be just the tool for those who like games, movies and music.  However, if one prefers a tool for productivity, purchase a laptop computer.  This little 7\" Android does what I need most.  It allows me to read pdf books when I cannot acquire hardcopy and casual Internet surfing and retrieving mail.  I give it 3-out-of-5-stars.", "Title": "Minimalist Utility", "Date": "June 23, 2013"}, {"Author": "Victoria", "ReviewID": "R2A66PWJ9HNDF", "Overall": "1.0", "Content": "I bought this tablet without doing my homework on it because it was such a good price. I bought it for my mother and she played around with it and gave it back to me complaining that it was annoying to use. So i put it aside and forgot about it for a few months and when school was about to start i took it out thinking i could use it for school and omg does this tablet suck. The touch screen does not work. I had to press super hard and press on it about 10 times to get it to open anything. After 5 minutes i was ready to throw it across the room. So i put it back in the box and took it to walmart where i bought it and walmart wouldnt do anything since i had it past 90 days. So now i called ematic and they said they will not issue a refund and i had to email them a copy of my receipt and they will decide if they are going to charge me for another tablet or replace it for free...i am so close to listing it on ebay and try to get some of my money back on it....just awful", "Title": "Just Awful", "Date": "July 19, 2013"}, {"Author": "punkcasher", "ReviewID": "R7S7VY6L9W7C8", "Overall": "1.0", "Content": "The E-matics Genesis tablet is horrible. It overheats, and it is guaranteed to brick. Spend your money on a better brand.", "Title": "Craptablet", "Date": "August 3, 2013"}, {"Author": "spencerbetty", "ReviewID": "R2ULNOKVJ5HU8D", "Overall": "4.0", "Content": "I just got this tablet, and at a really good price, for something for my daughter to use instead of my laptop. She's 8 and absolutely loves it. I like that it's small and keeps a great charge. She watches videos and plays and assortment of games on it and its great for keeping her occupied in the vehicle while traveling.", "Title": "Nifty little tablet", "Date": "August 3, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00AL3HZIQ", "Features": null, "ImgURL": null, "Name": null}}