{"Reviews": [{"Title": "great tablet", "Author": "Kevin 101", "ReviewID": "R1DCAV813JK8NB", "Overall": "4.0", "Content": "This tablet is not the nexus or kindle ,but only difference is the the name brands have Bluetooth and or more memory. The cheaper tablets can be just as powerful and entertaining as the more expensive ones. Just sometimes lower resolution and without 4g or Bluetooth and if they have these the tablet is old and not up to date but this is perfect for the price.", "Date": "February 28, 2013"}, {"Title": "Excellent tablet", "Author": "Shlly", "ReviewID": "R29MGWZG9CAGT8", "Overall": "5.0", "Content": "I can say nothing bad about this tablet.  Fantastic for traveling.  I use it with a leather keyboard case and adaptor.", "Date": "July 31, 2013"}, {"Title": "Save for something else", "Author": "SolarSteel", "ReviewID": "R18HJGN9QCM5LA", "Overall": "2.0", "Content": "This thing sucks horribly, its very slow for 1 GB of ram and freezes almost every 10 mins. Browsing the internet is slow, the games run sorta well but i wouldve saved up more for a kindle fire.", "Date": "April 2, 2014"}, {"Title": "Not A good buy!", "Author": "chris king", "ReviewID": "R28HOAXEK064HV", "Overall": "1.0", "Content": "This turcom is so slow I used it for 2hrs and I am done with it. I paid $110 I know you get what you pay for but wow never again. I will crush this one with my truck and get A ipad.", "Date": "March 31, 2014"}, {"Title": "This Tablet is scrap", "Author": "Marlyn", "ReviewID": "R64VDFN0BJAD0", "Overall": "1.0", "Content": "I purchased this tablet in October and it worked ok until today Jan 2nd there is a pop up screen that came on that said \" unfortunately, com.android server has stopped. I am not able to get to any of the applications, I reset the tablet on several occasion and nothing has changed. I spoke with Amazon and they are not able to help as they claim the product is over 30 days old. This company is not local so I guess I am stuck with this product that cost almost $100. I would not recommend this product to anyone its garbage.Very dissatified.", "Date": "January 2, 2014"}, {"Title": "My tablet worked when I got it", "Author": "Evangeline Miller", "ReviewID": "R2S4A9TWSKPLD2", "Overall": "1.0", "Content": "But when my time was up for return my screen on the tablet started to mess up and could not see screen in upper left corn it was not dropped or damage in anyawy", "Date": "September 21, 2013"}, {"Title": "not what i was looking for", "Author": "Pamela M. Springer", "ReviewID": "R31LU83VZHM43S", "Overall": "3.0", "Content": "The charger is no good have to buy a new out and the tablet is not charging with the usb cable as it said it would and you have to charge to often", "Date": "March 30, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AMQJV5W"}}