{"Reviews": [{"Author": "pressm4n", "ReviewID": "RPX2NJJ6HKNIH", "Overall": "2.0", "Content": "My son (8) got the white version of this tablet for Christmas from his grand parents. It seemed pretty cool at first until we downloaded some common apps. After downloading Angry Birds Starwars (purchased version), Minecraft (purchased version), and Stupid Zombies (free), it started to crash constantly. We were never able to get Stupid Zombies to run at all it just drops back to the main screen every time, I read on a forum this is a common issue. Minecraft in survival mode, the game crashes and never saves. We may as well have just used the free version that you cannot save anyway. Angry Birds Starwars also crashes constantly. I am very disappointed with this tablet. It is literally a paperweight right now because my son is so frustrated he doesn't even play it anymore. This product really doesn't have any redeeming qualities to be honest.", "Title": "constantly crashing", "Date": "February 20, 2013"}, {"Author": "Tomkat67", "ReviewID": "RXT6AVQYVWX49", "Overall": "1.0", "Content": "Since my son was getting a laptop for Christmas, I got one of these as a gift for myself. I put in a 8 gig mini card and mostly used it for youtube and netflix videos and email. It worked great except for crashing now and then and requiring a reboot. Here it is just 3 months later and the screen has inexplicably gone a bright white. I have rebooted and reset and nothing I try works. I have taken it to two computer service men and they both said it was a lost cause. Polaroid customer service isn't talking to me. You can do better for your hundred bucks than this cheap piece of plastic. Don't buy this one!", "Title": "LASTED 3 MONTHS.", "Date": "March 27, 2013"}, {"Author": "Jessica", "ReviewID": "R3IZTEK4SIKPN3", "Overall": "4.0", "Content": "My husband purchased this for me for Christmas.  I read most of the reviews and decided for my money this would be the best.  I was a bit disappointed in the Amazon Store.  Not as many apps as Itunes has, but it is sufficient.  It runs smooth, camera takes excellent pictures, video is decent.  We have netflix and all sorts of games and extended the memory to 8gb for now.  We will probably grab a 32gb and put in it eventually.  I love adobe and reading my books on it.  Very responsive to the touch.  Great battery life.  I am completely satisfied with it.", "Title": "Happy as can be", "Date": "March 6, 2013"}, {"Author": "Don't bother me with your complaints", "ReviewID": "R28Z9D56Y74DMO", "Overall": "5.0", "Content": "This tablet does just what it says.  While it is not as sensitive as the $600 tablets, it's perfect for a teenager.  The price is perfect, too!  My teenager loves it.  She's able to access the app store and use it for school work.  I don't recommend this for an adult that wants a sophiscated, powerhouse machine.", "Title": "Wonderful tablet for teen", "Date": "March 9, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00AXMZIMU", "Features": null, "ImgURL": null, "Name": null}}