{"Reviews": [{"Author": "NLee the Engineer", "ReviewID": "R2GFNUT0GWK2QP", "Overall": "4.0", "Content": "I purchased this product (\"Polaroid 4.3-inch Android 4.0 4GB Internet Tablet\") more than one year ago, to be used as a portable media player for music and videos. There are several reasons I prefer to use this general-purpose Android tablet instead of a dedicated media player, such as my Philips SA4ARA16KF/37 GoGEAR Ariaz MP3 Players:- The built-in media player app of this Polaroid tablet can handle all types of audio and video files, including MP3, MP4, M4A, AVI, MKV, OGM, etc. It can even support dual audio and subtitles - great for watching Anime. Dedicated media players are very inflexible in this aspect.- Although the overall size of this 4.3\" tablet is much bigger than a typical MP3 player, it can still fit comfortably in any shirt or pants pocket. Larger screen makes it much easier for me to navigate and access the control menu- This tablet accepts external microSDHC card for up to 32GB of media storage. This also allows me to swap media collections quickly. Any inexpensive card (such as the SanDisk 32GB Class 4 MicroSDHC) works just fine.- I can use the tablet's File Manager app to navigate through my media collection, and rename or delete files easily.The battery life of this tablet is acceptable as a media player. When playing movies (with WiFi off and LCD panel at 50% brightness) I can expect around 5 hours of runtime, which is sufficient for one domestic plane trip. For playing music (with the screen turned off) I estimate its runtime to be 15-16 hours.On the other hand, if you intend to use this product as an Internet tablet or as an eBook reader, you'll likely to be disappointed. Like most inexpensive tablet, it suffers from several limitations:- Its overall response is sluggish, due to its low-end CPU (1GHz single core) and limited memory (512MB DDR)- The screen resolution is too low at 480x272. As a result, you need to constantly zoom in and zoom out of a page to read it.- Although most Android games are compatible with this tablet, the low-res screen makes it difficult to actually play them. For example, I can play Angry Birds, but often can't tell which bird I'm shooting.- The WiFi receiver has very poor sensitivity.Summary:As a portable media player, this Polaroid 4.3\" tablet does a great job for me. It is a good value considering it costs less than a dedicated media player. Just don't expect it to work as well as a full-pledge internet tablet.", "Title": "Great as a portable media player / Barely useable as an 'Internet Tablet'", "Date": "December 9, 2013"}, {"Author": "G. Morrison \"Media Slave\"", "ReviewID": "R17OS9X1QKAGY3", "Overall": "4.0", "Content": "It seems that two versions of this are retailing now--one with Android 2.x and the other with Android 4.0 (Icecream). Currently, it's better to own an Android tablet featuring Android 4.x, instead of 2.x. As for the tablets with Android 2.X, it may be possible to \"root\" such a tablet, thus upgrading the Android OS--I never have tried it, though. I obtained the Icecream Android 4.0 version. Southern Telecom is behind these--a virtually identical sister product from the company uses the \"Emerson\" brand name.One correction to the description: This uses micro-USB, not mini-USB.This is a replacement for a Palm Pilot: Many people now need useful tablets to replace those. In it's day, Palm had it's Garnet OS and 3rd party apps, etc.: Nowadays, Apple and Google (Android) have taken on that retail model. Unfortunately, Google Play isn't available directly for Polaroids--a couple of other stores, natively installed, have some good apps. I found that I needed Google Play to get the app associated with my bank. Only later, after I had moved, did I get Google Play to work for this. Southern Telecom indicates that Google Play offers apps basically intended solely for mobile phones and carriers: Naturally, I found this argument quite disingenuous.To get Google Play to work with this--along with many other generic-name tablets, rooting is required. Instructions for rooting this may be found by searching online--it's not that difficult, yet neither is it \"intuitive\"--certain steps must be followed with a computer or laptop--as well as with the tablet. Rooting rids the tablet of Southern Telecom's restrictions. (Perhaps, the restrictions were put into place to keep people from harming their tablets--and, thus making more service inquiries and RMAs to customer service.)In a sense, rooting is akin to upgrading the BIOS on a PC or laptop--given either rooting or BIOS upgrading,  incorrectly performing or unnaturally \"stopping\" either may \"brick\" such devices and tablets--making them unusable. (Certainly, a power failure might thus prove likewise fatal. \"It's not my fault!--Yes, it is!\") Rooting is a firmware upgrade or replacement. With a tablet, though, the firmware is the OS--thus, it's relatively more extensive and \"intimate.\" On a PC/laptop, the OS is software, which may be reinstalled. Rooting gets one to the system level--the user may work on that level from then on--from then on, it's inherently more hazardous to the tablet, though.I'm adding a star to this item's review, given that it may be put into a pants/shirt pocket or relatively easily into a purse or pack.1. Surfing/Proc power: I find mine surfs pretty well--way better than Palm: These days, though, processor power is going quickly to multi-core on tablets. You may do better--though maybe not for the size, price, and given it's a wifi tablet--not a smartphone. Perhaps currently, it's the most powerful, yet still pocketable, consumer processor device for $60+. Naturally, given proc/tech improvements and further fabrication ramp-up, that will change.2. Keyboard use: Palm offered their own keyboards, and 3rd parties offered bluetooth keyboards for Palm. Bluetooth is not included on most generic brand Android tablets. I did get a USB keyboard to work with this--just now, keyboards with micro-USB connectors now being offered may be the best bet. I needed an adapter from USB to micro-USB. As for Bluetooth, USB Bluetooth stubs likely require adapters to fit the micro-USB port on this device. (Amazon is a great place for obtaining such adapters.) I haven't tried Bluetooth, yet I've seen it enabled on Youtube videos demonstrating people rooting and then getting tablets then to work with--thus connecting well to Bluetooth keyboards. As for USB keyboards, I've noted anecdotes of people using adapters with PC keyboards--it may prove useful to use one of yours to check connectivity--before purchasing a portable keyboard.3. Durability: That's a shame for many, if not most, mobile devices, isn't it?! I've noted a few \"clamshell\" case solutions for this online--I desire a reasonable, pocketable solution, of course. I haven't noted any \"bumpers\" for this, yet. I'd say this device, as is, seems to prove \"par for the course\" concerning durability. Put a sheet-plastic screen protector on.4. Battery Life: It seems that battery life, especially given this is idle, is pretty good. Turn wifi off unless absolutely necessary: It seems that wifi remains on--even given that the device is off/idle. Wifi certainly does affect battery life quite negatively.5. Storage: Yes, it does take micro-SD/SDHC storage. 4GB is included internally--some of that is used up, though.6. Camera: Yeah, it's on the front--screen side. Resolution is relatively small. It's somewhat of an \"afterthought\"--available, given it's needed.7. Apps: A key app works with MS Office--it may read and write MS Excel and Word documents. 1Mobile Market also is notable as an app store. A crude music player for MP3. Pretty much as is expected.8. Rooting beyond Icecream to Jellybean, and beyond: It may prove possible.", "Title": "Icecream, Android 4.0 version", "Date": "September 14, 2013"}, {"Author": "theo tucker", "ReviewID": "R227C7SAKX5Z2T", "Overall": "5.0", "Content": "Okay big lots has these also and cheaper. I bought 6 for Christmas for my kids. My oldest son set them all up. These things work great. It doesn't have the best cammer but everything else it just perfect. It has a great feel on your hands and come in other cute colors like blue, pink, and green. Down load 1 mobile market on this when you buy it so you can download apps onto it. Connect it to your wifi and got to Google and type 1 mobile market and download from one of the links and it will down load the App Store.", "Title": "Fantastic!!!!$", "Date": "December 11, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RAQI350FUM3D5", "Overall": "4.0", "Content": "i bought this at big lots when it was on sale for $35 on black Friday. So price was good. The thing is pretty fast, minus some appstore issues. And does all you want it to do. Its a little outdated now but it works for younger kids as its incredibly hard to break. I dropped it off my roof onto concrete and it worked fine without screen damage at all!", "Title": "Good tablet. Hard to break.", "Date": "May 18, 2014"}, {"Author": "Vince Plano", "ReviewID": "R1OCJXLNR54PHI", "Overall": "1.0", "Content": "This is a piece of junk. Extremely slow, poor WiFi connection. Terrible touch screen response. I'm ready to throw it against the wall and put it out of it's misery.", "Title": "Save your money", "Date": "February 23, 2014"}, {"Author": "Victor Martinez", "ReviewID": "R1D41LZX95KZEN", "Overall": "3.0", "Content": "It keeps freezing up on me and the connections to charge device don't always work. I'm charging this device all day to be able to use this for  1 1/2 hours. not good.", "Title": "It keeps freezing up", "Date": "February 19, 2014"}, {"Author": "Greenwick", "ReviewID": "R1ZVH6CHSU1LD7", "Overall": "1.0", "Content": "I wanted a small take anywhere, cheap tablet. This seemed like a good fit. Unfortunately, it doesn't seem to do anything very well, and I couldn't see myself being happy with it.Cons:- Every program was slow, especially things using the internet- Typing was very difficult, even with a stylus- It took a long time to turn on, to the point I had to wonder if it had broken- Discharging was fine till the last 15% or so, then it quickly ran out of juice and shut off.Pros :- The video is actually pretty decent quality- New programs downloaded quicklyThere were other problems, which I'll detail later once I am more awake.", "Title": "I tried to like it", "Date": "February 15, 2014"}, {"Author": "FL in the burgh", "ReviewID": "R2VPVUPHJG3JWI", "Overall": "1.0", "Content": "Day 1 - 5 stars and dropped one per day.  After two weeks the screen went berserk.  Cost to return to Polaroid wasn't worth it and the warranted replacement that I purchased through Amazon apparently didn't apply.  Tossed into the garbage can.  This thing was incredibly slow and the touch screen wasn't in the ballpark.  Polaroid should stick to cameras.  If you want this for anything other than checking emails, don't waste your money.", "Title": "Would have liked to give it a 0, but I couldn't", "Date": "February 1, 2014"}, {"Author": "Antone Dillard", "ReviewID": "R11NR7UDUP9UY3", "Overall": "2.0", "Content": "It take to long to charge device and many more problem with it. The sceen is too small I thought it was bigger.", "Title": "waist of money", "Date": "January 21, 2014"}, {"Author": "Master Chief", "ReviewID": "R1Z1RPCD4TNZ4T", "Overall": "1.0", "Content": "This product is a total waste of money, poor battery life , poorly made in china junk!, WiFi not compatible with WPA2forget about buying this piece of trash!!!", "Title": "Polaroid 4.3\" Internet Tablet junk", "Date": "July 6, 2013"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B00AR4HJBM", "Features": "SKU: Polaroid-PMID4311BK", "ImgURL": "http://ecx.images-amazon.com/images/I/41KfzZCMWSL._SX300_.jpg", "Name": "Polaroid 4.3-inch Android 4.0 4gb Internet Tablet with Camera"}}