{"Reviews": [{"Author": "Linda A Bosse", "ReviewID": "R1IQHHIQF59FJP", "Overall": "1.0", "Content": "I purchased this tablet about a year ago and it has done nothing but go down hill. it worked wonderful in the beginning but about 3 months after using it, it started acting up. It would freeze and restart. sometimes it wouldn't even turn on! I have had to factory reset it and everything was gone. about 2 months after the factory reset, it went through this whole cycle again! today I decided to write this review saying that you shouldn't even waste your time on this! my piece of crap tablet right now is currently not booting at all! ive reset it and ive even called many android places and they all said to call the company that built this tablet. the company has no phone number anywhere so im screwed. if I could go back in time, I would have NEVER bought this tablet. save your time and money. I would much rather recommend a Samsung tablet or a iPad. if you cant afford an iPad, I would recommend the 2nd generation iPad. once again, please don't buy this tablet!", "Title": "Do NOT buy this!", "Date": "April 18, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R264YRND9J6XSQ", "Overall": "1.0", "Content": "My dad was given a $400 \"voucher\" for this supposedly $500 tablet. All he had to pay was the $100 difference. Too bad that was a big swindle. After ponying up the $100, and getting this tablet in the mail it quickly bricked in the first couple uses. It will boot up, but go to a black screen. My computer can not detect the USB when connected. There is no way for me to look into corrupted files, or factory reset it.Also, this device does not charge using the mini USB. It is a separate DC charger with a strage pin diameter. There is very limited user manuals, and i can't seem to find a contact number. I will urge my dad to return this for a refund, but I suspect there is no return policy given the nature of the voucher that was used to purchase it.", "Title": "Brick", "Date": "May 31, 2014"}], "ProductInfo": {"Price": "$299.00", "ProductID": "B00ANHHYC2", "Features": "Android 4.0 Ice Cream Sandwich, 9.7 inches Display\nAMD A4 1.2 GHz\n8 GB Flash Memory, 1 GB RAM Memory\n2 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41gbZGG2qcL._SX300_.jpg", "Name": "Supersonic SC97JB 9.7-Inch 8 GB Tablet"}}