{"Reviews": [{"Title": "Waste of money", "Author": "Judy", "ReviewID": "R25ZXMA0EQCFD7", "Overall": "1.0", "Content": "I don't typically review items but this thing is junk. My daughter wanted a small tablet, so she saved up her own mone to purchase this. It never worked right from day one. The charger doesn't fit right, keeps falling out, and so the unit is difficult to charge. It also periodically, tries to restart/reboot but then gets stuck in a never ending loop...it says its restarting but gets stuck. The whole unit gets locked up and she can't do anything with it. She would get frustrated with it, let it sit, and then the next day it work would fine. This is not a reliable unit, I would not recommend it. Now its past time for us to return so her hard earned $70 was a complete waste.", "Date": "April 8, 2013"}, {"Title": "Save your money", "Author": "Paul Schue", "ReviewID": "R2NICCJ82WAB9T", "Overall": "1.0", "Content": "Purchased two of these. The screen sensitivity is such that no matter how little pressure you apply, the scrolling and select aspect simply is incredibly poor! It selects randomly as you scroll through any program. After several hours of trying to use finger or a stylus, I finally gave up trying to use the scroll and select function. One of the two units would not even shut off. The battery life seems to be about an hour between recharges. I spent my time simply trying to scroll and select using this thing. Save yourself a LOT of agony and do not purchase this item. I read the reviews and figured maybe some folks might have been a bit hard on this item, but the truth is, it is something you should run from as fast as you can. In my opinion, it is the pits. Now, I will see how well Amazon's return policy works....sighs. Wish I would have not bought these tablets.", "Date": "November 4, 2013"}, {"Title": "Christmas present that didn't last a week..", "Author": "Elizabeth Brinkley \"EBrinkley\"", "ReviewID": "R2PXUSIARB7ZUI", "Overall": "1.0", "Content": "Bought this because of the price- You get what you pay for because it was CRAP!  The first time my niece tried to charge it the hole where you charge it fell into the tablet..  As soon as the charge was gone, the tablet was no more..", "Date": "March 29, 2014"}, {"Title": "two thumbs down", "Author": "Amazon Customer", "ReviewID": "RLDGBL9KB2D66", "Overall": "1.0", "Content": "It wont charge unless the cord is wrapped around the tablet three times to keep the cord where it needs to be. It only connects to the internet when it wants to but that isn't very often and I have a wireless network so I know it has a good connection.", "Date": "January 13, 2014"}, {"Title": "Worst tablet ever", "Author": "Stephenie LaBouef", "ReviewID": "R1VXXV9EGTX3WP", "Overall": "1.0", "Content": "This tablet is horrible I had it 32 hours before it broke and I had to return it.  I would never purchase this tablet even if it was the last in existance.  Save your time and money and look for another tablet.", "Date": "June 26, 2013"}, {"Title": "Nice design", "Author": "sdagsdf", "ReviewID": "R2NC6569ZAVJSP", "Overall": "5.0", "Content": "Best tablet ever purcased but the touch isnt so good but i still like it realy good. Great quality and nice speed.", "Date": "May 3, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00A57DJS8"}}