{"Reviews": [{"Title": "Best Tablet Available", "Author": "Jarod", "ReviewID": "R2F7DDRD089MNS", "Overall": "5.0", "Content": "I bought my Nexus 10 after my mother stole my Nexus 7 from me and I'm sure glad she did. My girlfriend had just gotten an iPad 4 for Nursing School so I had something to compare it with.Let me say the screen is the pinnacle for tablets by far, just watch the planet earth HD episode that comes with. The pixel density is much better than the iPad but not as saturated, which is fine with me because it looks fake. The speakers set it apart from any tablet in terms of loudness and the fact they are front facing so you don't have to look like an idiot cupping the back of your tablet for people to hear. The camera is surprisingly good; auto focuses and takes photos very fast. Skype looks better on here than my laptop, not to mention its nice to use the back camera for a video tour, concert, etc. Its extremely fast with no hiccups that I've noticed (in 3 months). Frequent updates which is rare for a Android device. Coming from the Tegra 3 quad core processor on the Nexus 7, the dual core A15 1.9Ghz and Mali GPU on the 10 plays games just as well which is impressive for the best screen in tablets. Movies don't get any better. The absolute best video experience in tablets, I guarantee. As an engineering student, this device has been more than capable and helped me be organized and prepared for classes.Reasons why I like my Nexus 10 over my girlfriend's iPad 4:-better screen-front facing speakers-better multi-tasking-more customization-can open zips-can download attachments from sites that the iPad can-can use flash-can plug in any USB accessories with OTG cable (flash drive, mouse, keyboard, xbox controller) without installing anything or paying for over priced device specific accessories*iOS does have more tablet optimized apps but that's the OS and not the device itself. This tablet is hardware superior in every way and the OS is much more capable.", "Date": "March 25, 2013"}, {"Title": "Now this is what I have been waiting for!", "Author": "Xandanga", "ReviewID": "R2QBA955IUIGM2", "Overall": "5.0", "Content": "I am an avid tablet user. I began with the original iPad and continued getting the Apple iterations on future launch days. Of course I was impressed with Apple's offerings but something just felt.. missing. I switched from using the iPhone 5 to the One X+ on AT&T; but returned that and got a Nexus 4 (which I also love). I feel that while Android may not have as many optimized apps, the Android OS is miles ahead of iOS in terms of functionality.So here I am with the iPad 4, bought just 7 months after I bought my iPad 3 (shouldn't these by at least a year apart??). I decided to jump ship and try out the Nexus 10. And boy, am I happy I did that!Pros:-Gorgeous display, in every way. Viewing angles are wide, text is crisp as can be and the contrast is stellar (from a tablet perspective, some phones are better).-Speed. This thing flies. No lag or observable hiccup anywhere. Coming from Android I definitely expected some hiccups or dropped frames, I was pleasantly surprised.-Weight. It is light-weight. I have no problem using this with one hand holding on from the middle while in landscape. I hardly ever use it in portrait.-Speakers. YES! I don't understand why anyone would ever choose to put speakers on the back. I love how the tablet looks with the speakers facing you and on both sides. Symmetry!-Gaming abilities. Every game I have tried runs flawlessly. Mind you, I place relatively simple games. No shooters or racing games here. Mostly puzzle, side scrolling and such. Spirit HD is my favorite game.-Browsing. While the bundled-in Chrome is lackluster in a number of areas, the AOSP is incredibly smooth. I notice no scolling lag or checkboards here, even when there is Flash on the page!-Battery life. Easily lasts two days of my moderate-high usage. Mainly browsing the web or something.-Updates. Since this is a Nexus tablet, you can be sure you will get timely updates to the OS.Cons:-Tablet optimized apps. This is just a shame, really. Most apps don't use the space effectively, I am hoping this changes since Google launched their own tablet.-Charging. Battery charges slowly, plus it actually loses power when I am playing a game and have it plugged in. Maybe a dock or magnetic plug in will charge it faster.-Chrome. The built-in browser is a huge let down. Consumers that are new to tablets will be very disappointed with this. Make sure to get a different browser from the market (Ocean Browser, Boat Browser).Overall, it is of my opinion that the pros heavily outweigh the cons.If you are in the market for a tablet, I would not hesitate to recommend this product. I am in love with it! This tablet is great and will only get better.", "Date": "January 17, 2013"}, {"Title": "Review with Comparison to Note 10.1", "Author": "Ben", "ReviewID": "R1QW3HZA1OVGWQ", "Overall": "4.0", "Content": "I thought comparing both units and the Nexus 10 on its own would be a good idea, since many people ask themselves which to buy. Ill rate each area on a 0-5 scale, 5 being the best.Sound:Note 10.1 - 4.5Nexus 10 - 4.8Both units have great front facing speaking. They do both however lack good low-end. The Nexus edges ahead for being the louder of the 2, and having a clearer upper frequency range.Screen:Note 10.1 - 4.6Nexus 10 - 4.6They tie. I know that may seem weird, seeing as the Nexus has that great resolution and DPI, but read on. The resolution of the Nexus is GREAT. I used a few HD Space live wallpaper to compare, and WOW, they look great on the Nexus. My problem with the Nexus is colors are very washed out, on the Note 10.1 colors are very vibrant with deep saturation. When it comes to reading PDFs, Word, and internet browsing, both screens to about the same. Most websites are scaled for average, not high, resolutions. PDF/Docs are both very readable. There is a slight sharpness increase from the Nexus, but you have to really zoom in to see it. Games on both units perform well, but each has its ups and downs. The HD screen provides detail, but the washed our colors really show in HD games and the Note looks better in that regard. Unless youre truly using 1080p+ content, you wont really notice much difference. THe Nexus also has a bit of light bleed, while the Note doesnt.Construction:Note 10.1 - 4.2Nexus 10 - 4.8I should preface by saying, I have NO problem with plastic bodies. My problem with the Note is that the plastic feels very thin, and has a LOT of give, and can even \"crink\" when flexing. The Nexus 10 feels VERY solid, and the grippy texture on the back is great. If it wasnt for my Note being in a case, Id worry about it alot, the Nexus, less so. The buttons on the Nexus also seem better build, the are firm and have a good \"click\" when used.Performance (real world):Note 10.1 - 4.4Nexus 10 - 4.6The Nexus edges out ahead just a bit. The UI and app performance is consistently better. Its hard to say if thats because of the hardware or slight better hardware. The only area the Nexus struggled with was using ezPDF. For some reason turning pages made the Nexus skip frame rates, I'm would guess that the app more than the tablet. Games and Apps run great in both, but the Note SOMETIMES hiccups a bit, the Nexus has yet to.Battery Life:Note 10.1 - 4.8Nexus 10 - 4.6Both Units have great battery life when it comes to \"real world\" use. My Note lasts my 5ish days, while the Nexus last 3ish. Given the increased screen resolution being rendered and the higher clocked hardware, this is a reasonable tradeoff. Keep in mind these times were achieved with a tuned OS. Rooted with all unneeded services/programs disabled, and I run DS Battery saver on its most aggressive preset.Productivity:Note 10.1 - 4.9Nexus 10 - 4.3Its REALLY hard to beat the Note in productivity. Multi-window is great, S-pen for handwriting notes and drawing is unmatched.Misc:Note 10.1 - 4.4Nexus 10 - 4.6This is mostly how much work it takes to fully setup tablet as a power-user. Both devices root easily. The Note has MANY more services and bloatware to be tuned to really max out the performance of the OS. The Nexus, well thats pretty stock, so only a bit of trimming is required.Stability:Note 10.1 - 4.8Nexus 10 -4.8Updated to the latest OS on both, they both run great. Ive yet to have an OS lock, random reset, or had to hard reset on either. Both have gotten the occasional random app freeze, but its occasional and most likely the app, not the OS. Its worth noting both tablet to well at recovering from app freezes when they do happen, the OS never needs a hard reset.Storage:Note 10.1 - 4.9Nexus 10 - 4.8The Note wins out of box because it got a built in memory card slot. You can root the Nexus and buy an OTG cable and a USB card reader and get the same function. Its just one more step, and added cost though.So how do you choose between the 2?The Note right now is all about productivity. If youre a student looking to take digital notes, or looking for general productivity the Note wins hands down. I cant tell you the amount of times Ive pulled up a PDF, Word/Powerpoint doc side by side with Papyrus (my preferred note taking app). As a media device the Nexus is better. Music is louder and clearer, and movies in HD look great.If anyone would like anything else comparing side-by-side just ask, Id be happy to add it.", "Date": "May 15, 2013"}, {"Title": "Nexus 10 vs Samsung Galaxy Tab 3 vs ASUS Transformer T100TA", "Author": "drifter yank", "ReviewID": "R1PHP76RQO13HR", "Overall": "5.0", "Content": "Over a period of several weeks I tried out the following.  (I will post this same review in Amazon under each device.)1. ASUS Transformer T100 hybrid tablet/notebook \u20282. Samsung Galaxy Tab 3 10.1 Tablet\u20283. Google Nexus 10 tabletI also looked at an iPad Air.  They are way overpriced.  And I still have a grudge against Apple for the 2012 hard drive recall they had on our 27\" iMac.  It was a total disaster.  We didn't lose any data but it took weeks and endless phone calls to get it running right again.After spending a day getting used to Windows 8, I thought the ASUS might be the one I was going to keep.  I actually only tried it for two days.  Early on day three I shut it down only to have it remain on the \"Shutting Down\" screen for an extended time period.  So I powered it off.  Apparently, my bad.  Subsequently it would not reboot into Windows, reset or repair even after talking with ASUS Tech Support.  They asked me to return it to them for repair.  I declined and returned it to WallyWorld.I liked the ASUS.  It was attractive but a fingerprint magnet both front and back. And it was more difficult to use than Android.  The two issues that bothered me most were the lack of a Swype app and the complications of dictation.  The best Swype-type app in the Windows Store is TouchPal.  It ain't that good.  First of all the virtual keyboard is large. Your finger has to cover a lot of real estate to enter characters.  Also, the word prediction accuracy sucks. Windows-supported dictation was not that accurate, so I had to go into Google to dictate.  This was not nearly as handy as being in a Google operating system to begin with.  I use Swype and dictation a lot.The mentioned issues relate to Windows 8 not the physical unit.  I liked the ASUS unit enough that I discovered they make several similar models running Android.  After checking these out I found they were either running old versions of Android or cost a couple of hundred dollars more than the two Samsung models mentioned here.  So, that ended that.It was hard to choose between the Nexus and the Galaxy,  Both are made by Samsung.  I waited several weeks to see if a new Nexus 10 was coming out but to no avail.As far as looks go, the Galaxy is very thin and attractive.  In my opinion it is as nice looking as an iPad even though it has more plastic.  I had the white one so fingerprints were not that visible.  The Galaxy gets compliments for its narrow bezels.  However these are really a functional negative. They cause you to touch and activate stuff on the screen accidentally quite often.  Makes me suspect the iPad has the same problem.  There are a lot of complaints about the large area of sensitivity for the three built-in keys at the bottom of the Galaxy.  However I thought this was minor compared to the narrow side bezels.  (You can probably negate the side bezel problem by putting the unit in a folio case. It could give you more to hang onto.) The speakers are on the top of the sides and are easy to cover up when holding the unit.Though made by Samsung, because Google's name is on it the Nexus is first in line for Android updates. It has already downloaded the latest Android version, KitKat.  It will also be the first to get future updates since there is no manufacturer software OS overlay to wait for.  It is pure Android--no bloatware.  In terms of specs, the Nexus blows the other two units away.  The broad bezels may not be as attractive but they give you something to hang onto without accidental screen touches.  The Nexus' rubber-like coating on the back is better for grip and not a fingerprint magnet.  Less bling but more practical. The Nexus' speakers are on the on the front, the best place.Even though I did not keep the Galaxy and its specs are much less impressive than the Nexus, I found it perfectly satisfactory for my needs.  I do mainly Web browsing, Email, some text and spreadsheet documents and a few non-graphic intensive games. I bought all of these units from local big box stores.  The Nexus 10 was $400 and the two Samsung units were only about $30 less.After considerable researching of portable Bluetooth keyboards, I ordered and just received a Kensington KeyFolio Pro 2 Universal Case and Keyboard.  I bought this from Amazon and will review it when I have had it for awhile.  So far this looks like a terrific and attractive accessory  I will probably keep the Nexus in the protective case without the keyboard most of the time.  I will use the keyboard when I do a lot of data entry.", "Date": "December 12, 2013"}, {"Title": "Beautiful Screen Buggy Software", "Author": "J. M Nevins", "ReviewID": "R2BR3O56OV9DXQ", "Overall": "2.0", "Content": "I bought the Nexus 7 for travel and liked it so much that I decided to buy the Nexus 10 to use at home. The Nexus 10 screen was gorgeous, Jelly Bean 4.2 had lots of neat features and the build quality was excellent so I quickly learned to love my new tablet.  That is until it started misbehaving.  It began with Chrome becoming unresponsive to touch inputs followed by a spontaneous complete shutdown and eventually a reboot.  Once it had rebooted, I continued to use it but Chrome kept on freezing up to the point of being unusable. I did some research on the web and discovered that these behaviors were common with the Nexus 10 and the latest version of Jelly Bean. So I reset the device to factory defaults in preparation for a return.  However, the next morning I hated the thought of returning the tablet because it was so nice minus the software/hardware hiccups so I reinstalled all my apps and updated them all in the hope that maybe the bad behavior was a fluke.  Not so.  Chrome began locking up again so I reluctantly returned the Nexus 10. I am disappointed but I am willing to give the next Nexus 10 a chance, hopefully with less buggy software because the rest of the experience was very positive.", "Date": "January 26, 2013"}, {"Title": "To buy or not to buy that is the question!", "Author": "Al Dante", "ReviewID": "R2DP1BV3EB2BX4", "Overall": "4.0", "Content": "Originally I posted a long history of the Nexus 10 and updated it once. Now that I have used it for a while I will condense it into something easier by eliminating everything I said before and just getting to it:1. A tablet will NOT replace a laptop for web surfing. The Nexus 10 does a darn good job of being a backup internet source but for having to type in web pages, etc, its not that user friendly so you will really need a laptop for home use and this for travel or other.2. Google Play, the online store equivalent of Amazon, is worlds ahead of Amazon is usefulness and ease of use. Searching for books, music, movies is a snap. Everything is loaded into their cloud but you can PIN things to be actually downloaded to your Nexus for like using on a plane withoug Wifi availability.3. I already know that this is going to be great to travel with versus lugging a laptop around. I'm taking books, movies, all my music in one small package. You can also use if for e-ticketing, to travel with an electronic boarding pass.4. Uploading your own music is a piece of cake. Picture is bright and clear. Reading is effortless, and the sound of the music player is impressive. You can easily hear the speakers from 25 feet away so its not toy but its not your surround system either!Last, knowing what I know now, I wish I would have bought the Nexus 7 and 10 instead of the 10 and the Kindle Paperwhite. Again, searching for books in Amazon is like having teeth pulled. I wanted to have both to avail two book stores and two buying options.", "Date": "January 22, 2013"}, {"Title": "Best tablet out today, get it and fast!!! I would get the 32gb version if I were you....", "Author": "xplics", "ReviewID": "R3LNKMLXPJ1PD0", "Overall": "5.0", "Content": "With the Google Nexus 10, Google and Samsung have managed to come up with a technological wonder. Google has made the right calls in term of aesthetics and industrial design, while Samsung was able to bring the best hardware to the game. The display is beautiful and the system has enough muscles to handle any media you throw at it.The most surprising aspect of the Google Nexus 10 is the price: At $399 (16GB, WiFi), the Google Nexus 10 is significantly cheaper than Apple's iPad 4 which beats it only in polygonal graphics. This is a very aggressive pricing, especially if you think that this powerful tablet costs a mere $70 more than the iPad mini which is far less potent.If you want a tablet for basic things like email, web, gaming and apps, this is the best option for now. It is both cheaper and better than most of the competition. There are a few exceptions: if you want a stylus, the Samsung Galaxy Note 10.1 is a better alternative, and if you need Microsoft Office compatibility, the Microsoft Surface RT would be better. Unless you absolutely want iOS, there is simply no compelling reason to pay $100 more for an iPad. If you do, well... it's settled.", "Date": "December 12, 2012"}, {"Title": "Great device", "Author": "C. Young", "ReviewID": "R3U8OZALFANBWI", "Overall": "5.0", "Content": "Had mine for a couple of weeks now and couldn't be happier. I have used it on several different Wi-Fi systems and it has worked flawlessly. (Sorry about the others having problems.) I really like the Jelly Bean operating system better than Apple's iOS. (I also have an Ipad 2.) Yes, it is a little slow in charging but nothing I can't live with. I'm sure they will tweak it. Screen is beautiful & browsing is first rate. Highly recommended!", "Date": "January 1, 2013"}, {"Title": "After Android 4.2.2 Works Great", "Author": "Michael B. Justman", "ReviewID": "R3NMP7SFBXZVGF", "Overall": "5.0", "Content": "Ignore any reviews about battery life written before 4.2.2 came out. I get about 8-10 hours of screen time with this on one battery charge and performance is amazing with 3D games.", "Date": "April 6, 2013"}, {"Title": "Nexus 10 is great", "Author": "Aaron Dahl", "ReviewID": "ROYTN294WPBBO", "Overall": "5.0", "Content": "This tablet replaces a cheap 10\" Android tablet that I bought last year. This 10\" tablet from Google is fantastic! Compared with my other one, Nexus is fast, the new Jelly Bean o/s is simple, intuitive, and fast. Somehow the Internet speed is truly faster than other new tablets including several Asus, Samsung, and iPad models that some of my friends have. The screen is absolutely incredible: video comes in crystal clear and smooth; there is no lag. Stunning!With all the praise, there are always areas of improvement and truthfully I wish I could give it 4-1/2 stars: 1. navigation bar takes real estate: while the new o/s is smooth, the navigation is now always on the screen, 2. the tablet is a bit heavy: you really have to squeeze it tight to hold it along the side with one hand (as I am often trying to do), 3. volume rocker is backwards: I am usually holding the tablet in portrait orientation with the power and volume toward the top, but then you have to hit the rocker up to turn the volume down, perhaps it was designed by a lefty, 4. lack of expansion: I know Google's whole mission is your life on the web, but occasionally, I need to transfer data and don't have an internet connection, I would really love a microSD port (also I could buy a 16GB card less than the $100 premium I paid for the 32GB version of this tablet).Overall, I would certainly recommend this to anyone looking for a good solid tablet with a superior display.", "Date": "February 2, 2013"}, {"Title": "The best Android tablet", "Author": "Barbēlō", "ReviewID": "R3CZW73X9S5I4N", "Overall": "5.0", "Content": "I have an iPad 3 and this Nexus is just as user friendly and the battery lasts just as long, if not slightly longer.Because the Nexus is a Proper Android device being Googles own tablet, the O.S gets the latest updates a lot quicker than any other device.I needed an Android Tablet for all my Apps that I got from Amazon that I couldn't play properly on the Kobo Vox....When my son mentioned to me about the Nexus 7 I was interested yes! but then in the Kindle Forums someone told me about the Nexus 10 coming and when I realised it was a Samsung tablet I wanted it there and then.I kept the Google playStore page up refreshing it every few hours, until about 2 weeks later luckily the Nexus came available.Ordered it straight away on the Sunday Evening and by Tuesday Morning I was connecting the WiFi....it came that quick I was really and truly amazed. The service I had from Google was outstanding, the after sales.....having a Free Phone Number to help me setting everything up and they talked very clear which I was really pleased about.I was extremely pleased how Google had set the tablet up to be so clear, it's really user friendly.The Nexus is such a beautiful device, so smart and the touch screen is so responsive.Because I got it direct from Google themselves I managed to get the 32GB, but it's a shame that you cannot add a Memory card into the device.The speakers are a tiny bit quiet for my liking, but you can actually get an app from Amazon  Speaker Boost  so you can play your music just like its got surround sound.  But if you would rather listen with the head phones, another app in Amazon from the same developer  EarpieceThe only trouble was getting my Nexus directly from Google ....the charger started messing up so I had to find another one instead because I knew the device itself was ok.  A lovely reviewer found the very Charger that I needed as the Nexus is a 2amp device.You really do have the best of both worlds...Amazon App Store and Google PlayStore.Playing music, games, reading and watching films on this Nexus is terrific. I still use my iPad, but I'm so overwhelmed with this device....you can't buy any better in my opinion and its so comfortable holding it in your hand to play games or reading.  I could actually keep praising the Nexus because I love it so much and the fact that you can store all your music, books and games in the cloud from Amazon and Google I am using the Nexus all of the time, maybe a tiny bit more than the iPads.If someone told me about a year ago how much I would be using an Android device today I would never of  believed them because back then I was never comfortable with Android, but they have come on Massively over the past year.I did originally buy a case for the Nexus, but I found it to be too heavy so I have removed it out of the case and now I am hoping that I can get an sleeve to protect it when I carry the Nexus in my bag.Because the Nexus 10 is so slim, I have got it in my dressing gown pocket so I can listen to my music whilst I'm walking around the house doing other things at the same time....I never thought I would be able to that with such a big device like this, but that's because it's so light and slim  like I mentioned.September 19th 2013**************************I have now in my hand, the new Nexus 7 32GB  also bought direct from Google Play and within less than 36hrs of me pressing the buy-now button.  It's so smart....I'm so pleased with it, slimmer than the previous Nexus 7 so I'm glad I waited.My Nexus 10 is lovely for playing games on, but found it a tad bit big to read my books so that's why I got the smaller Nexus 7 device", "Date": "March 15, 2013"}, {"Title": "Powerful and inexpensive for what you get", "Author": "Carlos A", "ReviewID": "R214UZ5IPNTW70", "Overall": "5.0", "Content": "Bought this for my wife, since she needed a tablet for easy transportation but good content creation (not only consumption). As she needs to edit a lot of Excel and Powerpoint files (using the Quickoffice app) the large screen coupled with a bluetooth keyboard is great to use. Another plus is the Google Android stock experience (guaranteeing eventual upgrades) and the marvelous screen definition. Definitely recommended.", "Date": "April 6, 2013"}, {"Title": "Hardware is superb, but 4.2.1 has some bugs", "Author": "Andrew Peter Atkinson", "ReviewID": "R21U6RLIFY84QA", "Overall": "4.0", "Content": "Having used the Galaxy Tab 10.1 for a year and a half I sold it for 3/4 of the price of a Nexus 10 and upgraded. I've been quite happy with my Nexus 10 for a month now.  4.2.1 does have random hard resets and force closes, mostly related to Chrome and Google Now (I'll be upset if this isn't updated by March).  The machine is almost as snappy as my Samsung SIII with Jelly Bean.  The back feels velvety smooth like the back of the Playbook, and the front speakers are loud and provide good sound - I rarely reach for my Jambox with this thing.  The back can be scratched, so I would recommend a Poetic Case.  When I originally moved from the Tab, I found that the colors on the Nexus 10 were inferior.  I don't notice it anymore.  Also, the battery life is reduced from the Tab.  I get about 8 hours. The only real question for me going into this tablet, was whether I would buy the Nexus 7 or 10.  If you already have a 4.8 smartphone, then the 7 is redundant.  I've used the 7 for extended periods and the 10 is a better pad.  It has a much better screen, and the build quality is fabulous.  You won't feel an ounce of remorse buying this (except for the price - shop around). The best accessory for this machine is my kindle edition, Android Mandroid: Thoughts on Android Smartphones from a Conflicted User. Trust me!", "Date": "January 15, 2013"}, {"Title": "Beautiful Screen and its fast too!", "Author": "Adam G", "ReviewID": "RN7DPE2SSAZZO", "Overall": "5.0", "Content": "I've had a variety of Android 10\" tablets.  I've had Samsung Galaxy Tab's, ASUS Transformer Tablets to name a few and this Nexus 10 is by far the best I've had yet.  I was a bit concerned by the dual core specs listed but I haven't seen the tablet lag even a bit on the latest release of Android 4.3.  The screen resolution puts my newer iPad 3 & 4's to shame, plus I generally prefer holding the 16x9 oriented Android tablets over the more 4x3 oriented Apple iPads.  The tablet is well built with very rigid matte black plastic.  It doesn't flex like some other plastic tablets I've had previously.  I enjoy the indicator light on the front of the tablet, that's a feature that doesn't seem to exist on the competitors' tablets.  In addition to the fluidity of the software and the quality of the hardware it is nice to know you'll get Android OS updates from Google for a few years.  You don't have to play the manufacturer waiting and guessing game of will you ever get an Android upgrade.  Overall this is a quality Samsung product made better by being part of the Nexus program.", "Date": "October 9, 2013"}, {"Title": "Better price. Better tablet", "Author": "nick", "ReviewID": "R1C72GV5SU2M2H", "Overall": "5.0", "Content": "This tablet exceeded my expectations by far. I considered an iPad for so long but my father convinced me to get this. Screen quality is amazing. It has a range of video formats. Syncs perfectly to your gmail. This is the future of tablets. Pure accessibility!", "Date": "July 27, 2013"}, {"Title": "Very nice tablet", "Author": "ek", "ReviewID": "R3H39ANQ4YVFJ8", "Overall": "4.0", "Content": "Before starting, i'd like to say that the Nexus 10 was my choice of tablet after months of meticulous research.First Impressions : First thing you notice on the tablet, even before the first boot? The design. I like it. A sleek exterior, soft touch grip, nice stereo speakers, etc. So far I'm happy. Then I boot her up. First thing I notice, which happens to be one of the main features, the dazzling 300 ppi display. Amazing. No blurry text, no blur anywhere. Then I slide down the notification bar see that it has 80 percent battery. Very happy. No \"initial charge\" that takes 20 years.  Nice. Clean interface,  instant connection with Wi Fi, everything I see is something I just need, love, or prefer, Everything.So, that is the story my first thoughts about my new tablet. Now some tips to the new Nexus 10 user.1 Get Nexus Media Importer. Even before system updates. The 4 dollars, plus 3 for a otg connector, are SO worth it.2 Next is a system update. Try to get 4.3 or newer.3 This one is obvious, but get yourself a case. And a Bluetooth keyboard. You'll need it for any kind of productivity.I will update with more info.Update 1: I have found a couple of minor gripes with the tablet.1. The notification bar is not accessible from all appsE.x while playing Sonic Jump, the notification bar is impossible to see until you close the app2. Because of the ultra ultra ultra high res screen, the battery life is between a half hour and hour and a half less than anIPad. But then again nothing really beats the iPad with battery life.3. This is being extremely nitpicking, but the Nexus's screen seems to have SLIGHTLY muted colors. Remember, EXTREME nitpickers will notice this.I feel that the minor con's are all far away from being deal breakers. Tablet is still the best.Update #2: I brought this with me on a recent week trip. I have to say, my overall experience was good, but not perfect. I used it to watch a movie with others. The movie played perfectly fine and was SUPER high quality. The definition was ridiculous, and the viewing angles are amazing. However, when I took pictures while sightseeing, the photos were just average. Not horrible, but not even to my 8 megapixel phone. :(. Still, I feel that the pros heavily outweigh the cons.", "Date": "August 13, 2013"}, {"Title": "I haved owned 6 tablets in the past year and this is the best", "Author": "Ruben", "ReviewID": "R2YBH5W6FFH3KF", "Overall": "5.0", "Content": "I have owned the original iPad, iPad mini, Motorola Xoom, Transformer Prime, Transformer Infinity and now the Nexu 10 and the Nexus 10 is by far my favorite.I wanted more flexibility then the iPads could offer so I switched to android tablets.I started with the Motorola Xoom but that was too underpowered and had difficulty even running a simple live desktop. So since that was a dual core chip I figured I'd look for a quad core tablet. The Transformer Prime was faster with its quad core chip but had I/O issues so it could not multitask. I hoped that they would have resolved it with the newer Transformer Infinity but the same super slow I/O issues were there preventing it from being a multi tasking tablet. So I finally gave the Nexus 10 a try. I was hesitant at first because the Nexus 10 is a Dual core tablet... I wondered how it could possibly stand up to the Quad core tablets but the newer A15 chipset in the Nexus 10 blows the other tablets away.The screen is the best I've seen on any computer or tablet and the zippiness of the tablet is incredible. I there is no lag at all between a touch gesture and movement on the screen. There is no stuttering during multitasking. The sound is incredible from the 2 front facing speakers, and i still cant get over the screen.Its pretty easy to unlock or root with plenty of links out there for one click roots if that your thing.I would highly recommed this tablet as the only viable iPad alternative for someone looking for more control over thier tablet and at a lower cost.", "Date": "May 20, 2013"}, {"Title": "Google gets it right", "Author": "G. Reon", "ReviewID": "R2CINWOWBWKL3H", "Overall": "4.0", "Content": "Having used several other tablets in the past I feel qualified to give a review on this one.  I use the 3rd generation iPad at work daily; have owned the third generation iPad which I sold; and own an Asus Transformer TF-101 for playing on at home.  Jelly bean was not coming to that particular model so I decided to try the Nexus 10.  After using the Nexus 10 for a month I am very happy I did.  It is very quick even in comparison with the iPad.  The apps I run on it run without hesitation and I have had few hangups though I believe those few to be app problems that will fixed in future updates.  The feel is good; it is thin and light but also feels sturdy.  The resolution is superb though I agree with the color problems I have read about.  For most people using this for light business applications or gaming or just checking email that will not be an issue.  Watching movies I could not really notice a color problem.  If you are using this for photo-proofing or something similar it could be.  The only real issues I have other than the color is the lack of expansion slot for a micro SD card to expand the memory and the wi-fi is not consistent, which I have noticed on other Android tablets.  With everything taken into consideration I could recommend this as a top-quality tablet if you are looking for Android O/S.", "Date": "April 16, 2013"}, {"Title": "Great Tablet.", "Author": "Jabaski", "ReviewID": "R7J9BRRWQAHD2", "Overall": "5.0", "Content": "This is the Android tablet to get, although it does lean heavily on \"the cloud\" in many regard.Pros:- The display is stunning.  You have to see it in person to truly appreciate it.- This tablet is powerful, and runs smoothly.- $100 less than an iPad.Cons:- Some Apps have to be side-loaded to install on Android 4.2.  This is only an issue for a few apps.- Few apps take advantage of the 300ppi display.Google set the bar high for Android tablets, and went on to prove that you don't have to pay extravagant prices for a great electronic.", "Date": "January 21, 2013"}, {"Title": "Miserable battery charging time and Wi-Fi range", "Author": "Pavel Snopok", "ReviewID": "R2XDAXIDYAZQ4O", "Overall": "1.0", "Content": "Went through three of those units: two refurbished and finally one new. All of them suffer the same issues that ultimately were a deal-breaker:1) Wi-Fi signal is weaker than any other device I compared to (used a myTouch4G phone and Samsung Galaxy Note for comparison + Network signal info and SpeedTest apps). Consistent weaker signal using both bands. Video streaming suffers as a result, sometimes to a point where it is unbearable.2) Overall battery life suffers from driving such a high-resolution screen, certainly an overkill for a tablet.3) Battery charging is the worst nightmare as mentioned by so many other reviewers. You need ~10 hours to fully charge it using the standard charger. I haven't tried POGO charger, but from what I read the difference in charging rates is not that dramatic.4) That's not all. If there is any activity on the tablet, the USB charger can't really keep up, so the best you can hope for is that you battery will stop discharging, but working and charging at the same time is not going to happen. If there is a lot of CPU load, the battery keeps discharging even with the charger plugged in, just at a slower rate.Ended up returning all units and getting a TF700 instead, so far everything works fine. The design is not on par with Google Nexus, but the performance is great.Alas, Google Nexus = back to the drawing board.", "Date": "August 5, 2013"}, {"Title": "The Nexus 10 is a very good choice", "Author": "Angel Golev", "ReviewID": "R8LS9VCTODTDY", "Overall": "5.0", "Content": "The tablet works fast enough. Its surface is quite convenient. The display has a very good resolution and excellent quality. The speed of Wi-Fi connection is very good.The battery life is sufficient for my purposes. Time to fully charge the battery is about 6 hours, but I usually charge my tablet at night.There is no slot for external flash memory. For data transfer you can use the internet storages, USB cable or Wi-Fi. The upload speed with Wi-Fi for large files was about 5-6 MB/s. My colleagues who have other kind of tablets with a slot for external memory, do not use it much.Services provided by Google are more than enough. You can easily find the apps for any purposes.Cons: long battery charge", "Date": "April 11, 2013"}, {"Title": "Watch out for previously used when ordering 'new'!", "Author": "drbink", "ReviewID": "RO276CD340P2E", "Overall": "1.0", "Content": "The box had been opened despite there being a seal stating \"Do Not Accept If Seal Is Broken\". The quick start guide was missing. I am charging the unit and will inspect for previous use. If so, I will return to this seller. Very disappointed Amazon!!!", "Date": "March 4, 2014"}, {"Title": "Do NOT Order This Item From Amazon!", "Author": "Pamela T. \"Pamela\"", "ReviewID": "R3P7788U6KO861", "Overall": "3.0", "Content": "Twice now I have ordered a BRAND NEW Google Nexus 10 and gotten one that has been opened (the security tpe that signifies that the product is new and that says \"Do not accept this product if this is broken\" has been cut, and the second time, they had even put a white sticker over that label and the sticker was ALSO cut). I called Amazon's customer support, and I was told the second time that Amazon probably cuts them open to check that everything is in the box. That's ridiculous. I've never heard of a retailer opening brand new items to make sure the unopened box has verything in it. I personally think that this is just a line of bull (I've bought a lot of electronics from Amazon that arrived unopened), but I was told that there is no way to find out whether sellers are just selling opened products as new or Amazon is cutting them open for some stupid reason. So, long story short, this is probably a wonderful device (I'm going to go buy one directly from Google - I'l pay a bit more, but it will be NEW and UNOPENED), but don't buy it form Amazon. Their customer service is either totally wrong (and the sellers are responcible) or they are total idiots on this one (because opening the box an expensive electronic device comes in automatically reduces the worth/resale value of the item, and, in some cases, could void the warranty). Either way, save yourself a headache and buy an UNOPENED one from a reputable seller. LFMF", "Date": "May 29, 2014"}, {"Title": "good tablet for your money", "Author": "KINMAN CHENG \"kc\"", "ReviewID": "R2MAVMEG61B177", "Overall": "5.0", "Content": "instead of a general review, I am going to focus on what I observed- yes, the speakers are pretty good- the screen is very bright, actually too bright when it is 100%. I set it to the lowest level, still good enough for indoor use, plus saves battery. of course, don't let the any light above reflects on the screen-- for those who are techs and/or pay attention to details, the specs may be confusing. google says it is ARM15 and 2GB ram, but the system only shows ARM7 and 1.1GB. I was worried that the pad has some problem or whatever, but it is not the case.the ram IS 2GB, just that the system reserved 900MB to the display, so only about 1.1GB left. I do hope that I can make it to reserve less. unless you are using some graphic intensive apps, I don't think you need 900MB for it, waste of memoryfor the CPU, it IS ARM15, only that it doesn't normal show unless you use apps like cpu-z, which shows the CPU architecture. the ARM7 it shown is kernel architecture- since it is from google, so you are out of luck on most of the nice samsung features. well, you can get a replacement for multiview, the sidebar, but multi window won't do, only full screen.- and, I don't know if it is a new pad, or because of the specs, but the reaction from the pad is pretty fast", "Date": "March 20, 2014"}, {"Title": "Very Good Tablet", "Author": "R. Fleischer \"RonToon\"", "ReviewID": "R31I6T5Y8X0VAO", "Overall": "4.0", "Content": "I originally bought a Dell Venue Pro 11 and almost instantly regretted my purchase. I was kidding myself that I could actually use this as a Windows device, a substitute for my laptop. Wasn't going to happen and it wasn't worth the cost. But the short experience made me realize that I just wanted a tablet for media consumption; watching videos/movies, internet/email, games, music.After doing even more exhaustive research I decided on the Nexus 10 even though it was far from being a new model by 12/13. One of the things that drew me to this choice were the front facing speakers, a rarity on a tablet. And that was one of my first disappointments. While the audio is fine on games and other media, the audio volume for the videos I stream via Netflix and my Xfinitey provider is extremely low, almost to the point where I can't hear dialog without either getting real close or plugging in headphones. I wish there was some way the volume could be boosted. I've tried a few apps but none seem to make any difference.Charging is very slow but I bought a pogo pin device so this isn't an issue anymore. Battery life is great, I can use the tablet for a few hours each day and only charge it once every 3 days.After 6 weeks it's only frozen once and rebooted itself once (and fairly quickly). Typing is fine, no issues there.The picture is amazing and the performance is great for my needs. I really love this tablet despite the weak/low audio for certain applications for which I'm deducting a star.", "Date": "February 10, 2014"}, {"Title": "Just \"wow\"!!", "Author": "J Anderson", "ReviewID": "R2XPUI9PRKROD7", "Overall": "4.0", "Content": "Finally...think I have found an actual productive-minded tablet that has isnt afraid if it's fun side!  After several Droid phones and unprecedented happiness from them, I decided to take a chance on the Nexus 10 tablet and was pleasantly surprised to find how easy it was to use Microsoft Office documents - a minimum requirement - out of the box, without purchasing an app to get me what I need on a daily basis.(By the way, I'm writing this on my Nexus!)Bye-bye IPAD...", "Date": "January 20, 2014"}, {"Title": "Only lasted 4 months!", "Author": "Beemad \"BAM\"", "ReviewID": "R2B5LHKXUOI1SS", "Overall": "2.0", "Content": "I am just a recreational user and didn't use it daily. Well, after 4 months it just died. Will not recharge at all. Am waiting on whether the seller (PrimeDeal) will \"accept\" the return, according to Amazon. I think I made a big mistake here.Just heard back from Amazon AND PrimeDeal and neither will accept this return. Now I have to track down Samsung to see if they will fix it. Buy this at your own risk b/c Amazon & PrimeDeal will abandon you after 30 days!!!", "Date": "December 27, 2013"}, {"Title": "Gorgeous tablet! Overall impressed with the Nexus 10.", "Author": "Lance Broussard", "ReviewID": "R1CMIDD752Z5Y0", "Overall": "4.0", "Content": "Coming from the Asus TF300T to the Nexus 10 is like going from being homeless to living in a lush and lavish mansion. I used a tablet primarily for my college classes (Ebooks, PowerPoint slides, PDF notes, homework, etc), but now I use it more than my laptop.  For school alone, the TF300T was good enough...but now I needed something more powerful and faster. So I decided to get the N10. One week in and here are my results:GOOD: The high resolution display of the Nexus 10 is beautiful to behold as well as its smoothness of the OS. High graphic games as well as memory intensive apps run with such fluidity and ease. The speed of the N10 is nothing short of amazing...from web surfing to reading articles to playing games, the speed at which every task is done is superb. The sound quality is to be expected with a tablet...not mind-blowing but good enough for the tasks needed.  The dual speakers is an added bonus as a way to bring in some sort of stereo sound.BAD: 2 issues I found...the WiFi connection seems to flicker when an app, such as a MMORPG, constantly uses the connection. It drops the connections in some instances.  There is an app that fixes this issue (WiFi Fixer is its name), but I rather see this problem taken care of through Google instead of having to get an app to do so. The auto-brightness sensor is hit-or-miss when it comes to screen brightness...sometimes it works extremely well and other times the brightness fluctuates randomly when I transition from light to dark (or vice versa). A simple fix for that is to simply turn off auto-brightness in settings.Overall I am really impressed with this tablet. If you can get through those 2 issues, the N10 is a great tablet.By the way, I don't discriminate between brands...I choose what I consider is best for my tastes. By no means am I a fanboy of any product or OS.  I have a WP8 phone (Nokia Lumia 920),  An HP G71-340US Windows 7 laptop, an Apple iPod classic (120GB), and a Google N10 32GB.", "Date": "September 18, 2013"}, {"Title": "Great Tablet", "Author": "Amazon Customer", "ReviewID": "RUTPLYMMH2RRU", "Overall": "5.0", "Content": "I bought as birthday present for daughter (college student). After reading numerous reviews I chose this one and she loves it, Very clear screen, easy to use, decent sound quality and all she talks about is how fast it downloads and well it streams. Much faster than her I7 laptop and much much faster than my sons Ipad.", "Date": "August 19, 2013"}, {"Title": "Best tablet out there", "Author": "J. Rapp \"jarapper\"", "ReviewID": "R25V95YMO9U98X", "Overall": "5.0", "Content": "This thing beats the pants off of the iPad.  The display is fantastic, speed it great and I love the Android OS.  The only thing I wish I could figure out is how to get Flash based videos and apps to work.  I tried the Lightning browser and MiniBrowser with limited success.As far as form factor, love the curved edges, the rubber backing and the size of the unit.  I do wish it was lighter, however.", "Date": "April 16, 2013"}, {"Title": "Poor customer service", "Author": "Mika H. \"Mika\"", "ReviewID": "RHRKIVU6Z4YQP", "Overall": "1.0", "Content": "As much as I would like to give the Google Nexus 10 five stars I'm disappointed in the performance and customer service from Google and Samsung. I've had my Google Nexus 10 for 3 months, in the the past two weeks I've had constant freezes and rebooting due to apps and programs. My most recent problem has been using the panoramic mode; when taking photos in panoramic mode by battery life goes from 100% charged to 0%. I contacted Google about the issue and they stated that I would need to contact the manufacturer which is Samsung since I did not purchase my Nexus 10 from the Google Store. So I contacted Samsung about my problem and I was transferred 10 times to several different Samsung departments; in which each representative would tell me that they were transferring me to their Nexus 10 WiFi only department, I never spoke to anyone in the Nexus 10 WiFi only department. Each time I spoke to a representative they wanted me to provide my phone number, full name, area code, and email address which i stopped doing after the 5th transfer, instead I would ask the representative if this was the NEXUS 10 department and the representative would tell that it wasn't and they would transfer me to the \"RIGHT\" department that could help me with with my issue. It was extremely annoying and disappointing that I couldn't get any help after 25 minutes of being on the phone with customer service and after being transferred one last time the automated system ended the call. I called back after the call was ended and once again I was transferred back and forth I then spoke to an Omar who stated that he only worked in the laptop department, a Rachel who then transferred me to a Barry, this Barry was supposedly the person that would be able to help me but he too transferred me to the \"NEXUS 10 WIFI ONLY DEPARTMENT\" after 19 minutes the automated system ended the call. I still don't understand how I kept connecting to people not in the tablet department, since the automated system gives you the choice to connect to the tablet department when you call Samsung customer service. I would say save your money b/c you may need some help from customer services  and unfortunately there won't be any solutions to your problem.", "Date": "May 15, 2013"}, {"Title": "Screen good as Retina", "Author": "Alex", "ReviewID": "R3L6IPVKLOCNR3", "Overall": "5.0", "Content": "Screen quality good as Apple Retina, exactly what I looking for.Not Apple :)Very fast.No crashes for 2 weeks. (hope never have it)Huge con: no SD card slot.", "Date": "August 2, 2013"}, {"Title": "Nexus 10 rocks...", "Author": "Joseph Paholak", "ReviewID": "R21KHBM1H2TZQQ", "Overall": "5.0", "Content": "5 stars, because it met or beat expectations from reading the reviews.  I own a I pad2 and the nexus 10 is definitely a step up.  Definitely would recommend to family and friends.", "Date": "January 26, 2013"}, {"Title": "Very Impressed", "Author": "Tim", "ReviewID": "R16SMSII8L6YKP", "Overall": "5.0", "Content": "If I could I would give this 4.5 or 4.75 stars as it's not perfect, but show me a tablet that is. The resolution on this thing is great, however I think the new Ipad's have better color range. At least from a side by side comparison it seemed that way. Nexus is definitely sharper though. Construction is pretty solid too. Mine took a tumble and landed on a piece of metal which dented the speaker cover a little but everything seemed to make it out ok. I think most tablets (my note 2 included) would have been on the way to the trash bin at that point.Lack of an SD is also a negative, but with programs like dropbox where you can get around 50GB of free storage it's not really an issue for me.I was also pleasantly surprised by the speaker power. I can listen to this while I take a shower no problem.Plays videos including netflix and .mp4 like a dream.If you want amazon prime videos or other flash stuff you will have to download something other than chrome and then do a little tinkering to get flash on here. There is no amazon prime app for android. They have one for iOS and google TV but not android(this is very unfortunate and only serves to make amazon instant videos less necessary to me).", "Date": "March 2, 2013"}, {"Title": "I like it", "Author": "Amazon Customer", "ReviewID": "R3OZAKAZQNMOE7", "Overall": "5.0", "Content": "This is a very nice small android tablet computer. It has all of the features of the iPad and will run Flash videos, using Flash Fox and a few other flash apps. It has a good camera and is fast enough, but I think not as fast as the iPad. The memory is not expandable, but I have no problems with a couple of thousand photos. If you want to store a lot of music or videos then the fixed memory would be a limitation. It has a good display and was quite easy to set up and update the operating system. I was also able to get root access without difficulty and am able to transfer files between my computer and the Nexus using my wireless router and a free app.  it is a good value as compared to the iPad.", "Date": "May 9, 2014"}, {"Title": "mine arrived uncharged and unchargeable - a pity since the tablet itself is probably great", "Author": "IanO \"Music is the food of life.....\"", "ReviewID": "R2BB5PTIPRLD7E", "Overall": "3.0", "Content": "I bought this with great hopes, wanted to change from Apple products, but unfortunately this one arrived uncharged and unchargeable, so returned it. In the end I went for a Samsung alternative, and am very pleased with that. I am sure the nexus would have been fine, but I have more storage options with the Samsung.", "Date": "April 5, 2014"}, {"Title": "Nexuscellence", "Author": "Dr. A", "ReviewID": "R3B2AW7TF7VJVD", "Overall": "5.0", "Content": "Fantastic tablet especially for the prices here on amazon. This thing flies with a custom ROM and even with stock can hang with lots of the new tablets. Make sure you buy from a good seller who won't try to sell you a previously opened one as new. I used H&H; Headphones and they sent me a brand new factory sealed Nexus 10. Definitely recommend.", "Date": "March 30, 2014"}, {"Title": "Great Tablet!", "Author": "NYGL6511 \"nygl\"", "ReviewID": "R2CK7ZRNZGL6LM", "Overall": "5.0", "Content": "I have been testing this tablet for the last 24hrs and and love it so far.  the sound is great bec of the front speakers. Beautiful picture, large screen, pretty fast even when multiple windows are up, automatically downloads all your google play apps that you use with your other devices. Also, bluetooth works very well. I was able to upload  pictures and video from my cell phone onto the tablet.Some issues I had which which applies to all android tablets I believe is the inability to use adobe flash and amazon video. I was able to fix both though just by finding help online.Here is info on how to use amazon video with your nexus 10: [...]UPDATE: Dolphin wasn't working too well for amazon videos for me but I discovered a browser called flash fox and it works as soon as you download it!and info on how to use to use flash on your tablet can be found here: l[...]", "Date": "March 25, 2014"}, {"Title": "Awesome!", "Author": "Jennifer D. Lackey", "ReviewID": "R253XIV6JZ8IZN", "Overall": "5.0", "Content": "I bought a refurbished version of this tablet to replace an Apple iPad 2 that was stolen. When it arrived, it was running Android 4.2 and I couldn't get it to update to 4.4. I tried updating manually but I couldn't get that to work either. Eventually I connected it via usb to the computer and it updated automatically at that point. So if you're having trouble updating, try connecting to a computer with the usb and leaving it for a bit; it will probably update OTA (over the air) at that point.The tablet was buggy as a box of bees until the upgrade - turned off when put to sleep, youtube, google music, google video all nonfunctioning - but once it updated it was like a new machine. It now works perfectly. The display is gorgeous and it's fairly light for the size; I have a Kindle paperwhite for extensive reading of epubs (which I love), but my eyes aren't great so this tablet's size is terrific for pdfs. Of course, you can't beat it for video or web surfing.Reasons why I love this tablet more than my stolen ipad: 1) lower price for similar specs; 2) can use mini-usb/usb connector to access a flash drive (why are people complaining about the lack of an SD card?); 3) can use apps to customize, particularly being able to dim display all the way down for low-light conditions; 4) compatible with adobe flash, at least in certain circumstances.I haven't found battery life to be a problem, but it can be improved by turning off bluetooth, GPS (location), and NFC data exchange if you're not using them and dimming the screen.Overall, performance on the Nexus 10 is fantastic and it compares favorably with the iPad 2 in all respects. It's not the end-all tablet for everyone. The size alone means that smaller 7 or 8 inch tablets would be better for some users in some situations but if you're looking for a lot of screen real estate and don't want to spend a lot of money, this tablet is an awesome alternative to Apple.", "Date": "March 23, 2014"}, {"Title": "Better than my Ipad Air", "Author": "TRONICS-INSTRUCTOR \"PCFXR4U\"", "ReviewID": "R1H8DENH3V5MNE", "Overall": "5.0", "Content": "I really miss my Nexus 10, but remember, if you buy this you will absolutely need the POGO pin cable or it will take forever to charge.With the cable only 4-5 hours for a full charge.Best display and bang per dollar especially these days.", "Date": "March 19, 2014"}, {"Title": "Excellent - Google has hit a home run with this unit and Samsung has really outdone themselves in design and manufacturing.", "Author": "chuck patterson", "ReviewID": "RABJYP6ETA7A9", "Overall": "5.0", "Content": "I had an I-pad, and then got the Google Nexus... WOW... I love this tablet way more... I gave the I-pad to my daughter. Apple doesn't get it... the growing majority wants to customize products to suit their own individual preferences. Apple will soon follow the path of Blackberry if they are not careful. Manipulative promotion and stylish looks will not work forever, and limiting, control oriented programs like I-tunes are signs of future failure. Google is definitely on target with the future.", "Date": "March 17, 2014"}, {"Title": "Great product, awful vendor.", "Author": "amilner84", "ReviewID": "R2IBKRB89WQ26X", "Overall": "3.0", "Content": "Just got this tablet today and very dissapointed by Electronics Basket. Upon unboxing the tablet I had noticed the seals where missing. You could tell they where once there. Then I noticed everything including the box was all in Spanish. So I could not even read the manual. Then I noticed it came with an odd adapter and not the orignal. Besides all that I ignored it only to find dead pixels on the screen. So it's going back and awaiting another tablet. AVOID ELECTRONICS BASKET!EDIT: Just got my other N10 from Next Generation Tech and couldn't be happier. The box came fully sealed and the tablet and contents where in pristine condition. Electronics Basket is obviously running a scam and it should be stopped right away.", "Date": "March 6, 2014"}, {"Title": "Love it! Love it! Love it!", "Author": "Jen Podvin", "ReviewID": "R1RMB2DHZZJTFD", "Overall": "5.0", "Content": "What else can I say? After using this for about 2 months now I simply cannot live without this thing, when I wake up--it's on! Geer up my cool HD weather app, find out when the bus is coming and check my emails, zip, zip, zip. Works great as a reader--syncs perfectly with adobe and kindle, drive whatever! Great for reading on the couch or in bed--I think I actually prefer it to a real book--lighter and I prefer scrolling over page turning. Also, Google now has a voice search function like Apple Siri--Blows the Ipad away imo. Resolution is better, it's much cheaper and it perfectly syncs with all your Google accounts out of the box. This tablet shows just how awesome Google has become. And I love that they update it with the latest Android OS automatically unlike other Android tablets.It's super fast, user friendly and fun! I think anyone could learn to use this device in just a few hours.Btw, don't try Candy Crush on this device--you will get addicted fast! Games look awesome and this baby never lags. Videos, what? I can plug this into my HDTV with an HDMI and mini USB adapter and stream TV or anything on the internet without a hitch--and the colors and graphics are amazing. I really can't tell any quality difference. I am also using this with Chromecast now and loving it, works great. The speakers in front are surprisingly good quality, the sound is excellent with headphones, music and videos stream and sound superb.This tablet is great for busy college students like me who don't want to carry around a heavy notebook but still want to look things up, schedule assignments or check emails. The only cons are that you need a wireless network and it's not conducive to any kind of heavy typing (unless you're a texting master), I don't use it for writing except small email responses. I have found a stylus helps significantly. As for wireless everywhere, I can't afford that service anyway--use it at home and school only where internet is avail. If I need to get online elsewhere I can just use my cell phone.Of course it's not a laptop so these things are expected although you can buy wireless keyboards to go with the Nexus--I tried one company and found that I preferred a stylus because the wireless keyboard made it too heavy and cumbersome (not why I wanted a tablet). I have a 3 lb notebook for when I need that.Buy this tablet--you won't be sorry!", "Date": "February 26, 2014"}, {"Title": "Great Product", "Author": "Arimagirl", "ReviewID": "R37AYBSETAG78Z", "Overall": "5.0", "Content": "I had my son who is a top IT man research it for me and he gave it high marks.", "Date": "February 17, 2014"}, {"Title": "Fast and snappy tablet!", "Author": "Kortney \"Kortney\"", "ReviewID": "RXJUHEMRDNOTJ", "Overall": "5.0", "Content": "I was waiting to see if the mythical Nexus 10 2 would ever come out and after waiting 3 months I gave up and purchased this in December 2013. I love this tablet and I wish I had not waited for so long. The tablet is quick and snappy. It's not bloated with pre-installed apps. I was thinking about getting the Galaxy Note 10.1 2014 edition but after playing with that and the Nexus 10 at Best Buy I decided to purchase this on Amazon. The Note was just too full of crap and slow.", "Date": "February 17, 2014"}, {"Title": "MY HUSBAND IS GLUED TO THIS TABLET!!!!!!!!!!!!", "Author": "Mary Lane Layton", "ReviewID": "R1NQ7YEDSM7V3N", "Overall": "5.0", "Content": "I haven't used this tablet yet. I can't get it away from my husband!!!!!!!!!!!!!! But I can say these things about it: 1. My husband got this for Christmas from me and he squeeled like a girl when he unwrapped it. 2. This tablet goes everywhere my husband goes. 3. He uses it at work rather than his desktop computer. 4. I bought my husband a nice big HP laptop for Christmas in 2012 and he doesn't use it much anymore since he got this tablet. 5. I also bought him a JAM wireless bluetooth speaker which was so easy to pare to this tablet.  6. I also bought him a bluetooth wireless keyboard and a stand for this exact model tablet and he loves the whole package!!!!The only thing I regret is that I may have created a monster. It would be easier to give birth than to try to get this tablet away from my husband. And OH yeah, his co-workers are quite jealous of him!!!!!!!", "Date": "January 24, 2014"}, {"Title": "Google nexus 10", "Author": "Amanda McMahon", "ReviewID": "R1M0YLUU0N5TBE", "Overall": "5.0", "Content": "Couldn't be happier with a purchase. I bought this tablet as a gift and everyone in the house LOVES it.With the multi user pages it makes everyone feel like they have their space.I ended up buying different things that just keeps me being amazed with the capabilities you can do on here.Otg(on the go) cable- a $3.00 buy that allows me  to use my everyday usb . it also allows you to plug in a controller from a gaming system. Enhancing game play tremendously.HDMI cable- a $4.00 buy allows you to mirror your tablet on you TV. Play apps on the TV, watch movies from yourTablet on your tv. My wife uses it at work to give presentations.Keyboard- I bought a Bluetooth but you don't need to. I do school work on kingsoft app and type my papers instead of using a desktop, so I would recommend only if typing is something you'll be doing often. If not the swipe typing works perfect.All in all I am very happy with this tablet. The only Con I can try to come up with is how long it takes to charge the battery. Altlongh the battery lasts long, to recharge it fully to 100% takes forever. BUT I do believe there is a charger you can use that connects to the port? on the bottom of the tablet that helps charge it much faster. We just don't let ours die. Awesome tablet, awesome price.", "Date": "January 11, 2014"}, {"Title": "Best tablet we've owned", "Author": "Big Hat \"No Cattle\"", "ReviewID": "R3GL20CIAR7TBS", "Overall": "5.0", "Content": "I bought this for me as my wife didn't want one.  My wife has now adopted it and refers to it as \"hers\".  I love this tablet.  The ability to setup separate user accounts is great.  I love the android system better than the iPad.  We had an iPad for a couple of years before it died.  It was nice for it's time, but was always a little quirky to use.  We also bought Android phones so that applications can be shared between them and our tablet.  The tablet is wi-fi only, but that hasn't been a problem.  If we're travelling, we can turn our phone into a wireless hot spot and use the 4g on that to connect our tablet.", "Date": "December 12, 2013"}, {"Title": "Nexus blows away the competition...", "Author": "BOBTECH \"Speed Freak Computer Guru\"", "ReviewID": "R3OVL20S2P7LFE", "Overall": "5.0", "Content": "Best tablet ever. tried over 10 of them. What more do you need and at $349 or $399 with 32 gb bye bye ipad at $500 + tax.", "Date": "November 5, 2013"}, {"Title": "Solid Tablet Brought Down By WiFi Issues", "Author": "J. O.", "ReviewID": "RCA075IUSJU03", "Overall": "2.0", "Content": "I purchased this tablet back in April 2013 from a local retailer. It runs all desired applications without issue, but when the battery drops below 50%, the wireless begins cutting out with frustrating regularity, around three or four times a minute for around two to five seconds each time. I purchased this tablet for use as a productivity and entertainment tool, and while it mostly succeeds at the former, it fails pretty miserably at the latter. I would be able to let this issue go if it didn't occur while the tablet is plugged in, but since the stock charger doesn't charge the device fast enough to keep up with the power output while watching streaming video, it persists until I stop using it and let it charge to 100%. I have attempted to reset the device to factory defaults several times, and I have spoken with Samsung support on three separate occasions. It was sent in for maintenance one time and the only actions performed according to the ticket were to reload the software, which essentially boils down to performing a factory reset again. Two more calls after that and they offered to let me send it back in for more maintenance since the manufacturer's warranty does not cover replacement. I should also mention at this point that my wireless network can be ruled out as I have a large number of other wireless devices of different types, including three other tablets from different manufacturers, that do not have any issues. After looking online for a while I noticed that while this problem doesn't occur on all Nexus 10 tablets, it occurs on enough of them that I would say your best bet would be to find a different Android tablet like the Nexus 7, or go with an iPad if you're on the fence about Android vs. iPad. I personally prefer Android tablets over iPads due to the more open developer platform, but for people just looking for a device for entertainment and productivity, either is really fine. It is important to mention that there are reports that Google is dropping Samsung as the manufacturer of the Nexus 10 and switching over to Asus, the company that produces the Nexus 7. I have heard very few complaints about the Nexus 7, so if you want the 10 inch Google sponsored tablet, wait until around Christmas of 2013 and buy the one manufactured by Asus.", "Date": "October 27, 2013"}, {"Title": "May be a great item, but terrible customer support", "Author": "Stephanie Seifert", "ReviewID": "R23GMGP3AIVHUC", "Overall": "1.0", "Content": "Update 1/7/13: After hours spent on the phone with various customer support reps from Google, Samsung, and, my ISP, as well as more than twice that time reading Android and Nexus forums, I have tried every solution offered. Nothing has worked. The tablet works great on free wifi everywhere I go, but it will not work on our home network. Google support has a list of about 6 routers that will not work with Nexus devices, but mine is not on there. Otherwise, it says \"most\" home routers will work. If you have a Cisco WRT160N, please be aware you will likely have the same problems I have had.We have checked and changed the frequency of the router, unplugged and plugged the router, changed.the router SSID to be all one lowercase word, changed the frequency on the tablet, told the tablet to forget our network,  set the tablet to use a static IP rather than DHCP, done a firmware update on the router, and done a factory restore of the router, all multiple times and in all combinations. Nothing has worked.All the issues I was having are known issues both for Android devices in general and Nexus devices specifically and have been discussed in forums repeatedly since early 2011, so I'm not sure why Google doesn't seem to be training its support reps (who don't seem to know anything particular about the tech involved) about these issues.Original review:I received one of these tablets for Christmas and was unable to get on to the internet after accessing our wifi. Terrible customer service from Google. The second person finally told me it was a defective device and would have to be returned to Walmart. For days, we waited after returning it, because no one had the device in stock. Finally, I get a brand-new device...and have the same issue. I have spoken to THREE customer support people today. Google needs to train their people better. I told them the problem, told them all the steps I'd been through with every other person I'd spoken to, and they ALL insisted on going through all the steps again. One of the times, I even called with a possible solution...I just had to know where one setting was on the machine...and I never got that answer. I was repeatedly told to make sure my router was broadcasting 2.4gHz because this device will operate only on that. And then I discovered by playing in the device's settings that that is FALSE. The default setting is auto, but you can specify 2.4gHz or 5.0gHz. One of their solutions to check my connection was to have me connect to another wifi network. I live in the country, so this is impossible unless I make a trip to a neighbor's house or a town. Apparently, the folks at Google don't realize that there are people still living without being surrounded by wifi. After resetting my router twice, shutting it down numerous times, and calling my ISP so I could tell the Google people that the ISP has assured me that our internet connection is fine (they don't believe the three other computers and two gaming consoles) that were currently connected, I have finally decided I don't want a Nexus 10 or any other Google device. It's not worth the trouble, apparently. (Five total calls to Google Support on two days for two different devices, and I still can't use the darn thing for anything other than a camera or a paperweight.)", "Date": "December 31, 2012"}, {"Title": "Better than expected", "Author": "ken", "ReviewID": "R1KMK0JZE5R43B", "Overall": "5.0", "Content": "Nexus has long promised a new 10\" tablet but this model was the most recent when ordered. It is wifi only, bought to replace carrying my laptop on trips. For this it does an excellent job. It came with an old operating system but immediately upgraded itself to Android 4.4.2 which is the most recent edition. It was also easy to unlock and root following directions on the internet. It is not as flashy as an Apple Ipad but its screen is especially bright, battery power good and speed reasonable. It was substantially less money than a similar Apple.", "Date": "May 26, 2014"}, {"Title": "Love it!", "Author": "Uribe Juliana", "ReviewID": "R28XGRWW6LJ2CL", "Overall": "5.0", "Content": "Great screen resolution, fast processor. Good front camera (1.9Px)I also bought Moko case which fits perfectlyI strongly recommend both products", "Date": "May 24, 2014"}, {"Title": "samsung google nexus 10", "Author": "Hamstersadancin", "ReviewID": "R1UXSD6NKWNEIZ", "Overall": "5.0", "Content": "Worked fine on jellybean, currently works fine on kitkat.The biggest upside is the frontfacing stereo speakers. Been treating this tablet as if it were a fat ol boombox.", "Date": "May 21, 2014"}, {"Title": "I love my Nexus 10!", "Author": "caroline", "ReviewID": "R15568ZDREJ4S5", "Overall": "5.0", "Content": "This is very easy to use, and although I use this at the office, one can download books and all kinds of Google apps for fun. Watching HD movies are a pleasure on my Nexus 10. I'm hooked up to Wi-Fi at home and office, but you will find many bookstores, coffee shops restaurants etc that have Wi-Fi connection!", "Date": "May 18, 2014"}, {"Title": "love love love", "Author": "Tal", "ReviewID": "RA25JYFNFSCFM", "Overall": "5.0", "Content": "Love it. Just love it. Keyboard is good. Screen is awesome. Speed is awesome. Battery life is great. No complaints", "Date": "May 11, 2014"}, {"Title": "Great product", "Author": "Bren", "ReviewID": "R191QNNUSHC2NN", "Overall": "5.0", "Content": "I absolutely love this. It is very easy to use and works very fast. I had an Acer 100 previously and had nothing but trouble with it. The Nexus 10 is just perfect for all of my needs.", "Date": "May 5, 2014"}, {"Title": "Good Tablet, Good Price.", "Author": "Fleet1 \"Fleet Runner\"", "ReviewID": "R1XYWT5ZOTD3DD", "Overall": "4.0", "Content": "Bought this tablet for my 82 year old Father-in-law that has never used a computer and wanted to start on a laptop. I thought about it for awhile and thought a tablet would be better. I believe I was right. The retirement home had a decent WiFi connection and with a few training sessions my father-in-law can play solitaire, soduku,, does google searches, logs into Pandora for music and has sent and received his first gmail.  Nice tablet that works well for seniors. Go and try it.", "Date": "April 16, 2014"}, {"Title": "Awesome screen res; not quite as fast as I'd like", "Author": "Scott", "ReviewID": "R1CB3Y1L3PISPP", "Overall": "4.0", "Content": "Overall, I'm pretty happy.  A couple things worth a mention and consider I'm comparing it to a 2012-3 Samsung Note 10.1.Cons1. Speakers are just a bit less loud.  I do a lot of TV viewing.  Not huge deal.2. Processor speed is good for a dual-core, but I left a quad & is just enough loss to notice, but not horrible.  Mostly while surfing.3. Got used to the Samsung browser w/wheel controls & flash was stable on it...gone & really miss it4. Screenshot button is now a combination of 2-switch pushing.  Minor inconvenience5. No external memory slot; got the 32GB to make up for the loss.Pros1. Screen resolution is primo.  Main reason for buying.2. Speakers are front facing; a must!Weird that Samsung makes both and are quite different.", "Date": "April 15, 2014"}, {"Title": "New to the Tablet/Pad Game", "Author": "Kenneth Crain", "ReviewID": "R1FD5HJ6D22HCB", "Overall": "4.0", "Content": "I received my Nexus 10 as a Christmas gift with the intentions of using it for school (e-books) while traveling. I am used to Samsung products (SIII) so going with Nexus was a plus for me and it is very simple to operate even for this old guy. I have not had any issue so far and it has operated as advertised.", "Date": "April 9, 2014"}, {"Title": "It does everything I want", "Author": "Michelle VanOverloop", "ReviewID": "R2ZTVG9UCIML2D", "Overall": "4.0", "Content": "I really want to say I love it.  It does everything that I expected it would.  Had browser issues for video, but was able to mostly clear with a Dolphin fix.  Had less than 2 months, so still playing with features.  Not sure yet if it's a tablet issue or magazine issue, but having trouble deleting magazines once I've read them.  Still looking for the answer on that one.", "Date": "April 8, 2014"}, {"Title": "love it.", "Author": "Carlos Zamora", "ReviewID": "R373TDDQ0OITAZ", "Overall": "5.0", "Content": "my favorite feature is the ability to create a controlled profile for my 6 year old. solidly built. I'll buy the next one when it comes out, no doubt.", "Date": "April 5, 2014"}, {"Title": "Excellent Item for the price!", "Author": "luonna", "ReviewID": "R8J1XUZ6YRQU", "Overall": "5.0", "Content": "We recieved this item quicker than anticipated and the price was great. We chose the Google Nexus 10 after much research & found that this tablet is sturdier than others, better made. Definately happy with our choice.", "Date": "March 29, 2014"}, {"Title": "great tablet, an excellent upgrade after my daughter broke my gen1 nexus7", "Author": "AerynSun", "ReviewID": "R3J8233KDC5445", "Overall": "5.0", "Content": "awesome speakers, front facingThe first thing I did was put on the poetic revolution case, not quite an otterbox but pretty damn closeThe one bad thing was that I received a european edition, it came with a funky powerblock, no biggie, I have the one from the nexus7Great, I bought the nexus 10 and my mom stole it.Now another nexus 10 is on the way. Maybe this time I can keep it as long as I kept my old nexus 7. (2yrs)", "Date": "March 24, 2014"}, {"Title": "amazon shipped me a french version!  booted in english though.", "Author": "Richard Retter \"rret\"", "ReviewID": "R3GYHCWSXTRYD0", "Overall": "3.0", "Content": "The Nexus 10 I received seems to be a version packaged for Montreal, Canada.  The text on the Nexus 10 box itself is in French as is the small guarantee booklet inside and worst of all the charger is of the 220V type with 2 round prongs; useless in Connecticut where I live.  So now I have to buy a charger of some type and/or complain to amazon.  The tablet itself seems to be in good order.", "Date": "March 18, 2014"}, {"Title": "Everything I expected!", "Author": "Frank Thomas", "ReviewID": "R17QVM0RUQ4QL5", "Overall": "5.0", "Content": "Large display, perfect for viewing photos, movies, or reading PDF files. A bit heavy to use as an e-book reader, prefer the Kindle Fire for that.Battery life is good, Totally satisfied with the Nexus 10. I also purchased a case with keyboard from Amazon for the Nexus 10. With that, I rarely used a laptop now.", "Date": "February 18, 2014"}, {"Title": "Love it", "Author": "Guy M. Bouchard", "ReviewID": "R7ZS3LAD6GNIS", "Overall": "5.0", "Content": "Great product!!! I did a ton of research and it paid off. Great tablet!! I highly recommend this tablet. I no longer use my computer for much anymore", "Date": "February 12, 2014"}, {"Title": "Great Tablet", "Author": "Entrepreneur Soldier", "ReviewID": "R1L7R5H9W0GGFI", "Overall": "4.0", "Content": "As a first time tablet purchaser & after having spent a few hours researching, I must say that I am not the least disappointed in my decision to purchase the Nexus. If you're looking for a tablet that gets the job done then the Nexus is for you; simple & sleek with vivid & vibrant display for watching movies & more.", "Date": "February 9, 2014"}, {"Title": "Mostly good.", "Author": "Steven C.", "ReviewID": "ROHWFAGAC8B72", "Overall": "3.0", "Content": "After a considerable amount of research, I bought this tablet as a replacement for my old desktop.  I also purchased a 24\" widescreen TV, a video HDMI cable adapter, a logitech bluetooth keyboard, a microsoft bluetooth mouse, a micro usb OTG cable and a POGO cable charger.  First the good.  When I first turned on the tablet, it quickly took me through the steps of customizing the system for my connections.  It downloaded all of the apps that I am using on my android phone and connected me with my google account.  The screen is awesome - very sharp and responsive.  The tablet is responsive.  The tablet quickly had me update my android software to the latest 4.4.2 android release.  A particular use for the tablet was to perform the digitization of my large LP collection.  I found a replacement in the app store for the famous audacity desktop sound mixing software - Audio Evolution Mobile and a USB Audio Recorder app for interfacing to a USB audio device.  I was able to interface to my Rega Fono Mini phone preamp/analogue to digital converter through the USB port using this driver.  I am now happily converting my LP's to wave files with this app and then converting them to MP3's for listening on my digital devices.  I also downloaded the Kingsoft Office and the AndroOpen Office apps for microsoft compatible wordprocessing, spreadsheets and powerpoint editing and creation.  I found an app to perform automatic synchronization with my dropbox account of select folders on the nexus and also an app that would mount a memory stick for read/write access.  Finally, I found an app that would allow me to print to my wireless brother printer which was not compatible with the included google cloud print or HP Print Service app.  In addition to several other apps that I use for various asundry things, I basically had everything I needed to perform the basic functions I had been doing on my old desktop plus I now had tremendous mobility and flexibility.  I have been quite happy with all of this.  I purchased the tablet when google and amazon dropped the price on the tablet by $50 in order to clear out their remaining inventory.  I don't believe you can find the 32 Gbyte version available from either amazon or google now.Now the bad.  The tablet charges extremely slowly.  I had read beforehand that the POGO cable charger would charge the tablet much faster than the included USB charger.  However, it has proven to be only marginally faster.  If the tablet becomes fully discharged, plan to take the entire night to recharge the tablet to full capacity.  In addition, there are times when I have been using the tablet while it is charging and still lost ground on the available charge on the battery!  However, when fully charged, I can usually get about 6 - 8 hours of use by keeping the screen turned down to a reasonable level and adjusting the synch rates of google mail and other services.  Another problem is the bluetooth system.  I cannot have the wifi (2.4 Ghz) up and connected while using both the bluetooth mouse and keyboard simultaneously.  The keyboard kind of goes haywire.  If I disconnect the bluetooth mouse and instead use a usb mouse (or no mouse), everything is ok.  If I disconnect wifi, I can use both the bluetooth mouse and keyboard without a problem.  Some investigation on the internet revealed that this is a problem on nexus devices going back to Android 4.2 when Google introduced an entirely new bluetooth \"stack.\"  It appears that they have not been able to fix this problem.  A few times, I have had a random reboot.  I have probably suffered a random reboot about half a dozen times in the two months I have been using the tablet.Overall, I have to say the experience has been positive.  I would give this tablet 4 or 5 stars if the serious bugs I mentioned above did not exist.  However, I am still going to keep the tablet for the foreseeable future.", "Date": "February 7, 2014"}, {"Title": "Factory refurbished tablet works like new!", "Author": "Rob Chrisom", "ReviewID": "R1XRNSCS9AP1SJ", "Overall": "5.0", "Content": "I saved a lot of money buying this factory refurbished Google Nexus 10 (Wi-Fi only 32GB) Tablet. This unit is looks and works like a brand new tablet. Save money and seek out factory refurbished electronics when purchasing electronics. This method has worked for me in the past, and it worked for me with this purchase as well.", "Date": "February 4, 2014"}, {"Title": "I absolutely love this, it is what I exspected and more!!  I have done A LOT OF BUSINESS WITH AMAZON and they ROCK too!", "Author": "William C. Barkdull", "ReviewID": "RATBQHRONT2TY", "Overall": "5.0", "Content": "I really do like this tablet a lot, nice to use while watch TV, quality made, I have a Motorola Razer M cell phone of course both of them having the Droid operating system makes everything on both the cell phone and tablet compatible, like this a lot. Met or exceeded my exspecttations and glad I settle on this one vs. others I looked at. I researched tablets for about a month and really glad I settled on this NEXUS Google tablet. Could not be anymore satisfied and would rate all over again 5 stars, A+ service once again with Amazon and would not want to deal with anyone else, AMAZON you rock!!!W.C. BarkdullIndiana", "Date": "January 31, 2014"}, {"Title": "NO DOWN SIDE", "Author": "Tammy Amuan", "ReviewID": "RGNHWAPDETHTM", "Overall": "5.0", "Content": "I purchased this for my 2-year old for on the go excursions so it could keep her busy in the car, etc.  I have had absolutely no gripes about this tablet.  unlike my two older girls' iPad's, I could upload movies into the Nexus from my laptop and watch it on our HDMI ready flat screen.  and of course everyone does this via Netflix or other nowadays, but sometimes my toddler wants to watch a mix of things compiled together like snippets of this and that. so I like to give her what she wants and easier for me to download exactly what she wants then skim through Netflix or other comparable.  and for the money, I think I paid a little under $450 to include s/h, you CAN'T go wrong.", "Date": "January 28, 2014"}, {"Title": "Generally as Expected", "Author": "Edward J. Barton", "ReviewID": "RAEC2Z47HZYEA", "Overall": "4.0", "Content": "This is my first Nexus tablet - and I am a regular user of android on my phone - so am integrated into the Google environment.  The tablet holds a charge pretty well, and is as expected and easy to use.  The screen gets tough without the optional bluetooth keyboard, which I bought and am grateful for.  Have run into no issues with speed, storage, need to be able to work apps, etc.  Biggest issue I had was I use it for demos at work, and one application we had was IE only.  Not the fault of this tablet - but there are still some web pages and applications that are optimized for IE and not Chrome, and that's about the biggest complaint outside of the inability to use Skype on it, which would also be a plus.", "Date": "January 15, 2014"}, {"Title": "awesome", "Author": "brianne gulick", "ReviewID": "R1LCE7088YI9BO", "Overall": "5.0", "Content": "I got a refurbished tablet, and there is little difference. It is so great with the ability to be customized per individual :). Love the screen resoltuion, the cameras, the size. Only thing that I hate is the slow charge time. but other then that I wouldn't have asked for a better tablet", "Date": "January 11, 2014"}, {"Title": "Oh SO  good...", "Author": "M. Rose", "ReviewID": "R31AMV9TQZAGTH", "Overall": "5.0", "Content": "Can't say enough about this tablet. Graphics are excellent , easy to use, fast, battery time is excellent. Glad we went with two of them since both get a lot of use around here..", "Date": "January 4, 2014"}, {"Title": "nexus Rocks1", "Author": "chris", "ReviewID": "R1AXZFANN54QO4", "Overall": "5.0", "Content": "I bought this for my husband who has visual problems. He absolutely loves the 10\" size and the colors are bright and beautiful. He is able to read his email and play games more clearly.Only drawback is short battery life.Very nice buy.", "Date": "December 31, 2013"}, {"Title": "Very happy", "Author": "Ellen Philbrick", "ReviewID": "R1G4C0F9RO4460", "Overall": "5.0", "Content": "I wanted a tablet to surf the web and browse Facebook without using my Galaxy phone all the time. Wanted a larger screen and something that would keep me from killing the battery on my phone every day. I also didn't want to spend the money for an overpriced Apple iPad which doesn't even have a USB port to connect to my PC. I wanted to be able to copy movies onto it so the kids could watch them and also to sync up well with my Google account (gmail, calendar, contacts, etc). Only downside I saw with the Nexus was that the memory wasn't expandable. So I purchased the 32gig version just in case. Seems to be more than enough room to hold lots of movies and since I can connect it to my PC I can copy them on and off as I want to only keeping the movies I want to watch on the device. Best part is that it cost a few hundred less than an iPad and does more too! :-)", "Date": "December 31, 2013"}, {"Title": "First tablet - love the tablet experience so far", "Author": "barbarian", "ReviewID": "RTPV34MH9THJ5", "Overall": "4.0", "Content": "I need to get one thing out of the way up front - the seals on the box were broken (apparently a quite common complaint). I was hesitant to accept the unit so I documented the receipt condition. The unit itself appeared absolutely pristine and brand new.That said I have had no issues with the tablet in the month that i have owned it and plan to keep it barring any irresolvable issues.I purchased the tablet for media consumption - YouTube, Netflix, sharing photos and videos. I am not using it for work so productivity is secondary for me. The tablet excels at media consumption - Netflix runs perfect, YouTube is great and photos look fabulous. Some have complained about the screen colors being somewhat dull and washed out (compared to an IPad). I have not found this to be an issue at all - movies and photos look more natural as a result. If you need more punch just turn up the screen brightness. The display is drop dead gorgeous.Battery charging is slow (I did not buy accessory charger) but is quite manageable - I just plug it in overnight every 2-3 days and I'm good to go. I haven't checked battery life but it has not been an issue for me.Pure Android! My tablet immediately updated to 4.3 then 4.4 (now running 4.4.2) and pulled in all my apps from Google Play store without incident. I don't miss the bloat ware!Connectivity is great - WIFI connects immediately and stays connected. I am able to tether to my RAZR with FoxFi (yes i did purchase the app) and connection speeds are quite fast as I have no trouble streaming YouTube HD when tethered. Also (and this is GREATTT), Roku just released a YouTube app within the last 2 weeks that allows me to 'beam' my YouTube playlist from my tablet to my home theater system. Whatever I punch in on the tablet is now on the home theater.This thing is FAST - scrolling is butter smooth, no hiccups, no waiting. The thing just flat out flies! I've had no freezes, crashes or random reboots (I am using dolphin browser - rather than Chrome). It's been rock solid so far.One of the things that differentiated this table from the others I was considering is the front facing speakers. They put out a surprising amount of sound (depending on the program material) with a fairly good sound field. I didn't expect a lot of bass and that is the case. The speakers are quite adequate for the job.I looked at the surface and Asus transformer infiniti. The surface was ruled out on cost and Microsoft does not have the ecosystem that android has (my phone is android RAZR). I am one of the few (apparently) that likes Windows 8 (have 2 Win 8 laptops) but I find it cumbersome to move files from the Windows system to the Android system. So I went with Android based tablet. What turned me off on the Asus was the single rear facing speaker, overpriced, and still running ice cream sandwich. I waited for the price to drop on the Asus for a year and it didn't budge! So when the price dropped on the Nexus 10 I went for it.I was expecting to be disappointed with the camera - I am not! Granted I have not tested it in difficult lighting (mixed artificial light sources, high dynamic range etc) but what I have seen so far is that the tablet does a good job of getting the exposure and white balance correct. Videos are crisp and well exposed. It won't replace your DSLR (maybe not your smart phone camera either) but nonetheless has proved quite useful and handy.That back has a rubbery material which I find a bit slippery in my hands. The tablet is very thin and light. I purchased a Fintie folio and stand combination. It protects the tablet and puts it to sleep when closed. The two make a great combination.Overall, I really love this tablet - if you don't need it for productivity you can't go wrong with this one.", "Date": "December 31, 2013"}, {"Title": "Just what we wanted", "Author": "Amazon Customer", "ReviewID": "R3SZ121K4WM0FC", "Overall": "5.0", "Content": "This was a gift for my daughter for Christmas, and she loves it!!!  This is her first tablet, and she is very happy.", "Date": "December 27, 2013"}, {"Title": "A really great tablet", "Author": "Frankie D", "ReviewID": "RMEBOKIN2EB5W", "Overall": "5.0", "Content": "I've owned a Nexus 10 for more then a year and have no regrets whatever so when Christmas came around I purchased one for my son. It arrived quickly and was well protected for shipping. Needless to say my son loves it, what's not to love... It's a great product. I've had no contact with the retailer as there were no problems with the transaction so I can say I would buy from them again without hesitation.", "Date": "December 27, 2013"}, {"Title": "Nice", "Author": "charles e newman", "ReviewID": "R28TVTBGI0ZMLX", "Overall": "5.0", "Content": "I orginally purchased this tablet at Walmart really liked it but found it on Amazon like 2 days after I purchased for about $100.00 cheaper. Bought it here and took the other one back, very pleased with the tablet and Amazon", "Date": "October 12, 2013"}, {"Title": "Google Nexus 10 (Wi-Fi only, 32 GB)", "Author": "William Poor", "ReviewID": "R170FLR28JFYMA", "Overall": "5.0", "Content": "Love it! Fast, rather light, wonderful dislay.  Short on usefu apps in comparixon to my lenovo thinkpad tablet but suppose they figure one would go to google store to buy what they needed. All in all, very happy. Got 10 hours a couple of times on battery!", "Date": "October 6, 2013"}, {"Title": "Great tablet", "Author": "Dana Leasman", "ReviewID": "R1B6LNCV85CWZQ", "Overall": "5.0", "Content": "This is a fantastic tablet. Fast, easy to use, long battery life. Some have said that charging is slow, but I really don't think it's that bad. I have also read that it will not charge while playing a game, as it goes down faster than charging, but that is no reason not to plug it in while using it. I run it heavy for 1 to 2 days before charging over night. Android 4.3 is really nice, because you can have multiple user profiles. This is important for the kids so that they have independent saved game positions (they fight a lot about this on the DSiXL, Wii, and Nook). The rubber back makes it easy to hang on to. It is great for netflix, and even dlna streaming. I use it for too many things to list here. However, it is WiFi only, and does not have an SD slot. For this, I recommend getting the 32GB version, and signing up for things like DropBox or Google Drive (both free). For mobile internet connectivity, I just tether to my Samsung Galaxy Note 2, and use the 4G, which works really well. The Google Nexus is actually made by Samsung, so it is a good product. It does also have Bluetooth, NFC, HDMI out, and a standard micro USB charging port. There is another charging port on the bottom for a \"quick charger\". It is also compatible with several bluetooth keyboard covers, and I even use a bluetooth netbook mouse with it. It's almost like a notebook at that point. I believe this is the best tablet to date.", "Date": "September 24, 2013"}, {"Title": "Best tablet on the market!", "Author": "Vickie D. Stanton", "ReviewID": "RH0FAX0PY78CC", "Overall": "5.0", "Content": "The Google Nexus 10 32gb tablet is the best on the market by far. My wife has an iPad 2. I looked at getting that but for the 32gb (iPad 2 version) the iPad 2 was over $100 more with less screen resolution (2560x1600 vs iPad 2's 1024x768) the Nexus 10 with its huge screen resolution and its low price is a no brainer. When I received mine I immediately upgraded to Jelly Bean 4.3 and the transition was smooooooth! I've had NO problems whatsoever with this tablet. Lots and lots of Android apps available. I've got mine set up with the free Xabber (that'll do Google talk) and lots of other free apps that'll make my life super easy.Videos look superb! The added screen resolution really does make a difference.I would buy it again and wouldn't hesitate to recommend it to others.Nice not to be a slave to Apple. Apple has shown themselves to be very arrogant. Reminiscent of the 1980's! Will they ever learn???", "Date": "September 11, 2013"}, {"Title": "Hi Def, Speakers in FRONT", "Author": "Donald W. Campbell", "ReviewID": "R2XTOYRPSD0YKF", "Overall": "5.0", "Content": "Boy am I happy!  Sleek, fast,  Yep, it updated from 4.2 to 4.22 to 4.3 before I could even transfer 1/2 my games over.  Very clean and smooth design.After a month of Toshiba Excite Pro AT15LE-A32 PDA0EU-00101Y 10.1-Inch 32GB Tablet (Silver) suffering with this bloatware/ root incapable/bizarro world tablet by Toshiba, I bit the bullet and got the Nexus 10.  I even like the power-on load screen a lot better <G>.SPEAKERS in front!  The Toshiba might have had Harmon Kardon sound, but with it coming out those baby speaker ports in the rear, I could never hear it.  These speakers are positioned almost seamlessly into the edge, and don't impact the size or usability in any way.Rugged rubberized back gives a good feel and a good grip when holding the tablet.The lack of external SD mini card might be a bother, but I've yet to get any of my tablets anything close to full.  Please note that I use a camera to take pictures, and if pressed into having nothing else I use my smartphone, so there isn't a lot of need for a lot of space.  I don't do movies on the tablets either.", "Date": "September 5, 2013"}, {"Title": "It works!", "Author": "TheGuyInTheSuit", "ReviewID": "R15KQWZ61WKJT9", "Overall": "4.0", "Content": "Its a typical tablet, I have had some issues with the sleep mode. Sometimes it would freeze when I wake it up, but then restarts itself.", "Date": "August 31, 2013"}, {"Title": "perfect for my new life", "Author": "Jennifer Garcia", "ReviewID": "RB54N01IBYEAD", "Overall": "5.0", "Content": "I got a nexus 10 just a week before having my first kid. These should become a standard thing at every baby shower. I can do 90% of what I used to do on my laptop (especially after I installed the Swype keyboard) with one arm pinned under a sleeping baby I just don't want to wake.I also loaded up several TV shows to watch in the hospital and the video quality is great.", "Date": "July 10, 2013"}, {"Title": "Great tablet", "Author": "MadWycliffe", "ReviewID": "RIE2S9FX1CR04", "Overall": "5.0", "Content": "I had decided on a Nexus 10 32 GB because of the reviews and because it was clear that I could download apps from both Amazon and Google Play. Whether true or not, it appeared to me that the Kindle Fire only allowed you to download from the Amazon store. I received the Nexus 10 as a gift a few weeks ago. It had been purchased at Google Play, rather than Amazon, where I ordinarily shop. I wanted a 10\" tablet because it's a good form factor for reading magazines and watching movies. Magazines are going digital and a tablet is going to become a necessity for reading magazines sooner rather than later. I particularly wanted a tablet for the New Yorker. When I first received it, a New Yorker app wasn't available, but happily that changed within a week of my tablet's arrival. The New Yorker app is great, though it doesn't yet allow me to access the New Yorker archives. The screen is clear and sharp. The Wi-Fi is fast, at least compared to my HTC EVO phone. Netflix works great with it. It seems well put together. I like the surface of the back which provides some adhesion, so I never feel that it will slip out of my hands. As a calendar and email reader it's as good as a computer. The battery often last three days. Some people say that a 10 inch tablet is too large and heavy for holding while you read. I haven't found this to be the case, though it is a little unwieldy for carrying around. I bought the Google cover for it to protect the screen. It was easy to install and what I like best is when I open the cover the tablet wakes up and when I close the cover it goes to sleep. Although this tablet was a gift, I would buy a Nexus 10 in a second.", "Date": "June 24, 2013"}, {"Title": "Awesome tablet", "Author": "Jeremiah Malich", "ReviewID": "R2KR4731UUESGM", "Overall": "5.0", "Content": "This tablet is just amazing. It offers such a clean Android experience. The screen is just a joy to look it.", "Date": "June 1, 2013"}, {"Title": "My Nexus 10 experience.", "Author": "Raymond", "ReviewID": "R14PMM9CU8U5F8", "Overall": "3.0", "Content": "Have had the Nexus 10 for three weeks and love it. Unfortunately it died at three weeks. Returned and got refund. Will be buying another one soon.", "Date": "May 24, 2013"}, {"Title": "Great tablet", "Author": "Via-E-Z", "ReviewID": "R2MOT5RM0YA8VG", "Overall": "5.0", "Content": "I purchased the Google Nexus 10 after I did a lot of research on tablets. I am very pleased with this tablet. The price for the Nexus is higher than a lot of other brands I researched. In this case you get what you pay for. My description and experience with using this tablet matches a lot of other reviews already posted so I won't go into the discription ETC of the tablet. Just believe me when I say it is a great tablet.", "Date": "April 26, 2013"}, {"Title": "The best tablet out right now!", "Author": "Daniel G.", "ReviewID": "R3O4P4IO588Y6D", "Overall": "5.0", "Content": "The highest quality tablet display out right now. The Nexus 10 has set the bar! Fast and responsive, amazing graphical capabilities, and the latest version Android. I couldn't ask for a better tablet. At $419 with free shipping I almost feel bad...this was an absolute steal!", "Date": "April 26, 2013"}, {"Title": "Great tablet", "Author": "Andres Reyes", "ReviewID": "R2CT6AQT6NQ0KB", "Overall": "5.0", "Content": "Being my first table, it's everything i expected it to be. Really fun to use and I've had no problems so far, only good experiences", "Date": "April 26, 2013"}, {"Title": "A tablet done right", "Author": "mickey.cainn", "ReviewID": "R1TBMYFZZU7HGJ", "Overall": "5.0", "Content": "Hello. I am thoroughly happy with my Nexus. It is on par, if not better than the iPad. The panoramic camera alone was almost reason enough to buy it. The speed is fast, the colors are great, and the flash doesn't destroy the photos. Everything synced an is in perfect order. Movies, books, and music available at a touch with no restrictions on format. I even have emulators downloaded for those long and boring plane rides (Tecmo Bowl is a life saver). If you are in the market to get a tablet, try this one. Its about the same price as an iPad, but I think you'll get more freedom with this one...", "Date": "April 23, 2013"}, {"Title": "Meets expectation. crisp clear and fast", "Author": "Saeed Malik", "ReviewID": "R1SEHWBJ33M6CY", "Overall": "5.0", "Content": "Nexus 10 is a fast machine and with its resolution everything is as clear as it can be! The only thing missing is the 3G/4G, with that it would have been an ideal machine, but even without it it is a 5 star product. The battery life is great, though it does take time to fully charge it. With the normal usage it is lasting me more than a day.", "Date": "April 7, 2013"}, {"Title": "so far so good.....  May update....  August update ....", "Author": "Tom", "ReviewID": "R1LRUDKFQ3A9Z1", "Overall": "5.0", "Content": "8/24/13:I am still very pleased with this device.  Recent 4.3 update sent by Google wirelessly arrived also 2 days b4 I had expected.  With update all continues smooth.  I now have about 20 gbs loaded on this devive.  It remains smooth and responsive.  It really is the type of device that I had hoped for when buying the offbrand cheapie last year.  Thank you for this price and reliability.  I no often use with itunes or Google Play while attached to bluetooth.  Always, Very sound clear system.  Still 5 stars all around.  Thank you to this seller/vendor as well for support and very quick service.5/19/13:Review update----  all still very reliable with this nexus 10.  I'm now learning the expanse of these voice commands which I'm really liking.  Also doing more voice enabled searches and document-development too.  Very easily finds WiFi regardless of location.  Continues to be fast/responsive to both the internal apps or WiFi activities that I do.  Front side speakers are very clear and have delivered times when I've noted nice stereo distinction of speakers in playback.  I've now also purchased a portable $30 bluetooth speaker to enhance sound for room.  It had no problem finding speaker to play....  Alonso now have loaded my HP wireless printer app that also prints nicely from n10.  Still rate this 5stars....  Very satisfied...4/6/13:  This seller is outstanding!  The time it took to get here was far quicker than I had expected.  By the time I had the slip from the attempted delivery and had time to go pic up, I was indeed the one that had lengthened the delivery....  Not this seller....  Thanks to them....The unit is also working fine.  So far, so good....  I had had a very bad experience with a far inferior over priced no-name brand during mid 2012.  So far, I'm ranking this nexus 10 as NOT to be compared to the junk I bought in 2012.  All about it, especially speed, is all quite pleasing. This new voice feature through Google is amazingly accurate.....  Stay tuned as I now plan to write an update review in weeks to come.....  In view and comparison of the android related functionality/apps, etc. Of this unit...  I'm finding this very compatible to all features and functions of the ipad that i've been also using for work inpast 6 months...So far. 5 stars.....has ta later........  :-)", "Date": "April 6, 2013"}, {"Title": "VERY AMAZED BY THIS PRODUCT!", "Author": "Reese", "ReviewID": "R2M0K4BCWN7S4I", "Overall": "5.0", "Content": "Ultra responsiveVery sleek designI do however wish the memory was expandable.This tablet is very well worth the money.5/9/13 UpdateI am still completely satisfied with this tablet!! I use it everyday and it does well. I was a little hesitate about buying a refurbished product but this one does well.I do wish that Google made more official accessories for the Nexus 10. I would love to have a dock for it.Also, there is only need for a case to hold it. The glass is tough just keep a cleaning cloth near by.", "Date": "April 5, 2013"}, {"Title": "The Nexus 10 Tablet is Excellent", "Author": "William J. Stapleton", "ReviewID": "R26L8YO148O7ZE", "Overall": "5.0", "Content": "My Nexus 10 lived up to and surpassed all my expectations. I would love to have a model with 64 Gig of memory and cell service access but the 32 Gig model I bought is excellent and I use it constantly.", "Date": "April 1, 2013"}, {"Title": "Brilliant", "Author": "Jamal Samuel", "ReviewID": "RDH2DZ16PHAIC", "Overall": "5.0", "Content": "The best tablet out there I would say I like this tablet a lot because of the distinguished look. The audio on this tablet is amazing because the speakers are at the sides. The tablet runs smoothly. Ever since I bought this tablet, I rarely want to use my laptop anymore! The Android operating system is amazing however, the only drawbacks of this tablet I would say is that it does not run Flash and it does not have expandable memory but I know that you can download a file to get flash on a specific web browser so that problem is easily fixed. I recommend this product.", "Date": "March 31, 2013"}, {"Title": "Love it", "Author": "Tyler Gagnebin", "ReviewID": "R3JQKPZQISSNF3", "Overall": "5.0", "Content": "Awesome device, amazing screen.  Best bang for the buck out there IMO.  Excellent battery life too, considering the power it's got.  Enough battery to get through over 6+ hours of high def movies during a flight.", "Date": "November 13, 2013"}, {"Title": "Be A Better Person Simply By Owning This!", "Author": "Kelsarath", "ReviewID": "R1DCAZNNKZTR05", "Overall": "5.0", "Content": "This extremely sexy piece of hardware wasn't what I expected when I read the reviews and watched the videos. It's way better. Since buying this I've once again started to feel the will to live, experienced several out of body experiences that have made me wiser and spiritually stronger, made me much more attractive to the opposite sex and brought my ancestors back from the dead.All of that said the only downside was that I bought it for my wife as an anniversary gift. She loves it; bear in mind she has a cell phone that we tried to give to a mugger and we hide when walking into a tech store as everyone starts to snicker and then laugh uncontrollably.In all seriousness, it really does work well, very respononsive to touch, a beautiful screen that makes anything you're looking at much more attractive (I find this particularly handy when forced to look at pictures of myself), and front-facing speakers. For the price I don't think you can really beat the size if you're looking to use this device for things like, movies, skype, youtube and pretty much anything that you'll want to see the screen for.If you're more into apps, games that take less than five minutes and a work-horse that's around the same price I'd probably recommend the iPad 4th gen or the Nexus 7 for their utility coupled with ease of passage.", "Date": "October 6, 2013"}, {"Title": "Wonderful tablet!", "Author": "Big Burly", "ReviewID": "R3839DV71QVR6S", "Overall": "5.0", "Content": "I have 2 Google Nexus 7s, and my kids use them constantly for games, YouTube videos, and web browsing. I use it for my Kindle device. I got a surprise bonus from my boss, and thought a bigger tablet would give my 3 kids less things to fight over.The bigger 10\" tablet is easier to use for web viewing. The screen is crystal clear. We don't need it to have 3G/4G  capability, so we do not miss it.", "Date": "August 3, 2013"}, {"Title": "Best Tablet on the market for HD Video Viewing", "Author": "theinfectiousagent", "ReviewID": "RI2ADX7FDNA01", "Overall": "5.0", "Content": "The Google Nexus 10 is amazing. The display on this device is phenomenal. Processor is fast and responsive. I haven't experienced any lags or delays even when streaming 1080p MKV's to the Tablet from my media server over WiFi(5ghz).  If you plan on transferring to and watching movies on this tablet do yourself a favor and purchase an OTG USB cable as well as the Nexus Media Importer app from the Google Play store. Makes file transfer and directly playing fromm attached storage easy. To watch video through the network you'll need the BubbleUPnP App, ES File Explorer App, & I use the MX Player App with a custom codec for dts audio. Arrived on schedule and undamaged. Excellent experience overall.", "Date": "July 11, 2013"}, {"Title": "A Must Have Tablet", "Author": "Dan Learned", "ReviewID": "R3KPYWJY299BEJ", "Overall": "4.0", "Content": "If your in the market for a fast tablet, look no further. I've been playing with this thing for several days now, and haven't experienced a single lock up nor restart, other than the restart required for updating to android 4.2.2. Starts up really fast, web pages load as fast as my PC and I haven't seen any issues at all with chrome, the default browser.I purchased a case with a bluetooth keyboard, which connects easily and works just fine, but I find the on screen keyboard so responsive that I use it more. I installed all my android apps from the amazon app store, flawlessly. The Office Suite Pro is a must, at least for my uses with documents and spreadsheets.The ONLY complaint I have and the only reason I didn't give it 5 stars is the battery life. It lasts no more than 4 hours of continuous use. Of coarse it can be used while it's charging, which is fine while at home or office. Charging time from dead battery is about 4 hours.", "Date": "March 27, 2013"}, {"Title": "nexus didn't last", "Author": "kellie", "ReviewID": "R29ASUG4BCH5X2", "Overall": "3.0", "Content": "got my google nexus 10 and loved it! worked great, awesome resolution! loved the android platform like my Samsung Galaxy so easy to use same apps. The bad....had it for just over 30 days and it just died, wouldn't charge, wouldn't turn on. Lucky for me I had original packaging so I could return it to amazon, otherwise I wouldn't have been able to because I bought from 3rd party seller. Trying my luck with the Kindle fire Hd this time as I am anti Apple :)", "Date": "April 8, 2013"}, {"Title": "Not Stable", "Author": "persistentlobster", "ReviewID": "RCYZIJH2FWWXP", "Overall": "2.0", "Content": "I wanted to love this tablet so badly as I tend to love everything android. Unfortunately, the tablet is plagued by a number of major issues. It is not nearly optimized enough for the new a15 chip set. This thing should be able to handle basic computing like browsing the web and navigating the interface no problem but it clearly strugles. The standard chrome browser is a joke and the letterboxing, crashes, and slow page rendering is inexcusable. Many popular apps such as Google Drive... force close on the device. And exiting out of apps usually results in severe home screen redraw. Worst of all, THE TABLET RANDOMLY REBOOTS. Google has finally acknowledged that it is a software issue so all devices are affected until a patch is released.For a $200 device, I might be able to be more forgiving. But at $400-$500 this is simply pathetic. Do yourself a favor and look at the iPad or surface rt instead.", "Date": "March 30, 2013"}, {"Title": "Amazing!", "Author": "fadder8", "ReviewID": "RYS3WIEY9GT1", "Overall": "5.0", "Content": "I thought that being made out of polycarbonate plastics, it would be much lighter and feel cheaper that the ipad. Wrong, it has quite abit of weight to it! it feels very robust, its not trying to be an iPad, and that has done wonders for it, the camera is brilliant, the interface is the best ive seen on an android tablet, no clutter, no bloatware, its just bear and ready for action. the display is the best ive seen on any handheld device in terms of clarity. The speakers are good. Though i would like to point out that there is a very small lag sometimes, i guess thisis due to the 1.7 Ghz being dual core instead of quad, but it is the fastest android tablet out there, and i bought it over an ipad because i think its better.", "Date": "February 23, 2013"}, {"Title": "Excellent iPad Alternative...Finally", "Author": "Alex M", "ReviewID": "R15V9SNUL47NRJ", "Overall": "4.0", "Content": "The Good:-4.2.2 has fixed every issue that I've had with this tablet. A lot of the high points listed have been problems recently remedied by the new kernel update.-The screen is incredibly sharp at such a high DPI.-Thin and just light enough to comfortably hold with one hand. The plastic body feels just slightly low-rent, but it's a solid device.-2 gigs of ram that is readily used. I see very little (if any) reloading with nearly every app except for Chrome. I can, literally, play two games at once and have Google currents going with no problems.-The processor screams and things are very fast now (lag has been readily reduced for me with the new update).-Unlocked bootloader makes it very easy to install custom roms. I honestly don't feel much of a need for this now like with most android devices.-My battery life is substantially better. Something like 8 or 9 hours of screen time. I find this perfectly acceptable and really think I could eek out more if I wasn't really hounding the thing.The Bad:-Android has some growing pains. Being first for Google updates is really resolving a lot of the performance inconsistencies on Nexus devices. Phone apps scale fairly well, but in the last month I've noticed that nearly every app I use is tablet optimized. It's not close to the iOS ecosystem yet, but core functionality is there for me.-I have never had any luck with auto-brightness on this thing. I'm using an app and the camera sensor to get comfortable automatic brightness switching.-Some light leak on the display. It happens with this type of device and is a small amount in the corner that I rarely notice. While everything looks sharp, I'd prefer colors to be a bit more saturated.-Chrome is freaking terrible on android tablets. Using Chrome Beta has been a God send and it's obvious that they are working on the performance issues. Honestly, it's just shameful that they would integrate a browser that's horrendously slow, draws pages poorly, and crashes the entire OS.-USB 2.0 charging is just plain slow. Prepare to wait for it to charge overnight.-I'm not a fan of the unified UI. If you use an Android phone it's very similar and uses the navigation buttons can be a PITA (now, they are centered instead of on the corner).Conclusion: 4.2.2 has really sorted this thing out. It is phenomenally responsive and manages to eek out great battery life. Google Play is finally pushing tablet apps and the functionality of Android lets me manage my media server, files, and remote computer sessions without an issue. Very pleased now and I'm glad they took feedback to heart on the buggy performance after release.", "Date": "February 21, 2013"}, {"Title": "Love it....but", "Author": "Brian W. Caldwell", "ReviewID": "R146SPO3X5CSHS", "Overall": "5.0", "Content": "Great tablet, but Wal-Mart is selling them like hot cakes: 32gb models for 499.00.Performance is wonderful. Feels great in your hands. Too bad not all apps are suited for a tablet.", "Date": "January 1, 2013"}, {"Title": "Don't do it!!  Serious Quality Issues", "Author": "Fleas", "ReviewID": "R5RL2R5LJB25F", "Overall": "1.0", "Content": "The first Nexus was a dream for about a week; then it just died.  I returned it and was sent a replacement.  The replacement could not make it past the start menus.  The Android guy on his back with a red danger symbol should have been a clue if the factory had done the most cursory check.  I sent both back and am trying to get my money refunded.  Curiously the Nexus keeps popping up as being one of the most reliable tablets in product reviews....maybe I'm just lucky.", "Date": "March 18, 2013"}, {"Title": "First time Tablet User", "Author": "LED \"Larry\"", "ReviewID": "R1SWYGBI3N0PZ2", "Overall": "4.0", "Content": "Decided to go the Google route for my first tablet.  Like the way it works.  Battery life is good.  Do not use my laptop near as much now that I have the NEXUS.", "Date": "April 20, 2013"}, {"Title": "google nexus 10", "Author": "Amazon Customer", "ReviewID": "R3HUR68WMNPETN", "Overall": "5.0", "Content": "amazing tablet with cool design, verry fast processor  and you can find all the application you need. easy to use and also have a very sensitive scream.", "Date": "April 10, 2013"}, {"Title": "I was surprised how cool modern tablets are today", "Author": "Evgeniy Zayakin", "ReviewID": "RNRWW7CWYMSSB", "Overall": "5.0", "Content": "As experienced game developer I was sure that tablet is something useless for me, but Nexus 10 with latest android really changed my mind. Perfect or even best in the world screen, looong battery (it's alive whole day of heavy usage), and all fancy google services onboard - very impressive and usefull. Now all my communication lives inside tablet, and pc is for work only.Also android's 4.22 multiuser capability rocks - we are sharing same tablet with my girlfriend and everyone have it's own settings etc - we even using different desktop laucher application without problem, with switching in 1-2 seconds. My pc switches users for about 10-15 seconds, that's 10 times slower :-)", "Date": "March 8, 2013"}, {"Title": "Very nice tablet - WORKS Great!!!", "Author": "Bryan Geis \"Geis Audio/Video www.GAV.com\"", "ReviewID": "R2KBQAL2R6DDKW", "Overall": "5.0", "Content": "I have really been enjoying this wonderful Nexus tablet. I speed is very good, the display is so very fast and super clear.I am so very happy I did not purchase a iPad.I use it at my business at \"gav dot com\" and it is so very helpful looking up helpful information with I service eletronics. I let me check with the manufacturers that I am factory authorized service center for.Bryan", "Date": "February 14, 2013"}, {"Title": "Excellent iPAD alternative", "Author": "Amazon Customer", "ReviewID": "R351SA6H1SS99H", "Overall": "5.0", "Content": "Personally I am not a big Apple fan, but that is only because I have always been more at home with an open source type of OS. I didn't have any issues with the Nexus 10 I received. I have the JOP40D build and I am very impressed. I stream almost all my media content to my Nexus 10. I can get about 150ft farther than my wife's iPAD on WiFi. We use iTunes to manage our music and for the Nexus 10 I use the \"Play Music\" app and uploaded our entire iTunes library to the cloud. I wasn't a 100% clear on all the advantages of the many Google apps so I bought the Nexus 10 guide. It gives a lot of tips on how to use the Google applications and services. I highly recommend it too if you're new to an Android Tablet.Pros: Excellent graphics and streaming capabilities. Better streaming capabilities than my wife's iPAD 3rd generation. Very solid radio.Cons: NFC is still a long way off from being what the commercials tout. Don't use it for large file transfer. Bluetooth is way faster. Have had a very minor glitch with apps when I am trying to use a specific app, like Netflix, and at that particular time Netflix decided it wanted to install an update. Had to restart the tablet to clear the glitch. I view this more of a Jelly Bean 4.2.1 issue than a tablet issue.-Dana's Husband", "Date": "February 8, 2013"}, {"Title": "Good but limited", "Author": "Kristin P. Morrill \"km\"", "ReviewID": "R2YQY855O3M0SM", "Overall": "4.0", "Content": "I actually thought a tablet was much like a laptop/computer but it has limited functionality at best. Only good for email and web searching and maybe reading books, but doesn't accept kindle ebooks at all.", "Date": "February 3, 2013"}, {"Title": "Heart sick", "Author": "Tabbie", "ReviewID": "R32OVAUD7O8VZO", "Overall": "1.0", "Content": "I was on a waiting list for weeks to get my Nexus 10. When it finally arrived I was in heaven...beautiful screen, easy to use, just magical. Six days later it died. No power and no fixing it. Waited once again for several weeks to get a replacement. Less than 48 hours after getting it, it too had problems. Almost 2 months after purchasing my first Nexus 10 I received my refund and purchased something else. Loved the Nexus 10 just wished it would have worked.", "Date": "February 1, 2013"}, {"Title": "It's pretty good, except for the battery time...", "Author": "Dom P", "ReviewID": "R3ISG86Q23B9RU", "Overall": "4.0", "Content": "I did a lot of research before I bought my Nexus 10, and it hasn't disappointed except for one thing...the battery life is ridiculously low.  I should be able to get at least ten hours for playing apps and regular browsing but it doesn't come close, very disappointed!!", "Date": "June 4, 2014"}, {"Title": "purchsed for my son", "Author": "Coi", "ReviewID": "R115RMKIU1JT3Q", "Overall": "5.0", "Content": "i purchased this for my adult son.  he really likes it and has been using it for quite a while now.", "Date": "June 3, 2014"}, {"Title": "I love Google Nexus 10", "Author": "Gloria Cuberos", "ReviewID": "R3ENFQQSUGJMGF", "Overall": "5.0", "Content": "It provides for everything I have to access and use for work and for entertainment in one piece. It's easy to carry and it's sincronization with my Samsung smartphone allows me for flexibility and time optimization. Sharing the Android OS with the smartphone makes my life easy and I use either of them according to the specific need I have at hand. I am still trying to deal of projecting to VGA screens as converters are not easily found.", "Date": "June 1, 2014"}, {"Title": "upgrade from Asus TF300", "Author": "Jason J. Dacosta \"jdac\"", "ReviewID": "R2YORE5L1JQ7S3", "Overall": "5.0", "Content": "In terms of hardware, the TF300 and the Nexus 10 are basically the same. Some exceptions:- Nexus has a better display- Nexus has better speakers- Asus has slightly longer battery life- Asus charges fasterBeyond that, the difference is Kit Kat, and it makes all the difference in the world. The device is fast, there are very few bugs (so far), and I'm very happy with it. The OS seems very stable and the hardware seems reliable as well. The only complaint I have is that it takes a long time to charge.", "Date": "June 1, 2014"}, {"Title": "i'd buy something else now; give them time to fix problems", "Author": "BuyerOfStuff", "ReviewID": "R1IKNRFZHFA3FA", "Overall": "2.0", "Content": "So we dove in and bought the nex 10- it's now 7 months old and I really DID like it until we started have those charging problems that i'd read about but ignored.Problem starts off when after a night of charging, surprise it's not charge. Then some days it charges overnight, others, nope. Last three days, not doing a thing. It's sitting on the shelf right now charging, has the charge icon going and everything, but will it charge today?Hmm I wonder. Apparently you can only run the Nexus off battery so no way can you just plug it in.So it's become 3-400 bucks worth of  worthlessness.  Yes it has the best screen out there but all that flash is horsedoo if you can't see it. I would at this point in my experience buy another tablet brand and give google time to either fix it or get out of the tablet market. I can see why google did NOT offer a one yr warranty, why create problems for yourself.Final notes: I really love amazon - they said to go ahead an return it. This is why I shop amazon, they've got your back.", "Date": "June 1, 2014"}, {"Title": "nice tablet after all", "Author": "Hong Ting Law", "ReviewID": "R35WMQ8SGMQBAE", "Overall": "5.0", "Content": "pretty good tablet, I really love it. It is really worth to buy, it is a fast and good quality tablet.", "Date": "May 31, 2014"}, {"Title": "Nexus 10 great !!1", "Author": "Marzzz", "ReviewID": "R3IH7RO3CNMAA4", "Overall": "5.0", "Content": "I love my Nexus 10,delivery time was good, it works like a charm. the speakers are loud, the display is awesome resolution is epic, i love how it feels in my hand. Its worth every penny.I would recommend this tablet 100 times over", "Date": "May 30, 2014"}, {"Title": "Amazing Tablet!", "Author": "Lisa Gadomski", "ReviewID": "R1VCZ3X6PKDJQ", "Overall": "5.0", "Content": "I am a teacher and a mother of three.  I use iPad's in my classroom and have been satisfied, but for my personal tablet I went with this one.  I am very satisfied and I love that we can have different users with all different apps.  I have personalized it for my 9 year old and my 5 year old.  I also have a Samsung smartphone and so many things are linked.  It just makes it nice all around.", "Date": "May 29, 2014"}, {"Title": "Nice", "Author": "K_L", "ReviewID": "R3UTKFCX8S3ZWP", "Overall": "5.0", "Content": "Bought and gave two of these as Christmas gifts several months ago.  They arrived very quickly, undamaged.  They are still running and both recipients are happy with them.Maybe someday I can afford one for myself.", "Date": "May 28, 2014"}, {"Title": "nothing to brag about", "Author": "Amazon Customer", "ReviewID": "R3GIPJVKQ8YCGX", "Overall": "3.0", "Content": "I am currently using this since November and I had a few minor issues like having to force shut off if it freezes or it sometimes shuts itself off, but I usually get all my windows restores. For the price, I am disappointed and I expected more from Google. Also no flash player and you can't even add it or anything, that sucks and I didn't know it before I bought it. Half the things you might try to watch won't work. Its nothing special, instead of spending $400 I should have paid half for a basic tablet with flash player!", "Date": "May 22, 2014"}, {"Title": "Great tablet, but takes a lot to charge", "Author": "Enrique Ocaña González", "ReviewID": "R135EXQERP0UX2", "Overall": "4.0", "Content": "The tablet is really cool: big screen, very high resolution, large storage, good speakers, lightweight, slim, having the latest Android version and all the software support from Google. However, after having used it for almost a month, I also realized about the negative aspects: The battery takes a lot to charge when the tablet is on (large battery, low power adapter), the rubber finish seems prone to scratches (the tablet asks for a protective case) and the CPU seems not to be powerful enough to move non-GPU accelerated graphics smoothly (too much resolution).I would recommend this tablet to anybody wanting it to watch movies or reading ebooks and PDFs on a big screen, almost at \"physical paper size\". Those are my use cases and the product fits nice for them.", "Date": "May 20, 2014"}, {"Title": "Does what I need it to do.", "Author": "Pascal", "ReviewID": "R1QIGJH2JWPPTB", "Overall": "4.0", "Content": "This was a great deal from this vendor.  I am not an avid player or heavy media consumer so I can't comment on the tablet's power.  It's quite easy to use and there is plenty of information online to help me make the most of it.  One of the challenges I had was to upload the media (pics and videos) to iPhoto on my Mac.The only problem I've had is with the camera which freezes at times.  That's been quite annoying at times but I've learned not to mess around too much when I know I'll need to use it.", "Date": "May 20, 2014"}, {"Title": "Google Nexus 10", "Author": "Peggy L. Harrington", "ReviewID": "R35KNM0RS5FQKU", "Overall": "5.0", "Content": "After spending money on an off brand 7 inch, then 10 inch, I knew it was time to purchase a tablet that is comparable to Apple's iPads, and this Nexus 10 does it.  I love it's battery capacity, it's light weight, it doesn't turn off in the middle of my app games, and best of all, I got it for a steal on Amazon.com.  Even though my nephew advised me that I have an older version b/c technology is ever changing, I love my Google Nexus 10 and would recommend it.", "Date": "May 19, 2014"}, {"Title": "Nice tablet", "Author": "KRST", "ReviewID": "R1YACXBJRFYCIZ", "Overall": "4.0", "Content": "I've only been using this table for a couple of weeks and still need to get familiar with all its functions.  So far I'm very happy with it.  I'm giving it only 4 star since the box and user guide for the table were in French!  Thankfully there's a user guide right on the home page of the tablet itself!", "Date": "May 19, 2014"}, {"Title": "Not exactly what I had hoped", "Author": "M. Denning", "ReviewID": "R3795BD3PMJW5W", "Overall": "2.0", "Content": "After using an iPad for several years I decided to try an Android tablet to go along with my HTC phone. In general I like the Nexus 10 and the layout, speed, and resolution but from the beginning had trouble with battery life. Just recently, after two months of light use it died on me. I have been unable to get any assistance from Samsung, the mfr, on the warranty repair...they seem completely inept and unresponsive. I have now been waiting a week to get a repair authorization notice as they say they are having to contact Samsung Korea regarding the serial number.  Based on discussions to date, I am not feeling confident that it will get worked out anytime soon. I am hoping it is attributable to dumb customer service reps and will ultimately get settled. Probably will stick with Apple going forward, as much as I would like to give others a try.", "Date": "May 17, 2014"}, {"Title": "Just what was needed", "Author": "Stuart A.", "ReviewID": "R2OKZLLC3RQT71", "Overall": "5.0", "Content": "Dad had his voicebox removed so we needed a way for him to communicate.  Found an app to let him type and have it read out loud, now if we could just get Mom to pay attention to what he is saying.  Got a good price on a great tablet.  He is learning (slowly) to use this for other purposes.  Set up Google Voice just for the texting since having a phone isn't meaningful without a voice.", "Date": "May 16, 2014"}, {"Title": "Works fine, but erratic", "Author": "David B. Prickett", "ReviewID": "R30Z1DGIX1KUM0", "Overall": "3.0", "Content": "Sees to have stability problems - it's spontaneously  rebooted several times in the few weeks that I've had it.  Aother thing that I've noticed is that the auto-brightness feature creates jarring changes in the brightness level - a bit bothersome.Otherwise, it's reasonably fast, the controls are responsive, and it boots reasonably quickly.  And the speakers are good for a mobile device.", "Date": "May 14, 2014"}, {"Title": "Great concepts and lousy glitches", "Author": "Todd Phipps", "ReviewID": "R1BEXD7GWZ5VK5", "Overall": "2.0", "Content": "I returned the item after two weeks. It kept crashing when trying to upload new software and was unusable. Also there were no local sources of support to get ideas on work arounds. I loved the size and the ease of use. I will probably order a Samsung 10.1 tab when and if I can get support for it. I would get the Nexus 7, which has same features without the glitches, except I want larger screen size.", "Date": "May 14, 2014"}, {"Title": "I love it", "Author": "B. Henrie", "ReviewID": "R2GQV4VKSYPWSZ", "Overall": "5.0", "Content": "This is the easiest review to give. I get enjoyment out of the nexus everyday. Does everything that my big desktop does with ease. I can even watch netflix on the TV. The only negative is the screen on brightest setting will drain the battery fast, but turn the brightness down and I can use the nexus all day, and even turned down the screen is bright enough. a great investment.", "Date": "May 13, 2014"}, {"Title": "Love.", "Author": "Amazon Customer", "ReviewID": "R2M63JPEHVM52J", "Overall": "5.0", "Content": "Love this tablet.  Does everything I want it to, great size, exactly what I needed.  Only complaint is the battery drains really fast.  I've tried adjusting the settings but nothing really works.  It is also slow to charge unless you use a 2.0 cable and 2.1 watt charger.  Other than that, no complaints.  I am very clumsy and have dropped it a million times and it is fine.  I personally think this is the best tablet out there -- very fast, lots of storage.", "Date": "May 12, 2014"}, {"Title": "best of the best!", "Author": "Thomas", "ReviewID": "R2P9HB3QQ2HNDT", "Overall": "4.0", "Content": "This tablet is the best! Amazing clarity, superb speed and simplicity of this tablets inputs are the best. Five star rating!!", "Date": "May 11, 2014"}, {"Title": "Problems within a week!", "Author": "Angelique Tasker", "ReviewID": "R3N9GI4F97OVE1", "Overall": "2.0", "Content": "Have had problems with not wanting to connect to our wifi (wifi says its connected) tablet wont read the wifi! Also it freezes up and has been powering itself off and resetting itself in the middle of use! Returning ASAP! Hoping to get a replacement but if problems persist will be going to a different company!", "Date": "May 5, 2014"}, {"Title": "My Nexus 10 has locked up", "Author": "C. Hughes", "ReviewID": "R3R1UN6O98FZY3", "Overall": "4.0", "Content": "UPDATE,,, My Nexus 10 is back... I let the battery run down.  This morning I put it on the charger and after a few minutes it was up and running with the charger in place.I bought mine in January 2013 and have enjoyed it very much.It has locked up and I can not get it unlocked no matter what I try.Does anyone know how to get my Tablet unlocked ?", "Date": "May 5, 2014"}, {"Title": "fast with excellent video quality", "Author": "Edgar", "ReviewID": "RIDVQZOP89BGN", "Overall": "4.0", "Content": "Very good video qualityFastDidn't like it doesn't micro SD card optionBad takes years to charge the battery", "Date": "May 1, 2014"}, {"Title": "Google nexus 10", "Author": "Margaret Mather", "ReviewID": "R1XINUZ6FHI6ZK", "Overall": "4.0", "Content": "I love it.  Had the smaller one and decided to upgrade.  Its the perfect size. I got a great deal on it and it WaS shipped fast.", "Date": "May 1, 2014"}, {"Title": "A+++++++++++", "Author": "franck huyghe", "ReviewID": "R1JIESL8JOUWUD", "Overall": "5.0", "Content": "really happy with my new tablet, great device to write your recipe on the fly, uses it everyday and never faulter, great and sturdy!!", "Date": "April 30, 2014"}, {"Title": "Perfect tablet", "Author": "Juanita C. Suggs", "ReviewID": "R39WOUQIJ027LI", "Overall": "5.0", "Content": "I contemplated several 10 inch tablets before purchasing the Google Nexus 10.  My research proved that this was the tablet for me.Received the tablet earlier than anticipated and just love, love, love it.  Quite easy to use and I was able to do \"set up\" with ease.  Very smooth transaction through Amazon.", "Date": "April 28, 2014"}, {"Title": "Just Love My Nexus 10!  Great addition to my tech products", "Author": "Jane Paul", "ReviewID": "R1J3LZSJQ6ANPM", "Overall": "5.0", "Content": "Awesome!  Still trying to learn how to use it, but that's my \"problem!\" Would recommend product for those that don't want an Ipad.", "Date": "April 25, 2014"}, {"Title": "Very happy", "Author": "Rob Hector", "ReviewID": "RJ0IVJEO9GVL6", "Overall": "5.0", "Content": "I researched tablets for a long time before bying this one.  I am so happy with it I purchased another for my wife.  She also loves it.", "Date": "April 24, 2014"}, {"Title": "nice!", "Author": "ashley", "ReviewID": "R2HKY8FZGXHDVB", "Overall": "5.0", "Content": "Awesome product. Love it! I am a big fan of android and Google. Nice size screan and picture. Can't go wrong here.", "Date": "April 23, 2014"}, {"Title": "My Nexus Google 10 tablet", "Author": "Ami Angelin", "ReviewID": "R36W5Y35PQ1SSU", "Overall": "5.0", "Content": "I will be spending several months away from home and wanted a source for reading, gmail, shopping, everything.I can put my tablet into my purse and just go.  My husband loves it as well.  I did a lot of research before buying this particular tablet and finally chose this one after reading in PC Magazine that Google Nexus 10 that it was their choice.We are more than pleased.", "Date": "April 22, 2014"}, {"Title": "So far so good", "Author": "TxKingFish420", "ReviewID": "R32BMCHFD5VTWQ", "Overall": "4.0", "Content": "Received this as Christmas gift from the kids. Was very impressed with the speed and video quality. After about a week, it locked up and would not turn on or charge.  Had problems trying to identify the serial number(more on that later). Eventually was sent down to the Samsung store were they replaced the motherboard. When I got it back, it worked for about a week before it started rebooting  intermittently. I just received a new one with hopes that all my problems are behind me. As far as the serial number issue, it seems this unit was an international one that was never registered with Samsung (which sounds sketchy to me, but whatever).Pros-FastVivid graphicsFront speakersCamera not badBattery life is goodCon-Takes long time to charge battery", "Date": "April 21, 2014"}, {"Title": "I own both the Nexus and Ipad", "Author": "Marcus Lamb", "ReviewID": "RE5D6S88PPZ6", "Overall": "5.0", "Content": "So have have both a Nexus and ipad and I have since given my ipad to my wife and my two year old.  I use my device mainly for reading my college textbooks but also for playing games and occasionally surfing the web.  The screen size and display is much better suited for text books.  Also I like the cheaper apps on the android market place.  There are some things the the ipad has over the android device but that is mostly just because some developers make it that way.  Of course there are plenty of things the android has over the ipad.  My main concern when I bought the Nexus was the battery life.  I loved the battery life on the ipad and was worried that the Nexus would be sub par.  It is really not the issue that I thought it would be; in fact if I didn't know the specs I wouldn't be aware of the difference in a day to day real world but I am not too detailed orientated.  I can read my assignments and if I skip a day in the charger (even two) I can still do what I need to do.  I would more than accept a slight performance hit for a much better reading display anyway.  Not much more of a hit though, I draw the line here and no further.  I am speaking to you Google and Apple; now play nice.", "Date": "April 20, 2014"}, {"Title": "I like it", "Author": "Amazon Customer", "ReviewID": "R1BTRLMZCYHLU2", "Overall": "5.0", "Content": "Awesome. Cannot use amazon prime on it though? Battery life is pretty okay. Very happy with so far.  Blah blah.", "Date": "April 20, 2014"}, {"Title": "Wow! This tablet is the bomb!", "Author": "Ken Hopson \"kwhopson\"", "ReviewID": "R3D7QYV5OAX0MW", "Overall": "5.0", "Content": "I don't care for the oh-so-proprietary iPads, and have a Galaxy S3 phone, so it only made sense to get an Android. I opted for the Nexus to avoid bloatware, and it has been a delightful experience. No problems at all, playing games, streaming movies, surfing online, and actually getting work done. I was able to update it to the latest version of KitKat first thing.I should mention, the vendor I purchased this from sent me an international model (Euro plug, French manual, etc.) so I was unable to register the product. When I wrote a seller review, Amazon took it down, claiming it was a product review, even though it wasn't.  So watch out who you buy one from.", "Date": "April 16, 2014"}, {"Title": "Great Tablet", "Author": "Juggles", "ReviewID": "R1IVY8W079AQB2", "Overall": "5.0", "Content": "I've tried several tablets in my quest to find one that works for me (Thanks, Amazon's return policy!) The Nexus 10 is the best tablet I've tried. I had the Nexus 7 (2013) and I absolutely loved it, but it was too small for my needs. I've used an iPad and a Windows tablet, neither one was as good as the Nexus 10. If you like android, and you want a full tablet, this is the one to go for.", "Date": "April 16, 2014"}, {"Title": "I love it!!", "Author": "Europe", "ReviewID": "R5RYA8AVJQDCS", "Overall": "5.0", "Content": "What a great buy, I'm really loving this! It is fast, snappy, sound is good. I read on it, watch movies and play the occasional game on it.I don't take pictures with it because I have a better quality camera on my phone (also an Android, so I can share apps) and it is a lot less clunky to take pictures with. I would say the camera is more useful for something like Skype. But that is just my opinion.The exterior is nice, it is not too heavy and it looks good.All in all super happy with my purchase!", "Date": "April 15, 2014"}, {"Title": "great tablet", "Author": "Sean", "ReviewID": "R2XY99G3TF15PR", "Overall": "5.0", "Content": "arrived on time and works really well. great for any family.would highly recommend it anyone whose looking for a better tablet than an ipad for about half or a quarter the price.", "Date": "April 14, 2014"}, {"Title": "Perfect Gift", "Author": "Sophia Minhas", "ReviewID": "R3K3T9SONFTFX7", "Overall": "5.0", "Content": "I love my Tablet. Its way better than a windows tablet. My tablet boots up in 20 seconds Compare to windows tablet boots up take 15 minutes. It weights perfect for traveling.", "Date": "April 13, 2014"}, {"Title": "Excellent tablet", "Author": "Edward Hill", "ReviewID": "RJAHTCYXVB8QV", "Overall": "5.0", "Content": "Excellent tablet , I would  recommend it to  someone else. It is everything that I expected and more. The cost is better than any other I could find for the same tablet.", "Date": "April 13, 2014"}, {"Title": "Can't put it down! Amazing tablet & beautiful screen", "Author": "Shifu", "ReviewID": "R2SX0MDYJB0XSE", "Overall": "5.0", "Content": "This is my first tablet, and I expect it to stay with me for a very long time. It has so many amazing features (front-facing speakers, incredible resolution, built-in webcam, ability to create guest profiles, etc.), but I use it mainly for Netflix, web-browsing, and reading e-books. Super functional, I'm very impressed!", "Date": "April 11, 2014"}, {"Title": "The Nexus came and is much appreciated.", "Author": "Betty Lyons", "ReviewID": "R2BBVOBHG636EJ", "Overall": "5.0", "Content": "This is a new experience for us.  It will take some time to learn all the uses that it is capable of doing.", "Date": "April 11, 2014"}, {"Title": "very good", "Author": "Gary P. Soltner", "ReviewID": "R1RAIUH0C6MF4N", "Overall": "4.0", "Content": "Nice having an up to date tablet that runs fast, plays great videos. Light weight, glass doesn't seem to show fingerprints as much. Love it.", "Date": "April 11, 2014"}, {"Title": "nice tablet", "Author": "Kco", "ReviewID": "R2Z5LDXUAWN897", "Overall": "4.0", "Content": "this is a very nice tablet.but battery drain quickly.i used ipad adapter to charge this unit because the stock adapter charger take forever to charge.i think that is the only negative i can say.", "Date": "April 9, 2014"}, {"Title": "Nexus 10 Tablet", "Author": "T Rich", "ReviewID": "R11NV8ITS7DHMX", "Overall": "5.0", "Content": "Excellent performance!!!iPad killer!!Screen resolution magnificent! Would definitely recommend this to anyone wanting to purchase a high quality Android device.", "Date": "April 9, 2014"}, {"Title": "Best tab", "Author": "Omprakash Gurubaxani", "ReviewID": "R3RCDV3JVZMR9R", "Overall": "5.0", "Content": "Everything is perfect especially the screen resolution and sound quality.Nice build, little heavy as its 10 inch. Great buy at great price.", "Date": "April 7, 2014"}, {"Title": "Awesome device!", "Author": "Dave", "ReviewID": "RO0B6Z7HY2AOW", "Overall": "5.0", "Content": "This is a great device. I entered the smartphone world as an Android user, so when it came time to select a tablet, I chose this one over the iPad. I have not regretted the decision! This tablet is fast, holds a charge for a long time, and looks great.WiFi has been a little bit of an issue at times, but this has not prevented me from thoroughly enjoying the Nexus 10!", "Date": "April 4, 2014"}, {"Title": "best tablet so far", "Author": "Murat Ozkan", "ReviewID": "R19KU0ZS5826IH", "Overall": "5.0", "Content": "Yes the price is higher than the similar tablets but if you want the best you have to pay the extra.", "Date": "March 28, 2014"}, {"Title": "Great tablet", "Author": "LS Karger \"LSK\"", "ReviewID": "R2G3WNVI330D9I", "Overall": "5.0", "Content": "Bought for husband for bday. It's the right size for portable.  I use the Kindle to read books at the gym. Or you can use Nook.  Love this tablet. Purchased:  August 2013.", "Date": "March 24, 2014"}, {"Title": "Just terrific!", "Author": "Wallace M.", "ReviewID": "R2XK92SOTT7HCG", "Overall": "5.0", "Content": "A great tablet. Powerful, fast, great looking, the pinnacle of tablets. Should be to tier for some time. I highly recommend it.", "Date": "March 23, 2014"}, {"Title": "Love it, except for one detail", "Author": "Alexander Levy", "ReviewID": "R10Z4GUV6D9KNL", "Overall": "4.0", "Content": "Totally enjoy this tablet.  Have not yet succeeded in getting the Blue Tooth to work, but as I don't really need it, I'm willing to overlook that.", "Date": "March 18, 2014"}, {"Title": "Great tablet", "Author": "Jeremy", "ReviewID": "R36O4IQNRM20QU", "Overall": "4.0", "Content": "All of my devices are Android and I wanted to keep it that way for simplicity's sake. This device is a great workhorse and does what's thrown at it.Pros:Looks WONDERFUL.Decent battery life for a tablet this size with this processing power in it.Has no issues with any apps or games. No lag or delay from needing more processing power or RAM.Uses Micro USB to charge. No need to get an entirely different set of cables for charging at the office, in the car, at home, etc. Just use same as your phone.Cons:Sometimes seems to be slight issues with multiple apps using bandwidth as if there is a bandwidth cap on the device itself. Not sure if this is a App issue or hardware.Occasionally I'll get a random reboot of the device with no warnings. This will occur every few days. Not sure if it is hardware or App related.My hand will often cover the lens responsible for adjusting the backlight brightness causing the screen to be very dim. Could have been placed better.When listening to music (or anything else) while charging you can hear a slight background hum/crackling. Distracting.I would recommend this device to others and am happy with my purchase.", "Date": "March 17, 2014"}, {"Title": "love it", "Author": "donald allen mclendon", "ReviewID": "R3GSGZVCQ5YXJF", "Overall": "5.0", "Content": "Software updates is my thing, Nexus says it all......It just going to get better.... having a split screen would be cool .....hoping a software update can do that....most part  it's future proof no android device I ever had was ever currently running the latest OS.....Worth the money ....great screen is fast ....light weight I take it everywhere", "Date": "March 16, 2014"}, {"Title": "Best Tablet Hands Down in my opinion", "Author": "Isaac", "ReviewID": "RVRFWSV5FCURP", "Overall": "5.0", "Content": "Build, Style, Specs, Resolution, Speed, All get 10/10 in my book. No complaints over here size is excellent, sleek and slim i am very very very very pleased with it.", "Date": "March 14, 2014"}, {"Title": "Works well. Shipment and purchase went well", "Author": "Joachim Rupp", "ReviewID": "R21BUK48KRCBRW", "Overall": "5.0", "Content": "Works well. Shipment and purchase went well and in time.My wife and I are happy with the Nexus and to me it was the right decision over an iPad and getting locked into Apple.", "Date": "March 14, 2014"}, {"Title": "Meets my requirement.", "Author": "Jose A. Campos", "ReviewID": "R13H95O4V2JGMK", "Overall": "5.0", "Content": "I like it. It is perfect for my purpose. No complaint, yet, about this product. Good resolution. Very fast. Very easy to use it.", "Date": "March 14, 2014"}, {"Title": "Great screen, fast well built but charges very slowly", "Author": "Charles Carver", "ReviewID": "R2MZYQFHZNVKE4", "Overall": "5.0", "Content": "Another great device contracted by Google, only wish it had an SD slot. Battery life is not bad but charging takes 4 to 5 hours from near dead.", "Date": "March 13, 2014"}, {"Title": "Great tablet for the $$", "Author": "Patrick", "ReviewID": "R2WCDN0EDLKQYG", "Overall": "5.0", "Content": "This tablet was released Nov 2012.  I just purchased this in Feb 2014 after testing out the Asus Transformer Infinity and Samsung NotePro 12.2.  This tablet is either equally good or better than both of those.  The only thing this tablet is missing is a multi-window function, hopefully to come in a future OS update.  Great resolution, snappy response time, immediate updates for the OS, great build materials and the front facing speakers are fantastic.  I was a little hesitant with purchasing 1.5 year old hardware, but after 2 days with it, my mind was made up.  Great tablet.", "Date": "March 13, 2014"}, {"Title": "Great tablet", "Author": "Ryan J. Stevens", "ReviewID": "R26A0X2U6TNJF2", "Overall": "4.0", "Content": "The rubber backing gives a good grip.  The screen looks great.I am disappointed with Amazon because on the box there is a sticker that say's don't accept if broken; this was already cut and the charger had the plastic removed before. This tablet was listed as new but my box showed different signs. I left feedback to Amazon with no response. This would have been 5 stars otherwise.", "Date": "March 12, 2014"}, {"Title": "Great tablet...terrible customer service", "Author": "Ch@rloman", "ReviewID": "R1RJ5CTHXS1ZG0", "Overall": "3.0", "Content": "The Nexus 10 is a great tablet for those looking for a cheaper,  iPad alternative. Unfortunately, the one I got had a problem. During the initial setup, after I input my Gmail account, I was not able to connect to the Internet. I got the message 'can't establish a reliable data connection to sever'. Couldn't understand why I was having this issue with a brand new tablet. After speaking with Amazon customer service, who were great by the way, they told me to contact Google. Google pointed me to their self help website because apparently they do not provide live tech support. Unbelievable! So I was on my own. The site wasn't much help so I had no choice but to return the tablet. I'll take that into consideration before I buy another Google device.", "Date": "March 11, 2014"}, {"Title": "Awesome Nexus!! but missing big USB port and SIM option", "Author": "Digvijay Rai", "ReviewID": "R3QCHN88P7LC33", "Overall": "4.0", "Content": "Awesome Nexus!! but missing big USB port and SIM option.Otherwise it's very good and easy to use.Sometimes I badly miss the big USB port to data transfer.", "Date": "March 10, 2014"}, {"Title": "Great screen.  Should have a port for an SD Card.", "Author": "B. Kripkee", "ReviewID": "R2LTRBGSINGAEO", "Overall": "4.0", "Content": "The screen is bright with excellent resolution.  The processor seems fast.  Easily connects to WiFi.  It should have a port for an SD Card -- I consider the lack of such a port a design flaw.  I bought this tablet intending to create a portable television using the Hauppauge Broadway HD TV Tuner.  It worked, but the picture cut our every few minutes, so I returned it.  The built-in Google Chrome browser wouldn't display the TV picture full screen.  However, I was able to get a full screen using the UC Browser which I downloaded from the Android Apps site.", "Date": "March 10, 2014"}, {"Title": "like it but wish I could stream amazon instant movies", "Author": "tlc", "ReviewID": "RZIBNTED4QWFE", "Overall": "4.0", "Content": "It didn't come with a users guide (that was in English) also didn't come with a US wall charger. I had to buy one. This is my first tablet and android device as I'm trying to break free from the shackles of Apple.", "Date": "March 10, 2014"}, {"Title": "Tablet", "Author": "Madge", "ReviewID": "R2JA0DRVBFEXNX", "Overall": "5.0", "Content": "I had an off brand and there is such a  big difference from it. I play games, watch movies, and listen to books on it.", "Date": "February 21, 2014"}, {"Title": "Perfect size, great performance, excellent quality!", "Author": "Cameron Hayes", "ReviewID": "R1M700MJMIU3ML", "Overall": "5.0", "Content": "The Nexus 10 is the exact size my wife wanted to read all of her books, watch DVDs on road trips, and perform tasks.  Highly recommended!  Thank you!", "Date": "February 20, 2014"}, {"Title": "Wow!", "Author": "Evan Behringer", "ReviewID": "R30E7S88RVBVXU", "Overall": "5.0", "Content": "This is the first tablet I have ever owned - I'm glad I made this choice! It works great for when you would like to have a laptop on-the-go that isn't nearly as large, bulky or heavy, but does all the same stuff. It does everything I use my laptop for (music, videos, internet, games, banking) and even more!I'm absolutely floored by the definition of streaming videos (Netflix or Hulu Plus), and it takes less than 20 seconds to boot up. It doesn't ever slow down or become sluggish from too much bandwidth, and the battery lasts for several days at a time!Only TWO complaints:- Amex Mobile is incompatible with this tablet :( Still, if you have other devices you can use it on, this isn't a big problem- No SD/flash drive (despite being advertised that there was one), so now I have a 32 GB SD card that I can't use with thisAside from that, this was an excellent purchase, and if you're looking for a mini-computer to do all your everyday computer activities, I would strongly recommend the Google Nexus 10.", "Date": "February 20, 2014"}, {"Title": "Great tablet", "Author": "Joan Joppie", "ReviewID": "R2SM2ZT396GSV8", "Overall": "5.0", "Content": "I am really enjoying my tablet.  No problems at all.  I use it at craft shows to take Square payments.  Very useful.", "Date": "February 19, 2014"}, {"Title": "Better than I'd hoped.", "Author": "Christopher Fuqua", "ReviewID": "R3BK5G7N7GX9S", "Overall": "5.0", "Content": "As a hard-core Pc user I was hesitant to give up my full size laptop for a tablet. The nexus took a while to get used to but after a month my use of my laptop was so minimal that I eventually put it on the shelf except for writing papers. Has some small software idiosyncrasies. Can be frustrating for those who aren't technologically prone. Still on the whole I'm very happy.", "Date": "February 15, 2014"}, {"Title": "I'm Happy", "Author": "Mike \"I'm Scoats but Amazon won't let me call...", "ReviewID": "R359K1ORK65O1G", "Overall": "4.0", "Content": "My previous Android table, an Acer e500 kacked after just under 2 years of ownership. I didn't really over-research before selecting the Nexus 10. So I was a bit disappointed when I got it and realized there was no way to add extra memory by either mini-SD card or by attaching a USB thumb drive. But that hasn't really been an issue. I have been able to put enough music and ebooks on there with the 32G memory. The lack of ports is why I gave this 4 stars instead of 5.There is only one port, a mini-USB. On the plus side, this is the same size my phone uses, as does the bluetooth keyboard/case my wonderful wife bought me. So one cord charges all my devices.Battery life is great. Though it does seem to take a longer time than expected time to recharge.Once I got used to the current version of Android, it was easy to add/remove apps from the home screens.Processing is pretty snappy.I've had it a month and today was the first day I really got around to getting all the apps and everything else organized. It's a sweet machine that is an amazing lifestyle device. That sounds like a really douchey thing to write, but it is a lightweight but nice sized device runs all of my daily use Google apps well (mail, calendar, drive) and Chromecast is pretty nifty for TV watching.", "Date": "February 9, 2014"}, {"Title": "great tablet and great price", "Author": "Mary C. Galloway \"chem123\"", "ReviewID": "R22IJKJ88KG1PF", "Overall": "5.0", "Content": "This tablet has been great for my high school son to take to school for using in class. Durable, good graphics, plenty of apps available.", "Date": "February 6, 2014"}, {"Title": "The unit works perfectly.", "Author": "Richard S. Basset", "ReviewID": "R21K80GLPWJQZU", "Overall": "4.0", "Content": "There is one drawback however and it has to do with the screen illumination process. It will dim on you at the most opportune time thus interrupting your processes.", "Date": "February 6, 2014"}, {"Title": "Just like new", "Author": "64dodger", "ReviewID": "R3Q3MIDTEUC8QV", "Overall": "5.0", "Content": "Purchased from Warehouse Deals. All new packaging and the unit looked brand new. Great tablet easy to use. Light years better than my old Xoom.", "Date": "February 2, 2014"}, {"Title": "Bought this as a damaged box from the warehouse. Works Great.", "Author": "photorooster \"photorooster\"", "ReviewID": "R1GFMGBEVXSTT3", "Overall": "5.0", "Content": "I have made many fine discounted purchases on Amazon via warehouse deals and this was one of them.  To date none of my gear has ever needed repair or has failed me and works just like new.  Performance is comparable to the nexus 7 2012 edition. Extremely fast.  If you need speed without having the latest and greatest this is the tablet for you.  Just buy it before you cannot find them anymore,", "Date": "January 27, 2014"}, {"Title": "Great Product", "Author": "enrique castellanos", "ReviewID": "R1NGPWKWLU3JL7", "Overall": "4.0", "Content": "Met most of expectation, price, would recomended to friends and family The Nexus was recomended by a family member. Thank you", "Date": "January 18, 2014"}, {"Title": "wow", "Author": "Peter Reyes", "ReviewID": "RTER56S50G8X5", "Overall": "5.0", "Content": "This product is great I like how it  looks and feel it's fast and Google  brand products keeps up with their firmware updates.", "Date": "January 11, 2014"}, {"Title": "Love Nexus 10", "Author": "Kindle Customer", "ReviewID": "R1CWHO21XAGVA8", "Overall": "5.0", "Content": "I bought this for my husband for Christmas he loves it!! It is fast uploading and downloading, beautiful pictures just excellant in everyway. Very happy with my purchase! :-)", "Date": "January 11, 2014"}, {"Title": "So far...Great!", "Author": "Billiam", "ReviewID": "R1AXE8AUSI74TM", "Overall": "5.0", "Content": "I just bought this after much consideration. There are many tablets out there of varying prices and I wanted one that would be reliable, fast, and have a great screen....and no regrets here.", "Date": "January 10, 2014"}, {"Title": "Good so far but...", "Author": "Blaire Blesch", "ReviewID": "R3L8BX2TYK1FTT", "Overall": "3.0", "Content": "I bought this tablet for my mom as a Christmas gift. At first, it was fine, loading it and whatnot, but whenever we tried to do basically ANYTHING it wouldn't let us. It wouldn't tell us why. No matter WHAT we tried, it wouldn't let us do anything. It turned out we needed to update the tablet, but it never auto updated and we had to find a way to work around it to be able to update it. So far, so good but that was really, really frustrating to see when you first open something.", "Date": "January 8, 2014"}, {"Title": "This is future", "Author": "Spiros", "ReviewID": "R11U32LR8AIGV9", "Overall": "5.0", "Content": "After long hasitation decided to buy this size and brand. VERY GOOD PRICE compared to similar \"famous\" brands. Fullfiled all expectations. Comfortable size. Perfect screen and speed.", "Date": "January 7, 2014"}, {"Title": "Good tablet", "Author": "Lesley", "ReviewID": "R3LZ1QQ0GNBLIP", "Overall": "4.0", "Content": "This tablet works well for entertainment purposes (web browsing, e-reading, watching videos, playing games) and works well with my other devices.  My only complaint would be that you can't uninstall the bloatware that comes on it.  I don't need Google to be a part of every aspect of my life", "Date": "January 6, 2014"}, {"Title": "Great all around tablet", "Author": "BRUCE BAILEY", "ReviewID": "R2F67XV3AM7R9D", "Overall": "5.0", "Content": "Was everything my grandson needed for school and gaming...packaging had me worried..air pockets all broken but the tablet is is great shape even after its rough handling.", "Date": "January 5, 2014"}, {"Title": "Great Value", "Author": "SJ", "ReviewID": "RPJP5KDIT4GH6", "Overall": "4.0", "Content": "This tablet is a great value (features and performance) for the money when compared to others on the market. However, android needs to work on being user friendly. Upon initial boot up of the tablet, it would not connect with my wifi router. After much internet research, I learned is was due to my router security settings: WEP. Once I change the setting to WPA, the wifi connected with no problems. Other small issues have come up that has taken some investigation to resolve. In other words often the user must do more than click an application icon and expect it to function. For example clicking google talk did not allow me to use google hangout to talk with family members. The video camera icon does not automatically show up, so I will need to figure out this feature before using google talk. Overall this is a good tablet, yet I would rate it great if it was more user friendly.", "Date": "January 5, 2014"}, {"Title": "Great Tablet", "Author": "Dave G", "ReviewID": "RXELBALYIUFDX", "Overall": "4.0", "Content": "Great tablet. Nice size and weight. Battery lasts a long time. only problem is I don't use it as much as I thought I would. Works well with Skype. My son also bought on a loves it.", "Date": "January 4, 2014"}, {"Title": "Great Display", "Author": "SpaceCowboy369", "ReviewID": "R3C8EDXRFKNURD", "Overall": "5.0", "Content": "I purchased this tablet as a gift for my wife.  She mostly uses it as an e-reader at the moment, as this is replacing her B/W Kindle and she has a laptop, but I see her starting to use the tablet more and more and move away for the laptop.  It was easy to configure and because she had her smartphone backed up on Google, the table went out and down loaded her address book and replicated all the apps she runs on her smart phone.  This has a better display resolution that the Ipads at a better cost.  300 ppi  (2560 x 1600 resolution) Came with Android Jelly Bean 4.2.", "Date": "January 3, 2014"}, {"Title": "Google Nexus 10, wise purchase!", "Author": "Johnny Dale Farmer", "ReviewID": "R218MLL7P67B5G", "Overall": "5.0", "Content": "Sleakness of a tablet with the screen size of a laptop, execellant product for much less. If you have an android smart phone you get the added bonus of compatability with apps and it can even use your phones internet! Great product, highlly recommend it!", "Date": "January 3, 2014"}, {"Title": "the tablet makes strange bazz noice", "Author": "barak", "ReviewID": "R3EJSARXXPKJ16", "Overall": "3.0", "Content": "the tablet makes bazzing noice. if the screen brightness is dimmed the notice is very irritating!Except of this issue the tablet is great.", "Date": "January 2, 2014"}, {"Title": "Very Satisfied After Six Months", "Author": "S. Flinn", "ReviewID": "R42BDKBY58RDH", "Overall": "4.0", "Content": "I bought this tablet for an online course. I wanted a larger screen size for the reading required. I also wanted to be able to see images and illustrations larger. The speed is good. I was always able to find apps, and have not felt like I had to make any compromises for choosing this over the IPad, with the exception of accessories. I would have rated it a 5 if there were more accessories. Speaking of accessories, the Pogo charger is a must-have. The quality of the display is excellent. The front-facing speakers are very nice to have.", "Date": "January 1, 2014"}, {"Title": "My Husband Is In Heaven", "Author": "Heather DeCutler", "ReviewID": "R19ZC3NVB0QIBX", "Overall": "5.0", "Content": "I ordered the Nexus 10 for my husband's Christmas. I was skeptical about ordering such an expensive item online without seeing it first, but it is awesome!! It was in perfect condition and came very quickly to my designated shipping address. He loves it! Great investment.", "Date": "January 1, 2014"}, {"Title": "Great Gift!", "Author": "Mark A.", "ReviewID": "R346I5P3UKF4VP", "Overall": "5.0", "Content": "Bought this for my 25 yr old for Christmas. He did the research on the available tablets and chose the Google Nexus 10.  He Loves it!!!!!", "Date": "December 31, 2013"}, {"Title": "Great tablet, sans heat and battery issues.", "Author": "Jared Urban \"vegeta187x\"", "ReviewID": "R3OM7R0UTUIAH4", "Overall": "4.0", "Content": "This is the first tablet I've ever owned and I am not disappointed.  It's fast, sleek, and everything I'd ever want in a tablet experience.  Various family members have owned numerous generations of the iPad and while it does not always have the reliable, seamless fluidity that the Apple branded products are known for, it's damn near close.My only issues are that after prolonged use, the battery heats up tremendously.  You could fry an egg on the back of this thing after 20-30 minutes of normal, non-video-intensive use.  I'm not kidding here.  This thing could double as a hot plate.  Also, the battery life tends to tank if you use it for longer than 30 minutes at a time.  This could be a normal thing that all tablets have, since I'm not too familiar with what is the norm these days for these beefier, more capable devices.  The battery life seems entirely dependent on the temperature that the battery reaches each time I use it.  If I use it for 5-10 minutes and the battery doesn't heat up to temperatures the surface of the sun would be jealous of, I get much more life out of the device per charge than if I would do the same tasks with the tablet for 30 minutes straight, heating up the battery to scalding temperatures.  Does any of that make sense?  I hope so.", "Date": "December 31, 2013"}, {"Title": "I like it :)", "Author": "Alex Mazbeker", "ReviewID": "R3BLWW3XHU58NR", "Overall": "4.0", "Content": "Great google nexus 10.Nice tablet and good price.I live in Israel and like the tablet.Nice stuff.Great.", "Date": "December 31, 2013"}, {"Title": "Highly recommended", "Author": "Assaf Omessy", "ReviewID": "R1LU7X0Q9VE79L", "Overall": "5.0", "Content": "The product is greatHe give you good value for the money you payHigh quality finish of the instrument", "Date": "December 27, 2013"}, {"Title": "fantastic", "Author": "steven m draper", "ReviewID": "R2IJ48S0G8A81Q", "Overall": "5.0", "Content": "this is the best tablet I have ever owned I've had it for about 4 months now and have not been disappointed yet my daughter loves it my wife loves it and I love it in fact I'm writing this review with it right now thank you very much", "Date": "December 26, 2013"}, {"Title": "Screen resolution, latest Android updates", "Author": "CYK", "ReviewID": "R1UUYJD6GXMVYS", "Overall": "5.0", "Content": "I bet it is the best tablet. Some times it is criticized due to lock of sd card slot. I don't think that sd card slot is necessary in the tablet. If you need more storage, get 32gb version. Best thing about Nexus 10 is the secreen display quality. İt is better than the Ipad retina display. Also, you get the latest updates of the Android when it is released. I am using Android 4.4 KitKat now.I wonder if Google will release new generation of Nexus 10. Propably I will get one if they do.", "Date": "December 4, 2013"}, {"Title": "Good but a few negatives.", "Author": "Gregory Carey", "ReviewID": "R2VZAUCAPHY4QL", "Overall": "4.0", "Content": "Good, but it has crashed a couple of times already (needing or causing itself to reset itself) and take a long time to charge, and doesn't seem to charge on any other micro-USB chargers some how!", "Date": "December 2, 2013"}, {"Title": "Amazing", "Author": "Loves to Buy \"ABJ1119\"", "ReviewID": "R16G42IGZ8WAP8", "Overall": "5.0", "Content": "Picture and sound are amazing! Unlike the iPad that has speakers in the back the nexus 10 has them in the front!!!! Get one!", "Date": "November 29, 2013"}, {"Title": "Very Happy", "Author": "Scott A. Farwell", "ReviewID": "R3FXV8ZNS9IX70", "Overall": "5.0", "Content": "This Nexus 10 is a hit at our house. Easy to use and understand. It is also an extension of my droid phone. I can pick up with the Nexus 10 where I left off with my bible app on my phone. The sad part is that I am going to have to buy another one if I want to be able to use it in my house.", "Date": "October 31, 2013"}, {"Title": "smart", "Author": "Alan G. Sawyer Sr. \"Reywas\"", "ReviewID": "RO2USWGO1JQ16", "Overall": "5.0", "Content": "This by far a fine addition to the present line.It is user frendly,and very easy to read.  The apps are plentiful and  quite useful. Thank for a great computer.  I would recommend it to others.", "Date": "October 30, 2013"}, {"Title": "Perfect screen!", "Author": "Pavel", "ReviewID": "R2TKQ4CSC95FA6", "Overall": "5.0", "Content": "Responsive and fast compared to any other Android devices I used.Battery lasts almost 3 days if moderatelly used only in the evenings. Otherwise screen eats battery very quick. With full charge  you can expect to watch ~5 hours of 720p videos.", "Date": "October 27, 2013"}, {"Title": "I love my new GN10", "Author": "Patricia Mather \"Tricia\"", "ReviewID": "R20URUS7RYMVPT", "Overall": "4.0", "Content": "This is my first Android device so there is a learning curve. I have had it several weeks now and am really glad that I made the purchase. I am enjoying learning all I can do with it. It came well packaged and ahead of expected delivery date. The one issue I don't like is I have not figured how to make and save documents. Without a regular USB port I went ahead and purchased an adapter to transfer photos (utilizing the software program Nexus Media program) from a flash drive. I haven't figured out what app or software program I need to transfer word documents. I have only had the tablet freeze up on me once. Ironically it happened twice while I started giving feedback on this product. I just powered it off and back on again which seems to have fixed it. I really hope this is not the beginning of a freezing problem.", "Date": "October 26, 2013"}, {"Title": "Waited along time!", "Author": "Penny Johnson", "ReviewID": "R1774M3FWUAS7P", "Overall": "5.0", "Content": "I love this tablet. I did a lot of research before I purchased this and did a lot of comparing between all brands. For my money this was the choice.  If your in the market you won't be disappointed. Amazon is amazing they have made all my purchases flawless and will continue to be one of their customers.  Thank you.", "Date": "October 24, 2013"}, {"Title": "600g of pure android!", "Author": "Ulises Martins", "ReviewID": "R20Z56EQ1E3MQN", "Overall": "5.0", "Content": "It's simply just better than the other competitors... the \"android\" OS gives you more flexibility and also the Nexus 10 has a great display and features... I just miss the opp. to add an external card...", "Date": "October 23, 2013"}, {"Title": "Awesome tablet", "Author": "M. Ribeiro", "ReviewID": "RVR50NO53FQJT", "Overall": "4.0", "Content": "Very hard to find something this good for the price. I was afraid of it being too big, but it is very well balanced and the rubber back is great. Even better if bought together with a aluminium keyboard. Screen is great.Some people find it too big though. So if you want portability only, go for a smaller one.", "Date": "October 21, 2013"}, {"Title": "vey cool device", "Author": "chris thompson", "ReviewID": "R3TZWCLA6YE5EW", "Overall": "4.0", "Content": "Great device, loving the portability. Wish more apps were designed for the tablet, but that's not a knock on the hardware which operates perfectly.  Google play is going to be really developing the tablet app market so things will just get better.  Battery life and charging could be improved, I can drain the battery while it is plugged in and that simply doesn't make sense.  I did get the pogo charger but its so fiddly with its magnetic connection its not very useful if I am trying to use the tablet, and its located in a bad place. Overall though I really like the tablet.", "Date": "October 20, 2013"}, {"Title": "Awesome tablet", "Author": "Seth Jaco", "ReviewID": "RHFJSVU9RZPUU", "Overall": "5.0", "Content": "I love this tablet, it is fast and the graphics are amazing. Watching high def videos on it is truly a thing of beauty.", "Date": "October 18, 2013"}, {"Title": "Just right", "Author": "M. N. Rockwell", "ReviewID": "R9TALXZV6YJ5O", "Overall": "5.0", "Content": "I bought this to be a purse-sized computer. The screen is crisp, the operating system is like my phone, and it's easy to read and handle.", "Date": "October 17, 2013"}, {"Title": "Excellent!", "Author": "Sabyasachi Dasgupta", "ReviewID": "R2D8I7H0Z7G41X", "Overall": "5.0", "Content": "Excellent!  I returned an iPad after I saw this. Incredible display. Incredible sound. Touch is super sensitive. Built well and lovely colors.", "Date": "October 14, 2013"}, {"Title": "Fast, nice screen, android 4.3", "Author": "Eduardo", "ReviewID": "R48RLYBCXL2RR", "Overall": "5.0", "Content": "Very fast, nice screen, moving from Xoom, very happy and I love the multiuser 4.3. I would like to have the rooted benefits of my Xoom, for example the OTG with almost any pendrive and the full screen tv out. (Nexus has black bars on the sides due to 16.10)", "Date": "October 3, 2013"}, {"Title": "Can't live without it!", "Author": "Amazon Customer", "ReviewID": "R1H0X7M7Y2JVFU", "Overall": "5.0", "Content": "Fast, responsive, beautiful screen resolution, latest versions of Android always, sleek design and NOT Apple!  My Nexus 10 and I are never far apart.  Would like to see a few more apps make best use of the awesome resolution and just wish there had been 64 GB versions available with 4G to really push iPad off their pedestal...", "Date": "October 3, 2013"}, {"Title": "love its size and versitility", "Author": "Amazon Customer", "ReviewID": "R9AVNS9HR76HB", "Overall": "5.0", "Content": "I already had the 7 inch tablet and love the versatility the larger screen gives for reading online OE website info.", "Date": "October 2, 2013"}, {"Title": "great tablet", "Author": "Ray \"luvnlife\"", "ReviewID": "R1JDXC8NDUPMA0", "Overall": "4.0", "Content": "I am thoroughly  pleased with this tablet Would have given it 5 stars, but the included charging cable is almost worthless. It takes forever to charge and won't charge at all if the tablet is on. I bought the Pogo magnetic charger, which should have been included in the first place. It works great. I have not had any of the problems reported by other purchasers.", "Date": "October 2, 2013"}, {"Title": "Great tablet", "Author": "patrick", "ReviewID": "RYTRFP8X3N110", "Overall": "5.0", "Content": "Its a really fast and good looking tablet. light weight and very good screen. will recommend it to anyone in search of a good tab", "Date": "October 2, 2013"}, {"Title": "super tablet", "Author": "Charles F. Lundy", "ReviewID": "R11VD1PCQZNI87", "Overall": "5.0", "Content": "I look the large screen, the way all my Google apps downloaded very quickly, has a great GPS and fast WiFi.  I would recommend this to my friends.", "Date": "October 2, 2013"}, {"Title": "Wow - Lighting Fast", "Author": "T. J.", "ReviewID": "R23CL10N2ILKC5", "Overall": "5.0", "Content": "My last Android tablet (ASUS TF700T-C1-GR) was too slow.  We already have an Ipad so I didn't want a second one.  Read all the positive reviews on this and decided to purchase.  All I can say is WOW!.  Lighting fast, great display and never lags.  It is in my opinion faster to browse on this than the Ipad.I looked into the specs and the Google Nexus has a Samsung Exynos 5 Dual core, 1700 MHz with 2 GB of Ram.  The Ipad 4 has Apple A6X 1400 MHz and 1 GB of Ram.Pros:  Lighting Fast, Great Display, Front Facing Speakers, Light weight, Battery life is good not great, Cheaper than the Ipad.Cons:  No SD Card,Buy it you won't be disappointed.  Hope this helped you to decide.  :)", "Date": "September 28, 2013"}, {"Title": "great tablet", "Author": "m byrnes", "ReviewID": "R3VU37MHJDMEO8", "Overall": "5.0", "Content": "Great. If you are an android user this is a great tablet. Getting the latest build of Android when it releases is Awesome. Samsung makes very Good hardware that Just works. I hardly ever use my laptop anymore.", "Date": "September 21, 2013"}, {"Title": "Amazing resolution!", "Author": "cg", "ReviewID": "R38QDZRNWX70QL", "Overall": "5.0", "Content": "I LOVE IT!Quite responsive, elegant, sound decent, cameras decent, keyboardneeded  external memory capability .....ONLYTHING MISSINGnada mas to say", "Date": "September 20, 2013"}, {"Title": "Just what I wanted", "Author": "James R Fisher", "ReviewID": "R3IM8USF3CCHNP", "Overall": "5.0", "Content": "When I decided to buy a tablet I wanted the Google system and a Samsung product. All my expectations were met, and it arrived sooner than forecast by the seller.  I am a satisfied customer.", "Date": "September 20, 2013"}, {"Title": "Just what the wife wanted!", "Author": "Sheldon La Follette", "ReviewID": "R2BAEAUB0JALWT", "Overall": "5.0", "Content": "My wife originally wanted a Kindle e-reader and I talked her into this, thankfully she loves it. As do I. Books on it are easily read,letters are extremely sharp. Downloaded games are fantastic and the sound is good. If you want to do more than just read booksthis is for you.When reviewing this some people were concerned as to the version of android it has. Shortly after receiving it the OS automatically updated to android 4.3 jelly bean.The down side is everything is tied into Google, great if you like Google Chrome etc. I prefer some other options, Firefox etc.Firefox can be downloaded and used on android systems. With Amazon apps everything non-Google is available, you can stilluse Google stuff if you want. The guide book that comes stored on the machine could be better.", "Date": "September 19, 2013"}, {"Title": "LOVE IT", "Author": "derek duncan", "ReviewID": "R21D3O62W37OVW", "Overall": "5.0", "Content": "This is the best tablet you can buy for Android. It's the best 10-inch tablet. Amazon Warehouse Deals is the best.", "Date": "September 16, 2013"}, {"Title": "Great tablet", "Author": "Amazon Customer \"firesoul453\"", "ReviewID": "R2ALCAZQZ1RPWY", "Overall": "5.0", "Content": "This is an awesome tablet. It can do everything I want in a tablket plus more and do it all well. There were some stability issues but after the 4.3 update no more issues.", "Date": "September 15, 2013"}, {"Title": "Great tablet", "Author": "Mary Spieth", "ReviewID": "R1DNXQLU8LQPZ7", "Overall": "4.0", "Content": "Purchased as a gift for my husband who wanted an upgrade from his Kindle, he absolutely loves the Nexus.  He has not had any issues and has been using it constantly.  He uses a lot of apps and also uses the tablet for videos, the clarity of the video is sensational.  The price beats the iPad and other devices out there, but also rivals in technology.", "Date": "September 11, 2013"}, {"Title": "Awesome Tablet.  Perfect for what I needed it for.", "Author": "Claudio Gilberg", "ReviewID": "RFMT466BFDJ6N", "Overall": "5.0", "Content": "This tablet is gorgeous.  It's fully updated with newest Android, the screen is amazing, the sound is the best i have heard on a tablet.  I use the tablet for news / some games / email / browsing.  Aside from the known battery drain from the screen and slow charger, this is the best tablet on the market.", "Date": "September 11, 2013"}, {"Title": "Awesome", "Author": "Kiran Matta", "ReviewID": "R7H9WWPBJPVI5", "Overall": "4.0", "Content": "Love it! Amazing battery life. Its my first tablet so cant really compare it with others. Have not been an Apple fan, so, this works for me... So far so good!", "Date": "September 10, 2013"}, {"Title": "the best tablet", "Author": "Gonzalo Fortuno", "ReviewID": "R2XZQ81YSS30ZR", "Overall": "5.0", "Content": "Easy todo use, fast, good quality of music, the best resolution, confortable flor reading.If you are looking for something to replace the basic funcions of computer, this is tour tablet.", "Date": "June 15, 2013"}, {"Title": "premium product at good price", "Author": "Filippo Sanzone", "ReviewID": "R1APVXQTB46KE4", "Overall": "5.0", "Content": "high specs, extremely light and handy, very fassssstplus the advantage of being a google product so will be continuously updated overtime", "Date": "June 10, 2013"}, {"Title": "Awesome tablet", "Author": "Yoel R. Florimon Peralta", "ReviewID": "R29EBCRUZY5KM8", "Overall": "5.0", "Content": "First thing I want to say, this was delivered as soon as it was expected. I couldn't be more happy to finally put my hands in this tablet. Everything runs smooth. The nexus family is overall a good experience. In particular with my nexus 10 I have everything that I needed. I can almost do anything as I do in my pc. It just so convenience to carry this device around, it's not heavy at all and it can do everything I need in everyday situations.", "Date": "June 4, 2013"}, {"Title": "Best Tablet", "Author": "JUAN WAGNER", "ReviewID": "R2YWQMCOUAR3OH", "Overall": "5.0", "Content": "Best tablet in the market. Excellent price compared to other similar tablets (Ipad Retina). I havent had any problems yet.", "Date": "June 3, 2013"}, {"Title": "Great little machine", "Author": "Rex D Mauney", "ReviewID": "RV4YJDVK6O9TW", "Overall": "5.0", "Content": "I'm NOT an Apple guy. I know many that are. This little machine surpassed every expectation I had including ease of operation. Android OS is exactly what I expected, simple, intuitive....just like my smartphone. Plus, I can leave my 6 pound laptop at home when I travel. Perfect.", "Date": "June 2, 2013"}, {"Title": "Best I've Tried - A Keeper!", "Author": "Roger", "ReviewID": "R3FC21ZWDY6OWB", "Overall": "5.0", "Content": "I have tried all the major Android tablets and have owned an iPad 2, 3 and 4.  I have never been happy with any of them.  They all had shortcomings...until now.  I ordered the Nexus 10 after convincing myself that it looked and sounded like what it was I really found important and wanted in a tablet.  Boy!  I was not wrong.  I have been using the Nexus 10 for a couple of weeks now and can report that this tablet is fantastic in every way.  The screen is quite remarkable.  It is fast!Also, it has the best keyboard and touch that I have found on any of those other tablets.  The Pad-thing could learn something here...and I am sure they will probably update its keyboard since that is one of the big trouble spots I found with my iPad 2,3, and 4.  The newest android system is quite easy to get around...and, did I say this was fast?????  I mean smoking fast.  Others have said the iPad has nothing to worry about from the Nexus....really?  Give it time.I use my Nexus for productive (school) uses, surfing the Internet, email and social media.  I love, love, love this tablet.  I bought the 32 due to restrictive expansion (sounds familiar doesn't it?).  If you're in the market...please consider checking out the Nexus.  I bought a \"refurb\" unit that was fulfilled by Amazon for a really decent price and it looks brand spanking new (probably really is).  Also purchased a magnetic cover and screen protector that was easy to install...just followed directions.  Total package = excellent.UPDATE:  6/8/13I was wrong.  My initial feelings and vibes reported above were a bit premature.  My patience was put to the test this week, and, as of today, the Nexus 10 is going back.  This entire week, the Nexus 10 started acting \"funny\".  It was surprisingly sluggish - much more than when I first got it, and I didn't add but a couple of apps that were pretty lame and should not have impacted performance.  Then I started getting the lock-ups which needed the hard reboots that a lot of folks talk about.  Finally, today, even when using Chrome (Google's own search engine!), things just would not load...at all.  I tried using Dolphin and still nothing.  Enough is enough.  Between the slow responses, hard reboots required daily, and now search engine issues when I try to surf anywhere - I am calling it quits on the Nexus...white flag is going up the pole.  I am very disappointed as I really did think this was \"the one\"!  I still think that once the bugs get worked out, I will be all in since I just loved this machine.  The feel, the looks, the keyboard, the interface....the entire package was great, but the frustrating features were too much and I can't tolerate such things.  Google just needs to get it right and this tablet will kick some serious butt all over the place.", "Date": "June 2, 2013"}, {"Title": "Best android tab out there.", "Author": "Aaron Talley", "ReviewID": "R3CCR4BHST91ZB", "Overall": "5.0", "Content": "There are so many mixed reviews out there but I can tell you this thing rocks! I also have an ipad and a mini but I find myself using it constantly. It blows everything away. Be sure to get the pogo charger, it's much faster than the charger that it comes with.", "Date": "June 2, 2013"}, {"Title": "Best 10.1 Inch Android Tablet", "Author": "GUNNER459 \"GUNNER459\"", "ReviewID": "R245A6MYQ1H5V3", "Overall": "5.0", "Content": "This is my first android tablet and also my 1st refurbished electronic item. For $420,32 gb Shipped, was too good of a deal to pass on. The Nexus 10 came brand new, although different packaging. The main reason for buying this tablet was its display!!!! too good to be true..sharpness is on par with ipad4. My main uses are to play high profile MKV videos with DTS audio , camcorder files(m2ts),FLAC Music, RAW images, connect hdd and my DSLR directly all of which wouldn't have been possible on a idevice. Coming to the downsides the android needs tab optimized apps badly, the contrast appears a tad low on this device,not a deal breaker, but you would notice,if you are used to super AMOLED. Overall Highly recommended...and just FYI planning a extended warranty of 2 yrs to sweeten the deal..Enjoy", "Date": "June 1, 2013"}, {"Title": "Great Tablet", "Author": "YASEEB RAKIB", "ReviewID": "R1AUGNZ0TYOC0I", "Overall": "4.0", "Content": "I haves used MS and Apple tablets. However nexus 10 is probably the best or one of the best tablets out there. My only complaint is the battery life. I usually have it charged over night and with minimal use (airplane mode) just reading books, etc it lasts about 10-12 hrs easy. However internet browsing, streaming video / music it depletes the charge pretty fast (4-6 hrs based on usage).This was a gift for my wife, she loves it.", "Date": "May 29, 2013"}, {"Title": "I absolutely love it.", "Author": "H.Taylor", "ReviewID": "R2855JP6540Q3U", "Overall": "4.0", "Content": "The Nexus 10 is exactly the experience I hoped it would be. It is very fast, the screen is the perfect size, the resolution is incredible, and it's generally a very good experience.As many other reviews have said, the one caveat is the charging speed. Holy crap it's slow. How slow, exactly? So slow that I can't charge it overnight, and have it be completely charged in the morning. It can only manage about 70-80%, depending on how long I sleep, from a dead battery. I've also had nights where it wouldn't quite charge to full from just below 50%. It's that bad.You need a GOOD adapter (my Samsung one was actually dead out of the box - likely because I bought a refurbed Nexus 10), and a POGO cable to get a good charging speed. I'm waiting on a new OEM charger before passing final judgement - but I can tell you, the AmazonBasics 2.1a charger is not fast enough. I'm hoping that the Samsung adapter will be!Anyway, that is literally my only complaint with this tablet. I've been using it for just about a week now, and I've been unable to find any other flaws. The experience, in my opinion, is just perfect, aside from the charging situation. :)", "Date": "May 28, 2013"}, {"Title": "LOVE IT BUT....", "Author": "lovely", "ReviewID": "R33WFUPVK63HVA", "Overall": "4.0", "Content": "I wouldnt ever return this item, because i can live with the bugs... it is smooth and love the graphics, does not come with flash but u can download it, suddenly shuts off apps, mainly google chrome!!, will freeze if too many apps are open, drains pretty quickly if you play lots of games. BUT IT IS SOOOO CONVINIENT AND READILY FINDS WIFI THAT I AM IN LOVE WITH IT!!! but thats just me....", "Date": "May 27, 2013"}, {"Title": "fast, not exactly perfect", "Author": "June K. Wolff", "ReviewID": "RPPZIDS60OJEC", "Overall": "4.0", "Content": "support staff for this product really have no idea how to use it. can be quite frustrating to find that the simplest of issues cannot be resolved without trial and error. the tablet has some limits that should be resolved with software updates, however not sure if the support people have lists for improvement or not.", "Date": "May 26, 2013"}, {"Title": "Best in class", "Author": "Yomi Shobowale", "ReviewID": "R1KUZTCS3XCX1V", "Overall": "5.0", "Content": "I absolutely love this device. I was considering this device versus the iPad and I'm glad I went with this one. It is worthy to mention that I bought it refurbished at a fraction of the cost. I think I paid $320 or $350. It was practically brand new and I will likely buy from this seller again", "Date": "May 24, 2013"}, {"Title": "Lived up to its expectations of a bright clear to read screen.", "Author": "Amazon Customer", "ReviewID": "R3JACB5ZTH3OC0", "Overall": "5.0", "Content": "Have been using it for only a while. Have enjoyed the ease of use and the fact that I can use it while sitting in a recliner.", "Date": "May 23, 2013"}, {"Title": "Great stuff.", "Author": "Nedyalko Nikolov", "ReviewID": "RAM2PCH8XYIT1", "Overall": "5.0", "Content": "Great product for that price range. Indeed there is no 3G modul, but the best resolution on the market is good enough.", "Date": "May 20, 2013"}, {"Title": "Great display tablet", "Author": "Henry Cheung", "ReviewID": "REHEYYL6FSUCE", "Overall": "4.0", "Content": "This tablet has so far the most dense pixel on the market and the 2550x1600 display looks much better compared to Nexus 7.  Its picture quality  looks about the same as the latest iPad but it is several hundred dollars cheaper.  One thing that could improve is the omission of a external storage  (micro-SD card).", "Date": "May 12, 2013"}, {"Title": "Dropped wireless signal all the time", "Author": "travlinkitty", "ReviewID": "R2OIU5YT2K626S", "Overall": "1.0", "Content": "Went through two devices and ended up returning them back to google. The only chance of connecting to a wireless network was when I was within feet from the router and even then it would drop the signal. Not sure what good is a light mobile device like Nexus 10 when it cannot reliably connect to the internet. Quite disappointed especially that it was a Xmas gift for my wife and it turned out to be a dud.", "Date": "January 25, 2013"}, {"Title": "Anyone else received this with one broken seal?", "Author": "Girasole", "ReviewID": "R2JWTG7S7YKLED", "Overall": "3.0", "Content": "I can't commend on the product performance yet because I haven't tried it yet.  But, I want to ask if other people have the same problem that I have.The product arrived on time; well packaged by Amazon.  But, the Google product box has one broken seal.  There are two seals by Google.  On the seal, it said, Do not accept if seal is broken.  One seal was broken and one has creases looking like it may be broken very easily.Amazon customer service was wonderful; helped me return this and re-order a new one waiving my shipping charge.Second purchase came and one of the two seals is once again, broken!!!  Very frustrating.Amazon customer service was still wonderful; guided me to order from another vendor. But, my third order from another vendor also has one broken seal; only difference is that the other intact seal doesn't have any crease.  Looks intact enough.Something is with Google?  I wonder if other has this problem?  I am tired of returning and re-ordering.  I am keeping the third one.  I hope that once I open the box, I will find that the tablet looks new and has no finger prints on it.I did inspect the shipping box (by Amazon) and the product box (by Google).  The shipping box has no dent.  Amazon did a good job packaging.  The Google box was ok, too.  I pushed on the Google box.  This box is sturdy enough that I don't think any external pressure on the Google box could have broken the seal.", "Date": "March 20, 2013"}, {"Title": "Run of the mill Nexus device, but with a brilliant display", "Author": "ndat", "ReviewID": "R28CUPKBHAMUEM", "Overall": "4.0", "Content": "The Nexus 10 is a solid 10\" tablet with a display that beats out 99% of competitors' offerings nowadays. The display alone is 100% of why I purchased the tablet (I wanted it for reading technical documentation) and it hits that right on the money. Colors are sharp and vivid, text is smooth and clear as day, and blacks are black.Great for rooting. The first thing I did when this arrived was root the tablet, install ClockworkMod Recovery and the CyanogenMod 10.1 ROM. It is smooth and fast with CM and customizable to all my needs.On the downside, this is a 16x10 screen. This aspect ratio is great for movies, but I don't plan on using my tablet for that. 16x10 is awful for nearly everything else. It does not properly fit most PDF books or academic research papers. It does not feel good in your hand, and is moderately uncomfortable regardless of whether it is held horizontally or vertically. It feels like I am holding a miniature widescreen television, not a pad of paper or a paperback book.Pressure sensitivity on the display is bad. Do not expect to be able to paint with this tablet like the recently announced Toshiba Excite Write. General sensitivity is OK. Multitouch is OK. There are bug reports floating around that 10 fingers on the tablet will result in at least one of the touches not registering. This does not necessarily affect me, but it does affect some people.Response time and refresh is not awesome, which is expected from a tablet. The Nexus 10 is no worse than others. I am not sure what kind of gaming this would be relevant for nowadays, but do not expect to be able to hook up a mouse and keyboard and play Quake on this thing. It will look blurry every time you turn. For 99% of people who might want to play games on their tablet, this criticism will not matter.There is no SD card slot. This fallback is as close to a dealbracker as there could be for this tablet. Regardless of Google's desire for everyone to put their data on the cloud, this means the Nexus 10 can never function as a standalone media tablet, even with 32 GiB of space. It needs WiFi connection for true multimedia usage, and not having wireless and expecting to use this tablet for multimedia makes the Nexus 10 the equivalent of a $500 brick. In my case, I preloaded it with PDFs and epubs, so in areas without WiFi I can still read books.Things like CPU speed are difficult to review. The specs on this thing were top of the line when the tablet was released, but by now they are already dated. While the Nexus 10 is still noticeably speedy, it is without doubt that by the end of August this tablet will no longer be worth its price tag.", "Date": "July 20, 2013"}, {"Title": "Runs Fantastically after 4.2.2!!", "Author": "jes0012", "ReviewID": "R2EIS69KTL2NIF", "Overall": "5.0", "Content": "Along with many of the other reviewers here on Amazon, I too was plagued with bugs on my Nexus 10 on Android version 4.2.1. Chrome browser would suddenly become unresponsive and eventually would lead to a crash and restart of the entire tablet to resolve this problem. HOWEVER, in the last few days, I have received the updated version of Android 4.2.2. Since receiving the update, I have not had a single instance of crashing or unresponsiveness on the tablet! This is the beauty of having updates straight from Google (the reason behind a \"Nexus\" branded device)! With a Nexus device, you will always have the latest software updates directly from Google within 3 days of it being released! You can't possibly beat that experience. The problem that most people have on other Android tablets and phones is that manufacturers like Samsung, Asus, Archos, LG, HTC, etc. all add their own features on TOP of the pure android code. This means that when a newer version of Android is finally released by Google, these manufacturers must take the code all over again and re-optimize their software to run on top of it every time! As I'm sure you can imagine, this is an arduous process that takes a while for the manufacturer especially when that manufacturer has to do the exact same thing to every one of its devices on the market. This leads to tablets and phones that remain on old software because either the company is still working on re-optimizing their overlay OR they simply decided to stop updating the devices because it's too much work to keep up with each and every one of their products. In the sense of Nexus devices, this is never the case!! Nexus devices run on PURE Android software with NO overlays. This software comes directly from Google and whoever built the tablet is NOT allowed to add any of their own proprietary software on top of the device. Google will have full control of what happens with that tablet. This means that you will ALWAYS have the latest and greatest features from Google IMMEDIATELY (1-3 days) after it is released!! Please use this information to help you decide on your next Android experience. This goes for the Nexus 10, Nexus 7, Nexus 4, and Samsung Galaxy Nexus (GSM version). I WILL ALWAYS BUY ONLY NEXUS DEVICES as doing anything else means my product would  literally be \"old\" within 6 months (which I know everyone hates.)", "Date": "February 16, 2013"}, {"Title": "piece of junk", "Author": "John M", "ReviewID": "R38NO2I22EIPEU", "Overall": "1.0", "Content": "The tablet had in my opinion short battery life.  Stopped working completely after five months.  Unit won't charge or even turn on.", "Date": "May 11, 2014"}, {"Title": "I expected better from Google", "Author": "weirdflunky", "ReviewID": "R1DBNLHEI7WAM1", "Overall": "3.0", "Content": "I received this tablet a couple of days ago so I have a limited amount of experience with it to comment on. The tablet was still sealed in it's original packaging, so it wasn't used like some others have discovered. The quick start book included in the box was written entirely in Spanish which made it useless for me. I spent an hour or so setting it up before it shut down because the battery was dead. The charger included in the box was not made for use in the U.S. The plug was some weird 2 prong thing obviously meant for somewhere else. We found a different USB charger at home and charged it overnight. 8 hours later the battery meter showed 49% charged. (I also bought a Pogo charger that others recommended. It hasn't arrived yet so i cant comment on whether it helps.) I took the tablet to work and finished charging tablet 4 hours later using phone USB charger in my work truck. The tablet has only \"shut down\" once while using it requiring complete restart. It has gone back to the home screen on its own a few times. I went to the Chrome extensions site but it told me the site couldn't work with my browser at this time. Really Google, really? Overall, the tablet seems to work OK but I would have thought Google would want their tablet to be better than just OK.", "Date": "April 10, 2014"}, {"Title": "great tablet", "Author": "Andrew owens", "ReviewID": "R3QO7RC5EH8Q8B", "Overall": "5.0", "Content": "This tablet is amazing super fast easy to use amazing graphics and display highly reccomend this tablet no complaints at all", "Date": "March 24, 2014"}, {"Title": "Love it", "Author": "bc320", "ReviewID": "R6SRFP14ZUYB8", "Overall": "5.0", "Content": "I got this instead of a Kindle and I am so happy.  It beats the pants off my wife's Ipad.", "Date": "March 21, 2014"}, {"Title": "very good tablet", "Author": "tdptexas", "ReviewID": "R2YCA33Y0LIHB6", "Overall": "4.0", "Content": "this is a very good tablet I almost Sent this tablet back because it gave me some issues at first but once I resolve the issue I realize this is a excellent tablet i have no regrets  keeping this tablet . I bought this tablet from Amazon so it came from one Of the vendors be careful which one you choose from the one I got the box was dirty and scratches and it was reseal don't know if I got a new one or a used one be careful. but that being said I do like this tablet very much and I would recommend the Nexus 10.Update: I return this Nexus 10 tablet, only because i felt i did not receive a new Nexus 10, you could tell that the seal was broken and reseal, i brought the Nexus 1o form Electronics Basket (amazon site).", "Date": "March 9, 2014"}, {"Title": "Perfect for what I expected", "Author": "Lucas", "ReviewID": "RRN90O0R9LG52", "Overall": "5.0", "Content": "Although this is not a top tablet any longer, it has some features that make it a good choice for people like me after the price dropped.Pros:- It has a wonderful screen, the best resolution available for tablets (hard to notice the pixels), perfect whites and excellent blacks;- The size is perfect for reading books as if you're holding paper;- The battery can go through a day with a minor pump during lunch time;- Oh, the speakers, two, stereo. A unique feature for a tablet.Cons:- Can't run cutting edge games smoothly any longer;- You'll need some research for watching 1080p movies without glitches, haven't tried those in a TV yet;- It has noticeable flickering when I'm reading large pdf scans, no matter what app I use;- USB 2. If it was USB 3.0, it would charge faster when plugged in a PC and file transfer would be way better;- The plastic feels less sturdy than the one in Asus' Nexus 7.Bottom line:For non-gamers that won't be exchanging large (hundreds of MBs) files through USB frequently, and that want a 10 inches tablet, this might be the perfect choice.I must stress that the glitches with scanned PDFs and the research and lack of confidence in it for playing 1080p files, mainly if I ever want to use it for 3d videos in a 3d tv, made me wish that I got one with tegra 4 or snapdragon 800.", "Date": "March 8, 2014"}, {"Title": "I really like this tablet", "Author": "ambjg \"ambjg\"", "ReviewID": "R1TDWH0DJYF3UX", "Overall": "4.0", "Content": "I have been an apple customer for years and years and years, but I got tired of being tied down by apple rules. I also hate ios7 and didn't want my first ever tablet to have iOS 7 on it. I also wanted a tablet that I could plug into my Mac desktop or into my camera or my TV. I tried out several windows tablets at a local store and they crashed on me! Hmmm. Not very promising. So I read many many reviews on Amazon and it seemed that the Nexus 10 was the most reliable and the one that would allow me to do everything I want it to do..  I have not yet plugged it into my desktop to download my Itunes, however, it can be done. I really like watching movies on this screen.  Its fun to use. It comes with eBook instructions on how to use the tablet.  I'm looking forward to playing with my new toy. The only reason I am not giving five stars is because the instructions are too basic. I hate to have to look around on android forum sites to learn simple things, like using the clipboard.  So, hear that, Google? Please make available more extensive directions for this great tablet for us folks who hate to waste time on the internet to find instructions. Overall, I really like this tablet and would recommend it.", "Date": "January 21, 2014"}, {"Title": "Ehhhhh", "Author": "Alex", "ReviewID": "R2BAB4HEKCB2LW", "Overall": "3.0", "Content": "I love this tablet. It's easy to use, great interface, and just amazing capabilities. However, from this vendor my USB port on this was somehow internally damaged and I could not hook up anything from that (Had to get a POGO charger).", "Date": "January 14, 2014"}, {"Title": "Great Tablet (Poor Battery Life)", "Author": "DENNIS W BANKOV", "ReviewID": "R2A2HQXPQ2RBU8", "Overall": "4.0", "Content": "Pros:1)  Lightweight2)  Display/Resolution is just as good, if not better then IPAD3)  True Android experience4)  Fast and ResponsiveCons:1)  Poor Battery Life (about 5 hours of serious use)2)  Slow to recharge3)  Battery will still drain even if plugged in (when in use)If it wasn't for the battery, this would be the best Android tablet on the market.  However, can't give it 5 stars due to the battery.", "Date": "December 28, 2013"}, {"Title": "3 stars but there is a problem with it", "Author": "S. Hahn \"WanttoseeitAll\"", "ReviewID": "R17PG4HZYFOI7P", "Overall": "3.0", "Content": "Unfortunately, I have been using mine for about 2 months now, and it is increasingly freezing up, happening quite frequently now, and if I had known it was going to be doing this I would never have gotten it.I really loved it until this started happening.  The only way to get it awake again is by letting the battery run completely down, and today when I had to do that AGAIN, it got so hot I thought it might start a fire.  I was considering leaving it out on the porch over night so it would burn my house down.So buyer beware.", "Date": "June 25, 2013"}, {"Title": "Horrible Customer Support from Amazon and Tech Giant", "Author": "shorty", "ReviewID": "R1O4PAJZNM8F0A", "Overall": "1.0", "Content": "I bought this item Feb 23, 2014 to take on a short vacation.  It quit working and it seems like the battery is defective. It is under warranty by Samsung for 6 months if it is the battery and 24 months for the unit.  However, the instructions say I must contact the retailer to have them contact Samsung.  I cannot reach Amazon nor can I reach Tech Giant.  There are no phone numbers to call nor email addresses for which to correspond with.  I am totally frustrated.  I will not buy anymore expensive items from Amazon and definitely will never recommend Tech Giant.  If it does not work, too bad!", "Date": "June 4, 2014"}, {"Title": "Great tablet!", "Author": "Thor294", "ReviewID": "R1ZX29SMO3WKRS", "Overall": "5.0", "Content": "Much better than my girlfriend's iPad, and I am eagerly waiting for the Nexus 10 2 for this to be even better!", "Date": "March 29, 2014"}, {"Title": "seriously amazing tablet", "Author": "vanessahz8", "ReviewID": "R3T1LBUKXPO81Y", "Overall": "4.0", "Content": "first off, let me say the only reason this is getting four star is because I brought it off another user who failed to include the charger with the device. Aside from that this tablet works absolutely beautifully. Definitely worth the price in comparison to other major brands such as the iPad and the galaxy. The high definition resolution screen is so awesome for all those videos Netflix and gaming and everything else that I do on my tablet. Also with the additional storage for the cost, can't be beat. I highly recommend this tablet for anyone in the market for something durable, good looking, without all the additional cost. And I also love the speakers. I mean seriously, I can't get enough of the front facing. The fact that all tablets are made with front facing speakers is just sad but I'm glad the Nexus was able to hit it right on the head.", "Date": "March 21, 2014"}, {"Title": "Good but not great", "Author": "CChristian", "ReviewID": "R11F6L8JU5P9BB", "Overall": "3.0", "Content": "I searched around for a tablet so I could phase out my laptop, but I didn't want to spend a lot of money. I researched around and it came down to either this tablet or the Samsung Galaxy Note. Seeing that this had almost the same specs as the note but with less bloatware, I decided to buy it. I quickly found it doesn't really compare to having a real computer.The battery life at first was abysmal lasting around just a few hours, but after tweaking the settings it will last for days. It was a singular event but during the first week using it, the battery went from 45% to 0% in around 5 seconds. I contacted google and they were very helpful. Every now and then though, I do get random restarts, or an app with completely freeze and will require a complete shut down and restart.Charging is very slow. I would plug it in at 50% battery and leave it plugged in overnight to find that it was only at about 88% in the morning. I purchased a POGO cable and it made a dramatic difference in the charging rate.I didn't find out till after I purchased it that the new android software doesn't support flash player. It's not a huge problem but it is a pretty big annoyance that I can't watch simple videos (like Vines, Amazon instant video, or pretty much anything that isn't on youtube). There are ways to get around it but it seems to be more trouble than it's worth. Had I known, I probably wouldn't have purchased the tablet. At this point, my Nook HD has more functionality than the Nexus 10.The tablet is pretty fast and works really well. A big problem is that i can't change document properties. I'm an electrical engineering student and I bought the tablet so that i can take and view class notes. The problem comes from my professors, since they are kinda old they accidentally label their notes \"chapter 1.notes pdf\" and the tablet won't recognize the format. It's a simple fix but I have to wait till I get home late at night and use my desktop to make the simple change to the label.All being said, it IS a good tablet. It just doesn't seem to be do what I had been hoping it would.", "Date": "March 11, 2014"}, {"Title": "One size doesn't fit all", "Author": "Otto Andersson", "ReviewID": "R24XSB0PQEMRYS", "Overall": "3.0", "Content": "Why I got this:Before getting this, I had gotten and returned a Chromebook and Windows 8 hybrid laptop. The Chromebook was close to being something that I would keep, but Windows 8 convinced me that Microsoft is egotistical and out of touch. So, I decided to stick with Android. My goal was to have something that I could take to the coffee shop with me or just use around the house. I wanted something that was good enough to almost serve as a laptop without getting into any heavy tasks (gaming, video editing etc).What I like:The screen is beautiful. Of course this is the major reason most people get the Nexus 10. Even almost 2 years since it's release, the screen sharpness measured in pixels per inch is higher than many new tablets coming out. I love the the ability for multiple user accounts! I can lend my tablet to someone without them having to see my private files or  risk having them install stuff I personally do not want. This is especially a handy work around to running the tablet for 2 modes (work and personal). I like the big bezels, because it actually is practical on a 10 inch tablet. I can hold this with both hands having a place to rest my thumbs. The material on the back really nice. There mostly isn't any unnecessary bloatware considering that most users will want to install many Google applications. Nexus also gets the latest updates, which I appreciate a lot. Even when Google stops supporting this, I will be able to easily root and continue upgrading this.What I don't like:The android OS really isn't 1 size fits all. I have the same OS (Kit Kat) on my Nexus 7 (2013) and my Galaxy S4. It works beautifully on these devices, but isn't well suited for a 10 inch tablet. Google could have easily worked around this issue by giving users the ability to change the location of the software keys (multitasking, home, back). Instead, I have to constantly change the position of my hands to awkwardly reach for the multi tasking button.I don't care what reviewers say, this thing is laggy. There will be many times I get lag when just switching programs or between screens. My Touchwiz Galaxy Note 2 running earlier versions of android is much smoother than the Nexus 10. It simply doesn't go as fast as I think it should have.Would I buy it again:No, unless I got it for 70 to a hundred bucks cheaper. For the 10 inch and higher tablet space, I think the ASUS Transformer has the best Idea. I ultimately chose this unit for its price and the hope that I could emulate the transformer by later buying add ons (keyboard, mouse, etc). I have hooked up a mouse and keyboard to the nexus 10, and it really isn't that intuitive to navigate.There will probably be a better and updated version in the future. I think the Nexus 10 should have eliminated the flash back facing camera and vibration to focus on performance issues. After getting the superior Nexus 7 from Asus, I had a lot of buyer remorse about buying this tablet, and I am looking for ways to use it.", "Date": "March 6, 2014"}, {"Title": "It's a pretty nice tablet", "Author": "Leonardo Caldas \"xlx\"", "ReviewID": "R3VX4QN3MKOGP", "Overall": "4.0", "Content": "This is an excellent tablet. In fact, it meets all of my expectations. I only have four negative points to consider:Firstly, its cheap overall appearance (at least for a tablet this price).The battery... I mean, I owned an iPad before buying this Nexus, and it usually took a couple of days in order to need to recharge it. This Nexus, on the other hand, hardly lasts a whole day with moderate usage (Internet browsing, reading emails and so.. No heavy games or whatever), even after a overnight charging.Lacking of a 3G/4G connection.Lacking of an external SD connection.Anyway, apart from these aspects, it's a product definitely worth buying.", "Date": "February 23, 2014"}, {"Title": "my wife luvs it", "Author": "brian", "ReviewID": "R1BSZ9WRZADZM9", "Overall": "5.0", "Content": "since she got this for our anniversary, she practically retired her laptop which is barely a year old. awesome price too.", "Date": "February 4, 2014"}, {"Title": "Camera stopped working", "Author": "Alexandre", "ReviewID": "R2I5IHM1HLSVZ3", "Overall": "2.0", "Content": "I was very pleased with my Nexus 10 (bought on Jan 4th) until it received an update to Android 4.4.2 (Jan 12th), which made the camera stop working. Now I have a tablet that I cannot use to take pictures. Even the front camera has stopped working (\"can't connect to the camera\") . I have already tried a factory reset, but it didn't solve the problem. Until this issue is not solved I won't give 5 stars.", "Date": "January 25, 2014"}, {"Title": "Good except for battery", "Author": "Victoria O'Gilvie", "ReviewID": "R3MVH6D5IHBGKE", "Overall": "3.0", "Content": "I would have given a 4 star except the for the battery. The battery runs out too quickly and takes too much of a long time to charge. I know that the tablet cannot be perfect but you cannot do much where there is short time with battery use.", "Date": "January 24, 2014"}, {"Title": "happy", "Author": "Kristin Stewart", "ReviewID": "R3K0LPTZUT8HFV", "Overall": "5.0", "Content": "Have not quite mastered the use of it but it seems to operate just fine and arrived a week ahead of schedule!", "Date": "January 15, 2014"}, {"Title": "Love it!", "Author": "Petra", "ReviewID": "R1GZAUEKHQ0R0M", "Overall": "5.0", "Content": "I'm not a 'techy' so can't give you all kinds of specs and why this tablet is more awesome than others. All I know is I wanted a tablet with which I could browse on the net, watch movies etc. and read my books and listen to music. Those were my most important reasons. For those reasons this tablet works perfectly! The screen is clear, it is very user friendly, meaning I didn't need a user manual to get started it all is very clear.I have had it for 3 weeks now and use it on a daily basis. Having that said, the battery life is indeed not the longest but since I am always near a power outlet that doesn't bother me.If you were to watch e.g. tv shows back to back with it; I'd say you can watch for about 5-6 hours and it has to be plugged in.Again no problem or negative for me but it might be for some people. I love my tablet :)", "Date": "December 30, 2013"}, {"Title": "Review", "Author": "Amazon Customer", "ReviewID": "R34ZOEFKQAIU2K", "Overall": "5.0", "Content": "So far I love my nexus 10. It is amazing in all it can perform. I still have a lot to learn but so far it  is wonderful and will be a valuable tool.", "Date": "December 29, 2013"}, {"Title": "Love it", "Author": "Lucky L. Knesal", "ReviewID": "R1JDHBQRAAND81", "Overall": "4.0", "Content": "I have had this running multiple apps for hours, and it never slows down.I love the resolution of the display, for both reading and watching short videos.I do with it had an interchangeable memory slot", "Date": "December 28, 2013"}, {"Title": "Better than the iPad", "Author": "Paige Farr \"farrcrest\"", "ReviewID": "R3G1IMA3BII39E", "Overall": "5.0", "Content": "I have used friends iPads, but didn't want to get one because I am not an Apple person.  I like the Android format and this syncs perfectly with my Galaxy S3 phone.  It is the right size and takes great photos and videos.", "Date": "December 19, 2013"}, {"Title": "Exceeded Expectations", "Author": "Michael W. Taylor", "ReviewID": "RMVJXY8PZSF1K", "Overall": "5.0", "Content": "Exceeded my expectations.  Delivery was quick and no problems with device.  Since I have a google phone it was easily setup and brought my apps over that I already had on phone.  Easy to use and good price. Thanks Amazon", "Date": "December 13, 2013"}, {"Title": "Awesome tablet", "Author": "n8k", "ReviewID": "R2G0XTAHRZBI3P", "Overall": "5.0", "Content": "Absolutely awesome tablet!! I use it all the time. I love that the speakers are forward facing and having a Nexus means I'm always up to date with Google's latest software.", "Date": "December 9, 2013"}, {"Title": "Love it!", "Author": "M Love \"M. Love\"", "ReviewID": "R36APP3TM7R900", "Overall": "5.0", "Content": "Straightforward and easy to use.  Love it and use it daily.  I can set it up outside in my front yard and watch netflix while I work on my artwork.  Easy to travel with.", "Date": "November 6, 2013"}, {"Title": "Wonderful Droid tablet", "Author": "Gary Kitchen", "ReviewID": "R1GYBSLLBUS0VO", "Overall": "5.0", "Content": "I've had mine for about 6 months, and I'd buy it again. Zero regrets here. Really excellent screen display quality, easily watch movies and photos, plenty big, great battery life. Do get the accessory magnector charger cable, speeds up charging. Only accessory I'd like is a stand cover for it.", "Date": "October 29, 2013"}, {"Title": "Fast processor", "Author": "AC Countertops & Remodeling INC", "ReviewID": "R1MKCRE8EY9NMD", "Overall": "4.0", "Content": "Fast processor , I love the latest software Jelly Bean 3.3. Google search is easy to work with voice command", "Date": "October 5, 2013"}, {"Title": "Very Good", "Author": "High Power", "ReviewID": "R28O4LFLYZQHNA", "Overall": "4.0", "Content": "I love Nexus devices! This one come with the original box with have one of the two stickers broken, but that's doesn't matter. The ship speed is too slow that it arrived at the last day of the estimate delivery.", "Date": "September 14, 2013"}, {"Title": "LOOOOVE IT", "Author": "Stylus with Executive Pen", "ReviewID": "R2V0B9FSPDCLZJ", "Overall": "5.0", "Content": "this tablet exceeds all expectations.. I have had a great time with it and all of my friends like it too!!", "Date": "September 12, 2013"}, {"Title": "excellent product", "Author": "Uri Tadmor", "ReviewID": "R1OW5TW97E5Q77", "Overall": "5.0", "Content": "I have a comment about the dely service Amazon locker, should enable more time for pick up or allow update regarding the pick up date, I had to order this item 3 times back and forth till I was able to pick it up!!!", "Date": "September 11, 2013"}, {"Title": "saler is great!", "Author": "jeffrey`", "ReviewID": "RWKHLPX6N4855", "Overall": "4.0", "Content": "Bought it refurbished came in  excellent condition! Will buy from big outlet again!Now the tablet. This is my first tablet and I think its great but It does have its moments when it freezes and a couple reboots. But I think every electronic has its hiccups. But it does happen frequently but I still love!", "Date": "July 7, 2013"}, {"Title": "Google Nexus 10", "Author": "Adrian", "ReviewID": "R2XHFYMN6I53SP", "Overall": "5.0", "Content": "I am thrilled with the Google Nexus 10 tablet which I purchased from you. I love its sleek design, easy operation and speed with which it connects to every app site.  I think it would have been useful to have the operation manual written without assuming the user has prior knowledge of how to use a computer. By that I mean that some of the problems I encountered where not answered by referring to the manual, but by going on the web and seeing how others resolved similar problems with navigation or closing open apps. As I have become more adept at using it I really enjoy its versatility and connectedness to my home computer. I am excited to learn something new that it can do each day I turn it on.", "Date": "June 24, 2013"}, {"Title": "love my nexus", "Author": "Kathy S Buck", "ReviewID": "R8DLEC8K2ZWKV", "Overall": "4.0", "Content": "Its a little hard to hold so you need a case. I putting my finger on the on/off button while holding it.otherwise I love it in every way.", "Date": "June 13, 2013"}, {"Title": "Like the tablet, but no support", "Author": "Charles A. Wollitz", "ReviewID": "R2YMSZTZLOS7TA", "Overall": "4.0", "Content": "When I contacted support the agent I spoke with had no knowledge of the Nexus 10. She kept putting me on hold while she looked up information to find an answer to my question. After 5 minutes and numerous times on hold I gave up. Later I received an Email from her with her explanation of how to resolve the problem which clearly indicated that she had not listened to me. Before calling, I read the documentation for the Nexus 10 and spent considerable time on-line to find a resolution. I finally figured out the solution to my problem, no thanks to Google support or documentation.Other than no support to speak of, I have been using the Nexus 10 for about 3 months. I am very happy with it. It is well designed. I have found all the apps that I need. I found a work around for the lack of support for the Flash Player, I installed Firefox and downloaded the Flash Player from a third party site and installed it (works alright in Firefox but not supported by Chrome). The only negative is the support. Hardware and software I would rate a 5.", "Date": "January 22, 2013"}, {"Title": "California is not in France.", "Author": "Loveshoes", "ReviewID": "R23TQYNSJUQ337", "Overall": "1.0", "Content": "I'm almost certain I'll love the Nexus 10.  I'm replacing my Nexus 7 with it.However, I ordered this NEW.  The box came, seals were broken, so it's either A) Not new, or B) has been tampered with.  Nope, no thanks, not what I ordered.Welp, since the box was already open, I took a peek.  Can't use a European plug OR read the French instructions, so I guess I'm SOL.Hopefully, this gets rectified quickly and at no cost to me....", "Date": "June 3, 2014"}, {"Title": "item was defective", "Author": "L. Carter \"thaprince\"", "ReviewID": "R2AC7AUJFUBZPZ", "Overall": "1.0", "Content": "Device charged at an extremely low rate, 18 hours for 68% to be exact. The post said product was free of defects but I ended up sending it back the next day.", "Date": "March 20, 2014"}, {"Title": "poor volume and incompatible w/amazon instant", "Author": "Tom \"Tom\"", "ReviewID": "R1Y0P5WCRFJ0VP", "Overall": "3.0", "Content": "The speaker and headphone volume limit has a significant negative impact on the usefulness and enjoyment of the unit. Lack of flash support for android prevents watching amazon instant movies. Amazon figured out how to put together an app to allow viewing instant on Kindle (also android) but hasn't seen fit to do so for other android units. Fortunately, both Netflix and Google Play work fine and are priced comparably to Amazon Prime. I've put in some effort locating work arounds for both the volume and flash issues but none of the \"easy\" solutions have worked (volume boosters like volume+ have not worked and neither has side loading flash or utilizing alternative browser like dolphin, boat, Firefox beta, Etc.). Other than not being able to hear music, videos and movies (when I can get them to play) its been great.Added: As I notice others have commented, the \"do not accept if broken\" seals on the box for my unit were broken when it arrived.", "Date": "December 17, 2013"}, {"Title": "Ok at the start but finishes poorly.... Disappointed...", "Author": "John from missouri", "ReviewID": "R10C7Q0JZ3FQAA", "Overall": "3.0", "Content": "Before choosing the Google Nexus 10, I did hours of research and compared the Nexus 10 features and benefits to the ASUS T300 I currently own. On paper, the Nexus 10 wins no matter where you look with one noticeable exception, battery life and it is here that I made my mistake in choosing the Nexus 10. The Nexus 10 is a battery waster from the moment I pulled it out of the box. I had puchased a ASUS T700 at the same time as the Nexus 10, today, 3 months down the road the Nexus ten is having to be sent in for battery issues and both the ASUS T300 and T700 are very thifty on battery consumption and both are good performers. The T700 has slightly worse speaker volume than that of the T300 but overall I will not purchase a Nexus again. I have had repeated system shut-downs with the Nexus 10 and never a problem with either of the ASUS tablets. I had very high hopes for the Nexus 10, sadly these have been crushed...", "Date": "July 13, 2013"}, {"Title": "great tablet", "Author": "Maria Emert", "ReviewID": "R20YEI7MM4N795", "Overall": "5.0", "Content": "first tablet ever owned.  gets somte taking used to.  ordered some accessories to add to the experience.  going to enjoy using it.", "Date": "December 28, 2013"}, {"Title": "Best tablet ever", "Author": "DSMR", "ReviewID": "R1614N30YHEV04", "Overall": "5.0", "Content": "This is the best tablet ever. It is very fast. The screen is lovely and responsive and the installed software is useful and appropriate.", "Date": "December 19, 2013"}, {"Title": "Not as advertised", "Author": "Curtis Reid", "ReviewID": "R35X1HFK6DK7P0", "Overall": "2.0", "Content": "Item was not packaged as advertised \"Brand New\" Had clearly been opened and a screen protector poorly applied, unit was itself in very good condition with no visible marks due to this I didn't return it as it was brought as a gift and would not have had time.", "Date": "December 10, 2013"}, {"Title": "too many bugs...", "Author": "S. CHEN", "ReviewID": "R8L9KD87Z74X6", "Overall": "2.0", "Content": "not satisfied with product...there are too many bugs: unstable wifi & too slow, freezes sometimes when using camera and searching on google maps....", "Date": "October 16, 2013"}, {"Title": "Operation", "Author": "dave", "ReviewID": "R2DGFF6CRZBKB0", "Overall": "4.0", "Content": "Having trouble linking to my wireless router. I keep getting in a loop that will not let me get passed the link up page.", "Date": "August 24, 2013"}, {"Title": "ON-call resolved =)", "Author": "AByZL", "ReviewID": "RKDOWBXBA0LUX", "Overall": "5.0", "Content": "I'm a unix systems engineer and I can take care of all my on-call duties from a tablet(VPN/terminal emulator etc). Not to mention the entertainment factor. You get what you paid for with this. Rooted, unlocked boot-loader with AOKP and I'm set.", "Date": "July 1, 2013"}, {"Title": "the top of its kind", "Author": "freefalling_angel", "ReviewID": "RSUAGTX7UHT83", "Overall": "5.0", "Content": "I had my doubts about the Nexus because of the mixed reviews, but once my nexus arrived, I was very satisfied with the product. Closely using Google's newly made applications like Drive, Mail, etc., and such a great selection of apps, high quality screen resolution, countless features for anyone in the family, and much better battery than Apple, this tablet is certainly competitive in today's market.", "Date": "May 29, 2013"}, {"Title": "I like it", "Author": "Tommy's Kindle Profile", "ReviewID": "R2Z3231YG1GDI4", "Overall": "4.0", "Content": "It does freeze and then reboot sometimes. I won't lie, but it seems to only about once a week and it takes less than a minute to recover. I hope they fix this eventually, but I can live with it.I use this thing all the time and except for that one minute a week, I love it.", "Date": "April 28, 2013"}, {"Title": "Will Google ever fix this promising tablet?", "Author": "Ahimsa Faraday", "ReviewID": "R1ZJJD29D83J13", "Overall": "1.0", "Content": "The main reason I purchased the Nexus 10 was the higher end specifications for its price point. But I was disappointed to find a slew of major issues running the latest Android OS (v4.4.3 as of writing). Look a little deeper than the fanboy reviews and you will find a number of widespread issues with this tablet, many with no apparent fixes. This indicates fault in the tablet hardware, drivers, and/or Android OS implementation. The main issues are:*Poor web and PDF rendering performance (I tried every browser and reader available, some performance tweaks available in Cyanogenmod help but still less fluid than older/lowerend devices like the iPhone 4 and iPad 2)*Switching application focus causes original app to reload when switching back, losing your place in file and web browsers (i.e. overzealous memory management even when free RAM is available)*Short battery life, ~4 hours of use, but at least that much to fully recharge (better be near an outlet if you forget to charge overnight)*Numerous stock apps like Google Maps drain battery by running in background (fixed with Greenify app)*Touchscreen exhibits poor responsiveness making it more difficult to select text and even type with the on screen keyboard compared to the older iPhone 4 and iPad 2*Both built-in cameras are awful, giving out of focus, grainy pictures (somewhat fixed by the CameraFX app but focusing, flash, and resolution still sub-par compared to my older free no-brand cell phone)*Auto-brightness is essentially non-functional, always requiring manual adjustment. How can Google ignore such a simple yet important feature when Apple nailed it such a long time ago?*Daily random rebootsThe last was mostly fixed by the 3rd party ROM CyanogenMod, which is updated daily. Unfortunately, random reboots still occasionally happen and CyanogenMod introduced a few new issues like the constant error \"theme provider has stopped working\" popping up 10-15x/day and the lock screen always stuck in landscape even if you are in portrait orientation, forcing you to awkwardly unlock sideways.You would think years after its release Google would have most of the issues fixed and a polished product. Yet their priorities appear to be elsewhere as they only release Android OTA updates a few times a year. Overall, I'm very disappointed with the $300+ I dropped on this tablet to get a product that works like its still in beta testing. My confidence in Google to put out a quality consumer product is now non-existent.Too bad Apple has control issues and locks down iOS like they own your life. I would switch but would miss all the customization possible with rooting. If considering a tablet I would recommend holding out until Apple chills out a bit with limiting customization (if this is important to you), or until the Android OS matures a bit, or even checkout other tablet manufacturers on the Android platform that may have better custom implementations.", "Date": "June 5, 2014"}, {"Title": "this headline thing is not fun!!!", "Author": "lynny", "ReviewID": "R1MJNK1TYMA95I", "Overall": "5.0", "Content": "i use amazon to shop alot, and i love my tablet. i don't like the rules for how long a review should be though!", "Date": "January 21, 2014"}, {"Title": "Died in two days!", "Author": "abhi", "ReviewID": "R1RR4SPNZ3N5OF", "Overall": "2.0", "Content": "Defective unit, didnt expect a Samsung built tablet to have such issues.The design is two generations old. Not going for this one again.", "Date": "October 1, 2013"}, {"Title": "Google nexus 10", "Author": "mary", "ReviewID": "R15W7TY0MMX2BF", "Overall": "2.0", "Content": "The battery is too short.  I have lost all that I had gained while playing a game.  It would just shut off even if I fully charged it in the beginning.....", "Date": "June 6, 2013"}, {"Title": "Great Tablet", "Author": "Shawn Pichette", "ReviewID": "RZXM91OF8GT1L", "Overall": "5.0", "Content": "Not much to say that hasn't been stated below.  I love the functionality, screen definition, etc.  Would definitely buy this again!", "Date": "May 1, 2013"}, {"Title": "It's very nice", "Author": "goldbear", "ReviewID": "R23NPH83MJZTHR", "Overall": "5.0", "Content": "I am satisfied in Google Nexus 10 and it is very usefull for me. I expect multiboot for Nexus 10. For instances UBUNTU and Windows 8.", "Date": "March 4, 2013"}, {"Title": "item quality / Amazon customer returns policy", "Author": "john kelly", "ReviewID": "R24ACP2MYUK7DR", "Overall": "1.0", "Content": "I'm a professional and decided to purchase the top of the range Nexus 10 as a quick media checker while I'm traveling on business.I use the Nexus about 20 hours per week and many aspects functions of the product are fantastic.About 4 weeks after purchasing the tablet  I noticed the Nexus power button started to cause me issues.after 6 weeks i was having problems powering up the tablet and after paying almost $600 for the Nexus tablet Idecided to try and return the product to Amazon for replacement.This is when I quickly realize there is only a 4 week return window policy on this item.I can understand a 4 week return window policy on cheaper build products but this product is one of the most expensive on the market for its basic social media / web browsing purpose.In summaryExtremely Disappointed with the product quality build (power button sub standard).Severely disappointed with Amazon on their return policy ($600 item and cant return it after 4 weeks).With this in mind I will also be closing my Amazon account, ceasing online purchases from Amazon and revert back to more trusted face to face customer service.John P, Kelly", "Date": "April 6, 2013"}, {"Title": "Constant freezes", "Author": "Kristján B. Guðmundsson", "ReviewID": "R3DPTNSL9G24TT", "Overall": "1.0", "Content": "With the latest Android 4.2.2 update the unit constantly freezes and reboots. There are lot of users with the same problem but Google doesn't seem to care or is totally incompetent. It has some great potential but is totally ruined by incompetent devs at Google.", "Date": "July 16, 2013"}, {"Title": "No", "Author": "My3Sonz", "ReviewID": "R3FBPZSL5A6V5L", "Overall": "1.0", "Content": "Got this for my son for Christmas, and it was rather expensive. He hated it.  The case I got with the built in keyboard didn't work well, so he never used it.  Horrible battery life.  Looses it's charge faster than an iphone.  Since I can't return it, it's sitting on a table in my room.  Waste of money.", "Date": "May 26, 2014"}, {"Title": "Seal is Broken", "Author": "Yazeed", "ReviewID": "R1L1SIJ19NRJUU", "Overall": "2.0", "Content": "I bought this tablet and was really exited, but after I got it the box looked used and old the seals wear broken which means it was opened before I received it, however everything inside seems untouched.", "Date": "February 10, 2014"}, {"Title": "Good tablet but terrible wifi", "Author": "MW Consulting", "ReviewID": "R38ZT5XZI3ROEF", "Overall": "2.0", "Content": "The tablet is nice but the wifi reception is very bad and as it is a very important part of a tablet I will only give it two stars. Will see if I can get another tablet and hopefully the wifi will be better", "Date": "December 30, 2013"}, {"Title": "Kindle fire hd done right!", "Author": "Xedhadeaus", "ReviewID": "R283OM4KE3O8CJ", "Overall": "5.0", "Content": "STOP EVERYTHING! before you buy this tablet, look into a pogo charger... Seriously this device has a terrible charge rate and a proprietary cable should have been considered... 8 to ten hours to charge this, and it will use the percentage almost like a laptop would. This is the only tablet I know that will eat the battery right out of the box. Do not bank on using it on charge and never having to worry about drainage. But the experience is so smooth. You'll feel like you're playing a ps2 game, back when the hardware pushed the software and not the other way around.Also, the speakers leave much to be desired vs the kindle. Your hands also cup around the kindle speakers so you'll be sure to hear it better depending on how you handle the device.It's safe to say the nexus is a powerhouse, I fully loaded my tablet like I have done to my last and it still plows through games and apparently with no flinching aside from some hard loading on ironman the official game. But! The tablet doesn't warn you when it doesn't like the environment. So sometimes you'll face a force close out of nowhere and feel like the device may not be compatible... Just kill some tasks with the multitask button and it will return to it's old self, running through content. But it seems clear that this really isn't a normal tablet. and it might have been made to at least stare windows 8 convertibles in the face. Because the processing power at the sake of life is apparent. It feels impractical and I'm sure everyone feels it when they have to stop the experience to charge it. Or have the tablet close a game and you would angrily wonder why until you see you only have 2 percent. Right out of the box it died at 10%, but after that it hasn't happenedNetflix is great, and the YouTube application gives the same impression.It's the price of power I guess, the tablet will fly through it's own clothes (battery) if you don't stop it. The stability may get better after it actually charges, but if you knew how powerful this thing is you'd struggle to stop.I'll probably update again later, but until then my old review is below.Unlike kindle, the support base is a lot bigger, you can finally take on apps like grand theft auto 3 and vice city, and nvidia actually has a few games that work well here.Well after my tragic defeat in trying to make kindle into a Google tablet... I bought this guy! I've only had it for a few hours but I can tell you now that it's surely a clean experience. The apps load very well, the only application that gives me trouble is go keyboard, and it's only in the settings.I'm comparing these two devices because they're rivals in my opinion.Kindle fire hd 8.9 and the nexus are both full hd tablets, are supposedly the only tablets that have mimo Wi-Fi, lack tegra 3 for no good reason at all, have no sd card slot, and are amazing in their own right... but personally, you're getting what you pay for with these two... they're both incredible, but the nexus 10 literally shadows and engulfs it if compared by specs alone, while at a first real gaming use the kindle will prove to be more geared to someone who is using the tablet vs looking at it multitask seamlessly.One HUGE disadvantage to this tablet is the engine, it is not tegra. At this point it should be depressing that a device has to support tegra to have a stable feed of high end apparently that make your tablet stand out. Another is that I don't see any software correlation to Samsung apps, such as killer candies like the artistic element. It seems apparent that we're going to have to wait a little longer for this tablet to shine, which better happen some time in it's life. Especially at the price point.Hardware build is second to the kindle hd in my opinion. If you're charging and broadcasting video you'll be met with cables sprouting at opposite ends of the device, if you trigger a loud ad you're probably going to have to find a spot to prop the tablet so you can adjust. Volume isn't a shortcut on the first or second notification. And Amazon wows with their out of the way navigation and favorites button.Software wise this tablet wins hands down, with tons of multitasking and smooth function, you'll only wish Amazon had a hand on the build and that Samsung used more common hardware. You'll be very pleased with how this tablet handles itself, but one test I haven't tried is streaming an hd flash video in full screen... that would normally make the kindle seize up and force close the dolphin browser... no wonder they had no browser alternatives.I haven't tried the camera, because I believe the Amazon camera was pretty dull. And I really don't have anything I would like to capture at this specific moment. Microphones were most likely properly placed moreso on the kindle.Google and Amazon have apparently done brilliant jobs at ensuring that you don't have an excess of bloatware, they offer the minimum to get your mainstream media ready to run and enjoy. Google sort of throws new material at you like hangouts and now, while Amazon sticks to the forte and offers Skype.The internet speed is similar, and I find that both could probably be pushing similar speeds but the amounts of downloads stopped through crashes and failure to multitask will most certainly make the nexus look like the clear Victor, especially if kindle stops Wi-Fi when it's asleep too long.I will not comment on the Google store being an advantage because there's a way around it, but Amazon apps that I bought for my kindle hasn't transferred properly, so I'm guessing they're lost... which is sort of a slap in the face to anyone who won't stick to a kindle line... (don't quote me, but none of my saled gameloft dollar games want to work.) A big disadvantage for Google is being notified that Google will monitor installed applications... so emulator guys and people who want to test compatibility may be hit for piracy if the paid apparently has a rubbish licence check that let's you through. I've also gotten some trouble with re licensing on it, and I am left unable to validate my in app purchases.The nexus 10 has on the go cable support, BUT the most practical device someone would want to otg would be a phone in my opinion... and it doesn't read mine very well unfortunately. If you want surefire otg use, I suggest you buy a card reader to USB, but I do not have one or have tried one. So look around to confirm my suspicion. It does in fact work very well with the ps3 controller.I haven't tested either of this devices in HDMI usage. But I do own a cable for the fire hd and hope to God it works for the nexus 10. ON A SIDE NOTE. every game with control maps with strict pixel scales will make games troublesome on this tablet, no exceptions. Playing sealing sword and shadow on this is terrible, because the analog is the size of the capital letter O on the keyboard. Other games such as mame will have smaller buttons for the same reason, but it won't ruin gameplay.This device will get hot! Playing games like iron man will pressure the system, and it does skip sometimes, but if a slight skip is all a polished game like that will give considering it's.almost the temperature as a hotcake, as heat throttling, I'm sure this tablet will be ready for a lot of things Google will come up with.Overall, if you want an hd device that is dedicated to content and offers an experience that will make you happy then sad within the same update... (International kindle sale, deliberate disabling of wallpaper) at a price that will make you shrug your shoulders and hit buy, you can definitely get and fully enjoy a kindle fire hd 8.9. But if you want a device with obvious potential backed by Google's brand, that seems more than capable of handling itself under pressure, and is one of only three tablets I know that decided to make a full hd experience in your hands. I'd pick this one for the long haul and options. Though at the price point, I would also consider the iPad if I wasn't so invested in Google apps.Either way, if you really wanted a tablet, both of these are great choices... firmware and the client destroys the kindle and Google is what it always was. I'm sure Google isn't going to heave an update that makes you want to stop using the tablet like the kindle did to users who hate the home screen. But if you can ignore it the price is a dream. For everyone else, you should give this a try or a few reviews.", "Date": "June 14, 2013"}, {"Title": "VERY DISAPPOINTED", "Author": "M. Sciuchetti", "ReviewID": "RYM83V94DIYJF", "Overall": "1.0", "Content": "I purchased this Nexus 10 two months ago to replace my Acer A500 that was unrepairable. I did a lot of research and decided on this tablet largely based on the \"rave\" professional reviews I read.  I am very disappointed in it.  Here are just a few of the reasons why I would not recommend this tablet:HARDWARE:- Touch is very unresponsive, requires 2-3 taps most of the time- Very weak WIFI (does not compare with my Acer)- Slow boot ( as slow as my Acer)- Short battery life (not as good as Acer)- Screen response not any faster than my AcerSOFTWARE- User Manual contains very little about the Android OS and how it works, ¾ of the manual is devoted to Google Now, Google Play, and Google Apps- No pre-loaded Apps to do the most basic functions- No way to build desktop icons to get to docs, requiring 2-3 levels, taps, to get to them-", "Date": "November 29, 2013"}, {"Title": "Not really pleased", "Author": "Tom Bonell", "ReviewID": "R2LA3BWT4QS5O0", "Overall": "3.0", "Content": "wish the folks at Samsung or Google would let folks know beforehand that it is incapable of downloading Adobe Flash Player.", "Date": "October 16, 2013"}, {"Title": "Not worth it", "Author": "Andrea McGee", "ReviewID": "R1VC1QXXXSSS10", "Overall": "1.0", "Content": "Bought tablet as a gift.  Tablet is defective, wont charge past 80%.  Called Google Nexus Support they said to return it.Amazon states returns not available.NOT OK to stick a customer with $500 defective merchandise", "Date": "December 10, 2013"}, {"Title": "Okay", "Author": "Jiby Kurian", "ReviewID": "R34IRPF8HWTCFF", "Overall": "3.0", "Content": "ProsNice resolution.ConsGets hot very fast with half an hour workLittle slow with gigsDid not find any good graphic games yet", "Date": "August 25, 2013"}, {"Title": "The best of the best", "Author": "Manase \"Manase\"", "ReviewID": "R1WXQNE4TRDSLB", "Overall": "5.0", "Content": "All I can say is, This is the best tablet ever! You have to get one to believe. Its sleek and classy. I would like to add that some people are thinking that I have an IPAD, the only difference is that yours is bigger and better, so they are telling me. I have a Google Nexus, I tell them!", "Date": "March 11, 2013"}, {"Title": "Not all that great", "Author": "steamer551", "ReviewID": "R3AI1CT4R44JCS", "Overall": "1.0", "Content": "While the clarity of pictures is outstanding, I'm sorry that I bought it instead of a notebook. Every App has a different way to share, save or save a picture. The learning curve from using a notebook to this tablet is insane. For example, It is impossible to empty the trash in g-mail. You have to let it sit there for 30 days and then it is automatically deleted.  How stupid (or lazy can a  programmer be?)  The battery, even with things turned off and brightness turned down only lasts for 5 hours instead of the claimed 10 hours. The lack of a SD card slot is the biggest pain. Things have to be uploaded to Dropbox and take forever.  Do yourself a favor and just get a notebook.", "Date": "May 21, 2013"}, {"Title": "I hate my nexus 10", "Author": "Javier Martinez", "ReviewID": "R2TK665I5B5IXE", "Overall": "1.0", "Content": "This device is always freezing and rebootingI do not recommended it.I am very sad because when it arrived to my country I realized it did not work well  and the warranty had expiredso I wasted my money on anything, I hate it!!!", "Date": "March 12, 2013"}, {"Title": "Not sure why this Nexus 10 is rated so high...", "Author": "Marvel", "ReviewID": "R1DHG98ZMCBUON", "Overall": "1.0", "Content": "I purchased the Nexus 10 because of all the good reviews from sources such as consumer reports and others. I thought I would be getting a outstanding tablet with speed, crisp screen, and good touch interface. I must say I am disappointed with the performance of Nexus 10 and all. I also own a iPad4 because my son took control of it so much, I decided to go ahead and get something different for myself which for Android the best one out there is Nexus 10 according to the so called expert reviewers out there. Problem #1) The touch is just not as responsive as the iPad4, I need it to touch 2 to 3 times on something to get there. Whereas, the iPad4 is almost always instant to the touch of the finger. Problem #2) Using the stock Google Chrome browser, when I scroll down the page, the words and pictures became blur, took about one to two seconds for the words and pictures to clear up. This is just not acceptable for a tablet at this price range. Problem #3) They system upgrade to Android Jelly Bean 4.3 means you would have your wi-fi dropping off constantly which is insanely frustrating. All these are true to my experience, I am not just writing something to knock this product. I also own the Nexus 7 which in my opinion is a better product than the Nexus 10. Since I own both the Nexus 10 and iPad4, I can honestly say the iPad4 is a superior product, it just less headache and I feel the screen resolution is notch better than the Nexus 10 too even though the spec say otherwise. All and all, I would not recommend Nexus 10.", "Date": "October 2, 2013"}, {"Title": "This is not a phone!", "Author": "M. wilkens", "ReviewID": "R1M2UG2KRYAE8F", "Overall": "3.0", "Content": "The Nexus 10 is a pretty little machine,  but it does not support the phone app, which is part of Android 4.4, as the Google support info states or implies.  So: it does not make phone calls over WiFi without some additional app.", "Date": "April 7, 2014"}, {"Title": "was disappointed!", "Author": "charlotte brickley", "ReviewID": "R1BIXL6Y06ATOG", "Overall": "2.0", "Content": "Was not to happy with it. I thought it would be a lot better quality. It does not even stay up when you use it ad a stand for the tablet. Thank you.", "Date": "March 20, 2014"}, {"Title": "Proceed at your own risk", "Author": "Fenton Hardy", "ReviewID": "R59ZJ4K4G8UUI", "Overall": "1.0", "Content": "I have had this device for about two months, and it is a piece of junk.  I do not recommend it to anyone.  I am about to go back to iPad, or maybe to a Windows tablet.I have had three main problems with the device.  These issues get temporarily resolved -- usually by the onerous chore of factory resets (I've done 3 of them) -- then they come back.  These issues pretty much render the tablet useless to me for the things I need a tablet to do.1) Exchange does not run properly.  On numerous occasions, it simply stops receiving (or enabling me to send) emails on my company's email system.  Sometimes I can get this to fix itself by re-booting or by turning wireless off and on, or by removing Exchange and adding it back.  But, this problems happens with too much regularity for the device to be useful and, as of right now, Exchange is not running at all.2) The internet is often slow as molasses -- like the speed of the old dial-ups, even though we have FiOS.  My wife's iPad works just fine, as does my iPhone (even when I have the cellular turned off to do a comparison on WiFi only).3) Probably because of 2), streaming movies, TV or other video is often a problem -- choppy playback that often simply stops for several seconds before resuming.  This even happens on YouTube, a Google service.I have other, specific gripes about the device / operating system -- e.g., it won't run Amazon Instant Video, it can't create playlists with more than 1,000 items, Google Pics takes it upon itself to reorganize my photo albums, etc. -- but the three items above are by far my principal complaints.There are some things I do like about the device compared to the iPad -- Swype keyboard, very nice display, greater ability to customize, a version of Open Office (though I understand the new iPads have a productivity suite as well).  But these benefits, and the lower price, do not come close to balancing out the time and aggravation caused by these issues that make the device pretty much useless to me.", "Date": "December 5, 2013"}, {"Title": "Awful. So disappointed.", "Author": "CoolRay \"Hulkfan\"", "ReviewID": "R3JS9V6J1ZEFNO", "Overall": "2.0", "Content": "I will say upfront that I am picky. My friends n FAM know that if I recommend something, its got to be good.  That said, this tablets limitations are awful.  Rather it be hardware or software, it doesn't matter, its all Google.  First, NO SD card slot. NO native USB flash drive mounting support. Colors are bland compared to iPad, and I hate apple stuff. With 4.2 n higher, no wiimote Bluetooth support along with other BT issues. Advertised 2gb of ram, but only has 1.07 available. GPU uses rest. Apps crash or act funny. NO menu button on bottom left. NO clear memory option. Cache cleaner doesn't work properly.  All this in only 1 day of ownership. This baby is going back. The lack of SD card AND lack of external storage was enough to do it for me.  Sad Google, just sad.", "Date": "December 19, 2013"}, {"Title": "Very disappointed", "Author": "C. Rigney", "ReviewID": "R23P5IY1P4FMB2", "Overall": "1.0", "Content": "Not sure what happened this time as almost all other purchases through Amazon have been near perfect.  This time the package from Amazon arruved on time without any obvious damage.  When I opened the package I first noticed that the product seals were broken.  I opened the box and the clear plastuc over the device looked as if it had been previously removed.  This was to be a new unopened device!  I felt uneasy so I applied for a refund.  Amazon responded very well by sending  me a UPS label to return the device. Great job byAmazon, however new unopened should mean exactly that.", "Date": "May 21, 2013"}, {"Title": "Terrible", "Author": "Jacqueline", "ReviewID": "R2F7O04AGYKOMV", "Overall": "1.0", "Content": "I've had my tablet for less than a year and it's needed to be repaired 3x.  It keeps freezing and then shutting itself off.  They claim they repair it but 2 months later the same thing happens again. Samsung customer service is terrible. I have to wait 20-25 minutes to get transferred and then no one can help me.  I should have bought an IPAD.", "Date": "November 19, 2013"}, {"Title": "Look for a tablet you can use", "Author": "Roger B", "ReviewID": "RO7DSQM5XAXEO", "Overall": "1.0", "Content": "If you plan on using it for streaming video like Prime or using WiFi on South West Air forget it .You can't download Adobe Flash Player . I bought this tablet for its make up but wish I knew of these issues .", "Date": "October 30, 2013"}, {"Title": "not a good product", "Author": "David", "ReviewID": "R3F4O9VTHW9RM9", "Overall": "1.0", "Content": "1. the SW is really buggy, it dies without any reason for some Apps2. the MicroHDMI port doesn't work after only three months.3. it's very hard to repair it.", "Date": "July 31, 2013"}, {"Title": "Phenonomal piece of Google Junk", "Author": "Brian S. Bourgeois", "ReviewID": "RS11KNRH73J4N", "Overall": "1.0", "Content": "I was given this as a gift, and I chose this particular device because I have an HTC phone with Android that I am very happy with.  I expected it to be able to do similar functions such as sync music, contacts, calendar, etc. with my computer.  IT CANNOT.  I used Windows Media Player to sync music and found that this device is unable to play WMA format music - which the majority of the CDs that I've ripped were in.  $30 later I found a program to convert the wma's to mp3s and reloaded.  To find out that the Nexus doesn't have a built in app to update album art.  So I find a fee App to do this and have a stream of ads shown to me....unless of course I want to upgrade and buy the commercial free app.  Somewhere along this journey I also found that there is no version of Adobe flash player for this device....bye bye to a good bit of web content!  After realizing it also doesn't have software built in (like my HTC phone) to sync with Outlook, I did some web searching and found another nightmare.  I hit factory reset and gave this piece of junk back.  This device was made by google to assail its owners with adds and nickel and dime you to death for functionality that is standard on other devices.", "Date": "December 31, 2013"}, {"Title": "Fantastic", "Author": "Shin sung ho", "ReviewID": "R3LBGXCGCE0QA9", "Overall": "5.0", "Content": "Nexus 10 android tablet Wi-Fi only, 32GBAwesome and amazing lol lol~~Awesome and amazing lol lol~~Awesome and amazing lol lol~~", "Date": "April 3, 2013"}, {"Title": "Not Happy with it", "Author": "Stanley Hendrickson \"Stan the Man\"", "ReviewID": "R1O3BOC2L44DB6", "Overall": "2.0", "Content": "Very disappointed Wilsh we had brought a Kindle Fire HDX Hard to keep items purchased on the front page Hard to understand how to run it", "Date": "January 1, 2014"}, {"Title": "Don't buy it from this seller", "Author": "Pauleandro", "ReviewID": "RLC3TS0LP78RW", "Overall": "1.0", "Content": "I really don't recommend buying from this store as they sold me an defective unit of the Nexus 10, and they don't refund me or trade the device anymore.I bought a Nexus 10 in January.Since I bought it the device was rebooting itself randomly.Look up at XDA Forum and you'll see that it's a problem with a batch of Nexus 10.It was not a real problem since it rebooted once in a week or more, but now the tablet can't stand \"on\" anymore more than a minute or two. It keeps restarting over and over and just stop when you plug it into the wall charger. I've already did a factory reset several times but it didn`t worked.The tablet is not  working anymore (and never really worked fine since the beginning - the problem just got worse), but as passed more than 03 months they don't care anymore.So now I have a beautiful black board for cutting vegetables of 500 dollars.", "Date": "June 6, 2013"}, {"Title": "Great if you know how to program Linux.", "Author": "Rob Magleby", "ReviewID": "R6RC1PMS836YL", "Overall": "3.0", "Content": "This would be a good choice for computer programmers.  The display is high quality.  Not a good choice if you don't know programming.", "Date": "December 30, 2013"}, {"Title": "Simple task = an entire day of research", "Author": "Ragan Hatcher", "ReviewID": "R2MASNH49OW0QY", "Overall": "1.0", "Content": "Other then the shotty WiFi, constant reboots, ungodly price, crappy design, and horrible speakers, good luck getting this thing to do the most basic tasks.Want Flash? Go spend all day reading through the forums and downloading apk after apk to get it to work.Want to watch 1080p movies?  Better download the apk that will support the audio codecWant to make a note?  Better start reading on the notepads that won't shove adds in your face all day and crash the device.This thing is a load of crap.  Every task becomes a days worth of research to kludge it into working.  I like the fact there is no bloatware on it, but some BASIC applications would have been nice.", "Date": "August 30, 2013"}, {"Title": "DO NOT BUY NEXUS !!!!!!!", "Author": "Herbert Walgrove \"Flash\"", "ReviewID": "RNSR1CXQCPQD7", "Overall": "1.0", "Content": "Product worked for all of  5 days..then the  wifi would not connect. My other home devices work fine..including Apple I Pad.  The wi fi connection was harder than usual from the day I received the unit...and it got worse..and now it will not connect at all..even though I have multiple strong signal strength routers in the house.  Searching on google  ...its a known problem with these units.  How stupid of me to have not found this out..and what a bunch of bull that Google, and Amazon would sell units with known problems. I am demanding a full refund, and sadly going to buy another I Pad. I purchased a new I pad a few years ago...never a single problem...thought I was going to be smart and go to an open platform blah blah..but they can't even ship a working product !!!!!!!!DONT BUY THE GOOGLE NEXUS !!!!!  (just search on wi fi problems with Nexus 10 so you don't become a victim )", "Date": "April 11, 2013"}, {"Title": "Beware of this operating system!!", "Author": "Debra Gilbert", "ReviewID": "R3I5FIBQOM5EW2", "Overall": "1.0", "Content": "I've had, and have loved, my Samsung S4 (w/Android op sys) for a couple of years so imagine my surprise & disappointment when I discovered that over half of  the videos I tried to watch on my new Nexus 10 (w/Android op sys) were not viewable. Nothing that requires flash will work. NOTHING! No \"work-arounds\" helped. If not for one reason, then another...ALL resulting from the fact that these technology giants won't play well together. In this instance, Adobe has made flash so that it won't play with Samsung (maker of the Nexus 10) AND Amazon & Netflix offer almost nothing to play on this device. If all the narcisist tech companies would put us, their customers, ahead of their petty competitions, consumers would return to the days of product loyalty. Meanwhile, we're stuck in the role of cross-fire victims and I can't recommend this device. Having the sharpest images on the market means nothing if you can't view them.", "Date": "February 24, 2014"}, {"Title": "Disappointing vs. Ipad 4", "Author": "stockmarketbob", "ReviewID": "R1WGW5Y5OGGOGY", "Overall": "2.0", "Content": "Being both a Mac and PC user and wanting something more portable for travel and casual use, I bought the Ipad 4 and the Nexus 10 at the same time to compare.  I'll be returning Nexus 10.  Because the Ipad has been around much longer than the Nexus, the Nexus is at a huge disadvantage as far as having good apps.  I found many of the apps for the Nexus 10 were simple Android phone versions, not utilizing the additional screen size this size tablet afforded.  Whereas the Ipad 4 apps were all specifically written for the additional screen size of the Ipad vs. the Iphone.  I found many more things frustrating on the Nexus, for example simple zooming in the Mail application, wouldn't do it.  The much hyped screen resolution of the Nexus 10 was hardly discernible over the Ipad 4.  Even though the screen width is slightly larger on the Nexus, the overall screen size in square inches of the Nexus 10 is LESS than the Ipad, it is simply too narrow, unless all you want to do is downstream widescreen movies, i found it's proportions not good for running most apps.  There is no Itunes app for the Android, therefore you can't use Airplay, a very popular way of streaming your media to you TV or stereo.  If you want to download your Itunes library from your PC or Mac, good luck, I couldn't figure it out, there is no easy way, and a google search will confirm this.  I found the touchscreen to be very inconsistent on the Nexus 10, sometimes it was fine, other times, depending on the application, and size of the icon, very hard to press and activate, there was an inconsistency I haven't experienced on the Ipad 4. The camera and movie functions were simpler and of better quality on the Ipad 4. One thing I did like on the Nexus 10  is a backward arrow always visible on the bottom of the screen to retrace your steps which was often used and very handy.  Perhaps in 2 or 3 years if Google stays committed to the tablet they will catch up to Apple, but right now, it's not even close.  Perhaps there are workarounds to some of my observations cited above, but to me not worth the time or trouble, especially when the Ipad 4 ran so well out of the box for just slightly more money.", "Date": "May 21, 2013"}, {"Title": "WTF", "Author": "Michelle Holmes", "ReviewID": "R3U613HYEH7OMR", "Overall": "1.0", "Content": "This item got here OPENED. I'm sending this back. Thanks for ruining my Christmas. My bf just wanted to get me something nice.", "Date": "December 25, 2013"}, {"Title": "Did Not like Tablet", "Author": "Jean Chastain", "ReviewID": "RT7254A88A7V1", "Overall": "2.0", "Content": "I wanted to like it but I had problems with it.  I am sure it is a good tablet, I probably got one that had a problem", "Date": "February 23, 2013"}, {"Title": "Wow I had bad ones", "Author": "sleepersteve", "ReviewID": "R16HFQIYFEE3N1", "Overall": "1.0", "Content": "I bought my Google Nexus 10 from Wal M. and it was a bunch of ---- and sis not work so I returned it and the same thing happened to me again the tablets would not connect to any applications like you tube ect ect. so I took it back also and decided to buy a Samsung Galaxy Note 10.1 and it is great. I know they just got a bad bunch of tablets but that was my experience with the Nexus 10. they returned my money on the spot!!This is sleepersteve", "Date": "July 17, 2013"}, {"Title": "can't watch movies or TV shows on this device!!", "Author": "Linda Gelinas", "ReviewID": "R2XDQZBD8G12BM", "Overall": "1.0", "Content": "this device does not support adobe flash player - so I can't watch movies on it! That was an important reason I wanted a tablet.", "Date": "November 18, 2013"}, {"Title": "not user friendly", "Author": "Esther J. Langdon", "ReviewID": "RHAAZ3GXI7VQQ", "Overall": "1.0", "Content": "I wouldn't recommend this for anyone. Compared to the ipad, it is very confusing and very difficult to use. I intend to return it.", "Date": "December 16, 2013"}, {"Title": "Amazon don't sell the Open piece", "Author": "muthuraj", "ReviewID": "R2QTSAXTI2030", "Overall": "2.0", "Content": "It was a open piece and i was unable to use it until i updated the firmware. I don't again when it may stop working.", "Date": "November 13, 2013"}, {"Title": "Not as stated", "Author": "Kelly Tenney", "ReviewID": "RENR6FUI1E7JV", "Overall": "1.0", "Content": "This produce arrived with the tamper seal broken and obviously had been used not brand new like stated! I returned it for my money back!", "Date": "February 15, 2013"}, {"Title": "I couldn't be more disappointed", "Author": "Linda Carrizosa", "ReviewID": "R11JP8HBRMS45P", "Overall": "1.0", "Content": "I knew this was a used tablet, when I placed the order.  And, I expected it to show a little wear based on the advertisement.  But, I was surprised by how scratched up the device was, in part, because it's gorilla glass, and because it's not that old a device.I realize that any two people looking at the same thing will have a different view of how to describe something when posting an advertisement, but I did not expect for our views to be so completely far apart.  I'm returning this for a credit, as fast as I can.Knowing that this seller and I have a completely different view on the same thing, I could never purchase from here again.", "Date": "July 23, 2013"}], "ProductInfo": {"Price": "$499.00", "Features": "Dual-core A15 processor\n2GB of system memory and 32GB on-board storage memory, Android 4.2 (Jelly Bean) OS\n10.55\" touchscreen, 2560 x 1600 resolution\nBuilt-in 802.11b/g/n WiFi and Bluetooth\nBack 5MP webcam and front 1.9MP webcam", "Name": "Google Nexus 10 (Wi-Fi only, 32 GB)", "ImgURL": "http://ecx.images-amazon.com/images/I/31YZ2rCFA%2BL._SX300_.jpg", "ProductID": "B00ACVI202"}}