{"Reviews": [{"Author": "Y. Z.", "ReviewID": "RDX49WUVHD3JT", "Overall": "4.0", "Content": "As potent as the iPad and its App store are, and as fabulous as Android Tablets have become, I still could not pull the trigger on either one.I really, really, wanted a Windows 7/8 environment on a Tablet.Thankfully the wait is over, but are we getting everything we wanted with this one?Bottom line first:This Asus is by far the best value 10\" Windows Tablet in the market now and for sometime to come judging from the price tags of similarly equipped Win8 Tablets by Acer, Samsung, HP, DELL, Lenovo, MS and others.To find the Asus' page with details about this model, Google eee asus vivotab-smart featuresOr better yet: search 'ASUS Vivotab Smart Review Tablet-News' on YouTube for a true-to-life 28:07 minute video./-- See also Updates from 7/30 at the end of the review --/Hardware:The 10.1\" feels surprisingly light in your hands at 1.16lbs/580gr. By comparison, the iPad retina is ~3oz heavier at 652gr. The Plastic back is sturdy with no flex and feels good to the touch.The screen is bright and sharp. I found that I keep the brightness level at the very low end of the scale which also benefits battery life.When using it for plain Windows 7 tasks, plus Windows 8 games, browsing, Skype, emails etc. the battery was good for over 11 hours(!) at which time it was at 10%.Charging it back to 100% - while continuing to use it - took 4 hours.Asus provides a 3 foot long cable that charges the Tablet via the micro-USB port and plugs either into the provided wall adapter or other power sources (laptops/Desktops/Car USB chargers).Under the hood:Out of the 64GB it comes with, the recovery partition occupies about 8. Additional 20GB are taken by the OS + Asus but no bloatware which is really appreciated, thus leaving you with around 33G free. The micro-SD slot will support up to additional 64GB.The Tablet comes with 2GB RAM and that is the limit this architecture can support.The CPU/Graphics provide for a snappy and incredibly fluid experience and the screen is very accurate to the touch. It's a true joy to use. The tablet is also silent because the CPU does not require active cooling (i.e. a fan or ventilation slots). The combination of total silence and a lively usage experience is quite addictive.Note that the Atom Z2760 was developed with power conservation a priority, and the inevitable trade off is that it might not be able to play quickly or at high frame rate very demanding games, sophisticated graphics or video editing tasks. For those, you may need to stick with much more power hungry machines.'ASUS Live update' - When updating the BIOS refrain from disturbing the process. It may take 5 min to complete including a reboot. Drivers update worked quickly and without a hitch.Stability:After extensive daily use of the tablet for 4+ weeks, it has not crashed, nor hung even once!This is quite commendable considering this is a new OS on a newly designed architecture.Suggested Accessories:1. The box does not come with a micro-USB to USB, or micro-HDMI to HDMI adapters. Those will run you about 2 bucks. Make sure the USB adapter is of the OTG type. With that type of adapter, the Tablet recognized instantly a corded Keyboard, corded Mouse, wifi dongle for a Wireless Keyboard/Mouse, and a 32G flash drive. It did not manage to play music or video off of an external Samsung DVD however. Likely due to a limit on how much Amps the Tablet can output. That same external DVD plays fine with just one USB port when connected to my Acer HTPC. Various external HD drives will work too (see comments by other users). An externally powered HD worked right away as well.2. The charging USB cable that comes in the box is quite short at 3' and I use a much more practical 6' one. Again, not any cable will do. Mine was purchased elsewhere, but you can get one on Amazon for both Data and Charge, as mentioned by others in the comments thread.3. This slim folio provides great protection and proved very practical for everyday use  Blurex Slim Folio case for the ASUS VivoTab Smart ME400C Windows 8 Tablet -- With Built in Sleep / Wake Function.4. The 'Smart' unfortunately does not come with a docking keyboard (the RT does, but the 'Smart' cannot dock into it).Instead of getting the Asus' Transleeve Keyboard, I ordered a corded mini-Keyboard/Touchpad that also incorporates 2 full size USB ports.The good news is that both USB ports of this Keyboard were recognized by the Tablet!  In spite of being a little smaller than the tablet - it is surprisingly convenient to type on (except maybe for people with large hands). The keyboard is extremely light at 10oz and provides ample feedback. The Touchpad is too sensitive though, which almost rendered it useless. To discipline it, I resorted to a no-Tech fix by applying scotch-tape on it and Voilà.A corded KBRD does not draw battery power like BlueTooth or WiFi ones do, nor does it require charging. Another benefit is being able to plug more than one USB device via the keyboard instead of messing around with the more delicate micro-USB port of the Tablet itself (a micro-USB to USB adapter is needed to connect the Keyboard of course.) Perixx PERIBOARD-510H PLUS, Wired Keyboard with Touchpad & USB Port - USB - Super Mini 9.05\"x6.30\"x0.90\" Dimension - Built-in 2 x USB2.0 Hubs - Silent X Type Scissor Keys - 5.90 Feet CableA similar Perixx Keyboard with 2 USB ports and a trackball, only larger in size, might be worth considering too:Perixx PERIBOARD-505H PLUS, Wired Trackball Keyboard With USB Port - Mini 12.40x5.79x0.83\" Dimension - 0.55\" Optical Trackball - 5.90 Feet Cable - Fit with Professional or Industrial Use - Built-in 2x USB2.0 Hubs - USB Interface  Alternatively, there are many BlueTooth/Cordless KBRD/TCHPD options out there.Windows 8:Briefly put, it does take getting used to, but once you are up to speed you forget all that critics had to say ever since Win8 was introduced. Win8 really shines in Touch environments, and before long you will find yourself swiping right and left, splitting the screen to share apps on your real estate, run Skype and Pandora in the background, open files and browse the Internet the perfect way that only true Browsers can, flip effortlessly between the desktop and Win8 Apps, update drivers on the fly, plug in USB devices, attach, send, share and manage any kind of digitally captured file, and what not.. You will have just one thing to say then: Hallelujah.I did miss the Start button on the Desktop application, but it was very easy to add. Win8 provides very generous customization options far beyond what I have already implemented. That's very nice to know.Windows 8 Apps Store:As of Early march 2013, with 31000 'English' Apps, the App store leaves a lot to be desired and is 'under construction'. The Built in search tool is rudimentary at best and is a hindrance to finding what you are looking for. I found some of my favorite games, News Apps, Utilities etc. to get a reasonable starting point, but it is still lacking in many areas.When you Search the Store using the Charms 'search', the Free version of some games would not show up, like 'Fruit Ninja' Lite. But they are very much there.Luckily, sites like Intel's AppUp.com or windows8apps.com are a great help in searching the store.Lastly, some aspects of the Tablet could have been better..-- I wish Asus offered a docking Keyboard/Touchpad and I think that Asus fell short with their TranSleeve contraption, which is the thin keyboard + origami-style cloth cover. The Cloth cover can be folded to support the Tablet from the back, but is useless should you want to hold the Tablet on your lap for example. Also, the Magnets that attach it to the Tablet are not sufficiently strong and both the keyboard and cloth cover can separate from the Tablet too easily, potentially causing it to slip.-- Although the sound quality is acceptable, with only one speaker on the back, stereo effects are, well.. non-existent.-- While charging the Tablet via the micro-USB port, the port cannot be used for anything else. At least the 10+ hours of battery life gives you ample opportunities to charge when the port is not in use.-- The GPS is not of the kind you have on your Cell. It's only usable when you have WiFi.The shortcomings however pale in comparison to what you are getting. This fantastic Productivity & Entertainment companion is a keeper for me.Update - 7/30/2013After 6 months of extensive daily use, this delightful tablet performed almost flawlessly.However..1. If you can wait a month or two, look for tablets that feature the new Haswell Intel CPU for a bit more performance, better graphics and even longer battery life.2. Do yourself a HUGE favor and only buy tablets that have a proper *docking* Keyboard w/Mousepad(!), saving yourselves the agony and frustration that come from relying on the virtual Keyboard or an external real one (not to mention that the virtual Keyboard covers almost 50% of the screen).", "Title": "Finally. A 10\" Tablet for the rest of us.", "Date": "January 14, 2013"}, {"Author": "Jeff James", "ReviewID": "R12E4NDDPOAXEK", "Overall": "5.0", "Content": "First off I would like to clarify that this a full blown x86 machine running full Windows 8 and it's only limited by it's hardware, it runs all legacy programs as well as Windows store apps, this is a PC that looks and feels like a tablet and for me that is excellent. Also this is not a Windows 8 review.Now that we got that out of the way, on to the review.This is a long review but I hope is useful if you're on the fence about this tablet or a Windows 8 tablet in general, I will point out some aspects I would've liked to know before I purchased this tablet as it may be helpful to you too, please read on.HARDWARE AND BUILD-----------------------------*You can read the full specs on the product description-It has almost the same footprint as an IPad and the weight is very comfortable without making it feel cheap, even with a case on this tablet weights less than 1.5 lbs. Actual weight is 1.3 lbs which is very nice. Mine came with a light creaking on the right side (landscape orientation) of the bezel but not a mayor issue-The Screen is superb for what it is(1366x768 IPS display), viewing angles are on par with an IPad and better than on the Galaxy Tab 10.1, crisp and clear images are produced and colors a very accurate, it also has adaptive brightness. Screen response is very fast and it has full Windows touch support and 5 point multi-touch support also  it has no active Wacom pen support-The Back panel has a rubbery feel to it makes it feel more expensive  and it does not attract fingerprints nor it scratches easily, also the camera decoration ring gives it an upscale look-Only one speaker is built in, not stereo speakers like advertised, this is  really my only hardware compliant, it is really quiet and puny, but I kind of expected that. Since it has a combo mic/headphone jack and Bluetooth 4.0 and the output trough the jack is very good getting audio out of this thing is no problem, you will need an adapter for separate microphone and headphone use, also I've found that the Intel sound driver has a weird way of recognizing when you plug in something and it sometimes kills the audio completely and you have to restart the tablet, this appears to be more of a bug than problems with the actual hardware,-The battery is non removable and is superb for a full Windows 8 machine, I've managed to get about 9 hours out of a charge using Bluetooth, WiFi and running several apps-The back camera is very good, it takes full 8 megapixel stills and records 1080p videos, front camera has a wide lens though is off centered, it looks weird but it makes sense for video calling-NFC and GPS are supported, you may share websites and contact cards with most NFC enabled devices but keep in mind that file transfers are restricted between Windows 8 products only (Includes RT and Windows Phone 8), this is a \"security feature\" in Windows 8 (Dam you Microsoft!)-The wireless antenna is very good but it will not connect to ad-hoc networks(like the ones created by some smartphones) and creating a WiFi hotspot is not supported,  these are \"security features\" in Windows 8 (Dam you again Microsoft!), you can install a third party app for WiFi hotspots creation but is not working for me yet-Bluetooth audio and remote control are supported as well as Dial Up Networking via Bluetooth and Nokia Suite in my case (solves my ad-hoc problem), audio streams with no problems, as well as the internet connection via DUN, fast enough-Charging requires at least 1.5 amps output from your power supply (if not using the supplied one) for a slow charge, don't expect it will charge off from your regular USB port on your computer these put out 0.5 amps at most, by the way the USB to Micro-USB cable for charging that is included is very short (like 3 ft.), you can use an equal longer cable-Haven't tried out the Micro-USB OTG feature and the Micro-HDMI port yet,I will be updating this review when I get some adapters, the Micro-SDXC port supports up to a theoretical 2 TB of storage, mine is 64 GB no issuesOverall very good hardware, build and finish is well executed and materials feel more expensive.PERFORMANCE/STABILITY-----------------------------This tablet flies on Windows 8 it opens apps and desktop programs(depending on the program) very fast is responsive and it handles multitasking quite well, stability is not an issue, had one freeze up during a Windows update but it resumed quickly, the Modern UI feels perfect for this hardware spec, the desktop side will depend on what you are running.This tablet has a Dual-Core Intel Atom z2760 @ 1.8 GHz and 2 GB of Ram @ 800 MHz, an integrated Intel Graphics Media Accelerator with a minimum of 64 MB and a maximum of 725 MB of shared memory and Direct x 9.3 installed and an on-board Intel STT Audio Device (WDM) with an eMMC 64 GB (~58 GB formatted) HDD.Windows Experience Index (Windows 8 32-Bit)Processor: 3.4Memory: 4.7Graphics: 3.7Gaming Graphics: 3.2Primary Hard Disk: 5.8That is good for the following(some examples):-All Windows Store Apps-MS Office and many document suites-High quality Video/Audio playback and streaming (YouTube Full HD, Netflix, Hulu, Spotify Premium, Sony Music Unlimited, Full HD video files and looseless audio formats)-Light Audio/Video and Photo Editing (Very light)-Some older games(Age of Empires 3, World of Warcraft on lowest settings, Fallout, Emulators topping on Gamecube/PS2-like graphics)-Some CAD programs and Audio creation programs (MathCAD, AutoCAD, Amplitube or Guitar Rig)-Some programming and SQL programs (MS SQL Server, MS Access, NetBeans,Flash Builder,etc)Basically anything that is not too CPU or Graphic intensiveHaven't tried virtualization yet(OracleVM for example), Windows 8 reports it's not supported by the processor but it may be configurable I'm not sure, also you can install Bluestacks or WindowsAdroid if you like to install some Android apps and since it's a x86 machine there's a possibility to put Mac OS X or Ubuntu on this thing.Overall very good performance for every day computing, as well as some leg room for big programs, very pleased.INCLUDED SOFTWARE AND ACCESSORIES------------------------------------------It includes the bare-bone accessories, only the charger cable, power supply and a cleaning cloth are included, as well as manuals and warranty info.Asus choose to include as little bloatware as possible, this is good, they just included their LiveUpdate, WebStorage, MS Office trial install and some windows modern apps, also they included the restore partition which you can back-up to an external USB drive and delete after if you want to get those 8 GB backOverall pasable software an accessory bundle, software wise is good since it doesn't rob me of my precious space, but accessory wise they should have included a Micro-USB OTG adapter and perhaps a cloth sleeve for travel. Also I would suggest getting a Bluetooth keyboard and a mouse since it makes things better on the desktop mode, in fact the more things you can use connecting Bluetooth or WiFi the better since the Micro-USB port doesn't seem to put out too much power and carrying around a USB hub (aside from the fact that the tablet probably is not going to be able to power your devices or even the hub itself) defeats the purpose of portability.CONCLUSION----------------------It starts at $499.99 for 64 GB (mine costed $487.99) and that gives you most of the power of a regular PC plus expandable storage in an tablet package, by the way speaking of tablets both the IPad 4 and the Nexus 10 are the same price and offer better displays and arguably better ease of use, minus less storage and no real PC capabilities. For me those tablets don't fit my needs like this one does because it has Windows.By no means is this tablet a \"anything-killer\", each tablet fits different needs and does it in a different fashion, so this is rather a completely different beast, a new genre of tablets, this tablet is a great start to getting your Windows 8 groove on, highly recommended great product.Look for options and do the research  to know if a certain tablet fits your needs and then go from there, for me it's finally what I was looking for in tablet, a portable full blown computer.", "Title": "Thin and Light! Very Smart!", "Date": "February 20, 2013"}, {"Author": "Deified Texan", "ReviewID": "RWHQN0KYH1EE4", "Overall": "5.0", "Content": "Absolutely a life changing device for me. I have to give up my office with the arrival of a baby boy. I fretted about this as I love my study but I really like my desktop computer in the study.My wise wife suggested I use one of our existing notebooks instead --- a no go for me. If I am sitting at a desk then I don't want to be on a laptop conversely for mobile use I am not a fan of notebooks due to the weight and battery life.I went to the Microsoft Store after watch all the microsoft commercials. I was hesitant as I had previously updated my desktop home computer to Windows 8 and what a hassle as I had to learn something new and different. I really liked the Windows Surface at the MS Store though --- Windows 8 was truly made for a tablet but the Surface ran Windows RT and if I lose my desktop then I would not be able to use my Windows programs (Quicken, etc)with the Surface. The Microsoft Rep told me that the Surface Pro was on the way but would weigh 2lbs and have a short battery life. No thanks.I came home and did some research and found the Asus Vivotab Smart which magically ran full Windows 8 on an Intel Atom processor. I was again hesitant as I had a netbook with an Atom processor years ago and it was slow. But the reviews were great on the Asus Vivotab Smart. So I bought it along with the cover and keyboard.Game charger. Its super fast and seamless. Plays movies without a hitch. The system is as fast as my eyes can watch the screen and fingers can swipe. Windows 8 is weird on a desktop but is by far the best tablet OS going. I liked my Ipad and wifes Andriod phone but they were toys to a certain extent. This has all the same features except that Windows 8 is more intuitive as a tablet than the Ipad and Android. Plus I can run my beloved Quicken and Microsoft Office, etc.I won't miss my desktop computer and office (save that is where I watched football).Pluses: - 9 hrs of battery life (I can confirm this) - Windows 8 is the ultimate tablet OS (use your thumbs) - weighs ~1.25lbs --- light - get the cover and keyboard --- the are a must, the keyboard is normal sized and the cover is a kickstand also - Screen is super clear and fresh --- viewing angles are great - Windows Metro/modern is great and it took getting this tablet for make me figure that out - Full Windows although I only find myself use quicken, office for the traditional windows programs - Take the dive and sign up for the integrated Microsoft experience: outlook.com email and use skydrive cloud for you storage which is free. I resisted this at first but once I switched over to outlook.com IMAP email and the cloud for \"my documents\" --- I realized I was stupid for waiting so long. - Thus Windows 8, outlook.com and skydrive synchs all my computers and tablets seamlessly with zero work. So with this tablet synched my email, music, documents, pictures, etc when I turned on the tablet for the first time and logged in with my email. - Kills complexity in my life. Now my computers, notebooks and this tablet are on the same synchronized platform even my background picture and passwords are the same. So I am going to sell my Ipad (never liked Itunes) and my wifes Andriod phone is on chopping block.Minuses: - The App store is still developing which is a bit of a hassle. Netflix and audible.com, fitbit are there but my wife wants the facebook app, pinterest (wife's request), skyward and a few others. - Apparently computer writers/reporters are fanboys of Apple and Google which will be a disservice as their readers will stay with those platforms instead of switching to Windows 8 tablets thus the App store may be slow to reach a critical mass of users. - Microsoft made a mistake with the Surface. Its beautiful but RT is limited compared to Windows they should have taken the Asus approach with full Windows 8 on a Intel Atom. This tablet is lighter, has the same battery life and all the windows goodies. - at $499 its more expensive than Androids although beats the pants off Apples considering you full Windows 8 - Does not come with Office installedGet this tablet.", "Title": "Great Tablet --- Now I can get rid of my Desktop computer!", "Date": "February 6, 2013"}, {"Author": "rloonia", "ReviewID": "R37E8T00B6OMPS", "Overall": "4.0", "Content": "Pros:Battery LifeDisplay SizeProcessorNFCMicro HDMIMicro USBWeight (580 Grams)Full windows 8Build quality64 Gb emmcCons:Speaker volume could have been higher, but its still acceptable based on the compact form factor.Full USB port would have been better but not a deal breakerI initially got an Acer Iconia W510 and was fed up of the constant crashing/driver issues with the device and returned it.1. Build QualityChecked this tab in while surfing for windows 8 tablets and i liked its build quality and features that are mentioned in pro's list here (Acer tablet had a lot of flex on the back plastic cover). As expected the tab feels really sturdy with no signs of flex no matter how you hold it.2. Battery LifeThe battery life of tablet is great, i can go through full day (approx. 9 hrs of usage) without any problems.My use involves web surfing, videos, music, games etc (I use this for entertainment mostly)3. PerformanceIntel Atom serves for most needs, dont expect Heavy lifting programs like adobe photoshop to run very smooth but other than that for daily needs it works well even while multi tasking. I ususally have multiple apps open and switch between them constantly, the experience goes without a hitch. You can have multiple browsers/tabs open and it would work great, the 2GB RAM complements well with the atom processor and does not show any signs of slowdown in day to day use of Office, Videos, Music, Web Browsing, reading, Games from Windows store etc and also since this is intel powered, you get all the goodies of pugins to browser in desktop mode.4. StabilityThe first thing you should do when getting this tablet is update it, Asus Live is a good client to get updates related to drivers and you would see many windows updates which are very critical stabilty and power updates, these updates also include updates to make the microsoft store work better. Once you get up to date, there are no stability/driver issues and the tablet works well, Ive been using this for around a week and i did not see any crash or any driver issue. Its very stable and works really well.Hope this review was helpful for people thinking of purchasing this tablet. I definitely recommend this product.Thanks", "Title": "A Stable and Affordable Windows 8 Tablet", "Date": "February 1, 2013"}, {"Author": "Jason T Nash", "ReviewID": "R2MDLB3BCG9P69", "Overall": "3.0", "Content": "I really like the hardware of the ME400. The 10.1 inch size feels a lot better than those larger 11.6 inch Atom tablets. The tablet is thin and has a nice soft touch back and rounded edges. The buttons seem to be in good locations too.What I don't like about the hardware, I wish the seam between the glossy plastic front bezel and the soft touch plastic back didn't meet on the edge of the tablet where my fingers rest. The seam is a bit rough in some places.ASUS claims there are two speakers and that SonicMaster audio provides richer basses and the best audio experience. Well this marketing spew couldn't be further from the truth. The tablet has one speaker vent (maybe there are two very tiny speakers side by side under it), there is no \"bass\" at all, and the volume is pretty weak. Hearing dialog is quite difficult. You'll definitely need to use headphones if you want to watch movies, TV, or podcasts on this tablet.But the audio wasn't too important (this seems to be a problem with many tablets unfortunately) and the rough seam doesn't bother me much, so overall I'm quite happy with the hardware.Where the real problems are though is with the software. You can't download drivers from ASUS's website. Instead they include an ASUS Live Update tool to get the drivers, this is the only way to get the drivers. This tool worked for me the first couple days I had the tablet, then it stopped working. Now I just get \"cannot connect to server\" when I try to launch it, then it just closes. This seems to be a common problem from what I've read on tablet forums too. Nobody seems to have a fix for this. I did a Refresh of Windows 8 on my tablet and unfortunately the problem remained.I contacted ASUS for help on this issue. The first ASUS rep I talked to went to look for an answer and 15 minutes later hung up on me without ever getting back. I contacted them again and the next guy told me he has no fix for this problem He can't provide me with the installation file to re-install ASUS Live Update and told me I just have to wait until the application is released on the website, which of course he could not tell me when that would be.The tablet sometimes will just freeze up and not respond at all. I'll have to hold the power button for 10 seconds to force shut it down and reboot. This has happened about 4 or 5 times in the almost two weeks I've had it. So not quite a daily occurrence, but happening more often than I like. I don't think it's a hardware issue, just one of those things with immature drivers.I imagine this tablet will get a bit better once ASUS get's it's act together will driver support. They've been quite terrible with it so far between this and their TF810 Atom tablet too. But I decided to suffer with ASUS because the hardware seems nice and the price was nice at $500.", "Title": "Nice hardware, terrible support and drivers.", "Date": "February 9, 2013"}, {"Author": "Santosh Geddamuri Sr. \"Happysan\"", "ReviewID": "R1DH4VD5X33HW3", "Overall": "5.0", "Content": "I was in market for last 1+ year to own a tablet. Initially i bought ipad retina and returned it as it is too big and bulky for my taste. Later bought kindle fire and galaxy but didnt like the interface and waited for ipad mini. Once ipad mini came , i was no more intrested in it. Now i was looking for windows 8 tablet. But didnt like th RT version as it is very limited and no scope of expansion. Then i found VIVOTAB Smart.Its a great tablet with almost every thing i was looking in talet.Key features.Lighter then ipad. Though while holding the weight is not very significant but still its 30 grams around lighter.Cheap: This tablet is much cheaper then other windows 8 tablets.But the quality is very good.On screen Keyboard: Ipad has keyboard which layout cannot be changed. I have to reach from one corner to other while typing.Didnt like that so wanted a smaller tablet. But this tablet at very same size has multiple options for keyboard layout. Very easily split the keyboard into 2 on either ends and can be operated with 2 hands very easily.Slim design/video out. Tablet is very slim for what it is. It has both RT and full windows 8 desktop. Just hook it up to LCD tv via mini hdmi and you have big screen.So the scope of using as a full windows 8 tablet is better then Just RT or ipad.Memory. Can be expanded with SD card. While on trip add sd card full of movies and you can use it as entertaining device on go.Battery life: Too early to comment on but it will have better battery life then other hungry processores like Core I5 or I7.Also no heat issues.Camera: Camera is definitly better then other tablets. The images looks crisp and clear.Speaker: Could be better but as space is limited,one can live with it.Screen: it is beautiful ,not retina screen. But it is not bothering.Overall a nice tablet for cheap price. Low end processor gives better battery life and reduces the cost.So i prefered this over durface pro etc.", "Title": "Tab and PC in one", "Date": "February 7, 2013"}, {"Author": "C. Tung \"Crazy scientist\"", "ReviewID": "R2NY5X79MR4FA7", "Overall": "5.0", "Content": "There is a good reason this product is out of stock on Amazon at the moment: it's a great tablet with terrific value.  Being a big fan of the original Microsoft Surface RT, this Clover Trail (Intel Atom) tablet does perform so much better than the current generation ARM processor based devices.  Everything runs faster, and it doesn't sacrifice the battery life much to achieve this performance.This tablet runs full Windows 8, which means nearly all traditional Windows Desktop applications run on this.  I haven't tried to install too many yet, but I find it cool to be able to have a desktop Skype running at the same time as the formerly Metro one, perhaps with different Skype accounts signed in.  Keep in mind that this is a powerful tablet instead of a convertible Ultrabook, I think the features on Desktop is pretty cool.  Desktop Skydrive also runs well, although I wasn't 100% sure I want to download all files from Skydrive at the first place.This is my third Windows 8/RT device, and I have to say it really grows on me, as a lot of the settings come automatically with a sign in.I don't know whole lot about how Intel achieves the power consumption with the new Atom, but my observation is that it takes longer for a desktop program to install, but when it runs it runs mostly smoothly without major lags.  One example I have is Office 2013.  I think it actually took longer for it to install on this new tablet than an old Core2Duo laptop, but when it runs there is no big difference, everything is smooth.  It worth to note that the most complained Windows RT apps all run a lot faster on this.  Some still not perfectly smooth, but not too far from it either.  The whole experience is pretty amazing.While Microsoft Surface Pro with 64gb Memory has only like 20GB of free memory for usage, after installing a number of apps, desktop programs, Office 2013, and downloading several GB of files from Skydrive, I still have 24.8 GB free.  I don't quite understand why but I'm happy with it.I don't want to write too much about Windows 8 here.  Basically with the touchscreen, it works very well on a tablet.Somewhere I read that some people had issues with updating software.  I ran ASUS's LiveUpdate before Windows Update, and it went fine.  ASUS's update sometimes seems not doing anything, but it was running so just wait.The 10.1\" ISP screen is fairly nice, all touch gestures work perfectly and smoothly.  Sometimes I wish the screen is a little bigger, but to be honest it's not too cramp to operate on most things.  It might be just my illusion, but sometimes I feel the touch screen is made of plastic instead of glass (according to ASUS, it's made of Corning Fit Glass, whatever it is).  Not that it matters much as long as it doesn't get scratched easily (which I don't see any in the short time under my ownership), just an observation.  If there is one thing I'm not very satisfied with, that is the Windows key at the bottom of the screen, which is a bit less sensitive than ideal, that sometimes it requires a longer or two taps to register.The front facing camera is far from top quality, but for say Skype video chat it's fine.  One thing to note that if you get the TranSleeve, there is an angle that you can use the tablet upside down, and in that configuration your front camera will send out upside down images.  The back side camera is not too bad, although I honestly don't know what's the main purpose of that, since I think a camera on a phone is much more important than on a tablet.The speaker(s) built in on the tablet are not the best, doesn't quite give you the feeling of surround sound, as other reviewers have noted.  The stereo jack is decent.  Relatively low background noise, but the sound itself is not whole lot to talk about either.The build quality of the tablet is very good.  Things are tight, thin and light.  Not much to complain.  There are reviews complaining about it gets warm.  It does, but far from anything which might make you uncomfortable.  In my opinion it's really only just warm, and I don't have much tolerance on things getting hot.I don't know how much they save by having only one USB OTG port, which also serves as the power charging port.  It does have an extra, independent Micro HDMI port.I got a Micro HDMI to VGA, a Micro HDMI to HDMI, and USB OTG to USB adapters.  The USB port works great, as I connected it with my USB hub both mouse and a webcam got connected fine.  Both VGA and HDMI adapters worked, but honestly I felt it's abusing this little tablet to try stream HD video from Amazon Instant Video.  It didn't run too well and I don't think I'll do that in the future.  I'm not sure it's the CPU, GPU, or the internet connection, it just didn't go well.ASUS TranSleeve and Keyboard Touchpad for VivoTab Smart don't work as well as the kickstand and Type/Touch cover with Surfaces, but they do work.  You can check out my review there.Overall I think this is an extremely good value Intel Atom tablet, with great performance with decent battery life.  It really makes the whole Windows 8 experience amazing.", "Title": "Terrific Windows 8/Atom tablet", "Date": "February 25, 2013"}, {"Author": "R. Morrissey", "ReviewID": "R17S7A6PBK0ZM2", "Overall": "1.0", "Content": "After a decent bit of research and waiting for this to hit the market I was happy when I managed to find it on sale finally.  It wasn't available on Amazon (that I could find) at the time of purchase so I had to go through another company unfortunately.  This is my first go around with Windows8 and like so many other people I find it equally enjoyable and frustrating.  For everyone one thing MS got right they seemed to have messed up three other things badly.  With that said this isn't a review on the OS as Asus can't be held responsible for what Microsoft did with Win8.  I just felt it was important to mention it to folks who haven't tried the OS yet.My main issue is with the hardware.  After owning the hardware for about 3 weeks the touch screen completely failed on me this morning.  It was working perfectly fine last night before bed.  I set it up to recharge over night and when I woke up the screen wouldn't react to any gesture.  I currently have a locked screen that I can't swipe to unlock to even try and perform a system restore.  After a bit of research online I've tried to 'hard reset' it through various combinations of holding down power buttons and volume controls to no avail.  I don't know if the calibration is bad and needs to be reset or if something else is fried.I may have had the one bad apple and I'm hoping Asus will be able to fix this situation for me.  I was just starting to enjoy using it for my daily reading routine and now it's dead.  I've always liked Asus but this was a $500 let down.  :\\", "Title": "Loved it while it worked :(", "Date": "February 12, 2013"}, {"Author": "Marcos Hernandez", "ReviewID": "R3QDVZOC5Z2DRG", "Overall": "5.0", "Content": "Hardware wise i dont think there is a single thing i can knock. Ok so theres a few minor annoyances, like using the same usb to charge and gata transfer can make it a hassle when runing low on powee. But on the good side battery seems to last quite long so its not a frequent issue. Using coretemp ive found the processor to run between 15-40c, which is cooler than any aircooled computer ive ever seen, especially when you consider there are no fans.now, when first used theres 30 windows updates, 2 asus hardware updates and whqtever apps also need updates. It takes a bit and i managed to end up doing a restore but win 8 restores and keeps all my files so nothing was lost.", "Title": "Solid device", "Date": "February 8, 2013"}, {"Author": "Brian Keldsen", "ReviewID": "R6EMJ32YTV2IK", "Overall": "1.0", "Content": "I purchased an Asus Vivotab Smart in April of this year and have had nothing but problems with it since I have had it.First, the sound started to cut out randomly requiring a restart in order to restore the sound. When I called into customer service they had me do a \"Hard Reboot\" which resets the unit back to the factory defaults. This was annoying to say the least as all the apps I had installed were erased. What is worse is that the hard reboot did not fix the problem, the sound continued to cut out randomly requiring a restart to restore the system sound.This was the just the beginning of problems. At this point (less than 2 and 1/2 months from the purchase date) the touch screen has begun to malfunction. The unit behaves as if the touchscreen is being touched even when it just sits there being undisturbed by anyone. This makes it very hard to navigate as the unit continues to behave that way as I try to use it. Apps will randomly launch, websites will randomly be navigated to (and away from) letters will randomly by typed, etc...Finally, the touchscreen keyboard has begun to malfunction. There are time the 'a' key and the 'w' key just won't work. They won't work in any app. If you happen to have any of the failing characters in your password, you are up a creek.I have spend hours on the phone with Asus' lackluster customer service. They had me send in the unit for repair - which they will ask you to do at your own expense unless you complain hard enough. I followed the repair process through to the end and when I got the unit back I opened up anticipating that it was repaired.It wasn't.Nothing was fixed.Nothing at all.The same problem that led me to send it for repair were noticeable from the very first time I fired it up after getting it back from their \"repair\" facility.I should have known that this was likely as the Better Business Bureau has given Asus a failing rating (an F on a scale of A+ to F) and has a consumer alert against this company. Apparently I am not the only one who sends Asus products off for repair only to receive them back just as broken. According to the BBB:\"We have identified a pattern of complaints concerning service issues. Complaints processed by BBB claim that 1) products sent to the company for repairs are still not working properly when returned to the consumer.\"After all that expense, I anticipate having a very expensive paperweight.BEWARE!!!You might be one of the lucky consumers who have no problem with the product, but if you do have a problem, don't count on Asus standing behind their product or honoring their warranty.To this day Asus refuses to send me a suitable replacement or refund my investment.", "Title": "Buyer Beware", "Date": "July 11, 2013"}, {"Author": "R. Schurman \"rjsnau\"", "ReviewID": "R2UHVQEN8UY7OW", "Overall": "5.0", "Content": "Let me start by saying that I currently own a 1st generation iPad, a 7 inch Android table, and now the Asus Vivotab Smart so I am familiar with the advantages and disadvantages of each platform. I will briefly go over each and the say what I like so far about the Vivotab Smart.iPad:  Everyone talks about the big advantage with iOS being the app store.  I honestly don't see it.  I don't need 42 different apps that make fart noises or 54 that make it look like I am drinking a beer.  If they have the basic ones that allow me to get things done I am happy (Facebook, Pinterest, Weather, etc).  I think iOS's big advantage is the simplicity.  System updates are simple, app installation is simple, no detailed firewall settings etc to worry about.  Once you know a few basic gestures you can get around easily.  It is also \"pretty\".  Itunes is fairly intuitive although I found it did have a learning curve when I first learned it.  The disadvantage is that simplicity combined with Apples controlling nature really limits what you can do.  File management, forget it, all your pictures can only have one file level deep.  Playing different video files, not a chance, you have to convert first.  Printing from it, what a pain if possible at all.  Flash, nope, Mr. Jobs said no from the very beginning. Also, maybe it is just the first generation but I have alot of stability issues.  Every time I go to Facebook in any browsers it crashes after clicking around a few times.Android:  A great alternative.  Some file management and much more customizable than iOS.  More freedom to install apps that Apple would not approve.  The downside I see with them is most apps are not optimized for a tablet and I have yet to find a browser I really like.  Some are ok but non seem to hold up to Safari. Not quite as \"easy\" as Apple to update the system.Windows 8 (not RT): Five days in I am really enjoying Windows 8.  Websites look just like they do on my PC.  Flash works on the desktop if I need it and everything loads quickly.  Plus if I have any problems I can go to the desktop and run any browser I want.  I easily mapped to my homegroup and can transfer files from my main PC and set up the printer.  The apps are limited but I found 90% of the ones I want and if they don't, chances are good I don't need it since I have a real browser. No more paying for a hulu subscription just for the privilege of watching it on an iPad.As for the actual Vivotab Smart hardware, I have only used this tablet and played around with the Surface RT at the Microsoft store so I don't have alot to compare it to but I have been very happy with it.  It is the best price out there for a Atom tablet with 64GB of space right now.  As others mentioned, the system files took up about 30GB so be prepared.  I am ordering a 64GB Micro SD card to store all my media and just using the HD for apps.  I installed office and it seems to run plenty quick on the Atom processor.  This tablet is not going to run anything intense but if you are not a video editor or heavy gamer it should work just fine.  I only have two complaints.  First, Asus Live update is not working for me.  Keeps saying \"Can not connect to server\"  The second issue is a audio driver issue.  Every few hours I had the audio go out on me and had to restart to get it back.  I am sure if the Asus live update was working it would have downloaded a new driver but I could not get it to work.  I looked up in device manager what kind of audio card it was and found another driver on the net and so far it works great. Still, Asus should have the live update working.  From what I read this is a common issue.In summary, I am very happy with my purchase and would highly recommend it to anyone!", "Title": "So far I love it", "Date": "February 4, 2013"}, {"Author": "Rk Mink", "ReviewID": "R3BGNB9J0T43N8", "Overall": "4.0", "Content": "When I started going back to college I found myself lugging around a backpack full of gigantic books, notebooks, and my MacBook Pro. I started really trying to cut down on the weight and decided I needed a replacement for the MacBook. It's an awesome computer, but too heavy. My requirements for a replacement were something lightweight and able to run MS Office well. Eventually I found the Asus VivoTab Smart. The reason I chose this over some of the other Windows 8 tablets is because the reviews were positive, it was affordable, and it has a clever keyboard cover-case-thing (sold separately.) This thing can quite literally be a tablet or a laptop. Will it ever be the best at either? No. That's obvious, but it performs as both fairly well which is a good compromise. It weighs about as much an iPad, maybe a negligible difference. It is comfortable to hold. I actually prefer holding this over the iPad because the slick aluminum backing on the iPad is like butter. It is fast enough to run Office, which is good for me. I haven't noticed a single hiccup yet.So, I guess the summary would be:If you want the best tablet experience, go with an iPad or the Android device of your choosing. Windows 8 isn't quite able to compete with the app style interface of either of those yet.If you want a laptop, well there are plenty of better ones out there.If you want a device that can function as a tablet or a laptop, seriously consider this device. If you are thinking of the Surface Pro, give this a try. If you are thinking of the Surface RT, The Surface RT doesn't run the full version of Windows 8, this does.It's definitely a good buy.", "Title": "Surprising!", "Date": "March 4, 2013"}, {"Author": "Sara Roberts", "ReviewID": "RIBRL5QE5PNH3", "Overall": "1.0", "Content": "I wouldn't recommend this product to anyone unless you want to get screwed by Asus... I had bought this Asus Vivotab Smart on May 29th and received it with fast shipping on June 3rd. When I got it, it work prefect I had no troubles with it as I am use to a Windows 8 system because have a laptop that has Windows 8 on it. I decided to purchase this Vivotab because I wanted some on the go instead of carrying around my laptop every I go. At first this product was perfect and I was happy because I was able to take my work on the go and access all my documents that's on my laptop on the Asus vivotab. I never dropped or abused my tablet in anyway what so ever, I treated this tablet and any other tablet I had used in the pass like it was my baby. On July 4th I used my tablet in the am, there was nothing wrong with it, I plugged it in to charge, between 5 to 10mins after I had used my tablet, I heard a loud popping sound coming from the table where I had my tablet at charging, I wondered what that nose was so I went over to my tablet opened the case and found that the screen was cracked and the plastic siding where the power button is was separated. I was upset and confused at first because I didn't know why this had happened. Since it was a holiday I didn't think anybody was opened so I waited until the next day to contact the seller and Asus about this issue. I was told by the Seller that I had to contact Asus to see if they can fix it and if I wasn't satisfied with the results from Asus which was no help because they are saying if I want them to repair the screen I would have to pay for the repairs which I didn't see why I should pay for any repairs do to this happening on its own which would make it a design flaw. So I contacted the Seller back telling them the issue again and asking them to either replace the product with a new one or refund my money back, The seller said the are not able to replace or refund my money do to the fact that the 30day warranty is up, wow the warranty was up by 1day when this happened. I am waiting back on the manager of the company where I got this Vivotab Smart from to see if they can possibly make an expectation, but I am not holding my breathe, I ignored all the complaints and bad reviews because I thought I would get lucky and get one the was fine or that the other people was just hating on Asus products because they simply didn't like them. Don't ignore the bad report about Asus, there are actually true, I have researched this problem and found that other Asus products including this Asus Vivotab Smart screen spontaneously cracks. Asus denies that this product and other product has this design flaw and refuses to fix it with out a charge, they simply like to call their consumers liars and blame and charge them for the repairs for a damaged screen. I explained numerous time to them and the seller what happened, this is why companies loses business because the like to deny claims and blame the customer.. My advice don't buy and ASUS product especially this one because you will be disappointed especially when it come to the screen spontaneously cracking on its own....... Sorry that this review is long but its the truth.......", "Title": "Asus has a design flaw-DO NOT BY FROM ASUS", "Date": "July 12, 2013"}, {"Author": "Refuge Denied", "ReviewID": "R1FIA2YQZ3EWNC", "Overall": "1.0", "Content": "Purchased Feb 12, 2013, Received Feb 14, 2013This little tablet could have been a real winner if it had better support and drivers. This may improve in the future, but I have a limited return window and I am not willing to \"wait-n'-see\" if ASUS gets the issues fixed.  This is my first ASUS product, and I can say I am not impressed with the company.  In fact, after the 'top-notch' support I received from ASUS, I don't think I'll buy another ASUS product.The tablet was nice for the first couple of days while I was helping my father (77) learn to use it. I bought it for him as a surprise gift and he was so excited - there was no special occasion, it was a 'just-because' gift.Windows 8 Modern UI was fairly simple for him to pick up, and in short time he was able to send/receive email, browse the web, and open his Word documents after I added an Office 2010 license.After a couple of days he brings his new tablet to me with a problem. It wouldn't read the new microSD card I placed in it.  Turns out the card was bricked - no machine would even see the card.  No problem, I keep all of his stuff backed up pretty well, so I'll send that card back and get a replacement. In the meantime, I gave him a loaner card that I had been using for a couple of months in one of my other devices.The next day he brings his tablet back to me with a new problem. He says the battery was a little over half charged last time he put it down, but it wouldn't wake from sleep. After futzing around with the tablet a bit, since I could see a device share on the network I determined it was coming out of sleep, but the screen wasn't turning on. I decided the only thing to do at this point was a hard power-down and reboot. This can't be good for the device.Later that afternoon he has another problem. He applied an MS update that required a reboot. Unfortunately the tablet stalled on the rebooting screen.  I explained the processor, while great for every day tasks he would use the tablet for, was pretty much the slowest (current) x86 cpu available and it may take a bit longer for things like shutdowns to process.  He brought the tablet to me, still stuck on the reboot screen.  Another hard power down and reboot. I don't like doing that.Two days later, no microSD card access.  Same story - this one bricked too.  That makes one Kingston 64 GB card and one SanDisk 32 GB card that no longer work in any machine.  I have one more card - a second SanDisk 32 GB card that was in my phone for a few months.  I reformat that card, transfer his files back to it, and place it in his tablet.Same day - tablet fails to properly come out of sleep again. Shows up on the network, screen just won't turn on. Hard shutdown and reboot.The next day, Monday, his replacement microSD card is delivered. He brings his tablet over so I can transfer everything and get his replacement 64 GB card back in his new toy.  Except when I try to wake the device to 'safely remove' my card, it won't properly come out of sleep. Once I finally get it back up and running, I check for additional MS updates, then run the ASUSupdate. Says new version is available, but continually fails to install. Nice.  Never did get past that point.I tell him I need to factory reset the device and start over.  Maybe that will clear up the issues.  After taking all that time, updating everything again, a reboot hangs.  I waited about 15 minutes and it just stayed on the reboot screen.  Hard shut down and reboot.  ASUSupdate continues to fail again. Later, the device fails to properly come out of sleep ... shocker! Hard shut down and reboot.  See a pattern?These problems continue for another week and a half.  I need to do something more drastic ...Live chat with ASUS support was great!  I explain everything that has been happening and write that I have done a full 'device restore' (factory reset) but the problems persist.  His advice is to perform a device restore and he ends the chat session.  \"Did that really just happen\"?  Awesome!After some research I found a forum post with a several folks complaining about the same issues.  I decided at that point I should probably return the tablet and get him an Android tablet that has been around for a bit longer. That decision sucked.  Not that there were any hassles or anything like that. No, it was the look of disappointment on my father's face when I told him what I think needed to be done.That killed me.  With a pitiful look on his face he said, \"I'll trust your decision. Do what you think is best.\"  I will probably get him a Galaxy Tab 2 10.1.  My sister has one and last time I talked to her she really seemed to like it. I hope he likes that as much as the VivoTab and I hope he's able to figure out Android as fast as Win8.Anyhow, I took the ASUS tech's advice and performed another device restore, only this time I didn't set the tablet back up.  I boxed it up and set up an RMA with Amazon.  Such a pity.  This little tablet has so much potential, and it is entirely possible ASUS may fix the issues. I'm just not willing to wait and possibly have my father stuck with a device that never gets needed support.UPS is scheduled to pick it up later today - Mar 7, 2013-----Update Mar 9, 20135 stars for Amazon's return policy. First item I've returned to Amazon and it couldn't have been easier. Logged in to my account, clicked 'Available Actions' under the tablet on my 'Recent Orders' list and chose 'Return or Replace Items'. Filled in the answers to 2 questions and printed out an RMA sheet to include in the return package. UPS picked up the package the next day and even brought a shipping label.  As soon as they picked it up, my return was marked complete and my refund was credited 2 days later to my CC.-----", "Title": "Nice Design, Fatal Flaws", "Date": "March 6, 2013"}, {"Author": "Jeffrey Adams \"Jeff Adams\"", "ReviewID": "R2D5A0JNJ0DMKO", "Overall": "5.0", "Content": "I received the tablet a day early on March 6th. I first noticed that the tablet had a great build quality but still felt very lite. I turned it on and it had a ton of updates! After an hour and a half of updates (Windows 8, Windows Store Apps, and Asus bios and drivers) it was a beautifully performing computer. I love it. It is fast enough for everything I do, like surfing the web, banking, email, streaming movies and light gaming. Oh, yeah and shopping on Amazon! Before the Asus Vivotab Smart I had an Android tablet and an iPad, this blows them away! I highly recommend it.", "Title": "Amazing Tablet!", "Date": "March 7, 2013"}, {"Author": "Mike Kearney", "ReviewID": "R3R3PZVOTZGG5C", "Overall": "4.0", "Content": "I agree with much of what has been said already about the tablet - lightweight, great battery life, etc.  I would give it 5 stars if app support was better which really isn't the fault of ASUS and I assume will get better over time.  It would be nice if Amazon would come out with an Unbox app for Windows 8.  The buttons on the video player are simply too small.  Other apps are incomplete at best.  The Kindle app is HORRIBLY laggy and makes me want to reach for my old android tablet.  Amazon needs to fix that ASAP.  I'd also like to see different software based keyboards made available too like the Smart Keyboard Pro for the android OS.  I like text prediction and T9 capability for software keyboard.Don't waste your money on the ASUS cover and keyboard.  Way too expensive and not all that useful as far as I can tell.  For the cover I purchased the MoKo Slim Cover Case for ASUS VivoTab Smart ME400 ME400C 10.1 inch Windows 8 tablet, Black (with Flip Stand, Integrated Elastic Hand Strap, Stylus Loop, and Smart Cover Auto Wake/Sleep.  For the occasional need for a keyboard, I bought the Logitech Wireless Touch Keyboard K400 with Built-In Multi-Touch Touchpad (920-003070.  This is a sweet little keyboard with integrated touchpad - when I'm not needing it for the tab, it will work as a great home theater keyboard.  You'll need an OTG USB adapter cable to plug in the Logitech receiver.  I bought the Zuweiyu USB 2.0 A Female to Micro B Male Adapter Cable Micro USB Host Mode OTG Cable.  These I all bought from Amazon.My only real functional complaint after about a months worth of use, is that the tablet won't always wake up when I open the case like it's supposed to.  I don't know if this is a firmware issue or a Windows 8 issue.  I've played with the Windows 8 power settings and they seem to be setup right.  I've checked the firmware (bios) and there are no accessible power options.  If anybody has this working I'd appreciate you letting me know.  It seems to work if I lay the tablet down for a few minutes but if it's been sitting awhile (haven't tested just how long) it will not wake up.  Takes a long press on the power button to wake it up.  Have to be careful not to press for too long or the tablet will reboot which is also annoying.I think it's a great tablet that will only get better as updates come out and the apps improve.3/1/13 additional comments - I forgot to mention that I was able to upgrade to Windows 8 Pro and then add Windows Media Center.  Still struggling with sleep issues. It simply won't stay on consistently and will occasionally reboot on its own.  I'm assuming it will get better.  For instance, Amazon released an update to its Kindle app - very much improved. Not perfect, but getting there.", "Title": "Affordable Windows 8 Tablet", "Date": "February 25, 2013"}, {"Author": "fredbird", "ReviewID": "R14TLKIVHTVUNI", "Overall": "5.0", "Content": "I've had a couple tablets, have used numerous IPads, etc.  But this tablet, by far, is the most useful to me.I work in I.T. so I'm not much into just having a \"Consumption\" device.  I needed something that I could not only consume data, but produce and manipulate data with as well.Another one of my criteria was that I didn't want to plunk down $600-$1000 on a device that I would consider replacing within a few years.  (Upgrades come fast)The ASUS Smart gives me the tablet functionality using the Windows 8 Metro desktop, along with the \"Full Use\" availability of the x86 platform to use my everyday windows programs when I need them.The App Store is constantly growing and I'm seeing a lot more in there every week.  It may not have \"ALL\" the apps that are available to Android or Iphone, but I can find something that works the same in the Microsoft store.The 9 hour battery life is great.  I can use it consistently throughout the day to do my work and play without worry of needing to plug it so it doesn't die on me.The hardware seems very decent.  I don't like the micro-usb charging port though.  Not that I've had any problems with it on this tablet, but I just tend to break the ports on phones, tablets etc. in the past.  I would have rather had a more sturdy charging port.  (Personal Opinion)The Screen is very nice.  It's not a retena display like the iPad, but it is still very nice.  No complaints.  I can watch movies without issue on the tablet when I don't feel like working.If you are looking for a cheap tablet toy that has no standardization, go with an android.If you are looking for a decent tablet that is a very nice consumption device and will be sure to impress your friends because it has an apple logo on back, get an IPad.If you are looking for something that can get some real work done without sacrificing fun, and yet provide be ultra portable.  Go with the ASUS VivoTab Smart", "Title": "Microsoft and ASUS Got it right!", "Date": "April 22, 2013"}, {"Author": "Tremayne A. Green", "ReviewID": "RVTBKPJX0148M", "Overall": "5.0", "Content": "So I usually don't do reviews but as I spent a lot of effort in reading reviews on all the various tablets I figured I would contribute to the review community to help the next person along.  First off let me say that the ASUS VivoTab Smart is truly a viable alternative to a standard laptop for your typical business user without having to break the bank.This thing runs all your standard MS Office apps (including Viso and Project) without a problem and once you've added in the Transsleeve keyboard its just like working on a standard desktop or laptop without a problem.  You can even use external CD players and HD (if they have an alternative power supply).  The only minor complaint is that unlike the VivoTab RT version this one can't dock with a keyboard so typing is a bit uncomfortable (but I just carry a 3 ring binder with me now and use it as an keyboard try and now I'm back to the ergonomically correct position).  Battery life on both the Vivo Smart and the keyboard is pretty good, I can go about 2 days between charges with heavy usage and I've gone a whole 6hr flight with no issues.I looked all the Windows 8 tablets including the Surface, the HP Envy, Samsung, and Lenovo and I have to say for the money this is by far the best value.  I haven't had any issues with the ASUS live update (I downloaded the updated version and had to run the install from the folder myself) nor any issues with the HW.  As long as you aren't looking for a game machine or trying to do any heavy duty photoshop work I think this would be a great machine for the price.", "Title": "Great Tablet for Business Users", "Date": "March 20, 2013"}, {"Author": "Glenn R", "ReviewID": "R35X3QZSGWQ6TY", "Overall": "5.0", "Content": "I was torn between the VivoTab Smart and the ThinkPad Tablet 2 and ultimately chose the Asus product based upon the price and the good reviews.  Plus I don't have much need for a stylus and VivoTab's cover/stand/keyboard (the \"TranSleeve\") setup seemed much more svelte than the ThinkPad approach.I've had the VivoTab for about a week now and I am incredibly happy with it.The good:- Great, simple, sturdy, compact, lightweight design (I particularly like the backplate, which magically repels fingerprint marks and smudges somehow)- Impressive battery-life (I haven't done any tests but it really seems to sip power)- Smooth, responsive performance (except for some slowness when you make big updates or installations, as others have noted)- TranSleeve is an elegant and functional cover/stand (I find the magnetic grip just fine and the origami easy to master, contrary to some of the other reviews)- A great tablet experience for reading, watching video, checking e-mail on the go plus all the productivity of a full Windows 8 \"desktop\" experience whenever you need it- Extremely portable keyboard with a good typing experience (slightly cramped, but I think it's one of the best you could possibly get for a 10\" device)- Love the micro-USB charging port on both the tablet and the keyboard -- so much better than having to carry yet another proprietary cable and charger aroundThe bad:- The selection of tablet-oriented apps in the Windows store could use some improvement of course, but I have ultimately found great alternatives for everything I relied upon for my Android devices (biggest miss is a dedicated GMail app with one-motion archiving and super-fast search capabilities, although my GMail works great through the native Outlook client and I actually much prefer the design and readability of Microsoft's approach)- Navigating the OS, changing settings, tweaking preferences, etc isn't as intuitive as what I was used to on Android- It makes me anxious to sandwich the keyboard in between the screen and the TranSleeve when carrying the whole kit around, even though I assume it is designed to withstand lots of abuse; I tend to leave the keyboard loose and put it on the outside of the cover rather than sandwich it in- Sound, as everyone else has noted, is pretty weak from the speaker- The screen seems much more reflective than other tablets, although it could be because I have been using it in office environments with lots of overhead lights (as opposed to airplanes and on the couch as I have with other tablets)Overall, I think this is the best possible entertainment/productivity/portability mix you can buy right now.", "Title": "Finally a solution for both entertainment and productivity in a high quality tablet", "Date": "March 8, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2AYHT7UBYK0NF", "Overall": "4.0", "Content": "You can't help comparing any tablet to the iPad so I will too.  The iPad has a higher resolution and it is a little heavier.  If you want a E-reader of sorts, that weight matters.  The wide screen in portrait mode feels odd.  Even though the battery life for both are similar but it is really dependent on the usage and I use Windows more than IOS.  No fans so it is quiet.  64GBs doesn't seem like a lot especially when you didn't install anything and it tells you 30GB free, I popped in a separate 64 GB Micro SD.There is a certain level of expectation you for an Atom processor and the integrated video card and that level should be low.  It can not handle any heavy duty games.  It was able to handle 720p Youtube videos but 1080p stuttered.  I was very surprised that the Metro version of IE worked quicker than Google Chrome.  When I was showing it off, my friends would load up 5 or more apps and then it would hang to the point I would have to restart it.  Not the greatest of demonstrations but you know what you are getting into with the Atom but the restart was under 25 seconds.Hardware notes:It doesn't charge when you plug in the micro USB cable into another PC's USB port and it doesn't show up as an external drive or anything.  That would have been cool but I didn't expect it.  Not having a standard USB port is a big miss.  The front facing camera is very grainy.  The back camera is clear but I am not one of the people that takes pictures with a 10 inch device.  The Windows key for the new Start menu responds way too slow.  I think that is an Asus issue vs. a Microsoft one.  I swipe the left side for the Start menu because that is faster.  The speakers are pretty good.  There is a micro HDMI on the side that outputs at 1366x768.  The micro HDMI cable had a hard time staying in there because both the cable and port are small.  Speaking of the screen resolution it is low.  A large virtual keyboard, small screen, and a low resolution is not a good mix.  There is a light sensor on there - it will drive you crazy and make you think something is broken so just disable it and you will revert back to normal.  Trust me when I say you will revert back to normal.  I bought the TranSleeve Keyboard but never used it.  I gave it an honest effort as a tablet only.  I didn't want to make it bulkier or the battery to last a shorter time.Tablets like the Vivotab are really more a companion device, this is NOT suppose to be a full replacement for your desktop or laptop.  Do not compare it to something that has an i7, 16GB of Ram, 2GB video card.  Don't even put in on the list with them.  If you compare devices in the $500 range, it'll be hard to find something better.  The VivoTab is cheaper than the iPad and Lenono Thinkpad 2.  If the Thinkpad 2 and Vivotab were next to each other at the same price, I would have pick the Thinkpad 2.One may argue Windows 8 is not good but in tablet form, it works really well.  I really like it.  Windows 8 on desktops is a different story and that negativity is not towards this product.  If you lower you expectations and not compare the Vivotab to something high end, you'll love this tablet.  If price isn't an option, you don't want this.  Get the Lenovo Helix or Razer Edge.Small update on 3/24/13: I am still happy with this tablet but the ASUS notification center keeps coming up with the same to updates.  No matter how many times I install the bios update, it keeps telling me to do the updates.  I believe that is more of an issue with ASUS and not Microsoft.Another update on 4/4/13:  Asus sent another update where the notification problem is no longer there. Good job Asus!  I got the Razer Edge Pro and that is really big with no GPS or rear facing camera.  If I didn't get the Vivotab 1st, I would be singing praises for the Razer Edge Pro but I give credit to where credit is due.  Asus did a really good job and Vivotab is my measuring stick for tablets.  I used the Vivotab every day I got it and for the Facebook, Youtube, Netflix, Hotmail, news feeds, usage I had for it, it was great.  I never expected it to play game but it handled low end/casual gaming fine too (Angry Birds and Fruit Ninja).  The GPS was something I thought I would never use and it lasting 8 hours was great.  I would recommend it to anyone looking for an iPad or in the tablet market.  I unfortunately never tested anything Bluetooth related.  CAN'T WAIT FOR A 7in MODEL!!!!", "Title": "Great portability", "Date": "March 7, 2013"}, {"Author": "Chode", "ReviewID": "R2BVD56YFZYZOQ", "Overall": "1.0", "Content": "I'll start by saying I'm a rather forgiving guy. We all make mistakes. I'll continue by saying Asus was my brand of choice. I have two Asus monitors that work great, an Asus mouse, and an Asus motherboard. I've bought various other Asus products over the last decade or two. No more.I bought an Asus router (yeah, I know, this is a tablet review, but bear with me). It would disconnect frequently. Per their request, I RMA'ed it. They sat on the unit for 3 weeks after they received it. Nothing happened until a service rep followed up directly with their repair warehouse. I got it back, it's worked well ever since. Okay, one mistake, no problem. All's forgiven. I moved on.I buy this tablet two months ago. It worked okay for a week. It developed a problem where you hit the power button, the screen would turn off for 2 seconds, come on for a second, and then turn off. When turning the screen on from sleep, the unit would sometimes power up the screen for a second, then immediately go back to sleep. The problem was sporradic but grew increasingly more frequent until the screen would no longer power up. RMA #1 - the screen powered up. The problem with off-on-off behavior still happened. RMA #2 - they replace the LCD screen and \"fix it.\" I get it back, the problem still happens with no change in frequency. It's like they didn't even test it to see if they fixed it. They just tried something, powered the screen on once, and hoped it would work. They want me to send it back in for RMA #3 and won't offer me any assurance of a proper fix nor even swallow the piece of junk and send me a new one. I have to hope their repair warehouse people somehow learned to do their job and repair it or decide they can't fix it and send me a new one. No guarantees and my warranty time is ticking away. Of two whole months since buying this thing, it's been in my possession for about 8-9 days (it seemed to perform well despite screen issues in that time). Plenty of apologies, no results, and no complimentary items/discounts/vounchers to make up for awful service. They \"graciously\" picked up my shipping costs on the second round and are doing so for the third as well. Whoa, talk about generous!The moral of the story: Asus will not simply replace your unit if you buy one that is defective. You're at their mercy to get the repair right, which my experience suggests is unlikely. Their customer support is completely impotent and will only tell you to send it in. If you must take your chances by buying Asus garbage, at least do it through Newegg where you can RMA it directly back to Newegg for a refund or new unit with very little hassle.", "Title": "Defective unit and Asus support has been awful.", "Date": "July 31, 2013"}, {"Author": "Nicholas Carriker", "ReviewID": "R1F3190I9JRZCB", "Overall": "5.0", "Content": "Easy to use; also bought the keyboard which took awhile to figure out how to use, but is slim enough to store with the tablet and not need any more room or really notice it is there. Every once in awhile I have problems with the touch screen, but basically I would recommend this tablet AND buy it again. My brother has the ACER version with the keyboard with battery pack and I think the keyboard/battery pack just makes it too heavy - might as well have a laptop.", "Title": "I think I basically got all the same bang for the buck as I would have had I paid $500 more and got a Surface 8", "Date": "June 14, 2013"}, {"Author": "Anatole", "ReviewID": "R22FFCNUVX7DVX", "Overall": "5.0", "Content": "Have tried quite a few different tablets, before buying this one: iPad, iPad mini, several popular Android-based devices. Was looking for something more mobile than a common PC/Notebook, but at the same time, not so much \"dumbed down\" if talking about productivity.I am MS Surface RT owner from when it was released, but I was/am disappointed with applications availability for Windows RT. So while choosing next tablet for my family, I wasn't even looking at Windows-based ones. And almost bought an iPad because of its strong applications base.The day before buying an iPad I saw ASUS VivoTab Smart ME400 at my local vendor's web-store.The power (1.8Ghz x 2 cores), weight (580gr), design and full Windows 8 with all its desktop apps compatibility became an instant buy for me.I don't understand people complaining about under powered Atom Z2760 processor. For such a slim device it performs amazing. It opens metro apps 2-3 times faster than my Surface RT (with its quad-core Tegra). I even was able to play some desktop games from Steam - \"Heroes Of Might And Magic V\" runs at absolutely playable frame rate.So, I can strongly recommend this device to everyone, who is a PC user and is looking for some Tablet experience in this age of mobility.You will find it the best of two worlds.", "Title": "The best of two worlds", "Date": "June 14, 2013"}, {"Author": "Jared P. Katz", "ReviewID": "R31G9W403YD0J", "Overall": "4.0", "Content": "I've had this tablet for a week, upgrading from an Android tablet.The hardware quality seems really good.  The touch screen is very responsive.  The cameras work well, and the rear camera has a flash, which is nice if I ever use it.  It is nice and light and very thin.Now for the user experience.  The Windows 8 experience is much better on a tablet compared to a desktop.  Even then, it wasn't entirely intuitive.  Fortunately the tablet comes with a quick start guide.  It is definitely worth spending 5-10 minutes reading and practicing that.  Once I got the gestures and nuances down, I quite like it.  The live tiles are great, with updated headlines, weather etc.  It makes the Android interface, with it's static icons look boring.  It is a bit hard to figure out how to arrange and \"snap\" the tiles to the right place.  The Windows 8 app store is a bit bare, but there are some decent apps with looking.  But the best feature is that it can run any Windows program.  So for example, there is not a Spotify app yet, but I can run the desktop program as a substitute.  I installed Microsoft office and it runs great.The first couple days out of the box, there were loads of updates for drivers and software patches.  The tablet crashed two or three times during the first day or so.  Since then, with all the updates, it has been rock solid.The machine runs very smoothly also.  I heard reports that it could be \"laggy\" in desktop mode, but I have not found it to be so at all.  Of course, I have only run simple programs like web browsers, Word and Excel.  But they run fine and switching between them is very fast.  The best part of having full windows on a tablet is that I can hook up a wireless keyboard, mouse, and monitor and use it for basic computing tasks, just like a full-size computer.The user experience isn't quite as refined as Android in some aspects.  For example, when listing to streaming music, the tablet isn't smart enough to keep the internet connection live after it goes to \"sleep\".  I need to see if there is a power management setting to change.  Also, Android is smart enough to shut off the music if I turn off my bluetooth headphones.  This is not, and switches the music to the internal speaker.The battery life is very impressive.  I used it moderately for 48 hours without charging it, and it still had 40% left!  So overall, this is a promising product that will only get better as there are more apps, small refinements, and a bigger market share.", "Title": "Very promising device with some rough edges", "Date": "May 24, 2013"}, {"Author": "K. Aragon \"K. Aragon\"", "ReviewID": "R3NAWW3V8I2WU4", "Overall": "1.0", "Content": "The table always freezes, which then causes any saved work to be deleted. I might as well revert back to paper and pen.", "Title": "FREEZES CONSTANTLY", "Date": "May 3, 2013"}, {"Author": "Matthew Redmon", "ReviewID": "RGI1R6Y5VS1VL", "Overall": "4.0", "Content": "I had the same problem as the one of the other reviewers after attempting to update Windows 8 and apply the 2 ASUS updates (BIOS + software) at the same time.  Don't do that :-)  The tablet was stuck in a diagnosing/repairing windows loop and none of the repair options worked.Eventually, I solved the problem:[...]After resetting successfully, I recommend applying all the Windows 8 updates first, THEN the ASUS software update, THEN the ASUS BIOS update.  And then make a backup image of your computer in case you ever need to reset everything.The tablet is awesome... it's faster than the Android tablet it replaced (Wife broke a bottle of wine over it), it runs all the programs I want it to (plus the Zinio app for reading my magazines), and it looks great.  I had no problem using a microUSB to USB adapter to access a flash drive and use a wireless keyboard/mouse.  No problem with the microsd slot with the class 10 32GB card I have in it.  It was frustrating when it was in the repair loop and I couldn't exchange it for a new one (local stores didn't stock the tablet and the online store I bought it from was out of stock for \"2-3 weeks\") but now that it is fixed, I couldn't be happier with this tablet.", "Title": "Great tablet (after fixing it)", "Date": "March 25, 2013"}, {"Author": "bbzippo", "ReviewID": "R3J5JI16BRQNSD", "Overall": "4.0", "Content": "Pros:Great form factor, light weight, very descent performance.Cons:Asus Live Update software: keeps telling me that 2 updates are available, even though I have installed them and rebooted multiple times. No way to verify if I have actually installed the updates.The Windows button (on the bottom edge of the screen) has stopped working for me a few times. A hard reset fixed that.Eats too much battery in sleep. Switching to airplane mode helps a bit. But I really recommend to fully shut down when you are not using it, if you want to save the battery: it boots up very quickly (under 30 sec).", "Title": "Meets expectations", "Date": "March 21, 2013"}, {"Author": "Amazon Customer \"Fred\"", "ReviewID": "R1GBVRAVA8RH3", "Overall": "3.0", "Content": "On the plus side, this tablet gives you full Windows compatibility in an amazingly small package if you combine it with the transleeve keyboard and cover. I can run Windows 7 applications, and more importantly for me, VPN clients that aren't available for iPads or Android. But realistically, a screen this small has some real limitations. The touchscreen interface works well, but in the desktop mode icons, dropdown boxes, etc. are difficult to touch in the right spot. The touchpad keyboard helps a lot. In the \"modern\" tablet mode, the dearth of apps is readily apparent if you have an Apple or Android tablet to compare it to. And some of the apps are buggy and don't run nearly as well as on the other tablet OS's.I will also confirm that with an OTG cable, you can connect the micro USB port to many USB devices, although power will be required for some.Like others here, I have the problem that the Live Update won't connect to the server, and the wifi appears to reconnect but doesn't transfer data when resuming from sleep. I've gotten in the habit of doing a full shutdown instead of sleep because of this. Contacting Asus support resulted in suggestions to either do a factory reset, or RMA the tablet back to Asus, neither of which is reasonable or necessary. They just need to fix their Live Update and get their network adapter driver fixed. Also, as others have reported, the sound is just awful. You have to turn up the volume all the way to just barely hear a Netflix movie in a quiet room.I'm seriously considering returning it, not as much because it doesn't do what I need, but because Asus has such poor customer support and seems to have already orphaned this product a few weeks after releasing it.", "Title": "A potentially nice tablet with some problems", "Date": "March 2, 2013"}, {"Author": "txpressmen", "ReviewID": "R279H0BWUPOASG", "Overall": "2.0", "Content": "I got it out of the box and was happy it was half charged, I was so excited I went right to work. I am new to windows 8 and was just getting a few apps setup when it told me to plug in. That was all she wrote micro port was bad could not plug in battery charger. I think the next one I buy will have a full size USB port. Amazon was super to work with.", "Title": "A teaser micro usb port bad.", "Date": "February 23, 2013"}, {"Author": "morbius2k10", "ReviewID": "R1JT2KZHHGWMO0", "Overall": "1.0", "Content": "So, I bought this vivo smart tab with windows pro 8, within a week the touchscreen stopped working. I called customer service, they said to buy a keyboard for it and a specialty cable (usb otg) which I did, called them back, they had me reset the tablet, which wiped out all my files AND programs like office 365 and ALL apps I loaded. Still no response from touchscreen.They sent me an e-mail to mail it back to them, I did. They said they'll have it repaired in 5-9 business days from receiving it. The tracking shows they signed for it on Tuesday April 30 2013, the on-line status showed not received on Wed May 1, so I called back. Was told there are \"so many repairs for the service center they dodn't have time to enter them in the system as they come in, that will take another 48 hours. I wait, same thing. I call back. Spoke with a supervisor who said they'd check and launch an investigation, they'll call me back the next day. They never called. I called back, asked for that supervisor (who told me they could transfer me to him), they can not transfer me to anyone, just put in a queue. I waited and they said a supervisor would call me back in a few hours. No one called. I called back, they put a supervisor on the line, I explained it all, he said the same things and promised he'd call me back within 24 hours. He never called.I called them again, was told a supervisor would call me in a half an hour. They never called. I called back in, got onto the supervisor queue and the original supervisor answered. I asked why he never called me, he claimed he couldn't log into his system (great products here, folks...even their own \"experts\" can't get them to work!!!), he said he'd launch an investigation that would take 48 hours. I reminded him he supposedly already did that over 48 hours ago (even just business hours it was over 48)..he said he'd have to get on the phone and call them, saying I'd have to call him back on my lunch break and hope I get him on the queue...ridiculous, terrible customer service...the online system now says my RMA number (their reference) no longer exists.I have NEVER received any of the numerous promised call backs and have had to call them every time. Each time you call, you have to give them all your information all over again (which they read back to you in broken english, painfully slowly), which all in all takes about 15-20 minutes after you tell them the same story they are probably reading on their screens (if they can log in!)...AVOID THESE PRODUCTS LIKE THE PLAGUE...ONCE THEY BREAK YOU ARE HOPELESSLY AT THEIR IMBACILIC MERCY!!!!!!!!!!!!!!!!!!!", "Title": "TERRIBLE CUSTOMER SERVICE!!!", "Date": "May 7, 2013"}, {"Author": "P. Rodriguez II \"eReader\"", "ReviewID": "R2YHC2GC7VBILQ", "Overall": "5.0", "Content": "I bought this tablet not with the intention of replacing my desktop but with the intention of preventing me from needing to turn it on to do simple file explorer tasks such as file deleting, moving, and renaming. I also wanted something with a full browser to pay bills, print, and surf with. I have been a happy iPad 1st generation user all these years. But where the iPad shines in games and media, it falls flat in giving a true internet experience and it has no real good way of navigating file systems. I have been patiently waiting for a true Windows experience in a tablet at an affordable price and I think the Asus VivoTab Smart finally delivers it.Out of the box the tablet is beautiful. The back is plastic but it feels high quality and has no flex. I powered it on and went through setup. I knew that there would be updates so I went to the Windows update and let it do its thing.I don't know if I am just impatient or what, but I thought it took an inordinate amount of time to get going. The tablet was sluggish for the first 48 hours of its life. Additionally, my wife and I have windows phones and are happy Google calendar and contact users which seemed to work well. These services are no longer supported with applications that cannot do \"two step authentication\" with Google's servers-which the built in mail client cannot. Further to that the WiFi kept dropping its connection. It was very, very disappointing. After all the reviews I had read recommending this tablet I was having buyers remorse.Well, after 48 hours the tablet still wouldn't speed up and I felt it was connected to the WiFi issue because it seemed slowest during network activity. I flexed some Google fu and found that other people were having the same problems. After reading some solutions I went to the control panel from the desktop, opened device manager then network devices and found the network device. I opens the properties window, went to the advanced tab and scrolled to bandwidth. I selected 11b/g 20/40. I hit okay and exited. WiFi problems fixed. Tablet now runs like a dream. No dropouts since fix...granted its only been a day but considering it dropped every five minutes before I count this a success. As an advisement, this solution works for my network setup, It won't necessarily work for yours.As far as the Google calendar/contacts issue, Google let's you create a special password for programs don't work with its new authentication but I was unable to get it going. It would always throw me an error. My solution was to let my windows live accounts access my Google account information and essentially merge the data. Now all my information is accessible through my windows account. This works for my wife and I but it may not be ideal for those outside of the windows ecosystem.After fixing these issues I love this device. It is zippy with the internet. The file explorer is very useful and does its thing very well. The gesture unlock is a pretty cool feature. It types pretty well...I'm typing the review on it now. If you're willing to work out any kinks that may pop up instead of just giving up, I highly recommend this tablet. If you're easily frustrated by little things and your Google-fu is weak, I still recommend it, just hope that your network configuration is better than mine '", "Title": "Zippy Little Tablet Once it is Setup", "Date": "March 7, 2013"}, {"Author": "B. Harris", "ReviewID": "R17R7GJDHNWHVF", "Overall": "1.0", "Content": "OREDED THIS TABLET, HAD TO SEND BACK ONCE FOR A TOUCHCSCREEN ERROR, RECIEVED A NEW ONE IT WORKED A BIT LONGER THEN THE SCREEN BACKLIGHT WENT OUT, NICE TABLET, NEEDS TO GO BACK TO THE DRAWING BOARD, NEEDS TO BE FLAWLESS, LIKE IPAD,SORRY!", "Title": "trash!!! TOO MANY MANUFACTURING DEFECTS!", "Date": "July 28, 2013"}, {"Author": "gmangonzales", "ReviewID": "ROJOMYBDHOCFU", "Overall": "1.0", "Content": "used tablet is sorry piece of $@!%, keeps blacking out then keeps back and fourth when working with it then it works good when it wants.", "Title": "Sorry tablet", "Date": "July 9, 2013"}, {"Author": "David L Mattingly", "ReviewID": "R368Z0U7N29T4V", "Overall": "5.0", "Content": "I haven't used my notebook since purchasing this tablet.  At home I use it in my chair, in bed, in the kitchen. At work it keeps me mobile since I am in and out of the server room.  Plus, the tablet let's me get out of my cube more and stand to work instead of sitting all day.Windows 8 is great.  I found the new start screen better than start screens of old.  My kids love using the touch screen and Windows 8.  Windows 7 and XP were bothersome to both my 9 and 5 year old.  They navigate Windows 8 with ease.Only thing I would change about the tablet is maybe put the speakers on separate ends of the tablet.  They are both located to the left of the screen on the back.", "Title": "Anywhere device", "Date": "June 8, 2013"}, {"Author": "Dee-Es", "ReviewID": "R2IYR3CS4VXB80", "Overall": "4.0", "Content": "I really like this tablet as well as Windows 8, which I think is the future. I don't know why more people aren't using the Windows 8 tablets over the iPad, which I think is just a media machine. This tablet has full Windows 8 functionality, including Microsoft Office and has pure multi-tasking, the biggest annoyance on the iPad. Sure, Windows 8 needs some work (keyboard, apps, etc). The reason I give it 4 stars was due to those very reason - keyboard and a lack of apps. But after having owned an iPad for a short time, I realized that Windows 8 tablets should be the future to every organization out there. I'm looking forward to the variety of devices that will run Windows 8 metro as well as the full blown version!", "Title": "Great tablet for the productivity type", "Date": "May 28, 2013"}, {"Author": "CC", "ReviewID": "R3JZ6DVV118NNO", "Overall": "4.0", "Content": "Nice tablet with one huge drawback... no usb port.  It has a micro usb port and I've tried to find an adapter and one has been on order from amazon for almost a month.  I've tried a different adapter and it didn't work.  I contacted support and they said they think it's just a port for power - not to connect a usb device.  This was a huge oversight. The advantage of this tablet is that it has a full windows 8 operating system so you can have a ipad experience while still having the power of a full pc.  Most full pc's I know of have a usb port so that you can connect to it.  If you know of a workaround, please leave me a comment.  Thank you!UPDATE: I did finally get the USB to Micro USB adapter.  I plugged a thumb drive into it and it worked! What a relief. Those adapters are so hard to find, ASUS should include one in it's package.  I will bump it up from 3 stars to 4 because I can actually use USB devices now.", "Title": "No USB port", "Date": "May 21, 2013"}, {"Author": "DEALHUNTER", "ReviewID": "R1RL448Q18UWAY", "Overall": "5.0", "Content": "The ASUS ME400 is not just the best value windows tab, it's my personal favorite by far! Any negative reviews you will find are likely old (before ASUS released driver updates), or the person did not update the tablet to the current drivers before using it, period. I bought 12 of these for my business and we are all in LOVE with this unit. SUPER FEATHER LIGHTWEIGHT! SUPER LONG BATTERY LIFE!I've used both this and the 800 model and would always choose this model! It's lighter, more portable, twice the battery life, no noisy fan(s), never freezes or slows down and can handle all day to day computing with lightening fast response. I've not had any problems even editing video, or photoshop'n. Perfect, just perfect. LOVE ASUS and Windows 8 blows IOS and Android out of the water for productivity, hands down, no contest!I wouldn't trade this unit for any other, regardless of price. I'm a VERY picky tech person BTW. The ME400 is Windows Tab KING!", "Title": "BEST WINDOWS TABLET!", "Date": "May 13, 2013"}, {"Author": "MsEE", "ReviewID": "R1XJ0SXCI71BII", "Overall": "2.0", "Content": "I bought one of these two weeks ago from Amazon, with the dock and sleeve.I returned it early this week as defective (it was.)Certain parts of the screen were sensitive, and touching there cause it to hard shut down in a flash (no saves).Setting it, even very lightly, on a hard surface also caused it to hard crash.Turning it upside down did the same thing.I returned it, no exchange, and Amazon has already refunded my money for the tablet and the dock, minus return shipping on the dock.  So Kudos to Amazon for taking it back without problems, other than charging me shipping to return a defective item's accessories (when they went back in the same box.)Favorable recognition to ASUS:  After posting this, ASUS called to express their dismay at my experience, and offered to work with me on it.  Many thanks to them, and had I not already ordered another tablet I feel that, given a chance, they would have made good.Otherwise:I would have liked the tablet otherwise.  Some comments:- Be aware it uses a USB to charge, but it will not charge from a standard 1amp charger.  In fact, it won't even charge from a 2 amp charger other than the one it comes with.  Apparently, there is a handshake going on there that just applying the voltage for USB doesn't satisfy.  I tried 5 different chargers - only the ASUS would work.- And also be aware that the ASUS charger sells separately for about $55.00 - which is a bit much.- Screen was sharp, the image bright, and windows popped up quickly- And it is light- I liked the box it came in.  It was tight, and convenient, easily reclosed, and I would have kept if for safe routine storage of the unit and maybe travel (when packing a lot of gear) if I had kept the tablet.Now some comments for those unfamiliar with Windows 8 (I was):- if you are buying Win8 to avoid learning a new system, and are used to Win7 or less - forget it.  You will be learning a whole new system.- Win8 lacks many of the settings and controls of Win7.  You will miss them.- Amazon unbox plays just fine, and so does streaming from the Amazon Instant VideoWhat I greatly lament:  I bought two Acer Iconia's, with Win7, from Amazon last year and loved them.  But they were passed on to others to use.  I really wish I had kept them.  I would buy one again, despite the weight, to get Win7.", "Title": "Flakey out of the box", "Date": "May 2, 2013"}, {"Author": "F. Kunz", "ReviewID": "RNRGFRJXYV0LB", "Overall": "5.0", "Content": "Great Value. Cheaper than an Ipad. Great functionality - can run all my windows apps plus native tablet mode.  Feels easy on the hand - balanced and even weight.I only wish they offered a 128 GB model.", "Title": "4.5 Stars", "Date": "April 10, 2013"}, {"Author": "Lynn's fancies", "ReviewID": "R46QDAFNZQ80Y", "Overall": "5.0", "Content": "I researched the different brands and wanted the size and features of the \"I\" brand, but discovered this one with 64G and expandable at less than half the price.  And it has a flash drive.  The screen is terrific, too.  I love the WIN8 system.  I'm spoiled now!", "Title": "Just what I wanted at half the price.", "Date": "March 28, 2013"}, {"Author": "M. Rogers", "ReviewID": "R4I6RV17IUS6U", "Overall": "4.0", "Content": "Finally a reasonably priced tablet with true Windows 8.  I had been looking at the the new Surface tablets but the price was simply out of line.  This tablet comes in a nice package, light and sleek, with more than acceptable performance and 64 GB of memory and at less than half the price of the Surface tablets I couldn't bring myself to buy.  It doesn't come with Office, but that's not a deal breaker for me.  I had a specific purpose in mind and can purchase an Office license if I need it later.  My biggest surprise and disappointment so far has been with the SD and HDMI ports.  I was trying to access the SD port, which had a cover over it, and somehow managed to push the cover inside the port.  I have not been able to get the cover out and it has made it impossible to use an SD card.  I haven't tried hard to remove the cover of the HDMI port, but it is similarly difficult to remove.  I will be taking it back to the store to replace with one that has a working SD port.  It seems odd to me that they would have skimped on this when the rest of the device seems so solid.Overall a very good tablet for a reasonable price.******* Update:After a few more days of use and a number of reboots for configuration changes, the tablet suddenly blue screened on me.  I can usually work through most Windows issues, but in this case it was an error in the boot configuration being corrupt.  On a desktop or laptop I could likely resolve this but there are limited options with the tablet.  Since I'm going to replace the tablet because of the SD port anyhow, I'm not putting anymore effort in to it.  Hoping this is an isolated issue, but I have to admit it has me a little unsettled.", "Title": "Very good value with a couple surprising cut corners", "Date": "March 4, 2013"}, {"Author": "rengem88", "ReviewID": "R1FRCUW15XGEW9", "Overall": "4.0", "Content": "I sold my Asus Infinity to get this because after 6 months I realized that the limitations I was experiencing on Android were too much.  I was really excited to get a tablet with full windows 8.  I ordered the white from another website.  I was trying to get the matching white keyboard and sleeve but apparently they have been discontinued.  So annoying.  Why make the white tablet but not the matching accessories?  I wound up buying the black keyboard set. So that's one con.  Can't match it.  I was absolutely thrilled when the tablet arrived.  I really like the look and feel of Windows 8 tiles.  The tablet was very intuitive setting up, fast, bright, clear, sleek.  I like the white, but I wish when they make a white tablet, that the front frame could also be white.  No biggy.  I don't mind the desktop mode.  I do not find it cumbersome, small or slow as others have mentioned.Here are the problems I have had in the 4 days I've had this.  Sometimes the screen will freeze out of nowhere and there's nothing you can do but force it shut.  I wanted to send a photo from my phone to the tablet.  Want to talk about a nightmare!?  I made sure bluetooth was on. My cell is always discoverable.  I went into the bluetooth settings on the tablet and checked the box to allow other devices to see my tablet.  When trying to pair, the progress bar would start to show the pairing of the 2 but would disappear immediately.  It would show my added phone as offline even though it was on and discoverable.  I could send a file to my phone but when i I tried to send to the tablet it would not send.  I tried my laptop, said service not available.  Tried another phone.  File not sent.  Called support.  They told me to refresh my pc.  My tablet crashed while on the phone with support and they said, whoops, can't telly you why that happened.  but refreshed my pc, didn't work.  Called again.  Told me to update my drivers.  Didn't need it, had the latest.  Called again, they told me to reinstall windows.  Did that and it didn't work.  Next day, refreshed my pc tablet again.  Noticed the link in bluetooth settings that says send or receive file.  The receive file box just explains that you might get an automatic message when someone tries to send you a bluetooth file and you will have to accept it.  I had left that open once before when trying to receive thinking maybe it had to be open.  Finally it worked.  You have to manually open that box up when receiving a file. There is not automatic message.  You can't be in another window or app when receiving a file.  That box has got to be open and in front of you. Seems so complicated and archaic.  A lot of guess work.  Why couldn't Asus have created an alert as well?  None of the support people at Asus ever even mentioned having to open up a receive a file window prior to receiving a file.  Oh an my tablet crashed a second time the second day of working out the bluetooth issue.  When pairing my devices this time, I noticed that the progress bar took several long minutes to complete the process, unlike the first 100 attempts! I understand these things can happen and there are always bugs and issues.  I am not having anymore problems.  You get a great bang for your buck with this tablet.  it also feels good quality as well as the keyboard.  Overall I am pleased and would only have chosen the surface over this but I couldn't justify spending twice as much for the surface pro, but i do love their kickstand and keyboards!  All tablets should have kickstands.", "Title": "I like it a lot but had some problems..it happens", "Date": "February 28, 2013"}, {"Author": "reginald edwards", "ReviewID": "R3EQ8AOG3ZMU55", "Overall": "4.0", "Content": "Nice build on this tablet, very responsive and the touch is smooth and fluid. Asus I believe has brought us a solid windows 8 tablet to the table.", "Title": "Very Nice", "Date": "March 17, 2013"}, {"Author": "Dionne", "ReviewID": "R1R1YED9KE7EE2", "Overall": "4.0", "Content": "Tablet works well, Battery life is fair with average use you will get about 8 hours. BUT THE SPEAKER IS THE WORST full volume but you can not hear TERRIBLE", "Title": "Good Product", "Date": "March 10, 2013"}, {"Author": "D. Le", "ReviewID": "R1Q44XO7BWKK39", "Overall": "5.0", "Content": "This is a solid tablet. Once the bios, the drivers and windows are up to date, it's very stable. I had no trouble updating the device.However, if you have trouble, you should search online for the drivers. Members of some forum have collected all the necessary drivers so that you can download and update your device manually. This is a great tablet, so don't let the driver updating problem hold you back from enjoying it.", "Title": "Asus Vivotab smart review", "Date": "March 9, 2013"}, {"Author": "Matthew D. Snyder", "ReviewID": "R5OIQQQKO8YBN", "Overall": "4.0", "Content": "The new Asus ME400c is a pretty good windows 8 tablet for the same price as an iPAD.  I almost didn't buy this because Asus marketing and promotion is so terrible I couldn't find any mention of it on their website(s).  Even though it is labeled as the Vivotab, it is actually the Vivotab Smart.  There is no mention of this model number on Asus's website.  Considering its great price point, Asus really droppped the ball by not having better marketing and promotion.The actual tablet is of decent build quality and feels nice to hold.  I really like the widescreen format (as opposed to the more squarish iPad I own).  It has a nice quality rear camera, with an adequate front camera for skype or other video chat options.The powersaving CPU is quite a bit sluggish, as it often takes 5-10 seconds for a new app to load in.  Considering the tablet's great battery life and small size (no fans), its a trade-off I will live with.It also has some compatibility problems.  I am finding some apps don't work well with a touch screen.  Web browser controls such as flash movie players can have click and drag controls that don't function with a touchpad.  Because of this, I often rely on Win8's barren app store.  This puts a big limit on the programs I can use.  A Keyboard/touchpad cover would be a good workaround, but I couldn't find one (It was originally supposed to be bundled with one, but good luck finding it for purchase.)  You can use any small bluetooth keyboard or mouse, but you will have to lug it around.The Speakers on this tablet are not good.  It lacks stereo speakers, and the quality is not good.  Headphones are recommended for watching movies and pretty much a necessity for listening to music.As for the actual OS, it is hit and miss for me.  It crashes too much for my liking.  Programs sometimes simply refuse to start.  I have had to reboot my win8 tablet more in one week than I have had to do in 6 months with my Ipad.  Using the OS when it does work seems to be 50% fun and 50% frustration.  Sometimes Microsoft just refuses to do things in an intuitive way.  Perhaps if they hadn't bothered with the idiotic Windows RT OS and just focused on Win8 things would be a bit better.If you feel you really want a windows 8 tablet, this is pretty good.  The underpowered processor has enough of an upside to recommend this over some of the Core i5 versions (price, physical size, noise, heat being just a few reasons)  The lack of a keyboard cover clearly hurts this device, although it is supposedly avaliable somewhere to buy.  I couldn't find one.The Asus vivotab smart ME400C provides a price competitive windows 8 tablet solution.  When looked at this way, it is a big success.  The device's overall quality and performance doesn't compare to say, an ipad at the same price though.  Buy it if you want the OS and the intel x86 compatibility.", "Title": "Asus Vivotab Smart ME400C", "Date": "February 4, 2013"}, {"Author": "DP", "ReviewID": "R5P3X6MY6YZWS", "Overall": "4.0", "Content": "works well but returned it because it was not as zippy as i was hoping. going to try my hands with the surface pro.", "Title": "nice product", "Date": "November 29, 2013"}, {"Author": "S. Hamoudi", "ReviewID": "R3VG88A76H8C4G", "Overall": "4.0", "Content": "Received the tablet on time and in good condition. From the start I did not want an Android device or even worse an Ipad. Because of my frequent travels I needed a tool to replace my bulky corporate PC while being able to have the same applications in both. I did install all the application I needed and the tablet was excellent in that aspect. I can now leave my laptop in my desk and use the tablet to do almost everything the laptop does. I can  even stick my 4G dongle in the USB port via a micro-usb to usb adapter I purchased for 3$ and get connection on the go which was not possible in My Android device or Apple unless you get the 3G version for an extra 100$. I'm giving 4 stars simply because the Tablet cruelly lacks a second usb connection and can only accept charge during use if you use the ASUS charger and cable. If you use a different cable , it will only trickle charge on stand by or off  at 500mA which will take anything between 12 to 16 hours to a full charge", "Title": "Excellent tablet but lacks connectivity", "Date": "October 14, 2013"}, {"Author": "Johnnyp", "ReviewID": "R3JA803OUWPVPM", "Overall": "4.0", "Content": "After like a million software updates and restarts things seem to be working well with this tablet. I also had a couple PC crashes but that all seemed to be fixed after updates. Again at first this tablet will seem pretty bad, but give it some time and it will come around.Pros:feels pretty zippyweight and thickness are goodwindows 8 is nicebattery life is so niceincluded charger, charges my phone super fastfull windows!!Cons:really needs some sort of touchpad mode so i can navigate with a traditional pointerthe front camera seems a bit zoomed inno usb ports or even an included otg cableno dual boot availableOverall this tablet does its job well. It allows you to view the full web (flash and all) and lets you expand its very mobile form to a more laptop like form. This thing is pretty nice.Something to point out: When i experienced a crash i lost wifi. Connection troubleshooting wouldnt find the problem. But once I uninstalled and reinstalled the driver it was all back to normal.Update: Found a nice virtual touchpad app. It's called \"TouchMousePointer\" you download it at download.com. It works real good!", "Title": "Seems Legit", "Date": "August 30, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3FNH73N6X4215", "Overall": "4.0", "Content": "I had Samsung Galaxy tab before this and loved it, but it was Android and I wanted Windows so all my files and software would work on it.  It fired right up and took me through some setup choices.  Nice size and weight.  I wish it had one or two regular USB ports instead of just one micro USB port.  But I got an adapter so I can plug in my flash drives and that works great.  I have to figure out a way to charge AND use the adapter at the same time...or my wireless mouse and flash drive at the same time.  There is a micro HDMI port which I may have to get an adapter for as well so I can plug into a projector.I ordered a keyboard/case combo but can get by with the onscreen keyboard when I have to...it's just that the keys are a little too close for my fast fingers.So far I have MS Office Pro 2010 and Quicken 2011 installed as well as pretty many data files that I use on a regular basis, and still have plenty of room to work.", "Title": "Love it...needs...", "Date": "August 29, 2013"}, {"Author": "Hobbest", "ReviewID": "R2C2NNWF3NEPBY", "Overall": "5.0", "Content": "I bought this because my 8 year old iMac finally died. Wanted light, but a productive tool. Don't see the iPad as nothing more than a fantastic consumption toy. OS 6 seems a tad basic, closed and simple. In other words, I needed full Windows 8. Office is still light years better than iWorks. Windows 8 is easy to use and not just a consumption device. Do I wish the tablet had full usb port? Sure. Put 4 dollar adaptor in and that fixes that. Performance has been fine for my needs. I think a good value for the money. If you need more power and got 1000 dollars to spare, get a Surface Pro. Need a good value device for everyday use this is it.", "Title": "Good Value Device", "Date": "May 16, 2013"}, {"Author": "Joan L. Lovejoy", "ReviewID": "R1UYFPVKB3JMT1", "Overall": "5.0", "Content": "I really like this tablet.  Does everything I want it to do without having a laptop.  Easy to operate.  Like the bigger screen for reading.", "Title": "ASUS VIVO Smart Tab", "Date": "May 13, 2013"}, {"Author": "Robert Currier", "ReviewID": "R3J1R751VVDSCU", "Overall": "4.0", "Content": "I bought this tablet in February, and I've had some highs and some lows.  If your buying and using this as a tablet that can run the occasional Windows desktop program, then this is a great buy.  If you are buying this to be a PC first, this is not the device for you.  The main reason I bought this tablet was to have multiple multimedia sources.  Movies from Microsoft, Google Play, iTunes, and the Hulu website.  ITunes works ok, not optimized for touch at all.  High resolution video is very choppy if you play them in iTunes.  The native video app plays them flawlessly.  Battery life is great.  I've watched 9-10 hours of video and still had some juice left.Pros:  Display is gorgeous and responsive.  Battery life is really great compared to other laptops, netbooks, and tablets I have owned.  Pretty light for a 10 inch tablet  Runs the occasional desktop program ok.  Drives a tv display well via micro HDMI  Microsd card slot is a plusCons:  Speakers on this are really weak, headphones are fine.  Lack of dedicated full usb port is a bummer.  Currently use microusb to usb adapter  Microusb port is also used to charge the tablet, so no charging and using the usb functionality  Windows 8 apps somewhat lacking, but getting better.  Cover for micro HDMI port is a Pain in the a** to remove.Overall, a great experience if used like a tablet, great bang for the buck.", "Title": "Great multimedia tablet, very average PC", "Date": "May 11, 2013"}, {"Author": "Nita", "ReviewID": "R3M6PIB84WAJX5", "Overall": "5.0", "Content": "A must for everyone....  This is a very nice tablet.  Windows 8 is really hard to get use to, but the tablet is very high quality", "Title": "So glad I purchase this...", "Date": "April 25, 2013"}, {"Author": "Jeffrey Johnson", "ReviewID": "R10T55LKFHDQZF", "Overall": "5.0", "Content": "Battery life is great. I have had it for a couple of months now and no problems, It is a great bedside computer or for on the go...", "Title": "Better Than Expected", "Date": "April 15, 2013"}, {"Author": "jesus alvarez", "ReviewID": "R14KDPDMDYWUCF", "Overall": "4.0", "Content": "potente equipo con Win8 trabaja muy bien.Le instale Microsoft ofice 13 y trabaja sin problemas. Una desventaja es el micro USB queda inutilizado cuando el equipo se esta cargando deberia tener al menos 2", "Title": "rapido", "Date": "April 11, 2013"}, {"Author": "Gary C. Hammer", "ReviewID": "RL480KDOQ7PAB", "Overall": "5.0", "Content": "This has been a fine tablet for my wife who disposed of an iPad 3 because it would not work with Excel very well at all. The VivoTab does that and more. Great, bright screen. Battery using WiFi, viewing websites, OneNote, Word, and of course Excel, gives a full day's usage (8A-10P).App store? We use a few apps, but bought this for the Windows applications that we know and love. There is no larger collection than Windows applications. Period.Nice that it has NFC as I have a Windows 8 phone and it's cool to touch them and transfer whatever we want.Very fluid display, haven't seen hesitation on it. Swiping is extremely smooth.I like the USB port and we use the HDMI to connect to a monitor from time to time.I have no regrets with this purchase. It fit the bill and then some.", "Title": "Swell Windows 8 tablet.", "Date": "April 5, 2013"}, {"Author": "Robert Pawlak \"rjpawlak\"", "ReviewID": "R19R1IHSO7LIFO", "Overall": "4.0", "Content": "We purchased this tablet as a replacement for a netbook that had stopped working. It's got just enough power to do 95% of what most people use a computer for. It runs full MSOffice, and is a better solution than any Android tablet on the market (there is no comparison between the office wannabees on Android and the real thing on this tablet).Yes, there is a learning curve associated with the tablet, and one can't help but feel that MS could have done a better job integrating the windows desktop and tablet experience. In any case, it is nice to have both environments at times, since there are too many applications that don't exist in a tablet version.We haven't had any major issues with it except that Bluetooth tends to shut off, and then the tablet needs to be rebooted to get it working again. This is remedied by adjusting the power saving settings for Bluetooth, but one shouldn't have to do that - hopefully Asus will come out with a fix. Asus has also sent numerous OTA updates via LiveUpdate, so when one receives numerous BIOS updates, it does not give one the warm fuzzies about the technical maturity of the product.All that being said, I think it represents a good value for the money. It is certainly much more functional than an equivalently priced Android or IOS device.We're using this with a Logitech BT keyboard and MS BT mouse, and it works fine other than the power issue outlined above.****Update on 4/30/13 - The Bluetooth issue seems to be fixed now with the most recent updates. I've re-enabled power savings in the Bluetooth driver, and we haven't had any more issues.", "Title": "Good tablet for light business or home use", "Date": "March 26, 2013"}, {"Author": "Khris Ramella", "ReviewID": "R3KQAC20NW3SK", "Overall": "4.0", "Content": "Replaced my laptop for 80% of work and easier to carry! Light, battery is good, fast, Windows 8 takes a little to get used to, but it's ok.", "Title": "Just what I needed", "Date": "March 22, 2013"}, {"Author": "fernando lanza", "ReviewID": "R3IMDEE5P0CBL5", "Overall": "4.0", "Content": "The look is beautiful amid it works ok , not like a regular size PC but it still do its job. There are.some software that don't run well and it got freeze. But I just got it a few days ago, let way and see how it developed.", "Title": "Nice..", "Date": "March 21, 2013"}, {"Author": "nthany", "ReviewID": "RPI0I938LJKXD", "Overall": "5.0", "Content": "This unit is a small perfect 10\" companion.Great for web browsing, mails, chatting, watching movies, music, Skype, minor office presentation and more.ALERT, this unit does freeze up at times, hopefully a patch will fix this.All in all, great buy, very much contented.", "Title": "Great buy", "Date": "March 8, 2013"}, {"Author": "GM", "ReviewID": "R2IY6D6HU1EBSN", "Overall": "5.0", "Content": "Overall very good tablet.BUT wireless speed is limited to 65mbps. This is very disappointing, copying files from pc to tablet takes longer than copying to a usb flash drive.", "Title": "Nice tablet", "Date": "March 2, 2013"}, {"Author": "John", "ReviewID": "R31OPFDVATPQKS", "Overall": "5.0", "Content": "This is a very well designed and well manufactured tablet that has great looks, and really like it so far, it's amazing.", "Title": "I love this tablet", "Date": "February 8, 2013"}, {"Author": "Winston H. Chen", "ReviewID": "R3JTAJ4KXJUF8", "Overall": "3.0", "Content": "Met 75% of my expectationI have an iPad and several Window 8 notebooks.  iPad is a beautifully designed product.  It has great resolution, beautiful display, instant-on, long battery life and is a great device for consuming content.  The only shortcoming for me is not to be able run Window software such as the stock trading program Schwab StreetSmart Pro or Fidelity Active Trader Pro.  iPad has Apps on stock trading which are not adequate.I tried to get a Window 8 tablet to do stock trading instead of using PC notebooks for better mobility reason.  Asus VivoTab Smart Tablet is a reasonable product, but not a great one.On the positive side, it has good features such as lightweight, reasonable touch screen, long battery life, running Window programs, and a USB port.  The price is very reasonable.What fall short of my expectation are:* Touch screen is not perfect.  The precision sometimes is off.  The response can be lagging.  On some Window programs, the scroll function does not work at all.  iPad has a far better touch screen design.* Google Chrome does not work (cannot open).  My Window 8 notebooks runs Chrome well.  The problem only happens on the Asus Tablet.  I checked on the Web and found that many people have the same problem with Chrome on Window 8 (Microsoft Explorer works fine).  This is a Window 8 compatibility problem.* Firefox does not work well either.  It opens but the response is not good.* The processing of Atom is not adequate.  In running some Window programs, the speed is very sluggish.I believe that there is a market need for a good Window Tablet that runs full-blown Window programs. It's easier to carry a tablet than a notebook.  Asus Vivo Tab Smart is only about 75% there for this purpose.  I hope Asus and Intel keep working on it.  iPad is for play and a Window tablet is for work and play.Follow up on 5/9/13  In about 2 weeks of infrequent use, there is another problem.  The plastic cover of the charging connector fell off.  I cannot believe that Asus provides such a defective and shoddy component.  I have to order a  A-Male USB to Micro-B Cable cable to replace it.  The original charging cable is too short and has a poor quality.  This is annoying.", "Title": "OK but not great", "Date": "May 5, 2013"}, {"Author": "M. Michilot \"M&M;\"", "ReviewID": "RA3KYXQC7D2K4", "Overall": "2.0", "Content": "I had a very positive experience with a previous Asus Product (the Android Transformer).So I was very excited when I received (March, 2013)the ASUS VivoTab SmartME400C (ending serial: C26804). I quick delivery from Amazon.As a previous reviewer commented on the plastic back cover, he was right. I really didn't mind much.I plugged it in, set it up, and did run great!Next day I charged it up for 40 minutes and unplugged it of the wall. To my surprised, my tablet got over-heated with a \"burnt-plastic\" smell around the plug-in area. One hour later, still hot. Two hours later I turned it on and booted up just fine. However, it still had the burnt-plastic smell. So I did not dare to charge it again.I immediately called Amazon for replacement. They said they would but did not have any on stock (although their website still showed 4 available - figure that out???).Nevertheless Amazon they took it back (much appreciated). I really liked the unit...not the hot risk!", "Title": "A very \"HOT!!!\" Tablet...", "Date": "April 16, 2013"}, {"Author": "Pen Name", "ReviewID": "R2GK9TTE403EFN", "Overall": "3.0", "Content": "I have surfed through a great deal of sites for reviews and comments before deciding to buy this Asus Vivo Tab Smart ME400C-C1 model. It is highly portable and has a nice, fashionable design. Although the screen is a little too small but it didn't really bother me that much. However, things went bad after just the second day I unboxed it. I started to have occasional difficultie to properly play out sounds from any audio media. Worse, it is often a problem to fully reopperate the device after I put it to sleep. I would have to shut it down and restart it almost everytime I put it to sleep for 20+ min.Pros: slim, fashionable look, light, highly portable, screen can be viewed in almost every angleCons: small text, almost disastrous speaker, occasional difficulty to play audio programs, difficult to properly reopperate after putting to sleepSummary: It's a device that might suit people who have light use of their tablets in their everyday life (ex: watching films and surfing through sites). For me, it is still far to qualified to be used as a laptop. The sound playing is nearly awful that I have problem hearing the sound even after putting up the sound volume to 100%.", "Title": "Can be better", "Date": "February 12, 2013"}, {"Author": "Don W", "ReviewID": "R2Z8B3K0I8IDUO", "Overall": "5.0", "Content": "Having tried many tablets over the last few years, I was always frustrated by various limitations of either sluggish operating systems or restrictive \"walled garden\" approaches. This Windows 8 device is the most versatile of any I have tried. While the app store is still growing, the whole wide world of websites are available in either the traditional PC desktop style or via a selected tile on the start screen.Pros:Quality buildBattery life exceeds 10 hoursScreen responsiveness and resolutionExcellent keyboardCompetitive price and valueBuilt in internet security suiteCons:Bit of a learning curve for Windows 8 OSBest all around tablet for those used to the PC. Enjoy!", "Title": "Superb tablet in operation and quality", "Date": "February 9, 2013"}, {"Author": "GG", "ReviewID": "R268ODEAUFL91H", "Overall": "4.0", "Content": "I placed my order on 1/28/2013 with Amazon, delivery status was change from March to 1st week in February, and tablet was sitting at my door on 1/30/2013.I was really happy with the form factor, weight, built quality until I started updating its software (note: I am very familiar with Windows 8, and if you are used to Intel i3/5/7 processor then you would notice the ATOM processor speed difference inside the unit, otherwise you may be okay).OMG. The ASUS program that updates its software NEEDED to be updated itself, then it updated its BIOS, and 35MG of drivers, then there were 30 updates for Windows 8 OS and another 28 Windows 8 Store type programs that required updates. One of these updates basically killed the WiFi and I had to roll-back in order to get the WiFi working again, it was getting very discouraging.I also started looking into other methods to update the software without having WiFi, realizing that ASUS didn't ship a one dollar USB adapter. So I wasn't able to plug in a keyboard/mouse/USB hub/USB Ethernet/etc. fortunately, the roll-back got the WiFi working again.UPDATE (2/3/2013):the micro-USB port may work with what is called \"USB OTG (On-The-Go) adapter\".", "Title": "ASUS vivotab smart", "Date": "February 1, 2013"}, {"Author": "David Kenzler", "ReviewID": "R2OOASUYHAVNYK", "Overall": "4.0", "Content": "I wanted a true windows machine.  I have only had the ME400 for a few days but the thing is great.  Battery is long lasting and fast charging.  The wifi was spot on, using Windows 8 is fine, and set up is fun!.  I may have to get the Office down load to use the pad rather then take notebook with me on trips, but it is fairly reasonable.", "Title": "More than I expected", "Date": "January 21, 2013"}, {"Author": "M. Popov", "ReviewID": "R5YBEAKP6LZ7W", "Overall": "3.0", "Content": "Aside from what has already been written on features and performance, I'll add a few important pieces of information that I did not see in he other reviews here.First, the color of the screen is not neutral. I am sensitive to good and true to life colors and the VivoTab's are on the warm side. This means than white is not white but yellowish. You might not notice unless you put it side by side with a calibrated monitor or even an iPad but it will be very apparent once you do. Grey are not neutral grey, blacks are not true black, white is not pure. Download something like the free Monitor Calibration Wizard utility and you can make things look acceptable and correct most colors to a relatively neutral look. Another poster used a calibration tool (\"Spider\") and advised simply lowering the greens by 19 points via the built-in Intel graphics utility that you can access through the tablet's settings. To me this did not work nearly as well as the calibration wizard software, which addresses all colors and creates a color profile for you.Second, the edges are sharp and do cut-in uncomfortably after some use lying back on a couch and holding the tablet for watching a movie for instance.The casing is not that sturdy compared to iPad and there are some creaky areas, although nothing terrible.The rear camera gives a soft image on screen but when the photo is taken, it is of OK quality. The default setting for this camera is way low resolution and you may want to bump it up if you have the use for it.Do spend the time to learn the basic gestures of Windows 8! The first time I had Windows 8 on a non touch screen laptop I found it terrible. I actually quite like it on the touch screen. Most things are one or few gestures away. Close an app - no problem and no need for alt-F4 or clicking on a \"x\" - just swipe down from the top edge of the screen.The charger is slower than the one on the iPad 3 but does charge the tablet fully overnight.I paired a generic full size Bluetooth keyboard with a built-in trackpad fine and after using the mouse a bit, found that touch and gestures are A LOT easier to do just about anything that does not require pin-point accuracy (for which the touch pad is not good anyway)UPDATE 3/16/2013I lowered my rating to 3 stars, because of the following:- the tablet freezes on me at least a couple of times a day when doing routine tasks such as vhecking email or being on youtube.- at startup, when waking it up from sleep, often the screen goes blank and the only way out is to restart it- YouTube video playback is sometimes choppy (even if it is already buffered), and sometimes smooth (on the same clip), so performance is inconsistent.On the plus side, I saw the optional keyboard for the Vivo SmartTab - it is beautiful and scarry thin. Did not try it but it looks very nice.Not sure how much of this is due to Windows and how much due to the ASUS hardware... I have installed all patches and running the latest firmware. I'm returning the tablet but not sure what to get... if the Lenovo Tablet 2 was $100 cheaper I'd get that in a heartbeat, but as it is, at nearly $700 with tax it is too expensive for what it is... might as well get a \"real\" computer with Core i5 processor and a touch screen for that much money...", "Title": "Good value, some issues", "Date": "March 10, 2013"}, {"Author": "Abdullah", "ReviewID": "RR6OP94A8RCKN", "Overall": "1.0", "Content": "I had this tablet and after two months had cracks on digitizer which make the touch not functional.I spent more than 2 months communicating Asus to fix my issue and no one has enough knowledge to answer me. After around two month I send it to their location by mail and I asked them about the price they send me invoice which is around $200 to fix it, and they asked me to send my credit card information through the email under my responsibility!I refused to fix it with this price. Imagine that more than 2 months I am asking them to return my tablet because I don't wanna fix it and there is no response. When I call by phone if I talk to them and they don't like my way they will cut the phone. Also they have trouble with their single you loose the connection a lot of time and you have to call again and explain everything from the beginning for another agent.Worst services in the world. Good products with bad services, so it is not worth to spend your money because if any problem happens you won't be able to fix. Noticed this problem out of warranty and I have to pay. imagine if the issue under warranty and they have to pay for you !!!!!!! You will be in bad situation", "Title": "Worset tablet in the world", "Date": "March 5, 2014"}, {"Author": "Jim", "ReviewID": "R3GZIM28XGTSUT", "Overall": "4.0", "Content": "Update 10/04/2013About a month ago I wrote a poor review for this Asus tablet.  It was only two months old, it was glitchy from the start, freezing up a couple times a day and then it quit working after 2 months.  I called service expecting nothing good and a short phone call later they gave me all the info to send it in to service in TX.  It took a total of three weeks to get it back and I am happy to report that I am typing this update on my Asus tablet that has been working great for the last two weeks.While there are some functionality issues with Windows 8, my tablet has been working better since it has been returned from service.  They have not told me the problem, nor do I really care because I am very happy with this tablet as its performance has been wonderful.  It has did freeze up once that required a restart that made me hold my breath, but it has not returned... it used to happen 5X per day.  Whatever service did, it was necessary and worked as I am very happy with this tablet.Previous review:You get what you pay for.... I bought this for work as I needed Microsoft outlook.  This has been nothing but junk... It often freezes up requiring you to turn it on and off at least a couple of times a day.  I have owned this for exactly two months and today it will not turn on.  It flickered for a minute, wouldn't turn on for about an hour, came on for five seconds and now won't turn on again.  Yes, the battery is charged and even plugged in.  I now will start the process for service and will inform of my findings soon.  I can guarantee this will suck.I should have known that a cheap tablet was not worth it but I took the plunge and now I regret purchasing this terrible Asus tablet.", "Title": "I am surprised at", "Date": "August 21, 2013"}, {"Author": "William Jenkins", "ReviewID": "R1Z8YAHP0DZKOM", "Overall": "5.0", "Content": "I decided to purchase the VivoTab Smart with the trans sleeve and keyboard, after months of searching for the best tablet for me. I debated between the Samsung Galaxy Note, Blackberry Playbook (I had hands on with each). I choose the VivoTab Smart because I preferred a Windows tablet. So those that want an Ipad or Android tablet should purchase an Ipad or Android tablet because this is neither. The tablet itself is not heavy, although after about an hour of holding it, it can seem heavy. I like that I can use the gestures and charms which my 3 year old has figured out rather than buttons or having to go back to the home screen. I found it saves some time albeit a few seconds, but time none the less. Although I don't use the desktop much, there have been times where I have found it to be useful to have something familiar. The cameras aren't great, but they are capable of capturing an image and video chatting (I use Skype). This isn't my main camera, and it is a bit akward and cumbersome taking a photo with a tablet so this wasn't a must have for me. If you are one the fence about what tablet to buy and want apps galore; this is not the tablet for you. As a matter of fact stay away from all Windows 8 tablets because there aren't nearly as many apps as there are in Google's and Apple's app stores, but the app's that it has are more than capable of allowing you to do what you need with this tablet.To wrap this up, the tablet is light, the screen is nice, the gestures and charms are simple, the Windows store lacks apps, the desktop is refreshing, and all in all this is a great tablet for the price.", "Title": "Doesn't deserve the negative criticism", "Date": "May 29, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3H86JARAOYAFC", "Overall": "5.0", "Content": "Had the IPad, had the Android tablet, finally happy as I can go from PC to Tablet mode, so much more one can do like installing programs, etc. Love it", "Title": "Amazing Little Win 8 tablet", "Date": "April 22, 2013"}, {"Author": "A.NG", "ReviewID": "R1MJR8I3P7NUWT", "Overall": "4.0", "Content": "Con: Limited variety of (free) apps, tablet froze (even from light usage) frequently which force me to force shut down, the system reboot itself a few times because it suddenly encounter a problem... GPS is not integrated which in the specs were supposed to be (according to eee.asus.com), supposedly 64Gb but because of the operator/processor and its component only half of that space is leftPro: 8megapicxel cam, window8, the price definitely, micro SD card slot, and so on.Verdict: overall it is a great product, and for that price it is definitely worth it.** take into consideration the brokerage fee, might be an influential factor on decision**", "Title": "overall correct but might have consider other alternatives first", "Date": "March 7, 2013"}, {"Author": "Augusto Cucala", "ReviewID": "R1LEKCVCNDN52", "Overall": "1.0", "Content": "Last December 2013 I bought my ASSUS Vivo Book S400CA at Amazon US.  The computer arrived fine and as I was told it came with Windows 8.  One month after I got it, I did the upgrade to windows 8.1.  After two months the computer did not allow me to shut down.  Every time I wanted to shut down the PC I got a blue screen and an error message.  The only way to shut down the computer was to “suspend it”.  During the past 4 months the problems have been increasing.  After a while none of the programs of Microsoft Office would not work.  Every time I tried to open one program of the office package the computer would try to validate the software with Microsoft.  The ASUS computer was so unstable that every software package felt they were in different computers every time I started a given program.With all these problems I called the Technical Service of ASUS.  I called the technical Service of Asus in Spain because I moved to Spain.  They asked to send them the Serial Number, the Guarantee and the invoice, which I did.  I sent al the requested documents and after two weeks of going back and forth they told me that they will not fix my computer because the invoice of Amazon US did not have my Tax or ID number on it. I tried to explain to them that Amazon US makes the invoices that way but no luck!!What a disaster of Service!!  I cannot recommend to anyone that they purchase any equipment from ASUS.  If you have a problems, you are in your own, no help from the manufacturer. NO HELP AT ALL.We also had a problem with an ASUS tablet ASUS VivoTab Smart ME400C-C1-BK.  The tablet once a week would all of a sudden go to a blue screen and you would lose everything and have to start all over again.  We called the technical people at ASUS in Spain and they again, did not want to take care of the tablet.  They told us in addition that it was our fault because we upgraded from windows 8 to windows 8.1, and we were supposed to use always the original software from the manufacturer.  Can you believe this comment!ASUS sure knows how to upset and loose customers!  To start with, they just lost the 6 members of my family.", "Title": "Technical service is a disaster", "Date": "June 6, 2014"}, {"Author": "Idahoser", "ReviewID": "R2FT6SJ95Q0YDA", "Overall": "5.0", "Content": "I didn't even really try to fool with it during the update process, which took me two days all in all.  Some update screens would sit so long I thought the thing was frozen but it eventually got there.  Did all the updates for Win 8 and then when the 8.1 update didn't show in Windows Update I read some more and found I had to go to the 'store' for that, it worked fine.  Did the ASUS Live Updates including BIOS.  I've added an OTG USB adapter and USB hub with built in ethernet adapter so I can join wired-only networks, and use flash drives etc.I was on the verge if deciding I was just going to completely skip Windows 8 and use Linux Mint to keep the old XP computers going.  I am still doing that with the old computers, but a tablet lets Windows 8 be at least half useful and I figured I ought to learn it some to be able to support it.Any complaints I might have here are about Windows, not the tablet.  For the price it's an amazing deal.  I got a used one with the manuals and included accessories, you folks getting the refurbs with nothing aren't missing much.  Get a 2 amp charger and cable and you'll be right where you want to be.  The manual for electronics is useless so you're not missing anything there.", "Title": "I followed the advice and did all the updates, and I'm thrilled", "Date": "June 5, 2014"}, {"Author": "Florence Ashby", "ReviewID": "R1YF56STDHWNZH", "Overall": "2.0", "Content": "The vivotab smart is well built.  Generally works well.  But Win8 has behaved like an unfinished product.  It absolutely requires that you have a microsoft account.  No explanation is given as to what this account does, except that you have to have one.  Rebooting required logging into the microsoft account.  Finally deleted the account, now log ons are quick and easy.  But now many apps insist on having a MS account to load them.  Several google drive apps don't work correctly any more.  They work on my Wiin7 laptop.  Many progs highlight an input window with cursor in place but keyboard doesn't appear.  You have to go find it.  Bought a keyboard and pushed through the set up.  thought heaven had arrived until I put it ini my backpack and something bumped a key on the keyboard which turned on the computer and kept it on till the battery ran dry whereupon I could not use it.  Also be sure and turn off auto updating.  About half the time I would grab the tablet thinking I would grab a quick item only to hqve it launch into an update that would take a long time.  Then be sue to update things from time to time.I'm pretty frustrated with it but still coping.  What else can you do when you can't afford to buy something else?", "Title": "needs work", "Date": "June 1, 2014"}, {"Author": "Jitendra Singh Kushwaha", "ReviewID": "R2L8DVRVLQ0L9R", "Overall": "4.0", "Content": "I got this tablet in very good deal so I bought it. I was pleasantly surprised with the performance, I couldn't expect more from a atom powered tablet. I was able to play FIFA 13 smoothly on it, which is known as benchmark game. Asus has done great job on hardware front the build is solid and touch screen is very responsive, but I am not very satisfied with windows 8. So I will rate it on 2 different categories hardware and software.HardwarePros:1) Sturdy build quality all necessary ports2) Micro SD slot for expansion3) Micro HDMI for external display4) Very good touch screen(Same as ipad)5) Micro USBCons:1) Speakers are average not very loud2) I would prefer to have full USB port3) No matter I use or don't use, it discharges overnightSoftware:Pros;1) Smooth  and Responsive2) Can install any exe file as it is full windowsCons:1) Not completely tweaked for touch screen and almost not usable without keyboard mouse2) MS store is a joke, not even youtube official app is there3) If you are buying it for tablet use forget about it. It is no good without keyboard mouse.4) Windows update always failed when tablet is one, it only installs if i restart it and it took hours for 8.1 update.", "Title": "Very nice hardware but windows 8.1 needs serious work", "Date": "May 23, 2014"}, {"Author": "PenName", "ReviewID": "R17F6KQBL44ACE", "Overall": "4.0", "Content": "Really what I'd say is that this tablet didn't really come into its own until Win 8.1. Once I got the Win 8.1 upgrade, it because a very pleasant user experience.  And I can't blame the device for that (Microsoft!!!!!).I knocked off one star due to the charging issues I had with the first unit. I would plug it in (to the factory charger) and it would charge for a while, then display \"Plugged in, not charging\". I would have to unplug it to get it to start charging again, and that got old super fast. So I returned it and they either fixed it or sent a replacement; charging works fine now.Beware though - if you're using it and charging it, you can still run out of battery if you're not using the ASUS (2.0 amp) USB charger. You definitely can't keep up using a computer USB port for charging, or even a 1.0 amp wall charger if you have the screen brightness much beyond the darkest setting.", "Title": "Few teething problems, but a very nice device", "Date": "May 17, 2014"}, {"Author": "nj", "ReviewID": "R1R9MHELRTT5B2", "Overall": "5.0", "Content": "I have been using the ASUS VivoTab Smart since March of 2013.  I am writing this review almost a year later because I noticed all the low reviews on Amazon and I think this is a great entertainment tablet.I was looking for a tablet that I could use for all my software development work as well as for entertainment.  I purchased this tablet (and several others) and tried to configure it to suffice as a work tablet, without success. It only has a microUSB port which is used for charging the battery and powering the unit. You can either run a USB hub on the micro port or charge the battery.  I needed a computer with multiple USB ports to do my work.In the end, I purchased a touch notebook computer for my job, ACER S7-191, which I am also very happy with.But, I fell in love with this tablet and had to keep it as an entertainment tablet.  Unlike the more powerful Intel Core I5+ tablets, this tablet is QUIET, lightweight,  and the battery seems to last forever.  I love having an entertainment tablet that has Microsoft Office and that I can work on in a pinch. I bought a Bluetooth keyboard for it, but I typically only use it with the internal touch keyboard.Microsoft Windows 8 with SkyDrive simplifies file sharing and easily synchronizes personalization across multiple devices.", "Title": "Love - Entertainment Tablet that Works", "Date": "February 4, 2014"}, {"Author": "plat", "ReviewID": "R2DXLE2NFYNZIZ", "Overall": "2.0", "Content": "When used with the keyboard, it is pretty much what a uni-student would need.  A light device that can perform word processing and access the internet via Windows.HOWEVER, when left on sleep mode for a long time, the screen likes to stop working.  No fix was found.  The only solution would be to force shutdown and restart, hoping you can auto-recover whatever you lost.", "Title": "Good when it works.", "Date": "January 23, 2014"}, {"Author": "Lwadzo", "ReviewID": "R2XFBZM1WH07IQ", "Overall": "4.0", "Content": "Overall, I like it! It is full Win 8, so I had to update to 8.1, The USB port is a mini, and requires a small cable to adapt to standard USB, and does not have enough power for external hard drives that do not have their own power, but works with flash drives. The external port is also the charging port, so you cannot use USB while charging.The battery life is impressive, 10+ hours. The micro SD card slot appears as drive D, and is quite nice. The display is a bit of an odd size, but fairly good resolution, though it can be tricky to select small menu items with my big fat fingers. The other drawback is bluetooth is not as intuitive as on an Android device.This is replacing a Galaxy Tab 2 7\", which I still have only because one game I like does not come on Windows. Everything else, I use the Vivotab.", "Title": "good battery, some limitations", "Date": "January 15, 2014"}, {"Author": "Susanne Kaithakattu", "ReviewID": "RY0C4Q3550N7Y", "Overall": "2.0", "Content": "I was looking for a tablet that wasn't an IPad so I was happy when I came across this option: a sleekly designed tablet with Windows 8. Since purchase I have been frustrated with its poor touch response and random computer restarts. The keyboard will occasionally not come up when needed which would have only been a minor annoyance if it didn't choose to do this when I needed to type in my password to unlock the tablet. Try to connect a Bluetooth device to the tablet and prepare for 10 step headache and in the end you won't know if it's connected until you test the device. Both the tablet itself and windows 8 have proven to be a disappointment to me and it looks I will be going to Apple for my next personal computing choice.", "Title": "Disappointed", "Date": "January 8, 2014"}, {"Author": "Hani Abdullah AL-Garmoushi", "ReviewID": "R1LP951B4X8JTD", "Overall": "4.0", "Content": "The ASUS Viva Tap Smart ME400C-C1-BK 10.1-Inch 64GB Tablet was Very good as expected.The ASUS Viva Tap Smart ME400C-C1-BK 10.1-Inch 64GB Tablet was Very good as expected.Thank You", "Title": "Thank You", "Date": "January 7, 2014"}, {"Author": "Allena Hudson", "ReviewID": "RLHC0J81YGT03", "Overall": "3.0", "Content": "The processor is a bit slow. Which made some programs that i am use to running on my pc in a few seconds take a lot longer", "Title": "slow processor", "Date": "January 4, 2014"}, {"Author": "SonorousGiraffe", "ReviewID": "R223APWPT4VSKW", "Overall": "4.0", "Content": "This is a nice tablet for Windows 8.  Lightweight and portable are key factors, the screen response and performance are equally as good.  The only gripe I have with this is that the battery life is pretty poor.  For example, fully charged, after a 2 1/2 hour flight of just playing games, the battery is down to 48%.  If I watch a movie, the battery will be down to around 20%.", "Title": "Nice and inexpensive, poor battery life", "Date": "December 28, 2013"}, {"Author": "Lologuy \"cracked PDA\"", "ReviewID": "R2E95SCD6RZHFP", "Overall": "4.0", "Content": "This is the first Win 8 tablet I'm using as all my previous tablets have been Android tablet, but I'm thoroughly familiar with Win 8 OS as all my laptops run it. I've had Asus android tablets and this unit is very similar in size and form as their 10\" Android tablets. As for performance, it basically matches a dual core android tablet in almost all aspects except that it seems to handle video playback not as efficiently. I actually think that Win 8.1 (free upgrade from the 8.0 the unit ships with) works quite well with a touchscreen tablet and I've not experienced any locks or freezes I've experienced with android tablets (maybe just lucky). Having only one micro usb port is a hassle as you need a OTC adaptor cable to pair it with external drives and which is not possible while recharging the unit. The screen clarity is more than adequate and certainly bright enough. The unit used to change it's brightness setting by itself while in use, which kind of bugged me, but that was corrected by changing the display settings (not really intuitive - requires some knowledge of the OS to figure this out). The other thing that disappoints me is the lack of a satisfactory app for GPS and offline maps. I had an 2010 version of Microsoft Streets and Trips I loaded but it won't recognize the internal GPS (how stupid is that - MS software not working in their own environment). I have a Nokia smartphone that comes with a terrific app for GPS and maps so hopefully MS will add this app to their store - after all they do own Nokia now. In the end, one has to ask whether additional cost of opting for a Win 8 tablet is really worth it over having an Android tablet that basically does the same thing. I would say no unless you have a compelling reason why Windows is an absolute necessity for your productivity. The main reason I got this was because it was at an unbelievably low price (bought it from a guy who won it as a prize but have no use for it - he's an iFan). Don't get me wrong, I like it and it's my daily use tablet now but it isn't a compelling buy over a better spec'ed android tablet that costs less.", "Title": "Very good Win 8 tablet but is that enough?", "Date": "December 21, 2013"}, {"Author": "Chris Blais", "ReviewID": "R276PTF73SS8OM", "Overall": "5.0", "Content": "excellent all over it has worked great since start, except the charge cord is garbage. I have several like this so it did not stop me. I am slowly transitioning all of my activities to this tablet. best for the money that I have bought.", "Title": "wonderful", "Date": "December 10, 2013"}, {"Author": "Avy S.", "ReviewID": "R1NKJVUQ5XUE3M", "Overall": "5.0", "Content": "I bought this last May, and was very disappointed. The Mail client did not synchronize, the news client did not work, touch control of browsers in desktop mode was flaky. I just upgraded the operating system to Windows 8.1. It now works as it should. This is now an excellent tablet, with the added benefit of allowing use of all older desktop Windows programs. With a bluetooth mouse and keyboard, I can easily do efficient word processing. I am no longer disappointed. However, you must upgrade to the latest version of Windows.", "Title": "Now it works well", "Date": "October 22, 2013"}, {"Author": "aw91", "ReviewID": "R211JKHZLKGYH", "Overall": "4.0", "Content": "had this tablet for half a year now and have not yet had any issues, solid construction that feels lightweight yet sturdy. I use it mainly for work right now and it suits that purpose perfectly. I do wish it had more ram but the 2 gigs it comes with are more than sufficient for any normal use scenario. all in all great product for a great price, definitely recommend.", "Title": "great product great value", "Date": "October 12, 2013"}, {"Author": "fayaman", "ReviewID": "RV5TLZ53XUVG3", "Overall": "5.0", "Content": "Bought this product about 6 months ago, and its still working perfectly.Camera,battery life is very good.Good for folks who want the windows experience on the go.I easily use my usb flash to transfer and copy stuffs even though it has a lot of means to transfer like bluetooth and nfc. its light and portable,nice product.i recommend it", "Title": "very solid!!", "Date": "October 1, 2013"}, {"Author": "A Phillies' Fan \"Phillies40\"", "ReviewID": "R19NB6VL5I6Z1V", "Overall": "5.0", "Content": "I just got this 1 hour ago and I love it already!Nice look, light, very responsive and it is Windows 8 (It will take me some time to learn it).So far so good.== More update ==I just installed Citrix Receiver on my tablet! Now I can use it to work from home and anywhere logging on my employer's network!I think I love Windows 8 more than 7 now.  :)== More Update ==10/18/2013: Exact 1 month since I had this tablet, so far so good.  :)", "Title": "Asus ME400C-C1-Tablet", "Date": "September 18, 2013"}, {"Author": "Justin Quigley \"Justin Quigley\"", "ReviewID": "R3TGYBFWOIYWJ8", "Overall": "5.0", "Content": "This is a very nice tablet for a very good price. It is very responsive, nice crisp screen, light-weight, expandable memory, non-RT and good battery life. No complaints from me.", "Title": "Very Nice", "Date": "September 10, 2013"}, {"Author": "ODAT by Grace \"ODAT by Grace\"", "ReviewID": "RVO07LUGDJNAI", "Overall": "2.0", "Content": "I have only had this tablet for 2 months and I have had to \"refresh\" it 3 times.  Every time you \"refresh\" it you lose all pics, programs (like microsoft office) and apps you have installed.  There is a \"refresh lite\" that does not remove apps purchased form the microsoft store, but \"refresh lite\" has never fixed my problems. So now I have to learn how to use the ASUS webstorage feature (which is free ... hmm) to save my installed programs so I can re-install them easier after I 'refresh\".  First it was the camera, just poof stopped working, customer service said \"refresh it\", which fixed it.  Then my speakers just poof stopped working, again customer service said you have to \"refresh it\", which fixed it. BUT WHAT A HASSLE! I gave it two stars, because the graphics are really good and when it works it is very nice, but don't fall in love with it - it will break your heart every time!", "Title": "too delicate", "Date": "September 1, 2013"}, {"Author": "lincar27", "ReviewID": "R3EDQKZVZHL26Q", "Overall": "5.0", "Content": "The Tablet is remarkably different from a Android tablet certainly characteristics are excellent with Windows 8, which makes the tablet a recommended product.", "Title": "A tablet at a great value.", "Date": "August 28, 2013"}, {"Author": "Amazon Customer \"Ein Doktor mit Sinn für Humor\"", "ReviewID": "R27QW6GF5PM5H7", "Overall": "4.0", "Content": "This Win8 32 bit tablet with Office 2013 is equipped with Intel Atom Dual core CPU and 2 GB RAM / 64 GB SDD.It has a precise good quality build, but it's not as nicely made as an ipad. It is also slower to launch an app, but once loaded, multitasking is a breeze!Being a full-fledged Win8, not RT, it can do anything a normal PC can which means total flexibility.Battery holds about 3 days of regular use and charges fast.Sites like dhgate offer nice options to get a keyboard/case for this tablet for about 30 $.Overall I'm content and satisfied with this tablet which became an upgrade from ipad 1 for me.", "Title": "great value and functionality for a tablet!", "Date": "August 26, 2013"}, {"Author": "Buzz", "ReviewID": "R3CRPO18Z8TXEN", "Overall": "5.0", "Content": "I really like this tablet.  Only dislikes I have is the one speaker.  Sound is fine but could be better.I was apprehensive with the atom processor but find it adequate in this product.  Love the micro flash.", "Title": "As advertised", "Date": "August 15, 2013"}, {"Author": "Elaine M. Bell", "ReviewID": "R8LWV03L8GG2G", "Overall": "5.0", "Content": "This tablet is just lovely.  Love the size and how light it is. This has so many more features than the iPad like the SSD card and with Windows 8, it performs great.  The battery life is about 8 hours with normal use.  Recharging is relatively quick.  Do wish it had a longer recharging cord.  The price is definitely affordable, especially for what you get.  Headphone sound is definitely much better than the sound from the tablet's speakers.  But, that is not a big factor for me since I use headphones most of the time anyway.  Do go for the Bluetooth keyboard and mouse especially for set ups.", "Title": "Great", "Date": "August 12, 2013"}, {"Author": "glide", "ReviewID": "RSOADLWWDIN8Z", "Overall": "4.0", "Content": "Good balance between price and power. As an owner of an I-Pad and Android tablet which I have since given to my kids this is the best tablet for me. I have access to Office and other Windows applications wherever I am. I upgraded the OS (W8 Pro) so that I could use sync to backup my important files to my home PC. The SD card slot and USB ports provides access to extra storage (during the day cloud services are blocked). Full size USB would have been ideal however; with the micro USB to USB jumper I can access my StoreJet from my I-Pad days as well as hubs and other USB devices. Lightweight and portable with excellent battery life.", "Title": "Just Right!", "Date": "August 12, 2013"}, {"Author": "amani", "ReviewID": "R299SU95ISIIHX", "Overall": "3.0", "Content": "I say not bad for reasons:1) it is light, smoothly, and easy to deal with.2) I love its battery, it really works up to 9 h.However: 1)the charger wire is too short. 2)Win 8 has no very good store nor than good apps. 3) its sound must be rise up.", "Title": "not bad", "Date": "August 9, 2013"}, {"Author": "Marshman49", "ReviewID": "R22BAT65S89GYF", "Overall": "2.0", "Content": "The screen is bright and sharp. That's the high point of this review. The tablet is also slim and doesn't weigh much. The touch screen is very unresponsive and that makes the tablet a pain to use. Asus makes the Google Nexus 7 touch screen and it is very responsive, so go figure. Battery life seems to be good, but I didn't give it a complete test because I didn't want to use the tablet for an extended period of time.There's plenty of reviews of Windows 8 elsewhere so I won't waste words relating what a bad operating system it is. This tablet runs \"full\" Windows 8. I did install a powerful piece of software that requires a good bit of memory and it worked fine on the tablet.I would NEVER recommend this tablet to a friend, unless that person is a techno-masochist. It's a waste of money and probably too light to be an effective doorstop.You can spend significantly less and get the Nexus 7 latest generation tablet that runs Android. The screen resolution is superior to this tablet,  It is responsive to touch, something that you would take for granted normally. And there are tons of apps, something you can't say for the Windows app store.Maybe this tablet will be upgradable to Windows 8.1--that won't make it a better piece of hardware. Buyer beware!", "Title": "And What's Worse: It Runs Windows 8!", "Date": "August 8, 2013"}, {"Author": "QuietType", "ReviewID": "R326W6PSNTNFNX", "Overall": "4.0", "Content": "I'm not a huge fan of Windows 8, but, working in technology, I wanted some exposure to the Win 8 tablet experience. I'd already used the Surface RT and the Surface Pro, but I wanted one for myself that didn't cost an arm and a leg. The 1.8 Ghz processor in the VivoTab Smart is surprisingly fast and the tablet is quite responsive overall. The front and rear cameras work fine. Picture quality isn't going to win any blue ribbons, but it's passable. I'm generally depend on my smartphone for pictures anyway. Video playback on the Smart is very good, and what few games I've played so far have performed quite well. All things considered, I would say I am quite happy with this tablet. Most of my complaints have more to do with Windows 8 than with the tablet itself. By the way, I installed Windows 8.1 Preview on it, and that is running acceptably well. Lost the battery charge icon, but I see that is a common problem, based on the Internet posts I've read. Bottom line, the Asus VivoTab Smart is an economical way to get in on the Windows tablet experience.", "Title": "A nice Windows 8 tablet.", "Date": "July 28, 2013"}, {"Author": "Matthew Mcnear", "ReviewID": "R3RWXVRUU26YOH", "Overall": "4.0", "Content": "Have had this about six months, and having seen this as low as $350 (including a full MS Office Suite), it's really a great deal.  Great cloud integration with Skydrive, and runs software like QuickBooks and TurboTax without a hitch.  Battery life is excellent, and it's great for business travel.  Ipads are shiny pretty little things, but I haven't yet figured out how to file a tax return or print financial statements with one of them.", "Title": "Great Deal", "Date": "July 27, 2013"}, {"Author": "Realtor Sal", "ReviewID": "RHF15XSJ8GOS3", "Overall": "5.0", "Content": "It has all the performance of a pc but it is a tablet.The battery life is great.It is lot better than apple", "Title": "The next big thing.", "Date": "July 23, 2013"}, {"Author": "Yawgm0th", "ReviewID": "R3UV2EMKJ3IRT8", "Overall": "3.0", "Content": "The Atom processor in this device and similar tablets in its class is just not up to the task of running Windows 8 fast, and the 2GB of RAM is equally limiting.  Preceding Atom CPUs ran Windows 7 and XP much more smoothly, even on less RAM.  The class of flash storage is also slower than the early SSDs including in netbooks of yore.While much of the slowness has to do with Windows 8 itself, the tablet has its own problems.  There have been driver issues, BSODs, and occasionally it just refuses to charge.  The power button sometimes doesn't seem to register, and wireless mysteriously disconnects, requiring at least a disconnect/reconnect and, more frustratingly and probably more often, a reboot.Now all this being said, this functions just fine a good majority of the time.  For basic tasks, it is often smooth, and the frequency of the problems could certainly be worse.  Battery life is not bad.  However, if you're used to a quality Android tablet or iPad, this is really a step down from a tablet perspective.  It can do more because it runs x86 Windows, but it doesn't do the things cheaper tablets do as well, as reliably, or as fast.The overpriced keyboard/case combo that is sold separately is a near-necessity, and unfortunately not that great.  It attaches by magnet insecurely and just isn't very functional.It is not so bad I'll sell it or return it, but for the price, buy the netbook you wanted and an iPad or Android tablet.  Even using two different devices is probably a better experience than this, and this is one of the better devices of its class as of this writing.", "Title": "Slow, unreliable, crappy buttons; not the netbook-class tablet you're looking for", "Date": "July 15, 2013"}, {"Author": "P. Troutman", "ReviewID": "R3AF68O2R9TBWO", "Overall": "5.0", "Content": "This is the perfect tablet. I was looking for one with full Windows 8, not RT. Also one that didn't cost a small fortune. This tablet had both!! Very easy to use and so much better than the Surface because it has full Windows 8.", "Title": "perfect", "Date": "July 7, 2013"}, {"Author": "MPK \"MPK\"", "ReviewID": "R2NF44VNCPUG0F", "Overall": "5.0", "Content": "I have had the Asus Vivo Tab smart 64 gig for almost a month now, and it has proven to be quite functional.  It never over heats,  and this is very important to me.  It has windows 8 as does my desktop computer, and they work very well together.  I created a home-group, and can now share everything including the desktop's dvd drive. Finally I added a 64 gig micro SD card and now have twice the space.  I am not a gamer so I don't know how well it would hold up under gaming conditions.  It plays videos and music effortlessly, and the battery last most of the day if in constant use.", "Title": "Asus VioTab 64GB Excellent Windows 8 Tablet", "Date": "July 3, 2013"}, {"Author": "Joyce Steele", "ReviewID": "R2QYRAJL0PV92E", "Overall": "5.0", "Content": "My daughter absolutely loves this tablet. Originally, we order the wrong tablet, Amazon assisted us with the return and promptly mailed out the desired product!", "Title": "Happy  College Student", "Date": "June 30, 2013"}, {"Author": "O. yips chou \"the turtle student\"", "ReviewID": "R3BBW2O3SM19UO", "Overall": "3.0", "Content": "I bought this tablet before the release of Windows 8.1, it crashed very frequently, it crashed several times every day when use with the desktop mode.Then I updated to Windows 8.1, it has improved dramatically its performance and usability. However, the tablet still crashed under the desktop mode, but it does it gracefully telling me to shut down. It crashed about once a day, reducing from 4 to 6 crashes with Windows 8.0.The touch screen is no Ipad like. When use with Kindle, it is impossible to hightlight texts, because it does not respond well to touch. Similar problems with Flipboard which I downloaded today. If you are used to the state of the art touch capabilities of Ipad, you will certainly feel disappointed with this tablet. Flipboard even crashed in Metro Style mode.The positive thing of this tablet is its beautiful screen resolution, and the beauty of desktop computer like environment. The best use of this tablet for me is to run the Chrome browser. It is beautiful browse the internet!", "Title": "Crashed so often!", "Date": "June 29, 2013"}, {"Author": "Brian Scott", "ReviewID": "R1TYIDVUC2JDFK", "Overall": "4.0", "Content": "Love having windows 8 on tablet and loading desktop programs on tablet. I do wish that more apps were available, but it will come with time. Also wish micro usb was full size usb port.", "Title": "Great Tablet", "Date": "May 9, 2013"}, {"Author": "artion", "ReviewID": "R2P63QGPP6TMDV", "Overall": "5.0", "Content": "As other reviews say it, this is a full fledged windows 8 machine with a mediocre performance. it works fine for all the light websurfing and word processing, etc. If you want a netbook alternative but something with more touch base operation, I'd say this is a way to go. I am typing this review on a screen and once you get used to the keyboard, the typing becomes a breeze as it is for the other touch base devices.  I wanted more of a portable solution to my websurfing and document viewing - this vivotab really fit my bill. As other reviewers said, the brightness on this IPS leaves one to desire more on the outdoor setting for sure. So if you want something you can use while under the sun...I say look around and shop for other win8 tablets with better screen - there are several out there that would surpass vivotab in that department. However, just like me, if your primary usage will be indoors setting, I'd say it is hard to beat vivotab's price/performance level. And as many of you know, if you are looking for something that could be held with one hand for an extended use, I'd say you should look for 8 inch format like ipad mini or other android tablets....even though this thing is lighter than ipad 5, it is hard to hold this in one hand for an extended period of time.As far as windows 8 goes, i'd say ms did an ok job for a touch friendly operating system. It is very easy to use after couple tweaks. I rarely use the metro main screen so I can't really comment on that.... but the desktop functions as a traditional windows experience and that was what I was looking for.", "Title": "Works just as intended....as other reviews say it.", "Date": "May 4, 2013"}, {"Author": "LouM", "ReviewID": "R1Q4BH55H716MD", "Overall": "5.0", "Content": "Love this tablet as its big enough to play games in Yahoogame room, yet small enough to fit in my purse.  Thetouch screen works when I am away from home.  Athome I do prefer using my USB wireless mouse withone of the EEEkit plugs attached.  I bought this neatbundle on Amazon also.  All in all very pleased!!!!!", "Title": "Wonderful", "Date": "May 3, 2013"}, {"Author": "Brett Bartel", "ReviewID": "R2SIK9QD6R4FDR", "Overall": "5.0", "Content": "I really wanted a tablet with Windows 8 so that I could have all the functionality of a desktop/laptop while I am traveling.This doesn't have everything the Surface has, but is significantly cheaper and does everything i need it to do.I couldn't be more pleased.", "Title": "Best Value", "Date": "April 30, 2013"}, {"Author": "downeaster59", "ReviewID": "R2NN1KJMFMQYD1", "Overall": "5.0", "Content": "With so many tablet choices out there, which one do you choose? And why would you choose this one? Why not just buy an iPad or a Nexus 10? Or why not spend more money and get the Surface Pro? It all depends on what you want and need.This tablet runs a full version of Windows 8 at a bargain price. I can run a number of Windows desktop programs (including moderately demanding ones like Office 2013, Logos Bible Software and Civilization IV). I can link my Asus by my home network to my desktop's DVD drive and hard drive, as well as my external hard drive. I can run a number of apps from the Start page. I can do email, of course, and read Nook and Kindle eBooks. The screen resolution is not quite as good as an iPad or Nexus 10, but you'll only see the difference in small fonts. You'll want an OTG cable to use USB devices, as this tablet has a microUSB port. There is also a microSD slot to add up to 64 GB of additional storage. The Asus does a good job with Bluetooth devices like a mouse and keyboard. You may want them if you use desktop programs often. The virtual keyboard works well for all the usual tablet uses.There are some limitations, of course. The Asus has 2 GB of RAM and no dedicated graphics memory, as well as an Atom processor. 3D gamers should look elsewhere. Some programs load more slowly than they do on my desktop, but not that slowly. The Windows app store is still in its infancy, so options are limited. I did get BlueStacks to work with some online help, so I can run some Android apps on it. I expect that more Windows apps will come.If these limitations aren't deal-breakers for you, save yourself a little cash and buy this tablet. It can serve you well.", "Title": "A fine Windows 8 tablet bargain", "Date": "April 29, 2013"}, {"Author": "djlove", "ReviewID": "R3QZE1ZYITH8OP", "Overall": "4.0", "Content": "Really this tablet has met and surpassed my expectations, I like it a lot. No hangups everything is running smoothly.", "Title": "My Tablet", "Date": "April 29, 2013"}, {"Author": "Paul", "ReviewID": "R3NLD3HFAPCI1F", "Overall": "5.0", "Content": "Excellent Tablet, very light, fast, and long time battery. I'm starting to like more windows 8. Hope they improve the Store.A good inversion on this one", "Title": "I love it", "Date": "April 11, 2013"}, {"Author": "z_man9153", "ReviewID": "R3QPCK0J3K9PYB", "Overall": "5.0", "Content": "I had been wanting a W8 tablet, but didn't want to pay 'iPad money\" for one, so I kept watching the prices.  When I saw this one bundled with a free $100 gift card, I jumped on it.  My wife has a latest-gen iPad, and when she saw mine, she was so impressed that she had to order herself one.  I was amazed that the display is as good as the Apple Retina Display.I have not installed Win 8 on my desktop PC yet, but I can say that it is a fantastic OS for a tablet.  It is meant for touch-screens, and even though I'd only played around with it when MS had their customer preview last summer, it took no time to become very proficient with it.I could not be any happier with this device.", "Title": "Great Tablet, and Windows 8 Works Very Well on A Tablet", "Date": "April 5, 2013"}, {"Author": "MGS", "ReviewID": "R3DZTL6VJ0VWOM", "Overall": "2.0", "Content": "Well after much review, web searching and such for a windows tablet I pulled the trigger on the Vivotab....after much excitement it arrived and upon start-up I knew I had a problem. Repeatedly had to press the power button attempting to boot up, reset, crash messages sent to Microsoft, etc. So, back online to Amazon who promptly sent me a replacement which arrived 2 days later....replacement worked like a charm the first day, set it up, loaded Office, configured things my way then...day 2 it was back to no start-up, forced reset, etc. Once I get it running it seems to work fine. I'll give it the next 24 hours and then if nothing changes they will both go back to Amazon (which is an awesome site by the way)...maybe it's me but did I receive the only 2 of these with this issue? I am tech savvy with several office computers, laptops, the latest Ipad but jees Loius...get me outta this mess...", "Title": "Would be nice just to be able to turn it on....", "Date": "March 9, 2013"}, {"Author": "Annoyed", "ReviewID": "RNERPQ0EPR81N", "Overall": "1.0", "Content": "I just got an ME400C today, ran the live update, now it is just stuck in an endless loop of \"Preparing Automatic Repair\" followed by \"Diagnosing your PC\" and the being told it couldn't repair.I tried Reset your PC it says, \"There was a problem while resetting your PC\"Refresh your PC, sameTry system recovery image recover - no imageSystem restore - No restore pointsWhat a piece of crap.Spoke to Tech 3 times today, they refuse to accept there is an issue and claim they have never seen this or are aware, however, i have visited many forums with consumers having the same problem.Major inconvenience, in the meantime, i dont have a tablet since i returned and and im out 500 plus dollars for a couple weeks until the return is processed and refunded.  If Amazon cared about our relationship, one that is a few years old now, they would have sent me a replacement while the other one is returned and processed, but they dropped the ball.  This product is the same price locally and i wonder if its worth the hassle even if i save a few bucks.  If i would have purchased it locally, i would have a new tablet right now, which is needed for work, i gave my older one to a family member and i cant rightfully ask for it back.  Thank you Amazon......Update:Amazon credited my credit card, thank you....I know the issue was not at the fault of Amazon and sometimes things go wrong with technology.  Amazon came through, products dont always work out, but knowing that Amazon has your back is good to know.", "Title": "ASUS will not own there is a problem", "Date": "February 22, 2013"}, {"Author": "Luke K.", "ReviewID": "RF8UT6308GEYP", "Overall": "3.0", "Content": "First and foremost I'd like to say that Asus produced a very solid quality tablet for the cash you put forward with this device.  You just won't find a better deal with as good and reputable brand like Asus for the money.  I just received this tablet today and I'm sorry to say that I'm less than impressed.  Not on Asus' part, but Microsoft's.  Windows 8 is a beautiful new and innovative UI with A LOT of room for improvement.  I feel that Microsoft has A LOT of work to do with developing more functionality with the new \"Metro\" Start Screen.  It is definitely something made for touch, the problem is the Windows Store is a ghost town of virtually worthless apps.  Right now, any tablet running Windows 8 is essentially a Windows 7 UI with a cheap frosting overlay that is the Windows 8 UI.  Windows 8 itself is alright, definitely takes some getting used to, but the more support they get from major companies for their Metro UI Start Screen via the Windows Store, the better the system will become.And there is one thing I want to let everyone know.  BE WARNED, navigating the standard \"classic\" UI from the desktop screen to the internet, folders, applications, etc. is nothing short of a nightmare.  And this has nothing to do with just this tablet, it's any tablet running Windows 8.  The classic \"Desktop\" UI simply does not translate to touch compatibility.  Even with a stylus, it was a nightmare.  Navigating from screen to screen on the standard Firefox browser was difficult.  The screen is just so small that when you go to click on anything it doesn't always register the right thing that you're touching.I think Microsoft should have made a version of Windows 8 SPECIFICALLY For tablets, and Windows RT was NOT the answer.  Simply put, the classic Windows \"Desktop\" needs to be updated or dropped altogether.  If you are using a TOUCH SCREEN tablet, everything needs to be optimized for touch.Windows 8 tablets, a wonderfully functional idea on paper.  Terrible in practical application.So for those of you on the dividing line with getting a Windows Tablet, Android or Apple IOS.  Save the money and either get a laptop or if you really just want to play some games get an Android Tablet.  They are most affordable, easy to use, but just be prepared to be limited in terms of some functionality you'd get with a full Windows 8 Tablet.", "Title": "A Tablet With Room For Improvement", "Date": "February 20, 2013"}, {"Author": "Lkelly from Southaven", "ReviewID": "R1EKBZ6D4TP38K", "Overall": "1.0", "Content": "I did quite a bit of research on Window 8 tablets and decided on this one because it was full Windows and reasonably priced. Within 3 hours of taking it out of the box, it had frozen once, lost all wireless networks once, and blue-screened once. I still would have given it a chance. The last straw was when I selected one of the thirty apps with available updates (not Windows updates, app updates) because I didn't want to overload it, left it to run overnight and in the morning it STILL said it was downloading. I did a little research about what might be causing my problems and decided that it would be best for me to just get a refund because I just know enough to be dangerous. Before I bought it, I saw the other negative reviews, but I wanted to believe the positive ones... the negative ones were right in the case of mine.If it had stayed on and downloaded properly, I would have kept it because I did find that1. The internet was fairly fast when connected.2. The back camera was pretty good. It didn't take any pictures worthy of blowing up to posters or anything, but pretty good, I thought.3. Apps already installed opened pretty quickly.4. It was easy to get set up and it started up quickly.5. The display looked nice.I really wanted to love this tablet. I just couldn't take a chance that everything would get worked out.", "Title": "Had to take it back... too many problems on the first day", "Date": "June 17, 2013"}, {"Author": "Richard R. Wilk", "ReviewID": "R2PX283KPXHYMW", "Overall": "4.0", "Content": "There is a lot to like about this little tablet. Windows 8 takes some getting used to, but it is fairly logical, and while it is not better than Win7, it works better as a tablet interface. I like the screen and the portability. But the BLUETOOTH is a disaster. I sprang for the very expensive Transboard keyboard, which is a ni8ce size, lightweight and has a good feel. But the Asus tablet will not recognize it. It did once before I installed and software, but asince then nada. I am trying to type th8s on a totally useless little Gearhead portable keyboard running through a micro-mini USB converter. The keys are just too small. Asus tech support told me the only solution was to do a restart and wipe everything, then re-install windows and all my software and all the settings and everything else. About 4 hours of work. And lo and behold, once again it recognized the transboard once, until I installed MSoffice, and then it stopped working. It will not recognize the Bluetooth mouse either. My other devices recognize the transbopard, so it nis a problem with the tablet. So. Be warned. Buy the tablet and find an aftermarket wired keyboard and then buy a micro-mini USB cord.", "Title": "Not yet ready for prime time", "Date": "March 2, 2013"}, {"Author": "Audri", "ReviewID": "R3EIN26XTC90RB", "Overall": "5.0", "Content": "Very fast tablet. Very light and nice looking tablet. It is the cheapest one on the market and it is the best one. I have tried Acer W510 and Samsung Ativ 500T. None compare with ASUS VivoTab and those tablets cost $200 more.", "Title": "Best Window 8 tablet so far....", "Date": "February 9, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2XSKYZQKW0TSF", "Overall": "1.0", "Content": "The Tablet looks okay on the outside has all the bells and whistles you  might say. but in the inside the wifi hardware is terrible takes for ever for it to link up and at times its really buggy. it gets laggy and the software from the windows store are a joke. don't even bother with some of the major apps such as kindle and Netflix app I the worst could of been a great tablet but some of the hardware and the lake of decent apps that actually work. bring it down a lot  windows is just not ready for a tablet format it need a lot of work to get there I saw that they are doing a small upgrade to windows 8.1 but really doubt that this will fix much of the stuff lacking in windows 8 on tablets. the app store needs to be redone from scratch and organized with android and apple app stores as modals. I was forced to skip the app store all togather and ust use the browser for Netflix.  if you still don't mind the issues with windows 8 buy a windows 8 tablet build by a different company", "Title": "Subpar Tablet", "Date": "July 25, 2013"}, {"Author": "M. Brown \"Tea Lover\"", "ReviewID": "R2A6WQCYUWKCCX", "Overall": "1.0", "Content": "I purchased this from Amazon (Galactics). It started flickering off and on and I sent it to ASUS for repair.  It cost $27.00 to send it to them for repair.  It still flickers.  Galactics refuses to refund my money and ASUS says they do not refund any purchase that is not directly from them.  This was a very expensive item.  I feel betrayed and I want a refund.  I will do everything I can to publicize these two companies in a negative light. Don't buy from ASUS or GALACTICS!", "Title": "Do not buy!  Piece of junk. Will not refund!", "Date": "June 3, 2013"}, {"Author": "Sandra Cheszar", "ReviewID": "R2XJHCZKMWI4OB", "Overall": "1.0", "Content": "This tablet never worked properly - I have had every type of computer on the market with every operating system and never had such problems as with this piece of junk.  My husband is a programmer so we have gone from windows 3.1 on a gateway to windows 8 on this tablet and other computers.  And all in between - it's not the operating systems - it's the hardware or lack of quality hardware.  The Asus people in TX will not replace it with a new computer after it being for repairs twice now for the same thing and they are just waiting for it to go out of warranty.  The first person I spoke to at the repair facility in TX said this would need to be replaced but low and behold, it was not and came back in a box that \"wasn't even taped shut\" the UPS person was honest and it was in the box.  Too many complaints to list.  DON\"T BUY THIS PRODUCT _ JUST DON\"T EVEN THINK ABOUT IT", "Title": "I won't have even given it a one star but the system made me", "Date": "April 15, 2014"}, {"Author": "Dave", "ReviewID": "R14KI4B6T174S9", "Overall": "3.0", "Content": "After one month of use, tablet just \"died\"No response for any of buttonsRepaired under warrantyI Like the weight and dimensions", "Title": "Good overall but", "Date": "November 15, 2013"}, {"Author": "Adrian Starr", "ReviewID": "R296PZR5FBDY2J", "Overall": "5.0", "Content": "It has been everything that I expected from my research on the different tablets that I reviewed in this size range.", "Title": "A 5 Starr Energy Corporation", "Date": "November 3, 2013"}, {"Author": "YisMan", "ReviewID": "R3HY86YH9MXSVR", "Overall": "2.0", "Content": "the machine itself is pretty goodi have it for about a half yearit works basically ok, but has some serious shortcomings#1. one mini sub port only. this is the worst part, im forever unplugging and re plugging the charger, mini keyboard, diskonkeys etc...#2. the gps works in the US only, very useful for a highly portable machine which is supposed to travel with me around the world#3. when the battery is low you cant turn on the machine, even when its plugged in! for about 20 minutes or so!aside of that its pretty goodthen suddenly the battery stopped recharging, i called asus Israel (where im located most of the time) and they were very cordial, sent a guy to pick it up and returned it after about a week with the battery ok. now when i use it the whole screen starts blinking and showing static like in the old VCR days... i called them again but now they refuse to pick it up since it was bought overseas.i mean this is a very cute idea. when your in your homeland then they pick it up for you. when you're overseas in a hotel for business a few days, then you have to come down to their service center!theres just so and so much i guy could put up with for one tablet. i dont believe ill be buying another asus anytime soon.for now its gathering dust, its completely useless", "Title": "pretty good tablet, terrible service", "Date": "October 16, 2013"}, {"Author": "Martin", "ReviewID": "R3VG27OQKAIOSE", "Overall": "3.0", "Content": "I have very specific needs for this right now. It's my mobile PC while I'm in class. I have Evernote, LibreOffice, Eclipse, and a whole sweet of programming tools on it. Everything works very well. Bonus, I've been able to throw on some old 90s PC games like Baldur's Gate.The app market is larger than I thought it would be. Granted, it's no Google or Apple, but there are some decent quality apps in the market.The micro sdcard slot has been a big help in putting non-essential goods on my tablet. (music, games, and videos).With an adapter, I've been able to use real mice and keyboards. Which is really nice considering the mouse pad on the wireless keyboard I got is rubbish.There is a side swipe that brings out a very useful menu that has app searching, system settings, personal settings, screen control, wifi control, etc...Cons:Starting with the video card (or lack there of). It uses the PowerVR like other tablets on the market. What this does is it lets people who have made games for other tablets to port over to Win8 tablets easier (as long as they get around the x86 architecture), but it ruins anything that uses a real card like Nvidia or ATI. I've tried installing the dx9 redist, and I can start some 3d games, but they don't \"run\". Even games like Gunpoint are jerky.The speaker is crap and located in a terrible spot that puts all of the sound output on the left side of the tablet. This is negated by the fact that first I don't expect to be listening through my tablet much unless it's through earbuds.Win8; It already takes up 10gb so make sure you get a 64gb model tablet.Full screen desktop applications are unusable without a keyboard. Programs/games that are started up have to be closed via process manager until you get a keyboard.There is Zero resolution scaling. If a 2d game (Baldur's Gate/Diablo) is set to use 800x600 then that is exactly the amount of pixels the tablet is going to use.The desktop is also in desperate need of a Start menu.The tablet comes with a single micro usb slot, so make sure you buy yourself an adapter.No Google Apps. Gmail is always open on my computer. There are gmail apps, but they are all 3rd party, and I'm just too paranoid to use them.Metro GUI is beyond messy and crazy hard to clean up. All of these weird size icons they let different people use requires time, patience, and a Tetris grand-master to bring order.", "Title": "It fits my needs", "Date": "August 15, 2013"}, {"Author": "muthu", "ReviewID": "R175HC69Y59Q1N", "Overall": "4.0", "Content": "This is beautiful tablet runs with full desktop os meaning u can install any windows apps on this...Pros:>thin and light>good for browsing and watching HD movies>Nice IPS display>in built GPS>decent battery life (5+ hours)>nice front facing camera>excellent built quality and good after sale service by Asus..Cons:No keyboard accessory with built in batteryNo active touch stylus optionPoor speaker volumeOnly one micro usb port for charging as well as connecting USB devices... if you want to use mouse thru OTG, then u can't charge the device8MP camera takes only 2MP image in wide aspect ratio...Not as snappy as iOS devices.", "Title": "for windows fanboys", "Date": "August 14, 2013"}, {"Author": "Chris", "ReviewID": "R1T2WP2VD0KYNM", "Overall": "5.0", "Content": "First of all, let me start by saying that I own two Android powered tablets, the Google Nexus 7 and the Nexus 10. I absolutely LOVE them both, but they are not what I would call \"productivity\" oriented tablets. They are basically designed for media consumption and for gaming.This 'little tablet however, meets  and exceeds the all my expectations. It runs all my Windows based applications very smoothly, including Microsoft Office, which is the real reason I wanted a Windows based tablet.It is no gaming platform, but it plays HD video perfectly. I have no complaints about performance so far. It has 2 gigs of RAM  AND 64 GB of storage.The build quality is excellent. It looks great, feels great, and is well thought out. The screen is gorgeous and very responsive. In fact, I am typing this review on it right now.Overall, I love it! There are more expensive and probably better performing Windows tablets out there. But none are in this price point, and few run the FULL version of Windows 8. Most run Windows RT.Buy this tablet and you will not regret it.", "Title": "Great Alternative to Android and iPad tablets!", "Date": "July 15, 2013"}, {"Author": "FranzCTL", "ReviewID": "R2UFCM5LARFWI3", "Overall": "4.0", "Content": "I had my doubts when I bought this product, however, iy has had an excellent performance. I had a few bumps in the beginning, because for both windows update software asus and of the process was quite tedious. Then I had to wait a couple of days to activate the license of windows, and even more so to sync my accounts to mail, games, calendar, etc..But I'm really happy with the portability, how well it performs the functions of different applications. Windows 8 really works well on touch screens, this is the future, and while the tablet has its restrictions, fully meets everything it promises.", "Title": "Really nice product", "Date": "June 23, 2013"}, {"Author": "changchar", "ReviewID": "R365QAIVVWTUBH", "Overall": "3.0", "Content": "Pros:Works fine, powerful cpu compare with other tablet.Cons:You realy need OTG cable for it since is dose not have USB portThe touch screen exprience is very frustraiting. For example if you wanna close some app, you need slide your finger from top of the screen to the bottom, which is almost impossible to do sometimes since the trail shows my input was a series of discontinuous dots! Maybe its the screen, or the windows 8, I don`t know.", "Title": "The touch screen sucks", "Date": "June 21, 2013"}, {"Author": "Amanda \"tigger79\"", "ReviewID": "R2G36QF3U2X6OJ", "Overall": "3.0", "Content": "Item was shipped fast and was factory sealed. However I ended up sending it back to the manufactur do to the screen bleeding through. The company said it was cause the bulbs in the screen were broken. Waiting for the company to fix and return it to me.", "Title": "tablet", "Date": "June 1, 2013"}, {"Author": "J. P. Frechette", "ReviewID": "R3SIRCKC5X3MJA", "Overall": "5.0", "Content": "I have own several tablet in the past few years, from iPad 1,2,4 , Asus transformer Infinity tf700t, Galaxy Tab 10.1 and galaxytab 2 7inch, Toshiba 10.1,Acer a200 Acer a500, Acer a700, hp Touchpad, BB playbook, surface RT some Chinese windows xp tablet and the nexus 7. I love tablet, and I always have the latest ones as soon as they are out.I now came across my favourite of all time ; Asus Vivotab Smart.Pro :Very fast and smooth windows 8 experience, unlike the Surface RT and my laptop.Very good touch response, as good as the ipad4.Excellent display, you almost forgot the low res.Battery just as good as the iPad and nexus, even with the full desktop experienceRun everything, no apps needed. I love using Torrent on a tablet.Comfortable to hold both way, good soft touch backing.Cons;Screen, even if very clear should have been higher res with software solution to make icons big enough to touchThe tablet don't charge when using it plugged in, draw too much power for the supplied usb chargerStereo sound would be nice, only one weak speaker on the leftCan't use Bluetooth headset while using WiFi, the signal interfere with each other.Does not work properly out of the box, you have to update everything from bios to windows to get the market to work and some gestureThis one, I will keep for a longer period than all my other tablets that I normally change every 4 month or so.I don't think I will go with android or ios anymore on tablet.They are great on phone but they are now obsolete on tablet thanks to this superb tablet from Asus.", "Title": "The best tablet.", "Date": "May 31, 2013"}, {"Author": "Shu Hiranuma", "ReviewID": "R3U0FNKXX8ME2Y", "Overall": "4.0", "Content": "Bought as a toy, but can be used in work in emergency.I found it little slow when reading PDF, but other than that, it is a nice tablet.", "Title": "Good", "Date": "May 28, 2013"}, {"Author": "Ian", "ReviewID": "RJ5QE7CCYLQQO", "Overall": "4.0", "Content": "I purchased this product at Best Buy using a warranty trade in for my expiring/malfunctioning Asus Transformer Android tablet.  I would have purchased it here, but the $300 savings due to the warranty trade-in was something that made it worth dealing with BBY (add in the AMZ price matching for taking an extra $40 off the device! YAY Amazon!).I really like this tablet, it can do *almost* anything a normal laptop can do.  I am a power-user as a computer professional and had to get used to the fact that my normal usage patterns would bring this thing to it's knees.  Do NOT think that this is a desktop/laptop replacement as the Surface Pro is.  It's not, it's not a knock on the device as there's a WORLD of difference between a quad-core Atom and a quad-core i5 processor and there are no USB ports.  For the price of any other Atom 1.8GHz Windows 8 tablet, why spend more?  You don't get any more memory (only 2GB, but it's a tablet) or processor speed/power with those for the extra $100 price tag that most of them carry.All that said, I use this thing almost daily and it can do almost anything that I need it to (like I said, I have laptops and a desktop for a reason. I'm a power user). If all you do is surf the web, email, and use Facebook/G+ then maybe you could use it as a much more svelte laptop replacement.  I use this mostly for recipes (so much nicer to wipe a screen than read a wet/messy recipe), reading/studying, and Xbox Smartglass in addition to the aforementioned tasks and it holds up quite nicely.  The only thing that's kind of disappointing is the lack of a 5Ghz radio for Dual-band Wireless-N support.  All in all, I think it was a pretty good investment and I can stop pining for a S-Pro...  for now anyway :)", "Title": "If you don't want the Surface Pro expense, this is a decent alternative.", "Date": "April 9, 2013"}, {"Author": "Robert Makela", "ReviewID": "R2O7TAUG4YGALW", "Overall": "3.0", "Content": "It's pretty. The screen sometimes is unresponsive. The speaker BARELY works...it's actually really suprisingly awful...my phone from 2002 has a better speaker in it.  Once you plug it in to charge, you have to watch until the little LED light turns to white and unplug it or you will over-charge this tablet...no...it doesn't come with over-charge protection which is craaaaaazzzzy in this day in age.  Sooo it takes forever to charge, but no plugging it in when you go to bed because you might just over-charge this.  I'm sending it back.", "Title": "It's OK", "Date": "April 4, 2013"}, {"Author": "Francis Lai", "ReviewID": "R2VOWU7RILVSFV", "Overall": "3.0", "Content": "I would have given a higher rating but the product came without an important information: Windows product activation code! I'm still trying to figure out who to approach for this.", "Title": "Missing Item?i", "Date": "May 11, 2013"}, {"Author": "erica", "ReviewID": "R1ZW8HZSP02ROH", "Overall": "3.0", "Content": "I recieved it and it already had problems. I have to send it to get it fixed. Very dissatisfied that i paid for new and got half broken", "Title": "not happy customer", "Date": "March 19, 2013"}, {"Author": "D. Wilson", "ReviewID": "R2OH8MM62GL7ZA", "Overall": "1.0", "Content": "Pros -1) touch screen worked shockingly well (felt nicer than my Ipad 2)2) Windows 8 looked nice, visually more impressive than my ipadCons -1) Long boot times2) Frequent crashes3) Performance issues when not running any apps at all! (Atom/2gigs is just not enough with Microsoft Office and a web browser)4) Acer software causes boot issues and Microsoft recommended removing it5) Issues with Adobe Flash sites6) Codecs not playing movies, no easy way to resolve.7) Windows updates causes BSOD8) Recovering from sleep was problematic and broken9) Evenlog was FULL of errors about Windows updates and Asus software out of the box. Sometyhing seriously wrong with the stock image asus sends, no included method to install a clean Asus-junkware free install.10) Often mis-detected my lan speedNote:1) Didn't realize this was a 32bit OS at the time of purchase, I needed to read more on that. But doesn't excuse the above.", "Title": "Disappointed", "Date": "June 24, 2013"}, {"Author": "Amazon Customer \"SFX guy\"", "ReviewID": "R1IQ43MZQU248G", "Overall": "3.0", "Content": "Im a windows guy, not mac, but even though asus made a beautiful tablet windows renders it so useless. On a tablet this size, every drop box, check box  etc is so small there is no way to use regular size fingers.I wasted hours trying to get applications to work on here, the skype thats on here wouldn't work no matter what i tried, the kindle never loaded, spread sheets are so small with all the menus u need a magnifying galss to see them, or spend all day zooming in and out.  You need to sign into msoft for almost all functions on the front screens. Sadly I would have to admit that for ease of use in a tablet, ipads the only way to go, my dad was useing an ipad in 15 min, after 2 hours on this thing he told me to trash it.It is beautifully made, but pointless.", "Title": "Beautiful product by asus, useless operateing system.", "Date": "May 28, 2013"}, {"Author": "BidsWOW", "ReviewID": "R36N63PVT88QY2", "Overall": "5.0", "Content": "I ordered this amazing Tab.  It is beautiful, thin and works wonderfully.  Charge it first.The sellers is the best in the world.  Truly.  It arrived immediately.I loved windows 8 but was missing droid.  I downloaded Droid that runs on windows from BidsWOW.comWorked amazingly well.  Highly Recommend it!  Five stars for the seller and the Tab.It's so cool to have Windows 8 and now all my Droid apps, too.", "Title": "Fantastic and can run Droid on it also from BidsWOW.com", "Date": "May 24, 2013"}, {"Author": "pcguy", "ReviewID": "R1AR65FG30I2WJ", "Overall": "2.0", "Content": "Speaker is in the wrong place. Once tab is in your hands you are covering the speakers and the sound is diminish and it changes it or lowers it.UpdateTab also feels hard to hold like not balanced properly and the edge is slippery. Not as easy as an ipad or the dell 10 pad.", "Title": "Speaker is in the wrong place", "Date": "May 22, 2013"}, {"Author": "Taco", "ReviewID": "R1O0HBEN2NQOK2", "Overall": "4.0", "Content": "The features of the tablet itself is so great! I'd loved to keep it but I just cannot get used to Win 8 and the limited app.", "Title": "Great tab but not satisfied with Win8", "Date": "April 1, 2013"}, {"Author": "Niclas Tanhua", "ReviewID": "R1FH97UXGU38UZ", "Overall": "1.0", "Content": "Just an add to your wonderful reviews.My glass broke on the 4th day I had it.Lying on my bed, with the screen down and a duvet on top.I leaned a little on it and it broke. That is just not good enough.Windows Surface initially costs more, but it has quality.[...]The charge is about 340 USD to get it changed.So sad because otherwise I really like it, but it is not good enough.If you have one, Buy a cover asap.----------------------------------Follow up:Screen cracked again :-( and I have even used a cover this time.This is my first IT equipment that cracks. I've used iPhone since 2007, and many laptops.I am working as an IT consultant and are used to handle IT equipment. I am gentle with IT products.This has happened to many people. Just google it.Here is a site where you can sign for a petition:[...]Another link where this is talked about:[...]My strong recommendations:Do NOT buy or recommend ASUS products to any friends until we see how they respond to this petition.If they use bad quality, and refuse to have any guarantee for the products, then it is simply not worth buying.", "Title": "Important consideration - Glass brakes (340 USD to fix)", "Date": "April 11, 2013"}, {"Author": "inder32", "ReviewID": "R1TBNCNA4K4P5N", "Overall": "3.0", "Content": "wait to test its functionality even i am aware window 8 is a crap but want to give a try .", "Title": "asus", "Date": "March 25, 2013"}, {"Author": "Michael Iveson", "ReviewID": "RKN8U48J0ZTOU", "Overall": "1.0", "Content": "This tablet is too small for Windows 8 - nobody has fingers small enough to utilize this operating system.  In addition, because of the limited memory - 2GB - it is very slow. Too much bloatware also!", "Title": "Windows 8 not good", "Date": "April 4, 2013"}, {"Author": "rede \"rede\"", "ReviewID": "R3M5TUL7CUH8DT", "Overall": "1.0", "Content": "I do not have this item.But I called customer service to ask a question.And got no where.So,though Asus may make a good product,I wouldn't be interested.The aggravation is not worth it.This is a Co. that boasts about their products,and spends money on ads,but when you need assistance they don't make much of an effort to help.", "Title": "poor service", "Date": "May 13, 2013"}, {"Author": "Random Reviewer", "ReviewID": "R3HQCFZD58QJ9O", "Overall": "2.0", "Content": "The \"micro-USB\" interface can only be used to charge the tablet.  It CANNOT be used as a USB port to transfer data.  That makes it very inconvenient to transfer large files to the tablet which cannot be easily transferred via email or some other wifi method.  If I had known that I would never have bout this tablet.  I was told all I needed was an adapter to use it as a regular USB port to transfer files to the tablet which I need to make it productive.  I contacted Asus help which after 2 days first told me to try resetting the tablet to its factory settings (which of course wiped out all my apps and customized settings) and try again.  That took several hours after which it still didn't work.  Then I contact Asus help again and was told the micro-USB port CANNOT be used to transfer data.  Its only function is for charging the tablet.  Why do they call it a \"micro-USB\" port then?  It's not any form of USB port other than it looks like one and you can use a USB cable for charging.Also, the manual is worthless other than to show you a picture of the front and rear of the tablet and where buttons and connections are.  Even on line the only instructions posted are the exact same manual with no greater explanation of how to use the device.Then there is Windows 8 and IE 10.  As usual, Microsoft has changed things around so that all the ways you are used to doing things no longer work.  Places you are used to looking for things are no longer there.  They claim the \"Desktop\" will function just like the old Windows we're all used to which for the most part is true (although good luck navigating with your finger on a touchscreen) but in the few days I have had the device I have run into a number of programs (and websites) that do not function 100% correctly in the Windows 8 and IE 10 environment.  Using Chrome to surf the web just ran into different obstacles on various sites.If you purchase the optional keyboard (and you pretty much have to in order to use the \"Desktop\" as well as to follow the Asus help instructions which tell you to select the \"Shift key\"), beware it is very flimsy and cumbersome.  The \"Transleve\" is just a foldable cover that awkwardly connects to the tablet or the keyboard with magnets.  Essentially, there are three separate elements (tablet, keyboard and \"sleeve\") that do not integrate well together.  It is nothing like docking the tablet to a keyboard which serves as a stand.  Do not try to use these on your lap or in bed!  On a desk they are barely manageable.  The tablet slides out of the stand (aka folded \"transleve\") if you blow on it.The battery life is very disappointing.  Even without extensive video use, it has lasted 5.5 hours at best.  Also, the manual does say do not leave the tablet charging for extended periods of time -- like overnight when most of us would charge it?The automatic display light level must be turned off.  Otherwise, it changes the screen brightness every few seconds which is very annoying.The only good thing is that the processor appears to be pretty fast with little dead time between operations.  Video plays well although the display is not the greatest.  Audio is allegedly \"stereo\" but from only one corner of the back of the tablet.Overall, a very disappointing product which Amazon will be receiving back shortly.", "Title": "Beware of Misleading Asus Claims", "Date": "February 28, 2013"}, {"Author": "wcg70", "ReviewID": "R2P9OW2G5FL49S", "Overall": "2.0", "Content": "I purchased this on Friday, 2/22, at Best Buy, and returned it today (2/25) for an Ipad.  No matter what any of the other reviews here say, DO NOT PURCHASE this tablet.  You will not be happy.  Here's why:1. Universal to Windows 8:  Poor selection of apps.  I knew this was a fact when I purchased..but you don't really realize how bad this is until you own a Windows 8 tablet.2. Desktop mode is next to useless.  Yes, its full Windows 8, but the Intel Atom processor is slow, and the screen detail in desktop mode is WAY TOO SMALL.  You will grow tired of it quickly.3. The tablet is TOO WIDE.  Yes, its great for 16:9 movies, but it just feels too wide in your hands, especially when trying to type, and portrait mode is a joke.For the cost, it just doesn't feel worth it.  You will regret buying this device.  I sure did.", "Title": "Slow and unusable.  DO NOT BUY.", "Date": "February 25, 2013"}, {"Author": "Chips", "ReviewID": "R2D5NZLNX4QXHS", "Overall": "2.0", "Content": "You can not load windows programs on the ASUS VivoTab RT. Also, you can not load any Google APPS and you are tied to AT&T.;  It is basically a large Windows 8 like phone.", "Title": "Not a Windows Device", "Date": "February 18, 2013"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B00AA6OVAO", "Features": "Windows 8, 10.1 inches Display\nIntel Atom Z2760 (1.8GHz) Saltwell Dual-core\n64 GB Flash Memory, 2 GB RAM Memory\n802_11_BGN wireless", "ImgURL": "http://ecx.images-amazon.com/images/I/416F%2B%2BUMckL._SX300_.jpg", "Name": "ASUS VivoTab Smart ME400 ME400C-C1-WH 10.1-Inch 64GB Tablet (White)"}}