{"Reviews": [{"Author": "Sky", "ReviewID": "RNR5LLTEU56H5", "Overall": "4.0", "Content": "It's a great tablet and everything on it works real smooth after upgrading ICS. The con is that the battery life has 3.5 hrs only.", "Title": "Xyboard 8.2 tablet", "Date": "March 11, 2013"}, {"Author": "Alan Guzman", "ReviewID": "R3DK95EJF11JD0", "Overall": "5.0", "Content": "This tablet is supreme. Its super thin unlike a bunch of other tablets and it fits perfect in on hand. As far as software and hardware its just there woth my friends ipad. Im glad i got this instead of an apple.", "Title": "love xyboard 8.2", "Date": "December 29, 2013"}, {"Author": "David \"Hellicopter Man\"", "ReviewID": "R36PMKBWCVZK9L", "Overall": "5.0", "Content": "Excellent screenThe speaker is loud with above average qualityFastI have about half a dozen small tablets and this is my favorite. However the Vizio 8 inch inch has even better speakers and better screen but needs a speaker boost app for volume. I forget the app name but it warns to be carefull not to damage the speakers. But it works and the vizio speakers are up to it. I prefer the 3x4 Vizio aspect ratio for netflix and reading but for general browsing it is slow.PS. A.I.Type is the best keyboard by a big margin.The vizio screen is pre tinted and does not blind you with harsh white. I put a tint app on this Motorola.", "Title": "A best Buy", "Date": "April 12, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RY943LMNHCNY1", "Overall": "5.0", "Content": "I love it! It does everything i want it to do. I just wish there were more accessible accessories. On one sells 8.2 accessories", "Title": "tablet", "Date": "January 4, 2013"}, {"Author": "John Oyer \"joyer\"", "ReviewID": "R5DVU2YIMMR7W", "Overall": "3.0", "Content": "Tablet operates really well. Great operating system. the size is large enough, but not too large and the weight is ideal. Problem is that they use the same power cord connection that the Nook employs and it has a tendency to become loose and not make a tight connection. That is my only complaint. Why not use a pin connection and avoid the problem. It is not a light weight phone as designed.", "Title": "Good tablet, Right size", "Date": "March 25, 2013"}, {"Author": "MB", "ReviewID": "R2XLOMG8K3WB47", "Overall": "1.0", "Content": "The product was returned, because it was absent of any paperwork within the packaging. I've often taken advantage of non retail packaging, but this one didn't even have warranty information. The protective screen plastic it was shipped with which usually has Motorola printed on it and has some basic instructions, was clear. I spoke to Blutecusa if it was a quality control issue and they said, no, only the Tablet and charger are shipped. They did not reassure me, this is from Motorola. I have serious doubts about if this is a \"new\" unit and will be honored by Motorola.", "Title": "Questionable if New.", "Date": "January 8, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00AC7D5FS", "Features": null, "ImgURL": null, "Name": null}}