{"Reviews": [{"Author": "lanibug", "ReviewID": "R1Y2U4XM5TUBQC", "Overall": "4.0", "Content": "i've bought a few other tablets and sold them because i didn't like them. this tablet is differents. you don't have to push on the screen at all, just swipe. it's fast and easy to manuver. i really love it! and if you are looking for a case for it, go for a nook hd+ case, it's almost an exact fit. just a little big on the side, maybe by an 1/4 an inch.", "Title": "awesome tablet!", "Date": "January 25, 2013"}, {"Author": "Recaldo Brotherson", "ReviewID": "R719UKZQIYLE", "Overall": "1.0", "Content": "when I got the tablet I started to set it up, I added the micro sd card and it just shut down. now the only thing I see now is the android logo. tried to reset it and the settings are in Chinese", "Title": "it stop working in less than 24 hours", "Date": "July 27, 2013"}, {"Author": "Javier Semprun", "ReviewID": "R22A3HYU3RFTMN", "Overall": "1.0", "Content": "The product arrived defective, damaged the touch to be exact, Touch Band in disrepair, not recommended. For this reason I give this rate.", "Title": "defective Product", "Date": "October 4, 2013"}, {"Author": "Lorena P.", "ReviewID": "R2O13JY7JKJC8R", "Overall": "1.0", "Content": "I bought to my daughter and the firs week everything that we downloaded stopped working, could not play any more more on it and about a month it stopped charging, so I thought it was the charger I order a new one still didn't work. would not recommend it at all.Very dissappointed!!1", "Title": "would not recommend it", "Date": "October 3, 2013"}, {"Author": "denyael griffee", "ReviewID": "R3FT407G6AF31T", "Overall": "5.0", "Content": "I ordered this for my grandmother and she loves it. She can't get up to use the computer as often anymore, so this is a good option for her to browse the web. I also put Kindle on it so she can now read her favorite books in big print :)", "Title": "Met expectations wonderfully", "Date": "June 16, 2013"}, {"Author": "Benjamin Starr", "ReviewID": "RPACA3KIF868N", "Overall": "2.0", "Content": "I just needed a tablet for the kitchen, to look up recipes and pull my own from my Google drive and website.  So I didn't want to spend a lot of money.  The 7\" version of this tab got great reviews, so I assumed the lesser-reviewed 9\" version would be fine.  WRONG!  This tablet is laggy as all heck.  Think back to the days before Edge data networks came around for your cell phone, when it took 5 minutes to load a normal webpage.  That's what this tab is like, even when sitting RIGHT next to the wireless modem.  I also tried downloading Google Earth to see how it responded, and the app was too data intensive for this tab.  It just couldn't resolve the resolution, and forget zooming or moving to a different location.  I had my doubts that a quality tab could be manufactured at this price, and I was right.  As long as you have an infinite amount of time at your disposal to browse the web, and it doesn't annoy you to move from a cell phone that, connected to a data network, outperforms this device EXPONENTIALLY when it's connected directly to wifi, you'll be fine buying this tab at a fantastic price.  But expect the speed and technology of mid 2000s data networks and devices.", "Title": "Laggy as all heck", "Date": "April 7, 2013"}, {"Author": "bmgarza74", "ReviewID": "R14LPHXRQ32VVI", "Overall": "2.0", "Content": "The charger that came with the tablet does not work. We have been having to use the cell phone charger instead. Plus it does not always recognize an internet connection so we have to shut it off then back on again.", "Title": "Problem", "Date": "September 30, 2013"}, {"Author": "Chyna Talley", "ReviewID": "R2RQDJECWMGG13", "Overall": "4.0", "Content": "I bought this for my husband, He loves it! It is fast easy to use, and great price. We love it.", "Title": "VEry good and fast.", "Date": "August 22, 2013"}, {"Author": "Someone54", "ReviewID": "R2UQ3HC51Z0ATE", "Overall": "5.0", "Content": "This is a great tablet. Since I've gotten it, I've been using for just about everything. Plus when I plug into the AccuRave ELM327 Bluetooth OBD2 Diagnostic Code Scanner - Scan Tool Check Engine Light CAR Code Reader - Android Compatible, I have one handy tool. In any case, this is a terrific device. I recommend if you are looking for a great tablet.", "Title": "Love this tablet", "Date": "July 22, 2013"}, {"Author": "dollface", "ReviewID": "R3D2333QNZB30S", "Overall": "4.0", "Content": "For a tablet under $ 100 it is actually pretty great. There are complaints about it not keeping charge, for the first day it won't; it wont get past 2 hours. Second day it graduated to three and by the fourth it kept a charge for about 4 1/2 to 5 hours. I guess by cycle charging (letting it completely die then charging it) it builds up so upon getting it, it might be best to walk with your charger if you plan extended useage just as you would with your phone. It's laggy, very laggy at times. Pausing up to 3 minutes to open newly installed apps or while you are toggling between multiple applications. But I guess at $ 85 that's the cut back you get. It runs google play so that's a big plus and its also has adobe flash installed which is a mega plus as most tablets actually don't carry that feature even if they say they do.Other than the lagging I love it. Only other drawback is it doesn't have swype on the keyboard but thats a software problem.", "Title": "Great for the price", "Date": "May 10, 2013"}, {"Author": "Kirsten", "ReviewID": "R28BDJ0T8O26JL", "Overall": "3.0", "Content": "Not the fastest browser or the best, but not bad for a tablet. You get what you pay for. Decent memory on this one, quick delivery.", "Title": "not the best or the worst", "Date": "December 30, 2013"}, {"Author": "R. Austino", "ReviewID": "R11ILTUGRBYMNS", "Overall": "5.0", "Content": "I received my Tablet 10 days prior to the promised delivery date. It works great and was easy to set up and navigate. The service was excellent.", "Title": "Great Product from a great seller", "Date": "December 22, 2013"}, {"Author": "anita james", "ReviewID": "R112AJB94IWZ52", "Overall": "1.0", "Content": "very disappointed in connection of internet.  camera only took picture from one side, internet didn't always pick up when in the same room.", "Title": "slow!", "Date": "December 14, 2013"}, {"Author": "valerie whitford", "ReviewID": "R2TBO5HN20O9E9", "Overall": "5.0", "Content": "Good tablet, great buy, and the right size. My friend was so happy to have her own tablet to play games on.", "Title": "Great buy", "Date": "December 12, 2013"}, {"Author": "Doriag", "ReviewID": "R1B2UK417FNFR3", "Overall": "1.0", "Content": "I bought this cheap one to see if I liked using a tablet, before investing in a more expensive one.  It's a piece of crap, and not worth even the low price.  The clock on it is set for China time, and there is no way to change it.  About all it's good for is storing pdf documents on it.  A true waste of money.  Battery life is very short.", "Title": "Waste of money", "Date": "December 10, 2013"}, {"Author": "Sylvia V Antonio", "ReviewID": "RWN5SPDH2K307", "Overall": "1.0", "Content": "did not like this at all.  i bought this to be able to use many apps, but unfortunately this idem does not support any 3rd party apps.  so i was not able to use things like my brighthouse tv app.", "Title": "did not like it", "Date": "December 10, 2013"}, {"Author": "benny", "ReviewID": "RGCICCH99NDBH", "Overall": "1.0", "Content": "very slow does not stay conected to wifi not bright enough of screen some android games don't work on this tablet not a very good cramra", "Title": "total pice of cheap crap", "Date": "November 25, 2013"}, {"Author": "Lizj22", "ReviewID": "RLS3KFJ975V07", "Overall": "3.0", "Content": "Looked and probably worked good. But I had to return it because it was a gift for my grandson and his momma said no.", "Title": "Nice", "Date": "November 16, 2013"}, {"Author": "Victor M Miramontes", "ReviewID": "R1XKX9BWRFK5BV", "Overall": "1.0", "Content": "Save your money and get a faster and better tablet like the nexus 7. This tablet is not worth it, its too slow and the storage is horrible.", "Title": "Way too slow.", "Date": "November 12, 2013"}, {"Author": "Trevlyn", "ReviewID": "R3KO8CXPIYZXN9", "Overall": "1.0", "Content": "RECENTLY received this item, it worked for 2days good, day 3 it frooze, I took it off for a bit and turned it back on. Day 5 it started freezing up. Took it off and left it off a bit longer and Now when it does come on ONLY the Android Logo is on. Eventually it just wasn't coming on. Took it to a Technician only to be told \"It cannot be repaired and he has gotten alot of Tablets like this and similar and they're Not designed to last very long and most of the times the software is the issue\"...... I AM VERY DISAPPOINTED BECAUSE THIS TABLET LASTED 1 WEEK and in my currency its costly... I'm going to try and return it, let's hope that I get EFFICIENT SERVICE", "Title": "WORKED FOR  2 DAYS", "Date": "November 1, 2013"}, {"Author": "Lesha", "ReviewID": "R1PKXD9PEDMVGG", "Overall": "5.0", "Content": "very nice especially for the price. does pretty much every thing an ipad does but @ a much better price", "Title": "great product", "Date": "July 13, 2013"}, {"Author": "charm", "ReviewID": "R1MG70IJRQ1L3T", "Overall": "4.0", "Content": "It was as expected. I like it and it matched the description and info. displayed. Have to give it a week to see how efficiently it works.", "Title": "Tablet", "Date": "June 29, 2013"}, {"Author": "edgar tintin", "ReviewID": "R1BRX69GBL5N84", "Overall": "1.0", "Content": "I got this and its very slow, its not hd at all and theres only one camera in the front but it doesn't work for Skype or oovoo callings. don't get this", "Title": "really horrible", "Date": "June 27, 2013"}, {"Author": "ok", "ReviewID": "RTEFF3UGVYMJV", "Overall": "2.0", "Content": "The tablet is not too bad all in all... but had it for two says and screen shows a line that cant be removed...", "Title": "not a good buy", "Date": "June 25, 2013"}, {"Author": "Stephanie Wedgeworth \"Steph\"", "ReviewID": "R2SP20M2I6ATGX", "Overall": "1.0", "Content": "Do not waste your money. Save a little more and get a better brand. This tablet froze on the start-up android screen after the first day. Tried all the button combination to reset the tablet but nothing worked. I had to send it back for a refund and I had to pay for the shipping.", "Title": "Froze up after the first day!", "Date": "June 10, 2013"}, {"Author": "num5of9", "ReviewID": "RG91B2CMTFOW6", "Overall": "5.0", "Content": "I hadn't entered the tablet world yet and just wanted something to read books on while commuting or on trips.  I didn't want something too small or too expensive.  This fit the bill and it works great!  I have discovered how to use it with Wi-Fi, get internet, mail, facebook, weather, stream movies & tv, .  It's just the right size for me to read books without feeling like I turn pages every 2 seconds.  And it works with Kindle software & amazon bookstore, which is great.  Oh, and for such an inexpensive one, it has great response time, too.  I really love it!", "Title": "Great Buy", "Date": "May 11, 2013"}, {"Author": "loveamazon", "ReviewID": "R1HUSWWPOZVT4J", "Overall": "5.0", "Content": "I purchased this tablet for children for the holidays and they love it. It works so well I had to purchase one for myself. I love this tablet.", "Title": "Love this tablet", "Date": "January 7, 2014"}, {"Author": "Donald W. Campbell", "ReviewID": "R3KNUCS6RAG0RK", "Overall": "3.0", "Content": "You get what you pay for, and I didn't expect this to outperform my Nexus 10.I got it for my Father, to be used as a web-cam browser for a Sapido BR07 with Microsoft web-cam attached. (Amazon used to let you do product links, but they shouldn't be too hard to find.[a high-tech 'peep-hole' in his garage entry door.]) It needed to be easy and reliable.  It made the easy part, but would freeze the display after 3-6 hours.For some purposes, this would not be an issue, but if someone is banging on your solid wood door, you don't have time to power down, reboot, bring up the web browser, log into the Sapido and then bring up the web-cam.Anyway, I gave him my Toshiba Excite Pro (real garbage, but reliable... I was using it as a clock.) and plan to use this device to learn how to 'root' an android (not like it is a big loss if I brick it).Overall, who has ever heard of Alldaymall anyway?  I wasn't expecting top notch.The tablet face is actually pretty good, and it responds well to touch and gestures.  It is a little thicker than high-end tablets, and the backside is a white plastic.  The buttons work well, but are strangely placed.  Where you expect the power button, is a hardware back button, but the power button is on the side.  Has a micro-SD port for more memory.  Downside, the power is provided via a proprietary plug, not a micro-usb.  Less than 'stunning' resolution, but an adequate 800x480 display.", "Title": "Cheap, but OK", "Date": "December 31, 2013"}, {"Author": "nonnie", "ReviewID": "R19RVD4RR8E2D5", "Overall": "3.0", "Content": "This tablet advertises a camera, has a camera app, but there is no focus lense.  Is there an external device that allows you to take pictures", "Title": "No camera", "Date": "October 20, 2013"}, {"Author": "Peggy Andersen", "ReviewID": "R1708YF3E587JL", "Overall": "4.0", "Content": "I'm loving it - Just be sure to fully charge the battery the first time, it took more than the 6 hours recommended. The charge on the battery doesn't last as long as I would like, but knowing this I'm just frugal with how I use it, like dimming the screen, only having the wifi connected when I'm using it, and turning it off when not in use.", "Title": "Great device for the money", "Date": "October 15, 2013"}, {"Author": "AngelPhBalt", "ReviewID": "R3OWMQRWPVX4ZZ", "Overall": "1.0", "Content": "This could be the worst thing I had ever bought! Seriously, The usb does not work, The charger does not work -n- Tablet software get stoked when I'm using it.....", "Title": "AWFUL", "Date": "August 2, 2013"}, {"Author": "Plateado", "ReviewID": "R35VDDJOILQLAM", "Overall": "4.0", "Content": "Nice  tablet  for  the  price....you  can check  your email  ,download  music  and movies....the only  complain  is  the  poor  volume  but other  than that  is a  great  tablet.....", "Title": "Nice  tablet  for  the  price ,good  to  check  your email,download movies,music  and more the  only  complain  the poor  sound", "Date": "July 23, 2013"}, {"Author": "Alexander Robert Mock", "ReviewID": "R21PKCMCRF6NHG", "Overall": "1.0", "Content": "I hated it do not buy it didn't give me correct stuff and the quality sucked and its in chinese", "Title": "it sucked dont buy it!!!!!!!!", "Date": "July 17, 2013"}, {"Author": "Jane White", "ReviewID": "RZP6ZNABG2N7I", "Overall": "3.0", "Content": "I could not tell you anything about this because it was purchased for my sister who insisted on this is what she want for a tablet.", "Title": "Sister want this", "Date": "July 11, 2013"}, {"Author": "Angeline", "ReviewID": "R1DWXAEG1FKQDW", "Overall": "2.0", "Content": "Not what i expected. It lags alot and is slow. The browser sucks. I guess you get what you pay for..........", "Title": "Lagging", "Date": "May 9, 2013"}, {"Author": "Wobo26", "ReviewID": "R24TYG4W6AL7HQ", "Overall": "1.0", "Content": "This tablet doesn't hold a charge. I go to use it and it dies. I charge it all day with it turned off and I turn it on and it says it has 10% battery. I hate the thing", "Title": "Hate this tablet", "Date": "April 30, 2013"}, {"Author": "dg", "ReviewID": "R2K3UNSA85T988", "Overall": "3.0", "Content": "I purchase two of these for my nephews. So to be honest i really cannot comment on it performance. Upon receiving them i just booted up one and tested it out for a couple minutes.", "Title": "Fits the bill", "Date": "August 21, 2013"}, {"Author": "Lorena", "ReviewID": "RMPVTUUONEE4D", "Overall": "4.0", "Content": "The truth that I really liked this tablet for children is easy to handle, my niece is very happy with the gift, is also a good price .. thanks amazon for making people happy", "Title": "Awoseme....", "Date": "March 30, 2013"}, {"Author": "jackie pennington", "ReviewID": "R2WG2PIEJCGY08", "Overall": "2.0", "Content": "Today is the first day I had the item and I can't even get on youtube as of yet.......what type s*** is that....I guess u get what u pay for", "Title": "rating", "Date": "February 20, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00AXWLGIU", "Features": null, "ImgURL": null, "Name": null}}