{"Reviews": [{"Title": "Birthday gift for my nine year old son", "Author": "Jessie Johnson \"Jay\"", "ReviewID": "R240Z60SK1SY5C", "Overall": "5.0", "Content": "I purchased this item based on it's price and quality.  My son absolutely loves playing games, searching the web (and other social media) on this tablet.", "Date": "October 8, 2013"}, {"Title": "Think about what you're NOT getting...", "Author": "Amazon Customer", "ReviewID": "RLLU8SVO6PY6J", "Overall": "3.0", "Content": "Not being able to access the Google Play Store is really annoying.  I wish I had thought harder about that before purchasing.Otherwise, the tablet is fine.  Impossible to find a good childproof case for it though.", "Date": "August 29, 2013"}, {"Title": "love it, love it, love it !!!!!!", "Author": "Felisa C", "ReviewID": "RMBXT56CCMC6M", "Overall": "5.0", "Content": "Love the tablet small enough for lil hands I loce the fact it has children books already downloaded and that it has the ability to read the books or have the tablet read them to the child. Love it love it love it!!!!!!", "Date": "August 24, 2013"}, {"Title": "Google Play does not work", "Author": "Bammbamm69", "ReviewID": "R2EJXSDZM5KRAP", "Overall": "2.0", "Content": "For a kid this tablet may be fine, for adult not recommended. Was not possible to install Google Play .", "Date": "August 15, 2013"}, {"Title": "Bad quality", "Author": "Madison", "ReviewID": "R3NOZOMG8VSUD3", "Overall": "1.0", "Content": "The very first time I turned it on, the tablet began to glitch like crazy. It was very slow and the camera wasn't good at all. I returned this tablet shortly after receiving it. I would definitely suggest you avoid buying this.", "Date": "August 10, 2013"}, {"Title": "My daughter loves it!", "Author": "Kellie", "ReviewID": "RDMM08LNY3WVL", "Overall": "5.0", "Content": "We got this for my daughters 4th birthday.  She absolutely loves it.  First we got her a leap pad, but she still preffered my ipad.  she calls this her ipad and doesn't even consider mine anymore.....YES!!!", "Date": "August 7, 2013"}, {"Title": "great buy for kids", "Author": "Jansha", "ReviewID": "R3M5L72OGYY1F5", "Overall": "5.0", "Content": "I bought this for my 9 year old and it works great, she loves it. it is great for children", "Date": "July 26, 2013"}, {"Title": "Great little tablet", "Author": "A. Stettler \"avisace\"", "ReviewID": "R363HE0L01NM6I", "Overall": "4.0", "Content": "I bought this for personal use when I travel or on long flights.  If you are looking for something to use occasionally, like I was, this is a great unit.  I have played movies, searched the net, and downloaded several apps, all without problems.  The display is good, a little dim when viewed at certain angles, but not a problem if your the only one watching! The battery lasts for several hours, and the sound is good too.  It is a bit on the slow side, but unless you are trying to run large games, you probably wont notice.  I would recommend this to anyone looking for a part-time tablet.Update:  I have been using this tablet for about six months, and so far have not had any problems. I use it to check e-mail, play apps, watch movies, and listen to music.  I take with me when I go out, and it has been great.  I even dropped it once, it popped the case apart a little, but I just snapped it back together, and it still runs fine. I have not had any issues with the battery, or the screen, so I'm still loving this little tablet.", "Date": "April 19, 2013"}, {"Title": "for the money it's decent.  moves a little slow.  shoulda just got an kindle reader, since that's what i'm using it for.", "Author": "Ryan Bergthold", "ReviewID": "R15I4WHEMR899T", "Overall": "3.0", "Content": "for the money it's decent.  moves a little slow.  shoulda just got an kindle reader, since that's what i'm using it for.pretty much.  really nice resolution.", "Date": "March 11, 2013"}, {"Title": "My first tablet", "Author": "Andrea", "ReviewID": "R2M1SQ8CAI6WPF", "Overall": "4.0", "Content": "I have been searching for a tablet pc for awhile now.  I bought this one for about $80 at Walmart because I wanted to download some French lessons (video), and I also wanted an ebook reader.  This one fits my needs.For $80, I feel like I got a good deal.  It's not an ipad, but I didn't need an ipad and didn't want to spend $400.  The French lessons downloaded well on WiFi, and it comes preloaded with Aldiko, although I'd like to get Overdrive Media Console to download library books.It connected easily to Wifi; battery life is short when it's connected, though.  When I play games (I like solitaire), the battery lasts much longer.This tablet is designed in the USA and manufactured in China, and overall I'm very happy with it.  It does have some kids' stuff preloaded on it, which I don't need, so I just deleted whatever stuff I could. . .", "Date": "February 24, 2013"}, {"Title": "good but understand what you pay for!", "Author": "Jamie", "ReviewID": "R34IT11RMHNNHY", "Overall": "4.0", "Content": "unfortunaly I had to return this product because I was wanting more that it offered.  This is great tablet if you only plan on reading your ebooks or playing some apps but as far as the wifi it is not good.  The signal was just too weak for what I was looking for I could stand next to my router and still only have 3 bars, when in my bed which is only 12 feet away I had 2 and sometimes only 1!  Still with that for $80 this is a good tablet but don't expect a speedy little thing, the screen is a little slow and same with loading web pages, netflix was ok but the screen resolution was blah. I did really like how the back is textured it made it nice to hold and it felt sturdy and of course I LOVE HAVING THE OPTION OF PINK!!!!!", "Date": "February 14, 2013"}, {"Title": "This tablet sucks and is NOT for children", "Author": "mmaciuska", "ReviewID": "R21AVUPNKF6OTC", "Overall": "1.0", "Content": "I only gave it one start because I had too. I would give it a zero.  I have had nothing but problems since the day I bought it for my girls.  I have 2 of them.  They do not down load and as my daughters were playing the screens cracked and the company will not stand by the product.  My girls are 7 and both of the tablets screens cracked. It seems funny that 2 of the broke and now I am out of the money for both of them.  The company basically called me liar and said I want something for nothing. And I would be surprised at what people do. I would NOT recommend this tablet at all.", "Date": "September 25, 2013"}, {"Title": "riddled with ads", "Author": "joe", "ReviewID": "R1MHUSA0H1W0SE", "Overall": "1.0", "Content": "Doesn't have Google's Play Store instead they have their own \"1 mobile\" store with tons of advertisements.  My son can't get through one level of any of the games without accidentally clicking on an ad.  Worthless.Edit:  I'm appalled with this product!  I've  just thrown it away (with video evidence) because my 2 year old just went to a market add and the top downloads shown, number seven: \"Hot Teen Sex Videos\" and he's only two!  What if he clicked on it!  It shows a nude male from behind and has a nude female embracing him that you cannot see anything on here.  I have a video if anyone from amazon is reading this I really hope you contact me so you pull this item from your shopping market... they have four adult content downloads in their \"top downloads\" list top 20.  This is not listed as an adult product and needs to be removed or flagged.", "Date": "August 13, 2013"}, {"Title": "not worth the money", "Author": "samantha smith", "ReviewID": "R17LMQL96I0XIA", "Overall": "2.0", "Content": "I bought this for my 5 year old, and to say its decent for a child to use just wouldn't cut it. She is complaining about it freezing and randomly shutting down, Yes it comes loaded with several apps but that is about the only good part about the tablet. Battery only lasts about 2 hours and the one thing that eats the battery is the wifi, when i checked usage 81% of the battery usage was the wifi, the amazon app store that comes preloaded on it uses about 51% of the battery because it runs in the background. We have had this tablet less than a week and I have already had to do a factory reset on it because it froze and wouldnt turn off. If you are looking for a cheap tablet that has terrible graphics and takes forever to load, a front facing camera only, freezes a lot and spends most of the day updating apps that come preloaded on the tablet then this is a tablet for you, I bought this one for 80$ and I definately got what i paid for. I have noticed that this tablet has gone up since i bought mine, I would honestly buy a better quality tablet for the price.", "Date": "February 23, 2013"}, {"Title": "It's OK", "Author": "Astanax Tahlmarine", "ReviewID": "R7YLUY5SJRTGA", "Overall": "3.0", "Content": "For the price, I really cannot compare it to an IPad. There are also worse tablets out there. It might just be ours (If anyone wants to leave a comment they can), but I find that the Browser app stops too frequently. The D2 freezes up, and it says, \"The browser has stopped unexpectedly. Do you want to wait or close?\" I get that notification when trying to access a few webpages. Then when I try to type in a URL or search term, I have to wait for the digital keyboard to accept my input, and sometimes pressing the same digital key a few times is a must before it would even accept the key being pressed. There are times where I will be scrolling through apps, and the tablet will stop scrolling on its own and open whatever my finger swipes across at the time. I have a Droid X with the earlier Gingerbread Android and I haven't had this much problem as I did with this tablet in terms of scrolling and input. I don't really believe it is the operating system at this point, but rather the hardware D2 puts into their equipment that is causing the software to delay and not work properly. Because this is the same software put into a Samsung Galaxy Tab 2. As they say, you get what you pay for. So I rated it as three stars for \"It's OK\".", "Date": "January 30, 2013"}, {"Title": "LOVE IT", "Author": "Karen", "ReviewID": "RPL7RJU1UCIAB", "Overall": "5.0", "Content": "Brought a 9\" tablet and loved it, decided to buy my a 7\" and gave my mom my 9\" to use.  She and I both love playing games on them.  I also love reading books on them too.  Great price and great tablet.  You can check e-mail, face book, twitter and lost more on this tablet.", "Date": "May 3, 2014"}, {"Title": "No problems at all. Is exactly what I wanted.", "Author": "Max Linzmeyer", "ReviewID": "R2UYUCHDVNE06V", "Overall": "5.0", "Content": "No problems at all. Is exactly what I wanted. It doesn't have everything that an iPad has, but I didn't pay $ 400.00 either. It is excellent for the money.", "Date": "February 26, 2014"}, {"Title": "problems...", "Author": "Rowan Morin \"Rowan\"", "ReviewID": "R2N8ITNX922C16", "Overall": "1.0", "Content": "I don't know about other people who have bought this product, but I had nothing but bad luck with it. I was upset when I found  out that the internet stopped working for it. Then it started loading slow and wouldn't download apps. Thankfully I got my money back and I bought a Kindle Fire HD. I have yet to have problems with it.", "Date": "December 22, 2013"}, {"Title": "good basic tablet", "Author": "Gigi Mar", "ReviewID": "R13ZM4A0KIE6D8", "Overall": "5.0", "Content": "Basic tablet and affordable! Great for netflix and all entertaining purposes. Amazing for kids and anyone who wants something small fof fun.", "Date": "November 30, 2013"}, {"Title": "Great product", "Author": "Gary  Green", "ReviewID": "R39NMRSVZ15TUY", "Overall": "5.0", "Content": "Great tablet for my 5 year old. A lot of the games for him is downloaded, which is great. I really like the read along books. Great Buy!", "Date": "November 7, 2013"}, {"Title": "Love love love it!!", "Author": null, "ReviewID": "R90AX0G77DMNS", "Overall": "4.0", "Content": null, "Date": "May 31, 2013"}, {"Title": "Every now and then you get a winner", "Author": "Steve Kaye", "ReviewID": "R26A097FC60MW1", "Overall": "5.0", "Content": "Bought this to investigate how I would take to a tablet. This D2 is stable, has never crashed and although it is not very fast it works well. I installed a ROOT CHECKER and found it is rooted out of the box. The BUMMER is that this device is not a certified Google device so it cannot get APPS from Google Play or use Google maps. You can still get APPS from Amazon or 1Mobile but I suggest you check out the APPS first at Google Play. Their reviews and permissions information is invaluable. I was shocked to learn one of the most popular APPS can control you phone (or tablet). It can send, read or delete SMS messages, make phone calls, take pictures and It can read data about your contacts all without your confirmation. So folks, be careful. There are alot of free APPS but the, there is no free lunch. They want your information. Call me paranoid but I have been subject to identity theft and it was a bummer. For this reason I do not intend to keep the tablet. I just feel safer with my 10\" netbook. But for a basic tablet for the kids or to take on the road I would have to recommend it.**********************************I should have waited to write this review. I said it did not work with Google Play (Store). Well, the next day I got it to work with the Google Play. Finding the necessary files took a little time but since the tablet was already \"rooted\" installing the files was simple. I have now used the D2 for 100 hours and have tried to beat it up. No freezes, no problems. I am not sure if the newer models come rooted but this one did and since I git Google Play to work I am raising my rating from 4 star to five. This rock solid low end tablet is a score!", "Date": "March 11, 2013"}, {"Title": "Good device", "Author": "amg", "ReviewID": "R112UD15EEYWQT", "Overall": "4.0", "Content": "This is my first tablet, so I don't have anything really to compare it to... that said it works well for the things I bought it for- netflix, light game playing via apps, web browsing, e-books.  It plays Netflix pretty well, you do have to hold it at a certain angle for a good picture and I'm sure it's not the highest quality picture but it works for me.  It comes with a bunch of preloaded apps, a lot of good kids apps too.  Does not have access google play but so far there have only been a couple apps I wanted that aren't available through mobile1market or amazon.  Battery life isn't super great, but so far I haven't had it die it one session or anything.  I got it more for around the house use which means I have no problem plugging in while I'm watching netflix on the couch.  It's pretty responsive to touch, the keyboard sensitivity is good, not too many times it picks up the wrong key.  Overall I find it well worth the price for my needs.  Its a good tablet for new tablet users and would even make a good tablet for a kid or teenager for the price.", "Date": "March 6, 2013"}, {"Title": "Great Kid Tablet", "Author": "Amazon Customer", "ReviewID": "RPDSWULFFG1ES", "Overall": "5.0", "Content": "We just bought these for our kids ages 6 & 9, and they absolutely love them. They are easy to set up and use and the kids can play their games, watch movies, listen to music and connect with their school / teacher websites.", "Date": "February 20, 2013"}, {"Title": "Great Tablet", "Author": "Shawn B", "ReviewID": "RELI7NHSY3EWB", "Overall": "5.0", "Content": "this tablet is awesome. It's very responsive runs Android 4.0, and even though it doesn't come stock with Google Play I have managed to google and find most of the apps My kids wanted. Netflix is great on this and works wonderful. It's a great tablet and for this price of this unit, it simply can't be beat!", "Date": "February 20, 2013"}, {"Title": "Kids love it", "Author": "Heidi Vandawalker", "ReviewID": "RQK1DQPS1WXNL", "Overall": "5.0", "Content": "This is such a good tablet.  It works great and has enough to get many apps for free for the kiddos.", "Date": "February 5, 2013"}, {"Title": "great for young kids", "Author": "memaw5901", "ReviewID": "R1Z644UGTBMQ19", "Overall": "3.0", "Content": "brought for grandkids, the only thing that I have a problem is there is a short in the charger. he like that he can play games", "Date": "September 6, 2013"}, {"Title": "You get whatvyou get", "Author": "Not too happy", "ReviewID": "R3ELA694LJLV44", "Overall": "2.0", "Content": "I got it for my daughter 2 weeks ago. She was very exited at the beginning however the tablet freezes including a lot while playing ! Its slow to browse ,responds slowly open apps. While playing it freezes up completely amd needs to be restarted. So after a week of patience enjoyment she again rather play on my phone or ipad. I wish i could return and def would get smth like nexus", "Date": "April 1, 2013"}, {"Title": "worst tablet ever", "Author": "Amazing G", "ReviewID": "R3VJWMA4W78BB0", "Overall": "1.0", "Content": "DON'T BUY please your wasting your money and time. its has so many problems i am surprised it had no recalls. i have had had 3months and its shot by first month. i have running on different programs and that didn't help. its very slow and you need buy a memory card and it still has problems. and i am very good with touch screen technology and hotline they had didn't what they were talking about either. so if you want a new expensive paper weight be my guest buy this. that what i use it for and don't buy this be wasting your time, money and headaches. thank you for taking your time read this review.", "Date": "April 16, 2013"}, {"Title": "NOT Better than a Samsung Galaxy Tab!", "Author": "Amazon Customer", "ReviewID": "R1LGPY5TG2X22F", "Overall": "3.0", "Content": "First, please note that this is a legitimate review by a real person who actually purchased the tablet.  It was amazing, while shopping for a low budget tablet and case, how many fake reviews we encountered.  I saw a you tube review on the D2 which is why I decided to give it a try.This tablet is definitely worth considering for the kids but whoever said it was better or even comparable to a Galaxy Tab obviously doesn't own a Galaxy Tab (or is a fake reviewer.  I do and I can assure you, there is no comparison.  But really, there shouldn't be based on the amount of money I spent on my GT compared to the D2.  The D2 runs most apps well, but slower.  The screen rotation can be very pokey, like minutes before it finally decides to rotate.  The wi-fi seems to work really well, unlike a Coby Kyros we had purchased and returned.  Playing games like Subway Surfers can be hit and miss.  Some days it's great and somedays it's a little glitchy.  We also needed this for a reader and though our reader, Mantano, is slower, it still works really well.  The camera is a bit of a joke and since there is no case for this specific brand, is covered up by the case we ended up with anyways.  It wasn't really necessary anyways as my kids have their own cameras anyways and the cameras on the lower priced tablets aren't usually comparable to what they have anyways.  The kids aren't complaining, it plays Fruit Ninja and Talking Tom great!  We don't play movies on our tabs but they preloaded preview of Jack played nicely.  They are just so thrilled to have their own tablet.  I, on the other hand, couldn't deal with the issues after being used to my GT.  We purchased 3 but so far the blue one is the only one we've received and what I'm basing this review on.  I will update if there is additional info to be added.", "Date": "March 28, 2013"}, {"Title": "My first Pad", "Author": "Frank J. Miller", "ReviewID": "RLZ2MWS3ZB3RV", "Overall": "5.0", "Content": "Being my first pad, I really have not figured it out yet. It seems easy to use and works with every format it says it does. The browser is fast, and the screen touch is great. I should have bought one of these sooner.I would advise buying a case for it. I got the one with the keyboard in it..Fits perfect.", "Date": "January 25, 2013"}, {"Title": "Awesome", "Author": "HouAmI \"Love Never Fails\"", "ReviewID": "R2LSO1G6N0VX9K", "Overall": "5.0", "Content": "Love this pad for my 6 year old daughter.  She has everything she needs on it and doesn't have to borrow the adult iPad anymore.I would buy this pad again.  It froze up the first month having it and the problem was resolved by resetting it with no further issues.Renee D.Washington, DC", "Date": "March 20, 2013"}, {"Title": "GOOD PRODUCT", "Author": "Christina Reamer", "ReviewID": "RNBEQFMKICTFY", "Overall": "4.0", "Content": "I GOT THIS FOR MY SON AND WE REALLY HAVEHAD NO PROBLEMS WITH IT AT ALL.  HE USESIT CONSTANTLY AND DOWNLOADS ARE EASY.WOULD RECOMMEND THIS PRODUCT", "Date": "March 20, 2013"}, {"Title": "bad purchase", "Author": "alan jelinek", "ReviewID": "RFV77CS4TFRG7", "Overall": "2.0", "Content": "The tablet was nice and came with a lot of apps.. The problem- after two weeks, the unit would not boot up anymore... I had to return this item as defective.", "Date": "March 18, 2013"}, {"Title": "D2  D2Pad It would be good for kids", "Author": "Phillip Carley", "ReviewID": "RDIKN9L1A61ML", "Overall": "3.0", "Content": "I could not keep a connection.It would be good for small kids who don't use the internet much.The preloaded programs were geared for small kids.", "Date": "March 16, 2013"}, {"Title": "i dislike it", "Author": "des", "ReviewID": "ROXE3OOAEWO6C", "Overall": "1.0", "Content": "It freezes up a lot and it takes forever to load. I can't update certain apps for some reason. I am not pleased!", "Date": "March 16, 2013"}, {"Title": "Good tablet.... but how good?", "Author": "Chino", "ReviewID": "RJF6CDV77DKV1", "Overall": "2.0", "Content": "I purchased this tablet about a month ago for my 5 year old daughter because we are a very tech savvy family. When first opening the box my daughter and I took inventory of every thing that came with it, one thing we noticed very much was the build quality. The build quality was very impressive, even more impressive than my ASUS Transformer TF-101. So we where very pleased with it but as soon as we got to playing around on it is when problems started to show, for an adult this would be a horrible tablet. My daughter has a lot of problems downloading and playing games. Over half the games she has downloaded was not compatible and unfortunately unlike the Google Play Store the android app store on this does not check compatibility. Even just browsing the internet is a bit of a challenge when your suppose to be running a 1 GHz CPU with 512 MB of RAM and unfortunately that's not what you are getting, you actually a 800 MHz CPU and 256 MB of RAM. So with a actual lack of specs for very light game play it's nice but if you wanna do more than that I would suggest looking else where because your child will be complaining to you every 5 minutes on how it keeps freezing. Maybe if there was a android 4.1 update it might be more worth it to get but until then my daughter will keep playing the games she has on here till we get her a Google Nexus 7 or 10.", "Date": "March 14, 2013"}, {"Title": "Awesome for the price!", "Author": "S. Hawley", "ReviewID": "R1CQHIMR44YS5P", "Overall": "5.0", "Content": "Knowing that this tablet was under $100 I did not have too high of expectations. After all it was a present for a 9 yr. old. But I was real surprised at how good it was and a fast processor. I would definately say it runs fast and without hangups unlike my LePan tablet and my other daughter's Visualland. Highly recommend it and it is perfect for children because of the pre-installed apps.", "Date": "March 14, 2013"}, {"Title": "perfect for the children", "Author": "JC4E", "ReviewID": "R39AJAQTL5UJSJ", "Overall": "5.0", "Content": "This tablet is just right for the children. The battery dies quickly but other than that its great. You can add your own apps to this device.", "Date": "March 14, 2013"}, {"Title": "Adjust your expectations", "Author": "thecrwth \"thecrwth\"", "ReviewID": "R167FTFCMJDXFP", "Overall": "4.0", "Content": "If you look at this as a cheap tablet that has basic functions, it does exactly what it sets out to do.  it is already rooted.  Ready to use right from opening the package.  If you are looking for bells and whistles, you will be disappointed.", "Date": "March 13, 2013"}, {"Title": "Wonderful", "Author": "theresa lewis", "ReviewID": "R2LGVQG9BOLO1S", "Overall": "5.0", "Content": "A co worker bought this tablet for her child and recommended that I buy one for my daughter and I'm so happy she did. The apps are fun and they have alot of educational apps as well.", "Date": "March 13, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00A47979Y"}}