{"Reviews": [{"Author": "Bron \"Bron\"", "ReviewID": "R3QOYMOVFYA655", "Overall": "5.0", "Content": "(Note: This model is listed several times on Amazon at various prices, so be sure to shop for best price!  This listing seems to be for an early model.)The Yoga 13 is an excellent device.  Laptop, Tablet, Mini-HD TV? What's not to like. The current versions seem improved and do not have many of the issues which plagued the earlier ones, or at lest mine does not. No Wifi issues, no trackpad issues, no disk portioning mess. Just a very nice laptop/tablet with a good keyboard, a very good display, great performance and an excellent, innovative design.It's not perfect, no device is, but is a great, functional design, well executed and with solid build quality. If you can get it at a good price, I think you will be pleased with it.Here are my notes on the Yoga 13 i5 model based on my experience so far: A bit larger than I expected, but still reasonably portable and very slim. Great display, not the best ever, but very good. The resolution is perfect for this screen size, leaving text readable, and very good for photos, movies/videos, and graphics. Very bright. Good black levels for videos. Only small criticism is that the blacks do not have as much detail preserved as on the best displays I've used. But not anything awful, most will never notice. I only notice because I have used some truly great displays. Still, a very ncie display and I am quite content with it. Viewing angles are great. Colors are vivid. I think anyone will be very happy with it.Keyboard is quite decent. I am not having any issues. Like many, takes a little while to get used to, but overall feel and action is quite good, I think.  As many have noted, a shame there's no backlighting, but the keys do have bright white on black lettering, so good visibility with even dim lighting. But a backlight would be nice. Guess the bonus is less drain on the battery.Battery life seems pretty good to me. I get 5-6 hours easily and with some \"management\" I can stretch this to 6-7 hours. Can get a full day's use if you are careful, put into sleep when not in use, and so on. Charger is very nice. A new design that is much, much better than almost any other laptop I have used, I really like it. Feel sure this will be the trend for future models. It's very much like a USB connector, but can be inserted either way. Good design.Windows 8 works very well and is very snappy. In fact, this is the best Win 8 experience I have had to date. The Yoga 13 seems to have been designed to make Windows 8 easier to use. I for one am getting used to it and don't feel the need for any add-ons. Have not updated to 8.1 yet (really, feel no need to do so) and still I'm fine. Everything works very well. The touch screen helps a lot, of course. And the great display. Very readable in tablet mode or laptop (desktop) mode. The touch has been flawless for me so far. Very sensitive and responsive. Also, the special function keys help a lot. That and knowing a few key shortcuts like Win+D for Desktop, Win+C for \"Charms\" and so forth. There are dedicated function keys fpr switching between apps easily, closing an app/window, and other common tasks.Performance is very good. Listing windows performance scores below. In daily use, everything is quick and snappy. Boots quickly, shutdown very quickly. Very nice. I really like the function keys being dedicated to things like Airplane mode on/off, Display On/off, volume mute and control, touchpad on/off. brightness up/down, and so on. There's even a dedicated \"Refresh\" key (F5). Nicely done.Windows 8 64-bit Experience Index scores:Processor -- 6.9  (Good. 1.8GHz i5 CPU))Memory RAM -- 5.9  (A bit slow, single channel RAM?)Desktop/Gaming Graphics -- 4.7/6.3  (Fair, Intel 4000 embedded Gfx)HDD -- 7.7 (Very good, decent SSD drive is nice to have)-- Overall, performance is very good in daily use.Trackpad works fine for me.  Actually a bit nicer than many I have used. It's large and supports gestures. The button \"areas\" work fine, as does single and two finger tapping. You can go into properties and turn off things like \"edge swipe\" if they cause you any problems.While watching videos, I switched to tablet mode without a hitch. Pretty cool. In general, I am very happy with the flexibility of the various modes possible with the Yoga 13. I use it primarily in laptop mode, occasionally tablet. But can see stand and tent modes being useful as well, sometimes.The fan does run pretty much constantly, but the fan noise is rather low and not troublesome to me. I only notice it when things are very quiet. They were smart to vent out the back and in use the Yoga 13 seems to stay fairly cool. Some warm spots near the upper left corner under heavy use, but nothing objectionable.All in all, I am enjoying the Yoga 13 very much and think it is a fine unit. It's very nicely designed, looks great, is very portable, has a great display, a fine keyboard, very good performance, and some nice bits like a full size HDMI port. It is available at good prices now, so a real win if you get it much cheaper than the original selling prices. Still fairly new tech and no serious issue of any kind that I have seen.It's an easy 5 stars for me. I can see this becoming my favorite Win 8 Laptop for daily use.", "Title": "Great convertable laptop/tablet.", "Date": "December 5, 2013"}, {"Author": "Phillip K. Wilson", "ReviewID": "R3LU67EUIOJGE4", "Overall": "5.0", "Content": "This is an awesome ultra book. It does everything I need it to do. I love the flip feature. In my opinion if you get windows 8 you will appreciate that ability. I am so glad I bought it.", "Title": "Awesome I love it", "Date": "June 19, 2013"}, {"Author": "Harold Austin", "ReviewID": "RD2J1U4IJE2PC", "Overall": "5.0", "Content": "Love the computer itself and deserves best ratimg however i cant say the same about windows 8. I am having to learn to navigate all over but do not see that it improves anything.", "Title": "Hga1958", "Date": "April 21, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00AFRPG4I", "Features": null, "ImgURL": null, "Name": null}}