{"Reviews": [{"Author": "Jerry Courtney \"myrjer\"", "ReviewID": "R3RUIOS2Q8ZHN9", "Overall": "4.0", "Content": "I was hesitant to put in my two cents because I have not owned any other tablet to compare with.  So, I will judge it on its merits.  I love it.  Everything is pretty much like the way it is presented. Great resolution,better sound than I thought it would be, touchscreen is easy to navigate, and no sluggishness anywhere even with the Silk browser.  Battery is lasting as advertised and charges back up in 4 - 5 hours.  My niece has an ipad so I was a little familiar with it but I think she may be jealous of my Kindle Fire HD next time she comes to visit.", "Title": "My First Tablet", "Date": "December 13, 2012"}, {"Author": "Donna E Crouse", "ReviewID": "RNNW0YLF76EOO", "Overall": "5.0", "Content": "LOVING the Kindle!  I needed help getting it set up from my Nephew...smooth sailing after that, great having it all at using the Stylus!!", "Title": "LOVING IT!", "Date": "November 28, 2012"}, {"Author": "Virag Masuraha", "ReviewID": "RUK51P65IFCOF", "Overall": "4.0", "Content": "Visuals are stunning and product is greatly improved from its prior version. Model is sleek and has few feathers that were missing in its previous version (i.e. text to speech, camera, HD view, etc). Amazon has great set of apps so product is well supported.Camera is not that great and a few apps give trouble when scrolling but other than that it works just great.", "Title": "Great product at a reasonable price", "Date": "November 27, 2012"}, {"Author": "Jules", "ReviewID": "R1OD353D11EI06", "Overall": "5.0", "Content": "I had a kindle prior to ordering the new one so I knew I would be happy with the purchase. The only negative is the camera not being ready without having to buy an app to make it work.", "Title": "Love It!", "Date": "November 26, 2012"}, {"Author": "Char", "ReviewID": "RJQHUV17AAXMM", "Overall": "5.0", "Content": "The HD is great I love the clearness of the screen and all the books and music. Still exploring and know there is more!", "Title": "Love It!", "Date": "November 24, 2012"}, {"Author": "Joy Davis", "ReviewID": "R1MJ90P87HT0DK", "Overall": "5.0", "Content": "I have really enjoyed the features it has and the ability to make the letters larger or black and white as I have low eyesight.  It is very heavy which is a problem.", "Title": "Kindle Fire HD 8.9", "Date": "November 24, 2012"}, {"Author": "Joanne", "ReviewID": "R9M60BY6DAEAP", "Overall": "5.0", "Content": "Like how you can use it right out of the box. I am a little computer challenged and this was so easy.", "Title": "Kindle Fire HD is assume", "Date": "November 24, 2012"}, {"Author": "Shutterbug", "ReviewID": "R387OIV3D8F5IQ", "Overall": "5.0", "Content": "I'm still exploring all of its capabilities, but so far it's really great.  It's easy to navigate and go to many sites with it.  I love being able to have it at finger tips and either read books, watch videos, read and send emails or play games on it.  The HD screen is spectacular.", "Title": "My New Best Friend", "Date": "November 24, 2012"}, {"Author": "Verna", "ReviewID": "R1XRVS8CJC4L71", "Overall": "5.0", "Content": "Who wouldn't be happy with this product!!!  So far it has been everything I hoped it would be.  It is my first tablet of any kind.", "Title": "Kinle Fire HD 8.9\"", "Date": "November 24, 2012"}, {"Author": "James L. Thompson", "ReviewID": "R1EA1J4SHFN9OV", "Overall": "5.0", "Content": "I have the 16 gb model and I love it. I'm still learning about it. I did get a chess app and it was amazingly easy to use.", "Title": "Great Buy", "Date": "November 24, 2012"}, {"Author": "Tjn", "ReviewID": "RRGOJ1IYWW0UP", "Overall": "3.0", "Content": "Typing is not good at all because it will put spaces where they don't go or replaces what you type with what Kindle thinks it should be (spell check not good). Editing is ridiculous. Kindle doesn't know what copy/paste is either. Battery life is about average. Silk is not a very good browser and doesn't allow for Adobe Flash. A real peave is that there is a camera that faces the user only so if you're into taking selfies only then you are good. If you want to take a picture of someone or something it just doesn't work for that. I guess it's okay if all you do is Skype.", "Title": "Nice device except..", "Date": "May 19, 2014"}, {"Author": "CHRISTINE", "ReviewID": "R3IFFVHE8M4ZQD", "Overall": "5.0", "Content": "I usually would not buy \"refurbished\" items but I took a chance on the Kindle Fire HD.  So far, so good.  I don't want to jinks the purchase by bragging.  This makes a second Kindle for my two young grandson.  They each have their own now.", "Title": "Great purchase.", "Date": "May 17, 2014"}, {"Author": "Michelle Jones", "ReviewID": "R33XDZANJ5QXKG", "Overall": "5.0", "Content": "I take this everywhere I go. This is the best investment I had made in a very long time. Thank you for making me a HUGE fan....", "Title": "USEFULL", "Date": "May 3, 2014"}, {"Author": "James M. Bugno \"jimmy\"", "ReviewID": "R1R3MUFJPLAA1I", "Overall": "2.0", "Content": "took too long for charge, and many times the charge did not take. My kindle died one night at that was the end of it.  It was only 7 months old.  After receiving my 2nd kindle (through warranty) I decided to cut my losses and sell it (which I did) - I did not want to load it up with pics and songs, and apps only to lose it again.  As the old adage says \"Fool me once, shame on you, fool me twice, shame on me.\"  Nonetheless, when it worked, it was great.  I will be looking at other options. The only way I would recommend this product is if you are willing to gamble that you don't get a lemon.", "Title": "Died within 7 months", "Date": "May 3, 2014"}, {"Author": "Miles Miner", "ReviewID": "R23NID2XS65LOS", "Overall": "1.0", "Content": "The unit is very slugish and glitchy.  This started almost instantly.  I've always been hesitant to buy refurbished products and would never buy one again after this.", "Title": "Would not buy again", "Date": "April 21, 2014"}, {"Author": "Josiah Slade Ficklin", "ReviewID": "RPY34UGD9DRNX", "Overall": "1.0", "Content": "I just hate this tablet. The apps don't run smoothly even though I've used less than 5 out of the 16gbs. I can't login to Facebook properly on any games. I can't purchase in-game items on most games. The browser is slow. I have trouble connecting to Wi-Fi. The battery life is terrible. The camera is terrible. It won't check my email properly. I have trouble listening to music from the cloud. Can't get some popular apps due to the limitation on the Appstore. I can't play multiplayer on most games. The only good thing I have to say about it is the display is nice and that's why it got a star but it still doesn't deserve it. I will definitely not be purchasing any Amazon tablets ever again or recommend them to anyone. I guess I'll end this by saying you get what you pay for, you buy a cheap tablet, and you'll get a terrible one.", "Title": "Kindle Fire HD 8.9", "Date": "April 20, 2014"}, {"Author": "Diva D \"tnsucia\"", "ReviewID": "R3AY6V6AFDQAN4", "Overall": "2.0", "Content": "I am sending mine back to exchange it for hopefully, a tablet that will charge to 100%.  Mine only charges to 86%.  I didn't realize when I bought it that I couldn't utilize Google playstore.  Not really happy with the selection of apps available from Amazon.  It does have nice color.  Sound not that loud until I bought earphones and now it is okay.", "Title": "Won't Charge Fully", "Date": "February 9, 2014"}, {"Author": "Longman1414", "ReviewID": "R35UE55U53RO25", "Overall": "2.0", "Content": "THE SIZE IS NICE BUT I HAVE ALREADY RETURNED ONE FOR TURNING ITSELF OFF FREQUENTLY AND THIS ONE IS TURNING ITSELF OFF VERY FREQUENTLY.  IT IS VERY ANNOYING!", "Title": "TURNS ITSELF OFF...", "Date": "February 9, 2014"}, {"Author": "Karen Wiley", "ReviewID": "R7FH1AQFL8JV", "Overall": "3.0", "Content": "Not too many dislikes.  Wish I could set my own background picture and get rid of the  suggestions that pop up at the bottom of the home screen.  Would like more setting options.", "Title": "Kindle", "Date": "February 9, 2014"}, {"Author": "superwitchy", "ReviewID": "R5TZ46BZO0CMA", "Overall": "3.0", "Content": "I switched back to the Fire after a couple of years with an iPad because of issues. Well, I've had more issues with this than I did with it...games not loading (or with glitches), bad spots on the touch screen and a few other small problems. BUT, Kindle the customer service is 100% better and each issue has been well handled.", "Title": "A few issues", "Date": "February 9, 2014"}, {"Author": "Karla", "ReviewID": "R34AA6Q3CUEUDS", "Overall": "2.0", "Content": "Have replaced once already.  It freezes after about 10 minutes when on the Web. Will also shut down web on its own and takes you back to home page.", "Title": "Disappointed with 7th Kindle", "Date": "February 9, 2014"}, {"Author": "REDTOC", "ReviewID": "R13OYVYHA61KK3", "Overall": "5.0", "Content": "The HD 8'9\" gives you so much more. I like the fact that you can remove apps you don't like. Only problem I have is getting \"screen protectors\" for HD8'9\" without lots of bubbles. Already used \"Medge\"  brand & now I am not using any screen protectors. But the screen is so clear  & light for being bigger. And if you have any problem to contact Amazon, they are fantastic!!!!", "Title": "HD8'9\" is so much more!!", "Date": "February 8, 2014"}, {"Author": "R. Lantz", "ReviewID": "R2QMM3MKLMKIC8", "Overall": "4.0", "Content": "I had an older version 2 Kindle but prefer the flexibility of the tablet. For the small price it does quite a lot!  Still would need a windows tablet if I did not use a laptop as well.", "Title": "Great deal for the price!", "Date": "February 8, 2014"}, {"Author": "Pat Hall", "ReviewID": "R1CVRMUUS1C7NJ", "Overall": "5.0", "Content": "I also have a Nook HD tablet and like the Kindle so much better -I wish I had gotten it first!", "Title": "I love it!", "Date": "February 8, 2014"}, {"Author": "Peggy", "ReviewID": "R3M05F2OBS04GB", "Overall": "5.0", "Content": "Love it but not happy with Amazon because I pay $129.00 plus my old kindle and know they are offering the same kindle I got for under a $140.00 the guy made it sound like I was getting a great deal.", "Title": "Peggy Ponder -coolmom81884@yahoo.com", "Date": "December 17, 2013"}, {"Author": "sanjay bhatt", "ReviewID": "R1WBYZGYWDOWP2", "Overall": "2.0", "Content": "It was my first tablet after having a samsung smartphone.The looks are stunning, the resolutionis damn good, but my disappointment is with the browser-Silk.Frequently, it stops working and will pops message whether to wait or close, this is quite frustrating, I  got this tablet without a power charger, for which additionally I paid USD 20.00Not worth at USD 249.00", "Title": "Silk browser of Kindle Fire", "Date": "December 17, 2013"}, {"Author": "Sheryl Asmus", "ReviewID": "R27Y7XFHGUL3IG", "Overall": "5.0", "Content": "A few things are different than my 1st edition Kindle, but I'm learning how to make it do what I want it to.", "Title": "It's great", "Date": "December 17, 2013"}, {"Author": "A. Corrado \"Foxyfishtail\"", "ReviewID": "R2VZFMMD98AF12", "Overall": "5.0", "Content": "This is Awesome!!! I love it! I've had it for a week and been using it every day! The HD screen is Brilliant!! Great Apps! The sound quality is Great!  I can't say anything negative about it. It's perfect!", "Title": "Kindle Fire HD 8.9\", Dolby Audio, Dual-Band Wi-Fi, 16 GB", "Date": "December 17, 2013"}, {"Author": "charlene huddleston", "ReviewID": "R3V8S2H85N09NB", "Overall": "5.0", "Content": "I had a regular Kindly Fire and now have the Kindle Fire HD 8.9\".  I love the new one for many reasons; but, one particular reason is that it holds a charge for me ALL day.  You see, I read ALL the time (usually 5-6 books a week).  I take my kindle everywhere I go ---  so I need a dependable charge.I recommend this Kindle to all who love to read.", "Title": "Love my new Kindle Fire HD", "Date": "December 17, 2013"}, {"Author": "JJ", "ReviewID": "R9M4IHGIV9HZ5", "Overall": "5.0", "Content": "Those people hacking on this unit must be very picky or just self serving trolls... this is a great tablet... very impressive how well it works with Amazon prime.", "Title": "really a nice unit... great price", "Date": "December 17, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R5906RO4HYU6L", "Overall": "5.0", "Content": "My husband got me this one to replace/upgrade from my Kindle Fire first gen. The change over was relatively easy!! He was able to register the original Fire in his own name and I have mine in my name. Awesome!!!! Now to get all the goodies to use with it! Case, keyboard etc.", "Title": "Replacement... original went to husband", "Date": "December 17, 2013"}, {"Author": "raymond montani", "ReviewID": "R1Z73YALUG1MO3", "Overall": "4.0", "Content": "Let's to do. I would recommend this kindle to anyone who is considEring a kindle purchase. I hope this helps others interested in purchasing a kindle.", "Title": "The kindle is very user friendly and the large screen is easy to read.I like the large keyboard and all the tasks that it is abl", "Date": "December 17, 2013"}, {"Author": "Michael", "ReviewID": "R2BM48VT9YB49G", "Overall": "5.0", "Content": "I was skeptical about ordering this device. There was a promotion with back to school that brought the device down to $200. I decided that for that price I would try it out and see what it can all do. I have been pleasantly surprised. I was on the fence about tablets and decided I would replace my recently dead laptop with another laptop. After two hours of trying to navigate Windows 8 on my new laptop I took it back to the store and was once again at square one trying to get a mobile device. I'm so glad I gave my Kindle a try. I want to preface this by saying if you're looking for a true tablet experience with tons of apps this is not the route to go. The interface as a whole is limited compared to a normal Android tablet, but what the Kindle does do, it does very well. I am able to browse the web freely, while listening to music on Pandora, and can also check my various email accounts. There are also some apps that I have downloaded to the device that I use as well, such as Netflix. The app store is not as extensive as the regular Android store, but there are quite a few apps that work very well on the Kindle. For my basic mobile needs I love this device. Anytime I need a more powerful machine I just use my desktop. (I know, I'm one of the few that still uses one of those) I actually prefer my Kindle compared to the IPad 2 that I have for work. I find that I like the user interface better and that the screen quality is much sharper than the IPad. I also like the more compact size of the Kindle compared to the bigger tablets. As a whole I do not regret my purchase one bit. I love using my Kindle and would definitely buy one again. Had I known what I know now I would have just skipped the headache of buying and returning a laptop and gone with the Kindle Fire HD 8.9 from the start. Hope this review was helpful for you.", "Title": "Great Product!", "Date": "October 2, 2013"}, {"Author": "LadyR", "ReviewID": "R3S8R4KS8PMCDQ", "Overall": "4.0", "Content": "Love my Kindle just wish I could use it to take pictures.just traveled with it and it was great having it instead of my laptop to go online with.", "Title": "love", "Date": "October 2, 2013"}, {"Author": "SS", "ReviewID": "R170JA3954A3AY", "Overall": "4.0", "Content": "Actually, I do love it but I did not give it 5 stars because sometimes it is a little slow moving around the web.", "Title": "I would purchase it again.", "Date": "October 2, 2013"}, {"Author": "MaryAnne Yale", "ReviewID": "RDRRZQV02XED7", "Overall": "5.0", "Content": "The reason I say second best is because I pre ordered the newest HTC 8.9/64g coming out Nov 7th.  I don't usually wish time to speed up but I am really anxious for the next. I bought 1st generation, 2nd and 3rd. The 2nd is 7\" and the 3rd is 8.9\" and 32g.  I use it for everything.  I watch movie's, emails, games self snap shots etc. One of the things I look forward to is the added rear camera, and \"office\".  I rarely use my lap top and with the HDX looks like it will completely do all I need.  I like the size too.  Amazon has been  my lifeline, what ever I need or WANT I usually find through them.I highly reccomend any Kindle and AMAZON.esess", "Title": "second best", "Date": "October 2, 2013"}, {"Author": "VoraciousReader", "ReviewID": "R1U9WGMEZSOG59", "Overall": "5.0", "Content": "This is so much better than the Nook that I received for Christmas.  It was my first ereader.  I was happy with it at first . . .But then the charging cord broke.  I couldn't get it replaced by customer support through B&N; even though it was still under warranty for 2 years. So, I had to drive 140 miles away to get a cord at my \"local\" B&N; store.  Also, I purchased a gift card through a 3rd party vendor (Meijer) for my Nook.  It was activated correctly but when I applied it to my account online every book I tried to buy was applied to my credit card.  B&N; said it was a glitch on their end but said there was no way to correct it.  They also refused to refund my money or credit my account.  Meijer wouldn't refund my money either (I do not blame them. There is nothing wrong with the gift card.). So I told the customer service 'supervisor' at B&N; to \"erase my account, I am buying a kindle TODAY.\"  I did just that and haven't looked back.  I have found that my kindle works magnificently.  Amazon's ordering process is seamless and easy to navigate.  LOVE the Prime program. Free books are incredibly easy to find.  Perhaps the BEST product I have ever purchased. I love to read & am glad to have the ability to carry my library with me where ever I go - in a dependable format.  Thank you amazon!", "Title": "So much better than Nook", "Date": "October 2, 2013"}, {"Author": "connie cataline", "ReviewID": "R13WQILO7NEXBC", "Overall": "5.0", "Content": "I really love this kindle fire, the picture is very clear and the music sounds great! I would recommend this.", "Title": "kindle fire", "Date": "October 2, 2013"}, {"Author": "Eileen \"mcdoogie\"", "ReviewID": "R2OVDSU23AGAT6", "Overall": "5.0", "Content": "After many calls to AMazon Kindle, I learned my way around the Kindle Fire 8.9.  The staff was more than kind and helpful. It has wonderful color, clear pictures, great sound for both voice and music, easy to access the email....and you can take it with you to while away the hours in a waiting room.  The price is right and it has become my constant companion.  Doing business with Amazon is a pleasure.", "Title": "my heart is on fire 8.9", "Date": "October 2, 2013"}, {"Author": "Nita Kirkland", "ReviewID": "R1GX65YP9YE72L", "Overall": "5.0", "Content": "I am in love with my kindle. Having had the kindle fire, I was determined to get the HD. Thanks amazon", "Title": "my new HD kindle", "Date": "October 2, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00AFKCASA", "Features": null, "ImgURL": null, "Name": null}}