{"Reviews": [{"Author": "N. Cartmon", "ReviewID": "R1CCH7O5H4DJ8T", "Overall": "5.0", "Content": "Such a perfect tablet for the price. I couldn't believe the features packed into this tablet. Its got as much as the leading competitors at one tenth the price of them. A great buy!", "Title": "Great buy!", "Date": "March 18, 2013"}, {"Author": "Andrew and Brittany!", "ReviewID": "R2LKUUF9UXXZZW", "Overall": "4.0", "Content": "As far as a cheap tablet, this is a great tablet. It is cheaply made,  but everything checks out good on it. Works fine. Only problem that I can see with it, is the white plastic hard shell on the build on it is poorly designed. You can see the build in L.E.D Light threw it. Other then that, the tablet works fine so far, great for what I bought it for. I bought it for my little girl, who is 3 years old to play on. Wifi works fine on it. It is a little harder to navigate than others, but you want find any other tablet out there with the options this one has, for the price. Over all it  is a great product. If any other problems occur I will be sure to leave another review as soon as this happens. I plan to purchase another one for my self. Something you don't have to worry about.. Cheap, dependable, and a lot of functions. What much more could you ask for at this price?", "Title": "Best Bang For The Buck. Get what you pay for.", "Date": "January 4, 2013"}, {"Author": "J.Aragon", "ReviewID": "RO8P2PLP7XANJ", "Overall": "5.0", "Content": "i got this item becouse of its great price and its good for all ages im getting another one for fathers day great little tablet", "Title": "good little tablet", "Date": "June 15, 2013"}, {"Author": "Eonia Griffin", "ReviewID": "R1NG445KA1QQV4", "Overall": "5.0", "Content": "I choose this tabet cause it was the right size for my brother. It has wifi on it and some downloads come with it.", "Title": "Tablet", "Date": "March 12, 2013"}, {"Author": "Teresa Rax", "ReviewID": "RJXZTCJJM9DPT", "Overall": "5.0", "Content": "i purchased two of these for a pre teen and a teen, they loved them.  the product was just as described and was a real hit with the teens.", "Title": "perfect gift", "Date": "March 4, 2013"}, {"Author": "Paige Hayes", "ReviewID": "R2HMLM8FUWL3FJ", "Overall": "1.0", "Content": "Just so you know i was anticipating this for about a week and a half! This was my first tablet purchase i am in college so the price was perfect but then it actually came in, It was cute and what i expected i was really hoping for the best and then i turned it on it was slow! but the worst part the screen kept flickering the whole time i tried everything to stop it but it must of been dropped during the packaging or defective from the beginning, So now i have to print a label and ship it to amazon, wait untill they receive it then eventually get my refund and it sucks because i was really looking forward to this tablet, I would recommend finding a more pricey name brand tablet which is what i'm going to do!", "Title": "Don't waste your time or money!!", "Date": "July 16, 2013"}, {"Author": "Sabina Granado", "ReviewID": "R159RFBTWWPYUP", "Overall": "5.0", "Content": "excellent ProductI recommend it 100%, came as it described, very high quality at a fair price, I would return to buy without hesitation", "Title": "Very good!", "Date": "June 28, 2013"}, {"Author": "julio guillen", "ReviewID": "R33W2V9G2B82HC", "Overall": "4.0", "Content": "I am satisfied with the quality of the table due to the price but I must admit I expected more. I get one of the tables with a default volume button I assume it was the shipping company", "Title": "good board", "Date": "April 20, 2014"}, {"Author": "Delaine Starr Hutchison", "ReviewID": "R2PE6BVGFY7KSI", "Overall": "5.0", "Content": "Great little tablet. Service was very fast. The item is very easy to setup and use. Will get more as gifts anytime!", "Title": "Alldaymall Google Android Tablet", "Date": "December 8, 2013"}, {"Author": "Brianna Richardson", "ReviewID": "R34J5ZLZXIZWZK", "Overall": "1.0", "Content": "i ordered one before and it was great. so i ordered two more. bigggg mistake. the two new ones don't run any of the games or apps i actually need. my boyfriend opened it up and seen there were marks inside wher ite it had been redone. i emailed them and they went on and om aboit how it was a brand new tablet, never used.so many typos..i was using the tablet to leave this review -.-", "Title": "sucky", "Date": "November 7, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00ALP5Y8C", "Features": null, "ImgURL": null, "Name": null}}