{"Reviews": [{"Title": "Non-working product", "Author": "RowdyRedd", "ReviewID": "RCE2Y0DIHOHY4", "Overall": "3.0", "Content": "I received the product and everything seemed to be ok..until I tried to download some apps and received an error message. It also had someones data and information already on the device. The device had no options of deleting the information and it continously asked me for the individuals password. I was buying the item for my 8 year old for her birthday in April. Thank goodness I opened it to test it out. I had no plans on doing so and tried to wait until April to surprise her. I am returning the item and really just wanted to exchange, but they do not offer, so I will be receving a refund.", "Date": "February 23, 2013"}, {"Title": "s***", "Author": "goo", "ReviewID": "R167XAV7JWMQWR", "Overall": "1.0", "Content": "Small, doesn't work with most apps and the screen is coming out upon opening it. Horrible product for sure. Wouldn't recommend it to anyone", "Date": "December 30, 2013"}, {"Title": "not recommended", "Author": "Raajindra Charles", "ReviewID": "R1GBPU9JLNMFTK", "Overall": "1.0", "Content": "apps not downloading DO NOT BUY!!! needs external memory card for app  do not buy do not buy do not buy !!!!", "Date": "October 9, 2013"}, {"Title": "Horrible", "Author": "Tracy", "ReviewID": "R1P9F6RN72ODV9", "Overall": "1.0", "Content": "they don't download apps & the language is in Chinese on the browser even though it is set in English.", "Date": "March 1, 2013"}, {"Title": "Horrible", "Author": "Tracy", "ReviewID": "R2OJQ2MJUJOPZV", "Overall": "1.0", "Content": "they don't download apps & the language is in Chinese on the browser even though it is set in English.", "Date": "March 1, 2013"}, {"Title": "Pre-Owned and Defective", "Author": "terryanny", "ReviewID": "R1GS0TYXJ1Y262", "Overall": "1.0", "Content": "I bought two of these for my twins birthday presents.Tablet 1:I thought I was buying a new tablet.  When it came, it had someone else's Google account logged in! I can understand why they returned it.  It's twitchy.  Sometimes when I press on the screen, it does not register, then it will spazz out when I barely graze it.Tablet 2:Without a pre-existing account, I was hopeful this tablet would be better. Boy was I wrong!  Just a couple of days after we received it, when the battery ran low, it never charged again.  All I see is a low battery warning.Needless to say, I am returning them.I am Sooo disappointed. But not as disappointed as my girls.", "Date": "January 20, 2013"}, {"Title": "front camara no good.", "Author": "luz", "ReviewID": "R24S8SIZ1VAKNM", "Overall": "2.0", "Content": "because the front camara is no good it dont work. i would like to no if i can send it back and get it before christmas.", "Date": "December 1, 2013"}, {"Title": "Good tablet", "Author": "Unaih Zinhagel 34941", "ReviewID": "RRGOPXP5VLQF6", "Overall": "4.0", "Content": "I have bought this tablet for someone that I know and she still say she love the tablet and the tablet still work fine after one year of use so I recommend this tablet to anyone.", "Date": "May 22, 2014"}, {"Title": "gets hot locks up", "Author": "Alan hughes", "ReviewID": "R3GU83PIF5AAO", "Overall": "1.0", "Content": "Battery doesnt stay charged slow slow slow charger can easily breakGets hot fast locks up after it gets hot which doesnt take long just apend little more and get a good tablet", "Date": "April 4, 2014"}, {"Title": "HORRIBLE", "Author": "samantha", "ReviewID": "R20GVQJPJO8E3Z", "Overall": "1.0", "Content": "Took 15+ tries to connect to internet. Finally got it connected but was still very slow. Would not download apps. Great price, horrible product. Plus, no one even knows about this product so if something goes wrong, no one knows how to fix it . I just returned mine the same day I received it and ordered a used nook color.", "Date": "August 15, 2013"}, {"Title": "it is real slow and does not load all the time .but for the price what do you expect should have got a kindle/fire .", "Author": "Brad Bauer", "ReviewID": "R3V02GB4FJFXD8", "Overall": "2.0", "Content": "it is real slow and does not load all the time .but for the price what do you expect should have got a kindle/fire .I got my girlfriend one and she loves it,", "Date": "April 21, 2013"}, {"Title": "pleased", "Author": "chantelle2978", "ReviewID": "RVYDJK3LNRYES", "Overall": "3.0", "Content": "I bought this tablet and was surprized...it loaded quickly.... better playing candy crush on this then phone..... battery run down quick but it charges quick too.. Only thing I was disappointed with was it has a one way camera", "Date": "April 17, 2013"}, {"Title": "its okay", "Author": "Alberto Corralejo", "ReviewID": "R3CF9SOYS57528", "Overall": "3.0", "Content": "Everything works fine my gripe is that i constantly have to delete my gmail account and re-add it in the google play market in order to download.", "Date": "March 24, 2013"}, {"Title": "Horrible", "Author": "Tracy", "ReviewID": "R2TUWK5BRB8LDV", "Overall": "1.0", "Content": "they don't download apps & the language is in Chinese on the browser even though it is set in English.", "Date": "March 1, 2013"}, {"Title": "HORRIBLE TABLET", "Author": "Mlp", "ReviewID": "R3MC6Z2PXLHAJN", "Overall": "1.0", "Content": "This tablet has messed up since the moment I received it. The screen shuts off constantly and it takes a miracle to  turn it on.  I am highly upset with this purchase. I ordered this with one day shipping because of my excitement for my first tablet. This was a horrible idea. If you want a tablet, buy the dang ipad mini. They are worth their money and WORK.", "Date": "March 16, 2013"}, {"Title": "Horrible", "Author": "Tracy", "ReviewID": "R2NF62BTTZX6RO", "Overall": "1.0", "Content": "they don't download apps & the language is in Chinese on the browser even though it is set in English.", "Date": "March 1, 2013"}, {"Title": "Hot Pink", "Author": "Susan Mayhan", "ReviewID": "R3NE8FPBOKB2OO", "Overall": "5.0", "Content": "This is by far the best buy I have gotten on Amazon. The granddaughter loved this for Christmas..She was so excited and I was the hit of the day.", "Date": "January 7, 2014"}, {"Title": "Awesome", "Author": "Remona Clarke", "ReviewID": "RMZV5BTYZLO3K", "Overall": "5.0", "Content": "My son love this. He is able to download all kinds of games and fun stuff, take photos and many more.", "Date": "September 14, 2013"}, {"Title": "Burned", "Author": "Orlando Antunes", "ReviewID": "R3ENEIIKDPEQA", "Overall": "1.0", "Content": "I gave the tablet gift for a friend and while carrying it melted, and I am not able to contact exchange.", "Date": "July 12, 2013"}, {"Title": "Hola", "Author": "Chinancherry de Jesús", "ReviewID": "R27ASTKKSRY1H6", "Overall": "2.0", "Content": "Se frizan mucho tengo problemas para descargar aplicacionesFuncionan muy lentaHay veces en que tengo que eliminar las aplicaciones y volver a descargarlas", "Date": "February 13, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00ADZSIXI"}}