{"Reviews": [{"Author": "Eric A Noorthoek", "ReviewID": "R16A1YQECEETYX", "Overall": "2.0", "Content": "First let me say ...I have read other reviews in the past for other products where people have ended up with a lemon and couldn't get support from the manufacturer. Often those reviews are pretty spiteful and biased against the manufacturer. My goal here is to not be spiteful or biased. I want to help others considering purchasing this product make an informed decision.I purchased this tablet and it quit charging after 2 - 3 days. I understand that there are problems from time-to-time with an individual product that are not necessarily indicative of the entire product line. Therefore when I contacted the company I was quite reasonable in expressing my desire to return the broken tablet. I tried explaining as clearly as I could the problem I was having.  2 months later I still cannot return the tablet. Essentially I now own a $200 paperweight. Since the company is in China and I am in the U.S. there really isn't much I can do about it. They will not give me any information on how to return it or any assurances that they will replace the defective tablet or return my money.Overall, for the 2 days I was able to use the tablet it seemed quick and responsive. Video was smooth and the interface was typical of an Android device. The play store was included - some tablets do not include the play store so I was glad that this one did.I was disappointed to discover that there was no Bluetooth even though the manufacture's website (zenithink.com) clearly said it did. This is a major drawback for me and the main reason I bought the tablet since I had plans for using it while playing my guitar connected to a Bluetooth pedal for displaying music.The battery was extremely disappointing - it lasted 3 hours max in standby. I can understand 3 hours at full use but 3 hours in standby seems unreasonable to me. It is possible that the charger was not fully charging the tablet but the software indicated that the battery was fully charged.The charger plugin jack is precarious and a most definite weak point. It sticks out as if it hasn't been plugged in all the way. It is also very flimsy and I am sure prone to easily break.Any good about this tablet is outweighed by the quasi-support I received. I did get response from support but they offered no real solutions and when I expressed my desire to return an obviously defective tablet they quit responding completely. I was well within the return period stated in their terms. It is apparent that they do not like returns regardless of whether the tablet is defective or not.I would caution anyone considering this product to beware that if you have problems you may not be able to return the tablet or get any kind of real support. in hindsight I would rather have paid double the price from a trustworthy company that supports their product.UPDATE**********After writing this review I decided to try and fix the tablet myself. I took it apart and found the charging jack inside the tablet was broken. I re-soldiered it and put the tablet back together. Now the tablet is working fine. The battery is lasting much longer now which makes sense since it probably wasn't able to fully charge before. Overall it is a fast tablet that works well.Still without good customer support I cannot recommend this tablet since the average user will not be able to fix a broken tablet from the factory as I did. It is unreasonable and ridiculous that this tablet company would not offer help for their defective product.UPDATE 6 months later **********Tablet is still working. Screen is not as responsive as it was. Sometimes the screen goes crazy and starts randomly opening apps. I have to shut off the screen and turn it on again to stop it from doing this. I think this mostly happens when the battery is low. The battery lasts a surprisingly long time. At least when I compare it to what it was doing when I first got it. The battery level indicator always shows as charging even I it is unplugged. Also the indicator jumps around a lot. It will say 90% full and then a few minutes later it might say 40%. I can never trust what the battery level indicator says which makes it hard to know when to charge. There is a tiny white spot in the middle of the screen showing up now. Looks like a small defect. It doesn't really bother me though. The charger went bad - probably because of how flimsy it is. I tried to order a new one but the one I got didn't fit right. I found on my original charger that one of the wires in the charging tip broke inside the plastic housing. I cut off the plastic and re-soldiered the connection and now it works okay. Overall I feel like I have been able to turn a lemon into lemonade. Still I wouldn't recommend this product, at least not without getting a soldiering iron as well :)", "Title": "Buyer beware!", "Date": "January 25, 2013"}, {"Author": "Lionel H", "ReviewID": "R11M6CEH2BOF41", "Overall": "4.0", "Content": "I recieved this tablet yesterday and so far it works really well. I do have a few complaints about it but nothing major.First off, it doesnt exactly have USB ports. It has 1 usable micro usb port (the second one is for ethernet) and it comes with an adapter, which isn't so bad, but it gets a little annoying. It works fine with my usb keyboard and both usb drives I've tried so far. However, it won't read my 750 gig Toshiba external HD.It also does NOT have bluetooth capabilities nor can you use a bluetooth USB dongle, even with the adapter. It isn't a major draw back but it does impede me from tethering it to my phone for internet via Bluetooth DUN. I even tried tethering it to my iPod Touch using PdaNet, with no success; my tablet doesn't pick up the network being broadcasted. I've used this method successfully on many different laptops by tethering my iPod to my phone (Bluetooth DUN via iBluever) then broadcasting a network with PdaNet but again my tablet won't pick it upBesides that it's a really good tablet. Screen resolution is crisp, the operating system works well with the hardware, and if for any reason it gets glitchy a simple push of the reset button fixes everything. Battery life is really good unless you're surfing the web and downloading stuff or watching videos but its acceptable. The ability to turn off 2 or 3 processors is really handy when you're just planning to read a book and want to conserve battery. When running all 4 processors the speed is excellent but its still pretty fast and efficient when only running 1; its a barely noticeable difference unless you're converting movies or running high demand apps and the like. I would highly recommend this tablet to anyone whos in need of an inexpensive tablet for most school related tasks such as typing, taking notes, or reading ebooks", "Title": "Works good so far", "Date": "January 24, 2013"}, {"Author": "HELEN HANNUM", "ReviewID": "R28G6D8W9CYXL9", "Overall": "5.0", "Content": "Ok. I have had my zenithink c94 for almost a month now. I bought it for two reasons. The quad core processor and the price. Its very well made and a nice weight too. I got the white one which I like it looks a little more stylish than just plain black, I guess that's just me, when it comes to tablets I like to see different colours. Anyway the speed is of course very fast I can download apps in virtually no time. The sreen is very responsive,no lag at all, web browsing is very fast, I put firefox on my tablet the beta version and it works perfectly, no crashing which happened a lot with my other tablet I have also installed dolphin browser on it too which is also very fast. I  loaded numerous apps that I couldn't get on my other tablet. Instagram is one of them. The only drawback is shell sbp isn't very good on this tablet the screen res is still too big and cant be really reduced. I may have to root it to get the right resolution for that launcher. I play amazon videos on it which play flawlessly. There is no lag at all when watching movies or Tv shows and the picture is very sharp the hd is really g ood to watch on this tablet. And I can still watch movies whilst charging the battery, which you cant do on other tablets. The battery is the usual 3 to 5 hours which is about average for tablets. I got a free 16gb sd card with the purchase of my tablet and it recognized it but I haven't put anything on it yet but its in and working. The speakers are a little low but I put earbuds in and have to turn it down because the sound is loud with them in. I'm still waiting for jelly bean to be put on the zenithink website for the c94 I think there are still bugs with that upgrade so they haven't launched for this tablet yet but I'm in no hurry for it come out, well maybe a little itchy to try it. The voice to text and voice search work very well in fact no problem at all with the voice search and speech to text is great too. No more typing. I don't think there are any negatives with this tablet really. Maybe the battery could be a little longer lasting, but don't we all want a battery that lasts all day for surfing the web and watching movies. The average laptop battery only lasts about 5 hours unless you are willing to spend over the top prices for a battery life. Generally this is an all round great tablet for web surfing and watching movies and other stuff that tablets were made for. Oh one last thing its also is gps enabled too. I haven't really tried it out yet but a ten inch gps screen. is pretty impressive. I may post another review at a later date when jelly bean is available for this. Apart from what I have discovered by playing around with this tablet I would reccommend people buy it. For under $200 dollars for a quad core you really cant go wrong.", "Title": "very good for under $200", "Date": "January 30, 2013"}, {"Author": "Learning2Serv \"Learning2serv Kaffe\"", "ReviewID": "R370ANVZP1C7VV", "Overall": "5.0", "Content": "June 2013 UPDATEI've had this tablet for 6 months now. It's become a comfortable old friend. I enjoy the games I play on it, the display is bright and clear, and it's been very reliable. The most consistent problem I'm seeing in this and other tablets like it is the power cord. For lower price tablets, the decision seems to have been to go with cheaper connections set up; they tend to be rather weak/lose sometimes resulting in a short, meaning you have to play with the plug to get it to work. It hasn't been a problem for me, but I thought I'd just give you a heads up to be gentle with it.After tons of updates and much playing around with this thing, the performance hasn't degraded at all. Early on, I did notice 2 or 3 bright spots (mildly brighter than the surrounding areas), but they really aren't affecting my ability to see the screen or use it.I've downloaded an app for watching movies, and I was pleasantly impressed with the quality of playback. Unless you've got a very fast connection, don't try streaming movies as they're very large. Things will be choppy. Download them and watch them later.Strictly for the value, I maintain my rating of 5 stars. If I had to pay anymore for this, it would be 4 or 3. If you're looking for a budget tablet/bridge device that is effective or something to cut your teeth on that won't bite your pocket too hard, this is a great start.==== Original ReviewLet's start by saying I don't expect my tablet to be a substitute for my PC or my laptop. *That's not what I bought it for*. I bought as a step between my phone and PC. With the right apps (95% which have been free AND hassle-free), I can check my email, I can get on Facebook. I can check the weather. I can write papers. I can edit spreadsheets. When I connect my wireless keyboard with built in mousepad to it, it goes to a whole different level.This tablet performs very well. It's quick, powerful, and effectively handles several items running in the background. I keep a CPU meter running up front. \"Idling\", right after the tablet completes booting and checking out all the fun stuff, it settles down to 1 or 2% of max CPU. I've purchased another Zenithink pad (C91 I believe) and it idled down to 15% and stayed there (which I thought was pretty good).Battery life seems to be in the 3 to 5 hours range depending on what you're doing. That seems to be about industry average, so no problems there.What makes Android tablets so very very effective is putting Google to work for you. If you do office work, the most powerful App you can look into is Google Drive. Just check it out. Not only can you store your docs in the cloud effortlessly, you can use your tablet to view, edit or even create them.The wireless pick up range is pretty nice too (again, better than my old tab). I don't have an N Wifi router, so couldn't tell you how well that works, but it does G pretty good.The cameras seem to be OK. I don't buy tablets for cameras as they are discomforting to hold for that purpose. It *does* have a 2 megapixel rear facing camera as well as a more modest front facing camera, so there is that. Tried Skype, and it works well enough, but mic pick up isn't that good. Haven't tried Skype video... yet. The built-in mono speaker volume isn't too good either, so I won't be doing the Skype thing much. I've watched one of my favorite YouTube videos on it and the image is VERY nice and very smooth. Again, the audio is shabby: plug in your headphones. Speaking of which, if there is no active audio going on, there is a mildly annoying hiss and crackling. However, this is not really a problem since, well, if you've plugged your headphones you're probably about to listen to something. On the plus side, the volume output with headphones is REALLY loud. The pros and cons sorta balanced out on that one.I've had no problem accessing the built in 8GB of RAM on this machine. Understand that you really lose quite a bit of overhead because of internal process, but being able to access 6 of those 8GB still works out very well. In the old tablet, there was no access to the built in 4GB of RAM, which was no problem since I had a 16GB card.For about $200 this is a rather powerful, very nice tablet. It has firepower, it does what I want it to do, and it does it well.", "Title": "Quad core firepower in your hand. Great stuff!", "Date": "January 16, 2013"}, {"Author": "missgracie", "ReviewID": "RZWPQYS1TOVZU", "Overall": "2.0", "Content": "This tablet did not work right from out of the box. Reading other reviews on how good it is.. I feel it was just a lemon.. I did contact the support team through email and they were very good with getting back to me on every issue. And believe me there were a few..No charge, couldn't turn on...missing apps...But, I did not have any trouble returning the item and a refund was given promptly.", "Title": "Good communication with seller", "Date": "March 17, 2013"}, {"Author": "C. Leuthardt", "ReviewID": "R2T3E9FA7EGU1R", "Overall": "5.0", "Content": "Great product for the price. My daughter uses it for games and reading books. It has a good amount of storage, and is a great deal for the price.", "Title": "Nice for the price", "Date": "March 11, 2013"}, {"Author": "tp", "ReviewID": "R30PVCR7E1648H", "Overall": "5.0", "Content": "Great no problems. It is so nice than I am wanting to order one for my daughter that is in college.", "Title": "great", "Date": "March 5, 2013"}, {"Author": "William Barchette", "ReviewID": "R3QUMG2DWOIVVZ", "Overall": "3.0", "Content": "Pretty fast, great WiFi, play store installed, flasplayer works great.The  bad, not sure how long battery actually last, some games( temple run,subway surfer etc) won't dwnld. Still I'd buy another. Oh when you benchmark score way lower than video's posted on line.", "Title": "Good for pricepoint", "Date": "February 22, 2013"}, {"Author": "kidkjbiker", "ReviewID": "R2RXL1IQO9YF7R", "Overall": "1.0", "Content": "This review is specific to the C94 model. Please check warranty before you purchase as at time of this posting Zenithink offers no express manufacturer warranty past the 30 day Amazon warranty period. Zenithink posts nothing at thier website nor on any literature they provide. The C94 has had issues on some versions of the tablet. Version A1 & A2 have bluetooth, stability and eratic remaining battery power level issues. Version A1 has no firmware upgrade path. If you are chancy make sure what version they will ship you. As of this writing it is a3.The power dongle on the unit is not well designed and is prone to breakage or non-connectivity as described in prior posts.  I have the non-connectivity issue.  Zenithink support was initially very response to the firmware updgrade issue but could not offer a fix for my version 1. They have been totally non-responsive to the power dongle issue.  Dealer has indicated this is a manuafactuer issue and offers no support outside the 30 day window. $150 - $200 is alot of money to spend for 30 comfort window.", "Title": "Check warranty before purchase", "Date": "March 15, 2013"}, {"Author": "Beth", "ReviewID": "RPRVY1YXAQBI3", "Overall": "4.0", "Content": "I am thrilled with my Zenithink C94! It is lightening fast, has a clear and sharp screen, an optional removable storage card, and is lightweight.My single objection with the Zenithink C94 is that it was advertised as - and it is printed on the box - having Bluetooth capability. Other than that, this is a WONDERFUL tablet with a pricetag under $200.", "Title": "This Puts The WOW In A Budget Priced Tablet", "Date": "January 27, 2013"}, {"Author": "agyawusu", "ReviewID": "R39O59IGAXSY4", "Overall": "1.0", "Content": "this item is boring and does not function as its listed specs,the price is cool but the item is not to my expectations.", "Title": "review", "Date": "March 5, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00A2820UI", "Features": null, "ImgURL": null, "Name": null}}