{"Reviews": [{"Author": "Sherita", "ReviewID": "R32L7OUA8OOZ03", "Overall": "1.0", "Content": "I agree with ther est of the reviewers....ACTION GEAR SUCKS!!!!!! After it arrived past date....1hr after my son played it, it went dead! \"Charged\" it over night to wake up to a tablet that wouldn't come on....took it to geek squad at our locall Best Buy and they informed us that the USB port was broken....after going back and forth with Action Gear I finally got my money back after 3weeks!!!!! PLEASE SAVE YOUR MONEY!!!!!!!!", "Title": "1 HOUR OF FUN!", "Date": "November 19, 2013"}, {"Author": "Nancy Cunningham", "ReviewID": "R3ON0HVBGLTNTH", "Overall": "1.0", "Content": "I am working on communication again with this company. I purchased this product and upon opening the gift, it would not hold a charge for my 7 year old grandson....my daughter plugged it in and when she pulled the plug back out because she couldn't understand why it wouldn't charge, the inside outlet where you plug it in, pulled out of the tablet. My daughter sent it back after communicating with the company via email, and they KNEW why she was returning it. They received it they say...with a cracked screen and the warranty doesn't cover damage to the product such as screen cracks...whoa, what?  Let me get this straight, they were going to replace it before it came with the cracked screen right? I mean certainly they weren't gonna just glue a new outlet back in there, so now we are just out the money and now my little grandson has no present and they are gonna be hardnosed and NOT send him a new one, nor refund my money, but they will send back a broken tablet that won't charge and now has a cracked screen??  I wait to see what they decide. At this point I do not recommend anyone buy from this company, ever. If they make it right I will withdraw with apologies, my comments and let the world know they made it right.Nancy", "Title": "DO NOT buy from this company.", "Date": "October 28, 2013"}, {"Author": "Santeia", "ReviewID": "RCIA2H1BR9MRL", "Overall": "4.0", "Content": "I like this tablet. I would recommend for children ages 2-7. It is conveniently sized. Sometimes it does freeze up.", "Title": "This is a great product!", "Date": "October 7, 2013"}, {"Author": "Stephanie Evans", "ReviewID": "RDJWL7VDJMP4N", "Overall": "5.0", "Content": "I purchased this Disney Fun Tab Mini in September to give as a Christmas gift to my grandson. He was 18 months during the holidays and took to the \"ANT SMASH\" app/down load immediately, along with his mother's tutelage, he was learning and doing fun activities in a very short time. After using it for all of 4-6 weeks, My daughter called , telling me it won't hold a charge. After way to many, phone calls, jumping through hoops. no resolution, coupon, exchange, or percentage off on another.  Amazon(distributor) and Disney( maker of product)  have given me is pitiful excuses. ultimately, I did purchase the product in September. I have a voice for my grandson something should be said.  First, it's a God awful shame this has happened to my grandson or any child that received a defective Disney Fun Tab Mini, any defective toy, ever.( made for children under a certain and over a certain price, I say $50.00)  We don't have that type of money and for us and many others , there are certain times of the year to make \"big purchases on a budget\"  We were all truly  amazed with this toy/product and could see the potential of this gift for children so young. I trusted both of these companies for many other purchases and vacation stays. Secondly, Disney put out this product with this defect or defects, Amazon sold it, and neither accepts the responsibility. I do understand the time frame situation, but the truth is the truth, \" You can see in your record also that the purchase was made, it was given to a child for Christmas and before the first week of February is was not taking a charge at all.\" Third, most important, Disney and Amazon put this out for CHILDREN and left parents and grandparents to have to explain that we, brought products that are now broken and they can't play with anymore. In my case I couldn't even word an explanation to a 1 1/2 year old child, he just can't play  Ant Smasher anymore. Ironic, that these big companies are always \"Smashing\" the working class. My grandson's birthday is in June do I buy him another tablet? I will most likely replace it because of the concept.  Clearly not a Disney product ever or a purchase from Amazon ever again, Disney/Amazon big money makers duping the CHILDREN. SAD", "Title": "Smashing", "Date": "April 22, 2014"}, {"Author": "Roshana Dorch", "ReviewID": "R25GLL3U2ERPLO", "Overall": "5.0", "Content": "works great..child loves it and its able to fit in her pocket..not too big or small.....she plays in it a lot", "Title": "great!!!", "Date": "January 7, 2014"}, {"Author": "Howard Cosell Seals", "ReviewID": "R2DT5VXIU5Z93Q", "Overall": "5.0", "Content": "my niece enjoyed playing with it i enjoyed playing with it  with her its one or two.games on there i like to play", "Title": "thanx", "Date": "December 30, 2013"}, {"Author": "MAGDALENA RODRIGUEZ", "ReviewID": "R3D17JN2G7HCFS", "Overall": "5.0", "Content": "This tablet is a great product. It is an excellent product. I would recommend this for children. Its a great learning product", "Title": "Ematic FunTab 4GB 4.3\" Kids Tablet", "Date": "December 23, 2013"}, {"Author": "Merrick", "ReviewID": "R2RZYJI00D10Z9", "Overall": "5.0", "Content": "Every day when I get home from work, the house is completely trashed because my 3 and 5 year old kids think it is entertaining to mess the house. My wife thought that purchasing this tablet for the kids might help keep them entertained during the day. It was pretty hard to find because only a couple of stores carry it. But after a couple of days I finally found it! The price of the tablet was cheap and well worth it! My kids can play a variety of games from making pizzas to reading stories. Even though they are playing games on it all day, they are actually learning and gaining knowledge! If the battery runs out of power, you can just plug the tab into the wall for the night and in the morning it will be charged! No doubt a great purchase for me and I would highly recommend this Ematic Fun Tab Mini to all parents who want to give their kids an educational distraction.", "Title": "An Entertaining Learning Tool for your Kids!", "Date": "December 6, 2013"}, {"Author": "tlyn", "ReviewID": "R1X9CMCYIFQ39Q", "Overall": "5.0", "Content": "My daughter is going to enjoy playing with this new gift. She is turning 5 and will learn alot from it", "Title": "Love it", "Date": "August 24, 2013"}, {"Author": "AnnMarie Hillman", "ReviewID": "R1RUFE8E1ELF1M", "Overall": "1.0", "Content": "Silly me i am now reading the reviews on this tab i bought for my daughter for her Christmas and now i am scared coz the reviews are horrible. I am receiving it today and i pray to God that it works well and lasts long. I will be back on in a few weeks to write my review on whether it works well or not.", "Title": "scared now", "Date": "November 5, 2013"}], "ProductInfo": {"Price": "$69.99", "ProductID": "B00BMJCQP0", "Features": "Android 4.0 Ice Cream Sandwich, 4.3 inches Display\nA8 1.2 GHz\n4 GB Flash Memory, 0.5 GB RAM Memory\n5.5-hour battery life, 0.28 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41bnj%2Bxbm1L._SX300_.jpg", "Name": "Ematic FTABMP2 4.3-Inch 4GB Fun Tab Mini Touch Screen Kids Tablet (Pink/Purple)"}}