{"Reviews": [{"Title": "The best tab", "Author": "Salman", "ReviewID": "R99DZFA8VB2C", "Overall": "4.0", "Content": "pros;Full powerful pc in a tabLong lasting battery for normal use ( Not gaming )Loud speakersGood after sale support.cons:NO 3G or 4G connection . For me the most important missing feature I would rate this pc 5/5 with it.Heavy weightcharging port not in a good position should be some thing from behind the tab not effecting the edge.I think the drivers or programming could be improved since there are some blinking windows with the start.", "Date": "February 12, 2014"}, {"Title": "razer", "Author": "Harrison Bage", "ReviewID": "R9V9QYSSU1R9J", "Overall": "4.0", "Content": "I have to balance it awkwardly on the protruding power cord to prop it up. One quirk that doesn't involve the accessories - for some reason the capacitive touch sensor is tuned or only capable of recognizing \"wide\" touches - that means fingertips don't register well (particularly for swipe-in-from-bezel gestures), while it's perfectly responsive to the pad of your finger.", "Date": "July 24, 2013"}, {"Title": "Did what I wanted, then kablooie", "Author": "Joshua Zustiak", "ReviewID": "R1QVBVNHF7JJEJ", "Overall": "4.0", "Content": "I've used the system about 2 months now, I prefer PC games to consoles, and travel a lot as a member of the military.  I use Steam for some of my games, which works great when I have a good Wi-Fi connection (note the Wi-Fi only part), but I have a lot of game CD's (I like to buy collectors editions when I can) and if you do as well, you'll need an external CD/DVD via USB to install on this tablet.  You'll need to get a keyboard and mouse to play any serious games (I was using it to play Mass Effect recently) and Logitech peripherals work well because of the single wireless receiver that can work with multiple devices.  Only having one USB slot was a real pain, and when I bought the system, the docking station wasn't out yet, but you can buy a USB extender for around 15-20$ that will turn the one port into four if needed.  One bothersome annoyance: there is a light sensor that automatically dims the screen if it's dark, and brightens the screen if it's light.  If you get the right level of light, this dimming and brightening can occur off and on while you're playing and it's a real pain.  I also didn't want this to occur as I enjoy playing in low light, and it was irritating to have to find the setting to change this so I could have the screen display reliably whenever I used it.  The docking station I was really excited about, because it meant that during my family's move to a new location, I can connect it up to whatever TV is in the Hotel I'm in (as long as it's HDMI capable).  I got it, plugged it in, it works great!  Only problem is that now I am unable to use the 640M LE NVIDIA driver on the touchpad display anymore.  The option is gone-- I used to have a choice of which GPU to use (let's see... integrated video vs. NVIDIA 640M... hard one there) but now I can only use the 640 M if I'm connected up to the TV.  That's NOT what I purchased this for, and it's disappointing to have this happen.  I work each weekday and typically have to work late, so I haven't been able to make time to call the support line to see if I can get this changed somehow.  if I can get the GPU issue fixed, I'll likely raise the rating because it's delivered on the portable PC gaming/office capability I wanted it to do, but the hassle of needing to buy the USB extender (I'd expect two USB's at least for the price), plus dealing with the pre-determined screen dimmer prevent it from being the 'bestest experience evah'", "Date": "July 10, 2013"}, {"Title": "Someone please make aftermarket peripherals", "Author": "James R. Kohler \"Um...stuff\"", "ReviewID": "R319IH3ERENNPO", "Overall": "3.0", "Content": "I've only had this tablet for a few days so far, but after nearly all of the expectations I had prior to buying have been met, I am excited to post my impressions here for others who may be on the fence about buying one of these. Do it. It is a great machine for gaming and mobile computing :)So things that I like (my opinion pros)+ It runs games great (so far Left 4 Dead 2 and Starbound are the only 2 I've tried)+ The touch screen is responsive enough for most operations+ Boots very fast+ Minimal bloatware installed (Thanks Razer)+ Bluetooth works with the Dualshock 4 controller ;) (initially didn't work, but after some Windows updates, it did)+ making me warm up to Windows 8Cons- Battery life is pretty poor compared to other tablets, but the trade off for that is performance- the wifi/bluetooth radio is kinda flaky, going to experiment with turning off the bluetooth, etc. (signal fluctuates in strength)- the \"out of the box\" setup is not ideal. Steam needed to be re-installed in order for me to log in, certain features of Window 8 needed to be tweaked- peripherals hard to come by (will have to wait and see if Razer can get them re-stocked/released eventually)Some tips for optimizing the tablet:enable the \"actual, full keyboard\" in PC settingsturn off the auto adjusting brightness based on lighting conditions in PC settingsget a USB hub if you aren't getting the docking stationIf you want to use a Dualshock 4 controller, get DS4 Tools. Just search DS4 Tools in google. (I can't post a link in this review)Update March 29 2014:=============================Having spent more time with this Tablet, I can't honestly say I recommend it anymore. It still works great and I use it very often, but those nagging issues like poor wifi strength, low battery life, and a finicky touch screen do detract from it's appeal. :/ Even worse, it seems as though this product is being phased out of production. The peripherals are still not available anywhere, and Razer shows no signs of fixing that. Basically, if you buy this tablet, you're on your own. That's pretty harsh.Specifically the problem with the touch screen (since I didn't mention it in my initial review) is that certain programs like Skype don't register \"clicks\" very well. You could chalk those flaws up to the programs themselves being inferior to Windows 8 apps, but I like my normal looking programs. Also, the virtual keyboard of Win 8 causes flash plugins to crash occasionally.Despite all those additional flaws and minor annoyances, this Tablet is still very well priced. The performance is still wowing me.Games to add to the list of one's I've tried:TerrariaSid Meier's Civ 5(Technically have Magic the Gathering 2013 and Metal Gear Solid Revengence installed, but haven't tried yet)", "Date": "February 8, 2014"}, {"Title": "Do not upgrade to Windows 8.1, not for the weak of heart.", "Author": "Edwin R. Reyes", "ReviewID": "R1IVPCUN2Y79WO", "Overall": "2.0", "Content": "I edited this on 04-25-2014. It really boils my blood that I spend this amount of money on a piece of technology that was Dead On Arrival.  Razer stopped production less than a year from release along with all the peripherals for it.  If I knew Razer was going to stop supporting this, I would have spend my money more wisely.  This is a really disappointment.  To add more disappointment, Razer still announces this as something big in their website, as if they are still selling them or the peripherals.********First of all, Leave the Grammar Nazi in the closet.  English is not my first language.I really haven't been able to use it.  Although what I seen so far is been well, good.  I could not find a way to run the Steam client.  it comes as the Big Picture instance.  Horrible system if you ask me.  It was very hard just to get the keyboard on screen and by the time I figured out how to write in my user name, password and verification code (steams requires this when running Steam for the first time in a PC) something went wrong and I could never log in.  I could not get Steam since I could not write the verification code and could not do the desktop mode so I uninstalled it and re-installed it.  That solved that problem. Started running the installation for Civilization 5 (been playing this franchise since 1992) while did what follows.  I wrote this review as I was trying the make the thing work.  By the way, dropping all the Razer gear is to show I do like the company and am a loyal customer.Well, I have a two desktops running 8.1.  Since all tablets, so far, run 8.1 and 8.1 is a tablet OS after tall, I decided to upgrade to 8.1.  What a mistake. The first time it tried to run, the screen was locked in one direction and the clicks will register on the other side of the screen where you clicked.  That made the on-screen keyboard unusable.  So I connected my Lycosa keyboard and type in my password.  When Windows 8.1 came up, it was still upside down with registering the clicks on the opposite side of the screen of where I was pressing.  Windows, of course, does not uninstall.  In order to maneuver my way around the screen I tried to connect my Orichi but for some reason it wouldn't recognize it through the Bluetooth so connected my Mamba, to find out that apparently that I could not run the mouse through the Lycosa, so I changed keyboard to an old Tarantula and that way both worked. I went to the Razer page, the FAQ has nothing regarding 8.1.  I do a search and apparently I am not the only idiot who has tried this with the same effects.  So, through my meanderings in the Internet, I found out that Razer has special drivers that will work with 8.1, but before installing 8.1 you have to first uninstall a number of applications.  Mainly display and sound.  Well I didn't since I did not know and there are no warnings that a 2013 i7 core tablet is not compatible with the latest version of Windows out of the box.  If there was a warning, I wouldn't be this angry.  So I uninstall everything that needs installation and download the drivers.  By the way, there is no instructions on the order in which you should install these drivers.  So I ran what I though it should be the first one, since one of the problems is that the screen is locked \"upside down\".  Well, I click on the program \"Sensor Hub\" and I get a Command window running some batch file.  It ends and nothing happens.  After 5 to 8 mintues I decided to just reboot it.  Well, now the screen is not locked.  Now the screen orient itself when you turn the table around.  Only problem, it orients itself upside-down to how you are holding it.  GREAT!  So now I have to turn the tablet and lay it flat taking care it does not tilt or I'll end up with the thing upside-down again.  I run the next \"logical\", it seemed, program. \"Razer Display Switch\", I get a very fast splash screen and... nothing happens.  So I don't really know if something did happen.  I ran it again, yes I am an old computer guy.  If it screwed up on the first try, maybe on the second it won't. Old PC tech mentality. Yep, the same.  Really fast splash screen of a command window program with some other window with buttons that I don't get to click because it came in and out faster than my eye could see.  NEXT! the \"Dolby Driver\", since the old one did not really loaded in 8.1,  Restart.  At least this one did ask for a restart.  Next one, the Conexant SmartAudio.  WTH, it is the same program?  Why then list it twice.  the description says Conexant SmartAudio 8.65.4.0, but when you download, it downloads both drivers in the same package, I guess.  NEXT! Nvida VGA driver, OK, that one installed with no issues.  Next Intel VGA, the version on Razer is older than the version installed.  Which did not make sense, so I did not install that one.  After all that I still have the screen upside-down and the taps register on the opposite side of where I am tapping.  And NO, doing the screen resolution and flipping the screen does not work.  The taps keep registering on the opposite side of where you tap and the screen goes back to being upside-down.After paying this much money for a tablet, I expected a better experience.  Especially when I own two keyboards, three mice a set of headphones and now the tablet.  I was going to get the next iteration of the Blade, but now this has me thinking.  I'll post this in Razer's support page.  See if they can help me.  If they can't well I guess I'll have to return it, after I already bought and installed the Zagg shield on the whole body.The following was a couple of hours later; Turns out it was the Intel driver.  Yes you need to downgrade the driver.  Now works fine.  Finally I get to play with my new toy.  I upgraded the 2 starts to 3, just because of the hardship.", "Date": "December 6, 2013"}, {"Title": "Had kinks, but Razer fix them and now its perfect", "Author": "Thefallingbox", "ReviewID": "RB4D2Q4PF65GJ", "Overall": "4.0", "Content": "I got my Razer edge pro right when it came out (amazon pre-order so like 3 months after it released) and i noticed it heated up and blacked out a lot. After contacting Razer they fixed it with out loosing all my game info, and have been happier than ever!I have my edge pro hooked up to my TV, I use it as a﻿ steam console and my steam games like Black ops II and Bioshock Infinite with my xbox 360 controller, then switch over to netflix for a family movie using a wireless keyboard. Since I am a big pc gamer, all my steam games can easily be transferred to my tablet to be played on the tv.I would have given a 5 star if i didn't have to get it repaired, but other than that it is the perfect tablet for extreme gamers", "Date": "September 23, 2013"}, {"Title": "just buy it... dont fear the price because its worth it (one thing i want razer to fix)", "Author": "Jose Munoz", "ReviewID": "R3AOH9JL0QP9CI", "Overall": "5.0", "Content": "the tablet (or computer) is very fast and has awesome graphics due to its video card and its i7 processor works great. Something which has been bugging me is the wifi receiver... its not as fast as a normal laptop and i know its not my internet but i would also like some support from razer to see if its a driver update or something that im missing. apart from that, best tablet ever!", "Date": "June 4, 2013"}, {"Title": "First Day on the Subway PC Gaming!", "Author": "gotham", "ReviewID": "R3PW0SC78HT0TM", "Overall": "4.0", "Content": "I've been following all of the news surrounding the Razer Edge when it was still called Project Fiona.  I've been trying to create a similar solution with my Galaxy Note 2 rooted and paired with a Playstation controller, but obviously it doesn't come close to my dream of PC Gaming while on public transit or in various environments that I find myself in everyday.Just a little bit about my challenges, I have a herniated disc in my back and suffer from sciatica if I don't exercise or stretch.  So sitting in front of the TV with the console or long sessions of PC gaming have become nearly impossible (I stand most of the day working at my retail store).  So I've been looking for a ton of solutions to game in a different ergonomic way.I didn't purchase on Amazon because they don't ship the Razer Edge to Canada, but did pick one up from Best Buy. I'll get straight to the mobile gaming experience with the Razer Edge.  I downloaded Steam, and installed Bastion, Darksiders 2 and Sleeping Dogs from my archive Steam library.  Bastion worked amazing, and it was my first game I tried out with the controller while sitting on the couch.  Yep, I'm a pretty fit guy and the combo of the tablet along with the controller made it for a pretty heavy experience.  However, I fell off my bike last week and infected my bursa (in my elbow) so the numbness in my left arm/hand was partly due to my accident.  Not sure why they put the power port on the bottom, since you'll likely rest the combo on the couch, lap or your chest depending how you're sitting and the power input is square centre although not sticking out completely vertical but horizontally flush.  Their is considerable heat coming out of the top right vent, but not as much as I thought.I next played Darksiders 2 on full settings and i was blown away how amazing the environments were on the screen.  I was coming from an Alienware M11x so I'm used to the same resolution and similar small screen.  The sound is pretty loud, and works great with some ear buds, and initially I wasn't able to fit my Monster Inspirations to the port with the controller, since the cable wasn't completely vertical.  I had to reverse the headphone cord and so far I don't think I'm compromising the sound on my Monsters (which are okay headphones but not the best, however they have noise cancelling so on the subway this amazing).  The controls take a little getting used to, buy it's mostly the overall weight that will throw you off.  No one is used to a 2 lb plus xbox controller unless you deliberately put weights on your controller!  But you end up finding the sweet spot.  One thing that was really inconvenient is that when I loaded Darksiders without the controller, I had no way of minimizing the window or getting back to my task bar to shut the program.  I had to do a hard reset.while on the Subway, I loaded Sleeping Dogs, and was so impressed how great the game looked and felt.  The rumble feature just adds that familiar xbox 360 feeling to the game play.  I have a massive Steam library of games I've played a total of 35 minutes on average, that I think I'll be using the Razer Edge to get through this long list while putting in my more dedicated competitive hours on my M11x via multiplayer.  One thing I noticed is that there isn't a microphone port immediately available on the tablet itself.  You could use a USB adapter but it's just another add on that you'll have to carry. I know on the dock and the upcoming keyboard adapter, you'll be able to connect both a headphone/mic combo.Everyone is complaining about the battery life, and I get it.  There's a lot going on when you're gaming, even though you can turn off all of your unused system resources (I used Razer's Iobit Gamebooster, much like I did on the M11x). But on my hour and 45 minute commute I was able to play about an hour and 20 minutes of Sleeping Dogs at full resolution.  When I got to my shop, I showed the guys and one of them played another 20 minutes before I took it away!  Purchasing an additional battery for the game controller would be more than enough on a standard urban commute. Think about it, I hardly have the time to game right now, but I spend over 3 hours of commuting from work to my girlfriend's apartment. I could play on a full charge in the morning, charge it all day while still using it and then play on the way back...that's 3 hours of gaming that I didn't have everyday and now quality  with the girlfriend!One thing that I've noticed in Windows 8 on hybrid tablets is that chrome doesn't work that great.  Tabs become unresponsive and it becomes even harder when you are on the Razer Edge since you don't have a physical keyboard.  The virtual keyboard button is alright, but doensn't pop up all of the time.  I've experienced some strange wifi issues too, but not sure if it was because I was at my gf's wifi network.  Basically, I couldn't browse the web if I was downloading a game on Steam.  But I could, when I paused the game download.  Right now I'm just taking the time to organize the device but I'll probably take out the 128 gb SSD and install a 256 gb SSD like another individual did on YouTube.  128 gb with games like Skyrim, Far Cry 3, Sleeping Dogs, COD BOps will fill up really quick.  When I go to 256 gb, I'll begin to make it my dedicated computer, with a doc, bluetooth keyboards/mice and external screens.Would love for one day for the tablet to include a built in physical keyboard similar to the Toshiba Satellite series, but I know that everything is going towards detachable which makes sense, but having a full convertible is really useful when you're in tight quarters or on the transit.Super stoked on this device, looking forward to pushing the limits. Congrats to Razer for realizing my gaming dreams.", "Date": "May 10, 2013"}, {"Title": "Unique and Powerful", "Author": "N. Schoenholtz", "ReviewID": "R25VYGSSHJT069", "Overall": "5.0", "Content": "I was just talking to my wife last night about how great the Edge is. It's so perfect for the lifestyle I want. I have a young son and a demanding job, and it's amazing that whenever I have a little time free, anywhere I want in the house, instead of playing iPhone games I can play serious modern games. Gaming goes from once a week to pretty much daily. I can play a game, pause it when I run out of time and put the Edge to sleep, and when I have time again I can wake it up, unpause, and I'm gaming again within a minute.It's also a full fledged, powerful ultrabook. I have Ubuntu Linux running in a virtual machine with all my work stuff on it (LAMP stack, dev tools, etc), and it works flawlessly. The keyboard dock may not be out yet, but this is a PC -- it works with all the PC peripherals I already own.I've read a lot of reviews expressing concern about compromises, like weight and battery life, but those things simply haven't been a problem for me. I've been able to use it exactly how I want to without feeling like I'm compromising anything. The screen may not be 1080p, but it's as good or better than my MacBook Pro and frankly when gaming it looks great.In terms of value, the tablet itself is very fairly priced when you compare it to other ultrabooks and gaming laptops. It has a unique combination of flexibility, portability, and power. The gamepad dock seemed kind of overpriced to me at first, but considering the way it's really changed my ability to game when and where I want, and the fact that it's VERY unique, I am 100% happy that I chose to buy it.", "Date": "April 13, 2013"}, {"Title": "Good but could be better", "Author": "Amazon Customer \"racerx59\"", "ReviewID": "R1UNE915IXLIIP", "Overall": "4.0", "Content": "Good but I wish it had support for a stylus similar to that of the Microsoft Surface. You cannot play games with your fingers alone. There is no HDMI unless you buy a docking station. Also it has no media card support. If it had stylus support I would have given it a 5 star rating.", "Date": "October 26, 2013"}, {"Title": "Great gaming device", "Author": "Gregory D.", "ReviewID": "R2EAR0XUZV0S4M", "Overall": "4.0", "Content": "The razer edge is great. So portable and very powerful. Plays all my games with ease. I use a wired xbox 360 controller to play and its great. I just with the controller attachment was not so expensive and cheaply made. I upgraded the SSD and ram. Plays great. Only gripe is that it only has 1 usb 3 port. An HDMI WOULD HAVE HELPED. still. I would reccomend to anyone on the fence.", "Date": "September 24, 2013"}, {"Title": "Awesome Tablet!", "Author": "Brian Jones", "ReviewID": "RVMFK9ZW8DBIM", "Overall": "5.0", "Content": "I've had my Razer Edge Pro for almost a month now, and I am extremely pleased with it. I have been looking for a tablet for about a year now but none of them fit what I wanted from a tablet... CPU power, ability to use any program, and decent video games. When I found the Razer Edge, I fell in love instantly. I was disappointed to read the online reviews of the Edge before it was released, as most of them were poor. I am here to tell you that those review editors wouldn't know a good PC if it beat them in the face.The Razer Edge is really a PC in tablet form. I can get aprox 4 hours of battery life without running games. I haven't been foolish enough to run games for an extended period of time off power though, but the review people say about an hour. Overall, it is an amazing machine, and well worth the cost!Now, the downsides.The Edge runs hot. Always be mindful of the cooling vents, otherwise you'll be the reason the future tablets have a caution sign on them.256 GB is not big.... I know it is good for a tablet, but I have to be mindful of which games I load on it.The Wi-Fi is poor at holding connections. I'm pretty sure it is just a stupid engineering mistake of some dude not putting the Wi-Fi antenna along the case rather than buried in the middle. It isn't deal breaking, but it is annoying when my phone has solid wifi when in my pocket but the Edge on my lap can not.Windows 8.... is just silly. Mostly win 8 is great... but some things about the OS is just plain silly. Not razer's fault, I know.Overall, this is an amazing tablet. I am extremely pleased with my Edge after a month. I highly recommend it to anyone that is disgusted by the poor tablet market and want a better option.", "Date": "May 10, 2013"}, {"Title": "One of the Best Tablets/Laptops i have ever had", "Author": "Nick Luna", "ReviewID": "R2A1TSZE0FRAHV", "Overall": "4.0", "Content": "Now that i got that title out let me explain. For the last 3 years i've owned Alienware's, Sager's and a few other types of gaming PC's and none of them quite compare to this tablet. Sure those other systems are more powerful or have bigger screens but for my needs this tablet/laptop works for me. For every good thing that i love there are some cons that Razer could've easily overcome but whether it's from not caring or just being too lazy these cons can hurt the overall appeal of the machine from either the average joe's or the tech heads. First the pro's......Pro's: Core I7 in a tablet runs great and i never had any heat problemsUpgrade able Ram, Wireless card and Msata SSDWin 8 or 8.1 works great in a tablet as opposed to using it on a PC with a mouse/keyboard2gb Nvidia graphics card runs every game i played on it (Injustice to Civ 5)The screen looks nice in my opinionUSB 3.0 port on tabletDocking Station is very niceThe Recovery Drive is a lifesaver but you must order it from Razer.I upgraded the system to 16gb of ram (corsair vengeance), the Intel wireless ac card and the samsung 480gb msata ssd drive. I applaud Razer for treating this tablet like a full on laptop and making it easy to open up the system and replace what you want when you want it. Now onto the Cons......Cons: No Micro Sd card slotNo 1080p screen (i understand why they didn't do it but feel disappointed nonetheless)No wacom supportNo HDMI port on the tabletTo upgrade to Win 8.1 you need to download some drivers and follow the directions. It can be a hassle.No updated Win 8.1 intel graphics drivers.All of the Edge's accessories are very overpriced.That last one hurts because it seems like Razer's really nickel and diming the very small Edge crowd. The docking station is great but at 100 it's just not a great price. Best Buy has it for 20 dollars less which is better. The keyboard dock is very disappointing at 199.00 plus tax. It feels very cheap and keys don't always register. It does have 2 usb ports and it's unique looking but c'mon Razer you could've included the extended battery for that price. The controller is very cool and if it would've came with an extended battery that 249.99 price would've hurt alot less. Now i haven't had any problems with the controller but i've heard of people who had and that's very disappointing to hear especially when these products could've been fixed in house before shipping. No Q/A dept from Razer? Overall though the system is very well made and great to have. I do highly recommend the system but stay away from most of the accessories.", "Date": "December 18, 2013"}, {"Title": "Almost bought one, but it's not quite up to par with other offerings", "Author": "Richard", "ReviewID": "R184FOV93LDG25", "Overall": "2.0", "Content": "Almost pulled the trigger on this until I saw the screen resolution.  The Surface Pro 3 has a resolution of 2160 x 1440.  I'll have to hold out until they catch up with the other tablets.  Good idea though, just not quite there yet for my money.", "Date": "May 30, 2014"}, {"Title": "The New God", "Author": "Steven", "ReviewID": "R1HZOCVKL5S1MM", "Overall": "5.0", "Content": "The single most advanced piece of technology you will ever hold in your entire life. more powerfil than most laptops.", "Date": "May 25, 2014"}, {"Title": "good purchase", "Author": "Lavon", "ReviewID": "R3RAI0JFSPR3JO", "Overall": "5.0", "Content": "Great for gaming and if you already have a pc you can sync it to the tablet and it runs on its own without controling your pc", "Date": "May 25, 2014"}, {"Title": "I want to give the product itself four stars.", "Author": "Andrew Lane", "ReviewID": "R1SQQ48PNQDPP", "Overall": "3.0", "Content": "So, when this was coming out, my old gaming desktop was on its last leg, and I was looking for a newer, more capable gaming machine to replace it.  I didn't need anything extremely high end, as my PC gaming consists pretty much of World of Warcraft and Dark Souls.  This machine was just inside my budget, and with the ease of extending the monitor through an HDMI cable, I decided I'd go for it.  I had always wanted a tablet. Gaming-wise, it's a fantastic little machine.  It does everything I could ask for it, and more.  There are a few quirks with the machine, such as a blue screen of death every time it's disconnected from the HDMI device.  It's also just a tiny bit too heavy to use as a tablet in most cases. If my experience was just limited to that, I'd give this product four stars.  The other star I have to take off is due to the accessories you will pretty much need to support this device and take advantage of its flexibility.Let's start with the docking station, the #1 accessory I use.  The docking station is not terrifically manufactured.  I gave that a 1-star review.  You may also quite likely desire more than one of them, to dock the machine at several convenient locations. If you feel that $100 is a bit much for a docking station, you might be shocked. Razer is not capable of keeping up with demand on this item, so they are currently selling refurbished for $700-800 from individuals.  There are no other compatible HDMI docking stations either, as the connection is proprietary.  (it Is possible to connect USB3.0 to HDMI, but it won't be as good).Next, the keyboard dock.  The keyboard dock starts out at $200.00.  It's a flimsy plastic thing with 2 USB ports and a power plug.  The keys are not illuminated, and they are very close together, and slightly vary from most other US keyboards on the market making it quite difficult to adapt to.  For a $200 keyboard that extends battery life, you'd expect it to come with a battery, right?  Wrong.  The extra battery is another $100 on top of that.Lastly, the game controller accessory.  This is essentially a two pound, two-handed x-box controller that costs $250.00, bringing the total weight of the tablet to 4 lbs (2kg).  I can proudly say I did not bother purchasing this, on those merits alone.  I opted instead to get a $10-15 wireless xbox adapter for my actual 360 controller, which works great!.In summary (tl;dr)It makes a decent gaming machine, and portable media solution, but the accessories are too mandatory and expensive.  I don't think it's a really great idea to purchase this item over a Surface or a gaming laptop, depending on your needs, but I also don't regret my purchase either.Hope this helps.", "Date": "May 23, 2014"}, {"Title": "Razer Edge Pro 256GB Tablet", "Author": "Manuel M", "ReviewID": "RGGVH8ESA7X9", "Overall": "5.0", "Content": "First of all I would like to say Amazon you guy's rock!!!  Thank You  and I will explain why in a bit ok so I ordered one of these Razer Edge Pro gaming tablets I've been following this since it was called project fiona after watching tons of YouTube unboxing videos to see how the tablet looked. I gotta admit it was pretty expensive when first released after amazon dropped the price I ordered one and when I received it it was working but it had a defect  with charging the internal battery anyway amazon with there amazing super 5 star *****  customer service quickly send me a replacement unit and I returned the defective unit back to them. Now for the gaming tablet this device is awesome I installed Thief 2014 since I am a thief fan of all the other thief games anyway I ran the game I couldn't believe I was playing a pc game on the go and on the bus I also have the gamepad and extended battery and docking station I was on my way to upstate albany it ran the game and the performance was excellent on medium settings and I played for about 2 hrs before I had to plug it in and charge it up and I've also installed other pc games on it like trine and Ghostbusters the video game  I gotta say I love this device amazing tablet it's true what other people said about the razer edge accessories it is becoming harder to find and more expensive has the tablet is no longer being sold anymore by Razer they did have very high demands on  pre orders which were sold out.Pros: of the deviceVery fast ssd hard drive.Excellent volume on both speakers very loud better then most laptop speakers.Screen is very vivid on games nice ips screen.Battery last long for regular tablet use.Touch screen works the way it should.Cons: of the deviceit's a little thick on the tablet side and may be a little heavy compared to an ipad for regular tablet use.but that is to be expected due to the power this tablet has. No other tablet comes even close to this power horse.no sd card slot.no ethernet portno hdmi port or vga port.have to use the docking station to get hdmi output.does not come with a tablet stand have to use docking station to stand the tablet up but you can use a universal tablet stand it will do the job just fine.does get a little heavy with the extra accessories with the gamepad along with external battery. doesn't really bother me at all anymore I've gotten use to it now.Overall this tablet rocks I am blown away that I can carry this with me rather then trying to carry a very heavy laptop with all the accessories and I can play my games on the subway going to my job or on the bus Razer really did an excellent job with the gaming tablet it's a shame they no longer sell it. I really believe other gamers would enjoy it. RAZER if your reading my review I can't wait to see the next gaming tablet you guy's make once again I definitely recommend this gaming tablet to any gamer since I am a gamer myself. I know what most people will say this tablet is very expensive I can buy a nice gaming laptop for cheap that maybe the case but the purpose of the gaming tablet is for someone who already has a nice laptop but also want a unique device that can play pc games where ever they go I find this tablet easier to setup vs using a laptop. For anyone out there that would like to get the gaming tablet if you can get one I recommend not letting it slip by you it is definitely worth it I am very happy with my gaming tablet. To:  Amazon Thank You again for the amazing customer service  :)", "Date": "May 15, 2014"}, {"Title": "Over priced hard to get accessories.", "Author": "Brandon VanDeusen", "ReviewID": "R3KBUWF8AJEHPN", "Overall": "3.0", "Content": "The Razer edge has been a great tablet. Handles all my PC needs for work and also allows game play at GREAT frames per second. Would give a 5 star rating and recommend this tablet but the accessories (docking station keyboard dock and gamepad) are all really hard to find. And when they can be found people ask 5x the retail price(docking station sells for 400-500 on eBay and the dock retails for 99.99). This wouldn't be an issue if the tablet had more than 1 USB port. If you need to use more than 1 device at a time with the Razer Edge pro then avoid this unit. Other than Razer not continuing to manufacture and sell the (some say high price) accessories then I would say great device. But if you feel the need to sit the device down and not use it as a pure tablet then look at the Microsoft surface pro line up!!!", "Date": "May 10, 2014"}, {"Title": "Completely useless without keyboard and mouse; typical Razer quality issues. (Garbage quality)", "Author": "Hi", "ReviewID": "RBWMP4W8S7QT4", "Overall": "2.0", "Content": "The biggest issue with this device is that it is useless without peripherals. On pretty much any other tablet if you were to select an area that has a text input, like a search or address bar, the keyboard opens up automatically so you can input the information. This brilliantly designed device does not do that.Think about that for a second. Anytime you want to type something into this laptop you need to manually activate the keyboard. EVERY. SINGLE. TIME. While you may be thinking “well this is made for gaming” trust me when I say this makes the device so cumbersome to use that it is simply not worth it.This device is such a pain to use that I would have ordered a return label through amazon’s online service, but got so frustrated that I just called in and had them send me a return label. Absolutely ridiculous.Also, the dual operating system thing this monstrosity has going on is VERY glitchy, even by Razer standards (which are pretty low to begin with). When it works, it’s alright, but when it doesn’t work you can expect your device to freeze, stop responding, along with a variety of graphical issues.I still give it 2 stars, because it felt somewhat well-built, and if you were to use it purely for gaming and NOTHING else, then I still feel that this tablet would be O.K. Just keep in mind that you will pretty much need to buy a keyboard and mouse to use along with it.The touch recognition and general input of the device is horrendous and not what you expect from a tablet that cost more than a down payment on a car.Also Razer support was next to useless and slightly condescending anytime I asked for help. So there’s that, but none-the-less even the greatest customer service rep couldn’t fix the crap that is this tablet.Save yourself the headache and buy a thousand dollar paperweight, because that is all this thing is.", "Date": "May 8, 2014"}, {"Title": "Must have for gamers.", "Author": "Arturo", "ReviewID": "R3TMULFGEHEDV0", "Overall": "5.0", "Content": "A bit expensive, but it is worth all the money. Even without the gamepad, you plug a 360 controller and you are good to go, and with a nice pair of headphones (I have the adaro myself) you have a mobile gaming station. Battery will last about an hour and a half of gaming, though it depends on the game. I tested it with dmc and dead space 3. When not gaming, it lasts like 5 to 6 hours. Although resolution is not high, the screen looks nice and sharp. It does not heat a lot, but may be uncomfortable putting it directly on your lap. The vents make a good job taking the heat out.The only things I did not like are the buttons, because they feel a bit cheap, but nonetheless they work properly, and the fact that there is no indication when charging the tablet, or that it has completed charging, when the tablet is turned off.Another thing, if you are planning on updating to windows 8.1, follow the guide found at razer website, in the support tab for the razer edge. There are some driver issues that need to be fixed before and after upgrading. Fortunately there is a good guide to do it.", "Date": "May 6, 2014"}, {"Title": "This is specifically for the i5 64 GB Razer Edge", "Author": "Tom", "ReviewID": "RT6U5LSJGMI1L", "Overall": "4.0", "Content": "There aren't many reviews on the i5 Razer edge, so I want to make sure that anyone who is interested in that tablet can see my review at[...]It runs AAA games only on low settings, and has some design flaws that I consider crucial.Thanks!", "Date": "April 25, 2014"}, {"Title": "Bought this tablet expecting to replace my laptop.", "Author": "Pearce", "ReviewID": "R2H3IJIML78KVL", "Overall": "2.0", "Content": "When I bought this tablet I was under the impression that Razer had all of the accessories on backorder. I went ahead and bought it thinking i could just pick the keyboard or docking station later, not a chance. While the website will say you can sign up to be notified when they have more available, if you talk to customer service they will tell you there are no plans to restock. Very disappointing.I had a fumble with an 8.1 update but was able to solve it myself with a friend who works in IT. But even after that the touch screen was clumsy at best.It was able to play most of my games pretty well but required a tangled mess of usb connections (thats why I wanted the dock or keyboard)It was also able to run 3d design programs but touch screens arent very helpful there.", "Date": "April 17, 2014"}, {"Title": "OS is good but the hardware could do with a stand or some supported peripherals", "Author": "TheMightybuda \"Mikey\"", "ReviewID": "R38KM2015F4ETY", "Overall": "4.0", "Content": "First off, let me say that the Pro is very powerful and runs everything that I want it to run.  I have played Diablo 3, XCOM and Star Craft and they have all performed as well as I hoped.  This is the portable gaming platform that you always wanted, for that I am grateful :-).The problems I have been having are around slightly flakey software and inability to find a decent stand.  Razer have some products on their site but these don't seem to be available (or indeed anytime soon).The WIndows 8.1 OS is great, simple to use once you get used to it.  I do find that need to use a trackball mouse though, especially for gaming.Overall very happy with this product.", "Date": "April 8, 2014"}, {"Title": "Absolutely Amazing Tablet so far..if not for Windows 8", "Author": "Kyzzer", "ReviewID": "R2M7SMBBRJFKJ7", "Overall": "4.0", "Content": "So I bought this tablet three days ago, and will update this review as time goes on.First let me say I bought this tablet with two purposes in mind, a mobile gaming station, and a versatile portable computer when I needed it.  It does both very very well (just change the power consumption settings when you need one or the other).  The CPU is amazing for a tablet, it has more ram than it knows what to do with and the independent GPU makes playing games completely painless.Second, let me talk about the sticking points, Window 8 is a disaster of an operating system, worse than Vista.  As a GUI its great, you can customize your start menu to be anything you use very often arranged how you want, and the old 'list of programs start menu' is a flick away from the new one.However, from there it all goes downhill:  Windows 8 and especially 8.1 is plagued with a myriad of bugs, constant freezing, updates that remove essential audio codecs, poorly optimized update software that will idle for hours only to reveal that it was never updating anything in the first place.  To put it simply: Windows 8 is very very pretty and has a functional and well made GUI (once you suffer through the learning curve), but its core functionality is lacking in so many respects it will make you weep.In summary:Pros:All of the hardware: Razer made a beast that could rival much more robust laptop PCsCons:The software (Windows 8 and 8.1 in particular): if I could have this tablet with Windows 7 it would be perfect.I will update with a more detailed review as time goes on...eventually windows will fix their OS, or I'll flip a table and just install 7 on it.", "Date": "April 5, 2014"}, {"Title": "The Razer Edge Pro.", "Author": "R. Carlson", "ReviewID": "R1OQ5UU3JLGW6W", "Overall": "4.0", "Content": "This thing is a beast. I've had it for a day, so these will be my first impressions. I will be updating once I get games installed. This is the overview of the tablet itself.Opening the box, it didn't seem like something a $1000 product would come in. A simple box, with no padding. Zero padding. It had a screen protector and it was in some plastic casing. Not much in it either. A quick start guide, two Razer stickers, the tablet, and the charger. Really underwhelming unboxing for $1000.The tablet itself feels very sturdy. The back is made of hard plastic, that feels good. It's not textured, but it's not a glossy material that gets sweaty and gross. It feels good. The screen is good, many people complain about the resolution, but it looks sharp to me. It's not blurry at all.The wireless, is a little spotty. I couldn't download things in my basement with my router upstairs because I was patching League of Legends at like 68 KBps. Next to my router I could download Battlefield 3 at 1.9 MBps. I don't know if it was the distance, or the interference between the router and my room.Programs installed very quickly. DirectX installed in under 2 minutes, I installed South Park and the Stick of Truth, in under 5 minutes. It seems fast. It never laggs just when navigating the desktop. It's very quick and responds well.The only problem I have now is that I cannot activate windows online. I have to call. It says that I need to connect to the internet (while downloading Battlefield, so im connected) but it just says wait to connect. I am going to call and activate today, but it seems like a hassle.EDIT: I am now shipping my Razer Edge back to Amazon. After about 2 weeks of solid use, I am getting random freezes. The entire system crashes and I must hard shutdown the entire system. I have done everything in my power. Every option Windows gives me, I have tried, and none of it works. I have traced the problem to what I believe to be a bad stick of RAM. The stick is obviously defective, and gets maxed out when performing simple tasks such as Facebook, or Youtube. I still haven't decided if I am going for a refund from Amazon, or a replacement from Razer. I like the system, but now is my only chance for the money back, and I don't think this is an $1100 experience. It works nicely, but it isn't necessary. When I can sit at the lunch table at school and play battlefield, you know theres power in this machine, but I think the heat from the system may be what caused the stick of RAM to go bad.", "Date": "April 3, 2014"}, {"Title": "Amazon is a little tricky", "Author": "sortiz1", "ReviewID": "R1BYSBOJSQPJCS", "Overall": "2.0", "Content": "This would have been an excellent product, if Amazon hadn't sent me a \"refurbished\" tablet. I ordered a \"new\" so imagine my surprise when I start setting it up and then another persons name, personal contacts, etc. pop up. Now my account will forever be melded with this other person. Managed to delete most of the other person's info, but I shouldn't have had to go through all of that in the first place. Amazon did offer to exchange this one for a \"new\" one, but seeing as how my account is already melded with this other person, there is not much that can be done to fix it now. However, it has run fantastically otherwise! Above and beyond expectations. :)", "Date": "April 2, 2014"}, {"Title": "Great!", "Author": "Caleb", "ReviewID": "R2NF4OO8XK0TUY", "Overall": "5.0", "Content": "Great device! Exactly what I expected, runs applications and games like a breeze! Careful though it can heat up pretty quickly during gaming.", "Date": "March 27, 2014"}, {"Title": "great tablet", "Author": "Neo2672", "ReviewID": "RYPEXA17FAA9C", "Overall": "5.0", "Content": "First of all I have to thank Amazon for the fast global shipping. I was waiting now for about 1 year, til it was possible, to get this great device. I really was jealous, that we in Germany weren't able to buy this tablet. But now everything is okay, Amazon made it possible,  thanks again.Now to you guys at Razer, you really did a good job, design this device. I hope there will be another Razer Edge in future, I really love this device. For me and I think many other fans, it is really a pity, that you stopped the Razer Edge and the accessories.For now I am happy, thumbs up!!!!!  Sorry for my English. Bye", "Date": "March 26, 2014"}, {"Title": "My best purchase ever.", "Author": "Gabriel", "ReviewID": "R1HA5F4E9Z4N06", "Overall": "5.0", "Content": "I can't describe how much I love my Razer Edge. It's just perfect, I take it with me everywhere and I can do everything with it. I'm sad that could only afford the 64gb but if it's that good, the best one must be like heaven.", "Date": "March 16, 2014"}, {"Title": "good, but with one problem", "Author": "Adenisio Hoffman", "ReviewID": "R2QGUZDBQ0YBA", "Overall": "4.0", "Content": "Razer does not sell the docking station anymore. And the battery does not stand for gaming hours without it. Other than that, is awesome", "Date": "March 15, 2014"}, {"Title": "the only thing keeping it from 5 star is the price", "Author": "mdwm", "ReviewID": "R1BFH6Y7LNPNYW", "Overall": "4.0", "Content": "this tablet will handle any game you throw at it.it is pricey but you simply cannot get anything even close to its power in a tablet formfactor.", "Date": "March 12, 2014"}, {"Title": "Disappointing!", "Author": "Howard", "ReviewID": "R1DE6R2LQXGVI6", "Overall": "2.0", "Content": "I bought the edge with the controller last october. It took a long time because I was traveling a lot. When I got it, there were many vital functions that are defective. The camera is not functioning normally, the wifi does not connect. The controller has poor feedback and trigger keys pretend they are being pressed all the time. I have contacted the razer support and there is no avail in fixing it. They were all hardware problems.I sent it back for service during early January and got to have it back at end of feburary.The machine was wiped, those problems are fixed but I found out the mic is still muffled and not recording well at all, and some other shoulder key on the controller is kinda stuck, the other trigger key is now registering below 38% when fully depressed.After almost half a year, this item with the bundle (edge, docking station, controller, external battery) and two times of transport shipping between continents have altogether cost me more than 2500USD now and this console is still experiencing problems.It has been a very disappointing experience considering razer had been doing hardware for quite some time now and these funcdamental problems are simply unacceptable.I do not know how to tackle the problem. Warrenty is going to run out before I can actually start using the machine! and all those expensive transport cost is tolling up so much. I was considering buying the keyboard dock however I have now lost confidence. I suggest you do not buy razer edge.Edited: (10 mar 2014) there is a wifi commection problem on and off again.,it will pretend it is not connecting correctly with a DNA server, tried flushing dns cache tried using google dns, tried reconnecting, restarting. the problem resolve itself after a repeated mixture of the mentioned attempts and someone 5 minutes sometime an hour, the problem will come back. the gamepad controller is also having sensitivity problems on the right trigger (always think it is pressed) and the right shoulder button as well.", "Date": "March 4, 2014"}, {"Title": "DoA or close to it (updated) 2nd delivery made my day", "Author": "Samuel Sundin", "ReviewID": "R2X8N2PKYV7AVM", "Overall": "5.0", "Content": "After much agonizing wait I finally got my Razer Edge Pro...sooooo happy.Looked very nice, started up nicely.Then the problem started the tablet felt very sluggish, when it came to performance, it went between turbo speed and snail speed both in metro mode and the desktop mode. The tablet felt very difficult to navigate in touch mode, I had to tap very hard sometimes and other time a slight nudge gave the same reaction.To make things worse it started to freeze until the point where I had no other option but turning it of with the start button.Once I did that I was monumentally screwed, it went into EFI Mode, where there seem to be no point of return, since I didn't even had the time to make a backup disk before it broke.So here I am with a very expensive and cooooool tablet that might not ever recover.To add even more problems I am based in the EU so only god knows I am able to get support and how long that support will take from Razer.I am cautiously optimistic that Razer/Amazon takes swift actions to solve this problem for me.UPDATE:Amazon reacted very fast and replaced the broken device with a new and working one.Now I very happy, it is an incredible piece of hardware, it over exceeded all my expectations.All I want now is to find the docking station directly with Amazon, instead of looking at ridiculous mark ups from some people trying to make a quick buck due to the very low stock.Thank you Amazon and thank you Razer.", "Date": "February 20, 2014"}, {"Title": "Thought it was great but!", "Author": "Dion J Johnson", "ReviewID": "R1DTNXAZV30QFE", "Overall": "3.0", "Content": "I had been looking for a windows tablet for months. I wanted something versatile to replace my work PC and can be used for gaming. Once I saw this and for the price I was happy, until. This thing has been a nightmare, right out the box the sound didn't work. So I had to figure out what was wrong. Got that fixed, then the video drivers weren't installed correctly, given me errors when I tried to launch the control panel. I fixed that. Now I can play my games,so far it's working ok, but  I get this annoying screen flicking and dimming. Haven't figure this out yet, but I certainly would buy one of these again.", "Date": "February 15, 2014"}, {"Title": "Awesome but not for everybody", "Author": "JBJ", "ReviewID": "RTKEHZ22M6DUX", "Overall": "5.0", "Content": "well this is a gaming laptop and definitely not for the average user, its raw power is awesome and everything opens in a snap. one downside is its heavy. To me battery life of 4hrs is not of a problem.", "Date": "February 9, 2014"}, {"Title": "WOW..all I can say", "Author": "Harley Smith", "ReviewID": "R1UAUS7T1E3H7Z", "Overall": "5.0", "Content": "this has been my new favorite device. my pc and laptop are getting jealous, but with the dock and wireless keyboard and mouse, I can play all my games on a 50 inch tv...", "Date": "February 5, 2014"}, {"Title": "best all in one system i can think of.", "Author": "jonan bahnsen", "ReviewID": "R7WE8EIK66QNA", "Overall": "5.0", "Content": "so far it has been a pleasure to work with the razer edge.im traveling a whole lot around. and was always frustrated with the limited uses of a standard tablet that always have limitations.with this i have everything around with me. i can set it up to the dock at home (the dock was out of stock when i purchased it. but it should be delivered one of these days)i can use it with a tiny bluetooth keyboard as a laptop.and it can be used as a tablet aswell.this has made me turn my old pc into a server.sold my other tablet.so now i only have this device.another thing that havent been mentioned enough at all. is the amazing size for reading comics. when in vertical this screen fits a comic book page perfect. and it just works so much better than other tablets i have tryed.the screen:people keep comparing this devices screen with ipad. and i was worried that the screen was unclear and would annoy me.when i ordered the product.well it doesnt the screen has a wide viewing angle. and people always asks me what type of screen it is as it is so clear.i know that on the paper this screen doesnt add up to the new tablets. but im more than happy with this.the battery time is also fine when you use it for browsing etc. i see this as a multi tool. ye you can get tablets smaller and thinner with better battery time. and you can get a desktop pc cheaper and better than this. but really this is the only device that can do everything for you.when i get the docking station i intend to buy an xbox controller and plug it to the razer and then i can set it up to the hotels tv for some assassins creed.uses:desktoplaptop.comic reader (fit for the pages)gaming laptopgaming consoltablet. .should i say something negative about this product: (wanna be fair)they set up a light sensor on the front to turn off the screen in case of it being pressed by accident. in the bag (to safe power) the problem is that when im sitting with it in vertical mode it feels natural to hold your hand above this point, which turns of the screen. also when in a dark room. sometimes it turns off since the tablet assumes its in a bag.i cant seem to find out where to turn this off. but this is rather frustrating.i hope razer have enough success with this product to release a new version.", "Date": "February 5, 2014"}, {"Title": "Tab", "Author": "Geek guy", "ReviewID": "R1QEZYX96OG6SE", "Overall": "4.0", "Content": "I bought this tablet for many reasons but the biggest was I wanted the fastest and best tablet in the market.  I hate Win8 but I can deal with that but at this point its sitting on my desk and I really do not use it very much.I loaded several games and connected a Bluetooth key and mouse and tried to play a few but I think you have to have the dock to make this work right.  Meaning I sit on the couch and just to play a average game requires that propping the device on my legs with the keyboard below it and the mouse on the side.So a dock is required since these games are not touch screen enabled.Overall I pleased with the power and speed.  But most likely will be another tech item that will on my desk with very little use.", "Date": "February 3, 2014"}, {"Title": "Great tablet with more than enough speed.", "Author": "Eric Husted", "ReviewID": "R2WERFAZ8TFOG9", "Overall": "4.0", "Content": "Great tablet overall but the accessories are overpriced and if you planned on using a stylus don't bother with this tablet.  Manufacturer says any stylus at a local electronics store will work.  I tried multiple types of stylus' and did not find one that would work for handwriting or drawing on this tablet.", "Date": "January 19, 2014"}, {"Title": "Excellent graphic in games as expected", "Author": "egemen gokdemir", "ReviewID": "R28NTYASIFAV34", "Overall": "5.0", "Content": "Excellent graphic performance in gamesVery Light when compared to laptopsFastWindows 8The bad side is battery charge time and i wish it had hdmi out directly on the machine (you have to buy dock unit to have hdmi out )on itself, but it is acceptable", "Date": "November 14, 2013"}, {"Title": "know what your buying", "Author": "cava99", "ReviewID": "R3HVGEUBG2X045", "Overall": "4.0", "Content": "when you look at the specs of this device you might say hold on i can get a laptop with better specs than thia .... and you would be right, but thats the point your not buying a lap top your buying a gaming tablet its unique and take it to a whole different level bringing gaming to handheld device.that being said, with something like this there are issues, the bettery will get you about 45 minutes of gaming and it can get hot. To get the most out of this device you need to get the game pad controller in which you can add an extra battery that boosts playing time to about 1hr and 45 minutes and the docking statoion which allows you to turn you tablet into a mdia station / mobile pcat the end of the day this is a pure luxury device if you really want value you for money you can get that else where, but if you want to be the envy of your friends take this out for a strol and whatch people drool!!!", "Date": "October 24, 2013"}, {"Title": "awesome", "Author": "richard hunter", "ReviewID": "REKHC6BDZ4V9G", "Overall": "5.0", "Content": "An awesome tablet , love be able to pplay games on the train into work, great graphics and sound buy it", "Date": "October 19, 2013"}, {"Title": "Great Tablet", "Author": "thomasc", "ReviewID": "R3CWL53MP17QZW", "Overall": "5.0", "Content": "Very powerful, not a single problem with it in a few months of use. cant wait for keyboard attachment. would definitely buy again.", "Date": "September 9, 2013"}, {"Title": "Gaming Everywhere", "Author": "Justin", "ReviewID": "R1K564PO1TMNOC", "Overall": "5.0", "Content": "I've had this tablet for a week now and i have gotten considerable use out of it. I have always been a gamer and now that I'm going to college this thing is the most useful gadget I have. I have to carry large load with me to be ready for various situations one of which was a very heavy laptop. the edge really cut the load down. This is especially true for my job where i have to climb a 70ft tall ladder regularly. so its nice to have a more than capable machine to use when i have some downtime, feel lazy, need quick info, or any of the other various reasons I've used this device. The downsides are that the battery life is weak on its own if you are hardcore gaming, but in today's world where are you not going to find a socket nearby? The power line is very portable so power is really a non issue. The actual big issue is the wifi. it is fairly weak, I haven't been able to pick up networks where my phone can. I countered this issue by installing games that work very well single player. Steam is very accommodating with its offline mode and all your games should work with little complaints. I've run SR3, Tomb Raider, Max Payne 3, and other intensive games at beautiful quality and speed. If you get this it is imperative you get one of two things. The first I recommend is the gamepad controller,it really completes the system. The second is to wait for the keyboard dock and buy a razer Orochi. If you are in the market for a portable powerhouse then the edge is for you.", "Date": "July 25, 2013"}, {"Title": "Blows Everyday Tasks Out of the Water!", "Author": "Alex Dembski", "ReviewID": "R1IORWXU7TIY4B", "Overall": "5.0", "Content": "While the Razer Edge Pro certainly looks more capable spec wise, the vanilla Edge gets the job done with ease. It has the same graphics card, less 1Gb of VRAM (Pro has 2Gb video RAM, this has 1Gb); 4Gb less Memory, which is a non-issue for most tasks including games like Borderlands 2 and other modern titles. Where this product is left wanting is it's disk space, but good news everyone, it can be opened up far more easily than 90% of tablets on the market, and both RAM and the SSD can be upgraded!!!Just search youtube for the how-to video.Instead of classifying this as a tablet I would call it a laptop replacement tablet, as most small handed, or weak wrist-ed people will struggle to hold it as they would an iPad for extended periods of time. You will likely end up wresting this on your lap at an angle . Speaking of angles the viewing angel is superb. It also weighs much less than it appears it would (equivalent weight to a Microsoft Surface Pro)The only issues I have had are with the on screen keyboard button, which is superbly laggy, and the fact that it does not ship with any sort of case and it is too big for the majority of tablet cases (I use a netbook soft case).As for the battery life, which is entirely comparable to the Surface Pro, I have not had much of an issue as these days we are rarely far from a wall plug or other suitable power source for 4 hours. Gaming on battery is a little short with roughly an hour and a half for most graphically intense games, but it is best to play plugged in as the default settings turn on active cooling and full GPU power only when the charger is connected.If you want a small, light, go anywhere, do anything PC this is something you should consider.Typed on my Razer Edge (this is why full size USB is nice to have).", "Date": "July 21, 2013"}, {"Title": "Great Device with Even More Potential", "Author": "Chris", "ReviewID": "R8USJSFR41XWT", "Overall": "4.0", "Content": "The Razer Edge Pro drops a hint at the future of the PC in our hands. I can prop it up on a stand and legitimately play modern PC games. It puts the four other devices I've used in the past few years (a Samsung Series 7 Slate, Asus Zenbook Prime Touch, Surface RT, iPad 3) to shame from a performance standpoint. Graphic-heavy PDFs load and scroll near instantly. Web video and sites load like you'd expect on proper desktop rig. But I can kick back in bed and scroll through those PDFs, pinching and flicking and tapping like you'd expect on a modern mobile device. It does everything and does just about all of it fairly-to-very well.It's an early step on the future of our computing devices. A powerful core CPU, GPU, and RAM with a simple built-in input method and screen, that you can use with additional input devices and outputs depending on the usage you need. Bigger screens, mouse and keyboard, external drives, web storage. A flexible, powerful, and modular computer.It's still an early step, though. Windows 8 is pretty excellent once you relearn a few fundamentals - it's adept at mouse/keyboard and a great tablet interface. The transitions aren't always seamless, but I expect to see that change pretty quickly. The Edge Pro's biggest problem is a reliance on the (completely unavailable) accessories. Some confusing design decisions make this more challenging. I'd planned on using the Edge with a Bluetooth keyboard and mouse for regular use, sometimes connected to an external monitor. I'm locked out of that scenario without the Dock, as it doesn't have HDMI out built in (my Samsung Slate did, so a net loss there). It has only a dock/power supply connector on the bottom (rather than a secondary power-only port on the side like the Samsung) - without the dock, this means I have to balance it awkwardly on the protruding power cord to prop it up. One quirk that doesn't involve the accessories - for some reason the capacitive touch sensor is tuned or only capable of recognizing \"wide\" touches - that means fingertips don't register well (particularly for swipe-in-from-bezel gestures), while it's perfectly responsive to the pad of your finger. Other touch devices recognize fingertips, so it can be jarring and give an impression of being unresponsive. Easy to adapt to, but a slight annoyance. I'd consider selling it and getting a second generation version in a year or two if these things were shored up (or accessories are more available). The reliance on accessories are what keep it at three stars instead of four.All that aside, I can still flick through a massive PDF while reclining with it (that other devices - particularly the Surface RT and iPad - will choke on), then wander across the room, prop it up (albeit awkwardly), and run WoW on high at around 60 FPS, get a few rounds of Hawken or MechWarrior: Online in (high or medium, respectively), or play some Deus Ex: Human Revolution (at low settings). It's about the most versatile computing device out there.Update: I've now been able to get ahold of a docking station and have some time to use it. I've amended my review from three to four stars as the tablet becomes *vastly* more flexible using the dock. Skyrim (at medium, 40+fps) and WoW (high, 50+fps) work well on a second monitor at 1280x1024 (or slightly less, like 1280x900). Doing work and light web surfing remain blazing fast. It's close to five stars, but I'd still like to see a few improvements in future generations:- The odd touch tuning (\"ignoring\" or not registering fingertips)- The wifi - not only is it not capable of 5ghz, it's a bit weak. I was able to connect to an iffy network while on vacation with my Surface RT, but the Edge needed to be about 30 feet closer (to a 2.4ghz G network).Overall, a very high quality computer and massively flexible! I really love this device.", "Date": "June 2, 2013"}, {"Title": "Really do love my Razer Edge Pro", "Author": "Ryan Mckenney", "ReviewID": "R2EGM07F5RR3JJ", "Overall": "5.0", "Content": "I honestly love this tablet. Especially with the controller add on and headphones games become oddly immersive. I have played more games with this tablet than I would have otherwise because it just gives me more opportunity to play games due to it's form factor and portability. Currently I am using it just as a gaming system but it is Windows 8 and clearly runs very well.For games that do not have native controller support do a web search for game controller software and you will find some software that flawlessly replicates keyboard strokes with the controller. You can even use a controller to move the mouse around, right click, left click, anything to do with the keyboard and mouse via the controller. Ultimately, most games only use a limited set of buttons. This will work for a nearly all games out there without native controller support.The screen resolution does not bother me too much, though a higher res would be welcome. The performance in game is decent. You may have to lower quality a bit on some more intensive games but none are what I would describe as unplayable. Mostly you are just missing out on some advanced lighting effects. I do not really have any major complaints in the graphics department, especially for the tablet form factor.Size and weight are good. Not perfect but I have had no issue with it especially propping it up on my lap, etc. Holding it straight up will get a little tiring especially with the controller attachment. The controller attachment is a bit large. Would be better if it could split or fold in half somehow. It is the only thing that gets the offical \"pretty bulky\" complaint but have found it to be the most enjoyable way of gaming on the Razer Edge Pro.Battery life with the standard battery is pretty dismal. Most times I just leave it plugged in while playing. With headphones, full brightness, and an advanced game it can drain in around an hour. If you are just using this as a tablet things improve but your mileage will vary. To be fair however, any device that does intense 3D gaming will have pretty terrible battery life so overall, this is not shocking. The only annoyance is the plug is on the bottom and if you are sitting with the tablet on your lap it can sometimes unplug. The unit definitely does get hot but it has adequate venting and cooling fans that are not annoying.The TV output and 5.1 audio output worked perfectly with the dock. It is a nice addon but most of the time I just use it as a handheld tablet with the controller attachment.", "Date": "May 30, 2013"}, {"Title": "Your only choice for tablet PC gaming", "Author": "Brian", "ReviewID": "R2HZ7XXLGRILI4", "Overall": "5.0", "Content": "I created a full review on youtube:http://www.youtube.com/watch?v=gWph83okaPsWindows 8 has been good once you get used to it. I installed \"classic shell\" to get my desktop / start menu from Win7 back.", "Date": "May 18, 2013"}, {"Title": "Great portable gaming device, lots of crashes", "Author": "J. J. \"filmmaker\"", "ReviewID": "R2H52U1PWJF6M2", "Overall": "3.0", "Content": "I guess it's more of a Windows thing, but considering that this company makes only 2 models of this tablet, you'd think they would know exactly which drivers and windows components are supposed to work. Mine has a BSOD almost every day, especially with the dock, it often shows memory warnings when trying to run even older games. Upgrading to Win8.1 was very difficult, far beyond what any consumer should be required to do for a simple OS update.Although their screenshot shows Civ5 (which is a great game for a windows tablet BTW) it actually barely runs, not because the tablet is not powerful enough, but because of weird memory or driver issues. The game only runs on Directx 9, not on the Directx10/11 option, or even the tablet mode option. These are all problems that you'll probably find across any windows device, especially if you're used to an iPad or Mac, so 100% of the blame can't be on Razer, but they should do some sort of testing to keep these problems to a minimum. My wife downloaded Civ5 on her lower spec mac (intel graphics) and has had 0 problems with it.On the good side, it has decent performance and runs most modern games at high res and quality. It's portable so you can take it with you on trips and have a great gaming experience without the size of a laptop. The docking station is where it really shines for me though. I have it hooked up to a projector and with a wireless mouse/keyboard I get a pretty awesome big screen media/game experience on a device I can just undock and continue the game elsewhere.Battery is really bad, but considering the performance I don't mind too much. The weight is a bit heavy, so you'll need to rest it on your lap or have a case that it can stand up with. I would also recommend going to the Pro model if you can afford it. The extra bit of performance and extra HD space will probably be worth it.", "Date": "January 8, 2014"}, {"Title": "Badly made gadgets and no word for UK!", "Author": "Joshua Pickett", "ReviewID": "R344V8KB3HLTZY", "Overall": "1.0", "Content": "Really Really disappointed that the Razer Edge isn't even available in the UK yet, at least give a word of when the release is! I know 3 other people that have alone saved up for the Edge, and are eagerly awaiting for the UK release!I have also managed to get a quick go on the Edge and am very annoyed that Razer charge an extortionate amount of money for the tacky, cheapy gadgets! Most of which seemed to fall apart, especially the buttons on the controller extension!I seriously suggest that Razer look at the Edge reviews on Youtube and take notes of all the major downfalls of the products, mostly the controller attachment!I can live with the £800 price tag, since it is just paying for a top of the line PC, BUT! The gadgets that come separately ARE badly made and not worth the money! I will happily pay that hefty price for the gadgets if they were made for a long term and reliable use!", "Date": "August 28, 2013"}, {"Title": "RAZOR Please Read!", "Author": "Ayman", "ReviewID": "R861T9A34HUOL", "Overall": "5.0", "Content": "Hello,I own a YouTube gaming channel, I recently started it and would love to use a Razor edge to review games and do walkthroughs. At the moment I can't afford as I have invested in too many other things, but it would really help Razor out as it would give more exposure to this great product. I would spend a year just doing gaming vids on the razor! E-mail me at ayman.kiani@yahoo.com", "Date": "August 9, 2013"}, {"Title": "Product ke6", "Author": "gerald", "ReviewID": "RPL2P8VXDUMF", "Overall": "1.0", "Content": "Lovely design,but horrible anti-user friendly experience compared to AppleI am 47 and my eyesight has gone down..and this thing is asking me to enter a product key with the smallest characters you have ever seenPure torture so farGonna have to use a magnifying glassTerrible experience", "Date": "May 18, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Windows 8, 10.1 inches Display\nIntel Core i7-3517U 1.9 GHz (4 MB Cache)\n256 GB Flash Memory, 8 GB RAM Memory\n3.20 pounds", "Name": "Razer Edge Pro 256GB Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/41CzjhTtN-L._SX300_.jpg", "ProductID": "B00BIFX5JE"}}