{"Reviews": [{"Author": "Jlow252", "ReviewID": "R2VCDIHCCR7ZFV", "Overall": "5.0", "Content": "I bought this tablet for my dad because I couldn't afford an iPad.  The screen size of this 9\" tablet is HUGE.  The 9\" screen enables movies to look great like a widescreen TV.  I constantly get reminded from my Dad about how he enjoys the tablet.  He uses it for surfing the internet, taking pictures, playing games, and even creating word documents.  He loves the ability to be able to print directly to his printer from the device.  Overall, this is a great product at an unbelievable price! Definitely recommended.", "Title": "Great Tablet - Amazing Price !!", "Date": "June 24, 2013"}, {"Author": "Robbert Williams", "ReviewID": "R12KILJT8K77QV", "Overall": "4.0", "Content": "I got this tablet on not expecting much considering my experience with no name brands tablets is not that good. well its only been a few days and i have fully customized it to like an ipad using differenct apps from the play store. I had a 7\" tablet i got from Fry's a while back and it was unstable that is would frequently force close apps. This one has been rock solid. Its runs ICS and its hasn't crashed once yet. Very impressive. The ony bad thing is the resolution is not that good but i don't mind afterall. And when I show it to my kids they love it. Its plays all the games no problem. Its play temple run and angry birds. allo them. Very happy camper so far. So for an extra $25 but you can get a 9\" tablet that is much more stable than the cheaper 7\" tablets out there.", "Title": "nice tablet for price", "Date": "April 11, 2013"}, {"Author": "Thomas Moore", "ReviewID": "R3QD6PSTIHH64V", "Overall": "5.0", "Content": "I got this tablet cause i wanted something very basic that i can give to my son. He constantly battles for the galaxy tab that we have and I just wanted something that he could use as secondary machine. Im very familiar with the Android on my Galxay tab and thought this woudn't be much different. So after using this for some time, I can safetly say without a doubt this tablet gives 90% of the same experience at the galaxy tab minus some resolution at 800x480. Its sounds bad but actually its works on this 9\" tablet. But more important is that fact that is hasn't force closed once yet. So its very stable and for that alone I give it 5 stars", "Title": "good tablet for the price", "Date": "April 25, 2013"}, {"Author": "Taylor Eichelberger", "ReviewID": "R2IE748HOCDC01", "Overall": "3.0", "Content": "I would give this a rating of somewhere between a 3 and a 4.  It would be a good product from children (which most reviews say).  It will be fine for my first tablet while I'm broke, but I want better.", "Title": "Somewhat slow and poor resolution", "Date": "July 11, 2013"}, {"Author": "Marshell R. Bass", "ReviewID": "R1Z5XQ6R8BYP80", "Overall": "4.0", "Content": "I am able to download games and apps that I couldn't place on my phone simultaneously. Works great with Wifi.", "Title": "Great for Price", "Date": "May 27, 2013"}, {"Author": "SCPrincess", "ReviewID": "R1B5PGJGPY1XSB", "Overall": "4.0", "Content": "Just like the headline says, wonderful tablet for the money! It's not an iPad, but with the price that I paid, it is definitely worth every penny. It is fast, great size screen, touch is excellent on it. The only complaint (hence the 4 stars instead of 5), is that it doesn't stay connected all the time to my WiFi. Sometimes, when powering off, I have to manually connect again, even though I have opted to have the system save my connection. Other than this, I love it!", "Title": "Wonderful tablet for the money!", "Date": "June 6, 2013"}, {"Author": "Chandler", "ReviewID": "ROAGHV88VYF7Y", "Overall": "5.0", "Content": "I've been playing with this tablet on and off for a few months and have to admit it is very impressive.  It's as fast as my mac or kindle fire or ipad.I find the keyboard easy to work with and it is intuitive to use....to get on the internet just find your network and go.One glitch which is the only one  I have found is that as I type this it has underlined almost all words in red as being misspelled.  I will look on the settings and ensure I have the right language set. What is great though is that I can keep typing without capitalzing and it does that for me automatically, as well as adding apostrophes to abbreviated words.It turns off power automatically if you stop using it but saves what you are working on.Easy to stash in your purse, use for travel or use for reading. Also an affordable option for kids to use for homework research.It works fantastic and I appreciate getting to try it out in order to provide this feedback", "Title": "A great tablet at an affordable price....quick web surfing", "Date": "July 6, 2013"}, {"Author": "Ibrahim \"Ibrahim\"", "ReviewID": "R192CQZ76KKFHH", "Overall": "5.0", "Content": "I purchased three iBelite for my kids and another one for my niece. I only were able to do that because of the good price. The image, the sound are not as good as the high end tablets but they are great for the price. The battery life and the charging time are good. The Wi Fi is very fast and the tablet doesn't freeze.", "Title": "Good for the price", "Date": "August 11, 2013"}, {"Author": "Hawa Waggeh", "ReviewID": "R3FA5WBR8FLZA8", "Overall": "1.0", "Content": "I just got this tablet and it crash when you try to surf on the Internet the touch screen is just horrible you have to press the screen like 3 times I bought this tablet for my son but he won't even use it don't waist your time even though the 9inch screen is a really good size", "Title": "not a good product", "Date": "July 22, 2013"}, {"Author": "T. Morris \"T. Morris\"", "ReviewID": "R360PQB3907NUX", "Overall": "3.0", "Content": "This tablet was slow from day 1.  I did not like it.  I had a 7\" table that was better than this one.", "Title": "Not Happy", "Date": "November 16, 2013"}, {"Author": "eleazar montilla venezuela", "ReviewID": "RZ4SJT7RR1AFM", "Overall": "5.0", "Content": "recommend this table to anyone who wants to have fun or want to work is very functional, does all the work required and in spite of the price is of good quality and very well functional and do the job they were DEMANDS so if treated as any table that avoid dislodging or flatten that to get the rest there super good recommend from Venezuela and are excellent table", "Title": "excellent product", "Date": "October 19, 2013"}, {"Author": "firstlight", "ReviewID": "R3BG3IARZQEWXQ", "Overall": "3.0", "Content": "be careful because isslow, even for my mom. is better to gather some dollars more and buy something else. can not return because send it outside us.just for letting you now", "Title": "is just basic", "Date": "August 23, 2013"}, {"Author": "brandon", "ReviewID": "R235BYUHNNOS1Q", "Overall": "4.0", "Content": "first of this thing is huge! bigger then the HD Kindle and the ipad. Its a solid 9 inches. This thing is not the best one out there but for just browsing the internet and watching netflix and such this thing rocks! never had anything crash. A little laggy at times but you get used to it. Def would buy this again", "Title": "decent tablet", "Date": "May 19, 2013"}, {"Author": "DothanSAHM", "ReviewID": "R1G6QU7JEX5LKE", "Overall": "4.0", "Content": "I bought this for my 6 year old daughter who wanted to be able to play on \"her\" tablet like her big brother.  It is perfect for that.  Wouldn't choose it for me though.", "Title": "Great for kids tablet", "Date": "June 22, 2013"}, {"Author": "Watchguy", "ReviewID": "R2VFMSCUW4DR3V", "Overall": "1.0", "Content": "Very low quality tablet. I know it's cheap, but it's still not worth the money I paid for it. Had to send back.", "Title": "Dead after one week", "Date": "May 13, 2014"}, {"Author": "Juan Garcia", "ReviewID": "R3ZKJL9D99FWD", "Overall": "2.0", "Content": "The camara sucks, browsing is horrible it freezes every minute on the web. I had known I wouldnt have bought this tablet.", "Title": "if I had known I would not have bought this tablet.", "Date": "January 18, 2014"}, {"Author": "Wethr Kenna", "ReviewID": "R2AII6HXI8MWPJ", "Overall": "4.0", "Content": "I purchase this as a birthday gift for a friend and he seems very pleased with it.  Very good product.", "Title": "Very good", "Date": "January 18, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2FNMH9IZSLS0Q", "Overall": "5.0", "Content": "I am very pleased with this Android Tablet.  I had a smaller android \"7\" but had difficulty reading the keyboard.  The new one is great.  I am having a good time using it and learning all of the tricks.  I am a new tablet user.jrroadrunner", "Title": "IB Elite 9 inch Capacitive Allwinner A13 1.3GHz Tablet Android 4.0... iB", "Date": "January 7, 2014"}, {"Author": "Eric", "ReviewID": "R3QN5VMED349Q6", "Overall": "4.0", "Content": "I like the table except for the fact that there isn't a camera on the front - only on the back to take selfies.  Other than that, it's a great product that can do seemingly anything.", "Title": "Great product except for not having camera on the front.", "Date": "December 4, 2013"}, {"Author": "Jim Bailey", "ReviewID": "R3I9PWWN204YA4", "Overall": "4.0", "Content": "IB Elite 9 inch Capacitive Allwinner A13 1.3GHz Tablet Android 4.0.It is worth the price I paid. Apps and WIFI work great!OK, this is not the greatest tablet, but if you are not sure you want to invest $300 in a tablet?Check this out.  If you really like the tablet experience this gives you, you can always upgrade to a brighter, faster, bigger, fancier tab.", "Title": "IB Elite 9 inch Capacitive Allwinner A13", "Date": "November 22, 2013"}, {"Author": "silverwolf", "ReviewID": "R25VK4TBITOE68", "Overall": "5.0", "Content": "This is my first tablet. I looked at several tablets and this one had the right price for my needs and it works perfectly. I am doing work for my church and this little tablet can go with me and does the job. With Amazon I can purchase with confidence. I am truly enjoying the IB Elite.", "Title": "Perfect for my needs", "Date": "October 12, 2013"}, {"Author": "RUDAYNA", "ReviewID": "R18RCG8YTAE2NQ", "Overall": "4.0", "Content": "6 year old is loving it. Slow for myself but works good enough for my six year old. Pleased with item.", "Title": "Pleased with item.", "Date": "October 11, 2013"}, {"Author": "lauren", "ReviewID": "R2B84HVZWLGNGN", "Overall": "4.0", "Content": "Paid around 70 bucks. More than I expected. It is rather buggy but it gets the job done for updating my calendar. Words with friends often force closes if that shows what its capable of at all.", "Title": "Cheap Tablet.", "Date": "September 10, 2013"}, {"Author": "Scott miller.....", "ReviewID": "R160DIPM7L1MI2", "Overall": "5.0", "Content": "i like this tablet. I only had it for i week so far so good.my kids and i use it all the time", "Title": "hey", "Date": "August 17, 2013"}, {"Author": "traveler", "ReviewID": "R2L0L0FAVZ0RZ3", "Overall": "4.0", "Content": "I really like the looks of this tablet and so far works like a charm.  I have had it less than a week so I cannot say anything about longevity, but it seems as though it is made well.  The only thing I have noticed so far is that it is slow.  It is for my husband who is totally computer illiterate so he probably won't even notice!", "Title": "So far so good.", "Date": "August 16, 2013"}, {"Author": "rarajoy", "ReviewID": "R323K74DYWV1ML", "Overall": "3.0", "Content": "This product is definitely a generic brand tablet. I cannot get it connected to my comp at all! I searched as many \"geek\" websites as possible & they all said to go to the manufacturer's website. I did but the website is all in Spanish & not user friendly at all. I sent a message to the email address on the site & it was returned to me saying not a valid address. It also is very slow. I added a 16gb card & it helped only a little.However, I do like the large screen for watching Netflix & YouTube videos. My kids (7 & 4) use it as often as I do & they love that the buttons appear larger.", "Title": "OK for basic functions", "Date": "August 12, 2013"}, {"Author": "customer", "ReviewID": "RUDKOPC5KN3SU", "Overall": "3.0", "Content": "Good so far.. Where is front camera? Description said front camera, I only have rear facing camera. Pretty disappointed with that but I guess for $79 on amazon u get what u pay for...", "Title": "It's ok", "Date": "August 5, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2Y1WBEQTZQH3K", "Overall": "4.0", "Content": "This little tablet works just great for what I want to do with it.  I can get online easily, check all my emails and news services.  I downloaded the Kindle app to read my books.  I have a couple of simple game apps, and I have evernote for keeping my recipes.  I would certainly consider this tablet if you are looking for an economical alternative.", "Title": "Very good value", "Date": "August 5, 2013"}, {"Author": "tom", "ReviewID": "R18288OFLEV87C", "Overall": "5.0", "Content": "this is a good product for the price my wife and I love it I would recommend this productI will buy another one for my grandaughter", "Title": "great product", "Date": "August 5, 2013"}, {"Author": "Sandra A. Washington", "ReviewID": "RJ2EZPRO5F2IH", "Overall": "4.0", "Content": "purchased tablet for my 15yr old grandson, who has all the other tech stuff but a tablet.  He is very happy with it.  I loaded some educational apps, word games etc, and some free books I thought he would like and some I thought he should read.  We will discuss and review the books together.  this tablet will make a great gift for any kid or adult. easy to use, good size. has everything you'll need.", "Title": "good gift", "Date": "August 4, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00BU9YJ7A", "Features": null, "ImgURL": null, "Name": null}}