{"Reviews": [{"Author": "shannen gordon", "ReviewID": "R865X5B5KBVW6", "Overall": "3.0", "Content": "This is my first tablet and I received it as a gift. I'm excited just to have one, but also a little disappointed with its performance. The tablet carries out its basic functions ok but it's speed and response are lacking. Browser speed is fine but could be faster. I've had some issues with applications freezing and crashing. The camera was non-responsive the first time I tried to use it and I often have to tap the screen multiple times to get it to carry out a command. Music plays well but sound can get muffled because the speaker is small and located at the back of the tablet. I'm hoping it's just a defect and that I can send it in and have it replaced with a better-functioning one. But overall, it's just an ok tablet.", "Title": "It's OK so far..", "Date": "December 30, 2013"}, {"Author": "Lawrence Jones", "ReviewID": "RSA9LNB0311ID", "Overall": "1.0", "Content": "Wasn't satisfied how slow it takes to connect to program not much space for downloads.. I would like an refund product sucks!", "Title": "Not satisfied with merchandise", "Date": "December 30, 2013"}, {"Author": "Keisha Manning", "ReviewID": "R1FMHOKYIUZ5H9", "Overall": "1.0", "Content": "I got this tablet for my daughter for christmas.  when she opened it up and tried to charge it, the charging port in the tablet does not work!  i tried calling customer service 3 days in a row and no one answered the phone!  i hope they will contact me before the 90 day warranty is up!  I dont know if this is a good tablet or not!  what a waste of money!", "Title": "Terrible Customer service!", "Date": "December 30, 2013"}, {"Author": "Mindy9877", "ReviewID": "R2COYZ3SKTAQA4", "Overall": "5.0", "Content": "I was looking for a tablet for my kids to use and I came across this one.  The information given is what I was looking for.  When it came there was still a charge to it and so I checked it out to make sure it works.  It works with no problem.  I added the Accident Insurance to be on the safe side (we know kids) which I didn't know they sold this also.  Yeah!  So far so good.  There is no glitches or sudden turn offs.  Plain and simple is what I was looking for and this is it.  Easy to download apps but it can take some time to open certain sites (that's okay).  Results:  Kids Happy", "Title": "Happy Results", "Date": "December 29, 2013"}, {"Author": "Nicole", "ReviewID": "R2LYC1NCHYZ182", "Overall": "1.0", "Content": "I ordered this tablet from my mother intending it to be a birthday present. She was overjoyed to have received this great gift. We tried to turn the tablet on and it wouldn't work. We assumed it was just dead, so we plugged it in and she left it over night. The next day she called and let me know that it still would not turn on. She tried other outlets in the house and it still would not work. I contact Amazon to get the item replaced and they informed me that they would not exchange the item because it's an electronic gadget. That is the most ridiculous thing I have ever heard. So I cannot give this item an actual review. I can only warn you to buy your electronics in a store where you can actually exchange them when something is defective. I will never buy electronics from Amazon again.", "Title": "Amazon Has The Worst Customer Service Ever!", "Date": "December 27, 2013"}, {"Author": "geo", "ReviewID": "RZTO6I03VV2Q9", "Overall": "5.0", "Content": "i thought this would be great for the kids. but i can't give it to them. i'll get them another egs004 in a different color. i'm keeping this one for me! its light, slem and powerful. not as slow as others have said. this my first android os. its nice and easy. the back facing video camera will be nice when i figur out skipe.  can't beat the price eather... baybe i'll get a 10 inch instead. thanks amazon!!", "Title": "wow, this is cool amazon!", "Date": "August 5, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3I8XU9K6Y1YQC", "Overall": "2.0", "Content": "SLOW. I'm 76. I don't move very fast anymore, but even sitting next to a router this device is slower than I am.", "Title": "It works just like I do.", "Date": "August 15, 2013"}, {"Author": "Brenda Perry", "ReviewID": "R2Q6BCX2FOOJ1X", "Overall": "5.0", "Content": "works well, and good for a kid without spending a lot of moneywith the risks that go along with kids. Kids will be kids and things happen", "Title": "works well", "Date": "November 24, 2013"}, {"Author": "Hard nut to crack", "ReviewID": "R26JCJR5KFKAK6", "Overall": "4.0", "Content": "this item is working as it should and is making my children happy. that is what matters so Im happy", "Title": "its working", "Date": "September 5, 2013"}, {"Author": "Philip E Gerber", "ReviewID": "R37MT7ZILKROG5", "Overall": "5.0", "Content": "I was surprised to see all of the features on this economical tablet.  It has many of the same features of the more expensive tablets at a very affordable price.  Very little lag time and games work well it.  My wife is addicted to Candy Crush Saga, so she is getting quite a bit of use from this tablet.  I would recommend this tablet to everyone.  Very satisfied.", "Title": "Excellent Tablet for a low price!", "Date": "August 23, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00BMJJ89M", "Features": null, "ImgURL": null, "Name": null}}