{"Reviews": [{"Title": "For the price, Asus hits the sweet spot. Great budget tablet.", "Author": "Max Harry Johnson", "ReviewID": "R2BM3WVXR7V5GJ", "Overall": "4.0", "Content": "This is a very good tablet that come with a lot of useful features. The only main weak point is the screen resolution which is slightly outdated for 10\" devices today, but its acceptable. The unit I had have some minor issues with the digitizer (touchscreen), but it was an isolated issue and I don't believe many others should experience it.As of writing, I can not think of another device that come with all its feature at its price point:-Tegra3 quadcore CPU-standard microUSB charging port (not proprietary like the Transformer tablets)-dedicated microHDMI port (TV connectivity)-USB On-the-Go support out of the box (using a separate microUSB OTG adaptor you can connect things such as mouse, keyboard, flash drives and gamepads)-microSD card expansion-acceptable HD IPS screen-great WiFi and GPS performance-other little things like stereo speakers, front and back cameraBuild: Two things I really like, first it have an even weight distribution and feel light for a 10\" tablet. Secondly, it doesn't have heat issues. The tablet doesn't get hot at all, at most it might get warm, this can be a big deal in term of using the device comfortably for lengthy periods. It has a plastic body, but doesn't feel like it would fall apart. Though if you try to twist it or put pressure on the screen you can feel slight flexing. I definitely will get a case and screen protector for this. Just hoping the microUSB charging port would last since I feel it's not as firm as it could be, but this is just feeling about microUSB ports.Performance: Sure the 1.2ghz quadcore Tegra3 CPU provided isn't latest spec anymore, but it still fast enough and can perform all activities with few stutters. You will be able to browse the web and watch 1080p videos smoothly. Gaming should be a good experience as well. I still think Asus can optimize their OS better, it is not as smooth comparing to full stock Android found in Nexus devices of course. You can expect the battery to last the whole day on a full charge.Screen: Images and videos look great with decent viewing angle. For me the colors are just right, its not saturated so it won't be popping. If you are someone who is used to overly saturated colors this screen might look washed out to your eyes. Very small texts will not be smooth looking, its mainly due to the 1280x800 resolution on a large 10\" screen. If you required sharp and clear texts and do a lot of reading, its better to buy a tablet with higher resolution. The screen is not protected by Gorilla glass so be careful with it and use screen protector. The touchscreen is extremely sensitive.Speakers: It's nice they're stereo, they have a slight muffled or warm sound to it, but are decent and doesn't suffer from crackle even at high volumes. One particularly annoying thing is the sound from the speakers cause vibration to the back of the device (made of plastic) and can tickle your palm when you're holding the device. The remedy for this is simply to hold the device on its edges. Also, this device do not have a vibrating module.Storage: You'll get a total of 11.7GB of actual storage space in addition to the a microSD slot. It doesn't take long to copy several gigabytes of data to the device and installing apps is fast. Running a benchmark program, I get a write speed of around 10-12MB/sec and a read speed up to 36MB/sec.WiFi/GPS: I'm impressed with the WiFi signal and the download speed is fast. It appear to support both GPS and GLONASS and gets strong signal.Cameras: They're average, you'll need good lightning to take good photos. It come with front camera/microphone as well, so you can do VoIP and video chats.Important info about the digitizer (touchscreen): There might be a minor issues with inconsistent digitizer reading for this device, but its probably just the unit that I got. At times it doesn't detect 'tap-and-hold' and 'pinch-to-zoom' anymore. Also 'long gestures' can get choppy. For example, if I set a lockscreen pattern, sometimes it can be difficult to successfully draw out the full unlock pattern because the screen cannot connect your finger from point to point, it gets cut mid way and I get locked out of the device. These small issues pop up occasionally and spontaneously. I find that to help improve this issue, go to Settings -> Accessibility -> select 'Touch & hold delay' ​-> change the setting to either \"Medium\". This will help greatly, but it doesn't cure the problem completely. Again this is most likely an isolated issue with just my unit.So far I'm very happy with the features being offered at its price point, except the issue with unstable digitizer. It's a good tablet to get if you are on a budget, but wants something with plenty of features.", "Date": "March 15, 2013"}, {"Title": "ASUS MeMo Pad. High End At A Good Price.", "Author": "Marc Klein", "ReviewID": "R8K7MHRAX96EU", "Overall": "4.0", "Content": "The ASUS MeMo Pad is basically the Transformer Pad without the docking pins only better and while my 1st ASUS was the Asus Nexus 7 1B32 7-Inch 32 GB Tablet comparing it to would not be fair as that was done according to Google's specifications. What I can tell you is that this trumps that and here's why:1)Dual SpeakersMost tablets have one speaker and thus you get Mono sound but with this you get two which provides stereo surrounding sound which, in my opinion sounds excellent and in some cases you can hear the vibration. I do think that the speakers were put in the wrong place but I think ASUS designed it with the theory that people will use landscape mode which if you look  I think you'll understand why it makes sense.2)CameraI'm pretty sure no one walks out with a tablet and thinking they would use the camera instead of the ones on their phones. I've used it when I had an iPad but it's rare that I do it. Regardless, I have yet to test the camera so I can't really comment on it but there's no flash in the back so be warned. There's a front and a back so that's a plus if you want to use Facetime. The back is 5 MP while the front is 1.23)AppsThere's little to no bloatware anywhere on the device. ASUS put some of their stuff on here and it's touch and go on whether or not you find a need for it, They do give you free cloud storage out of the box (They give you 5GB for free) so that's a plus. I use Dropbox which for me is just as good. But the one thing I do like is that ASUS has a software called backup which essentially is it'll store all your apps if you ever need to reset the device. How this differs from Google Play is something I don't know as I have yet to have a need for this. Basically, ASUS tried to cover their bases on what their customers felt they would need or want.4)Design  It is very light I will say that. Very thin around the edges and easy to hold. I can tell you that the back doesn't feel cheap or plastic. But it also doesn't slide when you hold it. Actually, it's an easy grip and not so much of a fingerprint magnet. Although for me, my arms began to hurt after awhile but that may have been because of the position I was in.5)FeaturesHere's where the meat and potatoes lie. It's what you decide on when deciding on purchasing it or not so here we go: It is Jellybean out of the box but once you get through the initial setup, there's an update to 4.1 and that is current on the tablet. Whether it gets 4.2 and up is to early to say but ASUS is very good with updates across their devices.It has the usual:WiFiGPSBluetooth  And in a first, ASUS finally ditched proprietary and replaced it with a micro USB which is way better and this is what I prefer.. While it only has 16GB, there's an expendable slot for an SD card. Any SD card will do folks. Also, you'll be happy to know that ASUS also included a port for HDMI right next to the USB one.Some complain there's no flash on here but that has nothing to do with ASUS or Google. Adobe no longer supports it and it's been replaced with HTML 5. Though, feel free to side load it if you want.It also comes with NVIDIA TEGRA 3 Quad Core which is very powerful especially if you play a lot of games. When I played Beach Buggy Blitz the water effects splashed onto my screen like 3D. That is the power of this chip and it's as real as you are gonna get.This tablet is the real deal folks. The price is very reasonable with what's inside. I've seen tablets with these same exact specs priced higher so at $299 this is practically a steal. Plus it has everything a user wants. The only thing missing is NFC but to me this isn't really a deal breaker nor should it be.Some might complain that it has no dock pins for the keyboard and honestly, if I wanted a laptop I'd have gotten one. But also remember that in order to keep costs low, sacrifices need to be made and since this isn't in the Transformer family, ASUS felt that it was not that important to keep. While it would have been cool, if it really is important to you, you can always buy a folio in it's place.Available in Midnight Blue, Crystal White and Fuchsia Pink,  ASUS has put out a winner and after spending a little over a week with this baby, I say if you're looking for a tablet look no further.", "Date": "March 19, 2013"}, {"Title": "A (pretty) great value", "Author": "Amazon Customer", "ReviewID": "R3MOTCO1JYROD6", "Overall": "4.0", "Content": "I'm very pleased with the quality and performance of this product, but it has taken some time to get used to the the tablet \"form factor\" and the quirks of the Android operating system. This review will touch on those issues as well as my impressions of the Asus MeMo Pad Smart 10 itself.Screen Resolution. For some reason most tablet reviews start with the screen resolution. The Asus Memo 10 has 1280 x 800 pixels versus the Nexus 10's 2560 x 1600 and the iPad4's 2048 x 1536.  Perhaps the greater resolution on the Nexus and iPad4 does have some benefits, but I don't know what they might be. Text and colors are very clear and bright on the Asus. By having four times as many pixels, the Nexus is locked into needing more processing power just to update screen content. To what end? There may be real benefits, but I don't see them -- and that's the point! The screen resolution for both text and images is very, very good.Processing power. With a quad-core Tegra3 processor, this is a speedy tablet. Judging by how it runs the 3D graphics of NVDIA Glowball, it shouldn't have any problems with advanced games. It certainly has no problems in ordinary use when browsing, reading ebooks, handling multiple applications at once, and so on.Speakers. One of the best features of this tablet is the quality of the speakers. Sound quality is reasonably good for such tiny speakers and the volume is impressive. When the volume is all the way up, the tablet can fill a fairly large room with music. I no longer need to plug in an external speaker in order to watch a movie with my wife.(Update 4/17/2013. After using the speakers at full volume for about a week, they have developed an annoying rattle or buzz. I must now plug in an external speaker for music or use headphones. The initial volume was too good to remain true!)Software. One of the real strengths of this tablet is the vast assortment of apps -- many of them free. The Asus Memo 10 comes preloaded with a set of basic of apps to help those (like me) who are new to the Android OS. Using Google's Play Store one can effortlessly download and install any number of other apps. Since I use Kindles for most of my reading, it was nice to find the Amazon Kindle app preinstalled. The Amazon Appstore for Android is not preinstalled but can be downloaded from Amazon's website and gives access to Amazon's free app of the day. One disadvantage of Android software is that there is rarely an adequate help file. This makes it a real challenge to figure out how to take full advantage of the various aspects of the programs.My biggest initial challenge was to find a decent application for writing. Google Drive seemed ideal except that I couldn't find a way to get it to spell check complete documents -- (It does spell check \"on the fly\")--so my first  solution was to use a little app called Writer. It has a decent spell check implementation, but documents are limited in length and it cannot directly edit documents on Google Drive. I had to open my document in Google Drive, 'long-press' anywhere in the document to allow selecting all of the text, and create a new Writer document in which to paste that text. After editing, I reversed the process to paste the edited text back into my Google Drive document. At least this somewhat inconvenient system allowed cross-platform access to my documents. But the tablet keyboard was a bit too responsive so that extra characters or wrong keys were common. After some research I installed SwiftKey tablet keyboard and made it my default. I'm impressed. It is a very handy keyboard. Typing is far more accurate than on the other keyboards I have tried so far.  Capitalization and apostrophes are handled automatically. Word prediction is pretty good. It costs money, but it could be worth it. The keyboard works as it should both in Google Drive and in the browser's Gmail or the Android Gmail app. Problem solved. (Update 5/9/2013 Android 4.2 includes a much-improved keyboard with \"on the fly\" spell check and the ability to type using swipe gestures. To upgrade the table to Android 4.2.1 go to Settings > About Tablet > System Update.) Kingsoft Office is the best Android word processing application that I have discovered so far. You can use it to directly edit documents on Google drive and it includes an adequate spell check feature.Streaming video. One of my main reasons for buying a tablet was to improve streaming video from YouTube and Amazon Prime. YouTube worked perfectly from the start, limited only by the speed of the wifi connection. To get Amazon prime video to stream, it was necessary to side-load Flash and use the native android browser. But it does work--and very well indeed. (Update. It Did work! Amazon seems to have done something to bollix up flash support in android browsers. I am not happy about that! I will update this review again if I can discover at way to solve this problem. Update2. Puffin browser shows Amazon Prime videos but there is a bit of lag. Better than nothing. Update 3. As of May 23, you can once again stream Amazon Prime Video without lag using the native android browser, Chrome, Firefox or Dolphin as long as you have side-loaded Flash! )Slideshow. A ten-inch tablet is,  of course,  a media consumption device and to some extent a productivity  tool,  but when not in use, it also makes a very handy digital photo frame. All one needs to do is load up some photos, which is very easy to do because of the micro sd card slot. One great feature of this tablet is that you can easily set it up to show a slideshow of your favorite photos on the desktop background as well as on the sleep screen. To do so, pull down the menu with the blue icons at the top right corner. Tap Settings>Display>Home-and-Lock-Screen>Live Wallpapers>Asus MyFrame, and then choose a folder containing the photos you wish to display.Sd card slot. This is a vital feature. The Google Nexus 10 lacks one. The iPad4 lacks one.  Yet without an sd card slot, it is much more difficult to transfer songs, photos, and documents to and from the device. If you have permanent access to a high speed data connection, fine. If not and if you wish to store your songs and videos right on the device itself, you will want an sd card slot. Besides, a 16 gig tablet is somewhat short of internal space. It is handy to be able to expand the storage as needed.The tiny and perhaps delicate mini-usb connection is potentially a serious flaw because this eminently breakable connector is the sole way of recharging the tablet. With a newly purchased machine, be very careful when plugging in the mini-usb connector. With time and a bit of practice, I have gotten the feel of this, but I am still careful.Thoughts on the 10-inch tablet form factor:A ten-inch tablet is a bit too large to grip firmly with one hand, and this one is even a little slippery. I have large hands and can hold it one-handed in portrait mode, but generally I need to use two hands--and exercise caution even then.Learn to love your microfiber cloth. Tablets are renowned for picking up fingerprints and this one is no exception. Keep a microfiber cloth with you at all times.In landscape mode this tablet has a large, comfortable keyboard--especially with the SwiftKey tablet keyboard mentioned earlier. Touch typing is perhaps possible. The upgraded keyboard in Android 4.2.1 is superb! It has a great swipe capability and on-the-fly spell checking.All in all I think I may prefer the form factor of a Chrome netbook or an ultra book, but in most respects this is a fine tablet.UPDATE 6/15/2013. I have recently upgraded my experience with this tablet by making three inexpensive purchases. First I bought a Moko Slim Cover Case [[ASIN:B00BP5NIKI MoKo Slim Cover Case for ASUS MeMo Pad Smart ME301 / ME301T 10.1 inch Android 4.1 Jelly Bean tablet, BLACK (with Flip Stand, Integrated Elastic Hand Strap, and Stylus Loop)]. This nicely protects the screen and provides a fairly stable viewing stand. Next I bought an inexpensive set of styluses, which minimize fingerprints on the screen and make navigation much easier. Finally, I bought an inexpensive micro USB to USB OTG (on the go) adaptor. This gives the tablet a full-sized USB port for plugging in various accessories such as a USB memory stick or (more importantly) a wireless keyboard and mouse. I'm currently using an old Logitech keyboard that I had lying around and it works great! It turns the little tablet into a solid substitute for a laptop or netbook. It does, however, drain the tablet's battery more rapidly, but that's something I can live with when I need to do serious work processing.", "Date": "March 29, 2013"}, {"Title": "Power issues", "Author": "Puglady", "ReviewID": "R138RGYLS0ZYP", "Overall": "1.0", "Content": "I actually love the tablet considering I had a lot of power issues after about 3 months.  I finally sent in tablet for repair on 10/3/13. The company tells you how to pack the item...with 3 inches of bubble wrap and place in a box but not the original box it comes in.  You are responsible for shipping fees.  After ASUS received the tablet, it doesn't update in the computer for 72 hours.  Finally received an email stating it was shipped and they provided a tracking number but they did not provide the shipping carrier.  On 10/17/13, I received my tablet with a cracked screen. I called ASUS immediately and they were very apologetic.  They provided me with a new RMA number and they also provided a shipping label at their expense. They asked me to email pics of the broken screen which I provided immediately...within an hour of talking to ASUS.  I finally received an email on 11/2/13  stating they acknowledge the receipt of the pictures I emailed to ASUS and that the pictures have been attached to my assigned case (16 days later).  I received an email today 11/8/13 stating that the screen isn't covered under warranty and in order for them to repair I had to pay them $168...seriously. Oh and they provided me with a picture they took of the broken screen.  It's been 36 days and still no tablet.  I will NEVER purchase an ASUS product again.  The company's computer system is messed up...and they sell computers.  It shouldn't take 72 hours to post updates. The people I talked with on the phone are very nice and say they understand my frustration but that doesn't help get my tablet repaired.  The whole process has not been pleasant. I talked to a supervisor with ASUS who told me I had to reply to the mail stating I owed the $168.00.  I wonder how long it will take for them to read it....hopefully not 16 days again.", "Date": "November 8, 2013"}, {"Title": "Great Tablet and Great Price for all the Features.", "Author": "RV", "ReviewID": "R12HPA59OFRL9M", "Overall": "5.0", "Content": "Let me start by saying i usually do not give reviews because i am to lazy to do so.  This time I had to.The Price for this tablet considering all the features you are getting is amazing.  I have a Galaxy Tab2 7.0 and I love it but it is a small I and wanted something bigger with lots of features but could not affort 500 plus for the big names.  I read the reviews about this tablet before purchase was a little scared about some of the things being pointed out in the reviews.  The camera was a big concern as i read a few reviews that said they have camera issues such as it not working at all.  I bought mine and it is working perfectly.  I tried it several times right out of the box and after installing lots of apps.  I even installed scanner apps and they all work fine the pictures come out great and not one camera issue.  So its possible that there were some tablets that left the factory with less then perfect cameras but Mine works flawlessly.The speed of the unit is great.  I have browsed the internet for 3 hours straight and have had no issues with connection dropping or speed of the connection.  Pages load with no issues unless the website itself was having and issue.The GPS works Flawless also.  I took it in my car and drove all over the place and it kept right up with me no issues.  Keep in mind i was not using the installed navigation program as that requires an internet connection.  I use a GPS app that stores all the maps you need on the unit so that you do not need internet connection and it works great.Video playback is perfect no skipping no pause nothing at all.  Sound is also great.  The reason you feel a slight vibration is that it has a great bass sound to it and Bass will always give you vibration on any speaker big or small.  You only notice it if you are holding the unit and the volume is all the way up.  There is no problems with sound either.  Keep in mind though the set the tablet to the max volume at the factory you have to take into account that depending on how a video or mp3 was recorded the sound level is different on each MP# or video so some are louder and you have to keep that in mind.  With any product you really do not want to run the speakers at full volume to preserve the speakers so that you do not cause damage to them.  But for the size of the speakers on this unit they produce a really great sound.The earphone jack works great also.Videos were no problem as I was able to play and type of video threw at it and played great.  Again using a app that you can download.  There are many apps that you can download that are able to play all video formats.Also no issues with the HDMI out works fine no issues.The microphone picks up really well and very clear. No issuesI will agree with one person that the usb connection on the tablet is hard to connect and you do need to get a feel for it because its very tight and getting in the right way can be tricky and could cause damage if you do not have patience but otherwise works great.  Also agree that the cable that comes with it is a little short but you can always get another cable from amazon for a cheap price just make sure you purchase a quality cable.Battery life is great also.  I have run it for 12 hours before loosing charge and that included watching to full movies each 1.5 hours long.  Also Browsing the internet for 3 hours and lots of installing of apps and file transfers.It came with Android 4.1.1 but soon as you start it up it up and connect to the internet it will download an update then restart.  Then just go back into settings then About Tablet and click on system update and it will download and install Android 4.2.1 Then reboot and you are Running 4.2.1.  It runs super smooth.I have not had any issues installing all my favorite apps that i Run on my other tablets and Phone.  I generally only by Samsung but this product can really hold itself to others no problems.The actual case is not as strong feeling as others but not bad either and it is actually light and not uncomfortable to hold.  The screen brightness is very good and have not had any issues with the brightness and being able to see the screen outside.  I have been able to watch movies from a movie site with no problems in the stream of the audio or video.I have played some demanding games and also it played very well no issues what so ever.Put one of my many 32Gig Micro SD cards into the tablet and reads it fine no issues with read or write.Do note that the manual that comes with it does state that it is not designed to be left on the charge for extended periods of time like others. But long as you are not leaving it on the charger fully charged for very long periods of time it should be fine.  You could always set an alarm to remind you to take it off the charger if you are concerned about that.Like all smart devices it does come with some apps installed already that most people do not want or do not use.  You can always disable them or remove them if you are a little with the os or if you know someone who is.The colors are crisp and clear. (Forgot to mention)Normally would not have looked at this brand or given it much thought but turns out I am really glad i did because it has been worth every penny spent on it.  I do not leave home without it.So my overall on this tablet for the money features and quality its a WIN WIN WIN.", "Date": "April 18, 2013"}, {"Title": "The Ultimate Tablet machine", "Author": "Wurz", "ReviewID": "R1SCX7IMH6JTID", "Overall": "5.0", "Content": "I've had the tablet for a month now, it has been tested during spring break, from car movie player, to in hotel movie entertainment, to work office, and internet browser.I was looking to buy and android tablet and after researching I was buying the TF700 (it was already in the cart and just needed the buy now... however I was a bit reluctant to spend $449) when I saw this brand new version.I am not a fan of the latest, because they tend to be expensive and loose value immediately thereafter. However looking around and comparing the features, you cannot really get anything for that price.The tablet is amazing. It has some limitation but that's supposed to be an entry level tablet...Now what are the limits:1.the processor is limited to 1.2 (vs the 1.7 of the Infinity): well either the tablet has also a nice hybrid engine to give you the best performance or the best power consumption... and if you want to go to the 1.7, just root it and enjoy the same power as the infinity (the processor is exactly the same... If you do that you'll see a decrease in the battery performance and it might get warmer.2.The video is not High resolution (only 1280x800): well I am not missing anything, nor by internet (you tube), nor by playback videos (one of the primiray use is movie playback in the car for my kids for long trips), nor by reader eBooks. 3.Internal memory being only 16GB: besides being well more than needed for the OS and all the Apps you need,if you need more memory just buy a microSD and add as much as you want (just bought a $20 microSD class 10, for all videos, books, an music). take a look on prices differences between pears product between the 16GB, 32GB and 64GB... then you'll be glad ASUS allows you to just add a microSD.4.Speaker vibrates: several people complain a bit about the vibration fo the case when getting some volume: first of all, yes it does vibrate a bit, however, the tablet gets some volume and some good music out of it, and that is the cause of vibrations... ever had a subwoofer in the car? same concept in a little world.Noe let's talk about the rest:1.Price vs quality: I absolutly love the product for the money invested.2.look and weight: WOW, a nice little tablet, weighing less the others and being just as cool looking as others more expensive.3.micro HDMI: just bought a $1.39 cable and now I used it with any TV in hotels, and now in my house to enjoy all my networked access media.... WOW4.micro usb: one of the most common charger adapter, 15ft USB to micro USB cable for less than $3 to being able to set up a charger in my car, or use the nokia cell charger in the office.. anywhere in the house I have those adapters... soo convinient5.Android: Android OS is coming along nice; I am a fan of Linux (yes android is linux based) and Jelly Bean is a nice OS.6.Amazon: I am using Amazon App store to \"buy\" all the Apps I need, even the free ones so they get stored in my cloud space, available to my next tablet. A daily free APP, buy from the PC and leave it in the cloud till you need it. Nice!!!The only and real negatice issue? I bought a case and the screen protector on the 26 of feb, and still have not received it, because they are in the production phase... I should get them first week of April. That's another draw back of buying the latest.That's it folks. If you are looking to buy a nice cheap tablet, go for it...Max", "Date": "March 30, 2013"}, {"Title": "Died after 11 days... Replacement dies less than a month later. Buyer beware.........", "Author": "D.K", "ReviewID": "R1D76VYYF9IBW", "Overall": "1.0", "Content": "I must have the worst luck with tablets. I had a HP touchpad which I loved that died a little under two years. Black screen of death but that what you get for buying dead technology. Anyway, I brought a Ipad 3 a few months back and it's ok. But I brought this ASUS memo pad and it was love at first sight for 11 days. It's easy to use and pretty light weight. The only real downside is the speakers. The sound for games is great but when playing a movie not so good because of the location on the back of the tablet.  Even with headphones it's only marginally better.  Anyway back to the problem. On May 31, 2013 a system upgrade to Jelly Bean was performed and it went through fine. On 5 June 2013 the tablet would not turn on. I called ASUS and they walked me through trying to get it to boot, but it to no avail. So this review is from 21 May 2013 - 5 Jun 2013. I will give Amazon high marks for their customer service.  A replacement was sent out and I should get it today.  So to be continued........6/29/13  Update... So I have had the new device for about 20 days now and last night I could not for the life of me get it to turn on. I put it on the charger and kept holding down the power button and finally got it to turn on.  I would recommend against letting the battery completey drain.  I think that is the problem with this tablet.  The last time I had this problem of the black screen of death. The tablet battery had died. Other than that a great tablet for the price.7/3/13 Update..... The replacement died today.  I had it plugged up majority of the day while I was watching Burn Notice.  When I went to turn it back on later that night.  I got the black screen of death.  So it was not a low battery issue.  There is something serious wrong with this tablet.  This is the second one to die in less than two months.  I'm not willing to give Asus a third try.  I'm getting a refund and already brought the Samsung Note.  Save your money and put out the extra $20.00 for a better product.", "Date": "June 6, 2013"}, {"Title": "Great tablet, if and when it works. Awful Customer Service.", "Author": "Martin Shoman", "ReviewID": "R1YMY1EJGR9C05", "Overall": "1.0", "Content": "I purchased this tablet (unfortunately, not from Amazon) 6 weeks ago. It would be a great tablet if it wasn't for the terrible QA of Asus. It has been at Asus repair for 4+ weeks of the 6 I own it. Originally, it would not charge properly and no computer or OS would recognize it when plugged into the USB port. First go-round they replaced the mother board and sent it back to me. The second go-round they are replacing the motherboard again (suspicious?) but the part is out of stock if you can believe that.I requested a replacement for this lemon but they insist they only have to keep repairing it because that is what the warranty states.This is also not true since the warranty state 'Repair or Replace\". The supervisor I spoke with has firmly stated they will never give me a replacement. It is only 6 weeks old and I am sitting here with no tablet. So much for Asus being a quality company that would do the right thing to satisfy a new customer.It's funny, I bought it because of Asus having a quality name. Don't make the same mistake I did. Move on and try Samsung, Apple, etc. The saddest  thing is that when I did have it for the brief time, it seemed like a really good tablet. Customer service is killing this company.", "Date": "August 13, 2013"}, {"Title": "The best tablet at 300$", "Author": "HDT", "ReviewID": "R38825GR08XUKO", "Overall": "5.0", "Content": "Fast, very sensitive screen, beautifully made, loud stereo speakers. If you could play a HD 1080p video, that's a proof that the tablet is fast enough. Wifi, bluetooth, gps, hdmi work fine. No crash so far after 7 days. It's much better than many orther tablets that cost much more! Cons: because the tablet has bevel form, it's not easy to plug in any connectors (micro usb, hdmi, headphone). Just be very careful!It's true that the Asus weather widget does not refresh! For any tablet with 1200 X800 resolution, it's the best for the price and performance.---To fix the issue with the Asus weather widget, do not choose auto-refresh my current location, use manual search instead.---Update 2013-03-26:  there's an update on touch screen software to make it better. On december 2012, i bought an acer A700. The screen is beautiful because of the higher resolution, but the touch screen is really NOT sensitive compared to ME301T. Even with the lesser resolution, i prefer ME301T. It's a pleasure to use it. I can use a stylus and touch the screen very lightly and that works like a charm.---2013-04-05: I bought 4 more tablets for friends and family. They all love it. So far, no issue. My 5 stars = 25 stars. No regret at all so far.---2013-04-06No problem with reading or writing on Sandisk SDXC 64 GB class---2013_06_29-HDMI output only 720p, not 1080p as specified on the Asus web site! Take away 1 star2013-09-17HDMI output 1080p when streaming a 1080p video. Give back 1 star.", "Date": "March 23, 2013"}, {"Title": "quality ,stable tablet running android 4.2", "Author": "Lou M \"LM\"", "ReviewID": "R12IQTJHAMELO5", "Overall": "5.0", "Content": "I have followed the tablet offerings for 2 years and have been waiting for a reasonably priced 10'' tablet (in the $300 range).This tablet is internally similar to the Nexus 7 without the HD display.It remains to be seen if (and when) apps will scale to accomodate a retina pixel density without \"squish. All popular apps(Evernote,Wells Fargo ,Seeking alpha..) from the market download and execute predictably .The sound quality is a real surprise with enough volume comparable to small external speakers. Video playback is as specified .For HD quality the hdmi output provides 1080 directly to HDMI TV input without stutter or pixelation. \" .I look a stock charts regularly and the definition is adequate to discern the detail in candelstick tail and  bodies . The game performance on Riptide and pinball is smooth and splash effects are clear. Bluetooth and wifi operation is satisfactory at ranges up to 50-70 ft.  I would recommend it for student, professional or casual  use.", "Date": "May 10, 2013"}, {"Title": "Power button/Customer service problems", "Author": "L. Webb", "ReviewID": "R2BO2FDJ997GAU", "Overall": "1.0", "Content": "I recently bought this tablet for my wife to replace her 7\" tablet. Everything was working well until she noticed the power button wasn't working all the time. I called Asus to get a RMA number and shipped it out to them. It has been 3 weeks with no update so I called them. They stated that there was physical damage to it and they would offer me a quote to fix it. There was NO physical damage to it at all. It was in perfect shape. I informed the \"customer service\" agent that I did not agree to it and all she would do is keep repeating \"I apologize for the inconvenience\" over..and..over..Such terrible customer service. I have built hundreds of computers based on their motherboards, bought a few of their tablets, and have always been a supporter of their products. I will NEVER by another product from them.", "Date": "October 21, 2013"}, {"Title": "Just as good as the Samsung Note 10.1 for half the price.", "Author": "Milton Harrison", "ReviewID": "R1KUHS0E2KJSMG", "Overall": "4.0", "Content": "This tablet is awesome.I love everything about it but the battery life. When I first purchased this tablet the battery seemed to last very well, a couple of days later I noticed that the battery seemed to be a bit less. For instance, after the first charge I managed almost 8 hours of use before needing a charge, then a few days later I felt lucky to get 2-3 hours of normal use such as reading my e- mail and the like. As a matter of fact, the first day I spent mostly on you tube and the battery life was outstanding. I was also a little upset that I couldn't use swipe on the keyboard, but after upgrading Jellybean, I found swipe was now on my tablet and that it functioned well. I would definitely say this was (or is) a great bargain b for the money. Additionally, the ASUS UI is nowhere near as disruptive as Samsung's.", "Date": "April 19, 2013"}, {"Title": "Total Failure", "Author": "Adams", "ReviewID": "R2V0MNI9ZX0RYS", "Overall": "1.0", "Content": "This tablet was just as seen in picture and it's light weight and looks really good, unfortunately i had to return it one time because the touch screen wasn't working properly and i had to press the icons very hard for it to respond. I guess i was just unlucky to get one of the faulty ones.Update: I purchased a 2nd tablet after returning the 1st one and it started off giving trouble the seller ADORAMA INC told me that they don`t do returns contact Asus and only if Asus said it have to be returned they will take it back. On top of that I ordered 2 screen protectors and I never received them. Low and behold this week the screen cracked without the tablet dropping or someone pressing on the screen by mistake, I contacted the seller and they told me that I passed the 30 day return policy when I contacted Amazon and filed the a to z claim that was also a total Failure. In future if I buy anything from Amazon it has to be shipped and sold by. The 1st Asus I bought was on the 13th August 2013 and the 2nd on the 26th August 2013. I am going the way of Samsung probably buying it elsewhere because u loose your money both ways on Amazon.", "Date": "August 25, 2013"}, {"Title": "Definite buy", "Author": "Stefan", "ReviewID": "R2U6LRJITS3ALB", "Overall": "5.0", "Content": "Feel: GoodPerformance: Super. Not the highest resolution but ok. Tegra processor great. No lag.Ports: all needed (headphone,bluetooth,wlan,hdmi,SD slot, micro usb for charge and OTG)Price versus performance: 10/10I bought 3, two for the kids and one for my wife and I to share (it might be a nr 4 soon)", "Date": "June 15, 2013"}, {"Title": "Good tablet for the price", "Author": "Rider", "ReviewID": "R3UFTLFBG4DIVW", "Overall": "4.0", "Content": "I think of this tablet as a 10\" version of the Nexus 7. That's pretty much it. Except that it does not get the pure Google Android experience. Thankfully Asus unlike other Android device makers do not fill this tablet with bloatware. So it is still pretty lean.Our Memo Pad Smart updated immediately to 4.2.1 JB via OTA. For some reason it didn't get the 4.2 excellent keyboard that allowed one to swipe around keys. =( I really like that in my GNex.Like most reviewers below, I am quite impressed with what it can do considering the low price. I did a bunch of research comparing it to the older TF300 and premium TF700. While it may not look like much on paper spec wise (same as TF300 but lower spec than TF700), Asus improved upon the useability of the MeMo Pad. Most importantly, the I/O side of things. It no longer lags! Yay! In that respect under real life use the MeMo Pad felt more responsive than previous Asus Tablets. I think they learned a thing or two while producing the Nexus 7.{The Bad}The screen resolution was OK. I prefer higher res. But for normal day to day use, it is fine except. Some small text are a bit garbled. Else photos are fine. Watching HD movies is fine too.The plastic backing while ok, it did exhibit some minute creak. No biggie. I am anal that way.{The Good}This outweighs the above easily. Speakers blew me away. For such a small thing, it produces big sound.Lots of non-proprietary ports (Apple needs to learn here!). HDMI, USB, microSD expandable....One of the lightest 10\" I ever used. In contrast the iPad was a heavy beast.Really like that it is thin.Very little bloatware.In conclusion, I feel this tablet seems to punch above its weight class. The screen resolution is what holds it back else it would be one very very popular tablet. For casual home use, I feel it was a good buy.", "Date": "June 3, 2013"}, {"Title": "way too touchy", "Author": "Donald Gorman", "ReviewID": "R1L2OPZEQSRLA7", "Overall": "1.0", "Content": "The screen is way too touchy. I scroll through twitter feeds and it will just stop scrolling, or it will inadvertently select a link. I did not have this issue with my previous tablet or my smartphone. I contacted Asus about this and their solution was to do a 'cold rest' which wipes all user data. Not only did it not help, the tablet will no longer make a WiFi network connection. It knows the network is there And has excellent signal strength. It just won't connect. Even when trying to manual connect.  Very frustrating. Looking at getting my money back and buy a Kindle FireUPDATE; 01/06/2014I have to send it in to be fixed. Be advised. If you buy this and it is defective in any way that requires it to be repaired at their facility, YOU PAY FOR SHIPPING!!! They won't cover it. And it is impossible to talk to someone in America.", "Date": "January 2, 2014"}, {"Title": "Love this tablet", "Author": "Andy M. Kar \"neela_ananda\"", "ReviewID": "R1R0KOD3BEZ7VB", "Overall": "5.0", "Content": "I've been using this tablet for the past month and it works flawlessly. Was able to install all the apps I use,  from Google Store without a hitch. The display is good for HD video and the sound quality is excellent. Connected the tablet to my HD TV and it works fine. It's a great bargain for the price. I highly recommend this.", "Date": "April 27, 2013"}, {"Title": "Strongly recommended budget tablet", "Author": "Mambo72", "ReviewID": "R3MOV2PAU2C02F", "Overall": "4.0", "Content": "In most aspect, this tablet is good enough as a budget tablet. It works perpect in most case. You don't need to pay $100 to 200 more to buy other expensive tablets. It contains most function asked by common users. Only concern is that camera needs more light when you are inside of building or house. However who cares the camera function in the tablet.", "Date": "March 25, 2013"}, {"Title": "Known WiFi Problem by ASUS", "Author": "P. Hernandez", "ReviewID": "R260JR5Y9MPUMX", "Overall": "1.0", "Content": "I have had my tablet for 3 days. The 1st day after charging and setting up (Friday), I turned it off. The next day (Saturday) on turning it back on its WiFi wasn't working reguardless of what I tried. I am tech savy, looked up forum feeds relating to the problem and found that its a flaw in ASUS's tablet. Contacted ASUS online chat tech support (Monday - they aren't open Sunday) and they told me how to troubleshoot, that failed twice. They gave me the 1-888-678-3688 ASUS tech phone support and asked me to call them. After talking to the nice person, it was determined it needed to either be repaired, or returned. I opted to return it for a refund. I am not going to say ASUS is a bad product, but I will say, please do research on the tablet before you buy it.", "Date": "June 10, 2013"}, {"Title": "Poor product, horrible customer support", "Author": "LeBronaldReagan", "ReviewID": "R1O7KX6MXDOCFS", "Overall": "1.0", "Content": "My tablet shuts down randomly and requires a hard reboot (holding power button for 10 seconds) to start back up. This started shortly after 30 days from purchase (of course).ASUS warranty customer service is incredibly terrible. They give you the run around and waste your time when you contact them. Once I finally had my tablet shipped in for repair they returned it with the same problem. Same unit, nothing changed at all. Maybe UPS and fedex cut them a share of shipping fees?I am currently attempting to get this resolved - again. Just now I got the, \"Our RMA system is down so we cannot pull up your info\" from the service rep. If you are going to purchase one of these you better hope you don't get a bad unit because the factory warranty process is as bad as it gets.", "Date": "March 17, 2014"}, {"Title": "First tablet purchase and I love it", "Author": "Nathan C. Harrison \"SkyLine Prints\"", "ReviewID": "RR1B6LEOBF48H", "Overall": "5.0", "Content": "I never thought I'd be someone who owned a tablet but finally I ordered this one.  I must say I have been surprised by how much I use it.  It works perfectly and has met my expectations.  I have no issues with it.  In fact, I purchased another one for use at my store.", "Date": "August 11, 2013"}, {"Title": "This thing is great!", "Author": "O. K. Maharaj", "ReviewID": "R28RSC3XIXCIDM", "Overall": "5.0", "Content": "Having used other tablets, I must say that this one keeps up with them and at a far lower cost. The user interface is responsive and battery life is good. I have had no issues so far and would tell anyone to buy this.", "Date": "July 20, 2013"}, {"Title": "ASUS Q&A; is to be desired.", "Author": "truecrisis", "ReviewID": "R6D8AUDUDAB4H", "Overall": "4.0", "Content": "After purchasing this tablet I fell in love with what I got, its everything I wanted.Only thing is, I recieved a unit with defective sensors.For example, when facing straight up, it would tilt to the left, and the compass faces NW when I face north. I searched high and low on how to calibrate this thing. No info on calibrating a Jellybean device. It seems to happen automatically on boot???Well after much research, I speculate that android uses the magnetic sensor to calibrate the gyro and accelerometer on boot.I believe I have a faulty magnetic sensor on the unit.I ordered a replacement from amazon. Received free of charge, same day shipping! Have to drop the old one at UPS in 30 days.The replacement also had the same issue. :(But after fiddling with it for about an hour, it seemed to calibrate itself upon reboot. So now it works fine. Will report back if I have further issues.Your device will undergo two updates when you get it. The first update is to the touchpad (also called digitizer). The touchpad is very bad and doesn't register touch very well at all before the update. The 2nd update is to 4.2.1. (No digitizer issues after the updates)After the 2nd update you need to select 4.2.1 in the settings menu. The fact that ASUS allows you to switch between the two launchers is really nice, but I think you lose 4.2.1 features when using 4.1.1 interface :(Sometimes the gamma is overblown after using some apps but it corrects itself within 30 seconds. I'm not really sure whats going on. It doesnt seem related to brightness as I dont use autobrightness. Kinda odd, but I suspect its the screen going into some \"cinema mode\" or something. The only time this causes a problem is with reading text. But again, oddly it corrects itself sometimes.Sound is AMAZING using the equalizer app that comes from ASUS. The \"gaming\" profile boosts bass A LOT, and shouldn't be used in other situations. The best audio profile I like is \"music\" ... in pretty much all situations including youtube or watching movies.Back facing camera is grainy when set to ISO of 800. (The fact that ASUS camera app gives you ISO control is really nice) I suspect that its a very low budget 5mp camera. But it does the job!Gaming is average. REAL RACING 3 is set to a low quality profile on this. I really don't know why. Using a 3rd party app allows you to bump REAL RACING 3 to extreme settings but its unplayable. \"MEDIUM\" profile is playable. \"HIGH\" is slow FPS but tolerable if you really need those spectators in the stands. If anyone wants me to test a game, leave a comment here and I'll give it a quick review.", "Date": "July 8, 2013"}, {"Title": "Perfect Tab - memory and OS", "Author": "R. T. Miner \"Trent\"", "ReviewID": "R15TTUE0RSEYBI", "Overall": "5.0", "Content": "This tablet is fantastic.  For the money it is tops!  The main reasons why I got this is because it runs on android jelly bean 2.1 (updates are going to be minimal from here on until Keylime Pie) and you can add memory when you run out.  Find a tablet that does better for the cost and abilities. I am 99.9% certain you can't unless it is refurbished.  Asus has released its next version so it might be even cheaper now.  I strongly suggest you get this UNLESS you have to overpay for an iPad.", "Date": "June 28, 2013"}, {"Title": "Great Tablet!", "Author": "C. Smith \"Smitty\"", "ReviewID": "R17QD49SSJKMQL", "Overall": "5.0", "Content": "This is a great tablet It's light and has great screen and does everything a tablet should.Would recommend it to everyone!", "Date": "May 4, 2013"}, {"Title": "beware", "Author": "snowflake", "ReviewID": "R129IQ67CV3EED", "Overall": "1.0", "Content": "This product seemed good in the beginning, but I had it for 2 months, now the screen is black with white vertical lines, of course customer service first asks, did you drop it? and if you return it and we see physical damage you are to blame, it just stopped working and I do not like the customer service dept.", "Date": "February 9, 2014"}, {"Title": "Awesome tablet!", "Author": "Xnera", "ReviewID": "R1C04TK4UPYO1V", "Overall": "5.0", "Content": "This is my first tablet, and it is everything I was expecting and more!  It is fast, looks great and works great.  Very lightweight yet sturdy, easy to hold and use.  It updated itself to Android ICS on the first use.I have been looking for a reasonably priced tablet that included an HDMI out and a USB connection, that is a combination hard to come by! The USB makes it easy to connect to my computer and transfer files (wifi isn't always an option). HDMI out lets me watch movies on my TV.  Other tablets that have these features cost $100-200 more.I read that the resolution is an issue on this tablet (being low in comparison to other 10\" tablets), but I have no problem with it, I am not sure what people are complaining about, because the picture and videos are very sharp in my opinion.I was able to add a 64GB SD card for extra storage.I only have 2 small complaints - the very short cord for charging, if you want to use the tablet while charging, you will have to sit very close to the outlet.  The other is that the description says this is 'Blue' but the one I got was grey.Overall, I would recommend this tablet to anyone!UPDATE 6/2014 - I like the HDMI out, it lets me watch any movies or streaming video on my TV (Netflix). However the HDMI out port is pretty cheap, it barely holds the mini HDMI converter, and now barely works. I have to jiggle it and eventually it will make the connection, then I have to hope it lasts while watching the movie.", "Date": "May 22, 2013"}, {"Title": "Outstanding , so far", "Author": "MikeB", "ReviewID": "R1MFRJBTUI9OJ8", "Overall": "4.0", "Content": "I bought this tablet as a gift for a person who was about to go into the hospital for an extended stay. I set it up at home for her. The set up was extremely easy.....just follow the prompts. The preinstalled apps were very useful and easy to use for a novice. The tablet was simple to customize. This tablet will be a welcome friend for the patient and help keep her mind off of things.", "Date": "May 13, 2013"}, {"Title": "So Far So Good", "Author": "Gale", "ReviewID": "R2SYSHR4Z8RXRX", "Overall": "4.0", "Content": "Pro's:PriceBuild QualityEasy set upCrisp graphicsPower (Quad Core Tegra 3)LightweightCon'sDocumentationShort USB ChargerAccessoriesNot Blue?I've had the MeMO pad for about a day and have been getting it set up for my wife. Purchased for a B-Day gift. So far this thing is lightning quick. the keyboard is soooo much better than other Android devices I've had in the past (Moto Atrix). It's quick and super responsive.First task was to upgrade to JB 4.2 and it was seamless and easy. While it is very light, the build quality seems very good. I would recommend a case/screen protection for it in short order. Having found a case and some screen protection online, one thing I have to say is that Accessory availability seems to be somewhat limited. It took some digging to find a hard case (quasi otterbox style case) on Amazon.Product comes well packaged with almost no documentation to speak of. Just some basic warranty stuff. Charge cord is short so will be investing in a longer one here directly.After researching Tablets for a couple of weeks I'm very happy with this. It is faster, lighter, less glitchy, than my current  ipad at less than half the price. So far the cons are cosmetic in nature and don't affect functionality, easily fixed with a little effort on your part. Great buy so far!", "Date": "May 31, 2013"}, {"Title": "AWESOME TABLET!!!", "Author": "grk65", "ReviewID": "R2EN45JF99TQU", "Overall": "5.0", "Content": "I searched for over 6 months for the right tablet. I knew I didn't want an iPad. My son has one and we just don't like all the proprietary BS that comes with an apple product. I wanted something light, Reliable, attractive, great screen and graphics and very functional. I found it all with the ASUS MeMO. One of my favorite things about this is the micro usb port that can be used as a host for things like a thumb drive or a memory stick. Very convenient. The graphics are great and fast, even with 3D games. I also love the fact that unlike Apple products, it comes with a micro SD memory expansion slot.One word sums it up. SUPERB!!!", "Date": "May 21, 2013"}, {"Title": "ASUS Tablet very good quality", "Author": "Amazon Customer", "ReviewID": "R279MCOPMBEIRF", "Overall": "5.0", "Content": "I'm getting used to the tablet, very user friendly.  I like the operating system and the ease of downloading Apps and books from Amazon.", "Date": "August 23, 2013"}, {"Title": "Nice tablet for the price but with limited-range wireless", "Author": "P. Metz", "ReviewID": "R16JPS5P6UIULW", "Overall": "4.0", "Content": "I did quite a bit of research to find a decent-quality tablet for around $250, and this one delivers.  The size and form factor (very thin) is what I would expect and want from a 10\" tablet.  It feels sleek and is very light.  The build quality seems quite good for a device housed in a plastic shell.  The screen is great -- extremely clear and vivid, with an easy-to-access brightness slider control, which you'll want to use, because I've found that screen brightness has a lot to do with how long the battery lasts.  You can turn off the \"auto\" brightness and extend the battery life quite a bit.  Keeping the wireless feature \"on\" will also drain the battery quickly, so I only turn on wireless when I need it, and otherwise turn it off.  Overall, I feel the battery life is good, albeit a bit shorter than I might have expected.  It will last the better part of a full day, even with heavy use.The processor is quick; I've had no issues with download speeds and my kids have had fun playing games on it with no issues.  It hasn't crashed or stalled at all in nearly 4 weeks of fairly regular daily use.The only knock on this tablet is that its wireless antenna seems a bit weak -- my phone can pick up a stable and strong wireless signal throughout my house, on every floor.  This device struggles to find a usable signal if I go to another floor, or if I get more than about 20 feet from our wireless router -- and I have a fairly high-end router.  So, I can't give it 5 stars.But, overall, I'm very happy with the purchase and can give it a strong recommendation.UPDATE, 9/11/13Not thrilled with the wireless reception I had been getting on the ASUS, I switched to the other \"band\" (frequency) of my wireless router (I have a dual-band Netgear 4300 that uses both 2.4GHz and 5.0GHz standards) and was pleased to see that the signal strength improved noticeably on the ASUS tablet.  I had been using the 5G signal, but the antenna seems to do better with the 2.4GHz signal, and I can get a usable wireless signal throughout my house now.  Very happy about this -- tempted to revise my 4-star rating to 5-stars.", "Date": "August 22, 2013"}, {"Title": "Second time's a Charm", "Author": "Amazon Customer", "ReviewID": "R3QJGJH0OI5AH2", "Overall": "5.0", "Content": "Have just ordered another one. I bought \"used like new\" the first time but the package was missing the usb adapter and instead contained a generic power plug so there was no way to link it to my computer for uploads / downloads. The Tablet itself was great and i just placed an order (for a NEW one this time so get all the original parts and perks) I found the Memo to be quick, clear, lightweight, and anticipate that it will serve me well with my Kindle and Kobo Libraries, morning news on the web, streamed movies in bed, (Yay Amazon Prime!) email, facebook, and twitter updates, and as a Skype phone and gps. There are higher rez (and higher priced) tablets but I was delighted by how responsive and adaptable this IPS unit is for being under $300. I have played with other tablets, even the Ipad and the Fire, but this one has size without weight and bells and whistles without a high price tag. Though its native resolution is only 1280 x 800, it has an HDMI socket and outputs 1080 to any hi def device with an HDMI input port... so If I have to see it bigger and higher rez - thats possible. I will update this review after a month or two of trying out the Skype, GPS, bluetooth and other apps and functions... but I have a good feeling about this tablet.Months later...2-21-14This ASUS MEMO tablet is as I'd hoped. It's light, it's fast, the screen is clear and I take it with me everywhere. There was no problem (thank you AMAZON) with the return and replace and though I rarely use it for movies (having larger screens available) I have and it worked great... on this small a screen the native reslution is plenty and I don't hook it up to the HDTVs because I have an internet tv and a laptop to use in that way. Photos and videos taken with it are clear and natural and I love that I can carry a small library with me anywhere. Complaints? Only two and they aren't ASUS's fault... Flash does not run on it so I have to wait to get on my laptop to see flash videos that arent set up for YouTube (which it handles just fine). And I can't get it to play Amazon Prime movies! Only the FIRE and the ipad can! Grrr.!!! However no problem with Netflix etc... The battery does several hours of web before needing a boost and sound is excellent for a tablet... better than the ipadIV my house mate has! Infact comparing the two I find the ASUS is smoother and easier to use and seems to access the web faster. So all in all I'm a happy camper...", "Date": "August 13, 2013"}, {"Title": "It did not work properly. no funciono correctamente.", "Author": "andres", "ReviewID": "R2XA1HIPREF83L", "Overall": "2.0", "Content": "After a month of use would not turn over. I wonder how do I fix my tablet? because in Venezuela there is no technical support for tablets.Luego de un mes de uso no encendio mas. quisiera saber como hago para que me arreglen mi tablet? Ya que en Venezuela no hay soporte tecnico para tablets.", "Date": "August 13, 2013"}, {"Title": "awsom", "Author": "Ben Foss", "ReviewID": "R137WHAZZAL17D", "Overall": "5.0", "Content": "Got the tablet and the touch sensor was pertty bad all i had to do was run the update and that solved the problem on both the tablets (bought 2, newegg wants 450 for 1)", "Date": "August 12, 2013"}, {"Title": "A good tablet with a few annoying glitches", "Author": "Hal", "ReviewID": "R2WQD5IZYSMMWK", "Overall": "3.0", "Content": "I have had this tablet for almost a month now, so thought I would write a review.I purchased this tablet here at Amazon and bought the I-Blason case with it. This case is a must have for the tablet! It fits perfectly and offers a lot of protection. You must have a case for your tablet. I also purchased a 32GB SD card for additional storage. I intend to move a lot of my music, photos & videos to the tablet and will store them there.The speakers are really good and sound great. I get about 5 hours on a charge and it recharges quickly in about 3 hours. I never let it run down below 30%. The camera works well and the pictures are sharp & well focused. The microphone is sensitive and the voice recognition works just great. The WIFI is sensitive and connects very well with my wireless router. The apps load fast and run quickly. The display is clear & sharp for most uses. It would have been nice to have higher resolution, but it is fine for most uses. Over all I really like this tablet and feel it is worth the price. I have had none of the problems reported by others regarding lockups, failure to boot, screen scratches and speaker or battery problems. I feel that it is a good choice over the Kindle, if only for the rear facing camera plus a webcam on the front.There are however a few glitches I have experienced which take away from a perfect experience. Some may be related to the fact that I am using my SD card for extra storage and some are probably just Android glitches.I don't like the fact that the tablet turns on when you plug it into the charger. You then have to turn it off so that it will charge faster.The Asus Weather/Time widget has stopped connecting with Accuweather and will not update anymore. It worked for a couple of days. Haven't been able to get it to work again. A Google search reveals that others have had this problem tooI want to be able to copy files (music, photos, videos) from my desktop PC (Windows XP) to the tablet. I am able to copy music (MP3), photos (JPG), but Windows won't let me copy videos (MP4) to the tablet. It says the file type is not supported by the device. It will, for some reason, let me copy WMV video files, but WMV files won't play on the Android tablet. I have to work around this by changing the file type extension on my MP4 files to WMV and then copy them. The Android tablet then doesn't seem to care what the file extension is and plays them just fine once I get them there! I worked with Asus support on this and they were unable to provide any solution. I had hoped they would have updated USB drivers for their tablet, but they don't. They have drivers for their \"Transformer\" tablet only. Maybe updated Android USB drivers would have allowed Windows to properly recognize the deviceWhen I connect the tablet to my PC via USB, the Windows file manager shows duplicate entries for the folders on the tablet's SD card. Also, whenever I connect it to my PC without even copying files or doing anything, all of the files in my folders on the SD card are suddenly duplicated! The tablet file manager doesn't show them duplicated, just the Asus player/viewers. The only way I can eliminate the duplicate files is to (using the tablet file manager) create a new folder under a different name, cut & paste all the files to the new folder, then delete the old folder. This duplicate file problem also occurs when an update is applied to one of the apps.Doing a Google search on these problems I have found others have experienced these problms with other devices, including smart phones. It seems that the Android OS has some glitches. No one reported the Windows file copying problem however.I don't have experience with other brand tablets, so I don't know how they compare. But even with the glitches, I still find this tablet to be very useful and worth the price.My experience with Asus support was just so so and not what I would call great.", "Date": "August 10, 2013"}, {"Title": "Best!!", "Author": "Gary A Helms", "ReviewID": "RIULCSZPUAQ8G", "Overall": "5.0", "Content": "Wish I had waited for the 32gb but this tablet is so fast and the graphics are the absolute best. Will never have another Kindle or Ipad. The very best in all aspects, hands down.", "Date": "August 4, 2013"}, {"Title": "WOW", "Author": "MASTERCHIEF", "ReviewID": "R21PTAIMTAUIU4", "Overall": "5.0", "Content": "This is my first venture into the world of mobile devices. Even my cell phone is an old flip top. I bought this tablet so I could upload my portfolio into the gallery to show off my work with clients. Works beautifully! Then I started using Gmail on this, my god, what have I been missing? News apps, games and Kindle! For whats been called an entry level tablet this surpasses all my expectations.", "Date": "August 3, 2013"}, {"Title": "Asus 10.1 Inch Memo Pad", "Author": "Ladybayouwolf", "ReviewID": "R32QWI39PS6BJZ", "Overall": "5.0", "Content": "Every thing is perfect except I can't put flash player on it so I can play Farmville2 and other games on Facebook.", "Date": "August 3, 2013"}, {"Title": "Great purchase", "Author": "dons1000", "ReviewID": "R2FNM3768T25UQ", "Overall": "5.0", "Content": "Firstly, I'd like to say that I purchased an ASUS 17.1\" notebook that I really like. The price point was incredible. The problem with it is that it is just too bulky. I bought it because I wanted the bigger screen, and thought I would be using it more. I bought the the ASUS tablet because it's small and convenient. I would like to have a bigger screen, but you can't have everything.I love this little tablet. I take it with me everywhere. It's perfect for meetings. I wish I hadn't purchased the notebook. Live and learn.This tablet is very light weight. I also purchased the Folio Keyboard Case which made the overall purchase a little pricey, but a good investment.The price to functionality is very good. The speakers are about what you'd expect for a tablet. The screen is nice. I have a 16gb sd card. I have yet to use the headphones. Adjusting the volume is a little involved if you don't have the keyboard. You have to go  into setting to change the volume. If there is a more direct way, I haven't come across it yet. I think it would be nice to have some volume buttons along the side.Overall a good purchase. I would do it again. If you're looking for an inexpensive (not cheap) tablet, go for it.There is one small issue. The product is solid, but it could be a little more \"solid\" IMO. You don't have to handle it gingerly or anything like that. It just could be a little more sturdy.", "Date": "July 26, 2013"}, {"Title": "Entertainment and Surfing", "Author": "Amazon Customer \"Full Frontal Nerdity\"", "ReviewID": "R3R4EKI71YS2KB", "Overall": "4.0", "Content": "The ASUS MeMo Pad 10\" tablet is a portable way to web surf and enjoy multimedia. It has adequate power to do what it needs to. It streams video capably and works well as an e-book reader--without the Kindle Fire price. It should be noted that the MeMo pad only has Wi-Fi--with no 3G or 4G capability. The camera takes decent photos, and the built in cloud storage widget is a nice way to store photos online. This product is a solid performer at a budget friendly price.", "Date": "July 20, 2013"}, {"Title": "Very Satisfied", "Author": "Harry Beck", "ReviewID": "RCEHWWOP8P0Q6", "Overall": "5.0", "Content": "Let me start out by saying that my primary tasks involving this tablet are to have remote acces to the internet and email throughout the house (very basic).  This ASUS unit has been great for my application.  I would recommend it to anyone.", "Date": "July 12, 2013"}, {"Title": "memo pad.", "Author": "Dee", "ReviewID": "R2NB1KN5TZOZS1", "Overall": "5.0", "Content": "love it. well worth the price. bought another brand for Christmas and it only lasted a couple of months. definitely recommend this tablet.", "Date": "July 11, 2013"}, {"Title": "good upgrade from kindle fire (1st gen)", "Author": "chemstudent", "ReviewID": "RBXL5ZUZM90B", "Overall": "4.0", "Content": "Had a kindle fire rooted and aokp android ics rom installed.  I just did not like the kindle fire's 7\" screen and there was considerable lag so I upgraded to this asus 10.1 tablet.  Overall I like the tablet and it feels snappy.  16gb is plenty of storage space for me.  The screen is relatively dim and easily scratchable (I already have a large scratch ~1.3 inches on the screen, luckily it's only on the bezel and not on the visible area).  Some cons are that it's not Gorilla glass and the screen quality is only average.  The battery life is rated at 8hrs but realistically I've only been getting 4-6 hrs with constant use (mostly reading e-books and/or watching online videos).  Adobe flash is available, just install the apk from adobe and you are set.  Asus supernote is pretty cool.  I also like the micro hdmi out as I can connect my tablet to the tv to watch my videos. I don't really like the placement of the power and volume rocker.  The power button is somewhat recessed into the tablet and located in a non-intuitive area.  Also for those that have the tablet, there is a light on the power button that goes from orange to green when it is fully charged.  did not discover this until after a few charges.  The speaker output is fairly loud.  It sometimes does get a little warm on the plastic backing but nothing too bad.  Build quality is great overall (only complaint is the plastic backing is a little creaky) and the asus updates to the latest version of android were quick and flawless.  I have a asus 1000ha netbook that is 3 years old, hopefully this tablet lasts just as long.", "Date": "June 29, 2013"}, {"Title": "fell in love!", "Author": "james h", "ReviewID": "R22YY4QVQTRPBR", "Overall": "5.0", "Content": "I like everything about this tablet. It has wonderful battery life. And it's very fast. It does not support flash, though. It's the only con.", "Date": "June 22, 2013"}, {"Title": "Just great!", "Author": "Klauss", "ReviewID": "R2D5ATGL6PO2U9", "Overall": "5.0", "Content": "Very VERY fast, long battery use (10 hours eeeeeasy, surfing the web, downloading torrents, gtalk, reading newspaper, checking email, all at the same time).Not sure how much it holds the battery using the bluetooth keyboard because just bought it, but i will let you know after i try that.I've installed a 64 gb microsd, it works PERFECT, very very fast. Using the VLC also in order to watch movies - even with subtitles - connected to my 32\" LED tv (using HDMI).... just dont need my notebook!!Sound: very good the speakers. You can't ask for more to a tablet, come on!Games: excellent! If you play the nvidia recommeded, you must close all other applications and everything you can in orden to get the best results and performance.Just bought the OTG (on the go) microusb cable, so i'll let you know about the pendrive and how it connects.", "Date": "June 4, 2013"}, {"Title": "Lovely at first but................", "Author": "Tasha Daley", "ReviewID": "R15XF0BEJYKWV1", "Overall": "1.0", "Content": "I fell in love with this tablet when i received it. i bought it for my husband and it worked remarkably for TWO MONTHS then went dead and just would not turn on. This is very disappointing as NOBODY WANTS A TABLET THAT ONLY WORKS FOR TWO MONTHS. My husband is not a guy who does much on pc's so he mainly used it to surf the net, skype and watch movies, Great concept in the design and pre-loaded apps but it just is not built well.", "Date": "October 1, 2013"}, {"Title": "Good, Affordable, Bad battery life", "Author": "Mark W", "ReviewID": "R1CE81SV7WKA2Z", "Overall": "4.0", "Content": "Like the features, especially for the price point. Battery life - not so much.  Would give IPad a run for the money but using it with the screen brightness all the way down and wireless connection turned off, I can only get 4 hours max on a charge.  Hoped it would be better.", "Date": "July 18, 2013"}, {"Title": "Surprisingly good tablet for the price", "Author": "Amazon Customer \"barryem\"", "ReviewID": "R1JLPM0SLHGLQQ", "Overall": "5.0", "Content": "I selected this one primarily because it's getting such good reviews and sure enough, it's as good as they all say.  It's light and easy to hold and fast and responsive and it does everything very nicely.I have an Ipad 2 and the original Asus Transformer and this is nicer than either of them.  The screen is as good as they are and the speakers are quite a lot better.Battery life isn't quite what I hoped for but it's not bad.  I haven't measured it but it's not as good as the Ipad's battery life and almost, but not quite as good as the original Transformer.  But it's not nearly as bad as the battery life on my Acer A110 tablet.  So it'll do.That's as close as this thing has to a down-side.  I'm really pleased with it.Barry", "Date": "May 19, 2013"}, {"Title": "Pound for Pound - Best Pick", "Author": "A_Designer", "ReviewID": "R3P1CUCIMSJSDO", "Overall": "5.0", "Content": "THOUGHTS:I've followed the many reviews for the Asus Memo Pad before making my final decision, and I must say that the product is worth the five stars -particularly for the quality and the price point.SETUP: If you are computer literate, the tablet is really easy to use - out the box. Setup(with updates) took me about 15 minutes.NAVIGATION: Touchscreen feedback is excellent. When navigating through webpages or email, there is not lag.BUILD: Though not contained in a metal housing, the plastic build still feels pretty solid. As another reviewer commented, you do feel some slight flexing if you apply enough force.SCREEN RESOLUTION: I think the screen resolution is pretty good. The colors are vibrant and the viewing angles are good. I am aware that there are more expensive tablets with higher quality resolution  - but trust me - the quality on this tablet is not a let down.O.S: I own an Android smartphone and have always been a fan of this operating system due to the large app market. There are so many free quality apps that are available. The Android interface on the ASUS tablet seems to be flawlass.FINAL THOUGHTS: If you want a quality tablet without dropping $500 or more, the ASUS memo pad is an excellent choice.", "Date": "May 23, 2013"}, {"Title": "Lots of goodies for the price, but...", "Author": "Brian", "ReviewID": "R15E97O37GUMW6", "Overall": "2.0", "Content": "This tablet is fairly new to the market.  I liked everything about the ASUS tablet when it arrived.  Powerful, lightweight, thin, and easy to use.  Even though the screen is not a mega-pixel screen, it still shows a great picture.The down size is that less than a month into ownership, I used it one evening, put it away, went to bed, and the next morning I could not get it to turn on.  Tried to charge for about thirty minutes with no results.Returned to Amazon for an exchange.  I have had other ASUS products(laptops) that have done just fine.  I am giving them another chance on this tablet.Just wanted to let the reader know about this issue.Oh!  Amazon performance was outstanding with regards to the exchange.  I shipped the original back on Monday, and will have my new tablet on Wednesday.That was at the end of April.  It is now the end of May and I have sent my second tablet back.  Experienced the same problem.  Listened to some music before hitting the sack.  Before powering down, I noticed I had 3/4 battery life left.  Powered off as required.  Woke up the next day to turn on and check the news, not a thing on the screen.  Tried to recharge and after two hours, screen completely black.  Decided to send it back because I did not want to have to send it off to have it repaired especially after only 22 days.  Nice while it lasted.  Will look at other tablets.  Hope this helps.", "Date": "May 7, 2013"}, {"Title": "An excellent tablet", "Author": "Gloria Gibbons", "ReviewID": "R8PZGA86ENFX8", "Overall": "5.0", "Content": "I love this tablet. I did much research before deciding to purchase this one. I have an Ipod and an Android phone so I am familiar with both operating systems. After much research, I opted to go with this tablet due to the extra ports which allowed for expanding the storage and the micro usb port which can allow for extra storage or the use of a wireless keyboard.The tablet is very responsive and the screen images are crisp and clear. The camera takes great pictures. I use my tablet for email, surfing the web and social media and the occasional game. I would recommend this to anyone desiring a tablet but not wanting to spend big bucks on those others.A very, very satisfied customer that is happy with her Android Tablet by Asus.", "Date": "May 29, 2013"}, {"Title": "Battery will not hold a charge", "Author": "Centers", "ReviewID": "R2P16UZBNPG10U", "Overall": "1.0", "Content": "I have had this tablet for about 5 months and the battery will not hold a charge. In my opinion a tablet is useless without good battery life and this one became useless.", "Date": "February 19, 2014"}, {"Title": "Stopped Charging", "Author": "ofdcwb", "ReviewID": "R1EX8H92NPK6N3", "Overall": "1.0", "Content": "Device worked great for 3 months, the stopped charging.  Bought another charger, nothing.  Not much for warranty fights, so just not trusting the product from this site.  Going to brick and mortar.", "Date": "January 30, 2014"}, {"Title": "Defective piece of junk! DON'T BUY!", "Author": "Michael R. Seiloff", "ReviewID": "R3V6CXDG0HW0JQ", "Overall": "1.0", "Content": "This product arrived Early as usual from Amazon. Seemed to boot up nicely once it was fully charged. Everything worked fine EXCEPT that it wouldn't Connect to the Internet even though it connected just fine to my Home Wifi ! Called ASUS Customer Service and spent an hour on phone with a Technician who offered to replace the Built-In Wireless card under warranty but I elected to return to Amazon for a full refund instead.Products should NOT be defective this bad right out of the box! I will NOT Buy this product again unless I have my hot hands on it and am convinced that the MOST IMPOrTANT PART of the whole damn thing is functioning! Bye-Bye ASUS", "Date": "September 27, 2013"}, {"Title": "loved the tablet, but had to return...", "Author": "Memaw 43", "ReviewID": "R3WULR0M07T6W", "Overall": "4.0", "Content": "Had to return this tablet due to the fact that the battery would not hold a full charge.  Did not purchase another one - got a different tablet, but when it worked is did great and would recommend.  Just so happen I got one that was defective, but that happens.", "Date": "July 25, 2013"}, {"Title": "Great tablet", "Author": "Brian", "ReviewID": "R1WHR2LHROAMNS", "Overall": "4.0", "Content": "I previously had an iPad 1 and also have an Android phone.  To replace the tablet, I really wanted to stick with Android even thought the iPad had a great app portfolio.  After agonizing over all of the available options and the wide differences in prices, I finally went with this tablet, with the worry that I had been far too cheap.  I am happy to report that after 2 weeks of heavy usage, this was definitely a good purchase.  I wish that the USB connection for charging was a little more robust, but otherwise I have zero complaints!  Definitely recommended.", "Date": "June 20, 2013"}, {"Title": "It is a good buy for the price", "Author": "taiab ragoo", "ReviewID": "ROTW2DX5A1IZX", "Overall": "4.0", "Content": "I spent guite a bit of time researching the different tablets available. Was interested in Samsung Galaxy tab when I came across the Asus Memo Pad. Comparing the specs of the memo pad I decided to go with it especially based on price. Had it about 3 weeks now and I think its worth the price and a really good buy.", "Date": "June 16, 2013"}, {"Title": "Best cost-benefit!", "Author": "alexandre", "ReviewID": "R3PZWB8DMSFFR4", "Overall": "5.0", "Content": "Already have a tf300 and bought this one as a b-day gift for my mom..she loved it!Basically it's the same hardware and I noticed  that the MeMO also works on the 5 ghz wifi band.Great bang for the buck....I highly recommend it!", "Date": "June 12, 2013"}, {"Title": "Great tablet at a great deal", "Author": "Josh Leger", "ReviewID": "RVO4NB4NORRQ1", "Overall": "5.0", "Content": "This was the most I could make for my money without buy a crappy unstable China tablet. It's worth the investment to buy an American brand. This has great specifications for it's low cost. Runs very fast and smooth, while also running better graphics games. Tegra is a great brand of GPU.", "Date": "June 10, 2013"}, {"Title": "Great tablet... Great price.", "Author": "Shawn C.", "ReviewID": "R2YJ6XARMASQW8", "Overall": "5.0", "Content": "Great, pad I love mine, beautiful graphics, cameras work well. I couldn't be more pleased.  And I can keep memory safe on a mini sdhc card", "Date": "April 20, 2014"}, {"Title": "Better - by far - than the ipad!", "Author": "Sheila Bench \"sheileeb\"", "ReviewID": "R1YO4O88RWY9TZ", "Overall": "5.0", "Content": "Disclaimer - I have children who love apple products, and have given me an iPod and a (used) iPad, so I'm fully accustomed to them, but I am NOT a fan of apple for reasons too numerous to go into here (one BIG reason is they FORCE you into buying a new product practically every year because they don't upgrade the os on their devices. It's iNSANITY!  I've read reviews for Asus that say \"for the money...\" and the money DOES matter, of course - but this tablet is one of the best AT ANY PRICE. I watched the sales and bought mine for $239.00 at Christmas. My friend had one, and I was beyond impressed by it. And now I am super impressed with the one I own! The screen is gorgeous - it is so bright and vivid. It holds a charge about 10x longer than the ipad - I seriously can work on it all day without recharging. There are some totally amazing apps that geniuses all over the world have shared on the android market, and most of them are free.  It loads and plays all of them like a charm. Movies, music, pictures, - everything has worked perfectly on this tablet.  I have had absolutely no issues with it, and I would buy another one in a heartbeat.", "Date": "April 17, 2014"}, {"Title": "ASUS home run", "Author": "Nathan", "ReviewID": "R1F10X0R31LNLZ", "Overall": "5.0", "Content": "I believe that ASUS hit a home run with the MeMo Pad.  It has a great IPS display with wide viewing angles (Almost HD quality in the dispaly); Strong battery life(The battery life is great, and it will run almost 9 hours straight on a single charge); Good camera with lots of features; The sound is great but the speakers would be better if they were front facing or on the side.", "Date": "April 15, 2014"}, {"Title": "Nice", "Author": "Laura \"Laura\"", "ReviewID": "R2SFYFLPWA4DTU", "Overall": "5.0", "Content": "Love it. I like it better than an IPad...it is lighter and easier to use. Would recommend it to anyone looking for a tablet that is good and not overly expensive.", "Date": "January 26, 2014"}, {"Title": "Christmas present for wife.", "Author": "Amazon Customer", "ReviewID": "R7MRE7MHMK5NR", "Overall": "5.0", "Content": "I had received one of these as a birthday present, and my wife had comented that she liked it , so, that is what she got.", "Date": "January 10, 2014"}, {"Title": "Very nice tablet for reading formatted PDF files", "Author": "Rodolfo Q. Z \"roqz\"", "ReviewID": "RCZKEHVZZI8FL", "Overall": "4.0", "Content": "I like to read a lot, and have a nice library of digital O'Reilly titles at hand to use when working, but I needed something to read offscreen as, I'm still hardwired in such away as I like to have the reference material off-screen. This tablet fits the bill for that and I have also used it to read comics and watch movies when traveling by plane.  However, I find the form factor a little too big for bedtime reading, but maybe that's because I got the ASUS Official Folio Keyboard Case and it feels very heavy for that.I would have preferred a few other extras, like better screen resolution (1080p) to have a more densely packed screen and a IPS panel, but I know I could get that for extra cash in other devices.", "Date": "January 8, 2014"}, {"Title": "Great tablet for the price", "Author": "Peter", "ReviewID": "R3K8IVHNBX79Z5", "Overall": "5.0", "Content": "This pad is really good.  Super fast processor and has a good amount of memory.  pretty much does what I need it to.", "Date": "January 7, 2014"}, {"Title": "Internet connection quit", "Author": "SRAMAZON", "ReviewID": "R1YH1GCCP8DSMX", "Overall": "3.0", "Content": "The wifi connection quit on it after a month, everything else works great and so did the internet till now. Tried a factory re -set and still not working? there is no replacement and i am able to get a refund and very happy with the service.", "Date": "January 5, 2014"}, {"Title": "Fast, responsive and priced right", "Author": "Rebecca L. Hoyle", "ReviewID": "R10CL5BLUWR5YM", "Overall": "5.0", "Content": "This tablet is fast and responsive. Price is phenomenal. My daughter uses it as a drawing tablet with sketchbook pro and it handles everything perfectly.", "Date": "January 4, 2014"}, {"Title": "Good for 1 month", "Author": "dxxldiva", "ReviewID": "R2HM2QBCETXK90", "Overall": "2.0", "Content": "Easy setup. Worked well for about 1 month and one day it wouldn't turn on.  I tried everything and nothing worked.  I contacted amazon and I sent it back. I purchased an 8inch samsung instead.  Amazon has great customer service that's why I gave 2 stars.", "Date": "January 1, 2014"}, {"Title": "Very nice tablet", "Author": "Peggy L. Lalonde", "ReviewID": "R18S412DGBRZSI", "Overall": "5.0", "Content": "I have only had this for 8 days but so far I am impressed.  Great screen quality, good battery life.  Nice size and very lightweight. Fast and has good sound quality.", "Date": "November 18, 2013"}, {"Title": "Caveat", "Author": "NH", "ReviewID": "R2RBZ7O9XIBYEY", "Overall": "2.0", "Content": "Returned for defective screen after a week. This is the 2nd ASUS product in a row that I've returned for the exact same defect -- the other was a laptop. I'm done with ASUS.", "Date": "November 14, 2013"}, {"Title": "ASUS Memo Pad", "Author": "dtv65", "ReviewID": "RJ4V81O68LTEA", "Overall": "5.0", "Content": "My daughter loves ASUS.  Very happy with her gift!  Portable and convenient to use, especially in conjunction with GIMP program.", "Date": "November 13, 2013"}, {"Title": "ASUS Memo Pad Exceeds Expectations", "Author": "Timothy Pierson", "ReviewID": "R9BDW30H9D1PA", "Overall": "5.0", "Content": "Performs and has many very usable functions.  I am very pleased with this product especially for the price.  I would really recommend it.", "Date": "November 8, 2013"}, {"Title": "Asus Memo 10 smart tablet", "Author": "hobart57", "ReviewID": "RJ2ZCWWXCPZOU", "Overall": "5.0", "Content": "Memo 10 smart pad l love asus product's also. I buy a lot of there product's. I buy there motherboards for my builds.", "Date": "November 7, 2013"}, {"Title": "Great", "Author": "Luis G.", "ReviewID": "R2V47VTVKJILA4", "Overall": "5.0", "Content": "Most powerful tablet for the price! Fantastic display! I have purchased 2 of these as gift and i received nothing but positive feedback.", "Date": "November 7, 2013"}, {"Title": "Not a Purchase You will regret", "Author": "RZA390", "ReviewID": "RMBTNC3CCJD3W", "Overall": "5.0", "Content": "I bought the Asus MeMo SmartPad as a replacement of another brand tablet that malfunctioned so I waited a while to write this review. I've had this for over 5 months and I love this. Here's the reason why:1) I am maxed (full 16 gb internal and 16gb Sd card) and still runs efficient. I have movies, music, books, and a lot of apps but it doesn't seem to bother it.2) google play market compatible - great variety of free apps, low cost music and movies before coming out on DVD3) take great rear camera pictures. Quality compared to my iPhone 4 pictures is better. 5megapixels may seem low but perfect for up to 5x7 prints and doesn't take up too much memory.  Front facing not bad when there is a lot of light but grainy when lighting is bad. No flash on rear but doesn't require too much lighting.4) easy to link to wifi first time and automatic if saved. Unlike some electronics, it may say it's locating wifi signal when saved and trying to link. I go from house to house and linking to wifi is seemless that I forget I have to do some work when I go somewhere new.5) even for 10 inches, compact and light. I carry tablet everywhere. So convenient.6) accessories made specific to this tablet. Not mainstream like a samsung galaxy or iPad so not as expensive but not generic where you gamble when you buy accessories. The accessories bought fit perfect. The case and the screen protector do not block any of the buttons, camera or \"outlets\" (charger, headphones, etc)I will review the accessories separately.7) doesn't take an expert to use. I taught my mom how to use and she doesn't even know how to answer a phone call on a smartphone. My 3 year old twin nephews are also able to use no problem.8) able to watch movies from Flixster, Netflix, SD card and Google play. No internet needed, except for Netflix.9) can transfer music from iTunes to this tab with no problems. Also vice versa.10) asus specific apps are interesting.  I don't use the webstorage since I already have google drive, but I like how the asus album and art.I haven't found a negative worth mentioning yet and unless you are a brand name shopper, you will be happy with this purchase. Best 10.1 inch tablet out there for the price. I know a samsung galaxy 10 owner and he said that the tablet is comparable. Only major difference is Hd and the appearance of some icons other than that, he said it actually runs better. I know iPad owners and they were impressed. Just some image differences and iPad did run a lil faster, but other than that, they definitely said they would purchase this instead of a samsung if they wanted an android tab.", "Date": "October 28, 2013"}, {"Title": "Excellent replacement for my netbook", "Author": "mschowell \"mschowell\"", "ReviewID": "R6Y2MLS11GZDN", "Overall": "5.0", "Content": "When my little ASUS netbook had slowed down to the point I felt like I was on a dial-up line, I purchased this tablet and a keyboard cover as a replacement. I couldn't be happier with this purchase, and I'm delighted that this new ASUS product lives up to and actually exceeds my expectations. The tablet is primarily used when I travel, or as an emergency back-up when my middle-aged desktop is having problems. The response time is plenty fast, and the battery life has exceeded 8 hours with life to spare. It's a bit heavier than my netbook was, but I won't quibble over a few ounces. And the keyboard is a definite improvement over the netbook, as it seems to be close to full size.  My only significant complaint is the miserable documentation that comes with the tablet and with the keyboard. Downloading the manual was pretty much a waste of time. However, information available on the Web and from the reviewers at Amazon filled in most of the blanks, and general information on the care and feeding of Android tablets took care of the rest. For a newbie to this non-Windows world, research time was fairly extensive, but the payoff was worth it. A second complaint is the lack of USB ports on the device, but the purchase of an inexpensive OTG cable to convert the micro USB to a regular sized USB took care of most of my needs. And also, I bought an inexpensive 6 foot cable to use with the charger as the one supplied was too short for many situations. Last complaint is that the light that displays when charging the tablet is obscured when the tablet is in the keyboard case, so I cannot get a quick view of whether the device is yet fully charged. Not a big deal, but an annoying flaw in the design.", "Date": "October 26, 2013"}, {"Title": "works great with no complaints so far.", "Author": "Rob Romero \"texas4rob\"", "ReviewID": "R3SCCQIGW73F47", "Overall": "5.0", "Content": "Works good and havent had any problems so far. The cameras work really well for a tablet and i think it loads web pages pretty fast. If I could only get it back from my daughter now i'd be doing great....", "Date": "October 25, 2013"}, {"Title": "Great performance", "Author": "Jahziel", "ReviewID": "RM9YOFSAXYZAN", "Overall": "4.0", "Content": "It is my first Tab, and until now I have nothing bad to say about it. Great product. Totally recomended", "Date": "October 15, 2013"}, {"Title": "Excellent tablet for a good price.", "Author": "Camielle", "ReviewID": "R1R1HLG4ABOVWX", "Overall": "5.0", "Content": "With the exception of the lack of Adobe Flash, The Asus MeMO Pad Smart is an excellent tablet. I barely changed any of the default settings I liked it out of the box.", "Date": "September 23, 2013"}, {"Title": "Value for money", "Author": "Vinod", "ReviewID": "R2D090DUL6ICZW", "Overall": "4.0", "Content": "I did a lot of research before buying this tab. The first couple of weeks I wanted to return this tab as it was laggy and touch response was really bad. But to my surprise the performance of the tab started getting better day by day. Now I hardly notice any lags and the touch response is really good now. I don't know whats the reason though but now am happy with the tab. One disappointing factor in this tab is that the camera is very mediocre and however this wasn't the deal breaker for me. The picture clarity is not that great when compared to iPad or Nexus 7 and that is totally justifiable at this price point. Overall I recommend people to go for this tablet.", "Date": "September 23, 2013"}, {"Title": "there are no words", "Author": "Kaytee", "ReviewID": "R3G58ISYO5V786", "Overall": "5.0", "Content": "There are no words for how amazing and in love i am with this!!! As i type this review from my tablet, i am so happy to have it. I got it at a back to school present and its amazing. Im a pre-med student and im so happy to have this as a study buddy. The camera is amazing and the sleek look of it makes me really happy.", "Date": "September 21, 2013"}, {"Title": "Great for what i use it for!", "Author": "Nick", "ReviewID": "R1EU930DI6J4RV", "Overall": "5.0", "Content": "I got this tablet for multiple uses and its great for all I use it for.  I am an aviation enthusiast and plan to become a private pilot in a few years and this is great for viewing aeronautical charts with clarity.  Also its great for playing games on along with surfing the web and everything like that.  Youtube works great on it, and so does Netflix.  However adobe flash player can be buggy at times (watching videos through Google Chrome) on it.  Battery life is great and even better if you have an app call Juice Defender.  I got mine to last 36 hours no charge before it died on me.Tips: If you like to listen to music and watch videos, I suggest getting a Micro SD card for in.  I recommend a SanDisk 32GB card.Other great things about it: If you get a micro USB to female USB plug in cord, you can connect up a lot of things like a USB flash drive, Wired Xbox 360 controller (GTA III!!!) and some other things.", "Date": "September 16, 2013"}, {"Title": "awesome", "Author": "cozmic", "ReviewID": "R33KILQP5NL56V", "Overall": "5.0", "Content": "what I was looking for. will tell my friends when searching for items to always always always check amazon first.", "Date": "September 15, 2013"}, {"Title": "Better", "Author": "Amazon Customer", "ReviewID": "R19UIVUW153N0C", "Overall": "4.0", "Content": "I like that the video viewing is better than the previous tablet; brighter. The touch screen response is sometime slow.", "Date": "September 12, 2013"}, {"Title": "Good device", "Author": "Assaf Hallak", "ReviewID": "RWPBAMUD48H77", "Overall": "5.0", "Content": "Good size in practice, but a bit problematic to find good case for. Fast, easy to use and good looking.", "Date": "September 10, 2013"}, {"Title": "Love It!!!!!!!", "Author": "CYNTHIA MARTIN", "ReviewID": "R2WEJVT9GA4JXW", "Overall": "5.0", "Content": "Bought this as a gift for my husband - I like it more than my own but he won't trade with me....", "Date": "September 9, 2013"}, {"Title": "Awesome Notepad", "Author": "Gaston Cornwell", "ReviewID": "RM34VWKX2VS70", "Overall": "5.0", "Content": "Very fast, updated to android 4.2, using a 32gb sd card inside, screen is a bit glary but I can live with it. Speakers do ok. Very nice and responsive screen, great brightness and color.", "Date": "September 3, 2013"}, {"Title": "Great tablet for that price", "Author": "R. Sanchez Bosque", "ReviewID": "R2Q9R38NWS6YPH", "Overall": "5.0", "Content": "Brilliant collors, fast response, good deal considering features such as screen size, weight, memory sd capable & of course price.", "Date": "August 30, 2013"}, {"Title": "Love it!", "Author": "BarbT \"batj\"", "ReviewID": "ROQLTX0355XGA", "Overall": "5.0", "Content": "I love it even as I am typing this in to brag on it! It hs well exceeded all of my expectations for a great tablet!", "Date": "July 7, 2013"}, {"Title": "Tablet does not have a flash for the camera", "Author": "C. Barker", "ReviewID": "R29I8XWGJ0F0KU", "Overall": "4.0", "Content": "I bought this tablet for my wife as a birthday present. One of the reasons I bought this tablet is Amazons description lists it has a flash for the rear camera. I was quite disappointed to find out it doesn't. Other than that my wife seems to really enjoy the tablet, but I might have went with the Asus TF700 model that does have a flash.Update: Spoke on the phone with Amazon regarding the description. They gave me a discount on the tablet and said they would correct the description regarding the flash. As usual Amazon customer service is great. The tablet still takes low quality pictures but other than that is a great tablet.", "Date": "March 8, 2013"}, {"Title": "Luxury tablet at a moderate price", "Author": "Amazon Customer \"cher\"", "ReviewID": "R7CF86RYD6WSQ", "Overall": "5.0", "Content": "This tablet is great, especially the long-life battery.  Visual clarity is good, too, and its performance is very good, noticeably better than my earlier cheaper tablet of a different brand.", "Date": "March 9, 2014"}, {"Title": "awful", "Author": "Amanda Griswold", "ReviewID": "R22SIKJGE7K5WB", "Overall": "1.0", "Content": "Worst product ever!!!!!!!! The screen cracked in 10 hours then continued to crack where the screen no longer worked so disappointing", "Date": "September 14, 2013"}, {"Title": "Died on the second day of use", "Author": "Vladimir Osipenko", "ReviewID": "R33FGI4SKRO7X0", "Overall": "1.0", "Content": "I got this tablet on Saturday.It was working fine.Overall quality of product was not something exciting but it was ok for the price.But next day Sunday tablet didn't start.i was not able to switch it on.I returned item.", "Date": "September 12, 2013"}, {"Title": "Bummer, power switch requires a reset to get it to work", "Author": "Robert F. Hardy III", "ReviewID": "R15FPA8919G02Q", "Overall": "1.0", "Content": "Well, the wife deserved a better tablet rather than her ancient Kindle.  We thought this was a good tablet and had great value.  After her using it lightly to play Word with Friends, some light surfing, the unit wouldn't turn on.  This started after owning it a week. Charged it up, still had to use the reset feature. She had to use a paper clip and reset it to get it to come on.  It keeps this cycle going every day or so.  I need to contact ASUS.  Not looking forward to the result :(  Thank goodness I purchased the extended warranty from WalMart.", "Date": "August 30, 2013"}, {"Title": "Unreliable battery and or charger", "Author": "D. Mccaslin \"Duped\"", "ReviewID": "RH35GP3J0UV4W", "Overall": "1.0", "Content": "Worked great for two months. Tried to charge for about 45 min. and I picked up tablet and it was HOT ! The charge would not go above 11 % . I let it cool and had a hard time getting it to start up.Connected the charger again and it started up, charged it and it worked  fine a couple weeks then same thing again only got up to 41 % and the connection to tablet was hot. Called support and returned. Waiting for their reply.", "Date": "August 29, 2013"}, {"Title": "My PC Replacement Experiment", "Author": "Dryphtyr", "ReviewID": "RFH26TSR24F3K", "Overall": "5.0", "Content": "I bought a well spec'd laptop a couple weeks ago. In a nutshell, I hated Windows 8. I've been using Android phones for a few years now & I thought the OS has come far enough that if I put in a little effort, I could completely replace the PC. I took the laptop back & bought the MemoPad. I also got the matching KB/case, an OTG cable & a \"Plugable\" USB powered hub. I'm typing this review using the BT keyboard right now. I have my Logitech USB mouse plugged into the hub & am streaming music from my external USB HDD via BT to my home theater receiver. If I can accomplish all that simultaneously on a tablet, I can definitely live without a PC. All I have to do is pick up a Wifi printer & I'll be set. Sure, it won't play CD's, but I haven't used those in a long time anyway. The best part is I can unplug the OTG cable, close it up & take it with me, as easily as my phone. I don't have to carry the charger or any accessories with me, so it's not cumbersome like my old laptop was. Android hasn't been around as long as the competition, so it still has it's quirks & bugs, but considering the cost & overall convenience, it's worth it for me. So far, mission accomplished. I am living a completely Microsoft & Apple free lifestyle & my total investment was less than half of what the returned laptop was. The next step will be to root it & start checking out the alternative ROM's for it. If I have any updates, I will post follow-ups.", "Date": "August 17, 2013"}, {"Title": "Great for my use.", "Author": "lordofllama", "ReviewID": "R9IG94HDF9013", "Overall": "4.0", "Content": "I plan on using my tablet for reading comics and taking notes in class so I don't have to move my giant laptop. It is light and portable the whole point of a tablet. The touch screen is responsive and clear. I read a few reviews of people saying the back feels cheap, I have no idea where that is coming from. I love the OS once i watched a  2 minute tutorial I felt like pro.The goodExpandable memorymicro USB port (what most cell phones use to charge)google marketAll the things i wanted from a tabletThe badBattery is not amazingAsus did not make a key board attachment for it (It a tablet but I am still not use to touch screens yet)", "Date": "July 17, 2013"}, {"Title": "Unhappy with ASUS customer support", "Author": "John \"John\"", "ReviewID": "R1N44SWG043458", "Overall": "1.0", "Content": "I don't generally write reviews unless I really love a product or have an especially poor experience with the manufacturer. Unfortunately this review is the latter.  I purchased the MeMo Pad 10 at walmart.com with a protection plan. When I received the tablet it had a small mark near the corner of the screen new out of the box. This mark began to travel several days later and I realized it was a crack. I called Wal-Mart who reported I needed to call ASUS as it occurred prior to delivery. When I called ASUS they told me that they would repair the unit but would assume it was user incurred and I would be charged. I told them this made absolutely no since as I also have a protection plan and would have nothing to gain by lying to them about this issue. They suggested I use the protection plan. I was able to call and explain the whole situation to Wal-Mart who agreed to fix the tablet even though it did not fit the terms of their agreement. I didn't think too much of this until I came across similar reviews about ASUS products including this tablet arriving faulty with cracked glass, nonworking usb ports and so on. This will happen no matter what product you buy but I am surprised to see that the response to these all experiences was: we assume you did it and you will be charged, even after being sent to them by a distributor that sold the product with a protection plan.  I could see this if you call a month after purchase with no protection plan or a customer had some sort of prior incident. I was very lucky to have the protection plan as I almost never buy them.  The tablet itself would receive 5 stars, but as you purchase the customer service as part of the product I wanted others to be aware that you may run into a brick wall with ASUS if your tablet arrives with a defect when shipped. I would try to find one locally that can be inspected prior to purchase or spend the extra $30 bucks for the 2 year protection at Wal-Mart. I myself find this to be very poor service and will consider this in the future when considering ASUS products next to other makers. I have owned other ASUS products and knew they pay attention to detail and made great products but had never needed to contact their service. I guess the days of the customer is always right is gone. Don't even get an I'm sorry you had a problem these days. Makes the consumer feel pretty insignificant. It is likely due to customers that take advantage of companies which is sad but non the less I am disappointed in ASUS.  As for the tablet I couldn't be much happier. Can't find a better deal for a tablet with USB, Micro SD, front and back cameras, GPS, HDMI from a name brand. I don't like being locked into apples products and software offerings, cables and inability to expand memory and this product solves those issues. I purchased a few devices that were much less expensive including the DOPO 10\" tablet but gave up after using their unstable systems that constantly cause crashes. My multitouch screen works flawlessly and the speakers produce sound that really, really surprised me.  The Android system seems to run very stable and I do not get the crashes I did with other devices. The processor has kept up with every game I have thrown at it. For those that want flash it can be side loaded. Just use the browser to search for flash. Find a .apk file, download it and you will be prompted to install. They seem to update frequently which is encouraging. You should have no memory problems with the expandability of sd cards, usb thumb drives and external hard drives. Only real minus in function was all the soft/blurry pictures if not outdoors. I suppose the is the case with most tablets but a flash would really help. It does just about everything I wanted in a tablet and I'm sure much much more. I would highly recommend the tablet itself with the caution of understanding ASUS will likely not be understanding if your product arrives damaged.", "Date": "July 9, 2013"}, {"Title": "This is a great tablet!", "Author": "Jack M. Webb, Jr. \"jack\"", "ReviewID": "R1HBPMB1HA6RDH", "Overall": "5.0", "Content": "I was leery of buying an Android tablet. I did a lot of research before making my decision on the Asus and other top brands and I am so happy with my decision. It is a magnificent piece of technology.", "Date": "May 31, 2013"}, {"Title": "So far so good", "Author": "livinginlv", "ReviewID": "R2DSH2HM0OAEX1", "Overall": "5.0", "Content": "Actually it's great so far.  This is a great product at a great price based on comparisons for a week before choosing this one.", "Date": "May 23, 2013"}, {"Title": "Nice tablet", "Author": "PH Bible Student", "ReviewID": "R259133Y32GWN1", "Overall": "4.0", "Content": "I bought this for my 5-yr-old boys to use YouTube and other apps. It has all the functionality they need and is easy for them to operate. I even like it myself--the video camera is good, Internet browsing is good. After using a nonexpandable IPad2, I absolutely love having the micro-SD card (though it seems limited to 32gb maximum; my Samsung 64GB Class 10 UHS-1 Grade 1 70MB/s MicroSDXC Pro Memory Card with Komputerbay SD Adapter doesn't work with it). Overall the IPad2 has some advantages and it has a more solid feel, but when you put the tablets into a leather case (e.g., Blurex Folio Cover for the Asus MeMo Pad Smart ME301T) the build quality differences aren't noticeable. Small text isn't as nice as you would see with an IPad retina display, but regular sized text is more than adequate. For the price, I'm glad I bought it.", "Date": "April 2, 2013"}, {"Title": "Fragile", "Author": "Amazon Customer", "ReviewID": "RA9TVXCL6RE2M", "Overall": "1.0", "Content": "This may be the most powerful tablet, but I am unable to verify.  The glass broke after one week.  I have had an Acer tablet for a year without any issue.", "Date": "October 2, 2013"}, {"Title": "works for 2 weeks", "Author": "Irina Marhai", "ReviewID": "R1NBX7VXCYV6X2", "Overall": "1.0", "Content": "worked for 2 weeks, and then just couldnt connect to internet, tablet would see wi-fi but would not connect to it. had to return it back", "Date": "October 1, 2013"}, {"Title": "Cool", "Author": "Chad Thomas", "ReviewID": "R232D8VI3HL13W", "Overall": "5.0", "Content": "Works good, pretty fast. I like it I'm only writing this review so that I can add it to my owned items list on Amazon. I think I have 20 words now.", "Date": "June 6, 2013"}, {"Title": "Beats the Ipad", "Author": "Dr.Roland", "ReviewID": "R1ML11APL7IJRF", "Overall": "5.0", "Content": "This is a very nice tablet.  Screen is very good, speed is awesome, graphics are impressive.  Only thing is prime videos don't work till you get the flash workaround, look on youtube.  But xfinity app works just fine.  I got the keyboard bluetooth Sharkk for cheap, and it works just great!  Light, and awesome sound, takes a bit to charge up though, and the kids will drain all the power in a few hours playing games, and youtube (which looks awesome on the screen).  Very happy with it, and a very fair price too.", "Date": "April 5, 2013"}, {"Title": "Cracked Easily", "Author": "Dani", "ReviewID": "R235JA023TH409", "Overall": "1.0", "Content": "Thin plastic construction is total garbage. Lasted 3 months before I noticed a small crack on the screen. I don't think I abused it or hit it hard or anything. Two days of normal use later the crack now stretches across the screen. The tablet is now useless and I'm out $300 because someone saved 10 cents a unit by using this cheap plastic casing.", "Date": "June 9, 2013"}, {"Title": "warning !!!", "Author": "Gary", "ReviewID": "R2W4UMG51NF923", "Overall": "1.0", "Content": "my heart is broken, i lost two years of personal pics from the micro sd card.  this tablet has the sd card slot on the outside of the tab,, my card popped out .since its on the outside with no protection it just popped out never found,,,gone forever with two years of photos.  words cant say how crushed iam.", "Date": "May 24, 2014"}, {"Title": "Frustated", "Author": "Mary Duncan", "ReviewID": "R31WUGZK1Y5639", "Overall": "1.0", "Content": "I BOUGHT THIS PRODUCT BASED ON A SATISFIED CUSTOMER. However, when we tried to operate it, it had someone else's information.in it. It is obviously a returned  item that was shipped to me.  Just try to find a place to complain.", "Date": "May 14, 2014"}, {"Title": "Do Not Buy!", "Author": "Craig  Skvoretz", "ReviewID": "R188EYOQCPIFPI", "Overall": "1.0", "Content": "Tablet's wifi broke after 3 months of use.  Cannot connect to any wifi.  Tried rebooting and resetting, still didn't work.  DO NOT BUY.  A couple weeks after this, I now have a lot of dead pixels, with no drop or anything.  Its just one problem after another.  Better not be anymore.", "Date": "October 26, 2013"}, {"Title": "first tab? then its not bad", "Author": "Toph", "ReviewID": "R25H575VSUN2WT", "Overall": "3.0", "Content": "Bought this because i did not want to give into the iPad pricing. Truth is it is worth it (to me) to go with apple.  The build quality gets a 7/10,the rear case feels like cheap plastic. Functionality 6/10, droid firmware has some quirks that make it difficult from time to time, it could be smoother. Performance 7/10, it is not completely smooth in apps and web surfing, occasional freeze and lag, the scrolling is not apple smooth either 8/10. graphics are decent, not retina quality but still nice 8.5/10.  The speakers are loud, although did create a vibration in the cheap body (annoying at loud volume). They are not particularly clear either as they are projecting from behind the plastic case and dont havea a clear exit from the unit.  Since they project backward audio is always louder for the people behind you then it is for you.The horrible smart text does not spell check the simpke (simple) words need or auto insert spaces, rather the only occasional fix does not make any sense.  Example the word exacte, or exact rather.  It always auto insets the first TWO letters of every sentence with caps. Oh and if you backspace to make a correction (and there are many) then it will merge the word with the one before it.  This one thing gets a 3/10 because it slows you down so much and typing is half the .  My experiance the iPad g2 was worlds better and I am making the trip back to exchange this tomorrow.MIght work for some, just not my cup of tea, i like the user experiance that only iPad provides right now. If i never owned better im sure i would like this much more", "Date": "November 8, 2013"}, {"Title": "Likes to crash", "Author": "Caleb Sayers", "ReviewID": "R2KYS3CRUY9EJD", "Overall": "2.0", "Content": "I've had this Tablet for just over six months, and while I love the Android operating system, this tablet just doesn't cut it. It crashes constantly. At first it did it very rarely, but it has become more and more prevalent. I haven't installed very many apps on this, and the apps that I have, are trusted, such as ones created by Google Inc., Facebook, Spotify, Twitter, etc. Usually the Tablet just crashes and restarts when you're just on the main screen. Now the lock button has stopped working and takes a lot of pressing to get it working, just so I can use the tablet. I plan on using my warranty that I bought with this tablet, in hopes that the next one will run better. I would not recommend buying this.", "Date": "September 21, 2013"}, {"Title": "memo pad", "Author": "G. bakka", "ReviewID": "R2ELHAOADXCP75", "Overall": "2.0", "Content": "over all ok I guess its the first tablet so nothing to compare it too.its allot slower than I thought it would beso haven't really used it in the two weeks of owning it", "Date": "September 7, 2013"}, {"Title": "Just what I was looking for in a 10 inch", "Author": "WestCoast46", "ReviewID": "RIS6JR6RVWIF3", "Overall": "5.0", "Content": "This tablet has everything I was looking for in a 10 inch tablet. I was not trying to break the bank, and this tablet fit the bill great. I received the Jelly Bean 4.2 update from ASUS, and it functions just like my Nexus 7. All my other tablets, \"IPAD, Nexus 7, Nook, and Amazon E- Reader,\" accepted it with open arms. If you want to see what all this puppy can do from an unbiased review follow the link to see all specs and highlights of this tablet.Follow the link or copy and paste in your browser.  Look at the video at the bottom of the page.[..]?Number=44326", "Date": "April 22, 2013"}, {"Title": "amazing 5 start tablet but...", "Author": "JLG", "ReviewID": "R213XQESSC1FIE", "Overall": "4.0", "Content": "Wow for the price this is an AMAZING tablet.  Faster than an ipad.  easy to root.  I had alot of issues upodating to 4.2.1, and i am an experienced android user...so that is why 4 stars --but it really deserves 5", "Date": "May 25, 2013"}, {"Title": "Nice, but so - so Quality Control", "Author": "TNM2841", "ReviewID": "R3TY8A1OCSM0IF", "Overall": "3.0", "Content": "Received the tablet as advertized, however my tablet was defective (one of the speakers didn't work, which along with the micro USB was one of the reasons I bought this tablet over the Transformer that is the same price), contacted ASUS, they were... somewhat helpful, I don't know that their tech support guys know this tablet exists yet, they thought I had the 7\" model, which as far as I know isn't available in the US yet. Anyhow they wanted me to send it in for \"repair\" lol no, I'm not gonna spend $300, which while not expensive for a tablet is still quite a lot of money for me, and end up with a repaired unit. So I contacted the seller ABT Electronics and they are going to exchange it for a new one. I sent my tablet off a few days ago and its in transit to the seller, I expect quick turn around and hopefully will have my new, fully functional tablet by the beginning of next week.While I had the tablet it seems quite fast and responsive, it was thinner and lighter than I thought it would be based on some reviews on other sites that called it \"bulky\", its quite slim and light. Played videos with little lag and in good quality, web browsing was pretty responsive and on the whole I was pretty impressed, this is a pretty solid first tablet... if you get one that works.", "Date": "April 1, 2013"}, {"Title": "Android Tablet Limited", "Author": "Denius", "ReviewID": "R2LQWH59WBROYJ", "Overall": "2.0", "Content": "I just spent time composing a review and then the tablet shut me out in the middle, went to home screen, could not bring the review back up only a brand new version of the page....this is a majorly defective machine.  Always shutting down or flipping our of the screen.  And having to hit a button then the stupid padlock icon.Whats with the padlock, my cat could swipe that (If I had one)Yes display and sound is good  but use of the tablet is limited.  Perhaps that applies to all android tablets.No Flash video available, a lot of material I cannot view.Thank goodness I spent good buck$ for the keyboard and case, makes it a bit more functional.  But no easy way to print  so limited like that.  Tho the case makes the mediocre camera hard to use;  anyway the display is barely visible in outdoor light so cant use it(the camera) much.  Gotta rush before it shuts me out again, no chance to check for typos.Next time I'd buy a laptop/notebook.Cnt even use it with my projector, major reason for getting a tablet without another special device, since plugging in HDMI cuts off the audio.", "Date": "January 1, 2014"}, {"Title": "My touch screen not working", "Author": "Chintan", "ReviewID": "R20NHYDG2G2LRZ", "Overall": "1.0", "Content": "I bought it on 3rd july and i gifted to my GF in India.When she checked it touch was not working.. How one can sell me Faulty Piece....", "Date": "July 25, 2013"}, {"Title": "Had The Tablet Less Than a Day and It Overheated On Me", "Author": "D. Huynh", "ReviewID": "R2X49Q3GCG6KH2", "Overall": "1.0", "Content": "Specs and other info can be found in other reviews, I am just writing about my own personal experience with the tablet.I was looking for a nice 10\" tablet for my mom.  I already own a Nexus 7 myself and with similar internal specs and os (even though it's not the latest version) I was fairly confident I could show her how to use it in no time.The initial setup of the device went without a hitch.  After a couple of hours in, I tested the Skype app with it.  I couldn't get the video to show, so I did what I did on my nexus 7, I downloaded the camera launcher app on the meMo pad 10.  This is how I got the camera to work on my nexus 7, so I thought it might get it to work here as well.Well, after the call went through, the meMo pad 10 screen turned white and made an extremely loud buzzing noise.  I powered it down just to get it to stop.  After that, I was not able to power it back up.  Also, the tablet was extremely hot, especially near the speakers on the back.  There was a definite burning smell emitting from the tablet.It's a shame because I really wanted to love this device.  I contacted Amazon Support via phone and they walked me through the process of returning the tablet.  The rep was friendly and apologize for the issue and told me that he would send another one out right away and I should receive it in a couple of days.  I hesitated at first, but agreed.After getting off the phone with the rep, I realize that if this happened once, it's could happen again (maybe a slim chance, but I didn't want to risk it).  So, I went online and was able to cancel the new order.When the tablet was working for the hour or so that I had it, it was quite nice.  Asus is a great company but this product did not live up to my expectation.", "Date": "March 20, 2013"}], "ProductInfo": {"Price": "$299.00", "Features": "Android 4.1 Jelly Bean, 10.1 inches Display\nNVIDIA Tegra 3.0 1.2 GHz\n16 GB Flash Memory, 1 GB RAM Memory\n8.5-hour battery life, 1.28 pounds", "Name": "ASUS ME301T-A1-WH 10.1-Inch 16GB Tablet (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/31Wmn60DgYL._SX300_.jpg", "ProductID": "B00BJ8I7P2"}}