{"Reviews": [{"Author": "Jodi D. Gilroy", "ReviewID": "RWHM7PSXLIR2V", "Overall": "4.0", "Content": "I do like this tablet I just wish it would come with a little more information about the apps that are on it and I wish it had a camera on the back. But it is a good starter tablet for someone who is just learning.", "Title": "Good 1st One", "Date": "November 15, 2013"}, {"Author": "LAshandra Morris", "ReviewID": "R16TZJY10RISRU", "Overall": "4.0", "Content": "I really appreciate how quickly and how easy it was to return and receive the new visual land tablet and to return the defective one . My daughter really enjoys her tablet .", "Title": "Visual land Tablet", "Date": "November 7, 2013"}, {"Author": "Jennifer Rae Hurley", "ReviewID": "REFNEYBF68RSZ", "Overall": "3.0", "Content": "It is OK you just can't download games good. It doesn't have Google play and the program it has isn't any good. It is a Android system with no Google play.", "Title": "It's ok!", "Date": "August 18, 2013"}, {"Author": "Simon H", "ReviewID": "R2FDN02YV8TXB2", "Overall": "5.0", "Content": "I got one and then everyone else asked me about it and wanted to try it and then they asked me to get them one. So far I have got 4 of them in diffrent colors for freinds. Its very good if you want to surf the net do emails watch youtube etc For the pirce its great value.", "Title": "This is my 4th one I  LOVE IT", "Date": "October 29, 2013"}, {"Author": "L. Allen", "ReviewID": "R2726AA4FTD7X6", "Overall": "1.0", "Content": "I purchased this tablet because it stated that it had flash installed on it. Received it, thought it was great at first until none of the websites with flash would work. Checked and found out that no flash was installed and I couldn't do anything to install flash. Big disappointment. Thankfully, Amazon has a good return policy and I was able to return it.", "Title": "Maybe mine was defective?", "Date": "October 22, 2013"}, {"Author": "Tamika Woodson", "ReviewID": "R3H74TC9KA5WO9", "Overall": "3.0", "Content": "I ordered this on Tuesday, received it on Thursday which was great. I bought this to take with me when I travel out of town so I don't have to hall my laptop with me. Anyway, I fully charged it before I began to add my favorite apps and it's a bit slow to me. I have been using my smartphone for internet access until my new laptop was delivered since my old one was stolen. My phone is faster using the same WI-FI so I'm not to thrilled. I will use this and test it out over the weekend and see how it goes. Pros: It's not bad for the price and screen size is great. I got this about $8 cheaper than Walmart. Cons: I can't figure out how to log out of my Yahoo email and I couldn't log into My Fitness Pal app using my Facebook account, I kept getting error and had to log in using password.", "Title": "A bit slow", "Date": "October 18, 2013"}, {"Author": "Haley Fosdick", "ReviewID": "R1849IF2ORW6P8", "Overall": "4.0", "Content": "I would recommend this product for younger kids, I would not recommend this product for older adults trying to play games.", "Title": "It works great!  Have not had a problem with the tablet!", "Date": "April 13, 2013"}, {"Author": "judy baldwin", "ReviewID": "RC6V9LKB7S4PA", "Overall": "3.0", "Content": "Its okay for the money. Had trouble with some apps. Cannot get some apps that I wanted. I am a little disappointed.", "Title": "ok", "Date": "March 25, 2013"}, {"Author": "C. Playle", "ReviewID": "RKHTAFJGRTSZD", "Overall": "2.0", "Content": "Bought this tablet to use as an interactive display in an exhibit.  From the start there were problems with it.  The battery is rated as up to 8 hours…it may be lasts 2 hours before it needs charged.  The touch screen frequently does not recognize the user’s tapping even when a hard tap or press is used.  It has also frozen occasionally and not recognized the user’s taps but will pop up notifications on its own.  Would not recommend this tablet.", "Title": "Not worth time", "Date": "June 9, 2014"}, {"Author": "Darlene Pavek", "ReviewID": "R7IMRK7XPXA8C", "Overall": "3.0", "Content": "Don't have bluetooth and can't get google apps. It does have a nice size screen. I can't get it to play netflix.", "Title": "its ok", "Date": "December 20, 2013"}, {"Author": "dana williams", "ReviewID": "R376DE9Q5TIBYF", "Overall": "1.0", "Content": "Very very slow and actually didn't work correctly. The Wi fif would not stay on. Sent it back. Wont buy visual land again", "Title": "Sent back", "Date": "December 18, 2013"}, {"Author": "Yaa", "ReviewID": "RW19G9I9ADLXX", "Overall": "2.0", "Content": "it keeps freezing!i dont know if i should struggle to return it or what!its not fair i think i should get a refund and keep the tablet.", "Title": "what did i buy smh", "Date": "December 15, 2013"}, {"Author": "Laura I. Francis \"lilezkimo\"", "ReviewID": "R2WX085TMOWN0C", "Overall": "1.0", "Content": "I bought this for my daughter and I was just trying to preload games on it so when she opens it on Christmas she can play right away. I couldn't get the proprietary App Store to load all the games. I keep getting a parcel error. The App Store shuts down. The apps, like Cut the rope, which works just fine on every other device wouldn't even load on this tablet.If you bought this on a Black Friday sale, check it before you give it as a gift. You loved one may be disappointed.I have already emailed amazon for a return.", "Title": "Shuts down frequently and lags", "Date": "December 7, 2013"}, {"Author": "Andrea Evans", "ReviewID": "RBLAJMC38R5JY", "Overall": "5.0", "Content": "Bought this for my son, and he loves it! He really likes the large screen. It was exactly what he wanted!", "Title": "My son loves his tablet!", "Date": "December 2, 2013"}, {"Author": "chayes", "ReviewID": "R2ISBRYH6T3LIN", "Overall": "5.0", "Content": "I love my tablet!  Frankly, I've never heard of this brand and right now I don't care.  I found it via an e-mail advertising Labor Day sale items through Amazon.  It was a bit rough for me to pay the $80.00; but I'm not sorry that I did.I did have some trouble in the beginning getting the games etc. loaded as neither the Amazon or Visual Land directions worked to get an app. in the device; but I can usually figure out where and how to find apps. now.  Thank you!", "Title": "I love my tablet!", "Date": "September 22, 2013"}, {"Author": "mentalist", "ReviewID": "RKACJIN3CTB6I", "Overall": "5.0", "Content": "i got this for my mum who had never used a computer or a smart anything before she likes it very much understood how to use it very quickly for programs on this great device are simple and easy to use!!! now she has the power to do everything a pc can do but with smart phone teck. was very easy to hook to innet as well. now she can watch her favourite shows and read and store any ebooks  nookbooks  kindelbooks!!! should you want more than just a reader get visual land it is a smart pc worth its money, cheers!!!", "Title": "wonderful device", "Date": "August 17, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3U3XLIWP001AE", "Overall": "1.0", "Content": "I got this tablet as a gift along with 2 others that were for my children. We all got to use them one time and then none of them will charge they just get really hot (felt as though one melted). Also they did not support any programs well.", "Title": "Got this Tablet as a Gift will not charge", "Date": "May 1, 2014"}], "ProductInfo": {"Price": "$106.99", "ProductID": "B00BUUCNE0", "Features": "Android 4.1 Jelly Bean, 7 inches Display\nAll winner ARM dual-core CORTEX A9 OMAP 4 1.2 GHz\n8 GB Flash Memory, .5 GB RAM Memory\n6-hour battery life, 2.16 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BvRAxSEfL._SX300_.jpg", "Name": "Visual Land Connect 9-Inch Tablet with 8GB Memory (Pink)"}}