{"Reviews": [{"Title": "A Nice Android Tablet!", "Author": "Lana C", "ReviewID": "R5Z3VQ7YW4NS0", "Overall": "4.0", "Content": "Hello, I didn't buy this tablet through Amazon as it was a gift for my birthday. They come in an array of colors and mine is purple. :) After discovering that Google Play wasn't pre-installed, I came to Amazon to read the reviews in case someone had posted a tip on how to download GP to the tablet, but none of the reviews addressed that.So, I decided to share how I downloaded it. I found this video and used it. It took about 15 minutes. Make sure you choose the correct version for your OS, i.e., Android 4.0 or 4.0.4 (mine), and so on. :)[...]This tablet is great for its class. It has a slight delay of maybe ummm 2 seconds when an app is tapped. It's processor isn't super fast (a nano second), but it's just fine for me. Now that I was able to download my favorite apps, I can watch HBOGO, Showtime and videos very well. It's camera isn't the best, but other reviews on the web say that the video portion is nice. :)  It's too large for me to use as a camera anyway. I have a Samsung G3 for that. :)I hope this is helpful!", "Date": "October 2, 2013"}, {"Title": "Visual Land Connect 9\" Android 4.0 8GB Tablet", "Author": "Bert Murphy", "ReviewID": "R199QKKSX3IHGJ", "Overall": "4.0", "Content": "Satisfied with the performance of the tablet. Bought it four 8yo son for gaming and educational apps. Getjar app had issues downloading games. Does not come with googlepay but it can be installed.", "Date": "February 3, 2013"}, {"Title": "Bought As A Gift", "Author": "Donna Cochran", "ReviewID": "R267MB1KN2VXMJ", "Overall": "5.0", "Content": "Works great and is everything someone could ask for in a smaller tablet! Well worth the money! I recommend that if a person is wanting an affordable tablet, get this one.", "Date": "May 31, 2013"}, {"Title": "Walmart has this item...", "Author": "J. Davis \"Ms Jo\"", "ReviewID": "R2HBEHJUFDYUZL", "Overall": "5.0", "Content": "Walmart is selling this same item for $79.00 in 5 different colors. Just thought I would let someone know. If fact no where else is it for that price with a variety of colors.", "Date": "September 27, 2013"}, {"Title": "Good Product", "Author": "Dennis A Fitzpatrick", "ReviewID": "R9OB5YIVXVLBG", "Overall": "5.0", "Content": "I ordered this item to help me with my computer and tablet. It has met all my expectations and I hope to do business with this seller again.", "Date": "July 13, 2013"}, {"Title": "visual land tablet", "Author": "nellie jones", "ReviewID": "R2I9H6NI5S81JX", "Overall": "1.0", "Content": "it never worked right. would not stay on wifi..sent it back to the factory and have not heard a word from them..  I called them they said they would send  me another they have not sent it yet . it has been almost 2 weeks Nellie jones", "Date": "February 3, 2014"}, {"Title": "Descent", "Author": "Michael Harvest", "ReviewID": "R2SBF4AE1O6DCG", "Overall": "3.0", "Content": "I got this for my daughter for Christmas. She likes it alot, because she doesn't have to fight with her brother anymore to play on our tablets. My only complaint is that she can't watch any kind of video on it. Netflix, Youtube, or any app that plays videos.", "Date": "January 27, 2014"}, {"Title": "Good price", "Author": "Cherrie aslaug apple", "ReviewID": "R1GEGPZ50VURAO", "Overall": "4.0", "Content": "I got this as a gift for my mom it was used but sent back and put back to new I set it up for her I like it a lot its a little slow at times tho but perfect for my mother cant really beat that low price Im not rich so this was a great gift with a good price and a starter tablet for my mom we got the keyboard to so she can use it both ways .. ... I tried to get another one used for super cheap but someone got the jump on me ;)", "Date": "January 26, 2014"}, {"Title": "lmight be ok for a computer tech", "Author": "Kelli", "ReviewID": "R27DLRJ4T5MO3J", "Overall": "2.0", "Content": "cant get it to connect to the internet...so not much good was a christmas present so i flunked christmas.. .bad!!!", "Date": "January 19, 2014"}, {"Title": "Do Not Purchase", "Author": "Miranda Harrah", "ReviewID": "R1ZCUMNKT8EHW1", "Overall": "1.0", "Content": "I purchased two of these as Christmas gifts.  I had high hopes they would be easy to use and be able to put a few games and simple apps on for my grandparents.  They are garbage.  I spend an absurd amount of time trying to figure out why they won't connect to the wifi and find apps that actually work.  I wish I had spent the extra money and purchased something of a better quality.  After using Nooks, iPads, and Kindle's I officially declare this item junk.", "Date": "January 16, 2014"}, {"Title": "Good 1st One", "Author": "Jodi D. Gilroy", "ReviewID": "RWHM7PSXLIR2V", "Overall": "4.0", "Content": "I do like this tablet I just wish it would come with a little more information about the apps that are on it and I wish it had a camera on the back. But it is a good starter tablet for someone who is just learning.", "Date": "November 15, 2013"}, {"Title": "Visual land Tablet", "Author": "LAshandra Morris", "ReviewID": "R16TZJY10RISRU", "Overall": "4.0", "Content": "I really appreciate how quickly and how easy it was to return and receive the new visual land tablet and to return the defective one . My daughter really enjoys her tablet .", "Date": "November 7, 2013"}, {"Title": "It's ok!", "Author": "Jennifer Rae Hurley", "ReviewID": "REFNEYBF68RSZ", "Overall": "3.0", "Content": "It is OK you just can't download games good. It doesn't have Google play and the program it has isn't any good. It is a Android system with no Google play.", "Date": "August 18, 2013"}, {"Title": "This is my 4th one I  LOVE IT", "Author": "Simon H", "ReviewID": "R2FDN02YV8TXB2", "Overall": "5.0", "Content": "I got one and then everyone else asked me about it and wanted to try it and then they asked me to get them one. So far I have got 4 of them in diffrent colors for freinds. Its very good if you want to surf the net do emails watch youtube etc For the pirce its great value.", "Date": "October 29, 2013"}, {"Title": "Maybe mine was defective?", "Author": "L. Allen", "ReviewID": "R2726AA4FTD7X6", "Overall": "1.0", "Content": "I purchased this tablet because it stated that it had flash installed on it. Received it, thought it was great at first until none of the websites with flash would work. Checked and found out that no flash was installed and I couldn't do anything to install flash. Big disappointment. Thankfully, Amazon has a good return policy and I was able to return it.", "Date": "October 22, 2013"}, {"Title": "A bit slow", "Author": "Tamika Woodson", "ReviewID": "R3H74TC9KA5WO9", "Overall": "3.0", "Content": "I ordered this on Tuesday, received it on Thursday which was great. I bought this to take with me when I travel out of town so I don't have to hall my laptop with me. Anyway, I fully charged it before I began to add my favorite apps and it's a bit slow to me. I have been using my smartphone for internet access until my new laptop was delivered since my old one was stolen. My phone is faster using the same WI-FI so I'm not to thrilled. I will use this and test it out over the weekend and see how it goes. Pros: It's not bad for the price and screen size is great. I got this about $8 cheaper than Walmart. Cons: I can't figure out how to log out of my Yahoo email and I couldn't log into My Fitness Pal app using my Facebook account, I kept getting error and had to log in using password.", "Date": "October 18, 2013"}, {"Title": "It works great!  Have not had a problem with the tablet!", "Author": "Haley Fosdick", "ReviewID": "R1849IF2ORW6P8", "Overall": "4.0", "Content": "I would recommend this product for younger kids, I would not recommend this product for older adults trying to play games.", "Date": "April 13, 2013"}, {"Title": "ok", "Author": "judy baldwin", "ReviewID": "RC6V9LKB7S4PA", "Overall": "3.0", "Content": "Its okay for the money. Had trouble with some apps. Cannot get some apps that I wanted. I am a little disappointed.", "Date": "March 25, 2013"}, {"Title": "Tablet", "Author": "deb", "ReviewID": "R25HUCVS9N3A94", "Overall": "2.0", "Content": "was for older parents and tablet kept turning off on own. Downloaded a book to it and took a lot of monkying around to get it to work. It would have been to confusing for parents.", "Date": "December 2, 2013"}, {"Title": "Not worth time", "Author": "C. Playle", "ReviewID": "RKHTAFJGRTSZD", "Overall": "2.0", "Content": "Bought this tablet to use as an interactive display in an exhibit.  From the start there were problems with it.  The battery is rated as up to 8 hours…it may be lasts 2 hours before it needs charged.  The touch screen frequently does not recognize the user’s tapping even when a hard tap or press is used.  It has also frozen occasionally and not recognized the user’s taps but will pop up notifications on its own.  Would not recommend this tablet.", "Date": "June 9, 2014"}, {"Title": "its ok", "Author": "Darlene Pavek", "ReviewID": "R7IMRK7XPXA8C", "Overall": "3.0", "Content": "Don't have bluetooth and can't get google apps. It does have a nice size screen. I can't get it to play netflix.", "Date": "December 20, 2013"}, {"Title": "Sent back", "Author": "dana williams", "ReviewID": "R376DE9Q5TIBYF", "Overall": "1.0", "Content": "Very very slow and actually didn't work correctly. The Wi fif would not stay on. Sent it back. Wont buy visual land again", "Date": "December 18, 2013"}, {"Title": "what did i buy smh", "Author": "Yaa", "ReviewID": "RW19G9I9ADLXX", "Overall": "2.0", "Content": "it keeps freezing!i dont know if i should struggle to return it or what!its not fair i think i should get a refund and keep the tablet.", "Date": "December 15, 2013"}, {"Title": "Shuts down frequently and lags", "Author": "Laura I. Francis \"lilezkimo\"", "ReviewID": "R2WX085TMOWN0C", "Overall": "1.0", "Content": "I bought this for my daughter and I was just trying to preload games on it so when she opens it on Christmas she can play right away. I couldn't get the proprietary App Store to load all the games. I keep getting a parcel error. The App Store shuts down. The apps, like Cut the rope, which works just fine on every other device wouldn't even load on this tablet.If you bought this on a Black Friday sale, check it before you give it as a gift. You loved one may be disappointed.I have already emailed amazon for a return.", "Date": "December 7, 2013"}, {"Title": "My son loves his tablet!", "Author": "Andrea Evans", "ReviewID": "RBLAJMC38R5JY", "Overall": "5.0", "Content": "Bought this for my son, and he loves it! He really likes the large screen. It was exactly what he wanted!", "Date": "December 2, 2013"}, {"Title": "Visual land Tablet", "Author": "LAshandra Morris", "ReviewID": "R16TZJY10RISRU", "Overall": "4.0", "Content": "I really appreciate how quickly and how easy it was to return and receive the new visual land tablet and to return the defective one . My daughter really enjoys her tablet .", "Date": "November 7, 2013"}, {"Title": "I love my tablet!", "Author": "chayes", "ReviewID": "R2ISBRYH6T3LIN", "Overall": "5.0", "Content": "I love my tablet!  Frankly, I've never heard of this brand and right now I don't care.  I found it via an e-mail advertising Labor Day sale items through Amazon.  It was a bit rough for me to pay the $80.00; but I'm not sorry that I did.I did have some trouble in the beginning getting the games etc. loaded as neither the Amazon or Visual Land directions worked to get an app. in the device; but I can usually figure out where and how to find apps. now.  Thank you!", "Date": "September 22, 2013"}, {"Title": "wonderful device", "Author": "mentalist", "ReviewID": "RKACJIN3CTB6I", "Overall": "5.0", "Content": "i got this for my mum who had never used a computer or a smart anything before she likes it very much understood how to use it very quickly for programs on this great device are simple and easy to use!!! now she has the power to do everything a pc can do but with smart phone teck. was very easy to hook to innet as well. now she can watch her favourite shows and read and store any ebooks  nookbooks  kindelbooks!!! should you want more than just a reader get visual land it is a smart pc worth its money, cheers!!!", "Date": "August 17, 2013"}, {"Title": "Got this Tablet as a Gift will not charge", "Author": "Amazon Customer", "ReviewID": "R3U3XLIWP001AE", "Overall": "1.0", "Content": "I got this tablet as a gift along with 2 others that were for my children. We all got to use them one time and then none of them will charge they just get really hot (felt as though one melted). Also they did not support any programs well.", "Date": "May 1, 2014"}, {"Title": "Mom is going to love this", "Author": "Chumly", "ReviewID": "R2E5R24VDXIPYR", "Overall": "4.0", "Content": "Mom is going to love this Droid system. Unpacked it and powered it up to connect Wi-Fi and had NO PROBLEMS. Charged the battery for twelve hours and put it back in the box. From what I could tell it is easy to connect and surf and was packed well and shipped fast. Thanks. I have not used it much so a 4 star was for an incomplete evaluation.", "Date": "November 23, 2013"}], "ProductInfo": {"Price": "$106.99", "Features": "Android 4.1 Jelly Bean, 7 inches Display\nAll winner ARM dual-core CORTEX A9 OMAP 4 1.2 GHz\n8 GB Flash Memory, .5 GB RAM Memory\n6-hour battery life, 2.16 pounds", "Name": "Visual Land Connect 9-Inch Tablet with 8GB Memory (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BvRAxSEfL._SX300_.jpg", "ProductID": "B00BUUCNE0"}}