{"Reviews": [{"Author": "Carebear50", "ReviewID": "R1UFTSMH2X4B9G", "Overall": "4.0", "Content": "Update to my previous review... I'm not sure if I have a defective model but just a few weeks after I did the review below I started having multiple problems.  I have owned this tablet just over 2 months and every app I go into, I get a pop up after just 30 seconds or so telling me the app is not responding.  It moves so slow that I have tried to pull something up, walked away for 5 minutes and when I came back it was still trying to pull it up. I tried ending all programs but it kept doing it so I did a factory re-start. When the tablet started up again (all my stuff was wiped off of it) it started in Safe Mode.  While I was trying to figure out how to get it out of Safe Mode, it shut down on me.  I plugged it into the charge and it charged for over 8 hours without the green light coming on. I unplugged it and it would not start up. I plugged it in again and waited another hour and the green light came on but it still wouldn't start up.  I unplugged it again trying to start it but it just appeared dead. I plugged it in again and the red light came on indicating it needed to be charged. I again unplugged it and just walked away from it for about 30 minutes. When I went back I tried to start it up again and nothing, then 10 minutes later it just started all by itself. I checked it and it said it was at 69% battery life.  There is something definitely wrong with this tablet.  I'm contacting the company and I hope it is just defective and not how it works in general.My son picked this tablet out because I had no idea what I was looking for in a tablet. It has everything I wanted with one exception - it doesn't have BlueTooth to connect my mini speaker. Somethings it has a slow response but I'm not sure if that is our internet and router or the Archos. It has an excellent crystal clear HD screen and the sound is pretty good without an external speaker. It is a great deal for the price.", "Title": "Excellent Tablet for the Price!", "Date": "June 5, 2013"}, {"Author": "HR", "ReviewID": "R3RDCSD7A68RVM", "Overall": "1.0", "Content": "I thought a low/mid-end Android tablet for ~$250 would be enough for my needs.It had exactly what I needed on paper.4:3 aspect ratio.Light and thin.9.7\" screen with 2048 X 1536 resolution.In reality this tablet is dirt slow, constantly loses connection to Wi-Fi and burns through battery faster than anything I've seen.It's too bad there are not more 4:3 ration Android tablets. Might be time to give in and just get an iOS tablet.While I'm not sure what my next tablet is, I am sure it will not be an Archos.", "Title": "Bad product at any price", "Date": "July 3, 2013"}, {"Author": "M. Joseph", "ReviewID": "R2CFTWYWRYOPVX", "Overall": "4.0", "Content": "Pros:Nice, large ipad-like screen sizeAndroid 4.1.1Good quality video and graphicsSmooth scrolling from screen to screenFast execution on internet browserCons:Needs frequent clearing of memory cache using built in System Monitor App, as continued use slows down tabletUPDATE on seller:I found the sellers NOT HELPFUL. The tablet started hanging-up after three months of use and I tried to get help from the sellers but they simply referred me to the manufactures Archos. I was disappointed.", "Title": "Good Tablet in its class", "Date": "May 22, 2013"}, {"Author": "Abel", "ReviewID": "RYDM0N4G15R4J", "Overall": "4.0", "Content": "The tablet is nice and looks really good. The resolution is great. There are a few things I don't like. One is that I use some apps in my phone but when I wanted to get the same apps for this tablet I couldn't find some of them for the tablet. Another important issue is that sometimes the network connection drops even if my router is working properly. Any way is a good tablet but I wish it wouldn't drop the wi-fi conection very often. YiouTube videos some times take too long to buffer.", "Title": "Nice.", "Date": "April 21, 2013"}, {"Author": "Luther Pryor", "ReviewID": "R1SY93CB3LO6QV", "Overall": "2.0", "Content": "Hi,  I wish I could make a great review for this product, but I only got to see it for a couple of minute before I packed it up, and sent the item back to Amazon.  I was sold a used product from the beach camera, the screen went fuzzy after about 1 min. this would be my second Archos product, and I have to say not worth spending time on buying some of their products..Thank you", "Title": "Sold a use product", "Date": "January 20, 2014"}, {"Author": "glowbug2", "ReviewID": "RFWGDSTNPRR5Y", "Overall": "4.0", "Content": "Overall, a very nice tablet. Solid build. Beautiful screen and gorgeous colors on the display. Would swear you are holding an IPad in your hands. Firmware update has helped with issues on WiFi connectivity. Browser still has a few bugs with forced closes on occasion. Hoping Archos will support the product on an ongoing basis. Its a plus that Flash is enabled on this device.", "Title": "Great tablet for a fraction of the price of an apple", "Date": "July 2, 2013"}, {"Author": "Graybeard64", "ReviewID": "R1FQ1A0VENF1AU", "Overall": "3.0", "Content": "I have no doubt that for the money, this is a great buy.  But it's a great buy when it's at the MSRP of $249.  I want an Archos tablet.  Just trying to figure out which one fits my needs Titanium or the soon to be released Platinum. The Platinum line has more RAM and faster CPU.  Still great low price if you can get it for MSRP.  Also considering 8\" as I don't know that I really need all the screen brilliance of the 9.7\".", "Title": "Way over MSRP", "Date": "April 5, 2013"}, {"Author": "daron1623 \"daron1623\"", "ReviewID": "R1XTVI58UK3XN4", "Overall": "5.0", "Content": "I got this in ONE week from when I ordered it. Perfect condition, works great and the price was worth every penny. If you want a great table at a cheap price this is the tablet to get. Would HIGHLY recommend this company and the product. I am so grateful to amazon and the company.", "Title": "Love This tablet", "Date": "March 1, 2013"}], "ProductInfo": {"Price": "$269.99", "ProductID": "B00B0C8UOU", "Features": "Super HD definition with up to 2048 x 1536 pixels resolution\n9.7'' capacitive 10x multitouch capacitive IPS display\nGoogle certified with full access to the Google Play Store and its 700.000 apps to download\nAluminum back casing\nFront and back cameras with autofocus mode (2 & 5 MP)", "ImgURL": "http://ecx.images-amazon.com/images/I/51YchXrCbdL._SY300_.jpg", "Name": "Archos 502352 97 Titanium HD Multi-Touch Screen Android Tablet"}}