{"Reviews": [{"Title": "Suprisingly Good", "Author": "Stephen A. Kupiec \"monopole\"", "ReviewID": "R1THX9TY2W2C9E", "Overall": "5.0", "Content": "For the price, this is a remarkably good tablet. The screen is flat out incredible, an IPS retina display which looks great at any angle. The Allwinner A31 quad core is very snappy, but lags a bit when initially loading apps. It easily decodes 4K as well as 1080p and 720p. The original flavor ROM is a bit buggy, but it is easy to flash the custom ROM you can find on the ArcTablet forum. The design is easy to flash using PhoenixSuite and easy to reflash if you softbrick it. The Google Play Store is preinstalled and runs flawlessly.With the custom ROM running all the usual apps run fine, except for some reason the Kobo app. Netflix is fine as well as Crunchyroll. The Comixology app and Perfect Viewer work flawlessly and comics are a real treat on this display. Sound is very solid, but with only one speaker I'd go with headphones. Video playback is solid, and the unit fully supports XBMC for local files.The build quality is excellent, with a solid case that does not flex. It incorporates a usb port and mini HDMI port as well as a microSD slot. It does charge using a barrel type adaptor instead of micro USB and is a bit slow to charge.My unit has excellent WiFi performance although others report problems. It does not have bluetooth or GPS.Battery life is very solid easily managing 4-5 hours of heavy use.If you want a tablet predominately for reading books and comics and viewing videos this is an excellent choice.Pros:-Incredibly Good Display-Solid Construction-Snappy Quad Core Processor-microSD Slot-microHDMI port-microUSB port-Easy to Flash Custom ROMs-Nearly un-Brickable-Comes with Google Play-Plays full HD and 4K video-Runs XBMC-Decent Battery Life (4-5hours)Cons:-Occasionally Sluggish loads for big apps-No Bluetooth-No GPS-Coaxial Port Charger--Stock ROM a bit wonky Crashes on some apps-", "Date": "May 5, 2013"}, {"Title": "I got mine an worked for 30 seconds", "Author": "Dwagbur \"<<SpL@T>>\"", "ReviewID": "R1JD4987YS9M49", "Overall": "2.0", "Content": "I got mine an worked for 30 seconds , it was set to Chinese, then it shutdown , would not charge ever,went from bad to worse. it died totally.inside i found the video connector on mb was installed backwards.only has one speaker an its on the back.the camera quality sucks raw eggs.but the screen quality when its working is awesome.cost 35.00 usps to ship backor  58. usps w/trackingan more than month later no refund still. postal guy sez we have no control over china shipping once its outa our hands.well he's right , i can get a postal from china in 4 days but they take weeks to get it back.maybe months.", "Date": "August 7, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Features Allwinner A31 quad core 3.3GHz CPU\nMail-400 quad core graphic processor\nAndroid 4.1.1 operating system for you to freely download apps\n9.7\" 10-point HD IPS third generation Retina Display touch screen\nSupports Auto screenshot and Picture-in-Picture functions", "Name": "Generic Nextway F9x 9.7\" Android 4.1.1 Quad-core A31 3.3ghz 16gb Tablet Pc with External 3g, Auto Screenshot, Pip, Capacitive Retina Display IPS Touch 2048x1536 (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Gf38RLAnL._SX300_.jpg", "ProductID": "B00BZMZJIA"}}