{"Reviews": [{"Title": "It's marginal for me + 3 week update", "Author": "J. nusser", "ReviewID": "R30MRUII1CQKS3", "Overall": "3.0", "Content": "It's between 2 stars (I don't like it) and 3 stars (it's OK).  I bought it on the strength of the NY Times story and paid about $90 including shipping for the red version. For $9.24 shipping it came UPS Ground from the west coast, in 8 days from placing the order.I've been using the Ematic for a day or so. It works; it does many things well or at least OK, but it's slow, very slow.Pluses:It's got mostly intuitive controls. It runs android apps. I like the integration with google applications and syncing with same on my other devices. It runs a Sonos app which is a big plus for us since we have it at our home.  (I tried a Samsung Chromebook; it won't run sonos as of early May 2013.)  Another plus is the Kindle app you download.  It lets me read the same books I have on a separate kindle, on ematic.  It works really well.Cons:  Slow, frustratingly slow, esp using the chrome browser.  The touch screen really lags in chrome; can be several seconds or more; especially frustrating when typing.  I wind up pressing several times and waiting.  There's no sensitivity controls for the touch screen that I can find.  I looked for them after learning the screen does not always respond to my taps. In some instances I find myself pushing on the screen rather than tapping since it appears not to respond. When typing, it frequently enters a foreign alphabet character, like an accented e or o.  I tried to see if Firefox would run faster than chrome.  I downloaded FF and got a format \"not supported\" message.  Not a surprise, but want to note that it runs android not other formats.  Screen contrast and sharpness are marginal.As others have mentioned, its not bad for having around the house as a tool to run a timer, do a quick check on mail or the net, read a book, etc.  Take it on a trip or use as a main device?  Not for me.You get what you pay for in this case. It's an inexpensive tablet. It works.  You'll probably be frustrated, as I am after only one day.  I'd suggest paying more and getting more.3 week update:May 24, 2013:  I've been using it for 3 weeks now.  I would return it if I could.  Works well as a kindle reader, Sonos controller, and some android games.  As a browser its so slow, its useless or freezes completely.  Available storage is so limited I continually get out of memory system notices. No idea how to remedy them, maybe buy a memory card? That wipes out the advantage of low price?  Won't really run other android apps like NYTimes, Wall St Journal, etc.  Just freezes.Can anyone else who bought one comment on speed, freezes, etc?  Did I get a lemon or is this just not an adequate tablet beyond the reader and sonos functions?", "Date": "May 4, 2013"}, {"Title": "Good if you use Opera Mini browser", "Author": "Customer", "ReviewID": "R1462HOZOJD8K5", "Overall": "3.0", "Content": "I just bought this Ematic tablet today.  Chrome is too slow.  \"Opera Mini\" is the fastest browser for this tablet because it condenses websites before downloading them.  You can get Opera Mini from \"Play Store\".  As long as you use Opera Mini, this tablet is worth the price.", "Date": "July 12, 2013"}, {"Title": "80 Bucks for a tablet", "Author": "Jane's Addiction", "ReviewID": "R3R0VU0KMZSXZG", "Overall": "5.0", "Content": "*****This review is orignally from NY Times*****This Tablet's Top Attraction? Its $80 Price.By ROY FURCHGOTTIf you're not sure that you need a tablet, $200 is a lot to spend just to find out. But Ematic has reduced the risk with the Genesis Prime, a 7-inch Android tablet computer that lists for $80.You get quite a lot at that price -- with an emphasis on \"at that price.\"Keeping costs down means stripping out all of the frills. The tablet does come loaded with a recent version of the Android operating system, Jellybean 4.1 (only Jellybean 4.2 is newer). That means access to all of the Google services, like Gmail, Google Play, Google Now, Chrome, Maps and YouTube, as well as the most recent versions of third-party apps.The tablet's hardware is good but entry level by current standards. For instance, the 1.1 GHz processor in the Genesis would have been top of the line a couple of years ago, but in watching streaming videos over Wi-Fi, it lagged a little.The tablet is also Wi-Fi only, so if there is no hot spot, there is no Web access. The device has limited memory, with only four gigabytes on board. But there is a slot that can take a 32 GB micro SD memory card (that will add at least $20 to the price). Ematic also includes five GB of cloud storage with the tablet.The tablet has only one physical button, the on/off switch. The rest of the controls are on the screen. That has to save a few dollars, right?The screen itself is reasonably sharp, but very small type, like that on the apps page, breaks up a bit. And the screen has a subtle blue tint, which you probably won't notice watching movies but which is apparent on print pages with white backgrounds.The only camera is a front-facing VGA, so this is not the first choice for photo buffs. And the speaker is particularly anemic, although when using headphones the sound quality was good.Battery life isn't stellar, with the manufacturer estimating a 4.5-hour play time.It would be easy to write off this tablet based on the specifications, but don't forget the one spec that really sets it apart-- the $80 price", "Date": "April 22, 2013"}, {"Title": "$80 tablet, mixed feelings", "Author": "Jake Jacobs \"DiscDirect\"", "ReviewID": "R1TPUQPBER2HXA", "Overall": "3.0", "Content": "I have not had a tablet before.  Never even used one.  Had decided to buy the iPad mini when I saw the product announcement for this.  For $80, I decided to chance it.  I've now had it about 18 days.  It works.  It's small, it's lightweight.  Oh, also it's quite elegant looking.I've watched a bit of video on it on YouTube & Netflix. It looks good to me. Typing on the tiny keyboard is awkward @ best, but I imagine the iPad mini's keyboard would be as much of a challenge.  Instruction manual is VERY brief, & I wish there was more to it. In order to use Netflix, you need to download an application, but can't do so fr. N-flix site, must get the app fr. Google store (free). I've read e-mails, but can't figure out how to search my e-mails for a particular 1 (I can do this on my desktop), nor have I figured out how to send e-mails (this too, I can do on my desktop - I'm not a total moron). On YouTube I have twice found the search function for the site, but it isn't intuitive & I'm still not sure how to find it again. Also, the 2nd (last) time I found the search function, & entered my search item, nothing happened, so WTF?  &, of course, I don't know if these problems would be any different on any other tablet, @ least 1 w/a screen this small (7 inch, I think).  Sound from the speaker is very tinny, but seems quite good w/ear buds.The very first thing you're supposed to do when you turn it on, is connect it to your desktop in order to load device drivers.  I did, but no device drivers loaded.  A week later, I found out how to bring it back to factory settings, so I could try again.  Same thing - no device drivers.  My desktop doesn't recognize my tablet so I can't move files - I suppose this could be because I use Windows XP - but there's no way to know.I was alerted that there is a software upgrade available. I downloaded it, but the download didn't complete, & now I can't find it again.  Grrrrrr.I've gone to the ematic website from my desktop. Documentation that came with the tablet directed me to their site and a section of FAQ.  There aren't any FAQ.  There is a search function.  No matter what you enter, it returns an answer that nothing was found and directs you to submit a question, but the form for the questions refers to another company, not Ematic, and is for submitting warrantee claims for broken parts.  Their website says they'll reply w/in 24 hours.  They don't reply at all.For $80, vs. maybe $400 plus, it was worth the experiment, I think.  Again, I'm a novice @ this, so I may be missing all sorts of issues.  However, knowing what I know now, I'd spend more money and hope for a better tablet.", "Date": "May 12, 2013"}, {"Title": "awful tablet", "Author": "BLee", "ReviewID": "R3OTA0393G13LH", "Overall": "1.0", "Content": "this tablet is virtually useless for browsing: incredibly slow and ceases to work altogether often. the display is poor, and there is very limited memory for apps: although there is a slot for cd card, the memory can only be used for data and not for apps. the only thing the tablet is good for is for playing mp3 music, and barely adequate for reading ebooks.I regret purchasing this product, and strongly recommend anyone to avoid it at all cost. Use the money to buy an ebook reader, e.g. KIndle, instead.", "Date": "June 25, 2013"}, {"Title": "Children love it!", "Author": "D. Aldridge", "ReviewID": "RQTMERN0VHUFW", "Overall": "4.0", "Content": "I bought two of these tablets for my sons ages 6 & 9 and they love them. Works great and because my children love downloading games, I would suggest purchasing additional memory. It loads and charges quickly (good for impatient children :)), and the battery life is good as well. Chrome is installed but I'd recommended downloading Opera Mini because Chrome is very slow. Overall it is a good tablet especially for the price and we love it!", "Date": "November 8, 2013"}, {"Title": "Too slow for my use.", "Author": "Tired", "ReviewID": "R3A7E8RR9DAQCL", "Overall": "2.0", "Content": "Tested it side by side with my laptop and Note 2. Much slower than either. Plan was to use it in office with EMR. Gave it away", "Date": "June 2, 2013"}, {"Title": "Very Slow and buggy", "Author": "Ariel", "ReviewID": "RHLRGGGTF9AOA", "Overall": "1.0", "Content": "Got this tablet for my mom,  I guess you get what you pay for.the build on the tablet is good,  but it is very slow and buggy.facebook would close itself. most apps would run very slowly.I recommend you save some money and buy a kindle HD or a Nexus 7", "Date": "June 4, 2013"}, {"Title": "Can't Beat For The Price!", "Author": "CAJ", "ReviewID": "R35TZSIWLBJ5XA", "Overall": "5.0", "Content": "Again for the price you can't beat it -$79.99.  No it doesn't have the screen resolution of higher priced tablets but its quite adequate and no it isn't as fast and smooth as higher priced ones, but adequate..  It runs all or most apps on Google Play.  It has a 7\" screen and small casing overall - perfect for home and travel. We mostly used it for games like 'words with friends' card games and wifi control apps for household functions.  It also has what most higher priced tablets don't - a micro SD slot that can increase your storage up to 32 GB.  Internet access is very good using Chrome or native browser.  Earphones - yes.", "Date": "May 3, 2013"}, {"Title": "Very Nice", "Author": "Wonder as I Wander \"just wandering\"", "ReviewID": "R11CFY3RLXM4AD", "Overall": "5.0", "Content": "Brought this for the little one so she could stop using the adults more expensive ipad and kindle, however I fell in love with this easy to use and very fast tablet.  It one upped the kindle with a front facing camera and google talk.  Very nice buy for the money.", "Date": "June 30, 2013"}, {"Title": "Great for beginners", "Author": "Nancy L \"nll\"", "ReviewID": "RF86PEG085DFX", "Overall": "4.0", "Content": "I am a senior citizen interested in keeping up with technology. This tablet has been user friendly and not difficult to learn its operation. I would recommend to other seniors, ie beginners and tech challenged.", "Date": "June 9, 2013"}, {"Title": "Don't waste your money on this. It is not worth it.", "Author": "Rufus", "ReviewID": "R2U0VZLJ7IWZWW", "Overall": "1.0", "Content": "I want to start by saying that I almost never post reviews of products but this time I had to. I bought 3 of these items because they are inexpensive and I thought it would be a good way to evaluate if I wanted to venture into buying tablets for me and my two children. I have waited a while to post this to try and decide if I was being to critical of the product or if it was just that bad. After a lot of thinking, it is just that bad.The only positive thing I can say about this product is it is cheap. After that there is a long list of negatives.Out of the box it just feels cheap and like it could break at any second. After powering it on you want to make the screen brighter but realize quickly that the brightness is already turned all the way up. After that comes the realization that the display looks grainy and distorted, it is actually very hard to read almost anything. The touchscreen is horrible! It is at times over sensitive or under sensitive even with the same amount of pressure applied each time and will register touches a fingertip below where you touch it and you end with things you never meant to open opening or things not opening at all. The RAM for it is so small that after receiving it and updating Google services, you cannot add any apps to the tablet that cant be moved to the SD card right away. Even if you remove some of the Google required apps that cant be moved to the SD card they get downloaded again the next time you need an update. So it is slow, very slow and a lot of apps hang up when you try to open them.Then on one of them the mini USB port came detached from the motherboard when simply removing the power cord. Now I am stuck with one useless tablet and two that are in the word of my children.. Horrible. In fact on of my children refuses to even try to play games on his because he gets so frustrated by how poor it performs. I am trying to work with Ematic to return the broken one and possibly return the other two since they are so dysfunctional. I will update this as info come available but please save your money or invest a few more dollars in a better tablet.", "Date": "October 10, 2013"}, {"Title": "Love it!", "Author": "Z.Dobson", "ReviewID": "R7JRTHXKM7K9U", "Overall": "4.0", "Content": "\"Ematic Product Review\" This tablet is impressive for 50$ it does everything that was promised, all the bad reviews are incorrect I haven't experienced none of the problems people had listed.The sound quality is perfect, with Google chrome provided web browser I can easily access any website.I highly recommend this tablet for busy people,Its affordable and enjoyable!", "Date": "September 6, 2013"}, {"Title": "Bad", "Author": "Amazon Customer", "ReviewID": "R1GSK35YU53HXX", "Overall": "1.0", "Content": "only able to install 4 apps before the 512mb is full and sd card is useless cannot add to it. a child would not like this.", "Date": "May 18, 2013"}, {"Title": "i love", "Author": "jose luis guerrero", "ReviewID": "R3CF8H8PLJ7DYN", "Overall": "5.0", "Content": "all right, I'm satisfied with the product, I recommend it, do not hesitate to buy this product, the best I've bought this seaso", "Date": "May 25, 2014"}, {"Title": "kids only", "Author": "Uncle Charlie", "ReviewID": "RPGATGT3KCSHD", "Overall": "2.0", "Content": "This is a 'starter' unit- strictly entry-level stuff.  Very, very slow to respond to touch, internet use, etc.  Good for someone just learning keyboard basics and general move-around on a tablet.  Sometimes, the screen does not respond at all to touch.  But, this is the exception.  Not recommended for experienced users who are accustomed to speed, functionality.", "Date": "April 8, 2014"}, {"Title": "Oh well", "Author": "Farley Philogene", "ReviewID": "R3BZ2OUJN88AW3", "Overall": "2.0", "Content": "Three days in the power button stopped working. It has to be turned on by plugging it into the charger.", "Date": "April 8, 2014"}, {"Title": "7\" Google Play Android 4.1 Ematic Genesis Prime 4GB HD Multimedia Tablet w/ WiFi", "Author": "Michael Perrone", "ReviewID": "R1MICSJGB2EQLS", "Overall": "3.0", "Content": "Have used this item, seems to be okay, bought it to get used to using a tablet. Since I don't own another tablet, can't give a comparison or rating. It's okay for a beginner!", "Date": "April 7, 2014"}, {"Title": "Works good for the price", "Author": "Peggy A Mosorjak", "ReviewID": "RY5I4WD4S6DEE", "Overall": "4.0", "Content": "I was looking for an inexpensive tablet for music, games and some quick browsing & email. Works really good for the price. I've used other inexpensive tablets and this one is better than most. It comes with Google play which is a big plus. Of course its a bit slow and doesn't have a lot of storage, but for $60 it does everything a friend's $200 tablet does just a bit slower. I would recommend this for someone that is looking for an inexpensive tablet and doesn't mind it being a bit sluggish. If you're looking for something to run like an ipad, save your money, but for the price, this tablet does the job.", "Date": "March 31, 2014"}, {"Title": "R.I.P.", "Author": "Beth", "ReviewID": "R364K7MFHV2Z2G", "Overall": "1.0", "Content": "The usb charging port wouldn't make a connection and then it fell out. It was only a day old when it died :(", "Date": "March 25, 2014"}, {"Title": "It's OK so far..", "Author": "shannen gordon", "ReviewID": "R865X5B5KBVW6", "Overall": "3.0", "Content": "This is my first tablet and I received it as a gift. I'm excited just to have one, but also a little disappointed with its performance. The tablet carries out its basic functions ok but it's speed and response are lacking. Browser speed is fine but could be faster. I've had some issues with applications freezing and crashing. The camera was non-responsive the first time I tried to use it and I often have to tap the screen multiple times to get it to carry out a command. Music plays well but sound can get muffled because the speaker is small and located at the back of the tablet. I'm hoping it's just a defect and that I can send it in and have it replaced with a better-functioning one. But overall, it's just an ok tablet.", "Date": "December 30, 2013"}, {"Title": "Not satisfied with merchandise", "Author": "Lawrence Jones", "ReviewID": "RSA9LNB0311ID", "Overall": "1.0", "Content": "Wasn't satisfied how slow it takes to connect to program not much space for downloads.. I would like an refund product sucks!", "Date": "December 30, 2013"}, {"Title": "Terrible Customer service!", "Author": "Keisha Manning", "ReviewID": "R1FMHOKYIUZ5H9", "Overall": "1.0", "Content": "I got this tablet for my daughter for christmas.  when she opened it up and tried to charge it, the charging port in the tablet does not work!  i tried calling customer service 3 days in a row and no one answered the phone!  i hope they will contact me before the 90 day warranty is up!  I dont know if this is a good tablet or not!  what a waste of money!", "Date": "December 30, 2013"}, {"Title": "Happy Results", "Author": "Mindy9877", "ReviewID": "R2COYZ3SKTAQA4", "Overall": "5.0", "Content": "I was looking for a tablet for my kids to use and I came across this one.  The information given is what I was looking for.  When it came there was still a charge to it and so I checked it out to make sure it works.  It works with no problem.  I added the Accident Insurance to be on the safe side (we know kids) which I didn't know they sold this also.  Yeah!  So far so good.  There is no glitches or sudden turn offs.  Plain and simple is what I was looking for and this is it.  Easy to download apps but it can take some time to open certain sites (that's okay).  Results:  Kids Happy", "Date": "December 29, 2013"}, {"Title": "Amazon Has The Worst Customer Service Ever!", "Author": "Nicole", "ReviewID": "R2LYC1NCHYZ182", "Overall": "1.0", "Content": "I ordered this tablet from my mother intending it to be a birthday present. She was overjoyed to have received this great gift. We tried to turn the tablet on and it wouldn't work. We assumed it was just dead, so we plugged it in and she left it over night. The next day she called and let me know that it still would not turn on. She tried other outlets in the house and it still would not work. I contact Amazon to get the item replaced and they informed me that they would not exchange the item because it's an electronic gadget. That is the most ridiculous thing I have ever heard. So I cannot give this item an actual review. I can only warn you to buy your electronics in a store where you can actually exchange them when something is defective. I will never buy electronics from Amazon again.", "Date": "December 27, 2013"}, {"Title": "wow, this is cool amazon!", "Author": "geo", "ReviewID": "RZTO6I03VV2Q9", "Overall": "5.0", "Content": "i thought this would be great for the kids. but i can't give it to them. i'll get them another egs004 in a different color. i'm keeping this one for me! its light, slem and powerful. not as slow as others have said. this my first android os. its nice and easy. the back facing video camera will be nice when i figur out skipe.  can't beat the price eather... baybe i'll get a 10 inch instead. thanks amazon!!", "Date": "August 5, 2013"}, {"Title": "It works just like I do.", "Author": "Amazon Customer", "ReviewID": "R3I8XU9K6Y1YQC", "Overall": "2.0", "Content": "SLOW. I'm 76. I don't move very fast anymore, but even sitting next to a router this device is slower than I am.", "Date": "August 15, 2013"}, {"Title": "works well", "Author": "Brenda Perry", "ReviewID": "R2Q6BCX2FOOJ1X", "Overall": "5.0", "Content": "works well, and good for a kid without spending a lot of moneywith the risks that go along with kids. Kids will be kids and things happen", "Date": "November 24, 2013"}, {"Title": "its working", "Author": "Hard nut to crack", "ReviewID": "R26JCJR5KFKAK6", "Overall": "4.0", "Content": "this item is working as it should and is making my children happy. that is what matters so Im happy", "Date": "September 5, 2013"}, {"Title": "Excellent Tablet for a low price!", "Author": "Philip E Gerber", "ReviewID": "R37MT7ZILKROG5", "Overall": "5.0", "Content": "I was surprised to see all of the features on this economical tablet.  It has many of the same features of the more expensive tablets at a very affordable price.  Very little lag time and games work well it.  My wife is addicted to Candy Crush Saga, so she is getting quite a bit of use from this tablet.  I would recommend this tablet to everyone.  Very satisfied.", "Date": "August 23, 2013"}, {"Title": "Very disappointed", "Author": "Amazon Customer \"akoblin\"", "ReviewID": "R1114D6I2UN9ZO", "Overall": "1.0", "Content": "Even though I had low expectations for this tablet, I was surprised to find it was much worse than i thought.  Save your money - spend another $50 and buy a better tablet.This is virtually unusable", "Date": "August 27, 2013"}, {"Title": "Ematic Genesis Prime Tablet", "Author": "Anna Banana", "ReviewID": "R3SVVGJAUA5KS1", "Overall": "5.0", "Content": "This was a gift for someone who is constantly on the move.  When he's home, he uses his desktop computer, but he needed something more portable.  The price was great.  I hope to see it soon and see how it compares with my pricier tablet.", "Date": "June 7, 2013"}, {"Title": "Meets all expectations.", "Author": "John Dillender", "ReviewID": "R1T5F5XW1O2IJ2", "Overall": "4.0", "Content": "Not perfect, but would buy again and recommend to friends.  Especially good value for kid use; price vs breakage/loss is worth the risk.", "Date": "May 30, 2013"}, {"Title": "Wait!!", "Author": "Mike", "ReviewID": "R147Y68H6HVVUC", "Overall": "1.0", "Content": "The restrictions on it's use are such that I should have waited until I could afford an ipad or amini.", "Date": "November 19, 2013"}, {"Title": "A good low-cost tablet", "Author": "aka10003", "ReviewID": "R2U38E2J0GWG8L", "Overall": "4.0", "Content": "This is a good tablet for $80 -- it comes in fun colors (mine is red), and it does the job. It does feel a bit slower than I would like, but then again, hello, it is low-cost.I ultimately bought this as a TV companion -- a way to keep up with the programs I watch. This tablet is mostly doing the job. At times I still have to rely on a laptop as some links are problematic, but less so than in my smartphone. But I am also assuming that some of these issues will happen in premium tablets.All in all -- a good purchase.", "Date": "May 18, 2013"}, {"Title": "bad deal.", "Author": "bilal khan", "ReviewID": "R1FSGG811B82H1", "Overall": "1.0", "Content": "it doesn't work and i don't know how to return it. don't trust any non brand name tablets. i don't like it", "Date": "November 5, 2013"}, {"Title": "meh!!", "Author": "nateddog", "ReviewID": "R2Y3T15E92A6FV", "Overall": "2.0", "Content": "this is NOT 4gb mine says 1.29gb internal storage. is slow to function. ONE camera for a new tablet thats pretty pathetic", "Date": "May 13, 2013"}, {"Title": "Specs are mixed up", "Author": "Monty Shaw", "ReviewID": "R37BBXY0MNORA0", "Overall": "3.0", "Content": "The product features show that this is has an A4 processor and then the technical details that it is an Intel Core Duo? What?Also no mention of capacitive vs resistive touch technology.Features show 4G flash, tech details says 8G drive. I think it just has 4GAlso CNet says this has a SD slot for up to 32G additional flash.Finally there is no other way for me to report issues with an Amazon product listing other than this. Come on Amazon.", "Date": "April 3, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BMJJ89M"}}