{"Reviews": [{"Author": "beth monk", "ReviewID": "R2MNMAVSQUYGZY", "Overall": "1.0", "Content": "This was such a waste of money, was like trying to search the web on a large android phone, wasnt very user friendly or very fast.", "Title": "don't buy it.", "Date": "August 18, 2013"}, {"Author": "ricky", "ReviewID": "R2O1S906FOZDDB", "Overall": "1.0", "Content": "the female part of the plug broke , it was slow, and it froze a lot and in all not happy", "Title": "the female part of the plug broke", "Date": "September 11, 2013"}, {"Author": "familyinbham", "ReviewID": "R1KM4YPPSXO8SI", "Overall": "5.0", "Content": "I love the tablet. One negative I must mention, the power adapter is cheap and broke. It left a prong inside my socket and I had to contact the power company to have them remove the prong.", "Title": "Nice tablet", "Date": "June 25, 2013"}, {"Author": "Jane N", "ReviewID": "R3MHD729X1E8OH", "Overall": "5.0", "Content": "Pros- very nice high resolution (1024x600) display- responsive touch screen- microSD card slot- responsive to web browsing and games- has manual buttons for volume on the side, and 4 hardware buttons in front- USB connector for keyboard/mouse (though Android 2 doesn't show the mouse cursor like Android 4 does)- really long battery life--says 10 hours, have used it for 5 and it still seems half fullCons- fairly heavy--a bit heavier than a kindle Fire, haven't weighed it exactly- old version of Android (v2), so a lot of newer apps won't run- seems to not be able to connect to a password protected wifi, but connects to wifi's without passwords", "Title": "Five stars for the price", "Date": "April 23, 2013"}, {"Author": "Melinda", "ReviewID": "R3KBHVLW11MM23", "Overall": "1.0", "Content": "It took forever for it to charge, and then when it did, it only lasted less than it takes me to undress. DISAPPOINTED!", "Title": "Nice little tablet but it can't hold any carge", "Date": "May 16, 2014"}, {"Author": "Pochocla \"Suicide Pochoclo\"", "ReviewID": "R3ORWCFGIE5PHD", "Overall": "1.0", "Content": "This ws a very dissapointing purchase. It is slow, the battery runs out too fast, it is not so intuitive as it could be, and it just sucks. I really recommend to expend a little bit more and get a good one. I bought this for my 3 year old and I don't even want him to use it because it's a shame really... I am sad and frustrated!", "Title": "This tablet sucks. Big time.", "Date": "May 15, 2014"}, {"Author": "Rackley Thomas", "ReviewID": "R8CJM3A9MJXUU", "Overall": "2.0", "Content": "Need more memory and the touch screen is a bit stiff.maybe in the future it can be a bit faster if there are built with 1gb memory", "Title": "memory/slow moving", "Date": "May 12, 2014"}, {"Author": "Viper", "ReviewID": "R1IQA4XQ8W80SP", "Overall": "1.0", "Content": "batter life is like 15 to 20, min. ugh not long could be longer or it could be a good 1 love the tab.", "Title": "not 4 mee", "Date": "May 9, 2014"}, {"Author": "Richard Stange", "ReviewID": "R1MSN57QSNZ673", "Overall": "1.0", "Content": "I bought it for my Grandkids and they couldn't use it. I tried it myself and I couldn't get it to respond the way I wanted.", "Title": "I sent it back", "Date": "April 21, 2014"}, {"Author": "JOSE", "ReviewID": "R21W3YY2IHAKU0", "Overall": "5.0", "Content": "Good morning.Buy this tablet just over two months ago but I am in Venezuela and it saddens me came two weeks ago. Unfortunately the touch screen broke. I wonder if you know where I can buy a replacement screen because here in Venezuela I get about the same price of a Tablet. Thank you.", "Title": "GOOD TABLEt", "Date": "April 21, 2014"}, {"Author": "Stormie ward", "ReviewID": "RJTWZCOVHF5WP", "Overall": "1.0", "Content": "Its not calibrated right freezes and wont conect to the game store wont ever buy another one. Would recommend paying more money for a better one", "Title": "no good", "Date": "March 18, 2014"}, {"Author": "Kat", "ReviewID": "R2IXVHJ3GWG1LF", "Overall": "1.0", "Content": "Okay this tablet was bought as a Christmas present for my daughter. It's now March 19th-and I'm about ready to throw the damn thing in the trash!!!I don't appreciate having to spend HOURS charging this just for a few minutes of playtime....my daughter easily got frustrated with it and no longer plays it.For the last 2 weeks it's been in the original box packed away.It won't charge anymore-it won't even turn on. The screen flashes off and on and that's it.Very disappointing because when she could use it-my daughter loved playing on it.", "Title": "Not really worth it.", "Date": "March 19, 2014"}, {"Author": "SIDNEY", "ReviewID": "R24L8K466KAD1", "Overall": "1.0", "Content": "its not much considering the price but the worst thing is you cant use it unless its connected to a power outlet. a tablet should be able to go a few hours at least without it needing to be charged!", "Title": "it sucks", "Date": "March 4, 2014"}, {"Author": "aquarian", "ReviewID": "RG8KIEQ8DQEHS", "Overall": "1.0", "Content": "Could not get past opening screen.  Pamphlet was a photocopy of original and symbols were impossible to make out.  Text written in broken English so no help.  Returned item and replaced with much better product.", "Title": "poor quality", "Date": "January 18, 2014"}, {"Author": "jessyca tucker", "ReviewID": "R2A6EVDPX433", "Overall": "1.0", "Content": "This would not let me open aps. I guess I get what I pay for. I had to return it and buy different one.", "Title": "Poor quality", "Date": "January 13, 2014"}, {"Author": "D. Black", "ReviewID": "R3LYM3MCYQMB0F", "Overall": "1.0", "Content": "This tablets battery will not hold a charge. It can take as long as 24 hours to get a full charge and then only last 15 minutes.", "Title": "Poor Battery", "Date": "January 12, 2014"}, {"Author": "D. Black", "ReviewID": "R2VBYUNP0ZP3FO", "Overall": "1.0", "Content": "I bought 4 of these tablets and everyone of them has a battery life of 15 minutes. I was very embarrassed giving gifts this poorly made.", "Title": "Not impressed", "Date": "January 12, 2014"}, {"Author": "Terri Williams", "ReviewID": "RNW598GQOWVUB", "Overall": "1.0", "Content": "Tablet won't charge.  Then when it finally does, it loses it very quickly.  I guess I paid for what I got.", "Title": "Just trying to save a little money", "Date": "December 26, 2013"}, {"Author": "Dorothy Wilson", "ReviewID": "RLE74I0TBFYL8", "Overall": "1.0", "Content": "It's very slow and it doesn't like to stay on what you are looking at. I would not recommend purchasing it", "Title": "jelly bean", "Date": "December 25, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00B2KE058", "Features": null, "ImgURL": null, "Name": null}}