{"Reviews": [{"Author": "Zhiheng Mai", "ReviewID": "R55H4HMGHYJ7Q", "Overall": "3.0", "Content": "This pad is good when comparing with other android pad at similar price range.Its screen resolution has been improved a lot. I use to have a Ematic 10inch pad but its resolution is not good as this one,It's CPU speed is 1.6G which I think is okay but nor that fast as I expected.The shape is neat and handy, which I think should be ranked as Good!Its battery can sustain for 6+ hours which should be fine for not intensive use.In sum, it is a good pad if you want to it as an e-reader, HDMI TV plug in video player , standby android panel and play other android apps.It is not suggest to put too much work load on this pad due to performance and battery concern.", "Title": "Good android pad", "Date": "September 4, 2013"}, {"Author": "Sergio Coello", "ReviewID": "RLX0AEB26SYE6", "Overall": "4.0", "Content": "I bought this or my wife, for a few reasons, to quick access and power up speed, I really like itbecause it's always ready, also the response speed is good,  I've tested this tablet on facebook, chrome, netflix, youtube, pandora, and other utilities apps and it's really good, another good, another feature that I love it's play magazines apps, really love it, has a micro sd card port that allows to increase the storage memory up to 32 GB, brightness control,front and rear camera, that actually takes really good pictures, also has a panoramic feature that we found very handy, mini HDMI port that allows you to connect this tablet to a TV, also I install a cloud drive app, (the one that I use for my pc cloud backup) and allows me to access all my documents on this tablet, we love it!, only one weakness: speaker volume (depending on the website and app) because the speaker it's located on the back of the tablet the sound could be a little bit low, but on headphones sounds great!!! my overall rating 8/10", "Title": "Great table for every day!", "Date": "November 9, 2013"}, {"Author": "Steve Cook \"sixtycg\"", "ReviewID": "R2XEJLJJ06GVNH", "Overall": "5.0", "Content": "I'd bought an 8\" tablet from another site recently, which died after a couple of weeks. Rather than deal with a replacement of the same model, I opted for this tablet. I'm glad I did.Tablet WiFi antennas can be problematic, but this one appears to be good quality. It's fast and I've had no issues with video play back. The screen resolution is not quite as sharp as I'd like it, but it's still good.The only real complaint is it doesn't appear to charge through the USB port, so the provided charger is the only way to go.Overall, though, this is a good buy.Also, their customer support is EXCELLENT. Prompt, courteous, and every answer is helpful. I'd recommend purchasing just for this aspect.", "Title": "Much better than previous tablet purchases", "Date": "August 14, 2013"}, {"Author": "Kim P Goode", "ReviewID": "R24S0ZMBGHRID7", "Overall": "4.0", "Content": "I would definitely recommend this tablet.  I love it, and it comes with all the features, I was looking for.  I love the size as it compares to a 7 inch.  The 8 is just right for taking pictures and playing games; 9s and 10s don't handle as easily.  The only reason I'm not giving a 5 star is not the unit but the fact that there is no case or sleeve specifically for an 8\" by the company (that I can find).  Universals will do if I find one but I'd like the company to consider one.", "Title": "Ematic Product Review", "Date": "January 7, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R32TT3HLZFBXWT", "Overall": "1.0", "Content": "I am giving the EGP008BL (BL is just for black) tablet 1 star because the company, Ematic, has truly horrific customer service.  I wanted to love this tablet, but had two significant problems;1) clicking on links in emails did not open a browser, but opened an \"add contact telephone number\" dialog instead2) the \"Auto Rotate Screen on/off\" setting WAS NOT in the Display menu (as per the Users Manual).I found a work around to #2 (if you press the time display in the lower right corner, a quick access dialog opens. Press the Settings icon in that dialog and Auto Rotate options are displayed).But for issue #1, I wasn't able to figure out a fix (tried new updating apps, switching to a different browser app, setting default apps, etc. So I submitted a technical support request (DO NOT the form at ematic.us/support, create an account at [...] so at least you'll have a support ticket number - for all the good it did me).  After 24 hours with no response other than the auto reply with my ticket number, I posted a comment on the Ematic Facebook page asking how long typical support response times are. After 48 hours with no response, I called their customer support number 888-968-1985 and was given the very confusing instruction to \"wait to hear from the Shipping department\" regarding my technical support question. I felt like the person (Tony) was not understanding the problem I was having with the tablet.  I asked Tony if I could speak to someone else, and she stopped talking to me, left the line open (I could still hear back ground noise) but would not respond to me at all so eventually I just hung up.  Today, after 72 hours with no response to a problem that is a MAJOR glitch in a tablet, I'm returning the tablet.  FYI, according to the Better Business Bureau website, in the past 12 months Ematic has had over 80 complaints closed (not filed, just closed) and yet there is no rating at all for Ematic on the BBB website...If you like to gamble, this could be a great sub $100 tablet, but be diligent about testing out all the features & apps you typically use so you can decide whether to keep it or not within the seller's return window (my seller offered 30 days).", "Title": "Buyer beware", "Date": "December 12, 2013"}, {"Author": "Capital One \"tommychick\"", "ReviewID": "R36VO0PYWAPKLR", "Overall": "5.0", "Content": "This tablet is great. it's fast, reliable, easy to use and cheap. I liked it so much that I bought two 7\" ematic tablets for my 9 and 10 year old grandsons. I got the 8\" EGPOO8RD PRO Series tablet for myself because it's better for viewing movies, has both front and back cameras, a micro SD slot-expandable to 32 GB memory and lots more. Although it can'ttake the place of my laptop, with all the apps available, it can take care of most of the day to day tasks I used to use my laptop for like banking, messaging and web browsing. Do I dare say it does all my expensive Apple iPod does?", "Title": "This is a great tablet.", "Date": "January 11, 2014"}, {"Author": "Randy Crawford", "ReviewID": "R9G4ZOUII2YYD", "Overall": "5.0", "Content": "After doing some extensive research on a tablet to fit my budget it came down to the Dell Venue 7 and the Ematic Pro EGP008BL.I settled on the Ematic primarily because of the HDMI port. Nearly all the sites I researched including the site I bought the Ematic Pro from stated the tablet did not have Bluetooth and I was very pleasantly surprised when it arrived to discover it does indeed have Bluetooth and it works great as does the Wi-Fi which gets a 90 to 100% signal. Has Ethernet capability also. Battery life is close to 6 hours when surfing the web viewing email and such. The Ematic Pro 8 also doesn't overdo it with preloaded apps and though I haven't tried it yet I believe they can be uninstalled. The tablet is fast with great picture quality and good screen touch response. The only con is the sound which is poor but I would still highly recommend this tablet.", "Title": "Nice tablet!", "Date": "March 21, 2014"}, {"Author": "Tommy Squitieri", "ReviewID": "R2GT9QVQKEVCLY", "Overall": "4.0", "Content": "Easy to use, self explanatory. Set up was easy. She has having no problems using it. Wife's happy. Yay! Thank you", "Title": "Easy for my wife to use.", "Date": "January 3, 2014"}, {"Author": "William Nussbaum", "ReviewID": "R2NMG2EPOB0NI7", "Overall": "2.0", "Content": "After two months it broke down and wont turn on. Awaiting info on what I can do. Before breakdown played great.", "Title": "WON'T TURN ON", "Date": "June 10, 2014"}, {"Author": "maria m ponce", "ReviewID": "R2OUH2FOVXCTD7", "Overall": "5.0", "Content": "It is great i'm very happy with it, is what i expected light weight ,screen resolution is great is fast n reliable ,i'm able to use with office documents that i use a lot ,also i'm able to open a lot of websites that use , i strongly recomended", "Title": "ematic 8\" pro EGP008BL", "Date": "May 22, 2014"}, {"Author": "RickyK", "ReviewID": "R1W5127BDBWWLT", "Overall": "1.0", "Content": "This tablet actually deserves a rating of 0 stars. Constantly uninstalls apps, and freezes while attempting searches. It is worthless except for playing a few games and emails.", "Title": "Deserves 0 Stars", "Date": "May 15, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3BKTJI08WWP7", "Overall": "5.0", "Content": "I like this product because it is portable and a little larger than the 7\".  It works great, I love that it is android!  Everything I wanted it here!", "Title": "Does everything I want!", "Date": "April 6, 2014"}, {"Author": "Natalie", "ReviewID": "R3GQXS8YFSXK06", "Overall": "3.0", "Content": "i got these for some friends and they love them alot they us them everyday playing games and surfing the internet", "Title": "thank u", "Date": "March 31, 2014"}, {"Author": "Tierra", "ReviewID": "RSEXT34L3P4IY", "Overall": "2.0", "Content": "Im dissapointed. Honestly there are quite a few unfortunate flaws. The amazon app store would honestly be one of them, THE APP OPTIONS SUCK! the volume does not get very loud, the touchscreen isnt as calibrated as other tablets and for some reason the gps on the weather apps tell me im somewhere that im definitely not. But on the flip side this tablet is a great paper weight, thats about its only positive use.", "Title": "Its fine for kids but not alot of app options at all", "Date": "March 27, 2014"}, {"Author": "Unicorn", "ReviewID": "RKSS22Z4H3XOA", "Overall": "4.0", "Content": "Okay.. I used to have a fairly expensive tablet that was wonderful but my son dropped it on the floor and it broke. I couldn't afford a pricey replacement so I bought this tablet because it was an  8 inch screen and it was around $100. It does everything I would expect but there are some things about it that I just don't like. First of all, the camera isn't very good. It doesn't take pictures well at all.. as in poor picture quality. Also, it doesn't vibrate like my other android tablet did. I also don't like how the screen doesn't flip when you turn the tablet around. Lastly, the battery doesn't last for very long. Fully charged, the battery for me lasts around 4 hrs before I have to recharge it. On good notes, the screen is big, it connects to WiFi fairly easily and it loads apps well. I think it is a good buy for an inexpensive tablet, but if youre looking for great camera quality, vibrating buttons, flip screens and long lasting battery, I would invest in a more expensive tablet. :)", "Title": "Pretty Good but not the best", "Date": "March 17, 2014"}, {"Author": "Fred.S", "ReviewID": "R14AWOG53TYVEI", "Overall": "4.0", "Content": "This tablet performed as advertised .A good platform for those wanting to transition from PC to tablet.Should have had at least 8GB though. Early days yet as I continue to put it through its paces.gh", "Title": "Good value .", "Date": "March 17, 2014"}, {"Author": "Texas Mom", "ReviewID": "R851E8WZLX77X", "Overall": "1.0", "Content": "The tablet was nice and light, but it was very disappointing when we loaded only 2 apps and the tablet said the memory was full. The problem is that the apps and everything else saves onto the RAM and not on the flash, so it gets full really fast and it won't work. I sent the tablet back after 2 days of trying to figure out how to get it to work without any success.", "Title": "Nice tablet with a huge glitch", "Date": "March 14, 2014"}, {"Author": "josh", "ReviewID": "ROHX8MZZQ18L9", "Overall": "5.0", "Content": "Very Good Produt. Camera comes on Front. Great product to play games or read books on. Easily to use and the color is on the back so when you put in the case you can't see the color on the back.", "Title": "Ematic Prime", "Date": "January 31, 2014"}, {"Author": "Miriam D.", "ReviewID": "R1JJAAG5E8LMIR", "Overall": "2.0", "Content": "we thought this would be a great lower end tablet for a 9 yr old. freezes up all the time. very disappointed. returned it for a kindle", "Title": "worked poorly", "Date": "December 31, 2013"}, {"Author": "Nancy Walker", "ReviewID": "R3I6VYERZRA9PI", "Overall": "4.0", "Content": "I was so excited when I received this. I was surprised of all the things you could do. I rate this a 5 haven't put it down long just except for charging. Love it!!!!", "Title": "Ematic 8.0 inch Pro tablet with android jelly bean", "Date": "December 31, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00BMJIZQO", "Features": null, "ImgURL": null, "Name": null}}