{"Reviews": [{"Title": "The best work slate ? Keep on looking", "Author": "MamaBear", "ReviewID": "R136K8SD6UQ7PR", "Overall": "4.0", "Content": "I've waited and done extensive research on slate tablets for months since win8 release. What I looked at were surface rt, surface pro 128gb, Lenovo yoga 128gb, sony, and other rt tablets. After using the surface rt for 3 weeks, it was obvious that it's not going to cut it for work. Hence I went with the win8 tablet hybrid instead. OF the win 8 business tablets, I narrowed it down to the lenovo win 8 series and the acer w700 128gb. In the end i considered the acer based on its unique out of the box style that is practical; and of course, because the pricing is a steal when comparing to the lenovo at the same spec.*********************************************One complain I have with the acer naming convention for its w700 model is that it is utterly dumb. I know it's for marketing / price discriminiation (geography wise) purposes, but it sure confuses heck out of me. In this day and age, thankfully, the internet came through and aided me in the comparison.For the W700 128gb, you'll have the 3 models to choose from: W700-6465, W700P-6821, W700-6680You can visit mfr url to take a look at the comparison; noticed anything? THEY ALL HAVE THE SAME SPEC yet are different in prices.[...]The W700P-6821 is the most expensive, yet offer the same build. HMMMM... So, I ended up choosing the W700-6680 and did not regret.-----------------------------------------One thing I considered was the space availability. As mentioned before, 64 gb won't be enough because after office and the OS, you'll barely have room left for software like Adobes, nevermind pictures.Ideally, I wanted the surface 128gb, but its pricing and avialbility is ridiculous. Also the screen size is not great for work. So my next candidate ended with this acer w700 128gb.Screen size, it's almost 12\" so it's adequate. Other specs comparing to the other manufacture is a bargain since I was able to buy it for under $900 shipped. As a whole, it's worth the wait, kind of.Acer did a good job with the hardware, but one big engineering flaw is their Bluetooth keyboard that came with it. It needed to be able to sense when you fold it behind the tablet and disable the keys because now, it's not possible to use the tablet without keys being spammed.Another issue I see is the tablet keyboard/cover itself. It does not fit like a glove and took more than a hassle each time trying to hit the sleep button. You must use some manpower to press on the plastic cover to reach the button. It's very very annoying!Lastly, the cover does not have the sleep/wake function. :(The Bluetooth keyboard does not wake up once in a while after windows go to sleep so I would have to reset the pc. Very annoying as well. Not sure if this was an os issue or not.It's too heavy......Maybe I'm spoiled by the weigh of other tablets are made for consumption such as my kindle because 3 pounds plus another 14 oz keyboards does add up.I'm okay with these major flaw only IF acer sells other accessories covers to address the issue. If not, heck, for twice the cost of an ipad, I fail to see why customers would flock to windows tablet except for legacy softwares for work. (im a windows guy)That's my take on this tablet. I truly want a perfect tablet, but as of now. i'm still looking but at the time, i'll keep my w700 128gb since it's the best product / value on the market at this time.UPDATE: Been using it for a month now and i'm getting the hang of it. Windows 8 is awesome and this piece of hardware is the best $1000 tablet / convertible on the market in my opinion. I will give it another star for the excellent work done by Acer. I'm still waiting for Acer to release better accessories such as keyboard for this tablet because the bluetooth keyboard that comes with this Iconia is blah.UPDATE: 3/17/13Still no patch / accessories out to fix the following major issue so i'm knocking off a star:unable to turn off screen (sleep mode) and play media. How ridiculous is this? All tablets even the cheap $100 could go into sleep mode and play music. It's not windows 8 flaw because the ms surface does sleep and play.This is a major flaw!Come on, if you spent $1000 on this mainly for work, the device ought to have a better functional keyboard, etc.AS OF today, there are no accessories out that allow this. #1. You simply cannot use this to sit on your lap and type. #2. The Keyboard is blah. #3. Does not have the auto wake/sleep function on a $1000 device's cover....I'm keeping this device for work, however, it's because this is the best device on the market for work/portability. Unfortunately, it's not perfect but it is worth using until the next generation of pro tablet.CONCLUSION: Was it worth the cost and the wait? Do I recommend it?Although there are shortfall, the answer is YES. I am keeping mine and does recommend it to other. Reason for the 3 stars is because 3 stars is for good ranking in my mind and I am very very picky with my electronics because of my profession.", "Date": "February 24, 2013"}, {"Title": "Excellent Tablet / Subpar Keyboard", "Author": "Chloe", "ReviewID": "R1TVRA7J9WJRFB", "Overall": "5.0", "Content": "I've had this tablet for a little over a week.  The Core i5 Processor is snappy, allowing you to run applications smoothly in both Windows 8 Desktop and Metro.  The Keyboard is subpar, not entirely recognizing all keystrokes however; the tablet shouldn't be faulted for a Keyboard.  If your looking for a keyboard, go purchase a high quality Bluetooth Keyboard to be used with this unit.There are a few minor issues I have had with the issue unit; however, I believe it may be more software related than hardware.-Some Applications may require you to use a Mouse if the Application is very dense; i.e. Design Applications, Financial Applications, etc.  I've had an issue with registering some touch inputs on very dense Applications.  i.e. Requires you to select an option which is very small on the screen.-Weight.  The unit weighs around 2lbs witout the case.  With the case, its a bit more.  The unit does way more than for example, the Ipad or most Android Tablets.  But keep in mind, this is a full Windows 8 Experience with a Core i5 Processor.  Even at 2lbs, the Unit is very light.The unit is constructed very well, with a glass front and metal back.-Audio.  The Audio has been amazing when using the Headphone Input.Overall, I would rate this Unit as 5 out of 5.  Ignoring the fallbacks with the keyboard as I simply consider the Keyboard to be icing on the cake rather than an actual function of the tablet.The unit also comes with a few adapters for VGA and HDMI and includes a Stand as well.", "Date": "May 1, 2013"}, {"Title": "One day I love it and the next day I'm not so sure.", "Author": "G. Soye \"GazUtd\"", "ReviewID": "RSFCTC7YTO4RM", "Overall": "4.0", "Content": "I have had this laptop/tablet hybrid for a few days now and I am not entirely sure if I have bought something fantastic or wasted my money.Let's look at the good first: I really like the design of the case and Bluetooth keyboard. You can easily switch between using it as a tablet or a laptop. It might seem weird at first but you soon get used to it and every item looks and feels very professionally made. I don't really see a point for the docking station, if it is an option I would advise to disregard it unless you are specifically looking for it. It is well made and sturdy but you cannot change the angle at which it sits which seems silly.The bad thing hardware wise is that the product is very heavy. You will soon feel wrist strain if you are using it as a tablet and holding it in one hand. I also bought a mouse as I couldn't do without one but that's just a personal preference.Now on to the thing that worries me the most: performance is very hit and miss. I have the i5 processor version so it should run smoothly, which some times it does but others there is a severe delay on everything you do, from using the mouse to typing and even playing a video with VLC once caused an issue which VLC would normally never have.I am not sure whether to lay this issue at the door of the hardware or if it is a Windows 8 problem but it is very annoying. It probably deserves a call to Acer support but the outcome of that will be probably being passed back and forward without anyone doing anything.Overall I am glad I bought this (especially as the price was fantastic) but if I can get the performance issues sorted I will be overjoyed that I bought it.Just one extra - I got the 60gig hdd version, if you can get a larger one then do, Windows 8 takes up a ridiculous amount of disk space.UPDATE: I have discovered that removing as much of the bundled Acer software as possible vastly improves the performance of this machine but in particular one piece of software that seems to have actually left there by mistake by Acer. This is really unprofessional stuff and Acer really need to fix it but in the meantime you can read about it here and fix it yourself... [...]", "Date": "December 14, 2013"}, {"Title": "Mostly happy", "Author": "bro chuck", "ReviewID": "RMOR9HHSXO22X", "Overall": "4.0", "Content": "I love the tablet - i'm even getting used to the windows 8.  I am not very happy with the blue tooth keyboard.  It doesn't always register my keystrokes.  It is very frustrating to have to go back and re-key a letter or letters because it doesn't pick it up with the first strike.  Sometimes - even when I am trying to be very intentional about touching the keys it still wont always register.  Even typing this review I have had to go back at least a half dozen times already.  I can't tell if there is a pattern although there are a few keys that seem to be the worst.  I am fairly proficient at touch typing so it isn't that I am missing keys.", "Date": "April 18, 2013"}, {"Title": "Problem with warranty", "Author": "DO", "ReviewID": "R2F6MBE6LH7O1I", "Overall": "3.0", "Content": "I am using the Iconia as a laptop replacement. Running MS office 2010, and  additional proprietary software  the only noticeable issues had been heat spots on the back and louder fan noise. I am not using this for gaming. The iconia arrived with lots of bloat-ware which I immediately removed.  The image is sharp with very nice resolution (1,920 x 1,080) however the touch screen is not sensitive enough for such resolution and it is very hard to tap icons, menus and such - I am using a mouse most of the time. The docking station is nice, and it had a Bluetooth keyboard.  I ran into problem getting warranty for a keycap that fell off the bluetooth keyboard. Since the unit is under warranty and Key caps should not drop on their own I called in. I was asked to send both Tablet an and the Bluetooth keyboard and supply the PASSWORD for the tablet. As it is Win 8 the password unlocks all Microsoft account, (Hotmail, MSDN and other). I explained  that in addition my tablet contain confidential information and I cannot ship it in.  They refused to fix my keyboard. After turning to Better Business Bureau the relented and replaced my keyboard.", "Date": "July 8, 2013"}, {"Title": "Loving it", "Author": "Mark Messer \"mtm99\"", "ReviewID": "R19DBYEH6SCFZ1", "Overall": "5.0", "Content": "I bought this machine because it has serious horsepower (i5-3337U) and can be used when seated in cramped economy class on a trans-continental flight.  I decided against the traditional laptop form factor after witnessing a guy across the aisle nearly have his 13\" Macbook Air crushed by a suddenly and forcefully reclining seat in front of him. The intended use is software development \"on the go\".It is worth noting that this is my second Acer machine.  I also own a 15.6\" Acer notebook which has been problem free for two years, with the exception of one damaged key (a search on eBay turned up a replacement keyboard for about fifteen bucks, but I can live with the issue).So far I love the machine.A few observations:1) a very good deal at six hundred bucks2) Screen looks great, except that it has more reflections / glare than the MS Surface Pro.3) Pretty good battery life4) I was unable to successfully update to Windows 8.1 via the MS store.  Acer referred me to Microsoft, who logged in remotely to troubleshoot.  The tech was unable to fix the problem, but tomorrow morning 2nd level support will be calling me to take a crack at it.  This is the first time I had to call MS support for help (I have been a software developer for thirty years).  Apparently many people have had the same problem.  I will provide updates tomorrow.5) The keyboard is pretty good, but not quite as good as the MS Surface type pad.  It sometimes duplicates the letter \"e\".6) I bought a MS Wedge Mouse (bluetooth) to use with this machine.  Works flawlessly.  Can't wait to try my Harmon Kardon bluetooth headphones.7) it is really not heavy at all when used as a tablet.  Although it weighs 2.1 lbs vs. the Acer Aspire P3 which weighs 1.7 lbs, but this machine (Iconia W700-6495) has a more powerful processor and a full HD screen.", "Date": "December 7, 2013"}, {"Title": "Acer Iconia W700-6499 11.6-Inch 128 GB Tablet (Silver)", "Author": "Charles D. Harrell", "ReviewID": "RG9AQCJWECDWO", "Overall": "5.0", "Content": "So far this tablet will do everything my desktop will do. Was heavier than expected. Would be perfect if it had a built-in card reader. Very nice and usable. Will never go back to a notebook.", "Date": "February 28, 2013"}, {"Title": "Love it", "Author": "Mario", "ReviewID": "R1GFHDME0H0XD3", "Overall": "5.0", "Content": "it's a awesome tablet I love it I use it mostly for gaming so far ive played world of tanks, Skyrim, and Day Z on it, it does lag a little sometime but overall its a pretty good tablet", "Date": "May 28, 2013"}, {"Title": "One great tablet", "Author": "Little B Rabbit", "ReviewID": "R215HHPLHQP0DF", "Overall": "5.0", "Content": "This tablet is amazing.  It gets great battery and is extremely fast.  I've tried playing a few computer games on it and it's been doing great with them.  This version also comes with the carrying case with the attached keyboard.  The keyboard works great and the touch screen is great and very responsive.  No complaints at all.", "Date": "April 10, 2013"}, {"Title": "4 out of 5 stars", "Author": "Jarrod C.", "ReviewID": "R1SIKFD43O20T0", "Overall": "4.0", "Content": "Not a fan of win8.  I Guess they got rid of the product key stickers, because I failed to find one on this device.  Mine came with the dock and a soft shell with the attached keyboard and a place for the tablet.  Even though the dock is nice and has the built in usb hub, I usually find my self using the soft case with the attached keyboard more.  Battery life is about 4hr (you can get more, but you wont be able to watch HD videos or photoshop very well in the \"low power/battery saver\" mode).  Used this on the plane from takeoff until landing watching movies in 1080p.  Flight time was about 4.5 hours.  I would highly recommend the 128GB version as win8 and its updates takes up quite a bit of space.  Boot up time is only a few seconds-which it should be as its on an SSD.  The reason why I chose this over some of the other computers was the i5 CPU and the 4GB of ram.  I know 4gb isn't a lot, but its better than the i3 and 2gb that most of the other tablets come with.  I don't think they keyboard is removable from the soft shell case either -- it would have been nice if it did.", "Date": "December 12, 2013"}, {"Title": "Poor tech support", "Author": "Michael J. Clark", "ReviewID": "R2VR3EBGKW4I7I", "Overall": "1.0", "Content": "First of all I like acer products, I have 2 other computers that I believe work very well.  I also like tablets, I have 2 android tablets, and even a touchpad, all work fine.  This does not work well at all.The tablet freezes continually, and the touch response is so poor,  I have had cheap phones that work better..  Then I found that the bluetooth audio did not work.  I called Acer tech support, he sent me a link to update the bluetooth which I did.  In the process I lost 14gb of free space and my computer kept freezing, although the bluetooth would connect.  Called back spoke to someone else explained the problem, he said send it in for repair,  I told him I only had it a week, he said return it.  Not much help there,  when I further questioned, he said seems to be a problem with the tablets and wouldn't go into anymore, just return it.Not sure if they have had so many problems it is not worth trying to diagnose the problem or not, but either way it tells me to stay away from this product.  Finally as I'm writing this review, I'm waiting for my battery to die in the tablet so i can pack it up.  It will not shut down, and is locked on the acer screen with the fan blowing full speed, to say this thing is a piece of junk would be an overstatement.  And by the way the battery is not removeable which is why I am waiting.One other note, To do a system recovery requires you to have a disc drive, because the hard drive is too small to have a boot partition, so if you have a problem you need to have that portable disc drive or send it back with your info on it.My machine I suspect is defective, however from my phone conversation I don't believe it is uncommon.  I personally will choose to replace this with a different product from a different company, and if your thinking of buying this I suggest you think about trying something else.", "Date": "January 30, 2014"}, {"Title": "Best multi task tablet", "Author": "Dorothy", "ReviewID": "RNAO7FCPZMRVR", "Overall": "5.0", "Content": "I purchased this as a gift for my son and needed a big screen because he was recovering from eye surgery. I was a little hesitant because it was refurbished and on arrival I found it did not included a manual, but he was  able to download from the manufacturer. The search took a few weeks of comparing tablets to meet his needs. This tablet seem to be the best choice. Since then this tablet has been his constant companion.Great for those who want a tablet but still need to do some work as well. Recommend for students or beginning entrepreneurs who are always on the go!", "Date": "January 28, 2014"}, {"Title": "Acer Icona W700", "Author": "john shea", "ReviewID": "R1PJ1LH28I3X96", "Overall": "5.0", "Content": "This computer has beautiful resolution for a computer or tablet .Its great for watching Netflix movies on. The large size of the computer makes it ideal for use as a computer or tablet. It has a fast processor it has touch screen os windows8. Can be uploaded to windows 8-1. Comes with a fast procedssor .Great for multitasking programs, comes with blue tooth wifi and docklng station for hookup 3 usb ports expansion to 32 g. A blue tooth key board. I think this is a super deal considering what you get ,check this acer lcona W 700 out at Amazon store . I would recommend this product.", "Date": "January 25, 2014"}, {"Title": "Amazing product at greate price", "Author": "Jitesh Patel", "ReviewID": "RVAYPKQXTHZU2", "Overall": "5.0", "Content": "Iconic w700 goes absolutely  smooth. I did the win8.1 upgrade through online update without any problem.Most amazing is, even after upgrade and installing butch of apps including virus scanner apps, there is absolutely no difference in start up time, it boots in around 6-7seconds. It is pretty impressive. Must have item for all executives and marketing guys.Technically, USB 3, Hard disk gives about 120mb/ps speed, battery, I tested of almost 8hrs continuous mode and on power saver goes more than 10hrs. Screen setting allows easy viewing by pinch zoom or resolution adj. System tuning is excellent, no hand / no dump. Grate experience.", "Date": "January 24, 2014"}, {"Title": "Very Satisfied", "Author": "Andrew", "ReviewID": "R3JGB631TQY6PT", "Overall": "4.0", "Content": "I've had this product for several months and am quite satisfied with it. It's a great value. Very convenient (size and weight). As it turns out, I use it mostly in \"laptop\" mode (with the keyboard), but have occasionally used it as a tablet. The keyboard works well (it can be a little finicky, but it's fine most of the time). It synchronizes through Bluetooth with no problems. I really like the docking station for using it at home.The batter life is not quite as good as advertised, but it's been fine (about six hours with moderate use). One drawback (and I think this is a Windows 8.1 problem, not an Acer problem) -- the icon resolution (at 100%) in nearly impossible for me to tap correctly when using it without a mouse. Therefore, I increase the size to 175% and that makes it better. However, when I change the display settings (to make the icons bigger so they are easier to use as a tablet), I have to log-out and log-in again. That means the work I was doing must be saved or lost. Not a HUGE problem, but an annoyance.All-in-all, I like the product a lot and would recommend it. For the price, you can't beat it!", "Date": "January 24, 2014"}, {"Title": "Great for my work applications", "Author": "Allan J. Joubert", "ReviewID": "R37ECI89YGAHMP", "Overall": "5.0", "Content": "I was hesitant about purchasing a tablet, and after researching various option I am so glad that I chose this option.  So far really enjoying all the features that this tablet offers - and the price is right!", "Date": "January 18, 2014"}, {"Title": "Awesome product", "Author": "Derrick Grimes", "ReviewID": "R6H4XMP6IXOAL", "Overall": "5.0", "Content": "Finally pulled the trigger on a table this Christmas and, after showing it to my fiance, she decided to get one too! This is an excellent piece of hardware with a broad range of applications. I use it to view documents, comics, photo work AND play computer games and it does a great job in all those respects. As some reviewers have noted, it does come with a heavy dose of pre-installed, and non-essential programs, but I found that with an hour or so of dedicated setup time, I was able to remove all unwanted programs and install the one I did want. I've been using it daily for the last two weeks and haven't had any issues with it.I would recommend this tablet to anyone looking for a mobile computing platform that has excellent mobility and functionality.", "Date": "January 15, 2014"}, {"Title": "Very good machine", "Author": "A Reader", "ReviewID": "R2ERCWFH65OZ2N", "Overall": "4.0", "Content": "The Acer Iconia is very nice. It did not blow me away, but it's a very nice machine. After adjusting to windows you actually get frustrated operating apple products. However, it is not as smooth and quick as an iPad, but I'm sure that's a result of it being a complete desktop in tablet form. The size is slightly more bulky and heavy but not very noticeable. The lack of cases is a drawback but I found one that worked. The keyboard is good, but not great. It usually doesn't lag but sometimes it does. A wireless keyboard and mouse work but not great. I may try Bluetooth to see if that improves. When using a separate monitor hooked up by mini hdmi it makes mouse and keyboard lag more noticeable.For a 2 in 1 tablet it definitely does the job though. I believe I just need to find the right accessories to maximize use. The lack of apps isn't that important if you are using as a laptop. But the the \"fun\" owner it may be frustrating.", "Date": "January 8, 2014"}, {"Title": "like it!", "Author": "Robert", "ReviewID": "R2YDF09D2SXBEW", "Overall": "5.0", "Content": "very good build quality, looks good, and combines the convenience of a tablet and a full powered computer, perfect for my need!", "Date": "January 3, 2014"}, {"Title": "Great workspace", "Author": "DANIEL", "ReviewID": "R3S1TU5YRGIJ1E", "Overall": "5.0", "Content": "Good choice, screen and accessories are excellent, great workspace. Bluetooth, usb and microHDMI make it a great tablet to coordinate with other devices or to export the image to a larger screen", "Date": "January 3, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B2GXGQ6"}}