{"Reviews": [{"Title": "Perfect for people who want both a tablet and a phone but don't want to lug both around", "Author": "MADH", "ReviewID": "R16HT12UFTCK5G", "Overall": "5.0", "Content": "I just received the Galaxy Note 8.0 N5100 yesterday, and so far I can't say anything but good things about it.As other reviewers have pointed out, this is the international version with 3G. In other words, this is a cell phone, a very large one, yes, but a cell phone nonetheless.My understanding is that the AT&T; network (and others like Red Pocket that use the same network) is the appropriate one for this phone in the U.S. I had a T-mobile micro sim card at home so I decided to give that a try and activated prepaid service on the device. It works just fine, I have made and received calls, no problem. Data works on it as well, though I do not know at what speeds. I find myself mostly in places with WiFi so I normally do not worry too much about network data speeds, but again, my understanding from what I have read is that this device will work faster on the AT&T; network because of the radio bands.I am 6'1'' with average-sized hands for a person my size. I am able to hold the phone in one hand with no problem. In case you are wondering, yes, I have put the phone to my ear and used it as a regular phone. It works just like any cell phone because, well, it is a cell phone. This device is essentially a Galaxy Note phone but larger than the ones available here in the U.S.As far as technical aspects, there are probably reviews out there by people much more knowledgeable than I am, so you should probably look at some of those reviews available online. I can tell you this is the best phone and also the best tablet I have ever owned. It is powerful, fast, and comes with all sorts of bells and whistles in terms of what you can do with the S pen. Also, I really like that the micro sim card and the micro sd card can be inserted without having to remove back covers or anything like that, which is something I have disliked in most cell phones in recent years. The slots for the micro sim card and the memory card are on the side and easy to open.I consider this to be the best cell phone out there. While size and portability may be an issue for some (and since I have been using the biggest phones I could find in recent years I do get a lot of comments from people about what a hassle it must be to lug something this big around), given that I find most smart phone screens too small for doing anything productive and I find large tablets too uncomfortable to carry around, I think that the Note 8 3G is the perfect middle ground. I would consider anything between a 7 and 8 inch screen as being in the sweet spot for portability and usefulness. Having said that, I would not want to carry an 8 inch tablet around if on top of that I was also carrying a smart phone. So again, this is why I think of this as the perfect smart phone. The phone does fit in my back pockets, though I am sure that it might not feed in a lot of pockets. I suspect most people would actually have a difficult time finding pockets that are wide enough for it to fit, so if you are thinking about getting this phone you may want to think about alternative ways of carrying it. Otherwise, you could do what I did: before buying it, look up the exact specifications of the phone, cut out a piece of cardboard in the size and shape of the phone, and try to fit it in the pockets of the pants you wear frequently.", "Date": "May 17, 2013"}, {"Title": "The best tablet that I have used!", "Author": "Jose L. Castro", "ReviewID": "R2J4KON21CINRZ", "Overall": "5.0", "Content": "I have owned the Galaxy Note 8 for a few days and it is the best tablet that I have ever used. I purchased the International version which also works as a cell phone. I inserted my AT&T; sim and it works perfectly! It has all the same features that a smart phone has and more. I currently also own an iPad 3, and an Iphone 4s. I have owned an iPhone ever since it first came out and always upgraded but this time I held out and didn't upgrade to the 5 because I wanted a bigger screen. I was also waiting to buy the new Ipad mini with the retina display when it comes out because the current Ipad is just to big and uncomfortable to use. When this Galaxy note 8 came out I tried it and loved it. It is going to replace my iPhone and my iPad, its perfect. I never thought that I would switch to an Android device, I have always owned apple products. All my computers are Macs. I thought people were crazy to buy Android devices over the Apple IOS devices, but I was wrong. This Galaxy Note 8 blows my iPad and iPhone out of the water. Its Awesome! I can't recommend it enough.", "Date": "June 16, 2013"}, {"Title": "This is 3G Galaxy Note 8 International Version.", "Author": "Nikolai Ivanov \"Nikolai\"", "ReviewID": "R1FQY4ET6E9Q9U", "Overall": "5.0", "Content": "Note to reviewers:This is 3g International version of Note 8.0 for $699. Model: GT-N5100 (3G)Samsung has released Note 8.0 Wi-Fi only for USA for $399 Model: GT-N5110ZWYXAR (Wi-Fi)International Note 8.0 Model GT-N5100 also acts as a phone.", "Date": "May 11, 2013"}, {"Title": "Why I love my HUGE cell phone", "Author": "APOLLOSTEES \"APOLLOSTEES\"", "ReviewID": "R18HXN9FL3XDTX", "Overall": "5.0", "Content": "Uses:I use this as my main everyday phone & tablet.Service Provider:I use T-MOBILE and I get HSPA+ AND 3G speeds, didn't even need to setup my APN. (I'm located in the ATL, GA region)Things to note:If you use T-Mobile you may not get HSPA+ and 3G you could possibly end up with EDGE service. This is due to the fact that the phone uses the 1900MHz spectrum. T-Mobile has only recently begun using these frequencies so not all areas have it.**IF USE AT&T; SERVICE YOU WILL DEFINITELY GET HSPA+ & 3G.**This is because At&t; has always used the 1900Mhz spectrum. You need only to set up your APN. Drop this \"Gvr4-330 Name: ATT Phone\" in Google and click on the first result to see APN settings.The Note 8 is a true example of gadget lovers excess. It's the tech equivalent to wearing a ridiculous amount of gold chains. (Think Mr. T) Yes I do put it up to the side of my head, yes I do look crazy. But hey, that's part of the fun! You definitely won't have the same phone as anyone else. (Alternatively you could just get a Bluetooth, if your a quitter..) Honestly though, it can be difficult having a phone this big. I recommend getting a good case because putting this thing in your pocket is out of the question. (Unless your huge too).Due to the ram and quad core processor this thing really moves. Also the S-Pen is great for taking notes. I had the Note II so I knew what to expect, but I have to admit the larger screen makes writing more natural. I've been transferring many paper notes over to it because of the convenience. It goes without saying that videos are great on this thing as well. I get true data amounts with no sorry data limits like you would usually have with a tablet/laptop data plan. That's because your provider will view this as a phone.In general I really like this phone/tablet.  I'd say pull the trigger on it.", "Date": "September 6, 2013"}, {"Title": "Very nice tablet", "Author": "Amazon Customer \"new texan\"", "ReviewID": "R306TSVKPR6QZV", "Overall": "5.0", "Content": "I debated this purchase I already own the galaxy s4 phone and a nexus 7 tablet with 3g but having owned the first galaxy note phone I missed the s Pen.I have to say I love it. I switch out my two Sims and adjust my APN settings and it works with both att.sms phone and just data.The reading mode does make it more comfortable when reading books, the s pen great for notes and calendar I like that I can put in an appointment and add an s note to the calendar .I down loaded flash from Adobe site and can now watch my amazon prime video's in the stock browser.I wish I had puhased  this first I would not have bought the nexus tablet which I had really liked until I tried out thistablet.Phone calls are clear and work well with speaker phone.tablet.", "Date": "July 19, 2013"}, {"Title": "The APPS You Need and Why My Desktop is Dusty", "Author": "LuckyAL", "ReviewID": "R2H3X27A64JMG8", "Overall": "5.0", "Content": "This highlights some of the Apps that are \"NEED TO HAVES\" if you make the wise choice of buying this tablet.  With the Note 8 and these Apps, I haven't used my Desktop since.NEED TO HAVE Apps for the Samsung Galaxy Note 8mazec3**This App replaces your keyboard and enables you to hand write in every App, email and on the internet using the S/Pen.  Most people have difficulty reading my hand writing and yet this App is able to consistently convert it into text. I find that hand writing with mazec3 on the Note 8 is noticeably faster than typing or swipping on a keyboard.  With this App and the Note 8, you'll get more done than you could on any other tablet.**It is worth noting that the Samsung keyboard does have a native handwriting recognition mode built in (you can find it in the keyboard's settings).  However, instead of writing sentence by sentence, you have to input one word at a time.  It's reliable - but it will slow you down.Polaris OfficeThis App comes pre loaded on the Note 8 but I am highlighting it to urge you to use it...because it is so amazing.  I have tried several Apps to create and edit Word, Excel, and PowerPoint documents-nothing comes close to Polaris Office.  It is extremely easy to use and the editing tools closely mirror the Office Desktop Software.  So far, I haven't found anything that I used to do on my desktop that I haven't been able to do with Polaris Office.  In fact, when combined with mazec3, I prefer Polaris Office to the desktop.G CloudThis App backs up all of your files including documents, music, contacts etc... Just install it on all your devices - including your old tablet, then back-up all your files and you can easily download any of the files on the Note 8. I also use Drop Box, but the reason I love this App is because I can easily get my music from my past and present devices onto my Note 8 and my documents are backed up daily so I can't lose anything.mSecureThis App stores all your passwords and log in information.  What makes this App stand out from the pack (and will save you time) is that from mSecure in a click or two you can instantly login to your favorite Websites-without having to open your browser, type in the URL, and type in your login info... mSecure does all the work for you.  I also used to use the same 2-3 passwords over and over.  With mSecure, I now have unique passwords for all my logins using their password generator.I hope this gives you a better idea of what is possible with the Note 8.  You are going to love it!Other Apps to Consider if the Note 8 is your First Tablet:-Google Voice Search-Drop Box-Dolphin Browser-EverNote-CalenGoo-Glympse", "Date": "January 10, 2014"}, {"Title": "Excellent tablet, great features.", "Author": "Raquel T. Michelena", "ReviewID": "R2TQ4B6UADACFK", "Overall": "5.0", "Content": "If you're not sure about the tab or the note, consider this: What are you going to use it for? Navigating? Installing apps? Facebook? Twitter? If your answer is yes then I would recommend the tab. But if you don't want to carry paper with you, you need to take notes, you like to be creative....This is the tablet for you. I have compared this tablet to the Ipad, the kindle fire, the asus and others and this one takes the ball out of the park.Something else to consider: If you're struggling between 7\" or 8\" inch dont hesitate, that dxtra inch makes a ton of difference.  The size is just right at 8 inches. 10 is to big for me and 7 is too small.", "Date": "October 28, 2013"}, {"Title": "Great Product and Design", "Author": "Amazon Customer", "ReviewID": "R2ZX3G1P2ZIVK1", "Overall": "5.0", "Content": "Great Product & good seller. I love my Phone-pad now. I do not need bring my phone and tablet everyday. They are in one now.I am using my 7 years old bluetooth headset (Motorola H350) to answer calls in office. They were paired in seconds.Only thing you need thinking is your pocket big enough or not. I have only one trouseres for GT-N5100 size. Anyway, most of the time it stays on desk or passager seat.The experences on reading emails, books and website is amazing. As a 8\" screen, it feels much better my last phone galaxy s4, which belongs to my wife now.Its weight is great too. I do not need worry about it even holding more than 2 hours. I still recommand to buy a Stand AmazonBasics Portable Fold-Up Travel Stand for the new iPad, iPad 2, Samsung Galaxy Tab 10.1 and 7.0, Kindle Fire, Kindle Fire HD, Kindle Touch (Black) which I set it on my desk as a  digital photo frame.I just ordered a 11 pins Micro-USB to HDMI cable this morning. Wish it gives me more surprise.", "Date": "September 19, 2013"}, {"Title": "Great tablet", "Author": "Tico", "ReviewID": "R2MC0SO7D0BHJ1", "Overall": "4.0", "Content": "Works as expected. Great features. One con: battery drains faster than in an Ipad but, easily lasts a  working day.", "Date": "June 20, 2013"}, {"Title": "Samsung Galaxy Note 8.0 GT-N5100", "Author": "Elpidio B.", "ReviewID": "R1HXGHW8OGS3MC", "Overall": "5.0", "Content": "I bought this GT-N5100 rather than the cheaper GT-N5110 with the thought of activating the tablet portion on AT&T; data only. Armed with the Model Number and IMEI, I headed to AT&T; store to have the process done. The associate spent at least 45 minutes trying but to no avail. In the end, she went to the back room and brought out the technician. The tech guy tried activating with the last 5 IMEI number from a Galaxy Tab 2. First 10 were zeroes. Could not access the internet. The last resort was activating the phone side, wala, everything worked as it was intended to. Data/talk/text/mms all work. I did not want the voice part since I already have a SGH-I337 Galaxy S4 on GoPhone $60.00 plan. Moral to this story is it cannot be activated as a tablet plan only on AT&T.; I probably can activate it on T-Mobile 5GB/100 minutes plan for $30.00/30 days plan but it be stuck on EDGE since T-Mobile refarming of 1900 is not in my area.I took the SIM out of my S4 and stuck it into the Note 8.0, I did get HSDPA so phone/tablet are working fine, Am I happy with the purchase? Fat answer is YES", "Date": "July 28, 2013"}, {"Title": "Best tech decision I have ever made!", "Author": "Karl Willke", "ReviewID": "R1KBZI9ENUIKMV", "Overall": "5.0", "Content": "This phone/tablet has allowed me to consolidate devices! I highly recommend this to anyone who is thinking about consolidating or always wanted a tablet but didn't want to carry 2 devices. You won't be disappointed. With a quad core processor and 2 gbs of ram this phone/tablet does not lag at all. It works better than I expected and it has a built in stylus.This thing is big but It does fit in all my front pockets. I looked up all the dimensions online and made a cardboard cut out of the phone to make sure it would fit in all my front pockets and it does! I am bigger guy that wears size 38 pants so that may increase my pocket size compared to others. I wear jeans or cargo shorts normally and wear suits at work and it fits in all pockets. I had to use a bumper case for this because any other case will not allow it to fit in my pocket.I usually get about a day and a half of battery life on normal usage. 2 days on light usage and 1 day of heavy usage. If you watch a 3 hour long movie the battery probably won't have much life left but that is with any phone. I have seen some reviews saying that the battery life wasn't good. I make sure to keep my brightness at 25%. It's bright enough to still see the screen well. I am able to get great battery life even with using a smart watch which has a blue tooth connection to it all day.This does work on AT&T.; I am sure it will work on Tmo and prepaid services like Straight Talk, Net10, etc. I did have to call ATT customer service to get them to adjust some settings on their end but it only took a minute for them to adjust. You don't get 4G but you get H+ which from my research is just barely slower than 4G LTE but much faster than 3G. The way it was explained on a website is that 4G LTE can get 50 MB/sec and H+ can get 42 MB/sec. I had a 4G LTE phone and I haven't noticed a difference in internet speeds.On a side note if you hold this thing up to your ear in public or mention that its your phone for any reason people will ask about it. I have learned that only about 10% of what I do on the phone is using it for phone calls. You can use a blue tooth ear piece but i don't like to wear them.", "Date": "March 20, 2014"}, {"Title": "Love it", "Author": "Amazon Customer \"Live-n-Learn Homeschool\"", "ReviewID": "R358EWTI52UUE9", "Overall": "4.0", "Content": "Purchased my phone from Wireless Everything.  They delivered it 5 days early and in excellent condition.  This phone was for my daughter who like many of her friends does not talk on the phone very often.  She needed texting and internet and occasionally I want to call and talk to her.  This allows her to only carry around one device and still have a screen large enough for her drawings and to read on.  This is only our first week but we've found no issues as of yet.UPDATE:  REPAIR IMPOSSIBLE IN THE UNITED STATESThe International version glass screen is just slightly different than the one from made in the United States.  Therefore, you cannot have the screen repaired if it is cracked.  When I contact Samsung they don't have a clue what I should do and keep sending me back to US repair shops.  My device was made in the Middle East (I assume this from the Arabic script the warranty and all instructions are written in).  Their website is non-functioning so I'm going to have to call and hope to get an English Speaker.  And, honestly, it is unlikely they are going to send me a screen and then I have to find a repair shop that will accept the screen and do the repair.I still love the phone but I will have to live with cracks from here on out.", "Date": "August 16, 2013"}, {"Title": "the best 8 inch tablet", "Author": "H. Seo", "ReviewID": "R2CSVWZQBUHOWI", "Overall": "5.0", "Content": "Delivers what you expect. Thd spen function is way better than i expected. Very accurate and i am still learning this tablet. It has more options than apple products.", "Date": "June 18, 2013"}, {"Title": "BUYER BEWARE", "Author": "Christopher Redding", "ReviewID": "R12AOLPQBZOJ92", "Overall": "1.0", "Content": "BE CAREFUL on who you get this from. I just received this from Mobile Deals and it is an AT&T; 3g  GT-N5100 LOCKED  tablet. It is not the international version all other reviews have said. It is also locked. Although it is a beautiful tablet it is not anything like the description states.  Please be warned.UPATE:I returned the AT&T; USA version and ordered from FGS Trading. They advertise the International version.  It was the international version that is basically an 8 inch phone like the other reviewers describe.  It is an amazing tablet/phone. Although the battery does drain fast.FGS Trading does give you a plug adapter for your device. They shipped it very fast and if it wasn't for a delay on UPS' part, it would have arrived to me in 2 business days.", "Date": "August 1, 2013"}, {"Title": "Good 'phablet' device, but be aware that this is a phablet", "Author": "Tony", "ReviewID": "RUY3KZ2XW7X8Z", "Overall": "4.0", "Content": "I bought Samsung Note 8 (international version) some time ago. Works pretty well on AT&T; using regular micro-SIM and regular smartphone account. Important: network sees it as a phone, not a tablet, which is different from US version of the same device you can buy in AT&T; store. Also you can actually make phone calls with this version (AT&T; US version can't).Making phone calls is a bit awkward because of the device size, but speakerphone mode or bluetooth work great. Data works well.White plastic is ugly, but this is normal for Samsung. There are several inexpensive leather cases available to correct it. SPen works wel, although I don't use it much. I have few different covers, one with a bluetooth keyboard and another without. When used with bluetooth keyboard this device is quite adequate replacement for mini-laptop for taking notes, doing e-mail, reviewing documents etc. But it is a bit bulky due to thickness (tablet+cover+BT keyboard).Battery life is great for standby, but weak when using the screen. It seems that playing movies or doing anything else that turns the screen on will drain your battery in 5 hours or so.Overall it is a good device, just be aware that this is a 'phablet'.", "Date": "October 15, 2013"}, {"Title": "Great product but warranty is only in Saudi Arabia", "Author": "Ki Hyung Song \"ki song\"", "ReviewID": "R1CTCFNTMWMJKG", "Overall": "4.0", "Content": "First of all it comes with Saudi Arabian charger. It is OK since this can be charged by standard micro usb charger. Other than that as soon as I set up with T-Mobile sim in it, it became a phone. Size is perfect to read a book or watch youtube in the bed with light off. I had been using Note 10.1 but it is too big to hold with one hand. This one is perfect. I don't have to carry two (phone and note).One thing missing is an earphone with mic. I need to get one to take calls. I guess it can work like 'big' phone, but earphone would be nice to have.", "Date": "January 23, 2014"}, {"Title": "Battery charge not holding", "Author": "Balaji N", "ReviewID": "ROZCN2AZ5NF6V", "Overall": "3.0", "Content": "The charging is not holding up as expected. If I continuously use it, the battery drains in few hours also", "Date": "December 6, 2013"}, {"Title": "Very pleased with my purchase", "Author": "ebony", "ReviewID": "R1GNIG7O0MNSXY", "Overall": "5.0", "Content": "Just received the note 8.0 popped my tmobile sim in and wow I get great speeds on H+. I now only have to carry 1 device it's not to big 4 me it's actually the perfect size I don't hold it to m head I use Bluetooth or the hand free earplugs. I am very pleased with my purchase.", "Date": "December 6, 2013"}, {"Title": "Best phablet I've had so far.", "Author": "ten", "ReviewID": "R3QW9WX56LIEB8", "Overall": "5.0", "Content": "Read the other day that this doesn't qualify as a phablet because of its fabulous size. I disagree, it's a phone & tablet, therefore it qualifies. I generally use the speaker, but (even as a petite lady) I've no problem holding it to my ear. I remember when hard line phones (once the norm) felt comparible to this in size & weight. ATT hooked me up easily over another phone in less than 5 minutes, but they've penalized me in that I can no longer use their data for internet, email, & youtube (so much for an unlimited plan-seriously). The spec's are a little less than what my Note 2 was, but the realestate makes up for some of that, I hate flipping & turning my mobile device to get a better look @ whatever (pics/shopping). I've turned off unnecessary sounds where ever possible, but the key strokes still tend to click despite that & that's unnoying. I hope Sam will make more devices like this & upgrade the camera. If you're familiar with the Note's, then you've got a good idea of what to expect from this. Now, if the app's would be required to do what they advertise.", "Date": "December 5, 2013"}, {"Title": "Galaxy Note 8", "Author": "Malcolm Young", "ReviewID": "R1LBIIL70UXICR", "Overall": "5.0", "Content": "Absolutely love this tablet.  It is a very portable and functional tablet.  I use the Note 8 S-Pen features daily.  I've gone completely paperless, and this hardware is essential to allowing me to make this transition.  I also use the Note 3 to compliment my paperless arsenal.  The S-Pen functionality does not get the recognition it deserves.  One is able to write extremely precisely, and have those notes available for random access (this is very important).  I create notes on my Note 8 and then forward them as JPG images to Evernote.  Evernote allows me to further mark-up (tags) my notes and provides random access to them.  My handwriting is also searchable within Evernote.  This is a powerful tablet, and I plan to purchase the sequel when it comes out - it's that valuable to my daily activities.  I should also add having phone capabilities on my tablet is also very useful.  I have two lines with my provider and use the Note 8 as my business line.  I've heard the comments of how one would look using this as a phone, however, those comments are bound by limited thinking - Use a bluetooth headset to answer your calls.  I also sometimes forward my calls on the Note 8 to my primary phone line which is the Note 3, on those occasions when I want to travel with one device.", "Date": "November 1, 2013"}, {"Title": "perfect", "Author": "Alladin", "ReviewID": "R834L8HVD3JOY", "Overall": "5.0", "Content": "Buy this phonetab from this seller you wont regret it..it is unlock so you can pop in any simcard...its very fast too!", "Date": "August 23, 2013"}, {"Title": "no good service from at&t; or t-mobile", "Author": "kathryn", "ReviewID": "R31N3YAU1IW1FY", "Overall": "5.0", "Content": "I love my tablet and give it an 10 but for the data service I give it an 2 because I get no service in some areas t-mobile and at&t; is the only service that work on the phone version wish it was Verizon", "Date": "July 11, 2013"}, {"Title": "Great phone/ Tablet!!!", "Author": "Super Man 7", "ReviewID": "R154WJWNLC73OP", "Overall": "5.0", "Content": "Great phone and Tablet mix!!!Perfect, especially if you are 6', 5\" Tall 330lbs like myself!!!Little and tiny is not for everyone in the world and I think the trends are moving towards a more universal market, because now they have no choice, but to listen!!!Great features and it works great!Perfect!***Note\" If you are with T-Mobile, understand it is 3G speeds until they fully integrate & upgrade their systems to the 1900 signal Band, which should be soon, depending upon your area....I am a IT Professional, tech and I think it is a great thing!Cons: Speakers should have been left on front and could have added aluminum body type, but who knows maybe the plastic dissipates heat better???I am happy with it for productivity!!!", "Date": "September 7, 2013"}, {"Title": "Best of both WORLDS!", "Author": "Remy", "ReviewID": "RX4LJGWJZGDXU", "Overall": "5.0", "Content": "I had my tablet for about 2 weeks. Very easy to use and set up. Phone and tablet all in one. Very rarely do I use my laptop. The screen quality is fantastic and the speed just does not get any better. Samsung really outdid themselves with product. Love the International version. The USA should offer this. Kudos Samsung", "Date": "September 7, 2013"}, {"Title": "fast tab + phone", "Author": "Thanva Xaysanith", "ReviewID": "R27BSILX0WX1I2", "Overall": "5.0", "Content": "using the Samsung galaxy note 8.0 3g with ATT service and getting 8mbps/ 1.3mbps upload. not bad for 3g using this APN setting from xdaName: AT&T;APN: PTAProxy: ~Not set~Port: ~Not set~Username: ~Not set~Password: ~Not set~Server: ~Not set~MMSC:[...]MMSC proxy: 66.209.11.32MMS port: 8080MCC: 310MNC: 410Authentication type: ~Not set~APN type : default,supl,mms,hiprioverall I'm very happy with this galaxy tab its fast and using i,m unlimited data with ATT", "Date": "August 14, 2013"}, {"Title": "Love it!", "Author": "sc", "ReviewID": "R1ZOPEBYOXHNYQ", "Overall": "5.0", "Content": "Great tablet with a phone. No longer have to carry phone and tablet with this but people laugh when I tell them it's a phone", "Date": "August 9, 2013"}, {"Title": "Already love it", "Author": "Takayuki Ono", "ReviewID": "R2F5HNMHSGRLK1", "Overall": "5.0", "Content": "I've just got the tablet 2 days ago and already love it!!1. The screen size is almost the same as actual comic book.My main purpose for the tablet is to read Japanese manga comics. I used to read them on 7-inch tablet. Now the new tablet is 8-inch and it is almost identical size as actual manga comics.2. A little tricky part of phoneI had Pantech phone and the sim card size was mini-SIM from AT&T.; I didn't know that it is bigger than the new tablet's sim slot size (micro-sim). I checked internet and found out that you can physically cut the paper part to make mini-sim to micro-sim. I did it and it works like magic!! Now I can unify tablet and phone into one tablet. I can call/receive calls and even texts. With bluetooth earphone, I don't have to hold the tablet to make a phone call. This is so worth to buy!! I can connect to internet with 3g as well.Since the screen is big, it's very easy to handle phone features with my big fingers.3. OthersNow I can use Google map as my navigator. Fast processors enables me to install/use Japanese input apps. Enjoy videos with bigger screen.Only one issue is that the wifi connection sometime drops for a moment. It's not a big issue for me, though.Everything else are more than my expectation.", "Date": "August 3, 2013"}, {"Title": "The issue of a wide bezel", "Author": "kaminsky", "ReviewID": "R1BVG3RW5BR6YH", "Overall": "5.0", "Content": "1.This device has a wide bezel.This may be seen both a minusand a plus.2.It is a minus if you hold the device likea regular cell phone - the fingersgripping both sides.The extra width creates strainon the fingers.3.Most of the time I hold one sideof the phone. My thumb is resting on the bezel. The wide bezel is great help.It prevents interference with thetouch screen.3. A third type of hand grip.Similar to previous type - holding one side.But in this case - setting the screen to landscape mode andholding from below. This type of grip is moreeasy and more safe. In this case too the wide bezelis great help.4.Samsung intends to bringto market a similar tablet withan improved design - a muchnarrower bezel- the Tab 3 8.0. I am notsure that it willoffer a more comfortable grip.", "Date": "June 29, 2013"}, {"Title": "As described, works great", "Author": "Amazon Customer", "ReviewID": "R1PRR0TDI493VU", "Overall": "5.0", "Content": "It's an 8\" phone. Good battery life ( for an 8\" phone ). Recommend a case, and screen protector. I eliminated 2 devices with this", "Date": "June 29, 2013"}, {"Title": "Great combo of phone and tablet", "Author": "Moe B", "ReviewID": "R3OWJYKAJPVNHI", "Overall": "5.0", "Content": "Well let me first say after I purchased this I found out there was a 4G LTE model and tried to return but after further research I found out that the LTE model was not compatible with U. S.  LTE bands even on at&t; which I have service with.  This is the greatest combo of phone and tablet.  My friends and people that I run into think it's awesome and ask how I got this.  This combo makes my life so much easier.  This should be sold at your local at&t; store without hesitation.  Thanks Worldwide Distributors and Amazon for selling this.", "Date": "August 5, 2013"}, {"Title": "No Reading Glasses Needed", "Author": "bookboi", "ReviewID": "R3DFYUX9JWTW0A", "Overall": "4.0", "Content": "I want to start by saying  - It's huge!  Really, really, really huge!  I was looking to update my original Galaxy Note phone and thought this might prove just the phone that my ever decreasing vision needed.  I was right on that end.  This phablet has an easy to read screen.  Images and words are clear and sharp.  It has a great user interface as a tablet.  I find texting on it fairly easy as the characters are so big.  I use a diary case so one hand use isn't difficult at all.  I think for me where it looses points is as a telephone.  Although calls are crisp and go through just as simply as with any other cell I've used, it's just impractical.  I tried putting it up to my face and couldn't contain the giggles.  So, I bought two headsets to go with it.  An earpiece for the car and a neckband headset for walking around.  Speaking of walking around...  It feels like you're lugging the Note 8.0.  I literally had to buy a bag for my phone.  So, three accessories later, I'm researching another cell phone.  I'm going to keep this as a replacement for another cell I have that is more stationary.  I would recommend this phablet so long as it isn't your primary phone or if you're a giant.", "Date": "May 29, 2014"}, {"Title": "Fanstatic!  There is no going back...", "Author": "stockmann", "ReviewID": "R27PT6HQ5M7K3W", "Overall": "5.0", "Content": "...to so-called \"Large Screen\" cell phones.This is what I have always wanted: a good performing tablet that is also a phone.I had T-Mobile's unlimited text-talk-data plan running on a Nexus 5.  Pulled the sim card, installed in thisdevice, and just like that, I had all the T Mobile services (nothing to adjust; no change of APN settings, etc.)I get 4G wherever I am on the TMobile network, and the battery is much better than that Nexus 5.Just simply the best...", "Date": "May 11, 2014"}, {"Title": "Best phablet ever", "Author": "Waseem Ahmed Qureshi \"Just imagine\"", "ReviewID": "R2EA4V1FJ4IOR1", "Overall": "5.0", "Content": "If you are not a chatter box, and don't want to lug around two devices, phone and computer everyday this is the powerhouse for you right now. Don't wait for the latest and greatest to come out like I did just get it and get going it has everything and more to get things done.. Galaxy note 8.0 wooohooo.", "Date": "May 8, 2014"}, {"Title": "Very good", "Author": "Renatamn", "ReviewID": "RY15D5VUJ0ZH1", "Overall": "5.0", "Content": "This is my first device of samsung and exceed my expectation. The screen has a good size, is not heavy and the system does not lock. I love the spen!", "Date": "May 8, 2014"}, {"Title": "Battery problem ultimately did this one in", "Author": "Alex Man \"gadget guy\"", "ReviewID": "R22W2BRTT94TGQ", "Overall": "1.0", "Content": "This could have been a great tablet/phone. It was the ultimate all-in-one tool. Other reviewers have already reviewed the great points about it so I won't rehash them because I loved all the features, especially the stylus. My problem with it started two months into owning it. I might had ended up with a lemon but I still feel I should report it. After two months, out of nowhere, the battery started draining unreasonably fast. I'm talking, 1% every 30 seconds when it wasn't in airplane mode. The battery lasted longer when it was in airplane mode but not much. I wouldn't be able to sit through an hour and a half movie. For one more month I did everything I could think of to isolate the problem including reformatting it a dozen times, using various size SD cards, using different cases in case it had to do with overheating... and yes, it did run hot when the battery drained... but none of the above worked. It was to the point where 30% drainage would occur suddenly sometimes and before I knew it, I was under 10%. It was unreasonable and so frustrating, I had no choice but to return it.Kudos to Amazon for having a great return policy. I give them 5 starts for being understanding.", "Date": "April 27, 2014"}, {"Title": "perfect", "Author": "MohamedAman", "ReviewID": "R1MJFINHL5GY5C", "Overall": "5.0", "Content": "the problem is amazon itselfyou can not get info about the seller easybut i bought one like this unlocked from ebay $400.with shippingi worked w/ my phone tmobil/england sim card/ egyptian sim card  nothing but perfect.", "Date": "April 27, 2014"}, {"Title": "works excellently,  as decribed", "Author": "marsha", "ReviewID": "R8EZ5XAGUTNWJ", "Overall": "4.0", "Content": "Basicly a large screen note 2.  Good quality, somewhat slower than latest tech.  But normally efficient samsung product, a bit complicated.  Might say it does too much compared to the ipad mini", "Date": "April 26, 2014"}, {"Title": "It is a good product.", "Author": "Lesvy Rodriguez", "ReviewID": "R12CXM1O50E07B", "Overall": "4.0", "Content": "I like the product. I think it must work faster, but it is good for me. The camera flash is missed. This accesory sould be contained. In the comparison price-quality, it is ok.", "Date": "April 26, 2014"}, {"Title": "Best Phablet I've Ever Had", "Author": "Sara Craig-Goodell", "ReviewID": "R18CMO4LBDYUIA", "Overall": "5.0", "Content": "Okay, it's the only \"phablet\" I've ever had but it does everything I need. I only wish the camera was better! It's super useful to pop out the S-pen and draw a quick sketch of a cosplay idea or quickly add a note or reminder to myself using the Google Speak button. It's a teeny bit buggy sometimes so it may need an update on some of my apps (or maybe a system update?) not sure, but overall I love this thing.Note: You cannot get 4G LTE with T-mobile, you get 3G at best but I've streamed video with 3G and it works just fine.", "Date": "April 17, 2014"}, {"Title": "very smart", "Author": "vivian_amazon", "ReviewID": "R2WDROGJ6D5WUY", "Overall": "5.0", "Content": "The small note is very satisfied, so did the transpotation. The screen is very beautiful and it can be used as a phone too. That makes the note can be connected with internet all the time. You can insert a  micro SD to enlarge your storage. I like it very much.", "Date": "April 11, 2014"}, {"Title": "Replacement for phone & tablet", "Author": "Dont Panic", "ReviewID": "R3IT1BB5YZAOLT", "Overall": "5.0", "Content": "Works fine with T-mobile $30/month pre-paid.  It isn't LTE, but who really cares as Netflix streams fine.  A couple months in and no regrets.", "Date": "September 29, 2013"}, {"Title": "it's pretty good", "Author": "Jiade Chen", "ReviewID": "R1EXQTYTM50683", "Overall": "4.0", "Content": "I like its size, color and weight. I just use it for WI-FI so far which is good, Just wonder how quickly it can connect with 3G network - will try.", "Date": "August 23, 2013"}, {"Title": "Timely delivery. Very good product", "Author": "linux_shadow", "ReviewID": "R24SEJW3JWSOA4", "Overall": "5.0", "Content": "We just cant stop loving this tablet. Nice size, convenient to use, bright screen, has everything we were looking for in tablet that my wife can carry with her in her hand bag.", "Date": "August 18, 2013"}, {"Title": "Someday everyone will want 8\" phone", "Author": "Richard", "ReviewID": "R13GS81GP0IOLT", "Overall": "5.0", "Content": "Awesome device, combined my Tab 10\" and Note 2 into one device. Just awesome, put in your sim chip and go.", "Date": "August 16, 2013"}, {"Title": "Best", "Author": "Franklin Njieugoue", "ReviewID": "RWFXH2RLRPJLR", "Overall": "5.0", "Content": "Best of all piece of hardware i have own so far. Recommended if you  are looking for tablet set to buy", "Date": "July 30, 2013"}, {"Title": "I love it!!!!", "Author": "Cristian Ricardo Polo Garza", "ReviewID": "R267JHRMPYJHZZ", "Overall": "5.0", "Content": "I only say this tablet is awesome, with the perfect size and very fine finishes.I highly recommend it.I can not be happier!", "Date": "July 30, 2013"}, {"Title": "great", "Author": "dee77", "ReviewID": "R1RIJRYBHVMDCQ", "Overall": "5.0", "Content": "I have the 5inch Samsung note and use it so much I wanted a back up in case something goes wrong ( nothing has yet) depend on it for work , and wanted this item for back up and so the kids would have one to play games etc.. on, ( that's how I justified it, anyway). have not yet used the phone/sim option, but did want it for travel in cases where wi fi might not be available...", "Date": "July 11, 2013"}, {"Title": "Love the device, terrible seller. DON'T BUY FROM FGS!!!!!", "Author": "David", "ReviewID": "R2Z7VQDJ74M0DS", "Overall": "3.0", "Content": "Hard to tell if it's a used or refurbished device. The home button doesn't seem aligned right. FGS Trading is terrible with customer service. Takes days to respond to your email. Found the item over 100.00 dollars cheaper on here so now I have to do a full return. FGS won't price match or even throw you a charger to make you feel better about losing 100.00 dollars. The device itself is great. Unlocked, works on my AT&T; sim and my girlfriends T-Mobile sim.", "Date": "September 30, 2013"}, {"Title": "It is very good product so far but I cannot register to Samsung Product in USA", "Author": "Amazon Customer", "ReviewID": "R16UR5Y4BE9DHS", "Overall": "2.0", "Content": "I bought this note to use mainly for my travel overseas and it has SIM card insertion port, so I may use as a telephone. I tried to register to Samsung but I could not do it. I called several times to Samsung USA and Samsung Korea and they told me that this product is not registered in Web site for registration in USA. They said that it could be manufactured in ? Malaysia and only way I could register to go Malaysia. Registration give you that you can synchronize all electronics made by Samsung such as TV, Camera and phones etc. I was very disappointed with Samsung's policy. This company is international and their products should be register from any country. Amazon helped a lot to solve this problem but no solution with registration problems. I am thinking to return.", "Date": "October 15, 2013"}, {"Title": "Just as described", "Author": "Happy With Product", "ReviewID": "R8FGG7BBWOQSK", "Overall": "5.0", "Content": "The Note Pad is working great.  This product has a microsim chip slot for people who want to use it as a phone.", "Date": "September 29, 2013"}, {"Title": "Great but able to activate sim and get data plan.", "Author": "junebug87", "ReviewID": "R1HO48S3L6MX41", "Overall": "5.0", "Content": "I received my tablet  and so far I love everything about it.To me it's just a big galaxy s3 and I don't mind that. I'm only facing one problem, which is getting a sim card activated. I went to att and tmobile, they are unable to do it. I did get a sim from att but tmobile wanted to charge me $10 for a sim we were not sure was going to work.I didnt want to take the chance of purchasing a sim.So if anyone could help me with this I would greatly appreciate it.", "Date": "July 18, 2013"}, {"Title": "good product", "Author": "Jenny", "ReviewID": "R37B0XYQ69ED79", "Overall": "4.0", "Content": "Everything is good to me , it 's very light weight  for carry on..battery life is longer  than my galaxy note 1 ...", "Date": "June 24, 2013"}, {"Title": "I get net/phone in Maine woods", "Author": "glenn greenwood", "ReviewID": "R19R45MJO1XOWM", "Overall": "5.0", "Content": "I can use Net10 and get both phone and internet on an 8 inch screen. A lot better than paying for data and phone separately (over $100 a month vs $50...I may go with Walmart STalk and get 3gb hi speed data and phone for $45.) Why anyone would pay nearly the same for a note 8 with no phone is what I would like to know.I do flip the phone around as others have said so volume controls are on top and buttons are to the right. I even re built my carrying case so phone/tablet could have volume controls on top and buttons on the right.This tablet has all the features and more!!! I have the internet and phone way out in the woods in Maine. I have a tee pee way in the woods beside a tidal river. I have a 25 foot 12 volt extension going to a plug on the headlight of my Honda Atv and I can continuosly have internet and phone way out in the middle of nowhere. Awesome!!!!Now, I am going to get the hook ups for a 12 volt tv.The tee pee has a woodstove and chimney. I tried the Indian method and nearly smoked myself out. For hot weather AC, I got a beach out front.  Thank you.PS The s pen and s note feature are great. I can remind myself of what I need to bring with me on my ATV when I head out to the woods (like bug spray). It sure beats trying to remember things! Before buying the Samsung, if I forget something...I had to do without until I got back to town which greatly angered me.  That s note is no gimmick and I use that more than I ever thought I would.Any problems and Amazon takes care of it. They are great also. Thank you again.", "Date": "June 9, 2014"}, {"Title": "OMG...just AWESOME", "Author": "Terrence P. Mullin \"private\"", "ReviewID": "RDH2J2JUOW541", "Overall": "5.0", "Content": "I love everything about this tablet.  And all I had to do to make it my phone was plug in my ATT SIM card. Done. So Awesome!", "Date": "June 7, 2014"}, {"Title": "Great unit", "Author": "Topper", "ReviewID": "R2LVCBK1CF8U11", "Overall": "5.0", "Content": "Fabulous screen, fast response times, good wifi but most of all, this is the European version which has a sim card slot in it. It's set for TDMA or ATT-T-Mobile phones.  When you go to Europe, you can buy a sim card over there and use this as a phone 'cause there's a speaker and a keypad!  You can also use it here in the use I've been told if you have an ATT or T-Mobile sim card phone. Just remove the sim card from your phone and insert it in this unit and it will work perfectly...so I'm told!", "Date": "June 5, 2014"}, {"Title": "LTE would make this phab fab", "Author": "Giberson", "ReviewID": "RDUNV2B2BU8QE", "Overall": "4.0", "Content": "Yes it is huge, but if you have large hands and don't like carrying multiple devices this is really the only logical choice.  My ATT SIM worked fine, but must settle for 3g speeds.  LTE would be ideal but probably an unacceptable battery drain.  Only other complaint is fragility.  I paid 200 for a new screen after a drop of under 3 feet, and the shop botched the reassembly.  Put replacement in an Otter to ensure no replay of that sorrow.  Still easily the only choice for a phone that doubles as a full blown work device.", "Date": "February 1, 2014"}, {"Title": "Great tablet", "Author": "Psych_prof \"Hercules Ginzberg\"", "ReviewID": "R1S2AULXBDHE4H", "Overall": "5.0", "Content": "I had the same experience as Elpidio at ATT store. I did not need a phone, all I wanted was a data plan ($15 a month, like the one my wife has on her I pad mini). After  about an hour of  struggling and consulting with the manager and calling tech services the Associate managed to set me up with the 3 gb data plan (pre-paid) for $40 a month.Aside from this relatively minor problem, I very much like the tablet. When I have to help my wife on her I pad, I am glad that I got the Galaxy.", "Date": "November 22, 2013"}, {"Title": "Most likely the best tablet in it's class", "Author": "Adrian S. Mechner \"Adrian Bellevue\"", "ReviewID": "R2ERG29IV14BM0", "Overall": "4.0", "Content": "Probably tree best tablet in it's class + it is cell phone enabled. Will only work with a regular phone sim card, not as expected with a data only card.", "Date": "November 6, 2013"}, {"Title": "Edison", "Author": "Edison J. Marino", "ReviewID": "RQ3RUXI6PA80N", "Overall": "5.0", "Content": "This is a great tablet. It is 5 stars in all aspects. The pen makes a great difference with other tablets without that facility", "Date": "September 13, 2013"}, {"Title": "Phone, no Phone 5100, 5105,5110", "Author": "ScarletKnight", "ReviewID": "R3OXNM5DBZARPH", "Overall": "3.0", "Content": "The 5100 and the anticipated LTE-4G version 5105 are phones as well and more importantly will be recognized as phones by the carrier networks so unlimited 4G networks you will get unlimited 4G on the N5100 and N5105.  The N5110 is wifi only and without having the broadband overpriced IMO at 399.  The cheapest I have seen the 5100 is for 570 and have not seen the N5105 available anywhere yet but I expect the price to drop as it becomes more available i would say no cheaper than a 100 more than 5110.  The 5105 the LTE or 4G version will most likely come out with a Carrier to justify the expected higher price.  However the 3G or Euro 4G version i think will perform just as well as most networks are not performing faster than the HSPDA+ networks aka 3.5G+.  By the time there are fully performing LTE networks widely available there should be better and more tablets to do what the LTE version can do at 200 so that makes this the happy medium for now.", "Date": "May 19, 2013"}], "ProductInfo": {"Price": "$355.78", "Features": "Samsung Galaxy Note 8.0 N5100 (Factory Unlocked) GT-N5100 , Quad Core , 2GB Ram  Specail Gift for Special One Fast Shipping", "Name": "Samsung Galaxy Note 8.0 GT-N5100 16GB 3G + WIFI table/phone international version/warranty - White", "ImgURL": "http://ecx.images-amazon.com/images/I/41a9AyYmyrL._SY300_.jpg", "ProductID": "B00BLLX9CI"}}