{"Reviews": [{"Author": "Yu-jin Chia \"Yu-Jin Chia\"", "ReviewID": "R1ETXDKFTELDXI", "Overall": "4.0", "Content": "I got one of these for a friend, someone who I know isn't going to be picky about hardware specs and speed. There are a lot of entry-level Android tablets out there now, some of which are sub-$100 models. You can actually get this one in that price range if you find it on sale, but what sets it apart from a lot of others is it's actually not half bad.On that note, a word of warning- most if not all other tablets in this price range are little more than child's toys. They tend to have very weak hardware that can barely handle Angry Birds and will lag seriously if you try to stream video. Furthermore the build quality is shoddy- they use cheap plastic and glass that affords poor viewing angle, has bad glare in bright light, and is very easy to scratch or break.The main reason I even gave this consideration is it's made by Asus. I've used Asus hardware for a very long time- everything ranging from motherboards to graphics cards, monitors, laptops, routers, and most recently the Nexus 7. Generally speaking, their hardware is very solid in terms of performance and reliability. In fact I can't think of a single time I've been disappointed by one of their products. I figured even if this tablet was suspiciously cheap, it was probably at least decent. And it is.First, expectations. This is not an iPad and you aren't paying $500+ for it. If you expect it to perform like an iPad, you WILL be disappointed. It's also half the price of the similar-sized Nexus 7 and of course not as nice. But for what you pay for, it's surprisingly good. Particularly, it has these pro points:-- A lot of internal storage (16 GB), twice the Nexus 7 base model and as much as the Kindle Fire HD base model.-- It is an Android 4.1 Jellybean tablet. Most tablets in this price range are 2.3 or 4.0-- It has a micro-SD slot, which is very noteworthy. Many significantly more expensive tablets, including the Nexus 7, do not have one (the cheapest decent one I know of is the Galaxy Tab 2 7, which is about $70 more).-- Pretty decent hardware and chipset- it's comparable to the Samsung Galaxy Tab 2 7. I at first thought the VIA chipset would be considerably slower, but it's actually so similar as makes no difference. It's robust enough to run some pretty heavyweight apps, and can stream HD flawlessly.-- Light weight, solid build. The tablet has a rubberized back that feels rugged and affords good grip. It is about the same size and weight as the Nexus 7.-- Good battery life. It lasts about as long as its more expensive cousins, especially if you don't use 'performance mode.'-- Comes with an AC adapter. Might not seem a plus, but these days a lot of electronics don't include one, which can be a pain.I suspect a lot of the complaints I've seen about apps and performance have to do with teething bugs. When a new device is released, this is pretty normal- a few updates usually fixes it. I've seen little in the way of these problems so far. That said, there are of course some downsides to this tablet:-- The display is average at best. Touch controls work fine, resolution is not bad, but the viewing angle is very noticeably more narrow than a lot of higher priced tablets (not terribad though, like the Dell Streak 7). It also seems to suffer more from glare, possibly because the backlight doesn't seem to be that powerful even on full brightness. It's by no means unworkable but if you're not looking straight at the screen or if you're viewing it in bright light, it's harder to make out detail.-- As with the Nexus 7, the speaker (note singular) on this tablet is pretty mediocre. You'll want headphones if you listen to music or stream videos. It works fine for things like Skype though.-- Ditto with the camera, which is essentially just a webcam. Unlike the pretty decent cameras on the Galaxy Tab 2, you're definitely not going to be using this to take pictures.-- No bluetooth. This is probably the biggest minus as far as feature set goes, and though the virtual keyboard is well done, it's still not great for things like email. This also means there's no wireless file transfer, though the SD slot and cloud storage mitigates that.-- Some apps are apparently still incompatible at this writing, notably Instagram 4.0 (however, I was able to sideload 3.5). I don't expect this to remain an issue for long.Overall, I would say this is a solid tablet considering what you're paying for it. I will also note though that you can 'fix' pretty much all of those cons by paying $60-70 more for a Galaxy Tab 2 7.0 Still, for a device that you can get for as low as $80 on sale, this is a surprisingly good performer. It's practical, inexpensive enough to gift, and doesn't cost so much that you'll be scared to use it.Edit: 8/9/2013- just to add a few extra points in the MeMO Pad's favor:-- This thing actually supports USB on the go. I was frankly amazed by this since a lot of much more expensive tablets and phones do not (including the KFHD). I've tried flash drives and a voice recorder; both work perfectly (you'll probably need a 3rd party cable for this).-- The battery life on standby is pretty good. I've let it sit for 2 weeks with minimal use (wifi and sync on) and it still has about 1/4 charge. Not bad.I've noticed that the 1st gen Nexus 7 has received a massive price drop (probably due to the release of the 2nd gen) that makes it much more competitive. The MeMO pad is definitely still the choice if you're on a budget though.", "Title": "Surprisingly decent budget tablet", "Date": "July 20, 2013"}, {"Author": "Shawn", "ReviewID": "R3F1W49558MK5J", "Overall": "2.0", "Content": "I purchased this to replace an older outdated tablet that i planned on giving to my 6 yr old. At first glance this tablet seemed amazing for the price, then i used it on a regular basis. I will start out with the good. The screen is responsive and works well, the battery life is ok if you set the WiFi as off when standby, and the apps that are downloadable work well. The internet and chrome seem to also work well for a tablet of this price. Now for the bad. I found that alot of the apps i like are not compatible with this model/tablet for some reason? There is no bluetooth, and the front only facing camera is horrible. Netflix does not work unless you ok with the audio and video being off by .25-.50 second. VuDu, Wikipedia, Netflix, Gamefly, and a few other apps are not even available from the play store due to \"not compatible\". I have had this for 1 week and decided to return it and spend the extra $50 for a Nexus 7 or a Samsung tablet.Pros-good screen and touch response, works well for some apps/games and for minor internet use. I did not test this tablet with skype!Cons-alot of apps are not compatible, streaming videos is not an option, camera sucks, no bluetooth.", "Title": "Very entry level.", "Date": "May 2, 2013"}, {"Author": "Takayuki Ono", "ReviewID": "R3FME5ESBIEBQZ", "Overall": "5.0", "Content": "I've been using Kindle Fire 1st generation as my comic reader. I loved it very much except one which is that there is no external memory slot. It was a little inconvenient to copy files into Kindle fire because of the slow speed and limited size. Now, with this one, I can add 32GB micro SD card to the internal 16GB space. If you pick class 10 micro SD with good card reader, the file copy is much faster.Adding to it, I can have a video chat via skype and camera, I can still read kindle magazines via Kindle app, and it's cheaper.My only concern is that the battery lasts 7hours compare to 8hours for Kindle fire as a spec. I'll see how different in the actual usage...So far, I'm very happy with the tablet.", "Title": "Great tablet for the price", "Date": "April 12, 2013"}, {"Author": "Jake Hart", "ReviewID": "R2E9SDY8MGP1G2", "Overall": "5.0", "Content": "I bought these for my two daughters to replace their Nintendo DSi XLs. They sold their DS and games for $300 so we were on the hunt for 2 tablets we could buy with that money. We were looking for a 7\" Android tablet made by a reputable manufacturer, that came with a current version of Android installed and had expandable storage via a micro SD card slot.This tablet had all of those things. I read several reviews that complained about the graphics and processor speeds. I bought these tablets despite the negative reviews and I'm glad I did because honestly I personally haven't experienced anything they were talking about. I'm not having any of those issues. My kids get partially paid for chores in Google Play gift cards and download TV shows, books, music, games and apps from the Google Play/Android store. They use the tablets to watch Netflix, Hulu and Amazon Prime on their tablets and the media looks great. It's not grainy or choppy and these little things have some killer speakers on them. Also if this tablet is for your kids, the parental controls are easy to set up.I looked at a lot of other tablets like the Google Nexus (made by Asus) but it was twice the price and didn't have a micro SD slot. Then I considered the Samsung Galaxy Tab which DID have a micro SD slot but was twice the price, had an older OS and had been on the market for 2 years.Bottom line... for $89 these were a super buy! We have not had any issues with them whatsoever. If you are a college student or an adult I could understand how you would want/need a bigger, better, faster tablet. However if you're looking for something to give to your 10 to 17 year old, it's perfect! The biggest selling point for me was...  at $89 my kids were able to buy them with their own money. That has made them feel a lot more responsible for the devices. Worst case scenario, if they lose it or destroy it, they won't lose any data because everything syncs to their Google account and they can afford to replace it themselves.", "Title": "What's not to like? Great value for the money! I would definitely buy again!", "Date": "July 13, 2013"}, {"Author": "rpv", "ReviewID": "R371IMMUCQLB78", "Overall": "5.0", "Content": "I used this tablet for few hours last week and for the price of $150 it is absolutely unbeatable. Obviously if you are into role playing games/fast car racing games, this will not cut.If you are into most apps like I use, it works remarkably well. I loaded up my google account and synced some of my appsSome of the apps I have tried on this tablet and which worked well are -- Amazon Kindle, Battery Monitor Widget Pro (shows accurate measurements), Car Reminder Maintenance Pro, Chrome, Draw Something, Google Drive, eBay, facebook, Flashlight (very handy), Flipboard, Keep (though Samsung note app is great), LastPass, Merriam Webster dictionary,  PAC-MAN, Pogoplug (gives me Terabytes on the go on wifi from my home private cloud), RealCalc (great calculator program), Nike Running+ (great visualization), Subsonic, Skype, Tweetcaster pro, Withings (weight watcher app), Youtube, Terminal Emulator. The video based apps are a bit choppy. When I used TWIT.tv, it was grainy at first, and I suspected wifi. But wifi was good based on other tablet experiences. For this price, you cannot go wrong!", "Title": "For the price, unbeatable", "Date": "April 21, 2013"}, {"Author": "Jus10", "ReviewID": "R1OLSMXCTHTMBG", "Overall": "4.0", "Content": "I bought this tablet because I wanted something smaller compared to my larger tablet.  I didn't want a iPad because I have a iPhone and I didn't want to pay more than 150ish for the tablet.  I considered getting the Nexus 7 but I couldn't justify spending 200 on something I will only probably use for a few months and then put away somewhere.  After reading some of the reviews I decided to go with this tablet because A. Asus makes the Nexus 7 and B. It looked basic enough for me to get what I want out of it.  I basically wanted a watered down Nexus 7.When I first received it, I set it up right out of the box and noticed it was running really choppy and slow.  I figured it was because it needed to be charged fully and restarted.  After doing that a few times the performance did not improve.  I was THIS close to just sending it back and getting the Nexus but I decided to reset it and try again; I'm glad I did.  It works MUCH better! Most of the apps I use on my iPhone and other tablet I was able to get on it.  It's fast and pretty responsive.I do have a few complaints:*Not all apps are compatibly with it (I downloaded the apps that weren't off the internet and they work just fine now)**Camera is \"meh\" (I'm not one of those that takes pictures with their tablets but the iPhone front camera is still the best by far!)*No bluetooth (I did the research so I already knew before I bought it. Still lame though)*Screen quality is a 6.8 out of 10.  (I was expecting better quality but I'm not all that much of a graphics queen)", "Title": "You get what you pay for", "Date": "April 18, 2013"}, {"Author": "crazybrit \"lifeisajoy\"", "ReviewID": "R2H6SPIZH6247Z", "Overall": "4.0", "Content": "I got this because I wanted a small, no-fancy-bells computer that can connect to the Internet in public spaces (no Wi-Fi at home) when I'm not home. I usually connect to the 'Net once or twice a day from home, and I feel that I miss a lot that way.As for the tablet itself, the startup time is a little slow (at least ten seconds). And as someone else said, there's no knowing when it's fully charged, you have to turn it on to see that. But that's a minor issue. I've also tested the camera and I agree that a rear one would be better, but I'm okay with it. Unfortunately though, I've owned it for two days and it's already crashed once, but I expected that. (saw that in other reviews) And file backup is recommended just as with any other computer, so I'm not going to store important files on it because you may lose them, and any apps that you've installed may go back to their original settings, when the tablet is rebooted/restarted. Also, check the tablet's startup/standby settings because it may autolock when you turn it off then turn it back on again. That's all I can remember right now.But so far the issues are minor because I'm going to use this tablet mainly to go on the 'Net and check emails. I don't foresee installing any apps or games, but I might add an SDHC card because I will download and then transfer files between this tablet and my old desktop computer (trying to get an Android simulator to do that).Overall, this is good for what it can do, and for what I need.Update 6/29: Took it to a public Wi-Fi spot. Worked great, ran smooth, no problems. Another reason to keep it.Update 7/19: I shouldn't make predictions! Of COURSE I've added a few apps and games, and a few \"live\" wallpapers too. All with no problems. And the tablet has automatically downloaded some upgrades (oops, don't want them to be automatic), I don't know if that's why it hasn't crashed for a good long while now. I also got a USB 2.0 A to Micro B Female / Male Adaptor, so I can use USB \"sticks\" with it. And oh yeah, the battery's good for at least three hours while I'm, uh, WiFi-ing. Still going to keep it.Update 7/23: PHEW...My bagstrap suddenly broke last night, the bag fell a few feet to tile floor...fortunately the bag was full of stuff so the tablet was ''padded''. And I'm using it now, so give it a point for toughness.Update 8/16: I got a mini-memory card stuck in the slot. Yikes. Couldn't get it out. Didn't call customer service because that's not covered in the warranty and I wanted same-day service, I didn't want to mail it or take the long trip to the closest authorized repair place. Found a closer place that charged a reasonable price. And since I can use regular USB drives with the Memopad (via the adapter) I'm not sure if I want to get another mini-sdhc card.Update Nov. 15: One of my worst fears: The screen got stratched. But not too badly. Very likely would have to pay for replacement so not going to bother right now.Update Jan 22 2014: It rebooted instead of unmounting an external usb drive. Not good. Will use the new charging/data transfer cable I bought to get files to and from this and other computers. May have to reset it again, this would be the third time. Gah.Update April 2014: It froze while transferring to a USB drive via the adapter. Maybe it doesn't like the drive or adapter, or maybe it was cranky, or...whatever. It's ok now. But looking into buying another tablet.", "Title": "It's good for what I need.", "Date": "June 28, 2013"}, {"Author": "Laura S.", "ReviewID": "R2TIII3GPGLHP7", "Overall": "5.0", "Content": "I got this on sale at Office Depot after Mother's day. I was looking for a tablet that I could use for my basic needs that don't really require my ASUS EeePC heating up my lap. I preferred to stick with the brand and not get an off brand at Big Lots. I like it so far. This is my first tablet. It seems perfect for a student that doesn't demand serious gaming, or a super crisp text. I read books just fine with it and prefer it. It doesn't have bluetooth, GPS, or a camera on the back, but I don't have that on my netbook either and I don't feel like I'm missing out on anything. The response is good. The ASUS pre-installed apps are nice, I wish I could get rid of some of the Google Apps that are pre-installed. Rooting instructions are not available on the internet yet, so I will have to wait for that. Anyhow, I would recommend this to anyone that likes to read, surf, play games that aren't resource hogs, and just wants to organize their electronic life on a handheld. I read a lot of reviews before getting this on different websites, and I think the people reviewing this was a bit bias. There is definitely a niche for this product. It is a quality product. If you don't need all the extras, but want a brand that will stand behind it's products, consider the ASUS MeMo Pad. If you want something high-falutin' look elsewhere. That's pretty much the bottom line.", "Title": "Better than expected", "Date": "May 30, 2013"}, {"Author": "Baal K'reeah \"Baal K'reeah\"", "ReviewID": "R2HTFFKPABFCVI", "Overall": "5.0", "Content": "This was a very economical price for a great performing Android tablet.  We have had it running for several weeks and it has performed as we expected.  It connects via wi-fi with no issues.  The battery was running down very fast at one point but we contacted customer support and they had us run the tablet down to 0% then hold the power key down.  Battery now gives us about 3-4 hours of run time.  It will be fine when leaving on all night to use as an alarm clock..The screen is very good for a 7\" tablet, clear and easy to read.  The Android system has worked as expected.I am very happy with what I got for the price.", "Title": "Great tablet for the price", "Date": "September 2, 2013"}, {"Author": "Nathaniel Clay \"NatT96\"", "ReviewID": "R4ATT36P8NMLM", "Overall": "5.0", "Content": "Reading and even watching many reviews online, many reviewers say how poor performing he tablet is, when honestly I have noticed it is not the tablet its jus the applications that running it and yes, by simply updating them, lots of performance issues were fixed. Netflix works flawless after updating it on he play store. the sound quality of the device is surprisingly loud and the ASUS Audio Wizard is very useful and allows sou d adjustments to your preferred media. Now the screen quality is not horrible, the only issue is the viewing angles (which have not bothered me because I have plenty of other devices). The device has no Bluetooth for keyboard use,I would care less because  have my MacBook. Gaming on the other hand can slow down at times (but not major lagginess) and depending on the game' I simply swipe the status bar down and choose \"Performance\" and sometimes \"Balanced\". The device plays media well, multitasking is surprisingly very good and many of the negative reviews all have there little fixes.PS:Guess what I typed this review on.UPDATE: ASUS ISSUED AN UPDATE FOR THIS TABLET IN APRIL (2013) TO 4.2 UPDATE, BUT IT NEVER HAPPENED. SO I AM CURRENTLY CONTACTING ASUS FOR EXPLINATION.", "Title": "Ok, Now This Tablet Is Not As Bad As it Seems....Nice 7 Hour Battery Charged Budget Tablet", "Date": "August 17, 2013"}, {"Author": "MICHAEL ROBERTS", "ReviewID": "R1LBAZXUC0F60A", "Overall": "5.0", "Content": "i recieved this 2 days ago and right out of the box i was very excited and nervous because some of the other reviews on here but i charged it up with no problems and i started importing all my purchased apps and other things to it and had no problem whatsoever i saw in other reviews ppl where having problems. I could not download the crackle app though and it does not have flash capability which suks but i can deal with it. also you cannot leave it plugged in because it does not have a smart charge capability and you can damage it that way by overcharging it. But overall performance is good 32gb sd card feature is awesome and the camera is good for skyping with the kids, very happy with the screen resolution and the speed no lagging or crashing and the movies look good. the brightness of the screen is good for me too. overall this is a good tablet i would recommend it and i will.", "Title": "very solid", "Date": "July 10, 2013"}, {"Author": "Asa Chapman", "ReviewID": "R1U17ZS77H1LAT", "Overall": "5.0", "Content": "I bought this one for the price and specs. It was a gift for my almost 2 year old daughter, it has already withstood a month of total abuse. Plays videos very well and has a very responsive screen.", "Title": "Works Nicely", "Date": "July 5, 2013"}, {"Author": "Town Without  Pity", "ReviewID": "R30FCGP0TX56NB", "Overall": "5.0", "Content": "First off, I am totally new at using a tablet!  My go-to device is a Toshiba Netbook, which I hope will last forever and a day.  That being said, I am still learning how to work on a tablet, but for what I wanted it for, it's perfect. I've downloaded an app and an ebook from the Chicago Public Library site, my son downloaded my favorite VLC video program to watch movies, I can check my email, see facebook and twitter, and all is good.I've seen complaints from others about only a front side camera and no bluetooth, but, honestly, the specs on this tablet are distinctly and openly listed on this very site, and there's no reason to complain about something that wasn't offered prior to purchase!  Read the spec description on any device first before ordering so you know what you're getting.I can't say what the tablet is capable of doing as far as game playing, but I've downloaded a Scrabble-type word game onto my tablet, and it's great.  My netbook has only 1GB of RAM, just like this tablet, and it's just not going to keep up with memory hog games, simple as that.Hope this helps anyone on the fence.  I think it's a very nice device for the price.  It's a perfect on-the-go device, IMO, when sitting in a waiting room and wanting to have something to read or do in the meantime.", "Title": "Good Product for Price", "Date": "August 8, 2013"}, {"Author": "Niraj", "ReviewID": "R2E9WB1SAS4IJZ", "Overall": "4.0", "Content": "It's a cool product ,worth the price odd 130$. Don't expect to be same in the ranks of iPads or Nexus, but yeah , it is a nice tab to hang around with.. Touch is good,though not impressed much with the camera.", "Title": "Cool Tab", "Date": "July 14, 2013"}, {"Author": "beatrice s", "ReviewID": "R2MB88WECTYTBR", "Overall": "5.0", "Content": "Easy set up, light weight, great to travel overseas to check email facebook google wifi available in most hotel or airport and you cannot complain about the cost...Bravo ASUS Great Product.", "Title": "Cheap and great Memo Pad tablet", "Date": "June 17, 2013"}, {"Author": "James W", "ReviewID": "R2L2ATX5R80IAE", "Overall": "5.0", "Content": "This is the third tablet I have had, and the first one I have been satisfied with. It fits what I was looking for in every way. Very happy with it. Great memory, wonderful screen resolution, just an all around solid tablet.", "Title": "Absolutely fantatstic!", "Date": "May 11, 2013"}, {"Author": "Reginald Anderson", "ReviewID": "R2NXL1HEDE48AL", "Overall": "3.0", "Content": "I bought the ASUS MeMo Pad 7 a couple of weeks before the new 2nd gen Nexus 7 was released. For the $100 price it is a decent tablet with Jelly Bean 4.2. My main problem with this tablet is that some of the apps from the Play Store are not compatible with the device. What upset me was the fact that the incompatible apps work with my old Samsung cellphone with Android 2.3 Gingerbread. The Play Store just tells you that the app in incompatible. No reason given. When the 2nd Gen Nexus 7 was released I immediately ordered it and was overwhelmed! But guess what? Those old apps that do not work with the MeMo Pad 7 work with the Nexus 7 and my old Android 2.3 cellphone. I ended up giving the MeMo pad 7 to a relative...", "Title": "ASUS MeMO Pad ME172V-A1-GR 7.0-Inch 16 GB Tablet ( Grey )", "Date": "August 9, 2013"}, {"Author": "jim boyle", "ReviewID": "R135DK79C4TM44", "Overall": "3.0", "Content": "Has very poor battery life (couple of hours). did not have Bluetooth. hard to find on/off switch. very nice screen,", "Title": "ok but", "Date": "August 4, 2013"}, {"Author": "A. M. Ahmed \"Amaiko\"", "ReviewID": "R2DMKJTN70BTP8", "Overall": "3.0", "Content": "this tablet is only for checking emails or surfing internet and maybe maybe some lite games.I thought I would be better than this but it's my fault because I did not listen to advices in some reviews.I used the tablet for 2 days and get bored of it ... the charger also verrry slowww even I use my camera charger for it because it charges the tablet faster.Anyways, Don't do make my mistake and pay extra $50 to get nexus even you need it for only emails because checking your email or surfing internet with slow tablet is going to be annoying task.but if you only looking for the cheapest tablet with good features get it but don't expect too much it's like these Chinese cheap tablets.", "Title": "Pay extra 50 usd and get Nexus", "Date": "August 3, 2013"}, {"Author": "qinhbu", "ReviewID": "RYMTEM7YREL1A", "Overall": "4.0", "Content": "we have a 10 inch tab, this is a valuable tab. the price is good for this product and meet our expectation", "Title": "good tablet", "Date": "August 2, 2013"}, {"Author": "Nancy L. Gossen", "ReviewID": "R2Q2Y9YU9U2YJA", "Overall": "5.0", "Content": "It is just the right size for me to play my games on.  I am addicted to Candy Crush and it is wonderful for that.  Good for all ages, my 8 yr old grandson likes it too", "Title": "Great", "Date": "July 10, 2013"}, {"Author": "isableandaking", "ReviewID": "R3CSJBKV21R33", "Overall": "2.0", "Content": "So I got this tablet, because of it's low price and attractive features - very similar to the twice as expensive Nexus 7 that is also made by ASUS, but a lot less powerful. It was primarily to be used for skype and some light news reading maybe some video watching. The 1MP camera that could do 720p for video calls seemed perfect and the single core processor should have been enough to handle video. Well that wasn't the case, the video was terrible - the resolution never went up from 320x240 - this is 2013 and I kind of expect more. I easily get 720p through my desktop computer, so it's not the network connection or anything like that. Then there was the microphone - the people on the other end said they could barely hear me, so I figured OK, it just needs an external microphone, no big deal - pluggied in my iPhone headphones and voila, they could hear me perfectly again. This wasn't the dealbreaker here, as it would have still provided basic functionality, but then I tried Netflix...It stuttered and spewed at NON-HD videos, I don't think it even gave me the option of using HD, afterwards I read that other people had been having the same problems. Oh and to add to the mix was that the videos were extremely silent on MAX volume settings, also the speaker is located on the back of the tablet, my little iPhone blows this thing out of the water with it's stereo speakers that are on the bottom. I left it to charge since it was charging very slowly, the next day I started using it again and it seemed like the battery went down really really fast, so I put it to charge again. After a couple of hours I checked on it and it said it was charged completely. Then I started using it again playing around with features and it was maybe drained to 62%, so I just left it in standby mode. After a couple of hours I tried using it again, but this time the tablet didn't react, it was like it's off. So I tried holding the button for a long time, but to no avail. Then I tried plugging it in and after maybe 5 minutes I tried pushing the button again, this time it worked, but it's like the tablet was off - the battery showed something like 50% and it was charging again. When it reached 70+%  I tried unplugging it and using it - all was well. But then again, it seemed like the battery didn't charge or didn't realize that it had a charge - so it went in OFF mode again and again. So yeah this is the dealbreaker, returned. Will probably have to get the nexus7 which costs around twice as much, but it will at least give me basic functionality.", "Title": "a really bad first android experience", "Date": "July 9, 2013"}, {"Author": "momsquad3", "ReviewID": "R2HRY4ASV3ETNX", "Overall": "5.0", "Content": "We really like this easy to use tablet.  We bought it for our 8 year old granddaughter.We were going for a kindle but this offered so much more. Very easy to navigate. The shippingWas fast.", "Title": "7in. asus tablet", "Date": "May 28, 2013"}, {"Author": "RUSKIN PIEDRA", "ReviewID": "RJ9Q51YJHHEX9", "Overall": "5.0", "Content": "Fast, clear pictures and sounds, quick downloads until connection is lost, which happens frequently but just as quickly reconnects and all is well.", "Title": "Excellent for videos", "Date": "May 15, 2013"}, {"Author": "Alex Boafo \"Atoapem\"", "ReviewID": "R1MN0DOWGZ7FFE", "Overall": "5.0", "Content": "I bought this tablet just to store and play music. Its performed fantastic. I was attracted to it cause of its 16 gb internal storage and its ability to read a 64 gb external mini SD card. Similar ones I bought could only read up to 32 gb. With a total of 78 Gb I am wll set for my music lifetime  It has perormed both extremely well Downloads are easy and fast Will recommend it highly for the reasons I bought it", "Title": "Fantastic", "Date": "July 12, 2013"}, {"Author": "8500ins", "ReviewID": "R1IHB1DRJOYQWU", "Overall": "5.0", "Content": "This is a perfect tablet for anything. It works great for games, browsing, apps, books...It's a great size, lightweight, it's small enough so you can take it almost anywhere, but not too small. I haven't found any problems with it so far. I also have a kindle fire- the touch screen is more responsive on it, but other than that I prefer my memo pad.", "Title": "Perfect", "Date": "July 1, 2013"}, {"Author": "Maria Lugo", "ReviewID": "R3NY38TSJ30RZ1", "Overall": "5.0", "Content": "I got one for my little girl, and ended up getting my whole family one; its a good product at a good price.The only thing is that its not compatible with Bank of America, Wells Fargo, and Pay Pal.", "Title": "Affordable Price", "Date": "July 6, 2013"}, {"Author": "wearemr", "ReviewID": "R1E79AMXUUJWZU", "Overall": "5.0", "Content": "Bought for 10 year old daughter. I was a little concerned about the apparent lack of memory, but after a few months of her using it constantly, I see that it has plenty to run the apps she wants to run. The display is top notch for watching movies. The battery life seems average. I would highly recommend buying the service plan along with this.", "Title": "She wont put it down", "Date": "February 26, 2014"}, {"Author": "lori moreno", "ReviewID": "R1PY1CE6KMRFVS", "Overall": "5.0", "Content": "i am a mother of 6 kids.. well we all know how kids love to share so we were looking in to tablets for christmas this past year. after about 3 months these tablets are still just as great as when they got them. i even bought for my lil sister, if you are looking for a great deal on tablets all memo tablets seem to be great :)", "Title": "great product for price", "Date": "February 18, 2014"}, {"Author": "Veronica Chatman", "ReviewID": "RG100EIXQ4A6R", "Overall": "4.0", "Content": "I brought for my daughter as a birthday gift and she loves it no problems so far she uses it to surf the web, play games,  oovoo, etc...", "Title": "PERFECT FOR AN 11 YR OLD", "Date": "February 6, 2014"}, {"Author": "G. Setaro \"GSV\"", "ReviewID": "R2IY1U0U6Y9DKM", "Overall": "5.0", "Content": "The tablet do the essential thing its responsive, fast, small, and you can take and go everywhere with it, for the price its a good and smart option.", "Title": "The tablet essential thing", "Date": "January 30, 2014"}, {"Author": "marbear", "ReviewID": "R1PVYH7RO43YIG", "Overall": "1.0", "Content": "Thinking I was purchasing Asus quality  NO NOT THE CASE!!!!!!!!!!!!!!!!!!!!!  Terrible picture I have the Asus tf700, which is winderful  this isnot. I downloaded an app  by disney I played the game for about an hour and then received a notice that this device does not support this app .  What does thsat mean??????????????????????  Also, I could not get apps for Bank of America, Amazon and many more commom ones.  I have ordered a kindle refurbished 32 gm with all the bells and whistles for 159.00  And, I know this will work..... and if I have any problems Amazon will stand behind their product and not insult my intelligence.  All I wanted was atablet I could carry in my purse.  I think I have solved that problem", "Title": "very disappointed", "Date": "January 7, 2014"}, {"Author": "Brian Rogers", "ReviewID": "R8SH4ZV8GORI2", "Overall": "4.0", "Content": "Good product for the price..No it's not an Apple or a Samsung, but functions just as well for the average tablet user for a fraction of the cost.  It's fast, has good quality video, etc....", "Title": "Great Value", "Date": "January 3, 2014"}, {"Author": "Casey Sullivan", "ReviewID": "RYU8JZ6JX6L51", "Overall": "3.0", "Content": "It does most things i could want.  Games being the only area lacking in power.  Worth the $87 i spent on it.", "Title": "Good afordable tablet", "Date": "January 3, 2014"}, {"Author": "Rachael Woolard", "ReviewID": "R3EMSMSOPXSEJL", "Overall": "4.0", "Content": "Widgets are handy and good apps for everything you need, but internet is somewhat slow, if you're used to an ipad.", "Title": "Worth about $100", "Date": "January 3, 2014"}, {"Author": "Erin Reed", "ReviewID": "R3MQM62ZFBQ6DV", "Overall": "5.0", "Content": "I bought this for my 7 yr old son for Christmas and he loved it! It's a little on the slow side, but it's perfect for a young user. It arrived exactly when expected and was packaged very well. The one I purchased was refurbished and described as being in good condition with a few marks and scratches around the outside. To be honest, I really had to look to find any mark at all. I am very happy with my purchase.As a side note, when it arrived, my husband and I opened it to check it out and pre-load some apps on it. When it turned on, it said that an update was available. My husband has a Nexus 7 and had installed this update on his, when prompted, a week or so earlier and it bricked his tablet. He did some research and that was a known issue with that particular update. He was able to fix his after some frustration. Thinking ahead, we made a backup of the ASUS before we installed the update, and just as we expected, it bricked it. Since he had already dealt with this and we had made a backup, it was no problem to get it working again. So be aware that there's a risk with installing the update it will probably prompt you to install. Make a backup and do some reading online first though, and it shouldn't be too big of a problem. However, that was no fault of the seller, so I didn't want to dock stars for it.", "Title": "Great Christmas present", "Date": "January 3, 2014"}, {"Author": "Scott Vallejo", "ReviewID": "R3HB584LBWAEKV", "Overall": "5.0", "Content": "Cant pry this out of my mother hand ever since I gave it to her a year ago! She is absolutely in love with her tablet!", "Title": "Mom Hasn't Put It Down", "Date": "January 2, 2014"}, {"Author": "Alan Cameron", "ReviewID": "R2GKWRIYT25L1L", "Overall": "4.0", "Content": "I bought this device for one of my children this Christmas, and she loves it. Granted, she's only 10 years old, and doesn't have any serious technical needs beyond You Tube, Netflix, and simple games, but this tablet is able to handle those needs well. I haven't experienced any of the delays or other glitches some reviewers experienced with Netflix or other video products. This tablet is well worth the money I paid for it.", "Title": "Good entry-level tablet", "Date": "January 2, 2014"}, {"Author": "Tammi", "ReviewID": "RDWN4A9VB09EL", "Overall": "5.0", "Content": "I purchased two of these for my Grandkids.  They love them.  It is great for book reading and streaming videos.  I have to limit their time on them.", "Title": "As a Gift", "Date": "January 2, 2014"}, {"Author": "Stanley", "ReviewID": "R2K85VJV0YURBB", "Overall": "5.0", "Content": "The device is good for the needs, I have and apps are very good,the screen is bright and clear and the sound is good too. Please be advise that youwill want to purchase, a screen protector, the finger prints linger on the table, so please have a good screen cloth to use.", "Title": "Great small tablet for Memos and E-reader and mp3s", "Date": "December 5, 2013"}, {"Author": "Pat O'Brien", "ReviewID": "R12ER7MJY124JT", "Overall": "3.0", "Content": "Well, here is the deal.  I simply wanted a tablet that would suffice to pick up email and do some surfing without having a lot of complicated stuff.  So far, it is doing okay.  It's a little slow in unblurring the text when it appears and, it is a little sensitive....jumps off site with slightest touch.  But for the price, it works for me.", "Title": "Okay for this user.", "Date": "December 3, 2013"}, {"Author": "Bryan Foster", "ReviewID": "R2T2E0MTN94O34", "Overall": "3.0", "Content": "So I want to preface this review by saying that I have not owned a tablet before this, just smartphones and PCs. This tablet is not particularly powerful, so I found myself having to restrict what I wanted to do with it. This is not a gaming tablet, and cannot handle most gaming applications. It is in the most essential of ways, a general use tablet.Pros: - This tablet has the phone shaped design for a 7\" screen, making it somewhat easier to hold than an 8.9\" or 10\" tablet. - It comes with the Play store unlike most tablets in this price range. - For the price range, this tablet performs well enough to be a solid pick amongst the other entry level tablets.Cons: - It is an entry level tablet. Long boot times and general lag in the performance - The tablet will freeze from time to time in loading applications and waking up from sleep. - Tablet shuts off at random times for no reason. - There are no drivers to connect the tablet to the PCOverall:  This is a very good entry level tablet, but if you are a power user or are looking to play games with a tablet, you may need to look elsewhere as this tablet will not deliver a good gaming experience. I would suggest that this would be an excellent tablet for reading books or magazines, but not much else.", "Title": "Good entry-level tablet, not good for much else", "Date": "December 2, 2013"}, {"Author": "__eMpTy__", "ReviewID": "R2QB61CXX0IPHE", "Overall": "5.0", "Content": "The tablel is only and single core, but it has 768mb of RAM and the processor is clocked at 1.7ghz. It works perfectly as a Chromecast remote (and bed-side web browser) for my parents.", "Title": "Minimal, but functional", "Date": "November 19, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RE0ER9N1MW7CS", "Overall": "5.0", "Content": "Okay yes, it's an entry level tablet, it's not going to do what the $250-$500 tablets do. If you're buying a $100 tablet, you should know that anyway. However, this one does allow me to do anything I want to do on it, I watch Netflix & YouTube on it, play games like Candy Crush, Angry Birds, & Fruit Ninja, I use the Kindle & Sony apps to read on it. My son has some interactive books on it too. It does all of these things. Which is what I wanted it to do. I use my phone for social media so I didn't need a tablet for that, but I know it can't have instagram, not a big deal. I do shop on it with the Amazon, ebay, Walmart, & Target apps. It's a good tablet for someone who doesn't want to spend a ton of money and just wants it for casual use. I do use head phones when watching movies, but I'd do that with my computer or a more expensive tablet anyways so that doesn't bug me.", "Title": "Good basic, entry level tablet.", "Date": "November 18, 2013"}, {"Author": "Delano", "ReviewID": "R3O7OSM3XP7TW0", "Overall": "4.0", "Content": "Very good tablet, fast and easy to use. have not had any problems. has 3 modes (Balanced, Power Save & Peerformance)Everything works great on Balanced mode. its best to lay some games in Performance mode to prevent minor stutter.I gave it 4 stars because certain applications are not compatible with this tablet. (eg. Instagram,  BBM etc.)", "Title": "Great!", "Date": "November 14, 2013"}, {"Author": "Gerald D. HARDIG", "ReviewID": "RMHJQ91KEV9DK", "Overall": "5.0", "Content": "Bought it for my wife as a birthday present and she loves it. Hasn't put it down since. Will order more atems in the future.", "Title": "Everything is as advertised.", "Date": "November 10, 2013"}, {"Author": "...theBuanna \"...DamnHonky\"", "ReviewID": "R118QOXXIL4BQ0", "Overall": "5.0", "Content": "Where do I start...bought VisualLand 7\" & was happy but no G play or front cam, and charger issues (like a crow bar, the plug wreaked havoc in the port and eventually only able to charge (slowly) from USB). Gave that one to my daughter and bought a \"DragonTouch\" (good reviews) but malware !  Dλππ& 4.2...returned & bought NextBook  w 4.1 and would've loved it - but it struggled to do simplest tasks plus temperature issues due to over taxing an  inadequate os...then got a \"hisense\"? (spelling) again ...underpowered & malware. When would it end ?AT LAST...\"ASUS\"memo pad\" (because it was under $100.00 and in stock) @ WalMart and with little else to choose from...I took it out of the box...KNOWING I would soon take it back ...dreading initializing process yet again.But almost as a godsend...the little tablet that could ...(Netflix...Skype...EweTube...ect.) no problems ! It is set on a 4.1 platform & 1.6 G  ram Speed -YES... only one speaker...only one cam... NO bluetooth...but I promise THE perfect under $100.oo tab for most everyone...EVERYONE ! ...except your \"gifted 7yr. old\" I was so happy (and still am) I wrote this review...on my new Asus. (Oh yeah , 24hr support)  ...theBuanna@hotmail-comments welcome.", "Title": "Finally...I found it ! $85.oo ...perfect tab (but no dual cam)", "Date": "November 3, 2013"}, {"Author": "Callison", "ReviewID": "R3LFSTD2UHGTOT", "Overall": "4.0", "Content": "Bought this for my Granddaughters birthday; she's had no problems with it and uses it all the time, (since August 2013)for her homeschooling and internet browsing. Hasn't experienced the unexplainable crashes that I did with the 10\" ASUS MeMo Pad. Very happy with it.", "Title": "7\" ASUS MeMo Pad", "Date": "October 27, 2013"}, {"Author": "Ricky Devon Hicks", "ReviewID": "RI3NSN8L2BF8C", "Overall": "5.0", "Content": "My niece was blow away with the tablet for her sweet sixteen party. A big hit!I would recommend this low cost product for anyone in the market and on a budget.", "Title": "Ricky H- review ASUS MeMo Pad ME172v-A1-PK 7-inch 16 GB Tablet", "Date": "October 22, 2013"}, {"Author": "Yuriy", "ReviewID": "R53J1MMN0ZOXC", "Overall": "5.0", "Content": "I really like this tablet. Easy to use and great quality!!! If you are looking for great 7 inch tablet this is the best choice!", "Title": "Great Tablet ever!!", "Date": "October 22, 2013"}, {"Author": "D. Cash", "ReviewID": "R2W8MSEF671NYD", "Overall": "5.0", "Content": "This thing has been perfect, battery last well over 8 hrs of use, a little less watching movies or streaming video from places like Max Go and Netflix. I would do it again, actually already have for the daughter, but in pink.", "Title": "Best $120 I ever spent", "Date": "August 30, 2013"}, {"Author": "Jerry Basinger", "ReviewID": "R3OOZ0D5SBNE3O", "Overall": "5.0", "Content": "this item does everything my apple I pad does except  it has no rear camera.  I love and use it all the time", "Title": "Love the size", "Date": "August 30, 2013"}, {"Author": "richotep", "ReviewID": "R3O3WCC0COFHUR", "Overall": "5.0", "Content": "Good deal, arrived on time, product as described, this is one of the best under one hundred tablet on the market.", "Title": "Good Deal", "Date": "August 29, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2AJDQY2R3WPJ9", "Overall": "4.0", "Content": "Pros: Screen, \"feel\", speed, simplicityCons: Volume, app availability, slippery uncasedI bought each of my 6-year old twins one of these tablets.  I spent some time making it kid friendly with apps they can use, and locked the rest using the included app-lock app.  The tablets have a quality feel to them, but they were slippery in the hand.  I quickly bought cases for them, as I was nervous whenever I saw my kids walking around with them. We used them for a long trip in the car, and I loaded movies as well as games.  It was a success!  The kids were able to play games or watch movies that entertained them for the long trip.  They were even stimulated by the educational titles. We do not use netflix, so I cannot comment on that, but HBO GO works well.I would recommend this tablet for someone who has very simple needs from a tablet.", "Title": "Great tablet for the price!", "Date": "August 28, 2013"}, {"Author": "Jared", "ReviewID": "R23CMB0F79FZ6", "Overall": "4.0", "Content": "Overall a good deal.  Use it mainly for reading books and it works great.  Battery life is about 8-10 hours.  I did end up disabling some of the apps that came with it.", "Title": "Asus Memo Pad", "Date": "August 23, 2013"}, {"Author": "M. Gubala \"Matt G\"", "ReviewID": "R1ME1E3FTQATHZ", "Overall": "5.0", "Content": "at its market  price approx $155 @ staples in 2013  probably was a decent deal, ever since the HD  version came out and the price dropped $50, I cannot believe the value.  16gb  is not usual in many entry level price tablets in 2013  that alone is a big + Acer support is very good in 2 separate trials  I was comparing with an 8 gb tablet  Samsung 7 Inch  But this one was the right choice. A 16 GB jelly bean tablet @  approx. $99 bucks cannot be beat. The ability to install apps to the internal storage  helps with those apps that don't work with  Micro SDHC cards  Some super users might complain, however I am only coordinated enough to use 1 or 2 apps at one time, built in Asus' front end and task manager, bundled apps are a built in +++", "Title": "GREAT VALUE  for a good tablet", "Date": "August 17, 2013"}, {"Author": "Naresh", "ReviewID": "R184C67SJ645BO", "Overall": "4.0", "Content": "Very cute, small , handy tablet. Google options are awesome.sound is not great.good for money spend.not a great tablet. but kind of ok tablet.", "Title": "Nice tablet", "Date": "August 16, 2013"}, {"Author": "Brianna", "ReviewID": "R1ITIOFS0N2S3D", "Overall": "3.0", "Content": "I rated it three stars because it's useful and what I needed, but not what I was expecting. There were minor bugs I had to work out, like it randomly shutting off or closing out my work when the battery bar said it was full, or refreshing my pages on google chrome. Overall, without those faults, this was a good product and I would have a fifty percent chance of recommending it.", "Title": "Review", "Date": "August 15, 2013"}, {"Author": "Ramon Tavarez PS-2800", "ReviewID": "R2CRQKIQMPSPPS", "Overall": "5.0", "Content": "This tablet doesn't wait to execute applications, widgets or settings.its 16 GB memory provides enough storage space.Lightweight design, but strong.", "Title": "A very fast device!", "Date": "August 14, 2013"}, {"Author": "Leonard E. Sica", "ReviewID": "R2JRBUBIDNS02E", "Overall": "4.0", "Content": "She loves it ,, works great for her playing APP's ,, cannot seem to load Flash Player though . Overall pretty cool", "Title": "For 6 year Old Girl", "Date": "August 5, 2013"}, {"Author": "Pedro F Cairo P", "ReviewID": "R320O0V0HJRT8R", "Overall": "5.0", "Content": "Very good team, very fast, excellent connection, only negative has a camera in front of the screen, excellent for skype", "Title": "Excelent", "Date": "August 5, 2013"}, {"Author": "oepixels", "ReviewID": "R1CLH1T5VX1OM0", "Overall": "4.0", "Content": "This tablet is a good deal for the price, initially was looking for one under $100 but wasn't excited about anything i found in terms of specs and the reviews were no help either. so I came across this one; although never bought anything ASUS but i know their laptops are good, so i went for it, not expecting much! to my surprise it was worth every penny at the end, still don't think it will work as well as the high end ones maybe half way but for basic stuff this one is the one.", "Title": "Good tablet for the price, would nuy it again", "Date": "August 4, 2013"}, {"Author": "Randall Arrington", "ReviewID": "R156GFPV033GZA", "Overall": "5.0", "Content": "I purchased this a couple months ago as a gift for my wife on her birthday.  She absolutely loves it.  I may have lost her to it.", "Title": "My wife loves it", "Date": "August 2, 2013"}, {"Author": "Amable", "ReviewID": "R2SH3WGSNRBW11", "Overall": "5.0", "Content": "Although it is not comparable to Nexus 7 the price make it a good deal. It runs all the apps from play store and if you are going to use it for reading mails, surfing the Internet and running average applications, this is just what you need.", "Title": "A very good item for the price!", "Date": "August 2, 2013"}, {"Author": "Debra Skurski", "ReviewID": "R1E2LWLUTXDVH9", "Overall": "4.0", "Content": "This pad performs quite well and is very economical.  It is limited with respect to the camera since it is front facing only and 1 MP.  However, it is excellent for social networking, playing games and checking email and news.  Works well for what I need.", "Title": "Good Pad for the Money", "Date": "July 28, 2013"}, {"Author": "Deana", "ReviewID": "R39Y64A4508912", "Overall": "5.0", "Content": "I bought this for my 7-year-old grandson so that he would leave my iPad alone. What a good purchase. He has his games on the pad but I hid any icons that I did not want him to access such as stores or internet. It is a good size for him and he is really enjoying it.", "Title": "New toy", "Date": "July 18, 2013"}, {"Author": "Bella", "ReviewID": "RGWQB85MYIF2R", "Overall": "3.0", "Content": "I liked this tablet. It was a little heavy though and some of the apps crashed. I ended up returning it and getting a refund because I want the newer version and this version just wasnt doing it for me, its very simple and its not the updated version of android so some of the apps didnt work. Its the perfect size i just wish it wasn't so slow sometimes. Great company though.", "Title": "Okay", "Date": "August 18, 2013"}, {"Author": "Mary Walters", "ReviewID": "RE50ISQGFV5L5", "Overall": "5.0", "Content": "Have thoroughly enjoyed it! Everyone in the house is always using it to check emails, or watch you tube.  It's great because it's portable, lightweight, and does as much as our computer, just faster", "Title": "ASUS  Memo pad", "Date": "August 11, 2013"}, {"Author": "amazainiak \"amazainiak\"", "ReviewID": "R1E6J99H9O15NT", "Overall": "3.0", "Content": "I bought this tablet to replace the galaxy tab 1, 7 inch.  No comparison to the Galaxy tablet, the screen has a funny glare on it that makes watching movies almost unbearable.  It seems pretty fast but as stated in other reviews Netflix  and other streaming services have an audio delay that I was unable to fix.  Games such as temple run 2 will play but about 15 seconds in to a run you get lag and then die.  I purchased this to do two things, play simple games on and stream Netflix and other services.  It was unable to do either efficiently.  Purchased the galaxy tab 2 7 inch to replace this.  I would not recommend this table, very poor display angles, week processor, and no Blue-tooth.  Spend a little more and get something that will work.  I used this tablet for 4 days and reset it twice to make sure it wasn't something I did that was making Netflix lag.", "Title": "ok tablet for 99 bucks, but NOT good for streaming services", "Date": "August 6, 2013"}, {"Author": "STEVE S. \"Steve S\"", "ReviewID": "R3PZU004XJR6KE", "Overall": "4.0", "Content": "I bought it because of the good reviews, and the decriptions seemed to fit my purposes well. I need it for browsing the internet around the house as well as on the road; and backing up pictures when I travel. It proves to be good value because, for $110, it works like it is supposed to - connects to the available wi-fi network well, battery lasts 5 days for my daily usage of about 20 minutes a day so I can probably stream a 2-hour movie, memory storage expandable by an extra 32 GB with a micro SD card.I later bought a memory card reader from Plugable Technologies from Amazon which can plug into the talbet's micro USB port (same port to charge it with). Then I tested putting the memory card from my camera in the card reader; and I could copy pictures from it to the micro SD card in the tablet. So mission number 2 accomplished.The text on the screen is not as sharp as I would like it to be sometimes, and it has glare under the light. But I already expected these slight imperfections so it is not a problem.I would recommend it.", "Title": "ASUS ME172V 7-inch tablet", "Date": "July 27, 2013"}, {"Author": "rws", "ReviewID": "R1KGWAI9QOO6L3", "Overall": "4.0", "Content": "It is a basic tablet. For the price, it is a good deal. I've had mine for about a week and am very satisfied. It does what I need. I just check email, surf the net and play some games. I found it very responsive and have had no trouble with downloading apps. I love the size. Again, it is a good basic tablet and it should not be compared to a more expensive tablet.", "Title": "good deal for the price.", "Date": "July 4, 2013"}, {"Author": "Madelein Fernández", "ReviewID": "R1V7EE0U51KED8", "Overall": "5.0", "Content": "The tablet is beautiful and works properly, I have not had propblemas with it, I recommend it, it is a good option at a good price", "Title": "Good product", "Date": "May 26, 2013"}, {"Author": "dedapr", "ReviewID": "R1GJCK7P5THPFL", "Overall": "3.0", "Content": "It works better than most Chinese tablets in this price range. At least it latches on to WiFi quickly each and every time you turn it on, which is something most Chinese tablets don't do w/ out switching on/off the WiFi a few times!Pros: SD card is nice, micro USB data/charger port is convenient, pebbled finish on back is easy to hold on to & you can use it w/ the Google Play store as well as the Amazon App store.Cons: Is not compatible w/ many popular apps. Even simple weather and card game apps. The on/off switch is recessed and very hard to operate even if you have long nails, same w/ the rocker volume control. The screen is barely bright enough at full brightness, it's OK but you need to keep it on max, resolution is OK but could be better. No Bluetooth or HDMI out.Is it worth slightly over $100? Probably if you only really need a tablet for audio/video podcasts to use in any room around the house like I purchased it for, still I'll try and get used to it for another week and then decide if I should return it or not.** After spending more time w/ this tablet I have decided to return it for 2 important reasons. 1- The recessed on/off and volume buttons take way to much effort to get pushed in. Obviously they are used many times a day and are defective by design. 2- As I mentioned I bought this mainly to be able to listen and view podcasts around my house. There is a definite lag between the audio and video! It's always out of sync. I compared it side by side to an Asus TF-300, a Galaxy Tab 2 and a Lenovo A7, and the others worked fine while the Asus Memo was out of sync. Terrible experiance trying to watch anything!", "Title": "YOU GET WHAT YOU PAY FOR", "Date": "June 29, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RNJ6M7KSAIDU2", "Overall": "4.0", "Content": "I bought the Asus for my nine year old.  She plays games, and watches movies on the go.  I would have went with a Nexus 7, but I want to be able to add a microsd card.Pros: MicroSD CardCons: Battery last about 4.5 Hours.", "Title": "ASUS", "Date": "June 10, 2013"}, {"Author": "El Panameno", "ReviewID": "REDKUF5R18XD7", "Overall": "4.0", "Content": "If you are not sure if you need a tablet or not for the price of this one you could safetly learn the ropes about using a tablet. This unit has a very fast respose, works very well. It takes a little bit of playing around with it to know some of its functions. It syncs music and pictures but does not copy videos unles they are in MP4 format. The camera does not take great pictures but hopefully you own a digital camera that does and you can trasfer your pictues, this device will display them well. the speakers have low volume but it plays great with the ear bugs. works very well with the most popular apps such as Netflix, facebook , pandoras to mention a few. Do not accept all kind of app. some banks do not have apps for this operating system. IT is good entry level tablet for a very reasonable price", "Title": "nice entry level tablet", "Date": "April 25, 2013"}, {"Author": "Vladimir Theodore \"Apollo Lir\"", "ReviewID": "R287OLBR5CLXU5", "Overall": "5.0", "Content": "Bought this tablet for my 4 yr old son for his b-day. There was was no way I was gonna spend more than double for an iPad. So far, so good. I pre-loaded kid apps and Netflix before I gave it to him and he's the happiest kid ever right now. For the most basic functions, it works great. Only thing is, it only has 1 front facing camera which is pretty weak so if you want 2 cameras, spend the extra few bucks for the Galaxy Tab", "Title": "Perfect price for what it is", "Date": "April 12, 2013"}, {"Author": "KNB \"KNB\"", "ReviewID": "R30KTUMUOMMESD", "Overall": "2.0", "Content": "Pros:Price! (at under one hundred and forty dollars in 2Q 2013, this is a decent value)Yes it has a microSD slot (and it read my 64gb card w/o a problem)It has Android JellybeanFeels well built IMO with a housing that is not a fingerprint magnetFlat/thin enough (it's no iPad mini but it's also less than a third of the price)Cons:NO bluetooth!! (dealbreaker for me)Screen has a horrible viewing angle (SVGA) (dealbreaker for me)Battery life so soLow quality front-facing cameraNo rear-facing cameraOS lags at times (especially with mp4 videos and perhaps others)I'm taking mine back (purchased at a competitor for more than Amazon sells it for) after only a few days due to the cons. If the above cons are not important to you, this is a very good buy.", "Title": "Narrow viewing angle! NO bluetooth! Low price! Entry Level!", "Date": "June 3, 2013"}, {"Author": "Mason Karle", "ReviewID": "R3KKLK513MMNUS", "Overall": "1.0", "Content": "Pros:- cheap- solid build- microSDHC slot- 7\"- ASUS brand (not random Chinese factory named)- Running Jelly bean (4.1)Cons:- Horrible screen (actually blurry at random times when watching videos...most likely a defect)- Horrific and quite simply unacceptable viewing angle. The other reviewers warned...I thought it would be different. It wasn't. When watching sign-language videos you have to be directly infront of the screen to watch clearly. The slightest movement causes the signer to dissappear.- Suprisingly heavy- Sluggish- Doesn't work with JWLSL! Got JWLSL working but had to sideload it. Then when working switching between videos it would freeze. Simple task not handled by this little guy!Bottom line:Save your money. Spend an extra $40 and try the ASUS MeMO Pad HD 7 (on it's way).", "Title": "Not good for using JWLSL!!!", "Date": "September 26, 2013"}, {"Author": "suzatm", "ReviewID": "R28SPG2PPND1PF", "Overall": "4.0", "Content": "I wanted a small tablet where I could load all of my books on from the various ebook sources and have a to do list and calendar  all in one device that i could put in my handbag and have with me at all times.  The ipad mini is something that for the money spent is not something i want to take with me and pull out.  The Kindle Fire does not allow the other book sources to be on it.  I had the Samsung Galaxy Tab 7 for one day and hated it.  The touchscreen was not very responsive, browsing was difficult because of the reaction problem in addition to the constant dropping of the wifi connection, I could not get my Verizon email account to be recognized and there were too many pages of apps.  The Asus MeMo is exactly what I was looking for.  Everything downloaded quickly, the wifi connection has been strong, easy set-up, all of my books are there, my Verizon and my Gmail accounts installed right away and browsing with zoom was great.  The screen is very responsive and the resolution is very good.  The only complaint that I have so far is that the light at the lowest setting is still too bright for me.  All in all no regrets in the purchase.  When/if Apple  kills my mini ipad 1st gen I will definitely be looking at the Asus MeMo 10 inch hd tablet.", "Title": "I really like this", "Date": "June 22, 2013"}, {"Author": "Minnesota Debs", "ReviewID": "R2NADJ2ZR9944V", "Overall": "4.0", "Content": "I hated this thing. I found out I am definitely an Apple person, not an android person.  Why 4 stars then?  I gave it to my daughter who never had a tablet.  She has just launched a career in sales that is quickly rising and she needed something exactly like this.  It tells her how to get to her sales calls, keeps track of her leads, entertains my grandson, etc.  And you Android people know exactly how it does all these things.  It is not an issue for her that it's an entry level tablet because she's an entry level user; she doesn't even have a smart phone.  Go ahead and buy it for the tablet neophyte in your life.", "Title": "Great buy, just not for me", "Date": "November 28, 2013"}, {"Author": "Ari Schwartz", "ReviewID": "R18VI7VOFN7V9O", "Overall": "5.0", "Content": "she loves it! Bought a refurbished name brand for just $20 more than a generic china 7 inch tablet with 3 x the warranty period and local authorized repair stores if necessary. Working fine so far.", "Title": "bought it for my daughter", "Date": "May 22, 2014"}, {"Author": "Elias", "ReviewID": "R11CSUZBOT825Z", "Overall": "3.0", "Content": "Was a good deal for the price and for my younger kids to play games on it.. playing Netflix on it is real choppy and out of sync. There is a camera on the back side with no light ... but you can add a mico sd card , mine has a 32gb installed", "Title": "good for the price", "Date": "May 20, 2014"}, {"Author": "marekhi", "ReviewID": "RISP3ZUSVR871", "Overall": "5.0", "Content": "great tablet. i buy as gift white asus memo and it works great. looks beautiful. it have a nice screen", "Title": "great", "Date": "May 19, 2014"}, {"Author": "momof7", "ReviewID": "R3FL3TO8UHWABG", "Overall": "5.0", "Content": "I own three of these tablets now, so obviously, I like them.  My son has broken his screen in three places and still the thing works fine.  You don't even realize you're working with a cracked screen.  I had gotten the cheaper android tablets before this and the Asus is SOOOOO much better for hardly any more money.  Get it.", "Title": "great", "Date": "May 14, 2014"}, {"Author": "Dovahkiin", "ReviewID": "R24P0EOY91ZKEM", "Overall": "4.0", "Content": "Bought this as a gift for a coworker. They say it's exactly what they wanted. Who am I to argue?", "Title": "Good", "Date": "May 12, 2014"}, {"Author": "ZODA", "ReviewID": "RT44S24SRGM14", "Overall": "1.0", "Content": "I bought it in October and remove the packaging for the month of December as Christmas gift was my girl 2 months after using it without problems, one day while trying to turn on the screen started flashing and there was no way start secion. When viewing the page I found out that Asus, is a failure that occurs when the load is damaged pink. I live in Venezuela and now for me it is very cumbersome to use the warranty. As would do to recover the gift of my child?", "Title": "Inconforme", "Date": "May 8, 2014"}, {"Author": "Henry Lemasters", "ReviewID": "R30KID7HNC4W9B", "Overall": "4.0", "Content": "I'm an asus fanboy so its hard for asus to disappoint me. I only gave it 4 stars because there are some apps that wont run on it yet, but thats not really their fault.", "Title": "Great economic tablet.", "Date": "May 7, 2014"}, {"Author": "David Loomis", "ReviewID": "R3EW83MAHL4A4G", "Overall": "5.0", "Content": "We have learned that by turning the brightness lower, the battery lasts longer and it is still bright.  Very satisfied.", "Title": "Works well, good deal at a good price.", "Date": "May 3, 2014"}, {"Author": "Paul Bennett", "ReviewID": "R2V6W0GUR9OJ1D", "Overall": "3.0", "Content": "This tablet was a 1st for our 7-year old.  It keeps her happy, but for a power user, it falls short.Pros:  Asus quality, inexpensive, color choices, decent battery.Cons:  Slow to restart or start from the off status, Slower CPU means certain apps hang easily.Overall, this is a good starter tablet or as a power E-Reader.  Good for watching movies too.", "Title": "Nice starter tablet", "Date": "April 30, 2014"}, {"Author": "Smithd20", "ReviewID": "RJR93K2F7WUKY", "Overall": "5.0", "Content": "stores all my movies, music, games, apps, and more!i use it to place library books on it for trips, and music for work, and it's amazazing!", "Title": "Love it!", "Date": "April 30, 2014"}, {"Author": "Ginny Stack", "ReviewID": "R1AXX7N9CVACU8", "Overall": "5.0", "Content": "This is a great little tablet. I bring it everywhere. The only thing I wish it had was a flash. The camera takes good pictures outside but inside you need decent lighting. Anyway overall it is great and the price is good. I've checked out others and thus by far beats them.", "Title": "GREAT!!!!!", "Date": "April 26, 2014"}, {"Author": "Kevin Schlirf", "ReviewID": "RARXPKQCFAGCR", "Overall": "5.0", "Content": "My child says that the tablet does exactly what it was bought for, allow him access to homework assignment and emails. He has never complained about anything concerning the tablet. I think it's time for me to get one.", "Title": "Great", "Date": "April 23, 2014"}, {"Author": "Lam Shan Kwok", "ReviewID": "R1IMI6TGV7ZIV0", "Overall": "2.0", "Content": "Resolution is totally no good at all and device itself runs not smooth...find a better deal on tigerdirect and bestbuy.", "Title": "resolution is not really clear and runs not smooth", "Date": "April 22, 2014"}, {"Author": "LI", "ReviewID": "R1PJBWTPC84HZ5", "Overall": "1.0", "Content": "When i watch video, the screen make me faint.The screen is not clear at all. The screen makes the video out of shape.", "Title": "screen is bad", "Date": "April 20, 2014"}, {"Author": "Melody", "ReviewID": "R2A1EK6O8P30ID", "Overall": "4.0", "Content": "I am a college student and needed a cheap and light tablet so I could follow along with the professors powerpoints. It's great for simple stuff like notes. I don't use it for games. It can hold a charge for a few days with occasional use. I like it, small, light, cute, and affordable!", "Title": "It does the job", "Date": "April 17, 2014"}, {"Author": "Jose", "ReviewID": "R1B1KUO8D34601", "Overall": "4.0", "Content": "This tablet is a good product for the price. It has intalled android sos. I think it met the expectations.", "Title": "Very good", "Date": "April 17, 2014"}, {"Author": "Juan Zuluaga", "ReviewID": "R2PRUYCBVYZ1I2", "Overall": "1.0", "Content": "i bought this tablet but its bricked. cannot update, the battery died. i contact the seller and help me with my issue but it feels upset abpout quality of this tablet", "Title": "didnt work", "Date": "April 16, 2014"}, {"Author": "Vicky C. Galloway", "ReviewID": "R2NOCW7MZI5265", "Overall": "5.0", "Content": "I had been looking at tablets and e-readers for a long time. Getting ready to go on a trip I saw this on sale and decided to try it. I am new to apps. and widgets, (and lions, and tigers, and bears, oh my!) but have had no problem downloading and using apps on this tablet. Some apps, such as the Kindle app, open a bit slowly but work beautifully. The camera leaves a lot to be desired but that's not what I bought it for. I really like the notes app. I love the size. It just fits in a purse or tote while the larger ones don't. Display is nice also. I am thinking about buying one for my mother to introduce her to electronic toys.", "Title": "Great 1st Tablet", "Date": "April 14, 2014"}, {"Author": "John Robson", "ReviewID": "R3BLHVH6F86Q7V", "Overall": "5.0", "Content": "I rated this product five stars because it's everything I hoped it would be and more, I would recommend this product to anyone who wants more than just a reader tablet.", "Title": "I love my ASUS Tablet", "Date": "April 9, 2014"}, {"Author": "alivora", "ReviewID": "R1LZI2QVP73INO", "Overall": "1.0", "Content": "I was very unhappy with this purchase. It had issues from the very start, particularly with the camera. It would just stop working and the screen would turn green, I would have to re-start the tablet to get it working again.The tablet continued to have issues, I was careful with charging due to the warnings the instructions gave, and yet there were days when the screen would refuse to turn on after charging. It would take several minutes to coax it into turning on.Finally, one day it just shut off altogether. None of the reviving tips I read online worked, and the thing is now completely dead after about 3 months of use. I would not purchase this product again.", "Title": "Definitely not satisfied.", "Date": "April 8, 2014"}, {"Author": "Rafffffyyyyyy", "ReviewID": "R2ZPDDLKKEWYAR", "Overall": "4.0", "Content": "Still working fine... Being used by my 3 year old nephew... Dropped it once and still working... Used for watching shows for m nephew", "Title": "Works well", "Date": "April 8, 2014"}, {"Author": "ana guerra/ali zurita", "ReviewID": "R197YOYRL21Q98", "Overall": "5.0", "Content": "is an excelent tablet, the best by price and valor, i recomedent this tablet for everyone. goog for asus. the best", "Title": "the best", "Date": "April 7, 2014"}, {"Author": "L.Smith", "ReviewID": "R1H5C53FX9XI3E", "Overall": "4.0", "Content": "Bought this tablet specifically for travel. Did not want to spend a lot of money as I will not use it everyday. Works well has older Android operating system so it is not compatible will all the apps that are available, but if you are looking to put books, movies, games and the basic apps this is just fine. Pictures viewed on the web or saved on it look quite good, although the camera is so so, difficult to take pictures with a front facing camera, I most likely will not use that feature except in a pinch. I feel it was a good value for what I purchased it for but would not recommend for everyday use not enough compatibility with apps.", "Title": "Wanted a tablet for travelling", "Date": "April 7, 2014"}, {"Author": "Bob Roush \"a Jeep guy\"", "ReviewID": "R1QPLWMNOLADD2", "Overall": "5.0", "Content": "I bought this tablet to access things on Google Play and use with my Amazon purchased music products and download things for my Kindle, so this tablet does not get near the usage as my iPad.  I do like its small size and light weight.  I also use it for accessing the internet when I do not want to carry my iPad and it works great for that.The products seems to work for everything I use it for and would buy another one should the need to replace it arise; it is a good product and I would recommend it to anyone who is looking for a good Android tablet!", "Title": "ASUS MeMO Pad ME172V-A1-GR 7.0-Inch 16 GB Tablet", "Date": "April 5, 2014"}, {"Author": "Antonio", "ReviewID": "R2WTBJVQ6LPZUC", "Overall": "4.0", "Content": "I have no concerns about this product currently. All appears to be going as expected. Should something develop, I will be sure to update this review.", "Title": "I am pleased", "Date": "April 5, 2014"}, {"Author": "Karen Sullivan", "ReviewID": "R12O968EOKGBSX", "Overall": "5.0", "Content": "Expected nothing less, it's ASUS!! Our household is filled with ASUS products, routers, laptops, motherboards, tablets...NEVER been disappointed. Always solid, well built and dependable. This little jewel of a tablet is perfect for my 11 year old. It is very well built, sturdy and stiff. It gets slept on, dropped, stuffed in backpacks....never misses a beet. Screen is not to bad to look at at all, processor speed is good. OS is reasonable to manage. Wireless connection is solid and dependable. Have yet to need to fiddle with it in any way.", "Title": "Great product", "Date": "April 3, 2014"}, {"Author": "Teresa Wilson", "ReviewID": "R2HT6LUZ9UW2ER", "Overall": "5.0", "Content": "This tablet was easy to set up and works great. It does exactly what I got it for and I am very happy with it. I was able to transfer files onto it from my pc, download apps from the Google Play Store, access my email and the internet.", "Title": "Great Price & Great Tablet", "Date": "April 2, 2014"}, {"Author": "Traniqua", "ReviewID": "RWS082FMADFQM", "Overall": "1.0", "Content": "This tablet came to me in, not a box with the proper materials inside to keep it from becoming damaged, not even a heavy duty envelope, It came to me in this sticky wrap foam paper that was wrapped tightly around the nexus box, the stuff had a very thin layer of foam between the Adorama Camera company sheet of paper that was on top of the thin sticky foam. So as you can guess, the actual box the nexus came in was scratched up an dented in pretty deep. So all that aside, when i opened the nexus box the plastic that comes on the tablet looked like it had been used, it was also scratched an sticky. Smh, and sadly it goes on. When i took off the plastic, i proceeded to turn the tablet on. Turned the tablet on, an in the middle of the screen there was a vertical digital line! nothing was wrong with the background but, anything you do on the tablet had that digital vertical line down the middle. I initially sent an email to the seller an received no response back. So looked up their number an gave them a call. When i finally got someone on the phone, they told me that they do not repair or replace. They told me all they could do was refund my money to amazon an then amazon would refund it back to me, then politely added in that it would take a minimum of two months before i would receive my money.  I would not recommend anyone to buy from them. They dont care about the customers or their product at all.", "Title": "Not What I Expected!", "Date": "April 1, 2014"}, {"Author": "Marcia Rellinger", "ReviewID": "R330UYHDGV1HHN", "Overall": "5.0", "Content": "but it is simple to use and I have arthritic fingers and I still can use with ease.....thanks very much", "Title": "It is not a high end pad", "Date": "March 31, 2014"}, {"Author": "Snowgirl", "ReviewID": "R2DTR68XZ6NDG0", "Overall": "5.0", "Content": "The quality, price, and timely receipt of this tablet was great.I mostly use this for reading, and emails, and I am not disappointedNot able to read very well in the bright sun, but everything else is very good..", "Title": "Am glad I found this", "Date": "March 24, 2014"}, {"Author": "cristy", "ReviewID": "R18ILWPO8PFRNZ", "Overall": "5.0", "Content": "We got this as a Christmas gift and haven't had any problems with it.  My Child pretty much just uses it to play games on at this point.", "Title": "My child loves it!", "Date": "February 23, 2014"}, {"Author": "Steven Pawson", "ReviewID": "R2GJCV7NOUTBKX", "Overall": "4.0", "Content": "Bought one of these refurbished off of 1sale.com (sorry Amazon) and it is the first tablet I've ever bought, though I've used others at Best Buy, friends houses, and at college for various projects. I like simple reviews, so I've made this as concise as possible.Pros:- 1024X600 Display. While it isn't as fancy as the iPad or the Nexus, the display is more than enough for daily use. Can I discern the pixels? Yes, but any text bigger than 6pt font is clear and Netflix quality is more than acceptable.- Battery life. The MeMO Pad has 3 settings for battery; saver, balanced, and performance. To test its lifespan I played \"The Dark Knight\" from beginning to end at 75% brightness on balanced mode with headphones in. The movie is 2.5 hours long, and when it was over the battery was at 56%. This means you can watch about 6 hours of video before needing to recharge.- Processing speed. No problem playing \"Plants vs. Zombies 2\". 1 GB of RAM seems to do nicely for whatever apps I am using. There is a 1 second lag when rotating the screen, but no major problems.- Micro-SD slot. From my own research, this is noteworthy. While the 16 GB internal storage is great (that's about 7 standard definition movies, a few hundred pictures, plus a whole bunch of apps), if that isn't enough then you can triple your space with a 32 GB micro-SD card.- Full access to Google Play Store. Need I say more?- Runs on Android 4.1 OS. My last phone had the 2.3 version. After only a few minutes I could see the difference in performance. 4.1 is a lot faster, more user-friendly, and makes for a more enjoyable tablet experience.Cons:- No outward-facing camera. I don't expect or even want this to act as a digital camera, but I know this could be a deal-breaker for some people.- Touchscreen keyboard. I have fairly large hands being almost 7' tall, so I can't imagine how regular people feel using the sideways keyboard. Vertically, it isn't too bad, although the weight distribution feels off. Some of the keys are in odd places too, like the period and enter keys. Not the worst thing in the world but not as comfortable as preferred.- Speaker quality. This tablet is designed with headphones in mind. The EQ software does a good job but the single internal speaker isn't meant for anything more than system noises. It isn't terrible though, and given how cheap this tablet is, this is probably to be expected.- No Amazon Instant Video. I get that Adobe Flash player is no longer compatible with newer Android tablets, but come on! Half of the reason I love Amazon Prime is to watch Prime videos. Netflix and Vudu are compatible, but Prime has some titles unavailable on either.Final Verdict:I really like this tablet. High marks for battery life, display, and processing power. While the lack of an outward-facing camera and the quality of the speakers make it fall short of its more expensive competition, I would highly recommend it for anyone who wants a tablet for traveling or to use at work.", "Title": "Great Value as a Starter Tablet", "Date": "February 23, 2014"}, {"Author": "Ann-Marie Griffeth", "ReviewID": "R30VMLS5RD2JLY", "Overall": "3.0", "Content": "I have all three colors on this tablet were purchased as a gift to my kids, I don't know if the pink one I got had a weak screen or some thing else but the other two have taken a beating form my 2 and 3  year old and nothing has happened to them. The pink one we have no idea what happened to it, our daughter set it down and when she picked it back up the screen was cracked. We have had it less than a month. I highly recommend if you buy these you spend the extra I think it was $14+/- for the extra Warranty.", "Title": "ASUS MeMO Pad ME172V", "Date": "February 23, 2014"}, {"Author": "Ashley", "ReviewID": "R52LM6P7D0CZE", "Overall": "5.0", "Content": "We were required to got a tablet for nursing school to practice documentation.  I ordered this one because of the price and so far it has held up nicely.  Does everything I need it to do and for half the price as some other tablet brands!", "Title": "WOrks great!", "Date": "February 22, 2014"}, {"Author": "shopperV", "ReviewID": "R3OFUCPMW6W70L", "Overall": "3.0", "Content": "This is diffenently not a tablet for adults or skilled adults. If you just want something to play a few games on or check your email... well ok. This is a entry level tablet.!", "Title": "OK for little ones.", "Date": "February 21, 2014"}, {"Author": "jose jimenez", "ReviewID": "R1ZXJNJFHC8G8B", "Overall": "5.0", "Content": "I but for my friend and her said i like that.The color is good and the material is handover.", "Title": "is very good", "Date": "February 15, 2014"}, {"Author": "aimen fituri", "ReviewID": "R3TKNGRHF3S56H", "Overall": "5.0", "Content": "i buy this MeMo pad for my little baby she is old 2.5 years and she is very happy with this MeMo pad also i can close the apps with password .", "Title": "i like it", "Date": "February 14, 2014"}, {"Author": "JOYCE", "ReviewID": "R1M3TG3CMQ2DE8", "Overall": "5.0", "Content": "this is a must have very easy to use and fits nice in your hand I have told a few people to get this tablet...", "Title": "best buy ever!!!", "Date": "February 13, 2014"}, {"Author": "Astoria Dones", "ReviewID": "RBL3LZ5W80IG3", "Overall": "5.0", "Content": "My son was very happy with his gift. I bought him this tablet for his birthday. I love Amazon for many reasons but the main reason is variety. This is always my first stop when I'm looking for a gift.", "Title": "Tablet For my 13 year old.", "Date": "February 11, 2014"}, {"Author": "mmmmmmmmmm", "ReviewID": "RZ2ETMTYZCPDI", "Overall": "3.0", "Content": "its fine I guess it would be great for a kid it seems a little slow and it is very heavy for a small tablet but overall it is fun to have and  I have flappy bird on it so I can not even think of getting a different one ha!", "Title": "flappy bird", "Date": "February 11, 2014"}, {"Author": "Judith Parrish", "ReviewID": "R2KM1QAEVY4C67", "Overall": "5.0", "Content": "This is everything I thought it would be. It is easy to use and it is very entertaining.  Thank you very much.", "Title": "Everyone should have one.", "Date": "February 8, 2014"}, {"Author": "Samantha", "ReviewID": "RW8JVM0BN1B1U", "Overall": "5.0", "Content": "I love it, it wasn't too expensive and it's pretty fast. Definitely a great buy. Purchased this when my \"dragon touch\" tablet turned out to be utter crap. But then again it was a gift. Oh well, upgraded to this and am very happy!", "Title": "Great tablet", "Date": "February 8, 2014"}, {"Author": "B.Raquel", "ReviewID": "R2CXOLPRXSWMUZ", "Overall": "5.0", "Content": "If you're looking for the best bang for your buck, I'd say ASUS won't let you down. Don't believe me check out more reviews. Bought this for my mother who's not very computer savvy and she has no complaints.", "Title": "I swear by ASUS", "Date": "February 4, 2014"}, {"Author": "Keith Swist \"Keith S\"", "ReviewID": "R33PFXU7VYFKMM", "Overall": "2.0", "Content": "Bought 2 for my kids for Xmas a month ago. They've both needed hard resets and often freeze. Cheap, but not worth it in my opinion.", "Title": "Glitchy", "Date": "February 1, 2014"}, {"Author": "ANGEL \"COBRA\"", "ReviewID": "R1KO3P8RC4LQTF", "Overall": "3.0", "Content": "IT'S NOT AN IPAD, BUT IT DOES THE WORK DECENTLY. ENOUGH FOR $102..PRETTY NICE TOY FOR THE INTERNET BASICS.. THANKS", "Title": "IT'S OK NOT ALL THAT.", "Date": "January 31, 2014"}, {"Author": "D. E. Dreyer", "ReviewID": "R84ASG4CF4131", "Overall": "2.0", "Content": "I don't know if the one we got is defective or what... I purchased one of these for my girlfriend in mexico so we could video chat better. The speakers and mic create a feedback loop so we're back to her old laptop. I was left with expensive browny points.", "Title": "Sucked for video chatting", "Date": "January 31, 2014"}, {"Author": "Michelle Price", "ReviewID": "R3B2TOIS7M8GDW", "Overall": "5.0", "Content": "I really enjoy this product...no problems with it so far...very satisfied...its a perfect size. The games look good on it.", "Title": "love it", "Date": "January 31, 2014"}, {"Author": "Ronald W. Holcomb", "ReviewID": "R8M2TATJIODOP", "Overall": "3.0", "Content": "Unit purchased works fine, however, the description of the item did not provide enough information to alert me to the fact that this unit had fewer features than other units appearing from the same search. LESSON LEARNED: read the detailed descriptions at the bottom of the page closely.", "Title": "pay close attention to details", "Date": "January 31, 2014"}, {"Author": "Juan Pablo Moriamez Moreno", "ReviewID": "R1WJ372L0KR6OY", "Overall": "5.0", "Content": "The Tablet has been working nice. IT has good features exclusive from Asus. It is a little bit slow but for normal use is fine. WE did not try with more powerful games", "Title": "Nice Tablet", "Date": "January 29, 2014"}, {"Author": "Simon Liebman \"Simon L\"", "ReviewID": "R2SHKFLBVWRZYZ", "Overall": "5.0", "Content": "This unit has good battery life and I have a few 16Gb MicroSD cards so the internal memory is not an issue.", "Title": "Love it!", "Date": "January 28, 2014"}, {"Author": "mijohnst", "ReviewID": "R3GJSG94TCY91N", "Overall": "3.0", "Content": "I bought this for my son over Christmas.  For a kid it's great.  We both play Clash of Clans and you can really tell the CPU performance difference with my Galaxy 8.", "Title": "Meh...", "Date": "January 27, 2014"}, {"Author": "D. Fox", "ReviewID": "R1F5XEY58UY7YX", "Overall": "5.0", "Content": "This is a great little tablet! I read many of the reviews before purchasing, and was a little hesitant; I have bought a few off brand tablets on price and been disappointed in their speed, and compatibility with many apps. This unit works great in comparisons to those. I only had one app with compatibility issue, and the speed is good for a budget tablet. I think some people are expecting high end tablet speeds and display quality from this unit. I was able to purchase my tablet for $90, for that cost it has performed better than any other budget tablet I have owned! I would have paid up to $130 for this type/quality of tablet. The Asus performed well with all the apps I testing on it. Only one had compatibility issues (media PlayerPro). The tablet does lag at times when running multiple apps, and requires a reboot every now and then. But I have come to expect this and even worse lags from all budget tablets, I highly recommend this one and it is worth the slight extra cost. Battery life is a little low, with constant use you will probably only get about 3-4 hours out of it, it will easily last a day with standard use.  I let my kids use this one, they are not as concerned with quality and speed, and can stay tethered to a computer or power outlet when playing for extended periods of time..", "Title": "Great budget tablet, Works as expected. Great for kids.", "Date": "January 27, 2014"}, {"Author": "Gabor Kovacs", "ReviewID": "R3QF1CMLJE9ALO", "Overall": "2.0", "Content": "Works, but it's slow. I would liked to have gotten something more expensive/better. You would be better off to get something a little more expensive.", "Title": "Junk", "Date": "January 22, 2014"}, {"Author": "Dhaval Parikh", "ReviewID": "R3BMKQZPONGPGR", "Overall": "5.0", "Content": "i have installed lot of apps in this but still working good... video quality is awesome.. i can play youtube videos in HD.facebook, hangout and skype is running perfect i just dont like camera qulity but in his price this device is awesome..... love it..", "Title": "its an awesome device in this price..", "Date": "January 22, 2014"}, {"Author": "brandon landry", "ReviewID": "R1VEUZYYJN6I01", "Overall": "4.0", "Content": "It works well only thing I don't like about is that, the camera is only front view. Other than that it works fine.", "Title": "good deal", "Date": "January 19, 2014"}, {"Author": "danny chow", "ReviewID": "RVTTVTZAF9LK2", "Overall": "2.0", "Content": "The battery tends to over heat easily after 30 minutes of candy crush game play multiple times.  It will crash and shut itself down.  After it cools down, it can be used again.  Other competitive models that I have (nexus 7, cheaper $50 to $100) do not have that problem.  The graphic is comparable with nexus but the overheating is an issue at least for the asus 7 that I have.  I ordered it in september 2013.  About 4 months ago.  Unfortunately, Amazon only has one month exchange policy.  Does the manufacturer has a exchange policy.", "Title": "Overheating problem", "Date": "January 18, 2014"}, {"Author": "dee cocca", "ReviewID": "R2ENETZCTFEOP4", "Overall": "5.0", "Content": "I bought this as a Christmas gift for my husband. He loves it and the battery life is 4x my Kindle' s battery life. I will be buying another one for my daughter's birthday. Great tablet at a great price.", "Title": "Better than my Kindle", "Date": "January 16, 2014"}, {"Author": "Nathan L. Reitz", "ReviewID": "R12XCGVBRIN177", "Overall": "4.0", "Content": "For what it is (a cheap entry-level tablet), it's a fantastic deal.  I've used plenty of other cheaper tablets that were pure junk, and didn't even have enough processing power to run angry birds.  Not this tablet.  It is a solid contender, and has handled everything thrown at it (except the driveway).  Luckily I purchased a Square Trade warranty with it, so the drop was covered.  I was so impressed with this tablet, I bought another.", "Title": "Great tablet for the money!", "Date": "January 15, 2014"}, {"Author": "Lysa", "ReviewID": "R39M3VRYU93IGH", "Overall": "5.0", "Content": "Bought one for my daughter for Christmas. She loves it. Easy to use, full Android features, fast set up. Her only grip is that the power button is positioned right where a corner strap for most tablet cases sits, so it turns off sometimes, but other than that, she loves everything about it.", "Title": "Cliche, but it IS a good tablet for the money.", "Date": "January 14, 2014"}, {"Author": "monserrate", "ReviewID": "R32X2ONNAR91E0", "Overall": "5.0", "Content": "This tablet is just the one I was looking for as a back up tolook fat my emails, surf the web and playing games.With my table i will be able to save my phone minutes for speaking with family and friends.Thank you Amazonmmarcano", "Title": "I enjoy my Asus tablet", "Date": "January 1, 2014"}, {"Author": "Josh T. Reeves \"joshreeves\"", "ReviewID": "R464I56OI22DY", "Overall": "5.0", "Content": "Love it. Nice sturdy tablet and good deal/specs for the price. My son has dropped it few times and it keeps ticking (which can't be said about his previous Lenovo tablet).", "Title": "Excellent, Solid", "Date": "December 31, 2013"}, {"Author": "momof5boys", "ReviewID": "R2015XR13WVHTO", "Overall": "5.0", "Content": "Got these for my 2 12 yr old boys for Christmas, and they are great. They have been downloading apps and playing games all week. They are fast loading and good graphics. These will not play 3D games but they don't seem to mind. I got these for $80 each refurbished, but they look good as new and I bought them each a new case so no one knew the difference. Not even my boys!!", "Title": "Great tablet for price", "Date": "December 31, 2013"}, {"Author": "E. ARIAS", "ReviewID": "RI4M6STDB49N3", "Overall": "4.0", "Content": "Bought this for my 14 year old nephew. It's easy to handle and quite fast. Wished the front camera was better but for the price,  can't complain.", "Title": "Great for the price.", "Date": "December 30, 2013"}, {"Author": "E", "ReviewID": "R1SX7R1ZCB0FJL", "Overall": "5.0", "Content": "Very nice tablet, it can not compare to ipad but for the money it's very good! I bought this for the kids and they love it, very easy to use, nice sound, as clear as it can be, will recomend if anyone is looking for an inexpensive tablet.", "Title": "Very nice!!!", "Date": "December 29, 2013"}, {"Author": "L. Webber", "ReviewID": "RGAMU5QKQVFF6", "Overall": "5.0", "Content": "Just as described fits great, easy to install my 14 year old son did it. Keeps the tablet protected. Thanks", "Title": "Fits", "Date": "December 29, 2013"}, {"Author": "Hoot Chirp Chirp", "ReviewID": "R23YRSGPZBE19S", "Overall": "5.0", "Content": "We ordered 4 refurbished lenovo tablets for our kids for Xmas. When one came damaged we got this as a replacement. Now I wish I had purchased 4 of these instead. They are sturdy and work great. Not all of the apps in the google play store work though.", "Title": "Great little tablet!", "Date": "December 26, 2013"}, {"Author": "Reynold Haywood", "ReviewID": "R1JT32VS73MAJW", "Overall": "4.0", "Content": "Great tablet especially for children not to pricey only thing i think this model should have carried a dual camera and not just front only but i guess for the price it's acceptable", "Title": "Asus Tablet", "Date": "December 25, 2013"}, {"Author": "Jody", "ReviewID": "R2KNXTKEE4Q4BR", "Overall": "1.0", "Content": "The first two weeks we've had it, the tablet would not charge correctly.  We sent it in for repair it was gone for 3 weeks.  Got it back and now every app we install stops working.  Asus just said sorry for the problems your having, just send it back in.  It is a hassle to mail this in and they make you pay for shipping every time you send it in. Do yourself a favor and spend the extra money to get the Nexus 7.  We have one and it is wonderful.  I will accept this as a loss and maybe take a trip to the apple store.", "Title": "It has been in the shop longer than we've used it.", "Date": "December 24, 2013"}, {"Author": "Robert Koons \"ROb\"", "ReviewID": "R2KOTURQ8E5RM7", "Overall": "4.0", "Content": "Soiid 7 inch tablet.  For the money its delivers what is expected.  Tablet does lag sometimes so don't think that this will be blazing fast.  Purchased a quadcore 7 inch tablet from W Mart for same price that has no lag at all and is generally faster and better screen resolution but it is only a 8GB so in fairness I think the 2 equal out.  Although you can add memory to the 8gb tablet and there is not much you can do with the lag in this one.  Still satisfied with the purchase and wouldn't hesitate to recommend it to a friend.", "Title": "Solid 7 inch tablet", "Date": "December 23, 2013"}, {"Author": "Sherry 2013", "ReviewID": "R27ZW9EPGVHAV5", "Overall": "5.0", "Content": "It works really great! Easy to use.  My 10-year old uses it often. Great for the price! Highly recommended for all ages.", "Title": "No problems with it.", "Date": "December 22, 2013"}, {"Author": "Jose Figueroa", "ReviewID": "R1R3P6W8CST885", "Overall": "5.0", "Content": "is a gift for my niece and she likes me much hope to continue buying products asus as they are good quality", "Title": "I like this product", "Date": "December 21, 2013"}, {"Author": "The diva \"That's me\"", "ReviewID": "R1LMOO2GHJQR5U", "Overall": "5.0", "Content": "I have this tablet for my kids 3 and 5.  For them it is perfect.  I love the security features and the fact i can lock up anything on it.  it is a good little tablet - dropped many times and has cracked screen but still works.  if you are looking for something to do more than stream internet and watch online tv - this is not machine.  however if you are using for online tv and kids games - it works great.", "Title": "Good for kids", "Date": "December 18, 2013"}, {"Author": "M. Rainey", "ReviewID": "RAJM2G5XXTXV2", "Overall": "4.0", "Content": "Wow, an Asus Tablet for about $100.  Great price and functionality.  Only negatives no GPS or Bluetooth.  This is a good buy.", "Title": "Great for the price...", "Date": "December 18, 2013"}, {"Author": "marcus tardieu", "ReviewID": "R1R2Q8YLP2U3D4", "Overall": "1.0", "Content": "I am very disappointed with this product from this seller... I purchased the asus brand over the cheaper tablets because I know it should be a better quality but yet three months later and it is not taking any charge... Don't think the tablet I bought from this dealer was brand new as advertised... very dissatisfied and disappointed!", "Title": "3months and it has stopped working", "Date": "December 17, 2013"}, {"Author": "jimmy", "ReviewID": "R12MF49OCSJSCG", "Overall": "4.0", "Content": "great tablet I haven't had any problems and it is fast and everything it says great buy especially for the price", "Title": "great tablet", "Date": "December 15, 2013"}, {"Author": "Anne Thompson", "ReviewID": "R38B9X05LR2BYF", "Overall": "5.0", "Content": "Great little tablet. This was purchased as a gift for my 8 year old son. It's easy to use and works great!", "Title": "Nice tablet", "Date": "December 15, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R32M9OGFA22B04", "Overall": "3.0", "Content": "A great device.  No bluetooth though.  I would like to have seen a few more features.  Overall, it is a very dependable and handy tool to have.  I use it often and have found a few accessories help to make it more useful.", "Title": "Entry level.", "Date": "December 15, 2013"}, {"Author": "Juan Rios", "ReviewID": "R2KG5DUGEP3D7T", "Overall": "5.0", "Content": "dad loves it and its very usefull my dad wanted something so he surf the web without turning on the pc so booooooooom there you go", "Title": "GOODDDDD", "Date": "December 6, 2013"}, {"Author": "Brady Ware \"Brady Ware\"", "ReviewID": "R3N6OK9C8Q9B6J", "Overall": "4.0", "Content": "Love my tablet. However, it did randomly shut off and never turn back on without warning after about 4 months and I had to send it in to be repaired. The warranty allowed me to get a new one after I sent the old one in, I just had to pay to ship it out.", "Title": "Great deal!", "Date": "December 5, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RE7L6Q5ORQ6JJ", "Overall": "5.0", "Content": "I bought this tablet apprehensively. I wasn't sure that it was going to be a decent tablet. The ratings were good and the reviews were pretty nice but I wasn't sure.But I'm so happy that I did buy this tablet, it not only is better then I thought but it actually has a battery that can last throughout my entire workday.Buy this product! You won't regret it!", "Title": "Amazing!?!", "Date": "December 5, 2013"}, {"Author": "jose antonio maria", "ReviewID": "R2IRVXVSF0C9VE", "Overall": "4.0", "Content": "Great tablet! The price is perfect. The android system work very faster in her. The only don't like so much is the power botton", "Title": "great tablet", "Date": "December 3, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2R7MLIJO0XJ0G", "Overall": "5.0", "Content": "excellent product and recived in excellent time if i ever need to replace will go to them first it is smoth and works like a charm.", "Title": "realy a good product", "Date": "December 3, 2013"}, {"Author": "Nic", "ReviewID": "R1ICJ0P38K06BR", "Overall": "4.0", "Content": "tablet worked great for 4 months and then speaker stop working other than that i loved it have no idea why the speaker stopped working", "Title": "think before buying", "Date": "December 3, 2013"}, {"Author": "sexy man", "ReviewID": "RM9P2L9Z0LG1B", "Overall": "5.0", "Content": "This item came quickly and in great shape. We are using it to keep track of inventory in our warehouse at work and it is flawless in syncing with the computer that we use to store the items. It is just the right size for quick and easy access.", "Title": "Great little device", "Date": "December 3, 2013"}, {"Author": "Ann T.", "ReviewID": "RAWRGXAXA6A1F", "Overall": "5.0", "Content": "I haven't had any trouble with it - just started using it right away - and it's pretty intuitive if a great grandma can figure it out!", "Title": "Fun, Easy and Useful!", "Date": "December 2, 2013"}, {"Author": "Jersey Nole", "ReviewID": "RNSMUPI2ZZ0HP", "Overall": "3.0", "Content": "Decent tablet for the price. Does everything I need it to, it can be a little sluggish though.  I would recommend this for someone who does not ask much of the tablet. It is perfect for my 8yr old daughter.", "Title": "ASUS Tab decent value", "Date": "December 2, 2013"}, {"Author": "Dr. C. Bradenton \"dr. c\"", "ReviewID": "R3CUCIEOW39MRL", "Overall": "4.0", "Content": "I have no problem with the tablet per se, except as noted at the end of this review. My problems stem from the very poor documentation. I did finally succeed in getting the 100 page plus PDF file download after a lengthy search and , finally, assistance from a real person.  I think that whoever put that manual together assumed the user has considerable experience in using Android machines (phones, etc.).  Also, instructions in the use of the most common \"apps\" would be helpful. For example, I have not yet learned how to delete a Kindle book if I start it and want to get rid of it. Also, I have free Hulu on my computer but from the AUSUS all I am able to access is Hulu Plus. Finally, the built in speaker is a bit weak and the jack for ear buds does not work. A problem not worth the hassle of a return!", "Title": "ASUS MeMo Pad ME172v-A1-WH 7-inch 16GB Tablet", "Date": "November 29, 2013"}, {"Author": "Patricia C.", "ReviewID": "R2IH0S6CK32O0B", "Overall": "5.0", "Content": "My 7 in memo tablet is awesome. Its all little small for the eyesBut it is quicker speeds and downloads are great.", "Title": "memo 7 Asus tablet", "Date": "November 29, 2013"}, {"Author": "Stephen Lanovara", "ReviewID": "R3K4R7UC7KQWGC", "Overall": "4.0", "Content": "It is really a nice tablet for what I use it for. I really enjoy it a lot.  Thank You", "Title": "Received 7\" tablet", "Date": "November 27, 2013"}, {"Author": "Amazon Customer \"yummymummy\"", "ReviewID": "R1ZKYX01Y59IKD", "Overall": "4.0", "Content": "Had a bit of an issue with accessing wireless and contacted the manufacturer.  They walked me through a factory reset and a few more steps that seemed to resolve the issue.  Otherwise, this has been a solid buy for the value and made a 10 yr. old birthday girl very happy.  Great deal on Amazon.com!", "Title": "Best price available!", "Date": "November 16, 2013"}, {"Author": "Allan", "ReviewID": "R2W5ZYJOV8NDNE", "Overall": "4.0", "Content": "Bought this for my father. A good, solid basic, somewhat slow tablet. Screen is better than decent, uses Jelly Bean and can do most of the stuff that tablets do. If you want a no frills, very reasonable priced tablet, go for it.", "Title": "Well priced, able tablet", "Date": "November 16, 2013"}, {"Author": "Dimitri", "ReviewID": "R2LWQUAEFVHDR6", "Overall": "2.0", "Content": "A little bit slow, and does not have great resolution. Died after about 3 month of use. Battery stopped holding charge after less than a month, and one day tablet started making weird noises while being turned off. Speakers made sound that resembled static (pretty loud too), while tablet was turned off. While it was making that loud sound, it was impossible to turn on the tablet, or do anything else to stop it.", "Title": "Battery died quickly, and the rest soon after.", "Date": "November 15, 2013"}, {"Author": "armando lopez valencia", "ReviewID": "R3V6CQ04HEUR0Z", "Overall": "5.0", "Content": "Brought for my daughter is the perfect children tablet (with the proper case) if you consider cost/benefit, netflix plays without problems.", "Title": "Great tablet for kids", "Date": "November 15, 2013"}, {"Author": "Rhade70", "ReviewID": "R3NIWKR7AYXR72", "Overall": "2.0", "Content": "The Android OS, the size and speed of the tablet were all amazing. However, I discovered that many other people have had problems with the tablet shutting off and indicating that the battery was low even after hours charging.", "Title": "Disappointed with this ASUS product", "Date": "November 13, 2013"}, {"Author": "Karen Lakey", "ReviewID": "RHFFCK6KH2KPE", "Overall": "5.0", "Content": "This is light weight yet sturdy. It does not have bluetooth but the micro usb folio keyboard I purchased is a perfect accessory for this device. I have played 2 full length movies on this and still had charge left on it. The wifi connects easily to various vendors. I took it with me on the plane for a day trip with a 3 hour leg each way played some simple games one direction and a full movie on the return leg and had plenty of charge left.  Even with the folio keyboard it is easy to carry in my larger purse. Apps load very quickly. My initial test of the quality of sound for music was not too impressive, but I did not fiddle with any controls to try to adjust it either. I'm not a gamer so I cannot evaluate that aspect, but for my intended use this device is about half what I expected to pay. I am very pleased with this purchase.", "Title": "Good Quality, Portable, Good Battery life.", "Date": "November 13, 2013"}, {"Author": "nati", "ReviewID": "R2OJMKA4VTGM1J", "Overall": "4.0", "Content": "i was disappointed from the the camera. i was accepting to find the camera in the back not in the front", "Title": "camera", "Date": "November 13, 2013"}, {"Author": "Trismegistus \"Trismegistus\"", "ReviewID": "R1HHV5JUZ73Q2Z", "Overall": "5.0", "Content": "Nice tablet on par with Galaxy Tab, like it so much I am buying another, going to try the HD MEMO PAD this time, very similarly priced right now (check it out).My daughter's tablet, she uses it a lot and it seems to hold up nicely. Holds a charge with moderate use about 8 hours, screen is almost as responsive as the IPADS and Tab2, resolution is the same as the Tab 2, and it comes with 18 GB storage rather than 8 as does the Samsung. Not quite as fast or responsive as the Galaxy Tabs, but more solid connector cables and less bloatware. It's not an IPAD, or even a TAB2, but for the price it is a GREAT tablet. Thanks again, Amazon.", "Title": "Nice budget tablet I got here for 89.00", "Date": "November 12, 2013"}, {"Author": "dharris9311", "ReviewID": "RPNEINFQARIA", "Overall": "5.0", "Content": "Great for social networking, email. Can't beat the price (89.00 - when I purchased)I bought these for my GK's (Early,pre-teens) and they absolutely love them!", "Title": "All you need at a great price", "Date": "November 9, 2013"}, {"Author": "Debra Duhon", "ReviewID": "R2456H2KHO3UAV", "Overall": "5.0", "Content": "The plug in charger does not work, lucky I had another plug-in charger from another device that works.Thank you", "Title": "Plug-in", "Date": "November 8, 2013"}, {"Author": "Jailton Leite Silva", "ReviewID": "R2YP8ZSGKUCV23", "Overall": "5.0", "Content": "I love Asus products. They have incredible quality for a honest price. Image is sharp, sound is good, processor and ram is enough for most games and applications. I recomend.", "Title": "The best tablet low price", "Date": "November 8, 2013"}, {"Author": "James Galka", "ReviewID": "R27P09OQ1NIQPC", "Overall": "5.0", "Content": "Got two of these (for my 4 and 6 year old girls).  Originally got the Coby equivalent which I returned for these. This is twice the product for a marginal price increase. Screen is much better, and more responsive. Processing speed is better, and this brand has access to the google play store that the Coby does not. Great buy for the price!", "Title": "Great value for the price!", "Date": "November 7, 2013"}, {"Author": "faisal", "ReviewID": "R32LHQK72Y0SEU", "Overall": "5.0", "Content": "Excellent, low price, and specifications are acceptable, 16 GB internal memory , 1 GB RAM , Good for small games", "Title": "Excellent", "Date": "November 6, 2013"}, {"Author": "Amanda", "ReviewID": "R2RN18SBPN62N9", "Overall": "5.0", "Content": "My ten year old daughter saved her money up to get a tablet and this was perfect for her. It is easy to use, lets her play games, listen to music, take pictures - everything she wanted to do. It is a simple, basic tablet but perfect for a tween.", "Title": "Great for Tweens", "Date": "November 3, 2013"}, {"Author": "David G", "ReviewID": "R1O62EZF0KXL9L", "Overall": "5.0", "Content": "I've owned the 250 dollar asus Nexus 7 with 32 gigs.  But this one is almost as good with 15 gigs and 150 shaved off the price.  I was disappointed that Viber and Tango weren't compatible.  But the rest of my favorite applications are there.  I use Google voice, Skype, and Talkatone instead which work the same.  The only complaint I had was the microphone is very faint.  I looked at the docs and located the pin sized mike at the top and tested the input by speaking directly into it and my wife says that the volume is much better and she can hear me ok now.  It's fast enough, even if my phone appears to be quicker.  Unbeatable deal for a 7 inch tablet.", "Title": "Awesome deal", "Date": "October 31, 2013"}, {"Author": "pdiaz", "ReviewID": "RIBD4Q77LQ3BZ", "Overall": "4.0", "Content": "For the price is good.. Bought it for my 6 yrs old son .. He like playing with it.. Wish it was a little bigger", "Title": "Good for the price", "Date": "October 31, 2013"}, {"Author": "nerak18", "ReviewID": "RTJYM85HL520L", "Overall": "4.0", "Content": "Is good for the price, is so fast, and pretty. The only thing is that doesnt have bluetooth, but is nice", "Title": "Is really a Good Tablet", "Date": "October 30, 2013"}, {"Author": "Raul Wuity", "ReviewID": "R3EBNRLOYB5NDP", "Overall": "2.0", "Content": "I would not buy this again just got it and its already freezing and crashing its not worth 100 dollars more lik 50", "Title": "cheap model", "Date": "October 30, 2013"}, {"Author": "JN", "ReviewID": "R1QD73SO7JE9Y3", "Overall": "3.0", "Content": "This was a great price for a 7\" tablet with these specs, however, I noticed the battery dies entirely too fast and the screen resolution can be slow on large apps.", "Title": "Good! (But not perfect.)", "Date": "October 30, 2013"}, {"Author": "samer alshawwa", "ReviewID": "R33CODLN5ZN8IQ", "Overall": "5.0", "Content": "It perfect for what she needs in the house and even on the road. Even my older son in high school uses it to watch homework related videos.", "Title": "My 4 year old daughter absolutely loves it", "Date": "October 28, 2013"}, {"Author": "Jacqueline Dillon", "ReviewID": "R3GUCF1GIOHBZX", "Overall": "3.0", "Content": "Tablet works well but if you want to take a picture of something in front of you, you have to turn around and take it over your shoulder.", "Title": "Great tablet but front only camera can make things tricky.", "Date": "October 25, 2013"}, {"Author": "Anne from Atlanta", "ReviewID": "R18C1ILGUCJGRQ", "Overall": "5.0", "Content": "I've never had to make a claim, but Square Trade is the only way to go when purchasing a warranty for electronics.I've never heard anything but good results for a fair price.", "Title": "Great Value", "Date": "October 25, 2013"}, {"Author": "A \"Reader\"", "ReviewID": "RT4PX3P8AUINL", "Overall": "2.0", "Content": "This is slow, drags between activities, and failed with the MAIN reason I bought it.  Basically, I bought it to back up pics on vacation.  I have a camera  card reader that has a micro USB attachment (the only input that this device has).  So, I plugged in my micro USB card reader multiple times at home to test it.  All was well.  Then, I bring it to vacation and suddenly it's telling me my pics are corrupted and totally freaks me out.  None of my pics were corrupted - and the guy at the hotel front desk confirmed that (as did I when I got home).  Also, this is very heavy for the size...I'm used to an iPhone weight / density - and this is much more dense.  Oh - speaking of iPhone - here is a good use for this tablet if you travel:  There is a \"workaround\" that will let you use the \"find my iphone\" website which you can read about online. The other thing is that it lets you encrypt the whole device pretty easily, which is good again if you are traveling.", "Title": "Mostly useless and slow", "Date": "October 24, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R6CESBSM5C2J9", "Overall": "3.0", "Content": "I like the pad but it stopped working and could not return to Amazon because it was outside of the time frame for returns. Had to return to ASUS which cost me a shipping charge. After carefull consideration, it really wasn't necessary to buy a tablet because I can get all my downloaded material on my phone for reading. I've come to appreiate my phone more and buying the tablet and all the problems I've had isn't worth the money I've spent. I'd considered getting a Kindle Fire HD but I've changed my mind.", "Title": "It stopped working", "Date": "October 24, 2013"}, {"Author": "Noah L Waller", "ReviewID": "R130WV54BVBZGY", "Overall": "4.0", "Content": "You can tell it's just not quite a top of the line Android tablet, but it's still pretty darn good. No real complaints.", "Title": "Great tablet for the price", "Date": "October 18, 2013"}, {"Author": "Valued Customer", "ReviewID": "R3F3PM5MXGNBA1", "Overall": "5.0", "Content": "This tablet was a great buy for anyone who is looking to purchase one. The price was great and everything that I expected it to be. FedEx also delivered it on time so I will be ordering from this seller again soon!!", "Title": "Great tablet", "Date": "October 17, 2013"}, {"Author": "Mesa T", "ReviewID": "R2AMHHRX2AD83Q", "Overall": "4.0", "Content": "great tablet. It is small but you can use it in many way, it is fast and the resolution is very clear. My son love to do home work in it", "Title": "Asus Tablet", "Date": "October 14, 2013"}, {"Author": "Lizzie", "ReviewID": "R24VJ9TQS3UBMH", "Overall": "4.0", "Content": "We loved the item...unfortunately I ordered the wrong tablet for my son ... Will definitely reorder the correct one as it came in very quickly and was exactly as described in ad.when we returned the item it was also processed very quickly and the refund was back in our account within a very few days.", "Title": "tablet review", "Date": "October 14, 2013"}, {"Author": "good", "ReviewID": "R11E77BM1A1UW3", "Overall": "4.0", "Content": "Is a good tablet and very powerfull by the price. The power botthon is a little hard but not important.", "Title": "very good", "Date": "October 12, 2013"}, {"Author": "lisa", "ReviewID": "R3J1D4KBNRMBDL", "Overall": "4.0", "Content": "I bought two for my kids and they love them. Although, I had to return one of them, because it wouldn't turn on properly. Now with the new one we received it works perfect..over all a good buy for the price...", "Title": "Good buy..", "Date": "October 11, 2013"}, {"Author": "Miguel Serrano", "ReviewID": "R11PDWD7HJB9CK", "Overall": "5.0", "Content": "This tablet is a gift to my daughter, but I am using it for a while. It does more than I expected, I would recommend this product for parents with 12 - 13 year old children to use it.", "Title": "More than I expected", "Date": "October 4, 2013"}, {"Author": "Lisa F", "ReviewID": "R2XNMTOQD4L7MH", "Overall": "5.0", "Content": "I've never owned a tablet before; don't even have a smart phone.  Asus is a brand that was recommended by someone that has several Asus products.  The price was perfect and I have not had a single problem in the 2 months I've had it.", "Title": "Great tablet for the price", "Date": "October 4, 2013"}, {"Author": "Safi", "ReviewID": "R1MO7P75A676H2", "Overall": "4.0", "Content": "I really like it so far.I especially use it to read my articles whenever I want and need which is very convenient when you spend time commuting.", "Title": "I like it", "Date": "October 3, 2013"}, {"Author": "alan w", "ReviewID": "R1WCB5LUC6ZPR5", "Overall": "3.0", "Content": "I find the start/stop method poor. The hidden button is small, badly placed and sometimes difficult to push.I cannot attach a keyboard or a mouse as there is no true USB port.It occasionally jumps back to prior programs without noticeI have had other laptops like this and they were better.I have used this Asus for several months hoping to get accustomed to it's quirks... and still am not happy.", "Title": "not what I expected.", "Date": "October 2, 2013"}, {"Author": "binky495", "ReviewID": "R3P0DRXUBYP13R", "Overall": "5.0", "Content": "Easy to use and great speed,the high def svreen is really beautiful,Love all tje aps to pickfromwould buy again too", "Title": "grea tansaction", "Date": "October 2, 2013"}, {"Author": "RickM", "ReviewID": "R3B4FIUBW05ZYH", "Overall": "5.0", "Content": "I bought this for my 6 year old grand-daughter and she was quite happy with it,I had my son check out the system and he said it was very good for the price I paid for it went to say it was better than the kindle,this is an excellent product you can't go wrong with it,has more features than the i-pad", "Title": "excellent product", "Date": "October 2, 2013"}, {"Author": "Tasha Daley", "ReviewID": "R24NO2G5T6GVO1", "Overall": "3.0", "Content": "good battery life. the tablet works well but the microphone is not good. i returned it and got a galaxy 3 8.0 instead. hope this works better.", "Title": "good battery life", "Date": "October 1, 2013"}, {"Author": "Michael C.", "ReviewID": "R58OFBG4FTQLD", "Overall": "4.0", "Content": "A great tablet for the price. We bought this for my 6 year old son who wouldn't leave our Android phones alone. It runs every app/game we try, but sometimes it gets bogged down and the textures stop rendering on the games. This is always because my sone doesn't close anything after he is done with it. use a \"task killer\" app and you will love it. Video quality is good for a $120 tab.", "Title": "Okay Tab", "Date": "September 28, 2013"}, {"Author": "Kathryn Huss", "ReviewID": "R2BC88Y9K21BV2", "Overall": "5.0", "Content": "This is my first ePad. Each day I am discovering new things that it will do. I love the Kindle Reader, YouTube, email, and To Do Pad features, as well as the ease of downloading Apps and music. Overall, it's an excellent investment.The only problem I have had is that I have a slight tremor, which makes it difficult to use the virtual keyboard. That's definitely NOT a problem of the MeMO Pad -- and it's getting easier as I figure out exactly how I need to place my finger. I have been thinking that a stylus might help.", "Title": "It does everything I expected -- and more. It's a great value for the price.", "Date": "September 27, 2013"}, {"Author": "hbehling", "ReviewID": "R231V6O2RF142M", "Overall": "4.0", "Content": "I like this tablet.  I've only had issues with the place to insert the power cord.  I think my kids have watched Netflix on it with the tablet plugged in too much since it doesn't always charge now.  I have to have the cord in just the right position for it to charge.  Other than that, it works great!", "Title": "Decent Tablet", "Date": "September 27, 2013"}, {"Author": "SAINTSIN", "ReviewID": "R1T9N3Q6EPESOM", "Overall": "4.0", "Content": "GOOD TABLET FAST SMOOTH AND GOOD PRICE. GOOD SCREEN QUALITY. BUT IF YOU WANT TO BUY A HIGHEREND PRODUCT CHECK OUT THE NEXUS 7 1ST OR SECOND GEN...BOTH GREAT!!!", "Title": "GOOD TABLET", "Date": "September 26, 2013"}, {"Author": "Teng", "ReviewID": "RDDQTWMPWK1OG", "Overall": "5.0", "Content": "I know there are some newer and with better specs tablets but for my personal use which is internet browsing and games for my kid this tablet is way more than enough. Product materials are robust as one can expect from Asus, response is quick and the screen although it isn't the best on the market, it has very clear graphics. Recommended!", "Title": "Great tablet for the price", "Date": "September 26, 2013"}, {"Author": "JULIO ACUÑA", "ReviewID": "R3H1V58STBA588", "Overall": "5.0", "Content": "Well it work great to check my fb, chat for line, watch video on youtube, all i need for play some games and work well the cam it poor but its ok.", "Title": "Una gran tablet para el rango 100$", "Date": "September 24, 2013"}, {"Author": "H Paul Meseroll", "ReviewID": "R1MKPVD8A8LVZ3", "Overall": "4.0", "Content": "Bought this for my wife as a thank you for all her hard work. She loves it. One of the best presents I ever bought!!!", "Title": "Love it", "Date": "September 24, 2013"}, {"Author": "Roberto Reboucas", "ReviewID": "R3EEZYG3MI9S6E", "Overall": "5.0", "Content": "Extremely good tablet for the money, no problems whatsoever. It is fast, crisp screen, great sound, compatible with everything I installed. Highly recommended.", "Title": "Excelent tablet", "Date": "September 23, 2013"}, {"Author": "JULIO C DIAZ", "ReviewID": "R7H50O9GDCHQN", "Overall": "5.0", "Content": "I RECOMMEND, MY SON LOVES IT, HE USED TO PLAY AND READ, WATCH VIDEOS, HE IS VERY HAPPY TO HAVE IT. THANKS A LOT", "Title": "FAST AND NICE", "Date": "September 23, 2013"}, {"Author": "Mike", "ReviewID": "R3UQRV9NH1T5K", "Overall": "4.0", "Content": "****Please be aware, that the picture showing the tablet leaning and having a REAR facing camera is of the Asus Transformer. I was thinking that this MeMO pad was just a smaller version of my TF300T, but it was not.***It was very nimble, screen responds fine, and for $99, it's hard to beat. However, without the rear facing camera, that was the deal killer for me. If you don't need a rear facing camera, then by all means purchase the camera.", "Title": "Had to return due to misrepresentation", "Date": "September 23, 2013"}, {"Author": "vako86", "ReviewID": "RRQ3DF89677PV", "Overall": "4.0", "Content": "For the price the device is OK and is worth the money but I would pay more and go for a better pad instead of this one. the viewing angles are terrible, the device is not fast enough to feel comfortable, no rear camera. good storage, normal battery life, feels not bad while handling. Overall the device is nice for the price but not for users that demand high quality product.  I would give it 5 stars if it head good viewing angles.", "Title": "normal device but better pay more for a better device", "Date": "September 22, 2013"}, {"Author": "BRAVE", "ReviewID": "R3VXD3ED3EZRZH", "Overall": "5.0", "Content": "Really good tablet for the price.Processing is quick enough for every day to day use play video and play regular games.Only sinon, tablet does not have a GPS.Highly Recommendable.", "Title": "REALLY GOOD TABLET FOR THE PRICE", "Date": "September 22, 2013"}, {"Author": "A Mom", "ReviewID": "RZ35MZ81ACA5C", "Overall": "5.0", "Content": "Pretty little tablet, works great, very sturdy. My daughter is able to take it to school and use it, print out and basically have a small laptop with her. Great little item.", "Title": "Love this", "Date": "September 22, 2013"}, {"Author": "yensil lara", "ReviewID": "R2F18Z1GELJOGS", "Overall": "5.0", "Content": "The product is of good quality. Very practical and the operating sistems runs very well. The tablet has many app. 100% recommend!!!", "Title": "good product", "Date": "September 21, 2013"}, {"Author": "Cat", "ReviewID": "R1W2M9VPQL60U6", "Overall": "5.0", "Content": "Very, very pleased with the Asus Memo tablet. Easy to set up and use. I would recommend it to others.", "Title": "Asus Memo Tablet", "Date": "September 20, 2013"}, {"Author": "Cheryl Simms", "ReviewID": "R1Y988KTJTNLGZ", "Overall": "5.0", "Content": "I have looked around for the perfect tablet for myself.  I like to read and venture out in other areas.  This table does it all. Thanks awesome", "Title": "awesome", "Date": "September 20, 2013"}, {"Author": "vra7455", "ReviewID": "RI8HU152U4LQP", "Overall": "4.0", "Content": "It works fine . Do its job . My child use it to play and do classes homeworks. I recomendit", "Title": "Fine work", "Date": "September 20, 2013"}, {"Author": "Lori A Jackson", "ReviewID": "R1S0K79XNK73HF", "Overall": "4.0", "Content": "I was looking for an inexpensive tablet just for the basic needs of organizing my life a little and holding a few apps that I like. I wasn't looking forward to spending a big price tag as I really depend on my laptop for all my college courses and everyday use. I am extremely impressed with this little tablet. For $99 it delivers more than your money's worth. I know what it can and can't do and it has more than I need. If you are looking for dual cameras that is the only thing that this does not have that the more expensive ones do. However, with the access to dual cameras on just about every device out there, I am fully satisfied with this having one camera. If you need two ASUS has a wide range of tablets/laptops and are competitively priced. Quality has been top notch on the ASUS laptop that I have had for over a year now and I believe this device will give the same quality. I am looking forward to purchasing these for some teens in my life for Christmas because at this price you can't go wrong and it is much cheaper than a \"smart phone\".  The only reason I give this 4/5 is the lack of the second camera.", "Title": "ASUS Memo Pad", "Date": "September 19, 2013"}, {"Author": "Jamo Forst", "ReviewID": "R2C9EZBBP00OLC", "Overall": "2.0", "Content": "This tablet came highly rated by fiends and family. I was very disappointed in it when it arrived. I had issues powering it on after a full charge. Once it was powered on, it seemed to lack the power and speed I had expected.  It also randomly will not go to home screen after I unlock it.", "Title": "Not that great", "Date": "September 19, 2013"}, {"Author": "Fahad", "ReviewID": "R8XJ6IFAOWTE8", "Overall": "2.0", "Content": "I bought this assuming it would be the same as the google tab as the specs and manufacturer are the same, but seems like not. My wife is complaining about the fluidity on the screen and the key pad is not user friendly at all. won't recommend", "Title": "Worst that google tab", "Date": "September 19, 2013"}, {"Author": "Aaron Alves", "ReviewID": "R2ARPAGRPSXQHP", "Overall": "4.0", "Content": "Works perfect for the usage that I need and seems to hold charge for a while as well great buy", "Title": "Great product", "Date": "September 18, 2013"}, {"Author": "Rikki Boodram", "ReviewID": "R1EUMKRNDHJ3P9", "Overall": "5.0", "Content": "This is my 2nd product from Asus. I have never dealt with asus before and I am loving this new tablet I got! I opened it and read the manual to start. You have to charge this for 8 hours before you turn it on (even though when I plugged mines in it turned on for the setup.) I don't use Google much but hey its a good web browser. I also ordered a screen protector and a case for this. Now I'm fiddling with it and experimenting with it. Overall I Like the speed, style and simply the looks of it. After all, this is my first tablet and it was good for the price. Now when the order came, the back was not grey but it was a dark navy blue. Which I'm perfectly fine with. But I'd wish the color I chose for the order would have came to me the same color. Shipping was on time. I'm looking forward to doing business with Asus soon.", "Title": "Asus", "Date": "September 18, 2013"}, {"Author": "Troy Stafford", "ReviewID": "R2M16LP87MRXBD", "Overall": "4.0", "Content": "Performance is good. Nor t lightning quick or buttery smooth but very capable. The build is solid and the micro SD slot comes in handy. Viewing angles are so so but for straight on media consumption you could do alot worse. Speakers are surprisingly loud for a tablet albeit a bit tinny which is to be expected. Battery life is ok with moderate mixed use. I bought the device for my daughter and she enjoys it.", "Title": "Decent for the price", "Date": "September 18, 2013"}, {"Author": "NKLT", "ReviewID": "R21H8NOOZ6GEO", "Overall": "5.0", "Content": "From the same makers of the famous NEXUS 7 google tablet, asus gives us a tablet that has the perfect balance between quality, price-performance, this tablet has a spotless building materials and quality that only this great Taiwanese manufacturer can give us ,", "Title": "good tablet", "Date": "September 17, 2013"}, {"Author": "David R. Russell", "ReviewID": "RSGZG5X6Q9ALM", "Overall": "4.0", "Content": "It is a christmas present so it is still wrapped in the plastic.  But it seems like a very light & nice tablet for the money.  It has good features and expandable memory.", "Title": "Good value for the money.", "Date": "September 15, 2013"}, {"Author": "Vikas", "ReviewID": "R3P9HOP7CGLCB7", "Overall": "3.0", "Content": "For $100 it is not bad product but there are other products with less known brand which are better.Display is good but every other thing in this tablet is slow.", "Title": "There are better tablet at this price", "Date": "September 14, 2013"}, {"Author": "Jennelle Blackman", "ReviewID": "R26GHR0FHSW70Q", "Overall": "5.0", "Content": "Great product at a great price. Good enough for your basic needs on the Internet. I would certainly recommend it to anyone", "Title": "Great tablet", "Date": "September 14, 2013"}, {"Author": "Vlad Cekus", "ReviewID": "R1FW0229OHD0PA", "Overall": "3.0", "Content": "Works fine, a bit slow thou. This is only in comparison to faster Nexus 7HD that we purchased at the same time.", "Title": "You get how much you paid for.", "Date": "September 13, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3RTWA44QKUKHF", "Overall": "5.0", "Content": "Just what I wanted!! It responds quickly to every request. I'm totally pleased with my Asus Memo pad! Shipping was amazing- next day!! I'm happy!", "Title": "The best 7\" pad !!!", "Date": "September 10, 2013"}, {"Author": "Rafael Miranda", "ReviewID": "REZ2B5H1967WR", "Overall": "5.0", "Content": "Amazing Tablet. The relation price/convenience is total. Of course, it doesn't have all features as a big tablet but, I guess is the best deal for the price.", "Title": "Amazing price/convenience", "Date": "September 9, 2013"}, {"Author": "SaabGuy85", "ReviewID": "R1XG88XOY1QY35", "Overall": "3.0", "Content": "This tablet is a little sluggish in performance but otherwise it's a decent/cheap tablet. I would say if you're only willing to spend a hundred dollars, then buy this, otherwise spend a little more and get a Nexus 7.", "Title": "A little disappointed :/", "Date": "September 8, 2013"}, {"Author": "shawn murphy", "ReviewID": "RC3EMF1Y229CM", "Overall": "3.0", "Content": "decent processor can be slow at timescamera isn't the best but not terriblescreen is responsive most of the timeits your basic tablet spend the extra $20 for the quad core", "Title": "its Ight", "Date": "September 6, 2013"}, {"Author": "Jeff Krueger", "ReviewID": "R37T3MSBVB5RA6", "Overall": "5.0", "Content": "this is my first experience with a tablet,I don't have a cell phone so there is a learning curve but I am slowly figuring it out", "Title": "first experience with tablet", "Date": "August 30, 2013"}, {"Author": "jracademia", "ReviewID": "R3UX9XU7P6D61H", "Overall": "5.0", "Content": "I gave this a 5/5, but I would prefer it to be a 9/10. It is a cheap tablet that lets me surf, game, and read for much longer than I need it to. It feels great in the hand, and is compatible with most apps that I want. Power is a slight problem, and there is occasionally noticeable lag, but its slim design (fits into my cargo shorts pocket) and easy-to-grip back makes this a great buy for somebody on the market for a cheap tablet from a name-brand!", "Title": "Cheap, well-made, gets the job done!", "Date": "August 28, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1NQOPTYYII7DK", "Overall": "5.0", "Content": "Great product easy setup and use. Battery life is good screen size could be a littlr larger but overall excellent for the price", "Title": "grest", "Date": "August 27, 2013"}, {"Author": "Montgomery Gill", "ReviewID": "R3V23M056X5ZQA", "Overall": "5.0", "Content": "It has exceeded my needs in every way and is a price range that if it is lost, stolen or destroyed I can easily replace it - no worries man. I use it to work on projects I am involved with, that sometimes take me outdoors.", "Title": "Excellent value for money", "Date": "August 27, 2013"}, {"Author": "Maddy", "ReviewID": "RW3MFU50GE8WU", "Overall": "5.0", "Content": "For what I use it for, it does a great job. I use it for my Evernotes, calendar, email access, and my to do lists. I am not using it for the Internet, but the few times I have gone on it gives me a great response time. This was the perfect solution to getting organized.", "Title": "Yeah!! Wonderful Tablet", "Date": "August 27, 2013"}, {"Author": "Rahul Choudhary", "ReviewID": "RX7NI3TB1J8VV", "Overall": "4.0", "Content": "This is nice, handy, very useful with 16GB internal memory. Processor and ram are powerful enough to support multitasking and all multimedia including gaming. I bought it for main purpose to do video chat with friends on skype and it is fulfilling it well. Only shortcoming is if wifi is on then battery drains in 3-4 hours of continuous use. Overall Good value for money. Recommended..", "Title": "It is exactly what I expected from a $100 android tablet.", "Date": "August 27, 2013"}, {"Author": "DIEGO RV \"professional university\"", "ReviewID": "R3IBGVZK78JONG", "Overall": "5.0", "Content": "I recommend this product, excellent quality and price.I was fortunate to buy it on sale and thought it was an extremely economical table but I was wrong fit any particular user and the seller very responsible. thanks Gracias desde Venezuela", "Title": "Excellent!", "Date": "August 26, 2013"}, {"Author": "jon", "ReviewID": "R2NNW6ZOSUNY6S", "Overall": "5.0", "Content": "I was very surprised that I could do so much with this Tablet.Since It's pretty inexpensive I didn't expect it to do intensive tasks like streaming, but it does wonderfully. screen is acceptable-- and it's fast for most tasks.-Asus Is great.", "Title": "great tablet", "Date": "August 26, 2013"}, {"Author": "Cheryl Peterson", "ReviewID": "R3CM09CXAL0YFH", "Overall": "5.0", "Content": "I was not sure what to expect.  Yet, this tablet is great. I wanted one to learn more about it so I could teach my students in my computer lab.  I already have an iPad, but needed something smaller to fit better in my purse.  I am definitely NOT disappointed.  Thank you!", "Title": "Awesome!", "Date": "August 26, 2013"}, {"Author": "Jen", "ReviewID": "R32WEQ8AW3C8DV", "Overall": "5.0", "Content": "Make sure and get screen protector with it...My son loves it.. great for games....light, easy to slip in your purseGoogle store - wonderful...Love the google apps on itVolume is kinda low though", "Title": "Great buy", "Date": "August 26, 2013"}, {"Author": "Linus Mizutani", "ReviewID": "R23IUTZY5UD1AJ", "Overall": "5.0", "Content": "I love it,  my grand kids are using it now. the product and the program that are installed in asus memo pad172v-a1-gr 7.- inch are pretty good. hope you install the dictionary in every procducts.thanks", "Title": "ASUS MeMO Pad ME172V-A1-GR7.0 iNCH 16 GB Tablet.", "Date": "August 25, 2013"}, {"Author": "Jayesh", "ReviewID": "RHGS2UJUYLVBO", "Overall": "4.0", "Content": "I bought this for my daughter and she loves it. The only draw back I saw is the speed. Comparing to Google nexus it is bit slow. any way worth for the price...", "Title": "I like It", "Date": "August 25, 2013"}, {"Author": "Carl F. Cartini", "ReviewID": "R283J3L4VCSXKQ", "Overall": "5.0", "Content": "exceeded expectations and 14 year old special need child is very happy, and so is her dad--i consider it a \"best kept secret\"", "Title": "like it", "Date": "August 24, 2013"}, {"Author": "Iza Camacho Fidalgo", "ReviewID": "R87GM4J1YDUN2", "Overall": "5.0", "Content": "Excellent, fun and incredible game.Right on time and high quality service.I don't have more words to describe my satisfaction", "Title": "Great Tablet", "Date": "August 21, 2013"}, {"Author": "leonardo arias", "ReviewID": "R35LZPFRD0C76Q", "Overall": "5.0", "Content": "exelent buy!!! even bought some for my nephew so he can stop messing with my phone and my brothe'great resent for the kids", "Title": "love it!!!!!", "Date": "August 16, 2013"}, {"Author": "Dean jonas", "ReviewID": "R3I8PLJK6J0RMW", "Overall": "5.0", "Content": "The item arrived on time after I purchased it. I simply turned it on and entered my google account information . It has worked as stated without a flaw. It is quick and responsive. I love it!!!", "Title": "Great product for such a low price", "Date": "August 16, 2013"}, {"Author": "Ashley", "ReviewID": "R3HX2FY45G5IZ7", "Overall": "5.0", "Content": "Try this item its nice and cute:) but a little bit heavy. Much better if the tablet has a camera at the back", "Title": "Nice", "Date": "August 15, 2013"}, {"Author": "Richard Z.", "ReviewID": "R7LQRBWJ7GHE1", "Overall": "5.0", "Content": "This is not a high end tablet, but it has a lot of bang for the buck. I got it for a great price, it certainly does everything I had hoped for and more. I have a PC, I have a laptop, I just wanted a tablet that I could check my email with, pop onto facebook from time to time, establish a calender etc. I does all that I need, is very user friendly and you can't beat the price.Very satisfied!", "Title": "Lots of bang for the buck!", "Date": "August 15, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3IMILOJ23FNE7", "Overall": "5.0", "Content": "I ordered this tablet mainly for reading, email, social media, etc. and it fits those needs perfectly.  Set up was quick and easy. Have watched a few youtube videos and was pleasantly surprised with the picture quality.", "Title": "Fits my needs perfectly", "Date": "August 15, 2013"}, {"Author": "Jeremy McNeal", "ReviewID": "R1FLSNJTKLM1EW", "Overall": "5.0", "Content": "Purchased this for my mother for her birthday. The size is perfect and there haven't been any issues with it; I was concerned that it would be really slow because of the price; and that the touch input wouldn't be sensitive enough; but everything was great. It's fluid and the interaction feels every bit as good as an iPad. The screen is bright. The product exceeded my humble expectations; I will probably buy another one for myself.", "Title": "Excellent", "Date": "August 13, 2013"}, {"Author": "Rydia", "ReviewID": "RIV16IMI8DTRW", "Overall": "5.0", "Content": "It's great. it's the proper shade of pink. I freakin love it. And it holds ALL MY PORN AND vidya gaems.what more can a girl ask for?", "Title": ":D", "Date": "August 13, 2013"}, {"Author": "ABASI", "ReviewID": "R2JAL36EM6DU0U", "Overall": "5.0", "Content": "HIThe item was very good but I did a mistake.I thought It has rear camera.I may purchase another one from AMAZON but I have to sure of getting the right one.Thank you", "Title": "It was good but", "Date": "August 10, 2013"}, {"Author": "jan senk", "ReviewID": "R2D9TOT1TICAB", "Overall": "5.0", "Content": "I really haven't need a tablet before, and I just wanted to try, how it works. But now I like it, it's good substitute instead of laptop.", "Title": "Why I bought it?", "Date": "August 9, 2013"}, {"Author": "Chuck", "ReviewID": "ROQWAAR7QSTME", "Overall": "5.0", "Content": "Got this little pad on clearance for less than 100 bucks. Good quality, good price. Not the fastest one out there but not the slowest either. Glad I got it.", "Title": "Could not beat the price", "Date": "August 9, 2013"}, {"Author": "zmonster8u", "ReviewID": "RHZC0AQQVSW0P", "Overall": "4.0", "Content": "I like the tablet, but I find a few apps I use on my iphone or ones that I would like to try are not compatible.  As far as tablets, it is a starter.  I was trying to save a few bucks and see it is even $20 cheaper than I paid in a month.  It would be great for a kid, but not an adult.  I use it to play candy crush and watch movies.", "Title": "Spend the extra money and get a galaxy tab 2", "Date": "August 9, 2013"}, {"Author": "Jordan Serson \"Serson Person\"", "ReviewID": "R101FGJ9BSX8KR", "Overall": "5.0", "Content": "I got this for my girlfriend and she's had no complaints. It's like getting a Nexus 7 for half the price. For a first tablet user, it's a great experience. Thanks Asus and Amazon.", "Title": "Very Good", "Date": "August 9, 2013"}, {"Author": "Billy", "ReviewID": "R1ENBWA9LOE72I", "Overall": "5.0", "Content": "I bought the tablet for my wife and she loves it. It was definitely worth the price. Would recommend for purchase.", "Title": "awesome", "Date": "August 9, 2013"}, {"Author": "caliqro", "ReviewID": "R31YT57DQODJ1X", "Overall": "4.0", "Content": "I got this tablet to replace my 6 yr old's Asus Nexus Tablet. We downloaded Netflix and it has worked fine for us. We also downloaded several other games and have had no problem with glitches or non-compatibility. Youtube and web browsing work fine too. My only complain is the camera, it is front facing and it is difficult to take pictures of stuff. Honestly, I was drawn to it for the price and I'm happy with it overall.", "Title": "Good for the kids", "Date": "August 2, 2013"}, {"Author": "Sherwin G Williams", "ReviewID": "R3AYDET6YNYQ0M", "Overall": "4.0", "Content": "The Asus memo pad is really worth the price and for 16gbs you can't go wrong, this tablet is smooth and really quick, the one thing i dislike is that, it has no bluetooth.", "Title": "Every one should choose the ASUS ME172v-A1-PK 7-inch 16GB Tablet", "Date": "August 2, 2013"}, {"Author": "J. Maier", "ReviewID": "R223ASEEXKNXUY", "Overall": "4.0", "Content": "I love this machine.  Two people who have seen it have ordered their own.  One of them sent back a 10inch of another brand to get this one.  My only complaint is a a click when I stream certain radio stations.  I don't think it's a defect since the sound is fine during video games and voice recordings.", "Title": "Great, although there is a click during some audio output.", "Date": "August 1, 2013"}, {"Author": "Aila", "ReviewID": "R3390QNOTI7O2V", "Overall": "5.0", "Content": "I loved it. It has the right size to bring in anywhere, I like to read on it, listen song, see may email, play games... And it is light so I don't get tired holding it. The only problem that I have is that it has small time of battery when you are using all the time, but I can use extra battery and keep using the whole day.", "Title": "Very good Tablet", "Date": "August 1, 2013"}, {"Author": "Lhipol", "ReviewID": "R28J2WUYJWBAN1", "Overall": "5.0", "Content": "100% recommended. It's a excellent product. Nice design, good resolution, very good memory and time of response.  really like it!!!", "Title": "It's better than I thought", "Date": "July 25, 2013"}, {"Author": "David S. Lincoln", "ReviewID": "R2EGXGA7MT89XJ", "Overall": "5.0", "Content": "This is perfect for my daughter.  The size is great and the performance for the games she likes is great.", "Title": "Bought it for daughter", "Date": "July 23, 2013"}, {"Author": "jnovoa", "ReviewID": "R3A7XH6B125ZHD", "Overall": "4.0", "Content": "I cannot go for the 5 stars just because of a couple of reasons: 1- it does not have a back camera 2- just one speaker, not stereo.For the rest the tablet is great.Al last an affordable tablet with good performance and responsiveness!!!I definitely recommend it.I recommended it to a friend, she liked mine, and I got her the 10\"", "Title": "Super, but could be a little better", "Date": "July 22, 2013"}, {"Author": "Scott Degraffenreid", "ReviewID": "R1SQUR1AEUM66Q", "Overall": "5.0", "Content": "I mainly use this as an alternate e-reader to my basic Kindle and for checking e-mail, a little web-surfing. I didn't want to spend too much since I was skeptical as to how much I'd use it vs my smart phone and laptop. Overall it has been a pleasant surprise. The tutorial was sub par but Android is pretty intuitive. Quality and features seem comparable to my boss' I-pad for 1/4 the price. I'm satisfied but will probably upgrade in a year or two as new features come online for less $.", "Title": "First tablet", "Date": "July 22, 2013"}, {"Author": "Brent", "ReviewID": "R63CYKIVTE2X1", "Overall": "5.0", "Content": "Bought this recently and its not a bad tablet at all even thou it lack GPS and bluetoothASUS MeMO Pad ME172V-A1-GR 7.0-Inch 16 GB Tablet ( Grey ).And it's a brand name too.Great  price, great product", "Title": "Great  price, great product", "Date": "July 21, 2013"}, {"Author": "jen", "ReviewID": "R15ILDMBF6V1RW", "Overall": "5.0", "Content": "Its perfect!!!! Works flawlessly!! Love it!!! Well worth the money!! Very pleased!!! Excellent product!! Perfect for my daughter she loves it!", "Title": "Just received today!! Works Excellent!!!!", "Date": "July 19, 2013"}, {"Author": "M. Andrewjeski", "ReviewID": "RVNK3P1TOFPQM", "Overall": "4.0", "Content": "ASUS has pushed the market to lower their prices on good, entry level tablets.Bought for my daughter.  Really suits her needs well.", "Title": "good product for the $$", "Date": "May 14, 2013"}, {"Author": "Satish Kumar", "ReviewID": "R2TOCLPWVNNPH", "Overall": "1.0", "Content": "Ordered the ASUS 7\" tablet for its attractive price. Amazon fulfilled it very quickly. When I received the unit, I turned it on. The unit said it had a system update to download. Downloaded the update and the clicked on the button to start the installation. The tablet would not start after this step. I waited for 30 minutes and started charging. The unit got so hot that I couldn't hold it on my hands anymore. I did a hard reset and it still wouldn't start. At this time, I just hope that I received a defective unit. I also own a Google Nexus 7\" which is made by ASUS and I thought I could buy something directly from ASUS with confidence. However, this experience has reduced my confidence on buying another ASUS product again. Therefore, I am back to shopping for a new tablet.", "Title": "Don't buy. I hope I am wrong", "Date": "June 26, 2013"}, {"Author": "davekalyn", "ReviewID": "R3RIXJL7N1UC3", "Overall": "5.0", "Content": "My son loves his tablet. It does everything that he needs and more. The negative and its a pretty big negative to me was the seller. We bought this item for our son for Xmas. As you can guess we bought it before Xmas time and had it hidden away from prying eyes. Shortly after Xmas the tablet was acting up. We called the seller to see about swapping it for a working one. We were told a very short, \"its over thirty days\". Repeatedly got told that and only after Amazon stepped in did they do something. By the time that happened we had had it repaired. Again a great tablet, horrible seller. My apologies but the seller was Electronic Express. Big 0 out of 5 on them.", "Title": "Like the product and my son loves it", "Date": "February 10, 2014"}, {"Author": "David", "ReviewID": "R3VX9CJRVH0UJV", "Overall": "1.0", "Content": "Junk! Constantly freezing! Speakers sound like something from the 99 cents store. I will never purchase another Asus product again. Screen has horrible viewing angles. Do yourself a favor and get a samsung galaxy tab 2.7.0 or note 8.0.", "Title": "Garbage! Should have listened to the negative reviews. Save yourself the time and money. Purchase something else!", "Date": "November 21, 2013"}, {"Author": "Ace", "ReviewID": "R3MC3F1FQV55BB", "Overall": "1.0", "Content": "Was sent a defective product, touch was intermittent to not working at all.  This should be checked prior to sending to customer, very poor outgoing quality control. Returned it 1 day after I received it.", "Title": "Defective product - intermittent touch", "Date": "November 18, 2013"}, {"Author": "Doris Ward", "ReviewID": "R1NXY025FSZMDD", "Overall": "3.0", "Content": "I like it for small things but really dissappointed in the way it takes pictures.  You can't see what you are taking a picture of, no eye hole in the back of it.", "Title": "It's ok", "Date": "October 21, 2013"}, {"Author": "Janice", "ReviewID": "R22BMM3VBOKBK8", "Overall": "2.0", "Content": "I don't like the fact that the screen goes into a 3d effect if you look at it from the side.  My friend has a Samsung and you can view the screen from any direction and it looks good.  I have ordered a Samsung,", "Title": "Asus 7 inch Notebook", "Date": "October 9, 2013"}, {"Author": "RicardoSoto", "ReviewID": "R3VCY1WN18E1T8", "Overall": "5.0", "Content": "I love this tablet, it has everything you want is in here for a great price. An excelent tablet for daly uses,", "Title": "Excelent Tablet", "Date": "October 4, 2013"}, {"Author": "Dionilsy", "ReviewID": "R3DBSQ5OSSBQQJ", "Overall": "1.0", "Content": "I bough this tablet as a start for my kid and it has been freezing, in fact they just abandoned using it. I have factoy reset it a couple times and it still bad, no additional programs downloaded to make sure there's no virus.I will try getting a replace,", "Title": "Bad luck, it freezes, since i got it.", "Date": "September 16, 2013"}, {"Author": "Erick", "ReviewID": "R1C1MYTNFDO6G7", "Overall": "5.0", "Content": "Very Good!!! This device is of great quality and very good price. Recommended. There are people who expect more, but for precione right.", "Title": "Very Good!!!", "Date": "September 6, 2013"}, {"Author": "Helio", "ReviewID": "R39BEL4J47G7H1", "Overall": "5.0", "Content": "Does everything I wanted.  It browses, matches up to my Kindle and makes it very easy to share electronic photos with my parents.", "Title": "Outstanding value", "Date": "August 25, 2013"}, {"Author": "Drei_Katzen \"dreikatzen2004\"", "ReviewID": "R9B7UHQITD7HF", "Overall": "1.0", "Content": "I loved everything except that it needed resetting after every charge, and now it just won't finish booting up. Junk. Less than a month old and it's trash.", "Title": "Needs to be reset after charging, now just won't finish booting", "Date": "August 10, 2013"}, {"Author": "Dave Crookes", "ReviewID": "R35T0ZM1MXCKVK", "Overall": "5.0", "Content": "Bought this because I like to read - A LOT. Call me Goldilocks - my smartphone was too small, my laptop was too big but the MeMO Pad is just right.  Not to mention a great buy at $89.95 from a quality manufacturer.  Plenty of apps are pre-loaded, many of them are the usual suspects, more than I will use on an on-going basis but I'll likely have some fun test driving them.", "Title": "Great value!", "Date": "August 3, 2013"}, {"Author": "preape", "ReviewID": "RM78DGFDPTJJ0", "Overall": "1.0", "Content": "okay for Netflix and, email, that is being friendly. Every app I want it tells me it is not compatible, even ones I don't really want. Don't make the mistake less is not more. might be ok for a kid. sent it back not satisfied at all going to get the higher version.", "Title": "If your lucky 1 out of 10 apps work in Google Play.", "Date": "July 8, 2013"}, {"Author": "Wendy DC \"poodle mama\"", "ReviewID": "R3L362VD3VZ5UA", "Overall": "5.0", "Content": "This Asus Memo is quick, easy to use and capable of downloading android apps from everywhere I've looked. I'm not a very tech-savvy person, but found it to be set up logically and smoothly. Compared to other 7-inch tablets with the same 4.1 jellybean operating system and 16 GB, this was a steal price-wise. I'm really pleased with this ASUS Memo. All that and pink, too. Great!", "Title": "A Gem of a Tablet", "Date": "June 26, 2013"}, {"Author": "DEALHUNTER", "ReviewID": "R1COX0N00YH3XN", "Overall": "3.0", "Content": "This tablet is just OK. It's a decent value for the price if you are looking to buy something for the kids, but if you're an adult, spend the extra 20 and get a refurbished Nexus-7, also made by Asus, but 10x better in every way.", "Title": "OK for the price", "Date": "May 30, 2013"}, {"Author": "RTD- GA \"jewel addict\"", "ReviewID": "R3LWX3ZNV3XYYK", "Overall": "5.0", "Content": "Great price !! Good one.Just that it doesnt have a back camera. Just the front one.This is a gift for my sister. She is OK with it as a beginner. Has google play store and hence good enough to download games & other apps. Cute color", "Title": "What you need for low price!!!", "Date": "May 15, 2013"}, {"Author": "Gary Dahl", "ReviewID": "R3U3W2XFAA0ID7", "Overall": "3.0", "Content": "For a cheep tablet it is ok.  Don't expect much and you will be happy.  Camera is very poor.  Spend a few extra $$ and get a better tablet.  A lot of apps do not work on this.  If you want to surf and check email it fit the low cost bill.", "Title": "OK But", "Date": "May 12, 2013"}, {"Author": "Blacjak", "ReviewID": "R2MESDZ57BJ5P9", "Overall": "5.0", "Content": "This is the best lil tablet. It does everything I need it to do. I can catch up on all my email. watch movies, tv shows. I have to say I wish it had a rear camera but that is not a deal breaker. It is awesome. I love it!!!", "Title": "Nice tablet", "Date": "May 8, 2013"}, {"Author": "arbepa", "ReviewID": "R112VYFLWXKLDB", "Overall": "5.0", "Content": "Highly recommended. Item as described, excellent product. Low price. Great value for money. Is my second experience with Asus products and it couldn't have ben better.", "Title": "As I expected...", "Date": "May 5, 2013"}, {"Author": "Rocksister \"tee\"", "ReviewID": "RY70W1W1BJ2VX", "Overall": "1.0", "Content": "I have to enter a space before I type because if I don't the first letter drops off. If I press uppercase it does two letters, not just one. Can't put web shortcuts on desktop. Have to hit space after every word, even if I use the auto word function. First letter of each sentence is uppercase, so is second letter. No way to set home page in browser. You have to manually browse to that site again.  I'm going to give tech support a little while to address these concerns, then buh bye it goes. My first tablet and I hate it. Zero stars if I could. My phone is 100 times better.", "Title": "Frustration reigns", "Date": "October 19, 2013"}, {"Author": "Frank Garcia", "ReviewID": "ROI67QO0O6GC9", "Overall": "1.0", "Content": "It won't run allot of the apps I needed it to do. The nexus 7 was is worth the price difference.", "Title": "better off spending the money on a better tablet", "Date": "September 17, 2013"}, {"Author": "Jimmy \"DrBalooba\"", "ReviewID": "R3RXKAFNBVPRXJ", "Overall": "4.0", "Content": "I purchased this ASUS to replace a BN NOOK 8gb device. Without a doubt, this is a better tablet. Faster, better web connectivity, and more stable. I have used this ASUS extensively while traveling, and it has never let me down. I can easily establish a wifi connection at any location. The touch interface works well enough, and there are at least two different keyboards to choose from. Perhaps best of all, unlike the BN device, it allows full access to the Google play store without requiring a hack. Considering its specs, I doubt this is a good tablet for gaming. However, for basic web use it is an excellent performer.", "Title": "Good tablet for basic web & email", "Date": "June 6, 2013"}, {"Author": "Jack W. Ferry \"jfkindle\"", "ReviewID": "RQNSLEIDAKBXU", "Overall": "5.0", "Content": "I just got it a day ago. But I already had a Kindle fire but sold it to a friend. Then upgraded to the Asus TF700 Transformer Infinity. The Infinity is my go-to pad. This is a backup. The Memo Pad is easy to hold in one hand. The 10.1 inch Infinity is not. I got it to read books, video, surf the internet and listen to pod casts.It will fit perfect on the perch on the machines at the gym. Then you can watch video or listen to music or anything like that. The external speaker is very loud and sounds great. I recommend it for people who don't want to spend $199 and up on a tablet and don't expect to play intensive video games. The 1064 x 600 screen is great at the close viewing length when you hold in your hand at arms length. You won't have issues with the sharpness and clarity. If you are picky about clarity then you need to spend $299 and get 1900 x 1200 or better.Also think about it. At this price; $149 you have not invested in something that better last 3 or more years like I did with the $500 Transformer Infinity.  In a year or two you can get the next upgrade. Remember this is something at the same price point you pay for a smartphone and you move in and out of those every year or two.Well hope you enjoy my review and the memo pad.", "Title": "Really good 7 inch tablet", "Date": "May 8, 2013"}, {"Author": "Charles Mcdonald \"CHUCKSTA\"", "ReviewID": "R2FZQQD07C6YC", "Overall": "2.0", "Content": "had this tablet for a month now, seller gave me the run around at store, only to find out it did have bluetooth and GPS, wifi was fine. But my biggest problem was that i couldnt tether using my phone as hotspot,  that put the nail in the coffin...why cant i tether? I would of gave it 4 stars if it would accept tethering, nope!!!", "Title": "No bluetooth, GPS, and Slow...Oh my!!!", "Date": "October 16, 2013"}, {"Author": "Jessica Smith", "ReviewID": "R3NRG8DECM11QN", "Overall": "4.0", "Content": "Really liking this tablet.  There is no instructions to use it but it is easy enough to figure out .  The white does not show at all if you put a roo case on it.  I wouldn't spend the extra for that again.", "Title": "Great", "Date": "October 15, 2013"}, {"Author": "Theresa A Peters", "ReviewID": "R14F161523ZHTT", "Overall": "3.0", "Content": "I thought when I purchase this I would get instruction that are able to do on my pad. I have only been able to put on the apps that I know about from my phone. I would think that it would be included in the packets", "Title": "rating", "Date": "October 7, 2013"}, {"Author": "BrandonArt", "ReviewID": "R2CDZD9FSSTKLJ", "Overall": "4.0", "Content": "I love this little guy. It's cheap, and it supports pretty much all the apps that I want to use, like Netflix. However, you'll come across several apps that don't work on this tablet, which can be a pain sometimes.The battery life is pretty good, too.", "Title": "Great for the price", "Date": "October 4, 2013"}, {"Author": "jose luis", "ReviewID": "R1SNBTU7VEEY33", "Overall": "5.0", "Content": "I like it very much,very fast,you have an ipad mini but chepear,and with thousands of apps i wll enjoy it", "Title": "Love it", "Date": "October 4, 2013"}, {"Author": "Norm", "ReviewID": "R2DVVQ9CJLG0S6", "Overall": "3.0", "Content": "Couldn't get flash to install, no card slot to back load it, the only camera faces you,Returned unit, no hassles, customer service was excellent. Will buy a better one.", "Title": "Ok Tablet", "Date": "September 24, 2013"}, {"Author": "James Reid Sartin \"Reisa\"", "ReviewID": "R3ATRD8W1ZAARB", "Overall": "4.0", "Content": "Seeing this tablet on Amazon and having tested it out in the past -- I have to say that a sub $100 price is fantastic for it.  I debated between this and the 2013 Nexus 7, but went with the Nexus because I'm a performance junkie.  This won't be a techie's favorite tablet, but for kids, or older parents it would be great.  Especially anyone who's looking for a low-cost e-reader that can incorporate all of the major e-book platforms via apps (Kindle, Nook, Kobo, Google Books, etc.).", "Title": "ASUS fan here", "Date": "September 6, 2013"}, {"Author": "Carlos Rico", "ReviewID": "R2MTA9K7UBSS93", "Overall": "5.0", "Content": "It is a very good tablet for the price. If you are not looking to spend 400+ on a tablet then this is the one for you. It is good with browsing the web and watching movies.", "Title": "Good cheap tablet", "Date": "September 2, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R13L2I3IC16ZW3", "Overall": "5.0", "Content": "Price was right up my alley.  Purchased for my 3 year old nephew so I could get mine back from him.  Very easy to use.  Anyone old or young can figure out how to use it and enjoy.  Picture perfect!  Will purchase another one very soon.", "Title": "Perfect for my young nephew!!", "Date": "September 2, 2013"}, {"Author": "JP", "ReviewID": "R1W6NHTBSEOQ3C", "Overall": "4.0", "Content": "We've had some issues with it freezing up, but when it does work, it works well. I suppose like everything else, you get what you pay for. Still; would buy it again.", "Title": "Ok, For the Price", "Date": "September 1, 2013"}, {"Author": "Andrea Hurst", "ReviewID": "R32VSS6GS9CLST", "Overall": "4.0", "Content": "Takes a long time to charge. My 5 year old loves it... Works fine for a tablet for kids, mine enjoys it", "Title": "Good for kiddos", "Date": "September 1, 2013"}, {"Author": "Geraldine Byrdsong", "ReviewID": "RS6HTVV79CPOL", "Overall": "5.0", "Content": "This item is just right to take with me as a supplement to my cell phone.  The item does everything as described. I would recommend  it to a friend.", "Title": "Great value", "Date": "August 31, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2IAL3HHC13JWX", "Overall": "5.0", "Content": "Working great. I am new to this and learning i do wish it had come with a manual but i have been told i can get it on line.", "Title": "good", "Date": "August 31, 2013"}, {"Author": "Adeline Charles", "ReviewID": "R1YFGK9XOPOMIU", "Overall": "4.0", "Content": "It's a good product overall but the screen stops responding at times and there's no camera at the back. However, it is very fun to use.", "Title": "Good but Flawed", "Date": "August 31, 2013"}, {"Author": "C4D", "ReviewID": "R26GXBP0IP98ZO", "Overall": "5.0", "Content": "Seeing wife uses facewbook a lot, so decided to give her this for better viewing with larger screen. She loves it!", "Title": "great price for entry level pad", "Date": "August 31, 2013"}, {"Author": "Orin V.", "ReviewID": "R33AUEDFLKY3U2", "Overall": "2.0", "Content": "limited access to some internet, Netflix for ex, was hard tog get, I was able to return it with out a problem", "Title": "netfllix has a delay in it", "Date": "August 26, 2013"}, {"Author": "Anubis", "ReviewID": "R3KVJVZ260WBKD", "Overall": "5.0", "Content": "the only issue is you have to self install instagram. other that that its awesome, and speedy for a single cpu tablet.", "Title": "great tab!", "Date": "August 21, 2013"}, {"Author": "darwin", "ReviewID": "R1IBQ3NXTSARGX", "Overall": "5.0", "Content": "just baught one for my little cousin and loved it so much. I just ordered another one for my self", "Title": "great product", "Date": "August 18, 2013"}, {"Author": "Adil Al-Balushi", "ReviewID": "R2O7L4C82A3RIF", "Overall": "4.0", "Content": "I bought this product for my sisters daughter and she is happy with this product. I would like to buy 2 more", "Title": "goood", "Date": "August 17, 2013"}, {"Author": "Mark", "ReviewID": "RV0J7KVZ92BZ4", "Overall": "2.0", "Content": "I bought this for one purpose.  To test Android Apps that I wrote in a form factor smaller than a 10 inch tablet.So if it had any real capability beyond that, then it would just be gravy.I believe this \"Memo Pad\" was designed to be an E-Reader.  It's best viewing angle is vertical (like in the product photo) and looking at it straight on (actually about 80 degrees from the bottom).  Anything other than that it gets weird.  Go to 110 degrees from the bottom and you can't see the bottom part of the image.Rotate it to horizontal and the image takes on a weird 3 D effect.So if all you want is a Reader, it's fine.", "Title": "You get what you pay for - 80 degree viewing angle", "Date": "August 14, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2KJ82ADFSQG5E", "Overall": "4.0", "Content": "Does strange things at times, but overall, I like it fine.I mainly play games on it.I would recommend it.", "Title": "nice gadget", "Date": "August 10, 2013"}, {"Author": "MarkC Cocoa Beach", "ReviewID": "R30E8R6G6MSYG7", "Overall": "4.0", "Content": "Needed a budget tablet from a good brand. Uses will primarily be browsing and email, plus real estate listing demonstrations. On the business function the MeMo 172v is a little slow. I need my website to pop when demo'ing to prospects. But now I'll have to explain that tablet is a little slow. That is disappointing but not a big deal.Typical Asus quality throughout. Very impressed and mostly satisfied. Buy the Asus case with kick stand for best protection. Setup was as easy as it gets. It immediately updated the OS to 4.1.1. Enjoy.Update August 4, 2013:Well, let's just say I was stoked. After using the Asus MeMo 172V 7\" tablet in the real world... not so stoked. BEWARE: Amazon lists the specs on this unit as having 2 processors. It does not. It is a single-core Cortex A9. There are dual-core Cortex A9 processors in the retail channel (kind of confusing), but this product does not have that CPU version. It is a single core computer. Might return it just on the basis of misrepresentation.", "Title": "Stoked! MeMo 172v is an Excellent Value", "Date": "July 30, 2013"}, {"Author": "Mohan", "ReviewID": "R1TYYWYD8NNL4O", "Overall": "3.0", "Content": "Is there any one who can help. I gifted to a friend who drives a taxi. The navigation menu on Google map is not available and so is voice guidance. Can any one help?", "Title": "google map navigation and voice guidance.", "Date": "July 26, 2013"}, {"Author": "Joseph", "ReviewID": "R2FP6GXBY32PO8", "Overall": "5.0", "Content": "Ordered this for myself cause I didnt want to pay the outrageous amount for an ipad, I am very pleased with this so far, quick, nice graphics and allows me to down load everything that i normally use except for instagram, which i am ok with. I ordered it friday afternoon and i was using it by noon saturday! Still cant believe how fast it was delivered!", "Title": "Love this Tab!", "Date": "July 13, 2013"}, {"Author": "K. Adkins", "ReviewID": "R1ODYBAI0XNL8Q", "Overall": "4.0", "Content": "Great little tablet for the money My wife loves it so easy to use and can play lots of games and apps. The 9in screen was a plus for her.Some say it lags at times but its not that bad and movies look great on it", "Title": "ASUS MeMO Pad ME172V-A1-WH 7-Inch 16 GB Tablet", "Date": "July 7, 2013"}, {"Author": "Stella C Klein", "ReviewID": "R2ND2D9YV5I200", "Overall": "5.0", "Content": "I know ASUS makes quality tablets, but this is not one of them. I currently have a 10\" Acer that I love, but wanted something smaller.  Expected ASUS to provide an adequate 7\" tablet just to do common web based apps like browsing, Facebook, radio and video apps.  It cannot handle any of this.  Browsing is painfully slow (found Opera Mini to be the best option) as Chrome and other full featured browsers hang. Videos start and stop, or just hang completely forcing a restart of app or a complete reboot of the tablet. If performance mode is selected (it does not make much difference) be prepared for laptop type battery life.  Where the Acer will go days without a charge, this goes hours, to maybe a day of on and off use. I guess if I considered the low cost of this tablet, I should have set my expectations a lot lower.  It is a good reader so based on that and low cost, I gave it an OK.I need to update my review of this tablet (3/9/14)to bump it up two stars! My biggest concern after I bought it was the horrible battery life and slow network speed. In January the battery died completely and would not accept a charge at all.  Asus honored their warranty and repaired the device in a timely manner with no hassle.  All I can say is WOW; night and day difference in battery life, wireless power and network speed.  I am very pleased with the device now as it can easily go three days (on and off use) without a charge.  It's fast and no longer has issues with video or browsers hanging up. I think I may even like it better than the Acer :-)", "Title": "Barely Usable", "Date": "July 6, 2013"}, {"Author": "tornike kipiani", "ReviewID": "R2YRIXNX4AVU7R", "Overall": "5.0", "Content": "i both these moth a go it work just perfect, you get what you pay for ! even more .it's great it's cheap ! ! love it !", "Title": "asus memo pad i like it a lot!", "Date": "June 14, 2013"}, {"Author": "T. Heard \"Ms. T Heard\"", "ReviewID": "R3VX0G146VCR7S", "Overall": "5.0", "Content": "This is a great gift I bought it for my mom for mothers day she's in her mid 40's and it is great for her she loves it.", "Title": "Great", "Date": "June 3, 2013"}, {"Author": "scott m.", "ReviewID": "R1JPKU94DL34ZP", "Overall": "5.0", "Content": "ilove this  my 3yr old loves  playing it easy to get around  now once the wifi hook up right i load  some games up for him", "Title": "i love  it", "Date": "May 29, 2013"}, {"Author": "Nan", "ReviewID": "RBUN6F86B0LC1", "Overall": "5.0", "Content": "It does everything I want it to do and for a good price. I like it better then the Samsung I had. As it has a card reader and I can put  games on a card and save room on the tablet.", "Title": "Great little tablet", "Date": "May 11, 2013"}, {"Author": "T. W. Staton", "ReviewID": "RP57J0P0BVFIR", "Overall": "3.0", "Content": "Worked great for two weeks. The pads' screen froze at the asus logo and wouldn't continue. Called asus support and they tried several resets over the phone. This didn't work so I had to send it back for repairs. The support team at asus is great. I followed the instructions they gave me and sent it back. Within 7 days I had the unit back. It is still working.", "Title": "Froze up after two weeks", "Date": "June 30, 2013"}, {"Author": "UnSatisfied", "ReviewID": "RBUEPDV1Y1ACO", "Overall": "3.0", "Content": "I received this as a gift and I was really excited (about a wk ago). First off it has no camera unless I want a picture of myself since it is only front camera. (Sucks!) Then it is not bluetooth compatible. And now I've realized I can't download apps for important things like Bank of America, Groupon and a lot more. Sad! Yes it is good for most games and it does run good (reason why I didn't give it a lower star) But its worth spending $40 more and getting a different device.", "Title": "Not as good as it sounds!", "Date": "June 17, 2013"}, {"Author": "Ismael Al-Omari \"Obstacles are what you see w...", "ReviewID": "R8X0P8BHJBDCI", "Overall": "4.0", "Content": "Good tablet in general, but add 10-15% more and you can get a better Acer or even Samsung Tab 2!I realized too late (after making the order) that it had no back-camera and only a front one with low megapixels!OK for kids I guess.Satisfied for the special price I got it for...", "Title": "Not bad for the value", "Date": "May 31, 2013"}, {"Author": "being loki", "ReviewID": "R185Q7RETIYAOJ", "Overall": "5.0", "Content": "Remember Honda and Toyota back in the 90's???  It was cheap but exceptionally well made.  Great buy if you don't want to spend what competitors are asking.", "Title": "Tablet", "Date": "February 7, 2014"}, {"Author": "joshua james", "ReviewID": "R2MHECXAWVYHYS", "Overall": "1.0", "Content": "Came after the estimated date. when it finally came it was a pretty decent little tablet. Jellybean os doesnt make the tablet run any smoother. Still a lot of lag. Power button stopped working last week and none of my movies recorded on my phone plays on this. Wish they let me give 0 stars. would not recommend.", "Title": "you get what you pay for", "Date": "November 28, 2013"}, {"Author": "Beto", "ReviewID": "R3LF0DEATN13WD", "Overall": "1.0", "Content": "Very unhappy about this purchase because the item never arrived, buy two tablets equal and only one came, disappointed I never thought this could happen, the buy to give as a gift to my children, now do not know if I came back the or not to create controversy to sell it with my children, I will try as far as possible not to buy around here if I am not resolve the problem, the same problem I am presenting with some cases for these tablets coincidentally had the same tracking", "Title": "Descontento", "Date": "November 6, 2013"}, {"Author": "Cathy Mendoza", "ReviewID": "R229OZLPVV79GM", "Overall": "3.0", "Content": "the camara's lent is only facing me.  it is very uncomfortable trying to catch the view you want.  that's it", "Title": "It is not what i expected", "Date": "August 1, 2013"}, {"Author": "tompete \"teepee\"", "ReviewID": "R1O6ODEAEBTZOV", "Overall": "5.0", "Content": "Very handy size for glove box when going anywhere. Have (10 \")  also for more reading & other aps that require more room", "Title": "7 in tablet asus", "Date": "July 15, 2013"}, {"Author": "MKP52", "ReviewID": "R2036IE8DLC2XP", "Overall": "5.0", "Content": "I absolutely love it. Bought it as a gift for my cousin. The responsive is simply amazing. I'm happy to have made a good choice.", "Title": "Great product!", "Date": "June 25, 2013"}, {"Author": "Kathy Didday \"Kathy\"", "ReviewID": "RRJBKARRMKJOE", "Overall": "5.0", "Content": "I purchased this as a gift for a dear friend.  I was out of town when it arrived & she text me & told me that she hadn't been able to put it down since she got it!  She absolutely loves it!", "Title": "7\" Asus Tablet", "Date": "June 11, 2013"}, {"Author": "J. Rosado", "ReviewID": "R37FB8SVZ8B2Z", "Overall": "4.0", "Content": "Bought it as a gift for my stepmom. She really likes it, light weight, fast, beautiful screen.Easy set up and quick wi-fi connectivity.", "Title": "perfect", "Date": "June 1, 2013"}, {"Author": "Sarah Stewart", "ReviewID": "RUYSFYDJQ0HQD", "Overall": "3.0", "Content": "I bought this as something my 2yo could play with and watch videos. However, it did NOT say in the reviews that it does not have the software needed to watch videos!! So I feel like its kind of pointless!", "Title": "Cannot watch videos on this! Read the description CAREFULLY", "Date": "December 5, 2013"}, {"Author": "jmclr", "ReviewID": "R15F2UEVP123NN", "Overall": "3.0", "Content": "I received my MeMo pad today. Opened the package and statred charging. There is no LED to show charge level. The unit was in On position. Manual says charge for 8 hours before use. AT THE SAME TIME IT SAYS IT SHOULD NOT BE LEFT CONNECTED TO POWER SUPPLY FOR EXTENDED PERIOD OF TIME. IT IS NOT DESIGNED THAT WAY. To that is a big black mark.I will provide more reviews later on.I bought it for one reason low price - it dropped to under $105 yesterday - It is more like Kindle Fire with slot for micro SD card and 16 G internal memory. I do own a Kindle Fire for last 16 months ago - I bought it for her birthday last year - She love her KindleAnother problem can not use sites using adobe flash player like Amazon prime videos", "Title": "No LED for power on or charge indication = not acceptable based on my review comments", "Date": "June 19, 2013"}, {"Author": "elham daneshfar", "ReviewID": "R1WDMNLIAZ99PB", "Overall": "5.0", "Content": "I didn't have any problem till now.I downloaded a lot of games and ebook in there for my daughter.I was happy.", "Title": "good", "Date": "June 16, 2013"}, {"Author": "Pearlz", "ReviewID": "RDJ1JKXNK9AMQ", "Overall": "1.0", "Content": "Screen froze and sent in to have ASUS fix it.  They told me that the screen had cracked.  Puzzled as tablet was never dropped or handled harshly.  Disappointment in ASUS customer support and product.  Since it was not under warranty, I was told I would have to pay to get it fix.  It will cost me twice as much to fix it from my purchase price.  Would not recommend this product.", "Title": "Bad product", "Date": "November 13, 2013"}, {"Author": "aslam mohammed", "ReviewID": "R3FS7OI5GMWBDI", "Overall": "1.0", "Content": "very very slow processing, won't suggest it for any one.very very slow processing, won't suggest it for any one.", "Title": "horrible", "Date": "September 26, 2013"}, {"Author": "Ardis Jackson Jr. \"whatage\"", "ReviewID": "R1SQPFWKPNE9VX", "Overall": "5.0", "Content": "I purchased this for my daughter. She loves it. It works just like it's was described. I plan to upgrade later.", "Title": "great", "Date": "July 11, 2013"}, {"Author": "Dh", "ReviewID": "RZDOCJNWENG7U", "Overall": "1.0", "Content": "I hate it, be very careful and watch the misleading pictures displayed on amazon.com, no rear camera and front camera is very poor quality, worse than old web cams, in any light", "Title": "I hate it, be very careful and watch the pictures displayed, no rear camera and front camera is very poor", "Date": "September 5, 2013"}, {"Author": "Francisco", "ReviewID": "R2Z7VF8BEFXEP1", "Overall": "1.0", "Content": "I bought an Asus Memo Pad not too long ago and i started using it right away after i got it but it discharges too fast, the Asus Memo Pad doesn't have too much battery life. I don't like it.", "Title": "Not Too Much Battery Life", "Date": "August 29, 2013"}, {"Author": "T. Sappia", "ReviewID": "R1HMY2IW60JBA6", "Overall": "1.0", "Content": "It came with a broken screen.Sent it back but had to pay for postage.  Still took several days for the refund. Tried looking for a contact number to call Amazon. Have you ever tried to reach Amazon and talk to a customer service person??  Ha! Good luck.  Just give it a try sometime.I used to love Amazon and I used them all the time.  Next time I 'll just drive down to my local BestBuy or Costco where at least I have a chance to get an issue resolved. Oh...also, I ordered a Kindle Fire to replace this broken one. I kept looking daily to see if it had shipped and it said it had not been shipped yet...then this morning we looked and the entire order was gone from my account.  no reference that it was even placed.  ugh.  Best of luck.", "Title": "Arrived Broken/ Zero customer service", "Date": "August 22, 2013"}, {"Author": "Kokorozashi", "ReviewID": "R32IJY5069WOV4", "Overall": "1.0", "Content": "All in all, the MeMO pad is a fairly good quality tablet considering the price. However, if you drop it, expect to replace it. I had this thing about two weeks and was waiting on a case, which unfortunately was coming from the UK. Before it got here, I managed to drop it a couple feet onto a hard surface when it slipped out of my bag. It looked perfectly fine, but something inside got cracked or disconnected, because now the screen is just colors and lines.ASUS customer service is friendly in that disinterested, unhelpful way of most technical service these days. Apparently that repair is not covered under the warranty, even though while they had me on hold the hold message said that the warranty covered one case of accidental damage per machine. This was never quite explained, but whatever: so I ask for an estimate of how much it will cost to get it repaired. The estimate they gave me was $180 (not including shipping). Note that this is a $100 tablet. I was stunned that anyone could even utter such a thing without feeling stupid.I'm going to see if there's any other way to repair it, but I can say that I will not be buying an ASUS product again. The accident was just bad luck, but the surreal experience with customer service has put me off this company entirely.", "Title": "Buyer beware", "Date": "September 11, 2013"}, {"Author": "Gen \"GG\"", "ReviewID": "R7AE62QQQNEBE", "Overall": "2.0", "Content": "If you want to get this to entertain children it's fine. If you want Instagram, don't get this. If you have any apps in mind, first look up to see which devices are compatible.", "Title": "it's fine if you want to give it to a child", "Date": "April 30, 2013"}, {"Author": "bartendme", "ReviewID": "R1M7F0POTDH327", "Overall": "1.0", "Content": "I advise against purchasing this. I had exams to study for, and purchased it so I could read websites, etc. while travelling. First out of the box, my very first attempt at a connection was slow. Not connection wise, as I was connected to a strong wifi signal. Literally, my Samsung S3 is FAR more powerful than this tablet.", "Title": "Pathetic", "Date": "August 28, 2013"}, {"Author": "Adam Gagnon", "ReviewID": "R2GY05X6ZTYCWJ", "Overall": "3.0", "Content": "I bought this product because I have a 7'' kindle fire and like the size. This tablet was meant to replace my mothers laptop. I returned the item without opening it to get her the kindle fire 8.9'' when I found out such a thing existed. The return wasn't a negative to this product I just went in a different direction.", "Title": "Don't consider this review", "Date": "August 20, 2013"}, {"Author": "Michael M. Stewart", "ReviewID": "R339NRGGHHOVUD", "Overall": "1.0", "Content": "At first I thought this device to be a great on the go reader, but I was very wrong when I received the device I turned it on without any problems but after a system update failure the device kept telling me that \"No USB cable connected\". I don't know what that exactly means but it would not boot up into the Android OS. I returned the device for another one, had the same issue after an update. I do not know what exactly I did wrong in the update part but it failed the second time on the replacement device. I have owned an ASUS Transformer TF101 and never had any issues updating it, but for some reason this device gave me issues. Now it could be just a cheap piece of junk due to it being so low in price, I don't really know. Now the ASUS Transformer TF101 was very expensive and maybe that is the difference. If you want low end junk then this device is for you and if you want a stable and non problematic device then this is not for you. Other people's experiences may vary with this device, but with me it was very distasteful.", "Title": "DO NOT BUY THIS DEVICE!!!!", "Date": "July 31, 2013"}, {"Author": "Parviz", "ReviewID": "R3D5N8JNC9G6R0", "Overall": "4.0", "Content": "It is a pity that is not present wifi direct. I do not know now as to throw off the information from a tablet on a tablet.", "Title": "good tablet", "Date": "July 20, 2013"}, {"Author": "Tdc1ben", "ReviewID": "R2CRQ8T68VZKVK", "Overall": "1.0", "Content": "Though this was a well made Tablet at a very reasonable price. After getting it & testing it for a few days I found out it was not.You cant watch Net flick or some You tube videos as it does not support plash player witch most online videos use now days.I cant believe that ASUS would put out such a product. If they are it should be stated that the tablet I not for use with watching videos & some other apps wont run on this tablet. I cant use my Walgreens app witch I use for ordering all my medications each month & I use Pay Pal app for paying for items that I have bought. The apps are much easier than having to login the web site & deal with what I need to take care in my daily life. I got an RMA to return the item & I hope that they don't try to hit me for the 15% restocking fee as not my fault that the item does not do what all other Tablets do & that is play flash videos.", "Title": "Does not suport flash Player", "Date": "August 18, 2013"}, {"Author": "M. Elwrayeth \"Rasta Squad\"", "ReviewID": "R2FZK6U6PYRCH0", "Overall": "1.0", "Content": "Yeah i thought to myself it is cheap, and it is for the girls to play with, but even so it sucks badly, very slow, can not run trending games, has no bluetooth, 4 or 5 apps in background you forget about running anything else, do a hard reset :( , very disappointed, i should've added extra 70 $ and went for Google nexus , stay away you will regret it too.", "Title": "The worst decision i have ever made", "Date": "August 6, 2013"}, {"Author": "EFRAIN RAMIREZ JIMENEZ", "ReviewID": "R3M1WIKGMYNNEB", "Overall": "1.0", "Content": "I bought and I retorned it, because of the poor quality. I don't recommend it. but if you prefer read more feed backs.", "Title": "Very poor screeen quality", "Date": "August 10, 2013"}, {"Author": "Eric", "ReviewID": "R1UGF2X4SZSV43", "Overall": "1.0", "Content": "when it arrived it would not turn on so i thought i should charge it instead the screen kept blinking i would like to be refunded but since it was my first time shopping at amazon i don't know how to get refunded so in lame term i got ripped of", "Title": "i hate it", "Date": "August 2, 2013"}], "ProductInfo": {"Price": "$175.00", "ProductID": "B00BDS25VA", "Features": "Android 4.1 Jelly Bean, 7.0 inches Display\nVIA WM8950\n16 GB Flash Memory, 1 GB RAM Memory\n0.8 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41IF79n9CVL._SY300_.jpg", "Name": "ASUS MeMO Pad ME172V-A1-GR 7.0-Inch 16 GB Tablet ( Grey )"}}