{"Reviews": [{"Title": "Great Starter Tablet", "Author": "John-Paul", "ReviewID": "R3VEGNFGID38BU", "Overall": "3.0", "Content": "The UI is slightly slower than my Gingerbread (2.3) cell phone, so I was able to get used to the delay in response pretty fast, though my nieces (bought one for each ages 8 and 5) had to learn some patience. Seemed like the device was crafted well and the quality of the container was nearly as good as my recently acquired Nexus 7.After roughly two weeks, my youngest niece broke the outlet adapter sleeping with it, but it isn't a big deal to replace. My older niece complained once or twice that hers was broken, but I think it was simply a matter of patience, allowing the device to finish booting.My two biggest gripes are the slow boot sequence and the lack of case selection. It would be nice if Google or Samsung would standardize the Android hardware form factor so the accessories market could compete against Apple. Otherwise though, I think this is a great introductory tablet for kids (5/5), an okay entry tablet for those on the fence about getting a tablet (3/5), and should probably be avoided by individuals who know they want a tablet (1/5).This could possibly work well for a custom home automation system, but I wouldn't recommend it for a HTPC remote, the interface is just not responsive enough imo.", "Date": "July 10, 2013"}, {"Title": "Just what I was looking for", "Author": "Mayita", "ReviewID": "R3QEDP6EDXEFZ9", "Overall": "5.0", "Content": "My child loves this tablet, it was what I was looking for. Batteries last a good time and my child can download games, take pictures. He really likes it.", "Date": "November 9, 2013"}, {"Title": "Amazing Little Tablet for $80", "Author": "David E Mevis", "ReviewID": "R1MEJKSPKY3L7Z", "Overall": "4.0", "Content": "First tablet and purchased as a gift.  Let me begin by saying the manufacturer is light on documentation.  What's there isn't bad, but everything you need isn't there.This is a WiFi only tablet and does quite a bit to make setup easy... except.  Isn't there always an \"except\"?  Finding the tablet's MAC address can take a few minutes.  Figuring out how to enter WiFi data will take another few minutes.  There is practically -0- documentation on this crucial process.There is also no information stating that the WiFi connection has to have an open SSID and that if using WEP, the tablet will on ly work on WEP 1, don't bother with WEP 2, 3, or 4... it will just waste your time.Having said that, if the tablet will work with a network using a non-transmitted SSID, some other WEP config, etc. I cannot confirm or deny... it's what I had to do to make things work and again, there is little to no documentation on this process.The actual operation is great.  It took a half hour or so to get used to, but it's a first tablet.  The unit speed is complained about in reviews elsewhere as is it's lack of \"3-D graphics\", but it is being used to supplement a laptop, not replace it, and is primarily used to surf the net, watch YouTube, read docs, etc.  It is a great $80 investment.Battery life so far has been about what the specs indicate... 4.5 hours or so, but battery life can be extended quite a bit when reading pdf's, watching video locally, etc. if you turn off the WiFi.  Just remember to turn your WiFi back on before you try to surf again, etc.Can't say enough good about this little tablet. I may buy another one or two and just keep 'em around the parlour for folks to use.", "Date": "April 26, 2013"}, {"Title": "Great value for the price", "Author": "starlightxviii", "ReviewID": "R2U1RB24M5WVPJ", "Overall": "5.0", "Content": "Cheaper than the Google tablet I purchased at Wal-Mart but thinner, lighter and just as functional! The kids have played several hours of games and it's held up well.", "Date": "November 2, 2013"}, {"Title": "Not the deal it appears to be", "Author": "Amazon Customer", "ReviewID": "RO19H41BXGVJN", "Overall": "1.0", "Content": "My children (13, 9, 6) each received one of these for Christmas.  The older two already had Kindle Fires.  After trying it once, they put them down and have not touched them since, even when they can't find their Fires.  My youngest will pick it up once in a while, but quickly gets frustrated and puts it down.  The response is slow and programs regularly freeze up (multiple times an hour).  I would not recommend this to anyone.  Save up and buy a better tablet.", "Date": "February 24, 2014"}, {"Title": "BUYER BEWARE", "Author": "JAMIE FENOGLIO", "ReviewID": "R2ZP7DPMHSSVY9", "Overall": "1.0", "Content": "This tablet is a complete waste of money.  Power button broke, manufacturer (Ematic) wanted $40.00 to repair.  Sound went out 1 week after use.  Battery does not stay charged. Touchscreen doesn't respond.  Manufacturer (Ematic) has terrible customer service. They are impossible to get through to on the phones for quick trouble shooting. They want you to email them and then they send you an automated response saying they will get to you in 48 hours. Then they tell you it's defective you must send it to them and pay shipping fees (you will also have to pay a service charge after 90 days). I strongly suggest that you look elsewhere if you are considering buying this product.  The manufacturer (Ematic) also has a Facebook page for customer feedback.  You may want to check that out before purchasing this tablet. COMPLETE WASTE OF MONEY.", "Date": "January 3, 2014"}, {"Title": "Pretty good for purpose", "Author": "Christie Bryant", "ReviewID": "R4AGHH9U79DCE", "Overall": "4.0", "Content": "I bought 2 of these for my kids. Yes, it moves a little slow at times, but for the price it's great!! The apps work wonderful, and high quality video and sound. I didn't want to spend a lot on such young children and this was perfect. I can't wait until they see what Santa brought them!", "Date": "December 6, 2013"}, {"Title": "Great for young kid", "Author": "Amazon Customer", "ReviewID": "R1GO5M1S5DNL5D", "Overall": "4.0", "Content": "I bought this tablet for my young child, so I wanted something not too fancy but reliable and sturdy. We've had it for a few weeks now and it works great for an inexpensive tablet. Speed times are not too slow and I like that I can add an SD card if I want more memory than the 4GB it came with. It will be great to bring along on long trips, etc. Thanks for making a good tablet that doesn't cost an arm & leg!", "Date": "November 25, 2013"}, {"Title": "Great little tablet for the price.", "Author": "H. J. Paradis", "ReviewID": "R3RY4RQ0CI8253", "Overall": "5.0", "Content": "I purchased the EGB103 Tablet last Month and it performs much better than expected, I plan on ordering a couple more of them for Christmas gifts. The touch screen works very well as does the WIFI, I installed a 32GB MicroCard to take advantage of the free apps that are included with it. There is a learning curve for those that have never used a Tablet before but between the included quick start guide and users manual, plus additional information available on Ematic's site getting it the way I wanted took a short amount of Time. Overall I am very pleased with it's performance.", "Date": "November 16, 2013"}, {"Title": "It's okay for the price", "Author": "Consumer in Gladstone", "ReviewID": "R2WRTTN3I7GKM9", "Overall": "3.0", "Content": "I have been using this tablet for about a month and for the $59 price it is pretty good. There was no problem connecting with our Wi-Fi. It is definitely on the slow side (compared with using my iTouch on the same wi-fi network), so I probably wouldn't choose this if I was trying to use it for heavy-duty business purposes.I recently had a problem getting it to sync my gmail account. There had been no problems previously and then for several days it kept saying there was no connection even though it said that the wi-fi connection was excellent or it would say there was a sync error. I kept playing with the settings, tried deleting the account and then re-establishing it. Don't know if or what anything I did actually cured the problem or whether it eventually fixed itself, but it's working again.As other reviewers have said, what do you expect for the price? It's very good for light use, games, and for kids. I do like how when you're typing an email it displays and updates three possible suggestions for the word you're typing which makes it faster and easier for sending emails. I would say that if your expectations are reasonable it's fine.", "Date": "November 2, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BH8U01I"}}