{"Reviews": [{"Title": "nice", "Author": "ElenaP.", "ReviewID": "R2PDWSGC6DQ60N", "Overall": "4.0", "Content": "Bought for my daughter and still working. I'd say that is pretty good. It is exactly as advertised and keeps her busy.", "Date": "November 18, 2013"}, {"Title": "good tablet for the price", "Author": "cristina", "ReviewID": "R3L48MHUZU8DV6", "Overall": "5.0", "Content": "we ordered this for our 5 year old  for her birthday cuz she wont stay off ours this tablet  is pretty cool does every thing  you want it to do it  is just a little slow sometimes but all she needs it for is games  and music and I love that it has goggle play she is downloading all the apps she wants this is great for kids the only thing I don't like about is u cant find any good cases for it other then that im pleased and it got here really fast", "Date": "July 1, 2013"}, {"Title": "Runs too slow!!!", "Author": "Psychologygirl", "ReviewID": "R1FJZY9DKAWDLO", "Overall": "2.0", "Content": "I have tried to get this tablet to perform faster but it remains too slow for me to work with.  I deleted unnecessary apps in hopes that it would speed up but has had no luck.", "Date": "June 4, 2013"}, {"Title": "Afunta 7-inch Allwinner A13 Q88+Dual Camera Tablet Pc Android 4.0 1.2ghz...", "Author": "Ida R. L. Varnedoe", "ReviewID": "RMJN70XY0WPFT", "Overall": "3.0", "Content": "So far, I noticed that it is slow, and it freezes up so quickly. I just don't know why it does that all of the time. I also am just getting to know to operate it with the help from my son. The directions isn't quite clear to me fully; so basically with my son's help; we're doing things just from experience. I see how it works out for me before my 30 day warranty is up. God bless us all.", "Date": "May 26, 2014"}, {"Title": "I'm not happy ...I can't games", "Author": "julian nelson saunders", "ReviewID": "R3C9VTA53JK7TU", "Overall": "2.0", "Content": "I cannot play games for whatever reason the state is automatically put into this tablet and Its not a match for my zip code so now I can play the games... I'm pissed", "Date": "January 16, 2014"}, {"Title": "Pretty and pink.", "Author": "b a hier", "ReviewID": "R3R86JIPKPVPIZ", "Overall": "5.0", "Content": "Bought for a 4yr old and a week later it's still working. I'd say that is pretty good. It is exactly as advertised and keeps my granddaughter busy so that is a clincher for me.", "Date": "October 4, 2013"}], "ProductInfo": {"Price": "$129.99", "Features": "Allwinner A13 1.2 GHz 7 inch capacitive Touchscreen Android 4.0 OS.RAM DDR3 512M ROM 4GB.\nDual Cameras Front 0.3MP Back 0.3MP Support WIFI, 4 way gravity-sensor, flash player 11.1.\nBuilt in 4GB memory and support MICRO SD/TF card up to 32GB which allows enough space to download freely.\nPortable and super slim design 5-points multi-touch capacitive touch screen for convenient operation.\nWi-Fi (802.11 a/b/g/n),2300mAh Battery for longer usage time.Skype video chat, HD games ,Netflix Movies", "Name": "Afunta 7-inch Allwinner A13 Q88+ Dual Camera Tablet Pc Android 4.0 1.2ghz CPU Multiple Touch Capactive Screen 512mb RAM 4gb HDD Wifi (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41lSYBRO-CL.jpg", "ProductID": "B00BWGQJUG"}}