{"Reviews": [{"Author": "Reggie", "ReviewID": "RFWS1VGF14J5B", "Overall": "4.0", "Content": "Granted this is a nice alternative from spending an arm and a leg for an ipad, or a kindle this tablet would be more or less ideal for a kid or maybe someone who doen't rely on the internet so often. One of the main reasons why this tablet has a 4 star rating in my opinion is the fact this will not work with any bluetooth device (there are no setting pre loaded on the tablet)even if you download an app from the play store or not. It comes with about 5gb (or you can add a micro memory card up to 32gb) worth of usable storage space which is plenty for anyone to download a few apps, videos or even books (currently I have about 75 books with only 800mb used). The screen works just fine indoors, however like most devices this one also has a bit of problem outdoors unless you're in a shaded area. It comes with both the standard browser and google chrome pre installed, so there's no need to download seperate browsers. While using this app there's a good chance you'll lean towards using the regular browser, since chrome seems to crash just about everyday I've used it. Overall it's pretty much the same tablet that anyone else offers, just at a cheaper price (check your local walmart or electronics store before purchasing here). If you're looking for something that have wireless options (keyboard/mouse) then pay just a little more for a tablet with bluetooth options, otherwise this would be a good birthday present for someone.", "Title": "Cheaper alternative from kindle/ipad", "Date": "May 24, 2013"}, {"Author": "J. Lockridge \"GadgetMonster\"", "ReviewID": "R2C04JWA0DR52H", "Overall": "3.0", "Content": "There are multiple tablets with the NEXT7P model number. This review is specifically for the NEXT7P12-8GAlthough this is a very inexpensive tablet (available for $69.99 @ WalMart stores), keep in mind you don't get a lot for that price.Things to consider:1: This tablet does NOT have Bluetooth. I personally don't care as I don't need Bluetooth support for how I use it2: The tablet has 8GB storage space. Not 8GB of RAM. And it's split as 1GB for the OS, and 7GB for file storage.3: By default, any apps you download will try to install where the OS is installed. Only a few apps, and you will get errors that it's out of space. You can go into settings/storage, and move everything to the \"SD Card\" option (If you put an SD card in the SD Card slot, it shows up as \"External TF Card\" so you get more options4: Many apps are incompatible. This is not EFUN's fault, but more the developers of those apps not making them available to tablets with the 8000x480 screen size. You would run into the same problems with the Archos Arnova 7, Sony notebook 7, Coby MID7015 tablet, Skytex Skypad, and many others as they have the same screen size. This means apps like TuneIn (which I use religiously) and dozens of others will not install without some light 'hacking'. This may change, but not likely since it's a low-resolution screen compared to most newer tablets.5: This tablet does get a bit warm when running 'intensive' applications or heavy downloading. I saw one post where a woman feared starting a fire. I doubt that as all these devices have to pass testing to even be sold in the US. It may simply get warmer than expected.6: There is NO rear facing camera. only a front-facing one.With that said, if you are going to use it more for email, web browsing, e-books and music, this is an awesome tablet for the price. Even for my odd way of using it (I use it to perform vehicle diagnostics with the help of a wireless diagnostic reader), it works very well and isn't as big a deal if I drop it as it would be if it were an iPad or even a Windows tablet. I would say this is also a much better device for younger kids than an iPad as well.The reason I give it 3 stars is that although it is a good tablet for the price for light/casual users, even the most basic users will get frustrated with many popular apps that won't install.If these limitations are a concern for you, look at the ASUS MeMOPad HD 7-Inch 16 GB Tablet, Blue (ME173X-A1-BL) instead  (it's about $150, but has twice the storage, higher resolution screen, front and rear cameras that are much higher resolution (1.2MP&5MP compared to the nextBOOK 0.3MP), Bluetooth, hardware buttons (the nextBOOK uses software on-screen buttons), has a USB port,  and a few other goodies, but at just over twice the price ($149).", "Title": "6 Things to Consider", "Date": "September 20, 2013"}, {"Author": "ThisIsNotAnExit", "ReviewID": "R1U774K1U0E02C", "Overall": "1.0", "Content": "I don't know how this company is legally able to do business they way they are ripping people off. I was gifted their tablet 6 months ago and now it will not charge. First I tried contacting them several times through their website. It says they will get back to you in 24-48 hours. 2 weeks later, still no response.So I called and it said I had to register the product on their website to even talk to technical support. So I try to register it, but it needs all this information off of the box. No where on the box, or in the owners manual did it say to register it before discarding the box.So I called anyway and explained the problem to them after being on hold after 30 minutes. They did not even apologize for not responding to my previous attempts to contact them! The lady on the phone then told me I needed a receipt if I was going to get it repaired. Even though it was a gift, I need a receipt to get their horrible product repaired. How about I am in possession of it, so you fix it? I have it, why do I need to prove it further then owning the product? For a repair. I am not trying to get money back, just a repair.I told her once again it was a gift, so I did not have a receipt, so she told me to get the person who gifted it to me, to go back to the place of purchase and have them find a 6 month old receipt. None of this makes sense.", "Title": "Do Not Buy Anything By EFUN", "Date": "May 29, 2014"}, {"Author": "Ali Thomas", "ReviewID": "R2VC4W0OLZF7C", "Overall": "1.0", "Content": "EFUN products are: a waste of money and time.  Buy a Kindle Fire to get a real brand name behind the purchase (for whatever that's worth these days)I purchased one of these for my high school daughter for lesson plans last August.  She used & enjoyed it daily through Christmas, but then the headphone jack died.  I told her to live with it as the unit worked for the stated purpose and the speakers still played (always very low).  In March the unit started sticking in a boot loop.  I brought it up in diagnostic boot and found the internal memory had stopped functioning so the OS was not there to load.  I called the warranty number but nobody in California ever answered (just hold music).  I'd get a call back the next day and an answer to emails, so I assume that required daylight in China not 9-5PST as stated.  They were NICE.  After two weeks of email, I did get a repair ticket & I mailed it back.  They did replace it last month on the 24th.  Fair enough and any small electronic can be bad.  This unit was a newer operating system and faster  --BUT ---Within 10 days the unit no longer functioned at all, not even diagnostic boot.  I will probably just trash it or crack it open to see the poor assembly quality out of curiosity.  Many of these are assembled with masking tape inside.  That's 2 that are bad.  The 2nd one worse than the 1st.", "Title": "Completely unreliable, no quality control in production", "Date": "May 8, 2014"}, {"Author": "stl ranger", "ReviewID": "R82H4VQI899DT", "Overall": "5.0", "Content": "Good basic tablet  easy firmware updates, a good case is easy to com by real HD no slow brown no crashing yet", "Title": "not a problem yet", "Date": "March 18, 2014"}, {"Author": "Clint", "ReviewID": "RB3QLFDQUQTX0", "Overall": "5.0", "Content": "This tablet surprised me for the price. Seems to do all that the more expensive models will but at a price that won't scare you away!", "Title": "Surprising Value!", "Date": "December 30, 2013"}, {"Author": "Priscilla Stilwell \"Singer.voice teacher.musi...", "ReviewID": "R2URJXJF14YNPK", "Overall": "5.0", "Content": "I bought mine elsewhere. Paid less than $100 including tax & extended warranty. I'm still getting to know it, but for the price, it can't be beat. I'll be getting a memory card & have a case & keyboard on order. I'm thrilled.", "Title": "Amazing value!", "Date": "September 14, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00B0JJON4", "Features": null, "ImgURL": null, "Name": null}}