{"Reviews": [{"Author": "Brad", "ReviewID": "R3MJVXMA9PL44M", "Overall": "5.0", "Content": "First, I really love the tablet. I've spent hours and hours on in the past month. I'm on it every day for at least two hours.Here's the but ... for the things I use it for it isn't significantly better than the kindle fire hd that Best Buy sells for $125.  That's not saying I didn't get my money's worth with the HDX, it just shows what a great deal the cheaper model is.", "Title": "well worth every penny, but.....", "Date": "January 23, 2014"}, {"Author": "R. Allemann", "ReviewID": "R13RFVFJ44AQL8", "Overall": "5.0", "Content": "First of all, I am a long time Apple Fan. I own a Mac Desktop, an iPad and an iPhone. I like to use my phone strictly for phone-related uses--making calls, using the map while traveling---that sort of thing. It is just too small for watching movies, playing games and such. But I wanted a small 4G LTE tablet of some sort that was light and would easily slip inside my purse. I wanted one that I could take with me when I traveled out of town, made road trips with my hubby, or when I'm killing time waiting for my son at his music lessons. My iPad is full-size and connected to a keyboard case, so I didn't want to keep lugging that around. So, since I am an Amazon Prime member, and after much thought and research, I finally decided on the Kindle Fire HDX 7\".At first I was concerned that I might not like it. One thing I don't care for as an Apple user is how restricted their apps are and how geared they are toward all things Apple. I was afraid that I might be repeating myself by buying a Kindle---that this tablet might be locked up in all things Amazon with no access to Google apps, youTube, Gmail, Chrome, or other apps that might not be available in the Amazon app store. However, I've found that the Kindle Fire is not locked up after all. I learned that even though there are some really great apps in the Amazon store, not everything is there that I might like or want. Yet, it was very easy to install a third party app called 1MobileMarket, and with that I have been able to side-load apps that I can't find in the Amazon app store. One app I was abler to download for example is Chrome, which of course is a Google app. It works great! I was able to sign in on Chrome with my Google account and watch all the youTube playlists and favorites that I had accumulated in my Google youTube account. I was also able to earmark Google as my search engine of choice on the Silk browser. In the Kindle email app, I was able to incorporate both my Hotmail and my Gmail accounts, and it handles both of them seamlessly. While I'm on the subject of side loading, another app that you might want to download right off the bat is the free app ES File Explorer. It's a full-featured file and app manager which is similar to Finder on a Mac or Windows Explorer on a PC. It's been really valuable in helping me find and organize apps and games, etc. after I've side-loaded them to my kindle. I highly recommend this app before you get started with side loading.Now on to my music collection. I have a ton of songs that I've already placed in my iTunes account and I didn't want to have to buy them again in order to listen to them on my Kindle. So by using the (free) Amazon Cloud Player and the (free) Amazon Music Importer, I was able to upload all the music that I had put in my iTunes account to the Amazon Cloud. The next time I turned on my Kindle Fire HDX, then went to Music, there were all my songs right there for me to listen to and/or download to my Kindle. I then found a really great feature within the Music app. It is called x-ray. I found it by accidentally pressing it as I was listening to a Diana Krall song. While I was listening to the song, and when I pressed the x-ray icon, up on the screen came the lyrics to the song, following along with Ms. Krall as she sang (similar to karaoke words streaming on the screen). When the next song came on, the lyrics to that song came up on the screen. Cool! The sound is amazingly strong for such a small tablet! As is the video display. And speaking of videos, I have several instant videos that I've purchased on Amazon, and they display and sound beautifully on the Kindle Fire HDX! I also have several videos on my Mac computer, and by using the free app Android File Transfer which I had downloaded onto my Mac, I was able to connect my Kindle to my Mac with the USB cord, and simply upload those videos to the Kindle library storage.Day by day I'm learning more and more about my Kindle and how fun and easy it is to use. But on the second day after I had bought it, I ran into a problem while trying to get into the app store. I couldn't figure out how what to do, because I couldn't get the App store to open. I just kept getting a black screen. So I pulled down the Kindle menu from the top, found and pressed the Mayday feature and within a matter of seconds, a young man with headphones on popped up on the screen and asked in a friendly voice, \"Hello! How may I help you?\" I told him the problem, and then watched my screen in amazement as he opened the necessary screen, forced closed an app, and then got me into the app store. Within moments he fixed the problem right before my eyes. So impressive! (By the way, although you can see them, they can't see you---in case you're wondering)One problem that some have mentioned, is the blue/purple haze around the edges of the screen when one is reading an ebook on this Kindle. Yes, I guess it is there, now that I looked for it. But I really don't find it to be a distraction, because it is very slight. However, you have three different page color settings to choose from that might help if this really bothers you. You can choose to have your book pages be white with black letters, sepia pages with brownish-black lettering, or black pages with white letters. Since I prefer the black pages/white letters setting (as I mostly read at night), the faint purple haze around the edges of the book pages aren't an issue for me because it simply doesn't show at all under the black color. Speaking of the eBooks section, many (most?) of the books have a feature on them called Text to Speech. While reading a book, you simply tap on the Play icon, and the book becomes an audio book, and you can listen as the book is read to you while you go about doing other things.So to summarize, I am a long time faithful Apple user, but I have to say that I am really liking my new Kindle Fire HDX. Don't let the negative reviews keep you from trying this little amazing tablet out for yourself. For all the \"problems\" that I've seen mentioned here and there, there's none that are really an issue (in my humble opinion) as you get to know your Kindle Fire. I can honestly say that the more I learn about this little tablet and all the wonderful things it can do, the happier I am that I took the plunge and bought it!", "Title": "This Apple user loves the Kindle Fire HDX!", "Date": "April 25, 2014"}, {"Author": "asortafairytale", "ReviewID": "R3701V3BUK0UM0", "Overall": "5.0", "Content": "I bought this about a month ago and wanted to give myself some time to play around with it before writing this review.Let me just say, I'm really enjoying it. It's the first tablet I've ever owned, so I can't compare it to anything else, but I am really enjoying this little toy. I've downloaded and listened to a couple of audio books while driving to and from work. I'm addicted to a few game apps that are eating up WAY more time than they should, but that's what they're for, right? I also have the Weather Channel app that I check each morning before I get ready for work.One of my absolute favorite features is the quality of the screen. I have the Netflix and Hulu apps and the screen is so freaking amazing. So crisp and clear. Honestly, it's better than the screen on my laptop. I still use my laptop for laptopy things - creating Word and Excel documents, or going online if I need to have multiple browser windows or tabs open/do multiple things at once. But if I just want to sit and watch a video, I prefer this Kindle over my laptop.I've also read a couple of books on it. Not my favorite, to be honest. I'm not a huge fan of reading on a backlit screen. I have a Kindle Keyboard that I much prefer reading on. But this isn't too bad and I enjoy it more than I thought I would.I definitely recommend this Kindle and can't wait to continue using it for a long time.", "Title": "My new favorite toy", "Date": "April 11, 2014"}, {"Author": "HAMPOTIN", "ReviewID": "R1OXGXR7OWRSIY", "Overall": "1.0", "Content": "Let start by saying I am a Huge fan of Amazon and Kindle.i have the Kindle reader which is fantastic.but the Hdx7 was a shocking disappointment.I had to call Kindle on mayday every other day to reboot this unit to get it to work.after five days of this I sent it back,and as usual amazon was great with the return process. To bad the bugs on this were not worked out before it,s release.", "Title": "Disappointed with hdx7", "Date": "April 8, 2014"}, {"Author": "Wasana Sriprachya-anunt", "ReviewID": "R2MYNNGFI9MKTB", "Overall": "2.0", "Content": "I really liked it at first since the screen resolution made everything so clear, but then a few problem emerged. First, the wifi sometimes disconnects out of the blue and I would have to turn it off and on again. Second, my email account sometimes has a problem updating. When this happens with the HDX, it always works fine on my iphone. Third, having only the front camera, I thought that's fine since I was going to use it to skype video with my family, but the chat always have echoes. Again, I've never had this problem with my iphone or Mac. Now I really regret buying it. I should have just bought the iPad, even the older version of the iPad would be better than this new HDX.", "Title": "Regret buying it", "Date": "April 5, 2014"}, {"Author": "Nevermore", "ReviewID": "R1APEKWVER45J6", "Overall": "5.0", "Content": "*Note--Review addresses some common concerns*An ebook reader I thought...Something to read a few books, maybe watch a movie, possibly play a couple games on a bigger screen than my phone. Something that looked nice, didn't cost too much, and had some good reviews. I had no idea this sleek,little, black tablet would become one of my favorite electronic items in the house.I had used a relative's older Kindle HD off and on, so thought I had an idea about speed and what to expect.  Nope, wrong.  The new 2.2GHz Quad-core Snapdragon processor is blazing fast.  Tapping on an app, and it opening, is near instant, HD movies play seamlessly with stutter and pixelation being an extreme rarity. Web pages load quickly, and the touch-screen is responsive, yet not so sensitive you will accidentally open an app by brushing against it's icon.The button placement and size, to me, are ideal.  With the older Kindle, it was easy to think you are pressing volume, but would be pressing on/off.  Not to mention they were tiny. The power button and the volume buttons are on opposite sides on the HDX. Mine is in a case, and neither button has accidentally been depressed.If you are looking for a gorgeous screen with vivid detail and color, the Kindle HDX is impressive.  The 1920x1200 display handles HD content with ease, ebooks are crisp and clear; it really is stunning. Additionally, the black level rendering is superb for such a small unit. Brightness can be set manually or you can let the Kindle adjust it automatically based on lighting conditions.Located on the back are two speakers and there is also a mini-jack in case you want to use headphones.  For as thin as the HDX is, the sound quality is good.  While the speakers cannot compare to a Home Theater, they reproduce sound clearly and with little to no distortion, even at maximum volume.Battery life has been more than adequate for my needs, yet I have noticed that how long it lasts can vary depending on usage.  For example, I started off with the battery at 100% and streamed movies for four hours straight; it was at 70% at the end.  Conversely, I played a popular game on it for 30 minutes, and the battery went from 100% to 82%.  Every time I play it, I know to expect a 10% draw in about 15 minutes.  Also, any app that uses a lot of memory or constantly runs in the background can affect battery life.  A Memory Manager can help turn off apps in the background and prolong the battery.My normal usage consists of heavy email, medium amounts of web surfing, lots of reading, and a few hours of streaming, mirrored to the TV.  Adding it all together probably equals between 3-6 hours per day.  The lowest the level has been was 33%, and that was after using all day and forgetting to plug in at night, so it stayed in sleep mode until the next day.Below I will address some concerns that seem to be common:1.  Dropped or poor WiFi Signal-- I have had this happen only three times in three months of ownership.  Once, was due to the router needing to be \"flushed.\" The second time, I cleared the cache in the Kindle, and the third time I have no explanation, but a simple rebooting of the HDX fixed the issue.2. Blue glow around the edges-- If I had not read about this, I would never have noticed it.  The only time it is visible is on an all white background, such as an ebook.  However, to me it is very faint and neglible unless you are focusing solely on the edges.  It is due to the edge lighting using the blue LED's and using the auto-brightness or manual adjustments should minimize impact.3. Screen Flicker-- This does happen on occasion, yet only with certain memory and color-intensive apps.  Every time it has self-corrected within a short period, and have never experienced it when streaming a video or movie.4. Ads-- I did not pay extra for no ads, but do not see them as a problem.  They only appear on the lock screen and do not interfere with performance.  Additionally, you can view them all on one page and sometimes a special buy will show.  If you absolutely do not want ads, the payable option exists.5. Laggy/Slow performance-- As with any computer device, the cache can become full and should be cleaned regularly.  Anytime my Kindle HDX seemed slow, a simple cleaning remedied the issue.  One note--certain apps can affect performance and I recommend checking after installing various apps to see if they hinder the device. The cleaner I use is Clean Master and it also acts as a memory manager.6. No Google Play--It is true that you cannot download from Google Play, however, there are other reputable android sites that you can use.  Youtube and the Web have plenty of resources to help.  You will need a File Manager, which can be obtained in the Kindle Store for free.  I use File Manager Free along with 1MobileMarket for any android apps not available in the Kindle Store yet.7. No Youtube-- I use Youtube all of the time on my HDX, whether through Silk or through the app on my Bluray Player.Some other Features and Benefits:1. I have three email accounts synced with my Kindle HDX.  It makes it very easy and convenient to turn it on and have instant access to all of them at once.2. For me, it is preferable to not use the carousel.  I appreciate that I can just swipe upwards and have all the apps I put on my home page arranged cleanly just like desktop icons.  Additionally, by holding an app and dragging it to another you can create \"folders\" to customize the appearance.  For example, have all your games in one  folder icon, all of your productivity apps in another, and so on.3. My Kindle HDX can control two cable boxes, my bluray player, my AV Receiver, act as an independent cable box, stream movies with Amazon Prime and Cable On-Demand.  Once the Home Theater is on, all I need is the Kindle to control all of it.4. Using the Netgear PTV3000, an app, and the Kindle HDX has eliminated the need for me to have a cable box for each TV.5. As time goes on, I keep finding more uses for the HDX.  It is amazing how much this small tablet can do at a fraction of the cost of others.6. It is an incredible e-book reader and library.  I love how convenient it is to have so many books in one place and be able to take them wherever I go.The Kindle HDX has become the most-used computer in the house. It does everything I initially wanted and much more and is still working great after three months. If you are looking for an incredible value in a tablet, then I definitely recommend it.  Currently, it is my favorite purchase from Amazon.", "Title": "Much more than a simple e-book reader...I love it!", "Date": "March 3, 2014"}, {"Author": "Lee Harpster", "ReviewID": "R2BCLDIHWR86CK", "Overall": "5.0", "Content": "Got the new Kindle Fire HDX 7\" as a Christmas gift and I love it! WAY better than any other tablet I've tried recently. I had a situation with my speaker, so I used the MAYDAY. TIM (it's too bad I don't know his last name) went above and beyond to help me. I told him that I couldn't hear him, so he started writing messages to me on paper then holding them up in front of the camera for me to read! He wrote to me that I should simply do a restart of the Kindle. I did and the sound issue was resolved! I asked him if he had ever helped anyone else this way; he wrote that \"We were making history!\" LOL. So my review for the Kindle HDX and MAYDAY is  2 thumbs up all the way!", "Title": "Awesome display and sound. MAYDAY is fantastic!", "Date": "December 26, 2013"}, {"Author": "Bradley Powers", "ReviewID": "R693368RSSA99", "Overall": "5.0", "Content": "First time ever writing a review on Amazon.  The Kindle Fire HDX is a giant leap forward for the Kindle.  I have had both the original Fire and the Fire HD.  Both of those were ok, but no where near an iPad in my opinion.  But with the Kindle Fire HDX Amazon has not only caught the iPad but passed it.  The screen is amazing, the HDX is so much faster and Silk is amazingly quick.  A low price and great value for a snappy, elegant tablet.", "Title": "Love my Kindle Fire HDX", "Date": "November 24, 2013"}, {"Author": "Joyce B", "ReviewID": "R345AWQ33VPB3A", "Overall": "5.0", "Content": "This is my first Kindle and I am very happy with it.  I have looked at them for a long time and wanted one when the first `Fire' came out but just kept putting it off.  When I finally decided to take the plunge and get one I had heard there was a new updated one about to be released and waited for the newest version.I've had it now for a week. It's a great little tablet at a great price. It is slim, light weight and looks great!  The screen is beautiful, great picture quality and the processor is very fast.  Mine was almost fully charged when I received it, so I basically just had to pull it out of the box turn it on and `GO'.  It was already registered through Amazon. It seemed to do a quick little update and all was set.  Plus it is great it came with a quick charger adaptor, as it seemed all the previous versions never did.At the moment I mainly will use it for reading books, playing some games and occasional internet use. I like all the other options of things you can do with it, even if I don't think I need it at the moment.  At this point I am not sure if I will use it for streaming movies as it sounds many like to do. It's nice to have the option to do it. Maybe in time I will look at doing that and give up most of the movie channels I pay for on my cable tv.Some are complaining about a purple haze border around edge of screen.  I can see that now, but to be honest, I had to go looking for it after I read it in the reviews.  It is not very noticeable to me.  I just don't see it as a big deal and  I wouldn't consider this such a major flaw to give it a negative review or send it back.  It is a faint, and I mean faint, haze.  I guess my opinion is it is not a deal breaker for me.  Everyone has different expectations for things.For me this was a five star purchase at this price point.", "Title": "Very Happy& Impressed With It - For the price you can't go wrong", "Date": "October 19, 2013"}, {"Author": "Oz resident", "ReviewID": "R3V29DUV7V5SX0", "Overall": "5.0", "Content": "I'm going through chemotherapy, so I bought this to give me something to do while sitting for hours receiving my poison, waiting for appointments, or vegging in the hospital. I've only had it for about three weeks, but so far, it has preformed well. My only complaint is the Silk browser that comes with it does not support flash. I installed the Dolphin browser, and all is well. Very pleased.", "Title": "My chemo companion.", "Date": "December 3, 2013"}, {"Author": "Tech Junkie", "ReviewID": "R9KVCGO291Y9K", "Overall": "3.0", "Content": "Great Tablet but REALLY needs Google Store, better quality control, and some better design choices. Will be returning the tablet to try the Nexus 7 or just go and buy a Mini 2/Air.I'll keep it short and easy to read and list the pros and cons as bullet points (I was hesitating between a 2 or 3 but I think Amazon is on the right track so 3 stars):Pros:1- Very clear and beautiful 1920X1200 resolution screen (A bit higher resolution than 1080p which is 1920X1080). Even better than your HDTV since it's this high of resolution on a smaller size (higher PPI)2- Excellent speaker volume and location. Doesn't get blocked when using the hdx in landscape mode (the iPad and Nexus 7 have the speaker placement issue)3- Mayday is actually very useful for someone that isn't tech savy. I was able to get connected every time I tested it within 10-15seconds. I would assume the wait will be longer during holiday season.Cons:1- The first and biggest issue for this and any tablet is APP selection. This one is missing many of the latest and greatest apps that are on the Apple App store and Google Play (including Time Warner App, some banking apps, big mobile games)etc...The Amazon app store is currently estimated at 75000 apps while both the Apple and Google App stores are each over 1 million apps and have many dedicated specifically to the tablet (specially the Apple App Store)2- Buttons placement of On/Off button and volume Up/Down are horrible and size is way too small for my normal sized hands.3- Although it is smoother than the last Samsung Tab 2 I've used, the interface still feels a bit clunky at times. It's not butter smooth like the IOS on the iPad (believe me, even my iPad 1 was smoother than this)4- Apps crashed too frequently, even when going in the prebuilt Shopping and App store apps5- Needs better quality control. I understand this is probably the first batch of the tablets and usually every first few batch of a gadget have some issues but I really think better quality control would alleviate most if not all issues. My HDX has some screen flashing as if the backlight is getting adjusted up and down consistently. Also, I have a dead pixel that is quite noticeable in the middle right side of the screen.", "Title": "Honest Review from a Tech Junkie", "Date": "November 13, 2013"}, {"Author": "Bob", "ReviewID": "R3CZU05PRY4IVY", "Overall": "5.0", "Content": "I upgraded from the Kindle reader 2nd generation to the HDX 7 - I truly enjoyed and used my kindle reader.  However, after spending about ten minutes with the HDX 7 I knew I made the right choice.  I'm a senior citizen who loves electronics and love the world of electronics.  For the seniors that sometime shy away from electronics this is for you.  You will find in just a few minutes you will be able to use all the functions of the HDX 7 with ease.  I do suggest a stylus, case and screen protector (in my other reviews).  I had to use the MAYDAY feature - I didn't need it I just wanted to try it - what a great feature and simple to use.  To me this is a item I will use everyday.  Also a piece of information you can run the battery to 0 with perfect play before it stops.  I believe whichever size you buy you will enjoy!", "Title": "An electronic product for all ages", "Date": "December 24, 2013"}, {"Author": "Michael J", "ReviewID": "R27LQAULABFS9T", "Overall": "5.0", "Content": "I've bought a number of tablets over the years. My first was a Samsung Galaxy 7.5. Although it's old tech now, one thing I love about Samsung products is they LAST. My next was an iPad 2 and then a Microsoft Surface Pro. This Kindle Fire HDX is the first kindle I've owned personally, although I've gotten to borrow Kindles from others (originals and Paperwhite). This is, to date, the BEST tablet I've ever used. It's fast, responsive and never seems to drop the connection. I haven't gotten to use a 3G feature yet, but this tablet finds a WiFi connection where my Surface Pro, other tablets and even my powerful laptops can't get it.It's got great apps, the screen is stunning (looks better than the last iPad Air or Surface Pro 2), and its drop test rating is one of the better ones. Plus, I understand that Amazon is now offering an interest-free payment plan for the HDX. I'm very happy to have made this purchase and if Amazon continues to build tablets like these I fully believe they are going to leave all of their competitors behind.", "Title": "I.Love.This.", "Date": "December 21, 2013"}, {"Author": "booklvr70", "ReviewID": "R3SI8KLUJ9OPQU", "Overall": "5.0", "Content": "My new Kindle Fire HDX arrived today exactly as promised.  After reading so many unsatisfied reviews, I was quite skeptical about its operation.  Well, was I ever surprised!  The Kindle arrived perfectly boxed and in great condition.  Set-up was as easy as pie; no trouble connecting to wifi; in fact, no trouble at all.  I am a 71-year old great grandmother who has absolutely NO experience with a Kindle.  So, if I can do it, so can you.  I am a voracious reader and was anxious to see the \"blue haze\" so many people talked about.  Personally, I cannot understand the complaints.  Yes, there is a very faint blue border, but not enough to bother mentioning (to me).  I am absolutely astounded at what this device is capable of.  I spent several hours experimenting and I realize there will be a learning curve, but I'm having fun with it.  I've used a Nook for the last two years and have slowly grown discontented with its performance.  When placed side-by-side, the Kindle wins in weight, brightness, speed and features.  I look forward to many happy hours with my new \"playmate.\"  Did I mention how great the colors are and how vivid the videos?  My recommendation is to buy this Kindle and examine it for yourself; I have absolutely no regrets!  Enjoy!", "Title": "Greatest invention since the napkin!", "Date": "November 1, 2013"}, {"Author": "Andy Lee", "ReviewID": "R17O5JLQM0B7Z4", "Overall": "4.0", "Content": "Let me just start by saying this is the first tablet I ever owned; however, I am very familiar with its hardware components enough to say that this is a very powerful tablet. I've used others in the past, and I never could get past how slow they operate; however, Kindle Fire HDX is an exception. While I'm not familiar with other operating systems, I will say that Fire OS is very smooth. I will admit there were some bugs while working the device. For instance, I have run into a few occasions where it has crashed and restarted. I have also run into situations where I've had to reinstall apps for them to work properly again. In time, I'm sure they'll fix these issues with updates.With respect to the apps that are available for this tablet, you'll might be disappointed. I'm more of a gamer, so going onto Amazon to find out that some of the apps I wanted aren't available to the Kindle yet. This is rather unfortunate, considering a number of these apps have been out for quite some time already. Basically, Amazon doesn't have the same broad selection you would typically find in the Apple Appstore or Google Play. Though it might be common knowledge, apps from the Appstore or Google Play aren't compatible with the Kindle. On the plus side, Amazon does release a free app each day, so that makes developing your collection easier.I've also tested some of the new features that came with the Fire OS 3.1 upgrade, including second screen and Miracast. Second screen allows you to take movies and TV shows from Amazon, and lets you play your selection wirelessly on a nearby television, assuming you have either a Playstation 3 or 2013 Samsung TVs connected. Bear in mind that second screen is only available to amazon content, nothing from netflix, hulu, or any other online streaming services. Ironically, TV Sideview (Sony's app that allows you to control Sony devices from your tablet, including the PS3) isn't compatible w/ the Kindle either. As a result, you'll have to navigate your system on both your controller and the Kindle, at least until, and this is assuming, TV Sideview becomes available for the Kindle.Miracast is a much better version of Second Screen, as this allows you to wirelessly display what you're doing on your kindle onto a nearby television or media streaming device, as long as it is Miracast compatible and compatible with your Kindle. For those of you who have familiarized yourself with Chromecast, just a heads up: it's not compatible with the Kindle. I ended up using the NETGEAR Push2TV Wireless Display HDMI Adapter - Miracast and WiDi (PTV3000) (link provided below) to test Miracast, and I have to say that if you want to use your Kindle to stream content onto your TV, this is the way to go. It displays in HD, the sound quality is superb, and anything you do on your kindle can be placed on your TV. **Gamers, if you're expecting to play games in this fashion, bear in mind that there is likely going to be lag time between the commands you input into the tablet and the miracast compatible device. This doesn't affect anything other than games, however, as the sound and video output on your TV will be synchronized during use. Thus, if you want responsive controls, I don't recommend miracast for gamers.There was one more update that came with Fire OS 3.1, and that is Goodreads. Unfortunately, I'm not too familiar with it. All I know is that it's an amazon app that allows you to share what you've read, provide recommendations, and look at what your friends and other people are reading. Readers, you'll probably find this resourceful. I know some of my friends love it.Overall, the Kindle has the power and graphics to provide you with a great quality experience; however, the selection of apps do pale in comparison to other devices. While it's not perfect, it still provides the same functions you would find in other tablets (some of which are better). If you have to have all of the latest apps, especially the ones that accompany big games, such as GTA V and Injustice (Which has been added since I 1st wrote this review. Still took them most of this year though.), you'll surely be disappointed.Helpful tip for closing apps on your Kindle Fire HDX:Some of you might not know how to close apps on your Kindle, and a number of pages on the web recommends force stopping apps to close them; however, that could damage the data. Assuming an app doesn't have an option to exit the app, just use the back button on the main screen of the app. If the app doesn't allow you to exit that way, then the developers never developed an exit button for their app. Then you'll have to force stop it to keep it from running in the background and avoid eating up some of that precious CPU usage. Hope that was helpful! It might've been common knowledge, but I would not know, as this is my 1st tablet ever, as mentioned previously.To use miracast for your Kindle Fire HDX and television, I recommend:NETGEAR Push2TV Wireless Display HDMI Adapter - Miracast and WiDi (PTV3000)B00904JILO", "Title": "Kindle Fire HDX 7\" and Fire OS 3.1 review", "Date": "November 27, 2013"}, {"Author": "Patriot1", "ReviewID": "R3MLJ9YWG0SFQP", "Overall": "3.0", "Content": "I upgraded to the HDX for three reasons.  Better battery life, better screen resolution, and the ability to download prime videos.  I spend a lot of time in places where I cannot get phone or wifi signals.  Having the download option was really exciting.  I am very disappointed however.  Amazon has decided that feature only applies to old outdated movies, and NOT to all Prime movies.  Anything popular or created in the last ten years is NOT included.  If this option is one of your deciding factors, then don't.  The price really doesn't warrant upgrading from the Regular HD model which is a $100 cheaper.", "Title": "Prime video download a joke", "Date": "October 19, 2013"}, {"Author": "JenM", "ReviewID": "R32MEWDA90T5PD", "Overall": "5.0", "Content": "I preordered my Kindle Fire HDX and have been looking forward to receiving it. Over the weekend I started reading reviews and was dreading what I would see when I went to read a book.  I planned on using this as my main reader.  Well I received it yesterday and to my delight realized that the haze that has been discussed is not something that bothers me.  I honestly do not think I would have really noticed it had I not read about it.  The reading experience for me has been a crisp clear page with a wonderful backlit display.  No more book lights at night!  This replaces my Kindle keyboard.I am very pleased with my purchase and would recommend it to friends and family.", "Title": "No issues with blue/purple haze", "Date": "October 22, 2013"}, {"Author": "K. Kurtz \"weary traveler\"", "ReviewID": "R38HOGAQ77HMAK", "Overall": "2.0", "Content": "My 2012 purchase of the Fire HD was one of my smartest purchases: as an e-reader, it excelled, and I'm a voracious reader. I had qualms about trading it in to purchase the new Fire HDX 7, but wanted the extended battery life offered.The HDX is beautiful, fast, and functions beyond expectations in all features, except, as an e-reader. I am very disappointed and am in conversation with tech support. First, the good: brilliant color, speed, much improved speakers, and the button placement is ideal for on/off and volume. \"Mr. Hyde\" appears in the reading, at least on my device, in a slowly-advancing glowing blue border! I know- the notice has gone out that this is \"normal\" and part of the advancement in true color display, but my device border is irregular, blotchy, and prevents any enjoyment of reading despite adjustments of brightness, font, etc.Amazon customer support is stellar, but I've had some difficulty conveying the fact that this display is unacceptable. Past experience with support has been very positive, so I won't let Jekyl and Hyde dissuade me.More to come....**10/30/13 Kindle support consented to sending a replacement. This second HDX does not have the unevenly lit border, but is \"shadowy\" even with the sepia background, which I find easier on the eyes. The HDX doesn't come close to the reading experience of the Fire HD that I traded in, but I'll live with this because any other e-readers I've tested have backlit displays that are far worse!I would advise you keep your Fire HDs if you enjoy reading. So, \"Happy Halloween, Mr. Hyde!\"***02/06/14 A major drawback has emerged: rebooting before connecting to wi-fi. Check the forum for this because scores of owners are waiting for a fix for this. The biggest disappointment has been the conflicting answers from Mayday and specialists for the fix. I am very persistent and have been issued several replacements- this latest delivered with the promise I would not have any problems. Unfortunately, it has not resolved.If Amazon would clarify whether this bug exists in software or hardware, many customers would be happy enough to await the fix!", "Title": "Rebooting bug!", "Date": "October 26, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3LDMG8IYZPJTK", "Overall": "5.0", "Content": "I've bounced around from tablet too tablet trying to find the best one. My first tablet was an iPad 1st gen. I liked it, but it was too restrictive & locked down. Since then I've owned the following: Google Nexus 7 (original), Amazon Kindle Fire (original), Samsung Galaxy Tab 2 7\", Motorola Xoom (original), HP TouchPad (WebOS fire sale), PanDigital Novel 7, few generic Chinese eBay (all of which sucked BTW), Barnes & Nobel Nook HD+ (still have, gave it to my mom when I ordered the HDX) & now the just released Amazon Kindle Fire HDX 7\" 32GB.Honestly I didn't know what too expect with the HDX, all the specs were awesome & it's kicking serious butt against the Nexus 7 (2013) in various benchmarks, but I was still kinda nervous. I knew the HDX would be high-quality & well made, Amazon doesn't put out anything, but well made devices.It arrived yesterday, it's a lot smaller than I thought it was going to be, but the difference is the HDX doesn't have all the wasted space usually found in the bezel areas of most tablets, it's minimalistic in design. Very much a welcomed change!By reducing the wasted bezel space, Amazon has not only made the tablet lighter, it's very easy to hold in one hand.The true full 1080p HD display has blown me away!!! I have never seen such clarity, vivid full spectrum extremely accurate color reproduction, flawless crisp clean & incredibly smooth video. Honestly, no matter what I say, this is one of those things you have too see to fully appreciate. There is no blurry, pixelated motion distortion you find in some HD TV's.Combined with true Dolby sound, which somehow manages too reproduce a very life like surround sound experience. I haven't figured out how the HDX pulls this off, but the sound is phenomenal.You definitely notice the quad-core Snapdragon 800 processor under the hood, as this thing flies!Amazon's re-built from the ground up newly minted Fire OS 3.0, is a work of art. It's fast, very user friendly, gorgeous graphics & integrates very smoothly with the content available from Amazon Prime. You can easily find anything & everything you may be looking for.Amazon's app store is rapidly catching up to Google Play & I have been able to find all the apps I use from the Google Play store.The integrated apps, such as e-mail, calendar etc. was surprisingly easy to setup with my Gmail & Google Calendar.Amazon has most definitely hit a massive homerun with the HDX line. Apple & Google have serious competition this time around.Don't second guess yourself if you are considering the HDX, it's an absolute no regret purchase. You will absolutely love the HDX. And YES, the HDX really does have the best & highest quality HD display currently available.After seeing what the Snapdragon 800 CPU & Adreno 330 GPU are capable of, I now see why Google is using both in the upcoming Nexus 5. I will definitely be buying one of those as soon as it's released as well!Awesome job Amazon!!!", "Title": "Unbelievably beautiful HD, very fast, immersive & extremely high quality audio!!!", "Date": "October 19, 2013"}, {"Author": "pixels rose \"Pixels Rose\"", "ReviewID": "RHBEFB4HNQYTB", "Overall": "1.0", "Content": "I bought this for my 7 year old and it worked fine at first but now it keeps freezing up and we can't turn it off or anything it just freezes on whatever she was doing playing the music on and on can't even power it down until the battery dies wouldn't recommend this product.", "Title": "Disappointing", "Date": "February 11, 2014"}, {"Author": "Larry Sassaman", "ReviewID": "R2I5UIE6Y91PM2", "Overall": "2.0", "Content": "I purchased the HDX in early Dec. 2013 and until last week was very pleased with the Kindle's performance. Last week my HDX began shutting down and restarting for no reason and has continued to do so through the present. I've spoken to 3 different technical representatives about the problem and they have no solution to my dilemma in almost a week. All they can tell me is they're working on the problem. I've checked online forums and other people are reporting the same problem so this is not something which is unique to my Kindle. I expected a better response from Amazon. Update: It's now 2 weeks since I notified Amazon of the problem with my Kindle Fire HDX and they still have not offered any solution to the problem. When I called them 5 days ago for an update all they could tell me was that they were still studying the problem. Maybe they need an SOS button instead of just Mayday. Get with it Amazon !!!!!", "Title": "Dissapointing technical support", "Date": "May 7, 2014"}, {"Author": "John Pattenger", "ReviewID": "R2Z8M658DOZGNT", "Overall": "1.0", "Content": "Second kindle HD ... first one didn't work properly...Now this one is messed up. Shuts itself down while I'm reading and reboots itself. Almost impossible to read in sunlight. You would think they would combine the best of previous kindles.", "Title": "More trouble!!!!", "Date": "April 7, 2014"}, {"Author": "kt \"k\"", "ReviewID": "RGVRBVQMVP53S", "Overall": "3.0", "Content": "I already have a Kindle Fire and bought the Fire HDX because it has a camera and allows me to skype (which the original Fire does not).  I love Kindle, however the HDX runs down the battery sooooo fast.  I went into the settings and had to look through many areas to find what was draining the battery. (It even drained when off completely).  I turned off a few settings and now the drain is slower.  However, this HDX is also much slower in downloading books, etc.  My original Fire can download a book in seconds, whereas this one takes many many minutes.  I'm not sure why.  I have to say if I only had one Kindle I would keep my original Fire and skip the HDX.  I don't see many advantages to it other than the camera and definitely many disadvantages.  I gave it a 3 star rating simply because the Kindle is a great thing to have, but I would give the original Fire a 5.", "Title": "Not as good as original Kindle Fire", "Date": "March 30, 2014"}, {"Author": "NV Blonde Shopper", "ReviewID": "R3VJLZ5HE3RFMB", "Overall": "4.0", "Content": "This is a replacement for the original Kindle Fire.  It is a little wider that the original and does not fit in my small hand as well as the old one.  The physical volume control buttons are better than the original on screen volume controls.  The slanted back cover is a little hard to get used to.  I really loved my original Kindle Fire and this is not so much better or different that I would not have spent the money to get a new one if the other had not died after only 2 years and I just spent $79 to get the Prime subscription.  I just don't see that much difference in the screen quality or battery life.  If I had not had the original Kindle Fire perhaps I would be more impressed with the HDX. If this is your first Kindle Fire I am sure you will be pleased.  I purchased a case that has a cover with an automatic sleep and on feature when the cover is closed and opened and I like that. However, it does not charge when the cover is closed for some reason which is kind of annoying.", "Title": "Good replacement for original Kindle Fire", "Date": "March 29, 2014"}, {"Author": "wizardshat", "ReviewID": "RNQ1ZTVXWTCO9", "Overall": "5.0", "Content": "A great tablet. Awesome resolution! Sound is accurate and loud. This little thing is FAST!!!!! I got my girlfriend a Kindle HD for XMAS and wanted to try the next level up. I will be getting her one of these for this XMAS and giving the regular one to our daughter.**Update**I have the Fire TV and the game controller for it. I haven't yet tried, but they say the game controller can connect to this too. SWEET! But, I have sent video back and forth between the HDX and the Fire TV. That is a great feature. Instead of pausing the television when I head to the kitchen for a snack, I can send it to the HDX where it picks up seamlessly. Then I carry the tablet to the kitchen and get what I want and then head back to the living room and send the video back to the Fire TV. I know this may sound lazy, but this is truly a cool feature. Combine this with being able to download some videos to the tablet to watch offline and this has to be the best set up available. I admit that I am an Amazon superfan. They have really done their research and made quality products. I highly reccomend all of them.", "Title": "A VERY nice choice in the 7\" market. Better than my Samsung.", "Date": "March 27, 2014"}, {"Author": "Loves to Read", "ReviewID": "R31D1Q4XD5CJR3", "Overall": "4.0", "Content": "This is a great tablet. It has alot of the capabilities of some of the other like iPad or the Samsung Galaxy. I'm able to watch movies- the color is amazing, I can surf, and get free e books from Amazon. The only downside is that either I can't personalize my homepage or I haven't figured out how yet. Easy to use. Great product for the price.", "Title": "great tablet", "Date": "February 23, 2014"}, {"Author": "Brady Baker", "ReviewID": "R24M9R6I59FWHJ", "Overall": "1.0", "Content": "I was very disappointed in the fact that I purchased a kindle fire hdx for my newly retired mother to enjoy and it broke  while she was on vacation in florida. It was a Christmas  present .She called amazon and they tried to fix the issue and wasnt able so a new one was sent. She was told a new one would be sent along with a return shipping label. Well no label was sent so I had to find a friend with a printer, which was not easy. My only concern is sending the bad one back after so long. Thx for your concern.", "Title": "disappointed", "Date": "January 29, 2014"}, {"Author": "Pamela Janus", "ReviewID": "RBIMWEDHXN2CT", "Overall": "1.0", "Content": "So sorry, but my KindleFire lasted long enough to get two books and a CD and then just stopped working. I am having it sent back to you.It's a shame because I was so excited with my son's Christmas present to me.Regards,Pamela Janus", "Title": "KindleFire", "Date": "January 29, 2014"}, {"Author": "debbie bakker", "ReviewID": "R2ORHGI1SN95WT", "Overall": "1.0", "Content": "My kindle just died. I bought it for a Christmas gift for myself and it won't turn on any more.", "Title": "distraught", "Date": "January 28, 2014"}, {"Author": "M. A. Love \"malove\"", "ReviewID": "R2RLBZH17L89TZ", "Overall": "5.0", "Content": "I bought this just a few weeks ago and LOVE it.  I had an Ipad that I got rid of because it drove me nuts.  Here's my comparison between the two:1.  It took me all of about 5 minutes to set the Kindle up, where as the Ipad too me much longer because I had to set up passwords, etc.  The Kindle connects directly to the Kindle account.2.  It's simple to download an app.  No passwords required.  The Ipad requires an Apple PW EVERY time you want to download an app, and you have to make sure you remember it EXACTLY, because if you don't, the system won't let you in, and there's no way to store your password so it will fill in automatically.  That's the major problem I had with it.3.  It has a faster processor than the Ipad.  Some apps on the Ipad took several minutes to download and the Kindle takes just seconds.4.  The screen is much brighter, and it responds better to my finger.  With the Ipad, I had to use a stylus.That's just a few of the things I like better on the Kindle.  I also won't need my Kindle reader anymore, and with the Fire, I'll have color with my books, at least on the covers.  I haven't tried downloading videos yet, but I will in the future.In short, I should have bought the Kindle instead of the Ipad.  It's a much better tablet for me.", "Title": "Beats the Ipad hands down!", "Date": "January 1, 2014"}, {"Author": "Dennis", "ReviewID": "RT93B6JCRZ9O", "Overall": "1.0", "Content": "I have had this for about a month and it doesn't hold the WI-fi signal. it shows as connected to the internet, but it drops out every few minutes. This problem evidently exists in about 5-10% of the units produced according to the forum amazon has about this specific problem. I routinely check the forums for a fix, but none have been provided, not even by amazon. I am slow to return the unit because I would actually love to use it and \"sources\" close to the problem were convinced that a patch would be available by Christmas time. Now, I am giving it another few weeks before my return deadline has expired, before I return it completely and move on to an Ipad or Surface. I have read that bigger screen units and regular Kindle Fire units don't have this problem, but I wouldn't consider staying with Kindle solely based on this bad experience. In the meantime some people, including amazon support, seem content with having to do a laundry list of homemade remedies in order to trick your kindle into working for 5 minutes. Its like having a luxury cadillac with a hole in the gas tank, pretty...but useless. I would prefer that something I paid that much money for just worked on its own. I guess im just old fashion that way.", "Title": "\"wi-fi only\" doesnt hold a wi-fi signal...pretty annoying.", "Date": "January 4, 2014"}, {"Author": "M. Cordoba \"mxc\"", "ReviewID": "R3M0JZDWPQSSDE", "Overall": "2.0", "Content": "I really wanted to like the kindle. It has a great price, awesome screen, and with an advertised 11 hour battery life (up to 17 hour if just reading according to Amazon) I figured this device was the perfect companion.After a few weeks of testing and timing, I can confidently say that for the vast majority of user scenarios, the battery life is significantly worse. In fact, I have no idea how exactly Amazon came up with the 11 hour number.But lets start with the basics pros:- Screen is really nice (yes there is some slight blue light bleed around the edges, but Amazon has a complete explanation of why that is - and it's used to have the great color accuracy/gamut that the display has). Honestly, it was very little to bother me at all, and welcome the increase color gamut. The screen is superb.- Kindle Free Time: this is absolutely great. I can let my daughter play with the kindle with some serious restrictions. (what apps can be accessed, how long she can play, read or watch videos (3 distinct timers). She can't do purchases or anything else. I can't believe nobody had done something like this before. It's really amazing.Cons- Neutered android means that a lot of very popular android apps are not available, and you have to resort to side loading them, and not all work that well. I really wish they allowed a larger percentage of the Google Play store apps (all preferred)- thick border around the edges, where the display could be extended to be even more usable without increasing the size of the device. It's around a 1.5 inch diagonal of wasted space. The iPad min in contrast his just a 1/4 of an inch or so.- And the worst offender which causes this to be a 2 star product instead of 4 stars, is the misrepresented battery life. Partner has an iPad2, (10 hour claim) and it generally lives to those expectations, lasts all day off the plug, great.The Real Battery Life of the HDX which claims to be 11 hours (up to 17 reading!!) is closer to 5 hours.Here are the tests I did during the last 3 weeks:The first day, I downloaded several apps and got it setup, read some books to my daughter, and watched a movie. I used the mayday button to ask about sorting apps by age of your child (can't be done as of now). It couldn't have been more than 4 hours, and the device was already at 10% charge (down from a full 100% charge) so I was really disappointed, and started doing a series of tests:Things to note:* Wifi only model (3g would suck the battery even more)* brightness was set to 50%.* I'm a huge fan of Amazon, and this is the first Amazon product that has really let me down with their claims. I owned a kindle keyboard, and now a paperwhite 2 - both of which I love. Customer service has always been second to none. Basically, there is no reason for me to \"bash\" this product. I am a tech person, and I am aware battery life varies quite a bit by usage, but this is a serious issue not just a small variation. Amazon failed to deliver big time on their battery life promise.Test 1:* 3 hours of mostly reading (kids books, so they had colors and things, my daughter flipping through the pages)* 1 hour of videos (she was unfortunately drawn to Barney)* Half hour of games (some simple puzzle games, nothing 3D intensive or anything requiring full use of the graphic processor)* Battery was down to 20% and I started surfing the web and others until it ran down in 1.75 hours.So basically, during a reading heavy session (17 hour amazon claim), the device failed to last 6 hours.Test 2:- Charged it overnight, let my daughter do whatever she wanted with it (using the awesome Kindle Free Time). She mostly watched videos and flipped through some books. She also opened a game or two (Again simple puzzle games, no 3D battery intensive games). She had breakfast in between and then lunch. And then brought the device to me because the battery was dead. The device lasted just over 4 hours...In contrast the iPad, where she likes to play with 3D puzzles and several other 3D apps (Mr Potato), she plays with it several days before it ever runs down.  I can confidently say that playing with apps, the iPad lasts at least twice as long as the kindle fire.Test 3:- Sporadic use throughout he day. I figure I'd try a really subtle scenario.- Light web browsing (not more than 30 minutes)- Some videos (1.5 hours)- occasional book (only 5 minute spans, or flipping through pictures)- The device was on the sleep state most of the time.- Battery life was at 30% that night. So 70% of the battery was lost during some 3 maybe 4 hours of use.I will do a strictly video test and post it later.But nothing I have seen indicates that any normal usage will get you anywhere near the 11 hour claim.", "Title": "Terrible Battery Life (5 hours or so)", "Date": "December 11, 2013"}, {"Author": "P. Minners", "ReviewID": "R29VH5QCW9XU03", "Overall": "5.0", "Content": "I have owned an original Kindle for sometime now and I bought the Kindle Fire for my mom.  My original kindle is nice and light while the Fire was very heavy. I have wanted an IPad but the price was out of my range so I decided to invest in the new Kindle Fire HDX.  Well I'm pleased to say that I absolutely love it.  All my books uploaded from the Cloud, and I was able to upload all my pictures and music from my IPhone as well.  I love the fact that I can have an Office Suite to type letters and presentations.  The IPad does not have that capability, I believe.  It's lighter than the original Fire; however reading in sunlight is still a problem with all tablets. I have my original Kindle synced up so I can just take that outside with me.  There are some apps on my IPhone; such as an Optimum app or the Watch ABC app, that I would like on the Kindle, but I understand they are working on that.", "Title": "Love It", "Date": "October 28, 2013"}, {"Author": "Mieko*", "ReviewID": "R2DBQB7W1CKHHJ", "Overall": "5.0", "Content": "I can give you a 3 letter word for this Kindle HDX 7\" 32 gb tablet!!!!WOW !!!I have a basic Kindle for reading outside..don't need that anymore.I have a Kindle Fire First Gen.  I love it so much, and will keep it so my husband (who has his own KF and account) can read my books as well as his.My new (shiny shiny) KF HDX 7\" 32 GB came today..earlier than they had estimated.  Thank you Amazon!The UPS man put it between my screen & front doors for safety.  Thank you UPS.I won't say I put it through tests...but I thank those who did and posted their reviews.I set it up...well that took 10 minutes.  It is so intuitive!  No problem getting on my WiFi.  Took me a few moments to find all the settings but I learn as I go.All my books were there (well I didn't count all 1200 lol).  I keep most in the cloud and there they were.  All my games & apps were there and to my delight, my Words with Friends hooked up to my account and my current game with my daughter in law was there!  I hadn't expected that.In fact, in regard to the pale blue/purple line around the outside of the screen..I like it!!  It looks so nice surrounding the book content. I was looking for it so I did notice it, but it sure is not ugly or a deterrent to reading.I haven't had time to read in the sunshine yet, but even if I freeze my bottom off...I will tomorrow!!!**Note: Though I cannot read in bright sunlight (wouldn't anyway)I can sit on my front porch or my patio and read just fine. I will try it in the car next.I set up my HBOtoGo, Netflix and other movie apps in moments.  You just click on all of them and they download in the order that you chose them.I couldn't even take a nap today..I was so excited and happy.One of my favorite things ever has been my first gen. Kindle Fire. My husband and I gifted each other with them 2 years ago, and they really make us happy.  We are avid readers and can download books at anytime and read them immediately..or later if we want.**Nuther Note: My husband ordered HIS Kindle Fire HDX 7\" 32 gb today. He saw my excitement and joy over it and had to have one too. And though we aren't rich, we decided these are Xmas gifts from and to each other.Two of my sons called today and asked if my tablet arrived and were delighted at my descriptions of it. Both are firemen in different states. One uses a laptop at work and a Nook. One uses a mini IPad at work. They have probably ordered their KF HDXs by now..and then there are the wives.  See how this spreads? :)My review is basically to say that the new Kindle Fire HDX 7\" is a wonderful device, very easy to set up and use..gorgeous screen, great looking device (love the back :) )  We checked out 'Game of Thrones' on HBOToGo and the sound is lovely..the picture is amazing.I recommend this Tablet highly!!! Five Stars Highly. :)", "Title": "What a wonderful tablet!!!!", "Date": "October 24, 2013"}, {"Author": "Kathleen Lambert", "ReviewID": "R12U7PKDDMZWA6", "Overall": "2.0", "Content": "We recently purchased two Kindle Fires, an HD for my daughter and an HDX for myself--primarily for work. Both devices are extremely well designed. I can compare them to a Galaxy Tab 7\" and they come out far ahead, particularly that Amazon has realized the \"natural\" position for a 7\" tablet is horizontal, not vertical. The screen is amazing, which you'd expect from the stats, but for a tiny 7\" device, the speakers are actually quite capable. Sadly the HDX seems to have some hardware issues.The first thing I noticed was it frequently wouldn't connect to Wifi. I had the same issue on the wifi at work and at a third location. We also have several other devices, including the previously mentioned Kindle Fire HD, that don't have the issue. I decided to google the problem and found dozens of threads with similar experiences, including people who'd returned the device and had a replacement with the same behavior.The second problem I had was that the battery would drop as much as 50% overnight when left in sleep mode. That's just not acceptable to me. Again, we had the Fire HD to compare it to and the battery drop there was only a few percent. I tried deleting applications that might be activating the device while it was asleep, a factory reset, but nothing worked. Again, I found threads on the Kindle support forums with dozens of people experiencing the same issue, including those who got replacement units.I'd suggest just buying an HD, which is what I'll be doing the next time they go on sale. They're both great devices and the HD doesn't seem to have these issues.", "Title": "Wifi Disconnects & Battery Drains", "Date": "May 27, 2014"}, {"Author": "Cristiano", "ReviewID": "R2ADYOQYG3QG05", "Overall": "5.0", "Content": "I got the Kindle Fire HDX 7\" (32GB) for my wife as a belated surprise birthday gift and she absolutely loves it! We've had Amazon Prime for awhile and we now get to maximize the value of Prime membership as the Kindle Fire allows us to access the growing selection of free movie/TV content!I'm a bit of techie and my experiences with tablets have been quite ambivalent. Here's my history:- Amazon Kindle DX (hated it b/c it was too slow, clunky; sold it on craigslist after 3 months)- Apple iPad 2nd gen (loved it at first but when I tried to use for productivity, it was horrible; sold on craigslist after 6 months)- Apple iPad mini (after playing with it at a store, I didn't feel it was worth it so when I got it as a gift I immediately sold it on craigslist and got the Canon S90 camera instead)Despite this disappointment with tablets, I thought the Kindle HDX was a good value at its price point and would make a great gift for my wife. So I pulled the trigger and let me tell you, my wife is so happy (I'm a bit tempted to get one for myself). The screen is crisp and rich in colors, the OS is fast, form factor is perfect for personal viewing, super light (very important when watching a 2 hr movie), all previous electronic Kindle books look great on it, and the chambray cover I bought for her looks great. Also Amazon Prime membership makes the Kindle HDX have so much more value than the more expensive Apple iPads. We live in Korea and travel a lot so my wife is looking forward to using her new Kindle HDX on long transcontinental flights (now that they allow you to downloads some of the content).In order to lift the geolocation restrictions, we purchased witopia VPN ($50/yr) and setup the IPSec protocol. It was simple and worked right away at HD streaming quality! Hope this helps someone! A great gift!", "Title": "Great for those who travel often and live overseas!", "Date": "May 25, 2014"}, {"Author": "JTL", "ReviewID": "RII3UAH689UZO", "Overall": "3.0", "Content": "The integration into the Amazon ecosphere is great. All my books, etc right there. But I let my Prime subscription lapse and never renewed it, so the rest of that content isn't so useful. I'm also not a big consumer of media on tablets, so watching video isn't super important to me here. When it comes to using this tablet for work applications, well, don't bother.I'm a writer. I like to have my tablet around for writing and none of the apps I use for writing are supported here. Not Scrivener, not Dropbox. Well, Evernote is supported, so there's that. But it's clear that the Kindle Fire HDX isn't built for work. It's a media consumption device almost exclusively. It's great at that. But then again, so is the iPad Mini and that's what I've ended up going with because it does all the stuff I need it to do very well.No device is perfect and I really do think the Kindle Fire HDX is a nice piece of gear. It has its place in the tablet ecosphere, just not, unfortunately, on my night stand.", "Title": "Good tablet for reading, not so great for other stuff", "Date": "May 14, 2014"}, {"Author": "V. White", "ReviewID": "R200FF0DDIEGMB", "Overall": "5.0", "Content": "I love my HDX 7! Amazon prime makes if even more fun and I am going to finally give in and pay the annual after the free trial is over. Something I was against.The shows and movies look great on HD it makes downtime go by fast and I lie that I am download the shows instead of using wifi to stream. I wish I would have purchase more space but 16gb works if I delete shows as I finish I believe I fit 10 to 12 shows at a time.The blue does not bother me which was my concern. The kindle reading to me is great I use it on my drives home from work and sometimes at the office. I was never an audio book fan but I like this option without spending audiobook money.The ads only come up on the lock screen and usually for free or cheap stuff so that is great. I got a $3 music credit o. One of the ads which is nice.I have not read in the sun yet but the sun in my corner office has not effected my reading or show watching during lunch hour.Battery life has been great!This was my birthday gift and I am so happy. I was considering N iPad mini and I have used many of my friends and I love the HDX more. I like free shows and movies .I only was able to get wifi at home so far so I can't comment on that but setting that up was easy.This is a great buy in all honesty! I am truly happy!", "Title": "I love my Kindle Fire HDX 7", "Date": "May 13, 2014"}, {"Author": "Paul Alsip", "ReviewID": "R13QW7GQC8K9QH", "Overall": "2.0", "Content": "I had my Kindle Fire HDX for literally about 2 weeks. I purchased no insurance because I have found they are normally a waste of money on items of this price. The deductible is usually as expensive as buying a new one.Anyway, the kindle itself was pretty great for apps and such. However, ****BE WARNED**** it is not very durable. It fell off my couch about 12 niches give or take on to a \"CARPETED\" floor and the screen shattered! lol Nothing wrong with the inside but once the screen crack the touch screen stopped working properly.I have owned quite a few tablets in my life and I have NEVER seen one break this easily. They have offered to send me some older model refurbished kindle in exchange for about a $100 fee. (Older Model) keep in mind. Apparently Amazon (Kindle) department only offers a warranty on inner parts in such cases something mechanical goes wrong. (No Screen Protection).Do your homework before selecting this product. I believe some places like Samsung Galaxy have a screen protection program they do. Amazon really should offer a better broken screen replacement program or at least let people send them in to get the screen replaced on theirs at a low price vs having to replace it at $149 just so they can turn around and resell yours at a $129 profit.Kinda sad program they have currently.Anyway..................I would suggest looking into other that are much more durable. Much better replacement plans, and even cheaper all around for a new one with better specifications.Product usage gets 4 StarsProduct durability 1 StarCustomer Service 2 Stars.", "Title": "Impossible to repair.", "Date": "May 12, 2014"}, {"Author": "Abdullah Albyati", "ReviewID": "R2GSBRX6Q6BK0K", "Overall": "5.0", "Content": "There is no need for introductions. Amazon is introducing high quality products to the market, and Amazon is doing great.The 7\" Kindle Fire HDX is well designed, and has an amazing feel to it when you hold it in the first time.What do I like about Amazon 7\" Kindle Fire HDX?Light weight tablet. it is only 10.7 oz (303 grams) for the WIFI version, and 11.0 oz (311 grams) for the 4G.The Kindle fire HDX screen resolution is beyond HD, it is HDX which means you get bright quality from any angle. I have used many tablets, but when I used the Kindle Fire HDX I was stunned by the screen quality.Elegant design that gives the tablet a luxurious feel.The Kindle Fire HDX has a great sound quality provided by 2 speakers located on the top. Really the best sound quality I heard in a 7\" tablet.What I hate about?When it comes to gadgets it is a love hate relationship. There is always I wish my device has this or that.So what do I wish the to change or add to the Amazon 7\" Kindle Fire HDX?External SD card support. 16G is not much now a days (although there is 32G version of it) so I wish it had an external slot for Micro SD card for extra storage.Other than that there is nothing else I would change in the Kindle Fire HDX.", "Title": "My favorite 7\" tablet so far!!!", "Date": "May 10, 2014"}, {"Author": "Tito E. Dutari M.", "ReviewID": "RZF6EE969P3VV", "Overall": "1.0", "Content": "I am an Amazon Prime member for many years now and though, as many others I guess, that the instant video and books did work with my membership as well. But no.The advertising should and ought to mention that little simple but essential fact; so it is in fact misleading (not anything else).As regards to books, only one (1) book could be borrowed per month; but in the advertising says that \"hundred of thousands\" of books are available for you. Does it sounds familiar?You do sacrifice full flexibility and info and apps access to become a captive \"client\" of Amazon's environment and marketplace, but are indeed not treated in a discriminatory manner, since you can buy everything but you don't get all that is advertised.The aforementioned is, definitively, not in line with Amazon's reputation and prestige.  The company must do something about it.", "Title": "Don't buy unless you live in the US!!", "Date": "February 24, 2014"}, {"Author": "RMG", "ReviewID": "RIEVT7Q0FCVBD", "Overall": "1.0", "Content": "I purchased the new kindle fire HDX in December.  It has been acting up since...turning off while reading books and listening to music, flickering and adding the toolbar border, when I do not ask for it.  Customer service said they would send me a new one.  They sent an old refurbished one.  I called customer service again.  They said they would send me a NEW one.  The next one came in an old refurbished one again.  This one came in and still had fingerprints from whoever worked on it.  REALLY???I was told by Alicia A. that it is their policy to send you used kindles as replacement.  REALLY?If I wanted a used Kindle, I would have purchased a used Kindle.  This is my second one, but I will not be buying another.JUST A THOUGHT...Maybe they could at least appear like they were sending something new.", "Title": "Hope Your Kindle Happens To Work!", "Date": "February 19, 2014"}, {"Author": "biologytyler \"The Biology Expert\"", "ReviewID": "R3C1YFS2LOYLCQ", "Overall": "5.0", "Content": "I have several different tablets such as a galaxy tab 7 inch and an galaxy tab 10.1 inch. But so far this tablet has blown all the others away especially when it comes to the display. This tablet also excels in its ability to open apps quickly and efficiently. The 2.2 quad core processor really shows its power in this tablet as webpages load lightning fast and he apps like candy crush are smooth with no lag whatsoever. You also have access to all of your cloud content such as your Amazon prime music and your Amazon prime video library. The speakers on this unit is something I must talk about they are the best I have ever seen on any tablet ever. Even though this is a 7 inch tablet the speakers sound like those found on 10 inch or higher tablet they are exceptional and have yet to be beat. Others have commented on a blue haze around the borders of white pages it is a little noticeable but it is nothing to be worried about as it is very faint and easily overlooked. Overall I give this tablet a 10/10 and it's very fast has a brilliant display good color good picture quality great speakers great charge times great battery life everything is great about it if you're looking for a tablet this is the one to get. 100% recommend.", "Title": "best 7 inch tablet on the market.", "Date": "February 15, 2014"}, {"Author": "Christian Haldeman", "ReviewID": "R3IPD8DYUYYFKQ", "Overall": "2.0", "Content": "Purchased this as a gift for our child.  Spent a week setting it up (parental controls, purchased apps, downloaded videos, books, games,...).  Tablet began struggling to stay connected.  We run two smartphones with a matching brand tablet and a PC based laptop off of our cable providers WiFi router.  We can, have and do run all machines' browsers at once.  However, this tablet would not run the browser.  When looking at the connection and settings on the tablet, it said the signal strength was good (would also read maximum number of bars at top) however it would spin and say \"loading\" for as long as we would let it go.  Spoke with Amazon as well as Kindle specialists.  Over a series of lost Mayday sessions (lost connection), phone conversations, clearing device in multiple ways (then reconfiguring), rebooting router and shutting down all other connections to phones, tablets and laptops....nothing changed.  The final answer I was given was that the router we have does not have the capacity to supply enough bandwidth to support the Kindle's browser.  Not sure I believe it, but I will go back to a brand I know my router can support.Too bad.  I was impressed with the interface, video quality and options for apps and downloads.  Was also curious to see how well it ran Office....was considering one for work as the price would have beaten the Surface.Techs were friendly and really tried to help as best they could.", "Title": "Serious connectivity issues with little help to resolve", "Date": "February 12, 2014"}, {"Author": "Loralyn Hamilton \"Ula\"", "ReviewID": "RQ1K5BLQ1HNYS", "Overall": "4.0", "Content": "I have a 1st gen mini iPad and my Kindle far exceeds the mini iPad in many areas.  Screen is beautiful - it's much easier to read.  The icons are more colorful and dynamic.  The only downfall is that Amazon doesn't allow you to use Google Play through the Kindle and a few of the apps we enjoy (like Dominoes by Flyclops) are only through Google play and Apple - hoping this is offered soon.  I can do everything on my Kindle that I can on my mini iPad (there are even free texting apps). Documents are PC friendly instead of trying to convert Pages (Apple) to Word etc. and they didn't try to sell me a data plan so basically I can use it anywhere there is free wifi (I know I can do this with iPad as well but was told I had to have a data plan.)  It's a great product!", "Title": "I love the Kindle Fire HDX!", "Date": "February 5, 2014"}, {"Author": "H. A. Brown", "ReviewID": "R2YPJ21KRSHR8O", "Overall": "5.0", "Content": "I bought the kindle HDX 7, WI-FI, 64 gb with mixed feelings after reading all the reviews.  Now that I have it, I don't understand people's issues with the blue around the frame that they claim to see and find so annoying.  I have no such problems and find it a joy to read. whether in the dark or the sun-I have no problems with this issue or reading.  I love the color and responsiveness of it and it's lightweight and hand size make it so easy to carry or put in my purse even with a case.  Thank you for another great product.", "Title": "Just the right size", "Date": "February 4, 2014"}, {"Author": "Debra Lewis", "ReviewID": "RME8NT5M33DF0", "Overall": "1.0", "Content": "It is not even a month old and it keeps freezing up I had to call help 3 times already.", "Title": "Freezing up", "Date": "February 1, 2014"}, {"Author": "Kevin Morley", "ReviewID": "R1GGO5KV7FTV3D", "Overall": "5.0", "Content": "While many people have been complaining that this tablet is not as good as a Droid or an IPad. I think they miss the point.I also think they are sheep. The Kindle Fire HDX does it's job very well. If you want a portable computer, buy a frigging laptop. These are tablets. Get over it!", "Title": "Excellent tablet", "Date": "January 31, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R1TMVKYEAH166J", "Overall": "5.0", "Content": "I absolutely love mine. I wouldn't of asked for it, but I'm active military and deploying soon. But any-who. The Kindle Fire HDX 7\" keeps to the size of a traditional book unlike the 8.9\". Now that I have the 7 I honestly don't believe I'd like holding the 8.9 version to read.The HDX version does provide over-all flexibility as if you were almost on your laptop. All color of course. Basic web browsing functions: yahoo, gmail, etc.., video from youtube. And you can download most apps. Pinterest, twitter, Pandora... I haven't tried games yet so i'm not sure how well they work.I can tell you that with the 16GB Kindle, you can fit 2,000+ books, PLUS a other files and still have 7 to 7.5GB of free space left.  Plus multiple back light features for reading and other accessibility.I did read only one other review from a person about Battery life..... He was comparing/rating what he called heavy HD video use/streaming. if you are buying a Kindle, please keep in mind it's intended use.I wanted mine for reading and small amounts of web use... Not gaming and HD video's.Overall, The kindle HDX 7 is the perfect fit for me. I am able to store/take photo's, music, and read comfortably for as long as my eyes can take it, which to say is only a few hours. And the battery isn't below 85%-ish. However, I would recommend using a USB wall charger vs the one that comes with the device. The charger that comes with it does not provide fast charge times comparatively.Hope my review has somewhat helped.", "Title": "Awesome Device to have on the go for reading", "Date": "January 8, 2014"}, {"Author": "Mr. Onyok J. Bentot \"OJB\"", "ReviewID": "R2G6JO96NXPFBW", "Overall": "3.0", "Content": "Unstable OS but brilliant execution as an Entertainment Tablet. Fantastic display!I purchased this tablet over a week ago and was extremely impressed with its ease of use and astounded by the wealth of content available as Prime Member. I streamed movies and read books and downloaded games to my heart's content. But alas, the tablet began freezing (blank black screen) frequently and inexplicably. I did not know how to \"kill\" apps easily like ok n an iPad or Android tablet.I am extremely disappointed even as I write this review on the tablet itself. I moved from an old iPad to this one and for a week or so I thought I'd hit the jackpot because of all the free content and books especially. Perhaps others may have a better experience with the device itself. But as an entertainment tablet, it does not get any better.", "Title": "Brilliant Execution as an Entertainment Tablet, but has stability issues.", "Date": "January 6, 2014"}, {"Author": "P. Castronovo", "ReviewID": "R1GFR4WWVG6QHW", "Overall": "5.0", "Content": "This tablet does everything I need.  Web surfing is easy and the readable pane feature is great for reading news. Downloading books and movies straight from Amazon is simple and quick. I've also enjoyed the games on the app store.  My wife converted from an iPad based on my experience. At 7\", it is truly portable. Larger sizes are just too bulky for travel. Get it.", "Title": "A tablet that is truly portable", "Date": "January 1, 2014"}, {"Author": "Mike", "ReviewID": "R17YNEBW9TLIMI", "Overall": "5.0", "Content": "I was concerned when I bought my HDX that I wouldn't be able to install most of the apps I was used to on my Nexus10 but I found 1Mobile Market on cnet's download site and it let me install most of the apps I was missing.  Including chrome, google maps, google earth, google translate, chromecast, AVG, Task Manager, copilot and more. all work great so far.", "Title": "apps available for Kindle Fire at 1Mobile Market", "Date": "December 31, 2013"}, {"Author": "Jimmy L. Wilbanks", "ReviewID": "R3JTFFPU8KQSQJ", "Overall": "5.0", "Content": "I have never owned a Kindle previously so I had to get acclimated to how it works in general.I also bought a Netgear PTV3000 so I could fling the content to my tv and it works GREAT! I searched to find the right box and found out the Netgear PTV3000 is the only one certified by Kindle to do it. I plugged it into my HDMI input on my Samsun plasma tv, found the connection procedures and shot the display over to my tv, after about 30 seconds or so it connects and everything works perfectly! I have a couple of little complaints about the Kindle in general. When I download movies to watch when I am not in Wifi mode, it takes a REALLY long time to download and if you try to download them in full 1080p, it takes even longer. I have settled for 720p on most movies but still takes a while. Also, when I fling movies to the tv, it does show in HD but there is fairly obvious pixelization so it is not as good as watching a Blu Ray disc. It also cuts out just a little bit every now and then but no big issues there. I got my email synced to the Kindle and that works fine. I also ordered Amazon Prime so I could watch free movies and tv shows but I would say less than half of them are actually free, which is pretty annoying. I will not pay $2 or $3 bucks to watch an older tv show when the reruns are free on tv. It would be nice if they had an option to watch them free with commercials or to pay for them. The same for older movies, we were going t Ho watch some older Christmas movies this year and several of them were not on HD Prime so you have to pay for a lot of older movies too. I am still getting to learn all the modes and I have not played any games yet so can't really reply to those. I do wish I had spent a few more bucks on the Kindle with the larger memory though, if you download a few movies, they will eat your storage space right up. Hope these comments help anyone considering this. Also, I went with the 7\" Kindle instead of the 8.9\" because I just could not justify paying almost $200 extra bucks for just 2 inches of extra screen when everything else seemed the same. I am quite happy with the 7\" screen as I use it on my train rides to and from work and I think the bigger one would be more cumbersome. Plus when I use it at home, I can fling it to the big screen.", "Title": "So far the new Kindle HDX 7 is awesome!", "Date": "December 30, 2013"}, {"Author": "Thomas Didymus \"Old Duck\"", "ReviewID": "R38IITFOA5PLJ", "Overall": "3.0", "Content": "UPDATE (01/03/2014) - My third replacement HDX arrived yesterday, and the white of the screen still has a yellow tint to it, but at least this tint is relatively consistent. It does appear to be just slightly more yellow on the right than the left, but it's not blotchy / spotty like the HDX it's replacing. I did an experiment to verify that I'm not imagining this tint - I set the Kindle overlapping my Macbook laptop screen, and side-by-side the difference in white is quite noticeable. However, since the tint is consistent and not blotchy, it doesn't take long for my brain to \"tune out\" the yellowness and accept the white as white while reading. I'm updating my rating from 2 stars to 3 stars. I'd give it 4 stars, because I like the tablet as a whole, except that it took me three tries to obtain a Kindle HDX with a \"tolerable\" screen (I'll be keeping this latest Kindle). If you were to put all three HDXs I've used side-by-side, each screen would be noticeably different than the other when reading text on a white background. That just should not be the case.-- ORIGINAL REVIEW --I would give the Kindle Fire HDX four or five stars if not for the problems I've had with the screen. I'm on my second HDX and have just requested my third. My first HDX had something akin to \"dead pixels\" - a brown spot under the glass that looked like someone focused the sun on that spot with a magnifying glass. I returned that device immediately, only to get a replacement with a different but even more distracting screen defect that I can best describe as \"muddiness.\"I've owned a variety of laptops and tablets over the years, including the previous Kindle HD, and I've never encountered a screen that looks like you're viewing it through a thin layer of dirty water. The uneven \"dirty\" white is mostly noticeable when reading black text on a white background - which is most of the time when using the browser, news apps, or even just reading a Kindle book.When I noticed this right away on the new HDX, I remembered the story of iPhones having a similar problem due to a screen adhesive that takes time to dry, so I kept my current tablet for close to a month, using it every day with the hope that this muddiness would go away on its own. It has not. It is HIGHLY distracting, and despite the crisper resolution, I find myself wanting to return to my old Kindle HD. I've requested a third HDX to replace this, but how many of these tablets must I go through to find one with even a decent display?Just in case you think I'm fussy, I have no problem with the blue glow on the sides. The glow is in the margins and doesn't overlap text or video. If the glow was the only issue, I'd still give this tablet 4 or 5 stars. Like I said, I have lots of screens in the house to compare this to, and it's obvious that Amazon's flagship tablet should be at least on par if not better than the average everyday LCD screen.Others have had similar problems (search \"yellow HDX\") , and yet others, including professional reviewers like Ars Technica, have NOT mentioned these screen problems. This and my own experiences lead me to believe that there is a breakdown in Quality Control / Quality Assurance in the manufacturing of these devices. At the very least, it appears that the manufacturer of the screen itself is letting substandard displays out onto the market. If that's the case, then you are \"rolling the dice\" when you order the HDX. I'm about to roll the dice one more time, and I'll update this review if / when I receive my third HDX.", "Title": "Quality Control Issues / Yellow Tinted Screen", "Date": "December 29, 2013"}, {"Author": "jordan burks", "ReviewID": "R3V552VVOWGBLH", "Overall": "5.0", "Content": "This is a fantanstic tablet. I use my tablet for watching movies, reading books and playing the occansional game and i will say that there no better tablet for getting this done. It's easy to use, fast and looks beatiful. All the content you could ever want is literaly a finger tap away. The only downfall would be the lack of the google play store but it was not a deal breaker for me. All the major apps are there. I was blown away by the performance of this tablet and just how simple it is to use. I will also say that the mayday button is the realy deal. I've used it twice now and both times a person was there in less then 15 seconds and were extremley helpful. i had the first kindle fire and it was slow and the display was mediocre. This tablet is amazing and I would recommend it to anyone.", "Title": "I'll keep it short and simple", "Date": "December 28, 2013"}, {"Author": "Gabriel Oz Dragon", "ReviewID": "RURKQVDWXOZXA", "Overall": "4.0", "Content": "Compared to the Kindle Fire HD (Previous Generation) to which this is the equivalent of/upgrade for... the Kindle Fire HDX blows it out of the water!! The new placement of the speakers on an angle helps boost sound when leaned against or played flat on a surface. The power button placement no longer causes me to accidentally turn off my Kindle. The resolution is ridiculously gorgeous. The charging port placement now allows for landscape use  while leaned against a surface. The 'mayday' customer service video call feature is fantastic with crazy fast response... which brings me to my reason for 4 out of 5 star review... I've found that when I have my Kindle charging while watching a video using headphones then remove the headphones the sound is all *bleeped* up. I can hear the background sounds along with music tracks but all voice in a movie is barely audible. I freaked out the 1st time not understanding so used the 'mayday' feature which was great but my tech guys voice was.. barely audible. I was able to make out what he was saying by giving him a close up of my ear canal and he did help me find the fix, to power down, not just turn off, then after the turn on it was fixed, YAY... BUT though it's fixable every time it happens, I'm very nervous that there's any type of hardware/software issue right out of the gate!! I've read strong negative reviews about the purchasable warranty not covering anywhere close to replacement cost so I can't see spending the pretty penny for that and am just praying that this baby won't tank on me because there's no way I could afford to replace it so soon after having to pay my insurances deductible to replace the Kindle Fire HD (Previous Generation) that was stolen this month.  I'll update this review as I find out more about this audio bug via tech help.", "Title": "Fabtabulous upgrades n' improvements to the previous Kindle Fire HD (Previous Generation) with 1 troublesome issue", "Date": "December 28, 2013"}, {"Author": "CPO RET. \"D.D. Franklin\"", "ReviewID": "R2UAFUH119CL6L", "Overall": "5.0", "Content": "This is your best one yet, The display is outstanding and the performance is better than the original Fire. I liked it so much, I purchased 2. These are my Wife and I's 3rd Kindles. We absolutely LOVE them.", "Title": "Another Home Run for Kindle", "Date": "December 28, 2013"}, {"Author": "Danielle", "ReviewID": "RI9F6PQU74XEA", "Overall": "3.0", "Content": "I didn't realize that Amazon would purposefully false advertise their merchandise.  The reviews are as inconsistent as the boarders around your visual experience.  For me personally it is the left side boarder.  There is a sliver of a difference on the left side but it makes a big difference for people who have any visual difficulty including headaches.I called up Amazon to see what they were going to do about it and the response I got was just as inconsistent as the Kindle's HDX 7 boarders.  \"I can guaranty that the replacement we send you will not have this problem.\"  When I told him that I had read the reviews to see if this was just a problem with my Kindle HDX 7 the story changed to \"The Kindle 7 HDX as blue LED lights which cause differences in the boarders.\"  Really?  I told Carlos, from the Kindle help department, to not send me a Kindle 7 HDX replacement but the 8.9, which according to him is different.  Carlos said that he would send me a link for a pre-paid mailing label.  That was it.  When I asked that the sale at the time of my Kindle's purchase be honored Carlos had to 'Chat' with a supervisor, Fabian.  Nope, nada not even a compromise.  What happened to the amazing customer service I am accustomed to?Well, I have been a Prime Amazon member since its birth 8 years ago and have never looked back.  I am sadden at my interaction today.  I should just take back my Kindle Fire my son inherited and be done with it but I do like the Kindle product itself so this is not an option I will order the Kindle Fire HDX 8.9 and see what happens.BTW if you have no problems with differentiating boarders buy away.NOTE to Amazon:  You should do the right thing and in your descriptions of your faulty product place a disclaimer.  Shame on you.", "Title": "WARNING:  DO NOT BUY IF INCONSISTENT BOARDERS WILL BOTHER YOU", "Date": "December 28, 2013"}, {"Author": "Kitty \"kittietta\"", "ReviewID": "R1VMK5JXMEQGS6", "Overall": "5.0", "Content": "This is my 2nd kindle did an upgrade and so glad I did!! Am very impressed with the new kindle. The feature with the words for the music is nice. Sound quality is great!! I like the power and volume buttons on the back. Glare is less so I have less eye strain. Picture is very Sharp and color awesome. Was well worth my money. My only fault is you cant get the Adobe flash player on it. If you could I would have no need to even buy a laptop!!", "Title": "best purchase i made this year!!", "Date": "November 8, 2013"}, {"Author": "Litefever", "ReviewID": "R3NZJFOTUEE9C", "Overall": "5.0", "Content": "Small and fast with an incredible display. Color reproduction and resolution are exceptional, providing a noticeably better picture than our laptops and iPads. Graphical user interface is intuitive and works well. I was hoping for something perhaps a little better than our iPads but the performance and screen are breathtaking and the fit and finish is top notch. AND ITS A LOT CHEAPER!!!!To be fair the 7\" screen has half the area of the iPads 10\" but for me that's a plus, this is easier to carry around and hold while watching a movie. The incremental cost to go to 64 GB of memory (vital for storing even a small library of HD movies) is far more palatable than what I would have had to pay to do the same on the latest iPad. Come to think of it I think I could buy two of these for the price of about one of those.The HDX seems to have gone beyond an incremental improvement on the prior model (2012 HD). There are no apparent compromises in performance or design with this model.Struggling to understand the \"blue border\" issue reported by some. Not noticeable on mine while browsing the web. Not tried reading a book on the HDX as yet.Thank you Amazon for breaking the mold of high performance and looks = exceptional cost.", "Title": "Jaw droppingly good", "Date": "November 8, 2013"}, {"Author": "Cesar Tejuco", "ReviewID": "RD22WDXAT83NI", "Overall": "4.0", "Content": "IPad Killer!!!!  I am in love with this device. Got rid of my iPad2 and my Microsoft Surface PRO ...Screen is amazing. Light and powerful. Take it with me everywhere I go.I don't like the origami case. I got the kindle ZIP Sleeve instead", "Title": "no regrets, a def keeper", "Date": "November 8, 2013"}, {"Author": "Pug Lover \"Pug Lover\"", "ReviewID": "R2VQE3X81SVXXV", "Overall": "5.0", "Content": "IT is lightweight, I can watch NETFLIX and amazon movies. Also, you just hit a button on the homepage if you need help and a live person talks to you. Their picture shows up in the bottom right hand side of the screen and you can see them talking to you!!! GREAT SUPPORT if you need help. This is my first tablet, so it was all new to me. Also, I purchased the product for $229 and the next day it was on sale for almost $35.00 less. I called amazon and the promptly refunded the price difference to me. Also, I belong to AMAZON prime. It is a deal for $79 a year..........free two day shipping and unlimited movies on AMAZON...Thank you! Tricia", "Title": "Great Tablet", "Date": "November 8, 2013"}, {"Author": "Kindler", "ReviewID": "R24DLMFB57947B", "Overall": "3.0", "Content": "Love everything....except the power and volume buttons on the back.  What's up with that?  I have to take it out of the case to wake it up, turn it up, or turn it off.", "Title": "nearly perfect", "Date": "November 6, 2013"}, {"Author": "KBRI tunes", "ReviewID": "R350ZQI6NV4KB2", "Overall": "5.0", "Content": "Beautifully designed device with a brilliant screen and fantastic speakers. Gone are the glitches and hang ups from the past.  Yes, I have owned every generation of Kindle Fire. Each time an upgrade is released, I use Amazon's Trade in program to sell back the last one. Operation is smooth, performance is fast. You will definitely need the 32 GB at least. I regret that I did not order the 64 GB. Now that Amazon allows you to download a large portion of the Prime material, you can eat up space quickly. Battery life is impressive. This go around, I skipped buying a screen protector, but the origami case is an absolute must. I haven't tried Mayday yet, because I haven't had a single issue or problem. So glad to have this!", "Title": "Outstanding upgrade", "Date": "November 6, 2013"}, {"Author": "Eric Westrope \"KindleReader\"", "ReviewID": "R1YG9HA35IHE4P", "Overall": "5.0", "Content": "Personally, I really like this Kindle Fire HDX. Setup was quick and easy for my WiFi, the software update only took about 5 minutes. That was the download time plus the time it takes to install the update and reboot. I downloaded all my ebook titles and installed my most used apps on it without any problems. I have even streamed a video from Amazon Prime, and it played flawlessly. The picture and sound were great.I have read a couple of other reviews that have harped on a purple haze on the sides of the screen. Honestly, if I had not read about it, I probably would not have even noticed it. Yes it is there, about a quarter of a centimeter in both sides of the screen, and you do not even notice it unless you are in a window that is all white and are looking for it, such as when reading an ebook and using the white background screen such as the browser, so unless you have OCD it is so minor that you can easily ignore it. I never noticed it when watching a video. From the location, it is probably coming from the light strips, and to me, I can easily ignore it and tune it out of my vision. In fact on darker screens I do not even see it.Personally, for me, this is by far the best tablet I have ever owned.", "Title": "The Best Kindle Fire yet", "Date": "October 21, 2013"}, {"Author": "tikitoo \"tikitoo2\"", "ReviewID": "R28D5YO4JTLJAB", "Overall": "2.0", "Content": "Battery will not charge to 100%. When I received the device it was at 63%. After 3 hours on the charger it was at 63%. I tried the HDX charger on my Fire HD and it charged without a problem. I called Amazon and did all the usual resets and reboots and the battery issue still remains. I then tried my old charger (which is actually more powerful) and after 7 hours I got it up to 78%. I left the charger on over night and it only reached 80%. I would be curious to know if anyone else is having issues with the battery. Amazon will be sending a replacement.Also as noted by another customer, there is a purple haze around the edge of the reading page when trying to read a book.UPDATE: Well, I received my replacement Fire HDX and the good news is that the battery issue is no longer an issue BUT the blue light bleed is even worse than the first one! Since I use the device the most for reading - this is just not acceptable. Back it goes. I am very disappointed that Amazon would release a device that is or was primarily geared toward readers...and have it be unreadable.UPDATE: Going to try this again. I ordered the Kindle Fire HDX with the 3G & WiFi...and I ordered the Kindle Paperwhite to cover my bases. There were a lot of pluses with the new Fire but the blue/purge light bleed was just something I couldn't handle. I hope this one isn't as noticeable but if it is...I will use the Paperwhite for reading. I was going to order the iPad mini with Retina display - but even with buying the Paperwhite - the Fire HDX was still at least 30% less!! I love my iPad but most of my entertainment content comes from Amazon (even music which is often much cheaper on Amazon than iTunes).", "Title": "Battery Issues and Light bleed - 2nd time Not a Charm", "Date": "October 19, 2013"}, {"Author": "T. Harris \"Lady T\"", "ReviewID": "R25XUP1UM737HR", "Overall": "5.0", "Content": "My Nexus had slowed to a crawl and reseting it only helped for a short period of time so I order the Kindle Fire HDX.  It says 7\", but it is noticeably smaller than my Nexus 7 but the screen has the same amount of viewable area as my Nexus.  I'm not sure why the photo shows such wide black borders around the screen.  The borders appear to half as wide as pictured.Pros:High Def screen is wonderful for viewing moviesKindle reading experience is much better on the a Kindle than the app - note taking, borrowing prime books for free directly on the device, newspapers have more images (at least that was the case with the Chicago Tribune)Smaller than the 7\" Nexus with the same size screen which makes it easy to take everywhereMany of my favorite apps are available in the app storeSome music downloads include lyricsCons:A single page home page that fills quickly with appsYou can't access the Google Play app storeGmail and Google calendar are not supportedThe YouTube app is also NOT supportedGoogle+ app is also not supportedOverall, I would recommend this device but you should check to see which of your must have apps are supported.  All of my deal breakers were available in the Amazon app store so I'm going to keep it.", "Title": "Better than the Nexus 7 generation 1", "Date": "December 2, 2013"}, {"Author": "Rachel Settles", "ReviewID": "RB18H3RK8VE77", "Overall": "5.0", "Content": "I love the Kindle Fire HDX! It does everything I want from a tablet, and probably a whole lot more than I need it to do.  :)I had a Nexus 7 1st generation tablet. I have since given it to my husband, because the Kindle does everything I want, so I have no need for the Nexus anymore.  It is very fast, and the picture resolution is amazing!  The speakers are much better that what I've had on other tablets. I always had to use an external speaker with the Nexus, but I have no need for one with the Kindle.I would definitely recommend the Kindle Fire HDX to anyone looking for a good multimedia device!", "Title": "Love the Kindle Fire HDX!", "Date": "November 30, 2013"}, {"Author": "Amazon Customer \"Debbie\"", "ReviewID": "R3OT9TRKICZ4L6", "Overall": "4.0", "Content": "I've never had a Fire before but I do have the Paperwhite.  The Fire HDX7 does everthing I want it to do.  It is small and portable and handles the multimedia duties with ease.  The only thing negative I have to say about it so far is that the bevel on the edge where the power cord goes makes the cord stick up awkwardly when it chages.  I also wish the App Store was larger but it had everything I needed to start.  I like using it and want more.  The screen is really sharp and I easily stream ny Netflix and Prime Instant Videos.  Obviously streaming does suck up battery life but I find the battery adequate for my needs so.far.", "Title": "Love my Fire HDX7", "Date": "November 4, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3EU8SANUS8Z43", "Overall": "4.0", "Content": "The best just got better.  I have the HD, but I really love the HDX.  The speed is noticeably faster and smoother; great screen resolution, and nice and light.  With the Invellop cover/case you can't go wrong, (it will turn the HDX on and off by opening and closing the case and fits on the HDX better than the HD version did).  I do notice the blue light on the edges of white pages, but its totally not an issue at all.  I love the smaller size, yet same size screen.  With the case you really notice the difference between the HD and the HDX in its case, weight and size-wise. Also I really like the Mayday feature;  within seconds I was talking to a live human who's fave popped up in a small Window on my screen.  Very cool! !!!I only have two gripes:1)  No microSD card slot.  Still!!! That's a bummer.  PRetty big bummer, but I guess Amazon wants you to store everything in their cloud, or something.  I have the 32gb version and it's barely enough for me, personally.  There's only something like 24gb (or is it 29gb?) left after the OS, and my music alone takes up 20gb.2)  No rear camera!!  Still!!!3)  If you're not going to give us a real camera, I can kind of live with that - though it would be fun to have - but you could at least make the camera on there be sensitive to the fact that you'll be using it for some sort of face-to-face interaction, and we don't like having our nose look huge and our arms aren't long enough to hold the thing far enough away so it doesn't distort our features.  All in all, the camera is pretty much completely useless.CONCLUSION:  Is it worth the upgrade cost?  I, personally, think so.  I love the smaller form factor without losing any screen size; I LOVE the new buttons for volume and power - so much better than the HD - and I love the weight difference and the speed difference.", "Title": "AWESOME!", "Date": "October 31, 2013"}, {"Author": "Ceper", "ReviewID": "RO3IV31DNMMGB", "Overall": "5.0", "Content": "I have had the original Kindle fire, 2nd gen kindle fire( the first one had an accident), fire HD and now the HDX. I love the screen! Very clear and touch is much better than ever. The flip side is some apps I use I cannot use on teh HDX. This is a bit frustrating.", "Title": "love and hate relationship", "Date": "October 31, 2013"}, {"Author": "Alex M. Luna", "ReviewID": "RSRFA7H24DRGJ", "Overall": "5.0", "Content": "This is so far the best kindle fire of the previous versions, a lot faster , lighter and the resolution is astonishing, you just cant go wrong with this product. Better alternative compared to the pricy ipad mini, and OS preference. Well done Amazon.", "Title": "Best kindle ever !!", "Date": "October 30, 2013"}, {"Author": "northwestern", "ReviewID": "REOOUBNV1L03X", "Overall": "5.0", "Content": "This is my third Kindle, and I love it. We have the bigger devices like the Ipad, but it has it's purpose. The Kindle Fire HDX is a media tool. It's purpose is for reading books, watching movies, listening to music, playing games, checking news, weather, and sports, and doing social media, along with shopping on Amazon for those of us who like doing things like that. You can't beat the picture, and sound quality on this thing, it will blow you away. The colors and sounds are crisp. You can put this on a table step back and still see and hear the details of a movie or show with no problem. I've watch movies and shows from Netflix and Amazon and had no problems. This is a great product for someone wanting something basic. I will highly recommend this to anyone.", "Title": "What you need", "Date": "October 26, 2013"}, {"Author": "Christine Bettini", "ReviewID": "R1PU0XZ25SXRAN", "Overall": "5.0", "Content": "The Kindle Fire HDX 7\" in great. Don't worry about the purple haze that seems to be bothering a number of people. Itis hardly noticeable and should not bother you. I really have to look closely to even see it and it is only with a white background. I tried the mayday help feature just to check it out. I had someone ready to answer by questions in 10 seconds. Amazing. The picture quality? Fantastic.", "Title": "Purple Haze", "Date": "October 25, 2013"}, {"Author": "Strebel", "ReviewID": "R23JLQ5UMO72YU", "Overall": "5.0", "Content": "My husband goes to sleep easily but I do not.  If I have a lamp on for reading, it distracts him.  I was using a Kindle paper weight, which was fine, but I could not get the Internet.  When I used my iPad, which I love, it was too heavy.  This new Kindle takes away the problem.  It is lightweight and the graphics are superb. I think clearer than my iPad and I can easily hold it in bed switching from a book, to the Internet, to my email without disturbing my husband.  I love it!  Also, it is so simple to use that I doubt I will ever take advantage of its around-the-clock support.  Bravo, Amazon.  A job well done and worth every penny.", "Title": "Absolutely Love It!", "Date": "October 24, 2013"}, {"Author": "DinDC", "ReviewID": "R2O7QGPNSX6AQ7", "Overall": "5.0", "Content": "Love my Kindle Fire HDX 7\", HDX Display, Wi-Fi, 64 GB. I received it on launch day and I can't put it down. This is an upgrade for me from the Original Fire. I also own the Original PW plus an iPhone, MacBook, and mini iPod. I thought long and hard about whether to buy an iPad mini and stick with the Apple ecosystem or get another Fire. I'm so glad I went with the Fire. The first thing that struck me was how light the new HDX is. I love the sleek look and the placement of the buttons. The HDX was incredibly easy to set-up. I also had no problem adding my FB photos to the cloud nor uploading my iTunes to the Cloud drive.The screen is absolutely gorgeous. The color and clarity are amazing. I opened a magazine and could read it without expanding the text which I couldn't do with the original Fire. I also found the sound quality excellent. The browser is very fast. I've viewed videos and had no problem with dropped WiFi connections; this was a problem with the Original Fire.While I still prefer my PW for reading, since the HDX is a new toy, I've been reading on it all week and found the reading experience enjoyable. In regard to the blue haze, I'm not sure I would have noticed it if I hadn't read about it. I can see it when I read an ebook and am looking for it. However, it doesn't bother me at all.My husband, who has an iPad, is very impressed with my HDX.  This is a great little tablet at a great price.", "Title": "Love it!!!!!!!", "Date": "October 24, 2013"}, {"Author": "J. Finkel \"Jack of Trades\"", "ReviewID": "R2ZF0QJKD88D1M", "Overall": "5.0", "Content": "Update 11/2/2013:  My family has been thoroughly enjoying our Kindle Fire HDX.  We set up Kindle FreeTime and it has been a huge hit with our 3 year old.  We started a free trial of Kindle FreeTime Unlimited that gives her access to thousands of books, games, videos and songs.  Some of these are junk, but many are items we have purchased for other devices in the past or were considering purchasing for the Kindle Fire.  There are Boynton books, Ivy & Bean, episodes of Sesame Street, Dora and Mr. Rogers, as well as Cut the Rope, Monopoly, Life, Bejeweled 2 and other great games.  You can find a list of what is available on Amazon.com (currently over 1500 items).  While the videos are not a big draw if you subscribe to Prime, like we do, Prime members get a discount on the monthly subscription fee, currently $4.99 / child or $9.99 / family.  Prime members only pay $2.99 / child or $6.99 / family.  At $2.99 per month, I feel that Kindle FreeTime Unlimited is, by far, the best feature of the Kindle Fire HDX for us.  If you are a Prime member with children under 10 years old, I would give my strongest recommendation to the Kindle Fire HDX.The Kindle Fire HDX is a great tablet that balances form, function and price.  There are some key differences that set this tablet apart from the iPad Mini 2 and the Nexus 7.  The Nexus 7 has a slower processor.  The iPad Mini 2 has a 7.9\" screen with higher resolution but a much higher price.  The Kindle Fire HDX has no rear camera and the screen has a bluish tint on the edges from the blue LED lighting, but neither bother me.  The Kindle Fire HDX has the least apps available of the three, but all the android apps I like are available.  On the plus side, the Kindle FIre HDX is very user friendly thanks to it's clear and smooth interface and mayday help feature.  If you are an Amazon Prime member or purchase music, ebooks and videos from Amazon then the Kindle Fire HDX is a very seamless way to enjoy your content.My setup consisted of pressing the power button, selecting my language and wifi access point, entering my wifi password and confirming my Amazon account.  It took about 50 seconds.  I was immediately impressed by the screen's resolution, vibrant, accurate colors and wide viewing angles.  The screen automatically adjusts for ambient light, not just with changing brightness but also changing contrast.  Speakers sound good for a tablet, but i wish they weren't rear-facing like every other tablet.  The tablet is incredibly responsive; everything is instantaneous.  Wifi is fast and gets good reception throughout my house without dropping the connection.  The tablet isn't too heavy and feels comfortable thanks to the contoured back with good grip.  I'm not really the kind of person to use the mayday feature, but I see it as being one of the biggest selling points.  Overall, this is a great tablet with a seamlessly enjoyable user experience.", "Title": "A Happy Medium", "Date": "October 24, 2013"}, {"Author": "Kindle Customer", "ReviewID": "R2YZWS556VG4V4", "Overall": "5.0", "Content": "After using an iPad received as a gift a few years ago, I was sold on a multi-use device...I gave my Nook Color to my father and hooked him on ereading! Then out came the iPad mini...just way too much for a perfect size. I literally carry my reader with me everywhere. So I began looking for a smaller device that was more economical. As I had hundreds of Kindle books versus Nook books, I chose the Kindle Fire HD. It works great and will be going to my daughter now...why did I get the new version? I liked that I could download from Amazon Prime...It is a little thinner and just a tad wider so it doesn't fit into a Kindle Fire HD case...odd...but that's okay.I did not have any issues with booting it up and receiving my media onto the device. I didn't even notice the blue haze around the edges...had to look for it after reading the reviews...seriously, folks are upset about that? I have never used the Paperwhite version so perhaps if I had I might have noticed it more.It is a little lighter in weight which is easier on my hands. Part of that I am sure is because the case is also slightly smaller.My only complaint, such as it is, the same as many others, I would like to see Amazon integrate with Google Play more. There are some fun apps I would like to have, such as themes for my background. That is a minor concern, just one of those nice-to-have options. And...why can't we get Zynga game versions that will work so we can actually play the games and not just check up on them?That's it from me...I love my Kindle and recommend it to everyone...even got my sister hooked on one too!", "Title": "A great media and reading device", "Date": "October 23, 2013"}, {"Author": "Johnboy7701", "ReviewID": "R3DF1JVT92HXE4", "Overall": "5.0", "Content": "I upgraded my wife from her generation 1 kindle fire to this. She hasn't let go of it since it arrived. I ordered it for her while deployed to Afghanistan. She got it in the mail and now uses it on a regular basis. But for some reason now I keep seeing all these charges for candy crush on our amazon account. It's alright she makes more than me, so I don't mind.", "Title": "Wife loves it", "Date": "October 23, 2013"}, {"Author": "A. Blanco \"AllisteR\"", "ReviewID": "R1Z343MGDDVRPG", "Overall": "4.0", "Content": "Overall the hardware is better than my HD so I won't go into those details because everyone else has. Something not addressed is the lack of HDMI and the inclusion of Miracast.I like it the HDX. What I don't like that there is no micro- HDMI so I took off 1 star for this. I really liked being able to plug into any screen to watch movies, etc. Now we have Miracast which is unproven and seemingly being forced on us by Amazon. There's not alot of options and if I want my TV's to work I need to buy at least 3 adapters.My question is specific to the Miracast function. Has anyone used a dongle to use the Miracast function? If so what product did you use? Amazon support not to helpful as the Indian call center does not even know the differences between the HD and HDX. I finally got to speak to someone in the U.S. and they sent me to this page http://www.amazon.com/gp/help/customer/display.html?nodeId=201370390 where they recommend the Netgear option.Updated 10/25/13I officially miss my micro HDMI. I set up the aforementioned NetGear which does what it says and was the recommended product by Amazon. Good (not excellent) overall picture quality when watching videos, but there is some lag especially when you have to transmit to the Netgear and download simultaneously. This may be better if you took 30 minutes to download a movie 1st, but i have yet to test this. This current hardware spec running through micro HDMI would have been outstanding in my opinion. Miracast is OK, and I'm sure future tech releases will solve latency issues. Final word as of now, is Amazon should have left the micro HDMI in addition to the new MiracastThanks in advance......", "Title": "Miracast/No Micro HDMI only thing keeping this from being 5 stars", "Date": "October 22, 2013"}, {"Author": "Kindle Customer", "ReviewID": "R28E86ZX03MUU7", "Overall": "5.0", "Content": "I have now owned all three Kindle Fires.  The HDX is great as many of the other reviews have stated.  Netflix works wonderful, prime streaming and downloads work great, and one of the best parts is that it works great with Calibre.  I bought the 64 so I  wouldn't have to worry about space for music, books and Apps, once in a while a movie.", "Title": "Great!", "Date": "October 19, 2013"}, {"Author": "Ralph", "ReviewID": "R3VEM9XIPXUVNW", "Overall": "2.0", "Content": "This thing has real strengths - resolution, speed, light weight, seamless integration to Amazon content, a pretty good UI, price. Feels really solid and well built. Appstore relative scarcity is not an issue since you can easily sideload APKs if you have them. But...1. When first reading about the purple border \"feature\", I figured it was overblown or exaggerated and wouldn't be an issue. I mean, I have a gen 1 Paperwhite and the faint light blotches seem negligible to me. However, the bluish borders on my HDX are neither subtle nor negligible in size and you can bet I'd be unhappy about them even had I not heard about them first. It is really distracting on anything with a white background. I read at least 10 industry reviews prior to purchase and I didn't see this mentioned once (apparently it was an aside in one review I missed). I have to think this means there is some variance between units and I got a bad one, while the reviewers saw the best examples.2. There's also some non-trivial screen flicker, particularly when I'm in the Settings pages. It's as if it's trying to auto-adjust the brightness, but I have mine set to manual.3. This is minor one, but how can a device whose stated purpose is multimedia consumption not have a graphic equalizer built into the OS?I'll probably wait a bit to see how this all shakes out, but I'm sure I'll be exchanging/returning mine. I'd be completely happy if the screen issues were resolved.***************************************Edit 10/25: Just had an interesting chat with the very courteous Mayday rep \"Cody\". I asked him if the blue haze is supposed to be the same width along all edges of the screen of all Kindle HDX's, and he said yes. I then told him the haze was wider along the long edges of my screen, and he said he's heard that as well (oops). I then asked him if the haze is supposed to be the same width and brightness along each of those long edges (where it's most visible), and he said yes. When I told him that the haze is much wider/brighter along one long edge than the other - the bottom edge opposite the camera, he didn't have a whole lot to say (oops #2), other than this is not considered a defect that warrants a replacement. I then asked him if every HDX exhibits this to the the same degree, and he said, \"they're supposed to\". When I asked him if they actually are all the same, all he would say was to repeat that they're supposed to be.It might sound like I was being a jerk, but it really was just a calm discussion where I wanted those specific questions answered, and there was definitely some waffling on their part. And they are going to replace mine, due to the screen flicker. But if you call with just the haze issue, be prepared to return rather than replace. Who knows if my next will be any better - I hope so.", "Title": "I wanted to love you, but... it's not me, it's you", "Date": "October 24, 2013"}, {"Author": "Dawn R. Draiss \"dawn\"", "ReviewID": "R1X205B4XFTYES", "Overall": "1.0", "Content": "I was supposed to receive a $50.00 gift certificate with this purchase for a December/Christmas promotion.  I called about it once, was told it would arrive separately.  I waited patiently and called again.  This time I was told I only had 30 days and because time had run out (I wait until the Christmas customer service rage dissipated) and was told it was beyond 30 days and now they wouldn't honor it.  I have purchased Christmas/birthdays from Amazon for years but I will never make another amazon purchase.  VERY DISAPPOINTED!  CUSTOMER SERVICE LACKING!!!!", "Title": "TERRIBLE CUSTOMER SERVICE", "Date": "February 8, 2014"}, {"Author": "zeebo", "ReviewID": "R1NR3QX7XPFB7Y", "Overall": "1.0", "Content": "Please give me the two hours of my life back that I used trying to start my new Kindle Fire HDX.  I so much wanted to love this little device.  It started by not letting me register the Kindle.  Even though I put in my e-mail address associated with my AMAZON account and the proper password it refused to believe that I spent over $250.00 on this item and kept giving me error messages.  Kindle support kept making me shut it off and turn it on repeatedly as though that would help.  They were wrong when they predicted what I would see on the screen (do they think I make this stuff up?)  In short order...a waste of money and a definite waste of time.  I have dealt with many IRT service people through my work and other computers I have owned over the years.  None of them were as clueless and slow as the Kindle staff.  If I could rate this device with no stars I would.  Since I have to give it at least one star, there it is.", "Title": "Bad out of the box and customer service even worse!", "Date": "December 11, 2013"}, {"Author": "Joanna Grochulska", "ReviewID": "R2ZFHSOQ2K0627", "Overall": "2.0", "Content": "This 'improved' tablet has a very serious drawback - it is not really possible to use a HD TV to display the screen. The old, cheaper version, had a HDMI socket and it is really hard to understand why it is no longer available here. I strongly suspect that this is a ruse to force Amazon customers to buy an additional interface (if and when this will be offered). It is also baffling why the Miracast platform is chosen - not tested and rather not popular.", "Title": "HDMI connector", "Date": "November 26, 2013"}, {"Author": "Victoria Lemaire \"avid\"", "ReviewID": "R1EW6KW419CRC4", "Overall": "5.0", "Content": "I have a paperwhite and a previous first kindle.  I wanted a tablet that was workable and I could carry with me like my kindles.  I had purchased the large one that was not the HDX and had issues with games and the whole non supported adobe flash which is pitiful about adobe so I returned it totally frustrated and started looking at Google/android whom I also hate as all your personal content is put out on google for the world and unless you are skilled at turning off the tracking your stalkers can find you.. as ours did, but the more I looked at this product the more I wanted to give it a shot soooo I did.  I still can not play direct games on this through facebook and stopped being frustrated.  I've downloaded some TV shows and of course my books and a couple game applications and they work great.  I love the xray feature on the videos as that's how I found some of the music that I've also downloaded.  My only complaint is the glare on the screen its a killer outside and I even purchased a non glare screen protector so I gave up some screen clear quality for videos to be able to read outside but its still difficult in some sun.  Even tilting it.  I wish there was something that could be slipped on or off depending on inside or outside.  And the screen tilt turnaround confuses me as it starts up upside down then swings around the other way.  AND any case offered sucks.. I loathe the origami fold thing.. not all of us want to sit it up to watch and those stupid things flip flop every which way when you hand hold them.. I will keep looking.. But I love this Fire HDX!!", "Title": "absolutely love this", "Date": "May 14, 2014"}, {"Author": "Eliza", "ReviewID": "R2ZK8APGBGW2KW", "Overall": "5.0", "Content": "I love my Fire, I have an older fire but this allows me to view video's and the games are great on it. So far so good", "Title": "HDX", "Date": "May 14, 2014"}, {"Author": "Barbara Dagostino", "ReviewID": "R2P4HO2Q0J3GB0", "Overall": "5.0", "Content": "This Kindle is great.  I bought it for my 8 year old grandson.  He plays it everyday.  Color is fantastic.  Sound is loud and clear.  We love this one.", "Title": "Kindle Fire HDX", "Date": "May 14, 2014"}, {"Author": "Tink", "ReviewID": "R3VMU5O5AYY9H8", "Overall": "5.0", "Content": "This was a gift and the person loves it.  They had been thinking about buying it, which I was unaware of, when I decided to purchase it for them.", "Title": "Gift", "Date": "May 14, 2014"}, {"Author": "Robert G  Rowland", "ReviewID": "R1BXWSTWGBAGF4", "Overall": "5.0", "Content": "Great device I love it only thing I have to learn how to take a photo of another person instead of me", "Title": "Take a photo", "Date": "May 13, 2014"}, {"Author": "jijiferjones", "ReviewID": "R7YYMHCVXJ2I9", "Overall": "4.0", "Content": "I had the 2nd gen Kindle Reader before this and when it broke, Amazon was offering a deal to buy a kindle fire on payments and so I got one. I use this more for watching tv/movies while at the gym more than anything else. Well I play tetris blitz alot too.  But it seems to run out of battery quick doing those things and then is slow to charge (like 5+ hours).  Also really hate the slim firewire charge cord. In the dark it's IMPOSSIBLE to find the charger hole and then it fits both ways (the right way and the wrong way), easily the worst design for a charger ever! so I do like the Fire but I did want more batter life and way to charge faster.", "Title": "wish it didn't take so long to charge", "Date": "May 12, 2014"}, {"Author": "Amazon Customer \"charlene\"", "ReviewID": "R3PMA75GWLNZOT", "Overall": "4.0", "Content": "I am very disappointed that the kindle, while Android based, does not have Google Play.  Some of my favorite apps are either not on Amazon, or at older versions.  Google Maps is also not available.  I have no problem with Amazon having their own store, but it really sucks to have such a nice device handicapped by not supporting standard Android features.  Before you buy, check to see if your favorite apps are on Amazon, or you may be disappointed.", "Title": "doesn't support Google Play (boo!)", "Date": "May 11, 2014"}, {"Author": "DFiore", "ReviewID": "R2ML92MSUV6CI5", "Overall": "4.0", "Content": "The Display is nice and I can read and watch movies with no issues. The only problem I have run across is the power supply runs out, unless you leave it plugged in all the time. If you read one day, and come back a few days later, it seems the power is very low, unless you leave it plugged in.", "Title": "Seems to be working fine", "Date": "May 10, 2014"}, {"Author": "Alex Brikoff", "ReviewID": "R1WS62ZQ2ZSA6X", "Overall": "5.0", "Content": "I love it!  It's a great tablet and is just what I wanted.  Now besides having a tablet, I also have a Kindle reader.", "Title": "Kindle Fire HDX", "Date": "May 10, 2014"}, {"Author": "alicia reynolds-minear", "ReviewID": "R24JVY0WI2ONG2", "Overall": "5.0", "Content": "I am an apple fan.  own multiple devices.  I just love this little kindle. so light.  Great for traveling.  Just need email and some entertainment.  slips into my purse.  Can't wait to try downloading movie content for long haul flights.  leaving some of my other devices at home in favor of this tablet.highly recommend as perfect little tablet.", "Title": "wow.  what a great little tablet", "Date": "May 8, 2014"}, {"Author": "Lakeside Listener", "ReviewID": "R3T31L5FGILWT7", "Overall": "5.0", "Content": "My wife didn't expect to love this lite do-anything handheld, but she does. She's addicted to the Scrabble game, for one thing. But more importantly, she has a street dog rescue and needs to keep dogs' veterinary treatments and milestones straight. When she's out at her weekly Petco Unleashed adoption event, she no longer needs to rely on scattered paper records; she just keep it inside \"Yuri,\" as she calls it for reasons known only to her. Secondly, she grew up with a deaf sister and now she teaches people in her church to speak sign so they can communicate with the deaf, of whom there are many in the area where we live. She uses Yuri to show people the correct way to make signs - and she keeps track of various people's level of fluency using the HDX as well. It has turned a lot of guesswork, lost paperwork, and frustrating attempts to show signs clearly with arthritis-bedeviled hands into yesterday's problems. And then there's that Scrabble game....", "Title": "Bought for my wife", "Date": "May 8, 2014"}, {"Author": "Gyorgy Nagy Jr.", "ReviewID": "R3VFPT1IVD7R47", "Overall": "4.0", "Content": "Almost everything about this kindle fire HDX is great. I especially like the fact that it has true stereo sound, unlike the 1st and 2ndGen. Kindle fire which had both speakers on the same channel, even with headphones. The touchscreen occasionally freezes momentarily, and sometimes when scrolling through titles in the kindle store it jumps back to the beginning of the list I'm scrolling through. I just wish the controls on the audiobook player worked more like the ones on the old kindle keyboard model. Maybe they can change that in a software update", "Title": "great but the audiobook controls should be more like kindle keyboard's", "Date": "May 7, 2014"}, {"Author": "diane", "ReviewID": "R1GFD3BMXXGL4K", "Overall": "5.0", "Content": "Small learning curve but great product. Clear screen ,great color ,easy to read in dim light. Would buy this product again.", "Title": "Great Tablet", "Date": "May 7, 2014"}, {"Author": "PJ EASTWOOD", "ReviewID": "RC80V4AIXXV4T", "Overall": "2.0", "Content": "One of the main reasons I bought a Kindle rather than a Samsung is that I have Amazon Prime and wanted to be able to watch my Prime TV shows that I've been watching on my laptop. Unfortunately when I try it with the Kindle I get an error message telling me that I can't do that on this device and I need to buy a Kindle!Called Tech Support and after about 30 minutes of trying to trouble shoot it I was told that this had to be referred to the IT Department and they'd call me back within 48 hours. That was almost 2 weeks ago and I still can't watch my Prime TV.Can't listen to my Audible (an amazon company) audiobooks either because Audible (an amazon company) Manager won't recognize my Kindle. And the Kindle won't recognize that I have an Audible (an amazon company) account. It keeps trying to get me to open a new Audible (an amazon company) account. Yes, I am trying to keep my sense of humor intact even though I find this very aggravating.Everything I've tried to do with this has been a struggle, even watching videos that are posted on my FB page. I could read posts, but if someone included a video in their post, i couldn't view it. Had to download a different browser and a special FB app to be able to do that.I still carry it with me everywhere, but most of the time I don't even bother to try to use it. I'm hoping that eventually Tech Support will figure out why the things I bought it for don't work. If they do, I'll give them a better review. Right now, I'm sorry I bought it.", "Title": "So far, not so good", "Date": "May 5, 2014"}, {"Author": "D. Aten \"daten18\"", "ReviewID": "R30O444J3JOWXW", "Overall": "4.0", "Content": "Fonts for reading books can be adjusted.  Fonts for menus, collections, etc., cannot be adjusted and are so small I can hardly read them.  The page numbers and % read at the bottom of the pages in books is almost impossible to read they are so small and so pale.  Why can't they be black like the print for the books?It took me awhile to get the lighting and fonts adjusted so that I could read books on my Kindle Fire HDX - I had been using a Kindle Paperwhite (both generations).  I do prefer reading books on the Paperwhite, but like all the other features on the HDX so I've mostly converted to reading all books on the HDX.  I also had to buy a non-glare screen protection before I could use my HDX.  Before that it was really hard to read because of the glare.I really hope that a future upgrade will include increasing the size of fonts for menus.", "Title": "Fonts too small . . .", "Date": "May 5, 2014"}, {"Author": "Rossco", "ReviewID": "R3SKY5T47FJ8JT", "Overall": "3.0", "Content": "The Kindle fire HDX is a useful device the graphics are brilliant and the shop is easy to use but outside of America you can't download any of the movies or other content except the books from Amazon prime which is a bit ridiculous in this era.Amazon should improve there services to Kindle users outside of the US.", "Title": "disappointing", "Date": "May 4, 2014"}, {"Author": "762x51", "ReviewID": "R38MVIRFU7LVLU", "Overall": "3.0", "Content": "I received this yesterday and my initial impression was that it's a great product. I still think that, and would have given it 5 stars, --- but --- Amazon's locking out APP downloads from any site but the Amazon App store is totally nuts! I guess Amazon took a page from Apple's playbook!!Why would Amazon do this if they want to sell a useful device? Amazon, look - It's an Android device!Allow USERS to decide how it's to be used, not some \"suit\" or geek in a closet!", "Title": "Cannot Download Apps From Any Site But Amazon", "Date": "March 30, 2014"}, {"Author": "Otilio Nadal", "ReviewID": "R16WIBNMZHB6LI", "Overall": "5.0", "Content": "I had a kindle fire for about a year and enjoyed using on my trip. then a few weeks ago the nit would not go and not charged. I called kindle support and the  person on the phone walked me trough a trouble shooting to no avail. He informed he would send a new unit and i received it within a few day. I was very impressed with the way I was treated.", "Title": "I would recoment dealing with Amazon", "Date": "March 29, 2014"}, {"Author": "Isabel laura Cuevas", "ReviewID": "R25HJCQS3FM1TT", "Overall": "3.0", "Content": "Good but I can't customize it or get Adobe at all I really need that at times so please bring these options back on next update.", "Title": "needed", "Date": "January 28, 2014"}, {"Author": "La Sierra Lanes", "ReviewID": "R3ITHFIOMDLEV8", "Overall": "1.0", "Content": "I do not care for this product.  It was a gift that I wish I had returned unopened.  SILK is to unlike any web browser that I have used on a computer.  Touch screen too difficult to use, should have come with a stylus as standard equipment.  Would not recommend this product to anyone that I think of as a friend.  Likely to cause the friend to wonder why I suddenly disliked them.", "Title": "kindle fire evaluation", "Date": "January 28, 2014"}, {"Author": "F. Trinidad", "ReviewID": "R35UQ7PM14ECXJ", "Overall": "3.0", "Content": "Graphics is outstanding, well built, size and weight is just right. However there seems to be a bug  in its operating system. Immediately noticed while playing candy crash that game freezes, it just stopped. This happened with other apps too. I have to turn off the tablet to start again. Turning off the tablet means pressing the power button for 10-15 seconds. Did not bother for tech support, something is'nt right, this tablet is defective. Returned the tablet immediately. Amazon was  great in processing my return.", "Title": "Good Looking But ........", "Date": "January 28, 2014"}, {"Author": "Darla Redmond", "ReviewID": "R1FVXS5D3YCS5P", "Overall": "1.0", "Content": "This is my second Kindle fire. And second time the Kindle has stopped working. After only a month of use, it no longer turns on. Since this is the second bad Kindle I no longer want to have a Kindle.", "Title": "Problems with Kindle.", "Date": "January 28, 2014"}, {"Author": "Jay Gilliss", "ReviewID": "RQJDFM066C6C1", "Overall": "1.0", "Content": "My kindle fire HD is great when i can get it to connect to my wifi, my other kindles stay connected but the HD dosen't", "Title": "wifi", "Date": "January 28, 2014"}, {"Author": "Sheldon C.", "ReviewID": "R1UC26TNS82HX1", "Overall": "2.0", "Content": "Yes, there's ample info out there about how kindle doesn't work with google play. Unfortunately for me, in my ignorance, I bought this as my first tablet. Shame on me. Even though the display, speed and instant support are laudable, I wish I'd bought the galaxy tab (which I ended up getting afterwards). It's much better in terms of apps and the display and speed are good enough for me. It can access all the amazon shopping and apps too (but not the limited amazon instant video like kindle can, but no big loss). Too bad the kindle doesn't reciprocate like most of rest of the anroid world. Untill it does, I wouldn't reccomend any kindle to anybody unless they only use amazon.", "Title": "Galaxy tab is way better", "Date": "January 27, 2014"}, {"Author": "Jill Payne", "ReviewID": "ROGKA3AOPPHKE", "Overall": "5.0", "Content": "This is my second kindle. Hv paper white and now Hv Kindle hdx. I also own a very  over priced android tabket. The Kindle is the best tablet. Leaves the other over priced  tablet in the dust.  The.battery life is great. It's a very sweet tablet. I Hv the best 0f both worlds. A book read or and all the other perks that the Kindle has to offer.", "Title": "The Best Tablet.", "Date": "January 26, 2014"}, {"Author": "paul voss", "ReviewID": "R1SG7PZO1K8RVZ", "Overall": "5.0", "Content": "I  like it but have to get use to it and how to use it.  I am a slow learner", "Title": "how do i like it", "Date": "January 26, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2G77CTMJ7REQP", "Overall": "5.0", "Content": "I hadn't read anything since high school. I bought the Kindle as a Christmas gift to myself and I love it. I've purchased several books and read many within a few weeks after buying it. It's basically a tablet when it comes to apps as well. Great product. I take it everywhere I go. very clear resolution. Never slows down.", "Title": "LOVE", "Date": "January 26, 2014"}, {"Author": "Dia", "ReviewID": "R2SAXYDQHHWVV1", "Overall": "4.0", "Content": "I like to watch quilting youtube videos and they play beautifully.  I enjoy playing a couple of games on it.  It connects to WI FI ok wherever I go.  The youtube videos play nicely once I figured out how to enable the javascript.  Enjoy the games when I have to pass the time.  It is addictive.", "Title": "Its Nice.  It does not replace a laptop.", "Date": "January 26, 2014"}, {"Author": "Twug \"Poet\"", "ReviewID": "R350T5LR9PKLUS", "Overall": "5.0", "Content": "My 1st Generation Kindle has served me well, but it was time for an upgrade.  This Fire?  It is a wonderful device.  I am not the most adept at technology, but I am learning as I go!  It would help to have a little starting knowledge, as it can be a bit overwhelming.  The display is crisp and beautiful.  It's slim and lightweight.  I was a little surprised that it didn't come with some sort of case, but that is not any reason to short this a star.  My 1st Generation's case will do for now.  I've only had it for a few days, but if my earlier Kindle's longevity is any indication as to how long these devices last, I look forward to at least five years of use or more.", "Title": "Kindle Fan", "Date": "January 26, 2014"}, {"Author": "Happy Mama", "ReviewID": "R21IYUAN88SGH0", "Overall": "5.0", "Content": "This is my first tablet and I am so glad I chose this one!  Small enough to fit in my purse and does everything I need it to.... very fast connection.  happy! happy! happy!", "Title": "love my HDX!", "Date": "January 26, 2014"}, {"Author": "David C Mohr", "ReviewID": "R278PDE8QY46MT", "Overall": "5.0", "Content": "The quality of system response and video quality are exceptional.  You won't be disappointed at this price point.  Get Amazon Prime also.", "Title": "Love it!", "Date": "January 26, 2014"}, {"Author": "Clipityclop", "ReviewID": "R1VX0U85BLEWZS", "Overall": "5.0", "Content": "Purchased two of the 7\" kindles as presents for grand children. They are both very happy with them. I am glad I got them.", "Title": "Gift Kindle Fire HDX", "Date": "January 26, 2014"}, {"Author": "Ricky G", "ReviewID": "R1ISX44R6ZPAS3", "Overall": "5.0", "Content": "Nothing at this time...have not used it enough to give an honest opinion, but as of Xmas, it has been great", "Title": "So far so good...", "Date": "January 26, 2014"}, {"Author": "greg", "ReviewID": "RKBD0ZO4SGUKG", "Overall": "5.0", "Content": "iPad user since launch day so the Kindle seemed to be a cheap replica.  I love this device.  It's easy to use and has a fantastic quality.", "Title": "Excellent purchase", "Date": "January 26, 2014"}, {"Author": "Sandra Blickhan", "ReviewID": "R32VZIYV65ZZ2Q", "Overall": "5.0", "Content": "I love my Kindle Fire! It is the best gift hubby has ever gotten me! It's easy to use, nice and bright, just perfect. I can surf the Web or read a book. It's just great!", "Title": "Kindle Fire", "Date": "January 25, 2014"}, {"Author": "Traci L", "ReviewID": "R21OB4T7CXF7ZL", "Overall": "5.0", "Content": "I purchased it for reading  mainly, then realized how fabulous it was to use the touch screen that reacts so fast and is so clear.  Know I hardly want to go and sit at my computer, I can do everything from anywhere in the house, except type a letter, and perhaps  you can do that to and I haven't even found out yet.  All the apps, it's incredible.", "Title": "Worth every cent", "Date": "January 25, 2014"}, {"Author": "acidburn_9779", "ReviewID": "R30Y5IL1E2XZYP", "Overall": "4.0", "Content": "This kindle is great. Has all the things I wanted out of a tablet. Amazing graffics. Outstanding speakers. Amazing battery life. Only bad thing is how long it takes to charge back up.", "Title": "Must have", "Date": "December 22, 2013"}, {"Author": "MidwestMama22", "ReviewID": "RV7BXDHCEA0VF", "Overall": "5.0", "Content": "I am really enjoying my first tablet, the new Kindle Fire HDX, as are my kids! I hadn't used a tablet before so I checked out a number of models and brands in the stores, and read many reviews before deciding on this purchase. I have been using Amazon Prime for many months for the shipping; and the added benefits with the videos was a draw for me since I had no intention of spending much on content for a tablet. The picture is so clear and bright, significantly better than our tv or phones. The wifi connects quickly to our home network. Downloads are quick, though I usually order the content on my laptop and it shows up immediately. I'm sure I haven't yet used all the features but I love everything about the Kindle Fire HDX so far and I can hardly keep my kids off of it!", "Title": "Kindle Fire HDX is Awesome!", "Date": "December 22, 2013"}, {"Author": "j Rock", "ReviewID": "R27TN5IIVZ30G9", "Overall": "4.0", "Content": "So far so good. Very happy with my purchase of the Kindle HDX. I shopped around before buying it and found it was the best out there. Great for everything you can use it for. I tried one out at Staples and at first, the video on the demo model was kinda lacking. I still bought my HDX via Amazon though. When I received it, on time btw, I was pleasantly surprised. The video quality was awesome. It was the video that they had on the demo model that was crap. Yes the new HDX models have that blue border when reading books. The solution to that is changing the background color to back with white letters. If there is one thing negative I can say about this particular model its the size. While using it to browse the web, I realized maybe the 8.9 model would be a touch better just bc it is bigger. But if you are used to using a cell phone to browse the web then its not really an issue bc u would be used to swiping around a web page. And one more thing. Why not put a second camera on this thing like the 8.9? That would make more sense. That would make the HDX 7 awesome! IMO, the only choice you have to make is which HDX to buy. Forget the other tablets. They are either too pricey for what u get or don't have enough processing power or memory.", "Title": "Good product.", "Date": "December 21, 2013"}, {"Author": "E. Rhodes \"Liz\"", "ReviewID": "R3EYOJ2BBI0V2Q", "Overall": "5.0", "Content": "It does everything I need, and I can DL documents (yes, Word documents!) and view and edit them on my Kindle...with the installation of a simple and inexpensive app.  I am amazed at how powerful and robust this product is.  Compared to all of the other similar products out there, this one is the best by far for the money!", "Title": "Best deal on the market!!!!", "Date": "December 21, 2013"}, {"Author": "Richard Stampfle \"Richard S.\"", "ReviewID": "RQ5XUEPOR5D4F", "Overall": "5.0", "Content": "When asked which book most people would take with them to the loneliest place in the world, the answer is often The Bible. For me the only book I will ever need anywhere is this Kindle Fire HDX. Like so many other Kindle users this is a device that I would not want to do without. I love it! From here in Thailand this afternoon I used the MAYDAY feature for the first time. Within minutes I was connected with the friendliest operator and tech rep I had ever talked to and before the conversation was over my small technical problem was solved.If there were a place to rate AMAZON customer service, I would give it TEN STARS. These folks are the heart of the Amazon organization. Well done Amazon on the Kindle Fire HDX and on your customer service.", "Title": "The best kindle yet", "Date": "December 21, 2013"}, {"Author": "T. Law", "ReviewID": "R2NGNMMBYCZCU3", "Overall": "3.0", "Content": "I really wanted to give this a try because of the form factor. I have had a full size iPad since it came out, I currently own the third generation with 4G service. But, every since the iPad Mini came out, I've been looking for a smaller more portable tablet to carry around. Since half of my media contents are purchased from Amazon, I thought it was time to look at the Kindle HDX, the only non-Apple tablet I would consider because of the specs and size.I was not disappointed with the size, both dimensions and weight. The tablet was easy to hold and I actually found the placement of the buttons in the back easy to get used to and use. I did notice the blue haze around the screen, but that did not both me.The reasons why I returned my unit were:1. I can only access half of the media I owned. The other half is on iTunes.2. The browser kept crashing on me and would not work on a few sites I frequent.3. The Amazon App Store is really limited in quantity and quality.Besides, if I buy an iPad Mini, I could access all my iTunes and Amazon media. So, I returned my Kindle.", "Title": "Perfect for Amazon Contents", "Date": "December 20, 2013"}, {"Author": "Colby D. May", "ReviewID": "R2AQU6NH2GG4A5", "Overall": "5.0", "Content": "I just received the seven-inch Amazon Kindle Fire HDX (64 GB, Wi-Fi, Includes Special Offers) today and have been using it now for about four hours. This review will evolve as I continue to use the device, but my initial impressions are...this is a fantastic device for the money.I still own a first-generation Kindle Fire whose stock OS and user experience were so bad I had to eventually root it and install stock Android Jelly Bean on it to make it usable. That Amazon has progressed from that to this in two years' time is remarkable.If you're worried about value, don't: just buy one if you think you want one (that's kind of a quote from a photography expert who has a blog and reviews a lot of gear). The value for the money here is incredible.Here are my pros and cons, which I will expand upon as I return to this review and update it periodically as I do more with the HDX.PROS:+ The screen. I've been trying to get an hour's worth of work done at the office, but I just can't take my eyes off the display. It is gorgeous, bright, sharp, accurate. Everything the pro reviewers have said about this display is true, but it doesn't prepare you for the actual first glimpse. It's an awesome panel.+ The sound. I fired up \"Smokey and the Bandit\" and was perplexed by the quality and volume of sound coming from the seemingly tiny speakers on the back of the device. Despite their location, it seems like the sound is coming right out of the screen. The engineers knocked a homerun here. Unless you're practicing privacy, headphones or external speakers are not essential.+ The design. The tapered edges give the device an ultra-slim appearance when viewed from most angles from the front side of the device, yet the body has sufficient thickness to be gripped and held easily. When the screen is off, it is very difficult to see the screen's location within the bezel...like a solid sheet of black. It is well-built, but it is light. And it's balanced well--I'm using an old Incipio stand originally designed for a Galaxy Nexus phone with the HDX, and it's perfectly stable and solid.+ Ease of use and setup. Within five minutes of unboxing, the device was ready for use, and that included downloading an OS update, setting up two email accounts, a Facebook account and a Twitter account. Amazon's ability to pre-register the device prior to shipping is huge.CONS- Blue screen edges. Most of the time they're not distracting, and I understand that they're \"necessary\" given the fact Amazon chose to use blue LED's to illuminate the screen and ensure close-to-100% color accuracy. But when browsing webpages or reading books, at my present stage of HDX enjoyment, they are a bit of a distraction. I'm hoping I get used to them. (10:56 AM, 12/23/13)- Amazon's app ecosystem. This is not a knock on the device but rather an indictment of Amazon's app store. But my hunch is that with the HDX devices developers will get cracking on making the freshest versions of apps available for Kindle Fire devices sooner and in greater quantity. Specifically, Spotify is ages old compared to the current versions available for iOS and Android, and more seriously crippling is the fact that the version Amazon offers does not support Spotify's new free-listening initiatives for mobile devices and tablets. Let's hope this improves soon.More to come...but again, this device at the price Amazon is asking is simply a no-brainer. Just buy it and enjoy it!", "Title": "What an incredible improvement in just two years' time", "Date": "December 20, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R17ZU1G31XR4Y8", "Overall": "5.0", "Content": "I really love the super sharp high definition on the new Fire HDX.  Although I originally considered purchasing it as a book and magazine reader, I am stunned by the quality of the video!  The picture is even sharper than my 1080P HDTV.  I have started using it to watch television programs and movies, more than for anything else. Great job Kindle!", "Title": "HDX for Sure!", "Date": "December 19, 2013"}, {"Author": "C. Leese", "ReviewID": "R1MQTEX409MY5C", "Overall": "5.0", "Content": "This is my first Tablet and I purchased this because of the 4 payment plan offered by Amazon.  I am still learning my way around and will update this review later with more information.  The display is amazingly clear HD and watching movies is a snap, as long as you use Amazon!  I haven't tried Netflix yet, but so far the Amazon selection seems to be fine.  The only peeve I have is that there is no manual included to help the purchaser with mundane things like transferring calendars and address books.", "Title": "A very nice pseudo computer tablet.", "Date": "December 19, 2013"}, {"Author": "T. Baca \"happy mommy\"", "ReviewID": "RTV91WXMRQCC0", "Overall": "4.0", "Content": "A Kindle was not even on my list of possible tablets to get. I was interested in the Samsung Note 8 (played with for a little bit at Best Buy). But Amazon offered me a 30-day free trial with a Kindle of my choice and I found that this was too tempting to pass up! Being an Amazon Prime member is awesome and it's truly the best way to get the full Kindle HDX experience! My 30-days are almost up and I plan on keeping my Kindle HDX. Here are my reasons why:1. MayDay. How awesome is this! I used this feature because I was having issues with one of my apps. The attendant came up as soon as soon as I pressed connect and was very patient and understanding while I was trying to explain my issue. Eventually I did have to get on the phone and speak with someone else but the attendant stay with me even while I was discussing my problem with the rep to make sure the rep understood what the issue was. This is by far the best thing about this device hands down!2. Amazon Prime. If you are a Prime member then you already know that you can get free movies and shows but if you have a Kindle device you can also get free books through the lending library (this was new to me!) and there are a tones of books to choose from. Going back to the movies and shows, I like that I have the option of downloading them onto my Kindle for travel (great feature for kids!) or going places where I know I won’t have access to Wi-Fi.3. Shopping experience. I shop a lot through Amazon (which is why I am a Prime member) and this device just makes it incredibly easy to do just that. I think the Amazon coin option for purchasing apps is a great idea and have used them on a few apps for my kids.The only down sides of the Kindle for me are:1. There’s no true YouTube app. I love YouTube and watch it pretty regularly. There are ones available in the kindle store but the best one I found so far (vTube?) doesn’t quite function the same as the Google app on my iPhone. You have option of viewing YouTube through the Silk browser but a dedicated app that functioned more like (or better than!) the Google app would be ideal.2. You can’t customize your home screen. You have this huge carousel thing at the top of the tablet’s home screen and some (random?) apps that are at the bottom. I would like the option of at least customizing this screen since it’s the first thing I see when the tablet unlocks.3. The ads are annoying. I wanted to see how I would respond to having the ads on the tablet to know if it was worth spending the extra $15 dollars to have them taken off. It is! It’s annoying! My kids have seen some ads geared towards kids and ask for the stuff! We watch Netflix, Amazon, and ITunes content exclusively specifically to avoid advertisements and this has reminded me why we do! Pay the $15!For the price and all the extras you get with being a Prime member, keeping the Kindle HDX is a no brainer for me!", "Title": "Never knew I would like it so much!", "Date": "December 19, 2013"}, {"Author": "Mike Ferdman", "ReviewID": "R2OBD7EUTD9AU2", "Overall": "5.0", "Content": "The HDX 7 is great! But don't buy the newest ones. I have several Kindles in the family and was set to buy the newest one on Cyber Monday. That is when I discovered you now have to pay extra to remove the advertising from your screensaver. the whole concept of paying for a machine that has advertising on it is beyond my comprehension. That Amazon wants you to pay to remove it means they have lost touch with reality. I've been in love with Amazon and Prime for years and spend a ton with them. But this new move sounds like they have gone Microsoft. I'll find a new vendor.", "Title": "They were great but now...", "Date": "December 2, 2013"}, {"Author": "Matthew Flesch", "ReviewID": "R3GEAXPHH8ICLB", "Overall": "3.0", "Content": "So close......I bought the original Fire excited to have a media consumption device.  I wanted something that would support all the apps I had with my iphone, but be able to have a larger screen and a bit more functionality with out dragging out the laptop.....something more portable.  As with the original Kindle, the screen is great, videos awesome, my SOOOOO lacking on the app front.  I was hoping this would have improved with the new Fire HDX.  Unfortunately, it has not for me.Pros:Beautiful screenAmazon Prime Instant Video (As long as you're close to wifi).Snappy PerformanceSilk (web browser) works pretty well.Mayday or live help button.  VERY COOL!Cons:App store.  Why oh why can you not give access to the android store??  Know that you will not have access to this like othertablets.  You only have access to kindle fire specific apps.  Games I am used to playing on my iphone like clash of clans are not available.  No ESPN fantasy football app?  Really?Some apps do not work well...had issues with The Weather Ch app....I would think that would be a popular app, no?Wireless is finickyBattery drains quickly16GB version is not large enough to save 1 1080HDmovie....not 1.Going to go price out a surface instead.", "Title": "Eh...not impressed", "Date": "December 8, 2013"}, {"Author": "GailK", "ReviewID": "R3E7UDRITICHTX", "Overall": "3.0", "Content": "Wow, what a great piece of hardware.  It feels great to hold, fast and beautiful.  Until you try to do all the things you're used to doing on your other Android devices, or even your iDevice.  Maps?  Nope.  We don't need no steenking maps.  Gmail? No app for that.  YouTube?  No, sorry.  Yes, you can access these services through the webpages but c'mon...get over this... competition? pissing match?... whatever it is with Google and get the apps a lot of people want on the device.  They released devices with gps chips....and no mapping software.  I used my iPad all the time for geocaching, saving tracks, as a chartplotter, as a gps, you name it.  When I saw the Kindle Fire HDX had gps FINALLY (for an extra $150 for the cellular version) I jumped on it and even  sold my ipad.  I was that ready to bail off the good ship Apple.  Well, guess what...I just bought another iPad.  :-(  Three things I do most often on my tablet is 1. GPS apps 2. Email and 3. Web browsing.  Two of the three are more difficult or impossible on the HDX.  Reading is a distant 4th...I have a Kindle KB too.Another thing I was all excited about was getting a BT OBD2 scanner and using the great Torque app on my HDX.  Nope.  Half of the best Android apps are not in the Amazon Appstore.  Yeah, I guess I can get it from Google Play and sideload it, but I'm sure Amazon has the BT function crippled so it won't work anyway.If your primary purpose in a tablet is to buy Amazon books and play Angry Birds you're all set.  If you want some other functions you should probably look elsewhere.I really, really want to love this thing....I love the screen, the feel, the interface...I don't even wanna send it back even though it doesn't do most of what I wanted.  Sigh.....but back it must go.  $400+ for Angry Birds just isn't cutting it.", "Title": "Could be so great...it makes me want to cry that it's so crippled....", "Date": "December 3, 2013"}, {"Author": "DEW", "ReviewID": "R3TTWAJ52W9W0K", "Overall": "3.0", "Content": "My HDX was an upgrade to my kindle fire which gave me first class service it went with me every where and I spent many other wise boring hours either reading or connecting to an airport free wi fi. However I thought I might treat myself to an upgrade so I thought the HDX would fit the bill.I purchased it from amazon.com whilst in the states as I spend a lot of time there. I didn't start to use my HDX until I returned to the the U.K as I still had my trusted fire.I purchased a new protective cover for it as it was obviously different from the fire. Unbeknowing to me at the time the cover had the ability to shut down the HDX when either folded back or closed. Many annoying and frustrating conversation with customer services and three HDXs later I just happened to read an advertisement on a similar cover to mine that had this facility. Mystery solved I was a little surprised that Amazon had not encountered or were aware of this problem.Also another niggling problem arose when adobe flashplayer tried to download its updated version I knew that Amazon did not support the flash player but this did.not stop it from preventing me from gaining access to the web. It took a few days for a very supportive customer service chap from Ireland to sort out the problem.  But I cannot help feeling that the HDX should never have been subjected to that type of interference.So on that basis I have only given it three stars.", "Title": "not my fisrt hdx", "Date": "May 14, 2014"}, {"Author": "Jaime J. Cagigas", "ReviewID": "RML53E2T5HXCU", "Overall": "5.0", "Content": "The device is everything I hoped for.  There are bells and whistles I may never use but my previous Kindle Fire was on its last leg so up grading to the HDX was the right thing to do.", "Title": "KF HDX", "Date": "May 14, 2014"}, {"Author": "Bike", "ReviewID": "R3F8JPU8MLAGS7", "Overall": "5.0", "Content": "love my Kindle, very happy with my purchase. Great for watching movies and surfing the web. I had no problems with the battery.", "Title": "Kindle HDX", "Date": "May 13, 2014"}, {"Author": "S. L. Moore \"shemoo\"", "ReviewID": "R1D1NWH9XOXO1P", "Overall": "4.0", "Content": "I have the Kindle fire and really  liked it.  It is a great e reader but also a so so tablet.  I purchased the Kindle Fire HDX after much thought.  It is still a great e reader, I like that you can have the book read if you prefer (that option was not available on the Kindle Fire).  I am not sure what use the camera on the front is, unless you like to take selfies holding what amounts to a book in front of you.  A camera on the back would be much preferable.  It is lighter weight and I like the on off button on the back.  It does not have an indicator light to show when it is charging which is unfortunate as the plug in is at an angle and a little hard to use.  I have never had a tablet so I can not tell you how this compares but I suspect that a real tablet with the amazon reader download would be better for web browsing etc.  Overall if you want an e reader that can also be used as a tablet on occasion then this would work for you as it works for me.", "Title": "Great Ereader, ok as a tablet", "Date": "May 13, 2014"}, {"Author": "Justin Wollenberg", "ReviewID": "R123QZX1TCZZAN", "Overall": "4.0", "Content": "I bought this for my wife for Mother's Day. It does exactly what we need: email, internet, YouTube. It's got a front facing camera that we've not tried yet, but will later for Skype. Image is very good. We're still shopping for a case. She loves it.", "Title": "Great Mother's Day Gift", "Date": "May 13, 2014"}, {"Author": "Roy T. Eby", "ReviewID": "R1YUFAZ0YLL83Q", "Overall": "3.0", "Content": "My Kindle is OK with limitations.  It shuts off without warning.  Then it comes back on slowly with the symbol \"KINDLE FIRE.  It does not go back to where I was reading.  I have trouble making the page number visible. I have trouble making labels visible when I swipe the surface.  Other than those things it is quite good.  I have not been offered any organized tutorials.", "Title": "Good with reservations", "Date": "May 13, 2014"}, {"Author": "jessica", "ReviewID": "R1KI2E3MT8SIDS", "Overall": "5.0", "Content": "I love this it's my fourth one! I bought a Samsung tablet  just to try something different and also because I love my Samsung Windows 8 phone ,but i ended up returning it for this!", "Title": "Love love love!! easy-to-use...", "Date": "May 13, 2014"}, {"Author": "PRISCILLA CONCEPCION", "ReviewID": "RIQPCASTCVUUO", "Overall": "5.0", "Content": "WAS A MOTHERS DAY GIFT FOR A FRIEND SHE LOVES IT. MIGHT GET MY SELF ONE. FAST SHIPPING AND WRAPPED GREAT.", "Title": "KINDLE", "Date": "May 13, 2014"}, {"Author": "Richard B.", "ReviewID": "R2U0B6MGEMWGOE", "Overall": "5.0", "Content": "Surfs the web / reads her books.She spends more time on this .... than anything else ... lolIt's a great little tablet ... how do I know this ... she tells me so  :-)", "Title": "My Daughter Loves It", "Date": "May 9, 2014"}, {"Author": "Peach", "ReviewID": "R31Y98PEQGC0XE", "Overall": "5.0", "Content": "This is our favorite thing! So much so that we are getting another one! Ordering a bigger one with a key boArd and a cover. Can't wait!", "Title": "love my kindle", "Date": "May 9, 2014"}, {"Author": "Philip G. Storms", "ReviewID": "RPEGAWBEDWS4E", "Overall": "5.0", "Content": "Had a problem with my first one -no microphone or speakers after one week...delivery for the first one took longer than expected because of mixup with the mail.....Problem solved with replacement of  HDX7 in a shorter than expected delivery time....all in all great service and the product appears to be good also.", "Title": "Great", "Date": "April 28, 2014"}, {"Author": "Amazon Customer \"Mac\"", "ReviewID": "R1XZFFBGV3VVBH", "Overall": "5.0", "Content": "Replaced my Kindle Paperwhite with the Kindle Fire HDX 7. This is a great upgrade as now I can have the  books read to me, which is the major upgrade for me. The screen color is great and the sound is out of this world compared to my android tablet. I will be receiving my third case tomorrow as I believe the sound will be further enhanced with the origami case. I hope the new case will not disappoint me.", "Title": "Fell in love with my Kindle Fire", "Date": "April 28, 2014"}, {"Author": "Marion Milavec", "ReviewID": "RWM1JPHJ9JN6B", "Overall": "5.0", "Content": "I can honestly say that there is not a thing I don't like about my new kindle.  This is my third kindle and they just keep getting better.The  ease of use is great. Super easy to set up. This is coming from someone that has had four strokes.", "Title": "Love it!", "Date": "April 28, 2014"}, {"Author": "Franco Moran", "ReviewID": "R2O80JK878RZPP", "Overall": "1.0", "Content": "I like the screen quality and the things you can do with it when the tablet works but thats about it.The web browser is slower than using 3g on my phone, I have tried multiple wifi spots and no luck, most of the apps freeze, it shuts down on its own, store has no variety, connecting to wifi is terrible.....", "Title": "You get what you pay for", "Date": "April 28, 2014"}, {"Author": "Richard T. Bearse", "ReviewID": "RE4A9G3C3RULS", "Overall": "5.0", "Content": "Got this for my wife when Pandigital went out of business shortly after she bought one to buy books from Barnes & Noble. Her Pandigital Novel eReader was VERY limited in what it could do and was TERRIBLE trying to get updates!The Kindle Fire 7\" HD is JUST what she was looking for!  Good work AMAZON!!!  Keep up the good work & PLEASE!!!!!  Don't be like Microsoft (Support this item with updates LONGER!!!)Rick Bearse", "Title": "Wife Loves IT!!", "Date": "April 28, 2014"}, {"Author": "Jimbo", "ReviewID": "R1343Z9L3FH7U1", "Overall": "5.0", "Content": "I purchased this item a few hours after breaking my first Kindle, because I could not live more than a few days without one!Previous purchase was two years ago, bought a Kindle Fire.  I expected to only use it as an e-reader, but it turned out to be one of our best electronic purchases ever.  That Kindle went with us to many interesting places over the years.  It's small enough to fit easily in a purse or a hotel safe, so it was our family's take-along device when traveling. With the reasonable price and small size, it was perfect for trips.  Free game apps keep the kids entertained on a rainy day of a beach vacation, not so expensive (compared to an iPad) that you worry about it being stolen when it's in the hotel room or broken while sneaking in one last roller coaster ride before heading to the Orlando airport.  The Acrobat Reader app allowed me to take hundreds of pages of work-related reading material with me to Europe without having the extra weight in my suitcase.  I read a lot, and my local library has thousands of books available to borrow for e-readers, a very nice supplement to the ones I've purchased for Kindle.  The untimely death of the previous Kindle was my fault: I dropped it, glass-side down, onto a ceramic tile floor and the glass shattered.  It's still working, but now in a plastic freezer bag so I don't get (more) glass shards in my fingertips.Now that I know what my Kindle needs are (50% reading, 50% apps and web surfing), I chose the Kindle Fire HDX 7\" as the replacement.  I  considered the iPad and iPad Mini, but this Kindle has more features and better resolution for a lower price.  I also looked at the larger Kindle Fire, but I really need my e-reader to fit in one hand, so the larger size is a disadvantage.  We own Apple products, so it's not like we avoid them, Kindle Fire HDX 7\" better suits my needs as an e-reader and tablet.Several things have been upgraded on this one compared to the earlier model.  My favorite is the ability to categorize books.  I have a pretty big library already on the cloud, still working on downloading and sorting through the books.  The screen resolution is better, not meaningful for reading but great in combination with Amazon Prime movies and apps.  I haven't had reason to use the camera yet, so no comments on that.  I also haven't tested the battery life on this one, but on the previous version I found that the battery lasted much longer when the wi-fi was turned off.I am very happy with this new Kindle.  The screen size allows great portability and it can be held in one hand, not too much bigger than a paperback.  Battery life is fine, screen resolution is beautiful  Available apps are great.  This time around I also purchased an Otterbox case, so I hope to not have another review to write anytime soon.", "Title": "My second Kindle", "Date": "April 26, 2014"}, {"Author": "joel a. roberts", "ReviewID": "RNXNJGMB3SINI", "Overall": "5.0", "Content": "Apps aplenty and everything easy enough to find. The greatest trick MAYDAY Support Team-BEST EVER. Would reccommend the Kindle to all", "Title": "KINDLE rocks. Easy to use and with MAYDAY support-all you don't understand will be walked through with/for you.", "Date": "April 26, 2014"}, {"Author": "Tim G", "ReviewID": "RTQ7YWQU41LAH", "Overall": "5.0", "Content": "Graphics and pictures displayed accurately, with high resolution.  Compact yet sturdy design. The Kindle Fire HDX user interface is easy to navigate and intuitive.", "Title": "Excellent display quality", "Date": "April 7, 2014"}, {"Author": "scott & Kimberly", "ReviewID": "RICU0FZ8X8RJA", "Overall": "4.0", "Content": "Easy to use and well worth the money. The only problem I am having is with it turning off and back on when ever it feels like it. It's done it a couple of times so far in the middle of reading a book.", "Title": "Love it!", "Date": "April 7, 2014"}, {"Author": "fgski", "ReviewID": "RAY35T554VJ35", "Overall": "5.0", "Content": "Bought this for my daughter and she absolutely loves it.  She carries it with her everywhere and is doing genealogy on it.  She watches movies and does more than I would do with it.", "Title": "Christmas Gift", "Date": "April 7, 2014"}, {"Author": "Laura Campanelli", "ReviewID": "R135DPWEE2S6MO", "Overall": "5.0", "Content": "I am enjoying reading on my new Kindle Fire HDX 7 and would definetly recommend it to anyone shopping for one.", "Title": "Love it!", "Date": "April 7, 2014"}, {"Author": "smokenjoe", "ReviewID": "R29XNE05Z02WKI", "Overall": "5.0", "Content": "Couldnt ask for anything more,except, wish it would be my desktop phone. Being on a ship I canRead any books I choose, check the weather, watch a movie, send e-mails, or just waste some timeWith a new game. Great picture quality, easy to use, just a great tool!", "Title": "Great Device!", "Date": "April 7, 2014"}, {"Author": "redrel", "ReviewID": "RHRBU784XR6GV", "Overall": "4.0", "Content": "this product is exactly what I was looking for in a notebook with the features that are also offered, really nice", "Title": "kindle fire hdx 7 display wi fi 16 gb", "Date": "April 6, 2014"}, {"Author": "Terry Foster", "ReviewID": "RDSWX1KKPSRU1", "Overall": "5.0", "Content": "I really love my Kindle. I PURCHASED 2 10\" generic tablets but I didn't like how they worked.Example: for the Candy Crush game you couldn't see the jellies.......with kindle colors are awesome.", "Title": "Kindle Fire", "Date": "April 6, 2014"}, {"Author": "Brenda L Venice", "ReviewID": "R1WOFPWNONNMJP", "Overall": "5.0", "Content": "I love it , fast and easy can do anything on the kindle it's the best.I do not leave the house with out it. I hate to say this but I had a nook and the kindle  is a better and improve item .  I also love the apps that you can download it's the greatest .You can not beat the price go for it you will love it.!!!!!!", "Title": "I love my new kindle", "Date": "April 6, 2014"}, {"Author": "Melani J Baysinger", "ReviewID": "R1IRNL5ANL4F2T", "Overall": "4.0", "Content": "My daughter has a Kindle Fire and the batter lasts a whole lot longer than my new Kindle Fire HDX.  I'm a little disappointed with that feature.  Other than that I am still trying to learn how to navigate around on it.  This is my first tablet and I am happy with what it does for now.", "Title": "Battery life is shorter than I expected it to be.", "Date": "April 6, 2014"}, {"Author": "JAM", "ReviewID": "R1GTJZKDTR8ILQ", "Overall": "5.0", "Content": "Love the Kindle.  I love the calendar, contact list, and books I can download.  The only problem is this particular Kindle cannot be read outside due to the glare...no screen is going to fix that.  So I guess I'll be reading my books inside or get an e-ink reader (cheaper kindle).  Wish there was also a storage device slot to access.", "Title": "Great Device", "Date": "April 6, 2014"}, {"Author": "Courtney", "ReviewID": "R33OBMFLSCQRPY", "Overall": "5.0", "Content": "I think this tablet is super nice! It's so sleek and so light to hold in your hands. I've had it for almost a month and I'm still so happy with it. The display is amazing and reading books is so nice with this tablet. If you shop on amazon all the time like I do, then you'll definitely love it!", "Title": "nice!", "Date": "March 12, 2014"}, {"Author": "aida m. sniegowski", "ReviewID": "R198QJIKW8RWTC", "Overall": "5.0", "Content": "This Kindle is just the right size to fit in my purse to take with me. It is easy to use and there are a lot of apps you can get.It is great for people who read and for those who want to play games, check on gas prices, email, weather.", "Title": "Just the right size", "Date": "March 12, 2014"}, {"Author": "Albert M. Carter", "ReviewID": "RI8PF3XCBIU0A", "Overall": "2.0", "Content": "Hi quality display for video streaming which works great until more than six or seven devices are on the network. When the kids show up with their iphones and laptops the kindle drops its connection every 15 minutes when the WPA-2 group handshake occurs. I can have as many other devices connected as I want, but the kindle will not stay connected when more than six or seven other devices connect. I keep my ipod, ipad, roku, and other devices off the network and the kindle works fine. I've had a service ticket open for months - wonder if they will ever have a fix?", "Title": "Wireless connection problem still unresolved", "Date": "March 11, 2014"}, {"Author": "bjarne martesen", "ReviewID": "R3P54867OHKL2G", "Overall": "4.0", "Content": "USB cable did not work for charging. Other than that the device is fine. Buying forigen languish books from europe works well.", "Title": "USB cable", "Date": "March 11, 2014"}, {"Author": "Biggi", "ReviewID": "RORU1S4UQ2WO", "Overall": "4.0", "Content": "Saved my money, bought my daughter an HD and myself and HDX for Christmas.Hers is still working though he volume is much quieter then that of the HDX version.Though I am not one to use a tablet for hours, I found it really easy to move around. I am sure there are still areas I have not explored yet nor know what to do. It will take some time to learn. Kindle is really a ease way to move around and learn.I owned a Nexxxus tablet before, gave it to my husband. It felt less personal.Kindle and connection with Amazon.com. I feel connected and great support.Sadly within 4 weeks my Kindle HDX just quit . Didn't turn on anymore. Amazon.com Kindle support was very helpful.Via phone they tried to boost it or whatever they did. But it did not work. So we agreed that I needed to ship it back.Here is where it becomes a bit odd.I told them I do not want a refurbished one. I paid for a new one and would like to have a new one.Though the agent agreed with me and assured me, when the replacement arrived, it said right on the box, refurbished one.Wow. But Amazon.com always is willing to work things out. Unfortunately in this case, the only thing that was left to do was to return the broken one, the replacement one and now order a brand new one.Apparently they are not sending out new ones to replace one.I will keep an eye on the sales. Hopefully I can purchase one soon.Love the HDX, love the service via amazon.com, but don't get that I can't get a new one as a replacement since I paid for a new one and it was only 4 weeks later that I had a problem.", "Title": "didn't work for long", "Date": "March 10, 2014"}, {"Author": "Renee L Browell", "ReviewID": "R1MCY0RYIOVX42", "Overall": "5.0", "Content": "I can do just about everything on this and I absolutely love it. Also it is light weight and very nice to read on,play games,watch movies,check e-mails, etc.", "Title": "love it", "Date": "March 10, 2014"}, {"Author": "KB's", "ReviewID": "R17MYACBTDVPT5", "Overall": "5.0", "Content": "Bought it for the wife and what an awesome tablet. Picture is clear, color is great. Can't keep her off it. What a great product.", "Title": "Awesome!!", "Date": "March 8, 2014"}, {"Author": "Richard", "ReviewID": "R2E87Z6KDJRUP3", "Overall": "5.0", "Content": "I have owned mine for about half a year now. Each day it is the first device I reach for. I read and write email, surf the web, read and listen to books and watch videos. It has replaced my iPads almost entirely. I recommend it unreservedly.", "Title": "Fantastic tablet", "Date": "March 8, 2014"}, {"Author": "Lynn Timko", "ReviewID": "R2LEQH974NPIPF", "Overall": "5.0", "Content": "Wonderful Kindle I got Primetime with it. Which really makes it fun. I keep my kindle close by at all times.", "Title": "Kindle Fire HDX 7\", HDX Display, Wi-Fi, 16 GB", "Date": "March 8, 2014"}, {"Author": "Michael E. Jennnings", "ReviewID": "R3IRP4ZKTE21JV", "Overall": "5.0", "Content": "Just received Kindle Fire, still getting to know it.  I love that I can read my Kindle books and search the web from one device.", "Title": "Love it", "Date": "March 3, 2014"}, {"Author": "Kathy L. Scholl \"Katlyn100\"", "ReviewID": "R2NUX7P4FHCCDQ", "Overall": "5.0", "Content": "I've bought 6 Kindles, starting with the very first generation -- I have three Kindle Fires and love this one the best.  I got a 32GB this time because I ran out of app space on my 16GB.  I also got one for my granddaughter.  This model boots up faster than the others and is so light, even when in a case, that I hardly notice it's in my purse.  I couldn't live without it!", "Title": "Love It!", "Date": "March 3, 2014"}, {"Author": "Woodsman", "ReviewID": "R3F5JYJGVQGAFE", "Overall": "5.0", "Content": "Bought two and pleased with them.  Wife and granddaughter each have one and they absolutely love them.  Bought without annoying popups or ads.", "Title": "Good purchase", "Date": "March 3, 2014"}, {"Author": "Sandra Hatcher", "ReviewID": "R16MMEEE56YHOM", "Overall": "4.0", "Content": "This is my first e-reader/tablet.  I've found the Fire HDX to be very easy to understand and use.  I ordered the 32 gb so I could load my music and book library and still have room for apps and movies.  Even with everything loaded, I still have a lot of room and the speed is still incredibly fast.  I've used the Mayday button a few times and have had excellent help from the CSRs that have answered.  Overall, I'm really happy with my purchase and would recommend this tablet to friends and family.", "Title": "Great product", "Date": "March 2, 2014"}, {"Author": "Ben", "ReviewID": "R3FJF5EJAW66EF", "Overall": "5.0", "Content": "Amazing access to Amazon products, simple user interface and a great battery life. I love this thing to the end of the earth and back.", "Title": "Don't know how I lived before Kindle", "Date": "March 2, 2014"}, {"Author": "linda murchison", "ReviewID": "R3F5JN4DA51LJ3", "Overall": "5.0", "Content": "fabulous  and my friend purchased after she saw mine and she too is thrilled, i am  getting one for my mom", "Title": "it is a wonderful and easy to use kindle", "Date": "March 1, 2014"}, {"Author": "David D. Shealor", "ReviewID": "REU8FZC6H8G4D", "Overall": "5.0", "Content": "I bought the original kindle and after a year or so it disappeared. I took that as an excuse to get the Kindle HD which was a large improvement. I read quite a few books and became ever so slightly addicted to a solitaire game. Eventually, I used that Kindle more than my PC. Then I got it into my head that I needed a 10.4 inch screen so I got one and after a day I was asking myself \"why did I think this would be so great?\" It was too big.So I returned it and got the 8.9 inch HDX for less than half the price. I really like this kindle. It is lighter than the HD and much faster to browse the internet. I suppose if you wanted to watch video on a tablet there would be reason to have a bigger screen but to read books and check bank balances etc the 8.9 inch HDX is perfect.", "Title": "3rd Kindle", "Date": "February 26, 2014"}, {"Author": "Sean Derek Brown", "ReviewID": "RFSC0CV2UL3PW", "Overall": "5.0", "Content": "Great screen, easy to read, easy to use. It does exactly what I want the way that it want it to.", "Title": "Love it", "Date": "February 25, 2014"}, {"Author": "Sandra Pritt \"bzygrl44\"", "ReviewID": "R1OZASU2GD0X66", "Overall": "5.0", "Content": "Great reader.  Much improved back light, very easy to navigate between apps.  Love the added bonus of being able to read/ and listen to audible simultaneously.", "Title": "Great reader !!`", "Date": "February 25, 2014"}, {"Author": "Rachel Groe", "ReviewID": "R6PCM2Q6XPNPL", "Overall": "5.0", "Content": "I bought this back in December (almost three months ago now) and have loved using it since! It works wonderfully, and my family loves using it to surf the web and play on applications (especially Netflix!). It is a very fast machine. I only wish it had a rear-camera for taking pictures, and a good Office-like app.", "Title": "Great tablet!", "Date": "February 25, 2014"}, {"Author": "Lin", "ReviewID": "R19HSB3F44OT0E", "Overall": "5.0", "Content": "Really like the HDX.  Had originally ordered the paperwhite but returned it.  Found it much harder to use.  I read a lot.  Had the HD for three years but wore it out.  Love not having to bother with books.", "Title": "Kindle HDX", "Date": "February 25, 2014"}, {"Author": "LOURDES REROMA", "ReviewID": "R20H59PRVJQ0CW", "Overall": "4.0", "Content": "This device is so handy.  Except for the front facing camera, this gadget is great.  I would have wanted a camera that could switch to the back.", "Title": "excellent", "Date": "February 25, 2014"}, {"Author": "S. J. Mattox \"suzi\"", "ReviewID": "RT4703DBPPADD", "Overall": "5.0", "Content": "Love the Kindle Fire HDX! This is my first Kindle, also my first tablet. I couldn't be happier with my purchase. Glad I got the 7\"; it's perfect in hand and perfectly portable. I am a graduate student who also works full time as an informatics professional. This tablet has made my life so much easier...highly recommend it. Bought the same for a family member, but the HD model instead. The HD is also great, and an amazing bargain. I appreciate the speed, the better picture and the camera included in the HDX...but the HD will suit you fine if you don't mind scaling back a bit. All in all, I am a very happy customer.", "Title": "Far Exceeds Expectations", "Date": "February 24, 2014"}, {"Author": "Energybunny", "ReviewID": "RC9QYB9X6PGOA", "Overall": "5.0", "Content": "I would like an instruction book for  my kindle so I would know how touse everything on it.  Especially taking pictures and videos. I am new at this and it would help to have a book.", "Title": "Instructionbook for my kindle", "Date": "February 24, 2014"}, {"Author": "Ldill76", "ReviewID": "R3U4FW0T9RB4XN", "Overall": "5.0", "Content": "I cannot take away any stars even though the first one froze up on us within 3 days requiring restarts. Amazon was so on the ball I had the new one a day later, no issues since. The speed is awesome and for what my daughter and wife use it for this is by far the best investment we have made. The \"FreeTime\" section is worth three times the amount it is (3$ a month) keeping my daughter in a safe fun zone during her play time was paramount in my purchase decision. This is fast, fun and intuitive.", "Title": "Haven't touched the ipad since.", "Date": "February 23, 2014"}, {"Author": "Polly Johnson", "ReviewID": "R3GI2NHNX320XK", "Overall": "5.0", "Content": "So easy to learn how to operate.stays charged long time, and easy to see screen when reading with being able to c h cage screen col o r.", "Title": "why i like my kindle fire", "Date": "February 23, 2014"}, {"Author": "Lode", "ReviewID": "R29K45QCQ6O15V", "Overall": "3.0", "Content": "So the hardware i okay, but the FireOS is reall horrible.If you are 80 years old and have no experience with technology,this would be an amazing buy.Else, change the damn rom.", "Title": "FireOS is horrible", "Date": "February 21, 2014"}, {"Author": "Wayne Kuphal", "ReviewID": "R2R1JH45DDW15J", "Overall": "5.0", "Content": "I love it!! a review has to be longer than that. I read books on mine. You swipe to turn pages. you can highlight in multiple colors paragraphs, multiple lines, or single words you want. if you decide you no longer want the highlights. you can erase them. you cannot do that with a paper book (hard or soft cover).", "Title": "My first Kindle", "Date": "February 19, 2014"}, {"Author": "Tiffany", "ReviewID": "RQ1XRUIH5B33D", "Overall": "5.0", "Content": "This was my Valentine's Day gift, I love it..  I have always wanted one and now that I have one I want to use it all the time.  I am still learning how to use mine but its fun to learn on!!", "Title": "love it!!", "Date": "February 19, 2014"}, {"Author": "happy mom", "ReviewID": "R29D921PKJTMUO", "Overall": "5.0", "Content": "I have never had a tablet device before. I received a Kindle Fire HDX for Christmas and I love it. It is perfect to use on day trips with my 2 year old and it is so user friendly. I can use the free-time app and let my little one listen to all his books and play his games. Only once have I had a problem and I used the mayday app and a very nice and friendly lady looked into the problem and is working on fixing it for me. This is a great system.", "Title": "Amazing", "Date": "February 18, 2014"}, {"Author": "RoelV", "ReviewID": "R3QBL4SSIK9645", "Overall": "5.0", "Content": "Bought the Kindle for daily use, living in Holland. Both Enterprise (mail, social media and calendar) and private use. It's a great device. I was worried about the Appstore, but I shouldn't have been. Most apps were in the Amazon Appstore.Downloaded my Dutch apps (newspaper, tv live streaming app, ..) and my favorite apps (Netflix, Chromecast, Youtube) from the Playstore and copied them to my Kindle. Everything worked like a charm.All enterprise apps I needed for mobile device management were in the Amazon Appstore. Up and running within minutes.I do like my I-pad however the Kindle is more value for money.", "Title": "Great value for money", "Date": "February 18, 2014"}, {"Author": "Penny smith", "ReviewID": "R2FDK9TKYOMMPV", "Overall": "5.0", "Content": "My husband and I have iPads and wanted to get a tablet for our 8yr old son. We tried a kids tablet, but it had a lt of problems. We got him a kindle and it works great! We have also had a great experience with customer service... The first one we bought had a charging issue after a week or so and amazon sent us a brand new one without any problems! Would highly recommend the kindle fire hdx to anyone young or old! We may even replace our iPads for a kindle! The picture quality is awesome and it is very speedy!", "Title": "Our kindle experience!!", "Date": "February 18, 2014"}, {"Author": "drunkfurball", "ReviewID": "R2YACBJN2XSVS", "Overall": "5.0", "Content": "I saw this when it first released, and thought, \"You know, I wouldn't mind one of those.\" So I bought four. What? I give amazing Christmas presents.So, they arrive, and I distribute them to the folks I bought them for. The rest of the day is kind of a blur. I vaguely remember eating food at some point. Funny thing is, my friends don't remember much else from that day either. You might think we had been the victims of some sort of alien abduction or something, but the reason was simpler than that. We were mesmerized by the clarity of the Kindle HDX display. No kidding. We spent so much time that day just staring at our new Kindle Fires that we don't remember much else from that day.Other than that, they are fast, easy to use, and connect to all the Amazon services you know and love. Just be sure you take the rest of the day off, and don't operate heavy machinery for at least 24 hours after yours arrives.", "Title": "Hello, Gorgeous!", "Date": "February 18, 2014"}, {"Author": "Tuesday Girl \"Romance Fanatic\"", "ReviewID": "R2DNMQKKMQANC6", "Overall": "5.0", "Content": "I have had a Nook for a long time.  I actually wore out one and was on my second.  I was getting tired of the crappy power cords and the book prices.  So I jumped ship for a Kindle Fire with the 7\"  HDX display.  I have never been happier!  It is easy to use, has a fantastic display screen and recharges quickly.  I read A LOT.  And I am more than thrilled with the variety and the cost of the books available.  I also use my Kindle for email, facebook, pintrest, among other things.  It is great, quick to load, easy to navigate and has crisp type that is easy to read.  I will never go back.  I downloaded the Nook app and now have my whole library available on a more reliable device.  And I find Amazon has more sales on their Kindle books than I ever got with B&N.;  Plus a new power cord won't cost me an arm and a leg!  I definately recommend the Kindle Fire!", "Title": "Fantastic!", "Date": "February 18, 2014"}, {"Author": "Pat", "ReviewID": "R18QJNZW0PQR4", "Overall": "5.0", "Content": "I have been an avid laptop user. At school, I was given an iPad to use, so I was use to Apple's. Several family members have Kindles, so I was familiar with the product. Last year, as a birthday gift for my husband, I gave him a 8.9 Kindle Fire HDX. He has enjoyed it and I found myself using it. So when it came time to get my own tablet, I chose a Kindle Fire HDX. I got the 7\",  because the smaller size easily slips it into my purse. It goes nearly everywhere with me: Webmail, Facebook, reading a book or periodical, surfing the net or playing games. I love it and find I am using my laptop less and less. What a great and affordable tablet.", "Title": "Loving my Kindle!", "Date": "February 18, 2014"}, {"Author": "siwiak", "ReviewID": "RD46WQJW2FFF8", "Overall": "5.0", "Content": "I love the click for help button, it was a life saver when I set this up for my son! He's been busy for hours with it.", "Title": "Help Button", "Date": "February 18, 2014"}, {"Author": "Roberta", "ReviewID": "R1ITNVUMDGI9L4", "Overall": "5.0", "Content": "Love it, my son uses this for home and office, there could never be anything else he wanted for Christmas, thank you Amazon", "Title": "Christmas Gift", "Date": "February 4, 2014"}, {"Author": "ALFRED J.", "ReviewID": "RRXPMS909YOKI", "Overall": "4.0", "Content": "Good Investment for now and the future.  Expect to be used every day.  Was actually a present, and was well received.", "Title": "Kindle Fire HD 7\":  A great present for a great experience", "Date": "February 4, 2014"}, {"Author": "Donna Raymond", "ReviewID": "R1GURPXD5B6BBD", "Overall": "5.0", "Content": "recieved this for xmas.  It was so easy to use and love the apps and all the reading materal that you are able to get. its easy to buy items on it thru amazon. my grandaughter has one and also my daughter in law.  We are a Kindle family", "Title": "my kindle", "Date": "February 4, 2014"}, {"Author": "Sydney Clough", "ReviewID": "R123RHK4IWKSVC", "Overall": "4.0", "Content": "I love my Kindle Fire.  It is so great for traveling as it is so light.  I purchased a cover for it that allows me to read hands-free.  The color is amazing after using the original Kindle for a number of years.  And it is so much more portable than my old iPad.  This was a great gift from my kids.", "Title": "Kindle Fire HDX7", "Date": "February 4, 2014"}, {"Author": "Annetta", "ReviewID": "R34J0MCEW9430O", "Overall": "5.0", "Content": "My boys enjoy the kindle and enjoy using it.  Having a hard time getting them to put it away so that they can get other things done.  Thank you!", "Title": "Love it", "Date": "February 4, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R29QU3LE8TLBJG", "Overall": "4.0", "Content": "it is fun and better than the original kindle l love it so much. I think it is a great gift to give to someone", "Title": "kindle fire", "Date": "February 4, 2014"}, {"Author": "Candace Kirchner", "ReviewID": "R79RGQUPT6KHC", "Overall": "5.0", "Content": "Great  apps, super clear image,  sound loud enough, extremely user-friendly. Best gift for years. I hear it was very affordable.", "Title": "Love this gift", "Date": "February 4, 2014"}, {"Author": "RADIOCITY", "ReviewID": "R3DVU50VAM11FE", "Overall": "4.0", "Content": "I would tend to give it 4 & 1/2 stars, but there's no half star.  First, it IS a fantastic device.  Incredibly versatile, lightweight, with an amazing screen.  I have always had (it's probably me) trouble using Apple products, as for me, they simply aren't as intuitive as others, and I don't like I-Tunes, so the HDX was a logical choice.  It is very reasonable in cost, and for those who need it, the Mayday feature is sure to be a big hit.  I've used it two times, (could have easily found the answer to my question myself, but wanted to give it a try) and the help Amazon gives IS all it's cracked up to be.  Very convenient. This device is super fast, and dependable.  I won't carry a cell phone, but with this, you can load on a free app from MagicJack, and you're good to go!  Free phone calls are always great, right?  So, why not five stars? As with most tablets, there are the occasional hang-ups while online, mostly while trying to view a video, say from Yahoo.  Can be frustrating if you're not ready to just let it go.....just don't need to see it that badly.  It can lock up the device.  Some videos DO work, but not all. Not a biggie though, just disconnect, get back on, and move on.  Hey, this can happen on my laptop, and who amongst us hasn't experienced that?  This aside, this thing is so easy to use, if you can work your laptop, or desktop, you won't have to learn a thing......no jumping through hoops like I-Tunes to load music......just drag and drop it from your laptop, and voila! Very intuitive. I bought, and suggest the 32gig model, just to be certain you'll have plenty of memory, as you cannot upgrade the memory.  The sound from the built in speakers is nothing short of amazing, and of course through the headphone jack as well.  Maybe I should have given it FIVE stars.  One last thing......I almost was set to pay for the 'NO OFFERS' (which you can also do at a later time if you don't do it when you first buy the Kindle) but was glad I didn't. The offers are GREAT, the screens shots are brilliant, and you find yourself looking forward to them when you power up. In addition, a simple millisecond swipe of your finger, and they're gone, and you're ready to go.  You won't be disappointed.", "Title": "Like most, I LOVE my Kindle.", "Date": "February 4, 2014"}, {"Author": "Paula forney", "ReviewID": "R3OG24RQ9NGLSQ", "Overall": "5.0", "Content": "I  love  it  I have  had  three  eye  surgerys  the  kindle  help  me  do  what  i  love  is  to  read  I  can  blow  up  the  font  and  i  see  the  books  much  better  thank  you", "Title": "free urban fictiin", "Date": "February 4, 2014"}, {"Author": "David W. Schreiber", "ReviewID": "R1ADAC0N9Y2L5J", "Overall": "5.0", "Content": "This is our fourth Kindle and the best one yet! We could not be happier. Works perfectly. If you are looking for a tablet/e-reader think seriously about this Kindle.", "Title": "Kindle Fire HDX 7", "Date": "February 4, 2014"}, {"Author": "RodLefty", "ReviewID": "R2P0X7E63IEK1P", "Overall": "4.0", "Content": "Wanted to try a platform other than iOS. Chose Kindle over straight Android device. No problem with the limitations like Google Play. Can work around that. Really like the quick access to buying things on Amazon. I'm sure they like that too. But the touch sensitivity doesn't seem as clean as our iPads -- various generations and sizes. Silk doesn't always seem as fast as advertised. Also I like to close apps when not using them and that's not nearly as straightforward as the iPad approach. Battery life doesn't seem to be what I'd expected, but am trying to learn how to manage that. Finally, transferring things from iPad or iMac Pro to the Kindle is a snap. That's nice.", "Title": "Good, but still not an iPad", "Date": "January 31, 2014"}, {"Author": "K. Rowand", "ReviewID": "R2VDR0T67OMZOM", "Overall": "5.0", "Content": "Love it!  Had considered a paper white, which is also very nice but the fire fills my needs much better.", "Title": "kindle fire hdx", "Date": "January 31, 2014"}, {"Author": "Lauren Doffont", "ReviewID": "RAFVYTMQY0HU4", "Overall": "5.0", "Content": "I absolutely love my kindle fire hdx! It does everything I want, easily and efficiently. Portable, lightweight and beautiful! Best Christmas gift I got this year. Highly recommend", "Title": "I love my kindle fire hdx", "Date": "January 31, 2014"}, {"Author": "Linda W. Howard \"LinderBeth\"", "ReviewID": "R337JCM1CENACO", "Overall": "4.0", "Content": "The only reason I did not give my Kindle HDX 5 stars is because the battery life is so short.  Otherwise, I love the size, weight, and performance.", "Title": "Love my HDX!", "Date": "January 31, 2014"}, {"Author": "Eyesinthesky", "ReviewID": "R1F7RNQ3S7KD8R", "Overall": "3.0", "Content": "I was disappointed at the number of times the unit hangs up.  We've had it several months not and at least every several weeks it hangs up play the simplest of app games to the point it must be shut down completely and re-booted.  The picture is good and I think I got a good deal on it buying it on cyber Monday but I can't highly recommend it to a friend.", "Title": "Not a stellar performer", "Date": "January 31, 2014"}, {"Author": "Patricia", "ReviewID": "R25C6HFNLJPPYH", "Overall": "5.0", "Content": "I use the test-to-voice feature on the Kindle Fire HDX to listen to books, articles from the internet that I send to the Kindle, and read important business document aloud. The new audio voices on the Kindle HDX ( and there are many voices to choose from) are excellent, with a very realistic sound. The Kindle's text-to-voice is much easier to use than the iphone or ipad, and thevoice quality of the Kindle is better. I also use the Kindle to download instructional videos available on uTube, using one of the convenient uTube APPs. My favorite place to play my Kindle is at the gym, while on the treadmill or elliptical machine with a Bose noise-reducing headset - my workout times have increased due to the Kindle.", "Title": "Great product at a great price!", "Date": "January 31, 2014"}, {"Author": "Jan", "ReviewID": "R2JID5XERTR9VT", "Overall": "5.0", "Content": "10 stars for Amazon customer service. I love everything about my kindle fir HDX. I was devastated when the sound went out and had to call because the MayDay button does not work without sound. I was connected almost immediately with RB and after the re boot failed I was approved on the spot for a replacement Kindle.This all took less than half an hour. The very next day I got an email saying my new Kindle was on the way and another with clear detailed instructions and labels to make the return easy. This was the best customer service experience ever.  I will be a Kindle customer for life !", "Title": "5 Stars for Customer Service", "Date": "January 31, 2014"}, {"Author": "Andrew Vittoria", "ReviewID": "RHP0OZ1CFALWX", "Overall": "5.0", "Content": "I have had the Fire for about a month and love it. It's easy to use, has tons of apps and books that arevery reasonably priced. The screen resolution is perfect. All that and under $175. What's not to love?", "Title": "Great small tablet", "Date": "January 29, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R3JR0F97INENI8", "Overall": "5.0", "Content": "I started with a Kindle Fire and loved it for reading new or revisiting books I hadn't read in some time.  The new Kindle Fire HDX is a great advancement over the original.  Portability, ease of use, can go from reading a book to surfing the web or watching a Netflix video seamlessly. The Silk browser is a huge leap forward from the Kindle Fire and is very fast and responsive. The only con I have found so far is in the native e-mail application.  It works extremely well but it does not have a \"select all\" option when you need to move or delete e-mail, you have to select each one individually.  This is a minor quibble but would make the mail app shine (yes I know I have other options).  Now if I could just convince my significant other that the HDX 8.9\" would be even better (or the 10\" when it becomes available...)", "Title": "Kindle Fire HDX 7\" for Christmas", "Date": "January 29, 2014"}, {"Author": "Amazon Customer \"lilimarlene9\"", "ReviewID": "R3AHF2GKTCEV0Y", "Overall": "5.0", "Content": "I can do anything I want on it. I only wish I had spent the extra money & gotten the 3G option also.", "Title": "love it!", "Date": "January 29, 2014"}, {"Author": "robert carter", "ReviewID": "R1ROOOSN7KCWU4", "Overall": "5.0", "Content": "Bought this for my daughter as a Christmas present.... To date this has been the best gift she's ever had... Her words... The help feature is awesome! Live person interaction on your screen is truly awesome... I strongly recommend this product", "Title": "Best Gift Ever", "Date": "January 29, 2014"}, {"Author": "Robert Glasspoole", "ReviewID": "R17B02QQ2D8FXC", "Overall": "5.0", "Content": "I received the Kindle Fire HDX on time and love everything about it.  The Wi-Fi works well and I can check \"E\" mail and Facebook as well as play games and read books,", "Title": "Great product", "Date": "January 28, 2014"}, {"Author": "Amazon Customer \"winnielss\"", "ReviewID": "RFDMT50NLHEGV", "Overall": "5.0", "Content": "I can now carry more than one book when I go travel without putting too much weight in my suitcase. More importantly, I can read while my boyfriend is asleep right next to me without turning the light on. It was the best Xmas gift for me!", "Title": "I absolutely love it!", "Date": "January 28, 2014"}, {"Author": "Grace Roderick", "ReviewID": "R1X0Z55IUY3I4K", "Overall": "4.0", "Content": "I really enjoy my kindle but it will freeze from time to time. I would tell my friends about it.", "Title": "kindle fire hdx", "Date": "January 28, 2014"}, {"Author": "thomas a cappelloni", "ReviewID": "RJSZFNJCQB46Z", "Overall": "3.0", "Content": "I AM NOT TECHNICALLY SAVVY.  I WOULD HAVE NEVER PURCHASED ANY DEVICE LIKE THIS.  IT WAS A GIFT FROM FRIENDS WHO ARE DETERMINED TO DRAG ME INTO THE 21ST CENTURY.  I EMBRACED IT.  I HAVE TRIED TO USE IT, AND HAVE ENJOYED THE THINGS I HAVE BEEN ABLE TO FIND.  THE BIGGEST PROBLEM FOR MYSELF AND MANY LIKE ME WHO CAME THROUGH COLLEGE AND GRADUATE SCHOOL WHEN COMPUTERS WERE HOUSED IN AIR CONDITIONED ROOMS, AND DATA WAS ENTERED ON PUNCH CARDS ---IS--- THERE IS NO USEFUL WAY TO FIND OUT HOW TO USE THE NUMEROUS FACITS OF THIS DEVICE.  THE TUTORIALS ARE VIRTUALLY USELESS.  SO THE DEVICE IS OF LIMITED VALUE TO ME.  I NEED AN INSTRUCTION APP THAT STARTS WITH A PICTURE THAT SHOWS YOU HOW TO TURN IT ON, AND DOES EVERY FUNCTION FROM THAT POINT.  YOUR INSTRUCTIONS ARE GEARED TO PEOPLE WHO HAVE COME UP WITH THIS TECHNOLOGY FROM KINDERGARTEN.  AND SO YOU LOSE AN ENTIRE MARKET BASE AMONG THE 50-70 YEAR OLD PEOPLE WHO WOULD LIKE TO USE A KINDLE, BUT DON'T HAVE GRANDCHILDREN OR GRADE- SCHOOLERS TO GIVE THEM TUTORIALS.", "Title": "INSTRUCTIONAL FLAW", "Date": "January 28, 2014"}, {"Author": "XJCraver", "ReviewID": "R1SPR2N2QVXA56", "Overall": "3.0", "Content": "Nice little tablet. Handy for checking emails, forums, and such, and very easy to use.  BUT.....Amazon and Google have GOT to get their heads together, and come up with a way for me (and others) to access the Android apps I've ALREADY PAID FOR in the Play store.  It's ridiculous the amount of functionality you lose not being able to access those apps.  If I could link this thing to my Verizon phone, and have all my Play store apps on this thing, it would've got 4 1/2 stars instead of 3.  Very disappointed that I have to hack this thing to be able to use it to it's potential.  And before you go all \"read about it before you buy it\" on me - I received this as a gift.  I had no choice in the matter...The other 1/2 star it's lacking is an easy fix, and it flat boggles my mind that Amazon didn't include it in the programming  -  NO HAPTIC FEEDBACK OPTIONS?????????  That's basic, kindergarten-level stuff some programmer left out, and it's beyond annoying.  Really would make this thing much more user-friendly if these buttons gave me some feedback when I touched them.So overall,  3 stars.  I'd be fine with recommending it as a purchase, just do your research first and make sure you can do without your Play Store apps.  And do NOT gift it to someone, unless they're on their knees begging.  There are similarly priced tablets out there that will much better suit the average Android user.", "Title": "Almost there...", "Date": "January 28, 2014"}, {"Author": "Tonda Jean Jones", "ReviewID": "R2481HFWMY5XY", "Overall": "5.0", "Content": "This is an amazing tablet. The color is off the chart. It's easy to use and offers many apps. If you are a beginner or expert. I would recommend this Kindle to anyone looking at tablets. This was my best Christmas present ever.....", "Title": "awesome", "Date": "January 28, 2014"}, {"Author": "Courtney Champy", "ReviewID": "R3M9SS1IUPGZU4", "Overall": "5.0", "Content": "I like the brightness and quality of the display. The speed is pretty good and it is easy to navigate.A very big turn-off is the lack of customization, I like my own backgrounds and now when I am not at home reading I cannot look at my dog which is relaxing and makes reading more enjoyable. Unfortunately the next model may have this but an upgrade that enables this would be phenomenal, as it is an expensive purchase and I cannot investing in the newest version for one change.", "Title": "Kindle Fire HDX 7\"", "Date": "January 28, 2014"}, {"Author": "thomas", "ReviewID": "R3CP2GKVD98HH5", "Overall": "3.0", "Content": "This is a good device for kids from 6 to maybe 11. Its fast and light and very compact. I wouldn't get it for someone who is techy or a teen. The app store is really bad. It also doesn't have a back camera so all you can do is take selfies", "Title": "kindle", "Date": "January 28, 2014"}, {"Author": "K. Baudoin", "ReviewID": "R1X33FYB0UPZVO", "Overall": "5.0", "Content": "I upgraded from a Kindle Fire first generation to the Kindle Fire HDX and absolutely love it!  The speed and new functions are unbeatable.  Light weight and beautiful visual graphic displays!  I couldn't be happier with the upgrade!!  Love the mail integration, ability to categorize with your own creative names for categories.  Videos are of the highest quality, making viewing an absolute pleasure!  Great price too!  Who needs an iPad when a Kindle Fire HDX offers so much more?", "Title": "FANTASTIC Little Tablet!!", "Date": "January 28, 2014"}, {"Author": "Dad P", "ReviewID": "R2YR6S1DCPPM0P", "Overall": "5.0", "Content": "Really love this kindle, just kicking myself for not getting the 8.9\" right now. Everything I want is on my kindle now, and it is so easy to take with you wherever you go. Beats lugging a laptop around.", "Title": "Kindle Fire HDX 7\"", "Date": "January 28, 2014"}, {"Author": "Marge Ford", "ReviewID": "R5S4BECG7CVKR", "Overall": "5.0", "Content": "I got this for Christmas and I absolutely love it!  It is super fast. Set up for a breeze.  music video,games and movies play very well on it.  One of my sons checked it out after I got it and now he is going to get one.  I highly recommend this Kindle!!", "Title": "fantastic!", "Date": "January 28, 2014"}, {"Author": "E2 Cribbs", "ReviewID": "R3SP0CPPLA9YF5", "Overall": "5.0", "Content": "I love my kindle fire HDX it is the most amazing thing EVER you can download apps.and movies and books and the books are easy to read (its not blurry or anything) I know.I love it and I have never had any problems with the tablet and when I am bored all I have a to do is go on my kindle fire HDX I hope u found this review helpful:):):):)", "Title": "AWESOME LOVE IT GET IT!!!!!!", "Date": "January 28, 2014"}, {"Author": "Leigh 88", "ReviewID": "R23I57SNLD8IDQ", "Overall": "5.0", "Content": "Sleek, Crystal clear..Amazing! I would recommend the HDX Kindle. Good for reading books or playing games. Definitely worth every penny", "Title": "Love it!", "Date": "January 28, 2014"}, {"Author": "Karen Lester", "ReviewID": "R31HL3E0YBTHFK", "Overall": "5.0", "Content": "I have the Kindle Fire and love it!! So my husband got me the HDX for Christmas and WOW!!! So much better, better than an Ipad....the only thing is, I would like if there was a light to let you know if it's fully charged, I miss that on it!", "Title": "Much better!", "Date": "January 28, 2014"}, {"Author": "nicholas", "ReviewID": "R30SV0C6WZMVA7", "Overall": "5.0", "Content": "Love it!! first tablet easy to use easy to download apps n has a great section to pick from from kids games to business apps", "Title": "Great all around tablet", "Date": "January 27, 2014"}, {"Author": "Betty J Wood", "ReviewID": "R1VCJHHZWLQ9CF", "Overall": "5.0", "Content": "Love , Love, Love it.  Light and easy to hold and read. It totally met my expectations a must have.", "Title": "Best Kindle", "Date": "January 27, 2014"}, {"Author": "d", "ReviewID": "R1ZBDR0EW37S8I", "Overall": "5.0", "Content": "I bought two. One had the difficulty mentioned in other reviews - turning off often. MY husband contacted Amazon & they talked him through a fix. No more problems!", "Title": "love it", "Date": "January 27, 2014"}, {"Author": "Shawn M. Miller", "ReviewID": "R1HJYMB2KDBBP3", "Overall": "5.0", "Content": "I have the Kindle HDX, HD and Paperwhite.  They are all awesome.  If I could only buy one, I would buy the HDX, for the reason of versatility and the price difference between the HD and HDX with 16GB is only $60.  For $60, you get a faster processor, faster downloads, better screen and other enhancements.  If you are only going to use it for reading novels, then the Paperwhite is the way to go.  Very easy to use - if you use Amazon Prime this is the way to go.  If you don't, then only the Google Nexus and ipad compare with this device; I would look at those two before deciding to purchase.", "Title": "Kindle HDX delivers", "Date": "January 26, 2014"}, {"Author": "Just W", "ReviewID": "RUQD9IGZRYRN", "Overall": "4.0", "Content": "Second best packaging behind the Google Chromecast.The changes in the HDX vs the HD are very practical. From button placement to OS layout.Kindle's major flaw is software. Obviously Amazon & Google are competing in the device market. But as a Kindle owner, you lose out on access to Google apps. This is huge. The Kindle apps tend to be two or three versions behind their Google Play counterparts. The selection in the Amazon App Store is also much slimmer. Not getting some key apps from Google, Microsoft and other major developers. So if you are a power user, you might want to go with any other Android device.The screen resolution is really nice. Sharp and bright graphics. I've noticed an occasional brightness flicker. But nothing too terrible. Video playback is quick and clean. Easy to watch a whole movie on this.Really great speakers. Too bad there was no space for them on the front. The way that tablets are designed, no manufacturer really want's to take away screen space for speakers.Three things I want to see in the next version are:A return of the micro HDMI port. Who knows. I might use it one day.Upgrade-able memory.Replaceable battery.", "Title": "+ & -", "Date": "January 26, 2014"}, {"Author": "Diana  Melissa", "ReviewID": "R2SXIADE29X20P", "Overall": "5.0", "Content": "Very happy!!!! It was a Christmas presents for my kids and they love it I recommend not only for the games now they are reading more books", "Title": "my kids loved it...", "Date": "January 26, 2014"}, {"Author": "Douglas Dickerson \"codougd\"", "ReviewID": "R3N1SL3GJCO8NC", "Overall": "4.0", "Content": "... for the annoying carousel and the fact that there is no way to disable it.Overall, the Kindle HDX is exactly as I expected and fits my needs, as planned and anticipated.The Kindle is NOT a \"general purpose\" tablet replacement or competitor. Its strengths are aimed squarely at us members of the Amazon ecosystem.It is a very good ereader. The color screen is crisp and, as a color screen, is more suitable for technical volumes than the B&W; Kindles. The is some glare in bright light but that is the trade-off for color.The included apps are good enough. I appreciate being able to jump to a browser to research something I encounter in book I am reading. The Silk browser is much improved over previous instances. The mail app is also good enough for casual use.I don't watch videos on the Kindle so I can't comment on the performance at that task. I have watched some video tutorials using the browser and that worked well.In all, if you accept that the Kindle is a media consumption device with hooks into and dependencies upon the Amazon ecosystem and if that is why you bought it you will be very happy. If you buy it as a cheaper alternative to other Android-based tablets you will likely be disappointed.", "Title": "It would have been 5 stars except...", "Date": "January 26, 2014"}, {"Author": "Lucy Cardona, Ph.D., LCSW", "ReviewID": "R1T0HPK6923ACX", "Overall": "4.0", "Content": "I was very ambivalent about returning the new Kindle Fire HDX 7\" which I ordered one week ago.  This is because the HDX 7 has a great high definition display, is easy to use, and seemed to have better connectivity to the internet than did my old Kindle Fire. Today, I was at Starbucks, where I tried connecting to the internet through their free WIFI service, but failed to connect. I had not tried connecting in other environments other than in my home where I have high sped internet through a cable company. Thus, I ran into the very same connectivity issues that I had with my old Kindle. This was very disappointing as I had been reassured by the Amazon chat tech that the connectivity problems had been significantly improved (in the HDX 7'). For this reason, I made the decision not to order the 4G internet (Verizon) with it and ordered solely the WIFI connection for it. I am returning the device in the morning. I will explore other Kindle Fire products and likely order a more expensive model but this time, include the 4G (Verizon) with it.", "Title": "WIFI Connectivity", "Date": "January 26, 2014"}, {"Author": "Robert Hurst", "ReviewID": "R39GSMZPDDVUVT", "Overall": "5.0", "Content": "I am so glad I finally bought a Kindle HDX.  Not disappointed one bit as it met all my expectations.", "Title": "Very happy with my Kindle", "Date": "January 26, 2014"}, {"Author": "A. Hughes", "ReviewID": "R1FC6J9D1ZLW1V", "Overall": "5.0", "Content": "This is the third Kindle Fire HDX I purchased in 2 weeks. Had to buy one for myself after seeing how nice it was. I purchased one for my husband and also one for my son for Christmas. I replaced my old school Kindle which I loved! This one does so many more things and I especially love the wifi and HDX. Buy one today, you won't be disappointed!", "Title": "Fabulous Kindle Fire", "Date": "January 25, 2014"}, {"Author": "RNedNelson", "ReviewID": "R2SBE7M3KGPOC2", "Overall": "5.0", "Content": "I previously owned on of the very first Kindles but it was stolen and in disgust bought the cheap one with ads. For Christmas I got the 7\" HDX Fire and it is wonderful! Way better for me than the 7\" iPad I bought my wife for Christmas. I especially like the 'mayday' button vs. going into the Apple store to ask questions.", "Title": "Kindle 7\" HDX Fire is terrific!", "Date": "January 25, 2014"}, {"Author": "Charles Gidman", "ReviewID": "R4FVSKLEHM0RS", "Overall": "5.0", "Content": "I am enjoying my Kindle Fire. I like reading and the ability to have instant access to so many titles. I haven't really used it to it's full potential, just books and a couple simple games. Still getting used to it. But so far it's working out very well", "Title": "Very Nifty", "Date": "January 25, 2014"}, {"Author": "june  heefner", "ReviewID": "R40ZTE7056735", "Overall": "5.0", "Content": "This was a gift to my sister which is 62 she cant stop thinking me so id say its a nice kindle.", "Title": "this was a gift", "Date": "January 24, 2014"}, {"Author": "S. Simons \"MOM of  SGT TR\"", "ReviewID": "R12H4DQ9TRM9TS", "Overall": "5.0", "Content": "After having a 'regular' kindle for 3 years, I decided to update (as a gift for myself) to a Fire HDX...WOW! ...such vivid pictures, and the ability to increase the print size with a touch of my finger is amazing!  I had over 400 books on my original, and they are there (in the cloud) or I can move them back and forth. I love having my Bible on my Fire, as well as several of my favorite cookbooks. I have even downloaded Craftsy classes and view those seamlessly as I sew right along! LOVE, LOVE, LOVE my new Kindle!!", "Title": "How did I live without it?", "Date": "January 20, 2014"}, {"Author": "David Cripe", "ReviewID": "R1NWRE8PDA313L", "Overall": "5.0", "Content": "I bought this Kindle Fire HDX during the cyber-Monday special of $179, which was totally worth it as that price.  My family has owned the original Kindle Fire the past two years roughly, and this one is way above that version.  Is it better than the Kindle Fire HD version?  Depends, but probably not if price is your biggest factor.Pros:1) iPad Contender - Seriously.  The iPad in my opinion is way overpriced for what it does.  The Kindle Fire HDX is just as capable at handling most of the same work flow with a couple of differences.  Yes, this is tied to the Amazon App store.  If Google Play was standard, then Apple might be worried.  Right now though, Amazon is crippling their own success.2) Fluid Performance - Smooth as butter.  I have played around with everything available for the past two months and it handles it all with excellence.  Games, work, reading, etc run flawlessly (app issues not withstanding).3) Screen - Sharpest resolution I have ever seen on a screen this size.  Made the original Kindle Fire look like a 10 year old non-HD television.  I could stare at this thing for days (but won't).  Reading, movies, games, etc are shown in perfect HD resolution.NOTE - The blue pixel edge issue is there, but it is not distracting to me.  I actually kind of like it.  If you read a lot on white backgrounds, then it pops out more than normal.  The haze falls to the background after I begin reading the first page of something, and I never notice it much any more.4) Micro USB Connector - Bite it Apple!  :)  No cord carousal here.  If you have a cord sitting around, it most likely works for charging or connecting the Kindle Fire HDX.  For the first time ever - a plug adapter is included!  Amazon is including a plug adapter so you can actually charge the device through a regular electrical outlet.  What a concept Amazon!  That might catch on with other electronics (sarcasm).5) Bells and Whistles - This thing has it all (mostly).  Dual-band WiFi, HD screen, Amazon support (best in the world), light as a feather, etc, etc.Cons:1) Amazon App Store (sort of) - No Google Play?  I know Amazon wants everyone to use the device for their content, but not allowing one of the largest app stores on your Android device seems illogical.  I am able to use 3rd-party app stores to upload missing apps and outdated ones on the Amazon App Store, but still!2) USB Connection Port - The connection port on the device can be a bit of a nuisance.  You have to connect it at an angle on the device (around 30 degrees).  Just irritating to me for some reason as everything else has it straight, so your mileage may vary.3) Mayday Button Gimmick - I am a computer-savvy person.  I don't need help on where to press the power button or tweak the brightness.  If you are buying this for grandma or a person that never has used much technology in the past 10 years, then this is a life saver for you (no more annoying phone calls).4) Battery - I get a couple days of heavy usage (8 hours) out of it.  I just wish I could get the Kindle reader battery life of 4 to 8 weeks.  :)Overall:This is finally the Kindle to put Amazon in striking range of Apple on the tablet front.  If you crave everything Amazon like me, then it is a no brainer to purchase this.  If you are not, then buy it anyway as you will save at least $100 over the nearest priced iPad.  If Amazon would just switch to Google Play for the app store, then there is nothing that would stop them from ruling the world!  :)", "Title": "Best Kindle Fire Hands Down", "Date": "January 19, 2014"}, {"Author": "Melissa", "ReviewID": "R22FZPHTPJ6OYK", "Overall": "5.0", "Content": "New owned a Kindle or a Tablet and got this for Christmas and I love it! It's like a mini laptop to go! I highly recommend this to everyone, it's very user friendly and stays charged for quite a while.  And the possibilities are endless!! LOVE, LOVE, LOVE IT!!!!", "Title": "Kindle Fire HDX 7\"", "Date": "January 19, 2014"}, {"Author": "Christine Smith", "ReviewID": "R3SPTXXW0HWNT1", "Overall": "5.0", "Content": "I got this one for me. It is light and the HD is pretty awesome. The colors are fantastic and life-like. I can actually listen to my books or music and I think the sound is good. The woman who \"reads\" to you doesn't have some weird voice, but you know it is mechanical. It is not annoying. Music sounds really good even playing it without headphones. I use it for almost everything: email, browsing, games. The games are bright and responsive. I have not used MayDay as I am figuring things out.  The battery is more than satisfactory and I have found it to last most of the day and part of the night. Email gives me some trouble and I learned quickly to check it before hitting send. You wouldn't believe what I sent to someone. It is a good candidate for \"Damn you autocorrect\". We had a good laugh about it, though. At any rate, I recommend the HDX. I just couldn't wait for the larger one, but I find the 7 inch is just fine. Thanks Amazon. People have complained you have to use so much Amazon items. I mostly use it as I am also a Prime member, so this is a no brainer for me.", "Title": "I love this Kindle HDX", "Date": "January 18, 2014"}, {"Author": "Kindle Customer \"osetleo\"", "ReviewID": "R28IE1X5YA9OR0", "Overall": "3.0", "Content": "I just bought Kindle Fire HDX which became the second Kindle Fire in our family. My wife was using the original Kindle Fire for 2 years and I was thinking to give her a new one and use the original for myself. We mostly use Kindle fire for reading books with occasional use for movies and other applications.When we loaded books to the new Kindle Fire HDX my wife noticed that in the book view it has very visible thin line of glare approximately 1/8\" around the perimeter of the screen that is different in color than the rest of the text. Comparing with the original Kindle Fire it looks quite annoying when you read books.All other features and capabilities of the new HDX look very impressive.If you have a Kindle HDX 7 could you please let me know if this is something you experience as well or it is the specifics of the unit I got?Really appreciate your reply", "Title": "Kindle Fire HDX 7\" -glare around the perimeter of the screen in book mode", "Date": "January 18, 2014"}, {"Author": "mark heffernan", "ReviewID": "R13CGH8MZAOF4Z", "Overall": "5.0", "Content": "Above what we expected , Xmas gift for grand kid also cannot keep her off it, kids time was also a great purchase", "Title": "Great", "Date": "January 18, 2014"}, {"Author": "William Perdue", "ReviewID": "R1WM6MOXDXF2Z2", "Overall": "4.0", "Content": "Very good item - Only negative is the inability to expand memory by adding a larger SD chip or something similar.", "Title": "Very good item", "Date": "January 17, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RZC31BGTKYHV0", "Overall": "4.0", "Content": "I haven't had it a month yet but so far I like it I wanted to replace my IPad 2 mostly because of the size for taking with me in my purse much smaller and lighter,only complaint so far is it's missing a few apps I need  for workso I can leave the IPad.I'm hopeful that they will add them soon.", "Title": "I like it", "Date": "January 17, 2014"}, {"Author": "Laura", "ReviewID": "R9U7BAUZKIACV", "Overall": "4.0", "Content": "I am still in the learning phase.  If I could make one suggestion, that would be that there should be a quick set-up help booklet/pamphlet for seniors to use.", "Title": "Suggestion", "Date": "January 17, 2014"}, {"Author": "kendra wheeler", "ReviewID": "RX6XPQNJM8RYG", "Overall": "5.0", "Content": "Love it. .... No complaints!! Easy to use even for someone older and not familiar with computers tablets etc. Small but packs big power in use!", "Title": "Love it!", "Date": "January 14, 2014"}, {"Author": "Beverly Kimbrough", "ReviewID": "R1BFAJCG9NCL9F", "Overall": "5.0", "Content": "Very pleased with the Kindle HDX. This is my third kindle, and I have been pleased with all of them. Amazon really delivers on their products!!", "Title": "Love my kindle HDX", "Date": "January 14, 2014"}, {"Author": "Wallace H Ford Jr", "ReviewID": "R25G1LMHEOVYYP", "Overall": "5.0", "Content": "Really great.  I upgraded from the Kindle Fire First Edition.  Am glad I did.  Watching movies is wonderful on this device.", "Title": "Kindle Fire HDX 7\"", "Date": "January 14, 2014"}, {"Author": "S. HUTCHINS", "ReviewID": "R298KHXJHTOCA6", "Overall": "5.0", "Content": "Bought for my son and son in laws. They liked it very much. Shipping was very fast. Thank you for a good experience.", "Title": "Loved it", "Date": "January 14, 2014"}, {"Author": "Kindle Customer", "ReviewID": "RC7GBJH027I6S", "Overall": "4.0", "Content": "Love the enhanced graphics and lighter weight.  I was, however, disappointed when I realized the camera only takes photos to the front.  I thought it only faced forward, not toward the viewer.  Very awkward to take normal photos.", "Title": "pleased with Kindle, but not with camera.", "Date": "January 10, 2014"}, {"Author": "Barbara VW", "ReviewID": "R1U3OV26B54YFR", "Overall": "5.0", "Content": "This Kindle Fire is easy to hold and has a pull down menu on with options that could be the most used (wireless, screen rotation, settings). The ads are really not too intrusive. Turn on the Kindle and you have a full screen ad which disappears when you swipe the unlock icon and ads on the bottom of the screen when reading. Has beautiful color. E-reader portion works well. Games are a joy compared to my Nook Color. It eats up energy playing games and when Wi-Fi is on. On the web this Kindle causes a problem with entering e-mail names and passwords since the area to touch is small and very close together.  Need to remember the book you were reading because when you go to something else (games, web) the book does not reappear like the Keep Reading icon on the Nook Color works. I have been using the trial and error method to find out how things work so there may be better ways to do some  things.", "Title": "love Kindle Fire HDX 7 (have had 1 month)", "Date": "January 10, 2014"}, {"Author": "Janie Sirmans", "ReviewID": "R3DTS9390XRCYM", "Overall": "5.0", "Content": "After reading some questionable reviews, I was a little apprehensive about this purchase. This was a gift for my husband, and I was afraid I had made a big mistake. However, he loves this tablet. He has nothing negative to say - no adds- no nothing. It is fast and the graphics are incredible.", "Title": "Awesome tablet", "Date": "January 10, 2014"}, {"Author": "Bobb's", "ReviewID": "RT54ZTS48YU3S", "Overall": "5.0", "Content": "I love my Kindle Fire HDX. Its small, light and the screen is amazing. I am vested in Amazon's services like MP3 and Instant video which make it perfect for me as buying and consuming content is so easy on this tablet.The new Fire OS is much better than last year, easier to use and much faster all in all a great tablet and I would recommend people consider this over other Android Tablets or the iPad.", "Title": "Awesome tablet, no longer use my iPad Mini", "Date": "January 10, 2014"}, {"Author": "Patty L. Brady", "ReviewID": "R18S70BLXNS97G", "Overall": "5.0", "Content": "Enjoying this way more than just the KINDLE !! I do everything on it. I watch movies,tv,videos,I even listen to my music. I received it as a CHRISTMAS present and I am legally blind. I am able to blow up and see the screen a lot better than the KINDLE fire. The HD is awesome ....thanks to some special features I practically live on this.", "Title": "loving this over the plain KINDLE", "Date": "January 8, 2014"}, {"Author": "Kathy Manson", "ReviewID": "R213IG5209TZXW", "Overall": "5.0", "Content": "I did a lot of research and this was my choice and with the price who can resist.  I am a photographer and do a lot of traveling and chose this so i could just take this rather then laptop on trips.  I can upload my photos from here to my external hard drive.  I have also found i am reading a lot more just having this so easily accessible.", "Title": "Merry Christmas to me", "Date": "January 8, 2014"}, {"Author": "Ducks", "ReviewID": "R2ZIJ6JWZG2SZA", "Overall": "5.0", "Content": "Like the Kindle Fire HDX 7, being a tablet it has given me hours of enjoyment.I do find reading or viewing the tablet in bright sunshine is difficult.When reading a book, I do notice some screen flicker after turning every page.Would buy again and the price is right.", "Title": "Kindle Fire HDX 7", "Date": "January 8, 2014"}, {"Author": "A. Andrews \"amelia0722\"", "ReviewID": "RJ7M3S1FEEDKG", "Overall": "5.0", "Content": "I ordered this for myself for XMAS. Of course I opened it EARLY......like mid november......I priced the IPADS and the KINDLES and THE NOOKS ....and THE GALAXIES.......I wanted a new tablet........I love apple products....Have a MAC, an IPHONE and IPOD and a GEN 1 IPAD..........the KINDLE I chose for price and picture quality. I do alot of games and netflix and music. So far it has been what I need for my leisurely time on the couch or before I go to bed. AND i love love love it in the kitchen for my recipes !!!! AMAZON support is amazing and I am glad I took a chance on it. VERY USER friendly, light weight and perfect size to hold with one hand.", "Title": "It was a KINDLE or a MINI IPAD , im glad I chose the KINDLE", "Date": "January 8, 2014"}, {"Author": "taa9804", "ReviewID": "R2TKZO7KPI93UL", "Overall": "5.0", "Content": "I am not a book reader, I am not sure if I like the Kindle yet, but I do recommend it, it seems to be a great product!!! The only thing I don't like is that with the camera, you can't take a picture unless you take it of yourself, or turn the whole device around to take it of something else...strange camera setup! Overall I like this product and would recommend it, especially to readers!", "Title": "Great!!", "Date": "January 8, 2014"}, {"Author": "Brittany Clifford", "ReviewID": "R1LRESIG9ED8CH", "Overall": "4.0", "Content": "I purchased the Kindle FIre HDX 7 on black Friday and got a great deal.Pros:Great for readingEasy to useMayday feature is really awesome.Great size for traveling and reading in bedCons:I'm not sure if this is user error  - but I've tried many times to turn off the predict text and it just wont turn off. I even used the mayday button and the text support couldn't help.I gave up on using a lot of the social media apps on this... the quality isn't the best.", "Title": "I like it", "Date": "January 8, 2014"}, {"Author": "Sarah E. \"music Lover\"", "ReviewID": "R1Y0LV4H83J02I", "Overall": "5.0", "Content": "This is what I call my Kindle, not to be sarcastic, but to show that you don't have to spend a lot of money to have a good product. I love my kindle!!", "Title": "My Poormans IPad", "Date": "January 7, 2014"}, {"Author": "jesse", "ReviewID": "RLOCGRIFGE4RD", "Overall": "5.0", "Content": "WHAT A NEAT GIFT! MY KIDS LOVE IT! Picture quality is exquisite! get yourself one today and change your life forever!", "Title": "NEAT", "Date": "January 7, 2014"}, {"Author": "Gail", "ReviewID": "R7XMDP2G40YV0", "Overall": "5.0", "Content": "I love the fact that it is small and yet I can still go online. I love the HELP in person, that is very nice. I don't know all of the ins and outs of this yet, but it is very useful, and will be I feel", "Title": "Loving this HDX 7\"", "Date": "January 7, 2014"}, {"Author": "Michael Kopiec", "ReviewID": "R8Q462HD49L84", "Overall": "5.0", "Content": "I have been a Mac person since 1984 and still love Apple, but what sold me on the kindle was the mayday feature. The picture is as good as my 13 inch retina display Macbook Pro, and the mayday thing really works. Really.", "Title": "Great tablet", "Date": "January 7, 2014"}, {"Author": "Luvlunarya", "ReviewID": "R2XAHS3RMNTCO4", "Overall": "5.0", "Content": "I love my Kindle. The main reason I purchased it was for my books and magazines. My daughter likes watching her shows too!!", "Title": "Good buy", "Date": "January 5, 2014"}, {"Author": "Lauralee227", "ReviewID": "REYBW234GGYI6", "Overall": "5.0", "Content": "Performs better than expected.  A great gift.  Far exceeds my previous tablet.  Highly recommend to anyone looking to buy a tablet.", "Title": "Great Product", "Date": "January 5, 2014"}, {"Author": "marge mildner", "ReviewID": "R3LDY6R2RSP7OT", "Overall": "4.0", "Content": "Started out mid 2013 wanting a new phone and/or new computer.  Both are operating fine but older models. Had the opportunity to play with an I-pad.  Initialy taken by the device but eventually knew that I didn't want that particular device.  After seeing the size and capabilities of the Kindle Fire HD X ,I decided to take a chance.  It has more than made me excited about my choice.  Biggest reason is the size. I-pad was too big in size for me.  Thhis Kindle is just the right size for carrying around and still having access to my computer,books,newspapers and eventually I think I'll add Skype, since all but one of my children live 2 to 6 hours away.  Made my phone and computer both better to live with without having to upgrade.  Now I have the best of all worlds.", "Title": "Learning new skills all the time.", "Date": "January 5, 2014"}, {"Author": "denise reeves", "ReviewID": "R1CN8ASTABRB0T", "Overall": "5.0", "Content": "It not only allows me to read my books, but I've also learned how to play my games and watch my shows as well! My family is grateful for kindle e-books, the amount of space saved could now be used for other things.", "Title": "My new best friend!", "Date": "January 5, 2014"}, {"Author": "Mary Byrum", "ReviewID": "R47AKXFSKICUW", "Overall": "5.0", "Content": "I bought this for my son who only wanted this Kindle for Christmas. His eyes lit up and he was off to his room to enjoy it. I haven't used it, yet my son says it is everything he had hoped for and more. It is easy to use, clear display and the sound is powerful compared to other units he tried out. We got the unit with the advertisements. The advertisements in no way interferes with his use of this Kindle. In fact, he says he likes the advertisements to learn of what is new and available. The advertisements only show up upon turning the unit on then go away. I researched for some time as to which one to get for my son. I'm glad I chose this one.  I would recommend it to others without hesitation.", "Title": "Christmas wish came true!", "Date": "January 5, 2014"}, {"Author": "Handgun Hunter", "ReviewID": "R1NNVZ9ZE1L8V9", "Overall": "5.0", "Content": "Worth every penny.  Better interface, graphics, and battery life than my previous 2 kindles.  It is worth the money purchasing the version without the ads - those things get annoying after a while.", "Title": "Best Kindle yet!", "Date": "January 5, 2014"}, {"Author": "momtosix", "ReviewID": "RPZXFV7J7XF2A", "Overall": "5.0", "Content": "This is an upgrade for me from my kindle fire.  I love that it is smaller.  It is a big bonus that I can take a photo and upload to facebook right now.  16GB is more than I had before.I still love my old kindle and never ran out of memory.Highly recommend this easy to travel kindle. Wherever their is WI-FI I can connect.", "Title": "Kindle Fire HDX  is a nice investment in social media", "Date": "January 5, 2014"}, {"Author": "D. Tobias \"davtej\"", "ReviewID": "R1FW62L1H385TS", "Overall": "5.0", "Content": "I got the fire hdx 7 a few days ago and so far I love it and am looking forward to discovering new things about it.  Slight problem I had, the fire hdx wouldn't play my favorites you tube videos but my ipad air had no problem playing them.  anyone know why this would happen. Both Kindle and Ipad say they have incredible processors and other items to make outstanding systems.  I thought they would be on par.", "Title": "new to amazon", "Date": "January 5, 2014"}, {"Author": "j. king", "ReviewID": "R3QLIZDK1B9LF7", "Overall": "5.0", "Content": "I love the graphics and the speed of the new Kindle Fire HDX 7 inch tablet.  My kids jumped up and down when they each received this as a Christmas present.  They were glued to the device exploring all of the features including the amazing selection of apps and books available through the kindle store.  My kids being of school aged can easily use this convenient portable device for school research as well as downloading books from the kindle store at a more affordable price.  My daughter surprised me when she mentioned that the teachers were recommending the kindle fire to students.I especially like the May-Day button where you can instantaneously get live assistance to any question concerning the device.  At first this feature freaked my daughter but after getting help to rotate her screen, she quickly fell in love with this feature that is only available on the Kindle Fire HDX.  I also love that I can share my already kindle purchased books with them. I highly recommend to all.", "Title": "Amazing graphics on the Kindle Fire HDX", "Date": "January 5, 2014"}, {"Author": "Princess \"The Exceptional Lady\"", "ReviewID": "R2LLLSV22JVFL1", "Overall": "5.0", "Content": "Love love love it!!! This is my third kindle purchase. And I'm about to get a fourth for a gift for my mom", "Title": "highly recommended", "Date": "January 4, 2014"}, {"Author": "mollysgirl", "ReviewID": "R350KPJ9ZKJU2L", "Overall": "5.0", "Content": "I love the fact that my new kindle is so compact.  I can carry it in my purse and it works great at the gym.  the cover I bought for it is awesome and the clear protection sheets are really nice.", "Title": "compact", "Date": "January 4, 2014"}, {"Author": "Steven Distler", "ReviewID": "R23BVJGTWP4GNI", "Overall": "4.0", "Content": "I love the kindle fire HDX. The quality of the screen is Crystal clear. The only thing is I got the 16gb but when I check my memory it only sass says about 11gb. I would like to know what happened to the rest of my space", "Title": "awesome", "Date": "January 4, 2014"}, {"Author": "P. K. Grogger \"Fantasy Wizard\"", "ReviewID": "R15LXVKXQM2XQS", "Overall": "4.0", "Content": "Everything that was stated about the Kindle Fire HDX 7 is true! The clarity of the screen and the contrast and brightness of films and websites is excellent. The Internet is easily used. I just wish I had spent the money on the 8.9 version when watching films. I have not used the camera but will update this review when I have done so.", "Title": "The price is everything when deciding to by a Kindle Fire HDX; 7 or 8.9", "Date": "January 4, 2014"}, {"Author": "martin", "ReviewID": "R2UQ4A6D0C66AR", "Overall": "5.0", "Content": "I bought the kindle for my boy for Christmas, and we all love it, picture quality is great compared to the iPad, price is good to, bought it on cyber Monday", "Title": "Hdx", "Date": "January 3, 2014"}, {"Author": "co", "ReviewID": "R2WZV1JA5IOK18", "Overall": "5.0", "Content": "My daughter loves her new Kindle. I am so glad we bought it for her. The color is amazing and the sound is great. She has so much more storage space. I give it 5 stars for sure.", "Title": "Kindle Fire hdx is great", "Date": "January 3, 2014"}, {"Author": "Justin B.", "ReviewID": "R3JUOWYT3PLCQC", "Overall": "4.0", "Content": "It isn't as fluent and seamless as the newer Ipads but for the cost you cant beat it. I can see Kindle being very competitive as far as functionality in the next model or two. If they can do this and keep the cost down, the market is theirs.", "Title": "Great buy for the value", "Date": "January 3, 2014"}, {"Author": "MRL", "ReviewID": "R2XZ9AH2X56ZXU", "Overall": "2.0", "Content": "Very good device otherwise,but unfortunately they don't tell you that 16 g (really 12gig due to internal system requirements) is not enough to download a movie in hd. Otherwise a v good device for a commuter who likes to watch a movie while traveling to and fro work each day,display is exceptional.", "Title": "16g not enough to download hd movies!", "Date": "January 3, 2014"}, {"Author": "N. McCloskey \"NJ MOM\"", "ReviewID": "R1KAK23PPN3NAF", "Overall": "5.0", "Content": "I replaced my old back and white kindle with the Kindle Fire HDX.  It is lightning fast and has a beautiful display.  I even used the Mayday button twice and the reps were so helpful and kind.  (no, they can't see you :)What a great purchase.", "Title": "FANTASTIC!", "Date": "January 2, 2014"}, {"Author": "Michael Hulick", "ReviewID": "R18L5DMLBEUXHJ", "Overall": "5.0", "Content": "This is better than the iPad mini. It's far cheaper and has all the features the iPad mini has.  The screen resolution is sharper than the iPad mini. I like the Kindle Fire HDX.", "Title": "Better than the iPad mini", "Date": "January 2, 2014"}, {"Author": "Wanda Holmes", "ReviewID": "RYIBW0648RP8R", "Overall": "5.0", "Content": "So, glad that i purchase this gift for my grand daughter ! She and myself are very well entertain . Weill be purchasing prime in the near future.", "Title": "Awesome", "Date": "January 2, 2014"}, {"Author": "T. M. Massengill \"navy_wife19\"", "ReviewID": "R3JEFAZXSDZ4L4", "Overall": "4.0", "Content": "I've had a basic Kindle for a couple of years now, and I really enjoyed it.  I only used it to read books, so it met my needs wonderfully.  This Christmas I got a new Kindle Fire HDX from 'Santa'.  I love being able to do all of the other things that a tablet can do.  However, my basic Kindle had a feature that my new one does not:  the ability to group books into 'collections'.  I mostly read books that come from series.  Call me crazy, but I get invested in characters.  I have several different series that I enjoy, so it frustrates me that I cannot group books in the same series to one collection.  I can have them listed by author, but I have two different series written by the same author.  After that it's alphabetical.  On my basic Kindle, I was able to put them in order.", "Title": "Missing Feature", "Date": "January 2, 2014"}, {"Author": "Gran Ann", "ReviewID": "R2LTXMMSSBBT3P", "Overall": "2.0", "Content": "I received my Kindle Fire 4 days ago and have had nothing but problems with utilizing the audio function for book reading.  I'm not talking about purchasing an audio book.  This is the \"play to listen\" function on books I have purchased from Amazon which I like to listen to at night or on trips.  The audio function will work for a few pages and stop on 1 title, or on another title stop at the beginning of each chapter, etc..  After several hours with 6 different people at \"Amazon assist\" , I now have been told a work ticket has been sent to developers about the issue and I will probably hear something from someone within 5 days.  The 6 people have all been extremely nice, courteous and completely baffled with this problem.  I love the Amazon assist button.There has been an inference that perhaps it is a fault of the publishers causing the problem.  My older Kindle, however, plays the same books without any glitches.  Since on a normal day the reading function will be used more than any other I will be returning the product if a fix is not discovered or a replacement is not offered that will provide the service I have come to expect from Amazon.  Wow, this is the biggest disappointment so far in 2014!!  I had so looked forward to this gift I gave myself!", "Title": "Kindle Fire HDX Problem", "Date": "January 2, 2014"}, {"Author": "Paula Marshall", "ReviewID": "R2PN4XBWX33Z13", "Overall": "5.0", "Content": "I was skeptical about purchasing this item but once i got it I began to appreciate all of the different things one can do with this tablet but most of all i love the online help screen.", "Title": "kindle fire", "Date": "January 2, 2014"}, {"Author": "Donald T", "ReviewID": "R3QGR45R0X0R7C", "Overall": "5.0", "Content": "If you are an Amazon Prime member this is a no nonsense purchase. Most apps are free. This tablet won't break your budget and is one of the best purchases for the money that I have ever made. Sound and display are great.", "Title": "Amazing Tablet!", "Date": "January 2, 2014"}, {"Author": "Carol", "ReviewID": "ROPA1RSF8ZMQ7", "Overall": "5.0", "Content": "I am not a \"techie\" and this was easy to start and navigate for this beginner.I had no trouble shopping and down loading or changing settings.", "Title": "Love it!", "Date": "January 2, 2014"}, {"Author": "Shiloh S.", "ReviewID": "R2R6FZTRCXZTH5", "Overall": "5.0", "Content": "We bought this for my son for Christmas. It was easily his favorite Christmas present. It's easy to operate, the images are amazing, it takes great pictures... I think it's pretty handy that I can review apps from my pc and send them to the kindle.", "Title": "My 5yo loves it!", "Date": "January 2, 2014"}, {"Author": "mbd", "ReviewID": "R3BX41JY0KZXD8", "Overall": "5.0", "Content": "for the money, i am not sure you can find a better device.  i like the smaller (7\") form factor, as it is just a lot easier for me to use.  the picture is fantastic, and the text for reading is unbelievably clear.  movies are also great, and i am glad they finally have added bluetooth so that i can play it to my wireless headphones.i do miss a rear facing camera, and a number of apps that work on the older fire don't seem to work very well (some audio problems)", "Title": "excellent", "Date": "January 2, 2014"}, {"Author": "JWoods \"Judi\"", "ReviewID": "R9EWSF8U430AM", "Overall": "5.0", "Content": "This purchase was an upgrade for me from the Kindle Fire.  I am still getting acquainted with the features, but I would definitely recommend it to my friends and family.  The pictures are sharp and brilliant, especially when streaming a movie.  When I stream music from Pandora, I use an external speaker which makes it easier to adjust the sound.", "Title": "Kindle Fire HDX 7\"", "Date": "January 2, 2014"}, {"Author": "Ruby J. DeForest", "ReviewID": "R62QQ52XJUSLZ", "Overall": "5.0", "Content": "I am pleasantly surprised by the capabilities of this tablet.  It has a great picture and sound quality for watching video.As a reader it has some very nice features such as combining audio books with Kindle books.Browsing the web it fast and easy.It's was easy to set up my eMail account connection.", "Title": "Great Buy!!!", "Date": "January 2, 2014"}, {"Author": "Vandermin", "ReviewID": "R2AORZR0IZAY47", "Overall": "5.0", "Content": "It did not taste the way i thought it would very crunchy and cut my mouth. I need four more words O nope now im done", "Title": "it ok i guess", "Date": "January 2, 2014"}, {"Author": "JMG", "ReviewID": "R2154T8FZZYNK3", "Overall": "4.0", "Content": "So easy to use, access apps, get books from purchase or library loan.  I Was an iPad user prior. Prefer comfort of this weight and size. Not as many apps but the selections are not bad and figure given time more will be added. This unit will pay for itself by renting college textbooks from Amazon compared to buying hard book on campus plus loads lighter in backpack.", "Title": "love the move to kindle", "Date": "January 2, 2014"}, {"Author": "Douglas McDermott", "ReviewID": "R27ZNVZOR2SDUN", "Overall": "5.0", "Content": "My step mother is over the moon with it. The Kindle HDX Has everything she wanted in a tablet. The price was on point, she loves it, can't beat that. Thank you!", "Title": "Kindle HDX was a great gift to give.", "Date": "December 30, 2013"}, {"Author": "Catherine Darsey", "ReviewID": "RICHR70UWHG8R", "Overall": "5.0", "Content": "I've been wanting a kindle for some time and my husband got me this one for Christmas. It does everything my cell phone does except make phone calls.", "Title": "Love, love, love", "Date": "December 30, 2013"}, {"Author": "Gi Man Kim", "ReviewID": "R2LIFUIR52AV96", "Overall": "5.0", "Content": "First off, I've owned iPad II and currently own Nexus 7 (2nd gen).  I used my tablets for mostly playing music, reading digital books, watching videos (youtube, etc...), social media and surfing the web with little bit of business use mixed in for my work.I got the kindle fire HDX for my wife.  She recently discovered how great the Kindle books are so she's been hogging my Nexus to read.  So I figured, I'll get her the Kindle since it was on sale for X-mas.She loves her Kindle.  It's very simple and easy to use and thing is very responsive and fast!  Might be faster than my Nexus 7.  It's very user-friendly and she was off and going in no time even though she's not very techonology savvy.It is great for consumption of media (mainly Amazon media) and the Silk browser is quick and easy to use.  So if your looking for a tablet that you are going to use to play media from Amazon and to surf the web and play games.  Don't look any further.  If you are looking for a tablet that is more open and can be used for enterprising and business, look elsewhere.", "Title": "Exceeded my expectations", "Date": "December 30, 2013"}, {"Author": "Thomas L Guffey", "ReviewID": "R1ALJ5M7Y7ZU4H", "Overall": "5.0", "Content": "Awesome, Awesome, Awesome. Love everything about it. Good battery life, good looking device, and the 7 inch is much easier to handle then the 8.9 .", "Title": "Awesomeness", "Date": "December 29, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R24Q8A3QGSW8IB", "Overall": "5.0", "Content": "The kindle HDX is faster than the HDX color and the graphics is fantastic I have. 32 kbps of memory", "Title": "was a Christmas gift from my loving husband", "Date": "December 29, 2013"}, {"Author": "ANIL RAMKISSOON", "ReviewID": "ROU6FHMM5FZYH", "Overall": "5.0", "Content": "This is one of the best tablets for anybody age. I use for work and play games in my FreeTime at home. The pictures and sound is a big improvement of the first kindle fire. You will not regret buy this.", "Title": "One of the best tablets", "Date": "December 29, 2013"}, {"Author": "Donna Faus", "ReviewID": "R1BUB3KCNGFEMZ", "Overall": "5.0", "Content": "I absolutely love my new Kindle Fire HDX 7\". It completely exceeds my expectations! I would recommend it to anyone.", "Title": "I LOVE IT!!!", "Date": "December 29, 2013"}, {"Author": "T. J. Jones \"ImaginaryFlowersUSA\"", "ReviewID": "RVJST57EM58WN", "Overall": "5.0", "Content": "I update to the latest Kindle every year.  The HDX 7\" is great with Wi-Fi.  I like the 64 GB and quad core processor.  The dual band wi-fi can use more power than my Internet can really deliver.  I will probably have to update my whole Internet package.  When I use the wi-fi to do downloads, everything on my wi-fi slows to a crawl and my Internet movies on Amazon and home computer freeze till it is done.  I think my phone company only offers 100 Mbps with my current package. This kindle is powerful and takes over my whole Wi-Fi service.The power adapter is a little different this year and goes in at an angle (thought it didn't fit).  The adapter comes with the Kindle.I will be keeping my old Kindle Fire HD, because I still enjoy it and some of the old apps I am not tired of yet (not compatible to HDX).  I will be able to upload more of my pdf's to this newer Kindle, because pdf's use a lot more space. Also I can download more TV shows and movies, since I live in the Amazon ecosystem.I like the clock on the screen is back. When I open the Kindle cover, the clock is in the corner with the date.  That was not on the HD, but was on the first Fire (it was bigger).I like the offers, because it is important to me what else is available.  The screen is beautiful as always. I did have to make some adjustments to brightness (using settings) and the books (using view) I am reading. Actually for us older folks, brighter is better.The sound is nice. I was watching PBS channel out in my yard and my neighbors could hear it. The PBS channel app  was not something I was aware of before, but loving it now (even with my Internet service).The HDX is smaller than the HD 7\", but the screen is still the same size.The camera on the 7\"HDX is better than the HD.  I really like it, because it comes with its own app, and I don't have to download a free app like last year. The one on my 7\" HD has problems but was free.", "Title": "so far so good", "Date": "December 27, 2013"}, {"Author": "Theresa L. Lane \"EnglishUnicorn\"", "ReviewID": "R2268R0F3CW949", "Overall": "5.0", "Content": "We have a Google Chromecast and Iphones here. This works with our existing technology ecosystem. It recognized the Google Chromecast instantly. No issues with compatibility. Lots of aps. Excellent speed, streaming, OS runs faster than any Android or IOS I have seen. Very easy to use and great MAYDAY support on Christmas day. I did not and will not regret this purchase. We Chromecast Netflix off this as well as Pandora and several other apps. Sound on this thing is EPICLY AWESOME and LOUD. Amazon has officially won the tablet war. Ipad..it is time to lower your price to TRY to be competitive.", "Title": "Buy this!", "Date": "December 25, 2013"}, {"Author": "Eric Houser", "ReviewID": "R3AAOSZCD8HFVP", "Overall": "5.0", "Content": "Great to use with Amazon Prime.  Large amount of movies and TV shows to choose from for free.  Lending library is also cheap and convenient..", "Title": "Easy to use, great with Amazon Prime", "Date": "December 25, 2013"}, {"Author": "geoerl niles", "ReviewID": "R1U4W9TPS0C60Y", "Overall": "4.0", "Content": "Very clear, good connectivity. My wife really likes it! The apps are easy to find! And the movies are crystal clear", "Title": "Great device", "Date": "December 25, 2013"}, {"Author": "Diane D", "ReviewID": "R34IKPLBDCM3BC", "Overall": "5.0", "Content": "This is my 4th Kindle. I started with the 2nd generation. It was ok, but hard to read outside. Then I bought the Kindle Fire. Much better. But it broke after a couple of years. I bought my husband a Paper white, which he loves. BUT this HDX is great !  The picture quality is excellent. My grandson loves the Free Time so he can play his games and read books. I used the Mayday feature and was very impressed with the service. I like it because it is lighter than the original Kindle Fire too. Easy to navigate and search for things. I would highly recommend this to anyone. I LOVE IT !!!!!!", "Title": "Best Kindle yet", "Date": "December 25, 2013"}, {"Author": "Kindle Customer \"ReadFreak\"", "ReviewID": "R3ELBU9QWRYEEV", "Overall": "4.0", "Content": "Yes I got it today, so no real issues. It's my third kindle my fire HD is being passed on to another family member. It's still going strong. The light bleed which I was worried about due to other reviews is insignificant to me and usually LED lights bother me. So I'm glad this worked out. Unless I look for it I don't notice it. The browser is much faster and I'm happy with the set up of buttons and such. The mayday button is nice too for when you really can't figure something out. Overall I'm looking forward to this becoming my new favorite device. I didn't give 5 stars as I've only had it for about 4 hours ;)", "Title": "love it..", "Date": "December 25, 2013"}, {"Author": "Kyle Beck", "ReviewID": "R323OJOI2NDQQ1", "Overall": "4.0", "Content": "Okay so this device is outstanding.  I am coming from the original kindle fire and it was well worth the upgrade.  The screen is amazing, very sharp, definitely as good if not better than the retina dispalay.  The sound is also very good.  The new interface is great.  It is really fast and fluid.  My only complaints are the location of the volume and power buttons, as well as the camera.  They are positioned in A way vest suited for holding the device landscape, while I would personally prefer them to be positioned in more of a portrait manner.  Another plus to the device is the Appstore has grown a lot since the first kindle fire.  It has most of the games that iOS has.  The only thing it lacks is a a program like word, excell, and PowerPoint.  Over all I would definitely recommend this device to anyone who likes an amazing display, a very decent battery life, great sound, a good Appstore, and a light sleek device.", "Title": "AMAZING", "Date": "December 25, 2013"}, {"Author": "Linda", "ReviewID": "R1DO27A2RC6UYB", "Overall": "5.0", "Content": "My laptop died, with no hope of repair, the day after I ordered this Kindle.  So far, I'm not missing it.  I do find a stylus makes me more comfortable than poking about the screen with my clumsy fingers.  I also have a Kindle keyboard, which remains my favorite for lounging and reading.  Comparing the Fire HDX and the Kindle keyboard is a bit like the old apples and oranges comparison, though.  It's really, in my mind, comparing an ereader to a tablet.This Kindle is great fun, particularly if you enjoy streaming media and wandering around online.  It's an amazing amount of technology in a tiny package.", "Title": "Happy", "Date": "December 25, 2013"}, {"Author": "Ben and Jess", "ReviewID": "R16D8300HC4PQL", "Overall": "5.0", "Content": "My boyfriend and I got a Kindle together for christmas and we love it. Easy to use and the picture is amazing. :) thank you", "Title": "So much fun", "Date": "December 16, 2013"}, {"Author": "Shirley G", "ReviewID": "R1KH13B7TCHXD3", "Overall": "5.0", "Content": "Love it! Had one of the first Kindles to come out, never left the house without it! I used it daily! I purchased this one after my sister gave it rave reviews! Have had it only a few days, still trying to discover all I can do with it. Have down loaded songs and books on it, I Love the color on it! Have watched a couple movies on it, love the picture and sound quality. I love that it is light weight. Am VERY satisfied with my purchase! I never leave the house with out it! Would definitely recommend it to anyone who loves to read, listen to music or watch movies. The price was affordable too! Can't say enough good things about it!!", "Title": "Love it!!!!", "Date": "December 16, 2013"}, {"Author": "L. Vanness \"VERY HAPPY\"", "ReviewID": "R1MYU30GEYXRTG", "Overall": "5.0", "Content": "WELL needless to say my husband loves his new toy.  It is great he now has some place to read books and do email, so he is very happy, does not talk much to me but he is fine.", "Title": "GOOD PURCHASE!!!!", "Date": "December 9, 2013"}, {"Author": "J. Jones", "ReviewID": "RH4VJELISOG4D", "Overall": "5.0", "Content": "The picture is absolutely amazing!  Only wish I would have got the 64gb instead of the 32.  The HD downloaded movies and shows are taking up alot of room.", "Title": "Great Picture!", "Date": "December 9, 2013"}, {"Author": "Tre", "ReviewID": "R1GCD75Z2LJ3A7", "Overall": "5.0", "Content": "I bought this for my dad for Christmas and I've been playing with it and I must say I think they did a great job with this one. Especially if you aren't very tech savy this tablet is great.", "Title": "Amazing for the money!", "Date": "December 9, 2013"}, {"Author": "Joan McCormick", "ReviewID": "R3SQMK27K4908O", "Overall": "5.0", "Content": "Only have had this a few days, but have grown attached to it :)  This is my first electronic device other than my sell phone and computer.  Love how easy it is to use and also very easy to read books on.  The picture quality is outstanding!  Only problem is now I get carried away relaxing with all the activities it offers and don't get my work done :)", "Title": "Fun Device", "Date": "December 9, 2013"}, {"Author": "Smcswiney", "ReviewID": "R107C5L64E9TJW", "Overall": "5.0", "Content": "I never been a huge fan of tablets but I really like this product. My boyfriend got it for me as a early Christmas gift even though I didn't want it and now I take it everywhere with me.", "Title": "Great Christmas gift", "Date": "December 9, 2013"}, {"Author": "Trudy McGuire", "ReviewID": "R38CJWQAXH4L7E", "Overall": "5.0", "Content": "I absolutely love it.  The picture is great, I have to fight the kids to get a chance to use it.  Its small enough to bring with me every where I go.  I even bought each of my kids one of their own so I can use mine!", "Title": "This was a great purchase", "Date": "December 9, 2013"}, {"Author": "Uhura", "ReviewID": "R1J562PK66XX5B", "Overall": "5.0", "Content": "Very Handy, light weight and fits perfectly in my purse.  Sometimes myipad is too large,  the Kindle Fire HDX 7\" is the perfect size.", "Title": "Perfect", "Date": "December 9, 2013"}, {"Author": "footloose 321", "ReviewID": "R1Z3AXPJKGQ6QU", "Overall": "5.0", "Content": "It was so hard making a decison on a tablet. I bought the color nook years ago and thought I didn't need to upgrade. I coulnd't decide between the ipad mini and the fire hdx.  I chose the later and I love it. It is so clear and crisp.  I like all the free stuff amazon offers with it.  Great buy.", "Title": "Love my new tablet", "Date": "December 9, 2013"}, {"Author": "cw4ret@msn.com", "ReviewID": "R19FX3U6HPGPVY", "Overall": "5.0", "Content": "Clear, sharp, and fast.  Only weakness might be short battery life and long charging times compared to other Kindle readers.", "Title": "I really like it.", "Date": "December 8, 2013"}, {"Author": "Bruce Lawson", "ReviewID": "R3SCGKQ3XTN06K", "Overall": "5.0", "Content": "Nice item fast shipping, seems like it's gonna work out well for our needs, may buy another one in the future", "Title": "Nice product, seems like it's going to work out well for our needs", "Date": "December 8, 2013"}, {"Author": "Bridget K Ament", "ReviewID": "RT3PK4P27V4OP", "Overall": "5.0", "Content": "I absolutely love the kindle fire. I always wanted a tablet and this one goes above and beyond my expectations!_", "Title": "best tablet ever!", "Date": "December 8, 2013"}, {"Author": "Jason Mallett", "ReviewID": "RIAE54B3L6EJK", "Overall": "5.0", "Content": "Best tablet ever. The interface is beautiful. Screen resolution is great. Can't express how awesome this thing is. Love Prime too.", "Title": "Best Tablet", "Date": "December 8, 2013"}, {"Author": "Steve", "ReviewID": "R1MNTHOVR9V1OR", "Overall": "5.0", "Content": "Works great, always nice to see an updated model.  Fast and super clear pictures.  Works exceptionally well with streaming videos.", "Title": "Love the new HDX - it", "Date": "December 8, 2013"}, {"Author": "Paula Renee Klepac", "ReviewID": "R34WGRPXAAXACR", "Overall": "5.0", "Content": "I really like this device!!!! I am an Apple girl but this little device has got me inspired to try other things!!!!", "Title": "loving it!!", "Date": "December 8, 2013"}, {"Author": "Debra Alexander", "ReviewID": "R6N0U6O1FS54G", "Overall": "5.0", "Content": "I got my Kindle Fire & inch\" HDX an so far I love it took me a while to learn how to set up certain applications I wanted on it but I was really disappointed that it didn't come with a paper book instead of having to go on my computer to find out how to set up youtube and other programs", "Title": "Kindle Fire HDX", "Date": "December 8, 2013"}, {"Author": "Elizabeth", "ReviewID": "R2HKD28I2Z0G4W", "Overall": "5.0", "Content": "I think this Kinfle is great.  It does everything a tablet should do and you can carry your books with you.", "Title": "Top choice", "Date": "December 8, 2013"}, {"Author": "T. Monk-Shadee", "ReviewID": "R1BRY95WM7T666", "Overall": "4.0", "Content": "The HDX is just what I wanted! Would be 5 stars if there were a more interesting  and diverse selection of apps.", "Title": "Almost 5 Stars", "Date": "December 8, 2013"}, {"Author": "mandolin", "ReviewID": "R34VZNDBBZBIT", "Overall": "5.0", "Content": "I LOVE MY NEW KINDLE! so glad i didn't spend the extra money on an ipad. this is perfect for me in every way, especially when it comes to reading.", "Title": "love!", "Date": "December 8, 2013"}, {"Author": "catwalk", "ReviewID": "R21LK2A8V9TY9V", "Overall": "5.0", "Content": "I find the quality of pic excellent. I love the video link to movies and television shows. I just wish there were more television shows available. The Kindle Fire HDX is easy to use. The streaming is fast.", "Title": "Enids review", "Date": "November 14, 2013"}, {"Author": "Dorothy Facklam", "ReviewID": "RMY1KSPY3X5XT", "Overall": "5.0", "Content": "I love my Kindle Fire HDX. I am still learning a lot about it and how to use it. I never had a tablet before and this is nice because it is the right size to take any place with you.", "Title": "My Kindle Fire", "Date": "November 14, 2013"}, {"Author": "J Pearson", "ReviewID": "R5NHLTUHRVJTA", "Overall": "5.0", "Content": "What an awesome product.  I really enjoyed using it, but decided I preferred a regular camera & purchased the 8.9.  I returned this product. The camera on the 7\" is fine for Skype, but it is very disconcerting to use it for anything else.  I previously had the ipad2.  The fire hdx turns on & starts up rather slowly.  But the quality of picture and ease in reading books creates a wondrous experience.", "Title": "Kindle hdx is easy on the eyes", "Date": "November 13, 2013"}, {"Author": "Laura Schering", "ReviewID": "R1Q8NLNX5KY9ZV", "Overall": "5.0", "Content": "Love this tablet. Has met all my ends plus. Easy to use. Very sensitive to the touch. Graphic s are clear, bright and excellent.", "Title": "Great tablet", "Date": "November 13, 2013"}, {"Author": "S. E. Hochstetler", "ReviewID": "R32GME7406IWTK", "Overall": "5.0", "Content": "love, love, love my hdx. I have the kindle keyboard, i have the kindle fire and now i have the hdx. the grapics are great! it is faster, lighter. It has some great new features like mayday and mirror...", "Title": "AWESOME!!", "Date": "December 10, 2013"}, {"Author": "Ken Z. \"kzVegas\"", "ReviewID": "R2WPHRVRHQ379W", "Overall": "3.0", "Content": "Like other reviewers I'm a heavy tablet user and I can setup several tablets next to one another to compare strengths and weaknesses.  I have currently:1.) Kindle Fire (1st Gen.)2.) Kindle Fire HD 8.3 (2nd Gen.)3.) Kindle Fire HDX (3rd Gen Fire)4.) iPad Air  (5th Gen iPad)5.) iPad Mini with Retina Display (2nd Gen iPad Mini)6.) Google Nexus 7 (2013)7.) Nvidia Shield8.) ASUS Transformer TF-101First, let me say I think the Kindle Fire platform is really nice when compared to the straight-up Google android experience.  Amazon does a great job of bridging the technical gaps for a user wanting to use a tablet and not have to constantly enter their email and password.  The Amazon docs, photos, music and video compare better in use to Apple's iCloud experience and makes the Amazon prime a solid investment.  Additionally, the horsepower of the Kindle HDX is amazing and makes this tablet for the holiday 2013 season a solid gaming platform.  My own benchmarking of the Kindle Fire HDX shows that gaming performance and CPU performance place this unit within the same performance bracket as the current generation of iPads and the Nvidia sheild.  Which is saying something when the HDX is half the cost of an iPad mini and 2/3rds the cost of a Nvidia shield.My disappointment comes from the screen on the Kindle fire HDX.  The HDX's screen shows a very visible and noticeable blue ring around the display's edge.  I've measured the blue ring to be one-eighth of inch along the long edges of the screen and slightly less on the short edges of the screen.  These blue edges really become notable when you are reading a book or browsing a web page that have white page backgrounds.  The blue ringing is much less noticeable when viewing the carousel page (which are grey) or running a app that uses something darker around the edges.I can not recommend the Kindle Fire HDX to my friends, family and colleagues because of what I consider to be design defect in the screen.  This blue ring is not apparent on either my Kindle Fire or Kindle Fire HD 8.9 or other tablets that I have.", "Title": "Disappointing when compared to past Kindle Fire's and the current crop of 7-inch Tablets", "Date": "December 9, 2013"}, {"Author": "janell2012np", "ReviewID": "R2S1HSZDVWCIRS", "Overall": "5.0", "Content": "I absolutely love my new Kindle Fire HDX! It's the most amazing tablet ever. The mayday feature is a lifesaver. And you barely have to wait for someone to help you. The person is nice, but the better part is that they actually know what they are doing. I wouldn't trade my Kindle in the world! I always carry it with me!", "Title": "Best Tablet Ever!!!!", "Date": "December 9, 2013"}, {"Author": "Andrew V.", "ReviewID": "RKG7J1DVGBB8A", "Overall": "4.0", "Content": "The only negative I've found after 4 days use is the inability to play Flash video.  Unfortunately Adobe no longer offers Flash Player for Android.", "Title": "Great tablet for the price", "Date": "December 8, 2013"}, {"Author": "Derick", "ReviewID": "R2804XSUCWHHSN", "Overall": "4.0", "Content": "Great screen, fast and responsive.  The new features in the Mojito OS are terrific additions and make owning a Kindle Fire much more rewarding.  Its everything you could want out of a tablet...except for two things.There's no HDMI port.  It didn't even occur to me to look for this, the old Kindle Fire HD has it, so I guess I thought it would be a given.  Instead it relies on Miracast.  Miracast is supposed to be like a wireless HDMI standard, but you have to buy a $50+ device to make it work.  The other thing missing from this is USB hosting, which is present in every Android 3.1+ device.  I wanted to use my Kindle Fire HDX to upload photos from my camera to Facebook and the like while I was out on vacation by using a Micro USB SD Card Reader.The no HDMI thing doesn't bug me as much as the USB thing, I really wanted to be able to look at my vacation photos on my Kindle Fire HDX while I was out on vacation.  To be honest, if I hadn't bought this on Cyber Monday I would be returning it for a Nexus 7 for just this one thing.  Maybe its a software limitation that Amazon can fix, I don't know, but I hope it is, and they do indeed fix it.", "Title": "No HDMI or USB Hosting", "Date": "December 8, 2013"}, {"Author": "Scott", "ReviewID": "RIEDN27K0KKN7", "Overall": "4.0", "Content": "Regarding blue light........I poured through all the reviews on this device, so I was well aware of the negativity surrounding the blue light used in the Kindle.  I would say this:  If your intended use of this device is to read Kindle books, I would run away.  Far away.  Go with the black&white; Kindle.  But, if you plan on doing just about anything else, the Kindle HDX is an excellent choice.  You'll never notice the blue edges, except for maybe web pages.What blew me away most about the Kindle was the sound.  I have had every iPad since day 1 and have always just accepted the speaker quality.  I'll still use my iPad simply because of all the Apps I already enjoy, but for movies and TV shows I'll go to the Kindle every time.  Amazing sound.  Why can't Apple do this with the iPad?Bottom line is:  Buy it. It is well worth the money.  I bought the one with the ads and they don't really bother me at all.  They are tailored to what you look at and or purchase on Amazon, so I don't mind that marketing approach.", "Title": "Regarding Blue Light.....", "Date": "December 8, 2013"}, {"Author": "Birdleganger", "ReviewID": "R2DECEQH2C2DV7", "Overall": "5.0", "Content": "So far so good!  The unit itself is cute.  My youngest is enjoying the free games -- haven't had any issues with any of the programs yet -- battery life is pretty good though we have to charge it every day (maybe it isn't that good, I don't know.  This is our first Kindle).Shipping was wicked fast.  Even with buying it on Thanksgiving night...we had it by Monday.  Then lo and behold a few days later it was (of course) an additional $50 off.  Quick online chat with Kindle customer service (about 7 minutes) and BAM!  $50 refunded and an email confirmation thanking me for allowing them to refund me $50 LOL!Set up was cake -- less than 5 minutes and we were off and rolling.  Amazon sent an email the day it was delivered with links to everything we needed.  Unit moves through any program we throw at it with ease.  Videos/movies - games - web sites are all quick and crystal clear.  Haven't tried all it has to offer yet -- but I see no reason to worry  I have no complaints. The one I did have (price drop) got taken care immediately.I'm certain some people do have problems -- but rather than run to Amazon reviews to complain -- most sane people at least contact Amazon first to try to fix the problem.  I get so tired of the negative reviews that say \"all these positive reviews are made up/fake because I had problems with mine!\" I tend to lean along the lines that someone who is that paranoid and angry/bitter/nasty about it is not going to be a credible source for my buying choices.Very Happy!  Great unit - so glad we finally got one!!", "Title": "First Kindle - LAFS...", "Date": "December 7, 2013"}, {"Author": "Sue Boyle \"blue9244\"", "ReviewID": "R16TEP36W5BG99", "Overall": "4.0", "Content": "I would probably give this 5 stars if they hadn't decided, in their infinite wisdom, to remove the micro HDMI outlet.  I had a Fire HD and used it to stream Amazon Prime movies to my TV.  Now I can't do that.  I gave my older Kindle to my daughter and I am left with nothing that I can stream to my TV.  I bought a Netgear Push2TV but that did not work.  I spent hours with the rep from Netgear trying to get it up and running.Otherwise the new Kindle has better battery power and the screen is amazing.  The colors are vivid and games are a joy to play.  I would highly recommend the HDX if you don't care about streaming movies.  It's also quite light-weight.  All in all, I love it!  I just wish I could stream movies and TV shows to my big (now useless) TV set.", "Title": "Beautiful colors and crisp display but no miccro HDMI slot!", "Date": "December 7, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R27DLBLQKPR8ZO", "Overall": "4.0", "Content": "I have all of the Kindle Fire models. This version is improved over last years. The screen and sound are amazing! I did compare side by side and there is noticeable clarity in the picture quality playing a movie. The set up was very fast, love that the charger is included this year. The Kindle came already registered to me, saving time in setup. I have not set up email yet but previous versions worked fine. The wi fi connected very fast, an improvement from the HD model, where at times I have had to turn the kindle off and on to get a connection.  This is slightly smaller and lighter than the HD version. That is not a plus to me because I like the wider edge on the HD. So an old case will not fit. What I do not like is the rearranged buttons for power and volume! They are located on the back side and the kindle will require a specialized case in order to access them if it is being used in the case. They also did away with the HDMI port ! I use that feature on my original HD model frequently. Also the cable port is at an angle and off to one side. This is probably because the device is so thin. It compares to the I pad mini, but the mini has a larger viewing area.  If you have last years model I would keep it. If you do not own a Fire yet you will not be dissatisfied with the HDX.  I have not tried out the camera, I am already spoiled with the I pad mini camera which is wonderful, so it does not make a difference that the Kindle has one.  My favorite feature is Amazon Prime videos, and the speakers.  This is an excellent device for the price! I give it  only 4 stars because of the button location and no HDMI plug in option.", "Title": "Nice product", "Date": "December 7, 2013"}, {"Author": "Catherine Smith", "ReviewID": "R2SSF5920H0ZE6", "Overall": "4.0", "Content": "have decided to return it. The tablet itself is great, but apps and customization are limited due to it being a heavily modified version of Android and is too tightly integrated with Amazon products. It's still more of a reader than a tablet.", "Title": "I like it, but...", "Date": "December 6, 2013"}, {"Author": "Mom of 3 stinky boys! \"Lindsay V.\"", "ReviewID": "R3LUANS54MNJ49", "Overall": "5.0", "Content": "This is a fun little tablet. There are a few pros and a few cons to it though.Pros:I like the smaller size. We also have a 10 inch tablet and this one is much easier to carry around with me.I LOVE the Free Time app for Kids. I love knowing that I can hand my tablet over to my 3 year old and he'll only be able to see and play what I approve for him. I also like that I don't have to tell him when time's up. He just hands me back the tablet and goes to play.Reading on this Kindle is so nice. I love that it holds my spot and tells me how far along I am in the book. I also like that I have access to all the books I've bought in one place. It's a lot easier to carry this around than it is to carry around a heavy book.Cons:I'm not so fond of where the power button is. It's kind of awkward to find. As well as the charging port. It's at an odd angle and I have to actually pay attention to what I'm doing when I plug it in.The apps from the Kindle store are few and far between. There aren't a whole lot of them. There are the basic ones for social networking and a few good (free) games. But I'm hoping that in the near future Amazon will come out with a lot more apps.I also wish I could add more storage space to this like the android tablets. However it's not a HUGE deal because you get storage on your cloud. Which is really nice.Overall I think this is a fun little tablet. I wish I had gotten the one without the special offers as those can get annoying but oh well. I enjoy using this tablet and so do my kids. It does pretty much everything I need a tablet to do!", "Title": "Great little tablet!", "Date": "December 4, 2013"}, {"Author": "Joyce Scott Blessed by the best. \"So Blessed.\"", "ReviewID": "RUXLPIBTDYG6N", "Overall": "5.0", "Content": "I love this  thing! It can do all the things I like to do . The storage space through Amazon  cloud was a huge selling point.  The 7 inch screen size is ample room for me to look at things without strain. I am also very happy with the \"May Day“ button and the representatives that I have talked to. A+++.  I would recommend this Kindle  to anyone.", "Title": "Amazon hit this one out of the park.!", "Date": "December 4, 2013"}, {"Author": "Christopher White", "ReviewID": "R2XE3OST1BQI1D", "Overall": "5.0", "Content": "Absolutely love this tablet. If you are a prime user and into Amazon books and movies this is the tablet for you. A lot of people mentioned a blue light around the edges of the page when reading, I simply changed the background to the black with white lettering and this eliminates this and also makes it easier to read especially with no light at night.", "Title": "Haven't put it down since I got it!", "Date": "December 3, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1S3T2FFFW3UBZ", "Overall": "5.0", "Content": "I absolutely love this tablet! So easy to use, has lots of features, and the price is right. I highly recommend this product.", "Title": "Worth every penny", "Date": "December 3, 2013"}, {"Author": "mon lucas", "ReviewID": "R3T6Z9ML0UFRIR", "Overall": "5.0", "Content": "Love it !  I was waiting for the iPad Mini retina display however decide to get the Kindle fire HDX instead. Love it is better than expected. Love the May day help. The display is sharp and is very fast . if you use for Facebook, emails and shopping there is no better way to Go.  Still testing battery life .  Just wondering if I should had bought the bigger 8.9 kindle HDX. If you are member of Amazon prime don't wait . Get it now.", "Title": "love it!", "Date": "November 29, 2013"}, {"Author": "Beate73", "ReviewID": "R22CPX7DUXUDT3", "Overall": "3.0", "Content": "I've now had the new Fire HDX for a couple days, and being a now long time iPad user, it's a good alternate to iPad. There aren't as many apps for the Fire as you have for iPad, but I'm guessing that's just a matter of time before they fix that.I mainly bought the Fire so that I could add my very extensive book collection to it. For reading I've been using the Kindle Touch 3GB, and I have more books than I have space. I found it tedious having to add and delete books all the time. I thought the Fire would be a good step up.If you have a couple hundred books, the Fire is perfect for your book collection. But if you're like me, and have been using Kindle for years and have a 6K+ collection, you might be disappointed.First, you have to click on every single book to import it onto the Fire. There is no batching. I really wish they could have had an \"add whole collection\" option. Importing is tedious at best.Second, you can't just import your old collections and believe that all books will automatically place themselves in the correct collection. First of all, I now have collections from my very first Kindle on the Fire. A Kindle that has been deregistered from my account for ever.The collections that did import correctly, are a mess. Books are missing, or the wrong books are in the wrong collection.Then there is the books that aren't in a collection. If you're viewing your books as collections, you can't find the books that aren't in a collection. It is simply impossible to figure out which book is in a collection and which book needs to go in a collection. I like to organize my books, and collections were the perfect way to do so. On the Touch, that is. On the Fire, it's all a big pile'o'crap, and I can't figure out what's up and what's down.So far, bookwise, Fire has been a huge letdown for me. I was really excited about getting the new HDX with the 64GB hard drive, thinking I'd finally be able to put by books in order. Not so much.As far as reading experience, the Fire is very good. The screen is clear, the text easy to read, and it doesn't hurt your eyes like the iPad does. Which is the only reason I give the Fire HDX 3/5 stars. I really hope Amazon updates the OS real soon where you have the option to import your whole collection with just a few clicks. And most of all I hope they fix the collections issues. Just thinking about what a mess my Kindle is makes me want to cry.", "Title": "Good for reading, not for collections", "Date": "November 29, 2013"}, {"Author": "JPP Smorenburg", "ReviewID": "R5TINYTF5X0WF", "Overall": "5.0", "Content": "I want to share my feelings about my new HDX 7 which I received recently. I'll update the review as I get to know the HDX as time passes. I use the HDX daily for 2 hours on average reading and surfing. I use a PaperWhite 3G at work and at home and have used previous E-ink Kindle generations for daily reading in the past. Kindle Fire is growing up fast. The vastly upgraded device response and fluidity are already well commented on. The extra speed when surfing the web and navigating the HDX are again a big step up, good work. There is very little display reflection, improving reading once again this gen. Text is totally, faultlessly sharp.A very cool software feature in the Kindle app are the extra Wikipedia and Translation boxes that come together with the dictionary definition box, totally cool. Silk works better, taking many opened tabs in its stride and making the most of the display size with the cool article mode and nicely working full screen option that takes away the tabs and adress bar to move the page upward. I always found the iPad 4:3 display ratio appealing, but the Silk features mentioned above make the 16:9 ratio enjoyable for web surfing while keeping the device as small as possible.The form factor is again much improved with the HDX generation, no apologies necessary anymore. It's much more manageable than my previous generation HD 7; noticably less circumference and a third less weight. The physical buttons are very tactical, unlike those on the previous gen., and the sometimes mentioned \"angled\" USB port feels and looks solid, not at all awkward. The bezels are smaller and the plastic outer enveloping rim much more so giving a very tight, high quality appearance compared to the previous gen.In my opinion, Amazon have at this generation arrived at a wonderful compromise between \"boutique\" (like iPad) and \"utility\" (previous gen. HD) moving steadily toward the iPad. Also with the HDX, there is a better compromise between Amazon presence (say, like an Amazon website-type environment) and an open Android presence (like any generic android tablet) with the HDX showing beautiful, eerily sharp lockscreen wallpapers, app icons matrix and book covers, with removable recommendations which, removed, leave an \"Android or iPad like\" home screen save for the background, which is (in my opinion) nicely dark with classy icon shadowing.Battery life is at least as enduring as on my previous gen. HD. Sound is as good to my ears.UPDATE:I have some clouding, showing a brighter spot of about an inch in the centre of the display, which is visible on an even background like when reading. I can only get rid of it when switching to white text on black. The slight blue border bleeding is also present, but doesn't bother me at all.UPDATE 12/3/2013: I've requested and was right away permitted after a short live chat an exchange HDX to arrive in a couple of days, amazing stuff!UPDATE 12/5/2013: I received my replacement HDX today. What a miracle of logistics; from across the Atlantic traceable almost to the hour. Even my return HDX I can track. Boggles the mind. Well, I must say the clouding is less with the new one, but I can still see it. My daughter (painter artist) shakes her head and says: \"You exchanged it for that?\", when I show her the \"faulty\" one. Must be me then. I'll accept it as a HDX character trait.UPDATE 12/14/2013:The HDX performs excellently, the smaller size and mass, and the very sharp, defined characters are more appreciated as time in use passes. The new ability to sort cloud content in collections is much appreciated. Silk occasionally froze. Disabling page load acceleration solves that.This device is a big improvement over the previous HD; better ergonomics again, better display, less glass glare, much more zip, diminishing the E-reading gap with the glorious PaperWhite. My PW is certainly used less for reading since the HDX is here. As we live in the real world, I think the price:quality ratio is very important, and the HDX has made that ratio more favourable again for my ends, which are: reading E-books, internet news and watching news videos with the best possible display quality and low weight and size at a good price. Weighing the above factors, the HDX-Amazon combo is unbeatable. What I would call a Serious Tablet.Job very well done,Recommended!UPDATE 1/5/2014:For an Epub reader app, I can recommend Aldiko, downloaded through their website via a sent link for the free, non-ad reader. Really hassle-free, with only the basic options for good reading, not playing. The only caveat is crashing of the app with large .Pdf's. But it's not really needed for those; the embedded Kindle Reader app is superior for handling .Pdf. No need to waste space installing the Adobe Reader.For a good enough productivity app, I can recommend the King Soft Free version through the Amazon App Store. No ads, no hassle, easy connection to Google Drive.Good File Manager app: Free no-ad ES File Manager through the Amazon app store. (You can get easy access to your Cloud Account by adding in ES through documents/network/add (+ key at bottom, pick your account)Good Task Manager: Free no-ad ES Task Manager through the Amazon app store.", "Title": "Kindle Fire Is Growing Up!", "Date": "November 29, 2013"}, {"Author": "Kindle Customer \"Chuvasia\"", "ReviewID": "R1FRVSKFODHZFW", "Overall": "5.0", "Content": "Being able to download Prime instant videos is sweet!  My son also uses the immersion reading which is a huge step up from a regular audio book.", "Title": "HDX is even better!", "Date": "November 28, 2013"}, {"Author": "stephanie", "ReviewID": "R1JT6V8AAO3BA2", "Overall": "5.0", "Content": "Absolutely love this Kindle. I have never had one before but my friends do.  I love all the things it can do. Great product.", "Title": "Love, Love, Love it!!!", "Date": "November 28, 2013"}, {"Author": "donald liebes", "ReviewID": "R2BIARVS2W3ZZE", "Overall": "4.0", "Content": "The Kindle Fires I bought are Christmas presents to my wife and myself.  We like them very much and are learning to use them.  We are in our early 70's so it's a challenge.  :)", "Title": "We like them!", "Date": "November 27, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00BWYVWLO", "Features": null, "ImgURL": null, "Name": null}}