{"Reviews": [{"Author": "Myra Gideon \"Myra Hobbit\"", "ReviewID": "R1WZTUA31A0FMX", "Overall": "5.0", "Content": "If you're in the market for a basic Android tablet that is wi-fi only, this fills the bill.  I use it at work as an organizer, I read books and magazines on it, and I have a few games on it that I play occasionally. Battery life is about 6 hours, which usually is sufficient for a workday.I love the case with keyboard, too.", "Title": "Does what I need it to do", "Date": "June 27, 2013"}, {"Author": "David A.", "ReviewID": "RAKF678RDMC4D", "Overall": "5.0", "Content": "I did some research before deciding on this tablet.  Other brands did not have the Google Play Store feature, but this one does.  I can download all the apps and watch Youtube on this tablet.  I really like the sleek design, very sharp looking and light.  This tablet is actually faster than I expected, disregarding the speed of your internet connection.", "Title": "Sleek", "Date": "January 29, 2013"}, {"Author": "K.J", "ReviewID": "R3V52UTBE9GHF6", "Overall": "5.0", "Content": "I purchase thi tablet for my 5 year old daughter and she absolutely loves it. So far I have no issues with it \"I have only had it 2 days now\" lol. But it was everything I was expecting. Shipping time was very fast as a matter of fact i got it a day earlier than expected. It even came with a 8GB sd card and for only 90.00 bucks this is a very good tablet for the money.", "Title": "I so love this tablet", "Date": "March 5, 2013"}, {"Author": "Teresa", "ReviewID": "R3NW4DUHDCHV33", "Overall": "2.0", "Content": "Went great for a week then went to go and charge it and it wouldn't charge, Tried another way to charge and still wouldn't work. Wont waste my time on this again.", "Title": "One week entertainment", "Date": "August 9, 2013"}, {"Author": "janaa proctor", "ReviewID": "R1PU2BA8OCPWC5", "Overall": "1.0", "Content": "I rated this with a one star because less then a month later the usb connector is loose. I have to go through the most to get it to charge and when its says its charging it continuously dies,how is that possible if its \"charging\"? The list goes on!!!!! I would tell EVERYBODY to stay away!!!!!!!!!!!!!!!", "Title": "aweful", "Date": "January 25, 2014"}, {"Author": "yared", "ReviewID": "R38PEB336R2BF4", "Overall": "1.0", "Content": "it worked for  the first two days,then stopped working! I returned it!! I don't recommend for no one this tablet!", "Title": "not good at all!!!", "Date": "August 2, 2013"}, {"Author": "Sandy B", "ReviewID": "R124N8CIGO94XL", "Overall": "1.0", "Content": "I don't know about others but this only hade a battery life of 1hr 5min in my book that is not very good.", "Title": "Ok bad battery", "Date": "July 27, 2013"}, {"Author": "crazycrystald", "ReviewID": "R39IK0YDSSIQE8", "Overall": "2.0", "Content": "after charging it for 10 hours battery life only lasted for 1 to 1 .5 charged battery 3 time for no lease then 8 to 10 hours and still only lasted for no more then 1.5 hours. this was not even being online ! all so because not amazon prime seller has you pay for return shipping to manufatuer", "Title": "not very happy", "Date": "April 12, 2013"}, {"Author": "Timir Dukhbhanjan", "ReviewID": "R2NE2EODP23IKG", "Overall": "3.0", "Content": "Tablet was received in good condition,charged it up as per instructions.The image is ok,but not crisp.I have to be close to my router for internet to work.Sound level is very low.Overall the product is just ok.", "Title": "Its okay", "Date": "April 25, 2013"}, {"Author": "Danielledavis", "ReviewID": "R3KSXENF3GEZ26", "Overall": "4.0", "Content": "Good quality and recieved it quickly. My daughter is having a lot of fun with it and cant wait to see how it does on our vacation.", "Title": "Great", "Date": "April 1, 2013"}, {"Author": "angela johnson", "ReviewID": "R11PSQ89W4NGMR", "Overall": "1.0", "Content": "At first it was just shutting off. Then it just would not cut on at all. Now my daughter can't use it.", "Title": "It stop working", "Date": "April 4, 2014"}, {"Author": "Chanel", "ReviewID": "RJZEGCRKFHB0O", "Overall": "1.0", "Content": "This tablet is cheap for a reason do not buy this tablet the charger stop working the tablet would not charge and the sd card was not working save your money and go buy a tablet thats worth spending your money Doesn't even deserve one star.", "Title": "Worst Tablet Ever", "Date": "March 3, 2014"}, {"Author": "Roxanne M. Burnett", "ReviewID": "R3HKXTZ61L04UC", "Overall": "2.0", "Content": "Tablet came in foam and in a plain brown box. It would hold a good charge the first four days but after that, no matter what you were doing on the tablet, it will only hold a charge for about 30 minutes. Due to the lack of holding a charge, it makes the tablet hard to use anywhere but home.", "Title": "Not recommended", "Date": "March 3, 2014"}, {"Author": "April Davis", "ReviewID": "R2KA8UF2YJY7H7", "Overall": "5.0", "Content": "You shouldn't exspect a masterpiece of equipment for 60 bucks. That's why I got it for a 12 year old. It does what it needs to do movies games and wifi. If you want something more you gotta pay more. Battery life's short but that's about the time he needs to turn the thing of anyway.", "Title": "great for kids", "Date": "February 25, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3QRD816AC8MBY", "Overall": "1.0", "Content": "Broke with in a weekdid not chargeWould not turn onneed better charging supportI I I l", "Title": "did not keep a charge", "Date": "February 24, 2014"}, {"Author": "denise lopez", "ReviewID": "R2Y3841V2TOGOO", "Overall": "1.0", "Content": "it looked very cheap and would not turn on after left charged a whole entire day would not recommend purchase", "Title": "looked cheap", "Date": "February 18, 2014"}, {"Author": "Felisha Arnold", "ReviewID": "RU75FX8HMGCOW", "Overall": "5.0", "Content": "My son received the tablet for Christmas and he loves it!!! He carries it with him all the time and he uses it daily", "Title": "tablet", "Date": "January 23, 2014"}, {"Author": "feefee40", "ReviewID": "R1GM42R1AA9S5D", "Overall": "4.0", "Content": "Great tablet for my granddaughter age 7. Unfortunately charger does not connect very well and it is very hard to recharge the tablet.", "Title": "Tablet", "Date": "January 12, 2014"}, {"Author": "Renee Chabot", "ReviewID": "RRJNQTD4LJO80", "Overall": "5.0", "Content": "Easy to use, plenty of storage, can use any standard 7' cases.Charges quickly, holds a charge for an extended period of time.Yes I would recommend.", "Title": "SVP 7\"", "Date": "January 7, 2014"}, {"Author": "buffy kimbrough", "ReviewID": "RE25C9X71IPBA", "Overall": "5.0", "Content": "Got 2 of these for my kids for christmas. They loved them. Now they dont have to fight over my tablet", "Title": "Awesome tablets", "Date": "December 25, 2013"}, {"Author": "Kelly F. Kindberg \"disappointed1\"", "ReviewID": "R31LW62FDJO5NP", "Overall": "1.0", "Content": "This tablet worked for about a week. Then something broke within the charger and it can no longer be charged, therefore no longer be used. You get what you pay for - my 11 year old son wasted his own money on this. Now we are going to get him a Samsung Galaxy tab for Christmas. I do not recommend buying this tablet.", "Title": "Only worked for about a week - you get what you pay for.", "Date": "November 23, 2013"}, {"Author": "violet mitchell", "ReviewID": "RSOSIAJAVR80S", "Overall": "2.0", "Content": "i think the tablet works fine only thing is the battery life doesnt last longer then a hour and a half and its not exactly 8gb tablet u cant put too many apps it slows the process of things when u r trying to look at something", "Title": "keeping it as real as possible", "Date": "November 4, 2013"}, {"Author": "vinicio", "ReviewID": "R1O965IROR0PR6", "Overall": "1.0", "Content": "the tablet never worked, never lit, I feel cheated, lack of product quality control, I do not recommend this product to anyone, unfortunately I am outside U.S. and I can not return it, I lost my money.", "Title": "It did not work", "Date": "October 18, 2013"}, {"Author": "dillon", "ReviewID": "R2XG5933QQDMTJ", "Overall": "1.0", "Content": "it stopped working...won't charge or do anything. So buyer beware DON'T BUY!!!! buy a kindle last longer.. never again will I buy a unknown.", "Title": "junk", "Date": "October 8, 2013"}, {"Author": "Nathan Mello", "ReviewID": "R3NK6HG2PSFKJP", "Overall": "1.0", "Content": "Piece of junk, but you get what you pay for I returned it within a week, no programs would open properly everything was slower than cold molasses on a cold day DO NOT BUY!!!", "Title": "Do not buy!!!", "Date": "October 8, 2013"}, {"Author": "Justin Johnson", "ReviewID": "R10FZ7U4XDRY0Y", "Overall": "1.0", "Content": "I got it sent to me in afghanistan and it has broken after less than 24 hours of use. I charged it and all but yet it won't turn on and then I woke up to it and the screen was broken like it was dropped so I don't care for it.", "Title": "It's broken", "Date": "October 7, 2013"}, {"Author": "janiceladner", "ReviewID": "R3BGIFWCJ5N1YG", "Overall": "2.0", "Content": "I didn't like the tablet very much. I had bought it be able to play my games on my trip. But didn't play half the time . It would not hold a charge longer then 3 hours. I was going to send it back but couldn't find the order paper to send it back. That was why I bought my mini iPad and love very much.", "Title": "7\" Android touchscreen tablet", "Date": "September 13, 2013"}, {"Author": "Brena Burleson", "ReviewID": "R1DYELZZ5XNFIR", "Overall": "4.0", "Content": "Its a cheap tablet. Dont expect alot  of speed or major durability, But for the price you pay it works GREAT! definitely better the the tablet you get from Coby that costs 2x as much and is crap! I bought this for an 11 year old kid and it works perfectly for her!", "Title": "Great product for its price.", "Date": "September 11, 2013"}, {"Author": "Mark in Memphis!", "ReviewID": "R2VPAKPFF36IEU", "Overall": "3.0", "Content": "Cheap, basic Android tablet. Got it for my 10-year old granddaughter. She had to reset it fairly frequently, but enjoyed it while it worked. She was able to get on YouTube and play videos, download games, browse the Internet, read books, etc.She brought it to me to fix. I'm not sure I can. The power connector seems to have broken internally.", "Title": "Worked great, for a while ...", "Date": "September 6, 2013"}, {"Author": "Jermaine Mckinley", "ReviewID": "RTUUM92GDJFNZ", "Overall": "5.0", "Content": "The features on this ANDROID Tablet and \"learning\" applications available for download make this ideal and cost effective for any age but especially for parents.  There is even an office products app to help with writing and homework.  This is the second tablet purchased from the company.  The Teen loved the 9 inch so much i bought the 7 inch for Tween.  Great service, Great product!", "Title": "One of the Best Little Tablets for Teens and Tweens", "Date": "September 3, 2013"}, {"Author": "LOVELY25", "ReviewID": "R1WM16WD28ATV6", "Overall": "1.0", "Content": "CAME APART IN 3 DAYS.DONT WASTE YOUR MONEY! I WAS SO DISPPIONTED  AND SO WAS MY SON. I BOUGHT HIM ONE AS WELL. IT WAS A WASTE OF TIME AND MONEY", "Title": "SMH", "Date": "July 27, 2013"}, {"Author": "Cotezz Childers", "ReviewID": "RUS9T0TIEN7OY", "Overall": "1.0", "Content": "PICE OF S*** ARRIVED BROKEN DONT WAST YOUR MONEY BUY THE NERO TAB ITS A LOT BETTER QUALITY AND PRICE", "Title": "DO NOT BUY", "Date": "July 24, 2013"}, {"Author": "Sandra", "ReviewID": "R2ETX3J9ZPNOEK", "Overall": "2.0", "Content": "I am disappointed with theproduct.  The battery life is less than acceptable. Only lasts about an hour-great for a child playing games but not for professional business use.  Also when you charge it, the charge is always at 93% never at 100%.", "Title": "Not as Expected", "Date": "July 11, 2013"}, {"Author": "Kerima Smith", "ReviewID": "R2UK505217529M", "Overall": "5.0", "Content": "I was extremely pleased with this purchase. I got three because the price was very affordable at $59.00 and it works great!!!. Thanks amazon please bring more deals.", "Title": "Just Wonderful!!!", "Date": "May 24, 2013"}, {"Author": "Mako Cruz", "ReviewID": "RPZWMX6956MCT", "Overall": "1.0", "Content": "After two week of light use battery don't work, only works with cable plugged. I use it only to play games with my daugther and I don't left her along with the tablet. I can't return it becouse I live outside the USA, so I lost my money.", "Title": "Broke after 2 weeks of light use", "Date": "May 24, 2013"}, {"Author": "C burns", "ReviewID": "R11EJ23KCTTM9T", "Overall": "3.0", "Content": "Product had scratch and case had cut area. But not bad for the price and for a 7 year old", "Title": "Ok for the price", "Date": "April 19, 2013"}, {"Author": "Kendall76", "ReviewID": "R1LMHV6NJTWGME", "Overall": "5.0", "Content": "I received the TPC0751 PC Tablet and it worked fine. Had no problems so far. It supports google play store. The storage available with the 8GB micro SD Card is approximately 9GB (1 Gb internal storage free and 8Gb SD Card) with all the software installed not 12GB as the 4GB internal storage is basically taken up with the software that comes with the device. The only other problem is the the manual was very poorly written (obviously written by someone who does not speak english well) and not very helpful in showing how to use the device. But it was worth the price paid.", "Title": "Product Worked Fine", "Date": "April 15, 2013"}, {"Author": "Jeff Biszantz", "ReviewID": "R32736P2NO4N1O", "Overall": "2.0", "Content": "I bought this unit, the battery life is very poor. Runs down in less than an hour after charging all night. In that hour  i checked e-mail and played 1 game. I would not recommend this unit to anyone, keep looking. If I could I would have returned it. Time ran out of time to return, I was hoping it would improve. IT DIDN'T !!", "Title": "7\" flop", "Date": "June 11, 2013"}, {"Author": "Marlando Doyle \"Mdiddy\"", "ReviewID": "R1XALOG7I58H6S", "Overall": "1.0", "Content": "The price is misleading,  I bought this tablet for my 8 year son and within 2 days it was stuck on the android start up screen, it has no reset option it only has sequence of buttons to push that never got the job done. For the 2 days it did worked it had a slow response time, overall this is the worst tablet I ever purchased.", "Title": "Strongly urge do not waste time and money", "Date": "February 4, 2014"}, {"Author": "rosangelina palacio", "ReviewID": "R2Z9MTMC7TVDQZ", "Overall": "1.0", "Content": "it just didn't work when I received it that's all it probably was a broken item im sure it would have been good if it had worked properly!", "Title": "didnt work", "Date": "January 25, 2014"}, {"Author": "Capt Bob", "ReviewID": "R1J8O2ZTOJ3NVB", "Overall": "1.0", "Content": "This thing is PATHETIC! it is so slow it is unbelievable...it takes more than three minutes to wakeup and I have only one app installed. And talk about painful, installing the app took over 20 (yes, twenty) minutes due to the slooooooowness of the CPU. Don't buy this piece of junk. I rue the day that I did. A total waste!", "Title": "Total Waste of Money!!!", "Date": "April 26, 2013"}, {"Author": "Cassie", "ReviewID": "R31DRYEUD7ZHY7", "Overall": "1.0", "Content": "First I have to say the shipping to get my package took no time, it was here in 2 days so thanks for that! I was looking for something basic I could use in school and at home to relax with. So far I've bee impressed with how up to date this tablet is; its not a galaxy tab but it gets the job done. Only things I'm annoyed with is it freezes randomly while using apps, the internet response is kind of slow, and it didn't come with a manual. Its pretty basic to figure out after a couple minutes though. Oh yes the battery life is HORRIBLE.", "Title": "Somewhat glitchy but a steal", "Date": "September 14, 2013"}, {"Author": "Rev. Claude Kinder", "ReviewID": "R1M8ELYEJSSXJ5", "Overall": "2.0", "Content": "It was cracked when I received it. It also does not have a long enough charging cord. You have to put it the floor to charge it. The charging cord will not stay in either end of the of the Android or the fixture to which it plugs into to charge it. There were no instructions on how to use it. Very poor indeed for such an expensive item.  I feel the 2 products that I bought from you is making you a poor example of your good name. I will probably never buy again from you!", "Title": "Poor quality", "Date": "March 31, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00BL5MBZK", "Features": null, "ImgURL": null, "Name": null}}