{"Reviews": [{"Title": "Absolutely perfect!", "Author": "K. Sperling \"loving mommyhood!\"", "ReviewID": "R2FWTEC89IKHLX", "Overall": "5.0", "Content": "This is my 2nd d2 pad.  I really liked the 1st, but this one I LOVE!About the 1st...The 1st one (model # DII_pad) I purchased from Big Lots for the same price ($80).  It is the older model. I saw it and thought it was worth the try for the price.  The WiFi signal was stronger than my samsung smartphone.  It was surprisingly fast and stable.  It has a nice sturdy, quality feel to it, unlike the polariod tablet I also purchased from Big Lots (that was also VERY slow). The D2 screen looks beautiful, video looks great. I installed the flashplayer via the d2 website instructions. The battery life is not very long (about 3 hours of heavy game playing, more for reading ebooks), but it charges in just about an hour.  My only complaint was that the amazon kindle app didn't work and temple run couldn't be played because the tilt feature didn't work in the game. Tilt worked just fine on other apps like labyrinth. My daughter loves my d2 pad, so she asked for one of her own over a kindle (which her dad has).This newer one (model # D2-711) from Amazon is AWESOME! It's even faster.  My daughter is very happy. I downloaded and installed about 12 apps in just over a half hour.  The WiFi is super strong.  Kindle App works great. I already put a couple of books on the pad for my daughter. Temple run works great, as do the other apps.  For anyone wondering what kind of case to get for it, it fits pretty well in my husbands Kindle fire case from amazon (Kindle Fire Lightweight MicroShell Folio Cover by Marware). Snaps in and sits pretty snug and you have access to all the buttons and ports which are now on the bottom after the redesign.About the company.  D2 pad in on facebook.  The staff there actually reads and responds to posts and questions about their product, sometimes the same day, but usually withing a day or two.  Their website has lots of info on the FAQ page, but good luck contacting anyone through the website. Word of warning...the software update for the older version (my 1st purchase) actually contains a trojan, so be advised to check any download before installing.  That is my ONLY concern about this product. I haven't needed to download anything for this new d2 pad.I would totally recommend this tablet for anyone looking for good performance and great value.  We've tried a couple of other Big Lots tablets and have not been impressed the way we are with the D2.  I recommend buying this product through Amazon because they have the newer version.  If you find yourself looking at a d2 pad in a retail store sometime, my best advice is to look a the model number or the serial number on the bottom of the box. Serial # beginning D201208... is the older model with a few small issues.  If the serial number begins D201209...this is the newer model, the fantastic one!", "Date": "January 4, 2013"}, {"Title": "Great Tablet for a Kid", "Author": "S. Mom", "ReviewID": "R34HXZDQVHN7B1", "Overall": "4.0", "Content": "I have been looking for a tablet for my daughter for months and I have always kept my eye on the D2 tablets because of their high ratings for tablets under $100. I waited too late to get the pink one (other sellers over charge for the tablet). I was given a Kindle Fire HD for Valentine's Day and the kid when crazy over it. To keep my Kindle from ending up like my laptop (poor hinge), I decided it was now or never to buy her a tablet.I only gave it four stars because we have only had it for almost a week (never know what may happen). Let me start with cons. :)CONS:Many have said the internet is slow and compared to my computers and Kindle, it is. It reminds me of my cell phone when I use data from my carrier and not Wi-Fi, meaning it takes about five more seconds to load. So if you an adult who needs super fast, instant internet, move along!The movies did not work...but I knew they were NOT the type of movies my 3 year old would want. Kido'z TV was not installed on mine so installed it myself. That is a great app for children to watch shows without the extras on Youtube.The camera is on the top right corner (holding it as pictured). I'm used to laptop cams being in the middle BUT as of now, she will not be using Skype or anything else. Quality of the camera is not the best (0.3 megapixels) but it's better than nothing!It's not HD...so if that what you are looking for, move along! Quality is great in my opinion.AS USUAL there are some apps you cannot delete BUT they do allow you to disable them in the settings menu.PROS:I LOVE the Mee Genius app and the free books that came with it. The narrations for those books are ten times better than me downloading kids books on my Kindle and having the system narrator read. One book about a Jungle Orchestra even had neat music and songs to go with it.The instructions that come with it makes it very easy to understand and how to operate. Be sure to follow the directions of charging before operating (mine turned on after inserting the charger) and draining the battery twice. I am just now letting it die the second time because I restrict her usage.It fits a case for the Kindle Fire (not HD) purchased at Walmart. Only issue is openings block the headphone jack (no big deal).Comes with a charger, a USB cord, and some other cable I am assuming  is for TV, computer...something!Battery life is fine.Right now I am using a 2GB micro SD card to store some apps and the micro SD card works fine. (Note: I had to turn off debugging when I used the USB to transfer songs to the SD card while inside the tablet. Too lazy to get the converter card to put it directly in the computer.)Rubberized backing...because I never liked the smooth backing on ANYTHING!OVERALL: I think it is not a bad tablet to have for a child or a beginner tablet user.I keep my eye on it at all times like my Kindle (neither have had falling accidents) so be sure to get a cover case with a stand, screen protector, AND a shock proof travel case on Amazon or from Big Lots (take it in the store to make sure it fits). Way cheaper than Walmart, Kmart, Target...wherever!", "Date": "March 5, 2013"}, {"Title": "Great For Price !!!!!!!!!!!!!!!", "Author": "jnee27", "ReviewID": "R3P2S2L1RH473S", "Overall": "5.0", "Content": "I got this tablet for 79.99 @ big lots and its awesome for the price,u can play decent games web browser pretty good wifi picks up great body is soild,great speaker and packed with 1gb ram most for this price only gives 256mb ,this beats alot of tablets like cobys etc even though its not preloaded with google play ,i have it on mine now so its possible ,but the mobile one not a bad store for free apps ,come on amazon sell this tablet !!!!!!!!!!!!!!!!!!", "Date": "November 26, 2012"}, {"Title": "Nice tablet especially considering the price.", "Author": "Steve", "ReviewID": "R1BWLARNHMQQYY", "Overall": "3.0", "Content": "I use an original Samsung Galaxy Tab 10 and and Galaxy S3 Phone.  So my kids were dying for a device of their own.I picked up a couple of these for them to use.  In my testing so far this tablet works well for such a inexpensive tablet.  Battery life isn't great but sufficient.  It comes with a proprietary wall plug for charging, but it may charge over USB as well.  Played some Videos on it, worked well.So far the biggest complaint is the lack of Google Play Store. Tried to install it myself but it keeps crashing (any ideas on that?).Update 04/10/2013:Downgraded my review (4 to 3 star).  The battery life on standby is horrible. 6-8 hours on standby and the battery is gone.  Found that they left unneeded cellphone (no cellular hardware on the device) software running and it kills the battery trying to find a cell signal.  I contacted support weeks ago, they acknowledged the issue (barely) but no fixes so far.Since no Play store you have 2 basic options: - Amazon Store  It is an OK replacement, more geared towards Kindle devices. Not as many apps available as the Play store. - 1Mobile Market  This is the default on the device. Again not as many apps as the Play Store, and those it does have are often out of date.", "Date": "March 15, 2013"}, {"Title": "Great Tablet, Great Value!!", "Author": "Leo Mitchell", "ReviewID": "R2DCTDGT64799S", "Overall": "5.0", "Content": "I bought 2 of these D2 7\" tablets during the holiday season for $79.99 each. I purchased a blue one for myself and a pink one for my daughter as a Christmas gift. I must say that I'm very impressed with our overall experience with these products.My daughter absolutely loves her pink tablet and uses it all the time. She is constantly watching videos on youtube and playing on Disney websites but even more so she loves all the games, books and apps that are geared toward kids that come pre-loaded on these tablets. The fact that D2 pre-loads 20 eBooks for kids, lots of kids learning apps from Kevin Bradford, and other fun games and apps makes these tablets an even bigger hit in our household.From a parent standpoint this tablet also works very well and comes equiped with pre-loaded utilities such as Dropbox, Pulse News and Kingsoft Office. However since these tablets seem to be marketed as a household tablet that can work for the enitre family I was also impressed that D2 had thought to pre-load a Kids Place parental control app launcher to protect personal data and restrict kids to only approved apps.From my experience we have had no issues with our D2 tablets and the internet seems to work just fine on my home wifi network. I would definately recommend this tablet and believe it is a great value at $79.99.", "Date": "January 30, 2013"}, {"Title": "I finally bought the right tablet", "Author": "Staci M", "ReviewID": "R11M09EMW4QKO8", "Overall": "5.0", "Content": "This is the third tablet I've purchased during the Holiday season. the first was a MID Tablet for my husband and the Wifi is awful. He insists on keeping it though.The second was a supposed to be a Wolvol tablet. but it was not as advertised, so I sent it back.This one is the one I'm keepingAfter checking the reviews I purchased the D2pad tablet in pink, simply because I'm a firm believer that if you girl up your stuff, it wont be likely to be stolen.I was pleasantly surprised to find that the pink version has a rubberized back(the blue is rubberized too) instead of the plastic back that comes with the black and white versions.As for the tablet itself. I'm finding it very easy to figure out.At first I was a bit alarmed to find that it doesn't work with Google play, but as it turns out the Amazon App store and the 1Mobile app store pre installed have everything Google Play has and more, so its really wasn't an issue at all.It picks up a WiFi signal with no problem, sometimes I have to turn off the wifi and turn it back on for a better connection but that's always been the case with my laptop too, so that's nothing new.This tablet comes packed with children's games and books which is great if your giving this to a child. personally I didn't need any, so I finally figured out how to get rid of them. I went to 1Mobile and downloaded an app called \"Root App Delete\" to get rid of them, so now my tablet has only what I want.I also downloaded Pandora, so I could listen to music and was amazed that the speakers on this tablet work better than a creative zen MP3 player.This tablet works well viewing youtube videos. I've noticed that it wont view my videos from Dropbox, but I think that's because they are not in an AVI format.Some people complain about the battery life but I've been able to play on this thing for about 3 hours without having to charge it.I think that's pretty good as I don't usually stay online for more than a couple hours at a time.Overall I have to say I'm impressed with my new toy.", "Date": "February 5, 2013"}, {"Title": "**UPDATE** Works fine. Takes a little getting used to it.", "Author": "JayOcampo88", "ReviewID": "R13EUR7TAZ01XP", "Overall": "1.0", "Content": "Its a fun lil tablet. Does what it says, I've still to test it with SKYPE (Which is the main reason I bought it) and with games.For your basic eMail, internet browsing and game playing it does the job.It's a little on the slow side, but thats ok. Camera works great but its in a weird place; SO iT SHOULD be amusing to see how it goes with SKYPE.Would of also been great if it had SWYPE from factory as a way to type onto it.Ill update once I've had it for a few days.**UPDATE**So, Ive had this tablet for a a week or so at this point at this point. And I must say, that it still works as it should.However, Its extremely disappointing that even though the description read 4 (FOUR) GIGS. The tablet BARELY HAS 2 Gigs free. I mean, what the hell???Besides the fact that IT CAN be extremely slow at some point, this tablet is really good. And im happy with it.If I could figure out a way to be able to remove some USELESS programs that come with it (Chrome [which tends to freeze the tablet,] W Games, KIDO'Z, LOOKOUT, MEEGENIOUS, SOUNDHOUND, and TANGO.)Each one is taking up a ridiculous amount of memory that I'd rather use for my OWN programs.The \"1Market\" is DECENT, although I do feel that most of the program reviews are staged.**UPDATE**After having this tablet for a few months I have GOT to say it really STINKS!!.I dropped it once and it literally fell apart. My sister has dropped her cheaper tablet and it still runs.It has gotten slower and slower to the point where its not even worth the bother to use.Tried using NETFLIX yesterday...wouldnt load it, and when it did it got stuck buffering.Save your money and move on. You'll regret buying this like I did.NOT WORTH THE MONEY!!! PIECE OF TRASH...", "Date": "April 10, 2013"}, {"Title": "My Husband Loves It.", "Author": "alwaysunique", "ReviewID": "R1XQTP9UE3VJC9", "Overall": "5.0", "Content": "I purchased this tablet for my husband's birthday. He is extremely pleased with the speed, the variations and all the possibilities of it's use. The price was awesome, and it is perfect for getting on his social web-sites. The only draw back is the pre-downloaded Amazon Aps Store application. DO NOT download any of the applications on this site, these applications have dangerous malware attached to them when they are downloaded. I purchased additional virus protection for his tablet, and every time we attempted to download any of those applications the virus protection would warn us that there was malicious malware attached to the application. I just do not understand why Amazon continues to offer these free applications that immediately causes owners of new android devices to download malicious applications that will ruin your device before you can really use it.", "Date": "March 11, 2013"}, {"Title": "Not half bad", "Author": "Joseph Kent", "ReviewID": "RVDR63UAZ8UBC", "Overall": "4.0", "Content": "My first tablet was a Samsung Galaxy Tab 2 7.0.  However, that was stolen from me on the bus, so I needed a quick replacement.I've taken to calling this a \"half tablet.\"  It was (less than) half the cost of the GT2, has half the processor cores, half the RAM, and half the flash memory.  But all in all, it's not half bad.I took the time to figure out how to put the Google Play store on this device, which is a necessity, since one of the apps I wanted a tablet for was Google Play Magazines.  I'd venture to say that most users just diving in to the Android platform would be fine with just the 1Mobile Market that comes stock on this tablet.  But when you've been an Android user for as long as I have, Google Play Store is a must.  Still, it was simple enough to find help online with installing the Play store, so it's not a huge deal.The 4GB storage was a bit scary to me.  I was close to filling the 8GB storage on the GT2 a few times, so 4GB didn't seem like a good idea.  However, unlike most ICS devices, this tablet allows you the option to move apps to the SD card, which lets you add more apps than I originally anticipated.All in all, if you're just looking for functionality, this tablet is pretty decent.  If you're looking for better graphics and faster speeds, save for the GT2.  Still, well worth the money.", "Date": "February 8, 2013"}, {"Title": "D2 -Lovin It", "Author": "Richard Meyer \"Rick Meyer\"", "ReviewID": "R171Z75UBVFRZW", "Overall": "4.0", "Content": "Bought the D2 7in tablet.Recieved it 4-5-13.Charged it and been crazy bout it.Easy set up-downloaded 2 e-mail accounts.Good graphics.Couldn't figure sound until I realized \"internal speakers\" meant \"earbuds\".Camera is cool.Use it some much I had to do my second charge.A tiny bit slower than my laptop but hey for $79.00 who cares.Would highly recommend.Already told my friends and co-workers.I also bought the case that has the keyboard which I also recommend.Keeps your fingers off the screen and gives it that laptop feel.Comes with all adapters and plugged right into the D2.If you want to spend $400.00 or more for a tablet go ahead but I'm crazed about my $79.00 D2.", "Date": "April 7, 2013"}, {"Title": "soo far soo good", "Author": "happy", "ReviewID": "R22GWV6C5IAV0H", "Overall": "5.0", "Content": "i love this product... its very quick to use, especially the browser responds quickly, very portable n soo far its working perfectly... i bought two of these for my parents n they love it... i hope i dont get any problems with it but for now i say i love it n very worthet for its price", "Date": "March 17, 2013"}, {"Title": "Perfect for our kids!", "Author": "Baron", "ReviewID": "R6W8S2HVA3U19", "Overall": "5.0", "Content": "We purchased three of these tablets after having to return three Coby tablets. These are absolutely great for our kids. They haven't had any problems, and are very easy to work. The kids are able to download all their games through amazon and 1mobile. I would highly recommend this tablet if your are looking for something for your kids to use.", "Date": "January 24, 2013"}, {"Title": "Loaded with Childrens Apps", "Author": "Ed", "ReviewID": "R24ETP4XO9L6YL", "Overall": "2.0", "Content": "This device is frustratingly bad.  I'm giving it 2 stars instead of 1 because it can be useful to some.  Firstly, I'd recommend this tablet for use by children.  It comes pre-loaded with about 2 dozen game apps geared toeards young children.  The vast majority of these apps can not be simply removed.  If you're a techie and don't mind searching through this device's root directory, then it can be done. Secondly, this device is sloooow.  I have excellent and strong wi-fi reception in my home.  I have Verizon FIOS 50/25 Mbps Internet Speeds and every wireless device in my home operates exceptionally well, that is except this D2 Tablet.  Thirdly, you can not update this device's drivers.  Initial syncing with your home computer auto starts a driver update and download.  However, the device's drivers can not be found.  Perhaps this tablet would operate much better if one was able to update its drivers.  I bought this tablet for portability and enjoyment not for frustration.  It's going back!  Also, I don't understand these glowing Amazon reviews.  A simple google search revealed countless complaints on Tech blogs.  Check for yourselves!", "Date": "February 22, 2013"}, {"Title": "As expected", "Author": "Mimelen", "ReviewID": "R2EMR8FGSKPY1T", "Overall": "5.0", "Content": "This is a great tablet for a pre school age child for fun apps,games, movies, or for use educational purposes.", "Date": "April 24, 2013"}, {"Title": "Great tablet at an awesome price", "Author": "JS", "ReviewID": "R3ABFK6YDQG900", "Overall": "4.0", "Content": "I purchased this tablet about 3 weeks ago at Big Lots, and so far so good! With an $80 price tag, I'd say it's a pretty sweet deal for someone on a budget like myself. I've played around with other more expensive tablets before, and this one measures up for the most part. I mainly use my D2Pad for social networking, games, internet, e-mail.. The only complaints I do have are that it can't access Google Play and that it lags a bit while video chatting. Not sure if it can handle large files. That's about it.. but then again, can't really argue with the value of this product! Overall, a very useful and entertaining device to have on you, especially if you go out of town as much as I do. (And enjoy addictive games like Angry Birds!!) I'd buy some as Christmas presents, but the stores around me are all sold out!", "Date": "December 13, 2012"}, {"Title": "tABLET", "Author": "kayla harris", "ReviewID": "R35LUUKFFOB02I", "Overall": "5.0", "Content": "I LOVE THIS THING IT WORKS LIKE A CHARM. iT IS VERY EASY TO USE. THE INTERNET IS PRETTY FAST. IT IS EASY TO TAKE WITH YOU DIFFERENT PLACES. I WOULD RECOMMEND THIS TO EVERYONE THAT WANTS A TABLET", "Date": "August 14, 2013"}, {"Title": "I had to send the first one back.", "Author": "Amazon Customer", "ReviewID": "R3C85GJGQ9AHIM", "Overall": "4.0", "Content": "I ordered this tablet for my 11 year old. I hadn't had it 2 day's when it began to freeze up on me every 2 -3 minutes, so I contacted Amazon and they sent me a replacement of this tablet in 3 days. The second one works great. Had no problems with it what so ever and I would recommend it. I had no problems sending the first one back either, shipping was free.", "Date": "September 19, 2013"}, {"Title": "Perfect for children or those who only go online on occassion", "Author": "Amazon Customer", "ReviewID": "R2TV2IVFWBF4FA", "Overall": "5.0", "Content": "I got this for my 6 year old daughter for her birthday. She always loves this tablet she never parts with it except to charge it! I love that there is a kid appropriate zone I was able to customize to her age & I have no worries of what she downloads or views. She loves the story books, watches cartoons like popeye, tom & jerry and other classics she thoroughly enjoys. The games are educational so I don't mind her playing for extended periods of time. I have read in other reviews of it freezing but we haven't had any issues other than her impatience and tapping too many times, but she is 6. I'll be ordering one for my son for his 8th birthday in September in Blue.", "Date": "July 28, 2013"}, {"Title": "Spend the extra money and get a good-quality tablet", "Author": "Jerad Heffner \"geek, car buff, and dad\"", "ReviewID": "R1DT2X49PUNU8D", "Overall": "1.0", "Content": "I bought this to test out an inventory-taking idea for work. It was cheap, so I thought I'd give it a try.The tablet feels solid and has a nice texture. The blue color is okay, but kind of makes it look like a toy.If powered off completely, it takes forever to boot. During normal use, it's sluggish.The battery life is horrendous.The screen is a travesty. It's pixelated and has absolutely no viewing angle. Even looking at it straight on, parts of the screen are washed out.At my local coffee shop, it won't connect to their Wi-Fi. My Kindle Fire does, an so does my phone and my laptop, but not this device. Don't know why.The sound volume is lacking.The included apps are all system apps, which are not easily removed. While the system does come rooted and someone with the technical skills required to remove them could, this tablet is targeted towards those who are price-conscious. I also have a Kindle Fire 7\" HD, and despite its limitations (some apps I want not available in Amazon App Store and no USB keyboard support to name two), I strongly recommend it or its little brother, the Kindle Fire 7\" for about $160.If you're looking for a quality tablet that will last and will not frustrate you, this is not it.", "Date": "February 25, 2013"}, {"Title": "Great", "Author": "Oral Newsome", "ReviewID": "R232YWYY3HZMNF", "Overall": "5.0", "Content": "I bought this product for my wife, she loves it.The price was good.The OS works Great.Lots of apps.", "Date": "March 29, 2013"}, {"Title": "good but understand what you pay for!", "Author": "Jamie", "ReviewID": "R34IT11RMHNNHY", "Overall": "4.0", "Content": "unfortunaly I had to return this product because I was wanting more that it offered.  This is great tablet if you only plan on reading your ebooks or playing some apps but as far as the wifi it is not good.  The signal was just too weak for what I was looking for I could stand next to my router and still only have 3 bars, when in my bed which is only 12 feet away I had 2 and sometimes only 1!  Still with that for $80 this is a good tablet but don't expect a speedy little thing, the screen is a little slow and same with loading web pages, netflix was ok but the screen resolution was blah. I did really like how the back is textured it made it nice to hold and it felt sturdy and of course I LOVE HAVING THE OPTION OF PINK!!!!!", "Date": "February 14, 2013"}, {"Title": "This tablet sucks and is NOT for children", "Author": "mmaciuska", "ReviewID": "R21AVUPNKF6OTC", "Overall": "1.0", "Content": "I only gave it one start because I had too. I would give it a zero.  I have had nothing but problems since the day I bought it for my girls.  I have 2 of them.  They do not down load and as my daughters were playing the screens cracked and the company will not stand by the product.  My girls are 7 and both of the tablets screens cracked. It seems funny that 2 of the broke and now I am out of the money for both of them.  The company basically called me liar and said I want something for nothing. And I would be surprised at what people do. I would NOT recommend this tablet at all.", "Date": "September 25, 2013"}, {"Title": "riddled with ads", "Author": "joe", "ReviewID": "R1MHUSA0H1W0SE", "Overall": "1.0", "Content": "Doesn't have Google's Play Store instead they have their own \"1 mobile\" store with tons of advertisements.  My son can't get through one level of any of the games without accidentally clicking on an ad.  Worthless.Edit:  I'm appalled with this product!  I've  just thrown it away (with video evidence) because my 2 year old just went to a market add and the top downloads shown, number seven: \"Hot Teen Sex Videos\" and he's only two!  What if he clicked on it!  It shows a nude male from behind and has a nude female embracing him that you cannot see anything on here.  I have a video if anyone from amazon is reading this I really hope you contact me so you pull this item from your shopping market... they have four adult content downloads in their \"top downloads\" list top 20.  This is not listed as an adult product and needs to be removed or flagged.", "Date": "August 13, 2013"}, {"Title": "not worth the money", "Author": "samantha smith", "ReviewID": "R17LMQL96I0XIA", "Overall": "2.0", "Content": "I bought this for my 5 year old, and to say its decent for a child to use just wouldn't cut it. She is complaining about it freezing and randomly shutting down, Yes it comes loaded with several apps but that is about the only good part about the tablet. Battery only lasts about 2 hours and the one thing that eats the battery is the wifi, when i checked usage 81% of the battery usage was the wifi, the amazon app store that comes preloaded on it uses about 51% of the battery because it runs in the background. We have had this tablet less than a week and I have already had to do a factory reset on it because it froze and wouldnt turn off. If you are looking for a cheap tablet that has terrible graphics and takes forever to load, a front facing camera only, freezes a lot and spends most of the day updating apps that come preloaded on the tablet then this is a tablet for you, I bought this one for 80$ and I definately got what i paid for. I have noticed that this tablet has gone up since i bought mine, I would honestly buy a better quality tablet for the price.", "Date": "February 23, 2013"}, {"Title": "It's OK", "Author": "Astanax Tahlmarine", "ReviewID": "R7YLUY5SJRTGA", "Overall": "3.0", "Content": "For the price, I really cannot compare it to an IPad. There are also worse tablets out there. It might just be ours (If anyone wants to leave a comment they can), but I find that the Browser app stops too frequently. The D2 freezes up, and it says, \"The browser has stopped unexpectedly. Do you want to wait or close?\" I get that notification when trying to access a few webpages. Then when I try to type in a URL or search term, I have to wait for the digital keyboard to accept my input, and sometimes pressing the same digital key a few times is a must before it would even accept the key being pressed. There are times where I will be scrolling through apps, and the tablet will stop scrolling on its own and open whatever my finger swipes across at the time. I have a Droid X with the earlier Gingerbread Android and I haven't had this much problem as I did with this tablet in terms of scrolling and input. I don't really believe it is the operating system at this point, but rather the hardware D2 puts into their equipment that is causing the software to delay and not work properly. Because this is the same software put into a Samsung Galaxy Tab 2. As they say, you get what you pay for. So I rated it as three stars for \"It's OK\".", "Date": "January 30, 2013"}, {"Title": "LOVE IT", "Author": "Karen", "ReviewID": "RPL7RJU1UCIAB", "Overall": "5.0", "Content": "Brought a 9\" tablet and loved it, decided to buy my a 7\" and gave my mom my 9\" to use.  She and I both love playing games on them.  I also love reading books on them too.  Great price and great tablet.  You can check e-mail, face book, twitter and lost more on this tablet.", "Date": "May 3, 2014"}, {"Title": "No problems at all. Is exactly what I wanted.", "Author": "Max Linzmeyer", "ReviewID": "R2UYUCHDVNE06V", "Overall": "5.0", "Content": "No problems at all. Is exactly what I wanted. It doesn't have everything that an iPad has, but I didn't pay $ 400.00 either. It is excellent for the money.", "Date": "February 26, 2014"}, {"Title": "problems...", "Author": "Rowan Morin \"Rowan\"", "ReviewID": "R2N8ITNX922C16", "Overall": "1.0", "Content": "I don't know about other people who have bought this product, but I had nothing but bad luck with it. I was upset when I found  out that the internet stopped working for it. Then it started loading slow and wouldn't download apps. Thankfully I got my money back and I bought a Kindle Fire HD. I have yet to have problems with it.", "Date": "December 22, 2013"}, {"Title": "good basic tablet", "Author": "Gigi Mar", "ReviewID": "R13ZM4A0KIE6D8", "Overall": "5.0", "Content": "Basic tablet and affordable! Great for netflix and all entertaining purposes. Amazing for kids and anyone who wants something small fof fun.", "Date": "November 30, 2013"}, {"Title": "Great product", "Author": "Gary  Green", "ReviewID": "R39NMRSVZ15TUY", "Overall": "5.0", "Content": "Great tablet for my 5 year old. A lot of the games for him is downloaded, which is great. I really like the read along books. Great Buy!", "Date": "November 7, 2013"}, {"Title": "Excellent value", "Author": "David Friedman", "ReviewID": "R2Y5REY9TMNQXT", "Overall": "4.0", "Content": "Great choice for our 9 year old.  Much better than other brand we tried and returned (polaroid).  Decent speed and capacity.  Has held up well in 8 months since we purchased it.  The 1 mobile site has tons of popular apps and they are all free so no worries about him going nuts on the downloads.", "Date": "October 18, 2013"}, {"Title": "Be Careful What You Wish For!", "Author": "Katherine M.", "ReviewID": "R25MYIP9YEZB26", "Overall": "3.0", "Content": "The truth of the matter is, we got this because it was a relatively cheap product but it was something that my son wanted. Sadly, it's a piece of crap. It worked fine at first but then it started going down hill quickly. Certain apps, such as Netflix, REFUSED to even OPEN on his tablet. This disappoints me severely considering my son really, really wanted this. It hasn't been a year and the plug in port has broken. Normally, as a parent I'd blame him but with all the issues we've been having and the way we've seen him treat it... it's not him, it's the machinery. So, if you want a temporary tablet to hold you over until you can afford a good one this is good for it. Just don't use it as a permanent thing.", "Date": "September 20, 2013"}, {"Title": "Nice for a child", "Author": "K Coleman", "ReviewID": "R1B3OGAQ7X58P5", "Overall": "4.0", "Content": "Some of the programs take quite some time to load. Battery life is good. 8 year old is satisfied with it.", "Date": "August 30, 2013"}, {"Title": "For kids", "Author": "Babzee \"Barbara\"", "ReviewID": "R17O9IX3X2WEVA", "Overall": "5.0", "Content": "This was a graduation gift for a kid and he loves it!A great first computer tablet, Surprised how well it works", "Date": "August 30, 2013"}, {"Title": "Surrogate", "Author": "Brett", "ReviewID": "R19C9QNPP4G8R4", "Overall": "4.0", "Content": "I purchased this for a friend who liked the D2 tablet I bought my wife. She gave up on Laptops and noticed my wife carried hers everywhere. She decided on this one because of the price. The only complaint she has expressed is slow video playback at times and poor battery life. I encouraged her to buy a tablet with 1gig of memory to prevent the slow response, but she chose not to. She uses it to Web surf, go on Facebook and play games and is very satisfied. She did say if she had it to do again she would buy one with 1gig of memory.", "Date": "August 11, 2013"}, {"Title": "No sound", "Author": "helen king", "ReviewID": "RAM7FCVEEOGCH", "Overall": "1.0", "Content": "I was not pleased with this product at all I ordered it twice and each time there was something wrong with it. I am still looking for my refund that was never sent for this tablet it has been over a month. The first one the color was messed up in it I sent it back and the next one had no sound. So I just asked for my refund and I never got it. It was suppose to take 3 weeks to get a refund and it has been over a month and still no refund.", "Date": "August 8, 2013"}, {"Title": "Grand daughter Loves It", "Author": "Debra Revel", "ReviewID": "R27ITMYN0GKTSN", "Overall": "5.0", "Content": "Bought it for my 9 year old grand daughter. She loves it because she can now play Fun Run with me and her mom", "Date": "July 14, 2013"}, {"Title": "Good little basic tablet.", "Author": "Jennifer L. Bannan", "ReviewID": "R17TFK071YHE3X", "Overall": "4.0", "Content": "Only reason I gave it one less star is that it doesn't have a rear-facing camera. Otherwise, it seems to meet all other requirements, including Android-apps compatibility.", "Date": "July 14, 2013"}, {"Title": "Ok for the money but very slow", "Author": "Hugo", "ReviewID": "R1NPNMBYV1OLE4", "Overall": "2.0", "Content": "I bought this because it had some good reviews and was inexpensive for a 7 inch tablet. The screen is good and the operating system close to the most recent. Runs all the usual android applications, but no playstore. This isn't a problem since there are other non Google stores that have android apps. The main problem with this is the very slow processor used, which probably accounts for the low price. It takes much much longer then the ipad and name brand android tablets I bought later. Not just a little slower, but sometimes so slow you will think the device stopped running. In hindsight I should have gotten a name brand tablet for a little more money. Its worth it.", "Date": "July 7, 2013"}, {"Title": "Works fine, but not enough UMPH", "Author": "Jeffrey Cross", "ReviewID": "R28CF7PFXFIEWY", "Overall": "2.0", "Content": "We bought two of these tablets.  There are two things that I think everyone ought to know before making this purchase.- The battery is 3000ma (according to the documentation.)  My son plays 3D games (mostly temple run) and it lasts almost exactly one hour before being completely dead.- 4gb of ram may sound like a lot but it's almost completely gone.  Again, my son loaded 3 games before getting \"out of memory\" errors.  We were able to remove a preloaded movie (or trailer, I don't remember) and reclaim some space.  But it's small storage straight out of the box.  Yes, you can easily expand the memory but you can also spend a little more money for one with more memory out of the box too.For us, the limited battery and limited storage was enough to send it back.", "Date": "June 4, 2013"}, {"Title": "Every now and then you get a winner", "Author": "Steve Kaye", "ReviewID": "R26A097FC60MW1", "Overall": "5.0", "Content": "Bought this to investigate how I would take to a tablet. This D2 is stable, has never crashed and although it is not very fast it works well. I installed a ROOT CHECKER and found it is rooted out of the box. The BUMMER is that this device is not a certified Google device so it cannot get APPS from Google Play or use Google maps. You can still get APPS from Amazon or 1Mobile but I suggest you check out the APPS first at Google Play. Their reviews and permissions information is invaluable. I was shocked to learn one of the most popular APPS can control you phone (or tablet). It can send, read or delete SMS messages, make phone calls, take pictures and It can read data about your contacts all without your confirmation. So folks, be careful. There are alot of free APPS but the, there is no free lunch. They want your information. Call me paranoid but I have been subject to identity theft and it was a bummer. For this reason I do not intend to keep the tablet. I just feel safer with my 10\" netbook. But for a basic tablet for the kids or to take on the road I would have to recommend it.**********************************I should have waited to write this review. I said it did not work with Google Play (Store). Well, the next day I got it to work with the Google Play. Finding the necessary files took a little time but since the tablet was already \"rooted\" installing the files was simple. I have now used the D2 for 100 hours and have tried to beat it up. No freezes, no problems. I am not sure if the newer models come rooted but this one did and since I git Google Play to work I am raising my rating from 4 star to five. This rock solid low end tablet is a score!", "Date": "March 11, 2013"}, {"Title": "Good device", "Author": "amg", "ReviewID": "R112UD15EEYWQT", "Overall": "4.0", "Content": "This is my first tablet, so I don't have anything really to compare it to... that said it works well for the things I bought it for- netflix, light game playing via apps, web browsing, e-books.  It plays Netflix pretty well, you do have to hold it at a certain angle for a good picture and I'm sure it's not the highest quality picture but it works for me.  It comes with a bunch of preloaded apps, a lot of good kids apps too.  Does not have access google play but so far there have only been a couple apps I wanted that aren't available through mobile1market or amazon.  Battery life isn't super great, but so far I haven't had it die it one session or anything.  I got it more for around the house use which means I have no problem plugging in while I'm watching netflix on the couch.  It's pretty responsive to touch, the keyboard sensitivity is good, not too many times it picks up the wrong key.  Overall I find it well worth the price for my needs.  Its a good tablet for new tablet users and would even make a good tablet for a kid or teenager for the price.", "Date": "March 6, 2013"}, {"Title": "Great Kid Tablet", "Author": "Amazon Customer", "ReviewID": "RPDSWULFFG1ES", "Overall": "5.0", "Content": "We just bought these for our kids ages 6 & 9, and they absolutely love them. They are easy to set up and use and the kids can play their games, watch movies, listen to music and connect with their school / teacher websites.", "Date": "February 20, 2013"}, {"Title": "Great Tablet", "Author": "Shawn B", "ReviewID": "RELI7NHSY3EWB", "Overall": "5.0", "Content": "this tablet is awesome. It's very responsive runs Android 4.0, and even though it doesn't come stock with Google Play I have managed to google and find most of the apps My kids wanted. Netflix is great on this and works wonderful. It's a great tablet and for this price of this unit, it simply can't be beat!", "Date": "February 20, 2013"}, {"Title": "Kids love it", "Author": "Heidi Vandawalker", "ReviewID": "RQK1DQPS1WXNL", "Overall": "5.0", "Content": "This is such a good tablet.  It works great and has enough to get many apps for free for the kiddos.", "Date": "February 5, 2013"}, {"Title": "great for young kids", "Author": "memaw5901", "ReviewID": "R1Z644UGTBMQ19", "Overall": "3.0", "Content": "brought for grandkids, the only thing that I have a problem is there is a short in the charger. he like that he can play games", "Date": "September 6, 2013"}, {"Title": "You get whatvyou get", "Author": "Not too happy", "ReviewID": "R3ELA694LJLV44", "Overall": "2.0", "Content": "I got it for my daughter 2 weeks ago. She was very exited at the beginning however the tablet freezes including a lot while playing ! Its slow to browse ,responds slowly open apps. While playing it freezes up completely amd needs to be restarted. So after a week of patience enjoyment she again rather play on my phone or ipad. I wish i could return and def would get smth like nexus", "Date": "April 1, 2013"}, {"Title": "worst tablet ever", "Author": "Amazing G", "ReviewID": "R3VJWMA4W78BB0", "Overall": "1.0", "Content": "DON'T BUY please your wasting your money and time. its has so many problems i am surprised it had no recalls. i have had had 3months and its shot by first month. i have running on different programs and that didn't help. its very slow and you need buy a memory card and it still has problems. and i am very good with touch screen technology and hotline they had didn't what they were talking about either. so if you want a new expensive paper weight be my guest buy this. that what i use it for and don't buy this be wasting your time, money and headaches. thank you for taking your time read this review.", "Date": "April 16, 2013"}, {"Title": "NOT Better than a Samsung Galaxy Tab!", "Author": "Amazon Customer", "ReviewID": "R1LGPY5TG2X22F", "Overall": "3.0", "Content": "First, please note that this is a legitimate review by a real person who actually purchased the tablet.  It was amazing, while shopping for a low budget tablet and case, how many fake reviews we encountered.  I saw a you tube review on the D2 which is why I decided to give it a try.This tablet is definitely worth considering for the kids but whoever said it was better or even comparable to a Galaxy Tab obviously doesn't own a Galaxy Tab (or is a fake reviewer.  I do and I can assure you, there is no comparison.  But really, there shouldn't be based on the amount of money I spent on my GT compared to the D2.  The D2 runs most apps well, but slower.  The screen rotation can be very pokey, like minutes before it finally decides to rotate.  The wi-fi seems to work really well, unlike a Coby Kyros we had purchased and returned.  Playing games like Subway Surfers can be hit and miss.  Some days it's great and somedays it's a little glitchy.  We also needed this for a reader and though our reader, Mantano, is slower, it still works really well.  The camera is a bit of a joke and since there is no case for this specific brand, is covered up by the case we ended up with anyways.  It wasn't really necessary anyways as my kids have their own cameras anyways and the cameras on the lower priced tablets aren't usually comparable to what they have anyways.  The kids aren't complaining, it plays Fruit Ninja and Talking Tom great!  We don't play movies on our tabs but they preloaded preview of Jack played nicely.  They are just so thrilled to have their own tablet.  I, on the other hand, couldn't deal with the issues after being used to my GT.  We purchased 3 but so far the blue one is the only one we've received and what I'm basing this review on.  I will update if there is additional info to be added.", "Date": "March 28, 2013"}, {"Title": "My first Pad", "Author": "Frank J. Miller", "ReviewID": "RLZ2MWS3ZB3RV", "Overall": "5.0", "Content": "Being my first pad, I really have not figured it out yet. It seems easy to use and works with every format it says it does. The browser is fast, and the screen touch is great. I should have bought one of these sooner.I would advise buying a case for it. I got the one with the keyboard in it..Fits perfect.", "Date": "January 25, 2013"}, {"Title": "Just received today...", "Author": "Corina Smith", "ReviewID": "RD3FKSU2KAOOK", "Overall": "2.0", "Content": "and brand new out of the box the charger doesn't work. Hello quality control!! I contacted the manufacturer and they directed me to the website to open a ticket. Hopefully they are speedy with their response time and send a new charger asap. My daughter is pretty bummed that she can't use her new tablet.", "Date": "May 3, 2013"}, {"Title": "i hate it", "Author": "Therese Haag", "ReviewID": "R3SOKK5WXSES14", "Overall": "1.0", "Content": "it is slow no memory and cannot connect to the internet and is very confusing and slow to work with", "Date": "May 3, 2013"}, {"Title": "Sound stopped after 1 hour of use", "Author": "Dave C", "ReviewID": "R2B83878GFSHVF", "Overall": "1.0", "Content": "This is the first review I've ever written on Amazon.  It is also the first time I've had to return a product.  I was really looking forward to having my first tablet and even though I was a bit wary because of the price, I wasn't too concerned since I've always had good luck with electronic devices.  Not this time.  I fully charged the D2 tablet and tried it out as soon as it was charged.  Everything seemed fine for about 1 hour and then I noticed it made a strange noise for an instant.  It continued to work fine so I thought nothing of it.  It got down to about 70% power so I turned it off for the night.  When I turned it on today it seemed fine and I installed a few apps.  Suddenly it started making a strange static/squealing sound.  The volume of this sound would not increase or decrease, even when the volume control was all the way down.  I tried listening to music and a movie using the headphone jack and that worked fine.  When the headphone was plugged in the sound from the speaker stopped.  This sound was really annoying so I decided to do a factory reset.  The sound was still there.  I turned it off and back on and now there is no sound from the speaker at all.  I am obviously returning this tablet tomorrow.", "Date": "April 18, 2013"}, {"Title": "DO not waste your money", "Author": "Nicole Traas", "ReviewID": "R2BQQVNRETX17A", "Overall": "1.0", "Content": "I bought 2 of these for Christmas for my children and the charging ports broke away within 2 weeks. The company replaced them once and the same thing happened again. They have since started ignoring my requests for assistance. Terrible product with terrible customer service.", "Date": "June 9, 2014"}, {"Title": "Great deal", "Author": "megz", "ReviewID": "R1IW5S7ZS5RJMH", "Overall": "4.0", "Content": "This tablet is a great deal for the money.  It can do many of the same functions as more expensive, comparable devices.There are a few set backs however, it is a bit slow, the camera is awkward (it is positioned to take selfies easily but makes it difficult to take photos or videos of other people/places/things; and it freezes from time to time).That said, it is a very helpful tool that I have used for school, personal, and work related functions.", "Date": "June 5, 2014"}, {"Title": "IT IS AWESOME!!!!!!!!!!", "Author": "Romana", "ReviewID": "R23YAU8BUTP9B5", "Overall": "5.0", "Content": "It's really good, I bought a lot of tablets but this one gets the jobs done this tablet is basically a iPad but a little smaller, and uses Google play instead.", "Date": "May 13, 2014"}, {"Title": "you get what you pay for.", "Author": "Len C. Kiel", "ReviewID": "R1NZOW51M7B6O6", "Overall": "2.0", "Content": "this was the least expensive android available on amazon at the time and it had relatively positive reviews, so i purchased it. it worked well for a time, but after a few months it began to have random glitches, including wifi connection issues. after having it a little over a year, the wifi completely ceased functioning. no thanks.", "Date": "May 4, 2014"}, {"Title": "pretty slow", "Author": "Lauren Neal", "ReviewID": "R9HQ7XTPIK747", "Overall": "3.0", "Content": "I purchased this several months ago to look at facebook, internet, and kids games. The reviews said that is was fast and easy to use. It is easy to use, but it is very slow to load. It tends to lock up if you are not patient and hit the screen before it finishes loading (as my 3 yr old does frequently). Netflix takes so long to load that it isn't worth messing with. It now basically sits on the coffee table. My boyfriend's Samsung Galazy Tab 2 7.0 is much faster! I would spend a little more to get a faster tablet.", "Date": "April 30, 2014"}, {"Title": "Horrible Tablet", "Author": "Audrey Wright", "ReviewID": "R3U6P6F8H4XAC", "Overall": "1.0", "Content": "It is just a cheap device,  I guess. I don't think it's Amazon's fault, I think it's the tablet. I would never recommend this.", "Date": "March 19, 2014"}, {"Title": "Kids love it", "Author": "Kelerg", "ReviewID": "R1U2LA6II2ARI5", "Overall": "3.0", "Content": "My kids love it for playing educational and strategy games.  I use it mostly for reading e-books or as a Pandora music player.  Unfortunately it seems too slow to handle using it for email or any other internet functions.", "Date": "March 5, 2014"}, {"Title": "not bad", "Author": "Tennille Martell", "ReviewID": "RBKON1H50D263", "Overall": "3.0", "Content": "My 3yr old really enjoys playing with his tablet. It is rather slow but good enough for him. Would recommend for a child.", "Date": "December 19, 2013"}, {"Title": "Good item for the price", "Author": "Kym", "ReviewID": "RLUXVZZ1BJZKH", "Overall": "4.0", "Content": "Daughter loves this tablet so I would recommend if you are searching for a tablet for a small child. Great travel size", "Date": "December 17, 2013"}, {"Title": "tablet", "Author": "paul branch", "ReviewID": "R3PKV7NLF4E2RZ", "Overall": "5.0", "Content": "I bought this for my sister for her birthday. She absolutely loves it. It goes everywhere with her. its so funny but cute. Buy this for your loved one and be the hero. lol.for real though", "Date": "December 17, 2013"}, {"Title": "ok device.", "Author": "Chip Peruzzi", "ReviewID": "RPXVKQDEY5NVQ", "Overall": "3.0", "Content": "For the price this little tablet is ok. The battery life is short and Needs to be charged often. I am able to play angry birds on it and some some web surfing as needed.  It is slow. It tends to freeze up and need to be restarted too frequently.  This is more of a kid friendly device. So if you an adult who needs super fast, instant internet, move along!", "Date": "December 16, 2013"}, {"Title": "DO NOT PURCHASE YOU WILL BE UNHAPPY", "Author": "Jeremiah Johnson", "ReviewID": "R28E15Q1FWK0Z9", "Overall": "1.0", "Content": "Extremely slow and freezes frequently.  Not worth it at all, I sure wished I held out to get something a little better.  Now the big name brands you can get for even cheaper then this one.  This D2 is not even suitable for kids it is slow ridiculously slow and irritating.", "Date": "December 13, 2013"}, {"Title": "Faulty USB Port", "Author": "TluvsCtoo", "ReviewID": "R4A5GPKPVSXM", "Overall": "2.0", "Content": "Its true that you get what you pay for. Bought this tablet because the price was cheap. I have a child who doesn't always take care of her things so I decided to go the cheap route with this tablet. It worked okay. Picture quality wasn't all that good and it was a little slow. After having the tablet for less that 6 months the USB port completely fell out when the charger was taken out of it. We called the company that makes the tablet and they said that this happens all the time! Not by any fault of the owner but by fault of the manufacturing. Since the port fell out it completely ruined the inside motherboard of the tablet and it was no longer able to even turn on. I usually don't write reviews but I felt people should be aware of the faulty USB port before trying to purchase this item.", "Date": "August 9, 2013"}, {"Title": "It doesn't response on my expectations.", "Author": "Stanimir Stoyanov", "ReviewID": "R11MVMF6PKM87Y", "Overall": "2.0", "Content": "The Android Operation system is too slow, also it can't catch Wi-Fi, even when I try from few metres.Sometimes just turn off by itselfs.", "Date": "July 11, 2013"}, {"Title": "Terrible it does not hold a charge is super slow just awful", "Author": "Tammy Y. Houston", "ReviewID": "R22J3V5LFM0EVO", "Overall": "1.0", "Content": "Just awful. Will never order again super slow can't hold a charge. Just terrible cant fool a toddler no good", "Date": "July 7, 2013"}, {"Title": "great tablet", "Author": "TheDutchess", "ReviewID": "R30B1AVK4JNQZP", "Overall": "5.0", "Content": "Purchased for a friends grand kids.  They love the tablet and get a lot of use out of it.  Great", "Date": "July 6, 2013"}, {"Title": "never buy for a kid", "Author": "J Kurdziel", "ReviewID": "R3NLR70QOS8ABR", "Overall": "1.0", "Content": "this tablet does not hold up well. it tapped the floor on a 2 inch drop from my 8 year olds hand. i was there. i saw it. the screen went berzerk!!! and they wont fix it. he had it for a week. waste of $75! if it says for 4 years and up it should be made for 4 year olds to handle it.", "Date": "July 5, 2013"}, {"Title": "Love this tablet!", "Author": "Melissa Kearney", "ReviewID": "R3A2U2RKSTBH1", "Overall": "5.0", "Content": "I bought one for my son for his birthday...  he is a college kid, so I was a bit worried it wouldn't be techie enough for him.  He absolutely loves it.  It is easy to get books, Easy to download and play music.  Lots of games and easy to handle.  He loves the smaller size.  I would get some type of cover...  He did drop it and crack the screen.  I liked this tablet so much I bought one for my husband for his birthday.", "Date": "May 10, 2013"}, {"Title": "pretty good for the price", "Author": "kwacasey", "ReviewID": "R3AFK9O3PY2KHU", "Overall": "4.0", "Content": "Bought this for my daughter for her birthday.  It is fairly well put together.  The quality seems good.  There was a dead pixel and the sound seems a little low for my taste, but she loves it.One other item of note it does not use the google play store (which is not really a problem) it has its own store installed in place of this, that works just fine.I would buy another one, really great for the kids.", "Date": "May 6, 2013"}, {"Title": "Not what i was expecting", "Author": "Jessaris Mitchell", "ReviewID": "R2N6Y3V9N7W4M3", "Overall": "2.0", "Content": "I bought this about a month ago. I was kinda excited to get it because it had a good review, but when i finally received it and have used it for while. I'm not liking it at all. Its soooo slow to process simple task. Also you can't have more than one thing running on it other wise the applications will stop completely or crash. I do like the size of the tablet, but as soon as my daughter dropped it the screen broke. So if u are getting one. Get the Accidental handling warranty thing.", "Date": "April 24, 2013"}, {"Title": "Not worth the effort", "Author": "Joanne Garcia", "ReviewID": "R30H808QLVWK75", "Overall": "2.0", "Content": "I bought 1 for each of my 3 children, and had to use the protection plan to return them.  They all started having problems with re-charging, the ports stopped working.  I tried to exchange them, but ended up having the same problems... Other than that, they are worth the money if this was not an issue", "Date": "April 24, 2013"}, {"Title": "Wonderful product for the price", "Author": "R Lucas \"R Lucas AZ\"", "ReviewID": "R1OU5IC0E1HJ88", "Overall": "4.0", "Content": "I purchased the D2 about one month ago and have been very pleased with it so far. I love the apps available on the Amazon App Store (I use the tablet mainly for the Kindle app but also for some Facebook and Pinterest. Netflix works well but the screen is a little too small to make watching worthwhile.) I haven't found an app I like for listening to music so I don't know how performance would be in this area. I'm disappointed with the browser which is VERY slow. I haven't taken any photos yet that turned out good enough to keep. All were deleted and it's unlikely I'll be using this feature unless absolutely necessary. Overall, it's well worth the price if it's problem areas aren't a big deal (to me they're not.) I would recommend this for someone who hasn't owned a better (read: higher end) tablet as an entry into the tablet using world.", "Date": "April 17, 2013"}, {"Title": "Good value overall", "Author": "MrFixItNJ66", "ReviewID": "R1PLHJ22HN2J9H", "Overall": "4.0", "Content": "While I wasn't expecting this tablet to be anywhere close to an iPad, I am quite pleased with it & am glad that I was able to get it in time for my son's birthday.  I actually purchased two of them since we have twin 5 y/o's and wanted them to each have their own tablet (to avoid the usual sibling arguments), and while I had to get 1 of them in white, since the black model was back-ordered for over 6 weeks, they are great for what we need them to do. Sure the download speed is somewhat slow, but the display is clear and overall it does everything we expect it to do.  A great value, considering what some of the bigger name brand tablet cost.", "Date": "April 17, 2013"}, {"Title": "d2", "Author": "eric", "ReviewID": "R1904SGJT18WQF", "Overall": "1.0", "Content": "its super slow. its freezes all the time it takes forever to load and half the time it does not even turn on", "Date": "April 10, 2013"}, {"Title": "So far so good.", "Author": "Troy V", "ReviewID": "RHRZHB5OOWE8Q", "Overall": "5.0", "Content": "About 2 months old now, birthday gift for daughter. She dropped her I-POD & replaced it with this. Very good product for the price. Could use a little more h/d space, but other than that she really likes it. Tthere is a slot for add'l space on the side, so I'll just pickup a 16gb memory card, or so. Thanks!", "Date": "April 8, 2013"}, {"Title": "Very good product! for it's price", "Author": "Ivan Santana", "ReviewID": "R320NCZQ1RFLPV", "Overall": "4.0", "Content": "This tablet does everything that the seller says and does it well, for the price it is a excellent choice, the presentation of the product is very good as it's package, is not too fast but not too low, regular responsiveness, medium screen picture quality (HD movies looks great), it's light and thin, perfect for my 3 years old son. Battery life is decent, and can do video calls by Skype. I would give 4.5 if i could, or probably 5 stars if this would have HDMI port like others that are in the same price range.", "Date": "April 2, 2013"}, {"Title": "Easy to use!", "Author": "Andrea Gronich", "ReviewID": "R2F7GLFTREYB88", "Overall": "5.0", "Content": "I bought this for my mom so she could show everyone digital pictures of her grandson. Easy to use, wifi is fairly fast, and the price is great.", "Date": "March 28, 2013"}, {"Title": "GOOD PRODUCT", "Author": "Christina Reamer", "ReviewID": "RNBEQFMKICTFY", "Overall": "4.0", "Content": "I GOT THIS FOR MY SON AND WE REALLY HAVEHAD NO PROBLEMS WITH IT AT ALL.  HE USESIT CONSTANTLY AND DOWNLOADS ARE EASY.WOULD RECOMMEND THIS PRODUCT", "Date": "March 20, 2013"}, {"Title": "bad purchase", "Author": "alan jelinek", "ReviewID": "RFV77CS4TFRG7", "Overall": "2.0", "Content": "The tablet was nice and came with a lot of apps.. The problem- after two weeks, the unit would not boot up anymore... I had to return this item as defective.", "Date": "March 18, 2013"}, {"Title": "D2  D2Pad It would be good for kids", "Author": "Phillip Carley", "ReviewID": "RDIKN9L1A61ML", "Overall": "3.0", "Content": "I could not keep a connection.It would be good for small kids who don't use the internet much.The preloaded programs were geared for small kids.", "Date": "March 16, 2013"}, {"Title": "i dislike it", "Author": "des", "ReviewID": "ROXE3OOAEWO6C", "Overall": "1.0", "Content": "It freezes up a lot and it takes forever to load. I can't update certain apps for some reason. I am not pleased!", "Date": "March 16, 2013"}, {"Title": "Good tablet.... but how good?", "Author": "Chino", "ReviewID": "RJF6CDV77DKV1", "Overall": "2.0", "Content": "I purchased this tablet about a month ago for my 5 year old daughter because we are a very tech savvy family. When first opening the box my daughter and I took inventory of every thing that came with it, one thing we noticed very much was the build quality. The build quality was very impressive, even more impressive than my ASUS Transformer TF-101. So we where very pleased with it but as soon as we got to playing around on it is when problems started to show, for an adult this would be a horrible tablet. My daughter has a lot of problems downloading and playing games. Over half the games she has downloaded was not compatible and unfortunately unlike the Google Play Store the android app store on this does not check compatibility. Even just browsing the internet is a bit of a challenge when your suppose to be running a 1 GHz CPU with 512 MB of RAM and unfortunately that's not what you are getting, you actually a 800 MHz CPU and 256 MB of RAM. So with a actual lack of specs for very light game play it's nice but if you wanna do more than that I would suggest looking else where because your child will be complaining to you every 5 minutes on how it keeps freezing. Maybe if there was a android 4.1 update it might be more worth it to get but until then my daughter will keep playing the games she has on here till we get her a Google Nexus 7 or 10.", "Date": "March 14, 2013"}, {"Title": "Awesome for the price!", "Author": "S. Hawley", "ReviewID": "R1CQHIMR44YS5P", "Overall": "5.0", "Content": "Knowing that this tablet was under $100 I did not have too high of expectations. After all it was a present for a 9 yr. old. But I was real surprised at how good it was and a fast processor. I would definately say it runs fast and without hangups unlike my LePan tablet and my other daughter's Visualland. Highly recommend it and it is perfect for children because of the pre-installed apps.", "Date": "March 14, 2013"}, {"Title": "perfect for the children", "Author": "JC4E", "ReviewID": "R39AJAQTL5UJSJ", "Overall": "5.0", "Content": "This tablet is just right for the children. The battery dies quickly but other than that its great. You can add your own apps to this device.", "Date": "March 14, 2013"}, {"Title": "Adjust your expectations", "Author": "thecrwth \"thecrwth\"", "ReviewID": "R167FTFCMJDXFP", "Overall": "4.0", "Content": "If you look at this as a cheap tablet that has basic functions, it does exactly what it sets out to do.  it is already rooted.  Ready to use right from opening the package.  If you are looking for bells and whistles, you will be disappointed.", "Date": "March 13, 2013"}, {"Title": "Wonderful", "Author": "theresa lewis", "ReviewID": "R2LGVQG9BOLO1S", "Overall": "5.0", "Content": "A co worker bought this tablet for her child and recommended that I buy one for my daughter and I'm so happy she did. The apps are fun and they have alot of educational apps as well.", "Date": "March 13, 2013"}, {"Title": "Decent", "Author": "Ben", "ReviewID": "R3TU4Y21A6SF8E", "Overall": "3.0", "Content": "It runs really slowly but for the $80 price I should not complain. So far the apps run at normal speeds once they are open. Its the navigating and loading that seems to take a while. I'm going to add some memory using the micro SD slot and see if that helps.", "Date": "March 12, 2013"}, {"Title": "Decent", "Author": "Ben", "ReviewID": "R3TU4Y21A6SF8E", "Overall": "3.0", "Content": "It runs really slowly but for the $80 price I should not complain. So far the apps run at normal speeds once they are open. Its the navigating and loading that seems to take a while. I'm going to add some memory using the micro SD slot and see if that helps.", "Date": "March 12, 2013"}, {"Title": "wonderful!", "Author": "Kandykane", "ReviewID": "R2OZNGFMYIKF1C", "Overall": "5.0", "Content": "I purchased both pink and blue. These tablets are great for my children ages 4 and 9. Very easy to navigate, connection to wifi is fast so is the download speed. I would definitely recommend these tablets to family and friends. Thanks Amazon you rock!", "Date": "March 12, 2013"}, {"Title": "Good for Kids", "Author": "Dennis J. Mantovani", "ReviewID": "RMKQ5E11SRDCU", "Overall": "4.0", "Content": "Got this for my grandson and he likes it.  Battery does OK.  It is a bit slow but for the money it is a good value.", "Date": "March 10, 2013"}, {"Title": "It's worth the money", "Author": "sarah72978", "ReviewID": "RE2O9XJRQRHUU", "Overall": "3.0", "Content": "So far it's working fine. My daughter is used to playing on my IPad and says the tablet runs much slower. Also there is no USB port on this tablet which she wanted so she could hook up a mini keyboard.", "Date": "March 9, 2013"}, {"Title": "Good buy", "Author": "Rachel", "ReviewID": "R31V4PQOEDVOM2", "Overall": "4.0", "Content": "This tablet was purchased as a gift for a 6 year old girl; she loves it. This was a good purchase for a great price.", "Date": "March 9, 2013"}, {"Title": "Don buy it....are disposable.", "Author": "La Campesian de Belén, S.A.", "ReviewID": "R226HQ2L9VLS2O", "Overall": "1.0", "Content": "I bought two of these tablets for my daughters. One of them fell down (on the carpet) and burst your screen. The second of which stopped working after one week purchased. I turned it off using the on / off and when I tried to use it again, just keep the word \"android\" permanently on the screen. I waited all night and the next day nothing ... just see a huge phrase \"android\" on the screen. As the suit to Costa Rica I can not return (the freight is very high). Do not waste your money, are disposable.", "Date": "March 8, 2013"}, {"Title": "Good tablet for the price you pay", "Author": "Klyn", "ReviewID": "R1T0VTB4Q9VNOX", "Overall": "4.0", "Content": "I really enjoy the tablet the only thing is it freezes up sometimes other than its perfect for me & my six year old daughter", "Date": "March 8, 2013"}, {"Title": "D2 Is Ok", "Author": "Eric Capasso", "ReviewID": "R6C60NH6J19YZ", "Overall": "3.0", "Content": "I bought the D2 just as a toy. It's as fast as my HTC Evo 3D cell phone. I play with computers all day long and I am not very impressed with the D2. It did come with a lot of kids apps and my kid plays with it more then I do. It found my server right away and I was able to look at pictures but it took a few to load. If I was just using the D2 for myself I would only give it two stares, but for my kid to be playing with it with ABC's and numbers its a three.", "Date": "March 7, 2013"}, {"Title": "For the 3 year old", "Author": "Dan Barnes", "ReviewID": "R3FI5IACVMI736", "Overall": "5.0", "Content": "Bought this for the 3 year old to start her learning and the wife is always stealing it. Both of them are satisfied and I can buy four or five for the price of an Ipad, so I'd buy another.", "Date": "March 7, 2013"}, {"Title": "great for a beginner tablet", "Author": "Xskinner", "ReviewID": "R3021CM7QH2FJQ", "Overall": "4.0", "Content": "The D2 is everything that the tech details say about it as far as the software. The touchscreen is smooth bit thin and the plastic around it is thin. Shop for a universal cover for a 7inch tablet to fox that problem. It is well worth your money.", "Date": "March 7, 2013"}, {"Title": "So far so good....", "Author": "Vephilli", "ReviewID": "R22ZPNUMQAWMN", "Overall": "5.0", "Content": "I ordered this for my daughter who will be 8 years old in April.  I've played around with it myself to see if it was user friendly and as of right now I don't have any complaints.  It's a really good product for the price and I would recommend this if you are looking for a nice tablet for $80. I will give an update after we give it to her for her birthday.", "Date": "March 19, 2013"}, {"Title": "This isn't nearly as good as it sounds", "Author": "Rob Walker", "ReviewID": "R2L55HAR49NJBC", "Overall": "1.0", "Content": "I own a MID 7 inch tablet and mistakenly bought this thing thinking it would be at least as good.. The only thing we can use it for is entertainment for our 7 year old !", "Date": "September 11, 2013"}, {"Title": "TERRIBLE Diablotek customer service!!!", "Author": "Greg M", "ReviewID": "R28HY4IRKSTBGA", "Overall": "1.0", "Content": "Buyer BEWARE!! Bought this tablet has a Christmas present in December. In March the power button took a dump, lost its detent, and will no longer press. I have done everything in my power to get it repaired or replaced through Diablotek with no luck at all. I have sent 5 emails to 2 different email addresses and made numerous phone calls to their tech line. I can never get a person the line! It does come with a 1 year parts and labor warranty...at the rate I'm going it will be expired before it get a response back from them. You get what you paid for...at least honor your parts warranty!! Buyer beware!", "Date": "July 5, 2013"}, {"Title": "First Tablet", "Author": "Robert Moon", "ReviewID": "RT3FA9667IRWE", "Overall": "4.0", "Content": "Never having used a tablet before I am pleasently surprised that this tablet is more than I expected. I consider it a bargain.", "Date": "May 4, 2013"}, {"Title": "I did not really like it.", "Author": "TruWriter", "ReviewID": "R32FEL6HER15EK", "Overall": "2.0", "Content": "I did not really like it. Maybe it's right for someone else, but not me. It was not what I expected.", "Date": "April 28, 2013"}, {"Title": "happy with it", "Author": "Tarr", "ReviewID": "R1UNXZSIFSDWKH", "Overall": "5.0", "Content": "I bought three of these tablets for my family, mainly for my two little daughters. I am not a fan or a regular user of tablets, but I can tell you they are decent and work well. They are designed mainly for kids and family use. This tablet is recently produced, with good features and affordable price. I am happy with it.", "Date": "April 4, 2013"}, {"Title": "Waste of money!", "Author": "Renee Worthington", "ReviewID": "R1YS0PVR20HALV", "Overall": "1.0", "Content": "I purchased this for my husband so he could surf the web and keep up on his sports.  After receiving it, I downloaded 5 apps on it. Most of the time, it wouldn't connect to the internet, even if we were standing right next to the modem. After a week of having it, it just wouldn't turn on. We plugged it into the charger overnight, the next morning, it still wouldn't turn on. I had had enough and decided just to return it and go buy a more expensive one. During the week we had it, I think my husband got to use it a total of 3 times because we had so many problems with it. I would suggest, spend a little more and get one that actually works, especially if you plan on using it a lot.", "Date": "March 18, 2013"}, {"Title": "Bought this for our daughter...", "Author": "Heather", "ReviewID": "R2UDA4DO8OFE5Y", "Overall": "4.0", "Content": "We bought this for our 2 year old daughter...she is very tech savy. She always wanted my Iphone to watch music videos on youtube. We researched alot of different tabs before we bought this one, we wanted something quality but inexpensive. The 7 inches is the perfect size for her, it has with stood her \"abuse\" so far. The games for kids that comes loaded on it is almost worth the $80 alone. They have toddler/preschool games that teach shapes, colors, numbers, and more! And it will read the preloaded books out loud! Which I also think is pretty cool! We downloaded youtube through moble1. Like other reviewers have said--it is a bit slow-- Mainly the internet, which she doesnt use. The battery life has been great for us! I truely recommend this for a child! It is without a doubt worth the $80 to me.EDIT: After owning this right at a month, I sat it on the arm of the couch, it fell off and cracked the internal screen. I called to see about adding insurance. They were willing to add it for me even though it had been a couple days past the 30 days--but it only covers up to the price of the tab. So for an $80 tab, we decided against it. A few days later, my husband broke the screen further--this time you can feel it when you run your hand over it. Pretty sad my 2 year old wasnt the one that broke it either time. Also, I have found that you can download the barnyard games for free--so you can get that with any tab you buy! The power button became lose, still works--you just have to hit it a time or two before it turns it on/off. I still think this is a great tab for a young child, but maybe not as great as I thought when I initally wrote the review. If I knew my daughter was going to use it as much as she has, I would have bought a more expensive, quality tab to begin with. She defintely got $80+ out of it!", "Date": "February 20, 2013"}, {"Title": "DO NOT BUY at D2 Tablet!", "Author": "Marie Austin", "ReviewID": "R2U480T78DTG2G", "Overall": "1.0", "Content": "This \"tablet\" is not worth even half of what I paid for it.  For starters it does not use the Google Play store, so you are stuck with off brand apps.  My son was very disappointed that he couldn't get the same games on his tablet that he plays on our phones.  This I was willing to live with, however the tablet cannot perform up to basic standards.  It frequently freezes, runs extremely slow and unexpectedly closes apps.  After just 6 months of very casual use (due to not having the games he wanted) the charging port stopped working.  We used the other charging port for a couple week and it too stopped working.  We cashed in our Square Trade warranty and got a replacement.  Again, same exact issues, only the pin charging port only lasted a month and the USB port lasted about 5 months.  My son's constant frustration and my hassle with warranty claims is not worth saving some money.  Do yourself a favor & DO NOT BUY this!", "Date": "April 17, 2014"}, {"Title": "best ever read!", "Author": "ebony", "ReviewID": "R3DMTTL7SZED8R", "Overall": "5.0", "Content": "Best book i ever read! its a must read! no lie true fire read! i recommandation. all day long people!", "Date": "January 7, 2014"}, {"Title": "I love it", "Author": "ILoveGod123", "ReviewID": "R2CDSPEBKHJZ18", "Overall": "5.0", "Content": "my daughter is really happy with this tablet. she loves pink so just imagine. I like the idea that it has lots and lots of educational games for her. she is in 2nd grade so this will help her get better at reading and identifying the meaningb of a word.", "Date": "March 17, 2013"}, {"Title": "dont do it", "Author": "caitlin", "ReviewID": "R2I828V7C6VUC4", "Overall": "1.0", "Content": "its junk i sent it back i was very unhappy with product. i would not recommend this for anyoneat all", "Date": "March 26, 2013"}, {"Title": "NOT WORTH IT", "Author": "webshopper", "ReviewID": "RN5GAGIPVO927", "Overall": "2.0", "Content": "Don't purchase this item.  It is a glorified game boy.  I would not recommend this to anyone.  Buy a real tablet.", "Date": "February 21, 2013"}, {"Title": "Shipping Decision: Lacking", "Author": "C. L. Washington", "ReviewID": "R1N41N3J2D9MF0", "Overall": "3.0", "Content": "I'll update this when the product is out of the box... however, I ordered two of these tablets for my twin daughters. Why wouldn't they ship at the same time? Now, I have some decisions to make. It would've been nice to have to \"consolidate shipping option,\" since it wasn't clear that I wanted them both...", "Date": "March 18, 2013"}], "ProductInfo": {"Price": "$79.99", "Features": "Android 4.1 Jelly Bean7 inches Display\n7 inch, 16:9 capacitive multi-touch screen\n4GB / 512MB DDR3\nAll winner A6 1.0 GHz", "Name": "Digital2 7-Inch Tablet (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/51kf5CJKN5L._SY300_.jpg", "ProductID": "B00BF9MU62"}}