{"Reviews": [{"Author": "TyeDye", "ReviewID": "R17UD5WCK132EG", "Overall": "4.0", "Content": "So, I purchased two from Amazon and mine stopped picking up wifi connections two or three weeks after using. It was not my router because my other devices were picking up my signal and others nearby. I attempted to return to D2 Pad Company but they have a procedure where you call in to limited tech support. Which leaves you creating a ticket online to pay to ship the faulty device to them VS AMAZONS free pick up via fed ex and replacement. I went with Amazons wonderful solution to my problem. The Day after I called fed ex came for the device. About five days later I had my replacement via USPS. I wanted the replacement and not my $100 and change back because the device is fine flaws and all. Its 9 inch screen is just right for me. The App MeeGenius and its pre loaded  childrens books which was the selling point for me is awesome.  I like the App Soundhound that allows you to find the title or artist to songs by singing it yourself or playing it pre installed. I like that when online I can go to top upright menu/settings to change Browser mode to Desktop instead of the Android mode it is on as default. These are pros to me. I read it didnt come with Google Play and so I use the One Mobile Market not a big deal or difference at all to me. I read it didnt have even a 1.0 mp camera. Well, with lighting on in the background the camera is does the job whenever I use it. I havent re tried Netflix since using desktop mode. But prior to it wouldnt play. It does play youtube videos with no poblem. And if it doesnt it must have something to do with your router or the device  . My relative whom has the one from the beginning has not encountered any problems what so ever. Ive played with the settings to make it my own. Brightness and ponter speed adjustments. Only issue is the lag you get when typing or touching to navigate way too often. But I look at the pros which is that it does the job never the less. Very clear resolution, lightweight, rubber back, streams videos and loads multiple pages. Thanks to the 4.1 os this cheapie is a keeper. Im satisfied and hope this review helped some. Im not into brands just good deals that benefit me. This was one. I suggest anyone who buys explore the settings of the device before assuming the worst. Take care", "Title": "Good for the money Honestly", "Date": "May 5, 2013"}, {"Author": "Inga Smith", "ReviewID": "R1G1MMPOLHF5W9", "Overall": "3.0", "Content": "I bought this tablet after seeing it being introduced on the NBC network. I ordered it the same day I saw it advertised. I wished I had gone online and read the reviews first. I was very disappointed with the camera which is one thing that is important to me on any tablet. The pictures are horrible so I dont use the camera. Everything else works fine.  I havent had any problems so far and I have had it for about 5 months and I use it everyday.  My grandkids love it for the games. I have downloaded alot of stuff from playstore no problem. I bought a memory card. It doesnt take long to use up the battery but thats ok I got the charger. I wont be purchasing another one of these for myself but I would get it for the little ones. I'm looking at the galaxy now. I wouldnt recommend the D2 if you gonna use it for more than just email and games. I need a tablet to be my everything.  But the D2 tablet still is not bad for the price I paid. The only reason I didnt give it a 4 was because of the camera. I would recommend it for someone that doesnt do a lot with a tablet.", "Title": "My 9\" D2 Pad", "Date": "September 2, 2013"}, {"Author": "Esther B. Outten", "ReviewID": "R157FEABY61BI9", "Overall": "5.0", "Content": "This tablet is great does everything a pc does and more . I gave this tablet to mystepdaughter for a birthday gift. She fell in love with it.", "Title": "Great tablet for the on the go type person who need a pc but not a laptop.", "Date": "April 6, 2013"}, {"Author": "Rome Corkern", "ReviewID": "R88DX6XHTWUMC", "Overall": "4.0", "Content": "I like it when it isnt frozen. When i want to play a game, watch a movie or even browse the internet, it takes a long time to load but plays everything in high quality and clear. Sometimes a game is slow which is really irritating.", "Title": "Android tablet", "Date": "July 18, 2013"}, {"Author": "nick zagami", "ReviewID": "R1NUC7RG67WVBA", "Overall": "5.0", "Content": "This Tablet does it all! Much better than expected when you consider the price of only 99.00.I read the reviews before i bought this and I am VERY  happy I did!  I also purchased the 2 year drop it/wet it/ break it warranty from square trade (they have great reviews also) for 19.00 because my wife is a CLUTZ!Very nice on the battery life also.. even better with the juice defender app.  A++++++++", "Title": "This is one GREAT Tablet!!", "Date": "March 16, 2013"}, {"Author": "Alexander H Yee", "ReviewID": "R3NC6PD51CHC5O", "Overall": "1.0", "Content": "Do not buy, freezes up/unresponsive display. resolution is very grainy and foggy. Do not recommend buying, spend more money for a high grade tablet.", "Title": "Unresponsive", "Date": "September 14, 2013"}, {"Author": "lisa", "ReviewID": "R2D558SQGB9KO3", "Overall": "1.0", "Content": "This tablet is very disappointing !!  It's very slow  screen unresponsive almost always  and freezes.  Very sad I wasted the 100. on it . I was going to return it but did not have the packaging it came in to do so GRRRRR !!!!  I have to report that Amizon is giving me a refund so greatful !!  :)", "Title": "What a piece of junk  !!!!", "Date": "February 3, 2014"}, {"Author": "Savannah Fleming", "ReviewID": "RU8Q1THZVSNTK", "Overall": "1.0", "Content": "There really was only one issue with the product however it was a major issue. The screen would freeze up very often, there was a glitch constantly in the bottom corner. it made it very difficult to enjoy using this product when i had to wait 10 minutes each time the screen froze up. which happened at least 4 times every time i used it.", "Title": "Dissapointed", "Date": "January 27, 2014"}, {"Author": "lora", "ReviewID": "R1E0RIHMO03RR7", "Overall": "5.0", "Content": "i love it a lil sad it didnt come with google play but other than that i am a very happy person,and the shipping was very quick and happy with it to", "Title": "looking for something new and got it", "Date": "April 11, 2013"}, {"Author": "Sharbat \"Sharbat\"", "ReviewID": "RF0MF879956IC", "Overall": "3.0", "Content": "My old ipad quit connecting to the internet a long time ago and I needed a new tablet just for that purpose. I found it in D2 9\" quad core tablet that I purchased from ShopHQ for $120. Yes, I have 6 months to pay it. I must say, that it's fast and I'm loving it. My purchase came with a free 4400mAh battery and also a keyboard/case/stand combination. I looked up an old version of D2 single core that is sold at Walmart for $99. I figured that the bundle I received was an excellent value.I'm a very responsible adult; so I won't be dropping the tablet at anytime in the future. This is worth the price for letting me watch and learn from Khan Academy. Even if that's all it would do, it would be worth $120 to me; but it does so many things! The voice search is icing on cake...and $20/month for 6 months? That's like giving up 2 movie tickets a month.Update: (sorry, this is late): I loved the D2 tablet but it froze just 2 days before the 30-day return policy ended. There was an update I needed to do, which I didn't care and didn't have time for. Someone told me to take my ipad to any Apple store to have it fixed. Surprisingly, they did and I can now connect to the Internet using my old ipad.", "Title": "D2 9\" Quad core - Update", "Date": "February 7, 2014"}, {"Author": "WILLY", "ReviewID": "R1J15Y759D9LZA", "Overall": "1.0", "Content": "I recieved the note pad and it doesn't work, when i called company they weren't any help, telling me the unit was a defect or the same as. I still don't have it working and I ddon't know what recourse i have if any. very disappointing !!!!!!!!!!!!!!", "Title": "Digital2 9-inch tablet", "Date": "May 30, 2014"}, {"Author": "Bob Connor", "ReviewID": "RQLJ81OV3UXBS", "Overall": "1.0", "Content": "Well we got the same tablet from a store for our grandson. We cant downliad anything on this tablet. It freezes up all the time. I think it was awaste of money. I wont by another tablet from amazon. Sorry", "Title": "Very disappointed", "Date": "April 17, 2014"}, {"Author": "John Ryan", "ReviewID": "R3NA07MV4YEDK8", "Overall": "1.0", "Content": "I thought I was buying a Haier 9\" tablet. Only after I purchased it did I discover that it was a different brand! I went through all the steps, specifying Haier and wound up on a 9\" tablet. After I went through all the crap to pay for it I discovered it was NOT a Haier! but some other off brand. On this internet system you can not change your mind and I am stuck with this thing. What a load of crap!", "Title": "bait and switch!", "Date": "April 17, 2014"}, {"Author": "Sadie", "ReviewID": "R1QTH4G7XR8W98", "Overall": "1.0", "Content": "It deserves no stars!  I have had it for 3 days and it's already 100% useless, and being packed up to send back for a refund.  It looks good, and the price is tempting, the screen is larger and the picture is sharp and clear -- but it's a waste of your time and money.  You don't need the frustration of the constant freezes, weak WIFI, reception interference, more freezes, reboot locks, unresponsive reboots.  I could go on, but we would be here all day.  Terrible product.  It was a gift too, so additionally awkward!!  I'm back on my little Acer tablet, it's a real champ -- it never makes me wait, never freezes up, and never lets me down!", "Title": "Don't waste your money!", "Date": "February 17, 2014"}, {"Author": "Stuart Bershtein", "ReviewID": "R156E69ZHHK4OV", "Overall": "2.0", "Content": "Very slow.  The touch screen is not responsive.  To swipe down for example, takes at least two tries.  Keyboard entry is enough to cause a aneurysm.  Keystrokes (and feedback) are ignored when the tablet is thinking about other things.  This can be for a long time.  So, typically, one types characters repeatedly thinking one's finger just glanced off the very insensitive touch panel.  When the tablet comes back to life you may have the word 'immediately' spelled with 12 m's and 6 t's.  The D2-721 (apparently no longer manufactured), an 800x600, 7\" tablet with twice the SDRAM worked so well I figured I couldn't go wrong with this tablet.  But I did and it has been returned.", "Title": "Usable - barely", "Date": "January 19, 2014"}, {"Author": "Sue Horton", "ReviewID": "R2K5AEOU9LWVG8", "Overall": "2.0", "Content": "The Home and Back functions did not work.  I did not expect that since I bought a refurbished unit instead of a used one.  I had to send it back which bummed my 8 yo old since it was her main Xmas present.  The company did respond quickly to my email and sent a return postage tag.  They also credited my account quickly.  My daughter has a new tablet now though it is black and not pink.", "Title": "Pink 9 in D2 tablet", "Date": "January 12, 2014"}, {"Author": "JB", "ReviewID": "R26TCLESM1QUK1", "Overall": "3.0", "Content": "Even thou it is a jellybean 4.1, I have a nexus 7  jellybean 4.1which is much better at triple the price. Since it is cheaper and slower, I still recommend it as a second tablet,-----JB", "Title": "Digital2", "Date": "November 16, 2013"}, {"Author": "EABFW", "ReviewID": "R34XM48F52OUVA", "Overall": "5.0", "Content": "I bought another one for my nephew with cover. He likes it since he never had a tablet.He really loves the movie.", "Title": "It's nice!", "Date": "July 31, 2013"}, {"Author": "Teacher", "ReviewID": "R3T5ODZDDUR3SI", "Overall": "5.0", "Content": "GREAT! Bought for my oldest grandson. Will possibly be looking at another one for the youngest grandson later down the road. thank you again for your promptness in delivery.", "Title": "digital2 purchase", "Date": "July 23, 2013"}, {"Author": "Dr. Ashley Waggoner-Jones", "ReviewID": "R23D44S2QJ9IIY", "Overall": "3.0", "Content": "product worked Fine. I Got what I expected from the product for the price would buy it for a friend.", "Title": "good Value For  the money", "Date": "June 24, 2013"}, {"Author": "momof20paws \"marvin's mom\"", "ReviewID": "R1R17QQQTE0AM0", "Overall": "4.0", "Content": "If I would have actually been able to use this longer I might have been able to give 5 stars. Purchased a case for it, was carrying it in from the car this morning along with a couple other things. Didn't pay much attention to how I was holding it. It slid right out the side of the case onto the sidewalk & broke!PRIOR to this, it has a nice touch to it with quick response. The screen is nice, crystal clear. The camera leaves a lot to be desired because it is controlled from the front and the lens is in the front. Hmmmmm!!!!!!NOTE:::::: Although this is an Android based product it does NOT support Google's Play Store. It has it's own Mobile Market. So far I have found every app I have looked for and when downloaded they work fine, except...... And there is always an exception!!! I downloaded the SWYPE keyboard and when I went to open it a very useful warning popped up. It told me that if I were to use that app it would access ALL info on my tablet INCLUDING any credit card info I had previously used. Deleted that app quicker than ice cream melts in Arizona sun in July!!!!!!!Would definitely recommend this tablet-----------and because of the lousy case I bought, will probably buy again!", "Title": "D2 Tablet", "Date": "March 31, 2013"}, {"Author": "Mcbenjy \"benjamin\"", "ReviewID": "R2I3LZC2LB8OLO", "Overall": "5.0", "Content": "I read all the reviews and viewed the YouTube posts regarding this 9 inch tablet from d2 and ordered it immediately.  It was not in stock and I had to wait for a few weeks until the color I wanted came in (blue). The Wi-Fi works perfectly and I have been able to find all the apps I needed on the 1 Mobile 1 Market because it doesn't have Google Play.  I removed all the kiddie apps and the 1 pre-loaded family movie with no problems. I've only had it for a week but am thoroughly pleased with this tablet; love the color; don't forget to get the 2 year warranty for just $19.99.", "Title": "great tablet", "Date": "April 20, 2013"}, {"Author": "Syreeta H", "ReviewID": "R1GST3BKZJNBE9", "Overall": "5.0", "Content": "I got this tablet for my 10 year old daughter and she absolutely loves it she's had it for less than a month and accidentally cracked the screen she was devastated but thank God I got the Square Trade warranty it took less than a week for them to process my warranty and get her a new tablet.....", "Title": "great little tablet!!", "Date": "April 1, 2013"}, {"Author": "Bob", "ReviewID": "R2PO4BTW53RI8", "Overall": "1.0", "Content": "The volume is so low, nothing can be heard.  I tried to find an update online but to no avail so it cannot be used for watching movies or listening to music.  The response is about as slow as the first computer I had in 1990, when on the internet one can take a nap between opening pages .  My wife has an Amazon Fire and I should have spent the extra money and bought one that has the speed of a 2013 tablet instead of the speed of the USPS.", "Title": "Too Slow and Quiet for a Baby Boomer", "Date": "June 8, 2013"}, {"Author": "xpdshinz", "ReviewID": "R1OHRB7LZQ76X9", "Overall": "3.0", "Content": "Everything are smooth as I expected.Functional but sluggish at times.Great for beginnersweird indian movieone thing ***NOTED**  is not 4GB internal only like 2.5g", "Title": "For the right price", "Date": "April 27, 2013"}, {"Author": "Shana Williams \"Txgamer43\"", "ReviewID": "R1V89LCRP4SY03", "Overall": "4.0", "Content": "Bought 3 of these for my family. The first 2 worked great right out of the box. The 3rd, mine, had no life. Wouldn't even boot, take a charge, nothing. Returned it and had my refund the same day UPS picked up the return. My only complaint is that the Google Play store is not an app on here but, there is 1 Mobile which is the exact same thing for your app store. My new tablet is on the way and I think it'll be just fine! Would recommend to anyone wanting a cheaper tablet just to play with.", "Title": "Great Tablet For The Buck!", "Date": "March 2, 2013"}, {"Author": "alice dittmar", "ReviewID": "R27G7AIJBF5L4A", "Overall": "4.0", "Content": "i bought this tablet for my son.... I have not seen it but I bought one similar from hsn for my grand daughter.  they just need it for e mail, face book, etc.  but it seems to work well. and the price was fabulous,  could not have bought a 9 inch for a better price.", "Title": "digital2 9 inch tablet", "Date": "September 14, 2013"}, {"Author": "Penni Rubin", "ReviewID": "R1E0LIU04UAD8E", "Overall": "3.0", "Content": "Loved the price and the size of the 9\" screen. I took back a 7\" Digi2 that was on sale somewhere else when I saw yours. I do not know much about these tablets but it has to keep being charged, (I thought they lasted a lot longer). Bought a stylus because I wanted to draw on it & cannot figure it out. Apps are not always user-friendly I found out. Downloaded drawing and games apps but they dissappeared and I have to keep getting them. Had trouble logging on with my son's wireless?? Do not know why as I can with my laptop with no problem. Wish I knew a 14 year old boy to help with these annoyances! Somehow when I plugged it into my computer, I got a virus had to figure out how to get back to original, friend did that for me. It wiped everything off that I had downloaded. Booklet is too simplified.", "Title": "android tablet", "Date": "September 10, 2013"}, {"Author": "Karen", "ReviewID": "R31DWEB9XUZPQG", "Overall": "5.0", "Content": "Awesome. Love it, love it.  Best tablet for me.  Does everything I wanted it to do. Great tablet for price.", "Title": "Great Tablet for price", "Date": "September 4, 2013"}, {"Author": "Piers Jameson", "ReviewID": "R3SW237M7XEYZP", "Overall": "3.0", "Content": "For the price, and for the intended consumer (my grandmother), this tablet is \"okay\". But I would not buy another. Very laggy, the touch screen doesn't always register (in fact, it has problems registering a touch about 10% of the time). The lack of the google play store is pretty sad, and it's all-around pretty laggy.", "Title": "It's okay for a cheap tablet", "Date": "August 10, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00BF9MTJK", "Features": null, "ImgURL": null, "Name": null}}