{"Reviews": [{"Title": "It's marginal for me + 3 week update", "Author": "J. nusser", "ReviewID": "R30MRUII1CQKS3", "Overall": "3.0", "Content": "It's between 2 stars (I don't like it) and 3 stars (it's OK).  I bought it on the strength of the NY Times story and paid about $90 including shipping for the red version. For $9.24 shipping it came UPS Ground from the west coast, in 8 days from placing the order.I've been using the Ematic for a day or so. It works; it does many things well or at least OK, but it's slow, very slow.Pluses:It's got mostly intuitive controls. It runs android apps. I like the integration with google applications and syncing with same on my other devices. It runs a Sonos app which is a big plus for us since we have it at our home.  (I tried a Samsung Chromebook; it won't run sonos as of early May 2013.)  Another plus is the Kindle app you download.  It lets me read the same books I have on a separate kindle, on ematic.  It works really well.Cons:  Slow, frustratingly slow, esp using the chrome browser.  The touch screen really lags in chrome; can be several seconds or more; especially frustrating when typing.  I wind up pressing several times and waiting.  There's no sensitivity controls for the touch screen that I can find.  I looked for them after learning the screen does not always respond to my taps. In some instances I find myself pushing on the screen rather than tapping since it appears not to respond. When typing, it frequently enters a foreign alphabet character, like an accented e or o.  I tried to see if Firefox would run faster than chrome.  I downloaded FF and got a format \"not supported\" message.  Not a surprise, but want to note that it runs android not other formats.  Screen contrast and sharpness are marginal.As others have mentioned, its not bad for having around the house as a tool to run a timer, do a quick check on mail or the net, read a book, etc.  Take it on a trip or use as a main device?  Not for me.You get what you pay for in this case. It's an inexpensive tablet. It works.  You'll probably be frustrated, as I am after only one day.  I'd suggest paying more and getting more.3 week update:May 24, 2013:  I've been using it for 3 weeks now.  I would return it if I could.  Works well as a kindle reader, Sonos controller, and some android games.  As a browser its so slow, its useless or freezes completely.  Available storage is so limited I continually get out of memory system notices. No idea how to remedy them, maybe buy a memory card? That wipes out the advantage of low price?  Won't really run other android apps like NYTimes, Wall St Journal, etc.  Just freezes.Can anyone else who bought one comment on speed, freezes, etc?  Did I get a lemon or is this just not an adequate tablet beyond the reader and sonos functions?", "Date": "May 4, 2013"}, {"Title": "Good if you use Opera Mini browser", "Author": "Customer", "ReviewID": "R1462HOZOJD8K5", "Overall": "3.0", "Content": "I just bought this Ematic tablet today.  Chrome is too slow.  \"Opera Mini\" is the fastest browser for this tablet because it condenses websites before downloading them.  You can get Opera Mini from \"Play Store\".  As long as you use Opera Mini, this tablet is worth the price.", "Date": "July 12, 2013"}, {"Title": "80 Bucks for a tablet", "Author": "Jane's Addiction", "ReviewID": "R3R0VU0KMZSXZG", "Overall": "5.0", "Content": "*****This review is orignally from NY Times*****This Tablet's Top Attraction? Its $80 Price.By ROY FURCHGOTTIf you're not sure that you need a tablet, $200 is a lot to spend just to find out. But Ematic has reduced the risk with the Genesis Prime, a 7-inch Android tablet computer that lists for $80.You get quite a lot at that price -- with an emphasis on \"at that price.\"Keeping costs down means stripping out all of the frills. The tablet does come loaded with a recent version of the Android operating system, Jellybean 4.1 (only Jellybean 4.2 is newer). That means access to all of the Google services, like Gmail, Google Play, Google Now, Chrome, Maps and YouTube, as well as the most recent versions of third-party apps.The tablet's hardware is good but entry level by current standards. For instance, the 1.1 GHz processor in the Genesis would have been top of the line a couple of years ago, but in watching streaming videos over Wi-Fi, it lagged a little.The tablet is also Wi-Fi only, so if there is no hot spot, there is no Web access. The device has limited memory, with only four gigabytes on board. But there is a slot that can take a 32 GB micro SD memory card (that will add at least $20 to the price). Ematic also includes five GB of cloud storage with the tablet.The tablet has only one physical button, the on/off switch. The rest of the controls are on the screen. That has to save a few dollars, right?The screen itself is reasonably sharp, but very small type, like that on the apps page, breaks up a bit. And the screen has a subtle blue tint, which you probably won't notice watching movies but which is apparent on print pages with white backgrounds.The only camera is a front-facing VGA, so this is not the first choice for photo buffs. And the speaker is particularly anemic, although when using headphones the sound quality was good.Battery life isn't stellar, with the manufacturer estimating a 4.5-hour play time.It would be easy to write off this tablet based on the specifications, but don't forget the one spec that really sets it apart-- the $80 price", "Date": "April 22, 2013"}, {"Title": "$80 tablet, mixed feelings", "Author": "Jake Jacobs \"DiscDirect\"", "ReviewID": "R1TPUQPBER2HXA", "Overall": "3.0", "Content": "I have not had a tablet before.  Never even used one.  Had decided to buy the iPad mini when I saw the product announcement for this.  For $80, I decided to chance it.  I've now had it about 18 days.  It works.  It's small, it's lightweight.  Oh, also it's quite elegant looking.I've watched a bit of video on it on YouTube & Netflix. It looks good to me. Typing on the tiny keyboard is awkward @ best, but I imagine the iPad mini's keyboard would be as much of a challenge.  Instruction manual is VERY brief, & I wish there was more to it. In order to use Netflix, you need to download an application, but can't do so fr. N-flix site, must get the app fr. Google store (free). I've read e-mails, but can't figure out how to search my e-mails for a particular 1 (I can do this on my desktop), nor have I figured out how to send e-mails (this too, I can do on my desktop - I'm not a total moron). On YouTube I have twice found the search function for the site, but it isn't intuitive & I'm still not sure how to find it again. Also, the 2nd (last) time I found the search function, & entered my search item, nothing happened, so WTF?  &, of course, I don't know if these problems would be any different on any other tablet, @ least 1 w/a screen this small (7 inch, I think).  Sound from the speaker is very tinny, but seems quite good w/ear buds.The very first thing you're supposed to do when you turn it on, is connect it to your desktop in order to load device drivers.  I did, but no device drivers loaded.  A week later, I found out how to bring it back to factory settings, so I could try again.  Same thing - no device drivers.  My desktop doesn't recognize my tablet so I can't move files - I suppose this could be because I use Windows XP - but there's no way to know.I was alerted that there is a software upgrade available. I downloaded it, but the download didn't complete, & now I can't find it again.  Grrrrrr.I've gone to the ematic website from my desktop. Documentation that came with the tablet directed me to their site and a section of FAQ.  There aren't any FAQ.  There is a search function.  No matter what you enter, it returns an answer that nothing was found and directs you to submit a question, but the form for the questions refers to another company, not Ematic, and is for submitting warrantee claims for broken parts.  Their website says they'll reply w/in 24 hours.  They don't reply at all.For $80, vs. maybe $400 plus, it was worth the experiment, I think.  Again, I'm a novice @ this, so I may be missing all sorts of issues.  However, knowing what I know now, I'd spend more money and hope for a better tablet.", "Date": "May 12, 2013"}, {"Title": "awful tablet", "Author": "BLee", "ReviewID": "R3OTA0393G13LH", "Overall": "1.0", "Content": "this tablet is virtually useless for browsing: incredibly slow and ceases to work altogether often. the display is poor, and there is very limited memory for apps: although there is a slot for cd card, the memory can only be used for data and not for apps. the only thing the tablet is good for is for playing mp3 music, and barely adequate for reading ebooks.I regret purchasing this product, and strongly recommend anyone to avoid it at all cost. Use the money to buy an ebook reader, e.g. KIndle, instead.", "Date": "June 25, 2013"}, {"Title": "Children love it!", "Author": "D. Aldridge", "ReviewID": "RQTMERN0VHUFW", "Overall": "4.0", "Content": "I bought two of these tablets for my sons ages 6 & 9 and they love them. Works great and because my children love downloading games, I would suggest purchasing additional memory. It loads and charges quickly (good for impatient children :)), and the battery life is good as well. Chrome is installed but I'd recommended downloading Opera Mini because Chrome is very slow. Overall it is a good tablet especially for the price and we love it!", "Date": "November 8, 2013"}, {"Title": "Too slow for my use.", "Author": "Tired", "ReviewID": "R3A7E8RR9DAQCL", "Overall": "2.0", "Content": "Tested it side by side with my laptop and Note 2. Much slower than either. Plan was to use it in office with EMR. Gave it away", "Date": "June 2, 2013"}, {"Title": "Very Slow and buggy", "Author": "Ariel", "ReviewID": "RHLRGGGTF9AOA", "Overall": "1.0", "Content": "Got this tablet for my mom,  I guess you get what you pay for.the build on the tablet is good,  but it is very slow and buggy.facebook would close itself. most apps would run very slowly.I recommend you save some money and buy a kindle HD or a Nexus 7", "Date": "June 4, 2013"}, {"Title": "Can't Beat For The Price!", "Author": "CAJ", "ReviewID": "R35TZSIWLBJ5XA", "Overall": "5.0", "Content": "Again for the price you can't beat it -$79.99.  No it doesn't have the screen resolution of higher priced tablets but its quite adequate and no it isn't as fast and smooth as higher priced ones, but adequate..  It runs all or most apps on Google Play.  It has a 7\" screen and small casing overall - perfect for home and travel. We mostly used it for games like 'words with friends' card games and wifi control apps for household functions.  It also has what most higher priced tablets don't - a micro SD slot that can increase your storage up to 32 GB.  Internet access is very good using Chrome or native browser.  Earphones - yes.", "Date": "May 3, 2013"}, {"Title": "Very Nice", "Author": "Wonder as I Wander \"just wandering\"", "ReviewID": "R11CFY3RLXM4AD", "Overall": "5.0", "Content": "Brought this for the little one so she could stop using the adults more expensive ipad and kindle, however I fell in love with this easy to use and very fast tablet.  It one upped the kindle with a front facing camera and google talk.  Very nice buy for the money.", "Date": "June 30, 2013"}, {"Title": "kid friendly", "Author": "Hall901", "ReviewID": "R1IQYRYID3GN", "Overall": "5.0", "Content": "I bought this for a 6 year old boy.  it is has survived a few drops already. Very happy with this purchase", "Date": "June 21, 2013"}, {"Title": "Fault advertising.", "Author": "Tainu Nguyen", "ReviewID": "RE24HCUHUVJVH", "Overall": "2.0", "Content": "Slow to a halt, doesn't do and perform like a tablet. Like to return it if possible, it's a rip off.", "Date": "May 27, 2013"}, {"Title": "Cool tablet", "Author": "Russell Stahlke", "ReviewID": "R21OYVXA5G86OB", "Overall": "5.0", "Content": "For the price, this is a quality tablet.  Apps run fine and so do movies.  Of course it is not as fast as a more expensive tablet, but it gets the job done.", "Date": "March 16, 2014"}, {"Title": "Great grandchild's Gift", "Author": "peggy Daniel", "ReviewID": "R2F08PC37AZPCM", "Overall": "5.0", "Content": "This put a smile on my great grand daughters face and now we cant get her to stop playing with it she loves this and so do i", "Date": "September 26, 2013"}, {"Title": "Genesis 7\" Tablet", "Author": "nadene", "ReviewID": "RWVQSGYFV7RLH", "Overall": "3.0", "Content": "I bought two of this product a little over a week ago for my children and so far I have not seen much problem with them. The memory is limited though and sometimes the tablet does not respond to the touch; we have to jab at the screen sometimes for it to respond.", "Date": "September 20, 2013"}, {"Title": "I want new headphones and a car charger", "Author": "Leslie Jones McCloud", "ReviewID": "R1SAXX2ROIBTH0", "Overall": "3.0", "Content": "This tablet is decent for the money. I purchased my tablet at Walmart for $59 and at first I could not download the Instagram app on it. I even wrote the developer. Then I figured out how to do it.Go here: [...]Anyway, the memory filled up quickly, even after moving many apps to the sd card (internal). I thought I was putting the apps on the external sd mini card but I don't know how to get them over there and the instructions that came with this product are bare bones. Not big on customer support, I guess. I can listen to sounds easier while falling asleep,I can take this in the kitchen with me for cooking and watching ON Demand videos and cooking vids so it is handy for the $$. I have not had it long but it is useful.", "Date": "September 11, 2013"}, {"Title": "GREAT PRODUCT", "Author": "ROBERT E. DUNCAN", "ReviewID": "R379X711RW03FN", "Overall": "5.0", "Content": "I HAVE USED THIS PRODUCT FOR OVER 3 WEEKS AND I AM COMPLETELY SATIFIED. HAS A NUMBER OF GREAT FEATURES AND IS VERY PORTABLE. THERE ARE SOME APPS OUT THERE WHICH WILL NOT WORK WITH UNIT BUT MAY WORK IN FUTURE ONCE THE THE APPS ARE FURTHER DEVELOPED. I ALSO LIKE IT'S EXPANDABLE SD MEMORY CAPABILITY. THE PRICE IS RIGHT AND I'M THINKING OF PURCHASING ANOTHER UNIT VERY SOON.", "Date": "August 13, 2013"}, {"Title": "Wonderful Tablet!", "Author": "Nema", "ReviewID": "R2D8L3Z8OFWPZ7", "Overall": "5.0", "Content": "This Tablet is easy to learn and the ease of finding what you need to know is wonderful! I would recommened this Tablet to anyone who wants a great Tablet!", "Date": "August 12, 2013"}, {"Title": "I LIKE IT", "Author": "Olatunde Stephen", "ReviewID": "R1WR30NRUJNNBJ", "Overall": "4.0", "Content": "I USE IT TO LISTEN TO MUSICLISTEN TO GOSPEL.... PREACHING FROM TBNTHOUGH.. I WILL UPGRADE IT SOON ....", "Date": "August 7, 2013"}, {"Title": "Nice", "Author": "D. Andrew Gelsinger", "ReviewID": "R24JTXD8LRWK7T", "Overall": "4.0", "Content": "A great kids tablet.  A little slow and clunky sometimes - but for the price, you can't beat it!  Pretty tough too!  This thing has taken a beating from an almost 2 year old, and still keeps ticking!", "Date": "July 20, 2013"}, {"Title": "Great for beginners", "Author": "Nancy L \"nll\"", "ReviewID": "RF86PEG085DFX", "Overall": "4.0", "Content": "I am a senior citizen interested in keeping up with technology. This tablet has been user friendly and not difficult to learn its operation. I would recommend to other seniors, ie beginners and tech challenged.", "Date": "June 9, 2013"}, {"Title": "Don't waste your money on this. It is not worth it.", "Author": "Rufus", "ReviewID": "R2U0VZLJ7IWZWW", "Overall": "1.0", "Content": "I want to start by saying that I almost never post reviews of products but this time I had to. I bought 3 of these items because they are inexpensive and I thought it would be a good way to evaluate if I wanted to venture into buying tablets for me and my two children. I have waited a while to post this to try and decide if I was being to critical of the product or if it was just that bad. After a lot of thinking, it is just that bad.The only positive thing I can say about this product is it is cheap. After that there is a long list of negatives.Out of the box it just feels cheap and like it could break at any second. After powering it on you want to make the screen brighter but realize quickly that the brightness is already turned all the way up. After that comes the realization that the display looks grainy and distorted, it is actually very hard to read almost anything. The touchscreen is horrible! It is at times over sensitive or under sensitive even with the same amount of pressure applied each time and will register touches a fingertip below where you touch it and you end with things you never meant to open opening or things not opening at all. The RAM for it is so small that after receiving it and updating Google services, you cannot add any apps to the tablet that cant be moved to the SD card right away. Even if you remove some of the Google required apps that cant be moved to the SD card they get downloaded again the next time you need an update. So it is slow, very slow and a lot of apps hang up when you try to open them.Then on one of them the mini USB port came detached from the motherboard when simply removing the power cord. Now I am stuck with one useless tablet and two that are in the word of my children.. Horrible. In fact on of my children refuses to even try to play games on his because he gets so frustrated by how poor it performs. I am trying to work with Ematic to return the broken one and possibly return the other two since they are so dysfunctional. I will update this as info come available but please save your money or invest a few more dollars in a better tablet.", "Date": "October 10, 2013"}, {"Title": "Love it!", "Author": "Z.Dobson", "ReviewID": "R7JRTHXKM7K9U", "Overall": "4.0", "Content": "\"Ematic Product Review\" This tablet is impressive for 50$ it does everything that was promised, all the bad reviews are incorrect I haven't experienced none of the problems people had listed.The sound quality is perfect, with Google chrome provided web browser I can easily access any website.I highly recommend this tablet for busy people,Its affordable and enjoyable!", "Date": "September 6, 2013"}, {"Title": "Bad", "Author": "Amazon Customer", "ReviewID": "R1GSK35YU53HXX", "Overall": "1.0", "Content": "only able to install 4 apps before the 512mb is full and sd card is useless cannot add to it. a child would not like this.", "Date": "May 18, 2013"}, {"Title": "i love", "Author": "jose luis guerrero", "ReviewID": "R3CF8H8PLJ7DYN", "Overall": "5.0", "Content": "all right, I'm satisfied with the product, I recommend it, do not hesitate to buy this product, the best I've bought this seaso", "Date": "May 25, 2014"}, {"Title": "kids only", "Author": "Uncle Charlie", "ReviewID": "RPGATGT3KCSHD", "Overall": "2.0", "Content": "This is a 'starter' unit- strictly entry-level stuff.  Very, very slow to respond to touch, internet use, etc.  Good for someone just learning keyboard basics and general move-around on a tablet.  Sometimes, the screen does not respond at all to touch.  But, this is the exception.  Not recommended for experienced users who are accustomed to speed, functionality.", "Date": "April 8, 2014"}, {"Title": "Oh well", "Author": "Farley Philogene", "ReviewID": "R3BZ2OUJN88AW3", "Overall": "2.0", "Content": "Three days in the power button stopped working. It has to be turned on by plugging it into the charger.", "Date": "April 8, 2014"}, {"Title": "7\" Google Play Android 4.1 Ematic Genesis Prime 4GB HD Multimedia Tablet w/ WiFi", "Author": "Michael Perrone", "ReviewID": "R1MICSJGB2EQLS", "Overall": "3.0", "Content": "Have used this item, seems to be okay, bought it to get used to using a tablet. Since I don't own another tablet, can't give a comparison or rating. It's okay for a beginner!", "Date": "April 7, 2014"}, {"Title": "Works good for the price", "Author": "Peggy A Mosorjak", "ReviewID": "RY5I4WD4S6DEE", "Overall": "4.0", "Content": "I was looking for an inexpensive tablet for music, games and some quick browsing & email. Works really good for the price. I've used other inexpensive tablets and this one is better than most. It comes with Google play which is a big plus. Of course its a bit slow and doesn't have a lot of storage, but for $60 it does everything a friend's $200 tablet does just a bit slower. I would recommend this for someone that is looking for an inexpensive tablet and doesn't mind it being a bit sluggish. If you're looking for something to run like an ipad, save your money, but for the price, this tablet does the job.", "Date": "March 31, 2014"}, {"Title": "R.I.P.", "Author": "Beth", "ReviewID": "R364K7MFHV2Z2G", "Overall": "1.0", "Content": "The usb charging port wouldn't make a connection and then it fell out. It was only a day old when it died :(", "Date": "March 25, 2014"}, {"Title": "ematic product review", "Author": "gary phelps", "ReviewID": "R38HD1M5DF2YE9", "Overall": "5.0", "Content": "just the right sizecolor selection very cool i have the red one EGS004-RDI HAVE 11 FRIENDS PICKING ONE UP", "Date": "March 21, 2014"}, {"Title": "Did the job, but broke quickly", "Author": "Desiree", "ReviewID": "R2TZ22ZDWD8RMZ", "Overall": "3.0", "Content": "Not very sturdy. Should have known, due to the cheap price I bought it at. It is a decent tablet for beginners and basic users. Not the best made though, and I would recommend spending the extra dime on a sturdier tablet that can handle some roughhousing", "Date": "March 12, 2014"}, {"Title": "one of them doesnt charge their battery", "Author": "Costa rican buyer", "ReviewID": "R2OM3ZN83N0TFL", "Overall": "3.0", "Content": "Hey i liked them but i wish you could help me because one of them doesnt charge their battery so", "Date": "February 27, 2014"}, {"Title": "Not the deal it appears to be", "Author": "Amazon Customer", "ReviewID": "R2F7T4IN3DEO9D", "Overall": "1.0", "Content": "My children (13, 9, 6) each received one of these for Christmas.  The older two already had Kindle Fires.  After trying it once, they put them down and have not touched them since, even when they can't find their Fires.  My youngest will pick it up once in a while, but quickly gets frustrated and puts it down.  The response is slow and programs regularly freeze up (multiple times an hour).  I would not recommend this to anyone.  Save up and buy a better tablet.", "Date": "February 24, 2014"}, {"Title": "Useless piece of garbage", "Author": "Todd M Pearson \"Nascar24\"", "ReviewID": "R17MD4H3CRWKC3", "Overall": "1.0", "Content": "Very slow and lots of Google play apps that won't work with it. Plus, if you forget your password, you have to pay $10 and send it back to them so they can reflash the firmware which means it goes back to factory and then they ship it back to you. Not worth the trouble or spending the money for this junkie thing.", "Date": "February 19, 2014"}, {"Title": "works good thus far", "Author": "Nigel", "ReviewID": "R8L7K4FIDTVDL", "Overall": "4.0", "Content": "Thus far this item seems to be working quite well. apps run good, and it responds well for a tablet with this specification. great for a kid.", "Date": "February 14, 2014"}, {"Title": "i need my money back this tablet cant be charged", "Author": "claire fray", "ReviewID": "R12S09AKSTPTEE", "Overall": "1.0", "Content": "the battery of this tablet do not work i cant charged or even turn on the poweri need my money backim stil waiting for your answer", "Date": "February 12, 2014"}, {"Title": "Nice tablet", "Author": "Xstitcher", "ReviewID": "R3AVRRP7VBLT0C", "Overall": "5.0", "Content": "It was a gift for someone and was very nice.  Only problems were user problems that were overcome with practice.", "Date": "January 26, 2014"}, {"Title": "Great price ....too slow to function properly.", "Author": "Cindy Satterlee", "ReviewID": "RNGDV9AL1Y3RS", "Overall": "3.0", "Content": "This tablet is really meant for children and game playing. For the more advanced user this tablet is frustratingly slow and the main reason I bought the Kindle Fire HDX.", "Date": "January 19, 2014"}, {"Title": "Fun Little Tablet", "Author": "Amazon Customer", "ReviewID": "RHTPZ12GI2GD7", "Overall": "4.0", "Content": "This 4G tablet has all the bells and whistles for an inexpensive tablet.  I was able to set it up easily and it synced just fine with all my other devices.  It's a little slow when you have a lot downloaded so be sure to use cloud or external storage.  Otherwise, I like it alot.  Great for taking along to the coffee shop for reading or watching movies.", "Date": "January 18, 2014"}, {"Title": "Fills a need", "Author": "KipOc", "ReviewID": "R18UHYXE59SCB1", "Overall": "4.0", "Content": "I needed a tablet that could access the Playstore, this fit the bill.  I have had it mounted on a wall in a factory running a time-clock app for a couple of months. It is powered on 24 hrs, 7 days a week.  I have never had a problem with it, never had to restart it.  Granted, it's only running a single app.  It is SLOW so regular users may be frustrated by that.", "Date": "June 6, 2013"}, {"Title": "Poor design", "Author": "R.AZARUDEEN", "ReviewID": "R24RYI3HGE6RFO", "Overall": "1.0", "Content": "There is no way to connect the internet other than the wifi, i dislike this item.No camera on both sides..No GSM facilityNo mobile networks facility.Only one port available.Headset was not desirable.", "Date": "January 27, 2014"}, {"Title": "Poorly manufactured, 3 units, 3 different problems", "Author": "Peter D. White \"pedrobot\"", "ReviewID": "R1ZQ977CEAC1W1", "Overall": "1.0", "Content": "I ordered 2 of these for my sons for Christmas.  Right out of the box, one wouldn't turn on - the on/off button was broken.  Sent it back for a replacement.  Replacement unit arrived, and its charger was broken.  Attempted to charge unit using the charger from the other one, but it would only operate if plugged into the wall - the battery wouldn't hold a charge at all.  The other one would only intermittently connect to my home wi-fi (all my other devices work great).  To have 3 different manufacturing problems on 3 different units is a real concern.  In the brief time that I did have one of these things working, I found the performance to be iffy, and the lack of storage space appalling.  You cannot install apps on an installed SD card on this device, so ultimately you have less than 2 GB total for downloaded apps.  I returned all of them, and will try another product.", "Date": "December 26, 2013"}, {"Title": "Does not work within 2 hours of running", "Author": "Courtney Mixer", "ReviewID": "R3BDO7IM4GA927", "Overall": "1.0", "Content": "Website for product does not reply, no FAQ section, even though it states they do. Can not download ANY apps and can not restart the system. The cheapest tablet I have ever seen. DOES NOT WORK. Keeps saying Android processing fails.  Just ordered the kindle at this point and hope it actually works! You will be disappointed if you order this, the processor/software is flawed from the get go!", "Date": "December 25, 2013"}, {"Title": "You get what you pay for.", "Author": "al", "ReviewID": "R2NMOY41MC8Q9K", "Overall": "2.0", "Content": "I bought this as a backup to my wife's Kindle when she had to send in her Kindle for repairs. This thing is pretty slow. I wasn't expecting much after doing all the research on it, and I wasn't disappointed. But if you are expecting something useful as a tablet, you may regret the purchase. Not a lot of internal storage and not a lot of speed. It can barely run Pandora which is the secondary purpose I got it for. As an e-reader, it gets the job done.Would have given it 3 stars but the battery does not hold a charge for a long time when not in use. This may or may not be specific to my device. If you are looking for a cheap 7 inch tablet under $100, I would suggest spending a little more on a refurbished name-brand tablet.", "Date": "December 8, 2013"}, {"Title": "Don't do it.", "Author": "Megan", "ReviewID": "R1E6CFD7CGUBLA", "Overall": "2.0", "Content": "This tablet works as expected for the price. My personal one's touch screen is delayed and hard to touch, the memory is small, and apps generally run slow. The other one that was purchased does not work at all anymore. It worked the same as mine for a week, then it stopped charging and the same day that it stopped charging the charging port fell completely out when the charger was unplugged. I probably would not order again.", "Date": "November 24, 2013"}, {"Title": "two months....", "Author": "Dave", "ReviewID": "R34LQH286KDD7L", "Overall": "1.0", "Content": "About the end of first month it stopped charging regularly. At the end of the second month it wont charge at all anymore. It was a bad purchase.", "Date": "October 31, 2013"}, {"Title": "$59.99 at Walmart website", "Author": "Amazon Customer \"Treat the people around you ...", "ReviewID": "RDPQCFATHJ52D", "Overall": "3.0", "Content": "I've got the 'priceblink' app on my browser & whenI looked at this page 'priceblink' popped up to notify me that this is $60 at Walmart- I hope that helps you", "Date": "October 12, 2013"}, {"Title": "Good for kids", "Author": "Sassy Mama", "ReviewID": "R5LOXDVBW55KA", "Overall": "4.0", "Content": "Bought it for my 6 yr old who broke his first tablet. This one seems to be a bit more 'kid-proof'. The price is GREAT. Includes everything a kid needs in a tablet.", "Date": "May 15, 2013"}, {"Title": "Not Worth The Money!", "Author": "Tee B", "ReviewID": "R1TLDCLXSAMYXU", "Overall": "1.0", "Content": "I ordered this tablet for my niece's birthday.  After reading some of the negative reviews, I decided to give it a chance anyway.  I ordered it a month in advance of her birthday in order to test it to make sure it worked properly.  At first, it worked OK.  It was kinda slow, but I expected as much based on the cost.  After a playing with it a few days and testing the battery, the charge port fell out.  It still had some battery life when this happened, but now the device will not even come on.  I am disappointed because I don't want to spend a large sum of money on a table for a 10 year old, but I had to return this item.", "Date": "October 7, 2013"}, {"Title": "Very disappointed", "Author": "Amazon Customer \"akoblin\"", "ReviewID": "R1114D6I2UN9ZO", "Overall": "1.0", "Content": "Even though I had low expectations for this tablet, I was surprised to find it was much worse than i thought.  Save your money - spend another $50 and buy a better tablet.This is virtually unusable", "Date": "August 27, 2013"}, {"Title": "Ematic Genesis Prime Tablet", "Author": "Anna Banana", "ReviewID": "R3SVVGJAUA5KS1", "Overall": "5.0", "Content": "This was a gift for someone who is constantly on the move.  When he's home, he uses his desktop computer, but he needed something more portable.  The price was great.  I hope to see it soon and see how it compares with my pricier tablet.", "Date": "June 7, 2013"}, {"Title": "Meets all expectations.", "Author": "John Dillender", "ReviewID": "R1T5F5XW1O2IJ2", "Overall": "4.0", "Content": "Not perfect, but would buy again and recommend to friends.  Especially good value for kid use; price vs breakage/loss is worth the risk.", "Date": "May 30, 2013"}, {"Title": "Wait!!", "Author": "Mike", "ReviewID": "R147Y68H6HVVUC", "Overall": "1.0", "Content": "The restrictions on it's use are such that I should have waited until I could afford an ipad or amini.", "Date": "November 19, 2013"}, {"Title": "A good low-cost tablet", "Author": "aka10003", "ReviewID": "R2U38E2J0GWG8L", "Overall": "4.0", "Content": "This is a good tablet for $80 -- it comes in fun colors (mine is red), and it does the job. It does feel a bit slower than I would like, but then again, hello, it is low-cost.I ultimately bought this as a TV companion -- a way to keep up with the programs I watch. This tablet is mostly doing the job. At times I still have to rely on a laptop as some links are problematic, but less so than in my smartphone. But I am also assuming that some of these issues will happen in premium tablets.All in all -- a good purchase.", "Date": "May 18, 2013"}, {"Title": "bad deal.", "Author": "bilal khan", "ReviewID": "R1FSGG811B82H1", "Overall": "1.0", "Content": "it doesn't work and i don't know how to return it. don't trust any non brand name tablets. i don't like it", "Date": "November 5, 2013"}, {"Title": "meh!!", "Author": "nateddog", "ReviewID": "R2Y3T15E92A6FV", "Overall": "2.0", "Content": "this is NOT 4gb mine says 1.29gb internal storage. is slow to function. ONE camera for a new tablet thats pretty pathetic", "Date": "May 13, 2013"}, {"Title": "Specs are mixed up", "Author": "Monty Shaw", "ReviewID": "R37BBXY0MNORA0", "Overall": "3.0", "Content": "The product features show that this is has an A4 processor and then the technical details that it is an Intel Core Duo? What?Also no mention of capacitive vs resistive touch technology.Features show 4G flash, tech details says 8G drive. I think it just has 4GAlso CNet says this has a SD slot for up to 32G additional flash.Finally there is no other way for me to report issues with an Amazon product listing other than this. Come on Amazon.", "Date": "April 3, 2013"}], "ProductInfo": {"Price": "$105.46", "Features": "Android 4.1 Jelly Bean, 7.0 inches Display\n1.1 GHz ARMv7\n4 GB Flash Memory, 0.5 GB RAM Memory\n4.5-hour battery life, 0.6 pounds", "Name": "Ematic EGS004-BU 7.0-Inch 4GB Genesis Prime MultiTouch Tablet (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41SG5UWt67L._SY300_.jpg", "ProductID": "B00BMJJ73O"}}