{"Reviews": [{"Author": "hotwormal", "ReviewID": "R20OWP65JTDVC0", "Overall": "2.0", "Content": "i thought i got a great buy on this tablet, but really i just gave those people my hard earned money. i would find when this tablet would get HOT, it started acting weird. this company does not have a web site that you can contact for support. i am still very upset with this product. if you buy this item, GOOD LUCK. mine does not work after 3 months.", "Title": "great look, but don't be fooled.", "Date": "August 11, 2013"}, {"Author": "Sondra L. Brown", "ReviewID": "R3I0NNUA8YGFSL", "Overall": "5.0", "Content": "It does everything I expected it to do. I did need to buy a cover for it, because it was to slippery to hang onto with out it.", "Title": "My tablet", "Date": "April 2, 2014"}, {"Author": "Lowell Kaps", "ReviewID": "R32L613Q1SRV4A", "Overall": "5.0", "Content": "I am using this table as a bathroom TV with my cable companies application. It is working great. I was surprised how good this tablet is for the price.The video looks excellent and there isn't any pausing or drop out problems.The only drawback is the sound is not very loud. I needed a cradle to hold it up anyway so I got one with built in blue tooth speakers and it now sounds great too.", "Title": "Great Tablet and a good value", "Date": "February 27, 2014"}, {"Author": "Robert Kimmel", "ReviewID": "R3O24X792S6GE3", "Overall": "4.0", "Content": "Okay, I bought this tablet for 1 reason.  And that is to read comic books on it.  I wanted a big screen (10+ inches) with a decent resolution.  This tablet had both.  10.1\" screen at 1200x800.The only thing that is bad about this tablet to me is it's battery.  I barely do between 1 & 2 hours on a charge, and while it does seem to last awhile between charges without being used, it's going to only last an hour or so when you do use it.  My plan is to buy a decent battery for it, since it's obvious they used whatever cheap ones they could get.Doesn't get too hot, haven't had any problems in the week I've used it.  At worse it's a little heavy, but I've only used a friends Nook HD+, so I don't have much to compare to.If you are looking for a tablet you can travel with, then keep looking, this isn't for you.  That might change when I get a new battery and I'll update my review with that info.", "Title": "Decent Tablet, Nice screen, responsive.  Battery blows.", "Date": "February 25, 2014"}, {"Author": "V Peck", "ReviewID": "R34JD4LUQA7TFT", "Overall": "2.0", "Content": "This is a really good tablet and does everything you would expect.Lots of features and ports but...four tablets on and the thing wont charge. This must be a design fault with the product. The inlet power slides back into the tablet and prevents the charger from getting a grip.The supplier has been great and return a new product every time but I'm having to pay for the shipping cost.Shame as this is a good product.", "Title": "Fails to charge", "Date": "February 23, 2014"}, {"Author": "LeRoy Sallee", "ReviewID": "R3F4LH6VIOHCU2", "Overall": "1.0", "Content": "this pad was terrible,could not down load any apps. the battery stay low , even while charging..would never recommend this item.", "Title": "Kocase M M1070 10.1 inch 8 GB tablet", "Date": "February 9, 2014"}], "ProductInfo": {"Price": "$199.99", "ProductID": "B00B4PK0X2", "Features": "Android 4.1 Jelly Bean, 10.1 inches Display\nA4 1.6 GHz (1024 MB Cache)\n8 GB Flash Memory, 8 GB RAM Memory\n6-hour battery life, 3 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/51SoXzWnO2L._SX300_.jpg", "Name": "Kocaso M M1070 10.1-Inch 8 GB Tablet"}}