{"Reviews": [{"Title": "Power To THe PiPo!", "Author": "Old Gregg \"RT\"", "ReviewID": "R1DG0PF46ODC1G", "Overall": "4.0", "Content": "I've had this now for several weeks and I am very pleased with the PiPo M8. It exceeds my expectations in every way. I highly recommend this to anyone looking for a cheap but quality tablet. Here are my impressions of the PiPo M8:First, I am not a techno-geek. I use this mainly for surfing the internet and some light game playing. As far as the specs are concerned for the tablet, they don't mean much to me. I also realized going into this purchase that it was not a  high-end $600 tablet like an iPad or Samsung. I've seen reviews where people compare the PiPo to an iPad. To me that's like comparing a Ford Focus to a Lincoln Continental. Kinda stupid in a way. If you are thinking of buying an M8 and expect the performance of a Samsung you will be disappointed. Spend the extra $$$ and get the iPad/Galaxy.Looks: The M8 is very sharp looking. The build quality is very good. No rough edges or gaps. The speakers on thge front are also good and have good placement. Why doesn't everyone put the speakers on the front?Internet reception is very good. I'm usually about 40 feet or so from the wireless router and have had no issues with reception.Screen: The screen is very bright and easy to read.Speed: The M8 does everything pretty fast. Runs my Chicken Invaders HD without a hitch. Streams Netflix without having to buffer. Surfs the internet fast enough for me.Battery life: Probably pretty typical for a tablet. I installed a battery manager on it wich I'm sure extends the life a bit.Purchase: It took a couple of weeks to get it. Ordered through Yosimite Sam?, good communication and service with him. PiPo came in two boxes and in good shape. No problems.All in all I'm very happy with my PiPo. It's not a Galaxy Tab, so don't expect it to perform like one and you will be happy and $400 better off!", "Date": "June 10, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B1481DW"}}