{"Reviews": [{"Author": "Ruby J. Scott", "ReviewID": "R3196WBB6BOTB0", "Overall": "5.0", "Content": "I'm a new tablet user. Tried Kindle Fire HD 2013($139) & returned it due to constant buffering during YouTube videos & Netflix.  Tried Asus Memo Pad HD 7 inch ME-173X ($150), but it would not play the picture on Netflix videos - only the sound. Purchased this Asus Memo Pad 7 inch ME-172V ($100) for my grand-daughter.  It works as advertised. Easy to set up. No problem connecting to the internet. Loads and plays Netflix videos with no buffering. The picture isn't as pretty as the Kindle Fire HD, but at least there is a movie to watch and the picture is good. The back of the tablet is very pretty and the on/off switch and volume button are much easier to see and use than those on the Kindle Fire. Easy to load and read Kindle books on it and to listen to Amazon MP3 music. And I ordered a case for it for less than $15.  I ordered one for myself too.  Sometimes the newest products are not the best.", "Title": "Wonderful Tablet", "Date": "October 21, 2013"}, {"Author": "Dede Richard \"FanOf30Years\"", "ReviewID": "RHW2UBFETCJL4", "Overall": "5.0", "Content": "Great price on a great little tablet.  I haven't really played with any other tablets to be able to compare, but so far, I love my tablet.  It is a convenient size, and the graphics are Samsung quality.  Haven't found anything I can't do on it yet.  Gave one as a gift...they love it too!", "Title": "I was very excited to receive this tablet", "Date": "October 21, 2013"}, {"Author": "luis hernandez", "ReviewID": "RT6D1ZI7MT3O9", "Overall": "5.0", "Content": "muy buena y degran calidad un vendedor rapido bueno y efectivo grac5.0 out of 5 stars Excelent TabletI love this tablet, it has everything you want is in here for a great price. An excelent tablet for daly uses,ias", "Title": "very very 5.0 out of 5 stars Excelent Tablet I love this tablet, it has everything you want is in here for a great price. Angood", "Date": "October 6, 2013"}, {"Author": "J Connor", "ReviewID": "R2KTN5G0K5YW7N", "Overall": "4.0", "Content": "first one lasted 2 days and would not charge or turn on without the charger plugged in .....amazon shipped a replacment with one day shipping and it works perfect we have used it daily for over a month now with no problems", "Title": "first on was bad", "Date": "September 14, 2013"}, {"Author": "Jolene Kendry \"Author of The Princess and the...", "ReviewID": "RQFRTQQ9ULLML", "Overall": "5.0", "Content": "I bought this for my daughter for homeschooling. We went with the Asus rather than an off brand because I have the Nexus 7 and love it, and this is basically an economy version of the Nexus. This tablet may not have the highest specs, but it's a fantastic first tablet for kids. She runs a dozen educational apps and games and it has no trouble. The price is right, too. We also picked up the warranty from SquareTrade, and some discount accessories. For around $150 and $20 in apps she has tools to teach her spelling, math, science, music and foreign languages for the next two years at least. A definite bargain.", "Title": "Wonderful starter tablet", "Date": "September 11, 2013"}, {"Author": "Mara", "ReviewID": "R1I0F8CON8Q8FA", "Overall": "4.0", "Content": "I am not too technology oriented so this tablet is just fine for my needs. I have bought three, one for me and two for friends who are just as technology shy as I am. Can't beat the price.", "Title": "Basic", "Date": "September 8, 2013"}, {"Author": "Captain Caveman", "ReviewID": "RT43LRFOLRXS9", "Overall": "5.0", "Content": "Great product for the price. I was a little worried that it would be have a ton of problems at this price point but its fast and not buggy at all. Everyone should get one.", "Title": "Great deal", "Date": "September 7, 2013"}, {"Author": "Sherri", "ReviewID": "R1FH74PA5UI7CY", "Overall": "5.0", "Content": "Was everything we hoped it would be - my granddaughter never put it downVery Satisfied - Would highly recommend", "Title": "Excellent", "Date": "September 5, 2013"}, {"Author": "Karla Armendariz", "ReviewID": "R3AA5UMUPLTR9S", "Overall": "5.0", "Content": "This handy lil guy is not only affordable but the images are crisp, the functionality rocks, and sound is superb for a little tablet. The only complaint i have is not in the hardware but in the lack of apps available for this device. It's limited due to programmers writing these apps it is no fault of asus.", "Title": "Good Bang for your buck", "Date": "September 1, 2013"}, {"Author": "Amazon Customer \"Dad in NJ\"", "ReviewID": "RXJ0GGDLIG11O", "Overall": "5.0", "Content": "I bought this for my son as we were about to go on a two week vacation.  Setup was easy we were on our way.So what is good about the tablet.  First screen is very responsive(as this replaced another cheap tablet that didn't have one this would be the best feature).  I would say it is as good as my Galaxy Tab 7.  Sound is good.  Apps are good.  I saw that someone complained that not all apps are compatiable but the reason is Flash is no longer supported by the latest Android OS.  I know that my phone and this tablet have the same shortfalls and my Galaxy 7 is older and has flash and they are available there. The camera is only a web cam.  There is not another camera.  But for 100 bucks you are not going to get everything.  My son has done hangout with me and wasn't bad at all. Overall it is a sturdy small tablet, looks nice, screen is great, sound good.  Battery worked very well.  We drove 5-9 hours and only once did he run it completely down.  If you are looking for a nice small tablet at a budget price this is a very good one.Would note that some say pay 50-70 dollars more for another tab.  Sure but that is 50-70% more.", "Title": "Great intro tablet, well worth the price.", "Date": "September 1, 2013"}, {"Author": "Warren Roark", "ReviewID": "R2TCMY2BNEG7KK", "Overall": "5.0", "Content": "Bought this for my mom and she loves it. Seems to run very smoothly & has a nice picture on it as well.", "Title": "Decent product", "Date": "May 26, 2014"}, {"Author": "donnadonchev", "ReviewID": "R2AN5FGDYW68FP", "Overall": "5.0", "Content": "This tablet is adorable. We have a bigger version of it, but this one is sooo cute. I got it for my mom, and it's easy to navigate and use", "Title": "Cute little gadget", "Date": "February 23, 2014"}, {"Author": "brookman101", "ReviewID": "R2UDJMXS390674", "Overall": "3.0", "Content": "I bought it so I could do my online schooling without having to be stuck at my computer desk all the time. It played almost all the games that I had downloaded from the Google play store except 1. the only complaint I have is the tablet wouldn't freeze but being with the smaller processor and ram is was really slow some times. But It worked perfect for what I needed it for I would recommend this tablet to others.", "Title": "Worked OK for what I needed it for", "Date": "January 13, 2014"}, {"Author": "ladrenia", "ReviewID": "R1FLGGU82C9WWT", "Overall": "2.0", "Content": "After receiving this product. I attempted to use it and it kept shutting off after fifteen minutes of use. I sent it back and got my money back. I did however love the look and how small it was. I was looking for a tablet that I could play a few games on, read, and easily fit into my purse. Also I did follow all the instructions for charging it up, but still no luck.", "Title": "It was defective!", "Date": "January 12, 2014"}, {"Author": "Anna", "ReviewID": "R11Y3WNUCBVBVJ", "Overall": "4.0", "Content": "I like it but, do not like the short life time of the battery.  It seems I'm charging more than using it.  Also, disappointed there was not a manual for me to follow to fully load the programs I mostly use, and how to transfer all the info from my desktop PC.", "Title": "Asus MeMO Pad ME172V-A1-PK 7-inch 16 GB Tablet (Pink)", "Date": "January 11, 2014"}, {"Author": "Kenia rolon", "ReviewID": "R21B3KFP82WX5H", "Overall": "5.0", "Content": "Thank you and have a nice new year ,hope you have more sales ,have a nice day asus is a good brand", "Title": "Ship fast", "Date": "January 7, 2014"}, {"Author": "Lisa Coleman", "ReviewID": "R2OB9Z8156CU3N", "Overall": "5.0", "Content": "The pink cover fits perfect and she loves it because she can set up the holder part and not have to hold it.", "Title": "Tablet Case", "Date": "January 6, 2014"}, {"Author": "R. Anderson", "ReviewID": "R35NMDJ3DZOH6I", "Overall": "5.0", "Content": "I got this for my 80 mom to look at pictures and she likes it but the battery rounds down so fast and she is does not live in a \" remember to recharge world\" and gets frustrated easily when it needs a re charge before use.", "Title": "Short battery life", "Date": "January 6, 2014"}, {"Author": "Eric Armstrong", "ReviewID": "R1XK76QNKLXH48", "Overall": "5.0", "Content": "We bought my ten year old daughter one of these for Christmas. My wife already had one and since we knew how great the product was and she wanted a tablet, we decided to go with another Asus. The price was a great value. My wife was a tad jealous that we were able to get my daughter a pink one. ;)I would recommend this tablet to anyone familiar and comfortable with android based operating systems. While I have not purchased an ASUS motherboard in awhile  (no recent computer upgrades), I have always been impressed with the over all quality of ASUS products.", "Title": "Great Tablet", "Date": "January 5, 2014"}, {"Author": "Julie Waichulaitis", "ReviewID": "R35XYMAWVPHDU3", "Overall": "5.0", "Content": "I purchased this as a Christmas gift for my pre-teen daughter. While she really wanted a larger screen with a detachable keyboard style tablet; I wasn't willing to spend that much money not knowing if it would be taken care of.  This tablet is a great choice to bridge the gap. She loves it! Being Google based, she is able to use all of her apps that are on her phone (except Instagram), it is compatible with what her school is using.  While it doesn't have a back facing camera, it does have the front facing camera so she is able to Skype with family and friends. It is a very reasonable price for a great tablet. I would highly recommend this for anyone.", "Title": "Great Starter Tablet", "Date": "January 5, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RAVG4EY8K39I0", "Overall": "5.0", "Content": "Great Product ~ The 7 year old works it great here 9 year old sister has the same ~ great investment", "Title": "Great Tablet", "Date": "January 4, 2014"}, {"Author": "Mary L. Lange-Snyder", "ReviewID": "R3BS2XMTMCJXWF", "Overall": "2.0", "Content": "difficult to use, battery doesn't stay charged long enough, things I have bought or tried to preview doesn't download, thiking about returning it and getting something different", "Title": "Dissatisfied", "Date": "November 16, 2013"}, {"Author": "Elaine Bosch", "ReviewID": "R20BH8IVGKJ4JN", "Overall": "5.0", "Content": "My middle schooler bought it with his own money and is using it for school.  So far, he is liking it.  The touch screen is not as sensitive as my IPAD which he likes a lot more.  He is very happy with his purchase.", "Title": "Great price for a child's first tablet.", "Date": "October 11, 2013"}, {"Author": "john", "ReviewID": "R287PKF5E20JY6", "Overall": "4.0", "Content": "I ordered this item for my 8 years old niece. She loved it.I would say it is a decent product int his price range, din;t like the image resolution much. A backside camera would have been great +, however it has only front facing camera.Apps runs at avg speed, and comes with good no of preloaded apps.I would recommend this product to kids not for adults and grown ups they may find it cheap.", "Title": "Decent Product", "Date": "October 10, 2013"}, {"Author": "Tony Familia", "ReviewID": "RRLEEIN043WG1", "Overall": "5.0", "Content": "It's not as good as an iPad, but it costs about a quarter as much!  This is for my 8 yr old and 6 yr old.  I chose the ASUS MeMo because it was the cheapest, brand name, tablet pc.  I am actually very impressed.  Kids love it.", "Title": "Very good value", "Date": "October 10, 2013"}, {"Author": "Roger W. Kinsman", "ReviewID": "R34WBQ3X6KN2PA", "Overall": "5.0", "Content": "I bought this MeMO Pad for my Granddaughter of 11 yrs and she was so happy it was worth every penny.  So far it has performed fantastically and I am very please with my purchase.", "Title": "Happy Granddaughter", "Date": "October 9, 2013"}, {"Author": "Luzia Teruya", "ReviewID": "R3NFAWQ984ID5X", "Overall": "5.0", "Content": "I recommend for all.  It's good choice.  Easy to use. My kid love it! It's a good price and product.", "Title": "Great!", "Date": "October 9, 2013"}, {"Author": "Kathy Cretsinger", "ReviewID": "R2J9Y5HMNYRYA2", "Overall": "5.0", "Content": "I wanted this to have something small to download documents and go. It is wonderful. It's everything I wanted and more. The price was right and I'm enjoying it everyday.", "Title": "Love the Tablet", "Date": "October 9, 2013"}, {"Author": "Bammbamm69", "ReviewID": "RSPYTK7PXBPD6", "Overall": "5.0", "Content": "For a middle user (not a kid not an expert), this Tablet is great. The screen is clear and the touch and multitouch Works very fast. One of the aspects I like more, is that with almost 100$ was posible to buy a very good Tablet, with 1GB RAM and 16GB storage capabillity. I think that this Tablet will be great for an student how needs a Tablets.", "Title": "Low Price GreaTablett", "Date": "October 8, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2NCVSZ9512MWJ", "Overall": "5.0", "Content": "It ie really good quality tablet on best price range.Easy to use and kids just love it!!!!Will buy another one soon..", "Title": "perfect tablet on perfect price range", "Date": "October 6, 2013"}, {"Author": "Synthesis", "ReviewID": "RL8KRU7TF801N", "Overall": "3.0", "Content": "With the HD 7 out (which is a far superior choice) last year's model can be yours for quite a bit cheaper.I managed to snag mine from Office Depot for 80 (bought the 2 year warranty since I knew going in that the tablet wasn't amazing) and because of that, I'd say my expectations were honestly a little broken. I was expecting to pull it out of the box and having NOTHING work properly, and although there were honestly a few issues, I'm quite okay with my purchase.I wanted a 7 inch tablet mostly for reading manga and watching anime on. I haven't tried watching anime on it, but the manga is very crisp and gorgeous. A lot better than reading on a computer or a tiny smart phone. It's portability also allows it to replace a laptop for some students, myself included, which has been quite pleasant so far.PROs:- Pretty cheap, 80~100 dollars for a 7 inch tablet? Not bad- Has a bit of weight to it, makes it feel durable- 16GB of onboard storage with a microSD slot, sweet!- The screen looks gorgeous to me at least, my manga looks crisp and very readableCONs:- The screen is terribly glossy. I can't STAND it. It's also pretty uncomfortable to swipe your fingers along it. It doesn't feel smooth at all.- My model came with the time setting being glitchy. Not a huge deal since you can always manually set it.- I can't copy/paste?- The manga app \"Mango\" doesn't work very well. :/- It can be quite laggy at times, but that's to be expected- I can't for the life of me figure out how to get a wallpaper that isn't blurry.- Some of the stock apps (which can't be removed :s) are seriously annoying.READ: I noticed some people complained about some Google Play apps not working. All of my apps that I had on my smartphone work just fine, but I backed them up with ES File Manager and transferred the .apk files to the tablet and installed them that way. Try that if you can't get something from the Market to install. Of course, this will only be viable if you own a different Android product.", "Title": "Great for my uses, which are basic", "Date": "October 5, 2013"}, {"Author": "TK", "ReviewID": "R1N3GGLORZS08Y", "Overall": "2.0", "Content": "Its cheap for a reason. Charger did not work out of the box. Within two day we started noticing lagging issues. Touch keybord is less than mediocre. I regret buying this for a birthday present. Im sorry to say, I thought ASUS would've made better product considering their history in manufacturing motherboards that receives excellent reviews. This was a sloppy attempt at the tablet market... look else where", "Title": "SMH", "Date": "October 4, 2013"}, {"Author": "Joshua", "ReviewID": "R1FI3GZ92Z883Y", "Overall": "4.0", "Content": "The tablet is not lightning fast but fast enough.One great feature is that it allows you to utilize the entire formatted 12.8GB of storage which some tablets won't let you do this they set a predetermined size of memory for apps and the other storage what ever that may be is for music so overall it's a pretty decent tablet i recommend this tablet for first time and intermediate users this tablet should serve well for adults or kids.", "Title": "Decent tablet for the price", "Date": "July 25, 2013"}, {"Author": "bfromaway", "ReviewID": "R1DDOULTEILELQ", "Overall": "4.0", "Content": "I bought this for a trip that I was going on. I am not computer smart so I was a little frustrated with it at as I couldn't connect to the wi-fi at the airport, but I have learned how for the return trip. I still don't know how to take things off that I download then decide I don't want, but I am still learning. It is handy to stick in my purse. It shuts itself off if you aren't moving anything around but it comes right back up when hit the power button. Battery life seems to be good. Picture quality is good, sound is great. I have watches a few movies on it and haven't had any problems.", "Title": "fun toy", "Date": "October 24, 2013"}, {"Author": "bo diddly", "ReviewID": "R1ECBG1N1WV5O7", "Overall": "1.0", "Content": "I had nexus that got mangled and needed to replace. I got this hoping it would be almost as good. It had some annoying glitches and was really unresponsive. I was willing to just deal with it until one day it shut off and wouldn't turn back on even when plugged into the charger. IT wouldn't even register the the charger being connected. When it randomly turned back on, the battery wasn't even dead. I was led to believe it ran the newest version of android, which it doesn't. THat caused me some major issues.", "Title": "Crashes on a weekly basis", "Date": "June 25, 2013"}, {"Author": "Will Alexandera", "ReviewID": "R1DVDP8SITXMU2", "Overall": "1.0", "Content": "My initial review titles was \"Disappointing\", but the more I used the device, the less I liked it. I gave it away to someone that didn't have a tablet.The device is called a MeMO Pad, not an Android Tablet. As I understand it, Android tablets need to have a minimum number of features, like GPS and accelerometers. This device does not have a GPS.Because there is no GPS, Yelp, Ingress, and many other location dependent apps can't even be installed. Google navigation keeps showing \"Searching for GPS\" when it displays the route.Since I no longer own this device, I can't answer any more questions about it.I do recommend avoiding this device if you want a full featured Android Tablet.I am so disappointed with this purchase.I wish I had returned it within a week of receiving it.", "Title": "I gave it away.", "Date": "August 10, 2013"}, {"Author": "bryan wisniewski", "ReviewID": "RP4A7UWI339HE", "Overall": "4.0", "Content": "I went from a Kindle fire 2nd generation to this tablet.  For the price it is top notch, it has ample storage space for apps and other data and although its not as peppy as a high priced tablet this one gets the job done.  perfect for web surfing and games that do not require a lot of processing power.  I highly recommend this product", "Title": "Great for the price.", "Date": "April 29, 2013"}, {"Author": "L0st S0ul \"Eric\"", "ReviewID": "R1B4X4EFUMFSU3", "Overall": "1.0", "Content": "I originally bought this tablet to do some extra testing for my Android App FlightMap. Amazon was having what looked like an amazing deal on the tablet for only $80 so I thought how bad could it be right? Asus, the maker of the Nexus 7, makes it so it can't be to bad. It had good enough reviews so I picked one up.Opening the packaging was very promising. It was packaged very similarly to the new Nexus 7 even including the same charger and cable. It was right away clear that the tablet was very similarly sized to the Nexus 7 while the screen area was noticeably smaller width. Height wise they looked the same. This difference in screen size is why I bought it. I needed the different aspect ratio to test the app with. The tablet screen also has an almost grey look to it that I didn't notice until I sat it next to the Nexus 7.Hardware spec wise it's a pretty base tablet. It has a single core A9 processor with 1 gig of ram and a separate GPU. It has a front and rear camera but neither are anything to write home about. The one nice thing that it has is a Micro SD slot. This is something missing on the Nexus 7 and it's nice to see it here. All of this is serviceable and the tablet actually performs quite well on android 4.2 (update came down after start-up and updated it from 4.1). YouTube videos played OK and Netflix also worked well. I didn't see any sync issues like others noted. It's not a speedy tablet by any means but it was better than I was expecting for a single core device. It only has a single core so expect hiccups if you're doing several things at once.Where the tablet falls down completely is the screen. Most of these cheap tablets make sacrifices and unfortunately for this one it was the screen. This has to be the worst screen I have ever seen on a tablet. The viewing angles are atrocious and the colors are completely washed out from any angle. I could not find a comfortable angle to view the screen at that I could see all 7 inches of screen at the same time. It almost has this polarizing effect on the eyes that caused me a horrible headache after minutes of use. The resolution does it no favors either. A 3 year old Archos 7 tablet not only had better viewing angles than this tablet but somehow the text look better on it at the same time even though they are the same resolution (1024x600).If the screen was as good as the Archos was 3 years ago I'd be able to recommend it but as it sits no way. Maybe my eyes are more sensitive than others but to me it makes the tablet completely unusable which is why the 1 star.", "Title": "OK budget Android tablet brought down completely by a horrid screen", "Date": "August 17, 2013"}, {"Author": "Aimee Paynter", "ReviewID": "R24VYPKXMBV84W", "Overall": "1.0", "Content": "I got this tablet because it sounded like it would be able to do everything I needed it to do.  Wrong.  Half the apps I needed to install for work were not supported.  I returned it for a refund and got a Hisense Pro 7 at Wal-Mart for $130 which did allow me to add the apps I wanted/needed with NO PROBLEM.  This tablet is probably great for a teen or as a first tablet, but definitely not what I expected from reading the reviews....", "Title": "Not worth the $", "Date": "October 16, 2013"}, {"Author": "Samantha", "ReviewID": "R7PM2D6F19XS9", "Overall": "1.0", "Content": "This is lightweight and easy to carry yes, but does not run well. Poor battery life, apps are constantly glitching, requiring a force shutdown. Screen rotation messes up and does not save selected battery power mode, auto switches back to high power. Not worth purchasing.", "Title": "Asus Memo Pad", "Date": "October 5, 2013"}, {"Author": "Cooper Family", "ReviewID": "R1ZI23MBB7UPI7", "Overall": "1.0", "Content": "Our kids bought these tablets and the tablets will not load paid apps from the play store.  ASUS the company has no resolution and is blaming the problem on Google but these apps work with other android devices.  I do not recommend this item.", "Title": "Tablets will not load paid items from Play store do not buy", "Date": "September 16, 2013"}, {"Author": "Michael", "ReviewID": "R1OZU036SEG4OW", "Overall": "5.0", "Content": "Coming from a dell streak 7 this thing is amazing. Great touch response, bright screen, quick processor. Some complain about coming from an ipad, well if you need to reason that out your not to quick. The important thing with this device is to use the Task Manager widget which lets you close apps that are running in the background and to go into the settings and turn off wi-fi on while sleeping.", "Title": "Great", "Date": "September 4, 2013"}, {"Author": "David G. Williams \"deepster\"", "ReviewID": "R31OIH5I9FLG55", "Overall": "3.0", "Content": "0nly 1 camera on this rig. battery life sucks. should have spent more money on a better unit. peace out.", "Title": "only 1 camera", "Date": "August 16, 2013"}, {"Author": "A. Gorshenin", "ReviewID": "R1KSQPP0SVIC4A", "Overall": "2.0", "Content": "I have been using this tablet for 2 days now. I do own first generation iPad and Kindle Fire 1st gen. (which was rooted to Android 4.2 version). The number 1 reason I bought this tablet is that it was on sale for $89 and it had web can (I use Skype a lot) and expandable memory that my other 2 tablets didn't have. I was hoping that with more RAM (1 GB) and web can it will replace my old Kinlde Fire as a primary Android device. Well.... I really tried to like it keeping in mind how little I paid for it but TERRIBLE screen and short battery life plus very sluggish performance comletelly ruined it for me. The screen is a deal breaker. It gave me headache trying to read webpages, I actually got nauseous and with double of RAM compared to my Kindle it is actually slower. Web page scrolling is  jerky which I never seen before on other tablet. In addition I couldn't install some of my apps that I have installed on kindle from Google Play store as it stated that the app isn't compatible with the device... that's was very unexpected.Bottom line, I wouldn't buy it having known what I know about this device now.", "Title": "Sub-par tablet that has no reason to exist.", "Date": "July 3, 2013"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B00BR3XMK4", "Features": "Android 4.1 Jelly Bean, 7 inches Display\nVIA A4 1.0 GHz\n16 GB Flash Memory, 1 GB RAM Memory\n.8 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41ZjtDFbBVL._SX300_.jpg", "Name": "ASUS MeMO Pad ME172V-A1-WH 7-Inch 16 GB Tablet (White)"}}