{"Reviews": [{"Author": "avalanchefan95", "ReviewID": "R366C1CMTEZATZ", "Overall": "1.0", "Content": "This tablet is awful. I gave this as a Christmas gift to someone who basically just wanted to be able to play solitaire, check email and read the news. Even those super simple things are beyond the scope of this pathetic piece of crap. It's not touch sensitive so you have to hit everything repeatedly - twice, but often 4 or 5 times to make them \"go\" to wherever you're trying to go; it is not loaded with Google Play which the description noted at the time I bought it but seems to have been removed shortly thereafter (this was one of the main features I was looking for); it is too slow to watch videos on as the buffering takes forever and they're choppy; spends all of it's time \"thinking\" and not enough time \"doing\" anything at all.The recipient didn't complain about this tablet -- he just put it back in the package and didn't use it. I didn't find out until later that it was a piece of junk. I got it out and tried to force it into submission but it was a no-go. Spend another $25 or $50 and get something half decent.", "Title": "Skip it", "Date": "January 16, 2014"}, {"Author": "Darla", "ReviewID": "R2G72PWVRW8UZB", "Overall": "1.0", "Content": "Thid tabket is very generic. I used it about 6 times and it quit working. Really sorry I bought it. It would be better to spend the extra money and get a good one.", "Title": "Not worth the money", "Date": "October 8, 2013"}, {"Author": "MARKBOYSGIRL", "ReviewID": "R38EJW708G5M0T", "Overall": "2.0", "Content": "I RESEARCHED FOR A MONTH BEFORE BUYING A TABLET, I THOUGHT THIS WAS THE BEST FOR ME. WHEN I PURCHASE ANYTHING, I LIKE TO READ OWNERS/USER MANUEL, WELL THERE WAS A BASIC MANUEL WITH NOTHING ELSE..I REALLY TRIED TO ENJOY MY FIRST TABLET. TOO SLOW AND FREEZES ALONG WITH MY MAJOR ISSUE HOME KEY AND BACK KEY STOPPED WORKING&#", "Title": "DOES NOT RESPOND WELL, BOUGHT IN MAY, HOME AND BACK KEY STOPPED WORKING.", "Date": "June 19, 2013"}, {"Author": "Crystal", "ReviewID": "R2FM1KLSQP4GOF", "Overall": "1.0", "Content": "I regretted buying these tablets for my daughters for Christmas. I hope you don't plan on using the internet or any new apps if you bought this tablet. Most of the apps they downloaded wouldn't even work. It would just say not enough resources available and that was even after deleting all other apps and turning the others off and adding an sd card. I have returned one of them, but my other daughter didn't want to return hers, but she has already quit using it. They have had cheaper tablets that worked much better. They just got broke from being dropped and stepped on. Wish I would have got them the same tablets again, I just thought these would be better.", "Title": "Junk!", "Date": "January 31, 2014"}, {"Author": "Marie Booker", "ReviewID": "RVBE53OLFYU1E", "Overall": "2.0", "Content": "It hangs up and says it has a virus on it.  it says it is a 9 inch tablet but I bought a case that is 9 inches and the case is too big.", "Title": "its ok", "Date": "January 22, 2014"}, {"Author": "Avinash Joshi", "ReviewID": "RKK9TB3JAPBX7", "Overall": "1.0", "Content": "I am generally the last person to write a bad review..but this one got me......I bought it for trying our a tablet.On arrival : the tablet would not power-up, had to charge it for 15+ hrs prior to first use....not a good start.After charging fully : the response was sooooooo slow, I had to tap and wait for 15-20 seconds to get a response ( I was sitting next to my wireless router to get the best coverage)Resolution : At best a blur, takes 10-15 seconds for the text to sharpen.....I did not have the patience to measure the image lag.After a week : I power up a fully charged D2, opened chrome and go to Netflix to watch a movie, the battery was less than 25%...after using it for 4 minutes from 100% to 25%...I would not recommend it to anyone.", "Title": "Do not buy it, a total waste of money", "Date": "July 6, 2013"}, {"Author": "Edward Adams", "ReviewID": "R14LTOESYQCU0", "Overall": "1.0", "Content": "I went through the 5 hour charging cycle to find that it wasn't working. It was totally unresponsive with no recognition of life. I returned it, and ordered a brand new unit . The listing said \"USED, LIKE NEW\". Well, it looked NEW, but that's where it ended. Thanks to a fine customer service at Amazon, they took positive action to get me on track, and helped with the return process.as well as reordering my new replacement.", "Title": "This item arrived dead on arrival", "Date": "July 12, 2013"}, {"Author": "alrcmr", "ReviewID": "R2UMY9QD2V6YQT", "Overall": "1.0", "Content": "I purchased 3 of these for Christmas for my granchildren.  The first one screen cracked within 2 weeks, the second one was a week later, and now the 3rd one has cracked also.", "Title": "Dont buy", "Date": "January 27, 2014"}, {"Author": "Mallik Singaraju", "ReviewID": "R15M5TY1N1SEIX", "Overall": "4.0", "Content": "It's worth the money and I liked it, just ordered a bag to cover it. The product is not for serious technical use, it can be used to check mails and stay updated, It only works on Wi-Fi and is devoid of internet slot...", "Title": "Its cool", "Date": "July 1, 2013"}, {"Author": "Burnes", "ReviewID": "R31IKLRAEJHBA3", "Overall": "2.0", "Content": "I returned this item because I learned only after ordering it that it does not support the Android Playstore, which others do apparently. The price seems great (priced so low it is almost throw-away technology which is amazing). I am a hard core Apple guy and miss the ease of Apple's ecosystem. I have an iPad 1 but use an Android Samsung Note 2 phone which I love but it doesn't make using photos or music easy at all. So I think when the new iPad 3 and iPhone 6 are announced, I am going home to 100% Apple only products. Plus. I find Android very flaky at times. But if this product had supported the Android Playstore I would have kept it.", "Title": "No Android Store!", "Date": "June 9, 2013"}, {"Author": "Pauline Ellis", "ReviewID": "R1OMM0TQ9LAZSF", "Overall": "1.0", "Content": "My daughter was excited to recieve her first tablet for her birthday. It worked great for 4 weeks then started giving trouble to charge, now it wont turn on. Contacted support who simply directed me to the website...waiting for a response", "Title": "4 weeks and having problems", "Date": "June 2, 2013"}, {"Author": "Victor Daigle", "ReviewID": "R2XHIUMT5FGGWS", "Overall": "1.0", "Content": "I was disappointed with tablet as the screen broke with in the first week. I had even bought a case to protect it.", "Title": "Broken screen in first week", "Date": "June 3, 2014"}, {"Author": "Leatrice Montague", "ReviewID": "RV6XXBZB51WS8", "Overall": "5.0", "Content": "Great Item for the price. the children loved it and so did I. large screen easy to navigate. great buy!!! I highly recommend this Tablet.", "Title": "Great Item", "Date": "June 3, 2014"}, {"Author": "Abraham Moses Genen", "ReviewID": "R3S5ZQSWGBGVKB", "Overall": "4.0", "Content": "This product had a defective screen. It was exchanged for another Digital2 9-Inch Android 4.1 Jelly Bean/ 4GB/512MB DDR3/16:9 Capacitive... The second one worked fine.However, they were both misrepresented. Neither tablet was an Android 4.1. Rather, they were Android 4.0.The directions and instructions for proper operation were wholly inadequate. Calling the vendor/dealer in California was a waste of time. No worthwhile instruction was ever provided.", "Title": "Digital2 9-Inch Android 4.1 Jelly Bean/ 4GB/512MB DDR3/16:9 Capacitive...", "Date": "July 8, 2013"}, {"Author": "marie selvaggio", "ReviewID": "R34S9QETCAM0KD", "Overall": "1.0", "Content": "Never worked properly from day one.Kept losing Internet connection,( my iPad was connected,so I knew it wasn't the wifi)And now it is frozen.DONT PURCHASE THE SQUARE TRADE POLICY EITHER...CANT GET THEM TO RESPOND TO MY CONTACT !!!", "Title": "Lemon", "Date": "August 10, 2013"}, {"Author": "Elliot Mozorosky \"dragonscribe\"", "ReviewID": "R2FZWYI44R445K", "Overall": "1.0", "Content": "If you LOVE frustration, and the most INEPT, USELESS, TIME WASTING Tech UN-Support, Then by all means Waste your money on this expensive paperweight!!!!  When I \"Attempted\" to sync my E-mail (Hotmail), it kept telling me that \"Sync was in process\".  It NEVER HAPPENED. after holding for a half hour, I spoke with the most INEPT *&^^%%!!  who came up with every excuse, well, it must be Android, or This or that........ NO HELP WHATSO EVER!!!!!", "Title": "If You LOVE Frustration.....", "Date": "July 30, 2013"}, {"Author": "video chuck", "ReviewID": "R1OV6ERQ7XY7VE", "Overall": "1.0", "Content": "You get what you pay for. and this is a piece of crap, but it will do till i get something better. extremely slow and unresponsive.", "Title": "Slow slow slow", "Date": "October 22, 2013"}, {"Author": "augustine klinsukont", "ReviewID": "R3AZPSXDJV1HGS", "Overall": "3.0", "Content": "bought this for a 7 year old. The materials are junk (besides the nice feeling back panel), when holding the tablet normally, you can see the LCD being influenced by your fingers in the form of bubbles. For what its worth and what it costs, it will get the job done to entertain a 7 year old on the cheap, and make them feel like a boss for having tech. For adults i would stay away from it, it certainly does not fit with the quality (or price tag) of current generation tablets, but who really would have thought that anyway. I doubt this thing will last a year, but once again its pretty cheap for a tablet.", "Title": "get what you pay for", "Date": "May 9, 2013"}, {"Author": "ying chen", "ReviewID": "R5SMS1WAULHYF", "Overall": "2.0", "Content": "Try to use tango to make video call with this tablet, the app works, but the carmera is some how upside down. Called the customer service, told that its the 3rd party app they can do anything about it.And the tablet react kind of slow, need to push hard on the screen, will never use this brand again!!!!!", "Title": "cant do video call", "Date": "April 21, 2013"}, {"Author": "ken", "ReviewID": "R1X146CZESE4HU", "Overall": "1.0", "Content": "I bought this tablet an its the worst electronics purchase I have ever made. Its incredibly slow, it doesn't have the Google play store. The description was misleading.  I guess its true that you get what you pay for. I'm ready to start buying the old fashion way going back to the stores. This tablet is horrible", "Title": "regret", "Date": "May 20, 2013"}, {"Author": "Notta_Sunflower", "ReviewID": "R1H01L017DOO2N", "Overall": "2.0", "Content": "This tablet was pretty slow. When typing on the keyboard I had to jab my finger on the screen pretty hard or hold my finger down for 1sec for each letter, it was pretty annoying. Maybe I just got a defective one, IDK. I'll be returning it...", "Title": "Slow", "Date": "March 28, 2013"}, {"Author": "Dima", "ReviewID": "R2XGAJBKPA1R2W", "Overall": "3.0", "Content": "It's OK if you're going to use it to watch movies or to play very simple games. But please, don't try to read something - I've broken my eyes after 5 minutes reading a browser page. Also, Google Store was replaced to 1Mobile - it isn't so bad, but you even can not to sign in youtube! I suspect that there may be other problems with google app. But real disapointment is that the description is wrong. Here is what I've really got: Memory: 354Mb Storage: 1.15Gb(522Mb free) - this is a reason to send it back.", "Title": "Just a toy!", "Date": "April 25, 2013"}, {"Author": "Gauchita", "ReviewID": "R1JPLEBV1BMJ96", "Overall": "1.0", "Content": "I should have pay more attention to other writers. I never could use it and I'll try to return it.For sure it had nothing to do with the iPad. It's true, more money but works as soon as you opened it.DO NOT BUY THIS.", "Title": "Too Bad", "Date": "September 15, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00BF9MTLS", "Features": null, "ImgURL": null, "Name": null}}