{"Reviews": [{"Author": "K. Sperling \"loving mommyhood!\"", "ReviewID": "R2FWTEC89IKHLX", "Overall": "5.0", "Content": "This is my 2nd d2 pad.  I really liked the 1st, but this one I LOVE!About the 1st...The 1st one (model # DII_pad) I purchased from Big Lots for the same price ($80).  It is the older model. I saw it and thought it was worth the try for the price.  The WiFi signal was stronger than my samsung smartphone.  It was surprisingly fast and stable.  It has a nice sturdy, quality feel to it, unlike the polariod tablet I also purchased from Big Lots (that was also VERY slow). The D2 screen looks beautiful, video looks great. I installed the flashplayer via the d2 website instructions. The battery life is not very long (about 3 hours of heavy game playing, more for reading ebooks), but it charges in just about an hour.  My only complaint was that the amazon kindle app didn't work and temple run couldn't be played because the tilt feature didn't work in the game. Tilt worked just fine on other apps like labyrinth. My daughter loves my d2 pad, so she asked for one of her own over a kindle (which her dad has).This newer one (model # D2-711) from Amazon is AWESOME! It's even faster.  My daughter is very happy. I downloaded and installed about 12 apps in just over a half hour.  The WiFi is super strong.  Kindle App works great. I already put a couple of books on the pad for my daughter. Temple run works great, as do the other apps.  For anyone wondering what kind of case to get for it, it fits pretty well in my husbands Kindle fire case from amazon (Kindle Fire Lightweight MicroShell Folio Cover by Marware). Snaps in and sits pretty snug and you have access to all the buttons and ports which are now on the bottom after the redesign.About the company.  D2 pad in on facebook.  The staff there actually reads and responds to posts and questions about their product, sometimes the same day, but usually withing a day or two.  Their website has lots of info on the FAQ page, but good luck contacting anyone through the website. Word of warning...the software update for the older version (my 1st purchase) actually contains a trojan, so be advised to check any download before installing.  That is my ONLY concern about this product. I haven't needed to download anything for this new d2 pad.I would totally recommend this tablet for anyone looking for good performance and great value.  We've tried a couple of other Big Lots tablets and have not been impressed the way we are with the D2.  I recommend buying this product through Amazon because they have the newer version.  If you find yourself looking at a d2 pad in a retail store sometime, my best advice is to look a the model number or the serial number on the bottom of the box. Serial # beginning D201208... is the older model with a few small issues.  If the serial number begins D201209...this is the newer model, the fantastic one!", "Title": "Absolutely perfect!", "Date": "January 4, 2013"}, {"Author": "S. Mom", "ReviewID": "R34HXZDQVHN7B1", "Overall": "4.0", "Content": "I have been looking for a tablet for my daughter for months and I have always kept my eye on the D2 tablets because of their high ratings for tablets under $100. I waited too late to get the pink one (other sellers over charge for the tablet). I was given a Kindle Fire HD for Valentine's Day and the kid when crazy over it. To keep my Kindle from ending up like my laptop (poor hinge), I decided it was now or never to buy her a tablet.I only gave it four stars because we have only had it for almost a week (never know what may happen). Let me start with cons. :)CONS:Many have said the internet is slow and compared to my computers and Kindle, it is. It reminds me of my cell phone when I use data from my carrier and not Wi-Fi, meaning it takes about five more seconds to load. So if you an adult who needs super fast, instant internet, move along!The movies did not work...but I knew they were NOT the type of movies my 3 year old would want. Kido'z TV was not installed on mine so installed it myself. That is a great app for children to watch shows without the extras on Youtube.The camera is on the top right corner (holding it as pictured). I'm used to laptop cams being in the middle BUT as of now, she will not be using Skype or anything else. Quality of the camera is not the best (0.3 megapixels) but it's better than nothing!It's not HD...so if that what you are looking for, move along! Quality is great in my opinion.AS USUAL there are some apps you cannot delete BUT they do allow you to disable them in the settings menu.PROS:I LOVE the Mee Genius app and the free books that came with it. The narrations for those books are ten times better than me downloading kids books on my Kindle and having the system narrator read. One book about a Jungle Orchestra even had neat music and songs to go with it.The instructions that come with it makes it very easy to understand and how to operate. Be sure to follow the directions of charging before operating (mine turned on after inserting the charger) and draining the battery twice. I am just now letting it die the second time because I restrict her usage.It fits a case for the Kindle Fire (not HD) purchased at Walmart. Only issue is openings block the headphone jack (no big deal).Comes with a charger, a USB cord, and some other cable I am assuming  is for TV, computer...something!Battery life is fine.Right now I am using a 2GB micro SD card to store some apps and the micro SD card works fine. (Note: I had to turn off debugging when I used the USB to transfer songs to the SD card while inside the tablet. Too lazy to get the converter card to put it directly in the computer.)Rubberized backing...because I never liked the smooth backing on ANYTHING!OVERALL: I think it is not a bad tablet to have for a child or a beginner tablet user.I keep my eye on it at all times like my Kindle (neither have had falling accidents) so be sure to get a cover case with a stand, screen protector, AND a shock proof travel case on Amazon or from Big Lots (take it in the store to make sure it fits). Way cheaper than Walmart, Kmart, Target...wherever!", "Title": "Great Tablet for a Kid", "Date": "March 5, 2013"}, {"Author": "jnee27", "ReviewID": "R3P2S2L1RH473S", "Overall": "5.0", "Content": "I got this tablet for 79.99 @ big lots and its awesome for the price,u can play decent games web browser pretty good wifi picks up great body is soild,great speaker and packed with 1gb ram most for this price only gives 256mb ,this beats alot of tablets like cobys etc even though its not preloaded with google play ,i have it on mine now so its possible ,but the mobile one not a bad store for free apps ,come on amazon sell this tablet !!!!!!!!!!!!!!!!!!", "Title": "Great For Price !!!!!!!!!!!!!!!", "Date": "November 26, 2012"}, {"Author": "Steve", "ReviewID": "R1BWLARNHMQQYY", "Overall": "3.0", "Content": "I use an original Samsung Galaxy Tab 10 and and Galaxy S3 Phone.  So my kids were dying for a device of their own.I picked up a couple of these for them to use.  In my testing so far this tablet works well for such a inexpensive tablet.  Battery life isn't great but sufficient.  It comes with a proprietary wall plug for charging, but it may charge over USB as well.  Played some Videos on it, worked well.So far the biggest complaint is the lack of Google Play Store. Tried to install it myself but it keeps crashing (any ideas on that?).Update 04/10/2013:Downgraded my review (4 to 3 star).  The battery life on standby is horrible. 6-8 hours on standby and the battery is gone.  Found that they left unneeded cellphone (no cellular hardware on the device) software running and it kills the battery trying to find a cell signal.  I contacted support weeks ago, they acknowledged the issue (barely) but no fixes so far.Since no Play store you have 2 basic options: - Amazon Store  It is an OK replacement, more geared towards Kindle devices. Not as many apps available as the Play store. - 1Mobile Market  This is the default on the device. Again not as many apps as the Play Store, and those it does have are often out of date.", "Title": "Nice tablet especially considering the price.", "Date": "March 15, 2013"}, {"Author": "Leo Mitchell", "ReviewID": "R2DCTDGT64799S", "Overall": "5.0", "Content": "I bought 2 of these D2 7\" tablets during the holiday season for $79.99 each. I purchased a blue one for myself and a pink one for my daughter as a Christmas gift. I must say that I'm very impressed with our overall experience with these products.My daughter absolutely loves her pink tablet and uses it all the time. She is constantly watching videos on youtube and playing on Disney websites but even more so she loves all the games, books and apps that are geared toward kids that come pre-loaded on these tablets. The fact that D2 pre-loads 20 eBooks for kids, lots of kids learning apps from Kevin Bradford, and other fun games and apps makes these tablets an even bigger hit in our household.From a parent standpoint this tablet also works very well and comes equiped with pre-loaded utilities such as Dropbox, Pulse News and Kingsoft Office. However since these tablets seem to be marketed as a household tablet that can work for the enitre family I was also impressed that D2 had thought to pre-load a Kids Place parental control app launcher to protect personal data and restrict kids to only approved apps.From my experience we have had no issues with our D2 tablets and the internet seems to work just fine on my home wifi network. I would definately recommend this tablet and believe it is a great value at $79.99.", "Title": "Great Tablet, Great Value!!", "Date": "January 30, 2013"}, {"Author": "Staci M", "ReviewID": "R11M09EMW4QKO8", "Overall": "5.0", "Content": "This is the third tablet I've purchased during the Holiday season. the first was a MID Tablet for my husband and the Wifi is awful. He insists on keeping it though.The second was a supposed to be a Wolvol tablet. but it was not as advertised, so I sent it back.This one is the one I'm keepingAfter checking the reviews I purchased the D2pad tablet in pink, simply because I'm a firm believer that if you girl up your stuff, it wont be likely to be stolen.I was pleasantly surprised to find that the pink version has a rubberized back(the blue is rubberized too) instead of the plastic back that comes with the black and white versions.As for the tablet itself. I'm finding it very easy to figure out.At first I was a bit alarmed to find that it doesn't work with Google play, but as it turns out the Amazon App store and the 1Mobile app store pre installed have everything Google Play has and more, so its really wasn't an issue at all.It picks up a WiFi signal with no problem, sometimes I have to turn off the wifi and turn it back on for a better connection but that's always been the case with my laptop too, so that's nothing new.This tablet comes packed with children's games and books which is great if your giving this to a child. personally I didn't need any, so I finally figured out how to get rid of them. I went to 1Mobile and downloaded an app called \"Root App Delete\" to get rid of them, so now my tablet has only what I want.I also downloaded Pandora, so I could listen to music and was amazed that the speakers on this tablet work better than a creative zen MP3 player.This tablet works well viewing youtube videos. I've noticed that it wont view my videos from Dropbox, but I think that's because they are not in an AVI format.Some people complain about the battery life but I've been able to play on this thing for about 3 hours without having to charge it.I think that's pretty good as I don't usually stay online for more than a couple hours at a time.Overall I have to say I'm impressed with my new toy.", "Title": "I finally bought the right tablet", "Date": "February 5, 2013"}, {"Author": "JayOcampo88", "ReviewID": "R13EUR7TAZ01XP", "Overall": "1.0", "Content": "Its a fun lil tablet. Does what it says, I've still to test it with SKYPE (Which is the main reason I bought it) and with games.For your basic eMail, internet browsing and game playing it does the job.It's a little on the slow side, but thats ok. Camera works great but its in a weird place; SO iT SHOULD be amusing to see how it goes with SKYPE.Would of also been great if it had SWYPE from factory as a way to type onto it.Ill update once I've had it for a few days.**UPDATE**So, Ive had this tablet for a a week or so at this point at this point. And I must say, that it still works as it should.However, Its extremely disappointing that even though the description read 4 (FOUR) GIGS. The tablet BARELY HAS 2 Gigs free. I mean, what the hell???Besides the fact that IT CAN be extremely slow at some point, this tablet is really good. And im happy with it.If I could figure out a way to be able to remove some USELESS programs that come with it (Chrome [which tends to freeze the tablet,] W Games, KIDO'Z, LOOKOUT, MEEGENIOUS, SOUNDHOUND, and TANGO.)Each one is taking up a ridiculous amount of memory that I'd rather use for my OWN programs.The \"1Market\" is DECENT, although I do feel that most of the program reviews are staged.**UPDATE**After having this tablet for a few months I have GOT to say it really STINKS!!.I dropped it once and it literally fell apart. My sister has dropped her cheaper tablet and it still runs.It has gotten slower and slower to the point where its not even worth the bother to use.Tried using NETFLIX yesterday...wouldnt load it, and when it did it got stuck buffering.Save your money and move on. You'll regret buying this like I did.NOT WORTH THE MONEY!!! PIECE OF TRASH...", "Title": "**UPDATE** Works fine. Takes a little getting used to it.", "Date": "April 10, 2013"}, {"Author": "alwaysunique", "ReviewID": "R1XQTP9UE3VJC9", "Overall": "5.0", "Content": "I purchased this tablet for my husband's birthday. He is extremely pleased with the speed, the variations and all the possibilities of it's use. The price was awesome, and it is perfect for getting on his social web-sites. The only draw back is the pre-downloaded Amazon Aps Store application. DO NOT download any of the applications on this site, these applications have dangerous malware attached to them when they are downloaded. I purchased additional virus protection for his tablet, and every time we attempted to download any of those applications the virus protection would warn us that there was malicious malware attached to the application. I just do not understand why Amazon continues to offer these free applications that immediately causes owners of new android devices to download malicious applications that will ruin your device before you can really use it.", "Title": "My Husband Loves It.", "Date": "March 11, 2013"}, {"Author": "Joseph Kent", "ReviewID": "RVDR63UAZ8UBC", "Overall": "4.0", "Content": "My first tablet was a Samsung Galaxy Tab 2 7.0.  However, that was stolen from me on the bus, so I needed a quick replacement.I've taken to calling this a \"half tablet.\"  It was (less than) half the cost of the GT2, has half the processor cores, half the RAM, and half the flash memory.  But all in all, it's not half bad.I took the time to figure out how to put the Google Play store on this device, which is a necessity, since one of the apps I wanted a tablet for was Google Play Magazines.  I'd venture to say that most users just diving in to the Android platform would be fine with just the 1Mobile Market that comes stock on this tablet.  But when you've been an Android user for as long as I have, Google Play Store is a must.  Still, it was simple enough to find help online with installing the Play store, so it's not a huge deal.The 4GB storage was a bit scary to me.  I was close to filling the 8GB storage on the GT2 a few times, so 4GB didn't seem like a good idea.  However, unlike most ICS devices, this tablet allows you the option to move apps to the SD card, which lets you add more apps than I originally anticipated.All in all, if you're just looking for functionality, this tablet is pretty decent.  If you're looking for better graphics and faster speeds, save for the GT2.  Still, well worth the money.", "Title": "Not half bad", "Date": "February 8, 2013"}, {"Author": "Richard Meyer \"Rick Meyer\"", "ReviewID": "R171Z75UBVFRZW", "Overall": "4.0", "Content": "Bought the D2 7in tablet.Recieved it 4-5-13.Charged it and been crazy bout it.Easy set up-downloaded 2 e-mail accounts.Good graphics.Couldn't figure sound until I realized \"internal speakers\" meant \"earbuds\".Camera is cool.Use it some much I had to do my second charge.A tiny bit slower than my laptop but hey for $79.00 who cares.Would highly recommend.Already told my friends and co-workers.I also bought the case that has the keyboard which I also recommend.Keeps your fingers off the screen and gives it that laptop feel.Comes with all adapters and plugged right into the D2.If you want to spend $400.00 or more for a tablet go ahead but I'm crazed about my $79.00 D2.", "Title": "D2 -Lovin It", "Date": "April 7, 2013"}, {"Author": "happy", "ReviewID": "R22GWV6C5IAV0H", "Overall": "5.0", "Content": "i love this product... its very quick to use, especially the browser responds quickly, very portable n soo far its working perfectly... i bought two of these for my parents n they love it... i hope i dont get any problems with it but for now i say i love it n very worthet for its price", "Title": "soo far soo good", "Date": "March 17, 2013"}, {"Author": "Baron", "ReviewID": "R6W8S2HVA3U19", "Overall": "5.0", "Content": "We purchased three of these tablets after having to return three Coby tablets. These are absolutely great for our kids. They haven't had any problems, and are very easy to work. The kids are able to download all their games through amazon and 1mobile. I would highly recommend this tablet if your are looking for something for your kids to use.", "Title": "Perfect for our kids!", "Date": "January 24, 2013"}, {"Author": "Ed", "ReviewID": "R24ETP4XO9L6YL", "Overall": "2.0", "Content": "This device is frustratingly bad.  I'm giving it 2 stars instead of 1 because it can be useful to some.  Firstly, I'd recommend this tablet for use by children.  It comes pre-loaded with about 2 dozen game apps geared toeards young children.  The vast majority of these apps can not be simply removed.  If you're a techie and don't mind searching through this device's root directory, then it can be done. Secondly, this device is sloooow.  I have excellent and strong wi-fi reception in my home.  I have Verizon FIOS 50/25 Mbps Internet Speeds and every wireless device in my home operates exceptionally well, that is except this D2 Tablet.  Thirdly, you can not update this device's drivers.  Initial syncing with your home computer auto starts a driver update and download.  However, the device's drivers can not be found.  Perhaps this tablet would operate much better if one was able to update its drivers.  I bought this tablet for portability and enjoyment not for frustration.  It's going back!  Also, I don't understand these glowing Amazon reviews.  A simple google search revealed countless complaints on Tech blogs.  Check for yourselves!", "Title": "Loaded with Childrens Apps", "Date": "February 22, 2013"}, {"Author": "Mimelen", "ReviewID": "R2EMR8FGSKPY1T", "Overall": "5.0", "Content": "This is a great tablet for a pre school age child for fun apps,games, movies, or for use educational purposes.", "Title": "As expected", "Date": "April 24, 2013"}, {"Author": "JS", "ReviewID": "R3ABFK6YDQG900", "Overall": "4.0", "Content": "I purchased this tablet about 3 weeks ago at Big Lots, and so far so good! With an $80 price tag, I'd say it's a pretty sweet deal for someone on a budget like myself. I've played around with other more expensive tablets before, and this one measures up for the most part. I mainly use my D2Pad for social networking, games, internet, e-mail.. The only complaints I do have are that it can't access Google Play and that it lags a bit while video chatting. Not sure if it can handle large files. That's about it.. but then again, can't really argue with the value of this product! Overall, a very useful and entertaining device to have on you, especially if you go out of town as much as I do. (And enjoy addictive games like Angry Birds!!) I'd buy some as Christmas presents, but the stores around me are all sold out!", "Title": "Great tablet at an awesome price", "Date": "December 13, 2012"}, {"Author": "kayla harris", "ReviewID": "R35LUUKFFOB02I", "Overall": "5.0", "Content": "I LOVE THIS THING IT WORKS LIKE A CHARM. iT IS VERY EASY TO USE. THE INTERNET IS PRETTY FAST. IT IS EASY TO TAKE WITH YOU DIFFERENT PLACES. I WOULD RECOMMEND THIS TO EVERYONE THAT WANTS A TABLET", "Title": "tABLET", "Date": "August 14, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3C85GJGQ9AHIM", "Overall": "4.0", "Content": "I ordered this tablet for my 11 year old. I hadn't had it 2 day's when it began to freeze up on me every 2 -3 minutes, so I contacted Amazon and they sent me a replacement of this tablet in 3 days. The second one works great. Had no problems with it what so ever and I would recommend it. I had no problems sending the first one back either, shipping was free.", "Title": "I had to send the first one back.", "Date": "September 19, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2TV2IVFWBF4FA", "Overall": "5.0", "Content": "I got this for my 6 year old daughter for her birthday. She always loves this tablet she never parts with it except to charge it! I love that there is a kid appropriate zone I was able to customize to her age & I have no worries of what she downloads or views. She loves the story books, watches cartoons like popeye, tom & jerry and other classics she thoroughly enjoys. The games are educational so I don't mind her playing for extended periods of time. I have read in other reviews of it freezing but we haven't had any issues other than her impatience and tapping too many times, but she is 6. I'll be ordering one for my son for his 8th birthday in September in Blue.", "Title": "Perfect for children or those who only go online on occassion", "Date": "July 28, 2013"}, {"Author": "Jerad Heffner \"geek, car buff, and dad\"", "ReviewID": "R1DT2X49PUNU8D", "Overall": "1.0", "Content": "I bought this to test out an inventory-taking idea for work. It was cheap, so I thought I'd give it a try.The tablet feels solid and has a nice texture. The blue color is okay, but kind of makes it look like a toy.If powered off completely, it takes forever to boot. During normal use, it's sluggish.The battery life is horrendous.The screen is a travesty. It's pixelated and has absolutely no viewing angle. Even looking at it straight on, parts of the screen are washed out.At my local coffee shop, it won't connect to their Wi-Fi. My Kindle Fire does, an so does my phone and my laptop, but not this device. Don't know why.The sound volume is lacking.The included apps are all system apps, which are not easily removed. While the system does come rooted and someone with the technical skills required to remove them could, this tablet is targeted towards those who are price-conscious. I also have a Kindle Fire 7\" HD, and despite its limitations (some apps I want not available in Amazon App Store and no USB keyboard support to name two), I strongly recommend it or its little brother, the Kindle Fire 7\" for about $160.If you're looking for a quality tablet that will last and will not frustrate you, this is not it.", "Title": "Spend the extra money and get a good-quality tablet", "Date": "February 25, 2013"}, {"Author": "Oral Newsome", "ReviewID": "R232YWYY3HZMNF", "Overall": "5.0", "Content": "I bought this product for my wife, she loves it.The price was good.The OS works Great.Lots of apps.", "Title": "Great", "Date": "March 29, 2013"}, {"Author": "David Friedman", "ReviewID": "R2Y5REY9TMNQXT", "Overall": "4.0", "Content": "Great choice for our 9 year old.  Much better than other brand we tried and returned (polaroid).  Decent speed and capacity.  Has held up well in 8 months since we purchased it.  The 1 mobile site has tons of popular apps and they are all free so no worries about him going nuts on the downloads.", "Title": "Excellent value", "Date": "October 18, 2013"}, {"Author": "Katherine M.", "ReviewID": "R25MYIP9YEZB26", "Overall": "3.0", "Content": "The truth of the matter is, we got this because it was a relatively cheap product but it was something that my son wanted. Sadly, it's a piece of crap. It worked fine at first but then it started going down hill quickly. Certain apps, such as Netflix, REFUSED to even OPEN on his tablet. This disappoints me severely considering my son really, really wanted this. It hasn't been a year and the plug in port has broken. Normally, as a parent I'd blame him but with all the issues we've been having and the way we've seen him treat it... it's not him, it's the machinery. So, if you want a temporary tablet to hold you over until you can afford a good one this is good for it. Just don't use it as a permanent thing.", "Title": "Be Careful What You Wish For!", "Date": "September 20, 2013"}, {"Author": "K Coleman", "ReviewID": "R1B3OGAQ7X58P5", "Overall": "4.0", "Content": "Some of the programs take quite some time to load. Battery life is good. 8 year old is satisfied with it.", "Title": "Nice for a child", "Date": "August 30, 2013"}, {"Author": "Babzee \"Barbara\"", "ReviewID": "R17O9IX3X2WEVA", "Overall": "5.0", "Content": "This was a graduation gift for a kid and he loves it!A great first computer tablet, Surprised how well it works", "Title": "For kids", "Date": "August 30, 2013"}, {"Author": "Brett", "ReviewID": "R19C9QNPP4G8R4", "Overall": "4.0", "Content": "I purchased this for a friend who liked the D2 tablet I bought my wife. She gave up on Laptops and noticed my wife carried hers everywhere. She decided on this one because of the price. The only complaint she has expressed is slow video playback at times and poor battery life. I encouraged her to buy a tablet with 1gig of memory to prevent the slow response, but she chose not to. She uses it to Web surf, go on Facebook and play games and is very satisfied. She did say if she had it to do again she would buy one with 1gig of memory.", "Title": "Surrogate", "Date": "August 11, 2013"}, {"Author": "helen king", "ReviewID": "RAM7FCVEEOGCH", "Overall": "1.0", "Content": "I was not pleased with this product at all I ordered it twice and each time there was something wrong with it. I am still looking for my refund that was never sent for this tablet it has been over a month. The first one the color was messed up in it I sent it back and the next one had no sound. So I just asked for my refund and I never got it. It was suppose to take 3 weeks to get a refund and it has been over a month and still no refund.", "Title": "No sound", "Date": "August 8, 2013"}, {"Author": "Debra Revel", "ReviewID": "R27ITMYN0GKTSN", "Overall": "5.0", "Content": "Bought it for my 9 year old grand daughter. She loves it because she can now play Fun Run with me and her mom", "Title": "Grand daughter Loves It", "Date": "July 14, 2013"}, {"Author": "Jennifer L. Bannan", "ReviewID": "R17TFK071YHE3X", "Overall": "4.0", "Content": "Only reason I gave it one less star is that it doesn't have a rear-facing camera. Otherwise, it seems to meet all other requirements, including Android-apps compatibility.", "Title": "Good little basic tablet.", "Date": "July 14, 2013"}, {"Author": "Hugo", "ReviewID": "R1NPNMBYV1OLE4", "Overall": "2.0", "Content": "I bought this because it had some good reviews and was inexpensive for a 7 inch tablet. The screen is good and the operating system close to the most recent. Runs all the usual android applications, but no playstore. This isn't a problem since there are other non Google stores that have android apps. The main problem with this is the very slow processor used, which probably accounts for the low price. It takes much much longer then the ipad and name brand android tablets I bought later. Not just a little slower, but sometimes so slow you will think the device stopped running. In hindsight I should have gotten a name brand tablet for a little more money. Its worth it.", "Title": "Ok for the money but very slow", "Date": "July 7, 2013"}, {"Author": "Jeffrey Cross", "ReviewID": "R28CF7PFXFIEWY", "Overall": "2.0", "Content": "We bought two of these tablets.  There are two things that I think everyone ought to know before making this purchase.- The battery is 3000ma (according to the documentation.)  My son plays 3D games (mostly temple run) and it lasts almost exactly one hour before being completely dead.- 4gb of ram may sound like a lot but it's almost completely gone.  Again, my son loaded 3 games before getting \"out of memory\" errors.  We were able to remove a preloaded movie (or trailer, I don't remember) and reclaim some space.  But it's small storage straight out of the box.  Yes, you can easily expand the memory but you can also spend a little more money for one with more memory out of the box too.For us, the limited battery and limited storage was enough to send it back.", "Title": "Works fine, but not enough UMPH", "Date": "June 4, 2013"}, {"Author": "Corina Smith", "ReviewID": "RD3FKSU2KAOOK", "Overall": "2.0", "Content": "and brand new out of the box the charger doesn't work. Hello quality control!! I contacted the manufacturer and they directed me to the website to open a ticket. Hopefully they are speedy with their response time and send a new charger asap. My daughter is pretty bummed that she can't use her new tablet.", "Title": "Just received today...", "Date": "May 3, 2013"}, {"Author": "Therese Haag", "ReviewID": "R3SOKK5WXSES14", "Overall": "1.0", "Content": "it is slow no memory and cannot connect to the internet and is very confusing and slow to work with", "Title": "i hate it", "Date": "May 3, 2013"}, {"Author": "Dave C", "ReviewID": "R2B83878GFSHVF", "Overall": "1.0", "Content": "This is the first review I've ever written on Amazon.  It is also the first time I've had to return a product.  I was really looking forward to having my first tablet and even though I was a bit wary because of the price, I wasn't too concerned since I've always had good luck with electronic devices.  Not this time.  I fully charged the D2 tablet and tried it out as soon as it was charged.  Everything seemed fine for about 1 hour and then I noticed it made a strange noise for an instant.  It continued to work fine so I thought nothing of it.  It got down to about 70% power so I turned it off for the night.  When I turned it on today it seemed fine and I installed a few apps.  Suddenly it started making a strange static/squealing sound.  The volume of this sound would not increase or decrease, even when the volume control was all the way down.  I tried listening to music and a movie using the headphone jack and that worked fine.  When the headphone was plugged in the sound from the speaker stopped.  This sound was really annoying so I decided to do a factory reset.  The sound was still there.  I turned it off and back on and now there is no sound from the speaker at all.  I am obviously returning this tablet tomorrow.", "Title": "Sound stopped after 1 hour of use", "Date": "April 18, 2013"}, {"Author": "Nicole Traas", "ReviewID": "R2BQQVNRETX17A", "Overall": "1.0", "Content": "I bought 2 of these for Christmas for my children and the charging ports broke away within 2 weeks. The company replaced them once and the same thing happened again. They have since started ignoring my requests for assistance. Terrible product with terrible customer service.", "Title": "DO not waste your money", "Date": "June 9, 2014"}, {"Author": "megz", "ReviewID": "R1IW5S7ZS5RJMH", "Overall": "4.0", "Content": "This tablet is a great deal for the money.  It can do many of the same functions as more expensive, comparable devices.There are a few set backs however, it is a bit slow, the camera is awkward (it is positioned to take selfies easily but makes it difficult to take photos or videos of other people/places/things; and it freezes from time to time).That said, it is a very helpful tool that I have used for school, personal, and work related functions.", "Title": "Great deal", "Date": "June 5, 2014"}, {"Author": "Romana", "ReviewID": "R23YAU8BUTP9B5", "Overall": "5.0", "Content": "It's really good, I bought a lot of tablets but this one gets the jobs done this tablet is basically a iPad but a little smaller, and uses Google play instead.", "Title": "IT IS AWESOME!!!!!!!!!!", "Date": "May 13, 2014"}, {"Author": "Len C. Kiel", "ReviewID": "R1NZOW51M7B6O6", "Overall": "2.0", "Content": "this was the least expensive android available on amazon at the time and it had relatively positive reviews, so i purchased it. it worked well for a time, but after a few months it began to have random glitches, including wifi connection issues. after having it a little over a year, the wifi completely ceased functioning. no thanks.", "Title": "you get what you pay for.", "Date": "May 4, 2014"}, {"Author": "Lauren Neal", "ReviewID": "R9HQ7XTPIK747", "Overall": "3.0", "Content": "I purchased this several months ago to look at facebook, internet, and kids games. The reviews said that is was fast and easy to use. It is easy to use, but it is very slow to load. It tends to lock up if you are not patient and hit the screen before it finishes loading (as my 3 yr old does frequently). Netflix takes so long to load that it isn't worth messing with. It now basically sits on the coffee table. My boyfriend's Samsung Galazy Tab 2 7.0 is much faster! I would spend a little more to get a faster tablet.", "Title": "pretty slow", "Date": "April 30, 2014"}, {"Author": "Audrey Wright", "ReviewID": "R3U6P6F8H4XAC", "Overall": "1.0", "Content": "It is just a cheap device,  I guess. I don't think it's Amazon's fault, I think it's the tablet. I would never recommend this.", "Title": "Horrible Tablet", "Date": "March 19, 2014"}, {"Author": "Kelerg", "ReviewID": "R1U2LA6II2ARI5", "Overall": "3.0", "Content": "My kids love it for playing educational and strategy games.  I use it mostly for reading e-books or as a Pandora music player.  Unfortunately it seems too slow to handle using it for email or any other internet functions.", "Title": "Kids love it", "Date": "March 5, 2014"}, {"Author": "J Kurdziel", "ReviewID": "R3NLR70QOS8ABR", "Overall": "1.0", "Content": "this tablet does not hold up well. it tapped the floor on a 2 inch drop from my 8 year olds hand. i was there. i saw it. the screen went berzerk!!! and they wont fix it. he had it for a week. waste of $75! if it says for 4 years and up it should be made for 4 year olds to handle it.", "Title": "never buy for a kid", "Date": "July 5, 2013"}, {"Author": "Thomas J.", "ReviewID": "R2G0P9P9Q83MYY", "Overall": "3.0", "Content": "I bought this tablet for my 8 year old and she likes it. It has some limitations but it is worth $80.", "Title": "Pretty Good", "Date": "July 1, 2013"}, {"Author": "Grandma Reader", "ReviewID": "R3BLEV9ARMUSLI", "Overall": "4.0", "Content": "I bought this and 2 others like it (same brand) for my grandchildren.  I  am glad I found this one on Amazon; wish I had looked here earlier.  Pink ones were all sold out on ShopNBC, so tried Amazon.  They were MUCH less expensive here!!  Kids are getting used to them and they now have wireless at their house, too, so that helps a lot.  They use them mostly for games.  We bought cards to add more space.", "Title": "Bought this for my 9 yr old grandaughter!", "Date": "June 29, 2013"}, {"Author": "J \"J\"", "ReviewID": "R229DDRMFL4FLF", "Overall": "1.0", "Content": "I would recommend against buying anything that hints (ALL Winner) in its features and details. This tablet is garbage and I would strongly advise against purchasing it. It is made by Asian sweat-shop workers in China, and that should speak for itself. You can find a much better tablet on Amazon that would meet or exceed your needs, and that is well within the price range of this tablet in a refurbished or used condition. Or better yet pay a little extra and get something nicer that will bring much quality and durability to your technological needs. I advise against purchasing anything that is grossly under priced compared to the standard mainstream electronic devices.", "Title": "WORST TABLET IN EXSISTENCE", "Date": "June 27, 2013"}, {"Author": "smaj100", "ReviewID": "R3K76XD2HRP2LY", "Overall": "5.0", "Content": "Great little product perfect for smaller kids.  We bought these for our grandaughters, for birthday gifts.  They took to them like they have used one all their life.Wish they had some more or better protective covers..", "Title": "Awesome", "Date": "June 26, 2013"}, {"Author": "sylvia flores", "ReviewID": "R1QXHNDMAQY4EG", "Overall": "5.0", "Content": "i bought this for my granddaughter it surpassed my expectations even my sister-in-law wants one for herself so we'll be making another purchase soon", "Title": "its great", "Date": "June 25, 2013"}, {"Author": "Laura Prado", "ReviewID": "R26ZF1HZ5H5GS1", "Overall": "5.0", "Content": "Everything was super easy.  I received my tablet and it works awesome, my son loves it.  It plays games, movies, and music great.  The download speed is fast too.  For the price this was an awesome purchase.", "Title": "It was great.", "Date": "June 25, 2013"}, {"Author": "Penny", "ReviewID": "RFRGHZ3X1LK3H", "Overall": "4.0", "Content": "Delivered on time.  Does not have all the bells and whistles of an expensive model but can search the internet.  As others have stated you do need patience when you surf the internet but for the price I would recommend it.", "Title": "OK", "Date": "June 24, 2013"}, {"Author": "B. Glaze", "ReviewID": "R1K4Q207KX4LF2", "Overall": "3.0", "Content": "This was a birthday gift for my son's first birthday. I would say that this is a great tablet for a toddler learning to play games.BUT if it was for my teen or myself, It would drive me crazy for the lag it has while on the internet.Don't get me wrong, it plays games very well; perfectly even.", "Title": "Good for little kids", "Date": "June 24, 2013"}, {"Author": "MeMary77", "ReviewID": "R20XOCON7DLWT", "Overall": "5.0", "Content": "Bought this as a gift for my great nephew.  He loves it.  He's 4.  He uses it all the time, and it's been a dream for his parents to keep him entertained.", "Title": "Tablet for child", "Date": "June 20, 2013"}, {"Author": "Andrea Gronich", "ReviewID": "R2F7GLFTREYB88", "Overall": "5.0", "Content": "I bought this for my mom so she could show everyone digital pictures of her grandson. Easy to use, wifi is fairly fast, and the price is great.", "Title": "Easy to use!", "Date": "March 28, 2013"}, {"Author": "Happy mom", "ReviewID": "R2ESBHJATLB2NL", "Overall": "5.0", "Content": "My kids love there D2. They are so happy to be able to play all there friends are talking about and mom loved the price.", "Title": "D2", "Date": "March 27, 2013"}, {"Author": "Susan Garcia", "ReviewID": "R12V76WF1ZEOEN", "Overall": "4.0", "Content": "The tablet overall is a good buy.  Just wish the battery would hold charge longer !!!  Great for kids !", "Title": "Good", "Date": "March 26, 2013"}, {"Author": "lisar915", "ReviewID": "R32HUNEBR9MQI5", "Overall": "4.0", "Content": "I accidentally put this review for the tablet case, which I also like, rather than the tablet itself. So here goes once again.Overall, it's a good tablet. It has Android 4. But there are/were a few issues.First off, I had trouble initially setting up the correct date.  This tablet requires you to touch with the tip of your finger rather than your finger nail.  But even when I used my finger tip, the month screen wasn't responding the first few tries, which I found odd, because I didn't have this issue in other screens.Also, this tablet comes with the 1 Mobile Market app store.  But it's extremely slow and clunky, so much so that I don't bother using it.  The GetJar app store doesn't work on this machine either, which is odd, since it works with my white Pandigital Novel with a much older version of Android. On the other hand, the Amazon app store works nicely, as does the Aptoide app store.Otherwise, I have no other issues.  It's pretty good for the money.", "Title": "A Good Tablet For The Money", "Date": "March 26, 2013"}, {"Author": "Ad Type:   Private/Business: Randy", "ReviewID": "R1B13WDDHL79VX", "Overall": "1.0", "Content": "I normally don't write reviews, but I had to on this one.  Please do not buy this product if you are expecting:1.  A clear, non pixelated screen2.  A product that boots up within a minute3.  A product that does not lock up when switching between applicationsI sent this back and bought a Kindle Fire, and have never been happier with a multimedia product.Thanks!", "Title": "Buy a Kindle Fire!", "Date": "March 25, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R23RCTWCXFXPC6", "Overall": "4.0", "Content": "This is an excellent tablet and works well. However, if you are looking for a tablet with the Google Play Store on it, this isn't it. It does have many nice features and as long as you aren't replacing a tablet that had Google Play you will love it. It comes with quite a few games pre-loaded and was quite responsive.", "Title": "Works well, but not a Google tablet", "Date": "March 25, 2013"}, {"Author": "Chrystal Dixon", "ReviewID": "R36O1BQM8SAIW8", "Overall": "3.0", "Content": "I bought this for my 10 year old daughter, who wanted a pink tablet. I dislike that after purchasing this item the pink faded and the battery won't keep a charge for any length of time.", "Title": "D2 7-Inch Android 4.0/ 4GB/512MB DDR3/16:9 Capacitive Multi-Touch", "Date": "March 24, 2013"}, {"Author": "Ana", "ReviewID": "R1ZCS8PG2NW6KQ", "Overall": "5.0", "Content": "I spent a lot of time looking for a cheap- good cuality tablet and read a lot of reviews and this one has it all. Is  fast, Netflix and you tube  plays perfect, the app store \"mobil1\" is great. The battery works for around 3 hours (is my only complain, but is ok) but you have to charge it as the manual says: 10 hours the first and the second time and Then a few times 5 hours. Make sure  you read very carefully the instructions. I would recomend this tablet 100%.", "Title": "Love it !!!!", "Date": "March 24, 2013"}, {"Author": "Mthrgodis \"The Mthrgodis\"", "ReviewID": "R2W6SQ19K72YDT", "Overall": "2.0", "Content": "I purchased this tablet for my 9yr old grandson.  He had it only a matter of a few days, accidentally dropped in (on carpet) and it no longer works.  For this much money I expected it to be much more durable.  Now I have a very disappointed little boy and not enough money to buy him another.", "Title": "Not durable", "Date": "March 21, 2013"}, {"Author": "hub95-tx", "ReviewID": "R2RDTQINHZ8JD5", "Overall": "5.0", "Content": "Very fast and easy to use. For the price, one can not go wrong with this item. It does everything I expected it to do and more!! Considering cheap tablets like this normally do not even fufill the purpose of surfing the web and using apps because their processor and/or ram is to small, I initially used this as an oversize MP3 but I soon figured that this tablet was capable of more things than just listening to music. I work in retail at best buy, and if I would have to sell this item, I would do so with ease!- Verdict: If you're not trying to spend an unreasonable amount for a kindle fire or an \"over hyped\" IPad.... you CAN NOT go wrong with this Tablet.... extremely satisfy, would recommend this to anybody", "Title": "Newbie", "Date": "March 20, 2013"}, {"Author": "Savanas mom", "ReviewID": "R19SJX8QI1LWLI", "Overall": "5.0", "Content": "I bought a ZTO N1 for my daughter for Christmas - not thru Amazon, but direct from the manufacturer. Total spent with the \"free shipping that won't get here by Christmas but for $30 more it will\" was $148.  They did not send me the right one with dual camera and within 45 days the ZTO had died.  It was going to cost at least $50 to return to even see what the issue was, and I did not have all of the original packaging.....so I started looking at Amazon for other choices.  I found the D2 and ordered it for my daughter for 1/2  the price of the ZTO delivered.  When it arrived, I took the power cord and tried to resurrect the ZTO and by gosh it powered on...grrrrr.  ..but by then my 9 year old daughter had already powered on the D2 and had fallen in love, so I decided to keep. Loved the color, loved the screen (better than the ZTO), loved the games....however its a constant search for new games lol.  I tried unsuccessfully to install Google Play...just doesnt work on this one. But she has found most everything she needs on the 1Mobile Mart app that is preinstalled.  This was by far the best value of all bought (I also bought one for my elderly mom on Ebay - a no name, but her color purple), plus you cannot go wrong purchasing from Amazon.  Unlike the other two I bought that originated in China and Korea with NO customer support unless you threaten to report thru Paypal, you can feel confident that Amazon would stand behind this product if they are selling it.  The other key feature my daughter loves about this one is the rubberized back - it makes it MUCH easier to hold, and I agree.", "Title": "My daughters favorite!", "Date": "March 6, 2013"}, {"Author": "erin hyde", "ReviewID": "R2V475EK7M6JOM", "Overall": "4.0", "Content": "I ordered this tablet because i didn't want to spend a ton of money. It was shipped quickly and arrived nicely packaged. I love this tablet for the kid features it has on it. My kids can play their games and not erase or uninstall anything. Only negative i have is the apps that are already installed on the tablet cannot be uninstalled so it takes up unnecessary space. Overall its a great tablet for the price. I would consider buying one for each of my kids to use.", "Title": "Nice Tablet", "Date": "March 6, 2013"}, {"Author": "andres", "ReviewID": "R310I3W20QKW9G", "Overall": "4.0", "Content": "Es un buen producto practico y permite descargar bastantes aplicaciones, siendo facil de manejar teniendo usos practicos lo recomiendo d", "Title": "exlente", "Date": "March 6, 2013"}, {"Author": "Amy Grimes", "ReviewID": "R18LRMYX4AR4ZV", "Overall": "5.0", "Content": "We just needed something little for our kids.  They love it! It has everything we were looking for in a tablet.", "Title": "Great Product", "Date": "March 5, 2013"}, {"Author": "Melissa Kearney", "ReviewID": "RVF4DZVM7PS33", "Overall": "5.0", "Content": "I purchased this for my 20 yr old son.  I wasn't sure it would have all the bells and whistles to make him happy....  but he absolutely loves it.  If we go anywhere it is always with him.  He keeps it in his pocket for downtime at lunch during his work week.", "Title": "Best Ever", "Date": "March 5, 2013"}, {"Author": "Cyber Shopper", "ReviewID": "RVMJPPM68QRS1", "Overall": "4.0", "Content": "For my 6 year old, this is awesome. Great size, works great. This uses Amazon Apps instead of ITunes, but has about 95% of the same apps. Compared to the high price of the newer Ipod's, this is a great deal and you can't go wrong. The one complaint is that I haven't been able to get the texting apps to work very easily, but what 6 year old needs to text, right?", "Title": "Great item and well worth the price.", "Date": "March 4, 2013"}, {"Author": "V. Harkless \"Proud mama\"", "ReviewID": "RMCWBEZPCQ0AM", "Overall": "5.0", "Content": "My 5 year old loves this tablet. She likes the books that are pre-loaded and angry birds.  It was very easy to navigate even for unsavvy folks like myself. I downloaded Skype for her so she can chat wih family on the east coast.  Picture quality is avaerage but all in all we like this item!", "Title": "My daughter loves this!", "Date": "March 4, 2013"}, {"Author": "dominique", "ReviewID": "R13O9QIA5EUR7K", "Overall": "5.0", "Content": "THE BEST PRODUCT I COULD HAVE BROUGHT FOR MY TODDLER AND SHE LOVE IT. I COMPARE IT TO A KINDLE FIRE AND I BROUGHT THIS PRODUCT AND GOT JUST ABOUT THE SAME THINGS THAT THE KINDLE FIRE OFFER AND WAY MORE EXPENSIVE.", "Title": "LOVE IT", "Date": "March 2, 2013"}, {"Author": "C. Forbes \"lovingbooks\"", "ReviewID": "R22OGKD4429ORZ", "Overall": "4.0", "Content": "I love my D2Pad, the only reason I gave it 4 stars unstead of 5 is because the D2Pad doesn't have GOOGLE PLAY STORE.", "Title": "Love it!!!", "Date": "March 2, 2013"}, {"Author": "Ric", "ReviewID": "R2T3EJCTOB5YBT", "Overall": "4.0", "Content": "Would recommend to others. Only issue is it is a little touchy when working with the touch screen. Well worth the price.", "Title": "Great product", "Date": "February 26, 2013"}, {"Author": "Tammy", "ReviewID": "R3SYARTH4YQ6SF", "Overall": "4.0", "Content": "I would recomend this product to my friends and family.It does run fast and downloads fast.The only problem is that with my sons I am unable to change the year for the date.The date is stuck at 1070.", "Title": "This is a pretty good product", "Date": "February 12, 2013"}, {"Author": "Vephilli", "ReviewID": "R22ZPNUMQAWMN", "Overall": "5.0", "Content": "I ordered this for my daughter who will be 8 years old in April.  I've played around with it myself to see if it was user friendly and as of right now I don't have any complaints.  It's a really good product for the price and I would recommend this if you are looking for a nice tablet for $80. I will give an update after we give it to her for her birthday.", "Title": "So far so good....", "Date": "March 19, 2013"}, {"Author": "Rob Walker", "ReviewID": "R2L55HAR49NJBC", "Overall": "1.0", "Content": "I own a MID 7 inch tablet and mistakenly bought this thing thinking it would be at least as good.. The only thing we can use it for is entertainment for our 7 year old !", "Title": "This isn't nearly as good as it sounds", "Date": "September 11, 2013"}, {"Author": "Greg M", "ReviewID": "R28HY4IRKSTBGA", "Overall": "1.0", "Content": "Buyer BEWARE!! Bought this tablet has a Christmas present in December. In March the power button took a dump, lost its detent, and will no longer press. I have done everything in my power to get it repaired or replaced through Diablotek with no luck at all. I have sent 5 emails to 2 different email addresses and made numerous phone calls to their tech line. I can never get a person the line! It does come with a 1 year parts and labor warranty...at the rate I'm going it will be expired before it get a response back from them. You get what you paid for...at least honor your parts warranty!! Buyer beware!", "Title": "TERRIBLE Diablotek customer service!!!", "Date": "July 5, 2013"}, {"Author": "Robert Moon", "ReviewID": "RT3FA9667IRWE", "Overall": "4.0", "Content": "Never having used a tablet before I am pleasently surprised that this tablet is more than I expected. I consider it a bargain.", "Title": "First Tablet", "Date": "May 4, 2013"}, {"Author": "TruWriter", "ReviewID": "R32FEL6HER15EK", "Overall": "2.0", "Content": "I did not really like it. Maybe it's right for someone else, but not me. It was not what I expected.", "Title": "I did not really like it.", "Date": "April 28, 2013"}, {"Author": "Tarr", "ReviewID": "R1UNXZSIFSDWKH", "Overall": "5.0", "Content": "I bought three of these tablets for my family, mainly for my two little daughters. I am not a fan or a regular user of tablets, but I can tell you they are decent and work well. They are designed mainly for kids and family use. This tablet is recently produced, with good features and affordable price. I am happy with it.", "Title": "happy with it", "Date": "April 4, 2013"}, {"Author": "Renee Worthington", "ReviewID": "R1YS0PVR20HALV", "Overall": "1.0", "Content": "I purchased this for my husband so he could surf the web and keep up on his sports.  After receiving it, I downloaded 5 apps on it. Most of the time, it wouldn't connect to the internet, even if we were standing right next to the modem. After a week of having it, it just wouldn't turn on. We plugged it into the charger overnight, the next morning, it still wouldn't turn on. I had had enough and decided just to return it and go buy a more expensive one. During the week we had it, I think my husband got to use it a total of 3 times because we had so many problems with it. I would suggest, spend a little more and get one that actually works, especially if you plan on using it a lot.", "Title": "Waste of money!", "Date": "March 18, 2013"}, {"Author": "Heather", "ReviewID": "R2UDA4DO8OFE5Y", "Overall": "4.0", "Content": "We bought this for our 2 year old daughter...she is very tech savy. She always wanted my Iphone to watch music videos on youtube. We researched alot of different tabs before we bought this one, we wanted something quality but inexpensive. The 7 inches is the perfect size for her, it has with stood her \"abuse\" so far. The games for kids that comes loaded on it is almost worth the $80 alone. They have toddler/preschool games that teach shapes, colors, numbers, and more! And it will read the preloaded books out loud! Which I also think is pretty cool! We downloaded youtube through moble1. Like other reviewers have said--it is a bit slow-- Mainly the internet, which she doesnt use. The battery life has been great for us! I truely recommend this for a child! It is without a doubt worth the $80 to me.EDIT: After owning this right at a month, I sat it on the arm of the couch, it fell off and cracked the internal screen. I called to see about adding insurance. They were willing to add it for me even though it had been a couple days past the 30 days--but it only covers up to the price of the tab. So for an $80 tab, we decided against it. A few days later, my husband broke the screen further--this time you can feel it when you run your hand over it. Pretty sad my 2 year old wasnt the one that broke it either time. Also, I have found that you can download the barnyard games for free--so you can get that with any tab you buy! The power button became lose, still works--you just have to hit it a time or two before it turns it on/off. I still think this is a great tab for a young child, but maybe not as great as I thought when I initally wrote the review. If I knew my daughter was going to use it as much as she has, I would have bought a more expensive, quality tab to begin with. She defintely got $80+ out of it!", "Title": "Bought this for our daughter...", "Date": "February 20, 2013"}, {"Author": "Marie Austin", "ReviewID": "R2U480T78DTG2G", "Overall": "1.0", "Content": "This \"tablet\" is not worth even half of what I paid for it.  For starters it does not use the Google Play store, so you are stuck with off brand apps.  My son was very disappointed that he couldn't get the same games on his tablet that he plays on our phones.  This I was willing to live with, however the tablet cannot perform up to basic standards.  It frequently freezes, runs extremely slow and unexpectedly closes apps.  After just 6 months of very casual use (due to not having the games he wanted) the charging port stopped working.  We used the other charging port for a couple week and it too stopped working.  We cashed in our Square Trade warranty and got a replacement.  Again, same exact issues, only the pin charging port only lasted a month and the USB port lasted about 5 months.  My son's constant frustration and my hassle with warranty claims is not worth saving some money.  Do yourself a favor & DO NOT BUY this!", "Title": "DO NOT BUY at D2 Tablet!", "Date": "April 17, 2014"}, {"Author": "ebony", "ReviewID": "R3DMTTL7SZED8R", "Overall": "5.0", "Content": "Best book i ever read! its a must read! no lie true fire read! i recommandation. all day long people!", "Title": "best ever read!", "Date": "January 7, 2014"}, {"Author": "Donald", "ReviewID": "RYRY3JOWK03CF", "Overall": "5.0", "Content": "My 6 year old granddaughter would really like this d2 internet tab, but it doesn't work. I sent it back but I would like another pink one.", "Title": "my granddaughter loves pink too.", "Date": "November 26, 2013"}, {"Author": "Eric McLaren", "ReviewID": "R27MDNIEOHN1R", "Overall": "1.0", "Content": "This runs slow as molasses. too many preloaded programs that cant be removed. horrible app store. Overall i wish i hadnt bought it", "Title": "RUNS HORRIBLY SLOW SYSTEM", "Date": "October 22, 2013"}, {"Author": "Ray Renfroe", "ReviewID": "R22Z5LJ8HROF9B", "Overall": "1.0", "Content": "I made a mistake in ordering it, doesn't have a full google play store marketplace so why would you want it and it lags a lot.", "Title": "piece of crap", "Date": "October 15, 2013"}, {"Author": "nique", "ReviewID": "R1F5A9P3APS93Y", "Overall": "2.0", "Content": "my sister got this tablet and she was super excited about it so she charged it all night so she could explore it the following day. When she woke up it was at 70% after 8 hrs of charging,that was the first strike.She have had it for a month now and it as been one issue after another.The charger is too loose,if u barely touch it it stops charging and it loses charge pretty fast.The picture is ok(that's the only plus i c). In no time this tablet will be like a desktop as it will not be able to function without a outlet.OH!!! and it overheats,this happened 3 days after she got it and she nearly had a nervous breakdown when it happened :)", "Title": "It was a disappointment", "Date": "September 28, 2013"}, {"Author": "Christal Love", "ReviewID": "R383M9VOP3HIRM", "Overall": "5.0", "Content": "Electronics are always hard to buy online but this really was a great deal. My kids asked for an ipad but due to expensiveness of them and the fact that they are kids, this was a GREAT alternative. They kids still call them an ipad but they really like to use this especially on the go.Mail was quick and accurate, packaged well also.", "Title": "Great product for KIDS", "Date": "July 10, 2013"}, {"Author": "Carlos Ferreira", "ReviewID": "R2D41S7XEX2M5P", "Overall": "5.0", "Content": "I was looking for a tablet for my kids, a cheap one but not for that reason it had to be poor in quality nor performance. This tablet is a perfect combination of good product for a cheap tablet, better than other options I was finding available in the market. Obviously it can't be pretended to perform as a high class product (Samsumg, Ipad for example), but its performance in wifi capabilities, battery autonomy, processor speed are better than expected for the price. My kids are fascinated with their new gadget.", "Title": "Very good product for the price", "Date": "June 14, 2013"}, {"Author": "old school", "ReviewID": "RQC8CZ2MDMO1G", "Overall": "3.0", "Content": "as always I received the order quickly and it was as stated but the battery had been charged and recharged the wrong way so I assume it was a return from someone else that was reshipped to me. the pad is fine but I only get about 2 hrs. battery time on a full charge and about 45 mins to 1 hr with internet connected even if I'm not visiting any sites.I will probably return it to the manufacturer since it's warrantied.I'm disappointed in Amazons reseller that would reship an order without checking the battery.", "Title": "battery life", "Date": "June 10, 2013"}, {"Author": "Vbennett22", "ReviewID": "R2GHJEGH2E6OTR", "Overall": "5.0", "Content": "To be honest, we haven't spent a lot of time on the internet with this tablet, so I can't rate internet speed fairly.  My 4 year old has spent a lot of time on this tablet though and LOVES it!  We've downloaded several apps on it and it works great.  I was very impressed with everything that came pre-loaded on it - tons of preschool age, educational, fun games.  SHe's playing puzzles, matching, counting, letters games and having fun while learning.  It's pretty easy to navigate and can't be the price for a tablet!  :)", "Title": "Great gift for my 4 year old", "Date": "April 22, 2013"}, {"Author": "C.C.", "ReviewID": "R1D2G7NJBFM8W", "Overall": "3.0", "Content": "I had purchased the pink D2 from Walmart a few months ago for my other child and was very very happy.Many children's games and I added SD card so for a 5 year old it was  perfect. Works on Amazon appstore not Google play, small drawback. I purchased this white D2 for my other child and there are way less games on it for kids and it seems like it is a little slower and will freeze up occasionally which the pink D2 never does that's the reason for the 3 stars.  but for the price it is a good buy. Also doesn't have you tube but you can download tube mate which plays all the YouTube videos.", "Title": "For my child", "Date": "April 18, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00BF9MTMM", "Features": null, "ImgURL": null, "Name": null}}