{"Reviews": [{"Title": "Nice Display!", "Author": "JOHN W. CAPPS", "ReviewID": "RBZ0Q1A6OSM62", "Overall": "4.0", "Content": "I had the tablet for about a month and was pleased. However, By the end of the month i could not get the charger usb to make contact when inserted. Moving it around slightly worked at first and then no connection at all. Unable to charge the tablet. I will RMA it. I suggest if purchased, do not play while charging and the plug may last longer. Therefore I give four stars...", "Date": "October 16, 2013"}, {"Title": "Where is the love", "Author": "barbara", "ReviewID": "R39Y0JNA3Q9PVM", "Overall": "1.0", "Content": "No blue tooth, key pad half types, video recording not the best, battery charging does not last long,expected better after all hype", "Date": "February 21, 2014"}, {"Title": "its slow", "Author": "Simon", "ReviewID": "R3VY15MHZ5TDII", "Overall": "2.0", "Content": "does not except upgrade, after upgrade freeze up, speakers very low barely can hear. has no gps or bluetooth. I like the fact that ithave good resolution and not expensive. On the other hand what you get is nothing compare with what you loose not gettingregular tablet. The fact that its slow to the point that lots of times you think its frozen that really suck. and that with wifi next to your pc. I would wait for some good reviews before you buy this s***. I was hoping more ram and better chip would make it quick but was I wrong! Serve me right for not waiting to know more!  I would really wait before getting something from Europe with no reviews.", "Date": "October 1, 2013"}, {"Title": "sucks", "Author": "Gabriel Tawadros", "ReviewID": "R29BT2IG5NT9SV", "Overall": "1.0", "Content": "this item is a piece of crap and is not nearly as  good as it looks online! Do not buy if you are looking for a high quality product!", "Date": "December 26, 2013"}, {"Title": "Nice service", "Author": "Wendy Tiong Kiu Wen", "ReviewID": "R2KUHONUPELCM9", "Overall": "5.0", "Content": "just received my tablet five minutes ago! love the appearance of the tablet and also the help from the seller!Will try the tablet and review later:-)", "Date": "July 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B6V5Y30"}}