{"Reviews": [{"Author": "Jason", "ReviewID": "R3G63A84IVD6YX", "Overall": "3.0", "Content": "I bought this for my young children and although they can navigate and  play games with easy, and the software pre-installed on the product is quite well suited for a child's experience, I find it lacking in physical durability. The unit has been dropped a few times, which should be expected of a product targeted for children, and each time either the volume or the power buttons shoot out as the casing easy split apart. Although the casing easily snaps back in place, getting the button back in take a bit of work. Also the touch screen seem to have a sensitivity issue especially near the corners of the screen. I have this same issue on two separate FunTabs, it takes multiple attempts to hit the X in the corner to close out of the kids mode. The product is also lacking in Google Play integration for installing apps. You can manually install apps by downloading the apk files but providing Google integration would make this process much more painless.", "Title": "Not as durable as expected", "Date": "July 17, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1MGMC3ZLW5VBE", "Overall": "1.0", "Content": "Got this for my daughter last Christmas and it never worked.  After almost a year, run around after run around, excuse after excuse, I give up.  I am now the proud owner of a useless paperweight and my daughter didn't get a Christmas present.  I wanted to post this to warn others not to waste their money or disappoint their kids. This company should be put out of business!!!", "Title": "Useless paperweight!!!", "Date": "December 3, 2013"}, {"Author": "Randy", "ReviewID": "R2MO8MCO6B7FV8", "Overall": "1.0", "Content": "We bought this product in May and by June it stopped working.  Device overheated and the screen cracked.  Wrote to Ematic for a warranty replacement and they wrote back that if the screen is cracked, they won't warranty it.  I stated that the device cracked from the inside, that it was never dropped and that there's not a mark on the  exterior as proof.  They won't even write back.  Meanwhile we've had three different Leap Frog products for years and they all still work great.  We erred in not going with the proven product that we already know.  We won't buy any more Ematic products.", "Title": "Avoid this Product", "Date": "August 3, 2013"}, {"Author": "Monique L", "ReviewID": "R1RSQOXPWDMLKN", "Overall": "5.0", "Content": "A gift for my grand daughter who is very happy since she received for her birthday. It works very well and several functions. The camera is included the picture quality is beautiful.", "Title": "very nice tablet for kid", "Date": "January 29, 2014"}, {"Author": "jose pelaez", "ReviewID": "R1WEF1FRPX3F81", "Overall": "5.0", "Content": "I LOVE IT. THIS TABLET HAVE A PROGRAM ZOODLES . WITH THIS PROGRAM YOU CAN MANAGER THE GAMES AND VIDEOS THAT YOUR CHILD PLAY OR SEE ACORDING TO HIS AGE. AND YOU HAVE WEEKLY REPORT OF THE PROGRESS OF YOUR CHILD.", "Title": "I LOVE IT", "Date": "January 27, 2014"}, {"Author": "K Vosburg", "ReviewID": "R2OH7IXPH43CMG", "Overall": "1.0", "Content": "Broke very quickly not very durable.  Thankfully I purchased the extra warranty and was able to return it. The end.", "Title": "Avoid this product", "Date": "November 26, 2013"}, {"Author": "Jhon", "ReviewID": "R1QEV9GZ1IJLPP", "Overall": "1.0", "Content": "const: only 1 hours drive well, then came a white LINE middle of the screen, usb connector very fragilevery fragile housing. I have to pay more to return to the manufacturer, the customer ensures determine whether ora new delivery. very short battery life if discharged applications.good: good resolution camera, good apps factory brings bad that some are only test.manufacturer should improve protecion against falls and bumps, also improve the connectorsProduct'm disappointed.", "Title": "I'm disappointed Manufacturer", "Date": "August 29, 2013"}, {"Author": "Brntptrs", "ReviewID": "R298U8CJ3TMQ0W", "Overall": "3.0", "Content": "This tablet is ok, but would be great if YouTube and Netflix worked on it. Maybe Ematic can come up with an update that will allow this.", "Title": "Ematic FunTab 7.0 inch 4GB tablet", "Date": "August 26, 2013"}, {"Author": "kjd6541", "ReviewID": "R32YGLXC4X2S6K", "Overall": "1.0", "Content": "I apparently was sent the product in the the wrong version and could not get the games on it - had to return it.  My granddaughter was so disappointed.", "Title": "Item did not work", "Date": "June 26, 2013"}, {"Author": "G. francis \"honest hope\"", "ReviewID": "R3KO1LEA86OP73", "Overall": "4.0", "Content": "bought for my 5 yr old ......good battery life...front and back camera..great appps...also good resolution....kids progress report...easy to download other appps", "Title": "fabulous kid tab", "Date": "May 27, 2014"}], "ProductInfo": {"Price": "$71.99", "ProductID": "B00BT8V286", "Features": "Android 4.1, Jelly Bean\nA8 1.2 GHz\n4 GB Flash Memory, 0.5 GB RAM Memory\n0.73 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/51AHj0wqZiL._SX300_.jpg", "Name": "Ematic FunTab FTABCP-2 7.0-Inch 4GB Tablet (Pink)"}}