{"Reviews": [{"Author": "J. OGrady", "ReviewID": "R1FHJVOFS6MKKR", "Overall": "5.0", "Content": "I purchased this model with 12 GBs of memory, the max you can get.  I wanted to be able to run Hyper-V images on it, so I could leave my big Honk'in Elitebook 8560W at home, and take this computer on business trips.  I need to run 2 virtual servers at the same time, one with AD and SQL, another with SharePoint 2010.  This machine was able to do that without any performance differences relative to my Elitebook 8560W, while weighing about a 1/3 less (if you include the power adapters).  It also makes a great touch screen windows 8 computer/tablet.  The Ethernet adapter, 2 USB ports, displayport, and microSD slot is rare for this types of computer. I also have the docking station that adds 4 USB ports and a VGA adapter.  This computer can do it all, I'm very happy with it.", "Title": "A PC, a tablet, a server", "Date": "May 24, 2013"}, {"Author": "D-Jack", "ReviewID": "RBPP14007AJM4", "Overall": "5.0", "Content": "I was issued an Elitebook 810 G1 for work. At first I was sceptical but I have come to LOVE this little ultrabook tablet. I have the I5 model and threw 8GB of RAM in it. I work IT for a large healthcare organization and am constantly on the go. I left the pre installed Windows 8 PRO on it for now and I find its the first tablet PC I have ever touched with a touchscreen worth using. Its literally like using a high end tablet or cell phone screen. The battery life is Great. I can be out all day working tickets with WIFI on and still have some battery to spare. The backlit Keyboard is really nice and the touchpad works very good after getting use to its gestures. I have purchased a Docking station for this unit and have completely replaced my Desktop PC with this as its just as responsive and speedy feeling with its I5 processor 8 gigs of ram and Solid state hard drive.If you are considering one of these and haven't liked HP docks in the past this one is completely different and one of the nicest Docks I have ever used. It just sits down and the plug slides into the side of the notebook with a simple push of a button. No more aligning up the bottom with the dock port.Aside: I was recently sent out of town for work for over a week and needed to get some gaming in during my down time and It plays World of Warcraft Very smoothly on \"good\" settings. Was even to get my raids in :)", "Title": "Great for mobile users", "Date": "August 12, 2013"}, {"Author": "Dmitriy A. Ivanov", "ReviewID": "R2UTOD2V658ZJ", "Overall": "4.0", "Content": "This is a solid five star design, super comfortable, fast (editing photos), great keyboard, overall has a really MacBook feel to it.Cons (possibly specific to my unit): 1) the fan runs all the time! Of course, that's noisy and irritating and leads to 2) battery life is about 4 hours.", "Title": "Great design, but fan runs all the time", "Date": "August 28, 2013"}, {"Author": "Gilbert Swain", "ReviewID": "R2FJM2Q4ZNBLQG", "Overall": "5.0", "Content": "fast..very easy to show customers what you are talking about  which is why I bought it..the touch screen make presentations a snap....love this tablet, notebook", "Title": "It's great laptop", "Date": "July 7, 2013"}, {"Author": "Mahmoud B.", "ReviewID": "R39OSO26MU1UN1", "Overall": "2.0", "Content": "Well, I bought this machine since last November 2013, after almost 3 months now, I can tell what would be a real experienceI got this machine to help me in business as an engineer with frequent traveling, I expected it to replace my samsung note 10.1, and my last HP pavilion with one machine that works as a PC/Tablet on the go.- Problem started with the very bad battery life (max 4 hours), which will not be sufficient for a long travel for sure- the heat from left side could really burn your fingers after one normal working hour- surprised not to have the digitizer pen from HP, as it was part of it's announcement, then don't expect to write, it didn't replace my samsung note. and when you get the pen don't expect it do much compared to other styluses in the market with samsung, and lenovo x 230- coming to the resolution which is not good enough for business work with a max 1366x768 (which means that working with some applications like AutoCAD would really be a problem).on the other hand- I liked very much the monitor swivel technique, however, HP still need to adjust the switching between tablet/PC mode, which have a lot to be done, for example; the pop up keyboard does not appear in places you expect it !- this is a good start of a light business use, like business meetings, where yo u might also have some constraints specially with the lack of display port (only has the mini display port, so you need convertors to connect to data show and other terminals)finallyI used to have HP laptops long time back, that was a bad experience specially with this high price. when going to HP customer support you feel like the HP guys are also lost about their machine as well. this machine lacks a lot of adjustment to be a real competitive ultrabook.", "Title": "A machine that lacks a lot issues to be OK", "Date": "February 4, 2014"}], "ProductInfo": {"Price": "$1,464.00", "ProductID": "B00BNHOQFY", "Features": "HP EliteBook Revolve 810 G1 Tablet - 11.6\" - Core", "ImgURL": "http://ecx.images-amazon.com/images/I/51Ye5dwN5XL._SY300_.jpg", "Name": "HP EliteBook Revolve D3K51UT 11.6 inch Tablet PC - Wi-Fi - Intel Core i5 i5-3437U 1.90 GHz - LED Backlight"}}