{"Reviews": [{"Author": "Dej", "ReviewID": "R2E1EOXVDOLSW9", "Overall": "3.0", "Content": "It's put out by Mach Speed, and has a resistive touch screen. Operating system is Ice Cream Sandwich. Built-in memory is 4GB, expandable to 32GB with a Micro SD Card. You might have about 2GB usable storage once you subtract the OS from the original 4GB memory. Processor is supposed to be 1.2 GHz with 512MB DDR3 (check it, because mine didn't match). The battery charge lasts up to around 6 hours depending on what you're doing, and it charges quickly with either a wall charger or a usb cable - both are included. It looks and feels like it's all plastic, and is a dust and fingerprint magnet.That said, it actually works pretty well once you calibrate the touch screen. I had to run the calibration 4 times before it was responsive enough to be really usable. If you're used to a resistive screen you won't have a problem, but if you're used to a capacitive touch screen you'll feel like you've stepped back in time.It doesn't have the Google Play Store. I've installed the Amazon App Store. It plays videos well, and works good as an e-book reader. You can read library books through Overdrive, epubs and Kindle. You can, also, play YouTube videos. I've played word games on it, but you might have a problem if you want to play games that require a lot of finger and screen movements. The built-in speakers aren't very loud, headphones are a little better.I was actually looking for a color e-reader and found this tablet for less. I didn't pay the list price, and wouldn't. You can get a better tablet with a capacitive screen for the list price. Overall, I'm enjoying it for what it is, but I don't really recommend it.", "Title": "Okay for what it is...", "Date": "April 21, 2013"}, {"Author": "Magistra", "ReviewID": "R27YJZKSJ14YQP", "Overall": "4.0", "Content": "So far, so good: bought this baby tablet as an alternative to travelling with a laptop when I know there will be wifi access and as an alternative to cranky kids when sharing isn't working.  The setup was really simple,  and the apps available from Amazon,  google play and other sources have been entertaining and informative-  so far a dozen games and twice as many e-books.  Email is pretty darn slow but web surfing isn't too bad.  Haven't used the music player yet but kids report YouTube (etc) viewing is fine. Touch screen needs a harder tap than on my Galaxy tablet, with a stylus or capped pen,  but at about 20% of the cost I'm not quibbling.  With a backup external battery pack it should be great for plane trips, and I've found a few map apps that should help keep me from getting lost. .  .much. . . If you're looking for a more powerful machine,  this isn't it,  and it does feel rather toy-like.  Worth a try!", "Title": "GREAT as a second tablet for reading and games, especially for travel", "Date": "May 3, 2013"}, {"Author": "sheila", "ReviewID": "R3ZXQU25ZYY5T", "Overall": "5.0", "Content": "I ordered this tablet for my daughters b'day, and she hasn't put it down and she takes it everywhere, so I think it is safe to say she loves it.", "Title": "tablet", "Date": "March 30, 2013"}, {"Author": "T. root \"DeadMouse\"", "ReviewID": "R2Y8A1JKASSPL5", "Overall": "5.0", "Content": "People Complain Too Much,I Got it And Love ItI Even Use It In My Divorce And Custody CaseI Play House Of The Dead,Rage Of Gladiators On It,Yeah Its Aim LET GO Then Shoot..Just Think Of It As \"Hot Potato And Move OnIt Now Has All Google Crap On It..Here Is What I Did To Get This To Work..You Can Just Google Google For The .apk'si got the tablet and :Installed GoogleServicesFramework.apkRebooted With Paper ClipInstalled Vending.apkReBooted With Paper ClipInstalled Gplay3.8.17.apkPaper Clip RebootedNow I Have Google PlayUsed Files Found For \"Google Play On Kendal Fire Hd\"DeadMouseI Give The Tablet A 5...Just Needs People Who Know What They Are Doing To Help The Rest...", "Title": "Google Play On It Just Fine,Plays Everything", "Date": "May 12, 2013"}, {"Author": "chris pryor", "ReviewID": "R2AWI3LKFWCE0T", "Overall": "1.0", "Content": "THe screen is unusable.  You tap on an Icon another one will launch maybe.  If you type any text it might type out half of what you typed.  BAD BAD BAD>", "Title": "Cannot stand it", "Date": "May 9, 2013"}, {"Author": "Tim", "ReviewID": "R3SD0J21HUPDRB", "Overall": "3.0", "Content": "It does the job, nothing fancy, simple but slow. Easy to use. Not worried about the kids breaking it at that price.", "Title": "You get what you pay for", "Date": "June 12, 2013"}, {"Author": "Susan", "ReviewID": "R2RTHIRDL1MB91", "Overall": "3.0", "Content": "I got this inexpensive tablet to use in the kitchen as a family calendar so that we can sync all of our device calendars together and get rid of the wall calendar. We're an ipad/ipod family, so this took some getting used to. It works, but I'm glad I didn't spend very much on it because the screen is not very sensitive and we often have to touch on things multiple times before the tablet reacts. I didn't realize that I wasn't going to easily be able to sync my outlook calendar w/this like I do on my ipad, so I ended up moving my family calendar to google calendar. We basically use this tablet to check the calendar, but we use our other devices to add events since the screen reaction time is frustrating.", "Title": "OK, but screen isn't sensitive enough", "Date": "June 5, 2013"}, {"Author": "cami1969", "ReviewID": "R3PZ9DYK8YE4H1", "Overall": "4.0", "Content": "It's a little slow but it's a great tablet for the price.  I'd recommend it to my friends and family", "Title": "Great item for the price!", "Date": "June 9, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RXQ1E9LG2OLH7", "Overall": "1.0", "Content": "tried to return product, company would not accept return..cannot turn on unless it is connected to power source, and this is after battery has been fully charge over eight hours. i will never purchase anything from good connections again", "Title": "hated product company would not accept return.", "Date": "May 17, 2013"}, {"Author": "Lori G.", "ReviewID": "R2QOMBT22FFUUY", "Overall": "3.0", "Content": "It's a cheaper tablet. It functions as expected. I read other reviews before purchasing so I new calibrating the screen would have to be done otherwise the system is pretty much inoperable. Also as in other review the sound quality is not the best without headphones. But I knew all this before purchasing it. I got it for my husband to use basically as a backup so he can carry it around without being out much money if it gets broken or stolen. For that purpose it works fine. He can play games and read. He is happy with it.", "Title": "Tablet", "Date": "June 25, 2013"}, {"Author": "siearah", "ReviewID": "RO8SBWYMT9L0J", "Overall": "2.0", "Content": "i got this for my little and its crap!!! She cant download apps or anything and it was a total waste of money. now she likes to use it but i wouldnt have bought if i knew these things!!!! hint people read all the reviews before buying an item. at least she like it to go on youtube but till than its slow and annoying.", "Title": "read all the reviews including mine", "Date": "November 29, 2013"}, {"Author": "Pen Name", "ReviewID": "R3F2YAIEZE2X5M", "Overall": "1.0", "Content": "I cant even use it is no working and cant turn it on...fix it will cost me more than d purchase.", "Title": "people dont buy this!!!", "Date": "June 6, 2013"}, {"Author": "mylidiag", "ReviewID": "R19095VLNKPMV", "Overall": "1.0", "Content": "Worst gadget I've ever bought. Total waste of time, money, and effort. Doesn't connect to the internet at times. Only one speaker works. Terrible product", "Title": "Horrible", "Date": "May 31, 2013"}, {"Author": "Heather H.", "ReviewID": "R3PUPK3SU79534", "Overall": "1.0", "Content": "I bought both of my kids one like this but I regret it! I had to download apps on my computer put them on a sd drive and then transfer them to the tablet, the screen is unbelievably horrible it don't pick up nothing you press my son broke his screen the first day and I bought the 2 year warranty but they said that don't cover it!! I am so upset bc now I have to buy more tablets for them this year instead of something we else they would want. I am very disappointed", "Title": "do not buy", "Date": "November 11, 2013"}, {"Author": "MamaJessie", "ReviewID": "R1YBPBX2E07EIV", "Overall": "2.0", "Content": "My daughter loved this.  Until she dropped it once.  It is now unusable and cannot seem to find a replacement screen.", "Title": "Functional but flimsy", "Date": "February 14, 2013"}, {"Author": "IAMTY", "ReviewID": "R16Y4QUIP4IU6K", "Overall": "1.0", "Content": "Was worthless a complete waist of time, the product ran slow and it was very hard to open up newly downloaded apps", "Title": "Worst product ever", "Date": "September 12, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00B0ZGYLS", "Features": null, "ImgURL": null, "Name": null}}