{"Reviews": [{"Title": "Surface Pro", "Author": "MXJ", "ReviewID": "RREFHNR1L87VU", "Overall": "5.0", "Content": "Before the Surface Pro, I owned a MacBook Pro for almost 7 years. Before that I had an HP desktop for about 6 years. So it was time to get something new, and I spent roughly 4 months researching every new computer until I settled on the Surface.I do not understand the constant comparison of the Surface Pro to the iPad and MacBook Air. Why not compare it to a PS3, or a Toyota Prius. They are not in the same category, and someone who is in the market for an iPad is not in the market for the Surface. I would not even consider buying an iPad, thus I am in the Surface's demographic. Honestly, though, I feel like the Acer Iconia W700 is a better all-around deal, but I simply could not find one in a three month long search after its release. They are both excellent and remarkably similar devices, the Acer is just cheaper and you get more included in the box. But since I could not get my hands on one, here I am with a shiny new Surface Pro, and I am perfectly content with it.BODYThe Surface looks great. It is definitely a well-made device, and you can tell a lot of thought went into every detail. It may be heavy compared to a Kindle, but to me it feels like a computer should. If this is too heavy for you, then you probably need to go to the gym more. In landscape mode, the Surface is short and fat, which works well for some programs, and not so much for others. In portrait mode, it's long and narrow. Again, sometimes this is good, and sometimes not. The material feels smooth and high quality. However, when you are holding up a $1000 tablet, that smoothness is a bit unnerving. I'd recommend a case if you're going to be carrying it around a lot.PRODUCTIVITYThis is what you buy a PC for. I immediately loaded MATLAB, started my Office 365 trial, set up all my email accounts, and got to work. I've pushed this thing pretty hard; having simultaneous programs running doesn't even make it flinch. I've had multiple downloads going, Netflix streaming HD movies, and MATLAB and Excel running all at once, and I didn't notice any significant lag. Working on the small screen takes some getting used to, especially for coding or spreadsheets, but the fact that it's even possible on a tablet is impressive. The Surface won't be replacing your 32 GB RAM desktop power-horse work station, but it can generally get the job done.GAMINGThis is not a gaming PC. They make gaming PC's, specifically for that purpose. There are even standalone consoles that do nothing but play high end games. All that said, right after Office I loaded up Steam and did some gaming. No, the Surface is not a portable Xbox replacement, but you definitely can play some decent mid-core level games on it. Here is a list of what I've played so far:Portal 2Dead Space 2Half LifeSuper Meat BoyBraidFar Cry 2LimboI've even heard games like Skyrim will run just fine, though I haven't tried yet. I'll update this list as I test out more games, but you can probably get a good idea of what this machine is capable of already.SCREENIt is small. The resolution is very high. As others have mentioned, this makes things on the desktop very small, and navigating at a 100% viewing level is challenging, to say the least. It's a gorgeous screen, extremely bright, and beautiful to look at. But working in the traditional Windows desktop mode is difficult. You can work around this in most programs by increasing the view, but not everything has been optimized for the Surface yet, and sometimes you have to choose between either a tiny screen or blurry text.The touch functions of Windows 8 work great. I love all of the swipe gestures, and coming from a Windows Phone, they are not too hard to learn. The pen is fun and remarkably useful. It makes an excellent alternative to the track pad, and is good enough to even recognize my sloppy cursive hand writing. Not sure it's going to replace hand writing in a notebook, but it's a fun option. If you need to include complicated equations in word documents, the pen sure beats typing them out. Once more programs are optimized for touch, it will only get better.BATTERY LIFE / FAN / STORAGE / APPSThese are the big negatives I've read about most. I haven't timed the battery life yet, but I've used it a bunch of times while unplugged and have not found myself running to a power outlet because the battery drained out. I've been working this thing pretty hard, and the battery has not seemed at all unreasonable, though like with anything, it could probably be better.Like I've said, I haven't been easy on the Surface, and I have yet to get the fans running. It does get warm, and you can feel a slight breeze of hot air coming from the side vents, but I still haven't triggered the fans. Not sure what I have to do to get them going, I'm hoping they aren't broken.I had 89.4 GB of free space right out of the box. I have yet to uninstall anything, or remove the recovery partition, but I'd estimate that once I do I'll have an extra 12 or so GB's of space, plus 64 from an SD card, and pretty much an infinite amount from USB drives. For my purposes I don't think I will ever need more than the original 90-ish GB.I don't even understand the app argument. Maybe for Windows Phones, or the Surface RT, but with the Pro you have access to literally the entire software world. I don't need a 99 cent photo editing app, I have Adobe Photoshop. I don't need some Angry Birds type of game, I have Skyrim and Black Ops. Not sure how apps even got into the argument against Surface.KEYBOARDThough the type cover isn't technically part of the Surface, I feel it is worth mentioning. The Surface isn't exactly \"bricked\" without a keyboard, but I find it hard to imagine getting any real work done without one. The smaller size and form factor take some getting used to, but I have had no problems typing with it, and all the old Windows shortcuts work fine on it. It is a bit flimsy, probably because it's so thin, and it feels kind of cheap. It works great, I just wanted a little more for over a hundred dollars. The track pad, however, is awful. Mac definitely has the market on track pads, and this one does not live up to that standard. Even with the help of the touch screen and pen, sometimes you just need the traditional point-and-click of a mouse. For that reason, I'd highly recommend getting a separate Bluetooth mouse to go along with the type cover. And don't forget, this is a full-blown Windows PC with Bluetooth and USB, so you can get any keyboard you want to work with your Surface, not just Microsoft's.CLOSING NOTESMy one big problem with the Surface is the lack of ports. I would love to have just one more USB 3.0 port. The cameras on here are awful, as they are with any tablet, and I would have gladly taken the option to not have any if it meant getting another port.Microsoft knows how to make good hardware, and how to inject themselves into a crowded market, as we have all seen with the Xbox. I'm a little bit nervous of a \"red ring of death\" scenario, but so far the tablet is everything I was looking for. There are still some compatibility issues, such as Kindle not working with text books, but that is a Windows 8/Amazon problem.All in all, I'm very happy with the Surface Pro. Hope this was helpful, please ask if there's anything else you'd like to know.", "Date": "February 15, 2013"}, {"Title": "Its becoming my daily computing device for everything", "Author": "bronzefury", "ReviewID": "R1WD1IOU46L1ET", "Overall": "5.0", "Content": "My wife bought me the MS Surface Pro 128G from Microsoft online store as a gift and I received it on 3/1.  It took me a long time to decide whether I wanted this or not.  Practically speaking, I could have gone through tech life without a Surface Pro but something lured me to it.  Now that I have it, I have to say that this is the best computing device I've ever had.  It is becoming my computing device for everything (and then some).  It is becoming my daily driver.When I say everything I mean that...1. It can be used as a Desktop replacementI just connect the Surface Pro to a large monitor via a DisplayPort-to-VGA adapter.  Since I don't have a Bluetooth keyboard and Bluetooth mouse, I connect the keyboard to the Surface Pro's USB port and the mouse to the USB port on my keyboard.  The Surface Pro drives 1920x1080 resolution.  Since it uses Windows 8, it runs all the programs that I use on a day-to-day basis.The CPU, RAM, and storage are great for most of my needs.  I've already loaded Quicken, MS Office Suite, VPN, StarCraft 2, NXClient, etc. and have a lot of room to spare.  RAM usage is usually sitting at 2 GB or below running 11 software applications at once because Windows 8 Memory Management has been improved significantly.  Don't believe me on the Memory Management stuff?  Then, check it out on Developing Windows 8 blogs.2. It can be used as a LaptopIt is small and light.  At first I thought the 10.6\" screen is too small (since I do a lot of programming).  But now, I've gotten used to it and realize that size is just right.  (Ofcourse, if I really want to do programming work with a big screen I hook the Surface Pro up to a large monitor - the one I have at the office or the one I have at home (see #1 above)).  As a laptop replacement, this is when I use the Type keyboard/cover the most.  When I just want to be computing somewhere other than at my desk (home or office).  If I need to go to a conference room, in my breakfast nook, in front of the TV, etc..Don't believe some of the reviews, it doesn't get hot at all and its fine on my lap.  If I'm sitting on a couch and I want the view the screen at a different angle, I just fold back the kickstand and put a pillow behind it or I just put the Surface Pro farther back down my legs.In addition, Window 8 provides many options to lower the Surface Pro's power consumption.  A lot of early reviewers never touched on this.  I created a custom power saving profile and I can get many hours of use without having to look for a power outlet.3. It can be used as a TabletIf I want to read my Kindle books, PDFs, word docs,.. it is just as easy and enjoyable.  I can also watch Netflix on this thing as the display is very high quality.  Touch navigation is really great especially running with Windows 8 with Metro/Modern UI applications - Mail, IE10, OneNote, Office 365, etc.. all have touch capabilities.  And, again, with custom power profile, battery usage lasts a lot longer.When I say \"More\", I mean that:1. I can use a stylus to jot down notes, draw diagrams, solve problems, without having scribbles of notes and paper everywhere.  Its all in OneNote.  I can also jot notes or questions on Office365 PowerPoint slides.  Let me say that again if it wasn't clear.  I can highlight, jot notes or write questions directly on the PowerPoint slides using the stylus!2. It can do handwriting recognition.  Basically, you write something on the pop-up writer thing (don't really know what it is called), you write something with your stylus, then Surface Pro will convert it to typed text.  This is useful if you want your written words to be searchable.3. The pen can be used as a mouse, but I prefer to use my fingers most of the time.4. Then there is SkyDrive...  your data accessible from anywhere.. but all Windows 8 computers provide that.. so that isn't unique to Surface Pro..All in all, it has the power to run desktop applications, portable as a laptop, and great for tablet use.  As I said, this is fast becoming my daily driver.", "Date": "March 5, 2013"}, {"Title": "Beware of Price Gouging", "Author": "Aeon", "ReviewID": "R2R0ZO8C34NRYC", "Overall": "5.0", "Content": "I purchased mine in my local Microsoft store and here are some initial impressions:Pros:+Build quality is magnificent+The LCD (PLS apparently) is bonded together with the Wacom digitizer, this provides an extremely crisp image verses traditional digitizers that are on top of the LCD panel, reducing light and adding glare.+Nearly inaudibleCons:-The battery life isn't great-Mine had some minor light bleed at the sides of the LCD panel. This is normal and happens in 99% of the IPS/PLS panels I've seen.-The digitizer is GLUED SHUT into the frame. The built in MSATA 64GB SSD is still replaceable however.-No wintab drivers as of yet (No pressure sensitivity on programs such as Photoshop)I should also note that the MSRP of the 64GB is only $899, and the 128GB being $999.To my \"surprise\" marketplace sellers on Amazon are price gouging by $100 to $300 over the MSRP. Supply and demand at work I guess. But you can lend a hand and lower the demand by purchasing it elsewhere. If saving $100+ is not a great incentive then I should note that you also get full warranty from retail outlets versus ZERO warranty from these individual sellers/drop shippers.", "Date": "February 15, 2013"}, {"Title": "Much better than some of the Reviews", "Author": "Daniel D. Feinberg", "ReviewID": "RLGL6ZVOPVUIM", "Overall": "5.0", "Content": "O picked one up last weekend. It is a full blown computer in tablet format. I have had other tablets but they were so limited, this one is not.Be aware that the storage space is better than some of the Apple Centric reviewers say. Included in the drive is a full copy of Office 2013. You do have to buy a license but it is already on the drive. Also there is a full back up image.The battery life is a little low for a tablet, I am getting about 5 1/2 hours but that is of constant use.The screen resolution is amazing, I think better than the iPad which is also excellent resolution.So far there is nothing that it will not do. It is not a high powered desktop replacement but when I am out of my office it does everything I ask. My notebook now sits on my nightstand and is used there. I carry the Surface Pro everywhere.The prices quoted here on Amazon are very high, check the retail price before you pay a premium.The Microsoft store I went to last weekend sold out a pile of them (literally a pyramid) in about three hours but they say that more are on the way.If you want a no compromise tablet that will not make you miss having a real computer with you I highly recommend this unit.", "Date": "February 14, 2013"}, {"Title": "Without compare! Very close to one-device nirvana, even for a power user", "Author": "B. Hill", "ReviewID": "R3CDGYGM8QK32S", "Overall": "5.0", "Content": "I do a lot of web development and graphic design work, as well as financial reporting and general writing. I'm on the web constantly. I've tried iOS, I carried an Android tablet for a while, and I've been using a nice Win8 laptop with a super-fast SSD drive and 8GB of RAM for the past 6 months.My goal was simple: can I ditch the tablet and laptop, and get 1 device to really support all of my needs?The Surface Pro delivers in a near-perfect way.I travel from desk-to-desk; the only time I'm on battery is for occasional meetings or short day trips. I'm never more than a few hours without access to a plug.  Yes I'd love to see better battery life, but that complaint doesn't really impact my personal situation.I use a large 2nd monitor, and contrary to what I feared from other reviews, the TEXT LOOKS GREAT AND MONITOR SCALING HAS NOT BEEN A PROBLEM.PROS:- system is highly portable- it runs ALL apps and software. The first time I connected to my work VPN, connected to SQL server, and remote desktops, all from a tablet-sized machine? AWE. SOME.- type cover is great, I can type full speed with no problem- USB port means that any peripheral works great; I normally use either a mouse or a USB hub for extra devices- everyone comments that the screen looks brilliant and crisp- I have never heard any fan noise at all, the thing is completely silent- I set up multiple user accounts for my kids, with Family Safety turned on.  One tablet not just for my needs, but it also works well with my kids- The C drive has 118GB of usable space. This is after I created an external recovery drive (on a microSD card), which allowed me to delete the recovery partition that ships with the device.CONS:- would love 1 extra USB 3 port- extra power supply (which I did buy) is too expensive- needs about a 1-week learning/comfort curve for anyone who is new to Windows 8. I've now trained a handful of average users who have moved over from Windows 7. They all love it, after the initial hurdle.In summary, buy this device! It is without compare.", "Date": "February 16, 2013"}, {"Title": "Technophile Who Owns 15 Tablets - I know my stuff", "Author": "Finny", "ReviewID": "R3953FM6FAMBXG", "Overall": "5.0", "Content": "I am a programmer, and own several devices, which I use for testing purposes.  I purchased an iPad on the day it was released so that I could program for it.  I was impressed, and found myself carrying it with me everywhere I went.When Google released Honeycomb I purchased the first Honeycomb Tablet, the Xoom, on the day it was launched.  Android took tablets to a whole new level, far above and beyond what the iPad was, or could do.  I still like my iPads, but I rarely carry one of them with me, because they are so underpowered.I instead would usually have one of my Androids.  I have a Xoom, a couple of Galaxy Tabs, a Transformer, a Transformer Prime, a Xyboard, and a handfull of Kindle Fires.  Most recently I found myself using the Xyboard for my day to day stuff, as it is slim, small enough for my pant pockets, and super powerful.  I also frequently carried the Transformer Prime with me, as it is a phenomenal tablet.What about the Surface Pro?Now that I have had it for a few months, and used it for several hundred hours, I think that I am in a position to make a fair and unbiased review.I still like both Apple and Android, but just as Android is heads and shoulders above iOS, so to is Window 8 heads and shoulders above Android.  I have found that when I need to go out, I pick up the Surface Pro, rather than one of my other many available devices.I personally find that I like the Windows 8 interface.  It is intuitive, and beautiful.  When I go back to a windows 7 computer, it takes me a few minutes to adjust, and I am slower.  I know Windows 8 has had some bad reviews, but personally I find that I love it.  I think the bad reviews mostly stem from the fact that people don't like change.I love being able to run photoshop, dreamweaver, Flash, Final Cut Pro, Sony Vegas, among several others on my tablet.  By downloading and intalling bluestack I am also able to run all my multitude of Android apps.To be clear, I like both Apple and Android products.  They serve a purpose.  But a Windows Tablet is simply better.  A more powerful, more capable, more fully developed, richer overall experience.eIf all you want is a basic device with a very simple web browser and with email capability, go with Apple.  It is user friendly, and designed for a very young audience.  If you need a full featured web browser that can handle all modern day websites, and if you need the ability to run powerful business software, go with Android.  Likewise if you want the ability to play more advanced gaming.If you need a full computer, such as to run proprietary windows software, but you still prefer a tablet (such as me) if you want the most powerful device possible, go with the Surface Pro, or other similar Windows 8 devices.--I should not that it is not all roses with the Surface Pro.  The battery life is abysmal.", "Date": "April 28, 2013"}, {"Title": "Not Quite a Tablet", "Author": "Gearard LeFore", "ReviewID": "R2JOUK8CE7U3BD", "Overall": "3.0", "Content": "Purchased the Microsoft Surface Pro from Best Buy as an alternative to an iPad and was very impressed.  Great display, super fast and well made product.  The processor is lightning fast, multi-tasking easy/fluid and Windows 8 has been a pleasant experience.  Did not have any problems with heat and did not find the tablet too heavy compared to an iPad - the stand definitely helps with this.  From a productivity standpoint, this tablet can replace an iPad/computer combo if used in conjunction with a keyboard however, what this tablet cannot do is be a true tablet. The battery life is laughable, on a good day I would get 3-3.5 hours with the brightness all the way down, processor at a maximum of 50% and without any heavy usage.  After a full night charge, I would browse my emails in the morning and within 30 minutes my battery was already in the 80% range.  The only apps running were Mail, IE 10 and maybe even Slacker Radio.  Given that these are all Metro apps, one would think that the power usage would be minimal.  Even worse, was how the battery would drain while multi-tasking between One-Note and Kindle.  I do not understand why this tablet drains battery at such an alarming rate.  I found myself looking for any power outlet throughout the day to ensure I had enough juice to run this tablet, for this reason, the tablet was not for me.  I owned the product since 2/28 and conditioned the battery on several occasions, even played with the power consumption options to ensure longevity - neither of these options worked.  If it were not for the poor battery life, I would have given this tablet 5 stars however, given the fact that it is not truly portable, I returned it to Best Buy and replaced it with the Samsung Ativ 700t - this tablet is amazing!!!  I have been on it all day - Slacker radio for 2 straight hours, web browsing, email, taking photos, selling stuff on Craigslist, using the keyboard (writing this review using it right now) and my battery is only at 39% (2 hours 37 minutes remaining).  This is truly amazing given this tablet is 11.6 inches and has the same internal specs as the Surface Pro.  At this point, this may have been on my second charge of the day with the Surface however, I still have enough to read a book and take notes tonight!  I hope this review is helpful as it is the first review I have ever written on any product before.  Good luck!", "Date": "March 18, 2013"}, {"Title": "Buy Buy Buy!!!!!!", "Author": "T. R. Boomer \"Boomer\"", "ReviewID": "RQO5D5ZD177OP", "Overall": "5.0", "Content": "I bought mine at Best Buy and I have owned it for three weeks. I am an IT Professional and I have experience dating back to 1979. This is my favorite computer ever. It is extremely quick, it is easy to use, and the display is razor sharp and easy to read. Does it replace my desktop? No. Was it intended to replace my desktop? No. Does it replace my laptop? Yes! Is it cool? Yes. Would I buy it again? Yes yes yes yes yes!I have the touch cover in blue which is really very nice once you get used to it. The audible feedback makes it easier. I have gotten stains on the keyboard but so far they have all washed off with a paper towel and water. It is very easy to clean. This is a very high tech tablet that does everything a laptop can do and more. I bought a blue bluetooth mouse to use with it and that really completed the package for me.Battery life: 5 + hours.Cons:- No ethernet adapter- No 3g or 4g adapter- only 1 Usb port- no cd/dvd rom drive- not easily repairable (ifixit score 1 out of 10 stars)- not upgradeablePros:- Quick boot time, around 10 to 15 seconds, due to the 128GB SSD- Very small size- excellent display 1920 x 1080 resolution and high contrast ratio- extremely high quality touch screen with stylus- Processor: Fast 64 bit core i5 1.7 GHz, dual core hyperthreaded processor (real computing power)- Windows 8 pro x64 - runs standard Windows software- VERY GOOD WiFi 802.11 N and below- Bluetooth- magnetic power connector and keyboard connection. Excellent quality and cool factor: 10 out of 10.- mini hdmi adapter- micro SD slot (TF Card slot)The lack of an ethernet adapter, an optical drive, and a second usb port make this unsuitable for a corporate enterprise environment. As a personal tablet computer with power, a top of the line display/touchscreen, and a small footprint, it is unmatched. The low repair-ability of this machine requires you to get an extended warranty. I bought the computer and warranty at best buy because the warranty includes a free power adapter and battery replacement which means that you get something for your money even if the computer doesn't break. Regardless of where you buy a Surface, be sure to get a warranty because it is extremely difficult to repair (CHECK ifixit.com.)Overall I am very pleased and this is a super cool computer. It has a very high quality feel and weight to it and feels solid. It also draws a lot of attention everywhere I go with it's distinctive design. I would definitely buy this again and I have no regrets.If you want a small zipper sleeve for the Surface, consider this product. It was created for the Samsung Galaxy, but it fits the Surface Pro perfectly:http://www.amazon.com/gp/product/B00AHNEL1Y/ref=oh_details_o06_s00_i00?ie=UTF8&psc;=1The bluetooth mouse I bought for the Surface Pro is here:http://www.amazon.com/gp/product/B000UY3NR8/ref=oh_details_o05_s00_i00?ie=UTF8&psc;=1I hope you get one and I think you will be very very happy with it if you do!", "Date": "March 8, 2013"}, {"Title": "A lot more than a tablet", "Author": "Kevin", "ReviewID": "R1AS2UMDQWM78J", "Overall": "5.0", "Content": "I'm a student and I bought this mainly to carry it to the university, take lecture notes and study at home. Overall, I'm pretty satisfied with it. It's lightweight (2 lbs./900 g, but keep in mind this is basically a full laptop in a small case), powerful, runs every app that my laptop does and the pen is amazingly good, even better than my Wacom Bamboo, mainly because it's lighter and thus less tiring to use.I installed Office (the new one is already installed, but it's only a trial license) and Visual Studio. They both work well, it doesn't feel slower than a laptop at all.The only thing I'm not terribly satisfied with is the battery life. Sure, I managed to get 5 1/2 h out of it (Wi-Fi off), but I would have liked at least a couple more for a device so portable.I have the type cover and I find it good, but I tried the touch cover at a store and it doesn't feel so bad, you probably can adjust to it with a little time.Overall, I recommend it to anyone who wants a very portable device that can also run all of their applications (including full videogames, even if you might have to tune the settings down a bit). It can be used as a tablet, but if you don't need to do any work on it, it would probably be best to get the Surface RT, much cheaper and with twice the battery life.Ending note about storage: I own the 64GB version, which has about 29GB of free space. Unless you really have the need to install tons of heavy applications, you can get this version and just buy a microSD card (32 or 64 GB) to extend your storage. I've done so and I'm happy with it. The 64GB version is also easier to find.", "Date": "February 18, 2013"}, {"Title": "Laptop/Tablet Hybrid?  More like Desktop/Laptop/Tablet Tribrid", "Author": "Walt", "ReviewID": "R1XC0HBRX88A6E", "Overall": "5.0", "Content": "Current setup:-Plugged into an Alienware 3D Monitor via Display port HDMI, AS WELL AS a cable so I can utilize all the USB ports on the monitor instead of just the 1 USB on the tablet.-USB connected the G930 wireless headset, Logitech MX Anywhere Mouse, and still have more USB ports I can use for my camera etc.-Using a Microsoft Wedge Keyboard (saves a USB slot since it directly connects to the Surface Pro)Currently have:-Samsung Galaxy Note 10.1-Asus Transformer Prime w/dock-iPad 2 (sold on eBay)-Microsoft Surface RT w/Surface Keyboard (which I returned)-Kindle Fire HDI've been looking for a tablet that can do everything, and while there is something missing that makes the Microsoft Surface Pro not that, it's something EASILY remedied of all the competition.  Before I go into that and why this is the closet thing to be the ultimate tribrid, as well as probably the best choice out of all the operating systems, I need to explain what the pros and cons (TO ME, and maybe you) on the competition.ANDROIDThere are so many variations of Android tablets that make it really great, but sometimes I just wish they all put their heads together and copied each other.  For instance, Galaxy Note 10.1 has an awesome stylus and a port to put the stylus in without making the tablet look/feel awkward, as well as the stylus doesn't seem to need charging (or it's charging when docked never thought about it since it's always out or docked), as well as having multiple apps it can run in various windows (but it's very limited). Then you have the Asus transformer having a keyboard that acts like a battery to extend the life which makes it really cool, as well as sticking to stock Android. Then there's the Kindle Fire where if you have Amazon Prime it makes it all the worthwhile to have because of the services it offers but also lacking Google Play marketplace to the fullest.  Downfall of Amazon Kindle Fire HD though is that you are restricted to their marketplace.  I love how the partners like nVidia make games specific to Tegra etc. but remembers to downgrade the games that don't.  There's so many variations, if you put them all together into one unified Android device, it would be very nice.However as nice as it is, there is one KEY thing missing-Microsoft Office, true multiple windows all at once, and PRODUCTIVITY.  Yes, Google Drive works very well, but it's nowhere near what Microsoft Office has.APPLEApple has awesome apps for entertainment, and there are apps that are still in iTunes that is not anywhere else.  It's very simple to use, the battery management is well managed, screen looks great, and if you need to backup your device back to where you left it you can use iTunes to save it that way.  What I really am annoyed at is the fact that if you have let's say a PDF file and you use one app with it, but then there's another app that can do other stuff you want with pdfs, you have to save TWO copies (one for each) just because they are sandboxed.  Productivity apps are decent, I purchased a bunch to write notes etc., but they aren't that great either.  Amazon Prime w/Kindle Fire HD offers way better deals for music, free books/books, magazines, movies, etc. in terms of pricing and doing with whatever you want with the music.  I hate how you have to pay a premium $1.29 on Apple instead of $0.49 or $0.99 in Amazon or outside vendors.  Pretty much it's completely locked.SURFACE RTThe reason why the Surface Pro has 1 thing against it is best shown in this Surface RT device.  MY GOD, the app market is HORRID.  Luckily, it's easily remedied in the future, but to me, this is what made me return the Surface RT to wait for the Surface Pro.MICROSOFT SURFACE PRO REVEIWPROS:-Can use this as a laptop, desktop, or tablet, and it has a stylus that works VERY well.-Not limited to Microsoft store, I can install Amazon's MP3 software, go to Amazon.com to watch Prime Videos so it's not locked to my Kindle Fire HD only, etc.  Can install 3rd party software!-Can use Google Drive via Chrome Browser-I can install iTunes and keep my library!  Did I mention 3rd party software install capability is awesome?-HAS MICROSOFT OFFICE! WOOHOOOOOOO!!!!!!!-Can play basic games like Age of Empires 2 (hopefully HD too in future =D)-They skipped 720P and went straight for 1080P on the resolution, good job!-Actually won't become obsolete as easily as my other tablets because the hardware specs are pretty sick-Stylus is well implemented, can write cursive a little messy and it still knows what I was trying to type-Kickstand is a commodity taken for granted, love that it's already on the tablet.-Can control % of processing power to increase battery life-Battery life is actually better than I thought it would beCONS (This is more of a list of what I hope the next Surface Pro will have)-Stylus needs to be charged using the charge port on the Surface Pro tablet.  I wish they copied Samsung and put a dock to hide the stylus instead of the awkward position it currently is in.-Only 1 USB?!-Display Port, why not a direct HDMI port?-Can't duplicate the solid feeling of a laptop on lap, it would probably topple over easily if you weren't paying attention.-Surface keyboard really SUCKS.  It needs to be more like a Microsoft Wedge Keyboard IMO.-Microsoft Wedge Mouse is too small, needs to make a larger/longer version.-Probably wouldn't last long on a long airplane ride like the Asus Transformer Prime w/battery keyboard-Would love a thinner designPLAN ON TESTING IN THE FUTURE-If I install Cyberlink and use an external blu ray player to run a 3D movie, can I use my 3D monitor to watch it in 3D?-What limits on gaming do I have?  I know I can install steam, but do I dare try running them in fear of overheating the device?OVERALL:  Not having restrictions on outside party software is a huge plus in my books-meaning, I have iTunes for some music, my other music on Amazon MP3 software, and they can both be in the same device!  I love that it can be used as a laptop, desktop, and a tablet (sometimes I get angry when I use it as a tablet that typing on it sucks, then I remember I can turn it into a laptop).  While the Windows market is definitely not there yet, every platform had to start somewhere.  Windows 8 did a great job on turning the OS into tablet friendly.  It is significantly much easier touch interface than Windows 7 was.Is it the one?  Depends on you.  If you have a lot of games on iTunes, you can't run it on this yet (maybe someone will make a mod to let you run them on this tablet in the future).  I know Bluestacks was a project to run Android games on the Windows platform, so who knows, iTunes might have one in the future.  I personally love the fact that I can get all my stuff on all marketplaces into this device, and that I can use it as a desktop.Other than that, great job Microsoft!", "Date": "March 14, 2013"}, {"Title": "Love it", "Author": "M. W. Helwig", "ReviewID": "R104AJ6F2FZA3J", "Overall": "5.0", "Content": "I have been using Windows 8 for several months on my desktop and liked it with some qualifications, but now that I have been using the Surface Pro for about 2 days now( purchased from the Microsoft site), it is apparent what a great OS it is. Windows 8 is incredibly snappy on the Surface ( benchmarking about 5 times faster than the newest iPad). The surface configured itself by syncing with my desktop, very cool! Apps work fine with a mouse, but on the touch screen they really shine. The device itself has a great feel to it, you can tell an incredible amount of thought went into the smallest detail. I can't remember buying any product of any kind that I have been more pleased with, it far exceeded my high expectations.", "Date": "February 14, 2013"}, {"Title": "Thee Tablet for which I Have Been Waiting", "Author": "Lisa \"lp\"", "ReviewID": "RPIV65XGYOQCB", "Overall": "3.0", "Content": "*****5star: I have been waiting to replace my trusty netbook for a touch tablet THAT DID NOT run on Android (hate the fact that android OS takes my credit card numbers and stores them indefinitely without adequate security in the event of theft of the physical device!).I wanted the same MS/Windows I run in my home office, so I could update and change documents when I was meeting with clients. I wanted to read books with a touch screen.  Although I prefer bound books in the evening at home, there are many virtues for travelling light. I would even like my tablet to replace my phone. My MS/Surface Pro 128 does the first 2 and there is an app to do the latter.  Moreover, it does it as quick as my 23\" ASUS with intel 5i 8Gb all-in-one.Furthermore, I have not run out of room.  I am using MS/Office Premium 365--still I am nearing 100 apps and work on a couple of clients materials at a time, which included images, sound bites, spreadsheets, as well as documents.  AND I work them while I am listening to NPR or an Audible Book or a TED presentation without causing that stop and go \"loading...\" to queue up.*1star: Here is what needs improvement: My email reproduces teeny tiny and absurdly the  Windows8/Ease of Use settings, \"Make Everything Bigger\" is not active on the Surface Pro--where I need it.  It is available on my 23\" Asus--where I do not.  I can under Control Panel set font size bigger for all Window menus and bars, but this does not address programs (such as email). Use of the magnifier feature is more problematic than helpful. Its menu and border pop-ups covering essential on screen toggles (such as open/close a window or tab).Here is what makes this aforementioned issue extra problematic.  I attempted to point-out this significant short-coming to an offical MS chat or board, but their boards are essential designed not to receive information/feedback from customers. This makes me wonder whether MS will write a software fix for this before my eyesight fails. So if you have difficulty reading fine print, this is not the tablet for you.", "Date": "April 19, 2013"}, {"Title": "Coast to Coast", "Author": "G. Scott Barrett", "ReviewID": "R2PSKO09MBN3LJ", "Overall": "5.0", "Content": "The Surface Pro has passed the flight test on my flight from LAX to NYC.  My Surface sat perfectly on the food tray and I was able to work on my Office files with no issues.  I even squeezed in an episode of Arrested Development.  I was a bit nervous that the battery life wouldn't survive the flight but the Surface walked away like a champ. I am very pleased with this purchase.", "Date": "February 21, 2013"}, {"Title": "Finally, a tablet for me...", "Author": "Pen name", "ReviewID": "R26EMQBR6YRTJ5", "Overall": "5.0", "Content": "Only one week of testing, so I cannot cover long term reliability.  But in that week I have used it for at least five hours per day, so I am comfortable giving my review.  The five stars is subjectively and objectively given.  Subjective- Based on my personal expectations of a tablet computer.  I have high standards but they probably differ from yours. Objectively, in that I own and use both Mac and Windows laptops, an Android tablet, an iPad, and a Blackberry Playbook.  If you cannot tell, I am a gadget guy.  I work in the IT field and I like to have everything at my fingertips.You will notice during this review that I draw comparisons from laptops and tablets.  They are two (very) different devices that share some functionality.  The Surface Pro is the only device I have used which serves as both.My expectations of these device types:Tablet: Portable, fast web surfing, calendar, email, movies, music.  I'm not much of an App person, but the few I like, I insist are available.  Ease of use and intelligent navigation through the components I use.  Some people might stop reading after this line, but I love my Blackberry Playbook.  It represented what I wanted from an OS...to bad the App selection was terrible.  iPad is cool, but after using other OSs I realized it could be cumbersome to navigate.  Android was a good basic interface, but I found it to be more of a toy than a tool.Laptop: Portable power.  I am willing to sacrifice size/portability for power.  For example, I love my 18\", 10 lbs. laptop because it has the fastest processor available, fastest graphics card available, and it can do everything.Okay, now you know where I am coming from...on to the review:This only applies to the Surface Pro. I have not used (and am not interested (currently) in an RT))Hardware:  Awesome.  The i5 processor handles everything I throw at it.  I can have a remote desktop connection in the background along with my email, 6 IE tabs, OneNote (with ten pages), and reviewing a 10+MB PDF file all at the same time.  Switching between these is fast and fluid.  Boots and logs-in in seconds.  Goes to sleep in seconds, wakes up in seconds. Type Keyboard cover is incredible.  Smaller than most keyboards, but laid out very well.  Good feedback and spacing.  Touch pad works well when navigating things not optimized for Windows 8 (touch interface).  Flip the keyboard around to the back and it automatically disables to prevent accidental key presses.  Close the cover and Surface goes to sleep.  Plenty of RAM (goes to what I said earlier about multi-tasking).  SSD HDD is fast and responsive.  I also installed a 32GB SD card (can never have too much space) and it accesses very quickly and easily.  Built-in kick-stand is an amazing feature.  At first I thought it was a gimmick and I wouldn't use it.  However, it works very well and I use it at least half the time (mainly when I'm using the Surface as a laptop.  The screen is brilliant and beautiful.  The casing is very durable and feels substantial and high quality.  The stylus feels and performs just like Wacom's I used back in my graphic design days.  I heard (but haven't confirmed) that the Surface actually has a Wacom chip installed.  I believe it.  Taking notes in OneNote is fast, fluid, and accurate.  Charging connection is not quite as good as that on my MacBook Pro.  On my Mac I just need to get the two within about an inch and they mate up/connect automatically.  With the Surface, I have to be a little better with my fine motor skills.  Not a big deal, but an observation.  Battery is great for a latop, but middling for a tablet.  I can get through an 8+ hour shift at work, but I'm at around 10% when I leave for the day.  This is NOT constant use for 8 hours.  But I have several meetings a day, I remote to other computers, I crunch numbers in spreadsheets, and I surf the web during lunch.  When I'm not actively using it, I try to remember to tell it to sleep (just press the little button on top) but more often then not I forget and it sleeps on its own.  So maybe 5 hours of constant use at work.  I typically use it in \"Battery Saver\" mode and I haven't had any performance problems.Operating System (OS):  I made the switch to Windows 8 back in November, so it wasn't too much of a surprise and I have had time to get over my gripes of learning something new.  Having it now on a tablet which was designed for it, I can see the genius that is Microsoft with their latest OS.  Every complaint I had about Windows 8 on my non-touch laptop is now void, because I understand why Microsoft did it.  I will not turn this review into a Windows 8 overview, but please know that it works and it works well.  If you're willing to open your eyes and try something a little different, give it the benefit of the doubt, and actually USE it, you will see how great it can be.  But the next best thing about the OS and the Surface Pro is that it is fully backwards compatible with any of your Windows 7 software.  For any gamers, yes, Steam installs. No, you can't run Crysis on it. Yes, you can run Fallout: New Vegas with reasonable graphics.  I'm actually pretty impressed with Intel's 4000 graphics chip (this should probably be up in the hardware section, sorry).  For tablet use (see my tablet expectations at top) I can do almost everything I want from the Start screen and by swiping in from the left to switch apps. I've found a few websites which aren't optimized for the \"Tablet\" browser which opens from the Start screen (and opens from any tiled programs).  But it isn't a big deal, I just press the desktop tile and I have access to the full (normal) IE9, which works on every website.Okay, I'm getting tired of typing.  So here is my summary:  It works great as a tablet (portable and usable) albeit with less battery life.  But as everyone who has owned a tablet can say, there almost always comes a point where a tablet just won't cut it and you need a real PC.  This device is the only one which will allow you to click into an awesome keyboard, and do everything (literally) that your regular Windows 8 (thus Windows 7, as well) computer can do.Too cool for words...although scrolling up it looks like I tried anyway.  If you can afford it, you will probably love it.", "Date": "February 16, 2013"}, {"Title": "great tablet/laotop", "Author": "Scribbles", "ReviewID": "R1FHZ24JV5Q3XE", "Overall": "5.0", "Content": "The Surface was pretty much exactly what I expected and more. It is light and battery life has never been a issue yet.PRO:The size and portability are amazing.  With the combination of the type cover and mouse a person can really forget they are using a touch screen device.  That being said though, the touch screen is quite spectacular.  it is very sensitive and interface makes complete sense.  The gestures were very easy and quick to learn.For those who like to game, the Pro isn't a gaming device, but it can sure play games if you like.  Can play games like Borderlands 2 on low with momentary lag at times.CONS:Something many people complain about is the Battery Life, Its not truly a con in my opinion, but it could be better.  I don't take issue with it.  I run it on power saver and hibernate it when I push the power button (it starts up so fast not an issue) It last he whole day on moderate use. The batts estimated time is 7 hours. On power saver no real diff is noticed in the interface, still smooth and fast only when browsing websites like tumblr with alot of gifs loading or flash elements.The app store is still no comparison too the android or apple market.  Not enough apps yet, buut the  many of the big apps are all there and remember it is a full laptop so you can just install whatever programs you want.  Kind of nice actually to be able o have both the app store and ability to install whatever you want", "Date": "March 12, 2013"}, {"Title": "All in one!", "Author": "N. DEJESUS", "ReviewID": "R24GW70RSC8XT9", "Overall": "5.0", "Content": "I bought this because I hated taking both my Windows laptop and Ipad together all the time (What I really hated was hooking up to iTunes everytime I wanted to add something to my Ipad).  I was a little hesitant about Windows 8 because my buddy upgraded from Win 7 to 8 on his desktop computer, he really wasn't too happy with it because he said it was more for touch screens.I decided to pick up the 128GB version from the Microsoft store, along with the black flat touch cover (buying from the physical Microsoft store, they included an additional 3 gigs of Skydrive for a total of 10 gigs of free cloud storage, Nook App with 2 free subscriptions, 1 month of Skype and a free Tshirt).Boot up from complete off takes a few seconds (I was pleasantly surprised), boot up from sleep is instantaneous. It takes a little getting used to navigating around the new OS, but it soon becomes second nature.The weight is about a half pound heavier then my Ipad (I myself can barely tell the difference), people who complain about it being soo much heavier should really look into how out of shape they are.Storage is awesome it came with about 89 gigs usable storage (I'm planning on recovering a lot more by installing the recovery program on an SD card and storing it away), I added another 64 gig micrd SDXC class 10 from Sandisk for $50, plus the 3.0 USB port adds unlimited storage from an external source.  Contrary to what some reviews say on the net, you really don't need a keyboard, it was just a nice little extra that came with the cover. I get a little less than 5 hours sufin the net, even less when using Youtube flash videos (Flash videos really taxes the CPU and gets the tablet a little warm)The App store has an OK selection of Apps for now, but you can basically turn all your new or legacy favorite windows programs into Apps by pinning them on to the Start screen.  I know alot of people try to compare this to a Mac Air, yet most of them carries both an Ipad and an Air, that really defeats my purpose.Bottom line is that you really can't compare this to a tablets like an Ipad or Android, because it has the full capability of both a laptop or tablet; it's a true all in one solution. One thing I know for certain about Apple is that their fan base gets very defensive about anything other than Apple products,  so they'll certainly be looking to give the Surface Pro bad reviews.Microsoft gives you thirty days to return it, but after using it I'm definitely not taking it back.", "Date": "February 14, 2013"}, {"Title": "The best for now", "Author": "HoushaSen", "ReviewID": "R257JCLRHX8ET1", "Overall": "5.0", "Content": "I have been in a hunt for tablet device for past couple years (or if we go back to TC4200 era, almost ten years).  Surface Pro is by no means perfect.  I can readily list downsides on this device (see below).  However, as of today I must say this is what I need and I see no alternative.Background:I have owned multiple Android tablet including Transformer Infinity and Galaxy Note 10.1 tablets.I still have iPad 2.I have owned Ativ Smart PC by Samsung for almost three months.I have Macbook Air 13in 2011 model.Pros:1. Windows 8Some may say the OS is not great, but I personally like Windows 8.  If not anything for anything else, it is still a windows i.e. I can run pretty much any Windows application as long as it does not require high spec graphic card i.e. games (see below).  The touch side of the Windows 8 is good for me to use as tablet i.e. I use this to read a comic or ebook.  But for the purpose of productivity, I use in ultrabook mode.Most important part of this OS to me is the true multitasking support.  I can do multitasking with any application 2-3 or 4.  Galaxy Note 10.1 has good mutltasking option but it was limited to selected applications and only 2 at a time.  With dual screen and split screen functionality, I usually have my PDF open in one screen, One note on other with split screen Email on the side.  This gives me a huge productivity boost as I no longer have to open PDF copy and switch to note app then paste, and go back to PDF app etc.2. AccessoriesAgain this is a real Windows so I can easily use bluetooth or USB accessories to give me real productivity. Specifically, I use AOC E1649 portable USB monitor i.e. dual monitor set up on the go.  This was not something I could do with iPad or Android tablet though I've seen some option with AirPlay application, I have some doubt it would be as smooth as my experience with Surface Pro.  The other accessory I use is wireless bluetooth mouse.  Touch pad on the Surface Pro Type cover keyboard is pretty bad but I don't care because I can use a real mouse.3. ApplicationsYes. Windows 8 specific store is lacking its quality content when compared to Google Play or Apple App Store, but since this device supports Windows 7 applications I can use One Note (which is one of the main reason I needed Windows 8 tablet like device), full Office (of course), and many games and other helpful applications.4. Wacom Pen supportClosest to pen and paper writing requires inductive screen technology. Using stylus on capative screen e.g. iPad or non-Galaxy Note android tablet are just not the same.  Pressure support, palm rejection but most importantly highly responsive and accurate experience is here.5. MicroSD slot128GB is not a small but I really needed expandable memory option.  The upcoming Windows 8 tablet (lenovo helix) unfortunately does not have this option so I had to give up.6. Processing PowerCore i5 is powerful.  Though not a true performance indicator, if you use crossplatform benchmark tool (Sunspider) you see Surface Pro has 4-5x speed for javascript processing compared to the fastest tablet iPad 4 or Nexus 10.  Obviously, this does not mean it really has 4x processing power but just as an example how powerful it can be on certain tasks. The other example is you can see how things lag quickly when you write a full page with Atom Processor, but you won't see that with Core i5 processor.7. DisplayAfter using Transformer Infinity's Full HD, all the text appeared blurry when reading text in tablet mode if the resolution was below full HD.  So Surface Pro got this part right.  This was the downside for Ativ Smart PC.8. GraphicsThis is more of actual GPU processing power.  This is not powerful enough to play high-end game in high setting.  I don't play high-end game but I have heard you can play Skyrim in low-setting, which is reasonable for me.  When I tried to play relatively low demanding game on Steam with Ativ Smart PC, which uses Atom processor, it could not even start the game.  Surface Pro had no issue loading and playing the game.Neutral:1. PriceThe retail price of the 128GB is $999.  When you add a keyboard and tax, you are looking around $1200.  This is more than double for Android or iPad tablets.  So yes. it's expensive if you are looking for just a tablet.  However, when you compare to the ultrabook which is basically really thin and light computer like Macbook Air or other similarly spec'ed windows 8 tablet this is reasonable price.2. WeightWith keyboard, the weight is easily over 2lbs.  1.5lbs is the cut off that I feel comfortable holding in a hand for prolong time.  Thus this is definitely heavy for tablet. However, as a ultrabook, this is one of the lightest ultrabook.Cons:1. HeatThe system gets hot while in tablet mode.  For me it is to the degree a bit uncomfortable to hold.  Fortunately, folded type cover insulate it but even then I can still feel it.  This was not an issue with Android, iPad or even Atom processor Windows 8 tablets.2. Battery life5 hours of battery life is not terrible; however, I really need full day battery i.e. 8-10 hours without a charge. The device charges relatively quickly so it's a help but even then I really wish the battery life is longer.  Though there is a hope.  Supposedly, there is a rumor that Microsoft might be working on battery containing keyboard.  The new ports on the Surface Pro is capable of supporting it, and we know such can be done as proven by Asus transformer series.  So may be this will change.Conclusion:This is a keeper for me. Three main downsides are weight, heat and battery life.  The next generation intel chip, Haswell, specifically focuses on these issues.  So if you can wait until next iteration of Windows 8 tablet, that is probably the best.  Otherwise, as long as the budge is not your issue, this is a tablet you have to consider.  Provides great productivity especially purchase accessory such as portable monitor.  It plays many windows games excluding graphically intense games.The potential alternative devices are upcoming Lenovo Helix (priced starting at $1500) or Ativ Smart PC pro (similar to Surface Pro).  Personally, I did not choose the former as I could not wait and the price was a bit too high, and no microSD.", "Date": "March 15, 2013"}, {"Title": "I want the one that does everything", "Author": "AllGoodPeople", "ReviewID": "R3CX3FYHB9JL65", "Overall": "5.0", "Content": "Tech news site The Verge in their review of the Surface Pro asked who this product is for?  What is the target market that Microsoft was aiming at with the Surface Pro?  The questions were asked as if it were rhetorical, however the answer to me was clear: I am the target market for the Surface Pro.I am a junior app developer by hobby, Engineer and Pharmacist by education who is just a few years out of school.  I grew up building my own computers and hand-picked my components.I held off on the initial tablet craze that began in 2010.  I remember thinking that the device was merely a bourgeoisie play-toy to browse social media outlets: just another content consumption device to inebriate the masses.  Fortunately, I was proven wrong over the years as tablets became the quickest adopted technology ever while becoming more functional.  >25% of households in America adopted tablet computers in less than 2 years, and to think both electricity and telephone were more than 20 years in their respective times.  Despite this, in 2011 and 2012, tablets weren't up to my expectations.  What could I create on a tablet?  I was at Apple and Google's mercy.Enter the Surface Pro.  I remember seeing this in June 2012's announcement and immediately thinking: \"This is what I've been waiting for.\"  I want to create content: great, fire up Visual Studio 2012 Express and start writing some code.  Have some C++ backend resources for the app I am developing for Windows Phone, no problem we can write and compile that code easily.  Have a paper to publish after some trials in clinic? Turn on Windows Speech Recognition and start dictating the abstract in Word 2013.If my day at work sucks and I need to blow off some steam, I can fire up Steam and play my rounds of CS:GO.  With the Mini-DisplayPort, I can connect my 50\" HDTV and stream Hulu from the app.  If I wanted, I could get a USB 3.0 dock and have 4 monitors.  I am at a professional conference and need to take notes, the digitizer pen is there and I'm covered.  I wake up and want to see some news, fold the cover back and now it's a standard tablet.  This is a remote debugger for my apps.  It can even run Android apps in emulation.  Speaking of emulation, I can play my old SNES games on here too. When I need to go, I just fold up the type/touch cover and I'm off.This is the ultimate merging of tablet and computer.  The Surface Pro is even faster than my i7-930 system I built in 2010 in certain circumstances.Most anything you want to do, you can with Surface Pro.  I've gotten my money's worth.  Get yours", "Date": "August 20, 2013"}, {"Title": "Surface Pro is nearly flawless", "Author": "Alfredo", "ReviewID": "R20TIS8TF1ZABC", "Overall": "5.0", "Content": "Surface Pro with type cover basically replaced my last laptop. It has a beautiful screen and amazing design. The pen is pretty slick. Few flaws but still soo good!Versatility:It is a very versatile device, if I want to use it for notes, I can flip the type cover so the keys don't touch the outside or I can just turn it over and it automatically knows you are not using it and stops the keys from working. I can take the cover off and run with it tablet mode, the on screen keyboard has a few options basic style or on the ends so you can type with your thumbs.Design / Weight:Slightly heavy but not at all a problem, I can still grip it with one hand without fear of dropping it. The Vapor Mg case feels solid and durable they put lots of work into making it look and feel sleek and sexy. One USB is good enough for everything you may need. If you have other devices that only work through USB, I suggest you get a hub, it may be bulky but if you're using more than one USB device regardless of how many ports the machine has, it is going to be bulky.Software:Windows 8 is by far the best windows to date. It works very well with the touch screen, very responsive no lag. There is a small learning curve, mainly because of the hidden shortcuts. But over all windows 8 is amazing I even have it on my desktop.Apps:This category is overrated. Although Windows does not have such a robust market like Apple or Google, it has the major things you need some apps could be better but overall its not bad, and it's getting better so fear not!Pen:It is pretty amazing some people complained that it feels cheap but to me it feels like a expensive pen you write with. The only thing I found strange was that the eraser is hard plastic. It doesn't scratch the screen due to the gorilla II glass but it is a little unnerving.Overall:Surface Pro is an amazing product. I am completely happy with it the battery life is mediocre but its easy to look over because it is so much fun to use! I implore everyone to take a leap of faith if they are on the fence about it. I know I was on the fence about it and I am glad I purchased it.", "Date": "March 17, 2013"}, {"Title": "Amazing", "Author": "DorCino", "ReviewID": "R2P7PQMOO16S8I", "Overall": "5.0", "Content": "I am an Apple Guy (for years), have iPad, Andorid Tablet, and even got the HP one when it came out. This is by far the best tablet anywhere. Not only is it a tablet, the face that it runs Win7 apps, wow. It's a small laptop, and works great. Win8 Interface takes some getting used to, esp in Desktop mode (make sure you get Classic Shell [classicshell.net]) which makes it more like Win7 in Desktop).Anyway, Pen works great, Keyboard is good as well (thou trackpad could be better).Overall the best thing I got in a long time.", "Date": "February 21, 2013"}, {"Title": "Problem and Solution", "Author": "ComputerGeek813", "ReviewID": "R1N3RCIU3JWLYM", "Overall": "5.0", "Content": "I love this tablet and use it to take notes using One Note for all my classes. In addition there is some good e-readers for e-books for the RT side of Windows that are very touch friendly. Between One Note, e-reader apps, and a full version of Windows this is the only device I need to carry around school.However, at first when I was trying this out I was carrying it around with my laptop, books, and notebooks. As a result the screen got damaged and was very hard to use. I just went to the Microsoft website and filled out the service request form. They gave me a free FedEx label to ship it back to them and I had a brand new Surface within two weeks. Microsoft is notorious for piss poor customer service (I.E. tech support lines, Xbox red ring of death, etc.); however, they got this one right! A++ for the customer service.", "Date": "May 18, 2013"}, {"Title": "Very functional - but a 25% failure rate on these devices is too high", "Author": "Geoff Ables", "ReviewID": "RGIG2WORACEKE", "Overall": "2.0", "Content": "I purchased 20 Surface Pro tablets for our company.  So we have a diverse range of feedback and user experience to base this opinion on.PROSIn general, these are extremely functional devices and I've found that I have been able to replace my complete laptop PC and my larger tablet (iPad sized tablets) with this device.  Our team consists of developers (using development tools like .NET Studio), consultants (mostly using Word and PowerPoint, plus various tablet apps) and administrative personnel.  Everyone reports that they have been able to completely replace their desktop or laptop machines with these devices.  For the consultants in our group, the ability to take notes using a stylus in OneNote is outstanding.CONSOut of the 20 of these devices that we purchased, 6 of them have had significant issues that have required at least one full day to resolve.  That's over 25% with problems!  And, of those, two of them had to go back to Microsoft for a replacement (that's 10% of these devices that required a replacement)!  That is an extremely poor track record and, for that reason alone, I can't recommend these and wouldn't purchase again. There are other issues that are nuances - most of which have been fixed either by the release of Windows 8.1 or by upgrading to a Surface Pro 2.SURFACE PRO 2?The Surface Pro 2 seems to use the same basic hardware architecture.  So I expect that the failure rate will be about the same on the Surface Pro 2 as what we saw on the Surface Pro.  If I happen to get a Pro 2, I will submit a review for that to replace this one - since the Surface Pro 2 is the only machine that one would buy.  But, at this point, I would assume that this is not the best machine to purchase.If Microsoft can address the small issues (which it seems to have done with Win 8.1 and the Surface Pro 2), then I'd give this one more star.  If they could address the quality issues that leads to such a high rate of failure, it would get 5 stars.  In general, I really like this machine - but the quality problems cause too much loss in productivity to make it a viable solution in the future.OTHER OPTIONSI am a big fan of the Windows 8 OS, as are most of my colleagues.  There are other laptop and tablet options available and, at this point, I would recommend considering one of those over a device manufactured by Microsoft - they just don't seem to have it right yet.", "Date": "November 9, 2013"}, {"Title": "Not a bad try, Microsoft.  Can't wait for Haswell.", "Author": "erikiksaz", "ReviewID": "R78O5Y45YE9JY", "Overall": "4.0", "Content": "Some background.  I'm an avid android user and so I've been using a Nexus 10 for the last few months before deciding to give the surface pro a try.  Most of my review will be comparing it to the Nexus 10 (my girlfriend also owns an Ipad, so I can throw in some addition comments vs iOS as well.Form Factor.  This is a really fat tablet, or a really thin ultrabook.  My tablets are usually used on a table with a case that can act as a stand, so I never really hold my tablet one handed.  If you planned to with the Surface Pro (SP, for short), your hands would become tired fairly quickly because this tablet is much heavier than its Android/iOS counterparts.  Otherwise, if you place this on the table, the kickstand will allow you to view the screen comfortably given that you plan to type with your wrists roughly at elbow-level.  If the tablet is much lower than this, then you'll be staring downward onto the screen at an awkward angle.  As for use while sitting up in bed, I usually prop it up against my bent knees, as the kickstand will only allow the screen to point at your chest.Usability.  In terms of speed, this thing blows away iOS and Android easily.  Swiping between tabs, loading pages, just executing anything, it is much snappier.  It's like using your brand new computer with an SSD drive compared to an older dual core Pentium with a ancient 5400RPM hard drive.  Yes, the difference is quite pronounced.  Scrolling is as smooth as, if not smoother than iOS, and DEFINITELY smoother than Android (even with my Nexus 10 on the AOSP browser).  The caveat here is that with web browsing, this smoothness only applies to IE in metro mode.  Chrome in touch mode is pretty much useless, it's not as fast as the stock browser.And due to the attached type cover (which I highly recommend), I am actually able to pound out paragraph after paragraph without problem, something that was not possible on the touch screen keyboard on my Nexus 10.Battery life is somewhat...bearable.  You get 5 hours with light usage @ roughly 20% brightness (which is still fairly bright, or at least not too dim).  This will only improve when Intel releases Haswell for mobile devices, which should boost battery life by a noticeable margin.Price.  Expensive, yes.  I purchased this when Staples had a coupon for $100 off, in addition to being able to trade in your old laptop for a rebate kickback.  I opted for the 64GB SP because I have a $40ish dollar 64GB microSD card that I have permanently sitting in my SP, making it essentially 128GBs as well (yeah, realistically it's 90-ish usable).  I'd recommend the same unless you really need that SSD-speed 128GBs.Screen.  The brightness is fairly impressive, but is usually set to a comfortable 20% to maintain battery life.  In an ideal world where battery life is not a concern, I'd run the SP at about 30% brightness.  Any higher and it's iMac retina-searingly bright.Sound is somewhat tinny.  But head into the options and turn on the sound virtualization settings and it's a teeency-weency bit louder and more usable.All in all, the SP is a combo of a \"fun\" tablet in addition to a productivity workhorse.  The nexus 10 and ipad only seem to fall into the former category.  Is it a lot more expensive than those two options?  Yes.  Can I do much more on this tablet/ultrabook than I can with those two?  YESx2.Realistic things keeping this from being a perfect tablet:-remove the Wacom support and save the user some $$.  Make it optional.-it wakes up and sleeps like a laptop, aka at least 10-15 second delay to wake + reconnect to your network.-kickstand only works for a very narrow range of setups.-include a type/touch cover for free.  This thing is already stupid expensive compared to the competition.Unrealistic things keeping this from being a perfect tablet (unless Microsoft listens):-Use a better display/calibrate the display (I have the calibration settings, if you need them, leave a comment and I'll get back to you)-Speakers on the front-Switch from a proprietary charging port to something more standard-Thinner/lighter-Get Intel to release Haswell faster so I could buy a Surface Pro 2UPDATE 4/22/13 - If you are constantly on the go and plan to turn this thing on and off several times throughout the day, use the \"high performance\" power plan.  The SP wakes up near-instant, and the wifi connection resumes MUCH faster than using balanced (even with maximum network performance enabled under the sleep settings for balanced).This will ultimately use up more battery, but since then I've purchased a surface RT charger, which is compact and can help to top off this battery when I'm near 50%.  Find a 25off75 coupon for Staples and the portable charger becomes much cheaper.", "Date": "April 15, 2013"}, {"Title": "Great effort and will likely get better in future versions.", "Author": "A. Howerton", "ReviewID": "RNCUECTAL40Q1", "Overall": "4.0", "Content": "UPDATE: March 17, 2013:Addressing issues 1 and 3 below.1. The pen works really well in the OneNote trial I'm on.  I'm still looking for a great writing app, but am MUCH more satisfied on my second unit.  It feels much better and I'm honestly not sure why - the calibration seems to be more consistent so I'm wondering if it was the app I used last time (which I, unfortunately, don't remember).3. Storage of the pen: still not happy about the lack on real onboard storage, but the magnetic function for use in the charging bay (the button on the pen fits the bay) holds it more firmly than I expected.  I think if you stay aware of it you will be okay. UPDATE FROM COMMENTS: I wanted to add the following up here to make sure folks saw it. It's coming from the comments on this post and I'm not sure what the source is, but if you can confirm independently it could be useful for you:comment: The Wacom pen on the 700T has fully operational software drivers for Photoshop CS6. The Surface Pro does not. This was very important for me.The only real drawback I have now is the lack of a cover as I'm using a Wedge keyboard and don't really want to spend $130 on a new type cover (didn't care for the touch - I need to feel the keys!).  Very satisfied with the unit and potential.  Future versions should tap into competitor designs and really be outstanding products.UPDATE: Mar 13, 2013After trying the Samsung Ativ 700t (yeah... after my issues with the 500t I tried again) I have worked with my developer on the camera issue to develop a solid workaround and we're going back to the Pro.  Ultimately, I need the processing speed that this unit (or the 700t) provides and there just aren't many options I'm trusting.  I also prefer the size of this unit to the longer Samsung devices and, coming from Microsoft, I feel it's got more staying power for future improvement and accessories.  I'll just have to make do with the pen issue and adjust my writing expectations.  There are still lots of improvements in this type of tablet/PC market for portability and features over coming months so maybe I'll update to something else in a year.Original Review:There's a lot of reviews that hit on the significant benefits of this machine, so I'm going to try to keep my brief and address the issues that I had resulting in a 4 star review and my ultimate return of this item.  Please keep in mind my issues are context specific - I really liked the tablet and thought it performed well.  On the few specific things I need, however, it failed to live up to my expectations.The context: I am starting a new service and have been looking for a good tablet that can run a custom Windows application as I can't find any software to do what I really need. I've decided to use a Windows tablet due to the ability to install any program, writing capabilities for notes on site, and on-board photos that may reduce or eliminate my need for a separate camera.I bought this at Best Buy, paid $1082.xx out the door after tax with no accessories.  I returned it the next day after testing it out and resetting it to the factory defaults without any restocking fees or issues.  Here's why I returned it.1. Writing: I had to write above where I wanted to see the text.  After some experimenting, it appeared this was related to how I held the pen (straight up and down, slanted, etc).  I tried calibrating it but that made it worse.  I plan on taking lots of of site notes and have had a much better experience testing the Ativ 500t and even using an Adonit Jot Pro on my first gen iPad.  UPSIDE: The pressure sensitivity features work well and make even this doodling fella feel like a cartoonist.  Still, it was awkward overall and didn't meet my needs.2. Camera: Disclaimer on my part - if you read through the specs closely you WILL see that the actual cameras on this thing (front and back) are only 1mp (or really .9).  The adds all indicate HD and a friend that returned it for this same reason had to demonstrate to the store clerk that they really aren't HD in picture taking mode.  The video was grainy as well.  My service depends on having decent photos (the Ativ 500t has an onboard 8mp rear camera, but really slow speeds and glitchy performance that got it returned).  I can carry a separate camera and will for times it's needed, but the whole idea on the onboard camera is saving me time later, thus reducing my off site work and improving my profits.  To that end, a .9mp camera simply wasn't going to cut it.  I really was surprised  by this because why on earth would they go backward in development on this point compared to other tablets in this price range?  The decision doesn't make any sense to me.3. The pen itself: Considering how expensive these are, I couldn't get comfortable with the idea of not having onboard storage. Carrying it around separately, going onto to multiple client sites and needing it on hand, is just one more thing to keep up with in my equipment list.  This was a minor minor issue, but still contributed to my choice.So.. here me clearly and rate this review in context.  The tablet itself really is excellent as far as I can tell.  It ran smoothly out of the box, had no glitches, quickly found my internet, etc etc.  It just didn't meet my needs and, with what's available in other tablet/laptop combinations (to compare it fairly, since everyone on here says you can't compare it to tablets directly), I felt like it fell a little short.", "Date": "March 10, 2013"}, {"Title": "Besides a few flaws, this is a great purchase.", "Author": "Benjamin Michael Walter", "ReviewID": "R34ORBH0HJMVTI", "Overall": "4.0", "Content": "I have had the surface for about 4 months now. I'm a college student and I take a lot of notes. I was tired of lugging around a notebook or 6 for each class and decided to buy this for that purpose and a few others. Despite a few minor flaws, I'm happy with it and would recommend it to students and professionals.I'll write an in-depth review here, skip to the bottom if you want a tl;dr.This functionality of this machine is good. I went right from a Macbook Pro 2009 to this, and while it isn't quite as \"clean\" running as my old Macbook, it does its job well 96% of the time. You'll find that the machine boots in about 6 seconds. Seriously, it's that fast, every time. I haven't had any huge problems with Windows 8, and I rather like it.The cool thing about this machine is that it's a tablet, but it's also a computer. You won't get any downsized, kiddie processor inside this like you may find in other tablets. If you're buying this, you're essentially buying a laptop with a touch screen. While the screen keyboard is fairly good, do yourself a favor and buy an attachable keyboard. I chose the keyboard with raised keys and I love it.You'll find a USB port on the left side along with an audio port. The speakers on this machine are NOT very good, so if you're planning on using this machine and listening to a lot of stuff, headphones are advised. Another thing to note about the audio jack is that, unlike Macbooks, when an audio cord is plugged into the port, the sound will not always transfer while audio is playing through the speakers. In fact, it rarely does. I've found that I have to stop whatever sound is happening (YouTube, iTunes, etc.) and then plug in your headphones/speakers. This can be tedious.On the right side is a charging port and a mini HD adapter port (you need an adapter for HDMI transfer. Not necessarily a downside, but it would be a good idea to purchase an adapter, too). This is the main downside to the hardware in my opinion: the charging port is also the port to hold the stylus. You cannot charge and store the stylus simultaneously. This is why it's a good idea to get a case that can hold your stylus as well as your machine.Another thing to note is that the charging cord is short. You must be within 5-6 feet of an outlet in order to charge. Also, the clip that hold the cord to itself (after wrapping) is flimsy and bends. Definitely not anything Apple-quality.The stylus works very well with the machine. You'll find it to be pressure sensitive and that the plastic tip does not scratch at the screen at all. However, the aforementioned problem with the charging port is a big downside. I'm now on my second stylus because the right-click button on the first one broke off after being clipped on to the charging port so often. There are other styluses you can buy (the Samsung Galaxy Note stylus works with the surface) but I would recommend just getting a case that holds your stylus.The other major downside is the battery life. You must carry your charger with you, because unless you're using the Power Saver feature, you'll only get about 4-5 hours of life out of this.If you're on the fence about this and the Surface Pro 2 (which I have not tried yet, but have researched a little) I would say buy this simply for the price. You'll be spending (with the case and keyboard) about $300-400 less on this machine than the Surface Pro 2 with not that much of a difference.Pros:-Functions well, rarely crashes. More of a laptop with a touch screen.-Clear, crisp resolution-Stylus works well.-Not a bad price for 128GB memory and 4GB RAMCons:-Battery life is lacking; 4-5 hours max charge-Stylus clips magnetically to charging port. Can ruin your stylus and charging and storing stylus simultaneously is not possible.-While audio is playing, you cannot change audio sources. In other words, plugging in headphones while a song is playing will not transfer the audio to your headphones. You must stop the audio first. This can be annoying.-Short charging cord. Don't be expecting 10 feet like a Macbook charger.-Charging cord clip (the clip that holds the cord to itself after wrapping) is flimsy. Also pales to Apple laptops.Overall, buy it if you're willing to get a keyboard and a case that can hold your stylus. It's a good buy for the price and worth the (minor) downsides.", "Date": "January 16, 2014"}, {"Title": "Wife loves this birthday present!", "Author": "Landru \"Landru\"", "ReviewID": "R14C9K1R69PGMC", "Overall": "5.0", "Content": "Her 6 year old Toshiba Laptop (which is one of the best laptops ever) was getting a little \"slow\", so this was a no-brainer.  Combined with the type cover made the perfect replacement.  But going from a 17\" laptop screen to a 10.4\" tablet screen was a shock, but didn't take but a few days to get used to it (at 1920x1080 resolution is actually higher than the Toshiba)!  Camera is quite acceptable eventhough it got poor reviews.  Built in microphone makes it perfect for Skype and built-in Bluetooth is perfect for the mouse and phone.  Slick machine.  Only thing she (and I) had difficulty with is the microSD slot is very hard to use.  You better have fingernails to get that card in and out!", "Date": "July 6, 2013"}, {"Title": "Great Product, Go Buy One!", "Author": "michael goldberg", "ReviewID": "R3AGA9Z4GLJLXL", "Overall": "5.0", "Content": "I just bought a Surface Pro as my first tablet.  I have been holding off from entering the tablet market, because up until now, all tablets have basically been big cell phones.  They run the same operating systems as my phone (iOS or Android).  Why would I need a second cell phone, with a big screen, that can't make phone calls?However, you cannot compare the Surface with all previous tablets.  It is a new product - think of it as an Ultrabook in a tablet form factor.  It is just as good as any of the ultrabook laptops out there, but its small, light, and easy to carry around.I love having a full computer, running windows 8, and being able to do anything I could do on a traditional laptop.  The device works great, its fast, and it can handle whatever you throw at it.  Obviously, the lack of discrete graphics card makes gaming a bit sub-par, but that's not the purpose of this kind of device.I bought the type-cover keyboard, and while the spacing takes a little getting used to, it works great and is very responsive.  I hear complaints about the trackpad, but I'm not seeing the issue.  I agree it is a little too small, but it works very well for me.The stylus also is very well coordinated with the computer - the screen very precisely tracks where you are pointing.I also purchased the wedge mouse, which i love.  Between the mouse and the keyboard, I can have a traditional laptop when I want one, or i can remove the keyboard, and have a tablet when I want that instead.  The versatility of the device is amazing.The only downside is the battery life could be better, but I don't fault Microsoft for that.  The space constraints of the device do not allow for a massive lap-top size battery to power laptop quality components under the hood.  Running an i5-3317 processor takes more juice than the little cell-phone processors found in most tablets.  I'm sure with future iterations, they will figure out ways to expand the battery life.Overall, if you're looking for a device that can be both a laptop and a tablet, this is the winner.  And compared buying the latest ultrabook, the price is fairly competitive.", "Date": "May 30, 2013"}, {"Title": "Everything I was hoping for! Upgrade to Windows 8.1 though so you can download apps!", "Author": "E. Huinda", "ReviewID": "R3AUXJ6NRD1RY", "Overall": "5.0", "Content": "When my hubby suggested a Surface Pro to replace my dead laptop and also free up his iPad that I was constantly borrowing, I was a bit hesitant. I wasn't sure a tablet could do both well. He went ahead and bought me one for Christmas and I am blown away. It is truly a laptop/desktop replacement AND an iPad/tablet replacement, and the Surface Pro does both tasks extremely well. I am a professional freelance editor and use MS Office heavily for my work but I also love using apps and am a daily Facebook user. After a bit of a worry having difficulty downloading apps, I read up on the issue and downloaded the free Windows 8.1 upgrade from the Microsoft website. I've been clocking along ever since! I have downloaded apps such as Facebook and Kindle. And I bought the Microsoft Office 365 suite. They all run beautifully and I am having a great deal of fun experimenting with my new \"toy.\" I added a USB expansion so I could plug in an old mouse and keyboard also hooked up a big monitor so I can perform my editing with ease.I realize too how perfect Windows 8.1 is for this device and how it beautifully blends and switches so easily between the classic desktop experience and the on-the-go tablet/app/iPad-type experience by a simple touch of a corner or button. Thank you, Microsoft! This product is THE new standard for tablets and computers!", "Date": "January 2, 2014"}, {"Title": "A-M-A-Z-I-N-G.  4 Devices in 1.  I am in love.", "Author": "digital joe", "ReviewID": "R253MF3P2M3N65", "Overall": "5.0", "Content": "I have been looking for this solution for YEARS!  I am in love.THE HISTORY OF DEVICES: XP/iPad/google Tablet***************I tried the XP tablet PCs back in the day and the technology wasn't up to speed.  Then years later the iPad revolution occured. I bought an iPad 1.  It was ok, but I only could use it for web browsing and games.  So a while later I bought a google tablet.  It was better than the iPad because the OS was more developed (widgets; more control), and I was a big google user.  However, it lacked as well because I wasn't able to do PC work.I wanted something that could be the best of everything.  And I finally found the Surface Pro.WHAT THE SURFACE PRO DOES FOR ME************DESKTOP: I can simply plug this into a powered USB hub, and use this as a desktop.  I can use the surface screen, a screen with HDMI, AND another screen with a USB adapter. (that's 3 screens)  Then, my keyboard and mouse are ready to work and I'm plugged into desktop mode.  With an i5 chip, and SSD, it's blazing fast.LAPTOP with TOUCHSCREEN: With the type cover (which I prefer over the touch cover), it is my laptop wherever I go.  I have this on my lap right now writing this review.  And with touchscreen, I actually have started using the screen as well.  For example, I will click the submit button for this review with my finger (because I find it faster).  And I will move the webpage up and down with my right thumb.  It's not necessary, but it's great added flexibility.DRAWING NOTEBOOK:  I've been looking for something I can actually take real notes on for a long time.  This finally delivers.  I like to jot notes, and especially make diagrams.  I can take this to a meeting, and capture in either my own handwriting, or typing.  And then view this on any other device (other computers, android phone, etc).  I also use photoshop and illustrator - and this is like having a free wacom tablet built in.  So it has come in useful for that as well.TABLET: When I pull off the type cover (or flip it to the back), the surface takes on the shape of a tablet.  I can pick this up anytime and browse the web, or play a game, or type an email using just the screen.  Everything I can do with an iPad or googlePad.  Now, some people will complain that it's not as light, or the battery doesn't last as long. But I'd gladly give up a few ounces (literally), and a few hours in battery life to have a full desktop at anytime.  Some people complain there aren't enough apps.  But a. I've found plenty of good major apps (ebay, amazon, office, evernote, etc) b. most of the other 1 million apps are games and other trinkety stuff  c. With windows, you can simply use a program like Bluestacks and run Android apps in windows.This is the future of mobile in my opinion.  And you could use this single device for all of your needs.  Obviously everything could use improvment - and as technology enables smaller form factors, and better batteries, they will get there. (As we speak, Microsoft has created the type cover 2 which addresses one of my wishes: a backlit keyboard)If you get one, I'm sure you will love it as much as I do.  Cheers.", "Date": "October 23, 2013"}, {"Title": "Surface Pro for Pros", "Author": "satcom4fun", "ReviewID": "RMX5HD749D6RN", "Overall": "5.0", "Content": "I bought the Microsoft Surface Pro 64 GB tablet (from Microsoft) and couldn't be happier.  This is a tablet for professionals that need to do work on the move.  I bought the 64 GB version because the 128 GB version sold out.  I have installed office 2010, 2 compilers, adobe, kindle for PC, and some personal software.  I still have 10 GB left.  Note that 64 GB is the max for an Ipad!  It runs flawlessly and I get 4-5 hrs battery life.  It has a USB port to use an external 1 TB hard drive or flash drives if desired to increase storage capability or use a cloud service.  It also has a MicroSD card to add another 64 GB if desired, why pay another $100 for a built-in addition of 64 GB.  The tablet connects to a desktop PC on a shared network for additional storage.  I bought the Touch Type Keyboard which works very well for taking notes.  The pen works well with OneNote for writing notes.  Look out Apple and Android, Microsoft has a winner here.", "Date": "February 18, 2013"}, {"Title": "Pretty Impressive", "Author": "Brian M. Edwards", "ReviewID": "RXHTDQGPKP6KL", "Overall": "4.0", "Content": "I admit I bought my unit used for an absolute song!...it came with the touch-pad, an HDMI adapter, and a generic charger plus a generic touch-pen. (Won't include those in my review other than to say they are just cheap crappy generics that just about function)Hey, I am pretty impressed with this unit, it does everything my Lenovo  Windows 8.1 laptop can do and is so useful to me I am surprised just how much I use it compared to previous Android tablets I have owned.I have Office, Adobe Photoshop Elements 11, and Corel Video Studio X6, plus drivers for my Epson Workhorse Printer and  a host of other software installed.(4 gig of ram is barely enough for video editing but it copes well without crashing)This thing can run anything a regular laptop can and does it well!It is a pleasure to use, after it updated flawlessly to 8.1 I am even more pleased with it. The addition of the new (old) start button is welcome but because I never really missed the old one, it is not a major change for me.The cameras work very well, Microsoft does not tell us how many megapixels they are but I would guess about 4 or 5 and the photos and video are adequate. Skype really excels on this and folks tell me the video quality they see on the other end is terrific!The touch-pad is OK, I have tried out a friends keypad and I do prefer that and may spring for one soon, though I must stress the touch pad is quite usable, I love that you can fold it back out of the way and it becomes inactive.The sound  is perhaps not loud enough though very clear, however we are talking about a small tablet so it is quite expected. Bluetooth works very well and the HDMI output is also excellent. I doubt that the included HDMI adapter is OEM but it does work perfectly and I have used this a lot to watch certain programs and documentary's on  TV, the images are great.As everyone has stated in their reviews, battery life is  a little on the short side, I get about 5 hours which is workable and I managed to easily watch two full length movies on a long distance back recently.The screen is excellent, even you tube videos look good on it.It is a little on the heavy side and gets warm to the touch. As with every tablet I have  ever held, they do hurt your hands after a while.All in all, a very nice tablet for work and leisure, it fits perfectly into my expectations and does everything I need. I deducted one star for the  less than stellar battery life but I think Microsoft  have made a really nice quality tablet.I would imagine that the Pro 2 will be even better but I am really happy with this version....it is a real keeper!", "Date": "October 29, 2013"}, {"Title": "Great For Art And Games", "Author": "Ionselat", "ReviewID": "R1T6VOYTFOAOEP", "Overall": "5.0", "Content": "PROS:-Pressure Sensitivity in Photoshop CC, Artrage, and Fresh Paint-Very fast processing power for games, Art Apps, and Business Apps-pen and touch sensors, the pen takes priority so artist can rest their hand on  the screen-Full Windows 8 OS-Support for Wireless Networks-Support for Bluetooth Devices-Ultra Portable-Micro SSD Card Slot-Mini Display PortCONS:-Runs Hot (A decent case fixes this)-Only One USB Port-Expensive for A Small Portable Device $800 - $900-Short Battery Life in High Performance Mode and using resource intensive appsI originally purchased the Surface Pro to create digital art, at first the tablet drivers weren't that good, Artrage ($50) and the (Free) Fresh Paint applications supported pen pressure sensitivity and worked fairly well, Artrage would bog down in apps with a lot of layers; Photoshop CC worked very smoothly even with a lot of layers but didn't support pen pressure sensitivity at all so I was originally disappointed for the first few months I owned the Surface Pro.In May 2013 I read that Wacom released wintab drivers for the Surface Pro, this was the game changer I had hoped for.  Once the wintab drivers were installed, it immediately became more enjoyable to use and with addition of a Bluetooth Keyboard and Razer Nostromo for programmable application commands and macros I get the same functionality out of it as my main graphics workstation in an ultra-portable device.The device does get warm when used in high performance power mode but I bought a good case ($43 leather MoKo case) with open sides allows it to breathe well yet keeps the heat away from the resting surface of the lap. If you don't have the money to get a good case after buying the Surface Pro, I suggest sacrificing some processing speed and gaining battery life by switching to Balanced or Power Save mode.  The battery lasts between 2 and 3 hours on a full charge when using Photoshop CC or Artrage.I give the Surface Pro 5 stars, the ultra-portability combined with amazing processing power makes this a great device for artists and gamers on the go.", "Date": "October 28, 2013"}, {"Title": "Microsoft found the answer!", "Author": "D. Stewart", "ReviewID": "R11D4XOWZBT9ZM", "Overall": "5.0", "Content": "The MS Surface pro is the answer to exactly what I needed.  I needed a device that could run all my accounting software programs and have all the things I like about my ipad without requiring me to carry two items.  I sold my ipad, ended my cellular data account for the ipad and bought the surface pro.  i added to my at&t; cellular plan the ability to turn my iphone into a wifi hotspot.  now i have wifi nearly everywhere for my surface pro and i only have this one master device to take with me.  I can prepare spreadsheets on the go with the real version of excel, not some weak app made for the ipad that just doesn't get the job done.  I can basically have my office anywhere I want to.  I can download actual videos instead of streaming it on wifi which almost always had some kind of technical difficulty during my presentations.  I can learn in multiple networks at various business locations I travel to allowing me use of network printers and other devices.  All this powerful mobility in a rectangle slightly larger than an ipad.  Oh, and the high definition screen is GORGEOUS.  I hear Tim Cook describe the retina display as absolutely gorgeous... uh, its still not up to par with HD.  It's good but it is not and HD screen.  I love being able to use a mouse, and my finger, and the special stylus, OH THE OPTIONS! Love em! I am always misplacing the stylus though... haha.  Stop limiting yourself with the ipad.  Yes I know it has millions of apps.  Yes I wish Microsoft had the same millions of apps. Maybe one day it will.  The compromise on not having millions of apps, however, is the ability to go to the actual website and all the benefits of what is available at the full site, like JAVA, Flash, etc.  I played with the Macbook Air but it didn't have the touch screen, and I would have had to learn how to use a Mac.  I am pretty good with a Mac, better than most Mac users I encounter but I am way better with Windows and the way Microsoft has things laid out.  Also, I would say that the sheer power of this machine was worth every penny... And still cheaper than a Mac.", "Date": "September 29, 2013"}, {"Title": "The best tablet thus far....", "Author": "TempeCowboy", "ReviewID": "R2UEGD2VPPJHEO", "Overall": "5.0", "Content": "I bought the surface pro knowing that it can run windows applications outside of the metro interface.  I have owned two different ipad models so I understand the way tablets generally work.From a hardware perspective this tablet is far superior to that of the ipad.  From a software perspective the Surface Pro is still far superior to the ipad, but Windows 8 is not a perfect OS.  I believe Win 8 was an overly ambitious step for Microsoft so the OS wont reach its true potential for a few more years I suppose.  However, you have freedom to do things on win 8 that you do not have on Apple's iOS.  One big example is that on Win 8 pro (which is the OS for surface pro) you are not forced to download software only from the Microsoft store (which is Microsofts equivalent to the Apple app store).  This is a big advantage for Surface Pro because as we know most of the apps in app stores today are worthless, including the apps in the Apple app store.  As time goes on I expect them to perfect Surface Pro hardware with more software companies to start supporting win8 touch functions as part of their updates.Pros:-Powerful-Fast-USB-HDMI adapater output-Can download legacy software outside the Microsoft store-it runs office-It can be used as a touch screen or with a mouseCons:-over priced-Power chord is too short-Battery life is usually about five hours at best-screen is too small (they should have gone bigger)-not all 3rd party software is configured for touch screenI use the tablet mainly for work and surfing the web.  I would give it 4.5 out of 5.0 stars, but because Amazon wont allow it I will give it 5.0although not technically part of the surface pro, the touch type cover is mediocre and only worth $50.00 at best, but that's for a separate review some other time.", "Date": "September 16, 2013"}, {"Title": "Perfect for work on the go!", "Author": "Darrell R Bennett", "ReviewID": "R16JKNXT5CZ76B", "Overall": "5.0", "Content": "For a person that is constantly traveling and needs the computing power of a laptop, there is not a better product out there. Battery life is sufficient to get through the average work day without needing to plug-in. This piece of hardware, in my mind, is truly revolutionary. Yes the cost is more then other tablets, but this is not just a toy like other tablets. This is the best of both worlds, it is a toy when you want it to be, and a serious business machine when you need it to be.", "Date": "May 2, 2013"}, {"Title": "A Software Developers Dream ! Runs VMware's Workstation 10 & More .... Halla-looo-ya !", "Author": "Matthew Klees", "ReviewID": "R2ONOPQY3VDIX1", "Overall": "5.0", "Content": "Who has a tablet ? That’s right, pretty much everybody right ? Now, Who has a tablet that has an Intel i5 Processor ? Has Gorilla Glass 2 ? Can run Adobe CS6 ? Runs VMware  Workstation 10 ? Snagit 11 ? Camtasia ? Microsoft Office Professional Plus ? AutoDesk Sketchbook Pro 11 ? AutoDesk Maya 2014 ? Is Pen Enabled with 10 Point Touch ? Can RDP (Remote Desktop Protocol) ? Can run Multiple Web Browsers and Applications and more all at the same time without slowing to a crawl ? All while housed in a magnesium body ??? Suddenly the show of hands goes down .... way down !!!!!!I bought mine from a fellow IT Professional who bundled ALOT with it for $700 who included 2 power chords,case,64GB MicroSD card,Zagg Screen Protector,Type Keyboard and Bluetooth Mouse ! ... I still believe the lord was looking down upon me and blessed me.The Bottom Line:If your in the market for a tablet  ... spend your hard earned money on a device that does EVERYTHING !!! NOT a device with limitations or restrictions.", "Date": "December 22, 2013"}, {"Title": "Great lightweight, \"real\" laptop", "Author": "Hien Nguyen \"scatterbrained\"", "ReviewID": "R1PBVB5LELOXWB", "Overall": "5.0", "Content": "For a long time I've been supplementing my large, powerful laptop (Dell Precision) with an Android tablet (Asus Transformer Infinity - the TF700).Though it was a great Android tablet, there were always short-comings depending on certain applications or VPN-related activities that I needed to do.  For note-taking and browsing, it was fine.Though the specs don't sound super-powerful - they're right around the glut of Ultrabooks that have been released in 2013 - the Surface Pro is responsive and boots up instantly.  It practically obviates the need to use the Suspend feature.Physically, the device feels sturdy and well-built and the kickstand has a satisfying \"thunk\" when deployed or closed.  There's a single USB port that can be used for any other USB peripherals and a microSD card slot for adding additional storage.People have complained about the finicky charging port and it's definitely not super-easy to insert it by \"feel\" unless you plan to scratch up the entire port area.  I think Microsoft went with a tighter tolerance there than on the Apple MagSafe(I and II) connectors which you can basically bring in the vicinity of each other and have them snap into place.  It's not a big deal, just need to be a bit more careful inserting it and definitely need some light!The stylus/pen is very light and cheap-feeling, however it (and the digitizer) are based on Wacom and there have recently been some new Wintab drivers released to allow native inking in more programs (such as the Adobe suite).  The stylus can be stored in the same magnetic charging slot, but you won't be able to charge the Surface Pro at the same time.  Additionally, the magnetic hold isn't very strong, so it can easily be knocked out of its perch.  Better to just keep it somewhere separately (like a pencil case).The screen is great and very responsive to touch.  Some people will use scaling to make the toolbars and other text more readable, but I prefer to leave everything at 100% (no scaling) and if there's something I can't hit with my finger, I'll use a mouse or the stylus.The charger could use some better cord-management, but it is nice that they included a USB port to charge devices (especially since the Surface Pro just has one!).Overall the Surface Pro really is a great small laptop that is practically a \"small compromise\" device since you can run all the Windows programs you need (that don't need powerful graphics capabilities) in a small form-factor.  If the battery life was better this would be a \"no compromise\" device.Recommendations - get a nice Bluetooth mouse (so you don't use the USB port) like the Wedge Mouse and a keyboard (Type Cover is much better overall than the Touch Cover)", "Date": "August 4, 2013"}, {"Title": "Heavy Horsepower for the Tablet World", "Author": "Winter", "ReviewID": "R122U3VBU85TD6", "Overall": "4.0", "Content": "UPDATE:  Microsoft has just announced the Surface Pro 2.  If you're considering a Surface Pro, you might consider weighing the cost of the Pro 2 against the inevitable price drop we'll see here for the Surface Pro.First, let's clear up some confusion about the Microsoft Surface Tablet:  people often ask me, \"Why is this one so much more expensive than that one?\"The first Surface tablet to be released was the Surface RT.  It runs a stripped-down version of Windows 8 that can only run a smaller set of applications:  programs written specifically for the Surface RT.  Part of this is due to the hardware inside the Surface RT, and that's why you can't just upgrade a cheaper RT tablet to be a full Windows 8 device.  This device is the Microsoft Surface Pro.  It runs the full-blown Windows 8 Professional operating system and can for all intents and purposes do just about anything a low to mid-range desktop or laptop can do...and then some.I say \"Then some\" because the extra dimension here is touch.  The Surface is all about using the touchscreen to interact with it.  There is also a stylus, and that tends to be a must-have when you start trying to interact with smaller objects, but Windows 8 was designed to be physically handled.  Gestures can close programs, bring up a touchscreen keyboard, flip through options, and more.  The only downside to the hardware is it's slightly unfriendly to left-handers:  the stylus pen docks on the right and the stylus socket doubles as the power-plug, meaning that when it's plugged in, you're more likely to need to put it on the right side of a desk or get an extension cord.  Other than that, we have an amazing piece of machinery that is fast, responsive, and simply fun to play with.  The Intel Core i5 processor and 4GB of RAM are put to good use--it has a Windows Experience Index of 6.9, if you're curious--and the dual cameras front and back imply lots of picture-taking and video fun.  There is also a DisplayPort adapter that will easily connect to a monitor or flat-panel TV (cables sold separately).  The case of the Surface is smooth:  the \"VaporMg\" magnesium body feels like titanium and the weight of the hardware imparts a sense of toughness to it.  The glossy 1920x1080 screen is bright and colorful, and it was a very clever design touch to make the lower half of the back be the kickstand to hold the Surface steady.  If you buy the keyboard--and I can't imagine dealing without it--it snaps smartly onto the 'bottom' edge of the Surface and acts as a screen cover when you fold it up.  The Surface Pro is also smart enough that when you fold it back to hold the unit as a tablet, the keyboard does not respond to touch--no accidental keystrokes from the back of your arm.  When evaluating the snap-on keyboard, the hard keyboard feels most like a real keyboard and the soft one takes some getting used to.So then we come to the cons.  Thankfully, they are few.  For one, you'll probably end up adjusting the Windows UI a bit, as there may be times the font of Office or other system menus is just too tiny, or the buttons require you to tap into a pretty small space.  It takes a bit of getting used to, developing the feel for switching from fingertip to pen-tip.  Then there is an awkward issue with the stylus in that it is *supposed* to work in a pressure-sensitive way with Photoshop, but thus far only some people are able to get the right drivers to get it to work--so if you're thinking about buying a Surface Pro for digital art you might want to look into whether this is fixed (and I'll update here when mine works).  The battery life is nice because the hardware was designed for it, but that also means you want to keep your Power Options on 'Balanced' or Power Saver'--'High Performance' will suck down the battery much faster if you're interacting with the Surface for a while...this doesn't really impact the responsiveness of the 'Surface', it's just something a power user might want to keep in mind:  you're not going to want to push this thing to the top end of performance the whole time it's on.And then there's probably the biggest drawback:  the price.  At a thousand dollars or more (once you add keyboard/cables/accessories), knowing you could buy a pretty good desktop or laptop for this money, you're really buying the Surface for convenience.  It is one of (if not 'the') most powerful Windows tablets on the market today, and it is in every sense of the word a tablet-shaped computer in its power and its capabilities.  It runs all sorts of everyday computing extremely well, so you are getting a lot of bang for a lot of buck.  I am enjoying my Surface Pro very much, but I'm not sure I'm at the point where this would fully replace a desktop or laptop for everything I do.  If I wanted the most powerful and flexible tablet I could think of though, I couldn't ask for better.", "Date": "July 17, 2013"}, {"Title": "in a class all its own", "Author": "Daniel C", "ReviewID": "RHSR2FT8M2JML", "Overall": "5.0", "Content": "currently typing this review on my surface. could not be happier with it.strengths:1. workhorse2. fast and zippy3. interface (you'll love it too)4. screen resolution5. keyboard is brilliant6. build quality is top notchweaknesses:1. App store if using the RT version (will get better with time)2. battery could always get better. 7-8 hours3. somewhat of a learning curve for new Win8 usersthis is a tablet/pc in a class all its own. incomparable to an ipad or android tablet.girlfriend has an Ipad3 and she hasn't stopped playing with my Surface since I got it.thanks Microsoft. now release Win8.1 already!", "Date": "July 16, 2013"}, {"Title": "Veeeeeery good !", "Author": "Gail fleury", "ReviewID": "R3J87YDOD8EJD8", "Overall": "5.0", "Content": "Well, i was looking to buy this laptop/tablet for some months now ! Bought it and loved it ! The windows 8 works great with touch screen. I recomend buying a cover for it, so it can stay protected !. Anyway, i use it alot to work, and they are starting to have alot of apps for windows 8. So, its great !", "Date": "June 4, 2013"}, {"Title": "Great item", "Author": "Angelique S Olowe", "ReviewID": "R1S9L1R2GTR2U0", "Overall": "5.0", "Content": "Not regret with this purchase. Reasonably price for such a wonderful equipment.  My husband writes a lot of books on the go and it works so well for him that he uses it exclusively.", "Date": "July 12, 2013"}, {"Title": "wonderful, useful tablet", "Author": "nekojita", "ReviewID": "R2HPGOZAWZXSUR", "Overall": "5.0", "Content": "I've a tablet for entertainment purposes, but nothing really beats a laptop when it comes to some tasks (writing, creating spreadsheets, presentations, etc). So when given a chance to get a Surface Pro at a great deal, I took it - I'd heard that this was a tablet that *could* do the work of a pc, that actually belonged in the workplace. After getting it in my hands and activating the Microsoft Office 2013 package, I have to say that I wasn't mislead on this matter.The Pro is a bit heavier and a bit thicker than most tablets (which doesn't make it THAT heavy, it's still lighter than most netbooks out there, if not all). That thickness/heft gives you the processing ability to run multiple programs and software as well as a USB port and expand memory (more memory than other tablets out there, a friend who owns an iPad was *very* envious). The touch screen is very responsive and it takes just a little bit to figure out the new system of jumping back and forth between screens/desktop, and I think the detachable keyboard is a MUST if you're going to do any serious work on the Pro (I'd recommend the Type as opposed to the Touch as it has a more tactile feel). Response time has been very good on the Pro with the programs and the system not too difficult to figure out.All in all, it's basically a computer in a tablet, nice and (relatively) light. Perhaps it's not as thin as some other tablets, or have as many apps, but it can out-work the heck out of them, which is a lot more important to me. If you want a tablet for doing something more than playing app-based games and updating your online status, this is the one to get.", "Date": "June 26, 2013"}, {"Title": "Fantastic", "Author": "Pete", "ReviewID": "RI8GIMWS0S7FD", "Overall": "5.0", "Content": "I wanted to experience the comfort of browsing the web, watching vídeos and playing some games from the sofa. However, as a software developer I wanted a full-fledge computer in which I could run development tools, 3D design software I use as hobbyist, and didn't want to spend money in both a computer and an iPad. So I tried the Surface Pro.I CANNOT EXPRESS HOW HAPPY I AM WITH THE SURFACE!!!! Plug in the Micro display and the USB, and I can work in my desk with my normal keyboard, mouse and 23'' monitor. I CAN USE THE STYLUS, so I can work with the monitor and still draw with the Wacom pen in the tablet. I have also enabled Hyper-V so I can run two virtual machines (Windows 7 and Linux) when needed. Unplug everything, and you have a tablet, so go to the sofa and enjoy!I suppose I cannot expect it to run high-end PC games. I've tried Civilization V and it performs much better than my previous computer :).One note though: this is an Ultrabook in the form of a tablet, so the battery duration is less than a tablet, and the temperature it reaches when using the CPU more than just for browsing internet is higher.In any case, I will definitely get rid of the Surface when the Surface Pro 2 is launched :)", "Date": "June 25, 2013"}, {"Title": "WHAT A TABLET SHOULD BE", "Author": "Mason B. Yeaton", "ReviewID": "R1YLAMYC7U3DFV", "Overall": "5.0", "Content": "I have tried the Galaxy Tab II and find myself never using it. So.. I decided to try Microsoft.  The SURFACE PRO will do everything a high powered laptop will do.  Some say it is too heavy but I do not find the weight a problem at all.  This tablet, together with a subscription to Office 360, is about as good as it gets.  I use AUDIALS on it and now do all my music recording on the tablet.  I have also recorded video on it.  It costs quite a bit more than the galaxy but it is worth it because it is a tablet you will definitely use.", "Date": "June 22, 2013"}, {"Title": "Oh Surface Pro where have you been all my life!", "Author": "Noah J.", "ReviewID": "R1ZAR5LJFMJTH4", "Overall": "5.0", "Content": "The Surface Pro indeed is the tablet to end all tablets. When Microsoft designed this tablet they had a lot to compete with and to be honest I didn't think they'd be able to pull this off and at first was somewhat skeptical when I saw the Surface RT version. Not that I finally caved in and bought the Surface Pro I must say this was a job well done.The entire unit is aesthetically pleasing and was very thought out. I especially love the fact that at first glance the stylus doesn't have a place for it but then I learned from my 2 year old son! that the stylus actually goes where the charger charges the unit magnetically. I would have never thought the stylus double click button was magnetic but sure enough it is.The built-in touch keyboard is also very responsive and I'd go out on a limb and say that it functions much better than both the ipad and the note (tablet). The fact that there are 4 built-in keyboards is also a plus since it really can be utilized however your used to doing things. Also, because the unit is a full-blown OS you could even speak and let the OS type out everything for you.Con:The only CON i've found was the fact that there are no lights at all on the device letting you know that it's on/off or sleeping. It would've been great if they could have put something next to the power button stating this but to be honest this is such a trivial con.I'd highly recommend this to anyone on the fence. I've already recommended this to several people and some have actually gone out and bought one and have been telling me just how much they enjoyed the device.", "Date": "June 17, 2013"}, {"Title": "I love my Surface Pro", "Author": "Khaled", "ReviewID": "R1HR95I5QDZ7D8", "Overall": "5.0", "Content": "Came on time, Working Excellent, Powerful, Installed my Win7 Programs on it with no Problems, Have some good games running on it like WoW with no Problems, and you can run windows store apps on it.", "Date": "June 13, 2013"}, {"Title": "Very productive tablet/laptop", "Author": "Baka", "ReviewID": "R2E3QO2JIM8K5I", "Overall": "5.0", "Content": "Having owned several tablets (Android and Ipad), this is the first that I have found easy to use for productive work, as opposed to media consumption, given its full integration into the Windows environment as well as the absolutely essential USB port. If you are looking for a tablet just to watch films, post photos or read magazines on, this is not the one--it's too heavy and has too short a battery life. If you want the best compromise between a tablet and laptop in order to compose emails, write and edit documents, etc., this is the one. With the type cover or a wireless keyboard/mouse, the Surface Pro makes a highly usable ultrabook. The screen is gorgeous, the pen very responsive, and the programs quick to load. It is also a decent tablet for watching films, etc., but a bit too heavy to hold for long periods. I've had no problems with WiFi connectivity.UPDATEI ran an interesting experiment last night. I set up identical episodes (Doctor Who 2005) on my Surface Pro and Nexus 10, freezing both tablets on the same scenes. Even though it has a lower screen pixel density, consistently the Surface Pro provided a sharper, more detailed image. I have no idea of why this is, but it has confirmed my decision to unload the Nexus 10 on Ebay.", "Date": "April 3, 2013"}, {"Title": "Just switched to Win 8", "Author": "Jessica", "ReviewID": "RY2EBJV7LFRGE", "Overall": "5.0", "Content": "Went to Best Buy last weekend to look for the MacBook Air (which had $200 discount last Saturday) but ended picked Surface Pro back. The Surface Pro stand were soooo crowded cuz everybody wanted to give it a touch. On the other side, hardly anybody looking at Mac products, big surprise.The first night I cried about this product and wanted a return, which I am glad that I did not. Now after getting familiar to win 8, I am totally addicted! This thing works as a real computer, beyond that, it comes with a touch screen, which I looooove so much. I write emails, make itinerary for my coming trips, install whatever software that I installed on my PC, get full access to all webpages, and play my favorite online games. No hassle to wait for IM from gtalk anymore (on ipad, gtalk applications are a joke, takes forever to push), fancy Skype to let I talk to all friends and my parents. Easy switching between apps is my favorite.I've wiped out my old Lenovo laptop and gave it to my friends. My Ipad 2 is now only a game toy and my cat plays it more than me. Feels like I will stick to Surface Pro for a while. :)", "Date": "March 26, 2013"}, {"Title": "LOVE IT! Let me clarify some misconceptions.", "Author": "J.Roy", "ReviewID": "R3GYA75D4ARB1I", "Overall": "5.0", "Content": "The Surface Pro 2 is everything the iPad was supposed to be but failed to deliver on.  This is an absolutely amazing computing device.  I have previously owned an iPad, a Kindle, multiple smart phones, and too many laptops, desktops, and other computing devices over the last 30 years to count.MISCONCEPTION #1 - The App store isn't big enoughThe Surface can run millions of \"applications\" that have been written for Windows over the years.  It has a far bigger, and far more capable \"app store\".  I run Microsoft Office, Starcraft 2, my entire development environment including WAMP and NetBeans, Photoshop, and more on my Surface.  I still have more \"little games\" than I care to choose from in the App Store.  There is just flat out no comparison between \"app stores\" (i.e. the actual programs that can be run on the Surface compared to other tablets).MISCONCEPTION #2 - Don't compare it to an iPad or Android tablet because the Surface isn't a tabletExcuse me?  It sure is a tablet....and an awesome one at that.  The difference between this tablet and the rest is that it just so happens to also be able to replace my laptop as well.  It beats other tablets by so far that \"fans\" of those tablets don't want them compared to the Surface Pro 2.  If the Surface Pro 2 shouldn't be compared to other tablets, it is only because it is so unfair to do so since it blows them away by so much.  I cannot understate the power of having ONE SINGLE DEVICE TO REPLACE ALL MY COMPUTING DEVICES (besides my phone).  I have all of my documents, my browsing history, my entertainment, me email, my work, my hobbies, ALL IN ONE PLACE ALL OF THE TIME!MISCONCEPTION #3 - Windows 8 is hard to learnThis is akin to people complaining that smart phones were harder to learn than rotary phones.  Yeah it takes a bit longer to figure everything out--because there is so much more it can do.  After watching a couple of 5 minute youtube videos and a little experimentation, I have since found Windows 8 on a tablet to be a fantastic experience.  Unlike web browsing on an iPad, for example, the IE app has all of the controls out of the way so I can utilize more of the screen for consuming web content.  When I swipe up from the bottom, controls appear at the bottom where they are easier to reach.  The controls are large enough for me to easily use rather than having to try and tap on tiny buttons.MISCONCEPTION #4 - Windows 8 is not secureThis is one of the biggest lies Apple has somehow sold to the American public.  When comparing Windows and iOS, OSX, etc, there is no comparison.  Windows is far more secure.  Just recently, for example, reports have been made public about a MAJOR security flaw in the Apple operating systems unlike any security flaw that has been discovered in years on any other platform.  This flaw has existed in Apple products for 18 months and is still not fixed.  Linux, of course, is very secure (if that is an operating system for you).MISCONCEPTION #5 - The form factor doesn't really work for either a tablet or a laptopThe Surface weighs a little more than other tablets on a scale, but is actually lighter to use.  Why?  Because the kickstand is so naturally handy that I often have it out and propped up on the arm of my couch, my lap, etc.  So, I end up not having to hold up anything.  It ends up being even easier than the super light kindle.  So, what about using it like a real laptop?  This was my concern as well prior to purchasing it, but it has worked great for me.  First of all, I have a docking area that I plug it in to both at work and at home.  This is where I do my most \"productive\" stuff.  However, when I need to occasionally break out the type cover on the couch or on the go, it works just fine (I'm doing this review on the couch with the type cover).MISCONCEPTION #6 - The stylus doesn't hook on well and the power cord is awkwardSo, these critiques are true.  For the stylus, I just put it in my bag that I use to carry the Surface in.  The power cord is just awkward.  Why do I call this a misconception?  Because these are such TRIVIAL CRITIQUES.  Holy cow, you have the most amazing computing device in your hands and all you can talk about is the connection for the power cord and the stylus?  Seriously? That's like complaining about a small mute button on the remote for my 72\" flat screen TV.BOTTOM LINEThere has never been another computing device like the Surface.  It is so useful, so nice to use once you've spent a few minutes getting to know it, so powerful, and a true ALL IN ONE COMPUTING DEVICE.", "Date": "February 25, 2014"}, {"Title": "The Surface Pro is killer!  Although...", "Author": "Daniel", "ReviewID": "RO17XVRWJXCOF", "Overall": "4.0", "Content": "I've read all the reviews.  Played with all the tablets.  I have to say the Surface is my favorite.  Would have rather paid the RT price, but the pro came with the functions I really needed for work.To quickly touch on the cons:Reviews are correct. Battery life sucks at only 4hours. Long travel can kind of blow.Unit does get a little warm, but a leather cover I picked up makes it a non issue.App store is lacking, hopefully more coming soonPros:This thing is really a laptop that can play like a tabletThe interface is sick, very intuitive.Absolutely love the stylus and one noteGreat constructionI would recommend this unit to anyone, as long as you are willing to deal with the battery life.  Once this thing comes with 8+ hours I'll give it 5 stars for sure.", "Date": "July 14, 2013"}, {"Title": "Perfect for what it was made for", "Author": "The Kladinator", "ReviewID": "RDFJEMX4WZV3C", "Overall": "4.0", "Content": "Although perfect may not be the best word to describe this tablet, for it is imperfect, it is probably the best driver for what you need to do, if you are looking for a work slate.Right off the back the full Windows 8 pro makes this tablet a venerable laptop, ready to run all your possible applications and .exe files. Added on to this, the processor speeds and decent ram (4gb) make it a well-functioning laptop, as well, able to run most of your applications efficiently. Furthermore, the Windows store allows you to download apps as if they were on any regular tablet/android device. This is important because certain applications , that can be found in desktop mode, run better in tablet mode. One such example, in my opinion, is Netflix. And applications that cannot be found in the store can probably be downloaded on your desktop, making this a very convenient build in that regard.The touch screen is very responsive, although if you are using the provided pen there is indeed a bit of a learning curve, but that is to be expected. Typing, without an external keyboard, can be difficult. You are allowed input via handwriting while using the pen. The feature is responsive and accurate, but only to an extent and you will find that you will need a keyboard to do any serious work. Still, the pen is useful for one note and power points, if your are a student. It is easier than ever to jot down notes while your professor is lecturing; it is why I bought this tablet/laptop.If you are here, you're probably looking for an easily portable laptop/tablet that is powerful enough for you to work on while enjoying the occasional amusement via media outlets. The tablet does not feel heavy at all, although it seems thick due to the ventilation. The tablet actually seems larger than it is, but you will get used to it. In that regard, this is the near perfect transportable work slate. Buy an external keyboard for use as a laptop, and pop it off for use as a powerful tablet that you can still work on.Still, the tablet is imperfect. I am coming from a Dell XPS with strong audio systems. In that regard, the surface fails, but still the audio is not half bad and is ok, but not great. The screen resolution is alright. I do not get the same output that I would on my other devices, even my HTC one, that I would be here. The imagining all seems a bit grainy, but that, to me, is the biggest flaw.Battery life is not great, at a full charge I get 3-4 hours of life. Still, the new Power Cover released by Microsoft is only 70 dollars more than the type cover and will more than double your battery life, and that, to me, is reassuring.All in all, if you are a student or are looking for a powerful slate that will last you a couple of years, this is your item. At the price of $600 I'd buy it over competitors with less acceptable specs and even over the more powerful Pro 2, simply due to office. It is a beautiful tablet that you will love the moment it is out of the box.", "Date": "January 22, 2014"}, {"Title": "My spouse wanted a travel computer and she reviews/writes documents in MS Office", "Author": "AJ", "ReviewID": "RKPAO8ZDXV2OF", "Overall": "5.0", "Content": "She was not asking for the Surface, but her laptop was heavy and usually entailed a bulky briefcase to carry it all.  She had seen a Surface at a store and thought it seemed good.  I surprise her with this and she has loved it .  She created a PowerPoint presentation, she reviewed articles, and she's adapted this as far more functional that the iPad 1 that she had.  She can remote desktop into her office machine.  It took her some time to accommodate to Windows 8.1, and she's let me know about some of that, but now she can travel with this and shave off several pounds (some the weight of her bag to carry the laptop).So she likes and I came out a good guy,", "Date": "January 14, 2014"}, {"Title": "The power and capability of a laptop with the size and portability of a tablet", "Author": "Catrinka", "ReviewID": "REM3Y2TI5DJAL", "Overall": "4.0", "Content": "Okay, let me admit up front that I'm not able to speak or decipher fluent \"tech talk\" -- although that isn't to say that I don't constantly have some sort of device in my hands or in front of me.  I do know what I like, though; and I really like this Microsoft Surface Pro.Let's start with the actual body of the tablet and especially one of my favorite parts -- the size at 10.8-in x 6.8-in x 0.5-in and just under two pounds.  My issue in the past with tablets was the limited screen size.  The Surface Pro's larger screen and high resolution can make you forget you're even using a tablet.The Surface Pro is a full-featured device with a very responsive touch screen.  I use mine for speedy web surfing, email, movies, music, etc.  Apps are launched quickly and perform well.The device is designed with a flip-out bottom which forms a kickstand for desktop use.  The built-in speakers are of decent quality, although you'll want higher-powered speakers in order to fill an entire room with much sound.Bottom line:  The overall performance is great; battery life, eh...not so much.", "Date": "January 12, 2014"}, {"Title": "Love it", "Author": "Melvey \"Rick F\"", "ReviewID": "RVKQSY9QM38FA", "Overall": "5.0", "Content": "I have iPads, laptops, other android tablets  etc, but this Surface Pro is the best.  I especially like the Windows 8.The extra key pad makes it even more convenient. make sure you get the 128 gb ( win 8 takes up a lot of room) and the 4 gb ram is fast enough. I highly recommend this item. This is the one I use most of the time over all of my other devices.", "Date": "January 6, 2014"}, {"Title": "Great Tablet/Computer", "Author": "R. Dixon", "ReviewID": "R39EZ9CXBPLIS4", "Overall": "5.0", "Content": "I needed to replace an old lap top and I also was interested in the convenience of a tablet. My wife uses the Ipad, but it is too limited for my needs as it's designed primarily to surf the internet and check email. The Surface Pro offers me a tablet and computer in one device. The screen resolution is great, computer speed is not an issue and it runs all of my business applications. I did however, consider docking it one star for battery life. My Surface seems to get around 4 hours of continuous use. If I had it to do over again, I would have bought the Pro 2 (extra $200) with the 10 hour battery rating (probably more like 8 when you actually use it). But all things considered, this is a truly remarkable machine and I am very satisfied with the purchase.", "Date": "December 19, 2013"}, {"Title": "Microsoft Surface Pro Tablet", "Author": "Retfireman", "ReviewID": "R3X7G6VGZ7QCD", "Overall": "5.0", "Content": "This is one of the nicest Tablets that was on the market at the time I purchased it. The only drawback I find is that you cannot tell when the caps lock is on and entering passwords sometimes is a problem.  Other than that I love it.  The newer model has a lighted keyboard and I am sure you can tell whether the caps lock is on or off.", "Date": "December 2, 2013"}, {"Title": "I Love It!", "Author": "Amazon Customer", "ReviewID": "RJRA4NRQ4D20U", "Overall": "5.0", "Content": "I can't tell you about the system performance or quote you stats but I can tell you that I love my Surface Pro!  I've been looking of a fully functional PC the size of a tablet for a long time.  Tablets don't let you edit MS Office files nor do they act like a normal sized laptop.  The Surface Pro does just that.  I can prop it on the arm of my recliner & edit my Word docs just like I can on my other full size laptops.  It is quick too.  From the time you press the On button until you can work on a file is just a few seconds.  The screen is bright & clear, the keyboard is fun, & the computer itself does not make you sweat like a normal laptop when you hold it in your lap.  As an aside, when I was in Afghanistan I would work with my laptop on my lap to warm me up in the winter as the buildings were cold & drafty.  You can't do that with the Surface Pro -- it doesn't seem to get hot at all.  So if you're looking for a small, quick laptop that you can use comfortably while watching TV, this is the one to get.", "Date": "November 11, 2013"}, {"Title": "Touchscreen stylus WORKS!", "Author": "Peri Dwyer", "ReviewID": "R1J4MR3AL8WS49", "Overall": "5.0", "Content": "My old Lenovo X61 gave up the ghost and I replaced it with a different tablet, but was appalled at the lack of precision on the capacitive touchscreens.  I did my homework and this is the only tablet-PC hybrid which actually has a stylus-screen combo that is more like a pencil than a dull crayon. The built-in handwriting recognition app works surprisingly well, an added bonus.Wish it wasn't Win8; I wish Win8 didn't exist. But given Microsoft's propensity for shoving crummy OS's down our throats, this tablet is the best it could be.", "Date": "October 31, 2013"}, {"Title": "Just Plain Awesome!", "Author": "Prime Customer", "ReviewID": "RY7UNTTSZ70XC", "Overall": "5.0", "Content": "The Surface Pro is the device I've been waiting for.  I did not purchase from Amazon, as it was given to me as a gift - but I would have.  Yes, this is heavy device compared to the tablets on the market - but this is a true slate device. This is a productive PC. (So silly. Compare it's weight to a laptop and it wins.)  I have all of MS Office, Outlook and OneNote! And add MS Visual Studio, Eclipse and other software development tools to be very productive (and yes, I can still even play Angry Birds and watch Netflix if needed). With my work VPN installed, and click keyboard this is a perfect at home, work, or traveling device. I use with keyboard and snug case as portfolio at work. Super device! Snugg Microsoft Surface 1 & 2 Leather Wallet Case in Black for RT and Pro - High Quality Case with Card Slot, Pocket and Premium Nubuck Fibre Interior", "Date": "October 28, 2013"}, {"Title": "Better than any laptop I've owned", "Author": "Barry D. Cooper", "ReviewID": "R3KWT9IBQQBRC4", "Overall": "5.0", "Content": "I bought this because my Win Vista laptop was finally getting to the point where I would boot it up and had plenty of time to brew coffee and come back to it before being up. Also, I managed to wear out several keys and the mouse keys on the touchpad, so I wanted a Win 8 replacement. I also have an old gen 1 iPad that needed upgraded, so I thought I could kill two birds with one stone and get a tablet/PC that will replace both. That is what the Surface did. It is a great PC with the ability to put on the additional keyboard, Bluetooth mouse, and there is also a docking station where monitors can be set up. The USB 3.0 port is far above what I had before. It also ties in well with the Xbox and turns out to be a great media center device. Windows 8 is also very effective on a touch-screen device which I know has been a huge complaint about pure desktop users.", "Date": "October 7, 2013"}, {"Title": "Dream tablet/Laptop - 3 in 1 Device", "Author": "Raed Khaddaj", "ReviewID": "R2TJ92FGB2C2A4", "Overall": "5.0", "Content": "I am writing this review after being using the Surface Pro with Touch Type Keyboard for about 15 days and here are my notes:Overall: Great looking dream tablet/Laptop, fast performer, Instant ON/OFF Windows like a smart phone, Fast core i5/SSD drive Performance, Full HD Stunning display, Fast (75MB/sec) USB 3.0 Data Transfer from/to external USB 3.0 Drive, Pen is great alternative to Mouse for regular operation especially in \"Microsoft Excel\", Built in Windows 8 Internet Explorer is super great and joy to use for daily browsing, email built in client is usable and super-friendly to usePro Opinion: I am a Windows/Web developer and I Installed Heavy development tools including Visual Basic .NET version 2003, 2008, 2010, 2012, Microsoft SQL Server 2008, Microsoft Office Pro, EasyPHP with MySQL,  and many other utilities and software, and I still have 45 GB free space without removing the recovery partition which is about 7.5GB. I simply replaced my 3 years old Toshiba i5 Laptop with Windows 7 and I now do all Windows/Web Development from Windws8 Surface Pro. Stunning....Fun Part Opinion: WIndows 8 Metro Apps or native apps are also very good. I am not fond of games but my 2 kids are and they downloaded many interesting games from the Microsoft Store and they are all great. If Microsoft Store is not enough, Download and install \"BlueStacks\" (Just search it in google or bing) and you can download and run all apps from Google Apps store..  you have now an Android tablet inside Windows 8 running in full screen or a a smaller WindowBattery Life: With Power saver mode , you can get easily 5+ hours of continuous work. Please remember the Instant ON/OFF feature and it can last for more that 2 days of on-demand use.  Most important thing it is a Core i5 tablet with performance and feature 10s of times compared (Although not comparable) to other Pure tablet even the Surface RT. When on desk and using it as a laptop turn power mode to \"balanced\" and you are now working on full fledged SSD LatopFinally, What a Laptop/Tablet Device. Well Done Microsoft", "Date": "April 23, 2013"}, {"Title": "Happy and Disappointed", "Author": "latrenda", "ReviewID": "R3N5BKSRHUFA4V", "Overall": "2.0", "Content": "The main reason I purchased the Microsoft Surface Pro was because I have carpal tunnel. And I need to use my ergonomic keyboard for any long term typing.My laptop was getting old.  And I thought that it would be great to have something compact enough to carry across campus (I work at a school) but versatile like a regular computer. It partially delivers.Pros1. It recognized my ergo keyboard right away and it works great2. Acts like a normal computer. I love the fact that I can have more than one window open at a time.3. Compact and portable.4. The on screen keyboard is laid out nicely. I can almost touch type on it. (I use it for short typing sessions but attach my Ergo keyboard for long typing sessions.5. Screen resolution is nice6. USB port. I've only used my keyboard on it so far, but I'm guessing this is going to be convenient for other things.7. The built in kickstand is nice8. Flash works. So I can play Hulu. I do all of my TV watching on the computer since the digital switch.9. It boots up quicklyCons1. Very heavy for a compact computer. But I knew what I was getting into. I read the specs before I purchased and I knew it was two pounds.  Plus I don't really mind the extra weight if I get the added convenience of a USB port. I didn't take off any stars for the weight issue.I wonder about those commercials where everyone is dancing around with these heavy devices. I suspect some muscles were built up during rehearsals. Well, actually, I'm guessing they  probably aren't using real Surface tablets.2. The speakers aren't good at all. When I play shows in Hulu or Amazon instant video, I can't hear what's going on even if I put the device right next to my ear. I make sure the volume is all the way up in the program and on the device.  I tried a couple of videos in YouTube and the volume seems almost adequate. I know we have to give up a few things for the size convenience but for 1K, I think being able to hear my programs is a reasonable desire.  I can hear the same shows easily on my Kindle fire and my  super old laptop.This is the main reason that I'm giving this product only two stars.I'm going to search on the internet to see if there is a fix for this. Or if anyone reading this has any ideas, please respond. I'm considering returning it for this. I'm wondering if something is wrong with my tablet.3. Speaking of something wrong. I wonder what happened to my automatic onscreen keyboard. On the first day, the keyboard would pop up whenever I moused over a web address window or a document. Now it won't. I have to manually open then manually close the keyboard. It's annoying.  I wonder if this happened after I hooked up my ergo keyboard.  The onscreen keyboard wont pop up even when my ergo keyboard is not installed.I went to the device's website. All the suggestions were things that I have already tried - installing updates, restarting the computer, etc..If anyone has any idea about this, please respond. Thanks4. For 1K, storage space is small -- 128 GB. But I can live with that since so much stuff is online now anyway. And with the nifty USB port, I can use a data stick or external hard drive or something.5. Battery life is super short. I knew that from some of the reviews before I purchased. At first I thought I could live with it. But the more I think about it, it's not really all that portable if I can't  stray far from an outlet for any length of time. Marking down for this.6. For 1k, I think it should come with a cover.  Marking down for this.Someone mentioned the MacBook Air in a review. I'm wondering if  I should get one of those instead. It's not much heavier, has longer battery life. I don't' know about the volume. There would be a learning curve for me. Any thoughts?My old laptop is 5 pounds. Sounds really light but feels quite heavy lugging across campus - with lunch, jacket, books, etc..ThanksLa Trenda", "Date": "June 24, 2013"}, {"Title": "Surface Pro does what it's meant to do", "Author": "Monty Rogers", "ReviewID": "R3OGOBWDR2E4SK", "Overall": "4.0", "Content": "After reading perusing the negative reviews its obvious that those persons are newbies and not Tech savvy.  I'm an IT professional (MCSE, CCNA, CCA, MCNE and the list goes on) and have owed  an an Intel machine since the 8088 in the 80's.  Owning a Mac Mini, MacBook Air, 27\" Thunderbolt display and every generation of iPad since they were released I can say that I'm not married to either Microsoft or Apple.  The Surface Pro is breaking new ground  it cannot be compare to any tablet or ultra-book on the market. It needs to be rates as a standalone device and on its own merit doing otherwise is patently silly.I absolutely hated Windows 8 on my desktop computer. The touch screen interface of the Surface Pro makes Windows 8 \"make sense\". Things are now more intuitive. Users will need to understand that there's a learning curve associates with this totally revamped Windows. If the folks out there are anything like the users I support at work reading is some kinda mythical skill that only high priests can do. I believe that if folks would do,simple things like read the Getting Started Guide their experience would be greatly improved.Further, I don't understand why people leave nasty reviews for the Surface Pro when their complaint is with with an accessory like the keyboard or Wedge mouse.  Duh!The only reason I'm not giving the unit 5 stars is because Microsoft is falling short in accessory/peripheral/department.  C'mon Microsoft produce a docking station.Below is an excerpt I found on the Forbes site.  It sums things up rather eloquently:Microsoft has carved out a new space in the tablet and ultrabook market with the introduction of its Surface Pro. The question for consumers, and especially business users, is where does it fit, what is its primary use, and what specific functions will it serve that would justify the near-$1,000 cost? Even more relevant to consider: how do you use your tablet now, and would using a Surface enhance that experience, or your productivity?I have been using a Surface Pro for a few weeks on the road to figure out its potential as a business tool for us travelgeeks, especially the ones who go internationally.My take: The Surface Pro is really an enhanced netbook with a fast processor (Intel third-generation Core i-5 1.7 Ghz with 4 GB of ram) and touch screen in a 10.6\" package with a clever magnetically-linked keyboard and kick-stand. It is a hybrid between a tablet and ultrabook, but the reality is that it is not the best solution for either and by necessity has certain built-in compromises. Microsoft has clearly created a unique piece of sophisticated and solidly built hardware with top-of-the-line components and elegant and simplistic tablet design that creates its own space, but is that enough?  First Impressions: Microsoft Surface Pro  Jason EvangelhoJason Evangelho Contributor  Surface Pro Can Run Diablo III, Portal 2, Other AAA Games - Why Isn't Microsoft Evangelizing This?  Jason EvangelhoJason Evangelho ContributorWhy Microsoft Looks Risky In 2013  Panos MourdoukoutasPanos Mourdoukoutas ContributorHow their vision coincides with market reality and demand remains to be seen, especially if you are not a fan of Windows 8. An in-depth article by Jason Evangelho describes its features and talks about some of its drawbacks from a different perspective from mine.Many are comparing the Surface Pro with the iPad third or fourth generation tablet, or (probably a more accurate equivalent) to the 11\" MacBook Air. One thing's certain: it is not an iPad and never will be in terms of functionality, connectivity, weight, ergonometric, apps and screen resolution. But it really was not designed to be. The Surface Pro is more akin to a multi-function 10\" laptop than a tablet. It suffers by comparison to tablets but it shines in comparison to lugging around a heavier full-featured computer when you travel. I travel a ton and predominantly work in Windows, although I carry an iPad and MacBook Air 13\" (running Windows). I thought it would be great to be able to work with a smaller notebook when I wanted the convenience of an iPad but needed the ability to run full Windows programs. That was obviously what Microsoft had in mind.In either mode (tablet or ultrabook) the Surface Pro offers certain clear advantages over iOS or Android, but it has, in my view, some near fatal-design issues that may keep it from being adopted in the mainstream for either use. I have been using the Surface Pro as an alternative to my iPad and laptop to determine whether it has sufficient utility and is worth the price, considering its limitations.One of the primary deficiencies with all iOS and Android-based tablet-computers except the Surface Pro is their inability to run full Windows programs especially for productivity. While Microsoft touts the fact that their tablet will run millions of Windows applications, for the most part they are really programs. Apps, especially ones customized for a tablet, are often vastly more convenient to run. The Microsoft App store has a paucity of applications and is almost laughable when compared to Apple and Google. When I tried to match the 60 Apps on my iPad and Android, I found almost none existed in the Microsoft store, and some programs will still not run on Windows 8.", "Date": "April 20, 2013"}, {"Title": "Surface Pro great tablet, great service application automotive diagnostics", "Author": "Mounty 3", "ReviewID": "R5E6GR6SLFD8W", "Overall": "5.0", "Content": "We purchased two units 128 GIG with 64 GIG expansion cards from ManjaTech, not only was their service excellent the units arriving within a few days after requesting if it was possible to supply ASAP, we wanted to show them loaded with our diagnostic SW at the AAAA trade show, Darling Harbour in Sydney last week.The Surface Pro has exceeded all of our expectations, we are able to run all products vehicle diagnostic SW, OEM oscilloscopes, gas analyser SW, scan tool vehicle diagnostic SW for VAG vehicles and USB dongle protected training software. Some of the manufacturers were doubtful this was possible on the Pro however we have found it worked perfectly.Many thanks from all the team, [...]", "Date": "April 21, 2013"}, {"Title": "Love It!", "Author": "JLCReader", "ReviewID": "R38T94NIXMX1KG", "Overall": "5.0", "Content": "Great little machine.  Completely went cold turkey from my laptop.  Not as light as I would like, but with that heft comes a fast speed and brilliant display.  Only drawback is Windows 8 bugs.  Would love it if Outlook ran properly, but it seems to be very buggy with Windows 8.", "Date": "August 7, 2013"}, {"Title": "The best device I've ever used", "Author": "Chima Nnadozie", "ReviewID": "R11211OOL9MHSQ", "Overall": "5.0", "Content": "I have had my surface pro (SP) for 3 whole weeks and I have not been able to put it down. Before the SP I owned the Asus Transformer infinity (TF 700T) plus keyboard dock. I wont compare the two since there is no basis with the SP being an ultra book and all. But the Asus has gone to my 12-year old son.The SP does everything I expect  - it is fast, does not lag, has handled all the programs I installed, display is crisp and sharp, productivity is excellent, using the included stylus is a joy. My HP elite book has hardly been touched since the SP arrived. This definitely the post PC era.I wish battery life was longer. I usually get about 4 hours out of the SP. But that is because of heavy use and I can live with that.", "Date": "April 19, 2013"}, {"Title": "Excellent Machine", "Author": "Joseph N. Cohen \"Joe Cohen\"", "ReviewID": "RH0VZOW6XEQLR", "Overall": "5.0", "Content": "Screen is crisp.  Battery life is fine.  Typing is comfortable.  I am actually getting to like the stylus.I don't know why everyone is complaining about Windows 8.  For $5 you can buy a program called Start8 from Stardock that basically makes a Win7-like screen the default.  On my tablet, I only have to deal with the Metro interface if I want to.The apps on Microsoft are absolute crap.  That being said, I'm 100% with the guy who says that you have no reason to care about apps.  This is a full-on computer, and not a bad mid-level one at that. I use Microsoft Office and Adobe Creative Suite -- what does the iStore offer that competes with that?  I also play Skyrim and Chessmaster 9000 instead of some 1990s RPG or some crap chess game.  I run advanced statistical analysis programs like Stata and R.  If I need this computer to have a specific type of functionality, I just download the actual program that does the job well.  I think that people have lost sight of the fact that apps are a poor man's standard computer program, and there's really no reason to bother with them when you don't have to settle.Moreover, if you are sore about screen space or the crowded keyboard of a portable, buy a $50 docking station, hook it up to dual monitors and a big fat keyboard and mouse, and you basically have a pretty good desktop.  Likewise, if you want more drive space, set up a wireless external drive -- they're like $100/Tb.You do not have to comprise with this computer, unless you feel that you're entitled to some dual monitor, 1 Tb beast that weighs 2 lbs, has 8 hours of battery life, fits in an attaché case, and costs $400.  Get real.A great job from Microsoft.", "Date": "April 8, 2013"}, {"Title": "Exceptional tablet and computer in one package!", "Author": "Curt Grimstad", "ReviewID": "R1F7ORTJ50FUWF", "Overall": "5.0", "Content": "You could easily find the Surface Pro's \"soft-spots\". It is a little too Heavy, it misses 3G/4G, it's battery With 4-5 hours (should have been 9-10) and its 128GB SSD (should have been 256GB).Despite these clear negative spots, I have put my IPad away. The Surface gives me the power of the i5 processor, the full Office 2013 package, all software packages I need (and did use on my IPad) like Evernote, Onenote, e-mail (privat and work), Lync, Skype, Netflix, Box, dropbox, Wimp, Kindle, Amazon, Pulse (News), Hotels.com etc. - and more come.  As well as a perfect Web-Reader.Its work and private use in one terrific package.", "Date": "March 26, 2013"}, {"Title": "Heavy, bad battery life and multiple problems with seller", "Author": "NHMedic431", "ReviewID": "RTEKACX3VKSCE", "Overall": "2.0", "Content": "Arrived missing the stylus and with a bent cord that was positional.  Also arrived with an invalid microsoft serial number.  After spending hours not he phone with microsoft to get it right I found that the battery only lasted about an hour of normal use.  I ended up returning and getting a surface pro 2 that was much more reliable.", "Date": "April 27, 2014"}, {"Title": "Not complete!", "Author": "Chainsaw", "ReviewID": "R16LGFDTPQYXCD", "Overall": "1.0", "Content": "This tablet did not come with office or a stylus. By the time I buy both, it will be more than what Best buy charges.", "Date": "April 5, 2014"}, {"Title": "Very good and high quality.", "Author": "tana", "ReviewID": "R2JBM8AP43QDZV", "Overall": "5.0", "Content": "Because this product really very good and high quality. My friend recommend buy this product and I am happy. Thank you.", "Date": "March 18, 2014"}, {"Title": "If you want windows 8 and a touch screen, I recommend this product.", "Author": "Kyle Swenson", "ReviewID": "R22G54ZG5MKWEX", "Overall": "4.0", "Content": "This tablet is great, and gives you the total windows experience on a small tablet. I also purchased the attachable keyboard, and it works great with this product.It is a little thicker than I am used to for a tablet, but as it is a fully functioning windows pc, I do not mind. Works great for general browsing, excel, outlook etc.", "Date": "March 10, 2014"}, {"Title": "Great Buy", "Author": "Norma Barclay", "ReviewID": "R1ROZIVLQKG7FR", "Overall": "5.0", "Content": "I absolutely love my surface Pro and all the accessories that came with it. Was a quick and easy purchase. I received it in great timing.", "Date": "March 9, 2014"}, {"Title": "excellent product", "Author": "George D Tsoukalas", "ReviewID": "R12BEBXW1TB926", "Overall": "5.0", "Content": "The price point of this product and the built quality make it very difficult to beat. Very happy with it", "Date": "March 8, 2014"}, {"Title": "I hated windows 8, but I love this!", "Author": "Brandon", "ReviewID": "R1HWKTPNA6I0KW", "Overall": "5.0", "Content": "I was able to save photoshop on the device and after a while I did learn how to use pesky windows 8.. Great Device, I love it for photoshop since I can draw on the screen!", "Date": "March 8, 2014"}, {"Title": "Surface Pro out proforms the RT", "Author": "Vince", "ReviewID": "R25N8HEB28N30S", "Overall": "5.0", "Content": "Exchanged the RT for the Pro what a difference, does everything you would expect from a tablet, very happy with the new surface pro.", "Date": "March 5, 2014"}, {"Title": "good material", "Author": "Luay Samoudy", "ReviewID": "R2MH024UHXUOMR", "Overall": "5.0", "Content": "this is good item and works excellenti am happy to get this itemits work very excellent and its original one", "Date": "March 4, 2014"}, {"Title": "I did not keep it, but it was awesome regardless.", "Author": "Steven", "ReviewID": "R2T0HB7UOJQ2K1", "Overall": "5.0", "Content": "I plan to get one, either a bit cheaper or a bit later when I can afford it. But it is a great machine. It really is. I discovered it when I was looking for a gaming tablet ( kind of not really a good thing to look into much anyway), and if you are going for something that is capable of casual gaming, but nothing too hardcore then it should be good. But, this should not be something if you are looking just to \"game\" on. You can search which games you can run on youtube.But regardless, this is a beast! It is a full windows PC laptop in the shape of a tablet. It you want something portable, to get your work done, surf internet, anything you do on a PC. This is definitely good.Battery life is not really as horrible as some say, you wont find yourself running to a power outlet in an hour or 2, but it should last you about the same as an average laptop 4-5 hours.Stylus is cheaply made, but it is a great accessory anyway. I will definitely pick it up again, once it gets cheaper or I get enough money to spend on it.", "Date": "March 2, 2014"}, {"Title": "sometimes it runs bit slow.", "Author": "ariuka", "ReviewID": "R1YE4O1SXOBH0J", "Overall": "3.0", "Content": "I was not sure to buy surface pro or macbook air. Few days later, i decided to buy the surface, i liked it and a months later it offered me to update Windows 8.1 which is really cool. However, its keyboard is very easy to get dirt, i wish its keyboard was plastic and its kick pack is sometimes really hard to put any position i want. Also, it is slower than the macbook air, my roommate has macbook air, and when we run exactly the same page, hers run in a second, but mine sometimes take 2,3 minutes, sometimes more than that specially for video. And ,i cant really understand why, because both mac and surface has 4gb ram but very different speed :(((", "Date": "February 25, 2014"}, {"Title": "Extremely happy with Surface Pro", "Author": "LizardWizard", "ReviewID": "R2U9MEHN0IE00X", "Overall": "5.0", "Content": "Have an iPad and Samsung 10.1 tablet and both are great but hardly use them now after getting the Surface Pro.  About the only thing I wish is more storage space but if you are diligent on what you store on the Surface Pro then no problem.  Very fast and just about the right size to carry around.  Because it's ready to be used in just a few seconds like my other tables it make it a joy to use. More features then my other tablets and can use regular software.  Highly recommend.", "Date": "February 17, 2014"}, {"Title": "sometimes it runs bit slow.", "Author": "ariuka", "ReviewID": "R1YE4O1SXOBH0J", "Overall": "3.0", "Content": "I was not sure to buy surface pro or macbook air. Few days later, i decided to buy the surface, i liked it and a months later it offered me to update Windows 8.1 which is really cool. However, its keyboard is very easy to get dirt, i wish its keyboard was plastic and its kick pack is sometimes really hard to put any position i want. Also, it is slower than the macbook air, my roommate has macbook air, and when we run exactly the same page, hers run in a second, but mine sometimes take 2,3 minutes, sometimes more than that specially for video. And ,i cant really understand why, because both mac and surface has 4gb ram but very different speed :(((", "Date": "February 25, 2014"}, {"Title": "Extremely happy with Surface Pro", "Author": "LizardWizard", "ReviewID": "R2U9MEHN0IE00X", "Overall": "5.0", "Content": "Have an iPad and Samsung 10.1 tablet and both are great but hardly use them now after getting the Surface Pro.  About the only thing I wish is more storage space but if you are diligent on what you store on the Surface Pro then no problem.  Very fast and just about the right size to carry around.  Because it's ready to be used in just a few seconds like my other tables it make it a joy to use. More features then my other tablets and can use regular software.  Highly recommend.", "Date": "February 17, 2014"}, {"Title": "Wonderful device for art!!", "Author": "Alex Redmon", "ReviewID": "R1WN8YDG81F8BZ", "Overall": "5.0", "Content": "I purchased this a few months ago and I'm still using it religiously.Pros:-sleek-fast-touchscreen-optimized for windows 8.-wacom feel digitizer.-sturdyCons:-supplied stylus is really odd. I purchased the Feel stylus from Wacom.-Rigid kickstand-UEFI bios makes it difficult if you're wanting to dual boot OS. (There are ways around it).", "Date": "February 13, 2014"}, {"Title": "Excited", "Author": "Michael Garay \"Logan G Inc.\"", "ReviewID": "RHZ1FDTN9LM1W", "Overall": "5.0", "Content": "I was not familiar with tablets in general.  The surface is well made and the screen colors are brilliant.  I'm still configuring it as I write this review.", "Date": "February 13, 2014"}, {"Title": "You can’t go wrong with Microsoft Surface and Windows 8", "Author": "Willem Goosen", "ReviewID": "R3QY8Y3EA2QFR4", "Overall": "5.0", "Content": "It is work and play. With other non-Windows 8 tablets the kids inherit them after 6 months as you cannot really integrate it.Yes other app stores are bigger and have a lot more stuff usually there claim to fame. The thing is you can take a surface out of the box and immediately start to work and play. You do not need to go and sift through thousands of apps install, reinstall and maybe find something to accommodate your needs. It works immediately.", "Date": "February 12, 2014"}, {"Title": "I like it", "Author": "steve_o_tx \"steve_o_tx\"", "ReviewID": "RTQQZ4R10MW76", "Overall": "4.0", "Content": "but for the price you would think they could throw in one of those keyboard deals especially since the commercials always show them with one.", "Date": "February 6, 2014"}, {"Title": "Awesome tablet!", "Author": "jesse r", "ReviewID": "R3KP605J89OTTI", "Overall": "5.0", "Content": "This is probably the best tablet out there, it has loads of memory, you can play games online, you can purchase games from xbox, watching movies from netflix or from microsoft is awesome. I like that the keyboard is detachable and magnetic. The power is also magnetic and it can charge a high current phone cause there is a usb port on the charger. The stylus is really responsive and it doesn't see your palm so you can rest it on the tablet when writing. I rally love this tablet!!!", "Date": "January 29, 2014"}, {"Title": "The Best", "Author": "Jerardo De Leon", "ReviewID": "R34RJ7FEBGLFRU", "Overall": "5.0", "Content": "The Surface is great, easy to use. Love it. Quick delivery in my book. Will put my desktop on retirement for a long time.Thanks", "Date": "January 23, 2014"}, {"Title": "Great hybrid device", "Author": "Steggy18", "ReviewID": "R3M7Z5LK1FBZO1", "Overall": "4.0", "Content": "I have become a huge fan of this device and never thought I would have. The screen size and quality are fantastic and make everything from watching a movie to reading a book to surfing the internet a great experience. I would recommend getting the type keyboard as it is closer to the feel of a real keyboard. Also getting the HDMI out accessory which allows you to broadcast anything on your Surface Pro to a TV or other display through an HDMI cable.The only reason why I cannot give this device a 5 star rating is due to the 4-5 hour battery life and the fact that the device tends to get pretty hot even with the built in fans.This is a great device and I would highly recommend it. Do not listen to those who are comparing this to an iPad because this is so much more than that. Do yourself a favor and try one out and play with the Windows Metro experience and you will be hooked on its ease of use. Plus you will get the traditional PC experience while on desktop mode.I am looking forward to the release of the Surface Pro 3 and will most likely be getting myself one!", "Date": "January 22, 2014"}, {"Title": "Great Replacemet Tablet", "Author": "Jorge J Abudayeh", "ReviewID": "RQLL950GTVVG6", "Overall": "5.0", "Content": "Purchased this as a gift and a replacement to my wife's laptop, she is very happy with the way it handles her tasks, now she can do her work without having to carry a heavier laptop.", "Date": "January 20, 2014"}, {"Title": "Great Replacemet Tablet", "Author": "Jorge J Abudayeh", "ReviewID": "RQLL950GTVVG6", "Overall": "5.0", "Content": "Purchased this as a gift and a replacement to my wife's laptop, she is very happy with the way it handles her tasks, now she can do her work without having to carry a heavier laptop.", "Date": "January 20, 2014"}, {"Title": "Great tab if you know what to expect.", "Author": "B. Yearwood", "ReviewID": "RURW4UC20N36B", "Overall": "4.0", "Content": "It is by no means a replacement for your ipad, or android tablet. Its a replacement for your laptop, or desktop(did someone say full, and legacy Windows apps?)My biggest complaint would have to be the speakers. I dont know what they were thinking when they made a $1000 device, and put 50 cents worth of speakers in it.I was skeptical of Windows 8, but its right at home on a tablet. The desktop feels like an ad on though. Overall its a great experience. I'm glad I purchased one. I might even be in the market for an RT soon!", "Date": "January 13, 2014"}, {"Title": "great product", "Author": "Terry Powers", "ReviewID": "R14A65E6TT4FN4", "Overall": "5.0", "Content": "I purchased this for a salesperson to use out in the field to do estimating and she loves this computer.", "Date": "January 8, 2014"}, {"Title": "4 months in use.", "Author": "MusiqxNerd", "ReviewID": "R221OF48PKLSAV", "Overall": "3.0", "Content": "This system is starting to trip out on me after 4 months of use. Double clicking on screen, selecting icons upon hovering--all this happening with little effort navigating on the screen. Yellowing strip appearing on right side of screen...also, keyboard was so expensive and its already wearing out---lame.I only like that it starts up fast but its already tripping up. i want my money back.", "Date": "January 7, 2014"}, {"Title": "This arrived well before the estimated arrival dates!", "Author": "K. L. Weber", "ReviewID": "R1P493WK50HMNA", "Overall": "5.0", "Content": "This is in great condition and I really like this tablet.  It will be good for college classes and just about anything I need to do. You can't beat the portability of this machine!", "Date": "January 5, 2014"}, {"Title": "I luv my new surface", "Author": "Glen Jarvis", "ReviewID": "R2VPMCZ55GBJO4", "Overall": "5.0", "Content": "This product was everything i expected and more. I luv my new surface Pro. It has replaced my clunky 17\" thinkpad. Worth every penny", "Date": "January 2, 2014"}, {"Title": "Get it!", "Author": "Jennelle", "ReviewID": "R2DPN4YGDE5KT8", "Overall": "5.0", "Content": "Great product! Affordable, fast. Its like a computer the size of a book! One of my better purchases. Great buy!", "Date": "December 12, 2013"}, {"Title": "Awesome tablet but you can find it cheaper at a Microsoft store online or local.", "Author": "anthony pellouso", "ReviewID": "R2IIY6L9HO8HG0", "Overall": "5.0", "Content": "This is probably the best tablet for the money, except for the surface pro 2 of course... Microsoft sells this brand new for 699 and the 128gb is sold for 799.  Much better price and still a really good product.", "Date": "October 24, 2013"}, {"Title": "Great Tablet!", "Author": "rlort01", "ReviewID": "R2G082F5CDALFY", "Overall": "5.0", "Content": "Best tablet I have owned.  Coming from Apple and Android based tablets, the Surface offers everything I need in one device.", "Date": "June 24, 2013"}, {"Title": "Well designed....", "Author": "Biggles \"burnt-oak\"", "ReviewID": "R26DQ4F8MTIEAK", "Overall": "4.0", "Content": "...but a ton to get used to for one familiar with traditional Windows.  I still can't URL's in email to launch, but must be an option.  Again, VERY frustrating but after a few more weeks it should be OK.", "Date": "June 17, 2013"}, {"Title": "BEST BUY AND MICROSOFT LOWERED NEW PRICE TO 599.00", "Author": "becky hunter", "ReviewID": "R3INKA432BMQJB", "Overall": "5.0", "Content": "Check it lout.  Best Buy and The Microsoft Store have the Microsoft Surface Pro for 599.00!!!!  They  come with the Keyboard too!", "Date": "January 4, 2014"}, {"Title": "Awesome Multi-purpose Computer", "Author": "Amaryllis", "ReviewID": "R2V0GVZI6V2QW2", "Overall": "5.0", "Content": "This review is for the device only, not this seller. I suggest going to a Microsoft store or ordering from the Microsoft website as the Surface is cheaper there, plus you may get a deal on the warranty.I was in dire need of a new laptop and bought the Surface Pro soon after it came out. I absolutely love it. It is super portable, light, versatile, good build quality, and Windows 8 was basically made for this type of device.Surface Pro as a desktopIf you are planning to use this device for a lot of work, a mouse and second monitor are highly recommended. The Surface has a DisplayPort, the same one that is used for a lot of Apple devices. This means that there are plenty of $5 knock-off adapters for any display you want to connect (I have HDMI, DVI, and VGA, all worked flawlessly). In terms of performance the pro is snappy. It has opened all my large office files, no problem (think excel files with 20,000+ data points in graphs). The USB port is great for easy file transfer, attaching presentation clickers, cameras... all that good stuff. Too bad there is only 1 USB port. I purchased the touchcover and have been getting better at typing on it every day. Don't think I will purchase an external keyboard.I thought that I would find the Metro interface bothersome when using the Surface in desktop mode, but it really isn't. I have tiles for my most used programs and they automatically redirect to the desktop if it is a desktop program. If you have an extra monitor connected, you can view the desktop on one screen and the metro screen/apps on the other. I usually work on the big screen and then either have a reference website/pdf of my e-mail open on the Surface screen. Metro apps tend to be scaled better for the surface screen size than desktop apps to this is a nice plus.Surface Pro as a tabletIn a lot of reviews the Surface pro was compared to the iPad and dismissed as heavy. Considering that it is a full blown computer I think this is stupid. Nevertheless, the Surface makes a fine tablet. The mail program and IE Metro browser are both excellent. I would say that it is heavy to hold in one hand unless you are supporting it from the bottom, but usually I am just sitting on the couch and prop it up on my leg or on a pillow.Pen InputThere are a lot of neat things you can do with the pen. Obviously there are drawing apps, but the Surface also has very good handwriting recognition. If you are using it as a tablet and need to type something you can just use the pen to write, much quicker. It is also great for presentations. The new powerpoint has excellent second screen support (presenter view with timer and next slide preview) and you can use the pen to annotate slides or as a laser pointer by selecting laser and pointing it at the Surface screen.Some Cons(1)As of this review, the built in calendar app does not sync with Google calendar and I am very disappointed about this. Google has also not made any Metro style apps for it's services. I have not found a good alternative calendar (apps are not that plentiful).(2)Scaling can be a bit weird. Because of the high resolution screen, some program icons don't appear as nice. The default scaling is 150% and this works pretty well in most cases. One exception is Chrome. Right-click on the icon, select properties. Go to the compatibility tab and check \"disable display scaling...\" Then use Chrome's scaling under settings to get the font size you need. This works for other programs too.(3) Metro vs Desktop IE: I like the Metro IE, but am a Chrome fan on the desktop. Once I installed Chrome I made it my default browser. All of a sudden, I could not access Metro IE. It would just go straight to the desktop IE. It turns out that you can only use Metro IE if you have IE as your default browser. Stupid power grab by Microsoft.Buy this from the microsoft store, not from here. It's cheaper and you can get a good extended warranty there (this thing if not fixable).", "Date": "April 27, 2013"}, {"Title": "Love this thing", "Author": "Soil guy", "ReviewID": "R2C2U3NCEFXHVQ", "Overall": "5.0", "Content": "I've had in my possession a number of different touch-enabled devices but none of them come close to the Surface Pro just in terms of what I can do on the device.  I'm a researcher and use a variety of simple and sophisticated software packages for analyzing and modeling my data.  I also travel a lot, and so was looking for a machine that could adapt to my needs, such as can be used in the tiny airplane seats, and has a good battery life.  Up until I purchased the Surface Pro, I used an Ipad 2, which is a good machine, but has a frustrating lack of good productivity capabilities and software.  It's really more of an entertainment device.  But with the Surface Pro, I get full Windows functionality, including MS Office.  I've had the Surface Pro for about a month now and am completely happy with this purchase.  I have loaded all the software I use on my laptop PC, and it works beautifully on the Surface Pro.  There is absolutely no difference in performance between my laptop PC and the Surface Pro.  The only disadvantage is that the Surface Pro is limited to a 120 GB drive, but with a USB port, I can easily plug in a portable hard drive, or for that matter, utilize any USB-compatible device, such as VGA adaptor, etc.  The touch screen is very nice and flows well - it's almost as good as using a mouse, and works well with Windows 8.  Navigating in Windows 8 is not nearly as intuitive as navigating on the Ipad, but it's not bad either.  I have the black keyboard that is very functional and feels nice.  Using the Surface Pro like a laptop (such as sitting on your lap) is difficult because it is only propped up by a stand that pops out the back, and there is no stability offered by the keyboard unlike the Zagg keyboards I use with my Ipad.  I also ordered the Surface Pro edition of Microsoft's wedge mouse, which works really well, except the touchpad replacing a roller wheel for scrolling is a little too sensitive, but overall I'm really pleased with it.  I've read people complain about the charger but I've never had any problems with it.  It takes just a bit to figure out how to line up the magnets the right way, but once you get used to it, it works beautifully.  Overall, I'm really impressed with the quality of this machine - especially since this is the first generation release.  As a new product, I hope the Surface Pro stays around for a long time.", "Date": "April 25, 2013"}, {"Title": "Great Replacement for my Motorola Xoom", "Author": "Ufuoma Umukoro", "ReviewID": "R32BLV1844IX4W", "Overall": "5.0", "Content": "Great, exactly what I needed. Now my tablet and PC are one. Now I do not have to look for compatible software. And the USB , just loving it", "Date": "April 20, 2013"}, {"Title": "Absolutely Love It", "Author": "Adam", "ReviewID": "R2OXXVMAS3M5V3", "Overall": "5.0", "Content": "The build on this is fantastic, just by holding it you can tell its a serious machine. Taking notes on the Surface Pro is a piece of cake and lots of fun. I use it for inking almost on a daily basis. The pen is very responsive and accurate for these kinds of things. Windows 8 is great on a touch tablet.. it has a bit of a learning curve but once you get it, you realize how much more efficient it is. I also use this for gaming. Look up videos for \"Surface Pro gaming\" and you will be amazed at what it can run. I have seen it run All the Bioshock games.. Battlefield 3... Skyrim... Black Ops 2.. SWTOR.. Mass Effect 3 and many others. The display is great for both reading and watching movies. I wish i could write more about it but im too lazy and im about to get off work!If you are on the fence about this.. get it! Microsoft hit it out the park with this one!", "Date": "April 17, 2013"}, {"Title": "TOPS!", "Author": "dean56 \"dean56\"", "ReviewID": "R1QA62JYGNS07N", "Overall": "5.0", "Content": "not sure why people always bash things before they even come out and get tested in real life...  now that i have been using this i can say that i am perfectly happy with it..  i use a 64GB micro sd card as well as a very low profile micro usb card adapter that i plug into the usb port with another 64gB but i have like a few cards with movies and stuff that i only need certain times.. Gizmo Dorks USB 2.0 Micro SD Memory Card Reader with Carabiner Key Chain  or the elago Mobile Nano II USB 2.0 microSDHC Flash Memory Card Reader (Black)... i have both and they all work well....  i was amazed how many stories about the lack of storage on the device that were out there even though the mac book air had the same configuration and never received any comments about the issue...anyway, before i purchased this i was considering the acer S7 because of the larger 13.3 inch screen .  ok, it might have been better with a larger screen but because i travel alot i am very pleased with the ability to use the TABLET style during the flight. no keyboard.  it just works with the regular coach seats better than trying to open a laptop. if they do come out with a keyboard with additional battery i think it would be perfect!  i usually get between 3 to 4 hours of use with screen brightness up almost all the way.  there also is some talk because the screen has such high resolution that it's all confusing but it shipped with a 150 magnifying setting and it woks perfect for me.  if i really need something larger its just a \"ctrl + \" away.  takes like seconds.  the speakers are fine... but for louder music i purchased the Scosche PMSBK boomCAN 3.5mm Aux Portable Speaker (Black) that i use and are perfect for movies and music.  you can link two together but for $30 i think you start getting into a much better quality of speaker set instead of two of these..i do hear that by the end of the year we will start seeing new surface tablets with the HASWELL chip that will reduce size and battery life will improve but i can honestly tell you i have been delighted with the performance of this thing! of yes...one more tip... get a the microsoft mouse with both BlueTrack and Bluetooth together.  it will make your life easier...Microsoft Sculpt Touch Mouse", "Date": "April 15, 2013"}, {"Title": "Finally, a tablet that can be productive", "Author": "Ruffles", "ReviewID": "R19RKTDPGSBKJW", "Overall": "5.0", "Content": "This is my dream tablet.  I've had iPads and Android tablets before and while they are nice to play on, you can't get any real work done.  The surface is the best of both worlds.  It's a fun tablet when I want to lay on the couch watching netflix or playing a game but set it on a table with the type keyboard and I can code or use photoshop.  Win 8 on a tablet with touch is simply awesome.The only downside is battery life.  I get around 5 hours.  That's more than my old laptop and average with other ultrabooks.  Even the sacred Macbook Air gets about the same.  If it lasted longer, that would be great but I'd gladly trade battery for the pure horsepower this tablet has.  Being able to run virtually any windows app as well as any android app (via the Blue Stacks emulator) makes this the most awesome tablet around.", "Date": "April 12, 2013"}, {"Title": "Surface Pro is State of the Art!! Awesome Purchase, Well Worth the Money", "Author": "workjuggler", "ReviewID": "R2UT6F5L1ST3EB", "Overall": "5.0", "Content": "My HP Intel Core 2 Duo laptop was 5 years old but died when it hit the floor which I still did care for. So after researching laptops, Lenovo Yoga, I pads, Surface 3rd party units, etc. and the great reviews were soo overwhelming and true vs the bad, so much better than the others.This is so fast it is unbelievable. Don't hesitate because it is 4GB ram because it uses memory so much faster party because of the super 100% solid state drive. Display is sharp and clear like the Retina but much less expensive. Battery power is very good 6 or 7 hours or more if you use the power saver, very good even if you don't.Windows 8 part is different from XP or 7 but when in desktop mode is very similar. Other things just take a little getting used to, the frustrations of turning on the light switch after your house is remodeled go away. With this the new things are well thought out and very neat and convenient. I am finding game changers all the time with this.First computer was the first mac, then 3 more, then PC's ever since. Now i do have a Lenovo Thinkpad 530 with I7 quad core and 16GB RAM, Quad core desktop, Dual core desktop, my 3rd I phone, a Macbook Pro,and an I pad 2 at my disposal. But I highly recommend this Surface Pro!!  Trust me on this, they are already selling out often, but after things ramp up further you will see the take over...like back in the day when I was telling my friends to drop AOL dial up and get Broadband.... now lets look back at that one? :)", "Date": "April 4, 2013"}, {"Title": "Surface Pro has a \"5.6\" Windows Experience Rating", "Author": "K. Heim", "ReviewID": "RERY8AOD2L2BL", "Overall": "5.0", "Content": "Full Windows 8, a digitizing pen friendly screen, and a great 5.6 Windows rating, is enough in it self to make the Pro a desirable PC/Tablet combination. I am getting 6 hours of intermittent use out of my Surface Pro. This gets me through my day. Its not for the faint of heart, but for those how want real power in the smallest package.", "Date": "April 1, 2013"}, {"Title": "VEry Happy", "Author": "JarredF_SA", "ReviewID": "RSVVSTYR3TCE6", "Overall": "5.0", "Content": "Paid a little more to get this product because of stock issues, I'm happy with the service I received and got the item in one piece", "Date": "March 1, 2013"}, {"Title": "Windows 8 on tablet largely incomprehensible to me", "Author": "M. Wieder", "ReviewID": "R36NJFL7ESAFIG", "Overall": "1.0", "Content": "The Surface Pro is a sleek tablet with Windows 8 on it.  I have not been able to Update it to Windows 8.1 although I keep receiving links to telling me to do that, and then the link leads nowhere.  I do not blame the product for my inability to learn to use it,--I find Windows 8 incomprehensible, even after watching instruction videos on YouTube.  I have been using PC's for over 30 years.  I purchased the tablet because I wanted to be able to store backup copies of photos while traveling.  The advertisement said that I could easily do that, and it is light enough (2 lbs).  But the file-and-folder structure that used to be the Explorer is gone!  Supposedly there is the SkyDrive but there is no way to put anything on it.  Like Adobe's $30/month rental, I am betting that Microsoft wants a rental fee for putting files on their server, such that the tablet is just another vehicle for revenue generation, not an independent, on-the-road storage device.  There are very few apps in their Store and the practical software (Office) costs a lot more than comparable software for the iPad (I have 2 iPads).At least the wi-fi connection to my router works.  I have been able to go on the internet.  The separately purchased keyboard, which is a necessary part, works well and is equally stylish in appearance.  I am an unhappy customer, but it might be a learning curve issue.", "Date": "February 6, 2014"}, {"Title": "first impressions: no pop email, bad charger, little software", "Author": "pjf \"pjf\"", "ReviewID": "R3CV3NBJ9N7Q5Z", "Overall": "2.0", "Content": "I picked one of these up, seduced by the good reviews. I don't need another tablet, but I liked the idea of a tablet that could run full windows pro software, so that I could have all my work applications travel with the convenience of a tablet.First issue I had was that charger is bizarre.  I would have preferred a standard USB charger, or something with a more standard charger, that you could pick up an extra one easily if you left it somewhere (surely an advantage for a traveling tablet).  Instead the charger for the surface pro doesn't even match the charger for the regular surface.  The connector is definitely unique. And my charger I couldn't even get to work, because the two parts of the charger (not the parts that connect to the computer) would not easily fit together. I think I finally have it together, though it at first kept falling apart until I mashed it together with a lot of fiddling and forcing I have never had to do with the umpteen tablets or laptops that I have purchased over the years. I have a deep forboding that the charger, at least, is a cheap, crappily manufactured piece of junk that is going to soon fail. That the charger didn't seat right doesn't leave me with a lot of good feeling about how the tablet is going to be manufactured.  I can only hope they jobbed the charger out to some cheapo company and the tablet itself is better.For this computer/tablet, all I really expect to do with it (apart from occasional work use) is email, web, and doc writing.  I had no real expectations that this device couldn't handle that. So I was surprised that the windows 8 mail \"app\", doesn't handle POP mail.  Apparently for no good reason, except that Microsoft decided not to handle it. Since my verizon business account has POP mail, here's a supposed computer for professionals that doesn't handle the simplest, oldest and most basic mail functions.  Yes, you can use OUTLOOK to get your mail, if you purchase outlook. Windows Live Mail is not on this device.  What kind of $1000 computer/software combo doesn't handle simple POP mail?? I realize this is a Windows 8 issue, but I don't care. This was the last thing I expected in a supposed high end tablet computer and the software that runs it.  You don't expect something that simple not to be covered.I was also disappointed that there's no document software other than notepad.  Seems to me they should have included wordpad. I realize it is the RT that has the bundled software, but not everyone needs Word to write a simple document. Wordpad is a good balance between the functionless Notepad and the overdeveloped Word, that to me, became cumbersome around the 2007 iteration.It's very heavy, compared to a regular tablet.There's absolutely no documentation, manual, etc with the thing. No one reads doc anymore anyway, but still.The battery can't be replaced without the device being serviced.On the good points, the screen is gorgeous.  The windows 8 software looks very pretty, though it doesn't seem to have much behind the pretty looks. And I installed the trial version of Office 360 without an issue, as well as some necessary virus protection software, that being a windows computer, it has to have.  I haven't tried it with VPN, or any serious development software. It seems fast, but I haven't really stressed it yet.  I haven't yet tried music or video, so I can't address that yet.I got the type keyboard, and it seems very functional. No problems there.I'll probably keep this, since I rarely return anything. I may even come to like it.  If I do, I'll certainly update this review.  But on first impressions, I have a bit of buyer's remorse.  And since I haven't seen any of my \"first impression\" issues on any of the existing reviews of this tablet, I thought I might as well add them, for the benefit of whomever might be considering it.", "Date": "March 27, 2013"}, {"Title": "You can have mine", "Author": "Amazon Customer", "ReviewID": "R2C6JCNQ6BH7U2", "Overall": "2.0", "Content": "Ok, I get that some people like the Surface Pro. Not me.For me the screen is just too small to do much with Windows apps. Even with pop up menus there just isn't enough real estate to do much useful work.  The keyboard, I suppose, is amazing considering the size, but still not much fun to type on and the touch pad is one of the worst I've ever used.I will say that it works fine if you plug it into an external monitor, keyboard and mouse so if you just want to move from office to home and back again and don't really want to use it in portable mode it might be ok for you.And then there's Windows 8; don't like it.I'm going back to a lightweight laptop with a more friendly keyboard and a bigger screen--and best of all, no Windows 8.", "Date": "November 2, 2013"}, {"Title": "Hopeless mess!", "Author": "Barbara \"Barbara\"", "ReviewID": "R1SVVGXK453AV8", "Overall": "1.0", "Content": "I ordered this tablet from Amazon and spent a frustrating day trying to make it work, and then decided to return it before I wasted any more time.  Problems:  The tablet would freeze on a screen and not move, so that one had to turn it off and start over.  Starting over required entering the ID and password again and sometimes it would not take them, so several tries were necessary.  If it wasn't freezing up, it was jumping from page to page without any human intervention. This experience made me appreciate what Apple has done with its phones and pads, offering a lesson in how difficult it must be to make these things work smoothly and seamlessly.  Don't bother with this tablet!", "Date": "October 18, 2013"}, {"Title": "first windows 8 tablet", "Author": "chris", "ReviewID": "R3N090T1W1GOAM", "Overall": "3.0", "Content": "trying out on this first win8 tablet, not so easy to use as purely tablet when compared to ipads. In the end use it mainly with type cover as a laptop.", "Date": "May 26, 2013"}, {"Title": "Many issues", "Author": "Joann", "ReviewID": "R16GAPOGUNMPHA", "Overall": "1.0", "Content": "I have had the surface pro since its release.  Windows 8 has a lot of growing to do before it is really ready, and will be frustrating for many users. I also have a macbook air so I have something to compare a lightweight SSD laptop with (because in reality that is what the surface is, it is a laptop not a tablet, you cannot function efficiently with out a keyboard on the surface, you can function but if you want to be productive good luck with out a key board).  So in my eyes a comparison to the mac book air is a much better comparison than to an iPad.  My mac book air (which is a mid 2011 13\") starts up with in seconds (about 3 to 5) of turning it on or waking it up while the surface is horrendously slow over a minute.  Also generally it was best to shut the surface down rather than putting it to sleep since it still takes over a minute to wake up out of sleep and then at least another minute or two before it accepts the password to login.  Then once awake sometimes the pen, wifi, and/or the keyboard would not work, so you would have to restart anyway. The wifi would also sometimes take over 5 minutes to sink up, this is unacceptable in any computer today.I do love the pen and one note but that is about all I really like about the surface.But my major disappointment is with the quality of the surface itself.  I take care of my technology and I am very careful with it.  I have the touch keyboard and I kept it on a desk, in my hand or in a laptop case at all times and it still has several scratches on the screen and on the back of the tablet.  The back of the tablet actually has a chip in it as well, no idea how it got that but it is on the edge near the stand hinge. I have had an iPad first generation for years now and have no scratches on the back (which I admit is due to the case) and no scratches on the screen even with no screen protector. There is no full case for the surface since it has the kick stand so the back will get scratched but I did not expect so quickly nor did I expect the chipping. My mac book air which has been treated exactly the same as my surface looks in brand new condition and it has no cover on it (I understand that tablets expect to get scratches if not cared for but I am very careful and the screens should be more resistant, and it sat in the same laptop bag as my iPad).If the surface had better quality construction I could overlook some of the issues with windows 8 and would be satisfied with my purchase but I am greatly disappointed.", "Date": "July 27, 2013"}, {"Title": "Wasted Investment", "Author": "D. Kennedy \"Wscribe\"", "ReviewID": "R1ZI1XX49T6JQ5", "Overall": "1.0", "Content": "Initially purchased it to solve a business related IT issue.  It might have solved the problem, but it quit working after two days.  Would not initialize other than a screen message saying that the battery was charging.  I left the battery to charge for over 12 hours.  Still got the message that the battery was charging.  Won't purchase any more.Personally, have been using an Apple Air for last six months.  Somewhat more expensive and a bit heavier, but it has booted up every time the machine has been turned on.  Replaced the defective Surface Pro tablet with an Apple Air.", "Date": "December 14, 2013"}, {"Title": "It is the Keyboard you buy with it that I hate, but it is a problem for the Surface I think.", "Author": "Eric Damery", "ReviewID": "R2TL9H9GLM6SY7", "Overall": "2.0", "Content": "The FN Key is on the right side. The Function Keys F1 to F12 all require the use of the FN on the right side to work, which is terrible for a Screen Reader User for sure. I use JAWS for Windows. And finally the SpaceBar extends too far to the left when compared to other keyboards and it makes it harder to get to the ALT key on the left side.The Surface Pro in general, seems great and works well with my JAWS Screen Reader but the Keyboard options make this a poor choice in Win 8. My Toshiba Ultra Book is still head and shoulders better.", "Date": "May 7, 2013"}, {"Title": "Too difficult to use & very poor battery life !", "Author": "Essential Reader", "ReviewID": "RN3UI464VIL8Z", "Overall": "1.0", "Content": "I did not purchase my Surface Pro from Amazon, but feel strongly enough about it that I am posting a review here.I found the Surface Pro incredibly difficult to use, with the combination of the brand new Windows 8 and a $1000 machine which comes with no instructions at all, despite having an operating system which is brand new, even to those who have used prior versions of Windows. I could not read the results on Google, the font was so tiny that my eyes were hurting after half an hour or so.  The keyboard cover was fine, but small and I found myself hunching right over the computer to work.  The battery ran down in no time at all;  a bit of use and it had dropped to 60% - how would this work on a flight or during a day of business?I had done quite a lot of research online before purchasing this item;  most reviews on computer websites gave good reviews.  However, I began to panic about the problems that I seemed to face each time I turned it on.  I also disliked the way that even in order to set up the computer, I had to use existing hotmail addresses, and that these were then linked to my skype account and other accounts.  I personally do not like to store all  my personal information on interchangeable sites, for privacy reasons.  Anyway, with some relief, I changed the Pro for an Ipad and am very pleased with the exchange. No problems at all with it.Reviews also mention that the Pro is super fast.  Well, with internet searches and emails, I found this to depend entirely on the Wifi available, and  it was quite slow where I was using it as the Wifi (Comcast) is not that great.I bought the Surface Pro in the US although I live in Europe.  When I flew home, I read in the Financial Times that Windows 8 had bombed and Microsoft's PC sales had dropped my 25% since the launch of Windows 8.  This does not surprise me as the whole package was very hard to use - and came with minimal instructions (a picture of the computer with its main parts labelled).  I have to say that it also makes me slightly suspicious of all the great reviews on computer websites - I can't be the only individual to have had difficulties. Another aspect that I found irritating was that the version of Office which had to be used with the Pro - Office 365 - now has to be renewed each year!  Microsoft are rather pushing the envelope here, aren't they?Now,I am not a college student who has grown up with the latest technology ( and may find the Pro very easy) - just someone who has used all the previous versions of Windows, and who wants to do a bit of work and online research on the move, download a lot of newspapers and magazines, and send/ read emails and store photos. The Pro + WIndows 8 is too complex The Ipad is a dream by comparison.", "Date": "April 19, 2013"}, {"Title": "Significant Problem for Microsoft", "Author": "nikotama_weiper", "ReviewID": "R3GNB4B72Q4Z7T", "Overall": "1.0", "Content": "Microsoft totally sucks.Why didn't they test Windows 8.1 on their own branded hardwares like this?I use Surface Pro and I have upgraded to Windows 8.1 this morning and first I noticed that the pen doesn't work at all.Looking up on the Internet helped managing it to work, but I found out that the recognition of the pen movement isnot smooth sometimes after a while using it, and requires restart to fix it.I bought this crappy Surface Pro to use Onenote as a digital note device,but thanks to crappy Microsoft with disappointing software here.It crashes once every 5 minutes, the page scrolling takes a second to affect the display,its just a rubbish.Have you tested using Onenote on Surface Pro, Microsoft?It freezes all the time and the User Experience is awful.I think that they will never repair this crashing and stressing softwares.If I could, I will return this garbage to the store I bought and buy tonnes of A4 note pad with a nice MontBlanc fountain pen.", "Date": "October 17, 2013"}, {"Title": "Nice hardware, disapipointing experience with win 8 pro, way better with win 8.1", "Author": "A. Khamari", "ReviewID": "R3M8R3O0ON2AI8", "Overall": "4.0", "Content": "I can't sign on to smartglass or xbox account with a different email, and I can't change the email associated with my game tag I have to wait 30 days... this is totally convoluted and not a user friendly at all... I was supposed to enjoy my experience with the surface pro, and it has been a very bad experience,the email issue I mentioned above.and calendar issue that seems enable to sync with Gmail calendar.a Microsoft outlook connector that doesn't sync the calendar from outlook to outlook.coma setting refresh that actually say it will keep your files but doesn't worn you about deleting all apps UEFI issue, can't see my SD card to boot from it and cause issues with other OS's, not allowing them  to boot even after disabling the control thing.hyper-v with low resolution and not adjustable! they ask you to rdp to it (Linux doesn't have RDP server)why call it surface pro, and there is nothing pro about it but the hardware specs which you can get for cheaper on a dell laptop...,  windows 8 experience sucks. MS technical support sucks, their whole experience is out of touch with the user experience at least from my point of you! J I can  change my iTunes email as many time as I want after going thru the security and credit card verification...I need to step out and chill cause I'm getting really worked up with the whole experience, I may have to return the darn thing! for $1300, all it's giving me is frustration...Their MS surface stores closed (wonder why!?), can't even get them to return it, cause at the tome of purchase they didn't update my purchase with my email address, and info...they can't use the receipt on their system, now I have to fax it and all that hassle!if any one from Microsoft is reading this I ask them to get their act together, this very disappointing.----------------------------------3-20-2013upgrading to 3 stars cause I like the hardware. not a fan of windows 8 pro and the customer service.8-24-2013 best machine ever with Windows 8.1 pro. I will give it 5 stars if the speakers were louder and the battery gets at least 6 hours. 4hrs is too short. Love the fast boot, and shutdown. Now I can have multi OS such as Linux ...oh we need LTE or 4G service.", "Date": "March 17, 2013"}, {"Title": "Terrible Customer Service", "Author": "Vince Giusto", "ReviewID": "R23IUYW4JDBLUN", "Overall": "1.0", "Content": "Bought this as a Christmas gift in the month of November. By my own mistake I purchased a Surface I instead of a II and wanted to exchange it and was willing to pay shipping and restocking. I hadn't realized that it wasn't a Surface II until it was opened Christmas morning and immediately asked for an exchange. I was told \"no\" as it was past the return date.I've been a long-time MS user but I'll never buy one again.", "Date": "January 9, 2014"}, {"Title": "Buyers Beware of Wireless Problems", "Author": "Schyler Jones", "ReviewID": "R3BQXZML6QVA21", "Overall": "1.0", "Content": "Microsoft may have sold a million of these, but hundreds of users are reporting problems with wireless connectivity where their tablets will not connect to wireless networks, or once connected, they drop the connection frequently.  If you do a Google search for 'surface wireless problems', you'll find all the posts. Microsoft support has been dumbfounded, encouraging users to 'reset' their tablets without results, encouraging customers to buy new wireless routers (when other wireless devices work just fine with the same router), and so on. I would not have thought to investigate the issue before buying, but a customer of mine recently purchased one and is keeping me appraised of his experiences with it.  At the moment, he's giving Microsoft one last shot to fixing it and if they don't he's returning it as a lemon.", "Date": "April 1, 2013"}, {"Title": "Bad purchase as general", "Author": "Lol", "ReviewID": "R1421P34H9T3A8", "Overall": "3.0", "Content": "Why? Cheapest razer edge beats this at 999 bucks. So this is not interesting. I did rather buy the edge and make it into portable everything with extra beef on the graphics dept", "Date": "March 16, 2013"}, {"Title": "My low expectations weren't low enough", "Author": "Gift Card \"yourmanstan\"", "ReviewID": "RW8P0P7471QPI", "Overall": "1.0", "Content": "I've often said that a better computing experience comes from fewer Microsoft products.  With the release of Surface, I thought perhaps Microsoft finally u-turned with an excellent combination: a tablet that could get some business done as well.  Their excellent marketing did draw me in.  Having used Windows in the past, I kept my expectations low and optimism high.  Today I plunked down $1200 for this machine with a keyboard.The honeymoon was over soon after I opened the package.  There are two manuals.  One is a pointless booklet of legalese all in extra fine print.  The other is little more than a picture of where the power button is located... useless.  But no worries from me, I turned on the machine and began the set up process.  That was the beginning of the end.  The software reminded me of the exact reason why I abandoned Microsoft years ago.  Most OS have pros and cons.  Microsoft is remarkable in how they find a way to do everything wrong.  I believe they tried for a simple interface... borrowing from the likes of Ubuntu, Apple, Android, etc.  They failed.The touch screen lags behind the touch.The interactions are not intuitive and I found myself googling for answers immediately (except the tablet puts you on bing first).The help is worse than you'd find at Walmart.The app selection is poor.The device isn't compatible with typical web services... the very things one would expect from a tablet.The tablet comes preloaded with junk apps.The beveled side doesn't allow a good connection for the mini display portI kept trying find ways to keep the tablet.  I finally resigned to the fact that there just isn't any use.  All around... total waste of time.  There are some devices that aren't for me, but I understand why others would want them.  This isn't one of those devices.  I don't understand why anyone would subject themselves to this device.  I'm a little sad, because I'd love some more competition in the industry... but this thing is just awful.", "Date": "April 8, 2013"}, {"Title": "Not an iPad", "Author": "David L. Solt", "ReviewID": "R2SW5OUL7P8ZYK", "Overall": "2.0", "Content": "If you have worked with an iPad, you will be disappointed.  This is a slow, hot, clunky, wannabee version of an iPad", "Date": "September 13, 2013"}, {"Title": "In the world of tablets Android is superior", "Author": "E. Aspilcueta \"bugs 007\"", "ReviewID": "R12J03DX1Y2SOI", "Overall": "1.0", "Content": "Avoid these Windows 8 tablets. Like RT and PRO, these tablets are based on Windows 8 and not a good option to use. I would not recommended for students or business.There are plenty of other tablets that perform better and are much more productive. As an example: Asus Infinity, Samsung Galaxy Tabs and Nexus tablets have much more apps, has better features and much less confusing.", "Date": "July 31, 2013"}, {"Title": "Another Edsel", "Author": "Larry B", "ReviewID": "RVOF9MR4JV2FN", "Overall": "1.0", "Content": "The MS Pro is a real letdown.  Just like the Edsel was is 1967.  Lots of hype and useless \"features\" (crutch support aka kickstand).I tried it out at the MS store in Frisco TX.  No waiting in line, others were looking at smart phones.I found it awkward to use as a tablet. The tiles are a step backward from W7.  Text over dark background indeed!!!  It is heavy and chunky.  Too wide for a tablet.The type keyboard is only comfortable to use when sitting at a desk.  Feels cheap and flimsy.  Touch pad is way too small.The pen does a nice job of drawing.  I guess you could use it for signatures and graffiti.  The recognition software couldn't recognize my or my wife's signature. Not much use for note taking.Windows 8 won't take some of my legacy software.  There is no XP mode in W8. Asked the MS sales person if I could downgrade to W7 pro to use my Software. He checked and said definitely not.  Deal breaker!!I asked about battery life.  MS person said about 4 hours. Deal breaker 2!!When I asked about memory and updating my office software I got a lecture on Cloud computing and it's reduced requirements.  Probably true, but it also has reduced device requirements so that it can be handled by a $150 Android tablet.The whole feel of Surface Pro was that it had been designed by the advertising department and had not been engineered.  It is just like the Edsel: lots of hype and fluff, premium price, and lots of fatal deficiencies.The λ (lambda) symbol for the crutch is For Surface, what the concentric O s were for the Edsel, a trademark for a loser.I can get a discounted Samsung series 9 loaded with Windows 7 Pro, with 256G SSD and a real keyboard for less than a Surface Pro with a type keyboard.  Why pay more for less?When Surface comes out with fixes for the hardware deficiencies, improves the software, and gets a competitive price, I'll trek down to the Microsoft store again.", "Date": "March 9, 2013"}, {"Title": "Very Low volume plus it weighs too much!", "Author": "J. Lieder", "ReviewID": "R2O9Q8IGC34VH1", "Overall": "1.0", "Content": "I was really looking forward to this Tablet.  I went to view and demo it at a local Best Buy and even with the volume rocker up to 100% I could not hear it.  That's right this $900 tablet has very little going for it.  Worse, its heavy to hold in your hand and heats up, staying hot. It could be used outdoors in the middle of winter as hand-warmer, its that hot. I would have trouble purchasing this even at $400 never mind twice the cost.  I do not think a lightweight affordable Windows 8 Pro Tablet exists.  A major disappointment.  Its heavy to hold in your hand and is unwieldy.  How I hope that someone improves upon the design.  The Samsung Ativ 700T was for me its closest competitor but its too expensive.  Can someone create a Windows 8 Tablet that isn't hot to the touch and actually has speakers a human being can hear please?!!  I looked forward to getting to try this for months...what a letdown.My dream Tablet has I7 processor, pressure point Wacom stylus, and can actually run Logos 8 Bible Software and other legacy applications - all for under $500.It should have a keyboard and an adjustable dock too please.As for the Surface Pro...its an inferior heated \"brick\" that can run apps if you are desperate but when running something as simple as a YouTube video you will need to find an external way to amplify it.  I am surprised - actually stunned - at all the good reviews.  This expensive piece of equipment should do more for the money.  In my personal opinion, its outdated and nearly useless.", "Date": "February 24, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BDS3N1G"}}