{"Reviews": [{"Author": "Balaji Ramanathan \"balajithegreat\"", "ReviewID": "R15D16Z0PHWMAE", "Overall": "4.0", "Content": "I bought this to replace another 7-inch android tablet that broke when it was sat on.  That tablet had no brand name, and I had identified a few things I would improve about it if I were to replace it.  I did not anticipate having to replace it when I did, but the list of requirements did enable me to narrow down my tablet choices significantly.I wanted a faster processor.  At least a dual core, if not quad core.  I wanted a better, higher-resolution screen.  I wanted bluetooth connectivity.  And most importantly, I wanted better battery life.  And I wanted all of this for under $200.  I got all those and more with this replacement tablet.My choices were narrowed down to this tablet, the Samsung galaxy tab 2 7\" wifi, and the nexus 7.  The nexus 7 fell out early on when I realized it did not have a micro-sd card slot.  Moreover, the tablet would end up costing me more than $200 including taxes and shipping if I bought it from Google.  The Samsung tablet had everything I wanted, and was about $170 to $180.  I was about to buy it when this newly introduced tablet caught my eye.It cost $110, which is less than two-thirds the cost of the Samsung tablet.  It is superior to or equal to the Samsung Galaxy tab in pretty much all respects.  It has a dual-core processor like the Samsung, but the processor frequency on this tablet is 1.2 GHz rather than 1 GHz.  The screen resolution is 1024x600, same as the Samsung.  It has bluetooth, and a 4000mAH battery (same as the Samsung tablet).  The battery life, I knew, would be slightly lower than that of the Samsung tablet because of the faster processor, but I was willing to take that compromise.  Also, this tablet comes with a single front camera whereas the Samsung tablet has two cameras, but I believe in taking photos with a camera rather than looking like an idiot taking pictures with a humongous tablet which blocks everybody else's view of what you are trying to photograph.  One more perceived advantage this tablet had over the Samsung was that the Samsung tablet came with a proprietary cord to connect it to the computer, whereas this one uses a standard micro-USB port.  I don't want to spend a few dollars replacing a lost or misplaced cord down the road.The tablet came well-packaged.  The package consists of the tablet, a user manual in three languages, charger, USB cord, various other bits of paper like a warranty card, registration card, etc., and a pouch for the tablet made of some very thin, indeterminate material that feels on the outside like suede leather.  The tablet's screen is protected with a thin plastic sheet that I peeled off as soon as I unpacked it.The tablet feels solid and well-constructed.  It has a plastic body, but I was not exactly expecting a magnesium uni-body for the price I was paying!  It has a wide bezel around the screen, and the ports are arranged and marked clearly.  The only buttons are for turning on the tablet and/or screen, and a rocker switch that controls the volume.  The front-facing camera is placed in a corner of the bezel, but I was not anticipating using a camera at all, so I didn't care where it is or what its resolution is.I plugged the tablet in to the charger, and it was fully charged in about an hour.  The tablet was probably shipped with about a 50% charge like most electronics with li-ion batteries are shipped.  There is no LED or any other outward indication of being plugged into the charger.  The screen does show a charging battery in the middle if the tablet is completely off, and an icon of a charging battery in the notification area if it is on.Set up was quite easy and trouble-free.  This is my third android device (after my phone and my previous tablet), so there were no surprises here.  Actually, I take that back.  The surprise I had was that some of the applications that had been compatible with my previous tablet were shown by the app store as not being compatible with this new tablet.  Examples include the Audubon field guides, WebMD, itriage, etc.  I attribute it to the newness of this tablet, and I suspect app developers will be updating the apps to make them compatible with this tablet as time goes on.  There are ways to side-load these apps on to the tablet if you absolutely need them, and the tablet itself is fully capable of running them with absolutely no problems.  The tablet boots up in about 90 seconds from a cold start.  The bezel is completely free of touch capability:  no home, back and recent apps icons on the bezel anywhere.  They appear only on the touch screen as needed.The tablet has 2GB of internal memory, and an 8GB internal SD card.  About 4GB of this internal SD card is occupied by the android OS, and the built-in apps that come with the tablet (such as GMail, Google Maps, etc.).  Only the other 4GB is usable by the end user.  But, combined with the 2GB of internal memory, there is more than enough space for hundreds or even thousands of apps, so it should not be a problem.  I have used up 1.3GB of the internal memory and none of the 4GB SD card after loading about 150 apps on the tablet.  However, the tablet is not rooted, and there is no way to remove any of the built-in apps unless you want to go through the process of rooting the tablet.  Some of the preloaded apps are of questionable value: For instance the maps app is pretty useless given that the tablet does not have GPS.The tablet is very fast and the screen is fluid and smooth.  There is no lag in running any app or switching between multiple apps.  After the full charge, I took the tablet off the charger and loaded all the apps I want on it over the next four or four and a half hours on battery power.  The processor (both its cores) was running at full power during this entire time, and the screen was on the whole time too, and the battery was drained down to about 5%.  If I were just browsing the web or watching videos, it would probably last about 6 to 8 hours.  If I were just listening to music or something like that with the screen off, it would probably last a couple of days.  As such, when I leave it overnight, the battery goes down by a percent of two at most.  The battery also charges when you plug the tablet into a computer using the USB cord.The user manual is surprisingly informative, and has a bit of an introduction to android itself in it.  If you are completely new to the android world, you might find it useful though in general I have found the system intuitive enough I that I didn't need it when I got my previous tablet, and that tablet's user manual consisted of a single folded sheet of paper!  The user manual comes in three languages, but the Coby website does not have a PDF version of the manual up on it yet.I have had no problems running any app that I have loaded on the tablet.  The tablet has not crashed, and I don't remember any app crashing either.  Youtube works perfectly.  I have watched movies, listened to music, live streamed radio, played games like angry birds, etc. without any issues.  The built-in speaker is not the strongest out there, and it is only a single speaker, so no stereo if you use the built-in speaker.  But I had no problem pairing it with a set of stereo bluetooth headphones, and the output is loud and clear.  Wired headphones work fine also.  Pairing with my stereo bluetooth headphones was very quick, painless and reliable.The screen is very good looking and videos and games look crisp and sharp.  I have not tried using the tablet in bright sunlight, but in most indoor situations, including next to open windows, the screen does the job for me.  There is no ambient light sensor, so you have to adjust the brightness manually if you find yourself straining because it is too dim for the environment.I have also read a couple of ebooks on the tablet and found it to be very easy on the eyes.  The words appear crisp and well-defined with no blurring or rounding of the edges of letters, etc.  I primarily use the tablet for reading books, playing games and watching videos, so the screen quality was important.  The high resolution paid off.  There are no dead or stuck pixels as far as I can tell.Overall, I am quite happy with the tablet, and I think anybody who buys it with realistic expectations would be too.So, why did I not give it 5 stars?  The first reason is the lack of a charging indicator of any kind (a small led on the bezel or something like that).  I have to physically wake the tablet's screen up to confirm that it is charging.  Next, the speaker is weak.  The tablet's wi-fi antenna is not as powerful as I would have liked it to be.  It has some problems holding the signal reliably in far corners of my home that are farthest from my router.  It has no ambient light sensor.  It comes loaded with some junk apps.  I would have found better use for the space occupied by these apps, but I can't remove them easily.  Which brings me to my final demerit:  the tablet is not rooted.  Also, it comes with Android 4.0.4 and Coby has not pushed an update to 4.1 or 4.2 yet.The only thing left for me to evaluate is the long-term reliability of the tablet.  I will try to provide updates if something changes significantly down the line.  In the meantime, if you have questions or concerns, please post in the comments, and I will try to address them as best as I can.", "Title": "Best value for the money out there", "Date": "April 16, 2013"}, {"Author": "Diaper Destroyer", "ReviewID": "RNFXZJVT0OC6L", "Overall": "5.0", "Content": "Coby 8-inch GMS Android 4.0 8GB Internet Tablet 4:3 Capacitive Multi-Touch screen with Built-in Camera, Black (MID8065-8)I love this tablet - period.I purchased this tablet a few days ago for my son -- and kept it for myself!!! I started using it and couldn't put it down, so I just ordered him another one, which will arrive in a few days.-- MY COBY PASTI first bought a Coby tablet two years ago for my son's first birthday. It was a cheap 7 inch with Android 2 point-something-or-other that I got for about $80.00. I figured he'd toss it around a bit and quickly break it. I was very wrong. It actually ended up being a valuable learning tool -- even though the available applications were VERY limited due to the absence of Google certification. What truly amazed me was the build quality. He has essentially beaten the stuffing out of that poor thing and the screen, speakers, wireless radio, processor and everything else about it are still perfect! Furthermore, the battery still lasts for around 7 hours of continuous use on a full charge.-- MY COBY PRESENTMy wife uses a Samsung Galaxy Tab with Ice Cream Sandwich that she paid an arm and a leg for. Watching her use it quite effectively for various things, I got envious and decided I needed to grab a tablet for myself and see if I could dispense with carrying my laptop everywhere. I also figured that my son needed something with Google certification because there's a lot of stuff he was doing on my wife's tablet because she has access to Google Play on her tablet, but his old one doesn't. So, with those two points of reference, my son's old Coby and my wife's Samsung, I started my research to see what I could find for my mini-me, and me.I settled on and bought one Coby Kyros 8065 -- and then a second one.The Samsung is impressive, but lacks ports and is way too expensive. The Coby, now with full Google certs and Ice Cream Sandwich -- is just as impressive, has a ton of ports (hdmi, usb, etc), and it's remarkably cheaper. Beyond that, my son has proven to me that Coby builds amazingly durable tablets! I don't intend to toss this one around like he did with the old 7-inch. But, I know that if I drop it a few times it will be fine.Comparatively, my Coby works just as well as my wife's Samsung. It's just as fast, just as bright, etc. But, it can do far more in terms of the ports (and it was way cheaper). Every time I pick this Kyros up and use it I smile. It is VERY rare these days that I actually feel like I bought something without being taken advantage of in some way. But, with this, I know I got my money's worth. This is a purchase that I feel really good about.I haven't really been a Coby product fan since I bought one of their cheap fake-me-out walkmans in high school -- which broke the next day. But, I'll be a Coby Kyros buyer for years to come. They got it RIGHT with the tablets.", "Title": "EXCELLENT TABLET!!!", "Date": "April 10, 2013"}, {"Author": "Charles E. Hughes", "ReviewID": "R5N1VR13AT7Y0", "Overall": "5.0", "Content": "I've owned two other tablets in the past two years. An off-brand one with an All-Winner A10 board in it, and a Uniden tablet (Same tablet as the Polaroid PMID705) The generic tablet was okay but as I shortly found out, its near impossible to get parts for. I paid 120 bucks for it and after a week it got broken (The charger tip got shoved up inside and busted the powerjack). It felt cheap anyway.The Uniden tablet was nice. No complaints but it had a single core processor and 512ram with no additional storage so unless you had an Micro SD card it all had to be saved on the tablet thus taking up half of them from the start. But it was only 60 bucks so I can't complain.But I finally decided I wanted a decent tablet that ran games good, and browsed the web without lag. And this Coby tablet was going to be my choice.From the second I turned it on I was won-over. It booted up fast. It had a fast response time to doing stuff. I could leave 10 apps open and still do stuff with no lag. The battery is great. It came with 86% charge and the battery meter says it lasted 17 hours (With about 4 hours of steady use over the course of 2 days) before it finally died. I downloaded GO Launcher HD for it (Which is a resource intensive launcher) and it does it all flawlessly with no lag. I can play Minecraft, and The Sims Play For Free with no lag at all. I haven't tried the HDMI on it, I'm pretty confident that it won't lag on a TV.It fits nicely in your hand if you have medium to large hands. It's slightly heavier than my other two tablets, but it feels sturdy. I feel like I could drop it half a dozen times and not worry about anything but the screen breaking, and I like that.It's Google certified which means all the apps you want to use on it work. For example; The Sims Play Free can only be ran on 'Google Certified' tablets/devices. My last two tablets could not play it, but this one could. Being that it's Google certified it means it passed Google's testing and is considered a good alternative to a Google Nexus. There will never be a compatibility issue with it. It comes preloaded with a bunch of Google apps, like Gmail, Google news, Google+, and Chrome. Most of these I didn't use but it seems like it would be helpful to those who use this stuff. There are also other app stores you can put on there like the Amazon app store or the 1Mobile Market app store. So you're not limited to just the Google Play Store.The screen is very responsive and very accurate. I have not noticed any issues with typing (And I have slightly larger than average sized hands/fingers). It has volume control physically on the tablet which is okay but the buttons are clustered in such a way I always end up hitting the power button and putting it into standby mode when trying to raise/lower the volume. But its just a minor thing.The tablet comes with a nice book of clear instructions, it comes with a microfiber cloth to clean the screen, and it comes with a 1 year warranty on it.For $110 (What I paid for it) It is an awesome tablet. I would recommend it to anyone looking for a budget tablet. It is by no means as good as the Google Nexus, but if you're on a budget and can't afford a Nexus or even an iPad, buy this tablet.Why are you still reading this? Stop reading my review and buy this tablet!", "Title": "Excellent tablet for the price!", "Date": "March 30, 2013"}, {"Author": "GREGORY FLAGLER", "ReviewID": "R3AAJS22PYI530", "Overall": "3.0", "Content": "I ordered this item for my special needs son, who had an iPad Mini, which he loved.  However, he wasn't quite ready to take care of it yet. So, after doing some research, as well as trusting the high reviews here on Amazon, I decided to give this a shot, despite Coby's less than stellar reputation when it comes to electronics.Item arrived, and despite the plastic case, it seemed to be decently put together...no, say, Nexus 7 or, even higher, iPad level quality, but for $100, definitely not bad.Had only about 4% of battery life, took, oh, 3-4 hours to charge.  Also not horrible.Anyway, set it up, got some apps (this is Google Play certified, a plus considering the \"non rock status\"), and handed it over to my 7 year old......after I played with it for about 45 minutes.Screen reaction was smooth...capactive worked well, apps opened up at a relatively quick pace, and while I didn't try any \"heavy graphic\" games, all the apps ran smoothly.WiFi dropped once or twice, but it bounced back very, very quickly, so it didn't cause much of a disruption.The display was actually not bad, all considering.  Not sure of the pixel count, but most things (and I have to say, video, which on my other experiences on android tablets - this is running Jelly Bean 4.03 btw - was actually pretty decent...ALMOST sharp.  Note, don't think upgrading up the Android chain ain't gonna happen.)Here is why this didn't get 4 stars.Video battery life is ATROCIOUS.Charged the battery to 100%, gave it to my son around 4:15 pm one day.It was down to 14% after a combination of video via wifi and items on an expansion card (a plus for this; can expand to 32GB via miniSD) by 8:10 PM.Not cool, especially if you give this to a kid on a road trip.In my case, due to the lack of expense, decent build quality, and decent performance, I will probably keep it.But, for power Android users, depending on how you use it, I'd spend a little more money for something with longevity, as well as a better company reputation.", "Title": "Shockingly good for a Coby, short battery life", "Date": "May 6, 2013"}, {"Author": "T. Bass", "ReviewID": "RUXTUHUFR6ELY", "Overall": "4.0", "Content": "I purchased the \"COBY MID7065-8\" several weeks ago. It arrived quickly, was packaged decently, and was amazed to see an actual paper \"users manual\" booklet enclosed, which is unheard of in a low-priced tablet! The unit appears well built, and has a decently solid feel to it. It came with a nice bag, charger, and a micro-USB cord for hooking to your computer.After charging it, I turned it on and proceeded to download all of my apps (paid and otherwise) from Amazon and the \"GP\" store (*caveat below). The COBY comes fully loaded with all of the major Google-brand apps, like Gmail, Calendar, Chrome, etc. Compared to another inexpensive Chinese tablet I bought last year, this one is fast, and all of the apps work well. The dual processors really speed things up, as does the full GB of RAM.I own a couple of other inexpensive Android ICS tablets, and this one is by far the best, and the best value. I have not a single complaint about the tablet itself, though I wish the sound were a little better. For the price, I can't complain, and it works great with headphones. The screen and viewing angles are also just fine. It has a much higher resolution than other low-end tablets on the market, and even though it doesn't have an IPS screen, it doesn't cost like an IPS equipped model either! Netflix, Amazon, downloaded videos, and everything else work and look just fine on this unit.*As for the reason I took one star off my rating for this device, when I turned it on initially (and subsequently, until two days ago), a \"firmware update\" pop-up would appear. At every instance, I would follow the instructions, but it would not install correctly. So, I wrote COBY Support. It's been over a week since I wrote them, and have yet to hear from anyone. Obviously, though COBY is making some nice tablets now, their Customer service still leaves a bit to be desired. Hopefully they'll \"grow\" into it. Good tablets, deserve good support.To fix the above problem, I simply switched off the \"auto update\" feature in settings (Settings/About tablet/System Updates). Once that was done, the pop-up stopped. A couple of days ago, I turned the auto-update feature back on to see what would happen, but the mysterious and faulty update and pop-up were nowhere to be seen, and everything now operates perfectly. I've also read that COBY will be updating this tablet to \"Jelly Bean\" at some point too.All in all, this is a great tablet for just about anyone. No, it's not a top line unit, but isn't priced like one either. It will do everything most need and desire from a tablet, at half the price of its nearest competitor. Now, if COBY could get their customer service shaped up, they could own the lower end of the market, and have lots of happy customers. Regardless, I highly recommend this tablet.", "Title": "Great buy, but.....", "Date": "April 4, 2013"}, {"Author": "Maek", "ReviewID": "R2OYETM0VDKCUP", "Overall": "5.0", "Content": "I'll say this first and foremost:  for the price, it's a great tablet...with stress on the words \"for the price.\"  For the price, it gets 5/5.  Compared to competitors, however, the old adage of \"you get what you pay for\" does apply.Our family owns a Kindle Fire HD 7\" and Samsung Galaxy Tab 2 7\".  Both tablets are great in their own right and I won't tout one over the other as they each have their unique strengths with the Samsung being used for all-purpose application while I use my Kindle Fire HD primarily because of the Prime Instant Video usage as well as my books and ability to listen to my 16,000 song selection via the cloud.I'm only saying this because I only feel it fair to give you an idea of what you're paying for at $119.99 MSRP versus other models that cost more.So here's my breakdown comparison:STARTUPThe Coby is sluggish compared to the Samsung Tab and the Kindle Fire HD.  I'd say that full startup takes about 30-40 seconds from a powered off unit.  It's not a big deal, but it was something that hit me immediately.OPERATION/PERFORMANCEThe Coby shines here.  The screen is as responsive as the Kindle/Samsung and works extremely well with capacitive pens already in our possession.  Being an Android-approved tablet, you'll be on familiar ground if you're already familiar with Android OS devices.  I occasionally found myself hitting the \"home\" button by accident instead of the \"123\" button to access the number pad while using the keyboard, but I quickly got used to this.The Wi-Fi works pretty well and snapped to nearby Wi-Fi points without any apparent delay.  Setting up MSN and GMAIL accounts through the apps was also pain-free.  Top marks.The dual core 1.2 GHz processor appears to work quite well and I must say that I didn't notice any considerable lag compared to other tablets when opening or using various applications, including Netflix.SCREEN/DISPLAYIt's not quite as slick as the Kindle/Samsung, but the glass is smooth enough for sliding operations.  The resolution of 1024 x 600 resolution doesn't sound like it's a huge difference on a 7\" screen, but I did find the image not to be as sharp as the Kindle/Samsung.  That said, it's still pretty good...I would simply describe it as just a tad \"fuzzy.\"  Also, while the grid on the screen appears to be quite noticeable when the unit is powered off, it looks perfect when it's turned on and I don't see the grid; don't let the powered-off appearance throw you off if you see it in a store.BRIGHTNESS CONTROLOne of the most noticeable things about this unit is that it doesn't have an \"automatic brightness\" feature.  While a minor inconvenience, you may find yourself adjusting the brightness for various lighting conditions and, worse still, not having an \"automatic brightness\" feature may possibly mean an impact on battery life.  It's a feature that I love on the other units, but it may not make a big difference for you.  However, you should be aware of it.Also, at maximum brightness, I wish that the Coby could be even brighter still.  The Samsung/Kindle seem to have this issue well in-hand; the Coby would be a much fiercer competitor if they could implement both automatic brightness and a much brighter screen overall.BATTERY LIFEI use the Battery Life HD Pro app which usually provides a good estimate on battery life.  While I haven't put this unit through the paces yet, the app estimates that battery life for video viewing (Netflix, etc.) is about 7.5 hours which suggests that the performance of this tablet is on par with competitors.  Pretty good value here.The weird thing is that although Battery Life Pro HD was showing 7.5 hours of battery life, Coby's own on-board estimate was showing 38 minutes...there is an apparent software glitch here.MEMORYAh, this is where the Coby shines again.  It comes with 8 GB on-board (about 4 GB is actually available), but you can insert a microSD card for additional memory, unlike the Kindle (hope you're listening Amazon - memory expandability is my biggest pet peeve with the Kindle Fire HD).  You can do the same with the Samsung, but the Coby is a great low-price alternative that allows you to enjoy the same benefit of expandability.  I only wish, however, that they had a cover over the memory card port; it's exposed.  Even though it's recessed, an errant hit may cause the card to eject.  Apart from that, it works just fine.CHARGINGUse the supplied AC adapter or use the micro USB port; it'll allow either!  I love the flexibility and a lot devices have opted to use the micro USB input these days and they're relatively inexpensive to find.I have not tested the HDMI output but I rarely find a reason to use it since I already have a PS3 for Netflix and video viewing anyway, but an HDMI output is available on this unit.  It also has a 3.5 mm jack for headpones.Another plus is the Bluetooth capability of the device and if you have a Bluetooth portable speaker, it's great to use with the tablet.Overall, this is a great tablet for the price.  I'll post any updates if it breaks down or if I encounter any other pluses or minuses along the way.Other than that, highly recommended!", "Title": "Fantastic for the price...just don't expect miracles...", "Date": "April 24, 2013"}, {"Author": "M.", "ReviewID": "R140NYJP5VEWQ5", "Overall": "5.0", "Content": "This is from a first-time tablet owner.|==>> Upgraded from the original 4-Star rating to 5-Star rating on 7/16/2013|** PROS **- Processor and WIFI are both very quick.- Screen is very responsive with no delay.- Screen is quite sharp and bright.- Good sound quality.- Amazon Instant Video streams hiccup-free as long as the reception is good.- Lots of good pre-installed apps.|** CONS **- Cannot install newest version of Flash Player. (11.1), installation is blocked by OS.- Amazon Instant Video only works with a browser called \"Browser\" (found under Apps). Does not work in Chrome or Firefox. But it does work.|** BOTTOM LINE **This is a great tablet if you aren't a tech whiz who needs the latest bells and whistles, even though this tablet comes with a lot when compared to the more expensive competition. The price has varied by $10 since I bought it. Get one now before it goes any higher!|** UPDATE: 4/22/2013 **I am happy to report that the tablet is running well. As I mentioned earlier, I don't need too many frills so I am happy with what it came with. If the bug to \"modify\" it ever catches, I'll start looking into rotting it. But for now, my needs are met (web browsing and streaming).As you may already be aware, there aren't a whole lot of accessories for this tablet. Depending on your taste that could be a good or a bad thing. For the budgemt-0minded, it removes the temptation of constantly personalizing. On the bad side, finding even the most basic accessories may be a challenge.I felt that, at the very least, having a screen protector and a carrying case was important. based on Amazon's recommendations on the product page, I ordered the Black 7 Inch EVA Hard Shell Cover Case + LCD Screen Protector for Coby MID7012 7-Inch Kyros Android Touchscreen Tablet. The case itself is very snug and solid. However, the screen protector was a bit smaller than the screen and also a little difficult to install (possible user error since it was my first time putting one on). But, they do the job. I am considering upgrading to a case with a USB keyboard. I imagine it will make typing a lot easier and the screen will last longer.|** UPDATE: 5/10/2013 **After Amazon's recent update of its online video player, I can no longer stream videos from Amazon's Instant Videos. After clicking \"Watch Now\", the screen goes black and all I hear is beeps. Will be contacting Coby's tech support to see if there is a way to update this tablet (techsupport@cobyusa.com)|** UPDATE: 7/15/2013 **I never got an email response from Coby. I have yet to give them a call directly.I did some more research on the accessories for this tablet. It turns out that this Coby and the Google Nexus are very very close in dimensions (0.5 x 7.8 x 4.8 inches Coby vs .41 x 7.81 x 4.72 Google). So I decided to find a keyboard case and a screen protector for the Nexus with the hopes that they would fit.For the keyboard case, I bought the ATC New Wireless Bluetooth 3.0 Keyboard PU Leather Case holster For asus Google Nexus 7 Tablet PC as well as eForCity Micro USB OTG to USB 2.0 Adapter to attach the keyboard to the tablet for charging if there is no computer aorund. The case fits very snuggly, but does cover some of the ports. I plan to take an Xacto knife and cut out the areas for the ports that are covered. Otherwise, a very good and solid case and keyboard.To protect the screen, I ordered the Tech Armor Google Nexus 7 Tablet Premium HD Clear Screen Protector with Lifetime Replacement Warranty [3-Pack] - Retail Packaging with the plans that if it was a little off, I would just trim it. It turns out that this protector fits the Coby flawlessly. A few bubbles stayed (first time doing this), but it works great.|** UPDATE: 7/16/2013 **I used the tablet today after several weeks and, to my surprise, Browser is able to stream Amazon Prime videos again. Not sure what changed during the last few weeks when I wasn't using it but this is a good change.|Will report back.", "Title": "Coby 7\" MID7065-8 - Great Performer", "Date": "April 15, 2013"}, {"Author": "Barry \"BSaltzman\"", "ReviewID": "R2IM075KLESFTW", "Overall": "1.0", "Content": "I've been reading reviews on inexpensive 7 inch tablets for a long time and previously saw a general consensus that they were a waste of money.Came very close to buying the Kindle Fire, but reviews on the Coby 8 GB tablet seemed to be a couple notches up, so I took a chance.  Turns out that this is a very fast, stylish, and compatible tablet.  The included Kindle Reader is fantastic - very crisp readable text, smooth page changes, easy downloading.  The tablet's fairly wide frame is perfect for holding in reading position.  Versatility is added by the included Google apps.  I use Gmail and added Google Calendar and Google Drive which makes it very easy to view my files.  Battery life seems fine and I am experimenting with turning off Wifi to extend battery life while reading.  I don't know what I am giving up by paying so much less for this tablet.***Edit 07/03/2013*****I couple of days before the Amazon return period ended, I noticed that the tablet would only charge about half way.  I was able to charge to 94% before a trip we were making, so I decided to take a chance and keep it since my wife needed the reader on the trip.  As luck would have it, it failed completely about a week later, too late to return to Amazon.  I didn't downgrade my review at the time because I thought I just got a random failure that could happen to any electronics.I called Coby and they determined there was something wrong and e-mailed me instructions for sending it back to them for exchange.  You must pay for shipping (about $10) and send them a $15 money order for return shipping, along with your invoice.  The e-mail says to wait 4 weeks after it was supposed to arrive before you even call them about the exchange, and it could take up 6 weeks. I waited about 5 weeks and called.  The representative told me that they didn't have it - the didn't \"log it in\".  In other words, my tablet is \"lost\".  I sent it regular mail without tracking - I have sent and received hundreds of packages this way and have never got one lost.  But these guys claim that they never got it.  I am going to try to trace my money order to see if they cashed it, but even that is not easy to do.  I got a month's use out of the original price and and additional $25 in shipping and have nothing now, not even a broken one. I am beginning to think this is a scam.***Update 8/1/2013****I had just about given up on this tablet when I received a comment that I could track my package using the Label number on my receipt.  I used that and USPS says that the package was delivered on May 31st - so they were lying as I suspected.But it gets worse.  I tried to call back to tell them I have verification that the tablet was delivered to them, and no more customer service!  You get a recording to go to their web site!  Of course, the web site says that you must call customer service.  (also see another one star review published today).I feel bad that I originally published a positive review which may have caused others to purchase this item.  Amazon should investigate this and remove the product.In my initial review I said I don't know what I am giving up compared to the more expensive tablets from reputable companies.  I managed to answer my own question.  Maybe if you never need to get warranty service this is equivalent.", "Title": "So versatile!", "Date": "April 17, 2013"}, {"Author": "Isaac E Salinas", "ReviewID": "RWIGZZZUQAK8E", "Overall": "5.0", "Content": "I own an ipad, and an ipod this coby tablet does pretty much the same as the forementioned at a fraction of the price.", "Title": "decent tablet", "Date": "April 2, 2013"}, {"Author": "valued customer", "ReviewID": "R3T5ZTYAX2A1Z7", "Overall": "5.0", "Content": "My first impression was surprising good. Screen is good, color of good, sound of ok, speed is good, response time is good, wifi is good and strong, a lil heavy but that's good because of it was too light it could be mishandled, battery life is good so far, connects to labtop with no problem, downloaded divers with no issues....no complaints so far.....great tablet for the price, actually great tablet  regardless of the price!!!!", "Title": "2 Thumbs up for the amazon tablet underdog!!!!", "Date": "April 11, 2013"}, {"Author": "Jana Taylor", "ReviewID": "R2UMC2CNHH9Q17", "Overall": "3.0", "Content": "EDIT 6/4/13 - My original unedited review will appear below... my editing will appear in this paragraph.  I have changed my review from 5 stars down to three.  My tablet has now developed some problems.  The battery is draining after an hour and the on/off button is not working as well as I would like it too. Sometimes I have to fight with it to turn it on.  I wish I could return it for a new one... the second Coby I purchased for my mother in law seems to be working ok... but mine seems to be having the issues.  So I think it's just defective.  If it develops any other problems I will let them be known._________________________________________________________________________We own several tablets so I am comparing this one to our past experiences.  We have 2 Samsung first generation 10\" tablets, 1 Samsung first generation 7\" tablet and a T103 Cruz 7\" tablet.  The Samsungs are top to the line great (even being older) and the Cruz was a horrible disaster.  So it was with a bit of trepidation that I received this Coby, not really knowing if I could trust the brand.  I have to say though I was pleasantly surprised.Set up was just as easy as my Samsung Tablets, and even my Samsung S3 phone was.  The interface being android was pretty much the same actually.  It took under 10 minutes, as the unit arrived with an 80% charge already so I could start right away.The camera is only self-facing... that is something to note.  My other Samsungs go both ways.  This is only a minor gripe... and actually not even a gripe.  We don't use tablets for taking pictures, we only use them for web-camming and so a self facing camera is fine for that.  Photo quality isn't quite the same level as the samsungs but again, we don't use this to take photos... we use our 8mp phones or our actual camera.  So not really an issue for us.Video playback is nice and smooth. This unit has an SD card slot where our older Samsungs do not.  That is a nice feature to have.Love the fact that we can access the google play store.  Already downloaded many of our favorite apps with no issues.... YouTube, Zoodles Parent Control, Kids Games etc...  The reason our Cruz tablet was such a disaster is it could not access Google play and so we couldn't download any great apps... it was a constant struggle with Apps failing to download or not running at all or just finding any that we could load.  Google Play makes this Tablet an excellent value.  I will update this review if and when we run into an app that we can't download.This tablet is MUCH lighter and slimmer than our old 7\" tablets.  I've seen other 7\" that are slimmer than this one but it's still really sleek and nice.  Nothing to complain about definitely.  You could buy a slimmer tablet and play 3 times as much but I don't see an advantage!Comes with a protective \"cover\" for when not in use but I'd recommend buying a different one.  It's too snug, hard to get it on and kind of cheap looking.EDIT 5/2/13 - I got this tablet FREE through the Vine program.  Today I just PURCHASED a second one as a gift for my mother in law.  That should tell you something.  I am putting my money where my mouth is.  This is a great value, and a great little tablet.  Having google play on it is what distinguishes it from the other bargain tablets.  There are other Coby's for sale on Amazon... some cheaper, but please watch to make sure they have \"google play\" and not \"get jar\" which sucks.", "Title": "Super Value... Edit - Maybe", "Date": "April 24, 2013"}, {"Author": "Calvin Lee Burke \"Calvin Lee Burke\"", "ReviewID": "R3IE37UZZQZUFM", "Overall": "1.0", "Content": "DO NOT BUY ANY COBY PRODUCT, EVER.UPDATE: It is August 1, 2013. This is almost 90 days since my return for exchange. Now they route all calls to a website. More stalling and stealing. Called again, today, 1 August. NO MORE CS call center! No answer at ANY number. No box for messages. No one. THIS IS A RIP-OFF.UPDATE: It is August 12, 2013. This is almost 100 days since my return for exchange. Now they route all calls to a website. More stalling and stealing. Called again, today, 1 August. NO MORE CS call center! No answer at ANY number. No box for messages. No one. THIS IS A RIP-OFF.Again, today, August 13th. Get this.Their CS number 877-302-2629 says use cobyusa.comCobytusa.com says use Corporate 877-302-2629.Also, called GRAND COMMUNICATIONS listed on their useless page. They left Coby, like everyone else, and basically said they got burned and didn't want another lawsuit!!COBY Electronics, Corp.1991 Marcus Ave.Lake Success, NY 11042 USANO ONE ever answers, returns e-mail, let alone return my product!!None of the numbers. Not New York. None of them.New Info. Communist China Front. Here is the Profile.Detailed Description1991 Marcus AvenueLake Success, NY 11042United StatesFounded in 1990Phone: 718-416-3300Call this number and hit *. Then put in the first three letters of the officers. Got Young Dong (LoL) and left a message. You can maybe find someone it they aren't chaining slaves to machines in China.Fax: 718-416-3305[...]Key Executives for Coby Electronics, Corp.Young Dong LeeFounder and Chief Executive OfficerMr. Michael TroettiPresidentSam OhChief Operating OfficerJodi SallyVice President of Marketing---------------------------------Read what has happened to me on a standard product return and ask yourself if you need this low-grade music products (purchased on Amazon) causing you the same incredible hassle. They have never e-mailed or called me about any aspect of my return or replacement.Overview: Since May 5th, 2013 when I returned a Coby product they have given me the most BS runaround ever. Not only do their Chinese slave-produced products breakdown easily, but just try to return them!!!Here is what has happened to me since May 5th.(Below this timeline is the letter I sent with the $6.00, Amazon receipt and the product to Coby. Here is the BS this POS company has done to me since.)Sent Letter May 5th. Timeline that followed:Called Coby -- two numbers 877-302-2629 and 912-966-2629 that are both stonewalls. Then FINALLY got CS (customer service - a call center not connected with corporate, or factory or return warehouse)1) Called a week after mailing to ask if they got the return. They had to move. Will take a month to move out to California so the boats from China can deliver these products and they can make more money than from Knowlton, Georgia with reduced shipping. Call back in a month.2) Called one month later they have to close for inventory of new factory. Call back in two weeks. They also said the replacement of the item will be delayed because of shipping from CAL to FL.3) Called two weeks later. The person in charge of reading the CS requests about my status is now on vacation. They don't know exactly when she will be back. Call next week.4) Called next week and the women who processes the requests is nowhere to be found. Call back. \"They are really trying to help.\"5) Called last week to check status and they tell me the product is on back order since October!!5) Called yesterday to see if any progress put in three request to upgrade. I told them I didn't care if the color is pink about now. They said \"they are doing all they can.\"6) At about the 10 week mark, today, I called and was told I was  suppose to call corporate:516-775-8880 and talk to someone named Mike at x113.Not valid.Or call Kate.Not valid.Dialed O for operator.No operator.Told to dial O to leave message.Mailbox full.7)Then I was suppose to call corporate at this number: 912-966-2629 and talk to the same Mike at x113.No answer at 113.Dialed O.No operator.8) Called CS back and they told me \"they were doing all they can.\"9) Called today, 1 August. NO MORE CS call center! No answer at ANY number. No box for messages. No one. THIS IS A RIP-OFF.Now I am going to do all I can:DO NOT BUY ANY COBY PRODUCT, EVER. INVESTIGATE the bastards.In addition, I have already filed complaints wit the Sate of Fl, Division of Consumer Services, and the BBB of Cal and FL.--------------------------------------------HERE IS MY ORIGINAL RETURN LETTER5 May, 2013Coby Electronics CorporationTechnical Support150 Knowlton WaySavannah, GA 31407912-966-2629RE: Return of Model# 620-8GBRed MP3 Player for Replacement.Coby TS:I have owned two Coby MP3 Players. My current is the 620 8GRED and while I enjoy it and it seems to come on, the head sets ALWAYS start distorting or just don't make contact.They just do not seed properly and I usually never get anything, let alone clear sound.I deleted all the personal music and stuff so it is empty.I have tried multiple brands of headsets and plugs (especially Coby) and it his cost me more than the players!! None of them work.Both players still don't work. I threw the 601 into the Atlantic out of frustration and bought the 620. Now it is doing  the same thing. I have to adjust and adjust and it still distorts at the plug-in no matter if it straight or L-shaped Plug.Coby CS told me to send this, my address/phone below, my Amazon receipt (6 months old), the player Coby model#620 8GBRed, and a $6.00 M.O. addressed to Coby.Sincerely,Sxxxxx RxxxxxXxxxxxxxxxxxxXxxxxxxxxxxxxXxxxx3xx xxx xxxx", "Title": "Coby Products, SUPPORT and returns...READ THIS", "Date": "August 1, 2013"}, {"Author": "Chris S", "ReviewID": "R2S9QVSGJ52IIU", "Overall": "5.0", "Content": "Recently purchased the Coby tablet for my kids Coby 7-Inch Android 4.0 8 GB Internet Tablet 16:9 Capacitive Multi-Touch Widescreen with Built-in Camera, Black MID7065-8.  I have the Nexus 7 myself. The kids have loaded several game apps and have been playing constantly. Found the Coby to be quick, responsive, smooth, no lag or freezing, bright screen, no problem with any of the apps from Google Play store.  It feels lighter than the Nexus 7, and the screen is not quite as brilliant.  But the game play seems to be just the same. I plan to buy a cover and screen protector from Amazon, their prices are much better than the retail stores for accessories.  It is a little slick when holding it, so feel I need the cover. Battery lasts about 4 hours when playing games.  The price is so much better than other name brand tablets, and it has everything, speedy processor, 1gb ram, SD card, hdmi, Google Play store.  Solidly built.  For the price, I feel it is an excellent buy.  Works like the Nexus 7, but with the added bonus of the SD card and hdmi out.The one question I have of other Coby owners is, where is the Task Manager?  I want to be able to kill some of the running apps, because in the settings, several of the games continue to say Running after kids have quit the game (slender, subway surfers, glow hockey). Also, no pull down notification panel for info and to toggle on and off, unlike the Nexus 7 or Android phones.  Any advise on this would be appreciated.", "Title": "Great tablet, good price.", "Date": "April 20, 2013"}, {"Author": "S DAL", "ReviewID": "RUUNH1C90UAG2", "Overall": "1.0", "Content": "Do not ever buy this product. It will work for approximately 2-5 weeks and will break. Then in the rare instance you get a hold of anyone at the company they'll have you send it back to them with $15 for return shipping, and you will NEVER see your tablet again. I was told to wait 4-6 weeks for return. It's been 13 weeks and no tablet, no email, no money back. The manufacturers website lists a number to call, which then tells you via recorded message to go to the website which has the number you just called. If you, somehow, magically find the corporate switchboard, every person you call goes to voice-mail and has a full mailbox, your call then disconnects.Update 04/02/2014It has been a year since my purchase and after all that trouble I went through in the summer, i still have no indication of ever getting my tablet back.I've emailed several people in the interim, every mail gets bounced back as an \"invalid address\". The phone numbers I've got written down now connect to an entirely different company. and the website COBYUSA is just a logo for COBY and nothing is clickable.Amazon needs to remove any and ALL Coby products, as the company is either a figment of our collective imagination, or no longer in business.", "Title": "DO NOT EVER", "Date": "August 21, 2013"}, {"Author": "markgraf", "ReviewID": "R336AR3NESD4YA", "Overall": "5.0", "Content": "I am amazed that such an inexpensive tablet can have the power that it does.  A dual core processor and a full 1GB of RAM really makes such a difference.  I do not regret this purchase in the least, which is more than I can say for a lot of things I've bought in the past.", "Title": "Love It!", "Date": "April 10, 2013"}, {"Author": "Melanie Thompson \"pigsnfish\"", "ReviewID": "R1A4WU8BAYJ02T", "Overall": "5.0", "Content": "Okay, so it took me a year to finally break down and buy a tablet.  We have three desktop computers, a slew of ipods and a couple of laptops in this house.  Why in the world would I need a tablet?  There's no way I could have gone the i-Wanna-Pad route--holy buckets, those things are expensive!!  I went off the reviews of Amazon and came up with this little gem.She's a beauty.  I've had no problem figuring out to make things work.  I've barely used an ipod before, though I watch my teenagers on theirs all the time.  Google Play has been easy to deal with ( you just search \"free\" for the free apps.)I'd owned a Nook before and the thing fell apart less than two months after I purchased it, and BN was impossible to work with on getting the warranty to work.My 9-year-old son and 11-year-old daughter are using it for some of their homeschool assignments (cursive and multiplication drills so far).  I love being able to drag their homework with me in the car.  They don't appreciate it so much, however!!  But with the abuse that this thing is going to get, we may have to break down and buy a few more of them.  Time will tell!!UPDATE:  We've now had this tablet for a few months.  There is always a fight for who gets to have \"Chad.\"  (They named my tablet.)  The only downside we've had with this tablet is that I only bought one of them.  We do have to charge it regularly, but we use it regularly.  100% pleased with this purchase.", "Title": "Love this thing!", "Date": "April 25, 2013"}, {"Author": "marat sharipo", "ReviewID": "R2SEYO6HF91TH2", "Overall": "1.0", "Content": "I bought this item for gift and battery works only one hour my daughter not happy maximum price for this coby 50$", "Title": "Battery works only one hour", "Date": "July 24, 2013"}, {"Author": "AZ Jim", "ReviewID": "R2F9FED5N7VFT1", "Overall": "5.0", "Content": "There are a couple of lengthy reviews here that I totally agree with so I won't repeat much. The Coby 7 (MID7065-8) has proven a great choice.  I was interested in the smaller form factor and an Android update after using a 10 inch Android tablet for a couple of years. The screen quality is great and the dual core processor is snappy.  Unlike earlier versions of this tablet, this one is has Google Play access. While this is not a showstopper with alternate app stores like Amazon's great app store, having full Google access is handy.  This tablet's connectivity is great.  It will accept up to a 32 GB SD card for additional storage and a micro USB port to connect to other USB devices.  I recently made use of this by connecting a USB on-the-go cable to the tablet and an SD card reader allowing the tablet to \"see\" photos I've taken on my camera and upload them to Dropbox as a hedge against disaster on a recent trip. Also in the connectivity department is the micro HDMI port allowing HD output to a digital TV in case you want to view your downloaded movie on a bigger screen. Unlike some small tablets, the Coby has a front facing camera and microphone so you can use Skype or other communications app for video telephony. The Coby is a great choice as a small form factor, full featured tablet at a value price point.  If you are just getting into the tablet market and are looking for a good entry-level device; this will fit the bill.  Whether apps, games, movies, ebooks, or web surfing are your interest, you'll be pleased with this tablet.", "Title": "Great Value", "Date": "June 10, 2013"}, {"Author": "Stinky Greg", "ReviewID": "R2IE3IE7TURMP3", "Overall": "5.0", "Content": "I could't be happier with my purchase of the Coby MIDI 7065-8 Tablet. It feels well built and actually came with a little manual that many will find helpful. I'm very impressed with how responsive this tablet is. The touch screen is very responsive and the dual core 1.2 ghz processor coupled with the 1 gig of ram make opening and using multiple apps a breeze. Set up was a cake walk and I had this up and running and connected to my wifi in less than 10 minutes from the time I began unboxing it.I've always considered myself a power user when it comes to technology and as such this little unit did not disappoint. While it's not a higher cost tablet it still had all the features I was looking for specifically an expansion slot for more memory. While I use the cloud I abore being completly limited by it. One thing to point out is the lack of a rear facing camera on this tablet. For me that was not an issue as I don't think a tablet is the best device for picture taking.I bought a OTG cable so that I could utilize my USB thumb drives and have had no issues getting them to work. That little addition gives this unit near unlimited storage capacity. A very happy thing.One last thing is that the Google Play store worked flawlessly for me. I did find a few apps that weren't compatible with this tablet but very few. Most of those were very specific apps such as the one for my small town bank and I suspect they might not be compatible with and even more expensive tablet.As for the WIFI some reviews expressed concerns on the strength and quality of their connections, I experienced none of those issues. The unit connects quickly, with good strength and stays connected.In conclusion if you are like me and tend to look to get the most bang for your buck then by all means buy this unit. On the other hand if you are more concerned with what name is on your electronics then this probably isn't the tablet for you. Just remember that you should never judge a book by it's cover.*****************45 DAYS**********************So I thought I would come back now that I've had this tablet for 45 days and give you an update on my state of satisfaction. I am still completly happy with this device. It has done everything I have asked of it with no issues. The only think I have encountered was when I tried to update the Kindle app. It said that a previous version existed and that the signatures did not match. I couldn't uninstall it because it was a system app. I still haven't figured out a work around but to be honest I haven't tried to hard. The version of the Kindle app on my Coby works fine when reading books so upgrading is not that big a deal and certainly does not change the high regard I have for this device. I asked myself if I would purchase this device again and the answer was yes. You can not beat the number of features this device even at a higher price point. If you are looking for a low cost tablet that works well and is loaded with features lacking in some more expensive devices then this is the tablet for you.", "Title": "Very Happy", "Date": "June 4, 2013"}, {"Author": "Steve Kaye", "ReviewID": "R3NL2PEXGUUCEA", "Overall": "5.0", "Content": "I have only had my Coby 7065 for a week but I have enough hours on it to write an informed review. I will edit this review if I my assessment changes but for now I am starting it with a 5 Star rating. I also own a less expensive D2-711 (discontinued) which I gave a 5 Star review.First thing you should know is that most of the low cost tablets are not designed by the seller. It appears to me that the Chinese and others are producing generic tablets and selling them to vendors. This is why I do not believe you can rely on “manufacturer” reputation. As I said I have a D2-711 and rated it 5 stars but it was discontinued so a friend bought a D2-712. One may thing that the latest is the greatest. NOT. My 711 is simply better than his 712. My point is you need research any tablet before you buy. But you are lucky as you have the Amazon community to help you ferret out the winners from the losers. BUT you need to read all the reviews starting with the worst first. I say this because there are only four 1 Star reviews posted on Amazon for this tablet and two of them are for the wrong product.Pros:• Customer service actually answers the phone.• It has passed Google labs testing so you will not have to “root” this tablet to download apps from Google Play. This is a big plus in its favor.• Dual core processor is rather quick and certainly excellent for the money.• Does not come loaded with “Bloatware”• Wireless connection is rock solid and through put as tested on SpeakEasy.net is very good to excellent. You won’t be disappointed• Connection to computer is easy (but the “how to” in manual is wrong) so just disable USB Debugging in Developer Options.• The screen colors and resolution is very good, everything looks great• Connects to your HDTV via a mini HDMI cable and watch your movies. This is a high end feature that works as well as any I have seen.• It is a Kindle reader• Preloaded with Google MapsCons:• Slow to boot• Technical service agent probably doesn’t know anything more than you do.• Touch screen is not as positive as I would like. You will notice this and will find yourself double-tapping often.• Sleep/On/Off button is not as responsive as I would like• Does not have a front facing camera but then that is a high end feature.It is not often you get more than you paid for butTHIS TABLET IS A GREAT BUY", "Title": "I got more that I paid for", "Date": "May 31, 2013"}, {"Author": "C. Boulware", "ReviewID": "R3UN9V3G90KP60", "Overall": "2.0", "Content": "I bought this for a vacation I just got back from so I could watch movies on flight and at night. It just doesnt work as well as I had hoped for. Its got a lot of cool features like the sd card slot and the mini hdmi port but the screen is not the best. The battery doesnt last in standby.The android os is basic. Theres no drop down menu like on the phones. It doesnt keep time well at all. If your looking for a web browser then go ahead. If you want a tablet but dont want to go for an ipad and save $500 id go with a samsung galaxy note or tab 2. Thats what i am saving up for now. Id also reccomend the 10 inch and not the 7 inch. The 7 inch is not much bigger than a regular smart phone. Save up a little more money and get a better tablet than this! Trust me you will be happy!", "Title": "Not Worth The $100", "Date": "July 13, 2013"}, {"Author": "bige247", "ReviewID": "RTT71LUZVTGH6", "Overall": "5.0", "Content": "I cannot believe you can buy this tablet for less than $100! I have had a Kindle Fire and used a Samsung Galaxy and the Coby MID7065 is more responsive, just as crisp and all around better value. The sound quality is good and resolution equal to a Kindle Fire, when I opened the box, I told my wife I believe Coby contracts with Amazon and this tablet IS a Kindle Fire without the name! You cannot go wrong with this tablet whatsoever! BUY BUY BUY", "Title": "It's a Kindle Fire - just with the Coby name!", "Date": "July 13, 2013"}, {"Author": "Dawn Walsh", "ReviewID": "R1K67WFUGIN5OG", "Overall": "5.0", "Content": "bought for myself end of May after much looking and reading of reviews.  I love my tablet! I am returning to buy one for my 8yr old granddaughter its that durable and with square trade its Perfect. Also price has dropped since then. We prefer the Coby over our Samsung galaxy tab2", "Title": "back for another", "Date": "July 11, 2013"}, {"Author": "N. Post", "ReviewID": "RK1B93TU0I8WJ", "Overall": "4.0", "Content": "great economical tabletlike the screen size and displayapps easy to add with play store loaded alreadyexpansion card slot great to load video clips or movies in order to watch on tablet.  We use it by downloading videos from you tube and watching in case we do  not have wifi to watch clips on you tube on the tabletmy kids ages 6 & 2 have no problem using the tablet, a great buy", "Title": "cost effective tablet", "Date": "July 11, 2013"}, {"Author": "by GeneBat", "ReviewID": "R2SCDFJDGUD4X0", "Overall": "4.0", "Content": "Wow! A whole lot of features for a smart priced tablet. The front and rear camera and the 1080p hdmi port sold me. This is a must buy if you don't want to break the piggy bank.", "Title": "Coby  MID1065-8 Android  Tablet", "Date": "July 6, 2013"}, {"Author": "Kenjas Creations \"Kenja\"", "ReviewID": "R3OCXCO3P0E9QW", "Overall": "5.0", "Content": "Ordered this product after seeing a tablet in action from a friend who had bought a Nexus 7 Android and doing some research on tablets. Believe me when I tell you that the Coby 7-Inch Android 4.0 8 GB Internet Tablet 16:9 Capacitive Multi-Touch is much better then the Nexus7 because it has basically the same software installed and it lets you install additional micro sd card for storage and/or use a usb stick but a converter cable from usb female to mini usb male is required. I had also ordered a keyboard/cover for it that came with said adapter cable so that saved me a little. Overall a fantastic deal and much fun for power users too :)", "Title": "I Love my Android!!!", "Date": "July 3, 2013"}, {"Author": "JH \"JH\"", "ReviewID": "R1OHLZPFIFCGYI", "Overall": "5.0", "Content": "I got two of these for my kids, they work much better than my Lenovo (which was more expensive) and are very responsive. They love them and can load a ton of games on them even without an SD card. My son's screen did break- randomly it seems, as my daughter's is older and hasn't had a problem) and I had to contact customer service. I've heard their customer service used to be bad and they used to use non-English speakers but my service was great and the man who helped me spoke like a native (he might have been one). He'd never heard of the problem but said that they would cover it as a warranty repair. If I could go back I wouldn't have bought the Lenovo and would have bought another one of these instead.", "Title": "Great product, great service", "Date": "July 1, 2013"}, {"Author": "W. Watts", "ReviewID": "R1R8XU29IXF47A", "Overall": "5.0", "Content": "When I bought an IPad for my wife I didn't think about the implications, or applications for that matter. She downloaded some games for the children (5 and 2 yrs old) and of course, they all couldn't have enough access. I tried a generic tablet thinking what if it broke or was damaged because it was inexpensive, I wouldn't feel the hurt. Not quite.To me, what separates a generic tablet from a brand name tablet is the functionality of the tablet, the processing power and the responsivity of the touch screen (I'm not into gaming and the camera features). Brand names outperform the generics in these categories by leaps and bounds. The Coby is a perfect compromise. While it's not a very popular tablet brand name, its not an expensive model either. The features are great, the pre-installed apps relevant (Google Play, google chrome, youtube to name just a few) and the touch screen very nicely responsive. The processing speed is good and it's a nice, neat all around tablet. My 5 year old can play his games on it, there are very nice educational apps for my 2 year old, who thinks he's playing games too (well, he is, but you know what I mean). I use Moon Reader Pro to read my books and everyone is satisfied with their piece of the pie.Great little Tablet!", "Title": "Great Little tablet!", "Date": "June 29, 2013"}, {"Author": "Terry Little", "ReviewID": "R1QWKTWYBEW9EY", "Overall": "4.0", "Content": "A really good tablet for the price. Received in good condition. My only issue is getting my PC to recognize the tablet's USB connection with the data cable that shipped with it, but with a little ingenuity that can be overcome. Otherwise, I would recommend.", "Title": "Really Good Tablet", "Date": "June 28, 2013"}, {"Author": "Kimberly", "ReviewID": "R30WYU3RD2WULK", "Overall": "4.0", "Content": "Love this tablet, so far the only bad thing I can say is the battery is not very good. I am actually on here to find a car charger for it. Besides that this is a fabulous tab if you are like me, that being using it for basic net surfing and lots of music. I can run multiple windows with no lag and dl music. Buy it!", "Title": "good tablet for the price", "Date": "June 23, 2013"}, {"Author": "stanfish", "ReviewID": "RZWBP26NOMT7A", "Overall": "4.0", "Content": "I considered name brand competitors, but bought this one because of extra 32G micro card storage.  Build quality better than expected for the price, (dropped on hardwood floor already) .  Already had an android smartphone so no learning curve, and was pleased with the upgrade to 4.0 OS.I use this primarily as a reader, and with the backlit screen it's great for reading in bed, when you don't want to disturb your partner.I bought the auxiliary case/keyboard, and acquired the bits required to hook it up, (not included), and it makes a adequate laptop substitute, however, I don't think I'll trash my Windows laptop anytime soon.Major minus is battery life.  To be expected with screen lit all the time, however, plan on charging daily like most phones..", "Title": "My first tablet", "Date": "June 21, 2013"}, {"Author": "Vee", "ReviewID": "RNIK0WL0AYQVF", "Overall": "4.0", "Content": "The Coby 7-Inch Android tablet is a good product. It's easy to operate. The picture quality is pretty good despite the low resolution screen.  Battery life is decent. This tablet may not be able to compete with the bigger brand name tablets out on the market but still has features that the others lack surprisingly enough such as a miniHDMI port? What? Unheard of on many of the higher priced tablets. It has good functionality and if Coby upped some of the specs a bit, it would be on par with some of the tablets out now. The (Android 4.0) OS is a bit outdated but still compatible with most of the apps in the Play Store. If you're looking for a \"wow\" tablet this isn't it but if you just want an Android tablet with basic functions and easy to use then try this one.", "Title": "Not bad", "Date": "June 19, 2013"}, {"Author": "John K.", "ReviewID": "RST3X9TEX926", "Overall": "5.0", "Content": "This is a great price to pay for a responsive, high-resolution tablet with WiFi and Bluetooth. As long as you don't mind getting on the Internet using only WiFi and not a cellular data package, you can do just about anything, including connect a Bluetooth keyboard to get some real work done. Since it has the Google Play store, just about any Android app will work.Parents: Yes, this tablet runs Netflix! So for a very decent price you can hand this tablet over to your young'uns to let them go hogwild watching kids' programming. Netflix is a super great way to keep your kids entertained. Their library is growing very quickly, there are no commercials, they can easily find what they want to watch with no parental help, and everything is safe to watch (I just ask my kids to not pick the Y7 shows, but when they're older they'll be able to watch anything from the curated kids' collection).", "Title": "Great price point", "Date": "June 19, 2013"}, {"Author": "John A. Chartier \"Skynet\"", "ReviewID": "RDS0XX2UXCYAD", "Overall": "4.0", "Content": "I wanted a nice reliable tablet and that is what I got. There were more expensive ones, but they were overkill. This does exactly what I want and gives me complete access to the Google Play store for apps. I love this little device! The on/off button and volume buttons are kind of in a funky spot. I accidently hit them on occasion. But it's not a deal breaker. I just have to be more careful.", "Title": "Nice bang for the buck", "Date": "June 18, 2013"}, {"Author": "Tim \"Timdiana\" Dunn", "ReviewID": "R2OKPT8BCI4JFS", "Overall": "5.0", "Content": "I've always thought Coby tablets were useful, and after using this, I can't say that my feelings have changed. I love the tablet style, from running videos to its infinite wi-fi connection. I've also discovered that a New 32gb Micro Sd Card Sdhc Tf Flash Memory Card 32gb Class 10, New! Usa! works great for this tablet. I recommend this android if you are looking for one. It is easy to use and it's worth it.", "Title": "Great tablet from Coby", "Date": "June 16, 2013"}, {"Author": "homemaker in Wloo", "ReviewID": "RJ9W5KMY2YD5V", "Overall": "5.0", "Content": "I wanted a tablet. I was actually shopping for a different brand...and realized NO USB port for additional memory !  This unit is economical, android system, and purse size.  I do not have to lug around my laptop.  It has the capacity to sync with my laptop and stored documents, pictures.  I LOVE this item.  My grandkids play games. I read my emails and play my solitaire.  Purse size is so convenient.  This definitely is a Christmas idea ! for grand munchkins !", "Title": "Outstanding , has USB port", "Date": "June 15, 2013"}, {"Author": "travis l hill", "ReviewID": "R9BK33H4VX74H", "Overall": "5.0", "Content": "i love it works wonderful. it have not lock down on me at all . Have not had any problems with it yet.", "Title": "love it", "Date": "June 13, 2013"}, {"Author": "Perenvilla Hawkins", "ReviewID": "RHANMH6577AFO", "Overall": "2.0", "Content": "This seem to be a good tablet, but found so many problem didn't recognize usb port on laptop as well as the lighting was dark and it shut down on it on", "Title": "not worth it", "Date": "June 12, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3M0VCN39TSSXP", "Overall": "5.0", "Content": "This tablet is amazing; and for the price, you can't go wrong. I would surely purchase another one, or recommend it.", "Title": "Awesome tablet!", "Date": "June 7, 2013"}, {"Author": "LynnWong", "ReviewID": "R6MNMM1VQJKWR", "Overall": "5.0", "Content": "This tablet has the lowest price compared to the similar products. But it has a perfect performance, the screen can be touched smoothly and the system is fluid.", "Title": "Fantastic experience with this tablet", "Date": "June 5, 2013"}, {"Author": "TA", "ReviewID": "R1E7OF2S16H87N", "Overall": "1.0", "Content": "I bought this for my nephew (May 2013)  since he was staying with me during the summer.  This table kept freezing up from the very beginning and he was so frustrated with it, he just toss it aside.  I put it up and just recently bought it out again and tried opening it. It wants a Google login name and password.  We never set up a email with Google. I have tried for a week to open it up by setting up an email with Google and it still locked and it doesn't work .  Error \"too many pattern attempts\".  I am at the point of selling in a garage sell.  Is there anyone out there that has had this problem?", "Title": "Very disappointed.", "Date": "May 5, 2014"}, {"Author": "Snow Skier \"Phil\"", "ReviewID": "R2MG6X3U9P9ENL", "Overall": "2.0", "Content": "I bought three of these as gifts.  One of them never did work (failed to charge or turn on) so I ended up buying a replacement.  If they work for you great, but I would not buy another one.", "Title": "Poor quality", "Date": "April 5, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1GP531NZEOVAJ", "Overall": "1.0", "Content": "Very slow, battery life lasted long, couldn't watch most movies not enough memory space outdated android os ....product returned. Thanks anyway", "Title": "not for me", "Date": "April 3, 2014"}, {"Author": "Alexander Don-Doncow \"Critical Al\"", "ReviewID": "R2216HMU6MBJHV", "Overall": "5.0", "Content": "I still can't figure why so many people spend upward of $400 for units that do not perform significantly better than this one?!Paid $120, added 32gb for another $20 and ended up with a fast dual core 40gb machine that so far does everything I want it to do and it does it fast and predictably.Load it with full resolution 16mb pictures, HD 1080 videos and it all works great. Do not have to reduce or compress the media at all!!!Wireless is excellent, so is the BlueTooth. It's got everything except a high definition camera, the front mounted camera is more than adequate for Skype that is all I need.Build quality is good, albeit slightly bulky. Touch screen is quite usable but not the best in  the business (so what, I only paid 120 bucks for it).Battery life is so so, nothing to write home about. Still quite acceptable..", "Title": "For the price, awesome!", "Date": "April 1, 2014"}, {"Author": "Anonymous", "ReviewID": "ROXTHAQ8PMT94", "Overall": "1.0", "Content": "It works, but it's slow -- very slow! You get what you pay for, that being said. If you want a basic tablet to access email and surf the web, this is for you. If you want to download apps to customize your tablet and use different apps within the device, then look elsewhere.", "Title": "Save and get the better brand device", "Date": "March 29, 2014"}, {"Author": "Beth B.", "ReviewID": "RXYGTKGKKV0WB", "Overall": "1.0", "Content": "I just discovered that Coby is out of business. If you buy a Coby product, you're hanging out there alone. There is no customer support and no warranties.", "Title": "Out of Business! Don't buy!", "Date": "March 17, 2014"}, {"Author": "Sandy A Devlin", "ReviewID": "R2HRK02J5U3W77", "Overall": "5.0", "Content": "I am very happy with my purchase of this tablet.  I mostly play games on it, but I can also check my emails or go on line when I need to.  It is easier to carry this than my laptop.", "Title": "Coby 8-inch", "Date": "March 9, 2014"}, {"Author": "ABEL NIETO", "ReviewID": "R268U8A3FGC8D9", "Overall": "5.0", "Content": "I SHOOSED THIS ITEM BECAUSE OF ITS PRICE AND PERFORMANCEI LIKE IT BECAUSE IT WORKS VERY WELLI RECOMEND IT TO EVERY BODY WHO WANTS QUALITY PRODUCTS", "Title": "YES THIS PRODUCT SATISFICED MY EXPECTATION", "Date": "March 7, 2014"}, {"Author": "Melissa K.", "ReviewID": "R2FSR3WGNYRKHN", "Overall": "5.0", "Content": "perfect my kids ages 3,6,8. they can work it easily without needing my help constantly. the picture quality is bad and only has front camera which is my only complaint. otherwise i love it!!", "Title": "perfect for my kids", "Date": "March 5, 2014"}, {"Author": "good game", "ReviewID": "R56KTPSZMELJO", "Overall": "2.0", "Content": "It good for kids to work but if you drop it a few times it breaks in 9 day I would rather have in  iPad 4.  Or computer bad for anybody I want my money back but my grandparents got it", "Title": "Good but", "Date": "February 24, 2014"}, {"Author": "Thomasine \"Thomasine\"", "ReviewID": "R1APPCRVZD2YQF", "Overall": "5.0", "Content": "I gave the coby 7in to my daughter for a gift. She can read on the train  to and from work. She in love with it.", "Title": "she love it", "Date": "February 24, 2014"}, {"Author": "CARLOS J BATISTA HERRERA", "ReviewID": "R2WTN2IURU9B7Z", "Overall": "3.0", "Content": "I must say it works very well, but several months ago that accidentally broke the screen. And do not find anywhere. This is important for electronic equipment. The availability of spare parts.", "Title": "Good, but can not find parts", "Date": "February 13, 2014"}, {"Author": "Gonzilla7", "ReviewID": "RVUETI4RFAVWN", "Overall": "5.0", "Content": "I bought this for my son in December and it is a great product.  My other son owned one for years and he has since moved on.  The biggest problem is the Coby company no longer exists.  I knew this when I bought the tablet so I purchased a warranty.  My son broke the screen (of course) so I had to send it in to the warranty company.  It will be reimbursed.  I bought it on sale so had to look for a tablet more in the price range of my refund.  I wish this one were in that price range though.  It is fast, can handle all the apps my son has downloaded, fast with videos, and I can't really think of any downside.  Coby had awesome electronics.", "Title": "Great Tablet", "Date": "February 11, 2014"}, {"Author": "VegasVisionStudios", "ReviewID": "R2AGAJV1QDQ259", "Overall": "5.0", "Content": "Purchased 2 of these for my grand daughters, they have been using them for about a year now and they have served them well. They are completely happy with them.", "Title": "Great value", "Date": "February 4, 2014"}, {"Author": "Nick Garrett", "ReviewID": "R2OZ8JICZ6J7CW", "Overall": "2.0", "Content": "Ordered this product from Amazon Warehouse Deals thinking great price for a basic tablet. Order arrived on time, even though it snowed down here in the South.  Opened the box and tried to turn on the tablet. Nothing. Plugged it into the wall charger that came with it and waited for it to charge a little. Still nothing. Looked through the manual it came with and the charger and the charger says Blackberry. They had sent me a Blackberry phone MicroUSB wall charger thinking it would work with the tablet. It does not. This tablet needs a DC in 5v charger. Immediately contacted customer service through the chat option. They were polite and offered a return shipping label so I can receive a refund.So in short, I can't review the tablet because mine won't turn on.It got 2 stars because the product did not come as advertised, but the Customer Service was prompt in giving me a return label.I most likely will not buy any electronics from Amazon Warehouse Deals again.", "Title": "Wrong charger", "Date": "January 29, 2014"}, {"Author": "Curtis Jefferson", "ReviewID": "RFD36U0YW1VBX", "Overall": "1.0", "Content": "The charging port on the Tablet is bad! You have to hold and manipulate the plug to get it to charge.If you are able to finally get it to charge the battery doesn't hold a charge long, even when the Tablet is not in use. Tis is not something I would recommend to anyone, but I would like to warn them.I will be trying to get a good replacement. I'll keep you posted", "Title": "BAD charging port and battery", "Date": "January 25, 2014"}, {"Author": "Ben Black", "ReviewID": "R31NK9Z5H2HJ91", "Overall": "1.0", "Content": "Lasted four months before the charging port quit working.  Trying to contact Coby customer support let me to discover that Coby went out of business in July. I'd be more descriptive, but the pain is too fresh.", "Title": "Great if it works. You're SOL if it doesn't.", "Date": "January 13, 2014"}, {"Author": "jorgelouis", "ReviewID": "R9J3EVWNON2LD", "Overall": "4.0", "Content": "the Google play market is legit  plays 2k basketball and fifa  too  the speakers are  the only disappointment audio not too shaby; thats the only reason i didn't give  it 5 stars", "Title": "coby good", "Date": "January 12, 2014"}, {"Author": "Jeannie Keough", "ReviewID": "R2YX8Z5TV67524", "Overall": "4.0", "Content": "I bought this after seeing the price of the children based tablets and the kindle fire.  Does all the basics web surfing, email, pictures/videos,,, a great buy for the price", "Title": "Perfect gift for my son", "Date": "January 8, 2014"}, {"Author": "Notypst \"future beach bum\"", "ReviewID": "RPG58SL4DNGW0", "Overall": "5.0", "Content": "We bought this as a gift for a teenage friend and she loves it. She uses it daily for social media and mp3 player, for came5a and slideshows. She has had no problems with it at all and has had it now  about 8 months. No it is not a high end tablet. But for what it is is pretty dern good.", "Title": "gift", "Date": "January 8, 2014"}, {"Author": "Delores J Stewart", "ReviewID": "R1EUL79K37IYO8", "Overall": "1.0", "Content": "This is second one we had that quit after 90 days. Being used by a 10 year old that is very careful with his electronics. As a test to see how well first time user like would an expensive item but he liked it and found very easy to use.", "Title": "didn't last very long", "Date": "November 6, 2013"}, {"Author": "Ted", "ReviewID": "R2H0B5ZQRNS5SN", "Overall": "4.0", "Content": "Great cheap tablet. The battery could last longer but at this price point, it's to be expected. I got this for my clients to play with while they wait in the office.", "Title": "Does the Job", "Date": "November 6, 2013"}, {"Author": "Heather Morgan", "ReviewID": "RODHJMFBU4E94", "Overall": "1.0", "Content": "Works for  three months then the screen turned white. I am no longer able to use it!  I bought it for my son and he is so unhappy now.", "Title": "Waste of good money", "Date": "November 5, 2013"}, {"Author": "Paula A. Henson \"PHenson65\"", "ReviewID": "R2L24W9P3PZCIM", "Overall": "2.0", "Content": "I had it for less than a year and the touch screen no longer works. Now I find out that Coby has been sold off and the new owners aren't having anything to do with old products. So I'm basically stuck with a non-funtional tablet and a lot of books I can't read. It was a great little tablet until it broke. Hence the second star.", "Title": "Risky buy!", "Date": "November 4, 2013"}, {"Author": "Bill Stewart", "ReviewID": "R34LJVEB9F16RJ", "Overall": "3.0", "Content": "Most of the reviews are about the 7-inch tablet; that's fine for general vendor quality issues, but not useful for things like battery life and accessories.The tablet has a dedicated charger instead of micro or mini USB, which is really annoying - I have to carry the clunky thing around, instead of just a cable.  It's not a bad design, a small tubular connector with 5v, but it would have been much more useful to have a cable with the same connector and a USB A connector so I can also charge it from a computer or car USB plug.  I'm going to gamble that the cable they sell for their 7\" Kyros tablet will work, but there's no specification available.  And the manual's only on paper; I couldn't find a downloadable one anywhere on their web site.You'll also need to buy a \"USB OTG\" On-the-go cable to connect things like USB memory sticks to the micro-USB port, but at least a generic $5 cable worked fine.Coby pre-loads an ok collection of Android apps.  Unlike my HTC Android phone, there doesn't seem to be any customization, just the vanilla product.  (Hey, I wasn't even *trying* to make an Ice Cream Sandwich joke there...)  The most important thing that's missing is a \"Sync with Outlook\" application for the Calendar and Email.  That's mostly Google's fault (they want you to sync with their online Calendar and Gmail, but I can't sync those to my work Outlook), but HTC did a sync program for the phone.  The Google Play Store sells several of them for $29-39.  There was one free one that I couldn't get to sync up with my PC (don't know if that's a problem with Coby, Google, or Windows7) and one free-trial that seems to work so far.My other frustrations with it have been Android-related - the browser doesn't support Flash, and Adobe doesn't support Android, so the only way I found to watch ABC TV was to download the Photon browser from the Google Play store.  Worked ok, but warns you that Flash burns a lot of batteries.  And the touchscreen keyboards just aren't very friendly; I'm going to have to buy an external one to make browsing palatable.  There doesn't seem to be one specific to the Coby, so I'll have to find a generic one.", "Title": "10-inch Coby Tablet", "Date": "October 29, 2013"}, {"Author": "Her Mommy & His Wifey \"SoCalMama\"", "ReviewID": "R19ZBKXNE922HW", "Overall": "2.0", "Content": "Bought this on cyber Monday 2012. Bought it to play games, read emails & pin on pinterest while my husband watches sports....keeps me downstairs, since our only other way to get on the web is our pc, which is upstairs.The charger port broke in May. They replaced it and now it is broken again. I don't do anything. I'm not a techie, but I take good care of my things and this is just a bad product, I'm thinking.PLUS.....I can't get a hold of the manufacturer to get it replaced.Buying a Google Nexus tomorrow.Better to buy brand than go cheap....I learned my lesson....the hard way :(", "Title": "Works great...until it doesn't.", "Date": "October 25, 2013"}, {"Author": "Regina F. Love", "ReviewID": "R2GFQ2T029PYCX", "Overall": "5.0", "Content": "I have bought this tablet for my husband that replace his Zeepad that was a Christmas present that got broken.  I wasn't sure about these but they seemed to have good reviews.  I am amazed and pleased because I have a Samsung Tablet that my children got me for Mother's Day and this tablet is as fast and works as good as mine does.  I have recommended this to my friend and she has purchased four and getting ready to get her fifth.", "Title": "Great Tablet", "Date": "October 24, 2013"}, {"Author": "joe", "ReviewID": "R3AR1SW70XA1X3", "Overall": "5.0", "Content": "Great for a kid and you cant beat the price. Makes a great firSt tablet for any kid. Christmas is around the corner.", "Title": "great kids tablet", "Date": "October 23, 2013"}, {"Author": "J. C. Danko", "ReviewID": "R35NIR218II9HS", "Overall": "5.0", "Content": "I shopped for a nice Android 7 inch tablet for a while until I found this one. I have had a Kindle Fire for almost 2 years and I like it but I wanted more flexibility, namely, Bluetooth and the ability to use a hard keyboard. This does all that and more. With heavy use I get about 4 hours of battery life if I keep the screen brightness down. I bought the 7\" Tablet Stand with USB Keyboard - Black Faux Leather Carrying Case and I like it but the micro to A USB adapter cable was clumsy and prone to damage. To fix that i bought a better adapter. Apollo23 USB 2.0 Mini 5 Pin Male to Female A Right Angle Adapter Convertor, Black connects my keyboard cable to the micro USB port on the tablet with nothing sticking out. I take this combination on trips and it ALMOST replaces a laptop.", "Title": "Nice Android tablet especially with the right accessories", "Date": "October 22, 2013"}, {"Author": "Michael", "ReviewID": "R393HZPOEI8BNS", "Overall": "4.0", "Content": "its good my little bro uses it so he likes it plus its cheaper then an ipad so that's a plus", "Title": "good", "Date": "October 8, 2013"}, {"Author": "Ricardo Williams", "ReviewID": "R3GHLNC99T68B8", "Overall": "4.0", "Content": "I bought it for my eight year old daughters and they love it tremendously. It is the right size and the right price.", "Title": "Worth the buy", "Date": "August 16, 2013"}, {"Author": "dana", "ReviewID": "R3ICWGYBAEQR7M", "Overall": "5.0", "Content": "great tablet for the money. i would highly recommend this tablet.it has great colors.blazing fast speed.and it great for taking anywhere.", "Title": "coby 7-inch android", "Date": "August 15, 2013"}, {"Author": "Natasha Bascombe", "ReviewID": "R7EVWDOA9Y2HS", "Overall": "5.0", "Content": "The product was everything I expected and more, it works great and is compatible with all the apps, including skype. I am very pleased with the reactive time between apps, the core is fast and very responsive. I must say, it is a very good buy. Well done Coby!", "Title": "Great product", "Date": "August 13, 2013"}, {"Author": "Mary Lynn Claycomb", "ReviewID": "R1KQCSFFQWFI7C", "Overall": "5.0", "Content": "really like this item and it was as described...arrived in a timely manner and so far it has met with my expectations.", "Title": "So far So good", "Date": "August 11, 2013"}, {"Author": "antoinette kunda", "ReviewID": "R3JAHBLKOAQC1Z", "Overall": "4.0", "Content": "I am very happy with the Coby Tablet. It is my first tablet so I don't have any comparisons but for me it is perfect. I am somewhat frustrated in trying to find accessories like bluetooth keyboards, carry cases, silicone protective covers, etc but the machine itself operates great, android system and google playbook approved so all apps load & operate beautifully. I have not tried the camera's yet but looking forward to that learning curve and experience. And to beat everything I did not have to break the bank in getting one. Love the price point and quality", "Title": "Coby Tablet", "Date": "August 10, 2013"}, {"Author": "Wiwik Sudiar", "ReviewID": "RE3FEZJS63158", "Overall": "5.0", "Content": "I love this thing! It can be connected to any TV with HDMI ports and my kids love seeing Angry Birds on the big screen.", "Title": "Coby is the best!", "Date": "August 10, 2013"}, {"Author": "Martin E. McDonald", "ReviewID": "R3W1VNCB9Y3FCW", "Overall": "5.0", "Content": "I seldom write reviews but this is worth it. I've had it for 3 months. The tablet boots quickly. All apps I've chosen so far work as advertised and start instantly. Switching between apps is easy. I often run 2 or 3 apps simultaneously and have noticed no sluggishness.The tablet seems sturdy enough, though I am a careful user. All in all I'd recommend it to anyone. It is Google apps certified so choice of apps is excellent.", "Title": "Worth the $200 I paid.", "Date": "August 9, 2013"}, {"Author": "Jessica B.", "ReviewID": "R24TS5EOKX3YZM", "Overall": "5.0", "Content": "I love the product. This is comparable to the iPad. I can get more stuff done on this tablet & the battery life is great.", "Title": "Great Value", "Date": "August 9, 2013"}, {"Author": "L. Mongreig \"stepdad\"", "ReviewID": "R3JPCD6OCHRRR0", "Overall": "4.0", "Content": "First of all, I am no expert on tablets and this is the first one I've ever owned.  I bought this tablet to use as a source of music storage to run into a PA system for a public event sponsored by our local civic group.  After playing around with the unit for a while, I fell in love with the ability to sit in my recliner in front of the TV and use the Wi-Fi from our internet provider to access searches and other things that occur to me on the spur of the moment.  My only complaints are the screen is awfully small to perform some functions without zooming in on areas of the screen (which is not the fault of the unit, just buy a bigger tablet.)  and some areas of the touch screen (the edges) seem to be a little insensitive when trying to \"X\" out of a webpage. All things considered, I'd Buy it again.", "Title": "Great little tablet for the money.", "Date": "August 9, 2013"}, {"Author": "Karen Edwards", "ReviewID": "RXD5SW7A010EY", "Overall": "5.0", "Content": "I actually bought this for my daughter whose 6 years old and she loves it.  Everything about this tablet is great so far.  It my first so its the best for me right now.", "Title": "Love my first tablet", "Date": "August 7, 2013"}, {"Author": "Ann R Shelton", "ReviewID": "RKZHPFPHUNR2G", "Overall": "5.0", "Content": "Bought this for my daughter to take in her purse to class for notes.  Works great for meetings or class.", "Title": "Great product, great price", "Date": "July 27, 2013"}, {"Author": "ERIK HELMIS", "ReviewID": "R2IFZ4M0V5HCP1", "Overall": "5.0", "Content": "I can truly say that I agree with the tablet, comfortable, lightweight and really is a good use for what I need. Good buy.", "Title": "DESIRED TEAM", "Date": "July 25, 2013"}, {"Author": "S. Wilson \"rapidfuse\"", "ReviewID": "R2R52OIXJFWDO5", "Overall": "5.0", "Content": "Came sooner than expected, was packaged perfectly with everything that was stated. It looks like it's brand new =) This was a birthday gift that made my niece freak out =) lol. They also sent some cleaning clothes and a sleeve along with it. Thank You", "Title": "Purchased for a family member", "Date": "July 24, 2013"}, {"Author": "Pete Thomas \"Pete\"", "ReviewID": "R2124EPS3UKCRN", "Overall": "3.0", "Content": "The Coby worked well overall.  It was fast, connected to wireless with no issues and was responsive to our touch.  However, I returned it the day after I received it.There was a small bright, starlike dot on the side of the screen.  It appeared as if something had pushed up from the back of the tablet, creating this point of light.  It was only visible when certain colors were displayed on the screen.I found, when I pushed lightly on the back of this tablet, I could brighten the screen in that spot on the front.  I think there is not enough protection between the back of the Coby tablet and the front screen.  If the tablet was poked hard (like I think mine was during shipping or manufacturing), a permanent light point will develop on the screen.For $100, this seemed to be the best tablet Amazon offered.  However, we decided to pay $70 more and get the Samsung Tab 2.  This has been a much better product for us (better construction being the biggest difference).", "Title": "Best $100 tablet, but in different league from next tablet tier", "Date": "July 14, 2013"}, {"Author": "Bdera", "ReviewID": "ROT194RCVRXPR", "Overall": "5.0", "Content": "The Coby has wonderful apps.  It is easy to use with a gentle touch.  The camera is okay, but I really didn't buy it for the camera.  I use it for internet and Kindle.  The only problem I had was finding a folding case for it.  After trying several, I found out that there is no case for the 1065.  You have to order a case for a Coby 1045 and it fits perfectly.", "Title": "Love the Coby 1065", "Date": "July 8, 2013"}, {"Author": "Timothy Z. Jensen", "ReviewID": "R3NBGMBIH0R3W1", "Overall": "4.0", "Content": "It does the job. No frills. Not the most powerful, and the wifi is somewhat short range compared to higher end tablets. Battery life is good.", "Title": "it does the job", "Date": "July 8, 2013"}, {"Author": "ringing", "ReviewID": "R38SWYE0SNLMQD", "Overall": "5.0", "Content": "Awesome deal! It works great, speakers are kinda quiet but head phones work great with it. Very happy with the price as well.", "Title": "awesome!", "Date": "July 2, 2013"}, {"Author": "steven shinnick", "ReviewID": "R1R4ARX14DLCG3", "Overall": "4.0", "Content": "Pro: everything for the price, it's a steal.Con: no rear camera.Great for kids, easy to use, long battery life. (About 5 hours on wifi non stop use)", "Title": "Can't go wrong with it", "Date": "June 30, 2013"}, {"Author": "Juantonamo", "ReviewID": "RN76VZHAXPHY5", "Overall": "5.0", "Content": "I was pleasantly surprised at the quality of this unit....I did not realize it was Bluetooth capable so that was a very we'll come bonus.  I have connected it to hot spots, other BT devices, downloaded several play store apps and ebooks and more...it has yet to fell me.  It hasn't been herd long but i must say, it is a great product at a great price with a lot of versatility...if it holds up for a year or two it will have been well worth it....", "Title": "Exceeded Expectations!", "Date": "June 29, 2013"}, {"Author": "Hector Reinefeld F \"hector\"", "ReviewID": "R2O3NEZFXINNO", "Overall": "5.0", "Content": "I bought this to replace another 7-inch android tablet that broke when it was sat on. That tablet had no brand name, and I had identified a few things I would improve about it if I were to replace it. I did not anticipate having to replace it when I did, but the list of requirements did enable me to narrow down my tablet choices significantly.", "Title": "coby tablet", "Date": "June 28, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2ZCUJE3F750V1", "Overall": "4.0", "Content": "Got it for our daughter to replace defective Meep.  It worked right out of the box, no updates required.  The battery life is a little short but it works great overall.  I thought it came with a flash player but so far have not be able to go on any flash player web sites.  That is the only disappointing thing since my daughter likes a lot of online game websites that are flash based.  Otherwise a great tablet for the money!", "Title": "Worked right out of the box", "Date": "June 23, 2013"}, {"Author": "Bronfi", "ReviewID": "R38LIYRNVG7PG3", "Overall": "4.0", "Content": "I can't expect so much about this cheaper tablet. Just help me to check my e-mails. Watch a video... The display quality... enought", "Title": "For the price...Excellent", "Date": "June 22, 2013"}, {"Author": "Robert", "ReviewID": "R2YAODX2NZVN92", "Overall": "3.0", "Content": "Fast response and good video. The battery life was better than most of the same ma. The factory default puts everything back to original condition.", "Title": "Nice product", "Date": "June 16, 2013"}, {"Author": "Carrie", "ReviewID": "RRJ141F6MDW32", "Overall": "5.0", "Content": "This is my first tablet and I love it! The free games seem to self destruct from the app store after a while. What is up with that?My son loves it even though it was a mothers day gift from my hub. It is easy, and the color is nice a clear.", "Title": "If I can get away from my son", "Date": "June 15, 2013"}, {"Author": "Data Pro", "ReviewID": "R1YMAIQUJP6SVO", "Overall": "4.0", "Content": "Pros: Price, performance.Cons: Only one camera.  You can do video chat, but not take pictures of other people.  Can't expect that for this price though.  I only gave 4 stars due to the proprietary power connection.  A USB power connection would have gotten the fifth and final star.", "Title": "Great value and performance!", "Date": "June 14, 2013"}, {"Author": "David Catillo", "ReviewID": "R2VF67145P7IR3", "Overall": "5.0", "Content": "Love it can get all the apps i want. From books to games movies tv shows etc. Fast and responsive.", "Title": "Nice tablet", "Date": "June 13, 2013"}, {"Author": "Orangeblossom", "ReviewID": "R39BX40AJ7GM7D", "Overall": "4.0", "Content": "Got it for my wife, she digs it.  Me... I think it's a solid little guy, fast and does all that one expects from an Android tablet.My one issue is the screen has a bluish cast to it.  The wife doesn't mind it - she actually didn't/doesn't notice it... but me, I see blue.  I'm using an old Nook color and I don't see blue. My old Samsung Captivate... no blue. Our laptops, desktops, television... nada bit of blue.  The Korby... a slight blue cast.But... she likes it, it's fully loaded and does what a tablet is supposed to do, so I guess I won't be returning it for a replacement.There you have it.", "Title": "Nice, inexpensive tablet.", "Date": "June 10, 2013"}, {"Author": "honestreviews", "ReviewID": "R1R4P7FCWBUE0D", "Overall": "4.0", "Content": "The Coby is an affordable mini-tablet that's great for the price.The wifi can be iffy when you're using it on public hotspots with weak or far away signals (my laptop and phone can pick up on the same signals, but the Coby cannot or frequently drops it).Video plays well, as long as you have a strong wifi signal.Apps are on Google Play, so you have a wide variety of apps to choose from.Highly recommend.", "Title": "Perfect for Web Surfing, Videos and Music", "Date": "June 9, 2013"}, {"Author": "KLK", "ReviewID": "RAQR7TPE1QOTC", "Overall": "5.0", "Content": "My son tried to talk me into buying a tablet because I read so much and my eyes are getting old and it is harder to see the small print in paperback books.  I thought these where mostly for the young people. I am 60 and I love this tablet.  Love to get free books on the kindle.  Love that you can increase the letter size to huge letters.  I am so happy with this tablet, I should have gotten one long ago.  Got my son one too and he said this one is really a good one. He has had them before but not as good as this one.great product.  Got it before the price went up.", "Title": "Good Tablet for Old Lady", "Date": "May 22, 2013"}, {"Author": "S. Karl Moldrem", "ReviewID": "R3VBAYDQLAMAO6", "Overall": "4.0", "Content": "Works great fantastic reader, Email read Dr, and substitute For my Desktop that died.  The onlydrawback is the battery  that only lasts about five Hours", "Title": "Great tablet", "Date": "May 19, 2013"}, {"Author": "Warren L. White", "ReviewID": "RM2104Q7MTBJ1", "Overall": "4.0", "Content": "The features and function are OUTSTANDING!  I only have one gripe...the battery.  I wish the battery lasted a little longer but the good news is that this tablet will charge off the USB port when plugged into an AC adaptor so no worries even if I'm on the road.", "Title": "I really like the Coby 7 inch tablet", "Date": "May 11, 2013"}, {"Author": "Roberto Ayala \"WEEPA\"", "ReviewID": "R2IKZQM9NNSHLZ", "Overall": "4.0", "Content": "Great look, speed and features. Battery is questionable buy is does hold for a few hours! In all a great device for the price :)", "Title": "... My wife is pleased, then I am pleased!", "Date": "May 9, 2013"}, {"Author": "Traci McDermott", "ReviewID": "R26ATQE5IHZF50", "Overall": "1.0", "Content": "The tablet stop working properly after several months.  Coby gave instructions to send in for warranty repair.  I had to pay shipping as well as provide a $20 money order for return shipping.  I never received the tablet back. Coby has been bought out by Gordon Brothers Group.  Gordon Brothers say they assume no liability for Coby warranties, including those that had already been sent in. Many people are out tablets and the money they sent in.  Do not take a chance with Coby products!", "Title": "Do Not Purchase - Company out of Business", "Date": "May 9, 2013"}, {"Author": "Gaby Pienk", "ReviewID": "R2KVPMDUXAIPHT", "Overall": "5.0", "Content": "I bought this for my 9 year old daughter. Everything works just fine. Games run at good speed. No complains at all. I will definitively buy one for myself.", "Title": "perfect tablet", "Date": "May 7, 2013"}, {"Author": "Enchanted  In  Dixie \"Enchanted\"", "ReviewID": "R21EJ8O18X8XMZ", "Overall": "3.0", "Content": "Economical little touch screen tablet for those on a budget. Does most of what my son's Ipad does.Can be used easily to read and reply to email, read kindle books, do eBay or check on your internte activities like your Amazon activity.The touch is smooth with a clear presentation. The finger touch reactions are quick, this did present a problem when I tried to do hotmail. It is so reactive I could not geth wher I wanted to go.A plus is on the right of the address bar is a little microphone. You tap then say wher eyou want to go or whta you wnat to look up. I voice codes it and pullsup the internet window. This is so cool.The Wi-Fi connects quickly. Love the andriod with Bluetooth built in.What you get in the box.Colby 7-inch andriod tabletInstructors manual in three languagesChargerUSB cordPouch for the tabletand registrations cardscons:reactive touch to sensitive.no charging light ( have to wake tablet to check)only 1 built in microphone(if you want the stereo effect then you will need to use blue tooth or other headphones / earbuds)My sons says this is not rooted.", "Title": "Economical little touch screen tablet for those on a budget. Does most of what my son's Ipad does.,", "Date": "May 4, 2013"}, {"Author": "Christopher Barrett \"Evil Corgi\"", "ReviewID": "R1ZJQO8XB077GG", "Overall": "4.0", "Content": "I do admit that I am comparing this side by side to the Asus Google Nexus 7.  So it's not quite a fair comparison.  But I take the price into consideration.  But I will put one or two little impressions and update this review as time goes by.First, the screen is not as clear or bright as the Nexus 7 or other high end tablets.  The screen appears a bit dark, but has nothing to do with brightness or contrast.  I think it is the touch point sensors.  It reminds me of the first generation Kindle tablets with color.Function wise, it's pretty decent.  Kindle (app) is the most common thing I use.  But it is Android, so you can sync up all your Google items and put the apps on this as you would the other Google devices.  You can also sync your Amazon account so you can load up your Kindle purchases and have them on multiple platforms (I have five devices synced to my Amazon Kindle account currently).Of note: like most Android 4.0+ tablets, you can't play Amazon Instant videos without some major tweaking (like downloading Firefox and then downloading an older version of Flash player - and still having issues with clarity and streaming quality - and seriously, most folks just want to click and play - not bother with an hour of trying alternate methods of compatibility).  But for standard web browsing it works as fast as the Nexus 7 for most web sites.  You can download other browsers via Google Play - such as Boat, Opera, or Firefox.  But Chrome is just fine.So far in my opinion, this is merely a good 7\" tablet that is better than a phone for reading, but falls short compared to the $179+ tablets such as the Kindle Fire and Nexus 7.  I'm not even going to compare to the iPad.  But I think paying the extra $50 for the Kindle Fire 7\" is recommended.  If Amazon Instant Videos are important, then definitely look at the various Kindle tablets.Kindle Fire 7\", LCD Display, Wi-Fi, 8 GB - Includes Special Offers w/offers for $159 w/o ads for $174.Google Nexus 7 can be found cheaper on Staples website (where I bought mine) with free shipping and no sales tax if you live in a sales tax free state like I do.  (Google tried to charge sales tax and shipping when I tried to buy from them).Both of the above are better tablets and I think a much more solid choice if you can spare the extra $50 - $75.  If not, the Coby is a decent e-Reader tablet for the price, just don't expect the quality, longevity, and service of the better brands.Update:One thing I noticed: battery life on the Nexus is far better than this tablet.And one positive?  Expandable memory.  Up to 32 GB apparently.  Definitely trumps the Nexus and the iPad on that front.", "Title": "A good value, entry level tablet ~", "Date": "May 1, 2013"}, {"Author": "M. Hayes", "ReviewID": "R6B6SNCDRQKSJ", "Overall": "1.0", "Content": "I purchased this for my daughter to take with her on her trip from California to South Carolina so she could play games that she likes.  (she has down syndrome and is limited)  Anyway, it seemed great at first... After I charged it the first time the battery life was less than 25 minutes... Charged it again thinking it was a fluke.... No fluke.  Horrible battery life.. Very disappointed as it was too late to get her another one before her trip.  I am returning it asap and purchasing her one from Costco that has a warranty....", "Title": "Horrible battery life", "Date": "June 11, 2013"}, {"Author": "Kwok Y.", "ReviewID": "R2F4MGRNM1FWE4", "Overall": "1.0", "Content": "It was my b-day gift, but only last for 2 months. Out of a sudden the screen gone white, (we don;t use it frequently) it is totally waste of money!Will not trust this brand anymore.", "Title": "Out of order quickly, not worth it", "Date": "September 8, 2013"}, {"Author": "Marsha J. Vahey", "ReviewID": "R2ECF0LEL6SYQZ", "Overall": "5.0", "Content": "Tablet was a gift for my son in law. He is very happy with it. Works great. Great deal for the money.", "Title": "Gift", "Date": "August 22, 2013"}, {"Author": "Mark Pulver \"midiwall\"", "ReviewID": "RK12XDN36597I", "Overall": "5.0", "Content": "I was skeptical about buying this, but the power of the Amazon review (and Amazon's awesome return policies) got me to give it a try. I'm VERY glad I did. Awesome little tablet.I bought this for my disabled stepson so that he can keep in contact with family via Skype and watch Netflix, YouTube, etc. We first got a Kindle Fire, but Skype on it was a _nightmare_, probably because of the special \"Skype for Fire\" software version. This tablet has wide open access to the Play store - perfect!The only downside is that you have to assume that the OS will never be updated. But, it works fine as-is and we're all thrilled.If you're looking for a cover for this, I took the advice of another reviewer here and bought this one Poetic Slimbook Case for Coby Kyros MID1045 10.1-Inch Tablet(Support Auto Sleep/Wake Function)(3 Year Manufacturer Warranty From Poetic). Works great!", "Title": "Impressive!", "Date": "July 11, 2013"}, {"Author": "Matthew R Downs", "ReviewID": "RXWJVX7BQ7FLW", "Overall": "4.0", "Content": "So I bought my first tablet...and this was on sale for a great price and had ALMOST everyone I wanted. It runs great, very responsive and everything looks great on it. My only problem is the fact it freezes up from time to time and can be very frustrating. But Im still very happy with this especially for what I paid.", "Title": "Good Starting Tablet", "Date": "July 9, 2013"}, {"Author": "papop1", "ReviewID": "RS5F1I24LNZ1K", "Overall": "5.0", "Content": "this is a great tablet if you are looking for 1 don't be afraid to buy 1 and the seller is great to deal with papop1", "Title": "Coby 7-Inch Android 4.0 8 GB Internet Tablet 16:9 Capacitive Multi-Touch...", "Date": "June 23, 2013"}, {"Author": "Jonathan E. Reid", "ReviewID": "R1YJEN94LFRSWC", "Overall": "4.0", "Content": "Overall, I am pretty impressed with this tablet.  I currently use an Samsung Galaxy Tab 2 10.1, and this Coby easily matches it in speed.  The case is plastic, and does not have a lot of heft; it won't feel like a $400 tablet because it isn't.The WiFi has a habit of disconnecting upon screen sleep, and it is very sensitive to signal strength variations where it loses patience and quickly disassociates with the AP instead of being aggressive with negotiating another speed or channel.  Having said that, there are several apps out there that can provide more control over the WiFi configuration and remove the frustration.The screen has a very limited viewing angle.  Good for privacy, not good for minor variations in tilt when using and reading.  Brightness is adequate.  Contrast is barely adequate.Having said all of this, it is a great value.  Get a padded protective cover, and you're in business with a capable, fast machine.  I'd purchase again.", "Title": "Fast, but quirky.  Disappointing display.", "Date": "May 30, 2013"}, {"Author": "Joseph M. Schartman", "ReviewID": "R3S0LLDF3GMT9O", "Overall": "5.0", "Content": "For $120 (What I paid for it) It is an awesome tablet. I would recommend it to anyone looking for a budget tablet. It is by no means as good as the Google Nexus, but if you're on a budget and can't afford a Nexus or even an iPad, buy this tablet. I purchased to use the blutooth capabiiity with a vehicle ODB dongle and it serves this purpose very well along with being a nice house tablet.", "Title": "Best tablet for the price", "Date": "May 28, 2013"}, {"Author": "Jessica", "ReviewID": "R3PQZ2AWBLYBB4", "Overall": "4.0", "Content": "I really wanted a Samsung tablet but was on a tight budget. I found the coby and started researching what it had and found it had a lot of the same details as a Samsung. When the item arrived I instantly turned it on and started using it. It was so simply and had Google play store preinstalled and was able to download all my favorite Alps. Netflix, Plauge Inc., and was able to upload my movie collection.This tablet is super light weight and as duel back speakers which was very exciting since the iPad and other tablets only had one speaker. The touch screen works great without having to jab too hard. Internet runs fast. And charges very quickly as wwell.At work, eight hour day, I was able to play a few games and watch movies almost constantly throughout my day and still had 30% battery remaining when I got home.Only bad thing I've run across is that if I gave been playing.it all day and still use it when I get home sometimes.it won't turn back on until its charged or gets stuck in \"sleep\" mode and wont turn on till its plugged in. Its only happened twice and I've had it two months already. Other thing is that there are NO cases for this and I'm worried it will get damaged.Great tablet! Planning on buying my husband one for Christmas :)", "Title": "wanted a samsung but got a coby", "Date": "May 18, 2013"}, {"Author": "D. Buckner", "ReviewID": "R1QMO6LBHWHXUD", "Overall": "1.0", "Content": "I was hopeful. The screen is iffy and a little getting used to as it's not that great of quality but you can get used to it. Sorta like the old LCD screens where you can see the blur at certain angles.However, the specs were impressive and the performance was great. HDMI works good, and it makes a great movie player. Responsive, lots of built-in space, never got around to adding a microSD card. Overall, for the money, this is a great tablet.Alas, after two days of gentle care, but heavy use, suddenly it smelled of burning electronics, and died. No reset, no hope. I had to RMA it to amazon. I have to give the unit 1 star because I question the QC of the company and the reliability of the unit.", "Title": "Had all the Specs and Performance, but burned up.", "Date": "May 11, 2013"}, {"Author": "Nita Gombakomba", "ReviewID": "R5OXPS7NKW2R5", "Overall": "2.0", "Content": "Ok. So my only problem with the tablet was that after it arrived, I used it for just a few hours and then the screen went fuzzy. I couldn't see or do anything with it. And it's the day before Mother's day, for goodness sake! I bought it for my mom and was going to give it to her but after I get my refund from the return I'll buy her a Samsung Galaxy Tab 2. If the Coby ever works for anyone, great, because it is a good price. But, you get what you pay for, I guess.", "Title": "Absolute crap!", "Date": "May 11, 2013"}, {"Author": "Ted S.", "ReviewID": "R30Y5A50NTELOK", "Overall": "3.0", "Content": "Way too many apps at the Google Play Store are listed as incompatible with this device. 3 of 4 photography apps I wanted to use (including Easy Release) are incompatible. Sideloaded a couple that are OK on my phone and attempted to run them on this. FAIL.If you only want to use the installed apps and 30% of the apps available from the play store this is a fair tablet. Think I will return it and spend more money for something better.", "Title": "OK and good price ... BUT", "Date": "May 8, 2013"}, {"Author": "Tim Langley", "ReviewID": "R1ON1GM4DP1XPJ", "Overall": "1.0", "Content": "First let me say we own several Coby items without problem; however, this was the worse thing we have ever purchases from Amazon and considering to never shop here again.  This tablet was what my 12 year old daughter purchased with her birthday money. Within a few days the speakers began to work intermittently  Then a few days later the power button no longer worked. Both my wife and I have tried to contact Coby regarding these issues several times without response.  Their toll free number refers you to their website where no replies.  The order was fulfilled by Amazon so we tried that avenue next.  Still waiting to hear from them, it has been over a month.  I really expected more from Amazon.  We have recommended Coby products to friends and family in the past but our dissatisfaction with their service determined we will never purchase or recommend them in the future.", "Title": "Not happy with product and their service is ever worse", "Date": "September 21, 2013"}, {"Author": "Lawonda Favors", "ReviewID": "R3RPPMXHHJ9BR3", "Overall": "1.0", "Content": "They got me but never again! From the time i first got it to this day (4 months later) it constantly froze and reset itself. after ever 30 resets it deletes everything!!! The sound is terrible, the speakers would work sometimes and other time you're SOL. DO NOT BUY!!! save your money.", "Title": "TOTAL WASTE OF MONEY", "Date": "September 12, 2013"}, {"Author": "robert v.", "ReviewID": "R1MMG8U3Z5DFH1", "Overall": "1.0", "Content": "Very cheaply made, with hard to use software and 2 tablets froze and would not power up with in 3 days of purchase.  Save yourself the hassle and buy a better tablet.", "Title": "terrible", "Date": "July 8, 2013"}, {"Author": "BigBill \"Bill Connell\"", "ReviewID": "R1R782A90CGC9Z", "Overall": "3.0", "Content": "Its way faster and 3 ounces lighter, and the OS is jelly bean instead of ICS that came with the coby.", "Title": "Just replaced it with an 8\" NextBook from Walmart for $99.00", "Date": "June 5, 2013"}, {"Author": "Erika Mitchell", "ReviewID": "R3TC0N23BJIS9A", "Overall": "4.0", "Content": "This is a 7\" tablet computer with a touch screen. It comes with 8Gb memory and the Android operating system. It has ports for headphones, HDMI video connection, and micro USB. It will also take a micro SD chip for an additional 32 Gb of storage. It has a built-in speaker, microphone, and front facing camera, as well as BlueTooth, WiFi, and GPS connectivity. Preloaded software includes Kindle, Chrome, Gmail, Maps, YouTube, CloudLink, and OfficeSuite. Also included in the box are a charger, a micro SD cable, and a paper manual.This is a very affordable device for portable computing. With it, you can check your email, keep up with FaceBook, surf the net, and read e-books, all on a device that is the size of a small book. You can watch Netflix movies on the tablet directly, or connect it via an HDMI cable (not included) to watch movies on the bigger screen of a TV or projector. You can also use it in place of a GPS unit for navigation. Although typing directly on the screen can be tedious, paired with a Bluetooth keyboard (sold separately), this is a fabulously portable device for note taking using the included OfficeSuite software. The front facing camera can be used with Skype for video calls and messaging.I got this tablet for my husband, who likes to read books on a Kindle, but doesn't like having to use a book light in a dark room (his Kindle is not backlit). With the backlit screen on this tablet, he can now read his books quite easily in low light. The 8Gb of onboard memory is twice what I got on my Samsung Galaxy Tab 2 8 months ago. The HDMI and micro USB ports both provide additional capabilities that my Samsung tablet doesn't have. (Note that if you want to plug in a USB flash drive, you will need an on-the-go cable adaptor, sold separately; this device does not have a port for a direct connection to a USB flash drive). Another valuable plus of the Coby over the Samsung is the paper manual--it has actual directions of how to get started using the device and interacting with Android. If you've never used an Android device or smart phone before, you can spend hours of frustration trying to learn how to do the simplest tasks. The manual that ships with this device is concise and quite clear and provides an informative introduction to Android basics. In comparison, the tiny brochure that shipped with the Samsung in place of a manual was simply horrid. Overall, it is clear that the folks at Coby put a lot of thought into making the design of this tablet as user-friendly as possible.Still, the Coby tablet is a lot cheaper than the Samsung; to get the price point so low, they had to cut corners. To begin with, the screen is rather low quality, and has a very blue cast to it. You can see this clearly on Kindle book pages, which should be on a white background, but instead the background appears light blue. Photographs and any other images are also affected by the blue cast. Image quality drops dramatically if you look at the screen from a slant rather than straight on. I tried a side-by-side battery test with my Samsung, which has had heavy use and hundreds of charge cycles over 7 months. I charged the batteries on both devices to 100%, then opened Kindle. After 4 hours on battery mode showing a book page, the Samsung tablet said there was 41% battery charge remaining, compared to the Coby's 28%. The Samsung tablet isn't known for the quality of its cameras, with its rear-facing camera only offering 4 megapixels, one of the lowest quality cameras on the smartphone/tablet market. But the Coby doesn't even have a rear facing camera, and if you try to download Instagram on the Coby, you can't because it doesn't meet the minimum requirements for Instagram. And of course, taking anything other than self portraits with a front facing camera is virtually impossible, so don't buy this tablet as a photographic device. I also found the WiFi receptivity to be a little weaker on the Coby compared to the Samsung. On the other hand, I found the design of the Coby on-screen keyboard to be easier to use than Samsung's on-screen keyboard.Overall, this Coby tablet is a very affordable device for entering the ultra-portable computer world. Compared to similar devices on the market, it comes with great documentation and extremely thoughtful design. For instance, the inclusion of HDMI and micro USB ports are a great plus. However, at this price, don't expect miracles; the device is quite functional, but when it comes to traits like screen quality and battery life, this device doesn't measure up to some of the more expensive options on the market.", "Title": "Very Blue Screen", "Date": "April 27, 2013"}, {"Author": "kady", "ReviewID": "R1QZP60RIPIZNX", "Overall": "3.0", "Content": "I really like this tablet, it is not bad, but some of the apps I want are not compatible and maybe I am not doing something right but my oovoo isn't working well either but skype works just fine. I wanted to install the app for my bank and it's not compatible, which sucks. but other than that, it works great, and the apps that are able to install works just fine...", "Title": "Not bad at all", "Date": "April 21, 2013"}, {"Author": "gkohlhepp", "ReviewID": "R2AHY3HY15TB2", "Overall": "1.0", "Content": "I plugged the HDMI cable into the tablet and it shorted out the battery.  Until that point, I thought it was a great tablet.  Amazon was awesome and sent me a new one in less than 3 days.  So far, so good with that one.  However, I'm reluctant to try the HDMI cable again for fear of shorting out the battery again.  My only other gripe is that United Airline app is not compatible with Coby's tablet.  They really need to look into these things.I revised this review to 2 stars.  It will not download movies from Google \"Play Movies and Videos\" app.  When I try to download a movie I get an error 43 message (couldn't fetch license).  I will gladly give it more stars if someone can help fix this error.Now revised to 1 star.  Sent an email to Google regarding downloads to this tablet.  Their response was that this Coby is not compatible with Google downloads and I would have to watch movies on my laptop.  Going to try to return it and get a refund.Gary", "Title": "Battery Died in Less Than a Month", "Date": "May 27, 2013"}, {"Author": "Ru-slavic", "ReviewID": "R2FFTEYKLPA17M", "Overall": "1.0", "Content": "Loved it when i got it, but just stopped working in 3 days. maybe after 6 hours of use. Read about this product, a lot of people have same problem and get scammed if try to send in for warranty service, have to pay for shipping and never will see the pad or money back. Customer service non existent, not online or phone. I'm \"lucky\" that it broke right of the way, other people had i working till day 31 and could not return to amazon. I think you should stay away.", "Title": "not good", "Date": "August 29, 2013"}, {"Author": "Tiels", "ReviewID": "R16YTQS0U9FY63", "Overall": "5.0", "Content": "I am well pleased with this little tablet!  It's fun and easy to use.  Not real crazy about doing email on it, but surfing is great!  Being a bit older it's wonderful to have  ~Ahem~  larger print by tapping or spreading.  Since this is my first tablet, I guess the battery life is OK. I know it charges quickly.OK! OK!  I admit, I like Ghost Radar Classic and this tablet handels it well, but it does use the battery kind of fast.All in all I'd recommend a \"Coby\" Android Ice Cream Sandwhich 4.0 tablet for a starter/learner tablet.  Can't hardly find a way to mess it up!  I company I purchased this tablet from was quick with shipping and it was packaged well.  Everything to the tablet was there even the owners manuel.  Very well pleased!Tiels", "Title": "Coby 7\" Android Tablet", "Date": "July 28, 2013"}, {"Author": "angela", "ReviewID": "R26JYIJ2W6UCVE", "Overall": "4.0", "Content": "I was looking for something cheap and also good and I should have bought samsung galaxy tab instead of this.", "Title": "good item", "Date": "July 8, 2013"}, {"Author": "Charles Hennen", "ReviewID": "R21TGSEZ5S5MA", "Overall": "4.0", "Content": "Just getting into using the tablet. My first. Price was fine for a first tablet, and well see if it does what I expect as I go.", "Title": "Coby Tablet", "Date": "June 19, 2013"}, {"Author": "Chermaine Y. Strong", "ReviewID": "R3075RFSS3H46", "Overall": "4.0", "Content": "I wanted something small and convenient for travel and for play. This was the perfect item for me however, I am not impressed with the camera feature. It is a oneway, front camera only and just not practical. That's the only thing that will cause me not to give this product a perfect rating.", "Title": "Convenient", "Date": "May 3, 2013"}, {"Author": "Constance Rosengren", "ReviewID": "RK6UBRCFT405E", "Overall": "3.0", "Content": "I was excited to start using the Coby  Android. unfortunately  I still haven't figured it out. Granted I'm not very computer wise but,I put it away and pulled it out when my grandson came over. He plays his games on it and that's good enough for me", "Title": "Coby Android", "Date": "June 5, 2013"}, {"Author": "Mariano C. Penaflorida", "ReviewID": "R17V9UTAW62V2H", "Overall": "2.0", "Content": "The product says it is an 8gb but when i look at the usage it has only 4gb with 2gb used.  And it has no back facing camera!", "Title": "Internal memory and camera", "Date": "May 31, 2013"}, {"Author": "Juan", "ReviewID": "RFF4LMLXQ2TLC", "Overall": "4.0", "Content": "very useful for a first tablet and for a very cheap price. not so much memory but a card will be o.k. and good grafics and mini hdmi", "Title": "That'll do", "Date": "April 24, 2013"}, {"Author": "Rama Chandu", "ReviewID": "R2BO637SUDR7OM", "Overall": "1.0", "Content": "This is the worst tablet I've ever purchased. I wanted a tablet for regular usage and developing Android applications. It doesn't work for both of them. I would never suggest someone to try/ buy/ gift this tablet.Pros----- 1. It's comparatively cheap. 2. Delivery is fastCons---- 1. WiFi turns off every time you turn off the screen. There is no solution for this problem. Google \"Coby 7065 wifi turns off after screen lock\" and you'll find several sufferers 2. For developers: You can't deploy applications to Coby, there are no drivers, None of the 3rd party software don't specifically work for this. 3. Screen quality is cheap, Camera is worse", "Title": "WORST TABLET - for developers and regular users", "Date": "June 4, 2013"}, {"Author": "Pen Name", "ReviewID": "R3QDC53I03LYNH", "Overall": "1.0", "Content": "So this tablet lasted me exactly 3 months now the screen starts flashing and then just blanks out. Pay 60 or 70 more for a galaxy or you will regret it.", "Title": "dont buy", "Date": "July 14, 2013"}, {"Author": "Shelon Knox", "ReviewID": "R2RBQBN3N370DO", "Overall": "2.0", "Content": "You get what you pay for. I bought this for my mother's birthday and I wish I wouldve purchased a different tablet.", "Title": "The Price", "Date": "September 6, 2013"}, {"Author": "Robin -n- Mt", "ReviewID": "R30OI789JA6L01", "Overall": "5.0", "Content": "Coby has won my heart on this one! Screen size is huge & sharp. Pre-loaded with apps. For the price you can't beat this one!", "Title": "Love it!", "Date": "May 2, 2013"}, {"Author": "Note_the_music", "ReviewID": "R2HRPFE6CYK4QV", "Overall": "3.0", "Content": "Pros: fast, functional, great budget tablet. Good resolution, great responsiveness, and some nice features that I've only seen on Coby tablets.Cons: screen is upside down (power button, volume, and camera are all on the lower right, and the volume buttons are backwards (up is volume down, down is volume up), and no, I'm not holding it upside down. Apps that force portrait orientation set it this way, so that means the screen is upside down)And lastly; bloatware. It comes preinstalled with apps that you would like to keep and some that you would like not to. However, the ones that you want to keep need to be updated, and in order to update them you need to uninstall them first. Sadly, this means that all the apps that come installed on the tablet will need to be uninstalled, however none of them can be because Coby forces them to be installed on the system. I really would like to get the updated Kindle app, but I can't have it because Coby already installed an older version...", "Title": "Backwards and bloatware, but functional.", "Date": "April 28, 2013"}, {"Author": "stolan", "ReviewID": "R1LNOJGUA0U554", "Overall": "4.0", "Content": "I have been completely unable to get this device to connect to WIFI with any type of security (WEP, WPA/WPA2). It will only connect completely unsecured. On either WEP or WPA, it continually tries and fails to obtain an IP - after trying for a while, it shows the signal strength as very low, even though it's a solid strong signal initially. I tried setting up a static IP and reserving that IP through the router and the tablet will then show as connected but there is still no access to internet. Checking the router and access point, the device does not show up as connected or in the logs even when the tablet says it's connected, so it's not the equipment. I've emailed Colby for support (no response), done tons of research (this is evidently a common issue with these tablets) and tried every fix I could find. No luck, so back it goes. It was intended for my daughter, but if I can't get it to work with a solid setup and technical knowledge, I can't justify handing it over to a 11 year old who will be upset if she can't make it work at her friend's houses.Update: 5/29/13I wound up buying a new router. The previous one was great, but didn't work with this tablet and didn't have a few other features I wanted. Upgrading the router was still less than buying a mainstream tablet, and once I upgraded, the tablet connected with no problem and has been a solid performer since. The new router was not a D-Link, since my research showed these tablets had problems with that brand of router. Based on how the tablet performed once I got it working, I'm upgrading my rating to a 4 (I don't really feel infrastructure upgrades should be necessary for a tablet purchase, but if I hadn't had this issue it would have been a 5).", "Title": "Known WIFI issues", "Date": "April 26, 2013"}, {"Author": "M. Turner", "ReviewID": "R5UOE2PAM14DN", "Overall": "1.0", "Content": "I am not happy with this item. I purchased it as a gift for my son and it has a serious flaw. On the screen there is this small blue dot which I guess is a problem with the pixels or something. I will try to upload an image.", "Title": "Coby 8-inch GMS Android 4.0 8GB Internet Tablet", "Date": "May 17, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00B2HCLL6", "Features": null, "ImgURL": null, "Name": null}}