{"Reviews": [{"Title": "I would buy another one", "Author": "B. Ahmed \"Nubi 1977\"", "ReviewID": "R1E2QDSMM8EY0X", "Overall": "3.0", "Content": "EDITED REVIEW 08/28/2013The original review was posted a few months back. I just barely started using this tablet again, as the semester approached, to make sure everything I needed was on there. I am not too happy that the tablet has started freezing up quite often. There is not a reset button anywhere if you just want to restart the tablet. You just have to wait it out and it can take anywhere from 15-30 minutes. So I have taken one star off.ORIGINAL REVIEWI am only giving it 4 stars because I have not used it as much. It took 2 weeks for the tablet case (with a built in keyboard) to come in from overseas and I did not want to damage the tablet. I bought this 3 weeks ago to use for school instead of the heavier laptop and even the netbook option. So far I am impressed. It is made of quality exterior and I love it that it has options for word and excel, as well as the pdf file. That means a lot to me since I can type up notes while I am in school. It seems to get the job done. I refused to spend $600 on brand name tablets that would tie me to contracts with a cell phone provider. This tablet easily hooks up to wi-fi and I have deleted a few apps that I did not want. All in all, it seems to be a good deal for the price. It got to me on time. The instruction booklet could certainly use some work as far as language issues, but if you know how to work an Android phone, you will be able to do this with your eyes closed.", "Date": "April 30, 2013"}, {"Title": "Nice...UPDATE 10.28.13...Piece of Crap", "Author": "Nesia", "ReviewID": "R1HE2C8DYSBJFY", "Overall": "1.0", "Content": "Very nice. I bought it as a gift and played with it before hand. I was impressed by the quality for the price I paid. I have another brand, Double Power, that I bought from Walmart and it doesn't compare. I will consider buying another for myself.Update 10.28.13:This tablet was at first \"Nice\". Since March 2013, my son returned it to me and said \" This thing is useless\" and he's absolutely right! I've noticed this tablet will not hold a charge and has very poor battery life. Not to mention it is slow as molasses.  As of recently, it won't power on at all! Save your hard earned money and buy a NOOK HD or something comparable.", "Date": "April 9, 2013"}, {"Title": "Save your money", "Author": "Mama", "ReviewID": "R1IFPFXR3CPEWC", "Overall": "1.0", "Content": "I bought this as a gift for my teen nephew and after checking it out, it's a piece of junk. I use an iPad and so I was not sure what to expect... Dissapointed :(", "Date": "December 18, 2013"}, {"Title": "Not bad for beginners", "Author": "Martin Dejl", "ReviewID": "R1KBYVQ9PK657F", "Overall": "3.0", "Content": "not good for geek's and technology worshippers... Display has low resolution. It's Android, yes. It's ok for reading, surfing, angry birds. If u are not sure what to do with tablet but wanna try, this is not bad test device for the money.", "Date": "June 11, 2013"}, {"Title": "... issues that seems to make this tablet not as good as I read in the reviews", "Author": "Robin L.", "ReviewID": "R3J0DXZ1HUVKZB", "Overall": "2.0", "Content": "This tablet seems to freeze a lot and has issues that seems to make this tablet not as good as I read in the reviews. I would of given it 5 stars but to me this is just not a good tablet. Even to look email is a pain let alone the hassle it is to get things to play. It states it has flash but will not play some videos. Tells me I need to update flash but when I go to update flash it states that it is not compatable with my tablet. Well what is this tablet without flash? As far as doing the things I need it to do this tablet is not worth the money. Going to go to the computer store and invest in a laptop and not mess with a tablet again. I could of bought a laptop for $85 more and had a lot more to offer. I went by what customer service told me and I guess they was wrong about this tablet. Please do your research before buying a tablet.", "Date": "December 12, 2013"}, {"Title": "Very good value for the money", "Author": "Elena Kimball", "ReviewID": "RCSJSDE2V3JP8", "Overall": "5.0", "Content": "I have had this tablet for almost a year now and I have to say that I love it.  Battery life is excellent and it charges fairly quick.  Screen resolution is very vivid and the price can't be beat.", "Date": "March 31, 2014"}, {"Title": "Exactly what I was looking for.", "Author": "Joe Lawson", "ReviewID": "R3T6B58XLAKYQF", "Overall": "5.0", "Content": "It's exactly what I was looking for. It has the same controls and ports as my previous tablet, the 7\" SC-74JB.", "Date": "March 27, 2014"}, {"Title": "I love my tablet", "Author": "Darlene Hohl", "ReviewID": "R1WHS5MD7OTG2V", "Overall": "5.0", "Content": "Completely met my expectations. Great tablet with Bluetooth and several USB options. A low cost tablet with the capabilities of the higher cost products out there.", "Date": "June 23, 2013"}, {"Title": "Cannot recommend it", "Author": "Anna M. Darland", "ReviewID": "RERBM74HW9SS2", "Overall": "1.0", "Content": "Admittedly, have not had the unit very long, but this has absolutely the worst manual I've ever seen.  Might as well have sent it without one.  Also, the unit froze within the first few days.  The only way I overcame the freeze was to let the battery run down and then recharge it.  There is a reset on the unit but that didn't work.  Would never recommend it.Update 11/29/13  After further use of the product have reduced my rating to one star (If I could rate it zero I would).  Simply not happy with this product.", "Date": "November 2, 2013"}, {"Title": "Great value for the price", "Author": "Brittany A. Garrabrant \"shopping lover\"", "ReviewID": "R1645D5JQUJLJE", "Overall": "5.0", "Content": "This is a great ipad for the price. Works great, stays charged, no issues and the screen is nice and big!", "Date": "August 9, 2013"}, {"Title": "For experts only", "Author": "Patricia Toth", "ReviewID": "R12QKZ01ZZYSV9", "Overall": "1.0", "Content": "This is my first tablet, and probably my last. It might be a good, but there's no way I can tell. There were no instructions except for a very tiny booklet. The booklet is written by someone who is trying to write English and failing miserably. If I already knew how to use this tablet, I'd find the instructions funny. However, I don't know how, so the instructions are useless.I've bought a book about Android systems for beginners, and it does't match what I see when trying to apply their instructions to my tablet. All-in-all, I wasted my money.So is the tablet any good? I can't log on or figure out how to do anything on it, so I haven't the faintest idea.", "Date": "August 30, 2013"}, {"Title": "Pretty good for the price.", "Author": "CoC Believer", "ReviewID": "R3KB8S0BG3E3SG", "Overall": "4.0", "Content": "I really enjoy this tablet; not too big, not too small. Screen quality is beautiful, front and rear camera work well. I'm always accidentally taking screen shots, but they're easy enough to delete. Holds most apps I want, but some apps won't load, saying they don't work with this device. No problem, most of my favorites are on it. I love to play with it. Recommended.", "Date": "June 19, 2013"}, {"Title": "need technical assistance", "Author": "Kathy Smith", "ReviewID": "R1F48E3NR3O6HE", "Overall": "1.0", "Content": "Im already having problems with it and i havnt even got the bill yet! there a symbol that look like a glass with a cylinder in it and a triangle with an exclamation point! Could u please tell me what the problem is", "Date": "November 4, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BB9P1GW"}}