{"Reviews": [{"Author": "Mike", "ReviewID": "R17WID8276HM4I", "Overall": "5.0", "Content": "Since I bought my D2 Tab about two months ago I have found it invaluable. It has become my companion. It is as fast as any tablet PC that goes by whatever name. However, the screen resolution is not as crisp as I desire. But for the price, the product gives value for money.", "Title": "As good as any tablet", "Date": "May 10, 2013"}, {"Author": "Shorrie H.", "ReviewID": "R3B6U3NNZTZNNW", "Overall": "5.0", "Content": "I think my 5 year old loves this too much, and we have to limit her time on it.  I've played with it and I like it a lot.  It navigates online fairly quickly and the screen resolution is just fine for a screen of this size.  If you want a little tablet to surf and play casual games or stream Netflix, I think it's a bargain.", "Title": "for the kid", "Date": "April 22, 2013"}, {"Author": "Raven0", "ReviewID": "RH8B9X4OK84VF", "Overall": "5.0", "Content": "I don't have a smart phone, nor need one. I Had no interest in tablets, notebooks, or anything like that. Then I received a check in the mail from a class action law suite I didn't even know I was a part of. As I explored possibilities of what to do with the wind fall, I came across these Tablets. Lots of research convinced me this was a great toy/tool. And it turned out to be a great buy. The Android operating system is better than I ever expected. This tiny computer plays games my PC doesn't, accesses my e-mails, surfs the web, and is so light and small it almost fits in my pocket. Three hours of battery time is OK, though like most people I wish for more. I am very happy with this purchase, Over the years Amazon has been my first choice for online purchases. They know what customer service means. I trust them to always do the right thing if there ever is a problem.", "Title": "WOW What a great little computer", "Date": "April 20, 2013"}, {"Author": "jmarshall1007", "ReviewID": "R215HIYSGXNUR7", "Overall": "1.0", "Content": "Bought the pad 3 weeks ago. Started out great, except for the power cord. It has been positional and now will hardly even charge. Will be returned tomorrow. Camera is front facing only and poor quality. Screen protector came up within a week. I called tech support today, only to be told that their technicians were busy. No return call as of this PM. I love the tablet idea and price. This one was not worth the price. I am glad I can return it and don't have to exchange it for another one of these.", "Title": "Bad product, Poor camera,", "Date": "May 28, 2013"}, {"Author": "bsnydersvc", "ReviewID": "R2MULRF82N7AEL", "Overall": "5.0", "Content": "We bought this as a gift for our 10 year old thinking it would be good for a 1st tablet.  I was amazed at the speed and quality of the picture on this.  If you are looking for a good tablet for watching movies and playing some Android games, at a very low cost, this is the tablet for you.  I would highly recommend this to anyone who has a child ages 8-18.  This is a fantastic buy!!", "Title": "WOW!!!", "Date": "April 12, 2013"}, {"Author": "Steve in CA", "ReviewID": "RR98ABVYKGC6T", "Overall": "5.0", "Content": "Bought this for my wife to fool around with while she's at her beauty salon (they have wireless).  She's had no problems with it and takes it every time.", "Title": "Great", "Date": "April 4, 2014"}, {"Author": "Joseph Guerra Jr", "ReviewID": "R3EGGAMWCOTCX7", "Overall": "1.0", "Content": "I purchased this device in May of 2013. I received it quickly but since it was gift it wasn't actually used until about a month later. I opened the device and verified its functionality, but failed to realize that the separate dc charger did not properly charge the device. Basically, this tablet is great, but the charging system is flawed, and in my case, I can't charge it unless I fiddle with the plug and hold it in place in just the *one* spot where the charger works.TRied to return to amazon, but it's Amazon, so they said no and there is no recourse.. also, since they are amazon, bad feedback doesn't really matter.All in all, great tablet, good price, but make sure the charger works, or you may be screwed.Also, strangely, it cannot charge via USB and requires the separate, proprietary, DC charger to charge the device.", "Title": "Amazon.com sent a faulty product and refused the return", "Date": "January 25, 2014"}, {"Author": "Angelica", "ReviewID": "RYZ3GZGE14WJV", "Overall": "4.0", "Content": "delivered way fast. great buy for the price, quality image, nice size and glad its a square instead of rectangular like some of the other ones. good memory space and ram speed. definitely great if just want it to mess around online and play lil games", "Title": "good buy for price", "Date": "January 11, 2014"}, {"Author": "Tomkat67", "ReviewID": "R357CT6YAURBDA", "Overall": "4.0", "Content": "I bought mine two years ago at Big Lots after my cheap Polaroid tablet crapped out after 3 months. It's had a LOT of use over those 2 years and has been clumsily dropped by myself several times. Very sturdy and scratch resistant apparently-still looks new. I hardly ever switch on my desktop since I got it. It's so much easier to just grab my D2. I'll have found what I'm looking for a lot quicker with the tablet rather than waiting for the PC to boot up. D2 has a standby system so you can leave it running and it hardly uses any battery as long as you have no programs running. With the Full Gig of RAM and the fastest processor I've seen in this class, you'll be amazed at how quick it runs. I like to watch Netflix and Youtube on it when my son has the TV tied up with Xbox. My only gripe is the preinstalled apps don't seem to be removable on this model and I could use the room.", "Title": "Two Years Running", "Date": "December 12, 2013"}, {"Author": "Al,Iowa", "ReviewID": "R30O032P38RPEO", "Overall": "5.0", "Content": "I love the tablet , very easy to use but I'm not sure can I charge it on 220 volt?? We are planning to take it with us on our trip to Europe.", "Title": "Can I chatge this tablet in Europe ??", "Date": "December 1, 2013"}, {"Author": "christopher villapuda", "ReviewID": "R3B7ZAO2SVB8EW", "Overall": "2.0", "Content": "This was the first tablet I ever bought. I cant explain how much I hate it. After a month of using this tablet I must of hit it while I had it in my pocket so the inside started bleeding (my bad), but that is not what i hate about it. What I hate is the fact that a 1 foot fall from my hand to the floor can cause the whole screen to crack and the lighting to flicker uncontrollably. The tablet itself isn't bad but the quality sucks and to get it repaired or by a replacement part is more than its worth.", "Title": "Careful Fragile", "Date": "November 24, 2013"}, {"Author": "Sophany Touch", "ReviewID": "RWI2PK3YKRMAI", "Overall": "3.0", "Content": "One thing that I am disappointed with this product is the speaker, because the sound is so poor. I do not know all this device are them same or only my device?", "Title": "Digital2 D2-721 7-Inch Tablet (Black)", "Date": "October 13, 2013"}, {"Author": "natalie inniss", "ReviewID": "R3AVSVDM96W2PH", "Overall": "3.0", "Content": "I don't like the quality of the speakers, the sounds are barely audible. otherwise the product is good and servers the purpose that I bought it for", "Title": "D2-721 7-inch tablet", "Date": "September 19, 2013"}, {"Author": "kavondale", "ReviewID": "R2KPMD6YXJZGHZ", "Overall": "2.0", "Content": "They warn that if you use a different charging device that it could burn up.  We did not use a different device but it still burnt up.", "Title": "Charging port burnt up in less than 2 months.", "Date": "September 4, 2013"}, {"Author": "Simon Liebman \"Simon L\"", "ReviewID": "R1QRJJGHN34JV0", "Overall": "4.0", "Content": "I purchased this to use as an e-reader, the 4:3 screen looked more like a book to me than the widescreen.  no sooner did I get everything on it I wanted; my wife took it to use for the kids (2 1/2 & 7) to keep them busy in the car.  so far they have been good at taking turns and the battery life is working out well.  it could be improved with USB charging rather than the classic coax plug.The long and short, I took out my microSD card and will put it in the new tablet I had to order when it is delivered next week.", "Title": "Lost it to the kids", "Date": "August 8, 2013"}, {"Author": "Denise Tuttle", "ReviewID": "R25NUFMLJO90YK", "Overall": "3.0", "Content": "It is a OK tablet for the money but the battery does not stay charged for very long.Also it is not capable for downloading apps from the Google store.", "Title": "Review Digital2 7 inch Tablet", "Date": "July 31, 2013"}, {"Author": "Suha", "ReviewID": "R3UBKI2WOYGLL", "Overall": "3.0", "Content": "It is Not bad a bad product product considering its price. however, the one i got had a little dot on the screen which was not removable. It was functioning great without any issue, however, the touch screen is less responsive, i would touch it couple time before apps response.", "Title": "Not bad considering its price", "Date": "July 27, 2013"}, {"Author": "Bibi Razia Seeraj", "ReviewID": "R1OYSUD5MDCVLO", "Overall": "3.0", "Content": "The tablet itself works well. My two year old loves it and it has in turn kept him entertained and away from MY computer. The only problem is the charger doesn't work and the customer service received from Amazon regarding this issue leaves a lot to be desired. I bought two of these tablets and neither charger works, so now I have to pay extra for chargers. I would not recommend buying this tablet from Amazon, however due to the shoddy customer service.", "Title": "Bought for entertaining a very intelligent 2 year old", "Date": "July 16, 2013"}, {"Author": "TEXSNSAI \"TEXSNSAI\"", "ReviewID": "R2M3NMB3ZX9WCR", "Overall": "1.0", "Content": "Do not buy.  I bought this for my daughter.  She was excited at first but very upset when it quit working within weeks of purchase.", "Title": "Do not buy", "Date": "July 15, 2013"}, {"Author": "Kenneth J. Connors", "ReviewID": "R236OXSARGPHX0", "Overall": "5.0", "Content": "easy to use and fast as IPAD and easier to use, it arrived 3 days earlier than expected and I love it, better than my $400 IPAD  , just as fast and easy to use.. great product I will buy 2 more for my kids", "Title": "awesome tablet,", "Date": "June 27, 2013"}, {"Author": "Kathleen", "ReviewID": "RBNIDC8KMDWMN", "Overall": "3.0", "Content": "As a previous Kindle user I expected to have no trouble with this tablet. It's easy to set up, has some valuable apps and is small enough to be pocketbook portable. I like that it syncs with my home computer on Google as well as my phone, giving me information I may need at all times.However, I discovered that although my Kindle books transferred, my games did not; not only that, they are not available. Moreover, my current choices for books and games is extremely limited through app downloads. That is true when I attempt to download from my local library as well. I guess Android has not caught up with Kindle or ipads. They should work on that aspect.", "Title": "my first tablet, a 'trial' for me", "Date": "May 19, 2013"}, {"Author": "Sara Holibaugh", "ReviewID": "R1484HS6DETGNB", "Overall": "4.0", "Content": "I bought this for my boyfriend.  He uses it a lot more than I do, but from my limited use, I would say that I like it....  My only issues with it are:--Speeds are somewhat slow--Speaker is rear facing, so the sound is better with earbuds/headphones--Mini-USB; can't find a tablet stand with a keyboard that has a mini-USBBest used for some net surfing or for using apps.  Can watch stuff on netflix without a problem (other than the previously mentioned rear speaker)My 5 year old nephew loves to play Angry Birds on it, but he's careful, so idk how durable it really is.", "Title": "Great product for the price!!", "Date": "May 14, 2013"}, {"Author": "Michael L. Hutchinson", "ReviewID": "RR20P56WXGRWL", "Overall": "5.0", "Content": "my grandson is so so happy with this product and grandma and grandpa are too.  we like the quality of the product and very satisfied with the service and time arrival we were quoted.  thanks for such great service !", "Title": "android pad", "Date": "May 14, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3P1L38CVDGS56", "Overall": "5.0", "Content": "Works easily, good price, bought it for my husband who is new to working ebooks, tablets, etc. He is able to use it effortlessly.", "Title": "Good for husband", "Date": "May 9, 2013"}, {"Author": "Loopy", "ReviewID": "RP4LU1LCSGU17", "Overall": "5.0", "Content": "we got 2 of these for our boys ages 7 and 10 and they love them, easy to use and download free games.", "Title": "great tablet", "Date": "April 23, 2013"}, {"Author": "W. P. Ricks \"B. Ricks\"", "ReviewID": "R65TOY7A4E7EL", "Overall": "5.0", "Content": "Very good for the cost.  Buy your kids one of these and if they destroy it then it can be replaced at a reasonable price.", "Title": "great quality", "Date": "August 13, 2013"}, {"Author": "missy76049", "ReviewID": "RS6N4HZJU3CTG", "Overall": "2.0", "Content": "Well this tablet seemed like a great deal and it was working fine at first but after a few weeks it won't hold a charge and not doesn't charge at all so we can't use it and its too late to return it", "Title": "not charging", "Date": "April 9, 2013"}, {"Author": "mkc357", "ReviewID": "R1764YBI57KSYU", "Overall": "4.0", "Content": "I purchased 2 of these for my grandkids 5 & 7.. I was amazed at the speed and strength of the wireless. I am a firm believer of you get what you pay for, these surprised me.. It connected as fast and strong at a distance from the router as my galaxy2. They also are pretty well designed and built. I have high confidence in them lasting. I will edit my review if anything changes", "Title": "Cheap suprise and works well", "Date": "March 19, 2013"}, {"Author": "EABFW", "ReviewID": "R2VN1STDU986F0", "Overall": "5.0", "Content": "I bought this for my 3 years old daughter, because she broke 2 ipad tablets. I decided it to shop around and purchased a cheaper product for her, so I don't worry if she will break the third tablet.  I bought 2 iView 7\", but returned all, one with screen broken, another one dual camera wasn't working. My sister-in-law actually purchased D2 9\" for her 7 years old son,  she told me to consider D2 7\", so I bought this one for my daughter since I couldn't find a pink color.  She likes it when I play the mommy bird.  Since she is still small, I read the children book over and over again for her while she's sitting on the high chair. D2 got not dual camera, it's not a big deal for me, I always use my cell phone to take picture, so I don't really care if it's single camera or dual camera at all.  I don't care about google play anymore, it has 1mobile pre-load.  It's a great product at this affordable price for parents and kids.  I would suggest everyone to buy this product if you want to give as a gift.", "Title": "Great product at the great price", "Date": "March 3, 2013"}, {"Author": "M. Buck", "ReviewID": "R2YW7PILA5EGY2", "Overall": "1.0", "Content": "Not too happy with this product.  I ordered 2, one for each of my kids.  They both had the same problem - they wouldn't charge.  The company admitted fault with the product and replaced both with the updated model.  The company was great to deal with.  Hopefully the new ones charge - have not received yet.", "Title": "Had to send back.", "Date": "September 5, 2013"}, {"Author": "Michael Porter", "ReviewID": "R3CE5QIN2NVMAO", "Overall": "4.0", "Content": "In other words, for a hundred bucks, this little thing is pretty darn amazing.  I got one as a gift for may 83 year old father, AKA the oldest living geek, and I set it up for him.  I was skeptical, but I was pleasantly surprised.  It's lightening fast, videos look great, Ebooks look awesome, and I love the fact that you can add all that external memory.  It does all the things you wish the iPad could do!  In fact...I ordered one for myself.  Yes, I am a devoted iPad user, but this little sucker makes a great back up and it's small enough to use on the road (in a train or plane).One complaint:  the speaker is on the back, which makes it useless without headphones.", "Title": "It's Not an iPad...and It's Not $600.00, Either!", "Date": "May 12, 2013"}, {"Author": "k andrews", "ReviewID": "R3KMA8DVX7YRBX", "Overall": "2.0", "Content": "I purchase this tablet for my niece so when I first got this tablet I was excited to see what it can do. But after one day of try outs I found the product to be very lacking in many respects. Firstly, the battery is a horror story and I am not exaggerating because I am pissed; the battery is really really poor. It lasts approximately 40 mins of intense use, wats up with that. Secondly, the audio is barely above a whisper. I have to now go and buy speakers if I want my niece to hear music and watch videos; an extra cost i can do without. Thirdly the camera, at night the camera cannot take any pictures unless you are capturing the dark you cannot see a single image even when your house light is on. I am laughing right now jus typing about the camera ( even a me too phone has a better camera). And finally the wireless, the best connectivity is when you are close to the router any distance and the connection is poor.The picture quality is not bad and u can download the important apps u want. Dats about for the good. To be brutally honest I will not recommend this product for any parent buying this for their kids, cousins, nieces and nephews or anybody for dat matter.last but not least, it took them sometime to shipped this product.Update 03/06/13The charger of this product no longer works. One month and I cannot use the tablet because the charger is not working. Highly disappointed.", "Title": "Poor Product", "Date": "April 16, 2013"}, {"Author": "R. Goertzen \"RBG Books\"", "ReviewID": "R2DIFVZ2OEA0LW", "Overall": "5.0", "Content": "While this is not an expensive tablet, with all the bells and whistles, it is very nice.  It operates much faster than I would have thought and it does a very reasonable job with most applications.  For the money, especially if it's a first tablet, you really can't go wrong.  I am very pleased.  I would buy another and may do so as gifts for family members in the near future.", "Title": "Surprising", "Date": "April 12, 2013"}, {"Author": "EraseGreed", "ReviewID": "R6128WAPNIU84", "Overall": "1.0", "Content": "I hate getting brand new products that are defective & this 1 is. Pros; At first I loved it, it IS super easy to set up & that's saying alot considering I'm not tech savvy. I could easily figure it all out without referring to the user manual. The touch screen worked fab and was not glitchy, the gyro screen automatic orientation adjust thing works better than my samsung charge smartphone's does!,it has speech activated option and text to talk etc which is great for visually impaired as I am. You can also make the font size huge and it works on everything. it's just great if you don't plan on using it to download apps or retrieve emails, surf or do anything that requires it to connect to wifi.It just would NOT hold onto my wifi signal. I have an internet TV 4ft farther away from where I was using the D2 that never has wifi probs. The D2 98% of the time said my wifi was \"out of range\" and the few times it did pick up the signal it dropped it less than five minutes later. I called tech support. 20 minutes later someone finally answered. She actually told me \"you get what you pay for\"! She said that for the money they cost it does not have a long wifi reception range & that it would help if I was \"right next to the wireless router\" or I could TRY changing the security setting (to be less secure :/)on the router she further suggested, but added that most people don't want to do that. I was too upset to think to ask her what would that have to do with signal strength. Needless to say I'm returning this piece of junk. I don't think it should cost hundreds of dollars more to be able to get a tablet that has an acceptable range wifi signal ability.", "Title": "extemely short range & buggy wifi", "Date": "April 10, 2013"}, {"Author": "wade", "ReviewID": "R2LFIXD5LE69Y0", "Overall": "3.0", "Content": "I GUESS WHAT I EXPECTED FROM A CHEAPER TABLET. GOOD FINISH AND CASE. SCREEN DISPLAY NEEDS WORK AS DOES THE TOUCH PART.", "Title": "EHH SO SO", "Date": "August 28, 2013"}, {"Author": "Patricia Townsend", "ReviewID": "R48Q08ZOZS3B1", "Overall": "5.0", "Content": "My husband and sister-in-law purchased this for my birthday just over a month ago.  I didn't think this was something I wanted or even needed.  However, I have fallen in love with it and I cannot put it down!  What's more, I have read 2 books in just over a month - that is unheard of especially with 2 young children in the house.", "Title": "Fire HD", "Date": "July 28, 2013"}, {"Author": "Rodney Pannell", "ReviewID": "RRPAVE427LCXZ", "Overall": "3.0", "Content": "I bought this item for my grandson to play games on.  I also bought the warranty just in case he gets a little excited and drops it or something.", "Title": "Item seems to work good.  It's durability will be tested though.", "Date": "May 28, 2013"}, {"Author": "Stephen Tenney", "ReviewID": "R24F5Y0YIVX2N4", "Overall": "1.0", "Content": "This tablet is worth 20.00, no more...  Even though it runs Google's Android platform, it runs an outdated version without a chance for upgrades. It has low memory, low storage, and low processor speed, combined with low cost screen and parts.", "Title": "Not worth the cost.", "Date": "December 1, 2013"}, {"Author": "Andy", "ReviewID": "R2V64DUAP1OX6R", "Overall": "1.0", "Content": "From the very beginning, I could tell this was an inferior device. I guess you get what you pay for. Even after following the recommendations concerning the first few times charging the device (charge it fully, drain it all the way, repeat) the battery life was abysmal. It may have lasted more than an hour once or twice, but after a few days of use, it practically couldn't hold a charge at all. The screen resolution is pretty bad. The apps you can access are limited...it comes with the T-Mobile App Store and the Amazon Appstore, but most of the decent apps won't run on it.Then, after two or three weeks of light to moderate use, it just stopped working. It won't turn on, the factory reset button does nothing.  What a piece of junk.", "Title": "Not worth the money at any price", "Date": "April 27, 2013"}, {"Author": "Robert Strickland", "ReviewID": "R1YM230CAZJIS4", "Overall": "1.0", "Content": "Windows doesn't install the drivers correctly so when you're developing apps the SDK for eclipse doesn't recognize the tablet as an android device.", "Title": "If you don't develop it's fine", "Date": "April 3, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00BIYG6U0", "Features": null, "ImgURL": null, "Name": null}}