{"Reviews": [{"Title": "Exactly what I wanted.", "Author": "Bryan", "ReviewID": "RYF3E8GCQO03K", "Overall": "4.0", "Content": "I ordered this on 4/12/13 and it was delivered the next day. Here are my initial thoughts. I'll add to this as I use it more. Asus took a cue from Apple with their packaging. Very clean and orderly. Cables are tie with velcro straps, no twisty ties. Batteries included for the keyboard/mouse. The mouse's power was toggled to off. Don't forget to turn it on! The tablet/monitor was delivered with nearly zero power. You have to charge it above 20% before it will update to the latest version of Android that Asus provides (4.1.1). Windows 8 needed what seemed like a lot of patches for a system that just came out. I'm using 802.11n on both the tablet as well as the base to a Netgear WNDR3700 and get approximately 190mbit for file transfers. For reference, my home file server will completely saturate the gigabit connection to my desktop. The base/tablet are in the same small room as the router. The Win8 computer's 1TB drive came formatted with 750GB dedicated to a data drive (D:) with the rest for system / recovery.As far as the Android side, the Tegra 3 in the tablet is plenty fast for my needs. I'm using a beta build of XBMC for Android with hardware acceleration and it handles 720p / 1080p mkv's marvelously. I've tried a few tegra specific games and they run great as expected. So far the only issue that I've run across that has me disappointed is Amazon Prime instant videos using flash. The audio is out of sync no matter what browser I try to use. I'm quite disappointed in Amazon for not having an android app yet. That's not Asus's fault though. The wireless signal on 5ghz isn't too great so far. I've got 802.11n capable laptop that seems to get a much stronger signal in my home. Even with a android showing 1 bar of signal I can still get > 55mbit speed. The audio coming out of the tablet is loud. VERY loud. It's a bit on the tinny side but still good. The audio from the base (different speakers) is a bit better but still in need of some base. Definitely worth picking up some PC speakers.Now for the user experience. The IPS panel is gorgeous. The touchscreen is VERY smooth and responsive in both Windows and Android. The experience is not quite as responsive when using Win8 away from the base. It's very usable, mind you, but it is obvious that you aren't attached anymore. I've only tried a few PC games so far. I've been replaying Portal 2 and Torchlight 2 recently so I tried both on this system. They play great with everything maxed. Torchlight 2 works fine with a touch screen though I didn't see any immediate way to \"right click\" with touch. Portal 2, on the other hand, was unusable with touch. I could even play Torchlight 2 with the touch screen away from the base but the FPS dropped noticeably.The tablet is definitely heavy. You're not going to carry it around and use it in your hands. It's fun to use on the couch though or propped up on a TV tray. It did not handle direct sunlight well in Android mode. Though it has a camera, it doesn't sense light in the room which means you need to adjust the brightness yourself. Speaking of which, the webcam is mediocre.There a few negatives that made this a 4 instead of 5.* Sometimes the transition between desktop monitor mode to tablet remote control mode gets.. confused.* Webcam doesn't work in Skype on android side of things. It's also not very good.* Wireless radio in the tablet is poor or the signal measurement is faulty.", "Date": "April 16, 2013"}, {"Title": "Above my expectations", "Author": "zzdb", "ReviewID": "RR1DALW8V8LRN", "Overall": "5.0", "Content": "I ordered this 4/12/13 as well. I received mine at the beginning of the following week. Upon unboxing I was initially impressed with the quality of everything. As stated in the other review everything was packaged nicely and seemed well protected. My tablet portion was 75% charged so updating and setting up everything was very easy. There is a number of steps in the setup of accounts for because you have two operating systems, but once I attached my Google account it seemed to set everything up as I have on my other devices. It is a nice feature of new devices to link all of your accounts and this process was seamless on the Transformer AiO.The overall look and feel of the device is solid and nicely designed. It looks and feels good. I am pleased with the performance of the docking PC and in desktop mode the screen looks fabulous; true HD. Videos look great, video conferencing looks and works great, and the touch sensitivity is precise. Windows 8 works best with the touch screen, I prefer to switch to the windows 7 type looks when Im using my mouse and keyboard, but that's just personal preference.In tablet mode the performance is all I expected and more. Yes, there are some apps that do not load properly because their tablet interface, but that is the apps fault not the fault of the device. When an app is designed for tablets they look and perform great. It is fast and fun. The weight of the tablet does not hurt its usability. I would not hold this in my hands for long periods of time, but the kickstand makes it easy to use on tables and desks. And I even have held the device in my hands and used it exactly how anyone would use a tablet and it worked fine. The 2GB of ram in tablet mode provide plenty of response and multi-tasking is a breeze. I have used the normal transformer tf300 and this tablet functions much the same just has a much bigger screen. Gaming is fun on this device, netflix works awesome as the screen is like having a tv in your hands, and productivity software such as office work great. I have used this for presentations using powerpoint in my sales meetings and people are impressed with the screen and size of the presentation allowing them to easily read the information from their seats. This is bigger than my laptop for work and has provided a great tool and conversation starter.I also like the splashtop application for using the PC portion remotely.As of now the only problem I have found is that the wifi antenna is not as strong as my phone so the internet signal has to be stronger to fully utilize everything web connected in my apartment.Overall this has exceeded my expectations!", "Date": "April 19, 2013"}, {"Title": "So Far so Amazing", "Author": "Timothy Lundberg \"Shaolas\"", "ReviewID": "R2G7YZ9IWN9YTK", "Overall": "5.0", "Content": "Just received this today.  Got the $4 one day shipping on this, great deal Amazon, and so far I am absolutely loving this.  I have been waiting for this exact device for a long time.  I'm a bigger is better guy, my wife and I absolutely love the huge 18.4\" tablet to browse and and surf on.  We have Galaxy Note phones, and we laugh now when we see people with iPhones.  Seriously they're just so tiny.  I'll right some updates to the review over the next couple of days, but this thing is really, really impressing me.  So far the only negative is that there was a bit of residue on the screen, but at least you get a handy dandy wipe to get it off.I haven't noticed any problems with Wifi, and very little lag running Windows 8 in the remote mode.  Could be because I've got a pretty heave duty Fios Wifi router, not sure though.  Google has been working like a champ to sync both my devices with all my existing stuff, especially on the tablet side it automatically downloaded all my apps from Google Play, very, very cool.I've read some quazi negative reviews on this and I guess some people just have to hate, because they don't get how revolutionary this product is.  I used to be a 3d animator and I have been waiting for this exact product for a while.  It's a really powerful feature to be able to set something rendering or working on the Desktop part of this machine and then just detach the tablet and go surf as you watch tv on the couch.  The keyboard is actually pretty good for typing, I prefer a large natural keyboard, but this is actually really nice to type on (what I'm typing on now).  The mouse is a little sketchy with the touch scroll wheel.I'll be playing some Starcraft II tomorrow to see how it stacks up against my Imac, but I'm expecting good things from it.Really couldn't be happier, and I haven't even used the HDMI out yet to hook this up to my Tablet.  It really is like you're buying two computers, a really nice and powerful desktop and the coolest biggest tablet on the market.FIRST UPDATE.So I'm a few days in now and still really enjoying this tablet/desktop.  I think that is the most impressive part of this computer, and the hardest to describe.  You're getting two computers for the cost.  So its just really really nice to set up a program to render, or to download a ton of stuff on the desktop part and then pull the monitor/tablet and hang out on the couch.Also the keyboard and mouse are really good.  I don't notice typing on them at all.  Have you ever used the keyboard and mouse that come with a modern iMac?  I have and they are horrible.  This keyboard and mouse though are fantastic.  the mouse is a little weird,but I'm pretty picky about mouses and this one is great.  The full wireless keyboard with numpad is also great and very slim and has a great design.No real complaints at all, I'm still getting everything set up on both computers how I want it with all the different software and applications.  I haven't had an opportunity to really get everything to sync between all the apps and the shared storage space, but I'll write more as I use that.3 May updateTaking it on a trip, and this was the only backpack\\transport system i could find to handle the tablet http://www.amazon.com/gp/product/B002HMCQZQ/ref=oh_details_o01_s00_i00?ie=UTF8&psc;=1.The case is great and cheap works as a carry on, backpack and rolling suitcase.  The tablet is working great as a tablet.  Ive got a 64 gig additional card plugged in so 96 gigs worth of whatever i need.  So flixster, google play and google docs are working great.  I need to try this out with my corsair voyager, 1TB wireless HDD, but so far the android tablet os, giant screen, battery and wifi are all working great.  Ill be sending updates about how this handles being deployed to a war zone shortly.  Should be the real acid test of its durability.", "Date": "April 24, 2013"}, {"Title": "Quality product through and through!", "Author": "J. Hunter", "ReviewID": "R1OUJUFSANKG5M", "Overall": "5.0", "Content": "To begin with I would categorize myself as an early adopter.  I get lots of things before the paint has had a chance to dry, so I've prepared myself for hiccups that understandably come with most new products.  I've waited for these hiccups to occur with this \"wild\" product from Asus, but I just haven't found any.  This device oozes quality from top to bottom. It feels as though it's built like a tank from the tablet to the base station, and even the keyboard and mouse feel incredibly sturdy.  This is the type of product you'd expect to spend $1299 for. After scouring the web for reviews for over two months I finally decided to take the plunge even though there were several reputable websites that kept telling me to wait until the market matures, because this was missing this or needed more of that.  Hogwash!  This device works exactly as advertised, and I'm still amazed that Asus was even able to pull it off!  Every aspect of the P1801 works flawlessly.  Android is Android with all of its shortcomings and Windows 8 is just as you'd expect.  Speed isn't an issue while running either OS and I am really impressed by just how well the Windows 8 side works in tablet mode once it's separated from the base station.  I've experienced little to no lag up to this point, and it's as if I'm still attached to the base. I expected some of the apps in Google Play not to work well with this huge tablet, but the only one I've come across so far is Slacker Radio, which continues to crash when I try to log in.  Nothing major as I have several streaming music options, but I do hope this is eventually resolved as Slacker is one of my favorites. I also read a ton of complaints about the keyboard and mouse.  The keyboard is easily one of the best I've used.  Coming from a touch typist that's saying a lot.  The mouse on the other hand would be okay if it wasn't for the digital scrolling button.  It seems to have a mind of it's own or requires such precise execution that it drives me a little nuts! If my only complaint up to this point is an unruly mouse scroll wheel I'd say that Asus has hit a home run with this device.  This really is two devices in one, and it's well worth the price.  You can use the tablet in Android mode and hook up an external monitor via HDMI to the base station and continue to use Windows 8 as a totally separate PC!  I'm still scratching my head trying to figure out how they managed to do this while not sacrificing performance.If you're on the fence about this device I suggest you get off of it immediately and buy it right now!Pros- Two devices in one! Android 4.0 and Windows 8. Using an 18\" tablet on your couch is amazing! Ability to switch between each OS at the touch of a button. Keyboard is better than average. Very fast while either using Windows 8 or Android.Cons- Scroll wheel on the mouse is frustrating!Update:After a little more time with this machine I have discovered two annoying quirks.  The blue button that serves as the mode switcher no longer works to switch back to Windows when the tablet is not docked.  As long as it's docked the mode switch button works flawlessly, but when I remove it from the dock and try to access Windows from Android I get a \"failed to connect\" error message. If I manually click on the link above that shows my Splashtop connection it will connect to Windows.  While this isn't a deal breaker it does affect the \"cool factor\" when I'm trying to show it off to my friends!  Secondly, and they may or may not be related, the Splashtop connection will just terminate for no known reason.  A quick reboot solves this, but who wants to do that?Otherwise this is still a great machine, and I'd still recommend it to anyone looking for a desktop.  I use mine docked more than anything but its still cool to have that option to take it with you to the next room.", "Date": "May 18, 2013"}, {"Title": "Warning About ASUS Customer Support... Beware!!", "Author": "WannaBeABetty", "ReviewID": "R1GPPCWSUCS0KS", "Overall": "1.0", "Content": "I have had numerous issues with this computer since its purchase.  The first one arrived broken... not the screen, the glass area on the CPU and hard drive enclosure.  It took TWO WEEKS of it sitting in my house, broken, with them having my $1300 before ASUS would grant the DOA and I could return it.  Luckily I ordered the second one from Amazon and not an outside seller because I knew if there was another issue, I could take it up with Amazon instead of ASUS because Amazon takes care of their customers!Well, the second one arrived, not broken thank goodness, but it only worked properly for about 2 weeks.  The mouse is a terrible design.  The scroll bar is a new design and is faulty.  It won't work half the time, and the rest of the time, it scrolls even when you aren't touching it!  It took over the computer, it kept scrolling when I was trying to type something, when I was trying to read a website... it was ridiculous!  Me being a geek, I wondered if it was the computer or just the mouse.  So, I disabled the mouse and attached another mouse I had... worked perfectly.  So I decided to call ASUS and get another mouse, seeing as how this one was broken.  Well, I was told after being on hold that because it was a minor issue, I should do an online chat with support. Over the next 2 weeks I chatted three times with support online, running through diagnostics, being told I didn't know what I was doing (growl), and being told I just needed to hit the scroll lock key more often as I was triggering it (wasn't).  So, I finally sent them an email to their support desk.  I was told, oh, whoops, now you are out of the 30 day warranty, so sad, too bad, and you know, if you really want to fix it why don't you just reformat the computer and see if that works.WHAT?!?!So today I called them and spoke with a tech for 22 minutes and explained the issue.  I was finally told, no, sorry, nothing I can do.  So I asked to speak to the supervisor.  I was told, okay.  Then I was put on hold for 18 minutes and 46 seconds (yes, I watched the timer on my phone) before I was just disconnected without warning.  All this over a mouse??I am worried now about the rest of the computer.  What if it goes bad?  How will I get it fixed?  I know now that I can't deal with support.  So, WARNING... this is a nice computer, but, make sure you buy the initial one from Amazon and not an outside resaler so you don't have to wait for an ASUS Dead on Arrival (DOA) authorization, AND after that, pray that all the parts work, and if they don't demand new ones in the first 30 days, because, if they talk you past the 30 days, you're out of luck!Check out the consumer affairs department about ASUS [...]*** 8/25/13 Update:After receiving help from customer service due to this review (see the comments), I did receive a new mouse 2.5 weeks ago.  So far it still works.  We'll see if it continues to do so.HOWEVER... yesterday I arrived home to find my computer would not turn on.  I then noticed that I heard a beeping noise.  I finally realized it was coming from the power supply.  I felt it, it did not feel hot, but I unplugged it and let it cool down until this morning.  In the meantime, I googled \"ASUS power supply beeping\" and various other searches only to discover, to my sadness, that the beeping noise probably meant my power supply was done for.  Some said that sometimes after a cool down it would last a few days longer, but that surely the power supply was bad. I waited overnight and tried again this morning... nope, no luck, still beeping, no power.  I emailed customer service again, to the same contact that helped me before, we'll see if the power supply is already out of warranty.I am so dismayed.  When this computer works, I love it.  But I have only owned it since May, so for slightly longer than 3 months, and it has been one issue after another.*** 9/16/13 Update:Customer service sent me a replacement AC adaptor... but it is the wrong one!!  It is the one for the tablet, not the desktop!!  I am emailing now to try again...*** 10/09/13 Update:Received replacement adaptor that is CORRECT!  Yay!  Am using my computer now after 1.5 months of it being a brick.  That is a long time for a computer to be a brick, in the swift changing world of computer-land!  I am so ecstatic though!  I do really adore this computer WHEN it works.  I have had such terrible experience with getting it working, I want to leave this review here as a fair warning!  I will update it if anything else happens... and I hope it doesn't.  This is a great computer... when all the parts WORK!*** 1/25/14 Update:After working solidly for 3 months, I went to turn the computeron today, to no result.  Static burn, tried various things, now unfortunately familiar to me... nothing.  Just sent off another email to customer support.  Seems the power adaptor lasts roughly 3 months and then dies.  Maybe I can get two adaptors this time so I will at least make it half a year...  will update again with more details as soon as I find out what is wrong...", "Date": "July 22, 2013"}, {"Title": "I was a bit skeptical but so far it is a decent product.", "Author": "Gun Geek", "ReviewID": "RZEK5G9GN4EYC", "Overall": "4.0", "Content": "First as the name implies I am a bit of a geek. I like gadgets, I work on computers, write computer software, design websites etc, so I am no newb when it comes to computers. Generally I do not like All in one type computers but I couldn't pass up testing this thing. Over all as a basic PC it is great. Windows 8 has its ups and downs but I cannot blame ASUS for that aspect of it. The specs are decent I just wish it had the I7 processor. I understand that a new version is coming to the US that will have the I7. I have run a multitude of programs on this machine with no issues such as Adobe Creative Suite, including Photoshop, after effects and the like, Visual Studio 2012 and more. So far I have not had any issues with screen lag when it comes to basic programs. Also the touch screen appears to work great even with older programs.However I decided to test this PC with Crysis 3, the specs should be good enough to run Crysis. While running the game I noticed significant lag between the actions of the mouse, keyboard and what the screen displayed. It also looked pretty bad. I believe this is more because the monitor isnt really direct connected to the PC. I will test this more with an HDMI cable connected straight to the PC dock. The android tablet is just that, an android tablet. Having several Asus Android tablets from small to standard, this thing is HUGE. This isnt something you are going to want to lug around with you as it is heavy and as mentioned HUGE.The interface between the two is ok, it is using an app called Splashtop which you could technically use if you are away from your house to connect to your PC, provided it is set up properly. The one touch switch is great and I love the fact that I can switch to android and play games or surf the web when I am rebooting the PC portion of it.I recommend this PC for your basic home user and will also be testing this in a business environment soon. We are going to be setting these up for managers, so that they can bring their tablets with them on the floor and look at graphs and charts on their departments. I dont know how these will do in a large multi user environment but we will see.", "Date": "September 3, 2013"}, {"Title": "Replaced work laptop", "Author": "Bobby Conrad", "ReviewID": "R2JY7MGMOIZ55R", "Overall": "5.0", "Content": "This system seems to work well. I had issues when first deliveried ..the main board fried after 4 hours..this was repaired after $200.00 in shipping charges and basically 2 weeks of down time...Not very happy with that!! So this system has now cost way more than budgeted.Now that the computer is back I am in the learning cover of going from Windows 7 to Windows 8..which is a struggle to say the least..I am an Andriod user so that part has been the least of the heart burn. I travel on business and am not sure how that may play out because of the need for the docking station to use Windows..and 2 causes more issues..I feel that it is a good system and will work for me I have been a Asus fan for many years..I do feel that Amazon or Asus should cover some of the return cost of the system as it was \"brand new\" out of the box...I will keep entering feed back as I work thru the system.", "Date": "July 8, 2013"}, {"Title": "Awesome computer!", "Author": "M. Thompson \"marct59\"", "ReviewID": "R1VFGTD1T2F8LP", "Overall": "5.0", "Content": "This is an awesome computer and is just what I wanted. I have not had any issues with it since receiving it a month ago. As for it being a dual boot pc, being a taller than average man, carrying an 18.4\" tablet is not a problem and switching between Windows 8 and Android has been smooth in every instance. The speakers are fine but could be better and I'd prefer a tray driven optical drive over a slot drive. Otherwise, this system is ideal and a good replacement for most desktop systems.", "Date": "May 28, 2013"}, {"Title": "Great once you get used to it", "Author": "Greg Emmerich", "ReviewID": "R6Q9GRXVKLZE7", "Overall": "4.0", "Content": "This is my first foray into the world of tablets, and I have to admit it is fun having such a large screen to work with. I have a Galaxy S3 and don't feel like I need a more portable tablet considering that phone is itself basically a very small tablet.The biggest challenge for me has been getting used to Windows 8. Thus far I have mostly been running Android. It did take upwards of an hour to download and install the necessary updates, which was a little disappointing.Overall I am incredibly impressed with the product and presentation, and am looking forward to using this more in the future. I will update this review after I've played around with it more.***UPDATE***CONS-The tablet is really only useful in Android. Like others have commented, I too have had lots of problems virtualizing Windows 8 on it, and when it does work it is quite sluggish.-Unfortunately, not many Android apps are designed to be on a tablet so large, so you have to dig around to find ones that work for you.-You really need to watch tutorials for Windows 8 or you will be lost. They seem to be going for a more \"intuitive\" and sleek interface, approaching what Apple does, but they aren't quite there yet. The navigation is hidden (including the \"Start\" button in the lower left) and you can only add items to the home screen from the app itself.-Two separate OS means you need to download apps for each OS, which can be time-consuming.PROS-Very fast with great display when attached to the base. The sound is decent but not great.-Games are a ton of fun on such a large tablet. Photoshop and Illustrator love the screen size too.-Once I got both OS customized and got a feel for navigation, I found it very easy to multitask. Sure, the block style of Windows 8 seems pretty basic, but it is nice to organize applications based on priority of what I need to check up on. I am constantly checking my email and social networks already, but simply by having the logo for NPR or tech blogs near the top of the start screen makes me more likely to check the news. The focus here is on access. Windows 8 can help serve as a friendly reminder to stay informed and connected for whatever your interests are.OVERALLI commend Asus for leaping into the forefront of All-in-ones, and although there are minor bugs, the Transformer proves to be adaptable, powerful, and fun.", "Date": "May 27, 2013"}, {"Title": "Two for One", "Author": "Drew Gorman", "ReviewID": "R1IYCFCI2IZZGY", "Overall": "5.0", "Content": "This is a great computer and a great tablet.  It is two computers for the price of one.  If you have an extra monitor, you have another computer.  Just connect your monitor to the Desktop Port and you have another computer.  You can also remote control the desktop port with the tablet detached and in another room still running windows 8 on the desktop port.  A very versital machine.  I love it.", "Date": "September 23, 2013"}, {"Title": "Great Product!  Description Clarification", "Author": "Amazon Customer \"3 princesses\"", "ReviewID": "R1VD64KTNCF8Y0", "Overall": "5.0", "Content": "I bought the P1801-B054K, which is the i3 version.  The item description says this unit has a 3.1GHz Core i3.  This is not correct.  It actually has the 3.3 GHz i3-3220, which is a pretty powerful processor.  Most other sites offering this unit have the description correct, so I'm not sure why Amazon doesn't.The unit worked great, right out of the box, both in PC and Android mode.  It's a REALLY big tablet...that's kind of fun.Perfect for lounging around the house.I really like that I can remotely use Windows, too.Finally, I really like that with an extra monitor, both the tablet and the PC can be used at the same time.It truly is 2 units for the price of one (I got mine as a lightning deal + a $200 rebate from ASUS), so the cost on this was really attractive.My kids love it too.So far, I haven't had any problem with the mouse, as other reviewers have mentioned.I would definitely recommend this to anyone that was thinking of a desktop.It's a lot of fun, fairly high performance, and really usable in a lot of different applications.UPDATE: 12/8/2013BE CAREFUL WITH WINDOWS UPDATES!Upon getting it set up, I installed MS Office 2010, Java (x32 and X64), and the Android ADK.My daughter turned the unit off with the push button.It then got stuck doing updates and never finished.I restored (with a Windows 8 boot disk, because F8 doesn't work in Windows 8) to the first restore point.Starting fresh, with just Windows and no apps, I noticed that Windows itself had 84 updates to do.I let that chunk for an hour or so, and it finally finished.When I added JRE, there were another 40 updates.Likewise, when I added Office 2010, there were another 40 updates or so.After each, I let the Windows update do its thing.It took a loooooong time, but it all eventually worked.So, no trouble...just be aware that when you first add everything, there will be a lot of updates, and it will take some time.I recommend doing it a little at a time as I described.Updated to Windows 8.1.So far, so good.", "Date": "December 5, 2013"}, {"Title": "Dual OS has issues and lack of customer support creates poor rating", "Author": "Suzette Sewell \"Suzette Scheuermann\"", "ReviewID": "R14L4BC3TEO72X", "Overall": "2.0", "Content": "I tried this product for three weeks.  The dual systems create issues with email and switching identities.  The OS does not switch efficiently and sometimes freezes on a black screen with ASUS.  Uses twice as much data so if on metered connections, this is a consideration.  I loved the big tablet that I could pack around, but the case that is recommended for it does not fit it (too small) . I packed up the computer today and returned it.  It may be good in principle but the product falls short.", "Date": "July 9, 2013"}, {"Title": "9 months later and still amazed with this pc", "Author": "Jon P.", "ReviewID": "R1Q554US91O9DR", "Overall": "5.0", "Content": "This pc has exceeded my expectations.  It has been 9 months since I bought this AIO and still very happy with it.The dual use of switching between WIN and android is great.  I love being able to detach the screen and switch to a large tablet.  Nice to use in android mode with local cable provider and stream live cable channels.  It is like taking a TV where every you want to.Another nice feature is being able to connect to my TV with the HDMI cable.  I streamed Amazon Prime for my wife via Windows and was able to take the monitor off and use as a tablet in Android at the same time.The only issue that I noticed was the same one everyone has complained about which is the mouse.  Scrolling is very hard with the middle button.", "Date": "February 6, 2014"}, {"Title": "This is just what I was looking for!!", "Author": "Shoe lover", "ReviewID": "R31WMUD9UZZ82K", "Overall": "5.0", "Content": "I decided to end my relationship with Apple products, for a variety of reasons.  I traded in my iPad and my Macbook Air, and was in search of something to act as a replacement for both.  This really fits the bill!I first bought a Sony Vaio Tap 21 with the i5 processor.  I had it for about a week and ended up returning it.  It was a nice computer and functioned well, but it was just a bit too heavy/cumbersome to really use outside of a desktop.I debated between this Asus or the Dell XPS 18.  In the end I decided to go with the ASUS and I'm so glad I did!  Set up was easy - there were updates to deal with, but that was expected.  The touch screen is very accurate.  Beautiful display.  Easy switch between modes.  I used Windows 8.1 remotely, and didn't experience lag issues.  I was in the room next to the docking station, so maybe the close distance helped.  I've read complaints about the mouse, but I didn't have any problem with it.  It is a pretty sensitive mouse, but for the little I'll actually use it, it's fine.  I love the keyboard - it's a nice size.  Speakers have great sound on both the tablet and the base.The tablet is very portable, unlike my Sony Tap 21.  They really thought of everything -- and I probably appreciate it more because Sony was lacking some of these features.  There is a handle at the top of the tablet, which makes it very easy to carry around the house.  The weight is great - it doesn't feel too cumbersome to move around.  The tablet is thin and feels like a real tablet - not a huge desktop computer you are hauling around.  The stand on the back works well - I put a pillow on my lap and set the tablet up on top of that.  You can adjust to many different angles to suite your preference.  The Android system works well and is very fast.  (I got the i5 processor).  I know there is an i7 version out there, but for my needs, the i5 is fine. I like that the \"main guts\" of the computer stay on the desktop.  There is a DVD drive in the base, which is convenient.  Most of the portable AIOs do not offer that.I found a laptop bag to fit the tablet - I don't anticipate taking this around a lot, but if I did want/need to take it somewhere, it would not be a problem. I am so happy that I found a device that can truly replace the two devices I traded in.  I'm surprised I don't hear more about this computer - I sort of stumbled upon it in a review of portable AIOs.  I highly recommend this product!!", "Date": "December 20, 2013"}, {"Title": "ASUS Transformer AiO P1801-B037K 18.4-Inch Desktop", "Author": "Amazon Customer", "ReviewID": "RX7WEZPQYH3VU", "Overall": "5.0", "Content": "I am in love!!!!!!!! set this up as my primary computer, I work on a PC all day, when I am off work the last thing I want to do is set at a desk,,,,,,, I want to kick back in an easy chair but I still want the power of a full fledged PC but I do not want a laptop sitting in my easy chair.  This fits the bill, the switch to an android is great, I can give my kids the tablet and let them play while I use the base on an external monitor as well!! a perfect 2 for one with all the power you could ask for!", "Date": "June 5, 2014"}, {"Title": "Best choice I ever made", "Author": "Darrick", "ReviewID": "R200MICPTDHP8M", "Overall": "5.0", "Content": "This Giant Tabet/Pc great for what I needed for.  First thing my friend say it why do you have that TV.  After I found a Laptop case to carry  it in I take it everywhere.  Since I need a Laptop, New Desktop and a Tablet this was the best solution.  Android has a less chance of crashing like Windows and I can just hope on Wifi and use the PC function.  The only flaw I found is that there is no USB port to connect a Key board while it's disconnected from the main PC base.  The key board reduces the screen and makes it hard to work in design programs but this is when I would just dock it and finish my work.  The expansible memory is helpful because I can transfer file from phone to Tablet faster.  The best part is the sound and movies,  You can put a DVD in and watch it on you lap with some nice headphones it's like being a the theater.  This thing is great.  I'm looking to upgrade in 2 years to a faster model.", "Date": "May 17, 2014"}, {"Title": "Great Idea, Difficult to use as a tablet", "Author": "Chadd G", "ReviewID": "R32FFZTFHCWGFI", "Overall": "5.0", "Content": "Love the idea of having 2 systems in one but Android on the 18\" tablet is a bit difficult to deal with.", "Date": "April 21, 2014"}, {"Title": "Awesome AiO Tablet Combo!", "Author": "bing", "ReviewID": "R1FKLJIZDXEWXH", "Overall": "5.0", "Content": "I love my new ASUS P1801 AiO computer/tablet. It does everything I could want from a PC plus an 18+ inch Android tablet! Excellent processing power with plenty of memory to speed through any computing processes. beautiful HD display that turns into a giant Android tablet! Who could ask for more? It is two very capable devices in one, at a very reasonable price! Really enjoying the windows 8.1 experience. If you are looking for a premium All in One computer and want the versatility of a tablet then you need this package!", "Date": "April 7, 2014"}, {"Title": "Amazing computer!", "Author": "Jordan", "ReviewID": "R1U76L2LZT9PF", "Overall": "5.0", "Content": "I love my new computer! It's beautiful, great performance, and is such an amazing design! The screen is pretty big for a tablet, however, it is exactly what I was looking for!", "Date": "January 13, 2014"}, {"Title": "Perfect", "Author": "Amazon Customer", "ReviewID": "R2LK4E2C25DXRS", "Overall": "5.0", "Content": "This computer was everything I had hoped for.  My daughter has plenty of apps she likes on android already, and books.  I wanted all the greatness that comes with windows and we get that too.  She is 5 years old and has no problem getting around between the two operating systems.  I had heard a lot of people down on windows 8 and I just don't see why.  I love it!  Plenty of power and plenty of memory.  Looks great!  What more can I ask for?", "Date": "January 3, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BWHILC4"}}