{"Reviews": [{"Title": "perfect for little ones", "Author": "Ida", "ReviewID": "R3R4RVMPF6RA7D", "Overall": "5.0", "Content": "I have been waiting to buy one of the ematic funtab mini for my grandsons since last christmas but could'nt find one in stock.  Everytime I read the reviews I would change my mind about the ematic and look at other products. They didn't have the same apps like the ematic funtab, so I decided to search for the ematic again. Since I buy every thing from Amazon I kept comimg back to see if the ever got any in and they did. It was the second versions. I preferred this version because it has a front and back camera, even though my grandsons are only 4 & 5 they enjoy taking pictures and making videos of their self. The 4.3 screen is perfect for them.I learned a long time ago that you can't go by other people's opinions. You have to take a chance, and try it for your self. l took a chance on the the ematic funtab and was very pleased. I brought this tablet for my grandsons but I couldn't stop playing it myself after setting it up. Now my boys are boys, they are hard on toys, so I purchased the extented warranty. So far they have dropped them and threw them a dozen times and they are still working. I am very satisfied with my  purchase of the ematic and so are my grandsons now I have to purchase two  more for my granddaughters. I may even purchase the 9inch for me.", "Date": "July 28, 2013"}, {"Title": "terrible", "Author": "Librarychick1970", "ReviewID": "R3SFEZS8SE6ANL", "Overall": "1.0", "Content": "This tablet quit working for my 5 year old on the day she got it. It was so disappointing. Poor quality", "Date": "July 6, 2013"}, {"Title": "ematic 4.3", "Author": "babygirl", "ReviewID": "R2WG67N70OS72K", "Overall": "3.0", "Content": "My daughter loved it but the only thing that didn't work out for us was the charging part 3 days of having it it got loose so we called in and got it replaced and 3 days later we had the same priblem.So returned it and got my money back", "Date": "July 30, 2013"}, {"Title": "Dont buy", "Author": "nicole", "ReviewID": "RVU8JL5XP77N4", "Overall": "1.0", "Content": "Garbage.. froze up and could not do a single thing. i dont recommend buying it at all. get something better", "Date": "July 17, 2013"}, {"Title": "Plug broke within three weeks", "Author": "campbv", "ReviewID": "R21M2PPKX93HYW", "Overall": "3.0", "Content": "I thought this was made for small kids. She loved it while it worked but the receiver for the plug broke within three weeks. It's useless now!", "Date": "September 8, 2013"}, {"Title": "30 days, no power", "Author": "larr", "ReviewID": "R151GP2KMM6ZCY", "Overall": "1.0", "Content": "This never worked well.  Purchased for my 5 year old girl.  Looks great, but could never get it to work.  Dont waste money.", "Date": "July 2, 2013"}, {"Title": "Should've read over reviews", "Author": "Monica", "ReviewID": "R1JQ2VHRGB35ND", "Overall": "1.0", "Content": "My sister was looking for a simple, easy to use and affordable table for my little niece and this product seem to fit the description. I did notice poor reviews but unlike other times I choose to ignore them. I figured, ' C'mon people this isn't a Ipad' .In anycase received the product and within ONE day the charger connector broke while being plugged inn and now it won't work AT ALL.Now that I took the time to glanze over reviews I noticed the charger is the main subject of failure.Just don't buy it.", "Date": "August 27, 2013"}, {"Title": "will not charge  DO NOT PURCHASE", "Author": "Angela M Thomas", "ReviewID": "RKYGXBP2Y5LVA", "Overall": "1.0", "Content": "We returned our 1st one because it wouldn't charge and the second one is doing the same thing but  they wont give us out money back or replace it.  So I just wasted hard earned money...", "Date": "August 31, 2013"}, {"Title": "bad choice", "Author": "toyia85", "ReviewID": "R14G1SLHE6FDLE", "Overall": "1.0", "Content": "I was very impressed the first day then a week later it won't even charge. I have not retried to contact the warranty department so not sure how well they will be.", "Date": "August 25, 2013"}, {"Title": "Child Safety", "Author": "ANGELICA NAVAS", "ReviewID": "RY12DCYGUNB71", "Overall": "2.0", "Content": "It's a kids tablets\\ but has no screen protection for children, the back cover is not secure properly creating safety issues, No wounder you offer additional plan protection.Also Square Trade never mail written protection plan how can I get the copy?", "Date": "August 26, 2013"}, {"Title": "Great for Kids", "Author": "emmstarr", "ReviewID": "R3967HA7O32U3N", "Overall": "3.0", "Content": "I purchased this last year for Christmas for my soon-to-be 6-year-old son.  The parental controls weren't very easy to use, nor did they keep my son from bypassing them and browsing on his own.  It was a pain to figure out how to download the Amazon App Store (my preference) and every time I wanted to use it, I had to reinstall.  It comes pre-loaded with a ton of games he wasn't interested in - I ended up deleting them all.  The best part was that it was very easy for him to download his own apps once connected to wifi.  Sometimes it was a little slow for my taste, but he enjoyed it.  It was testy to get the charger to connect sometimes, though it does use the same charger as my Droid and Samsung smartphones.  That was helpful for long car rides!!It is broken now (less than 1 year later) because the piece that the charger connects to has broken off inside of the thing and I can't figure out how to get it open.I'd recommend this for medium use for smaller kids; but I think 6-7 years old may be about the limit, if they are anything like my child who likes to download and delete all the time.", "Date": "October 11, 2013"}, {"Title": "WARNING: BAD PRODUCT", "Author": "Dena Thomas", "ReviewID": "R3UW7CVXCT7TTC", "Overall": "1.0", "Content": "I bought 5 of these for my children for Christmas 2012. Every one of them broke within a week. The charging ports are bad on them. I sent them back to the company who repaired them, but it took 4 months to get them back. They broke again. I was able to get my money back from Wal-mart for 2 of them which was nice because I purchased a warranty for those. However, I sent my daughter's back to the maker in February 2013 and didn't get it back until July!!! Then it broke again within a week-the charging port again, and they refused to fix it. Another problem with it is if your child is old enough to figure out a birth date year that makes him older than 10 years old, the parental controls will not work. Then they have free access to explicit internet material. My kids are definitely smart enough to figure that one out so this is not a kid safe device.Another huge frustration is the touch screen doesn't work well. There have been times I haven't been able to return to the settings because it was at the bottom of the screen where it wouldn't allow me to touch. HUGE, HUGE, HUGE FRUSTRATION!! I just about wanted to flush the thing. I have also had these to just not boot. It just sits there on the loading screen for days. I sent that one back for this problem, too, which was another 4 month wait for a repaired one. I will never buy an Ematic product again!! My recommendation is to buy an old working ipod touch (whatever generation you budget can buy) on ebay, download free apps and set parental controls. It is MUCH better, safer and cheaper! This is what we did and I wish I would have done this for Christmas last year!! Lesson learned.", "Date": "October 2, 2013"}, {"Title": "no sturdy", "Author": "SUSAN carey", "ReviewID": "R21DD5ZAXB8G6H", "Overall": "1.0", "Content": "the first week the chargin port drop inside and we could not use it no more the kids loved it I was going to buy 3 more because I like the size for little hands but that turn me off now I still need 4 tablets for christmas", "Date": "October 30, 2013"}, {"Title": "broke within 3 weeks", "Author": "Stephen Faulkner", "ReviewID": "R3HVS84NT1MG4N", "Overall": "1.0", "Content": "Item no longer powers up and does not work after only 3 weeks of use.  There is no return policy on the item as well so $ wasted.", "Date": "October 23, 2013"}, {"Title": "Nice!", "Author": "Sassy", "ReviewID": "R1FCPURKA2M6IC", "Overall": "4.0", "Content": "My step daughter loves it and I love the parent control. The only thing is the on/ off button broke off after a week of having it. But definitely a great product to have for growing kids I would reccomend you get the big one though. The mini is hard to see the screen at times!", "Date": "June 2, 2014"}, {"Title": "Good product for a good price for the right age but...", "Author": "Simon  Couturier", "ReviewID": "R3L42UH4HUVWJO", "Overall": "3.0", "Content": "The good and the bad:+ WIFI range, brightness, Android 4.2 and up are good+ Zoodle Kid mode works without subscription and for multiple users+ Works as a full pledged tablet (for parents :-))+ All apps from the Google Market are available (free games)+ Cheap (you could buy two for the price of a console with games)+ Small (right size for kids)+ Better protection than normal tablet (read the full review)+/- Battery time is short but could be better managed through a power saving apps (free)- Not fully rugged for kids (Rules, rules, rules)- No screen protection included (should have been... its for kids, please) (couple of $)- 4 Gb of memory is small (you will need from time to time to uninstall apps)-------------------------------------Depending on the age, manage the charging, the usage and the handling, and some other ajustements:- charging should be parent's task for a while.  I have to agree, on the first look the USB charging input has to be handle gently...not for a 4 years old.  The tablet can discharge within hours while unused.  There is not power management applets installed, install one.  I have installed \"Easy battery saver\"=> mostly 1,5 to 1,7x the normal play time.- Give proper rules to your kids; play while sitting comfortably, put it away to the charging station as soon as your finish, parents should activate the limited playing time feature (they have to return after a while, do not toss it away (buttons are exposed and could be broken).- Put on a screen shield- The rugginess could be overestimated.  The protection is better than normal tablet, but not as strong as the Nabi for example.In the kid mode, some games won't work unless you pay for them because they are sending publicity which is blocked by ZoodleFor the price of a console, you get unlimited free games for your kids and if you activate the Zoodle account, you will get all the review you need for almost every games available to google market, which is a good tool for concerned parents.", "Date": "May 16, 2014"}, {"Title": "Worse purchase ever", "Author": "Darla Davis", "ReviewID": "R2GLZZL78JJHLP", "Overall": "1.0", "Content": "We bought 2 of these for our girls at Christmas they lasted less than a week. Neither of them will charge. They played with it 2 days and the 2nd time we tried to charge it, neither of them would charge. They have not been able to play with them since.", "Date": "May 8, 2014"}, {"Title": "Poor product & customer service", "Author": "Dawn M. Reading \"momma70\"", "ReviewID": "R2F9VS4V9I48UX", "Overall": "1.0", "Content": "I purchased 2, & within the 1st week 1 screen was cracked, a month later the second was cracked...if it's supposed to be a unit for a child...it should be more child friendly...when I emailed them explaining what had happened they said they were covered under warranty and to send them in and they would replace them...when I received the package it had the 2 original units, not repaired our replaced like they told me...so not only was I without both units...I also paid shipping fees for nothing...I would not recommend unless purchasing for an older child...and the unit is not made for older children....", "Date": "April 18, 2014"}, {"Title": "dont like it", "Author": "mary brown", "ReviewID": "RH6TLFLSSGZGH", "Overall": "1.0", "Content": "it was not at al what I thought it was going to be. first one broke right off hand and the other you could hardly do anything on it. I wasted my money I feel but I also got middle sized really smart for their age kids I would recommend this for people who have toddlers", "Date": "March 11, 2014"}, {"Title": "avoid avoid avoid", "Author": "Amazon Customer", "ReviewID": "R3RIYOH567OBVI", "Overall": "1.0", "Content": "I can't say this is a bad product because Best Buy does recommend it for 6 year olds...the seller is HORRIBLE!!! I never buy used or refurbished just on the off chance there is more problems...I bought \"new\" and when my grandson opened the package it was not sealed. the tablet screen \"cover\" was not \"on\" (had wrinkles!!) and there were smudges on the screen!!!! the cables did not fit the tablet or the charger...RETURNING!!!!!", "Date": "March 8, 2014"}, {"Title": "Love it!", "Author": "B. Taylor \"praznhim\"", "ReviewID": "R3RGYJATDM1YS9", "Overall": "5.0", "Content": "my grandson loves it!!  I just only wish it had a silicone protective cover.  I'm not sure about the warranty works that I bought with it.  Just hope I wasn't ill taken for the warranty.", "Date": "March 4, 2014"}, {"Title": "So far happy but time will tell", "Author": "L. Darnell", "ReviewID": "R36PTLA04OWX98", "Overall": "4.0", "Content": "My little one has been wanting this for a while. Didn't read the review till way after order was placed and money payed. So far it's working fine and she is happy. Praying I don't encounter any issues.", "Date": "March 4, 2014"}, {"Title": "KIDS GAMES", "Author": "ruth hatton", "ReviewID": "RXYE1X9POPC5S", "Overall": "1.0", "Content": "SENT THIS ONE BACK .JUST WAS NOT IT SAID IT WAS ! AND WOULD NOT RECAMEND IT AT ALL FOR CHILDREN TO HARD FOR A CHILD TO UNDER STAND!!", "Date": "February 28, 2014"}, {"Title": "DO NOT BUY THIS GARBAGE!", "Author": "Ronnie Jenkins", "ReviewID": "RUTZ5ILK7LDZY", "Overall": "1.0", "Content": "This thing is garbage! My daughter had her minitab for less than 2 weeks, and the charging port broke on it. I hadto pay for shipping (plus insurance a totL ofabout $12 one way). They took 6 weeks to send me a replacement, and when itbroke again 2 days later, I write them telling them what happened, I got a reply saying that I was outside of the 90 day replacement warranty. After they took 45-50 days to getthe thingback tome. It is very cheaply made, and only comes witha 90 day warranty, because they know that it is a piece of GARBAGE! This toy, and this company are a joke. They do not stand behind their product I guess if I had to, I wouldn't either! It is a piece of garbage. DO NOT BUY THIS PRODUCT", "Date": "February 27, 2014"}, {"Title": "Tablet's not bad but...", "Author": "amy bason", "ReviewID": "RKUB67TG725MN", "Overall": "3.0", "Content": "I guess the tablet is ok but it took 2 weeks for me to get it! A week late for my 4 year olds birthday :( Expedited shipping fee was refunded, but that doesn't change that it didn't arrive for 2 weeks. Won't be buying from this seller again.", "Date": "February 24, 2014"}, {"Title": "love it", "Author": "Catharine McIntosh", "ReviewID": "R30WCBSXVHSTTN", "Overall": "5.0", "Content": "This product was excellent. It was a great price for what we got. I would have no problem recommending this to others.", "Date": "February 13, 2014"}, {"Title": "broken one", "Author": "wane", "ReviewID": "R1E1EGVPH4T73X", "Overall": "1.0", "Content": "this Ematic FTABMP2 4.3-Inch 4GB Fun Tab Mini Touch Screen Kids Tablet  no charge,no power, no good, the key was broken!!!!!!", "Date": "February 12, 2014"}, {"Title": "Entertaining.", "Author": "C. Smith", "ReviewID": "R2MX6ZPNZJ9FP8", "Overall": "3.0", "Content": "i bought this for my 2 year old grandson.  It was not quite what i had expected.  I do not think we are using it to its full capability.  He does play with it though.", "Date": "February 8, 2014"}, {"Title": "Poor  quality", "Author": "mike livingston", "ReviewID": "R2A2OM4PZUX7I4", "Overall": "1.0", "Content": "Our daughter in law purchased 4 of these tablets for our granddaughters ages 4-8, for Christmas. I'm attempting to repair 3 of them now. Of the 4 tablets, 3 have broken charging ports.Very poor quality.", "Date": "February 1, 2014"}, {"Title": "OMG", "Author": "Tybrown", "ReviewID": "R2KM7BVYRY9UAU", "Overall": "5.0", "Content": "My sons really enjoy this tablet. I love it because it's fun but also very educational. If your looking for something both fun and educational for your child get this tablet. It doesn't disappoint", "Date": "January 28, 2014"}, {"Title": "I Like IT", "Author": "Richard H Fuller", "ReviewID": "RU2KGFM3LGXM", "Overall": "4.0", "Content": "E.asy to use, Children find it easy to navigate,They find that operating it is simple and easy, Ideal larning tool,..", "Date": "January 15, 2014"}, {"Title": "Do not purchase", "Author": "sarah k anderson", "ReviewID": "R6MN9UA01A27G", "Overall": "1.0", "Content": "I have a five year old little girl who is not rough with toys, tablet only lasted a week with her. Good game selection, but that's it. Buttons kept coming loose and falling out, case didn't close  properly, and it quit charging.", "Date": "January 11, 2014"}, {"Title": "DON'T BUY!", "Author": "Chase Cavin", "ReviewID": "R3GTZ9KH9B6136", "Overall": "1.0", "Content": "I bought 2, 1 for a 2 year old and 1 for a 5 year old... they get Hot, screen quality is very poor.. you can go buy a 60$ tablet from walmart and get a better deal. They are not very kid proof one is missing the buttons already.", "Date": "January 10, 2014"}, {"Title": "Poor Quality", "Author": "Megan Morrison", "ReviewID": "R1GNUUBWUDWCY2", "Overall": "1.0", "Content": "Bought 2 of these for my grandchildren. After 2 weeks, the charger ports on both tablets broke. Not to much help from the company. Very bad design. Don't waste your money.", "Date": "January 9, 2014"}, {"Title": "Malfunction", "Author": "Natalie", "ReviewID": "R204SXK8HN88IE", "Overall": "1.0", "Content": "I really liked this for my son. When he got it for Christmas he loved it. Then the battery died and tried to charge, but tablet will not take a charge. I left to charge over 24hrs and still will not turn on.", "Date": "January 7, 2014"}, {"Title": "DO NOT BUY", "Author": "Humbleheart", "ReviewID": "R24MPQNMV05L4", "Overall": "1.0", "Content": "Hello shopper. I bought this item for my grand daughter for a Christmas present and it broke the same night of use, YES Christmas night the charger cord fell away from the unit and you could not use. Grand daughter was heart broke. This product must be defective cause I did read several reviews stating this same fact. Needless to say I have already sent back for a full refund.  BUYER BEWARE", "Date": "December 27, 2013"}, {"Title": "do not buy", "Author": "adam reed", "ReviewID": "RSKO5GK94SRKI", "Overall": "1.0", "Content": "Order one of  these and one of the 7 inch tablets and the mini is made cheaply and would not charge or power up but I say for the extra cost much better choice to go with the 7 inch better constructed and doesn't seem to be as cheaply made", "Date": "December 27, 2013"}, {"Title": "don't buy it", "Author": "Maryruth Pierson", "ReviewID": "R36E8Q54FK9627", "Overall": "1.0", "Content": "when you plug in to charge it the port falls into the game and breaks. not sturdy for children. a really cheap product.", "Date": "December 26, 2013"}, {"Title": "poorly made", "Author": "veronica williams", "ReviewID": "ROQ041BWCMRYQ", "Overall": "1.0", "Content": "My daughter dropped her tablet once and it split in half all the buttons went flying the power button became unsoldered and would not turn back on", "Date": "December 8, 2013"}, {"Title": "Seriously, Don't buy it!", "Author": "Christine", "ReviewID": "R2T4YKQLF5BJLR", "Overall": "1.0", "Content": "The plug in part broke after about a week.  We sent it back to the company, and three months later we got a replacement.  After a little use, it will no longer charge.  Total crap.", "Date": "December 5, 2013"}], "ProductInfo": {"Price": "$69.99", "Features": "Android 4.0 Ice Cream Sandwich, 4.3 inches Display\nA8 1.2 GHz\n4 GB Flash Memory, 0.5 GB RAM Memory\n5.5-hour battery life, 0.28 pounds", "Name": "Ematic FTABMB2 4.3-Inch 4GB Fun Tab Mini Touch Screen Kids Tablet (Blue/Green)", "ImgURL": "http://ecx.images-amazon.com/images/I/41PZSwCj-qL._SX300_.jpg", "ProductID": "B00BMJCQ96"}}