{"Reviews": [{"Author": "Skippitydoodah", "ReviewID": "RJH8O6AZQ2J2P", "Overall": "4.0", "Content": "I have had my mini laptop for less than a month; babied it, was very careful with it, allowed no one else to use it; only checked my emails on it and never downloaded so extra space was not taken up and it has already died on me.  Our last resort was to hit the reset button and that was done this morning and nothing!  So, I'm not a happy camper.  I don't have $105 to waste and now I see it's $115.00.  I recommended to a friend to buy this and I messaged her this morning to please not do so.  Now I am back to borrowing a computer and I'm not happy. I sub so I have limited income and thought \"wow, here's something I can afford\" but it was a waste of money and I don't have the funds to go purchase something else.  Also the battery only lasts for under an hour; I initially charged it 6 hrs as it said, actually overnight and it's never lasted longer than an hour so that's a down fall.  I don't recommend that you buy this; I'm not saying this to be mean, but rather to protect other buyers.", "Title": "Mini Laptop", "Date": "May 18, 2013"}, {"Author": "Edward W. Sanders", "ReviewID": "R3AXNWVYCY8HWX", "Overall": "5.0", "Content": "When my Android computer arrived, it had one minor issue. I e-mailed the seller and the problem was solved within a few hours. So far, the computer has been operating as it should. So, I would highly recommend using Goldengulf for you computer needs. Update as of October 16, 2013; I contacted Goldengulf about my daughter misplacing the power cord for the computer. Goldengulf immediately sent a power cord and didn't charge me for it. If I need anything they sell, I will choose them first. I am more than 100% satisfied with Goldengulf.", "Title": "Use Goldengulf!!!", "Date": "September 5, 2013"}, {"Author": "Jessica", "ReviewID": "R20ECIRAE5V7UD", "Overall": "5.0", "Content": "My daughter loves it.  Now she can write from anywhere not just at her pc, so inspiration comes from any place she wants to be.", "Title": "great little laptop", "Date": "December 22, 2013"}, {"Author": "carly mcalpine", "ReviewID": "RAYJ610Z3SYO3", "Overall": "5.0", "Content": "it is the best mini laptop. im having fun working on it. its light and i love it. thanks alot", "Title": "i love my mini laptop. it is great.", "Date": "November 29, 2013"}, {"Author": "Lilspig", "ReviewID": "R23T8N1KWHLSGM", "Overall": "5.0", "Content": "IT IS SMALL ENOUGH THAT IT FITS IN YOUR SCHOOL BAG AND DOES NOT MAKE IT HEAVY.  HAVE ENJOYED USING IT FOR CLASSES", "Title": "GOLDEN GULFT MINI LAPTOP", "Date": "January 22, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3M9OPHP5YF2A3", "Overall": "5.0", "Content": "I needed a laptop and wanted to stay away from Windows for various reasons.  Also had to work from a small budget!  I decided to try this, and I'm glad I did!  I do a lot of word processing, and this netbook came with a word processing app pre-loaded, not just games, as on a couple of tablets I've had.  I have a ton of Kindle books, including several \"complete works\" collections:  download speed was impressive.  Works great on or offline, I love the optical mouse that was included, just a lot of bang for the buck all around.  If you're a gamer or spend a lot of time watching videos, I don't know how it might work for you:  for productivity, however, I don't see how it can be beat, for the money!", "Title": "Love this Netbook!", "Date": "August 31, 2013"}, {"Author": "Kayleigh", "ReviewID": "R1P1JHF98P3V4I", "Overall": "5.0", "Content": "I bought this for my 6 year old for Christmas and its done exactly what it said it does, its only used for playing games mainly and a few other things but considering it cost 120 euros I couldn't have got it at a better price.  I've now had it over a week and I read the reviews after I purchased it and was slightly worried but no its still all in perfect working order", "Title": "As Expected", "Date": "January 2, 2014"}, {"Author": "linda  ramirez", "ReviewID": "R1405RFGRTO8EY", "Overall": "5.0", "Content": "very nice, more than what I expected I was very pleased with this my kids love it I ordered two highly recommended", "Title": "very pleased little laptop", "Date": "November 26, 2013"}, {"Author": "Thomas Blackmer", "ReviewID": "RVC1KXOIWW8UK", "Overall": "5.0", "Content": "I bought one of these notebooks for my daughter for Christmas she used it so often but we were in need of a new cord for charging when I was unsure what it needed I contacted the company Goldengulf and they are sending me a new charger free of charge! And since we are on opposite sides of the world that is no easy feat! Thank you for knowing what customer service is all about!", "Title": "I was treated like a king!", "Date": "March 24, 2014"}, {"Author": "Constance Jordan", "ReviewID": "RLUOOBK2UQUG7", "Overall": "5.0", "Content": "My 12 year old grandson, who found this computer on Amazon,  loves the computer.  Not only is it economical where I am concerned but it is excellent for him to take to the library, to tutoring and to school.  It is very lightweight and fits into his backpack and it keeps him off of my desktop computer.  It has Wifi and a camera although we haven't used the camera yet.I am going to order one for myself for traveling.", "Title": "Goldengulf 10\" inch Mini Laptop Netbook Android Computer Notebook Wifi 3G.", "Date": "September 23, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00BPMGJJ8", "Features": null, "ImgURL": null, "Name": null}}