{"Reviews": [{"Author": "Melissa Webb", "ReviewID": "R18IOLDQUZMHV6", "Overall": "1.0", "Content": "It was not the same product ordered AND it was VERY defective. Not just one thing wrong with it but MANY!! At this time of year, when many products ordered are for Christmas gifts, this is inconvenient and highly UNACCEPTABLE!!! I've ordered the same tablet from this seller previously and was very pleased about the service and the tablet, it was better than I expected. And so I wanted to purchase another as a Christmas gift for my nephew. Needless to say, the second order from AFUNTA was a MISTAKE! This tablet was TERRIBLE!!! I DO NOT RECOMMEND AFUNTA ANY LONGER. This first time I ordered, AFUNTA was given 5 stars and a great review. This time I have no choice but to give 1 star, there's no option for no stars. Also, the seller gives his email to contact him for questions or defaults but then has said email sending automated replies that \"customer service is unavailable at this time.\" UGH", "Title": "UNACCEPTABLE AND UNEXPECTED SERVICE AND PRODUCT", "Date": "December 6, 2013"}, {"Author": "Darrell R.", "ReviewID": "RGBLFB70MC6H9", "Overall": "1.0", "Content": "did not work. when its plugged it works and says charge 100%, but does not work on battery. bad product", "Title": "poor", "Date": "June 5, 2014"}, {"Author": "sho2kan1", "ReviewID": "R2RX1SWRGCR3N8", "Overall": "2.0", "Content": "Cheap looki g, my 8 yr old dropped it and the screen shattered instantly, you get what you pay for, my samsung galaxy is awesome", "Title": "cheap", "Date": "January 1, 2014"}, {"Author": "hazel osmond \"osmond\"", "ReviewID": "R1OTCEKO1FKIJB", "Overall": "1.0", "Content": "this product is s***, I was very disappointed with i brought it for son as a xmas gift and never and not working not coming on all it is saying  battery need charge I regret buying that s***-+", "Title": "I HATE THIS PRODUCT", "Date": "December 26, 2013"}, {"Author": "Christy Roy", "ReviewID": "R3O2O8L07VTAVS", "Overall": "4.0", "Content": "This tablet was for my 9 yr old son, decent price and the quality of the image is not bad.  He is very happy with this tablet!!", "Title": "good product for a good price", "Date": "November 6, 2013"}, {"Author": "cecilia anderson", "ReviewID": "R1E64E47VTCVI5", "Overall": "1.0", "Content": "Product did not work properly. It would freeze up all the time making it impossible to do anything. It was cute tho.", "Title": "Disappointed", "Date": "October 9, 2013"}, {"Author": "Emily Julian", "ReviewID": "RL2BFYXJMER8U", "Overall": "2.0", "Content": "The graphics are poorYou cant use it outsideSpend the extra on a galaxy:)Was returned without any problems.", "Title": "Not worth it", "Date": "July 6, 2013"}, {"Author": "shawn Dodd", "ReviewID": "R1AA5FJLCYZ8SF", "Overall": "1.0", "Content": "This item needs to be taken off the market it doesn't booth pass android n if it is reset the touch is disoriented", "Title": "no good", "Date": "June 12, 2013"}, {"Author": "bo", "ReviewID": "R2MTMY0FZ2RVE7", "Overall": "1.0", "Content": "This was a disappointing experience.the camera at the back of the tablet was not working on the first day I received it.", "Title": "disappointed", "Date": "May 22, 2013"}], "ProductInfo": {"Price": "$65.95", "ProductID": "B00BXA8E7W", "Features": "9.2\" multi-touch Capacitive screen, 800x480 pixel\nAndroid 4.0.4 Ice Cream Sandwich, Camera\nCortex A8 at 1.5GHz\n512MB RAM, 8GB storage\nSkype video chat, HD games ,Netflix Movies", "ImgURL": "http://ecx.images-amazon.com/images/I/41Fiy43xsSL._SX300_.jpg", "Name": "AFUNTA 9.2'' Google Android 4.0 512mb/8gb Tablet Camera Capacitive Multiple Touch Screen G-sensor A13 Tablet, 3d Games Skype Video Calling, Netflix Movies, Dual Camera (black)"}}