{"Reviews": [{"Title": "Not bad for a cheap 9 inch no-name tablet", "Author": "M. Hill", "ReviewID": "R3P0XU2SXNITBM", "Overall": "4.0", "Content": "The thing to keep in mind is that this is a dirt cheap no name tablet, I had low expectations from it. I picked it as a spare, something that if lost or damaged wouldn't be a big loss. Frankly the 9 inch screen was an attractive upgrade from all the 4.3 or 7 inch ones in the same price / feature range. I have had this for about 4 days now.  My first impression was its cheap, lighter then my 7 inch Novo 7 the touch screen appears to be plastic. You really want to get a screen saver on this, there is a thin plastic film on the tablet you should leave in place until you get one.  On the plus side the little bugger is fast booting, that being said it also has some lag when loading screens or apps. I really cant say its much worse then other single core tablets, for example the lag is marked when loading long app lists, you have a few (10 to 30) seconds to wait. In general there will be a lag when loading.  On the plus side. Google Market (Play Store) is real and working, Amazon Market works well. I put Angry Birds, Angry Birds Space, Fruit Ninja, and Net Flicks apps on it, all run well.  I added an Epub viewer and PDF viewer, both are quite nice and work well. Movies on Netflix were clear and played well.  I replaced both the keyboard app and launcher quickly, the keyboard is just rubbish, you can find better free ones. I used the GO Launcher EX for a better look and feel, there are a number you can try. WIFI range seems good, about the same as my cell phone. Battery life: I can watch a full movie on Netflix, or read a book for about 4 hours. I really have not tried to go past that yet, I tend to trip over things walking around reading or watching a video. Id guess 5 to 6 hours with wifi off.  Overall its not that bad, the lag is a bit of an issue, but try my cell phone for lag.Just some notes:  The A13 chip used in these is limited version of the A10 chip, things like video output and a hardware Ethernet port are not included, you get 1 headphone jack and a single usb port. The plus side is the chip runs cooler and the battery drain is less. This means a cheaper tablet can be built with fewer ports, using the A13 and a smaller battery, and still keep pace with the A10 based tablets.Speaker: On the back one speaker, good for beeps, get a rechargeable or headset for movies / MusicBestDealUSA Black Mini Bomb Rechargeable Mini 3.5mm Speaker For PC Mobile PhonePorts:1  Micro USB  (Noted in manual can be charged this way.  Tested and it works)1  Headset  Stereo1  Wall Charger1  SD Slot upto 32 GB  (16 gb tested)Inside the generic box along with the tablet you get 3 Adapters and a manual:1 Micro USB to USB  M Synk / Data cable (The manual states you can charge with usb, this tests as working.)1 Micro USB to USB  F OTG for flash drive etc.1 Wall ChargerManual: Generic - do not expect much.I posted this months ago, considering the reviews I thought I should add a bit more.First off mine still works as noted in the review.Keep in mind is that these are generic, units will very and fail at a greater rate then a name brand. For what it is this is a decent little unit, if you want something better the name brands run about double.Some things to note: Some apps will cause the unit to reset. I have a Samsung Galaxy Tab 2 and a Novo 7 tablet, both have this issue, in fact this is much more stable then the Novo on a par with the Samsung for that issue. Remove the last run installed apps and that should fix it.I have been told, but have yet to have issues with loss of wifi or rebooting when the charger is plugged in and I'm using the tablet.Use an SD card for file and app storage, if the system resets you will not loose your data.This video covers basic use of a tablet, better then the manual anyhow. [...]If you get a unable to boot failure, leave it along for a few hours, hook up the battery charger and try a reset or holding power.  On some A13 tablets that look dead (will not power up), you hold the power + key down and press or tap the power key, if this works it will reset the firmware to factory. I have not tried it on mine, no reason to. But its worth a shot if you run out of options.", "Date": "February 9, 2013"}, {"Title": "tablet", "Author": "Ronnie Prime", "ReviewID": "RM8DZ5BXXBMHS", "Overall": "4.0", "Content": "great tablet for my kids they love it there on it all the time cant get them too do any thing else", "Date": "May 6, 2013"}, {"Title": "Great tablet for the price", "Author": "Librowork", "ReviewID": "R1P329YL8KMHSF", "Overall": "4.0", "Content": "The tablet is pretty fast, but it does take some time to load once you have a lot of apps. One feature that is odd is that it will let you know that there is no more space on the home screen for an app, and it will make room to do so. I have had a few glitches with the apps, but google play works very well. You will need to still use a credit card to be registered, but there are many free apps to choose from. Overall it is nice to use, and handy as a second device.", "Date": "March 11, 2013"}, {"Title": "AMAZING!!!!!", "Author": "Angel & Pat Reilly", "ReviewID": "R48EVIZIOUKUS", "Overall": "5.0", "Content": "I bought this for my husband & we both LOVE it!!!! It is very easy to use, very attractive and lite. It has great picture & amazing speed on the internet. It is faster then my laptop is. I'm kinda wanting to order one for myself now...maybe I get it for Christmas!!  Anyways I recommend this to ANYONE!!!! <3", "Date": "October 1, 2013"}, {"Title": "Love it! Time to get the kids one", "Author": "Taquisha Farris", "ReviewID": "R3LO964RN64CYZ", "Overall": "4.0", "Content": "I love everything about it, except sometimes it freezes up but besides that its very handy. Plan on getting another one but bigger", "Date": "July 17, 2013"}, {"Title": "Nice Cheap Tablet", "Author": "Christopher M. Woodard \"Commander Viper\"", "ReviewID": "R14GCBS5NKQZWK", "Overall": "4.0", "Content": "Cons; Tablet is a little on the slow side and has trouble multi-tasking.Pros; Nice 9\" tablet can do what most other tablets can do for real cheap, I watch netflix with no problem even with poor wi-fi connection though it may be slow to start up at first.  Other wise its a nice tablet for real low price, great for google fans.", "Date": "April 27, 2013"}, {"Title": "Nice tablet", "Author": "Amazon Customer", "ReviewID": "RXJVGJNVMBXCE", "Overall": "4.0", "Content": "My daughter is happy with this tablet.  And for a 16 year old, that's all I can ask for!  Thanks!", "Date": "February 19, 2014"}, {"Title": "9\" tablet", "Author": "htmcc", "ReviewID": "R19HZXMTLNXRHX", "Overall": "4.0", "Content": "The tablet is a little slower than the last one (from a different manufacturer).  Everything works for Grandma as hoped.  I would not buy this unit if you are in a hurry, but for Grandma to stay in touch with her grand kids is great.  I like that this unit has a standard Micro USB charging port which is the same as many devices.", "Date": "August 26, 2013"}, {"Title": "Love it", "Author": "Sherri H", "ReviewID": "RX2ENX95WP3D8", "Overall": "5.0", "Content": "Love this tablet and at a great price. My family loves this tablet, and we saved much money for the total price and still had extra left over to buy a case.", "Date": "April 23, 2013"}, {"Title": "best little tablet.", "Author": "debra hall", "ReviewID": "R3URU9K4KURW7O", "Overall": "5.0", "Content": "I brought 2 of these for my daughters. These tablets are fast, easy to use, speakers are even great . Mosst importantly is the girls love them,", "Date": "June 1, 2014"}, {"Title": "Not what I expected", "Author": "Edwin Johnson \"Ed\"", "ReviewID": "R1QGX9XCYLE0S4", "Overall": "2.0", "Content": "The advertisement said that this product already came with Netflix, and Youtube installed and that wasn't so.  The item did not come with those software and the Wifi card sucks; you have to be real close to the router to have access.  This is kids stuff.  I would buy another one as a kid present.", "Date": "May 21, 2014"}, {"Title": "enjoy my tablet", "Author": "Shirley Mayes", "ReviewID": "RFGU4IRW17R17", "Overall": "5.0", "Content": "I receieved my tablet and enjoy it. I like all the features and it is what I wanted for my needs.", "Date": "May 17, 2014"}, {"Title": "disappointed", "Author": "Tess Harden", "ReviewID": "RJ8MGPWJ14P50", "Overall": "2.0", "Content": "its not that i dont like this, but it wouldnt let some apps load, it is slow and i couldnt get the internet browser to load more than half the time..... i just thought it would work a little better.....", "Date": "March 29, 2013"}, {"Title": "Idolian suport", "Author": "Francine", "ReviewID": "R9PY577IHI0HM", "Overall": "2.0", "Content": "At first I was happy enoug with a low priced tablet, but then I started having trouble with \"failure to launch\" messages. It would  not hold the current date and time and finally it couldn't authentic my WiFi.  My first attempt to get support was ignored, but my second request was answered by \"Escobar\", a very nice young man who was very helpful and in the end offered me a new tablet.  I am waiting anxiously to receive it.  I really hope it works as I love some of the features, the camera, the touch screen and all the apps that it came with.  It only has a 2 hour charge on the battery, but I can deal with that.  Will keep you posted.  Francine", "Date": "May 19, 2013"}, {"Title": "Terrible - not worth the price", "Author": "New Sue Review \"RckyMtnMama\"", "ReviewID": "RWV5K08BPSWFJ", "Overall": "1.0", "Content": "I know that Amazon has an issue with electronics sellers creating multiple accounts under different names because the bad reviews pile up, so I was skeptical that this was probably one of those companies selling cheap knock-offs. Yes, I bought it, and yes, it arrived on time, but after that the experience has pretty much been downhill. My 8-year-old, super-responsible son (who saved his money for a year to buy a tablet) bought this - and within 2 days the glass was scratched up just from sliding your fingers around (which is supposed to be what you do with a touch screen). The charger port doesn't fit very well - so he asks me to plug it in so it doesn't get bent and rendered unuseable. If you want a cheap throw-away for a 3 year-old that will break anything you put in front of them anyway, then go ahead and buy several - you'll need to, these won't last even if used with care...", "Date": "May 19, 2014"}, {"Title": "would not purchase again", "Author": "jennifer gray", "ReviewID": "R2D2EYVKQLNUW4", "Overall": "3.0", "Content": "Dont like that part of apps and keyboard is in Chinese.  Had been working fine, battery life is about 2 hours.", "Date": "April 30, 2014"}, {"Title": "simbians", "Author": "Leona Thompson", "ReviewID": "R294171MYMDCPG", "Overall": "1.0", "Content": "Hated this tablet! Had to return it because it gave me too much trouble! Would NOT recommend this tablet to anyone!", "Date": "March 25, 2014"}, {"Title": "piece of crap", "Author": "carrie nims", "ReviewID": "R27662M0ZHVA9O", "Overall": "1.0", "Content": "It stopped working after one week and was takin excellent care of waste of money bought books i csnt read because it wont even turn on", "Date": "November 16, 2013"}, {"Title": "Broke", "Author": "Chris", "ReviewID": "R3KGRQ12CRFDIP", "Overall": "1.0", "Content": "This product broke within the 1st month of purchase. Very disappointed. This was a birthday present and now will have to send back.", "Date": "May 19, 2013"}, {"Title": "Doesnt work", "Author": "Amazon Customer", "ReviewID": "RQFFYF3BB5LX5", "Overall": "1.0", "Content": "I am very dissappointed with this product. It took over a month to come in, and when it did I immediately started playing with to see if it was working probably. It lasted maybe two hours, and then i plugged it in to charge. It sat on the charger for 4 hours and didnt reach above 0%.  I contacted the seller to see if they would send me a new charger to start with, and then possibly a new tablet altogether if that did not work. The seller is clearly not fluent in English and made no sense in the emails they sent me. They asked me to send them pictures of the product?? I found it strange. Anyway, I am returning the product all together for a full refund and I will buy a tablet elsewhere.", "Date": "March 22, 2013"}, {"Title": "buggy and cheap, totally disappointed", "Author": "cory lee brunelle", "ReviewID": "R3E4IA68UEDCVZ", "Overall": "1.0", "Content": "Spend a little more money and get something better, ready to throw it into the trash it is so buggy and disappointing.Crashes often, deleted your apps for no reason, then your entire home screen is wiped and you have to to go through and place all your apps all over again... all the while you have no idea what the hell just happened... anyhow, do yourself a favor and look for something better", "Date": "March 7, 2013"}, {"Title": "didn't work right", "Author": "MStraviesa", "ReviewID": "R12MG0RWOWHAJ3", "Overall": "1.0", "Content": "I got the item and it did not work right.  First of all it was sent in a envelope inside it was wrapped a couple of times in bubble wrap the instruction booklet looked like it was photo copied and stapled together and was so small it was hard to read.  As I told the seller all that could of been over looked if it had worked properly. The thing had problems when I tried to type something, it would put a whole bunch of letter not the one I wanted.  Also when I tried to pick out something like touching on it something else would get chosen. Then when I asked to return it they wanted pictures of the packaging.I will not be buying from this seller ever again, to much trouble.", "Date": "June 25, 2013"}, {"Title": "It didn't work", "Author": "Amr Arafat", "ReviewID": "R2661QAFZGTQXM", "Overall": "1.0", "Content": "After using it for one week, the tab stopped working and each time I plugged it in the charger it became very hot to the degree that the back cover is melted!This is really a bad tab and I don't recommend. It is full of manufacture defects (slow, stop working, problems in the software...)", "Date": "September 29, 2013"}, {"Title": "The product could have been better, but I'll still work with it.", "Author": "Shantel Minto", "ReviewID": "RNO4I1PBBDW5I", "Overall": "2.0", "Content": "1. I wish the camera was a lot better.2. I wish the music/ video's volume was louder.3. I wish the screen was a lot brighter.4. I wish the WiFi would connect better.5. I wish the product had duel cameras.* The product looked nothing like the way I seen it on the pictures, I'd rather have the galaxy tablet then this.", "Date": "July 10, 2013"}, {"Title": "It has no wifi range 10 feet max", "Author": "harry wood", "ReviewID": "R24PPLGHZI8ONO", "Overall": "1.0", "Content": "It did not work out of the box and I had to return it. it had several issues I would not recommend anybody getting it", "Date": "April 10, 2013"}, {"Title": "Really!?", "Author": "lioness", "ReviewID": "R2NBDW5K58ZMZW", "Overall": "1.0", "Content": "I would not recommend this tablet to anyone! I had it for less than 30 says(way less) and I had to reset it. I lost all of my important documents! Not worth the money at all.", "Date": "April 1, 2013"}, {"Title": "I Love My Kindle", "Author": "terry", "ReviewID": "RA615XCOXTWX1", "Overall": "5.0", "Content": "The picture is great. The price is great. The Kindle is very easy to use. I am going to get one for my daughter also.", "Date": "March 20, 2013"}, {"Title": "NEW 9 Inch Google Android 4.0 Tablet PC 8GB, A13 1.2Ghtz Multi Touch...", "Author": "Carol Howton", "ReviewID": "R2UBPWI7L5KC8U", "Overall": "5.0", "Content": "This was a gift for my grandaughter who just got it 2 days ago.  She was so happy that I bought it for her.  She had been using one before this, and this is a far better tablet than the one she had been using.", "Date": "February 15, 2013"}, {"Title": "tablet not in English", "Author": "Jenifer", "ReviewID": "R3DHROE0CP1HRD", "Overall": "1.0", "Content": "Can't use this tablet, as it is not in English. The directions are worthless. Save your money & buy something else.", "Date": "March 3, 2013"}, {"Title": "Bogus!", "Author": "yanira", "ReviewID": "R6RUM4LMFZTRH", "Overall": "1.0", "Content": "Bought this for my birthday present for my self on April 25th received it on May 4th i was over joyed in receiving this item.. but as soon as the battery died that's was the end of the tablet. Customers do me a favor and invest and spend a few more dollars and buy you a name brand tablet! this is not worth it. I wish I would have read the review before purchasing. Lets see if i can get my refund back without a hassle...", "Date": "May 6, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B08IO7C"}}