{"Reviews": [{"Author": "Mark", "ReviewID": "R3Q5T7XAL4D5X2", "Overall": "5.0", "Content": "Shocked that theres hardly any reviews on this thing yet. I just received my new g-tab 3 days ago and I'm very pleased with it. I was a little worried about buying it because it's cheaper than the zeepad and couldn't find any info on it so I expected a worse performing device but I was wrong! I own two zeepads for my kids and while they are about the same I have to say that the g-tab is a much better device. It lasts a lot longer on a charge. The kids have to keep charging the zeepads and they never last long when were away from the house. About 1-2 hours max for the zeepad and 2-4 hours for the g-tab. It also doesn't freeze up like the zeepads do like every 15 minutes. The kids are used to it though and I hear a whine every now and again when they are in the middle of a game and it locks up on them. Havent had this problem once with the g-tab! The screen also seems better with it. The wifi is faster too but the best part is the price. $10 cheaper than the zeepad!! Wish these were for sale earlier. I want to buy more but it says there's none available on here. I hope its in stock soon!", "Title": "Just like the Zeepad... except better!", "Date": "February 2, 2013"}, {"Author": "Maggie Godwin", "ReviewID": "R15KGBZ4JL9C3Q", "Overall": "5.0", "Content": "This little tablet is great! I expected it to be low quality because the price is so low. It works like an expensive tablet! I love it. Sometimes it's a little slow, but it catches up quickly. Great product and great quality.", "Title": "Great little tablet!", "Date": "February 12, 2013"}, {"Author": "strawman", "ReviewID": "R8JZRFY8NJC3B", "Overall": "3.0", "Content": "UPDATE:I decided to return these tablets. I had funky software issues with more than one of them. I had already returned the device that wasn't working well plugged in for a replacement. I had software issues on 2 more of them (Angry Birds stopped working on one with just a black screen and the play store wouldn't connect on the other), so I decided to download the image from their website. That process is really easy and takes just a few minutes, but after applying the new .img to it, the g-sensor/tilt no longer worked (and the build date was older in the \"about\" settings.) An email to the manufacturer the other day wasn't immediately returned and I tried to call but it went to a cell phone voicemail mailbox. Ultimately I decided that in the long-term I'd be better off with something else from a mainstream manufacturer so I decided to spend the extra money on refurbished Nexus 7s instead.I dropped it a star in the review for the troubles but I won't give it just 1 star. This is still a good budget device if you're going to use it for a basic reader...but for $100 more you can get a refurbished quad core Nexus 7 with a way better screen, twice the memory, and 3x the battery life.Original Review:For the cost, these little tablets are great for kids. As others have stated, the build quality on these is actually pretty good for the most part. They do feel nice and solid, the touchscreen is responsive, and overall they work really well. I bought 4 of them so I've had quite a bit of time into getting them set up. They come with pretty much nothing but the play store loaded, which is great. It is most definitely nothing like my Transformer, but you shouldn't be expecting that now should you.A few issues:1) The touchscreen can be a little screwy if you have the power cable plugged in. I haven't always had good luck  with using the device plugged in, which can be a problem sometimes since battery life is only 3 hours.2) These don't charge via USB. If you do have it hooked to a computer, it will say it's charging, but it's not. If you plug it into a USB charger, it won't do anything. There's a separate power plug and power cable - plan on using it.3) The main issue I had with the devices was related to the external SD card. I bought a 32gb SD card for each device, which it recognized and I could access from the Android file manager, but third party apps (like plex) couldn't access the SD card. They would get 'access denied.' I was able to track this down to an issue with the platform.xml file in /system/etc/permissions. If you plan on apps writing to an SD card, you will need to root the device and modify this file as follows:The simple solution, if you're rooted, is as follows:1. Using a root-enabled file manager, navigate to /system/etc/permissions and make sure you have mounted the file system r/w.2. Edit platform.xml and find the WRITE_EXTERNAL_STORAGE permission.3. Add an additional group definition for this permission...<group gid=\"media_rw\" >4. Save the changes to the file.5. Restart your tablet.(Source: xda-developers post 20869996)Before I did this process, I didn't even check if they were actually rooted. I see another review says they are...so if so, bonus! If not, you can root pretty easily. I'd suggest downloading Root Checker to check before doing this.(UPDATE: after a fresh software load from the image on their website, the device IS rooted. I'll leave this here for historical reasons! It's pretty much not necessary to do any of this)To root, you need to download the the following:* Android USB drivers from PDANet+* Root_with_Restore_by_Bin4ry_v25 (xda-developers thread 1886460)Without further ado, this is how I was able to do it:* Install PDANet+ to load the USB drivers.* Go into the settings -> {} Developer options of your tablet. Make sure USB debugging is enabled* Connect it via USB.* Extract Root_with_restore and run the batch file inside* Pick option 1, then option 1 againYour device will restart and you're good!Once rooted, I found it easiest to email myself the file, modify it on my computer, then just copy it back in from my SD card. I did have to change the permissions on the \"permissions\" folder as well as the file to get it to stick. I just made them 777. I used the \"Root File Manager\" app to do all that.Whew, all that, just so my kids could store their synced movies on the device for our spring break trip. Anyways, I digress...Just a final note. I, or Amazon, or anyone else but you take no responsibility if you screw this up or it jacks your device. For peace of mind, I have been able to (successfully) re-image two of these devices from the stock firmware downloadable from Matricom's webiste so there's always that option. I was able to successfully do this process 6 or 7 times.", "Title": "Great budget device", "Date": "March 30, 2013"}, {"Author": "D. Hill", "ReviewID": "R295EPBA56HRMA", "Overall": "4.0", "Content": "This is a VERY reasonably priced Android tablet, with few MAJOR issues, but a few quirks you should be aware of.  I bought 2 of these, one for me to play with, and one for my 9yr old daughter.  Buying it for her instantly ended the requests for \"her own cellphone\", since all she really wanted was something to play games and access the app store.I don't want to discount the qualities of this table with \"you get what you pay for\", because in many ways it's a really incredible value.  BUT...the screen is great, because you get what you pay for.  You want a higher resolution or more responsive screen, you're going to pay at least $100 more.  The sound is great, you get what you pay for.  The A/C charger works, but you get what you pay for (relatively short cord, and it sometimes gets pretty warm to the touch).  I have had ZERO issues with Wi-Fi, it connects right away to our network and the speeds are adequate for streaming video from our home server, as well as apps.Battery life, as others have stated, is horrible.  If you play games or watch videos (which is a big part of tablet usage), it will suck the battery down.  The exact same thing happens on my MUCH MORE expensive Samsung Galaxy S3 phone, so you can't really blame the tablet.  In standby, or doing email and internet, it's not that bad.  Again, consider how LITTLE this thing costs, and keep that perspective.  But also keep in mind that video and graphic intensive apps will very quickly deplete the batter of any device.I tested it with MaxGo (the Cinemax streaming app), and playback was fine.  Sure, it got a little choppy sometimes, but it installed and played without a hitch, while many other users of that app had complaints about it not working with their device.  I used it with the PlayOn app, playing local and streamed content, and it worked with no problems on video and music.  We're on a wireless N network, with an 18Mb internet connection, we had no complaints or issues with the tablet in that regard.I had no problems at all with the devices recognizing our 16GB SDHC cards, and have had no issues using the application manager to load apps to the card, as opposed to internal memory.Also, I connected one of the tablets to the computer via the micro-USB port, and not only did it work without issue, it also appeared to be charging the device.  I've seen customer comments stating otherwise, but in our experience, this was not a problem.  Whether a USB cable-based A/C charger would work, I don't know, I haven't tried that.  But it did charge while computer-connected.Now, for the quirks.It appears that both of our tablets (and many others sold by the manufacturer) were formatted using the same android image.  Somehow, this corrupted any unique hardware identifier code in the devices, and there are several apps (especially games, like everything from Team Lava) that do not use username or email authentication, but rather tie an app to those unique device identifiers.  all of these tablets have the SAME identifier.So, if you load those apps, instead of your own unique game experience, you are transported into the existing game of someone from the company, because progress is not stored locally on the device, but rather on the app developer's servers.  I emailed the company about this a week ago, and have heard nothing in response.  So, they lose a star for customer service.  Also, the company website, as of this writing, contains no information about this device, other than that it exists, and directs you to amazon for all information pertaining to it.There are some games, newer and more graphic-intensive, that do not render correctly on this tablet.  Candy Crush Saga and Jurassic Park Builder, are examples.  So, you may have to do some trial and error testing to see if your desired game will look right or not.  Again, going back to my previous point, you get what you pay for!I've seen complaints about the screen (you get what you pay for!).  It has a narrow 'sweet spot' on the viewing angle.  If you get off-axis, text gets blurry and brightness drops way off.  But, if you keep that in mind and hold it accordingly, I think it makes a passable e-reader, webpage browser, email viewer, or whatever.  It would probably never work outdoors, but I think for some late night reading in bed when you didn't want to disturb anyone or turn on a light, it would work.It may sound like I have negative feelings toward this tablet, but seriously, it is an AMAZING value for what it is.  It's great for youngsters new to the mobile device world, as it gives them an entry point at a low price, so if it DOES get damaged (inevitably it probably will), you aren't out hundreds of dollars.  My daughter is very happy with her tablet, and I'm happy with mine.  It's incredible that something this inexpensive can do as much as it does.I'd recommend it to someone looking for an inexpensive tablet, or even someone interested in learning more about Android, and rooting devices.  It's a nice platform (already open) for learning how Android works, and since it doesn't cost much, there's less risk involved.It is exactly what it claims to be, and it's very good for what it is.Obviously, if you compare it to a kindle, a nook, ipad, nexus, or whatever...it will come up lacking.  But, for this price, I think it is an excellent value, even with its quirks.", "Title": "It is what it is, and yet it's still pretty good", "Date": "June 13, 2013"}, {"Author": "mike d", "ReviewID": "R2P86GOBWNCX87", "Overall": "5.0", "Content": "For the price, can not go wrong for internet browsing and email as a disposable road warrior.Assuming that it proves itself with durability.  Purchase a battery backup to enhance its runtime and a generic keyboard, all for sub $110,  you can't go wrong.  Purchased the Okeba keyboard case for under $10 and a QQtech 11200mAh power bank battery for $30, all here on Amazon. Can type, surf, email, youtube, and should  have enough power to run for hours.  Appears that all keyboard cases are generic and the same so should work.And if you drop it, wont be crying all the way to the bank if it were a mini or galaxy tab.FYI, needed an adapter which I had for the keyboard. But it didnt work until  adapter rubber was cut to allow proper fit further into the port.NOTE - MAXIMUM BENEFIT OBTAINED WITH FULL AND PROPER INSERTION! ;) lol. Many have complained keyboard doesnt  work with adapter, wonder how many didnt have a proper connection. Deep set port.For the money, fully functional. Temper expectations, no not a +$300 Apple Mini, but then you still have $200 plus tax to go on vacation, buy a mothers day gift, pay for a couple years of netflix, etc...If durability shows itself and lasts till obselescence or the next great cheap thing comes along, would we say wise?Time will tell. But like anything of modest means, adjust accordingly. Look after the little guy, probably more fragile  than the more expensive knockoffs, :)", "Title": "Greeat Value and generic keyboard compatible", "Date": "May 3, 2013"}, {"Author": "Brett Dozmati", "ReviewID": "R2D5T9MKXYK4ZQ", "Overall": "5.0", "Content": "very good tablet for the money,couldn't be happier with this tablet, only flaw I have found is the battery life isn't long enough. but for the price  I cant complain.", "Title": "great tablet for the price", "Date": "March 16, 2013"}, {"Author": "Computer WoW", "ReviewID": "R2Y3KEFGN98USP", "Overall": "5.0", "Content": "I won't make a long winded review, as I don't really have the time.1. It's fast for the price, I mean, it's almost as fast as my quad core toshiba excite.2. It has 4.0 ICS3. Google play works on it.4. It feels very well made, not cheap feeling at all.5. Mine came with extras, like headphones and screen protectors.6. I got this for my 10 year old's birthday and he loves it, he hasn't put it down in days (during his free time that is).This is definitely a great buy and I plan to buy another for my other kids.", "Title": "Wow, that pretty much sums it up", "Date": "March 30, 2013"}, {"Author": "Bobby Willard \"Japanese  cravist\"", "ReviewID": "RK9FG5G7DML9G", "Overall": "5.0", "Content": "I have a Kindle Fire HD and when my friend will come over he wants to use it. I finally decided to surprise him and buy one just for him. I checked out all the tablets on Amazon, and came to this one. All reviews said it was a great buy, so I bought it. It is not a Kindle Fire HD but it services the needs he was using mine for. It has everything you could want in a tablet minus a few options that my Kindle Fire HD has that his does not have. Thats ok, his serves his purpose as mine serves my purpose as well. Would I advise anyone to buy this instead of a Kindle Fire HD? NO way. But..... I would advise anyone that wants a simplistic tablet that works close to that of a Kindle to get this one, its android and I would not have anything but android. (by the way, my friend thought i was joking when I said I bought him one of these. When he opened the package and turned it on he sqealed THANK YOU, OH THANK YOU SO MUCH! It made his day. He set up his tablet that moment and loves it.)", "Title": "Very nice.", "Date": "April 2, 2013"}, {"Author": "Norris G.", "ReviewID": "R2NYHJRTRNQ9BB", "Overall": "5.0", "Content": "\"This arrived 1 day early. I was very impressed with this little 7\" Tablet, it does everything it stated it could do and i just love it , the battery lasted 31/2 hours on the Internet and 4H 15M off the internet with screen brightness turned down to about 50% and the darkest screen saver on board, but i also purchased a \"Battery Bank\" so it is not a problem. It is already \"Rooted\" I just cant put this \"7\" Matricom .TAB Nero Tablet PC - Android 4 Capacitive Multi-Touch 4GB Tablet\" down. I have installed 5 movies on this tablet and 1000 songs and plan to add more soon and have plenty of space left with the 32GB SD/TF Card i also purchased, so when i am away from the internet, i can watch movies and listen to music. The screen is responsive enough and you can add all kinds of Free apps from Google Play Store, also Netflix and Youtube are already installed. I plan to install  Amazon App Store when i finish this review. I can`t say enough about this tablet. Try it out, for $65. you can`t beat it. A great bargain. ThanksUpdate: o7/24/13 This tablet is my baby girl and i love it. It has not let me down once since i got it. I now have 92 photos, 25 movies & Videos and 86 Apps on this (32GB SD card)and still she keeps chugging along and bringing me tons of entertainment and enjoyment. I love reading and listening to my eBooks/Magazines and works with the Apps for Library borrowing. I could not love it more. This Matricom Tab does it all and i have no complaints, only praise for this $65.00 tablet. And i do of course recommend this tablet. Thanks", "Title": "I LOVE THIS!!!!!", "Date": "May 31, 2013"}, {"Author": "Retired Navy Chief", "ReviewID": "R2J5ULGPGIMOMP", "Overall": "5.0", "Content": "Just ordered the 3rd and 4th Matricom tablets and received them almost a week ago.  I wanted to wait to test them both before posting my review.  The verdict is in; these Matricom tablets are fast, even faster if you have a good internet connection, user friendly and easy to learn and most importantly super reasonable price.  All 4 ordered Matricom tablets worked as advertised and probably performed better than advertised.  Highly recommended and a MUST buy for everyone!", "Title": "My Matricom tablets are awesome", "Date": "April 13, 2013"}, {"Author": "Randy E. Watkins", "ReviewID": "R2DFUYARIZ4H9A", "Overall": "5.0", "Content": "This Thing is Great You Can Not Beat It For The Price. Also It Has Goggle Play And Is Already Rooted !!!", "Title": "Great Tab", "Date": "March 24, 2013"}, {"Author": "Judy", "ReviewID": "R3TVTPZP4WAY0P", "Overall": "5.0", "Content": "The G-Tab Nero breaks the 'you get what you pay for' stigma. I feel like I got more than what I paid for. The tablet started right up and found my wifi connection immediately without any issues. It is fast and it is very nice, from the graphics to the seemingly endless amount of things you can do with and to it. This tablet has a very decent amount of memory, more than my netbook, amazingly, so I am very pleased with it. The shipping was fairly fast, also.I ordered this tablet for my step-son's 6th birthday so that he can use it for learning games and the like, because I couldn't see spending over $100 on a leappad to be limited to only games of that brand that all cost an additional amount of money each time you would like to add another one. And though I bought it for my 6 year old and just received it today no less, I have fallen in love with it and plan to use it more than he does. I will buy one for myself soon, and probably for my hubby, too. He hopped on it and stayed busy for at least two or three hours.The G-Tab came with Google Play already installed, so it was a breeze to find and start downloading free apps :) you have to be careful of what apps you download because some are of poor quality and are riddled with ads, but if you browse wisely and check ratings, you should be fine.So far, very happy with this purchase.I recommend this tablet to anyone.", "Title": "Great little tablet", "Date": "February 13, 2013"}, {"Author": "kg", "ReviewID": "R3MM20CCURNH0E", "Overall": "5.0", "Content": "No, it's not an iPad or Samsung Galaxy Tab, but it's a more than decent tablet that works very well.I'll start with what most people would consider to be \"cons\": It has no rear facing camera. No bluetooth. The battery doesn't last long.Now for the \"pros\": It's android with the Play Store already installed. No GetJar crap, it's genuine Play Store. Perfect 7\" size. Contrary to other reviews, it does charge via the usb cord. At least the one I have does. I connected the usb cord to an AC adapter, plugged it into the wall and it began charging immediately. I don't know why others have said it doesn't charge with the usb. Maybe they were trying to charge it with the cord connected to a laptop? Another really cool thing about this tablet that I don't think has been mentioned at all is that it comes with a micro usb to female usb adapter. What this means is that you can hook up an external hard drive, flash drive, keyboard, mouse or pretty much any sort of usb device to it that you want to.I believe for the price, this is a really good product. I would recommend it to anyone looking for an inexpensive starter tablet or for a spare tablet that you don't want to invest a lot of money in.", "Title": "Great little tablet", "Date": "May 4, 2013"}, {"Author": "Ai Hang", "ReviewID": "R2J99EUVONL1E", "Overall": "5.0", "Content": "Surprisingly, mine came already fully charged, so I got right to personalizing it immediately. It works great! It looks fantastic! It came with additional stuff that was listed, so I was really happy I didn't have to buy other stuff for it (such as the nice quality stylus pen and the screen protector it came with). It is amazing for the price. I recommend this to anyone who wants to buy a tablet but wants to keep the price low. :D", "Title": "JUST LOVE IT.", "Date": "April 1, 2013"}, {"Author": "Tina ostrom", "ReviewID": "R28WUS0796YVZ3", "Overall": "5.0", "Content": "This tablet has two great features: It's inexpensive and it works. I've only had it for a day but so far it's pretty amazing. It's no Ipad or anything but it does WAY more than I expected it would. The fact that it has the Google Store on it is a huge benefit and all the apps that I have installed are working great, even my favorite Android games are working on it. I also have a Zeepad that is a little buggy but this one seems to work good so far and hasn't locked up on me or anything. The battery lasts about 3 hours without a charge which is twice as long. I highly recommend it to anyone looking for an inexpensive but capable tablet.", "Title": "G-Tab Nero is a Hero", "Date": "February 2, 2013"}, {"Author": "Carol Ferrone", "ReviewID": "RGQSM3WH1ZCOR", "Overall": "5.0", "Content": "Great product love using it best tablet ever had. easy to use nice color wi-fi is good  have loved using this tablet.  light & compact", "Title": "Great", "Date": "March 16, 2013"}, {"Author": "KBM", "ReviewID": "R1Y7B2CMX24XOW", "Overall": "1.0", "Content": "I returned the unit the day after I got it.  Whithin 10 minutes it started to lock up.  Save your time and spend more and buy something more stable.", "Title": "Junk", "Date": "September 29, 2013"}, {"Author": "alice68", "ReviewID": "RBKRFA2H9WKX8", "Overall": "5.0", "Content": "My son loves his TAB Nero. Always playing games on it. He takes really good Care of it. Would recommend it to friends and family. Really good screen shot. Takes pictures and they come out great. Delivery was right on time too. Came when said. Thank u", "Title": "7\" Matricom. TAB Nero Tablet", "Date": "June 29, 2013"}, {"Author": "Cooper", "ReviewID": "R2JOAXX0DMD89K", "Overall": "4.0", "Content": "Good deal for as cheap as it was, works good, arrived fast, came with accesories and has a camera on it. Picture isnt as good as ipad or kindle but for the price good deal!! I plan on buying a couple more for christmas presents for my older kids.", "Title": "good for price.", "Date": "June 23, 2013"}, {"Author": "Khey Largo", "ReviewID": "R1C8EJM0KJMKHP", "Overall": "5.0", "Content": "I have a Galaxy tab2 and love it. So does my little boy. He's hard on my things and I figured I couldn't go wrong for the price of this tablet. I didn't go wrong.The tablet came with earbuds, tablet pen, a screen protector and a charger cable. The earbuds were cheap, but not a big problem since my son is still pretty young and like I said hard on things. They were broken in about the first ten minutes. The tablet has been dropped and jumped on and is still going strong. No cracks or weaknesses that I can find. One super nice addition to this tablet is the usb charging port. You can plug either the power cord or the usb cord and either will charge this tablet.The only down side that I've seen is that the screen is a little bit dark and the reactivity is a little bit slower than what I am accustomed to. The wifi works very well, I haven't found one thing wrong, really, with this tablet. The port for the micro sd card is easy to get to and works really well. I would definitely recommend this to someone that has a younger child that they don't want to drop a couple hundred dollars on and wince every time their child is a little rough with it.", "Title": "Great little device", "Date": "June 13, 2013"}, {"Author": "Amy Brunelle", "ReviewID": "R3KGFKVDHDIO7K", "Overall": "4.0", "Content": "My daughter loves it!!!! No problems with it. Gonna buy two more for my other kids in the near future.", "Title": "Great", "Date": "September 23, 2013"}, {"Author": "Ronaldo Leme Moraes", "ReviewID": "R3AJ8JSENEJM5S", "Overall": "4.0", "Content": "I got thinking about my kids and they liked enough, already have the goolge play and is working perfectly, Thanks.", "Title": "Very useful", "Date": "September 13, 2013"}, {"Author": "aimee figueroa martinez", "ReviewID": "RE02YBU3LBIJ3", "Overall": "4.0", "Content": "I just give 4 stars cause' sometimes this tablet is a little slow and frezzing but for $60.that's very well for me because I only used it for read emails and search info.I'M VERY HAPPY FOR THAT.", "Title": "For the price,,is good!", "Date": "August 27, 2013"}, {"Author": "Shannon Kzinowek", "ReviewID": "R327SR8080X278", "Overall": "4.0", "Content": "This is a great tablet for young kids who are just learning the responsibilities of having something. It is just right as far what I needed it for. Definitely recommend this. You are getting it at a great price; it is really nice too.", "Title": "Great for young kids. Love this for my 3 year old", "Date": "July 18, 2013"}, {"Author": "subrena musungu", "ReviewID": "RFBT6J5OL9XAS", "Overall": "4.0", "Content": "This tablet has good features.  You can play games, surf the web, play and download music and videos.  So overall it's a winner in my book.  Had a few problems with my first one.  The screen froze on the Android screen.  Tried to fix it but eventually had to replace it.  Seller was great.  He replace it with no problems.", "Title": "Great mini tablet", "Date": "June 27, 2013"}, {"Author": "Mr. Magic Man", "ReviewID": "RHQYBSS10CPUU", "Overall": "5.0", "Content": "I have purchased various lower end tablets for gifts over time.  This one stands heads and shoulders above the competition.  Google Play Market equipped, you have access to everything.  Starts up in a matter of seconds.  Great for anyone not needing something with a fancy name on it.  Expandable up to 32GB+the on board 4.  My parents pass it back and forth for hours every night.", "Title": "Fast and Priced Right!", "Date": "June 16, 2013"}, {"Author": "Tracy Baumgardner", "ReviewID": "R3UC10DKFQDYQ5", "Overall": "5.0", "Content": "Find the price extremely reasonable, and the product is very useful though I havent figured it all out yet. Very Nice", "Title": "Excellent little tablet", "Date": "May 10, 2013"}, {"Author": "Celestine Trabue", "ReviewID": "RD1JRE6YX63AP", "Overall": "5.0", "Content": "Met my expectation worth the money. Played words with friends a lot love this tablet. Gave to my auntie as a gift, she loves it.  I would order another.", "Title": "7\" tablet", "Date": "April 29, 2013"}, {"Author": "MNOP", "ReviewID": "R27F99W6OVRZHC", "Overall": "4.0", "Content": "My first tablet stopped working after a couple of weeks of use. I think my son downloaded too many games on it and probably fried the processor or something. Who knows.Update 09/26/2013:  The seller did not do anything for me. They never responded to me. I contacted Amazon and they referred me to Matricom's headquarters. Matricom customer service was helpful and they asked me to mail the tablet back to them. It did cost me $5.60 out of pocket to send in the tablet, but they replaced it with a brand new tablet. The new tablet has been working fine for now for a few weeks. I just monitor it more closely and I keep my son from downloading too many games from the playstore. This tablet only has 512mb of RAM so it does run slow. I increased my rating to 4 stars due to good customer service, and that it's not THAT bad of a tablet considering the price.BOTTOM LINE: This is NOT an IPAD replacement. This is NOT a SURFACE or a GALAXY TAB replacement. This is not even a KINDLE FIRE replacement. Please people, come on now! If you pay $65 for a tablet, expect it to work as such. In a world where a good pair of headphones costs $300 and a decent smartphone costs nearly $600, if you pay $65 for a tablet, you will not get a super fast super responsive tablet. It's good for kids, to play basic games, and watch some cartoons and stuff. The battery life is only about a couple of hours. It could be a little better. I would have been super happy with 3-4 hours of battery life, but oh well. I spent $65 and my 4 year old thinks he's got the best thing in the world, so I can't complain.", "Title": "It's a good tablet for the price", "Date": "August 20, 2013"}, {"Author": "Digit", "ReviewID": "R1MLXVJAV2UTEU", "Overall": "5.0", "Content": "from other reviews i get the idea that you do not want to drop one of these... but so far it has everything i want on a tablet... i think it is awesome...then again i have never had a tablet. i would of went with a kindle fire if i had the extra money... but so far i am happy with this one. it has netflix, youtube games... i can browse, i don't know how much better you can get on a small device,i have not had any problems yet. the case is a little flimsy, if you push down on the edges you can tell, but its not that bad.  to me it is a quality $70 device. the idea of it dying because it falls and hits the ground on accident sucks, but i would kind of expect that from laptops, tablets, i have heard kindles do good with a little bit of abuse and i have seen a nook dropped on a wood floor, have things spilled around it, and seen it come out on top, but as long as this one works i will be happy with it.update, so far i have had the tablet for few months,  it has survived a few small drops, one tip i would give is to fully close out other programs as you change what your doing,it puts everything you go into on a save screen when you close out so that when you click on it again you are back to where you left of, some people know, some don't, but if you click on the bottom squares on the left you can swipe them away for good, ... Im new to tablets, mine doesn't seem to lag, downloaded some antivirus, and memory clean up programs, have not had any problems, battery life only sucks when your doing enough to drain it, it will hold a charge for a few days, playing games while connected, while running 3/5 save screens, with the volume up, that stuff runs down your battery, but if you shut off the internet, close out of the save screens, etc, the battery life is a bit better, not a super battery , but decent.  definitely get headphones if you want good sound. i simply remember to keep my charge cable around if i plan on being on it for more then an hour.  as far as i can tell i like it better then a nook anyways.", "Title": "so far so good", "Date": "April 13, 2013"}, {"Author": "Papaluc", "ReviewID": "R23KPCJLETZ4GI", "Overall": "5.0", "Content": "Received tab a week ago, I'm no computer expert by far and got quickly at ease with it and so did my wife! Now I got to get another one.So far no issues and will post if i find something wrong with this.Not as quick as my laptop but pretty good for the price.", "Title": "WOW!!!", "Date": "March 23, 2013"}, {"Author": "Leslie Schelby", "ReviewID": "RWC5VVUN21SIL", "Overall": "2.0", "Content": "It has taken me awhile to write this review cause I kept hoping that I could get this tablet to work correctly.  It doesn't download pictures very easy, in fact it is almost impossible.  After talking to a customer service rep and following his directions it still is near impossible to download pics (the main reason for getting it) unless all of the electronic stars and moon line up perfectly.I wish I wouldn't have wasted my money on this and I would have just gotten a more expensive one that had better ratings!", "Title": "Great price but not very good tablet", "Date": "January 31, 2014"}, {"Author": "Crystal Endres", "ReviewID": "R1A0QJTO27156F", "Overall": "1.0", "Content": "I purchased two of these tabs. They were both broke within a week. Neither held a charge then within a couple days the charger ports broke and they were very slow. I would not recommended.", "Title": "Would not recommended", "Date": "January 30, 2014"}, {"Author": "Donna Satterlee", "ReviewID": "RGYHYSQV13K8G", "Overall": "5.0", "Content": "this is well used in our home for the price its very good. great for the grandkids i will definately order again if need to", "Title": "love it", "Date": "January 27, 2014"}, {"Author": "britney", "ReviewID": "ROEF82Q5L9P85", "Overall": "1.0", "Content": "This is a horrible tablet it only has an hour of battery life at max and is very cheap and slow.", "Title": "Horrible", "Date": "January 26, 2014"}, {"Author": "JR", "ReviewID": "R2NSBUUGIK7EV", "Overall": "4.0", "Content": "I guess for the money I can't really complain just has a very very short battery life only lasts maybe 2 hours", "Title": "it's ok for the money", "Date": "January 23, 2014"}, {"Author": "B N PHX", "ReviewID": "R1O72YGHE1J92V", "Overall": "5.0", "Content": "These tablets are all they should be and more. The kids love hem and can play all of their games. They enjoy emailing each other and have no problems with them at all.", "Title": "Great Buy", "Date": "January 15, 2014"}, {"Author": "Eduardo Garcia", "ReviewID": "R34SEM3UEPVX7D", "Overall": "5.0", "Content": "I read these reviews and got worried. But so far my tablet is the best one I've had so far.", "Title": "Not bad", "Date": "January 13, 2014"}, {"Author": "lacinda mcnatt", "ReviewID": "RJH8VB91YDGUY", "Overall": "4.0", "Content": ".TABNERO. I HAVE NOT USED THIS TABLET BUT MY GRANDSONS LOVED THIS.  THEY HAVE IT WITH THEM ALL THE TIME.", "Title": ".TABNero", "Date": "December 8, 2013"}, {"Author": "Kenneth D. Hardie", "ReviewID": "R1KSLRT7DU43VL", "Overall": "5.0", "Content": "Love it!!!!!!!! It's got several hours of battery life, and when I watch Netflix, it's a crystal clear picture. I totally recommend this tablet for people who need a tablet at a reasonable price.", "Title": "AWESOME", "Date": "December 7, 2013"}, {"Author": "Morzos", "ReviewID": "RPOAR8O3T3XCJ", "Overall": "4.0", "Content": "Good little tablet that is just the right size. Takes a minute to load up but when it does it runs smoothly. Great to get apps with the Google play store and easy to personalize. Capacitive screen works well and very responsive. Just ordered another one for the wife as she was looking for something to read e-books on that was back-lit as her nook does not have that feature. Was admiring mine because she can get on-line as well as check Facebook. Well worth the money.", "Title": "Good tablet for the price.", "Date": "June 9, 2013"}, {"Author": "kathleen clarke", "ReviewID": "R1454DPT6K9GMB", "Overall": "4.0", "Content": "Works well but has very little volume.  Picture does not fill the whole screen.  Does not whole a charge for more than a few hours.", "Title": "good but not great", "Date": "May 14, 2013"}, {"Author": "Minshell", "ReviewID": "RE5YOZZHJ5731", "Overall": "4.0", "Content": "I order this one for my 16 yr. old daugther so loves it. She has downloaded games, songs, pictures she haven't had a problem yet.", "Title": "Comment on Tablet", "Date": "May 8, 2013"}, {"Author": "Dan Tharp \"Dan Tharp\"", "ReviewID": "R1NNMZSBYGV8TY", "Overall": "5.0", "Content": "I actually bought another generic Android tablet and had problems with it, so I got a refund and spent that money on this tablet.Couldn't be happier.This tablet does exactly what I/we want it to.My kids use it to watch youtube videos, watch Netflix, and stream media files (movies/shows/etc) from our home network NAS.Wireless works great....so far we haven't had any problems with it.I really like the touch sensativity on the screen where you don't have to use a pointer or your nail (like our previous tablet did).  This screen responds very well to standard finger swipes with the skin of the finger.No complaints there.The ONLY complaints I have are:- The battery seems to bleed out pretty quickly....but then again, considering the cost, that's probably not uncommon with this price-range of tablet.- The cord to the charger/power-brick is pretty short.  Since we sometimes have to use the power cord to keep it charged while using (if someone forgot to charge it, which my kids often do), then the extremely short power cord is kind of a pain....limiting you to be very close to an electrical outlet or use an extension cord.Other than that, we're very happy with this device.Even if it had costed much more, it works great and so far we've not had any issues.When you factor in the price!?!?  Wow....it's a great deal.I can, and VERY OFTEN DO, recommend this to others who are looking for inexpensive Android tablets.It's a great buy!", "Title": "Incredible deal for the price!", "Date": "July 30, 2013"}, {"Author": "mar", "ReviewID": "R7YGQ240ZRBBW", "Overall": "2.0", "Content": "UPDATE:  Still No Email Support, support@matricom.net is rejected, why would you buy a product like this with no email support.NO SUPPORT > Good Product, but without support how good can it really be ,Update, when the website was back to functioning , you can see there is no mention of the Tab Nero anywhere , they are only interested in promoting their new product,  the Tab Nero has no support on the company website which is a glaring oversight on management part , there is literally nothing about this product.  This gives the impression that this is a sloppily run very small business , so the owner in all their greed have a successful product, have no interest in its future.  This product was recommended to me by another buyer and has good reviews, it's just sad that owner is so short sighted.NO SUPPORT EMAIL:Delivery to the following recipient failed permanently:  support@matricom.netTechnical details of permanent failure:Google tried to deliver your message, but it was rejected by the server for the recipient domain matricom.net by smtp.asia.secureserver.net. [182.50.144.66].", "Title": "NO SUPPORT PAGE", "Date": "July 27, 2013"}, {"Author": "Barbara", "ReviewID": "R1J2TEMREUS8H2", "Overall": "1.0", "Content": "I purchased 2 of these for birthday gifts for my friends.  They are very slow and freeze up.Great price, but lousy product.  I guess you get what you pay for,", "Title": "Do not buy this", "Date": "July 25, 2013"}, {"Author": "Tyy Daymon", "ReviewID": "R11HDLRJH4LKCJ", "Overall": "1.0", "Content": "i purchesed two tables about a month apart one had clearly been used.  The box was worn and there was no plastic wrap that the second one had.  Some package material also missing. Not a big deal but it was \"new\". I wouldn't have known if I didn't order a second one. I gave it as a gift and it was wonder full function well and nice screen.  So as aformentioned #2 was ordered...I wish I would have waited because the first on died after making a strange  noise.  So I will start the return process and update after.", "Title": "One little tablet, Two little tablet BOOM", "Date": "July 24, 2013"}, {"Author": "Michelle Turner", "ReviewID": "R13B5EQDM06JM2", "Overall": "5.0", "Content": "At first had problems getting the internet to work, after a week or so it started working and has been working great ever since. My daughter has enjoyed it very much. Would recommend, great price. If you have problems with getting a connection give it a few days of using and recharging before returning. All tablets are fragile so would recommend getting a case especially if child is younger. Was very happy with USA wholesale suppliers too, they were great and delivery was awesome.", "Title": "Works great", "Date": "June 6, 2013"}, {"Author": "bUtterflyybAnqq", "ReviewID": "RBQGGMJDQF0OG", "Overall": "5.0", "Content": "Seems like they won't put your review up if it's not 5 stars so here we go....Just got my tablet today a day before it was actually suppose to arrive so I was very excited about that part, charged it for the about 4-5 hours and when I attempted to power it on the screen would not load any further past the andriod symbol. I'm a quick tempered person so of course I was angry but I read the manuel which makes no sense with all the abbreviated words and attempted to reset it so I continued to charge for another 4-5 hours and still the same problem I have no idea what to do...it's still charging because I'm attempting to try to get it working again but I'm pretty sure it will be a failed attempt. I love amazon but with this seller on here shipping out defected merchandise is making me think twice about buying anything on here again.DON'T BUY IT UNLESS YOU WANT A PRODUCT THAT DOESN'T WORK AND I'M PRETTY SURE NO SANE PERSON DOES", "Title": "Shipping is amazing...but the product not so much", "Date": "August 6, 2013"}, {"Author": "C. Adams", "ReviewID": "R2M9UZXP6XGSGQ", "Overall": "5.0", "Content": "I got this for my son who is 6 yrs.old, and I love it!!! I didn't won't to spend a lot of $ on a tablet but wanted good quality and this has surpassed the test..he gets all the latest games and learning apps from the Google play store and they download very fast...The shipper sent this item out very fast and I will definitely buy more items from them ;)", "Title": "Awesome...", "Date": "February 13, 2013"}, {"Author": "Jose", "ReviewID": "R1FSWXW07XWXZN", "Overall": "1.0", "Content": "The Tablet that I purchased lasted last than a month before it failed to start.  I tried to contact the company but NEVER got a response.  The warranty is for 1 year, but the company does NOT respond.  I would NOT recommend this product to anyone.", "Title": "Very Poor", "Date": "June 24, 2013"}, {"Author": "matt", "ReviewID": "RWFALIK0OFBZJ", "Overall": "1.0", "Content": "The warrenty expired and it just broke on me, what can i do now?? This was my Birthday Present I am very upset. I don't know what to do.", "Title": "Birthday present broke when warrent just got off....", "Date": "October 17, 2013"}, {"Author": "J. Gordon \"Lulu\"", "ReviewID": "R38ZK1SXWM1BF3", "Overall": "1.0", "Content": "This is the absolutely worst tablet you can buy. It is extremely slow. Your computer will not do a speed boost on it. All the apps and server constantly freeze and stop responding. The battery life is horrible. Also, I bought this two weeks ago and it won't even hold a charge now. A COMPLETE WASTE OF MONEY and electronic system!", "Title": "Absolutely worst tablet you can buy!", "Date": "October 3, 2013"}, {"Author": "James E. Sink \"Jimsi777\"", "ReviewID": "R2PBCK5O0M2DXB", "Overall": "1.0", "Content": "UPDATE October 2nd 2013:This is JUNK, wasted $65 on this, gone with the wind...I tried removing programs still JUNK!! HAS BAD Battery life, nothing is good about this Tablet....I bought this Tablet back in June or before and it is actually very SLOW and seems to be bogged down and getting slower and slower...it is taking longer to connect to wifi and now programs are crashing...I would not recommend this or any other CHEAP Android tablet to anyone. The first one I ordered was lost or stolen using Smartpost (simply a terrible means of shipment) don't buy this Tablet!!", "Title": "Much better out there, pay more and get better!!", "Date": "September 7, 2013"}, {"Author": "Rishma Rampersad", "ReviewID": "R3M7ZYP3DFEZ1F", "Overall": "5.0", "Content": "I needed something for my three year to play and learn. It is perfect he plays games and the system does not freeze like the others.", "Title": "perfect for toddler", "Date": "July 29, 2013"}, {"Author": "Max Arbor", "ReviewID": "R3LTG6CROHH97Y", "Overall": "1.0", "Content": "don't mind load time lag or shut down problems buy otherwise get something better, power cord sucks, battery life sucks", "Title": "tablet tech that's slow", "Date": "July 11, 2013"}, {"Author": "Kathy75", "ReviewID": "R1UUPH7UUBWGJ7", "Overall": "5.0", "Content": "LOVE THIS LITTLE TABLET. EASY TO USE AND SETUP. VERY FAST AND 3/5 HOUR BATTERY LIFE.TAKING THIS ON VACATION OUT OF THE USA. CAN'T HANDLE ROAMING CHARGES ON CELLPHONE AND WILL NOT LAST 10 DAYS WITHOUT THE INTERNET! GREAT BARGAIN FOR THE PRICE.", "Title": "TAKING THIS ON VACATION", "Date": "June 17, 2013"}, {"Author": "kobaffo", "ReviewID": "RW93BNNPSJPM", "Overall": "4.0", "Content": "I bought for my niece after an earlier one I bought, which took ages to arrive cracked the screen with a minimal pressure. She loves it so far.", "Title": "My Niece loves", "Date": "June 9, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R19NWLVS7UHLXO", "Overall": "3.0", "Content": "Kind of slowBattery life is not too greatTrouble connection to wi-fi/network at times, but overall okay. I purchased it for my children. It works.", "Title": "Pretty good for the kids", "Date": "May 28, 2013"}, {"Author": "Olsonbergs4", "ReviewID": "R2B3OERPO7OW0V", "Overall": "4.0", "Content": "Got this for my 12 year old.. He saved his allowance for it.. It's perfect for him.. He can play his games and watch Netflix and do some research on it for school! Win win!", "Title": "Great for kiddos!", "Date": "May 16, 2013"}, {"Author": "Mary Schenck", "ReviewID": "R2PGPF4YPNZ5N4", "Overall": "1.0", "Content": "I bought against my own good judgment, trying to save a little money. Needles to say, you get what you don't pay for. It was cheap and half the apps didn't work. Bad screen vision. Glad  bought he warranty so we could get our money back", "Title": "Not worth it", "Date": "February 14, 2014"}, {"Author": "s.smith", "ReviewID": "R3DB7VLCRSWI1U", "Overall": "1.0", "Content": "Don't buy this I bought two got ripped of both persons I bought it for was complaining in two weeks time it's costing way to much for me to return them", "Title": "Waste", "Date": "February 12, 2014"}, {"Author": "Amanda", "ReviewID": "R2N3QV7WQ47L18", "Overall": "1.0", "Content": "Product came damaged, had to send it back. Was very disappointed because it was a Christmas gift for my dad.", "Title": "Disappointed", "Date": "January 19, 2014"}, {"Author": "Sue Vaterlaus", "ReviewID": "R2878UD9MIS8QY", "Overall": "1.0", "Content": "I could never get it to connect to the internet so I returned it. Thought it would be good for my mom to do email and read and play some games. Did not work out.", "Title": "would not connect", "Date": "January 17, 2014"}, {"Author": "barb wenger", "ReviewID": "R1SJDC8O54ZUDX", "Overall": "1.0", "Content": "Battery or charger is messed up.Does not hold charge for long.After full charge it dies within hours weather played or not.", "Title": "Bad battery life", "Date": "January 1, 2014"}, {"Author": "Dale M.", "ReviewID": "R1R0K0BECYWHHC", "Overall": "1.0", "Content": "Dead after 2 months of barely using it! Will not boot completely, charged 100% normal android screen, then black screen, power off...still has 100% charge...", "Title": "Do not buy this!!!!", "Date": "January 1, 2014"}, {"Author": "Djay", "ReviewID": "R3HO9W0Z58UQET", "Overall": "5.0", "Content": "Excellent entry level tablet for kids . Really responsive. My seven year old plays a SNES emulator with his logitech cordless controller without any issues or crashes. Good deal.", "Title": "Very impressive for the price.", "Date": "December 31, 2013"}, {"Author": "Frane", "ReviewID": "R2AVCE21XXEW9E", "Overall": "1.0", "Content": "Waste of money.... it is the night before chritsmas and as I was cleaning the fragile looking tablet the screen just cracked. I am so dissapointed and I just feel so sad for my daugher but I will have to make it up to her.... (.._..)", "Title": "waste of money", "Date": "December 24, 2013"}, {"Author": "Caleña", "ReviewID": "R3C4ECIUW4BSS8", "Overall": "3.0", "Content": "I was so happy to get my tablet. Only thing the first time it hit the floor it was done with. I should have known not to have a tablet around a two year old!!", "Title": "It was ok!!!", "Date": "December 17, 2013"}, {"Author": "Tina", "ReviewID": "R1F8VKCZVTJEA", "Overall": "5.0", "Content": "This is a really great tablet I got it for my 8 year old grandson and he loves it works greatand the price was great I have bought 2 more sence for other family membersand they love it", "Title": "Tablet", "Date": "December 17, 2013"}, {"Author": "Tony L. Lunnie \"tony\"", "ReviewID": "R3RY71PIZNC46F", "Overall": "5.0", "Content": "Great product to use for on the go PC tablet at ur fingertips. This is the compouter of today andi am pleased with it.If u get this product u will be connected with the world.", "Title": "PC tablet well worth buying.", "Date": "November 22, 2013"}, {"Author": "Nicole Roberts", "ReviewID": "R2B3H7JWV8CEOG", "Overall": "5.0", "Content": "Product was awesome and worked perfect. They run a little slow and screen kinda hard to look at but work for what we needed them to be. Great price.", "Title": "AWesome product", "Date": "October 25, 2013"}, {"Author": "Ardana Bruns", "ReviewID": "R33IHXA4O49ELV", "Overall": "5.0", "Content": "We ordered this tablet for our mother as a gift. She likes to play simple games. This tablet worked for that. Not real sharp picture or color but good starter. It had a touchy charging port and after 6 months it would not charge anymore. Contacted amazon return and got immediate response to return it for full refund.", "Title": "company stands behind product", "Date": "October 21, 2013"}, {"Author": "Alfonso L. Puerta \"Technomaniac\"", "ReviewID": "R2970ZDZUFC7AL", "Overall": "4.0", "Content": "Fair screen quality. but poor photo resolution. the processor is enough to work ok but speed is low. and the wifi seems to be low range ?. Other than this is a good product for a kid or a person that doesn't need to spend a fortune.", "Title": "Good tablet for the price.", "Date": "October 21, 2013"}, {"Author": "Adrienne R. Tarpley", "ReviewID": "R3C1B3KZXTN9OD", "Overall": "5.0", "Content": "I needed an inexpensive tablet to use as a display for an auto racing simulator I built. I was worried about the quality at such an inexpensive price. 6 months and counting of daily use and no problem what so ever!", "Title": "Great for what I needed!", "Date": "October 18, 2013"}, {"Author": "Jorge Barros Cabezas", "ReviewID": "R1U53K5APW4RNR", "Overall": "4.0", "Content": "it's a good tablet for the price, does not have the best video quality but works. Can play n64 roms as good as gba ones if you have an emulator", "Title": "good thing for the price, can play n64 and gba games", "Date": "October 17, 2013"}, {"Author": "Paris D. Willis \"paris dwight willis\"", "ReviewID": "R104UIWRZSOBW8", "Overall": "2.0", "Content": "I found it to be MUCH smaller than the logo picture images of it online. Way too tiny. So, I returned it. Works well, easy to use and set up.", "Title": "NERO Tab", "Date": "October 8, 2013"}, {"Author": "Allan Hawkins V", "ReviewID": "RMPWL6DLF65XD", "Overall": "5.0", "Content": "Cheaper and powerfull, but you have to buy a Micro USB Charger to be ready! Power Cord is dancing in the unit and ir hard to charge it.", "Title": "Matricom", "Date": "August 30, 2013"}, {"Author": "leah", "ReviewID": "R27MJBUJMC25DM", "Overall": "4.0", "Content": "i like the product, good features, and also when i got it, it has a stylus pen, screen protector, 2 adapter, and a charger,.. i just got it, and first try testing,,,", "Title": "its cool...", "Date": "August 28, 2013"}, {"Author": "jennifer johnson", "ReviewID": "R1920FGUXMFM3C", "Overall": "5.0", "Content": "It is good and have good features like it says. It is well worth the money. It works great. I love it", "Title": "Love it", "Date": "July 22, 2013"}, {"Author": "Imelda perez", "ReviewID": "R1FJ6O4ON6T9JP", "Overall": "3.0", "Content": "I don't like how the screen looks from a side view, it looks too dark. and its a little slow", "Title": "poor color", "Date": "July 8, 2013"}, {"Author": "Matthew", "ReviewID": "R30JC1H7XROYDO", "Overall": "4.0", "Content": "I ordered the Tablet last week, I wasn't expecting to get it so quick. When I got it I had to charge it up first. It connected to my Wireless network very easy. It does, however, lag sometimes. It is pretty decent for a beginner tablet. If you have kids under 12 and don't want to buy an expensive Ipad for their first tablet, this is the way to go.One Big flaw that I don't like about it is that the power cable is a little short. It could be a little bit longer.", "Title": "It's great for a beginner Tablet", "Date": "June 10, 2013"}, {"Author": "Someone54", "ReviewID": "R9QAMSN5Z8A0L", "Overall": "5.0", "Content": "This is a terrific tablet. I like using it for streaming videos. It seems to be the efficient when it comes to watching videos. This is a handy tablet to have, and it works great with the likes of the New 32gb Micro Sd Card Sdhc Tf Flash Memory Card 32gb Class 10, New! Usa! connected with it. I say try it out if you are looking for a great tablet.", "Title": "Great Tablet-Especially for Videos", "Date": "June 9, 2013"}, {"Author": "Bobbie Jones", "ReviewID": "R119BS7O8DTT0T", "Overall": "4.0", "Content": "Great starter tablet. Can be a bit sluggish and sometime glitchy but for the price and for a persons first tablet it is Great... My boys love them... They uploaded games easily.Use screen protectors and of course buy a case and the insurance is worth it.", "Title": "Good Starter Tablet", "Date": "June 3, 2013"}, {"Author": "SILVANA CRUZ", "ReviewID": "RX6P9RKWZEQXJ", "Overall": "4.0", "Content": "I got this item for my 7 year old son, so I could keep my laptop out of his hands, It was less expensive to buy this tablet than taking my computer to the geek guys every time he did something wrong with it, and so far I'm even enjoying it. If I feel like watching some Netflix or checking my emails I take it to bed at night. I feel good about what I paid for it and how it's been working so far. Good choice.", "Title": "It is what I expected", "Date": "May 15, 2013"}, {"Author": "Eperez1379", "ReviewID": "R3E0G81867ANUC", "Overall": "5.0", "Content": "We buy two because we have three kid between 3 and 10 years ...., every body plays on them each one have games in it or see movies but they use it all day ...... We love them and the price was right on or budget ....", "Title": "Great for all the family", "Date": "May 10, 2013"}, {"Author": "J. Bower", "ReviewID": "R3C96QM1VTGD0X", "Overall": "4.0", "Content": "I received my new tablet yesterday, plugged it in and charged it up as recommended.A few hours later, I pushed the button and what do you know - it worked!- Easy to set up with Wi-Fi & Google account- Useful app's pre-loaded (Calendar, Mail, Google Play store, Netflix, games...) - worked out of the box- Easy to download & use new Apps- Camera worked fine- Watched a Netflix movie - slightly slow app response but good streamingThere were a few signs of the low price:- Short battery life: 1 hour of browsing & 1.5 hours of movie streaming pretty much killed the battery- Mediocre front-facing camera- Not so responsive touch screen or volume rocker switch- Poor speaker (headphones sound is fine)For the money - great - especially if you already have a Google account.", "Title": "Good for the price, limited battery", "Date": "March 29, 2013"}, {"Author": "Andrew", "ReviewID": "R2F5OLMPC2KLK", "Overall": "1.0", "Content": "Awful, hated it, way too slow, terrible screen, sound is way to low,  can't hear it even with headphones.  Would not buy it again if it was only $5. Its a expensive stupid looking  paperweight. when using it feels like the designer went out of their way to make something terrible.", "Title": "Worst thing I ever bought on Amazon, no worst thing I ever bought.", "Date": "October 21, 2013"}, {"Author": "Wendy Dillard", "ReviewID": "R285K7X9GRENM3", "Overall": "1.0", "Content": "I bought this NEW as a anniversary gift for my husband and it is used! Still has all the previous owners home videos email and face book on it. I bought a new one it did not say refurbished! Completely unsatisfactory saleing practices! Shame on you matricom! On the good side Amazon took great care of this for me and insured me that the will be contacting the distributer and assuring it doesn't  happen again. Thank you Amazon!", "Title": "USED!", "Date": "August 24, 2013"}, {"Author": "aaron bree", "ReviewID": "RR4ZKGD36E5O1", "Overall": "1.0", "Content": "slow, doesn't connect to computer (xp or windows 7, haven't tried windows 8), crashes when playing video off an external flash drive.stay away.", "Title": "not good", "Date": "June 17, 2013"}, {"Author": "Aysha White", "ReviewID": "R17D6CGGFKZMZB", "Overall": "1.0", "Content": "I charged it right away for at least 5 hours and it didn't get past the screen with the icon on it. Tried numerous times. And it was obviously a used item as the screen was all scratched up. After I returned it, I ordered a refurbished Kindle Fire 7\" (no HD) and it works fine AND has the same warranty as a new Kindle.", "Title": "Didn't work and screen was extremely scratched up", "Date": "April 22, 2013"}, {"Author": "J&C;", "ReviewID": "R15PY9WQAODRAN", "Overall": "1.0", "Content": "We were seeking an inexpensive, yet durable tablet for our three-year-old son. This tablet isn't it. The screen quality is very poor, and very shiny. It bothered my eyes to look at it, and looked dim, even on the brightest settings. However, when we got the tablet and turned it on and used it, it worked, and it worked well. For the whole day and a half that we had it before \"The Fall\". One small fall (onto carpet), and it came apart; the screen separated from the back and the motherboard. Nothing actually broke, and there are no cracks in the screen or on the tablet itself, but that short fall has rendered it completely useless. The screen is trashed; it's just squiggly lines on a white background. While we didn't expect super high quality from a $70 tablet, I certainly expected something better than what we got. If you're seeking durability or quality in your search for a tablet, look elsewhere.", "Title": "Two days later, it's in the garbage. Where it belongs.", "Date": "April 9, 2013"}, {"Author": "This Guy", "ReviewID": "R3CAHOG3I6HCKN", "Overall": "1.0", "Content": "Straight out of the box, I plugged it in and let it charge for about 4 hrs. After charging it, I powered it up, and it wouldn't load the operating system, it was just stuck on the \"android\" boot screen. I tried several times powering off and on and finally plugged it into power and then tried powering it on, it came on. I started setting it up as I do any Android device and encountered problem after problem. The play store itself would crash when trying to browse for apps, it was awful. No apps would run for more than a few seconds etc. I let it sit for a couple hours and started messing with it again and voilà, it worked perfectly, just like any normal android tablet...for a couple of hours, then it just rebooted by itself 2 times, then ran fine and then rebooted its self one more time and now the touch screen was no longer functional, it would just go nuts when you touched anywhere. I tried rebooting it several times but the problem never stopped.I then put in for a return which was processed very fast. Sorry for the hastily typed out review, but I'm on break and have to head back to work.", "Title": "Defective, or just junk to begin with?", "Date": "March 28, 2013"}, {"Author": "D. L. Madison", "ReviewID": "R32QK7SGTHKBHJ", "Overall": "4.0", "Content": "This tablet was a pretty decent buy when I bought it. Everything works as it should and, it runs for over 3 hours, (so long as your display brightness is a  just under thirty percent, (plenty bright for indoor viewing.) It isn't an IPC or a high pixel density, (156+) res display (I'm guessing it has about 120ppi display) but, for the price, I had no complaints. It charges up pretty quick and, can also be charged via the micro USB port.It has a really good stand-by time, (I accidentally left it on, in standby, for over 3 days): I think it was into day four when, I picked it up to turn it on. It was at 1% but did complete the shutdown sequence when I immediately went to power it down. I had used it to watch a stored Stargate Atlantis episode so, it had been running for a good 45 minutes before being put into standby. The wi-fi automatically shuts down in stand by... something not all tablets do.The 2160 HD Player is a joke... It functions but, there is no HDMI out port and, the display is not, as I said before, an HD display so, you are not going to get any better viewing of an HD movie over standard definition by using it. I do like the OTG feature: I have a USB thumb drive, with a bunch of my recorded shows and movies on it. I can watch em all with no glitches.It comes with Google Play, (not someone's proprietary and pricey Android app store) preloaded and, Amazon App store can be downloaded and added through Google Play Store too. It doesn't have a lot of RAM but, as long as you aren't running a bunch of apps, that isn't much of a problem; (it does have DDR3 ram at least.) It can run Netflix, with it's 1.2 GHz single core processor and, it does have Flash video support, even though it is running Android 4.1.1 (Mine was already upgraded when I bought it.)In my opinion, this is one of the best values, if you are looking for a budget tablet that actually isn't buggy. It has a US warranty address too, to go with the one year warranty; good news to anyone who has bought cheap, (made in China and sold there.) Buying from sellers in China, you get a bum tablet and it will cost you much more than you thought to save, just to maybe get it fixed, (and do not send anything to China without paying $12 for delivery tracking -- no tracking = it doesn't arrive.)", "Title": "Good tablet for the budget concious.", "Date": "November 7, 2013"}, {"Author": "bobby fritz", "ReviewID": "RF04A78HDEXAR", "Overall": "3.0", "Content": "good product for 50 bucks. just freezes and is a little slow other than that its an all right tablet", "Title": "you get what you get", "Date": "October 30, 2013"}, {"Author": "Korey", "ReviewID": "R2VB7TGETU4S2", "Overall": "3.0", "Content": "I knew it wasnt going to be a high end device but I also expected it to have some basic functionality. If you hold it in portrait mode the screen is not easy to read and it also holds a charge for about 20 minutes. For the money it may be a better idea to go with a higher end-used device.", "Title": "eh", "Date": "July 2, 2013"}, {"Author": "banessa4life", "ReviewID": "R3K36BJ07K4W83", "Overall": "4.0", "Content": "i ordered 2 a black and a pink but when i ordered this black one the  first one i got was not working and kept freezing and shutting off but i contacted the seller and they replaced it for another i just got that one today and it seems to be doing good . being a cheap tablet its not going to give you outstanding performance but overall its pretty close to it. and comes with headphones and other usb hook ups. netflix works good and the movies seem to play nice without buffering . so its a nice product for the kids to play games and keep them busy the app store seems to work good and so do the games. The battery life seems to go down pretty fast when your on it other than that its ok.", "Title": "cheap tablet !", "Date": "March 19, 2013"}, {"Author": "nwocmf", "ReviewID": "R20VSJR3NA5L1N", "Overall": "3.0", "Content": "This is a great tablet and price but it bugs out a lot and it never allows me to play an app for more than 5 minutes. Great battery life but it nevers works how its supposed to", "Title": "Great price but...", "Date": "March 16, 2013"}, {"Author": "Randall", "ReviewID": "R3NHWC8T0KYMWK", "Overall": "1.0", "Content": "Weight is a huge factor with a small tablet. I purchased this because the stated weight was 6.4 ounces, slightly lighter than my Kindle Touch ereader. I just received this tablet by UPS deliver and weighed it and my Kindle Touch on my electronic scale. Indeed my Kindle Touch weighs 7.5 ounces but this 7\" TAB Nero table weights 10.5 ounces! NOT 6.4 ounces as advertised. That is a huge difference between weight advertised and the actual weight! I am returning this tablet and I expect to be fully refunded including shipping because of the FALSE ADVERTISING.ALSO: Looking a bit more at this item as I prepare to return it, I can see it is most likely USED, a return that was then shipped to me as \"new\". The screenprotector has scratches on it from someone using it a bit, and there is another plastic protective sleeve that has been removed from it but that is in the box with it.Packing it up to take to the local UPS store to ship it back. Feeling very mislead and hoodwinked.", "Title": "Misleading specs: weighs 10.5 ounces NOT 6.4 ounces", "Date": "March 26, 2013"}, {"Author": "vernill", "ReviewID": "R1DII67WXC61OO", "Overall": "4.0", "Content": "i got my7\" Matricom .TAB Nero Tablet PC  on monday 8th  it was ok for now but we had going into  setting to charge it to engish .2. the book let words was too same to read", "Title": "tablet", "Date": "April 10, 2013"}, {"Author": "Christina Lutchen", "ReviewID": "R2WYNI16RP7ZQY", "Overall": "1.0", "Content": "I had a Pipo s1 that unfortunately broke - bought this for a more inexpensive replacement..This tablet is awful -  it is super slow- Takes approximately 1 minute to load \"Angry Birds\" and like games- Facebook, Pinterest are frustratingly impossible to utilize due to sluggish performance - 15-25 seconds to load applications- The \"touchscreen\" is HORRIBLE and requires the use of the included stylus for navigation.- Battery life is 1-2 hours at best.I wish I could return this piece of junk - shame on Amazon for selling this garbage!", "Title": "S-L-O-W, UNRESPONSIVE and NO BATTERY LIFE!!", "Date": "May 17, 2013"}, {"Author": "nana joy", "ReviewID": "R3V9KAKBBKPDOC", "Overall": "3.0", "Content": "This was the second order for this tablet. 1 st one arrived fine. Second ordr defective & broken. Had to return.Receive a new one a few weeks later its fine a little slow, agree with short battery life, but great for the price.", "Title": "UPS is not Reliable", "Date": "May 9, 2013"}, {"Author": "Kelly Ann Nanney", "ReviewID": "R2BXBKW796K7FR", "Overall": "1.0", "Content": "After research on many android tablets and a limited budget I decided to take a chance on this tablet. Should have gotten a clue when the day I gave this to my son for 13th birthday he accidentally dropped it on carpeted floor and it nearly popped apart at seams, was able to pop it back together. However 8 days later he accidentally sat on it, which for point of reference has happened to my kindle multiple times as well as being dropped. Both devices were kept in protective cases and screen protectors... Now I have a $73 electronic paper weight with this device! Long story short don't waste your money! Am now investing in a kindle since he was terribly disappointed. Yes I wasted my money now am getting a like new kindle fire for him for just a bit more money. Please learn from our disaster! I don't ever write detailed negative reviews but felt compelled to let others know what they were spending money on. If you get this expect to treat it like fine China! One small mishap and you are done!", "Title": "waste of money!!!", "Date": "April 12, 2013"}, {"Author": "steve wagoner", "ReviewID": "RFET1EKMVFKG9", "Overall": "1.0", "Content": "I discovered tablets are just about worthless to me. I'll never buy another one.  Had this tablet one whole day and found it to be completely useless.  Ihave an Ipad for work.  It isn't worth much more than this one and it's price was 10 times more.", "Title": "no more tablets", "Date": "April 5, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00B7SMR3C", "Features": null, "ImgURL": null, "Name": null}}