{"Reviews": [{"Author": "Tracy B \"tcreath\"", "ReviewID": "R39OCILJ711UY8", "Overall": "2.0", "Content": "UPDATED REVIEWSo after many months of using the Nabi Jr, I've changed my review from 3 stars to 2. As you can see, I purchased these for my twin girls back in April. As of right now, December 12, the Wings and Nick Jr. apps are still not available. \"Coming soon\" isn't cutting it any more, and I feel that this is blatant false advertisement. The battery life is nil. Sometimes you can put the Nabi Jr. on it's charger all night long and, for whatever reason, one of them still won't charge. Then I have to manually power it down and try again. When they are fully charged we may get 2 hours use. The other issue I have is that sometimes they will just turn themselves on. Normally this isn't a big deal, but the four of us were sharing a hotel room over the Thanksgiving holiday and and all the sudden, in the middle of the night, our very dark room would be flooded with brightness because a Nabi Jr. just decided to turn itself on. I'm a light sleeper and it would immediately wake me up. I learned to turn them over after the girls were done playing with them so that in the event they decided to power on it wouldn't wake us up. We also purchased an SD card to free up space. It took my husband, who is an IT professional, awhile to even figure out how to get the Nabi to read the SD card and, like others mentioned, it will not store apps. It does store videos, which is a plus, but depending on the apps purchased it doesn't take long to run out of space. My girls seem bored with the Nabi Jr's lately and don't really use them much anymore. I'm really contemplating selling them and buying them a Kindle or another regular android tablet. Very dissatisfied!ORIGINAL REVIEWWe purchased our Nabi Jr's about two months ago for our 3 1/2 year old twin girls after spending countless hours researching all tablet options. We chose the Nabi Jr. because we liked that it's an Android tablet with the \"mommy mode\" and that we could purchase apps much cheaper through Amazon App Store. At first I was in love with the Nabi. Then, after about a month, we started having various issues with it.My biggest complaint is the lack of customer service. They pretty much direct you to their Facebook page. I do not like having to use a social media outlet to get help. These tablets are a good price, but they are expensive as far as toys go and we bought two of them. I fully expect to have access to customer support if/when the need arises and I was shocked at how lackluster their customer service is. One of the Nabi Jr's quit charging about 6 weeks ago. It would not charge with either charger. We bought the warranty through Wal-Mart but they directed us to call the manufacturer. We called (it took awhile to find a phone number) and were told that they do not have any more chargers in stock and that we would be put on a wait list and should receive a call within 3 or 4 weeks. Fortunately it started charging again on it's own because it's been a month and a half and they never called back. I don't understand how a company can put an electronic product on the market, one geared for children no less (who are notorious for breaking things), and not have replacement parts available. I find this to be quite unacceptable. If you read through the complaints on the Nabi Facebook page you will find that I'm not the only one complaining about this.My other gripe is that one of the Nabi Jr's does not hold it's Amazon Apps. I have to go back into \"mommy mode\" and reselect all of them to get them back on home page so my girls have access to them. I don't know why this happens, but it happens at least every other day. Since we have two, and I have twins, they of course have to have access to the same apps or else I hear about it in the form of whining and tears of frustration. The apps that are available through the Nabi app store are nice but more basic and my daughters' favorites are all apps purchased through the Amazon App Store.I struggled with how many stars to give the Nabi Jr because my girls absolutely love them. I was very surprised by how user-friendly they are. My twins figured out how to navigate through the apps very quickly. So because they love the Nabi Jr I am giving it 3 stars. If it were just up to me, I would probably rate it a 2 star. The Nabi Jr. is very durable, colorful, lightweight, and again I love that I can purchased apps from Amazon and Google. I just wonder if the company was in such a hurry to get the Nabi Jr. out that it almost seems like they jumped the gun released them too quickly. The customer service is practically non-existent, parts are out of stock or unavailable, and they advertise Nick Jr. apps that still are not available (as of 5/30/13) which I feel is a bit of false advertising. My twins love Bubble Guppies so I am excited about the app, whenever it finally becomes available.If you choose to purchase a Nabi Jr. I highly recommend purchasing the extended warranty offered at the time of purchase.", "Title": "UPDATE Kids Love it, Parents Not So Much", "Date": "May 30, 2013"}, {"Author": "S. Gomberg", "ReviewID": "R2BINPL9Y43WWA", "Overall": "5.0", "Content": "To be honest, if you aren't a technical person, then this 4GB nabi probably isn't for your kids. One of the main problems with this model is the limited memory for apps. Fuhu really messed up here out of the gate on their first jr tablet with a measly 4GB, which only 1.7GB is usable for apps! The other 2.3GB is partitioned for the Android System and the Cache partition and the backup boot/recovery partitions (which is EXACTLY why months later they released a higher end version with 16GB and upgraded specs). So that leaves you about 20 small games/apps, which if you're like me and want to install everything to then just give it to your kids so you wont have to reconfigure it for months at a time, then you'll max out installing apps at around 25.. So my recommendation is for you to just spend the extra $40 if you have it and get the 16GB edition. It also has more ram (1GB RAM vs 512MB RAM of this model), as well as a faster processor TEgra-3 and a slightly higher battery capacity.otherwise if you have already purchased the 4GB model or are a techy person, then this review is for you.I believe this is my very first review on amazon and because FUHU really screwed people here on this model I felt inclined and responsible to help my fellow man out and those who have kids (I have 2 boys - 3yr and 4yr, and they LOVE this tablet).I'm just doing this review off the top of my head, nothing in order so please bear with me.The Pros:Screen Protector - It comes with one! (just cut the small tab that they tell you to hold and remove , off!) Then leave the screen clear protective thingy on! I did and was SO glad!) and its perfectly cut/sized already. Viola!MegaBumper on the tablet! you really have to drop this thing at a very bad angle, or step on it or drop something on it to break it.. really guys.. and if you did then ya, sorry but that's how it is these days..even with cell phones with insurance, they STILL dont cover a cracked screen and you'd still have to pay the $100 deductible fee which is the cost of the tablet anyway, so lets keep it real and try to supervise the kids or teach them good tips on how to handle it! lolParent mode (not necessarily mommy mode, there is also daddy mode, ok..) this gets you behind the NABI interface to let you install and configure the tablet for your kids.$99 bux. I mean seriously? Awesome, price is perfect. There's no WAY i would spend more then that on a tablet that my kids will probably eventually crack the screen and break.. i mean come one guys, you're literally handing the child a $100 bill and tell him to not rip it?? .. its GONNA happen! just be glad that it only cost you 99 bux. I wont even spend $150 on a tablet for myself. I think all those people who let their kids play with ipads and expensive tablets are crazy or just plain rich.. but not me. Besides the way technology works, by the time your kids are older, they'll have something faster and cheaper out there.Rotating Camera! One of my sons was always using Nana's cell phone to take pictures and of course would end up calling and texting all kinds of numbers, so as soon as we got this, not only is the camera cool, but it rotates and he loves it! Fuhu, good job on that. (yeah the camera quality is garbage, but the little ones dont care or even know about megapixels and stuff like that. KEEP IN MIND THIS TABLET IS AIMED AT TODDLERS, YOUNG-INS.. not the teen or pre-teens! and it only takes DECENT pic at full lighting outside, indoor not so much)...Massive 5\" screen.. that's almost 1\" bigger than most cell phones out there these days! Thanks Fuhudecent specs on ram, cpu and battery.Most of all - THE OS - Android!! This is the MAIN reason why I dropped $200 on two tablets for my boys. The other tablets like leapfrog you actually have to pay for the apps!! ARe you guys kidding me?? Just watch, those other competitors most likely wont last. The entire essence of the tablet are the apps it drives and the market is already saturated with android apps, AWESOME ones, great learning apps, reading book apps, puzzle apps, game apps, etc.. it really is a NO BRAINER!!!The Cons:Plastic pen/stylus.. The one it came with.. BASICALLY shouldn't have. They later regretting this once they realized they didn't want a chocking hazard on the tips of the stylus. I wish they would at least offer a choice for the parents to buy the EXACT molded one DESIGNED to go in the back of this tablet holder.. we just don't have any other choice but other stylus pens that don't fit and you have to bring with you.. oh well..So now, this begs the question, why did I write this review?? Why did I mention it was for the techy person??BECAUSE THIS ANDROID NABI JR 4GB LITTLE AWESOME TABLET IS FULLY ROOTABLE. Google NabiLabGui and do your reading, basically I was waiting (about 6 months) until they finally came out with this root method so that I can install google play store and have full SU rights. This lets you take complete control over EVERYTHING on this tablet. And finally was able to get this tablet to use the external 16GB SD card as APP memory!!!!!!!!!!!! ARE YOU GUYS HEARING ME??? This means you dont have to drop $40 on the \"oops - sorry we screwed you customer, heres the 16GB edition\" model from FUHU!! I spend literally 3 days trying to figure it out, trying EVERY program linking the SD card to the system and only 1 program worked and that is LINK2SD, that program along with FOLDERMOUNT I have completely installed over 6 GB of apps and my kids WONT put this thing down!!As a side note just in case you're wondering or you want to interject something about returning the tablet to fuhu, yes the VP or someone who claims to be important at FUHU said he screwed up (read about it on their facebook posting, guy by the name Jason, posted 9/22) and that if bought the tablet before October (if I remember correctly), then they will give you $99 back, BUT YOU HAVE TO NOT ONLY SHIP THEM THE TABLET, BUT YOU HAVE TO PAY FOR SHIPPING, AND THEY WONT REFUND TAXES EITHER, OH AND YOU SHOULD PROBABLY PAY FOR INSURANCE....So thanks for the offer, but NO thanks! By that time I'd be spending around $50 to ship it back to them for what?? Its ok guys, I'll just root your tablet and be on my way.I guess I'm mad that they increased the price by $40 really for no reason.. I mean when it comes down to extending the memory to 16GB and all the OTHER SMALL spec upgrades, there's no way that justifies $40, maybe $10, MAYBE!!I think they're doing themselves an injustice because you cant get the $99 tablet at retail anymore, or at least FUHU is backpedaling very quickly on the botched launch of their nabi jr.. I'm glad I jumped on it and have ZERO regrets. It really is a great product, but then again, I run a tech company and am a tech.. so sorry to everyone else.Hope this helps someone!!!Oh yeah, did I say the tablets are awesome! Now that they are rooted, google play store and have 16GB (I may even increase to 32GB later), these tablets are well worth the $99.P.S. Also I found out a way to image one nabi and restore it to my other sons nabi so they BOTH have the exact image of each other and not complaining about what games/apps they didn't get when they see their brother playing.. lol, as wells as backing up the launder screen as they screw it up and move apps around, i just copy and past the launcher.db file back anytime I want and all is PERFECT again. ;-)P.S.S. Yes you have to disable in-app purchasing from amazon and password protect your Google purchases, i learned the hard way.. thanks sons!P.S.S.S. The charging mechanism is weird on these tablets. This is how I charge them at it works EVERY TIME:Upon powering off, wait about 20 seconds, then plug in the USB cable to charge it, and WATCH THE SCREEN CAREFULLY IN THE DARK (or cover part of the screen with your hand). It will quick flash for about a split second. That means it WILL charge.. if you DONT see that quick white flash on/off, then you need to either power cycle again, or hold the power on/off again. Basically I've had these things plugged in all night and it will NOT charge unless the tablet fully powers down/shuts down PROPERLY. This means you shouldn't hold the green power button to turn it off. My son initially was turning it off that way, but that doesn't do a clean shutdown to the system. You need to hold the green button for a few seconds, then select power off, then click ok, then let is shut down! THEN YOU CAN CHARGE IT!Forgeting PSSSS - listen as of this post 11-8-2013 I installed their latest update v1.2 and its rooted working great, but yes, we are still \"waiting\" for the WINGS program.. lol..Any Questions? Thanks for reading my 1st review?? (I think.. I dont know.. maybe its my second)...", "Title": "Hope this helps a few people...", "Date": "November 8, 2013"}, {"Author": "nina", "ReviewID": "RHYL1XM5Z1HZU", "Overall": "4.0", "Content": "I bought this for my two-and-a-half year old son. At first he didn't really like it, he was easily frustrated with some of the games that came pre-loaded on it. However, I sat down with him the next day, and encouraged him to keep playing, keep solving puzzles, counting, learning his alphabets, etc.. and within the day, he was hooked. Now he loves his Nabi Jr. and I love that I can have my iPad back. His favorite games are \"Beck and Bo\", which I downloaded free from amazon app store, and \"ABC Puzzles HD\" which I only paid $1.99 for (also off the amazon app store).PROS:-It's rechargeable, so you're not running through batteries like crazy.-You don't have to buy cartridges to use it like you have to do with the innotab and leap pad.-It already comes loaded with age appropriate games/puzzles. My son loves most of them (especially the puzzles).-Comes in handy when my kid starts getting cranky on shopping trips and having a meal at a restaurant.-Able to connect to wifi.-Has a Mommy/Daddy mode that's password protected (you can also access a web browser and e-mail from this mode).-You can have different user profiles on it, so when my youngest son gets older they could technically share a nabi, but I'll probably just get him a new one since the price is so competitive, $99 is not bad at all.-Able to download Amazon App Store. If apps are not free, they're only about $.99 - $3.99. Still better than $19 cartridge for a leap pad.-Compatible with Netflix (however, I did have to go into my Netflix settings to configure the video quality. This way, my child's TV shows and movies run smoothe on his Nabi Jr. Not really a big deal, he doesn't have complaints, and rarely watches Netflix on it anyways).-Has a rotating camera that takes pictures as well as videos. (Just FYI: There are two plastic films over the camera which you need to take off so pictures don't look so blurred).-Has nice grippy bumpers that work! (He's dropped it on the pavement by accident getting out of the car, thrown it purposely [though I haven't let him do that again] when he got frustrated the first time, and it survived without a a scratch).CONS:-While it's rechargeable, the battery life doesn't very long. Maybe 4-5 hours of non stop playing and unfortunatley it takes just as long (if not longer) to recharge it back to full power.-After a week our nabi jr. stopped charging. I contacted Nabi through Facebook, and we figured out that it was the wall adapter/charger that stopped working. I was then told that the company couldn't send me a replacement charger because they haven't officially released the nabi jr. yet. They encouraged me to return the whole thing back to Walmart (where I bought it) or wait until it is officially released, and then fill out the necessary paperwork to get a new one. Fortunately, I had an extra wall adapter from my HTC cell phone which solved this problem for me. I read a review by another parent complaining about the same problem, and it only validated my hesitation in going with that route. Why would I return the entire tablet (which already has a good amount of new apps downloaded on it) with the broken charger just so I can get a new charger that's only going to break in another week or so anyways? Fix this Nabi.-It comes with a fake stylus. Lol this is just so silly to me, really Nabi? You couldn't just incude it? Oh but wait, not only do you not include it, it's not even available for sale yet! In fact, most of the accessories for nabi jr. have not gone on sale yet. I wanted to buy a screen protector, no such luck. However, I did keep on screen you're supposed to peal off on. I just snipped off the little tab in which you're supposed pull it off with, and smoothed out the little air bubble. Worked out well for me, I didn't have to spend extra money, and it was already perfectly placed on while in factory).-Nabi accessories are on the expensive side.-The Wings Challenges app does not work yet. It says, \"Coming Soon\". Nabi says its supposed work on the next update, but I have no idea when that's supposed to be. It's May 2, 2013 today, and Nabi has not even given an expected date.-The Chores List is a great idea, but you have to buy Nabi coins to award your child for completed tasks. I guess it then goes towards apps he wants? Haven't quite figured that out yet because Nabi Jr. doesn't come with an instruction booklet or a \"get to know your Nabi\" type pamphlet.-Oh and it has false advertisement. On the website it says something along the lines of learn ABC's with Dora the Explorer, put on a hat parade with Kai-lan, and count with Bubble Guppies. Yeah okay, where? Nickelodeon apps are few and far between.-Lastly, I have an issue with the free apps which have ads. Unfortunatley if your kid taps on the ad, it'll bypass Mommy/Daddy mode where they are now able to buy/download/install this new app they just tapped on. Does that make sense? This is a chink in Nabi's parental controls. I've tried talking to them about it, to see if there was a solution, but they just gave me a bunch of runaround answers, and refused to admit that this was a loophole for game developers.Despite all the cons, my kid loves his nabi, and I've learned to keep the wifi off so he doesn't accidentally start charging things to my debit card. I'm actually very impressed with how helpful it's been as a learning tool. I watch him play on it and I can see the gears in his brain working lol. Nabi also made 5 apps free for download to help with autistic children. I think this is wonderful. It may be a marketing tool, but I still think its great they've picked a route that's mutually beneficial.", "Title": "Nabi Jr.", "Date": "May 2, 2013"}, {"Author": "Ashley", "ReviewID": "R3THZX5M7NDDVM", "Overall": "1.0", "Content": "A fair warning to everyone out there considering buying the nabi Jr:We bought a nabi Jr from WalMart in May 2013 and our three-year-old absolutely loved it. We couldn't have been happier. We'd read many good reviews about the fact that it was made to withstand drops, and Nora was actually really careful with it. Then the inevitable happened: she dropped it. Her screen cracked on a diagonal and only one side of it works.I contacted nabi Cares, but it turns out they don't. I've been told there's nothing they can do. There is no screen replacement program for this product. There goes $100.It was fun while it lasted, but we won't be buying nabi products in the future. The \"Drop-Safe Bumper\" was a big disappointment. We cannot justify spending more money with a company that promises \"The nabi Jr. will handle those little bumps and drops without complaint and with its chunky construction and drop safe bumper, it will make it home undamaged after show and tell.\"I thought my daughter would learn great lessons with this device, such as number recognition, phonics, and spelling. Instead, she's learned that sometimes a company cannot stand behind the product it makes.", "Title": "Not \"Drop-Safe,\" so functionality doesn't matter. Don't buy it.", "Date": "July 23, 2013"}, {"Author": "R. G. Price", "ReviewID": "R17LH6WNUD59M2", "Overall": "2.0", "Content": "I just bought two of these today, will be returning them tomorrow. It's a great concept, it's clearly a product with demand, and the physical device itself looks great, but believe me when I tell you that there is no useful content for this device.The details:I am in the market for an educational \"kids tablet\" for use on road trips, airplanes, etc. There aren't a lot of good options, with the LeapPad / VTech type devices using proprietary software that costs about $20, $25 per game, and most other tablets costing too much to be a \"toy\" or not being really appropriate to give to a 2-6 year old.So, despite all the warnings, I gave the Nabi Jr a try anyway. Trust me, listen to the warnings. I'm not even sure that some of the positive reviews I've seen on-line are legit, I don't see how they can be.The device hardware seems great. The touch is a little unresponsive and the device is slow, but this could all be overlooked IF there were actually any meaningful content for this device. There isn't.With the Nabi Jr you CANNOT connect to the Amazon App Store like you can on the Nabi 2.The ONLY App Store you can officially use is the Nabi App store, which is quite lacking. But even this app store won't do it for you, because many of the games on there, perhaps most, were never actually designed for the Nabi Jr, they are generic Android apps, which should be just fine, BUT, the Nabi Jr's OS isn't standard, and thus, many (both that I tried) general Android apps won't run on the device.I tried buying and loading two different apps. Both downloaded and installed, and both locked up within seconds of execution. In addition, I saw many comments on the app store of apps that weren't running on the Jr.They claim on the website that you can \"side load\" apps, but if apps from their own app store won't run, the chances of successfully side loading apps from Google Play or Amazon is pretty low.In addition, this is marketed as coming with content from Nick Jr. and something called Wings Challenge or Wings University or something, which is supposed to be a set of educational games designed specifically for the Nabi Jr. When you click on this on the device it says \"Coming Soon\" (as of the time of this posting).So, without \"Wings University\", Nick Jr content, or even the ability to reliably install apps from the Nabi app store, you are left with the pre-loaded content, which is basically a collection of Android freeware that is not even worth using.These guys really jumped the gun on this and this product is NOT READY for consumers. The marketing department got out way ahead of the developers. I seriously question ANY positive review of this product. I don't see how anyone could give this device 4 or 5 stars. I want to stress, my device did not malfunction, I think the hardware is nice, etc. I'm not giving this 2 stars because \"it broke\" or I had bad customer service. Quite simply, the content for this device sucks. At this point, all this device can do is serve you up some bad pre-loaded Android freeware.I would add that you can get a refurbished iPod Touch 4 for about $120. The screen is a little smaller, and you probably want to get a $10 cover for it, but for not much more money you end up with a far superior device and App selection.", "Title": "Not really a viable device", "Date": "July 13, 2013"}, {"Author": "Bears' mom", "ReviewID": "R3LIJ4JC7XKY7A", "Overall": "1.0", "Content": "I had such high hopes for this tablet, and unfortunately they have all been crushed. The device is slow for starters, and takes longer than you might expect to load when the power has been off. The way the icons are set up, (particularly on the menu screen for my daughter) it's easy to push more than one icon at once/select the wrong function. You CAN get amazon app store ( I did easily) but like other reviewers have said, these 'way better than what came with the tablet' apps available thru amazon freeze up NON-STOP! Free ones, and apps you pay for. After we had it 3 weeks, the sound completely stopped working one day- one LONG phone call to nabi customer service later, they had me 'factory reset' the device, which erased the few semi-working apps we had downloaded (and paid for, in a few cases..) all progress, awards, etc, that my daughter worked hard to get, all gone, and a big disappointment to a 4 year old. When the sound 'returned' to the tablet, it was gravely and distorted. I played it for the operator to hear. The operator said if I pay to send it back to them, they will pay to send a new one back. 'Can I get expedited shipping?' I asked, explaining that my autistic daughter likes this tablet, despite its quirks, and would interpret it's 'missing' status as a punishment. (This is a tough issue we have been working on for a long time, when toys break and need gluing, or library books get returned) she said that is not something their company has ever done or will ever do, and by 'bringing it up to corporate' (which I never even hinted at, let alone suggested..) would 'only drag the process out for the same answer'.. Wow. Super. Thanks...i so desparately wish I had gotten ANY other tablet than this after dealing with all the issues with it. Also, google play gift cards do NOT work at all on nabi jr. I have heard nabi 2 is better, but I would not buy from this company again. I would rather have my money back than have them send me a new tablet at this point. If you buy one, make SURE you can return it!!", "Title": "what a dreadful device", "Date": "August 19, 2013"}, {"Author": "Paul Liechtenstein", "ReviewID": "R35XNXBRXP30UF", "Overall": "2.0", "Content": "1. Product quality: I remember when nabi 1 came out and there was a huge issue with the charger, you'd think nabi learned from that incident and improved their charger's quality. nabi 2 came out and the charger issue came back. nabi had to built an entire site dedicated to replacing chargers. If you've ever taken apart a nabi and see the components inside, it is a frightful sight. Parts are held together with masking tapes.2. Customer service: Most of nabi's customer service is done through Facebook. You leave a comment on Facebook and someone from nabi will reply. I don't know who at nabi thought this is a good idea because most of the time your questions get lost in the sea of questions, complaints, and comments. Most customers complain about nabi support's response time which can take weeks or even months.3. Contents: Most of the preloaded applications on nabi can be downloaded for free from Google Play or AppStore depending on if you use Android or iOS. If you take a closer look at nabi's app list, most of them are demos you can get for free or copy-cat apps you can download from Google Play or AppStore. Why risk your money with an unknown brand just because they helped you pre-downloaded some apps?4. App Store: No Google Play. In order to get more apps on the device, you'll need to download the Amazon App Store which has a very limited selection of apps compare to the Google Play store. nabi does have their own app store called AppZone but the quantity and quality of the apps in AppZone leave much to be desired.5. There are better choices: Spend a few bucks on bumper and buy from a tablet reputable company like Google, Apple, Amazon, or Samsung. What you get is better product quality, customer service, content, and most importantly, peace of mind.", "Title": "Five reasons why you should save your money and not buy from nabi", "Date": "September 13, 2013"}, {"Author": "FantasyReader", "ReviewID": "R88YL76CVG5U1", "Overall": "2.0", "Content": "No Nick Jr. relationship as advertised, no wings, and apps are hard to acquire other than their store. The amazon app downloads through google and nabi declined to follow their guidelines per there own statement. I got screwed on this one! Horrible lying company!", "Title": "Nabi Lies!", "Date": "August 23, 2013"}, {"Author": "Mama Apple Sauce", "ReviewID": "ROUUMLR1NMFL8", "Overall": "1.0", "Content": "So sad to say the the very reasons I purchased this for my child were two things that were promised but never delivered.  The \"wings\" learning system that is highlighted on the website for this product, is still \"coming soon\" yet is it advertized as being included in the box.  Also, the Nick Jr. content is also \"coming soon\" although it was advertized as being included. Majority of apps do not work and the one's that are included are pretty much just puzzles and songs.  This company should be ashamed and needs to offer parents who purchased this product something.", "Title": "False Advertising", "Date": "September 12, 2013"}, {"Author": "Robyn Peterson \"snoboardbabe77\"", "ReviewID": "RD6ZUZ8O0AEDQ", "Overall": "4.0", "Content": "I have never written a review but felt compelled to write my first regarding this tablet.My husband and I have done quite a bit of research on tablets that might be a good fit for a 2 1/2 yr old child. While I didn't want my son spending a ton of time on a tablet, in the age of the Iphone, etc. it is difficult for them not to be grabby and want to explore our electronic devices. However, an Iphone is $600 and we were getting tired of hoping he wouldn't drop it! I looked at several tablets- Kindle, Polaroid, Coby, and Nabi, Jr. I did not want to pay more than $100 - (i.e., no Ipad or mini).The Nabi Jr. is the perfect size for kids 2 1/2 - 6 yr of age (maybe even older). It has a rubberized red sleeve so to speak and while a child can remove it, it does help if it falls. Our son has dropped it twice-once outside and once on hardwood floors. To date, after a month of CONTINUOUS USE, the Nabi, Jr. has held up. It is durable & have had no issues with charging and holds decent amount of charge time. We did purchase 2 year warranty though. Through Walmart, it was $9 extra.I am NOT computer savvy (though I work on a computer daily) and don't get giddy about electronic gadgets. The first day I tried to download and add games, I thought I was going to go crazy and throw it out the window. But, I took the time to go to Nabi's website (which is yes, lackluster) compared to a lot of other competitor sites and yes, they do direct you to their FB page, but the info is helpful and some of it is just dinking around with the product yourself first. I will say that any customer info is geared more towards the Nabi or Nabi 2 rather than the Jr. Slight negative there.There is a mommy/daddy mode which is accessed through a password (to help your kid from buying apps), once you enter that, you can touch amazon app store. Once there, you choose the apps you are interested in (all the ones I've done are free)...once downloaded and installed (it will tell you if there isn't enough memory space), after that; you need to hit the apps +/- button where you can select ones to add to the homepage or deselect ones that you don't want to appear on the homepage. Those that are moved to the homepage are the ones most readily available to your child. To the reviewer who said they always have to reselect...maybe there is a malfunction that we haven't found that to be true at all. Once selected, it remains selected til you deselect it. After you add it, you must touch the nabi homepage icon...once there, you touch the 6 boxes on the right-touch the app you want to add, hold and the screen will switch to the homepage. You place it on a square and it is ready for child use. For the reviewer who said it was slow-that is probably your wifi or internet rather than the product itself. We live in Northern Rural MN and have TERRIBLE internet. I load apps late at night or early in the morning. Any other time, it is slower than molasses. The other upside is - once loaded, we don't need wi-fi for many of the apps to work. Since you don't pay for data (like smartphones, Ipads), Oliver can use this product in the car while traveling, usually without issue. I won't say that it doesn't freeze up from to time - but whatever...it's not a big deal.The Nabi Jr. has many preloaded apps - but in all honesty, we have taken 2/3 of them off and put our own in for counting, memory, matching, etc. Oliver is 2 1/2 and is doing very well with it (he uses it like a pro now) and he enjoys books on it too.For $100, it is what is and delivers enough happiness to keep us, and the child we bought for, happy.", "Title": "This is a great learning tablet for toddlers", "Date": "September 9, 2013"}, {"Author": "Dannmarr", "ReviewID": "R2TCETXTJ4ZBGM", "Overall": "5.0", "Content": "I bought two for my 3 yr old and 5 year old. It has loads of apps for learning. Amazon has pleanty more games for free! I have control over the downloads and I was able to save SpongeBob and Mario Bros videos from Youtube. I use it when the kids are asleep. My older kids play with it more than with their own ipods. It is well built and I haven't had an issue so far. I only wished it had a manual rather than going on line. I love the look, it is kid friendly but also attractive to adults. For $99 it is worth it!! Update:my kids still use it and so do I. My 1 yr old daughter is now attracted to it! It has an app for learning animals. It shows the photo, it pronounces the name and it makes the sound of the animal. The look on her face when she see the cat is priceless! The only drawback so far is the battery life. I need to plug it in every night.Update: The bad reviews are sad. Of course it will break if you drop it. Of course it's not an Ipod, its a learning tablet for young children! My suggestion is that YOU charge the tablet every night before bed time, not the kids. This way they won't be angry the next morning when it's dead and throw it on the ground. Don't let them handle the charging part, if it's done wrong the wires or the input jack can be damaged. It's a great product for a small price. Enjoy!", "Title": "Very pleased!", "Date": "April 21, 2013"}, {"Author": "Esther", "ReviewID": "R3F171JF02M1KD", "Overall": "2.0", "Content": "I purchase this tablet for my baby girl 3 weeks later the charger broke contacted this company and was told that there was not chargers avalible...I can not find one to fit anywhere! Please Naby people make it right like you claim in the website and produce some chargers.", "Title": "Really mad costumer", "Date": "May 4, 2013"}, {"Author": "Clint Armstrong", "ReviewID": "R2FHTLHTUR69CZ", "Overall": "1.0", "Content": "This is the quote from Nabi support on a getting a replacement charger cable: \"currently, we haven't finalized our nabi Jr. charger replacement yet. We'd love to get you a replacement charger but in the meantime, we ask that you wait for a bit.\"This is absolutely amateurish and unacceptable to not have replacement parts for a kids product. Especially when they use proprietary cables that can't be bought anywhere else.", "Title": "Guard the charger with your life.", "Date": "May 29, 2013"}, {"Author": "rosalyahia", "ReviewID": "R2QUMFOLUBS491", "Overall": "5.0", "Content": "Bought all 3 of my kids tablets two girls ages 9&10 the next books 8 inch which they loved,this is their second set of tablets my son who is 4 broke a zeepad tablet in half being rough on a game so I needed something tough that was still a tablet for him.Idk why anyone gives this tablet a bad review its perfect once your informed on what you get.It essentially has a child friendly mode with a rotational camera which my son loves.No annoying accidental button pushes like on an adult tablet which means he needs nearly no help while I am driving :) Its smaller for little hands yet still looks like my daughters tablets while in mommy or daddy.mode it has wifi and as for not having google app store I just downloaded the amazon app store for the same games.The thing come preloaded anyway so my son was busy with what was on it.I can google email and facebook if I wanted all on his nabi jr.It is fast and responsive no lag no issues.And he can drop it or bend it or throw it and its just fine.The look appeals to my son cause hes four and it looks like a toy but its a fully functional android tablet.Cant beat that the educational content is great for my son cause hes having fun while learning no stupid accidental back button push the apps are big for clumsy fingers too. The local walmart had them in stock so I walked in and got it in hand bought a two year replacement for $10 and paid $99.Pretty awesome deal.", "Title": "did my research bought and love it :)", "Date": "June 5, 2013"}, {"Author": "Luis V.", "ReviewID": "R1RRCW76ZFGARC", "Overall": "1.0", "Content": "We bought 2 for my daughters (2.5 and 5) and after 2 weeks both are broke.1 no longer has audio and the other will no longer charge.I know my kids were going to put these toys through hell, but only 2 weeks?!?Better off spending good money on good products.I have had my iPad 4 with an otterbox for 9 months and it has stood up to their torture test. Moral of the story... Go buy an IPad mini an an otterbox and you will be much happier.", "Title": "Good idea bad execution", "Date": "July 10, 2013"}, {"Author": "Victoria Nelson", "ReviewID": "R28W30YKLABWVC", "Overall": "1.0", "Content": "I feel like Nabi has pulled a fast one on me. My son wanted a Nabi jr because all of the nick jr stuff and the Wings (which is their big selling point). After receiving it we found out that they still hadn't released the nick jr or wings content, even though it is supposed to be preloaded (according to the box) they finally released it, and now you have to pay extra for it, and it's not cheap. I originally bought the nabi over the leappad because it seemed like a better value because of all the extras, but since they are charging more for these extras it turns out leappad and all it's games are still cheaper, and at least they are upfront about their costs. Also, you're supposed to be able to download apps from android and amazon marketplace onto nabi jr (another selling point) but half of these apps aren't compatible (and don't tell you until after you've paid for it) and the other have ads (even though this is supposed to be kid safe, my kids don't need an ad for rehab centers in San Antonio popping up). I will be purchasing leappads for my other 3 children and I would recommend any other parents out there do the same. I wish someone had told me this back in June. Nabi doesn't care, so don't be fooled like I was.", "Title": "False advertising, will end up costing a ton if you want any of their advertised content", "Date": "November 13, 2013"}, {"Author": "Tyler Johnson", "ReviewID": "R11Q3BFOA8QZEP", "Overall": "2.0", "Content": "I like to wait to review stuff, so I can give it a fair shake. We've had these tablets (we have 2 for each of my sons) since Christmas. This review is both positive and negative. We'll address the positive first.Positive:My kids have fun playing the couple of apps on this tablet. I've installed several games from the Amazon App store that they really enjoy. I also like the parental controls that keep my kids safe and in their own little tablet world. As far as positives go, however, it ends there. And let me note that the above points are the only reason the Nabi Jr. is getting 2 stars, instead of 1.Negative:This tablet has been an annoyance for me. I'm a web developer and I love my technology. I do a lot and figure a lot out when it comes to different electronics. I'm just letting you know, so that you know this isn't coming from someone that doesn't know what they're talking about. With that said, why does this tablet drive me crazy?First off, we've been having charging problems. Sometimes the Nabis charge from a wall charger, but then they stop. So then we move them over to a computer and they start charging again. We come back later and they're completely dead. It's really annoying! Especially when we're about to go somewhere, we've had their tablets plugged in all night, we tell the boys they get to play with them in the car, and then we find out that they didn't charge at all and are dead. What is Fuhu's solution? Buy a new charging cable. We have two that are both doing this! That's your solution? Buy another one!?Second, when we've had them plugged in our room we've noticed weird things at night. For some reason the screens like to just randomly turn on whenever they'd like. That's probably why, when they stop charging, they are then dead in the morning.Third, and this is really my biggest grievance, is what I believe to be false advertising. We bought the 4GB version for each of our boys. You get a 4GB version and you think you'll have a little bit of space. Wrong. Our Nabi's literally had just under 1GB of space left when we first turned them on. All of their software takes up a lot of space. I thought, \"No biggie! It has expandable memory!\" Just yesterday I got around to buying 2 16GB, class 10 micro SD cards. I got home and tried to use them and I was furious! They forget to mention that the \"expandable memory\" only works for music, pictures, and videos. That's right! You can't install any apps on the SD card.I went online to further investigate this fact and found some people complaining about this issue on Facebook. Nabi's response? Move your pictures, music, and videos over to the external SD card. Good one Doc Obvious! You forgot about the part where moving that stuff only frees up 500 more MB. So now I only have around 1.4GB for apps. If you get any premium apps that are actually nice, then you have no space left, which is where I'm stuck now.Fourth, further false advertising, and this time about the worth of their pre-installed apps. All of the apps installed, which they used to claim (noticed that they've removed it now, but it was claimed when I bought it) were worth $70 are all free on the Amazon App store. Good one!Honestly, unless they release some sort of update that fixes some of these issues, I won't be a Nabi customer ever again. There are other tablets for kids out there and it's a market that I'm sure will have some other offerings. Other offerings that I'll highly consider over the Nabi!", "Title": "My Slogan for this Nabi - \"Limited Fun\"", "Date": "May 16, 2014"}, {"Author": "Samantha", "ReviewID": "R233FAY6VD3HVB", "Overall": "1.0", "Content": "After my son got this for Christmas he loved it ... It was very difficult to get some of his favorite games on there such as angry birds or minion race. Took me hours to figure that out. Then once he was really into it playing with it ever day it stopped working. They told me it was a charger problem so we waited 3 WEEKs to get a new charge . I had to. Call back 3 times to get someone to tell me when we would receive it and finally I was told it was on back order... Now we finally got the charger and the nabi is still not powering on. Just got off the phone with them and now we have to send in ours an wait until they receive it and then finally they will send us a new nabi ....  Who knows how long all of that will take.  I am extremely disappointed in this company and frustrated the.  last person I spoke with was completly rude and did not care at all . Don't waste your money on this. The company is horrible and they don't  care at all!", "Title": "Extremely aggravating", "Date": "March 7, 2014"}, {"Author": "Colleen Dowdy", "ReviewID": "R3PGV2R3SFIG30", "Overall": "1.0", "Content": "This nabi Jr. didn't respond like it should. Children especially toddlers aren't patient, so when the touch an app they want it to respond right now this nabi did not. I tested it as though I was my son going in and out of apps quickly and it just hosed up. My kindle fire didn't do that, and I was purchasing this so that I could get my kindle back as my son loved the kindle freetime and played it frequently leaving me with no toy to play with ;). I had this one day and it malfunctioned the whole time, plus it had tons of proprietary crap. If you're concerned that a kindle might be too much for a toddler or that he'll break it I have proof that it's sturdy and the finite kid case I bought for it is made of like a rubber, like a croc shoe rubber and it holds up wonderfully. My son is now 3 and is ALL BOY, he throws tantrums and the first time he threw the kindle I was like great well there goes $139 but nope the case protected and he's had it since he was two and still loves it. NABI JR IS A NO, COMPLETELY WORTHLESS!! BUY A KINDLE!!", "Title": "JUNK! Kindle fire HD was a much better value $139 and it'll grow with my son who was 2 at the time of purchase.", "Date": "December 31, 2013"}, {"Author": "Stewartamd", "ReviewID": "R1U1PR7LOI8FXY", "Overall": "4.0", "Content": "I have never written a review but after reading all the current ones felt compelled to do so. I didn't understand why some said it could use amazon app store and some said it could not so I decided to see for myself. I went to best buy and the sales rep informed me it can not. He was however wrong. 5 minutes after getting it home I hav the amazon app store installed and also already have a few apps from there up and running on our nabi jr. It just isn't easy to figure out how. Go here for step by site instructions. http://everythingnabi.blogspot.com/2012/08/installing-configuring-amazon-appstore.html They work. The only thing they forget to mention is that after the app says beginning download it disappears not to be found. You have to hit the time on the bottom right of the nabi and the download appears hit the download and there it is an icon and all on your nabi screen. I just thought I would share for those less tech savvy than myself. So far WE LOVE IT! especially after my 2 years old tossed my ipad down the stairs :)", "Title": "Can use amazon app store just not easy to find", "Date": "September 13, 2013"}, {"Author": "J. Cokens", "ReviewID": "R2RALWLOPYPJXE", "Overall": "1.0", "Content": "We bought this for our 3 year old several months ago, and there has yet to be an update to include the advertised Wings Challenges and Nick Jr.Apps. There isn't enough storage to store apps and according to their support you are not able to store apps on the SD card. The tablet locks up constantly and the battery life is awful. Do not buy this tablet.", "Title": "Do Not Buy This Tablet!", "Date": "October 2, 2013"}, {"Author": "Bryan D. Johnson", "ReviewID": "R2AFLZI2AA4VXU", "Overall": "1.0", "Content": "It connects to our wifi network.  It has a few apps included.  I spent $$ downloading new apps.  Had some message pop up about system UI?  Spent hours backing up to computer.  Reset to factory options as suggested.  Now cannot connect.  All the apps i purchased are gone.  Waste of my time and money.", "Title": "POS", "Date": "October 3, 2013"}, {"Author": "Yuri", "ReviewID": "RGMF6UI8WJV56", "Overall": "3.0", "Content": "I bought this tablet for my 1 year old. He absolutely loves it. He has learned so much with apps that I have side downloaded for him, because unfortunately it does not come with Google play. The down side is that I bought it specifically for two reasons, Nick Jr. apps and the Wings Challenge they advertise it came with but it didn't. When I tried speaking to customer care about it their response was \"soon\". That's it just soon, very disappointed on my part, but again my child does not care about any of that. I have transferred some Nick cartoons videos, Dora, Sponge bob, for when he is on the go. When he is at home he uses Hulu Plus if he wants to watch videos. The memory on it is quite small, only 4GB and of that only 1GB is left with the other games that already come pre-installed. I gave it three stars because my child loves it, minus 2 stars because I was not completely satisfied.", "Title": "My son loves it but....", "Date": "September 7, 2013"}, {"Author": "ETZNAB", "ReviewID": "RNVIYPSEF9L88", "Overall": "4.0", "Content": "PARENTS visit YouTube for a slew of \"jailbreaks\" for this device! It will allow for a more fully functional Android-ish tablet. Totally worth it!", "Title": "Underrated", "Date": "November 20, 2013"}, {"Author": "H.", "ReviewID": "R21V3ZGZBKD5I", "Overall": "3.0", "Content": "Good for entertaining kids but then they want to have it on every minute.  It was a gift and I know that shortly after they got it the power cord broke.  they had to get another one.", "Title": "great for entertaining.", "Date": "June 10, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R5DFWEKV0ENKX", "Overall": "3.0", "Content": "I like it for my kids because it has a lot of preloaded learning games. It's educational but you can also add other apps. My kids(3&5) love it the camera and the games.", "Title": "Kids love it", "Date": "May 28, 2014"}, {"Author": "Orlando Mabry", "ReviewID": "R32D3LQGN6J8BA", "Overall": "4.0", "Content": "it is great i would have ordered another one but it did not come with wall charger or computer charger i had to buy seperate otherwise its great", "Title": "4 stars", "Date": "May 20, 2014"}, {"Author": "Brittney Hughes", "ReviewID": "R2P2LE96HJOZH3", "Overall": "5.0", "Content": "My two year old is very computer savvy and was constantly having that argument that parents are finding themselves in when their little ones want to \"use\" their I-Pads, etc.  I purchased this for my granddaughter so that she would have her own Ipad and age appropriate content.  She loves the Nabi Jr. and now everyone in the family is happy.", "Title": "My Grandaughter Loves this", "Date": "May 20, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1M87PUT9MI4C2", "Overall": "5.0", "Content": "We purchased this educational electronic toy for Christmas as a gift for a classmate of our youngest Grand Daughter. The youngster loves this toy.", "Title": "Fuhu nabi Jr. 5\" Capacitive Touch Android Tablet for Kids", "Date": "May 12, 2014"}, {"Author": "marla rafael", "ReviewID": "R1NNGCJS0AQCYX", "Overall": "5.0", "Content": "This was a great birthday present for my 3 year old grandson.  It came in the mail the day before his birthday I was so happy with that.", "Title": "Birthday present for my grandson.", "Date": "May 9, 2014"}, {"Author": "obscurebeautyfanatic", "ReviewID": "RY3F3NWT9TZH6", "Overall": "2.0", "Content": "We got this for our two-year-old daughter for her birthday since she really enjoys playing on my iPad and grandpa's Samsung Galaxy Tab. She already has her favorite learning games (Endless Reader, Endless Alphabet, BeBop Blox, and Twiggly) and is used to the iPad functions. We thought the Nabi Jr. would be a good choice due to the similar interface and Android marketplace availability, plus it could take a bit of a beating at a reasonable price.Setting the Nabi Jr. up was a bit frustrating. I was disappointed to find that even though it's an Android OS, there was no on-board access to Android Marketplace or Google Play (there are no ways to add them, they're either included or they're not) even in \"Mommy Mode\". Amazon App Store took 6 attempts to download onto the Nabi Jr.; the first five attempts failed. In fact, the Nabi Jr. Exclusive apps even failed to update. If your child already has his or her favorite apps, be aware that selection is VERY LIMITED in the Nabi App Store and the Amazon App Store (due to compatibility with the device).My daughter did not take to it as I thought she would. The included apps didn't really hold her attention and the apps she liked actually loaded only about half the time. Even when she did get one of the apps going, the response time is slow the Home button is so cumbersome that she would accidentally grab it and have to start over again. The brightly colored Power button practically screaming \"PUSH ME!\" didn't help all that much either. She was frustrated with it. In fact, if one of us was using the iPad or Galaxy Tab, she would assume that we were playing one of her games without her!We got this in the hopes of reclaiming the iPad, but it didn't work out. We returned it and will likely purchase either a Kindle Fire HDX 7 or Samsung Kids Tab or get a new iPad for ourselves and give her the hand me down.Bottom line: it would be a good choice to start with provided that the child had no prior experience with a tablet or PC.", "Title": "Good as a first and only tablet. Not good for kids used to using tablets already.", "Date": "March 1, 2014"}, {"Author": "Brian", "ReviewID": "R31A2VL57E9R2C", "Overall": "1.0", "Content": "My wife and I bought a Nabi Jr. for our two year old daughter. Our daughter loves playing with children apps on our android phones so we thought this would be perfect for her. Nabi has its own proprietary app store which is EXTREMELY limited.There are ways to put Amazon app store and Google pay store on the Nabi to download apps. The big issue with doing this is there is not a way to stop small children from making purchases. Getting Google pay store to run is no walk in the park either.The camera is junk. The lens had become scratched within a few days so bad it can no longer take a clear picture. The touch screen is slow and unresponsive. The \"Nabi Mode\" makes setting up the easy accessible apps exhausting to set up.Worst thing about the Nabi is it is very slow. My two year old daughter often brings her Nabi to me to \"fix\" because it is so slow exiting apps or loading apps.If you want a tablet for your small child DO NOT GET A NABI. Buy a normal tablet put a protective cover, a bumper around it and down load a child mode app for it. I did this with my wife's old ASUS transformer prime and my daughter never even wants to play with the Nabi anymore.", "Title": "Don't waste your money", "Date": "February 25, 2014"}, {"Author": "Derrick L. Price", "ReviewID": "R32U907TAESY05", "Overall": "3.0", "Content": "Christmas Gift for my son. Played it three times and then went for a charge. After one complete charge, charger end came loose. Attempted to purchase another charger on the Amazon site and I have ordered 3 different chargers that do not fit. I have tried Radio Shack and other sites, but no ones seems to carry it.", "Title": "Great Tablet/////Cheap Charger", "Date": "February 23, 2014"}, {"Author": "Florence D'Avocato", "ReviewID": "RP24QH8THBOVQ", "Overall": "3.0", "Content": "i BOUGHT MY GREATGRANDSON A NABI JR FOR CHRISTMAS, HE LOVES IT, BUT THE USB.CHARGER STOPPED CHARGING IN LATE JANUARY. hE IS SO SAD NOW AND TORMENTS HIS OLDER BROTHER FOR HIS TABLET. EVERY MORNING HE ASKS ME \"PLEASE MOM MOM CHARGE MY TABBY\" IT BREAKS MY HEART.I HAVE EMAILED NABICARES (NO RESPONSE)AND WENT TO 3 STORES THAT SELL IT AND NONE OF THEM CARRY THE ACCESSORIES FOR IT, ONLINE ONLY HAS IT FOR THE NABI 2. I FEEL I WASTED OVER A $100.00 . COMPANIES SHOULD NOT MAKE PRODUCTS IF ACCESSORIES ARE NOT AVAILABLE FOR REPLACEMENT.", "Title": "FRUSTRATED IN NEW JERSEY", "Date": "February 18, 2014"}, {"Author": "rebecca l.", "ReviewID": "R1BZ2LO6ZP74PT", "Overall": "3.0", "Content": "If I had written this review 6 months ago when we got it for my sons 2nd birthday I would have told you this is a great little tablet. I will be honest and tell you that 6 months after buying it, my son still LOVES his nabi. This Nabi has a lot of really great pros and 1 very BIG con....The Con is the battery life. I read a lot of reviews and I seen the short battery life issues, yet I still bought it. that was my mistake. I thought \"he's only 2, he doesnt play with anything longer than 5 minutes\" It turned out that in this instance, I was wrong. He took an instant liking to his Nabi and has played with it for hours everyday. The battery life is horrendously short. He can play with it for about an hour and half and then it dies. He cries big crocodile tears EVERY SINGLE time this happens. I'll put it on the charger and give it back to him after a couple hours of charging but again after an hour or so it dies again. Now he's 2 and 1/2 so he's not sitting on this thing playing silly games all day and rotting his brain lol He does play some games on it but they are all educational and he enjoys them but a majority of the time he is listening to the Laurie Berkner songs that came preloaded on it. I got him an app for kids songs and he listens to music on it most of the day. He LOVES music. So now that I've gotten the CON out of the way let's talk about the PROS:  As I said above it was bought for my 2 yr old son so it has withstood it's share of temper tantrums (especially when the battery dies) My son has thrown it, beat it off the floor and God knows what else and it's basically indestructible. You can download the amazon app store to get lots of new games for it. I downloaded netflix on it and he loves to watch shows on his Nabi. It comes with quite a few programmed apps. There are several educational games and a bunch of Laurie Berkner songs which he loves. it is easy for him to use. He had a bit of trouble at first being only 2, but he caught on fast and now he's a pro at using it. If this Nabi were like 50 bucks I'd say sure it's a steal, go buy it....for 100...you're better off to buy a kindle fire. For my sons 3rd birthday I already ordered a kindle fire with a kid proof case (kinda like an otterbox) My older son has a kindle fire so I know that my younger one can use it since he generally tends to steal it when his Nabi dies. So, overall I would say, save your money and buy the kindle fire with a good case instead. Yea you are spending about 40-50 dollars more but it's gonna grow with your child and last a good long time.....", "Title": "not as great as I originally thought...", "Date": "February 14, 2014"}, {"Author": "terri weatherspoon", "ReviewID": "RT0YIWVNT0I7A", "Overall": "5.0", "Content": "the item arrived as predicted and works well my grandson will love it once he is old enough that  he can use it", "Title": "fubi", "Date": "February 13, 2014"}, {"Author": "frances laws", "ReviewID": "R1XC423Y17Q8Y1", "Overall": "5.0", "Content": "I  know my  greatgrand daughter would loves this tablet because she  played with someone else Fuhu nabi jr tablet and she love it", "Title": "Grandaughter love tablet", "Date": "February 4, 2014"}, {"Author": "kingtj134", "ReviewID": "R2709ET0JL4KTQ", "Overall": "3.0", "Content": "Ordered 2 of these for my niece and nephew for the holidays. The kids are 8 and 9. While they like the tablets, they don't love them. It is hard for them to download apps (had to install the Amazon app store in order to get some of the games the kids wanted), and they must take the tablet to Mom to get the apps \"approved\". While this might be great for a younger child, say 4ish, it doesn't work great for 2 tech savy kids. The pre installed games and activities are geared for very young kids, such as learning to write numbers and letters and singing the ABC's. Had I known a bit more about these tablets, I would have opted for a cheaper Android style tablet for older kids. Would be great for kids that are preschool age though!", "Title": "Not what I expected", "Date": "February 3, 2014"}, {"Author": "Julie Young", "ReviewID": "R3N8JYWV8979Z", "Overall": "3.0", "Content": "Two weeks after my son received this tablet for Christmas, the screen broke.  There is no way to replace it and I am on a waiting list to obtain one after they are available.  Very disappointed.", "Title": "Broken Screen cannot be replaced", "Date": "February 2, 2014"}, {"Author": "MBWilliams", "ReviewID": "R29QDY2A5ZZDT5", "Overall": "5.0", "Content": "He carries it every where he goes.  It was a great selection I would suggest this Tablet to all.  A wonderful must have for the babies...", "Title": "It was a gift for my Grandbaby", "Date": "January 29, 2014"}, {"Author": "Twins Mimi", "ReviewID": "R3SKI8IU6ICXG6", "Overall": "4.0", "Content": "If your kid has never touched an iPad, the Nabi Jr is great out the box,  If they have enjoyed the iPad, there  will be a brief transition to this android product.  Once done, the kids love it, especially being able to run Netficks and watching their favorite cartoons and movies.  Constructed well for kids tough handling.It only gets 4 stars because the setup for parents was not easy.  I like the fact you can recharge by plugging it in, but the charge does not last a long time.", "Title": "Great tablet for kids", "Date": "January 14, 2014"}, {"Author": "Jewel Butler", "ReviewID": "R14V9PCBVHWADF", "Overall": "4.0", "Content": "Very close to loving this tablet.  All it needs is Google Play app store and I really would love it.  I hear they are working on that though.", "Title": "So glad I got this for my little girl", "Date": "January 14, 2014"}, {"Author": "Ron Jensen", "ReviewID": "R1CTNWE2OMYIVK", "Overall": "1.0", "Content": "Table looked pretty good in the store. Got it home and discovered you can't get into \"parent\" mode without providing a credit card. Once past that hurdle I installed Amazon's app store and a few apps. All was well. This morning I found its in recovery mode and no amount of volume nob tapping will get it to continue.Its going back.", "Title": "Started out pretty good. Bricked on second day", "Date": "January 13, 2014"}, {"Author": "Jill Remer", "ReviewID": "R1WWW14X4PBT8P", "Overall": "4.0", "Content": "It was a little tricky for us and my 3 year old at first, but once we got the hang of it, it's been great. Lots of pre-installed educational games and music. My son loves taking pictures with the camera.", "Title": "tricky at first", "Date": "January 13, 2014"}, {"Author": "Kirstin81655", "ReviewID": "R1PF9QE3HM8NHH", "Overall": "5.0", "Content": "Perfect for preschooler and younger. She loves discovering new games and putting puzzles together on this. There are a few games that are more advances so she has room to grow, very pleased.", "Title": "My 3 1/2 year old loves this", "Date": "January 10, 2014"}, {"Author": "mary graham", "ReviewID": "R3PJ4ICXK1QCDR", "Overall": "5.0", "Content": "the children I purchased it for love it. Expensive but since they like it, I'm happy. I would buy it again", "Title": "a good product", "Date": "January 8, 2014"}, {"Author": "Trish Miller", "ReviewID": "R3AHGTYYI5JYWU", "Overall": "3.0", "Content": "My grandson got a Nabi jr. in April of 2013. When we purchased it I thought the available apps were not very entertaining, but he found it fun, and even learned some things along the way. Our first Nabi jr. quit taking a charge in August of 2013, I was glad we bought the extended warranty, but at that time I guess it was still covered under the manufacturer warranty. So we got a replacement, lost all his personal things like pictures and music, but at least we had a new working machine. In December the updates finally came out and now we could use Amazon apps down loader instead of just the Nabi site. This was a plus, but I was not happy that some things wouldn't work unless I gave them a credit card number and they could charge it $.50.Now though he could get games that appealed to him more and had a world of free apps, including things like netflix available to him. Right after New Years, Nabi quit once again, this time the screen froze black and wouldn't come back on. We tried to charge it up, and still nothing. Took it back to the store where we purchased it and the extended warranty today. They took it back and gave us a new one but said our warranty was not going to cover it anymore since we had turned it in twice now. So I had to buy a new warranty on this one, which I did for $40.00 because it's still cheaper than replacing it and I am sure it will break again.My grandson is not hard on this thing either, so i can't imagine a child who is really hard on toys managing to keep one working for more than a few months, either that or maybe we've just been unlucky with them. He does love it though and it will keep him entertained for hours. My only regret with this is I wish we would have bought the Nabi and not the Nabi jr.Now though that we can add in apps from Amazon's app store, it is still very much age and learning appropriate and we can get rid of some of the younger things for ones more suited to his age.", "Title": "Needs to be more durable, but entertaining and educational for sure", "Date": "January 7, 2014"}, {"Author": "Gloria McCormick", "ReviewID": "RLZOJ4U2FJME9", "Overall": "5.0", "Content": "Grate gift for my granddaughter she is so happy with it...a great hit for grandma.  I'm so glad I made the purchase.", "Title": "My granddaughter is 3 years  old and she loves it.", "Date": "January 7, 2014"}, {"Author": "Michelle Jack", "ReviewID": "R1XHX60USVQNM2", "Overall": "5.0", "Content": "Love love love this for my three year old. More his level than then other one and he can really understand it more.", "Title": "Nabi", "Date": "January 3, 2014"}, {"Author": "Larry Taylor", "ReviewID": "RVUIRGIR9UZ17", "Overall": "2.0", "Content": "Do not buy the Nabi Jr. I would avoid Nabi altogether. Absolutely impossible to get the Google Play Store Apps on it. Very Slow and limited. Tried to contact Nabi with my concerns through email and they emailed back a link to their very useless website. No answers are available for my concerns. I was looking for a sturdy android tablet that could take some abuse. What I got was a cheaply made, very limited piece of junk. :-(", "Title": "Would not have bought it if I knew what I know now.", "Date": "January 2, 2014"}, {"Author": "Jennifer P. From Effin Fabulous Books", "ReviewID": "R37CGSJZ5FLXV6", "Overall": "4.0", "Content": "After researching tablets for my 4 year old I decided that this was the best choice.  I'm not aure about all the \"techie\" stuff but I do know the selling point for me was that you can link it to the amazon playstore. Which means that you can get netflix. I'm sure most of you super parents are cringing but...its ok. My kid watches netflix. Another bonus, probably the biggest of all, is you don't have to spend 29.99 to get game cartridges.", "Title": "lovin this", "Date": "November 30, 2013"}, {"Author": "Katrina", "ReviewID": "R2BY3LWJA043HM", "Overall": "5.0", "Content": "This is a wonderful tool for learning.  My 3 year old granddaughter loves it and has learned to recognize her numbers and letters through the easy learning applications.  There are many games and activities already on the device with the ability to download more if wanted.", "Title": "I love NABI", "Date": "November 14, 2013"}, {"Author": "Martha Riggs", "ReviewID": "R25P1G9Q3YHW0G", "Overall": "5.0", "Content": "fast shipping, product as described. Great features, this will be a christmas present for a 5 year old. A lot of features, love the games.", "Title": "Nabi Jr.", "Date": "November 11, 2013"}, {"Author": "Renee H.", "ReviewID": "R1U0DCFPUEQHSZ", "Overall": "5.0", "Content": "My 3yr old loved this for his birthday! He uses it everyday with no problems. I also love how you can have the Netflix & Cartoon Network app installed on it as well. Thanks!", "Title": "3yr old loves it!", "Date": "November 5, 2013"}, {"Author": "Eileen", "ReviewID": "R3P6KFWW3BKW8S", "Overall": "1.0", "Content": "Just like the other customer, we have not been able to use our Nabi Jr for the past few weeks because of a broken charger.  This is not a single incident. If you google \"Nabi replacement charger\", the first link will direct you to a web site for a Nabi 2 charger replacement web site. Since it is a widespread problem, they are replacing the charger for free.  Not for the Nabi Jr! I searched Walmart, Target, and various online stores including Amazon.com and Best Buy (where I got our Nabi Jr), no one has it except Nabi store as I was told. I am willing to pay for it if I can find it on the Nabi store! No, not available either.  What kind of \"accessory monopoly policy\" is that?  They blame the problem on the manufacturer but what about quality control from Nabi?I emailed Nabi customer service 3 times (no phone number), each time they responded with an automatic email response stating that they have extremely high email volume and referred me to \"top 10 questions\" in Q&A.; Buyer be aware, just hope that you get to use yours more than a few weeks.", "Title": "Another really mad customer", "Date": "May 7, 2013"}, {"Author": "Chiclito \"queso anyone?\"", "ReviewID": "RRQW7O6SCRKQE", "Overall": "3.0", "Content": "Daughter loves it.  She's 18 months and is in love with any touch screen. I think she's a bit too young for it but my wife bought it so whatever.  It keeps her off our Galaxy note's so that's good.  There are a couple of issue I have with this thing concerning younger kids.  First and foremost kids this age love buttons. Well this item has two buttons. A home button and a power button. So you get to the app she likes (Larry Bird Alphabet...She loves it) and it's not easy to get to the downloaded games that don't come with the unit.  You have to touch a very small icon in the corner of the screen then a small icon to get to the non pre loaded app.  It's not quick and it's two steps that are not easy for young dexterity to get too.  Well in reference to the forementioned buttons.  She's enjoying Larry on the touch screen and thinks if she touches the power button it will do something else with Larry.  It does do something with Larry. It turns him off!  Then she cries, then you have to turn it on and go through the screens again which takes a long minute.  Why don't they have a lock for the buttons?!?!  A little switch or a code so that the kid can't turn it off would save many headaches.  The home screen button she doesn't mess with for some reason but she sees that shiny green power button and can't help herself but to touch it.  It's so annoying, she eventually throws it or comes to me crying with it when it turns off. Then it happens again and again until I give up.  So it's not doing what it's supposed to do which is keep her occupied. It's keeping me occupied.  Granted I wouldn't have bought it for her this young and I didn't. This is just a warning to parents whom think their kid is advanced for his or her age.  Think twice about it.  The screen also doesn't seem as responsive as it should be.  Maybe that's on purpose so that kids don't change the apps unless it's pressed longer?  That's another FYI.  The screen is acceptable enough.  It seems sturdy.One final issue is that I read in my \"THE WEEK\" magazine that touch screens are bad for kids under 2 but the (JAMA) also says T.V. is and how many parents heed that advice?  I tried too be an idealistic parent and not let her watch T.V. but it's sooooo convenient.  Sometimes you just need to get things done.  I was plopped in front of a T.V. during my childhood and read very early but I also was watching Starsky and Hutch as well.  Thanks mom!", "Title": "Don't buy for under 2 years old unless you want frustrations.", "Date": "November 19, 2013"}, {"Author": "Flamesmarvin", "ReviewID": "R3FG2JSCUHLEC4", "Overall": "5.0", "Content": "This unit is marketed for children. My boy's are 17 and 19, respectively. This was not for them, but me.  I have a Galaxy Nexus, Iphone 4, Moto Photon , and several PC's and this one is for me. I have bought many tablets only to find that several are the same with a different name tag or they have flaws that I cannot deal with. This unit is bulletproof and will handle most software such as Reloop ( music sequencer ), Trainz Simulator and Task Killer I also have crackle . The unit stays in daddy mode if you want and for android it has very few recurring processes to drain your battery. With a task killer , some music out through bluetooth 3.0, and my simulaors, I am floored by the quickness of this little gem........WOW!!!!!", "Title": "Why did you wait !!", "Date": "September 8, 2013"}, {"Author": "Stephanie Frady", "ReviewID": "R2V82FNYB9UYR2", "Overall": "5.0", "Content": "This is exactly what I have been looking for! My kids are rough on things and this item can definitely handle it!", "Title": "Perfect!", "Date": "May 30, 2013"}, {"Author": "Lacey De Roeck", "ReviewID": "R2Q7E1QJ9SJCZX", "Overall": "4.0", "Content": "This is an awesome kids' tablet, however, the very first time I ever played the hangman app, the first word it tried to make me guess was \"TEQUILA\". Not sure how appropriate that is for a child. Just a warning!", "Title": "Great Tablet but WARNING", "Date": "December 26, 2013"}, {"Author": "Lisa Roberts", "ReviewID": "R1QXUDVQH63VPK", "Overall": "5.0", "Content": "Gift for small hands. Light weight and very portable. Easy to set up and turn on for use. Love the WiFi option.", "Title": "Gift", "Date": "December 20, 2013"}, {"Author": "CASHMAN", "ReviewID": "R1H1EULWEF3AR0", "Overall": "1.0", "Content": "A rip-off  never worked despite many attempts.  no relief from seller.  it's a $100 paperweight. DO NOT BUY ONE> your child will be disappointed", "Title": "never worked", "Date": "June 24, 2013"}, {"Author": "L. Miguel Aucatoma", "ReviewID": "RYW36EN43UHCX", "Overall": "4.0", "Content": "I put many android apps and also Skype and had a good experience with my daughter . The camera is limited but I gain in educational and gaming", "Title": "entertaining and educational", "Date": "July 1, 2013"}, {"Author": "jorge kupferminz", "ReviewID": "R3V8FVCVAXBEGI", "Overall": "4.0", "Content": "Nice little toy. Seems to be a good child tablet, Come with some preset games. New games are costly. DON'T ACCEPT APP FROM GOOGLE PLAY STORE, that is so bad. I think is their way to make more money over it, but it still not fare. Anyway I liked the quality of it.", "Title": "good but DON'T EXPECT TO DONLOAD FROM PLAY STORE", "Date": "November 10, 2013"}, {"Author": "Lena Dee", "ReviewID": "R16NMU90CYKXUU", "Overall": "1.0", "Content": "Have not been able to use it. I sent it in the mail to my 3 year old grandbaby and it got lost in the mail.", "Title": "nabi jr", "Date": "January 23, 2014"}, {"Author": "Ken Hamlett", "ReviewID": "R3C0FPSM3W89B5", "Overall": "4.0", "Content": "My daughter says my 4 y/o granddaughter loves it.  Appears well made and stocked with great stuff for the children.", "Title": "Grandkid loves it", "Date": "October 3, 2013"}, {"Author": "pat", "ReviewID": "R92FQVC397SRS", "Overall": "3.0", "Content": "I am redoing my review because the first item i bought was replaced and the new one is working perfectly. My son loves it and i have downloaded other games and stuff on it. He takes it everywhere he goes so i know he loves it.", "Title": "A Fairly good product", "Date": "October 28, 2013"}, {"Author": "Heathwright", "ReviewID": "R2QL94J014YMX4", "Overall": "2.0", "Content": "Bought this for my 3-yr old, since he is always trying to use my iPad. I researched all tablets, in hopes of finding one that was more kid-friendly towards education & tablet protection. Looked at the Nabi Jr. in Walmart (they were sold out), so came on Amazon to buy one. It's OKAY....that about all I can say. The screen was not very touch friendly--had to use more touch that I would expect--maybe great for a child who likes to bang fingers to touch it?!The amount of apps on it were crap--yes, you can download more, but they aren't cheap. I didn't like that I couldn't change/delete certain features that my 3-yr old (or any child) would possibly need. It also won't let you reposition some apps from the main screen--meaning that you'd have to swipe the screen for games/apps that you want -- probably not the best idea for a child, especially when he/she doesn't know how to swipe/change screens.The big \"home\" button sits out too much & my son would press it when he'd rotate or hold it (obviously, sometimes on purpose). It should be recessed more (like apple's products) to prevent the accidental pressing. The animal/truck/objects that make sounds is boring--not very interactive. Even for a \"Jr.\" this Nabi is not what I was expecting.Definitely won't recommend this for any one who wants something more than a limited-selection of learning/entertaining tools. Nabi Jr. is probably better for an infant. -_-...& don't bother with the protection plan. A big waste of $$$$$$$$$$$$$", "Title": "Not Exactly \"Fun\"", "Date": "October 19, 2013"}, {"Author": "ANGELA D SHUMAKER", "ReviewID": "R2FVYVQML3UOCM", "Overall": "3.0", "Content": "The Nabi is great, when it works.  The sad part is when it doesn't, it is like pulling teeth to get anywhere.  The charger fell apart within two weeks.  There are NO replacements as the company that mfgs the Nabi have none.  Probably because wherever they got those cheap ones, they realized they fall apart.  We made arrangements that I will not go into to get a new charger.  We got it.  The battery only charges to half, if that.  Then a couple weeks after that, never charges at all.  So, while it works, our 4 year old boy is in heaven.  He LOVES his Nabi.  But, the absolute terror that ensues when he cannot use it, is awful.  It's like giving a kid a bag full of m&m;'s and then telling him he can only look at it.  I wish I had gotten him a cheap adult tablet, secured it with an otter box and left it at that.  Live and learn.", "Title": "Good, not great.", "Date": "August 14, 2013"}, {"Author": "Gerace \"Robert John Gerace\"", "ReviewID": "RWRTITC0HK59", "Overall": "5.0", "Content": "Great device, perfect price, made me steer away from leap pad and innotab2 and im not dissapointed at all. I would recommend this to any parent. my kids are 2 and 3 and both enjoy and learn tremendously! two little things though, 1) the nabi jr wont turn on while being charged so if its completly dead, you cant turn it on and then charge it. 2) the Wings app that is installed says coming soon????????? thats been like this for a wile. What the heck huh? Also the stylus I might add.", "Title": "Great Device for the kids!", "Date": "May 28, 2013"}, {"Author": "Jag", "ReviewID": "R19ZZ8X9B74K20", "Overall": "2.0", "Content": "My son loves my iPhone, I have tons of apps on it for himNabi jr seemed like the perfect one for himTurns out, there are not a lot of apps to get for itWe have had it for 2 months nowWhile it is very educational the screen broke when my son pulled the charger cord out with one hand while holding the jr with the other.There are no replacement parts for it.So I have a 2 month old $100 paper weight", "Title": "A good start", "Date": "May 9, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00BKSYFCU", "Features": null, "ImgURL": null, "Name": null}}