{"Reviews": [{"Author": "S. Sorenson", "ReviewID": "R1VO89FKB5K1X7", "Overall": "4.0", "Content": "I recently purchased the Ematic 10\" genisis prime XL tablet with android 4.1, 4gb flash, 1.1 ghz processor, etc. I have used it for about a week for web surfing, looking at videos and a music program called irealb. The Ematic tablet does all of these functions well and has an easy user interface. It also has a microsd slot for adding up to 32 gigs memory. I am quite pleased with my purchase, but I don't use it for tons of apps. It works well for me.", "Title": "Good product for the money!", "Date": "September 30, 2013"}, {"Author": "Shelly Hines", "ReviewID": "RNA33IR9C4TOI", "Overall": "4.0", "Content": "Bought 2 of these for my son and husband for Christmas gifts.  It was easy setup and operating out of the box.  My son has already added several apps, but like others is a bit disappointed in the lack of internal storage for apps.  He's moved what he can from the internal to the SD card to optimize the system. The audio & video streaming are smooth and fluid.  It does not appear so far to pause to catch up.  Both easily connected to our wireless router networks and neither have lost connection, which has been an issue with others we've had.  All in all, they are both happy with their tablets.", "Title": "So far So good", "Date": "December 26, 2013"}, {"Author": "GoHawks", "ReviewID": "RLITR2C819VGV", "Overall": "4.0", "Content": "I bought this for a single purpose, to use while cooking to avoid having my iPhone sitting next to the stove or mixing bowl.  It performs that task well. I hoped it would be much more useful, it's not.  It may have Google Play store but MANY apps (Weather Channel, Food Network, Stitcher) are \"not compatible with this device\".  Not the end of the world since all those can be used via Chrome, which works fine but slooooww.  Display is good enough.  It would likely work fine as a music streaming device when hooked to speakers (Pandora and Sonza work fine).  Bottom line it's a $125 tablet, it is worth that but not much more.", "Title": "a good value", "Date": "December 18, 2013"}, {"Author": "kyle thompson", "ReviewID": "R2HTH6V7CAXC3O", "Overall": "2.0", "Content": "i put a 8 gb memory card in it and it would not save to it and it would just keep saying there is no room for storage", "Title": "memory", "Date": "February 9, 2014"}, {"Author": "Adam Boles", "ReviewID": "R1MH7CNRUNKXYB", "Overall": "4.0", "Content": "The tablet can connect to wifi and has external storage capabilities. I also like how well tv shows or movies appear on it, since it has a separate processor for graphics.  The main problem with this tablet is that it operates with Android 4.1, while almost everything else with Jelly Bean is 4.1.2.  Unfortunately certain things do not work on it because of this.  The internal storage is also a little small for a tablet, but that might be just because it is bloated with Google apps.  However, I am happy with what it can do for the small price that it costs.", "Title": "Good tablet for the price", "Date": "January 6, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1XGDDSUDKML4A", "Overall": "4.0", "Content": "I bought this product at the college today and I have been messing around with it for a couple hours now.  I like the android apps, which I am familiar with.  This is a product I research and was planning on purchasing later, but I couldn't resist.  It will come in handy for the ebooks I am renting.  Great product!", "Title": "I DIG THIS!!", "Date": "January 21, 2014"}, {"Author": "Dennis Levasseur", "ReviewID": "RWJE2WSICXP61", "Overall": "5.0", "Content": "I loved the Ematic EGS102GR operated once I got everything set up, I installed a 32gb sdcard and this help give me the room to install all the programs I wanted, Love it.  Dennis L.", "Title": "I do recomend The Ematic EGS102GR, Works really good", "Date": "December 3, 2013"}, {"Author": "~Miss~", "ReviewID": "R1M8H2HKC0DDXG", "Overall": "3.0", "Content": "Minus a huge shipping mix up and issue with this being ordered without my permission originally, I actually ended up purchasing one of these from a retailer. It is okay, but honestly I would probably buy a better brand next time as I am not too impressed with this item. It could just be that it was not what I needed? I feel it is really slow, but for a starter tablet it would be good for someone who would not use it as much as I do.", "Title": "It's okay", "Date": "May 5, 2014"}, {"Author": "thuyen", "ReviewID": "R98PXD2H995PA", "Overall": "3.0", "Content": "i think for watch movie play game it's ok but volume small and sometime no good for touch screen when you  charge batterry", "Title": "it's ok", "Date": "May 2, 2014"}, {"Author": "Gray Geek \"grayhair geek\"", "ReviewID": "R18PIZMWXYNAL3", "Overall": "5.0", "Content": "I bought Ematic's 7 inch tablet in August, 2013.  I paid around $50.00 and didn't expect5 much.  But I'm delighted.  I've dropped it twice and it keeps on working.  I want a tablet for my Mother, and find it hard to give it up.Some of the games has that Flo selling insurance, but what do you expect for a free ap.I'm keeping the 7 inch and plan on buying a larger one for my Mom  (that is unless I like it too much to give it away.)", "Title": "Amazing", "Date": "April 17, 2014"}, {"Author": "Charice Qualls", "ReviewID": "R2CXXROFSGSR9C", "Overall": "5.0", "Content": "So far this tablet is great a little bit slow but that is ok. I am just happy that the HDMI works great also has play store so I can get all my apps that I like.", "Title": "ematic 10\" genesis tablet", "Date": "March 20, 2014"}, {"Author": "Keldon", "ReviewID": "R1ZQL6APELEVTR", "Overall": "5.0", "Content": "This is my first tablet, I received this as a gift for Christmas from hubby. For me this is perfect, I will upgrade the sdcard because I will need it for a couple apps I want, overall I am very happy!", "Title": "best little tablet for my dollars!", "Date": "January 2, 2014"}, {"Author": "Danielle Briggs", "ReviewID": "R3IT7TBPWH7UGF", "Overall": "1.0", "Content": "Never could get this one to stay connected to the internet. there fore you could not watch tv online, or moives or anything really. sent it back and tred another one and the same thing happened. called the tech support and did all that thwey recommened and it still did not work properly. sent it back.", "Title": "ematic tablet", "Date": "November 1, 2013"}, {"Author": "Brent Taggart", "ReviewID": "R33DGWJT8C6NX8", "Overall": "4.0", "Content": "This is a good tablet for the price.  Nice big screen, comes with Google Play installed, android 4.1, and easy to use & set up.  The main drawback for me is the memory allocated for apps.  There is not alot of space to install apps.  500 MB runs out fast when you start installing apps.  You can move some apps over to the sd card but most apps do not allow this.  If you are looking for a budget tablet with a nice big screen, I don't think you can beat this tablet.", "Title": "good tablet for the price", "Date": "November 21, 2013"}, {"Author": "Merrick", "ReviewID": "R12HIIXJ6DYTK0", "Overall": "5.0", "Content": "I had recently purchased the Ematic Mini Tab for my children and it worked great. So I decided to try out the Ematic Multi-Touch Tablet. As an architect for a construction company, I felt like I needed a tablet to keep in touch with my clients. I was certainly glad that I chose the Emactic Multi-Touch Tablet. I haven't had any trouble with it in the past 3 months that I have owned it. The internet runs well and the storage is pretty large. When I travel, the tablet is easy to carry and I don't have to worry about losing it. I have dropped it a couple of times while working and there was not damage on it. If you need a tablet, the Ematic Multi-Touch Tablet is the way to go!", "Title": "Easy to Carry and Runs Great!", "Date": "December 6, 2013"}], "ProductInfo": {"Price": "$149.99", "ProductID": "B00BH8U284", "Features": "Android 4.1 Jelly Bean, 10.0 inches Display\nARMv7 1.1 GHz\n4 GB Flash Memory, 0.5 GB RAM Memory\n1.28 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41dnmHWjGqL._SX300_.jpg", "Name": "Ematic EGS102BL 10.0-Inch 4GB Genesis Prime XL Multi-Touch Tablet (Black)"}}