{"Reviews": [{"Author": "Tennille Martell", "ReviewID": "RBKON1H50D263", "Overall": "3.0", "Content": "My 3yr old really enjoys playing with his tablet. It is rather slow but good enough for him. Would recommend for a child.", "Title": "not bad", "Date": "December 19, 2013"}, {"Author": "Kym", "ReviewID": "RLUXVZZ1BJZKH", "Overall": "4.0", "Content": "Daughter loves this tablet so I would recommend if you are searching for a tablet for a small child. Great travel size", "Title": "Good item for the price", "Date": "December 17, 2013"}, {"Author": "paul branch", "ReviewID": "R3PKV7NLF4E2RZ", "Overall": "5.0", "Content": "I bought this for my sister for her birthday. She absolutely loves it. It goes everywhere with her. its so funny but cute. Buy this for your loved one and be the hero. lol.for real though", "Title": "tablet", "Date": "December 17, 2013"}, {"Author": "Chip Peruzzi", "ReviewID": "RPXVKQDEY5NVQ", "Overall": "3.0", "Content": "For the price this little tablet is ok. The battery life is short and Needs to be charged often. I am able to play angry birds on it and some some web surfing as needed.  It is slow. It tends to freeze up and need to be restarted too frequently.  This is more of a kid friendly device. So if you an adult who needs super fast, instant internet, move along!", "Title": "ok device.", "Date": "December 16, 2013"}, {"Author": "Jeremiah Johnson", "ReviewID": "R28E15Q1FWK0Z9", "Overall": "1.0", "Content": "Extremely slow and freezes frequently.  Not worth it at all, I sure wished I held out to get something a little better.  Now the big name brands you can get for even cheaper then this one.  This D2 is not even suitable for kids it is slow ridiculously slow and irritating.", "Title": "DO NOT PURCHASE YOU WILL BE UNHAPPY", "Date": "December 13, 2013"}, {"Author": "TluvsCtoo", "ReviewID": "R4A5GPKPVSXM", "Overall": "2.0", "Content": "Its true that you get what you pay for. Bought this tablet because the price was cheap. I have a child who doesn't always take care of her things so I decided to go the cheap route with this tablet. It worked okay. Picture quality wasn't all that good and it was a little slow. After having the tablet for less that 6 months the USB port completely fell out when the charger was taken out of it. We called the company that makes the tablet and they said that this happens all the time! Not by any fault of the owner but by fault of the manufacturing. Since the port fell out it completely ruined the inside motherboard of the tablet and it was no longer able to even turn on. I usually don't write reviews but I felt people should be aware of the faulty USB port before trying to purchase this item.", "Title": "Faulty USB Port", "Date": "August 9, 2013"}, {"Author": "Stanimir Stoyanov", "ReviewID": "R11MVMF6PKM87Y", "Overall": "2.0", "Content": "The Android Operation system is too slow, also it can't catch Wi-Fi, even when I try from few metres.Sometimes just turn off by itselfs.", "Title": "It doesn't response on my expectations.", "Date": "July 11, 2013"}, {"Author": "Tammy Y. Houston", "ReviewID": "R22J3V5LFM0EVO", "Overall": "1.0", "Content": "Just awful. Will never order again super slow can't hold a charge. Just terrible cant fool a toddler no good", "Title": "Terrible it does not hold a charge is super slow just awful", "Date": "July 7, 2013"}, {"Author": "TheDutchess", "ReviewID": "R30B1AVK4JNQZP", "Overall": "5.0", "Content": "Purchased for a friends grand kids.  They love the tablet and get a lot of use out of it.  Great", "Title": "great tablet", "Date": "July 6, 2013"}, {"Author": "Melissa Kearney", "ReviewID": "R3A2U2RKSTBH1", "Overall": "5.0", "Content": "I bought one for my son for his birthday...  he is a college kid, so I was a bit worried it wouldn't be techie enough for him.  He absolutely loves it.  It is easy to get books, Easy to download and play music.  Lots of games and easy to handle.  He loves the smaller size.  I would get some type of cover...  He did drop it and crack the screen.  I liked this tablet so much I bought one for my husband for his birthday.", "Title": "Love this tablet!", "Date": "May 10, 2013"}, {"Author": "kwacasey", "ReviewID": "R3AFK9O3PY2KHU", "Overall": "4.0", "Content": "Bought this for my daughter for her birthday.  It is fairly well put together.  The quality seems good.  There was a dead pixel and the sound seems a little low for my taste, but she loves it.One other item of note it does not use the google play store (which is not really a problem) it has its own store installed in place of this, that works just fine.I would buy another one, really great for the kids.", "Title": "pretty good for the price", "Date": "May 6, 2013"}, {"Author": "Jessaris Mitchell", "ReviewID": "R2N6Y3V9N7W4M3", "Overall": "2.0", "Content": "I bought this about a month ago. I was kinda excited to get it because it had a good review, but when i finally received it and have used it for while. I'm not liking it at all. Its soooo slow to process simple task. Also you can't have more than one thing running on it other wise the applications will stop completely or crash. I do like the size of the tablet, but as soon as my daughter dropped it the screen broke. So if u are getting one. Get the Accidental handling warranty thing.", "Title": "Not what i was expecting", "Date": "April 24, 2013"}, {"Author": "Joanne Garcia", "ReviewID": "R30H808QLVWK75", "Overall": "2.0", "Content": "I bought 1 for each of my 3 children, and had to use the protection plan to return them.  They all started having problems with re-charging, the ports stopped working.  I tried to exchange them, but ended up having the same problems... Other than that, they are worth the money if this was not an issue", "Title": "Not worth the effort", "Date": "April 24, 2013"}, {"Author": "R Lucas \"R Lucas AZ\"", "ReviewID": "R1OU5IC0E1HJ88", "Overall": "4.0", "Content": "I purchased the D2 about one month ago and have been very pleased with it so far. I love the apps available on the Amazon App Store (I use the tablet mainly for the Kindle app but also for some Facebook and Pinterest. Netflix works well but the screen is a little too small to make watching worthwhile.) I haven't found an app I like for listening to music so I don't know how performance would be in this area. I'm disappointed with the browser which is VERY slow. I haven't taken any photos yet that turned out good enough to keep. All were deleted and it's unlikely I'll be using this feature unless absolutely necessary. Overall, it's well worth the price if it's problem areas aren't a big deal (to me they're not.) I would recommend this for someone who hasn't owned a better (read: higher end) tablet as an entry into the tablet using world.", "Title": "Wonderful product for the price", "Date": "April 17, 2013"}, {"Author": "MrFixItNJ66", "ReviewID": "R1PLHJ22HN2J9H", "Overall": "4.0", "Content": "While I wasn't expecting this tablet to be anywhere close to an iPad, I am quite pleased with it & am glad that I was able to get it in time for my son's birthday.  I actually purchased two of them since we have twin 5 y/o's and wanted them to each have their own tablet (to avoid the usual sibling arguments), and while I had to get 1 of them in white, since the black model was back-ordered for over 6 weeks, they are great for what we need them to do. Sure the download speed is somewhat slow, but the display is clear and overall it does everything we expect it to do.  A great value, considering what some of the bigger name brand tablet cost.", "Title": "Good value overall", "Date": "April 17, 2013"}, {"Author": "eric", "ReviewID": "R1904SGJT18WQF", "Overall": "1.0", "Content": "its super slow. its freezes all the time it takes forever to load and half the time it does not even turn on", "Title": "d2", "Date": "April 10, 2013"}, {"Author": "Troy V", "ReviewID": "RHRZHB5OOWE8Q", "Overall": "5.0", "Content": "About 2 months old now, birthday gift for daughter. She dropped her I-POD & replaced it with this. Very good product for the price. Could use a little more h/d space, but other than that she really likes it. Tthere is a slot for add'l space on the side, so I'll just pickup a 16gb memory card, or so. Thanks!", "Title": "So far so good.", "Date": "April 8, 2013"}, {"Author": "Ivan Santana", "ReviewID": "R320NCZQ1RFLPV", "Overall": "4.0", "Content": "This tablet does everything that the seller says and does it well, for the price it is a excellent choice, the presentation of the product is very good as it's package, is not too fast but not too low, regular responsiveness, medium screen picture quality (HD movies looks great), it's light and thin, perfect for my 3 years old son. Battery life is decent, and can do video calls by Skype. I would give 4.5 if i could, or probably 5 stars if this would have HDMI port like others that are in the same price range.", "Title": "Very good product! for it's price", "Date": "April 2, 2013"}, {"Author": "Ben", "ReviewID": "R3TU4Y21A6SF8E", "Overall": "3.0", "Content": "It runs really slowly but for the $80 price I should not complain. So far the apps run at normal speeds once they are open. Its the navigating and loading that seems to take a while. I'm going to add some memory using the micro SD slot and see if that helps.", "Title": "Decent", "Date": "March 12, 2013"}, {"Author": "Kandykane", "ReviewID": "R2OZNGFMYIKF1C", "Overall": "5.0", "Content": "I purchased both pink and blue. These tablets are great for my children ages 4 and 9. Very easy to navigate, connection to wifi is fast so is the download speed. I would definitely recommend these tablets to family and friends. Thanks Amazon you rock!", "Title": "wonderful!", "Date": "March 12, 2013"}, {"Author": "Dennis J. Mantovani", "ReviewID": "RMKQ5E11SRDCU", "Overall": "4.0", "Content": "Got this for my grandson and he likes it.  Battery does OK.  It is a bit slow but for the money it is a good value.", "Title": "Good for Kids", "Date": "March 10, 2013"}, {"Author": "sarah72978", "ReviewID": "RE2O9XJRQRHUU", "Overall": "3.0", "Content": "So far it's working fine. My daughter is used to playing on my IPad and says the tablet runs much slower. Also there is no USB port on this tablet which she wanted so she could hook up a mini keyboard.", "Title": "It's worth the money", "Date": "March 9, 2013"}, {"Author": "Rachel", "ReviewID": "R31V4PQOEDVOM2", "Overall": "4.0", "Content": "This tablet was purchased as a gift for a 6 year old girl; she loves it. This was a good purchase for a great price.", "Title": "Good buy", "Date": "March 9, 2013"}, {"Author": "La Campesian de Belén, S.A.", "ReviewID": "R226HQ2L9VLS2O", "Overall": "1.0", "Content": "I bought two of these tablets for my daughters. One of them fell down (on the carpet) and burst your screen. The second of which stopped working after one week purchased. I turned it off using the on / off and when I tried to use it again, just keep the word \"android\" permanently on the screen. I waited all night and the next day nothing ... just see a huge phrase \"android\" on the screen. As the suit to Costa Rica I can not return (the freight is very high). Do not waste your money, are disposable.", "Title": "Don buy it....are disposable.", "Date": "March 8, 2013"}, {"Author": "Klyn", "ReviewID": "R1T0VTB4Q9VNOX", "Overall": "4.0", "Content": "I really enjoy the tablet the only thing is it freezes up sometimes other than its perfect for me & my six year old daughter", "Title": "Good tablet for the price you pay", "Date": "March 8, 2013"}, {"Author": "Eric Capasso", "ReviewID": "R6C60NH6J19YZ", "Overall": "3.0", "Content": "I bought the D2 just as a toy. It's as fast as my HTC Evo 3D cell phone. I play with computers all day long and I am not very impressed with the D2. It did come with a lot of kids apps and my kid plays with it more then I do. It found my server right away and I was able to look at pictures but it took a few to load. If I was just using the D2 for myself I would only give it two stares, but for my kid to be playing with it with ABC's and numbers its a three.", "Title": "D2 Is Ok", "Date": "March 7, 2013"}, {"Author": "Dan Barnes", "ReviewID": "R3FI5IACVMI736", "Overall": "5.0", "Content": "Bought this for the 3 year old to start her learning and the wife is always stealing it. Both of them are satisfied and I can buy four or five for the price of an Ipad, so I'd buy another.", "Title": "For the 3 year old", "Date": "March 7, 2013"}, {"Author": "Xskinner", "ReviewID": "R3021CM7QH2FJQ", "Overall": "4.0", "Content": "The D2 is everything that the tech details say about it as far as the software. The touchscreen is smooth bit thin and the plastic around it is thin. Shop for a universal cover for a 7inch tablet to fox that problem. It is well worth your money.", "Title": "great for a beginner tablet", "Date": "March 7, 2013"}, {"Author": "ILoveGod123", "ReviewID": "R2CDSPEBKHJZ18", "Overall": "5.0", "Content": "my daughter is really happy with this tablet. she loves pink so just imagine. I like the idea that it has lots and lots of educational games for her. she is in 2nd grade so this will help her get better at reading and identifying the meaningb of a word.", "Title": "I love it", "Date": "March 17, 2013"}, {"Author": "caitlin", "ReviewID": "R2I828V7C6VUC4", "Overall": "1.0", "Content": "its junk i sent it back i was very unhappy with product. i would not recommend this for anyoneat all", "Title": "dont do it", "Date": "March 26, 2013"}, {"Author": "webshopper", "ReviewID": "RN5GAGIPVO927", "Overall": "2.0", "Content": "Don't purchase this item.  It is a glorified game boy.  I would not recommend this to anyone.  Buy a real tablet.", "Title": "NOT WORTH IT", "Date": "February 21, 2013"}, {"Author": "C. L. Washington", "ReviewID": "R1N41N3J2D9MF0", "Overall": "3.0", "Content": "I'll update this when the product is out of the box... however, I ordered two of these tablets for my twin daughters. Why wouldn't they ship at the same time? Now, I have some decisions to make. It would've been nice to have to \"consolidate shipping option,\" since it wasn't clear that I wanted them both...", "Title": "Shipping Decision: Lacking", "Date": "March 18, 2013"}], "ProductInfo": {"Price": "$79.99", "ProductID": "B00BF9MU62", "Features": "Android 4.1 Jelly Bean7 inches Display\n7 inch, 16:9 capacitive multi-touch screen\n4GB / 512MB DDR3\nAll winner A6 1.0 GHz", "ImgURL": "http://ecx.images-amazon.com/images/I/51kf5CJKN5L._SY300_.jpg", "Name": "Digital2 7-Inch Tablet (Pink)"}}