{"Reviews": [{"Author": "Debi Maskell", "ReviewID": "R9TVRL2RST3V5", "Overall": "5.0", "Content": "Exactly what my husband needed. He is non-technical and was able to use it with little instruction.  Allows him to browse the net & access email easily.", "Title": "Perfect fit for our needs", "Date": "June 2, 2013"}, {"Author": "Mickie Jones", "ReviewID": "R2L8XYPYMGOJ85", "Overall": "5.0", "Content": "I love this tablet. Instead of taking my laptop places,  I can take my tablet. I HAve No problems with the tablet.I'm so glad I got this tablet.", "Title": "9\" Android tablet", "Date": "May 27, 2013"}, {"Author": "Rosanne", "ReviewID": "R3A1AH7NWSQS8E", "Overall": "5.0", "Content": "This tablet does a great job!  I have had it a while now and it performs well.  I am used to the Android system, so it works for me.  I use it alot and love that it has the camera to skype with!  Good for the money", "Title": "Nice Tablet", "Date": "August 11, 2013"}, {"Author": "Robert Austin", "ReviewID": "R2ADCSBTP8CWLS", "Overall": "5.0", "Content": "THIS IS EXACTLY WHAT I WAS LOOKING FOR AND AT THE PRICE I WAS WILLING TO PAY!!!Not the be-all-end-all tablet, but does what it's supposed to and does it well.", "Title": "Excellent Choice", "Date": "October 7, 2013"}, {"Author": "Erika75", "ReviewID": "R3ST5706Z8FU1L", "Overall": "3.0", "Content": "My son loves his tablet, but stated that he was unable to download all of the free apps which I can't understand. Someone at the computer repair store is wiling to help with this. He still likes the tablet.", "Title": "Tablet", "Date": "July 3, 2013"}, {"Author": "chris cunningham", "ReviewID": "R3NYASQYDBXI3S", "Overall": "3.0", "Content": "It's an okay buy for the money...it's a bit slow and doesn't download 50% of the time...but to play games on it's okay", "Title": "Tablet", "Date": "May 22, 2013"}, {"Author": "Alvin Bonaparte", "ReviewID": "R2E05LN856UBG4", "Overall": "2.0", "Content": "The tablet was very slow with app downloads and would frequently lose WiFi connection.  All other devices in my home always stayed connected.  Returned after 3 days..", "Title": "Total Reject", "Date": "May 10, 2013"}, {"Author": "John", "ReviewID": "RNBBRWU0A5LOD", "Overall": "2.0", "Content": "The display is not very responsive to input. The device lags on simple games like temple runner. Invest in more quality.", "Title": "Laggy and unresponsive", "Date": "March 22, 2014"}, {"Author": "Jarvis", "ReviewID": "RC51J7USW2G5N", "Overall": "1.0", "Content": "The tablet continued to freeze and would not hold a wifi connection. The screen went blank and I had to turn the tablet off after about 20 minutes of usage", "Title": "Not good", "Date": "January 27, 2014"}, {"Author": "Florence Weeble \"Flo\"", "ReviewID": "R1W3F3RXW63LXX", "Overall": "2.0", "Content": "I am sorry to say that here is where the old saying, \"you get what you pay for,\" Proves absolutely true. Though I paid over $100 for this Android tablet, I really should have put that money as a down payment on an iPad. As that is exactly what I am using now to type this review. In fact, for about the same cost for this tablet I could have purchased Kindle, or Nook (from Barnes&Noble;) and those would have worked much faster and with fewer hiccups. The Android works fine for playing AngryBirds or e-book reading... and not much else.", "Title": "Save ur money, I should have", "Date": "January 14, 2014"}, {"Author": "REMY.2012", "ReviewID": "RC40P00OA72DW", "Overall": "5.0", "Content": "I GUESS LIKE ANY CUSTOMER, I TOO HAD FEAR OF A NO BIG NAME PRODUCT AN A GREAT PRICE TO BOOT.SO I WAITED FOR MY TABLET TO ARRIVE SO I CAN PUT MY FEAR TO REST. FINALLY IT ARRIVED WELL PACKED.THE MOMENT OF TRUTH HAD FINALLY ARRIVED SO I OPEN TAKE OUT AND CHARGE MY NO JOKING VERY NICE LOOKING SAVE ME A BUNDLE TABLET. WELL NOW I KNOW WHERE TO SEND MY FRIENDS!", "Title": "TABLET FEAR", "Date": "April 21, 2013"}, {"Author": "Darcy Bergh", "ReviewID": "R15WVP450VWB31", "Overall": "4.0", "Content": "This is a nice product, my 7 year old son uses it primarily to play games while we are traveling in the car .", "Title": "9\" Android", "Date": "July 2, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00BUDTEXA", "Features": null, "ImgURL": null, "Name": null}}