{"Reviews": [{"Title": "good, but with one problem", "Author": "Adenisio Hoffman", "ReviewID": "R2QGUZDBQ0YBA", "Overall": "4.0", "Content": "Razer does not sell the docking station anymore. And the battery does not stand for gaming hours without it. Other than that, is awesome", "Date": "March 15, 2014"}, {"Title": "the only thing keeping it from 5 star is the price", "Author": "mdwm", "ReviewID": "R1BFH6Y7LNPNYW", "Overall": "4.0", "Content": "this tablet will handle any game you throw at it.it is pricey but you simply cannot get anything even close to its power in a tablet formfactor.", "Date": "March 12, 2014"}, {"Title": "Disappointing!", "Author": "Howard", "ReviewID": "R1DE6R2LQXGVI6", "Overall": "2.0", "Content": "I bought the edge with the controller last october. It took a long time because I was traveling a lot. When I got it, there were many vital functions that are defective. The camera is not functioning normally, the wifi does not connect. The controller has poor feedback and trigger keys pretend they are being pressed all the time. I have contacted the razer support and there is no avail in fixing it. They were all hardware problems.I sent it back for service during early January and got to have it back at end of feburary.The machine was wiped, those problems are fixed but I found out the mic is still muffled and not recording well at all, and some other shoulder key on the controller is kinda stuck, the other trigger key is now registering below 38% when fully depressed.After almost half a year, this item with the bundle (edge, docking station, controller, external battery) and two times of transport shipping between continents have altogether cost me more than 2500USD now and this console is still experiencing problems.It has been a very disappointing experience considering razer had been doing hardware for quite some time now and these funcdamental problems are simply unacceptable.I do not know how to tackle the problem. Warrenty is going to run out before I can actually start using the machine! and all those expensive transport cost is tolling up so much. I was considering buying the keyboard dock however I have now lost confidence. I suggest you do not buy razer edge.Edited: (10 mar 2014) there is a wifi commection problem on and off again.,it will pretend it is not connecting correctly with a DNA server, tried flushing dns cache tried using google dns, tried reconnecting, restarting. the problem resolve itself after a repeated mixture of the mentioned attempts and someone 5 minutes sometime an hour, the problem will come back. the gamepad controller is also having sensitivity problems on the right trigger (always think it is pressed) and the right shoulder button as well.", "Date": "March 4, 2014"}, {"Title": "DoA or close to it (updated) 2nd delivery made my day", "Author": "Samuel Sundin", "ReviewID": "R2X8N2PKYV7AVM", "Overall": "5.0", "Content": "After much agonizing wait I finally got my Razer Edge Pro...sooooo happy.Looked very nice, started up nicely.Then the problem started the tablet felt very sluggish, when it came to performance, it went between turbo speed and snail speed both in metro mode and the desktop mode. The tablet felt very difficult to navigate in touch mode, I had to tap very hard sometimes and other time a slight nudge gave the same reaction.To make things worse it started to freeze until the point where I had no other option but turning it of with the start button.Once I did that I was monumentally screwed, it went into EFI Mode, where there seem to be no point of return, since I didn't even had the time to make a backup disk before it broke.So here I am with a very expensive and cooooool tablet that might not ever recover.To add even more problems I am based in the EU so only god knows I am able to get support and how long that support will take from Razer.I am cautiously optimistic that Razer/Amazon takes swift actions to solve this problem for me.UPDATE:Amazon reacted very fast and replaced the broken device with a new and working one.Now I very happy, it is an incredible piece of hardware, it over exceeded all my expectations.All I want now is to find the docking station directly with Amazon, instead of looking at ridiculous mark ups from some people trying to make a quick buck due to the very low stock.Thank you Amazon and thank you Razer.", "Date": "February 20, 2014"}, {"Title": "Thought it was great but!", "Author": "Dion J Johnson", "ReviewID": "R1DTNXAZV30QFE", "Overall": "3.0", "Content": "I had been looking for a windows tablet for months. I wanted something versatile to replace my work PC and can be used for gaming. Once I saw this and for the price I was happy, until. This thing has been a nightmare, right out the box the sound didn't work. So I had to figure out what was wrong. Got that fixed, then the video drivers weren't installed correctly, given me errors when I tried to launch the control panel. I fixed that. Now I can play my games,so far it's working ok, but  I get this annoying screen flicking and dimming. Haven't figure this out yet, but I certainly would buy one of these again.", "Date": "February 15, 2014"}, {"Title": "Awesome but not for everybody", "Author": "JBJ", "ReviewID": "RTKEHZ22M6DUX", "Overall": "5.0", "Content": "well this is a gaming laptop and definitely not for the average user, its raw power is awesome and everything opens in a snap. one downside is its heavy. To me battery life of 4hrs is not of a problem.", "Date": "February 9, 2014"}, {"Title": "WOW..all I can say", "Author": "Harley Smith", "ReviewID": "R1UAUS7T1E3H7Z", "Overall": "5.0", "Content": "this has been my new favorite device. my pc and laptop are getting jealous, but with the dock and wireless keyboard and mouse, I can play all my games on a 50 inch tv...", "Date": "February 5, 2014"}, {"Title": "best all in one system i can think of.", "Author": "jonan bahnsen", "ReviewID": "R7WE8EIK66QNA", "Overall": "5.0", "Content": "so far it has been a pleasure to work with the razer edge.im traveling a whole lot around. and was always frustrated with the limited uses of a standard tablet that always have limitations.with this i have everything around with me. i can set it up to the dock at home (the dock was out of stock when i purchased it. but it should be delivered one of these days)i can use it with a tiny bluetooth keyboard as a laptop.and it can be used as a tablet aswell.this has made me turn my old pc into a server.sold my other tablet.so now i only have this device.another thing that havent been mentioned enough at all. is the amazing size for reading comics. when in vertical this screen fits a comic book page perfect. and it just works so much better than other tablets i have tryed.the screen:people keep comparing this devices screen with ipad. and i was worried that the screen was unclear and would annoy me.when i ordered the product.well it doesnt the screen has a wide viewing angle. and people always asks me what type of screen it is as it is so clear.i know that on the paper this screen doesnt add up to the new tablets. but im more than happy with this.the battery time is also fine when you use it for browsing etc. i see this as a multi tool. ye you can get tablets smaller and thinner with better battery time. and you can get a desktop pc cheaper and better than this. but really this is the only device that can do everything for you.when i get the docking station i intend to buy an xbox controller and plug it to the razer and then i can set it up to the hotels tv for some assassins creed.uses:desktoplaptop.comic reader (fit for the pages)gaming laptopgaming consoltablet. .should i say something negative about this product: (wanna be fair)they set up a light sensor on the front to turn off the screen in case of it being pressed by accident. in the bag (to safe power) the problem is that when im sitting with it in vertical mode it feels natural to hold your hand above this point, which turns of the screen. also when in a dark room. sometimes it turns off since the tablet assumes its in a bag.i cant seem to find out where to turn this off. but this is rather frustrating.i hope razer have enough success with this product to release a new version.", "Date": "February 5, 2014"}, {"Title": "Tab", "Author": "Geek guy", "ReviewID": "R1QEZYX96OG6SE", "Overall": "4.0", "Content": "I bought this tablet for many reasons but the biggest was I wanted the fastest and best tablet in the market.  I hate Win8 but I can deal with that but at this point its sitting on my desk and I really do not use it very much.I loaded several games and connected a Bluetooth key and mouse and tried to play a few but I think you have to have the dock to make this work right.  Meaning I sit on the couch and just to play a average game requires that propping the device on my legs with the keyboard below it and the mouse on the side.So a dock is required since these games are not touch screen enabled.Overall I pleased with the power and speed.  But most likely will be another tech item that will on my desk with very little use.", "Date": "February 3, 2014"}, {"Title": "Great tablet with more than enough speed.", "Author": "Eric Husted", "ReviewID": "R2WERFAZ8TFOG9", "Overall": "4.0", "Content": "Great tablet overall but the accessories are overpriced and if you planned on using a stylus don't bother with this tablet.  Manufacturer says any stylus at a local electronics store will work.  I tried multiple types of stylus' and did not find one that would work for handwriting or drawing on this tablet.", "Date": "January 19, 2014"}, {"Title": "Excellent graphic in games as expected", "Author": "egemen gokdemir", "ReviewID": "R28NTYASIFAV34", "Overall": "5.0", "Content": "Excellent graphic performance in gamesVery Light when compared to laptopsFastWindows 8The bad side is battery charge time and i wish it had hdmi out directly on the machine (you have to buy dock unit to have hdmi out )on itself, but it is acceptable", "Date": "November 14, 2013"}, {"Title": "know what your buying", "Author": "cava99", "ReviewID": "R3HVGEUBG2X045", "Overall": "4.0", "Content": "when you look at the specs of this device you might say hold on i can get a laptop with better specs than thia .... and you would be right, but thats the point your not buying a lap top your buying a gaming tablet its unique and take it to a whole different level bringing gaming to handheld device.that being said, with something like this there are issues, the bettery will get you about 45 minutes of gaming and it can get hot. To get the most out of this device you need to get the game pad controller in which you can add an extra battery that boosts playing time to about 1hr and 45 minutes and the docking statoion which allows you to turn you tablet into a mdia station / mobile pcat the end of the day this is a pure luxury device if you really want value you for money you can get that else where, but if you want to be the envy of your friends take this out for a strol and whatch people drool!!!", "Date": "October 24, 2013"}, {"Title": "awesome", "Author": "richard hunter", "ReviewID": "REKHC6BDZ4V9G", "Overall": "5.0", "Content": "An awesome tablet , love be able to pplay games on the train into work, great graphics and sound buy it", "Date": "October 19, 2013"}, {"Title": "Great Tablet", "Author": "thomasc", "ReviewID": "R3CWL53MP17QZW", "Overall": "5.0", "Content": "Very powerful, not a single problem with it in a few months of use. cant wait for keyboard attachment. would definitely buy again.", "Date": "September 9, 2013"}, {"Title": "Gaming Everywhere", "Author": "Justin", "ReviewID": "R1K564PO1TMNOC", "Overall": "5.0", "Content": "I've had this tablet for a week now and i have gotten considerable use out of it. I have always been a gamer and now that I'm going to college this thing is the most useful gadget I have. I have to carry large load with me to be ready for various situations one of which was a very heavy laptop. the edge really cut the load down. This is especially true for my job where i have to climb a 70ft tall ladder regularly. so its nice to have a more than capable machine to use when i have some downtime, feel lazy, need quick info, or any of the other various reasons I've used this device. The downsides are that the battery life is weak on its own if you are hardcore gaming, but in today's world where are you not going to find a socket nearby? The power line is very portable so power is really a non issue. The actual big issue is the wifi. it is fairly weak, I haven't been able to pick up networks where my phone can. I countered this issue by installing games that work very well single player. Steam is very accommodating with its offline mode and all your games should work with little complaints. I've run SR3, Tomb Raider, Max Payne 3, and other intensive games at beautiful quality and speed. If you get this it is imperative you get one of two things. The first I recommend is the gamepad controller,it really completes the system. The second is to wait for the keyboard dock and buy a razer Orochi. If you are in the market for a portable powerhouse then the edge is for you.", "Date": "July 25, 2013"}, {"Title": "Blows Everyday Tasks Out of the Water!", "Author": "Alex Dembski", "ReviewID": "R1IORWXU7TIY4B", "Overall": "5.0", "Content": "While the Razer Edge Pro certainly looks more capable spec wise, the vanilla Edge gets the job done with ease. It has the same graphics card, less 1Gb of VRAM (Pro has 2Gb video RAM, this has 1Gb); 4Gb less Memory, which is a non-issue for most tasks including games like Borderlands 2 and other modern titles. Where this product is left wanting is it's disk space, but good news everyone, it can be opened up far more easily than 90% of tablets on the market, and both RAM and the SSD can be upgraded!!!Just search youtube for the how-to video.Instead of classifying this as a tablet I would call it a laptop replacement tablet, as most small handed, or weak wrist-ed people will struggle to hold it as they would an iPad for extended periods of time. You will likely end up wresting this on your lap at an angle . Speaking of angles the viewing angel is superb. It also weighs much less than it appears it would (equivalent weight to a Microsoft Surface Pro)The only issues I have had are with the on screen keyboard button, which is superbly laggy, and the fact that it does not ship with any sort of case and it is too big for the majority of tablet cases (I use a netbook soft case).As for the battery life, which is entirely comparable to the Surface Pro, I have not had much of an issue as these days we are rarely far from a wall plug or other suitable power source for 4 hours. Gaming on battery is a little short with roughly an hour and a half for most graphically intense games, but it is best to play plugged in as the default settings turn on active cooling and full GPU power only when the charger is connected.If you want a small, light, go anywhere, do anything PC this is something you should consider.Typed on my Razer Edge (this is why full size USB is nice to have).", "Date": "July 21, 2013"}, {"Title": "Great Device with Even More Potential", "Author": "Chris", "ReviewID": "R8USJSFR41XWT", "Overall": "4.0", "Content": "The Razer Edge Pro drops a hint at the future of the PC in our hands. I can prop it up on a stand and legitimately play modern PC games. It puts the four other devices I've used in the past few years (a Samsung Series 7 Slate, Asus Zenbook Prime Touch, Surface RT, iPad 3) to shame from a performance standpoint. Graphic-heavy PDFs load and scroll near instantly. Web video and sites load like you'd expect on proper desktop rig. But I can kick back in bed and scroll through those PDFs, pinching and flicking and tapping like you'd expect on a modern mobile device. It does everything and does just about all of it fairly-to-very well.It's an early step on the future of our computing devices. A powerful core CPU, GPU, and RAM with a simple built-in input method and screen, that you can use with additional input devices and outputs depending on the usage you need. Bigger screens, mouse and keyboard, external drives, web storage. A flexible, powerful, and modular computer.It's still an early step, though. Windows 8 is pretty excellent once you relearn a few fundamentals - it's adept at mouse/keyboard and a great tablet interface. The transitions aren't always seamless, but I expect to see that change pretty quickly. The Edge Pro's biggest problem is a reliance on the (completely unavailable) accessories. Some confusing design decisions make this more challenging. I'd planned on using the Edge with a Bluetooth keyboard and mouse for regular use, sometimes connected to an external monitor. I'm locked out of that scenario without the Dock, as it doesn't have HDMI out built in (my Samsung Slate did, so a net loss there). It has only a dock/power supply connector on the bottom (rather than a secondary power-only port on the side like the Samsung) - without the dock, this means I have to balance it awkwardly on the protruding power cord to prop it up. One quirk that doesn't involve the accessories - for some reason the capacitive touch sensor is tuned or only capable of recognizing \"wide\" touches - that means fingertips don't register well (particularly for swipe-in-from-bezel gestures), while it's perfectly responsive to the pad of your finger. Other touch devices recognize fingertips, so it can be jarring and give an impression of being unresponsive. Easy to adapt to, but a slight annoyance. I'd consider selling it and getting a second generation version in a year or two if these things were shored up (or accessories are more available). The reliance on accessories are what keep it at three stars instead of four.All that aside, I can still flick through a massive PDF while reclining with it (that other devices - particularly the Surface RT and iPad - will choke on), then wander across the room, prop it up (albeit awkwardly), and run WoW on high at around 60 FPS, get a few rounds of Hawken or MechWarrior: Online in (high or medium, respectively), or play some Deus Ex: Human Revolution (at low settings). It's about the most versatile computing device out there.Update: I've now been able to get ahold of a docking station and have some time to use it. I've amended my review from three to four stars as the tablet becomes *vastly* more flexible using the dock. Skyrim (at medium, 40+fps) and WoW (high, 50+fps) work well on a second monitor at 1280x1024 (or slightly less, like 1280x900). Doing work and light web surfing remain blazing fast. It's close to five stars, but I'd still like to see a few improvements in future generations:- The odd touch tuning (\"ignoring\" or not registering fingertips)- The wifi - not only is it not capable of 5ghz, it's a bit weak. I was able to connect to an iffy network while on vacation with my Surface RT, but the Edge needed to be about 30 feet closer (to a 2.4ghz G network).Overall, a very high quality computer and massively flexible! I really love this device.", "Date": "June 2, 2013"}, {"Title": "Really do love my Razer Edge Pro", "Author": "Ryan Mckenney", "ReviewID": "R2EGM07F5RR3JJ", "Overall": "5.0", "Content": "I honestly love this tablet. Especially with the controller add on and headphones games become oddly immersive. I have played more games with this tablet than I would have otherwise because it just gives me more opportunity to play games due to it's form factor and portability. Currently I am using it just as a gaming system but it is Windows 8 and clearly runs very well.For games that do not have native controller support do a web search for game controller software and you will find some software that flawlessly replicates keyboard strokes with the controller. You can even use a controller to move the mouse around, right click, left click, anything to do with the keyboard and mouse via the controller. Ultimately, most games only use a limited set of buttons. This will work for a nearly all games out there without native controller support.The screen resolution does not bother me too much, though a higher res would be welcome. The performance in game is decent. You may have to lower quality a bit on some more intensive games but none are what I would describe as unplayable. Mostly you are just missing out on some advanced lighting effects. I do not really have any major complaints in the graphics department, especially for the tablet form factor.Size and weight are good. Not perfect but I have had no issue with it especially propping it up on my lap, etc. Holding it straight up will get a little tiring especially with the controller attachment. The controller attachment is a bit large. Would be better if it could split or fold in half somehow. It is the only thing that gets the offical \"pretty bulky\" complaint but have found it to be the most enjoyable way of gaming on the Razer Edge Pro.Battery life with the standard battery is pretty dismal. Most times I just leave it plugged in while playing. With headphones, full brightness, and an advanced game it can drain in around an hour. If you are just using this as a tablet things improve but your mileage will vary. To be fair however, any device that does intense 3D gaming will have pretty terrible battery life so overall, this is not shocking. The only annoyance is the plug is on the bottom and if you are sitting with the tablet on your lap it can sometimes unplug. The unit definitely does get hot but it has adequate venting and cooling fans that are not annoying.The TV output and 5.1 audio output worked perfectly with the dock. It is a nice addon but most of the time I just use it as a handheld tablet with the controller attachment.", "Date": "May 30, 2013"}, {"Title": "Your only choice for tablet PC gaming", "Author": "Brian", "ReviewID": "R2HZ7XXLGRILI4", "Overall": "5.0", "Content": "I created a full review on youtube:http://www.youtube.com/watch?v=gWph83okaPsWindows 8 has been good once you get used to it. I installed \"classic shell\" to get my desktop / start menu from Win7 back.", "Date": "May 18, 2013"}, {"Title": "Great portable gaming device, lots of crashes", "Author": "J. J. \"filmmaker\"", "ReviewID": "R2H52U1PWJF6M2", "Overall": "3.0", "Content": "I guess it's more of a Windows thing, but considering that this company makes only 2 models of this tablet, you'd think they would know exactly which drivers and windows components are supposed to work. Mine has a BSOD almost every day, especially with the dock, it often shows memory warnings when trying to run even older games. Upgrading to Win8.1 was very difficult, far beyond what any consumer should be required to do for a simple OS update.Although their screenshot shows Civ5 (which is a great game for a windows tablet BTW) it actually barely runs, not because the tablet is not powerful enough, but because of weird memory or driver issues. The game only runs on Directx 9, not on the Directx10/11 option, or even the tablet mode option. These are all problems that you'll probably find across any windows device, especially if you're used to an iPad or Mac, so 100% of the blame can't be on Razer, but they should do some sort of testing to keep these problems to a minimum. My wife downloaded Civ5 on her lower spec mac (intel graphics) and has had 0 problems with it.On the good side, it has decent performance and runs most modern games at high res and quality. It's portable so you can take it with you on trips and have a great gaming experience without the size of a laptop. The docking station is where it really shines for me though. I have it hooked up to a projector and with a wireless mouse/keyboard I get a pretty awesome big screen media/game experience on a device I can just undock and continue the game elsewhere.Battery is really bad, but considering the performance I don't mind too much. The weight is a bit heavy, so you'll need to rest it on your lap or have a case that it can stand up with. I would also recommend going to the Pro model if you can afford it. The extra bit of performance and extra HD space will probably be worth it.", "Date": "January 8, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BP06OHC"}}