{"Reviews": [{"Title": "Really Bad!", "Author": "antares165", "ReviewID": "RT79FYA4UX0PN", "Overall": "1.0", "Content": "Purchased mine off eBay for $25.00 + shipping. I'd have been better off flushing the cash down the john. This is one of the worst tablets I've seen, bar none. I repair tablets as a hobby and I've seen a few. Rather than rant about generalities, let's get to some specifics:Screen resolution: I've never seen worse! Pixelization is rampant. The Amazon waiting circle icon is so jagged, you can barely tell its a circle!Speed: slower than molasses running uphill in January! Other tablets that tout the same Ghz processor blaze along, but this thing just sits and contemplates. There are 800 Mhz tablets that leave this thing in the dust.Build: heavy, cheap, plastic.Touch screen: while it is capacitive, it is often slow to respond and just try using multi-touch. This may not be a fault with the digitizer, but with the processor itself. Caution: This has got to be the thinnest piece of glass ever made. It is nearly half the thickness as other digitizers, so I imagine a sneeze in the wrong direction will cause it to crack.Software: You can put Amazon market on here, but forget about Google. (It is possible to do it, but not worth the time and energy it takes.)Bottom line: If you're thinking of getting one of these, don't! If you've purchased one already, quickly put it in a safe filled with cotton balls and return it before it randomly implodes and burns the house down, possibly taking you or a loved one with it! Best use: gifting to enemies... watch them slowly go insane.", "Date": "April 14, 2013"}, {"Title": "This is not a good Tablet.", "Author": "Anonymous", "ReviewID": "R29WOIRRBG2FX9", "Overall": "1.0", "Content": "\"I bought my 4 Sight Tablet back during black Friday 2012 because it was on sale for like $80.00 and now I understand why. It is super slow and half of the programs I try to run on it are extremely slow or won't load at all. It might be okay if you are only using it to read, but it takes so long for the tablet to process things that it is probably not even good for that. Anyway, I don't think I will ever buy from 4 Sight again. Also, I know the damage is my fault, but I accidentally cracked the screen here recently and it is going berzerk! I would not recommend this Tablet at all. PLEASE look elsewhere! It's way more worth your time to invest in a kindle fire or something with a good processor.", "Date": "April 3, 2013"}, {"Title": "The worst tablet ever.", "Author": "deelite", "ReviewID": "R6LRIVSONVTCA", "Overall": "1.0", "Content": "I bought my 4Sight 9\" during black Friday not knowing it would be a black day all day with the thing. Its great for my books and a big paper weight. But don't try to do anything else. Its big, slow and very hard to use. Its a waste of $89.", "Date": "September 5, 2013"}, {"Title": "serves its purpose", "Author": "Nancy Rodriguez", "ReviewID": "R356D6BMQXOKC9", "Overall": "3.0", "Content": "Good for the functions of a tablet. Nothing fancy but its workable and for its price- good. Interior function needs improvement.", "Date": "August 20, 2013"}, {"Title": "Thank you for the information.", "Author": "jonmur60", "ReviewID": "R3LN9Y0RDWAQEF", "Overall": "2.0", "Content": "Thank you for the reviews. I always read the ratings before I make a purchase here on amazon and thanks to people like you two (even though you had the unfortunate experience which I'm sorry for you) I am able to avoid what sounds like a bad deal and from what I've read this is most definitely a problem item that would give me a real bad headache, so not only have you saved me from buying one of these, you saved me from having to buy a big bottle of Tylenol too!", "Date": "June 13, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Screen Size: 9\"\nOperating System: Android 4.0\nProcessor Type: ARM\nProcessor Model: Cortex-A8\nProcessor Speed: 1.1GHz", "Name": "4Sight Tablet with 4GB Memory 9\" | 4SPA0910C", "ImgURL": "http://ecx.images-amazon.com/images/I/51kr4GefIyL._SY300_.jpg", "ProductID": "B00BUTBAB8"}}