{"Reviews": [{"Author": "Infectious", "ReviewID": "R34X3PV2TAN0NV", "Overall": "5.0", "Content": "I am a medical student. I got this to make my life as mobile as possible and cut down on the insane amount of paper that I use.Frankly, there are no capacitive stylus that can equal Wacom digital stylus technology. I agree that the price is way steeper than the Nexus 7, but remember that the Nexus 7 is subsidized by Google. Compared to the Ipad mini, which sells for about $70 less, this tablet is way worth the money. Never mind the specs being better on this than the Ipad mini. I am talking about the cost of getting a Wacom digital pen and tablet for the price of $70.With this I am able to use Epic effortlessly. I can take notes as I talk to patients, take handwritten notes when I am in class, sync it to every cloud service you can think of, record lectures as I take the notes and play it back, convert handwritten notes to typed notes (need to have good handwriting) etc etc.Really, the S pen has sooo many uses. The ability to take a screenshot and edit it on the fly is something I use nearly everyday. This tablet may not completely please artists but for everyone else, there is no equal.As for build and design, I have no problems with Samsung's plastic build. Nearly everyone throws on a case for their tablets (or phones) now a days. You DON'T even feel the plastic back that everyone whines about. Glass back breaks. Aluminum or polycarbonate backs glaringly highlights every scratch or defect. All adds to the weight. Plastic backs hides scratches and as I said, when you put a case on, you never even touch the plastic back again.Battery life lasts me the whole day. On average I get about 15 hours with about 3-4 hours of on screen time before I get down to about 20%. Probably could be better battery life, but since it lasts me the whole day without needing to find a charger, I am ok with it.Still runs 4.1.2 Jelly Bean. I hope they upgrade it soon, but no rumors as to when.Conclusion: Buy this tablet if you have any interest in replacing paper in your daily life.", "Title": "I have replaced paper!", "Date": "June 5, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RKPF921YAUHAF", "Overall": "5.0", "Content": "I am currently in pharmacy school and this tablet has made taking notes a breeze. Most of our teachers post their powerpoint slides as a pdf file. I use an app called EZ PDF Reader on this tablet to annotate them during class. The pen is so precise and lets me take notes as well as if I were taking them on paper. It also makes it easy to always have access to my notes as I upload them to dropbox. If I don't have a pdf to take notes on, I have found an app called Papyrus that mimics lined paper perfectly.I debated between the 8 inch and 10 inch versions of the Note not knowing if the 8 inch was going to be large enough to take effective notes. With the high resolution screen and the precision of the s-pen though it has worked well.The tablet is also fast. It has been able to handle everything I have thrown at it from multitasking, to intense graphics games, to streaming video. I also love the fact that I can have two apps open side by side (a feature that is currently only available on the Note series from what I understand)! I've used this feature to have something like a website open on one side while I take notes on the other.In short, I highly recommend this tablet to students who would like to ditch taking paper notes to save space and have ready access to their notes at any time!", "Title": "Great for School", "Date": "October 9, 2013"}, {"Author": "Oauzzie Youtube", "ReviewID": "RUO6GNJM4CL8E", "Overall": "5.0", "Content": "It's absolutely a great product. It will set the example for future technology to come.The productivity on this is incredible. I use it for note taking. The cameras just suck. Pretty soon there will be tablets just like this with S-Pens, HD screen resolution, 8 megapixel and 3 megapixel cameras, and probably some 3D features. The screen resolution on this is absolutely great and handwriting is very natural, though. Ignore the complaints.Trying it first at Best Buy is what I recommend. I decided to buy from Best Buy, & no Play Store credit was included as promotion from Amazon might suggest, but I still got the DropBox credit and around 5 dollar in store credit with new BB card).I Highly recommend the MoKo Slim Cover Case for Samsung Galaxy Note 8.0 inch GT - N5100 Android Tablet, Black (with lip Stand, Integrated Elastic Hand Strap, and Stylus Loop(Payed $5.99 and it's definitely a 5 star product!)Hope I helped :)", "Title": "Good. No. Great", "Date": "April 26, 2013"}, {"Author": "KO", "ReviewID": "R2Z2C7R8176RTB", "Overall": "5.0", "Content": "The best extra money I almost didn’t spend for a refurbished item.• The Bad:o Touch Wizo S-voiceo Potentially damaging magnetic interference NOTE: none of these negatives impacted the overall score of the Samsung Galaxy Note 8.0 because all of them have simplesolutions.• The Mediocre:o Price NOTE: This caused no negative impact on the overall score because there are plenty of solutions to this problem (as follows).• The Good:o The next few thousand words.SUMMARY: The Samsung Galaxy Note 8 (GN8) is to multimedia professionals what a Swiss Army knife is to MacGyver.Bonus Edition Material: All the applications and accessories you need to kick some serious multi-media tail in the field with the GN8 for next to nothing.Before I start swooning over this tablet like Tony did Maria in West Side Story, I’m going to get started with the things I don’t like (AT ALL) about the GN8:THE BAD:TouchWiz is a problem. It’s a bloated and unnecessary launcher. While Samsung has toned down some of the Fischer-Price “my first tablet” icons a bit, I still don’t like manufacturer launchers of any kind… nor do most users. Optimize the standard Android OS for your hardware, allow for direct updates and let the user tailor their experience to their liking!!! HINT: That’s why people buy Android.I’ve installed Nova Launcher Prime because it’s fast, highly customizable, can use most icon packs from ADW and Go (if you’re into that sort of thing) and allows me to run my entire tablet from a single home screen and well-organized app drawer.[...]S-Voice is a problem. It’s not SIRI. It’s not Vlingo. It’s not Google Now. It’s not as integrated as Samsung thinks and it’s not good. The solution is simple as all you have to do is use Google Now. While S-Voice does plug in to the Samsung apps very well, the problem is that the Samsung apps aren’t as good as what they’re designed to replace.The words of Jesse Pinkman allude to a serious problem: “MAGNETS, BITCHES!” Often found in “smart covers” that automatically wake up your tablet, they automatically destroy the GN8’s magnetically-driven hardware that allow the S-Pen to work so well. They create dead-spots in the screen.The solutions are many: find a cover that uses weak magnets, which is to say: spend the extra money on the OEM cover; for the same price as the OEM cover, purchase the protection overkill of the Otterbox Defender case made for the GN8; hunt for a case that doesn’t use magnets and still offers good protection.THE MEDIOCRE:The price is another problem: at $399, it’s pretty steep for a small tablet not running iOS or Windows 8RT, both of which are much more integrated into the professional environment the GN8 is designed to serve. While the S-Pen is incredible, and its integration makes it a steal when compared to the thousand dollars you have to shell out for a Surface Pro, most people aren’t the kind of users that will actually get a value-added experience with it. My suggestion is to go with the N7.2… or Galaxy 3 Tab 8.0”, which still comes with great perks and allows you to control your TV (more on this later).Granted, the GN8 comes with a ton of perks as long as you buy it by 30 September 2013 [...] and it is on sale at Staples for $329.99 (at least it was when I wrote this review).There is also another price work-around to be considered: buying refurbished. At $299.99, you get all the perks of the special promotion and you don’t have to pay sales tax (it’s used). By the time I factored in all the tax savings and perks, I paid a bit less for a GN8 than I would have for the only other affordable tablet that could meet my needs: the second-generation Asus Nexus 7 (N7.2).This isn’t your typical “used car” version of a refurbished item. The packaging is complete, the device looks great and honestly… in my experience, the failure rate for factory-refurbished equipment has been lower than that of new equipment.Not to mention it’s better for the environment AND the domestic economy when you consider Samsung does their refurbishing right here in the United States.You get a decent 90-day warranty you can extend if you want to. I root every Android device I buy, which voids most warranties, so this isn’t a major concern for me: you pay your pennies and you take your chances.By the time everything was tallied up, I purchased a refurbished GN8, spare chargers (both for a car and AC wall charging), an OTG micro USB to USB adapter (more on that later), a folding Bluetooth keyboard, a case and ChromeCast for only $15 more than I would have paid for the GN8 alone, with California sales tax at my local Staples.In-Depth: The 96hr ImmersionThe last four days have seen my experience evolve from fascination to ham-fisted frustration to my girlfriend literally being pulling me away from the tablet by my ear because of blood-blasted (“blood-shot doesn’t begin to describe it) eyes to now, at this present time, actually feeling an emotional connection similar to the one I feel with my lovely and well-trained dogs.Samsung has come a long way with their packaging over the last decade, coming close to the unboxing experience Apple products have soiled the electronics market with. I know that the “recycled” materials a bit of propaganda, but I like the message the propaganda sends.The first thing I noticed is that the GN8 feels as good in the hand as it looks in the box. It really is a beautiful device, taking full advantage of the slick design that has made Samsung’s Galaxy line so successful. It is much lighter than the solid feeling tells the sense of touch it should be and is a very high-quality product when it comes to materials and finish. However, the back is a little too slick to use without having anxiety over dropping it, but a person that uses a tablet without a case probably has advanced-stage syphilis as well… and aren’t worth knowing.I’ve read some reviews that have attacked the use of polycarbonate for the body, saying it feels cheap. There are no signs of poor build quality in this tablet. The same can be said for the GN8’s most significant competitor: the N7.2. Both feel solid without feeling chunky.As far as durability is concerned, it should be noted that polycarbonate is used in things like safety glasses and bullet-proof windows for a reason: it’s strong and can take a beating. Metal is cool and feels good, but it also dents and arcs, destroying delicate electronics. The GN8 is also built with the second generation of Corning’s Gorilla Glass, so durability of the device itself should be excellent.The same can’t be said for the metal foil laminate of the bezel around the GN8s camera in back, which is already starting to chip a bit from setting it on my desk when charging. Samsung should have used the same material they did around the perimeter of the GN8’s shell.When combined with a portable Bluetooth keyboard (a must if you’re serious about getting the most out of your tablet purchase), the entire package comes in at roughly a pound.This has been a blessing, because my typical load for a day in the field includes the following: a DSLR with two lenses, assorted filters, an extra battery and USB, HDMI and component cables; a prosumer point and shoot with an extra battery; a stereo microphone with pop filter and table-top tripod, USB cable; a portable solar panel; eight rechargeable AA batteries (to run my mic, mobile phone, flashlights, a portable scanner, the GN8 should it actually run out of power, and a STERIpen water purifier- sometimes when I write that I “work in the field,” I’m being literal); assorted equipment to clean and maintain my camera equipment; pens, markers, highlighters and a notepad; a simple grooming and first/last aid kit (it’s important to make sure fingernails and calluses are taken care of when meeting clients); a waiter’s wine opener, Chapstick, gum (because it’s important to be able to celebrate a new acquaintance whenever you meet her); condoms (because I’m an optimist); a cigarette lighter (for what comes after the bottle of wine); a flashlight; a head light; the aforementioned scanner and water purifier; my glasses; cables and power adapters for my phone and GN8; Bluetooth headsets; a Kobo Glo with a few hundred books on it (nothing will ever replace e-ink); a pair of gloves; a small knife; a pair of gloves; a small tripod; two liters of water; and before getting the GN8: a bit seven pound laptop, 1.5 pound spare battery and a one-pound charging brick… all packed into a strained assembly of water-resistant fabric that is considered a “personal carry-on item”!Most of this equipment is used at least two or three times a week (even the water purifier when I’m hiking or don’t trust the tap water), and I only want to eat, shower and dress in the morning, so doing a different load-out every day is impractical.What I’ve found over the last week is that I can do about 95% of what I need to do, when I need to do it, with the GN8… and it has taken my typical load-out from a shoulder and back abusing 28 pounds to a “ comfortably feather-weight” 17.5!RELEVANT LUGGAGE TANGENT: While a backpack would carry my daily load more comfortably, satchels are mandatory for quickly accessing photography gear. Also, the FAA lists backpacks as “luggage,” whereas a satchel, as long as it fits within the maximum allowable size, is considered a personal item akin to a purse or briefcase regardless how much it weighs.The display, which is slightly larger (by the ruler) than the N7.2’s, is wonderful once it’s been optimized for text and reading. Understand that it is a two-step process to make the GN8’s screen really earn its praise. First, turn on “reading mode” in the drop-down settings menu. Then, go into device settings under the display submenu and check the box that optimizes the display for text. It makes reading mode an enjoyable experience rather than a gimmick.With those tweaks, the display is so good, I actually prefer the GN8 to the N7.2 when it comes to reading Flipbook and PDFs… but I’ll still be using my Kobo Glo for long periods of reading e-books.For gamers, the GN8 may not have the pixel saturation of the N7.2’s tremendous display, but it isn’t lacking. About as heavy into gaming as I get is Bard’s Tale, and it looks and plays great on the GN8 with the high-definition graphics pack. More intense games will make the GN8 stutter a bit, as its graphics processor is a bit dated. However, you’re not going to be interested in the GN8 if you’re only looking to browse the internet, play games and stream movies: this is not your recreational user’s tablet.There’s also a price to be paid for the N7.2’s cutting edge technology: glitches. Google it.In addition to an enjoyable reading experience, the GN8 has something the N7.2 should: physical buttons that eliminate the need of assigning precious screen real-estate to navigation icons. These physical keys located away from the screen make the actual display area of the GN8 about 20% larger than the N7.2 with its virtual keys that take up a significant chunk of room on the display. Samsung, like Apple, gets why people instinctually enjoy having a dedicated home button: it makes life easier, even if some technophiles consider them the cumbersome tools of luddites. The dedicated keys make a lot of sense on the GN8: if you’re interested in a device that has been designed around a stylus, you appreciate the touch-feely attributes of the entire Galaxy line’s design.That stylus is a major benefit for people like me: content publishers that need to be able to import, edit and publish multimedia from remote locations. While sketching is great for fun or to make mind maps of projects, the S-Pen isn’t just about Paper Artist. I’ve found very good uses for the S-Pen when paired with the GN8’s impressive hardware.The S-Pen is a great device, and I understand why people justify the expense of the GN8 with the statement “it’s all about the S-Pen” after using the N7.2 with an aftermarket device. The S-Pen is a bit too thin for me to use for long periods, but I actually prefer navigating around the home screen and most applications with the S-Pen instead of my finger, especially Photoshop Touch (more on that later).This isn’t a major problem because the Note is designed to take… notes. The S-Pen integrates well when digesting information-heavy PDFs, allowing the user to highlight section of text, make notes and quickly integrate and organize them within S-Note.Making the process even more efficient is MultiWindow. The MultiWindow feature is one of the advantages unique to the Note line that Samsung has made better than in the last generation with smoother control and more available applications that support it. Of course, I would like to see even more applications support it because everyone uses multiple windows on their bigger computers, so everyone knows how much of a productivity advantage the capability is. It’s a no-brainer application designers need to integrate into their apps.When a beautiful display optimized for reading and highly integrated to the S-Pen input and interface, then empowered with MultiWindow and gestures like swiping the screen with the flat of the hand to take a full screen shot (or circling text and images with the S-Pen’s button depressed to capture smaller items), I have a hard time believing that any other device could be better for the task of heavy research and study. The GN8 is the honors graduate student’s wet dream.And there’s good news for GN8 users after grad school. To schedule life, S-Planner almost became what I use to work with my Google calendars. It’s a fluid and seamless way to do almost everything I need to do with my schedules, but it has one glaring fault because instead of being its own application, S-Planner is not much more than Google Calendar with S-Pen support and a new skin. Unfortunately, S-Planner has all the limitations of Google Calendar when it comes to scheduling.Instead, I’m using another pre-loaded GN8 application for most of my scheduling needs: Awesome Note HD (though I still prefer the endless scrolling agenda list of Business Calendar’s widget, found here: https://play.google.com/store/apps/details?id=netgenius.bizcal&hl;=en). Awesome Note HD, like the now-dead Astrid, allows me to set repeating events by the days that need to elapse. Granted, this is a feature I use to do things like remind myself to change the house’s HVAC filter, replace the head on my electric toothbrush and give my lovely dog her heartworm and tick medications. While pedestrian, all of those tasks are dependent on the amount of days lapsed and important to me.Note to Samsung: form a partnership with Awesome Note by folding S-Planner and S-Note into a Note-tablet specific version of their application.The GN8 is loaded with a 4,600mAH battery that keeps me moving and producing in the field for my entire day. In the week I’ve had it, I have never have to recharge the GN8 before bedtime, and I’m not a light user.This is my GN8’s typical day: I start out by sending and responding to emails in the morning for about an hour during my commute, generally using a folding Bluetooth keyboard or Google’s voice recognition input through a Bluetooth headset. Once I get to where I’m going my day is spent capturing and creating content, editing content between meetings and giving presentations at my client’s offices. On my way home, I participate in social networking, play video games or try to get ahead on media projects that are either rushed, delayed or personal. After my commute, I’ll use the GN8 to manage shopping and errand lists on my way home, and once I get home I use the integrated Peel application to control my television and DirectTV!Speaking of the IR blaster, it won’t allow you to “bump” files and contacts to other devices like the N7.2’s NFC feature. Some have listed this as a detriment, but NFC isn’t going to be used in the environment that the GN8 is designed to excel in. Professionals may bump contacts with their phones, but I’ve never seen anyone do it with their tablet… and I’ve seen A LOT of people use A LOT of tablets.However, with the IR blaster found on the GN8 (and not the N7.2), it is a tremendous asset to be able to control monitors and most other devices with the same device you’re running a presentation from. With ChromeCast and the IR blaster found in the GN8, I’m ready to rock a presentation in most modern offices within a minute… and that makes a great impression when dealing with prospective clients that don’t have a lot of time to waste.That’s not to say NFC isn’t good technology. It’s great on a phone, but I’m not going to dig out my tablet every time I want to purchase a latte and apple fritter…The Samsung Galaxy Note 8 is a “force multiplier” for media professionals because you buy a whole lot of bangs with the same buck. When the ability to set up and control presentation equipment in seconds instead of minutes (or even hours with older stuff) is combined with a massive fuel tank that supports a full work day of use without a recharge, outstanding performance, high-speed connectivity, better productivity, a wonderful display, light weight and a slick design, the GN8 becomes more than a really cool tablet. The GN8 does most of what any mobile professional needs it to do for as long as they need it to do it while saving weight, money, time and, with the S-Pen, it also saves my clients from the indignity of signing my invoices with their finger.THE BONUS EDITION:This is what you spend the $25 Google Play credit on if you want to get the most out of the GN8’s unique features that make this tablet the best small Android tablet on the market:The S-Pen and Adobe’s $10 “limited” port of Photoshop [...] go together like peanut butter and jelly. I know that there are capable applications out there like Snapseed that will allow most people to do almost everything they need to make their photos pop for Facebook and Pinterest. But I’m not blogging about food trucks or touching up selfies: I do stuff with images, video and sound for a living. If I can have Photoshop and do the high quality creating and editing on the go, I’m buying it… and honestly, it’ll do at least 95% of what I need it to do, so when compared to the exponentially more expensive desktop application, Photoshop Touch is one of the century’s best deals.In addition to that, a $4.99 license for Clesh [...] gives me the ability to edit videos on the go. It works well for most of my needs, though some more complicated projects still require my sedentary equipment because I don’t have much patience. I wouldn’t recommend Clesh for a smartphone, but on larger displays and the extremely fast WiFi radio built into the GN8, Clesh is a wonderful application that makes the most of the GN8’s hardware and S-Pen.To round it all out, Audio Evolution Mobile is available for $6.99 [...] and allows me to connect my ZOOM audio recorder to the GN8 via an inexpensive OTG USB adapter. It captures much better audio than the microphones mounted on the GN8, and it allows me to capture, edit and package complete audio tracks while working from my couch or on the long Metro ride home. The S-Pen makes grabbing and piecing together tracks one of the easiest experiences I’ve had, and I have complete control over the entire capture process when doing podcasts outside my normal studio.Compared to the desktop interface, I prefer to edit my audio on the GN8 for a few reasons. First is the S-Pen interface because it makes clicking and scrolling and dragging so much more fluid than the mouse. The second reason has to do with quality. I can listen to it through my car’s audio jack or Bluetooth, through wired headphones, Bluetooth stereo and Bluetooth mono headsets. This allows me to make sure it sounds okay across all formats my audience is likely to use without having to suffer the indignity of Microsoft’s Bluetooth client.Since I have an OTG cable, I need an app that will help me bring files to the GN8 from its native location, and that’s the excellent Nexus Media Importer available at the Play Market for $3.99 [...]. If I don’t have to hassle with swapping MicroSD, I don’t hassle with swapping MicroSD cards, and I’ve already paid myself back a few times with the amount of time and frustration this application saves me.To get all those files organized and uploaded to where they need to go, I use the Total Commander file manager [...] and the FTP Plugin for Total Commander [...]. Both are available for free at the Android Market and are the best applications I’ve used for my needs.For those not keeping track, the above applications cost a total of $25.96 and make the GN8 one of the best editing platforms I’ve ever used. So far, I haven’t witnessed the 1.6GHz quad-core Exynos processor struggle with the demands of editing or creating professional-level multimedia content. Even if it is slower than a high-quality desktop, I save more time with the S-Pen than I’ve wasted on rendering.If I need to access a more powerful system, Samsung and Dropbox have teamed up to give GN8 purchasers a free 50GB upgrade. The WiFi radio that comes with the GN8 is one of the fastest I’ve used, and I’ve moved large files over both public and private hotspots in about the same amount of time my laptop takes. Granted, this is a snail’s pace when compared to a direct line into a cable network, but for WiFi performance, the GN8’s performance impresses.Also, the GN8 has one of the best GPS radios I’ve used on ANY device! Navigating with GN8 and Google Now takes about 15 seconds less than trying to do the same thing through the dedicated navigation systems I’ve used in most cars! It is truly amazing how much work Samsung put into getting the GN8 to work well before releasing it to market.You can’t say the same thing about the N7.2. Google it.Combined with Splashtop, all I have to do is upload the media to my Dropbox account, log into the app, wait for my desktop to pop up and tell my hard-core unit at home what to do. While I’m meeting with clients, doing work or commuting, my bigger projects are rendering on their own. I can log back in to Splashtop to check the progress of the project from anywhere in the United States, and when it’s done I can use Splashtop to send it back to DropBox and have my client preview it.TECHNO-TANGENT WARNING: Even though it’s more difficult to set up, I prefer the older Splashtop Remote Desktop HD on sale for $8.99 because I can use it any time I want on any network I want without having to “rent” it by the month.  [...].pad. If programming settings is too difficult, or you find Google’s servers too slow for things like gaming, you can use the new and improved Splashtop2: [...]", "Title": "The best extra money I almost didn’t spend for a refurbished item.", "Date": "September 2, 2013"}, {"Author": "taka13", "ReviewID": "RGA1PFDQUNN0Q", "Overall": "5.0", "Content": "My OG 10.1\" Asus Transformer TF101 was showing its age, and so it was time for a replacement.  I was looking for a more portable tablet that I could take to school or anywhere without the bulk.  After reading reviews and testing store demos, I narrowed it down to the Nexus 7 2013, Tab 3 8.0, and Note 8.0.  I'm no fanboy to any OS, but the iPad mini was never in the equation simply because I was in the market for Android not iOS.  The decision was tough, but for my needs the Note 8.0 edges them out.With all the Nexus 7 2013's great price and high specs, I just couldn't get past the screen size.  The high resolution display has sharp text, but a tad too small for my liking on full web pages and PDF's.  In landscape mode text was comfortable, but viewing height felt narrow.  Coming from rarely having to zoom on a 10\" screen wasn't helping either.  Even though the Nexus 7 is fast, sleek, and updates quickly I wasn't willing to give up 3\" of screen.So all that remained was the Samsung Tab 3 8.0 and Note 8.0.  After comparing these further I decided to take the plunge on the pricier Note 8.0 for the increased horsepower and S-pen stylus.  Overall I am very happy with it, despite my few gripes with it.  Transitioning from 10\" to 8\" was painless and found that I wasn't missing the larger screen at all.  The display is surprisingly vibrant and crisp considering it's not an Amoled or IPS tier screen.  Like others mentioned 8\" is the way to go for mobility, weight, comfort, while retaining a sizeable screen.  Text size is better than the Nexus 7 in full web pages and PDF's requiring little to no zooming.  I don't use the Wacom stylus as much as I thought, but it's amazingly handy when you need it.  Performance is snappy and tackles everyday tasks to moderately intensive gaming with ease.The only gripes I have, which I've learned to accept, are with Touchwiz, home buttons, and battery life.  Samsung's interface is bloated and looks a little cartoonish to me.  Without rooting I disabled the Samsung apps and features I didn't use, and added a launcher like Nova with minimalist icons for a better look and feel.  Occasionally mine will freeze for a second and then keep going like nothing happened, which I blame on Touchwiz.  It doesn't bother me much since it doesn't occur often, plus it's still ten times better than my old tablet.  Handling the tablet in landscape took some getting used to since it's easy to hit the back and menu buttons on accident, but one benefit is that it doesn't take up any screen.  Also battery life is acceptable not great; with moderate use, some tweaking, and its superior standby, it will get you easily over a day.  Hopefully the 4.2 update will help the battery and performance like it did on the 3G/LTE variant.Although the Tab 3 8.0 performs well in its own right in my opinion the only reason to get one is if you financially cannot or do not want to spend the difference for the Note 8.0.  Even still with Amazon's pricing and $25 Google credit (till 9/30), that brings it down to about a $50 difference, plus you get a faster processor, more ram, and s-pen features.If Google made a Nexus 8, I probably wouldn't be writing this review; however until then Samsung stands alone in the 8\" Android category, not including cheap tablets.In the end all three are great tablets, but the 8\" screen, S-pen, and performance on the Note 8.0 fit my needs the best.", "Title": "Nexus 7 2 vs Tab 3 8.0 vs Note 8.0!", "Date": "August 21, 2013"}, {"Author": "Anonymous", "ReviewID": "R15FH7UA21UV9P", "Overall": "5.0", "Content": "Let me start off by saying that I did not buy this tablet at Amazon. Having said that, after using it for about a week, it has proved to be an excellent tablet and comes with features that you don't find in the competition.Most people who have an issue with this tablet are concerned about the price. While that concern is legitimate, it is misguided due to the fact that it compares this tablet to the iPad mini. To start, the iPad Mini is exactly the iPad 2, except with a smaller display, which makes it two year old technology. It is powered by an anemic (by today's standards) dual-core 1 Ghz A5 CPU and a paltry 512 MB of RAM. By contrast, the Note 8.0 is powered by a quad-core 1.6 Ghz CPU and 2 GB of RAM. It is not the fastest CPU currently out there, but it is miles ahead of the A5. I am fairly on top of current technology, and I can't think of a single tablet in any form factor that has more powerful hardware. Absolutely not the iPad Mini or the iPad 4. And the obvious difference is that the Note 8 has a pen-capable display, which is not found on any competing 8\" tablet. Now, I am not trying to claim that either the iPad mini or the Note 8 are overpriced/underpriced because I simply don't know, but I am trying to point out why the higher price of the Note 8 is justified.The other issues that people seem to have with this device is the plastic housing and the screen resolution. While it would certainly be nice to have full 1080p, I can say that the screen on this tablet is excellent. I would not consider the screen resolution to be a drawback in this device. To give you a comparison, the 13.3\" display in my MacBook Pro has the exact same resolution as the 8\" display in the Note 8. It is very sharp. As far as the plastic vs aluminum housing goes, let's put it this way; every iPad or iPhone I've seen in use was shrouded in a thick layer of plastic, rubber, or leather, and chances are good that you'll be buying a case for this tablet as well. The housing should make no difference to most people, and arguably plastic is more durable. You drop a metal tablet, you'll either dent it or bend it. It's permanent damage. You drop a plastic tablet and it may just absorb the impact better, w/o significant cosmetic defects.As far as my experiences with it go, I have had absolutely no problems. The tablet is very fast and fluid, screen is plenty bright to even use in direct sunlight, and battery life is adequate. I can't give specific details on battery life yet, but from what I can tell so far, I should be able to get around 8 hours of screen time and maybe more. It of course depends on a lot of things. Browsing for example will use more battery than reading an ebook, likewise watching videos will use more battery. The biggest battery drain is the screen, so if you are using it at max brightness, expect significant battery drain. That goes for any tablet.So, should you buy this tablet over the iPad mini or the Nexus 7. Well, they are both cheaper, and if you are already invested in the Apple ecosystem, it may make more sense for you to go for the iPad. The Nexus 7 is very cheap by comparison, and rightfully so. Despite being powered by a quad-core CPU, the Tegra 3 is not anywhere near the speed of the Exynos chip in this device. You can look at benchmarks online if you want, but I have another tablet with the Tegra 3, and the Exynos CPU in the Note 8 blows it away, benchmarking nearly twice as fast. And you can really tell the difference in regular use. Of course the Nexus 7 is also a 7\" tablet. The only way I'd recommend the Nexus 7 over the iPad mini or the Note 8 is if you're going strictly by price. Otherwise, you really have to decide whether or not you need the stylus. If all you want is to watch movies, read news, and play games, you have no use for the stylus. If you need note-taking capability or precision touch capability, this is the tablet to get. The Wacom stylus is not simply a finger replacement, it is a precision tool for handwriting, drawing, or designing, and it works extremely well.", "Title": "Excellent tablet for those who have use for the stylus", "Date": "April 19, 2013"}, {"Author": "LuckyAL", "ReviewID": "R1B4STG3UIFZUP", "Overall": "5.0", "Content": "This highlights some of the Apps that are \"NEED TO HAVES\" if you make the wise choice of buying this tablet.  With the Note 8 and these Apps, I haven't used my Desktop since.NEED TO HAVE Apps for the Samsung Galaxy Note 8mazec3**This App replaces your keyboard and enables you to hand write in every App, email and on the internet using the S/Pen.  Most people have difficulty reading my hand writing and yet this App is able to consistently convert it into text. I find that hand writing with mazec3 on the Note 8 is noticeably faster than tapping or swipping on a keyboard.  With this App and the Note 8, you'll get more done than you could on any other tablet.**It is worth noting that the Samsung keyboard does have a native handwriting recognition mode built in (you can find it in the keyboard's settings).  However, instead of writing continuously, you can only input a couple words at a time.  It's reliable - but it will slow you down.Polaris OfficeThis App comes pre loaded on the Note 8 but I am highlighting it to urge you to use it...because it is so amazing.  I have tried several Apps to create and edit Word, Excel, and PowerPoint documents-nothing comes close to Polaris Office.  It is extremely easy to use and the editing tools closely mirror the Office Desktop Software.  So far, I haven't found anything that I used to do on my desktop that I haven't been able to do with Polaris Office.  In fact, when combined with mazec3, I prefer Polaris Office to the desktop.G CloudThis App backs up all of your files including documents, music, contacts etc... Just install it on all your devices - including your old tablet, then back-up all your files and you can easily download any of the files on the Note 8. I also use Drop Box, but the reason I love this App is because I can easily get my music from my past and present devices onto my Note 8 and my documents are backed up daily so I can't lose anything.mSecureThis App stores all your passwords and log in information.  What makes this App stand out from the pack (and will save you time) is that from mSecure in a click or two you can instantly login to your favorite Websites-without having to open your browser, type in the URL, and type in your login info... mSecure does all the work for you.  I also used to use the same 2-3 passwords over and over.  With mSecure, I now have unique passwords for all my logins using their password generator.  I no longer use my desktop to login to online banking or web applications... it's faster and easier on the Note 8.I hope this gives you a better idea of what is possible with the Note 8.  You are going to love it!Other Apps to Consider if the Note 8 is your First Tablet:-Google Voice Search-Drop Box-Dolphin Browser-EverNote-CalenGoo-Glympse", "Title": "The APPS You Need and Why My Desktop is Dusty", "Date": "January 6, 2014"}, {"Author": "S. Mills", "ReviewID": "R4G0C5YTD0DC9", "Overall": "5.0", "Content": "I knew I wanted a tablet, but which one to choose? I started with the kindle fire HD, both small and large sizes. I tried the small first and it seemed to be okay, but I thought maybe I would like a bigger screen, so I returned the small one and got the bigger one. After a couple of weeks, I realized just how limited I was using that device and found myself using my phone more for browsing, playing games, etc. Plus, I like to put movies on mine to watch when I'm bored at work. I had a hard time getting videos on the kindle. It would tell me it was in the wrong format, when It wasn't. Anyway, I returned both of those and went for the Samsung note 8. I already had the Samsung galaxy 3 for my phone, so I knew that I would know my way around it. I have had it for a couple of months now and I love it. I use the stylus all the time because it really is intuitive when it comes to figuring out what you've written. Let me tell, I have horrible hand writing too. I love the split screen and have used it multiple times. The only thing I wish is that there were more options for the split screen. Like opening 2 of my favorite apps at the same time. Only certain apps will work with the split screen and most of those are the ones Samsung put on the tablet. The Samsung calendar is fantastic and the size is perfect for me. I realized when I bought the larger kindle that I had made a mistake because it didn't fit into most of my purses. The note 8 is big enough to be very functional for me, but small enough that it's very portable. I bought the moko ultra slim light case for $15 and it is the perfect compliment for my note 8.", "Title": "love it!", "Date": "August 10, 2013"}, {"Author": "toolperson", "ReviewID": "R3RBLMVSAJ7JCX", "Overall": "5.0", "Content": "I just love this tablet so much I have to write a review on it. Due to (and some provided by) my job, I have an ipod, ipad, a windows laptop, a macbook pro, and only recently I've gotten into android products, and I have to say that I love the openness of android.First of all, when I got the note 8.0, I have to say I both loved and mostly hated it; hated it because of all the bloatware and useless (to me) apps that Samsung puts on the tablet; I loved it because of the wacom pen, which is very precise. Moreover, you can use ANY wacom tablet pen with the tablet, not just the small pen that comes with the note. I use a very nice wacom pen from an old Fujitsu tablet pc. I have the Wacom \"Penabled Tablet Pc Eraser Pen\" which is nice as well and is large almost like a regular pencil. The pen can easily be used to take notes in class, especially with LectureNotes (which I used on a daily basis).To get rid of the bloatware, you can get an app called Clean Master from the android app store and if you open it up and go to app manager, you can disable (not uninstall) all the useless preinstalled apps (there is a category that says \"completely safe to disable apps\" and you just disable them, one after another). Of course, you can also go to app manager and do the same, but Clean Master makes it so easy. This is OK and it left a fairly nice tablet without a lot of the bloatware.However, I ended up voiding the warranty because I rooted the note 8.0, then I installed a custom recovery (Philz touch), then I installed cyanogenmod 11. Now I have to say that I absolutely love the note 8.0; it's my favorite computer. The wacom pen works perfectly, and the tablet is 100% pure with no traces of bloatware whatsoever and it runs smooth as silk. (The original Samsang had over 50% of the ram being used even without installed apps running, while with cyanogenmod 11, only 17% is used.)I would have never written this review, except that I did install the custom ROM (cyanogenmod 11) and the Samsung works like the dream tablet I've always wanted. Without installing the custom rom, I would give the note 8.0 a 4/5 instead of a 5/5 because of the bloatware.", "Title": "The best note taking, scratch work, doodling, tablet there is. Tons of bloatware yes, but you can get rid of it.", "Date": "April 14, 2014"}, {"Author": ">^..^<", "ReviewID": "R288SNM1MT6KWJ", "Overall": "5.0", "Content": "I had a Toshiba Thrive for seminary work. Nice, but too big.  Had a Kindle DX to use for PDFs. Couldn't highlight them. Had a Blackberry Playbook that took FOREVER to come on.  Bought a mini iPad. Horrible screen resolution.  Returned the iPad and sold the others.  Bought this instead.  I am loving it!Perfect size! Not heavy at all but feels quality.  People complain about the plastic but I don't know what the fuss is about.  It actually looks very nice and does not feel as slick as the mini iPad (I use one at work - school purchase.)My handwriting isn't very good and yet the S pen gets most of it correct when doing writing to text.  Easy to fix mistakes. I love being able to write on this thing! You can change the size of the line that it writes and change the color, too.  You can write with a pencil tool or highlighter, too.l downloaded EZ PDF to use for seminary.  I usually print off hundreds of pages a semester. No more!  Downloaded Avery photo editing to use.  Downloaded AVG mobile security.  All were easy to download and access.  Also downloaded some of my old stuff.Plugged in an old mini sd card from an old phone (1 G!!)  Loaded some pictures on it and it works great!l especially LOVE the ability to take screen shots with the S pen. I took some screen shots to use for my children's sermon tomorrow and pasted them into S note. Works great!I tried Awesome note and thought I would love it, but I actually like the S planner better.  I have input my calendar stuff and tasks.  You can view by day, month, year, tasks, or list - which includes your tasks and calendar stuff, too.The virtual keyboard is pretty nice. I am using it to type this. Takes longer than the computer but I can't put this thing down!Battery life isn't bad so far.  Lasts as long as my Macbook does.  I have the brightness set pretty low (easier on my eyes). I'm getting a full day with surfing, S note, etc. I turn off wifi when I'm not using it.  I've been using it for hours and I haven't noticed a concern.This thing also records!  Sounds good, too.Have had no problem connecting to wifi through my hotspot.This will fit perfectly in my purse.I did a ton of research before buying this, and I am very happy with it.  Great purchase! At $329, you can't beat it.", "Title": "I love this thing!", "Date": "December 28, 2013"}, {"Author": "M. Bailey \"Auntmarge6\"", "ReviewID": "R3FQ2UNT6ARCMQ", "Overall": "5.0", "Content": "I've had an iPad 2, a Kindle Fire 1, and assorted smart phones, including my current Galaxy Note II, which I love.  The Galaxy Note 8.0 beats them all for me.  It's the perfect companion for the Note II, using the same apps, but for browsing and reading Kindle books it's much easier.  WiFi only, in case that's a concern, but I use it mostly at home so have no issues with that.  I'm more likely to use the S Pen on the 8.0 than the II, but having three means of entering text (swiping, voice, and handwriting) on either device fills all my needs and moods. The 8\" screen is vivid, and the size of the tablet makes using it while I'm lying down, which I'm likely to do, very easy.  The 7\" would have been too close in size to the phone, and the 10\" was just too unwieldy.I also bought the Samsung cover, which snaps on and adds pretty much no additional weight or bulk, and it turns the device on and off when opening and closing.Battery life is rather limited, and the tablet needs to be charged each night, the same as the phone. I keep one charger upstairs and one down, and they each work on both devices.", "Title": "Superb tablet, easy to use lying down, and same apps as Samsung Note phones", "Date": "October 9, 2013"}, {"Author": "mandiimaci", "ReviewID": "RDMJDZ6D0U9LG", "Overall": "4.0", "Content": "Ever since I've received this tablet as a grad gift from my MOM I fall in love with it everyday. I'm moving on to a four year college and carrying my laptop to class wouldn't be ideal for me because it's so heavy. I just wanted something that I could throw in my bag, good at note taking, watch movies, play games, Surf web etc. I was leaning toward the ipad mini. However, the multitasking screens sold my mom and I as well as the capability of how precise note taking on this bad boy is. My penmanship isn't great so the fact that it can detect what I'm writing is amazing. AS I'm writing this whole review With horrible penmanship right now with very little errors, it's SO Smooth. I would have given it 5 stars but I must say the camera isn't amazing but I knew I wasn't going to use the camera much so the picture quality doesn't really bother me. All in all if you're a student and need a good note taking tablet for lectures rather than annoying keyboards, this is a tablet for you. Overall, I'm extremely happy I received this rather that an ipad mini.", "Title": "Best note taking tablet there is!", "Date": "July 7, 2013"}, {"Author": "Larry Lewis \"Blinkee\"", "ReviewID": "R23V9G8XKAJZG", "Overall": "5.0", "Content": "I have really enjoyed the Galaxy Note 8.0, its the perfect size and the screen clarity is great.  I installed a 64GB memory card and have loaded so many movies, music videos, video clips and music and there is still room for more.  I have not experienced any negative technical issues and do not have anything to complain about.  I am sorry this is not a techie review, I just like this product.", "Title": "Awesome Tab", "Date": "June 25, 2013"}, {"Author": "Joshua W. Smith", "ReviewID": "R3TT4IS4I51GZP", "Overall": "5.0", "Content": "I would consider myself a techy and have owned many devices; ipad (3rd gen), ipod touch, nexus s, galaxy nexus, galaxy tab 8.9, nexus 7, galaxy note 2 and now my galaxy note 8.SIZE FACTOR (I wear a large sized glove)I think the Note 8 has finally found the size sweet spot. The Note 8 is comfortable to hold in the portrait and landscape position. I found the galaxy 8.9 and especially the iPad to be awkward and cumbersome to hold. In the landscape position I found it difficult to cover the entire space of the iPad and tab 8.9. I did like the size of the nexus 7 but chose to sell mine on Glyde to upgrade to the note 8. The Note 8 feels very comfortable to hold despite it being plastic. I do not have a problem with plastic phones or tablets because I always put a screen cover and case on my devices to protect them.SOFTWAREI was not a fan of Samsung's earlier renditions of its Touchwiz interface on my galaxy tab (8.9). In fact, I still think that stock android is ideal but I just install the nova launcher app (see link below) and run that on top of Touchwiz which is the main reason to go with an android device, customization! I had toiled with the idea of purchasing the Note 8 because I thought it was overpriced. So after a trip to BB, I tried to force myself to get an iPad mini but still felt like I was using the same operating system I had on my iPod touch from 4 years ago. Apple might get better apps at first but they all migrate to Android eventually and Android has so many customization apps available it is hard to get bored. Apples control issues will be its undoing imo, and have severely limited what these devices are capable of doing. Does Samsung copy Apple? I think they do copy some aspects of Apple like the messaging app and touch keyboards looks eerily similar and the presence of a home button. I think Apple makes superior looking devices but Samsung and Android have superior software.DISPLAYThis is another reason I chose the Note 8 instead of the iPad mini which I also think is the perfect size. I strongly considered waiting for a retina display to come out for the iPad mini but could not justify moving backwards to an iOS device. Also after I put a iPad retnia display next to the iPad mini I did not notice enough of a difference to justify the added bulk and expense that comes with the retina display. The display on the Note 8 is absolutely gorgeous! It is one of the most vibrant screens I have ever seen.MISCThe s pen is an added bonus but the addition of an micro sd card slot that is not hidden inside the device is another reason not to overlook the Note 8. Both of these options make photo editing easier in my opinion. I have a micro sd card adapter in my camera and all I have to do is pop it in the Note 8 and photos are loaded into the gallery. The s pen is cool but I have not had enough time with the device to review its effectiveness. The multiscreen ability of the Note 8 is one of its better features. It has a limited amount of apps that function with the multi screen ability but all of the main ones like chrome browser, facebook, maps and all of the samsung apps function.  I purchased the device at BB and made sure they price matched the Amazon price.CONCLUSIONI can honestly say that I am completely happy with my purchase and despite the high price of the Note 8 I feel that I did not want to compromise with my tablet.  The Galaxy Note 8 is by far the best tablet/phone I have owned so far.https://play.google.com/store/apps/details?id=com.teslacoilsw.launcher.prime&hl;=en", "Title": "Why I chose the Note 8", "Date": "May 24, 2013"}, {"Author": "ALAIN RIZKALLAH", "ReviewID": "R9AJII6G9ZTZY", "Overall": "4.0", "Content": "So basically this tablet got a lot of reviews, and I'm sure all of you have read everything about its magnificent features specially the S Pen, so i'm sure i'm not gonna add much so I'll keep it as short as possible. It is a great product and me being a big android fan, I can confidently say it can't get any better ... oh well almost !!! The only negative thing I can say about it, is its inability to deal well with large pdf files. I think this is a  problem for android in general, and this is one of the areas where apple is still superior. Opening and skimming through large pdf books on apple devices, for example an ipad mini ,is much more fluid and you don't have to wait for pages to load even when the processor is actually weaker on paper than samsung's processor. I frequently use this tablet for reading and for the most part it does the job but recently I got a large book (around 220 MB) and the device had major problems with it. I tried several ebook  readers to open it and I noticed variable performances between them but none was perfect. The best reader which gave me a very fluid performance comparable to the one I saw when I opened the pdf on an ipad mini was the kindle application, I was happy but again the kindle doesnt have all the options provided by my favourite readers.As a summary, I highly recommend this tablet, it is superior to apple in most aspects except for the one I just mentioned, so I think the manufacturers should work on that.", "Title": "Great tablet ...but", "Date": "July 6, 2013"}, {"Author": "Jen", "ReviewID": "R382FJF13OQ4F8", "Overall": "4.0", "Content": "Let me start with what bugs me, which isn't much with this tablet.The placement of the home keys... This is just something I'm going to have to get used to. It's nice that Samsung created fixed home keys vs using the android screen home keys. Only there at the very bottom. Every time I'm holding in portrait mode my thumbs keep hitting the return and settings key. Trying to hold it avoiding those keys feels awkward. I don't have tiny hands so this is going to take some getting used to. Also, when it's in landscape mode I forget the home keys are fixed and have to get used to using them with my left hand or right (depending on what orientation I have it). For people who have never owned an tablet before they wont know the difference. For seasoned users, this will take some retraining.The camera is fine in portrait mode, but landscape it a bit awkward as well.Aside from those two issues, I'm totally in love with my Note 8. I'm just going to list the thing I love, since there are many detailed reviews already on this.Size: I've owned 10.1 and 7.0. This is a happy medium for me. I love my 7.0 but the extra inch is nice. Although I would have been happy with it at 7.0 as well. It fits in my purse well and doesn't weigh it down too much. My 10.1 inch always felt heavy in my bag.Multi-screen: Very cool feature. You can easily view multiple windows at the same time.Stylus: Never used one before and this is really cool. It's like using a pen on your tablet. Real easy to use. Only draw back is the home key the tablet is too hard to use with stylus, so I have to press it with my finger. Not a big deal for me though.Built-in apps: This tablet is designed for readers, note takers, web browsing and so, so much more. Samsung's built-in apps are really great. I've only had the tablet for less than week so I haven't had time to play with everything. However I from what I've used it's great for journaling and note taking. One of the main reasons why I wanted this tablet so I wouldn't have to buy anymore paper journals and do all my journaling on my tablet. Of course other tablets can take notes as well. It's just different with they stylus and the apps Samsung has provided.Micro SD: 64GB, that's all I'm saying. I've added on and it reads perfect. Yes, this tablet comes with free 50GB of space with Drop Box, but that's only for year. And what do you do when you want to access a file (pics or music) when you're offline? The added 64GB leaves me so much space to add my pics and music I'm set. My only wish is that Samsung/Google allowed for apps to be stored on the card as well. As with older version of Android used to do.Camera: Front and rear are great. Only when in landscape mode the home keys kinda get in the way. Again just some retraining for people who are used to having the home keys in the screen.Display: Love it. Took this to the beach. I had to have the brighten on the highest, but I was able to see it perfect. The reading feature is great too. Much easier on the eyes.Extra home screen: Every time you plug in your headphones or pull out your stylus you get a customized home screen that you can adjust how ever you want. So for example the stylus home screen has apps for notes and the headphone screen has apps for music and videos. With each screen you're able to add additional apps or remove them.There's so much more this tablet can do I can go on and on. The price is a bit too high. I can see it at even $50-$75 dollars less. However what the stylus does is worth it if you have a need for this.", "Title": "By far my best tablet to date", "Date": "May 1, 2013"}, {"Author": "pbtx", "ReviewID": "R25WBS0WUBTIIA", "Overall": "5.0", "Content": "Although I was hoping for an product refresh to bring the Note 8 up to the \"Note 10.1 2014\" spec range, I didn't see that coming from Samsung any time soon.. so I purchased the current model.  This was an afterthought to an ongoing adventure with the to-date miserable Dell Venue Pro 8 stylus*.  The Note 8 will update itself to Android 4.2.2, which is good news.  And although it appears only the 16GB version is out there now (at least in Wifi only) you do have the option to install apps to the MicroSD card.  The 8\" form factor is, in my opinion, a better size for note taking with the pen than a 10\" or 12\" tablet, although they are likely preferred for those with artistic tendencies.  This will be a productivity tablet for me.  Using Papyrus and the included S-note, I am very happy with this device.  It is a touch tablet until you need the pen, and a pen tablet when you want to take a note.The limitations of no native pen support in either Evernote or Onenote is disappointing, but not a show stopper for me.  Several pen apps will export or sync to Evernote, although so far I have found that integration is not as tight as you might hope.  But, Samsung did a very, very good job of the pen implementation here and if you are going to look to the tablet more than you look for what the tablet sends to your laptop, this is your device.The screen resolution spec is on the low side, but it is not noticeable.  I have found that in these 7-8 inch tablets, high end resolution specs may be overkill at least in everyday productivity tasks.  Comparing an iPad Retina, Venue Pro 8, and Nexus 7 2013 the only practical difference I see is screen brightness, rather than resolution.  Basically, I can illuminate a large room with the Dell or Nexus, but all are acceptable in normal usage.  Outdoors, you will favor the Dell or the Nexus.  So basically no complaints about the screen at all but I wouldn't mind a brighter one.So my conclusion here, if you need a pen-input productivity tablet and are happy keeping most of the information \"on tablet\" don't hesitate.  If you need Onenote with pen input, go look at the Asus Vivotab and the Windows world, or anticipate the hoped for \"Surface Mini\" later in 2014.-------------------------*Update on Dell Venue Pro 8.  Dell, without any request from me, send me a new revision active stylus.  Bravo Dell. The new version seems very usable with onenote, although it is a step down from the s-pen as expected.  As to the Samsung Note 8... I love it.  I have owned productivity devices since Newton, and this is probably the tops.", "Title": "Perfect size for, and great implemenation of, a Pen Tablet", "Date": "April 20, 2014"}, {"Author": "C. He \"Cryora\"", "ReviewID": "R32GDBRUKHDIKX", "Overall": "4.0", "Content": "It's probably the one of the smallest tablets out there that has a Wacom digitizer.  I personally felt like I should have gotten one with a larger screen (like the Note 10.1), since I'm physics student.  The writing is not as precise as pencil on paper, nor as fast (it has a small but noticeably latency).  My best analogy would be that the precision is somewhere between a sharpy and a ball pen.  Still, it allows me to save paper.  If you want a tablet for drawing, you might want something larger too, unless it's just for fun.Still, I reckon the small size of the tablet has its perks.  Its battery size is half that of the 10.1, and the battery life is only a few hours shorter.  So while it might not last you as long on a full charge, it takes less time to charge it.  Usually an hour or two is enough to get the Note 8 from almost 0% to 100% battery life.  You get more battery life per hour spent charging it compared to larger, battery hungry tablets.For the purposes of keeping memos, however, it's pretty awesome.  Everything is digital, so you don't have to worry about having a mess of disorganized flash cards or post-its around your desk.  Cutting and pasting is not that smooth, but possible.The Android OS is iffy.  While it's a nice combat OS that allows widget customization and multiple pages for your home screen, it lacks the same productivity as a Windows (especially if you're used to Windows).  You'll probably have to go out of your way to find apps that allow you to convert one file type to another.  Some apps won't even allow you options to open from, or save to a directory, but rather require you to \"share\" it via Google Drive or some other method.  Organizing files is certainly less efficient because of this.  You'll also have to go out of your way to find apps (sometimes pay for apps) to allow the same functionality that you can get for free on Windows, like writing programs in C++, and the capabilities will still be limited (console applications).  It does come with Polaris Office, which allows you to create document, spreadsheet, and presentation files, albeit with derpy compatibility with MS Office.  Sometimes symbols come out wrong, or the formatting is not conserved.The tablet screen, imo, is large enough to view full web pages (as opposed to mobile versions of the same pages), since it does have pretty good resolution.  Plus you can always zoom in if things are hard to see).  However, you'll have to go out of your way to make Youtube videos work on Desktop mode.For the Note 8 - No support for Java.  No gyroscope.  No flash (for taking pictures).  :(The back camera protrudes out from the back surface.  Solution - get a case.The IR blaster sucks (my TV won't detect it).The GPS is hard to use (Google Maps requires online connectivity, so either save an area of your map for offline use, or get an SMS version of the Tablet).  There are navigation apps, but the free open source ones have missing streets, while the more complete ones will cost you.  I've personally stuck to using a dedicated GPS device.There is a slot for micro-SD card.  You can also buy an on-the-go device to connect the micro-USB port (same port for charging) of this tablet to a USB flash drive, or SD card.  :)The bottom line is it's a great tablet for the price.  It does everything that any other Android tablet does (with the exception of serious gaming) and has an S-pen.  The screen size may not be ideal for doing math problems or more advanced art projects, but it gets the job done.  A lot of the neat features (Java, Gyro, Camera Flash) aren't present, but the tablet is compact and has a quick battery charge time (though not necessarily life, but enough to last you about a day per charge).  It does give you the Office capabilities, but specifically for spreadsheets, I much prefer working on Excel on a laptop or computer with a mouse (and a larger screen).", "Title": "Great tablet for the price", "Date": "April 17, 2014"}, {"Author": "Jersey Girl", "ReviewID": "RDCMFQ9W62QOA", "Overall": "5.0", "Content": "In the summer of 2013 I bought a 7 inch Tab 2, mostly for reasons of price.  I then experienced some buyer's remorse after I saw the Note.  I waffled back and forth because it seemed self indulgent to purchase another tablet so soon.  Then I caught a good deal on a Black Friday promotion and took the plunge.  I am so glad I did.The S-Pen really is worth it.  I tried after market styluses with both my Tab and my Ipad and they didn't have the precision (these devices also lack the digital layer that enables the S-Pen to function).  My work requires that I read and mark up PDF documents on a frequent basis.  Being able to do this with the S-Pen turns a chore into something resembling a pleasure.  The S-Pen is very accurate and my notes are legible.Other improvements over the tab are a slimmer profile device, a MUCH longer battery life, and a better screen.  It is fast enough for my needs.  I also appreciate the expansion slot so memory can be added economically.  The big apple gouges a bit for extra memory, IMOIf I were looking for a tablet for fun and leisure, I'd go for an ipad because of the more intuitive operating system and the greater array of apps, and for streaming digital content.  However, if you want to use a tablet for work as well as play, I don't think you can beat the Samsung Note series of tablets.  The multi-screen capability (while limited) is another big plus.  I would buy another without hesitation.", "Title": "I love this thing!  A quantum leap forward from the Tab", "Date": "April 5, 2014"}, {"Author": "Joe", "ReviewID": "R214BQ6UXUKP4L", "Overall": "5.0", "Content": "I have enjoyed plenty of modern tablets. Everything from iPads, Galaxy Tabs, to Sony's Xperia Z. This is by far the most comprehensive tablet I have owned to date. You will find better entertainment specs on different tablets like the iPad, but if you want something that can be used for EVERYTHING, the Note 8 is the way to go. I mean, the resolution is just fine for enjoying movies and games (people often complain because this doesn't stack up to something like the Nexus or Retina display). I love this thing. I love the S Pen. I love the handwriting to text features. I love the size. I love being able to shove this into my jacket pocket and rock out to my favorite tunes using wireless bluetooth earbuds. This has been one of those purchases that has been perfect in every aspect for me. I mean, this is the first time I have ever agreed to write a review.", "Title": "Best tablet I have owned to date.", "Date": "February 4, 2014"}, {"Author": "acrisis", "ReviewID": "R3AS2K7R4CTMC2", "Overall": "5.0", "Content": "It is so easy to do email with voice and handwriting recognition.  The technology is impressive, intuitive.  One clue: if you put a \"dot\" in the middle part of the text box it makes an apostrophe.  To get a period, put the dot near the bottom of the text box when writing.", "Title": "New paradigm for tablets", "Date": "January 24, 2014"}, {"Author": "Weatherwax Wannabe", "ReviewID": "R34E83SCECT6FC", "Overall": "4.0", "Content": "I love this device.  I can't tell you how much I've enjoyed having the S Pen option.  It has made both the work and play I use the device for so much easier.There are only 3 things that kept me from giving this 5 stars:  The cost (which I'm sure you've noticed), the placement of the power button (too close to the Volume Toggle, i sometimes hit the power button by accident), and the speaker placement (both speakers are on the bottom when in portrait mode.  When watching videos in landscape mode, the speaker placement means that you don't get balanced audio).I recognize these problems are very small (almost petty), and besides these little things, the tablet is fantastic.  I highly recommend this tablet for anyone who will be using the tablet for more than reading emails and light web surfing.  The S Pen gives so much more versatility and functionality than I've had with any other Tablet to date.", "Title": "So glad I got this", "Date": "November 20, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R29R476BDQD758", "Overall": "5.0", "Content": "I love this. It is my personal assistant. I have a 'photographic\" memory because of it.  Love the S-note!!  I am now \"paperless.\"", "Title": "It is awesome!", "Date": "November 13, 2013"}, {"Author": "Anja", "ReviewID": "R3BDWJB2QM4NWN", "Overall": "5.0", "Content": "I finally came into the 21st century with my first tablet and first android device.  (I still have a \"dumb phone.\")  I was all set to get a Kindle Fire, thinking it was a good starter tablet, since all I really wanted to do was read books, do a little internet surfing, e-mail, and maybe watch a few videos.  I read enough negative reviews that it made me think twice, and after seeing the 8 inch screen size on the Samsung in a local electronics store (not too big, not too small, just right!), and playing with the stylus for drawing and note taking, I was sold, even though it was more than I planned on spending.  The designer in me was also attracted to the white bezel and slim, lightweight design.I love the home button on the front, the menu button to the left of it that brings up whatever menu goes with the application you have running in front, as well as the return arrow that takes you back to where you were (very helpful for someone like me used to windows). Learning my way around the features was a lot easier and more intuitive than I expected, it's enough like Windows that I think I've figured most of it out in a much shorter period of time that I thought I would.I'm also using it for things I never expected I would like or need, things like opening e-mailed faxes I work off of every day, rather than printing them out, so this will eventually pay for itself in toner and paper saved.  One of the first applications I added was Kindle, and I've already downloaded a couple books, I'm actually reading more as a result because being able to enlarge the text makes it easier for my not so great vision.  I don't think it works within the Kindle app, but this tablet has some kind of reading feature that allows for adjusted backlighting and I think contrast with the text to make it easier.  Within the kindle app, though, I'm still able to dim it enough in the evening, for example, that it's not too much strain on the eyes.  For me it's fine, since I don't typically read for more than a half hour to an hour at a time, at most.Also LOVE the drawing and note taking feature, and I've sketched some designs in S-Note using different colors and pen/pencil/brush types.  No more scribbled notes, sketches and ideas getting away from me on my desk or the bottom of my purse.I still sometimes struggle to adjust to this screen size after being used to a 24 inch monitor, but I'm getting used to it and I'm so glad I bought this thing.  It's definitely more than a toy.  I just wish I hadn't caved and bought the ESET antivirus software that the sales guy insisted I needed, since I found a free Antivirus app in the Google Play store.  Hope I can return that.Wanted to leave a review since others' reviews of this tablet and the Kindles helped me make my decision.  ;)", "Title": "First Tablet and Android device, I LOVE it!", "Date": "October 29, 2013"}, {"Author": "Nicky", "ReviewID": "R3Q24CVADVA7OR", "Overall": "5.0", "Content": "I was contemplating for the last 3 months if I should get this or an ipad mini.  I finally checked them both out side to side at best buy one day and made the final decision of buying the Samsung Galaxy Note 8.  Then I had to take a day to decided if I wanted the white or brown/black one...I'm so glad I chose the Samsung Galaxy Note 8, I am enjoying it more than I should.  I mainly got it to work on working on my novels during times I'm away from home (since I don't own a laptop)  however it's proven to be so much more fun than just a tool for working.  I get carried away with this even when I have my desktop computer in front of me.  I bought this keyboard B00C321VG0 to go with it.  Both work perfectly together.I've had my fair share of playing on other people's ipads before so I know what those are like, and I'm so happy I won't have to be envious of them anymore, now I think they will be envious of my new toy.Things I love- You can do 2 things at the same time side by side!- The pen makes it so much easier to draw/sketch and make notes (typing on that flat screen is easy with the pen if you can only use one hand- Easy access to settings- You can personalize so many things, like having widgets and apps and changing font type, size, notification noises, etc.  (I think all ipads look the same, but when you look at the front page of these tablets you'll know right away if it's yours or not.)- Having the MicroSD card slot for more memory up to 64GB more (I believe)- The Extra buttons, I love the back arrow button (not just one home button like ipads have)Disappointments (Just one)- The camera isn't really great, but hey it's a tablet not a DSLR so I'm not supposed to expect much.- Connecting to the computer is a pain and confusing (I haven't really gotten into it, because I hesitate dealing with the annoyance)", "Title": "SO much better than an i-pad", "Date": "October 27, 2013"}, {"Author": "Shane Lewis", "ReviewID": "RW5WVYZR9CD05", "Overall": "4.0", "Content": "At first I was torn between this tablet and the iPad Mini. I am glad I chose the Samsung Note as it is the perfect device for a  part time student like me.This is my first Android device, I love the OS, the stylus comes in handy and the tablet is very fast and responsive, it is a bit pricey, when I bought it Amazon had it listed at $379 but after using this device for a month I must say the price is definitely worth it. The only reason I did not give it 5 stars was because it doesn't have adobe flash (I have seen reviews on YouTube showing how to bypass this but I don't want to take that chance and end up damaging the device) and it is not compatible with Amazon Prime videos.Shipping was extremely fast. I am an international customer, Amazon sent it to my shipping company in 2 days and I received it in a week.", "Title": "The price was worth it", "Date": "October 25, 2013"}, {"Author": "Ashraf A. Dawod \"Ash\"", "ReviewID": "R27AQJVJCK1ZHL", "Overall": "5.0", "Content": "I've had the Galaxy Note 8 for a little over a month now, and I have to say, I LOVE IT. Its perfect in so many ways.I'm a Full-Time musician & Part-Time PC Tech, and the GN8 is helpful in both of these aspects.The S Note app allows me to create folders to help organize where everything is. The Android OS allows me to have access to my Evernote & Google Drive accounts, which comes in VERY handy.The Musician:When working on new songs I now simply open up an \"idea note\" on the GN8, write down the chords, lyric ideas & take a little video of me playing the song & embed it into the same note. So a few days later when I want to revisit the song, I just need to open on that one note to help me continue from where I left.The PC Tech:I take lots of notes, especially when it comes to new problems, or obscure issues.  So writing or typing down my notes of the problem & the solution, provides me a quick way to resolve the issue if or when it happens in the future.Due to my double life, I have different email addresses, the built in Email program is BRILLIANT, It supports multiple emails from different carries, so I have both my gMail accounts & my GoDaddy accounts at a tap of finger.It gives you the option of viewing all the emails at once, or you can pick and choose which email you want to see.And the \"Delete All\" feature is a GodSend. When I want to clear out my inbox. I don't have to choose every single email anymore, I just to options and say \"Delete All\". Its brilliant.The S Pen is the REAL selling feature, it allows me to take notes, draw diagrams, or just doodle when I'm watching TV. Also I've downloaded the \"KoBo\" app, which turns the GN8 into an awesome eReader! the size is perfect for reading books.The 3 major difference I've noticed between the GN8 & the GN10 are three things:#1- The Size#2- The S Pen is smaller than that of the GN10#3- GN8 doesn't have an LED flash for the back camera.Honestly, those were not a deal breaker for me, the camera quality is OK, but you have to keep in mind that the device is not intended to BE a camera, it is much MUCH more than that. Its like a dream catcher for creativity.I had the GN10, it was a great device, but it was too big for my liking.If your looking for something with a great camera, then this is not for you.If your an active person, who has bursts of creativity & would like to capture it at a moments notice, then THIS is the device for you.I hope that helps :)Much Love.", "Title": "Creative Box & More", "Date": "August 9, 2013"}, {"Author": "Raymond K.", "ReviewID": "R1KZT9CJ3FNSTC", "Overall": "5.0", "Content": "I am very happy with this tablet. In few areas, it is even better than ipad. It is light enough for me to bring it everywhere as a small note book, including in office and on bed side. I never need to do paper notes. The s-pen is great. The scheduler integrates with weather report!  I love the smart-eye technology which works most of the time for me.  Too many good things to say, and I am officially impressed.However, the back camera stick itself out of the back a little me, making it easy to scratch. Anyway, a portfolio/ cover happens to solve this issue as well.It took me sometime (but acceptable) to figure out and test the data and app backup processes.  To me, this is extremely important. If I am going to put all my life data into this little device, I have to make sure the data can be restored.", "Title": "Finally a good tablet for everyday usage", "Date": "August 5, 2013"}, {"Author": "P. M. Hobbs", "ReviewID": "R3J0LU8P8L7SG4", "Overall": "5.0", "Content": "I have owned an iPad 3, Nexus 7 and a Kindle Fire HD, this is my favorite tablet. The 8 inch size is just right; it is lightweight, fast and responsive. I love the S pen and am learning more about it all the time. Also, having a microSD slot is a big bonus over the previous tablets I have owned. I considered a Galaxy Tab 3 (8 inch), but it doesn't have the S pen, has a dual core processor and only has 1.5 gb of ram. I really think the Note 8 is worth the $79 price differential. Because I have a Samsung Galaxy S3, I did not have too much of a learning curve. It took me some time to adjust when I went from an iPhone and iPad to an android phone and tablet. But I would never go back to IOS now. I love this tablet!!!", "Title": "My favorite tablet", "Date": "July 21, 2013"}, {"Author": "busymomPA", "ReviewID": "R2OR8NET9YJIRN", "Overall": "5.0", "Content": "Let me preface my comments by letting you know, we have both platforms, android and iOS in our household and both ecosystems have their pros and cons.  I don't necessarily feel one is superior to the other.  I read review after review (customer reviews from stores and \"expert\" ones from CNET, etc.) and sought information from sales people from at least three big box stores before making my decision and I'm so glad I went with the Samsung Note 8.PROS:I absolutely love the size of this tablet.  It is not too slim like a 7\" tablet and not huge like a 10\".  I find it easy to hold.Screen resolution is good.Responsive and fast.  I didn't feel I really needed the S-pen but I use it from time to time and it is a nice feature.Features galore, some that I use and many yet undiscovered.Setup was easy.  I find it easy to use, although I also have a Samsung Galaxy SIII.SD card slot.  While you cannot store apps on it, there probably is an app in the play store to enable you to do so.CONS:Price, although I saved $50 at Costco with a special they were running so that made the price more acceptable.If you don't care for Samsung's TouchWiz \"technology\", visit the play store and find one you like and customize the interface that way.Overall, I would definitely recommend this unit.", "Title": "What's not to love other than the price", "Date": "August 27, 2013"}, {"Author": "AJ \"AJ\"", "ReviewID": "RKXGF5ZCNOX4G", "Overall": "5.0", "Content": "This is an amazing tablet. I can do everything I can with a regular android tablet plus a lot more with this one. The battery life is average though.", "Title": "I love my Galaxy Note 8.0", "Date": "August 13, 2013"}, {"Author": "Mohammad Khazbak", "ReviewID": "R2NG5OZYT8ES7B", "Overall": "5.0", "Content": "I have been using it for a day now. It's lovely device and it's very smart. Samsung has really put so much effort in software and hardware innovation.* Setup is extremely easy. It took me no effort to link my email accounts, Google apps, Dropbox.* You will feel the processing power of the built-in quad core processor.* The pen is very accurate and sensitive that you feel you are typing on a piece of paper.* I tried the back camera indoor, it has a very high quality with regards to either picture colors or pixel density* It also come with many out of the box applications. It come with 50GB free Dropbox storage and other gifts that I'm going to redeem.* Battery life is good. I didn't use it much but, from my experience with similar devices, it has a long charge life* It's very convenient to hold, to read or to watch moviesAfter all, it has a fantastic outlookI recommend it for anyone who is Ok with having no build-in 3G. You will have to pay much more to get 3G model", "Title": "It's really smart and loves you as much as you do", "Date": "July 17, 2013"}, {"Author": "Jason A. David", "ReviewID": "R23765MQTH5QK0", "Overall": "5.0", "Content": "Easy to use.  That sums it up. The S Pen works like a charm and browsing the web is a nice experience.  We have 2 iPads and 2 Nexus' and they work well, but the 8 inch display is, well as the three bears and that one girl have taught me... just right. Text is clear, and paired up with a Minisuit case, this thing feels great. Multitasking is very handy too. Price? You get what you pay for. The value is inside the polycarbonate body. Try one for a week and you wont be dissapointed.Cheers.J", "Title": "Excellent on all fronts", "Date": "July 14, 2013"}, {"Author": "Carrie Harris", "ReviewID": "R1U4WZTQMQL99J", "Overall": "5.0", "Content": "I love this tablet really... Please read below for charger problem!This is why- It feels great in the hand (good size and weight), lightning fast, can use it as a remote for my favorite shows, works well with apps-no hick-ups, has security feature that can work with exchange (business professionals need to know this), screen is nice and bright, long battery life (didn't have to charge for 2 days-I use regularly), beautiful product, lots of features-note pop-up when you remove the pen (great for taking down a phone number in a fly-will do this even if tablet is not on home screen-just take out the pen), follows voice commands, key stroke commands, easily works for signing Adobe files (there is more to this so if you use this feature-write me and you need to know more), just all kinds of bells and whistles.The Charger Issue -I still gave the tablet a 5 star because the product works well.  I received a defective charger.  I own two of these tablets and they are just great.  If you find that the tablet isn't charging, look into trying another power cord that fits", "Title": "Love the Product - Watch Out for Charger Issue", "Date": "July 14, 2013"}, {"Author": "Hasan", "ReviewID": "R2LD5NUGQKUN3U", "Overall": "5.0", "Content": "This is the first tablet i bought and kept (bought the galaxy tab 2 and returned it). Im a college student so I use this to take notes on note sheets and power-points and it works great. Not small but note huge, making it very portable. The pen is awesome. When I kept reading the reviews that said the pen make this tablet worth 400, I didnt really believe that. But for some reason, I love this pen. Functional and sleek, it adds another \"dimension\" to the tablet. No lags or freezes or glitches so far, and runs smoothly. Would def. recommend to any college student or worker looking for a note taking tablet that can do anything else another tablet can do.", "Title": "I love this tablet", "Date": "June 23, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RQT28FF97NDBY", "Overall": "5.0", "Content": "I have to say for anyone out there who is looking to use the Samsung Galaxy Note 8 as a portable drawing/sketching pad (in addition to its long list of other fantastic attributes) this is the one you want. The S-Pen shines! I have Intuous 2 Wacom tablet for my computer (yes, it's super old but still works like the day I got it) and I was skeptical that a tablet pen would give me the pin point accuracy I wanted for drawing on the go - but I was quite impressed.I'm mostly using this tablet for drawing comics and sketches, utilizing the Sketchbook Pro app. I've tried other tablets with styluses and this one just blows them all out of the water! The pen reads how hard or soft you are pressing and responds by drawing a thin or thick tapering line. FYI artists - the sketchbook pro app has a great palm-rejection feature that will only accept pen input on the canvas, so you don't have to worry about stray lines showing up on your work.As others have pointed out, this tablet is also fantastic for note taking. The handwriting to text function is very accurate - it tends to get hung up on capital/lowercase letters here and there for me, but I suspect this is less the program's fault and more my own handwriting style. Love this tablet!", "Title": "Review from an artist's perspective", "Date": "June 5, 2013"}, {"Author": "J03L", "ReviewID": "R1D20XSRLSYY06", "Overall": "5.0", "Content": "This is the best tablet that I have tried. I have an iPad 2 also and I can tell you that the versatility of this Samsung is lightyears ahead of the iPad, the S-Pen is a tool that you get addicted to, and the speed is awesome.Great Tablet", "Title": "Great Tablet, Very good business tool", "Date": "May 29, 2013"}, {"Author": "R. Minert", "ReviewID": "R3V289H6MEP5IL", "Overall": "5.0", "Content": "Bought this tablet yesterday to replace my Nexus 7. I've always used a stylus with my N7, as I've found it a great way to interface with a tablet (and also keep the fingerprints down). From the moment the Galaxy Note 8.0 was announced, I knew I'd be buying it. So far, I'm absolutely thrilled with my decision.Pros:- The screen is very clear and easy to read- The tablet is very snappy, even after loading all my apps, I'm still experiencing no lag- The weight is perfect - it's light enough to hold in one hand while writing with the S-pen- Samsung has added a lot of user-friendly features to Android- The S-pen is a stand-out feature if you like to write and take notes on your deviceOther:- If you're used to a device with on-screen buttons (Nexus 7 for example), it takes a lot of getting used to having physical buttons (and for some reason Samsung put the back button on the right side)- Many have complained about the \"cheap\" build feel of Samsung devices. While this device is plastic, it feels solid in the hand, and the plastic makes it light and very easy to hold in one hand.  Since most are going to put it in a case anyway, the back being plastic really doesn't matter.- The change between stock Android and TouchWiz is drastic.  If you've got a prior TouchWiz device, you'll feel right at home on this one, but if you're coming from Stock Android, be prepared for some adjustment.Cons:- Only minor con is the price, but the S-pen and the hardware/software enhancements required to make it work well justify the additional cost over a Nexus 7 or the other cheap Android tablets out there.You can't really compare this to the Nexus 7 - it serves a very different purpose.  If you want media consumption, the Nexus 7 (or the other cheap 7-inch tablets) is a great device.  If you want a note-taking, document-editing work-device, this is a perfect choice.", "Title": "Perfect Size and S-Pen is Spectacular", "Date": "April 12, 2013"}, {"Author": "Dorothy", "ReviewID": "R2JUYLE2UXXQFK", "Overall": "5.0", "Content": "I bought this tablet as a replacement for my Samsung Galaxy Tab 7.0 plus. Being a college student, it is wonderful. I am able to purchase ebook textbooks and save money. The screen quality and display are superb for watching movies. I was not overly fussy on the stylus at first but then it became apparent on the multifunctional abilities that it has. I can highlight text and even scribble notes with ease.Comparing it to the Samsung Galaxy Tab 7.0 plus, it is faster at opening applications and offers smoother transition between applications. I am not down grading the abilities of the Samsung Galaxy Tab 7.0 plus, but more emphasizing the abilities of the Note 8. I like the slightly larger screen size.I did purchase the smart shell case. The wake/sleep function works flawlessly. It saves on battery power and increases the simplicity of use.Overall, I am truly happy with the upgrade.", "Title": "WOW! & so much more", "Date": "August 18, 2013"}, {"Author": "Byron", "ReviewID": "R1DEDTRC6Y4FY7", "Overall": "5.0", "Content": "I've never owned any smart phone or tablet of any kind. I bought this to break free of my laptop, which IMO is only comfortable to use in a table/desktop situation.My aim was mainly to be able to surf anywhere in my home. I bought the 8.0 Note after reading all the reviews about what a handy size it is(not too big, and not too small), and went for the Note specifically because the S-pen sounded useful.All I can say is, I love this freakin' thing! Where has it been all my life?This is what the internet experience was meant to be... something akin to having the comfort and flexibility of reading a magazine.The Note downloads web pages extremely fast... in fact all functions are lightning quick, which just makes it a joy to use.I use it as a reader, the screen size and light weight are real pluses here... I use it as a day planner, the S-pen is surprisingly accurate and relatively natural feeling to use once you get alittle bit of a hang of it... there is still a lot of S-pen functionality left for me to learn, but it's so cool to be able to take notes and schedule a calendar without digging through notebooks, and paperwork.I just figured out how to use the Peel app to run my TV... it's just basic functionality(volume/channels), but what makes it pretty awesome for me is that it's also a fully functional TV guide. I'm only viewing over-the-air television, so unless I buy some form of TV guide I'm left to surf through the channels to figure out what's on. Now the Note just tells me what's on, I tap the program I want and I'm there... pretty sweet not having to search the room for the remote either.Cons...I guess it is a bit expensive as far as Android tabs go, but it packs a lot of functionality that I guess no other tab this size does.Mine is a bit creaky, but as long as it keeps functioning like a rock star It doesn't bother me.I can't really compare the screen to some of the super-duper ones out there as I have no experience with them, but playing games, watching video, and using as a reader.. I can't say that I'm disappointed. Doesn't blow me away, but I don't feel short changed either, IMO it looks great.As far as battery life is concerned, I get 2 days normal usage out of a charge. In my experience the screen brightness is what really sucks the juice out of it. If you can live in the bottom quarter-ish of the brightness scale you'll do well. Also turn off things like Bluetooth, auto-sync, GPS, wi-fi when you can, and enable power-saver mode. Battery charges in around 2 hours for me.I dig this thing so much, I bought a refurbished Note 10:). I'm really liking the Flipbook app, and I'm thinking the 10 inch screen will be more satisfying with online magazines and videos... so the 10 can stay at home and the 8 can go on the road with me.Great product.", "Title": "Awsome piece of tech", "Date": "June 23, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1HWBNEXUP9SYE", "Overall": "5.0", "Content": "The main reason l chose this tablet was for the handwriting recognition, which is much better than I expected. There are times that I get to writing quickly and sloppily and l think, \"I can't even read that- no way it can.'' And about half the time, it pops up the correct word. It reads both print and cursive, as well as combinations thereof. My only complaint is that it has a tendency to capitalize c, s, and m at the beginning of words. (By the way, this was written on my Note. Much more efficient than typing on it.)Apart from that, it's about what I expected. Beautiful screen, quick responses. Big enough for easy reading, but still comfortable to hold. I do wish the split screen functionality worked with more apps, but it does well with the ones it has. Battery life is great, and it can get me through the day without needing to find an outlet. I've been getting 11-14 hours of moderate to heavy use out of it.I usually like to point out the cons, but there really aren't many here. l would appreciate the ability to turn off touch input when the pen is out, and it does come with a lot of Samsung bloatware, but that's to be expected when buying Samsung. Some of the preloaded apps are great, such as Awesome Note (which to my surprise, turned out to be truly awesome), while others are merely annoying and useless (hello, S Voice). However, these faults are not particularly noticeable in my daily use. Granted I've not had it long enough to be out of the honeymoon phase, but as things stand, I'd buy it again.", "Title": "Overall good tablet", "Date": "April 7, 2014"}, {"Author": "Aaron", "ReviewID": "R78WL358552AL", "Overall": "5.0", "Content": "This tablet is overall the best 8 inch tablet on the market at the time of this review in my opinion. There is no lag at all on anything, which is a refreshing change from my Galaxy Nexus phone (which is a great phone in its own way, but I digress). If you don't mind the overpricedness, this is the perfect size for a tablet and the responsiveness is fantastic. Plus it has external storage, which is unfortunately rather rare nowadays.", "Title": "Perfect size, fast speed", "Date": "April 4, 2014"}, {"Author": "beths.513", "ReviewID": "RXZZ67JTL81XN", "Overall": "5.0", "Content": "I chose this tablet for mainly two reasons, reason number one being there was a pen. Since I'm an author having something that I can alway write on (in print or my crazy cursive) was amazing! It feels like I'm writing in a notebook! It's awesome!", "Title": "Writes incredibly!", "Date": "March 27, 2014"}, {"Author": "PhilCave", "ReviewID": "R1XCMUZIR7IL6L", "Overall": "5.0", "Content": "I've been through several tablets over theyears, the most recent before SGN8 was a Nexus 7.  My wife and I still use the Nexus for bedtime reading and viewing.  But for business, travel, and everyday use this SGN8 is excellent.  The onboard notetaking, .pdf annotating, and calendar are just right.", "Title": "Absolute best toy going", "Date": "March 26, 2014"}, {"Author": "Shaell Rodriguez De Cruz", "ReviewID": "R2LF4H3YKAG056", "Overall": "5.0", "Content": "Bought this tablet on January 24, 2014. This notepad is better than I expected it to be. Awesome tablet for note taking and drawing. It also serves as a remote control and to watch movies on, when I lie on my bed at night after using my pc, I just hold it up on my chest and watch shows I like. The size of the tablet is just about right and I like this tablet for its S-Pen and elegant design.", "Title": "Perfect Size and S-Pen is Spectacular", "Date": "March 19, 2014"}, {"Author": "Becky", "ReviewID": "R3RIQ7F7NF1551", "Overall": "5.0", "Content": "This is a great tablet for both work and home. I do a lot of writing on my own time, and it is nice to be able to use the stylus to record stuff versus trying to use a touch keyboard or my computer.", "Title": "Love this device", "Date": "March 19, 2014"}, {"Author": "Jackson", "ReviewID": "R154XBSI0PJ3N4", "Overall": "5.0", "Content": "I bought this tablet after extensive research into what would be the best tablet for school, and I am more than satisfied to say the is THE best by miles. Ever played with all variations of iPads and Surfaces and NEXUS tablets, and while some are pretty good, none are as good for note taking. As one reviewer said, if you don't plan on using the S pen this is a waste of money as there are some tablets that are just as good for general uses for a hundred bucks less.The pen is incredible because the text-to-type feature allows even me to read my Own notes, because", "Title": "Perfect for School", "Date": "February 28, 2014"}, {"Author": "A. Phillips", "ReviewID": "RIXSNCCXZHCGB", "Overall": "5.0", "Content": "This is technically the first Note Pad I've owned,  however,  my son won an ipad (the New ipad) a couple of years ago, so I do have experience with that. I definitely did not want an ipad. To me, it's just a glorified smart phone and toy that's not very smart and not much fun to play with. Apple limits the amount of real work and enjoyment one can get out of it.When selecting a note pad, I looked for something that I could be productive with ( particularly with documents and such) whilst having the \"oomph\" that it takes for some reading and perhaps a movie every now and then. Not everyone who is in business,  thinks business all of the time. Not everyone who enjoys leisurely entertainment,  wants to be entertained all of the time, either.The spen is something I don't think that I'll ever want to give up. I don't know why every pad doesn't have one. I LOVE the spen!This little thing allows me to enjoy movies and reading without a hitch, I can create and edit documents of all types and keep myself more organized than I've ever been.  The quality,  in my opinion,  is great. I like the plastic backing and it has a perfect weight where it doesn't feel cheap or too heavy.All in all, I don't have a bad thing to say, after owning this for a month now. Don't know how I'll feel in a few months, or next year, but right now, this is glued to me and that's where I'm happy to have it!", "Title": "Love it!", "Date": "February 27, 2014"}, {"Author": "David Wehr", "ReviewID": "R7EPZX589BLUD", "Overall": "5.0", "Content": "If you don't have a strong need for an active stylus, this tablet isn't worth the price. On the other hand, if you plan on writing digitally, it's perfect. I use it for all my notes and homework at university. I've never had any complaints about performance or battery life. (In fact, I rarely get it below 50% in a day). The stylus is very accurate. The size seems perfect for a tablet. Much bigger, and I might as well use my laptop, but any smaller and it would be hard to use. It even fits in my coat pocket! All the Samsung junk is a bit annoying, but you can disable most of the things through the Application Manager in settings.Some tips if you want to use it for taking notes:  - I find the app LectureNotes the most capable Android application for note-taking. The full version is $5 I think, but when you just bought a $300 tablet, what's another 5? It easily lets you import PDFs to write on, and you can export as PDF to print to share. By using another application called DropSync, it will sync all your notes to Dropbox (which you get an extra 50GB from buynig this tablet), viewable on your computer.  - I bought a separate stylus to make long writing sessions more comfortable. It's the \"Bamboo Stylus Feel for Samsung Galaxy Note\". Be sure you get the one with the product code CS300UK2, not CS300UK, because it will not write accurately. It's only available from Wacom's website.", "Title": "Great for notes", "Date": "February 15, 2014"}, {"Author": "Samm", "ReviewID": "R2XFMJL1HHJ239", "Overall": "5.0", "Content": "When I was considering a tablet i wanted to find something that had features i could not get on my smartphone or my laptop. This device has those features. Sure, the price tag is a bit high compared to other tablets, especially in this size range, but the stylus and the 8\" screen are indispensable for me. I did go out and purchase the \"stylus with eraser\" for this tablet, because that is just plain cool.", "Title": "Perfect For Me", "Date": "May 23, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R9T3SOJ2B13F5", "Overall": "5.0", "Content": "People are comparing this to the iPad mini and the Nexus 7, but there is no comparison, as this comes with the S Pen digitizer stylus. It is a premium price for this feature, but I love the S Pen, I'm sick of capacitive styli, and I was willing to pay for this feature. If you aren't interested in having a digitizer stylus, then there are a host of 7-8 inch class tablets for a lot less money. If you want a tablet with this feature that's less that 10 inches, this is your baby.I don't find the resolution to be a problem with any but the smallest fonts, and the system is powerful enough to be fast and fluid in every way. Other people have covered pros and cons fairly well, so I'll add some other things I noticed:The Note 8.0 uses the same Micro USB cable and 5V 2 Amp charger that came with my Galaxy Note 2. I'm used to the proprietary connection on larger tablets, so this was an unexpected perk.There's a lack of cases out there right now for this size device, but I have a Timbuck 2 sleeve for my old Kindle 2 that fits perfectly. The inside dimensions of the sleeve are 150 mm by 222 mm (5-7/8 inches by 8-3/4 inches), and it fits perfectly. You could probably fit it in a case with the inside dimensions of 140 cm x 212 cm, but you'd need some depth to the case (a sleeve that tight might not fit).Update 1 4/24/2013For reference, I've also owned the Asus TF101, TF201, and TF700 tablets. I currently use a Galaxy Note 2 phone; previously I've used a Galaxy Nexus, Droid 3, and Droid X. My impression of the Note 8 is based on comparisons to the other Android devices I've used.Now that I've had this for several weeks, I absolutely love it. The size is perfect for taking with me to work, it's light and easy to hold for hours. The S Pen takes some practice to learn the commands, but now I can take a screenshot and make notes on it in seconds. The S Note app is the best I've used for handwritten notes, the palm rejection finally makes it so I can use a tablet as a notebook. You can import PDFs or images and make notes on them, and you can export them back out as PDFs or images. I've used the split screen a few times to make notes while I watch a video lecture, that feature is very nice.Battery life is excellent for a tablet. I get about 7-8 hours of screen time use before it hits 25%-30% (my cutoff for plugging it in). Screen use is streaming Netflix, browsing the internet, playing games, etc. Standby uses almost no power. I haven't let it sit unused for more than 8 hours, but the battery drop is minimal. I did set WiFi to turn off when the screen isn't on, this helps out battery life on any Android device.I've turned off the motion detection and eye detection. The eye detection had trouble with my eyes, maybe because I wear glasses?The included IR apps are pretty useless to me. We don't have cable on our TVs- we use streaming services, BluRay, and gaming consoles. I have two Samsung TVs, one from 2009, one from 2010. Neither worked well with the included IR apps. There is an app on the Play market that is compatible with the Note 8 IR blaster (Touchsquid Samsung). At $19 for the home version it's expensive, but then I realized that the Logitech Harmony remote I bought a couple years ago was four times the price and died in 3 months. So, I bought the app, and while it has a huge learning curve, I can control my TVs, DVD, BluRay, Xbox360 and Roku devices with the Note. Very cool.For the control freaks out there, the Note 8 rooted in seconds using Framaroot with the Aragorn exploit. THIS VOIDS THE WARRANTY. Unless you explicitly know why you want to root, don't do it.The entire system is fast and fluid. There's no issue with opening a YouTube link, watching the video the switching back to the browser or app. My poor formerly beloved TF700 Infinity has barely been touched since I got the Note 8, because it had big problems with fluid transitions. Bluetooth connections to external speakers (Jawbone Jambox) and headphones (LG Tone HBS-700) keep the audio in sync with the picture, another problem that my TF700 could never overcome.The Samsung keyboard is AWESOME! I love the swipe input and one-hand mode. Swipe input on tablets can be hit or miss, depending on the keyboard, but the Samsung keyboard in one-hand mode is small enough so swipe inputs can be done quickly. Also, it will automatically open handwriting recognition when the S Pen is pulled out. Previously, Swype was my keyboard of choice, but the Samsung keyboard is the most functional and comprehensive stock keyboard I've ever used.I continue to see reviews comparing this to the iPad Mini and Nexus 7. I stand by my assertion that there simply is NO comparison. Neither has expandable storage, digitizer stylus, or IR blaster. The stylus and IR blaster are not must-have features, but they are 100% worth the price difference. It takes some time to really explore all of the features, but I'm impressed with the functionality of this tablet.", "Title": "The S Pen Stylus is what you're paying for...", "Date": "April 12, 2013"}, {"Author": "N", "ReviewID": "R3O6XEG0JVAZ6Y", "Overall": "5.0", "Content": "It is expensive but the 8inch form factor is the perfect spot.  I use this for both work and relaxation.  If you have used wacom pens before and want them then this is the tablet for you.  It was kinda of expensive when I bought it, but because of the wacom pen I expected that.  I personally dont use the pen that much, but I tend to find it easier to write things than type then out on a tablet keyboard. The only downside to this product is that much of the pen support is wrapped up in samsungs software, which makes using custom roms a problem if you stil want pen support.  Samsung is also pretty slow on their updates and their updates arent the best either.", "Title": "Great tablet", "Date": "November 14, 2013"}, {"Author": "Gingerbread", "ReviewID": "R2J813FN97EVL9", "Overall": "5.0", "Content": "I am so glad I made this purchase, I have a 10.0 Samsung tablet, which I also love, but this 8 inch is the perfect size to take with you to meetings, work, the grocery store, etc.  The note taking feature is great when attending meetings, no more shuffling papers, no hunting for an ink pen (it's built in)! The resolution screen is beautiful, so clear.  Just the function capability of this tablet makes this a wonderful tool, but it's also and entertainment tablet as well.  If you have any doubts, I would recommend you make the purchase!", "Title": "Samsung Galaxy Note 8.0", "Date": "October 23, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2Y811E4Y4BDW8", "Overall": "5.0", "Content": "I bought my Galaxy Note 8 two months ago and use it constantly.  I am a college student and this tablet has completely replaced my laptop in terms of note taking. There is no longer any reason to carry my heavy computer around campus. The Note 8 is small enough to carry in my bag anywhere I'm going, but big enough to be able to take/see my notes. Perfect for students. I'm very happy I bought this tablet,  100% worth the money.", "Title": "Love.", "Date": "October 17, 2013"}, {"Author": "SUDS \"SS\"", "ReviewID": "R3MKSPPH26W1BI", "Overall": "5.0", "Content": "Have had the Samsung Galaxy Note 8.0 for about a month now and I love it. It is my go to tablet. I have an older iPad (2nd Gen) that is still up to  date, but  this Samsung has a lot of advantages over the full sized iPad. First, the Samsung Note 8.0 has an SD slot and I can add additional storage space for a very small cost. Second, the size, this tablet is the size of the iPad mini (I have a full size iPad). The Note 8.0 is much lighter, smaller and it fits in my purse. I can access my work e-mail via the touchdown app (not a huge fan of the app, but it is what my employer requires and it functions), I can easily connect the tablet to a wireless keyboard, and it is easier to read a book on the Samsung Note 8.0 than on a full sized iPad.A second important comparison. My husband bought a Verizon Samsung Galaxy Tab 2 for me as a gift. It was $100 more than the regular Tab 2 because it was compatable with Verizon and this Note 8.0 cost  $100 more than the Verizon Tab 2 and it is not 4G LTE. Within 11 days I maxed out the  Tab 2. The Tab 2 has 1GB of  RAM and this was not enough to support all of the things that I wanted my tablet to be able to do. The guy at Best Buyin the  Samsung department told me that sure I could switch and use my iPhone 5 to access the internet as a hot spot when I was not near Wifi, but that it would  not  be  very fast or as smooth as the Tab 2. I paid the additional $100 and upgraded to the Note 8.0 any way. This was  the best decision!!! This tablet is so much faster than the Tab 2!!! I am so happy that I made the switch!!!In the end, there are some things that I prefer to do on the iPad and based  on the  technology there are some things that just work better  on the Apple iOS than on Android, but  if  had to pick between the ipad or ipad mini and the Galaxy Note 8.0 I would pick the Note 8.0 hands down.I hope this helps you and if you have any questions I will do my best to answer.9/29/13 - the other day I tried to watch an Amazon instant video  only to find that Flash would not work and even though an Amazon video android app exists it will not work on this or other Samsung devices. I was going to drop this by one star but this appears to be an Amazon decision, not a Samsung decision. It appears that the only Android device that will work is the Kindle Fire. Unfortunately Amazon will let this app work on Apple devices just not other Androids. This is frustrating, but ultimately I decided this was an Amazon issue and not an issue with the device. I do wish it would run Flash, but apparently the only tablet that can run flash is the new windows tablet. Hope this is helpful!", "Title": "Loving this little tablet", "Date": "September 19, 2013"}, {"Author": "Kevin J. Fehr \"KFear\"", "ReviewID": "R27SZZILB90RC7", "Overall": "4.0", "Content": "First off, I've had the tablet for about 2 weeks now.  I'm coming from an Ipad 2, Asus Prime (with dock), and the Nexus 7.  I prefer Android and the entire Google experience much more than the Apple IOS.The PROS:Samsung brings a lot of features to the table that really work very well.  When the S Pen is unleashed the tablet can open up a world of shortcuts and applications that make wonderful use of the tool.The tablet has a good feed to it.  It doesn't scream out quality like the Asus Prime or Ipad, but doesn't feel cheap.The screen is great, not the best, but no complaints here.  Text is easy to read and crisp enough so that your eyes aren't strained over time.The Samsung Universal apps are actually useful on this tablet.  Not all of them, but i good deal of them are very helpful and functional.SD card storage.  A must in my bookProcessor, with 4 cores, is great for multitasking.Battery life is great.  I have NO idea what people are complaining about when it comes to battery life.  I take notes, surf, play a game or two, and check email.  I can get at least 2 days out of this tablet. I'd guess a good 5-6 hours of video time.  It should make it through that long flight.AirView.  It works very well and it's very helpful, in most cases.SNOTE.  They really did do a wonderful job with this app. My only complain is that landscape mode is too pixelyThe CONS:Even though this is a 1.6 ghz quad core, it can run a little slow when selecting apps and toggles.  I blame Touch Wiz for this, mostly.  If you fully disable the \"bloatware\" the device becomes a bit faster.  Maybe it's just me?Just comes in white, for now.The Bloatware.  Some of this stuff is just completely unnecessary to put on a device.  \"Samsung Cares\".  A video demo of the device (for retail).  Samsung, are you kidding me????Reading Mode.  Very cheap trick, doesn't even dim the screen.  Download an app to give yourself more appropriate lighting when in the dark.No ability to change your notification bar toggles.  I LOVE how they made this possible on the S4Settings are hard to find and plentiful.  It will take you a week to find all the little tweaks and features of this beast.  Once you find them all, you'll appreciate the product more and more. Still, the layout isn't the easiest to follow.I hope this brought new info to the table.  It's a great tab, but I have yet to buy a electronic item that is \"perfect\".  Too me, the Asus Prime came the closest.  BUT...if you need a note taking machine that is a bit more portable than the glitchy 10.1 edition....go for this one.  You won't be disappointed.  If you aren't stuck on Pure Android this is the best smaller tablet on the market.  I sold my Nexus 7 after this purchase.", "Title": "A Must For The \"Write\" User", "Date": "June 11, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2FL6VTF1W3M9U", "Overall": "5.0", "Content": "(Although I had owned two, a kindle fire and a galaxy tab 2 10.,  before.)I really discovered how much one can do on a tablet with the fire, which replaced my 14\" dell laptop as my constant companion. But the fire only whetted my appetite for a 'real' android tablet--I.e., one not so buried in the kindle ui, so I bought a galaxy tab 2 10.1. It was very convenient and fast, but not so handy as the fire had been. In fact, I liked the fire so much that I've given three of them as gifts. Meanwhile, I kept being tempted by the note 2, thinking it would be a better all-around device than my tab. I love being able to draw and make notes as well as surf and watch and write. When the ipad mini came out,  I considered it, but it just didn't feel quite right in my hand, and I had become a devoted fan of the android os by then. So, I was hoping Samsung would make a note 7.0, doing all the things I wanted but costing less than the note 2. After all, there's wifi nearly everywhere now.When I heard the next note would be an 8.0\" device, I almost went ahead and bought the 10.1 version, thinking the 8.0\" size would be nearly as big a hand full, so why not have more real estate to doodle on,especially Iin the duel screen mode.But, the introduction day for the note 8.0 found me at Bestbuy, holding the note 8.0, which is enough different in proportions from the ipad mini to make all the difference. The greater pixel density more than makes up for the 2\" smaller screen than the 10.1. And, it's noticeably faster,  at least than the tab 2.After 2 months of daily use,  I am as pleased as I have ever been with any purchase. The battery lasts all day, and it's just a very pleasant little device to carry around. It's hardly heavier than my kindle touch, which seldom leaves the house now . It's surprising easy to see the screen in most light conditions. The keyboard is an easy size to use with one or two hands, and it has the best hand-writing recognition I've yet found, alhough sometimes it decides my capital letters are numerals.The major drawback is that I wish Samsung had immediately introduced it with more memory.Would I recommend it to a friend?  Not necessarily. If you just want to surf the net and watch movies or play games or listen to music, then there are several 7.0 tablets out there at much lower prices. I've been giving the tab 2 7.0's as gifts now that the price is so low, but the nexus is also excellent.But if you want a tablet for creating stuff, the note 8.0 seems the best choice available now.", "Title": "The tablet I was waiting for.", "Date": "June 11, 2013"}, {"Author": "David M.", "ReviewID": "RV9W1PNX3A5U4", "Overall": "5.0", "Content": "***5/17/13***Update: I just noticed the price drop to $379.99. I contacted Amazon and they gave me a $20 credit from my original price. Amazon comes thru again. Now, with this price, even more of a reason to pick up this tablet.***end update***I have had his item for 2 days now, after orginally trying one on launch, then returning it. I was hoping to see a small price drop after the initial release, but when that didn't happen, I wanted to grab this before the Play credit of $25 went away.So, as I state, this is truly a perfect carry around size for me. I've had no issue with the back button as some people have stated, and the feel of the pen is so close to actual writing that I have almost gone to it all the time for my email and note taking. I put on a Minuguard clear screen protector and find that it gives just the slightest drag on the pen to make it feel like writing on paper.I had been going back and forth between this item and either the Kindle Fire HD or the Nexus. If you want to use the pen, have a rear camera, and card storage, then this item is a no-brainer. If you want something to consume media, then the Kindle Fire HD has the best screen I have ever seen in this size package. The Nexus was the least expensive, was easy to carry also, but I was hooked on the S-pen of the Note and needed a camera for my work.With all that said, the only thing holding me back was the $399 price. But, with the 2 years of 50gig Dropbox, and the $25 Play credit, you can drop that $399 down to $300. Also, this tablet comes with the charger. The Kindle would require another $20 for that part of it.", "Title": "A truly perfect size", "Date": "May 15, 2013"}, {"Author": "babydoll", "ReviewID": "R194NN1EHFEWXS", "Overall": "4.0", "Content": "I just wanted a tablet to read e books mostly and this do the job. I should have bought the nexus 7 though because it's easier to hold in one hand in bed.If you update the OS you would lose some features like multiple windows, and some features in S note, etc. So bare this in mind.Honestly I am not a fan of Samsung except their TVs. I found their phones and tablets not worth the hype that much because they are not so good on battery life and they get hot. I find myself still reaching for my iphone to read when I wake up in the middle of the night because it's easier to hold. I am going to invest in a holder/ mount so I can get more use of it.", "Title": "I like it", "Date": "May 20, 2014"}, {"Author": "James", "ReviewID": "R2QDNT207QGJL7", "Overall": "5.0", "Content": "I bought the Samsung Galaxy to replace my typical notebooks and it really does help me. I carry it everyday and is reliable with a good processor. I would say that the 16GB is not enough so I bough an extra 64GB SSD to have all data, music and videos with me.", "Title": "Love it", "Date": "December 11, 2013"}, {"Author": "Ted L. Norrid", "ReviewID": "R3PPX7JHTBPWZ0", "Overall": "5.0", "Content": "I love being able to take hand written notes and storing them in folders.  It is a great all around tablet.", "Title": "Great tablet", "Date": "December 1, 2013"}, {"Author": "Gail", "ReviewID": "R2YAJ48KX2OL6", "Overall": "5.0", "Content": "This is my first tablet and I am amazed at what it can do. A lot of it has been intutive and the rest I am learning from the downloaded manua. The picture is awesome and everyday I learn something new about it. Highly recommend.l", "Title": "Love at first sight", "Date": "November 13, 2013"}, {"Author": "Devon white", "ReviewID": "R3SRY3E50SAGA", "Overall": "5.0", "Content": "Just got my hands on this tablet for 359.99 great deal I own a ipad and this tablet is far superior I love it I love the s pen, without the spen it would be just an ordinary tablet with the s pen its a uniquely designed and truely great", "Title": "aweson", "Date": "October 31, 2013"}, {"Author": "big nick", "ReviewID": "R101I5IBWI8TWM", "Overall": "5.0", "Content": "I was skeptical about buying it at first.  Ive had it a month and use it alot ofr meetings and surveying.  its very handy and does everything flawlessly.  The pen is accurate.  i really have no complaints.", "Title": "Very good personal tablet", "Date": "October 31, 2013"}, {"Author": "Luciano", "ReviewID": "R34RLJEZI6FHTX", "Overall": "5.0", "Content": "It works great, the S pen is exactly what you expect and you need. The full HD screen leaves nothing to imagination. The fact that you can expand your memory card for very little money makes it an even better deal", "Title": "Amazing Product", "Date": "October 24, 2013"}, {"Author": "F. G. Nunes \"FGNunes\"", "ReviewID": "R1YDNVTQFFXPFB", "Overall": "5.0", "Content": "Thought of a tablet, but I'd like to skip the 10\"ones given the size and weight. This Samsung seems to be the best solution for my search. Nice design, light and comfortable it a great \"on the go\" tool. Nice, fast response amazing, crispy screen definition and colors and the S pen are among ots great features. The only problem is the about 10Gb free memory for a 16Gb capacity, what means only 60% of available room. This is litttle for a machine like this.", "Title": "Great tablet", "Date": "October 15, 2013"}, {"Author": "Sarra Lederman", "ReviewID": "R8M5GTO8QWCOY", "Overall": "5.0", "Content": "I love my new tablet.  It is so easy to use, and stays charged for a long time.  It is so perfect in size and lightweight.  I am still getting used to using it.... but as a book reader it is the best I've seen.  Really good product.  Looks just like and I Pad, but is actually better, price wise, you can't compete, and  because I  love all the apps,  I can sync it by blue tooth to my cell phone and get wifi anywhere!", "Title": "This is a really lovely tablet.", "Date": "October 8, 2013"}, {"Author": "W. Wetherbee \"Trek biker\"", "ReviewID": "RUPRHVOEAKA5C", "Overall": "4.0", "Content": "I would give the Galaxy Note 8 five stars except that I had hardware issues with the screen.  The Note is fast and has a vivid screen.  I got the wifi version only and upgrading it was very easy.  Several goodies came with the Samsung Note registration, like $25 to use at the Play Store and $50 to use at Samsung WatchOn.  If I had known this, I would not have agonized nearly as much about spending the money for this tablet.The only downside was that the screen started to fail after a week and showed colored blocks.  I thought the upgrade or some app was the culprit.  Samsung support was good and after trying a few things, I ended up resetting the Note back to factory settings.  This seemed to work for a few days and then the issues started again.  I worked with Samsung support and saw that pressing the screen was now making it change colors.  Now I knew this was a hardware issue.  Support sent me a link to print the label and shipping was free.  It took less than a week to get the Note fixed and returned (fortunately I live close to a service center).  The Note has worked great since.  One other downside was that I added a 64GB micro SD card and forgot to remove it before sending it in.  The card was not supposed to be touched but it was removed and not returned.  I called Samsung and they promised to send an AMEX gift certificate that will basically cover the cost of the SD card.  The AMEX gift cheque arrived today.", "Title": "Really like it, but had screen hardware issues.", "Date": "October 3, 2013"}, {"Author": "7300gilbert", "ReviewID": "R1ZN3QB19XXOXM", "Overall": "5.0", "Content": "now he barely look into his laptop anymore ...it's very good for university student to take any notes and even recording.love it!", "Title": "my son love it!", "Date": "September 24, 2013"}, {"Author": "GrDnMM", "ReviewID": "R1SBOI6DKFH7KR", "Overall": "5.0", "Content": "ABSOLUTELY FANTASTIC! I love it. Very handy. Big enough to type or write but not too big. very portable, color screen is outa sight!", "Title": "tablet and then some", "Date": "September 24, 2013"}, {"Author": "Josh", "ReviewID": "R3FXICLXRBTVDF", "Overall": "5.0", "Content": "Really love my note 8. I have an ipad and wanted something smaller and more portable.  I have got my faith back in android and am probably going to switch back. I got really bored with ios and love the customization and the spen. I am going to get a note 3 or s4 because of this product", "Title": "Best 8 inch tablet on the market", "Date": "September 16, 2013"}, {"Author": "Shilohna", "ReviewID": "RG3XXQF2B8LKU", "Overall": "5.0", "Content": "After a lot of research into the best tablet for me I was determined that this would meet my needs and it soooo has! I have been approached by numerous persons asking which tablet it is. The 1 inch difference from the tab 2 makes such a huge difference! I love it!", "Title": "Loveeeeeeee", "Date": "September 8, 2013"}, {"Author": "Old Teck", "ReviewID": "R14JANPTSR203E", "Overall": "4.0", "Content": "First off, I have owned a galaxy note 10.1 since first release, I wished they would have put the parts of 10.1 into the 8's body! Even though 8 has bigger processor and memory it has noticeable lag issue's up to the 10.1! There's no tablet out there going to top the 10.1, not even samsung's predecessor in what they first said was going to be a 8 inch version of there 10.1 with stronger processors and better battery, they fell short on both categories! Don't get me wrong it's not quite going back to the store just yet, love the form factor up to the 10.1! I personally think that samsung put harsh processor restrictions on this unit! Photo shop touch is not here unlike on the 10.1 and video editor isn't either,  video editor is available via samsung's app store (free) and photo shop touch through play store for a very high 9.99! One of this units highlights is the ease of charging through micro b usb , it's always been a hassle on 10.1 with it's proprietary cable to charge with anything other than a wall adapter! This 8\" of mine will most definitely be getting rooted just to unlock full potential of hardware and to eliminate all samsung's pre loaded push software!", "Title": "Definite Potential!", "Date": "September 1, 2013"}, {"Author": "Jack Arnold", "ReviewID": "ROWKV9TJO6MXW", "Overall": "5.0", "Content": "My older tablet is a Motorola Xoom (wifi only). I bought the Note 8.0 as a replacement and I desired the pen functionality.  1 week with the unit has proven that I made the right choice. The price is worth it for the features and the quality.", "Title": "Very solid tablet", "Date": "August 15, 2013"}, {"Author": "RWL", "ReviewID": "RPU95L0PAIL6J", "Overall": "5.0", "Content": "Still playing with this tablet, but it has lots of features, and is really comfortable in your hand, and is easy to setup for email, and other applications. I added the 64 GB sandisk memory card, which helps extend the storage capacity. The tablet takes great photos and videos, and is way cheaper than the mini Ipad.", "Title": "Small tablet, powerful features", "Date": "August 14, 2013"}, {"Author": "I. Thomas", "ReviewID": "R2HFUOOSO750U8", "Overall": "5.0", "Content": "If folks would like to discuss anything related to your Note8.0 or any other tablet with a stylus, you are welcome at the G+ \"Tablet Pens and Sins\" group. See you there! - Ivor", "Title": "Google+ discussion group for penabled devices", "Date": "August 12, 2013"}, {"Author": "PBin \"PMB\"", "ReviewID": "R19QU6L9LDN79", "Overall": "4.0", "Content": "Purchased this for my daughter who is in college.  She wanted it to help take notes in class and the other apps (she has an ipad) but likes android better.  She can also chat with this and use it as a remote for the TV.  I thought it was a little expensive but she likes it and uses it all the time.", "Title": "good buy", "Date": "August 11, 2013"}, {"Author": "Mateusz", "ReviewID": "R383FJBN69AKO6", "Overall": "5.0", "Content": "Its been a hard choice, i always would like to posses tablet which will be great use for me. The 7 inch do not do for me and almoust all 8 inch wasnt equiped with good hardware, then note 8 come. Meybe price is a lite too high, but surley this tab is worth it.", "Title": "own it!", "Date": "August 9, 2013"}, {"Author": "A. Mordo", "ReviewID": "R2HDXDBFI6FZS9", "Overall": "5.0", "Content": "Pros:This is an excellent product. The Galaxy Not 8 is smooth and works fast, very easy to hold. Compare with my other tablets (iPad and Motorola Xoom) it is much better, I think it is the perfect size, the screen is big enough and the device is small enough to hold in one hand. Other 7\" devices were slightly too small for for my taste, but this 8\" screen is perfect.Con:There is an issue with connecting to wifi under certain network configuration. The Note 8 will not \"see\" some wireless networks. After some trial and errors I manage to solve this issue by changing my wifi router settings (you can read about the problem and the solution here: [...] ).The S-Pen is a nice feature, but since I use evernote which does not support S-Pen there is not much use for it (for me), unless you use Samsung's S-Note. This is not really a con for the Note 8 but more a con for evernote.Overall I highly recommend this product", "Title": "I Love It", "Date": "July 22, 2013"}, {"Author": "David S.", "ReviewID": "R2QHMAHK7HNSIX", "Overall": "4.0", "Content": "I purchased Samsung Galaxy Note 8.0 (white) about 6 months ago, and so far,  I have never had any problems with this tablet.  I like how thin it is and that it is faster than Galaxy Tab series.  But I do wish that its screen had a better resolution.  Although I can read small texts, they are not clear enough to read Web pages,  at least for me.", "Title": "Samsung Galaxy Note 8.0", "Date": "April 8, 2014"}, {"Author": "Cliente Kindle", "ReviewID": "R2XHTXNM4QIO5G", "Overall": "5.0", "Content": "The 8 inch size is great for reading and working. Not as small as a 7-inch, but not as big as one of 10. Buy this tablet primarily to read and paint. Reading is quite good, and the pen works great. The tablet is very powerful with quad-core processor and 2GB of RAM. The display has a maximum brightness level of amazing, and is very colorful. It is not Full HD, but it looks pretty good, and I really like.The camera did not expect much, it's bad. But the camera is what I care less on a tablet. For me it is something useless.Samsung Galaxy Note 8.0 (16GB, White)This screen is 1280 x 720 pixels. Not as sharp as the latest Galaxy Tab 8.4 , Kindle Nexus 10 or HDX , but very colorful screen and looks pretty good.Something I really liked is reading ebooks. Also I have a Kindle Fire HDX 7, which is great for reading, but the Galaxy Note 8 so is. Being the brightest screen, thought it would be annoying to read , but to test it , I have been amazed at how good it is to read , I'm not tired eyes and I can read the text very well .Taking notes freely in the S -Note has also been a very pleasant experince , I can create as many pages as you like and keep everything in folders.Sketchbook Pro also runs very well , this tablet has a quad -core 1.6GHZ processor , 2GB RAM. This gives quite fluently , I can create multiple layers and work on large canvases smoothly. The S -pen works great , although I must admit that the sensitivity levels in these tablets is still not as good as the Bamboo, but you can make good sketches .", "Title": "A spectacular tablet and you can get very cheap", "Date": "April 8, 2014"}, {"Author": "jock stein \"celtic\"", "ReviewID": "RF95WC91YJ28V", "Overall": "5.0", "Content": "just a great tablet, tons out there but I took my time in choosing this one, love the s pen.", "Title": "the best", "Date": "April 7, 2014"}, {"Author": "Katie M.", "ReviewID": "R3QDJVJCT88IH5", "Overall": "4.0", "Content": "I like this product very much.  I thought I was getting the pen with it, but it didnot come in the package.  I also saw it for $100 cheeper with the case included at BJ Wholesale.", "Title": "samsung galaxy", "Date": "April 7, 2014"}, {"Author": "jonathan lewis", "ReviewID": "RVOCMUXGQPSEF", "Overall": "5.0", "Content": "Awesome tablet! 4 1/2 stars. I love almost everything about it. Samsung's touch wiz interface has improved a lot. My only complaints are the lack of camera flash, and position of the speakers. Not a big deal, but flash improves picture quality a lot, and I like to hear the left/ right speakers individually. They are to close together, and at the bottom (in portrait mode) so hands sometimes get in the way. I think this is the best tablet for me, and the best features for the money. You should buy this tablet.", "Title": "Awesome tablet, 4 1/2 stars", "Date": "April 1, 2014"}, {"Author": "Cesar Ostos", "ReviewID": "R3PRDEH77L1FYM", "Overall": "5.0", "Content": "I bought this tablet on June 8, 2013 and i'm happy with it. It's efficient and really really fast, all apps run really well, specially the optimized ones (obviously haha). The only \"trouble\" is that 16GB version has only 9.85gb available, i can live with that, so isn't a trouble for me, just saying.I love the S-Pen integration, it's amazing to use apps like S-Note because gives you a wonderful experience with the stylus.Everybody hates \"TouchWiz\" (including me) but in this gadget is pretty awesome, works good, even when you're using \"Multi-Window\" option (a wonderful experience, BTW)I can totally recommend this tablet, if you got the money and you want a good device, what're you waiting for?", "Title": "An amazing toy.", "Date": "March 22, 2014"}, {"Author": "kyrhyne", "ReviewID": "R3QARKBLVVTP1C", "Overall": "4.0", "Content": "This is a very good tablet.  It has some small issues (the android update caused some problems with the split screen) but overall its great.  After some minor inconveniences (with update) everything works great (even the split screen again).Processor, battery life, display, and S-Pen function are all very good.  I recommend it for anyone wanting a 7-8\" android tablet.  My wife has a Kindle HDX 8.9 and its great but has limited apps.  This is a better fit for my needs.  Very satisfied.", "Title": "Very good tablet", "Date": "March 22, 2014"}, {"Author": "Rasha aldridge", "ReviewID": "R1V17C5ERZ46WM", "Overall": "5.0", "Content": "I did alot of research before purchasing this product.  It's a really great buy, I love being able to mutitask with the two screen's.  Grafics are grate for games and movies show great ! I even connected it to my scanner & printer combo, and it works great making office work a brezze with word document. I made the right decision I love my tablet and would recommend it to others.", "Title": "great product :)", "Date": "March 21, 2014"}, {"Author": "epalin", "ReviewID": "R2JSV4XJF38SZP", "Overall": "5.0", "Content": "I got this tablet because my 10 inch was too big to lug around. I was hesitant to purchase ANOTHER tablet but this was so worth it.The handwriting tool is worth is just on its own. And the cut and paste and all the other s-pen features make it a godsend for school and work.I would buy this again in a heartbeat. It is cute looking, amazing running, and since I followed a suggestion I saw on the reviews and did NOT update the software, it has run like a champ.Love love love it.", "Title": "Portable, fantastic", "Date": "March 17, 2014"}, {"Author": "Joseph E Schmitt", "ReviewID": "R1GT82W26L0V7W", "Overall": "4.0", "Content": "The tablet is exactly what I was wanting and is functioning well, being \"not new, but like new\" I was unsure and at first could not get it to charge.  Reason: Probably why someone else returned it, the charger/recharger doesn't work.  But having another identical charger/recharger I am able to attach and charge without any problems.  I probably should have reported or returned it but having been hospitalized and in physical therapy rehab during this process I found no need nor real justification.", "Title": "Tablet great! But", "Date": "March 17, 2014"}, {"Author": "jewel park", "ReviewID": "R1716C12O44MCX", "Overall": "5.0", "Content": "my daughter absolutely loves her notebook tablet and takes it everywhere.  it does have a hard time keeping up with her college notes if she spells the word incorrectly and that slows her down but overall a great notebook.", "Title": "note 8.0", "Date": "January 15, 2014"}, {"Author": "Maxwell", "ReviewID": "R2DG8TCRSXCAQS", "Overall": "5.0", "Content": "The Note 8 is awesome.  Does everything that I had hoped and more.  I use this to take notes during meetings at work, at school, and also in church.  The S-pen works flawlessly (especially in the Papyrus app).  One thing that I love in this device is the wifi, which has better connectivity than my laptop!  The device has a nice look to it, the graphics are great, and the processor is snappy.  I'm very happy with this purchase!", "Title": "Exceeded my High Expectations", "Date": "January 14, 2014"}, {"Author": "Amanda Carolyn Layne", "ReviewID": "R2NVKOVQRWZQFQ", "Overall": "5.0", "Content": "Great size and fast performance gives me the ability to do everything I want.  I haven't gotten the IR tv remote to work yet because my two-year-old plasma panasonic viera tv is not available for that service.", "Title": "Best Tablet I have Owned Yet", "Date": "January 14, 2014"}, {"Author": "Moe", "ReviewID": "ROBS383VU45W9", "Overall": "5.0", "Content": "Two years ago, I bought my first tablet, first generation Kindle Fire.  It's excellent for reading, playing games, reading email and watching Netflix.  Then I wanted a tablet that I could take handwritten notes on, and the Samsung Galaxy Note 8.0 is perfect.  I've only had it a month, so I'm still learning, but I use it for all the things I used the Kindle for, plus so much more.  The app selection is so much larger through Google Play, and the 8-inch size is perfect for me.  I did look at the Ipad Mini before making my choice, and I'm glad I got this one instead....highly recommended!!", "Title": "I Love this Thing!", "Date": "January 12, 2014"}, {"Author": "Kelley O'Neill", "ReviewID": "R3IBDJEBI6YK3L", "Overall": "5.0", "Content": "It is light, and a perfect size for what I need it to do.  I bought it to take on the road with me for customer visits, and trade shows.  Have taken notes at meetings all week.  My co-workers all want one now.  The only thing I would change is adding a flash for the camera.", "Title": "Love my new tablet", "Date": "January 12, 2014"}, {"Author": "George Shupe", "ReviewID": "R1IMLX3DY3EVL4", "Overall": "5.0", "Content": "The screen is sharper then I Pad, HP, Asus and Microsoft the other tablets considered.My wife loves the s pen feature and the familiar android  programs.  I would recommend this productto anyone looking for a tablet.", "Title": "Sharper brightest screen", "Date": "January 10, 2014"}, {"Author": "Marsha Howlett", "ReviewID": "R19NZGAWPXQS1J", "Overall": "5.0", "Content": "ive been looking for a tablet for a good 2 years now, watching everyone having fun with their ipads and other devices, well boy am i glad i waited!  this whips the pants off the ipad. the ability to have up to 20 windows open makes this a real working productivity tool while everything else is just a show off toy for watching movies and playing games. to top that off, i bought this through computer deals who advertises 'refurbished' tablets for waaaay less.  i have no clue how this is refurbished because this is a brand spanking new folks, for more than half off a new price. probably someone bought this and immediately returned it because it wasnt an ipad, THEIR LOSS! if your on the fence on what to get, this is it, just read all these other reviews, watch some vids on all the many things this can do and buy with confidence!!  oh the camera alone so many options.TL:DR--such multitask! much productivity! very professional! wow!", "Title": "amazing!", "Date": "January 8, 2014"}, {"Author": "JetJock \"Gordo\"", "ReviewID": "R1VVNWOHN2MYZ1", "Overall": "5.0", "Content": "I have tried many, many tablets and this one is the best if you are looking for the 8\" range. I spent time with an iPad Mini and several other makes and the speed, battery and features are amazing. I have several co-workers that bought it as well and they all love it.", "Title": "Spectacular device!", "Date": "January 8, 2014"}, {"Author": "toms4gd", "ReviewID": "R20XQ5BEGI4Y8N", "Overall": "4.0", "Content": "Small enough that I can hold in one hand and write with other with S-pen or pop-up keyboard. Large enough to split screen between multiple spots. Love that I can write a document in one app window and look up facts/references/calendar in other window. Really useful.Very happy with the bright and colorful display and decent camera. I'm not a game player but I've been very pleased watching videos.Next project: to use with my home computer network and A/V streaming to TV via CromeCast or DLNA. One disappointment: the IR blaster and Peel remote. For me I have to be close (~6') for reliable control; and Peel setups don't handle my standard Panasonic smart Blu-ray player, and set-top box interface is clunky. Trusting that remote apps will do the job over Wi-Fi.", "Title": "everything i wanted in a Wi-Fi connected android tablet... almost", "Date": "January 7, 2014"}, {"Author": "Gregg Barr", "ReviewID": "R2WF5PBCV2ZVVN", "Overall": "5.0", "Content": "I got this for my daughter who needed a computer she could carry easily to her college classes.  She has not had any problems with it and loves it.", "Title": "Great size and price", "Date": "January 5, 2014"}, {"Author": "GLM", "ReviewID": "R1I5LXBZ6HS3", "Overall": "5.0", "Content": "SCHEDULING DEVICE.  This is my second Galaxy Note 8 device, as the first device arrived with defects and was returned.  However,I decided to give the Note 8 another chance and I'm glad I did.For several years, I've been searching for a suitable device that would enable me to plan and track various events in my life. Prior to owning the Note 8, I've tried just about every tablet available. IMHO, this is the first tablet that has really brought all the processes together on one device for me.If you're the type of person who likes to plan out (to the extent we can) every \"thing\" in your life, including Plan B & C, then the Note 8 just might be just the device for you!  Everything you'll need is on the device or available for download.Be prepared for an interesting journey of learning about the Note 8 and how you can make it work for you.The battery life, despite using all the various tricks to make it last longer, could certainly be improved by Samsung.  But I manage and so will you.Otherwise, the Note 8 is also a great web hopper, e-reader and entertainment device. I'm not a gamer (as we speak) so I can't comment regarding potential gaming ability.And lest I forget, that giant \"Hulk Hogan toothpick\" that comes with the Note 8 is a BLAST to use and play with!For the money and all the capabilities that the Note 8 comes with, I believe it's a purchase that you will not regret.UPDATE for 15 Sept 2013Unfortunately, my Galaxy Note 8 started having difficulties with extremely poor battery life, overheating and dropping WiFi signals. There were other intermittent problems as well, and these are some of the same problems I experienced with the first Galaxy Note 8.UPS is picking up the Note on Monday for return and I'm back to relying on my first gen Kindle Fire HD.  I'll take another look at the next cycle of Samsung Note products next year, I guess.", "Title": "GREAT LIFE ........Actually, Not So Much Now", "Date": "September 3, 2013"}, {"Author": "Kekaula", "ReviewID": "R10VYIXYV9G57B", "Overall": "5.0", "Content": "I had initially purchased the Galaxy Tab 2 7.0 little over a year ago and was formally introduced to the Android platform.  Six months later, I purchased the Galaxy S III and I was captivated by its potentials.  Upon reading the specs and various reviews for the Note 8.0 Wi-Fi, I was impressed.  The first notable item was replacing the 30-pin proprietary charging plug with the micro USB which effectively simplifies the process!  The second element was the dramatic improvement to the S-pen over the 10.1 which makes writing smoother and elegant.  The convenient storage and accessibility when needed in the body of the tablet enables it to be ergonomically clean.  The size of the Note 8.0 is ideal - not as \"small\" as the 7.0 or a large as 10.1.  One word can easily sum it up - mobility.  Yes, it not a direct replacement for a laptop or ultra notebook but, it certainly gets about 90 percent of my work done.  The third factor is the Smart Stay which keeps the screen on as you are looking at it.  This feature negates you from having to constantly touch the screen in order for it not to time-out as in the Tab 2 7.0.With regards to the display of the screen, it still manages to be vivid despite it not being an Amoled.  Colors appear to be true, natural and not washed out when watching movies on Netflix and Vudu.  The processor is fast as I have not experienced any lags and the transitions thus far have been flawless which also makes multi-tasking a great asset to this tablet.  The only negative comment would be the battery life.  It is anticipate that with the 4.2 update this should improve.  In all, this is a fantastic device and I would certainly give it high recommendations.  Good job Samsung!", "Title": "A workhorse!", "Date": "September 1, 2013"}, {"Author": "Lam", "ReviewID": "R2HXAG6OXCCZ3S", "Overall": "5.0", "Content": "Fast internet, easy to use, and look elegant. I use this tablet in place of notebook and to store all my books, pictures, and data.It is always with me, even at work. Best tablet in the market.", "Title": "Good tablet", "Date": "August 29, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3T2382W3WG8YE", "Overall": "5.0", "Content": "This Samsung Note 8 is simply wonderful.  The S-pen is much improved over the Note 10.1, much more smooth and accurate. Sound is great as is the video and this tablet is very fast. This tablet is very comfortable as it is a perfect fit for holding in one hand. Reading mode is excellent.  Have had this for only a short time yet still can't say enough positive things about it. Especially good with Sketchbook pro and Infinite painter. I highly recommend this Note 8.", "Title": "The BEST tablet ever!", "Date": "August 29, 2013"}, {"Author": "Giancarlo Pizzuto", "ReviewID": "R1OSXVPZTIL6MI", "Overall": "5.0", "Content": "I hear all these complaints about the resolution and what not. This tab is absolutely amazing! I work in the Pharmaceutical industry and attend many meetings. I use to have to always buy new paper notebooks from all the note taking. Now i have everything i want and need in the palm of my hands. Thank you Samsung for adding another one of your products to my collection. Thanks Amazon for always providing the best shopping experience.", "Title": "Amazing Tab", "Date": "August 21, 2013"}, {"Author": "Sakthi P. Kumarasamy \"SK\"", "ReviewID": "R2QLCDHHPSVH2S", "Overall": "5.0", "Content": "Have been looking for a tablet with hand written note taking ability. Worked with different stylus on ipad, samsung tabs, Asus tabs, nothing would work. Finally this tablet fulfilled my expectations. The note taking with S pen is very close to using a manual pen on paper. Hand writing to Text works surprisingly well. You need some time to get used to the settings and how to use it effectively.Screen is great looking better than expected for 189 ppi.OS works fine without any lags. Multi tasking ability is good.Yes it is little bit pricey, but it's worth if you are using S-Pen. You also get $25 play store credit when you register the note with samsung.The only annoyance is that the cover accessory is $50 which is a rip off, but it protects the tablet.", "Title": "A True Tablet with Note taking ability", "Date": "August 21, 2013"}, {"Author": "Joe", "ReviewID": "R134ZJG6P7CPCE", "Overall": "5.0", "Content": "Was deciding between this and the old Nexus 7. Got it because it has a larger screen, Wacom stylus, and expandable storage.", "Title": "Perfect", "Date": "August 20, 2013"}, {"Author": "Rassoul", "ReviewID": "R9WA5WBQCXXHZ", "Overall": "5.0", "Content": "I love this gadget. The smart stay does not work consistently for me, maybe because I wear glasses, but that does not  bother me. I may have to buy abnother for my wife.", "Title": "Great Product.", "Date": "August 13, 2013"}, {"Author": "Jeanette M. Johnson", "ReviewID": "R1EGIFMNR4QGRY", "Overall": "5.0", "Content": "Love the Galaxy Note 8.  It has so many capabilities.  Lightweight and so powerful.  I have had it for only a month, but am on it all the time. There is always something to do on it.  Great product and great quality.", "Title": "Neato!", "Date": "August 5, 2013"}, {"Author": "Ruben Batista", "ReviewID": "R244WNC3HPTENI", "Overall": "5.0", "Content": "Perfect and Beautiful, just what we expected, it's a samsung product that is well known for its quality, but the delivery time exceeded my expectations, 2 days after we placed the order.", "Title": "Perfect", "Date": "July 28, 2013"}, {"Author": "jjulian7", "ReviewID": "RWMEFGMP4LXBG", "Overall": "5.0", "Content": "Size, hardware, software, style!!! Just Perfect!!! I recommend 100%!! If you are a student or business employee this tablet is the best for you!", "Title": "Perfect in every aspect!!", "Date": "May 19, 2013"}, {"Author": "Lisa M", "ReviewID": "R8ZT1123WNCYN", "Overall": "5.0", "Content": "I think Justin's thread pretty much covers all the best features and answers tons of questions (what's it up to now...14 pages?!)  :)Pros:  pretty much everything.Cons: a little more than I planned on spending but...for me it was worth the expense (and the wait - I've been shopping for a tablet for at least a year).", "Title": "Perfect for my needs", "Date": "May 2, 2013"}, {"Author": "Jaype", "ReviewID": "RS0OA2U7Q5W1U", "Overall": "5.0", "Content": "I've been able to play with my new Note 8 for a day now and I must say that it's everything I was looking for. I was mainly interested in three features; size, stylus, and microsd card slot. I feel this device scored a 10 for all three. It's small enough to carry and hold comfortably, but not to the point where the screen seemed too small. I like the accuracy of writing with the stylus in most apps. I bought Lecture Notes and that is my note taking app of choice. S Note is OK but I had more issues with palm rest there. One Note is OK as well but I'd rather have the option to convert my handwriting to text when I want to, not all the time. The stylus locks in very securely, I don't have to worry about it springing out on me unexpectedly and getting lost. And I love the fact that I can change the amount of storage anytime I want. I had a spare 32 GB card that I popped in and the device found it, and the files it contained, with no problems.", "Title": "What I've been waiting for", "Date": "May 2, 2013"}, {"Author": "BM", "ReviewID": "R2RXGW94SFTFE5", "Overall": "5.0", "Content": "Pound for Pound the best mini tablet.  I don't think I need to go over all the specs since it had been well publicized on this site and many others. I did want to comment that I completely disagree with the big hoopla revolving around the price being too high at $400.00. Very disappointed in Cnet and many other sites. I can some it up with this. It includes stylus and expandable memory. How much does iPad mini cost with 64GB memory? Well over $500 but includes no stylus. Don't get me wrong, the iPad mini is sweet,  but when you try and say the Note 8 is overpriced compared to iPad, you make me scratch my head.The Note 8.0 feels good in my hand, and extremely helpful with taking notes and for reading ebooks. Looking forward to everyday discovering something new with this tablet that is limitless in it's potential. Only request would be to increase the resolution a bit.", "Title": "Pound for Pound the best mini Tablet", "Date": "May 3, 2013"}, {"Author": "WCW1", "ReviewID": "R15W4NHFGZAN0B", "Overall": "2.0", "Content": "The Note 8 is a very nice tablet. However it is not simple to setup and a big negative is that is comes with no operating manual. There are a ton of apps available. Main criticism is the amount of preinstalled bloatware that cannot be removed.Also, the 16GB model definitely needs a 32GB memory card because the tablets internal memory fills up fairly quickly.Android Version 4.2.2 will was downloaded and installed and broke several of the features.I NO longer have the Sidebar, the Multi-screen or Pencil Function.I downgrade my original 4 star review to 1 star based on this.I would not recommend this product unless it shipped with Android 4.2.2 already installed and working!11/23/13The fix after the firmware update was that you have to do a backup of your files and non factory installed apps and then do a Factory Reset. Then re-install your files. Th external SD card is not effected. Hope they are shipping by now with the 4.2.2 firmware.Upgrade to two stars because of the problematic upgrade process.", "Title": "Very Nice Tablet But Firmware upgrade Breaks it", "Date": "August 15, 2013"}, {"Author": "j2double \"j2\"", "ReviewID": "RYY3O2K1IOH86", "Overall": "5.0", "Content": "I've had it for 2 days and it just works great. I've installed a 64gib card with ease. This tablet is just damn near perfect. Its got that one size fits all factor, wether you like browsing or reading you can do it comfortably. Taking notes is just a breeze. Honestly the screen is gorgeous and its got 189ppi so between this and the nooks or ipads I'd still go.with the galaxy note because I can't differentiate between them. The note is better than the nook as it just works out of the box, you don't need to waste your time trying to put cyanogenmod, unlike the nook the galaxy has a great os, I thought I would hate touchwiz but honestly I actually like it. Sketchbook pro works amazing. I don't know what else to say, all of my humble bundle android games work. If I ever need the cameras maybe they'll come in useful but I'm glad I do have them. Battery life is something I need to come back and update but it looks ok for now. I seriously don't know how much more I can praise it, sure its 70 bucks more than the iPad and if you want the note features and the ability to draw and expand the memory id say get the note... I'm really happy with it.", "Title": "I love this tablet.", "Date": "April 16, 2013"}, {"Author": "Cabbit \"cabbitxp\"", "ReviewID": "R2G0MYWXV9WFRP", "Overall": "5.0", "Content": "...if you don't already have one.  Otherwise, it is an excellent upgrade to an older one.  From what I've used of the iPad mini, the Note 8.0 is a worthy competitor (IMHO).I won't bore you with a list of specs that you can find online with a simple search.  I'll give you what I liked and didn't like.  Everyone's experience will be different.  As always, I encourage you take a list of what you intend to use the tablet for then make a trip to your local store and testit out for yourself.These are my initial impressions:What I really like about it...-Lightweight, yet sturdy in feel.-Bright, vivid colors.  Excellent resolution.-S Pen is excellent for drawing/handwritten notes-Size is perfect for holding with one hand.-GPS-Powerful processor and plenty of memory.  Haven't had issues in video playback with a dozen apps running.-mSDHC allowing the OPTION to carry around a multitude of files and apps-Responsive touch screen.-Includes Polaris Office-S Calendar seems to work better.-My Note 2 S pen works on this as well and vice-versa.-Samsung includes a Swype like keypad.What I didn't necessarily like...-Sound is so-so, as expected from a tablet this size and this thin.-Price.  Comparable to the iPad mini in spec and price...SUMMARY:  If you're looking for a well constructed tablet that provides Play store access, a stylus for that tactile experience, excellent video and extra features such as GPS and mSDHC AND have $400 to boot, then this is your tablet.  If you already have a tablet, whether Win, Andy or iOS and are perfectly happy with it, no need to buy this one.  It's still a great tablet and you won't be disappointed.", "Title": "Excellent Tablet...", "Date": "April 16, 2013"}, {"Author": "Vicki L Thomas", "ReviewID": "R3BX7UYJ81FX8L", "Overall": "1.0", "Content": "I had the samsung galaxy note 8.0 for less than 2 months and it quite charging. I sent it to customer service for repair and had to call them (they would not return my call) and once I got throught to someone they said it was user abuse and wanted $150.00 to fix the problem.  This is insane.  I read other reviews that had the same issue with customer service.  Our house hold was a SAMSUNG home (3 flat screens, phone and the note)  will not buy another Samsung product.", "Title": "Samsung warrenty does not cover problem", "Date": "April 3, 2014"}, {"Author": "Jen's Craft Cottage", "ReviewID": "R1VCSEDN8FL6NM", "Overall": "5.0", "Content": "I'm a basic \"entertainment only\" type of user, but I absolutely love this!  Much better than my Kindle Fire HD!!", "Title": "LOVE IT!", "Date": "April 21, 2014"}, {"Author": "So Oi Man", "ReviewID": "R3LITSYIOG478M", "Overall": "3.0", "Content": "I had another 2 ipads at home, the battery life of galaxy note 8.0 is much shorter compared to apple ipads.", "Title": "Acceptable but not very impressing", "Date": "April 4, 2014"}, {"Author": "PKingDuck", "ReviewID": "R3G5QMMDSSEKC4", "Overall": "5.0", "Content": "I put an otter box on mine so it would keep up with me. The tablet is easy to use, the sd card is easy to get in and out, and I love the stylus. I've had it over a month, dropped it in water and it had no damage, thanks to OtterBox, and have used it for everything. I'll update this again later.", "Title": "Very handy and portable", "Date": "May 7, 2014"}, {"Author": "Karen L. Lynn", "ReviewID": "R2OP0YSSLI8YG2", "Overall": "5.0", "Content": "I purchased this as a gift for my daughter for a new job she is starting. The Samsung tablet has apps she can use for business, as well as pleasure which is why I purchased this product. My daughter loves it! More affordable the Apple.", "Title": "galaxy Note tablet", "Date": "May 7, 2014"}, {"Author": "Sim Nguyen", "ReviewID": "R10GVCCSRQ7TGK", "Overall": "5.0", "Content": "Love my tablet! Given the right apps and maneuver, this product along with the s pen makes my college life easier and more enjoyable.", "Title": "great for college", "Date": "May 7, 2014"}, {"Author": "kelly davis", "ReviewID": "RP5RST8PWWWEE", "Overall": "5.0", "Content": "this is the best gift ever it does everything I need it to do and more. I'm more than pleased with it and I tell all my friends that they should get one also instead of a kindle because it you love music and books like me it logical to get this devise", "Title": "best gift ever", "Date": "May 6, 2014"}, {"Author": "milt", "ReviewID": "RU8I8KNF411R7", "Overall": "5.0", "Content": "turns out the tablet itself is a dandy gadget and the s-note app is very nice. i like it better than my nex7", "Title": "i paid hundreds just for the damned s-pen", "Date": "May 5, 2014"}, {"Author": "BabyG", "ReviewID": "R1ONDUOE8VYGPR", "Overall": "4.0", "Content": "Its the perfect size to carry around. Just to slip in my bag and go! Would have given 5-stars but the battery life sucks. Have to charge almost every other day!", "Title": "Love it", "Date": "May 3, 2014"}, {"Author": "auaero89", "ReviewID": "RDKE48BXLLU62", "Overall": "5.0", "Content": "Purchased it for my husband.  He'd waited several years after I got a tablet before he even asked.  He loves it and carries it everywhere.", "Title": "He loves it", "Date": "April 28, 2014"}, {"Author": "Rach", "ReviewID": "R1RVRN94JC4JEE", "Overall": "5.0", "Content": "I love my tablet and all it's features! I would encourage anyone to buy from Amazon wharehouse at any time", "Title": "Buy from Amazon warehouse", "Date": "April 26, 2014"}, {"Author": "marie32", "ReviewID": "R2ELV4MADWHGNV", "Overall": "5.0", "Content": "I am not an apple fan and was looking for a smart tablet when I can take notes including formula (I had no luck with wired pad to my desktop for that or voice recognition software as I have an accent). Samsung made it. Got it refurbished for more than $100 below market price and do not regret it at all. Got a Samsung cell phone as well and it is very convenient when exchanging data. Will definitely recommend this over an ipad.", "Title": "Fantastic product", "Date": "December 30, 2013"}, {"Author": "Amazombie \"Chris\"", "ReviewID": "RK8D9R6A91SNF", "Overall": "5.0", "Content": "8 in tablet was the size that fit. I wanted something comparable to the nexus 7 but in an 8in. This fit the bill and I'm more than impressed. The stylus alone would be enough to make me by this again. I highly recommend it. Does what I expected and more", "Title": "Love it", "Date": "December 10, 2013"}, {"Author": "Eddie", "ReviewID": "R35IH60R7ND6SU", "Overall": "4.0", "Content": "The screen is nothing compare to the iPad mini w/ retina display but other than that, I like it.  It's small, lightweight and has all the apps I need.  I even like it better than the new Amazon Kindle HDX although the HDX has faster processor and better display but I like Samsung better overall (maybe because I'm used to Android interface).", "Title": "Great tablet for the money", "Date": "December 8, 2013"}, {"Author": "T. Winegard \"JerryandCynthia . com\"", "ReviewID": "R3LGA1S2P8IFBY", "Overall": "5.0", "Content": "The wife got to where she would not share her Google Nexus 7 tablet so I decided to get my own. We love the Nexus, but I wanted to get this Samsung model because of the pen.  The tablet is great and does far more than I know how to do yet.  The pen is great, even though I use it for simple things right now.  The Samsung apps are mostly useful, a few are of zero value to me (but may be just what you need). I tested using it to control the TV and it does that well, even though where I live we have a cable reseller and not a real cable company... thus the channels don't match.The 8 inch screen is so much better than 7 inches, and I like having enough bezel to hold the tablet without touching the screen. There more I learn about this tablet, the better I like it.  Maybe one day I will use it to its full potential.", "Title": "Fantastic Tablet!", "Date": "December 5, 2013"}, {"Author": "thetechguy", "ReviewID": "R36X7SVB0HA93J", "Overall": "5.0", "Content": "great device!! Awesome screen - very close to amoled type brightness and vivid colors like my S4.  No lag!  Had a Tab 3 7.0inch and returned it due to teh lag.  S-pen a nice feature!  Download scribmaster paint program", "Title": "great device!! Awesome screen", "Date": "December 1, 2013"}, {"Author": "ingrid", "ReviewID": "R2LSDM6MIPY2O8", "Overall": "5.0", "Content": "It's everything I wanted PLUS more!!  Fits perfect in my purse,  pictures are phenomenal.  I can go on and on.  Love this little guy!", "Title": "Best purchased ever!", "Date": "November 5, 2013"}, {"Author": "Amazon Customer \"INFJ Emily\"", "ReviewID": "R2GBJU0UOO73BA", "Overall": "5.0", "Content": "I love being able to take notes with the stylus.  I work with computers all day, so I was not sure I needed a tablet.  This feature was what prompted me to buy this tablet, and I love it.", "Title": "I love it", "Date": "October 22, 2013"}, {"Author": "Ailis Ortiz", "ReviewID": "R2Y8G30B1JBC43", "Overall": "4.0", "Content": "Shipped quickly,  arrived intact,  and was able to plug in the charger to use it immediately without having to spend hours doing an initial charge ( unlike other tablets I've encountered ).  I am ecstatic with this purchase.", "Title": "fast shipping,  immediate functionality.", "Date": "October 20, 2013"}, {"Author": "Sandy", "ReviewID": "R1324G8FUAKMA7", "Overall": "5.0", "Content": "Perfect size for a tablet..., pen a plus.  So many thingsto do with this.....still learning all of its capabilities.  One bad feature, unlike the tablet2 and 3, cannot see light on bottom to return to home or another screen.", "Title": "Perfect Size/ and With Pen Too!", "Date": "October 18, 2013"}, {"Author": "Javier Lozano", "ReviewID": "R2TXZSLGVDZ34D", "Overall": "5.0", "Content": "Excellent product, the pencil is really usefull. The shippong was very fast and safe. I recommend this product for business o for school.", "Title": "awesome", "Date": "October 12, 2013"}, {"Author": "Chad B.", "ReviewID": "R2A99UJU9SKW0W", "Overall": "5.0", "Content": "The tablet is a great size and the performance is excellent. The stylus drawing features were appealing at purchase, but don't see real use.", "Title": "Lightweight and very responsive", "Date": "October 11, 2013"}, {"Author": "j2", "ReviewID": "R3A8REHTCJNX8R", "Overall": "5.0", "Content": "I just upgraded from my Galaxy Tab 2. This is such an improvement from it. The dual processor really makes it fast. Since I've had my Note, I think I've used my laptop twice.", "Title": "Awesome", "Date": "September 27, 2013"}, {"Author": "Peter W.", "ReviewID": "R1RPBT33JIN3SY", "Overall": "5.0", "Content": "The Pros: Taking notes on this device is a dream (very precise, even for mathematicians)-The hand-writing recognition feature is pretty darn accurate-I can use Microsoft OneNote to take notes (yay!) See \"comments\" section for more info on this(page 2)-Supports a 64GB micro-SD card (search Amazon for the Samsung card)-The interface is snappy and the graphics are fluid (for the most part)-Internet browsing and switching between programs is quick and smooth-The device is easy to hold and is very lightweight-The image quality is crisp, clear and bright-Did I mention, I really love the pen and it's ability to glide across the screen effortlessly?-The infrared remote feature is pretty slick and worked with my Panasonic T.V. without issue-Comes with 50GB dropbox account (for storing and sharing files with others)-Includes a $25 Google Play credit for downloading apps-Very quick to charge (roughly 2 hours)-Plastic finish is very slick and clean - Metal bends and scratches so pick your poisonThe Cons:-The price should be lowered by about $50 in my opinion because of the weak video card (see below)-The device comes with Android 4.1.x and not 4.2.x (Samsung hasn't announced when they will release the \"much improved\" update)I ordered it here at Amazon, price is just amazing: http://amzn.to/11fxybV", "Title": "Awesome Tablet", "Date": "June 12, 2013"}, {"Author": "Live_Aloha", "ReviewID": "R3S1XGPTKH59VT", "Overall": "5.0", "Content": "I have had this tablet for a few months now and I absolutely love it! I had iPad mini before which I barely used. This one I use on daily basis. Not only it's more practical, it has more usable functions for me personally. I use it at my office meetings, seminars, I have downloaded FREE apps that I had to pay for on my iPad yet they work better on this tablet and kept crashing my ipad mini. I also use this tab for emails, browsing, note recording, watching netflix etc. It's very light. The highlight of this tab though is the S Pen which is the most awesome thing out there! I love using it and it's so practical! I love writing notes with it and using it for many other functions. Overall I am very satisfied with this tab!", "Title": "Best tablet out there!", "Date": "June 10, 2013"}, {"Author": "james cleveland", "ReviewID": "R1XP6PW6J8J858", "Overall": "5.0", "Content": "great tablet. everyday i find something new and awesome on it. So far I have no complaints either, battery life is good, easy to use, tons of uses", "Title": "Awesomeness", "Date": "June 10, 2013"}, {"Author": "R.G.S.", "ReviewID": "R9RT19TLTEYC8", "Overall": "5.0", "Content": "It's quite good actually, quite happy with this purchase also. Considering that this was delivered to Hong Kong, speed was great!http://toomuchgadgets.blogspot.hk/2013/06/samsung-galaxy-note-8-is-good.html", "Title": "My Wife Loves It!", "Date": "June 8, 2013"}, {"Author": "Dianna I.", "ReviewID": "R36O7L7I26ZLU7", "Overall": "5.0", "Content": "I bought my samsung at best buy..but did all my research on Amazon.  Let me just say, this tablet makes the ipad look like a piece of junk...for $399 you get more for what you pay for (microSD card) and more customization than the ipad mini. I love my tablet!!!!", "Title": "Amazing tablet!", "Date": "June 6, 2013"}, {"Author": "Joe Rajkowski Sr", "ReviewID": "RUJ1JS4LJXXU6", "Overall": "5.0", "Content": "In my household we have android Cell Phones an Ipad & a kindle. This blows everything away and it's because of the S pen. It's a game changer, I Use it for work as much as I use it to play. Taking notes has never been so  easy and fun.  Great product, if you purchase it you must learn all the short cuts using the s pen to make your life easier.", "Title": "Great Tablet, Game Changer, I've given the IPad Back To The wife.", "Date": "June 4, 2013"}, {"Author": "Tarl of Koroba", "ReviewID": "R2WN6L5VUKQPS", "Overall": "4.0", "Content": "So far so good with this tablet.  Performance is flawless and I have experiences no glitches of any kind.  I got the Samsung note mostly because of the note/stylus feature and also because, unlike almost every other tablet out there, it has an SD slot so you can add up to 64 GB more storage.  By comparison, the iPad mini with 64 GB of built-in storage will run you about $500 and if the note feature of the Samsung is important to you then you will be missing out on that too.  So when you compare this tablet with others, make sure you are comparing machines with the same features or the comparison will not mean much.My only regret is that I didn't just go ahead and get the 10.1 (2014 edition) version since the 8.0 can be a bit small at times.  The trade off is the fact that the 8.0 is a bit more portable and of course lighter but I think I would have rather have traded the slight loss of portability for the extra screen size.  If you are considering an 8\" tablet, give this some thought.  Its not like you can put the 8.0 in your pocket anyway so you don't lose a whole lot by stepping up to the larger size (other than the increased price, of course.)  But all in all, I'm happy with it and I plan to keep it until such time as I am ready for a new one.  At that time, I will almost certainly go with a larger size of whatever model is current at that time.", "Title": "Great tablet", "Date": "February 4, 2014"}, {"Author": "Dennis Knight", "ReviewID": "R24P3Y9IRQFW44", "Overall": "5.0", "Content": "Within my family of 5, we have an iPad, iPad mini, 2 nexus 7s, and 2 kindle fires (one is HD). When my Nexus 7 speaker stopped working, I started my research.  Here is what I found:Pros: STYLUS (never thought I would love it so much)  Fast  Great screen size (I think 8\" is the sweet spot. 10\" is too heavy and 7\" left me wanting more)  Can control my TV, cable box, etc (kind of a gimmick, but a cool gimmick)  Looks/feels well built, has a premium feel about itCons: Price. I think it is worth $279 (even though I paid way more)I really love my Samsung Galaxy phone and that is what pushed me over the edge. This is a truly great product.", "Title": "Best Tablet (and I should know)", "Date": "October 30, 2013"}, {"Author": "Francine Marshall", "ReviewID": "R1CSKWHJ3LX6A1", "Overall": "4.0", "Content": "It's wonderful, beyond a doubt ... but BUT it's a heck of a steep learning curve to understand its features and capabilities,not to even mention the kazillion applications available.VERY LITTLE IS INTUITIVE, and less than that is any \"Help\" info to be found anywhere (and I've searched aplenty) to figure out one's specific or current problem. The print-it-yourself Manual (if you can figure out where it is, or for that matter, that it even exists) does describe many features, but not sufficiently and definitely not in-depth. I say this after more than a week of experimentation; I'm just beginning to scratch the surface. Granted I've never had a cellphone or tablet or 'note' but was, for 30 years recently, a professional graphic designer using all manner of computers and complex graphic programs every day. I do intend to figure out everything, because I can already see that once I actually know what I'm doing, this little baby will be my permanent travel companion.", "Title": "Gorgeous Machine, Software Problems", "Date": "September 23, 2013"}, {"Author": "Brett W. Kelly \"In2tech\"", "ReviewID": "R3PIWLPPWH0R0E", "Overall": "5.0", "Content": "Do yourself a favor and buy one refurbished from BigOutlet for the same price as the inferior Galaxy Tab 8 inch version. Mine was fullfilled by Amazon, so I got my Prime shipping, and the peace of mind that if something went wrong I would have 30 days to return it. Mine came in pristine condition without a single mark or blemish. If i hadnt known it was a refurb i wouldnt have been able to tell it from a brand new one.The refurbished one comes with a 90 warranty, which is long enough. If an electronic item is going to fail then it will fail quickly.For those who aren't aware or just plain skeptical about buying refurbished products then keep this in mind: *Most refurbs are just store returns but companies can no longer legally sell them as new products. Not only that, they are inspected and anything that was wrong is fixed.FYI:Samsung has not officially release Android 4.2.2 for this device in the U.S., but you can do a google search and find out how to download and install it yourself from a PC.", "Title": "Love this tablet, but not at full price.", "Date": "September 19, 2013"}, {"Author": "Diana Williams", "ReviewID": "R2I1VMGYJCPORM", "Overall": "4.0", "Content": "wish it worked on my iphone and on the other galaxy stuff.  the precision writing is awesome, and great for using the little credit card apps.", "Title": "love the pen...", "Date": "July 7, 2013"}, {"Author": "Kevin M", "ReviewID": "R2GRIOMB81E9Y0", "Overall": "5.0", "Content": "I've had several different tablets - iPad 2, Kindle Fire, Nexus 7 - and this surpasses them all. Very quick, great graphics, expandable memory and great battery life. I fully expect to have this tablet for at least a couple years, which is about 4 times s long as I've had any other.", "Title": "Best tablet yet", "Date": "May 17, 2013"}, {"Author": "J.A", "ReviewID": "R1NS6G2Y95IEGC", "Overall": "5.0", "Content": "After 2 weeks of use, this is the best buy i ever had.Perfect size for use with one or both hands.The screen es really impressive, great resolution.The S-pen: simply, minimalist, excellent for draw-sketch-handwritten-and many others functions.Cons: \"the price\"...I bought it for 399$, honestly, could be very expensive but, \"comparisson with other tablets or Ipad mini\", this tablet: Galaxy note 8, for now, its the top of his class.. \"the best of the best\"buy it from Venezuela..", "Title": "Great multifunctional Tablet", "Date": "May 11, 2013"}, {"Author": "Amazon Customer \"w7hd\"", "ReviewID": "R1APPWN1D1OC0N", "Overall": "5.0", "Content": "Bought this one first and it does a yeoman job for me.  Then bought the 10.1 - which I truly love even more.  Beautiful display, good battery life.  MUCH better than the Verizon 7\" tablet.", "Title": "Note 8.0", "Date": "May 18, 2014"}, {"Author": "nascar48jj", "ReviewID": "RVKHFZI731OQN", "Overall": "5.0", "Content": "Have not had it long enough to become real good with it yet, but so far it seems like a great tablet. Everything is as good as my Ipad Air except for the Apps are not as wide of selection as with Apple.", "Title": "So far so good.", "Date": "May 10, 2014"}, {"Author": "SG \"SG\"", "ReviewID": "R1YQNLQ9RFGXX5", "Overall": "4.0", "Content": "9 months after purchase and my screen ( graphics chip ) is intermittently not working.If use for a while, several hours, note 8 gets hot in back and screen does one or all of following ( rebooting is only way to recover ):1. Goes blank / black2. Displays vertical stripes no pic3. Displays collage of pixilated colorsHAS ANYONE ELSE EXPERIENCED THIS?IF SO WHAT DID YOU DO TO RESOLVE THIS?HOW DID IT TURN OUT?I heard Samsung support is horrendous so I'm not looking forward to dealing with them.Talked with Samsung.Good news they will honor warranty and try to fix it.Bad news is they will perform factory reset which will wipe out my configuration which is extensive.While apps can be recovered on new tablet if I login with same account, the layout cannot be recovered nor the login id, password, etc for each of the apps...Bummer....Someone mentioned titanium backup should be able to clone the whole device and restore everything including layout.", "Title": "Graphics chip broken", "Date": "April 20, 2014"}, {"Author": "NM", "ReviewID": "R3Q0BEQQACTNVR", "Overall": "5.0", "Content": "This is one of the best tablets if not the best tablets out there. I still keep finding out what it is capable of. Samsung has always made strong products in my opinion, however now I believe they are looking at the number one spot above apple.", "Title": "Amazing product", "Date": "April 13, 2014"}, {"Author": "SEUNG K DONG", "ReviewID": "R76S81PEOFEYZ", "Overall": "5.0", "Content": "I used iPad 2, iPad 3, and iPad Mini, Galaxy Tab 10.1, Galaxy Tab 7\".And now that's the one of the masterpiece of Android tablet.Frankly, the contents in Android for Tablet are not attractive.But with Note 8.0, you will realize, WOW that is the tablet.", "Title": "One of the best", "Date": "April 4, 2014"}, {"Author": "Bradley", "ReviewID": "R2PA97YY1R7SK", "Overall": "5.0", "Content": "tested my tablet while i was in colorado this last week. It picked up videos and pictures, all high quality. And then went right over to taking notes and ideas while i was in seminars all day. It will be with me in ireland as well.", "Title": "awesome", "Date": "March 28, 2014"}, {"Author": "Pedro", "ReviewID": "R1D0QF0IG367CO", "Overall": "4.0", "Content": "I could use it on the sofa, in the toilet, lying on the bed, and sitting on the floor.S-Pen is pretty useful in all aspects. But I don't like its UI, neither UX.Overall, it's a great product with reasonable price at 250 bulks.", "Title": "Feel great with it", "Date": "March 25, 2014"}, {"Author": "JOE", "ReviewID": "RF3F2CHMTC169", "Overall": "5.0", "Content": "So far, so good.  I love the S-Pen.  The Note 8.0 is the perfect size.  Just purchased a 64gb MicroSD card to add more space for music and videos.  I already have the GS3, so this works perfectly for me.", "Title": "I am enjoying it greatly!", "Date": "June 18, 2013"}, {"Author": "john.l", "ReviewID": "RKC7WX78DI3SO", "Overall": "5.0", "Content": "I was extremely satisfied with this tablet and so happy to receive this as a gift.Look, feel and hardware:-Very Light-Beautiful (white)-Expandable storage is always great-Like the idea of a back-facing camera-High quality front-facing camera as well-Screen appears to be better than iPad Mini, always good-Average quality speakersSPen:WOW, what an accessory.-Pleasure to use-Light-Accurate-Full of featuresFeatures:-Always loved Samsung for their features-Smart stay-always cool-Multi-tasking was fantastic. Very compatible, always worked with no lag. Brought a Windows 7 like experience for the tablet-Comes with Polaris and SNote, two great office programsPerformance:-Gaming with no lag-Excellent speed with Youtube and Internet-Great processing with multi-tasking and other respectable featuresOverall: An amazing tablet, easily the best tablet I have ever used. Full of features, very fast and dependable. Highly recommended, especially for a tablet only $70 more than the cheapest iPad mini.", "Title": "A Truly Amazing Tablet", "Date": "June 17, 2013"}, {"Author": "Ever Garcia", "ReviewID": "R3J4NV89R2W6ED", "Overall": "5.0", "Content": "I rely heavily on tablets for everyday things, school and work and I use my note 8 a lot daily. So far I have no complains at all and this tablet has worked perfectly. It has even replaced all of my notebooks in college with the use of the s pen. I also use it as a notepad when im working and giving small presentations, in every occasion it has worked without a problem.Although the price was a little more then I expected, it makes sense since samsung is also making a new 8 inch galaxy tab that will appeal more to the persons who are looking for a cheaper tablet that could directly compete with the price of the nexus 7. The s pen will obviously make this tablet more expensive since it is a vital feature.", "Title": "The best I have owned so far", "Date": "June 7, 2013"}, {"Author": "Raphael Dantas", "ReviewID": "R2GJFMZTS6D0WQ", "Overall": "5.0", "Content": "The Tablet exceeded expectations. Already owned a Motorola XOOM and was well pleased, but with that portability is better. The quad core processor is very fast. The pen works perfectly, is very useful. The only thing that could be better is the battery, but nothing to panic either.", "Title": "The perfect Tablet.", "Date": "June 5, 2013"}, {"Author": "LEJ \"LEJ\"", "ReviewID": "R3DFMEWT982IVS", "Overall": "5.0", "Content": "Great:size yes the size is perfect for putting in your bag and taking up very little roomweight the note 8 weighs very little which makes it great for traveling and readingscreen: resolution is fantasticStorage: the ability to pop in an SD card and have more spacetask bar control just about anything without having to go through menusnotifications turn them on or off customize to your hearts desire.Features, features, features, I am still discovering featuresBuy the note 8 and Samsung will hook you up with 50gb of Dropbox for 2 years (sweet) and a $25 credit to the Google Play app storePictures I tested the camera and was pleasantly surprised to see that the colors were true to life and not overly saturated.GoodStorage: why only 16gb with a price point of $399 this should have been the 32 gb modelScreen:  over saturation of colorseye detection seems wonky sometimes it works sometimes it doesnt.SPen can be a little overly sensitiveNot so goodBattery life on my iPad I can read about 40% of a book and only drop 5% in battery on the note I can read about 10% of the book and drop about 30% yes (yes I have optimized the battery)remote control does not work, have tried everything$399 for 16gb? that is a steep price which will send quite a few people to check out the iPad mini its main competitorI am giving this a 5 star review because at the end of the day if you are looking for a great android tablet that can easily be taken with you anywhere, it is lightweight, has a great selection of apps, features and the S pen for those of us who like to scribble and draw.", "Title": "The Great, Good and not so good", "Date": "April 16, 2013"}, {"Author": "Not-taking-it-silently", "ReviewID": "R1D6FVCO5EFF3X", "Overall": "2.0", "Content": "Bought a few weeks ago -- it worked fine until Samsung updated it to 4.2.2.  Multi Window feature stopped working. This is not just my problem -- the discussion boards are seething with outrage that Samsung's advice is to use factory reset of the tablet to have this feature back (which by the way, Samsung peddles as a distinct feature of note 8). Factory reset is time consuming, poorly defined as to the results of it, and certainly requires backing everything up. Samsung is irresponsible, and so far refused to fix the problem. To verify this post just Google \"Multi Window Note 8 stopped working\". It is a disgrace of customer support.", "Title": "Poorly tested software", "Date": "December 18, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RUFHRV78AKFG6", "Overall": "5.0", "Content": "The order was processed and filled very quickly.  The unit is performing well, exceeding expectations.  The positive online comments were a good summary of the properties and usefulness of this unit.  I am very pleased with my purchase.", "Title": "First-Rate Unit!", "Date": "November 4, 2013"}, {"Author": "Erik T. Hord \"erikhord\"", "ReviewID": "R213LGE65XRYSS", "Overall": "5.0", "Content": "I've really enjoyed this tablet.  It's the perfect size, has great screen resolution and I have to say that the S-Pen really works well.  The handwriting recognition software is amazing and I've found it to be amazingly useful as a student.  I take notes right on the PDF's of slides that my prof's post online and it's a real time saver.", "Title": "Love it", "Date": "August 2, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3HJ6VQQWD80MX", "Overall": "5.0", "Content": "I just wish it was bigger but then it wouldn't be small!  The resolution is a definite must for a tablet this size - that is what sold me over the ipad mini.  Internet browsing is still a challenge but the sites I use regularly have android table apps so no biggie.  A little on the pricey side though.", "Title": "It's got everything", "Date": "May 20, 2013"}, {"Author": "dinesh r de silva", "ReviewID": "R2L1YMR3JYLF6B", "Overall": "1.0", "Content": "The second time round Im ordering electronics online. The first was defective and this had a cracked screen. The screen was covered so it wasnt visible at first. Made me wary of ordering electronic items off the web.", "Title": "not happy", "Date": "June 6, 2014"}, {"Author": "Jeffrey M. Papineau \"Tech Lover\"", "ReviewID": "R3IN4UAH8QWTG4", "Overall": "3.0", "Content": "But over time, I had some problems with my Note 8. Battery life is HORRIBLE, first of all. And a nice display but it sucks the battery dry fast I believe.And I never used it, once I got a Note 2 phone. The phablet serves my tablet needs just fine, fits in my pocket, and it's a phone too. So Note 8 just seems awkward to me now..Just sold my Note 8, and got:1) Note 2 - it does just about everything the Note 8 does, and has a phone in it, and I like the size better for having a phone and tablet together; it's a PHABLET!  FITS IN MY POCKET (big pocket)2) ASUS T100 Convertable - Quad-core Atom chip, runs full Windows 8.1, with touchscreen, and a really cool keyboard/touchpad comes off to carry a 10\" tablet. It's a computer, not a phone, and it's just a little bigger than the note, even with a keyboard. And it comes with WORD, EXCEL, etc already on it!Includes an MS OFFICE license!I'm happier now; the Note 8 was too little, too late, and I have more portability and power with my phone doubles as my tablet, and my tablet doubles as my laptop.Tablets are not productive, but windows tablets are very productive!I would say the ASUS T100 is an ipad killer, and an Android tablet killer both..", "Title": "When I first got it in 2013, I thought it was cool..", "Date": "March 14, 2014"}, {"Author": "darian fitzgerald", "ReviewID": "R129NWCDT1OH12", "Overall": "3.0", "Content": "I love that you can write on the tablrt that feature is sooo spot on with your hand writing or drawing...but I bought it so that I can add memory to it but some reason ever sd card I put into it, it ruins the sd card and I cant upload anything I just down loaded!", "Title": "it works great but...", "Date": "February 24, 2014"}, {"Author": "Livingston Guerrero", "ReviewID": "R26RKYHPIWJM1", "Overall": "5.0", "Content": "Great product. I really  like it. The galaxy tablet is amazing. Very good product. I use it every day. Thank you so much.", "Title": "Thank you so much for the galaxy tablet.", "Date": "July 11, 2013"}, {"Author": "Jerry McNutt", "ReviewID": "RITT6UN44OUV8", "Overall": "3.0", "Content": "I bought the Samsung Galaxy Note 8 tablet yesterday and have been using it a lot. So far, it does everything I need it to do. No complaints there. HOWEVER, I am FURIOUS over on thing that I can’t fathom how Samsung is getting away with…My 16 gig device only reads that it has 9.87 gigs! Not available, but total. The box says 16 gigs, the device says 9.87 of total space – I currently only have 5 gigs remaining. I spoke with two Samsung techs at Best Buy. One never got back with an answer. The second called me back and explained that the problem was the preloaded software – or bloatware. 7 gigs of crap preloaded on the device!!! And, you guessed it, these apps can NOT be deleted. How they can sell a device labeled 16 gigs and only list 9 gigs under total storage??....seems like fraud, false advertising….pick a dirty trick and insert your own. Very disappointed. They MUST release an update that allows me to remove useless garbage from my device. Is Samsung becoming like Apple and deciding what is best for me? I hope not.  Samsung, I need an update and fix soon. You know you need to do it so get busy. My device will be on its way back to the store.", "Title": "NOT 16gigs - BEWARE!!!!", "Date": "January 9, 2014"}, {"Author": "Macjones \"Macjones\"", "ReviewID": "R1IQ3OF6V7P456", "Overall": "4.0", "Content": "Like some of you ( or most) , I bought this for the pen. I had previously owned the other Galaxy notes, the 5 and 10 inch ones, but didn't really warm to them. This one is better. How much better remains to be seen, but I suggest you try it for a week yourselves , if you are on the same bent.Eventually they will get it right, if this one is the real deal for me, I will get back to you with a happy update, but frankly, I'm not very optimistic, as the category is still not mature, and and I'm getting a bit tired of failures. But like I said, this one seems better after a few days.But really, for me It boils down to comfort. Pen and paper are VERY comfy. But they said that about soft and hard pulp books a few years ago. And of course, the ebook never caught on LOLUpdate #1  I'm actually using this. It fixes some of the issues I had with the other sizes (see above). The only thing that bugs me is the very slippery writing surface, but its doable.  The built in s-pen app is fine, but I just tried Papyrus and this app seems way cool.Anyway, I will keep updating.", "Title": "Sweet spot?", "Date": "April 19, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1KGRQ2RL7JX49", "Overall": "1.0", "Content": "Could be the best Galaxy Note ever, if it only worked.Mine arrived, and the WiFi did not work \"Dead On Arrival\"Also after about an hour of use the system was hot, and the touch screen stopped working with your finger.", "Title": "DOA", "Date": "May 2, 2014"}, {"Author": "Madadh", "ReviewID": "R22T15V70W8OT1", "Overall": "1.0", "Content": "The note 8 is the most disappointing Samsung product I've purchased to date, the battery life is dismal, the most recent firmware update disabled the MHL and the stylus detection and calibration are so bad there isn't an English word to describe the level of dysfunction it creates. I'm really sorry I bought it, the Tab 2 or 3 7.0 editions are far superior as consumption devices and if you want the stylus function specifically just bite the bullet and get one of the 10.1 versions, all of which are superb, I cannot stress enough however just how angry I am at this waste of cash and think you should avoid it.", "Title": "I'm actually really disappointed.", "Date": "April 8, 2014"}, {"Author": "Benjamin Echarry", "ReviewID": "R3HRM8WZ1PSA37", "Overall": "5.0", "Content": "I'm from Venezuela and my disgusting and dictatorial government, only gives to me, and al the people with Cadivi (the organization who control the dollars in my country), 299 $ per year. Can you guys, put this thing just for one day under that price or less! Please my goodess", "Title": "I really want this thing", "Date": "March 19, 2014"}, {"Author": "Jarrod", "ReviewID": "R3OETGZFV4SCUI", "Overall": "2.0", "Content": "The tablet itself is awesome love the s-pen and all the features. The bad though we have only had it a week and the camera is failing to  open. Also it's getting really hot on half the screen and is randomly disconnecting from the Wi-Fi. Called Samsung and when we went the the steps which didn't fix it we read him the serial number and he said oh yeah you gotta send this in. Not sure if it was a bad batch of the tablets.  The Samsung customer service was good though. The bad rating is because of having to send it in for repair so soon. If it works great when we get it back then I will be satisfied.", "Title": "Must have gotten a lemon", "Date": "February 28, 2014"}, {"Author": "Sezen Bozkurt", "ReviewID": "R3ND4H9RPGMC3F", "Overall": "2.0", "Content": "I ordered two of this product from Amazon. While one of them works perfectly fine, the other one is having screen problems in cold weather", "Title": "Screen problems", "Date": "February 18, 2014"}, {"Author": "Mario D. Aguilar", "ReviewID": "R1ZJDGM70UVDK3", "Overall": "5.0", "Content": "My girlfriend looks her tablet and is constantly finding new things it can do.Wish more instruction came with it on all the features.", "Title": "So far so good.", "Date": "January 13, 2014"}, {"Author": "canol r melle", "ReviewID": "R32E1C0VWT1OS3", "Overall": "3.0", "Content": "I purchased this product as a gift for my lady friend but when she recieved the gift she never recieved it with the S pen now I'm not sure if that's a mistake or the galaxy note 8.0 does not come with the S pen ..aside from that everything was great ..plz let me know if I have to purchase the S pen seperately", "Title": "Re", "Date": "January 5, 2014"}, {"Author": "Stephen M. Maxwell", "ReviewID": "R30NCDM79O9JYD", "Overall": "4.0", "Content": "has more capabilities than i can use, blot ware is just that. ease of use has a lot to give.", "Title": "really useful", "Date": "September 18, 2013"}, {"Author": "marius covaliu", "ReviewID": "R9O9Z4RQR0J9F", "Overall": "5.0", "Content": "Great tablet. Long kating battery. The S note is really amazing. I use it mainly for reading and it's great. Recommended!", "Title": "Excellent product", "Date": "August 9, 2013"}, {"Author": "Sharon Moran", "ReviewID": "R2ZMN0S7JFJA7A", "Overall": "5.0", "Content": "Great for games music and movies.  Naught it for my 8 year old,  she lives it is fast and reliable.", "Title": "loving it!", "Date": "July 4, 2013"}, {"Author": "sarmad", "ReviewID": "RK9RVYVE5O0LY", "Overall": "5.0", "Content": "Bessssssst ever tablet man has created. Jus use it once n u can tell..samsung all day ..going ahead of apple.............", "Title": "note 8", "Date": "October 2, 2013"}, {"Author": "rglaredo", "ReviewID": "R3U6C66HBQ0MO", "Overall": "5.0", "Content": "Yes the nexus tablet is out, but this one it's a bargain. The stylus is very helphul ( in some cases)  and weights almost nothing. Good resolution to see movies. Camera pics are good outside where the sun is , inside house not so much but all the tablets suffer from that even the most expensive phones have almost no good res. pics for inside a house or low light. Got this for only 150 dlls. after best buy refunded some of my previos tablet money since there is no where more toshiba tablets to replace it. ( Buy the warranty it helps lol). Some comented that 16GB is limiting,  for what we use it is not. I think when a windows tablers take off I buy another one ..so far ..IOS and Droid are not good for what windows does, but that is my opinion..for right now this tablet is the best out there ...and does more than the ipad crap ..", "Title": "Best Droid tablet for 2013", "Date": "August 7, 2013"}, {"Author": "J. Donahue \"Avg Buyer\"", "ReviewID": "R2GCRCXOBW4KNG", "Overall": "4.0", "Content": "Was fairly easy to set up the networking etc. Have not really used it fully yet. Processing speed seems good.", "Title": "Have not really had time to figure out how to use it yet.", "Date": "June 11, 2013"}, {"Author": "Emory K. Gaskins", "ReviewID": "R1YJECYWRM7SIV", "Overall": "3.0", "Content": "I've had this tablet for a couple of months now. It's not bad but the 16GB is VERY limiting. Samsung has made sure you can't use the micro sd card to put programs on ... so 16 is it. Really dumb for Samsung.Great screen.I use it to read, surf, write. It takes good notes. But the 16GB is a real deal breaker. Probably wouldn't buy it again.", "Title": "It's just okay", "Date": "July 20, 2013"}, {"Author": "julius", "ReviewID": "RPB3CKVGPI94S", "Overall": "4.0", "Content": "it has everything i need for a tablet.  The SPen technology really is a usefool thing in taking down notes.", "Title": "almost perfect", "Date": "May 27, 2013"}, {"Author": "Business leader", "ReviewID": "R9GUMZWSR9XPV", "Overall": "2.0", "Content": "Bought for stylus use in business. Stylus app doesn't that great. Calendars do not sync. Spent over an hour with Samsung tech in person at Best Buy with no results. Multi task doesn't work. Prob will after factory reset, but don't want to factory reset. Voice app works as poorly as SIRI on Note 8 and s 4. ( using stylus on 8 now: very difficult. Constant going back. Very time consuming) Works terribe interfacing w/ FB, Amazon, anything you need to write: stylus or qwerty. Complete fail for business. Bought Tegra 4 note for son: Far superior. Doesn't glitch like Note 8. Note 8 cannot play pinball arcade, for example, due to lagging, that my S 4 has no problems with. The 2gb memory means nothing. Tegra 4 has superior processor. Makes ALL the difference. I never use any of the special features on Note 8 or S4 because they have NEVER worked for me. I would happily trade this Note 8 for a Tegra Note Any day. At least it works.", "Title": "Unhappy", "Date": "December 28, 2013"}, {"Author": "tito", "ReviewID": "RBBONXSD7XVB5", "Overall": "3.0", "Content": "Nice tablet but not perfect..Good things:Light weight .Pen is accurate .Bad things:It lacks simplicity ..Not fully customizable ..", "Title": "Nice but..", "Date": "October 25, 2013"}, {"Author": "RoB", "ReviewID": "RTB4JKM680NC8", "Overall": "1.0", "Content": "Is everything OK at the Amazon warehouse???You couldn't put my $330 tablet into a shipping box----with a handful of packing peanuts---and some tape to hold the whole thing together???The factory Samsung box was wrapped in a thin, cardboard sleeve. Anyone could have taken the factory box out and opened it---and apparently they did because the \"if this seal is broken do not accept\" sticker was sliced open. This baby is going back.Maybe you have to sign up for Amazon Prime to get a proper shipping box.", "Title": "How about a shipping box??", "Date": "February 8, 2014"}, {"Author": "MICHAEL OBAYELU", "ReviewID": "R3IBUEV82B83Z9", "Overall": "5.0", "Content": "One Word::::::::::AWESOMEDont buy one except you have class. Not for everyone. If you buy one, get a brown case with it. Recommendation....Fintie brown 360 dergree rotating. You know, too much information about good thing only make it too common. I am deleting this information. We all cant look smart....haha... Anyway, buy one if you have class with the case. If i could post the picture of mine, you might end up buying 3 but you only need one...except as gift for others...", "Title": "EXCLUSIVELY FOR MEMBERS ONLY....G14 CLASSIFIED", "Date": "February 6, 2014"}, {"Author": "Lupe H. Preciado", "ReviewID": "R20LHPARA5XSAW", "Overall": "3.0", "Content": "I bought this tablet back in August, and I will say that I am only living with it. I suggest this tablet could have been better priced for one. ($350- really?) It is made for light use and nothing particular stands out about it. You can do simple word processing, moderate web browsing even when you are right next to a wifi router, you have limited storage space, and there is a smaller selection of apps available on the Google Play store than the iTunes store. Battery life probably lasts about 2 hours maximum and I have used almost all my storage space in the tablet itself. Even the s-pen isn't that immpresable. It Is flimsy and makes a weird sound when tapping the screen. In general I recommend buyers to only pick this tablet if they are not planning on putting too much use to it.", "Title": "Could've had more.....", "Date": "January 18, 2014"}, {"Author": "Melanie Davis", "ReviewID": "RGF9FSW2U8PA0", "Overall": "3.0", "Content": "It is not working. I took it to Thailand with me and it stopped working and now I can not get it turned on. I am calling the company to make a complaint.", "Title": "Not good at all!", "Date": "December 13, 2013"}, {"Author": "Walter S. Early \"earlyfam\"", "ReviewID": "R1N5HYHSRFBW1", "Overall": "3.0", "Content": "I don't get how to use the stylus and the notepad too well. I thought it would be something easier to operate. It's a good tablet but not that much better than what's out there for the money.", "Title": "I think a lot of lower cost options are just as useful.", "Date": "October 4, 2013"}, {"Author": "Jack McNamara", "ReviewID": "R313SOD964WVBW", "Overall": "1.0", "Content": "Bought this to match my Samsung Galaxy 3. Performed erratically until it finally broke. Samsung refused to honor the warranty because they \"found liquid damage inside.\" I have NO idea what they are talking about, and I am thoroughly displeased.", "Title": "Broke within three months.", "Date": "November 8, 2013"}, {"Author": "Benjamin Hoppe \"B. Joab\"", "ReviewID": "R3L6P2YO6EPUSX", "Overall": "2.0", "Content": "I went into this tablet with the highest of hopes. I really wanted an Android tablet that could truly replace my trusty iPad.When I opened the box, the first thing I noticed was this beautiful white plastic and glass staring back at me. Looks nice. I picked it up, and it felt good in the hands, so i plugged it in and let it charge before turning it on.Once I turned it on, things became messy. I noticed an inconsistent user interface even upon startup. Some screens were obviously Samsung designed, while others were obviously designed by Google. The Samsung screens asked me to sign up for a Samsung account. I figured I better do that, I'll probably need it later. After sign up, it then prompts me oddly as to whether I want to backup and/or restore from my Samsung account. Being a brand new account, there would be nothing to restore, so I selected \"backup\". It then warned me everything on the server missing from my device would be erased if I continued. How disjointed.I was approaching the end of setup, and it now asks if I want \"easy mode\". Wait, what's easy mode? There was a oddly worded explanation that I really didn't get, so I went ahead with easy mode. I knew this would be different than my experience with the Nexus 7, since that device is a \"true Google\" device and I had heard there were some differences.As it came up to the desktop, I was impressed with the screen quality. I feel like it was definitely a little better than the iPad mini's, but maybe a little over saturated on the colors. I tried out a few of the in-device apps and felt underwhelmed so far. I bought this with a primary desire to write notes using the stylus; I found the stylus not much better than my Bamboo stylus for the iPad, although it was easier to write with. However, my hand kept hitting the back and even with the stylus in my hand, it kept bring up this menu. I found a trick online to turn the device upside down and use it that way, and that definitely made things better.I wanted to use Sketchbook Pro, so I purchased and downloaded that from the Google Play store. It worked well, but nothing tremendous. The pressure sensitivity seemed off; it was either light or dark, and there didn't seem to be a lot of pressure levels in between. Having used Bamboo and Intuos tablets before, I expected better from a Wacom digitizer.I tried out the handwriting recognition in place of the keyboard; I found that to be extremely unreliable. If I have to stop after every word to make sure it recognized it correctly, then it is useless. I will admit, my hand writing is rather atrocious, but not completely illegible. It would present words that weren't even close to what I wrote sometimes. Other times it put extra periods in.It was really cool that when I was at the home screen, it would present a notes screen when I took the stylus out if its holder. To me, that was awesome that it was designed to detect that.The voice on their Siri/Google Now replacement, S-Voice, is atrocious. It sounds like someone was running Siri down a drain and threw on the disposal unit for good measure. I would have preferred it just default to Google Now instead... but I couldn't find anything in the settings to minimize the awful Samsung supplied layers.I would say my biggest concern when buying the device also turned out to be my most obvious as I held it. It had a good weight, nice and light, but not too light. However, every time I shifted my hand a little, I heard a squeak. I couldn't figure out what it was at first, so I went into settings to figure out what was making the noise. Turns out, it was the plastic rubbing against itself at the seams. Unfortunately, this plastic device was flexing and bending and squeaking like nobodies business. I am not adverse to plastic devices, as I own a Nokia Lumia 920, but this was horrendous. The back with slight pressure would push in slightly, and just holding the device or picking it up caused the squeaking of the plastic. I felt if this was a under-$300 device, this type of build quality would be acceptable... but to charge a $70 premium over the iPad mini and to have such poor build quality to me was unacceptable.I didn't like this device, but I am certain it is a good device for some. My ideal device is a true Android Jelly Bean interface, a solid construction with no squeaking seams, a good responsive active stylus, and a consistent interface. Right now, that just isn't this device, or any Android tablet on the market right now. I really wanted an excuse to leave the iPad behind, but this wasn't it. I look forward to the device that wins me over.", "Title": "Close, But Not There", "Date": "May 3, 2013"}, {"Author": "Ms N. Boone", "ReviewID": "R1ISZWNAFKYN6C", "Overall": "4.0", "Content": "UPDATE:I own the iPad 3, the Amazon Kindle Fire HD 7\" and this tablet.  Unless streaming Prime movies on the Fire HD 7\", the Note 8 had become my \"go to\" tablet, while my poor iPad sat ignored.  I did ultimately buy a Kindle Paperwhite 2nd Gen for reading, because tablet batteries run down too fast if one is a heavy reader.  My Galaxy Note 8 is still working perfectly, it's still quite a nice tablet, and it's still the best (perhaps only) option if you desire pen functionality.Despite my abysmal Samsung customer service experiences, I actually broke down and replaced my iPhone 4 with a Galaxy Note 3, and it is amazing. As in BEST.  PHONE.  EVER. So these days I rarely use ANY of my tablets.  I use my Note 3 for pretty much everything except reading eBooks (love my Kindle Paperwhite), and of course my PC is for more intensive tasks.The pen functionality in the Note 3 is superior to the Note 8.  Assuming second generation Note 8 models incorporate that improved pen functionality/integration and offer a higher screen resolution, they could very well be the 7-8\" tablet to beat.  I personally recommend waiting for the next-gen Note 8 if you're in the market for a penabled 8\" tablet. If you also need a new phone, get a Note 3 and see if you even feel the need for a tablet at all.  That said, Amazon tablets are wonderful (especially if you are a Prime subscriber) and I frequently recommend them (Fire HD or HDX depending upon budget) to friends and family.  I also still feel that if one doesn't care too much about the pen, Amazon tablets are a much better buy.Original review:If you really want the \"penabled\" experience in an 8\" form factor, this is the only way to go - if you can get over the risk and hassle of having to deal with Samsung's incompetent customer service, their frequently buggy (and poorly maintained) web site, and the premium price charged for a content consumption device with disappointing screen quality (only 189 ppi).That said, features aside from the pen that recommend this product include:- The extra screen real estate of an 8\" screen over a 7\" screen- The ability to use Samsung's \"split screen\" Multi-view mode (only works for certain apps)- The bundled apps; some of the S-Pen apps are quite nice (I confess I rarely use them), while others are simply bloatware that permanently eat your storage space unless you root the device.- $25 Google Play credit - IF you can get them to fulfill it.  It took me months, multiple attempts to register, and finally contacting them four times via various methods.  No FaceBook to publicly call them to task, no love.- 50 GB Free Drop Box (limited duration of two years)- Micro-SD slot - although bear in mind that you won't be able to actually install most applications there unless you root your tablet (I have not).  Still, nice for music/movies/photos/eBooks.If you don't feel the pen or dual-app/split screen functionality are \"must haves,\" then honestly, save money and consider the Kindle Fire HD 7\".  It has a better screen (216 ppi), better speakers, better battery life AND it costs WAY less (plus, free eBook loans with Prime!). Amazon has always treated me well, so I have nothing but praise for their customer service.  If the Kindle Fire HD 7\" isn't pretty enough or you don't like the Amazon App store (and don't want to root), consider the iPad Mini.  Still compromising on the screen (it's even slightly worse than the Note 8 at 163 ppi - shame on Apple!), but it's also somewhat less expensive, has a beautiful, svelte aluminum body - and Apple *also* has amazing customer service.  I can't speak to the customer service, but the (sorry Amazon) Nook HD is also a nice 7\" tablet, actually has the best screen in the 7\" form factor (243 ppi), Google Play Store access (no rooting required, although it's possible if you desire), includes a micro-SD card slot, and is going for fire sale pricing.  On the minus side, the Nook HD has a proprietary charge port - but you can stock up on spare charge cables with all the money you save.If you plan to read a lot of eBooks and don't also have or want an e-ink reader, consider going for the Kindle Fire HD - or better yet the higher PPI Nook HD (you can always download the Kindle app) - your eyes will thank you for it.", "Title": "4.5 Stars for the Tablet itself, 1 Star for Samsung Support", "Date": "May 21, 2013"}, {"Author": "Lopro23 \"Lopro23\"", "ReviewID": "R1ATPX59NJL26H", "Overall": "3.0", "Content": "I had to return this tablet mainly because of the cost/benefit ratio.  Had it been $100 cheaper, I would have kept.  Operating it is no different than the Galaxy Note 2.  Almost the exact same software to the T.  The S Pen is great and the added size compared to the Note 2 is even better.  Also, the display is sharp, but by today's standard, there's room for improvement.  Another issue with the device I had was that it would disconnect and reconnect to wifi intermittently.", "Title": "Would be great if it were cheaper", "Date": "May 3, 2013"}, {"Author": "Jorge Menendez", "ReviewID": "R3BNGF0O6KZLJS", "Overall": "1.0", "Content": "Bad product, no more getting it and using the empeso tablet to fail, the touch is frozen and will not let them do anything and only works with the S-PEN, I have bloquiarla and desbloquerala as three times to get it working again, I call support samsung and tell me that products sold by amazon give no warranty that amazon sells rebuilt tablets, very bad expericia not return to buy.", "Title": "Touch is frozen!!", "Date": "February 10, 2014"}, {"Author": "Jad Hussein Hamadeh", "ReviewID": "R3M2FQ8Z4QVRK5", "Overall": "4.0", "Content": "Item as described. Protects the screen from scratches and fingerprints.easy to install and clean. Would recommend for Samsung Galaxy Note users.", "Title": "Good", "Date": "September 10, 2013"}, {"Author": "Juan C. Skewes", "ReviewID": "R312593QK3WQ1M", "Overall": "1.0", "Content": "The item arrived with a defective screen: two bright white spots impossible to miss while looking at the screen. Amazon allows no replacement for thos item while you're not in the US, Thus, stuck with an irritating piece of technology..", "Title": "Defective screen", "Date": "November 25, 2013"}, {"Author": "CCbon \"CC\"", "ReviewID": "R1M86Q89M01H5U", "Overall": "2.0", "Content": "I really wanted to like the Samsung Galaxy Note 8.0. There is such a great feel to the touchscreen and the way it allows you to move back and forth within the applications. However, as much as I wanted to like this product and learn how to work it I continue to have difficulty. I purchased it approximately two weeks ago and have worked with it for short periods everyday. The purchase was made so that I could keep it at the office and watch my favorite show on Amazon Prime during lunch break. (I can do this on my IPAD) as well as take notes during meetings.I quickly found watching my programs on Amazon Prime wasn't an option as you need Adobe Acrobat in order to watch TV, movies or video particularly from Amazon Prime (almost unlimited TV, movies with my $80/year membership). Unfortunately, this system isn't compatible with Adobe. So, I tried searching the internet for a fix and found a suggestion to download \"MX Player\"  which would supposedly give me the ability to play any video. Oops, didn't work....still can't play TV or movies unless I purchase them from Google Play. Okay, so nix that. How about I concentrate on the note taking feature with the app S Note. I figure I can still use the pad to take notes during our companies endless meetings.Well, the S Note application would be wonderful to take notes in if I could just figure out how to work its many features. The basics of writing on the pad are obvious. But, getting too much further than writing and flipping to a new page starts to get a little more complicated. So that's when I started looking, in earnest, for a user manual since my search through the internet wasn't yielding much help. Voila, I googled and found the user manual on-line by searching through Samsung's website. (It was hidden pretty deep). Once I found the on-line manual, I also realized there's a user manual on the pad itself. However, since theres no \"search\" option on the Samsung Galaxy Note I didn't actually \"find\" the user manual - I just happened up on it. Okay, so I started browsing through the user manual and found the following helps for S Note: Select a note template, Compose notes, Insert multimedia files, Using productivity tools, Browsing notes, Viewing notes. Great - but nothing on how to Save a note, Change the name of a note, Save to a particular day, event, etc. So that if I need to find my notes from a particular meeting I'm still not sure how to do this. I tried to change the name of a note and couldn't do it. Neither the on-line user manual nor the Samsung user manual helped me with this very necessary feature. While that's frustrating enough,  I'm sure there are even more features I will need help on that hasn't even occurred to me yet - and I don't have time to muddle through and find out how to use the details of this system by trial and error.There are many neat features on this pad. If you have time to play around and figure it out then go for it. If you have $400.00 to spend though, I would suggest an Ipad or Kindle Fire. Either will give you the features you find on this system plus more. As I said, I wanted to like the Samsung Galaxy 8.0, but am sorry to say I'm packing it up and shipping it back.", "Title": "Vague, incomprehensible and a sore disappointment", "Date": "August 17, 2013"}, {"Author": "Harold Shibuya", "ReviewID": "R1JKEUWPZD4POZ", "Overall": "1.0", "Content": "I received my Samsung Galaxy note 8 but there are nothing loaded? Nothing on Home Page, no apps just set up but can't get unto the web without any apps. Worked with techie for an hour but still nothing on Home page. My question is what is loaded when buying the tablet?", "Title": "Can't get to set up my tablet", "Date": "April 14, 2014"}, {"Author": "B. Brown \"The Tower\"", "ReviewID": "R1KG3H6PMHQM7L", "Overall": "3.0", "Content": "I've had the table for 12 hours now.  I like it.  I've been mainly reading on it and so far that works well.  I did watch a Netflix movie.  It started out real blurry and then came into view. The color was nice, I guess I was expecting it to be vibrant or something spectacular and it was just okay. As much as I would like to keep it, I'm returning it.  The price for one and the other reason is that I wanted something that I could use instead of having both a Kindle, Nook and a tablet.  This would have worked combining all of my needs into one.  I'm not interested in getting an iPad even though people love them. I guess I'll have to just hang on to what I have and wait for something better and a little cheaper.", "Title": "Cool Tablet", "Date": "May 27, 2013"}, {"Author": "Natalia", "ReviewID": "R3LV6H52HCHXPA", "Overall": "1.0", "Content": "the battery worked fine for the first few months, now it WILL not charge and the battery drains quickly, mostly because the thing, even when it's off WILL NOT STAY OFF.  It is a total piece of garbage and it is all I can do to restrain myself from beating it with a baseball bat.  Don't get this, it's a worthless piece of garbage.  Supposed to be helping with productivity but it is just a disgusting waste of time.  I hate it.  I mean, when it deigns to work I like it well enough but it shouldn't be this much of a goddam battle.I left for the evening with it plugged in.  It had 25% battery life when I left.  I HOPED that after three hours of charging it would condescend to give me 50% battery life, but I came home and it was 1%. AND IT WAS TURNED OFF AND PLUGGED IN THE WHOLE GODDAM TIME!!!I want to scream.  I am sooo busy and this is really the last thing I need to be wasting my time with.", "Title": "a worthless piece of garbage, DO NOT BUY", "Date": "May 15, 2014"}, {"Author": "furious", "ReviewID": "R17AD8CN69GSY2", "Overall": "2.0", "Content": "I purchase this item with the specification stating 16GB of Onboard Memory. Upon receiving this note i saw on the system manager 9.85GB Instead.", "Title": "Disapointed Customer", "Date": "January 24, 2014"}, {"Author": "Flangor", "ReviewID": "R1TEZES5ML36KK", "Overall": "3.0", "Content": "The device itself deserves at least 4 stars. It is a very solid product, fast, and has a nice screen.My problem is with Samsung. I went to register my device so that I could receive the $25 and it would not accept the serial number and MAC address. So I opened a chat with a Samsung support person and after spending 1/2 hour with them he told me it would need to be elevated. 2 days later I had not heard anything so I opened another chat and found out that the first guy had never elevated it and was never put into the system. So I finally hear back from a from someone else am still going back and forth with them with nothing being resolved. 3 weeks now and nothing has been resolved.If it is this much of a fight to get a promised $25 credit how much of a fight will it be if this product ever goes bad? I am not looking forward to it.6 June 2013:I have been extremely busy or I would have been back sooner to update my review.I finally received my 25 bucks and an apology from Samsung for all the issues concerning this, but no explanation as to the cause. Hopefully they have fixed things and no one else will have issues do a simple thing like registering their device.This tablet survived the drop test the other day as I tripped and it went flying through the air about 15 feet away. Picked it up and it is still rocking.The main reason I bought this was for taking notes, which this thing does well(much better than my previous tablet). The hand writing conversion works amazingly well considering my horrible hand writing.Battery seems to last all day even when I am using it heavily.", "Title": "I like the device, but not Samsung", "Date": "May 21, 2013"}, {"Author": "robert", "ReviewID": "R32N3PFR5HD6YZ", "Overall": "1.0", "Content": "Just got one since Costco has it on sale, used for 3 days, horrible experience, touch screen is not as smooth as ipad,  power was not lasting long at all, change languange input is way complex, you will need to go to setting, not like apple, you can do this from key board.I will return it.", "Title": "what a junk, no comparison with ipad", "Date": "September 5, 2013"}, {"Author": "SL", "ReviewID": "R1UTQGO1607JOY", "Overall": "2.0", "Content": "My Friend just showed me his Galaxy Note 8.0 tablet and it not worth the price. The screen is terrible and viewing it in angle view is also worst. Only 16GB? just be lucky it has a MicroSD but still that will not help in installing Apps on microSD which you can't. Your apps are all installed internal. I also felt little lags on switching to apps on the Note. Which is what Android are great at LAGS. Also sad part i saw was many BLOATWARE which you can't Uninstall what a total joke. I am glad I did not get the Galaxy Note tablet.I showed him Acer Iconia W3 and only cons i told him was Screen which is decent and viewing angle which is decent also told him is not really a big issue using Acer Iconia W3. I told him using acer has more better specs than your note. Acer has 65GB, HDMI, MicroSD and built in Office 2013 Home which works great. The price is not bad at all which is about $10 difference compare to the NOte $399 price tag. He loved seeing my Acer Iconia W3. His best part what he wish he had was having a full blown computer like acer iconia w3. And he was surprised that I can Uninstall my Apps or Programs anytime and NO Restriction like the Note or Androids have. Oh well i guess he stuck in a tablet reader only with Bloatware.", "Title": "This terrible Tablet and Screen also terrible", "Date": "July 9, 2013"}, {"Author": "medicdr", "ReviewID": "RAI81PSLKZDDX", "Overall": "1.0", "Content": "Do not waste your time with this product ! Save yourself the hassle and take a trip to the Mac store, costs about the same.  The screen stopped working properly less than 2 weeks after I received the item. A third of the display is obscured by flickering so the item is now pretty much useless. I tried returning it only to have UPS show up at my home address when I specifically asked to have them pickup the package where I was (at work). I had just gotten over the debacle of going to the UPS site in a rainstorm to pick up the package 2 weeks earlier, when it should have been delivered, and standing in a 2 hour line waiting for it. I'm not at all happy with this entire experience, there's a reason Apple is kicking everybody else's butt. You definitely get what you pay for !", "Title": "Piece of garbage", "Date": "June 20, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00C9V5FGC", "Features": null, "ImgURL": null, "Name": null}}