{"Reviews": [{"Title": "Not as Good as Expected. Go IPad", "Author": "Architect82", "ReviewID": "RDEC13YNTG0L", "Overall": "2.0", "Content": "Bought this for our 2 year old daughter for Christmas over much debate vs an iPad. At $160 it sounded great compared to the $500-$600 for the iPad air so we bought in.Overall the tablet seemed somewhat rugged out of the packaging but it's rubber looking housing is actually just plastic. Setup took about an hour with all of the required updates and registration. We set our parental controls which was more work to use to access the App Store then we anticipated.The free game/app included was very \"low budget\". We expected it \"the ultra\" to have a few more bells and whistles out of the box. For example, the camera quality is not great nor is the processing power as we experienced delays when using functions as simple as the art studio. Although the sensitivity of the ultra was said to be far better then the leap pad 2 when we read in reviews, it still seemed way too unresponsive to the stylus than we would want.The biggest disappointment and primary reason we returned this product was the price of games and apps. The cheapest we saw for our daughters age was a discounted bundle pack that cost $40 for 4 apps. Most apps/games were priced at $25 each for the newer ones. You buy a couple of games/apps on the ultra and before you know it you paid more for a kid only tablet than an iPad full of better 99 cent apps.  One other disappointment was the newly added wifi that constantly kept disconnecting (was not the wifi itself as all of our other household products worked).Amazon was great at taking back the returned tablet and issuing our refund extremely fast. We will now purchase an iPad for our daughter  which we can all use in our household, will purchase a durable case, a bunch of apps that will still come out cheaper in the end. Our only challenge will be monitoring constantly on the internet with an iPad as content issues may occur when she gets older. As others reviewers have said, I can easily see the leap pad ultra being another toy in the bottom of the toy box.The Ultra may be a good fit for your household but vs the iPad we feel it is apples to oranges when it comes to educating and ease of use for our daughter.", "Date": "January 3, 2014"}, {"Title": "Outstanding Product", "Author": "Claude A. Bloom", "ReviewID": "R31ETPWWSJ841X", "Overall": "5.0", "Content": "I bought four of these, one for each of my 4 grandchildren ages two to three. They absolutely loved them and their parents were impressed with the entertainment value and the almost endless educational uses.........", "Date": "January 2, 2014"}, {"Title": "Great for children in school", "Author": "Elizabeth Mavroulis", "ReviewID": "RGQ8248ATARD5", "Overall": "4.0", "Content": "I gave this to my 5 yr old grand daughter and she loved it!  She just turned 5 and will require some help, but all in all it was well worth it.", "Date": "January 1, 2014"}, {"Title": "Buy if you need a paper weight", "Author": "kevin lake", "ReviewID": "R3NDK3O6SXDM4E", "Overall": "1.0", "Content": "Purchased for my preschool age child for christmas. Wireless connection continually fails even though I have a fiber optic business level wireless network. The few times I was able to get the wireless working, the video selection is very limited and of very poor quality. Connected to my computer and continually get error messages. It is very heavy for a child. The touch screen is poor. The camera is worse than a 10 year old cell phone. It will be going back.", "Date": "December 30, 2013"}, {"Title": "Don't buy leap the leap pad ultra", "Author": "Sheri taylor", "ReviewID": "RX9MWBADI9TMX", "Overall": "1.0", "Content": "So disappointed in this leap pad it cost 150.00 it is very slow. Games cost 25.00 I bought my son a game it down loads but won't play. We tried to call teck support but they are only open Monday threw Friday. I will be returning this leap pad ultra and getting a regular tablet for my son and grandson.", "Date": "December 30, 2013"}, {"Title": "I love this!", "Author": "Nicole Burke", "ReviewID": "R1TEK71APVHMBY", "Overall": "5.0", "Content": "My sons not very interested in this yet (he's almost 3) but I love it! It's very educational and even I have fun playing with it. I got it because he loves to play with our phones and tablets. I wouldn't recommend getting it for a child under 3 though. A little tough for them to understand and use.", "Date": "December 29, 2013"}, {"Title": "Didn't work from start", "Author": "John Honeywell", "ReviewID": "RGNWO0SJ6HTB8", "Overall": "1.0", "Content": "This item didn't work from Start. I contacted the Krypt about it & they told me to do these Downloads which didn't work. They said it was the program being Vista. Well, we tried XP, WINDOWS 7, windows 8. No luck. I bought over 200 items from amazon last year (18k worth) & never been so disappointed. 1 star was for their initial contact with me. That's it! We got busy moving & didn't address this as we spent over 10 hours trying to download & 4 different computers. A-Z did nothing because through their delays of trying to download something that didn't work & us moving we went past their deadline date.  Completely dissatisfied", "Date": "December 28, 2013"}, {"Title": "you get what you pay for *fart noise*", "Author": "renee Hechimovich", "ReviewID": "REZHL0YS57ZYL", "Overall": "2.0", "Content": "The camera doesn't work and there were pictures of a baby already on the device, so it must have worked at one time.", "Date": "December 28, 2013"}, {"Title": "Slow processing speed", "Author": "Alex Gomez", "ReviewID": "RICSBMT797CZK", "Overall": "4.0", "Content": "The processing speed working from game to game and back to home screen is quite slow- may be better to by a samsung tablet for almost the same price - better app experience for 6 year olds", "Date": "November 28, 2013"}, {"Title": "Worth it, but there are some extra expenses.", "Author": "Rebel Brown", "ReviewID": "R180QD0TS168QP", "Overall": "4.0", "Content": "Got this for my 4yr old nephew. Wanted him to have something that was tough enough to stand up to him and was only his so he wouldn't have to give up the iPad anymore when someone needed to use it. I honestly haven't gotten a chance to even sit down and check out the apps on this thing because he has been playing with it that much. So he seems to love it. One caveat though. There is definitely extra costs to this thing. Since the Leapfrog app store is totally proprietary you are paying serious prices for those apps, when you first activate the device you get a one day only coupon for 30% off, bought a bundle of 10 apps for $50-ish dollars and so far that's keeping the nephew occupied, but I'm sure that at some point he will want more apps and apps cost between $7 and $25. So they are way more expensive than on the app store or Google play store. I suppose you could get the same effect on any tablet if you really configured the parental controls and carefully chose the apps, but you are paying a premium to be 100% assured that everything on here is kid friendly.So TL;DRPros:1. Easy set up.2. Completely kid friendly with no additional precautions needed. Not even a chance of downloading anything bad as the web browser runs through a leapfrog branded portal that controls all websites.3. The tablet itself is actually pretty cheap for what you are getting. A rugged, decently powerful device that is completely navigable by a child. Super easy to learn if they haven't played with a smart phone before.4. Bought him headphones for it and now he finally has an activity that he loves to do that is actually quiet.Cons:1. Not a lot included. There are maybe like 4 apps on it out of the box? One of which you have to download. So expect to drop some extra coin on other stuff.2. Literally everything except the tablet and a charger is an extra. There is a cartridge slot on the device. Seems like it wouldn't have broken the bank for them to provide at least a demo cart with some short games/stories.3. The apps are not cheap. Most are in the $15-$20 range.4. The cartridges are about the same price if not a bit more and from what I can tell, of similar length/complexity to the apps.5. Evil Space Devil packaging. I'm serious, I laughed when I read this in other reviews, but the box on this thing is ridiculous and operates counterintuitively to all previously known box logic. Their are like 23 pieces of tape on the thing that I cut and they had no effect on speeding the release of the contents of the box. The box is made by space devils.", "Date": "November 27, 2013"}, {"Title": "All around awesome Tablet for kids!", "Author": "Meghan Cooper", "ReviewID": "R33V928V7IGG6S", "Overall": "5.0", "Content": "We got the original LeapPad when it came out and my daughter loved it. So I was excited when LeapFrog sent us the Ultra to try out and review. There are tons of differences between the two models and LeapFrog really outdid itself this time. The two main things I love about the Ultra are the bigger screen and the Wifi capabilities. But there are lots of things that the Ultra has that the LeapPad and LP2 do not have it all!Some of those things are: Built in MP3 player, 800Mhtz faster processor, 8GB of on-board memory, 480p video recording, 11 apps included ($80 value), built in lithium ion battery, peer-to-peer play, wifi kid-safe web, and the 7 inch touch screen.Let's start with the Wifi with the Kid-safe web search capabilities. It's called LeapSearch and it's powered by Zui. If you aren't familiar with Zui, it's a website designed for children. A safe way to watch YouTube videos, game online video games. The internet is scary and not made for kids, so Zui makes it safe! Everything that shows up in the LeapSearch is reviewed by parents and teachers to make sure it's safe for the kids to view. I have a very curious kid so when she wants to know what a guinea pig is, she can search it and find pictures to help answer that question!I love all the apps and games available for the LeapPad systems because every one of them has an educational component to them. Plus, you can download or use the cartridges. We have the Tag and LeapReader also so reading is huge in our house. It's nice when she can do everything from reading, writing and playing right on the Ultra. Makes long road trips a breeze! Peer-to-peer playing makes it fun for siblings too. They can play games like Tic-Tac-Toe together on their own devices!I'm extremely happy about the lithium ion battery also. I went through batteries in our LeapPad like crazy. Now we can just recharge at night like we do our cell phones.We normally play on an iPad but I worry about her playing on there and the parental locks are really terrible. I'm constantly looking over her shoulder to make sure she isn't surfing the internet. I'm much happier with her using the Ultra for playing. The parent controls give me peace of mind.So my final thoughts...spring for the Ultra. The upgrades are totally worth it!Here are some free LeapFrog explorer codes for you:The Book of Super Awesome Stuff (e-book): 5813 1140 1518 1413Alphabet Stew (game): 5813 0790 4610 4973", "Date": "November 27, 2013"}, {"Title": "This is a definite winner!", "Author": "bmj", "ReviewID": "R2WYOOSD7K4NBF", "Overall": "5.0", "Content": "This is a great learning tool and our grandson who is now 4 loves it. It does much more than I ever expected.", "Date": "October 10, 2013"}, {"Title": "Great Kids Tablet to keep Tablet Content Kid Focused!", "Author": "B. Mellott \"simplybudgeted\"", "ReviewID": "RYGYFJ1PGIWD3", "Overall": "4.0", "Content": "I admit I wasn't sure what to expect with the LeapFrog LeapPad Ultra. Our kids have the Leapsters (I know they are old but buying three of everything gets expensive!) and they love the games they can play on those. They also love my iPad and have practically claimed as it their own.When we got this, I charged it up. Our four year old saw it and he wanted to play with it so I figured I would let him try it without any help. I watched him figure out to play the games without any hesitation. His only question is how to turn it on (and he still asks as the button on the side seems to confuse him.)We also have an almost six year old and seven year old. Since the four year old took the LeapFrog LeapPad Ultra so easily I thought the seven year old would find it boring but she doesn't. A device that all three of them love is a huge success for us. They have been working well on sharing it so that is an added bonus in our house.Compared to the iPad, I love that the content is all for them and I don't have to worry about getting to other apps that maybe I downloaded on my phone and went to the iPad too ... they don't need the shopping apps for sure!The four year old like the Scaredy Cat in the Spooky Woods game. Pet Pad Party is a favorite for our seven year old who is on level 5 of the game already. Our almost six year old likes the art studio and the fact that she can take pictures with the LeapPad Ultra.The pros are that all the kids love it. We are currently debating if we will get a second one to have since it is enjoyed so much at our house. I also appreciate that it has a wall charger and doesn't run on batteries or battery packs. The screen size is great and the color on the screen is bright and crisp.The only cons are the button placements for the younger age range of this product  (Our older kids don't seem to have a problem finding them.) and the quality of the camera isn't great but you can see what you taking pictures of well enough for the art projects.Note: I received this product as part of a promotional program with LeapFrog but all opinions are my own.", "Date": "November 27, 2013"}, {"Title": "LeapPad Ultra", "Author": "J. Holt", "ReviewID": "RYB0ES8I4NZ0G", "Overall": "4.0", "Content": "I have reviewed a few other Leapfrog products before. I was very impressed with those so I was excited when I was offered to review the new LeapPad Ultra.The LeapPad Ultra is a kids tablet with games, wifi, videos, ebooks, music, and access to over 800+ apps.We were sent the green one to review, they also come in pink and blue. It comes pre-loaded with 11 apps and a code for a free app of your choice. Plus if you already own a LeapPad all the games that you already bought will work on the LeapPad Ultra. So you don't need to buy a whole new library of games. Plus they are so easy to add on with the wifi.The best part to me about the tablet is it is so sturdy and almost indestructible because of the tablet frame. Kids love playing games and watching movies with adults phones and tablets but I hate handing them over because they get dropped on the floor and can get badly damaged. Also there are apps on there that I don't want them using or they can accidentally delete.The screen is bright and very big (7 inches) and the speaker is surprisingly loud for a small tablet speaker.There is the option to make up to three accounts on the tablet for your children in the Profile Manager where you fill in your child's name, grade, birthday and gender. You also can control what type of content each child can use.The only downside I found was the LeapPad Ultra turns off after not being used for about 4 minutes. This helps conserve battery life, but having to keep logging in over and over again can get a little annoying.Overall the tablet is a great tool for any child and I don't have to worry about my devices being damaged anymore.*I was provided a sample of the LeapPad Ultra through a review program. The opinions expressed are my own.", "Date": "November 27, 2013"}, {"Title": "Great Learning Tablet for Young Learners", "Author": "Happy Mom \"Rachel S\"", "ReviewID": "R2YUSR31SYHGR4", "Overall": "5.0", "Content": "I am a homeschooling mom to three little boys.  My children love playing their learning games on my phone, kindle and computer.  The thing I did not like about them having access to those devices is the unseen content they had access to on the internet (purchasing apps, linked pages, etc).I was sent the LeapFrog LeapPad Ultra to review and the boys immediately loved it.  The leappad itself doesn't come with any extra apps, games or ebooks.  That will be purchased as an extra Christmas gift.However, for a SAFE LEARNING tablet for my two younger boys (ages 5&4) this is a great way to encourage them to LEARN while still PLAYING and having FUN!The LeapFrog Ultra comes with 10 apps. When you register your device, you will be able to get an additional app for free (from a list of 3). I like that it allowed you to choose your last app based on your child's wants and needs.The tablet is super easy to set up and create a unique profile (with photo) of each individual child.The device comes with many things loaded straight from the box, so you may want to set it up before you purchase anything. Included was:10 songs (2 albums of 5)Art StudioVoice MemoPet ChatPetPhoto FunClock (which also works as an alarm clock and to teach time)Calendar (learn about dates, days, etc) You can also add birthdays and other events.CalculatorNotepadIt does NOT come with any books, so that may be something to load right away. It comes with games only if that is what you selected as your 11th app, so games may also be something you want to purchase. You save 30% for registering your device, plus LeapFrog has buy 3 get the 4th free often.The device is sturdy and seems to so far stand up to falls well. My boys has been enjoying the \"green kindle\", and hopefully will not mind now that Jack (our elf) will be bringing them SCHOOL games/apps to load on to the LeapPad! :)I received the LeapFrog Ultra for review purposes from LeapFrog and MomSelect. I was not compensated in any other way. My opinions and experiences are my own.", "Date": "November 26, 2013"}, {"Title": "LeapPad Ultra is fun for the whole family, right out of the box!", "Author": "JennWorden \"J Worden\"", "ReviewID": "R2WZONNH33KXK3", "Overall": "5.0", "Content": "We have used LeapFrog products for years, with four kids ages 15 to 3 years old, and another one the way we have used plenty of LeapFrog's products, from their LeapReader System to Scout and Violet.  Scout helped my 12 year old handicap son learn to spell his name!  We love LeapFrog's products, and was not disappointed with the LeapPad Ultra.One thing I didn’t like much about the earlier LeapPad's was connecting to the computer to download apps.  I really appreciate that LeapFrog took that into consideration - No More Connecting To The Computer!I also really appreciate the 9 hour rechargeable battery, because my son with cerebral palsy is wheelchair bound, and loves playing on the LeapPad. We recently learned about my son's love for technology, and LeapFrog products have helped him more than anything we have tried, or the teachers have done at school.  The LeapPad Ultra makes him want to try things that might be a little difficult.  He’s working on his fine motor skills, trying to do new things, and listening to everything that's said.  He doesn't focus on many things the way he has LeapFrog products, and he's amazed with the LeapPad Ultra!  He loves using the art studio app, listening to music, playing games, and just maneuvering around on the LeapPad Ultra. It's easy for him to hold, lightweight, and the touchscreen responds easily for him.My 3 year old loves the LeapPad Ultra too! She enjoys the interactive storybooks, several of the creativity apps, reading and writing apps, racing games, and jamming out to the KIDZ BOP Christmas Party Hits music app.  Watching her use the LeapPad Ultra has been great.  She knows where everything is, and has no trouble getting where she needs to.  Thankfully, there is awesome parental controls.My 7 year old also has really enjoyed the peer to peer games.  She can play with her cousin (or anyone else with a LeapPad Ultra) using LeapFrog virtual pets, and characters.  She uses the pre-loaded app, PetChat so she can text using the apps pre-selected phrases to her cousin.  They also play the Turbo Racing game against each other, since they are on the same network.  Thanks LeapFrog for the WiFi!The LeapPad Ultra is lightweight, easy to hold, has a nice design, and has an awesome 7” hi-res screen.  I have found the LeapPad Ultra to be an awesome product, and plan on purchasing another one for my two girls to share.  My son needs his own, he doesn’t want to share and since he’s wheelchair bound I would rather him play with an educational device, and he's really working hard.  Thank you LeapFrog, I wish you could see how much your products have helped, and continue to help my son!!I know the LeapPad Ultra is for kids 4-9, but I really found it to be fun for the whole family.  I even catch my 15 year old playing around on it now and again, and her and my toddler will dance to the KIDZ BOP Christmas tunes we have on it.  I have played a few games, and my husband spends time helping my 3 year old play games all the time.The LeapPad Ultra is a great device that provides kids with endless amounts of entrainment and education wrapped up in one.  LeapFrog send me a LeapPad Ultra for review, but all opinion are my own.  I really think the LeapPad Ultra is an awesome device, that offers kids endless amounts of entertainment, and it’s educational too… So the kids are learning while doing something they enjoy.  The LeapPad Ultra is fun for the whole family, right out of the box!", "Date": "November 17, 2013"}, {"Title": "Back to back lemons", "Author": "Jeff C", "ReviewID": "R17DR01P2IKYB4", "Overall": "2.0", "Content": "First LeapPad Ultra worked except for trying to use the camera, which always froze the device. The charger that came with the 1st unit was also broke, so we had to contact LeapFrog for a replacement charger (which they replaced with no issue). Ultimately sent the device back because it seemed like maybe it was a bad apple. On to our second LeapPad Ultra...less than a month of my daughter owning it and the device will not connect to the computer or read ANY of the 4 cartridges we bought for her. WASTE of $$$. This device is not worth all the time it takes to fix. Maybe 1 unit was a dub, but back to back lemons. I would not recommend this device...my daughter did like it when it was working, but that is a rarity with this product. Not sure I want to try setting up a 3rd one of these devices.", "Date": "November 17, 2013"}, {"Title": "awesome", "Author": "Amazon Customer", "ReviewID": "R32DCYJ70X53YT", "Overall": "5.0", "Content": "My daughter love her leap pad.......its easily for her to use. Im glad I bought it for her for her bday", "Date": "November 5, 2013"}, {"Title": "LeapPad Ultra - less bang for the buck", "Author": "supergrover2ptO", "ReviewID": "R1UMJ5L5ARVBLJ", "Overall": "3.0", "Content": "Bought this as a bday gift for my 5 year old daughter and she absolutely loves it.  That being said, for the price you would probably better served buying a mid level android tablet or saving up for an iPad mini.  The processor on the device is extremely slow and you have to really touch the screen for it to recognize your input.  The price of the games are much more expensive than compatible apps through Google Play or the App Store.  After a few games you would break even on the price difference between devices.  You also can't load your own mp3's to the device, you have to buy songs in their format from the leap frog store.  The screen resolution is also sub par.  But those are the expectations of a parent, not a 5 year old.  Daughter still absolutely loves the device and uses it all the time.", "Date": "March 31, 2014"}, {"Title": "worst buy", "Author": "Louise C. Nicholas \"lulu\"", "ReviewID": "R9RCU8RC9G322", "Overall": "1.0", "Content": "At first i thought it was just a glitch but it has never stopped. the screen works 30% of the times, have to constantly restart the tablet to get it to work and my two year old gets annoyed and makes my life miserable. only to realize that i only had one month after purchase to return. this is my first and last time purchasing an electrical item on Amazon, ill go to the manufactures or a department store. Now im stuck with this and i have to get another.", "Date": "March 31, 2014"}, {"Title": "Screen cracks easily and LeapFrog will NOT cover under warranty if unit is not bought directly from them!", "Author": "Luvingmom", "ReviewID": "R1ECAWTMBYJB85", "Overall": "1.0", "Content": "POOR CUSTOMER SERVICE!  CRACKED SCREEN WITHIN 2 WEEKS ~ BREAKS EASILY! Called LeapFrog, they will not cover the new screen because the cracked screen is NOT under their warranty.  They told me they would give me 50% off a NEW  LeapFrog if I buy it from them and not Amazon.  So I spent $150 on the original unit, then they want me to spend another $80 to buy a brand new one from them just a couple weeks later.  I think NOT!  Our Kindle is a way better, durable tablet that we have enjoyed for over 2 years with no problems.  We will toss the Leapfrog in the toy box ( and not pay for EVERY game, book etc ...you download )and stay with Amazon and Kindle and have many free and low cost games and educational apps to play.  What a waste of money this was, so disappointing!", "Date": "March 31, 2014"}, {"Title": "LeapPad Ultra", "Author": "SS555", "ReviewID": "RWT0YPUJQDM55", "Overall": "5.0", "Content": "Purchased for my grandson as a Christmas present. He is 3 years old and has mastered its use and loves it. A Great buy.", "Date": "March 31, 2014"}, {"Title": "Get two!", "Author": "Beardivr2002", "ReviewID": "R2WMML55ZYEJJI", "Overall": "5.0", "Content": "My kids fight over it! Consider getting two if you can. It is leaps and bounds faster than the older versions. Worth the money!", "Date": "March 30, 2014"}, {"Title": "Couldn’t be happier", "Author": "Yvonne Lindquist", "ReviewID": "RWME8NCW4N6QQ", "Overall": "5.0", "Content": "My granddaughter loves the Leap Frog LeapPad…if you love your grandchildren..this is the tool they will love you for for a long long time.", "Date": "March 30, 2014"}, {"Title": "Not what was expected", "Author": "Melanie Stintzi", "ReviewID": "R2VA2R4KVIE13F", "Overall": "1.0", "Content": "It was very disappointing.  It's very slow and there are no free apps except what is included.  New Age Marketplace would not let me return it because I had opened it.  Really!!! How are you supposed to know if something works unless you open it and try it.  I would never buy anything from them again.  This was a complete waste of money.", "Date": "March 29, 2014"}, {"Title": "Safe for Small Kids", "Author": "Melissa", "ReviewID": "R1JKZ8WDDJAUOK", "Overall": "4.0", "Content": "Good learning/gaming system for a 3 year old.  Ours likes to play with it.  Only problem is that all games, etc cost $.  No free apps.", "Date": "March 27, 2014"}, {"Title": "Nice product", "Author": "Kristi \"kristi\"", "ReviewID": "R23CGQVLZ7UKXT", "Overall": "5.0", "Content": "Bought it for a two year old so he could grow into it. While he is quite advanced and loves an iPad, he doesn't really get into the leap frog yet.  I'm sure he will when he gets older.", "Date": "March 27, 2014"}, {"Title": "LOVE THIS!", "Author": "Angel Davey", "ReviewID": "R25UZAMS4DPGH3", "Overall": "5.0", "Content": "Bought this for my nephew for Christmas (he's three), and it's been a life-saver for my sister.  He can easily entertain himself when he's in the car, without the fear that he may do more harm than good on a genuine iPad.  This is the equivalent of a kid friendly, kid resistant, extra tough, iPad for toddlers.  He loves it and is very well versed in how to utilize it.  When we looked at it a month after he got it, it was full of pictures that he had been taking! It's very kid friendly, and very easy for them to use.  The ability to add games from the LeapFrog website, as well as actual game cartridges makes it a smart purchase and very flexible.  The games vary for ages 3 and up.  You can get games to help them stay engaged and keep the education process going.  It's a worthy investment.", "Date": "March 24, 2014"}, {"Title": "Decent", "Author": "Brian Lloyd", "ReviewID": "RP60HD0U6AQDF", "Overall": "4.0", "Content": "So bought this for my 2 year old for Christmas. Lots of games to play, if you pay for them. I was unaware that the games in the Leapfrog marketplace were so expensive (10-30 bucks). that is a downer, especially when the system only comes preloaded with a few games.External speakers died on the device in Feb (2 months after purchase). Device was barely used (as there are not a ton of games available for a 2 year old), and I was shocked to see that Amazon would only return/replace the device for 30 days after purchase, whiched sucks. However, Leapfrog has a 1 year warranty, and have sent me a new one with no hassle. They actually only ask you to write on the screen of the old one and send a pic, and your new one is mailed. (great service by Leapfrog, not so much Amazon in this case)But the few games that my 2 year old can play, he loves. And the new one works great so far (after 2 weeks).", "Date": "March 10, 2014"}, {"Title": "Great tablet for kids", "Author": "Melinda B Fallon", "ReviewID": "R1EFTORS4RW6VM", "Overall": "5.0", "Content": "My daughter is 5 and is enjoying all the aspects of this tablet - drawing, reading, camera, etc.  I highly recommend it!", "Date": "March 10, 2014"}, {"Title": "Love our Leapfrog. Wonderful learning toy.", "Author": "dgh2919", "ReviewID": "R3IUOCRT46Z1KC", "Overall": "5.0", "Content": "We love our leaofrog even though we had to send it back 3 times....eek third times a charm. Still have hours of fun.", "Date": "March 9, 2014"}, {"Title": "Feezes during play...", "Author": "David Rupe", "ReviewID": "R3UBN6LBV5YBOH", "Overall": "1.0", "Content": "We have had this device since Christmas and it just doesn't work.  Our daughter stopped playing with it because it would get her mad that it would freeze up in the middle of her play.  The device doesn't respond to touch and just sits there until the game times out or you hit the home button and cancel.  Either way, you can't complete a game.  Sometimes it take two minutes, other times 10-20.We contacted support and they said delete her profile, uninstall the apps, then recreate the profile and install the apps again.  Seriously?  I don't buy these toys so I can waste time trying to get the stupid thing working.Yes, our firmware is up to date.Pros:nice screendurablegood contentCons:doesn't work!slowapps are super expensive", "Date": "March 8, 2014"}, {"Title": "worst seller", "Author": "deigojuan", "ReviewID": "R1LTJ9747GKZ9H", "Overall": "1.0", "Content": "needs proper customer service training and value customers more not recommended good at all until they get it together and know what is valuable customers or poor customer service", "Date": "March 5, 2014"}, {"Title": "learning tool", "Author": "Amazon Customer", "ReviewID": "RRJ3IG9DQSE3G", "Overall": "5.0", "Content": "We bought this for our grandson for a learning tool and he loves it and we are so glad we are able to shop amazon for his needs", "Date": "March 4, 2014"}, {"Title": "Just get a regular tablet", "Author": "Ana", "ReviewID": "R3OVIQN57LD3YO", "Overall": "1.0", "Content": "We bought an ASUS 7'' tablet running android for a little over 100 bucks.  We put a parental control app on it and downloaded a bunch of FREE educational/kid apps.  WAY better than this thing, and tons cheaper.", "Date": "March 2, 2014"}, {"Title": "Should have just gotten a regular tablet", "Author": "Amazon Customer", "ReviewID": "R3VW274PHNTHJI", "Overall": "2.0", "Content": "Our daughters (9 and 7) have regular tablets and this is for our 4 year old.  He hardly ever plays with it and currently we can't even find it.  I think we should have just payed a little more and gotten him a Kindle Fire or the like.  It doesn't come with many games though they advertise it that it comes with 11 apps.  Those include things like the camera and a drawing feature.  He likes playing the free games we have for our daughters tablets.  It's hard to get him excited about his when they're playing theirs.  The games for this are not cheap (mostly $10 each).  The first game I bought for him, it took 3 adults (2 with their Master's...though not in computers), and about an hour and a half to figure it out.  I downloaded it and it didn't come with clear instructions on how to play the game.  So, of course, my son got tired of waiting and tried to get his sister to let him play with her tablet. Considering getting rid of it....if only we could find it!", "Date": "March 2, 2014"}, {"Title": "Most wonderful Child's Gift Ever.", "Author": "ruth", "ReviewID": "RLV5L415MTZRN", "Overall": "5.0", "Content": "This is most likely the best learning tool and fun gift for any child.  It's a step below an I Pad and a gift a child will remember forever.", "Date": "March 1, 2014"}, {"Title": "Not sure about this one.", "Author": "C. Scheller", "ReviewID": "R3VY6L63C6Q6ZM", "Overall": "3.0", "Content": "I bought five of these as Christmas presents for my grandchildren. Their parents have given me mixed reviews. From we love it, they play with it all of the time, to it's really heavy and you must pay for all of the apps. The verdict is still out on this one!", "Date": "February 28, 2014"}, {"Title": "Leap Frog Pad Ultra", "Author": "farmergirl", "ReviewID": "R32NOL7XOA2I2G", "Overall": "5.0", "Content": "5 star, recommend this pad to anyone, it is a great learning tool. Couldn't find this in stores at Christmas time the pad is very well made", "Date": "February 27, 2014"}, {"Title": "Hooray!", "Author": "Spencer", "ReviewID": "R2ILVDTLQUTOF0", "Overall": "5.0", "Content": "For my daughter on her birthday! With all the technology out there, it's hard to find something so kid-friendly as this. A must have for those who like the idea of technology but hate the vapid content hidden in the machines of this Brave New World.", "Date": "February 27, 2014"}, {"Title": "My daughter loves it!", "Author": "Bertha Ahumada", "ReviewID": "R1F479G9P9NNE6", "Overall": "5.0", "Content": "She just turned 5 and she loves her new toy. She will play with it for almost a good hour. But, she wants to play with it every day. The Leap Frog did go out on us but Amazon easily took it and replace it. Fast service. Got it the next day. So, my daughter didn't skip a beat. Very happy with this purchase!", "Date": "February 27, 2014"}, {"Title": "Fun to Play", "Author": "Tabitha", "ReviewID": "R2CPO3TNBAR1AW", "Overall": "5.0", "Content": "My kid loves this thing. It has the convenience of a tablet like device that kids can use. You can put a parent lock on it to protect your child from accidentally accessing sites you don't want them viewing while wifi is in use. Anyone who has kids that they want to entertain without paying the full price of a tablet should get this.", "Date": "February 26, 2014"}, {"Title": "Great for young Kids", "Author": "Chyna Newbold", "ReviewID": "R1TRJMFBUV33XH", "Overall": "4.0", "Content": "Great for my 3 year old. Its a little slower compared to my other gadgets (phone, tablet, computer) but that's expected for a children's tablet. Overall it is good.... only reason I give it 4 stars is because it is a little slow. My son loves it.. very easy to use. Didn't come with many games to play on it from the start. Very sturdy and strong and the perfect size. I would recommend for smaller kids.", "Date": "February 25, 2014"}, {"Title": "Great for my five year old!", "Author": "jenm", "ReviewID": "RG7V5HXCME247", "Overall": "5.0", "Content": "This has been a lifesaver for our family. On long trips it makes the time pass quickly without arguments in the car. My son has a few games for this already and loves them all. He has even come to love the cooking game which teaches hand/eye coordination as well as math in the form of temperatures and such. I only have one complaint and it's minor. Sometimes it takes more than a few seconds for things to load and that seems to frustrate my son, but otherwise it has lived up to it's reputation. I would recommend this to other parents.", "Date": "February 24, 2014"}, {"Title": "Nice Product", "Author": "Roger Capps", "ReviewID": "RTO2ZAZTWEM1Z", "Overall": "4.0", "Content": "My grandchild loves this product and I do too.  I have my Nook back and she has her own tablet.  Easy to learn and getting children ready for the advanced tablets.", "Date": "February 22, 2014"}, {"Title": "Great", "Author": "Jonathan Johnson II", "ReviewID": "R1SXFHW0F26X6N", "Overall": "5.0", "Content": "Loves this thing easy access for the internet games and all other amenities she never puts it down recomended excellent", "Date": "February 22, 2014"}, {"Title": "Leap Pad", "Author": "Deberra Daun Jones", "ReviewID": "R1UYFPEEYN0XM0", "Overall": "5.0", "Content": "Just what my granddaughter wanted! Absolutely loved it and I recommend getting the gel protective case as well. Very happy", "Date": "February 21, 2014"}, {"Title": "Great learning tablet", "Author": "Darcy Esworthy", "ReviewID": "R13OU8E29N3VSB", "Overall": "5.0", "Content": "Easy to use, kid friendly, awesome apps, fun and educational ...just wish I could afford 3 more to share with all the grand kids!", "Date": "February 21, 2014"}, {"Title": "Great buy", "Author": "Katie Lethcoe", "ReviewID": "R2NZIIW0S06YKL", "Overall": "5.0", "Content": "It's very durable and we love how it grows with our daughter as she learns skills. However the games it comes with are not actually games she will use other than the art app.", "Date": "February 8, 2014"}, {"Title": "Fantastic toy", "Author": "Samantha Keen \"Scowt23\"", "ReviewID": "R1RTDS5MN6P0PO", "Overall": "5.0", "Content": "This is a great buy for kids.  It is a better version of the LeapPad 1 which we also have.  It is a little trickier for our youngest (2) to manage to use, as I think its geared for a little bit older kids.  I love that you can download apps or still use the game cartridges.  It also seems sturdier than previous models, and I love that you don't have to use batteries on it.  You just plug it in and charge it like other electronics these days.  Highly recommend this item.", "Date": "February 7, 2014"}, {"Title": "leap pad ultra", "Author": "colendia", "ReviewID": "R9YM0RQP1H3X3", "Overall": "4.0", "Content": "I want to be able to give a five star for this product , but I can't get the five year old to play with it . I bought this for my grand son for Christmas It has been turned on one time . I don't no about other kid's but mine just doesn't care for it. I bought the leap pad princess for my four year old grand daughter and she loves it . I will update if there is change in my grand son wanting to play with this  tablet  I hope so or its just a waste of money for myself.  Ok up date my grand son finally gave it another try, he loves it he can't put it down. Now I can give a five star.", "Date": "February 4, 2014"}, {"Title": "Turned out to be a great gift for my son", "Author": "Dev", "ReviewID": "R33SN95UP2ZUDF", "Overall": "5.0", "Content": "My son is 2 1/2 and we got this for him for Christmas. He absolutely loves it. We take it everywhere when we go out. It has a lot of great learning apps.", "Date": "February 4, 2014"}, {"Title": "My 4 year old likes it", "Author": "happy1", "ReviewID": "R28DIKY7XYCR1F", "Overall": "4.0", "Content": "It's kind of slow when looking for things in the store and downloading but other than that its great. I also ordered the green gel skin and love it.", "Date": "February 4, 2014"}, {"Title": "Love it!", "Author": "Angel Gongora", "ReviewID": "R33PQ9LHBWKNFZ", "Overall": "5.0", "Content": "Santa delivered this to our house for Christmas for our daughter. She LOVES it!!  She uses it everyday. Only complaint is that sometimes it takes awhile to boot up but all in all serves its purpose for our three year old princess.  :)", "Date": "February 4, 2014"}, {"Title": "so awesome!", "Author": "TamaraRenae", "ReviewID": "RF5M3XNWJZKDN", "Overall": "5.0", "Content": "I have been a fan of LeapPads since the first generation tablet. My girls have loved them since they were toddlers. These new utlra tablets are too cool! I was nervous about jumpingin and spending the extra money on these, but it was completely worth it.Highlights:-rechargable batteries built in with power adapter included-larger screen-damage resistant/kid proof (they are pretty heavy though)-Wifi - parental controls allow parents to deciede if kids should be on Wifi or not. You can download apps right from the tablet to the tablet....no connecting the home computer anymore! Kids can safely browse through internet categories and watch videos (so many cool videos for them to learn from)-comes with some great apps-tons of storage!I know some parents who say their kids did not like the previous generation tablets or lost interest. I think the key is updating the apps every so often. We download a new app before a vacation or for long car rides and they have never lost interest, but I suppose it depends on the kid too!", "Date": "February 3, 2014"}, {"Title": "Leap Pad Ultra", "Author": "Jojo", "ReviewID": "R1P20SBBOEY5B4", "Overall": "5.0", "Content": "Great gadget!  Lots of fun, safe things to do! It's a great feeling knowing I don't have to worry what she is playing or watching.", "Date": "February 3, 2014"}, {"Title": "My Grandson Loves it!!!!!", "Author": "Dee Berringer", "ReviewID": "R15Y0SHHF4BPDG", "Overall": "5.0", "Content": "I bought this for my 5 year old grandson.  He hasn't put it down since it arrived.  Now he doesn't have to ask his sisters permission to use theirs.  He loves it!!!!!", "Date": "February 1, 2014"}, {"Title": "Great Design but Slow and lacking Apps", "Author": "B. Roy", "ReviewID": "R20LNA7VN6RHK7", "Overall": "2.0", "Content": "There are two things this tablet is lacking, Speed and Apps.First the Pros: It's well built, the interface is easy to use and intuitive. I like the Video search feature geared just for kids, unlike youtube which who knows what your child might watch. The screen is bright and clear, battery life is fantastic, and I like how it shutsdown on its own if its not used.Cons: Slow Slow Slow, Boy is this thing slow! It crawls at a snails pace at anything you do. Sometimes I have to press multiple times just to get it to register. You would think that they could at least make it a little bit faster considering how much you pay for it. The Apps Store just plain SUCKS! There are no free apps, and the cheapest apps cost about $5 which doesn't get you much. We have an iPad and my child still insists on using it over the Leappad. Please LEAPFROG, if your apps are junk at least give us access to more free ones.If I had to make the decision again I would have purchased something else. It's too bad because I really like the design, but it does no good if your child can't enjoy playing their favorite games.", "Date": "January 31, 2014"}, {"Title": "Awesome", "Author": "Brittany", "ReviewID": "R2UHUY4SGR03SZ", "Overall": "5.0", "Content": "This is a great toy/learning device. We have had this for 2 months and my 5 year old loves it. There are so many great games that you can download for it and being able to connect via Wifi is even better. This is our first Leap Pad of any kind but we are definitely satisfied.", "Date": "January 31, 2014"}, {"Title": "LeapFrog LeapPad Ultra", "Author": "Libby", "ReviewID": "RIWYHHYMJFSH9", "Overall": "5.0", "Content": "This was a gift to my daughter and she absolutely loves this.  She is playing with it all the time.  She loves the math and the science programs that came with the leapfrog ultra.", "Date": "January 30, 2014"}, {"Title": "Disappointed", "Author": "araceli reyes", "ReviewID": "R1NDB5JI2CJSBV", "Overall": "2.0", "Content": "My grandson was looking forward to upgrading from the leappad 2 to the ultra.  He is five and gets frustrated because this tablet freezes up. Didn't have any issues with the leappad 2.", "Date": "January 28, 2014"}, {"Title": "Great learning tool!", "Author": "Hpyshpr", "ReviewID": "R58A50AGBETVX", "Overall": "4.0", "Content": "My 1 and 2 year olds received the Leappad Ultra as gifts.  I was hesitant to let them use the tablets at first because I thought they were too young and because I had to purchase the learning games (I was used to FREE apps on the IPad), and my kids were used to using the Ipad.  Lo and behold, after I showed them how to navigate the Leappad they quickly caught on.  Now they both are virtual experts.  They even use the stylus.  The only things I think improvement are the download speed and the cost of the apps (they do go on sale, but I think they should be cheaper) I do not buy cartridges.  They get lost too easily.  Once you download an app it's impossible to lose it.", "Date": "January 28, 2014"}, {"Title": "LeapPad Ultra", "Author": "debbie z", "ReviewID": "RUW2K1OKK5ERM", "Overall": "5.0", "Content": "This was the best Christmas gift of all time for my grand daughter, she loves it!  Makes learning fun and exciting. She would play on it for hours, if we would let her!  I recommend this for all kids!", "Date": "January 28, 2014"}, {"Title": "Good but could be better", "Author": "JBMom", "ReviewID": "R2L0X6PQ0MC82U", "Overall": "4.0", "Content": "I bought this for my 5 year old son. Unfortunately he was already used to playing on my ipad. He likes to play on his new LeapPad too, but it is not the same. One problem is that it is really slow loading when you first turn it on, or try to start something new. I thought that the internet capabilities would be good, but it is so restricted that I really don't see the point other than to use it to purchase new LeapPad games from their website. The cartridges have been good and bad, some don't keep his attention at all, but there are others that he really likes. They can be very pricy though which is a down side.", "Date": "January 27, 2014"}, {"Title": "Will be good in the future", "Author": "Christopher Butler", "ReviewID": "R34IMO7KUUOST8", "Overall": "5.0", "Content": "I bought it for my 2 year old and it is a bit advanced.  Need to think about having more options open for young kids.", "Date": "January 27, 2014"}, {"Title": "Perfect", "Author": "Stefanie L. Walton", "ReviewID": "R3BPTUSIN023O0", "Overall": "5.0", "Content": "We bought this for our granddaughter for Christmas this year.  She loves this LeapPad so much, she never leaves home without it.  She calls it her ipad.  Well worth the money.  It keeps her very entertained and the apps are very interactive and educational.", "Date": "January 27, 2014"}, {"Title": "LeapFrog LeapPad Ultra", "Author": "Newyorkgal \"ms.vee\"", "ReviewID": "R3SGNU7TKV8WCS", "Overall": "4.0", "Content": "Purchased this item since my son is obsessed with our I Pad. We are responsible parents so we limit the time he can play on any electronic device. I believe, as long as they are playing educational games, this pad will help a child learn. He can watch videos and  we don't need to worry where he ends up (youtube video brought me here anyone!). He likes the Peg plus cat and jake applications. would recommend these since they teach math.About the seller, the delivery was fast but a note of caution. We purchased this pad for Christmas and was wrapped under the tree for quite some time; when we finally open it, I realized that the box has been opened and carefully resealed. The seller did not advertised this as an open box item. I was able to register the product with no problem and decided to keep it since item seems fine. I don't feel that is ok for a seller to sell previously open boxes without notifying the customer. I would carefully inspect any electronic box I purchase from amazon in the future.", "Date": "January 26, 2014"}, {"Title": "Only works sometimes and freezes.", "Author": "tarataffy", "ReviewID": "R14E5JMCL61DRI", "Overall": "3.0", "Content": "Was looking for a tablet for my 5 year old and thought i found it with this but I was wrong. She got it on christmas day and that is when it started freezing up. We tried playing one of the story games and it just kept freezing. So bad that i had to turn it off and then turn it back on. And that has been the case with every game we have tried..We will keep trying but I think this is gonna end up at the bottom of the toy box cause my daughter and I are frustrated cause it doesnt work properly. Save your money and get a kindle...she loves mine and it always works!", "Date": "January 26, 2014"}, {"Title": "Glitchy, strange behavior from this thing", "Author": "Martha G. Jordan", "ReviewID": "R13PQJRAKIRK8N", "Overall": "2.0", "Content": "I got the Ultra for my 5 year old and the Leap Pad 2 for my 3 year old for Christmas. So far the 2 operates a lot more smoothly than the Ultra. We keep having weird issues with the Ultra, for one, my son scrambled up the letters in his name at the top of the screen (which the voice prompts him to make changes to every time he's on the home screen, would be helpful if that guy would go away!!) and whenever I try to fix it it says something to the effect of \"that name is already in use, please try another\". What?? I just want to correct the spelling of his account name and it won't let me. Then, last night, EVERYTHING on the device disappeared from his home screen. I went on to the parental settings and saw in the content manager that it was re-downloading everything on it for some reason. I let it do it's thing for a while and it looked like it was working fine, everything started slowly showing up again. Then this morning he goes to use it and only about half of his things are there. Just his games and art studio. His pet pad is gone, all the \"in-device\", pre loaded things are gone (like notepad, calculator, etc) and everything that is still there has a generic name given to it. What the hell happened?? I want to smash it, seriously. The Pet Pad was one of his favorite things on there.We've also had issues with the touch screen either not responding at all or being WAY over sensitive. Not to mention how long it takes certain things to load. Maybe I just got a defective one but the whole thing has been a giant frustration from the start. The LeapPad 2 has been much better.", "Date": "January 16, 2014"}, {"Title": "My 4 year old LOVES this tablet!", "Author": "nikki rassler", "ReviewID": "R2FZX9AAX8GY7J", "Overall": "5.0", "Content": "Hours of play time on it! Easy for him to operate, great sound, graphics, quality. The app center would be my only complaint, it runs slow, not sure if its the app center itself or our internet connection? Has tons of games and books and activities, just be sure to budget for them, they can get pricey! Makes it nice when LeapFrog offers deals (like buy one get one % off) every so often.", "Date": "January 15, 2014"}, {"Title": "Lag time and resistive touch screen hurt...", "Author": "J. Ford", "ReviewID": "RLDNE9K89RDM1", "Overall": "3.0", "Content": "My cheap $70 smart phone (no contract price) has a faster processor than this machine as well as a capacitive touch screen.  Not sure why this couldn't have been built the same way for the price I paid.  While it is very child friendly and the WiFi, dual cameras, etc are nice touches, it is frustrating to use after being used to current tablets and phones...even the cheap ones.  My twin four year old boys' brains move way faster than this can keep up.  Might have been better to have gotten some Kindle Fires and used parental controls.  Perhaps they didn't want kids using a device with a glass screen as needed for capacitive touch, but what can explain the dragging processor speeds?  Though it is solidly built and seems made to take a beating, I can't say I'm as pleased as many of the other reviewers seem to be.", "Date": "January 15, 2014"}, {"Title": "Ultra Leap Frog", "Author": "Sharon", "ReviewID": "R3C1DO7ZE8JIJN", "Overall": "4.0", "Content": "The girls love their games and can be used for many more years to come. They make a great gift.", "Date": "January 15, 2014"}, {"Title": "I should have bought a Kindle instead...", "Author": "Knight Lord \"KL\"", "ReviewID": "RM2OBHUGH1QUV", "Overall": "3.0", "Content": "I bought this tablet as a Christmas gift for my 3 year old (actually almost 4) and a Kindle for my 5 year old. Yes, she definitely liked it. No doubt about it. But as I was afraid she loved her sister's Kindle...OK, let's see... The LeapPad is louder than the Kindle. Oh, it's also more colorful than the Kindle. It's more \"educational\" than the Kindle. Well, I can keep going but I think you got the picture.Now, a few weeks after seeing the kids engaging with both devices I just want to share my thoughts with other parents and how I feel about my decision. And basically all I have to say I think this thing has more cons than pros. For instance:- The apps are ridiculously expensive. LeapFrog does promotions all the time but still the apps are very expensive. There's no such thing as a single digit app. Everything is expensive. I bought 3 Disney games averaging $20/each.- The device is slow. Period. Kids have even less patience than adults. And everything here takes a while to load. If you get too anxious and keep clicking and touching it just make things worse. It kinda hangs or slows down even more.- This thing is heavy. I thought my iPad 3 was heavy. This is heavier. Hello!?!??! This is for kids!!!! It's heavier than all previous LeapFrog products we owned (Leapster, Leapster 2, etc).To summarize, it's OK. I really like LeapFrog products, I think they have a lot of value in terms of education. But I think this device could be a lot better than it actually is.My suggestion? Go to a B&M; store and have your kid play with it if possible... And then do the same - play with it for a few minutes. In my opinion a Kindle HD 7 inch is a much better deal and it gives you a decent mix of games and educational stuff and I wish I had bought 2 of them instead. I hope LeapFrog start making more apps for IOS and start doing Android devices as well. I would rather buy their apps for other platforms than for their own... Unfortunately...Well, these are my two cents... Good luck!", "Date": "January 14, 2014"}, {"Title": "My 3 year old is obsessed with this thing", "Author": "Sara M. Scholz \"S. M. Scholz\"", "ReviewID": "R2WBB6MHTSV4N5", "Overall": "5.0", "Content": "Got this for Christmas for my 3 year old (will be 3 1/2 in April.)  He is officially obsessed! I mean to the point where he carries this thing everywhere and I have actually started rationing his time with it.  It is the perfect leap pad for a toddler.  Super super easy to figure out.  I charged it and set everything up before Christmas for him and it only took me like 10 minutes to completely set up for him and his little brother.  They each have profiles set up and the parent view is easy to access as well to make purchases and tweak different settings.  I thought it would be painfully slow to do anything since it is a kid's tablet.  But to my surprise it wasn't. He never gets frustrated when switching to another app and it really didn't take too long to download games from the app store either.  I just went to the parent view, unlocked, shopped for games, downloaded and put the tablet up for 1/2 hr or so while sit downloaded and came back and everything was done.  This is a sturdy tablet.  It has been dropped, stepped on, juice spilled on it, it's still going.  I like that it has a \"pen\" that is attached to it with a special slot for it so he can draw and manipulate the screen.  There are tons of songs and videos he can watch and what's best is they are all positive and educational.  Not like on youtube where everything has to be screened.  He played with my kindle fire all of the time before and now has forgotten all about it.  He loves his little tablet.  As for the pictures-- are they the highest quality?  No.  But they're good enough for him.  Sometimes come out grainy but often times the pictures look pretty good.  It comes with a few apps that you choose and then you have to buy more.  My only gripe is apps are expensive for this.  As in like $20 each.  But they are more involved then some silly app I get on my phone for free to keep him entertained for all of 10 minutes.  He could play with this for hours if I let him.  I'm very pleased with the purchase and would recommend to anyone with kids aged 18 months up to kindergarten age at least.", "Date": "January 14, 2014"}, {"Title": "Birthday wish.", "Author": "borbala p nerren", "ReviewID": "R200E2JM1DBE0U", "Overall": "2.0", "Content": "I wished we hadn't bought it because you can hardly find any games for it and she hardly plays with it anymore.", "Date": "January 14, 2014"}, {"Title": "love it", "Author": "Pennie D. Weiss", "ReviewID": "RXZL7022II7S", "Overall": "5.0", "Content": "My grandson is always on it. Mom likes that it has the parental controls for limiting time spent on it", "Date": "January 14, 2014"}, {"Title": "Love this~!", "Author": "Amanda Crumrine", "ReviewID": "R31YTYL7XCQQQH", "Overall": "5.0", "Content": "W had a purple leappad ultra for my daughter, she got it for her birthday.  our son loved playing hers, and wanted one of his own.  he is 2 1/2 and he loves it!There was a coupon on the package to save $$ off of a game cartridge I was excited to have it, until i read the coupon, and it said at the time of hardware purchase. :(", "Date": "January 14, 2014"}, {"Title": "THE BUNDLE...", "Author": "Sym", "ReviewID": "RNU9VAES4KYCI", "Overall": "3.0", "Content": "I only bought this particular item because it was an offer Amazon was having where you could get this, a case, headphones, and a car charger all for $120 altogether. So I thought why not, my sons birthday was around the corner and Christmas at the time...well so far we 'enjoy' it. It is slow and lagging all the time...I refuse to buy more apps because the price of them is way to high. I wish I would have bought some kiddie games on my kindle fire because this thing was NOT worth over the $100 I spent. Save yourself the trouble and buy a kindle or an Ipad-they have a child lock feature on them and the games are WAY cheaper.", "Date": "January 13, 2014"}, {"Title": "Gotta have it", "Author": "alaskan17", "ReviewID": "RV4GBTNIP8RNF", "Overall": "5.0", "Content": "Couldn't be happier with this. Lots if great features & a great way for our son to learn. We are finding out that he learns & processes by computer much better.", "Date": "January 11, 2014"}, {"Title": "great product", "Author": "dorothy taylor", "ReviewID": "R3IF2N9DR9BVPW", "Overall": "5.0", "Content": "grand son loved it.. best item I bought. could see improvement in letter knowing and numbers. he enjoyed playing with it.", "Date": "January 11, 2014"}, {"Title": "Great lots of fun", "Author": "michael bordonaro", "ReviewID": "R2N33OJV58ZPKU", "Overall": "5.0", "Content": "It is nice my three year old loves it. The only thing that does not work real good is the wifi it keeps going on and off and the signal is week but still a good product!", "Date": "January 11, 2014"}, {"Title": "Slow", "Author": "Sam", "ReviewID": "R13L50TFZV07NI", "Overall": "2.0", "Content": "this product is really slow, the video app closed frequently inspite of having the latest firmware. Even the full screen for video wasn't working... I think the product needs some more testing...as many folks have pointed out..apps are  very expensive. You can get similar or better products at much lower price.. overall buying a regular tablet with parental control is a better option.. returned it, may be consider newer model next year..", "Date": "January 10, 2014"}, {"Title": "Leapfrog leappad ultra kids learning tablet", "Author": "Patricia Tomberlin-Hightower", "ReviewID": "R3K8TAG8TO6RS9", "Overall": "5.0", "Content": "As long as my grandson likes it I am happy with the product. He wants more games and educational information", "Date": "January 10, 2014"}, {"Title": "Runs soooo slow", "Author": "DoubleA", "ReviewID": "R3NKDHYCPZIQGU", "Overall": "2.0", "Content": "My son had the leap 2 and loved it but broke it. So I was excited to get this for him but it runs so slow and is very frustrating.", "Date": "January 10, 2014"}, {"Title": "LeapFrog", "Author": "Jake", "ReviewID": "R8ZWMT8ELI14F", "Overall": "4.0", "Content": "I thought it was a slow on the processor. A lot of potential power. My daughter loves it! What is the point of the wifi?", "Date": "January 10, 2014"}, {"Title": "NOT WORTH THE MONEY!", "Author": "Rachel Busetti", "ReviewID": "R3GUB1TBMUVXRA", "Overall": "1.0", "Content": "We bought this for my toddler for Christmas.  She already loved and used our Ipad and we thought this would be a great kid version for her to safely play around on.  The OS is SOOO slow that it lost her interest before games and apps even loaded.  Games are ridiculously expensive (20-25$) and honestly not very fun.  It came loaded with some apps that she wasn't interested in anyways.  The camera was slow and had some features that I couldn't even figure out or enjoy.  I returned it the following day and will save the money to buy my daughter an Ipad Mini which I know I will be satisfied with.", "Date": "January 9, 2014"}, {"Title": "Unable to ever get the device started.", "Author": "Aaron", "ReviewID": "R32EQG4DIVM0P4", "Overall": "1.0", "Content": "We bought this device for our daughter for Christmas.  After approx. 6 hours of time spent trying to register this device we never even got the device to complete the process.  I placed 3 phone calls to customer support.  They want to email you instructions on how to fix the problem but do not want to help you through the process.  On my third phone call, I insisted that the representative stay on the phone until the problem was resolved.  After over an hour on the phone we hadn't made any progress.  I am not convinced that the technical support representatives are even familiar with the device.  I will be returning this device and purchasing a tablet that my daughter can play on.", "Date": "January 9, 2014"}, {"Title": "Tablet", "Author": "Tom Ash", "ReviewID": "R3N2Z5V9JF6IVS", "Overall": "5.0", "Content": "This seems to be a wonderful way for kids to become oriented with the electronic media.Well worth the price we paid.Excellant response time from order to arrival.", "Date": "January 9, 2014"}, {"Title": "leapPad", "Author": "Cathy Barnes", "ReviewID": "REPNV1AGJIU85", "Overall": "4.0", "Content": "My granddaughter really likes it because it has great games and apps. She likes the pink and white color and it is durable.", "Date": "January 9, 2014"}, {"Title": "Excellent Product", "Author": "Gemma Howell", "ReviewID": "RW9N98EX75I4P", "Overall": "5.0", "Content": "Excellent product for children, would recommend to anybody to buy it. It really teaches my son a lot and keeps him out of trouble. Love it.", "Date": "January 9, 2014"}, {"Title": "Super Educative & Very Informative", "Author": "Mohamed I.", "ReviewID": "R2BD73KMDSOVFA", "Overall": "5.0", "Content": "Perfect gift for your kids. Super Educative & Very Informative tablet. Variety of games that teach kids many many things,", "Date": "January 8, 2014"}, {"Title": "Good product but could work a bit faster", "Author": "B. Brown", "ReviewID": "R3N6EUAECQBFQK", "Overall": "4.0", "Content": "Love the fact that the pad can withstand an on-the-go 4 year old! She loves playing on it and has figured out how to use many of the special functions.  I only have two complaints: it takes a while to turn on and/or load the page when you press an app, and it takes forever to download and install apps from the website.  In an era where much of our technology is fast, the LeapPad's processor seems exceptionally slow.  Kids who play on iPads, like mine, are used to the technology responding fairly quickly. Hopefully, LeapFrog will correct the issue and the next version will have a faster response time.", "Date": "January 8, 2014"}, {"Title": "Son preferred IPad", "Author": "Liz", "ReviewID": "RLID95GJI24VC", "Overall": "2.0", "Content": "It worked well, but my son preferred my iPad. It's easier to use and I can load his favorite movies. Apps are very pricey, he loves the free ones on the IPad and I can buy full versions for half the cost. Searching the web is very limited on the leap pad. You pretty much can only search through their database of videos. I sent it back, looking into the iPad mini...", "Date": "January 8, 2014"}, {"Title": "I'm a little disapointed with the price.", "Author": "Ana Cerghizan", "ReviewID": "R11AM7PQBA6VMG", "Overall": "3.0", "Content": "It already has tons of glitches. Screen static and running really slow (even when connected to wifi). It's very durable as I purchased it for my two year old who is advanced for her age (the system is recommended for 4 and older, and unless child is advanced I don't recommend it for younger than 4) and she has dropped it a few times. I don't like the weight of it, far heavier than the leappad 2. My daughter however really enjoys the system. I don't let her use it a lot, and I play with her. She maybe plays a total of 2-3 hours a week on it and I use it mainly as an educational tool for her. With the amount we use it I almost never have to charge it, so that is a bonus.", "Date": "January 7, 2014"}, {"Title": "Great Gift", "Author": "Bev Blackburn \"Bev Blackburn\"", "ReviewID": "RGULI6G7J5ZJN", "Overall": "5.0", "Content": "Purchased the Leap Pad Ultra for my 7 year old grand daughter.  She's loving it.  I feel it's safe for her rather than a computer at this age.", "Date": "January 7, 2014"}, {"Title": "Educational", "Author": "GeeGee", "ReviewID": "R27K1YGGQWJPMI", "Overall": "5.0", "Content": "I rated the LeapPad a 5 star due to it being educational. It is a good learning tablet. I bought it for a child who loves playing on the tablet and learning at the same time.", "Date": "January 7, 2014"}, {"Title": "I Leap for LeapPad Ultra!!", "Author": "Lesli Zavala", "ReviewID": "R3R26QMPDGRZL8", "Overall": "5.0", "Content": "Oh I just wanted to say thank you guy made my little brother's chrismas very happy and filled with glee. He just couldn't wait to play with it, right now I have download 3 games forhim it was very easy to set up the tablet and can access the app store buying him games, books, music from his favorite shows and characters only does he hage fun but keeps on learning. I loved that he can't access my account on app store so that way he won't accidentally purchases apps and over charge my card  just like he did on my dad's smart phone. He loves it so much he just doesn't want to give it up with its time to sleep.", "Date": "January 6, 2014"}, {"Title": "son enjoys on board games", "Author": "lynnielu", "ReviewID": "R9ILI5GXUQNG5", "Overall": "5.0", "Content": "he enjoys so much he hasn't even loaded up his cartridges today just got today.the screen is bigger than the leappad 2", "Date": "January 6, 2014"}, {"Title": "Great for kids", "Author": "Ken A McCall", "ReviewID": "RXZ83OOYLDBSZ", "Overall": "5.0", "Content": "Gave this to my 4 year grand daughter and it was a hit.  She is already singing the ABCs and loving the apps.  Charge is lasting for at 5 hours with lots of use in the first day we just charge it at night and its ready for another day.  The screen is really nice size and appears to be durable as the 4 year old is not so gentle on the screen.", "Date": "January 2, 2014"}, {"Title": "Leap pad Ultra", "Author": "IMG_7481.jpeg", "ReviewID": "R3JJMO1E16JLR1", "Overall": "5.0", "Content": "Purchased for my niece and 2 nephews for Christmas13. My niece had the original leap pad and loved it.They all three love the new ultra leap pad", "Date": "January 2, 2014"}, {"Title": "My kiddo loves it!", "Author": "Esther Swartz", "ReviewID": "R2LSGOSDMO9WWN", "Overall": "4.0", "Content": "My son and I really like the tablet a lot. There are many things that he can do on his own and he is learning a lot. He received the LP Ultra for Christmas and navigates around like a pro. It is easy to use, yet durable and parent friendly as well.The only negative thing I have to say is that the downloadable apps are fairly expensive to me, thus the reason for the 4 star rating. The cheapest app I've found whether it is a game, book, music, ect is $5 and go up as high as $25 for just one download. Leap Frog does offer discount codes when you are purchasing an app which is helpful, but you have to buy more than one at a time to qualify for the discount. They also offer bundles, which does save some money, but you have to be prepared to spend anywhere from $40-$120 per those bundles.", "Date": "January 2, 2014"}, {"Title": "Perfect for our 5 year old", "Author": "Cindy Bradford", "ReviewID": "R3Q2OFPISJFKDP", "Overall": "5.0", "Content": "I wanted to provide our 5 year old granddaughter a machine that was a little more advanced and was able to have internet wifi.  This machine ended up being perfect for her.  She already figured out so many things and it is light weight and sturdy.  We also ordered the gel skin, so I feel it is safe and secure.  It came with several apps so that she was able to start playing as soon as she opened it.  Love it!!!!", "Date": "January 2, 2014"}, {"Title": "Granddaughters", "Author": "Lynn Conklin", "ReviewID": "R1G7ZBVCUULYZ1", "Overall": "5.0", "Content": "My granddaughters could not wait to started with this as soon s they opened it on Christmas morning and it was in there hands for the rest of the day.", "Date": "January 2, 2014"}, {"Title": "Not happy at all", "Author": "ray", "ReviewID": "R33ZLGM3UXOZ5Z", "Overall": "1.0", "Content": "Bought this product for christmas and have yet to use it, because it's stuck on a screen and will not reset my son was very disappointed and so was I ¡!", "Date": "January 1, 2014"}, {"Title": "it was certainly a merry christmas", "Author": "M. Heinz", "ReviewID": "R2Y7ACQW3EN3FK", "Overall": "5.0", "Content": "I bought this for my grandson.  He just turned 4.  He loves it and is able to navigate through it by himself.  It was expensive for a Christmas present, but it was a great value for this type of product.  When my kids were small I bought the Texas Instruments Speak & Spell and Speak and Read.  They were a great learning tool.  The LeapPad is the 2014 version of those learning toys.", "Date": "January 1, 2014"}, {"Title": "My grandson loves this", "Author": "Therese E Miller", "ReviewID": "R2O7DZGZB3QRDQ", "Overall": "5.0", "Content": "I bought this as a holiday gift for my 3 year old grandson.  He really loves having his own tablet.  The best thing about this is: as he grows there are a variety of games/ activities that are available for his age/ learning group.  I love the idea that this gift can last a long time.  The art app is really fun.  I couldn't stop playing with it!", "Date": "January 1, 2014"}, {"Title": "Slow, slower and slowest!", "Author": "K. Abood", "ReviewID": "R1OG7GAI1FXALB", "Overall": "1.0", "Content": "This product is extremely frustrating.  For the price we pay for it, it shouldn't be this slow.  I wish I would have known.  Research other tablets for your kids - this will not be the right one for you. :(", "Date": "January 1, 2014"}, {"Title": "For the money", "Author": "Amazon Customer", "ReviewID": "R29URS75QCAP89", "Overall": "3.0", "Content": "Daughter (3.5 yo) loves the LeapPad Ultra. A little large for her but she handles it well, and beginning to read, the pictures are intuitive and informative with simple words. I am a little disappointed that for the cost that so few math and reading apps were included in the initial purchase. At five dollars an ebook and $25 for the software packages that she wants (and I feel that she needs to fully utilize the pad), I believe that there may be other good pads with options priced more competitively. Not yet convinced of its value.", "Date": "January 1, 2014"}, {"Title": "LeapFrog Tablet", "Author": "CAH", "ReviewID": "RPRPFMYZ4AKA6", "Overall": "5.0", "Content": "Bought for my two grandsons, 4 and 3 years of age.  They opened them up and put their little head phones on and sat and played for hours.  It was very easy to set up and the boys are really enjoying them.  It was the best buy I made for gifts this year.  Mom is happy because the tablets will grow with them as they mature.", "Date": "December 31, 2013"}, {"Title": "Great learning pad.", "Author": "#1GaGa", "ReviewID": "R1AC0DUMJ2UKD4", "Overall": "5.0", "Content": "My Grandson is Autistic and absolutely loves his new Leap Pad. It's the perfect size and has many learning tools for him to use and enjoy.", "Date": "December 31, 2013"}, {"Title": "The kids love it!!", "Author": "Karen Watts", "ReviewID": "RWDAAN6U748GD", "Overall": "4.0", "Content": "Love this tablet though the initial app downloads took hours to complete. The kids love this tablet. It is very nice.", "Date": "December 31, 2013"}, {"Title": "LeapPad Ultra NO GOOD", "Author": "bianca", "ReviewID": "R2KUAVJ5DMQXGN", "Overall": "1.0", "Content": "My baby girl loves playing with my husbands ipad and is constantly intrigued about songs, games, zoo animals etc.. apps available that we have downloaded for free from apple.  Long story short we felt necessary to buy a tablet for her that she could continue learning and having fun with as well as be able to kick around drop and put her sticky Little fingers all over.  The Leappad is great for young kids that will only stick to leap pad apps and for parents that want to continue buying games and learning apps that cost anywhere from 5-45 dollars in most cases the best apps seem to be 25 dollars. You ncant even get into u-tube or put music on it that we have already downloaded from amazon (baby lullaby) The 5 dollar apps were very few and nothing interesting for my daughter.  I was also discourage because there where no baby sign language apps or zoo animal apps to download.  We returned it and will invest in a tablet for her that we can download videos from u-tube that are free.  On an occasion we will pay for an app but the most i would want to pay is 10 dollars but average no more then 5 dollars.  The other advice i can give buy a cheaper tablet like the Nabi JR and buy the protected case for it.", "Date": "December 30, 2013"}, {"Title": "Eleven apps", "Author": "Jan queenan", "ReviewID": "R20RZBDZOAR3RC", "Overall": "3.0", "Content": "Should let one or two apps be a pick by buyer. Otherwise child seems to love it. Think the games /apps are good", "Date": "December 30, 2013"}, {"Title": "Not worth the $", "Author": "Sarah J. Carlin \"blinkclear\"", "ReviewID": "R1QF6RI8V94HE9", "Overall": "2.0", "Content": "I was sorely disappointed in this product.  The preloaded apps aren't terribly fun for kids.  Why do they need a voice memo app?  And the camera isn't very fun either.  The two apps we played were the MyPets app, but it has limited functionality, and the Art Studio app which is fun to draw and color.  The touch screen seemed to have issues as I had to press over and over again several times.  I went to the app store to buy more apps and found the prices to be $10-25.  And a lot of them were just episodes of TV shows.  I am returning this and buying a Kindle Fire for my daughter.  She can get tons of free apps and it has parental locks.  Plus, with Prime I can get tons of TV shows for free.", "Date": "December 26, 2013"}, {"Title": "Great product", "Author": "B. Bartlett", "ReviewID": "R4YDMLK8TA302", "Overall": "5.0", "Content": "Of course it's difficult to pick the right toys for your kids, they tend to defy logic with some of the things they like and dislike. This was an expensive purchase for us, so we were hopeful it fell into the category of items that were 'liked'. And it certainly did!LeapFrog has always had some of the most creative learning toys, this really is the family favorite. It's easy to use, sturdy, highly educational and just plain fun. The content is original with great imagination put behind it.I read through some early customer issues, I can say that without a doubt we have had zero issues and we've tested it in every way. I have a feeling this tablet will be highly used for a long, long time.", "Date": "December 26, 2013"}, {"Title": "Oh man it's SLOW!!!!", "Author": "sonbossie", "ReviewID": "R1Z49XU477EUGL", "Overall": "1.0", "Content": "It is so extremely slow and it takes forever to upload apps, go between home and games.  I am returning it today after trying my best to love it for 2 days!  I will rather spend $150 more and get ipad mini!!!", "Date": "December 26, 2013"}, {"Title": "Fabulous tool for kiddo", "Author": "Rebekah E. Taylor \"BEX\"", "ReviewID": "R2BZU923SUTRJ5", "Overall": "5.0", "Content": "My son enjoys this loads.was and is a great gift for learning. I would recommend this for any child for a learning tool. Many different games that can work on any particular skill needing to be polished.", "Date": "December 26, 2013"}, {"Title": "Good learning pad", "Author": "Danja F.", "ReviewID": "R17LJ3D4Q8S11G", "Overall": "5.0", "Content": "Our 5-year-old's LeapPad tablet quit working after about 2 1/2 years (It was very durable - its time was just over, I guess) and we replaced it with the Ultra. It looks very nice and is helping our son learn to navigate around computers. All the great learning games/videos are still there. If you have an older version that you can hook up you can transfer all your purchases to the new one. Wifi was easy to set up and parental locks seem solid, we're all very happy with it.", "Date": "December 25, 2013"}, {"Title": "Happy", "Author": "Christopher Flavien", "ReviewID": "R3QKB0R6QQJPRJ", "Overall": "4.0", "Content": "I bought this for my 4 year old son as a Christmas gift and I couldn't be happier. He loves it so much that he would not even put it down. Would not let it out of his sight not even to charge it.", "Date": "December 25, 2013"}, {"Title": "Received for Christmas", "Author": "Kathy L. Buttermore \"bcarr519\"", "ReviewID": "R308DQJQ3Q6QO6", "Overall": "4.0", "Content": "My 5 year old received this for Christmas from his grandparents. In general I think it's a pretty good pad for younger kids.Pros: very easy for my son to use, very easy for me and my husband to figure out, wifi works great, very easy for parents to purchase and install games, allows parents to use a password so child cannot buy games on their own, allows you to buy games online or in cartridges, apps are educational and make my son think a little bit, stylus is attached to the pad and tucks into the side so it can't be lost.Cons: some apps are expensive ($25, typically these tend to be the name brand - Disney, Nickelodeon), camera is awful (son has no complaints, though), games/apps don't seem to download when another app is opened.All in all I think it's a good product for younger kids. If my son was 8 or older I would probably have preferred an iPad. I also think this product will prove to be more durable than the iPad, which is great since kids tend to be destructive. I have had no issues with this product as of now and getting it up and running was very easy (aside from the in-laws' internet router kicking out all the time!). I recommend buying the hard case for it, which holds 6 cartridges and another stylus. It does come with a gel case, but I don't think I would want to travel anywhere without the hard case.", "Date": "December 25, 2013"}, {"Title": "My kids love it!", "Author": "sherry", "ReviewID": "R1U0WA88YVMG78", "Overall": "4.0", "Content": "We have always enjoyed Leapfrog products. Almost all of the toys my kids have are from leap frog. My daughter likes her Ultra. She enjoys the games we installed. Unfortunately, when we got the product, the right side seems a bit loose compared to the left side. When you try to hold it, it pushes down. But other than that, everything is great.The games are quite expensive too, considering I could buy cheaper ones at istore that are more interactive, but then again they can learn at the same time so it's still worth the money. Overall, I say this is a great purchase!", "Date": "September 20, 2013"}, {"Title": "Excellent upgrade from previous LeapPad", "Author": "J. Burg", "ReviewID": "R3AN3XFVPJI51U", "Overall": "5.0", "Content": "I purchased an original LeapPad Explorer for my daughter when it first came out, and the tablet is still working great. The LeapPad Ultra is a significant upgrade in every aspect, and if you’ve already got an assortment of LeapPad cartridges, it makes the debate of upgrading even easier. (BTW - my child is 5.)Here’s whats new and improved.-The screen on the LeapPad Ultra is now 7” vs 5” with a higher resolution too ( 1024x600 vs 480x272). It is also brighter, has better color, and the touchscreen is more responsive too.-The processor has been upgraded to 800 MHz processor vs 500 MHz and you can definitely notice the difference, although the load time on startup and some apps still is longer than I would like.-The storage has been upgraded to 8 GB vs 4 GB, always a good thing.-The camera is now 2 megapixel vs 1.2 megapixel, but the quality is still just “ok” for a kids tablet.-The LeapPad Ultra has a built in rechargeable battery rated at 9 hours of use which is so much better than having to replace AA batteries.-The LeapPad Ultra also features a special kid-safe Wi-Fi which can be used to download new apps and games and also “surf” certain LeapPad-approved content. Definitely one of my favorite new features since I no longer have to plug the LeapPad into my computer to download content.One thing that has stayed consistent is LeapFrog’s build quality. Our LeapPad has taken a lot of tumbles and still works as good as it did when we got it. The LeapPad Ultra is definitely larger and heavier due to the larger screen and built-in battery, but still feels just as durable.It would be great if LeapPad offered some free content to better compete with the Android and Apple app stores, as the prices of the LeapPad apps and games is a lot more than their competition.Overall the LeapPad Ultra is a great upgrade with the larger screen, rechargeable battery (LOVE THIS), and built-in Wi-Fi sure to make any kid happy.* I was provided a sample of the LeapPad Ultra through a review program. The opinions expressed are my own.", "Date": "November 27, 2013"}, {"Title": "Winner with the kids at my house!", "Author": "Stefanie Cornwall", "ReviewID": "R12JZRSH3S50UF", "Overall": "5.0", "Content": "So far I have been very impressed with the LeapPad Ultra. This is the first Leap Frog tablet we have ever owned so as a newbie the tablet was easy to set up. I got my kids profiles all set up and made and immediately blocked them from having the ability to purchase apps in the app store. This was a key feature for me and something I LOVE! No accidental purchases at our house! Speaking of the app store - the apps are crazy expensive, so that is a little bit of an issue. They will make good rewards or goals for my kids, we won't be just buying them freely since they cost so much. BUT I do love that the apps have age recommendations with them so I know which ones are appropriate for each of my kids. BONUS if you search on the internet you can find 2 free app codes, which is super nice!I love that there is a stylus attached to the LeapPad, although it was obviously built for a right handed person. My children are right handed so they don't find it awkward to use, but as a left handed person I find it a tad awkward to use the stylus because of tugging at the cord.I love the 7 inch screen. It is a nice size. The body of the tablet also seems nice and sturdy and while I won't go dropping it on purpose, it seems it would be able to stand up to the wear and tear the kids will put on it.I LOVE the front and rear cameras. Although the picture quality isn't anything fantastic, it is meant for children and good enough. My kids love the preloaded photo fun app to play with the pictures they take of each other.I love that although it is connected to my home WiFi it is kid safe. I love having them be able to freely play without worrying about what they may stumble onto.Overall this is a winner! The kids love it and I love it too. I play with it every so often because it is lots of fun!I was provided a sample of the LeapPad Ultra through a review program. All opinions are my own.", "Date": "November 26, 2013"}, {"Title": "Awesome Tablet for Kids!!", "Author": "Paul Gomez", "ReviewID": "R3LO2GINPP1TWT", "Overall": "5.0", "Content": "My 5 year old daughter loves this product!! There are many fabulous features on this product that both my daughter and I appreciate. First off, it was super easy to set up everything.  Once we connected to Wi-Fi, it only took about 5 minutes.  At 7 inches, the screen is a nice size and provides a clear picture. She loves using the camera and included apps, especially the Pet Pad Party.  She is even learning to tell time from the clock app. One of the best features is the attached stylus. What a brilliant idea, now the kids wont lose it anymore!Also, love the web feature...she likes to watch kids shows and music on youtube but as you can imagine I am always concerned it could jump to other content.  The fact that she can browse the web herself and see videos and such on the LeapPad gives her a sense of independence, while I don't have to worry about her seeing any inapproprate content.Another great feature is that you dont need batteries and can just use the included charger.  With other kids electronics, I felt I was always changing the batteries, so this is definitely a nice change! And when fully charged the battery lasts a long time!The only downside is that the apps are expensive....they range from $5 to $25, so while my daughter used to ask to buy a few apps at a time on our ipad (usually free or $1.99) I had to explain to her she couldn't add apps as often to the LeapPad.Overall, its an awesome product for kids!!I was provided a sample of the LeapPad Ultra through a review program. The opinions expressed are 100% my own.", "Date": "November 26, 2013"}, {"Title": "Kindle Fire verses LeapFrop = Kindle Won", "Author": "Tina", "ReviewID": "R2QO8WJUV9EC6G", "Overall": "1.0", "Content": "I purchased a Kindle Fire a couple of years ago, fell in love with it and moved up to the HD last year. My 5 yr old granddaughter has, of course, been using my fire and loves it also.  My husband and I thought we would buy her a kid based pad this year, something we didn't have to fight over etc :-)  She said she wanted a LeapFrog, because one of her friends had one, so that's what SANTA got for her. There are a lot of things I could say about it, slow, apps cost toooo much etc etc. but the bottom line for me is, if you want a pad with free games, apps, learning tools, internet, camera...the Kindle Fire beat this hands down, straight up-no chaser. PERIOD. I am sending back to purchase her a Kindle Fire, only logical solution right!", "Date": "January 23, 2014"}, {"Title": "Lousy Customer Service and Unreliable Product", "Author": "Monica Lynch", "ReviewID": "R1CVTPNJ1Q4X2D", "Overall": "1.0", "Content": "We bought the LeapPad Ultra for our daughter for Christmas. It shut off and did not turn on again later that day. In full disclosure-I believe it had been dropped at some point BUT it was working after that, AND if a product designed for 5 year olds can't handle that then, well.....Contacted LP and they said to pack it up and return it for testing. We did so. We packed everything up in the original packaging and including the email regarding the incident and the fact that at one point it turned back on again only to turn itself off. I call last week to check on the status and they said they would get back to me. I received an email saying it had been tested (not fixed) and was working fine. Came home Friday evening to a box from UPS, all that was inside was the LP itself wrapped in bubble wrap, no USB cable, or charger, NOTHING. I finally realize I can charge it with our LP2 cable and do so. Works fine for awhile then keeps shutting itself off. Saturday morning, fully charged, it turns off again and doesn't turn back on. Of course I tried contacting LF on why they had sent it back without anything, but had to send an email ( which actually has yet to be responded to ) because customer service closes at 3PM Friday-Monday. We just want a product that works. So I call Monday. AND today. All they can tell me is that it worked when they tested it and if a product works they won't replace it. So we need to send it back AGAIN?! Problem is, it doesn't work, I keep getting the run around and no one can tell me WHY it was sent back they way it was. I tried explaining to the various representatives that I just want a new one, that I don't trust them to \"fix\" after the last time AND the way it was sent back. My poor daughter has been without her big gift from Santa :( I would actually return the damn thing if I could. This doesn't seem like a company that respects the customer or stands by their product.", "Date": "January 22, 2014"}, {"Title": "Waste of Time and Money", "Author": "Tamara Ramsundar \"trinicat\"", "ReviewID": "R1CU4MNCMX33TS", "Overall": "1.0", "Content": "I am very disappointed with this LeapPad Ultra, as a matter of fact, I got upset when my wife bought this for my daughter. It is very limited as to what your child can do. We should have bought a regular tablet. The 11 stupid apps you get with this device, trust me, your child will get bored with it. Where the hell are free apps. We get a few stupid free apps when we purchased this device and my daughter who is 4 barely pics up the device. We are seeing a whole lot of sports videos...and adult crap when we go to view videos etc....what the hell is a 4 year old from the caribbean doing watching ice freaking hockey etc... She is into her Kids Videos and watching her disney shows. I wish i can just throw this out. How the hell do you get LP$ to purchase apps. Every tablet maker has free apps at their app store except you all. Full of crap! This device is useless.", "Date": "January 20, 2014"}, {"Title": "We love Leappad Ultra!", "Author": "momofthree", "ReviewID": "R3NZDKPJJBG62R", "Overall": "5.0", "Content": "Our big kids (6, 3) each received one as a Christmas gift this past year in anticipation for a long trip.  What a life saver!  Kept them preoccupied for most of the drive to and from, and restaurant outings were a breeze.  Highly recommend headphones for car trips so parents can have peace while kids play on.Our oldest had the original Leappad which she could never play because our younger child would literally beat her up to get his hands on it.  So it is great that each has their own now.  The larger display and faster processor is very nice.  Love it that it connects wirelessly for updates because connecting via USB was cumbersome.  Bright idea to tether the stylus to the device.  Kids love the front and rear camera.  They enjoy playing tic tac toe together wirelessly.  But for me, the best is that it now has a built in lithium battery.  I despised having to charge, replace, and recharge those rechargeable batteries!  Yay, so happy that is a thing of the past!!We considered getting them iPad mini's, but we would be so upset if they broke them!  The Leappad is a durable kid tablet.  Also, its nice that they can't visit any old website.  A few months ago I noticed pop up advertisements for American Horror Story coming up as my three year old watched Lightening McQueen videos on Youtube on our iPad.  Needless to say, I was mortified!  Additionally, as nice as it is that there are so many free games out there for the iPad, kids get so confused and frustrated at the locked features/areas that can only be unlocked by purchasing or the pop up ads for other recommended games.  We ended up with loads of useless games the kids accidentally installed and charges for accidentally purchased games when we forgot to lockdown our iPad.I absolutely love the content Leappad develops.  The kids love the recognizable characters the games are based on.  Best of all, they really learn stuff and they think learning is fun!  Whenever my daughter spouts out a new fact about something, like the sun is a star or killer whales can eat sharks, she says she learned it from her Leappad.  The games are pricey at retail price, but during the holidays most of them go on sale.  I picked up several at $9.99 and the My Little Pony game at $6.99 this year!  Just stock up then and give out for good grades or improved behavior throughout the year.The Zui search engine is not like the ones on a computer.  It is category based like music, animals, science, etc with no way to type in a web address or search outside of the designated categories.  So it is very secure and limited.So overall, we really like our decision to stick with Leappad.  It makes sense for us and our kids right now.", "Date": "January 14, 2014"}, {"Title": "Outstanding.", "Author": "Clark", "ReviewID": "R23PW2ZPWTZSLC", "Overall": "5.0", "Content": "My 3 1/2 year old grandson loves his \"iPad\" as he calls it.  His parents took it along on a recent very long flight and it kept him entertained the whole trip. He loves it!", "Date": "January 13, 2014"}, {"Title": "My daughter loves to use it!", "Author": "Jordan", "ReviewID": "R1BDFKDGLMFZF2", "Overall": "5.0", "Content": "My daughter loves to use it!It is easier for her to use than her mother's iPad.We hope she will learn something while using it.", "Date": "January 13, 2014"}, {"Title": "A wonderful gift for a fery smart little girl", "Author": "John Caporicci \"privateer\"", "ReviewID": "R1Q30KZH6XQE4P", "Overall": "5.0", "Content": "When my niece opened the package she squealed with delight, Her father was equally happy as he got is I pad back!.  That it was loaded with games and such and is expandable it will provide years of fun and education.", "Date": "January 13, 2014"}, {"Title": "Good educational device", "Author": "Bobbyguns", "ReviewID": "R14RDDBIU6ATIV", "Overall": "5.0", "Content": "Very kid friendly as it should be. Lots of educational games with plenty of memory for downloads. Very good format.", "Date": "January 13, 2014"}, {"Title": "Toddler Loves it", "Author": "Kristy Llewellyn \"Kristy\"", "ReviewID": "R27CTFA4M1OXIK", "Overall": "5.0", "Content": "My 2 1/2 year old son loves this tablet.  It's great that he can enjoy interactive books and games that are also educational.", "Date": "January 12, 2014"}, {"Title": "VERY Slow", "Author": "Jennifer Bandy", "ReviewID": "R3JRQ4T2X19H3", "Overall": "2.0", "Content": "The size is great!  The camera feature is very nice.  BUT other than that, the LeapPad Ultra is not worth the money at all.  It is way to slow, freezes often so you have to go to home screen or restart.  My child got very frustrated when he would try to select something and nothing happened.  Very very disappointed.  And it is a little heavier than I expected.  I do not recommend this for any child.  We also have the Leapster Explorer and we love it.  If you want something, go with that one.", "Date": "January 8, 2014"}], "ProductInfo": {"Price": "$149.99", "Features": "LeapPad Ultra is the award winning kids tablet that is built kid-tough with a huge 7\" hi-res screen and Wi-Fi access to kid-safe web. Ages 4-9 years\nLeapFrog's tablet for kids is kid-safe out of the box, and offers extra parental settings to easily control exactly what a child can access.\nLeapPad Ultra works with LeapFrog's library of 800+ educational apps, games, eBooks, videos, music and more.\nLeapPad Ultra includes 11 apps (onboard and downloadable): Photo Fun Ultra, Art Studio Ultra, Pet Pad Party, Utility Suite, Pet Chat and more.\nFeatures built in rechargeable battery, 8GB of memory which can hold up to 40,000 photos or 140 Game Apps, 2MP front-and-back cameras and more.", "Name": "LeapFrog LeapPad Ultra Kids' Learning Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/51F5va2zM7L._SY300_.jpg", "ProductID": "B00CS1WDBI"}}