{"Reviews": [{"Title": "Don't pay this amount for it", "Author": "timahh", "ReviewID": "R1QAXCZQ45E6IN", "Overall": "5.0", "Content": "I have been looking for the Nexus 7 for a while and I am shocked that here at Amazon anyone would pay this much for this product.At Google you can get this for 200 bucks; at Gamestop, a place where I bought one, new 32 gig for 229 dollars.A refurbished for $165 dollars. (16gig)So, why would anyone pay this much at Amazon or any place else?If it included 3G or came with a super duper nice case, then OK, but just for the tablet?I really love the Nexus 7. I had a very heated internal debate about this or the Amazon Kindle Fire HD and choose this over the Kindleafter reading several reviews that showcased the two products side by side.The Nexus blew away the Kindle on all but one category which was access to Amazon videos (LoveFilms)I also love that you can easily root the tablet and make it \"yours'. Install the \"Beats Audio\" free app and the sound quality is just short of amazing.Buy it if your looking for a great small tablet but do not spend this much money for it. Look around, check out your local stores,see what they have, but to spend this much on a product that Google sells for 200 bucks, is not a wise thing to do.Just my opinion.", "Date": "May 31, 2013"}, {"Title": "Best tablet I've ever worked with", "Author": "Laura Johnson", "ReviewID": "R1X6TGO6DPCLLM", "Overall": "5.0", "Content": "I have experience with both android and apple tablets, and the Google Nexus 7 is by far the best out there. You cannot go wrong with this buy. The product is refurbished, but may as well be new, because it looks and functions as if it were just assembled at the factory. It is user-friendly to the max, clean, sharp, crisp, and crystal clear. It has a powerful battery and storage capacity. One of the best buys I've ever made!", "Date": "May 21, 2013"}, {"Title": "Perfect for On the Road Use", "Author": "Video Doc", "ReviewID": "RLDTVUAY07A4", "Overall": "5.0", "Content": "Easy wireless internet connection and set up.  Good internet browser.  Works well for video and all websites.Lots of Google/Android apps.  I am big MAC user at work but this tablet did everything I needed at home without the expense of am iPad.  It is perfect for hitting the internet when I need it at home or on the road with minimal size.I use it as a tool when not in front of my desktops.I would not recommend it if you need to do work on it 8 hours a day.  It is for convenience, on the plane, trips etc...Have not experienced any problems with it yet.", "Date": "November 5, 2013"}, {"Title": "I like the Nexus 7", "Author": "KarenC", "ReviewID": "R3FS4R56UZULLJ", "Overall": "4.0", "Content": "I use the Nexus as a research tool while I'm in class. The size is ok, but my eyes are getting old enough that I would like a larger screen that allows me more than a few words when I have to enlarge the text to read it.. I had some difficulty with connecting it to wifi sources, which is the only reason it didn't get 5 stars.", "Date": "July 7, 2013"}, {"Title": "Looks great", "Author": "Derfman \"Papaderf\"", "ReviewID": "R3R39D4VROFXZH", "Overall": "5.0", "Content": "A little tight on the fit making it tedious to align but once it is in place it covers very well . Watching the video for installation tips will make installing simple. Would order again.", "Date": "December 27, 2013"}, {"Title": "Excellent 1st gen non-HD Nexus 7 tablet with long-term Android support and millions of apps.", "Author": "Gil \"musique_classique\"", "ReviewID": "R33PDQTVUI35MM", "Overall": "5.0", "Content": "You can't go wrong with Google's Nexus products. While this first gen (2012) model isn't HD or anything, but you could already get the KitKat Android 4.4 update (thanks for the long-term support!)  Overall both the hardware and the user-interface are excellently designed and they make the tablet very easy to use.", "Date": "December 11, 2013"}, {"Title": "not so  great", "Author": "randy hall", "ReviewID": "R1Y9XA99BJ1VPW", "Overall": "2.0", "Content": "well 2 days after i got it the screen will not auto rotate.i have sent in in to asus for repair", "Date": "December 2, 2013"}, {"Title": "great tablet at a great price especially after the new version came out", "Author": "theklman", "ReviewID": "R1NSX3D913B6D1", "Overall": "5.0", "Content": "best speding of 130 ever , got it in the mail and it was so inpressice for the price i was so happy , does everything i could ever want it to", "Date": "November 30, 2013"}, {"Title": "Seems Like Just What I Was Expecting", "Author": "John Taylor", "ReviewID": "R16IAE3J9MUZXX", "Overall": "4.0", "Content": "I've had this Nexus 7 for a few weeks and so far, so good.  I don't think I've scratched the surface of the things it can do, but so far everything I've asked it to do, it's done.  Very happy with my purchase.", "Date": "June 17, 2013"}, {"Title": "Great tablet", "Author": "Mark", "ReviewID": "RSUI1BWSO1U3G", "Overall": "5.0", "Content": "This is a great buy, the tablet is basically brand new. Battery life is excellent, great resolution. I'm happy I saved some money and bought it refurbished.", "Date": "May 28, 2013"}], "ProductInfo": {"Price": "$199.88", "Features": null, "Name": "Google Nexus 7 Tablet (16 Gb)", "ImgURL": "http://ecx.images-amazon.com/images/I/41nSoigqhML._SX300_.jpg", "ProductID": "B00CHUCG1W"}}