{"Reviews": [{"Title": "Nice", "Author": "Jane", "ReviewID": "R2KJLI4K8TSSVM", "Overall": "5.0", "Content": "Bought this tablet from amazon and so far the tablet has been working with no issue, it is unlocked as seller said and the amazing thing is that the product shipped really fast under 2 weeks, generally, it is worth the money", "Date": "September 2, 2013"}, {"Title": "Great Device!", "Author": "PinkyRoss", "ReviewID": "R375IXAYT65PSA", "Overall": "5.0", "Content": "I bought this device for a friend and he loved it so much. I can't ask for something much than this for a gift. I love it!", "Date": "September 20, 2013"}, {"Title": "i never should have bought this.", "Author": "Gary", "ReviewID": "R30SSXM1F9DU0X", "Overall": "1.0", "Content": "i have had this tab phone only 3 months. i was not happy with this since the first day.it came with scratches and it froze up the first week i got it,  and now 2 and 3/4 months later, it has completly died. what ever happend in the phone fried my sd card i bought for it. and i lost all my contacts pics and videos. stay clear from this defective junk tab/phone.  i live in USA,, and now i have to deal with the back and forth thing with china.cuz thats where it comes from.  i really tried to deal with it since it came,,but i should have sent it back when i got it,, now i lost everything that i had stored in it.!!!!  and now they wont help me or answer my emails.", "Date": "September 18, 2013"}, {"Title": "Wonderful!", "Author": "Amazon Customer", "ReviewID": "R3JIKFAXBS2C00", "Overall": "5.0", "Content": "This is the best buy I've ever done!The sim card didn't connect to my network immediately , but with APN configuration it worked right away.The construction is formidable and the silver color on the back makes it look super nice.I bought another A9 generic tablet, but its processor was a bit slow... This dual cortex processor is really fast.Though it doesn't come with earphones, it comes with 2 screen protectors, a led flashlight and a cover", "Date": "March 11, 2014"}, {"Title": "Good Product and Reliable Dealer", "Author": "Rufus N. Mandein", "ReviewID": "R34AKNPXI3JT1L", "Overall": "5.0", "Content": "I am particularly impressed by Goldengulf's commitment to ensure that his customers get the best of his product and his timely response to questions and costumer's queries.  The product I came on time and it was satisfactory to me.  I can recommend him to anyone looking out there to purchase goods.", "Date": "December 23, 2013"}, {"Title": "I Ova Luv It!!", "Author": "DEEQUEEN305", "ReviewID": "R10HEY0GRWPINS", "Overall": "5.0", "Content": "it came to me with n 3-4 week fast! and i logged into my google account and the language changed to english and everything was fine work great with the Straight Talk ATT sim card kit monthly plan, from  Walmart and it works great with the internet by itself when you set it up with a data plan  or while on the wifi connection. i gotta a bluetooth and i use this for everthing Phone & internet. in love.i will update on my Youtube channel @Deequeen305.", "Date": "December 20, 2013"}, {"Title": "It's alright", "Author": "Prekake K", "ReviewID": "RW002QSB2Z6BM", "Overall": "4.0", "Content": "It's actually just alright, I saw a lot of tab listing but I needed one with a Sim port so calls could also be made. I got this for my niece, she loves it and it works alright. sound system is good, photo quality not some much, arrived on time which I'm happy for. All in all, I don't thing it could go wrong", "Date": "December 2, 2013"}, {"Title": "sorry", "Author": "ms wright", "ReviewID": "R16THF4MORPZR9", "Overall": "5.0", "Content": "Sorry about the mix up. Next time provide more tracking information . Wasn't trying to be rude. Thanks again and I am truly sorry.", "Date": "March 28, 2014"}, {"Title": "2013 Newest 9\" inch 3G sim card phone call tablet/Google android 4.0 Touch Screen", "Author": "B. K. S \"skboedhai\"", "ReviewID": "R1R283U541XK8O", "Overall": "5.0", "Content": "Awesome tablet.I just can't find what you can't do with this. A college of mine ordered one first because she like the one her daughter had. When she got her's the other colleges went practically nuts that she got such a amazing device for such a low price. I strongly advise to buy this. You won't be sorry, especially if you buy it from directly from the retailer ( new goldengulf ) with their super fast shipping and friendly service.", "Date": "December 20, 2013"}], "ProductInfo": {"Price": "$169.50", "Features": "The Best quality one, we only sell nice product!!\nFree cover included, A free LED Keychain Light included\n2014 Newest Sim card phone call tablet\nGPS, Dual Camera, Bluetooth, Youtube Skype Facebook......\nMTK6577 CPU, Dual cortex A9, Good quality", "Name": "2014 Newest 9\" inch 3G sim card phone call tablet/Google android 4.0 Touch Screen Capacitive Mid,Dual Camera GPS WIFI Bluetooth, G Sensor Flash 11", "ImgURL": "http://ecx.images-amazon.com/images/I/31cs0VqEwoL._SX300_.jpg", "ProductID": "B00CMAPHSQ"}}