{"Reviews": [{"Title": "Fantastic purchase", "Author": "Iris Tol", "ReviewID": "R2B77B1MPAJBET", "Overall": "5.0", "Content": "I bought two Nabi Jr. 16GB (the nick Jr models) and am amazed...These are full-featured quad-core android tablets with Jelly Bean!  My 2 and 4 yr old grandsons love them.  In Nabi mode I don't have to keep \"fixing\" their games because they can easily maneuver backwards and start a new activity from their special menu. They are into trucks, bulldozers, and fire engines right now and I had no problems finding apps they like.  I even put their favorite YouTube video links on there...they just press and watch. Even the two-year old learned the green button is on/off and the blue button is \"back to home.\"  They have no issues finding what they want (in Nabi mode of course) You have access to Amazon's Appstore and you can even sideload any free google-play apps just fine. Just a sidenote...I was initially confused when I couldn't detect the 16GB. I thought I got the wrong model but they have the storage partitioned off so you won't see the whole 16GB.  There's a slot for a micro sd card if you need more storage.  The only thing that prevents this from being a full-time adult tablet is the less than average display.  It's not HD quality but perfect for the kiddos.  I recommend getting the optional stand...it's a necessary accessory albeit way overpriced.The suggested age range for this product is 2 - 6 yrs presumably because the Nabi mode kids picture menu  is ideal for non-readers.  However, in parent mode you can customize it to your liking.  I guess the battery life depends on your usage...but I've gotten 5 or 6 hrs out of it.  However, I cut the kids off way before they then....1 to 2 hrs maximum per session.", "Date": "January 9, 2014"}, {"Title": "Love this tablet", "Author": "KLR", "ReviewID": "R1QXJ8ZI23EU98", "Overall": "5.0", "Content": "The best children's tablet for a toddler.  Wonderful apps, easy to navigate and my little boy loves the camera and listening to music.  Greate entertainment for long road trips or rainy days.", "Date": "November 19, 2013"}, {"Title": "A great tablet for kids. Pro's & Con's, a simple comparison!", "Author": "M. Hudson \"FaithFunFamily\"", "ReviewID": "R2HR07B999EZ8A", "Overall": "4.0", "Content": "With the many perspectives offered through the reviews here, I'm going to keep mine incredibly simple and to the point. As a parent of an active 3 1/2 year old daughter, here are the pro's and con's:PRO'S*Easy access to apps for both me and my daughter*Teaches counting, colors, words, drawing and many more skills in various games provided with the tablet*Adjusts to child's age as they develop skills (ranges from age 3 all the way up to 17)*Several \"blank\" pages offered so that you can purchase extra Apps as you want to purchase them*\"Parent\" mode makes accessing specific settings easy to adjust while preventing your child from accessing specific functionsCON'S*The tablet does NOT come with the Nickelodeon package games (Dora the Explorer, Bubble Guppies {my daughter's favorite}). If you wish to have the game package, the cost will be a whopping $60 or more!*You can purchase App's in the App sore by using the \"Parent\" or \"Mom\" mode and entering the password to get to the App store. The problem is the App's are NOT the average cost of typical App's that we might pay for our Android or Iphones. These App's are well over $5-$10 and more. Most are WAY too much.*The only source included with the tablet in order to charge it is one simple, short flimsy cord that is incredibly fragile. I just had to purchase a new cord to charge my daughter's tablet because hers simply snapped in half after just a few months. You cannot purchase this charger anywhere else but the Nabi Jr store online. You do have the option to purchase it on EBay or Amazon, but you will have to purchase an entire charger package for a whopping $40! It's a total rip off. So I purchased a 7 foot cord for $7.99 and it arrived in great condition and works far better than the original cord that came with the tablet ever did.Apps on this device can be moved and merged. Just as you can combine Apps on your iphone into categories (Example: App categories for entertainment, photography, productivity, etc), your child can do the same thing. Because the tablet offers several extra pages in case you would like to download more Apps, I use the extra pages to move the Apps that are too advanced for my daughter to the last pages. I believe there are 6-7 pages in total. I move the games that she should be using that teach her valuable skills to the first pages. I still have to separate Apps that are combined, and I likely always will.* This device will use battery life even when not in use. I had my daughter's Nabi Jr fully charged and left it off all weekend and then handed it to her when she came back home. For whatever reason, the battery was drained. So, even when not in use, it needs to be on a charger.Overall, this is a great toy. I pretty much hand this to my daughter and she can spend literally hours playing games, matching colors, 'painting', coloring, shapes and more. It keeps her occupied during car rides and in waiting rooms. She loves to learn on her tablet and enjoys the games very much. The games offered with the tablet are enough for her, and there's no need to purchase anything additional. I don't feel the need. The games advance as she learns and now she is spelling her name and tracing the alphabet. With that said, this tablet is worth the con's and other issues. They are incredibly minor and compared to other tablets, has the best potential in my opinion. It's used on a daily basis and holds up to my daughter accidentally dropping it now and then.I hope this review helps!", "Date": "April 24, 2014"}, {"Title": "complete disappointment", "Author": "stacym", "ReviewID": "R3REEWINES94AM", "Overall": "1.0", "Content": "Last for three weeks and it is officially dead. That is 50 dollars per week. Should have just gone with kindle and a child-safe case.", "Date": "February 20, 2014"}, {"Title": "SOME PEOPLE REALLY DON'T CARE", "Author": "Tracy Ross", "ReviewID": "RPFIQCQ6G571E", "Overall": "5.0", "Content": "Someone stole my daughters, couldn't tell her,,lied and said it'll show up somewhere. Went straight to Amazon.com and purcpurchased a used one it arrived in a few days , my baby life went on as usual.", "Date": "June 3, 2014"}, {"Title": "should i have bought a traditional tablet?", "Author": "kennethia", "ReviewID": "R7XERP2IP7K11", "Overall": "3.0", "Content": "a little disappointed that you cant download apps or access the internet on this tablet. It does however connect to Bluetooth, which i do not see the need. Maybe i just haven't figured all of that stuff out but I probably could have saved a few bucks and got another app friendly brand and got a kid friendly case.", "Date": "June 2, 2014"}, {"Title": "Defective!!!  Awful experience!!!", "Author": "playit71", "ReviewID": "R17BOI56ORGZET", "Overall": "1.0", "Content": "We are on our 3rd Nabi Jr. since Christmas.  The first one stopped working (not played hard, 3-4 times a week, usually listening to books) in March.  We bought it at a Box Store (sorry Amazon), and because they had an extended Holiday warrantee, they replaced it.  One month later, the new one stopped working.  Box store wouldn't take it back, so we had to call Nabi Jr.  That's where the headache started.  They'll replace it.... as soon as I ship my defective one at MY EXPENSE.  I don't think so.  So I spent 3 days on the phone demanding a label, and the confirmation that mine was shipped.  Uh, mine shipped, WHEN THEY RECEIVED the defective one.  We had two different RMAs, one said to send the entire thing back, one was just send the Nabi Jr with no bumper or cord.  They had assured me that I was getting a brand new Nabi Jr in the box.  That did not happen, yesterday I received a Nabi Jr only.  No bumper, no cord to charge it, so I have no idea if it works.  If you buy this product, just hope that it stays working, or you'll have a HUGE headache.  I demanded a refund, and the lady actually told me today \"We cannot issue refunds, because we actually never received money for this\".  Wow, Box Stores don't have to pay for their products.  Amazon, you should look into that.", "Date": "May 28, 2014"}, {"Title": "great", "Author": "Patrick Torrillo", "ReviewID": "R3MZQFJYQZ8P7Z", "Overall": "5.0", "Content": "My child loves it, the learning on it is great, my 3 year old is learning a lot. Going to buy more as a gift.", "Date": "May 10, 2014"}, {"Title": "Two stars for Failure with some use.", "Author": "Xander689", "ReviewID": "R94QUHDKH4BHM", "Overall": "2.0", "Content": "My in-laws purchased this for my daughter. I was initially not too fond of the nabi as I did some research and fond it rather lacking (hardware and software) Firstly, this tablet comes with a crap ton of apps. Cool. Too bad my daughter isn't interested in them that much. That's fine, we can download new apps right? Wrong. Entering \"mommy mode\" is a pain in the *** and ours would not connect to \"nabi's server\" despite being properly connected to our wi-fi. It did get better though... The tablet began freezing, apps would crash, Camera would stop working, the list just goes on and on. I have a nexus 7 tablet and I've actually thought about giving her that instead at this point. The only thing I can say that I like about this tablet is that it can take a fair amount of abuse compared to say an iPad but don't get me wrong, this tablet is in no way fantastic, but it gets you from A to B, barely.", "Date": "April 24, 2014"}, {"Title": "Do not buy this product!", "Author": "Steve Williams", "ReviewID": "R6Y65H9BSVK1U", "Overall": "1.0", "Content": "What a waste of my money! I bought this intending to give it to my toddler. She didnt even get to use it. It was D.O.A. I'm very disappointed.", "Date": "April 22, 2014"}, {"Title": "nabi jr foe my 6 year old.", "Author": "Bobbi Parker", "ReviewID": "R3NAZUCH5C1JJ3", "Overall": "4.0", "Content": "I gave this item a 4 because it lacked detailed information on how to get online apps. it also didn't include stylist.", "Date": "January 6, 2014"}, {"Title": "Great 1st Tablet for my toddler", "Author": "Travis B", "ReviewID": "R1J63JNO6GWPJ", "Overall": "5.0", "Content": "Other than not having access to the Google Playstore this tablet is solid. The Amazon appstore has 90% of the apps you would want for your child, and you can get and install the other 10% by searching on the internet if you have a little know how with the Android OS. This tablet is fast, a Tegra 3 Quadcore processor will not lag on any game your child plays. I think some people are using it in Nabi mode which we really do not use, but if you keep it in Mommy or Daddy mode it operates just like a normal tablet. The screen size was really my only concern, but my daughter doesn't mind it all. It is very thick and comes with a bumber, it will survive day to day abuse from a toddler. You will not find another tablet with the on-board memory or processor power for this price. I would like to see a 4.2 update for it though and Google play access. Overall we are happy with it and I would recommend this to anyone.", "Date": "December 31, 2013"}, {"Title": "Great", "Author": "troy holston", "ReviewID": "R1S6TEMWEIP18Y", "Overall": "5.0", "Content": "I didn't think it was gonna be this good,it is a great product mad my son loves it!! He is gonna be 2years old on New Year's Eve and he doesn't grasp all it can do yet but he will.every kid should have one!!!", "Date": "December 29, 2013"}, {"Title": "Great learning tool!!", "Author": "KIRT COLLINS", "ReviewID": "RUHD4WJ3V7ZDV", "Overall": "5.0", "Content": "I bought this tool for my 7 year old neice and she loves it. This a great toy for any child who learn at a rapid pace. great asset to have.", "Date": "December 26, 2013"}, {"Title": "Great for toddlers", "Author": "ssoeur", "ReviewID": "R1CI07MS9FHJUJ", "Overall": "5.0", "Content": "I bought the Nick Jr. edition for my two year old a couple months ago and I don't regret it one bit.  It comes loaded with a lot of educational games and videos. She's dropped it several times and it hasn't scratched or broke. Buy this you won't regret it!", "Date": "December 7, 2013"}, {"Title": "Stay away from Nabi!!", "Author": "thriftychick", "ReviewID": "R30A3A1OZE5ZR", "Overall": "1.0", "Content": "I bought my son's Nabi Jr in July 2013. He loved it in the beginning. I even liked using it as a tablet for myself. Then the battery started to go and by October 2013, it would only work if it was connected to the charger. I contacted Nabi and they told me to return it for a replacement. After waiting for further instructions, I mailed it to them on December 14th, 2013. Tracking showed it as delivered on December 16th, 2013. To date, I still have not received our replacement and have gotten nothing but lies and run around from this company. Stay away from Nabi!!! Buy something else!!!", "Date": "February 7, 2014"}, {"Title": "They sent me the wrong product", "Author": "Tiyi Willingham", "ReviewID": "RNFKFBMVNYLYV", "Overall": "1.0", "Content": "This is a false advertisement.  They show and describe a Nabi Jr. 16GB, but they actually sent me a Nick Jr.  There is a difference.  I contacted the seller to try to resolve the issue but they just responded by giving return information.  The item took way too long to get here so sending it back and getting the correct one before xmas was not an option for me.  Very angry and will not trust this company again!!! Horrible customer service!", "Date": "December 23, 2013"}, {"Title": "Nothing to complaint about:)", "Author": "Shery Debaecke Clamosa", "ReviewID": "R3MDEUK7RV2SBZ", "Overall": "5.0", "Content": "It's great! My baby loves it! Great games. The battery last long enough. Actually it's my husband who chose this as a Christmas gift for our baby, when it comes to electronics, technologies and stuffs like that, i let him do the picking, he's good at them... So, sincerely i can say i recommend this!", "Date": "January 26, 2014"}, {"Title": "Not happy with customer service", "Author": "brad velvin", "ReviewID": "RIMEMOQH67VN7", "Overall": "1.0", "Content": "Bought this product Nabi Jr., changed my mind . Trying to return it since Dec. 12, 2013. Still have not heard from the company to get my return authorization. It was suppose to take a couple of days. It is now 12/28/13. Still have the product and still waiting on authorization to return it. Not a way to run customerService", "Date": "December 28, 2013"}, {"Title": "Definitely would not recommend this product", "Author": "Daniel J. Allen", "ReviewID": "RLCZYBY8LO9V6", "Overall": "1.0", "Content": "The concept is great and the table can take a beating, but from day one we've had problems with it constantly freezing. We tried the task killer as Nabi support recommends and even wiping it out and reloading it, but nothing helps. My child gets so frustrated with it that he doesn't want to use it anymore even though he likes a lot of the learning games. Your better off with any other cheap android tablet used under supervision so they don't break it or get to something they shouldn't.", "Date": "December 20, 2013"}, {"Title": "the term \"Caveat Emptor\" was invented for this product!", "Author": "Roby", "ReviewID": "R3T3UFEGJGUIA1", "Overall": "1.0", "Content": "My kid loved this thing...for a month until it died. Boo. I guess I got unlucky. I'll just contact Nabi and they fix me up, and everything will be ok, right? WRONG!I contacted support and they told me they thought it was an issue with the charger. Ok, sounds reasonable, ill just wait for the new charger to come in the mail....and wait I did.After 2 months that included several emails, numerous excuses and attempts to obtain a $2 charger, I finally received my charger. YAY! Now my son can use his tablet, right? WRONG! That didn't fix it.Now I have to fight with them to get a working tablet to replace my broken one. I am not holding my breath.STAY AWAY!", "Date": "May 7, 2014"}, {"Title": "Takes a while to power up", "Author": "Senior Shopper", "ReviewID": "R1KOIH1OW34MI4", "Overall": "3.0", "Content": "The Nabi is entertaining to my grandson, but when the battery goes down, it needs to charge completely up before it can be used again. My granddaughter's Kindle can be used while the battery is charging, but the Nabi won't let you do that.", "Date": "April 18, 2014"}, {"Title": "good", "Author": "sylvera", "ReviewID": "REX1Q7849PT31", "Overall": "4.0", "Content": "The product was smaller than I thought, but overall it was a good buy, my kid loves it, thank you", "Date": "March 29, 2014"}, {"Title": "Finally.. a tablet designed for toddlers!", "Author": "jeff h", "ReviewID": "R3BFDW7P6PWUFZ", "Overall": "5.0", "Content": "Its a fantastic tablet for toddlers and small kids. It has a camera, is toddler friendly, and is definately well built. Our toddler has dropped and thrown this many times and it still works great. Even after sticky hands all over the screen! However, it was a bit misleading......you cannot shop on googleplay. You can only shop for apps on Nabi. It also shows \"character games\" on the commercial....unfortunately, those games are still in production and not available. It also has some pretty neat accessories that you can purchase. All in all, its a great product and you cant beat the price! I would definately recommend this product.", "Date": "March 19, 2014"}, {"Title": "superior quality with only one complaint", "Author": "Renee W.", "ReviewID": "R3KP6BKL4WVSCP", "Overall": "4.0", "Content": "the devices are exactly as described in the product description. They are very durable, have a bright screen and, with more than 20 games installed. Also there is over 7 or 8 gigabytes app storage remaining so that I can install more games. It does not come with the Google Play Store but you can easily install the Amazon app store without having to root a device. My only complaint is that to truly utilize the parental controls you have to give the Nabi Jr company your credit card information.", "Date": "March 7, 2014"}, {"Title": "best investment for toddler activity.", "Author": "Anaya Renae", "ReviewID": "R3RES4R9TOHWQI", "Overall": "5.0", "Content": "my 2yo is fascinated and learning so much from using this tablet. reccomend highly for any parent wishing to disguise learning as games.", "Date": "February 19, 2014"}, {"Title": "Great little tablet", "Author": "Donald B Gore", "ReviewID": "R33U3JRFHABID3", "Overall": "5.0", "Content": "I bought this tablet for my 3 year old, when I saw it I just loved its size for my 3 years olds tiny little hands. All of our movies and T.V. show collection is digital and can be streamed using the plex app. I downloaded the plex app and now she can watch her t.v. or movies whenever she wants and I am not stuck watching kids shows all day. My 3 year old can navagate it very well and I also downloaded a potty training app for her to watch and I hope I have better luck with potty training this way. I charge it at night and the battery lasts all day however she is not on it all day she is on it sporadically so I have never had a problem with it dyeing during the day. My 2 year old son loves to watch his Little Einsteins only on the nabi jr, no more on the big t.v. I think its great and so worth it.", "Date": "February 18, 2014"}, {"Title": "great", "Author": "Starla Jones", "ReviewID": "R3UTGU2IO8UL34", "Overall": "5.0", "Content": "This is great for ages 2 up. My grand kids love playing with it. defiantly worth the money to buy a Nabi.", "Date": "February 12, 2014"}, {"Title": "Good for a starter tablet for 5 and under....", "Author": "S. Hart \"S7Hart\"", "ReviewID": "RGDPRL8FMZMQ3", "Overall": "4.0", "Content": "Returned it because my 6 year old already had a Kindle....this didn't have many (if any) more features than Kindle. DO NOT get this from J&R; Music World if you do get it....HORRIBLE customer service-slow communication, took over a week after I requested a return to get return process to me, then, over a week after they received it to credit my account!", "Date": "January 18, 2014"}, {"Title": "Not a sub for iPad :(", "Author": "Nicole Harvey", "ReviewID": "RX21JAMY3DMTL", "Overall": "2.0", "Content": "If your child is used to iPad, do not purchase. Purchased for an 18 month old that can maneuver an iPad easily (wanted her off the iPad). Nabi is just ok. Apps are not as complex  or fun on nabi. Far less options for free and low price apps. Nabi does not run as smoothly or quickly as iPad. My child is just not interested in it..goes for iPad instead :(", "Date": "January 8, 2014"}, {"Title": "Don't waste your money, seriously!", "Author": "J. Herzo \"BargainZFinder2009\"", "ReviewID": "R2BUWHPSJHAEC9", "Overall": "1.0", "Content": "Yes, there is a Nick Jr version (they sell it in Walmart) - no it's not worth buying IMOH!We were given one of these and firstly I would like to say these \"tablets\" are for little kids only - if your child is 5 or 6 or more, do not buy them this or let anyone else buy them this - it's insulting to their intelligence (I am not kidding).Read many of the reviews and you will see people are buying this for toddlers 2 and up - I wouldn't spend this much on a machine for them either, I think little kids can use Leappad etc and learn a lot more.There are many other tablets for the slightly older kids who know how to work your phone so therefore know technology well enough to have a better tablet - they don't cost much more than this but they are way better.Doesn't hold a charge for long now - never did stay charged for more than 2 hours, which was not great. Very much a little kids first fake tablet - not a great toy for the toddlers either, I mean do you really want your 2 year old glued to a tablet - how about playing WITH them, playing games WITH them - you get my point?", "Date": "December 20, 2013"}, {"Title": "How do I rate the Fuhu Nabi Jr.", "Author": "Kpamahanka", "ReviewID": "R2068VF6XKWQ8", "Overall": "3.0", "Content": "It was bought for my son. He likes it very much. However, he is only allowed to play with it during the non- school days and so have not come try all the features yet.", "Date": "March 26, 2014"}, {"Title": "So far not impressed", "Author": "Chris Kunde", "ReviewID": "R3LS8YHR86UCHT", "Overall": "2.0", "Content": "Got for 3 year old, he enjoys it so far, but it's been a day.  Difficult to install apps, could not load angry birds, which was requested by my kid.  I like the factory installed content, but thought it was a tablet, not a calculator or a watch.  Difficult to customize.  Tried to install Monkey Preschool Lunchbox, my kid's favorite app, but costs $1.99 (free on my iPad), AND, could not (after 2 attempts) put in my credit card info (and had to put in ALL of the info each time, CC number, security code, name, address, it remembers nothing and didn't allow me to buy the surprisingly expensive apps after it failed to accept my information both times).  I only planned to have my kid use this for 2 years, but my kid is more effective at using my iPad than this tablet that is designed for him.  I doubt we will get even 2 years of use from it.", "Date": "December 26, 2013"}, {"Title": "cost", "Author": "Reza Looyeh", "ReviewID": "R1NR940BMM8W8Z", "Overall": "3.0", "Content": "Too expensive for the quality and multi-functionality you get  compared to NABI 2 ... My daugther now wants a NABI 2 that her brother already have one!", "Date": "August 15, 2013"}, {"Title": "Too confusing, buy a different tablet", "Author": "Scott Lull", "ReviewID": "RLN812JAQURSB", "Overall": "1.0", "Content": "I bought my son the Nick Jr 16gb Nabi Jr in late September 2013. By the second week of November 2013 it would no longer power on. Needless to say my son was crushed. Throughout the time he owned it I found it to be quite confusing and difficult to use. Trying to download and log in to you tube was a major chore. I couldn't get the google play store to download and I kept getting error messages popping up after trying to do so. Today I ended up going to Best Buy and returning it and getting an ipad mini. It was more expensive, but at the end of the day it's easy to use and best of all, it works. Lesson learned. Stick with apple, Sorry Nabi.", "Date": "November 10, 2013"}], "ProductInfo": {"Price": "$141.11", "Features": "NABI JR - 16G Flash\nNickelodeon addition includes Nick content pre-loaded on the tablet, such as Dora the Explorer, Team Umizoomi, Bubble Guppies, Backyardigans, Wonder Pets and Ni Hao Kai-Ian\n18 additional games, videos and e-books featuring popular Nick Jr Characters\nComes with a Nick Jr branded orange bumper\nNvidia Tegra 3 Super 4-plus-1 Quad-core with 5th battery saver core processor, 16GB Storage, Android 4.1 Jelly Bean, Wi-Fi, Bluetooth and NFC", "Name": "Nabi JR 5\" Children's 16GB Tablet - Nickelodeon Edition", "ImgURL": "http://ecx.images-amazon.com/images/I/51bIRtLdA6L._SY300_.jpg", "ProductID": "B00CUM9CNW"}}