{"Reviews": [{"Title": "As compared to MS Surface Pro for on-the-go digital art", "Author": "S. Dicken", "ReviewID": "RDAPHEGSVT8Z3", "Overall": "5.0", "Content": "Background on how I ended up with the Samsung 700T: I'd been considering getting the 13\" Wacom Cintiq 13HD for a while. I've had the 12\" Cintiq before, and I rarely ever used it because I found the 1280x800 resolution way too cramped in most of the programs that I use for producing art- I was hoping the 1920x1080 resolution on their new model would make a world of difference. Not being able to find the Wacom in stock anywhere, I started exploring other options. At first, I went to the Microsoft Store and discovered the Surface Pro. I was amazed to discover that the 10.6\" device had a 1080p display, and a whole computer built in. I quickly researched online to see if people were using the Surface Pro for art, and I found both the Penny Arcade review, and another comic book artist's blog, and bought the Surface Pro on the spot (bolstered by the Microsoft Store's 14-day no-restocking-fee return policy). Well, after 14-days, I really loved having the Surface Pro- creating art with a stylus-input anywhere was really appealing (and a huge jump from what I'd been doing on my iPad). My original notion of getting the 13\" Cintiq seemed foolish, as I found the Surface Pro to be just as responsive as the 22\" Wacom Cintiq 22HD that I use everyday at work. Only problems that I was having with the Surface Pro were eyestrain, and I found that the upper middle portion got uncomfortably hot after working for a while (I also really, really disliked both of the Surface Pro's keyboard options- I'd been using it with my Logitech K400r). I decided to return to the Microsoft Store to explore my other options.The sales guy at the store showed me the Samsung 700T, which had the same specs, but with a slightly larger screen (and it was on sale for the same price as the Surface Pro- and included a superior keyboard). In the store, the display on the Samsung looked more comfortable to use. My first impression of the rest of the device was it didn't look as elegant as the Surface Pro- plastic instead of the magnesium body (magnesium which scratched easily, btw), all the ports covered up, micro-HDMI instead of a DisplayPort, USB 3.0 port oddly on the top of the Samsung, vents all over the place instead of neatly hidden... I was skeptical but I decided to go for it anyway, having another 14-day trial period.After just over a week with the 700T, I LOVE it. I'm currently running Adobe Creative Cloud on it as well as Manga Studio, and I haven't had any issues with any of my software (was the same on the Surface Pro). A few things that I quickly realized about the 700T after working with it for a while, as compared to the Surface Pro- The tablet is lighter- it might not be by much, but believe me, it makes a difference if you're holding it with one hand for a while. Also, when holding it with one hand for a while, I found that the 700T's rounded back is much more comfortable, and the device doesn't seem to get as hot. I've had longer sessions with less eye or hand fatigue. I also appreciate the clamshell keyboard dock that came with the Samsung way more than I thought that I would. The extra two USB 2.0 ports are handy, and made the initial installation of everything more comfortable. the oddly placed USB 3.0 port at the top sported my USB 3.0- gigabit Ethernet adapter while the other two ports allowed for a thumb drive and a mouse. The front-facing stereo speakers have improved my Netflixing experience, as a nice bonus, the Samsung 700T will power my old and long-neglected Logitech V20 USB speakers, even without being plugged in, where the Surface Pro wouldn't (that'll be nice for movie watching while travelling).Is there anything that I miss about the Surface Pro? Sure, I miss the handy Kickstand that would allow me to prop the device up without any accessories, I miss the DisplayPort (which allowed me to use my 27\" 2560x1440 monitor as a second display at its native resolution), I miss having the USB 3.0 port in a more practical and uncovered location. Do I need those things over comfort. No, not for what I originally wanted the device for, which is a high resolution portable digital art solution. All in all, I find the Samsung 700T better suits my needs at the pricepoint I was originally shopping at. I'm really looking forward to trying out the Samsung ATIV Q later this year, but in the meantime, I'm going to enjoy the heck out of my 700T.BTW: If you guys are using one of these slate/tabletPC/convertibles/hybrids for art, I HIGHLY recommend seeking out ArtDock, which allows for keyboard toggles (Ctrl, Alt, Shift, Spacebar) and shortcuts with your touchscreen while it's also accepting pen input! ArtDock completes the Cintiq-experience and allows me to leave all the keyboards behind.", "Date": "July 9, 2013"}, {"Title": "$1k for a unit with multiple problems", "Author": "Lady of Reviews", "ReviewID": "R1MFSXT4X9UYGG", "Overall": "3.0", "Content": "I'm not sure how this passed QC at Samsung, though I'm not terribly surprised since the LCD TV I own from them has major issues as well.The screen had a \"frame\" effect around the outer 1\" of the screen. It wasn't really light leakage (at least not how I'm used to seeing), but it made that area around the screen have a bit of discoloration compared to the rest of the screen. Ick.It also had a weird artifact effect (I think there was an issue with the video processing) where it looked like there was some major banding, and three horizontal stripes about 2/3 down the screen that was very apparent in certain colors, like the gray on the background of the Wordpad program. Since I was using this mainly for art, this is a HUGE issue for me.The touchpad on the keyboard was also majorly messed up. The top 1/2\" of the touchpad did not function whatsoever, and would randomly click in areas, making it difficult to type, as the cursor would keep shifting to an area a few sentences above where I was typing.I'm not sure how, of all the issues I've had with this product, Samsung managed to miss that the top part of the trackpad does not work.I'm extremely bummed, because now this is out of stock and I can't exchange it. I'm considering just waiting to see if the ATIV Q is going to come out, or waiting and splurging on the Cintiq Hybrid Companion 13HD (assuming Wacom actually releases it with Windows Pro and not RT).I don't know. Just have to wait and see, I guess. I might try the ATIV Tab 7 (they're re-branding of this unit) and see if I will end up with a functioning model or not.", "Date": "August 13, 2013"}, {"Title": "COMMON Touchscreen Failure For ALL Samsung ATIV Tablet PC Models (500t and 700t)", "Author": "MrGuy", "ReviewID": "RT4HZPT9BO3KH", "Overall": "1.0", "Content": "I bought the 700t from eBAY and it worked fantastically for almost three months until the touchscreen stopped working... s-pen still works, but who cares. (FYI: Samsung DOES NOT honor transferred warranties, so I'm on my own)I was using it for about an hour as a tablet one morning, and when I was finished I put it on the keyboard dock, and put it to sleep. I turned the unit back on about an hour later and the touchscreen did not work; no indication that it was going to fail before-hand, just completely did not work.I have nearly 20 years of technical experience with computers, with certifications, and even I can't resolve this problem, which looking in forums all over the internet, is a VERY common problem for this and ALL Samsung ATIV tablet PC models (500t and 700t).Samsungs ONLY solution is to return and replace.My unit:- All Samsung updates are installed- All Windows updates are installed- Unit has been lovingly handledThings I've done to fix the touchscreen problem:- Wiped drive/factory recovery 3x- Repeatedly uninstalled/reinstalled Wacom and touch drivers (even tried older versions, and some 3rd party)- Windows restore 3x- Spent days looking on forums for answers- Cleared CMOS- Hacked BIOS update program and reflashed BIOS firmware- Disassembled unit, cleaned all cables/connections with isopropyl alcohol, reassembled- Replaced digitizer with exact OEM- Cried inside...Why Samsung???Short of replacing the main HannStar board, I've done everything in my power to fix the number one major feature of a tablet. I didn't give you $1400 for a TOUCHLESS TABLET!!!!It wouldn't be so infuriating if this thing wasn't perfect for me :(That being said... PLEASE save your money and buy a Surface 2.", "Date": "December 6, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CWX8KWS"}}