{"Reviews": [{"Title": "Excellent buy", "Author": "Rosa María", "ReviewID": "REMSMU4JY6RRK", "Overall": "5.0", "Content": "Very good product, excellent value for money, I am very happy with my purchase.I really like this tablet, and I recommend to all buyers of Amazon.", "Date": "October 8, 2013"}, {"Title": "HORRIBLE DEVICE!", "Author": "Cliff Brown III", "ReviewID": "R172WVISWQXBTM", "Overall": "1.0", "Content": "Save yourself the trouble and buy any other tablet! Lenovo bills themselves as developer friendly and they are not! No support, no help, not even on the developers forums.Gps and bluetooth are both broken!Netflix Broken!Wifi is on and off.Display is the one good thingsound is the other.Simply does not make up for all the problems!Simply put just pass and get any other tablet. Iv had better experiences / support with 99 dollars tablets from Frys.", "Date": "October 3, 2013"}, {"Title": "ecnomic with full feature", "Author": "tariq", "ReviewID": "R6ERR8A42QC11", "Overall": "4.0", "Content": "I am searching cheap tab and found this one. its a complete tab working is very good. price was very reasonable.", "Date": "February 6, 2014"}, {"Title": "great sound, really light and worth it", "Author": "alejandro Molino", "ReviewID": "R1SLDXIK4KOIW1", "Overall": "5.0", "Content": "Im am delighted by this tablet. i bought 2 of them and i am still impressed on its performance. My cousins are the ones who are really enjoying the true power of this machine and i must say that when they play they do not argue about heat, battery life or sound quality. I have seen them playing and i have played as well and i am truly amazed about the power of the speakers and the quality. The size is just right as well as the price. Good job lenovo!", "Date": "January 28, 2014"}, {"Title": "Great Tab..", "Author": "Jose Kuilan", "ReviewID": "R1ISLNT1BCPEPD", "Overall": "5.0", "Content": "Being an IT Professional, working for Google, I know about: good brands, and this is a good one with a cheap price,", "Date": "January 4, 2014"}, {"Title": "nice and portable", "Author": "Edgar Q.", "ReviewID": "R3V7S7TKAR64H1", "Overall": "5.0", "Content": "Works as advertised. It's a nice product if you are looking for a basic and portable tablet for reading and checking stuff while traveling.", "Date": "October 2, 2013"}, {"Title": "Awesome Tablet, Amazing Price", "Author": "MATKAL", "ReviewID": "R2MLXU1G2XU7EC", "Overall": "5.0", "Content": "This tablet is really great. So, I bought this tablet for my 6 yr old daughter because her older brother (8) had one and she really wanted one. I figured that it is probably an appropriate age to get her acclimated to technology as everything she will experience in her life will be technically related (most likely). As long as we monitor her screen time it works out well.  On to the tablet...it is way better than my son's quad core, feature rich no name tablet that was actually the same price on a big sale.  Way better means, more responsive, way faster, brighter/clearer screen and sounds better with speakers.  So all around, my son was very upset about this recent acquisition.  Oh, i forgot the batter life is about 4 x as long as my son's tablet as well he has a 3500mAh battery (it says).  Anyhow, this is a great tablet for the price and is as good as most I have seen up to the $175 price.  SO far So good, I highly recommend.", "Date": "November 25, 2013"}, {"Title": "Not bad for 99 bucks. My 2 year old loves the Netflix!", "Author": "Joe", "ReviewID": "R3VJ8VQQT1BSG", "Overall": "4.0", "Content": "Yes it does run Netflix. It doesn't work if you don't run the software update. RUN THE UPDATE right when you get it. Go to settings>about tablet>system update. There are (3) of them that I had to run separately, each time rebooting and installing the patch, rinse and repeat. The last one being 91mb, and that's the one that will fix the Netflix.My 2 year old LOVES this tablet, and I love that it was 99 bucks. To all of the people complaining.....what did you expect for less than a hundred bucks? The sound is GREAT, and it runs friggin JELLYBEAN.", "Date": "September 21, 2013"}, {"Title": "Terrible Mistake", "Author": "Amina Jones \"book butterfly\"", "ReviewID": "R1RFKER513PSKL", "Overall": "1.0", "Content": "This tablet is average. You can't read out in the sun though. After downloading about four applications they start telling you your tablet is low on space so make sure you have a huge memory card.Update:Check it out online guys. Everyone seems to be complaining about this tablet. Don't buy this tablet the storage space is ridiculous and there doesn't seem to be a way of downloading apps to you SD card. It just sucks the fun out of everything.", "Date": "October 4, 2013"}, {"Title": "Excellent", "Author": "Christian De Freitas", "ReviewID": "R27J74L8N2CI6C", "Overall": "5.0", "Content": "Got this tablet and this other one, http://amzn.to/1mBUGzV costing 80 dollars more (at the time i bought it), one for me (the galaxy) and this one for my wife.Once we loaded family videos and pictures, they looked much nicer on the ideatab than on the galaxy.long story short, i kept the lenovo and gave my wife the galaxy, wished i had got 2 of these....", "Date": "April 22, 2014"}, {"Title": "Got 4GB instead of 8GB", "Author": "Kemie W.", "ReviewID": "R1VYIVATCXPLDJ", "Overall": "3.0", "Content": "This items said it was 8GB but I got one with 4GB all other features are ok. I wonder why is so", "Date": "January 8, 2014"}, {"Title": "NIce tablet for the price", "Author": "Mohammed shaik", "ReviewID": "R2YIRXV1KIWT8D", "Overall": "3.0", "Content": "I like this tablet screen resolution is great.sound is goodfront facing camera only 0.3 pixel not good for video callingi was looking for a tablet for video callingthis one does not fulfilled my requirement.", "Date": "January 7, 2014"}, {"Title": "Device malfunction", "Author": "Mandy Babcock", "ReviewID": "R9ERONWMJWPWA", "Overall": "1.0", "Content": "Failed to operate after 24 hours. Called manufacturer and they confirmed that the screen freezing and total failure to operate warranted replacement once issues were described. Abnormal response within device. On its way back now...", "Date": "January 4, 2014"}, {"Title": "Enjoying my tablet", "Author": "Amazon Customer", "ReviewID": "R3AHROR4R2A7IC", "Overall": "4.0", "Content": "I have only had my tablet 3 days! But I have found it easy to set up. Have down loaded several books and a couple of card games. Easy to read on I like that it is back lite so I can read at night.  My only question is why does it vibrate when I type , I can feel it in my hand that it vibrates when I hit  a letter. I compare this to the original Kindle FIRE. IT DOES ABOUT THE SAME THINGS.", "Date": "December 31, 2013"}, {"Title": "Work fine for my CamRanger", "Author": "Ken", "ReviewID": "R31G1MMOLHEAH4", "Overall": "4.0", "Content": "When I ordered this it stated that it held up to a 32GB  SD Card so I ordered one with it but when I got the unit it uses micro HD like a cell phone.  I kept the memory as it will work with other devices that I have but be sure to note that it uses only Micro HD.  Since I ordered it they have removed the \"uses SDHC Memory Cards\" from the description.", "Date": "December 28, 2013"}, {"Title": "great price", "Author": "celia thomson", "ReviewID": "R39WCMVZX9Z83Q", "Overall": "4.0", "Content": "Easy to use. Good features.My only suggestion is that for first time users,( I just replaced my notebook) I would like to have had a booklet with the available features and how to access apps etc.Sorry I am not a tech pro.:-)", "Date": "December 21, 2013"}, {"Title": "Nice tablet", "Author": "Lora Hoose", "ReviewID": "RHD2VM2U2PHOW", "Overall": "4.0", "Content": "Have had tablet a week. So far I think its great. The screen resolution is great too. I don't understand the negative reviews. It's better than the others I've used and taken back.", "Date": "December 11, 2013"}, {"Title": "Great tablet, for a great price", "Author": "Charlie W. Gorham", "ReviewID": "R2U9SFTSJFBEJJ", "Overall": "5.0", "Content": "This tablet is sleek, fast and more than I expected. I set it up in less than 5 minutes, put it on my home network and its all ready to go as a present for my significant other. I am well pleased with this purchase.", "Date": "December 9, 2013"}, {"Title": "Decent for the price range", "Author": "grantsaylor", "ReviewID": "R2GA8W6NJILXC9", "Overall": "5.0", "Content": "It's good for surfing the internet, light game playing, and movie watching. However, the screen is abysmal. It really could be better, however, for the price that this tablet is, I cant go comparing it to the Microsoft Surface, Apple iPad or Google Nexus. It's just not fair. For the price range and specs, this tablet is decent for anyone who wants a companion device to surf the web in bed or play games in the car, etc.", "Date": "December 6, 2013"}, {"Title": "Good value tablet", "Author": "TheMoose", "ReviewID": "R2WEP5G1M7JX7M", "Overall": "5.0", "Content": "This is at an excellent point on the price/performance curve.  Brack Friday deals had this as low as $69, but even at the $100 it usually sells for, I like what this tablet can do.  There are always trade offs, but this tablet offers good performance for the price.  Apps load quickly, it boots quickly, internet surfing is fast, plays internet video well.... I'm only running about 5 apps on the tablet right now, but I like what it does for me.", "Date": "December 5, 2013"}, {"Title": "It is what it is", "Author": "Yup", "ReviewID": "R2WO30SD08W4SY", "Overall": "3.0", "Content": "Specs were ambiguous at best, one major feature missing is GPS which was a deal breaker for me. I don't know why other reviewers had such a hard time with the charging/USB connector unless it is the fact that the entry slot is ill defined allowing you to partially insert the plug upside down. Also odd it would have a access door for a sim card and no card slot, Lenovo technical repair documents even show how to replace the sim card parts but none of their models come with that perhaps it was a future feature or never implemented. Also as noted by others many apps just don't work or pop error codes. Fits in your pocket??? Not unless your are wearing a field jacket even then it would be a tight fit. My main purpose was to use this as a remote for Google Chromecast which works OK it did seem to drop signal when used from the bedroom unlike my Acer A-200 tablet which only occasionally drops connection.", "Date": "December 7, 2013"}, {"Title": "WOW less then a month and the charger is broke.", "Author": "Aaron Gibson", "ReviewID": "R3OMME72NXUKYO", "Overall": "1.0", "Content": "Well i bought this for my niece and less then a month later the charger/usb port is broken and wont charge anymore. I come here and see all those terrible reviews. Man am i screwed on this. I suppose i should just buy a nexus!", "Date": "November 2, 2013"}, {"Title": "This thing works great", "Author": "Awsome!", "ReviewID": "R12PABSNO0TUQZ", "Overall": "4.0", "Content": "This little tablet is great for the price! I can search the web and do almost whatever I want with it. (Write a paper for school) etc. I recomend it if you want a tablet but don't want to pay high prices.", "Date": "October 26, 2013"}, {"Title": "Not bad.", "Author": "Sdv", "ReviewID": "R3KHY46UOY2SI5", "Overall": "3.0", "Content": "Ok for the price paid. It is small but more weight. Touch screen is also not that great. It has most of the features, at least what I require. Comparing to the price, it is satisfactory.", "Date": "October 19, 2013"}, {"Title": "Worst Christmas Present Ever!", "Author": "Toni @ My Book Addiction \"My Book Addiction\"", "ReviewID": "R2VUT2TW8PP0GI", "Overall": "1.0", "Content": "I bought this for my daughter for Christmas. She opened it this morning and it froze within a few hours. It will not respond to anything. I've tried holding the power button down to reboot it, it does nothing. I've tried hooking it up to my laptop to snap it out of whatever funk it's in.. nothing. So my daughter has a Christmas present she can't even use. Besides that, I've also noticed the power cord doesn't connect to the tablet very well. I will say that for the time it ran it seemed nice, but it does nobody any good to have a tablet that doesn't work. I will be returning this item.", "Date": "December 25, 2013"}, {"Title": "On par with the big brands", "Author": "Marlon Cox", "ReviewID": "R2BOJ67V04625C", "Overall": "5.0", "Content": "I will definitely consider thid tablet as a cheaper alternative to the samsung and other android tablets. Fine quality build, great sound and picture. I recommend this 100%. The only problem is I bought it as gift for girlfriend. I was angry i had to give it up. I will definitely be purchasing one for myself.", "Date": "January 20, 2014"}, {"Title": "Descent starter tablet...", "Author": "michael", "ReviewID": "R2229YS9DWWKPO", "Overall": "4.0", "Content": "The a1000 is pretty well rounded overall for the price and it does exactly what I need it to do...Facebook, emails, surfing the web, and games.  Please realize that it is NOT a fancy iPad or a kindle fire HD so yeah, but all in all I've had this tablet for about a week and no issues what so ever...oh yeah by the way it was shipped PRIME so it was delivered fast too, I hope this review helps aid people in choosing the right tablet that's on a tight budget like myself. Thanks for reading!!!", "Date": "December 4, 2013"}, {"Title": "I love this Lenovo", "Author": "Lucy Moreno Vera", "ReviewID": "R2LB87SW8CZKKJ", "Overall": "5.0", "Content": "I love this product...IS a very complete fabulous table, it works very well and is very well designed for me...", "Date": "June 3, 2014"}, {"Title": "Bought two, sent two back", "Author": "thornside", "ReviewID": "R23UOQSD2IW8Y7", "Overall": "2.0", "Content": "I bought two of these for my kids for Christmas and within 6 months I had to send each back to be repaired because they no longer would charge.  I've also had issues with a Lenovo laptop that I bought after only 3 months, which may not be germane to this review but does speak to their quality as a whole.So, I gave them two stars because the kids did really like them when they worked.", "Date": "May 27, 2014"}, {"Title": "Great item", "Author": "JP", "ReviewID": "R2AM2OY07GUD27", "Overall": "5.0", "Content": "Never used a tablet before. Didn't take long to catch on to it. Does everything I need it to do.", "Date": "May 20, 2014"}, {"Title": "Worked for a while", "Author": "TopBrony", "ReviewID": "R1KBOCMJ3C9ANI", "Overall": "4.0", "Content": "A great tablet for it's price. Worked for me until the charger had to be tilted up for the tablet to charge. Then it reset everything, and then It was charged all the way, and It would not turn on. Returned.", "Date": "March 10, 2014"}, {"Title": "Good Cheap Option !", "Author": "Patricio Ferrero \"Ciberducky\"", "ReviewID": "R1WA5URYGVWF47", "Overall": "3.0", "Content": "Not the best, but a good and \"cheap\" option.Nice quality, good image, touch works ok.Size and weight ok too.Good Luck", "Date": "March 7, 2014"}, {"Title": "Lenovo Ideatab", "Author": "Juan R.", "ReviewID": "R1BSQXYZHDFOI3", "Overall": "5.0", "Content": "It is one of the best prices for a great device. It has all the characteristics that a tablet needs. However, it has one disadvantage for me, it doesn`t have a rear camera, so it is very complicated when taking a photo. I love it , in spite of that disadvantage.", "Date": "March 6, 2014"}, {"Title": "Great Product, Great Support", "Author": "Todd Goepferd", "ReviewID": "R3AS40GAON3YLM", "Overall": "5.0", "Content": "The Lenovo Ideatab A1000 worked without issues out of the box ( 1/1/2014 ).  It connected to Wi-Fi easily and ran every app we tried ( mostly kid games ).  After 2 months, it would no longer charge unless the USB was plugged in and held at the right angle. I suspect this was caused more by rough handling that quality of the product.  Lenovo fixed it under warranty.  It was damaged during the return shipping and Lenovo replaced it with a new one.  I had no problem getting it fixed under warranty.  The tech walked me through some standard troubleshooting steps and then opened the RMA.  I paid the shipping to Texas and nothing more.", "Date": "March 6, 2014"}, {"Title": "Inexpensive, Memory Issues, but for the Price it is acceptable", "Author": "GAP", "ReviewID": "R1KH9IP0NJ4DPX", "Overall": "3.0", "Content": "I purchased this through Amazon Warehouse Deals.  The unit was clearly opened but otherwise like new as indicated on the website.  I have been looking for an electronic solution to handwriting in a notebook for work and having to retype notes.  Using handwriting apps on my phone is less than ideal.  My hope is that on a 7\" tablet it will become a great solution.The tablet looks and feels much like my Android phone but has a few minor differences and not all apps available on my phone can be installed on my tablet but most that I want are available.Memory usage is the biggest issue.  Although it has 8 GB of memory the important point I missed in the tech specs and did not appreciate until I started installing apps is that out of the box only 500MB is available for program storage.  Downloading the OTA (over the air) upgrade increased the internal memory to 1.5 GB.  First attempt at downloading the OTA upgrade took many hours and had to be resumed several times and when finally downloaded it did not work and I had to start over again.  My suggestion is if it takes more than 30 minutes to cancel the process, restart the tablet and try again.  Second attempt downloaded in under 30 minutes and performed the memory repartition successfully.My android phone has all 16 GB of internal memory available for apps, OS and storage so this is something unique to me and perhaps to this tablet.  Hopefully a future upgrade will unlock and repartition all of the memory for app and storage use.  Right now it is divided into Internal Storage and \"USB Storage\".  The later is a strange use of terminology as this memory is not from an external USB connection.  Nonetheless it is essentially RAM and Flash memory.  Some applications can be relocated to the USB/Flash memory which frees up much needed space but this is not an option for all apps.  My hope is for app makers to one day allow this option (moving to \"external storage\") any application or data cache that is not critical to the devices function.I am now on the hunt for a fine point capacitive stylus.  The typical ones you find online are blunt, rubbery tipped tools.All in all it may prove to be just what I need and, for the price I really can't complain.  Spending hundreds more was the alternative to overcoming this tablets shortcomings.Manual is only available as an online HTML manual but use of MS Internet Explorer and Word you can work around this and create your own.", "Date": "March 5, 2014"}, {"Title": "Good little tablet", "Author": "Mark Bleibtrey", "ReviewID": "R3K9Z11N3O4D5Z", "Overall": "3.0", "Content": "Nice tablet works good for my 6 year old daughter for youtube, browsing and easy applications. Only problem is the micro usb port doesn't charge well and it is hard to get it charging", "Date": "March 4, 2014"}, {"Title": "lenovo(used to be IBM back in the day)great product", "Author": "carlos izarra", "ReviewID": "R2W5Y901GZ902C", "Overall": "5.0", "Content": "nice tablet,easy to use... so far no problems with it... the screen is crispy clear...love it!good deal!!.. thank you", "Date": "March 3, 2014"}, {"Title": "very good for its price", "Author": "baldemar becerra", "ReviewID": "R1SPVE0PB5CP39", "Overall": "4.0", "Content": "the tablet is very nice has good finishes have good battery duration and the screen and sound are very acceptable, the only thing I can point against is that only brings front camera and the resolution is very poor the rest very well for under $ 100 .", "Date": "March 1, 2014"}, {"Title": "great tablet", "Author": "David", "ReviewID": "R3N6KS7N3P220P", "Overall": "5.0", "Content": "This item was purchased to be an access to the internet when my PC goes down. I thought I would try it out one day. I like it so much that I spend more time with it than I do with my PC .the only thing I find to be a problem is that it only has one camera. That is on the front of the device. Only good for selfies.", "Date": "March 1, 2014"}, {"Title": "good device.", "Author": "Moises Rodriguez", "ReviewID": "R3EYBGXGS4G872", "Overall": "5.0", "Content": "very useful for various functional activities. easy reading texts sometimes falls a bit when entering the menu but this very well.", "Date": "February 26, 2014"}, {"Title": "Good", "Author": "Randy", "ReviewID": "R3FWA3CY9FUWWN", "Overall": "4.0", "Content": "It is a good tablet o start off with.  I got it for my grand mother and she loves it.", "Date": "February 9, 2014"}, {"Title": "A present for a friend wheelchair bound", "Author": "Hannah Pynn", "ReviewID": "R3MKDR02724Z0U", "Overall": "5.0", "Content": "She loves it...does all that she needs to do without having to go roll over to her big computer!  Expectations continue to be in an upward direction!", "Date": "February 9, 2014"}, {"Title": "A greart tablet for the price.", "Author": "Whit Preston", "ReviewID": "R1FWYKDG7J89MA", "Overall": "4.0", "Content": "I initially purchased this tablet due to the price and although I have only had it for about a month, I have tremendously enjoyed everything that the gadget can do.  I do not have to have a lot of the bells and whistles, but I do like having the essentials.I have noticed that the performance with certain apps, such as Robot Unicorn Attack 2, have not been perfect.  However, video apps such as Netflix, work with very few problems.For the budget and practically minded, this tablet is a can't miss investment.", "Date": "February 4, 2014"}, {"Title": "Great", "Author": "Danise Brakeman", "ReviewID": "R3FLU5R7HBK5C1", "Overall": "5.0", "Content": "Great, inexpensive tablet.  I purchased this for my 11 year old and haven't been disappointed.  It hasn't given us any problems.", "Date": "February 2, 2014"}, {"Title": "Great tablet", "Author": "Donna Cremer \"Ms. Zajdel\"", "ReviewID": "R3A5EDOCVCTDJ8", "Overall": "5.0", "Content": "Love it, love it!  Great quality and design.  Size is very nice, easy to navigate and good construction.  Would buy again", "Date": "January 30, 2014"}, {"Title": "Great Choice", "Author": "Luis Roberto Lizano", "ReviewID": "R3Q75MMDUZB816", "Overall": "5.0", "Content": "it was a gift and it turned out to be a great choice, at an excellent price and service !", "Date": "January 28, 2014"}, {"Title": "Great item!", "Author": "Tracy", "ReviewID": "R1ZDPOX7JHT2S2", "Overall": "5.0", "Content": "We have 3 of these tablets in our family and they all work well. I did call Lenovo customer support and had little hold time and great customer service. (I had to call because I messed up) Great product at a great price. Thank you!!!", "Date": "January 27, 2014"}, {"Title": "So far so Good", "Author": "K James", "ReviewID": "RVB52W7PCNLHS", "Overall": "4.0", "Content": "I purchased this tablet on sale for around $75 for my 8 year old daughter as she has always wanted a tablet. She is really happy with it and so far there have been no problems. The colours are a little too bright but for the price I can't complain!", "Date": "January 24, 2014"}, {"Title": "Great for adults and kids", "Author": "Lars \"I got ya back\"", "ReviewID": "R31JLHB31N4X08", "Overall": "5.0", "Content": "I purchased this as a Christmas gift for my 9 year old and she loves it. I also have one for the past year without any problems. The one issue I use to have was the message \"battery overheating.\" However I figured out I was not fully charging the battery between usage. One I started doing that it has worked great.", "Date": "January 24, 2014"}, {"Title": "Exceeded my expectations!", "Author": "Bob", "ReviewID": "RH4XQ3GK6S5ZO", "Overall": "5.0", "Content": "I'm happy with the purchase. I bought 2 for my young kids so I had to go cheap. I also needed them to be of reasonable quality and functionality.  I chose the Lenovo because it met both of these requirements. They have exceeded my expectations in every way.", "Date": "January 23, 2014"}, {"Title": "Pads Pads Pads", "Author": "Trismegistus \"Trismegistus\"", "ReviewID": "R2CVIA8U23P2JF", "Overall": "4.0", "Content": "If you are reading these reviews you probably are in the market for a 7 inch tablet. In the past year or so I have purchased several different 7 inch tablets from Amazon, and I have read hundreds of reviews in making these purchases. I have purchased, and have or will review, the Asus Memopad HD for myself, and the Samsung Galaxy Tab 2, Asus Memopad, and this item, the Lenovo Ideatab A1000, from Amazon, for gifts, since I don't think anything you can buy in this price range makes as good a gift. I have also purchased the Dell Venue from Dell.Price notwithstanding I rank these tablets in this order:1. Dell Venue2. Asus Memopad HD3. Samsung Galaxy Tab 24. Asus Memopad/Lenovo Ideatab (tie)Before giving these as gifts I unpackage them and load some things on them to add to the gift, so I know what they do. The Galaxy Tab 2 would be #1 were it not for as of yet unresolved power issues. Any slight disruption of the proprietary charger or the plug you put it into on the machine will brick your machine. I wrote about this machine and this particular problem on that product page, and that problem seems to be a manufacturing defect. Otherwise the Tab 2 is the smoothest and best of the bunch. The Venue sits on top for specs alone, and as for performance it is right up there with the Tab 2. The Memopad HD is what I use now, and so far it has done everything well, with the occasional hiccup (common to all these tablets) probably more due to Android than the tab itself. It is not #1 because of specs inferior to the Venue, and because of the BLOATWARE you CANNOT remove unless you root your machine. Why companies continue to force this stuff down the throats of their customers for a few extra pennies is a mystery to me. While bloatware you cannot remove is a problem with all these devices, Dell has the least, and so also wins and those grounds.As far as performance goes, the Lenovo gets beat by the HD Memopad and the Dell, but not by much, especially considering the price difference. All in all my advice is to buy the least expensive one, especially if the differences in specs (like a 2nd camera and hd screen) are of little concern to you, but be aware of the power problems of the Galaxy Tab 2, and, if you're looking at this Lenovo, give a good long look to the Dell or Memopad line first, which I think for the price difference are the slightly better buys.I would be happy to answer any specific questions about any of these devices. I was looking for such a thing myself.", "Date": "January 22, 2014"}, {"Title": "very good product and brand new", "Author": "Jesús salvador pino ferrer", "ReviewID": "RVZDTZ3VKLHYK", "Overall": "5.0", "Content": "very good product, good packaging fast delivery, product is expected thank you very much. I am happy with purchase, recommend will not regret the investment made by", "Date": "January 21, 2014"}, {"Title": "excellent  Tablet.", "Author": "Kaiser", "ReviewID": "RBL7G8BP8NNS3", "Overall": "5.0", "Content": "The Battery  performance is very well.. and the 1024 lines for the screen high resolution. I really like lenovo tablets.", "Date": "January 20, 2014"}, {"Title": "There's no back camera...", "Author": "James", "ReviewID": "R3C3BUH033GBTK", "Overall": "3.0", "Content": "I had to return this item after discovering that it had no back camera -, so you can only take a \"selfie\"", "Date": "January 18, 2014"}, {"Title": "Great Tablet", "Author": "Frank Howrigan", "ReviewID": "R37DAK2XVE2MYW", "Overall": "5.0", "Content": "It was just what I expected; Its a great bedside tablet for checking new , weather, e-mail etc.  and I can read it with out my glasses.", "Date": "January 15, 2014"}, {"Title": "Works great", "Author": "James Bowers", "ReviewID": "R20L2NXV2GMYSQ", "Overall": "5.0", "Content": "This Lenovo works great for the kids, and even myself in a pinch.  Tablet is a little slow sometimes, compared to my $400 Samsung.  But that was my first and only tablet.  One other thing:  just after installing the first games for the games, the tbalet locked up, and need a hard reboot (have not been able to reproduce).  Kids love it,and it is very hardy, and takes a lot of abuse.", "Date": "January 15, 2014"}, {"Title": "Kids Love Them!!!", "Author": "derrick davis \"All Mighty Cellular\"", "ReviewID": "RI60277593SJT", "Overall": "4.0", "Content": "I purchased these tablets for my 2 teenage daughters for Christmas.They can hardly detach themselves from them.The tablets are more quality than I had expected but they are solidly built,comfortable to handle and handles all tasks efficiently without lagging or any other problems so far!", "Date": "January 11, 2014"}, {"Title": "Perfect little tablet", "Author": "Alex", "ReviewID": "R1GIU9LFT1AK3X", "Overall": "5.0", "Content": "Runs Netflix YouTube and video without a hitch and love the fact they switched the speakers to the front of the tablet! Also the sd slot is awesome expandable to 32gb", "Date": "January 11, 2014"}, {"Title": "A more compact ideatab to supplement my 10\" Ideatab A2109", "Author": "c woo", "ReviewID": "R31LNXKU91K3N", "Overall": "5.0", "Content": "I had a 10:Lenovo Ideatab A2109 that I loved. But as I sometimes used it for hours at a time, I felt that a smaller and lighter tablet would help.  Checked out several 7\" tablets including the Lenovo A1000 and the Samsung Galaxy.  During last year's Thanksgiving sale, I found a deal for a Lenovo A1000 that I could not resist - less than $90.This turned out to be a great buy. Easy to use, compact and light.  The bluetooth paired to my Arctic bluetooth earphones very nicely. The microSD slot is easily accesible, unlike the A2109 that had its microSD slot hidden under a metallic strip.  The only complaint - it does have a front camera but not a rear camera; but at its price I cannot expect everything.", "Date": "January 10, 2014"}, {"Title": "Loving It", "Author": "Mallory Reid", "ReviewID": "RI55RBNDXKPNX", "Overall": "5.0", "Content": "Great tablet for the price fast, Great sound, Good for videos works well with netflix. Had a cheap A-13 tablet that i got off of ebay for $60 lasted for 3 months then locked up. This tablet gives you more bang for your buck!!!!!", "Date": "January 10, 2014"}, {"Title": "lenovo ideatab", "Author": "Anne Yao", "ReviewID": "R1BK0SSJFUORRK", "Overall": "5.0", "Content": "ideal for a gift and for someone to play games and surf the internet.  Excellent tablet at an excellent price", "Date": "December 29, 2013"}, {"Title": "love, love, love!", "Author": "Michael W. Sprague", "ReviewID": "R3D4TP8P3YXMW4", "Overall": "5.0", "Content": "I love the resolution of the screen. I love the sensitivity to touch. I don't like the camera. I love the sound. it's great to read from. It's easy to use and load from the Play Store. If you buy one, you need to find where the reset button is.", "Date": "December 29, 2013"}, {"Title": "Great 1st tablet", "Author": "Jetted Out", "ReviewID": "R2CRG49IUVK7DW", "Overall": "5.0", "Content": "I got this for christmas and love it. It does not have an HD display but it is nice a clear. Front speakers sound good, has the ability for a micro SD card. cant beat $99", "Date": "December 27, 2013"}, {"Title": "Good", "Author": "xio", "ReviewID": "RMNTT1FBC2FAC", "Overall": "5.0", "Content": "This table is a dream, great, I love it, very nice as described, I am very pleased with this beautiful table.", "Date": "December 26, 2013"}, {"Title": "Very good", "Author": "Homero Acevedo", "ReviewID": "R267BZTBRXEFCD", "Overall": "5.0", "Content": "I bought this as a chrismast gift for my sons and they love it.Touch screen is very good and size is morr than enough for them", "Date": "December 26, 2013"}, {"Title": "Wow, what a pos.", "Author": "Justin", "ReviewID": "R1TT6JQIILW1SE", "Overall": "1.0", "Content": "This was one of the worst products that i have every gotten. It was a gift for a little girl who used it about a week, when suddenly it stopped working due to \"FLASH ERROR\". Warranty services was a joke and i can safely say that i will never buy anything from Lenovo in the future.", "Date": "September 27, 2013"}, {"Title": "Great Tablet for the price", "Author": "Bob Brown", "ReviewID": "R1DQMA63EZB0OR", "Overall": "5.0", "Content": "This Lenovo tablet has exceeded my expectations in all but one area. It booths faster then any of my previous 4 tablets, launches apps quickly, picture and sound quality are excellent, and the screen is highly responsive. The only problem I have is in loading applications, it continues to attempt to load them to the main memory, which is limited, even when directed to load to the internal 8gb or to the external 32gb sd. Then it refuses to let app2sd apps move them to either of the other resources. However this is only a mild irritant, as is great when giving presentations and lectures, as well as, getting information from the web when connected to wi-fi. It handles the 3 major book apps well, as some of the reference materials I need are sometimes only found at one source. It is very responsive to both Google play and the Amazon app store and downloads and installs quickly, even with the minor problem. I have no qualms in recommending it.Update 9/28/13 As stated by others with both the firmware and software updates, the earlier problem has been more than satisfactorily resolved. Others have stated they have difficulty with movies and I have found, as with other systems, it depends on the format the movies are in and the app you use to view them. I have a multitude of movies in digital format, that play with out any difficulty at all.", "Date": "September 24, 2013"}, {"Title": "works best in paper weight mode.", "Author": "joshua slocum", "ReviewID": "RPSPNWND4ADZW", "Overall": "1.0", "Content": "I received this tablet as a christmas gift. I was actually pretty excited I purchased a lenovo laptop for my wife 2 years ago and it's still running strong. So I thought to myself \"well its no nexus or samsung but hey Lenovo is a good brand\" well was I ever wrong! pretty much the only thing I could do with it was sometime play angry birds. If i browsed the internet or watched a youtube video I would get a low memory warning and it would force close. Well that was until it just quit force closing and then reset it self and now wont go past the boot screen. I like to consider myself pretty tech savvy and so I hopped on google and looked through the forums yeah that was a pretty much worthless as well. There is no support at all on this tablet. Think twice before getting this tablet. If your willing to spend the money on this go ahead and do your self a favor spend the extra $50 and go buy the asus memo.", "Date": "February 14, 2014"}, {"Title": "Does exactly what I need", "Author": "Christina R Williams", "ReviewID": "RCGRML7KDY3AG", "Overall": "5.0", "Content": "Other than being a little too heavy, this tablet is basically perfect. The sound is amazing, the screen resolution is great, and it handles all the games I throw at it.I've recommend this tablet to anyone looking to get one. When I upgrade to a larger tablet, for use more than just entertainment, I will be buying another Lenovo!", "Date": "December 30, 2013"}, {"Title": "Low Cost / Poor Screen", "Author": "David Hardin", "ReviewID": "R1RUQOOIDOGDIL", "Overall": "2.0", "Content": "Nice device if only it had a better screen.  Bought it super cheap as a door buster so it was worth the price because the kids like it.  The screen hurts my eyes though.I also bought a refurbished Microsoft Surface RT and it is a far better tablet and well worth the price difference; in some ways the Surface is better than my Apple iPad Air.  In no way does the Lenovo Ideatab compete with either of my other tablets.", "Date": "December 30, 2013"}, {"Title": "Stay Away!  Poorly Made Product, Service Even Worse!", "Author": "Peter J. Watkins", "ReviewID": "R1UZ83YQ41RIX8", "Overall": "1.0", "Content": "I paid for a tablet with 8GB of storage space, yet there's only 3.41GB available.  The cheap quality of the build is evidenced by the fact that the mini-USB charging cable cannot insert all the way into the tablet for charging.  It protrudes about 3/16\", making for a very tenuous connection that sometimes disconnects with the very slightest of movement.When I contacted LeNovo Customer Support, they initially stated that the fact that the tablet had only Half of the advertised memory was due to Amazon sending me the wrong item - until i sent them a photo of their box, labeled as an 8GB machine.  They otherwise made no apologies for the shoddy quality of the build, and begrudgingly offered to open an \"escalation\".  Nearly 3 weeks after having sent them the information they requested, I have yet to receive a response, not even to a follow-up email which I sent, requesting status.This tablet is cheaply-made junk, \"supported\" by non-existent customer service.  Stay away from this brand! Pay a few extra dollars and get something from a reputable company.", "Date": "January 19, 2014"}, {"Title": "she loves it", "Author": "o2cylinder", "ReviewID": "R3PFVQ0I2V9PEY", "Overall": "3.0", "Content": "I bought it for my daughter and she love it better than the first generation kindle fire but personally I don't know how good it is", "Date": "January 14, 2014"}, {"Title": "it's okay", "Author": "Nathalie Vasquez", "ReviewID": "RHOFHRVA0A3U0", "Overall": "3.0", "Content": "I'm still testing the product, this brand is good but I do not understand why certain abnormalities, hope is resolved", "Date": "January 2, 2014"}, {"Title": "For my purposes this purchase was a mistake", "Author": "C. Loucel \"loucelita\"", "ReviewID": "R2IK5BOW6ALTZ2", "Overall": "1.0", "Content": "I bought this just so I and my baby could skype \"for cheap\" during a 7-month trip away from my husband, but now I wish I had spent more money on a Samsung or Nexus.•Camera SHOWS EVERYTHING ORANGE, and will only display a good image once in a while for a few seconds.•Camera DOES NOT HAVE BRIGHTNESS ADAPTER (there is one in there, but the changes were so minimal, it was a joke), so we can only skype in a super bright room for him to see us. When it’s time to have the baby sleep, I have to turn the lights off and he’s left with no sound or image from us.•NO REAL MUTE OPTION, so when the baby falls asleep in my arms, I have no way of turning the volume all the way down, so the sounds of my husband keep waking him, and I have to ask him to please click \"mute\" on his side•With the low internal storage I have to restart the tablet almost every time I start a call.Now I am looking for another tablet and will have to spend way more than I had originally budgeted.", "Date": "November 23, 2013"}, {"Title": "Biggest POS and SquareTrade Extended warranty is a joke!!!", "Author": "Michael Brown", "ReviewID": "R3RACV5TDJWUYZ", "Overall": "1.0", "Content": "Had purchased two of these tablets and in less than a month the usb charge port started to have a loose connection when charging, and eventually failed completely in less than a week later.Contacted Amazon and they referred me to Lenovo and SquareTrade. SquareTrade customer service was horrendous and unprofessional, the noise of women in the background laughing and talking loudly over the person I was talking to and then was pushed through to 4 other persons, only to get the last person saying Im sorry and don't know how to help you and to call Lenovo if you want repaired.Lenovo I got shifted around 3 time before ending up with the correct dept. only to find that they can not help me due to no Serial number to be located on the external of the tablet(cant charge so I can't look at the inside of the device). The tablets both have the FCC/UL label with model etc but NO Serial Number.Basically.....I got lemon tablets, will NEVER buy extended warranty from a 3rd party, will NEVER buy a Lenovo product again.I never vent like this in a review but my time is more valuable than playing games and doing a chase game to get these repaired. I just through them both in my office trashcan just now!!!!off to buy two Samsung tablets at my local best buy!!!!!! F You Lenovo and SquareTrade!", "Date": "February 27, 2014"}, {"Title": "nice and good price", "Author": "skylar furr", "ReviewID": "R3UVVUVU8GZUVT", "Overall": "4.0", "Content": "Nice cheap tablet perfect for browsing the web and playing games on,has good picture and sound. Battery could last longer", "Date": "September 18, 2013"}, {"Title": "Buenas calidad, el sonido es bueno para niños genial / Good quality, the sound is good for kids great", "Author": "Oscar Venezuela", "ReviewID": "R6YSXX2K5NZW8", "Overall": "5.0", "Content": "Compre el articulo para mis niñas que estan disfrutando de la capacidad de estas tabletas, el sistema operativo es estable, aunque la camara creo que casi todas dejan mucho por desear, la calidad de video es buena, solo faltaria instalar juegos que es realmente donde uno puede determinar la capacidad entre los graficos, sonidos y velocidad. Buena opcion recomendada a quienes la quieran traer al Venezuela.Buy item for my girls who are enjoying the ability of these tablets, the OS is stable, but the camera I think almost all leave much to be desired, the video quality is good, just be wanting to install games that is really where one can determine the capacitance between the graphics, sounds and speed. Good option recommended to those who want to bring to Venezuela.", "Date": "October 7, 2013"}, {"Title": "Not what I had in mind", "Author": "melvingilner", "ReviewID": "R19VL69GFTILY1", "Overall": "1.0", "Content": "It only had 4gb not 8 as advertised and only 4gb ram decided to keep it anyway did not want Togo through return again", "Date": "March 19, 2014"}, {"Title": "latest technologies to wifi anyplace including home", "Author": "Willie Lynn Roberts", "ReviewID": "R327N0NPYOWBD8", "Overall": "5.0", "Content": "eliminate trips to public libraries except for prints. universal wifi including home & spread this & other reasonable offers to relatives & f4iends for prices i paid for.", "Date": "March 16, 2014"}, {"Title": "Loving this tablet", "Author": "ann smith", "ReviewID": "R3JCI9BJN52LBA", "Overall": "4.0", "Content": "Brought it like two weeks ago. Only one little problem, the camera  quality is poor. Still feeling my way around it. Lets see.", "Date": "March 9, 2014"}, {"Title": "THE CAMERA DOES NOT WORK, whatever you focus SEEN A BLACK SILHOUETTE.", "Author": "Niurka Cabrera", "ReviewID": "R69M80G9ILPM2", "Overall": "2.0", "Content": "I BUY THIS TABLET BUT THE CAMERA DOES NOT WORK, whatever you focus SEEN A BLACK SILHOUETTE. IS ECONOMIC PRICE, BUT I DO NOT KNOW IF IT IS A FACTORY PROBLEM, AND ALL HAVE THAT PROBLEM WITH THE CAMERA. I'M REALLY NOT SATISFIED.WHO CAN TELL ME ABOUT IT?", "Date": "December 27, 2013"}, {"Title": "This model do not have a rear camera but Amazon mention incorrectly", "Author": "mohammed javed", "ReviewID": "R3D0D6VB4Y9QXY", "Overall": "1.0", "Content": "This model do not have a rear camera but Amazon mention incorrectly, please refer Lenovo site for this model for confirmation.As I had it only for a 1 day, i cannot comment on the performance.", "Date": "December 23, 2013"}, {"Title": "5 stars for it's price", "Author": "Edel Lopez \"EL\"", "ReviewID": "R1H1BEOSM4I0KW", "Overall": "5.0", "Content": "Just bought it as mi daughter's first tablet.The cpu is fast enough if you don't absolutely need the latest quad core processor; The camera is just for web video, not for pictures; for video it's playback is very good on it's screen and has two speakers in the front (this is great, you have no idea what difference this makes); Space it's only 8gb but with a micro SD slot you can increase it to 32 gb; And you can easily get it for around $100 now (mid 2013).For it's price you can't ask for more.", "Date": "August 22, 2013"}, {"Title": "not turn the tablet", "Author": "JAIMAR MENDOZA", "ReviewID": "RN8YWGZVHD1L3", "Overall": "1.0", "Content": "I put a lot of time to load and no turns, I'm worriedI wonder if you have international warranty", "Date": "January 10, 2014"}, {"Title": "Very Dissatisfied", "Author": "Mordechai Mandell", "ReviewID": "R1EVI1SFAHSX77", "Overall": "1.0", "Content": "I purchased this tablet solely to use the Night Sky Lite app.  I spent about two hours on the phone with Lenovo customer service.  In the end, the app did not work so I returned the tablet.", "Date": "December 30, 2013"}, {"Title": "The problem with the tablet", "Author": "zenaida valera", "ReviewID": "RLREB2BB8CE6H", "Overall": "1.0", "Content": "Dear Amazon.com,I bought a Tablet in September, 10 2013,  with following description:• Lenovo Ideatab A1000 7-Inch 8GB Tablet (Black)The Tablet was a Christmas gift, when I gave the gift to my daughter, the product did not work and It isn't new.This situation was very obnoxious, I wonder how we can resolve this situation:  Do I send the tablet? Can you change it? or can you return the money ?.  I would like to know what is the solution?.I am awaiting a response.Thank a lot.Best regards", "Date": "January 16, 2014"}, {"Title": "Do not buy at any Price!", "Author": "Frank Fell", "ReviewID": "R1NZCH3YV7T84J", "Overall": "1.0", "Content": "I bought an a2107a tablet for about $145 about 4 months ago. I purchased it because it was cheap and I have a Lenovo desktop computer that is a fine product, reliable and a very good value.This is a tablet that represents a failed try by Lenovo to enter the market with a compromised and unsatisfactory device. I would not repurchase if it cost $20! My experience with this tablet also makes me seriously question the wisdom of buying another electronic device from Lenovo.The performance of the A2107A is adequate. It's not fast, but it isn't very slow either. It is running Android 4.0, and will never be upgraded unless it is rooted and you install a new o/s.Where its defects are very apparent is with the included features (or, more specifically the advertised features that don't work). Lenovo lists features such as GPS and Bluetooth.What you discover about the GPS is that it works only if connected to the internet with WiFi or 3G service. Since the US version cannot get a mobile net 3G connection, that leave GPS capability only through WiFi. I don't often drive where there is a continuous WiFi connection. This device should never list GPS in its specifications.How about Blue tooth? Well I see it listed as a function under system settings, it can be turned on and off, it can even search for a Bluetooth device connection. So, what's the problem? Well, according to the User's manual (which does not come with the new tablet) only Lenovo approved Bluetooth devices can connect. And, what are those Lenovo approved devices? The manual doesn't have a list and apparently, you're on your own. I couldn't get either a keyboard or my lovely Panasonic speakers to connect.My problems with the features of this tablet are symptomatic of the problems of a device sold in different iterations of the device sold in different countries. You can go mad trying to discover information about your version, trapped in contradictions and with no help from the Lenovo website, which has good intentions but little or no germane information.The bottom line is that Lenovo will release an inferior product and I don't believe that Samsung or Google would", "Date": "October 9, 2013"}, {"Title": "No 8 GB very very disappointed", "Author": "Chris Franz", "ReviewID": "R2UAO6UOKRPGF7", "Overall": "1.0", "Content": "Says 8GB but its only 2GB you need a computer to get the other 6GBNo 8 GB very very disappointed.  Will never buy from Lenova or Amazon again!", "Date": "February 7, 2014"}, {"Title": "Not worth it", "Author": "Gaddafi Innusah", "ReviewID": "R1XF5G5DNJ8RFF", "Overall": "2.0", "Content": "I bought it because when I checked the picture displayed I thought it could use data connection as well since it had a slot on both sides and I also read a review somewhere and they said it uses HSPDA or something like that. To my surprise when I bought, it wasn't true.The second is that, the resolution is very POOR! Although it is quite slim I will never recommend this to anybody. The speakers they boast of is not so different from the other brands so I don't see anything unique about this piece.Just add a little and get something better instead of this.", "Date": "August 26, 2013"}, {"Title": "Great for the price", "Author": "nice", "ReviewID": "RKK04VK6RFEC9", "Overall": "4.0", "Content": "I bought these for 75 bucks on black friday for my 5 and 7 year old. Both kids love them for books and games. The camera blows. but it's a 75 dollar tablet what do you want? The tablets are zippy and have no problems playing any games or audio books.", "Date": "January 3, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CRXZPA8"}}