{"Reviews": [{"Title": "Works just fine", "Author": "M. Pate \"Psalm23\"", "ReviewID": "R2SBRMF6UIQPK0", "Overall": "4.0", "Content": "I use it to watch movies. It starts to slow down when the battery is low. I cant read my emails when I log into my email. It someone how freezes when I get into email. The picture quality is okay.", "Date": "October 29, 2013"}, {"Title": "Garbage!", "Author": "Randy Sevilla", "ReviewID": "R1AIKLWSSUSV21", "Overall": "1.0", "Content": "From the first five minutes of using this product, it stopped working.  Even after charging the battery and trying to use it, the screen continued to freeze up.  It has completely stopped working and now I have to try to return it through a website from which I purchased it from.  After reading up on many reviews of this particular tablet, there seemed to be a hundred complaints all related to the same problems I have experienced.  Very, very disappointed with this tablet.", "Date": "December 26, 2013"}, {"Title": "My son loves this!!!!", "Author": "Dodie", "ReviewID": "RB3HYVDXUVGQB", "Overall": "5.0", "Content": "My dad got this for my 7 year old son he loves it and we have had ZERO problems as of yet......", "Date": "October 9, 2013"}, {"Title": "Not for adults", "Author": "Ruben Rosado", "ReviewID": "R1QTK4DE9NPHI2", "Overall": "1.0", "Content": "Honestly, I am seriously disappointed in the quality of this device. Just because it's backed with an Android OS doesn't mean it is a quality product. I know, I shouldn't expect much from a tablet that costs under $100, but I don't care. It's still $100 and it should be a good product. I also should have reviewed the technical specs first.• 1.2GHz Cortex A8 CPU• Android 4.0 OS (Ice Cream Sandwich)• Capacitive 9\" touchscreen display with 800 x 480 resolution  [the resolution is horrible]• 8GB internal memory—MicroSD card expandable to 32GB (card not included)• 512MB RAM [With the density of the programs we use today, it's just so slooooow]• 0.3MP front camera and 2MP rear camera• Built-in microphone• Network: Wi-Fi 802.11 b/g/n• Built-in lithium-ion battery—4200mAh for continuous use for up to 6 hours• Supports 3G USB-dongle• Measures 11.81\" x 7.87\" x 2.76\"• I/O ports: 1 Mini-USB port and 1 TF-Card (32GB max.)I think this is OK for kids, because they don't know any better and probably don't care.", "Date": "December 19, 2013"}, {"Title": "Garbage!!!", "Author": "Shawnie", "ReviewID": "R1JKBT8W8BQB8L", "Overall": "1.0", "Content": "I bought this tablet for my 4 year old and three days later it's not working. Initially, the screen froze and it took a full day to get a full charge on the battery. Day three, the screen no longer works and it will not reset or shut off. Hopefully, the battery dies soon. I am returning thus ASAP!!", "Date": "December 28, 2013"}, {"Title": "Piece of Junk!", "Author": "John Todd", "ReviewID": "R139HZ2L6HHSWI", "Overall": "1.0", "Content": "I'm not even sure this tablet deserves 1 star.  Normally i would go with the famous \"you get what you pay for\" saying, but this thing isn't even worth $20.  It is so slow to operate, that it borderlines being unuseable.  It times out and freezes up constantly, and because it runs so slow, your battery life runs out much sooner than the stated 4.5 hrs.  Even for the low price, this tablet is very disappointing.  Save your money, and spend it on something that actually works.Now a month after having this, i find out the headphone jack doesn't work correctly.  I can only plug the headphones in about 1/3 of the way to get sound.  I would seriously return this right now, if the website i bought it off of didn't make it so complicated.  (It was not purchased on Amazon.)  This thing is seriously just a plastic paper weight, and it runs at about 1/10 the speed of my iphone 5, if i'm lucky.", "Date": "December 22, 2013"}, {"Title": "DO NOT WASTE YOUR MONEY !!!", "Author": "asgiii", "ReviewID": "R1UFPKLT0CWZWR", "Overall": "1.0", "Content": "Received as a Christmas gift. Play Store doesn't  allow to download apps, customer service is non existent, errors galore  and \"support page\" always displays \"browser time has run out\".. Please take my word....  DO NOT BUY!", "Date": "December 31, 2013"}, {"Title": "New OS", "Author": "Glennda Luhrs", "ReviewID": "R3FQ6PY080W2CI", "Overall": "4.0", "Content": "I did have a little trouble learning a new OS but after I did get on line I have had no trouble and I have even drop it few times.", "Date": "February 3, 2014"}, {"Title": "Disappointed at the deceptive color.", "Author": "Mark McGinnis", "ReviewID": "R2EJMB45D64AQ1", "Overall": "3.0", "Content": "I was VERY disappointed to discover that the back of the product was white and the front was black.  From the ad there is nothing to indicate that it was white on the back.  If I wanted a white tablet, I would have wanted it all white, not looking like an ugly penguin.", "Date": "September 10, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00COXAG1Y"}}