{"Reviews": [{"Title": "Mixed Bag", "Author": "Me2", "ReviewID": "R2912NOVYFHOUO", "Overall": "4.0", "Content": "Good- Nice clean IPS display, light weight and about 8hrs of battery life.Bad- Windows 8 desktop is still hard to navigate on touch. Still could be in a smaller form factor. Out of the box the desktop won't move due to windows 8 areo weighing the system down. That's the minus one star.Atom is a good processor, but windows will weigh it down to a crawl. After, I disabled the visual effects the system ran just fine. Most users don't want to deal with this hassle and expect it to run smooth out of the box and they should!!This tablet can run lightroom v4 and elements 11 at decent speeds. I was surprised and pleased with that, but that was only after I disabled the (areo) visual effect in windows.I bought this for my windows programs and I can do real work on this system.The system is about 3 times faster than my acer w500 which couldn't run elements.", "Date": "August 8, 2013"}, {"Title": "Great Product - Tablet with Laptop options", "Author": "AA", "ReviewID": "R1YGYFAOI6PEWP", "Overall": "5.0", "Content": "Its a good buy. Cool Tablet and allows many Windows 8 functions that regular lapop provides.I was able to run citrix client to remote access my office desktop.", "Date": "August 2, 2013"}, {"Title": "Not as many pros as cons...", "Author": "Sarah Nelson", "ReviewID": "R3BDJEDXX8FF4L", "Overall": "2.0", "Content": "This tablet was purchased as a gift for my grandfather.  He has good familiarity with touch screens but wanted a Windows-based tablet rather than an iPad to use a few different programs for his business.  He uses it primarily for an on-the-road tablet.Pros:Long battery life.  Usually lasts about 6-8 hours.The display is bright.I like the keyboard/case combination.You can up the RAM to make it run faster.You can switch from Windows 8 to an actual Windows 7 Desktop (by far the best feature).Cons:Screen lag is very noticeable when you switch from using this tablet to an iPad.The tablet seems to run slowly at times.Windows 8 is clunky and not my cup of tea.  I may like it on a desktop, but it is difficult to navigate via touch screen (despite that being the purpose behind Windows 8...)Booting up often takes several minutes.Applications often load slowly.After having this for a month or so, my grandfather wanted to sell it and get an iPad, saying he would rather do his other work on his desktop computer as this tablet runs extremely slow.  Unfortunately, after several attempts to sell on eBay, no one is even interested in buying it.  Avoid this tablet and keep on searching!", "Date": "January 14, 2014"}, {"Title": "got it as a X-mass gift", "Author": "vince", "ReviewID": "R3PICZQE6Z5ESJ", "Overall": "5.0", "Content": "At first i thought the Intel Atom was going to be slow, but it isn't. I use this tablet at work for RDC and on the road for problems. its much nicer than taking my massive laptop around. when i got mine i took all the ad on off and only loaded my things. works great but remember its not a beast. its a tablet. for what it is i couldn't be happier", "Date": "December 26, 2013"}, {"Title": "Buyer Beware!", "Author": "Robert H. Kurz", "ReviewID": "R3GKYXJZFYGQEU", "Overall": "1.0", "Content": "TecMonkey does not stand behind their products and it they fail past 30 days - there is no recourse. Purchased two Lenova desktops, the monitor went out after 90 days and they refused an solution.", "Date": "May 8, 2014"}, {"Title": "great value for a windows tablet", "Author": "Erica Coughlin-Glaser", "ReviewID": "R1LMIGV8XRHFD9", "Overall": "4.0", "Content": "Sometimes you just don't need the super high power and cost of a Microsoft Surface 2.  This tablet is about the same size but with a lower power chip.  It can be charged and have a USB device attached at the same time which many tablets cannot.  I haven't tried running photoshop on it, but I didn't buy it for that. It runs the old Windows programs I need it too, and is speedy and responsive for web and streaming video.", "Date": "April 9, 2014"}, {"Title": "Great tablet! Gets so much done and browses on the fly!", "Author": "Kmac", "ReviewID": "R1Y3WQNHYQHZWU", "Overall": "5.0", "Content": "I love how quick the tablet is and the touchscreen is so responsive!The processor is wicked fast and this gets everything that I want done and runs great when I am on the web.Plenty of storage and the battery lasts for much longer than I imagined.Would recommend this to others!", "Date": "March 13, 2014"}, {"Title": "Slow", "Author": "Amazon Customer", "ReviewID": "RYH9LKR5M9FON", "Overall": "2.0", "Content": "The tablet ran very slow and had issues with wifi. Called Lenovo support and they were jot very helpful, not worth the speed issues.", "Date": "February 18, 2014"}, {"Title": "a few changes & you will Love it", "Author": "Kenh47", "ReviewID": "RYY1WP2MSBHGW", "Overall": "4.0", "Content": "I have had since Dec 2013. Regarding the slowness issue, this shipped with McAfee or Norton (I don't remember which) suite. Uninstall this. Windows 8 includes it's own antivirus. update to Windows 8.1. If you didn't get a keyboard case with the computer get one and a bluetooth mouse.Removing the duplicate anti-virus and installing windows 8.1 will greatly improve your speed. This is still a tablet, not a gaming machine, but for normal business functions, it now makes a wonderful road computer.  If you want to read a book, or other tablet friendly functions, it will work great. The windows app store is quite lacking compared to the android store, but if you want real windows functions, in a very portable format, Enjoy.  This model has now been replaced, so this is just an attempt to set the record straight on what I believe to be a nice machine.", "Date": "March 12, 2014"}, {"Title": "Slow, laggy and defective WiFi", "Author": "Bee", "ReviewID": "R1MVGGDASKDRG7", "Overall": "1.0", "Content": "This tablet is NOT worth $500.  If this was priced at $350, I would still probably give it 2 stars.If you don't plan on constantly using a wireless keyboard with this device, avoid Windows and go with Android tablet.Also, bluetooth audio seems to be faulty with windows right now where you have to manually unpair and re-pair the device despite it being connected from previous pairing.Mine also had defective wifi which would only go up to 1.5 mbps on a 55 mbps connection.Lastly, it uses traditional AC charge unlike microUSB like most of tablets do now days.Lenovo's ideapad line is rather disappointing including this tablet.  I'm returning mine.I'm still a fan of the thinkpad line though.", "Date": "August 11, 2013"}], "ProductInfo": {"Price": "$449.99", "Features": "Windows 8, 10.1 inches Display\nIntel Atom Z2760 1.8 GHz Processor\n64 GB Flash Memory, 2 GB RAM Memory\n8-hour battery life, 1.3 pounds", "Name": "Lenovo IdeaPad Miix 10.1-Inch 64GB Tablet (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41DswSXlqvL._SX300_.jpg", "ProductID": "B00CRXZPAS"}}