{"Reviews": [{"Title": "Wrong item false advertising", "Author": "Mr.pinder", "ReviewID": "R1RQY87GN8J0XI", "Overall": "1.0", "Content": "I thought i was buying a 7\" inch tablet but i got a no name cheap netbook it looks like a toy i'm very upset...", "Date": "July 26, 2013"}, {"Title": "Not the best tablet out there.", "Author": "doctari", "ReviewID": "R24SZM4GQ2COGW", "Overall": "3.0", "Content": "I guess you get what you pay for with this tablet, and good luck finding drivers for it as it's VERY generic.  WiFi reception is pretty weak too so make sure you're close to your router..;)", "Date": "July 2, 2013"}, {"Title": "Not too good", "Author": "Michael", "ReviewID": "R28U5TER585ZST", "Overall": "3.0", "Content": "I bought one of these tablets. The Wi-Fi is weak, even in the same room as the router. There also is no way that I have found to upgrade the OS. The touch sensitivity on the screen is so sensitive that you just have to get close to the letter, and most the time you get double letters. It works ok to watch youtube videos, and check email, but not much else.", "Date": "October 5, 2013"}, {"Title": "EXCELLENT PRODUCT AND 5 STAR CUSTOMER SERVICE.", "Author": "desiree dopwell", "ReviewID": "R2I8BDVJKROXF2", "Overall": "5.0", "Content": "The product is excellent for the kids. As for customer service i cannot describe how excellent his service was. I would recommended this product and seller to anyone. I AM PLEASEDDDDDDDDD!!!!!! Thanks goldengulf.", "Date": "December 10, 2013"}, {"Title": "Not worth the money", "Author": "Al M. Green \"Skuly22\"", "ReviewID": "R2GBUOPFGN0PJW", "Overall": "1.0", "Content": "This item would freeze repeatedly and only lated a whole three months before it refused to work still all. I say save your money and buy areal tablet cause this was simply annoying.", "Date": "February 21, 2014"}], "ProductInfo": {"Price": "$78.00", "Features": "keyboard included(free)\nwhite, black, red, pink available\n100% new, unused, unopened and undamaged item in original retail packaging\nGoogle Android V4.0.3 Ice Cream Sandwich\nEmail me what color do you like", "Name": "7\" dual camera Capacitive Google Android A13 MID WIFI PAD Tablet PC Netbook Notebook 4GB WT", "ImgURL": "http://ecx.images-amazon.com/images/I/51gnQn2MBGL._SX300_.jpg", "ProductID": "B00CAK9PKE"}}