{"Reviews": [{"Title": "Asus Memo pad", "Author": "Joseph Schell", "ReviewID": "R2EHKX4D5SOMWY", "Overall": "5.0", "Content": "Had a 7'' Airpad that died. It had a usb port, hdmi, but limited memory. Liked the features it had but after using a while found I mainly used it for email, games, and keeping to do lists, shopping lists etc. Decided I didn't need Hdmi since Netflix works wonderful wih this pad and the display is comfortable to watch a movie on. Bought this one for my wife as a gift after using my Asus Memo pad for a couple months. Opted for this Asus Memo due to more memory and a better quality  unit. Music sounds awesome on this with earbuds or Bose headphones.", "Date": "November 1, 2013"}, {"Title": "Great tablet", "Author": "Scott Abbott", "ReviewID": "R26MTYS1PQEJD8", "Overall": "5.0", "Content": "I have family that have galaxy tab 2 and even they would rather have the Asus memo pad over what they have.", "Date": "October 24, 2013"}, {"Title": "I love my ASUS MeMO pad!", "Author": "Uilani Gomez", "ReviewID": "R27TL0AUC4OMKC", "Overall": "4.0", "Content": "I am enjoying it.  It is meeting all my expectations.  And for the cost, it's a great deal.  I would recommend this tablet for first time users or for someone that's just looking for simple, no hassle entertainment.", "Date": "October 10, 2013"}, {"Title": "Excelent tablet", "Author": "edward vinkler", "ReviewID": "R1ZW0IYO4N683G", "Overall": "5.0", "Content": "I am no computer or tablet wiz by no means but this tablet will do everything myself and my wife can throw atit. Web surfing, pictures,games, word processing functions. If your looking for a solid great tablet this is it!", "Date": "January 6, 2014"}, {"Title": "Asus MeMo Pad", "Author": "Edwena", "ReviewID": "R2B01I71FOSEW", "Overall": "5.0", "Content": "Purchased this item as a gift and the user is extremely satisfied with the product.  She is an older adult and uses it in her evening classes.  She has limited technology knowledge but has been able to maneuver this very quickly.", "Date": "December 26, 2013"}, {"Title": "Value for the Money", "Author": "Chandima Peiris", "ReviewID": "R13O3L0WHJN0CD", "Overall": "5.0", "Content": "Bought 3 of ASUS memo Pads for my kids. They are using it every day without any problems. Great buy for me.", "Date": "October 31, 2013"}, {"Title": "Short battery life", "Author": "A Good Girl", "ReviewID": "R3GQRQOJJ9JBCG", "Overall": "3.0", "Content": "Short battery life otherwise works great when plugged in.  Not much to say otherwise just like a giant cell phone", "Date": "October 25, 2013"}, {"Title": "not good", "Author": "Surjit Singh Purewal", "ReviewID": "R1JTIPCMGP93WL", "Overall": "1.0", "Content": "very slow to turn on and freeze so quickly !!!! no Buenos. Not satisfied, so had to return it. d", "Date": "December 2, 2013"}, {"Title": "Great Tablet for small price", "Author": "Ashly MacGregor", "ReviewID": "RK7NDZL4K9UP", "Overall": "5.0", "Content": "You looking for a good 7\" tablet, this ones it, the only thing I'm not able to do with it is play Sims Freeplay.", "Date": "September 27, 2013"}, {"Title": "If I could give it 0 stars....", "Author": "Slenderman", "ReviewID": "RZW0OVKF1241C", "Overall": "1.0", "Content": "I bought mine somewhere else, at Sam's Club, and can I tell you, it is very bad!I tried so hard to like this thing, and it just didn't work.Let's make a list first...Pros:AndroidEasy to useCheap32 GBCons:Where do I start...?Slow to respondSlow to wake upSlow to auto rotateSlow to downloadWas lied to about the battery life (try two to three hours, not six)Charger is crapChrome on this thing is crapBrowser is crapDownloading apps is crap. Most freeze for no reasonOnly had white??? Really???Auto-Syncs every three HOURSDebug it, and BAM. You have to factory reset or it won't work at all. No matter how many times you shut off the debugging.You-Tube on Chrome?! Impossible!Drop Box?! Impossible!Pou?! Yeah right! It freezes as soon as you shut the lights off!Fastnote?! The whole app just blows up!CRASHES TO THE MAX!Crashes almost EVERY app!The menu at the bottom always seems DEAD because it ALWAYS CRASHES!A good tablet for six month old baby, yeah. But me? No way.I couldn't believe how upset this thing actually made me. I tried so hard to make it work, and it just didn't. I had it since August, I put up with it for that long. It's obvious, that just because it's cheap, doesn't mean it's good. (But I refuse to buy an iPad, worth the same amount as a BRAND NEW desktop PC!)I pressed debug and it no longer connects to the computer, refuses to sync sometimes, if syncing was ever good. So, I had to factory reset the whole thing. Oh, yeah. And when you press Factory Reset, it won't reset! You have to download some other software just to get it to reset itself! So, yeah, I reset it. It took all my apps with it. NO problem, because I backed up the entire thing. I click restore on the backup, asks for password. NO PROBLEM. I set one earlier. And then suddenly, THAT AIN'T THE RIGHT PASSWORD! AND, just to kick more sand in my eyes, there is NO password recovery! So, I had to re-install all the apps all over again! I tried so hard NOT to get upset! AND I DIDN'T! I wanted to LIKE this thing!Oh, yeah! There's more!So, life's good, for now, as I sit here trying to cope with the lost of all my apps. I'm so scared to download anything, all I do is download three apps. MY other siblings have them, so I know they aren't bad apps! Suddenly, the whole tablet shuts down when I try to disable the sound on the Google keyboard. I turn the STUPID thing back on it starts to tell me it's encrypting! I didn't set it to encrypt! I wasn't even IN the security settings (I was in the LANGUAGE AND INPUT settings!) So, of course, I shut it back off. I turn it back on it shoots me something like, \"Encryption was a failure, your tablet is no longer accessible. You HAVE to factory reset.\" Of course, I didn't want to, but I honestly CAN NOT do anything else unless I reset it! OF COURSE I'm mad as you know what! Of course I WANT to return it! BUT (OF COURSE) I CAN NOT return it because it's WAY past 30 days over due!IF this thing was trying to give me a heart attack, it ALMOST worked! ALMOST! But I can tell you this, it AIN'T Android! MY whole family has Android tablets! And not ONCE have I heard them complain about theirs! I just don't have the slightest CLUE why they would make such a product like this, KNOWING all their other ones are okay! Maybe it's just me! But I doubt it since I've grown up with electronics, and half of my family have COLLEGE EXPERIENCE in electronics AND software INCLUDING me!The sad part? I bought this tablet to use for college to take NOTES! I should have known when it couldn't even handle note taking it was a dud!So, If I could give it zero stars, or even throw it back to their facility, then I would!DO NOT BUY THIS! It tries so hard to give you a heart attack!!!!", "Date": "January 6, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CWHI5M4"}}