{"Reviews": [{"Author": "Kindle Customer \"kc\"", "ReviewID": "R38KPCT8XVQVRB", "Overall": "1.0", "Content": "I originally purchased this tablet a few months ago and it was definitely worth the price.  I purchased another one because of the quality of the product.  It is defective.  The USB port will not hold the charge at all.  I would not purchase this again.", "Title": "Problem with USB port", "Date": "January 24, 2013"}, {"Author": "Lomak", "ReviewID": "R26F5FGCKOWH6V", "Overall": "4.0", "Content": "I got this tablet for my daughter she is always trying to balance 3 children and her huge laptop on her lap all at once, she loves her android phone but it is a little too small, this tablet was just the right choice for her, she can text and video call , so our out of state family can see the kids, it is also a real bargain for the price so I went back to engine 29 through Amazon and purchased 2 more, one for me and one for a good friend. I'm excited about this tablet because it's portable and functions great plus the color choices are a bonus, it's a nice gift at an affordable price, I've tried shopping  other online stores but Amazon is my favorite because I haven't had to send anything back everything I have purchased has worked great! I would have given it 5 stars but I haven't had it that long and I'm waiting to see how it holds up to my grandchildren before giving it a perfect score :-)", "Title": "Zeepad android 7 inch tablet", "Date": "December 9, 2012"}, {"Author": "Vanessa Elyse Benitez", "ReviewID": "R148MJESIQROV3", "Overall": "1.0", "Content": "I do not see updated shipping information for my zeepads, even though I was told by Ryan S. at engine 29 that he would re-ship expeditiously on Monday, December 24th, 2012 priority mail. I hate to say it, but if not for the few positive reviews this smells of a scam. I am almost doubtful the positive reviews are real. I'm also kind of ticked that when looking at product reviews all you see is the positive. Where were all the negative seller reviews when I was searching? I looked on the product reviews today and the majority of the reviews are positive with only one or two of the negative I have been seeing. Misleading, scam, disappointment. Although Amazon may not be at fault, I have lost faith in them. Lets see how my filed claim works out. These people (engine 29) are thieves and liars.These reviews are rigged. Amazon shoppers BEWARE of this seller. For every positive review there are many more negative that are not showing here for some reason.", "Title": "Can't review something that I haven't received.", "Date": "December 26, 2012"}, {"Author": "LaShonna Jones", "ReviewID": "R2SJA4SEDH9BGZ", "Overall": "5.0", "Content": "The is an awsome product. I ordered it for my 10 year old daughter for Christmas but I think I've fallen in love with it. I've been playing it since it arrived.  A great product with speedy delivery.", "Title": "Love it!!!!!", "Date": "December 12, 2012"}, {"Author": "Jamie Marley", "ReviewID": "R2GBOH7QTBRNUM", "Overall": "5.0", "Content": "Great google android at a great price! They are very hard to come by! Thank you so much! I appreciate it!", "Title": "Perfect!", "Date": "December 11, 2012"}, {"Author": "Shoof \"trice di cinema\"", "ReviewID": "R30741ZP5P80RS", "Overall": "5.0", "Content": "My wife has a Google Nexus 7 tablet and the latter is my only frame of reference for functionality and quality.I purchased (3) Zeepads for my grandchildren and they arrived 12/22/12 instead of the scheduled 12/21.  All were about 85% charged.  Each Zeepad connected to my wi-fi home network in a matter of seconds.  Touch screen was responsive and a breeze to navigate.  I am pleasantly surprised with the overall build quality and remarkable functionality of the Zeepad.While not as fast as the Google Nexus 7, which has a hotter Arm Holdings designed processor, the Zeepad's speed is quite adequate.  I was drawn to the Zeepad since its processor is also an Arm design and the Android operating system is tough to beat.  Image or screen quality is inferior to the Nexus but decent.  The difference can be noticed when viewing the screen from an angle, but as long as the view of the Zeepad is straight on, the quality is good, not great.  To put the review in perspective, remember the Zeepad is well below $100 and, at this price point, I think this product is a real value.  Actually, it is a remarkable surprise.  My grandkids opened these on Xmas Eve and within seconds were connected to the net and gazing at more apps (mostly free games) on GooglePlay, where android apps are offered in abundance.  Did not experience any slowness as mentioned in some reviews.  Perhaps the network? Durability is an unknown since we have had the Zeepads for just few days so I'll follow up in a month or so.  While I was very skeptical that a tablet would do all the things claimed, after seeing the Zeepad in action, I wish I would have grabbed one for myself!", "Title": "A Functional Android Tablet at the Right Price", "Date": "December 26, 2012"}, {"Author": "Derek Brewer", "ReviewID": "R34RLXGL8OCW4U", "Overall": "5.0", "Content": "This is a good tablet for the price.  The only bad things I can say about it is that the screen could be a little better and it would be nice if it had bluetooth for a keyboard.", "Title": "Does everything I need to do and is cheap", "Date": "January 11, 2013"}, {"Author": "robert taylor", "ReviewID": "RTVZ5ZYF5WAZM", "Overall": "4.0", "Content": "I chose this tablet because of price, I am surprised how well it works.  the battery life is longer than most reviews I have read and the apps are unlimited.", "Title": "did what i expected", "Date": "January 10, 2013"}, {"Author": "Can't get any better than this", "ReviewID": "R31OPAWMM0XDEM", "Overall": "5.0", "Content": "This tablet is absolutely amazing for the price. Everything works great its fast enough wifi works perfect. I bought it as a gift for my 5 year old and I know she will love it. Overall this is a very good product dont think because its low in price it isnt going to meet your expectations . Everything it says it has it does and its very smooth to manage. Im impressed and very much satisfied.", "Title": "great product", "Date": "December 18, 2012"}, {"Author": "Timmy", "ReviewID": "RNBLXK159GABA", "Overall": "5.0", "Content": "This little tablet performs better than I thought it would. I was a bit weary at first because what can you expect from a around $80 tablet? So far I've been presently surprised so far. The screen reacts rather smoothly. The build quality is adequate for it's value. I've seen complaints of internet connectivity issues but I haven't had any so far (fingers crossed!). The fact this thing has the Google Play Store is awesome (I've heard horror stories about some of these cheap tablet app markets).  All in all very good for the price. Mines even came with some nifty little side items that I didn't see came with it. Great tablet for the money. One word of warning: Much like others have said in there reviews don't expect this to be an Apple product. Resolution, color and image clarity aren't the cutting edge sharpness you see on other products. Be fair to what you get for how much you spend!", "Title": "Great Price For What You Get", "Date": "December 24, 2012"}, {"Author": "Natalia", "ReviewID": "R32B4A0ORNZ16P", "Overall": "1.0", "Content": "I didn't have high expectations when I purchased this for my 7 year old son, however, this didn't even meet those expectations.  It started freezing week 1, the volume button broke from turning up and down, it shuts down on its own, doesn't always start up.  It has ben a nightmare.  I wish I would have spend a little bit of extra money to get one worth spending the time.  My son doesn't play with it half the time because it's always freezing or force closing apps.  I won't touch it because I get even more frustrated with it.  NOT WORTH IT.", "Title": "Cheap", "Date": "October 3, 2013"}, {"Author": "Fleur-de-lis", "ReviewID": "RIJK2ZE0F8PDI", "Overall": "1.0", "Content": "This is the 2nd \"no-name\" cheap tablet we purchased for our 4yo daughter. The first one worked for over a year which I consider a fair return on what we paid for it. Since that tablet is no longer on the market, we purchased another \"no-name\" device, figuring it'll all be the same. Boy, we were so wrong.To start with some positives, this tablet looks cool. It is small and lightweight, and it connected to our wifi fast. Now I will elaborate on why I gave it one star. We don't expect much of those cheap tablets, we only want it to load and play the internet videos and display pictures. That is what our daughter uses it for. However, this tablet would not load the videos. Youtube website will load, but the video will be loading and loading forever. It might have loaded eventually, but I never waited for longer than 5 minutes. I figured, it it takes 5+ minuted for a simple few minutes video to load, my daughter will have a problem with it. I was very disappointed, I so wanted to keep this little tablet.Another thing we noticed, is that the tablet would shut down periodically on its own. What the heck is that, so annoying. Plus the battery life is measle, it lost 50% of its charge in about 30mins being turned on and connected to wifi. And finally, I made sure I ordered a black device. However, the one delivered to us was red. The stylus was not included either, although advertised.All in all, this parody of a tablet went back the very next day. Amazon was great, made the return easy, fast and simple. Needless to say, I would strongly advise to stay away from this product. It is just a waste of money, time and energy.", "Title": "Useless, returned next day", "Date": "May 31, 2013"}, {"Author": "tiffany wisdom \"tiffany wisdom\"", "ReviewID": "RBLJQ7NBSK6E5", "Overall": "1.0", "Content": "I BOUGHT 2 OF THESE FOR MY KIDS THEY HAD THEM A WEEK AND THE SCREEN STARTED FLICKERING AND TURNING GREEN... NOW THE POWER BUTTON HAS BROKE OFF AND FELL IN THE INSIDE.... THIS ITEM IS A PIECE OF CRAP PLEASE DO NOT BUY THIS ITEM, GO THE EXTRA MILE AND SPEND A LITTLE MORE AND GET A WAY BETTER TABLET THAN THIS ONE...", "Title": "worst purchase i ever made DO NOT BUY", "Date": "April 5, 2013"}, {"Author": "Msleela", "ReviewID": "R20S5ATP0FB60V", "Overall": "5.0", "Content": "I bought this item for my nephew so he can skype with family members while he is away from home. He can use Facebook, Netflix, it's easy to set up and easy to navigate for a younger child or a teenager that is not responsible enough for a laptop or Ipad. You can downloaded apps on this piece of technology.", "Title": "Great for a younger child!", "Date": "January 27, 2013"}, {"Author": "Cindy", "ReviewID": "R3T0O1E5SLUJO4", "Overall": "5.0", "Content": "For a 3g not bad, equal to others that's 4.0 ice cream , I use it to watch movies , do enjoy not having to carry my laptop around  all the time", "Title": "great pad", "Date": "January 26, 2013"}, {"Author": "dmclauri", "ReviewID": "RBV2EKSKVNXO2", "Overall": "5.0", "Content": "My daughter wont put it down and now the other kids want one. my daugther loves her new tablet. Great buy!", "Title": "Gave it for a christmas present", "Date": "January 24, 2013"}, {"Author": "Nancy Wolf", "ReviewID": "R14RH89Z4BL4G2", "Overall": "4.0", "Content": "I love it but the battery life sucks big time.  I get 20 mins tops.  When I first got it it I got 2-1/2 hrs so IDK what happened to it and I've only had it for about two weeks.  If it had good battery I'd giive it five stars but since it doesn't I only give it three.  IDK if something is wrong w/it or if that's the nature of this item.  I've turned down the brightneess and tried other things but to no avail.  Its a great tablet tho so the battery issue isn't a deal breaker for me as I'm not taking it out of my home.  Is a bad battery life normal for this item?", "Title": "Zeepad", "Date": "January 21, 2013"}, {"Author": "mizzkeys2u", "ReviewID": "R2AQ1PWTHJ8ICR", "Overall": "5.0", "Content": "I am really impressed with this tablet, the price was great and the web surfing speed is incredible! this was a great buy....Thanks Amazon!!", "Title": "Zeepad 7.0", "Date": "January 21, 2013"}, {"Author": "Stacy Rich", "ReviewID": "R2TBOIWAGWMLNA", "Overall": "5.0", "Content": "I bought this as a cheap Christmas present for my toddler son. It has good battery life, easy to use and perfect for his reading and apps. I wouldn't recommend heavy serious use only recreational.", "Title": "Great price for a toddlers toy", "Date": "January 20, 2013"}, {"Author": "Madaline", "ReviewID": "R1C0C53MHATUTM", "Overall": "5.0", "Content": "My boys enjoy their tablets that I purchase them for Christmas. The Google play is very awesome I. I find all the apps my kids love to play.", "Title": "Tablets", "Date": "January 19, 2013"}, {"Author": "stilljojo \"JoAnn\"", "ReviewID": "R37UBSWT8M4BZB", "Overall": "3.0", "Content": "I just received my Zeepad, I bought it for my husband who is NOT computer savvy and thought it would be easy for him to use to look up things on the internet and maybe put a few games on it.Cons.  The manual that comes is very very tiny and also in broken English, probably used a translating program so you tend to scratch your head a bit.. that is IF you can read it, the print is so small I had to get a magnifier to read it and then discovered it was of almost no use at all.  So without any instructions it was/is hard to sort of figure out how it works.  It took me a considerable amount of time just to figure out how to set up the internet WiFi.... but once I figured out the simplicity of it.. it was set up in seconds .  The downside is that sometimes the device just does not want to let you get onto the internet even when the signal is strong.. unsure what is causing that issue... but you can come back later and try it and it might go onto the internet easily.. so don't know what is hanging it up.The device itself feels a bit flimsy but is also very light weight. The screen colors are fine and the sound is \"just ok\" .  I haven't tried Netflix yet but if there are issues I will edit this review.The battery is not very good, and I am not wild about the charger that came with it, however you can use it and play games on it while it is plugged in and being charged.  The type of battery that is in it.. the instructions say it is better to let it run out completely before you recharge it.. and if you have issues because you have charged it to soon.. to let the battery run out completely then recharge it.On the Positive side... For the price ($77.00) it is a pretty decent little handheld.  It accesses tons of games, almost all of the  same games I have on my Kindle Fire.. many many free ones and most games are between 99 cents to 2.99. The game downloads go easy and the game play is fine. The touch screen is very responsive and it takes only a gentle touch to play the games or select items.  I do plan to expand the memory with a micro sd card but may find that I don't need to.  I have half a dozen games on it right now and in less than 24 hours I am getting to understand the device. It is not a Kindle or a Ipad.. it is what it is.. which is a ok value for what you pay for it.  I dont mind the quirks with the internet for I think I will be able to figure that out as time goes by.  I originally bought it for my husband to be able to look thinks up on the internet but think I will probably just load games on it and let it go at that.. my husband will use it a bit or the grand kids will surely play the games so it was worth the price just to have a small handheld game player around for them to play.Would I buy it again? probably  Would I give it as a gift?  probably  of course this opinion is based on only having the device up and running for 24 hours  and hard to predict if it will hold up.", "Title": "Zeepad is ok for the price", "Date": "January 4, 2013"}, {"Author": "Mrs. Kia", "ReviewID": "R1TCM0WSC220PQ", "Overall": "4.0", "Content": "The only problem is that I have yet o find out no to put on the parental control. I bought 2 of these for my 5yr old and my soon o be 3 yr old. They both love it.", "Title": "Nice", "Date": "January 3, 2013"}, {"Author": "Jackie Lilleodden", "ReviewID": "R23UKYDLMSVRNY", "Overall": "4.0", "Content": "This is a great product for kids.  My son uses his for games, music, craigslist, and facebook.  We haven't checked out the netflix yet but we are completely satisfied for the price. I would recommend highly!", "Title": "great product", "Date": "December 31, 2012"}, {"Author": "Brenda", "ReviewID": "R1A6266NAEGM58", "Overall": "4.0", "Content": "First I want to say that, when I ordered these the price was 79.99. The very next day the seller (ENGINE 29) put them on sale at 69.99. You may say ok that's just 10.00, but I ordered 3 of these.  I contacted them and they informed me that they could not change the price or give me credit for the difference. I could understand if it was a week or so later. But the next day. The pad are great. They are really fast for the size and perfect for the grandkids. They came already ready to go with games and wifi ready. I ordered the cases that have the keypads to them as well. So they are totally satisfied.", "Title": "Pad for Grandkids", "Date": "December 28, 2012"}, {"Author": "Trudy", "ReviewID": "R35K0ZDZJ8CHXK", "Overall": "5.0", "Content": "The shipment was fast and on time love doing business with u guys thanks now my kids can have a wonderful new year with their gift", "Title": "Loving it", "Date": "December 27, 2012"}, {"Author": "Randy Landry", "ReviewID": "RAWOKWFJTSQQ0", "Overall": "5.0", "Content": "One of the best tablets out right now They Love Them Will Bye Another one if the price go back down...", "Title": "Real Nice", "Date": "December 27, 2012"}, {"Author": "Christine E Becker", "ReviewID": "R32FQ03GPN3FUX", "Overall": "5.0", "Content": "I bought 3 of these for Christmas presents for my kids, 14, 12, and 10.They wanted a tablet of their own, and I wanted them to stop hogging my ASUS 32 gig tab; especially since they have already broken it once (Thank goodness for extended warranties from Best Buy). I was a little skeptical because I bought my other son a knock off brand tablet last year and it was literally a piece of crap straight out of the box, but these tablets seem to be exactly what I was looking for the kids. They can play all of their games and download them from the play store. They can watch netflix, and even skype one another from their rooms, which they have already done. (Weird!) I hope it stands the test of time...at least a year would be nice.", "Title": "Kids love it", "Date": "December 26, 2012"}, {"Author": "Megan", "ReviewID": "R1Z0LF24OCNS0F", "Overall": "1.0", "Content": "I would like to write a review on this product, but I cannot turn it on. The charger that I received is broken. It is not the charger shown in the picture, the one I was told I was going to receive, and when it is plugged into the tablet, it doesn't set flush to the tablet. Therefore, I have not been able to even turn on the tablet. I'm very frustrated considering this was a Christmas gift, mind you I spent almost $30 on shipping to have it arrive before Christmas, and now I can't even give it as a gift. I'm not satisfied.", "Title": "Charger is either refurbished or used, and it doesn't work.", "Date": "December 24, 2012"}, {"Author": "Lisa Addison", "ReviewID": "R1M85G45J60L0D", "Overall": "1.0", "Content": "Update - Well it worked great the first day but now large portions of the screen are unresponsive.  I am sending it back for a refund.  Very disappointed!-----------------Previous reviewSo I just received my Zeepad last night.  First impression out of the box, it is better than I expected.  I ordered it thinking how good could a $70 dollar tablet be. and how much can it really do compared to the more expensive brands and models?  Well I was surprised.  It is a bit heavier than I expected, but that just gives it a more substantial feel.I have a 'better' tablet already.  I have the ASUS Eee Pad TF101 32Gb and love it.  But I was wanting something a bit smaller that wouldn't break the bank.  I read alot on my tablet so it goes almost everywhere with me, but the ASUS can be a little big for the handbag:)  I wanted something that would fit better in my purse for on-the-go reading, but I also wanted a bit more then just an ereader in case I wanted to look something up on the internet or play a game to pass time somewhere.  Yes I could have gone with the KindleFire or Nook Tablet but they are still well over $100+.  I also like having access to the wide variety of Apps that are available with Android.  I'm not totally sure what all is available with Kindle and Nook.I saw this and several people who purchased had said they were pleased so I decided to give it a try.It connected to my home wireless easily.  The touch screen is responsive, much better than I expected. I immediatly went to Google Play and began downloading and installing Apps I wanted.  No problems there.  I went to the browser and everything was working OK except for one of my favorite web pages.  When it loaded all I got was a blank screen.  Reloading didn't help.  I went back to the Apps store and downloaded Firefox and Opera web browsers to see if they would display the page.  Finally after paying with settings I got my page to come up in Opera.  I'm really not sure why this web page was having such a problem on this tablet but i got it to work so I'm happy:)With the display only being 800x480 everything is not as crisp as my ASUS but by increasing the font size on my ebooks they read OK.  I haven't tried any videos or the camera on it yet so can't address those at this time, but then that wasn't the primary reason I wanted it.  Also haven't tried to connect it to my laptop to see how syncing and transfering files over to it works.  The web browsering and reading capabilities, in a more portable size, was what I wanted and for those pursposes I am happy with it.We'll see how it goes after a few weeks with it:)", "Title": "UnPleasantly surprised!", "Date": "December 19, 2012"}, {"Author": "Tarche", "ReviewID": "R28MQG0WB9JW7X", "Overall": "5.0", "Content": "I ordered this from a company called Goodios and it came with a pen and car charger and this company was very accurate whenever i would email them.. My baby loves it and it is well worth the money......So far so good!!! !", "Title": "She's enjoying it", "Date": "January 13, 2013"}, {"Author": "Cecil", "ReviewID": "R2A7WBQLCRBGJV", "Overall": "2.0", "Content": "My sister and I each purchased one of these from Moma Imports and both are really poor quality compared to the same product from Goodios.  From Moma there is no labeling on the buttons, the preloaded apps described on the product pages are not there, they are missing.  The included earphones stylus and screen protector that are normally included from other sellers are missing as well.  The battery lasts only 45 minutes with screen brightness turned down as low as possible on the Moma tablet but last 2 1/2 hours on the same product from Goodios.  These (Moma) are not nearly the quality and completeness that others are receiving from other sellers.  Mine was defective (would freeze whenever screen blanked) and I returned it.  When I purchased the replacement it came from Goodios and that unit was MUCH better and did not have any of the deficiencies of the ones which were supplied by Moma..  I can only guess but as a systems engineer I suspect that these (Moma) are factory seconds or somehow a different production run that the normal units and I would avoid purchasing them from Moma based on what we have experienced.", "Title": "Not as Described From Moma Imports, Better From Goodios", "Date": "July 8, 2013"}, {"Author": "Dan White", "ReviewID": "R3KB3818CPT9TP", "Overall": "5.0", "Content": "Was a little nervous looking at some of the reviews of this product, but purchased it for a couple reasons. It fit my budget and it seemed to be a great starter tablet. So with no basis for comparison here goes.I purchased this for my wife so she could do words with friends and such without having to drag her laptop to bed with her. Neither of us have used a tablet before so keep that in mind.PROS:It arrived packed securely before the expected arrival date (2 days early)It had about a 50% charge when it came, but I stuck it on the charger and left it there for the remainder fo the day (5 hours), the following day I got it back out and started to set it up. The battery lasted all day, but I was working on it it intermittently.WiFi set up was a breezeThe app store had all of the apps I was looking for and the ui was very intuitiveThe screen is very responsive and the colors are vibrant.CONSIt did not come with a screen protector for some reason (minor complaint)The camera is not very good quality considering the average throw away cell phone comes with better image quality these days, but as far as the skype app goes it was a bonus but not why I bought this.In the end for the money I cant imagine getting a better starter tablet than this.", "Title": "Great Starter Tablet!", "Date": "May 22, 2013"}, {"Author": "Maria A. Cruz", "ReviewID": "RA2IOL20O2E4K", "Overall": "2.0", "Content": "Its functional... sort of...  For my 8 year old, she uses it to play games, and it is decent for that purpose.  But it doesn't hold a battery charge for very long, maybe lasting for about an hour.  Also the actual plug connection for the zeepad is crap.  You have to play with the cord and jam it into the tablet in order to get the darn zeepad to charge.  The charger is not the typical UBS or iPad type, but a thin connector, which is impossible to buy at regular stores.  So when the battery goes dead on a car ride, you are simply out of luck.  My recommendation?  Spend a bit more and get something that has more of a battery charge and easier to charge.", "Title": "Eh, for the price...", "Date": "April 24, 2013"}, {"Author": "Jonathan Ellis", "ReviewID": "R1BGXBFBGP2ZAX", "Overall": "5.0", "Content": "My ten year old saved his allowance for a tablet and chose this one, primarily because unlike most cheap off-brand tablets, it includes Google Play.We also own a 1st-gen Kindle Fire and this compares favorably.  It's roughly the same speed, but running Android 4.0 instead of the modified 2.3 on the Fire makes it a much better experience.I foresee the 4GB internal storage becoming too small eventually, but since it supports adding storage with a card, I'm okay with this.  Especially from my son's perspective, better to get the price down as low as possible to start with, and allow expanding it later.The one complaint I have is that it comes with a proprietary charging cable.  (It also comes with a USB cable, but I assume that is only for transferring files.)We were pleasantly surprised to find an included stylus in the box.  To be honest, I'm not sure what art programs we should look for to take advantage of this, but it was a nice bonus.All in all, for the price this is a great value.", "Title": "Son is very happy with it", "Date": "March 16, 2013"}, {"Author": "wandaful", "ReviewID": "RRNOJ1B2OXHSF", "Overall": "2.0", "Content": "I got the tablet with the expectation of it as being BRAND NEW out the box, but instead it was slightly used, with some scratches on the screen.  It appeared to have had some previous settings on it which I had to adjust. It also in the beginnning had problems with wifi connection.  its still not picking up  good when I leave the house.  Overall, it's an okay tab, a bit slow with some of the connections like netflix and it freezes up sometimes.  My opinion is to invest in a Brand you can trust.  I got this for my grand daughter.  Good for gaming.  I got myself a Kindle Fire, which I throughly ENJOY!!!!!! My grand daughter wants to switch and always is getting mine to watch netflix and to go online for stuff like Disney.", "Title": "Not what i thought ...", "Date": "February 28, 2013"}, {"Author": "Lindsey", "ReviewID": "RDKSEHSXUBJSH", "Overall": "1.0", "Content": "Reviews must be at least 20 words longBecause of the price, we purchased two of these for our kids. Within two weeks the first on broke. now 1 month later, the second one is done for. Both were dropped on the VERY SENSITIVE power on/off button, braking the button right. I claim some responsiblity but very poor design.", "Title": "not for kids", "Date": "February 26, 2013"}, {"Author": "from NC", "ReviewID": "R1XPQN3WJNGJP1", "Overall": "2.0", "Content": "I can use this device for less than 30 minutes before needs charging -completely useless !!! Device is sluggish -speaker is bad", "Title": "poor poor battery", "Date": "February 16, 2013"}, {"Author": "William Baiza \"Willb14\"", "ReviewID": "R204QMVDL224D6", "Overall": "1.0", "Content": "This item was new and did not work correctly...and to send back it was crazy it took about 8 weeks to get my money back........", "Title": "I hate it..", "Date": "February 14, 2013"}, {"Author": "Lydia", "ReviewID": "R2MS2MRIX22KAO", "Overall": "1.0", "Content": "No appropriate information is available to set the tablet up when you receive it.  What few directions are sent in the package must be read with a magnifying glass.  We will have to spend hours on my PC at home searching ways in which to bring this tablet to its supposed ability of use.", "Title": "Unknown Product", "Date": "February 11, 2013"}, {"Author": "Eursla Houston", "ReviewID": "R2C3GNKV9IHU2R", "Overall": "4.0", "Content": "As far as the tablet goes i purchased it for my 10 yr old daughter.She loves it. It's actually better than the Polaroid one i purchased for my son. The graphics are nice and crisp,but the camera sucks.I wish it would have came with better directions. All in all well worth the price.", "Title": "Good for the price!", "Date": "January 30, 2013"}, {"Author": "Norfis Rodriguez", "ReviewID": "R29CKN6G9P20KH", "Overall": "5.0", "Content": "Worth the wait... Didn't get it on time, but better late than never... Good tablet for kids and adults too.", "Title": "Kids love it!", "Date": "December 28, 2012"}, {"Author": "mkreader", "ReviewID": "RXRKQJQA7CRLR", "Overall": "5.0", "Content": "This purchase was the best purchase i could have made.  My 8yr old son wanted a tablet like his father, but I didn't want to invest a lot of money.  This does everything i needed it to do.  Shipping scared me a little it was towards the end of the delivery time that i was quoted, but it did arrive. Thank you!!!", "Title": "Made my 8yr old son the Happiest kid this Christmas!", "Date": "December 27, 2012"}, {"Author": "Austen", "ReviewID": "R384NYLZD1DKJV", "Overall": "1.0", "Content": "Read all the reviews prior to ordering n thought people were maybe just over exagerating this shit sucks, i ordered 2 of them the first coming 2 weeks later when shoulda only took 3 days maybe if it was ups id understand but not mail thats fast, showing the laziness of the seller. On top of that just as other reviews say they come scratched your either selling me used shit calling it new Or dont know how to pack stuff corrctly knowing its going across country. The second ones taking longer n ill be suprised if it shows up before christmas.  Im sure my gf n gma will still like them but for the price at least take care of it n if they dont plan on refunding my account for both n receiving them back its bull shit i spend almost 170 for crap.", "Title": "Dont order", "Date": "December 18, 2012"}, {"Author": "denis", "ReviewID": "R2WBZJLRAHISIS", "Overall": "5.0", "Content": "I recieved this the day I was supposed to, I love it... don't believe all the negative reviews you read about this. So far it does everything I want it to do. The battery life is not very long it lasts about 2.5 hrs before it needs charged. The wifi works great, I get a signal in places I usually don't. The screen is bright and the colors are great, I have not watched any videos on it but the one it came with and it was crystal clear. Games work great on this, I have several so far, I do recommend getting a card for it to hold more...but overall it works great. The touch screen is very responsive, I did have to tap it a couple of times to get it to respond, but overall it's not a high end high dollar tablet. so far i am very pleased with it...", "Title": "Very good product...", "Date": "February 1, 2013"}, {"Author": "Dian C Flouro", "ReviewID": "RLVR2WIR6CSYH", "Overall": "5.0", "Content": "This item is easy to carry and use at work, and will come in handy for travelling verus carrying a laptop.I was not thrilled w/the seller, as it took a very long time to get to me.I recommend the product, not the seller I purchased it from.", "Title": "Handy item", "Date": "January 31, 2013"}, {"Author": "Barbara Cloney", "ReviewID": "R1RGXJ5896B4FU", "Overall": "3.0", "Content": "Bought two of these for my twins:First Issue: a prong broke off of the wall power cord IN THE WALL... thank God my 4 year old didn't try to take it out on his own.  Second Issue: Other twin's power cord came bent and doesn't work.Third Issue:  After contacting Amazon and finding that there was no contact phone number for distributor, I got a new Zeepad in the mail.  THIS power cord doesn't even fit into the device, therefore rendering that power cord useless....LAST and FINAL:  Resorted to the USB port to plug into the computer.  Son brought USB to show me....missing the metal part that goes around the prongs that go into the computer.  The metal that protects these prongs was still stuck into the USB port of my computer.The device itself is fine....IF YOU CAN GET IT CHARGED!", "Title": "Cheaply made power cords", "Date": "January 30, 2013"}, {"Author": "Alan gavami", "ReviewID": "R37I93J0VC2RPT", "Overall": "5.0", "Content": "This is an addition to my original review. The company edge cuter send me another zeepad for my doughter, but my doughter was now disappointed with the product. So I emailed the company and they worked with me to get this problem resolved. My son wanted a blue colored one. So I send the new pink one that I just had received in the mail and they send me aBlue colored zeepad for my son. It is not the fastest tablet but for the price and the companies cooperation in resolving this problem, I can't really complain. They fix the  Issues and improved their shipping methods, so the electronics are more protected during shipping. Because I know UPS or USPS just throw boxes around and couldn't care less what's in them. So overall as far as customer service the company did a great job, and my son loves his blue color tablet. It is his first one, and its been working fine so far. Thanks GaryAlan gavami.", "Title": "replaced", "Date": "January 29, 2013"}, {"Author": "chestube", "ReviewID": "R28VHH7VFK175X", "Overall": "4.0", "Content": "Bought for husband for christmas. Very easy for him to use. He loves to be able to read books on it. Gave 4 because battery life is short", "Title": "Zeepad", "Date": "January 28, 2013"}, {"Author": "Edsel", "ReviewID": "R3GX7FRQSDIZDN", "Overall": "5.0", "Content": "An inexpensive way to explore the Google/Android galaxy. Our household owns iPads/iPhones/Touch's and a Windows 8 Tablet so the Zeepad was my experiment to test and compare the Android ecosystem. The Zeepad's processing performance is excellent, the screen is good, the user manual is a fun read because the translation to english is so bad. You can download much better instructions for the 4.0 Ice Cream Sandwich OS from a variety of sources on the internet. The Zeepad even came with a charger, touch-pen, and ear-buds.If you are curious about the Android OS system the Zeepad is the tablet to get.", "Title": "An excellent introduction to the Android system", "Date": "January 27, 2013"}, {"Author": "Tami Eshelman", "ReviewID": "R2WQ6UIPB8IT5Q", "Overall": "4.0", "Content": "I specifically wanted a tablet that my daugther could take photos and video with as well as skype her sister who is away at college.  The specifications said it did it all.  Well yes technically it does it all, but the only camera and video is FACING the user!  So no dual camera...  disappointing to say the least.  But it shipped fast, and was really low priced.  And it functions well.  It holds battery life well and even without the camera, my daugther LOVES it.  She takes it on her daddy weekends so she can watch Netflix and check her facebook.  It seems to be quite sturdy too and the screen has a nice resolution.  I would recommend it unless you want the dual camera.", "Title": "camera not there", "Date": "January 16, 2013"}, {"Author": "dauntless", "ReviewID": "R2XWENHRXWVYJY", "Overall": "1.0", "Content": "This is only my second tablet, ever.The reason I only give it one star is because the battery sucks.  The hyped 3 hour run time (which isn't all that great to begin with) is in reality more like 20 minutes or less.  Charging takes awhile and the charging power supply gets warm so it seems to be working, but the battery is weak.  (wifi on notifications off, screen brightness set to ~80 percent)The screen resolution looked pretty good until I loaded some pictures and test patterns into my Ainol Elf 2 (another bargain priced brand X tablet) and compared them side by side, the Elf wins hands down.  The Zeepad does have a somewhat better viewing angle, but the display looks \"flat\" compared to the Elf.I never could get Netflix to work.  (and hadn't gotten it working on the Elf either until just recently)  Unfortunately my wife has the Zeepad now so I can't try messing with Netflix, but I suspect the newest Netflix app will work on it.If you have problems with Netflix Google for \"com.netflix.mediaclient_3.0.0 build 1010.apk\" That is the latest Netflix app and seems to be working.  No need to register with an app store and it can be found on the net for free.I  haven't decided what to do about the battery problem.  I can replace it for $10-15 but that option isn't going to be open to most of the people that buy these things.12/6  My wife has had it all the time so I don't really get a chance to play with it.  (I got it as a test bed for learning how to update android, etc.)  I'm getting her a Lenovo tablet for Christmas...  Anyhow I'm noticing the screen on hers is scratched pretty badly, my Ainol, in comparison, still looks pristine (and I'm not gentle with it).  I think we are seeing the difference between acrylic and polycarbonate judging by the scratches.Battery life is still bad, but she can get ~1 hour if she turns off the wifi, and app updater (which needs wifi to work). I also got her a new charger and that has been working faster than the one supplied.  She still runs the display at 100% brightness which eats some run time, compared to the 80% I was using.Netflix is working like a champ now.  Ap update worked wonders.  Of course the wifi must be on so the battery life is shortened.", "Title": "Not much of a bargain IMO", "Date": "October 31, 2013"}, {"Author": "Tamara Saint-Joie", "ReviewID": "R388YN5TBV1MMV", "Overall": "1.0", "Content": "Just brought this for my son  it's already not working the first day he had it. Very upset.  With product.", "Title": "I hate it", "Date": "October 24, 2013"}, {"Author": "Uncle Sam \"rome_04\"", "ReviewID": "R1BFU1RA6HFJF4", "Overall": "4.0", "Content": "We were getting tired of the kids using our phones and tablets...  So i purchased the Zeepad for my daughters B-Day.  For the price its not a bad deal...  battery does not last as long as my tablet...  but i consider that a bonus cause it limits the time she spends ruining her eyes...lol  And she loves it!!  Going to order one for my son next week!!!", "Title": "Daughter Love It!!", "Date": "October 13, 2013"}, {"Author": "Terri H", "ReviewID": "RIZNHVSGJQ9J5", "Overall": "4.0", "Content": "Hi, this is my very first tablet, so I am not an expert.It comes with a lot of accessories. But I haven't used them.It is very cute, and for what I paid I am happy.  But it seems like the RAM is not really sufficient for some apps.I can run kindle ok, which is what I really want to use it forSome embedded videos in websites don't really play right. I think because there is not enough memory in the tablet.  I installed google chrome and that seems to work better than the default browser.When I start apps, sometimes the screen goes black... but if I wait about 20 seconds I will see the app interface.Once apps are started up, they run ok.To make the tablet run smoother I disabled notifications, that helped a lot.I am happy with the purchase so far.  I might update the review in a few weeks.For 60 bucks, it is REALLY nice.  I can get away from the computer and still do some things. I love the pink.  I bought a pink cover for it.Filemate ECO 7-Inch Tablet Faux Leather Case with Push Button Clasp - Magenta (3FMTC225MG7-R)The cover fits great, so if you want a way to protect your tab, I suggest that one. I didn't really want a keyboard case for such a small tablet. The on screen keyboard is nice. If you plan to be super productive for business, this is not your tablet because it's not powerful, but it is ok for light recreational use like kindle reading.  It works great with my subscription to Oprah :)It connects ok to my home wifi, but it didn't like the wifi at the Starbucks for some reason.", "Title": "hangs a little sometimes", "Date": "October 10, 2013"}, {"Author": "KristinE", "ReviewID": "R3JUMJIYBYT75X", "Overall": "1.0", "Content": "This pad is already loaded to the max with the operating system and the one game that is preloaded on it. If you can use it just the way it is and don't want to down load anything like books, music, games, etc. then you're fine. But what's the purpose of having a pad if you can use it with the stuff that's pre loaded on it! I am thoroughly disappointed!", "Title": "Piece of junk!", "Date": "October 9, 2013"}, {"Author": "J. Crouse \"Entrepreneur\"", "ReviewID": "R2OVYI40RJ3YBW", "Overall": "3.0", "Content": "The 1st problem with this product is that the \"manual\" is written in what appears to be pidgeon English...and the type is so tiny that even using a magnifying glass doesn't help! So, when it comes to set up and/or troubleshooting, you are pretty much on your own.Battery life is less than stellar. The weaker the battery, the slower & less responsive the programs become. And there are warnings all over the place not to overcharge the unit, so it's always an up & down experience.Overall...I don't like the Zeepad 7\". I found it just way too hard to navigate. I plan to try to return it...especially when I can get a new Nook tablet that I know is far superior for only $30 more.", "Title": "Pretty Disappointed...", "Date": "October 9, 2013"}, {"Author": "Robyn Bible", "ReviewID": "RMWTTS4H4CV2T", "Overall": "5.0", "Content": "Very functional, perfect for my 9 year old daughter. Small enough to take anywhere! She loves it! Definitely a must have for road trips.", "Title": "Great!", "Date": "October 8, 2013"}, {"Author": "RanMan \"RanMan\"", "ReviewID": "R2Y5E7FAZD1MNZ", "Overall": "2.0", "Content": "The sellers really should sell them in the toy department.  I think this is misleading.  These things work for a short time and then the quit responding or operating as they should.  I bought them for my kids, but it was a huge disappointment.  Their state of excitement did not last very long.", "Title": "Should be in the toy department", "Date": "October 7, 2013"}, {"Author": "KArmstrong", "ReviewID": "R3NTRA83QDYZJR", "Overall": "5.0", "Content": "I purchased this for my daughter who just turned 9, she uses it everyday for reading,watching her Netflix, and playing games. It's not an iPad or kindle fire just a very good device for its price", "Title": "love it", "Date": "October 6, 2013"}, {"Author": "dillon christopher duke", "ReviewID": "R1XIODK6V72QIZ", "Overall": "4.0", "Content": "ok to start it was a really nice tablet. mine broke bc i dropped it. but the way i dropped any tab would have broke.i really enjoyed it it was kind of slow but for just day to day use it was reall great. i highly recommend this for any body any age. goodios got it to me at the right time and they gave great service. thank you!!", "Title": "really good tablet", "Date": "October 3, 2013"}, {"Author": "dwane everett", "ReviewID": "R1KSF4B2ZO7U70", "Overall": "2.0", "Content": "this is an okay product my 10 yo loves hers they break easy limited storage capacity and the battery really sucks i would not get another nor would i recommend and the charger breaks very easily", "Title": "Not a premium device", "Date": "September 7, 2013"}, {"Author": "B.I.C. LINE COMPANY", "ReviewID": "R1Y2X5K96ZXKIG", "Overall": "1.0", "Content": "I bought 2 & both stopped working after 2 months. I cannot even return these for replacement or repair after the 30 days window expired. I would not recommend these to anyone. Buying something cheap every 3 months does not make sense. Better buy something 3 times the price that will work for years", "Title": "No extended warranty", "Date": "September 6, 2013"}, {"Author": "BetsyDavis", "ReviewID": "R1FJWRT15PINQ3", "Overall": "5.0", "Content": "This is a perfect starter \"iPad\" for my grandson.  He is always wanting my iPad and this was a great solution. The setup was very easy and I am happy with the sale, and delivery.", "Title": "Perfect for My Grandson", "Date": "September 2, 2013"}, {"Author": "loganzz1", "ReviewID": "R186PGQVLEU0EZ", "Overall": "4.0", "Content": "This product met all but one of my requirements. It does not have a universal power cable. Mini or micro. Other than that it does everything my kids need in fact 4 days after I got it I purchased a second one for my 12 year old and he can't put it down.. so in my opinion its great for 7 year olds as well as pre teens...", "Title": "zpad great purchase", "Date": "August 20, 2013"}, {"Author": "Astreja", "ReviewID": "R3SOUL0PYHT5BU", "Overall": "3.0", "Content": "Fast delivery. slow device. small. lightweight. cute. horrible camera. doesn't hold a charge for more than an hour. good for games. you get what you pay for.", "Title": "Well wtf.", "Date": "August 17, 2013"}, {"Author": "Laci Ledbetter", "ReviewID": "R3DT72H3DC25PN", "Overall": "1.0", "Content": "I purchased two of these, one for each of my children.  I am dealing with setting them up and downloading the games and such for the kids, because I want to control what they see.  Here are the issues I have noticed so far with these tablets...1.) Response time is ridiculously slow.  You hit \"Install\" and it MIGHT flip screens 30 seconds later.  If it doesn't it will \"time out\" ... Timing out happens consistently.  I don't know how the games are with response time, I haven't had the patience to even try.  The kids haven't complained, but they are just happy they have a tablet.2.) The screens aren't very sensitive.  I realize that screens can be too sensitive but I shouldn't have to jam my finger on the screen to get it to respond.  Very annoying.3.) Low quality graphics -- honestly, I didn't expect much from a $70 tablet, but just thought I would let you know. It's no ipad or Kindle with the graphic quality.4.) Battery life. .... It. Dies. FAST.  I was just TRYING to download a game on one, it gave me the \"You're at 14% notification\" and literally less than 5 minutes later when I went to plug it in, it was already down to 9%. This is supposedly a brand new tablet.  We literally got it in the mail yesterday. (Please note that we've had the other one for several weeks, so I'm not writing this review without having used this.)5.) Very cheaply made.  The Power Off button feels like it's going to fall off it's so loose. The camera is crooked and my daughters pad is coming apart in the middle. When I say \"very,\" I do mean VERY cheaply made.6.)  The \"User Manual\" is supposedly written in \"English\" however, it doesn't even make sense.  Here is a sentence from the \"User Manual\"  \"#3 Check the music file wherther damaged. Try playing other music, if the file have damaged may lead to serious noise or hop sounds.\"  ---that is letter-for-letter.  Huh?If you're wanting a serious tablet.  Avoid this one. I only gave it a star, because I had to. Like I said, the kids don't complain - they are just happy to have a tablet but I am not satisfied and would not use this for myself.  If I had purchased this for myself, I would have returned it immediately.  Will update this review if something changes, but I doubt it will.", "Title": "You get what you pay for*************", "Date": "July 26, 2013"}, {"Author": "carole", "ReviewID": "R27MEG9KIN41GY", "Overall": "2.0", "Content": "I purchase this table for a teenager who found it limited, slow and flimsy slow.  The major issues were the power plug and ability to connect to computer", "Title": "It only lasted for three months", "Date": "July 26, 2013"}, {"Author": "C. I. Ponzi \"addicted to reading\"", "ReviewID": "R1QV89VAZ1LFHW", "Overall": "1.0", "Content": "Bought this in April by the end of June the screen went black and never came back. Couldn't fine anywhere to send back amazon doesn't even give an address for returns. Total waste of money for the time we had it. By the way wasn't dropped or wet or misused just quit working.", "Title": "Quit working within 3 months", "Date": "July 18, 2013"}, {"Author": "sewsherry \"sherry\"", "ReviewID": "RA63TBOPQRWIO", "Overall": "1.0", "Content": "I loved this tablet when I first got it.  I gave it a shining review. It seemed perfect.  But after  3 months, it stopped holding a charge. and then the place where you attach the plug to the devicestarted getting loose, and then broke completely, and I am very careful with my stuff.", "Title": "changed my mind", "Date": "July 15, 2013"}, {"Author": "linda", "ReviewID": "R3ETLY6TSN49H5", "Overall": "4.0", "Content": "The Zeepad 7.0 came on time. I am pleased with it and my Grand daughter who is 6 LOVES it. Adding Apps through Google Play is fast and easy. The apps run smoothly. We have yet to figure out all of its many functions. My only complaint is that everyone...even Grandpa want's to play it and the charge doesn't last long enough....But we really like it.", "Title": "Great 1st tablet...", "Date": "July 15, 2013"}, {"Author": "Heather", "ReviewID": "R3T25DQUDOJEBO", "Overall": "1.0", "Content": "I am highly disappointed with this product. I ordered it for my son's 8th birthday and I'm upset that the device did not function properly and now he has to go without his gift until I receive a refund.I gave this 1 star because it arrived on time and that's about all it did right. I received it on Tuesday, as scheduled and I charged it for an hour. I had trouble turning the device on but after holding it down for a minute it came on. I connected my Wi-Fi and went to the Google Play store to set up an account. As I was selecting a password the tablet started malfunctioning and random letters started popping up. I didn't have a change to put a password in because the tablet was randomly inputting letters. After a few minutes I shut it down and tried again. Then I was able to make a password and add some apps I know my son would like. I properly shut the tablet down and my son was anxious to play it on his birthday. But when his big day came the tablet WOULD NOT TURN ON! I tried charging it with the charger and on my laptop but even charging it did not help. I held the on/off button for 3 minutes and still nothing. I am so disappointed with this product and will never purchase from this seller again!! When my refund is honored, I'll just shell out the extra bucks and get my son a Nabi tablet or a Kindle Fire. I see cheap is not the right route.", "Title": "Bad", "Date": "May 2, 2013"}, {"Author": "Blaine", "ReviewID": "R1VPSFAMT6PHUP", "Overall": "5.0", "Content": "great product for my 3 yr old grandson he loves it and plays angry birds all the time, it stands up to his roughness. love the product", "Title": "love it", "Date": "May 2, 2013"}, {"Author": "jay", "ReviewID": "RPZLVFCD6D0PU", "Overall": "1.0", "Content": "I bought 2 Zeepads at the same time and neither of them lasted 2 months!! I will not buy one again!!", "Title": "Would not recommend !!", "Date": "April 29, 2013"}, {"Author": "Cynthia L. Billingslea", "ReviewID": "RD5YE668VJ96V", "Overall": "5.0", "Content": "Bought this for our 8 year old for her birthday and am very pleased with it.  Very affordable and works great!", "Title": "Love this!", "Date": "April 27, 2013"}, {"Author": "Bshaw", "ReviewID": "R3UT57JNXKRZZX", "Overall": "1.0", "Content": "The apps that I was able to load were decent. Unfortunately after downloading and turning off the zeepad overnight, it would not turn on the next morning. Also, the screen would not rotate correctly, so it was on the verge of breaking down anyway. The battery drained very quickly also.", "Title": "Defective after 1 use", "Date": "April 22, 2013"}, {"Author": "e.olds", "ReviewID": "R1VGOTYHOZYV90", "Overall": "1.0", "Content": "Read all the comments under the review titled \"Can't review something that I haven't received\". Those are the real reviews, these positive stars are not. I cant believe just anyone can write a review here. That is scandalous.The bias party is deleting negative comments. Is you can write a comment with 1 star of what you read for yourself, consumers need to know this is a scam!", "Title": "read the comments under\" Can't review something that I haven't received\"", "Date": "April 16, 2013"}, {"Author": "Shannon", "ReviewID": "R2KPVTHTBIKCPG", "Overall": "3.0", "Content": "I purchased this tablet as a surprise easter gift for my 6 year old son. When it arrived I rushed to get it set up and download a ton of apps so my son could play with it as soon as he opened it. It was very easy to use although the downloading did take a while. Took approximately 10-15 mins to down load each app and I had purchased about 60 apps (along with some children's kindle books). This was fine since the tablet is priced under $100 (what did I expect, really).My sole issue with this tablet is with the charger. It does not charge well or quickly with the USB cord and the wall charger is difficult to work with. The charger plug does not fit completely into the port so I'm constantly trying to stop myself from shoving it in further. Also, if the plug is not positioned in the port exactly right the unit will not charge. I end up twisting and turning, and wiggling the plug around while constantly checking to see if the tablet is indeed charging. It's a little annoying. If it at least had an LED light that would blink or light up when the unit was charging, I would like it a lot better.Overall, it is a nice tablet especially considering the price. If I could do it over, I would probably purchase the same one again. I may look into purchasing a different charger that might fit the unit better. I did have to purchase a separate MicroSD card since only 40 of the 60 apps I purchased fit onto the tablet. But that was only an extra $20 or so. Well worth it since I am sure I will be purchasing more apps for the tablet in the future.", "Title": "It's nice for the price", "Date": "April 12, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1MGE2ZCWTOYTP", "Overall": "5.0", "Content": "I got this for my 8 year old he loves it never had an issue other than not much storage space in it", "Title": "good tablet", "Date": "April 12, 2013"}, {"Author": "Dawn Yates", "ReviewID": "R1PTXS4X6EXMLQ", "Overall": "5.0", "Content": "it is easy to use for me and my son and my son loves having a tablet of his own", "Title": "great", "Date": "April 12, 2013"}, {"Author": "deidre harden", "ReviewID": "R157BREUJA1KX6", "Overall": "5.0", "Content": "This Zeepad is great. It was for my 16 year nephew and he loves it! It does everything that a male teenager wants in a tablet. I didnt think he was going to like it at first but he doesnt leave home without it. He even takes it to school to take notes on it. He accesses and downloads music. And can play all the games he enjoys like angry birds and bad piggies.", "Title": "its great", "Date": "April 12, 2013"}, {"Author": "Abbie L. Levanduski", "ReviewID": "R3VDH08WCM66UQ", "Overall": "4.0", "Content": "I ordered 2 of these for my kids 7 and 8.  We wanted something cheap, with quick shipping, for a trip we are taking in a few weeks.  We are not disappointed at all.  One came in the 2 day shipping and one was a day or two late.  They work perfect for them.  We updated the software to the latest, and they even come with several apps already included.  Highly recommend to anyone that is looking to purchase a tablet for a child.", "Title": "For a child", "Date": "March 19, 2013"}, {"Author": "Kurt Momberg", "ReviewID": "R3F7YHMHF5LX03", "Overall": "4.0", "Content": "I bought it for my kids, and they definetely love this device. Well constructed. If you want it for your kids, try to include a leather cover or something similar and they'll get lot of fun. Some games won't run as this is not the best hardware available, but most of them run fine.", "Title": "Not much power, but very good for its price", "Date": "March 17, 2013"}, {"Author": "issac", "ReviewID": "R3BO6NY1J459O", "Overall": "4.0", "Content": "The first tablet I received had defective speakers, a mismatched set of earphones, and no instructions.I was very frustrated at first, but then Zeepad support was able to promptly (and in a hassle-free way) respond to my request to replace the defective unit, and the replacement unit has been working great for the price!", "Title": "Zeepad did right by me", "Date": "March 15, 2013"}, {"Author": "mr. smartypants", "ReviewID": "R17OW0L1XBLVST", "Overall": "5.0", "Content": "this is not an ipad.this is an. 80$ tablet that plays games (gba and <) and it isn't THAT slow. for 80 bucks you get what you pay for and more. internet is acceptable, touchscreen is spot on, get usb keybord and a class 10 micro hdsc 32 card and your gravy.battery last about or < 4 hours playing gba.youtube is smooth, wifi good,the bad... it doesn't brush my teeth...", "Title": "awesome", "Date": "March 14, 2013"}, {"Author": "Christina Franklin", "ReviewID": "R1ADOZJQ870UEQ", "Overall": "1.0", "Content": "The tablet only functioned properly less than half the time.  Also, the screen portion kept popping out of place and would have to be snapped back in.  The last time I had to do that, the screen cracked, rendering the touchscreen COMPLETELY non-functioning.  I have a very disappointed child!  I would not recommend buying this product to anyone!!!", "Title": "absolute junk!!", "Date": "March 14, 2013"}, {"Author": "Matthew S. Johnson \"notprint\"", "ReviewID": "RFBWFH81HU38", "Overall": "4.0", "Content": "This is a pretty decent tablet for the money. I purchased it for my grandparents to get them up to date with some technology. They were going to the library and having to wait in line to use computers all the time to check email and look things up. Now, all they need to do is walk in and start. They like the Android system ease of use.One thing to be warned of however. The power button cannot be pressed too hard or it will break away from the motherboard easily. I had it for 3 days before I sent it to my grandparents and ended up being unable to use the device because the screen wouldn't turn on or off. The button seemed really loose. So, I pulled it apart and needed to adjust the button mechanism on the motherboard. Then I managed to wedge some paper in between it to keep it positioned correctly when I put it back together (if you have this problem, you will see exactly what I mean and possibly how to do it). But, I warn you. If you are not mechanically inclined, don't attempt taking the unit apart! It can be easily fixed by the right person for little to nothing.Overall though, I would approve this unit and recommend it. Especially for the price.", "Title": "Good Cheap tablet", "Date": "March 14, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RBYWSLAZJ5PN7", "Overall": "5.0", "Content": "I am disabled and have a tendency to drop things.  Well, this little gem took multiple blows to our hardwood floors before finally shattering the screen.  I was so surprised that it went on as well as it did, and this time I have a cover coming with it.I was only disappointed that the camera works only one way for skype calling.", "Title": "The second one coming!", "Date": "March 12, 2013"}, {"Author": "mike", "ReviewID": "R1Q9ZPTG29Y4RE", "Overall": "2.0", "Content": "its ok pretty slow and sensitivity could be better other than that its ok i would buy it for a kid not an adult", "Title": "get what you pay for", "Date": "March 9, 2013"}, {"Author": "bnikiliabourne1", "ReviewID": "RQNJ7SX9CMOP3", "Overall": "1.0", "Content": "I HATE THIS PRODUCT.  IT STOPPED WORKING TWO WEEKS AFTER I PURCHASED IT.  I SENT IT BACK AND THAT WAS TWO WEEKS AGO.", "Title": "HATE IT", "Date": "March 8, 2013"}, {"Author": "Eder", "ReviewID": "R1G6PAPRTE03SD", "Overall": "1.0", "Content": "I bought three ZEEPAD Tablets all three of them I have had nothing but trouble with them getting hot, Screens turning black and shutting off and not turning back on this is only one of them.The second one the volume plus the on and off buttons would not work, and  get hot and turned off and would not turn back on. These two I had to pay almost 100.00 dollars for shipping and for shipping return labels. When I did received the ZEEPADs back they only worked for a coupled days and now the ZEEPAD are not working once again. The third one is not working either it turns on but all you see is black and color strips on it.I am very disappointed! They do not have a reboot on them and I hooked it to my PC and it would not even recognized the tablet. I have three that need to be repaired. The first two I sent in to be repaired cost me almost 100.00. I now have three that are not working and just the two that I have put more money in them then what I paid for them. all three of them need to be repaired.I believe the cost is much more than the ZEEPAD is worth. I would not highly recommend them to anyone. This item is a huge disappointment. I believe if something is wrong with a product that is manufactory defaults a customer should not have to pay to have it ship to and from the place of purchase.I have three of these and don't feel I should pay for shipping to and from for all three ZEEPADs. They where a waste of time and money.In the end I'm stuck with three worthless ZEEPADS.I should of spent the $400.00 to $600.00 dollars on an APPLE IPAD but I thought because the ZEEPADS/Android's would be better because you did not have stay with same apps. Boy was I wrong.WHAT A REP-OFF...!!!", "Title": "Faulty ZEEPAD!", "Date": "March 2, 2013"}, {"Author": "Jericha Hawkins", "ReviewID": "R1KUN7L33S004", "Overall": "4.0", "Content": "It is a great tablet for the price.  I bought it to use e-textbooks in class and it functions perfectly.  Not the fastest tablet, but I don't use it for anything elaborate.My only real complaint is that the specs say it has a standard 3.5mm headphone jack, but headphones don't fit in the jack.  I just ordered a 2.5mm adapter, so hopefully that helps.", "Title": "Good tablet for the price.  Headphone jack NOT 3.5mm", "Date": "February 27, 2013"}, {"Author": "kalina schauble", "ReviewID": "R3FUJNXA4D805N", "Overall": "4.0", "Content": "I really like the zeepad. It came before the final date. The company emailed instantlyWhen I emailed them. The only problem was advertised new and came with scratches onThe screen. It works great. The manual was a copy. But product performs fine.", "Title": "zee pad review", "Date": "February 25, 2013"}, {"Author": "Miss Holland", "ReviewID": "R29C5FYPVUQJMF", "Overall": "1.0", "Content": "I received this product friday and it broke sunday whole screen just went black but as far as returning it they were very helpful", "Title": "It broke in two days", "Date": "February 17, 2013"}, {"Author": "Jamie Donawho", "ReviewID": "R6UNLTEI37AA9", "Overall": "1.0", "Content": "It worked fine for a few days, now when I cut it on it won't go past the android screen ..  !!!!!!!!!!!!!!!!!!!!!!!", "Title": "It worked fine for a few days", "Date": "February 15, 2013"}, {"Author": "2tyme", "ReviewID": "R2K7XZTMT1KQ24", "Overall": "1.0", "Content": "did not work at all upon receiving so im giving it a 1.shudnt not even be that.but will see what happen after returning it", "Title": "did not work upon receiving", "Date": "February 14, 2013"}, {"Author": "Kevin", "ReviewID": "R316GWVH742IGI", "Overall": "1.0", "Content": "Had problems from opening the box. I guess you get what you pay for. I bought a samsung galaxy 7'' and Im very pleased.", "Title": "Crap", "Date": "February 13, 2013"}, {"Author": "Bert", "ReviewID": "R1MJU5TP0YUM5G", "Overall": "4.0", "Content": "I bought this as a starter tablet in order to see if I would like to invest in a higher end tablet later or buy a laptop.This tablet does a great job. The browser is a little slow at times but acceptable. I've had no problems with donwloading apps. Great for displaying photos and videos to family and friends. Be sure to get a mirco sd card with this. Right now I'm leaning toward a larger tablet.", "Title": "A great starter tablet", "Date": "February 12, 2013"}, {"Author": "Regina F. Love", "ReviewID": "R2RACSOTVZ1LHA", "Overall": "5.0", "Content": "Purchased about 4 of these this Christmas and they work great and everyone loves them.  My six and 7 yr. old grandaughters and my 26 yr old daughter all have them and they are user friendly.  My daughter watches movies on them and it works really good and the clarity is great.  My grandaughters played their mommy IPad so I figured these would be comparable for them..they play games on them and they are very educational with games fit for every grade level.  Love these", "Title": "Gifts for Christmas", "Date": "February 12, 2013"}, {"Author": "Malgorzata Czyzewska \"MaggieScarlett\"", "ReviewID": "R2JTV65FPE2AZS", "Overall": "3.0", "Content": "A good Android tablet for this price.  Runs Android Jelly Bean which is impressive, however it force closes a lot of the apps I try to run  It's good enough for my needs though (email, web browsing, facebook, some light studying).", "Title": "Good tablet", "Date": "February 9, 2013"}, {"Author": "dragonsmith", "ReviewID": "R2PNKJ6YKT9EIG", "Overall": "5.0", "Content": "THIS ZEEPAD FROM AMAZON DOES EVERYTHING THAT I NEED FOR IT TO DO. IT CONNECTS READILY TO THE INTERNET AND DOESN'T DROP CONNECTIONS VERY OFTEN ALTHOUGH IT DOES HAPPEN ON OCCASION. OVERALL I WOULD RATE IT A 5 STAR PRODUCT FOR THE PRICE THAT I PAID FOR IT.", "Title": "CHAD'S ZEEPAD", "Date": "February 9, 2013"}, {"Author": "Jesse", "ReviewID": "R2K02Q5833AXLC", "Overall": "5.0", "Content": "Bought two of these for grandchildren. They are 11 and 12 and we have only pried them from their hands to sleep. Fantastic product!", "Title": "Grandkids", "Date": "January 30, 2013"}, {"Author": "Sara N.", "ReviewID": "R3W1OEOKZ2LZCW", "Overall": "5.0", "Content": "My son is 10 years old and absolutely loves this tablet.  We read so many reviews trying to find a tablet that had Google Play on it.  This tablet had positive reviews and rightly so.  It was a breeze to set it up and get him playing.  He can maneuver around in the digital environment with no problems.  I love that!  Great buy.", "Title": "Great Product", "Date": "January 29, 2013"}, {"Author": "Kris Vinkovic", "ReviewID": "R2CTOKG4W771QS", "Overall": "2.0", "Content": "Screen is not bad, touch works good, looks ok, ( it was for my 10 year old doughtier- pink color) it's made from cheep plastic, Very Lite,WiFi works fine.Now for bad: No Support at all, Google Play will not recognize tablet, so you can download anything. Battery last for 1.5 hours the most. Micro SD card will come out and you will spend hour looking for it. It will stop responding from time to time, You have to do hard reboot.So if you are not Android geek and don't want to play with it all the time, and you just want to use your tablet like you should, don' t buy this spend another $50-$60 for Lenovo (I know it is not Pink) or other brand name tablet.", "Title": "It looks good ,but it is cheep Chinese product.", "Date": "January 28, 2013"}, {"Author": "Just34", "ReviewID": "R2UIH6USZ0V6WI", "Overall": "4.0", "Content": "I'm very impressed with this tablet. It has some nice features and works very well. The only minus is the short battery life.", "Title": "Quality Tablet for a Low Price", "Date": "January 28, 2013"}, {"Author": "Amazon Customer \"gadget freque\"", "ReviewID": "RH35SQV78AR19", "Overall": "3.0", "Content": "Tablet seems solid, clean build quality.  Very minimal built-in flash.  As received was way less than 1gb user storage space available.Screen resolution is very pixelated for small text.Unit I received had poor wifi sensitivity - way less than expected, makes it very slow unless you are close to wifi router/ap.Seems sluggish, even with strong signal and fast Internet connection, it takes painfully long to load common pages like CNN or Yahoo.  Insufficient RAM for Android 4.x.  Really need 1gb RAM to run well, this may account for sluggish performance.", "Title": "Well built, but sluggish", "Date": "January 28, 2013"}, {"Author": "Jeff Secord", "ReviewID": "R3AYY1YODSDFCK", "Overall": "4.0", "Content": "I got this Zeepad for my boys for Christmas and they love it! They haven't stopped playing with it since!", "Title": "zeepad", "Date": "January 26, 2013"}, {"Author": "M. Yurkovich", "ReviewID": "R12G8IERAJC5VW", "Overall": "4.0", "Content": "My first foray into tablets and I didnt want to spend a stupid amount of money, I dont need to know what everyone is doing every second of the day.This thing is quite nice - perfect easy to use, though some instruction booklet that you could read would have been helpful.Perfect for surfing - news - weather - reference - and yes facebook havent done movies, but have watched youtube on it and its quite good.", "Title": "Wow - that was really easy", "Date": "January 26, 2013"}, {"Author": "kesha", "ReviewID": "R6MZ10MNUP3W6", "Overall": "1.0", "Content": "It took three/weeks to come only to not, work! It was deliverd broke and they want me to pay 120$ to send it back. I dont think that's fair that's more than the tablet now they won't respone?", "Title": "I want answers", "Date": "January 25, 2013"}, {"Author": "JOBO K.", "ReviewID": "R3CCS8XGS6JY97", "Overall": "4.0", "Content": "This was a  Christmas gift for my son and everyone has enjoyed the android.  We are not techies but it was very easy to set up and use.", "Title": "Great Gift", "Date": "January 23, 2013"}, {"Author": "Sandra eShazier", "ReviewID": "RIUHFDKTBC419", "Overall": "4.0", "Content": "I bought as a gift for my high school daughter. She loves it because it is small and easy to use. I did buy additional memory. We haven't downloaded movies yet.", "Title": "Zeepad", "Date": "January 23, 2013"}, {"Author": "Telina", "ReviewID": "R16Y8R03A6IRJC", "Overall": "3.0", "Content": "My daughter absolutely love this product but as she push the power button it completely went down and then the sound went out...", "Title": "Power Button/Speaker", "Date": "January 15, 2013"}, {"Author": "Bill Coffman", "ReviewID": "R2N0CF068FP8P5", "Overall": "4.0", "Content": "The tablet works good. Apps good, internet connection and all.  Only problem is the charger broke after about 2 weeks.", "Title": "works good", "Date": "January 14, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RK8WVV5ICGM45", "Overall": "4.0", "Content": "It can be slow at times and require a few taps for it to respond but all in all, my nephew enjoys it.  Easy to navigate and use.", "Title": "It is a good tablet for a kid.", "Date": "January 14, 2013"}, {"Author": "Orlando Nunez \"Orlando Nunez\"", "ReviewID": "R2J9O8XQ3L812S", "Overall": "4.0", "Content": "Product as describe. Would buy again. I would gave 5 star if it give a tracking number. On your order status there a tracking number button but everytime you click on it never give any tracking number but other than that great product mostly best for kids.", "Title": "Product as describe", "Date": "January 14, 2013"}, {"Author": "Tracy B.", "ReviewID": "RYOO5MLE2QV0L", "Overall": "4.0", "Content": "I bought this for my kids for xmas & they really like it. Within the first day they were fighting over it. I should have bought another one! Good tablet for the price.", "Title": "Great gift", "Date": "January 13, 2013"}, {"Author": "lyn", "ReviewID": "R3GXPVDTS3SBU6", "Overall": "3.0", "Content": "I bought 4 new zeepads for my kids ages 13 to 8. They love it. Perfect for price. Like I said I bought 4 had to return 1 to get replaced taking a while :(", "Title": "lyn", "Date": "January 12, 2013"}, {"Author": "Elkin", "ReviewID": "R3AT70FHZN0AUA", "Overall": "4.0", "Content": "Mi experiencia con el producto es muy buena, es rapida, para el precio que tiene es muy buena compra la recomiendo.", "Title": "Zeepad 7.0 Allwinnwer A13 Boxchip Cortex A8 Android 4.0, 4GB Capacity, 512 MB.", "Date": "January 12, 2013"}, {"Author": "A. Chiriboga \"Dats it!\"", "ReviewID": "R2DGYVBU426ZUF", "Overall": "3.0", "Content": "I was thrilled when I realized I could gift a nephew with a touch-pad so he could enhance his writing skills. I waited for the package to arrive and it did, well ahead of the other recommended things by amazon.Unfortunately, while attempting to place the writer's, diaries and other apps, I quickly discovered it is not zoned for a worldly market. It is a Pan Asian product that has a time zone setting as far as turkey, and cannot be placed on the Proper timeline. This, I can already see will be a problem when the web based apps attempt to SYNCH. This is the only reason i subtract 2 stars. No thing should ever be a \"Surprise!\", when you cycle through it's features. No, it should be foretold ahead of time and guaranteed to work (in the western Zone). It is great, other than that, since this is a child's introduction to his talented development via a touch-screen/pad.Hopefully, Amazon stops surprising their customers. They fixed many things and this is just another fix needed.______-------Added------_________After ordering a keyboard, I found that the recommended keyboard/case did not work with it.I also found out that the settings on it are very limited and people, beware, Like the spam mail in you In-box, this has many \"go-to\" adds on many of the apps there.so If you are going to give to children, make sure they do not have CC information nor access to it.If you could tther it, even better. It could turn out to cost you more than you wanted.", "Title": "OK for a child", "Date": "January 11, 2013"}, {"Author": "matt dailey", "ReviewID": "R30YT2UITLC2KO", "Overall": "4.0", "Content": "excellent product for price,my wife seems to love it . some games such as bingo blitz, you can only play 2 cards instead of 4, i guess because of size.", "Title": "zeepad 7.0", "Date": "January 11, 2013"}, {"Author": "Fred King", "ReviewID": "R1N75VNDDO0CMU", "Overall": "4.0", "Content": "This was purchased as a Christmas present for my Grandson, and he loved it. I also ended up purchasing a key board to go along with it.", "Title": "Zeepad 7.0", "Date": "January 11, 2013"}, {"Author": "pissed off", "ReviewID": "R3HKS87B92YVE2", "Overall": "1.0", "Content": "NEVER GOT MY ORDER THESE PEOPLE WILL  TAKE YOUR MONEY AN WILL NEVER RESPOND TO YOU AGAIN!!!!!!! DON'T FALL FOR IT!!!! THESE PEOPLE STOLE MY CHILDS CHRISTMAS GIFT!!!!!!", "Title": "DO NOT BUY!!", "Date": "December 26, 2012"}, {"Author": "kmiles", "ReviewID": "R1WD4YXSD0Y24R", "Overall": "1.0", "Content": "We purchased this for our 9 yr old daughter for Christmas and were very disappointed.  The second you add maybe two apps to the thing, it completely freezes, crashes or simply turns off.  DO NOT PURCHASE THIS ITEM.  If you are looking for a tablet for a kid, you're better off spending a bit more for something that actually functions, or even a Nintendo DS (they can play games and watch netflix/youtube on that too!).  I should have figured that it would be junk based on the price, but the fact that they're still trying to charge even this much is a joke.", "Title": "JUNK JUNK JUNK! Avoid this item!", "Date": "June 9, 2014"}, {"Author": "iginah", "ReviewID": "R1I9IGZO4PMNAR", "Overall": "5.0", "Content": "My two girls (9 and 7 yrs old) love their tablet. They do their basics. Go online to play games and thats pretty much it. I wouldn't recommend it for an adult. It has sort of a lag and the screen resolution isnt the best. But overall we like it!", "Title": "Great for kids", "Date": "June 5, 2014"}, {"Author": "Dell L Rice", "ReviewID": "R2NR7SAABZPUC0", "Overall": "1.0", "Content": "This thing only lasted a week. We had to go to a local store and have it replaced with another one which means we spent more money. The battery did not hold a charge.", "Title": "Do Not Buy!", "Date": "June 3, 2014"}, {"Author": "Owen Tucker-Smith", "ReviewID": "R184TRQV6U4CR0", "Overall": "1.0", "Content": "I purchased Zeepad because I didn't want to spend too much money on my first tablet. It came in a box, and when I turned it on, It looked great. It had all these applications, and in a few seconds I had temple run. I was bringing it up the stairs. At the top when Iset it down from a few inches of the ground, instead of just landing clean like most tablets, the screen broke offpretty soon I put it back together. Right when I did, the battery ran out. Really short battery! When I recharged it, I seeked it again and pressed the power button, it went to a lock screen, but I couldn't unlock t! It didn't ask me for a password, or anything like that. It just stayed on that lock screen. Thats when the power went out for good. So it was a wonderful tablet. But it breaks and stops working so quickly after you buy. Great 1 week tablet, but terrible structure!", "Title": "Amazing... until it stopped working!", "Date": "June 3, 2014"}, {"Author": "Tia Char", "ReviewID": "R3SYIQAZTUD8HW", "Overall": "3.0", "Content": "This is my 3rd replacement Zeepad now. Since I sent for this one I have had 2 more fritz out on me within a couple days of each other so I am not too impressed with them anymore.", "Title": "Same as my other one. Its a replacement fomy previous warranted item", "Date": "June 2, 2014"}, {"Author": "Will", "ReviewID": "RUCAYV39QDO3F", "Overall": "4.0", "Content": "Was nice for my grandchild but technology moves at such great speeds it did not get much use. I will save it for my visitors that get bored with their children.", "Title": "Tablet", "Date": "June 2, 2014"}, {"Author": "Best GrandEver", "ReviewID": "R1XYOX1FRSJ3NN", "Overall": "5.0", "Content": "Bought this for my husband to \"play with\" over a year ago and it is still going strong.  He reads news, emails, etc. and plays some games on this little tablet, and it is still going great.  I would recommend it for someone who does not do a lot of downloading, fast paced game playing, etc.", "Title": "GREAT LITTLE TABLET", "Date": "April 24, 2014"}, {"Author": "drena webb", "ReviewID": "R6QLAXVZ8ND2T", "Overall": "5.0", "Content": "she loves it she uses it for everything she shares and teaches the smaller kids how to use it for when they get theirs", "Title": "drena webb", "Date": "April 22, 2014"}, {"Author": "Carl Traister", "ReviewID": "R2TB7YN35TKKXJ", "Overall": "5.0", "Content": "It is a great tablet that runs everything we have thrown at it so far. It arrived a day before it was supposed to.", "Title": "Great tablet", "Date": "April 20, 2014"}, {"Author": "super5000ify1", "ReviewID": "R199N5A6NEVP92", "Overall": "2.0", "Content": "Ok, this worked for about 2 months before it broke. I didn't even drop it. The thing just stopped working. What can I expect from an $80 tablet? Anyway, luckily I had a warranty because they refunded it fast and it was easy. (Although I would recommend just not buying this at all.)", "Title": "GET A WARRANTY OF YOU'RE GOING TO GET THIS", "Date": "April 18, 2014"}, {"Author": "megan", "ReviewID": "R208CRBV40LQKR", "Overall": "1.0", "Content": "I purchased three for my kids... none of them work. I wish I would have returned them right away. They don't hold a charge, they glitch, they are awful... :(", "Title": "Spend the extra money and get a good tablet.", "Date": "April 18, 2014"}, {"Author": "Bkharris", "ReviewID": "RTX7VFV57GG27", "Overall": "1.0", "Content": "Not I got this for my 10 yr old for Christmas and its only been a few mos and it no longer charges! Don't waste your money! I want a refund!", "Title": "Pink Fun", "Date": "April 17, 2014"}, {"Author": "Erika Coker", "ReviewID": "R1RPOMNA7SGKGW", "Overall": "3.0", "Content": "I found this product when shopping on Amazon. I wanted to purchase a pad for my granddaughter to watch you tube or play games. She is two. While the product itself is nice looking and works fine, but it is very slow. When it turns on or uploads videos and/or games it does not meet the needs of a 2 year old wanting to watch a video...she want's to watch it now. When I use it for things, I realize it is going to be slow and can work with it.Giving it a rating of 3 isn't necessary a negative thing...it is a good product for the price point!", "Title": "Zeepad", "Date": "April 15, 2014"}, {"Author": "Kathy M.", "ReviewID": "R1SLAIFL9GPM9Q", "Overall": "5.0", "Content": "This worked well for my 7 year old granddaughter. She has enjoyed playing games on it. I would recommend it", "Title": "great", "Date": "February 6, 2014"}, {"Author": "ERIC O.", "ReviewID": "R2H4995X4TSH0K", "Overall": "4.0", "Content": "The device performs more functions than anticipated. However, the speed leaves much to be desired. The battery also runs down too quickly.", "Title": "Review for Zeepad 7.0", "Date": "February 5, 2014"}, {"Author": "Kiril Dimoski", "ReviewID": "R3VPLQLV78MU3N", "Overall": "4.0", "Content": "i got product on time and it is as described ... i still have it and i am very pleased how it works ...if u have need of tablet this is the one", "Title": "nice", "Date": "February 4, 2014"}, {"Author": "Lizzie", "ReviewID": "R1WJ3924QONB6Z", "Overall": "1.0", "Content": "I got this for my son for Christmas, and it is already completely broken.  We just missed the cut-off for return, which was January 31st.  I would not recommend this product.  When we try to turn it on, lines come across the screen.", "Title": "Already Broken : (", "Date": "February 4, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1VK84R2EE2VSV", "Overall": "2.0", "Content": "VERY cheaply made. Buttons felt like they were going to fall right off. Nice and light and slim but returned because I didn't think it would last a week...", "Title": "cheaply made", "Date": "February 4, 2014"}, {"Author": "Kristen M Bass", "ReviewID": "R3R39LNL1DOS1M", "Overall": "4.0", "Content": "I have two of these. They work great! I have had one over a year, it's been dropped and used by 3 different kids of all ages and still works great. So I got my oldest son one and he loves it! Great buy.", "Title": "Nice Tablet", "Date": "February 2, 2014"}, {"Author": "Alisa Dickson", "ReviewID": "R2TQN6GXVI9ZAQ", "Overall": "1.0", "Content": "First, to clarify, I did not purchase this item from Amazon. But my review is for this model of Zeepad. I am so disappointed and frustrated with this purchase that I wanted to submit a review to save others the time, hassle and money. The first problem occurred when I attempted to read the user manual before doing anything with the tablet. It was horrific! The manual was written with english words but the grammatical errors, spelling errors and everything else about it was so poor that I couldn't make sense of it. It was like reading a different language with english words. Once I let it charge for the day I gave it a try, only to be completely disappointed! I realize I didn't purchase an iPad so I was willing to give it a chance. I tried to play a netflix from it only to find that I could hardly make out the image on the  screen. I also had to hold the tablet at one exact angle in order to even see anything. The sound was so poor I couldn't tell anything was even coming out of the speaker until I turned it over and held it right up to my ear. (That was after I had turned up all of the sound). The final complaint and what lead me to my decision to return it, (as if the above is not enough) is that there is such a delay when pressing an icon that I felt like I had to keep pushing it to make sure it was recognizing my touch. Actually, I can't say there is anything good about this tablet. Buyer beware, Do NOT but this! I don't even want to give it one star. It doesn't deserve it!This is by far the worst item I have ever purchased off the internet.", "Title": "Buyer BEWARE! Junk!", "Date": "February 1, 2014"}, {"Author": "Dobiedude", "ReviewID": "R3QKRVQ45S7L5K", "Overall": "5.0", "Content": "I am using this as an engine monitor in my truck. Downloaded an app for this. Internet is a bit slow.", "Title": "Works great.", "Date": "January 31, 2014"}, {"Author": "fangal", "ReviewID": "R1QHF0ZZ3YBNP1", "Overall": "5.0", "Content": "I sent this to my grandson.  He loves it! He is able to look up his own videos and play games he likse. We are looking forward to his learning a great deal from it. And he doesn't have to borrow our phones to play!", "Title": "Grandson's gift", "Date": "January 31, 2014"}, {"Author": "Ben O.", "ReviewID": "R3N0SSZ02HKWFP", "Overall": "1.0", "Content": "The Zeepad was purchased for my 10 year old nephew for Christmas. It arrived and I could tell from the beginning that we were going to have trouble. The earphones would not fit into the Zeepad. We chose to keep it anyway at that point. Within 5 days, we started having trouble logging on and staying logged into wifi. A week later, we could not even get the thing to turn on. It was fully charged and would not turn on while plugged in or not plugged in. Needless to say, my nephew was disappointed and I felt like a complete loser aunt!", "Title": "Horrible purchase", "Date": "January 30, 2014"}, {"Author": "Kristin S.", "ReviewID": "RB9UKL2L5EJ3S", "Overall": "5.0", "Content": "This Tablet is a show stopper, its choice in colors help my children determine which one is theirs. It came with the Angry birds already downloaded and the shipping was extremely fast. Sleek looking and excellent quality. Just what we needed! Thanks", "Title": "Great my children loved it and the colors were amazing! Thanks will shop again.", "Date": "January 13, 2014"}, {"Author": "jonathan orsini", "ReviewID": "R1D2Y5Y69U4AMJ", "Overall": "1.0", "Content": "I've had numerous problems with the tablet since I opened it from the package.the charger port doesn't work anymore it keeps shutting off by it self and erases the entire tablet back to its original state", "Title": "Tablet is a headache", "Date": "January 7, 2014"}, {"Author": "JH", "ReviewID": "R2GO0PY2UAFYTR", "Overall": "5.0", "Content": "Bought this zeepad 7\" tablet for my 7 yr. old granddaughter for Christmas.  I played with it and downloaded some free games and bought some music (it does come with 2 or 3 games already on it which is good).  Then I charged it up so it would be ready to go when she opened it.  She absolutely loved it.  I did find a place to set the security also.  It worked great with our wifi and does internet searches quickly.  I think it is just as good or better than the more expensive tablets.  I love that it came with a USB cable to connect to a computer and also earphones and a stylus pen.  It also plays the music purchased from iTunes that I transferred to it and my other granddaughter's more expensive kindle will not.  If you give it as a gift and you enter your google account to download anything just remember to delete the account before you give it since it downloads your emails in the gmail.  I did have a hard time finding how to delete my google account from the tablet but once I did, it deleted the 300 emails it had downloaded.  Oh and it arrived much quicker than expected.  I think this was a great purchase for the money and would like to get one for myself.", "Title": "Great Tablet!", "Date": "January 7, 2014"}, {"Author": "Paige C.", "ReviewID": "R3PAFP2JEKRMDX", "Overall": "2.0", "Content": "We have had it less then a year and the internal battery died. This is not the battery that you can replace or charge. Waste of money.", "Title": "within the year it stopped working", "Date": "January 7, 2014"}, {"Author": "Susan Wolff", "ReviewID": "R29YKR9M28BDUX", "Overall": "5.0", "Content": "This is a great value for a first pad. Works great and it has room to grow with you. And I love the color. Its so bright and cheerful.", "Title": "Perfect Starter Pad", "Date": "January 7, 2014"}, {"Author": "Stephanie Ham", "ReviewID": "R2KAWZ8NMQC01X", "Overall": "4.0", "Content": "The 9 year old that it was given to for a birthday gift loves it n does what she needs it to.", "Title": "awesome", "Date": "January 7, 2014"}, {"Author": "Beth", "ReviewID": "R307NSBWOIYBI", "Overall": "1.0", "Content": "Bought this for my husband as a Christmas gift...powered it on once...worked fine.  Now it will not power one any more.I do not recommend purchasing this item as you will only be contacting Amazon shortly after you receive it for a refund.", "Title": "Cheaply produced", "Date": "January 6, 2014"}, {"Author": "ksolt", "ReviewID": "RIA3K2VKZMDU2", "Overall": "4.0", "Content": "Great price. works well. bought 2 for christmas gifts for my grandchildren (ages 4 and 7). they have not put them down. We got the \"best\" gift award from them both. would suggest getting protective case.", "Title": "best gift award", "Date": "January 6, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R7S616P3TIQQ7", "Overall": "4.0", "Content": "We bought 2 Zeepad for our daugthers's Christmas. They are great! More than enough for kids!Many apps like Netflix and Skype are pre-installed, but we had the instal a newer version of Skype to do video call!One thing that could have been better: the cord is quite short! So if you want to use the tablet when charging you have to be pretty close to the outlet!", "Title": "Great tablet!", "Date": "January 2, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3OAJTTYWO324J", "Overall": "3.0", "Content": "very good lil tab the only thing i dont like about it the battery life sucks.... buy a kindle or samsung if u want longer battery life", "Title": "zeepad", "Date": "January 1, 2014"}, {"Author": "cassandra", "ReviewID": "R1UCT014YJ5W34", "Overall": "1.0", "Content": "bought this item the beginning of this year and we used it for two weeks and for the last year i have been trying to get this piece of junk to work. it keeps saying too many pattern attempts and refuses to let us login. there is no reset button to be found on this tablet and hard reseting it is impossible. so im stuck with a junk tablet and a waste of money!!!!! finding a site for the seller or product is hard and cant get any help to see what to do to try and fix it. i would recommend staying away from this brand of tablet. if you search the internet you will see where so many people are in the same boat as me with the same problem!!", "Title": "do not buy", "Date": "December 31, 2013"}, {"Author": "Jasbir Sidhu", "ReviewID": "R3ONEDPI5B7PI4", "Overall": "1.0", "Content": "I bought Zeepad online and failed out of box. The device was not able to get beyond initial screen and not able to unlock the device. I would recommend anybody to purchase this device", "Title": "Failure out of box", "Date": "December 30, 2013"}, {"Author": "mary_clyne", "ReviewID": "R25QKEDX8R14Z9", "Overall": "3.0", "Content": "Bought this for my grand daughter and it seemed to be working OK for now. will give a better review after i see if continues working.", "Title": "nice!!", "Date": "December 30, 2013"}, {"Author": "lace", "ReviewID": "R296L1C9M4CB7A", "Overall": "1.0", "Content": "My daughter's father bought this tablet. We followed the instruction's and let it charge for the whole 5-6 hrs. Poor battery life, screen freezes up and then the display went out. I ordered the tablet on amazon which I do not shop any more. When we tried to return it there were lots of problems. Amazon said to contact the seller the seller said contact the manufacture, so we contact the manufacturer of the tablet. They give him a address to send it to along with a money order request to fix the tablet. He sends the money order and the tablet the same week he spoke to them via phone. Two weeks later when he calls he talks to random people at the company. They tell him they have the tablet but did not have the money order. To make a long story short. He was out of a tablet and the money he spent on the tablet also the money order for the repair. Too much trouble for a cheap ass tablet.", "Title": "Do not buy it!", "Date": "December 28, 2013"}, {"Author": "mary", "ReviewID": "R1KXK3IMHD6K0Y", "Overall": "5.0", "Content": "I really liked it - but I dropped it and had to buy a new one.  I thought maybe there would be some kind of an insurance for replacement - but since it was my fault - I would guess not.", "Title": "Android", "Date": "December 28, 2013"}, {"Author": "Online Shopper \"onlineshopper\"", "ReviewID": "R2SC023DJZCGD2", "Overall": "1.0", "Content": "The description says it all.  I bought 2 of these for my granddaughters Christmas in 2012.  They didn't last till February.  Don't waste your money.  They are crap!!!", "Title": "Total junk...", "Date": "December 26, 2013"}, {"Author": "JK Honeycutt", "ReviewID": "R1AZQP006BZ7E5", "Overall": "1.0", "Content": "I bought 2 zeepads. At first everything seemed great until I noticed the micro USB port was missing from 1 tablet. In its place was an empty hole where the port should've been installed.", "Title": "Crapola...", "Date": "December 26, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RCQ3UAG77BG5J", "Overall": "2.0", "Content": "Unfortunately we bought this for our 4 year old daughter to play games on and didn't want to invest a lot of money; however it only worked for about 6 months.  It was nice while it lasted but now it won't hold a charge.  Even with a new charger, it barely powers on while plugged in.  Won't turn on at all without being plugged in.", "Title": "Didn't last at all", "Date": "December 25, 2013"}, {"Author": "Erin Storey`", "ReviewID": "R10S2ZLCVF82KG", "Overall": "5.0", "Content": "I bought this for my sons birthday present, we wanted a tablet for him that wasn't crazy expensive but he could play games and read books, and even go onto facebook.  It is the perfect size and works great!!  The only problem I had was once trying to connect to the internet. I fixed the time zone and it connected right away. It is set up just like my Galaxay Tablet so the set up for us was real easy. Great product for a Great price!!", "Title": "Great Product for a Great Price!!!!", "Date": "October 25, 2013"}, {"Author": "Michael Riddle", "ReviewID": "R19XASUNOU23TB", "Overall": "3.0", "Content": "My tablet came with Jelly Bean 4.1.1 NOT ICS 4.0.4, and was NOT rooted. Luckily there's a program called Uberizer that can root 4.1.1 for any A13 device. The downside right now is there is a 4.2.2 update, but it's not rooting right...Overall, if you're just looking for a simple tablet for a kid to play with or something it's not to bad -- I plan to use it for my car's touchscreen/computer and am going to have to do a lot of tinkering to get it working how I was hoping.", "Title": "It's alright, few serious things though.", "Date": "October 23, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1G620MR2S28P3", "Overall": "3.0", "Content": "my bf bought this for a gift for his little teen cousin. it was just ok for us because when we got it we tried it out and it was slow but great for a child or teen. she seem to enjoy it when she got her gift.", "Title": "bought for a gift", "Date": "September 17, 2013"}, {"Author": "adam minnicks", "ReviewID": "R1O4PE7RHS3N5I", "Overall": "5.0", "Content": "I ordered two of these for my kids' birthdays and the company said they were used but in good condition. They were brand new with nothing touched. They work perfectly for my kids aged 6 and 9. They can play their little games and go on youtube like they were doing with mommy's kindle. Now they don't have to use mommy's or fight over just having one tablet. Wifi works great, and the company sent them right on time. I'm very happy as usual with amazon. I always find a great deal on here.", "Title": "Exactly what I ordered.", "Date": "September 17, 2013"}, {"Author": "Laura", "ReviewID": "R2SBQ7GTZJKQGO", "Overall": "5.0", "Content": "This is perfect for my daughter's 1st tablet! It came loaded with some of her favorite games and its super fast for her to download new ones.  It turned right on and connected to our wifi with no problems.", "Title": "Great for my 8 year old!", "Date": "September 14, 2013"}, {"Author": "ariona_lie", "ReviewID": "R8BLSJKMTFDBN", "Overall": "2.0", "Content": "Well where do I start with this thing. I read the review, but they were pretty mixed so I decided to try it myself. Now, when we first got it, we let it charge ALLLLLLLLLLLLLLLLL Night (xmas eve) My daughter was so excited, but - well it wouldnt turn on... FINALLY after another day of charging it turned on. My daughter who was 9 at the time started downloading apps - Youtube, Sugar Crush, Instagram, Angry Birds.... welllll......................skype didnt work too well, You cant see the whole game of sugarcrush - but Pandora and Youtube work just great (as long as its charged) I would next time keep my money and get a better name brand - but I guess now my 3 year old can have it...", "Title": "It works - Kinda", "Date": "September 10, 2013"}, {"Author": "Cb", "ReviewID": "R1T1OONHDNNS4U", "Overall": "5.0", "Content": "Works perfect. I am going to place 2 more orders. My friends and family will do the same. The tablet is amazing. I recommend it 100%  Thank you for my happiness!! God bless this company!!", "Title": "THIS IS JUST WHAT I WAS LOOKING FOR!! AMAZING", "Date": "September 10, 2013"}, {"Author": "Cynthia Hunter", "ReviewID": "R11ROGZO3GOZ88", "Overall": "5.0", "Content": "Zeepad is for my six year old.  It is a great price. It does everything we need it to do. This is our second one even.  Perfect for his age group.  So many features.  This is good for anyone looking for a nice tablet at an affordable price. If I have any negative it would be that battery life is short.", "Title": "just what I needed", "Date": "September 10, 2013"}, {"Author": "Laura Mae Coker", "ReviewID": "R25LYWZJZTD0UM", "Overall": "5.0", "Content": "These tablets are at a great price and have so many functions. My grandkids love them! And I like them too!", "Title": "Great tablet", "Date": "September 10, 2013"}, {"Author": "Michael C Smith", "ReviewID": "RDIVMUCANE7DX", "Overall": "3.0", "Content": "We have 2 in our home and mine rarely gets used since I have a smartphone now. My son uses his on a daily basis and they are both about 9 months old now. The first one I received on here didn'[t work properly. The screen did not respond on one corner. The newest replacement works fine. For the price it's a decent buy, but I do wish the processor was a bit faster and the wifi would connect faster. My smartphone runs circles around this. But what can you expect for the price? Just plain and simple...........IT WORKS!! Browse, email, and play games. That's all I do with it.", "Title": "Excellent for kids!", "Date": "September 9, 2013"}, {"Author": "James H. Weimar II", "ReviewID": "R3MEJSVUNUAF83", "Overall": "5.0", "Content": "exactly what I wanted. only problem, it does not fit securely in the keyboard case I purchased for previous Zeepad.", "Title": "allwinwr is great buy.", "Date": "September 9, 2013"}, {"Author": "LATOYIA OLIVER", "ReviewID": "R1W6S5NOW6WVK3", "Overall": "5.0", "Content": "bought this for my 14yr old daughter...she loves it..and the price..shipping..all worth it!..she enjoys it very much.and they had plenty of colors..which yellow is hers..very hard to find..i would definatley recomend.", "Title": "great buy", "Date": "September 8, 2013"}, {"Author": "Victor Pinkney", "ReviewID": "R1TIVSZV64JHMD", "Overall": "1.0", "Content": "Was not a good tool for me for my line of work. Which is storing, comparing, and sharing data. Was not satisfied", "Title": "Dissatisfied", "Date": "September 8, 2013"}, {"Author": "Andrea", "ReviewID": "R2V0D6D7NOZ53P", "Overall": "5.0", "Content": "I got this for my 6 year old because I didn't want to spend $400 on something he may end up breaking.  It worked perfectly, google play already loaded and he has so many games to keep him occupied on car rides.  We did have an issue and Wholesale California promptly addressed and corrected the problem, - couldn't ask for better customer service.", "Title": "My son loves it!", "Date": "September 7, 2013"}, {"Author": "E. Scinta", "ReviewID": "RIUBBM0UE88IS", "Overall": "4.0", "Content": "Bought this for my 10yr old daughter because she wanted a tablet of her own. I didn't want to spend a lot of money in case she broke it or didn't take care of it, so after looking on here and reading all the reviews I bought her this one. I gotta say I was really surprised with this because I was expecting it to be on the lower quality side because of the price. But it's actually really nice. Have a lot of pros and some cons for this tablet:Pros:-Very heavy duty but still light weight which I like. Seems like it'll last longer and it doesn't seem like it'll break easy if dropped.-Came with a bunch of stuff including charger, stylus, headphones and 2 USB chords-Very easy to set up WiFi and all the time/location settings.-Going between screens, closing out programs and personalizing tablet is super easy to do.-WiFi connectivity is great and have had no problems connecting to the house router and actually picked up a ton of other routers in the area too when it was searching for connections.-Touch screen works great. Using the stylus works even better.-All apps seem to work well - liked how there were a lot already installed like YouTube and Angry Birds.-Big pro for me was that you can turn this tablet off and on to save battery life. And it doesn't just go into \"sleep mode\" like the ipad, it actually turns off which is very nice.-Like how there's a slot for the SD card to add more storage to device.-Camera seems to work great. Can take pictures or record video and switch between the dual cameras. (Resolution is meh though - see below in 'Cons')-Charging is actually really quick. Takes maybe an hour or so to get the battery up to 100% once it's down to nothing.-Gets all the same apps as the iPad using the Google Play store (pretty much it's just like an Android phone but bigger and you can't make phone calls)Cons:-Will lag if you have too many programs open at the same time (which makes sense as the memory isn't that high).-Speakers aren't all that great. I think that's why they included the headphones because the highest volume is still kind of hard to hear sometimes depending on what you're listening too.-Resolution is alright. Not as good as the ipad or Windows tablet though. But it's not horrible, just not HD or anything.I'd definitely recommend this for a kid that wants a tablet. So far my daughter LOVES this and hasn't put it down since we gave it to her.", "Title": "Really nice for the price!", "Date": "September 7, 2013"}, {"Author": "Cevyn L. Miles-monaghan", "ReviewID": "R1EGB80WLJ2W6N", "Overall": "1.0", "Content": "I ordered this tablet for my wife to play casual games on.  For that purpose, and considering the low price, it works great.  Mine came with Jelly Bean pre-installed.  The box even says \"Jelly Bean\" on it.  The About screen in the OS confirms this as well.  Unlike other ZeePads with Android ICS, this updated model was NOT rooted out of the box.The first thing I did to prep this for her was to root it using \"Root with Restore by Bin4ry\", from the XDA forums, and then installed Ad-Away and Root Cleaner.  I also uninstalled the apps and games she doesn't use to free up some memory - root not required.Battery life is so-so.  A couple hours of gaming will kill it, but it lasts a decent amount of time for other tasks.  The back of the tablet does get quite warm while gaming.  Performance is decent, however a task killing app is useful for freeing up some memory.  The screen is OK as well and responds to touch accurately.  The viewing angle is quite limited compared to a high end IPS display, though the update speed is plenty fast for her games and doesn't exhibit motion blur.I didn't find any Chinese spamware on this tablet as I did on the Star N9500 phone that I purchased and reviewed here on Amazon.UPDATE 02-20-2014: The tablet has degraded substantially with light use.  Random lockups, reboots, green lines on the screen and other anomalies make it pretty much unusable.  I even flashed the latest stock firmware, and without any additional apps installed the same problems are present, indicating hardware failure.", "Title": "Lasted 6 months with light use and no abuse...", "Date": "September 7, 2013"}, {"Author": "Wayfinder", "ReviewID": "R1CVI842HDPYEN", "Overall": "3.0", "Content": "I hate writing this kind of review, because I don't know whether to review the product or the advertising/shipping.  So, giving it 3 stars as a \"belated thumbs up\".THE PRODUCT.  The Zeepad itself is fairly awesome.  It's decently fast.  Decently responsive.  I like the way Android is set up on it-- not a bunch of extra brand-specific garbage.  Easy to use.  Speaker is acceptably loud.  No bluetooth but that's as advertised.  Love the multi-function USB port.  Love that it charges either from the charger port or USB.  For the price, this is an impressive little tablet.  Didn't like the 800x400 screen pixels... too few really.  But it works and aside from typical \"short freeze\" lag factors common in Android devices, this is a great little system at $70.  The device itself I give a solid 4+ stars.THE SHIPPING and ADVERTISING.  Not so spiffy.  The ad seems to change from time to time and what was originally listed as \"up to 1200 x 600 graphics resolution\" turned out to be significantly less.  In truth, 800x400 just doesn't quite cut it.  It limits the number of icons one can have on one screen.  Now if that had been advertised would be fine.  Noticed at times the screen says just that.  But at other times it advertises the 1200 x 600 and (while I don't know why), that's going to cause problem expectations.But the real problem I had (and what knocked this down to 3 stars), when purchased from \"WorryFree Gadgets\"... it came shipped in its own box loose-packed inside an Amazon box-- no padding to keep it from bumping around.  Meh, these packages take quite a bit of bumping anyway, so not too worried.  But... Amazon box was in fine shape while the Zeepad box was significantly crushed.  Since the outer box was fine, that means it was PACKED in that condition.  As a result while the Zeepad itself seemed okay, the screen protector packed as a \"bonus item\" in the top of the box was also crushed.  Not happy with that.The bonuses were nice.  The Zeepad stylus, the screen protector (if it hadn't been damaged *at the time of shipping*), the mini-usb adapter, everything was fine.  But I don't have much tolerance for a merchant taking a visibly and significantly damaged box and going ahead and shipping it without even inspecting the contents.  That's lazy and it's just not right.So... three stars.  Like other users I give the Zeepad itself a thumbs-up value-for-the-buck rating.  For the shipping and merchant care, not so much.  The question I have:  was it shipped directly from the merchant or from Amazon itself?  The screen said \"Sold by Goodios and Fulfilled by Amazon.\"  So which is it... Worry-Free Gadgets, Goodios or Amazon to blame for shoddy packing?  Who crushed the inner box and who sent it out in that condition?  Dunno.  It got it returned though, and Amazon was great about that as always... with a refund to my account in less than 24 hours and free UPS pickup (just cannot beat Amazon on customer service).This is a product that cannot be exchanged, only returned.  That's fine because in truth, I want a bit better resolution screen if available-- and the new Zeepads are just now hitting the market with DOUBLE THE MEMORY for about $10 more (nice coincidence there).Despite the problems I still <3 Amazon, and the Zeepad is everything everyone raves about.  For a starter Android tablet or one for kids... this is a good choice.", "Title": "Mixed feelings", "Date": "September 6, 2013"}, {"Author": "Deashia Henderson", "ReviewID": "R3RD0BSG5GYMF9", "Overall": "2.0", "Content": "This Tablet is at a very affordable price for a reason the quality sucks. When I first got it I changed the way I lock it and it took forever before it would let me in then it would always freeze when I got on the internet the Skype installed wouldn't let me video call anyone it didn't even give me the option and the tablet just froze too much. My main problem was the freezing it froze even if I wasn't doing anything but listening to music tonight it froze and stayed frozen. DO NOT PURCHASE THIS TABLET IT IS A WASTE OF MONEY YOU WILL BE DISAPPOINTED IN THE END I PROMISE.", "Title": "PAY FOR QUALITY!!!!", "Date": "September 5, 2013"}, {"Author": "angel", "ReviewID": "RUF3U3JMCR5BM", "Overall": "1.0", "Content": "This is the worst tablet ever brought this for my 11 year old son it work for a week then it stop coming on it just kept loading and never came back on it was garbage with in a week of purchase..don't waste your money", "Title": "unhappy", "Date": "September 5, 2013"}, {"Author": "Doug Jones", "ReviewID": "R32YAFLIKQXJ0W", "Overall": "2.0", "Content": "We sent it back. Display was very poor. not very responsive when using it. We ended up buying a more expensive unit and are very happy with it.", "Title": "Zeepad 7.0", "Date": "August 20, 2013"}, {"Author": "blackqueen", "ReviewID": "R2UQIKKHFO3HMN", "Overall": "4.0", "Content": "Am still exploring my tablet when my daughter gives me the chance to use it. But I like it very much am thinking about getting one for her so I could have mine to myself!", "Title": "Its very nice and lite!", "Date": "August 20, 2013"}, {"Author": "twirl6785", "ReviewID": "R2BHZ7G4V4HBF1", "Overall": "5.0", "Content": "I bought this for my niece almost two months ago. She loves it! Durable, fast, and great for children. Great product, awesome price, and fast shipping. Thank you!", "Title": "Very pleased!", "Date": "August 19, 2013"}, {"Author": "Paul Murry \"primedwic\"", "ReviewID": "RIH7I1FPHVZMU", "Overall": "5.0", "Content": "Great product. My 14 year old nephew can't put it down. The color defines it as his. He loves it. Thanks", "Title": "Red Zee", "Date": "August 10, 2013"}, {"Author": "Pen Name", "ReviewID": "R15ZEOUBMGAQDH", "Overall": "2.0", "Content": "Batterys dont last much. Tablets open apart with every short fall. They are realy slow and screen does not look clear on different angles.", "Title": "just for toddlers", "Date": "August 10, 2013"}, {"Author": "Nicole Gonzales", "ReviewID": "R25N8SPZOH2QYL", "Overall": "1.0", "Content": "this was the biggest waste of money. it doesnt work at all. google play doesnt work, you cant update it so the apps i have dont work, and i have emailed the seller 10 times since i got it 6 months ago, i have messaged him countless times when i could still make a return with no reply and im still contacting this seller so he can at least explain to me why it doesnt work but i doubt ill ever get a reply. im just so mad because i had tried to return it but i couldnt... very sad. :(", "Title": "DO NOT BUY!!!!", "Date": "August 9, 2013"}, {"Author": "lisa jackson", "ReviewID": "RFI67HMLQWDLF", "Overall": "1.0", "Content": "we had three and they all have messed up with in 2 weeks I hate hate hate this product do not get", "Title": "bad bad bad don't get we had three and they all have messed up with in 2 weeks", "Date": "August 9, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2U6FHM1FGDGW9", "Overall": "1.0", "Content": "Bought this a month ago for my 5yr old son.Only lasted for a week.shipment was great, came a day early.The item I received didn't say any brand name it's whatever chinese writing? As what they advertise here.The tablet itself was very responsive, the volume wasn't so great, the quality of the screen pictures wasn't so great either.Plus the charger that came with it was a piece of crap, sorry for my language, I said this because it didn't FIT RIGHT to the charging port, it was sticking out.One night I charged it, the following day I was checking it, to my surprised, the metal tip that goes into the charging port  came off &was; melting.Thank God didn't burn my house.then the USB charger that they sent was too loose, my son can't even use his tablet anymore because don't have any charger to use.Went to 3stores NOBODY sell it, they said the charger I have was made CHEAP...Lesson learned, I WILL NEVER EVER PURCHASE ANY KIND OF ELECTRONICS HERE.I tried to be cheap, now I'm paying the consequences.", "Title": "A piece of crap!!!!", "Date": "August 9, 2013"}, {"Author": "CARLENE", "ReviewID": "R1HOD0ZW62YX40", "Overall": "4.0", "Content": "BOUGHT THIS TABLET FOR MY SONS BIRTHDAY, HE LOVES IT VERY MUCH I WLD RECOMMEND IT TO ANYONE. IT CAME WITH ANGRY BIRDS AND FRUIT NINJA, SINCE THEN I DOWNLOADED ABT 5 MORE", "Title": "GOOD TABLET FOR THE PRICE", "Date": "August 8, 2013"}, {"Author": "D. Booth \"tddbbs\"", "ReviewID": "R1Z4SU7WS8L002", "Overall": "5.0", "Content": "I bought this for my wife, she uses it everyday, she is obsessed with facebook and she video skype's with her brother that lives quite a ways away, I also got the matching pink keyboard attachment and extra stylus'.  Earned me allot of points ;)  D/L apps, check your email, anything a PC can do!! Makes a GREAT GIFT!!!", "Title": "Awesome, great customer Service, excellent product!!", "Date": "August 7, 2013"}, {"Author": "jamie gilliam", "ReviewID": "R215T35NZLZGY2", "Overall": "5.0", "Content": "This zeepad is a very good tablet for such a low price.  My daughter is very happy with it, she uses it all the time.", "Title": "zeepad", "Date": "August 6, 2013"}, {"Author": "Raphy", "ReviewID": "R3R6EOU5NR4W16", "Overall": "1.0", "Content": "the screen is crappy it broke the second day i got it and its really slow an they wont let me return it so dont get it its a waste of money", "Title": "this was terrible", "Date": "August 6, 2013"}, {"Author": "vanity", "ReviewID": "R11OPE1LEXEKWS", "Overall": "1.0", "Content": "my screen was all scratched up it doesn't want to stay connected to wifi I have to keep making it connect", "Title": "my screen was all scratched up", "Date": "August 6, 2013"}, {"Author": "taysmom", "ReviewID": "R3RJ9QEN8QCGZK", "Overall": "1.0", "Content": "I bought this for my daughter as a cheaper alternative to an iPad or galaxy but I should have just bit the bullet and spent a few more dollars. I had to return it with in 2 months because it wouldn't charge. It took weeks to get it back and 4 months later we had the same problem. It is JUNK! plain and simple. Engine29 is not a great seller to purchase from either. They are very hard to get ahold of.", "Title": "Waste of money", "Date": "August 6, 2013"}, {"Author": "Charlotte Branigan-Taylor", "ReviewID": "R191R17JRI5M0V", "Overall": "4.0", "Content": "I was very satisfied with the tablet and the time that it took for me to receive it. I purchased it for my granddaughter for her birthday and I had plenty of time to download games on it for her.", "Title": "7\" Zeepad Tablet", "Date": "August 6, 2013"}, {"Author": "Martha McGough", "ReviewID": "R3HZK87KYJY7HG", "Overall": "1.0", "Content": "I had it less than three months when the case melted while it charged.  I would not recommend it to anyone as the quality is sub par.", "Title": "Worthless", "Date": "August 5, 2013"}, {"Author": "Taismine Beasley \"ocd mom\"", "ReviewID": "R35VG3Q9NJN56K", "Overall": "5.0", "Content": "I HAVE A TEN YEAR OLD WHO LOVES THIS> IT IS PERFECT FOR SOMEONE WHO DOES NOT NEED ALL THE BIGGEST BRANDS WITH THEIR BIG BRAND PRICE> T>B> CORAL SPRINGS< FLORIDA", "Title": "GREAT DEAL FOR KIDS!", "Date": "August 5, 2013"}, {"Author": "M. Gibson", "ReviewID": "RRZ5CBZJ724A2", "Overall": "3.0", "Content": "Battery life if really poor.  You only get an hour and a half, then you need to plug in a recharge.  Very disappointing!", "Title": "Power Cord Required...", "Date": "August 4, 2013"}, {"Author": "jvi", "ReviewID": "R2UZ67S5TDITVQ", "Overall": "4.0", "Content": "This product is great for my kids.  It does not play all games but plays most that a 5 year old would want to play.  Everything said it is a great buy for the price.", "Title": "Great for the kids", "Date": "August 3, 2013"}, {"Author": "Jailyn Cabrera", "ReviewID": "R2O5K9U14MS2QC", "Overall": "3.0", "Content": "It crashed do to an app, it wasn't backed-up like it said. I lost EVERYTHING! But otherwise.....its pretty good. I dont like how the wifi diconnects itself though", "Title": "It Crashed", "Date": "August 2, 2013"}, {"Author": "adam", "ReviewID": "R10O2JVN9ZHLJ1", "Overall": "4.0", "Content": "Its a great learning tool and starter tablet for my son. We use it for his learning games and for abc mouse.", "Title": "not bad for price", "Date": "August 2, 2013"}, {"Author": "josienj", "ReviewID": "RWDF462KQLEHD", "Overall": "5.0", "Content": "This zeepad is the right size for my my six year ols. It was purchased as a birthday gift. A perfect escape from him always needing my phone to play games and read things on. Great Great investment.", "Title": "great for kids", "Date": "August 2, 2013"}, {"Author": "Cressie Fraiser \"Cressie Fraiser\"", "ReviewID": "RFASFO64Z6WF1", "Overall": "3.0", "Content": "It is a nice Android for a teenager but I wanted a little bit more for my husband.A very nice pad.", "Title": "Good", "Date": "August 1, 2013"}, {"Author": "edgarlbh", "ReviewID": "R2HHDZJEITV377", "Overall": "5.0", "Content": "Excellent product, all features offered are included and working properly, in addition to a fair price. Thank you very much, for your services.", "Title": "Simply excellent for its price!", "Date": "July 22, 2013"}, {"Author": "bvande", "ReviewID": "RLFC63CETA0KG", "Overall": "4.0", "Content": "This is my second Zeepad purchase.  I have 2 nephews (6 and 5) and bought them as birthday gifts for each.  They love to play games on them and my sister has put on parental controls.  It took a little while for her to figure the parental controls, but the boys love their Zeepads!", "Title": "2nd Zeepad purchase", "Date": "July 21, 2013"}, {"Author": "Laura \"Music Lover\"", "ReviewID": "R3MHB4BDNXJKMN", "Overall": "4.0", "Content": "I bought this without having much expectations for my 4 year old daughter. It was only $70 and most tablets are hundreds. However, it came quickly, in the pink color I asked for. When I first plugged it in to charge (it says to charge first), I was concerned that it wasn't charging properly because the icon didn't show the charging symbol for more than a second or so. However, it did charge and I've downloaded several apps and have been using it. It's the perfect size (to me) because it isnt so big that it is cumbersome and it isn't so small t hat it is annoying. My only complaint is that it doesn't hold a charge for too long (about 2 hours). So as long as you remember to charge it, you are fine. I imagine my daughter will physically break it if I don't get a case for it, but that isn't zeepads fault. I sort of want one myself. OH.....I got the single camera. It has one camera on the side where the screen is. If you want to take pictures and actually see the thing you are taking pictures of, you may want to get the dual camera.", "Title": "Great Tablet for the Price (especially for a newbie)", "Date": "July 21, 2013"}, {"Author": "DonÂ Tuleja", "ReviewID": "R1UAD8HJ82GR8J", "Overall": "4.0", "Content": "For the price, this is a great little tablet. If it had more RAM it would be even better. Plays streaming HD video no trouble. Good value!", "Title": "Good bang for the buck.", "Date": "July 19, 2013"}, {"Author": "Nicholas Beatrice", "ReviewID": "RW1N5LXN11F6C", "Overall": "1.0", "Content": "Very Slow, not a good buy. Wish I had spent more money on a better faster tablet. This tablet should definitely be taken off the market, pronto!", "Title": "Terrible!", "Date": "July 17, 2013"}, {"Author": "Julie Moss", "ReviewID": "R1X03J8NJTOKRC", "Overall": "3.0", "Content": "My sons  broke in the first week. Worked well until then. It was a birthday present too. Its a good item, just breaks easily", "Title": "Good but broke easily, if for a child then make sure you get some sort of protection", "Date": "July 17, 2013"}, {"Author": "Kortni Wiegreffe", "ReviewID": "R2LSES3BPLPBUF", "Overall": "1.0", "Content": "I recently bought this item......had it a few days did fine, the next day it started freezing up. Then I went to put the screen protector on it that came with it. I was pressing down on the screen to get the air bubbles out and the screen cracked all the way across it. I sent back and got my full refund that I paid for tablet........ waist of time and money !", "Title": "Hate It", "Date": "July 15, 2013"}, {"Author": "Katherine Harder", "ReviewID": "R2BQDFZTH5TG02", "Overall": "1.0", "Content": "Without trauma or exposure to moisture, it just wouldn't turn on today. Worthless product if the lifespan is only 6 months. I'm glad I didn't store anything important on it, or I would be livid.", "Title": "Just stopped working", "Date": "July 15, 2013"}, {"Author": "Renee Wilson", "ReviewID": "R1GXB4NPX1CD21", "Overall": "1.0", "Content": "lasted four months thats it slowly stopped charging then went to charge it and it wont turn on bought this for my daughters birthdaywhat a let down", "Title": "junk", "Date": "July 15, 2013"}, {"Author": "A. C. Pyle", "ReviewID": "R2DOWDMK3T6100", "Overall": "3.0", "Content": "I have bought 2 of these Zeepad tablets and 3 other off brand tablets since May. It seems they all either work great or not at all.  This review is specially for the Zeepads.  The first one worked so great (the best one of the 5) that within 2 weeks I bought a second one, the second one is horrible, screen is fuzzy, runs much slower than the first, most of all the wifi will not turn on at all.  When you slide wifi to \"on\" it automatically turns itself back to \"off\"  I have tried everything suggestion I can come up with:  try at McDonalds, reset router, clear cache, factory reset, the list goes on.", "Title": "It and miss", "Date": "July 14, 2013"}, {"Author": "Diana", "ReviewID": "R2IGG9TOGVHKX9", "Overall": "1.0", "Content": "I purchased two zeepads for my grandkids for christmas. They both died. Amazon would not return them because it was after the 30 day warranty. It was a waste of money. No one can fix them. I just wanted them to send a new One out or find somewhere to get them working. The little android man just fell over. Never worked again.", "Title": "zeepad warranty is no good.", "Date": "June 10, 2013"}, {"Author": "Christina", "ReviewID": "R378XX8PD2WN1H", "Overall": "4.0", "Content": "I purchased this product for my grandmother. She wanted to learn to use a tablet. For the size and price this little unit is not bad. The android platform it has is basic and easy to use. I can download just about anything I have on my phone or ipad and the resolution is decent too. Though my grandmother is still learning how to use it. It is a great little tablet for apps, games, travelling and connecting to the internet.", "Title": "For the price not bad", "Date": "June 10, 2013"}, {"Author": "Laura Smith", "ReviewID": "R35I4V49IJ9AVH", "Overall": "5.0", "Content": "I really love this tablet youtube is good, google play nearly perfect [downloads games great] and it shipped really fast. the screen is clear, setup is great. overall this is a great tablet. I got it for my 11th birthday!", "Title": "it's a great tablet and also, it has a very good price.", "Date": "June 5, 2013"}, {"Author": "gaox", "ReviewID": "R2TSLOOILR197P", "Overall": "2.0", "Content": "5 DAY UPDATE! : I've been trying to return this piece of crap since the second day I received it because the volume is not cooperating with me, but no response from the seller. >:( Getting REALLY frustrated, and I have it just sitting in its box now! I just filed another return request, and if nothing happens again and it surpasses the 14 day policy, I'm FILING A CLAIM!Just received my pink Zeepad today. Really disappointed because the volume SUCKS! I have it at its highest and can barely hear. It sounds terrific with headphones on, but I don't wanna use headphones every time I watch Netflix or listen to music. Other than the volume issue, everything seems to be working fine. Camera quality is pretty bad, but I've seen worse.", "Title": "Volume sucked!", "Date": "May 16, 2013"}, {"Author": "Daniel D. Saiz", "ReviewID": "R34MHN8UJC1UDJ", "Overall": "2.0", "Content": "It did get here very quick, I bought it for a class I was taking. It worked very well for what I needed it for, looking up homework on dropbox. I bought it in January, now in May it stopped working, the on-off button broke and fell into the tablet. Now i'm having to send it back, and pay for the repair myself. It was great for a while, but I really should have spent the $30 more and bought another one.", "Title": "Dont spend your money", "Date": "May 15, 2013"}, {"Author": "Amazon Customer \"Andy'sMommy\"", "ReviewID": "R2VQ9OADMY7O4Q", "Overall": "1.0", "Content": "I wish I could give no stars!!  I charged as it says in the instructions and the item will not come on for more than a second!  Junk!  I am so mad because I bought accessories for this.  I can return this item, but how will I get those returned..hope they work on another 7inch tablet that will be better than this crap!  ugh!!  :(  I wish I had listened the negative reviews instead of all the stupid positive ones cause this things is pure crap!  It doesn't even have a smart charger that will shut off if you over charge and the instructions are weird and confusing and the stupid thing can't even be charged unless it is totally out of charge..too much to do for a kid to use this.  I guess I am glad it is broken now so I can return it rather than a month or so down the road when I wouldn't be able to!  :(", "Title": "Do not purchase, doesn't work straight out of box!", "Date": "May 15, 2013"}, {"Author": "Natasha S.", "ReviewID": "R6SZM8I3SIP79", "Overall": "4.0", "Content": "Tablet is being used by my daughter. She loves it, great size for a child. We added a microSD card and downloaded about 15 games from the Google Play store. User manual is pretty thin but if you are familiar with android operating systems you can figure it out. Probably not great for heavy usage as it can lag but like I said, great for a kid.", "Title": "7yr old daughter loves it.", "Date": "April 29, 2013"}, {"Author": "Nicole Rodriguez", "ReviewID": "R3JRGN8AJ2J2L4", "Overall": "4.0", "Content": "i got this for my 6yr old and well i guess i didn't pay attention to where shipped from but got it way earlier than expected so that was nice but it was from China and some of the alerts pop up in Chinese and well i don't know how to change it since didn't come with instructions and i cant read Chinese lol so that doesn't help but she really likes it otherwise :)", "Title": "hmmm", "Date": "April 22, 2013"}, {"Author": "Timothea Bow", "ReviewID": "R2N6XKOHOQ2RB5", "Overall": "5.0", "Content": "I bought my tablet around the holidays and I liked so much that i purchase one for my daughter and my husband. and the both like their tablets. I was a great deal it meet my needs plus. I usemy tablet for e-mail and music and reading book.ths a geat puduct for traveling. I like my zeepad.", "Title": "Like my Tablet", "Date": "April 21, 2013"}, {"Author": "Timothea Bow", "ReviewID": "R2I7IE5VZC3WZB", "Overall": "5.0", "Content": "I bought this tablet for my daugter and she loves she uses for downloading music and for the internet, facebook,e-mail. It just right for her and what she uses it for.  She loves her tablet.", "Title": "Great Tablet", "Date": "April 21, 2013"}, {"Author": "Hilda Rosado", "ReviewID": "R3VEKIHXX75ZNU", "Overall": "1.0", "Content": "My daughter hates it it does not do what we expected it to do she is really disappoint with this product so am I. I would never recommend it to any one.", "Title": "I hate it", "Date": "April 21, 2013"}, {"Author": "christopher foster", "ReviewID": "R10TBS0ALSCU4L", "Overall": "1.0", "Content": "I will never buy anything from these people. the screen is scratch and it broke, thanks a lot. I wont my money back", "Title": "will not work and its old", "Date": "April 21, 2013"}, {"Author": "sshjaguar", "ReviewID": "R23BWROSFOROMW", "Overall": "4.0", "Content": "This tablet is about as cheap in price as you can find... on that same note it is a bit slow and glitchy with multi-tasking, but hey it's less than $80 so you can't expect it to compare to a $300+ Galaxy or $400+ iPad. It works great for my needs!", "Title": "Can't beat the price, the functionality is fine.", "Date": "April 19, 2013"}, {"Author": "Richard Hull", "ReviewID": "R1X362XWIJBZWP", "Overall": "2.0", "Content": "Don't  buy this knock off! All this is, is a glorified android phone (minus the calling features).I bought myself a Kindle and my GF this, it's crap. After a week of using it and only 5 applications downloaded, it runs EXTREMELY slow. Not even just the internet, but loading the apps themselves is laggy and sluggish. The pink is cool, but the texture is very slippery and will fall often. Buy a case!Overall, if you can spend the extra $20-40, buy the real thing. This knock-off doesn't last long nor will it make anyone happy.", "Title": "Save your money, get the real thing", "Date": "April 18, 2013"}, {"Author": "NolaBigDawg", "ReviewID": "R17NJBDOK5HZZJ", "Overall": "5.0", "Content": "I purchased the tablet for a four year old, I didn't want be an expensive in fear of it being broken by children.  I was expecting it to be just something for the kids to play angry bird on. To my surprise it was really a good tablet, you can download from google play, screen was really responsive, and the micro Sd slot was really a plus.  I would definitely by another in the future", "Title": "Kid friendly tablet", "Date": "April 11, 2013"}, {"Author": "DJ BRAND-X", "ReviewID": "R3HVOYXQI3428J", "Overall": "1.0", "Content": "Dont buy it.  I cannot for the life of me figure out how to download anything with this piece of junk!  So disapointed.  I thought it would be a pretty good deal because it was at a good price and it would have made a good xmas gift.  Its been sitting under the coffee table since the day after xmas because its trash!", "Title": "Junk!", "Date": "April 10, 2013"}, {"Author": "Jesujiano", "ReviewID": "R2ADJJ7MCDKZN3", "Overall": "5.0", "Content": "Excellent product, 100% recommended for anyone who wants to buy itI am close to buying one of these products", "Title": "Excelent product", "Date": "April 3, 2013"}, {"Author": "hubiet", "ReviewID": "R2U8BHOU5DQ4K0", "Overall": "4.0", "Content": "I LIKE IT EXCEPT THE DOWNLOADS ARE VERY SLOW. IT DOES GET TO MY E-MAIL VERY FAST.THIS IS MY FIRST TABLET AND AM AMAZED AT WHAT IT CAN DO. BATTERY LIFE IS VERY GOOD FOR ME.WHEN THIS ONE FAILS I WILL UPGRADE TO A NEWER ONE THAT IS FASTER ON  THE DOWNLOADS", "Title": "VERY GOOD FOR THE PRICE", "Date": "March 17, 2013"}, {"Author": "Andrew Fong", "ReviewID": "R3OCH8Z4BOVTVV", "Overall": "4.0", "Content": "This is my first tablet, and I've been pleased with it. I bought it knowing that it's not a high-end samsung or iPad. Some times it seems to hang a little bit on commands and there seems to be a slight dead spot on one of the corners (which is only a problem if I oriented it that way so that the \"back\" button is on that corner).If you just want a very inexpensive tablet to fiddle with, like I did, this is a nice product for that.", "Title": "Nice starter tablet", "Date": "March 17, 2013"}, {"Author": "Rick", "ReviewID": "R3FJCNBFI7B6SQ", "Overall": "4.0", "Content": "Now to start off we are not talking a Nexus 10 tablet or an I Pad so if thats what your seeking then this is not for you . First off the good points i observed is it comes preloaded with a couple of games ie: Angry birds and a couple of kids games which is what this is really geared to . I bought this for my 9 yr old nephew knowing full well it was not going to be a top of the line tablet . It accesses the internet on WiFi only no Ethernet port that i observed . It is relatively fast but again we only talking 512 mb ram so your not talking lightening fast . It has a decent camera with it and also a built in microphone , both as i have said are decent for what your paying . Its only really bad downfall is it's battery life . Even fully charged its battery might last you an hour depending on what your doing with it . It seems to use more power using the internet than the games. Possibly because of it being on wireless .i am assuming you will not be able to use this in a wireless hot spot because you do have to set it up to detect your wireless configurations on your device at home . But if your looking for something for the kids to use and don't want to spend 500 bucks or more on an I Pad  then this might serve the need . Just make sure your power cord is readily available .", "Title": "For the price it passes muster", "Date": "March 17, 2013"}, {"Author": "A. NAVA \"PaperPusher\"", "ReviewID": "R1Q86QZWPAJNZG", "Overall": "4.0", "Content": "Got this for my wife's birthday.Sorry not to tech savvy on the unit's particulars but here's what we use it for:Pros: Great eReader Tablet, she uses the local online Library to check out books and is a big plus!Web surfing through our home wireless network works pretty good and watch videos 'netflix', 'youtube' with no problem.Also fun with our newborn son interactive android apps.Battery life is pretty decent (i shut off the unecessary apps).Great price for what this tablet offers!Cons: the camera has a low resolution but ok for starter. The instruction booklet was not really helpful but gave enough hints to figure out some configuration (network, navigation, setting up accounts, etc..)The camera has low resolution pictures come out grainy in medium to low light, have not tried with bright lights.Overall, a great beginner's tablet. Very functional for ereader, websurfing, checking email, and simple apps.", "Title": "Great for eReader and Web Surfing", "Date": "March 16, 2013"}, {"Author": "Matthew David Schvaneveldt", "ReviewID": "R1D33TKOBUUY13", "Overall": "3.0", "Content": "Works as advertised. Not the fastest tablet by far, but would be a great beginner tablet for kids. Charges through USB port as well as the supplied charging cable.Cons: Screen viewing angle is sub par.", "Title": "Zees Pad Vas Pretty Gud", "Date": "March 16, 2013"}, {"Author": "Carolyn Elias", "ReviewID": "REZWI7FD25XMF", "Overall": "4.0", "Content": "Bought these as surprise gifts for two straight A grandkids to use as ereaders. They were perfect and work perfectly", "Title": "awesome", "Date": "March 16, 2013"}, {"Author": "Terrence M. Anderson", "ReviewID": "R3LBHQFF11XCMI", "Overall": "4.0", "Content": "At this point I'm still discovering lots about it.  Not satisfied that it came without software. the Net  & You Tube was very Helpful  with features and operation.", "Title": "Zeepad 7.0", "Date": "March 15, 2013"}, {"Author": "Pedro Antonio Perez Diaz", "ReviewID": "RMAUMY0EVTD9L", "Overall": "4.0", "Content": "Pedro Antonio Perez Diazorre muy bien el wifi todas las aplicaciones tambien  no le doy las 5 estrellas porque no corre los videos de you tube muy bien", "Title": "espefctacular tablet", "Date": "March 12, 2013"}, {"Author": "Betty Smith", "ReviewID": "RRVGZBVV5IOJQ", "Overall": "4.0", "Content": "I purchased two zeepads for my grandchildren who are 10 and 12.  They use them daily to play games, download music, and read.  They love them and have not had any problems with the pads and the batteries do last for the time they use them.", "Title": "very pleased with this zeepad", "Date": "March 12, 2013"}, {"Author": "Jamie Perkins", "ReviewID": "R3D5DHV2UK5AT1", "Overall": "2.0", "Content": "It's okay.  Very slow.  Screen goes black and returns to block screen a lot.  I don't really care, it was for the hubby so he would quit using my kindle.  The slowness bothers him more than the black screen issue does.", "Title": "eh", "Date": "March 12, 2013"}, {"Author": "jackie", "ReviewID": "RZLRHKQ81R739", "Overall": "4.0", "Content": "buy it for my daughter, why not let me use my phone ... was a great solution, and it works well, the only thing is that sometimes it is hard to select options on the touch screen", "Title": "very good", "Date": "March 9, 2013"}, {"Author": "Nelly", "ReviewID": "R3FZQPF5U8BMPH", "Overall": "3.0", "Content": "We received the tablet and the first two days it worked great but then crashed. The screen went blank and did not work regardless of what we tried or by contacting customer support. When we tried to return it and exchange it for a new one, they first stated they would pay for the return shipping but later wanted us to pay for the return shipping and said they would refund us. By other comments I realized that other customers were never refunded and I knew that the shipping would be close to the same amount of what we paid for the tablet. It was a good working tablet at first but you will be taking a chance of this happening to you as well.", "Title": "Worked for a few days then crashed!", "Date": "March 8, 2013"}, {"Author": "wyatra patterson", "ReviewID": "R2TEL2NCPQZCRO", "Overall": "4.0", "Content": "I wanted to follow up on my past posting of this product. Let me start off by saying the company contacted me and sent me a replacement, they even refunded my shipping cost to my credit card. The previous product could have been damaged during shipment. My son loves the tablet. I am in the process of ordering a jacket cover in case he drops it.It come preloaded with a game, but you can always download more free games from the internet. I recommend this product.The touchscreen is great and responsive. The web pages load great.", "Title": "follow up.....Seller replaced tablet..excellent service from company", "Date": "March 8, 2013"}, {"Author": "Steve D. Yates \"The Yates Family\"", "ReviewID": "R3TMT7JCHYQSYI", "Overall": "1.0", "Content": "Product came super fast, packaged well. Daughter loves it, but still learning things, like where to put the music. Not of caution; the user guide was obviously not written by a person who speaks English. The moderately tech savvy person can figure it out,but if you have no technical skills this may pose an issue. Other than that so far so good. Will update if necessary.October 2013This item is crap! Now it won't charge after seven months, spend a little extra and get a better one.", "Title": "So far so good..  I take that back!", "Date": "March 8, 2013"}, {"Author": "Moises Caballero", "ReviewID": "R37FJSFWHVJCWO", "Overall": "5.0", "Content": "is a Good Product, sure is not an Ipad or something like that but its good enough for the price.", "Title": "Execelent Product.", "Date": "March 8, 2013"}, {"Author": "Connie!!!", "ReviewID": "R1RRQQAV9T09RT", "Overall": "3.0", "Content": "I consider this product ok because I was specting It has a durable charged battery. I goes down faster. That make me disappointed..sorry but It is happening...in the other hand the applications work fine.", "Title": "On time but discharging so fast", "Date": "March 7, 2013"}, {"Author": "sihame", "ReviewID": "R2PGMSAXF6DVEO", "Overall": "5.0", "Content": "it works great and fast i like it  for the price is really  great better than to buy an expensive and your kid can broke it at any time . now I put game on it. I put my pdf courses that I use them when I study while I am riding the train. I put word and excel on it and it work perfectly I download videos the image is great. the only think that I don't like is the camera is only a basic one not sophisticated but does' t bother me. I am satisfied with that product", "Title": "it works great and fast i like it", "Date": "March 7, 2013"}, {"Author": "David Johnson", "ReviewID": "R16R2ILMLL3OQ", "Overall": "3.0", "Content": "The tablet shipped very quickly!! I opened it up and the tablet was brand new. No problems at all except for lag and the screen is crappy otherwise its good for the money.", "Title": "Ehhhhh. Its ok.", "Date": "March 7, 2013"}, {"Author": "Lakesha green", "ReviewID": "R2XD6EFFMIG9UF", "Overall": "5.0", "Content": "I give this tablet 5 stars. This tablet is awesome. I brought four tablets as gifts for my kids and they just love it. I was easy for me to set up wifi on it and it was very easy to download various apps and games using the google play store. Great tablet for the price. I'm thinking about getting one for myself.", "Title": "This tablet is awesome!!!!!", "Date": "March 7, 2013"}, {"Author": "Eric", "ReviewID": "R3EKAGIHHVJFX", "Overall": "2.0", "Content": "The mini usb port stopped working on 3rd day, although tablet fun and seemed to work great otherwise , my android keyboard would not work which took 50% of the fun out. I had to return to Amazon , no problem there, they payed for return shipping and issued me an immediate refund which I am happy for. I am getting a very similar replacement, my son and wife and keeping their zee pads  so far they are doing ok", "Title": "had a problem", "Date": "March 7, 2013"}, {"Author": "Amber", "ReviewID": "R2UUUGR9YEMYQD", "Overall": "5.0", "Content": "Perfect for kids!  Great price for the product and has all the features that we we needed for the kids.", "Title": "Great product", "Date": "March 7, 2013"}, {"Author": "Brittani", "ReviewID": "R1QZPEMIO8D50Q", "Overall": "5.0", "Content": "was very hesitant with all the terrible reviews but i LOVED it! it was truely worth the 80 i paid! AWSOME TABLET FOR ITS MONEY :)))))", "Title": "AWESOME", "Date": "March 6, 2013"}, {"Author": "Tosha Miles", "ReviewID": "R3VWP3A6VCCN8F", "Overall": "1.0", "Content": "We had it for a couple of weeks... My son dropped it and parts flew everywhere. Total waste of money!", "Title": "Cheap", "Date": "March 6, 2013"}, {"Author": "edson quarton", "ReviewID": "RM2GKA1NU6CNY", "Overall": "4.0", "Content": "Very good Tablet the touch screen is very good and the weight of the tablet is not heavy. It is very slim and it is worth the price thank you .", "Title": "7-inch Android", "Date": "March 6, 2013"}, {"Author": "mike ferraro", "ReviewID": "R2Q1ONC3VWIUY0", "Overall": "1.0", "Content": "could not get a connection at all,tried several times and had help from a tech also. will not purchase anything from you again,thanks", "Title": "sorry to disappoint you ,but this product did not work on internet", "Date": "March 6, 2013"}, {"Author": "Blaire roy", "ReviewID": "RSX17SACYLU09", "Overall": "4.0", "Content": "My 3 year old never let me have my kindle so I got rid of his mobigo and bought this zeepad. Has great storage capacity for the games for kids. Even downloaded some videos for him to watch offline almost all games are available for play without the Wi-Fi on. The only thing I don't like is the screen it's seems like 3d and sometimes makes it hard to see. The touch screen is perfect and comes with some pretty cool accessories. Perfect for younger kids.", "Title": "Good for toddlers", "Date": "March 6, 2013"}, {"Author": "Edward Amarille \"Edward Amarille\"", "ReviewID": "R2WIKAX5389WYN", "Overall": "3.0", "Content": "for a basic tablet, this isnt too bad, but with only 512 MB of RAM, memory management is an issue. The battery doesnt quite last as long as I would like, but it can handle basic social browsing if you are not trying to rush through your apps.", "Title": "Should have read more", "Date": "March 6, 2013"}, {"Author": "Marco Perez", "ReviewID": "RKVYEO3A5N4GS", "Overall": "3.0", "Content": "My brother loves this tablet to death. Was purchased as a christmas gift. You pay for what you get pretty much", "Title": "Great Gift", "Date": "March 6, 2013"}, {"Author": "Frederico DosSantos", "ReviewID": "R38DA0AOVU3RUH", "Overall": "4.0", "Content": "The pad is quite durable; I carry it with me everywhere on my backpack and it gets tossed around quite a lot. A plus is that it comes with a screen protecting sheet(that you have to apply) but its one less thing you need to worry about buying and if you are looking at this guy, you value saving some $$. The plastic cover is quite solid but the edges do scuff up pretty quick. The battery lasts about 2 hours and that is acceptable for the price. If you are thinking about using this as a PC substitute please keep in mind that after the OS you only have about 1.9Gbs of space left; bought a 32Gb microsd from scandisk and the system recognized it right away; but only as a 29.8Gb device(might be file system configuration, but that's enough space for me. It comes with angry birds and fruit ninja installed and it was a great excuse to have some random children play with it and although they handled it as if it was made of solid titanium; it came out with minor scratches, but non on the screen because of the protector.The major down side for this device is the charger; as noted before it doesn't fit all the way and most of the time you have to \"giggle\" it around so that it will start charing; but the usb cable charges perfectly, just takes longer; I get a full charge from 2% to 100% in about 15 minutes on wall charger and about 23 on usb.I would have given it a 5, had it come with bluetooth or at least gps support. Tried a few bluetooth adapters but was not able to get it to be recognized; but did not do much other than plug it in and wait a minute or two.", "Title": "Great for the price and if you only want to browse the web.", "Date": "February 24, 2013"}, {"Author": "Michael Stone", "ReviewID": "R14F32B2YYCI0P", "Overall": "4.0", "Content": "Basically got the item for the Grand kids, it has performed well, a little slow but for the money it has stood the test, was shipped in a very timely manner, easy to operate.", "Title": "ZEEPAD", "Date": "February 24, 2013"}, {"Author": "best buy", "ReviewID": "R29FBVKI1K93R2", "Overall": "5.0", "Content": "zeepad it,s a best buy I love it cause It,s just like an mini notebook I dose everything I wants it to an It can fite in anything", "Title": "best ever", "Date": "February 9, 2013"}, {"Author": "Carol Peterson", "ReviewID": "R1CD30DRY5ZPSF", "Overall": "4.0", "Content": "My grandson's really enjoy this zeepad it has eerything and more that they need Colar is good and holds the charge.", "Title": "Gift for Grandson's", "Date": "February 8, 2013"}, {"Author": "Happy Shopping \"Paul-alex\"", "ReviewID": "R21054EA0UZPU3", "Overall": "2.0", "Content": "I bought this tablet for my son and he was pleased the first three days we had itbut then we had many issues charging it. It did not hold a charge well at all andit ultimatly stopped working. He really loved the color and when it worked it didwork well but this tablet did not meet my expectations which leads to that age old adage...you get what you pay for", "Title": "NOT PLEASED", "Date": "February 8, 2013"}, {"Author": "Traci", "ReviewID": "R2FO3AV6PJSPX3", "Overall": "1.0", "Content": "This product is terrible and not worth $1.  The charger broker the second day we had it..i sent the item back and they replaced the charger which lasted 1 day the second time.  It also is missing the power button and needs a small object to turn it on!!  I have lost the money on this item.  Its a poor product and not worth buying.  Nothing good about it", "Title": "DO NOT PURCHASE!!", "Date": "February 5, 2013"}, {"Author": "Lanelle Reick", "ReviewID": "R15JDNV9KWY8YB", "Overall": "2.0", "Content": "speakers woould not work, and then it would lock up and couldnt get it to do anything.. sent it back and got a galaxy by samsung", "Title": "product was returned", "Date": "February 5, 2013"}, {"Author": "James Stevenson", "ReviewID": "RJ71UJ8LJ2I3L", "Overall": "3.0", "Content": "the instructions that came with trhe ZeePad were so sparse and written as an oriental would speak that having never used a pad before makes it hard for me to use....", "Title": "difficult to use", "Date": "February 5, 2013"}, {"Author": "pimplefarm", "ReviewID": "R3FETPMXZL1P8V", "Overall": "1.0", "Content": "Gave this as a gift.  It didnt work.  Right out of the box.  Embarrasing.  Be sure to keep all the wrapping and reciept.", "Title": "Zeepad", "Date": "February 5, 2013"}, {"Author": "Jessica Upole", "ReviewID": "R347JJ6DRQ9IXI", "Overall": "4.0", "Content": "I ordered this for my 5 year old. I didnt want to spend all the money on an expensive tablet since he is young. This tablet works great for all he does. Perfect!!!", "Title": "Great price and works great", "Date": "February 5, 2013"}, {"Author": "MARCELO", "ReviewID": "R3FHONXK2WVEVF", "Overall": "4.0", "Content": "Very good for the price you pay.I recommend it. Very portable and very nice design.I recommend it for you.", "Title": "Very Good", "Date": "February 5, 2013"}, {"Author": "Tweets", "ReviewID": "RZLXVSJS28ES4", "Overall": "4.0", "Content": "I have been happy with my tablet. I wished it would have come with a manual. I had to access internet to get information from other owners on specific issues. Other than this I have been very satisfied with it.", "Title": "Zeepad", "Date": "February 4, 2013"}, {"Author": "Jned", "ReviewID": "R272T1YLOW69A5", "Overall": "3.0", "Content": "I purchased for my wife to use as a digital frame and occasional internet tablet. Maybe netflix and some basic games for my kids.  While its OK, its slow, freezes, screen is bad at any angle, and sometimes straight on. Generally its a little worse then I expected based on some reviews. Not expecting an ipad by any stretch, I had hoped it would exceed low expectations, it does not.Pros: price, light weightcons: everything else.And no I dont think I got a bad unit, I think you get what you pay for.", "Title": "get what you pay for", "Date": "February 4, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1G9RKDT15H4AK", "Overall": "2.0", "Content": "The respond time is very very slow. It's like it locks up all the time . Looking to see if I can return it.", "Title": "Slow", "Date": "February 4, 2013"}, {"Author": "J. Piter", "ReviewID": "R3NC1BNTSJ724O", "Overall": "1.0", "Content": "Nothing I want to download there will work. Mostly when I ask to download it says app is incompatible with device.Very few of the apps I did download will actually work.  A waste for me. Next time I'll spend $80 on lottery tickets.No charge indicator light, slow charge and about 2.5 hr out of a full charge which is just about useless.Web browsing very slow.It does bring back memories, playing most games, ones it CAN play, brings back my fondness of my PC Jr.JUNK!", "Title": "Yes it does have Google store, that's about it:(", "Date": "February 4, 2013"}, {"Author": "madelyn ramirez", "ReviewID": "R244445SY479XH", "Overall": "5.0", "Content": "Since I did not receive the tablet (ordered from another vendor) I called to ask if I could return the cover. The company was very nice in letting me return it and refunding my money. The cover looked to be in excellent shape and probably would have been very nice if I had received the tablet.", "Title": "I was very satisfied with the case.", "Date": "January 18, 2013"}, {"Author": "Fuff McDuffin", "ReviewID": "R2C3II7FZ0VRCU", "Overall": "4.0", "Content": "While this product certainly is no iPad, we have been very happy with it so far.  We are also happy with the amount of apps there are available at the Google Play store.  Best of all, it did not cost much in comparison with other tablets so we have a lot less to worry about when we let our kids (6 and 4) play with the apps.Some cons to point out:You have to look at the screen head on to view it properly.  If you are viewing from the side, it looks like the negative of a photograph.  Kind of a pain if my kids are using it and ask for my help with something.The sound quality is quite poor unless you hook up speakers or listen through headphones.I have no regrets about buying this tablet.  Perfect for kids or casual use around the house.", "Title": "Quite Happy", "Date": "January 18, 2013"}, {"Author": "freddy ruiz", "ReviewID": "R20KGM25L49BOW", "Overall": "5.0", "Content": "its wonderfull my child love it...she got a lot of game they be all day playing and watching videos in youtube", "Title": "wonderfull", "Date": "January 18, 2013"}, {"Author": "michael todd tucker", "ReviewID": "R13QNTYDUFC3GI", "Overall": "5.0", "Content": "this tablet is perfect for my 6yr old it has all the bells and whistles any kid could ever want", "Title": "tablet", "Date": "January 18, 2013"}, {"Author": "William S Minks", "ReviewID": "R3AKS48B5BG058", "Overall": "5.0", "Content": "i bought this for my daughter and it actually works pretty good for a starter tablet for a teen. I will be going to an ipad for her after this. thank you and it was quick delivery too.", "Title": "good", "Date": "January 17, 2013"}, {"Author": "Charlo", "ReviewID": "R1UHBGCDM5DEG1", "Overall": "5.0", "Content": "This works as intended! I bought it for my son and he loves it! I am planning to buy another. It should have come with additional storage but other than that it is pretty fast!", "Title": "Great gadget!", "Date": "January 17, 2013"}, {"Author": "C. Gonzalez", "ReviewID": "RW3VK5O0QL0U9", "Overall": "3.0", "Content": "I was impressed with the specs and it came promptly. When I inserted the Micro SDHC card the card overheated, burned my fingers on removal and ruined the memory card. Prompt refund. No assembly is perfect, but I didn't expect to get hurt by a tablet.", "Title": "An OK product", "Date": "January 17, 2013"}, {"Author": "Scott", "ReviewID": "R1ECDDSBR1TUKW", "Overall": "2.0", "Content": "The screen is almost in useable I bought two for the kids one is fine the other is very hard to use due to the touch screen not reacting or doing something totally different than what was touched. Also this vendor has no customer service and the tablets came four days past the estimated ship date I put some of that on USPS who's tracking is worthless.", "Title": "Touch screen is weak", "Date": "January 17, 2013"}, {"Author": "A.P. in S.P.", "ReviewID": "R36D3TDV2V42P0", "Overall": "1.0", "Content": "I had to send this tablet back for a refund due to poor performance. For the money it did seem to have some nice features and the ability to do everything that I wanted it for. But, it was far too slow to use and it took minutes to do anything. I even added a memory card to it to see if that would boost it's speed. But it didn't help. I'm guessing from the other reviews that I may have just gotten a defect. Hopefully everyone else who purchases this in the future has better luck than I did.", "Title": "Too Slow To Use.", "Date": "January 16, 2013"}, {"Author": "Anthony David Daniels", "ReviewID": "R1H08UZO039VPQ", "Overall": "4.0", "Content": "Although we received the wrong color, ordered pink for my wife but received gray. Other than that and taking the full five days for shipping it was in great condition and the packaging was more than sufficient. It turned right on, booted right up, very fluent touch, apps work great, loads very fast with wifi. Well worth the money, buying another.", "Title": "Four Star quality", "Date": "January 16, 2013"}, {"Author": "Amy Tumlin", "ReviewID": "R25OZBYSPYX077", "Overall": "5.0", "Content": "Bought this for my little girl who is 6.  I have a Kindle Fire and she was always wanting it.  So i found this alternative to the Kindle for way less and she loves it.  She is able to watch Netflix shows on it along with all her favorite games.  Would definitely recommend this for a young child.", "Title": "Best gift ever", "Date": "January 11, 2013"}, {"Author": "Henry", "ReviewID": "R1J8LJY2M81BDN", "Overall": "5.0", "Content": "I am very happy! My daughter enjoying every day this product. The apps it's easy use for my daughter .", "Title": "Its very successful ! I love!", "Date": "January 11, 2013"}, {"Author": "Mad mom", "ReviewID": "R1IJWNXPL5ZC22", "Overall": "1.0", "Content": "Extremely mad and disappointed!!!! I had a very sad 5 years old on Xmas!! N now she questioning Santa!!! Never got my tablet! Never got a tracking number!! N never got any Feed back from the seller!! This is absurd and very bad business!!!! I can't believe amazon has third party sellers like them on her!! Scammers!! Thank good I got my money back!! But I will stick to eBay, overstock, and qvc!! Yes I got my money back but still don't change the fact of having to explain to a broken hatred 5yr old why Santa missed her house and didn't give a present when the excuse amazon gave me when I filled a claim it was out of stock!! Then u should of told me that when I ordered it on December 10!!!! DON'T NOT BUY FROM THIS SELLER!! SCAMMERS AND UNPROFESSIONAL PLUS AMAZON CAN'T EVEN CONTACT THEN BY PHONE JUST EMAIL!! So I you what that says", "Title": "Do not n I mean do not buy from them", "Date": "January 11, 2013"}, {"Author": "vicki miller", "ReviewID": "R1QF49TXRS6P9S", "Overall": "2.0", "Content": "Within a couple days of getting this the buttons for the power and the volume broke and fell out of the tablet, and it was used very nicely, not rough. Very disappointed I have sent back for repairs or money back!", "Title": "Made super Cheap!!", "Date": "January 11, 2013"}, {"Author": "ivan zinkiv", "ReviewID": "R1YPKVR9BY3J8X", "Overall": "1.0", "Content": "i order this item befor Cristmas they never sand me thi item i lost time on my prasent for my kids", "Title": ".", "Date": "January 11, 2013"}, {"Author": "Matthew", "ReviewID": "R3HESPPCSS7RZ4", "Overall": "3.0", "Content": "Purchased this for my 14 year old daughter. She has enjoyed it for the most part.The pros for her are the size and the screen is clear.Cons would be that it is a bit slow with only 512meg ram and it does lock up frequently while catching up.  The screen will stop responding when it locks up and she has had to hard boot it a few times to get it back.Overall a good little tablet for the kids.", "Title": "Nice little tablet that your kids might enjoy", "Date": "January 11, 2013"}, {"Author": "Samantha", "ReviewID": "R19Q2AKBNQE41Y", "Overall": "5.0", "Content": "I bought this product for my son and daughter in law and they love it. They use it every day and have no complaints.", "Title": "Great my kids love it", "Date": "January 11, 2013"}, {"Author": "Shall", "ReviewID": "RQFZJ8V08SZ14", "Overall": "4.0", "Content": "Brought as as Christmas gift, so I had not used it yet. But others that I know gives it high praises.Lady Cancer-Texas", "Title": "Great for Price- Brought for a 5years old", "Date": "December 16, 2013"}, {"Author": "bsassy406", "ReviewID": "R263QGBUMMO2A2", "Overall": "5.0", "Content": "I ordered this for my 5 year old's birthday. He wanted an iPad but I found this to be much more reasonable and offer the same type of apps. It is a little more complicated for him to navigate through, but he catches on so fast he will have it down in no time. You do need a memory card for it. Which is something I am not used to having since we are typically an Apple family. The battery isn't an issue for us since we use it in the car and there is a car charger, and he can plug it up at home.", "Title": "Great Deal", "Date": "December 3, 2013"}, {"Author": "Reginald Anding", "ReviewID": "R1K6OKO55PASCU", "Overall": "2.0", "Content": "You just sent two tablets and pink! you did not send the keypads!! and you sent a paper saying due to inventory allocation you are providing me with a free upgrade of dual camera tablet for my purchase of single tablet camera! where is the single tablet and keyboard I hope! please tell me what is wrong!  Reginald Anding", "Title": "I have a problem!", "Date": "November 20, 2013"}, {"Author": "Chris Randazzo \"Chris Randazzo\"", "ReviewID": "R1NG7L3FYVF1YJ", "Overall": "4.0", "Content": "It's no iPad, but the system is better. It has Flash, not QuickTime, and the apps are better than on an iPod/iPad. You can easily just pick it up, put it in a case, and take it anywhere. It has a freaking awesome cam as well. I apologize for the first negative rating, as the shipping was great, the boxing was in perf condition, so thanks. c:", "Title": "Here on time and I love it.", "Date": "February 25, 2013"}, {"Author": "Pink Juice", "ReviewID": "R2UTK6GXO95Z6Q", "Overall": "5.0", "Content": "I purchased the Zee Pad for my 4 yr. old and she loves it! I have not had any problems with it (knock on wood) and it is very easy to use. I thought with the price being so low, I would have to struggle to make it perform right, but to my surprise we got a great deal. I would recommend the Zee Pad for anyone looking for a tablet and doesn't want to spend an \"arm and leg\" for it!", "Title": "Love It!", "Date": "February 25, 2013"}, {"Author": "rliz22", "ReviewID": "RTLJ1U7SJRDNB", "Overall": "5.0", "Content": "I ordered this so that I could listen to internet radio at work since the AM/FM reception is terrible!  This does everything I need and more.  I'm just figuring out some of the apps I can use and watching videos, looking at photos, etc.  There are some fun games also which is an added bonus.  Works great, volume is good.  I'm sure it's not as fancy as an ipad but it works perfect for me!", "Title": "Great value for the price", "Date": "February 25, 2013"}, {"Author": "jorge a. rivas", "ReviewID": "R3P1EFCE3CYZU7", "Overall": "5.0", "Content": "I bought 3 of these tablets, for my three boy and they love these tablets, don't have trouble connecting to the internet or using them, the camera is not an excellent camera that can take pictures of a 5 mp camera, so don't be thinking you can use the camera to take quality pictures  But a lot of more expensive tablets out there have the same quality cameras. they are well build my youngest boy has drop his a few times and still working good. for the price this was a good deal and yes I will recommend it to any body.", "Title": "Very nice little tablet", "Date": "January 7, 2013"}, {"Author": "Fred Friendly", "ReviewID": "RSE01LRBWZ1M", "Overall": "1.0", "Content": "I purchased 4 of these and after using them for a couple of months I can honestly say they are absolute crap.Pros:Has Google Play and plays YouTube.Andriod seems to be stable and we have had few crashes.Performance is reasonable for a sub $100 tablet.Wifi seems to be stable and does not drop out but signal receptions is relatively weak.Cons:The screen is very easily scratched.  The manufacturer apparently knew this and included a screen protector.  However, the protector is of very low quality and peels off and/or develops air bubbles after a few days.One of the units had some problems with the internals and if you put your finger on back it in a specific spot it would create a distortion pattern on the screen in the front.One unit was DOA.  The touch screen had a dead spot (which happened to line up with the \"S\" key on the onscreen keyboard making it unusable.  In general, the touch screens are of low quality.  All of them have manufacturing defects like embedded dust particles in the plastic (that become evident after installing the screen protector)  indicating they were produced in a low quality facility.The power button on one of the units has already failed and no longer powers on or off the unit.The screen is a critical feature of a tablet and this one fails miserably on all counts.  It is cheap Chinese crap and should be avoided.I got frustrated and purchased a Nextbook in Walmart for the same price as one of these units and the difference in quality is astounding.  The Nextbook is light years ahead of the Zeepad.", "Title": "Cheap junk", "Date": "January 12, 2013"}, {"Author": "Daniel", "ReviewID": "R33L946GGYBRAX", "Overall": "1.0", "Content": "The wi-fi only worked for a couple of hours...then just didn`t work anymore. There is not a user manual to try to fix it.", "Title": "Wi-Fi doesn`t work", "Date": "December 15, 2012"}], "ProductInfo": {"Price": "$89.99", "ProductID": "B00CB1HS8S", "Features": "Resolution: 800*480 pixels\nRAM: DDR3 512MB\nBluetooth: NO\nBattery: 2800mAh Li-ion Battery, 3 hrs working time\nAC Adapter Input 100/240V", "ImgURL": "http://ecx.images-amazon.com/images/I/31960tizQCL._SY300_.jpg", "Name": "Zeepad 7'' Allwinnwer A13 Boxchip Cortex A8 Android 4.0, 4gb Capacity, 512 Mb Ram, Multiple Touch Capactive Screen, Wifi, Skype Video Calling, Netflix Movies with DUAL CAMERA (Pink)"}}