{"Reviews": [{"Author": "A. Taylor", "ReviewID": "R2VKL4I7D4JWYX", "Overall": "5.0", "Content": "Purchased 3 of the these for Christmas. Great gifts. All who received loved them. My 8 year old has a hard time putting it down. Spends a lot of time on \"FreeTime\" and Amazon prime..", "Title": "better than expected", "Date": "January 28, 2014"}, {"Author": "Trudie J. Ellenberger", "ReviewID": "R1ZGACX042GWV6", "Overall": "4.0", "Content": "Difficult to read on a sunny beach but great everywhere else. Easy to use and  lightweight. Holds its charge well.", "Title": "pro and con", "Date": "January 28, 2014"}, {"Author": "fluffy feet", "ReviewID": "R30QIYM3SXNSW4", "Overall": "5.0", "Content": "I bought two kindle Fire HDX 7's for Christmas for my girls.  The graphics are crystal clear and they are easy to use.  Plenty of apps to choose from along with some free books.  I am planning on getting a tablet when I finish my MBA and no longer need my laptop as much.  I will consider buying the 8.9\" Kindle when I get there (late 2014).", "Title": "Great Tablets for both kids", "Date": "January 28, 2014"}, {"Author": "readsalot", "ReviewID": "R24DY3UE873FDR", "Overall": "5.0", "Content": "It exceeds my expectations! I have the first generation model and loved it, but this one is a home run. Great display, very good sound, extremely easy to navigate.  I think the Mayday technicians will be like the \"old\" Maytag technicians, sitting around with nothing to do.There is nothing I would change on this tablet.  I use it mainly for reading, but also watch movies and surf the net and of course Skype, it does it all with excellence.", "Title": "The Fire HDX is A Home Run", "Date": "November 5, 2013"}, {"Author": "Teacher_Lady \"Teacher_Lady\"", "ReviewID": "R5YJV4IERWVEL", "Overall": "2.0", "Content": "I bought this for my father who has low vision. He is 89 and very active, but he is not tech savvy. I paid extra to get a Kindle that was free of ads hoping that this would make the first screen cleaner and easier for him to see but the circulating messy backgrounds do not make it any easier for him to unlock the devise. The Kindle does have a touch to speech feature that is nice once the device is open, but when it is on, unlocking the device is significantly more difficult than it should be. Once you are reading an Kindle book, or listening to an audible book, there are some nice features, but getting to these features is not easy with low vision. The only way that my dad could use this would be if I opened the device, selected the book that he wanted, set up the text for him and then handed it to him.  I was really surprised and disappointed that this device was not more accessible. We require curb-cuts on sidewalks, and braille on elevators. We should also require that the folks who make these kind of devices include useful accessibility features in their tablets.Update: I have called Amazon and directly asked them to improve the accessibility of the Kindle. I would like to encourage everyone who would like to see better accessibility features for older adults to say so in their reviews and to take off at least one star. Amazon is more likely to help out if they hear this feedback from LOTS of people. It is a great device, and lack of low vision accessibility for older adults is a problem that should be easy to fix.", "Title": "Not for Low Vision", "Date": "May 14, 2014"}, {"Author": "Steve Stockdale", "ReviewID": "R2HBAPSRTOWADO", "Overall": "3.0", "Content": "I bought two of these for Christmas, one for me one and one as a gift, at $179. As much as I wanted to like it and use it, it's just not as convenient as the iPad. For one, getting music to it (except music purchased through Amazon) is a pain, requiring a file transfer app to copy from my iTunes library. From a usability standpoint, there are annoying compromises like: 1) I have to get my glasses and turn on a bright light to make sure I'm plugging the charger adapter in correctly, and then when I do, the connector is at an odd angle - not parallet to the unit, which makes it seem like it's less secure and more fragile; 2) the switch from portrait to landscape is sluggish; 3) having the power and volume controls on the underside are really inconvenient if you want to use it as a music play. The picture is great, but the Amazon-specific OS is a baffling decision by Amazon and indicates their priority is not user experience but on their ability to control the user's experience. The lack of apps and the quality of the apps is disappointing - still haven't been able to get the DirecTV remote app and the Chromecast app to work on the Kindle Fire HDX, whereas I have no problem with the apps on my iPad 2. The Kindle Fire is a perfect example of where comparing hardware for portable devices makes little sense unless you consider the entire functional experience with apps, controls, displays, menus, etc. In this respect Kindle falls short, IMO.", "Title": "Disappointing after owning an iPad", "Date": "May 11, 2014"}, {"Author": "Shelly", "ReviewID": "R2X5Y34ZBVA5RS", "Overall": "2.0", "Content": "I like the new Kindle BUT the OLDER versions are much better. You can no longer use a HDMI device to stream to your TV. You now must purchase an additional product from amazon at a cost of around $100.  I had hoped to use the device in my classroom and didn't even think to look if they changed this capability. If I had known I wouldn't have purchased this product.", "Title": "Older Versions are BETTER", "Date": "May 10, 2014"}, {"Author": "Anniemac", "ReviewID": "R3KZYQHOPK2SZX", "Overall": "5.0", "Content": "Just got my new Kindle HDX and everything is setting up well. Haven't needed help or support yet. This is easy to use and syncs with all my apps easily. It's simpler than I thought it would be. Now I can't wait to get a nice case to keep it safe and some clear anti-glare screen covers. This is the even better than my smart phone and I think it's smarter!", "Title": "Love it Already and just received it today!", "Date": "October 23, 2013"}, {"Author": "mannaalso", "ReviewID": "RBFOBW847VL0E", "Overall": "5.0", "Content": ".Many months ago , I ordered an earlier Kindle but was not happy with it compared to my Apple iPadThis kindle is much better in my opinion -- lighter in the hand ,better screen resolution and sound--- in fact , a very nice device.\"I never leave home without it !! \".  Manna", "Title": "Great improvement!", "Date": "October 23, 2013"}, {"Author": "Christine Root", "ReviewID": "R32QNRBXPTW0ON", "Overall": "2.0", "Content": "Bought my Kindle Fire HDX 7\" after enjoying my Kindle paperwhite for over a year. I thought that the Kindle Fire HDX would solve the problem of connecting without WiFi. Wrong. I also thought he camera would be usy to use. Wrong. I was excited that a MAYDAY button would be there to help me. Wrong. No WiFi =s no MayDay help. The color and quality of the print on the kindle FireHDX is excellent. BUT even after buying a book from Amazon on using the Kindle Fire HDX,I am still having trouble. It is hard and slow to connect to WiFI unlike my other Kindle. It is more confusing to use . No manual. Harder to get back to \"tablet top\" and not clear why my Amazon account shows 20 plus dictionaries in multiple languages are on my Kindle Fire HDX without my requesting them Nor is their an option to delete them under my manage my Kindle account as there is with other books that I have borrowed from the Public Library. Sadly,i was issued an IPAD MINI through work after I bought my Kinde Fire HDX. I have found the IPAD MINI easier to use esp.in terms of the camera function.", "Title": "Mixed Blessing", "Date": "March 28, 2014"}, {"Author": "J.Brown", "ReviewID": "R2XHV0WRQ492W7", "Overall": "1.0", "Content": "I have a Kindle Fire HD and love it.  So when I heard about the new HDX, I was chomping at the bit to purchase one.  But there are TWO deal killers.  In this day and age, a table ought to have a Micro SD memory card slot for expansion, and an HDMI connector - ESPECIALLY a media tablet like these!  The new HDX series has NEITHER.  The original Fire did not have a MicroSD slot either, and I was hoping Amazon would add one, but they did not.  Then they took away the HDMI port which I use often to play a movies on my TV.  They added wireless streaming (via Miracast) which my TV (new within the last 6 months) does not have.  Without that port, the HDX cannot stream to my TV and makes it nearly useless for me - certainly it will NOT be something a I spend $$ on.  Checking the accessory list, they don't even offer a wireless Miracast to HDMI receiver!  Talk about shooting themselves in the foot!  Maybe the next round Amazon... maybe...", "Title": "What were you thinking Amazon?!?!? 2 deal killers.", "Date": "February 26, 2014"}, {"Author": "Thurman W. Adams", "ReviewID": "R34EU8UB8UGLY3", "Overall": "1.0", "Content": "i despise the thing.  After using it for only a few minutes, the screen freezes.  I have contacted Amazon about it and they advised me to hold the On-Off switch in for a minute until the screen goes blank.  I do this and the Kindle reloads and the same things happens again.", "Title": "Defective Kindle", "Date": "February 14, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00CYQPM42", "Features": null, "ImgURL": null, "Name": null}}