{"Reviews": [{"Title": "Great Tablet for the Money", "Author": "Charles Friday", "ReviewID": "R1HQOLT3ZA73E0", "Overall": "5.0", "Content": "First of all Thanks to Amazon and the retailer for shipping my product so fast. It arrived several days earlier.  The FileMate Clear came in its box. I received the tablet, wall charger, Quick Start Guide, and the MicroUSB cable. I immediately was impressed with the overall quality of the device. very light. I think about 8 ounces. The red is ridiculously red. Love it.  I connected the FileMate Clear to its wall charger and begin reading the Quick Start Guide. I know with most electronics that you have to let them charge prior to use, or the devices sometimes do not operate correctly. I found that information in the Quick Start Guide as well. The FileMate Clear needs at least 2 consecutive days of about 6 hours charging prior to use. I read the remaining information in the Quick Start Guide. Nothing fancy, but the warranty information is there as well. I'm glad that I got the additional squaretrade warranty, as like most/all  manufacturers, Wintec Industries' warranty does not cover accidentally damage. Having owned Droid, Apple, and Samsung products, accidental damage like drops, spills, cracked screens, or pulling out the microUSB port is classified as accidental damage. ( Try getting your Apple phone fixed if you dont have applecare for less than 200 ) So today, I set up the FileMate Clear. I found an onscreen widget that provides me with the helpful manual. Nice touch. The FileMate connected to WiFi, and I was able to download applications from the Google Play store without issue.  As I owned droid phones before, I knew that whenever I download applications in an Android device, it is all about what you download and where you store them. Got to remember that the Google Play Store is an open source market, meaning anyone can develop and post an app for the public's use.  The App store for the apple products is way more restrictive. When users download an app, they need to understand that they are accountable for what they download.  A lot of these apps need updates because they have bugs/issues. So you mean to tell me that an user is going to put more stock in a free app than a device that they just spend over hundred bucks on? Really??!!  C'mon read about the app and check our permissions. Permissions are what you are allowing the app to do on your device. Remember, Indiana Jones movie, the old guard guy says, \"Choose Wisely\"  The FileMate Clear has three memory capabilities.  There are two internal storages.  One of them is 1.15 GB and the second is 12.98 GB, then there is the microSD expansion slot.  Typically applications get installed on the smaller internal memory, and users need to remember to move those applications to the larger internal memory, and in Android, that is done by Settings > Apps > Downloaded > Ind App > Move to SD card.  Yes I know, Move to SD card is not the way Android should label this, but it is not Wintec's fault. Its  Google's Android operating system. If the user does not move those apps, the smaller internal memory will make any tablet slower. Its like having one waiter in a restaurant, he can only carry and wait on so many tablets.  Afterwards, I went back to the Google Play store and tapped on the downloaded icon to ensure that the apps that I downloaded DO NOT auto update so that they do not clog my WiFi and tablet every time it connects.  I also downloaded a movie from Google Play and watched it. I still have about a 1/3 of battery after about 6 hours. I am very pleased with the FileMate and I think so of the other reviewers need to be a little more informed in regards to the products they purchase before handing off a complex operating system to a 3 year old.  I wonder how my 3 year son would fare if I opened Windows Excel and told him to make scatter charts and formulas.  Not very well.  Thanks FileMate!!", "Date": "July 21, 2013"}, {"Title": "Great tablet", "Author": "Amazon Customer", "ReviewID": "R35UWD96UXW4WW", "Overall": "5.0", "Content": "I got this tablet just before Christmas 2012. After comparing with what's out there, it seemed like the best bang for the buck. I did by a cheap one from Polaroid at a black Friday sale that went back in 24 hours. It didn't have the google play suite & when I downloaded it (a serious chore), it didn't work at all.  I have had no problems with the Filemate Clear. The only drawback is that there aren't any cases made just for it, but I found a universal one that looks & works great. I use it mainly for an ebook reader, & since it's android, all I had to do is download the apps for the readers I use, mostly nook & kindle.  You can also add the smashwords app that works with the kindle app for a lot more books. I also use it for email, facebook, & games. All work great & I haven't even come close to using up the storage, let alone get into using the 32gb card I added. The camera is ho-hum, but it did what I needed it to do to put some stuff on craigslist (which is also a handy app I added). Some of my friends have kindles or ipads; I seem to be able to do more & not have to worry about storage space. Quite happy with my purchase & my sis-in-law got one also & she loves it too.", "Date": "February 4, 2013"}, {"Title": "Good tablet while it works, beware of Wintec!", "Author": "Ron", "ReviewID": "R2D5YS7Z394J9M", "Overall": "1.0", "Content": "It is a shame that I am writing this review about a tablet that could have been good. To be clear, I did purchase this product at Walmart.com but I would hate for others to make the same mistake I did in purchasing this device from any online site.  The Filemate Clear T720 gives you everything you need in a tablet....while it works. I should have known better due to the light weight of the tablet, the plastic screen, and plastic exterior that exude low quality.  I plugged away happily using the tablet mainly for watching movies on Netflix and TV shows on Hulu. For some strange reason, using any web broswer except for Opera Mini results in extremely slow loading of web content. Anyways, I had the device for a total of 6 months before it conked out on me. The screen would light up like it was giving all it could to turn on but the tablet would not load the Android system at all. Looking at Wintec Industries's You Tube videos, I followed the steps for troubleshooting with no luck in getting the tablet the work. I finally went to Wintec's website and followed the instructions for sending the unit back for replacement since I was still under warranty (a sham).  I sent the tablet back to Wintec Industries by their RMA process through UPS 3 Day Ground in a \"fully cushioned box\" with paper fillings, an air cushion and the original tablet packaging. Within three weeks, Wintec sent me a email stating that there was physical damage to the tablet causing the tablet not power on and they would not replace it. This is a shady business trick that many companies practice to get out of replacing their devices and I did inform Wintec that I would write a review decrying their behavior.  I just wonder in what condition this tablet will be returned to me now, since it was in perfect condition when it was sent. I advise anyone who is thinking about purchasing this tablet to look at tablets produced by Samsung, Motorola, HP, Apple and others that have a outstanding reputation of using quality materials and having quality customer service before buying this. Lol, I guess you get what you pay for. You have been warned!", "Date": "July 16, 2013"}, {"Title": "Item broke and Wintec wouldn't fix it", "Author": "Cathe", "ReviewID": "R3OBC24BV6KPTU", "Overall": "1.0", "Content": "After only a few weeks of normal use the tablet would no longer charge. We sent it back for warranty coverage (we had to pay to have it shipped) and we were informed by Wintec that the charging pin was damaged and it wouldn't be covered under the warranty.", "Date": "October 19, 2013"}, {"Title": "Not worth the money", "Author": "Lora Kinjerski", "ReviewID": "RY41NUF5ZGU1S", "Overall": "1.0", "Content": "The device looked nice and the size and weight were good but within the first 5 minutes of use it froze. I tried resetting it but I couldn't get past the start-up screen. After awhile it went to a blue screen and stayed that way until the battery died and it finally shut off. I couldn't even get the device to turn off. I was so disappointed!", "Date": "September 17, 2013"}, {"Title": "Wow what a great affordable item", "Author": "Sergio", "ReviewID": "R9ZV9UDW39U3U", "Overall": "4.0", "Content": "4 out of 5. Since it was used but no scratches at all.I liked the capacity for its size and once I put a 32GB card it was awesomeI recommend this product to someone that wants a large screen and wants WIFI capability", "Date": "August 22, 2013"}, {"Title": "Good little tablet", "Author": "Catherine L.", "ReviewID": "R367A8ZPVMHDST", "Overall": "3.0", "Content": "I bought this tablet from Walmart.com last December for my 10 yr. old for Christmas. In July of this year the tablet quit charging with the wall charger and only with the usb cord. That didn't last long and the usb would no longer charge it. I contacted Wintech and sent the tablet back. Instead of fixing the charging ports on the one I sent back they did send me another tablet. Expecting the same color (purple) and for it to be a new replacement. They did however send me a black and refurbished tablet to replace the one I sent to have fixed. The least they could have done was sent the same color if they couldn't fix the charging ports on mine. Other than this my daughter loves this tablet and I am looking to by my 2 younger kids one a piece for Christmas with an extra warranty of course.", "Date": "October 15, 2013"}, {"Title": "Excellent", "Author": "Sherri", "ReviewID": "R15KAVXYKA1337", "Overall": "5.0", "Content": "Was everything we hoped it would be - my granddaughter never put it down.Very Satisfied - Would highly recommend", "Date": "September 5, 2013"}, {"Title": "More cons than Pros", "Author": "RandomPegasus", "ReviewID": "R1MJPW97WXY5U4", "Overall": "2.0", "Content": "I was looking for a reasonable cheap tablet so I bought this one. I had it for 1 week.Cons-The back speaker started not to work you could only use it if you pressed the back a certain way which was annoying. Also it is really slow.crashes alotEven by cancelling the apps in the back it was constantly wanting to shut down apps and not wanting to wait for it to load.The camera sucks.When you want to play games with balance like temple run it worked for a while but then the steering was completely  off and no way of fixing it.Pros- If you aren't looking to use it for a whole bunch of apps and have fast internet it is pretty good  I recommend pay the extra money and buy a better tablet", "Date": "March 29, 2013"}, {"Title": "DO NOT BUY!", "Author": "Meagan Bistrek \"Lover of Music\"", "ReviewID": "R1Q3LYE530PUBX", "Overall": "1.0", "Content": "Amazon sent 3 of these tablets and every single one of them had something wrong! The charger port was broke on one. You couldn't unplug the other one with it not shutting off. And the other one went completely black. Do not buy this! Spend the extra money and get real brand tablet!", "Date": "December 7, 2013"}, {"Title": "Cheaply made product.", "Author": "Computer guy", "ReviewID": "R18UDS69EBR6YL", "Overall": "1.0", "Content": "I bought two of these for my children--11 and 9 years old.  Only one of them still works after a month.  My 9 year old dropped his (in the protective case) and worked for another few hours, then nothing.  It appears to no longer charge, and the warranty is useless.  The one that still works has to be reset to factory about once every two weeks, due to software problems.  I can't afford the iPad, so I was hoping these would be a good alternative, but turned out to be a bad investment.", "Date": "June 22, 2013"}, {"Title": "Returned", "Author": "Carrie Davis", "ReviewID": "R3KM6QAT2SV0T5", "Overall": "2.0", "Content": "I was not impressed. I did not like the fact that I had to buy music... I was expecting something that was going to be easy to operate and not be complicated. I thought it over heated to often. I just wish I got my moneys worth and I didn't", "Date": "October 8, 2013"}, {"Title": "don't buy here", "Author": "Richard Garcia", "ReviewID": "R2MDPEILIAUGUT", "Overall": "2.0", "Content": "After buying this at $160 the next week it went down to $130.  Whummp whummp, I should of waited, better yet I should of googled it (later on this).I asked the seller why the price changed after I bought it and then went back up to the $160 2-3 weeks after it went down to $130, then $140 to $142 and then back up to $160 and if I could get a refund for the difference.  The only option I had was to return it costing me shipping it back and the 15% restocking fee, well there goes those $30.So after all this I googled it and found it $129.99 everyday at walmart and in all the colors not the limited they provide.  Stupid me getting complacent with amazon and not checking google. never again will I not google before placing orders here", "Date": "June 19, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CZ6WACI"}}