{"Reviews": [{"Author": "R. Voorhees", "ReviewID": "R3TYRJJY1OG31J", "Overall": "5.0", "Content": "I HAD to have one of these as I've been looking for my ideal Android tablet for some time, and so far, the majority of the pro websites have given the Sony Xperia Tablet Z very positive reviews. Not wanting to wait several weeks, as Amazon states for their shipping times, I bought one straight from Sony...and I couldn't be much happier! Just about every tablet I've tried has had defect issues, build issues, too low screen resolution (or underpowered when it was hi rez), etc., etc. Although it's not perfect, with everything I'd LIKE to see in a tablet, I think it's overall the best tablet currently available.BUILD:I know it's been said in many reviews, but seriously, this thing is amazingly light and well balanced. At roughly the equivalent in weight to an iPad Mini, it's a remarkable feat of engineering. Yet it's also quite solid and exceptionally well made. There is no tablet lighter and thinner than the Z...period.SPECS:Powered by a quad-core Snapdragon processor, the Z scores a remarkable Antutu benchmark of 20,000+ straight out of the box, readily defeating the Nexus 10. That's some serious power, and it shows in smooth and responsive controls, whether surfing the web, running apps, or playing graphic-intensive games. The GPS locked onto 15 satellites INDOORS within seconds using GPS Test. WIFI is rock solid and supports dual-channel wireless speeds of 300 mbs. It links up with a PS3 Dual Shock controller through a USB host adapter at first, then wirelessly after being paired with the tablet. It has a Micro SD card slot for memory expansion up to 64 GB. It even has a built in FM radio for heaven's sake. The IR remote control works very, very well, and the channel guide with show descriptions and pictures is a great added feature. And the ability to \"throw\" the channel to your TV with a simple swipe is pretty cool. And although Sony claims that the WIFI mirroring of your tablet screen is a feature for Sony smart HDTVs, it worked perfectly with my LG TV, much to my surprise. I really haven't had the ability to test out the NFC capability, but I suspect I will eventually as the standard is more widely adopted.SCREEN:Hands down, the Sony Xperia Tablet Z has the most vivid screen of any tablet I've seen, including the Transformer Prime, Nexus 10, and Apple iPad 4, thanks to the Bravia 2 engine, the same used in Sony's HDTVs. It's simply stunning. While not as high of a resolution as the Nexus 10 or iPad 4, I personally think the difference is hardly noticeable in side-by-side comparisons. A Matte finish would have been great as the screen is glossy, but no more so than the other tablets out there.SOUND:Sony touts the sound as a primary feature of the tablet, and for the most part, it lives up to the hype. The 3D surround is decent, although I have to say the Galaxy Note 10.1 still has the best overall stereo and 3D sound with its forward facing bezel-lined speakers. Still, the Sony sound is plenty loud, and full of nice enhancements and equalizers for fine tuning. I have to be honest and say that I was slightly disappointed in this regard, as the overall sound feels hollow, no matter how you adjust it. Not nearly as rich as the Kindle Fire HD's powerful speakers. But still, it's a tablet after all, and headphones are the way to go, with full surround sound support that's REALLY nice in every respect... something I don't think any other tablet features.CAMERAS:Sony made a lot out of the use of its EXMOR low light sensors used in the front 2 MP and rear 8 MP cameras, but at this point, despite it's plethora of features and adjustments, I find the results to be disappointing when used indoors...where you'd think the sensors are best suited. The result is noticeable graininess, even in fairly well lit indoor areas. Outdoors? No problem. Nice, crisp, well saturated photos and video that are as good as you'll get on any tablet. But why manufacturers can't use the same cameras as their smartphones is beyond me. Anyway, I have to say that Burst Mode is really cool. I got some awesome hummingbird photos while sitting on the back porch. I'm hoping Sony can wring out better results with firmware updates down the road.ANDROID OS:A lot has been said about the fact that it's running an earlier, skinned build of the Android OS: 4.1.2 as opposed to 4.2.2 on the Nexus 10. But honestly, the added Sony specific features are largely well implemented while keeping the experience true to the standard Android OS. Sony also stated that they'll have a 4.2 update \"soon\", but we'll have to see how that pans out.HEY! IT'S WATERPROOF!Although this may not be a selling point for many, it does open up some places for use that no other tablet offers, at least without some trepidation, like at the pool, spa, bathtub, or in the rain. Pretty cool I think, and yes, it really does work as advertised. You can't help but feel strange submerging it in a sink full of water for a couple of minutes (up to 30 by Sony's standards), but afterwards, you'll know for sure that you don't have to worry about liquids damaging your investment.BATTERY:Even though it's substantially smaller than the majority of tablet batteries, the Z DOES last as long as Sony claims, and even exceeds my expectations. So far, I've gotten 8 hours of constant use, from surfing to video playback to playing graphic intensive games, and it's down to about 15% remaining. Need I say more?Bottom line? Sony delivered in a big way, and it appears that they've learned from their mistakes in previous, rather anemic tablet offerings. The combination of a great hi rez screen, decent sound, expandable storage, ease of extended use, battery life, raw horsepower... plus features like universal remote control and waterproof... really do make the sum of the whole the best there is, in my opinion.Well done Sony, well done!", "Title": "Sony Xperia Tablet Z: A Strong Contender for Best Tablet", "Date": "May 29, 2013"}, {"Author": "Steven Rafalowsky \"Boris WRTC Trinity College...", "ReviewID": "R3NKFWME6G6KZ7", "Overall": "5.0", "Content": "Years ago, the word Sony was the name for the latest in cool products like the walkman. In the last decade, the name Sony has become an afterthought..tv's taken over by Samsung, cell phones and tablets dominated by Apple. However, the sleeping giant has awakened..xperia phones selling very well and well reviewed, the first 4k tv and the playstation 4 around the corner.So let's review Sony's latest tabletDESIGN...A...lightweight, beautiful to look at, easy to handleSCREEN...A-..pixels isnt everything, gorgeous colors, whites seem to be a little discolored, otherwise a gem of a screenLAYOUT...A...great sony technology with favorite apps, easier way to insert widgets, fast launcherSTARTUP..A+..less than 30 seconds!SPEED....A+..no hiccups, never stutters,chrome works well, 20,000 benchmark apparent here. BLOWS AWAY Asus infinity..no special roms neededGAMES....A+..most of the high definition tablets can't handle gameloft games but this one can!! Real racing 3, Modern combat NO problem and they play beautifully. PS 3 controllers work great with no rooting necessary.SOUND....A-..speakers are just ok but headphones sound great in walkman mode...great sound controls include 3d, frequency equalizer, etc...SKYPE....A+..it works great with no stuttering...no more laptop neededWIFI.....A...excellentBATTERY..B+..it takes a long time to charge but expect 7-8 hoursMOVIES...netflix movies start in 3 seconds!!!STORAGE..A+..64gb microsd card..REMOTE...B..works well but logitech harmony still the one for meIn summary, this is the tablet i have been waiting for. Sony is back!", "Title": "Sony hits a home run....possibly a grand slam", "Date": "June 17, 2013"}, {"Author": "Eli G", "ReviewID": "R2UUF9IN10HYLB", "Overall": "5.0", "Content": "THE PROS-DesignThis is what elevates this tablet from an excellent choice to the best choice. It's the thinnest and lightest tablet with a 10 inch screen. You can use this tablet in ways that would be impractical with a full-size iPad or Nexus 10. Things like holding it in one hand or reading an ebook for a couple hours. It also looks great.-The screen1920x1080 at 10.1 inches isn't anywhere near the pixel density of the Nexus 10, but it's within striking distance of the retina iPad. You probably won't notice the difference unless you're actively looking for it. Text is sharp. Viewing angles are great. Colors look good. It gets very bright.-The IR blasterIt's actually pretty cool. Grab Sony's TV SideView app and you get an attractive TV guide. Selecting a show and letting the tablet change the channel without touching the remote is a neat trick.THE CONS-Port covers are a pain to open up. This seems to be a side-effect of the water-proof design.THE meh-Speakers are ok but nothing to get excited about.-Snapdragon S4 Pro processor is fast but already a generation behind other Android tablets coming out soon.-Battery life is good but not great.-Sony's default launcher is nicely designed but stutters a little bit even after removing the (useless) default widgets. Installing Nova Launcher is an easy fix if this bothers you.OVERALLUltimately, you're paying a premium price for a tablet with relatively high-end hardware and arguably the best design in its class. Whether or not this is worth it depends entirely on how much you value the design.", "Title": "The best 10 incher", "Date": "June 6, 2013"}, {"Author": "Infinite Heteroskedasticity", "ReviewID": "RL0ZL6GGZ7VW6", "Overall": "5.0", "Content": "As a long time ipad owner that just picked this up at a local Sony store I'm very pleasantly surprised - so much so that I decided to write up my first Amazon product review ever.The good- Design - In short, its fantastic. Super thin and really light I was so blown away in person I absolutely had to have one. I like the unique squared off look of it and its pretty much the only tablet I've ever seen that makes my ipad look too big and clunky. This is a full performance 10 inch tablet that weighs as little as some 7 inchers.- Engineering - Whatever one thinks about Sony one can't deny their engineering expertise. This is beautifully put together and built. The internals are solid and the screen is gorgeous. Features like NFC and an IR blaster are significantly ahead of those in my 4th gen ipad.- Durability - As everybody knows this tablet is completely waterproof and dust proof. It can even be used in a shower. As somebody with a young child can attest, spills happen and ipad 4 + spilt apple juice = very annoyed parent. Another bonus is that I can just rinse off the tablet under a tap to get rid of smudges/clean it.- Android - This is a matter of taste obviously but to me, a tablet's primary purpose is as an internet consumption device. Just as I would never ditch the apps and stability of iOS on any phone, I prefer to use chrome natively (not the iOS safari skin) for the internet. Sony's android skin is also really light compared to the others (eg Samsung's touch wiz) and offers some useful features - the remote control app that uses the tablets built in IR blaster is proving very useful indeed. It's also a fairly recent Jelly Bean release so it's fairly smooth and responsive throughout.- Gaming - I like to play a few games while traveling and absolutely hate using a touch screen for most of them. This tablet supports my PS3's dualshock controllers natively and I'm fairly certain PS4 support will be ever deeper when it comes out.The bad- Battery life - Its not terrible but that form factor comes with a tradeoff. I get around 8 hours of mixed use from 100% to 10% with stamina on (restricts network when the screen is off - you can customize it to let certain apps through). Similar usage on my ipad 4 gives me around 12 hours.- Charging - The bundled charger is really slow. The tablet takes 8 hours to charge upto 100% from <10%. It's best to let this happen overnight. In contrast my ipad 4 takes 4 hours at most to charge up its bigger battery.- Android - To some this is a negative. Android is really powerful and much smoother than it used to be but the final user experience is not everybody's cup of tea. For me, having chrome was worth the hassle and all the major iOS apps are also there and work well enough but the final selection is much less polished than iOS. There is also no Amazon Instant Video app for android (AFAIK).- Cameras - On paper the camera loadout is impressive with both front and back cameras significantly higher spec than Apple's In practice the lack of a flash might prove an annoyance. I personally don't care because I have never understood the logic of using a tablet to take pictures but for those that do, it can be an issue.The verdictI wanted a tablet that was light but still had a 10 inch screen and chrome. I liked my ipad 4 well enough but eventually realized that I got the entire experience on my iphone 5 (I'll always stick to apple for my phone) but kept it because I disliked the look of every other android tablet on the market. This tablet came along and fit my needs perfectly. The xperia z tablet absolutely destroys every other android tablet out there in terms of design and engineering. I actually find both slightly superior to even the ipad. I can deal with the (mainly) battery related shortcomings. I've always been a bit of a Sony fan since childhood and had been disappointed with their non Playstation products over the past 5 or so years. In many ways, Apple had become the new Sony. This year, between the successful new phones, this and the very cool looking new Playstation 4 I'm sensing that they're back in a big way.", "Title": "Suprisingly awesome", "Date": "June 23, 2013"}, {"Author": "Abusive Reader", "ReviewID": "RQPD31QXM1RQR", "Overall": "5.0", "Content": "For years,  Sony has been an afterthought compared to apple and Samsung. Apparently Sony finally got sick of this and decided to do something about it. This tablet is the rest.Where do I start? It's about 50% lighter and thinner than an ipad, and is absolutely stunning. I cannot get over how light and thin, and well, sexy this thing is. On top of that, it has top notch internals, beating all current tablets in performance tests. The screen is equally gorgeous. Though the nexus 10 has more pixels, you would not know. Compared side by side, the sonys screen looks better, especially when playing movies.Amazingly well done, Sony. Best android tablet on the market.", "Title": "Absolutely stunned this is a Sony", "Date": "August 19, 2013"}, {"Author": "Louis Fischl", "ReviewID": "R8SFWXBBU7VBY", "Overall": "5.0", "Content": "Having come from a Asus Transformer Prime with the wifi and I/O issues, I was ready for a tablet that was really going to meet my needs - great screen, snappy, good battery life, a mircoSD slot, and overall just a pleasure to use.  I wasn't sure if I should wait for some of the new Tegra 4 tablets to come out or possibly go with the Nexus 10, but after I had the opportunity to play with the Tablet Z in a Sony store, I decided that this was the tablet for me.The tablet comes in a smallish box, just big enough for all the items contained within.  Not premium feeling like some cardboard boxes feel, but certianly not junk either.  Inside you find the tablet wrapped in plastic and with a screen cover stuck to the screen as well.  Lifting the tablet out of the box reveals the wall charger, a USB cable, and Sony warranty and product information booklets in several languages - that's it.  Not much inside, but honestly, not much is required outside of the charger and the tablet.The tablet itself feels amazing in hand - the 'svelte' back, the thinness, the weight, etc - it's really nice to hold and to use.  The tablet has a camera on the back and a front facing camera as well, an IR blaster at the top edge, the power button (which also doubles as the notification LED) and the volume rocker on the left side, and then a few port covers around the tablet - on the top left is the port cover for the headphone jack, the bottom left has a port for the USB/MHL port, and the bottom right has the port cover for the microSD and SIM card tray (which is not useable on the WiFi only models).  The port covers are relatively easy to remove, provided you use your fingernail to lift by the latch on the cover, which can take some doing to find at times.  4 speaker grills are placed at the bottom left and right of the tablet, generally where most people would hold the tablet for viewing, thus making your hands into a sound bouncing device for enhanced listening.  The tablet does have a decent sized bezel around it - while some people might find this annoying, I personally enjoy having a larger bezel on my tablet - it allows you to hold the device without your fingers pressing onto the screen - much more comfortable to place your thumb on the front of the device instead of having to push in on the sides to hold it in my opinion.Pressing the power button in for a couple seconds brings the tablet on, and going through the initial setup of the device is relatively easy - inputting your Google account information, etc.  I personally did not sign up/in for the Sony services, as I did not wish to use them at this time.  Once all set up, there was an immediate update to bring the tablet to Android version 4.2.2 (the tablet ships with version 4.1), which was quick to download and install.  Once completed, I began the process of installing my apps and removing some of the bloatware that I was not going to be using on the tablet, which is easy enough to disable/remove via the application manager.  The tablet is nearly 100% stock android in feel, which is great.  Sony does provide some of their own widgets for use which seem nice to use, but I personally did not care for them.Using the tablet is FANTASTIC!  Screen transitions are smooth and fast, and I have not encountered a stutter at all doing anything.  Programs load fast, and everything just feels super snappy - a MUCH better user experience than my old Transformer Prime.  The tablet does ship with the Snapdragon S4 Pro quad-core SOC - while this may be last year's top of the line processor, it certianly is fantastic in its usage on the tablet, and I don't see how the new Snapdragon 600/800 would improve any functionality of the tablet.  Everything loads fast, games run extremely smooth, and videos load and play back without a hitch.  The screen quality is amazing - incredibly detailed, sufficently bright (even too bright at times on the automatic brightness setting), and is vivid and crisp - watching HD video is a joy on this tablet.  The speakers are sufficently loud as well - very clear sounding, slightly lacking in the low-end bass though (which was expected from a small tablet speaker).  I've only used the IR blaster once as a test to try it out, and it worked great, but I don't see myself really using it all that much as I have a Logitech Harmony to do that work.  One thing to note though, is that the tablet does not have a vibrate feature - some tablets do, some don't - just a heads up in case you were expecting it.Wifi works great - locks on fast to the wifi signal, and has a good, long range.  Spots in my home where my Transfomer prime would die out, the Tablet Z is still locked on and holding a good signal.  GPS actually locked on inside my home as well, telling me I would have no issues doing so outside, though I did not buy the tablet for it's GPS capability.  The microSD slot was a little difficult to get my memory card into, but after it was it, it's snug and has no issues - installed a 64 GB Sandisk mircoSD card (SanDisk Ultra 64 GB microSDXC Class 10 UHS-1 Memory Card 30MB/s with Adapter SDSDQUA-064G-U46A), tablet recognized it and was working instantly - no issues with it at all.  The USB port is also an MHL 5-pin port - I bought the Cable Matters Micro-USB to HDMI MHL adapter (Cable Matters Micro-USB to HDMI MHL Adapter in Black and Charging Cable in Black 3 Feet) along with the tablet and it works great for allowing me to plug my tablet into an HDMI TV.  Note that this uses the 5-pin MHL adapter, whereas some of the new Samsung Galaxy devices use the new 11-pin adapter - they are not cross compatible.Battery life has been up to expectations as well - I usually get 8-9 hours of screentime with mixed useage between web browsing, video watching, and game playing, most of the time with a couple days inbetween each.  Even with the battery saver option off (which disables syncing and turns off all connections while the tablet is sleeping), the battery life is great, especially for a tablet this thin and light.  I also tested the waterproofing, which works as claimed.  Dunked the tablet into the my bathtub and took it out - works as noted.  Don't know if I am going to keep trying it though, as the thought of waterproof electronics still freaks me out.Overall, this has been the BEST android tablet I have used to date, having used everything from the Transformer Prime to the Nexus 7 and 10.  The speed, fluidness and overall experience on this tablet has just blown me out of the water.  I know I will be enjoying this tablet for the next several years.", "Title": "The BEST Android tablet you can buy", "Date": "September 3, 2013"}, {"Author": "Jonathan Charnes", "ReviewID": "R2LNOM8518NN1T", "Overall": "5.0", "Content": "When purchasing a tablet I did not even consider this one at first. It still ran android 4.1 and I mainly just looked at specs when looking at tablets. So, I was looking at the Nexus 10, the iPad 4, iPad air, Samsung note 2014 edition, A variety of Windows tablets, and the Kindle Fire HD and HDX 8.9 . This review will show how I decided against these tablets and for the Xperia Tablet Z.My main top choice was the note 2014. It had the best looking specs and it had the pen which seemed like it would be great for school. However, at the store, the pen seemed a little gimmicky. In addition, the home screen lagged. This one also weighed slightly more (although I didn't really check the weight of this one at the store). I didn't want any lag in a device that costs $500 and the note 2014 didn't seem to warrant the large price tag. Granted a software update may have (and I believe it did) fix the lag, my experience steered me away from the note 2014.The iPad air with ios 7 at the store seemed like a children's toy. It was nice that it was light, however I couldn't get pas the fact that it seemed like a children's toy. In addition, I feel like ios is a very dumbed down OS, so that it feels easy to use for everyone. However, I like exploring features and tinkering with many other things which is pretty much impossible with ios. With ios what you see is what you get. The iPad was great for reading (one of my main reasons purchasing a tablet). However, other than that I saw no great use for it. So for the 500$ that an iPad costs, I decided against it.I decided against an iPad 4 for the same reasons as the iPad air. In addition, the iPad 4 was significantly heavier, and had worse specs.The Kindle Fire HD and HDX were very nice, however they lacked access to the Google play store. This was something I really wanted because I like all of the Google apps such as Hangouts, Chrome, Drive, etc. These apps are NOT available in the amazon app store. In addition, there are MANY other apps that are simply not available for the Kindle fire hd and hdx because they are not able to use the Amazon app store. So while these were beautiful devices, I decided against these as well.Windows tablets seemed very nice. However, Windows RT lacks many apps that I like which is the same issue as the Kindles. In addition, some of the tablets were slightly on the heavy side. But other than that these were pretty much awesome devices. Unfortunately the apps were what made me decide against this. There were some tablets with the full windows 8, which is nice, however I believe that the specs on those were pretty underpowered to run a full windows OS and windows would have taken a significant portion of the available memory.So it was down to the Nexus 10 and the Xperia tablet Z. Unfortunately, the store I was at did not have the Nexus 10 so I was not really able to check this out for myself. However, I knew that support for the Nexus 10 would be coming to an end and the new Nexus 10 was coming closer to being announced. The specs on the Nexus 10 were superior and the price seemed great. So, the only other reason I would not have purchased a Nexus 10 instead would have been the .1 lbs more. The Nexus and the note 2014 do have the most superior screens, however from what I've been reading most content is 1080p or below, so that is negligible.The instant I picked up the Xperia Tablet Z I was amazed. It was EXTREMELY light. It is actually just about .06 lbs more than the iPad air, however this was fine for me because of the bigger screen. Playing around with it seemed fluid with no lag (slight lag now on the home screen if I have a lot of apps open which is normal, otherwise it's great). The lag is removable if I use a different launcher such as Nova, however the Xperia one looks great, so I use that anyways.  In addition, the Sony version of android 4.1 was actually pretty great. It was better than the updated versions due to their changed UI which was optimized for tablets. This one is water proof and has expandable storage (I added a 4gb microsd which is awesome!). It also has a remote function (note 2014 does too). It has an 8gb rear camera and a front camera. In addition it runs every app I want and need. The 224 ppi screen looks pretty good as well and videos look great. Reading on Google Play books and Adobe reader is nice and smooth as well. Magazines look beautiful as well. At first the widescreen format seemed kind of awkward when used in portrait mode, however now that I am used to it it is fantastic for everything I do. The MHL capabilities for TV out and USB OTG to connect peripherals are nice, but I did not test them. I was also able to find this tablet in like new condition on Amazon for $300 (for some reason it was the Japanese version which didn't change a thing) so it sweetened the deal. My only 2 issues which aren't really issues were: 1. the ports start opening by themselves after light use (these need to be closed for the water-proof capabilities) and 2. battery takes a while to charge. However, the battery lasts a long time so that isn't an issue. The port covers opening up is an issue that needs to be fixed, however I don't really use my tablet near any water so it's fine. Although I don't know how it would hold up in my backpack if it was raining outside because of the ports opening. However no other tablet really has this feature and the amazing lightness of this tablet made it the PERFECT choice for me. It did everything I need and it did it great. If you are looking for a perfect tablet, you can end your search here. Trust me! If you have any questions about this or any tablet feel free to ask me :)UPDATE: I forgot to mention a couple other nice things with this tablet. It has multitasking abilities (you can open widgets and resize them and use them and the app that is open. For example I can have a web page or a calculator open while I am watching a video. There is also an FM receiver. I wouldn't put a new rom over this. It is a great OS. I can also download music or videos from computers on my home network using the Walkman app that comes built in.UPDATE 2: Turns out the android 4.3 update came out, however I was not able to get it because I was given a Japanese version from the seller. I was able to have English on my old version and it worked just like it should have, other than this little issue. I assume it would have came eventually, but it's been a while since the US version was released. I did not want to root it or tamper with the original Sony firmware. I am surprised I was able to put a stock US version of the android 4.3 operating system on this rather easily! I just downloaded flashtools, downloaded the firmware file I needed (ftf file), and then I turned off the decice, disconnected, made sure drivers were installed (enable unsigned drivers on windows 8), clicked the lightning symbol clicked flashmode, found my file, clicked ok, and then held the volume down button and connected device and just waited for it to do its thing. It is much easier than it sounds!!! Made my life a million times easier! Now in the future I'll also get the American updates and I'll get them on time. Just make sure you use the correct firmware for your device. I'll update this with any pros/cons regarding the firmware.", "Title": "Best Tablet!!!", "Date": "December 28, 2013"}, {"Author": "Paul K", "ReviewID": "R13XTH6XAAI6YM", "Overall": "5.0", "Content": "I'm extremely happy with this latest Sony tablet.Pros:- very solid build, engineered to perfection.  The lightweight, the balance, the thinness, true Sony craftsmanship- screen colors are rich, the resolution more than adequate at this size. I like the true HD and elongated form factor more than I expected.- Sony Apps: SideView remote way cool -- it's made me enjoy using my television again. Sony Unlimited music doesn't get enough cred. This is really an excellent service with HD streaming, offline playback and playlists, and a virtually unlimited (as the name says) music catalog.  I use this along with Tuned In Pro for my radio.- Waterproof is more useful than I thought. When on vacation, I used in and around the swimming pool. Nice feature.- Battery very fine, longer than I expected due to lightweight form factor.- Speed very fine, no problems for me, snappy.- Music and sound are quite good for a tablet. I pair it up with my Jambox, or else use headphones, so it is more than adequate in my opinion.Cons:- guest mode was removed. maybe this will come back in next OS update. minor, but nice feature for sharing in the family.- screen is a bit smudgy. I may step up for the screen protector.- the cradle is well designed and very useful. downside is the 3' USB cable. It needs a 6' cable to be able to use a floor socket. this was a compromise as the old Sony tablets had real power supplies.Conclusion: I'm extremely happy with this tablet, with the speed and the business apps like Skype, box, and office I can finally use this as a real laptop replacement. The entertainment options rock, and this makes a true fun and business device for me.  I think the price is fair. It's a real laptop equivalent but better in so many ways. The engineering and form factor that Sony puts into the product, I can see the difference.  This is a 3rd generation product and it shows.", "Title": "Does it all", "Date": "June 20, 2013"}, {"Author": "southpawami \"The Best Selling Book IS the Bible\"", "ReviewID": "R1LH3ULSOKOT0P", "Overall": "5.0", "Content": "Summary: This Sony Tablet can be productive.  The screen is Full HD which makes books, PowerPoints, and video look excellent.  The built in notes app supports all sorts of media, screenshots, drawing, and various text options.  Microsoft Edge bluetooth keyboard syncs easily. The Sony software is well thought out.  (And if you're a person that forgets the time, the center screen has a large clock in the middle of it.)Note Art and Screenshots: The paintbrush and pencil tools in the drawing part of the built in notes application make darker lines when moving slowly and lighter lines when moving fast.  The paintbrush gets darker as it layers on top itself.  I'm not sure of the extent of layering with all of the built in note art tools.  This tablet isn't pressure sensitive.  Screenshots of your art, games, or any other app are made by pressing and holding the power button until a menu pops up (select the screenshot option; this is 4.2.2 tested).Memory, Office, and Browser: In 4.2 and 4.3, 16GB and greater memory tablets with the Google Android system seem to me to run better with 8GB free on the main memory, which makes the built in file transfer app useful.  This tablet runs Adobe Flash well.  You can search xda forums for the link to Adobe's download page for unsupported flash installs for Android 4.2; I use flash with web browsers Opera Classic and Boat browser.  Opera Classic is the only web browser on Android that I've tested which passes the Acid 2 test.  Some websites work better with web browsers that pass the Acid 2 test.  Boat browser has floating windows that can be selected from a link in a PowerPoint, making it excellent for multitasking while reading PowerPoints.(Yes, I do read a lot of them.)  In my opinion, OfficeSuite PRO is the best Microsoft Office replacement app for Android.  Even still, buy a couple different office suite apps, as not seeing a PowerPoint page because of a transition glitch may drive you nuts.  Most office suite apps available do not handle files in excess of 20mb dependably.Multitasking: Using the apps in the Google Play store named Widgets Anywhere and Boat Browser are the best multitasking options available for Android.  By multitasking, I mean looking at content from two different places at the same time.  An examples of this are when you are reading and you click on an internet link yet want to keep what you're reading in front of you.  Another example is when you're playing a game and you'd like to keep track of the time.  Other examples might include taking notes over something you're reading(I'm not aware of how to do this), or sketching something when inspiration hits while still wanting to keep what you were doing in front of you(I'm not aware of how to do this).Security and USB: The facial lock system depends a lot on the lighting within a room.  You can take more facial pictures in different lighting to increase the likelihood of unlocking the tablet with your face.  The facial lock times out quickly in order to reduce the possibility of hacking, which the tablet warns you about when you select the facial lock option.  After the facial lock times out, inputing a password, pin, or code is the only option.  The USB slot is a common micro style, instead of the more comfortable full size.  The ideal solution appears to be this StarTech product StarTech.com Micro USB OTG to USB Adapter - Micro USB Male OTG to USB Female Adapter - USB On The Go Adapter.  One reason USB is important is because art applications Sketchbook Pro and ArtFlow on Google Play advertise that they support Wacom tablets.Battery and Camera:  The camera is limited to lighting.  It will take a great sharp shot in the right lighting.  My luck is generally not the right lighting, which leans toward a grainy shot.  The forward camera is the same way, so if you're Skyping an interview, check your lighting.  Battery life is excellent.  I went on a vaction for two weeks with the wifi turned off and this tablet still had 8 percent power.  The screen is the main battery drainer.  Any app that uses Unity drains the battery quickly.Durability:  I've dropped mine while in the Moko case three or four times.  One time part of the corner was damaged after the impact with concrete.  I turned it off waited ten seconds, then turned it on.  It works well for me.  The best durability available appears to be the clear thin plastic case slid into the Moko case.Conclusion:  In the end, it's a tablet.  Not a laptop disguised a tablet.  An elite tablet.  This tablet includes Google content options AND Sony content options, which is more than Google content options only.  The 4.3 update removed the hold power button down for screenshot.  Apps of note on the Google store are Docs to Go(good excel display), VideoPad, My Screenplays Pro, Sunvox, Artflow, WaterColorPencil, Infinite Manga, biiCADo, TurboViewer X, Spacedraw, SubDivFormer, Chanu, Overbite Android(gopher), BoatBrowser, NoteLynX Pro, MX Player Pro, OliveTree Bible Study, Bard's Tale, and Level 22.  On the Sony Playstation store, you have apps that work on both the network and PSVita... so, it seems you can sync calendar events with PSVita.  There's note apps and other practical apps that work across PSVita and this tablet.  These apps have come very recently, so now, it is most definitely possible to use a PSVita in a productive sort of manner.  The game Cytus Lambda on the Sony store is a big plus.", "Title": "It's hard to find much fault with this Sony Xperia Z tablet", "Date": "September 22, 2013"}, {"Author": "Dan Nasty \"dnastase\"", "ReviewID": "R1XJM45SZEETEE", "Overall": "3.0", "Content": "I did my research before buying and I was happy with the specs, advantages and disadvantages of this tablet.However there are three things that I only discovered after playing with it:1) they didn't upgrade the Android on it. I mean the 4.2 was released in Nov 2012, this tablet was released in June 2013 and still has 4.1 on it ?!2) there is a problem when using Wifi and Bluetooth at the same time: the Wifi performance drops by a factor of 10 !! I mean: what kind of quality control do they have there ?!3) the micro-sd card shows errors when used heavily :( This is an even more of a problem than the Wifi + bluetooth issue. It means you effectively can't use more disc space than the internal 32Gb.So far I didn't on the internet any fixes for these issues.", "Title": "Nice hardware implementation, but serious (software) flaws", "Date": "July 31, 2013"}, {"Author": "Amazon Customer \"Goode & Eiffel\"", "ReviewID": "RBIVEE2HVIWDW", "Overall": "4.0", "Content": "I have never owned an Apple product. However, my wife owns an iPad 4 that her work reimbursed. This is my first Android tablet, but I've played around with many. This is the first Android tablet that has been able to convince me to buy. I also own a Galaxy Nexus smartphone and two 5\" Samsung Galaxy Players (for kids,) as well as the original Kindle Fire that my 3 year old uses.What convinced me to buy?o Thin and lighto Decent battery lifeo Higher resolution screen w/16:10 ratioo Waterproofo IR blastero Elegant designo Sony claim to upgrade Android OSDoes the tablet live up to my expectations?Thin and Light: Extremely impressive! This tablet is so thin and light for a 10\" tablet. After using iPad 4 with protective case, this brings a smile to my face when I pick it up. If thin and light is a top concern for you, this is the one. Even my kids love holding this...so much so that my 8 year old thinks it's hers!Decent Battery Life: The battery life of the Tablet Z varies widely. When frugal to moderate, it can easily achieve the claimed battery life of around 8-10 hours. The way I use it with Wifi on,I typically get around 8 hours use. The screen brightness has the biggest impact. When full bright, it will drain the battery very quickly, 4-6 hours depending on what you are doing. With full bright, the AC charger can't even keep up during use. Your battery will keep draining. Even bringing down brightness to about 80% makes a big difference. Around that point, the battery starts to charge back up when plugged in and using the tablet. At 50%-65% seems to be a good balance between brightness and reaching the upper levels of battery life claim.Higher Resolution Screen: The reason I didn't bite on tablets such as the Note 10 is because of the resolution. It isn't bad, but not great. The Tablet Z is sharp, but compared to my wife's iPad 4, it's noticeably behind. If you don't compare to the iPad 4, it is really very good. The 16:10 ratio offers closer to a 1080P experience once softbars are in play. For this reason, I appreciate the 16:10 (1920x1200) resolution. Like any other large tablet, it is harder to type with both thumbs in landscape mode. However, portrait mode is better for typing. Color saturation is not overdone and yet renders colors well.*UPDATE 14 AUG 2013* I bought a great little app from the Google Play Store called \"Thumb Keyboard\" and it makes typing in landscape much much better by offering a split keyboard. It works perfectly with this extra wide tablet. It even helps typing in portrait mode become a better experience. I love that I can add custom mapped buttons on the top row for items like the comma and apostrophe. I am typing this update from the Xperia Tablet Z. Of course, this app can be used on any tablet or phone.Waterproof: We all like a little novelty. The waterproof claims are good. I have the freedom to use this tablet in places I wouldn't dare with other devices. I've used it in the tub, shower, pool, and even wash it in the sink. What you need to know, though, is that if you completely submerse the tablet, it is not functional due to the fact water does conduct electricity. The screen gets confused and does crazy things as if one were touching it all over the place randomly. The good news is, if watching a movie in the tub and it gets splashed, it can take a fair amount of splashing without acting like it is completely submersed. To keep it waterproof, the power, headphone and SD ports have covers on them. Especially power, can be a bit annoying taking on and off all the time. The flap can get in the way while plugging in the power cord. Even with a tiny \"latch\" to hold the cover when off, it does not hold tightly and gets jarred off easily. I'm used to it and willing to live with this minor inconvenience for the waterproof ability.IR Blaster: If you love TV and want a universal remote, this tablet works well. You can customize the layout, although it isn't always the easiest experience.  Bottom line, it works. I've always been interested in the Logitech Harmony remotes and with this, I no longer care to spend money on those remotes. Considering how expensive some of those are, this could be a nice justification in and of itself. The TV guide-like functionality does require an app download. I've used it and it is neat. It works. I set up my Samsung TVs and Bluray players with little fuss. It just worked.Elegant Design: This is subjective, but I think it is very nice looking compared to Samsung tablets. It's simple and elegant. I don't mind at all showing it off.OS Upgrade: I am currently on Android 4.1.2. It came with 4.1.1. I'm still waiting on 4.2, which is supposed to allow multiple user accounts. As of August 5, 2013, I heard 4.2 is around the corner with 4.3 being pushed out even later. While not here yet, I do appreciate knowing I can eventually get those upgrades.Other Notes:o I wish this had a dedicated button/switch to lock screen rotation like the iPad 4. As is, it takes 2 taps just to get to the menu. Other key settings that people want to change on the fly are also two taps away just to see the options. I'd rather it be only one tap away. Since Sony lightly skinned the Android OS, I'd like to see this change. This includes screen brightness, WiFi on/off, and Airplane Mode.o Camera picture quality is so-so. It's there. It needs very good lighting to take decent pictures. There is no LED light.o Video is the same as camera notes.o Sound quality was highly touted by Sony. In reality, speaker does get good loudness, but quality isn't anything impressive. In fact, when loud, it kind of hurts the ears. Compared to iPad 4, the Sony sound lacks much full body and depth and richness. iPad 4 wins hands down. I also own a couple of very high end headphones from Audez'e and HiFiMan and the sound with those headphones plugged in  is better. It's not as good as my Cowon player, but it's good.o Price/Value: Honestly, I'd say it isn't worth the high price unless you must have thin and light and waterproof features. These are the areas it stands out compared to other 10\" inch tablets and where the others are lacking. I was willing to pay for the thin and light, and am happy with the purchase for that reason alone.Conclusion:Mainly because it could be better in the value department, and because of a few other nitpicky points, I give the Sony Xperia Z Tablet 4 Stars. The Sony and iPad each have their appealing points. The choice comes down to which OS environment you want, and which features mean the most to you.", "Title": "Awesome Android Tablet", "Date": "August 5, 2013"}, {"Author": "Tariq Salah Ibrahim", "ReviewID": "R17Y67Z0OJSSY0", "Overall": "5.0", "Content": "I was looking for a light weight tablet since long time. The tablet I like should be with high quality build from a trusted manufacturer because I struggled too much with my hardware failure of my ASUS. This ASUS got not to switch on even plugged to the charger. I read several reviews about future tablets and I decided to buy this one from Sony.I ordered my tablet from Amazon and surprisingly, I received it after few days. When I opened the package, I was very happy of the lightweight of this very thin device. If you compare it to Note 10.1 or ASUS, you will feel the weight and balance difference easily.I switched on the tablet and now I understand why all reviews of its screen are positive. Really, the colors are vivid and the contrast is perfect. I started to fan some pages here and there and I was astonished with the high quality screen. Then, I copied my 14GB high quality photos to the 64GB SanDisk I purchased with the tablet while checking the reading quality of ezPdf reader, office applications, internet pages, mail, ... etc. and simply tell that it is really excellent. Compared to Note 10.1 and ASUS the text is very sharp and the wide screen with the high resolution makes a full page portrait reading easily in most cases.Second I watched some demo movies comes preinstalled and it was glowing with stunning HD and amazing colors. Again contrast play a rule in the tablet to be very happy watching HD movies.Then I viewed the photos. It is a pleasant to see your albums specially if you have a high grade camera.For my usage of a tablet mostly for reading staff, such battery is ok for me. Others may need a better battery to last longer. I am satisfied with the battery because I understood that bigger battery means heavier and bulkier device. The weight of the tablet is perfect. I wish my future tablet to be even lighter and thinner. I know before I purchase this tablet that there are so many negative reviews about the battery. But 9 to 10 hours is ok for my kind of usages.I highly recommend everyone going to buy this tablet to start with a good screen protector because the worst thing in this tablet is the finger prints. Yesterday, I have installed the AromSuit and I'm waiting until it will be dried to see the result. FYI while I'm installing the screen protector I found a very thin micro scratches on the screen glass. I thing that the glass is not scratch resistant and it would be better to buy the screen protector with the tablet not after one week as I did.One more thing, I bought Bamboo stylus it was the worst experience for me. I may bought a wrong stylus but the best thing with the Note tablets is its stylus.Lastly, I'm sorry for my bad English but I tried to explain what I got.", "Title": "Greate tablet from Sony", "Date": "June 19, 2013"}, {"Author": "Daniel peralta", "ReviewID": "R3D4C6SOR21KYH", "Overall": "5.0", "Content": "The sony xperia Z tablet is on par with the iPad if not a little better in case you were considering this tablet don't think twice as this is an android system which let's you do more things that iPad can't even if your iPad is jailbroken and yo get all the features that are described on the ad so I don't need to explain as is all as described, my experience is been great so far!", "Title": "one of the best tablets out there now", "Date": "June 5, 2013"}, {"Author": "Taliesen \"Taliesen\"", "ReviewID": "R201PRFX7TTHD9", "Overall": "5.0", "Content": "I purchased this directly from Sony (as I did not want to wait any longer than absolutely necessary).  I have been looking for the right tablet computer for over a year.  I wanted an Android because my Smartphone is an Android device and I found it interfaced well with Windows (I have had issues in the past with the interface between Windows environment and other OS).  I also wanted something that was fast, with support for either USB or SD memory expansion, with excellent graphics for video and with good sound.  I wanted something that was set up for Wi-Fi and with 2GB RAM.  NOTHING I found on the market matched my requirements-and I looked at all sorts of Tablets.  They either had reliability issues, or build issues, or software issues, or I/O bottlenecks or so on...I could not find anything that met my requirements (which were pretty tough to meet I will admit).  Only two even came CLOSE-and one didn't have expandable memory and the other has known I/o bottlenecking issues.Then I saw the Xperia Z.  Now, I am one of those people who are generally 2 years behind the \"latest\" technology.  It is exceedingly rare for me to buy the \"newest thing\" when it comes out-because I know that 2 years from now it will cost half as much.  So I NEVER buy the \"just released\" items-and haven't for nearly 30 years.Despite that fact, I finally gave in and bought this tablet.  I bought this one based on the \"pre-release\" reviews, the overseas reviews and because the specs matched what I wanted. Nervously, in a panic that I would not like it, afraid I had made a huge error by buying the \"newest thing\"-but I bought it anyway.And I could NOT be happier with it.  It does everything I want-web browsing, e-mail, video playback, GREAT graphics and display capabilities, wonderful sound (both with and without headphones).  The memory expansion works beautifully with SD cards.  It connected to my wireless network without a hitch.  I had NO trouble downloading android apps.  I could go on and on-this tablet is simply a marvel.  I have had laptops that were not this good.Suffice it to say, for someone who NEVER buys the \"latest and greatest\" I am VERY, VERY glad I gave in and did it this time.  If you are looking for an Android tablet that does it all-this is your buy.  A wonderful Tablet!Kudos to Sony on this one!", "Title": "Wonderful Tablet", "Date": "June 4, 2013"}, {"Author": "Kakashi \"Tech Lover\"", "ReviewID": "R1VCXYMV8KM34Z", "Overall": "5.0", "Content": "This is my first tablet purchase and I must say that I love it.  I started using the tablet today when I opened the box I was surprised at how light the tablet is.  For being so slim it is very sturdy. I love the fact that it is water resistant this is great as I have nieces who are young.  I had to update 15 apps on the tablet once I opened it and they updated very quickly.  Downloading apps was equally as fast.  The speakers are loud and clear to me  they are pretty good, though I am sure audiophiles will need to connect headphones.  The sound while using headphones, was also very good. I played a few games with no problems the screen was equally responsive and the sound was good.  The screen is very clear and watching videos both on YouTube and the net were beautiful.  I don't have a problem with the tablet not being made out of metal as I think metal would eventually rust. I cant reiterate enough how great this tablet is check it out for yourself at the Sony Store or read reviews online.  I put a 64GB memory card that was on sale last week So I doubt I will have problems with memory as I also have a laptop and have been using both. I am glad that it has that option. I cannot recommend this tablet enough.", "Title": "My first tablet! I love it.", "Date": "June 9, 2013"}, {"Author": "C. Seaton", "ReviewID": "R1DI8FTM0XK6BC", "Overall": "5.0", "Content": "I spent a good couple of full days pouring over review after review on 10 inch tablets, and eventually narrowed down my choices to the Nexus 10 and the Galaxy Note 10.1.  As a Google fanboy, the direct link to the newest operating systems and best resolution on the market drew me in, while I weighed that against my previous experience with the Samsung Galaxy line of smartphones and the ability to link to a GSM plan.Then I stumbled across a comparison to this tablet, which outperformed both in terms of design.  Okay, to be more accurate, I stumbled across a picture of this tablet functioning while fully submerged in a kitchen sink.  This necessitated a quick stop to the local Fry's to try out a test, as they were understandably sold out of all models.  Less than an hour later I was speeding home at Mach 10 to desperately click \"checkout\" on my account as fast as possible.  A bit dramatic, considering I could've done it with my phone, but don't judge me, I like speeding.Which is clear, after spending about a half hour tinkering with this baby.  It speeds.  Oh, does it speed.  There are a couple other reviewers who can give better technical aspects about it, but the bottom line is, it hauls donkey.  Or at least, it did when I tried using as much memory as I could to give it a rudimentary speed check.DELIVERY UPDATE:When I purchased this, the delivery time was estimated to be 3-5 weeks; July, basically. A day later, it was updated to shipped status.  So don't let the shipping times dissuade you.  From purchase date to \"out for delivery\" took 5 days, including a weekend.Review update:I bumped this down a star to 4.  It's still an absolutely amazing tablet, but I've realized I'm not the biggest fan of the way they implemented the power outlet.  Because of how small the space is with the watertight port cover, I'm unable to completely insert the plug, so it does stick out just a little bit.  I'm sure it's fine, but I'm not a fan of exposed metal when charging a device.Review update 2:  Back to 5.  As mentioned, there is a small slot for the port cover to slide into when turned 180 degrees, allowing the charger to fit easily in the port.", "Title": "It's...my precious....", "Date": "June 6, 2013"}, {"Author": "Windchime516", "ReviewID": "R1PFLCBBO00A44", "Overall": "5.0", "Content": "Better than I expected. More than what I was expecting!  I just lost my ASUS Prime (yeah it worked only for 1 year and 6 months) Don't get me started on ASUS.  I'll just focus on this gorgeous tablet.  Not the best of the best, but it certainly can give the best out there a serious run for its money.  Even the best of the best tablets have its flaws and imperfections.  So lets not nitpick on Sony's Tablet Z.  It works great! Sounds good (just tweak it! it is configurable to give better sound), does not have that tinny tiny sound as I read in some reviews.  They didn't tweak the sound settings. I thought they were right until I stumbled upon the sound settings within the pre-installed SONY movie app and the sound did get better.  Not home theater better...geez...its a tablet, ok? :-) But listening was a pleasure after that.  A good pair of headset will of course make it so much better sounding.  But its not a must, unless you are an audiophile and have to have the best sound :-)  Nothing wrong with that, specially if you can afford the best headsets out there. :-) I say, go for it.This tablet simply ROCKS! Snappy, fast, fluid. *crossing my fingers* so far, I have not experienced any stutter even if I was using the pre-installed widgets.  Probably got fixed with the update, I don't know but I didn't experience any stutters.  Zoom in and out is smooth.  Chrome did not give me a problem.  I also have Dolphin.  Works the same to me, so I just choose the browser I feel like on a given day.Love the remote function...have tried it on 2 TVs...one an old LCD Mitsubishi model...paired easy but it loses connection.  The other one is a plasma tv from Panasonic (4 years old), Comcast cable box, audio receiver (8 years old) and it paired well and up to this day, I can still use it as a remote.  I paired it without telling my roommates so it kinda spooked them some when I controlled the tv and cable box without them knowing it was me from several minutes and they thought something is wrong. LOLThe Bravia Engine is fabulous! It just works wonderfully for me! Go to display settings and configure it to your preference...it is more than satisfactory viewing :-)  I love it!Wifi connection is not a problem this time for me.  With the ASUS Prime, I CANNOT watch Netflix,check my email, twitter and FB coz the ASUS wifi reception just can't handle the distance of the router to my bedroom (second floor with lots of walls and doors along the way).  There were some reviews that say Sony Tablet Z can have wifi problems...well I am just so happy I CAN now watch Netflix, browse, check social connections, download in the comfort of my bedroom. FAST! Smooth! No buffering! Wifi indicator swings from 1 to 2 bars when I am in my bedroom, but I have no problems, it does not stutter or buffer.Camera? meh... don't expect too much.  In broad daylight it is good...great pictures. Not a techy person about camera, but I am happy with the way it captures the colors of the flowers in my garden.  Low light...now that is where you just cant win.  Videos? its okay...not gonna be using it much but when I can and its outdoors...its ok.  It can work for me.  If Sony can fix the low light with an update or something, that would be awesome! But camera isn't why I got a tablet, and I don't take pictures or video wit the tablet...occassionaly yes, I do but mostly outdoors.  I feel awkward pointing a tablet at something really ;-p  Its just me.  You can complain about it if you want. :-)Apps? Not as few as some would let you know.  There's a lot.  Just go search.  MOst major apps found in appstore can be found in playstore. I see no difference when I compare with my friend's IPAD. What do I have? I have picture editors: cymera, piccollage, befunky, instagram; News aggregators: Feedly, Appy Geek, Flipboard, Rockmelt, Pocket, news360, NPR News, Drippler; Ebooks app: Overdrive, Kindle, MangaSearcher; Entertainment app: Netflix, Crackle, Animania, Xfinity player, Youtube; Radio app: STitcher, songza, NPR's Wait wait don't tell, NPR Public Radio; Printer app: CamScanner HD, CloudPrint, Canon EPP; email clients; browsers: chrome, dolphin and photon, Google apps: simple games: candy crush, words with friends, subway surfer, sodoku free, royal revolt, chess, backgammon, minion rush, fast racing, pool mania; social app: Plume, Tweetcaster, FB, Skype, Line chat; Utilities: Trust GO antivirus, airdroid, waze, yelp, ziplist. Some widgets running, calendars, weather, clock and a few more... so if you still need more than these...go ahead, search for it and install.  Playstore is not lacking in apps or widgets.I love the fact I can read my ebook and songza or the music player plays something in the background. My roommate who owns an IPAD was so jealous ;-pThe tablet is nice to hold...the lightness and thinness makes reading your ebook a bliss! I read holding it with one hand and my hand don't get tired easy.  I wish I am not so protective of it tho. But I am, so I got a screen protector (it does have a very thin anti-shatter film already) from SONY to just lessen the fingerprint.  It is a fingerprint magnet...just like every tablet out there. It does not feel fragile because its way thin but the lightness just makes me nervous about dropping it ;-p  I just love carrying  it around.  So I bought a case a cheap one until  I find one that truly shows off its thinness but covers it just the same without gouging your pocket. The one Sony sells is pretty expensive...I can buy a cradle and a screen protector with the price. Besides with the cradle (yes I got one), I will need the case only when I bring it outside of the house.Charging time does not take a long time (I guess depends on how long you use it and for what)...try conditioning your battery. I let it drain to as low as 2% twice and fully charge it. Put it on smart mode, and I believe that helped me get my tablet thru the day and often, beyond a day.  I use my tablet at interval times...but it does make me use my laptop less.  I don't sit and use my tablet for 8 hours straight or even 6 hours...(2-3 hours straight is the most i could do and then just come back to it whenever I get a notice for email, FB, twitter feeds, then listen to anything new, read again, watch, I go pretty much back and forth, just not nonstop use) so I pretty much have a lot leftover as the day ends and I can still have lots to spare for bedtime tablet fun.  I usually charge only at night, sometimes, I don't even need to. I like reading the news, listening to the radio apps, check on my emails and social media apps several times within the day.  I do read ebooks and watch some movies as I work on my laptop. I watch more than one movie on Netflix as I work.  With the cradle, charging time is much better, takes a lot less time to do it.  So yeah, get a cradle if you want to. It does help with the charging time.  You sure can use your tablet while its charging.  It wont drain it, and it doesn't stop charging it just coz you are using. I observed it, when I started to charge it when it got down to 10%, and it did charge...not as fast but it does move...very slow, at 1% every 10 minutes (rough estimate). I was watching Netflix, other times I was playing my simple games.Bluetooth works pretty well too! I have the hdmx jam portable speaker and it rocks well with it. :-)  But like I said, I am happy with the sound from the tablet.  And Airdroid app pretty much makes file transfer/deletion a breeze. No Bluetooth, wires or cords needed, its fast. It connects well with my pc too if I needed it to.NO I haven't dunked it in water...but I have tried washing it when the fingerprints gets too much. I wash it while its ON and while its OFF...it works fine after each washing :-) Just make sure all ports are closed!!!I got the 16GB. Yeah pretty small storage, but after installing all that app and putting like 100 music files and 4 movie in MP4 format...I still have 6.6GB left. Pretty small, yes....but all I  have to do is get a microSD card and I wont feel the limited storage :-) I haven't gotten an sd card, I don't feel I need one despite the small storage space left.  NOt worried about it. Im not a file keeper. And I really don't need music files unless I am in an area without internet and cant use Songza or Netflix for entertainment.Overall, I am so so sooooooo glad to have this tablet.  Don't think of it as an IPAD killer.  But it does shine, looks beautiful, feels good to hold and works really great! And yes, it can stand with the best of the best tablets out there now. Sony did finally get it right...not get it perfect (coz there is no such thing).Should you buy one? Its a personal choice. But I will not hesitate to encourage you. Its a great tablet! I love it! When I was shopping around for a replacement tablet for my ASUS Prime that just died on me despite my babying it, I was looking at Nexus 10, Ipad, Galaxy Note 10.1, windows Rt and lastly, Sony Tablet Z. But when I saw the Tablet z in person, and held it and played with it in the store, I was hooked. Its it for me. Not because the others suck or is not better than Sony Tablet Z. I just like the look and feel and how it responds, more importantly, it works for me. Its gorgeous, its stylish, it works great! :-)Enjoy your tablet z or whatever tablet worked for you! :-)", "Title": "It does have that WOW factor and works great!", "Date": "July 5, 2013"}, {"Author": "Tyler Riddlebarger", "ReviewID": "R1H4ED09EKJC5J", "Overall": "5.0", "Content": "After searching high and low for a good all-around tablet I stumbled upon Sony's Xperia Z Tablet. Sure there are others out there that offer front facing speakers, higher resolution screen, or a faster processor but you cannot get all those features in a tablet right now. The Xperia Z has everything I want in a tablet.Pros:Fast 1.5gHz Snapdragon S4 processor, shows absolutely no signs of slowing downBeautiful hi-def screen, movies and pictures look amazingThin and light, I was actually concerned when unboxing it for the first time, but it is made very sturdyGreat WiFi reception and Bluetooth connectivitySpeakers are wonderfully clearCons:The tablet does flex somewhat, twisting the tablet shows signs of stress on the LCD screenThe tablet is built with thinness in mind and Sony achieved it by basically sandwiching the components between a screen and a thicker plastic backing. Pressing firmly on the back shows up on the LCD by signs of stress.Even with those cons the tablet is amazing. I remedied those cons by purchasing an Incipio case which fits the tablet like a glove and even comes with a screen protector. And let's face it, who really twists and prods their tablet anyway. I did because I am a geek like that. Great tablet from a great company, thank you Sony!!", "Title": "Best Tablet For Many Reasons", "Date": "June 6, 2013"}, {"Author": "Matthew T. Weflen \"Matthew Weflen\"", "ReviewID": "RCWBZ27GITCYJ", "Overall": "5.0", "Content": "I am not a tablet guy. I think touch controls kind of stink. I vastly prefer a \"real\" operating system with mouse and keyboard inputs. So it is not without some due consideration that I say that the Xperia Tablet Z kicks some serious rear-end.HARDWAREFirst and foremost, like the best of Sony's products, this thing is beautiful. I kind of just can't stop touching it. It's super-thin, very light, and is regally handsome. I'm not willing to test the \"3 feet of water for 30 minutes\" pledge, but it is very nice to take this into the kitchen without sweating bullets over protecting it. The matte plastic on the back is a smudge magnet, but it is an easy thing now to just get it a bit wet and wipe it down.The screen, which is 1080p (plus a bit more for Android's soft buttons) is really a joy to view. No, it's not an IPS or an AMOLED display. But the black levels are terrific, the colors pop, and both video and photography look great. It gets bright enough to compete with natural light.The battery management really impresses me. We have an Acer Iconia A500, which is an early Tegra2 Android tablet. I feel like that thing just leaks energy out into the universe, at least 5-10% per night even with nothing turned on. The Z has \"STAMINA Mode,\" which automatically toggles WiFi and background updates off when the screen is off. When it estimates 9 days of standby time, I believe it. I had it off the charger for a good 8 hours and it was still at 100% battery. Watching Netflix in HD with the screen set to auto-brightness seems to deplete only about 1 or 2% per 30 minutes.The audio gets pretty loud and stays mostly clear. Netflix sounded great.The unit charges via Micro USB. I am not a lover of this connector, as I find it gets loose over time. No problems yet, however. Charging is rather slow, taking more than several hours to top off.The quad-core Qualcomm system-on-a-chip seems beefy enough to handle everything. Tasks that positively chugged on our Acer A500 are now quick and light. Scrolling between pages is a breeze. Games run very fast (I play The Pinball Arcade, which can tax older Tegra systems). About the only thing that seems slow is the page drawing on Chrome, but I hear there are workarounds, not to mention other browsers.WiFi has not been a problem for me at all. We have an Asus Dark Knight router which JUST reaches into our dining room (long condo, many walls). The Z locked onto it and I could stream HD-ish Netflix with only minimal hitches. It does better than our phones, not quite as well as our laptops, in this regard.SOFTWARESony puts its own skin over Android 4.1.2. Before you cringe too much, it's actually useful. You get \"small apps\" that run over whatever else you're doing, and there is a dock along the top for 4 frequently used programs (Kind of like Windows 7 and 8 desktops). There are some included Sony programs for music, photo, and movie viewing, but they are easily dismissed from the front page and you can use Google's own stuff.The included Remote Control program is marvelous. It uses the IR blaster along the top edge to be a universal remote for any and all home theater gear. It works with all brands, and it is easy to program macros to achieve any task )e.g. watch a blu-ray, watch TV, change inputs, whatever) which is a real boon to those who might be annoyed by techie stuff like that.The other thing you absolutely MUST get is Sony's SideView program. It is an interactive TV guide that works in tandem with the remote. It delivers an accurate program listing as well as a Netflix-like visual display of current programs. You can select a program to watch (or flick it towards the screen) and the IR blaster will do the rest for you, changing the channel. Really cool.VALUEI think Sony should be pricing this about a hundred bones cheaper than it is. That would put it more squarely in line with the competition (Google's Nexus 10, made by Samsung). If you pay full price, you know you're getting a top of the line Android tablet with design that will make people ooh and aah. But I really do think Sony is putting themselves in a tough to justify realm with this price.CONCLUSIONAll in all, this device has made me a believer in tablets as consumption devices. It will still never replace a laptop for me (interface, storage, and legacy programs are too important to me). But as an entertainment device, I am impressed. It is a very good universal remote and TV accoutrement. It is a very good media streamer. It plays games really well. It has great battery life and a build quality that is both beautiful and trust-inspiring. If Sony cut the price, they would sell truckloads of these things. As it is, it's the Android tablet that can really give people a feeling of tech lust on a par with an iPad.UPDATEI have raised the rating of this to 5 stars, given the price cut - exactly the amount I advocate above.", "Title": "Beautiful hardware, good Android implementation, probably a bit too expensive", "Date": "July 14, 2013"}, {"Author": "Varkan5057", "ReviewID": "R257TW9MYTNQBJ", "Overall": "5.0", "Content": "This tablet is an amazing piece of hardware.  I upgraded from an Ipad 2 and I'm extremely satisfied with my purchase.  The screen is amazing, the speakers rock, the design of the tablet itself is awesome (very thin and light), very responsive touchscreen, and the waterproof and dust proof feature is great.  Amazon shipping was very fast.  Good job Sony on an incredible tablet.", "Title": "Incredible Tablet.  Good job Sony.", "Date": "June 6, 2013"}, {"Author": "sj", "ReviewID": "RDKNU55DT57MK", "Overall": "5.0", "Content": "1. Vudu - Works2. Flixster - Works3. Adobe - Works for all products save Flash.  Adobe Flash does not work on any modern JellyBean tablet.  Adobe killed support after Ice Cream Sandwich.4. Remote is infrared - which means \"line of sight,\" - all tablets with embedded remotes are similar.5. Speakers - wonderful full sound - but you have to be willing to tweak the basic tablet software settings.  To the previous reviewer - Nothing sounds worse or performs more inconsistently and laggy than an antiquated ASUS \"Past Its\" Prime.An hour on the phone with Sony Support for remedial technical assistance on these basic non-issues?, that says it all.This tablet now or the Toshiba Excite Pro in just a few short weeks will serve you well.  And, as everyone knows, never rely on an Aggie's advice!", "Title": "Rest Assured You May Disregard The Previous One Star Review", "Date": "June 8, 2013"}, {"Author": "Zubairuddin Nizami", "ReviewID": "R115XKHJKPYRSR", "Overall": "3.0", "Content": "I think this is a great tablet for most people but there were quite a few small quirks because of which I decided to return this.Let me start with the build quality: it is superb. It feels very light, have no issues holding it in one hand, and the metallic body is just awesome. It is ultra-thin as well and really, as far as looks, feel and weight goes, there is nothing in the market comparable with this.  The ports are covered, which is there ofcourse to waterproof it, but I personally have no issues with this.Screen: The screen is really nice, its resolution may not be as high as Nexus 10, but one hardly feels the difference. I did feel that the contrast wasn;t right and there was no way I could change it. It felt as if the videos had slightly yellowish reddish tone to them but it might have been an isolated issue since none of the reviews mention it.Battery Life; 6 hours aprox on wifi and streaming, no issues. Was very satisfactory for me, but then it depends on what your target is really.Sound: Sound is also very nice, I wasnt expecting it to wake the neighbors up, but I do think it is pretty loud and one should have no issues with it. The speakers are side facing, only front facing could have made it better.The TV remote is a nice feature, for those who intend to use it.Problems:After 12 days of use, the wifi started acting up. It would randomly disconnect from my network and would not reconnect until I turned the wifi off and then back on again. At first it happened a couple of times a  day, but then it got toa  point where it happened every 10 mins, which became unbearable. I have only found 2 other reviews to have this issue, so it is rare, but quite possible.Screen contrast (read the 2nd para)No HDMI output. (This was a deal breaker for me, but might not be important for other people).All in all, its a great tablet, but the wifi issue, and lack of hdmi were the problems for me. If hdmi is not a concern and you are looking for something light and sturdy, waterproof on the go, this is excellent!", "Title": "Great tablet with some minor flaws!1", "Date": "August 25, 2013"}, {"Author": "Ashley D \"Silk\"", "ReviewID": "R2BRZQOXPV3U2C", "Overall": "5.0", "Content": "(Updated Oct 7th for available cases see at end)All of the other reviews are spot on: the best tablet currently available.(but remove the stupid clear screen protector that is pre-installed and useless -it will not remove Sony logo(is a myth), just remove it slowly as you would with any ptotector on a large screen. Trust me, it will significantly improve clarity,glare and reduce smudges. No other vendor I know does this with such a screen.Put your own protector on if you must, but remove the pre-installed one since it will get marked and scratched eventually and you may forget that it exists in the first place. I missed it was even there until I read about it. Made a world of difference when i removed. I NEVER use a screen protector for any Gorilla Glass type display-waste of money when loss of clarity is weighed against glare reduction. Gorilla type glass is its own protection, hence the name Gorilla...)So why repeat what others have said? I want to draw your attention to another benefit, for those of us(in my case middle aged)who have to keep increasing fonts due to our vision. Well the Xperia Tablet with the Sony screen clarity and portrait friendly aspect, cannot be beaten by ANY tablet, even the Ipad retina 4.A bold statement some would say...the less charitable however would say its damned foolish...or even inaccurate. Why? Because it has a lower screen resolution than the ipad or Nexus 10? True. But better specs do not necessarily mean clearer visibility. The hardware and software of the tablet has to support the screen resolution. Just because the tablet is capable of that screen resolution, does not mean that it actually achieves it. Don't get me wrong...both the Nexus 10 and Ipad retina have brilliant screen resolution, but the Xperia, to me anyway, is just as good to my naked aging eye. But 'just as good ' is not better. Sony's screen technology and software makes the difference in clarity. I find that with the ipad 4 the text doesn't look right . I would probably much prefer the retina display on the forthcoming ipad mini actually. I think the retina type displays on larger devices make the type look too bold somehow-that is the best i can describe it.There is a big difference between clear text that is easy on the eye and text that is just too crisp. Sony has the best screen technology ever-it is what they are the best at,IMHO. Their use of contrast,saturation and light, makes all the difference.But, and there is a but, i did not feel that way about  18 months ago and loved the Retina 4(though not the limited Apple Ecosystem, lack of widgets,customization etc): so vision has a major part to play in this.Just something I wanted you to know, especially if you are in your forties and want the best tablet to use for the next few years. This is it.October 7th: I have been using the PDAIR custom Leather sleeve and it is so form fitting that it makes the tablet look even smaller, I swear!It also makes it look even classier if that is possible. Hefty $99.00 price tag though-includes shipping from Hong Kong from PDAIR directly. Worth it to me since the protection is great while taking up little extra space in my man bag :)Sept 16th:I know so many of you do not know how to find a case or a sleeve that does not mess up the awesomeness of this slim light tablet. i found the perfect solution:91)Incipio Feather Case for the Sony Xperia Z Tablet - Obsidian Black (SE-201),which will still allow the Sony to fit inside the:Alchemy Goods Redmond Tablet Sleeve for New iPad and iPad2The sleeve is gorgeous(see my review for that) and has a leathery look to it, classy yet practical,with great protection. The incipio adds zero bulk and no discernible weight.Trust me on this. I purchased and returned 5 cases to provide this solution. Remember that the Xperia is a pretty tough tablet as well. Like this review if it helps you please!!!GMYLE (TM) Black PU leather Laichee Pattern Sleeve Case Bag Cover with extra pocket for Microsoft Surface RT / Samsung Galaxy Tablet Tab Note 10.1 N8000 N8010 N8013 / iPad / Nexus 10 / Asus TF300 TF700 10 10.1 inchSlimmer sleeve-looks just like leather-little bulk. Fits like a glove. Great if you want a slimmer profile. Ten bucks delivered.", "Title": "Perfect tablet for eyes but remove screen Protector: A different kind of review; Found a perfect sleeve/case combo(updated 9/17)", "Date": "September 13, 2013"}, {"Author": "Geremy Dees", "ReviewID": "R1FOV61HBKEOA9", "Overall": "4.0", "Content": "Iv messed around with The tablet for some time now. Enjoying most of it besides the sensitivity of the screen. Thats the only real gripe I have about the Xperia z. Right out of the box you can do so much. Since this is my first tablet im new to how fast they are and how fast downloads for apps and such download. They advertise that the picture quality and screen are top of the line and I agree with half of that statement. The screen is as beautiful as they proclaim. Only wish the picture quality from the camera and the stock photo's were a little better. Over all I enjoy my new tablet.", "Title": "Worth buying now but would be better with a price cut.", "Date": "August 14, 2013"}, {"Author": "Weatherman", "ReviewID": "R2UVQNP9DKPT6L", "Overall": "5.0", "Content": "WOW!This is a tablet!!!Before going into my review, let me give a tip that some may like. If you want a screen protector and want to save some money, LEAVE the screen protector that comes with the tablet on.  Do not remove it.  It will cut down on the colors a bit, but unless Sony puts a watermark or such across the cover, leave it on and it does a great job.  It does not bother screen sensitivity.Back to the review....When this first arrived I could not find the AC charger plug!!  The ports are plugged very well.  Use the tip of your nail to open the ports and there should be no problems.VERY thin tablet.  Lightweight.Runs Jelly Bean, Snapdragon.My tablet did not come with a memory card.  However I believe other versions do.Connects to WiFi easily.Put the tablet in battery saver version, and I'm getting a good 3-4 days of heavy tablet use.  Yes, I have my brightness turned all the way up and I like having the tablet.It's labeled as being \"waterproof\" and although I like having this, I'm not brave enough to try it.  However with the ports all sealed up, I will give Sony the benefit of the doubt here.Count on a good seven hours to fully charge it via AC adapter (included).The applications built in are good.  I like the World Clock.All in all Sony has a good tablet here.", "Title": "THIS is a Tablet!!", "Date": "August 15, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R340VZK45D4GSZ", "Overall": "4.0", "Content": "So far I've been VERY pleased with the hardware. It's as light as my iPad Mini but larger, it's as easy to hold as my iPad mini but again larger, I particularly like the placement of the power and volume buttons something that I've NOT been pleased with on other Android phones and tablets (I'm talking to you Samsung).Performance so far has been solid, fast and smooth. The screen is very nice, but not quite Retina or Nexus level, and there is a very slight tinge of yellow instead of pure white, but the most important quality of this tablet is the fact that its almost impossible to believe that you're holding a complete tablet that includes a high quality display, micro SD card slot, processor, battery, wi-fi and all the other technology into a device so light and so thin.One really nice feature is the infrared transmitter built into the device and the included software which will in fact let you turn the tablet into a remote control for your home theater system. One negative though, it would have been nice if Sony included two infrared transmitters, on the top as well as the side so the tablet could be used in either orientation landscape or portrait to control your home theater devices (and the corresponding functionality in the remote control app to work in either orientation as well). Sound from the unit is loud and clear though of course bass is pretty much lacking as even Sony can't overcome the limitations of moving air through speakers in such a slim device. A larger device could include larger speakers and thus generate more bass but I absolutely believe that Sony has made the right choice creating such a lightweight, slim tablet and if bass suffers so be it.Just a few negatives, it's not running the latest version of Android, it's last year's version but I'm sure an update will correct this fact in time. The skin they use over Android is lightweight and I do appreciate the 4 spaces at the top of the information bar where you can put most frequently used apps available at a tap from any application or screen. The skin also includes a tray of \"mini-apps\" that pop up over other running applications, similar to Mac OS7's desk accessories of days past providing such tools as a calculator, calendar, a mini-web browser and other mini applications. I must admit I've found this functionality underwhelming.I can certainly appreciate the fact that the unit is water-proof to an extent as a benefit when using it in the kitchen while watching your favorite cooking show or catching up on the news or your favorite program. But there is a negative, any ports are covered by a port cover which you must remove to insert head phones, charge the unit, etc. While it's a minimal annoyance most of the time in today's day and age of bluetooth headphones, large capacity micro-SD cards that don't need to be swapped often, etc. it is a huge annoyance that you must remove the port cover to charge the tablet. It was disappointing to learn that the additional-charge companion charging dock which doesn't require you to remove the micro-USB port cover to charge and which I had planned to purchase at the same time as the tablet is back-ordered pretty much everywhere including Sony's store. Once they ship again though, the need to remove a port cover should be infrequent.And finally, again I must praise the general design of the tablet. It's lightweight but sturdy, the button placement for power and volume are ideal, better than any other tablet, speakers are average, not better or not worse than most of the competition, performance is fast and smooth, the built-in infrared controller a significant plus (not available on the Nexus Tablets or iPads) and thus considering all this I believe Sony has put together one of the most impressive tablets on the market today.I'm kind of a gadget hound, I've owned several different tablets, several different phones but even though the Sony carries with it a  premium in cost compared to the competition, you also get more functionality for your money, built-in infrared, remote control software included, water resistant design, and very fast performance so see this purchase as a longer term investment well worth the premium, and with the expectation that this will be the last tablet I buy in the next 3 years. In that light I have no regrets about this purchase and I don't believe anyone else who considers this tablet will have any regrets either.", "Title": "A Very Nice Android Tablet With Just A Couple Negatives", "Date": "August 14, 2013"}, {"Author": "JacobEagle", "ReviewID": "R14AE2FB67UHOT", "Overall": "4.0", "Content": "While i'm watching movies or videos they stop and say sd card unexpectedly removed. It's extremely annoying. Going from laggy apple products to this amazing tablet was the best thing I've ever done. I think the speakers are really good on this tablet not extremely loud but very good quality but who would expect a tablet this thin to have loud speakers? Surprises me what some people say. The screen is sharp the colors are bright but except for white is a little dull. But other than that this will have my attention for a few years :-)", "Title": "completely amazing except...", "Date": "June 14, 2013"}, {"Author": "Francisco Bautista Sandoval", "ReviewID": "R3I8K9B4ORR8L5", "Overall": "5.0", "Content": "I have being owned this tablet for about 1 year. It is just awesome. Very light, the display is very good definition. It is wider instead of square which is very comfortable for handling it with just 1 hand. I honestly prefer this tablet and iPad.", "Title": "The best tablet so far.", "Date": "February 3, 2014"}, {"Author": "Harry T. Goodwin \"Hairy Wolf\"", "ReviewID": "R13977YRY8G9F5", "Overall": "5.0", "Content": "This lightweight 10 inch waterproof tablet turned out to be way more than I expected. I can browse with it, play netflix movies and easily carry it with me when I go out for a bite. Its amazing how many wi-fi hotspots are out there.  Mcdonals, Wendys, Subway, Diners and much more.  The snap dragon  CPU is fast. I have yet to find an app that will slow it down.  If your ports are covered you can drop it in the tub with no damage.( I personally would not do it but you can) The play store has a multitude of apps. It comes with gps installed which works very well with the star gazing programs.. I am very happy with it and Amazon was fast getting it to me.", "Title": "Sony Xperia Z", "Date": "December 24, 2013"}, {"Author": "Tony Dawkins", "ReviewID": "RK3P8KQ1D9LPB", "Overall": "5.0", "Content": "Sony Xperia Z SGP311U1/B 10.1-Inch 16GB Tablet This is by far the best tablet on the market right now. The price is reasonable for what it comes with! The screen is superb. The pixels are not visible! Movies do great! Fast processor! It's absolutely so thin and light! I can not get over how light this thong is. It's hands down the best tablet I've bought. I highly recommend this. As for the bad reviews on this product, it's probably a result of a faulty internal error. Otherwise, if the product is bought in its original, mint condition, then there should be no problem at all. Sony has truly stepped up their game up with the release of this product.", "Title": "This is what you call a tablet! It's the perfect tablet!", "Date": "August 23, 2013"}, {"Author": "Bass Cadet", "ReviewID": "R227L81LAIT5S8", "Overall": "5.0", "Content": "Quite recently, I switched from Apple based portables to Android based. My phone carrier started considering my Nokia phone a smartphone and wanted to start charging for no additional services. I switched carriers, went with a Google Nexus 4, and combined my phone and iPod to one device. When my wife took over the iPad for work, I started using a Kindle Fire for more than just reading. It has been a relatively smooth transition, and Amazon's Appstore for Android has been a tremendous help for finding new apps. I have considered getting a Kindle Fire HD or an Android tablet but never quite pulled the trigger.This tablet has filled the void and then some. Where the iPad is good, and the Kindle Fire is good, this is excellent. It is incredibly thin and light. The display and the performance are superb. Technically, it is outstanding.I tried the near field communication (NFC). Putting the Nexus next to the Xperia does enable communication but I did not have apps to pass any real data.I would prefer if the Xperia had more clearly identified ports. I am not sure about Sony Select, which appears to be Sony's app store front end. I prefer to stick to Google Play and Amazon's Appstore for Android.As far as IPX7, I tested this in an Endless Pool. It is water tight to at least a couple of feet. It probably could be submerged further but I did not want to push it. The seals are reasonably easy to close but will probably degrade to insufficient for submersion after a number of cycles (I would guess around 50 to 100).The main issue with using this under or near water is the touch screen. It is sensitive under water and water splashes can trigger false readings. I wish it could be disabled. Also, for those interested in streaming, WiFi does not work through water. Videos on an external memory card could be played but the touch screen sensitivity makes it not too practical. So much for watching while swimming but it was a nice idea.The remote control and smart TV connectivity work well. These features seem secondary but turn out to be quite useful. The first part turns the Xperia into a big custom remote. On my LG TV, it only took a few steps to configure. Although it will not replace our universal remote, the functionality and convenience is handy when using it with the WiFi connectivity. This took a few more steps, mostly going into the settings and allowing the Xperia to \"throw\" data to the TV. Once set, I could easily stream data to the TV. This is handy for quickly viewing new recordings without uploading them onto the network.", "Title": "Excellent tablet", "Date": "July 29, 2013"}, {"Author": "M. Platt \"UpIrons\"", "ReviewID": "R18J7JVLXBONBM", "Overall": "5.0", "Content": "I had an Asus Transformer Prime and decided to trade it in and get this. I am very pleased. It is light and easy to hold. I do see why others have some problems with the port protectors but honestly those don't bother me much, plus they are what makes it so waterproof, not that I care to test that!I do miss haptic feedback, which I found kind of surprising given that Sony puts them in PS3 controllers, but it's not a dealbreaker for me. I do like the fact that I can play games with my PS3 controller when I want to and it works really well.Battery life is so-so. I was spoiled by the transformer prime and dock, but I think the Stamina mode will help me get through a long flight without a problem. I will say it's nice to have longer range wi-fi and working GPS so that makes me very happy.Lastly, I just read that Sony is planning Kit-Kat support for the Zperia Z Tablet. They should release Jelly Bean 4.3 in December 2013 and then Kit-Kat in 1st qtr 2014 so that shows a commitment to this tablet and that makes a big difference!", "Title": "Sony hit a home run with this one!", "Date": "November 18, 2013"}, {"Author": "Mutts", "ReviewID": "R1JKSYLN82KA5", "Overall": "5.0", "Content": "After a careful review of available tablets, I settled on this one as a gift for my boyfriend.  His ancient Sony laptop has been slowly decaying, and would need replacement soon.  Several things influenced my decision -- Sony's excellent reputation, and previous experience with Sony products- micro USB port- micro SDHD card slot - I will never submit to being forced to use Cloud storage.- Tablet size- Display quality- Glass screen (BF is hard on equipment)- Android system similar to our smart phonesAfter delivery, I spent a week setting up the tablet.  It is an truly fine piece of equipment, and I have few complaints after taking the time to figure out how things work. My few negatives are minor compared to the overall positive impression the tablet has made- Sound is not great for music IMO, but a small bluetooth speaker solved that.- It is VERY slow to charge, but charges last a long time.- There are several settings and apps that bloat the memory and slow the function.  It is well worth doing a little research on setting the tablet up for improved economy- Camera is not either very fast or very good in not-bright light - surprising for a Sony.  Not a big deal to me for a tablet.It is fun and easy to use - I may just get one for myself.", "Title": "Sony Tablet Z 16GB", "Date": "November 10, 2013"}, {"Author": "EJ", "ReviewID": "R3DL3A9LJ09P9V", "Overall": "5.0", "Content": "Although the screen specs of the Xperia Tablet Z might not compare to the Nexus 10, the tablet as a whole is a level above its competitors. Tech specs are similar, if not better, than the IPad with retina display  It is the thinnest 10 inch tablet and extremely light, yet it is waterproof up to 3 ft (an ipad can't even survive a coffee spill) and dust proof. The back camera is 8 mp, much better than the 5 mp IPad with retina display camera. With more marketing in the United States, this tablet could definitely be the most popular android tablet on the market today.", "Title": "Overall Best Tablet on the Market Today", "Date": "June 13, 2013"}, {"Author": "Timothy A. Peterson", "ReviewID": "R184CKC9UZUVOJ", "Overall": "4.0", "Content": "Like:1. Very light. My wrist gets tired holding a ten inch in landscape mode. So the more weight you can save, the better. This one fills the bill. The light weight makes it a viable option over a seven inch tablet.2. Waterproof! This was not my reason for getting it, but it's a nice perk. I've run it under water and it works as advertised. The peace of mind knowing that if I spill a drink I'm not going to ruin my $500 investment is nice.3. Expandable memory. Google doesn't seem to think we should be allowed to use memory cards. They want to force us to use their online storage. This is stupid. What about when I'm somewhere that I don't have wifi or network coverage? What if I don't want my documents stored online? This is why I'm not sold on the Google Nexus line of products.4. Compatibility with peripherals. You can use bluetooth, but for lack of a bluetooth mouse I plugged in a regular one with a USB to micro USB adapter and it worked flawlessly! Using the same adapter you can plug in USB flash drives to transfer data. All tablets and phones should be able to do this. My only complaint is that it doesn't have a full USB port. I have to use an adapter. But since only select few Windows 8 tablets have full size USB ports, I guess I can't complain too much. Don't get your hopes up about plugging in your favorite portable hard drive or dvd drive, though. Tablets don't put out enough power with their small batteries to power these devices.5. Premium quality and feel. Every time I look at it and feel it I'm impressed at its simple elegance. It feels sturdy, yet is very slim and light. Doesn't have a lot of bells and wistles, but it doesn't need them. It just looks and feels good.6. Screen quality. The viewing angles are good, colors vibrant, resolution great. No complaints.7. Stamina mode. With this engaged standby time is greatly enhanced. Put it to sleep and come back to it a day later with hardly any loss of power. Granted, there are apps you can download to do the same thing, but Sony gets props for including something useful like this standard.Dislike:1. Charges slowly. This is unfortunate. It comes with a good speed charger, but other charges don't seem to charge it fast enough. When watching a movie or playing a game the charger can barely keep pace and charging slows to a crawl. I shouldn't have to stop what I'm doing just to allow the device to charge faster.2. Battery life only average. Overall, for such a slim device, I'm surprised it gets the battery life it does. Guess it's a tradeoff for the small package, but it doesn't last a whole day with steady use.3. Lack of dedicated peripherals. Sony needs to offer their own bluetooth keyboard case since other manufacturers aren't stepping up in this area. Peripherals can add so much to a tablet's utility, but there isn't anything available that really seems like it was made for this tablet. The one case I did buy for it is heavy and adds bulk. I don't use it because it detracts from the reason I got it: to have a slim and light tablet. Maybe this is less of a complaint and more of a praise for the product.4. No dedicated micro HDMI port. This seems to be a trend with tablets and phones. In order to cut down on weight and cost they require an MHL adapter to connect to HDMI - essentially making your charging port two ports in one. Not a fan. Keeping an extra adapter that you have to plug in separately is inconvenient. At least it works with the generic MHL adapter I bought. I can't say the same thing for my Galaxy S3 phone which requires a special Samsung brand MHL adapter.5. Product update loses good features. The preinstalled software isn't bad, and the virtual button layout is good. But when you download the newest android update the home, back, and list buttons move from the left bottom of the screen to the middle. Sony, please fix this! One handed use is no longer practical. It was better before. Also, Sony had a nice screen dimming toggle available from the home screen that is no longer there. Sony took the android OS and improved on it, but with the update those features are lost.6. Speaker placement. To its credit, the speakers put out good quality sound and are sufficiently loud. However, the speakers are placed on the sides toward the bottom. When holding in landscape, your hands will cover these speakers. Having to make a conscious effort to uncover the speakers to get the best sound is less than perfect.Overall: Super good if you want something light that feels good in the hand, looks good, and offers unique features you won't find in other tablets. Offers versatile performance with a processor that seems fast enough to accomplish whatever you throw at it and a screen that looks great. It's expensive but worth it.", "Title": "Great tablet", "Date": "September 17, 2013"}, {"Author": "Jozabad Jonathan", "ReviewID": "R2T02ZWN8QITTK", "Overall": "5.0", "Content": "This is one of thr best tablet ever. The graphics were so good and the sound too. What made me shock and surprise is that the battery last very long compared to other tablet like iPad etc. I would definitely recommend this tablet. Great job Sony!", "Title": "BEST!", "Date": "June 4, 2013"}, {"Author": "cperez2011", "ReviewID": "R2MVMSIUGRNM8Y", "Overall": "5.0", "Content": "I had an Ipad for 2 years and it doesnt come even close to this, from screen, handling, and perfomance.... Sony tablet is the best, only thing ipad wins is on battery life, other than that I take this baby all day long", "Title": "best tablet out there", "Date": "May 5, 2014"}, {"Author": "S. Sarnowski \"Gaming Guru\"", "ReviewID": "R1ZK46W7ZLTHZO", "Overall": "5.0", "Content": "I spent several weeks waiting for the Xperia Z2 to drop while researching tablets. The Sony Z was in the top of several lists I viewed and when it comes to scoring, performance, what really matters it was essentially identical to the other big name, well known, popular tablets. I came to the realization the extra money the Z2 would cost just wasn't worth the minimal upgrades. Sprained my ankle when I decided it was time to pull the trigger since I'd be cooped up for 2-6+ weeks. 4 weeks later I'm using the tablet often enough and loving it. Being an Android device I'm sure everyone should know what to expect in those regards. Just like any Android OS on a smartphone or other tablets. Easy to use, tons of apps, games, etc. The performance is great. It's processor is snappy, HD videos stream and play excellently and using multiple tabs via Chrome web browsing doesn't slow this guy down. Enough can't be said about the display. The picture is great from streaming a Violet copy of a movie to reading an article online the display is excellent, Even the sound is incredible especially when taking into consideration how thin and light this tablet is. It's not going to shake your house but it is pretty loud and clear. It's a great tablet and to anyone who is considering one I'd say roll with it. You won't be disappointed. It's a great device in every aspect.", "Title": "Complete Package", "Date": "April 20, 2014"}, {"Author": "Reader 503", "ReviewID": "RP3MJNHAF5R9G", "Overall": "5.0", "Content": "There is so much basic usability in this. Some of the preloaded apps will need to be updated upon first powering on. The screen holds fingerprints, but maybe I'm particularly greasy. It does easily wipe with a sleeve, though. I'm very impressed by both how sturdy/strong it feels and how light and thin it is. The shape is much sleeker and sexier than an Apple product (I'm typing this on a MacBook Pro, which I love).I have an HDMI MHL adapter for connecting this to my television and I am really happy with how it looks on a tv. I use it as my streaming device for Netflix and Hulu binges and it works very well. The learning curve will be a bit longer for someone coming from using an Apple device (I keep trying to use some of the shortcuts I use on my i-phone), but the software is fairly intuitive overall. When I first opened this from the box and held it in my hand I was alone at home and I let out an audible \"wow.\" I still feel that way about the hardware. This is an impressive tablet. My one real criticism is with the little memory and usb slot covers. Really, Sony? The best y'all could do was to have little plastic pull-off covers? There are small plastic pieces covering the connection places (sd memory, usb/power, headphones) that make you wonder how, with everything else seemingly so well engineered, that they couldn't have come up with a more elegant solution. Still, if you removed them completely you would have Apple's solution to this, so I suppose they get credit for trying.This is a solid tablet. I am pleased with my purchase and will buy sony computer products in the future.", "Title": "Yeah, \"i-Pad Killer\" Isn't Overreaching", "Date": "April 9, 2014"}, {"Author": "N. Major", "ReviewID": "RR1BM0F7X2L01", "Overall": "3.0", "Content": "I purchased this tablet after experimenting with several others, including the older Asus Transformer Pad Infinity (don't buy that) and a few other android tablets. My needs were to get an Android tablet that was 10 inches mostly for reading scientific papers and textbooks for school, with the ability to be a basic media center (YouTube, Netflix, etc.) came as a side bonus. I found all this and more in the tablet, but it will take some explaining as to why. Let's break it down, shall we?Pros:- Looks sexy, extremely lightweight and thin- Waterproof is a bonus that makes you worry a little less about it- Built in Sony skin over Android is (after patching to Jelly Bean) extremely lightweight, very slick, and one of the best skins I've seen- Plenty of processing power for just about anything. I rarely saw stutter or lag even on high-demand games- Screen, while technically not as high resolution as a Nexus 10 or iPad Air, still looks downright phenomenal- Built in apps can mostly be deleted or removed- IR Blaster is handy and the setup intuitive- Bluetoothing a keyboard to it is easy, and when you do it the productivity of this device skyrockets- Double tap to unlock the screen is a brilliant feature that should be on every tablet- Overall, this is an extremely solid android tabletCons:- Price. I was lucky and got mine second hand from a different site for nearly half of what Amazon sells it for, but the standard going rate is still pretty insane for an Android tablet- Hard edges will turn some people off to holding it. A good case can help with that- Screen ratio is more widescreen than the iPad (which is 4:3), meaning holding it in portrait mode is really weird (which is too bad, since that's how I read most of my articles)- Battery life. The most recent firmware update seemed to make it worse. You'll get maybe 6-7 hours of heavy use. Expect to charge it nightly if you are a frequent tablet user.- Android apps are still not being built with tablets in mind, so lots are just stretched out phone apps. This is more the developer's fault than Sony's, but it's worth noting.- Because it's waterproof, anytime you want to plug something into the tablet you have to open a little flap and leave it open. Kind of a pain for heavy headphone users like myself.However, this is the biggest problem post patch: screen flicker. IT seems not all devices are being plagued by it,but I was one of the unlucky ones. When using any app that uses a keyboard, the screen will flicker randomly and spontaneously. This appears to be some sort of issue with how the GPU/CPU rendering goes with their updated keyboard, which is too bad since the keyboard is pretty great. There is currently a hotfix you can use by going into developer tools and disabling a certain feature, but it's been nearly four months and Sony still hasn't patched in a fix. Bad post launch support, guys.All in all, if this tablet were cheaper I'd say the jump to it would be easier. I'm satisfied with the price I paid (Which was about half of what it is on Amazon). However, if you pay a premium price for a product, you expect to get something that works seamlessly and doesn't have any large issues. While this tablet is really, really good, it has too many nagging issues to merit the high pricetag. If you can get one for cheaper then it's great, or if you live on the beach or something and need the water/dust resistance it's a must-have, but beyond that there are better tablets in the price range (the Nexus 10 for Android, and of course the iPad if you're into that ecosystem).", "Title": "A solid tablet with mediocre battery life and poor post-launch support", "Date": "April 9, 2014"}, {"Author": "W. Bickram \"lastjedi1974\"", "ReviewID": "R27QHKMJG718L", "Overall": "5.0", "Content": "Reviews were great, and clearly justified.  Great look and feel, so much that sometimes it just feels too light. The interface is superb and it loads very quickly.  After minor customisation, it takes a little longer to shut down now.  Snappy while working, I don't see any lags on the system yet.  Skype is an issue, but only with the app not running properly. The ports are just a little issue when I need to access them, but that's minor.  Paired this with a Seagate Wireless drive so I don't bloat the memory with my files.  Very satisfied.", "Title": "Best in show", "Date": "January 30, 2014"}, {"Author": "B. May", "ReviewID": "R7AY1AXR6YYX", "Overall": "4.0", "Content": "Ok,  I just upgraded this tablet which I purchased in October 2013 and I could not be more impressed.  As an Android fan,  this well produced and well built tab is perfect for me.  Smooth operation and an easy update to Android 4.3  makes it a winner for me.  The IR blaster makes it easy to control my home entertainment center and play my favorite Android games.  I  purchased the Sony dock which keeps the wear and tear down on the water resistant flaps.  This tab will easily be my default for the next several years.  By the way,  out the box,  this tab was running Android 4.2 and it did have some wifi issues (1 ft from wireless n router signal strength was low and stayed low anywhere in a 800 sq ft apt).  After update the range and signal strength is much better.", "Title": "Great Android Tablet", "Date": "January 10, 2014"}, {"Author": "Lars", "ReviewID": "RPM4YEFVV4LSC", "Overall": "5.0", "Content": "Been looking at getting a tablet for several months now.  As an iPhone user, I naturally gravitated to the iPads first.  Very nice devices, however, I could not justify the huge price tag for a new iPad Air 32gb.  So I started looking at Android tablets.  Read a ton of reviews (here and \"professional\" reviews) and played with a few at the local electronics store.  The Xperia Tablet Z just stood out with it's size, weight, speed, micro SD slot, and screen quality (didn't care about the waterproofing).  Ordered it on Amazon immediately.  First thing I did when I got it was upgrade to Android 4.3.  PROS: High res screen quality, fast processor (very few or no hiccups when swiping home screens, apps load quickly, etc), weight, ability to add a micro SD card, battery life (use it on and off all day and still had plenty of juice left), and customization of the Android interface (when compared to the lack there of in iOS).  Only a couple of CONS: Very slow charging, plastic caps over everything is a little annoying (I know it's for the waterproofing, but they feel like they could break off easily), Chrome browser not as fluid as Safari (more a personal preference than a con), and the Xperia keyboard is a little buggy at times (strange flicker occasionally).  A number of co-workers have commented positively on the look, feel, and weight of it.  Would absolutely recommend it to anyone looking for an Android tablet.", "Title": "Beautiful 10in tablet", "Date": "January 7, 2014"}, {"Author": "eragon9199", "ReviewID": "R3JT9SVIFU0HNG", "Overall": "5.0", "Content": "I started with a cheap, poor quality tablet from china because I was not sure if I would like having a tablet.  I liked the idea of those, but they were such poor quality that I couldn't stand to use them.  Some time later I got one of the Toshiba Exite 10\" tablets.  It was good, and much more functional, but compared to this tablet, it was clunky and slow.  I love this tablet, and being a PlayStation owner, the connectivity between all of my PlayStation content and this tablet is seamless and quite fun.", "Title": "Best tablet I've had", "Date": "January 4, 2014"}, {"Author": "SeaBass", "ReviewID": "R136DMUCZFJR0R", "Overall": "4.0", "Content": "I'm not amazed at all, but definitely not disappointed. It looks good. Feels good. Sound quality was a little disappointing. For me, it needs a little bit more bass. My previous Asus Transformer tablet was louder. But then, this Sony has a surround sound mode which is kinda cool. Haven't gone swimming with it yet, so don't know if it floats. But it should be water proof if the ports are plugged. Never tested that yet. Screen is nice. The edges may be a little too sharp for my taste,  after holding it for a while,  it kinda starts to cut into my hands in an uncomfortable way. But who knows.... maybe it's because I haven't chopped much firewood in my life and may be a little wussy. Although I probably should mention,  I'm a commercial fisherman of 16 years.... around here (Alaska ) we're considered kinda tough.All in all...still looking for something better. Would I recommend it to anyone? Go for it if you have the cash, though my Asus of half the price kept me just as happy (before my son broke the screen ). Good luck!  ;)", "Title": "It's a decent product", "Date": "January 3, 2014"}, {"Author": "Esteban \"Esteban\"", "ReviewID": "R292CAWJ0SSTHG", "Overall": "5.0", "Content": "It doesn't have the screen of the nexus but you cant even notice the difference! It has a lot of great features, the sound is great and the movie quality is perfect! It's one of the best tablets you can find IMO.", "Title": "One of the best tablets!", "Date": "August 15, 2013"}, {"Author": "surya", "ReviewID": "R2O08N4JQSPSCM", "Overall": "5.0", "Content": "Hello,It all started when i had a confusion of buying a tab or laptop,since i am a student,and i already do have a laptop.I use my laptop mostly in reading pdf, watching movies and creating ppts in microsoft office.So wondering what good will it make to get laptop again even though i had mac air book in mind, i went for cheap alternatives and landed up in buying a tab even though the battery is not replaceable which is a big minus .  But then again there are so many tabs in market i was confused so as to make a choice,i came up with 4 options based on reviews, ipad,sony xperia z,google nexus 10 and microsoft surface pro Each tab has its own set of pros and cons,but it comes to your decision finally.Surface is good but other than ms package i din find it useful for my purpose even though i do lot of work in it. Apple iPad was cool since i have not use any apple products before i din incline towards it.As a android user i finally rounded up to Sony and nexus. Nexus has bit more pros considering battery life and resolution, TABLET Z captivated by its thin design,so thin and attractive ,you have sdcard slot i currently use 32gb memory no slow down is seen in the performance and you have usb slot too,i plug my keyboard while typing big documents,resolution is nice with this bravia engine technology but i recommend to use it while watching movies and keep brightness low that works for having a great battery life.Protective cases are there in market to keep it nice and safe.It is a fact that new tabs will keep coming in market but all i can suggest is its not a waste of money ,its classic..you got to enjoy the feeling of using this awesome gadget that is what am currently doing  , it serves you as a good companion.I been using it for 4 months now and i don regret my decisions :)..hope to review again about it after a year let us see:)", "Title": "It is an awesome tablet :)", "Date": "August 5, 2013"}, {"Author": "goconfigure", "ReviewID": "R2UEBERSBEKTOD", "Overall": "5.0", "Content": "This tablet is awesome. It is uncannily thin and light. Thinner than any other tablet and lighter than a 7 inch tablet. The IR port is a great feature to make it very useful in the living room and bedroom. Pretty mindblowing that its waterproof too. I saw some dust crusties getting in the display crevices around the glass edges. I just submerged it and wiped it down. Clean and good as new now. The Sony UI is very impressive too. Very intuitive.If you're thinking about this tablet I wouldnt hesitate at all about buying it. You will love it.", "Title": "So Amazing; Better than I expected", "Date": "August 2, 2013"}, {"Author": "dusty jack \"prettygoodcarpenter\"", "ReviewID": "R3IX9X7DF8XPFT", "Overall": "4.0", "Content": "The hardware is magnificent. Thin, light, fast, good battery life.  Feels really good in your hand. The android 4.2.2 is very nice, buttery, well thought out.  The bloatware Sony adds on is a serious detriment.  And then they neglected to include any office-like app(I like Polaris).  Spend more money or you can't create a document.", "Title": "hardware 5, software 3", "Date": "July 30, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R4UQI9U62QIZI", "Overall": "5.0", "Content": "My wife owns (and loves) a Nexus 7 with the same resolution as the Xperia Z but on a smaller screen, resulting in significantly higher pixels per inch, so I really expected to notice a difference in the Sony's display quality. However, I wanted the larger screen and SD card so I went with the Sony.Well, there was a difference in screen quality but it's not the difference I was expecting. The simple fact is, unless you're in to pixel peeping, the Sony display is significantly better, with much truer whites and blacks, a brighter screen (almost too bright on automatic) and overall a much more pleasing color pallet. Typically, I view phrases like \"Full HD Reality Display powered by Mobile Bravia Engine 2\" as little more than marketing hyperbole, but in Sony's defense, whatever they did DEFINITELY makes the display noticeably better.This tablet is very fast, especially impressive because it's using a 32 bit processor.  HD movies look great and while I know some reviews have criticized the speakers, I actually found them quite good with outstanding clarity and decent volume, though lacking in bass. The screen (and accelerometer) is very responsive and accurate and, although I'm not much of a gamer, it should work well with most mobile games. I also understand that the Xperia Z will recognize a Playstation controller, though I haven't tried one.The tablet immediately recognized a 64GB microSD card and read/write speeds are acceptable, about on a par with other class 10 microSD devices. And, mounting a USB drive was as simple as downloading ES File Explorer from Google Play and plugging in an inexpensive adapter (mine was $2.99 on eBay) and drive.The downsides. . .? Well, both the front AND back are fingerprint magnets. I swear fingerprints appear in places BEFORE I touch the screen! The front 8MP camera has decent resolution and color but fairly high noise levels, especially in low light. Some of the problem appears to be in the image processing software; I've seen images from the same Exmor R sensor used in other devices that were significantly better so perhaps a future update may result in improvement.  OTOH, I would never consider using a 10+\" tablet as a camera so it's not much of an issue for me. Finally, the 500ma charger is FAR too small for the tablet and charging can easily take 8 hours from 10% to full charge.  Again, not an issue for me because I already own a 2.1A and 4.0A USB charger that cuts the charge time in half or better but Sony really should have invested a few cents more for a higher output charger.So, am I happy with my purchase? Absolutely, especially because I purchased the 32GB Xperia Z from Amazon's Warehouse Deals in \"Like New\" condition for 25+% less....good job, Amazon!BTW, the water resistance really works. Good thing, too, because I managed to knock it into the sink on my second full day of ownership...lucky I remembered to seat the little protective covers on the USB port!", "Title": "Exceeded my expectations. . .", "Date": "December 13, 2013"}, {"Author": "...", "ReviewID": "ROOV5C7T31F5Q", "Overall": "5.0", "Content": "I have owned around 4 tablets and I have to admit that this one is, by far, the best one I have owned. It's fast, responsive, powerfull, slim, and easy on the eye. The fact that it's water resistant makes it a great addition to the kitchen (searching for recipes and watching cooking shows and lessons on youtube).  I mainly use this for entertaining and I gotta say that the video quality is VERY good and it runs games like a breeze. Add to this the fact that you can use a PS3 wireless controller with the tablet and you have a nice way of playing games without having your fingers in the way.. I am VERY happy with my purchase and highly recommend this product.", "Title": "Great Tablet", "Date": "December 20, 2013"}, {"Author": "Johannes Kepler \"Peeves\"", "ReviewID": "R2FCFO19R11KVK", "Overall": "5.0", "Content": "Amazing tablet. Was going to get one of those newer tablets out there just cause they are NEWER but this one is still above those new ones today. Micro SD and it's waterproof... WATERPROOF!!!!!!!!!!!!!!!!! >< Im doing this review in the shower just cause I can. WATERPROOF!", "Title": "Best tablet today", "Date": "November 23, 2013"}, {"Author": "AC", "ReviewID": "RKC06JVB5UXOR", "Overall": "5.0", "Content": "Great tablet all around.  Operates smoothly without lag.  Waterproof-ness of the tablet makes it truly a mobile device as I don't have to worry about rain.  The only improvement I can think of is for it to charge faster, but the battery life is good enough that I would never run out of juice on the same day if it was already fully charged.", "Title": "Loving it~", "Date": "November 21, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3Q83DF51PS3UB", "Overall": "4.0", "Content": "It's fast and it looks great. I use it constantly and in four months I have had no technical issues of any kind that's related to the tablet. The flaw is this: The waterproof cover for the USB charging port gets slowly twisted out of shape when it's removed over and over (which is necessary unless you use the charging cradle.) It won't stay in place anymore. At first it just bulged a little but now it falls completely open.", "Title": "Great with just one serious flaw", "Date": "November 8, 2013"}, {"Author": "crazygirl \"kelli\"", "ReviewID": "R1NC7FXUWHYJTP", "Overall": "5.0", "Content": "I didn't purchase this item at Amazon but I did buy the accessories at Amazon. Husband brought me home the tablet. What a pleasant surprise!!! I love it already compared to my Motorola Xoom. It is much faster and the clarity of the tablet is awesome. It is so light weight. It is so nice having a tablet that doesn't feel like a boat anchor. It is much lighter than my 7 in Kindle fire which I love as well. Can't compare the kindle with the Xperia Z since the Xperia Z since the kindle is not android. The ports are kind of a pain to pop open with a finger nail. The battery life is not as long as stated, but aren't they all? So make sure you charge it before you use it. My came 66% charged. It takes about 4 hours to charge from 25%. Aside from that, I am impressed with this tablet with the water resistant design. The speakers rock compared to other tablets. It even has a Walkman for those of you that use it!!!! It's great for play station and the remote feature is totally cool. Every tablet has it's quirks, but this one hasn't shown any other than the above mentioned. Look out Apple......Sony Rocks!!!!!! The Xperia Z is the bomb.", "Title": "Watch out Apple", "Date": "October 18, 2013"}, {"Author": "Tim", "ReviewID": "R2SIRUYRPO7P3C", "Overall": "4.0", "Content": "Impressive screen, great in weight and really thin. Battery lasts long. Power hook up at the bottom is not the best place, but meets my expectations. Accessory a little expensive.", "Title": "cool tablet", "Date": "August 26, 2013"}, {"Author": "Jeff Benham", "ReviewID": "R159BPP52487WW", "Overall": "5.0", "Content": "It should be noted that the item was defective. Amazon's return policy is simply amazing. We had a new device in two days, before they even received the defective one from us, and they paid the postage! I bought this tablet for my wife because somebody finally came out with a sleek, light and potent tablet! She also has an Acer A100 which is a very nice tablet, but not nearly as functional.", "Title": "Second time is a charm", "Date": "August 4, 2013"}, {"Author": "E. Black", "ReviewID": "RC8WSVWN3ISEV", "Overall": "5.0", "Content": "I just love this tablet! It looks sophisticated. It is incredibly thin and light. The screen is bright and sharp with rich color. The processor is responsive and plays games very well. The speakers are surprisingly loud with good quality sound. I like having both front and back cameras for video conferencing and taking photos...the photo quality is OK but there's no flash. It is nice having a micro SD slot--I added a 64 GB card for music and videos. From a full charge I can use it all day--web browsing and watching videos and still have battery left. Make sure to use the included charger or a similar one with 1500 mA output otherwise it trickle-charges which takes all day. I'm afraid to really test the water resistance but it is comforting to know it is there and I don't have to worry if it gets sprinkled on outside or when using it in the kitchen or while eating.", "Title": "An Awesome Tablet With A Great Balance Of Features", "Date": "August 3, 2013"}, {"Author": "Andrew", "ReviewID": "R33RMBX4DY9S8R", "Overall": "3.0", "Content": "I love this tablet. It's zippy, lightweight, waterproof, and has expandable memory. It doubles as a remote control for all our DirecTV satellite boxes and all our TVs. I has a nice, crisp resolution. I own several tablets, and this one is my favorite. The battery life is more than adequate for my uses.  However, I had to give it three stars because I've had to send it in for repair twice. I've never had so many issues with a tablet's screen as I've had with the Z. The screen has had to be replaced twice in the last 6 months. Fortunately it was under warranty; although, Sony customer service has tried to place the blame on me both times. So, expect a bit of a struggle with Sony CS if you ever have to send your tablet in.", "Title": "Great tablet when it's not being repaired", "Date": "December 6, 2013"}, {"Author": "Frank K. Kwong \"F. Kwong\"", "ReviewID": "R1JT87SKI8N1MB", "Overall": "3.0", "Content": "I have the iPad, Galaxy 10.1 Note and compare to this Xperia Z tablet, the Z tablet is a bit ahead. It is the price factor that takes it down to 3 stars from a 5. The biggest problem are the underpower and weak wireless. The pros that ipad and galaxy cannot compete are the battery life, screen color, micro usb charging, weight and camera. So, if you have the others, hang on for the next version. If you want to get a new tablet, get the 32GB version.", "Title": "Needs more work", "Date": "June 26, 2013"}, {"Author": "Daur", "ReviewID": "R21N3Y0O3RE7YJ", "Overall": "5.0", "Content": "A great screen and design! The best android tablet at the moment! Sony really surprised after poor Nexus 10. The screen is high quality with good color gamut and contrast. The battery does not disappoint and holds a charge well from morning until late evening. No problems with the volume. Tablet came unopened and undamaged packaging.Thank you Amazon, you are the best seller!", "Title": "A great screen and design! The best android tablet at the moment! Sony really surprised after poor Nexus 10.", "Date": "August 22, 2013"}, {"Author": "jthomas", "ReviewID": "R12D3H6WSSO64D", "Overall": "1.0", "Content": "With normal use, my Sony Xperia z tablet's MicroUSB connector has become loose and intermittent over the short time I've been using it.  I noticed that I have to fiddle with the MicroUSB connection in order to get reliable data transfers between my PC and Sony Tablet.  My tablet is only 5 months old.  I find that data transfers from my PC to my tablet will fail intermittently (e.g., can't create folder from PC, file transfer aborts before completing) until I fiddle with the microUSB connector.  In my humble opinion, the microUSB connector is mechanically weak and too easily damaged due to a lack of mechanical support from the body of the tablet. I like the other features of the tablet (after the software updates are completed), but in my opinion the poor microUSB connection is a fatal flaw with this tablet. I called Sony for a warranty repair, but I got the impression from Sony support that they want to charge me for what should be a warranty repair. The seeming lack of support from Sony and the connector problems make me regret having purchased it.", "Title": "I have trouble with the MicroUSB connector", "Date": "April 12, 2014"}, {"Author": "Shan A. Greer", "ReviewID": "RWJWOU5PZSAKI", "Overall": "5.0", "Content": "If you read my review of the Galaxy Note, you'll know I returned it after having performance problems and buying this to see if it was the Galaxy or an Android issue.  Happy to say it was the Galaxy Note that was causing problems.This tablet is unbelievably thin and light, only bested by the iPad Air and not by much.  It comes with beafy specs including a high end processor and 2GB of RAM.The Sony version of Android is very lightly skinned and mostly provides good features, like the quick Apps that you can launch from the apps menu.  These apps are things like a calculator that show up windowed over your existing apps.  Nice when you want to calculate figures from a spreadsheet or webpage.Battery life is terrific as well.  Sony has a smart standby feature that disables all power-hungry devices (wifi, GPS, etc.) when in standby, if you enable it.  When this is on, the devices loses 2-5% battery power per day.The screen looks terrific with excellent colors, contrast and brightness.Overall, I could not ask for more from an Android tablet.  100% pleased.", "Title": "Best Android Tablet I have used", "Date": "April 4, 2014"}, {"Author": "trbloomer", "ReviewID": "R3ASJSEXMS6T75", "Overall": "4.0", "Content": "I bought this in lieu of an Ipad air because I use android not IOS otherwise I might have gone with the Apple. I chose it for its weight mostly but the waterproof rating is a terrific bonus, can you say \"Reading in the tub?\". My primary use is as an ereader so weight was really important to me.Additionally Sony seems to skin Android lightly so I have no issues with that even though I usually root and install a custom ROM on the various Android Phones I've owned.If you can I'd suggest fooling around with the Xperia, an Ipad air and whatever else interests you to see what works best for your needs.Update June 2014. I still really like the tablet the update to kitkat has been taking far too long given that there isn't any cell carrier acceptance slowing things down for a wifi only tablet.The waterproof flaps are still working but you do need to be a careful with them. The new z2 has an exposed headphone jack which is a major improvement. I use the dock largely so that I don't have to keep accessing the usb port with the attendant risk of damaging the watertight cover. I have changed my review to 4 stars because of the port covers fragility. At the very least they should have been end user replaceable.I find the battery life has been fine, but as others have pointed out this thing charges slowly so if you intend to use your tablet for more than 6-8 hours at a time you probably want to consider other tablets.", "Title": "Fantastic, very light weight", "Date": "February 4, 2014"}, {"Author": "hka", "ReviewID": "R79CMTIGT730M", "Overall": "5.0", "Content": "bought this device during x-mas. now i take it with me everywhere i go. great for reading books as well", "Title": "great device", "Date": "January 22, 2014"}, {"Author": "MAMAS OILS", "ReviewID": "R2Q1POZQKW7T58", "Overall": "5.0", "Content": "everyone who sees it is impressed!  Especially how light it is and water proof.....still learning how to use it though.", "Title": "Love this......everyone who sees it is impressed!", "Date": "January 20, 2014"}, {"Author": "Hunter Norton", "ReviewID": "R15W4R99KPS42C", "Overall": "5.0", "Content": "Did a lot of research before deciding on this tablet. It is really great, especially if you don't want an iPad. Love the UI and the pictures are great. Had it down to this, Galaxy Tab or nexus 10. Very happy with this tablet! It is very fast, handles multitasking without problem and it is very responsive.Pros: light, thin, great UICons: if anything, battery is only ok.", "Title": "Very light. Great tablet!", "Date": "January 11, 2014"}, {"Author": "mjp1101", "ReviewID": "RUR5C6CRA6MC6", "Overall": "4.0", "Content": "Light, slim, sturdy, with a beautiful screen.  Love my Xperia!  Only thing missing is mobile Internet...but i plan on snagging the Xperia mobile phone...supposedly they auto pair and tab can use the mobile data...will see!", "Title": "Great tablet, worth the $ compared to cheaper mfg", "Date": "January 11, 2014"}, {"Author": "myaerie", "ReviewID": "R1K9WGWXEJB6F1", "Overall": "5.0", "Content": "The tablet to purchase if you're not a fan of Apple products.  Love the feel and size!  Very comfortable and light in the hand.  Lighter than the Ipad.  Great tablet for reading, also!", "Title": "Best tablet on the market!", "Date": "January 8, 2014"}, {"Author": "nabil mulla", "ReviewID": "R2V54IETCSBONI", "Overall": "5.0", "Content": "Perfect condition. Amazing seller, great tablet with a lot of features. Highly recomend this product. Great build quality and very durable", "Title": "As described", "Date": "October 27, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R303KXI9X0VZK4", "Overall": "5.0", "Content": "Light. Easy to use. Batteries last all day, charged back up by morning. Android operating system. Speakers are not that great, but I have the Oontz Angle Bluetooth speaker so no worries on the sound.", "Title": "Nice Tablet", "Date": "December 8, 2013"}, {"Author": "Discus crazy!", "ReviewID": "R3O8V8HC19UAJQ", "Overall": "5.0", "Content": "I thought the iPad was the best, then they updated to ios7.  Traded it and went with this.  Wow is all I can say!", "Title": "wow", "Date": "October 8, 2013"}, {"Author": "Anon", "ReviewID": "R4FRRW6ZJ7SN", "Overall": "1.0", "Content": "I purchased this Tablet because:  * I purchased an Xperia Z Ultra phone, was completely blown away, and decided \"I want a Sony Tablet instead of an IPad.\"When I first got this Tablet, I was impressed -- it was thin, well built, and looked just like a bigger Xperia Z Ultra -- exactly what I wanted.Then, I raw into the following problems:  * the (thin) stylus that works on the Xperia Z Ultra does NOT work on the Xperia Z Tablet -- whatever magic was used to make pencils work as stylus on the Xperia Z Ultra was NOT applied to the Xperia Z Tablet. I'm not counting this against it as it's my fault for not researching this earlier.  * it's laggy -- I understand that this CPU is a QuadCore 1.5 GHZ -- and 1.5 GHZ is sorta slow by modern standards -- however, the UI is laggy + jitters -- I found it physically uncomfortable  * worst of all: with the Xperia Tablet plugged into a micro-usb charger -- I can LOSE CHARGE while using the tablet. Yes, let me repeat this again:  * I'm using the Tablet  * The tablet is plugged in via Microusb. The microusb is connected to a wall outlet (not my computer)  * I'm losing battery charge.  This last point makes me really unhappy -- as I intended to use the tablet as an input device for the PC. Well, it doesn't really work if my input device is LOSING CHARGE while connected to a microusb->wall.I consider these two flaws \"fatal\" in the sense that:  * if there's sufficient lag to make me uncomfortable, it's not really usable  * and if I'm losing charge when I connect it to the wall and use it, it limits my use casesBesides the above, I can find nothing wrong with the tablet.", "Title": "Excellent Tablet with Two Horrible Flaws", "Date": "April 27, 2014"}, {"Author": "Ankur Khandelwal", "ReviewID": "R3OLK6MD7PJ2AA", "Overall": "4.0", "Content": "It's a nice tablet, but the UI experience isn't as smooth as the Ipad. Also the port covers aren't very secure. our USB port cover needed to charge the tablet has already broken so it's no longer water proof. The features for remote control and speed for apps etc is good. But the smoothness and ease of use that is in an IPAD just ins't there.", "Title": "Nice tablet, but still has some kinks", "Date": "February 24, 2014"}, {"Author": "zack", "ReviewID": "R3RHFBBFC0RPVY", "Overall": "5.0", "Content": "Beautifully designed 10.1 inch tablet. The best tablet I've ever owned. Simply amazing... Good on you Sony, keep it up", "Title": "Xperia Z", "Date": "October 4, 2013"}, {"Author": "Danny Londner", "ReviewID": "R2RJJXKAR2SOUC", "Overall": "5.0", "Content": "fast, light and even water proof.the best tablet I meet so far.no wonder it gets such good reviews", "Title": "best tablet", "Date": "October 3, 2013"}, {"Author": "Nigel James", "ReviewID": "R3UTW2SLCTUM29", "Overall": "4.0", "Content": "Its has meet most of the expectations that i taught it would. I really like it, the thickness, the weight, the screen. The only thing is i am unable to find a payer to watch some of the online videos that i usually look at.Maybe i didn`t try hard enough. All in all it`s a really great Tablet.", "Title": "Beautiful", "Date": "September 20, 2013"}, {"Author": "ehutt", "ReviewID": "RLJJ0NH4KDNV6", "Overall": "5.0", "Content": "Im writing this review from my tablet. I researched a lengthy amount of time before I bought this and it was worth every penny. I have handled an iPad for at least 6 hours and my xperia is 1000x better. I have used in pool hot tub no issues. Features are fantastic. Good battery. Smooth interface(before update) light durable. I guarantee once you buy this tsblet and power it up and feel the weight you will immediately be satisfied. 5 stars!!! Plus you dont have apple telling you what you can or can't download.", "Title": "Amazing. Very happy customer", "Date": "July 24, 2013"}, {"Author": "Guyen \"gg\"", "ReviewID": "R3O5SEBOV2B789", "Overall": "2.0", "Content": "It is premium priced tablet but lot of it s features are substandard. Display is no match compared to galaxy. Voice recognition has about almost 0% accurate therefore never translate properly. So most of the time I end up just typing. Even auto correction/completion using Google keyboard with scribble feature suggested a wrong word lot of times. Browser hesitates a lot. Have seen couple of times it became unresponsive to any of its buttons and touch screen so I could not even restart it. Average battery life. Long charging time. Wanted to flash cyanogen but it gets complicated by its locked bootloader and special partition holding DRM data. charging cord is too short way too short. After few weeks of usage screen started strangely wobbling around by itself and when it does it wont even allow my to turn off the tablet using power button see here my video:[...]", "Title": "soso", "Date": "December 8, 2013"}, {"Author": "Rowean", "ReviewID": "R2I2TCRHNFXP8D", "Overall": "5.0", "Content": "Look guys I told you before that i'm an electronic. freek, I know good electronic, this Sony tablet not only one of thebest, but the ( Best) tablet on the market,  yes I meant  the Best with a capital (B).This tablet let me put all my remote control  under the bed, because it also work like a remote control, yes remote control.I have gone through some of the top of the line tablet out there, but this one is the top notched. I don't know how toget my hands of the darn thing. Nothing compares to this tablet. Not only that i'm happy with this tablet, But verypleased also. Take my advised people if you want to have a nice tablet pleased go for the Sony tablet.If I could rate this tablet with more stars it would be 10 out of 10, **********.", "Title": "rowean Brennan", "Date": "March 19, 2014"}, {"Author": "G. amirto", "ReviewID": "R3JVSJLPNR4VUE", "Overall": "3.0", "Content": "After owning quite a few different tablets this one is middle of the road. It constantly won't read touches on the unlock screen. I end up having to turn screen off, wait a few seconds then turn back on and then I can slide to unlock. Also it is a bit allow in general when it comes to running apps. But it feels well built and very slender. Just need some ui work.", "Title": "mid range but top price", "Date": "October 8, 2013"}, {"Author": "Gabi", "ReviewID": "R1JAPV46M5BCTI", "Overall": "5.0", "Content": "I absolutely love it! Wasn't having much luck looking for a full out laptop and decided a bigger tablet was a better idea. Bought a compatible keyboard case for it and now I am all set.", "Title": "Perfection", "Date": "September 24, 2013"}, {"Author": "Pip Koy", "ReviewID": "RG3ZYXJT59ZV5", "Overall": "5.0", "Content": "Got soaked once while boating, had no problem, it surprised others on the boat. Its easy to setup and its fast", "Title": "Awesome!", "Date": "September 10, 2013"}, {"Author": "J.S. MEWS", "ReviewID": "RLJJHTETMSXPI", "Overall": "4.0", "Content": "First let me say that I am a Windows Laptop user and this is my first venture into Android and tablets.  I do not have any Apple products either.  I am not a big video or game user so my comments won't cover that.  My main purposes for buying this tablet were to use when I travel so I could have internet access, read books and load pictures to upload to Facebook.  I wanted something lightweight and well built so I didn't need to take a netbook and kindle all the time.  Since I have no other tablet or similar experience to compare I can only go by what I was looking to accomplish and a comparison with my laptop, netbook and Kindle use.Having said all that I might have given this tablet a 5 star but for a few technical drawbacks.  I used it on a 2 week trip in Scandinavia.  I have listed the Pros and Cons below based on my experience and needs.  Please note that some apps come with Sony and others are free or purchased.  Also I realize there may be some robust apps that could replace the versions available or that I found but the comments are based solely on what I was using or able to acquire before my trip.ProsVery lightweightVery thinSolid constructionNice touchscreen feelGood keyboard and features remember words used and can type quicklyMail app up and running quickly but not robust just basicPicked up wifi easilyKindle app for this works fine but have extra app for rotation stoppage when reading lying downMost features easy to figure out if you are an experienced computer userFile Transfer App works great and easilyDownloading from older camera directly doesn’t work but if you get a travel \"On the Go\" (OTG) connector and use a card reader downloading works fineComes with apps I used immediately like Chrome, Mail, File TransferNice screen clarity and colorsNever had a problem with usage of apps or Android issues.  Windows users will know what I meanConsBattery runs down quickly compared to Kindle.  This is expected but I wouldn't suggest this for primarily a reader then.  I would say with mostly wifi usage it might last 8 to 10 hours.Battery takes overnight to charge.  Seems slow but not a real big issue for me.  This is running it down to about 35%.Flimsy USB coverShiny screen and smears easily.  Carried a screen cloth and worked great after each use.  Prefer matte screen.Few accessories - I did get a carry case and it was nice.  Also tried another that is pretty sad.  See other reviews on those.No user guide and the online one is pretty lacking.Short charger cord difficult to use and charge at same timeAndroid FB app is really bad – not just this tablet of course but really.Album app (Sony) is not very robustThere are other things that may be good or bad but can't comment on them.  Here are ones I would note.Cameras seem fine but not a big user of that so can't compare.Not a big video or game user so can’t comment.Don’t care about the ‘waterproof’ feature. Just may help make the construction better in general.Haven’t used Bluetooth but that may work great as well as the NFC feature for future useAs I mentioned I am a sophisticated Windows user but not Android so this overview is from that perspective.  I had a hard time at first getting use to touchscreen but really enjoyed it for the uses I wanted with this tablet.", "Title": "This is a Very Nice Tablet", "Date": "July 23, 2013"}, {"Author": "Carrie", "ReviewID": "REK4Z0QIR4DRL", "Overall": "4.0", "Content": "If you are reading this review, you have already decided that a 10\" screen is something you either want or will consider.  I prefer a 10\" screen because my eyesight isn't the greatest.  I do not find that a 10\" tablet is too cumbersome to carry.  This Sony featherweight tablet makes it even less so.The Sony Xperia Z is an Android based tablet.  Its stand-out features are (1) it is featherweight, (2) it is waterproof, and (3) it can function as your remote control.  The Xperia Z's competition is the Nexus 10.  Other 10\" tablets are the iPad 4 and Surface RT (iPad 5 is not out yet & the Surface Pro is more laptop than tablet, IMO).The Sony Xperia Z has a rich, vibrant screen.  It has a wide 1\" bezel and the actual screen size is 10\".  It has a rubberized, soft touch back, a rear & front facing camera, 2 speakers, a SD card slot & the ability to insert a micro USB (but the slot also used for charging).  The screen is nicely touch sensitive & Sony gives you the ability to customize your five start screens.  Tablet status information is in the bottom right corner, so you always know how much battery life, wifi status, and time.  On the bottom left corner is page back, hom, and list view.  Bottom middle are quick view of selected apps and the remote control app.The Xperia is not without its annoyances:1. While it is wonderful that the tablet is waterproof, the openings are a little difficult to open & I have a tendency to want to pull at the speaker rather than the slot hinge.2.  The USB slot is a micro USB slot & is also used for charging.3. As a non-Android user, I would prefer to have all of my preferences on my 1st start screen rather than scrolling through 5 start screens.4. So far, no great covers for the tablet & no covers that also have keypads.5. The screen doesn't change from portrait to landscape with you.6. It is more of an entertainment device than a business use device.  The office suites app is mediocre.7. The back is rubberized plastic, not metal, so I wonder about the durability.Overall, even though I am not a current Android user & had to teach myself how to navigate the Sony Xperia Z, I really like it.  It has a nice, vibrant screen, decent sound, decent front/back cameras (not good enough to swap out my real camera), easily connects to wifi & is super light.  While it can't be used for my business needs (the Surface RT can), and doesn't have a keyboard cover (would love this feature), it is a great tablet to carry around and use for on-the-go & for traveling.", "Title": "A Very Nice Entertainment Focused, Android Based Tablet", "Date": "July 21, 2013"}, {"Author": "Ammy_Evaluator", "ReviewID": "R12X2T1C071M5I", "Overall": "4.0", "Content": "This is an awesome tablet - with a super quick quad core 1.5GHz processor, gorgeous HD display (1920x1200), responsive touchscreen, microSD support, Wifi 5GHz, Bluetooth, capped off with a decent battery life (about 7-8 hours.)Usability is also excellent - especially when coupled with the excellent Android JellyBean 4.1.With that out of the way, let me focus on the loss of that final star.1. The edges on this tablet are mostly plastic. I accidentally dropped the table on to my table top, it caught the worst angle, and cracked the plastic speaker grille cover.2. The waterproofing design makes its charging port and MicroSD slot a nightmare to access - especially if you have short fingernails. Try it for yourself to see if this might be a long term annoyance.3. Its highly reflective bezel makes every speck of dust clearly visible. This is very distracting to my peripheral vision, especially in such proximity to the supremely gorgeous display.Overall, Sony has a winner with this high performing and attractive Android tablet. Its strengths cancel out any of its minor design annoyances, and so far I'm a very happy camper - resulting in a 4-star \"I like it!\" rating.If you are looking for a case - I'd recommend the budget MoKo Slim Cover Case. This is a functional and usable case, but adheres to the You Get What You Pay For rule when it comes to overall finish. A more expensive alternative is the Sony IT Tablet Cover (SGPCV5/B).Good luck!", "Title": "A winner from Sony", "Date": "June 26, 2013"}, {"Author": "Sheryl Katz", "ReviewID": "R2WU2QPVFZ1V50", "Overall": "4.0", "Content": "This is a beautiful tablet.  The processor is nice and fast.  The operating system is stable.  I haven't tried the remote functionality, but it has a spot on the bezel that if you touch it, it brings up a remote to use with the TV.The screen is beautiful, on a par with the newer ipad screens.  The thin and light form factor is great, and the tablet is easy to hold in your hand. It's not too heavy to use for reading a book.One small nit is that the waterproofing requires the charger connector to be covered.  The cover is hard to open and attaches via a small connecting piece. This will surely break before too long.So why don't I give this five stars?  Well it is pricey.  I got a B&N; Nook 9 inches for less than $200.  It's a really nice tablet.  This Sony is definitely better.  It has features, like a camera and a faster processor that make it work more than the Nook.  But not $300 better.  This Sony tablet is the best Android tablet I've tried to date.  You definitely pay for the difference.  Is it worth it?  Depends on what you are willing to spend and what matters to you.", "Title": "Beautiful to look at", "Date": "July 9, 2013"}, {"Author": "Harrison", "ReviewID": "RHPM7YPXNAGG3", "Overall": "4.0", "Content": "I bought this because of the expandable storage and the water resistance. I don't like all the Sony bloat wear or their skinned android OS so I installed a stock ROM.Pros-SD card storageWater resistanceGood quality camera for a tabletFM receiverCons-Not as high res of a screen as the Note 10.1Not stock android", "Title": "Great tablet for the features", "Date": "December 29, 2013"}, {"Author": "Johnny", "ReviewID": "R2PCH7F5FZRFGA", "Overall": "4.0", "Content": "I'm an ipad user and using an ipad even while writing this review, but have to say this is by far the best android tablet i've used. To be honest, nothing beats an ipad in terms of a tablet, but this is pretty damn close.The major drawback is that the android os is just not as developed for tablets as ios is. Also, I dislike android in general for its lack of fine tuning, it's just not as polished as an ios device. With that said, this tablet looks amazing, which is expected from a sony product. The build quality is great and the screen is amazing for watching movies. Also, being that it is waterproof, it's great to use while enjoying a long hot bath. I use this tablet for my movies and entertainment and I use my ipad mini retina for all of my daily activities and travel.If you can afford both, this is a great entertainment device. 4 stars for sony, 1 star off because android os is just not as developed as ios is for tablets.", "Title": "Ipad user but impressed", "Date": "December 3, 2013"}, {"Author": "Skorch", "ReviewID": "R3UEBE4LWREDLZ", "Overall": "5.0", "Content": "big sony fan for electronics tvs, laptops, phones, tablets, ps4 etc. this tablet is beautiful with beautiful colors. what i like about this unit is how good the colors are again. i dont like the colors on other units like samsungs whether its tv or tablet cause there colors are way too sharp which looks unreal. this is easy on the eyes. buy it you wont regret it. my wife loves it.", "Title": "fantastic buy!", "Date": "November 26, 2013"}, {"Author": "Mary Jo DiBella", "ReviewID": "R3AVBR105HCXCE", "Overall": "4.0", "Content": "This is a lovely tablet!!!  It's lightweight, it has excellent battery life, and the screen is to die for!  Plus there is a memory card slot, so basically it has unlimited storage.  Really it's the nicest tablet I have seen, from a pure hardware perspective.My single issue has to do with the operating system, and yes I know it's not really fair to deduct a star based on the operating system, but from the perspective of the end user, the tablet and its operating system are one and the same.So, as a longtime iPad user (and owner of a Kindle Fire), I will try to post an 'end user' review.Firstly the issue of storage is a big one that has always annoyed me about the iPad.  As I discovered myself just last week, while sitting 3 hours on the tarmac in a plane waiting for takeoff clearance for a 4 hour flight, it is important for a tablet to carry plenty of movies and videos.  Apple's absolute refusal to add a memory card slot to iPad limits the amount of video it can carry.I thought the problem would be solved with this new Sony tablet, and indeed the storage is pretty much unlimited.  However the ability to find and download movies and videos is a problem.  My usual sources are Amazon's own video service (which has an iPad app for downloading), and iTunes.  You can forget both of those for this Android tablet.  Apple's DRM protection makes downloading to Android a non-starter, and Amazon has so far not produced an Android app that will allow its video service to download to anything but a Kindle Fire.  Netflix and Hulu work wonderfully on the tablet, but at 35,000 feet streaming video isn't happening.  It does come with Google Play, and I believe you can download from that, but I have a large collection of videos in various clouds that will work in the iPad and not on Android.  If you want to carry your own copy of a movie, you will have to buy the DVD and rip it yourself, or buy a DVD that has a digital copy included.  Both work fine on Android and look great on this tablet.It's sad that a clear winner in the tablet market (like this Sony) is marred by the draconian policies of other retail/media giants, but there it is.That being said, if you use and like Android, this is the tablet for you.  And it's water-resistant.  In theory you could drop it in the pool and it would survive.  I didn't try that.Android fans, come and get it!", "Title": "Fabulous tablet!", "Date": "July 4, 2013"}, {"Author": "Cleve Miller", "ReviewID": "R2GWZQMZTXMAST", "Overall": "2.0", "Content": "Sorry I left this comment under the first section (cover).  I would give  fhe cover a 5 star, it is great.", "Title": "Reverse this with the first item.", "Date": "February 12, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2Y29MYM8HM1NY", "Overall": "1.0", "Content": "I received the product today 12-09-13 at 13:00, sending the product back today 12-09-13 at 22:00.  The tablet would not connect with my WIFI, albeit all my other devices do.  Worked with Sony for 3 hours, with them employee the typical cookbook method of support.  If it isn't in the cookbook, they don't have the brain power to resolve.  The last straw for me was being given notice the I would have to repair the software (after loading droid 4.2.2 JB, via PC tethering).  Of course the software repair process reloads the same 4.2.2 JB.  The real kicker was the instructions received in e-mail telling me that is a failure occurred to proceed to step 12 of which none existed in the document.  The product is flimsy, the micro USB port is proprietary, the unit is slow to respond, it wouldn't connect to wifi, Sony support blows.  The only good thing about this experience was purchasing it via Amazon.  Be certain on high ticket items to look for shipped and sold by Amazon,  it really removes anxiety of returning junk.  I was going to go with Samsung 2014 initially, but the oversell of this junk caught my eye.  Samsung, your prodigal son is returning.", "Title": "PURE JUNK", "Date": "December 9, 2013"}, {"Author": "R. D. Voyles \"Southwind\"", "ReviewID": "R2OMKJKOJI6EAX", "Overall": "1.0", "Content": "I have owned Sony, Asus, Google and Lenovo tablets, all had great support except for Sony. Their support was non-existant!Specs may be great but don't expect Sony to back it with legitimate support!", "Title": "Do Not Buy A Sony Tablet!", "Date": "February 6, 2014"}, {"Author": "Louise Petroka", "ReviewID": "R22WXYXBSHOLIT", "Overall": "1.0", "Content": "I have had my tablet for7 months and the battery won't charge so now I have to send it back . It will be weeks before it comes back! We have had IPads for years with no issues . I am sorry i didn't get an IPad and would not recommend this product to anyone.", "Title": "Horrible", "Date": "March 18, 2014"}, {"Author": "Mario", "ReviewID": "R34SUCI0SL1OSE", "Overall": "3.0", "Content": "I like to be in contact with the news and my emails, unfortunate this tablet dont have an external plug for a SIM card. The transfers of files from Microsoft to this android are no up to date and the sync with my smart phone just can do it thru  Bluetooth, the tablet dont have a connector for memory stick or charger.When I got WiFi is a fast connection and the quality of the screen an A+", "Title": "no to happy with the new android", "Date": "November 17, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3DS77IPS96Y7S", "Overall": "3.0", "Content": "So I have been trying to find a decent HD quality Android tablet. The Nexus 10 is under powered and many apps don't not work or display properly on it due to its extreme resolution. I tried the Xperia because it has a good enough resolution and looked impressive in the store. My issue was the bezel is quite large which makes it seem large to hold (although it is very light).  The other issue I could not get around was all of the covers for port access. I know they are there for the water proofing but they were annoying. For those reasons I returned the tablet. Don't get me wrong the performance was fine but given the cost and issues above I did not enjoy using it.", "Title": "Nice specs, bad form factor", "Date": "August 30, 2013"}, {"Author": "Nazrit Tajrian", "ReviewID": "RHJBF5YIHS9", "Overall": "1.0", "Content": "I got this when it was 4.1 and it had much nicer UI experience, but after the system update to 4.2 now I am stuck with the ugly so uncomfortable looking UI, the top custom short icons by Sony its to busy looking and the whole thing looks like a phone with the back and home button being in the middle it is very difficult to use, I dont think anyone  at Sony even tested this 4.2 before rolling out, I use to like this tablet so much but now I am hating it so much and I am very upset with Sony with their stupid policy of not being able to downgrade it back to 4.1, it was very unique tablet on the android markets before but now not any more. So if you find  4.1 of this tablet its good otherwise I suggest you stay away from 4.2, Sony might come up with better update for it but, who knows how soon that might be! It could take them like 6 month or a year!However, I was able to sale my new 4.2 tablet for very good price and get back 4.1 from Bestbuy and keep it without updating to 4.2. So chances are you find 4.1 of this tablet in stores.Last thing, I do want to mention that the only weakens I find on this tablet is the WiFi connection is not perfect, it might drop connections every once in a while but its not that bad.", "Title": "Do not buy the 4.2 Jelly bean of this tablet", "Date": "September 19, 2013"}, {"Author": "richard zelaya", "ReviewID": "R3J2C4XR4H2TR6", "Overall": "1.0", "Content": "this is the worse electronic i bought, i was using rarely, one day never turn on... please dont buy it... dont let that happed to you... i have to buy an other one, i used only 5 months and I have to put in the garbage. Don't buy it, don't spend the money like me...", "Title": "the electronic I bought", "Date": "March 3, 2014"}, {"Author": "edward musialkiewicz", "ReviewID": "R1CMD0RDCPYFTT", "Overall": "1.0", "Content": "My Sony Xperia tablet lasted 4 hours. In that time the memory card & sim card cover broke off (it is extremely flimsy). Also the Xperia Tablet would not boot after only a few hours of usage. It became stuck on the SONY boot screen and nothing humanly possible could be done to get it to boot complete fully. I replaced it 18 hours later for a Samsung Tablet 10.1 (2014 Edition). The Samsung is a work of art and a blessing in the Tablet world - reliable, easy to set up, and boots every time. Stay away from the Sony Xperia Z. Not worth rating. Edward", "Title": "Biggest technology disapointment in my life", "Date": "February 25, 2014"}, {"Author": "Bento Pereira", "ReviewID": "RR0TTGY48P1NK", "Overall": "1.0", "Content": "Following a lot of extraordinary reviews I decided to give a shot to this tablet.Wrong decision!!!!The interface is old. It comes with Android 4.3, but uses the same interface you find in cheap models, like Coby MID9740-8.But the worst is the screen resolution: you can see the pixel unit!!!! Take a look to Samsung Galaxy S4 and you will see that is impossible to see the pixel. Even the smalest letter are sharp as printed in paper! That's a modern screen. This is outdated!Galaxy Note 10.1 (2014) has 299 dpi (dot per inch) pixel density;Galaxy S4 has 441 dpi.>>>>>> Sony Xperia has 224 dpi <<<<<<<iPad Air has 264 dpi.Nexus 10 - 299 dpiI'm returning it and will give a try to Samsung Note 10.1 with 2560x1600.The dig advantage of a higher dpi is that your eyes will not get tiered so fast!!!!I don't recommend this tablet.", "Title": "Are you kidding?! Old-fashioned good looking table!", "Date": "February 27, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00CE590ZU", "Features": null, "ImgURL": null, "Name": null}}