{"Reviews": [{"Author": "D. Lee \"Fire Horse\"", "ReviewID": "R1RZP2DIWZ8HXZ", "Overall": "4.0", "Content": "When I was doing all of my research on tablets, trying to understand what the options were and what made tablets slightly different from one another, it bugged me how no one would state the obvious in their reviews. So, I'm going to start with some really obvious features of this tablet, in order to help people who may be newer to the \"tablet\" world.YES, you CAN stream Netflix from this tablet, so long as you first go to Netflix, on the normal Internet, and sign up for an account. Then, once you start up your tablet, you can go to the app store and download the Netflix app for FREE. The first time you access Netflix thru the tablet, you'll sign in using your regular Netflix account, and from that point forward, you'll use your Netflix account through the app. You'll have a Netflix \"tile\" on your tablet, and you'll just \"tap\" it, and your personal Netflix account will come up, including your queue, etc. You'll tap the tile for the movie you want to stream, and it'll fire right up and stream.YES, you CAN read books through Kindle on this tablet. You don't need to buy any kind of separate Kindle functionality. Your tablet, in essence, becomes a Kindle. Through the Kindle app, you will be able to log onto your regular Amazon account and download/buy books offered in Kindle format. As with Netflix, you will have a Kindle tile that you can just tap. All of your Kindle library will appear. Just tap the book you want to read, and start reading. The great thing is that you turn the page simply by tapping the screen. You can navigate inside the book, etc. The Kindle function on this tablet it GREAT.YES, there is an electronic keyboard on this tablet. You do NOT need to buy an external keyboard. In fact, the internal keyboard gives you a few different \"configuration\" options.Now, to the general review, and first the good things: This tablet is lightweight and sleek. It has a good camera, and the graphic interface is fabulous. The colorful tiles are rich looking, and movies and old TV shows stream crystal clear. Because the tablet runs on straight Windows 8, a wide array of apps is available. Despite what you may read elsewhere, Windows 8 is embarrassingly EASY to use. I don't understand why people complain about it. You simply touch what you need, and it comes up. It's BETTER than earlier versions of Windows.Back to the tablet, more generally, you can set up your system to have access to more than one e-mail account. I access both my Yahoo and my Gmail accounts. The battery lasts quite a long time. I'm able to charge the tablet at night and use it all day the next day (although it is asleep while I work). I regularly stream Netflix at lunch, and the battery holds out. Also, the \"low battery\" warning comes early. You have plenty of time to find your power supply and plug in the tablet. The news sources are great, and the entire \"news\" tile provides one-stop shopping. And, in general, you can drag the tiles into any configuration on the tablet. There is no \"hard coded\" tile layout that you're stuck with. The tiles are active, which means they \"flip\" or \"roll over\" as they display new information. The free twitter app includes a live tile that will update you with info from your twitter account.The best thing is the fact that the Microsoft programs are on the tablet. I really need easy access to Word for what I do. It's fabulous to be able to switch from fun, games, movies, news, and all the other tiles with the swipe of a finger and pull up Word. The added bonus is that if you're stuck somewhere where there's no Wi-Fi (or you don't have the password to a Wi-Fi network), you can still use your tablet to get \"Word\" stuff done (or Excel, Publisher, etc.). Your tablet can still entertain you (or let you get work done). The Kindle works too without the Internet. You just can't use the dictionary function in the Kindle if the tablet is not connected to the 'Net. But you can read your books.So, why not five stars? Well, a few reasons. (1) When you first unwrap the tablet and plug it in, because it is completely dead, it takes a LONG time to even turn on. You'll keep hitting the \"on\" button, to no avail. I literally thought mine was defective. After 10+ minutes of panic, it finally turned on and booted up. I thought it had maybe been a glitch until (2) I let the battery run down for the first time after owning it for a few days. When I plugged in the tablet on the day I let the battery drain all the way to empty, I had the same (scary) wait for it to actually turn on and boot up. Once it is charged a bit, you have to hold down the button for a specific amount of time to get the tablet to start, and, again, it will NOT turn on until it has been charging for several minutes. Since NO other device on the planet fails to function the SECOND it is plugged in, it is scary when you plug in the dead tablet and get no response for several minutes. Worse is the fact that nothing in the instructions or guide indicated that it would take the tablet several minutes to get charged enough to respond to being plugged in and to actually turn ON. Also, the power cord is SHORT. Buy an extension cord right away. The power cord provided by the manufacturer is a joke, length-wise. (3) Despite how great movies on Netflix look, ironically, the one app that will (too often) freeze your system and force a reboot is Netflix. I can't tell you how many times I hit the back button on Netflix to go back to my list of movies I want to stream, just to have the screen go chromy black. At that point, the entire tablet is frozen. I have to reboot (and with my fears about how long it may take for the button to respond to my reboot attempts), it's annoying that this app malfunctions in this way. Ninety-five percent of the time, Netflix runs fine. But...a five-percent freeze rate is lame. (4) As other reviews may have mentioned, for no reason at all, the tablet loses/drops its connection to the Internet/Wi-Fi. Even if it the connection is strong and it shows \"connected,\" you still are not connected. So, you have to quickly disconnect and reconnect. It takes no more than 22 seconds, but it's a pain. It interferes with apps and videos you're running. (5) The speaker is pretty weak. It mostly doesn't matter, but if you're streaming something weak (like an old TV show or a YouTube video with weak sound), it's a tad annoying. MOSTLY, the speaker is fine, but it could be better.In sum, this tablet is fast, sleek, light, entertaining, multifunctional, and way ahead of the iPad curve with the Microsoft programs. It's begging to be five-star. However, because it takes long to start if the battery has fully drained, freezes during Netflix, drops its Internet connection, has a very average/too-weak speaker, a short power cord, and a useless user's guide, it gets bumped down to four stars. In NO way is it three-star.This is a solid four-star tablet that has been a great joy to own since I bought it, and for the price, you can't beat it. I would buy it again and definitely recommend it. The minor irritations are not that big a deal. Windows 8 is awesome, the tablet is light enough to carry everywhere, and the price is right.11/30/13 Update: I still love this tablet. I'd even upgrade it to 4.5 stars. (1) I no longer leave it asleep at work and literally stream my favorite radio station all day AND watch Netflix at lunch, and the battery doesn't drain, so long as I leave for work with it fully charged. (2) Netflix or Microsoft must have heard a lot of feedback because, overall, Netflix performs a bit better now than it used to. (3) I use the SkyDrive to save things, and it works great. Videos too large for e-mailing can be sent to the SkyDrive and shared from there, including e-mailing them to a person. (4) I've used the camera and video camera bunches of times with great results. Still no five stars because of the continued drops in the Internet connection, etc. (see above). But...if I had to buy a tablet TODAY, I would go right back and buy this one. I'm getting tons of hours of use every, single day for such a reasonable price. I adore this tablet.", "Title": "Solid, four-star tablet. Sleek, flexible, but imperfect.", "Date": "August 31, 2013"}, {"Author": "joshua h henry", "ReviewID": "RMZH4DGGUT3C8", "Overall": "4.0", "Content": "Okay.. I own a galaxy tab two kindles and an iPad so I have had plenty of experience in the tablet field. That I think was my first problem ... you don't treat this as a tablet where you just download apps from the app store. If u do you will be disappointed. Think PC when ur using this. I gave it a four stars and not five mainly because the amount of time it took to update all the apps and the windows updates and while these are updating this tablet acts very odd ... such as things not working like apps or mail or downloading new apps. I was ready to return it...  but after the installs were complete everything was great. The best thing about this tab is that you use a full browser and can install real pc programs. The smart cover is decent and worth the money I paid for it. The best part is using my apple magic mouse and keyboard on the tab.. it works flawlessly. Windows 8 takes some getting used to and don't think that this tab is junk bc u don't like change because windows 8 is very intuitive and can make multitasking much easier than any other ios or android device. If u want to do real work instead of just playing angry birds this tab is a god choice for the price.", "Title": "Decent tablet for the money.", "Date": "July 5, 2013"}, {"Author": "Andrew", "ReviewID": "R2EPCUKWDQVRBG", "Overall": "5.0", "Content": "I knew exactly what I was buying with this tablet, but I knew the harder sell would be my wife. She would just want it to \"work\". That being said, I did spend quite a bit of time customizing it to suit her, but at least I have those options. Anyway, I don't want this to turn into a review of Windows 8, so I'll try to stick to the hardware as much as possible. I'm really happy with this tablet, and I think it has the best combination of features and price compared to any of the others that I've looked at. I've really enjoyed using it and haven't had any issues, despite what I've been reading in other reviews. Here are my observations:I can confirm that this Vivotab Smart gets good \"idle\" times. I think I was gone for the day for about 12 hours while it was just sitting on my dresser and the battery barely lost any charge. Perfect! (considering that there is almost ZERO information available on how well these Windows tablets do on \"idle\" time)This tablet is one of the more feature packed ones available. I was surprised how many of the new windows tablets were lacking GPS. This one has it. It also has NFC. I'm still not sure how/if I'll use it, but it's nice to have the option. I had a hard time deciding between this and the Surface Pro. I ultimately decided upon this one based on features, since the Surface Pro has smaller cameras and no GPS. Also, the Surface is heavier and has a shorter battery life. What I later found out is that the Atom processor in this tablet supports the new low power states that are crucial for tablet-like behavior = long \"idle\" times where it is asleep, but not really asleep (what we all expect tablets to do when we're not using them). The Surface (having a relatively older Core i5 processor) doesn't support those features so (to my understanding) you're left with the old, relatively laptop-like sleep and hibernate states. Not very tablet-like where you just hit the button and it wakes up instantly.The screen is nice. The auto-brighness works well and responds quickly, but does \"jump\" and is not very smooth. Not a big deal, really. The speakers aren't overly loud but do sound nice, also not a big deal to me. The camera can take sharp, clear pictures that are very large, but doesn't respond well to varied lighting. I've seen this pointed out by other reviews. I wonder how much of that is the camera and how much of that is the software. It does take very nice picture if you are careful (or lucky) to take a picture in more even lighting, even if it is dark. The battery life has been good. I've used it for hours at a time watching videos, playing games, and installing apps without running the battery down. It seems to run at least as long as any iPad or iPhone I've ever used, maybe better.The Metro-style apps and interface are fast and responsive. I doubt there will be any problems with performance for tablet-like use. The desktop interface and programs are also fast and responsive. Though, I will admit that I haven't used any large or intense programs. But, it just feels \"fast enough\", so I think it will work out just fine. It handles the metro-app Netflix like a champ and even works well in the multi-task mode. I think MS really has a polished OS even though there are some kinks to work out, still. [Remember, iOS wasn't really all that great for the first year or two it was out - trust me, I owned the original iPhone]. One little \"feature\" that stuck me in particular was the ability to multi-task a metro app and the desktop at the same time. When you give the metro-app the larger portion of the screen, the desktop shrinks the open windows down to little preview windows and stacks them in the available screen space. It's really quite neat! That little feature (along with the other neat tricks) really made me appreciate Win 8 all the more.Microsoft Office came bundled with the tablet. There is a little \"Install\" button that starts the process and it was quick and painless. I think this is much better than the old days where it would come pre-installed but crippled in a trial mode. Also, on that note, there isn't much (if any) bloatware. There is the Asus Camera App and maybe one other, but that's it. Plus, I'll actually keep that particular app because of the added functionality, but I doubt I'll use it much.Word of warning: I saw a video review where someone described how easily the screen scratches. I decided not to chance it so I bought a screen protector right off the bat - I would highly advise anyone else to get one. I read a lot of reviews and got a good one, so it hasn't affected screen quality or touch responsiveness.If you're going to use a case, I bought a cheap one on here for about $15 by Moko and have been really pleased. It has a plastic back (covered with a faux leather) and a folding faux leather front cover. It's light, thin, and the folding cover acts as a stand. The cover also has the auto sleep/wake feature, which just makes the whole tablet seem sleeker, somehow. I also bought the official Asus TranSleeve Cover and Keyboard, but that has been a huge and expensive disappointment. I will probably keep it, though, because the keyboard is actually kind of nice. The cover, however, is a travesty. Get the cheap Moko one if you just want a cover/case.MoKo Ultra Slim Lightweight Smart-shell Stand Case for ASUS VivoTab Smart ME400 ME400C 10.1 inch Windows 8 tablet, BLACK (with Auto Wake/Sleep Function)", "Title": "Very Happy (and my wife is, too)", "Date": "August 28, 2013"}, {"Author": "B Bob", "ReviewID": "R138LY7SF3L1XG", "Overall": "4.0", "Content": "I got one of these about a month or so ago. I think it's a (not perfect) but a great pick at the $400 price range.Overall I really like the tablet and the Windows 8 experience on a tablet.But I'll list a few things I didn't like, had a little trouble at first setting up the store and had to create a new microsoft account even though I already had one. But after the initial frustration not much problem there, although like someone else mentioned sometimes store updates/downloads are slow.The volume is a little low.The power button feels flimsy.Battery efficiency is definitely not as good as I expected. Turning wi-fi on and off when not in use helps. Have had no connectivity problems with wifi at all though.Is a little bit slow to charge compared to my LG phone.What I like ... I really like Windows 8 on the tablet, there were a few things I had trouble finding after being used to Win 7, but by going to the search box and looking it up I almost always found what I needed. I think the gestures are very intuitive. And the tablet was crucial for me for doing things like photo editing, html editing and FTP. I've tried doing those things on an android tablet previously and it is so so so much easier on a Win 8 tablet in desktop mode as you get true multitasking and quick switching from one program to another. The build quality seems pretty good, not the best but above average. Speed of the processor has not been an issue for me at all, I don't try doing intensive work on the tablet, usually just web resolution image editing and coding. Works great. The few games I've played have all worked great.", "Title": "Solid tablet", "Date": "July 2, 2013"}, {"Author": "Kevin Nigg", "ReviewID": "RLE7CYYDSDKGB", "Overall": "4.0", "Content": "Great value.  This is a solid and stylish tabet for the budget-minded Windows crowd.  I am not sure how fair it is to rate the Vivotab based on Windows8 as most of the difficulties cannot be overcome by hardware.  I must confess I have never touched an I-device, and never will.  I work in corporate IT support, so it's a Windows world for me.  I had to go ahead and get something with Win8 so I could stay ahead of support questions.  I cant imagine using only a tablet for 100% of computing needs, so my 4-start rating is based on the fact that I still use my desktop pc for real work, and my android phone for most on-the-go.  I got this so I could learn Win8 and take it on work travel.  It is replacing an Acer Iconia A100 android ics tablet.This came with some Asus bloatware, all but one was easily removed.  I ended up stopping an Asus backup software by removing it from startup in the registry.It was in need of a ton of updates.  Don't get too excited when your box arrives as you'll be leaving it on the charger running updates for about 4 hours.  Asus updater had 2 system updates as well - which scared me once as the reboot brought up a recovery screen.  Waiting 10 minutes and a reboot resolved and it showed the updates installed (bios and software).The Vivotab is very fast and smooth.  There is a delay when rotating the screen, nowhere near as fluid as my previous android devices.  Opening and changing apps is lightning fast.  The touch is super-responsive and awesome.  You would never complain about having only 2gb of ram.  My \"real\" PC's are 8gb ram and solid state drives, the Vivotab feels just as quick.The Office H&S; 13 license was in the package and download from MS was fast and it works well.  I did add MS Outlook 07 as I wanted to try a client in addition to outlook.com.  Office07 is obviously not touch-friendly, but it works.The front webcam is not wide-angle enough.  I have to be 4 or 5 feet away to appear \"normal-sized\" in webcam chat.  The camera seems to be pointed slightly to the side as well, so I have to angle it a little to the left. It is not because it is a little off-center, it seems the camera is crooked in there.  I'm not too concerned about it - I'll just adapt to it.  The rear camera is excellent, the best I've ever used.The first full charge took a long time, but I am enjoying about 9 hours of runtime.I like that it charges with micro-usb cable.  I got very tired of having to bring along proprietary chargers with previous devices.I was intrigued by the transleeve keyboard and cover, but opted for the standard book-style to start out (MoKi Slim Cover - fits and works well).As for Windows8, I was able to find enough apps in the store to satisfy me, but I will miss real google maps and some other g-stuff since I was using everything they had to offer on android (calendar/drive/keep/mail, etc..).If you want an affordable tablet running Win8 - this is a clear winner.", "Title": "Excellent as a \"supplemental\" device", "Date": "July 13, 2013"}, {"Author": "Brian Keldsen", "ReviewID": "R2H8ZRF3RVMMZ1", "Overall": "1.0", "Content": "I purchased an Asus Vivotab Smart in April of this year and have had nothing but problems with it since I have had it.First, the sound started to cut out randomly requiring a restart in order to restore the sound.  When I called into customer service they had me do a \"Hard Reboot\" which resets the unit back to the factory defaults.  This was annoying to say the least as all the apps I had installed were erased.  What is worse is that the hard reboot did not fix the problem, the sound continued to cut out randomly requiring a restart to restore the system sound.This was the just the beginning of problems.  At this point (less than 2 and 1/2 months from the purchase date) the touch screen has begun to malfunction.  The unit behaves as if the touchscreen is being touched even when it just sits there being undisturbed by anyone.  This makes it very hard to navigate as the unit continues to behave that way as I try to use it. Apps will randomly launch, websites will randomly be navigated to (and away from) letters will randomly by typed, etc...Finally, the touchscreen keyboard has begun to malfunction.  There are time the 'a' key and the 'w' key just won't work.  They won't work in any app.  If you happen to have any of the failing characters in your password, you are up a creek.I have spend hours on the phone with Asus' lackluster customer service.  They had me send in the unit for repair - which they will ask you to do at your own expense unless you complain hard enough.  I followed the repair process through to the end and when I got the unit back I opened up anticipating that it was repaired.It wasn't.Nothing was fixed.Nothing at all.The same problem that led me to send it for repair were noticeable from the very first time I fired it up after getting it back from their \"repair\" facility.I should have known that this was likely as the Better Business Bureau has given Asus a failing rating (an F on a scale of A+ to F) and has a consumer alert against this company.  Apparently I am not the only one who sends Asus products off for repair only to receive them back just as broken.  According to the BBB:\"We have identified a pattern of complaints concerning service issues. Complaints processed by BBB claim that 1) products sent to the company for repairs are still not working properly when returned to the consumer.\"After all that expense, I anticipate having a very expensive paperweight.BEWARE!!!You might be one of the lucky consumers who have no problem with the product, but if you do have a problem, don't count on Asus standing behind their product or honoring their warranty.To this day Asus refuses to send me a suitable replacement or refund my investment.", "Title": "Buyer Beware", "Date": "July 10, 2013"}, {"Author": "Redhawk44", "ReviewID": "R2WLF1TMNPI8S4", "Overall": "5.0", "Content": "I've only had this tablet for a couple days, so far I'm very pleased. the initial setup was smooth, although the windows updates took 40 minutes. This is my first experience with Windows 8, so that's a challenge. Most everything works great. Chrome was a disappointment. I use it on my home PC and it's great, but on this tablet it was very sluggish, frequently freezing for 30+ seconds. Internet Explorer works great though, so I use it. I tried some of the supplied apps and games, no problems with any of them. Videos on CNN and Youtube were smooth and loaded fast.The screen is nice and clear. Photos and graphics are sharp. Overall I'm very happy with my purchase. It's a great improvement from my 2 year old Acer/Android tablet.Recommended!", "Title": "Nice upgrade from my old Android tablet", "Date": "June 26, 2013"}, {"Author": "Radashack", "ReviewID": "R3VZI0QDVOXYS6", "Overall": "2.0", "Content": "When I first got this unit on July 23rd, I thought it was going to be a great little full speed Windows 8 unit, and in fact my original review was marvelous. Had some minor issue getting Windows Update to actually work, but after downloading and installing the ASUS updates and a few misplaced reboots, it loaded all of the updates (a considerable amount) without incident. I loaded many programs including all those from my Windows 8 account with my old device, and it seemed it was going to work. I wrote an update on July 26th stating as such, but the last few days before finally throwing in the towel and requesting a refund, it just seemed to go downhill in a hand-basket! Many of the problems I had read about in other reviews that I thought I had escaped reared their ugly little heads.Freezing and unresponsive. Failure to respond to touch for minutes at a time. Unexplained lapses of not connectivity to WiFi. Numerous reboots. Sound dropping out. Screen flickering on Auto and Manual settings. And the list goes on. ASUS Tech Support was decidedly useless except for recommending resets.I really had high hopes for this thing. Perhaps I will wait a little while before making a review. I was going to leave the original review as it was but it would not have been fair to others. I do believe that most of the problems are software or BIOS related, but ASUS needs to get off the fence with this thing and get it fixed.", "Title": "It Forced Me To Change My Review - What A Shame!", "Date": "July 23, 2013"}, {"Author": "Benrl", "ReviewID": "R3NSEYAGPI83SS", "Overall": "4.0", "Content": "This is a wonderful device and will serve you and your emotional health well if you remember the mantra \"a tablet is not a PC.\"  I wanted a lightweight unit to replace my Lenovo Notebook on business trips and vacation when I didn't feel like carrying 5 pounds of technology. I also wanted it to have an operating system that would run the applications I use on a daily basis on my PC and an interface I could quickly adapt to.  It needed to be fairly brisk in operation and have a history of reviews on Amazon that I could live with.  And. of course, it needed to be priced right.  It turns out the Vivotab Smart satisfies all of those criteria well.  Is there a learning curve needed to wring out all its capabilities, yes. Is it as speedy as my i7 processor?  Of course not.  But does it come a heck of lot closer to fulfilling my portable computing needs than my wife's Ipad, absolutely.  Asus has done an excellent job at a really reasonable price.", "Title": "Does exactly what I wanted", "Date": "August 9, 2013"}, {"Author": "jtech", "ReviewID": "R244OJK8SLG2WF", "Overall": "2.0", "Content": "I was really looking forward to this Asus ME400C-C2 Windows 8 tablet.  It arrived quickly and was nicely packaged. It is a very attractive tablet, slightly bigger than an iPad but lighter in weight than the iPad. Unfortunately it turned out to be disappointing on a number of levels:-the touch screen did not always respond whether using one's finger or a stylus, or the response was delayed-when it was doing updates you frequently had no idea if it was working or not, downloading or not.  Unlike Windows updates that showed progress, other initial updates loaded (or didn't) with no visual indication of progress.  Based on reviews I had read of the ME400C-C1 I was cautious to try and not interfere with an ongoing download, but with no indication as to whether it was successfully downloading or not, that is hard to comply with.  This is particularly frustrating when you are doing the initial machine updates fresh out of the box.-downloads were painfully slow in spite of a very fast connection-the set up font is very small and you can not adjust its size until after fully setting up the machine.  This presented a problem when for example Microsoft put up a 'person verifier' set of letters that you then had to enter to proceed.  The letters were frequently very difficult to decipher and often took multiple tries.-the volume of the speaker (only comes from the left side) is too low to be of any value-the WiFi, while easy to set up, frequently dropped without any apparent reason even though it showed full bars and was a very strong signal-Asus system updater indicated there was a new version and once downloaded it would not run (even after 3 attempts)Bottom line is that I was hoping this would be a viable replacement for my traveling laptop but feel it is not stable enough or reliable enough to serve that role.  FWIW I have a fairly high level of computer savvy, built systems from scratch, and experience across multiple operating systems, different manufacturer's computers, laptops and tablets.  I think this tablet was put on the market prematurely.", "Title": "Disappointing Windows 8 Tablet", "Date": "June 22, 2013"}, {"Author": "J M", "ReviewID": "R2OAOGIYMOM8UV", "Overall": "1.0", "Content": "Amazon did a great job in shipping this out to me, ordered on a friday and received on monday.  thats where the happiness ends... I was super excited to receive this today, something lightweight so I didnt have to carry my laptop around.  the build is great and it feels great in your hands, the only problem is the super reflective mirror, I mean screen, and the fact that I get a \"driver power state failure\" every single time I try to reboot, wake up from sleep mode, or run windows updates....I'm a sysadmin so I can handle problems like that, I was simply going to reinstall windows and be done with it, eventhough it obviously shouldnt have those problems right out of the box...here's the kicker though, I had the power adapter plugged in and laying on my bed. I went to dinner for 2 hours so I can let the device fully charge.  I come back and smell something burning but couldnt figure out what it was. I go to unplug the adapter and scold my hand, it was so hot I couldnt even touch it, I pick up the plug and the entire power adapter literally melted to my bed sheet.  If I could post a pic of this I would, needless to say this will be returned and never used again, I wouldnt wish this device on my worst enemy... \"Great job ASUS!!\"", "Title": "errors every time I restart it or run windows updates", "Date": "August 5, 2013"}, {"Author": "bolo591", "ReviewID": "R2KGBRE5GTP7WQ", "Overall": "3.0", "Content": "I was looking for a cheap tablet offering more versatility than an Ipad or android tablet and bought this one due to its \"low\" price.The versatility comes from  Windows 8 (not RT) allowing to use the VIVO Smart either as a tablet or as a small computer (with limited power) and using some of your old windows programs. Of course, you will have to understand that Windows 8 is a double-edge sword since it is poorly designed as tablet operating system (e.g. the on-screen keyboard does not always pop-up, a little bit frustrating when using IE which first switches you in desktop mode and then does not pop the keyboard and rescale the windows to account for the keyboard...).I am not giving it three stars because of windows 8 (as said I selected this tablet because of the versatility that Windows 8 offers knowing some of its drawbacks).  The three stars goes to Asus conception:- The tablet comes without any product key for Windows 8 (Or at least mine) - In the likely event that windows 8 ends up corrupted, how do I reinstall the OS without product key???!!!- The lack of documentation on Asus accessories for this tablet- The available accessories (A bluetooth keyboard and protective sleeve) are not well designed... It made great sense to me to have done the keyboard a docking station allowing charging the tablet and more USB port.I have also experienced few bugs or problems:- No wireless signal after one update forcing to shutdown and restart the tablet (pretty scary since the tablet came without the windows product key...)- Poor response of the screen- Possible crash of windows app update process likely due to the slow processing power (Try to do 19 app update and add to do it sequentially to see real progress...).- Microsoft office 2010 was installed but the given product key was for the 2013 version.This tablet will do fine for me... But if you are looking for a hassle free tablet, you should probably select another one.", "Title": "OK Tablet", "Date": "July 8, 2013"}, {"Author": "Donald Carlin", "ReviewID": "RGKBBNFIJN46C", "Overall": "4.0", "Content": "I was looking to replace my ailing netbook, three years old and been through hell and back, and was giving the tablet factor serious consideration. I already have a Nexus 7, but I also wanted a light, easy to carry large tablet, preferably Windows. I personally had no interest in Windows RT, in spite looking identical to Windows 8, it wasn't really Windows. Looking at the specs of the ASUS Vivotab, I thought I would try this out. I already had very positive experiences with Asus with my netbook, and the Nexus 7.After a couple weeks of playing with it, I like it. It is Windows, and I can install some of my apps I use on my desktop and laptop and they run. I can use Office, my choice of browsers, it is truly Windows 8. The Office 2013 was easy to download and install with the included product key card. I also bought the Asus KeyThe Good:It's Windows, so it will be seamless with your desktop/laptop if you are a Windows user. Additionally, I can with adapter access external hard drives and even CD/DVD drives.Decent battery life, probably close to the advertised 9.5 hours with a light utilization (browsing, email), longer on airplane mode since power isn't being used for wi-fi. Keep in mind it's Intel Atom so heavy duty activities will or even impossible on tablers64GB is is a good start for capacity.Runs smoothly, certainly for basic usage, and even light gaming, works pretty good, SD video smooth, no noticeable jitter, haven't tried HD as the screen resolution doesn't support it.The touchscreen works pretty well.MicroSD is a godsend!Has front and rear cameras.The Bad:64GB isn't really enough, about 33GB is already taken by OS and other system files - and that doesn't include the Office 2013 install. Highly recommend getting a MicroSD card, indeed I immediately bought a 64GB card.I would prefer a display at HD resolutions, even 1280 x 720, preferably full HD. Perhaps the next incarnation. As it is, the tablet is a bit too rectangular though that does make it easier to hold with one hand.It doesn't have 3g/4g. not personally a concern for me, but others might want that option. Being where I am, I often need a USB 3G modem to get on the net, and with the adapter, you can get 3G access if you really need to.The screen seems very susceptible to finger prints, surprising to me considering my Asus Nexus 7 isn't. The Asus keyboard cover is very handy as I don't need to touch the screen.Overall, I give it 4 stars. I have no regrets getting this, and using it a lot already. If Asus were to release a 128GB version, I'd probably get that - and still get the 64GB MicroSD card.", "Title": "A solid REAL Windows Tablet", "Date": "August 18, 2013"}, {"Author": "Chris C. Griffin", "ReviewID": "R35LLLUAVXNSP3", "Overall": "5.0", "Content": "I recently went from a full blown laptop to this tablet with the Full Windows 8 on it and I am simply amazed at how wonderful and easy it is to use this.  Its light and the screen has a beautiful resolution.  The fact I can use this like a laptop with out the weight of carrying a laptop is wonderful.", "Title": "Beatuiful Design and Comfortable", "Date": "August 9, 2013"}, {"Author": "Ronald W. Andersen", "ReviewID": "R3TDERFZ02LY1S", "Overall": "3.0", "Content": "I've been a computer user for over 25 years, but don't have a smart phone. I bought this tablet to use Word, Excel and other downloaded software. The user manual has minimum information. I had to use internet tutorials to do much navigating. The tablet was bundled with Office 2013 Home and Student. I could not unlock Office. The product key was accepted and downloaded the setup file, but would immediately give me an error message when trying to setup the software. Three calls to MS support convinced me that the software had been licensed to ASUS (OEM & OPK). MS support could not find my product key in their data base. The first call to ASUS told me that my tablet was loaded with Office 10. I tried activating Office 10 with the given product key and it wouldn't work, of course. MS support verified that the product key was certainly not for Office 10. After three days of trying obvious trouble shooting strategies, a second call was made to ASUS. After rehearsing what I had tried and learned, it was concluded that I needed to send the tablet to ASUS. I shipped it two days ago ($10 plus) and am waiting to find out what will happen next.BTW, I tried to find out online if others had experienced what I was going through. No one seemed to have the exact problem, so my experience may not be common. I have built my own PCs for about two decades and have used ASUS motherboards and other ASUS products without any problems.", "Title": "Problems out of the box", "Date": "August 8, 2013"}, {"Author": "Archimedes \"The Cogitator\"", "ReviewID": "R2QC3XGK0I4GFE", "Overall": "5.0", "Content": "If you don't have your expectations too high, this thing is great. You are not going to do much gaming on it, but it can do real work (and some casual games too)! Connect to networks and printers with ease (it's a real windows OS). Edit and publish in real windows applications. Take notes with OneNote!  Add the Adonit Jot Pro stylus for even better functionality. MUCH! speedier than any atom machine I have used in the past, but still not i5 speed.The screen size will limit your ability some, but that is the case with any tablet. Also, Windows 8 could use more Metro style access to standard windows functions (i.e. control panel etc.). Moving back and forth between the old desktop and the Metro interface can get frustrating on a tablet (those file icons and close buttons are damn small--need that pen, or a portable mouse).Any bluetooth keyboard should connect (I used the one I had for my iPad) for typing. Oh, I just gave my iPad to my kids.Overall, best tablet purchase I've made (I have bought 4 now).", "Title": "Nice portable Windows 8 Tablet!", "Date": "August 4, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R36ULQTTTCPG31", "Overall": "5.0", "Content": "I absolutely LOVE this PC!!  You can't really refer to it as a tablet because it is identical to my Laptop in everyway!!  It is small, lightweight and using a Bluetooth keyboard and a Bluetooth mouse, I can now work on this with the same speed and ease that I do my Laptop and desktops!It comes with an Intel processor which is so fast that I have yet to be able to distinguish a difference!  There is plenty of storage and I have loaded many of my traditional windows programs with ease.I develop software and databases for a living and have now moved to leaving my work Laptop at work and just traveling with this, using the VPN from Cisco that our company uses and then windows built in remote desktop to reach any of the servers or my work laptop as needed.I can also remote into my home pc's.  I have spent full days developing from this quiet, convenient and lightweight computer and just love it!!  Whether touch or using the Bluetooth mouse it works as described.", "Title": "Completely Satisfied!!", "Date": "July 27, 2013"}, {"Author": "James C. Todd \"tech geek\"", "ReviewID": "R38SGSS50XBQ4C", "Overall": "3.0", "Content": "If you're going to get Windows 8, you must have a mouse for certain functions. I bought the ASUS keyboard and touchpad w/ cover to go with this, so I\"d have what I need. What I didn't realize is that the keyboard didn't attach to the tablet nor did the cover hold it effectively in place. Therefore the tasks in Windows that still require keyboard and mouse are very clumsy when you're not positioned at a desk or table.Basically I still think ASUS makes good hardware, it's just that Windows 8 is not designed to function without an easy to use mouse/touchpad and keyboard.", "Title": "ok, but not the tablet for me or Windows 8", "Date": "August 15, 2013"}, {"Author": "Eric Carson", "ReviewID": "RSHTVE2ZWAYLU", "Overall": "5.0", "Content": "This is the Windows 8 tablet I've been waiting for. The price point is perfect, and the size/weight ratio is ideal. Feels great in the hand, and with the Transleeve cover (sans the buggy keyboard - don't waste your money there), you have a perfect package to use anywhere. Having come from a Samsung Ativ 500T tablet, I knew what I was getting with the Atom processor, and I was very much ok with that (the only desktop apps I use on the tablet are VLC and Office anyway). Battery life is good at around 9 hours of use. The WiFi N seems to be single band only, so the connection is not as fast as my devices with dual-band N, but it isn't needed on this tablet for me. I love the fact that it charges via microUSB, so I can travel with just one 2A charger for both my phone and my tablet (the Samsung tablet required a bulky proprietary charger).With 64GB built-in storage and available microSD(XC) slot, I've got 128GB available to me for all my media in a very portable package. Thank you Asus for bringing the perfect Windows 8 experience to home!", "Title": "The perfect size/weight Windows 8 tablet", "Date": "July 29, 2013"}, {"Author": "Veiran", "ReviewID": "R34QEV7KG9A1CJ", "Overall": "5.0", "Content": "Easily the best tablet experience I've had yet.I've had three Android tablets previously. While fun at first, I started to feel deprived and I didn't know why. After about a month they got old; I felt handicapped trying to use Chrome to get on the internet. In general, each of them just didn't feel like a full experience like with a PC or laptop.Then I decided I'd plunk down for the Vivotab Smart. I had played with Windows 8 before and really liked it in tablet form, especially the Modern UI Internet Explorer 10. The controls at the bottom of the tablet along with the split keyboard were great; I also loved being able to view full websites by default.Anyway, the Vivotab Smart ended up being what the other tablets weren't! I don't care about iPads or Surfaces: this is the tablet for me! Lack of apps doesn't bother me and having a proper file manager is a big plus to me.This tablet's battery life is great and the storage space is roomy. The screen was sufficient though no Retina and the speaker wasn't particularly impressive, though.", "Title": "Best of the tablets from earlier this year!", "Date": "July 24, 2013"}, {"Author": "Michael V. Baxter \"\"Neutrality is a Myth!...", "ReviewID": "R1KBP7ZHQWIIJS", "Overall": "5.0", "Content": "If you need a tablet that is fully capable of running any Windows program, THIS is the tablet you need.  Good quality and runs flawlessly.  Plus, Asus didn't load this tablet with tons of secondary software that impedes the overall system speed.  Highly recommended.", "Title": "Light, Fast, and Fully Capable!!!", "Date": "July 16, 2013"}, {"Author": "Waffie1618", "ReviewID": "R33AU11UVMKYD7", "Overall": "5.0", "Content": "this device is simply outstanding. I switched from a Lenovo laptop and wanted something light I could use at school without adding to the weight of my already bulging bag. THIS IS IT. I don't even have to carry note books anymore bc this comes with an app for note taking. and it works with the same efficiency as my old laptop. I use the Microsoft office all the time, especially word and powerpoint and its simply beautiful. one disadvantage is that this comes with a micro usb and I use the 2.0 so I had to get an adapter so its an extra cord to carry around but otherwise this is what ive been looking for. I would suggest getting the keyboard for extended typing as that also works incredibly. im an English student so im required to do a lot of research and typing and this has made my life so much easier. also i love the fact that when im off school I can simply enjoy this. my little sister keeps trying to get it just bc of how amazing it is. I give it 5 starts bc this is truly a laptop in tablet form. I would highly recommend this to everyone", "Title": "A MASTERPIECE", "Date": "October 14, 2013"}, {"Author": "lawrence sampson", "ReviewID": "R2YTG0RPQVLA00", "Overall": "4.0", "Content": "I've been waiting for a full windows 8 tablet at a reasonable price and have found it here. The ASUS Vivotab Smart Black Office 2013 H&S; ME400C-C2-BK 10.1-Inch 64GB works perfectly for me, as I love windows 8. It does lag at times compared to my laptop but I have learned to be patient. If your looking for a windows 8 tablet this may be perfect for you; by the way it comes with office 2013.", "Title": "Nice tablet", "Date": "July 4, 2013"}, {"Author": "S. Carter \"isuzucrewcab\"", "ReviewID": "R1WF7BNNWL747B", "Overall": "4.0", "Content": "Bought this tablet for my 10-year old and have only been using it for a week or so and so far, so good.  The build is good enough to feel substantial but not heavy or cumbersome.  The display is clear and the sound good (have not experienced the problems that 1 other reviewer had with sound).The one issue that I did have was with the Asus LiveUpdate.  The popup suggested that I should update the firmware and software (Asus drivers, etc.) but it did not work.  On reboot, it complained that the update was unsuccessful and needed to restore to the last known good firmware.  It took about 10 minutes to restore.  Luckily I had not installed any apps so did not lose anything, so now I just ignore the LiveUpdate.  Windows updates on the other hand have gone smoothly so far.The tablet came with the Product Key for MS Office 2013, but had 2010 installed and I could not find where to get the 2013 from.  A quick chat with MS Support lead me to this link [...] entered the Product Key and downloaded straight to the tablet.  Installation took about 20 mins or so.I have been using Windows 8 on my laptop for a while and now on the tablet and much prefer it to Android.  Some people complain about the look and the Metro tiles but I love it.  The dynamic tiles give some life to the Start page and I do not yet understand about the lack of the Start button being a problem; none for me.Overall, recommended especially at this price point.", "Title": "Quite satisfied; great price point", "Date": "July 24, 2013"}, {"Author": "James H. Francis III", "ReviewID": "R2WEA0KI8XHH43", "Overall": "3.0", "Content": "This tablet is crippled in one regard.It has an Intel Graphics Media Accelerator 3650.  That's OK.But Intel does not make a graphics driver for Windows 8 for that graphics card/chip.So Asus wrote their own driver.And it does NOT support video scaling.This means that, if you run an older Windows program that must run at a lower resolution to be seen on full screen, the graphics driver will not show it on full screen.  It will just center the window in the center of the screen and put a lot of \"black space\" around it.Most video drivers have options to \"stretch\" the image to full screen.  You can either maintain aspect ratio or stretch it in both directions.This computer will NOT do that.  And Intel is not going to write a graphics driver for this graphics chip/card for Windows 8.  They have one for Windows 7, but not Windows 8.  You can google \"Intel Graphics 3600 For Windows 8\" and see all the irate comments about this.So:  If you aren't buying a Windows 8 tablet to run older Windows 8 software, you shouldn't have a problem.  It's a nice, inexpensive tablet. But, if you are going to run older Windows software, this is NOT the tablet/computer that you want.(I ended up buying a Microsoft Surface Pro.  That driver (for Windows 8) also had the same problem, but Microsoft directed me to Intel's driver for Windows 8.1 for the chip and graphics card that the Surface Pro has, and that solved the problem!).", "Title": "Beware of Graphics Capabilities!!", "Date": "September 17, 2013"}, {"Author": "Meh", "ReviewID": "R17LAWKGUM648T", "Overall": "2.0", "Content": "I expected to love this tablet since I have an Asus Transformer Prime but this tablet is not as durable. First off it already came with one scratch on the screen fresh out of the box.  I purchased the matching Asus keyboard and cover that goes with this tablet and it has put another scratch on the screen the first time I hooked it up.. They are deep scratches as well and I am gentle with my things. Amazon's return policies do not allow for electronic returns so I will never purchase a computer from them again and this tablet is pathetically fragile.", "Title": "Not a durable tablet!", "Date": "September 14, 2013"}, {"Author": "Happy with PC and Mac", "ReviewID": "R3E459MBPQX5WZ", "Overall": "4.0", "Content": "Received it very quickly, as always, from Amazon. Sure it won't blow away ultrabooks and other Windows 8 tablets but what do you expect for this price? Great for when you're away from your office or home computer. Though, don't waste your money on the buggy TranSleeve keyboard.", "Title": "Great Value in a Windows 8 Tablet", "Date": "July 26, 2013"}, {"Author": "David mcclammy", "ReviewID": "R2JSJ5CDHIV5TR", "Overall": "5.0", "Content": "I was sketchy about buying a full windows powered tablet at first. I figured such an advanced os running on tablet would be laggy and the slow but this thing runs just as good as my desktop. It's very fast and responsive. I also own a Galaxy tab as well as several ipads and this tablet is by far my favorite!", "Title": "Best Tablet!", "Date": "November 27, 2013"}, {"Author": "Emily Campbell", "ReviewID": "R39VU1YLO171LA", "Overall": "4.0", "Content": "The computer works quite well for such a small tablet. The Window 8 operating system is definitely made for tablet use, so I have no problem with that. However the sound/video card on my device likes to uninstall itself at random during use resulting in ultra distorted or absent sound/video quality. However restarting corrects this error. This has also happened to the Wi-Fi adapter. I like that it comes with a full version of Microsoft Office.This device has comparable size and quality to the Windows Surface with the price of the Surface RT model.", "Title": "Great for the price.", "Date": "November 10, 2013"}, {"Author": "Nat05", "ReviewID": "R3T1FJM0CM449B", "Overall": "5.0", "Content": "I debated buying this tablet for a long time, but I am so glad I finally bought it!  As a nursing student, I use this constantly for papers, research, textbooks and clinicals--and I haven't had a single problem with it. I would definitely recommend this!", "Title": "Great tablet", "Date": "October 16, 2013"}, {"Author": "Cherilyn", "ReviewID": "R1BQ7W5UEVIQ3E", "Overall": "1.0", "Content": "We bought this, expecting such a good tablet (along with a keyboard to accompany it) for my writing and for accessing the internet. We also needed Office 2013...which it claimed to have. Instead, we get a  psychotic tablet that doesn't seem to load pages properly, to register typed letters correctly or to transition from one word to the next! It did NOT come with any kind of Microsoft Office activation key and it acted like it had a virus from day one. We are very dissapointed in this manufacturer/distributer/warehouse that sold us this piece of used junk. Be careful.", "Title": "Piece of Used Junk", "Date": "December 27, 2013"}, {"Author": "Tomasino", "ReviewID": "R2DCNCMDMUC6GP", "Overall": "2.0", "Content": "Out of the box it worked just fine.  Resolved a number of issues I'd had with an older model Droid tablet.For the first 10 days or so, it was great.  I was very happy with it.Then the Auto Updates kicked in and ruined EVERYTHING.First it was ASUSLive (or something like that).. then it was just basic Microsoft Auto Updates.*  wireless adapter went south.  (device & driver were fine.. but OS wouldn't hook into it..  got that fixed)*  power button problems (got into the known sleep/wake power button problem.  real pain.. never got it fixed.)*  couldn't completely apply updates.  (dunno..?  too tired at this point.)It got itself stuck in a pickle doing updates.. couldn't apply any of 'em due to some kind of \"power_driver_state_failure\" error.Couldn't update (go forward)..  couldn't roll back (refresh to factory settings).  Just stuck.So I returned it for a refund.I never intended to spend this kind of money to do Integration Testing and QA for ASUS and Microsoft.", "Title": "Pay to perform Integration Testing / QA  for ASUS & Microsoft", "Date": "December 15, 2013"}, {"Author": "Kishore bysani", "ReviewID": "R3W4BG5W24I467", "Overall": "2.0", "Content": "This tab worked great initially for 10 days and completely froze later on. I don't know if the battery went drained but it turned out tobe a dead brick.I found few problems related to- virtual keyboard not popping up each time I need to type something. For example, when I want to search people in facebook, virtual keyboard doesn't appear.- There seems to be a lag in doing some operations. For example, signing out from gmail is taking for ever for me.- The tab that I got heat up pretty quickly even when I'm watching video of around 2 min.-  It took around 30-40 min to bring the system backup after the battery went dead and after powering on.", "Title": "Its probably ok - Returned it as my laptop went dead after 10 days", "Date": "December 11, 2013"}, {"Author": "Steven", "ReviewID": "R2HMSI784KWCXG", "Overall": "4.0", "Content": "I have no complaints about the tablet. It has great batter life and the screen is great. My only complaints are with windows 8. App store is limited. It could be as good as my iPad with some major revamps of windows but if you use windows on a daily basis you won't have a hard time with this tablet. Love the tablet just wish the software offered more.", "Title": "Great Tablet... Still getting used to windows 8", "Date": "October 29, 2013"}, {"Author": "jkap", "ReviewID": "R2MUEEFJHPB5ZH", "Overall": "4.0", "Content": "Definitely one of the less expensive full fledged windows 8 tablets on the market, but it serves its purpose very well. The Atom processor is certainly not an I series processor found in most modern computers, however short of serious gaming or heavy data processing it does the job just fine. While the Atom lacks the speed of a regular computer processor the solid state drive loads windows and applications extremely fast. The Atom is also super power efficient and the battery lasts a very long time. I use this a lot on the couch after work (probably more than most people) and I still only charge it a few times a week. The screen resolution is very good and the tablet streams hd video (ie Hulu) effortlessly. The only real drawbacks with this is the lack of a full sized usb port.. I believe you can get an adaptor from many places online though. Also, windows 8 eats a lot of the 64gb drive leaving you with less than half of it left out of the box. A larger drive would be nicer... but then again this is a tablet and probably should not be used to house tons of data anyways (that's what your regular computer is for). It comes very well equipped to work with free cloud services (skydrive). The audio drivers seem to have an issue too. Occasionally you will lose audio and have to reboot. Does not happen frequently, but I've run into it, probably a few times a week on average.Bottom line, this is a tablet and if you use it as one, you will be happy. If you want to replace your computer with it, you will be sad. There are tablets out there that have essentially the same components as full fledged computers, but not only do they cost more than a comparable laptop, their battery life is likely significantly less.. or you'll have a much bigger battery in the machine. Unless you really need the full power of a laptop in tablet form, I'd be wary of those devices. They probably work excellent, but you wouldn't catch me happily doing any intense work on such a small device...standalone keyboard or not.", "Title": "worth it", "Date": "September 15, 2013"}, {"Author": "Timothy J Calesa", "ReviewID": "RRIGGAZKTZN55", "Overall": "3.0", "Content": "The ASUS is a mostly great tablet. I was able to install visual studio (Try that on RT/Droid/IOS) and get right into coding. It also has an install of MS office and a bundle of other stuff.The screen is responsive, the Atom processor is fast enough. It's nearly perfect for what it was designed for.Except the wireless driver doesn't seem to like my wireless at work. I think this is a problem with the driver but Asus has not updated the drivers for this tablet. Mine is dated from November of last year. :-/Other than that irritating problem, it's great for the price. If you must absolutely operate on your office network, you may have problems.", "Title": "Almost there", "Date": "August 15, 2013"}, {"Author": "Bob", "ReviewID": "R1BNEDV37THIKV", "Overall": "5.0", "Content": "The title says it all, it is just a small PC. It is a little slower than my desktop but quick enough for most everything I do. It certainly makes a laptop or notebook unnecessary, seems to be very stable, and has excellent battery life. I can work all day, or work occasionally over several days before needing to recharge.", "Title": "A very small PC", "Date": "October 17, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RW1DJP7BI1NFQ", "Overall": "4.0", "Content": "This is my second Vivotab Smart and it's working for me so far. Unfortunately my first was a dud almost out of the box. The camera could not save pictures when taken  (out of the Box) and a week later the screen refused to come on even though it was fully charged. I returned it to Amazon and within the week I had received my new one. Woohoo to Amazon customer service have to love them. I have had my new one just two days now and its working fine. I'll try to update this review after I've used it a while longer.", "Title": "2nd Time Lucky", "Date": "September 4, 2013"}, {"Author": "Paul Duncan", "ReviewID": "R32S9IWRP9G50W", "Overall": "5.0", "Content": "Consider what you get, Clear HD screen, blue tooth connectivity, full windows 8 with Office 2013, snappy reaction. I think the negative comments are from people who expect a tablet to replace their laptop or deck top. there are just some things that are awkward on a tablet.", "Title": "Well worth the money", "Date": "August 4, 2013"}, {"Author": "Zombie support Group", "ReviewID": "R2WQR30VTVZE4W", "Overall": "5.0", "Content": "I LOVED this device for the time I had it. Unfortunately Asus didn't make it concrete proof. DAMN YOU ASUS! Otherwise excellent device. I am buying my second one right now.", "Title": "Loved it, Broke it, Bought a Second", "Date": "August 2, 2013"}, {"Author": "M Kramer", "ReviewID": "R32FXBBYHDGQ6D", "Overall": "5.0", "Content": "I love this tablet. Bought this one after owning iPad2 for 1.5 years. All my family members have different generations of iPad and they love their iPads. For me there are always some kind of frustrations over uploading my stuff to iPad - perhaps I'm too much of a PC person and can't learn new things, ha!I use the tablet mostly for entertainment, in this aspect, iPad wins. However, I own a ton of ebooks, a huge collectiion over the years, with various formats, pdf, prc, pdb, epub, chm. Trying to get all of them in iPad is a major pain. The feature of a microSD slot is awesome in any Windows 8 tablet is great! I can access my old ebook collection so much easier.", "Title": "So Far So Great!", "Date": "July 30, 2013"}, {"Author": "Andrew", "ReviewID": "R2MGVXUVXXLRN9", "Overall": "5.0", "Content": "Update Nov 2013:I officially now love this tablet. Never had one problem. It has always been great for me, but I just updated to Windows 8.1 and its even better. There are new apps on 8.1 that are decent, especially the new Facebook app for 8.1, which is really nice.If you are looking for a tablet, forget the android, and the iPad, get this on Amazon prime, try it out. You'll like it!================I received this as a gift a few weeks ago. I really like it a lot. It feels solid but not heavy. The screen is responsive and speed is decent. It looks pretty slick!I had an Android tablet for 3 years (Lepan TC970) which did pretty much everything I needed, but I wanted something faster/newer and with more functionality.Windows 8 with the touchscreen is pretty nice. It has its quirks, but you can get used to it. I like it how this is Windows 8 Professional, with the ability to run all Windows apps, unlike Windows RT. Plus its Pro, so it can even join a domain.And it comes now with Office 2013 included which is nice.I don't know anything about problems that others reported, I have had no problems at all and hope that continues.", "Title": "Great Windows 8 Tablet - updated review", "Date": "July 30, 2013"}, {"Author": "Donald W. Campbell", "ReviewID": "R1EZXUBKZCHGR7", "Overall": "5.0", "Content": "I notice some complaints in the reviews, and just a reminder, this is a tablet.Compared to Win 7 on my 8-core 4GHz, 16GB ram... it sucks.Compared to my TF700, android tablet, it is peculiar in some ways, and great in others.Much easier to surf the web, but use Chrome, as IE and Firefox have confusion between scroll and select text.  Much better response with all three browsers than android. (This might also be the extra GB of ram as a factor)Microsoft's \"Store\" is pretty lame compared to Google Play, but... It is Windows 8 (32-bit) x86, so it will run ALL those windows programs that are already your favorites.A real Dr Jeckel Mr Hyde between the Metro and conventional desktop, but it always finds the right interface and shortcuts can be placed in either or both interfaces.The Office tag on metro is to an existing version of Office 2010.  You have a product key for Office 2013.  They are not the same.  I uninstalled the existing version (which is installed, but not activated) before loading the new one, which is done via Microsoft's web pages.  A little confusing.The \"case\" for the keyboard (purchased separately ASUS Keyboard Touchpad and Cover for VivoTab Smart ME400 Series) and the tablet is a little klutzy, especially compared to a notebook, but I mostly just use the tablet 1/2.  Unlike the Transformer, the battery in the keyboard is independent, and incapable of powering the unit.Backlight of the screen is anemic compared to the 700, but it sips power in comparison.If you already have a decent notebook or desktop, probably better to stick with them, but for a tablet, this guy is really good, and that it is Intel Iron and supported by Window's legacy software, I would strongly recommend it vice an iPad or Android tablet.", "Title": "Great, for a TABLET", "Date": "July 30, 2013"}, {"Author": "MJ", "ReviewID": "R1RPTH7I3ZPXZ7", "Overall": "5.0", "Content": "Nice little tablet, great for travelling, very lightweight and manageable, windows loads quickly and works as advertised. Throw it in your backpack and go.", "Title": "Nice", "Date": "November 22, 2013"}, {"Author": "Amazon Customer \"snoh8r\"", "ReviewID": "R1DE34ODC0QQN5", "Overall": "3.0", "Content": "I accidentally dropped this onto the concrete one day and unfortunately it cracked the screen despite it being in a folding case. I first tried to fix it myself but Asus has too many different screens for this model and you have to have the correct one. I called for an RMA and got one approved. It's been 3 weeks since they've had it and the status continues to reflect \"awaiting customer response\". I've called at least once a week and each time I get told, \"you will recieve and email in 24-48 hours'. Never happens. I check all my folders daily for \"asus\". I have chatted, called, and emailed and still keep getting the same formula response. Their service is deplorable and I WILL NEVER BUY AN ASUS PRODUCT AGAIN!", "Title": "Good product bad service!", "Date": "October 29, 2013"}, {"Author": "Lindsay", "ReviewID": "R3I3O7TE8369YV", "Overall": "1.0", "Content": "I have had this tablet for less than 2 months and I have experienced nothing but trouble with it. I am a college student and need a reliable computer. THIS IS NOT IT!!! I have also purchased the transleeve and keyboard to go with this tablet.  The keyboard has stopped working 2 times now and I have returned it for a replacements 2 times.  After speaking to ASUS I have been informed that the warranty for this tablet does not cover replacements or refunds.  The tablet no longer works at all I can not even get it to power on. The charging light comes on however the tablet it now just a 400 dollar useless piece of junk!!! I am shipping it back to ASUS but all they can do is try to fix it.  I will NEVER buy a product from ASUS again they are awful!!!!!", "Title": "DO NOT BUY THIS!!!!", "Date": "September 26, 2013"}, {"Author": "Ryo Nakagawa", "ReviewID": "R33AM539XDG85T", "Overall": "5.0", "Content": "This is not just Tablet. It is PC.You need Keyboard and Mouse to change settings from Control Panel especially Desktop mode.It is Atom CPU, so OK for E-mail, Web browse, some Excel and Word.Good for travel, but it is not replacing Laptop PC.This is $400 for PC with Office.", "Title": "This is PC", "Date": "August 16, 2013"}, {"Author": "Computer Ace", "ReviewID": "RMI4AWGY9ZWM8", "Overall": "3.0", "Content": "I was very apprehensive about opening the box of the VivoTab Smart, as I already have two other Windows 8 tablets (VivoTab RT, Samsung xe500t).  I had hoped that this tablet would combine the best of the two, and become my tablet of choice.  I quickly realized I was wrong.Cons:1. MONO - Mono sound from the left of the device.  After just one day, it has been driving me crazy.  Keyboard clicks, music, games... everything in my left ear.  A speaker at the bottom, even muffled by my lap, would have made for a more pleasant experience.  Let's face it, mono is unacceptable in a device larger than a phone, and for it to be skewed to either side is very unnatural.  I would welcome a clip-on stereo Bluetooth unit to even out the sound; it is THAT annoying.2. ENDLESS BOOT LOOP - I installed the Asus BIOS update while downloading Windows updates, and the tablet was locked in a unbootable loop.  It took special command line procedures to re-image the tablet to factory state (which I can provide if needed) and about a day's worth the research to figure them out.  This is totally unacceptable for an out-of-the-box experience.  (Windows Restore, Refresh, and Reset were unable to fix the issue.)3. CHARGING - Even the iPad power adapter (with appropriate USB cable) isn't powerful enough to charge the device while in use.  The Kindle Fire adapter, however, does appear to provide enough power to charge the tablet while operating.  The Samsung charges in less than two hours, the VivoTab RT boasts 16 hours runtime with dock (charging briefly every few days).Pros:1. The finish is slightly rubbery feeling.  Moist or dry hands can hold this device securely without concern of it slipping from a light grip and being dropped.  The Samsung is way too slick.  The VivoTab RT has a nice metal finish, with just the right rubbery plastic for grip.2. Zippy - performs as fast as would be expected from a device its size.3. Form factor - It's the right size to hold on a lap, etc., a comfortable weight, and objects on screen are not too big and not too small.Other:I write software using Microsoft platforms, so I liked the idea of a compact \"programming-capable\" tablet.  The Samsung is a little large, and the VivoTab RT is unable to run development software because of Microsoft's foolish decision to lock-down the desktop, rather than implement x86-ARM compatibility libraries.  I digress...In all, I think I will continue to carry my VivoTab RT around with me, and use my Samsung for leisure at home.  Although I intended this device to fill both roles, it just doesn't.  Who wants to sit around listening to music in their left ear browsing the web from a device that doesn't want to charge?", "Title": "So close!  Just not quite right... - BLAH....", "Date": "August 6, 2013"}, {"Author": "Jo Ann", "ReviewID": "R19G9UI6ZEA6EE", "Overall": "5.0", "Content": "I love the tablet has everything you need and more....perfect size, great price....I absolutely love windows 8, has every app that you could possibly want", "Title": "asus vivotab smart", "Date": "July 23, 2013"}, {"Author": "Robert Mize", "ReviewID": "R131FODWIUZ0O3", "Overall": "5.0", "Content": "Love it! Responds great, the weight is perfect, not heavy enough to be a problem or so light as to feel flimsy. Battery life is amazing, very happy with purchase!", "Title": "Wonderful tablet", "Date": "June 7, 2014"}, {"Author": "Chris Henderson", "ReviewID": "RQXZ7VU7GZU2B", "Overall": "1.0", "Content": "It is difficult to review a purchase if it doesn't function when you receive it.  That was the case with this ASUS VivoTab.  It had the regular, fully functional Windows 8 operating system installed. It would not charge its battery nor work at all.  I replaced it with an ASUS Transformer Tablet/detachable keyboard unit which functions as well as can be expected when hobbled with Windows 8 RT (32 bit operating system).  I believe that RT must be short for \"Really Terrible\" because you can not install any Windows 8 compatible program that you want, you may only install programs that Micro$oft allows you to use.  If I had known that ahead of time and I would have purchased a unit with the regular non-crippled Windows 8 operating system.", "Title": "Item was Dead on Arrival.", "Date": "June 4, 2014"}, {"Author": "s", "ReviewID": "R35DBKVKV3L2ML", "Overall": "4.0", "Content": "After having this tablet for 32 days, the screen developed a line from just left of the camera to just left of the windows icon. The support team did a great job of repairing it and getting it back to me in just over a week, and it was covered under my warranty. The tablet was not dropped,jostled, etc., so I am giving it only 4 stars because it should not have had a problem after only a month of  gentle use. Other than that it has performed very well. For those debating between a windows 8 and android tablet, know that the windows store is more limited that Google play. The emulator that I tried didn't work terribly well, but I could still play some games on my new tablet. Another thing to consider is that the keyboard takes up about half the screen, which can make it difficult sometimes. I got an adapter for my wireless keyboard and mouse (usb to micro usb) and it works great. I haven't tried a bluetooth keyboard with it, so I don't know how well that works.", "Title": "good for the price", "Date": "June 3, 2014"}, {"Author": "S. Leinweber", "ReviewID": "R1MI7Q56N5TOJS", "Overall": "4.0", "Content": "The Asus Vivotab is great.  Super fast and easy to use.  I couldn't use the included office program as it needs an access code.  I ordered this as a warehouse return and that wasn't included, but other than that....Awesome!", "Title": "Nice Tablet", "Date": "June 3, 2014"}, {"Author": "RWright", "ReviewID": "RGQJWQTP72MNO", "Overall": "5.0", "Content": "I purchased one of these units for my wife who has physical difficulties.  Unfortuanately, it didn't work out as well as I had hopedfor her, but after spending some time with it myself, I think it is a nice unit.  It could use more than one USB port, however.  It seemed fast enough to do everything that I would need it for.", "Title": "Nice Tablet", "Date": "April 9, 2014"}, {"Author": "JG", "ReviewID": "RHSL78WWRN3XU", "Overall": "4.0", "Content": "This is a great little unit for Windows users who are looking for more.  If you order the case and keyboard, you can easily set it up to use a mouse with an adapter.  I like the ability to load programs, such as Quicken.  The only negative I've found so far, is it doesn't hold a charge as long as I'd like.", "Title": "Has It's Own Keyboard", "Date": "March 11, 2014"}, {"Author": "Joan Pearce", "ReviewID": "R1TJ8BINGEFTHU", "Overall": "5.0", "Content": "I have had this tablet for almost a year now and for the money its worth every cent and more. It dose every thing I need to and more. I would recommend it for someone who is smart with technology It gets some getting used to but once you do its great. Its just like any other windows 8 operation system. So if you now how to use windows 8 you shouldn't have any problem.", "Title": "worth every cent", "Date": "March 1, 2014"}, {"Author": "Samus Aran", "ReviewID": "R1EHVVBE70M0ED", "Overall": "4.0", "Content": "Been using a 'used' edition of this tablet from an amazon seller. they did not have the decency to restore it to factory settings before shipping it, so it had a previous user account all set up ans i could not get in. had to go thru the painful process of a factory reset. took an hour or so, but what was worse was trying to install the necessary windows updates. at first it did a few on its own. then nothing, so after doing the troubleshooting thing which helped a little, had to resort to DLing them one or two at a time by hand. Oy. Finally got enough of them to get win 8.1. then the apps wouldnt install anymore. argh! did troubleshooter again, dunno if it worked, but got fed up and turned it off over night. next day apps were installing and working fine. weird. so far it is not too bad. some apps dont always work, and still trying to figure out Office program...it doesnt always want to do as i ask, rnot sure if its me or windows fault tho. Tab would be awesome if windows were more streamlined resource wise. wouldnt hurt to have more ram or faster cpu of course, but for what i paid, i am happy enough. super happy with hdmi port to my tv.,works nicely and,looks great. going to give my printer a try tomorrow. hope it works so i can make this a good extra to my laptop.  screen is plenty sharp for reading for a while, just take regular breaks.buttons on the desktop portion are really small when in tablet mode, (no mouse etc.) but can semi fix that by pressing on wallpaper until menu opens, like a right click. then tap screen resolution, then 'make text and other items bigger', and check box choose one scaling option. then adjust by custom size to your liking. experiment,a bit. i set mine to 135% and is not too bad over all now..one thing i really like is the skydrive/Onedrive thing. it shares stuff between all my pcs without having to know how to set up any networking stuff, and even my windows phone which is great, so i now have all my pics from the day off the phone no prob. no more putting stuff on a flash drive or sd card and trying to transfer between pcs or always emailing to myself.dont like long typing with onscreen keyboard tho. have found that out writing this review.If MS would just get it together a little more they'd have a,seriously productive and usable platform for everything. I have used windows forever, and think they should just cut the crap without dumbing it down too much. :::sigh:: when cute lil pink piggies fly i guess.**Update 3/5/14 Have upgraded my over all star score from 3 to 4 in spite of the glitches. Sometimes the screen goes blank and won't respond and I have to do a hard reset, but I don't know if this is due to the Windows program or the Asus hardware. Had it do so when using the camera app and when removing the HDMI cable from using the TV with it. Have found that putting it into sleep helped with the HDMI freeze up though, so I think it might be software issue. Can't really find anything wrong with the Asus hardware itself.. Mine seems to be one that wasn't damaged in some fashion before being sent to me and after getting the Win 8.1 update it works much better in general.", "Title": "Rocky start to the relationship", "Date": "February 28, 2014"}, {"Author": "Hugo González Arteaga", "ReviewID": "R62DWJZNPE9VQ", "Overall": "5.0", "Content": "A quality product, I love it. I have two different models of Asus is totally like me.Recommended for all, yes", "Title": "A beauty in my hands", "Date": "February 17, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R294I1ZK88SRZ", "Overall": "4.0", "Content": "So far, so good.  The tablet is so light and everything comes up very fast.A book is needed with these tablets.  The included Office 2013 installed easily enough, but I haven't ventured to use it yet.Why, oh why does this firm not send along more printed guidance.  And after installing a couple of games, I couldn't even find them on the tablet afterward.  I will have to spend much time with the forums.", "Title": "ASUS Vivotab Smart ME400C tablet", "Date": "February 13, 2014"}, {"Author": "Aaron", "ReviewID": "RPAEYNKUY4HIX", "Overall": "5.0", "Content": "This is a fantastic tablet for the price! It does everything I need it to, and with an USB port, mini-HDMI output, and microsoft office, it almost replaces my laptop entirely. If you want a decent tablet for the price or want a great starter tablet, buy this one. Now.", "Title": "Great Tablet! Does Everything!", "Date": "February 12, 2014"}, {"Author": "Zane Hollar", "ReviewID": "R3I0MA4PO348PA", "Overall": "5.0", "Content": "You cannot get a better full Windows 8 tablet for the price.  Boots up quickly and runs smooth. The free office is a huge plus as well. Typing my review from it right now.I would strongly suggest getting the cover for it as well, it works as a shield and a stand all for under $20.", "Title": "Everything I wanted", "Date": "February 8, 2014"}, {"Author": "Pleased", "ReviewID": "R2SD4JPOJ3KACV", "Overall": "3.0", "Content": "I like this tablet because of its convenience and light weight compared to the Asus W510 I bought at the same time for my father. I have had to restart it a few times but it is still on the good end in terms of electronic and IT problems. The other problems I am having are: The screen stopped working for half of a day last week, Adobe is always crashing on this which makes videos difficult to watch and my micro USB port stopped recognising anything for a few days late last month (January). It started recognising the charger again but I still cannot use a flash drive in it. I wanted a Windows tablet to use for quick assignments on the go but do not like the use of Window 8 which limits its use by forcing me to sign-up through my Hotmail account to enjoy the many, many software features. At the end of it all it is not a major headache but I can't even have it exchange now anyway.", "Title": "Great product but ...", "Date": "February 7, 2014"}, {"Author": "Bill Bennett", "ReviewID": "R3RHPCWUF0I9T8", "Overall": "4.0", "Content": "This tablet is an excellent first choice for a Windows 8 machine, without RT.  After trying the basic Surface with Windows 8 RT, this is a pleasure using, and not having to go through the \"Store\" for every \"App\".  As a Windows user (almost exclusively except for the Kindle Fire HD) I enjoy having the freedom of all the Windows 7 and 8 programming to use with this unit.I also wanted a tablet with great multimedia capabilities, and this one does not fit that requirement.  Some of the ads for Asus state that it is equipped with 'stereo speakers', and this is not the case.  It has ONE speaker mounted inside the left rear cover, and maybe some pretension of faking true stereo or surround sound.  This does not work!  Plug in a nice stereo headset, turn up the volume, and it does come alive in full stereo.  The resolution at 1366 x 768 is ok, but not the best.  However, on a screen this size, it looks decent.Overall, this Asus is a good buy, good quality, fair battery life, and suffices for a basic Windows tablet.", "Title": "Good performance Tablet", "Date": "February 4, 2014"}, {"Author": "B. Smith", "ReviewID": "R1XE44XV0W8ZU7", "Overall": "2.0", "Content": "I have bought two of these Vivotab Smarts. First one in November of 2013 and the digitizes (the touch part of the screen) have cracked on both. I have looked all over the internet, but replacement parts are not available. The tablet itself works fine and the screens light up on both, but I have to use the keyboard if I want to use them. If I want that I'd have bought a laptop.... I'd give it 5 stars for function and usability, because they both work good, but the screens are a week spot. I read reviews of someone buying 5 of these and they're all down with cracked screens:-(", "Title": "Buy a Screen Protector!", "Date": "February 1, 2014"}, {"Author": "Al Just \"Al\"", "ReviewID": "R2LVMOL663KFKZ", "Overall": "5.0", "Content": "This is a great tablet.  It took about me a half a day to process the over 60 Windows upgrades, but once this was over the upgrade to Windows 8.1 worked fine and took less time than the same upgrade on my regular PC.  It charged reasonably fast, too.  I connected to its micro USB port a micro to regular USB connector. Then I connected it to a USB hub, and connected to this hub a regular USB keyboard, a mouse, and a plugable USB ethernet connector.  Voila, the tablet became a full laptop when needed.  To do presentations using projectors the HDMI port using a micro to regular HDMI connector also works fine.This is NOT Windows RT, it is Windows 8 and therefore I was able to install all my regular Windows programs on the tablet, along with my 136 Apps in the Graphical Tiled Start menu.  This way I have both a desktop and an App machine in one tablet.  The only tricky think was to find how to install the Office 2013 in the tablet. It comes with the license code page but no instructions on how to get it installed. Finally I found that you had to go to [...] and them enter the license code, download and install Office 2013.  It installed without problems and later on it was activated without problems.", "Title": "A great tablet with Windows 8  (not RT)", "Date": "January 31, 2014"}, {"Author": "Tara", "ReviewID": "R1S7BVMDEENL90", "Overall": "1.0", "Content": "The quality was great till I turned it on. It does not accept tap type very easily and the magnetic keyboard is a joke. Who creates a magnetic keyboard with a magnetic shield for a tablet?", "Title": "Returned this item", "Date": "January 29, 2014"}, {"Author": "L. Reinsager", "ReviewID": "R1T25RQ1QK4SD2", "Overall": "5.0", "Content": "Pros: 9-10 hr battery life even when in use ( have not watching 10 hrs of Netflix per say but playing games and surfing the web regularly will hold its on.  Really enjoyed the Micro HDMI port.  Screen is very responsive.  was able to update to windows 8.1 and really fixed a Few lag issues and apps.  Flash is great to have with the camera.  also works great with an external hard drive with USB adapter.  ( 1.5 TB)Cons, 1 Micro USB port!!!!!!  Very limited accessory ( hundreds of cased but only one keyboard that works with it specifically 99$ )Some video performance issues.I original hated windows 8, but It is slowly growing on me, still needs some tweeks and polish for a Really windows Product to replace windows 7 but they are improving on it every day it seems.", "Title": "slowly Won me over. Lacking in Docking station or affordable keyboard.", "Date": "January 27, 2014"}, {"Author": "carrie stoever", "ReviewID": "RWAGTVJJWP100", "Overall": "5.0", "Content": "I got this tablet for Christmas and have used it every day. I did put in a 64g mem card for extra storage. It does everything. I own a desktop and a laptop but haven't used them since getting this. I have only found one thing. I do wish the speakers were a little louder tho most the time they are fine.", "Title": "i love this tablet", "Date": "January 22, 2014"}, {"Author": "mR2", "ReviewID": "R2K6K3IF2XF8A6", "Overall": "4.0", "Content": "Its a great purchase considering coming with Microsoft Office to do yo job on the go (can't expect it to replace your laptop though). highly recommended to upgrade your to Windows 8.1 once you purchase this tablet for better protection with Windows Defense. i owned iPad, tablets running on android and this Asus Vivotab Smart has its advantage if you do a lot of works using Office suites.reason for giving only 4 stars is the lack of apps on Microsoft App store.", "Title": "Do it's job well.", "Date": "January 20, 2014"}, {"Author": "WKU Student", "ReviewID": "R1F9MZT2GJPQOF", "Overall": "5.0", "Content": "I absolutely loved this tablet, HOWEVER beware...After having this tablet you need to check my tablet was not the C2, it instead was the C1! I had no idea about this fact until I started looking to replace mine after dropping the first tablet.I strongly advice you to check the information on your tablet! DO NOT LET THEM SELL YOU THE WRONG ITEM.", "Title": "Love this tablet!", "Date": "January 19, 2014"}, {"Author": "Becky Rabine", "ReviewID": "RMFY0Y8R416DR", "Overall": "5.0", "Content": "This tablet is fast and the included Microsoft Office Home and Student edition is a great plus. The touch screen works great. I am getting used to Windows 8 and I really like the operating system. . I have over 35 GB available on the 64 GB hard drive Adding an extra 64 GB micro SD card increases storage. Good for storing photos, music and movies. The Asus web storage that is included is also a great bonus. I use this tablet to access my work computer and email. I would recommend this tablet to anyone looking to purchase a table.", "Title": "Asus Vivotab Smart ME400C-C2 BK tablet", "Date": "January 12, 2014"}, {"Author": "Mvestermark", "ReviewID": "R6F4UMWRO65L4", "Overall": "5.0", "Content": "This tablet is so lite and so cool.If your familiar with windows 8 then this is the tablet for you, but it also has a desktop view like a desktop computer.Love that this came with Microsoft Office!But the down side is that it has very little extra memory. I had to get an extra portal hard drive.", "Title": "Love it!", "Date": "January 11, 2014"}, {"Author": "B. J. Leftwich", "ReviewID": "RG59JEG4RCYSD", "Overall": "5.0", "Content": "Much prefer Windows products over Android, etc. Easy to use has all the apps that I need. I highly recommend this machine.", "Title": "Excellent prduct", "Date": "January 11, 2014"}, {"Author": "Brett", "ReviewID": "R3FAIV982FTAZN", "Overall": "4.0", "Content": "This is a great tablet. I got it for my cousin for Christmas. It is sleek and feels good in the hands. It is a little heavier than expected but its not bad. The only thing that could be improved is that it feels a little slow doing normal things on the tablet like bringing up programs and such. Other than that it works perfectly for what she got it for which is games and Facebook..", "Title": "Great tablet, could be faster", "Date": "January 8, 2014"}, {"Author": "AmazonFan12815", "ReviewID": "R2AKKCL6UFJVI1", "Overall": "4.0", "Content": "PROS:  Full WIN 8 in a package this small at this low of a price!!!!  Why would you even look at IPAD-or-clones for their high prices?  I was amazed at what this little tablet will do.  It is almost like a \"full-PC-in-your-pocket\".  I bought it for my daughter to use in her business for personal presentations to her clients.  It does everything an IPAD will PLUS.  This was our first experience with WIN 8 and that took some getting-used-to.  CONS: You do not get much in the way of instructions with this unit... You have to go online for tutorials and search for tips on WIN 8; but I fault Microsoft, not ASUS, for not providing good written instructions for WIN 8.  It took a few hours to do all the software updates.  The only other drawback is... I wish this had a docker like the Acer ICONIA  or Dell Venue 11 series (but they cost 60-70% more).  I have yet to try the mini HDMI cable in the EEEkit (cable kit) I bought for $10, to see if it will connect to a bigger screen for those times when you need it.  I still have lots of things to try with this little baby.  But at this price, it is a bargain right out of the box.", "Title": "You can't beat the price for what is inside", "Date": "January 8, 2014"}, {"Author": "John C. Snow \"snowman\"", "ReviewID": "R1OYH60SFCML4L", "Overall": "4.0", "Content": "Wife really loved the tablet for Christmas, but she had issues with getting the tablet to fully charge.  And the port for charging ended up being faulty, and we had to return.  And we had to find one else where because Amazon was out of stock.  Still gave it 4 stars though, and kudos to Amazon for the return process being smooth.", "Title": "Wife loved it, but had to return..", "Date": "January 7, 2014"}, {"Author": "Avani Shah", "ReviewID": "R1Z24Z9KAYKLQN", "Overall": "4.0", "Content": "Only complaint is Windows 8.1 it is not working as smooth as iOS.1) I have open my AOL email twice to actually open it, on the first time email does not open, I have to close it and open it again, then only it opens up.2) Signing out of Gmail is a struggle.3) flipping the camera is not available while video chatting using Skype.", "Title": "I like the product", "Date": "January 6, 2014"}, {"Author": "Michelle R.", "ReviewID": "R1CM8XU4EW3PFD", "Overall": "1.0", "Content": "got it for a christmas present had to return it, 2 weeks after it was open because it wouldnt charge.", "Title": "returned due to the fact it wouldnt charge", "Date": "January 4, 2014"}, {"Author": "Lwadzo", "ReviewID": "RG5B4K7R1VWCH", "Overall": "1.0", "Content": "I updated to Win 8.1. Now the cameras do not work in Windows programs (actually, not sure if they worked before that). Restore and attempting to return to factory settings does not work either now, says missing media. I worked with Asus online tech support, but they could not help, so I just have to wait and see if Asus ever updates the software to work with new windows. Do not buy this tablet. Pay a little more for something from manufacturer that will update drivers and such on a timely basis.", "Title": "generally good, but asus is way behind on updates", "Date": "January 3, 2014"}, {"Author": "Camera girl", "ReviewID": "R1XEBM07AMQ3AH", "Overall": "5.0", "Content": "Bought this for my husband and it does everything he needs it to do for both work and home. The more he uses it, the more powerful it gets.", "Title": "Versatile, powerful little tablet", "Date": "January 3, 2014"}, {"Author": "Ken W.", "ReviewID": "R1TD7RMEH5373S", "Overall": "4.0", "Content": "I like everything, especially inclusion of Microsoft Office,  about this tablet except battery life (comparatively short compared with my iPad).", "Title": "Great Workhorse!", "Date": "January 2, 2014"}, {"Author": "Mike", "ReviewID": "R2Z4WLIWZFECT", "Overall": "4.0", "Content": "Thls product meetsmy needs except..I really.mismy USB connection. O still Havent figurer out wirelessprinting. I plan to add à réal.keyboard but the screen version is working for now.  The micro chipis are new to me too.  Overall, for $400, I am happy.", "Title": "asis vivotab", "Date": "January 2, 2014"}, {"Author": "PJS \"Old and unbalanced\"", "ReviewID": "R3PEWKPISW3EUC", "Overall": "3.0", "Content": "Not quite up to my standard of user friendly..The touch screen not very useful.. does not respond as my other tablets do... very slow response and no response when when trying to access bottom menu... Had to purchase a bluetooth mouse to use my office software and to access bottom menu...key board does not pop up automatically as it should.. another reason for the mouse...No option for attaching keyboard..Asus does have one with attached keyboard that I tried out at Best Buy and for a lot less than what I paid..In Summary, I have been a good costumer and have never complained about any products from Amazon but this one leaves a lot to be desired.. You might consider a rebate or discount on this overpriced item..Thank you---PJS", "Title": "SO SO", "Date": "January 2, 2014"}, {"Author": "kavlito", "ReviewID": "R2G6863LFWTWXS", "Overall": "5.0", "Content": "Absolutely love this tablet.  Windows 8 is not the reason.  The tablet form factor, hardware, size, price... love it.  Coupled this with the Microsoft Wedge Bluetooth Keyboard and Poetic Slimline Cover and I have the perfect portable 'PC in a Tablet'.", "Title": "My favorite buy of 2013!", "Date": "January 1, 2014"}, {"Author": "DK Jensen \"MNGrrrl\"", "ReviewID": "R2BW9Y4NMDG1JO", "Overall": "4.0", "Content": "I wish I'd sprung for the more-expensive Surface and gotten the full touch-screen functionality. On the other hand, it's stable and has a decent battery life. I take it to meetings and take notes on it, and it works fine.", "Title": "Works OK for the price", "Date": "December 30, 2013"}, {"Author": "craigster", "ReviewID": "R2CQYUF4PRXHL2", "Overall": "5.0", "Content": "I had purchased an asus t100, which didn't turn on after 3 days. Amazon took back with no complaints. I choose the asus me400c-c2-bk 10.1 inch 64gb with windows 8.1 which I updated to windows 8.1.1. Received December 1st. My first tablet purchase. I am very happy with choice. The moko lightweight shell was a needed addition to protect investment. With hdmi output its great for hooking up to tv. Battery lasts 8 hours I'm guessing, never used up battery life in a day. I would recommend item to a friend.", "Title": "very happy with 2nd choice", "Date": "December 30, 2013"}, {"Author": "t cripe", "ReviewID": "R3SPGPXO8JNC4R", "Overall": "5.0", "Content": "Bought this for my wife's christmas present. She uses Windows at work, so Android was out. I set it up for her so it would work right out of the box, and I'm glad I did. There were quite a few updates waiting to be downloaded. And because the Windows 8 mail client does not accept POP accounts directly, I had to set that up through Outlook. The WiFi has not been flaky, as others have reported. The screen response is good, and the inclusion of the home version of MS Word is a feature she really enjoys. Seeing that the price jumped $50 two weeks after I bought it, I'm very pleased. I also ordered the Moko case, which is very nice - light and functional with its magnetic closure.", "Title": "a good deal for my wife", "Date": "December 30, 2013"}, {"Author": "Yoda", "ReviewID": "R2W6IPLWH2Y4VQ", "Overall": "4.0", "Content": "Very useful notepad - we use it at work out in the warehouse.  It connects to our network easily, and is easy to use and navigate.  It is perfect for our needs.", "Title": "Very useful", "Date": "December 30, 2013"}, {"Author": "paul lootens", "ReviewID": "R32CMUBUGWHU2M", "Overall": "1.0", "Content": "it arrived on time.... BUT! it did not have the activation key included. And after 2 days it started glitching out.... having letters repeat themselfs even when not typing.... returned product and got money back.", "Title": "No office activation key included AND glitches", "Date": "December 28, 2013"}, {"Author": "Robert Wicks", "ReviewID": "R1Q5HKPYS2RT01", "Overall": "4.0", "Content": "Easy to use. Intuitive. Long battery life. Fast load up time. Would like a pointer to go with it to finish it off.", "Title": "Vivotab", "Date": "December 27, 2013"}, {"Author": "LaShawn Williams", "ReviewID": "R3LRS182A7K13A", "Overall": "5.0", "Content": "I purchased for my son. It was a very good price for a starter tablet. It came with window 8. He loves it.", "Title": "Nice tablet", "Date": "December 27, 2013"}, {"Author": "old school john", "ReviewID": "RJB5V06O29OXY", "Overall": "4.0", "Content": "I am a software developer and own and use a number of tablet devices, including an iPad, a Nexus 7, a Nook, and a couple of other devices.  I purchased this tablet to test out something I am working on with a Win8 device.  The Vivotab Smart has a great display, is reasonably fast, comes with 64 gbyte (expandable) and has a very sharp front facing camera.  True, the case it plastic, but like most people I enclosed it in a carrying case the day I bought it, so I consider that a non issue.  However, I almost returned it the day I received it, because out of the box it was slow and the touchscreen was twitchy.  I ran it through it's over the air update and FIVE HOURS LATER it was working perfectly and I have never looked back.  Asus should ship this with a big red sticker that says \"Wait...don't try anything until you run the update.\"I hated Windows 8.0 (\"metro\") when I first previewed it a few years ago, but after using 8.1 on a tablet for two weeks I have to say I am coming to like it a lot.  It is a very well thought out mobile operating system, with many clever innovations.  It's not quite as easy to use as iOS, but as others have pointed out, this is a complete full-featured operating system packed into a tablet device.  An iPad is great for surfing, emailing, and updating your Facebook status.  A Win 8 tablet like the Vivotab Smart is for really getting things done... working on Word, Excel, and Powerpoint docs in their native formats, connecting to other filesystems, moving big chunks of data on and off the device using a thumbdrive, etc. These are all things you simply cannot do on an iPad.I would have given this device 5 stars except for the awful out of box experience, but I would certainly recommend it to anyone who needs a tablet for productivity.  Win 8 has a bit of a learning curve, but once yet get used to it, it can be a lot of fun!", "Title": "Great tablet once you get past initial setup", "Date": "December 26, 2013"}, {"Author": "Mark R Freeman", "ReviewID": "R2308GYSCX3LKT", "Overall": "4.0", "Content": "I've had the ASUS Vivotab smart for about a month now.  The build date on my box was 12/12 .. so this is not new to market.  I was able to upgarde it to Win 8.1 with no issues.There are some things the touch interface does not do well, and it is nice to have the Bluetooth mouse and keyboard.  This is mostly some sites on Chrome or other programs that have not been optimized for Touch.  IE 11 is much faster than previous IE versions and seems to work better with Touch.  My biggest issue has been the system crashes way too often .. maybe 1x/day.  But, it handles web browsing better than my 1st generation iPAD.  In general, the iPAD is better where there are purpose built apps .. like magazine readers that there is no equivalent on Windows yet.  But, this can do so much more than the iPad like run any Windows program.  This Atom processes is not going to perform like an i5, but for basic web browsing and tasks it great. I can even download my Garmin Forerunner data using a mini USB to USB adaptor.So far so good with this device. Once the next generation of low power chips come out from Intel and AMD,  These tablets should take over from Android and iOS becuase they are full functioning computers.", "Title": "This is the future of computing", "Date": "December 26, 2013"}, {"Author": "Wendy Gomez", "ReviewID": "R2WGI96FJ4FO9Y", "Overall": "5.0", "Content": "I debated this purchase based on the conflicting reviews I read online, but now that I received it and got the chance to use it... I Love It!! It was the best decision I made! It kicks my boyfriends IPad 2 but! And my boyfriend agrees.", "Title": "This Tablet is exactly what I wanted", "Date": "December 25, 2013"}, {"Author": "Vincenzo Leone", "ReviewID": "RBHZ50XTSZPNU", "Overall": "3.0", "Content": "its a nice looking tablet with a full copy of windows 8. The atom processor its a bit slow, but good for email and most web surfing.", "Title": "nice  computer/table", "Date": "December 21, 2013"}, {"Author": "Kirk Mcclure", "ReviewID": "R106GUFEM6I6EQ", "Overall": "1.0", "Content": "This is a good tablet in concept but not in execution.Perhaps it will be good for you if you just want to surf the web or read some email messages.  Anything uses beyond that is beyond the power of this machine.As a consumer it is hard to tell what the sources of the problems are.  My charger does not work all of the time.  The power button works intermittently.  The Wifi is spotty at finding networks when the router was only 5 feet away.  Buttons on the screen were often unresponsive.  Application software runs so slowly that it is hard to tell when that machine is running and when it has seized up.  When installing Windows updates, it is common for the machine to seize.It may be that Asus built a cheap machine.  It may be that Windows 8 is just too demanding for the small power in the tablet.  It may be that the Intel Atom is just too weak for Windows 8.  Whatever the source or sources of the problems, the machine rarely works well and often fails to work.I am a professor and bought the machine to replace printed lecture notes.  It is humiliating when, standing in front of a class, and the tablet fails to come to life when the power button is pushed.Asus support is helpful in tone, but their only assistance is to say, “Send it back.”  I have sent the machine in for repairs four times.  It seems that Asus should be able to get it right after that many attempts.  Each time is comes back having wiped out my data and application software which takes hours to reload.  So the poor quality machine will not only cost you money, but it will cost you time, all while failing to work.Asus will not give a refund nor will they replace the machine.  Apparently their plan is to simply have me send the machine in repeatedly until the warranty period runs out.  That is a clear indicator of a company that is unworthy of anyone’s patronage.My suggestion is that you avoid this machine and perhaps this company.", "Title": "Poor quality machine", "Date": "December 19, 2013"}, {"Author": "Kevin Evely", "ReviewID": "R1LIY0VPQEPOKC", "Overall": "2.0", "Content": "The vivotab smart is great for the house and small business. With a few down falls - First of all only on mini USB port which doubles as charging port. Secondly, I've had a problem with either the charger or computer at times while trying to charge, ASUS has been willing to look at computer with a 2+ week turn around they offered to sell me a second charger to see if that was the problem. Last the reason they had to offer to sell a new charger is other converters/chargers don't work with ASUS Vivotab", "Title": "Nice Tablet... however", "Date": "December 16, 2013"}, {"Author": "A. Miller", "ReviewID": "R2I69PFJVCTF2R", "Overall": "5.0", "Content": "I sometimes feel like people only review to complain, so this is to help make it easier. I am a techy person and I understand the importance of certain components in machines. But When I purchased this tablet I was just searching for a simplified laptop (search the web, do our finances, and manage my pictures/music). This machine does the job. I have absolutely no complaints. This was my first time dealing with windows 8 and so far so good. For the basics you can't go wrong. I do not have a keyboard attached and I dont feel like I need one.", "Title": "great buy", "Date": "December 14, 2013"}, {"Author": "Chiranjit Chowdhury", "ReviewID": "R22EZKR4AKTJ7J", "Overall": "4.0", "Content": "It is probably best tablet with windows OS but long way to go for the microsoft to compete android or apple tablets. The sound system cannot be comparable to normal google's 7 inch android any more. There are lot of lacuna and those need to be fixed like Internet speed, flexibility in using, touch sensor, sound quality. The tablet should be user friendly", "Title": "It is probably best tablet with windows OS but long way to go ...", "Date": "December 12, 2013"}, {"Author": "Doris H. Wise \"Palm Coast Queen\"", "ReviewID": "R25Z3OTWH7EEA9", "Overall": "5.0", "Content": "Had an earlier version of the windows 8 ASUS tablet and it fell and couldn't be repaired. This version allowed my son who is in NY  to work on my computer and this tablet via Teamviewer. I am an avid coupon user and I am always getting strange things taking over my computer.", "Title": "I love it!", "Date": "October 2, 2013"}, {"Author": "Gary D. Hix \"sawdust  maker\"", "ReviewID": "R1O8VZQQK4FT4X", "Overall": "4.0", "Content": "My uses are solely recreational. After a bit of learning and getting my computer engineer daughter to set it up for me, I found it useful when traveling and when my wife hogs the desktop. Also I like to use it for showing pictures to family and friends. I doubt it's usefulness as a replacement for a lap top using word, etc unless you get a keyboard.", "Title": "Nice sturdy tablet, great for traveling.", "Date": "September 28, 2013"}, {"Author": "TdyerD", "ReviewID": "R2XC6UK49JG340", "Overall": "5.0", "Content": "I bright this for a friend and I wish I brought it for myself.  I love the screen size and the full windows 8 OS on it.  I have the RT tablet and just wish I was able to download programs I need.  This tablet is a great replacement for a laptop and easier to carrier to class over a laptop.", "Title": "Bright for a friend", "Date": "September 20, 2013"}, {"Author": "Stephen B. Riggs", "ReviewID": "R27N30JW56SJCN", "Overall": "2.0", "Content": "Returned it after a week of use.  Tablet was limited and slow.  Windows 8 widget interface never loaded properly and was clunky", "Title": "Slow and clunky", "Date": "September 19, 2013"}, {"Author": "natalya", "ReviewID": "R1968PDNZWGFGL", "Overall": "4.0", "Content": "Was a little hard figuring it out but afterwards turned out great. Was easy to learn and uploading my pictures directly from SD card. Great deal for the money. Pretty happy over all.", "Title": "Not bad", "Date": "September 17, 2013"}, {"Author": "cactophile", "ReviewID": "R36WG2SWGZGUK1", "Overall": "4.0", "Content": "I love this tablet!  It loads very quickly, it was easy to get the hang of and it is very easy to use.  Since I've never used anything newer than Windows XP it has taken awhile to get used to Windows 8 but for the most part I like it.  The one thing I don't like is that it doesn't open directly to the window I was on after I set it down and it switches to power save mode.  This is my first tablet/first touch screen and I love it though the keyboard is a bit awkward.The one aspect that I'm really not pleased with is the battery life.  I study languages online, read the news, do research and shop online and the battery needs recharging halfway through the day.  That would be okay if the cord for the recharger was longer but it's very short.Overall I'm very impressed though I admit some of that may be the leap (for me) from very antiquated computers and systems to this.  Still I'm very happy with this product and I like Windows 8 well enough that I ordered a new laptop with it (and with a touch screen!).", "Title": "Excellent product", "Date": "September 16, 2013"}, {"Author": "watauga13", "ReviewID": "R12MRNJVO5BE5F", "Overall": "5.0", "Content": "very easy to use , great features.  Really like the windows 8 operating system.  price was good also.  64 gig memory can store loads of apps, photos, videos and movies.", "Title": "Great Tablet", "Date": "September 7, 2013"}, {"Author": "Bruce Neville \"bneville\"", "ReviewID": "R28P304JXZSXZW", "Overall": "5.0", "Content": "This is a powerful and capable windows 8 computer in a tablet. It is not a crippled RT version, but rather a fast dual core Windows 8 64bit computer with 2G of running RAM. The same \"start 8\" utilities that send you straight  to desktop mode work fine on this tablet. Although, so does the modern (metro) screen as it was really designed for a tablet just like this! Did I mention that it comes with an 8+ hour battery, and that the battery barely discharges at all when the tablet is \"off\".", "Title": "A real, powerful, windows computer in a tablet.", "Date": "August 31, 2013"}, {"Author": "Fernando", "ReviewID": "RF9GIAOR4QOC6", "Overall": "5.0", "Content": "I can give it 5 stars because the software is very powerfull and the hardware is very light, perfect whos need to travel all the time", "Title": "Nice combination of hardware and software", "Date": "August 31, 2013"}, {"Author": "Paul A. Hundrieser", "ReviewID": "R2B9OE9QN91TL6", "Overall": "5.0", "Content": "Works great.  I am very happy with it.  Still learning to use Windows 8.  I am looking forward to 8.1.", "Title": "What I have been waiting for.", "Date": "August 30, 2013"}, {"Author": "CESAR", "ReviewID": "ROPBN9SQMDJ87", "Overall": "5.0", "Content": "a full but small computer at your hands.Love the Microsoft office included, I can do my graphics, letters, presentation anywhere I am, Love this device.", "Title": "excellent devive", "Date": "August 21, 2013"}, {"Author": "Michael J. Charles", "ReviewID": "R1NEL46H3Y7V2T", "Overall": "4.0", "Content": "The tablet works very well. I have had no issues with the unit or with the many downloads and updates. There are some limitations with the types of programs i can put on. But then it is not a laptop.", "Title": "Very satisfied", "Date": "August 15, 2013"}, {"Author": "Trusso", "ReviewID": "R3EG1YQJXUPHKD", "Overall": "1.0", "Content": "This thing is a piece of crap!!! The internet is slow, Google Chrome always freezes or crashes, and the \"apps\" barely work. I feel like I'm waiting for this thing to charge rather than actually using it, it gives you a 3 second warning after saying \"6% battery life\" before shutting down. I was so shocked when I took the charger out of the box, the cable is so short that it can just reach the floor. If you want to use it while it's charging you have to sit on the floor and face the wall.The drop down boxes are impossible to use, when you click them they close down within a fraction of a second before you can select something. The on-screen keyboard takes up half the screen, so basically if you cant scroll the page down you have to guess what you're typing because the keyboard is in the way. Copy and paste barely works, and you can't zoom in on the screen. What the hell CAN this thing do? The whole thing is frustrating to use, things take forever to get done. Even though the ipad doesnt have flash player on it, it's much better than this crap. I hate apple too, but I always end up going on my old ipad to get things done... this thing can't be trusted. Asus is a terrible brand for tablet and laptops too.This was a gift, I wish I could return this!!!", "Title": "Garbage!!", "Date": "September 20, 2013"}, {"Author": "D. Howland", "ReviewID": "RVPWAOJZU7UA0", "Overall": "1.0", "Content": "First thing, it wanted to upgrade the BIOS and then locked up when attempting.  Micro USB is good for nothing more than charging.", "Title": "Did not set up properly", "Date": "August 8, 2013"}, {"Author": "Chris Blais", "ReviewID": "R9PG7NOS31BKH", "Overall": "5.0", "Content": "i have bought 2 of these and 3 of the rt versions, love the Asus products for their reliability. wonderful.", "Title": "great", "Date": "April 22, 2014"}, {"Author": "ChrisH", "ReviewID": "R13SP4L3RNAZND", "Overall": "1.0", "Content": "Unfortunately, I bought one of the used Asus VivoTabs.  AC charger and USB cable was missing.I got a cable locally and managed to turn on the tablet.  It freezes up at the Set-up screen.  The touchscreen does not respond.A chat with Asus says it is probably hardware damage.Always had good luck with Asus in the past.RMA back to Amazon -- very heartbroken. : (", "Title": "disappointed", "Date": "March 4, 2014"}, {"Author": "M. Harris", "ReviewID": "R1YS5QMI3HVWOZ", "Overall": "1.0", "Content": "This item was dead on arrival. Will not power on, even after charging overnight.  Thank goodness for Amazon's easy return policy.  The product description looks great and I may have awarded a much higher rating with a chance to use the device.  Powerful device with Office 2013.  Just what I needed.  Too bad.", "Title": "Dead on Arrival", "Date": "December 26, 2013"}, {"Author": "Hawkins Hutson", "ReviewID": "R1EIM450NLOLL4", "Overall": "2.0", "Content": "I got this tablet to use for classes while at school, as my laptop was getting on up there in years. I can safely say that I've been disappointed about everything. The tablet is slow and has trouble connecting to Wifi. When it finally gets connected, it works extremely slow. I ended up using my Galaxy S4 for school because I would rather deal with the small screen and use my phone than wait over a minute for a webpage to load. Downloading applications was a nightmare. I would have to redownload applications multiple times because they would get hung up and freeze for hours at the same percentage. Finally, I had it crash on a boot screen where it keeps bouncing between the only two options as if I were holding down the up arrow key on a keyboard. And of course, there is nothing acting on the screen or any way to stop it. I've let the battery die multiple times and tried to turn it off and on and nothing changes it. Maybe I just got a lemon, but buyer beware on this tablet.", "Title": "Buyer beware. Maybe I just got a faulty tablet, but NOTHING works right.", "Date": "December 7, 2013"}, {"Author": "billibarou", "ReviewID": "R14BJ24AGJHKB5", "Overall": "3.0", "Content": "I have been sorely disappointed by this tablet.  Most of this is due to Windows 8 and not due to the tablet itself.  The interface is way too clunky.  Switching between the Metro interface and the Full Blown Windows 8 interface is really annoying.  The big problem is the lack of apps in the appstore.  I did a walk through of the apps I use the most on my iPhone, so I would know what apps to search for in the appstore.  Well needless to say I only found about 10% of what I was looking for.  Many of the apps I did find are poorly written and don't function well.  There is not an official Facebook app and I can't find a good one in the appstore.  I am the kind of person that likes to try it before you buy it.  Well I tried a half dozen different Facebook apps and picked the best of the worst.  Tablets are really made for content consumption.  I wasn't under the delusion I could build applications in Visual Studio with this device.  I was just hoping for an alternative to my laptop and iPhone.  Well for me this wasn't it.  I should have purchased an iPad.  Keep in mind I am an extremely technical user that has been doing high level IT support for almost 20 years.  That is why I find this experience so disappointing.  On the plus side Firefox is in the process of developing a Metro UI for firefox called Firefox nightly.  I will have to kick the tires and see how I like it.", "Title": "This tablet works fine.", "Date": "October 23, 2013"}, {"Author": "Filterkid", "ReviewID": "R1EE2STI527MA3", "Overall": "2.0", "Content": "I shopped around forever for a tablet and finally landed on this one. The price was good given it came with Office Home & Student. I plugged it in and charged it up. Went to use it and I thought everything was fine. I was excited to have it and had to play around with Windows 8 a bit to figure it out. Here is where I am very unhappy. As with most computers, when you buy them you instantly have to update almost everything because security fixes come out all the time. The tablet prompted me to install all the updates so I selected everything I needed and hit update. It seemed to be taking a while when I finally noticed everyone of them had failed to update and there was an error code. I rebooted the tablet and tried again and the same thing happened. I went online to see if there was a quick fix for it and there is nothing that quickly addresses the problem. Instead of messing with the updates, I tried to open an app already installed. I opened the preloaded Netflix app. It said \"must install the latest version before you can use it\". So I hit update and it won't update just like the rest of the programs. At this point the frustration was growing. I searched and searched and still have not been able to fix it. I don't know if this problem exists in all the ASUS ME400C tablets, but it happened to me. I would wait until the newer version comes out or just roll the dice and hope you don't have the same problem. Other than my problem with updates, the computer runs smooth and moves between programs fine. The convenience of a table for traveling is nice. I would highly recommend finding a good haptic pen with a finer end to it so you can easily take notes. Without it, taking notes is cumbersome and sloppy.", "Title": "ASUS Vivotab ME400C", "Date": "September 23, 2013"}, {"Author": "mrsncook \"mrsncook\"", "ReviewID": "R28R5VM63M2GME", "Overall": "2.0", "Content": "After reviewing several tablets as a gift for my husband, I settled on the Asus. I purchased a laptop several years ago and had a lot of success with it, so I thought I'd stick with a trusted brand.  Wrong!While the features are very nice, one major component is Windows. When we tried to install Windows, we were told it was only available to use in Asia. We called several times trying to figure out why units were being sold in America with only the 2013 Windows available to Asian clients. Asus just keeps saying, \"I'm sorry. Windows 2013 is only available in Asia.\" (Uh, yeah, thanks, but how about answering the question!)After much debate with no help, Asus told us our only option was to send the 2013 Asian copy back to them and wait for the 2010 American version. There was no attempt to compensate us for our inconvenience, and two weeks later we're still waiting for them to send the copy of Windows that they promised.My husband is very happy with the features that he is actually able to use. Unfortunately customer service stinks, and my husband isn't able to use a main feature on a tablet that we purchased mainly for that reason. Would I get an Asus product again?  Probably not. While some products are good, I need to know customer service will stand behind their products and help customers if there's an issue. Would I recommend Asus to others? Probably not. Again, while they have some nice products, this Windows problem and lack of customer service are real turn offs for me.", "Title": "Nice Concept", "Date": "September 16, 2013"}, {"Author": "REH", "ReviewID": "R3NOMNSNPNCPVV", "Overall": "5.0", "Content": "Makes a fine substitute for a Laptop for my use. Works great with the Poetic Case and Keyboard. (A high quality addition)IE favorites can be \"pinned\" to the \"Apps\" screen for easy access.", "Title": "Fits my requirements perfectly", "Date": "September 13, 2013"}, {"Author": "Rob", "ReviewID": "R35IDP4BUB96WW", "Overall": "5.0", "Content": "Given the price and functionality of this tablet, I have no complaints. The negative reviews tend to be from consummate contrarians. The picayune complaints are in no way instructive for those who are looking for relevant information prior to a purchase.", "Title": "ASUS and Windows 8 - A Great Combination", "Date": "September 11, 2013"}, {"Author": "Traycee Dewey \"Traycee\"", "ReviewID": "RBGOIPBTZSIZD", "Overall": "4.0", "Content": "I use this to replace my laptop.  Works great and does everything I need it to. I use it almost everyday.", "Title": "really like", "Date": "September 3, 2013"}, {"Author": "Tim Smith", "ReviewID": "R3R3QHXTO9D8IR", "Overall": "5.0", "Content": "This is nothing short of an amazing device.  This combines an iPad with all the functionality of a laptop.  I'm working remotely with a link to work desktop and files.  Flawless and no real speed difference.  I read reviews and studied the landscape for months.  this tablet fits every need.  Do look into the sleeve and keyboard.  It is a good investment.  Love this thing!!", "Title": "Awesome Device...don't believe all the negative", "Date": "August 31, 2013"}, {"Author": "TrainerSK", "ReviewID": "R2P5IJJDKT5DA5", "Overall": "5.0", "Content": "I have to say: \"WOW\"If you are sick of mobile web browsers and tablets that really limit you  in what to do, go for this one.Great for surfing, internet browsing, downloading movies and watch them on the plane and even Office 2013.Don't expect a desktop in tablet design though. The Intel Atom CPU is good for all the said things, but not to fully run a Windows 8 computer like a desktop.OUTSTANDING battery life!!!!!", "Title": "The first tablet that works like a desktopt!!!", "Date": "August 28, 2013"}, {"Author": "PK \"Pat\"", "ReviewID": "R3R2T0X9X0DPJ2", "Overall": "5.0", "Content": "So far it does exactly what it says on the tin. Having office 13 was just an added bonus. I use this thing for a lot of things when I'm out on the go and so far the signal strength for wireless hasn't been bad at all.", "Title": "Couldn't be happier", "Date": "August 13, 2013"}, {"Author": "Darryl", "ReviewID": "R1KBVJ6ZX18IB8", "Overall": "3.0", "Content": "This is a nice tablet, as I like Windows 8 tablets as opposed to Android tablets. Windows 8 has several APPS that are comparable to Android, and I can work on my excel spreadsheets on this tablet. I consider this tablet more of a \"grown up\" tablet. Kids tend to like Android because of the game APPS. One issue I have had is with the sound. Sometimes it works with certain APPS, sometimes it doesn't, and I have to reboot the tablet. A second issue I have is sometimes the tablet freezes. Because updates are installed in the background, the tablet freezes, and I have to reboot. After rebooting, the updates install and it acts normally again. This doesn't happen too often, but it's still a little annoying. Finally, the keyboard I purchased with the tablet causes it to freeze up from time to time, and again, I just do a reboot.I now try to make sure I just shut down the tablet entirely when I'm done with it. It seems to respond better when I do this. All in all, not bad if you like Windows 8 tablets. However, I would suggest that if you like Windows 8, just purchase a Surface, as I don't think it freezes up like the ASUS.", "Title": "Pretty Good Tablet", "Date": "July 19, 2013"}, {"Author": "mohan", "ReviewID": "R34JXBMQS0GPHL", "Overall": "3.0", "Content": "Have been using this tablet for almost 3 weeks now. Overall the tablet is great. Very light and fun to use. However the speakers are a big negative. You can barely use it for watching a movie or listening a song or to watch a YouTube video. Thee speakers just don't cut it. That's a big problem.Camera quality is very good.", "Title": "great tablet... but really bad speakers", "Date": "July 10, 2013"}, {"Author": "skyblu", "ReviewID": "RODN1BYV9RKUS", "Overall": "1.0", "Content": "I have always had Asus Device because they worked without any problems. Next, I've read a lot of positive comments about this device so I've decided to buy one. I used it just 4 hours because when I tried to recharge the tablet pc using the Usb Cable nothing happened. The issue is likely due to a software problem and not a hardware problem: Microsoft Windows 8 has some bugs about the acpi battery drivers. I've read a lot of topic in many forums in Internet about this bug. It is not easy to resolve by yourself.I've returned it immediately.", "Title": "the battery doesn't recharge - acpi battery drivers", "Date": "July 23, 2013"}, {"Author": "Marti Bohley", "ReviewID": "R19WI2IDKB3TSA", "Overall": "3.0", "Content": "I like this device, but it isn't love. I've had it for just over a year, and after initial issues installing office, it does everything I need it to. I bought it to take to school (college), and it see serves that purpose very well. I only really have two cons: the first one is the app store is limited (it's easy to get around that if you just use the device more like a computer). My number one issue is the battery life. I don't feel like I get as much as it claims I should, it takes a really long time to charge and it can't be used while charging.", "Title": "decent tablet", "Date": "March 2, 2014"}, {"Author": "Pat", "ReviewID": "R1X9OLHIRSIUQ1", "Overall": "1.0", "Content": "It sais it has Microsoft Office loaded on it but they send you a product Key and the customer has to load it.My product Key did not work.support  sucksAsus teck told me to call MicrosoftI am not the R&D; for Asus", "Title": "Don't  purchase", "Date": "December 14, 2013"}, {"Author": "Xavier", "ReviewID": "RC8MAQHH83E5Z", "Overall": "1.0", "Content": "First let me say I'm an IT person by profession so looking for answers is what I do for a living but this is the tip of the iceberg.bought for use when I started chemo, Office doesn't work says it is unlicensed but there is no key since it came preinstalled,continuously locks up IE or Chrome constantly not responding, didn't notice any of this till after the first 30 days so now I'm stuck with a 400+ tablet that is worthless.Tried to find out how to factory reset and have had no luck, one site says press F9 during boot (ha ha ha) there is no F9 since it is a virtual keyboard only available after it boots.I honestly thought Amazon would stand behind something it sells and fulfills but no dice.", "Title": "ASUS Tab Stay away", "Date": "December 10, 2013"}, {"Author": "Dahlia A. Brown", "ReviewID": "R1V638NE8SVLUW", "Overall": "5.0", "Content": "my son high school is transitioning to computers in the class this august/2013 school year. Ill see how it goes!", "Title": "great product  so far", "Date": "August 11, 2013"}, {"Author": "ASUSisBAD", "ReviewID": "R3JAX3FJ4TH3UD", "Overall": "1.0", "Content": "Purchased a $300 ASUS tablet and only 7 months later it quit taking a charge. I called tech support and after holding this button and that button did it take a charge again - for about a month. Now, it quit working completely. It isn't even a year old - ASUS will not fix it without a fee. $300 piece of junk.", "Title": "Defective Product and No Help from ASUS", "Date": "November 1, 2013"}, {"Author": "Travis S.", "ReviewID": "R37JY08Z67UG8R", "Overall": "4.0", "Content": "I Didn't Buy This Off Amazon But That Shouldn't Matter.Purchased For Every Day Business.Very Clean Look/Light Weight!Perfect For Someone Who Travels And Has A Uses for clouding With All There Computers For Office Products.To End My Review, I was Really Impressed With The Overall Look,Feel,Design, And Overall General Functions That Android And Apple Products Don't Offer.Don't Get Me Wrong I Have Samsung S 3, Samsung 7.2 Tablet All My TV's Are Samsung.I Really Enjoy Samsung Products!But I WANTED A TABLET THAT I COULD USE WINDOWS 8 AND OFFICE PRODUCTS WITH CLOUDING TO MY OFFICE COMPUTER AND HOME.Good Buy", "Title": "Good Windows Tablet/ Good Price.", "Date": "June 25, 2013"}, {"Author": "Michael Lee", "ReviewID": "RY4YYGYZNIUU2", "Overall": "1.0", "Content": "Do NOT buy this thing.  It is an absolute piece of garbage.  My experience thus far: It won't stay connected to the internet although my laptop and desktops all do.  It came with no activation code for Microsoft Office.  It is extremely slow, sluggish.  Its interface simply stinks....I'm not a huge fan of Windows 8 to begin with although I have it on my laptop.  But this thing makes the interface even worse.  I am a software developer by profession so I know good and bad when I see it.  This thing just stinks.  Horrible doesn't being to describe it.", "Title": "Absolute garbage", "Date": "April 13, 2014"}, {"Author": "Viviana Ortiz", "ReviewID": "R30R3F2E8X0DXQ", "Overall": "1.0", "Content": "I had lot of problems trying to activate the Windows 8.. According to the description It should to have activate the version. but It gives me lot of errors and I called the support of Assus, Windows and nobody help me. So for now the tablet does not have the version of Windows 8  activated..  It was a gift and my friend was very dissapointed and I too of course..", "Title": "Asus Vivotab Smart is cool but I could not activate the version of Windows 8", "Date": "September 6, 2013"}, {"Author": "Maryann Morabito", "ReviewID": "R1LL1WEYBBBB5K", "Overall": "2.0", "Content": "Somehow it gave me the feeling that Microsoft was not ready for the tablet. However, when I walked into Best Buy, I so so many Microsoft tablets that it was not funny. Perhaps I was not ready for the surprise, or perhaps it was just this particular tablet. I've gone back to Android and am experimenting with a chromebook. I must say, I am very impressed with android performance as well as apps.", "Title": "There was just something about this", "Date": "October 16, 2013"}, {"Author": "Luke K.", "ReviewID": "R2T8RYBDJXG09G", "Overall": "2.0", "Content": "The Asus Vivotab Smart is a great idea,....on paper.  I can't fault Asus on this one as much as I fault Microsoft.  I applaud Microsoft for their forward method of thinking with Windows 8, it just needs A LOT of work and time to mature.What's the main problem?Lets start with touch optimization.  When it comes to Windows there are FAR too many applications and programs that require a mouse and keyboard to navigate through and operate comfortably.  On Android tablets, EVERYTHING is touch optimized.  Android and Apple have spent years perfecting their mobile OS devices and have battled to be at where they are right now.  Microsoft just saw a big piece of \"financial\" pie and thought, why not us?  They have A LOT of work to do.  Once you navigate outside the Start Screen, this device is a nightmare to use.  That is pretty much the jist of it.  Windows 8 is not a horrendous operating system, it just needs a mouse and keyboard, like Windows always has been.  If Microsoft wants to succeed in the world of mobile devices like tablets and phones, they need to develop a seperate OS that is 100% optimized for touch.  They keep pushing this whole \"universal\" thing with the Windows 8 format, on desktops, laptops, tablets, and phones.  When it really only works well on the Start Screen for your fingers and everywhere else with the mouse and keyboard.", "Title": "A Great Idea,....On Paper.", "Date": "November 15, 2013"}, {"Author": "G. WALTER \"Gary19606\"", "ReviewID": "R2F66N48G5C6XX", "Overall": "3.0", "Content": "I ended up sending this back. I was not satisfied with the performance, I have an ASUS Laptop and it works fine.", "Title": "Not the greatest.", "Date": "March 18, 2014"}, {"Author": "Richard Boisvert", "ReviewID": "R2Y2USYDFP3YHA", "Overall": "5.0", "Content": "after purchasing this and other items I read the horror stories about LaserShip and expected my order to be way late, to my surprise it arrived at exactly 12 noon on the day promissed.", "Title": "LaserShip", "Date": "August 18, 2013"}, {"Author": "Perry Stevens", "ReviewID": "RETSWQR172AEQ", "Overall": "1.0", "Content": "Slow processor, couldn't get it to work right, no phone support from Asus. I returned it. This machine sucks! I higj=ly recommend NOT buying this!", "Title": "Piece of CRAP!", "Date": "August 17, 2013"}, {"Author": "Lee", "ReviewID": "REI2SVFO0ICJU", "Overall": "1.0", "Content": "system is way too slow. graphics and touch screen response is horrible. definitely the last time I consider an Asus product.", "Title": "not worth it", "Date": "July 18, 2013"}, {"Author": "diladamz \"Duley\"", "ReviewID": "R13O66XSEPCU9H", "Overall": "1.0", "Content": "I watched a video on Youtube where the author had a home video (on mediaplayer) a movie ( on the video app) and a youtube video (on IE) running at the same time. It was impressive. I tried to run youtube on IE, it stopped, but the audio continued (this appeared to be an IE bug, remedied with Chrome) I then tried media player with a home video, it stopped/started every few seconds, with an error flag, notifying me it has restored the video. The movie on the video app, just stopped within 2 minutes. I tried a different app, and my movie ran almost 5 minutes and locked up the tablet.My wi-fi connection would cut off, and I'd have to reconnect again and again and again. Win 8 isn't like any user interface I've ever used, it restricts what you can/cannot do. I spent more time looking for help to fix problems with this ASUS on my desktop PC than I did using the tablet. I was considering replacing this tab with a laptop or notebook, but they have win 8 installed as well, so I'll stick it out with my old laptop which has win 7 and plays ALL my videos and streams video from the web with no problems. I tried the help sites, but it was mainly bloggers who had found solutions, like using Chrome instead of IE for online videos. Overall a very disappointing product. I know some people love win 8, but my experience was blank screens and tiles that did very little for me. One blogger suggested that all the drivers be deleted and reloaded but didn't explain how to delete the drivers.", "Title": "The video drivers are useless", "Date": "July 2, 2013"}, {"Author": "Alexander B.", "ReviewID": "R1U9V72O2CO4B9", "Overall": "1.0", "Content": "I was so excited about this, and it was a beautiful piece with such great reviews and an excellent display with awesome features. But once I got it, it started crashing every 4 hours the next day, whether I was using it or not. The transleeve keyboard took me forever to connect. Once I did, it worked fine, but the cover that folds weird, was not only missing a magnet in one corner, but there was too little magnetism between the tablet and the sleeve, it wouldn't stay on at all. Once it started crashing, I looked it up and found that it was an EXTREMELY common problem with ASUS Vivotabs, but the comments are hidden in initial searches. Starting school in the next two days, I quick returned it, and reluctantly went with the iPad. I had never seen one crash before and when I got it, it took me by surprise. I take great notes on it now, its app store is WAY more developed, and it NEVER does anything its not suppose to. I love windows, the layout, the functions. But apple proved to be more reliable. And in this busy day and age, that's what counts for me.", "Title": "I wanted Windows 8, but Apple proved to be more reliable", "Date": "September 7, 2013"}, {"Author": "Scott Jackson", "ReviewID": "R3QNEN7ZHERMDB", "Overall": "1.0", "Content": "I purchased this tablet in a local store in june of 2013. It was supposed to come with office H&S; but it wasnt in the package. so i returned it (the day after i got it) and got the full product as advertised. Then that tablet's ssd crapped out on me in 2 days. so i returned that one and got a brand new one. The shell on my now 3rd tablet did seem slightly loose in 1 or 2 places but that didnt bother me. Then all of a sudden in september the screen started going wonky on me. In the upper right hand side of the device there must be something loose because if any sort of pressure is applied to the device on that side (it can even be sitting flat on a table or being held in my hand) and the brightness briefly increases and then decreases. Now i know some people will say it is the auto brightness but it isnt because i turned that off. So i would highly recommend NOT GETTING THIS!!! Save yourself the troubles and get a droid tablet or one of those demonic ipads.", "Title": "So many problems.", "Date": "November 18, 2013"}, {"Author": "g browd", "ReviewID": "R3Q5G3R2YVJLR5", "Overall": "1.0", "Content": "I would not recommend purchasing this item.  I can receive e-mails from it, but all email sent are returned and I have not been able to access my Kendall app.  I contacted Kendall about it, they said I would have to contact Amazon.  When contacting Amazon, I cannot make their \"experts\" understand what I am trying to do.  They have given me directions on everything but getting it set up to purchase books.", "Title": "No help from Amazon!", "Date": "October 28, 2013"}, {"Author": "juan", "ReviewID": "R2TGU8E300P7ZY", "Overall": "2.0", "Content": "the packaging looks nice, to pull it out of the box. The unit itself is nice, with a widescreen for movies. The screen isnt as bright as an ipad.OFFICE 2013 IS NOT INSTALLED. the unit came with office 2010 installed, and not licensed. The license was in the box, but it is for 2013. I have not resolved this issue yet. I will update if resolved. after expediting the shipping for a lovely fee, I cant use it. Amazon said to return it and get another one, asus said they would mail me the right license. I'm returning it and going to best buy.Windows 8 - I really don't like windows 8 - its for idiots, and is still too complicated for idiots to use, so it just makes it irritating for people like me. If you want somethign simple, get an ipad.Registration - for some reason, the machine doesnt know what it is, so you have to go through a list of like 40 devices and select something like eee pad. less irirtating but still silly is one question that made no sense, about being the person people come to for C3 devices. I dont even know what that it.On-screen keyboard - it's not the greatest. you only have letters, and you have to hit the number key to get to the number pad. this gets annoying when entering the license and serial numbers - k4j6s6g3d9 there is a ton of switching back and forth.Get the Transleeve keyboard - it is a lot easier to use than the on screen keyboard, and it has a cover for the screen, it doubles as a stand to prop the pad up.", "Title": "OFFICE LICENSE DOES NOT WORK", "Date": "July 2, 2013"}, {"Author": "S PATE", "ReviewID": "R1QOAZEJLM16WO", "Overall": "1.0", "Content": "If I could give less than 1star I would. This has been one headache after another since I took it out of the box. During setup it locked me out because it came up with a Microsoft password linked to my email address that I was completely unaware of (and not the one I currently use), and I couldn't get back in until I bought a thing to convert the mini USB to a regular USB so I could set up a new password. Now I can't get it to do the upgrade from Windows 8 to 8.1, and I can't even begin to tell you how many things are wrong with 8. I've heard that the bugs are fixed in 8.1, but I can't even get this thing to run update without stalling and running the battery down. Definitely a DONT BUY!!!!", "Title": "Not even worth a 1 star rating HATE IT, HATE IT, HATE IT", "Date": "November 23, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00CY9Q8AQ", "Features": null, "ImgURL": null, "Name": null}}