{"Reviews": [{"Title": "DO NOT BUY ANYTHING ZEKI", "Author": "Suzanne S.", "ReviewID": "R28BL9HJRIRB1Z", "Overall": "1.0", "Content": "Not only is this the most disappointing product EVER, the customer service – when you can finally contact them – is the absolute WORST! Many of the units are defective and they know of the defects, yet are unwilling to fix the problems. They want to charge more than half the purchase price to fix the defect if you send it in to them and pay shipping both ways. This is a premier RIP OFF! I thought it would be a good  starter tablet for my grandkids. NOT SODO NOT DEAL WITH THIS COMPANY!!!!", "Date": "December 18, 2013"}, {"Title": "Got it free and still feel cheated!", "Author": "Sam mcdonald", "ReviewID": "R165IEC30X023U", "Overall": "1.0", "Content": "I didn't need a tablet. I have a kindle fire with which I'm very pleased. My wife has an Ipad. For a service award my company  sent me a catalog to pick an  item and since it was mostly junk I didn't want we decided it wouldn't hurt to have a backup tablet. I should have picked the  cheap pen and pencil set. Charged it,set it up and fiddled with it some, Sat it down for a couple of weeks and now it won't turn on at all. The manual, such as it is, said to hold the start button in. I did and the button fell into the hole and won't come out. Into the trash. I won't bother to contact them because even for the short time it worked it was junk. I don't want another, even for free.", "Date": "May 1, 2014"}, {"Title": "WATE OF MONEY!", "Author": "Johanna MacLean", "ReviewID": "R19QK1VWLFVHPQ", "Overall": "1.0", "Content": "TIhis stupid tablet has frozen on me about three times. It has shut down on me for no reason twice. It's laggy. I had to hold down the power button for it to shut down and now as i type this, i can't even get it to leave the opening \"android\" page after the ZEKI welcome sign. It's been going on for about ten minutes and i don't know what to do. I have already reset the tiny button that's inside and it's doing the same exact thing.This tablet is a piece of crap. DON'T BUY IT!!! FIND SOMETHING ELSE BETTER TO BUY WITH YOUR MONEY!", "Date": "January 3, 2014"}, {"Title": "nothin wrong with them", "Author": "michelle", "ReviewID": "R3LWZV5KWJXIPF", "Overall": "4.0", "Content": "There is nothing wrong with customer service when you call, they handle all calls appropriately and if you have to send one back they ship you a new as soon as they receive the defective one no questions asked. It ships quickly. Great tablet for the price. My kids love it. I even bought an extra one from the factory and never took it out of the box. Decided to sell it.It's on amazon to sell right now.", "Date": "February 22, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CTSY3KO"}}