{"Reviews": [{"Author": "Michael Schneider", "ReviewID": "R2MW3MQSLM5ARU", "Overall": "1.0", "Content": "Borke after 2 months of use (wouldn't recharge). Called for repair/troubleshooting and they instead shipped another one to me. They sent a refurbished one to me; sending it back as well since I didn't purchase a refurbished one. Crap product and crap service from Amazon!", "Title": "Broke After 2 Months", "Date": "February 21, 2014"}, {"Author": "Christopher John Murphy", "ReviewID": "RCELHOVRVYHW", "Overall": "1.0", "Content": "I bought a Kindle FIre HDX 7'' for the audio book function, and all worked well for about a month, then the touch screen became slow and unresponsive and very hard to operate. It is very frustrating as I live and work in China and Amazon can only repair and ship it within the USA.  On the other hand, it comes with a one-year warranty.  Its a sleek and cool device with awesome potential but I dont like the touch screen malfunctioning so soon. I was advised by Amazon help to reboot it by holding the on/off button down for 20 seconds.  Hope it works, but I have never had an electronic device with a touch screen that  reacted like this and think I will keep having problems until I get back to the states and have it repaired!  Damn!", "Title": "Kindle Touch Screen is Slow and Unresponsive", "Date": "February 3, 2014"}, {"Author": "T. Davis", "ReviewID": "R3YMVOJ1DABNK", "Overall": "5.0", "Content": "My family purchased this tablet for my aging grandmother, and she would only get a tablet once she found out that someone could help her 24/7 (the mayday feature). So we bought it, and watched her call for help the first time and it worked perfectly. The person was polite, and (oh so) patient with my grandmother, showing her how to use it on her screen. I couldn't recommend that feature enough.As someone who works in IT, and an avid Android user, for the device itself: 4.5 Stars/5.With the assumption that you are OK with Amazon's closed wall of apps, and are a Prime member, here's my review:PROS:-Blazing fast. Stupid fast. (I owe a Nexus 7, this is faster)-Simple interface.-Everything works. No wifi-issues, no screen issue, it works as advertised.-The Mayday feature. It just works. And someone responds in under 30 seconds.-Buying stuff (apps, books, mags) is super easy, and is presented nicely.CONS:-Customization: little to none. Device settings are limited, and while I get the design philosophy of simple, a little too simple for my android-tinted desires to control my device.-Interface, while simple, is non-linear. Can be confusing at times. Like the tabs up top, and then the side tabs go to (sorta) the same place, and then the different media stores within the tabs, and from there... I don't even know, it gets confusing.-Not as many apps as Play Store/iOS App store, not really a complaint more of a wish for more of Play Store's apps. I knew this going in.", "Title": "Amazing Purchase for grandmother, Mayday function works like a charm", "Date": "December 22, 2013"}, {"Author": "C. Barrick", "ReviewID": "RGZIESBG5QRDO", "Overall": "2.0", "Content": "The HDX 7\" is a great tablet that has a fatal flaw.  There is a purple haze that creates a 1/4\" border around the screen.  If you play games or watch movies, it is not noticeable.  However, if you read books or web pages, then it is very noticeable.  It is distracting, unpleasant to view, and bothersome.  The previous generation HD does not suffer this problem and is a far superior reader.I spoke with tech support who was courteous and friendly (as always).  They said this was a known issue and it was clear there would be no replacement.  Sadly, I had to return the HDX.I am very disappointed that Amazon shipped a Kindle reader that is, ironically, a poor reader.", "Title": "Good tablet with a fatal flaw - purple haze problem", "Date": "October 20, 2013"}, {"Author": "J. Groveman \"jgaepi\"", "ReviewID": "RJVJDDNYW2PC3", "Overall": "5.0", "Content": "This is my first ever Amazon review although I have bought hundreds of products before.I really love this product thus far. Seemed a little glitchy at first start up (initial software update) but smooth sailing since then. Bright, colorful, fast, easy to use, etc.I had an Ipad 2 and sold it on craiglist after 10 months. Meh. Big, clunky. You needed 3 hands to use it. I bought each of my kids an Ipad Mini original. Expensive and nothing special. This is small and light and affordable. Completely different product.Various reviews complain how limited the apps are. I mean if 800k apps will guarantee your productivity, more power to you. I keep it to about 50 apps and all are important. Only thing lacking is no Facetime for apple user friends and family but no biggie.I strongly considered the Nexus 7. I have friends who love the original. The shape is just a little off and weird. It was a toss up. Happy about my Kindle choice.My coworkers have gawked at it all day. I wish the LTE option under ATT was cheaper so I would have bought that option but probably wouldn't have really gotten my money's worth.Other than that fancy Apple logo, this is a much smarter bet. Toss up with the Nexus 7 but this shape is better. Can't see why you would regret it.Lastly, I read a little bit with the blue ring glow against the white background (making headlines with the blue glow) but I don't see what the issue is. So minor not even worth the nitpick.Enjoy your new Kindle Fire HDX!", "Title": "First Ever Review - Love It", "Date": "October 25, 2013"}, {"Author": "Phuong Ha", "ReviewID": "R2JUK2I68311BW", "Overall": "5.0", "Content": "Sorry for the cheesy Survivor reference. But the search is really over. After weeks of reading, waiting and wanting, I finally came to a conclusion that not only have allowed me to sleep better but it also has allowed my wife to search better, surf better, and feel better.So, here is the low-down on the research I did prior to finally buying the Kindle Fire HDX 7\" vs. the iPad Mini, Samsung Galaxy Tab 3 7\" or 8\" or 10.1, the Samsung Note 8\" or 10.1, the Nexus 7\", and the Kindle Fire HDX 8.9.First the iPad Mini. She has the iPhone and I did before trading for a Samsung Note 3. We have tons and tons of apps bought from iTunes. But, truth be told, the pricing made me crazy. You get old technology for cheaper than the rest (last year's iPad mini) with lower resolution but cheap. But cheap to Apple is almost the same as the other tablets. If you wanted the new A7 chip then you had to pay for it with your first born. I was tired of being brain-washed into the Apple Cult so I opted out from the iPad Mini. Look and feel was okay but you needed to buy too many accessories to make it feel safe and secure and yes, cool. So no to Apple.Second, the Samsung Tab 3 and Note tablets. After switching to the Note 3 phone, I loved the pen and the many options Samsung added to a phone with an awesome screen resolution and size. So it was natural that I looked at the Samsungs as an option. But upon close inspection here's what I found.All are great screen resolutions, look and feel. All have access to the Android App store so that's no problem. In fact, most apps that cost me rent money on iTunes, was free in the Android Store. But, here's the deciding factor: price compared to processor speed. If you wanted a good price, you had to settle with last year's model or a not-so-up-to-date model. This went for the Note tablets as well. So, in order to keep up with the Kindle Fire HDX 7\" or 8.9\" you had only the Samsung Galaxy Note 10.1 2014 version but that meant over the $500 mark. All the other Samsung models either ran off of the older dual-core processors at 1.5 GHz or you could fork over the money for the faster quad-core 1.9 GHz. So no to Samsung.Then of course there was the newly printed Nexus 7 but again, the processor speed was 1.5 GHz quad-core Snapdragon Adreno 320 GPU. Fast but not the fastest one out there. Liked the feel and look of it but really, why use not put in the best processor and make it outstanding. But, I think it was to keep the price competitive. This was the closes one I would have gotten next to the Kindle Fire HDX 7\" or 8.9\". So no to the Nexus, sorry Google.Finally, it came down to the 7\" and the 8.9\". Considering I was getting for my wife, who has smaller hands, wants a tablet but one that feels snug in her hand without giving up screen size. I decided on the HDX 7\". If I would have gotten this thing for me, then I would have again gone with the Fire HDX 8.9\" because it has the Snapdragon Adreno 330 GPU 2.2 GHZ quad-core meaning that it has the fastest processor out there that will eventually last you the longest when it comes to technology.It basically boils down to the fact that technology now is at the speed of quarterly sells. They have to make products that can be introduced according to marketplace sells and holidays. Each new lineup will have a faster and slimmer look.I decided on the Kindle Fire HDX for 3 main reasons: 1) the processor speed is the fastest one I could find. It will last for awhile. It will keep up with everything we throw at it. 2) Price was a major deciding factor. But it was decided eventually on Cyber Monday when I bounce on it for the extra $50 bucks off at the lower price of $179.00. For what you get relative to the price, no doubt this was a no brainer. 3) the look and feel. The rubber back feels really nice and has a soft yet safe feel to it. You don't feel like it's going to drop out of your hands. When holding it from either landscape or portrait views it still feels nice. It has a nice size edge so your thumbs can still grip the tablet with interfering with any open apps. The speed is super fast and responsive. And with Google Gmail integration, again, a no brainer.Overall, truly an awesome tablet. Sorry for the long review. But, after doing so much research on a tablet, I figure I would pass it on.", "Title": "How Can I Convince You, What You See is Real. The Search is Over, You were with me all the while...", "Date": "December 6, 2013"}, {"Author": "Zachary Samuels \"Zachary Samuels\"", "ReviewID": "RLZBNAURVKQAA", "Overall": "5.0", "Content": "My wife has an ipad 2 and I was a little skeptical about buying a kindle which is like half the overall surface size... OMG! I'm so glad I did... the screen is beautiful and works GREAT! wow guys, this thing is stunning... VERY fast, picks up wifi signal in deeper range than my wife (upstairs I get half signal, she gets one little bar)... this thing is awesome... PLUS your amazon cloud items are automatically viewable on your device! it's great.", "Title": "This thing is AWESOME!", "Date": "October 30, 2013"}, {"Author": "L. Velarde", "ReviewID": "R19DLXE9JVTM5N", "Overall": "5.0", "Content": "I was looking for a small tablet to watch movies, read magazines, and use in the kitchen to hold my recipes (via an app that will sync my recipes from my laptop).  I also have a toddler who might occasionally use it as he gets older and I love how Free Time lets me shut down the device so he can only see and access the apps I want him to use.So far I'm reading two magazines on it and love all the little extras.  It's definitely lightweight, looks gorgeous, and was way cheaper than an iPad mini when upgrading memory.  It won't replace my Kindle PaperWhite for book reading, but when I want to dive into National Geographic's gorgeous photos or make pumpkin bread, it's perfect!", "Title": "Perfect for me!", "Date": "October 21, 2013"}, {"Author": "Jason Strauss", "ReviewID": "R3NNWNVIZAD5JZ", "Overall": "4.0", "Content": "This was a gift for my daughter.  She loves it and has read many books both from the local library downloads and through Amazon.  I wish there were better internet parental controls.  That is the main area it is lacking.", "Title": "Kindle FIre", "Date": "April 15, 2014"}, {"Author": "T. J.", "ReviewID": "RU5PHJM7T9Q1A", "Overall": "4.0", "Content": "I purchased 2 of these for kids, and overall they met my expectations.  I also have an iPad 2 and iPad Mini, and the usability and flexibility isn't quite as good.  With that said, the Fire syncs with any music or movies purchased from Amazon which is cool.  I have found the parental control to not work well and just turned it off & monitor usage the old-fashioned way.  I used \"Mayday\" once, and it worked as Amazon advertises it.", "Title": "Good not Great", "Date": "April 14, 2014"}, {"Author": "Barbara Winningham", "ReviewID": "R1QLG4X1N7BKUR", "Overall": "4.0", "Content": "Love the Kindle fire.  However, I bought this for my grandkids and it doesn't hold as many videos and such as we would like. Other than that it's GREAT!!!", "Title": "Get 32 GB if you can afford it!", "Date": "April 12, 2014"}, {"Author": "kidsdogscats \"Mother of boys\"", "ReviewID": "R2MKJ2VMXT2GJP", "Overall": "3.0", "Content": "This device was very easy to set up out of the box. I use it primarily for email, web browsing, reading and watching videos. The reason I'm giving it just 3 stars is due to its unreliable WiFi connectivity. Our home has a new router with a repeater upstairs. Other devices connect throughout the home, including Apple products and a Motorola phone. The kindle regularly drops.the WiFi however, even when it says the signal is \"excellent\". I'm writing this review on the kindle HDX, and had to move 10 feet down the hallway and sit on the floor to keep the WiFi from disconnecting. A search online tells me I'm far from the only person having this issue. Unfortunately the window for returning the device has closed. I love how the kindle connects with prime streaming, and I hope this issue is resolved in an update soon.", "Title": "Has it all except reliable wifi connectivity", "Date": "April 12, 2014"}, {"Author": "Tracy", "ReviewID": "R25QC3PG8LG5PC", "Overall": "5.0", "Content": "i like to mirror it with my fire tv, it works good. i have a kindle fire hd also. i love all of amazon products.", "Title": "i love it", "Date": "April 12, 2014"}, {"Author": "Silvia Lada", "ReviewID": "R361N0I2SCVK9Q", "Overall": "5.0", "Content": "I love my Kindle Fire HDX! It is so much faster than my original Kindle Fire and the picture quality is excellent. I like the way it is easy to use and the slide of your finger can get you to where you want to navigate. The video on Amazon of the  Kindle Fire HDX shows it all. My daughter liked mine so much she went and ordered one too. This Kindle Fire is so much lighter and jumps on the wifi quickly from work to home so it is always traveling with me. I got the special offers and I don't mind that at all, usually I am checking some of them out. I paired mine with the origami case which I really like too. Still keeping my original Kindle Fire, I use it to stream Pandora while I get ready for work to save my battery time on the HDX, also good for when the battery runs out while I am in the middle of a good story I can switch Kindles. Speaking of the battery on the Kindle HDX, it seemed to run out quickly at first but now that I have had it for a while and I always it seems to not run out as fast. Well I am  very pleased with my Kindle Fire HDX!", "Title": "Goes where I go", "Date": "April 12, 2014"}, {"Author": "Larry /Carolyn Freshour", "ReviewID": "R1G7YJEJ7YC3T7", "Overall": "5.0", "Content": "Very sharp pictures, lightening fast connections, light weight, the Swype type keyboard and the live help feature is awesome. Quite an improvement over the earlier models.", "Title": "Very nice", "Date": "April 12, 2014"}, {"Author": "Cheriboo", "ReviewID": "R3BKS3MPC1BGOS", "Overall": "5.0", "Content": "I check out books from libraries - haven't bought a book yet,I watch movies and shows on NETFLIX - this is the main reason I bought the Kindle Fire, I check my email(if you have new email, it tells you - you don't have to log in every time, I listen to music, I play games, I search the web.", "Title": "Kindle Fire", "Date": "April 12, 2014"}, {"Author": "Shannon Janson", "ReviewID": "R3MLNJBLNEOV2X", "Overall": "5.0", "Content": "The screen is easy to view.  I like the new volume switch.  I really have no complaints about the Kindle Fire HDX.", "Title": "this is a great devce!", "Date": "April 11, 2014"}, {"Author": "Bryce Wells", "ReviewID": "R2I4AMP4AU6TO1", "Overall": "5.0", "Content": "Love the speed and the brighter screen.  It still has the same great speakers, but the controls are in a better more useable place. I liked the mini HDMI plugin port on the old Kindle.", "Title": "New brighter Kindle", "Date": "April 11, 2014"}, {"Author": "Amazon Customer \"blackcat72\"", "ReviewID": "RL1QC19U1L59N", "Overall": "2.0", "Content": "Everything else, I love about this Kindle. The size, screen, resolution..the weight, the sound...BUT..battery life drains even when not in use. It  goes down about 30-40% the first day, would be totally dead by the 3rd day. As opposed to my other gadgets..re: iPad, Samsung galaxy or Asus transformer that I charge MAYBE once a week even when used, the kindle hdx needs to be charged every other day. I have turned off Bluetooth, wifi, dimmed the screen (which I never have to do with my other gadgets) but still the battery goes out.Very disappointing...and I was waiting for this and bought it as soon as it came out. :(", "Title": "Battery drains", "Date": "April 10, 2014"}, {"Author": "Maxima", "ReviewID": "R1STF651JB6F8L", "Overall": "4.0", "Content": "I am not going into a long detail review of the Kindle Fire HDX 7\", their are plenty to read already. What I will say is that I own both the HDX and the HD. I really like the HDX better for the Speed of the processor, the Buttons are a BIG improvement. You can actually feel the the buttons for the volume and to turn it off which is fantastic compared to the HD. I actually painted dots on the HD to be able to tell where the buttons were and what they were for. With the HDX you feel 2 buttons on one side and one on the other side to turn it off. The Graphic's are better on the HDX but unless you have the HDX and the HD side by side you may not notice. HDX is thinner and lighter then the HD and that is noticeable. Now for the con's I have found so far..I have found for certain music my HD has better sound and volume, other music it is reversed. Which that could be a big deal for some and not so much for others.  I have also found a few apps that will work properly on the HD that will not work on the HDX, but so far not many. All in all I like my HDX better and I notice I am not using my HD any more which means it is time to sell the HD.", "Title": "Nice, but the speakers are questionable.", "Date": "April 10, 2014"}, {"Author": "Debra Kay", "ReviewID": "R137LDWN03IOSC", "Overall": "4.0", "Content": "This is lighter and much easier to hold.  I like where the power button and volume buttons are.  I am disappointment that I cannot get more of the apps that I get with my Samsung Galaxy but this is great for movies and such.  Picture is so much nicer now.", "Title": "Much better than old Kindle.", "Date": "April 9, 2014"}, {"Author": "Laura Lea Evans", "ReviewID": "R1ZABS8V57ED3B", "Overall": "5.0", "Content": "I bought the first Kindle Fire the month it debuted a few years ago and have enjoyed it ever since as primarily an eBook reader device. When the HDX model came out late last year, I was interested in some of the features particularly the stated improved screen, not that there were complaints about its predecessor's readability! When amazon offered the HDX on an  incentive payment plan, I couldn't resist so clicked the purchase. It arrived a day earlier than advertised, an auspicious beginning, and was packed in recyclable cardboard which pleased this Tree Hugger greatly. The minimalist box for the device was likewise showing consideration for the environment which still affording a design tour d' force. a simple decorative sleeve houses the box in which the Kindle nestles along with the power cord and adapter, plus a small, plain set up sheet for the beginner.This edition of the Kindle Fire is noticeably thinner. I did have some difficulty plugging the cord into it as it goes in at an angle, whereas the other model was a straight shot. Finding the power button, changed from the bottom next to the charging cord to the back of the device, was likewise confounding briefly but other than that, I'd have to say... it was all a piece of cake, and of course the amazon cloud had already registered this newest Kindle along with preparing to download all the eBooks etc. Couldn't be much easier than that.In the case of the Kindle Fire HDX, I'd have to say, it is truly a refined device in all regards and justifies the purchase. I strongly recommend getting one of the Kindle eBooks on the Fire HDX to speed up the use of your new device. I found it enormously beneficial in both cases, throughout time. I am currently using the Kindle Fire HDX & HD Complete Guidebook published March, 2014.As a further satisfied purchaser of the device, may I state that while I am a bonafide Apple User, I still prefer the Kindle Fire (HDX) for eBooks and definitely for the value that amazon provides in pricing them.", "Title": "A Surprising improvement to the Kindle Fire HDX", "Date": "April 9, 2014"}, {"Author": "Brad Shea", "ReviewID": "RF92BO14OA20C", "Overall": "5.0", "Content": "I have FIVE Kindle Fires in this house.  Starting with 1 original KF, 2 gen 2 basic KF's , 2nd Gen KF HD, and now a 3rd Gen KF HDX.  Each release of the platform has brought improvements, and yet the interface still retains the simplicity that makes it safe to recommend to your technophobic grandmother while still enjoying it if you are a true geek.  Granted you can't geek out on this device - but sometimes you need to relax, and this device gives great access to all of the Amazon content (video's, books, magazines, apps, etc.)Is it worth upgrading?  That depends - from a gen1 or gen2 standard KF - absolutely.  From a gen 2 HD KF - I'm not sure.  The screen is better, the processors are faster, the unit is lighter, but I think I wouldn't rush to change from the older KF HD unless there was a person waiting in the wings for an upgrade from their older standard KF... like at my house!", "Title": "Faster, brighter, lighter, better!", "Date": "April 8, 2014"}, {"Author": "Deborah McGraw", "ReviewID": "RZWRTGEPKRLOY", "Overall": "4.0", "Content": "Not only am I delighted with the Fire Kindle HDX 7 but I keep finding additional benefits.  I wanted something to read email, look at Facebook, watch videos, and most importantly read.  It is very good at all of these.At first, I didn't like the look of such things as Facebook but when I learned that the default is the mobile version and I could get the regular version by removing the \"m\" from the URL for Facebook, it opened just like on my lap top.  This is true of other apps as well.  I love reading on it: it is fairly comfortable to hold, not much heavier than my old E-reader but it is brilliant in color and the fonts are amazingly sharp. My eyesight is pretty bad so it is important to me how readible it is.I bougt a USB cord and can hook it up to my big television and once I choose the other input as the source on my television menu, I can watch anything I see on the Kindle on the TV.I do wish the battery lasted longer.  I like it so much that I have it with me everywhere (it fits easily in my purse) and turned on constantly.  This means I have to charge it sometimes twice in one day.  The instructions say to let it completely discharge at least once a month and I try to do that but I like using it so often, it is hard to let that happen.I just found out there are several apps compatible with MS Office for writing and editing documents.  I haven't decided which of them to select but once I do, this little gadget is just about as near to a lap top as you can get.I highly recommend it and only gave it 4 stars because I wish the battery lasted longer.  By the way, I am 72 so if I can use it, anyone can.", "Title": "Nearest tablet to a laptop for me", "Date": "April 8, 2014"}, {"Author": "shopper32", "ReviewID": "R11DTN73E6KUUD", "Overall": "5.0", "Content": "I have had my Kindle fire for several months. I recently traveled out of the country for several days and would have limited internet access. I downloaded some programs to watch off of Amazon Prime to watch if I wanted too. I also downloaded some books to read. The kindle worked well and is a nice size travel with. I also like that if I had wifi access I could email and surf. I have been pleased with my Kindle for the 6 months I have had it.", "Title": "Worked well", "Date": "April 7, 2014"}, {"Author": "ggordon", "ReviewID": "R3TSX3C7EO2FQJ", "Overall": "5.0", "Content": "I previouisly owned at 7 inch Kindle and it was very comfortable to read.  I then ordered the new larger one.  It was too heavy so I returned it.  At that time I was reading about the new 7 inch HDX and realized that is the one I needed.  I am veryglad to have it.  Amazon makes ordering so easy.", "Title": "Review of Kindle Fire HDX 7#", "Date": "April 6, 2014"}, {"Author": "Rufus2269", "ReviewID": "R2UYFRGVCMFYMQ", "Overall": "5.0", "Content": "This was a gift for my parents. I got them a kindle paper white last year. They love the color screen, size and that they can email & Skype with it.", "Title": "Great for the price", "Date": "February 25, 2014"}, {"Author": "Desiree marie Barton", "ReviewID": "R5OKHIVYHYSJV", "Overall": "3.0", "Content": "I like how light it is and all the free books and apps but when I'm in the middle of playing a game it completely freezes up and won't let me do anything. I have to hold the power button down for 15 seconds or more for it to shut off. It happens often and it gets tiring. This is the second one that the freezing happens so I'm not sure if it's something mechanical or what the reason is for it freezing.", "Title": "not completely satisfied", "Date": "February 25, 2014"}, {"Author": "Brian", "ReviewID": "RR0515SAPXWXP", "Overall": "5.0", "Content": "I was thinking of getting the new Nexus 7 for my wife until we did some research and came to the conclusion that the Kindle Fire HDX is better. The bottom line is that the processor is much faster. Everything else in comparison like the display, size, sound and battery life are pretty much the same. The only thing is that the HDX has a different look for the Android Operating System which is actually very nice. It also doesn't have a rear facing camera, it only has a front facing one, like for apps such as Skype. We almost always use our cellphones for taking pictures, so that wasn't really a big concern for us.I would also recommend NOT paying the $15 to remove the lock screen only advertisements. My wife has already used them and they are actually pretty good. I really don't believe it's worth the money to have the ads removed but you can always pay the $15 at a later date if you eventually decide to remove them.Now that my wife actually has the HDX for over a month now, I realize that it's great and she really, really loves it!You will not be disappointed in purchasing the HDX, trust me, GET IT!!!VERY HELPFUL COMPARISON URL:blog.laptopmag.com/amazon-kindle-fire-hdx-vs-google-nexus-7", "Title": "VERY Satisfied!", "Date": "February 21, 2014"}, {"Author": "Just My Opinion...", "ReviewID": "RFADJQD97W66O", "Overall": "5.0", "Content": "I'm amazed at how many people are complaining about the blue haze. I got my kindle maybe two months after they came out, so if they have tried to address it, I doubt I have one that's been adjusted. There IS a slight blue haze along the edge of the reading screen, but honestly, I never even notice it unless I'm actually thinking, \"Oh yeah, blue haze.\" I doubt I would've ever given it one thought if I hadn't read about it on the reviews. I read about 100 books a year on my kindle and it hasn't bothered me one bit nor hurt my eyes or made me need to quit reading at times. And honestly, I have sensitive eyes - I wear sunglasses even on cloudy days. So don't let this blue haze thing faze you when deciding if the Kindle Fire HDX is for you or not.As for the other features, awesome. I've had every generation of kindle and this is definitely my favorite. Clear picture, quality sound. I wasn't a huge fan of the layout on the Kindle Fire HD but like the one they have going for this.", "Title": "Seriously? The Blue Haze is Nothing.", "Date": "February 19, 2014"}, {"Author": "Kevin P Murray", "ReviewID": "R2PMRF1RGIH2H4", "Overall": "5.0", "Content": "What a great device!! I watch all my shows on it!! Internet speed is even faster than my laptop!! Love that you can get email & there are plenty of free apps that I use!! I would highly recommend this tablet!!", "Title": "Love It!!", "Date": "February 14, 2014"}, {"Author": "Mojo \"campflame\"", "ReviewID": "RAA08YH60V2NQ", "Overall": "4.0", "Content": "My family has a lot of tablets, ipads, ipods, androids, comparing to what the family has, this one is so far top shelf. The one thing that I personally don't like about it is, that it cost extra money to purchase it without the Special offer and sponsored screensavers display.", "Title": "Family Gift", "Date": "February 13, 2014"}, {"Author": "Richard J. Fish", "ReviewID": "R2R3WFMEKOLY9F", "Overall": "5.0", "Content": "I have enjoyed a reading kindle for some time now. But this Fire HDX  is so much more than a reader, You can surf the web and find info you are looking for and even read your mail. The only drawback I have seen is not being able to use some apps from apple or google play. But that is not a biggie as long as amazon keeps the updates i'll be happy for as long as I own it good buy.", "Title": "Nice", "Date": "February 12, 2014"}, {"Author": "Arielle Breen \"Ms.Breen\"", "ReviewID": "R3P7MPYUGALF2E", "Overall": "3.0", "Content": "For the price it has its drawbacks such as often freezing when the battery gets low. However its overall usefulness overrides this annoying tendency. I chose it for the abundance of kindle ebooks and reduced price books, and also since so many apps and opportunities are kindle friendly if you will.", "Title": "Very useful but also has its drawbacks", "Date": "February 12, 2014"}, {"Author": "D. Bui", "ReviewID": "R2Z550LDZCL4JL", "Overall": "3.0", "Content": "So I've had the Kindle for nearly a month now.  Admittedly I don't use it as much as I thought I would.  I'm not sure if this is because my Galaxy S4 is just enough (in terms of size) for me to do most of the things I need to do or if it is because a couple things about the HDX Fire that annoy me and thus got me to use it less.First, the charger it comes with is just too slow.  I realize the original charger is a 'slow' version and a 'fast' charger is sold separately, but the slow should not be a snail crawl charger.  Also, the Kindle crashed on me.  I called customer care, they helped me quickly reset the device to factory settings and it seemed to have fixed it.  I am concerned I have a defect though.  Regardless, they say I have a warranty and can get it replaced anytime within a year (I hope this stands true).  I'm always gun shy to exchange things quickly because OEMs tend to send you a refurb for your new device.These two items make the device a neutral buy rating for me.  Bottom line, if you like a tablet you'll likely appreciate this device. My rating is not here to convince you one way or the other that the device is or is not worth your $$.", "Title": "Neutral On the Kindle", "Date": "February 10, 2014"}, {"Author": "David E.", "ReviewID": "R3PEW0VBRITG9H", "Overall": "5.0", "Content": "If you’re looking for a great low-cost tablet option put the Kindle Fire HDX 7\" on your list. At first I was reluctant buying a Kindle as a media tablet. I was looking at the Nexus 7 which is a little bit more in cost and also the iPad Air, and Samsung Galaxy Note. I decided to go with this because it was on sale and the hardware specs are amazing. I've only had a day to play around with it but the power of the tablet is amazing. It comes with a 2.2GHz quad-core processor, which is the standard in the latest tablets. As a big Hulu Plus, and Netflix fan watching movies, clips, and TV shows are amazing on the (1920x1200), high pixel density (323 PPI) screen.** Also please remember, although you do not have access to a lot of Googles applications like:  Google Play, Maps, Gmail, YouTube, and Instagram. The Kindle allows you to use APK file formats to side-download those apps. There are plenty of online tutorials on how to do that.", "Title": "Great Device, Better than expected.", "Date": "February 10, 2014"}, {"Author": "KevinW42", "ReviewID": "R32IHXCSGQDJOZ", "Overall": "5.0", "Content": "It was either between the Fire HDX 7 and a Google Nexus 7. My choice came when I saw benchmarks that showed the Fire HDX 7 with Qualcomm Snapdragon 800 processor 2.2ghz and Adreno 320 GPU outshined the Nexus 7 tablet. It plays movies very nicely especially those which were filmed in high defintion like Jet Li's new title The Sorceror and the Witch. Colors were gorgeous watching that movie and outshined most other titles I have played on the tablet. By far for the money this beats any unknown model you might find elsewhere. Unlike most budget tablets this one has an Update Feature so you can upgrade to the latest Android versions without having to Root and take the chance of bricking your tablet. I hope Amazon will improve on there Sense Interface screen, I would like to be able to see what apps are running in the background. Right now you have to go to the Settings and Application Control screen and it will let you Force Stop apps that are running in the background. Most Apps let you use the Left Back Arrow to EXIT an Application, however some apps do not have this feature and they continue to run in the background until you go to Settings/Application Control and pick Force Stop for any games you exit that still run in the background.", "Title": "One of the best Android tablets I have used for the price value", "Date": "January 2, 2014"}, {"Author": "Jim Kuhn", "ReviewID": "R3878DQNW7OPRW", "Overall": "5.0", "Content": "I own other tablets, but find my Kindle quickly becoming my go-to choice. With its ability to cover multiple email providers it makes itself the practical choice when you can only choose one tablet to carry. The visual clarity of its screen is unsurpassed. Its sound is robust and clear. The Kindle's physical dimensions are outstanding. It is remarkably thin and light. I can hold it for long periods of time in complete comfort. The Kindle has become the tablet I give as a gift. I give the Kindle my unreserved endorsement.", "Title": "My views on the Kindle 7 HDX.", "Date": "January 2, 2014"}, {"Author": "Douglas E. Swagger", "ReviewID": "R1DV0OUYUAM608", "Overall": "5.0", "Content": "The kindle HDX is a great tablet the color is outstanding an the game controls are too. The two things that I do not like about it is that you have to get a miracast (PTV 3000) that are about $58.00 to makes it wireless to play moves an other thing on your tv. That is nice but it would be nice if could use a cable like on the kindle HD you can get for about $2.00 to$5.00 to do the same thing. The other thing is I wish it had  the charge light on it like the kindle fire dose. Other then that I still give it five stars it's a great tablet.", "Title": "Review of the kindle fire HDX", "Date": "January 2, 2014"}, {"Author": "John I. Cody", "ReviewID": "R1USONR8ZDMZ9S", "Overall": "5.0", "Content": "I am new to the tablet arena so I really don't have experience with other tablet type devices to compare with, however I have had the Kindle HDX for a month now and so far it has lived up to all my expectations.I've been able to surf the Internet with no problems, I have watched TV programs and movies with no problems my e-mail program works just fine.I'm still working on finding the apps that work best for me but I've been told that that's kind of a trial and error process.The display is crisp and the sound is of high quality. The device itself is sturdy, and I have been told by a friend of mine who has a Kindle HD that the HDX is much faster.The only negative that I have found is the camera. The picture quality is good however with only the front facing camera it makes taking pictures somewhere awkward. This is not a deal breaker for me but it may be for others.", "Title": "Lived up to all my expectations", "Date": "January 2, 2014"}, {"Author": "Matthew H.", "ReviewID": "RN5NETA1EITJR", "Overall": "4.0", "Content": "I have been using this device for about 2 weeks now. Firstly I will address the many issues people tend to have with this device and comment on my personal situation.Wifi - Setting up Wifi at first was a little shotty as my router had to be reset a couple of times to allow it to access the kindle. At random times it seems like it drops wifi but this happens infrequently and isnt all that annoying unless it is during a video.Blue Tint - This is noticeable on my device on white screens but perhaps I wouldnt have even seen it hadnt I read so many reviews on it. It really doesnt bother me all that much and I turn the kindle to dark view when reading anyways. Unless yours is really bad I think this is just people nitpicking.Battery - So far it has been pretty strong. I watched a lot of media on this device and I have seen it last anywhere from 7-12 hours. I have noticed it depends on strength of wifi and screen brightness mostly. I watched 4 episodes of Justified last night and it only dropped about 25-30%.App Store - This is one of those things that people can research pretty indepthly before purchasing the device, so why people complain about it is beyond me. They are missing some key apps outside of google play store but many of them can be sideloaded using 1mobilemarket or an equivalent. I have noticed the apps through amazon are generally a version or two behind but its not a deal breaker.I understand you cant do this on an ipad either, but I wish you could rename apps. I hate when I download an app from Amazon and it has a weird name and throws it off alphabetically when I am looking for it.Now for the positives:Screen - The picture on this device is immaculate. Watching media is very crisp and enjoyable even on the 7\" device. The colors are accruate.Speakers - The speakers are very good on this device, much better than expected. It is perfect for watching on your lap, table or bed. They dont get too loud but I have never, as of yet, needed to watch something with them a full capactiy.Media - One of the key selling points is the ability to download videos to the device for offline viewing. I have noticed that the xfinity app allows you to do the same thing that Amazon has promised w this device. There are not many great movies to download and people are upset w this through Amazon Prime Video, however the list of tv shows is exceptional. They have a lot where you can either view/download the videos to the device. Amazon prime is strongly suggested if you were to purchase this device.Reading - Reading is a delight on this device. Very crisp and sharp and I love that you can download overdrive and rent books via your library. The Amazon Kindle Lending library is very weak and if you are considering this as a reason to buy then forget it all together.Overall I am very impressed with this device and at $229 ($179 on cyber monday) it is definitley worth a buy. It is more of a media consumption device then a tablet so to speak. I notice that when I am using it I seem to run out of things to do on it, unlike an iphone/ipad but still I think it is a great device for the budget conscious buyer.", "Title": "An entertainment device", "Date": "January 2, 2014"}, {"Author": "J. Scholz", "ReviewID": "R1VIHP21ZVPOMO", "Overall": "5.0", "Content": "My wife is not a technical person. She wants things that \"just work\" so after debating between a Nexus 7 versus this, I ended up going with the Kindle.The special offers are unobtrusive and easily ignored. The screen is amazing - better than the iPad by far and pretty comparable to the Nexus 7 I use. She uses it for reading, Facebook, Pinterest, and a few other apps. Though I would prefer that Amazon just use the Google Play store she gets along well enough with Amazon's app store, despite the fact that common apps such as Google Chrome are missing.The Kindle also has some annoying limitations on customization. My wife wanted to change the background to a picture but apparently that feature is not implemented for some odd reason. She also wanted to rename it from Kindle #2 but apparently that is not allowed either. I think the tradeoff in being easy to use might have overstepped a bit here, as asking to put your own pictures on as a background shouldn't really be an issue, nor should renaming it to be more personally named be such an issue either. Perhaps a future upgrade will address these easy-to-fix usability issues.As to whether or not I would get her this again I would go with \"definitely\". Despite the missing features and apps this is a solid tablet that I feel will stand up to her use for many years.", "Title": "Bought as a gift for my wife - she won't put it down", "Date": "January 1, 2014"}, {"Author": "David & Tia Fennick", "ReviewID": "R12Z1RS5AIAMFF", "Overall": "5.0", "Content": "Extremely impressed with this product...I've also owned Note 10.1 it has more freedom for customization and apps. However, kindle is great if you're really linked in with Amazon...hopefully they'll update their app store, I'm use to having all my Google Apps on my devices.Now kindle is very smooth nice and clean interface. My browser is pretty fast also and I think I use kindle more than my Note 3. I recommend purchasing a stylus pen because it really is a wonderful addition.Originally I had purchased a Galaxy Tab 3 7.0 and immediately returned it and was gonna purchase the Nexus 7. The Tab is very outdated and ugly. The sales rep at best buy recommended the kindle to me over the Nexus 7... played with the Nexus for about 30 to 60 seconds. Finally walked over to the kindle it was beautiful clean smooth and fast. Love at first sight....I was in love and wasn't leaving without it. Once home with it..disappointment hit. Wow, it's not customizable unless rooted was on the verge of returning it..but then something amazing happened. While reading one of my many books...noticed a play button...tapped it with  stylus and it began reading..so you could speed it up or slow it down...downloaded my financial apps,business then play apps...so my kindle is a winner!!!!! You won't be disappointed....believe me.", "Title": "Kindle Love", "Date": "January 1, 2014"}, {"Author": "Chris", "ReviewID": "R1Y3WUA5CW4V9P", "Overall": "5.0", "Content": "I love the new Kindle Fire HDX. I was really unsure about upgrading from the original Kindle Fire. My 1st gen was working well, but I read about the browser speed improvement and I wanted HD.  I am a Kindle Prime member, but I have to admit I have not been taking advantage of Instant Videos as I should. I use my Kindle for reading, checking out a few blogs, and playing very few games. I now spend more time with this Kindle because using it is so easy...no glitches.  One of the things I appreciate with the upgrade is the improved keyboard. You can easily find a comma. Some friends encouraged me to download some interactive games like Iconmania, Heads Up Charades, and True or False, which we have all played together. I watched a movie with very smooth streaming. Don't hesitate to buy the new Kindle Fire HDX!I bought a Poetic cover for the HDX and it's great.The speakers, volume button and power switch are all accessible and the magnetic cover puts the Kindle to sleep.", "Title": "Better than expected", "Date": "January 1, 2014"}, {"Author": "KindleUser808", "ReviewID": "R34RAV2HVKWDPI", "Overall": "5.0", "Content": "I bought two HDX 7\" for gifts this year.  Since one of the recipients is my wife, I've been able to check it out.  Let me tell you something first.  I've owned several Kindles.  My first Kindle, was a gift from my wife and it was just the reader.  My wife later bought me the original Kindle Fire, then I got a Kindle Fire HD 7\".  I like the smaller Kindles better because they more easily fit in my back pocket which was a nice contrast from our Ipad 2 which clearly did not fit into my pocket.The HDX is completely awesome my only complaint is that it doesn't allow my wife to do what I can do on my slightly older HD 7\".  Using the mini-HDMI port on my HD 7, I'm able to connect the HD to projectors and flat screens.  The only reason this is a complaint is because my flatscreen does not support the \"mirroring\" technology of all the new Kindle HDXs.My wife prefers this to the Kindle HD 8.9\" because she can now download some \"Prime\" videos but understandably, not all.It's also nicer and more compact.  We also like how Amazon has begun shipping chargers again.", "Title": "The HDX 7\" is so great, I bought two!", "Date": "December 31, 2013"}, {"Author": "Andrietta L. West", "ReviewID": "R3LJL9QUOSSECE", "Overall": "5.0", "Content": "I was heart broken when my first kindle got damaged it had been a gift from my daughter in 2006 ,a birthday gift.  I pondered a week before actual purchase........ I love it ! So many more added features than my first Kindle , Color, social media access, email, etc. I love it ...... although I continue to hold on to my broken Kindle ....... I do not to throw away gifts ,its sentimental.......My daughter says \" Mom , just let it go\" .", "Title": "I love my Kindle Fire.", "Date": "December 31, 2013"}, {"Author": "Katrina K. Oberhelman \"Katrina\"", "ReviewID": "R2TU1ZP1C5BFGQ", "Overall": "5.0", "Content": "I really wasn't sure how much I would use this, but I'm loving it. I've had it for two days and have already spent hours on it. I love the little games. Great for passing the time when I'm bored. I've even started reading a book on it and I haven't read a book in months. I go in and out of interests, but this is easier to hold for me than a book. I have arthritis and it gets tiring to hold books. This is nice and light and easy to hold or lay down when I'm tired and still have something to play with. I love it!", "Title": "I'm so addicted.", "Date": "December 26, 2013"}, {"Author": "Jenny A", "ReviewID": "R3F1DJN0EJR561", "Overall": "5.0", "Content": "I loved my old one, and this one is worlds better!!  The colors are so crisp and clear, the browser so fast, and the sound!!  I never listened to music on my old one, it was like listening thru a tin can.  The new Kindle has great sound!!  I also love the improved battery life.  My old Kindle is almost two years old, still works fine, so I really debated if I needed a new one--I am SO happy I decided to get this.Also, just a word about Amazons service--I buy mostly online, and I have never found another company to compare to Amazon.  I know there was a problem with UPS over this holiday week--they were backed up, but this was no fault of Amazons.  The problem is that NO ONE wants to deal with the post office any more, so it seems everyone went with UPS or FedEx this holiday.  Amazon is the ONLY company I trust completely, I know I will get what I ordered, get it fast, and if I have to return anything it will be taken care of promptly and with no drama.  I am an Amazon customer for life.  THANKS, Amazon, for being the worlds BEST retailer!", "Title": "Love love LOVE my new Kindle Fire!!!", "Date": "December 26, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2MN15G1W1W525", "Overall": "5.0", "Content": "I have used the Ipad 1,2,3,4,and air and of all the tablets I have used this by far has the best resolution. It's fast and the battery last very  long.", "Title": "Great Tablet", "Date": "December 10, 2013"}, {"Author": "Kindle Customer", "ReviewID": "R2DMLNJ19N5V3D", "Overall": "5.0", "Content": "I really like the text-to-speech function.  It has much improved from the very robotic voice on my Kindle Keyboard.  Though not as good as an audible performance, it is great when the eyes are tired or if I need a little help concentrating on the story.  This has replaced my new Paperwhite 2 as my preferred reader.The Prime video streaming is also very good.  Maybe it is the smaller size, but streaming \"Duck Dynasty\" from Amazon Prime was much clearer and sharper than steaming Netflix on my iPad air.  The subtitles were also available on Amazon and not on Netflix on this particular show.  I haven't compared other videos yet.My only complaint is the blue light bleed when reading a book.  My white pages have a blue edge with one side almost bleeding into the text.  It was a little annoying at first, but the quality text-to-speech makes up for it.  I guess for me, it means if the next 7\" HDX uses white instead of blue LED's I'll have to get it as I really love this small lightweight form and the elimination of the blue edge would make it perfect.", "Title": "Another must have eReader for my collection", "Date": "December 9, 2013"}, {"Author": "vinry \"yaa\"", "ReviewID": "R2B5TANWO1512L", "Overall": "5.0", "Content": "I love this Kindle Fire HDX 7\". I was originally thinking about purchasing the newly released iPad mini Retina display for its smaller screen size, having previously owned the original iPad, then iPad 2 (as well as BlackBerry PlayBook). But then one day I received a 30-day free trial offer for a Kindle Fire HDX from Amazon, and I said to myself \"why not\" and opted for the 8.9-inch version with the thought that I would just play with it for a couple of weeks and then return it and buy the iPad mini, never suspecting that I would fall in love with the graphics, sound, and ease of use of a Kindle Fire HDX. I still returned the free-trial 8.9-inch one but decided to purchase the 7-inch version, because the former was still a bit too large for my need (recall I have the bigger iPad and iPad2).The 8.9-inch version of this Kindle (the one that I free-tried) doesn't have the bluish borders, the 7-inch version does. I read about this issue while waiting for the delivery my 7-inch version while still using the 8.9-inch version and became concerned. But guess what, it turns out that the borders do not bother me at all. No big deal! I can read each of my e-books just fine. It actually reminds me of the old novels I have whose pages have turned yellowish on the edges.I have a couple of large wide-screen TVs at home but found myself lately watching movies more often on my Kindle Fire HDX. it just shows how good the display of this little device is.", "Title": "Very satisfied!", "Date": "December 9, 2013"}, {"Author": "Tessa", "ReviewID": "R2PCYB7QEVTYN8", "Overall": "5.0", "Content": "Kindle Fire HD X. I love this it is the nicest picture I have seen on any device other than my  HD tv. I lov ewatching TV on this and  browsing. This is the nicest tablet I have ever had! The price is great! I am so glad I chose this. Great Christmas present for anyone out there !", "Title": "Kindle Fire HDX", "Date": "December 8, 2013"}, {"Author": "Kindle Customer", "ReviewID": "R3EKAU5IA3K075", "Overall": "5.0", "Content": "It is easy to use and if I don't understand something I just hit the \"may day\" button. I have an Ipad and I haven't picked it up since I received my Kindle. I am in LOVE with my Kindle.", "Title": "In Love", "Date": "December 8, 2013"}, {"Author": "mitch", "ReviewID": "R1JPT9RLXQ5V6H", "Overall": "5.0", "Content": "This is probably the best tablet you could get for your money. From not even considering this tablet in the beginning of my tablet hunt, to owning it now, I am so glad I bought it. I originally was looking for a tablet for school, so.I was looking more at Windows tablets. There's a lot of nice Windows tablets out there, but anything in my price range (200-400) had problems, if it was a high res screen and crappy processor, or a speedy prossesor and a cruddy screen resolution, or even if the item was out of stock or a bad operating system, I had never considered the kindle fire HDX. This runs a 2.2 gigahertz processor about .4-1 gigahertz faster than any Windows tablets I had considered, even the galaxy tablets I was thinking about only had 1.6 gigahertz processors. Galaxy tablets and galaxy notes have maybe 2 things that beat this tablet: the infrared capability and the multitasking capability. Nothing else. The  os on the kindle is just as good, the screen res is 1080 compared.to there 720, camera isn't as good on the kindle but I wasn't concerned about this as I have a nice camera on my phone,and  the processor on the kindle blows the galaxy tablets out of the water! The kindle has just as good productivity capability as the galaxy tablets, because if you buy a stylus and download a note taking app, you have the main selling point of the galaxy note! I think this tablet should be something for everyone to consider", "Title": "great tablet for school and for fun", "Date": "December 8, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RDXGEGB2QEFNF", "Overall": "5.0", "Content": "I bought this out of curiosity as I already own an iPad. I bought it mainly as a device for my child (although it is still \"mine\"). I appreciate the kid options: the timers and parental controls for the internet access. This is a must for me. I especially like that it will grow with her (unlike the Leap Pad I got her 2 years ago).I was surprised that I like the size. It's still a good sized screen with great graphics and color.I think this is a good alternative for price-minded  parents and Amazon Prime fans.", "Title": "Great for price-minded parents", "Date": "December 8, 2013"}, {"Author": "Giselle", "ReviewID": "R16IMVFMVDYPN4", "Overall": "5.0", "Content": "i love my new kindle. the best feature is the mayday feature is the best. You can instantly get live help if you are new to kindle and don't know how to use it.  AMazon has the BEST customer service i have ever come accross.  I couldn't decide between and ipad mini or a kindle Fire HDX and I am very glad i chose the kindle.", "Title": "Love my new kindle", "Date": "December 5, 2013"}, {"Author": "Reader", "ReviewID": "R33YLM40TW24OP", "Overall": "5.0", "Content": "I had some hesitation about buying this device after reading some of the negative reviews - and the fact that that I was an early buyer of the original Kindle Fire two years ago, which was, to put it mildly, a piece of crap.  I also am a longtime iPad user (and lover) but the iPad is a little hard to hold in one hand when I'm reading in bed.  So I had high hopes that the HDX would fit the bill as a nice, lighter-weight 7-inch device with iPad-like qualities.  I have to say, it really surpassed my expectations!  The display is gorgeous and the Silk browser is about a million light-years away from the original Fire.  The size and weight are perfect (don't underestimate the importance of the lighter weight if you're considering an iPad).  I've had no issues whatsoever with a flickering screen, WiFi connectivity etc that other users mentioned...my experience has been fantastic.As an Apple aficionado, I would still give my iPad a slight edge over the Fire, but only because of the availability of apps and the seamless syncing of all my stuff through iTunes with my iPhone and my Mac desktop.  But aside from those things I actually prefer the HDX purely as a device - the light weight and portability combined with the performance are all amazing.  And at this price point (I actually got the $50 off deal, for $179), it's a no brainer.  Buy it!", "Title": "In love", "Date": "December 5, 2013"}, {"Author": "lrc3395", "ReviewID": "R1UKAMPPCGBC12", "Overall": "5.0", "Content": "I purchased the kindle fire HDX to replace an Acer tablet I got last year. Prior to the Acer I had owned a first generation Kindle Fire and a first Generation iPad. The Acer had a four core processor, like the Kindle Fire HDX, was HD, and had a 10.1\" screen. The HDX beats the more expensive Acer hands down in every way. The screen is beautiful, with awesome color and clarity, the processor is fast, and the battery life is very good. The sound from the stereo speakers is better than any of the previous tablets I've had, with great separation. The smaller size took a bit to get used to, although I've found I like the portability and light weight of the smaller device.Amazon's operating system works well, and is fairly intuitive, although I had trouble getting some apps to show me the \"home\" button a few times and I sometimes wish it had a physical sleep button. The \"special offers\" feature that keeps the price low is very unobtrusive and hasn't bothered me at all. It's definitely not worth the extra expense to upgrade to the version without special offers.I use Amazon products constantly: frequent purchases from their website, the app store, kindle books, Audible, music, and videos. The Kindle Fire HDX seamlessly merges all of those into a convenient package. This is definitely the best tablet available for the money, hands down.", "Title": "Best tablet for the money", "Date": "December 3, 2013"}, {"Author": "Patricia M. Dashiell", "ReviewID": "R3D2JKEP16HIIS", "Overall": "5.0", "Content": "I actually have the iPad Mini Retina and this Kindle Fire blows the mini Retina out of the water as far as clarity.  Honestly, I use the mini for all the apps I used to have on my old iPod touch. If you are a Prime member or a streamer, I believe the Kindle Fire is a must.", "Title": "Why haven't you gotten one yet??", "Date": "December 3, 2013"}, {"Author": "nathan", "ReviewID": "R2TGWBT9UV2A69", "Overall": "4.0", "Content": "This tablet is pretty amazing. The size is comfortable enough to hold, type, and surf the internet. The picture quality of the screen is better then my hd tv seems to be. The audio of this tablet though took me by surprise for the speakers being in the back of the tablet the sound quality is absolutely amazing. Sounds like surround sound even. The only reason I didn't give five stars is the fact that a lot of Google apps are not available on this tablet. I use Google chrome as my browser on everything but cannot on here kinda sucks. Hope one day Google and Amazon will join together to share apps.", "Title": "tablet is full of surprises.", "Date": "December 3, 2013"}, {"Author": "David", "ReviewID": "R1AWVP7E7MQ2J5", "Overall": "5.0", "Content": "This is a Kindle, not an iPad. That said, the quality and value afforded by this product is top knotch! I previously owned a first generation Kindle and resisted buying the HD when it came out. I really REALLY liked my old Kindle but now that I have my 7\" HDX I have to admit there is no comparison. The display? Awesome! The redesigned and repositioned controls? Awesome! The speakers? Wow! So how does it work? Flawlessly so far and much smoother than the original Kindle. The wifi is so much better. The browser is so much better. I love this new HDX 7\". I have no regret buying it so far. It is well worth the money.", "Title": "Nice!!!", "Date": "October 24, 2013"}, {"Author": "obxbeach18", "ReviewID": "RM0977Y6VE29F", "Overall": "5.0", "Content": "The Kindle is by far my favorite gadget. It's easy to use, light, and durable. The battery lasts for quite a while and honestly I'd rather use my Kindle most of the time over using my laptop. It's just easier and usually faster. I highly recommend it. I actually bought one for my grandmother and she enjoyed doing Sudoku puzzles on hers.", "Title": "Love my Kindle", "Date": "April 29, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3S1KKUY2TCRIJ", "Overall": "5.0", "Content": "I am not a technogeek but this kindle fire hdx7 is so easy to use and so much fun to use.  I love my kindle and take it everywhere with me. Love it!!!!", "Title": "love it!", "Date": "April 29, 2014"}, {"Author": "HeightsGirl106", "ReviewID": "R3S8AFLIO69Z8R", "Overall": "5.0", "Content": "I bought these for each of my 3 adult children for X-Mas...and they LOVE them...and have all told me that they use them every day!", "Title": "AWESOME gifts!", "Date": "April 28, 2014"}, {"Author": "Gloria Waddelow", "ReviewID": "R267PB0OQX2H24", "Overall": "5.0", "Content": "I am able to figure out how to use it without any help.  I can check my email and go to Facebook instead of always going to my computer.  It is super fast, and my computer is old and slow.  The color is excellent and it isn't too dark or too bright.  I still have alot to learn about using it.", "Title": "I love my Kindle Fire HDX", "Date": "April 16, 2014"}, {"Author": "Linda Sacco", "ReviewID": "R2L9QH623SKSAZ", "Overall": "5.0", "Content": "I bought this Kindle as a gift for my sister. She uses it every day, mostly for reading. Works well and she is very happy with it.", "Title": "Awesome", "Date": "April 16, 2014"}, {"Author": "Anne Marie Smith", "ReviewID": "R1U35WYHVWRX3A", "Overall": "5.0", "Content": "Love my Kindle....like really love my Kindle.  Light weight, easy to use and it is more powerful than just having my book library available at my fingertips - it works as a notebook or pad.  Could not be more thrilled.", "Title": "Kindle Fire HDX Rocks", "Date": "April 16, 2014"}, {"Author": "Dana", "ReviewID": "R1NNSXZN6EJH43", "Overall": "4.0", "Content": "So I absolutly love my kindle but there are two things that really bug me about it and stopped me from giving it a full 5 stars. #1 the camera on this model is only front facing but it seems that on all of the other HDX models that are larger they have a front AND rear facing camera. Now the reason I wanted the smaller screen was because when I read my books I want to really feel like im reading a book sized object which is a better fit for me and makes a difference in my reading. This dissapointed me alot because I spend alot of extra money to pay for the 32 GB to take pictures on it but I cant really take any pictures of use with the front facing camera. The rear facing camera would make my 32BG purchase choice more useful. SO that was extremely dissapointing.  #2 when playing games on my kindle about 50% of the time the game will start flashing slightly but enough to really annoy me and make me think that something might be wrong with my device. But when calling mayday I was basically told to just call them back if it happens again but in reality it doesnt matter because of course you would have to catch it at the right time in order to show the may day people what you're talking about. The flashing that happens during the game is a random act and not something that can really be shown unless catching it at the right time which is unlikely.other than those two things, I really love my kindle as I do amazon but the two issues stated above really bug me since I really support amazon and have probably influenced 7 people at this point to buy Kindles as well as the prime membership within the past few years and probably only felt maybe 80% satisfaction from my current kindle.", "Title": "I Love my kindle but just a few small annoyances", "Date": "April 16, 2014"}, {"Author": "Carol E. Lang", "ReviewID": "R156YS8GSPVNGH", "Overall": "4.0", "Content": "The screen is very clear and the options for use are almost endless.  The user directions which I also bought were available only as a kindle book.  Thus, it is most difficult to learn how to use the device when I have to switch back and forth from directions to the actual Kindle.  It really would have been very considerate of you to have included some simple written directions on how to get started and learn the basic functions.  I'm 78 years old, and though I have used computors and my I-phone with ease, everything is not intuitive for me.", "Title": "It's hard for me to get the hang of some of the basic functions.  I wish you had included a brief pamphlet of instructions.", "Date": "April 15, 2014"}, {"Author": "MP's World", "ReviewID": "R2EOB0W6BCMPBO", "Overall": "5.0", "Content": "This tablet is great for what I use it for. I don't handle any business on, I use to for fun and checking mail. I purchase this Kindle because I learn that you can borrow books from the Kindle library and the Public library. I use it to play games as Candy Crush Saga, Hidden Object and Jigsaw Puzzles. I can also do online searches. I haven't watched any movies yet. I am sure there is much more you can do.", "Title": "Great Tablet", "Date": "April 15, 2014"}, {"Author": "Lovely Lunacy", "ReviewID": "R15N0YFL2LJUL0", "Overall": "3.0", "Content": "I love having almost all my entertainment right at my fingertips. I wasn't sure if I'd really like this. I love my books. I move so often that the people who help me move finally put their feet down. Less books or no moving help! I love this kindle. My apps, my movies, my books. All right here. I will also mention, I would not love it as much if I wasn't a prime member.All that said... the wifi. Dont love it.  It turns itself off alot in the middle of stuff! Urgh.  Ive Googled the issue and it seems pretty common.  It does connect right back up, but its annoying.", "Title": "I love it! except for that pesky wifi", "Date": "April 15, 2014"}, {"Author": "Barbara McClellan", "ReviewID": "R312Z55J97HD0M", "Overall": "5.0", "Content": "I was so against getting an e reader.  I love it.  Its easy to use.  The games are fun and can be very educational.", "Title": "Great gadget", "Date": "April 15, 2014"}, {"Author": "babcia \"babcias5\"", "ReviewID": "R2KOWPQHH8ZE6G", "Overall": "5.0", "Content": "I have an old kindle & this one beats it by a mile..Highly recommend it if you're looking for one to buy..Cheapest price anywhere I compared it to & came quickly.", "Title": "Awesome", "Date": "April 15, 2014"}, {"Author": "Phillip E. Jones", "ReviewID": "RK2WU1T71XXXZ", "Overall": "3.0", "Content": "Having problems with screen going blank, blue for extended periods and then restarting. Will be contacting customer service for help.", "Title": "Improper operation", "Date": "April 15, 2014"}, {"Author": "Tazmaina", "ReviewID": "R3OS55WDKZZXE0", "Overall": "5.0", "Content": "I love the kindle fire .i can put it down it's with everywhere I go I just can't say enough about it", "Title": "Tony Tiger Greeeeeeeet", "Date": "March 27, 2014"}, {"Author": "BShops", "ReviewID": "R2GXCKIIR6HTFK", "Overall": "5.0", "Content": "I had the Kindle Paperwhite first, which I really love, and I gave it to my husband.I got this so I could take advantage of Amazon Prime with the movies etc. It's such a powerful little tablet! I have been able to stream tv/movies right from Amazon without having to wait for anything to buffer. The one disadvantage though, coming from the Paperwhite, is that there is a glare on the screen bc it's glass and it probably won't be suitable for reading out in the sun. Well worth it though because of all of it's cool features!", "Title": "Love my new Fire!", "Date": "March 27, 2014"}, {"Author": "KarolH", "ReviewID": "R1898IBIVIK5N6", "Overall": "5.0", "Content": "Love this size and the browser is much improved from the 8.5 hdx I got  a year ago. I like the offers,but can be gotten without them.  Resolution is beautiful. I am an iPad fan but wanted this one and love it as well.  I use it more than my iPad mini not as much as ipad full size.  Love it.", "Title": "Kindle 7 inch", "Date": "March 27, 2014"}, {"Author": "Rick", "ReviewID": "RIOENOX4QEX07", "Overall": "4.0", "Content": "Great tablet! I like it's size and GUI. Only downside is it doesn't have some of the Apps I like that are available on my iPad.", "Title": "Great Tablet", "Date": "March 27, 2014"}, {"Author": "Cherie Kozlina", "ReviewID": "R2VP5GNYEI9T0F", "Overall": "5.0", "Content": "I love my kindle fire hdx! I take it everywhere I go!! So lightweight and easy to carry around. Has a variety of free apps and ones to purchase. I am very pleased with this item!", "Title": "Great item!", "Date": "March 27, 2014"}, {"Author": "Denise Herbert", "ReviewID": "R3IS9LEC4GCDXZ", "Overall": "2.0", "Content": "I love this tablet but live in Australia. Be aware that much of the app content is now unavailable to us downunder. Especially related to music and magazine eg try Vanity Fair app only available in Italian or Spanish, in an English speaking country lol.. Now I am locked into the Australian content store some books are way more pricey however apparently I have more access to Australian authors to make up for that. So as long as you are happy to use it with those limitations then all good!  It is a beautiful tablet to use!", "Title": "limits for australian buyers", "Date": "March 27, 2014"}, {"Author": "Hedy", "ReviewID": "RSUM1A8A5ZACA", "Overall": "5.0", "Content": "Still Learning but truly amazed.  Just a few years ago,  who would have thought such a devise would be developed?", "Title": "Amazed", "Date": "March 27, 2014"}, {"Author": "Bone Collector", "ReviewID": "R1UQS96PCZ15I3", "Overall": "5.0", "Content": "The best tablet...nuff said.  Doesn't even compare to the iPADS.  These are so much better.  All I can say is if you want a small tablet get this one.  If you want a large Tablet, get the bigger one.", "Title": "THE BEST", "Date": "March 26, 2014"}, {"Author": "owlet55", "ReviewID": "R37VRA93A0IKOQ", "Overall": "5.0", "Content": "Love the portability of the Kindle Fire HDX.  The HD aspects is crystal clear for watching videos.  I highly recommend this to everyone who loves the internet!  My son wants one now.", "Title": "Best purchase from Amazon EVER!", "Date": "March 26, 2014"}, {"Author": "T&V.R.;", "ReviewID": "R2JKESG59RPEVJ", "Overall": "5.0", "Content": "I bought this for my husband for Christmas and he loves it!  He uses it every day.  Both the sound and the display are amazing.  We had a minor problem with the first one, but we contacted Amazon and they sent a replacement immediately.  Couldn't be happier with this great product and their great service!", "Title": "Beautiful display.", "Date": "March 26, 2014"}, {"Author": "Angela Anderson", "ReviewID": "R17AA5YWQDVINH", "Overall": "5.0", "Content": "Love it. It does everything my laptop does, only smaller..Which is exactly what I wanted! I just wish it would charge faster while using it.", "Title": "awesome better than expected", "Date": "March 4, 2014"}, {"Author": "Saleh Nasser Saleh \"Saleh Nasser\"", "ReviewID": "R23WENJ6O0MUDH", "Overall": "4.0", "Content": "The device is really good, very fast; very responsive, super resolution, long lasting battery , sleek deign . That being said; the amazon ios really sucks. It has so many restrictions especially if you're living outside USA.", "Title": "Excellent Device but very resiticted operationg system", "Date": "March 4, 2014"}, {"Author": "Doris Curry", "ReviewID": "R3GPWM1L9ONWNU", "Overall": "5.0", "Content": "well I must say that I love my kindle don't understand how i ever lived with out it .This is my 3rd kindle but this time I 64 gb and the newest  kindle fire hdx and I love ............", "Title": "love my Kindle", "Date": "March 3, 2014"}, {"Author": "mystery reader", "ReviewID": "R7FRLWDK1O0X5", "Overall": "3.0", "Content": "It makes purchasing books sooooooo easy.  Only had it about two weeks and already I have read about 8 books.  Only negative is that it should have had a two way camera", "Title": "LOVE IT", "Date": "February 12, 2014"}, {"Author": "Cynthia Wright", "ReviewID": "R1B9GG1DNL7QC6", "Overall": "5.0", "Content": "Great value, lot of applications, fast the size is perfect for me, long battery life......my best gift to myself all year", "Title": "Just perfect", "Date": "February 12, 2014"}, {"Author": "rene lafontaine", "ReviewID": "R2UVW0RISBQR6W", "Overall": "5.0", "Content": "this is our families third Kindle and the Best . It is so seamless and the picture is really exactly as nice as they say . I stayed with the smaller size and I was right in doing so very easy in carrying around or in the purse .", "Title": "works smoothly", "Date": "February 11, 2014"}, {"Author": "Schean", "ReviewID": "R2Y4VG1FY8IGXR", "Overall": "5.0", "Content": "I was skeptical about purchasing a Kindle.  I'm a big Samsung fan and have recommended the Galaxy Tab and Note to more than just a few family and friends.  However, a really good friend of mine has been using her kindle for a few years now so I thought I'd give it a try.The Kindle Fire HDX is everything she said it was and more.  The display is incredibly brilliant, the sound is great, the battery life is excellent and it has an awesome selection of apps available through Amazon.  Bang for the buck....it's a great deal.  I take it with me everywhere.", "Title": "A Happy Skeptic", "Date": "February 8, 2014"}, {"Author": "Guy Mitchell", "ReviewID": "R10A2GPHX5QVJB", "Overall": "5.0", "Content": "My wife has an IPAD and i bought this for academic reasons because I am a graduate student, but this purchase had turned out better than expected. The size of the kindle fire is more convenient as it rest gently in your hands, the great visuals, and awesome price make this a great buy.", "Title": "Better than IPAD!", "Date": "February 7, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R1BKZ663WFM1JR", "Overall": "5.0", "Content": "The HDX functions similar to my smartphone so was easy to acclimate to.  Everything is user-friendly.  Vivd colors on the screen are brilliant and beautiful.  There are differences from my Kindle Fire, and the differences are all improvements.  Happy with this new and improved Kindle Fire HDX 7\".", "Title": "Great replacement for my Kindle Fire", "Date": "February 7, 2014"}, {"Author": "Teutonic Lady \"Victoria\"", "ReviewID": "R3RQ2UBX1XQPS0", "Overall": "5.0", "Content": "Now I can watch my favorite programs and movies while lying in bed or sitting down, can answer emails, and even surf the net, but the biggest thing that it's done is that I am really reading again.  Should actually get the paperwhite as it would be even easier on the eyes.I have a very nice router, and it's sorely needed if you want to stream movies, and it really works beautifully, but if I were buying it for a friend, I would pay the extra so I could use it anywhere.", "Title": "Love my Kindle", "Date": "February 7, 2014"}, {"Author": "Caroline Ellis", "ReviewID": "R2U937FVG7B3TW", "Overall": "2.0", "Content": "My granddaughter doesn't live with me, so I haven't personally used it - she loves it, however, I had to input my credit card information for her to download free apps and I'm not happy about that.", "Title": "Granddaughter loves it, but", "Date": "February 7, 2014"}, {"Author": "Gardenwitch", "ReviewID": "R1J9OWRRWRAAG9", "Overall": "5.0", "Content": "I have both an iPad 2 and just got a Kindle Fire HD.....no contest.  Love the 7\" Kindle and the resolution is fantastic.  Wifi is much faster and love the ability to use Android voice input.  Still getting used to the features, but it's fun to explore.", "Title": "Definitely better than iPad", "Date": "February 7, 2014"}, {"Author": "Connie S. Gray", "ReviewID": "RFM0KU4Q3HJYS", "Overall": "5.0", "Content": "I love my Kindle Fire HDX, it is easy to use and has great graphics.The only issue I have is the front facing camera, a total waste.  It would be better if it were rear facing, then you wouldn't have to struggle to stay out of the picture.But, everything else about the Fire HDX, I absolutely love.", "Title": "Why I love my Kindle Fire HDX", "Date": "February 7, 2014"}, {"Author": "barefoot", "ReviewID": "RE3RY7FSZF3RY", "Overall": "5.0", "Content": "I was hard pressed to give up my new kindle fire 7\" hdx, certainly because it was a christmas gift from my wife. But I found out a few things about my phone provider when they wanted me to exchange my kindle fire for their tablet. Not only was i being scammed But was informed later... and was able to get out of it before the very short dead line contract expired. I'm glad very glad in fact that I didn't give up my Kindle Fire or return it. It's very fast and it's all I need. Glad I didn't screw up there. I really like this tablet it's my 1st been following this for awhile and when during christmas if you was a store card holder you could by this shipping free for 179.00 what a deal! wow! no regrets here.", "Title": "Kindle Fire Oh Yea!", "Date": "February 7, 2014"}, {"Author": "Swtbear13", "ReviewID": "R2ILJR98S8QBSH", "Overall": "5.0", "Content": "I had the Kindle fire for about a year and a half. I loved it but needed more memory quickly enough. When I saw the new HDX had 64 gb available it had my attention but I was skeptical about how different they could possibly be.Well I am here to tell you that the quality has greatly improved. The screen is noticably more clear when comparing the two. Also the HDX is considerably lighter- so much so that when I put the HDX into a case with a wireless bluetooth keyboard included it was still lighter than my original HD.The sound quality is what I expected and I havent tested the range of the wifi but as of now I have never had a problem with connecting with a wifi signal.Battery life is as advertised and works well for me because I take my HDX to class and type notes for my courses with it.Overall I am thrilled with this product and everyday I try to find new ways to use it!", "Title": "Perfect for my uses-The Kindle Fire has reinvented its best with the HDX", "Date": "February 7, 2014"}, {"Author": "Vnyrdstar", "ReviewID": "R2WAZZ6B1WB14", "Overall": "5.0", "Content": "All I can say, is I ended up buying TWO the 7\" for my son and then the 8\"9 for myself. I know people who have Ipads but why pay more for pretty much the same thing. And, I use Amazon for so much more. I also have a dell xps that doesn't fit into my purse. We are so happy with our Kindles we can read, watch and purchase anything, anywhere we want. We wouldn't be caught without them, and we don't have to. Yeah !!", "Title": "It's Perfect", "Date": "February 7, 2014"}, {"Author": "TGill", "ReviewID": "R2JUUOTEELJ34D", "Overall": "5.0", "Content": "Love my Kindle Fire HDX!!  I have the first edition Kindle which I loved.  Received the Fire HDX as a Christmas gift.  Love it love it love!  Highly recommend!", "Title": "Love it!", "Date": "February 4, 2014"}, {"Author": "rob sydiskis", "ReviewID": "R1UTSLN4W7BN4Q", "Overall": "5.0", "Content": "This is my first tablet and I love it. It was a Christmas gift, I did not ask for it, but am very happy someone thought I of me.", "Title": "Very Happy!", "Date": "February 4, 2014"}, {"Author": "drachehexe", "ReviewID": "R9XFLOIM26J02", "Overall": "3.0", "Content": "I got this because my Android phone's screen was too small for reading and some gaming and note taking.  This is great for reading and web-surfing, in games tho the menu tab in full screen games gets in the way a lot of the time, especially the hidden object games where the tab can cover something you need to click on preventing you from progressing.I also don't like the limitations of setting up your home screen.  There is VERY little customization, my android phone is much more user interface friendly, this, this is just messy.If you can manage through the funky menu system it's a good device, good reader, good gamer, good surfer, just lousy interface, not overly user friendly at all.", "Title": "Overal disappointed.", "Date": "February 3, 2014"}, {"Author": "Dan R. Mason", "ReviewID": "R3LLMDUJT0MXQR", "Overall": "4.0", "Content": "This tablet is an upgrade from my 7 inch Kindle Fire HD. I think this tablet is great with just one negative. I prefer the speakers at the end of the tablet like on the old Kindle Fire HD. However, this tablet is so much faster and with the 64 GB of storage I can do so much more.", "Title": "Very nice tablet.", "Date": "February 3, 2014"}, {"Author": "Myron B.", "ReviewID": "R2V4NRVAS3JOLQ", "Overall": "5.0", "Content": "I only have used it once, but my wife is on it all day long.  We are a five Kindle household (of 2) and this Kindle is the best to date.", "Title": "Xmas Gift for My Wife", "Date": "February 3, 2014"}, {"Author": "Alvin C. Fogelman \"onlineshopper\"", "ReviewID": "R1GB60MOGH3I9H", "Overall": "5.0", "Content": "I have found this to be very convenient for traveling. It is so much less bulky. for transporting. My only regret is that I couldn't afford to purchase the 8\" at the time.", "Title": "Kindle Fire 7\"", "Date": "February 3, 2014"}, {"Author": "Dolly", "ReviewID": "RL08VQRP5OB58", "Overall": "5.0", "Content": "I absolutely loved my original kindle fire,but the kindle fire HDX is amazing,the graphics are so clear.I compared it to the picture on my original kindle and there is a big difference.the May day feature is a life saver for someone who doesn't know how to do very much on a computer.the people who answer your call are wonderful,they are so patient and knowledgeable.lts a great machine,I highly recommend it.", "Title": "kindle review", "Date": "February 3, 2014"}, {"Author": "pjhempe2", "ReviewID": "R2YF09KWVCXGWU", "Overall": "3.0", "Content": "I really like the smaller size from my iPad, however am very disappointed in the camera. I had hoped I would be able to use it to take pictures and video as well as use it for video chat. I returned it and most likely not get the 8.9 because it is not as compact.", "Title": "Very disappointed.", "Date": "February 3, 2014"}, {"Author": "Stan", "ReviewID": "R3GGTEM2PXX82O", "Overall": "4.0", "Content": "Just needs flash support and a way to reset the \"free time\" parent password if you forget it. You have to reset the device if you ever forget your password and you'll lose all your apps. Otherwise it's a great little machine!", "Title": "Great, but needs a couple small tweeks", "Date": "February 3, 2014"}, {"Author": "E. Hoogland", "ReviewID": "RFRNXGHPHMI61", "Overall": "5.0", "Content": "I thought it would be difficult giving up \"real\" books, but my Kindle is wonderful--I wish I hadn't waited so long to get one. And the features of the Kindle Fire are just enough for me (not too overwhelming for a 60-something)!", "Title": "I love it!", "Date": "February 3, 2014"}, {"Author": "Nichole Zackos", "ReviewID": "RXQUM6YPLFL53", "Overall": "2.0", "Content": "I previously owned the original kindle fire which I loved. When I purchased this one the kindle fire HDX I thought it would be as great or better than first one but I was actually disappointed .  My major issues with this kindle are ...The battery  takes so long to charge, dies extremely fast, and even when plugged in does not charge while in use. My previous kindle charged quickly even in use and had an amazing battery life!  I even called customer service and they said there's was a problem with it. Guess what? When I was sent the new one it worked just as bad as before.My next issue is What happened to flash player?!  My old kindle has it! And now when I go to watch certain shows I used to watch or when I go to amazon to view a product video I can't view it anymore!!Next ..  i used to watch the network apps such as the cw ect..  on my previous tablet and still do with no problems. but when i watch them on my HDX they time out whenever the commercial break happens, I have to actually exit the app ,go into my wifi , turn it off, and then back on again to get it to work! Once back in i have to fast foward to where i left off ! This is something i also asked about when in called customer service and was told it was the kindle and my internet. if this were true then why does it work perfectly on the old kindle? Again got the new HDX replaced and still have same issue to this day. It's not my Internet !  I've even been to places that only use one device in there home and have way better internet than me and my kindle still does this ! It was a huge disappointment!In my opinion they took more away and only added a camera.  If they keep this up I don't think I'll be buying anymore kindles in the future. Its sad cause I really did like them and thought the gave apple a good competitor.", "Title": "Very, Very  Disappointed!", "Date": "February 3, 2014"}, {"Author": "Kindle Customer", "ReviewID": "RBEI6GBQLJOI6", "Overall": "4.0", "Content": "would have given it a five except for how to start with it.  took a while to get it up and running.  Still not able  to get my email account but will keep trying.  Great for reading my books and some items from amazon.", "Title": "kindle my fourth", "Date": "January 31, 2014"}, {"Author": "Zumba Kelly", "ReviewID": "R23H7GCB65BAVH", "Overall": "4.0", "Content": "This device is pretty easy to use & it keeps my 8 yr old entertained with games and books....if it helps me get her reading it gets points in my book!!!!", "Title": "Education assistant", "Date": "January 31, 2014"}, {"Author": "kpal", "ReviewID": "R35FHCQR65MVH2", "Overall": "5.0", "Content": "I truly love it!!! But difficult finding Wi-Fi when you live in such a rural area and have  none within miles. wish it came with 3g like my older Kindle....overall a hit!!", "Title": "Stunning", "Date": "January 31, 2014"}, {"Author": "Kindle Customer", "ReviewID": "REO7Y0HV2XOC8", "Overall": "5.0", "Content": "Kindle fire was exactly what I needed!I love I can take my books everywhere with me! Exactly what I need on my trips!", "Title": "love it!!", "Date": "January 31, 2014"}, {"Author": "Kindle Customer \"Keitha S. Joseph\"", "ReviewID": "RIAW7A9ZGJHEC", "Overall": "5.0", "Content": "the size is just right for me, small, light and the features are great. the screen quality is exceptional. would definitely recommend it.", "Title": "loving it", "Date": "January 31, 2014"}, {"Author": "Darline Valcin \"cheloo\"", "ReviewID": "R3142M0VPAUT78", "Overall": "5.0", "Content": "This was a birthday gift from my husband and also an up grade from my older kindle. It is easier to maneuver on the fire compared to the older version I have. My daughter also enjoys it because her books are in color and not black and white.", "Title": "Love it!!", "Date": "January 31, 2014"}, {"Author": "TFLIII", "ReviewID": "RUGQ0WGJX66TH", "Overall": "5.0", "Content": "The Kindle Fire is allot of fun!! It has exceeded my expectations. It is very easy to use. As always Amazon delivered as promised.", "Title": "Love My Kindle Fire", "Date": "January 31, 2014"}, {"Author": "MontanaOutdoorsman", "ReviewID": "RP9VPDR1RHNCG", "Overall": "4.0", "Content": "The screen is sharp and clear, so it is great for reading and watching you tube videos. The reason I only gave it  4 stars is some of the features that come with it don't work as they should. The first one that comes to mind is the speech to text. It works very sporadic. One in three times it will work. What I do like is when it does work it's pretty accurate as far as words. I guess I am somewhat disappointed because we have an IPad and there is no comparison between the two. (In my opinion anyway) the iPad is a lot easier to navigate around on, speech to text always works as well. The touch sceen on the iPad also works a lot smoother and is more accurate. They say the android system is getting the bugs worked out and works as well as Apple.  I have to disagree, because of having both I can do side by side comparisons, and everything I have tried the winner is clearly Apple. If you can afford it the iPad is two times the machine. My opinion only.", "Title": "KINDLE FIRE  HDX IS NOT AN APPLE", "Date": "January 31, 2014"}, {"Author": "Kimberly Graham", "ReviewID": "R14K12U3X8W0FI", "Overall": "4.0", "Content": "Very easy to use, even for someone who is not electronically inclined. Was fearful to even try one in the store let alone actually have one, but it almost works by itself.", "Title": "Anyone can work a Kindle Fire HDX", "Date": "January 31, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R1JONKMOGU9SOC", "Overall": "3.0", "Content": "my unit came with an installed calendar, which was advertized as being able to synch with my outlook calendar on my laptop. when it would not work  I tried manually entering data. even that would not work.  i went to the direct personal support system. they were unable to provide a solution and after a long delay they gave up. I eventually downloaded another calender system which , while not able to synch at least I was able to input data.", "Title": "poor support", "Date": "January 31, 2014"}, {"Author": "tink1333", "ReviewID": "R1T7FXCWT4PJZ1", "Overall": "5.0", "Content": "I couldn't be happier! My brother just bought the new iPad air & he even had to admit, the Kindle Fire HDX has a greater clarity then any tablet put there on the market.", "Title": "Kindle HDX - 7", "Date": "January 30, 2014"}, {"Author": "Ricardo from California", "ReviewID": "R1HH363J2W534B", "Overall": "5.0", "Content": "Is an easy way to surf trough internet. It has the perfect size to handle it. The sound is awesome. I can do almost everything  without a big effort. I really like my kindle fire. (My daughter's christmas gift)", "Title": "MY WONDERFUL DEVICE!", "Date": "January 30, 2014"}, {"Author": "Donna M. Weigel \"Donna Weigel\"", "ReviewID": "R3GNMV4OBSOTS0", "Overall": "5.0", "Content": "I had a kindle before the Kindle fire ( and I waited for the HD version) that I loved but was becoming limited since I also wanted to convenience of checking email and going on the internet, following links in a ebook etc.  I was so in love with my regular kindle and was a reading fool on that thing. I had a relationship with it. Let’s face it, I slept with it more than I have any man. Lol.  Giving it up and moving on was not an easy decision.Kindle vs Kindle Fire HD vs Fire HDX.Kindle:  Love the light shining on the book rather back lit.  It is far less stressful reading.  The gray background allowed me to read forever easily.  I loved how easy it was to organize books. However, it had become limited.  I couldn’t really surf the internet, magazines and pictures wouldn’t work on it well and it was black and white.  Pretty sure you know the rest.Kindle Fire:  I don’t by the first of anything because it will improve and become cheaper.  The biggest issue with the kindle fire was it didn’t have a reader and I do use that often.  The front page was a bookshelf which is ok but couldn’t organize like the reg kindle.Kindle Fire HD:  I hate the carousel on kindle fire HD.  It’s a circle of icons in which the last thing you opened goes up there.  Want it or not.  You can delete from the carousel but something else will pop up there that is on your device. It has a set number of icons it wants there and it will keep it filled.  Grrr.  I wish it would just go away.  I liked how I could organize my books on the regular kindle.  That said, there are apps that make that happen so it makes life easier. You know there HAS to be an app for that!  Over all the organization isn’t bad. It’s simple to use.  My six year old can use it no problem. But then again, kids are born knowing these things today.  Being back lit vs light shining on the book isn’t as easy to read as the original kindle was.  The back light can be adjusted way down which is a plus. I don’t think this is a big issue to most people.  I’m dyslexic and having dimmer light on the gray background rocked!  I could be a reading fool.  I can’t read as long on this.  As I said though for most people that probably isn’t an issue.  After my withdraw from my original kindle I love this one.  SO much more you can do with it!!  The battery doesn’t last like the original but we are doing WAY more with this one than just read.  AND naturally there is an app for that!!!  There are battery savers that shut down what isn’t needed and does make a difference in battery life.  Considering with I do however I think the battery isn’t bad. I play music and a game at the same time or music and read, music and read.  I am asking a lot! I was use to the other battery lasting for weeks.  One plus is my phone charger works for the kindle.  I’m just overall too happy with the upgrade to Kindle Fire HD.HD vs HDX.I got the HD with Ads because I didn’t care to pay to not have them. I’m really glad I did that.  I like the ads.  There were some movie and TV trailers that I would have otherwise missed.  Product ads you never know but they aren't annoying at all.My son bought the HDX.  He loves it.As far as I can tell the big difference is with the HDX you can have Wifi and cell towers.  Oh and the live help.  I asked if I could upgrade because it came out right after I bought my HD. The answer was no, I would need to sell it myself.  I’m glad I didn’t. I don’t need to use cell towers.  Some might where they live but I don’t.  As for live help, once you learn your kindle do you really need that?  I didn’t for the price difference.  Last I knew it was a good $200 difference.  I’m sure the price will go down, the HD will be priced at peanuts and it will all balance out in time.  It seems about a year is when the big price change happens.Good luck with your new decisions!", "Title": "Kindle vs Kindle Fire HD vs Fire HDX", "Date": "January 30, 2014"}, {"Author": "Juan Pablo", "ReviewID": "R1MBQBC0JCA59Q", "Overall": "4.0", "Content": "A very smooth tablet. Everything runs fast, games never lag and things load very quickly.My only complaint is that the camera is very sub par. The image is extremely poor, the quality is that of a phone camera from 2004.", "Title": "Works very smooth", "Date": "January 28, 2014"}, {"Author": "Heather Mason", "ReviewID": "RF2YYPAUHX6D8", "Overall": "5.0", "Content": "I love my kindle, best gift my husband has given me for Christmas.  I do everything on it, check mail, play games and read.", "Title": "I love my kindle", "Date": "January 28, 2014"}, {"Author": "1Rare1", "ReviewID": "R177QW1Q0G8GQA", "Overall": "5.0", "Content": "We purchased this as a Xmas present for our 6yr old daughter.  We own several Apple products, but no Amazon electronics.  I was reluctant to start over with a new eco-system, but we are Amazon Prime customers so the added content was appealing.  I do like the parent features on the Kindle Fire.  They are simple and fairly intuitive.  My biggest concern was their app store.  As they have not drawn nearly as many developers to their store as Apple or Google.  With that said, so far it has not been an issue.  Our daughter has been able to find most all the apps she was looking for.  I think as the Kindle continues to gain traction, the developers will obviously go where the customers are.  I'm highly impressed with the device itself.  Some of the motions aren't as smooth as my Ipad, but not terribly noticeable.  It has a  very nice picture resolution.  Much better than my Ipad 2.  The hardware is top notch and at this price, hard to turn away from.  I would definitely recommend this as a purchase for younger people.  I also think, depending on your needs, it works quite well for adults.  The Silk web browser works fine and hasn't presented any noticeable disadvantages.  All in all, nice purchase.", "Title": "Pleased so far.", "Date": "January 10, 2014"}, {"Author": "Angel", "ReviewID": "R2V0JYHG2EXR25", "Overall": "5.0", "Content": "I bought the Kindle Fire HDX 7 for my husband for Christmas. I was finally able to completely surprise him this year!  He was flat floored. It is hard for him to put down, and he keeps finding more things he can do with it. Lol. I am the \"best wife ever\" right now.", "Title": "HDX 7", "Date": "January 10, 2014"}, {"Author": "Lynn McNamee", "ReviewID": "R1QNHHGV4JI2JQ", "Overall": "4.0", "Content": "I have owned the first Kindle, the second one, and the first Fire. My hubby got the Kindle Fire HDX 7 for me for Christmas this year.I hadn't asked for it, as I was still happy with my Fire, but after using it a bit, I was really happy to have it.The display is clearer, and there are many new features.I did have one small issue:I plug in a headset to use my Fire at night in bed. In the morning, I unplug it and just use the speakers during the day. However, the speakers occasionally wouldn't work. I discovered the problem - a faulty jack. To make the speakers work again, I would have to plug in and unplug the headset again.I called Amazon CS, and they sent me a new one. (One wonderful thing about them is that I was allowed to keep my original until the new one arrived. Since that was the only problem, I was very happy about it.)The new one has the exact same problem.Because of all the horror return stories and because it's a minor issue, I'm just going to keep it. Also, my fear is that this is just a design flaw that may be present in all or most of them.Other than that, I LOVE my Kindle Fire HDX! :-)", "Title": "Book Reader, Game Player, and One Weird Glitch", "Date": "January 10, 2014"}, {"Author": "steambeaver", "ReviewID": "R2CXY1F05EHQBI", "Overall": "5.0", "Content": "got this for my IT techie daughter, she loves it, got it on the one day special, shipping was fast.", "Title": "great gift", "Date": "January 10, 2014"}, {"Author": "Robert Konka", "ReviewID": "R3M79UGP3GKLWM", "Overall": "5.0", "Content": "My wife loves it.. The color is nice and bright, the system is quick and easy for her to learn to use.  My wife is a beginner when it comes to electronics, but she treats it just like a laptop and is very happy.", "Title": "she loves it", "Date": "January 10, 2014"}, {"Author": "Laura Monson", "ReviewID": "R1C9HS2PVY3BQC", "Overall": "5.0", "Content": "My Kindle goes every where with me. It is so much better then I thought it would be..  I bought a second for my Grand son an he never puts it down.. Good or bad he loves it too.it does everything an more than an Ipad.. Love it", "Title": "The best thing ever.", "Date": "January 10, 2014"}, {"Author": "Kayline Allison", "ReviewID": "R2D3I778EJGFU6", "Overall": "5.0", "Content": "I loved the fact that I could use my thank you points to apply to this purchases payment.  Kindle's speak for themselves.  I am glad that I got the smaller one, it fits nicely in my purse.", "Title": "My very own Kindle Fire", "Date": "January 9, 2014"}, {"Author": "Tamara Zylstra", "ReviewID": "R2CC3VG6VDHQ9V", "Overall": "4.0", "Content": "This is my first Kindle. It has awesome graphics but it is hard learning where everything is. It's a learning process. Yes I would recommend it to friends.", "Title": "Kindle Fire", "Date": "January 9, 2014"}, {"Author": "Patricia Smith", "ReviewID": "R1STU5XVLO7U29", "Overall": "5.0", "Content": "It is easy to use; light enough to hold for 30 minutes or more without causing pain or fatigue. images are very clear and most of all the battery life is excellent. I have used it everyday for last three weeks.", "Title": "Kindle Fire HDX 7\"", "Date": "January 9, 2014"}, {"Author": "Mary Chitwood", "ReviewID": "RDQ06875YY0CU", "Overall": "5.0", "Content": "What can I say. I bought two of them for our girls. They absolutely love them. Can't seem to put them down. Thanks.", "Title": "Love it.", "Date": "January 7, 2014"}, {"Author": "ZIPPER BOOKS \"ZIPPER BOOKS\"", "ReviewID": "R3CCXF8UL6CD2B", "Overall": "5.0", "Content": "got it on Black Friday prices,  pulled out of a drawer Christmas Eve and asked if she knew anything about it, she didnt want to open cause she didnt want to try to return, but when she realized what it was she was screaming like a little girl, a 52 yo little girl, nice present, nice free apps to get", "Title": "replaced her Kindle from a couple years ago", "Date": "January 7, 2014"}, {"Author": "Brian", "ReviewID": "R7REZXFE1RNUB", "Overall": "5.0", "Content": "I really love the screen and makes reading my kindle books so much easier.  The videos work great with my prime membership.  The negatives are that you are restricted to the Amazon app store which has less then the Google Play store (much less).  Also the battery life is not the greatest when reading.  I know I am spoiled by my old Kindle but you can always wish for more battery life.", "Title": "You got to love this", "Date": "January 7, 2014"}, {"Author": "donna dye", "ReviewID": "R2Q1X5I3XN6MZP", "Overall": "5.0", "Content": "It is the right size and easy to take with you. It was a gift for my husband but it greets me since I ordered it.", "Title": "kindle fire hdx 7", "Date": "January 7, 2014"}, {"Author": "Elaine L Jacques", "ReviewID": "R35QLAP71Q2QC0", "Overall": "5.0", "Content": "just plain enjoy it wish it would have a basic instruction booklet, I purchased an instruction guide, would have rather had something in my hand to follow instead of jumping screen to screen", "Title": "kindle fire HDX", "Date": "January 7, 2014"}, {"Author": "Chris Hedlund", "ReviewID": "R6M2N0AOJ8CD5", "Overall": "2.0", "Content": "I had high expectations for this device. I tried with all my power to like the Kindle. But in the end, I will be returning this device. The hardware is excellent, and the user interface is pretty good as well. But odd behavior kept occurring. The device once went into a boot loop while I was at work without a charger. It continuously rebooted all day long. Nothing I did would stop the boot loop. Finally when I got home and plugged it into the charger, it booted back to the UI. I also have been noticing the screen flicker at times. It's more of an annoyance than a problem. There are other odd things that I can't recall at the moment. But ultimately, it's the battery life that prompts me to return the Kindle. Fully charged at 100% and left over night will find the device down to 88% without use. Then, when I pick the device up and actually use it, the battery is down to needing another charge within 1 or 2 (maybe 3) hours. Not heavy usage either, playing Candy Crush then browsing Facebook will do it. One time, I plugged the Kindle into charge before leaving for work, only to come home eight hours later and find that the screen was still on, and the device hadn't gone up 1% in battery charge. Another time, I plugged the device in for the night at 68%, went to bed and woke up to find the device charged only to 77%. Meanwhile, my Nexus 7 was at 14%, plugged in at the same time and was at 100% the next morning. I just can't have a device that I am constantly worried about keeping charged all the time. So, in the end, this device has been boxed back up and will be going back to Amazon. I hope to give the Kindle another try some time in the future.", "Title": "Disappointment", "Date": "January 3, 2014"}, {"Author": "Mika McFadden", "ReviewID": "RZNCF5I12M8HR", "Overall": "2.0", "Content": "Kindle is great, the problem is that my 9 year old had instant access to 1-click purchasing and had ready spent over $100 on Amazon before I saw what was happening.", "Title": "Be careful with kids!", "Date": "January 3, 2014"}, {"Author": "Robin Goutremout", "ReviewID": "RNICQB2RX5KPG", "Overall": "2.0", "Content": "I did not like the way the camera was. and also thought you could use a printer with it but could not do so..I am looking at the kindle fire hdx 8.9 but not sure if i will. the price is a bit high might have to go with adifferent tablet all together.", "Title": "was disapointed", "Date": "January 3, 2014"}, {"Author": "t schmoeger", "ReviewID": "R774B8D7O56BB", "Overall": "4.0", "Content": "Updated Review:The Kindle Fire works great for most things you can normally do on the internet, and it has clear sound and picture display. I bought the tablet so I could watch my television shows while I eat without having to hall around my laptop around. And for this purpose I would give the Kindle Fire a B+.After my initial posting, describing my disappointment with Kindles ability/or lack there of to watch free streaming media, Amazon reached out to me. Which really impressed me! They pushed out some updates to me, gave me pointers on how to ensure I am on the tablet version of common websites (since videos won't work on all of the regular sites), and ABC published an updated app for viewing episodes. Now I am largely happy with the Kindle's ability to watch streaming videos. The only downsides I have experienced is the Hulu is not available (you can access hulu plus but not the free site), the volume/sound projection abilities don't seem as good as some of my other devices (like my ipod), and you can only have one window/tab open at a time. So for instance if I want to check the news during a commercial you can't do it- which is a downside for me since I am a multi-tasker. However, I am largely happy with my purchase, and am definitely happy with Amazon's customer service!", "Title": "Good device", "Date": "January 3, 2014"}, {"Author": "David P O'Bryan", "ReviewID": "R360S3F00I77YS", "Overall": "5.0", "Content": "It delivered improved performance as advertised.I gave it to my wife for Christmas.  She gave me an I=Pad Air and I was so diapponted by comparison that I returned it.If it is offered at $259 again, I will buy a second unit that will replace my Nexus 7.", "Title": "I am totally satisfied with this product.", "Date": "January 3, 2014"}, {"Author": "Susan Greaves", "ReviewID": "RZLC3ZEEAF8NK", "Overall": "2.0", "Content": "The battery runs out way too quickly. Not sure if the item is defective or if this is the case with all kindle's.", "Title": "Battery runs out way too quickly.", "Date": "January 3, 2014"}, {"Author": "samantha", "ReviewID": "R3LYU9FECWVUXE", "Overall": "5.0", "Content": "Best purchase my husband could have made for me (aside from my engagement ring)! He almost purchased the Nexus 7 but the HDX was $50 off during cyber Monday, so he took a chance. After a week of playing around on it when I wasn't looking, he was 100% positive he had made the right choice! There is nothing about this product I dislike! The screen is so brilliant and crisp, and the mayday feature is wicked cool! I would advise people to stop throwing there money away on iPads and enjoy a kindle fire HDX!", "Title": "My husband is brilliant!", "Date": "January 1, 2014"}, {"Author": "ldytubird", "ReviewID": "R1TEXQK31SW1HX", "Overall": "5.0", "Content": "I love my Kindle Fire HDX. I can't hardly put it down. I carry it everywhere just in case I get an additional chance to read.", "Title": "Review: Kindle Fire HDX", "Date": "January 1, 2014"}, {"Author": "Erycka923", "ReviewID": "R16A6A20NA8MCR", "Overall": "5.0", "Content": "I absolutely LOVE my new Kindle!! It is light, the picture is CLEAR, and fits perfectly in my purse!! I've told everyone I know they need to buy one!!", "Title": "Best 2013 Self bought Christmas gift!", "Date": "January 1, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2O1E1RZ6IF0OE", "Overall": "3.0", "Content": "Amazon has tweaked the android operating system to prevent using Google Chrome as a browser and to prevent using Google Drive as a cloud storage utility.  In effect then, you have to use the supplied browser and use Amazon's cloud storage.  They may work OK, but I am frustrated by not being able to use the systems I have been using for quite some time.  By the way, I am able to use all Google systems on my Apple iPad!!!  In retrospect, had I known what I now know, I would have bought a Nexus rather than the Kindle Fire HDX.All that being said, I guess it will work as a reading and music device so long as I am satisfied with the Amazon reader and music player - which I am since I use them on the iPad.", "Title": "WARNING!!!  WARNING!!!", "Date": "December 27, 2013"}, {"Author": "Baaaaaay", "ReviewID": "RPAK3PS8DP106", "Overall": "5.0", "Content": "My first tablet.  It's fast.  Much faster than my HTC sensation 4g.  It also has amazing picture quality.  I also got Prime and have been watching shows almost every day.  It came already registered to me, which was convenient if not a little scary (I'm a privacy rights supporter).My favorite thing about it is the battery life.  I can go days without plugging it in.  I am not constantly on it, but I do use it for a few hours each day, about half of which is streaming shows.  I'm taking a trip soon and I'm stoked to have something I know will last the whole plane ride.Finally, the keyboard is great and the Swype works much better than it does on my phone.  It's very convenient for typing and entering information.All in all I'm am quite satisfied.  I'm writing this about a month after receiving this and have had quite a bit of play time on it.", "Title": "Awesome!", "Date": "December 26, 2013"}, {"Author": "Dennis Meehan", "ReviewID": "R1KVHBQ966TIVQ", "Overall": "5.0", "Content": "I bought my Kindle HDX for my son as a Christmas present. It is a terrific little machine and works flawlessly. The price is also unbeatable. It has enough apps to keep him busy and I appreciate the parental controls. We don't have any issues with the screen. I like it so much that I'm going to buy one for myself despite the high switching cost of a large iTunes music collection.", "Title": "Perfect for Me", "Date": "December 26, 2013"}, {"Author": "Chres parker", "ReviewID": "R3TPKAOIFA3SHQ", "Overall": "4.0", "Content": "Haven't had enough time with it yet but I' m pretty haapy with my HDX so far. I've noticed a few quirks, but it may be just me. Wish it came with iespell checker.", "Title": "So far so good", "Date": "December 21, 2013"}, {"Author": "Bobio", "ReviewID": "R2DR85XKYZLTTD", "Overall": "5.0", "Content": "I bought this because my Kindle Fire HD was refusing to function when there was still about 38% battery life left. The HDX is slimmer, lighter, and the operating system is more user-friendly. There are more pixels so the display is a lot clearer. I was surprised to find the sound quality of the HD is better than the HDX. But the battery life of the HDX is much better. Overall, I'm glad I bought the HDX.", "Title": "I love it", "Date": "December 20, 2013"}, {"Author": "obiken \"obiken\"", "ReviewID": "R1KTPMCRETD6C2", "Overall": "5.0", "Content": "First of all if you are deciding what is the best tablet good luck, it depends on what you want it for. I owned the Apple mini with Retina, and I will again. However, if you are looking for the fastest WiFi, the best sound BY FAR, the best books, and movies, the Kindle Fire HDX is your huckleberry.You cannot beat the Apple for ease of use, or the apps. IF Kindle had access to all the Apple 3rd party apps, due to the price difference, it would be game over.However for Netflix, and internet browsing its not even close. KFHDX is way faster. So yes, sometimes the experts are right!!", "Title": "Just the fastest period!!", "Date": "December 20, 2013"}, {"Author": "yellowstar2000 \"Candice Collins\"", "ReviewID": "R3KSLT6INMGP72", "Overall": "5.0", "Content": "Love love love this!!! Couldn't be happier!! Well... it could always be better but I have yet to find anything I do not love about it!!", "Title": "perfect gift!!!", "Date": "December 17, 2013"}, {"Author": "Bob Feil", "ReviewID": "RHB6OLQKOM7AL", "Overall": "5.0", "Content": "Totally surprised her with it. She is constantly looking for books to read, now she just looks them up and she is all set. Skypeing our grand kids is a special treat as well,It's like having a lap top only smaller. Great product, would suggest this to friends and family.", "Title": "This was a Birthday gift for my wife.", "Date": "December 17, 2013"}, {"Author": "MAMALICIOUS", "ReviewID": "R17CBAYTO62Y23", "Overall": "5.0", "Content": "Better than my iPad.  Affordable, efficient, and fun.  Android based little powerhouse.  If you're looking for a mini tablet or full sized one, check the new Kindle out.", "Title": "Great tablet.  Better than my ipad.  Check it out.", "Date": "December 6, 2013"}, {"Author": "cbcloud", "ReviewID": "R2PWKOBP94CW81", "Overall": "5.0", "Content": "A great tablet at a great price.  Display is amazingly sharp, and the android OS is very fast.  I've had it less than a month, but am using it as much as my laptop.  Battery life is much better than my 4G cellphone.  Only improvement I can suggest is a forward-facing camera in addition to the rear-facing one.  This is my 2nd Kindle, and both of them are excellent quality and simple to use.", "Title": "Great tablet at a great price...", "Date": "December 6, 2013"}, {"Author": "Lynn Johnson", "ReviewID": "RN7VZIMNEU8K1", "Overall": "5.0", "Content": "I bought the original Kindle Fire, which I liked, but this edition I love. It is so light, and just the right size to hold.", "Title": "Love it", "Date": "December 6, 2013"}, {"Author": "Ted augustine", "ReviewID": "R1YLK1FLVBANG0", "Overall": "4.0", "Content": "Only thing that is really lacking is a USB port otherwise it is a great little product. Was so impressed I bought another one for my son.Ted A", "Title": "Rating on Kindle Fire HDX", "Date": "December 6, 2013"}, {"Author": "vg", "ReviewID": "RBOYKJ71PSKOT", "Overall": "5.0", "Content": "after 2 months of deciding between the hdx and nexus 7 i went with the hdx and could not be happier.its everything amazon claims it to be.great purchase.", "Title": "hdx review", "Date": "December 6, 2013"}, {"Author": "Christopher Shively", "ReviewID": "RV7P6HQ70US4V", "Overall": "3.0", "Content": "Hardware is great! Very light, great screen, good battery life. OS & Web browser is good. App store is awful!!!!!!!!!! If you get this tablet with plans to use it to entertain your child(ren) Disney or Disney JR apps are not available in the app store. No Google Chromecast. The child or toddler apps I did download would freeze, not only the app but also the tablet! Also they would have annoying advertisements in the middle of use of the app and the \"X\" to close the ad would never be in one place. So my 3 year old son would hand me the tablet every time an ad came up so I could close it for him. This got pretty annoying! After a few days of using it, I just found myself not happy with it. I decide to reluctantly returned it. This device has so much promise. All it needs is a suitable app store. I guess I'm going to pay $200 more for and Ipad which I didn't want to do in the first place. Amazon you need to fix your App store", "Title": "Great Hardware, Horrible App store!", "Date": "December 6, 2013"}, {"Author": "Music fan", "ReviewID": "R1NRQS3A1ZVORH", "Overall": "5.0", "Content": "I have the original Kindle Fire which I have really enjoyed.  Also have a full-size iPad which is a great size for watching movies in bed, but really too big/heavy to play games.  The original Kindle Fire has only 8 GB storage (partly taken up by software) so I wanted another smaller tablet.  It was between the new Kindle HDX or the new iPad mini.  One thing I didn't like about the iPad mini (besides the price tag) is that the bezzle on the long sides is so narrow, it is hard to hold the device without getting your thumb on the display (which screws up games).  When I saw the HDX on sale on Cyber Monday, I grabbed it.It's fast, thin, light and easy to hold for long periods of time.  I can't believe how light it is compared to my KFire! There are several design changes, such as the ability to show the percentage the battery is charged in the little icon in the top right corner. You have to swipe down from the top of the display to access settings and other utilities.  I got the 32 GB version, so there is plenty of room for games and other apps.  I did download a Prime Instant Video to watch off-line, but I don't like the small display for watching movies.About that display -- I compared the HDX to the original Fire, looking at the same page of a book that has alot of white space on it.  White is a color, and like all colors, it can be \"warm\" or \"cool.\"  A cool white is \"bluish\", and a warm white will be a little yellowish.  When I compared the 2 kindle displays for a book, I was shocked to see something I never noticed before.  On the original Fire, the white is \"cool/bluish\" and there is yellowish tint seeping in around the edges of the pages of the book I was comparing!  This never bothered  me; as I said, I never noticed it.  On the new HDX, the opposite is true --  the color white is warm (yellowish) with the blue/purple (that so many have commented about) seeping in around the edges of the book.  I doubt that this will bother me, and I feel that the people who complained about this and sent back this beautiful little device because of it, need to get a life!  BTW, the page on the HDX doesn't look yellowish to me at all; it is only when compared side-by-side to the original Fire that you can detect the different tints to the white color.I love playing games on the HDX, as even fast running games (such as my favorite Temple Run 2) work without stalling.  And, I got Temple Run Oz (finally) which was not compatible with the original Fire.There are some design features I don't like, such as the way the charger sticks in at an angle.  But charging is very fast using the included charger. My only real issue now is the battery life.  I am currently charging it up, and I am going to see if I can get anything close to 10 hours of \"mixed use\" on it.  (Yes, there are ways to extend battery life, such as turning off wifi when not using it.  Search on the internet for other tips.)Edit about battery life:  I usually find that when products are advertised as \"up to X hours on a single battery charge (depending on settings, usage, blah blah blah)\"  I usually get half that. What concerned me about the HDX was that I had fallen asleep with the HDX unplugged, watching a PREVIOUSLY DOWNLOADED movie (a 2.5 hour movie downloaded in \"better\" quality; after it finished, the display went into sleep mode)-- the next morning, the battery was showing only 35% charged from fully charged the night before.  Since many people posting on the forums with battery problems were told to do a \"hard reboot\"  I tried that then fully charged the battery again (luckily, charging is pretty quick.)  Downloading music, and letting the display go to sleep mode, the HDX lost only about 10% per hour.  But as soon as I picked it up and played some games for a little while (like Temple Run 2) the battery much more rapidly depleted (this is with wifi turned on, as music was simultaneously downloading).  Then I recharged it, and again tested that same 2.5 hour previously downloaded movie -- with wifi turned off, \"airplane mode\" turned on, and brightness set at about 70%, the battery drained from fully charged to 65%. So, finally, I downloaded a 2 hour SD quality movie to my HDX, and going from fully charged, with wifi off, and brightness lowered to about 50%, the battery went to 88%, losing only 12%.  Yes, a big improvement over my original KFire which lost double that, 25%, under the same conditions.When I got my HDX it was about 70% charged.  Looking in the settings, I saw that the software was up-to-date.  I was able to download content, read, and play games, without the HDX turning itself off and rebooting (as many have complained of).  The next morning, I saw a notification that there had been a software update -- one thing that was changed is that you can now put apps and books into \"collections.\"  Not only that, but apparently my HDX \"synced\" wirelessly with my iPad Kindle reading app, where I had already put some books into collections.  Those same books now appear in collections on my HDX without my doing anything. Thank you Amazon.I give this 5 stars, certainly in comparison to the original Kindle Fire.  In general, this HDX is spectacular and the price is great.", "Title": "Great Small Tablet; Love It!", "Date": "December 6, 2013"}, {"Author": "Byzantine Dixie", "ReviewID": "R1T5JCVH9SIFRY", "Overall": "5.0", "Content": "I have been straddling the Apple / Android fence for a while now, with one foot in both camps.  But the time came to declare allegiance.  Music and video purchases are less and less dependent on hard media like CDs and DVDs and are becoming more and more cloud based.  Which cloud…that was the decision to make.So Amazon came out with fireTV…and I took the plunge and decide to go with Amazon for my video purchases.  I have been a prime member since its inception…and it is the first place I go to when I am looking to buy something.  I love Amazon…probably in an unwholesome way.With that decision behind me I was now free to find a device to take entertainment with me when I travel for work.  Do you have any idea how long and painful it can be to copy DVDs into digital files to take along when traveling…I simply did not have the patience to convert all 14 seasons Dallas!  I needed a device that would hold a number of videos to get me through at least 2 weeks overseas at a time.  Reliable streaming overseas is generally not an option for a variety of reasons.And so I bought a Kindle FireHDX (64MB, no ads) and have been absolutely delighted…I seriously couldn’t be happier.  It is so FAST…compared to my android ASUS transformer tablet.  The video quality is beautiful.  The sound is great and it is extremely simple to download videos…even Prime videos…to take along on my travels.Of course, nothing is perfect.  There are some disappointments but they are relatively minor.1) Battery life is disappointing if wifi is not disabled.  That has been my experience.  I will lose 15 – 20% overnight if I leave the wifi on.  With the wifi off…battery life is very good.  If there is an option to turn off wifi after being asleep for a while…I don’t know about it yet.  Long term, hopefully something like this will be developed in a software update.2) Lack of a mini HDMI out.  I like to plug my device into the HDMI ports of hotel TVs and watch my shows from the bigger screen.  When I realized too late that it had no HDMI out, I bought a Tronsmart miracast device.  It will work but not as smoothly or easily as a simple cable would.  I think the miracast is not quite ready for prime time yet.  It is not the end of the world if I can’t hook up the hotel TV.  Watching directly from the Kindle works well.3) Apps…need more.  I once had a Blackberry Playbook.  What awesome tablet that was…really.  Fine quality device, perfect in every way…except for the limited number of apps.  Amazon has to make this a priority.  And the apps need to work beautifully…like they do on my iPhone (see, I said I had one foot in both camps!)4) Flicker.  I notice a disturbing flicker with one of my apps.  Haven’t let determined if this is strictly a single app issue or if it will show up elsewhere.  I’ll update later if it is more than just this one app.All in all I feel this was a most self-indulgent purchase…it is such a sweet device and the perfect travel companion.  (Don’t tell my husband!)", "Title": "Completely Self-Indulgent Purchase - Absolutely Delightful", "Date": "April 16, 2014"}, {"Author": "Roy Cooper", "ReviewID": "R1U8J3ILJ3NJ6P", "Overall": "1.0", "Content": "I bought this for my wife and have had it maybe month and everything stopped working can not even unlock screen when you reset it.", "Title": "kindle fire 7 Quit working", "Date": "April 1, 2014"}, {"Author": "Big Momma", "ReviewID": "R2CVCQO743K4DM", "Overall": "5.0", "Content": "Loved it! It took a minute but I caught on to it. Smooth operation of software and other functions. The input buttons are on an angle and it's a bit different plugging cords in. I'm used to a home or wake up button. I don't like to take my kindle fire HDX 7 outside the protective case just to get it going again. I wonder if the power button is gonna eventually wear out.", "Title": "Easy To Use", "Date": "March 29, 2014"}, {"Author": "Moosie", "ReviewID": "R2HVQRY3MPRBZN", "Overall": "5.0", "Content": "Oh My God!  I LOVE this Kindle.  This replaced my old Kindle Keyboard.  I didn't realize I was living in the dinosaur age with that until I bought this new one.  I wanted to treat myself to an early birthday present.  Amazon really pulled out all the stops with this one!  I'm so proud of this Kindle.It does just about everything a computer can do.  The colors, graphics are awesome!  Games on this Kindle HDX device are so vivid, clear and work flawlessly.  I love having access to my music, the downloads are faster and easier.  I downloaded a classical music radio app, and I am so pleased with this app.  I also love reading my books on it, the screen is easier to see, looks better.I am so happy with this purchase.  This thing is so precious to me.", "Title": "Happier Than a Child at Christmas!", "Date": "March 29, 2014"}, {"Author": "Khnet", "ReviewID": "R1KDLWKBIFL91I", "Overall": "5.0", "Content": "Fantastic tablet, great for kids too. I love the kindle free time features and limits you can set. Easy access and fun to play with", "Title": "Love it", "Date": "March 27, 2014"}, {"Author": "bluewolf37", "ReviewID": "R2XGD9807ANPL7", "Overall": "4.0", "Content": "I have owned several different tablets and didn't wow me like i was hoping it was going to.Pros* The speakers are wonderful compared to all of my old tablets and some old laptops.* The touchscreen is the most responsive touchsreen that i have ever used. (i didn't realize my old tablet had lag until i used this)* it's fast all around from loading apps to starting a movie* The screen is beautiful when watching movies.* it feels very solid in the hands like it is built well.* If you have amazon prime you have access to the kindle lending library and amazon prime videos (this was the reason i decided on kindle this time)*the app store has comixology* It has a feature called Quiet time so you don't get notifications wanking you up when you are asleep* Wireless reception is very strong and stable.* Amazon music store is normally cheaper and better than itunes and the play store. (I love the fact that i don't have to download my music to every device i own to listen to it)* it is a good price.* Some movies and books have a wonderful feature called X-Ray that gives you useful information. In movies it can tell you the actors and actresses on screen and what song is playing. If you click in the names out connects to imdb for more info.Cons*you cannot connect to the play store and the amazon app store is extremely lacking and/or outdated. You can sideload some apps but any that connect to google services wont work 100%. For example I sideloaded chrome and even though I can use it to browse i cant sign in to sync bookmarks with my computer and phone. I also got the youtube app and it worked but once again you cant sign in to see all your subscriptions. Gmail is compleatly useless...Etc...*There is a blue haze around the edges of the screen that is almost painful when reading. I ended up changing kindle reading settings to a night mode so it didn't bother me.*apps that had no problems on other tablets or phones seem less stable on the kindle. I bought a game on the amazon app store and it ended up blue screening the device which was surprising since i never had a tablet give me the blue screen of death before (but to be fair it hasn't had a problem since then )* battery life when watching videos is worse than my asus tablet* you don't see the date when you pull down the notification barLast thoughts*It is probably a good idea to add a password to the kindle because it is always signed into amazon. This includes their kindle books store, app store, music store, and physical product store. So if you have kids or fear it may get stolen a password is a good idea. I would also look into the parental controls.", "Title": "It's good but not great", "Date": "February 25, 2014"}, {"Author": "JVR Mom", "ReviewID": "RQQZMC1XUET3I", "Overall": "1.0", "Content": "This was the 4th Kindle Fire we recieved.  #1 wouldnt connect to WiFi #2 Battery dead less than 90 mins #3 dead battery AND WIFI issues... i continues to give them a try becuase the Kindle Free time seemed like a good value for my 3 yr old.Unimpressed by Kindle Free time content.  Id prefer to spend a few bucks each month and own the content of my choice.  We will purchase another MS Surface Table and a kid friendly case.", "Title": "Unreliable and Unimpressive", "Date": "February 25, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2OQ0Y3K72W9YR", "Overall": "2.0", "Content": "I bought my very first tablet, the Kindle Fire. I was so excited when it arrived. I put on the screen protector, put it in it's case, set it up with my acct information. I was in awe of the look and feel of it. It is beautiful! The picture and sound are amazing too. If you love Amazon, this is probably exactly what you want!I went into the situation blind. I read a lot of kindle books so I thought the Fire would be great. I didn't understand that a tablet would block you from using specific programs they deem competition. I use Google Music, I pay for unlimited music each month. It never occurred to me that I wouldn't be able to stream my music over my tablet! It doesn't make any sense to me! My HTC phone, which uses google, lets me download Amazon apps so why wouldn't Amazon let me use Google?!I went into chat with an Amazon rep to find out if there was anything I could do to get my music on it. They said no, they were sorry. They said I was free to buy music from them tho. Of course I am but I don't want to buy every stupid song that pops into my head. I'd go broke!And they don't offer anything like unlimited streaming that I could switch to.In looking through the kindle apps, I also learned that the Google apps that are offered (maps, gmail) had horrible ratings with comments that they don't work at all.I am a HUGE Amazon fan. And even through this, I am a loyal customer. But I am  so deeply disappointed. I am disappointed that they have chosen an isolationist approach to their product. Having my music available to me would not have taken any dollars away from them. I still would have bought my books and movies through them. Probably a lot more than I do now. I don't buy my music thru Amazon, I buy it thru iTunes. I always have and I always will. I keep my music on Google Music. I use the unlimited music to hear new songs so I know if I want to buy it or not. By not letting me stream music they've lost book and movie purchases. They never would have had much music business from me. Maybe some, bec I might be too lazy to use iTunes. The thing is, I have my way of doing things. I use many products. I don't want to feel contained or limited or be forced into changing for literally a BAD BUSINESS decision by Amazon.I wanted the kindle bec I thought it might be nice to use in the kitchen or around the house specifically for entertainment purposes. Reading, music, movies, tv shows. A sort of all purpose entertainment center. Like they advertise. What they don't say on their product page is that you won't be able to use Google services. It should be very specific for people like me who are new to the tablet world. I bought a case and protective covers and the warranty.  Amazon is charging me money for the returns and some of it can't be returned. I feel like they withheld important information and now I am paying the price for it.I did some research last night and decided to go with the second generation Nexus. It will stream music, allow Amazon apps and it has a cute keyboard.  They don't force me into using them exclusively!Amazon is really on the wrong side of this!!", "Title": "What a heartbreak! You Can't Use GOOGLE!", "Date": "February 21, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R1FQDWQKM4SC43", "Overall": "1.0", "Content": "I spent months reviewing and comparing tablets, and as an avid Amazon-user I thought I had made a well informed choice. Wrong. This tablet honestly stinks. The technology seems half-baked. Some of the programs work flawlessly while others are glitchy and frustrating. For example, I can't even access the app store but the silk internet browser works fine! The app store half loads, and none of the links even work. It's definitely not my internet connection, because all of my other devices are running flawlessly. I read a bunch of blogs and tried doing a few things (resetting time/date settings, restarting the kindle, checking internet settings...) I am just so disappointed. As a Mac user, I probably should have shelled out the extra cash and went with the iPad. I am returning this tablet after only one day. Even worse, the Mayday button won't connect me to customer service! It just loads for a while and then reports an error in connection. A rare miss for my Amazon experience.", "Title": "So disappointed", "Date": "February 20, 2014"}, {"Author": "FromUtah", "ReviewID": "R21VGYTJJEXS5B", "Overall": "1.0", "Content": "This device is a handy little device, good graphics, amazingly large sound.  Runs fast, apps that come with it work fine.But...If you want access to all of the open source a freely available software from Google, don't buy this!!!  It is not available, nor will it ever be.  That mean no Google Play, Google Maps, Google Navigation, Google Search, Google Chrome, Google Docs, Google Translate... You get the picture.  Why would anyone want to limit themselves to the offerings at the amazon App Store with such a great little tablet?  Kindle Fire HDX is just a version of Android with an Amazon makeover.  Every aspect of this experience of using this device seems to be geared toward getting you to spend money at Amazon.  Right off the bat you are given a free month of Amazon Prime, the service that costs $79 per year.  They offer streaming videos, but, everything here is on Netflix.  Netflix has more.  Most TV series let you view the first episode for free, but all others cost money.Did I mention, the startup screen is a full-page add for some random irrelevant gadget on Amazon?  And, The top of the screen on the launcher page is, you guessed it, another link bar to Amazon Store Categories for you to accidently click when you want to slide down the top bar to check what messages have been displayed.Now, let's talk google.  Google invented the droid operating system and the google play store has everything under the sun for Android.  Apps like Google Chrome, Gmail, Google Maps, Navigation, Google Drive.  These are not available on the Amazon store.  They really make up the backbone of productivity on the Android system.  Amazon seems to only want you to use this for entertainment, on a pay-as-you-go basis.I'll be looking for a way to load generic Android, or selling this on eBay.Amazon, if you read these, please come out with a more open update for this device's operating system.  I feel like a sucker for getting this.Mine is for sale.", "Title": "OK, one star says I hate it, not the device, but the experience.", "Date": "February 19, 2014"}, {"Author": "Chad Homme", "ReviewID": "R1XOX3V4Y4DHGS", "Overall": "5.0", "Content": "My wife has had a Kindle for a while and I decided to get one.  This is nothing short of incredible.  Screen clarity is amazing, battery life is great.  Couldn't ask for a better reader/tablet.", "Title": "This is the tablet/ereader to get!", "Date": "November 13, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3ABTRL5D55PKW", "Overall": "5.0", "Content": "I've had every single Kindle Fire, but this new HDX is, hands down, one of the most innovative tablets ever. The two best features are the Mayday button and the song lyrics. No tablet that I'm aware of has any support even close to the Mayday button. You simply tap the onscreen button and, voila, a person comes on your screen and helps you. A real person you can see. The can't see you, but they can see your screen. I've used it a couple of times and never waited more than 10-15 seconds before they were right there speaking to me. AMAZING!Second, the new rolling lyrics with your music is awesome, however,  not many songs have the lyrics yet. I'm sure they're working on the data base, but the more current songs are available. On some albums some songs are done but not all. Great idea and hopefully Amazon is bringing lyrics in quickly.And let's not forget xray for movies. Tap the screen and you'll get a pop-up with movie info like the names of which actors are on the screen at any given moment. Awesome!Awesome machine... If it just had front AND rear facing cameras it would be perfect. It does have front facing, but not rear. Try it you'll love it! I hope the Mayday button catches on across the industry because support is usually so difficult! Way to go Amazon!", "Title": "It just gets better and better!", "Date": "November 13, 2013"}, {"Author": "Marwan", "ReviewID": "R1BLVD13LPN962", "Overall": "5.0", "Content": "I wanted a 7\" tablet, but I was not sure if I buy the Nexus 7 or the Kindle fire HDX. Eventually I went and bought this device and I am really happy and satisfied. It can do pretty much everything you need!! You can download missing apps from outside sources, so it is not a big deal. Its performance really great and I have never been disappointed so far, the only problem I noticed that this device missing a navigation apps and Google maps doesn't work as expected on it! Beside this issue, the Kindle fire HDX is flawless!", "Title": "Really good buy!", "Date": "November 11, 2013"}, {"Author": "William Mutschler \"Copper Moose\"", "ReviewID": "R3586VGYEYKRX3", "Overall": "5.0", "Content": "I debated heavily over this, putting it on my one and only thing for Christmas. I wanted to see the performance and size of this, including thin-ness. The color and clarity are simply stunningly fantastic -- better than any other tablet that I've seen. The FAA discount day enabled me to get it at 15% off, enabling me to afford the 64 GB  (my other spec wish-feature), even though I had to use my debit card because…….the day before. I had bought a reconditioned 8.9\" Kindle HD, with 32 gb the day before with Amazon Card, but haven't opened it, knowing that this would be here a day later.My kids have filled their Kindles with game crap, but I wanted the extra space to have more books downloaded at the same time, and more space for movies, music and 'future expansion space.'One might laugh, but as a comics fan I read the volume collections. A little small for my old eyes, so I'm sort of forced to use panel view. But, for USA Today, the smallest text size was just perfect. That is an auto format site, and works great.Finally, my OWN Kindle. I had been sharing one used by my son, but now, no more swapping. No drained battery for dear old dad.I don't see a speed difference yet (I'm not a gamer), but this thing is THIN. I'm hoping to get longer battery life with a smaller screen.The only thing so far is that I am adjusting to a smaller Kindle, having been using the 8.9 HD.", "Title": "Simply AWESOME display. Super THIN. WOW!!!!!!!", "Date": "November 11, 2013"}, {"Author": "Z. McMenemy", "ReviewID": "R32L4B8M3X1ZCC", "Overall": "5.0", "Content": "I love it. I went for the slow dumb first gen Kindle to this power house it is amazing love it", "Title": "That Upgrade", "Date": "November 11, 2013"}, {"Author": "Jamie", "ReviewID": "R10EP9KM6RIZK3", "Overall": "5.0", "Content": "I absolutely LOVE my new Kindle. I have wanted one for about a year so when I heard this new one came out, I definitely wanted one. The resolution is awesome, everything is very quick, I've even resorted to just watching Netflix with the Kindle instead of my TV. The apps/books download very quick and the battery life is awesome on it. The only gripe I will say I have is the fact that you can't change the opening background of it. The picture doesn't bother me but it would of been nice to be able to use my own picture instead of the one they gave. I can't wait to take this to the beach and be able to read my books and not worry! I would recommend this to anybody!", "Title": "I would buy another one!", "Date": "November 11, 2013"}, {"Author": "Cano85", "ReviewID": "R1CUE9EXJM83K1", "Overall": "5.0", "Content": "Love it!  Does just what I want it to do.  Sharp pics and fast.  A definite recommend.I've been waiting for over a year to purchase one and then the new HDX came out so I'm glad I waited.", "Title": "A great product!  A definite must have.", "Date": "November 10, 2013"}, {"Author": "Darren A. Wallace \"babysealclubber\"", "ReviewID": "R3VRPACW9K5RAP", "Overall": "5.0", "Content": "My wife loves it. I also have a kindle fire HD, and when I compared watching HD movies side by side there was a visible difference between the HDX and HD. The added 64 GB HD is awesome, my wife can now keep pictures, and she uses it for a lot of things. All in all, I really like the kindle, it's not too big, and not too expensive.", "Title": "Worth the upgrade", "Date": "November 7, 2013"}, {"Author": "Brian Jones", "ReviewID": "R2M7RD72L0KNTP", "Overall": "5.0", "Content": "I am a Apple fan from the ipod, to ipad, Iphone to Macbook Pro.  I have always felt that every tablet device paled in comparison the the Apple suite of products.  I was wrong.  After using for only a few days I was impressed.  The graphics are amazing (resolution and pixel density). The brightness is also better than the new iPad Air.I also like the new Mayday feature.  Seriously, Apple really dropped it on this feature.  Amazon definitely put the consumers first by allowing a live video chat user like directly to customer service.  They can solve problems easily by taking over your device to make fixes.It has a great battery life and it is super fast.  I give high recommendations for the Kindle Fire.  Apple, you better watch out......", "Title": "Apple, you better watch out.....The Kindle Fire is checking it twice!!", "Date": "November 7, 2013"}, {"Author": "Bill", "ReviewID": "ROPPLI9AGAFJS", "Overall": "4.0", "Content": "I have had this tablet a little over a week.  I enjoy it more as I use it more.  I used MayDay on the first day.  It worked as advertised. I was questioning about an App that I had on the Kindle Fire HD that is not compatible to the HDX.  I was told that APPS will be worked to take advantage of the higher quality display.  That seemed to be a reasonable answer.Even though I had the Fire HD, I never used the Silk browser much at all.  I am now familiarizing myself with this browser and that is going well.  I do have a slight bluish haze on the page as I read, but I do not find it distracting.  I viewed part of an episode  of a TV  program I bought through Amazon and the picture and sound were excellent.The weight makes this tablet easy to hold.  Unless I am sitting at my desk and propping up the HDX, I will normally remove it from the Oragami case.  The case works well when I need it, though.I have the HDX chiefly because I like Immersion Reading.  It performs excellently at this task.  And the light weight makes it easy to listen/read at night.  Sound quality is excellent also.", "Title": "A very good tablet", "Date": "November 7, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00CUTO69K", "Features": null, "ImgURL": null, "Name": null}}