{"Reviews": [{"Author": "Antonio Lazaro", "ReviewID": "R3IVSAZAGW0BNN", "Overall": "5.0", "Content": "One of the most common setbacks in the galaxy note 8.0 reviews was price. Yes, it's a bit pricy but if you like the pen feature, this tablet is worth every penny. Good hand writing recognition, excellent for taking hand written notes, fast response.", "Title": "Excellent product", "Date": "November 8, 2013"}, {"Author": "Tiffany", "ReviewID": "R1ZYQROV2BIFPY", "Overall": "5.0", "Content": "I was an ipad user however nice the ipad was it just didn't have ths abilities to do what i really wanted. This samsung note  does everything tge ipad couldn't  with the S pen it reads my handwriting and allows for me to take handwritten notes for class. I couldn't  be mkre pleased it is perfectly sized for school and a great upgrade from the iPad.", "Title": "samsung note over an ipad any day.", "Date": "January 19, 2014"}, {"Author": "denise leddy", "ReviewID": "RRFJ8I2FWM43S", "Overall": "5.0", "Content": "Samsung galaxy note is awesome !!!! I love it!! Fast shipping!!! The note is very easy to use and understand....super light!!!!just great all around!!!", "Title": "love it", "Date": "January 3, 2014"}, {"Author": "Happy Customer", "ReviewID": "R1NKIEFJYJANJH", "Overall": "5.0", "Content": "I bought this product for my daughter to take to here college classes. She couldn't be happier! She is amazed at how much she can do with it.  She's already ditched her cell phone and can do everything she needs with the Samsung Galazy Note 8. Delivery was right on time too!", "Title": "Great Product!", "Date": "January 7, 2014"}, {"Author": "FairyFire", "ReviewID": "RFYW119ZHXOO0", "Overall": "5.0", "Content": "I have had this tablet for a few months now, and so far I love it.  I have not had any problems w ith it at all thst were not us issues. I am not the most techy person. If I play a lot on it I have to charge it every day. It only takes a couple of hours to completely charge.  Which is is nice.  Reading doesn't seem to drain it as fast as the games. I haven't used it for school yet, but that is the plan. I have used the calander planner, I like that it syncs with my s3 mini phone, so when I don't have my tablet I still have my planner.  With multiple schedules to juggle it us great to have. I am sure that I have just started to tap into everything this tablet can do. Iplan to plsymore with the note taking feature w hile I am on my winter break, so I will be ready in the spring.  I have already recommended this tablet to family and friends.", "Title": "Love this tablet!", "Date": "December 27, 2013"}, {"Author": "Nita", "ReviewID": "R22D6LNE6LNR7T", "Overall": "5.0", "Content": "Love It! Clear Design and awesome reception of data. Thanks! Samsung! I recommend it to everyone Buy one! You will love it too.", "Title": "Samsung Galaxy Note 8.0 Tablet", "Date": "December 27, 2013"}, {"Author": "Michael Glass", "ReviewID": "R1KFO3BY9QWL49", "Overall": "2.0", "Content": "First let me start by saying that the tablet seems to be pretty great. My only gripes so far are to do with the battery life (which I can only assume is due to it being refurbished) and that it has crashed a few times already. Otherwise I like the tab and would recommend it... just maybe get it brand new.", "Title": "Probably great if new", "Date": "January 3, 2014"}, {"Author": "Craig S.", "ReviewID": "R3DWO9IQT2QYJF", "Overall": "5.0", "Content": "Love my SGN8!  Great size, lightweight, and a beautiful screen!  Wish it had a flash, but I knew it didn't when I purchased, so all-in-all, I'm thrilled!  Battery life could be better - I recommend powering down when not in use.", "Title": "Great tablet, great price", "Date": "June 5, 2014"}, {"Author": "Gypsy Horse Gal \"MustangGal\"", "ReviewID": "R1IX2UDH31G41X", "Overall": "5.0", "Content": "Fast performance with a gorgeous interface. Super sensitive screen which makes using the stylus amazing! Crystal clear and super smooth. About to invest in a case to protect this epic creation. Samsung you've done good on this one.", "Title": "A Gorgeous Device", "Date": "May 8, 2014"}, {"Author": "Shannon Burkett", "ReviewID": "R2228BVVUYGDDJ", "Overall": "5.0", "Content": "Still  learning all the options but I am very impressed so far and I love the ability to write notes.", "Title": "I have an iPad but this is just perfect for me and I can carry it with me in my handbag.", "Date": "April 25, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00CXO9O9E", "Features": null, "ImgURL": null, "Name": null}}