{"Reviews": [{"Author": "cc", "ReviewID": "RLY5IBB5O6TP6", "Overall": "3.0", "Content": "Tablet is very responsive. Cameras didnt work correctly had upside down issue. contacted seller and said it was a system error. Would off loved to be able to replace so i can have a totally fuctioning tablet and would of rated 5 stars and good buy but i wasnt able to. They did help me thou and refunded me part of the total cost. Tablet came with all cables and they sent an extra gift in there which i was happy about. Packing was really good. Apps work well and tablet itself is really good maybe i got that one in 100  with a defect meaning the cameras. They both work but have a mirror upside down issue as said. Quality of cameras is same as other andrpid tablets so i wasnt really looking forward to using them. Arived before est time. Very fast as a matter of fact. Seller was helpfull and answerd my concern really quick. Seems like other people got working cameras so i would recommend.", "Title": "would do", "Date": "May 16, 2013"}, {"Author": "K", "ReviewID": "RKR6RSREDC3B0", "Overall": "5.0", "Content": "I give it a five star because of the quality of the tablet. It  was purchased as a gift, but I checked everything out on it so far so good....The tablet is very responsive . The bonus keyboard works  well. The size is just right , dual cameras lets you take videos which is a big plus. the resolution is clear, The tablet does expand to 32GB, I'm very happy with the tablet and looking to get one for myself. This is a quality tablet and what makes this excellent is the seller Goldengulf.. I have nothing but pros for and no cons, and to boot the price is great.. After A liitle more use I will update this review. Well my daughter bend my charger and I contacted Mr.Li about purchasing another one, and he sent out another one without question. This is and awesome company that backs their products. I was told not to charge via usb as that would hurt the tablet. the tablet is going strong... The family loves it the wi-fi is strong. The playback is good . Your not paying  for an I-pad but you get the same functionality for a third of the price. I only down is the battery life but it is exactly as the product stated so i can't complain.....", "Title": "Very nice tablet", "Date": "May 10, 2013"}, {"Author": "Jack R. Cook \"Kartographer\"", "ReviewID": "RLPBWFXKTOHBU", "Overall": "5.0", "Content": "Very good picture. Easy to use and to figure out and that's a good thing, because the manual that comes with it is in the smallest print I've ever encountered for a owners manual. Between the size of the print and the lightness of it, it's pretty much impossible to read with out a magnifying glass.I got a decent router from 'Wally World' to replace the piece of 'shitako' that I brought from Amazon. With the router up I was able to get this unit on line quickly and it preformed well. The upload time I thought was good, but I am sure not fast enough for gamers, but for what my wife needs it for surfing the gossip sites on the net, listening to music and such its just fine.This unit is exactly what you are paying for a working basic entry level tablet with a 9\" screen. If that's what you want why spend 2 or 3 times as much, just to get something fancy that you won't use half of?For young kids and seniors I say this is the unit you want.", "Title": "Great Product at a great price!", "Date": "June 7, 2013"}, {"Author": "Josue", "ReviewID": "R3CP81WGJO69DT", "Overall": "5.0", "Content": "So far it's been working smoothly, I'm happy with it and I would recommend it, I received it way before the date expected.This product is awesome and that is why I bought TWO of them, one for my daughter and after seeing its performance I decided to buy one for myself. My daughter accidentally dropped it and broke the outside screen, she was sobbing so I asked the manufacturer if I could buy one from him because for me it is worthy, and I'm a computer geek, so I know what I'm talking about. His response was immediate and so kind. Both the product and the service and help are a top quality. I highly recommend any of you, trying to find a real bargain not to skip this one. You will not regret it!!!And I'm honest and true to this review.Thanks for the opportunity to be fair and give this product and its manufacturer the credit they deserve.Josue Iaheta", "Title": "Great Tablet!!", "Date": "May 30, 2013"}, {"Author": "Leo Koach", "ReviewID": "R3OTVLCDWXEEWT", "Overall": "5.0", "Content": "I just got my tablet pc, which was delivered very fast... and played with it for a while. This is my 5th tablet pc, all Androids, and response of this one is very nice. Quick image and website load. I am a photographer, I am more interested in colors, and unfortunately colors are not as vivid as I wanted to be, but for this price, I got what I paid for. Even this tablet pc has the worse color on the monitor, I still give 5 stars! I know most of them much better than what I received, I probably got a defected one, which is not bothering me at all :) Other things, such as G sensor, processing time are very very good. Did not come loaded with apps, I wasn't expecting to. I started to download the things I want. I prefer to receive my tablet pretty much blank to be able to customize it without start deleting stuff.Charges very quick. I haven't used enough to know how fast it drains the battery, more than one hour is enough for what I need from this machine.Overall, if you are not thinking to run your office from a tablet pc and don't care about the screen resolution... I say go for it. Very inexpensive, I might even order one more for a backup ;)Forgot to mention, it has two cameras, one on the front and one on the back... which I was waiting to get a tablet with front camera with low low price! so, here it is :)", "Title": "Great tablet pc for the price and some more", "Date": "July 10, 2013"}, {"Author": "Drennen Blocker", "ReviewID": "R39N6QS7AFN6VA", "Overall": "5.0", "Content": "Just what was hunting for. Anyone could use one get it that has knowledge of them. Good memory and good speed.", "Title": "Great Tablet", "Date": "July 3, 2013"}, {"Author": "Kaye", "ReviewID": "R12PRJS4YY16B3", "Overall": "5.0", "Content": "I am very please with this company goldengulf, after much research I found this Android 4.0 Tablet PC to be a very good deal for the price, not only did the seller send me a free keyboard, they emailed me to let me know the status of my purchase, and was very nice about sending everything I requested for this item.This Android 4.0 Tablet has everything I need to accomplish the things I need to do on a day to day basis.Thank you goldengulf for sending me a quality product!", "Title": "Great Company!", "Date": "April 29, 2013"}, {"Author": "Someone54", "ReviewID": "RKKK0PW6ZCYUG", "Overall": "5.0", "Content": "I really like this Google Android. I think the touch screen capabilities are terrific as gives the tablet a sleek feeling. Not to mention the camera is terrific. You can get some pretty good shot with it. For a tablet like this, you will need a memory card like the New 32gb Micro Sd Card Sdhc Tf Flash Memory Card 32gb Class 10, New! Usa! to get the best out of the tablet. If you are looking for a good tablet, then I recommend getting this one. It is one of Google's best", "Title": "One of Google's Best", "Date": "June 9, 2013"}, {"Author": "Daniel E.", "ReviewID": "RE2EMMB0T660L", "Overall": "3.0", "Content": "Service was great, shipped fine w no damage or problems.  But if you are looking for good reaction times and fast responce for a tablet than this isn't for you.  The product works fine,  but you get what you pay for on this one. Great for a young kid, or basic use.", "Title": "Good service,  Ok product", "Date": "July 17, 2013"}, {"Author": "lanae.es", "ReviewID": "R3G1X40T03OM01", "Overall": "4.0", "Content": "alright so first of all it came in the mail waaaay earlier then expected. thank you. second it works just not as awesomely as i expected but it was only 85 bucks... its just a little glitchy and some games dont work properly. and when browsing the internet i have to keep clicking over and over again... i give it 4 stars because it arrived early and because of the nice card from the owner that came in the box.", "Title": "its okay", "Date": "May 25, 2013"}, {"Author": "Jacob", "ReviewID": "R4BY1WD6FD0YV", "Overall": "5.0", "Content": "wounderful service from goldengulf, i will continue to but more stuff from this seller two thumbs up i had one small issue with the tablet but they helped me out right away i am very pleased you wont regret buying from GOLDENGULF make sure you are buying from them and not from other seller as goldengulf", "Title": "goldengulf has a wounderful service!", "Date": "August 13, 2013"}, {"Author": "Victor Rodriguez", "ReviewID": "R2DGV5CFQEYP7Y", "Overall": "3.0", "Content": "This is a basic tablet. It works fine, but has some more or lesses.The good: Touchscreen is highly responsive. It plays multimedia files, games and everything else at average standard speed and quality. It handles documents as expected with downloaded apps. The design is nice and have enough features, input and output ports.The bad: Number one is battery life, which is too short. Brand new with normal use and fully charged, it went off after 38 minutes. Second, wireless signal is low even if I sit close to the router, making it hard to get connected sometimes. Third is the camera, which takes very poor quality videos and pictures.For intensive work I expected at least a more durable battery supply and better wifi performance.", "Title": "Basic tablet", "Date": "August 9, 2013"}, {"Author": "Billy Falcon", "ReviewID": "RPCBCEWVF4NSW", "Overall": "1.0", "Content": "Its slow and it seem like its already starting to malfunction and I havent even had this product a month it has no storage ,l mlght as well use my laptop, half of time, no more than that, I'm unable to get online", "Title": "why i dislike this product", "Date": "July 17, 2013"}, {"Author": "splicer1", "ReviewID": "R1AEX9RMUXDEQ0", "Overall": "4.0", "Content": "This tablet works great. I have had a couple of cheap tablets in the past and returned them because the touch screens were unresponsive. This one works great. So far it has run everything I have put on it including Netflix, games, and a remote desktop app. It does not have the resolution of higher priced tablets but for piddling around it is fine.", "Title": "Good product.", "Date": "July 16, 2013"}, {"Author": "Precious R.", "ReviewID": "R2KFQJI4DZUUCT", "Overall": "5.0", "Content": "I really love this tablet..it works well...Very good for the price..If you're looking for anything simple, this tablet is recommended", "Title": "Good for the price", "Date": "July 8, 2013"}, {"Author": "issachar5", "ReviewID": "RSL8D8QMEX1O4", "Overall": "5.0", "Content": "I am sure they shot the writer of the little \"booklet\" that came with it (Chinese-English users maual); it was less than useless.  The product, however, fulfilled all expectations.  Still learning, by trial and error, how it operates, but it's pretty good.  A great bargain.", "Title": "Good product", "Date": "July 4, 2013"}, {"Author": "elie42000 \"Jo\"", "ReviewID": "R3Q3MZFOHCBLOO", "Overall": "5.0", "Content": "This was a gift for my granddaughter and she just loves it. So far so good. It came about two weeks before it was scheduled to be here. I wouldn't be afraid to buy from this dealer again. Very satisfied.", "Title": "Good purchase.", "Date": "July 2, 2013"}, {"Author": "FUJI LOYALIST", "ReviewID": "R394XXMSXCDDXU", "Overall": "5.0", "Content": "Very easy to navigate and make it work with my personal PC. The size is perfect and doesn't weight much. The seller even included a hand written note in the box! (Who does that now a days?). I am certain to have lots of fun with this!", "Title": "Great Litte Gadget For The Money!", "Date": "July 1, 2013"}, {"Author": "PAT JONES", "ReviewID": "R35FV40R0KORB5", "Overall": "5.0", "Content": "I got the tablet for my grandson mainly to play games on, for the price it's awesome for that. He absolutely loves it.", "Title": "AWESOME", "Date": "June 18, 2013"}, {"Author": "donna jackson", "ReviewID": "R3SP9RTGL94BKG", "Overall": "5.0", "Content": "The tablet is wonderful and the seller was fantastic to work with.  I would definitely purchase from them again. The quality is great and it delivered on every option stated i would purchase more for gifts", "Title": "Excellent tablet", "Date": "June 15, 2013"}, {"Author": "makeuplover76", "ReviewID": "R2UYDP91MKSHRX", "Overall": "5.0", "Content": "i read some of the reviews and was skeptical, but its been just fine!!! I think these are PERFECT for kids, rather than buying a handheld game system that requires you to buy expensive cartridges.  You can get a slew of games and educational games for FREE on the play store. Well worth the money!", "Title": "ITS BEEN GREAT!", "Date": "November 26, 2013"}, {"Author": "Arielle", "ReviewID": "R1F7SBYEQIM9NO", "Overall": "2.0", "Content": "Slow slow slow. Anytime I tried to run anything it crashed, and I don't really play many games. Also the screen is extremely grainy and doesn't really look good at all. Took forever to even get to me, and I should have returned it when I had the chance (if I was even able to) Giant waste of money.", "Title": "Keep looking...", "Date": "November 22, 2013"}, {"Author": "NancyN", "ReviewID": "R46KIQ2ON4VZ", "Overall": "5.0", "Content": "I received this tablet well before the due date. It was very easy to set up. I didn't have any problems at all.  I really like this tablet.", "Title": "Goldengulf tablet", "Date": "October 29, 2013"}, {"Author": "stonecold", "ReviewID": "R2DCOCQ180THGE", "Overall": "5.0", "Content": "I am happy with the functions on this device. The touch screen is responsive and this android system seems to have no problems playing all the different type media out there.", "Title": "Very Good", "Date": "October 17, 2013"}, {"Author": "backtoschool", "ReviewID": "R3HWAGAIM0SQ8N", "Overall": "5.0", "Content": "This is the second on I bought in the past few months. It works well and meets my expectations I am impressed with this tablet.", "Title": "This is a easy to work tablet.", "Date": "October 16, 2013"}, {"Author": "RUDAYNA", "ReviewID": "R2NB7EMBX2ENUJ", "Overall": "3.0", "Content": "Received damaged tablet after I paid over $30 for fast shipping. I was disappointed but the seller did replace it. I had to pay for shipping to return the damaged one and the replacement took forever to arrive. The tablet is decent for my 10 year old. It is made out of cheap plastic but for her it will do.", "Title": "Acceptable for a 10 year old.", "Date": "October 11, 2013"}, {"Author": "Teresa Veara", "ReviewID": "RS0ROD79HZCPA", "Overall": "4.0", "Content": "I had this tablet for a couple months and it worked great. I was able to let my 9year old use it sometimes to play games.  I did have a problem with it but the customer service at Goldengulf was excellent and solved my problem quickly and efficiently.  Great customer service!  Very quick response.", "Title": "Great tablet for price.", "Date": "August 30, 2013"}, {"Author": "danielle epps", "ReviewID": "R7N9JJDLP87LW", "Overall": "3.0", "Content": "The screen freezes and moves slow not sure if this the tablet that I ordered.other than that it is okay", "Title": "dont know if this is a Goldengulf the box just said tablet pc. its ok sometime when you are trying to slide upand down it gets s", "Date": "August 27, 2013"}, {"Author": "logic is power", "ReviewID": "R3AMR5U0W4U4S4", "Overall": "3.0", "Content": "I will recommend this tablet for a beginner. All applications work but somewhat sluggish (especially with virtual keyboard input) and poor camera quality. Do not expect great experience with this tablet but it will do the job. All hook-up ports are quite tight. I even was unsure if micro USB was hooked up all the way but it works. Only one of two good quality headphones I plugged in into it produced adequate sound quality. If you want better or even excellent experience and feel with a tablet, expect to spend at least twice more for same screen size. OK overall though.", "Title": "THIS TABLET WORKS AS INTENDED", "Date": "August 23, 2013"}, {"Author": "happy with it", "ReviewID": "RLDSS6T5JTRWE", "Overall": "4.0", "Content": "Just what I expected. Very accurate description. No bad surprises. Nicely packed and it came with the adaptors needed for pluging a keyboard, mouse or speaker.", "Title": "nice tablet", "Date": "August 21, 2013"}, {"Author": "shirley b.", "ReviewID": "R3KUU5OMW8YDN8", "Overall": "3.0", "Content": "First unit sent to me was defective the seller was great and either sent another one or fixed it. They were really great about it.  The second unit after a week and a half the touch screen quit the are dealing with itnow either another type tablet . Refund. I would buy from them because of excellent service", "Title": "had some problems", "Date": "July 6, 2013"}, {"Author": "Lauren", "ReviewID": "R1BF6LYK4TIJ49", "Overall": "3.0", "Content": "Bought this for my dad, the only thing is that the internet is VERY slow no matter where you are (wifi or otherwise)", "Title": "Slow", "Date": "July 5, 2013"}, {"Author": "BMB", "ReviewID": "R8ELN1ISQM2LW", "Overall": "3.0", "Content": "Tablet hangs easilyCan only perform one task at a timeGraphics are poorAverage android featuresMaking it easy to use for beginnersNot durable, so I would not recommend for small children or \"less than careful handlers\" at the very leastBattery drains fast, only lasts about an hourSkype downloads from Google Playstore but does not work on tablet, person receives the call but can not hear anything from caller,(no sound), not sure if microphone is malfunctioning or if tablet is not Skype friendly*****Seller, 'goldengulf', is awesome! I love the seller Mr. Li**********Seller gets five star rating *****Hope seller starts selling the goopad mini I will definitely remain loyal to this seller if goopad mini joins items for sale in 'goldengulf's online storefrontI will definitely buy from this seller again.", "Title": "Good starter for kids", "Date": "July 4, 2013"}, {"Author": "Brunhilde", "ReviewID": "R3CLN7QQDRB59", "Overall": "2.0", "Content": "It was working,then 4 days later......it slows down,pic. goes out while you on it, for no reason pic. black and white and stayes that way, wish I never bought it...", "Title": "Not Happy at all", "Date": "July 3, 2013"}, {"Author": "ezequiel chavez", "ReviewID": "R3K4X39GFXSQEG", "Overall": "2.0", "Content": "im like right next to my router and it shows 0 bars for wifi it sucks i wish i could get my money backand the screen sucks", "Title": "wifi connection sucks", "Date": "July 2, 2013"}, {"Author": "huskrzlady", "ReviewID": "R2JZOUAGV7IFQB", "Overall": "3.0", "Content": "I like the size of the tablet but seems to freeze up alot more than the smaller one that I have does. Pictures are nice Like the dual camera.", "Title": "I seem to freeze up alot", "Date": "July 1, 2013"}, {"Author": "robert harvey", "ReviewID": "RZDAUAM751YMQ", "Overall": "4.0", "Content": "works well, a little slow but for $80.00 it's ok.  have used it now for about three hours and is still working good it plays the games we want and get's on the internet and that is what we bought it for.  If I wanted a faster and more up to date table I would have bought a more expensive one. The sell is top notch, I would buy from him again. He gives you a means to track the purchase and he shipped the next day after the order was placed. It arrived at the house in 14 days and coming all the way from China that's amazing, I think.  I have had order from only 2000 miles away take that long.  So i give the seller five stars and the product 4.  Thanks.", "Title": "produce and seller review", "Date": "June 15, 2013"}, {"Author": "K. Carlson \"\"where am I\"\"", "ReviewID": "R208BDDAQ5MD71", "Overall": "4.0", "Content": "I really really like this tablet.  We bought 2 Double power brand last year that tend to lag a bit either due to touch screen responsiveness or having to many apps.  The double power came preloaded with many apps hogging the memory which we could do without.  The Goldengulf did not which is part of why we love it.  Very touchscreen responsive.  I would have given a 5 however the hard case of the unit is off a 1/2 millimeter maybe less...from the input holes for the mini usb, the headphone jack and charger slot.  They work it just took a little extra force the first couple of times using it.  This at first would have affected my decission of wether I'd purchase another one but now, I'm so happy with the tablet that I don't give it a second thought.Part of why we purchased this tablet above others was due to the positive reviews and the experience with customer service.  They were extremely impressuve and in the world of tech, its unheard of these days.The units do come from China which I was unaware of until I got them, but they still came pretty fast and once I got it my worries diminished.  Price has gone up on the units since I ourchased and I really feel that its due to them carving a very positive space in the market and positioning themselves as a reputable company that stands by their products.", "Title": "Definitely would purchase again.", "Date": "December 30, 2013"}, {"Author": "bonnie schreier \"bonnie560\"", "ReviewID": "R1546F7SKXMV3M", "Overall": "5.0", "Content": "I received the product on time,I did have some problems with it when it arrived,but the customer service was excellent ,they sent me a card in the mail that fixed the problem,the tablet for the money is great I love it,I use it everyday ,for an android tablet this is the best one I have received,very easy to use and its not real fast but its not slow either,I have had about 3 android tablets and this is the best one yet,anyone thats looking for a tablet and doesnt want to spend a lot of money this tablet is great so many apps you can download,so even with the minor problem I had I would still give it 5 stars!!!! bonnie560", "Title": "Goldengulf 9inch Dual Camera Latest Mid Google Android 4.0 Tablet PC", "Date": "August 1, 2013"}, {"Author": "enm", "ReviewID": "RY2RHBJVX3NYS", "Overall": "4.0", "Content": "This company goldengulf is amazing as far as customer service. The tablet is nice. I havent experinced any of the freezing or power shut down problems that alot of ppl review about. I will say it runs slightly slow to start but picks up after its been on a few mins. For the money this tablet is a steal. For sure worth it and glad i got it.", "Title": "good but...", "Date": "July 10, 2013"}, {"Author": "Alejandra Verdugo", "ReviewID": "R2PP8AOMEN5LVB", "Overall": "5.0", "Content": "This tablet was a present for my hubby. The first one, arrived with some damaged, I contacted the seller and he immediately changed it. The new one arrived yesterday, I checked it thoroughly, and everything works perfect. Both cameras work just fine, and it has a lot of apps and it included a charger and an USB.The main purpose of this tablet is to travel with it, instead of a laptop, so we are very pleased. I highly recommend this product and the seller.", "Title": "Excellent tablet!", "Date": "June 15, 2013"}, {"Author": "Joliebebe", "ReviewID": "R2FQ2HZQJXXMPR", "Overall": "3.0", "Content": "Item arrived as described, but i'm not happy with it...It doesn't work well. I'm not really happy with it...It's really slow.", "Title": "Ok", "Date": "June 5, 2013"}, {"Author": "debbie", "ReviewID": "R20O61P0RKWNX9", "Overall": "5.0", "Content": "Wow! Thank mr li you really was true to your word!!I receive it in 7days as you said.and that was yesterday!! So today I have been  playing around  with it to see how it works and I must say I am getting t.he hang of it I would encourage any and everyone who is looking. For a nice dual camera tablet  this is the one!!!!!!!!!  And at  a great great price.", "Title": "9\"dual camera android 4.0 tablet", "Date": "May 21, 2013"}, {"Author": "Latoya Clark", "ReviewID": "R2IHBMMJSRE5E5", "Overall": "2.0", "Content": "I haven't had the best of luck, I wish I had listened to the review. My tablet died on me after a year and it was slow to begin with so I would say for a kid it's fine for just games. For surfing the net and adding app like a normal tablet it not the one get a name brand but I got what I paid for. Thanks", "Title": "My Review", "Date": "June 6, 2014"}, {"Author": "Old Soldier", "ReviewID": "ROEBLEL0EKDH8", "Overall": "1.0", "Content": "1st one froze and had to return; took some time receive new one and it didnt work at all. I did not return the 2nd one yet it costs me 2 shipping fees so far.  Any other electronic i will go to store.", "Title": "Junk", "Date": "August 28, 2013"}, {"Author": "Ed", "ReviewID": "R1OFXN9Y2AGQYJ", "Overall": "3.0", "Content": "The instruction manual is Liliputian.  Get a magnifying glass.  If you have experirence with Android you should have no real issues operating.Screen is smaller than I like but that's my fault.Biggest disappointment is the battery life.  No more than 2 hours before charging.As I rated -  okay.", "Title": "you get what you pay for...", "Date": "July 19, 2013"}, {"Author": "Don Beggs", "ReviewID": "R4SFKKRUKXBAC", "Overall": "3.0", "Content": "Screen quality is fuzzy compared to iPad. Printed instructions are useless. Battery life is okay, not great. And I can't see how to connect to our Wifi at home, although we can connect to any unlocked \"public\" Wifi fine. For the price, it's about what I expected.", "Title": "it's okay", "Date": "July 18, 2013"}, {"Author": "janetj", "ReviewID": "R1ZU64OSCNP8X8", "Overall": "1.0", "Content": "First of all I paid $14.00 for expedited shipping to make sure my granddaughter received it in plenty of time for her birthday..oops..after two weeks it finally arrived..only two weeks late!!!!! Even worst..the exterior and interior packaging was mutilated!!!!!  I assume it was because it was crammed inside my mail box, but whatever the reason it is not excusable!!!! There was not bubble wrap or any packing to prevent any damage, scratches, etc. Additionally, beyond the scratches and cosmetic issues of this product it did not come with any  useful paperwork that gave any information of the product..I am so incredibly disappointed I cannot even begin to express it!!!!! While my granddaughter did not say so I can see her disappointment in her birthday present..shameful that Amazon would carry this product and the seller!!!!(tm)", "Title": "How many problems can there be with shipping?!?!", "Date": "July 14, 2013"}, {"Author": "Lynnette Y. Coleman-Martin", "ReviewID": "R1A6JS27HJEMOG", "Overall": "1.0", "Content": "Horrible color.  Not easy to see or read.  Really dark and not easy to move things around.  Graphics suck!  My dad who is handicapped could not manipulate at all.", "Title": "Not what it is advertised as", "Date": "July 12, 2013"}, {"Author": "Gerald Hemenway", "ReviewID": "R329040F56XSSP", "Overall": "1.0", "Content": "Each time I tried to open a program on the device it froze and failed to load.The device was by far the poorest quality product I have recently bought.", "Title": "Unable to get it to function at all", "Date": "July 11, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00CC8OZ8Q", "Features": null, "ImgURL": null, "Name": null}}