{"Reviews": [{"Author": "jose garcia", "ReviewID": "R1F1272CVV4P9N", "Overall": "1.0", "Content": "I purchased this item from McBub for $229 and I thought I'd made a great buy. The display is great and at first it worked great. I got an Antutu score of 10610 and I was really enjoying getting familiar with it then on the same day it started stopping and it would give me a message and when the message went away it would resume working but it started getting slower so to verify that I checked the Antutu again and it was down to about6600. On top of that I got no help from McBub customer service so I will never again buy a product with an unfamiliar name such as Chuwi. There were many other problems but I don't even want to think about it, I just want to forget I ever heard of Chuwi.", "Title": "I don't think you'll be happy with this tablet.", "Date": "August 26, 2013"}, {"Author": "David Diamond", "ReviewID": "R3HYWN1D9H4GCY", "Overall": "4.0", "Content": "Based on the specs, and on other customer reviews elsewhere on the web, considering the price, this looks like a real iPad competitor, with Retina display, quad-core processor, Wireless b/g/n, and plenty of resources and features.It does have some limitations, which might be show-stoppers for some people:- No GPS- No Bluetooth- Only a single USB port (to be shared with keyboard case if you want one, 3G external modem if you want one, and any other USB use)- Very heavy. If you use it as an e-reader or as an artist's easel, your arms and hands may get tired.I am considering purchasing one, but I am on the fence regarding the above limitations.UPDATE: I have decided that this tablet it too heavy and bulky to meet my needs.  Instead, I plan to wait for the new Google Nexus 7 HD with 1920 x 1200 screen resolution, which is rumoured to be released in July 2013. Supposedly, the new tablet will have Jelly Bean (Android 4.3) and will cost $199.  Even if I decide to not spend that much money, the price of the old Nexus 7 will likely plummet with the release of the new one.", "Title": "Real iPad competitor, but with some limitations", "Date": "May 20, 2013"}], "ProductInfo": {"Price": "$306.70", "ProductID": "B00CPL8KI6", "Features": "9.7inch IPS Retina Capacitive Screen\nAllwinner A31 Quad Core CPU\n2GB DDR3 RAM 16GB ROM PowerVR SGX544 MP\nDual Camera Front 2.0+Back 5.0 Mega pixels\nResolution 2048x1536 pixels", "ImgURL": "http://ecx.images-amazon.com/images/I/41iRbO0CpAL._SX300_.jpg", "Name": "IPS Retina 2048x1536 Screen Chuwi V99 Quad Core Ratina Screen Android 4.1 Tablet Pc 9.7\" Allwinner A31 2gb RAM 5.0mp Camera"}}