{"Reviews": [{"Title": "very good tablet for the price", "Author": "charles hickle", "ReviewID": "R25DBOW4DPWGNT", "Overall": "5.0", "Content": "very happy with my tablet. no downside so far. it did advertise Bluetooth but something was lost in translation. requires dongle.", "Date": "September 27, 2013"}, {"Title": "very good value", "Author": "Rave \"Lena\"", "ReviewID": "R1M8KPEP4T5XLC", "Overall": "5.0", "Content": "This is a nice thin design for a tablet.I It is a pleasure to use. The HDMI output is a very nice feature. The SD card slot and extra port makes it's expandability attractive .", "Date": "April 4, 2014"}, {"Title": "FastTouch 10' Tablet", "Author": "Tina Marshall", "ReviewID": "R1I4HU16X6OGO2", "Overall": "5.0", "Content": "Great tablet for the price! Have had to deal with customer service, and they have been fast, efficient, and friendly!! They always got right back to me and always willing to help! Tina M.", "Date": "April 2, 2014"}, {"Title": "Excellent tablet", "Author": "Brad B.", "ReviewID": "R3AMQNY0X74LDX", "Overall": "5.0", "Content": "It has qualities that other don't like the ability to take pictures of the screen, 2 micro usbs nice, mini hdmi, and a separate charging port , so you  don't have to use one of your usbs when your battery gets low very niece.  I love it. Great support and shipping from DIRECT ONLINE SALES.  THANK YOU", "Date": "March 15, 2014"}, {"Title": "Great buy", "Author": "jazz", "ReviewID": "R1U01PZ9ZVJ5B", "Overall": "5.0", "Content": "This tablet is amazing. I use it for school and for fun. It works great and for the price it was totally work it. I recommend it to anyone that is looking for a good tablet", "Date": "January 22, 2014"}, {"Title": "Too touchie!!!!", "Author": "it's me", "ReviewID": "R12CNML7BW31CV", "Overall": "1.0", "Content": "Purchased due to the great reviews from amazon.  Very disappointed!  It is WAY TOO EASY to accidently turn the tablet off due to where they placed the button.  When you touch the screen, many times you have to keep touching the words before it will accept your selection.  Also, the instruction manual is worthless.  It does not tell you how to use tablet, and when setting time, most places offered to choose are not in this country!!!!  I would not recommend this tablet to anyone.  Am sending it back!!!!", "Date": "December 17, 2013"}, {"Title": "Unit works well but not Bluetooth compatable out of the box", "Author": "Trace E Griglione", "ReviewID": "R2CXHWHGFZU8JB", "Overall": "3.0", "Content": "Other review notes a dongle needed.  You should not have to buy add-ons if it is advertised as \"Bluetooth\" ready/compatible..", "Date": "December 14, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CPD2JE0"}}