{"Reviews": [{"Title": "What a huge disappointment!", "Author": "Gage", "ReviewID": "R14Q8PK3SETJPC", "Overall": "1.0", "Content": "I really wanted to believe in Samsung. They've done a great job with TV's but I think that's where it ends. I bought one of these (not from Amazon, sorry) because all of the good reviews. It was trouble from the word go. The first the machine did was prompt me to accept the \"SW updates\", which it does regularly. Unfortunately the update rendered the machine useless. Similarly, it was also a Samsung update that screwed up my Galaxy smart phone. Anyway, I spent countless hours right from the start trying to right the damage done by the update. Soooo frustrating that at one point I just wanted to throw it against the wall. I finally got it working with no help from Samsung. After about four months of very light usage, maybe a few hours a week, and avoiding the updates, It just stopped working. Wouldn't even power up anymore. Do yourself a favor and buy something else. You'll save yourself a great deal of aggravation.", "Date": "May 23, 2014"}, {"Title": "Awsome Tablet", "Author": "R. Spella \"Bob\"", "ReviewID": "R2FX4ZEOG13AIP", "Overall": "5.0", "Content": "Have been using Samsung Computers for years.This is a top of the line Tablet.Best portable Tablet that I have found.", "Date": "April 2, 2014"}, {"Title": "love it", "Author": "April Mayer", "ReviewID": "R3HYJDGWL8B2HI", "Overall": "5.0", "Content": "This computer does it all for me. Not only can I use the keyboard for whatever I need, but the being able to use the s-pen to hand write notes in either One Note or S-note is completely awesome. The on screen keyboard is easy to use and access, and is great for when I don't want the extra weight of the detachable keyboard. It took me awhile to figure out how to access things since I was not familiar with windows 8. It is probably well worth your time to study the quick start guide that tells you the correct swipes to use to access different things. The hardest one for me to remember is how to go back. The one thing I have not been able to find any documentation on, is how large of a micro sd card it will support. I have installed a 64gb card, and it handles it fine, any one know if it will take a 128gb card?", "Date": "March 15, 2014"}, {"Title": "All GRAPHIC DESIGN artists.  Basically a Cintiq Companion at 25% of price!", "Author": "Matthew Hopkins", "ReviewID": "R6PZQZGF7SUVZ", "Overall": "5.0", "Content": "I used a Wacom Bamboo tablet for the past two years while learning digital design.  I am in school and finally got to the point I could either buy a) A Cintiq Companion that runs Windows 8.1 and Adobe CC (because it runs Windows.) for $1800-2300.  Which is WAAAAAAAAY outta my league, but possible for once.  b) A Cintiq Companion Hybrid for $1300-1700.  Still stupid high.  c) A Cintiq 13HD screen.  This is just a screen for a desktop to draw on.  Very pristine and top of the line, but $1000.So, my reasoning went that for $1000 for a screen, I might as well put in an extra $300 for the mobility.  BUT, the Hybrid is Android based and only runs a watered down PS. So, for Windows 8 I needed to spend $1800.  I didn't like this either.  I heard tale that Samsung invested into 5% of Wacom for a merger.  So, surely Wacom wouldn't keep their pristine, patented, touch pen technology away from an adopted company would they?  No, they did not and here is why it rocks.  Wacom uses a touch technology that can track incremental sensitivity input; up to 2048.  Crazy high definition right?  Well, at 1024 (still crazy high) the line of Samsung Smart PCs and Tabs all get a built in S-Pen, with guess who's technology?  That's right, Wacom.  So, I bought a Samsung Touch Carbon from Wacom for ($80), more function, finesse, and ergonomics than the built in S-Pen.  This ATIV Tab 5, along with that Carbon pen, and Windows to run Adobe CC just kicks so much butt.  I had to share how I got the functionality of an $1800 piece of gear for $600.  Thank you Samsung.  Wacom, stop overpricing your gear!  I know a real techie could make something better than mine at $600, but I wanted to create instead of study how.", "Date": "February 21, 2014"}, {"Title": "Weak motherboard, terrible after-sale service", "Author": "Sundar", "ReviewID": "R16689GHI7JE2O", "Overall": "2.0", "Content": "I would never again buy a Samsung product, after the following experience:I bought a Samsung Ativ 500 T when I was in the US in February 2013. Within two months, the computer died, and I took it to the Samsung Service Center in Bangalore, India. They said that the mother-board had to be changed. Their service was awful; they never return your calls, they never call back as agreed; one needs to keep running after them a hundred times to get any response.  And they are totally incompetent.They took 6 weeks to change the mother-board (on the excuse that the part had to come from the US to India). Then I found that the Windows 8 Activation Key is not valid (the Service Center did not even mention the issue when they returned the tablet with the new mother-board!). When I took it back to the Service Center, they said that it is because the Serial Number of the machine does not match the new mother-board and that they would fix it.  They tried for one whole month and are still not able to fix it.Overall, I have lost 3 months of my computer use, with no compensation, and no solution in sight.  Samsung's online help was not effective either; the live-chat person too was unable to solve the problem; when I sent email complaint, I was asked to ship the device(at my own expense !!) to the US; this is the most impractical suggestion, which will entail more expense and delays for me.  Why should I spend my money and time for no fault of mine?  Does Samsung not take responsibility for its own products?  And what is the use of having Service Centers around the world, if they can't even sort out such a simple issue?  If Samsung cares about their reputation, they should offer compensation for the loss of use of my computer, and a replacement machine with a legitimate Windows 8 loaded on it.", "Date": "August 5, 2013"}, {"Title": "Business, Not Personal Tablet", "Author": "Clark Johnson", "ReviewID": "R3V4U1YUIUA7OR", "Overall": "4.0", "Content": "I purchased this to have a portable display platform for use at trade shows, and it performed very nicely with PDFs and Excel (after buying Office separately).It was a bit of a learning process to get used to Windows 8.  You can pull up the windows 7 file format to get back to something familiar.This is too big for a personal tablet, for reading, etc.  The screen is great, so it could be good for movies.  But, it does not come with me on vacation, for example.I did insist on a model with USB, and this function is fantastic.Get it as a business expense, and it will be very satisfactory.", "Date": "August 19, 2013"}, {"Title": "COMMON Touchscreen Failure For ALL Samsung ATIV Tablet PC Models (500t and 700t)", "Author": "MrGuy", "ReviewID": "R39AX87JDH2H8L", "Overall": "1.0", "Content": "I bought the 700t from eBAY and it worked fantastically for almost three months until the touchscreen stopped working... s-pen still works, but who cares. (FYI: Samsung DOES NOT honor transferred warranties, so I'm on my own)I was using it for about an hour as a tablet one morning, and when I was finished I put it on the keyboard dock, and put it to sleep. I turned the unit back on about an hour later and the touchscreen did not work; no indication that it was going to fail before-hand, just completely did not work.I have nearly 20 years of technical experience with computers, with certifications, and even I can't resolve this problem, which looking in forums all over the internet, is a VERY common problem for this and ALL Samsung ATIV tablet PC models (500t and 700t).Samsungs ONLY solution is to return and replace.My unit:- All Samsung updates are installed- All Windows updates are installed- Unit has been lovingly handledThings I've done to fix the touchscreen problem:- Wiped drive/factory recovery 3x- Repeatedly uninstalled/reinstalled Wacom and touch drivers (even tried older versions, and some 3rd party)- Windows restore 3x- Spent days looking on forums for answers- Cleared CMOS- Hacked BIOS update program and reflashed BIOS firmware- Disassembled unit, cleaned all cables/connections with isopropyl alcohol, reassembled- Replaced digitizer with exact OEM- Cried inside...Why Samsung???Short of replacing the main HannStar board, I've done everything in my power to fix the number one major feature of a tablet. I didn't give you $1400 for a TOUCHLESS TABLET!!!!It wouldn't be so infuriating if this thing wasn't perfect for me :(That being said... PLEASE save your money and buy a Surface 2.", "Date": "December 6, 2013"}, {"Title": "Truth behind the Tab 5", "Author": "Ray", "ReviewID": "R1W03DKJ6NWWHF", "Overall": "1.0", "Content": "Received the package and was excited about my new laptop. Upon opening, setting up, and playing around on it I came to the resolution that I had just purchased a giant windows phone that only connects to wi-fi. (I know it wasn't supposed to connect to any networks)This convertible tablet runs windows RT; for those who don't know, Windows RT is just the basic Windows which won't let you Install anything except through the windows store, or if DL from the producers website. So those of you who like to hack, tweak, or just plain pirate software: this is your worst friend.Also upon receiving, was under the impression that this was new. Came to find out, about 9 keys on my keyboard didn't work. So was forced to use the touchscreen keyboard.I returned this item and ordered the Samsung Smart PC Pro 700t A04 version (there are 3 versions, A04 runs Windows Pro 64-bit). Exactly what I was looking for. Better everything than the Tab 5 and I can do whatever I want, like a true PC. I recommend opting out of the Tab 5 and get the Smart PC Pro 700t instead!", "Date": "March 2, 2014"}, {"Title": "Speed was my number one issue", "Author": "Jonathon P. Lunardi", "ReviewID": "R2X5HJ5RZDWLGV", "Overall": "2.0", "Content": "I really wanted to like this product.  Everyone has Macs around me and I am a PC guy at heart.  I read great reviews about the tablet and really liked the S pen concept.  Here is what happened.I got the device with keyboard.  The Windows 8 mobile interface is pretty cool and I liked that.  When I plugged in the keyboard and then tried to access it in desktop mode and with Internet Explorer, it was just so damn slow, slow.I check Gmail all the time and it was so slow to access Gmail in any way.  I even downloaded the Gmail desktop app and it was the same thing as a browser really.  There are no good Windows 8 Gmail apps for free or cost.You would think that Google and Microsoft would at least be good enough friends to create a good Gmail app for windows 8.  Come on!  #gmail @google #microsoft @microsoft #comeonI run the Veteran Central Foundation -[...]- we were considering equipping all of our virtual Veterans with this device but now have decided to go with Apple or Dell as our main target manufacturer.I really wanted this product to be great, but it is slow and the S pen is just ok.Boomer Sooner - I represent the #DCSooners and OU Alumni everywhere! #OU #Sooners @OUalumni @sooners", "Date": "July 20, 2013"}, {"Title": "Win 8 is not too much friendly", "Author": "Plinio Luis Ribeiro", "ReviewID": "R1PQ9EG18F6AAT", "Overall": "4.0", "Content": "I'm getting used with Win8. But the hardware seems to be very good. And also expecting for a pt-br keyboard!", "Date": "November 25, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CZ46DUA"}}