{"Reviews": [{"Author": "Computer guy", "ReviewID": "R18UDS69EBR6YL", "Overall": "1.0", "Content": "I bought two of these for my children--11 and 9 years old.  Only one of them still works after a month.  My 9 year old dropped his (in the protective case) and worked for another few hours, then nothing.  It appears to no longer charge, and the warranty is useless.  The one that still works has to be reset to factory about once every two weeks, due to software problems.  I can't afford the iPad, so I was hoping these would be a good alternative, but turned out to be a bad investment.", "Title": "Cheaply made product.", "Date": "June 22, 2013"}, {"Author": "Carrie Davis", "ReviewID": "R3KM6QAT2SV0T5", "Overall": "2.0", "Content": "I was not impressed. I did not like the fact that I had to buy music... I was expecting something that was going to be easy to operate and not be complicated. I thought it over heated to often. I just wish I got my moneys worth and I didn't", "Title": "Returned", "Date": "October 8, 2013"}, {"Author": "Richard Garcia", "ReviewID": "R2MDPEILIAUGUT", "Overall": "2.0", "Content": "After buying this at $160 the next week it went down to $130.  Whummp whummp, I should of waited, better yet I should of googled it (later on this).I asked the seller why the price changed after I bought it and then went back up to the $160 2-3 weeks after it went down to $130, then $140 to $142 and then back up to $160 and if I could get a refund for the difference.  The only option I had was to return it costing me shipping it back and the 15% restocking fee, well there goes those $30.So after all this I googled it and found it $129.99 everyday at walmart and in all the colors not the limited they provide.  Stupid me getting complacent with amazon and not checking google. never again will I not google before placing orders here", "Title": "don't buy here", "Date": "June 19, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00CZ6WACI", "Features": null, "ImgURL": null, "Name": null}}