{"Reviews": [{"Author": "Jennifer Warren", "ReviewID": "R1Y8Z529U7ZOYW", "Overall": "4.0", "Content": "Not having much experience with Tablets I was surprised by the amount of apps and our ability to navigate on this product.  I am seriously thinking about getting one for myself.  I would recommend this product to others.", "Title": "I like this very much.  My 7 year old daughter loves it.", "Date": "January 23, 2013"}, {"Author": "Kakungulu \"Lone Prospector\"", "ReviewID": "R1EZQWPD6S2SWL", "Overall": "3.0", "Content": "Mine is broken already and I didn't get a week to enjoy it.I got it as an extra child-entertainment thing for a flight. I was amazed it supported all the android apps I knew from my phone and performed really well (maybe battery life could be better...). But few days later, while sitting on the plane, I discovered the screen was shattered. If you were spoiled by \"gorilla glass\" to believe tablets are indestructible, this one will remind you that glass can break and scratch. So don't buy it and leave the case and screen protector for later... Personally, I discovered that my Nook tablet version has a free android hack and now I'm back to using it. But I miss the camera and skype...", "Title": "Buy a case with it", "Date": "January 21, 2013"}, {"Author": "Pat", "ReviewID": "R3RCYBSG8UJ6FN", "Overall": "5.0", "Content": "It was a present for a very special person in my life and in her words it is really AWESOME!", "Title": "Zee", "Date": "January 19, 2013"}, {"Author": "JAS1125", "ReviewID": "R1IBJE4HLIQOEE", "Overall": "4.0", "Content": "After some issues with the intial start up, I had to reboot the system twince and since then, no issues so far. I had contacted the vendor Goodios and they were very responsive and even sent a new charger when the provided one proved to be defective. Surprised at how nice the tablet is for the price....no issues with Google Play and YouTube vids work very well.", "Title": "Not a bad tablet!", "Date": "January 18, 2013"}, {"Author": "K.W", "ReviewID": "R3IWWT4GPYCQEC", "Overall": "1.0", "Content": "NO ONE from the company has even made an attempt to contact me, they obviously have poor customer service and SELL USED ITEMS AS \"NEW\".It has been about ANOTHER month and no one has contacted me about a refund! I have sent them one more email but if I do not get word from them by the end of the week. I will have to contact Amazon directly. Its not fair to customers to pay for  a new product and get a used one.Just don't bother buying from these people they aren't honest and its hard to get in contact with them.", "Title": "BEWARE Falsely sold \"New product\" and wont give a refund!", "Date": "January 17, 2013"}, {"Author": "Felicia", "ReviewID": "R1PYDK9U9A1ZF0", "Overall": "1.0", "Content": "I have contacted the seller explaining that the wifi worked for a few weeks then after about 2 weeks it stopped working. I have reset my wifi box at home and the tablet itself, they told me to reset my wifi and the tablet a couple times and ever time I do that it still flips inself back and forth on it's on. I can go into settings and try to turn on wifi knowing I have full service because I can be on my Ipad and try on this and it will not it just flips on and off by itself.  I do not have anything I can do with this because in the process of resetting it it deleted all my Kindle books and games. So it sits in the box> I can not use it that wa 80 dollars thrown away. Just Be Careful", "Title": "Not what it says it is nor what you think.", "Date": "January 17, 2013"}, {"Author": "kriscurly17", "ReviewID": "RGCBPPP7AFPT4", "Overall": "4.0", "Content": "Great for my 13 year old son. Does what he wants for such a better price than some of the other tablets.", "Title": "Great", "Date": "January 17, 2013"}, {"Author": "Paul Backor", "ReviewID": "RJ72J397WCWMQ", "Overall": "4.0", "Content": "Kids love it.  Good starter tablet.  Only problem is it freezes a lot and your have to restart.  But for the money its been a big hit.", "Title": "Pleasant surprise", "Date": "January 16, 2013"}, {"Author": "superjeff", "ReviewID": "R3RJFFW613NKFU", "Overall": "4.0", "Content": "It works pretty well and for what I paid, so I can't complain much.Battery power isn't great.. expect about 45 minutes if watching a movie.  No problems when keeping it plugged in.My only criticism is responsiveness.  Pretty much any icon I click on, I have to wait about 3-5 seconds for response.  Since this was purchased as an extra tablet for my 2 toddlers (who like to fight over the ipad to watch netflix at bed time), I've had a time trying to convince them to be patient and wait more (the iPad is obviously instant).  This, in itself, isn't too terrible.. but if the buttons get pushed too many times while \"waiting\", the unit has to be rebooted to work.  It just gets stuck.That said.. if you're patient, it performs as it should.  Apps take a while to load too... and then respond well.", "Title": "Good Tablet for the Money", "Date": "January 16, 2013"}, {"Author": "Rebecca", "ReviewID": "R3LVNTKQF4NF6W", "Overall": "3.0", "Content": null, "Title": "I had higher expectations.", "Date": "January 16, 2013"}, {"Author": "laurynnsmom", "ReviewID": "R1IGW20PT9NYEJ", "Overall": "1.0", "Content": "Got this for my daughters 5th birthday, the day she got it she dropped it on carpet maybe 2 feet and it literally blew apart into 15 pieces. We very carefully put it all back together and it worked fine, happened again, fixed it, etc. but that didnt even bother us, the main reason we could not live with it was the speed. It took 4 hours to download wheres my water. 4 HOURS!! And it was NOT our wireless's fault. we returned it and got her a nook hd used on ebay with google play on it for the same price.", "Title": "awful", "Date": "April 30, 2014"}, {"Author": "Amazon Customer \"oceandreams123\"", "ReviewID": "R1TRMQG3A3ULHS", "Overall": "1.0", "Content": "This is by far the biggest rip off. I barely used it, and it stopped working, I did everything the way the directions, said.Not only did my Zeepad stop working,my 2 grand children who got them stopped as well they got them for Christmas new, and they stopped working a couple weeks later,The manufacturer should be sued!", "Title": "Zeepad , Bad choice", "Date": "April 26, 2014"}, {"Author": "David Hofland", "ReviewID": "R16GG7ZD07HGN4", "Overall": "2.0", "Content": "Screen was scratched, must have been a refurb rather than new as advertised. Not happy but not worth trouble sending back", "Title": "not as advertised", "Date": "April 26, 2014"}, {"Author": "minimedia bad", "ReviewID": "R3MNN8NGF9OI1L", "Overall": "1.0", "Content": "Breaks easy. Too slow. Charger breaks really easy. I purchased this table for my 6 years old daughter,  but it was frustrating how easy the charger breaks, and everything was too slow. Expend a little bit more and avoid this.", "Title": "not good.", "Date": "March 15, 2014"}, {"Author": "Brett Bybee", "ReviewID": "R30DKN2F4XBH75", "Overall": "1.0", "Content": "This is a terrible, one-time use, disposable piece of garbage.  We knew by the price we were getting a sub standard product, and we were okay with that, but after one week of use, no drops or abuse inflicted, the plastic started to separate at the seam.  We thought maybe we'd simply replace it.  Amazon was splendid and fast to work with on replacing the device, but the new one was defective after just ten days as well.  Do not buy.", "Title": "Garbage", "Date": "February 14, 2014"}, {"Author": "Lee Toland", "ReviewID": "R1ZM5979GD9U6S", "Overall": "2.0", "Content": "This tablet from day one has been painfully slow in the amount of time it takes to do anything: turn on, turn off, slide screens, unlock, loading the apps, games, books, movies or anything else you've put on the device and would like to watch/read/play, downloading items to the device, connecting to wifi, etc, etc, etc. I got this for my four year old as I was tired of filling up my phone with her games so she's happy despite it's slowness but I would never recommend this for anyone but a child and only for children that have a bit of patience.", "Title": "Painfully Slow", "Date": "February 13, 2014"}, {"Author": "NaTasha Johnson", "ReviewID": "R36T9Q7F140X48", "Overall": "1.0", "Content": "If I can give -5 stars I would. This device didn't last a week before having issues. The vendor refused to refund my money and the so called service plan refused to service the device. It is now in the garbage where it belongs. TERRIBLE!!!!!", "Title": "TERRIBLE", "Date": "February 13, 2014"}, {"Author": "lalywright", "ReviewID": "RUAZJHI6FDY9O", "Overall": "2.0", "Content": "Unfortunately, this purchase falls under \"you get what you pay for\".  The item lasted just a few weeks before the power button broke and now the device does not turn on. It was cute while it lasted though.", "Title": "you get what you pay for", "Date": "February 11, 2014"}, {"Author": "INANGELIS GUERRA", "ReviewID": "R32ZCTGGVWEOFQ", "Overall": "2.0", "Content": "The charger broke down, the camera does not have a flash. Work to slow, and its difficult to get it on.", "Title": "The charger broke down, the camera does not have a flash. Work to slow, and its difficult to get it on.", "Date": "February 11, 2014"}, {"Author": "Debbie Y", "ReviewID": "RMLT1B2TXINLP", "Overall": "1.0", "Content": "Did not work right out of the box. Triple checked it was fully charged but would not go past home screen to do anything.  Battery or software issue..", "Title": "Did not work out of the box.", "Date": "February 10, 2014"}, {"Author": "A. Garrett", "ReviewID": "R3IXGJ1V001CVF", "Overall": "1.0", "Content": "This tablet started randomly sensing touches on the screen after a couple of months. Eventually, when I turned it on the unit would start going nuts as if I were pressing all over the touch screen. Getting my refund via Square Trade now. Poor choice on my part and poor quality product. I won't make that mistake again.", "Title": "Quit after 5 Months", "Date": "February 8, 2014"}, {"Author": "C", "ReviewID": "R2TADOWBSS98H0", "Overall": "3.0", "Content": "The charging port is too easily broken, especially if it is to be handled by kids. The buttons could be more sturdy as well. Apart from that it is a great tablet.", "Title": "Hardware needs improving.", "Date": "February 7, 2014"}, {"Author": "LaQueena", "ReviewID": "RTA1SADS6ND82", "Overall": "1.0", "Content": "The zeepad stopped charging. Have had it a little over a month. EXTREMELY POOR PRODUCT. EXTREMELY DISAPPOINTED. Poorly made and very cheap.  I URGE YOU NOT TO BUY ONE!", "Title": "Horrible horrible Product", "Date": "February 6, 2014"}, {"Author": "Maureen Henson", "ReviewID": "R1IWNLJDGGN6RR", "Overall": "1.0", "Content": "Some of the loaded apps don't work, even after uninstall and reinstall.  The battery life is very short.  It hangs up easily during some functions.  Takes forever to boot up.  Spend a little more money and get a better product.", "Title": "Don't waste your money", "Date": "February 6, 2014"}, {"Author": "Derrick L.", "ReviewID": "R6L44D8JPWJUA", "Overall": "5.0", "Content": "We got this for our 6 year old daughter for Xmas. This little tablet is great for kids, She plays with it everyday! I would definitely recommend this to a friend.", "Title": "Awesome!!!", "Date": "February 6, 2014"}, {"Author": "m tate", "ReviewID": "R300V1ANUX09PV", "Overall": "1.0", "Content": "It was ok for a few days but stopped functioning at all. There is absolutely no support for this product, nor any manuals, etc. I absolutely would not recommend it.", "Title": "stopped working", "Date": "January 13, 2014"}, {"Author": "andrea spears", "ReviewID": "R2TCE6QLB1DIW8", "Overall": "4.0", "Content": "Good for the money. great for kids first tablet. not the best but for what u pay can't get any better . def get your money worth ..", "Title": "great for kids first tablet", "Date": "January 13, 2014"}, {"Author": "Amy Williams", "ReviewID": "R2Z2L1E010PYL2", "Overall": "4.0", "Content": "This was a Christmas gift for my 6yr son. He loves it, I am impressed with the Zeepad. It runs very quick doesn't take a long time to load videos or download apps.  The only thing negative would be the screen is hard to see with the way the light glares. My son seems not to have any problem seeing the screen . I love this tablet it is well worth the price..", "Title": "Great buy!!", "Date": "January 12, 2014"}, {"Author": "Gene A. Fisher", "ReviewID": "R3K0CKTUQO5180", "Overall": "3.0", "Content": "Splendid tablet for what it does, e.g. read kindle books.  But there is much that it can not do, e.g. blue tooth, connect to computer.  The battery life is terribly short, 3 hours at best, and you are warned not to charge it over 3 hours.  That is, you can't charge the battery overnight.  Needs a faster processor.  Memory not much, but no problem if you have a hefty SD card.", "Title": "You get what you pay for", "Date": "January 12, 2014"}, {"Author": "Felicia Billie", "ReviewID": "R234JDYGGQRAIF", "Overall": "3.0", "Content": "I ordered this product in blue for my 7 yr old grandson and pink for my 5 yr old granddaughter for Christmas.  After reading the reviews, I thought they were going to be a great buy but much to my surprise, they didn't last.  After receiving them, I opened them to check them out and everything seemed fine except I kept hearing a slight humming sound while they were powered on.  I was immediately concerned, but it was so close to Christmas that I didn't want to risk sending them back for an exchange and end up not receiving them in time for Christmas.  It didn't take long before I realized that I probably should have.They have all of the features that I was expecting, but within the first 4 hours of my granddaughter opening hers, she dropped it one time.  The screen cracked and it completely stopped responding to touch.  I sent it back for an exchange, but was only able to get a refund.  In less than a week, I had to return my grandson's tablet as well.  After the first couple of days, the screen turned all blue and it stayed like that for at least 2 days.  It eventually came back to life, but that only lasted for another day before it was completely gone.  So after less than 7 days, I arranged to send his back for a refund as well.The reasons I gave it a 3 star rating instead of one star has nothing to do with the product itself, although the colors are rather cute.  But it has more to do with the excellent customer service regarding order processing, shipping/delivery, and returns/refunds.  Delivery was very quick and refunds were issued immediately upon Amazon receiving the defective items, which only took a couple of days.", "Title": "Thought It was a great buy", "Date": "January 11, 2014"}, {"Author": "Elaine Jordan \"elaine\"", "ReviewID": "R2QBBVHZIUDH5B", "Overall": "4.0", "Content": "My husband wanted a small tablet for reading library books and kindle books at night.this was perfect.he uses his bigger tablet for everyday,but for travelling,uses this one more and more. I stripped all apps he was not going to use,added sd storage and got a good m edge case. He takes good care of it and it works fine.it is jerky and does have that weird screen if you look at it sideways,you can't see it,like the old tv screens when they first came out.the touchscreen is not very good.....if you buy for a kid, the kid either needs to take care of it and be patient....it is not as responsive as a smartphone,or it will be brokenOne thing,there are two ways to charge it, special provided adapter or micro usb ,which is nice if one way breaksThis one is very nice as it accepts Google play and I assume but have not verified Amazon app store....several cheaper tablets do not", "Title": "Good tablet for the price", "Date": "January 11, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1LJOWMBZD10HG", "Overall": "4.0", "Content": "Bought two for my granddaughters and they love them. Good gifts for Christmas for a 9 & 8 year olds.", "Title": "Christmas gifts", "Date": "January 11, 2014"}, {"Author": "Melissa Rex", "ReviewID": "R33JXL3F5PG85S", "Overall": "4.0", "Content": "I bought this for my 5 year old daughter.  The batteries do not last very long, but she shouldn't be on it for more than the battery lasts anyways.  Not the best screen/clarity, but it works for a 5 year old to play games.", "Title": "My daughter likes it", "Date": "January 8, 2014"}, {"Author": "JEWELLZbennett", "ReviewID": "R2VBZT9GJ1NF0N", "Overall": "5.0", "Content": "LOVE MY TABLET. ITS GREAT OVERALL. GOOD PRICE, GOOD FEATURES. GREAT DEVICE. I ACTUALLY BOUGHT 3 OF THESE BUT ONE IS NOT WORKING . THE SCREEN KEEPS RUNNING, GUESS ITS A MANUFACTURER DEFECT AND WHEN IT START I COULD NOT RETURN IT, ( DON'T THING THEY REPAIR THEM EITHER) BUT THEY ARE GREAT OTHERWISE", "Title": "GREAT DEVICE", "Date": "January 8, 2014"}, {"Author": "emmanuel", "ReviewID": "R3V2YZDCHAEJLE", "Overall": "2.0", "Content": "i manage to use it for a week until the screen went out and i really wanted it for my daughter and now she is without a tablet.", "Title": "Touch Screen Dont Work", "Date": "January 8, 2014"}, {"Author": "Iwona Zrodlo", "ReviewID": "R3RDKJCPTKMGNT", "Overall": "5.0", "Content": "it is a good tablet for biggniners for kids becouse it is easy to operate and my kids like it", "Title": "good", "Date": "December 6, 2013"}, {"Author": "Amy Kim", "ReviewID": "RSK2W1H8JN8XR", "Overall": "3.0", "Content": "When we try to video using skype or oovoo, his camera doesnt work. It works fine when using it for regular pics and videos but when we try to use it for the applications, the applications dont recognize that the device has a camera! We tried every setting and option but for some reason, the camera on the device is unrecognized.Though we can still talk, this is quite annoying since the main reason why I got this for him is to be able to see him...Other than that it works fine. If anyone has any solutions to help with my problem, please help.", "Title": "CAMERA DOESNT WORK WITH APPLICATIONS!!", "Date": "December 3, 2013"}, {"Author": "JERZEE2MATO", "ReviewID": "RLZ1VS5IAU4ZO", "Overall": "5.0", "Content": "Best tablet for a kid for the price......came in less than a week....has everything a better model  tab has...", "Title": "zee tab", "Date": "September 17, 2013"}, {"Author": "Norma Mendivil", "ReviewID": "R36UMHSSYY66FL", "Overall": "1.0", "Content": "It was defected when i got it so i reterned it and got my money back so thats good .", "Title": "it was defected", "Date": "August 31, 2013"}, {"Author": "Barry C. Adams", "ReviewID": "R17Y8LRX4MW2PG", "Overall": "2.0", "Content": "This darn tablet is driving me crazy....The main problem is that it tries to type everything it hears......I mean everything.  Of course it is not typing English.  Best I can figure it is attempting to write Chinese.  You just constantly get a bunch of symbols.  It is impossible to use it much less teach someone how to use it because of that constant interruption from it typing on its own.  My computer tech has it now.........he may be able to get rid of the voice command problem but it is going to cost me........I figured out how to turn it off......but it keeps turning itself back on...........tried putting a piece of tape over the microphone............didn't help.  As far as directions / operating instructions..................horrible.................definitely a poor Chinese translation with conflicting instructions and false info.JUST WANTED THIS FOR MY MOTHER TO PLAY WORDS WITH FRIENDS WITH ME AS HER IPHONE IS TOO TINY FOR HER TO SEE....................THIS WoPad IS ........SoBad...........she can not even use it.............shoulda got her the Kindle HD.  at least Amazon has some support and can help get it running..............but hey, its a pretty pink.........paperweight.", "Title": "Still trying to get it to work", "Date": "August 30, 2013"}, {"Author": "hartbach", "ReviewID": "R2PV3HGM6D63LN", "Overall": "5.0", "Content": "I cannot claim total perfection for this product, but it is perfect for the cost. I have not found the flaws I read about while researching this. It seems well constructed, feels just right in the hands. Granted I have only owned it an hour (o:  If defects show up I will update.Pros:CostSizeEase of useAll attachments fit snugCons:Yes, it is slower than other tablets. Not so bad to make it a no goWill not Flash Play unkess you down load Firefox......that is easy though.", "Title": "Well worth the cost!", "Date": "August 30, 2013"}, {"Author": "Theresa M. Horodowicz", "ReviewID": "RFPKHPAETQ0BP", "Overall": "2.0", "Content": "This product takes forever to load. I know it's not an ipad. I had a Pandigital for about a year and it was faster than this one! It's does have some popular games and Netflix. You can only charge it for an hour, it works for about two hours on the battery and you can not use the adapter to  run it only battery powered.", "Title": "Doesn't work well!", "Date": "August 30, 2013"}, {"Author": "Jennifer Bizzell", "ReviewID": "R1XPQZ276JQW9D", "Overall": "1.0", "Content": "i bought this for my 3 year old. its okay for her but i get frustrated with how slow it moves.", "Title": "its okay considering.", "Date": "August 28, 2013"}, {"Author": "Sandy", "ReviewID": "R19TRM3XJTNDLR", "Overall": "2.0", "Content": "well I have had enough time to say if I like this thing or not.  Not!  only 1 hour of play on full charge.  stalls frequently.  one charger port is broken and now having issues with barrel pport!  so now what?", "Title": "charger ports", "Date": "August 27, 2013"}, {"Author": "Tbaz", "ReviewID": "R2PD8UHND548SB", "Overall": "5.0", "Content": "Works just as good as the higher priced tablets!!  You can download any app from the Play Store and use Skype!", "Title": "Great product - Great price!", "Date": "August 27, 2013"}, {"Author": "Jennifer \"Ramalajen\"", "ReviewID": "RJHE1ATJQIMGU", "Overall": "1.0", "Content": "The tablet does not work. If isn not plugged does not turn on. If is connecting to a PC does not load the menu. They have not been able to repair. I honestly do not recommend it, is the worst product I bought on Amazon", "Title": "It doesn't work", "Date": "August 26, 2013"}, {"Author": "Wanda Kay Hight", "ReviewID": "R1IPVLDJTHI1G4", "Overall": "5.0", "Content": "Came fast and my daughter loves it.  She sat on it and broke it- but it worked great until she did that!  Thank you for a couple of months of great usage.", "Title": "Great", "Date": "August 26, 2013"}, {"Author": "*MsKool*_*2012*", "ReviewID": "R33X0ZVAVXCOYG", "Overall": "4.0", "Content": "Its a great cheap tablet/phone. It operates pretty much like a big cell phone. A little slow but you get what you pay for. Reccomend for a childs 1st tablet!", "Title": "cute and cool", "Date": "August 25, 2013"}, {"Author": "Jollie Williams", "ReviewID": "R3KINMHOXREF87", "Overall": "4.0", "Content": "Great for kids! Would recommend first before spending big dollars on IPad products.Picture quality not the best but loads apps in a snap.", "Title": "Zeepad", "Date": "August 19, 2013"}, {"Author": "Mom", "ReviewID": "R2JAQRIVL9XYKT", "Overall": "1.0", "Content": "Do not buy from \"engine29\". This product had big problems right away which would have been frustrating, but ok if the seller had any concept of customer service. They ignored multiple emails, and when they did email back gave short answers that didn't solve anything. Don't waste your money. Now I'm stuck with a broken Zeepad and a disappointed 5 and 8 year old.", "Title": "Very Disappointed kids at Christmas :(", "Date": "August 19, 2013"}, {"Author": "simona brooks", "ReviewID": "REL1KBZLYZPU8", "Overall": "5.0", "Content": "i have receive tablet and the descripation fits my purchase as i am ready to order more of the same.Enjoying", "Title": "Great deal on purchase", "Date": "August 18, 2013"}, {"Author": "California", "ReviewID": "R3OSQAWA4VL162", "Overall": "2.0", "Content": "Bought this tablet a while ago and its a piece of junk. the processor is too slow to run games and freezes constantly. both cameras are suckish and the plastic housing feels like they bought the material at dollar tree. so buyers beware, if u want a better faster device, save up money for an ipad mini or nexus 7", "Title": "SAVE YOUR MONEY DONT BUY", "Date": "August 18, 2013"}, {"Author": "Zariyah N.", "ReviewID": "R27PG59EK9RMM3", "Overall": "1.0", "Content": "IT BROKE AS SOON AS I GOT IT I WAS SO UP SET WHEN U TRYED TO SHIP IT BACK I COULDNT REACH U GUYS TO TELL U THAT I WAS ON VACATION  .................", "Title": "BROKEN SHIPING ..", "Date": "August 18, 2013"}, {"Author": "Scarlet", "ReviewID": "R2KHH9XIIC6TOI", "Overall": "1.0", "Content": "I purchased this in January and have had problems with it since I got it. First off I couldn't get the app store to work, so added Amazons app store and got good results. Then when adding an anti-virus program to the tablet I found out that it had been used before I received it, and could not clear out that persons info. So it wasn't safe to use on sites where I wanted to purchase anything for fear someone could get my info. And because I found all this out after the 30 warranty period I was stuck with it. And now to top it off, I am unable to charge the tablet with either the plug or the cord. This product is just a waste of money.", "Title": "Save your money", "Date": "August 16, 2013"}, {"Author": "Denise Clance", "ReviewID": "R1YZZTHPKQDX3X", "Overall": "1.0", "Content": "We purchased 4 tablets for Christmas for our grandchildren. Have been disappointed with this product of zeepad. They have had problems with pads every since we purchased them....", "Title": "Do not purchase", "Date": "August 15, 2013"}, {"Author": "lajune hallman", "ReviewID": "R4CX8C49QZC2S", "Overall": "5.0", "Content": "My 17 year old daughter loves the zeepad. Just as described and is perfect for games apps or internet surfing. Awesome buy for the price", "Title": "just in time for christmas", "Date": "August 1, 2013"}, {"Author": "J. Grunenberg", "ReviewID": "R2BQTCVZQISLYF", "Overall": "3.0", "Content": "Synopsis: A cheap tablet, with all that entails.I was looking for a cheap tablet. I wasn't sure I'd like, or need a tablet and didn't want to spend a lot of money trying to find out.I purchased the Zeepad in January. It had ok reviews, and the price was good.The good:CheapWorked fine for the games installed.Worked with Google PlayWorked as a decent, but not great, e-reader.No problems with connecting to Wi-Fi or using the SD card.The bad:The charger was bad out of the box. (Luckily charged through the USB slot).It bricked just past 6 months. (It wasn't rooted, and only had a handful of apps installed.)Slow and would lag on internet.Took time to render pdf pages.Not much information on how to unbrick online.Would I get another one? No. Was I happy with it while it worked? Mostly. I was mainly using it as a reader and even though it would lag rendering pages, it worked for what I needed. It never lagged during any of the simple games (Fruit Ninja/Angry Birds), but would bog down on youtube and other internet things.I'm now looking to replace it with a first generation Nexus tablet, or something similar. If I can unbrick it, I'll put it into the hands of the kids, but if not I didn't spend a fortune on finding out that yep, I did want a tablet.", "Title": "It was great, while it lasted", "Date": "August 1, 2013"}, {"Author": "Ayanna Wickham", "ReviewID": "R3DT63Y4GBPVJL", "Overall": "5.0", "Content": "This is a cool tablet for my daughter. Very neat. Comes with all the features needed by a young child.", "Title": "Cool", "Date": "July 31, 2013"}, {"Author": "Dawn", "ReviewID": "RM8QL1XLB2O2K", "Overall": "4.0", "Content": "I bought this for my 8 year old son and so far its been good for what he uses it for (games mostly) and its been durable surviving my other 3 sons as well! haha My 17 year old daughter liked it too and bought one for herself and so far no complaints from any of them!", "Title": "good buy for the money", "Date": "July 31, 2013"}, {"Author": "Vw \"tech geek\"", "ReviewID": "R3V9BXMGPC80P", "Overall": "5.0", "Content": "I bought this for my daughter who  loves to read. We  didn't use it a lot in the beginning and that was a mistake because we didn't notice that it was defective. The ZEEPAD  wouldn't turn on. We made sure that it was charged but it just wouldn't turn on. I contacted the manufacturer and returned the item. We had to pay for the shipping because it was past the three month guarantee. They sent us a brand new one right away. This is a very safe investment for the price. I am addicted to Amazon because they have excellent customer service. Just be sure to check your pad right away to make sure it works.", "Title": "affordable", "Date": "July 30, 2013"}, {"Author": "On Time", "ReviewID": "R25PJO6GICT4GB", "Overall": "1.0", "Content": "If you want a tablet that you can actually do something on, don't buy something cheap. The zeepad is slow and it's annoying how badly it's reaction time is. It's a terrible product.", "Title": "Why did I buy a Zeepad?", "Date": "July 30, 2013"}, {"Author": "Anita M. Reyes", "ReviewID": "R2EFLBD7YRGPEB", "Overall": "4.0", "Content": "Bought as a gift for my 8 yr old. She loves it. Comes with a few games already. She has no trouble accessing all its features.", "Title": "worth what I paid for it", "Date": "July 29, 2013"}, {"Author": "Alexis Pointer", "ReviewID": "R39X6J0KVENCS7", "Overall": "3.0", "Content": "Shortly after purchase, my daughter found that she was unable to utilize the camera to take pictures or record video.  Otherwise descent tablet for the money.", "Title": "Camera inop", "Date": "May 11, 2013"}, {"Author": "ashley", "ReviewID": "R3IK7RV9RS48KS", "Overall": "5.0", "Content": "this item is really great for all ages just be sure to not put in the wrong password too many times", "Title": "ashley", "Date": "May 10, 2013"}, {"Author": "judi b", "ReviewID": "R2LR0IWG45IMAW", "Overall": "1.0", "Content": "this is not worth the money.  won't hold a charge... wont charge 100% only 96%.  so not happy  do not buy this product!", "Title": "you get what you pay for!", "Date": "May 10, 2013"}, {"Author": "Ana Carrera", "ReviewID": "R34Z47S60HL4P8", "Overall": "3.0", "Content": "its okay for the price, and well what can i say my little niece likes it, so that is good. but needs improvement", "Title": "its okay", "Date": "March 17, 2013"}, {"Author": "cora lu", "ReviewID": "R1BLJ1TNI0G295", "Overall": "5.0", "Content": "I placed the order for a friend This was a gift for her son I have not heard any complaints I assume the children is happy because my friend has not mentioned anything", "Title": "great gif", "Date": "March 3, 2013"}, {"Author": "alicia  murphy", "ReviewID": "R295V3YTNOXGYC", "Overall": "5.0", "Content": "this is a good product i love it it does everything that it say it can do i would recomend this tablet to all of my friends or to any one for that matter. it ia fast as it says i love the games i love everything about it.", "Title": "great tablet", "Date": "March 2, 2013"}, {"Author": "Donna", "ReviewID": "R1AODQNFV5K1ML", "Overall": "3.0", "Content": "It would be OK if you are smart at these electronic devices. The instructions are not easy to understand and able to read", "Title": "instructions", "Date": "March 2, 2013"}, {"Author": "Hernan", "ReviewID": "R392U9WO788TCU", "Overall": "4.0", "Content": "Used for about a week by my children of 5 and 7. Hope these tablets continue working well! The only issue with the 2 tablets received is the quality of video calling by using Skype (better to turn off the video and just talk).", "Title": "Good purchase for my children!", "Date": "March 1, 2013"}, {"Author": "Julie Miller", "ReviewID": "R34HZSEX9QBOJF", "Overall": "5.0", "Content": "The kids loved thier new tablets, easy to operate, and very durable, we had purchased 2 other tablets that lasted 2 weeks.", "Title": "easy to use", "Date": "February 28, 2013"}, {"Author": "francisco rodriguez", "ReviewID": "R3D3H09ETEDS8Z", "Overall": "3.0", "Content": "used it for a few months and enjoyed but it but something happened with the power cell and now its just a big old paper weight. now i have to get it fixed..", "Title": "not bad", "Date": "February 28, 2013"}, {"Author": "P. Pan", "ReviewID": "R12C3RDM60XVXJ", "Overall": "2.0", "Content": "Hello,  This product is good for basic internet search and e-mailing.  I was hoping to use it to watch YouTube videos and listen to Pandora radio while traveling without having to have my laptop with me. It was very hard to control the volume as it would constantly go to zooming instead, disappointed, I chose to return the item, paid $11 shipping and they charge 15 percent restocking fee.", "Title": "Too slow for YouTube and Pandora", "Date": "February 28, 2013"}, {"Author": "franklins sifontes", "ReviewID": "R2OF7PJDZQOS0O", "Overall": "5.0", "Content": "Muy responsable , productos llegaron a tiempo y en buen estado.. recomiendo  abiertamente. . . . . . . .", "Title": "Recomendado como vendedor", "Date": "February 28, 2013"}, {"Author": "nick", "ReviewID": "R3GRSREIWCUON2", "Overall": "5.0", "Content": "Great deal for a tablet. Works good and great apps on the android store. I like everything about it and am 100% satisfied", "Title": "Amazing", "Date": "February 27, 2013"}, {"Author": "Chris", "ReviewID": "R1Z1YIST011Q6", "Overall": "5.0", "Content": "We got a 7.0 zee pad for our son for his 8th birthday and we love it, very simple and does everything iPod does but 100 dollars cheaper thanks amazon", "Title": "7.0 Zee pad", "Date": "February 24, 2013"}, {"Author": "April D Cobb", "ReviewID": "R3V798NNG63TNZ", "Overall": "2.0", "Content": "Not sure if all my problems with this tablet is from the unit itself or from the seller I bought it from in Hong Kong. That was my first mistake not reading thoroughly as I usually do and not buying within the United States. The tablet was slow doing anything,the battery life seemed to be short,there is no reset button to try. The settings menu for example looking up battery use you couldn't tell where you stood it says like 40% and then it would die. But, that wasn't the biggest issue as had it for a month and now it's completely dead. Now, if we go with just a bad tablet it happens and or something about the seller and overseas I can't answer about this tablet as it gets rave reviews which is why I bought it. One big positive I can say is the Amazon A-Z Guarantee. Make sure you have it. I asked them to step in when I was only having trouble before totally dying and I believe in less than 24 hrs. it was resolved and I received a full refund.  Another big positive to have on electronics from Amazon is the Square Trade Warranty. It's worth the extra money. I have had to use it in the past on another item and that is also everything you read on reviews. Easy,fast,amazing. Trying to be fair. Give it a try,buy within the United States, purchase Square Trade Warranty and that's my opinion.", "Title": "Zeepad issues or is it from the seller? But, I do have some positive info too", "Date": "February 24, 2013"}, {"Author": "amk3mom", "ReviewID": "R1BD6MS7ZMKBHX", "Overall": "1.0", "Content": "This is a piece of junk.  It is very cheaply made, the buttons do to work half of the time.  The charger doesn't work.  We had purchased two for both of our kids and we have to share one charger now.  Do not purchase.", "Title": "This product stinks!", "Date": "February 23, 2013"}, {"Author": "Anthony", "ReviewID": "R1R79OMJWVEVUQ", "Overall": "4.0", "Content": "I enjoy it. But i can't delete unwanted downloads, and it's beginning to run slow. Still I would recommend it. It was delivered on time and all n all it works just great.", "Title": "My zeepad", "Date": "February 23, 2013"}, {"Author": "Ibrahim", "ReviewID": "R9EURIW88JHSO", "Overall": "3.0", "Content": "i bought 3 Zeepad and i found one some aria in the screen not workingbut the other two working fineso in general it good", "Title": "its not bad", "Date": "February 22, 2013"}, {"Author": "uveprom", "ReviewID": "R2XR70KIVD77M0", "Overall": "4.0", "Content": "I was installing a game and stuck suddenly, and never again go into android, always stuck showing zeepad 7.0 on screen, but i did find a website with the firmware, i fix it doing reflash! now is in good working condition![...]", "Title": "Very good item, for the price", "Date": "February 22, 2013"}, {"Author": "DebRT", "ReviewID": "RN8D7A6K2BYYR", "Overall": "3.0", "Content": "Tablet works ok. Skype does not work on it, as I can't get video calling to work. Tried to uninstall and reinstall and it didnt work, even though I had enabled video calling. I was very disappointed in this. Also, battery life is poor. A fou hour charge will last about an hour and a half of normal use. Otherwise, the tablet works well and I am happy with it.", "Title": "Ok considering the price", "Date": "February 22, 2013"}, {"Author": "Bunny", "ReviewID": "R2N467010P73OU", "Overall": "5.0", "Content": "Purchased this for my grandson and in the past purchased 4 others for members of my family.  Everyone loves them.  I have a larger one, but may order on in this size since it seems to be a good size to carry in my purse.", "Title": "Android Tablet", "Date": "February 22, 2013"}, {"Author": "Terriprud", "ReviewID": "R291I7YSPXQMVX", "Overall": "4.0", "Content": "Only down fall is that the camera does not work for Skype  one of the main reasons my daughter wanted it.  However, great value for the money.  Bought one for my self", "Title": "Good value", "Date": "February 21, 2013"}, {"Author": "Robbie Huff", "ReviewID": "RX49EO6EU4IX0", "Overall": "4.0", "Content": "Awsome product for the price...  This is my first tablet and I love it.I really like my Zeepad tablet. For the price I got it for, I think it was really worth it. It does most of everything I was looking for in a basic tablet.  A friend recommended this table and I'm not disappointed at all for the price.", "Title": "Awsome product for the price...", "Date": "February 20, 2013"}, {"Author": "Theresa2674", "ReviewID": "R1MX5HFWYR6DVI", "Overall": "2.0", "Content": "I purchased two of these items for my children for Christmas.  Both had to get shipped back to Engine99 after a months use.  One of them, there is no longer any sound.  The other one, the power button broke and got stuck inside of the unit.  I shipped everything back at my cost (approx $25), to only get a call from them saying that I have to purchase parts for repair and that they are giving me a great deal.  Sorry, but a great deal to me is to fix the unit at no charge at all since it died after 30 days!!  I paid the $20 parts fee.  I also asked what the guarantee is on this \"new part\" that they are installing.  They informed me that there is no guarantee on it and if it breaks again, I must pay for it again.  I do not recommend this product.  Also, this product went on sale almost half off 20 days after I purchased it.  Fantastic!", "Title": "Died after a months use", "Date": "February 20, 2013"}, {"Author": "ellen.nbs", "ReviewID": "R1RGPC01Z7L8L8", "Overall": "4.0", "Content": "I wanted a tablet to use when traveling to play games and check my emails from - this is super for that. The only negative comment I have regarding this product is that it does not hold a charge very long. Need to keep it plugged in if I am using it for longer than a half an hour or so. Great for the kids to use so I don't have to give up my phone or laptop.", "Title": "Great for what I wanted it for", "Date": "February 19, 2013"}, {"Author": "THOMAS JACOBSEN", "ReviewID": "R2T37JK2YZEU94", "Overall": "4.0", "Content": "This was purchased as an entry level tablet /e-reader and is just about what I expected.I have experienced no real issues performance wise,I am quite satisfied with this purchase.", "Title": "zeepad 7.0", "Date": "February 19, 2013"}, {"Author": "M. Marcotte", "ReviewID": "R2MWEFTU3O7QDY", "Overall": "2.0", "Content": "2 out of 2 were disapointing.  Don't buy cheap tablets.  You get what you pay for.  Battery life is 50 percent of similar well known tablets.", "Title": "capacitive screen too sensitive.  random characters", "Date": "February 19, 2013"}, {"Author": "helen", "ReviewID": "R34K8OMLKFY7G4", "Overall": "5.0", "Content": "Finally we have a winner. Its great. Works fast. Its durable. Last long. Great for the kids. My friends loves it", "Title": "thank god", "Date": "February 18, 2013"}, {"Author": "Patricia", "ReviewID": "R24F2EC8O9EKL3", "Overall": "1.0", "Content": "I ordered 2 of these for my grandsons for Christmas.  They were awesome units, but within 2 weeks of use, they both crashed a few days apart with sudden grid lines going in both directions.  I emailed them asking for a refund, but they insisted I send them back for repair.  I did, and after several emails back and forth (they couldn't find them, needed my tracking number, etc., which thankfully I had and kept), asking the status of the repairs, they finally agreed to send me a refund.  I will say they promptly did process the refund, but I am out the return shipping for the repair.  They are a great concept, but I honestly cannot recommend them, at least from the company I purchased them from on Amazon.", "Title": "Sadly, this was a disappointment", "Date": "February 18, 2013"}, {"Author": "Thomas Rossetos", "ReviewID": "R14WZ9ILLMYUD6", "Overall": "4.0", "Content": "Does everything I need it to do with email, apps, and surfing the net.  Also enjoy playing a good game of chess on it.", "Title": "Pretty good toy.", "Date": "February 18, 2013"}, {"Author": "teresa o'dell", "ReviewID": "RYBPUQ4LRWWPG", "Overall": "4.0", "Content": "love my new tablet easy to use, and cheap...and it's easy to carry around and use it at work on break...", "Title": "my new tablet", "Date": "February 18, 2013"}, {"Author": "Gargirl", "ReviewID": "R36PTFZUA5HMSO", "Overall": "5.0", "Content": "My 14 year old daughter got this for Christmas from my boyfriend & the product was great.  She managed to break it though in less than two weeks by putting it in her over filled backpack so she bought herself (this) a replacement.  Great product for the money!", "Title": "Fantastic buy!", "Date": "February 18, 2013"}, {"Author": "dianamozee", "ReviewID": "R3APLJNE8EHRC1", "Overall": "5.0", "Content": "I loved the Zeepad, but it became defective after only two weeks. I returned this item on January 13th, and have not seen a response one way or another from engine 29. This is very unprofessional. I liked the Zeepad just fine, it was a great little tablet, I am however unhappy with Engine 29", "Title": "Zeepd", "Date": "February 18, 2013"}, {"Author": "Delores", "ReviewID": "RBCEZOOB5A5XI", "Overall": "3.0", "Content": "Today is the third day that i am using the tablet and i am having problems with the battery, it is only lasting about an hour, I have tried letting it to discharge totally before charging it and it is still not lasting more than an hour of use. also it seems to be very fragile, honestly i bought it because i find the reviews for it was good, but right now i would prefer a refund. I am not sure i will get enough use from it for my money.", "Title": "I am not sure i trust this tablet", "Date": "February 7, 2013"}, {"Author": "johnzee", "ReviewID": "R3TU7WEK9W6N0I", "Overall": "5.0", "Content": "GREAT FOR GAMES AND YOU TUBE. A LOWER COST REPLACEMENT FOR AN IPAD FOR A 4 YR OLD. HE LOVES IT", "Title": "MY GRANDSON LOVES IT.", "Date": "February 7, 2013"}, {"Author": "Mslovwil", "ReviewID": "R148AP9ZU47LPO", "Overall": "2.0", "Content": "I bought it for my teenaged son. He seemed to like it at first. Then the touch screen sensor stopped working. At this point I don't see the value....I am disappointed in the quality of the Zeepad. Wish I had not bought it in December.", "Title": "It's Okay......", "Date": "February 7, 2013"}, {"Author": "joe", "ReviewID": "R2FD56QQ1QOO8I", "Overall": "2.0", "Content": "Had to return, as it went black 1 hour after got it up and running. Seller was great, giving me credit. Went out paid the money and got the samsung tab 2  7\" been very satisfied.", "Title": "Pay the extra and buy a better tab.", "Date": "February 7, 2013"}, {"Author": "Sarah D. Crandall", "ReviewID": "R3QEGW540YXJ1F", "Overall": "5.0", "Content": "A very inexpensive tablet that does the job...it is a great starter tablet. It does look a little cheap though.", "Title": "Does the job!", "Date": "February 7, 2013"}, {"Author": "Jenn B.", "ReviewID": "ROFGKLWZ699WQ", "Overall": "2.0", "Content": "If you want a tablet that is cheap and good for web browsing, then this will work for you. In regards to memory, you ARE NOT getting 4.0 GB. The tablet I received has only 1.1 GB available for usage. It is very cheap and feels as if it will break if dropped. Has a tendency to freeze up just with normal usage. I would not recommend purchasing this tablet. Spend an extra hundred dollars and buy a Kindle.", "Title": "Not as Advertised!", "Date": "February 7, 2013"}, {"Author": "schnoodle \"mystery reader\"", "ReviewID": "RCE7M0F3BE0XN", "Overall": "3.0", "Content": "I've never owned any sort of android before and the instructions were Translated by someone who did not know English.  Therefore barely any help. I am still trying to figure out how to get my Yahoo calendar with my Gmail calendar I'm still trying to figure out how to download my books from Aldiko.  i guess i have to Find someone to help me. I wish i could find a manual somewhere.  It is frustrating.", "Title": "Hope not all androids r like this!!", "Date": "February 7, 2013"}, {"Author": "David M. Fitzgerald \"-Admiral Dave\"", "ReviewID": "REW6IV965FNNI", "Overall": "4.0", "Content": "It's a good buy if you have realistic expectations of what you are paying for. My boy loves it and it works with the most of the popular apps and games from Google Play so far. It would not play Grand Theft Auto, which leads me to believe that support of intensive 3D games could be spotty. Battery life isn't great so bring the charger if you will be using it when out and about.", "Title": "Zee is no i, but its good for kids", "Date": "February 5, 2013"}, {"Author": "Carrie Reynolds", "ReviewID": "R6CX3PX3TUP3Z", "Overall": "5.0", "Content": "We ordered this for my 3 year old son, and so far it works great for him. It was a reasonable price, and it did exactly what we wanted it to do!", "Title": "So far so good!", "Date": "February 4, 2013"}, {"Author": "okkkkkk", "ReviewID": "R6OVRTZ51O20S", "Overall": "4.0", "Content": "My child loves it but it lock and we can't unlock it.What do we do? There was no manul in the box. How can I get a new one.", "Title": "Lock????", "Date": "February 4, 2013"}, {"Author": "Victor", "ReviewID": "R1KPI40ZGW6N8P", "Overall": "4.0", "Content": "I received this Zeepad 7.0 tablet quickly.  It was packaged in China and looked fairly cheap, but all components including two USB adapters were included.  My problem was the stand alone AC  charger.  It didn't work even after 'fiddling' with it.  However, I was knowledgeable enough to know it could be charged with the included adapters via USB.  This is the ONLY way I can charge it, but at least it can be done, and for me is not a problem.  The price is fantastic.  The features are good and it works quite well with the Android 4.0 OS.  Having access to Google Play makes for an endless stream of apps.  The battery holds up very well for maybe 4 hours of hard use, and the standby is very good as well.I asked the merchant for ideas on the AC replacement to no avail.  I didn't even get a response from them.  I'm happy with the unit... just not the merchant's response.  For the money, you will get a very good 7\" tablet. It also works well with the keyboard 'clutch' case that plugs into the USB slot.  I highly advise adding this $10+ accessory.", "Title": "Great 7\" Tablet with One Problem", "Date": "February 4, 2013"}, {"Author": "Dale M. Johnson \"Zakarman\"", "ReviewID": "R84IZE3NY07OS", "Overall": "4.0", "Content": "Purchase this case after rerading the reviews and I really like the fact that you can access the Google Playstore to download apps. Additionally I like the expandable memory. The performance is good too!!", "Title": "Great First Tablet", "Date": "February 4, 2013"}, {"Author": "Rachel McMaimie", "ReviewID": "R1VNJ3N9MQFR2F", "Overall": "1.0", "Content": "It was scratched when I got it the screen and the red paint as well headphones worked one time playing games on it gave me head ache if you not looking strait at it it is blurry very hard to read anything on it and the sound is terrible I try useing a plug in speaker but did not help much at all  I'm going to give to my son  that is 5 years old proably be ok for him for awhile", "Title": "screen is really bad", "Date": "February 3, 2013"}, {"Author": "wayne", "ReviewID": "RA5ML9GPKPVZE", "Overall": "2.0", "Content": "The zeepad was received and it appeared to be just what we ordered but it was shipped  with very little almost no charge, therefore it had to be charged before we use it,after reading the ihstruction booklet we allowed it to charge overnite  and the next day when we tried to use the tablet it still wasnt charged this made me very suspect of the tablet or its AC adapter we werentt sure which was the problem and decided to return the item.", "Title": "Zeepad looked fine but???", "Date": "January 30, 2013"}, {"Author": "Edzaida Salcedo", "ReviewID": "R3CH4A8JNN9SM9", "Overall": "4.0", "Content": "Excelente.. me encanta!! muy útil.. justo lo que necesitaba :D lo recomendaré a mis amigos para que lo compren. .", "Title": "Excellent", "Date": "January 28, 2013"}, {"Author": "P. Mitchell \"prmit\"", "ReviewID": "R3H8MHF3FTW6YB", "Overall": "4.0", "Content": "I received tablet  within  the stated time frame. Was excited about that considering  I never received my tablet from the first company I ordered from.The tablet was purchased as a Xmas gift for a 5 year old and it appears to be perfect for that.  The screen is not hd quality, the headphones appear to be needed for sound, and the touch screen can be unresponsive at times but for the price I think it serves it's purpose pretty well, so far. I had no problem setting up the WiFi and logging into the internet.  Downloading games was really fast too.  I think my grandparent will love this. I' m considering buying 2 more for my other grandchildren.", "Title": "I finally got one!", "Date": "January 12, 2013"}, {"Author": "LINDA DIEBOLD", "ReviewID": "R801QZF245XBX", "Overall": "5.0", "Content": "Bought for my kids for Christmas!  They have downloaded all their favorite apps and when they are at school, I play with it! LOL", "Title": "FANTASTIC PRODUCT!", "Date": "January 11, 2013"}, {"Author": "poorboy", "ReviewID": "R25F3C3XSECX3Z", "Overall": "2.0", "Content": "This Zeepad android i order for my Granddaughter is not what I expected...Cant download games; and someone keeps sending e-mails to the address.  I have even tried to download free games and always get an error..The most thing my granddaugher like is she can take pictures and Video..Now I have to figure out what to do, also, the product said it comes with Netflix...it don't.  I have Netflix account and tried to access through Google, got through but still could not watch movie, it seam to just stall.  My thing is I think this is a refurbished Zeepad; because it was already set up under someone else account...", "Title": "NOT WHAT I EXPECTED", "Date": "January 11, 2013"}, {"Author": "Amazon Customer", "ReviewID": "ROE8B2UYMMM1O", "Overall": "5.0", "Content": "Since I bought this for my wife she uses it all the time and she even sleeps with it beside the bed.  Money well spent.", "Title": "The Wife loved it!", "Date": "December 28, 2012"}, {"Author": "Carolyn Finnerty", "ReviewID": "R2ASFM58ICGVW0", "Overall": "5.0", "Content": "This tablet was purchased as a Christmas gift for my young granddaughter and it fits the bill perfectly.  It came with a pretty pink gel casing and the start-up was easy enough for this grandmother to sort through.  It plays Netflix well and all of the free kids' games we downloaded for free are running easily.  My daughter says she loves it as much as the little one.  The screen is clear and the speed is generous enough not to be frustrating.  A real winner for the price!", "Title": "Just what I was looking for!", "Date": "December 28, 2012"}, {"Author": "deandra barr", "ReviewID": "R1F9LSL1EIYGBR", "Overall": "5.0", "Content": "really nice, they work very good and my husband love them to.. everybody should try on n the price, love it.", "Title": "really great item", "Date": "December 27, 2012"}, {"Author": "kristy", "ReviewID": "R3B9DTQIB2371X", "Overall": "4.0", "Content": "Overall a good tablet. My daughter loves it! The charger sparks when you plug it in so I would get a new one, but so did the one for my cell phone so I guess its not that uncommon. It works great and having almost everything I wanted preloaded on there is a big plus!", "Title": "Good for the price!", "Date": "December 27, 2012"}, {"Author": "Jessica Shivers", "ReviewID": "R2QEHDST1ICUTB", "Overall": "4.0", "Content": "I bought this device for my 5 year  daughter for christmas. So far so good. It does everything that my android phone does and more. She has enjoyed playing games and using the different apps. The only downfall is that the battery doesnt last all day but for the price I can't complain.", "Title": "Christmas Gift", "Date": "December 27, 2012"}, {"Author": "SS817", "ReviewID": "R1GOO8VDJ6BDYV", "Overall": "1.0", "Content": "Let it be said....You get what you pay for! & Buyer Beware! The pad is very slow, i bought it for my 6 year old and she loses interest in it quickly because it takes so long to start an app.", "Title": "POS!", "Date": "December 26, 2012"}, {"Author": "Tawnie", "ReviewID": "R369XLECWN84TJ", "Overall": "4.0", "Content": "Bought it for my son he loves it .. its slow also.. although i ordered the pink one for my daughter and never got it and had to file a claim.. the one i did get was an ok tablet.. saddened my daughter never got hers for xmas though..", "Title": "Its ok i guess", "Date": "December 26, 2012"}, {"Author": "marco", "ReviewID": "R2Q1TU7WRV86DR", "Overall": "5.0", "Content": "ZEepad is a great tablet. I just recived it today came with two games already installed (angry birds,fruit slice) the tablet is andriod 4.04 & has play store. Front camra is alright. Speakers are good and pretty loud. Bottom line its a great tablet at a great price.. Recommended", "Title": "ZEEpad...great", "Date": "December 24, 2012"}, {"Author": "prettyme", "ReviewID": "R3KTAZBSBNRW8R", "Overall": "5.0", "Content": "came on time neatly packaged and it runs very well i love it cant complain i would recomand to others", "Title": "love it", "Date": "December 3, 2012"}, {"Author": "Chad Layman", "ReviewID": "RGQNCLTF3SESA", "Overall": "1.0", "Content": "Poor product, it won't even turn on.  Company refused to exchange for another one.  Extemely disappointed, it was a Christmas present.", "Title": "poor product", "Date": "January 8, 2013"}, {"Author": "Ping", "ReviewID": "RZ5Q9GKZYKTL2", "Overall": "3.0", "Content": "I received the tablet with enthusiasm. It worked fine until I realize that the camera shows static. There is not even a glimpse of image. I have never been able to use it. Also i tried to connect my flashdrive and other USB devices to it but they do not show up. I contacted the seller but I am yet to receive a response. I am not pleased with my purchase and the poor customer service.", "Title": "Damaged camera and USB port does not work", "Date": "August 28, 2013"}, {"Author": "Ran", "ReviewID": "R3GMY6KHICKOC9", "Overall": "2.0", "Content": "The tablet has not broken down.. YET!  I'm waiting for it (It's my 6 year old's tablet).  My problem with the tablet is everything that came with it was garbage and timed for self destruction.  The stylus lasted 1 literal day the connector lasted 2 literal days; haven't used the usb adapter so its still around.. The screen protector latest about 1 week.. Again i'm waiting for the tablet to go if it was also built to this quality.The stylus point pushed in; The connector was brittle and the prongs broke into the case... 2 Stars..As far as the tablet its self it is working pretty well; expected speed, response and cam image quality...", "Title": "Ahhhhhhhhh!", "Date": "August 14, 2013"}, {"Author": "Tester", "ReviewID": "R3K39T0VI8GK4W", "Overall": "4.0", "Content": "Do not buy if children under 7 years of age it lasted us about 6months. Bought two, and both screen cracked.", "Title": "Good", "Date": "July 13, 2013"}, {"Author": "Regina Gamble", "ReviewID": "RNWM9T8C17AFN", "Overall": "1.0", "Content": "This was a birthday day present for my daughter it does not have flash camera like it was noted false advertisement also it looked used I should of taken it out of the box before I gave it to her and  she did not receive the earphones and something else it was suppose to come with it.  I ordered this  back in April because it was cheap.  Now I see Zeepad has taken the part out about flash camera and reduced the price.  I would not recommended this to someone over the age of 5.", "Title": "Cheap Present", "Date": "July 4, 2013"}, {"Author": "K. Lucas", "ReviewID": "R13SO2DEMRE353", "Overall": "4.0", "Content": "I ordered two of these to save my Kindle from my 5 year old twins.  They love them so much, I now have to pry the zeepads out of their hands to get them to come to dinner.  This is NOT the same calibre tablet as the Kindle Fire HD or the iPad, or Samsung!  The screen is not HD, the touch sensors are sluggish, the processor is not fast and the battery life is relatively short.  That said, it works perfectly in the twin's small hands and gives them access to games and a camera AND it has the capacity for more memory.  I am happy give them this much power for less than $100.  I'm not sure how long they will last, but so far I don't regret my purchase at all.  Over all, I am happy with them.", "Title": "Great tablet for Kids", "Date": "July 2, 2013"}, {"Author": "crazymama7", "ReviewID": "R2CX8C6DM6NMIR", "Overall": "1.0", "Content": "This item is horrible..from day one I had serious problems with it, it will not hold a charge, it freezes up constantly,shuts off by itself, it is very slow!!! It is the worst tablet you can purchase!", "Title": "junk", "Date": "June 8, 2013"}, {"Author": "Mildred P. Gomez", "ReviewID": "RLZ1M3WPVSH5C", "Overall": "1.0", "Content": "I purchased the Zeepad for my daughter in January.  For some reason the color of the screens is turning green.  It started off with some parts of the pictures were not the right color but now almost the whole screen has the wrong color. I made sure that the color setting was correct. The seller would not exchange it for us.  after only owning it for less than 4 months my daughter is not able to use her tablet.", "Title": "Not a good tablet.", "Date": "May 8, 2013"}, {"Author": "feelin the burn", "ReviewID": "RRDF4KZQ0ONL6", "Overall": "5.0", "Content": "i was a little nervous with the limited reviews and the low price, but it is exactly what i was looking for. i can watch Netflix on it with no problems and play games.I have not only recommended it took friends, but three of them have since bought one for them selves.", "Title": "i love my zeepad", "Date": "February 25, 2013"}, {"Author": "Natasha Elliott", "ReviewID": "R1MH21J94TNGSD", "Overall": "4.0", "Content": "Well I bought this for my 11 yr. Old son. I had to return another one because it malfunctioned. But so far this is working fine", "Title": "so far so good", "Date": "February 24, 2013"}, {"Author": "Roxanne D. Carroll \"Brain Ninja\"", "ReviewID": "R1UOOESX14BREP", "Overall": "4.0", "Content": "If you are not looking for an expensive pad, this one is very good. It can be slow at times, but it works great. Took it on a road trip with my daughter and with the small mini usb to usb connector, I was able to plug in my flash drive I loaded with tons of movies. Uses google play store, so i was able to gt all my apps on there. I was also easily able to get my kindle app on there and use it.", "Title": "Like it a lot for the price", "Date": "February 23, 2013"}, {"Author": "Erik Schrauger", "ReviewID": "R1B8CZSV7LPB8X", "Overall": "5.0", "Content": "Bought this for my kid and she loves it. It's better than the one I paid more for and broke already.", "Title": "Great fo the price", "Date": "February 23, 2013"}, {"Author": "Raul Dominguez", "ReviewID": "R24DB25HRKM9DM", "Overall": "5.0", "Content": "I bought the pair, hard cover case and 7\" Zeepad as recommended by Amazon, I got both on time and in good working condition, but when I tried to connect them together the Zeeppad does not \"see\" the keyboard. I tested the keyboard with my laptop and it does work fine. I contacted both manufacturers and they blame each other by not accepting any responsibility. In other words, they do not advertise their products together, but Amazon does. Other than that, the tablet works fine, as expected.Update: After trial an error, I found the adaptor USB to mini USB that came with the tablet to be the defective link. Both devices work fine now. I am now upgrading the tablet to 5 stars.", "Title": "Advertised together with 7\" Zeepad but they are not compatible", "Date": "February 23, 2013"}, {"Author": "Joshua Thaler", "ReviewID": "R3N1AQVD123PT1", "Overall": "5.0", "Content": "bought recently and has worked wonderfully, I got the android keyboard case to go with it and works just as well as a netbook, compaired to my android phone I have yet to fill up half the memory and have 3 times the apps installed.  have yet to find any boatware that really takes up much space.", "Title": "Works like a dream", "Date": "February 22, 2013"}, {"Author": "J. Owen \"jdog\"", "ReviewID": "R1K7UWVQ36G5KH", "Overall": "5.0", "Content": "Great product at a great price. Perfect for kids first tablet. Easy to download games for thekids. They love it..", "Title": "I love it. Purchased it for my kids. Great product at a great price.", "Date": "February 22, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00CQCVA9K", "Features": null, "ImgURL": null, "Name": null}}