{"Reviews": [{"Author": "Aaron Murphy", "ReviewID": "R2Y3MN6VX4Z7FK", "Overall": "1.0", "Content": "I purchased this tablet as an inexpensive alternative to my iPad.  There are times when I want to carry a tablet, but don't want a full-sized tablet or risk damaging an expensive tablet.  I received the M772 and unboxed it.  Nice design, light-weight, etc.However, there were two things that I found out of the box... 1) this tablet will not charge via USB.  You have to use the power adapter only.  Annoying, but not a deal-breaker.  2) My desk is on the opposite corner of the house from my wireless router.  At my desk, I have a laptop, iPad, and a phone, all connected via Wi-Fi.  All three devices get \"Excellent\" signal strength (usually 5 bars, although at times, it might drop to 4 bars).  The M772 tablet get no connection.  I have to get within 10 feet or so to get the same signal strength.I contacted the manufacturer the day after receiving my tablet to troubleshoot the issue.  Through the course of troubleshooting, the tech came to the conclusion that it had a bad Wi-Fi receiver and set up a replacement exchange.  I went ahead and sent the tablet in for exchange.  When I received the replacement, it had the same exact issue.  The tech recommended that we attempt a firmware update.  However, after following the instructions, the update tool doesn't recognize the tablet to perform the upgrade,  The tech, the same one I've been working with the entire time, had never heard of this issue and was going to contact the tech that trained him.  After a couple of missed callbacks, I am done.I have come to suspect that this is a design flaw or a sub-par Wi-Fi receiver.  I am outside of my return period here at Amazon and the company is unwilling to either exchange the tablet with another model or refund my money.  So, I am stuck with a sub-standard tablet and will never buy another Kocaso product ever again.  I took a risk on them this time and will not do so again.", "Title": "Avoid it like the plague", "Date": "September 19, 2013"}, {"Author": "Gerald H.", "ReviewID": "RZ556N0HPMHWR", "Overall": "5.0", "Content": "it has a fast processor, the touchscreen is very responsive, and the colors are beautiful... i've had it a month and it never crashed once despite heavy usage... ran every video i asked it to, and the playback was smooth.a few points on the item description:description states 8 g of ram, it has 8g of flash and 1g of ramdescription states 6 hour battery life, it will give you 3 if you're playing games, and a little over 4 if you're only reading ebooksit could use a better wifi antenna, and having only 1 usb port is a pain especially since it won't support a hub or an external hdd", "Title": "a great little tablet", "Date": "August 10, 2013"}, {"Author": "Computerman", "ReviewID": "RN1KHBHITXZC7", "Overall": "4.0", "Content": "I was looking online for a cheap alternative to a kindle.Was looking at the Galaxy tab 2 but reviews weren't good,Then I stumbled upon this gem.OK so its not an iPad but for a 100  dollar bill you can over look that.I have a Toshiba Thrive 10.1 tablet and I love that too,but also wanted something that could fit in a coat pocket.The fact it has a HDMI port is also a plus and a SD slot for more space.Again great alternative..", "Title": "Good little tablet for a cheap price", "Date": "June 21, 2013"}, {"Author": "James Smith", "ReviewID": "R28GE25W5OMF2R", "Overall": "4.0", "Content": "As I type this on my tablet, I recall growing up in the late 90's, when tablets like this where still high end. Now, for less than a Benjamin, you can pick up a well functioning tablet. It isn't perfect, but it is solid.Pros:Light weight, accurate touch controls, average cameras, micro SD support, HDMI output. Micro USB port. Solid processing speed and RAM for the price range.Cons:Undesirable battery life.", "Title": "Great Starter Tablet", "Date": "June 18, 2013"}, {"Author": "Todd Olson", "ReviewID": "R2Y7NO5AJEBOTR", "Overall": "4.0", "Content": "Little slow to connect to internet, but overall works good.Connects to Play Store no problem.Sound is good, a big difference between headphone and not though", "Title": "Daughter likes it", "Date": "August 29, 2013"}, {"Author": "T. Bentley \"CM Mom\"", "ReviewID": "RJ9YQI4Q32ESG", "Overall": "2.0", "Content": "I purchased this so I could have a light tablet that I can use both my kindle and nook accounts on and have online access of a tablet. It is light enough and the size I wanted for reading and the color/display was good also. The downfall of this tablet is the battery life and the very week wifi. I have to be in the same room as my wifi to use it. This is not convenient. The battery does not last long enough for my reading pleasure. The constant recharging as made the battery life even worst. I had the misfortune of using the tablet while plugged in (so I could actually read more then 15 min) and it slipped out of my hand. It did not land hard, but  it did land on the plug and loosen the connection. Now I have to not only have it plugged in, but have the cord sit just right so it connects. I am ready to chuck it. It was a waste of the $70 I paid for it.", "Title": "Poor Substitute", "Date": "January 11, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00COXAE3O", "Features": null, "ImgURL": null, "Name": null}}