{"Reviews": [{"Title": "COMMON Touchscreen Failure For ALL Samsung ATIV Tablet PC Models (500t and 700t)", "Author": "MrGuy", "ReviewID": "R3Q9DBJ6WR42F5", "Overall": "1.0", "Content": "I bought the 700t from eBAY and it worked fantastically for almost three months until the touchscreen stopped working... s-pen still works, but who cares. (FYI: Samsung DOES NOT honor transferred warranties, so I'm on my own)I was using it for about an hour as a tablet one morning, and when I was finished I put it on the keyboard dock, and put it to sleep. I turned the unit back on about an hour later and the touchscreen did not work; no indication that it was going to fail before-hand, just completely did not work.I have nearly 20 years of technical experience with computers, with certifications, and even I can't resolve this problem, which looking in forums all over the internet, is a VERY common problem for this and ALL Samsung ATIV tablet PC models (500t and 700t).Samsungs ONLY solution is to return and replace.My unit:- All Samsung updates are installed- All Windows updates are installed- Unit has been lovingly handledThings I've done to fix the touchscreen problem:- Wiped drive/factory recovery 3x- Repeatedly uninstalled/reinstalled Wacom and touch drivers (even tried older versions, and some 3rd party)- Windows restore 3x- Spent days looking on forums for answers- Cleared CMOS- Hacked BIOS update program and reflashed BIOS firmware- Disassembled unit, cleaned all cables/connections with isopropyl alcohol, reassembled- Replaced digitizer with exact OEM- Cried inside...Why Samsung???Short of replacing the main HannStar board, I've done everything in my power to fix the number one major feature of a tablet. I didn't give you $1400 for a TOUCHLESS TABLET!!!!It wouldn't be so infuriating if this thing wasn't perfect for me :(That being said... PLEASE save your money and buy a Surface 2.", "Date": "December 6, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CSS56KQ"}}