{"Reviews": [{"Title": "Pretty Good", "Author": "Amazon Customer", "ReviewID": "R2ROPRAQ80XN1M", "Overall": "4.0", "Content": "I was actually afraid at first to buy it because it was so cheap, but as I started to play with it didn't find too much problems with it. There was only two things I didn't like about it, first the screen quality wasn't that especially when looking on a website with a white background. Secondly sometimes things start to slow down really quickly if too much apps (like about 5) are open, but everything else about it was pretty good, wi-fi was easy to set up, apps are easy to download and it is really light. This a great first tablet to buy.", "Date": "August 24, 2012"}, {"Title": "Horrible Customer Service, actually NO Customer Service", "Author": "Ashley Sinder \"Ashley\"", "ReviewID": "R2FTP41K6Z4AJH", "Overall": "1.0", "Content": "I bought 2 of these tablets, a blue one and a pink one on October 15, 2012. They were to be Holiday gifts for my kids but we decided to give them early, due to a long drive we wanted to take on November 8, 2012. By November 19, 2012 the blue one will not boot all the way up. It freezes with the \"Android\" name on the screen. The pink one freezes and has to be force restarted multiple times a day.I have left a voice message with Visual Lands Technical support, and 1 message with the operator as the technical support mail box was now full...hmmm really?I have sent an e-mail 7 days ago with no return message and sent another today, 7 days later.I was told by Wal-Mart that after their 15 days returns policy on electronics it was then up to the manufacturer to honor their warranty. I also bought an extra 2-year warranty through Wal-Mart and of course that does not start until AFTER the manufacturer's warranty.So...my suggestion is to buy a different tablet from a different company because what kind of customer service does not call back? Also, what kind of company constantly sends you to voice mail?Very disappointing! Now I have one child with a tablet and one without. Those with kids will know that this is not going to work! I bought 2 tablets because I needed 2. It should not break in less than a month.UPDATE ONE:Finally after more than a half dozen attempts I was able to send the tablet back and then again, I could not get anyone to give me status.Two weeks later I got anew tablet in the mail...yay...NOT, that was TWO days ago.Now it freezes and won't turn on. I had to reset it the FIRST time I took it off the charger out of the stinking box! So now I am BACK to leaving messages and sending emails because this one didn't even work more than SIX hours!DON'T WAISTE YOUR MONEY THIS TABLET SUCKS!!!!!Now I am playing the customer non-existent game again!", "Date": "November 27, 2012"}, {"Title": "Good price, mixed results.", "Author": "Eric Pearson \"eric\"", "ReviewID": "R2CLTFZTE6W6XC", "Overall": "3.0", "Content": "Good tablet for price. Unfortunately, app sellers like google and amazon won't let this one download (not on their list of approved devices).Decent sound and picture. Inadequate manual and help functions. Good wi-fi reception.", "Date": "September 18, 2012"}, {"Title": "Just know what you're getting into", "Author": "Nikodem Leszek Blach \"Nik\"", "ReviewID": "R3TPZ08NBPXYLK", "Overall": "3.0", "Content": "I got this tablet seriously cheap at a local store. It was bought online I guess and then returned to the store, they didn't know what to do with it so they discounted it 75%.  So, for the price I paid, I'm not complaining.But I've used a lot of technology, from the Kindle to ipads and all that so I know a good deal about these devices.  I also use an Android phone running Jellybean so I'm familiar with the interface for the most part.The tablet can hardly run itself. To start, but that's the most negative thing about it. It'll lock up and freeze for moments constantly while you're trying to get stuff done, open applications, install stuff, and all that. I found that when I use the base launcher (not vLauncher) it runs a tad bit better but not much.But, once you have something running (Angry Birds Star Wars, Draw Something, Evernote, ect...) it runs like a champ.  This is actually the exact problem I had with my Kindle Fire (original generation) the interface was laggy and slow while the applications ran perfectly.  But this might be to a different level.This device does Not have an accelerometer. So think about that and what you'll use it for before buying it.  Second game I installed was Temple Run and that was when I discovered this.You can install the Amazon App Store on here but for me it's become corrupted after I got 2 applications from it, twice. And not like, I restart and it works, I had to uninstall and reinstall to get it to work. GetJar never works on anything ever so don't bother with it, but this tablet comes with another app store... called the #1 appstore or something? I can't remember. But that one is the best. That's where I got all the game apps listed above and they worked great, downloaded fast, all that.My Mic is completely broken on mine, likely why it was originally returned. I haven't messed with the warrenty yet but I will later today. I don't care if they replace it or not, I didn't buy this for Skype (and the camera is pretty rough quality) but I might have an update about my customer service experience.But anyway, for what I paid, this is an awesome device for youtube, pandora, games, reading and fun things like that.This is Not a great device for internet browsing (it freezes up a lot), heavy usage or business.So take that for what it's worth.  The screen creates a pretty low quality image, but again - what you paid for, the touch interface works surprisingly well with all things considered though.  The build feels nice but you'll notice while holding it firmly that the screen starts doing the blur things LCDs do, this thing probably couldn't survive a real fall and could probably snap in half if another pressure were applied.  So yeah, keep that in mind to. Probably not for a kid to throw into his backpack to survive a ride to school.Battery life is fine, doesn't get too hot, you can expand the memory and it comes with a USB to PC adapter and a mini USB to standard USB adapter to attach devices. Headphones are half-decent too.", "Date": "December 31, 2012"}, {"Title": "This device stopped working after 2 weeks.", "Author": "Steven Fradin", "ReviewID": "R1NT92YRJP4QUJ", "Overall": "1.0", "Content": "My daughter ordered this tablet, which stopped working after two weeks.  No way to fix it so she returned it.", "Date": "March 22, 2013"}, {"Title": "Visual Land tablet", "Author": "Kathy", "ReviewID": "R1UKXXHV5BGUQV", "Overall": "1.0", "Content": "This tablet was a piece of junk from day one.  I know now that it never worked properly.  After it didn't work at all, we followed the instructions on warranty card.  Don't bother with that.  The company has been jerking us around for a month with there excuses. We have nothing but piece of paper that we paid to send it back. They have the tablet and we have NOTHING>>>  I'm sure if we ever do get one it will a refurb and will crap out within a short period of time.  Save your money for something better and not from VisualLand.", "Date": "March 2, 2014"}, {"Title": "Not worth it", "Author": "Mary P Rohde", "ReviewID": "R2CD8QFUJ2TAJF", "Overall": "2.0", "Content": "I don't use this as much as I thought I would.  The browsing is VERY slow, which makes it difficult to use.  I like the Kindle app and the email, I play a few games.  I don't think it was worth the money, even though the price was not bad.", "Date": "March 21, 2013"}, {"Title": "Second time I have had to get a replacement in 1 year 3 months", "Author": "Lynn Nielsen-bohlman", "ReviewID": "R3FG2UITAD2Q99", "Overall": "1.0", "Content": "Seemed like a good tablet at first.  Started having power-up problems.  Was advised to reset to factory settings, but problem returned.  Got replacement under manufacturer's warranty.  In about 9 months another power-up problem is occurring.  It is also pretty slow, even when there are no problems.  I am glad I bought the SquareTrade warranty, but sorry I chose this tablet.", "Date": "February 23, 2014"}, {"Title": "Don't waste your money!!", "Author": "styerl", "ReviewID": "R1MX7JHK4LUDDZ", "Overall": "1.0", "Content": "I purchased this for my daughter thinking it would do everything an 8 year old needed.  Based on the specs I assumed it would be slow but it is worse than I anticipated.  It has a difficult time loading simple games and it often freezes even after disabling all of the unnecessary apps.  Two days ago it reset and while the apps are listed in settings, I cannot access any of them.  Spend a little more and buy a tablet that actually works.", "Date": "February 23, 2014"}, {"Title": "terrible buy got two and screen freezes", "Author": "Sue Mace", "ReviewID": "R35NGNPUA6H9W8", "Overall": "1.0", "Content": "I bought one and had trouble then reported it and was told to send 50.00 dollars and the tablet and they would fix it. The total cost including shipping was 65.00 after i had paid 101 to walmart for this tablet and a cover for it. I have had it back two weeks and it has frozen again and I have tried to reset it. NO go to something different", "Date": "January 27, 2014"}, {"Title": "Very good", "Author": "bonitana", "ReviewID": "RC8EVD75QWZU4", "Overall": "5.0", "Content": "The only thing that I dont like is that the camera is not double, I can only take pictures one way. But the rest of it is very good,and easy to use.", "Date": "July 14, 2013"}, {"Title": "Great tablet for the kiddos!", "Author": "campbella \"Campbella\"", "ReviewID": "R16SHEMOS11MTM", "Overall": "4.0", "Content": "This tablet works well for our children. We were able to purchase this tablet at Walmart for $89 in purple. It is a very pretty, true purple. My daughter is only able to play apps that we have downloaded for her. She does not use the internet. They seemed to download fairly quick. We haven't experienced any trouble using the apps.When we pulled it out of the box, it had a sticker on it that said it had been upgraded to jelly bean. It's interface is easy to use.The screen's resolution is definitely not as good as higher end tablets. It seems kind of fuzzy. It is very touch sensitive, but it does tend to lag.I would recommend this tablet to anyone looking for a tablet for their younger children.", "Date": "February 25, 2013"}, {"Title": "Very impressed.", "Author": "C Arocha", "ReviewID": "R2R4EG90EM557X", "Overall": "5.0", "Content": "Bought this for my husband. He loves it. Perfect for his needs. He was very impressed with the speed and grafics", "Date": "February 24, 2013"}, {"Title": "Nice", "Author": "krisnic", "ReviewID": "RXRQCXSNLX2EM", "Overall": "5.0", "Content": "Daughter uses daily, she loves it for snap chat and FB, some games etc....I love the price, shipping was super fast, not thrilled bout the FedEx man leaving out in the rain by the rd :/", "Date": "May 7, 2014"}, {"Title": "Bought it", "Author": "cruzer01", "ReviewID": "R1ZJBS9Y3JU2E1", "Overall": "3.0", "Content": "When I received the tablet, I had a problem with it my neighbor helped me with it, it didn't help, I think it had a processor problem", "Date": "April 30, 2014"}, {"Title": "it does not work if not charging", "Author": "Eudalis De Artime", "ReviewID": "R3DYC7LWMXXAPI", "Overall": "1.0", "Content": "bough this item I charged it and it was working fine but as soon as that charge ran out, I have not been able to use it with out it being connected to the power outlet", "Date": "April 17, 2014"}, {"Title": "Hidden Jewel", "Author": "Raul Rio", "ReviewID": "R39SSXGZAQYWEL", "Overall": "5.0", "Content": "It is really a matter of personal preference. You could spend $400 or more for a recognize brand tablet that at the end of the day will do exactly the same than this one.If you are a brand-recognition-ultimate-in-technology kind of consumer, do not purchase this tablet. If on the other side, you are a regular user, go ahead by all means. Price is great, resolution is excellent, fast and with many applications. I would definitively recommended.", "Date": "April 1, 2014"}, {"Title": "Don't waste your money.", "Author": "Nitara Deratany", "ReviewID": "R1HDQIFDHLMEYA", "Overall": "2.0", "Content": "Very disappointed with this tablet. It had good reviews so I felt good about purchasing it and was just looking for something simple. It took longer to ship than I expected. Then it would keep shutting down or freezing, and every time I'd boot it back up, all my saved apps and information would be erased! This happened about three or four times in the first month! Once I finally got it to stay on, it was okay. However, the screen quality isn't that clear and even when adjusted, images still look grainy. Also, slow to boot and freezed frequently. I didn't even have that many apps on it yet! Now, after a couple of months of having it I can't get it to turn on even after charging it for the last couple of days via computer and wall outlet. I'm so disappointed with the quality of this product and would highly recommend spending a few more bucks for a better quality tablet.", "Date": "March 21, 2014"}, {"Title": "BIG WASTE OF MONEY!!", "Author": "Rosalind Zidon", "ReviewID": "R3MCDIPKM0N8NZ", "Overall": "1.0", "Content": "I wound never buy from Visual Land again! This tablet is so slow and freezes all the time! I bought one from Amazon and they returned it with no questions asked. I also bought two from Walmart and they won't return them because I had fifteen days after purchase to return them to the store. They were Christmas gift so needless to say my days were up before Christmas was here. Walmart told me I have to go through Visual Land for my return. Visual Lands customer service was very rude, mouthy and hung up on me. Do not buy from Visual Land if you want a product that works and dependable! I will be replacing the Visual Land for Kindles!", "Date": "February 24, 2014"}, {"Title": "Can be Rather Slow", "Author": "Mrs. Wanz", "ReviewID": "R3VYIF9JG3YZO0", "Overall": "3.0", "Content": "I've had this tablet for quite a while now and I have had to do a factory restore on it once, but it's really rather nice, I can go 4-5 days usually without putting it on the charger when all I'm doing is reading e-books. If I play games, get on facebook, or Netflix, I can usually get about 6-8 hours with it. Overall, I am satisfied with what I paid for.Update: After having this tablet for several months now with no real issues all of the sudden it will not power on. I recently had my daughter by c-section and had took it to the hospital with me for something to do. I been using it to read an e-book before I went into surgery and it was fine, then after I had got out of surgery and had rested up a little, I attempted to go back to the book I was reading only to have it not power on for me. It was fully charged before I went into surgery, but I put it on the charger anyways to see, I attempted to push the \"Reset button\" on the back, nothing... Now I don't have my tablet and I have NO CLUE why it just stopped working for NO APPARENT REASON...", "Date": "February 24, 2014"}, {"Title": "Great value", "Author": "Gabrielle Williams \"Novel Goddess\"", "ReviewID": "R19FM19B5A5E7S", "Overall": "4.0", "Content": "Very great value if you bought it in November.  Prices seemed to go WAY up in December.  Made for a great gift!", "Date": "December 27, 2013"}, {"Title": "Order one color..received another", "Author": "Irene I.", "ReviewID": "R3T0Y52ENXBAKR", "Overall": "1.0", "Content": "Ordered for my 4 yearcold birthday.  He loves the color blue... Packing label said blue but tablet is red.  Purchased a blue bumper to conceal.  Was disappointed and freezes a lot.", "Date": "December 15, 2013"}, {"Title": "Good for the value it has.", "Author": "Jonathan Monestel V", "ReviewID": "RFJV523IG53L5", "Overall": "5.0", "Content": "So far is a great tablet. I bought 2 and they are working great.Just keep in mind that this is a low end tablet so it is not as fast as an iPad or Samsung Galaxy Tablet.It works for children to play and use games.", "Date": "December 4, 2013"}, {"Title": "Works for me!", "Author": "Pamela J. Bulger", "ReviewID": "R35ILTYJGQFLZE", "Overall": "4.0", "Content": "I bought this mainly as a means to having a tablet for recipes in the kitchen.  The only problem I had initially was that it did not accept the normal USB interface.  I checked Staples and found a USB to Mini USB cable.  This enables me to connect the tablet to my laptop to download all of the recipes that I have on file.  Works for me just fine.", "Date": "December 3, 2013"}, {"Title": "It's ok.", "Author": "Rachel Peterson", "ReviewID": "R3GZPNFZW6W1KZ", "Overall": "3.0", "Content": "It works fine for the price. Does not run very quickly on the WiFi. They sent the wrong color as well.", "Date": "December 3, 2013"}, {"Title": "Bad Internet connection!", "Author": "Tracie", "ReviewID": "R2X2FMNJXWLNU0", "Overall": "2.0", "Content": "I bought this for a gift for my daughter and we have an issue with it not ever wanting to connect to the Internet.", "Date": "November 30, 2013"}, {"Title": "Great !!", "Author": "Renee", "ReviewID": "R3FY1PIPRR32VM", "Overall": "5.0", "Content": "definitely going to order another! Very nice product was everything it said it would be! Met all expectations!  Love it!!", "Date": "November 14, 2013"}, {"Title": "Awesome Item!!!", "Author": "Lois C.", "ReviewID": "R2X0L9FVBDY8DL", "Overall": "5.0", "Content": "The item was exactly what I expected,arrived on time and my 11 year old can use it with ease. Thank you.", "Date": "November 5, 2013"}, {"Title": "Pretty Slow", "Author": "Evaristo", "ReviewID": "R1ICTCHKXREWPC", "Overall": "2.0", "Content": "The android system for this tablet is very slow, although I get it for my niece and she will have a lot of fun with it, I think it can be a little bit faster.", "Date": "October 2, 2013"}, {"Title": "It's Slow", "Author": "Chaune", "ReviewID": "R3BUODBV6ELDLY", "Overall": "3.0", "Content": "I brought this for my 3yr.s old for her birthday.  It is too slow for her liking.  She is use to playing with the family members smart phones that are much faster.  The first few days it was not working right.  It would freeze up, give messages like 'your phone can not open this file'.  It is what it is worth.", "Date": "September 14, 2013"}, {"Title": "good deal for our use", "Author": "Shannon", "ReviewID": "R19RMNFY56YDTE", "Overall": "5.0", "Content": "perfect size and price to use for a kids tablet experience.  and the google based OS is user friendly!  yay!", "Date": "July 29, 2013"}, {"Title": "Prestige 7L", "Author": "Jean", "ReviewID": "R1LR5ATMS24XDW", "Overall": "1.0", "Content": "Pad stopped working within a day.  Reset the tablet and lost all info already downloaded.  Within another day the touch screen stopped working. Tried to take back to store and they would not accept.  Told me I had to contact manufacture.  Contacted Visual Land and they told me \"since we were not the direct retailer it was purchased from\" they would not do anything.  They included the instructions that I already did to reset it.  I am disappointed in this company who will not stand behind their products.  Do NOT buy!Visual Land Prestige 7L Android 4.0 ICS/8GB/1GHz/7-In Multi-Touch Capacitive Internet Tablet/512 DDR3 RAM/Camera (Black)", "Date": "May 7, 2013"}, {"Title": "Don't Waste Your Money!", "Author": "DG", "ReviewID": "RH5X3FXNBYSHH", "Overall": "1.0", "Content": "This is the worst purchase I have ever made.  It is a piece of junk.  It locks up constantly and refuses to conect to WIFI 90% of the time.  You cannot access anything Google related either.  Buyer beware!", "Date": "January 18, 2013"}, {"Title": "UPDATE!! NOT happy, but it is what it is..", "Author": "S. Kitchens \"Wonder Woman\"", "ReviewID": "R304CKZVC5WXA9", "Overall": "3.0", "Content": "Purchased from Walmart for slightly less. Visual Land Prestige 7L - 7-Inch Tablet with 8GB Memory (Pink)I like the sensitivity of the screen. I mean you touch and it reacts and it's not overly sensitive either. I'm sorry some reviewers have issues with this, it was my biggest fear and I was relieved to find the screen sensitivity seems perfect.My first major annoyance is finding it impossible to shut down any program when you're done using it. Just about all you can do is hit the back arrow and back out of it, but it remains running in the background eating up valuable memory and battery life.My second annoyance is the battery life isn't very good at all, but I'm fairly new to the tablet world and I have no idea if this is normal. If it's normal, it sucks.Last minor annoyance, this baby is thin! I immediately purchased a case to beef it up a bit.Love the clarity. Love the price. Perfect for what I wanted. Hate the issue of not being able to close anything with ease.***UPDATE***Well, after having played with this cutie for about 5 months problems started happening. The unit started having trouble starting up. You'd have to hold the button down for about 20 seconds. Then the games wouldn't load properly and when they did, they wouldn't function normally rendering them unplayable. Also, I wasn't able to load any new games onto the device.The camera doesn't take very good pictures, which is okay since we didn't get this for that purpose. I can't get ANYTHING from GETJAR nor was I able to get anything from GOOGLE to download onto my device. This was a pretty sorry thing since ANDROID is everywhere... just not the Visual Land Presige. I did get a two year warranty and am sending it in. We'll see how long it takes to get it back and if the device is working normally or not. This was a great price and the quality wasn't bad at all, but I do expect it to last longer than 5 or 6 months. We'll see!", "Date": "May 6, 2013"}, {"Title": "Disappointed", "Author": "Stacey Anders", "ReviewID": "R3OKCDZ99QW9DZ", "Overall": "2.0", "Content": "I really hate to post bad reviews, but we did not have a good experience with these tablets.  I bought 2 of these for my kids for Christmas.  I noticed immediately that the battery life was not good at all.  They could only play for a little while before they were completely dead.  My son's quit powering on after 3 days.  My daughter's quit after 5.  I ended up returning them and getting a Kindle HD for my son and a Samsung Galaxy for my daughter.  They are both incredible tablets!  I wish I had just spent a little extra money the first time.  Lesson learned.  You definitely get what you pay for.", "Date": "January 3, 2014"}, {"Title": "DOESNT WORK", "Author": "mellisa gamez", "ReviewID": "R1028588SI62QW", "Overall": "2.0", "Content": "THIS WAS A CHRISTMAS GIFT FOR MY CHILD.OPENED PLUGGED IN MADE SURE WORKED WHEN 1ST ARRIVED.CHRISTMAS MORNING TURNED ON WORKED FINE.THEN IT FROZE WAITED FOR 20 MINS NOTHING SHUT IT OFF WAITED A LITTLE WHILE TURNED IT BACK ON AND GOES TO THE ANDROID SCREEN LIKE ITS LOADING AND THEN DOES NOTHING.HAVE TRIED TO RESET USING THE RESET BUTTON STILL DOES THE SAME THING.THE OTHER ONE I BOUGHT IS WORKING JUST FINE.CANT RETURN BECAUSE ITS PAST THAT TIME.UGH IRRITATED", "Date": "December 26, 2013"}, {"Title": "Glitchy but was good.", "Author": "Emilee", "ReviewID": "R3CXDT2FUZEJYH", "Overall": "3.0", "Content": "When I  first bought this i worked great! Everything was great! for about a month and a couple days.Now,right now I am having a few issues with itit freezes from time to time and stays on the screen where it says \"Andriod\" .There  was also a time when the browser does not work at all.When it use to work great,The pictures file thumbnails u can not see hem but the picture is still there I just wouldn't know which picture i'm viewing cause the preview image does not show.I backed up and reset everything to get it back working properly like before.Now it  is still being lousy and I hope I can get my money back.", "Date": "October 8, 2013"}, {"Title": "No Google play store", "Author": "Marlando Doyle \"Mdiddy\"", "ReviewID": "RPHAFM2TT15WG", "Overall": "1.0", "Content": "unless you have no trust issues with unverified app makers for the price this is great for you, other than not work the money.", "Date": "October 5, 2013"}, {"Title": "Not the best, not the worst, requires patience (gets worse, lowering stars...)", "Author": "tinksbell", "ReviewID": "R3TSKSY3ANOAM5", "Overall": "1.0", "Content": "ADDITION: Does not always connect to Kindle or AppStore for books and apps, very frustrating.Purchased as a first 'real' tablet for my 8 year old. It takes a while to download new programs and can be slow to open & run items.Turning off programs, you need to close individually and remember to do that, unlike on my tablet which allows for multi-closings...My husband sometimes uses it to browse the internet, it can be slow to load pages and it is not easy to zoom in for his larger fingers.Fine for a child with patience, works great with the Amazon App Store. Does not have Google play, but many of the kid apps are in both places, though some are free in the included GetJar app store.Haven't looked to see if there are controls to block things so she doesn't get into the adult content that seems to easy to access, but we limit the WiFi time so she only has time to play the game she wants & not search for other stuff.", "Date": "August 28, 2013"}, {"Title": "You get what you pay for", "Author": "Amber Powell", "ReviewID": "R3IUISMM7P51RF", "Overall": "4.0", "Content": "The tablet I bought was what was delivered. Delivery happened within 48 hours of me ordering it. It has lag but that's to be expected for the processor type. It's basically a giant smart phone without the phone part.", "Date": "August 15, 2013"}, {"Title": "wasted money and time", "Author": "Amazon Customer", "ReviewID": "R3L3PQP23DRN6J", "Overall": "1.0", "Content": "I purchased two of these tablets.  One lasted only 1 month, the other 1` 1/2 months.  This was a very disapointing product.  They simply refused to boot up one day.  My children saved their money for months and were only disapointed.", "Date": "March 6, 2013"}, {"Title": "No power and overheats./No enciende y se sobrecalienta.", "Author": "Miguel", "ReviewID": "R3GHIB7ILUYEG9", "Overall": "1.0", "Content": "I write from Venezuela, this Christmas buy the tablet, I found a good price, now try to connect on and noticed the temperature rises on the back, to the point that the plastic is softened in a sector. also fail to get the headphones in place.  The costs to enforce the guarantee, is too expensive.I think I lost my money.Escribo desde Venezuela, esta navidad compre la tableta, me pareció un buen precio, hoy trato de encender y al conectar  noto que aumenta la temperatura en el lado trasero, hasta un punto que el plástico se ablanda en un sector. también la auriculares no logran entrar en su lugar. El envío para hacer valer la garantía, es demasiado caro.Pienso que perdí mi dinero.", "Date": "January 16, 2013"}, {"Title": "broken speaker, kept shutting off", "Author": "wilburwil", "ReviewID": "RZZ018D9A3MFC", "Overall": "2.0", "Content": "bought two of these, opened first one, turned it on, speaker making horrendous noises, would not stop, opened second one , to gift, checked it out, it just kept turning off on me, returned them both", "Date": "November 22, 2012"}, {"Title": "Death at arrival", "Author": "Kasia", "ReviewID": "R16GHLMZ42WEH8", "Overall": "5.0", "Content": "I purchased this one but never powered up, then I replaced and purchased the VL Prestige 10'  and now I am happy it happen as it is so much better , faster with better screen , I updated the vlouncher with Go Launcher HD and it transfer this tablet to a new fast device, Visual land tablet can use amazon app store as well but are not supported on Goggle Play , Amazon App store have mostly all popular apps you will need to improve your tablet as the original vlauncher suck visually, you can use the last Skype app that works well and other as facebook and youtube on side with many other popular apps , also I changed the browser to Dolphin's free mobile browser that have great features and speed up browsing , little tweaking will make Visual Land tablet a better device and I love it !", "Date": "October 19, 2012"}, {"Title": "Missrouted item: No rating", "Author": "Amazon Customer", "ReviewID": "R8HP0QTDLFZ6A", "Overall": "1.0", "Content": "It never reached me. I never got it, It was missrouted and I an still awaiting compensation. So therefore I am not able to rate it.", "Date": "December 24, 2013"}, {"Title": "Wrong color", "Author": "char k", "ReviewID": "R2ODIIJG3ZRQNS", "Overall": "1.0", "Content": "I ordered one red and one royal blue, ended up with two red ones.  I don't trust them enough to send it back, I'm too afraid of having issues before Christmas.  It will be an easy fix with cases but it is disappointing not getting what you ordered. Pay attention people!", "Date": "November 8, 2013"}, {"Title": "Save your money", "Author": "S. Oliver \"s1oliver69\"", "ReviewID": "R3UJHS3236RWU5", "Overall": "1.0", "Content": "My younger two kids got these for Christmas and we've had nothing but problems from the start. The apps open and then close so you have to restart the device and start over and if you're lucky that might work. The bottom line is I wouldn't pay $5 for two of these so save your money and just buy a Kindle or Nook tablet that really works and will last several years if you don't want to spend ipad money.", "Date": "December 27, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CSKL4AK"}}