{"Reviews": [{"Author": "Vimalkumar Panchal", "ReviewID": "R9Y693QVT1RW2", "Overall": "5.0", "Content": "Great product for the price. Fast connection to wi-fi. Preloaded apps. Fast shipping. Good tablet for kids. Hope will last for few years.", "Title": "FastTouch 9\" Tablet", "Date": "October 16, 2013"}, {"Author": "JOSH L", "ReviewID": "R17ACMYZEL1C0W", "Overall": "5.0", "Content": "Its the perfect size and easy to use, and nice and slim. great for the price, just need to order a leather cover for it now. Very Satisfied", "Title": "Nice", "Date": "August 10, 2013"}, {"Author": "Jesse", "ReviewID": "R1MFEBDXMJT6HC", "Overall": "5.0", "Content": "I order these tablet for my mom, that wanted to get to the scene of androids apps. She is 50 years old. She wanted a tablet with a camera and of course affordable. I saw this tablet and I read great reviews. I order it and the shipment was fast. Box all nice and neat well shipped. Open it up and it worked amazing. Perfect for my mom to use. Not only is good but really affordable. Might order more for Christmas presents. Great tablet guys !!", "Title": "Great Product!", "Date": "October 29, 2013"}, {"Author": "Don", "ReviewID": "RP6K8G6C0RCZ3", "Overall": "3.0", "Content": "The reason I gave it a 3 star is that it is a little slow and the wi fi doesn't pick up very well, you have to be very close with it, all my other devises pick up any were in the house.", "Title": "FastTouch", "Date": "October 2, 2013"}, {"Author": "suzanne m. nelson", "ReviewID": "R3DP2DIMUUFYB0", "Overall": "5.0", "Content": "FastTouch(TM)9xn 9'' Tablet PC by GOOGLE 8GB Android 4.1, ICS, Allwinner A13 Cortex A8, Multi-Touch Capacitive Touch Screen, 8GB Capacity, Built in WiFi, Dual Cameras, G-Sensor, Supports USB 3G, Skype Video Calling & Netflix Movies I will be giving this to my son for Christmas. I played with it and I really like it and I know he will too.", "Title": "Great Tablet for the Price", "Date": "October 18, 2013"}, {"Author": "vic valdez", "ReviewID": "R1E11YDXOKMG3X", "Overall": "1.0", "Content": "And I was so impressed with the price.  But I should have known there was a problem when I realized that \"Fast Touch\" has no website to speak of.  May it rest in peace.", "Title": "Died after 2 months", "Date": "June 10, 2014"}, {"Author": "Michael Battista", "ReviewID": "RUZZ4QRQV44B6", "Overall": "2.0", "Content": "It's okay but not what I expected. It's slow with games and delayed when clicking. Sometimes it randomly closes out of the app you're in and its a pain. The screen quality isn't as good as it states. I really wouldn't recommend this tablet.", "Title": "Its okay...", "Date": "March 23, 2014"}, {"Author": "TaKarra H.", "ReviewID": "R35IAFOL2SZZQX", "Overall": "3.0", "Content": "It will freeze up on you and you will let it die until you can use it again but i got it for my child so its okay for him", "Title": "ITS OKAY", "Date": "March 3, 2014"}, {"Author": "Dawn", "ReviewID": "R3N5U4P4LJ48PJ", "Overall": "2.0", "Content": "When it arrived the shipping box wasn't packed with dunage. So the box that the tablet came in was damaged. When I opened the tablets box and took the tablet out the screen on the tablet was hanging off. I wanted this tablet so I could stay in touch with friends and family after I had my surgery. The company gave me a choice for a refund or exchange. I didn't want to take the chance with an exchange. Wasn't sure if they would fix the one I bought and return it or give me a new one. Will do better research when I decide again to buy a tablet.", "Title": "do your research.....", "Date": "February 5, 2014"}, {"Author": "Wendy grim", "ReviewID": "RT291PY1IS8FT", "Overall": "1.0", "Content": "Runs very slow and on the second day one side of the screen went out. Very disappointed in this product not able to really use it before it went bad", "Title": "Disappointment", "Date": "January 4, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00C2WYWKS", "Features": null, "ImgURL": null, "Name": null}}