{"Reviews": [{"Author": "Josh", "ReviewID": "RQHP0SXDUB207", "Overall": "2.0", "Content": "This tablet is pretty good on paper. As much screen resolution as a normal 12-14\" laptop, a \"decent\" netbook processor, 8 hour battery life, and \"free\" Office 2013 (if you don't already own a copy already and want it, it makes the price of this tablet worthwhile). All the things that \"should\" make for a decent tablet, right? I've been stalking this tablet for months now, and preordered it the very hour it popped up on Amazon, and I finally got it on my doorstep this afternoon. What should have been a blissful after lunch experience suddenly became a headache.DISPLAY:Out-of-box Windows Setup uses the customized Acer \"green\" interface. It was at this point that it became clear that this tablet must sport a TN panel -- the green text looked almost checkered from bad flickering, and what is supposed to be a solid green background was a gradient due to the horrible viewing angles. It was almost black past the 50% point to the right. I had read other Acer tablets use an IPS panel, so I had great expectations. They were horrifically shattered. Not only was this not an IPS panel, but it's the worst TN panel I've owned in over a decade.Acer decided to orient the panel to the portrait experience with the Windows physical button on the bottom. This makes landscape usage of the device look horrid, and only acceptable-looking when cocking your head 10-20 degrees to the right of the screen. Windows desktop is hardly usable at 800px wide in portrait mode, so there is no winning that way either. Increasing to max brightness alleviates some of the viewing angle issue, but that's not always a satisfactory answer.Since your left and right eyes are technically viewing the panel from different angles, they each see different shades of colors for the same pixel due to poor viewing angles. This can give your brain a very disturbing sensation as it just doesn't look normal. You can reduce this issue by increasing the distance to your tablet (as per basic trigonometry, this reduces the viewing angle disparity between your left/right eyes) -- but good luck doing that with an 8\" screen and tiny UI elements.Limited viewing angles are one thing. Grainy text from flickering deep colors is yet another thing. This panel also suffers one last critical flaw: it uses a cheap grainy film below the digitizer. It's so pronounced on white web pages that my eyes get caught looking at the grains while scrolling instead of the text. I've seen some screen protectors make the screen rainbow and grainy, but not quite this bad.DISK:4KB: 4.8MB/s Write, 16.1MB/s Read64KB: 11.2MB/s Write, 64.3MB/s Read1MB: 34.0MB/s Write, 82.3MB/s ReadAnything higher than 1MB transfer size didn't improve the rate. This puts the internal flash storage slower than a typical 5400RPM drive for raw transfer, and seek times were mediocre on average. It's nothing to write home about, and almost all Windows-based tablets in this price range have similarly performing internal flash storage, so this wasn't surprising.WIFI:Weak signal (2-3 bars most of the time) ~10ft from the access point, 1 sheetrock wall in between. None of my other devices have signal drops that bad. File transfer speed from a local NAS from that distance was ~3MB/s.PERFORMANCE:With the Atom Z2760, I knew I was getting less power than my 2010 MacBook Air 11\". I read tons of reviews saying that it's vastly improved and performance is smooth. I won't argue that  a lot of Windows 8 \"Metro\" UI apps work sufficiently fast, as expected. A lot of it works faster than my Nexus 7 or my iPad Mini for similar functions, since the CPU is indeed faster than those. But the appeal of this tablet isn't to run watered-down RT-style apps. It's the ability to run legacy apps, like Office. So I timed some core functions:Boot: 31.3 secondsWord: 16.2 seconds first time, 7.1 seconds second time (cached)Excel: 7.2 seconds (Office framework must have been cached from Word)Visual Studio 2012 Express (WD): 13.2 secondsVisual Studio 2012 Express Web: Creating an MVC4 \"Internet\" Project: 58 seconds; First-time project \"Run\" to page load: 37 secondsNumerically, it's slightly faster than my 2007 Eee's. Compared to recent cheap laptops? Slow. Compared to my primary retina MacBook Pro 15? Dog slow. But that's not the metric by which I'm judging this tablet by, so I'm not going to dock any points for the relatively sluggish CPU. I already knew that before buying this tablet. I just wish that it was a bit faster than this, but what can you expect from this price point? Newer CPU generations have better performance, so we'll see how that improves things in the future, I guess.What DOES bother me, however, is the bluetooth performance. On 3 of my bluetooth keyboards, I can easily out-type how fast the tablet can keep up with the input. And when that happens, the bluetooth keyboards will all repeat characters liiiiiiiiiiiiiiiiiiiiiiike thiisssssssss. I've always wondered if it's my particular keyboards (2 Logitech ones, and an AmazonBasics one) or the host tablet, because I've had it do it on my Nexus and my iPad before, too -- just when the CPU is bogged down. Given how small the tablet is, it's rather hard to be too productive on a tiny on-screen keyboard. It's doable, but I still prefer my bluetooth keyboard.Edit: I just researched it, and apparently, using a Bluetooth mouse in conjunction with the keyboards will cause the repeating to happen, or get worse. I guess I'll have to go buy a micro-USB adapter for this.To wrap it up, this is still a decent tablet, if you must have portable device that can run all your desktop apps. It's slow, but it'll still get the job done in a reasonable amount of time. Patience not included. If your CPU requirements are on the low end, you could definitely get away with hooking up a keyboard+mouse + HDMI display, and make it a portable desktop that you can \"undock\" and take with you lightly. Just make sure you can tolerate bad quality displays, or your eyes will probably be hurting after prolonged use.My particular unit had a speaker issue - sounds like loose cabling or something, but even at 100%, I can only hear faint sounds, along with some serious fuzzy electronic noise. If I plug in headphones, it works perfectly, so I'm guessing it's just a speaker cabling/audio chipset issue. So quality control was really poor overall for this product, in my opinion.Edit: In the end, I couldn't tolerate the display giving me a headache, and the sound issue made for bad usability overall. It went back to Amazon, unfortunately. I wanted it to work out, but there were too many problems.Thanks for reading my review! I hope some of it was useful.", "Title": "Mediocre tablet that could have been great", "Date": "June 24, 2013"}, {"Author": "David Bradshaw", "ReviewID": "R2JOXGY02S2QUA", "Overall": "5.0", "Content": "UPDATE:I have installed Windows 8.1 (went from Preview to full), it was a pain to upgrade [this is not the tablet's problem], it took forever to download and install and it lost numerous settings and apps once the update finally installed.  I got it installed and everything was working fine and the Start button started working and I have full use of snapping apps side by side.  Windows 8.1 added some really nice features so I recommend updating.  A strange thing is that Office was no longer activated after updating, I had to find the product key (Windows/Office that was in the box) and used it to reactive Office [chose use Product Key instead of account].  After that, Office seems happy.  I also had to disable some of the syncing features, since I started finding my laptop settings were showing up on this tablet and the tablet settings were showing up on my laptop, which was annoying.  I disabled the syncing settings option in the Settings [Start menu style settings] and did this to both machines to stop the settings from syncing.I like this tablet.  It is a good size where you can easily take it along with you and hold it in one hand comfortably.  It feels sturdy and solid and does not fill hollow or flimsy like some cheaper items.  Setup is easy with a few questions you have it setup.  I purchased the Protective Case from a local office store (I looked at the keyboard and it is expensive and makes it so much larger that I do not like it, I did get a BlueTooth keyboard for typing and already had a BlueTooth mouse that pairs easily and works well, however, I only use them when I know I will be sitting and can use it like a laptop).  I really like the protective case.  It is like a simple snap on around the edges (does not interfere with pulling in from the edges) and closes like a book, wraps around for holding like a tablet and also allows for it to stand upright at two different angles (depending on where you are using it).I set the device up and removed all the junk that Acer installed (this is the case with any Windows computer you spend the first few hours uninstalling the junk from the manufacture).  I was surprised to see a recovery disk in the packaging since you never see those anymore, but I guess due to storage space they could not have a partition.  Once I got the computer clean of the junkware it had 11 GB free (Windows takes up a lot of space!!!!).  Oddly enough I updated to Windows 8.1 Preview and after that I had around 14GB of space...  The storage space is very small and you will need more.  I use Dropbox (I would like to use Skydrive but it does not support Symbolic Links on Mac) and I used the Desktop version so I can have my files sync with the tablet (so they are on it even when I am not online, like in the Windows app version).  I also have a 32GB SD card that I used for Video, Music, Photos (I changed my User Folder settings to point all of these to the SD card; and my Dropbox's Document folder is set as the Documents folder for my user account).  I will note it is not recommended to have Dropbox use the Removable Media for the folder (it will not let you, but you could trick it using a Symlink) since if you were to remove the SD card Dropbox would think that all of those files have been deleted and would probably remove them from the Dropbox).This unit also included Microsoft Office Home and Student 2013 (Word, Excel, PowerPoint, OneNote) which can be activated by opening the Office Activation and choosing I have a Product Key and entering the Key on the card that was in the box.  After about 15 minutes Office was installed and the programs were in the Start Menu.  They all work nice and it brought over my look and feel from my Office 2013 Professional from my other computer.  Home/Student does not include Outlook (have not used since 2003), Access (not much use on a screen this size), and Publisher (also not much use on this size of screen).  The Office programs work great and saves some money verse buying them separately (they are the full not the annual subscription).The Windows interface is easy to use and when in the Start menu apps is super friendly to touch.  I have a stylus that I use (bought separately) which makes things a tad easier (it works great with your finger, but I just prefer the feel of a Stylus).  Many apps (like Office) take you to desktop mode and I find it pretty easy to use, I do not see much problem using stuff in the desktop mode.  The use is intuitive, you do have to tell it to bring up the keyboard (button on the task bar), but that is simple enough.  The benefit of having a full computer compensates for this in my opinion.When I first got it I tried to use the side by side full screen apps, but could not get them to snap by each other.  Some said this is not possible online due to screen size, however, I found that this feature is in Windows 8.1 (not out yet).  I went ahead and installed Windows 8.1 Preview (free update) which now lets me use side by side and it works great.  I can even side by side Internet Explorer windows to browse two web pages.  You can just drag apps to the right side and than resize using middle bar.  It is super easy and works well.  You can have video playing on one side and check email on the other or any combination.  So far every app I have tried works fine in this mode (Microsoft and high end apps seem to work even better in this mode, since they seem to be smart and change layout when in this to be more productive).  I highly recommend updating to Windows 8.1 Preview (and Windows 8.1 when it is out), it makes this tablet so much better and adds all the Windows features that you see on TV.  I have not had any issue and really love the update.  A few other changes include System Settings app having full power like Control Panel, and improvements to some system apps - the main thing is support for snapping apps side by side on smaller tablets.I have found some annoying things, the Mail app is OK, but not great!  It does not allow me to setup my Google Apps account as Exchange ActiveSync (it blocks with a message when I put in m.google.com as the server, however, I have a Google Apps for Education account which was not part of the end of support for ActiveSync, so it would work if the Mail app would let it go through instead of trying to be smart.  Second I use iCloud and the Mail app does not like syncing (Push works occasionally) the iCloud IMAP settings, it works sometimes than will not find new mail...  Calendar and Contacts will not Sync with iCloud since they only want to deal with Microsoft Services; some support for other clients should be added to support more users.Some more serious issues includes a Sound problem.  Sometimes the sound is great when streaming Slacker or other apps, but sometimes you can barely hear it.  For example listening to Pandora through Internet Explorer sounds like the volume in on 20 (even though it is all on full) and listening to Slacker radio sounds like it is on full blast.  I do not know why some apps and programs are so low sounding and some sound proper. I believe this is an issue with how some Windows apps are handing the drivers for tablets vs full (speculation).  Hopefully this will be fixed soon.  I will note that this does not seem to matter when using Headphones, only the built in speakers (which makes me question the driver issue theory...)The screen is not bad.  It has a nice resolution for a screen this size and is easy to read and and use.  However, it had this pixeled dot look on top of colors and images (like looking through a matted screen protector).  When you look close at the screen (especially white) you will notice these odd pixels that are rainbow colored throughout.  They are not that noticeable, but if you look at screens a lot like I do the smallest problem is noticeable.  It is not bad, but it is noticeable and I wanted to let you know.  The screen also does not have a wide viewing angle.  You do have to look at it straight on or just about 50 degrees either way before the colors start to look off and the glare it too much to see through.  I do not think this is a big problem since a tablet this size you will be looking at straight on.  And will have it no more than 2-3 feet away since the text would be too small to read.The screen's brightness is very good and it is auto bright (which is nice), however, the detector is on the left side and if you are holding your hand on the left side (when holding tablet sideways) you will notice when you move your hand that it will change brightness as your hand goes over it.  It should probably have a timeout or a second light detector at the top (so their is one top landscape and portrait to accommodate people holding on either side).  The screen is easy to see and the brightness is excellent.  I will note that it does have a bad glare so try to avoid having a bright light behind you or you will just see your silhouette on the screen.  Not a big problem, but in really heavy headlight you start to see yourself more than the screen...The app store for Windows is still pretty new and their are not as many apps as you would hope, but since you can use this as a full computer you can always install x86 apps or use web services in Chrome or Internet Explorer.  Their will probably be more apps in the future.  It would be a nice change if support for running Windows Phone apps came to Windows 8 since their is a nice market their, and I would not think it would be difficult since they both are Silverlight based and could run with a small change to the system.The device has a Micro USB and Micro HDMI port.  I have no use for these since I do not have an adapter.  They are cheap and I will get one in the future so I can plug in normal size USB devices and a converter for HDMI.  I think the HDMI would be useful for going to projectors or displays for larger screens, and I think the USB is good for data transfer and plugging in devices for quick use.  I wish they included a full USB and HDMI port for this (or at least an adapter) but I understand the desire to be thin and light over useful (that seems to be a trend in tech right now).  If you ever have to recover you will need to get a USB adapter to plug in a USB DVD drive to run the recovery disk.The battery is great and has a long life.  I cannot say how long since it usually never gets below 80% after a few hours of use, but from what I see it would last the whole day with no problem (depending on how process intensive the task is).I like how it handles locking itself.  I like the ability to use a PIN for a password (the picture is a neat idea, but a picture is too intuitive to what people would probably use, so it is not too secure).  I wish that BitLocker was included (only in Pro) since if the device was stolen you would not have to worry too much about the data on the drive, however, it is not...  I think that an encryption would be nice for Windows 8 tablets, and that would be a nice feature to add (although that is why they want you to go Pro), I looked into upgrading, but the Windows AnyTime upgrade said that I cannot; I have a license for Pro, but I am not sure if I can upgrade the tablet with that license since the license sticker that was included was for Windows 8 SmScrn Touch w/H&S; 2013, so I am not sure what that is (assuming something new for Small Screens with Touch) and if a  Pro upgrade can over that (or if I would lose Office...).  Not worth the risk just for BitLocker.In the end I really like this tablet.  It has a few shortcomings, but in all it is a great tablet.  In my opinion it is the best tablet choice for more productive users on a budget.  The full Windows 8 OS (32bit) is great for making this more than a tablet and more like a full computer.  The 8\" screen makes it easier to hold and carry when you do not want to bring the laptop and it is a great companion when in a meeting or class for presentations (I have an Epson projector and can use Epson's Network Projector for wireless projection from this tablet!)  The screen could be better, and the sound bug needs to be fixed.  I think you would be much happier if you upgrade to Windows 8.1 (preview for now and full when it comes out).  It adds many great features that are expected from Windows tablets.  I hope Microsoft makes its built in apps work better with other services in the future.If you want a tablet for more productive use than playing games than this is for you.  It works great and can run any Windows programs (32bit) or Windows 8 app.  Sometimes you do have to use Desktop mode, but it is not difficult and still works great!  I think the benefit of a full desktop experience with the overlay of the Windows tablet experience is great and gives more productivity than other tablets.  The inclusion of Office Home/Student 2013 is also great and makes this a great buy!  For a more productive on the go user I would recommend this or Surface Pro (although if on a budget this is the choice).I really like this and have learned a lot using it and find that I do like Windows 8 as a tablet (I have it in BootCamp on my Mac, but do not love it for Desktop, I find myself just getting out of the full screen Start and only using it for launching programs).  If you have any questions let me know and I will try to answer them.  And if you want a tablet that is productive and not just for games this is a great choice!!UPDATE:I have noticed a lot of people talking about WiFi. I have used this for a few days and have held it landscape and portrait (I am right handed so the left hand holds while the right hand uses) and have not had any problems. I will note that it does not support 5GHz, but my network broadcasts one channel for 2.4GHz and one for 5Ghz (only 2.4 is detected). I have held it streaming Netflix and Slacker and have not had it go out or anything.  The device has not lost the signal, I do not know if loses some coverage when holding it since most used do not show the taskbar or the wifi indicator in the Right Pull Out menu. I have not had an issue with WiFi, but if I do in the future I will let you know. The only thing I would complain on about holding it with left hand when in landscape mode is that the light sensor is their and it changes when my hand moves and than moves back (screen brightens and dims when moving near the camera area).", "Title": "Great Windows Tablet once you update to 8.1", "Date": "July 28, 2013"}, {"Author": "Glen A. Bartram", "ReviewID": "RSFQ1SN5UPTPW", "Overall": "3.0", "Content": "So I've only had this tablet 2 days. Take what I say with a grain of salt. I'll post more as I come to know it better.The main thing this tablet had going for it currently is price. $280 is a decent deal for ANY tablet, and it will take a heck of a lot of negatives to overcome that. Still, it took me a week of puzzling the bad reviews to pull the trigger on this. My opinion... the bad reviews have perfectly valid points... and I kinda don't care. This tablet brings what I want to the table.So... bad screen... yeah, it's not great... not particularly good either, but it's actually perfectly acceptable. Resolution is actually slightly better than iPad Mini, and it's fine for watching a video on. Viewing angle... actually I didn't see a problem with the right side angle. Left side angle is really bad though. However, really, if you're sitting there watching your tablet at an angle... you're doing it wrong.Speed... No. This is basically a netbook in tablet form. Tablet optimized apps aren't fast, nor are they particularly slow. Anything designed for desktop... now THAT's gonna be slow, and that INCLUDES the free Microsoft Office applications. For me... I start opening it, and I get my coffee. It's not a deal killer, and the fact that Windows 8 apps WILL run is more a blessing than a curse in this case. Some of my key windows apps (Celtx, SketchUp) I am very happy to have available on this tablet, and willing to wait a few ticks to have them. Once they're running, the speed is acceptable.Windows 8... I'm not gonna retread all the negatives that have already been said... but I was surprised how intuitive I found the full Metro experience in tablet form. Left swiping to switch apps is a breeze. Down swipe to close an app... hands down better than Android AND iOS. Honestly... I think it's a gem. A flawed gem, but a gem nevertheless.Here's what did it for me... the split screen. I can open a document, switch to NetFlix, split the screen and stream video while working on a document. No other tablet, save for the Samsung Note series offers this feature, and even the Note will only split screen with certain apps (unless you root your device) And these tablets start $100 above the Iconia.There's more to say about this device, and more I've yet to discover. Unless some fatal flaw emerges, or the speed issues become unbearable, this is definitely a keeper, and may even grow to become my main tablet.Your mileage may vary...UPDATE:So... good news and bad news.... This has gone on to become my favorite tablet. Against all odds, the OS works well in a tablet form factor, and switching apps along with the split screen has made me more productive than on the iPad. There's several flaws, but the benefits and the low price have more than made up for it.Bad news... The pricing for this tablet has been all over the map. I first saw it for $299, bought it for $279, saw it briefly hit $250... and now it has inexplicably shot back up to $329. At that price, and with competing tablets on the horizon from Dell & others, I would advise waiting till these other devices hit and then compare again.", "Title": "Better than I expected", "Date": "August 20, 2013"}, {"Author": "Andy Dopieralski", "ReviewID": "R3LG9ANWRIZ9IH", "Overall": "3.0", "Content": "First and foremost, yes...the screen on this is sub par. It appears to be a TFT with a glass capacitive digitizer over it. The viewing angles are not stellar and it's hard to view in bright settings. The picture is grainy (it feels like you're looking at a GIF image instead of a screen). BUT...the performance on this tablet is pretty awesome and it's a full Windows experience in an 8\" form factor. Also, after a time the screen grinds on you less and less. The initial impression is pretty awful, but after a bit of time with it you get used to it. For my use case, screen is a non-priority. I use this for doing work on the go and to play some casual games, none of which are graphics intensive. I have a Sufrace Pro for my big time graphic work, but the battery life and portability make the Acer my current driver for most of my stuff.Quick Review:Build Quality: ****Display: *1/2Ports: ***Portability: ****1/2Battery: ****Sound: ***Fr. Camera: ***1/2Re. Camera: ***A few things to consider if you pick this up - get rid of the Acer software immediately. It has an outdated set of extensions which slow down Office to a crawl. Don't bother with the 32GB model. There is almost no free space. Jump up to the 64. Also, check on Acer's website as an updated model is apparently coming out fairly soon which addresses the screen issue.", "Title": "The screen is poor, but the experience is good.", "Date": "August 28, 2013"}, {"Author": "Terry LeBlue", "ReviewID": "R1F54QIFYYUMP8", "Overall": "5.0", "Content": "I bought the 64gb version and added a 16gb sim card to keep important info for if it were to crash. I own a service company. I installed quickbooks pro 2012 on this tablet to keep and review customer info while on the road. I use it for web browsing and research also. I watch youtube videos on it. I am not a gamer. If I were a gamer I would buy a gaming computer. This tablet does way more than I could have expected. I bought an Ihome bluetooth mouse for 15 bucks. It works fine. I have no problems with the screen on mine, however, I did not change the default screen settings and I do not sit in front of a computer all day. I use this mostly for work and a little for browsing. I performed a speed test on the internet with a wireless connection of 3mbps and the computer speed was 2.6+-mbps. That is pretty good in my opinion. This tablet is running a true full version of windows 8. I have installed Classic start menu. It works fine. I paid a fair price for a tablet that suits my needs. I have only had it about a month. If you use the tablet all day it will likely last about 8 hours before you have to charge it. If you turn the screen off when you are not using it and only use it periodically it may be days before you need to charge it. That is all I can think of. I am not trying to persuade anybody to buy this tablet or not. I just think you should buy what suits you needs. This review is my experience and does not mean anybody else will see it the same way. You do have the option to bring it back to most stores if you are not satisfied.", "Title": "This is a very good tablet.", "Date": "September 7, 2013"}, {"Author": "Gabriel's Buddy", "ReviewID": "R31CBGH4G11AE", "Overall": "4.0", "Content": "I read several reviews that described this tablet as disappointing, primarily for the screen and processor speed, but also some wifi issues and storage space. These tempered my enthusiasm for the device and when I received it it was fairly clear that the screen was not the best screen to be had, but it certainly was usable and not the horror many had described. After using it for a while I must admit that I really like this tablet both for the form factor and the capabilities.We have a  Lenovo ThinkPad Tablet 2 10.1\" 64GB Win 8 Pro Tablet with Stylus(367927U), an iPad (not retina), and a few Win 8 laptops. Since I've gotten this Acer it has become the device I pick up most often, by far. It is a wonderful size (just like the Nexus 7 and iPad Mini) and runs the full Windows ecosystem. The battery last long enough that I only charge it a few times a week. It is astounding that something so compact is not really a tablet but is, in fact, a fully capable portable computer.Good:- Form factor is easy to hold- Excellent screen size for a tablet- Runs the full windows ecosystem, including the included Microsoft Office suite.- Battery last a decent amount of time- Very easy to use- Allows for separate accounts (my wife and kids have their own accounts on the tablet that sync between the family desktop and this tablet)- The wider margin on the right gives you a solid place to hold the tablet.Bad:- The camera is awful. Both cameras are only 2.1 megapixels and show a great deal of noise in moderate to low light conditions. Outdoor pictures are OK.- There is only about 11 GB of free space on the drive. After installing six accounts and the MS Office suite, this is down to about 6. Apps are usually small, but some can be large. I recommend uninstalling the Encyclopedia Britanica that comes with it as well as any other apps you don't want. You can get 32 GB of storge with the SD card SanDisk Ultra 32 GB MicroSDHC C10/UHS1 Memory Card with Adapter (SDSDQU-032G-AFFP-A) for a reasonable price.- The screen is fine for viewing video and casual use. If you are particular about screens, you might not like this one, but I don't think it is as bad as many are saying. Now that I am using it casually rather than \"reviewing it\", I don't really notice it all that much unless I compare it side by side with another device.Also to note:- The USB port is a micro size, which is non standard. I had to get eForCity USB 2.0 A to Micro B Female / Male Adaptor to connect it to peripherals. There is room for a full sized port, on the outside at least.- It is charged with a round connector, not the micro USB we use for our phones, Kindle, and other tablets. This means yet another cable and wallwart in the drawer.- The headphone and charger jack look the same and are close together. I don't think there is risk of damage, but you have to look each time when plugging in.- I find myself hitting the off button accidentally if I hold it with my right hand.- I uninstalled the Norton products and most of the included Apps. Overall, the unwanted software was minimal.About Storage Space:This 32GB drive really only has about 29GB because of differences between how hardware and software people count bits. The default installation of windows takes up all but about 11GB of this. It is not uncommon for an app to be 1/3 or 1/2 of a GB and pictures/videos can eat up space, so one can use that space quickly. There are several ways this is ameliorated:- There is a slot for a 32GB microSDHC card. Unfortunately this shows up removable storage and Windows doesn't let you easily add folders on the drive to your libraries. However there are ways to do this that can be found quickly on the web. (you create an empty folder on the C: drive anywhere you like. Go into drive manager, find the option to assign a drive letter. But instead of assigning a drive letter, select the option to map the drive to the folder you created. The SD card then shows up as a folder on the C drive.)- Use of cloud storage. It comes with Acer's cloud products, which I uninstalled because the tablet also can use the soon-to-be-renamed SkyDrive from Microsoft. SkyDrive is well integrated into Windows 8 and office. Although it is just 7 GB, it is a handy way to make documents from a desktop or laptop available to you. Office is configured to save, by default, into the SkyDrive.- I have my music on a Win 8 desktop and, using the Microsoft Music App, I enabled cloud matching of my music. All the music that was matched on my desktop is available for streaming through the App on any Windows 8 device to which I am logged in. So I can stream most of my music collection to this tablet without using any storage as long as I have Wifi.I was going to give this 3 stars because of all the shortcomings but I am giving it four because I find I really like using it and it is an amazing price for a full blown computer.", "Title": "Despite its shortcomings, this is now my go-to device", "Date": "August 7, 2013"}, {"Author": "Michael H. Hoepfinger", "ReviewID": "R35A2ATGJ3J3J6", "Overall": "5.0", "Content": "I've had this for a few days now and must say the bad screen hype is overblown. Have used this for about 15 hours and not once have I gotten aggravated at the screen quality. Is it retina? No. Is it totally usable? Absolutely!Also the battery life and performance have been great. Quality and materials are plastic but also top notch.For the money it's a great device to throw in your bag or use on the couch and not worry about.", "Title": "Great tablet with a bad rap....", "Date": "July 14, 2013"}, {"Author": "JPHinAlief", "ReviewID": "R305OPP36CA375", "Overall": "4.0", "Content": "I know most of the professional reviews have panned the display.  I don't use it for photo slideshows and I find the display adequate for my purposes (not great, but adequate).Pros:  Good battery life (8 hours+).  All of my legacy software has worked on it.  Although it has only 1 micro USB port, it correctly recognizes usb extenders, so you can have as many USB ports as you need.  WiFi has worked fine - both home and in restaurants/coffee shops.Cons:  The dual core Atom processor is no speed demon.  Maybe the new generation of Atoms will change this, but the current generation is adequate only for a portable unit where battery life is more important than speed.Overall, I find this a good, lightweight, long-lived battery unit.  It well serves my need for a highly portable windows-based tablet.", "Title": "Meets Expectations", "Date": "August 9, 2013"}, {"Author": "William", "ReviewID": "R1SM2CLK7U43O3", "Overall": "5.0", "Content": "It is great that manufacturers are trying to make 7 and 8 inch tablets work!  Imagine the future where you can have a fully functional desktop in the palm of your hands!  Crysis on an 8 inch table is only 1 or two generations away (AMD Temash processor, whenever they are adopted for this form factor).  Looking at this specific tablet at a store and I was very impressed.  While it won't game (could stream game with remote desktop) I could load Excel and Word which did not feel awkward at all.  Having a viable desktop in my hands with x86 compatibility that didn't weigh 10 pounds is an amazing piece of technology!  If you look closer this form factor is technology breakthrough and will just get better over time.", "Title": "Amazing concept!", "Date": "September 6, 2013"}, {"Author": "Scuro", "ReviewID": "R1151917890QID", "Overall": "4.0", "Content": "Pros:Good speakers. Good battery life. Decent speed. Comes with windows 8 and MS Office. Slot for microSD cards. While its case is all plastic it is solid and doesn't feel cheap to the touch.Cons:Screen has horrible view angle. One of the worst I have seen. Other than the viewing angle the screen doesn't look bad. Could've used a higher resolution too.Other notes:Got this to replace an old laptop. Wanted a tablet that ran with an x86 processor so I could run the usual software I ran on my PC. Processor is fast enough to do any media or basic software. It is not screaming fast so don't expect it to match the same speeds as your PC, but it gets the job done. Out of curiosity I also tried minecraft on this thing. Runs surprisingly well at lower detail settings. You however can't play the game using touchscreen.", "Title": "Decent Windows 8 Tablet for the Price", "Date": "June 28, 2013"}, {"Author": "Alexander Schmidt", "ReviewID": "R1NFVBTTPD9BV5", "Overall": "4.0", "Content": "This tablet seems to be a great all-around tablet for reading, browsing, watching videos and within the attractive 8-inch form factor. I would agree with previous reviewers that it lacks some sharpness and brightness as well as vowing angles compared to the latest IPS panels in other tablets, but if you need familiar desktop environment and you're primary Windows user, this tablet is worth considering at this price range ($300-350).", "Title": "Great all-around tablet for typical day usage", "Date": "August 6, 2013"}, {"Author": "A. Franco", "ReviewID": "R3I17NQY42SGMT", "Overall": "3.0", "Content": "I bought the 32gb version from another retailer for $349.  Had great expectations for it and was hoping it would replace my ipad mini...really wanted to pair it up with my Nokia 920 WP8.  As for performance...IMO, it blew the ipad mini away.  There was no question in my mind. Plus its running full Windows 8.  There are so many advantages to having a pc in such a small form factor.  The acer tablet was noticeably heavier than the mini, but that was a given and not a deal breaker.  Unlike the my ipad mini, I could comfortably hold it in one hand and the added weight didn't really come into play because of the design of the tablet.  So why the 3-stars...the performance and sturdy design of the tablet was the only positive of this unit.  I returned it after one day of using it because the screen was so horrible.  The screen has an obvious \"grainy\" look to it which I can look past as a retina or HD display is not something that I must have.  BUT the viewing angles were absolutely horrible.  I set both tablets next to each other for the comparison and it was disappointing just how bad the screen on this tablet was to my ipad mini (and the mini has received its share of criticism for not being HD).  How Acer could even consider using a screen with such poor quality is simply amazing...here's hoping that Nokia, Samsung, or MS will produce a tablet worth keeping.", "Title": "Great performance...horrible screen", "Date": "July 10, 2013"}, {"Author": "JTL2", "ReviewID": "R2ZPJNBE74RQM5", "Overall": "1.0", "Content": "I wanted a tablet. I needed a laptop. I thought this would do both, but it was mediocre at best. The lack of apps for Windows Metro is appalling, even at this state of Windows 8 development. As a laptop, it was plagued with memory issues. Constantly, I was getting popups that my system was out of memory, and all I had open was an Access Database and a few web pages.Finally, after three weeks of this, the entire system crashed and the tablet refused to boot. I called Acer tech support, and they were unable to diagnose it over the phone. Essentially, I could not get the tablet to boot to BIOS or the recovery. Acer wanted me to send it to them for repair, but want me to pay the shipping and a buy a box (because they didn't want me to send it in the box it arrived in).Instead, I returned it to the store, and the manager at Office Depot was nice enough to give me a return. While it looks like a tempting multi-purpose device, I would not recommend it.", "Title": "Mediocre tablet. Mediocre laptop.", "Date": "September 2, 2013"}, {"Author": "M.D. \"mdoan300\"", "ReviewID": "R2FDYM6RMWXACV", "Overall": "4.0", "Content": "I received the 64GB version at the Microsoft //build/ developer conference and I've spent over a week using it. I also received a 128GB Surface Pro at the conference and I already own a 32GB Surface RT, so my comments may compare the W3 against these tablets. Additionally, I installed Windows 8.1 Preview on all 3 tablets, but this review is on the tablet, and not the OS.What do I like about this tablet?First and foremost, the size of the W3 makes it even more convenient to take with you to places. Add to that, the Atom processor lends itself to running 32-bit Windows 8 and having an 8 hour battery life, which makes the W3 a more powerful and more portable productivity tool over the Surface RT. Like the Surface tablets, a keyboard is absolutely necessary for any type of productivity, and the Acer Bluetooth keyboard accessory is highly recommended. If anything, you can stow the W3 in the backside of the keyboard and protect its display during travel -- that is a nice, thoughtful touch.What do I not like about this tablet?While the display is not as good as the Surface tablets, I'm more bothered by the weak WiFi connectivity; it's very obvious that the W3 was intended for use in portrait mode, especially when WiFi connectivity goes from 4+ bars in portrait to 1-2 bars in landscape.Due to the size and resolution of the display, the Windows Desktop becomes a chore to use effectively. Acer should have included a stylus as Microsoft includes a stylus with the Surface Pro. This tablet is definitely meant to live in the Start Screen.Last, but not least, I find the W3 to run a little hot -- the backside will feel very warm to touch after a while of usage.All-in-all, and I hate to say this, but I like this tablet more than my Surface RT; I would definitely consider this tablet if I was considering a Surface RT. I think it makes a great companion to a Surface Pro or a laptop.", "Title": "A Little Stick of Dynamite", "Date": "July 11, 2013"}, {"Author": "Mark Walker", "ReviewID": "R1XOX00D8NAGC3", "Overall": "5.0", "Content": "I'm a portable computer junkie, I have a Dell XPS Ultrabook, a Surface RT, a Lumina 920 and just bought the W3 the other day. The build quality of the W3 isn't as nice, the plastic case isn't as sleek as the VaporMg Surface or aluminum Ultrabook and the screen isn't as bright. That being said, I've been enjoying it quite a bit.The size and shape of the W3 fits nicely in my hands for reading, typing, or watching video.It runs the FULL version of Windows 8, like the Surface Pro or a laptop or desktop.The W3 also comes with Office, which is a nice bonus.I like the 8 inch size, it's just right for grabbing for a quick look at email or a web site, and is small enough to carry in a smallish purse. The narrow viewing angle is fine as ling as you aren't trying to share with the person next to you (and could be desirable on a bus, plane or train.)I look forward to more 7-8 inch Windows tablets. It is a great size, highly portable and still a \"real\" computer.Christine", "Title": "nice little tablet", "Date": "July 26, 2013"}, {"Author": "Jpetcare", "ReviewID": "R3LV8JTBP7Y9K5", "Overall": "1.0", "Content": "I actually bought this tablet off of eBay with the keyboard, but I feel like this is a good place to leave a review.ProsFastGood battery lifeEasy to useGood for the moneyBuilt really wellBadScreen(More on that later)Others have said that the screen is an issue, while partially true, it should not dissuade you from buying this device. The screen does have poor viewing angles and it does look like there is plastic film over the screen when there is none, but you do get used to it quickly and it does not look bad when you are typing on it from a distance. If you are used to really good displays you will be disanointed, but I really like the device otherwise. The keyboard is great as I am typing this on it right now. I would recommend waiting to see what comes out later in the year, but I bet that nothing will match the price of this tablet.UPDATEDo not buy this thing. Mine almost caught fire! I was in class with it in its dock, I had it plugged in and it was getting hot. Suddenly the screen got splotchy and it smelled like it was burning. I called Acer and after a 2 hour phone discussion I convinced them that I had not damaged it in any way. They sort of fixed it, but removed my serial number so that I could not ever get it fixed again. Save your time and money and go Asus t100. It costs less and comes with a keyboard in the box.", "Title": "READ UPDATE!!!", "Date": "July 8, 2013"}, {"Author": "James Mitchell Parker", "ReviewID": "R2RNJ4WXGPOYQE", "Overall": "1.0", "Content": "I normally never review a product. However, this is the worst electronic purchase I have ever made. The touch screen is useless without the stylus. Almost useless with the stylus. I could go on and on. Slow too.", "Title": "Junk", "Date": "January 14, 2014"}, {"Author": "Stephen D Murray", "ReviewID": "RX4RWLYAKU8RU", "Overall": "5.0", "Content": "I love this tablet. I did not think I would like a windows tablet but needed one for work. I am blown away at how much I love it. Acer did an awesome job. I fits my hand so I can handle it with ease. I have not found any problems. I can print through my office network which saves time. I am so impressed with this Acer Iconia that I bought a second one as a gift.", "Title": "WOW", "Date": "December 20, 2013"}, {"Author": "Aubree W.", "ReviewID": "R9NGEC9Y6MCWT", "Overall": "5.0", "Content": "Does everything that my (much more tech savvy) boyfriend's Surface does on a daily basis - for a quarter of the price.  Works great as a reader or to download and run stats programs in a graduate class.  I just wish it came with a nice pen.  I can't seem to find one... I bought the warranty through Amazon as well.  I've slept like a baby since.", "Title": "Perfect for me.", "Date": "December 4, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1EZBYJFJ28H9Q", "Overall": "5.0", "Content": "Not sure why all the bad reviews.... Its not an ipad, or nexus 7 or galaxy tab , but a full PC in palm of your hands..... Battery life is amazing... Does everything great for me  and I work in IT.If you wants app, blah, blah then look else where  although Microsoft is getting more and more apps, but if you want a full PC with free Office in your palm, then for 299 its a deal... I love it", "Title": "Awesone little PC", "Date": "September 26, 2013"}, {"Author": "geekycomputerguy", "ReviewID": "R3EPK4DPHJWQKY", "Overall": "4.0", "Content": "I have to say,  after using this for a couple of days,  I am impressed by it!  Yes the screen is not the latest and greatest...  BUT its very usable, and honestly I almost never notice any difference.  The fact is that for under 300 dollars I got a nice FULLY FUNCTIONAL WINDOWs 8 tablet.  Its more useful then my Google tablet,  which costs more,  and it runs a real version of Windows 8.I have linked it to a Bluetooth keyboard for real typing of long letters and things but for surfing the net,  using for email and reading my books, as well as reviewing a Word or Excel doc,  its fantastic.  Heck the Windows 8 and Office home license cost almost as much as the tablet if you bought them alone.  Having the Micro SD card slot is great, I can load and install software as well as have music on it, without filling up the drive.  Add a Case and a stand and this is an awesome little tablet for general use.", "Title": "Great Tablet for he price - Screen is not bad!!!", "Date": "September 22, 2013"}, {"Author": "Josh", "ReviewID": "R1GYXD1DHALGUN", "Overall": "5.0", "Content": "I was very happy when i receives this tablet today. Alot of negative reviews, but people put high expectations on a 300$ machine.The screen is not bad. It reminds me of a laptop screen from the '90s. First boot it looked strange, but then it seemed like it warmed up and its a very nice picture.I bought it with the dock and the Micrsoft blue tooth mouse and it paired perfectly.Ive falling in love with Windows 8. I see what Microsoft is going with this. They are betting thag touch screens will be the new thing with computers and has a double interface. Watched a tutorial on u-tube and learned the tips and tricks.Im very happy with this and glad I bought it!", "Title": "perfect for price !", "Date": "September 19, 2013"}, {"Author": "DrSanchez", "ReviewID": "R3ESLLOHNQ5Y5Y", "Overall": "4.0", "Content": "I don`t really use PC`s, but for some tasks, it it perfect and portable.It has more power than expected.", "Title": "perfect for simple tasas", "Date": "September 19, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R29ZJBJQP8SNAQ", "Overall": "5.0", "Content": "When I first saw this tablet on the Amazon page I knew I needed it an wanted it. It is perfect for work and personal use. Light, full office suite included, Windows 8, easy to hold, wireless keyboard and mouse connectivity, great battery time. I am using it every day and I am very happy with it. I do not understand why some bad reviews. Yes, some of the icons are small, so use a mouse (buy a micro cable for the USB) or buy a stylus, no problem. I do not see any problem with the screen quality. Yes, it is not the same quality as my Samsung Galaxy Note II screen, but it still looks good and is of  good quality. And the price is unbelievable. I paid $349.00 for the 64GB version and I thought it was a steal. I have seen it lately on Amazon for $299.00, you could not get a better deal. Look at the new Acer line up. They have spent a lot of money over the past year or so on research and development and they are coming out with some great products. I have been using Acer products for the past three years, so I believe that I have first hand knowledge that they are a world class computer manufacturer with a great product.", "Title": "WHAT A GREAT TABLET. WHAT A GREAT IDEA..", "Date": "September 18, 2013"}, {"Author": "Steven Henry", "ReviewID": "R1M8SWNE8CJV0X", "Overall": "5.0", "Content": "I have had the W3 for three days now. I am completely blown away at what you get for $299. Sure the screen is not as good as other tablets. But if I wanted an excellent screen then I would have paid $200 more. For me the screen is fine. The battery life is excellent. I upgraded to 8.1 and love the ability to have 2 windows open side by side. I have grown to like the OS. I purchased this baby to develop Android applications and write C++ code and TCL scripts. It runs great with the underlying windows 7! I can code whenever or wherever I am. Can your iPad do that?? And having the ability to work on native OFFICE documents is a bonus.I think that all of these industry reviewers are really spoiled and throw a fit if the display isn't perfect or there is a 3 millisecond  delay. For the money this baby can't be beat. If you have been on the fence, jump off right now and join the world of PRODUCTIVITY. IPads are for slackers.", "Title": "The Acer W3 is an extremely good value", "Date": "September 18, 2013"}, {"Author": "Christina Marroquin", "ReviewID": "R2GIZ0PPF3Z9VE", "Overall": "4.0", "Content": "I have had this tablet for 2 days, and i love it.  i did notice complaints about the picture but i bought this for school and not movies so i am not concerned much about it.  it works great for my school.  only complaint is no adobe flash.  My school use it for there online programs so that hampers so things.  i did read online there maybe a way to fix that so i figure it out i will up date this. 2nd is yes it has a usb port, but it still will not be used with a laptop. i will have to transfer my stuff through the microSD card between the two.  otherwise already used it for my calculus class and biology II class and it worked wonderful!", "Title": "good tablet for price", "Date": "September 12, 2013"}, {"Author": "chel rs", "ReviewID": "R1S8GXXXT8A87Y", "Overall": "5.0", "Content": "I have read various reviews about this tablet but mine will be all good. This tablet does what is expected from a tablet in the way of entertainment and videos, news, and social media. However, the fact that it also has the whole Windows 8 system as a feature is what sold me on it. I happen to love the new Windows system and I like all that this tablet offers. I like the fact that I can use it for 8 hours without having to worry about the battery. I also think that the function of the Windows operating system is good and from this point on I will only have a tablet that has the same kind of features. I know that it is not a top of the line tablet but for the price paid and what it does it is worth it! I love this thing and I get so much use out of it and I also find that it is easier to take it to work and keep my laptop at home so that's another benefit. The Office 2013 Home and Student software was a big factor as well in swaying the purchase and from my perspective it doesn't get much better than what this offered me. As I said, it is a good device and does exactly what it says it will do. Each person is different and for that reason it is a good idea to research before buying but for me, personally, it fits the bill and allows me to work and play in an easy format!", "Title": "Does what I expected and more", "Date": "September 2, 2013"}, {"Author": "R. Martin \"coolstreamshopper\"", "ReviewID": "RYZCY0IRBJZGJ", "Overall": "4.0", "Content": "Windows 8 is not a finished product. Others have been very generous with their pros and cons as relates to this device and Windows 8; read as many as you can. But... Windows 8 and an 8 inch tablet or convertible form factor is a great combination. Surfing and reading and working without a separate physical mouse, keyboard or monitor is a very different experience. Moreover, when put into the 8 inch form factor which you can hold in one hand; and maneuver between portrait, landscape and flexible zoom with the other..............this is a good start.You won't be playing high end games or running cpu-intensive software on this particular devise at the moment.  But; reading, viewing, listening, buying, selling, emailing....etc. etc. is much easier.  Be aware, that none of this is possible without a well-designed holder and some large pocket clothing; (the VSTN Multi-Angle Stand Slim-FIT Cover Case for ACER W3-810 and/or the Acer W3 TPU Rubber Shell Skin Cover Case and/or the Portable Fold-Up Stand for 7-10 Inch Tablet PCs and/or the Eagle Creek Pack-It Sac appear to be useful). I also had to determine how to connect to my local network. Wireless routers are less secure so I decided to spring for a Trendnet USB-to-Ethernet adapter and a Startech Micro USB Male to USB A Female adapter. And to complete the monitor or TV docking arrangement, I decided on the HFHF Micro HDMI Male to VGA Female Video Converter adapter, and a Connectland 4 Port USB Mini Hub (all are compatible with windows 8). In addition, I dusted off my wireless keyboard/touchpad; in order to make sure that the docked device could be controlled from a distance. And finally, I discovered that a virtual touchpad was useful in certain instances on the desktop as an excellent substitute when the hardware was not readily available. For under $300 in total, the risk seemed acceptable to me.Overall, this looks and feels like nearly infinite portability, or multi-tasking with multiple devises, i.e. a perfectly Wearable Desktop Computer/TV............. The only thing missing is a reasonably priced ($40 or less), stand-alone wireless MiFi alternative to replace my unlimited wired internet service. Nothing wrong with dreaming.........In the meantime, a secured wireless access point (Trendnet 637-AP) and Walmart's Just Barely On The Go But Better Than Dial-up MiFi will have to suffice.Update: The Windows 8.1 update is a big improvement and makes a good experience even better. In addition, the clean install option saves a lot of space on the hard drive by getting rid of all of the preinstalled Acer software. This is also where the docking arrangement comes in handy and allows this particular update to be made more quickly. With docking you also get a better view of what is going on during installation; and after installation, you can explore some of the new features in a more familiar monitor, mouse, keyboard and local network environment. It is also important, with something this new and inexpensive, to avoid the introduction of any additional security and/or compatibility issues.", "Title": "A Good Start", "Date": "August 18, 2013"}, {"Author": "sped", "ReviewID": "R3LGRBYZEOPEEG", "Overall": "1.0", "Content": "Bought this for my grand daughter for Christmas. It won't turn on and Amazon says it can't be returned because it was purchased in September. This sucks. Guess I should have went to staples. Live and Learn.", "Title": "Christmas gift", "Date": "December 25, 2013"}, {"Author": null, "ReviewID": "R1KPGJXYITJQ4T", "Overall": "2.0", "Content": null, "Title": "Sounds great, but hasn't worked yet...", "Date": "September 10, 2013"}, {"Author": "Vincent Quezada", "ReviewID": "R3Q2USI7AI423C", "Overall": "3.0", "Content": "Are ideal for basic work, but dont come with microusb adapter, The plastic feel cheap, but if you want a tablet with run all your pc programs, this device are perfect!", "Title": "Very basic", "Date": "October 9, 2013"}, {"Author": "Simon", "ReviewID": "RA7253TEV59I5", "Overall": "3.0", "Content": "if you read the other post about the device you will see they pretty accurate. nice form factor, lousy screen resolution. speakers are not so good even for a tablet. windows ...well windows is windows", "Title": "so so", "Date": "October 8, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RC2V533UOTPQV", "Overall": "1.0", "Content": "I was really excited about the possibility of a small windows 8 tablet, but was quickly disappointed. I used this tablet for a two and half weeks before I finally decided to return it.My problems with it:1)When the screen is turned off, then you plug it in, and turn the screen on, about 50% of the pixels change to their inverse color. You have to unplug, turn it off, then try again. Sometimes, the picture would go back to normal but I usually had to do full restart.2)It would crash at least once a day.3)The battery- It sucks the battery dry quicker than you could even imagine. I couldn't even read a textbook chapter online without having to plug it in.4)The screen- I read the reviews, and saw that people commented that the quality was low, and I thought that I could live with it. IT IS BAD!! The viewing angle is so poor in landscape mode that I actually had to tip it to the right in order to see everything in \"perfect\" color. Straight on viewing was disfigured and would give me a headache.5)It gets really, really hot very quickly.The only positive experience I had with it is that Amazon was phenomenal when I wanted to return it.", "Title": "Had to return it", "Date": "September 29, 2013"}, {"Author": "curiousitd", "ReviewID": "R1JPWX0OUSNMR1", "Overall": "3.0", "Content": "I ordered the Acer Iconia W3 810 (Silver).  I received an Acer Iconia W3 810 (WHITE).  I really wanted silver.  But it is not worthwhile to me to return it for the cover.The setup instructions are sketchy.  There are no instructions re how to find the preloaded Office Home and Student 2013.  The Office 365 Trial is easily found, however.  Before you can use the tablet you have to condition the battery by charging it to 100% and draining it to 100% three times.  This takes a few days.  I am having trouble with the Internet connection with the Acer even when I have no trouble connecting with my notebook.  The Acer says no connections are available when connections are available and working with the Notebook.  I am still working on this problem and will update the review if anything changes.Acer does not provide telephone support that I can find.  Chat is available, however and prompt.9/16/2013 -I still do not know why the Acer said no connections area available when I have no trouble connecting to my notebook, but I have not experienced that in a couple of days.", "Title": "Not Sure Yet", "Date": "September 16, 2013"}, {"Author": "faeriemyst", "ReviewID": "R3GA2MDZ7KOO6P", "Overall": "4.0", "Content": "First off, I have never even touched a tablet before this one, so I doubt my review will help anyone other than newbies such as myself. Feel free to skip this review if you're a tablet expert.I've found the tablet fairly user-friendly and simple to figure out what is what. I like the fact that it is essentially a computer in tablet form with the feature of Windows 8, but also has the apps side too. The apps are easy to move, organize, or delete, and most can change be re-sized into either a square or rectangle. Speaking of the apps, the store leaves a lot to be desired and it's difficult searching for what you're looking for, if they even provide it. The screen isn't the clearest and I'm not sure if I have the updated one or not (I'd guess it's the older, worse screen), but it's fine for my usage. At a weight of about one pound, it's pretty hefty to use for long periods of time, unless it's resting on something, but otherwise it feels substantial and is relatively attractive.Even though it claims to be 32 GB, all but 2 GB is taken up by already installed programs and apps, though there is a slot for a micro SD card. Included is a cord to charge it and the tablet has ports for both HDMI and mini usb, headphone or speaker jack. I've used Bluetooth speakers with it and have had no troubles after figuring out I had to go the desktop first. The battery is good and while adjusting the screen's brightness would help it last longer, the lower settings are simply too dark for my eyes.Unfortunately, I had the opportunity to use the recovery disk Acer provides (whether it was the Acer or myself to blame, I can't be sure), which meant I needed to have on hand an external DVD drive, a micro USB adapter, and a hub (none of which I had. They also said to have a USB keyboard but it wasn't necessary). It seemed to have worked, but the disk didn't start like Acer said it would, which might have had to do with the DVD drive, and there were no instructions to go through and I couldn't find anything to start the recovery up, so I'll probably take it to a computer repair store to make sure everything is working properly.Overall, it's been a mostly pleasant experience, and besides the one major trouble I ran into, it's been a handy little device to have around. At $300 or so dollars, it's a decent deal for what it provides.", "Title": "Simple, with many helpful features that's a good choice for those new to the world of tablets", "Date": "September 13, 2013"}, {"Author": "W. James", "ReviewID": "R2U4B8G2VUOLAV", "Overall": "2.0", "Content": "I like this tablet. Cheaper than a laptop. Has 32GB but most of it is taken up by the operating system and the preinstalled apps. The screen when viewed from the side is not readable. This may help you maintain privacy when on a plane or bus.This has mini USB and HDMI ports. Also has micro SD slot and headphone jack. Comes with a charger. It doesn't charge from USB. Would get five stars if it did.Not a big fan of windows 8 but I am starting to like it.Has front and rear facing cameras. Touch screen is responsive.Battery life is good. A Bluetooth keyboard and mouse you may want to invest in if you prefer a laptop or PC experience.If you need a lot of drive space you may prefer to get the 64GB model.I did not order through Amazon but wish I did. I would have spent less money.Small and portable. Worth taking a chance on if you haven't tried windows 8 yet. If you like tablets as much as I do you may like this one.Update... The tablet quit working on the internet after three days. I don't know if it was something I accidentally may have done. The device came with a recovery CD that I was going to try. Didn't have a cable to connect my drive. Took back to place of purchase for exchange. Didn't have in stock but they had an open box return. I said I would give it a try. Wouldn't move past windows license screen. Will return tomorrow and have them order a new one for me.I started out liking the tablet. I hope to get my issue resolved. I will give it one more try. If you do decide to buy one order a micro USB to USB adapter, one that you can connect an external drive or flash drive to. They are available on Amazon and it is needed to utilize the recovery disc.This device has gotten some good reviews and I plan to update this one if I get my concern resolved.", "Title": "I like it/did like it", "Date": "September 7, 2013"}, {"Author": "meryl", "ReviewID": "R2HDHCVJTBF7B9", "Overall": "1.0", "Content": "Worst purchase ever!!!!  Purchased it for my very responsible teen to use at school.  Within a month, it failed to turn on reliably.  Replaced it through warranty, and within 60 days the second one started failing to turn on, and started shutting off unpredictably in the middle of use.  My son's school routine has been disrupted twice while we have had to wait for a replacement.  If I could give this flimsy thing a negative star rating, I would.", "Title": "Worst purchase ever!", "Date": "December 9, 2013"}, {"Author": "DaveA", "ReviewID": "R3VT9AQPEP7SGS", "Overall": "1.0", "Content": "WARNING: This tablet does not charge through the mini-USB. It's a proprietary charging cable. Not only is it incompatible with 100% of my other devices, it's also a terrible design.Why...WHY?! That alone makes this a horrible choice. I'm sick of companies ignoring standards and forcing me to carry a dozen different charging devices.I did not buy this from Amazon, work gave it as a Christmas gift. It's going right back to the store. I would have kept it and dumped the horrible Windows 8 for an Andriod OS, but with this charger...no, just no.", "Title": "Skip this tablet.", "Date": "December 7, 2013"}, {"Author": "Ricky", "ReviewID": "RNL2ABTZ5T4B1", "Overall": "1.0", "Content": "The first Acer Iconia I received had hardware boot problems where it would go into sleep mode and never power on again.  I needed to reset it by playing with the hardware reset button. The machine would not boot unless I did a hardware reset. After the 4th or 5th time, the machine would not power on at all, even after I charged it for well over 12 hours.The second Acer Iconia I received had a corrupted Windows installation. As soon as I booted up the machine the first time I got an Automatic Repair Failed message. I did some troubleshooting, tried booting into safe mode, and it would not boot to Windows. Instead of re-installing Windows and taking my chances with possibly another defective product, I decided to return it and get a refund.I cannot recommend this product. Caveat emptor with this product. I've lost time and money with this product. I only wanted a tablet so I could take practice tests and watch training videos to prepare for my certification tests. Now I'm back in the market looking for something functional that works while trying to keep my testing dead line. SKIP THIS PRODUCT AND GO FOR ANOTHER TABLET OR LAPTOP. The extra money you spend will be well worth it.", "Title": "You get what you pay for, which isn't much", "Date": "September 26, 2013"}, {"Author": "Gadgester \"No Time, No Money\"", "ReviewID": "R1HLMXHDU80MGC", "Overall": "3.0", "Content": "I played with a W3 at a local Office Max store extensively, before deciding to buy it. They were out of stock at Office Max, so I bought mine from... where else? amazon.com.To be honest, I'm eagerly awaiting Toshiba's release of their Encore 8-incher in November. From everything I've read, it's going to be the small Windows 8 tablet everyone wants (except, initially, they'll only release a 32GB model stateside) -- and the Encore will come with Windows 8.1 installed and Skype-certified.  Until then, I try to have fun with my W3.I bought the W3 actually for both work and pleasure.  Work-wise, I use Word, Excel and Powerpoint a lot.  (I'm a public-servant educator.)  The fact that the W3 comes with free Office 2013 is just great.  Also, I love the fact it's so lightweight (and the Toshiba Encore will be just a hair lighter, even though it'll come with a top-notch screen, unlike the W3), and I can hold it in one hand while teaching.  The touch screen is sensitive enough to be a pleasure to use.  Pleasure-wise, I enjoy watching streaming videos via the built-in Video app, and I can install VLC Player to play everything.  This is, after all, a real Intel-equipped PC.Now, the screen is really as bad as most negative reviews have said.  In store, I didn't feel it was that bad, even though it was obviously too grainy.  But I thought I could handle it.  Now that I actually own one, I have to say the screen really disappoints.  Because the pixel density is high for such a small screen, the graininess really makes the overall experience less than satisfying.  Actually, watching video is not too bad as long as you don't tilt your ahead away from the center.  But working in Word and Excel can get tiring quickly.Luckily, you can hook this up to an external monitor via the included micro-HDMI port -- the same kind of port as the Surface RT.  I already got a few micro-HDMI cables.Another flaw is the WiFi function.  Either due to shoddy hardware or shoddy software driver (I have a Toshiba ultrabook that came with buggy Intel WiFi software that had to be updated later before WiFi would work properly -- apparently a lot of Intel's WiFi drivers have serious bugs), the W3 really has to be just a few feet away to connect and maintain the connection.  I use a WiFi repeater in my house, so it's not as much of a problem, but given my Nokia Lumia 920 phone can connect to my original AP across the street from my house, one can understand the poor quality of the Wifi on the W3.Yet another annoyance it the W3 comes with tons of crapware.  Out of the box, the 64GB model has 32.5GB available.  Of course, you can extend the memory with a microSD card.If you're looking for a small Windows 8 tablet, I highly recommend you wait for the Toshiba Encore, which is slated to release in November and should be available here on amazon.com as well as on Toshiba Direct and at Best Buy.  Its screen alone is worth the wait,  plus its MSRP is even lower than the 32GB W3's MSRP.  Of course, if you're like me and can't wait, try the W3 and maybe later we can all sell it on eBay, or give it to the kids to trash.", "Title": "My temporary solution until Toshiba Encore arrives", "Date": "September 10, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00CM1BN5Q", "Features": null, "ImgURL": null, "Name": null}}