{"Reviews": [{"Title": "GREAT!!!", "Author": "MARCIA", "ReviewID": "RT3MJ2Y2YG5YD", "Overall": "5.0", "Content": "It works fine, they sent me quickly, I'm satisfied customer.The product is the same as the picture.Thank you very much!!!", "Date": "May 29, 2013"}, {"Title": "bought 5 for Christmas", "Author": "Jacqlyn Haddock", "ReviewID": "RMGFXU4DZ96H1", "Overall": "3.0", "Content": "I bought 5 of these tablets for my kids for christmas... one of them locked up on android screen three weeks ago and we havent been able to get it to do anything i have turned it off, pushed reset button n let it stay off for a week but ywt still just goes to android screen. The others seem to be good just 2 of them r really slow from minute they got them", "Date": "February 13, 2014"}, {"Title": "suprised", "Author": "tina wisdom", "ReviewID": "R1SR9BNHOFEK1T", "Overall": "4.0", "Content": "the price was excellent the tablet great quality and the graphics and usage is excellent my daughter loves it thanks for sending a good product.", "Date": "January 9, 2014"}, {"Title": "wak", "Author": "erica posey", "ReviewID": "R2YZI21L7EFOUL", "Overall": "1.0", "Content": "This sh... Is wak freezes up bad not good for the money bullish.. I gave this to my daughter for Xmas so... Mad", "Date": "December 26, 2013"}, {"Title": "horrible", "Author": "cool game", "ReviewID": "RQJDMFWFRKI6J", "Overall": "1.0", "Content": "the worst tablet you can ever buy it may sound good for the price the screen is not made out of glass like etc i pad kindle and most smart phones but when i got it the screen feels like a pc screen and yes its very easy to crack i had an hour of fun on it till it crack when i put the screen protecter", "Date": "December 7, 2013"}, {"Title": "I don't like it", "Author": "SHAK", "ReviewID": "R2WWNIUIDSOGDD", "Overall": "1.0", "Content": "I am thinking about returning this tablet, it run so slowly and view is so dark i bougth it has a gift for my sister as i know her, she won like it.... So will return it....l", "Date": "December 3, 2013"}, {"Title": "afunta", "Author": "kelly", "ReviewID": "R2QAW0TZ4JAIS6", "Overall": "2.0", "Content": "I wasnt the happiest when i recived my tablet at first it was fine then i noticed most of my apps i downloaded would always forclose on me. The camera wasnt great and the charge didnt hold long needless to say i returned it and am looking for something a little more expensive so this doesnt happen again", "Date": "September 30, 2013"}, {"Title": "Charger don't work", "Author": "Dale Sewell", "ReviewID": "R3IT8IJ4MXZ6NG", "Overall": "2.0", "Content": "I am so appointed, the charger wont work and when i try to charge with usb it only charge for about %10 so maybe there is a battery problem as well", "Date": "September 7, 2013"}, {"Title": "Android 4.0 Tablet", "Author": "Evad Nee \"Evadney\"", "ReviewID": "R1CPNIX7XBXKM2", "Overall": "3.0", "Content": "I love the way it looks and the delivery from Amazon was right on schedule. After getting it in hand I realized that it was smaller than I expected and the  actual screen was only roughly about 8\" by 4\" which I consider very small. I was not pleased with the size, because I made a mistake and should have ordered a laptop on desktop computer.I guess if you really think about what you want to use it for and what is the purpose of a tablet it would be great if that's what you really want.", "Date": "August 30, 2013"}, {"Title": "great buy", "Author": "Amanda j.", "ReviewID": "R24Y62LL8NL415", "Overall": "4.0", "Content": "everything works perfectly and as described, battery life usnt the greatest. love it, goes everywhere with me. cant go wrong  with this one!", "Date": "August 13, 2013"}], "ProductInfo": {"Price": "$79.90", "Features": "9.2\" multi-touch Capacitive screen, 800x480 pixel\nAndroid 4.0.4 Ice Cream Sandwich, Camera\nCortex A8 at 1.5GHz\n512MB RAM, 8GB storage\nSkype video chat, HD games ,Netflix Movies", "Name": "Afunta(tm) 9.2'' Google Android 4.0 512mb/8gb Tablet Dual Camera Capacitive Multiple Touch Screen G-sensor A13 Tablet, 3d Games Skype Video Calling, Netflix Movies (Dual Camera, White)", "ImgURL": "http://ecx.images-amazon.com/images/I/51qL6SdzjgL._SX300_.jpg", "ProductID": "B00C977SL6"}}