{"Reviews": [{"Author": "tunafish", "ReviewID": "R2GMYMCNYTED1H", "Overall": "1.0", "Content": "It stopped picking up my wireless signal after just a few days and had to return it.It would drop the signal for no reason while in the middle of a movie or whatnot.All of my other wireless devices were working fine, but the Kindle just kept saying my router was out of range.I called Kindle tech support but they didn't have a clue what they were talking about.They were obviously just reading off of a script and had no real technical knowledge.This seems to be a common issue based on other reviews. Overall, a VERY frustrating experience.Based on this and the fact that Amazon now charges taxes in my state, I don't think I will renew my primemembership and go back to buying in regular stores.", "Title": "Wish I had something better to say", "Date": "November 17, 2013"}, {"Author": "eddiebauer24", "ReviewID": "R3DSY8BNQHPOPK", "Overall": "4.0", "Content": "I would give this a 5 star rating if it wasn't for the problems I have had with getting Skype to work.  So a little background on me, I work internationally and bought three KF HDX 7\" for my three daughters.  One of the main reasons I got them the tablets is so that they can Skype with me while I am out of the country.After an hour of troubleshooting with the tech rep (which was probably the fastest response I have ever gotten from technical support), we were able to get Skype going in the parental section of the tablets.  However the plan for me is that the kids will never be in that section of the tablet.  I have subscribed to the Kindle FreeTime App and this is the only additional app that I have added to this section.Another two hours with another tech rep, and I am still not able to use Skype while in the FreeTime mode.  Currently the problem is being escalated up to another level of tech support.  This very issue is common on all three Kindles that are sitting in front of me.Other than this one issue, I would have to give the tablet a clear 5 star as it is as described by Amazon.  And with tech support like they are offering, the other tablet manufacturers had better watch and learn.Edit:  Got a call from Amazon Customer care and it seem that their engineers are aware that Skype is one of the Apps that conflicts with the settings of the FreeTime environment and as such causes the App to crash.  There is supposed to be a fix being worked on here in the near future and released for wide distribution.  In the mean time I guess I will just keep to skyping on the PC.  Peace and Bacon Grease!!!", "Title": "Small software glitch found with Skype and Kindle FreeTime.", "Date": "December 12, 2013"}, {"Author": "BW", "ReviewID": "R3RNX9T9Q4CDCO", "Overall": "5.0", "Content": "I recently upgraded to the HDX from the HD. I was reluctant to order because of the blue haze issue reported in other posts but decided to trust Amazon's explanation and order one. My new HDX does have a little blue haze around the edges but to tell you the truth I may not have noticed if I had not already known to look for it. I like the easy access to all of the controls (power and speaker volume), the lighter weight and smaller size and the smoother operation of the device. Web pages display faster and I actually think the speaker volume and audio quality is better than the fire HD. Glad I upgraded.", "Title": "No regrets", "Date": "November 2, 2013"}, {"Author": "Lauren", "ReviewID": "RJP6U97N8ABF7", "Overall": "5.0", "Content": "Yeah, totally geeked out on this one.I bought this for an upcoming trip. I have an e-reader and a laptop. I try to avoid travelling internationally with my laptop. So far I really like this. Only downside, not a whole lot of Google apps (gmail and G+). I realize Google has their own tablet, but still, these basic apps should be available.Very user friendly - I would dare say my grandmother could probably use this.", "Title": "Geek", "Date": "December 15, 2013"}, {"Author": "Webmaestro", "ReviewID": "RS4DU2UZX6BFH", "Overall": "4.0", "Content": "Killer deal, great performance and screen. I didn't realize that there is no way to get more memory via a card slot or something before I bought it. Evidently 16GB won't hold a hi-def movie so I'll have to use a streaming service or download 720P content instead. It is easy to move stuff between the computer and Kindle via USB however. It's a huge improvement over my 1st Gen. Kindle Fire.", "Title": "Killer Deal - Great Performance - No Memory Expansion Though.", "Date": "December 12, 2013"}, {"Author": "Mary E Pavlina", "ReviewID": "R39VMLXOVBDEKG", "Overall": "5.0", "Content": "I absolutely love it!!  Light weight.  Picture's great.  64gig.  What better?  I even learned how to work the origami case!", "Title": "Love my HDX", "Date": "December 9, 2013"}, {"Author": "Andy Schumacher", "ReviewID": "R3RY55FEQ7RQZH", "Overall": "4.0", "Content": "Touch sensitivity is a little lacking compared to an iPad.  Great device overall for the price.  Would definitely recommend if price conscious compared to an iPad.", "Title": "Great alternative to an iPad", "Date": "December 9, 2013"}, {"Author": "Joe Tee", "ReviewID": "R2PLV0IEEGQFIW", "Overall": "5.0", "Content": "This is brand-new to me - supposed to be a Christmas gift, but I've been getting acquainted with it a little early.  Very fast despite its small size and so much it can do - I'm just learning.", "Title": "Kindle Fire HDX - WOW!", "Date": "December 8, 2013"}, {"Author": "S. M. Panella", "ReviewID": "R1FWOHGQRL8HK2", "Overall": "4.0", "Content": "I was not sure how to rate this product, on just technological amazement, for me it is a 5 star, but then I have not had a touch screen anything until now. I am a relative Luddite compared to most reviewers. So, the utility to me for listening to music, reading articles and books, and getting information from the internet it is excellent. The review lacking that one more star is because the device is somewhat a standalone device with respect to my TV, stereo, and laptop. There is no communication without hooking up a cable. I'm sure I could get copious guidance that if I downloaded some app or service or buy another communication device then I'd be set, but then that is not just the Kindle that I'd be reviewing. So, still, the Kindle is a wonderful purchase and could have been featured by Walter Cronkite as a wonder of the 21st century in that futurist program from the 60's I used to watch as a kid.", "Title": "Wonderful, Useful Technology", "Date": "December 8, 2013"}, {"Author": "W. Adams \"book girl\"", "ReviewID": "RRUR2VUHYTOBQ", "Overall": "5.0", "Content": "Much better than my original kindle fire. I don't even use my Ipad anymore. Worth it for the mayday feature alone.", "Title": "Love it", "Date": "December 8, 2013"}, {"Author": "Lynn Morse", "ReviewID": "R3RR9QVO7B8LRJ", "Overall": "5.0", "Content": "I love my new Kindle HDX.I wish I had gotten the 4GE added on,but it is perfect to carry with me,instead of my laptop, since youconnect to wireless just aboutanywhere.", "Title": "I highly recommend this product.", "Date": "December 8, 2013"}, {"Author": "Carol Joy Hartley", "ReviewID": "R7CU5MM9JTFBO", "Overall": "5.0", "Content": "Wow I'm so impressed with this device.  I also have an ipad 2 and a ipad mini.  The display on this device is gorgeous and very user friendly.  As soon as I turned it on it was ready to go.  I watched a couple of episodes of Alpha House and it was the easiest thing in the world to go to videos and select.  It was instantly there for me to watch and enjoy.  The sound was fantastic and I only had the volume at 1/2 which was plenty loud.  I decided to go with the 30 day free trial of amazon prime and I'll be keeping that since I love the instant streaming and selection.  I also have a paperwhite kindle and was reading a book (Sycamore Row) and went and checked it out on the kindle fire and it was perfectly synced with no problems and no effort on my part.  I also loaded Words with Friends which I was playing on my mini ipad and that synced up with ease.  I couldn't resist the mayday button and I had a question which was responded to and answered by a very pleasant gal quickly.  That's enough to make me love it more since I hate voice mail and pushing a zillion buttons to get to customer service.  I've downloaded some music and everything I already had loaded in the cloud was available for me to snatch and use.  I'm so happy with my purchase and think it's worth every penny I spent on it.  I did get the 16gb with the ads (which don't bother me at all).  This is the first amazon device I've purchased that I've not opted out and paid not to have ads.  The camera isn't an issue since I don't plan on using this for taking pictures since I have other devices to do that with.  Even if you have an ipad this is a great device to have.  Much easier at least for me to incorporate videos and the sound is so much better without having to use head phones.I'm happy, happy.... beautiful color, fabulous for watching video & fantastic audio sound.  Love my Kindle fire hdx & the origami case I purchased to go with it!", "Title": "Amazon scores a touchdown with this one!", "Date": "December 5, 2013"}, {"Author": "Frank", "ReviewID": "R3KC7B5DOV58ZR", "Overall": "5.0", "Content": "I love it, and I highly recommend it. I love the fact that it ill read your kindle books for you so you can just relax and listen. God bless.", "Title": "Perfect tablet, I love it", "Date": "December 5, 2013"}, {"Author": "Rick", "ReviewID": "RKLBDR1Y6EQLQ", "Overall": "5.0", "Content": "I LOVE MY NEW KINDLE FIRE HDX. It works great and the help from a live person that you can see is astounding. I have used the HELP line a dozen times and they are there within 15 seconds everytime.They will solve your problem for you or help you learn how. This ONE function alone makes this Kindle worth it, but its impressive in many other ways that I could share with you, but am too busy playing with it to talk to you about them!!!", "Title": "The BEST KINDLE YET!!!", "Date": "November 24, 2013"}, {"Author": "Sarah", "ReviewID": "R1ZDUOVORAD1MT", "Overall": "5.0", "Content": "I had a nook before, and the kindle fire HDX is infinitely better! The biggest difference I find to be most important is the fact that soooo many more apps are available with the kindle than there were with the nook.  Well done Amazon!", "Title": "love it!!!", "Date": "November 24, 2013"}, {"Author": "Rando 1", "ReviewID": "R1EK3LJEXT50ZO", "Overall": "5.0", "Content": "The Kindle Fire HDX has everything that I wanted in a small tablet . It's fast , the display is stunning and with my prime membership , I not only get free shipping on purchases , but access to thousands of free apps , games , videos , books and a whole lot more . I am very happy with this purchase and at least two of my friends are getting one now . Great job Amazon !", "Title": "The Kindle Fire HDX Rocks !", "Date": "November 24, 2013"}, {"Author": "Donald Manguso \"Retired Guy\"", "ReviewID": "R1VE2H3PCV4LDA", "Overall": "5.0", "Content": "MY Fire HDX is absolutely amazing and the May day is complete game changer. All of my friends and family are blown away by the display first off and just continue to be more impressed as they get further into it's features. Everybody is impressed by the sound of the music and the quality of the colors in the display. I had the opportunity to use the May day button when my wife had a problem with a game she purchased on her kindle (she made me buy her an HDX after she saw mine), anyway she purchased a game for the grandchildren to play but it failed to show up in our library so she pressed the May day button. A representative came on well within the 15 second goal. After about a minute n Ute of discussing the problem the internet at my house flickered off for just a minute and cut us off. What then happened next is why I am an absolutely loyal customer. Before I could even get my Kindle reconnected my phone rang and it was another rep calling to finish helping with my problem and then when the device finished reconnecting the original rep came back on the device to also help me. Needless to say we got the situation solved to my complete satisfaction, amazing customer  service. One other feature that we really like is the ability to download movies from Amazon Prime and take them with us when we travel to our house in the mountains. I really can't say enough about this device, there are many more features I could praise but I think you get the point I LOVE MY KINDLE HDX.", "Title": "I'm very impressed!", "Date": "November 24, 2013"}, {"Author": "robeliot", "ReviewID": "R9860RBRIAHW4", "Overall": "5.0", "Content": "The Kindle Fire HDX is awesome (so far). I've been using mine for a little over a week. It is a great replacement for my old Kindle Fire. I've read in the Kindle Forum that some people have had a problem with 'blue fringe' on the screen edges.  I noticed it when I first started using it but I don't notice it anymore unless I specifically look for it. Typically I read books with black background and white text. I have an iPad 3 with Retina display, too, that I am also happy with but for reading I definitely prefer the Kindle.Pros:01. It is very light and thin.02. Awesome display. The display is very crisp. It's very easy to read books, magazines and movies look as good as they do on my HD TV.03. The home page and Carousel are much improved. The home page area below the Carousel took a little getting used to but I like it now.04. The new options in the App Store, Book Store, Music Store, etc.05. Much easier to add items, such as books or apps, to wish lists.06. Silk Browser. Didn't like it on my old Kindle Fire but it's much improved on the Fire HDX, imho.07. I like the book recommendations displayed under the books in the Carousel. They aren't obtrusive.08. The new Shop tab.09. The (new) native calendar app.10. The improved native email and contacts apps which can be synched with my Google account.11. Mayday! I've used it a couple of times and it is easy and convenient.12. The physical volume rocker control.13. The charging port is much tighter than on my previous Kindle Fire.14. Being able to display the battery percentage with out an app.15. The camera is pretty cool. Don't see myself using it much, if at all, but it's cool that it's there.Cons:01. Even with a cover it is sometimes difficult to hold for long periods of time. I have arthritis in both hands so that may only be a problem for me.02. It is occasionally glitchy. I've had to do a hard reboot a couple of times. Hopefully today's update will take care of that.03. The Amazon App store. I realize this isn't a 'con' of the Kindle Fire HDX but wanted to add that in my review. The Google Play Store (for my phone) and ITunes (for my iPad) have much more to offer.If I think of, or encounter, any other cons I will add them to my review.My Kindle received the latest update today and it added some cool upgrades. The new lock screen is nicer now that it displays the number of unread emails, battery percentage, date and time and new wallpaper. The GoodReads integration is really useful and the ability to create Collections....at last! Smart look up is cool...not earth shattering cool but cool nonetheless. The alarm is nice although I don't know that I'll use it. Second screen is a nice function (assuming it works) but I don't have a Samsung TV or PS3. The print function is a really cool, convenient function although as of yet it doesn't work with my Canon printer. The Canon app is crap. 1 Tap Archive might not be something that I'll use but I suppose it could be useful. The Amazon Cloud Drive is very, very useful. It's an easy, convenient way to move photos and documents from computer to Kindle and mobile phone to Kindle.I received the original Kindle as a Christmas gift one year and the original Kindle Fire as a Christmas gift the following year and was very happy with both of them. The HDX I bought for myself and as you can tell from my review I'm happy with it, too. On average I read one or two books a week and enjoy the convenience of Kindle readers.", "Title": "Terrific Kindle Fire HDX", "Date": "November 24, 2013"}, {"Author": "Robert C. Rudenauer Sr. \"House Husband\"", "ReviewID": "R39STQJMDSX4E7", "Overall": "5.0", "Content": "This does every thing I could imagine a lot of fun! The cost is very reasonable! I would recommend to all my friends!", "Title": "Amazing", "Date": "April 12, 2014"}, {"Author": "Cynthia A. Anderson", "ReviewID": "R2W62ZXQ6WL51Y", "Overall": "4.0", "Content": "Was going to send it back then a kid came along and showed me how to run it.  I have lot to learn, but can navigate it now..  I really like the size.  Easy to stow.", "Title": "Getting to like my Kindle Fire.", "Date": "April 7, 2014"}, {"Author": "Ralph Amey", "ReviewID": "R3RO2N22RJ6ENX", "Overall": "5.0", "Content": "This kindle Fire is 10X better than the gen 1 kindle fire!! I love it and will use it frequently!", "Title": "GREAT!", "Date": "March 23, 2014"}, {"Author": "JOHN  MACKESSY", "ReviewID": "R8BCCJDXVG060", "Overall": "4.0", "Content": "out of the box ,Kindle hd .activate voice and follow simple instructions easy set for email and skype. haven,t had any problems.", "Title": "Easy to use", "Date": "March 23, 2014"}, {"Author": "MERRELL", "ReviewID": "RF0V8RVMJ0H76", "Overall": "5.0", "Content": "It is so good my wife wants a kindle. She has a different brand of tablet. Half the time the wife and kid has my kindle.", "Title": "Good", "Date": "March 23, 2014"}, {"Author": "Kathleen Garris", "ReviewID": "R2I83K0U08MYCA", "Overall": "4.0", "Content": "I switched to the Kindle Fire HDX last month and I'm still trying to get used to it.  I do love that the picture is much clearer, and it is pretty easy to navigate around, but what I don't like is that there is no light indicator for charging, and charging the new Kindle seems to take much longer than charging the Kindle Fire.  Also, it would be easier if the power on and off button were on the bottom as opposed to the back.", "Title": "New Kindle Fire HDX", "Date": "March 18, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R3901WRVSWYJ2H", "Overall": "5.0", "Content": "I take it with me everywhere I go as it fits easily in my purse and keeps me from getting bored while I wait. I can read, play games, check my email, etc., etc.. Definitely recommend for its lightness, and great viewing screen..", "Title": "My third Kindle and all are GREAT!", "Date": "March 18, 2014"}, {"Author": "Robert \"rgus\"", "ReviewID": "RK5ONWE5XGROK", "Overall": "5.0", "Content": "This is a really good multipurpose, multitasking device for home use.  Unfortunately, some one stole mine so I'll have to get another one.", "Title": "Kindle Fire HDX 7\"", "Date": "March 18, 2014"}, {"Author": "plainoldgolfer", "ReviewID": "R3W0KF18TGKPH4", "Overall": "5.0", "Content": "I love to read and our local library had a Kindle Fire that I could check out and try.  Well I was hooked and ordered mine and use it every day.  It has many features on it besides just a reader which makes it handy to have sitting next to my chair so I can pop onto the internet or just pick it up and read anytime of the day or night.  The May Day button is great to have on the Kindle Fire HDX 7 and I have had a question or problem and used it and the tech support is great.  The only way I would part with my Kindle is to purchase another one to take its place.", "Title": "Best purhase I ever made!", "Date": "March 18, 2014"}, {"Author": "Kurt Haggman", "ReviewID": "R2U2YONG1CJBW", "Overall": "4.0", "Content": "Easy to use. Great screen resolution.  Versatile. Meets expectations.  Nice and light. Should come with a cover.  Overall very good.", "Title": "Like it alot.", "Date": "March 7, 2014"}, {"Author": "Janet Stengel", "ReviewID": "R1ZDEZQZXQ3I37", "Overall": "5.0", "Content": "Enjoy my Kindle very much.  So much better than my I pod.  Just wish Adobe flash would work on it.", "Title": "Love it.", "Date": "March 7, 2014"}, {"Author": "thomas", "ReviewID": "R1QM502ZXTE9ZE", "Overall": "5.0", "Content": "This tablet rocks!  The HD quality is great.  It is very easy to use, has great battery life, and is light in your hands.  I purchased when Amazon was running a special, it was definitely worth the money!", "Title": "Very impressed", "Date": "February 1, 2014"}, {"Author": "Luis Gonzalez", "ReviewID": "REICSOYDULKYF", "Overall": "5.0", "Content": "I love this tablet- as a college student I am able to have my books with me everywhere I go. It is just the right size eazy to use and the battery last me longer than the tablets I've had in the past.", "Title": "Great Tablet", "Date": "February 1, 2014"}, {"Author": "Donna", "ReviewID": "RDZGXT66WQGYY", "Overall": "5.0", "Content": "I have an iPad which works very well for what I  purchased it for; however, after reading about the features of the Kindle Fire HDX 7 and it's capabilities, found it better suited for what I am interested in looking and reading.  Plus, it is easier to carry and store and holds a charge longer.", "Title": "Kindle Fire HDX 7 Expectations", "Date": "February 1, 2014"}, {"Author": "kaylee-anne rogers", "ReviewID": "R317KOUB8GPKB", "Overall": "5.0", "Content": "It is awesome!!!!! I can't believe that it is so light!!!!!! I can read in the dark with out a flash light.", "Title": "AWESOME KINDLE", "Date": "February 1, 2014"}, {"Author": "Susan K. Epley \"Susibo\"", "ReviewID": "RPK1763NRV4E2", "Overall": "4.0", "Content": "Got this for my boyfriend. Not only was he surprised, but he was so happy with the fact it was HD. Got it at a great price", "Title": "Love it", "Date": "January 29, 2014"}, {"Author": "Sheldon", "ReviewID": "R1EK1HTWKR52KT", "Overall": "4.0", "Content": "The kindle performs well, has a great display, a wide amount of apps (not as many as google play though), easy to type on, and is perfect for browsing the internet (especially Reddit). After a month of ownership the only problem I have with it is the screen occasionally has a fit of fast flickering, like the auto brightness is spazing out even though I have that disabled. I would give it a 9.5 out of 10", "Title": "Works great", "Date": "January 29, 2014"}, {"Author": "Ron Price", "ReviewID": "R3SETRIWF5AVOQ", "Overall": "5.0", "Content": "Great little tablet..works good..light and easy to carry. Battery holds up well..speakers could have more volume. I would tell anyone that this is a great tablet.", "Title": "kindle fire hdx 7\"", "Date": "January 29, 2014"}, {"Author": "Christine Fox", "ReviewID": "R3M2AEPZTFCE2Q", "Overall": "5.0", "Content": "I love the kindle.  The resolution is awesome.  I luv the portability of the HDX 7.  So many things to do.  Read books, check mail, stream.", "Title": "Luv the new kindle!!!", "Date": "January 28, 2014"}, {"Author": "isaac goodwin", "ReviewID": "R2SFBYOFPGWXHW", "Overall": "5.0", "Content": "Was cool awesome title cool always good to know that you are going well with your family and friends and family", "Title": "fun cool tite", "Date": "January 28, 2014"}, {"Author": "peggy paterson", "ReviewID": "R2WT4LO9DCCJXY", "Overall": "5.0", "Content": "Given  this as a Christmas present..am still learning all details, but love its portability and convenience. I recommend it Highly", "Title": "Kindle Fire  HDX", "Date": "January 28, 2014"}, {"Author": "Elizabeth Gillam", "ReviewID": "R18HRH5ZSBTXJ2", "Overall": "5.0", "Content": "I love my Kindle fire HDX!  I am so glad got it for Christmas! :):):)I am so happy with it! :):):)", "Title": "LOVE IT! :D :)", "Date": "January 28, 2014"}, {"Author": "thomas patrell", "ReviewID": "R1H2CU35JIWFJH", "Overall": "5.0", "Content": "It's all new to us  not like our laptop but good for reading The mayday button is the best thing I ever seem in any device I have used can't believe it's so easy to use. we get answers instantly no waiting and if they don't the answer to our question they get a tech that does Thank god for Mayday", "Title": "We like it so far", "Date": "January 28, 2014"}, {"Author": "bookitty", "ReviewID": "RBPQWP0LO8A4A", "Overall": "4.0", "Content": "Received this as a Christmas gift, gave it 4 stars because it was not easy to transfer my books from my old Kindle onto the \"FIRE HDX.I would recommend this to anyone that is looking to upgrade from the original Kindle", "Title": "Great Gift", "Date": "January 28, 2014"}, {"Author": "Lauren R. Adams", "ReviewID": "R3J5RFE9NFO0SK", "Overall": "5.0", "Content": "Amazing picture & impressive sound quality! Quite an upgrade from the bulky 1st generation fire! Faster operating system. Power & volume controls are ergonomicly placed on the back.Heads up: keep the latter in mind when selecting a case!-thought I could use the same case I purchased for my son's 1st gen kindle fire. http://www.amazon.com/gp/aw/d/B008PWUQPYAlthough it fits nicely in the case, you find that you must untuck a corner in order to effectively access the power & volume buttons on the back, as well as the  power port & ear phones plug in on the sides.Great Product!", "Title": "Glad we purchased hdx!", "Date": "January 15, 2014"}, {"Author": "srv112779", "ReviewID": "R14KD74YVGB070", "Overall": "5.0", "Content": "Love my kindle it is super awesome and I would recommend to everyone! Everyone should get one, it is great!", "Title": "Awesome!", "Date": "January 15, 2014"}, {"Author": "tmr", "ReviewID": "R1QV5JSPBLG23Q", "Overall": "5.0", "Content": "picture quality, speed, size  only thing I miss is google play store but I have that on my 10\" Toshiba  thrive.", "Title": "great tablet", "Date": "November 20, 2013"}, {"Author": "Rae Jean", "ReviewID": "R1067I3DS380U8", "Overall": "5.0", "Content": "I love it.  This is one purchase I am glad I made.  I can check e-mails, facebook, read, play games.  LOVE IT", "Title": "Kindle LOVE IT", "Date": "November 20, 2013"}, {"Author": "Lorene Wilkerson", "ReviewID": "R2JRBWM7012NGY", "Overall": "5.0", "Content": "I love this because it substitutes for my laptop and is easier to carry with me in my purse.  I can receive emails and have documents sent to it which assists me at meetings.", "Title": "As versatile as a laptap or tablet.", "Date": "November 20, 2013"}, {"Author": "Jaime", "ReviewID": "R27UTWYT0QJ0L2", "Overall": "5.0", "Content": "Amazing! Easy to use. The colours are brilliant! I did not notice the blue tint or glow others described. Can't wait to watch more movies and tv! Great buy!", "Title": "amazingly easy to use", "Date": "November 19, 2013"}, {"Author": "Jean Farmer \"gizzmogeek\"", "ReviewID": "R2CVMWZMLSDW36", "Overall": "5.0", "Content": "Replaced an original generation Kindle Fire with the new HDX Kindle Fire and it's awesome. Faster, brighter, better picture. Nothing to complain about. Worth every penny.", "Title": "Great updated Kindle Fire", "Date": "December 13, 2013"}, {"Author": "Kris Cantu", "ReviewID": "RHWXTM671KUZD", "Overall": "4.0", "Content": "For those of you that haven't had to use the new Mayday feature know that it is awesome.  I got my KF HDX today and had a couple account registration issues to sort out.  I went into the help feature and next thing I know their was real live person on a mini \"skype\" screen who walked me through what I needed to do.  She could even \"highlight and circle\" where I needed to go to do it.  Way cool!", "Title": "Mayday!", "Date": "December 12, 2013"}, {"Author": "boomer", "ReviewID": "RIH9QEUTFA2RZ", "Overall": "2.0", "Content": "I've had two HDX 7s in a week, and they both exhibit three issues that I can't overlook.1) blue light bleeding - for me too distracting in web pages, reading, etc. I can't train myself to ignore it2) wifi - I have two access points in my house, and the Fire can't hold a signal. 90% of the time I have to turn my wifi off then on to rejoin my network3) battery drain in standby. Maybe related to wifi hunting, but leaving device in standby all day drains my battery from 100% to 40% in about 10 hrsI wanted to like this for the screen, simplicity, and Prime features, but in the end, I'll try the nexus or just default to the mini.", "Title": "Deal breaker issues", "Date": "December 11, 2013"}, {"Author": "DaMann4u", "ReviewID": "R2G4QRFX9FD9AG", "Overall": "3.0", "Content": "Before I tell why I gave this three stars you most understand that this is my fourth kindle and my third kindle fire hd and my first kindle HDX so I have some history with Amazon kindle products. The reason why I moved to the HDX is because I needed I much bigger hard drive. My other kindle fires are 16 gb and they became to small very quickly when I started storing HD movies. A major draw back and disappointment for the HDX is that you cannot connect a hdmi mini cable to it and watch on a bigger television. No HDMI mini connection. That's a bummer!", "Title": "No HDMI mini Connection!", "Date": "December 11, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00CUTT4HY", "Features": null, "ImgURL": null, "Name": null}}