{"Reviews": [{"Author": "Damar Earl", "ReviewID": "R1FUNIDQFQ137B", "Overall": "5.0", "Content": "My favorite purchase in a long time.  I love it.  A reasonable priced tablet.  I can watch videos on it, read books, play games... it works fast.  Did I say I love it? LOL  I had to use the \"call for help\" button once... and they really did help!  It was actually kind of fun!", "Title": "Great tablet.", "Date": "March 7, 2014"}, {"Author": "Kathy of Ireland,", "ReviewID": "R2ZYUH8EWC5UYM", "Overall": "5.0", "Content": "I have had my kindle HDX for a month now and I have never been so happy with an item it is so much better than my computer is. I love games and this kindle is the way to go.Thank youAmazon", "Title": "GREAT PURCHASE", "Date": "March 7, 2014"}, {"Author": "Fredwash", "ReviewID": "RNN3SIB76NPEO", "Overall": "4.0", "Content": "My first kindle version was, a paper white version, i own it for quite sometime, and let me confess i was a bit reluctant to upgrading from a \"dedicated e book reader\" to tablet kind, but i decided to give it a short, after reading some positive review from other user, i wasn't expect anything astonishing or different from the other \"considered low-budget \" tablets,but guess what the HDX gave me more than i could wish for, and i am located in EAST AFRICA, thousands miles away from US and i am telling you it doesn't matter which corner of the world you are habituated, having this will bring the world into your palms of your hands in so many ways , from the state of the art customer care of its kind, \"the may day button\"  the life span of battery to the high resolution screen, and finally the sensational quality of \"Dolby sound audio\".with this gadget you can read, you can listen you can watch, you can even gaming for hours without getting tired of it, Amazon finally did it, and i hope they wont wont release anything as good as this for at least couple of years to come, so i wont have to replace it, hahahaha! because I WILL. i only gave it 4 start because AMAZON don't have a 4G version of HDX available outside of us and Canada, specifically AFRICA, i wish they will release a unlocked  version of Kindle hdx 4G", "Title": "If you ever consider having a Tablet that will be your patner wherever you go, This is the one", "Date": "March 5, 2014"}, {"Author": "Gale", "ReviewID": "R1ODKKOCEB8J5V", "Overall": "5.0", "Content": "I purchased the Kindle Fire HDX7 for my husband to take with him on a trip to Nigeria. He loves it and used it for reading on the very long flights and e-mail to communicate with us at home. Screen is wonderful, bright and fast. Much nicer than just a phone. I would highly recommend this to anyone.  He loves his Kindle.", "Title": "Husband loves his new Kindle", "Date": "March 3, 2014"}, {"Author": "Chris J. York", "ReviewID": "R8DBU6FLPKA9D", "Overall": "5.0", "Content": "Made for a great present last Christmas, and I must say I was a little jealous of the friend I bought it for because it's a nicer Tablet than my Nook HD+", "Title": "Great present", "Date": "March 3, 2014"}, {"Author": "chingon", "ReviewID": "R19EDEHCHIRTZ0", "Overall": "5.0", "Content": "I bought this from a neighbor who received it as a gift and wanted an iPad. I'd done research and gave it a shot.It is pound for pound the best tablet on the market. I've used other tablets including iPads. The fire HDX is extremely lightweight, easy to use, the screen is AWESOME, it also feels great in my hands. My neighbor has huge buyer's remorse after having spent so much on her iPad.  A small percentage of people would be better off with an iPad.IPad is good. Fire HDX is good and smart.", "Title": "magnificent", "Date": "March 2, 2014"}, {"Author": "Thomas E. Miller", "ReviewID": "R2L2X89V43JAQC", "Overall": "5.0", "Content": "I had purchased a kindle two years ago, for my girlfriend. As she is addicted to it. I would recommend this item to a man needing a present for a anniversary. The new HDX is much faster and a worth while upgrade.", "Title": "Great gift", "Date": "March 2, 2014"}, {"Author": "debra l gilmore", "ReviewID": "R2TJHZDBXYG5VY", "Overall": "5.0", "Content": "OK so to be honest I only bought this Kindle to use with the free books I get for using Amazon Prime ( which is well worth the money by the way). I already have a Nook and an IPad. However, this Kindle has proven to be my favorite electronic devise! It is not as bulky or heavy as my IPad nor does it weigh as much as my Nook. It's speed is much faster than either. I like the lay out of the pages better also. It is very user friendly. I rarely pick up the other two anymore.", "Title": "Perfect size and weight", "Date": "February 25, 2014"}, {"Author": "Carl Ward \"Black Sinow\"", "ReviewID": "R1BVOFQKF82C19", "Overall": "5.0", "Content": "When I ordered my Kindle Fire HDX 7, I was like a good deal of you I imagine. I was unsure, wondering if the reported flaws were consistant throughout it's lifespan. But I will say now that I've had a chance to play around with it, it really is an incredible piece of technology, especially for people who are new to tablets and want to get their feet wet.As the case with the Kindle Fire HD, the HDX has a forked variation of android. This means that they are slower to update and their choice of apps will be limited. But this doesn't really mean that it's a terrible downside, especially since you have more access to amazon features, something that most android tablets do not provide enough of. The user interface itself is fairly easy to navigate, but limited in customization due to it's OS being heavily modified by amazon. As mentioned previously, if you are new to tablets, you can't go wrong with the HDX, in either of it's models. If you aren't used to technology in general, then this tablet will be perfect for you. It teaches you how to operate the tablet, which swipes do what and so forth. If that doesn't convince you, then the new mayday might do the job. When you press this button, you can communicate with a member of amazon's technical support team who can temporarily take control of your tablet to show you how to get from point a to point b. The difference between stock android and the modified android OS (aka Fire OS 3.0 as amazon calls it) are obvious, starting with the carousel. The carousel itself is a tray of apps and media that you use or prefer to use the most. Though I do love it, my only complaint is that I wish I could modify what gets added to it, so I could have more control over it. Below the carousel are your installed apps, which I absolutely adore, especially since stock android forces you into multi-home screen configuration (which I hate).The choice of apps may be few, but the selection of media is massive to say the least. If you live in north america, then you may know from experience that some videos, books, and music simply aren't available in the google play store. I have to be honest though, I never really did care much for google play's selection of apps, so having a limited selection really isn't that bad. Amazon offers a free app of the day though, so whatever app that is offered for free may vary from a free to paid variation. So downloading it will mean that you will have that app forever if you snag it. So the answer to the question \"what do you get out of the amazon ecosystem?\" is this, their entire cache of media, which is nearly perfect. Some movies and episodes might only be available for rent, but that is still more then what you get with google play. Let's be honest here, when you are buying a tablet, you aren't buying it for what isn't available in another person, but what is available to you. With amazon's x-ray, any x-ray enabled song gives you access to it's lyrics. X-Ray enabled movies and television episodes give you access to which actors play what and things of that sort, allowing you to find out who that one actor is through the help of IMDB. Books give you access to characters and which parts of the story they might show up in and so on. Keep inmind that while HD, HDX and paperwhite owners will find themselves enjoying x-ray, non-amazon tablets do not have this feature. If you have prime, then you will find yourself with the option to download prime-enabled movies and episodes. Having access to prime's library really is something to write home about, especially if you can't stand netflix. I have yet to fully test out the prime-enabled features, but I can safely say that prime owners will LOVE the HDX. The downside to this is that you can only download a handful of their videos (in my experience). But never the less, instant video is still a worthwhile feature to consider for prime members.If you have access to children of any sort (be they through babysitting or your own grandchildren), then freetime will be the answer to some of your problems. You can grant them special limited access to the tablet, which can be very helpful I'd imagine. But considering that I don't have kids nor do I babysit, I wouldn't know. So this is strictly up to you in how you prefer freetime. Playing a song, reading an e-book, or watching a movie is what the HDX is designed for. It offers incredible HD-quality graphics and stunning audio to make your experiences enjoyable. With specifications that are equal to what the nexus 7 offers and considering that there is a 64gb varient (which I own), it is the perfect media-consumption tablet to bring with you on vacation.If you use the internet frequently enough, then you will have nothing to fear! The HDX has a decent email client and web browser (aka silk). Silk is comparable to the stock android browser and should you not want to use the various side-loaded youtube apps, you can still access youtube via Silk and the quality does not suffer in the slightest. The email client does what any email client should and sticks to it, checking and deleting emails. Though I will admit there is a lack of \"select all emails\" option, but this hardly matters to me. Being able to check my email is all I prefer. The calender (or day planner if you prefer) is simple and to the point, proving that not every feature has to come with forty or fifty functions.If you choose not to pay that extra 30.00 to remove special features, you are treated to a lockscreen with ads. I understand that should you pay to remove the ads, you are treated to a handful of features. But having ads on my kindle is nice, since it gives me access to new sales and I like to save money if I can help it.In the end, if you like stock android and long for it's customizability, then don't get an HDX. An HDX is for one group of people, fans of the amazon ecosystem, people who are aware of it not being similar to a stock android tablet and are fine with it. This tablet does well at what it was designed for, media consumption. Which honestly, is something that I prefer to be honest. I have a nexus 7 here and it didn't offer HALF of the functions that are found on an HDX. There is no having to pay over 20.00 to fix the problems present in stock android and thanks to mirror cast, you can use your HDX to stream movies to any mirror cast-enabled device. Over", "Title": "Great for the whole family!", "Date": "February 25, 2014"}, {"Author": "P.Badger", "ReviewID": "R3JRIMLQV0OYB4", "Overall": "5.0", "Content": "Well....my wife and I are Kindle fans.  This is fifth Kindle so we are sold on the performance.  The HDX is definitely fast than predecessor. I also like the addition of Bluetooth. Overall, just another great Kindle product.", "Title": "Kindle", "Date": "February 25, 2014"}, {"Author": "Gloria G. Goodman", "ReviewID": "RJTCMC36ZZAXD", "Overall": "5.0", "Content": "I really like this kindle. The only thing I am not happy with is the fact that it only has a front camera.", "Title": "kindle fire", "Date": "January 21, 2014"}, {"Author": "Freda Lucas \"theatre buff\"", "ReviewID": "R364INNYL7D185", "Overall": "5.0", "Content": "Love my kindle fire so much easier than carrying around my bulky laptop and downloads so much faster and so easy", "Title": "Love the kindle", "Date": "January 21, 2014"}, {"Author": "Nicole", "ReviewID": "R1QROG7HWMRMLS", "Overall": "5.0", "Content": "This came as a gift to upgrade me from the third generation Kindle and the Kindle app on my smartphone. When given the choice between this and the Paperwhite, I chose this one due to the ability to use as a regular tablet when I'm not reading.Pros:- The picture is absolutely stunning, especially when watching tv/movies. The picture is vibrant, clear, and sharp.- It's faster than I thought it would be, including powering up and down. Much better than the third gen Kindles.- I'm able to play games like Candy Crush Saga and Wheel of Fortune without any issues.- Can access Netflix, Hulu +, and other tv apps!Cons:-The battery doesn't last as long as I had hoped when playing games but it's still better than playing them on my tiny smartphone.- The weight of the Kindle, while lighter than previous generations can feel heavy after using it for a while. This isn't a huge \"con\" since there are those tablet pillows I can buy to alleviate the need for me to hold it while I watch shows or read.- Every now and then, especially when the brightness is turned all the way up, the screen vibrates which can cause dizziness. It only lasts for a moment at a time but it can get annoying when it does it more than once an hour. When I have the screen dimmed it doesn't appear to have that vibration problem.Overall, this is a fabulous buy, especially for those of us who were able to get a holiday deal on it. Even full price, it's worth it. The Nook was looking good simply because it has access to Google Play and Chrome whereas the Kindle only uses their own proprietary shop (Amazon App Store). But after reading reviews from experts and consumers it seems the Kindle is still the better tablet. Besides, the way Barnes and Noble is heading, they may not be around long enough to support the new Nooks into the future. At least Amazon seems strong and doesn't appear to be going anywhere anytime soon so the Kindle will be supported for years to come.I highly recommend this for anyone older than 10 years old. Even with the parent controls on the Kindle, I would still choose Nabi and Nabi, Jr for kids under the age of 10.", "Title": "Love My Kindle Fire HDX", "Date": "December 3, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1ODI2KL0Q7YAJ", "Overall": "5.0", "Content": "What can I say about this device. This is my 3rd one and I love this one the most, its still light weight, great to use at work or on the go. The screen quality is amazing, love the new speakers. it's a nice little upgrade for me.", "Title": "Awesome", "Date": "March 24, 2014"}, {"Author": "Eandhope", "ReviewID": "R3M18D5IEG6QDP", "Overall": "5.0", "Content": "Purchased the Kindle Fire HDX for my 6 year old son. He loves reading, playing games and  taking video / pictures. New mayday feature comes in handy. Used the Amazon mayday customer service a few days ago and my representative was excellent.", "Title": "Great Gift", "Date": "March 24, 2014"}, {"Author": "Greg in Longwood", "ReviewID": "R36CE8ELSKOCCX", "Overall": "4.0", "Content": "I bought this as a Christmas present for my wife. She loves it. Her only complaint is that the battery doesn't last as long as her old Kindle Fire did.", "Title": "Great gift for wife", "Date": "March 24, 2014"}, {"Author": "robin s smith", "ReviewID": "RIZN3F5S3TIO0", "Overall": "5.0", "Content": "LOVE LOVE LOVE it what else can I say, best purchase i have made so far, through amazon!!!!!!!!!!!!!!!!!!!!!!!!!!! still learning how to use it!!!!!!!!!!!!!!!!", "Title": "kindlefire hdx 7\"", "Date": "March 24, 2014"}, {"Author": "doreen", "ReviewID": "RKPQMFASK63FX", "Overall": "5.0", "Content": "The HDX is awesome. Much better than the HD as far as screen resolution. I only wish I had purchased the larger size because this kindle is phenomenal. Easy to use, fast... love it!", "Title": "I love my kindle", "Date": "March 10, 2014"}, {"Author": "Sandra Irby", "ReviewID": "R3LR8JUI9XTD53", "Overall": "5.0", "Content": "So much fun! I love the at the finger tips books and reviews. Easy to load apps and movies, check my email, surf internet. Skype, it is all here!", "Title": "My Kindle Fire", "Date": "February 26, 2014"}, {"Author": "Lily", "ReviewID": "R2YXXMRL0PWPW6", "Overall": "5.0", "Content": "I bought this as an all purpose tablet, but i did not realize how much I would enjoy it. My daughter uses the FreeTime feature to practice math and spelling, and the toddlers want the peek a boo barn app. I use it to read. I watch movies on netflix. Email app is easier to navigate than a pc. Light so you can take it anywhere and slim so I can hide it from the kids when I need to. My favorite feature is the May day button. You press it and minutes later you are talking to a human being!", "Title": "love it!", "Date": "February 12, 2014"}, {"Author": "Rachel Doden", "ReviewID": "RTK9DYFYOV8T8", "Overall": "5.0", "Content": "This is my first Kindle so I have nothing to really compare to but I just love it. The picture is awesome, it's super fast and it's just so pretty. My only problem with it is you can only take selfies with it (and I'm not too big on selfies), but I knew that before I bought it. I love, love, love my new Kindle HDX and if you are considering purchasing it, DOOOOOOO IT!! You won't regret it!! (and it comes FULLY CHARGED!!!)", "Title": "My first Kindle, LOVE IT", "Date": "February 12, 2014"}, {"Author": "Julie Zieman", "ReviewID": "R3O5HW5ZAJ4J5R", "Overall": "5.0", "Content": "This is my first time with a tablet.  Have a lot to learn but I'm getting the hang of it.  Hate to say this but my grandchildren can work it better than me so I guess they will show me the ropes!!!!!", "Title": "Love it!!!", "Date": "February 12, 2014"}, {"Author": "David Browning", "ReviewID": "R1TUOFW6GG8WOV", "Overall": "5.0", "Content": "I own several Kindles ranging from basic readers to variations of the HD/HDX. Some of these devices I use as Amazon intended; others are modified to suit specific needs/interests. From a hardware perspective the HDX is outstanding and an attractive alternative to the Nexus 7 if you don't need GPS, NFC or wireless charging. On smaller tablets I prefer the Kindle form factor as I find it easer to hold in any orientation without worrying about accidental screen touches/activations. When purchased I assumed root access and perhaps an alternative ROM would eventually be needed. Turns out a different launcher (Apex or Nova) and a few side loaded apps from 1Mobile were all that was required. Didn't even need to root my HDX which technically voids Amazon's warranty. The \"Mojito\" operating environment is more flexible than earlier Amazon/Fire ROMs; most Android apps run perfectly with exception to the Play store (admittedly a biggie) and some Google creations. I can live without those. And I still have easy access to Prime movies and a few native Amazon apps that I happen to prefer. With minimal time and effort my HDX makes an excellent Android tablet that still leverages the best Amazon has to offer.", "Title": "Not your typical user", "Date": "February 12, 2014"}, {"Author": "exmptle", "ReviewID": "R1SEUURZHE3PB2", "Overall": "4.0", "Content": "I took this on a trip recently.  It was very handy for following the news doing general searches.  Not the best for the various map services.  I found it very easy to connect to the Wi-Fi in each hotel we stayed at.  My only complaint about this product is that it's way too sensitive to touch.  It's hard to scroll through screens without opening something about which you have no interest.", "Title": "Great Product.", "Date": "February 12, 2014"}, {"Author": "Roger McKee", "ReviewID": "R20PNMO161X45B", "Overall": "5.0", "Content": "My wife loves it keeps her from having to go to computer everytime she wants something and also loves playing games on it.", "Title": "Gift", "Date": "February 12, 2014"}, {"Author": "Rebecca L Hope", "ReviewID": "R1S5YQYHRPDBDF", "Overall": "5.0", "Content": "I really love my kindle fire hdx 7.  It works great. Great size too. I would recommend it to others.", "Title": "Kindle Fire HDX 7", "Date": "February 12, 2014"}, {"Author": "D Miller", "ReviewID": "R2C2FRR2ICA48P", "Overall": "5.0", "Content": "I absolutely love this!  Best electronic I have owned! Would definitely recommend this....great for reading books, internet, games,  emails, etc.", "Title": "Kindle Fire is limitless!", "Date": "January 28, 2014"}, {"Author": "N. Herndon", "ReviewID": "R287X91PVZQVJ3", "Overall": "4.0", "Content": "I bought a KindleFire for my 5-year-old for Christmas, and I received one for Christmas.  The devices work great, and the customer service is awesome.  You can talk to a tech representative within 10 seconds of clicking the Help button.  I only have two complaints: the Parental Controls feature is a bit awkward to use, and unless I personally sign my son on to the device, he can pick it up and play with it while it is not under the account I have set up for him.  Also, the origami case is not very substantial, and the only other option I have found for this device is the Otter Box--which costs almost $70.  It would be really nice to have a substantial cover for the KindleFire that didn't cost 1/3 as much as the device itself!  But the KindleFire is user-friendly and intuitive to use for the most part.", "Title": "Excellent Device", "Date": "January 28, 2014"}, {"Author": "Ludovic", "ReviewID": "R1BZZK7A6S4JUW", "Overall": "5.0", "Content": "I love everything about it, its a PC, library, movie theatre, literally anything and everything you could want it to be.  The only thing I wish it had was a HDMI out port, maybe the next generation model will have this, if so you have a repeat customer and I'll likely get a larger screen.", "Title": "Everything in ONE except HDMI out", "Date": "January 28, 2014"}, {"Author": "Donald Cooley", "ReviewID": "R3HWH443SH5XQV", "Overall": "4.0", "Content": "It has great graphics and is easy to get the hang of to use, just a little difficult for me to type using the keyboad", "Title": "Nice replacement for a laptop when traveling", "Date": "January 28, 2014"}, {"Author": "Eric Newkirk", "ReviewID": "R2SS9P3QWMVL1K", "Overall": "2.0", "Content": "The main reason I my Kindle so I can start buying or renting e-books for college instead of dealing with the college bookstore. The very first book I rented, \"Core Concepts in Cultural Anthropology 5th addition\" from Kindle, I was unable to download the textbook to my computer. After dealing with Kindle tech-support for a very long time. All he could do was apologize and tell me the book is not compatible with my computer. The main reason, as I stated above, and the only reason I bought the Kindle fire 7 inch HDX was to be able to have my college texts on the go with me and on my computer at home. I asked all these questions through Amazon and Kindle sales and tech personnel through online chats before deciding on the purchase. As I stated the main reason for the purchase was to have the ability to rent or purchase each texts, but as I learn more about the Kindle. I decided the extra bells and whistles would be nice to have also. Another disappointment you give us a camera with absolutely no way to take good pictures because you can't see what you're taking a picture of. I still have time to return this product and plan on doing so, but I'll have to take a loss on the case and screen protector that I purchased in anticipation of my Kindle's arrival. I have lost count of how many people came up to me on campus, who see me with my Kindle and asked my opinion. And I'm sorry to say I have told all of them to search for another product and not waste their money or time discussing this product sales or tech-support who knowingly lie in order to sell more product. Sincerely disappointed Eric Newkirk", "Title": "Either lied to or misinformed repeatedly", "Date": "January 28, 2014"}, {"Author": "dona", "ReviewID": "R14HH90K8Z0Z65", "Overall": "2.0", "Content": "I bought the kindle for my husband for x-mas. He finds it very hard to navigate from program to the next and battery life is very short.He now wants me to print out the user manual. I'm about to through both of them out the window.frustrate", "Title": "frustrate with kindle", "Date": "January 28, 2014"}, {"Author": "Terisa Kerr", "ReviewID": "R22M8U4LYMN9EW", "Overall": "2.0", "Content": "The first one froze after I opened a book and then suffered an irrecoverable crash a few days later.  We are now on our second Kindle Fire HDX.  I've turned it on once to register.The device, overall, I am not impressed with.  The device seems unreliable.  We bought 2.  One we sent back.  My first impression was that it was a big Amazon advertisement and you must dig for programs to operate non-Amazon books.  The Kindle Free Time also does not work like I was led to believe.  Also, it isn't secured/encrypted.  The clarity and battery life are excellent.Overall, I personally  would rather have a Samsung Tablet.  These were gifts for my kids and I wish their dad would have saved his money.", "Title": "Meh", "Date": "January 28, 2014"}, {"Author": "Bonnie Lewton", "ReviewID": "RDB52KRVP5CFU", "Overall": "2.0", "Content": "We purchased the kindles as gifts for our 2 sons. Each has one. Bought these because we thought the parental controls would be good. Like setting up time limits. I own a Apple Ipad which I love! Kindle is  very confusing. Took me awhile to figure out how to set it up & still haven't figured out the time limit thing :( Not happy with this at all :(Ive attempted to set up times for my kids to play or just maybe 1 hr a day with no luck!Also, the games are always freezing so we have to constantly hold the power button & shut off the kindle and restart. Never had this problem ever with my IPad.", "Title": "Disappointed & frustrated!", "Date": "January 28, 2014"}, {"Author": "waynesigmon", "ReviewID": "R25DM4H1FJS7W7", "Overall": "5.0", "Content": "Used my friends kindle,so I bought one.it's fast and fits my needs.the best on the market as far as I'm concerned.", "Title": "kindle fire hdx", "Date": "January 28, 2014"}, {"Author": "helen haynes", "ReviewID": "RRN0VHOG344G5", "Overall": "5.0", "Content": "i REALLY LIKE THE KINDLE. I WISH THERE WAS A BOOK THAT CAME WITH THE DEVICE EXPLAINING HOW IT WORKS", "Title": "I am new to the kindle and am learning how to use it, so far I really like it.", "Date": "January 28, 2014"}, {"Author": "Dee", "ReviewID": "R24IQ22DCZ4CCU", "Overall": "4.0", "Content": "Great value customer service gets five stars which makes issues not so bad. Few crash problems with some apps but all in all great product.", "Title": "like it for price", "Date": "January 28, 2014"}, {"Author": "imelda asares", "ReviewID": "RCRK9YBJX0GWR", "Overall": "5.0", "Content": "I love this tablet. Overall, its got everything I need and my kids is loving it too. I like to recommend this to any of my friends and family.", "Title": "light weight, nice crisp picture, fast", "Date": "January 28, 2014"}, {"Author": "maxine springer", "ReviewID": "R1HXM6XBMVMWXC", "Overall": "3.0", "Content": "I love my kindle but it does not have an outside camera and it does not allow you to have a background on the opening and home scream. I like it because of the books it has.", "Title": "my kindle", "Date": "January 28, 2014"}, {"Author": "Andrea L. Gillan", "ReviewID": "R2HI4VZ927W8CU", "Overall": "5.0", "Content": "My new Kindle is easy to take with me wherever I go. Fits snuggly in my purse. Like having a library at my fingertips. The screen displays are crisp and easy to use. It is becoming indispensable.", "Title": "Just the right size!", "Date": "January 22, 2014"}, {"Author": "Grammy Pammy", "ReviewID": "R1QHZSL62NJ3AW", "Overall": "5.0", "Content": "This is so clear and wonderful.  This is my 3rd Kindle and my favorite. I love the size. very easy to read.", "Title": "wonderful", "Date": "January 21, 2014"}, {"Author": "Brenda K. Mitchell", "ReviewID": "R2K0QXP0VFMEEW", "Overall": "5.0", "Content": "The Kindle Fire HDX 7 is the best gift I've given in a long while, my son has enjoyed it since Christmas day and has become a real fan. like he says, it does it all, and the graphics are great and so easy to take along wherever you go. Kindle has become a big name in the family, and were ready to purchase several more. Thanks", "Title": "Kindle Fire HDX 7", "Date": "January 21, 2014"}, {"Author": "Kelzo", "ReviewID": "R1CEVWUPDDOD2B", "Overall": "5.0", "Content": "Got it for a gift. The wife loved it... Free prime for a month was great as well.. Will be purchasing amazon prime!!", "Title": "Great stuff", "Date": "January 20, 2014"}, {"Author": "sue stitcher", "ReviewID": "R37BBTMS9JZ7HN", "Overall": "5.0", "Content": "My grand son is in love with it. We have to take away befor bed time....He tries to hide it...", "Title": "Xmas for my Grandson", "Date": "January 20, 2014"}, {"Author": "rbertani", "ReviewID": "R1E257MRO1AZH0", "Overall": "5.0", "Content": "This was a gift for my sister and she loves it. She, and her husband, plays games on it everyday. I don't even know if there are any books on it yet.", "Title": "It was a gift", "Date": "January 20, 2014"}, {"Author": "Kindle Customer", "ReviewID": "RFUXIBJOS4KJA", "Overall": "5.0", "Content": "just as advertised I used the product on a 7 hr flight.  Long battery life, Crystal clear picture. Decent sound", "Title": "Great Product", "Date": "January 20, 2014"}, {"Author": "Deb \"grannydeb47\"", "ReviewID": "R8GH8ABKOVLJ", "Overall": "4.0", "Content": "Not to happy with the battery life.  So far can use it for about 3 hrs before charging it.  Already went threw the hints on how to save battery life.  Not sure what else I can do to not have to charge it constantly.", "Title": "Battery life", "Date": "January 20, 2014"}, {"Author": "deborah Meli", "ReviewID": "RX4E4M12AXKB6", "Overall": "5.0", "Content": "I love this tablet. It's so user friendly. The reading experience and gaming is out of this world. I just can t put it down!", "Title": "awesome!!!!", "Date": "January 19, 2014"}, {"Author": "sherri birchwell", "ReviewID": "R2U6G5COONGPLA", "Overall": "5.0", "Content": "Gret quality. Built well. Similar feel to an ipad but half the price! This is our 3rd Kindle in our house. Cant beat it!", "Title": "Awesome! No need for an ipad!!", "Date": "January 19, 2014"}, {"Author": "B. Sy", "ReviewID": "R2V513GDDM8E66", "Overall": "5.0", "Content": "I originally decided to buy a tablet for $100 made in the US. I got it and it did not even turn on. So I returned it and decided to research something better. I decided on a kindle because I also have Amazon prime and knew I could get free instant video and because I just love Amazon. This is my first tablet and I've barely been able to put it down.It's easy to use and does everything. Reading books on here is so much better than a nook.I got the version with offers so I was expecting a bunch of ads but the only time there are ads is when you go to unlock the screen. I think it's stupid to pay more for without offers.It's much faster than my phone and laptop. The 7\" is the perfect size. The speakers are great. The graphics are the best I've seen.There are however a couple cons... I wish there was a rear facing camera, and I wish the Appstore had more apps.Other than that, it is the best piece of technology I've ever invested in!", "Title": "in love... completely.", "Date": "January 19, 2014"}, {"Author": "Pamela Koch", "ReviewID": "R1R95LA9XLAWC", "Overall": "5.0", "Content": "I am now a big fan of Amazon.  I pretty much found everything I could ask for. If I miss an episode of my favorite show,  I can buy it for a couple dollars and watch it again. I love the Cloud feature.", "Title": "Kindle Fire HDX 7  is great entertainment", "Date": "January 19, 2014"}, {"Author": "Linda Berry \"technogeek\"", "ReviewID": "R7LDNG36YA6QQ", "Overall": "4.0", "Content": "This is so good in so many ways = speed is excellent, great for streaming videos (part of the reason I chose the Kindle over a Nexus 7 is the ability to stream Amazon instant videos) size is perfect for ebooks but not too small to work for videos, battery life is great. The only rub is the limited apps due to not being able to access anything but Amazon app store. Add Google Play access and I would give it 5 stars. I was ready to change from Kobo to Kindle for a variety of reasons but was hoping I could have accessed my already purchased Kobo books with an app on my Kindle. Should have done my homework better, my bad. Very disappointing, but really the only complaint I have with this handy little tablet.", "Title": "So good, except....", "Date": "January 17, 2014"}, {"Author": "Anita Werner", "ReviewID": "R2YAHB7JG9QM39", "Overall": "4.0", "Content": "Perfect size and weight for me.  Easy-to-use.  Only complaint is it doesn't connect to our Wi-Fi until you stand within  3 feet of the source, then you can move away.  All of our other devices pick up our Wi-Fi anywhere in our home.  Each time we turn on this Kindle we have to walk back to our Wi-Fi box for it find it.  Even our basic Kindle reader works better with our Wi-Fi than this newer Kindle Fire.", "Title": "good overall", "Date": "January 16, 2014"}, {"Author": "Osvaldo J", "ReviewID": "R32KV12PHB9PYB", "Overall": "5.0", "Content": "There are two types of tablets, the regular tablets no tied to a content service and the KINDLE, if a easy choice, you can spend time going around searching for things you would like to have and use or use a content tablet like the KINDLE's that already have done that for you and have it presentment in a well easy to find, read to use secure environment for you and your kids.I use to had a NEXUS 7 which is a great tablet, but the issue in my case is that the best GOOGLE service don't work in my country, just in the USA...and sadly GOOGLE take like for ever to resolve that issue. So I decided to move to this great content service AMAZON have that have more that you can ever imagine to have in the palm of your hand. I invite you to try it ...you like me wont be disappointed and best of all tools and services work excellent outside the US.", "Title": "For Me Better than the Nexus 7 !!!", "Date": "January 16, 2014"}, {"Author": "Carolyn A. Layne \"knitting addict\"", "ReviewID": "RAZFX2MJ0KWC9", "Overall": "5.0", "Content": "I previously owned an Android tablet which was a dismal product.  So far I love the Kindle fire HDX 7\".  I had to use the Mayday button once when I was first setting it up and was thrilled at how helpful and easy it makes using the HDX.  I guess I am old fashioned in that I prefer to speak to a human being!  And you can actually see who you are talking to.  It makes it a great personal touch.  Thanks Amazon for coming up with this concept.  I am looking forward to using this tablet extensively.  I highly recommend it.", "Title": "All I can say is wow!", "Date": "January 15, 2014"}, {"Author": "Noreen", "ReviewID": "R3UKLPAQMFQ1CV", "Overall": "5.0", "Content": "Easy to set up, movies and videos are great to watch. I have had enjoyed the whole kindle experience. Customer support has been fantastic too.Thank you for exceeding my expectations!Noreen Otten", "Title": "Love it! Love it! Love it!", "Date": "January 15, 2014"}, {"Author": "Ginny", "ReviewID": "R31P24UL4NCZGY", "Overall": "5.0", "Content": "This item was for a gift and totally exceeded the person's ( Giftee) expectations! Loves it!!!!!!  5 stars  plusssss! would highly recommend!", "Title": "exceeded expectations!", "Date": "January 15, 2014"}, {"Author": "Laura Geiersbach", "ReviewID": "R2AY4WAIZ145OR", "Overall": "5.0", "Content": "I am loving this tablet. I've used android tablets in the past and I feel the Kindle fits my usage needs better. The lack of Google apps is not an issue for me. It hasn't frozen on me as others stated but if it does I'm sure it's an easy fix. Most tablets do that from time to time. There is definitely a blue haze on the outer screen when on a white screen but it doesn't take away from anything in my opinion. This is my first kindle and I think it's the beginning of a long term relationship. I will update if that changes but so far, so good.", "Title": "Not regreting my purchase so far ;)", "Date": "January 15, 2014"}, {"Author": "Lu A Britt", "ReviewID": "R219NKBYMST0OH", "Overall": "5.0", "Content": "I bought this as a Christmas present for my daughter. She loved it! My only complaint was that she loved it so much, we couldn't get her to put it down long enough to watch everyone else open their presents!", "Title": "Present for my daughter", "Date": "January 9, 2014"}, {"Author": "Anne Guest", "ReviewID": "R2LD5N8HGO7QRV", "Overall": "5.0", "Content": "I love it! It's a real \"learning adventure\" for a 68 yr old \"Grammy\"! I'm really enjoying all the Apps and playing \"Candycrush\"!", "Title": "Love it!!!", "Date": "January 9, 2014"}, {"Author": "frostwolf04", "ReviewID": "R2577FTZ0GYQ6Y", "Overall": "5.0", "Content": "the quad core processing unit makes gaming easy and reading smooth. the kindle fire hdx is also extremely durable on its sides to protect from drops", "Title": "fast and durable", "Date": "January 9, 2014"}, {"Author": "Bob", "ReviewID": "R2CE5AFUOPY1LC", "Overall": "5.0", "Content": "Never owned a kindle or tablet before, but have seen & used others. The clarity is very good. I love the fact that I can read books, play games, go on the internet, & see my emails all in one product without a phone ringing. The size is good, don't have to carry around a laptop. Fits in my wifes purse. Just wish it had front & rear camera.", "Title": "Nice", "Date": "January 7, 2014"}, {"Author": "terri l. selvey", "ReviewID": "R1HVVQSVVBPK5Q", "Overall": "5.0", "Content": "This little baby fits in my purse and does everything my laptop does and even more quickly.  I can evendo dictation on this for my job.  It's more lightweight than the Kindle Fire, which I also love.  I have 4 Kindlesand this one is rarely out of my reach.  I had to really look for the purple edges people were talking about,and with very close scrutiny I saw them, but then immediately forgot they were there.  Not an issue at all.For the price difference my only regret is that I got the 32 instead of the 64.  Maybe next year.  The camera,as some have said, is virtually useless unless you want to take pictures of yourself.  I don't want the bigger tablet because I like to be able to slip it into a regular-sized purse.  I hope someday they come out with a rear facing camera on the 7\". I guess that would be my only disappointment, but from the reviews I knew that when I bought it so I still give it 5 stars.", "Title": "I LOVE IT", "Date": "December 23, 2013"}, {"Author": "FreedomAndLiberty", "ReviewID": "R8OJHSGBTWDL5", "Overall": "5.0", "Content": "This product is just awesome. If you want the simple Amazon Prime tool to shop,watch,listen...or need help.. just click mayday....This product actually builds my desire to purchase more from Amazon. Also if i want to install google apps it is possible. Seriously Amazon Prime is just the way to go for all your shopping needs. So ..it has a fast enough processor to game and complete tasks like surf or watch a movie. Oh yeah another big thing was....reading books...this thing makes it easy to read a book....Amazon Prime and this device just works and is a huge solution for many tasks just reach down and pick it up...only thing that I would like to see is Kindles offer more harddrive space....like a 1tb...yeah we are in a time of file servers aka cloud servers...but in times of no internet...a real harddrive is a must...face it 4G/3G is a hoax, its a joke when it comes to internet so don't fall for the 4G lie and highway robbery mobile internet companies charge for internet...Amazon seriously this product and your growing services is on the right track for the future. Just remember don't close off this device to just Amazon...that would be the end of Kindle. I wish I had the money to have several of these devices....sometimes i don't need the full pc desktop but have a certain need and this device makes it possible and does so smoothly very good device very good tool. Keep up the good work Amazon! Amazon has so much potential that could grow alot of business and create alot of jobs....Kindle HDX is worth having! And my boy loves it! I recommend this especially if you are a Amazon user. I used this product for 20+ days or so and I'm getting one for Christmas. Battery life could be better but so could the ram and harddrive...but for what I did the device was not a problem it actually was the solution for many many tasks.  I watched movies, streamed music, watched video, surfed, read articles and books, used the alarm and calender, used yahoo weather app, played games. The only thing i noticed as something it lacked was harddrive space when the Amazon prime video offered to download the movie better quality would require more harddrive space. But this is more of need when traveling through an area where there would be no internet or limited internet. And... Really... the only thing...lacking is my bank roll to buy constantly 24/7 on Amazon with this device..haha...I'm sure i could come up with negatives but this device really is a solution a tool that just works for me.", "Title": "Genius Amazon", "Date": "December 20, 2013"}, {"Author": "Owen Murray", "ReviewID": "R20HS0J44HF8IP", "Overall": "4.0", "Content": "I'll preface this right now though: this could easily be a 4.75 - 5 star review. But before I get to what drags the score down for me, the good stuff about the Kindle Fire HDX:- Clearly more than a reader.  The hardware in this is powerful and easily high up comparative to other tablet-like device of this size.- Battery life is great so far.- Fantastic screen quality; reading, browsing the internet, using apps like netflix, tumblr, etc., all look fantastic- Sound is also very good, headphones and speakers both- Ads are very unobtrusive (if applicable to your kindle), only appearing on the unlock screen.- Like advertised, works straight out of the box (obviously if you have linked a previously existing amazon account to the kindle)- Big name apps from the amazon store work perfectly. Netflix, Tumblr, Pintrest, Pandora, Skype, Steam, Sonos, BBC, NPR, Twitch are some that I had no trouble quickly installing and using. The email integration is great, and the goodreads integration is absolutely fantastic.- Most of the settings and features are very intuitive, and when using for the first time there will typically be very basic, quick tutorials.- A great deal for the price.- If you own Amazon content in their cloud its a matter of seconds to access it. And if you have Prime, the kindle is a no-brainer.All in all a great device. However there are a number of limiting factors and mild annoyances that build up to a loss of a star for me. The good news is that many of these can be fixed; the question is whether they might actually be fixed. Here's my problems with the device:- Apps are solely from the Amazon Kindle App store. This is useful in some ways, as you can control apps from your amazon account remotely, but also limiting in others. Compared to the Google Play store the selection is lacking. Although it should be mentioned that this may be partially be design, since there are many apps that do not work (yet) on this kindle's version of android.  Even so, apps can be side-loaded onto the device if you have basic technical know-how. For example, the Humble Bundle App works perfectly on my kindle. To be fair a lot of apps are pretty much crap, but I'd like to have the options for more, albeit mixed with some quality control.- App permissions can sometimes be downright creepy, i.e. a stupid game or simple app having access to data  that it clearly does not need to function and you would rather keep personal. I understand that this is not strictly Amazon's responsibility but rather that of the third-party developers and the owner of the kindle, but its worth mentioning here.- The placement of the only physical buttons, the power and volume buttons, isn't as intuitive as I would like. I find myself accidentally pressing the wrong ones from time to time. I suppose that I might just have to get used to them though.- I would've liked the option for a mircoSD slot, but I guess we live in the age of the ~cloud~. The 16 GB isn't really 16 GB, which is par for the course. But its even less than you might think, you only get 10.6 GB. Unless all your content is on or going to be on your amazon account, spring for the 32 or 64 GB model.- The 7” version only has a camera facing you; no camera facing outwards.  Not really super important unless you want it.- The Carousel is plain stupid. This is a function that works well on other multi-touch devices, but on this kindle it just plain doesn't work well. The intended function is to quickly pick up what you had been doing previously, and for reading books this is still useful. However for everything else it isn't very. In particular if you load up things (like drm-free books via usb) they ALL appear as new on the Carousel, and you can only remove them one at a time. If there was someway to customize it, like so that everything new did not appear and you could lock in which apps you wanted to appear on it, then it might be functional, but as it is I ignore it completely unless I want to get back to the last book I was reading.- Some options for organizing books would be helpful rather than just sort by title/author/recent and displaying covers. An option for alphabetized letter sections would be nice, as well as some indication of a scroll bar to the right hand side.- One of the first things I did in my settings was turn off letting things automatically detect where I am located. I have wi-fi only, and I don't really need it on, plus nearly everything asks for it which just kind of creeps me out. But, and this is the most annoying thing, every single time an app or website requests it I get a pop-up asking me if I want to enable location-based services. Let me repeat this: Every. Single. Time. And a lot of apps will consistently ask. So at least once every 5-20 minutes, depending on what I'm using, I will be interrupted by this pop-up asking me this question even though the answer is pretty much always no. Which I thought was, you know, the point of me disabling it in the settings to begin with. I don't want to have to turn on Quiet Time all the time just to get this to stop.", "Title": "Well, okay, 3.75 stars", "Date": "December 18, 2013"}, {"Author": "Christine \"Christine\"", "ReviewID": "R2HBYWSTMDVQC1", "Overall": "5.0", "Content": "I have really struggled with past Kindle devices, always finding something I could not live with.  Just this past month I have tried and returned 2 other Kindle devices that were plain frustrating to me (the 8.9\" Fire HD and the 7\" Fire HD).  I figured I would give it one more last try with this one, and boy was I ever surprised.  Blazing fast, beautiful screen, slim design, awesome new lay-out.  The sound is absolutely amazing, way better than that of my iPad Mini.  If I had one critique it would be the position of the on/off switch and the volume controls.  Takes some getting used to.  I also wished the speakers were in the front, but I am not complaining too much on that one.  I now find myself leaving my iPad Mini at home, and taking this with me instead.  Never thought that day would come!Highly recommended (in fact, I ended up buying another one for my Dad.  With the mayday option, I know he too will love it!).", "Title": "Yes!!!  Amazon finally got it right with this one!", "Date": "December 18, 2013"}, {"Author": "Jeffery", "ReviewID": "RFEHTDZ0TG9VS", "Overall": "5.0", "Content": "My wife bought me the original Kindle for Christmas a few years ago and at first I thought I would have preferred an IPad but I was wrong.  I read a lot of books and many/most of them are free because I'm an Amazon Prime member. I guess you could argue the free part since I pay to be a Prime member.  The 7\" size is perfect for reading in bed.  I like the improvements from the original to this version. Screen resolution is night/day better than original.  I have used the \"Mayday\" button twice just because I couldn't find something that my old Kindle did - the customer service persons face popped up on my screen within 30 seconds or so and they walked me through it. They can even take control of your Kindle screen and press the buttons for you so you can see whatever it is they are trying to explain. So Impressed with this Kindle!!!  I have highly recommended this to anyone who asks me how I like it!", "Title": "Replace my original version #1 kindle - Love this thing!!", "Date": "December 18, 2013"}, {"Author": "WILLIAM BOSMAN", "ReviewID": "R3CK307SNNUFZ0", "Overall": "5.0", "Content": "Thanks Amazon this is great only con I can say but not really troublesome had to go to Verizon to have it activated at my expense took about an hour and it's great love it it's better than my old one thanks again Amazon  Bill Bosman", "Title": "kindle fire xd with 4g lte", "Date": "December 17, 2013"}, {"Author": "Kathleen Reilly", "ReviewID": "R1NVP9GW702V30", "Overall": "5.0", "Content": "I loved my old Kindle and really was not in the market for a new one, but my husband convinced me to upgrade.  I'm so grateful he did.  It's light and does not require a light, which makes it much easier for reading in bed.  I love being able to check e-mail on it also.", "Title": "Love it!", "Date": "December 17, 2013"}, {"Author": "Mrs. Geneva Sones", "ReviewID": "RXGQSKFENLCIU", "Overall": "5.0", "Content": "I have never before seen a tablet that was so easy to use as the Kindle HDX7.  The displays are amazing.  It is set up in such a way that it's hard to make a mistake.  It guides you through everything so easily, and you still have the online help you need if you run into a problem.  My nephew has an IPad and was here this weekend and could not believe how easy the Kindle was to use; he is going to get one too.", "Title": "What a wonderful item", "Date": "December 17, 2013"}, {"Author": "Barb", "ReviewID": "R1K4B9WQYL4LNR", "Overall": "5.0", "Content": "This is my third kindle and I love them all. However this one is awesome and the best yet. I love doing business with Amazon.", "Title": "Great kindle", "Date": "December 17, 2013"}, {"Author": "dwaynebrady", "ReviewID": "R3IR0MJZZ1JRF7", "Overall": "5.0", "Content": "Simply love this kindle.It's good for reading, fits into my pocket great for watching video while in bed too.The battery seems to be pretty good ( I keep it on airplane mode most of the time for reading) but the battery seems to last for 3-4 hours of video if not more.Only complaint will be the charging time and the charger they initially give you.", "Title": "Good product, brilliant display, horrible charging setup.", "Date": "November 13, 2013"}, {"Author": "Geari Viney", "ReviewID": "R2XACPLWSC2500", "Overall": "4.0", "Content": "Does everything I want but it did drop my email server several times and has to be reinstalled.  New Toy", "Title": "Enjoy my new kindle HDX", "Date": "November 13, 2013"}, {"Author": "George Lowe \"B. Lowe\"", "ReviewID": "R3JJUA63MVZG4O", "Overall": "4.0", "Content": "Huge improvement over my 1st generation Fire. Beautiful display. Good browser. Almost comparable to wife's Ipad Mini but not quite, and a whole lot cheaper. Buy it!", "Title": "Huge improvement!!!", "Date": "November 13, 2013"}, {"Author": "S. Schuchhardt \"SUZ\"", "ReviewID": "R3QR5WMUFISU1P", "Overall": "5.0", "Content": "This is an Awesome tablet. No complaints. I take it with me where ever I go. Use it in waiting rooms while waiting for appointments. For shopping lists, reminder notes. At home I don't have to be stuck in my office to read my email or to connect to family and friends on fb. Also use as alarm clock and time reminder so my day doesn't get way from me. I love it so much that each of my grandkids is getting one for Christmas. Shhhh don't tell.", "Title": "Great Tablet, Love It !", "Date": "November 13, 2013"}, {"Author": "Eileen", "ReviewID": "RVBEQPC9QL5E8", "Overall": "4.0", "Content": "Perfect size. Very user friendly. Great resolution. A bargain compared to other tablets. Very fast with quick access to the Internet. Love it!", "Title": "Love My Kindle Fire", "Date": "November 13, 2013"}, {"Author": "kokfann", "ReviewID": "R2270HFZZQA9T8", "Overall": "4.0", "Content": "Overall it is a great product. I think there is not need for me to review the product here as many have done so.I do not hesitate to rate 5 stars if not for the packaging of the item. Amazon/courier service should consider to wrap the package in bubble wrap or foam. The package it receive is in a brown envelope and quite torn. Normally seller will put bubble wrap, wrapping the product to prevent damage but not for Kindle Fire HDX. It is lucky that there is no damage, but you seriously think that the courier/deliveryman will handle the item with care? Amazon (seller) please do your part and I believe us, buyers will appreciate it too and will feel relieve when unpack the package.", "Title": "Overall ok except for the packaging", "Date": "November 13, 2013"}, {"Author": "hboson", "ReviewID": "R3993K4G1MNG67", "Overall": "3.0", "Content": "Let me first start of by saying that,this device was something I really liked, but couldn't end up loving it enough due to the issues I saw with it. After exactly a week spending with it, I have couple of issues which in my opinion were the deal breakers and with me ending up deciding to return it.So here's the list of good & bad:Disclaimer: The Kindle Fire was at it's latest firmware during my use & tests. No, I am not on payroll of either Google or Apple. I am just an tech geek who owns various devices and wants to see Kindle Fire tablet fix it's Achilles Heels for good.(GOOD)1) Device is extremely light and comfortable to hold.2) It looks & feels gorgeous.3) The display is one of the best. I already have a ipad2 with me and I enjoyed watching movies on the Kindle Fire to be honest.4) It's very fast when it comes to streaming stuff.5) One of the best speakers. The bass and clarity is amazing.6) Got just the apps to get you started.(BAD)1) The power and volume buttons on either side are badly placed and poorly designed in the sense that, you can't differentiate which one is which by just feeling them. I had to keep turning it back to see if I wasn't pressing the power button. Many a times during the first couple of days I ended up pressing the power button instead of volume. So if the lights are off, you will be groping in the dark for those buttons.2) The wifi suddenly loses connection and shows an x mark in spite of it being connected to the wifi network per se. But, it won't go to the internet. The only solution is to reboot the device, after which the x mark on the wifi goes away and everything is rosy once again.3) The sound suddenly stops working. It happened to me twice and both times, the reboot was the solution. I felt like I wasn't using an Android tablet, rather a Windows OS for a minute.4) I am sure the above issues are software bugs which can be fixed in the next firmware update. But, after shelling out 200$ one expects some basic functionality like Wifi & Sound to work without a hitch every other time. These are the things which can't be overlooked. I can overlook the limited app store,but not basic stuff which we ought to take it as granted.5) This is one is not a deal breaker, but wanted to lay it out there with the hope that Amazon will listen to it's loyal customer. If you are looking to side-load Google Apps(G+,Maps,Hangouts,Gmail,etc) with the exception of Youtube, you are out of luck. The youtube app too is just barely functional in the sense that you cannot sign in to your account. That's out of question. I am not impressed with Amazon's closed ecosystem policy even though I understand it's business reasons. What might be good for business in short term might hurt the company in the long term. I feel, Amazon has handicapped such a capable & powerful hardware by limiting the software ecosystem. Every person on the internet,whether Amazon likes it or not uses Google Services one way or the other and by alienating that user base, Amazon not only is slowing the adoption of this beautiful tablet, but also losing lot of customers to Google nexus.", "Title": "Capable hardware,but software handicaps it.I liked it, but couldn't love it enough to keep it.Returning it.", "Date": "November 12, 2013"}, {"Author": "Sherrie L. Hardy \"Sherrie Hardy\"", "ReviewID": "R1G63D1735TZFX", "Overall": "5.0", "Content": "I had the first Kindle fire and upgraded to this latest one.  I love my kindle.  I never leave home without it.", "Title": "Highly recommended", "Date": "November 12, 2013"}, {"Author": "CARLOS E CORREA", "ReviewID": "R3QUXIV6BNER5I", "Overall": "4.0", "Content": "amazing tablet but the store is a little bit short in some apps, however the product and the service in the mayday button are fantastic", "Title": "great", "Date": "November 11, 2013"}, {"Author": "Karen & Larry Lyson", "ReviewID": "R1VGA5415SI49L", "Overall": "5.0", "Content": "I love having my own Kindle as I don't have to fight the wife over hers. I love the speed it has and how sharpe the graph's are. I enjoy checking my email at the end of the day and checking on face book. I am looking forward to watching moves, especial when we get the program to transfer to the TV.", "Title": "I love the idependents of using it.", "Date": "November 11, 2013"}, {"Author": "ric", "ReviewID": "R1UI96VD4OYUP8", "Overall": "5.0", "Content": "its perfect ,love high def ,speed camera  download speeds facebook  completely better than previous models made a perfect birthday gift", "Title": "wonderful", "Date": "November 9, 2013"}, {"Author": "Lou", "ReviewID": "R1XPPOUTYWCOJH", "Overall": "5.0", "Content": "Love my 5th kindle! I have used the mayday button twice and both times the experience was wonderful. The techs were great! They had me fixed and done in no time.  I felt really special to get knowledgable help so quick and easy.", "Title": "Mayday button was extra easy to use.", "Date": "November 8, 2013"}, {"Author": "Ryan Mayberry", "ReviewID": "R1RBR9CHBUG2DB", "Overall": "5.0", "Content": "As an owner of the original Kindle Fire I knew this would be a great upgrade and it hasn't disappointed. I think what I like the most is that it operates as advertised which is actually hard to find a device sometimes that does this. The blue edges are there for reading and some web pages but they are minor and if this is what it takes to get the colors this thing puts out I'm ok with it. The screen is the wow factor when I show it off but behind that is a great device. I don't know if I'd get the 8.9\" HDX as I still wouldn't mind owning an iPad but compared to the iPad Mini this was just a better value IMO.", "Title": "Works as advertised=Excellent!", "Date": "November 7, 2013"}, {"Author": "mystormydog", "ReviewID": "R38ZEG28EKO7B4", "Overall": "4.0", "Content": "The device is great, bright clear screen, easy to read, great as a browser and to play games. Touchscreen is very reactive. My only problem is the May day button does not work and I have no access to the handbook. Other than that, this device is great.", "Title": "kindle hdx", "Date": "November 7, 2013"}, {"Author": "Sarah Coleman", "ReviewID": "R2FMRMLIM7BPSC", "Overall": "3.0", "Content": "The speed and fluidity of this tablet is amazing. Hands down, this is also the loudest tablet, especially for the size, that I have ever encountered.The primary two problems I have revolve around the screen and the design of the rear of the HDX. The blue haze along the borders of the screen are fairly prominent when surfing the internet and when using any apps with a white background, detracting from the clarity of text and images along the sides of the screen. I am also finding it difficult to hold the tablet in a comfortable and stable manner without constantly shifting the position of my fingers due to the sloping rear edges of the device. The iPad Mini and the original Fire HD are just so much more comfortable to hold for any length of time. Unfortunately, the HDX will be going back.", "Title": "Good for the price, but not great", "Date": "November 6, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00CUT8AJM", "Features": null, "ImgURL": null, "Name": null}}