{"Reviews": [{"Author": "Ravi Chivukula", "ReviewID": "R2AKBJJTAL7OFV", "Overall": "3.0", "Content": "I like the high resolution display, the speed of the device and its light weight. But I am frustrated with a lot of issues:1. I bought this along with Amazon's Origami case which automatically wakes up when you open the cover and puts it to sleep when you close the cover. However, the device goes to sleep shortly after I open the cover and fold it back! I think the sensors are somehow detecting that the cover got closed when in reality it is not! This is really very frustrating. I don't know how Amazon could sell the cover without properly testing it with the device. I guess a firmware fix is possible and I really want Amazon to fix this.2. The accelerometer sensor is not properly calibrated. Even the slightest tilt will make the display go from portrait to landscape mode or vice versa. Again not a good user experience. I have used iPhones and iPads and I really like the way the accelerometer works on those devices. A firmware fix should be possible for this too.3. The automatic brightness control setting is useless. Again the sensor seems to be too sensitive. Even though I hold the device without any movement and under a constant light setting, the brightness continuously kept changing. You just cannot use the device when the display continuously flickers.4. I configured the email app to only manually fetch the mail. When I open the app and check for mail, it consistently fails on the first attempt. You always have to retry to fetch the mail. Need a fix for this too.5. Many other issues like Silk browser not connecting to websites sporadically, unable to connect to WiFi randomly (my iPhone at the same time connects perfectly fine).6. Amazon has been slow to get the apps in the app store updated to take advantage of the high resolution display. Many of the popular apps that I downloaded still had low resolution.7. The latest software update has deteriorated battery life. Previously the battery used to drop by only 6% during the night while in standby mode. After the update, it drops by 17% for no reason!All in all, this is just a tablet that aspires to be in the top league but fails to do so. You can get things done if you are a little patient but if you want an enriching, hassle-free user experience go for an iPad. No free lunch here.", "Title": "So So, Has Many Nagging Issues", "Date": "November 27, 2013"}, {"Author": "Nicholas L. Sheda", "ReviewID": "R25451PB8I246U", "Overall": "5.0", "Content": "This beats i-Pad or anything else I've had in the past. Its beautiful and movies on it are remarkable to watch. I was afraid it was going to be too small for reading, but on the contrary....it is sufficiently perfect. Awesome Product!!", "Title": "Cant Express The Happiness", "Date": "December 30, 2013"}, {"Author": "Jonathan Gennick", "ReviewID": "R1AVGSUI4C3OSR", "Overall": "5.0", "Content": "The Kindle Fire HDX 7” (16GB, Wi-Fi edition) is excellent for anyone who enjoys Amazon Prime’s library of streaming video. For other use cases I lean toward the iPad, but the Fire HDX is an awfully nice alternative if you are unwilling to throw down the cost of a tablet from Apple.I can’t speak highly enough about the quality of the display. I watch a lot of Amazon Prime video, and the Fire HDX display is a joy to look at. Sound is good too, or at least is much better than from my phone. (However, I could wish for a couple more steps of loudness on the volume scale).The deepest negative is the charging time. (Twelve hours one night brought it up only to 84%). Buy the nine-watt charging adapter. The five-watt adapter that comes in the box takes far too long to charge the device. The nine-watt adapter is the one that really ought to be in the box to begin with.I like the tablet for why I bought it: watching Prime videos and reading Facebook and the Internet over my morning coffee. Amazon.com has crafted an excellent ecosystem and collection of offerings around their line of tablets. Apps such as The Bible App are wonderful on a device like this.The Kindle Fire HDX is well-crafted and good value for the price. So far the 16 GB model has been plenty, because I stream all of my media on this device anyway. I give it a full, five stars.", "Title": "Excellent for those who enjoy Amazon Prime streaming video", "Date": "December 30, 2013"}, {"Author": "Brent G. Williams", "ReviewID": "RNWTKBIBN0STI", "Overall": "5.0", "Content": "I have an Ipad Air, Mini, and Ipad 2 so my review is based on Apple vs Amazon.  The Fire HDX is fast, beautiful, light, and most importantly it is cheap (comparatively speaking).  Speakers are truly outstanding and they destroy the Ipad.  The only thing I can say is app content is where Apple is light-years ahead.  When Amazon brings up the quality and quantity of their apps, Apple will have their hands full.", "Title": "Great product", "Date": "December 29, 2013"}, {"Author": "KG62", "ReviewID": "R2JR9UTF0UYPWF", "Overall": "5.0", "Content": "We bought two to give as Christmas presents this year. One for our daughter  and another for our soon to be son-in-law. They love them and have been having a great time using them! They have Netflix and Amazon prime so they will be able to put these to good use!We also bought the 7\" HD version for our granddaughter. I love the parental controls, that way she can enjoy reading the books I want to send her and she can browse online safely. Since we don't see her very often anymore this will be a nice way to keep in touch. I guess 2013 was the year of the kindle for our family! :)", "Title": "Gave as Christmas gifts this year.", "Date": "December 29, 2013"}, {"Author": "Devan Seco", "ReviewID": "R1I8Y9WD99OZIH", "Overall": "4.0", "Content": "This is my 3rd Kindle. I own the 2nd generation Kindle, followed by the original Kindle Fire, and then this one. When I opened the box, I couldn't believe how thin and light they had made it. The Kindle worked great. Loved the screen resolution. Much sharper than the original. Wireless seemed to have a better connection to the Internet as well. I downloaded a number of my books, music, and most of my apps. One thing I was surprised to discover was that some of the apps I paid for were not in the cloud for me to download. It would be one thing if it was a free app of the day, but was really hoping to move all my apps to this one as I was running out of room on the original and had to leave most of my apps in the cloud. Overall the new Kindle is a great little tablet. I have an iPad with 64GB and I have to say I like using this better since it is as sharp as my retina display and had almost all of my books and apps that I use. Plus it is a better overall value.One strange thing that I have noticed is that some of the apps may not be designed for the higher resolution screen. I have a word search app which you cannot see all the letters. On some other apps, the screen is smaller and hard to read. I will patiently await to see if the designers will address this. Not an issue, as it only happens on a few of them. Overall, I can access and use about 85% to 90% of the apps without any issues.Even though I have had a few challenges, I would still recommend this to others. It is a great light weight tablet that I will be using daily.", "Title": "Really Good Tablet", "Date": "December 28, 2013"}, {"Author": "Denyse Rose", "ReviewID": "RKR3HW1U0H7L5", "Overall": "5.0", "Content": "I'm from way before computers came into the world. I go to the library site and request a book. When it comes in from another library, I get a phone call to pick it up and I usually have a week or two to read it, depending how new it is. It's worked out well, and I have saved money by not buying $30.00 books that I read and give away. My Kindle 7\" arrived in its small box. It is so tiny and can be adjusted so the light is brighter or softer, fits in my purse, and there are quite a few books available for free or for a minimal fee. I can take it to doctor appointments, all kinds of appointments so that I'm not bored. I can get all kinds of apps and my college student son is teaching me how to use it. In fact, that is the only drawback I can find - that there are no written instructions, or any instructions of any kind that come with it! So I would highly recommend it to anyone who enjoys reading and wants to fill up those minutes here or there. When you turn it on, it finds the page you were on and lets you hunker down and do just what you wanted to do all along - read your 'book' without being disturbed. This is another first - I've never left a review. Who knows what will come next - maybe my next book will be on sky diving!???", "Title": "This is so much better than carrying a thick book around with me!", "Date": "December 28, 2013"}, {"Author": "Dave816", "ReviewID": "RE9KID4RYJZKR", "Overall": "5.0", "Content": "Outstanding 7\" tablet. Love the HDX. Second Kindle fire I've had and would have a hard time giving it up. Wife has a 10\" Samsung tablet and I would not trade her. It does have a few quirks but so does the wife's Samsung. I use the HDX to watch movies , read books and get on the internet daily and enjoy it. You can take the wife's tablet, but leave my Kindle HDX alone!", "Title": "Great tablet!", "Date": "June 12, 2014"}, {"Author": "B. Hardison", "ReviewID": "R39AJWD9G3KIJZ", "Overall": "5.0", "Content": "I really do love my Kindle, but it does have a few quirks.  Occasionally it has to be rebooted to get rid of some glitch or other.  Recently I downloaded a Talking Reminder App, and immediately after trying it out my sound started dropping down to nearly inaudible when watching Netflix.  I tried resetting it several times as described in the help forum.  That did not work.  I finally deleted the Taling Reminder App (which was free) and the sound is working fine for me now.  I see there have been several reports of problems with the sound on these devices, but this is the first time I have had  a problem, and I never lost the sound completely.  I hope this helps someone who may be having similar problems.", "Title": "sound problems", "Date": "March 22, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R9UZBMZ19ZXNH", "Overall": "2.0", "Content": "I liked this device, but there were screen problems. The first one developed a noticeable flickering. I couldn't tolerate it and Amazon sent me another one. The 2nd one had a dark purple/grey line down the right side. This was most evident in the Kindle app or on websites with white background. Amazon sent me a 3rd one and it had the same problem. I decided to get a refund on it rather than try a 4th one. Note: I know these devices are supposed to have a \"faint thin blue line\" in the edges, and the first one did and it wasn't a bother at all, but the other 2 it bled way out into the margin and was very distracting and annoying.", "Title": "I liked it but there were screen problems", "Date": "March 22, 2014"}, {"Author": "Clinton Anderson", "ReviewID": "R17SFQM6Z8GBLL", "Overall": "5.0", "Content": "Love this product! Definitely better than the galaxy tablets. It's more user friendly and has so many options. Ultimately it's user preference I suppose", "Title": "go with this, pass on samsung!", "Date": "March 21, 2014"}, {"Author": "Alicia", "ReviewID": "RKYH1AH8UK3GC", "Overall": "5.0", "Content": "Love the clear, crisp picture. Much faster loading pages than my older tablet. Hubby researched it before he bought it and compared it to an iPad with crisper resolution. Takes great pictures!", "Title": "Love it!", "Date": "February 1, 2014"}, {"Author": "christiangal38", "ReviewID": "R2RSRWASS4ISKU", "Overall": "4.0", "Content": "Got a Kindle Fire HDX for Christmas  I LOVE it since I was using a Kindle reader on my phone and the Kindle Fire really helps with my over 40 eyes.  I would have given it 5 stars but some of the apps will flip upside down when I have the screen locked in one place.  It's not a big deal, just annoying.  Other than that, I LOVE IT!", "Title": "Love my Kindle", "Date": "February 1, 2014"}, {"Author": "Paula Jean Rae", "ReviewID": "R1S48GO7Q87RO7", "Overall": "5.0", "Content": "It does everything I need.  Picture and sound are great for movies and games.  I like the variety of apps available.", "Title": "I love it", "Date": "February 1, 2014"}, {"Author": "Mark Steele", "ReviewID": "R1FB316SEKCHJP", "Overall": "5.0", "Content": "I didnt want an iPad and was looking at the iPad mini but i love the Kindle HDX combination of easy to hold size and weight, excellent color and graphics support (video, pix) . It is becoming my preferred  way to read online news and catch up on email (unless i have a lot to type when I prefer a real keyboard.)", "Title": "best multipurpose tablet in medium size", "Date": "February 1, 2014"}, {"Author": "Pamela Lloyd", "ReviewID": "RCJ7AZ1HQTGT7", "Overall": "5.0", "Content": "I am  very old fashioned and probably never thought I would own a e-reader but this is so much more,  I actually love reading on it.Because of the size( about the size of a paperback book). and it is so light, it is perfect for taking with me when I am sitting in places waiting or for vacation, and at night I don't  have stacks of books piled up on my bedside table now I just have my kindle.", "Title": "It is amazing", "Date": "February 1, 2014"}, {"Author": "Amy M.", "ReviewID": "R1MKLO9FUI52KC", "Overall": "5.0", "Content": "This is my very first Kindle and I love it!  The screen is so unbelievably clear.  Super easy to use.  Definitely recommend!", "Title": "Love it!", "Date": "February 1, 2014"}, {"Author": "NW \"Beachlady\"", "ReviewID": "R2C8L12NFYKQP3", "Overall": "4.0", "Content": "Fun to use, fairly powerful, but has locked up on me a few times.  Hopefully locking up won't happen again.", "Title": "Fun to Use", "Date": "November 24, 2013"}, {"Author": "Richard Eller", "ReviewID": "R1LR2D1ILFJIPQ", "Overall": "5.0", "Content": "This probably is the best deal out there. It's the perfect size to be really something you can slip in your pocket or with a nice protective cover take along with you since it's smaller than a paperback. The display is awesome! The images are just like being there. The sound is great, but I wish there was a little more volume on the hi side. I got the 32GB with WI-FI only and all I can say is the competition really needs to look at what you can achieve for an economical price. I like how it automatically updates the software without having to search for it, and MAYDAY is just one of the most fantastic features, no one has anything like this. I had just bought a e-ink reader about three weeks before buying the Kindle Fire. All I can say, is, it's worth every penny!", "Title": "Great Buy", "Date": "November 24, 2013"}, {"Author": "dchickles", "ReviewID": "R336X4PX5N1OI6", "Overall": "5.0", "Content": "Great little device for the price. Works perfectly for watching amazon videos on TV (in conjunction with my Netgear PTV3000)", "Title": "Great for wireless display!", "Date": "November 24, 2013"}, {"Author": "GENE", "ReviewID": "R7OKT0TLPK62L", "Overall": "5.0", "Content": "This is a wonderful item. I have only scratched the surface of using it. The help button is ideal when I get stuck on something. Amazon has a winner here.", "Title": "Wonderful item", "Date": "November 24, 2013"}, {"Author": "Sebastian Perez", "ReviewID": "R4VIIDLKK431Z", "Overall": "4.0", "Content": "This was a gift for my brother. He loves to read. He love the easy way you can buy books to read.", "Title": "Gift for brother", "Date": "November 24, 2013"}, {"Author": "austin gabhart", "ReviewID": "R1NURZD7SIDFHP", "Overall": "5.0", "Content": "My Kindle fire is awesome ,picture is crisp and clear, I have watched movies on it and stereo sound is unbelievable. My wife bought an iPad and my Kindle fire HDX has a much better display , it has a ,quad core processor it's very quick on the Internet, playing games .. It does have one fault it only has a front facing camera, other than that if you're looking for a lightweight very fast excellent display tablet you can't go wrong with this", "Title": "I would recommend the Kindle fire HDX", "Date": "November 23, 2013"}, {"Author": "Melissa", "ReviewID": "R39EGS1QQN6TG0", "Overall": "5.0", "Content": "love it - just wish the sharing library was more liberal with # of times you can share a book.  MAYDAY is great", "Title": "mayday is great", "Date": "November 23, 2013"}, {"Author": "Ryan J.Kontny", "ReviewID": "RIY8OH6WQ04BJ", "Overall": "4.0", "Content": "The Kindle fire HDX is better than my old kindle fire. I like the Mayday button the advisor helped me turn off the screen reader feature. When I turned it on by mistake.", "Title": "Why I like the kindle Fire HDX", "Date": "November 23, 2013"}, {"Author": "Prairie", "ReviewID": "R2OIQMVLZIZZ9E", "Overall": "5.0", "Content": "This is my first experience with the Kindle Fire and I was really surprised how much I can do with it. I thought Kindle's were just for reading books or playing games but it is so much more than that.", "Title": "Kindle Fire HDX Is Awesome", "Date": "November 23, 2013"}, {"Author": "lindsay", "ReviewID": "R3I5AGWYD4ZN2P", "Overall": "5.0", "Content": "i love this tablet. the mayday button is a great thing for a Luddite. i still have not figured out all the bellsand whistles but i like what i have so far.", "Title": "i love it.", "Date": "November 23, 2013"}, {"Author": "CCB", "ReviewID": "R38PYX35GXJ6GM", "Overall": "5.0", "Content": "I am a Kindle lover so my review may be a little bias. My worked great from the start and I loved that I was able to receive the day before I went out of the country. I love that it is not big and bulky and it fits perfectly in my purse. I will continue to by Kindles when they come out as long as Amazon keeps making them as great as they are!", "Title": "Just What I Expected", "Date": "November 6, 2013"}, {"Author": "Angel Book Reader \"book reviewer\"", "ReviewID": "R1OG61AEDQRPKQ", "Overall": "5.0", "Content": "Update 02/17/2014I can now recommend the Kindle Fire HDX. I am changing 1 star to 5 stars. After posting the original review, amazon contacted me and worked with me. I finally spoke with someone in the kindle support who could help me. The problem was the Comcast Arris Modem/Router I was using. Last friday, I bought a Netgear modem from Best Buy and an Belkin N+ router. All problems have disappeared. My kindle is now working fine. If you are having wifi problems and battery drain issues, it might be your Comcast router. Do not return your kindle, just get a new modem/ router and the problem should be solved.Original Review:**********From the outset, I want to state that I will not recommend the Kindle HDX 7. I own five Kindle devices, 4 Kindle HDs and 1 Kindle HDX. I had pre-ordered the Kindle HDX when Amazon announced it and I received it three days before it was sold to the public. Within a month of receiving the HDX, I had problems and had to contact Amazon for a replacement. They quickly sent me a new replacement kindle. The new kindle has been giving me lots of problems: disconnects constantly from the wifi, drains battery power even when it is not in use. Keep in mind, none of my Kindle HDs that are already over a year old have any of these problems. At first, i thought the problem was the Amazon kindle hdx case I had on it. I took the case off and still experienced the same problems. This has been going on since December. I have factory reset several times and the problem is still not solved. Last week I contacted Amazon, they sent me a refurbished replacement kindle (nervous knowing that the kindle I received had prior problems and that is why it is refurbished.). It looked used. I used it for a day and noticed problems with it. I contacted Amazon again and insisted they should send a new kindle because I am tired of driving to UPS to return defective kindles. The representative said he was placing an order for a new kindle for me. Today, i just got another refurbished kindle. I contacted customer support and I was told that as per the terms of agreement, a replacement kindle may be a used device. She informed me that if I have any problems with it, I should contact them and return it for a replacement. I am again nervous this might have issues again. I am crossing my fingers. If I have any issues, I will just return to a kindle HD. I like the new kindle because it is smaller and the display is better. Amazon will never tell us how many people have returned these kindles but I am sure a lot have been returned. I love amazon and I spend a lot of money on Amazon but unfortunately this might be my last kindle if Amazon does not make right with me. For now, I will not recommend the purchase of the HDX until amazon is able to deal with the technical issues with this device. I feel like I just paid $230 to buy a beta device. My ipad and iphone which I use a lot (90% more than the kindle) have not shown any problems like my kindle is.", "Title": "Too many problems before but problem was Comcast Router and not kindle. I now recommend the Kindle HDX.", "Date": "February 12, 2014"}, {"Author": "DrumKing", "ReviewID": "R2X6CUAOIUN8VL", "Overall": "1.0", "Content": "I don't like the format it's in, not easy to navigate around.  We mainly got it for my son, my daughter has a Samsung 10.1 tablet, which is much easier to navigate.  But of course thru time I guess you could get used to it.  But my number one beef with it, is that if you, for example set a yahoo account, whenever you hit email icon, you're automatically logged in!  Really?  No password?  Which by the way, you cannot log out!! My Amazon account is the same!  My son finds something he wants and just purchase's it, luckily for me Amazon has to have \"confirmation\", otherwise I could be purchasing things I have no control over.It's not all bad I guess, if that's what you're looking for, but I just don't like the fact that there is no option of logging out.  I go to Amazon, log out, then click the Amazon icon and bam!  I'm back in!  WTF?!!  Not for me!  I hate it!!", "Title": "Not user friendly!", "Date": "February 11, 2014"}, {"Author": "Jimmy Roberts \"kathyzjim\"", "ReviewID": "R1X3LB2KWSKR4P", "Overall": "4.0", "Content": "Considering all the positive attributes of this tablet, the camera was designed by a MORON!  The camera view is of the person operating the camera.  If there is to be just one camera, it should be positions AWAY from the screen.  I will estimate less than 1% of users would use this tablet for video phone calls.  Beyond that, there is no use for a camera which looks at the operator.  Why would a tablet be built with video camera functions, and limit the video to the person who is operating the camera?  What would it cost, another dime to install a back side camera?  I suppose there is an aftermarket prizm attachment, to reverse the camera and make it usable?", "Title": "Kindle HDX", "Date": "February 7, 2014"}, {"Author": "Robin", "ReviewID": "R1JQ8CQLRYGMUA", "Overall": "3.0", "Content": "We bought the Fire HDX for my father in law for Christmas. I chose the Fire based on reviews that described it as a great tablet for senior citizens. My husband and I are both iPhone and iPad users, but I had a Fire 2 years ago so I assumed it would be easy to help my FIL learn to navigate the Fire HDX. ( I sold the Fire as soon as the iPad Mini came out!) Now I really wish we had spent the extra $100 and bought the iPad for him. The HDX is just not as intuitive and easy to navigate as the iPad. Even though I had the original Fire I have to look up answers to his questions about navigating the HDX. This is really not a fault of the Fire's capabilities, but I definitely think the iPad would have been easier for him to learn to use.  I also wish we would have bought him the bigger screen. He has arthritis and so does not have fine motor skills. He is constantly accidentally rewinding his books when he wants to press the home button which is at the bottom of the screen where the bar is that tracks where you are in the book.  We bought the HDX 7 inch because when I had him use my mini and my husband's iPad; he liked the smaller size of the mini. My advice to anyone planning to purchase a tablet for an elderly person would be to get what you yourself are familiar with.", "Title": "Kindle Fire HDX", "Date": "February 6, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R2HKIAWSHPDRKH", "Overall": "1.0", "Content": "This is our 4th kindle.  I enjoyed it while it lasted.  My kindle slipped off the arm of the couch...it was in a case but the glass still shattered. The screen will not unlock either.  My fault for letting it drop, but it did not fall that far and I was shocked when I saw it was broken.  They offered to sell me another at a discounted price, but I probably will not do it, still too much money.  I will just go back to using my old one.", "Title": "disappointed!!!  Too fragile, get an otter box if you want it to last longer than a month.", "Date": "January 31, 2014"}, {"Author": "Alan Schauber", "ReviewID": "R1QX48KYGRJ68M", "Overall": "2.0", "Content": "It is  not entirely user friendly to those who are not masters of high technology.  There was NO INSTRUCTION BOOKLET  included with the purchase of the Kindle Fire. A mistake from Amazon", "Title": "Problems in using Kindle  Fire unit", "Date": "January 30, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00CUU1CGY", "Features": null, "ImgURL": null, "Name": null}}