{"Reviews": [{"Title": "Pretty Good", "Author": "Amazon Customer", "ReviewID": "R2ROPRAQ80XN1M", "Overall": "4.0", "Content": "I was actually afraid at first to buy it because it was so cheap, but as I started to play with it didn't find too much problems with it. There was only two things I didn't like about it, first the screen quality wasn't that especially when looking on a website with a white background. Secondly sometimes things start to slow down really quickly if too much apps (like about 5) are open, but everything else about it was pretty good, wi-fi was easy to set up, apps are easy to download and it is really light. This a great first tablet to buy.", "Date": "August 24, 2012"}, {"Title": "Horrible Customer Service, actually NO Customer Service", "Author": "Ashley Sinder \"Ashley\"", "ReviewID": "R2FTP41K6Z4AJH", "Overall": "1.0", "Content": "I bought 2 of these tablets, a blue one and a pink one on October 15, 2012. They were to be Holiday gifts for my kids but we decided to give them early, due to a long drive we wanted to take on November 8, 2012. By November 19, 2012 the blue one will not boot all the way up. It freezes with the \"Android\" name on the screen. The pink one freezes and has to be force restarted multiple times a day.I have left a voice message with Visual Lands Technical support, and 1 message with the operator as the technical support mail box was now full...hmmm really?I have sent an e-mail 7 days ago with no return message and sent another today, 7 days later.I was told by Wal-Mart that after their 15 days returns policy on electronics it was then up to the manufacturer to honor their warranty. I also bought an extra 2-year warranty through Wal-Mart and of course that does not start until AFTER the manufacturer's warranty.So...my suggestion is to buy a different tablet from a different company because what kind of customer service does not call back? Also, what kind of company constantly sends you to voice mail?Very disappointing! Now I have one child with a tablet and one without. Those with kids will know that this is not going to work! I bought 2 tablets because I needed 2. It should not break in less than a month.UPDATE ONE:Finally after more than a half dozen attempts I was able to send the tablet back and then again, I could not get anyone to give me status.Two weeks later I got anew tablet in the mail...yay...NOT, that was TWO days ago.Now it freezes and won't turn on. I had to reset it the FIRST time I took it off the charger out of the stinking box! So now I am BACK to leaving messages and sending emails because this one didn't even work more than SIX hours!DON'T WAISTE YOUR MONEY THIS TABLET SUCKS!!!!!Now I am playing the customer non-existent game again!", "Date": "November 27, 2012"}, {"Title": "Good price, mixed results.", "Author": "Eric Pearson \"eric\"", "ReviewID": "R2CLTFZTE6W6XC", "Overall": "3.0", "Content": "Good tablet for price. Unfortunately, app sellers like google and amazon won't let this one download (not on their list of approved devices).Decent sound and picture. Inadequate manual and help functions. Good wi-fi reception.", "Date": "September 18, 2012"}, {"Title": "Just know what you're getting into", "Author": "Nikodem Leszek Blach \"Nik\"", "ReviewID": "R3TPZ08NBPXYLK", "Overall": "3.0", "Content": "I got this tablet seriously cheap at a local store. It was bought online I guess and then returned to the store, they didn't know what to do with it so they discounted it 75%.  So, for the price I paid, I'm not complaining.But I've used a lot of technology, from the Kindle to ipads and all that so I know a good deal about these devices.  I also use an Android phone running Jellybean so I'm familiar with the interface for the most part.The tablet can hardly run itself. To start, but that's the most negative thing about it. It'll lock up and freeze for moments constantly while you're trying to get stuff done, open applications, install stuff, and all that. I found that when I use the base launcher (not vLauncher) it runs a tad bit better but not much.But, once you have something running (Angry Birds Star Wars, Draw Something, Evernote, ect...) it runs like a champ.  This is actually the exact problem I had with my Kindle Fire (original generation) the interface was laggy and slow while the applications ran perfectly.  But this might be to a different level.This device does Not have an accelerometer. So think about that and what you'll use it for before buying it.  Second game I installed was Temple Run and that was when I discovered this.You can install the Amazon App Store on here but for me it's become corrupted after I got 2 applications from it, twice. And not like, I restart and it works, I had to uninstall and reinstall to get it to work. GetJar never works on anything ever so don't bother with it, but this tablet comes with another app store... called the #1 appstore or something? I can't remember. But that one is the best. That's where I got all the game apps listed above and they worked great, downloaded fast, all that.My Mic is completely broken on mine, likely why it was originally returned. I haven't messed with the warrenty yet but I will later today. I don't care if they replace it or not, I didn't buy this for Skype (and the camera is pretty rough quality) but I might have an update about my customer service experience.But anyway, for what I paid, this is an awesome device for youtube, pandora, games, reading and fun things like that.This is Not a great device for internet browsing (it freezes up a lot), heavy usage or business.So take that for what it's worth.  The screen creates a pretty low quality image, but again - what you paid for, the touch interface works surprisingly well with all things considered though.  The build feels nice but you'll notice while holding it firmly that the screen starts doing the blur things LCDs do, this thing probably couldn't survive a real fall and could probably snap in half if another pressure were applied.  So yeah, keep that in mind to. Probably not for a kid to throw into his backpack to survive a ride to school.Battery life is fine, doesn't get too hot, you can expand the memory and it comes with a USB to PC adapter and a mini USB to standard USB adapter to attach devices. Headphones are half-decent too.", "Date": "December 31, 2012"}, {"Title": "This device stopped working after 2 weeks.", "Author": "Steven Fradin", "ReviewID": "R1NT92YRJP4QUJ", "Overall": "1.0", "Content": "My daughter ordered this tablet, which stopped working after two weeks.  No way to fix it so she returned it.", "Date": "March 22, 2013"}, {"Title": "Visual Land tablet", "Author": "Kathy", "ReviewID": "R1UKXXHV5BGUQV", "Overall": "1.0", "Content": "This tablet was a piece of junk from day one.  I know now that it never worked properly.  After it didn't work at all, we followed the instructions on warranty card.  Don't bother with that.  The company has been jerking us around for a month with there excuses. We have nothing but piece of paper that we paid to send it back. They have the tablet and we have NOTHING>>>  I'm sure if we ever do get one it will a refurb and will crap out within a short period of time.  Save your money for something better and not from VisualLand.", "Date": "March 2, 2014"}, {"Title": "Not worth it", "Author": "Mary P Rohde", "ReviewID": "R2CD8QFUJ2TAJF", "Overall": "2.0", "Content": "I don't use this as much as I thought I would.  The browsing is VERY slow, which makes it difficult to use.  I like the Kindle app and the email, I play a few games.  I don't think it was worth the money, even though the price was not bad.", "Date": "March 21, 2013"}, {"Title": "Second time I have had to get a replacement in 1 year 3 months", "Author": "Lynn Nielsen-bohlman", "ReviewID": "R3FG2UITAD2Q99", "Overall": "1.0", "Content": "Seemed like a good tablet at first.  Started having power-up problems.  Was advised to reset to factory settings, but problem returned.  Got replacement under manufacturer's warranty.  In about 9 months another power-up problem is occurring.  It is also pretty slow, even when there are no problems.  I am glad I bought the SquareTrade warranty, but sorry I chose this tablet.", "Date": "February 23, 2014"}, {"Title": "Don't waste your money!!", "Author": "styerl", "ReviewID": "R1MX7JHK4LUDDZ", "Overall": "1.0", "Content": "I purchased this for my daughter thinking it would do everything an 8 year old needed.  Based on the specs I assumed it would be slow but it is worse than I anticipated.  It has a difficult time loading simple games and it often freezes even after disabling all of the unnecessary apps.  Two days ago it reset and while the apps are listed in settings, I cannot access any of them.  Spend a little more and buy a tablet that actually works.", "Date": "February 23, 2014"}, {"Title": "terrible buy got two and screen freezes", "Author": "Sue Mace", "ReviewID": "R35NGNPUA6H9W8", "Overall": "1.0", "Content": "I bought one and had trouble then reported it and was told to send 50.00 dollars and the tablet and they would fix it. The total cost including shipping was 65.00 after i had paid 101 to walmart for this tablet and a cover for it. I have had it back two weeks and it has frozen again and I have tried to reset it. NO go to something different", "Date": "January 27, 2014"}, {"Title": "freezes and sticks", "Author": "Paulina Crump", "ReviewID": "RB2I3WB7JU2RL", "Overall": "1.0", "Content": "from the very first time i got the product was sticking and freezing all the time!!!!...... it was not a good product....", "Date": "December 2, 2013"}, {"Title": "Tablet", "Author": "Lilly", "ReviewID": "R1IL9HVX09QU4Y", "Overall": "5.0", "Content": "This is a wonderful tablet, clear and visual view. It also comes with games with makes it quite ready to use, because I purchase this for my 7 year old cousin.I recommend this tablet for any adult or child.", "Date": "August 14, 2013"}, {"Title": "Granddaughter loves it!", "Author": "Kim Frazho", "ReviewID": "RO0XOXZKE4X5S", "Overall": "4.0", "Content": "Bought for 8 year old to use mostly as e-Reader and for games, she loves it.  Size is perfect for a little one, and it's purple, her favorite color.  Happy I bought it!  Will buy one for next granddaughter in a different color...no confusion about who's is who's!", "Date": "August 6, 2013"}, {"Title": "Love it...", "Author": "Jaan", "ReviewID": "R60FBAGJXM00Z", "Overall": "5.0", "Content": "This tablet is a good quality tablet for a great price. Love this product. its really easy to use and Connect fast to Wifi. I really recommend this product. Perfect for what I wanted.", "Date": "July 31, 2013"}, {"Title": "Great for kids", "Author": "Victoria", "ReviewID": "R3K170GTXCZHPQ", "Overall": "5.0", "Content": "I bought this tablet in royal blue about 6 months ago for my nephew who is 9 and he loves it. He has played with it everyday for the past 6 months. He loves it so much his sister who is 11 wants one now. So i ordered another one in light blue for her since her birthday is coming up in a couple weeks. My only problem with it is i noticed it only had a front facing camera and not a front and back camera, but the kids didn't seem to notice or care about that. The kids watch netflix on it and play games with no issues and seem to find all the apps they want despite what other reviewers say about the app selection. With school starting up again soon, i think a tablet will come in handy with homework and studying. I would recommend this tablet for anyone especially kids.", "Date": "July 19, 2013"}, {"Title": "If you're expecting Kindle or Nexus quality, buy a Kindle or Nexus Tablet", "Author": "A. N. Morton \"the poetic book worm\"", "ReviewID": "R3S9KRS9ZZ8C0I", "Overall": "4.0", "Content": "This tablet is a decent quality tablet for a great price. It's fantastic for college students looking to carry their textbooks or read e-books on, has decent resolution when it comes to Netflix, e-books, and games, comes with an optional $10 1 year warranty, and has great battery life when using simply for reading and/or writing. Some cons to this tablet are that auto-rotate doesn't always respond, and, depending on how many applications are open, response time is slow or the tablet may freeze. These problems are easy to solve with an auto rotate controller app (I found one on the amazon app store) and by controlling how many apps you use. These problems are problems that occur with any and every tablet including and especially on some smart phones (I have a TMobile MyTouch and it's frozen/been slow/not responded to auto rotate several times). I love my Visual Land Prestige 7 and am happy with my purchase and the goodies that come on it and with it. This is definitely the best bang for under $100.**UPDATE**Tablet comes with connector cable to connect tablet to laptop or desktop and a cable to connect a jump drive or printer to the tablet. Very convenient for homework or papers! Also, Tablet DOES come with Google Play, although by a different name: Mobile Market. If you try and download Google Play, nothing will happen b/c it's already on the tablet.I LOVE THIS TABLET.", "Date": "July 16, 2013"}, {"Title": "Good table", "Author": "Josefina", "ReviewID": "RBAZBK0M7P5N", "Overall": "4.0", "Content": "I purchased for my 10 year old daughter as a gift, great screen quality and good apps! Apps download from 1mobile market.", "Date": "December 28, 2012"}, {"Title": "Very dissappionted", "Author": "brad courtney", "ReviewID": "R2ZGXHQ0M8W88G", "Overall": "1.0", "Content": "Was not what I expected. I wouldn't recommend this tablet to anybody. It is very complicated to work and you can't download apps on it cause it sends error messages.", "Date": "January 7, 2013"}, {"Title": "Great Tablet", "Author": "Dave", "ReviewID": "R1XGUODPW10SLI", "Overall": "5.0", "Content": "I was not sure if i should buy these or not.  I got 4 of them for my kids for christmas.  They are great tablets.  I have an IPAD and cant see much of a difference speed wise between them.  Well built and they work great.  A must buy if you ae looking for an inexpensive tablet.  Found on youtube how to add google play to the machines.  Was very easy.", "Date": "January 9, 2013"}, {"Title": "Nice, inexpensive tablet.", "Author": "valkie", "ReviewID": "RWZGX7D0D1SJ2", "Overall": "4.0", "Content": "While it is not one of the big name tablets with super speed and memory, it works well. It was slow sometimes, but I expected that. Used it when traveling and was able do everything I wanted it to do and more. I like several of the preloaded apps. One problem with the listing is the battery life. I usually got only 4 hours instead of 8. It includes a charger so it didn't create any problems.", "Date": "August 12, 2013"}, {"Title": "Very good", "Author": "bonitana", "ReviewID": "RC8EVD75QWZU4", "Overall": "5.0", "Content": "The only thing that I dont like is that the camera is not double, I can only take pictures one way. But the rest of it is very good,and easy to use.", "Date": "July 14, 2013"}, {"Title": "Great tablet for the kiddos!", "Author": "campbella \"Campbella\"", "ReviewID": "R16SHEMOS11MTM", "Overall": "4.0", "Content": "This tablet works well for our children. We were able to purchase this tablet at Walmart for $89 in purple. It is a very pretty, true purple. My daughter is only able to play apps that we have downloaded for her. She does not use the internet. They seemed to download fairly quick. We haven't experienced any trouble using the apps.When we pulled it out of the box, it had a sticker on it that said it had been upgraded to jelly bean. It's interface is easy to use.The screen's resolution is definitely not as good as higher end tablets. It seems kind of fuzzy. It is very touch sensitive, but it does tend to lag.I would recommend this tablet to anyone looking for a tablet for their younger children.", "Date": "February 25, 2013"}, {"Title": "Very impressed.", "Author": "C Arocha", "ReviewID": "R2R4EG90EM557X", "Overall": "5.0", "Content": "Bought this for my husband. He loves it. Perfect for his needs. He was very impressed with the speed and grafics", "Date": "February 24, 2013"}, {"Title": "Nice", "Author": "krisnic", "ReviewID": "RXRQCXSNLX2EM", "Overall": "5.0", "Content": "Daughter uses daily, she loves it for snap chat and FB, some games etc....I love the price, shipping was super fast, not thrilled bout the FedEx man leaving out in the rain by the rd :/", "Date": "May 7, 2014"}, {"Title": "Bought it", "Author": "cruzer01", "ReviewID": "R1ZJBS9Y3JU2E1", "Overall": "3.0", "Content": "When I received the tablet, I had a problem with it my neighbor helped me with it, it didn't help, I think it had a processor problem", "Date": "April 30, 2014"}, {"Title": "it does not work if not charging", "Author": "Eudalis De Artime", "ReviewID": "R3DYC7LWMXXAPI", "Overall": "1.0", "Content": "bough this item I charged it and it was working fine but as soon as that charge ran out, I have not been able to use it with out it being connected to the power outlet", "Date": "April 17, 2014"}, {"Title": "Hidden Jewel", "Author": "Raul Rio", "ReviewID": "R39SSXGZAQYWEL", "Overall": "5.0", "Content": "It is really a matter of personal preference. You could spend $400 or more for a recognize brand tablet that at the end of the day will do exactly the same than this one.If you are a brand-recognition-ultimate-in-technology kind of consumer, do not purchase this tablet. If on the other side, you are a regular user, go ahead by all means. Price is great, resolution is excellent, fast and with many applications. I would definitively recommended.", "Date": "April 1, 2014"}, {"Title": "Don't waste your money.", "Author": "Nitara Deratany", "ReviewID": "R1HDQIFDHLMEYA", "Overall": "2.0", "Content": "Very disappointed with this tablet. It had good reviews so I felt good about purchasing it and was just looking for something simple. It took longer to ship than I expected. Then it would keep shutting down or freezing, and every time I'd boot it back up, all my saved apps and information would be erased! This happened about three or four times in the first month! Once I finally got it to stay on, it was okay. However, the screen quality isn't that clear and even when adjusted, images still look grainy. Also, slow to boot and freezed frequently. I didn't even have that many apps on it yet! Now, after a couple of months of having it I can't get it to turn on even after charging it for the last couple of days via computer and wall outlet. I'm so disappointed with the quality of this product and would highly recommend spending a few more bucks for a better quality tablet.", "Date": "March 21, 2014"}, {"Title": "BIG WASTE OF MONEY!!", "Author": "Rosalind Zidon", "ReviewID": "R3MCDIPKM0N8NZ", "Overall": "1.0", "Content": "I wound never buy from Visual Land again! This tablet is so slow and freezes all the time! I bought one from Amazon and they returned it with no questions asked. I also bought two from Walmart and they won't return them because I had fifteen days after purchase to return them to the store. They were Christmas gift so needless to say my days were up before Christmas was here. Walmart told me I have to go through Visual Land for my return. Visual Lands customer service was very rude, mouthy and hung up on me. Do not buy from Visual Land if you want a product that works and dependable! I will be replacing the Visual Land for Kindles!", "Date": "February 24, 2014"}, {"Title": "Can be Rather Slow", "Author": "Mrs. Wanz", "ReviewID": "R3VYIF9JG3YZO0", "Overall": "3.0", "Content": "I've had this tablet for quite a while now and I have had to do a factory restore on it once, but it's really rather nice, I can go 4-5 days usually without putting it on the charger when all I'm doing is reading e-books. If I play games, get on facebook, or Netflix, I can usually get about 6-8 hours with it. Overall, I am satisfied with what I paid for.Update: After having this tablet for several months now with no real issues all of the sudden it will not power on. I recently had my daughter by c-section and had took it to the hospital with me for something to do. I been using it to read an e-book before I went into surgery and it was fine, then after I had got out of surgery and had rested up a little, I attempted to go back to the book I was reading only to have it not power on for me. It was fully charged before I went into surgery, but I put it on the charger anyways to see, I attempted to push the \"Reset button\" on the back, nothing... Now I don't have my tablet and I have NO CLUE why it just stopped working for NO APPARENT REASON...", "Date": "February 24, 2014"}, {"Title": "Great value", "Author": "Gabrielle Williams \"Novel Goddess\"", "ReviewID": "R19FM19B5A5E7S", "Overall": "4.0", "Content": "Very great value if you bought it in November.  Prices seemed to go WAY up in December.  Made for a great gift!", "Date": "December 27, 2013"}, {"Title": "Order one color..received another", "Author": "Irene I.", "ReviewID": "R3T0Y52ENXBAKR", "Overall": "1.0", "Content": "Ordered for my 4 yearcold birthday.  He loves the color blue... Packing label said blue but tablet is red.  Purchased a blue bumper to conceal.  Was disappointed and freezes a lot.", "Date": "December 15, 2013"}, {"Title": "Good for the value it has.", "Author": "Jonathan Monestel V", "ReviewID": "RFJV523IG53L5", "Overall": "5.0", "Content": "So far is a great tablet. I bought 2 and they are working great.Just keep in mind that this is a low end tablet so it is not as fast as an iPad or Samsung Galaxy Tablet.It works for children to play and use games.", "Date": "December 4, 2013"}, {"Title": "Works for me!", "Author": "Pamela J. Bulger", "ReviewID": "R35ILTYJGQFLZE", "Overall": "4.0", "Content": "I bought this mainly as a means to having a tablet for recipes in the kitchen.  The only problem I had initially was that it did not accept the normal USB interface.  I checked Staples and found a USB to Mini USB cable.  This enables me to connect the tablet to my laptop to download all of the recipes that I have on file.  Works for me just fine.", "Date": "December 3, 2013"}, {"Title": "It's ok.", "Author": "Rachel Peterson", "ReviewID": "R3GZPNFZW6W1KZ", "Overall": "3.0", "Content": "It works fine for the price. Does not run very quickly on the WiFi. They sent the wrong color as well.", "Date": "December 3, 2013"}, {"Title": "Bad Internet connection!", "Author": "Tracie", "ReviewID": "R2X2FMNJXWLNU0", "Overall": "2.0", "Content": "I bought this for a gift for my daughter and we have an issue with it not ever wanting to connect to the Internet.", "Date": "November 30, 2013"}, {"Title": "Great !!", "Author": "Renee", "ReviewID": "R3FY1PIPRR32VM", "Overall": "5.0", "Content": "definitely going to order another! Very nice product was everything it said it would be! Met all expectations!  Love it!!", "Date": "November 14, 2013"}, {"Title": "Awesome Item!!!", "Author": "Lois C.", "ReviewID": "R2X0L9FVBDY8DL", "Overall": "5.0", "Content": "The item was exactly what I expected,arrived on time and my 11 year old can use it with ease. Thank you.", "Date": "November 5, 2013"}, {"Title": "Pretty Slow", "Author": "Evaristo", "ReviewID": "R1ICTCHKXREWPC", "Overall": "2.0", "Content": "The android system for this tablet is very slow, although I get it for my niece and she will have a lot of fun with it, I think it can be a little bit faster.", "Date": "October 2, 2013"}, {"Title": "It's Slow", "Author": "Chaune", "ReviewID": "R3BUODBV6ELDLY", "Overall": "3.0", "Content": "I brought this for my 3yr.s old for her birthday.  It is too slow for her liking.  She is use to playing with the family members smart phones that are much faster.  The first few days it was not working right.  It would freeze up, give messages like 'your phone can not open this file'.  It is what it is worth.", "Date": "September 14, 2013"}, {"Title": "very slow", "Author": "Maen Abu-Tabanjeh", "ReviewID": "R3EJ22Y8L0QW9E", "Overall": "1.0", "Content": "bad resolution ,  very slow although its 512 MB , but not good and very slow i did not like it , and you can not downgrade its OS", "Date": "August 25, 2013"}, {"Title": "Great Value until the screen randomly breaks", "Author": "VeXx", "ReviewID": "R1F4HKMURFEA76", "Overall": "1.0", "Content": "had to tweak a few things with the launcher and such. also is a newer model than the prerooted model i was looking for but im happy non the lessEDIT*************COMPLETE CRAP!!! after a few weeks of use the internal screen broke. i have no idea how it happened but now its completely unusable just called to send it in for repairs and even better got a reimbursement thanks to square trade warranty", "Date": "July 13, 2013"}, {"Title": "Could be better", "Author": "Nick Smith", "ReviewID": "R1SM69ZRJ6W7J9", "Overall": "3.0", "Content": "To start, it DOES NOT have Google Play and you can't just install it from .apk because it won't work (I tried).  So i installed the Amazon Appstore, which is better than 1Mobile Market or Getjar (which the tablet comes with) and has most of the apps from google play, but some of google's free apps aren't free through amazon :( It tends to freeze temporarily a lot.  I noticed that it doesn't work very well with a capacitive stylus...", "Date": "June 18, 2013"}, {"Title": "Perfect for our use", "Author": "VS", "ReviewID": "R2WQ7HH7IOHU2E", "Overall": "5.0", "Content": "We bought this for our children to play games. They are all under 10 and luv it. We like it not only for game play but also for surfing the internet. This is bigger than our phone screen & quicker than pulling out the laptop. Very pleased with this tablet.", "Date": "June 11, 2013"}, {"Title": "Not what itq described as", "Author": "honey n nj", "ReviewID": "R2W5A522BCI02Z", "Overall": "2.0", "Content": "Can't download apps from Google or  Amazon, very slow and freezes up, very disappointed got as gift for mom, now what do I give her. Sunday her birthday, been working on this since delivery Thur. returning, can't deal with this.", "Date": "March 30, 2013"}, {"Title": "my daughter loves it!", "Author": "Sarah Harrold", "ReviewID": "R1RRHVTHN95VTD", "Overall": "4.0", "Content": "Bought this for my daughter's 7th birthday.. She LOVES it.. I had no problem setting up the wifi & installing apps from Amazon.  She mainly uses it to play games and i was able to get all the games that she likes to play on my iphone.  She also likes to play with the camera.  No problems yet.. Great little tablet for the price and exactly what I needed for my daughter", "Date": "January 15, 2013"}, {"Title": "Not as good as a kindle", "Author": "April K. Schoen", "ReviewID": "R20ERL2FDFK3ZI", "Overall": "3.0", "Content": "I thought it would be a great thing for my 9 yr old. The apps from amazon didn't run well at all. I found it difficult to run. It ran slow and some of the apps didn't load or play. Very stylish and all, but did not live up to my expectations. For some it may work, but I sent it back and just ordered her a kindle fire.", "Date": "January 11, 2013"}, {"Title": "for young ones...seems great", "Author": "Donna Huntsman", "ReviewID": "R30XTWNZOW2W8A", "Overall": "4.0", "Content": "so far it is working great. a little slow to touch and some games I'm having trouble downloading but for the price and for our three young girls they are working great.", "Date": "December 29, 2012"}, {"Title": "Very Good So Far", "Author": "Mary Dean", "ReviewID": "R2MLDQC1IDC3DL", "Overall": "5.0", "Content": "I got this for Christmas for my granddaughter. So far she has been pleased. It appears to meet my expectations. As long as she is happy with her tablet, then so am I.", "Date": "December 29, 2012"}, {"Title": "Surprised at how great it works", "Author": "Aimee", "ReviewID": "R29GT6YV41AYLS", "Overall": "5.0", "Content": "I purchased 2 tablets for my 2 little girls and was not expecting much, since the price was so low.  I bought them because of the different colors.  I purchased a pink and magenta tablet that came with the case.  I fully charged the battery and was ready to go.  It is very easy to use, connects to Wi-Fi without a problem.  My girls are able to walk around the house as they are watching Netflix or playing their games on them.  Both have dropped the tablet many times and the case works very well to protect it.  Also they love the vibrant colors.  I was able to go online and download some educational games for them.  All in all I am 100% satisfied with this purchase.", "Date": "July 31, 2013"}, {"Title": "Inadequate instructions", "Author": "Muddy", "ReviewID": "R3OEH5PABTJH41", "Overall": "2.0", "Content": "The product arrived later than I expected.  When I charged it up, it didn't hold the charge.  When I tried to learn how to check the \"manual\", I found little I could understand.  Finally I found the icon that said it was the manual found it impossible to use.  I couldn't read it and work on the product at the same time.  I would like to have a hard copy of a usable manual so I can learn to use it.", "Date": "August 13, 2013"}, {"Title": "Don't go by the photo!", "Author": "Lindsey Knapp", "ReviewID": "R1QRWAOWWH8BEX", "Overall": "3.0", "Content": "Shows features in the photo that are not actually available. When you receive the box it explains this to you...", "Date": "July 30, 2013"}, {"Title": "Can you say \"FREEZE to FROZEN in time\"..", "Author": "SongbirdM", "ReviewID": "R15B2FSJ05EUWC", "Overall": "2.0", "Content": "I bought this VISUAL LAND PRESTIGE 7L INTERNET TABLET my purple beauty a little over a month ago because it was in my price range for a beginner \"tableteer\", was pretty excited to show it off, now I don't know what to do with it. It took me forever to figure out how to load apps and the manual wasn't any help but once I was able to get the apps I wanted and able to play them I was pretty happy with this tablet. Okay, but now the WIFI slider/button is stuck or if you can get it to the \"on\" position in about 5 seconds it automatically goes back into the \"off\" position which in turn does not connect with my WIFI. So I have a product that I can't use, will be taking it to a computer company because Walmart only gives you 15 days to return on electronics (hmm..wonder why)which I think is poor customer service and lack of responsibility when selling merchandise to the consumer, HEY IF YOU CAN'T STAND BEHIND THE MERCHANDISE/PRODUCT IN YOUR STORE, THEN WHY SELL IT???. After reading the reviews about the manufacturer's costumer service or lack thereof, I think i'll just eat the loss if they can't fix it and look for a more reliable tablet with better satisfactory customer service and reviews. If anyone has a suggestion on how to remedy my problem with the WIFI switch to be able to be put in the \"off\" or \"on\" position when I want to use it, I would greatly appreciated.", "Date": "July 8, 2013"}, {"Title": "Horrible", "Author": "Robert Delahunt", "ReviewID": "R3A1L43B07EF4R", "Overall": "1.0", "Content": "It was good at first.  Skype worked and the tablet worked, at first.  The case is still horrible.  It covers the headphone and charging covers and pushes down on the volume - button.Then I tried to use 1App or whatever the default Amazon store is.  Amazon's store for android is horrible.  No matter what i search for on the Amazon store for android, I get like 5 sex application results.  Really, Amazon?!  I don't even use the tablet for anything even remotely risque!Then you can't install Google Play store.  It refuses to let you.  Even if you surf directly to the apk file and install it, it crashes upon startup every time you run it.  I suspect that Amazon has poisoned this Android tablet against Google Play.Then when I use a 32GB microSD with all my MP3s I purchased at Amazon.com, the music application started crashing for no apparent reason.  I synchronized the MP3s with my computer again to ensure none of them were corrupted, only for it to continually crash.Their customer service takes forever to return emails.  When they do, they don't tell you how to root it or re-image it with the original image.  I know because I had to do a factory restore to fix the music application problem.  They refused to tell me how to root it (I even told them that I know that this voids the warranty).  This isn't good because I can't do away with their garbage application store by going to a default Android or Cyanogen-Mod ROM, and because they won't give me the original factory ROM (the restore doesn't put the original factory ROM on it, it puts a stripped-down amazon-poisoned android ROM on it).All in all, I highly recommend that unless you plan to only use it as a Skype tablet or for light internet searching and browsing that you don't buy it.  Buy something with much better reviews on NewEgg.", "Date": "May 11, 2013"}, {"Title": "Quit working - poor quality", "Author": "Jonathan Encarnacion", "ReviewID": "R2CUCPGRHVW4A3", "Overall": "1.0", "Content": "The device is poorly made.  Very bad sound, clumsy menus, and the software is full of bugs.This particular unit quit working after one week of light use and it is getting returned.  When I power the device on, the android logo appears on the screen and it wont go away even if restarted.  Got what I paid for here.", "Date": "January 5, 2013"}, {"Title": "How to acces the internet everywhere?", "Author": "Jenn490", "ReviewID": "RVLNWFGJYAGKD", "Overall": "3.0", "Content": "I bought this for my boyfriend for his birthday. But hes been having problems getting on the web everywhere with it. Does anyone else have this problem? If so any suggestions on what we should do?", "Date": "December 4, 2012"}, {"Title": "WRONG COLOR", "Author": "Melissa M.", "ReviewID": "R1XHD6T27RIE3I", "Overall": "1.0", "Content": "I ordered ROYAL BLUE and I got PINK.  This was bought for a 12 year old boy.  Rather than deal with having to send it back and the fact he was already playing with it, I decided to just buy a cover for it.  Still pissed off though.  Even the packaging and paperwork said ROYAL BLUE.  How do you mess something like that up????", "Date": "November 2, 2013"}, {"Title": "It stopped working after 3 weeks.", "Author": "Clemencia jimenez", "ReviewID": "RHEEQBOWWDSC0", "Overall": "1.0", "Content": "The table was good at the beginning, but after three week, it just stopped working. I will never buy anything for this site again.", "Date": "October 7, 2013"}, {"Title": "great for  school", "Author": "william rodriguez", "ReviewID": "RZDEFOFYE16R", "Overall": "5.0", "Content": "easy to t use  fit great in your bag its not bulky the android programming makes it easier to with wifi", "Date": "June 20, 2013"}, {"Title": "Crap", "Author": "jenniferkchil", "ReviewID": "R2NNNTJ0B7Q0PR", "Overall": "1.0", "Content": "Do not purchase! This is the worst tablet I have ever seen. Graphics are horrible and my son had it less than a month and it is already broke. A total waste of money. Also it froze up continuously. I honestly don't know how companies can get away with selling these things.", "Date": "May 18, 2013"}, {"Title": "wasted money and time", "Author": "Amazon Customer", "ReviewID": "R3L3PQP23DRN6J", "Overall": "1.0", "Content": "I purchased two of these tablets.  One lasted only 1 month, the other 1` 1/2 months.  This was a very disapointing product.  They simply refused to boot up one day.  My children saved their money for months and were only disapointed.", "Date": "March 6, 2013"}, {"Title": "No power and overheats./No enciende y se sobrecalienta.", "Author": "Miguel", "ReviewID": "R3GHIB7ILUYEG9", "Overall": "1.0", "Content": "I write from Venezuela, this Christmas buy the tablet, I found a good price, now try to connect on and noticed the temperature rises on the back, to the point that the plastic is softened in a sector. also fail to get the headphones in place.  The costs to enforce the guarantee, is too expensive.I think I lost my money.Escribo desde Venezuela, esta navidad compre la tableta, me pareció un buen precio, hoy trato de encender y al conectar  noto que aumenta la temperatura en el lado trasero, hasta un punto que el plástico se ablanda en un sector. también la auriculares no logran entrar en su lugar. El envío para hacer valer la garantía, es demasiado caro.Pienso que perdí mi dinero.", "Date": "January 16, 2013"}, {"Title": "broken speaker, kept shutting off", "Author": "wilburwil", "ReviewID": "RZZ018D9A3MFC", "Overall": "2.0", "Content": "bought two of these, opened first one, turned it on, speaker making horrendous noises, would not stop, opened second one , to gift, checked it out, it just kept turning off on me, returned them both", "Date": "November 22, 2012"}, {"Title": "Death at arrival", "Author": "Kasia", "ReviewID": "R16GHLMZ42WEH8", "Overall": "5.0", "Content": "I purchased this one but never powered up, then I replaced and purchased the VL Prestige 10'  and now I am happy it happen as it is so much better , faster with better screen , I updated the vlouncher with Go Launcher HD and it transfer this tablet to a new fast device, Visual land tablet can use amazon app store as well but are not supported on Goggle Play , Amazon App store have mostly all popular apps you will need to improve your tablet as the original vlauncher suck visually, you can use the last Skype app that works well and other as facebook and youtube on side with many other popular apps , also I changed the browser to Dolphin's free mobile browser that have great features and speed up browsing , little tweaking will make Visual Land tablet a better device and I love it !", "Date": "October 19, 2012"}, {"Title": "Missrouted item: No rating", "Author": "Amazon Customer", "ReviewID": "R8HP0QTDLFZ6A", "Overall": "1.0", "Content": "It never reached me. I never got it, It was missrouted and I an still awaiting compensation. So therefore I am not able to rate it.", "Date": "December 24, 2013"}, {"Title": "Wrong color", "Author": "char k", "ReviewID": "R2ODIIJG3ZRQNS", "Overall": "1.0", "Content": "I ordered one red and one royal blue, ended up with two red ones.  I don't trust them enough to send it back, I'm too afraid of having issues before Christmas.  It will be an easy fix with cases but it is disappointing not getting what you ordered. Pay attention people!", "Date": "November 8, 2013"}, {"Title": "Save your money", "Author": "S. Oliver \"s1oliver69\"", "ReviewID": "R3UJHS3236RWU5", "Overall": "1.0", "Content": "My younger two kids got these for Christmas and we've had nothing but problems from the start. The apps open and then close so you have to restart the device and start over and if you're lucky that might work. The bottom line is I wouldn't pay $5 for two of these so save your money and just buy a Kindle or Nook tablet that really works and will last several years if you don't want to spend ipad money.", "Date": "December 27, 2012"}], "ProductInfo": {"Price": "$79.99", "Features": "Android 4.1 Jelly Bean, 7.0 inches Display\nAll winner ARM CORTEX A8 OMAP 3 1.0 GHz\n8 GB Flash Memory, 0.5 GB RAM Memory\n8.0-hour battery life, 0.66 pounds", "Name": "Visual Land Prestige 7L - 7inch Tablet with 8GB Memory (Royal Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41vU3M7D3zL._SX300_.jpg", "ProductID": "B00CSKL5JA"}}