{"Reviews": [{"Author": "Hussain Ahmadi", "ReviewID": "R1G4NZN44NTGCL", "Overall": "4.0", "Content": "I got the this new awesome device recently and its been more than a week that I used it so I’d like to share with you all my thoughts about it. First have to say that I’m an owner of Kindle Fire (1st generation), iPad 2, iPad 3, iPad Air, Google Nexus 7 (2012), Samsung Galaxy Note 3, Samsung Galaxy S3, Kobo Arc and few more tablets that I have used in the past but those mentioned are still being used. So in my review I will be comparing this tablet to the others that I have where necessary.HARDWARE:I have to say that Amazon nailed it when it comes to the hardware of the device. The tablet feels very comfortable in hand, with its rubbery back. but the main attraction here is the gorgeous display. It is so beautiful, very clear and crispy. Even though the Kindle shows a slightly more yellowish whites compared to the iPad Air whites but the colors look slightly better to the eyes on the Kindle than the iPad. at least to my eyes. Tested many pics on both and Kindle had that slight edge when it comes to how pleasant the colors look. I have even read that many professional sites have already declared the Kindle as the more accurate tablet when it comes to colors than the rest, not to forget also that the Kindle is lighter than iPad Air. Another advantage that goes to the Kindle over the rest tablets is the sound, with dual speakers placed at the right places it just gives a very strong and pleasant sound makes your music and videos sound a lot better. The placement of power and volume buttons are odd at first but you will get used to them fast. Cant say much about the camera because I do not use tablets for taking pictures.SOFTWARE:I will write more about the software as I have not seen this enough covered by other reviewers. I will write the things I like and dislike when it comes to the software:Things I like:1- Special offers: yes, don’t raise your eyebrows. I just love it that whenever I want to unlock my Kindle there is something new rather than a boring wallpaper. I find the offers interesting and I hope Amazon show more book ads. they just look gorgeous on full screen.2- The Carousel: Big icons on a high resolution screen look really beautiful and you can remove whatever you don’t want to be there. A nice thing Amazon implemented was the suggestions below the books and apps in the carousel. I find this extremely useful.3- Email: I find myself using this email more than the other tablets for the following reasons. The following points might be small bits but to me they make the Kindle Email superior than the rest:  a- Conversation Mode: Where you see the whole email conversation with a particular account. Yes the iPad also got this but in Kindle it is way more organised.  All the conversation are in one page and you don’t need to click back and forth to read like the iPad, with just one click you can view one and hide rest. really cool.  b- Multiple Selection: Again this is available in all the tablets but it is superior in Kindle’s email. you can select the emails and you can even open one while the the selection is made and all that without erasing your selection. Very very useful. Many times on iPad when I select multiple emails to delete then I decide to check one of them my selection just goes and I have to reselect again. With the Kindle this does not happen anymore.  c- Zooming: This applies to emails written  directly and not within HTML frame or CS. On the iPad when I zoom the text I have then to move the cursor left and right to read the zoomed text. annoying to do that. On Kindle’s email when I zoom the text, the text just gets bigger and fits the page view nicely. No more do I need to go left and right.Really great job Amazon with the email.4- Implementation of Goodreads in the Kindle is the right direction towards making the Kindle tablet a true E-reading device. However, this implementation is not full and lots of things were left. For example you cannot update your reading status of a book. Amazon should address this along with goodreads to make this implementation fully functional so that I don’t need to go to goodreads website from the browser.5- Text to Speech Voices: The text to speech voices on this tablet is the best ever in the market. period. Unlike Apple’s dreadful robotic voice Siri or Samsung’s scary Voice on the kindle provide the most natural human like voices. I love all the four UK and US voices. It is very nice of Amazon to provide different options for the user to choose according to his own likings unlike Apple which only gives us one horrendous voice on the iPad although on its mac OS Apple has so many great voices to choose from.7- Recently opened Apps menu: With the new OS Amazon has introduced the new history menu that could be pulled up from within any application. This makes the multitasking easier and at one finger point.Things I don’t like:1- Book description: This was the major letdown for me with this Kindle. I had to dig and ask a lot to see how I could get to the book description of any book purchased from amazon. First you have to download the book. then open the book, then tab on the three lines on the upper left side to access the left side menu then click on the cover that appears there to see the description. phew!! Come on Amazon you have to do it better than this. on the Kindle Paperwhite you just tab and hold on a cover and the menu shows the book description whether the book is on your cloud or already downloaded to your device. I strongly feel this is a very important thing to us readers as it will make us decide which book to start reading. Amazon should really make the same kind of menu accessible on the carousel as well as in the device and cloud pages of books. THIS IS VERY VERY IMPORTANT. Have to mention that even Amazon’s iOS app lacks this feature while both other e-reading apps like Nook and Kobo have their book description in a very easy and nice way.2- Silk: it is a functional browser with all the basics however what I don’t like about it is that when you have more than two tabs opened the tabs keep reloading as if you were doing a page refresh! Why is that? maybe something need to be done in the settings? no idea but this tab loading is annoying and it prevents me from browsing the net specially when I want to open multiple tabs.3- Sometimes there is a slight lag when going through the carousel and this lag happens particularly when the device downloading something like a book or an app. It should be addressed.4- When I make multiple purchases on my computer and choose the HDX as the device for my books to be delivered to there is something wrong happens. I think sometimes the download in the device gets stuck and i have to remove all the queued book and redownload them again. This happens when I do that more than 10 books at a once. but when in batch it goes smoothly. So Amazon should address multiple book download pushes from other devices to the HDX.5- Text to Speech accessibility: I think all the books that support text to speech should have the play button within. Why do I need to enable accessibility in order for the kindle to read the book to me? This is annoying. I don’t need accessibility enabled. I just need one play button in my book menu for the kindle to read it. Moreover, there is no short cut for accessibility. Not that I know. i have to go into settings and enable it there every time I want kindle to read to me. On iPad there is  the option to press the home button 3 times to enable it. Kindle should use a similar shortcut or even better make the play button available within the books without the need to enable text to speech from accessibility.6- Definition and Speak buttons: While kindle has the definition option within the book it lacks it in the other parts of the OS and apps. on the iPad you can highlight a word and get the option of the definition or the word to be read to you. unfortunately kindle does not offer this feature not even in its Silk browser.7- Sideloaded apps: This is not Amazon’s fault but had to mention it. When you sideload an application the icon of the application looks blurry in the carousel. This has to do with the icon's resolution being not high enough as the apps we get from the Amazon store. Not a big deal but yea it is annoying.So as you can see the things I don’t like are all software based and with the right update and tweaks Amazon can make this great tablet better. Among the things I don’t like I specially find No.1 and No.5 the most that goes in my wish list of being addressed sooner than later.This device is really good. it has so many other good features like the Mayday, Freetime etc but I personally won’t be using them.I also hope Amazon work with Google in future to offer Google apps like Youtube etc on their store. I know there are alternatives but to get the official app is always  better.I find the Amazon Kindle Fire HDX with its ultra HD resolution and great text to speech voices to be THE TABLET any reader should get. You cannot go wrong with it. I prefer it over the iPad Air or mini for reading books. The HDX along with the Paperwhite are winners all the way if reading is the main purpose. I would give The Kindle Fire HDX 8.9 a 4 out of 5. with the right updates that rating should go up. I will update this review in the future the more I use the tablet.", "Title": "Kindle Fire HDX 8.9, The best tablet in the market for readers", "Date": "December 1, 2013"}, {"Author": "TK1244", "ReviewID": "R87XVGDVM98BY", "Overall": "5.0", "Content": "This is a christmas gift for my mom.  She lives in a rural area, and I wanted her to have 4G thru AT&T; because my tablet receives great service at her house.  I went through all the push-ups on the new Kindle HDX to add a line to our existing AT&T; account as prompted thru the Kindle.  I received an email with a web order ID and still spent 2 hours+ on the phone (between 3 very friendly and helpful reps and transfers) to get it activated.  Save yourself some time - skip the on board instructions and just call 1-888-444-4410 and go straight to the source for adding a new line with a data plan to your existing service.  Hope this helps someone stay off the phone for a bit!!!", "Title": "4G thru AT&T;?  Please read and save yourself some time!", "Date": "December 12, 2013"}, {"Author": "rpv", "ReviewID": "R2I3VNAB8T2CDZ", "Overall": "5.0", "Content": "Overall Summary: Kindle Fire HDX 8.9 is an awesome hardware and has an excellent software system if you are on Amazon ecosystem.Broadly I see different categories of people in vertical basis- by size: phones (4-5\"), mini tablets 7-8\", tablets 9-10\"- by OS: Android, iOS, FireOS and maybe Windows 8- by cost: cost conscious and gadget freaks who have no care for the money and pile it on the plastic card- by disease: who have TACS [ Tablet Acquisition and Craving Syndrome ]SPEC COMPARISON:To begin, let me deep dive into specs of a broad range of top tablets as of now. -- Kindle Fire HDX 8.9\" Samsung Galaxy Note 10.1\", iPAD Air 9.7\", Samsung Galaxy Tab 3 10.1\", Google Nexus 10\" and Samsung Galaxy Tab 3 8\"I am throwing in the Tab 8 as I feel there will be a segment of people who are inclined for it in favor or HDX. Reading the specs for WHAT matters to YOU most is critical. I know for some people, the weight matters, for some size. For some the SD card is a deal breaker. So read on..key_specs of leading tablets as of 2013: { model: resolution, ppi, CPU, RAM, Flash memory, SD_card,  camera spec, weight, OS_type, size, charging/sync port type, GPS:y/n }Kindle Fire HDX 8.9\" model:  2560 x 1600, 339 ppi, Snapdragon 800 2.2 GHz quad-core, 2 GB RAM, 16/32/64 Flash Memory, No microSD card, 8MP rear-facing camera, front-facing 720p HD camera,  374 grams, FireOS 3.0,  9.1 x 6.2 x 0.31 inches, microUSB, GPS:no [cellular versions have GPS]Samsung Galaxy Note 10.1\" 2014 Edition: 2560x1600, 299 ppi, 1.9GHz Samsung Exynos 5420 Quad-Core Processor, 3GB RAM, 16/32 GB Flash Memory, microSD slot:yes(upto 64 GB), 8MP rear camera and 2 MP front-facing camera, 560 grams, Android 4.3 Jelly Bean OS, 9.57 x 6.75 x 0.31 inches, microUSB, GPS:yes. S-Pen (flagship),iPAD Air 9.7\" (2013):  2048 x 1536 resolution, 264 ppi, A7/M7/64 bit processor,  Flash Memory: 16/32/64/128 GB, SD Card:no, 5 MP back, 1.2 MP front, 469 grams, iOS 7, 9.4 x 6.6 x 0.29 in, lightning port, GPS:no [cellular versions have GPS]Samsung Galaxy Tab 3 10.1\" model: 1280 x 800, 149 ppi, Intel Atom 1.6GHz Z2560 dual-core processor, 1GB RAM, Flash Memory: 16/32GB,  microSD slot: yes upto 64 GB, 3.2MP rear-facing, 1.3MP front-facing, 510 grams,  Android 4.2.2, 9.57 x 6.93 x 0.31 in,  micoUSB port:yes, GPS:yesGoogle Nexus 10\" model: 2560 x 1600, 300 ppi, CPU: Dual-core A15, 2GB RAM, 16/32 GB, SD:no, rear:5 MP, front:1.9 MP, 603g, 10.4\" x 7\" x 0.35\", mcroUSB, GPS:yesSamsung Galaxy Tab 3 8\" model: 1280 x 800, 189 ppi, Exynos 1.5GHz dual-core processor, 1.5GB RAM, Flash memory: 16/32GB, microSD slot: yes upto 64 GB, 5MP rear-facing, 1.3MP front-facing, 309 grams, Android 4.2, 8.26 x 4.87 x 0.29 in, microUSB port:yes, GPS: yesYou should come up with three top three specs you want and should be able to nail it down with the above spec. If you have doubts shoot me a comment, I can help!HOW IT FARES WITH COMPETITION:The screen size is a bit odd at 8.9\". Every hardware manufacturer seems to have a pet with different sizes.  Three things about the Kindle HDX that are outstanding are  the screen resolution, resolution, and resolution. Stunning is the word to describe it.  HDX  is what Amazon calls beyond HD screen resolution. Sound is also awesome with Dolby Digital Plus audio+dual stereo speaker+microphone. I like the fact that Amazon Kindle Fire HDX 8.9\" has a standing Leather Origami case aided with camera assist. Sliding the case triggers camera app.I have seen screens of all the tablets I have spec above and HDX 8.9\" color, contrast, vivid nature of screens definitely outperforms all. This is mainly because of the LCD technology used by Kindle surprisingly beating out  even iPAD air. This has been verified by lot of gadget blogs in gory technical details. Google Nexus model currently in the market is an aging technology (yes, 1 year lot of new things happen in technology).Fire OS 3.0 on Kindle HDX is tightly integrated with cloud, has enterprise software. Fire OS 3.0 is Amazon's forked Android operating system.  It is extremely media centric and cannot be compared to iOS and Android. I feel it is comparing apples and oranges. If you are a media hound, get Kindle HDX. You will not be disappointed. If you are someone who likes to root, hack the OS, develop apps, get the Android. If all you care if design and are immersed in iTunes you know what to get.GENERAL TAKEAWAY:Excellent for browsing/reading emails/reading books. Solid Amazon media devices, this is not a Android tablet. Lot of my friends are confused and have vastly different expectations of Fire HD or HDX.  One thing do bear is mind, Kindle Fire devices are NOT Android devices. Amazon has changed the core of Android front end so that it is significantly different. As long as you understand it and have that in mind, you are good to go. For a large number of people in the world, this does not matter. The UI for example is centered on Amazon experience - books/music/video you have purchased on Amazon. If you live breathe Amazon like me these days, Kindle Fire HDX is plain awesomeness.SCREEN RESOLUTION:Just awesome. Period.SPEED:No issues, I streamed a movie in HD, no stuttering, no stops. It was a smooth experience. The quad-core processor should definitely help. Played few video games, not much heat/issues noticed.MEMORY:On the RAM front 2GB is plenty, no complaints.  However, having no SD card is a bummer for many of the vendors. Apple/Amazon/Google all of them don't have microSD card slot. Can you see a trend. All of them are cloud providers (iTunes/Amazon ecosystem/Google ecosystem) and they will each benefit if you buy books/music/video from them and not bring your own collection onto an SD card. In this respect Samsung is great as you can have multiple microSD cards ($50 for 64 GB) and use it as you wish.EASE OF USE:Very easy to use. It's a Amazon media device. Some people call it a Sears catalog for 21st century. Whatever, the gorgeous hardware makes it easy to consume media. It is a media consumption device. For amazon lovers this is just breathtaking - the interface and the User Experience. Books/Music/Video/E-Commerce absolutely just suits.APPLICATION ECOSYSTEM:Again bear in mind, this has Amazon app store, not Google Play store. What this means to you. Most of Google services apps will be missing-- Gmail, Chrome, YouTube, Google Earth, Google Maps, Google Drive, Google Calendar, Google Translate. Amazon has its own browser/email apps. For someone who has not purchased a tablet before, this is a great start. If you are used to an Android device for several years, this may send you a shock ripple through your spine. So beware of these limitations. Few other missing things obviously include Google Now and Google voice based Navigation (GPS is absent in wifi model, so this is obviously moot, but in cellular models this applies).  Amazon app store has most of prominent apps, so this is not a `big' concern.If you have bought apps in Google Play store, you have to buy them again in Amazon ecosystem - their appstore. All updates takes longer in Amazon to roll out than in Google playstore. Again these may not matter to a general public. People have debated if the absence of Google Playstore is due to Amazon's policy or google's policy of unbranded device. In either case, I feel customers are at a loss.BATTERY:I have not used extensively, so cannot comment. In my several hours of use, I did not find any major issue. Will report as I test for few weeks.USEFULNESS:Very useful if you are in the Amazon ecosystem. It is really lightweight and it is a great strength. Handholding books is not that painful anymore. Watching Prime videos on long road trips is a big plus. The resolution and text is awesome for reading books. It almost feels in a surreal way that the books are more real than a hardcover. X-Ray provides more detailed contextual information for books/music/video. I don't use it that much as I like not to be distracted. Mayday help is also something I have not needed yet. This is mainly meant for new people and it will be definitely a hit with first timers.  Overall I give the Kindle HDX a definite recommend if you are on the Amazon ecosystem.Do ask me questions, I love to answer questions from readers of the review.", "Title": "Exceptional device for Amazon ecosystem", "Date": "November 7, 2013"}, {"Author": "burghboy", "ReviewID": "R9C5FFLFAGFF3", "Overall": "5.0", "Content": "I normally do not post reviews as most of the time I am not that impressed with a product to take the time to write about it in detail.  This is the exception The Kindle Fire HDX 8.9. I have had all of the previous versions of the kindle fires and thought they were good for movies, books, shopping at Amazon & music along with a few apps that were popular, but they lacked the hardware/spec/polish to be a great internet browser and tablet overall.  I have used the Ipad 1 & 2 in the past and even those older versions surfed the net better than the previous Kindle Fires most of the time.  With the addition of all the apps for Ipads and the straight android market it was tough for the older Fires to compete directly as a top quality tablet.  I never bothered in the past to side load apps as I figured it was difficult and a bother and back then I was just using all the apps I needed on my Samsung Galaxy 3 from the android market.  (More on Side loading apps later on the Fire)NOW...the new Kindle Fire HDX 8.9 changes everything that I did not like.  I was able to purchase it at Staples with a $50 off coupon and for $329 I received the 16 gb version that now  come with a charging kit.  The old ones did not.  That is a difference of $170 compared to an $499 Ipad Air 16GB.  Even at $379 it is still a saving of $120.First impression was WoW the amazing light weight of the new tablet...Awesome!  Next the screen is amazing.  When I say that, I mean the best I have ever seen on any tablet including the new IPAD Air (more on that direct comparison later).  I was hoping that these 2 improvements would not be the only thing that was upgraded as the software, apps and processor needed to be drastically improved to compete with the other new tablets coming out.The great news is that the silk browser is much improved as well as the whole operating system.Fire HDX 8.9 vs the Ipad Air I tested the Kindle Fire HDX 8.9 against my friends new Ipad Air in surfing the internet 1st. Side by Side i would go to various sites on both tablets to see if there was a big difference in speed.  They were both going over wifi and to my surprise the speed was basically the same (really good). Sometimes the kindle was slightly faster and sometime the Ipad was, but it was so negligible in most cases that I would not even notice it if not comparing them side by side.  The great news to me was that the New Kindle was equal to the new Ipad Air in surfing the net which in the past it was not!My next comparison was to look at the screens while surfing and also watching movies.  The Kindle Fire screen was indeed brighter and clearer in both movies and web sites in almost all cases.  The Kindle Fire's screen is slightly smaller, but for watching movies in HD horizontally they were the same size on both devices because the Ipad has the black bars that limit it on I am assuming HD formatted movies. (I could be wrong in that maybe it is not always the case with the formatting).  The Kindle Fire's coloring, brightness and clarity in side by side streaming movies with the Air was just plain and simple better.  In darker scenes you could clearly make out details on the fire that I could not on the the Air. The Fire's screen looked brighter and clear with great colors that just stood out! I tried several scenes in 2 different movies and the result was always in favor of the Kindle Fire.  I was shocked at the advantage as it was quite a bit better. (the Air has a good screen, just not as good as the new fires!)  Also the Kindle with a Prime Membership lets you download some movies/tv shows for viewing offline later.  It is not all movies/tv shows but there is enough for now to keep you occupied for several trips and hopefully they will continue to add more in the future. They let you chose the standard size or 720 or 1080 but each step up takes up more room on your tablet and takes longer to download.  I have also heard that some have time limits as to how long you can have them downloaded but I have not yet experienced that with the shows I have downloads. (one negative is they do not tell you which movies are downloadable??? So you have no way of knowing until you click on it. Hopefully they will add that to the search option in the future in Prime)  I just also want to mention IMDb for movies is something I thought I wouldn't use much, but I am really starting to like it. It tells you all about any actors on screen and also add's trivia about the movie or scene.  It makes me want to rewatch older classic movies just to learn more about them!Ok, so far the Fire is lighter in weight, with a better screen and the speed when surfing the net was equal!  I am really impressed so far.  Now comes the area that bothered me in the past and almost had me going for an Ipad Air..lack of Apps in the closed off Amazon market.  Now do not get me wrong Amazon has a ton of popular Apps that I am guessing would satisfy 75% of the people who would consider buying a Kindle Fire in the 1st place.  They have all the popular games and apps that most people use.  But they also do not have some that Google and Apple do provide.  For example Amazon had my CBS sports fantasy Football app, but did not have ESPN's fantasy football app. along with Direct TV Sunday ticket! This drove me crazy as I wanted both on my new amazing Fire screen!  So I decided to try to side-load these into the Kindle and they worked! I will not go into that process, but It was relatively easy to do in just a few steps.  This process gives me access to most/all of the android apps!!!  This is a great way to get all the apps you might not find in the amazon Apps store.  I will always use Amazon apps 1st (since they approve them), but then sideload ones they do not have in their store.  This really solves one of the biggest complaints you will hear about the Kindle Fire from techie/experts!  It may take a little work at first to figure out how to sideload the apps, but once you do it is a pretty simple task.Lastly, I just received the OS update 3.1 for the fire and it added Goodreads and also Collections to the Fire.  It added more improvements but I did not have a chance to use the others to this point.  Goodreads is great if you like reading and seeing what others recommend or are reading!  Collections lets you add Books or Apps into Groups which makes it much easier to find things on your tablet.  The apps collections can go right on the Home Screen of the Kindle which is a nice touch that other tablets already maybe have (apple?).  There are other improvements that I will try to come back and update at a later time when I have a chance to use them.In summarizing the Kindle Fire HDX 8.9- It has surpassed my expectations period.  I find it can go side by side with the new Ipad Air in almost every respect and even beat it in screen quality, weight and price $170 less!!!!  You can almost buy the smaller HDX 7inch for that if you catch a sale.  I cannot recommend the 8.9 enough as I am for the 1st time really impressed with the whole package.  It can do everything well and has the screen, processor, OS and price that puts it ahead or at least equal to the new IPAD air.  Amazon with Prime & the HDX 8.9 is a killer combination of great Hardware/Software/2 day free shipping/Apps/Games and finally Great Amazon Support!  The Mayday Button (Help) is amazing. I am pretty good at using technology and I used it a few times to help change a few settings on the tablet instead of searching  for the settings.  The customer service rep. was online in a video box on my table in 20 seconds and help me find the settings quickly.  Another amazing aspect of this tablet is that it is great for novices as well as people who like technology and want to try to sideload apps for example.  I just do not see anything on the market at this price with this many great and unique features that comes close to comparing to the HDX 8.9 Fire.", "Title": "The Fire 8.9 HDX exceeded my expectations and equals or beats the Ipad Air in many respects at a cheaper price! Love it Amazon", "Date": "November 21, 2013"}, {"Author": "Doug", "ReviewID": "R2YH4OGPQMVU3Z", "Overall": "4.0", "Content": "Amazon definitely seemed to try and exude a more premium vibe this year. I think they got a lot of feedback since last year's HD which came in a black box marked Kindle Fire with a pull tab. This time they actually delivered a retail box complete with charger so you got some amount of unboxing pleasure. It did appear as if the tablet was shipped in sleep mode since the first thing I did was attach an Origami case and it woke it up with 4% battery left. Like always it comes pre logged in with your account which is that nice little touch so you're almost able to just run with it. I say almost because you need to get software update first which is pretty par the course for electronics these days.The first thing that you notice when pulling it out of the box is how crazy light it is. Feels much closer in weight to a 7\" than to the 10\" tablets, in fact last year's iPad feels like a tank now. The next thing that was immediately noticeable was the touch response. Note I'm talking about that few millisecond lag between pressing the screen and something happening. Not everyone seems to notice but it's always been an issue with Android that this was a bit long, the HDX doesn't exhibit this and I'm fairly sure this is a software change not just the hardware but either way it just feels really good and really fast. The was especially noticeable on the keyboard. There are no hiccups with the way Fire OS and the SoC handle the UI which coming off N7, Fire HD and older iPads it feels good.The screen is obnoxious. It's probably the best screen on anything really. Realistically the resolution bump isn't noticeable but the color, contrast and brightness sure are. I'm very happy they put a lot of effort into those aspects because it makes it a very well rounded display, it excels at everything. The speakers seem to be the same as the ones in the HD, that is to say the best tablet speakers around. The main difference is they got moved to the top so you don't obstruct them with your grip. Which leads me to another point which is that this tablet really wants to be used in a specific orientation. The camera is the only real indicator so it's easy to mess up, but unlike the KFHD which could be held however the back buttons demand landscape or you can't find them. They are mighty comfortable because you don't have to change your grip to use them when you get there but if you use it in portrait like I like to the volume buttons can be hard to track down. Sleep/wake is solved by getting a case because I immediately attached one and never have had to physically press that button even once.The Fire OS UI has changed a little bit. It still looks the same but things have been tweaked. If you are one of those who hates the carousel you can swipe up to get a grid view (the most recent 10 items are always shown at the bottom). There are more categories of things across the top as games and apps got separated and the recommendations are much smaller (you can still turn those off in settings). There is also a multitasking view if you swipe up from the button bar that is smart enough to multitask between books and media in addition to apps. FireOS 2 had little things that were missing that could make navigation a pain but this version stands on it's own in terms of features and doesn't feel lacking compared to stock Android.I first downloaded all my previous apps from my old KFHD. These are easily accessible from the app menu, you don't even need to visit the store, just go the cloud tab and you have a list of everything you own and just tap on things to download. The rest of my media is mostly in the cloud to save space but the process to download is just as easy. The one thing I had to re-create was my browser settings, those don't seem to cloud-sync. My old HD had a few sideloaded apps that I needed, so the first step was to go to settings and allow installing of 3rd party apps. Then I could go to dropbox.com and get dropbox (because for whatever reason it's not in the store proper), and I also grabbed a few of the latest Google APKs off the web. Installing is simply a matter of downloading the APK and tapping it (no PC required). I couldn't get certain login features to work even with the GoogleLoginService APK but the apps work and I don't need to be logged into to Youtube/Google maps so I didn't bother trying to fix that.Last time I loaded Chrome and Gmail. FireOS 2 had a lousy mail app and the preinstalled Silk kinda sucked (it got an update later than vastly improved it). They've done a lot of work since then to the point where sideloading other things feels unnecessary (I still use Chrome for testing at work but I wouldn't have bothered otherwise). The mail app is basic but does everything I want (read threaded emails and write them). Silk especially has come a long way, this version is branched off Chromium version 25 so while it's missing a few experimental web APIs (Google's WebRTC work) it works with pretty all the latest standards (WebGL included). It also now tells you when it grabbed an accelerated version of a page. Latest Chrome benches better but Silk on an HDX is still faster than Chrome on pretty much any other device.This one also features a rear camera. It's an appreciable 8MP with flash, probably won't replace your smartphone but for a tablet it's actually pretty good. It does better than my 5th gen iPod Touch so if you really need a camera it'll do in a pinch. It has all the normal features you expect, touch-focus, HDR, panorama modes and 1080p video. The camera app is surprisingly good, it comes with a myriad of quick edit features, filters, touchups, stickers, drawing tools, and even a meme-maker. I was expecting a lot less but they put a surprising amount of work into this.Some may be annoyed to learn that this model doesn't feature HDMI out. I wish they kept it because it's cheap and works with everything but Miracast is certainly a better overall option. I got a Netgear push2TV which is the only device specifically cited to work with the HDX right this moment. It's a little box that plugs in to a display via HDMI and uses a USB power source. It's pretty simply but I needed to update the firmware first (otherwise the HDX wouldn't recognize it) which involves downloading firmware from the website, having it create a temporary network and then uploading the file to it. I did this all on the tablet just for proof that you could since that would be a no-no on iOS but Android is pretty flexible and FireOS doesn't take that away. Once that was done I needed to go into setting and set up display mirroring. It's strangely hidden but it was very easy to do once I had my box updated. The output was pretty high quality with about a half second of lag. Note that it seems to squish the 2560x1600 into a 1080p which pillar boxes it and scales it down (even on my 2560x1600 display). I think that's a Miracast limitation or a limitation of the box itself but I think it would probably do the same thing over HDMI. The box was a bit pricey, about $55 and it needs 2 cable but I think as long as Miracast gains traction these should become smaller cheaper dongles that are powered via HDMI. In any case that's what's available right now but it's much more convenient that cables it's just a pity your forced into it for video out. Apparently they'll also have a second-screen app for Playstation consoles that works like a Chromecast as part of Fire OS 3.1 but that's not available yet.The last interesting thing is the Origami case. I couldn't decide if I liked it or not at first but now I definitely do. To be perfectly honest, it has a learning curve. It's very cleverly designed, it can fold into 2 different positions to hold the tablet horizontal or vertical and attaches magnetically. The nice part is is also magnetizes to itself in the folded position which makes it extremely stable compared to other tablet cases but you need to practice a bit to get the folds right because it isn't obvious at first. The Kindle also attaches magnetically which makes detaching it really easy unlike the smart cover for the HDX. This is good because it's a bit heavy and you may not always want it on. Since it folds it's not rigid like the HD's cover so you have to peel it back instead of open it like a book. When you hold it, the magnetic cover swings around and attaches to the back of itself which helpful except one glaring design flaw: it covers the back buttons meaning you have to lift it up to use the volume buttons (sleep/wake is handled by the magnetic attach points so it doesn't matter). Also when vertical you can only use it rotated right as the USB cord will obstruct in left rotation position. The final nifty little thing is you can push the HDX up in the case. This is because the camera isn't exposed but when you push it up it clicks into a position and this automatically launches the camera app no matter what you where doing, though sometimes is can take a couple seconds depending on if the app was hibernated. I really like this feature and really wish more things incorporated a quick camera feature like it. It just makes it that much easier to capture something in the moment. So it has some highs and some lows but I definitely recommend it, it's just a lot to take in for what you'd expect was a simply case. It did set me back $55 for a black, polyurethane though with an even more expensive leather one above that.After messing around with it for a whole day I was barely breaking 80% on the battery meter. At the current rate it will likely fall around the 10-12 hours Amazon advertises. Apparently when reading that number can jump to 18 but I'm not much of a tablet reader so I probably won't test that. The initial charge took maybe 3-4 hours to go from 4% to 100%.If you thought Amazon was just putting out cheap tablets I'd encourage you to take another look as this is a whole different beast that the KFHD (which itself was a massive step from the original). If the Kindle was a cheap tablet and the HD was a budget tablet with nice hardware this is very premium hardware that happens to be cheap. I was disappointed that they raised the price $80 but they definitely made that $80 go a long way. Spec-wise it's an iPad killer but it's still a lot cheaper which is what I like about it. I'll admit I don't really care much about tablet apps and games, I use my tablet for looking things up, reading email/social media, music, videos, web-surfing and web development. I also use Amazon a lot so this was really a no-brainer and if you're anything like me (a tech-slobbering deal-hunter who realizes the futility of convergence) I'd say it's a must-have. So I'm very happy with what they put out this year, it feels like a big step up from the HD.I gave it 4 because Amazon still has some catch-up to work on with their app store and basic apps.  I'd really like to see speech-to-text options as well as better syncing of browser options . I'd really like to see better mapping software options since Amazon does have their own API but strangely don't use it themselves.  The HDX doesn't have a compass or GPS on the wifi version unlike the Nexus 7 and a myriad of other dirt cheap tablets which I think this is a huge oversight.  But the final thing is the lack of update support.  I was highly disappointed with the way the original and now HD have been treated as far as updates go.  If Bezos says we're not on the upgrade treadmill then please port some of those features back and give my old device new life.  At some point it's okay to move on but when your new HD has software features last-year's didn't and the internals on the 8.9 HD are still better that's highly problematic.", "Title": "Great Upgrade, Very Impressed", "Date": "November 12, 2013"}, {"Author": "Jeremy Roper \"perpetual student\"", "ReviewID": "R1TUUELO41U604", "Overall": "4.0", "Content": "I've put about 12 hours of use into my Kindle Fire HDX 8.9 (with 64 GB and Wi-Fi only) at this point and am very satisfied. I've been interested in the Fire since launch but have held off because of lack of storage space (I want my music collection on it, which alone is over 30 gb, for one thing).I know there's been some irritation about it not being the same as Android. They never advertised it that way, and I think that shows a lack of effort to actually learn about the product before you spend hundreds of dollars on it. There are similarities to Android, but this OS is truly distinct. Amazon has always been geared toward media consumption, so it should come as no surprise that this is a media consumption device (I mean, really, that's what Kindles have been from the very beginning). It seems misguided to be bothered because of uninformed expectations. If you're looking for something other than media consumption, look elsewhere. But buying something like this without doing some research first? That doesn't make sense at all.I want to give this 4.5 stars, but that's unfortunately not an option, and it doesn't quite warrant 5 stars (yet, at least). I've used multiple Kindle devices and almost every Apple product, as well as Android phones and tablets and feel I have a pretty good foundation for comparison. The HDX 8.9 falls in a category of its own. Overall, I'm almost entirely pleased, and have only run into a few hiccups, mostly with the software. I'll explain the hiccups first to get those out of the way, then discuss what I love. Will update if necessary.***Not so great:- I got an error when it attempted to update during setup, and didn't think to do it right away (my fault). This may have prevented some of my problems, but not sure.- The software was a bit slow initially, which was disappointing because it's advertised as among the fastest of tablets (if not THE fastest). For example: App store, cloud music player (more on this later), adjusting settings, and viewing a PDF (the first I tried; the others were flawless). I was in the same room as my router, and I have reliably fast internet, so it's unlikely to be a Wi-Fi or connection issue.- The music player. I want all my music on the device, which is currently in the cloud so I tried downloading it. I couldn't find an apparent \"download all\" option, so I had to queue it artist by artist for about 10 GB before I went to bed. It was late and I didn't try Mayday, but I probably will when I get home. In addition, it was very slow and has frozen a couple of times when I try to load my music library, and ended up restarting. This may be an initial \"indexing\" thing, especially since I have a fairly large library. It took about 20 minutes to finally access what I had downloaded last night. Now, however, the problem is resolved. -- ***UPDATE on this in comments***- The App Store seems a bit cluttered.- The display flickered 3 times in the first 30 minutes, but never since.What I love:- The screen is phenomenal. It's fun to look at just because it's so pretty. No \"blue haze,\" so maybe they were able to address that before this model shipped. I've tried to see it but just can't. Touch response is excellent as well; sensitivity and accuracy are top-notch.- Processing speed is excellent, except for the few problems I initially experienced, which seem to be resolved.- The media bar along the top is great; unlike Android or iOS, I don't have to go search in the menu for the different content apps.- Sound is fantastic. I've never heard speakers on a tablet that even come close. It's better than a lot of laptops. Wired and bluetooth headphones have great sound as well.- Keyboard: this might be a weird one, but especially after discovering Swype I've been very disappointed with traditional touch keyboards. I was holding onto a faint hope that Swype would be available and am very pleased it is.- Wi-Fi speed is better than any mobile device I've used. Bluetooth seems to work without a hitch as well.- Cameras are clear and responsive. I hate the way my phones always take about 3 seconds to actually take the picture. Not an issue with the HDX 8.9.- Interface: I took a step back from what I was used to with Android, as I knew this wouldn't quite be the same. With that in mind, I am very pleased.- Prime Video works well and downloads relatively quickly. I'd like more selection but I also took the time to learn that they have a limited selection currently, which they're working on expanding.- Battery life appears to be as advertised. It's perfectly satisfactory, but after I run the battery down I'll update if necessary. Turn the Wi-Fi antenna off when you're not connected and it stretches a bit further. **UPDATE** - Finally ran the battery down from full charge to 15% after 12 hours of continuous use mixed between email, streaming video, web browsing, and LOTS of time downloading music from the cloud. Battery life impresses me well enough.- Integration with Prime features. I love that my Prime membership keeps going further and further beyond free 2-day shipping.- Little-to-no bloatware (depending on how you define it). I hate my android phones for this reason.- The price is incredible. I though a few times about an iPad Mini (w/ Retina) or iPad Air, but I could buy a decent new laptop for that price. Not looking to wipe out my savings for a tablet.Wish List/So-so features:- More customizability in settings. The collections option that they're supposed to roll out soon would be nice. I'd love an EQ adjustment in music and video as well - not all songs/videos/speakers/headphones are created equal.- Get rid of the matte finish on the back. Personal preference.- Not in love with the carousel home screen, though I may change my mind.- Smoother experience downloading music and videos - particularly music.- Better app selection. Most essentials are there, but hopefully this will expand.- I'm interested in the Second Screen feature. I can already play Amazon content on my TV, so hopefully this is something where I could send any content on the device to the screen. If not, I'll find it less than impressive.***I consider the iPad a media consumption device -- it grew out of the iPhone and iPod Touch, which sprang from the classic iPods, and they were all designed for media use. I think that's the HDX 8.9's closest competitor.  Aside from having more apps (not surprising if it was the first major device and has at least a three-year head start on the Fire) and being trendy from the start, I don't think the iPad has much of a leg up on the HDX. This device is faster and lighter, with an amazing display and a price substantially lower. Android was designed for more variable use, so go there if you want to do more work than play on your tablet. If I'm going to work much, I will do it on my laptop, which is really not much bigger.Altogether, I love my Kindle Fire HDX 8.9. It would be 5 stars if it weren't for a few bumps I've run into so far. But I expect it will only get better with a little time.", "Title": "Impressed, and will probably only get better.", "Date": "November 8, 2013"}, {"Author": "Sherri Griffin", "ReviewID": "R2MSTFSL4HN2JS", "Overall": "4.0", "Content": "I am not a tech person so if you want a tech savvy review, just ignore me.Mission: I needed a good e-reader for textbooks and research, but I wanted more functions than just an e-reader could provide.Screen: I am an Apple Snob and I won't lie: I wanted an iPad mini. I'm heavily invested in the Apple ecosystem, but I really needed a good e-reader and a good tablet for school. The iPad is a great tablet, but I kept seeing people saying that it wasn't a great e-reader. As an apple user, I can't deny that my eyes are always feeling strained while reading on my Macbook Air for long periods of time, so I started looking at other products. I'm really glad I went with the Kindle because is a big improvement for reading.Operating system: It is also extremely simple to operate and I haven't had any issues learning how to use the Kindle. In fact, it makes the apple IOS look extremely complicated-- which it isn't.Battery Life: It kills my Macbook Air. Destroys. Murders. Whatever adjective that means the Kindle's battery is way better. I can average 4-6 hours on my laptop off the charger, but the Kindle will last all day with mixed use.Size: I'm really glad that I went with the 8.9. It's bigger than the iPad mini, but I felt like the Kindle 7 would be too small. Even though I have small hands, the Kindle 8.9 is not too big and definitely not too heavy-- it's extremely light even with the (poetic) cover attached. I can easily hold it in one hand while reading. It's also a good size for watching movies and it's still perfect for playing games. The only downside is typing-- unless you have BIG hands or you like to peck--- use your computer!Reading: It has all the features of the Kindle e-books (highlighting, translation, search functionality, notes), but it is an LCD screen so it's not backlit like the paperwhite. However, my eyes seem to be fine with it especially with the abundant reading options. For instance, I was reading in the evening and as it got darker my eyes started to feel tired. I simply changed from a white to a black background and my eyes immediately felt better. Reading is SO MUCH BETTER than my Macbook Air. There are LOTS of books to choose from (including many free books)-- I've downloaded nearly two dozen books and I've only paid for 3 of them. Yay!Movies and Audio: No lag, excellent picture quality. Some people have said they haven't been able to get all the movies they've wanted to see, but I haven't ran into anything I can't watch... yet. There are a good selection of Prime videos you can watch for free and also cheap rentals. X-ray is pretty cool.The sound is EXCELLENT. Seriously, surprisingly good.Apps and Games: A lot of people seem to complain about the lack of apps, but everything I wanted was available and all but one of them were FREE. Granted, I do like a lot of the more popular apps (pinterest, facebook, evernote), so if you want something really specific then it may not be there. As for games, I got Angry Birds Rio for free and the response time is excellent. We also Real Racing 3 (Free) and the graphics were awesome and it was easy to play with no lag.Internet: The responsiveness to open pages is initially slower than my Macbook Air, but it isn't a huge difference. It seems to improve the more you visit the site. You have options to use different browsers: google, bing, and a few others. I'm a google addict so I didn't really look at anything else.Shopping: Strangely enough this is where I was disappointed. I was trying to find an e-book and I could get to the main shopping page which would show all the books in the series, but when I clicked on the book I wanted the page would just never load. The tablet did not freeze-- I could backspace out of the loading process. I restarted the Kindle, and I waited around, but this is still the case 24 hours later. I ended up buying the book on my computer and linked it to my kindle. This also happened when I was looking at movies-- it just kind of refuses to upload certain pages in the Kindle Store, but most have no problem.Camera: I never intend on using the camera, but I did just for you. It's surprisingly good. Definitely comparable to my iPhone with both the front and back cameras. It is no where near the level of my Lumix camera (thank good-- I spent too much money on it!), but it's definitely respectable.Mayday: Beats me. I haven't had to use it.I am really happy that I bough this instead of the iPad mini or Air and I saved myself a butt load of money. Thanks, Amazon! :)", "Title": "Apple Snob Converted: Great e-reader, battery life, audio, camera and more!", "Date": "December 6, 2013"}, {"Author": "Ryan Manning", "ReviewID": "R1JGM7R4Z3O6OQ", "Overall": "5.0", "Content": "So you're debating buying a tablet, doing your research, and then you see an advertisement for the Kindle Fire HDX? What the heck is it? What's different between it and every other android-based tablet out there? Why should I buy it? Hopefully I can give you a less “technical” perspective on the differences between android tablets and the Kindle Fire HDX and why you would or wouldn’t want to buy one! Let's cover the highlights:What is it?- It's a tablet...based off the android platform but running Amazon's proprietary firmware. What does that mean? It means you can run android apps but they have to be purchased through the amazon app store and not the Google play store (which isn't available on a Kindle Fire).Pros:- The screen is amazing, hands down the best I’ve seen in a long time.- Battery life is decent, however standby time could be improved (a week at most).- Integration with the Amazon app store and Prime instant video was very seamless and easy to use.- The interface is surprisingly easy to navigate, although there are some inconsistencies (ie. the back button moving between apps) that could be improved with software updates.- Memory and CPU were actually quite spectacular and should provide enough horsepower to last you at least 4-5 years.- At 13.2oz it’s incredibly light but yet still feels durable in your hands. The anti-slip coating on the back helps to ensure you don’t accidentally drop it, although a protective case is still a good idea!- MAYDAY!!! Actually quite a cool feature. If you ever have trouble finding something, running something, or just need help using your HDX, Mayday connects you directly to an Amazon rep who can help.Cons:- No Google apps or Google features (only a problem if you’re mobile world is heavily influenced by Google; pictures, contacts, etc)- Although very minor, the interface can provide some confusion on where things are located. Ie, “Home”, “Back”, “Settings”, etc.What's the difference between this and other android tablets?- The biggest thing...amazon controls the software, the updates, and the apps you can install. It's easiest to think of this as a tablet devoid of anything \"Google\" that loves to play in the realm of “Amazon”. This isn't really good or bad; it just depends on how you see it and what you're used to (keep reading).Google versus Amazon:- Originally when the Amazon app store launched you were hard-pressed to find all the apps found in the Google store. But, now that the Amazon app store has taken serious leaps forward you can pretty much find any app you’re looking for. However, I strongly recommend that you look through the Amazon app store (Shop by Department -> Amazon App Store) FIRST to make sure any specific apps you’re needing are there before you purchased a Kindle HD/HDX. You may have that one unique android app that’s only available in the Google play store.- If you’re use to the world of Google (Contacts, Apps, Photos, Syncing, etc) then a Kindle HDX may not be right for you…if you want an Android tablet to complement your Android device collection (Phone, Tablet, etc). Having used Android phone since v1.1, I found that there were things I wasn’t getting with the Kindle HDX that I would have wanted. Thing like “Automatic Contacts sync”, “Picture syncing”, etc. Not that these are deal breakers, it just I would have preferred to have consistency between all my devices. However, Amazon does offer cloud backups for photos and contacts, however, if you have an Android phone before a kindle, you may find yourself frustrated with having to manage two separate contact lists and photo collections. All in all, if you’re use to the Google way of handling things, using Amazon’s apps may prove to be frustrating and monotonous.Summary:- All in all this is a beautiful tablet and completely different from the first Kindle Amazon created. While it harkens back to the Kindle days, it’s best to look at this tablet as a complete redesign of the whole kindle “experience”. While the lack of Google features (pictures, contacts, etc) can provide some headache, the seamless integration of Amazon’s Video streaming, Lightning Deals, App Store, and Kindle apps makes it surprisingly simple and easy to use. At 13.2oz it’s incredibly light but yet feels sturdy in your hands. Battery life is great considering the CPU and Video resolution and the quality and color of the screen certainly makes it one of the top “Most Beautiful Screens to Look At”. If you’re use to Google’s ways of handling things (pictures and contacts), the Kindle HDX will most likely be best suited as an E-book reader, occasional Prime Instant Video watcher, and large screen gaming device. If you’re new to the Google world, making the transition to using Amazon’s cloud-based apps probably won’t be that difficult! Hands down, for a price tag of $379, the Kindle HDX 8.9” is a beautiful tablet worth owning.", "Title": "Android Tablet...or a Kindle Fire HDX?", "Date": "December 3, 2013"}, {"Author": "aam in ak", "ReviewID": "R3842TGPIZMA5F", "Overall": "5.0", "Content": "I am not new to Kindle, having purchased and used every kindle (except the DX) from the beginning.  I currently own 2 paperwhites (an original and the new one).I bought 2 Fire 8.9 HDXs, one 32 gig for my son, a 64 for me, ad free- wifi only and spent a small fortune to do so.The positives (5 star)- screen clarity is beyond awesome- responsiveness to touch excellent, weight non-existent, Mayday was very polite.The negatives- and they are big ones for me  (heavy digital user of magazines and newspapers)- so 1 star or less.1)  Amazon does not allow you to download ALL of your magazines to your device, only the current issue and ONE prior.  This is not disclosed, and in fact since an option in Manage Subscriptions is to download prior issues to any device on your account, NOT allowing it is highly misleading.  I spent an hour \"chatting\" with support and was told (basically) \"too bad\" then support from Mayday.  I have 27 subscriptions and have been purchasing digital content since the first Fire came out, then the iPad2 for the last two years (larger screen for older eyes).  Let me be clear- if anyone at Amazon is reading this-  I PURCHASED the content and it belongs to me.  I did not \"rent\" the right to view it at your convenience.  As far as I am concerned- digital issues are no different than paper issues which I would have kept on the bookshelf.  The nice lady at Mayday said that there is a \"server\" issue and that the cloud is always available.  Unfortunately, it is not always available for me (in Alaska), nor is it available in many rural places I travel.  Since I sold back my ipad 2 to amazon to defray the costs of this purchase, I now feel robbed of my content.2.  The lack of Google apps is a HUGE problem for my middle school son .  I thought I would be able to side-load the stuff he needs, but cannot.  His school requires access to google docs for collaborative projects, and we are frozen out.  Thank goodness we still have an old iPad 1.  If Amazon wants to push this as a student tablet, they need to find a way to play in the sandbox with google, period.The upshot-I am deeply frustrated with the potential of the Fire HDX, and HOPE Amazon fixes the issues so the ecosystem lives up to the hardware.  Until that happens, these are really just toys, and do not replace the iPad for functionality.So sad...UPDATE to 5 starsIn the month since my first post, I have Found work arounds for the google issue, not having my mags is still frustrating, but this tablet has become a go-to device for both work and home.  Using ighome to replace my old home screen, I have access to my Google calendar for work.  Same workaround for my son and the schoolwork he needs access toWe do not pine for the iPads at all", "Title": "updated -does not live up to the marketing hype. I was wrong", "Date": "December 1, 2013"}, {"Author": "The King of Nothing", "ReviewID": "R1SYG9Y9PAZP76", "Overall": "5.0", "Content": "Like many others, this isn't anywhere near my first tablet.  Nor, is it my first Fire.  I've modded, rooted, and sideloaded nearly every android thing I've owned, yet, I have no desire to do that with this iteration of the Fire.  There has been so much written about it, so a full review is excessive, but these are my quick thoughts.First, the hardware is as advertised.  Right now, it's simply the most powerful and beautiful tablet available.  It's fast and images are gorgeous.  Text has laser printer like clarity.  Movies look great, and the sound, wow.  The Dolby audio is something to hear.  No joke, on the first movie I watched on my new HDX, there was a bird in the background, and I honestly started looking around the room for it.  It is excellent.Seconds, the FireOS is actually pretty good!  I'm a fairly knowledgeable android ROM tinkerer, but I don't see any real problems with the FireOS, at least nothing that has me actively looking to fix it.  It's a pleasantly surprising modded Android experience.  Plus, there are some real benefits of keeping it stock and using your Prime membership.I owned the Fire 1.0 and sold it pretty quickly.  It felt weak and very restricted.  The HDX is the polar opposite, it's a beast, and I'm enjoying it very much.", "Title": "Awesome, awesome tablet.  From a tech nerd.", "Date": "November 11, 2013"}, {"Author": "K. Brown", "ReviewID": "R21X1MT8CAZJL3", "Overall": "5.0", "Content": "Got the 32GB model without ads with the quarterly payment option (otherwise, don't think I would have sprung for it).  Let's start out with the good: Extremely thin and light weight, awesome screen, easy setup and navigate. Now the not so good: Battery charger included...but it is the slow 5w charger, not the fast 9w powerfast charger (at least that is what the pop-up window indicated when I plugged it into the charger). But on the other hand, I guess charging it up overnight should be enough for a full charge by morning? So far, I am very pleased with the purchase and would highly recommend this device. Glad to see Amazon using an installment program plan...5 stars for that alone, got me off the fence to make a purchase!", "Title": "Big improvement over the previous model", "Date": "December 16, 2013"}, {"Author": "rsawey", "ReviewID": "R3U4NCNR9IESCB", "Overall": "1.0", "Content": "First, let me say that I am a big fan of Amazon in general and Kindles in particular.  My new HDX is the 5th Kindle that I have owned, so I have drunk deeply of the Amazon Kool-Aid, and likely won't be leaving the Amazon ecosystem any time soon.However, if you use your Kindle to read newspapers, do NOT buy the HDX.  Why? Because the newspaper reader on this device does NOT have the \"Sections\" drop-down menu.  I've verified this with the a very cheerful Mayday consultant.  It wasn't just hidden somewhere.  It just was not there.All of my previous Kindles have had this feature, and I've come to rely on it, particularly when I'm reading a large newspaper such as the \"NY Times.\"  Before, if I wanted to go directly to the \"Business\" section, I could drop down the menu, touch and be there.  Now I have to scroll and scroll and scroll to get there, being very watchful that I do not go past the section header, a header in a smaller and light font.  In what software design universe is this to be considered an improvement?I really hope the software designers fix this.  For now, I'm reading my newspapers on my old original Kindle Fire.", "Title": "If you read newspapers on your Kindle, do NOT buy the HDX", "Date": "December 2, 2013"}, {"Author": "Pia", "ReviewID": "R11N3ORV1MI8E2", "Overall": "5.0", "Content": "I bought the kindle as a Christmas gift for myself. I tried to be ahead of the big shopping extravaganza after Thanksgiving and was at first a little bummed when I was told that it would take almost 3 weeks to deliver the tablet. But then I received almost every day a new email, letting me know that the delivery was sooner. It was finally scheduled to be shipped on 12/02 but I received it on 11/30. Made me feel good, barely a week after the order.I received the tablet, plugged it in, turned it on and it worked. A few things gave me a bit of a hard time to figure out, there was no written manual. But there is the 'mayday' button on the tablet. And it worked, just as promised. I hit the button I waited may be 10 sec and I talked to somebody who helped me fix my problem.I've borrowed books through my library, sent emails, updated my facebook page, downloaded a few knitting patterns and transferred others from my desktop to the kindle, I have subscribed to the e-version of a magazine, I read my daily newspaper on the kindle, I watch my Netflix shows on it. I have installed and played a few games.I love the ability of the kindle to read books to me (even if I am not using an audiobook). I'm reading my favorite novel and I need to do dishes, so I can let the tablet read to me and do whatever it is I need to do. Also the instant lookup capabilities are wonderful. I'm bilingual German/English, I can have words (from my novel) translated into german or look the term up in a dictionary or even on Wikipedia - just by touching it on the screen.The cameras (front and back) are fun to play with and I managed to get a few pictures from my notoriously camera-shy dog - she didn't even realize that I was taking a pic of her. I have yet to play with the abilities of the machine to accept commands from the distance, haven't yet gotten around to it.I had no problems connecting Bluetooth devices or set it up for my home-wifi network. The machine doesn't lock up, it doesn't crash, the 2 or 3 things I had were my issues of not knowing and they were resolved by the help I received through the almost instant mayday button.The one thing that annoys me a bit (and I guess that's not the kindle but the amazon shopping page) is that I only can look for books by keywords, but not by let's say author and publishing years (or other more specific things). I receive too many results when I'm looking for something specific. But that's really a minor issue.I'm still discovering every day new things to do with the tablet and it is fun.If I had to describe a really positive shopping experience - this would be it.If I had to describe a tablet that does what I want it to do - this is it.Thank you.", "Title": "Very satisfied and having a lot of fun with the little machine", "Date": "December 3, 2013"}, {"Author": "Brian C. McCall", "ReviewID": "R1CWAAZYNF3NO1", "Overall": "2.0", "Content": "Update (12/10/13):After replacing the 64 GB model with the 32 GB model I have not experienced any of the previous issues I had. I have used it for several weeks now and everything works as you would expect. I have updated my rating to 2 stars because while the 32 GB model works, it is not what I wanted and the 64 GB model is, as far as I know, still severely flawed and essentially DOA.Previous review:There is a major problem with this model (64 GB, Wi-Fi). I have had 3 of these so far. You read that right, 3. All have exhibited the same problem. I download Prime Instant Videos and can watch them but once I attempt to delete them, the tablet becomes bricked and totally unresponsive. It will not power back on. Amazon customer service has been quick to replace them but clueless as to what the problem actually is. Do not buy this model if you plan on downloading Prime Instant Videos because you will just end up sending it back, bricked.", "Title": "Buyer beware!", "Date": "November 18, 2013"}, {"Author": "Donna J. Krein", "ReviewID": "R205ZUEDPGTMM8", "Overall": "1.0", "Content": "We purchased the Kindle HDX, our first ever tablet.  The screen flickered and would take you back to home screen when browsing Internet. After 3 May Day calls and still no resolution we requested to return and try another unit. Bad decision, second unit did same thing. Is it the HDX model? Friends have the Kindle Fire and love them. We wanted to love the HDX but they need to debug them before sending them out to folks.  Now in search of a different tablet, not a Kindle, sorry Amazon.", "Title": "Not what we hoped for", "Date": "March 7, 2014"}, {"Author": "gadjetGirl59", "ReviewID": "R21NRH2Q8LQ0Z3", "Overall": "5.0", "Content": "Amazon keeps improving their product, Kindle 8.9 HDX is a fine piece of hardware.  I received my tablet Thursday and finally have been able to play with it.  First off, this thing is light, very light, one hand light!.  I had the 1st and 2nd gen Kindle fires and this HDX is a delight to hold.  I have a Samsung 8.9 and is about the same size but the HDX still feels lighter.  I will admit to owning the iPad4 and in my opinion the screen looks clearer and sharper.  The hdx's screen is gorgeous, just gorgeous.  Crystal clear, color is just beautiful and looks just as good as my HDTV.I did get the Origami cover but it adds weight so I will probably send it back.The browser is much faster than the last tablet, just breezes through the pages.  And no stuttering when changing to different sites.  The sound is good, maybe not as loud as the hd, but I normally use earbuds anyway.  But even turned up all the way, there is no distortion.  I was able to down load drop box (able to access content), 1Mobile app, Hulu plus (plays fine), and some other favorites. I do find that their are some apps that have not been updated for the hdx but I assume all good things take time. So no worries. :-)I have opened books to read, NO blue or purple tint.  I even used MayDay because I thought I had a problem downloading the update.  The C/S rep was very nice.  I do not know why people are rating this tablet low, this tablet is a keeper!!", "Title": "Kindle 8.9 hdx is Awesome!", "Date": "November 9, 2013"}, {"Author": "Charlie G", "ReviewID": "R22K59781PHWLS", "Overall": "5.0", "Content": "I've had the Kindle Fire HDX 8.9 for almost a week and find it a joy to use.  My first reaction when taking it out of the box was how light it is!  The next reaction is its thinness and form factor...you have to marvel at the feel of that thin body but it also seems sturdy (I did try to gently flex the body but it didn't flex).  Then I tried out the new power button which is a great improvement over the Kindle Fire HD 8.9...easy to locate (in spite of the fact it is on the back of the left side), in an intuitive location and easy to depress.  When the screen comes alive it is exceptionally sharp, colors are vibrant and even smaller text is easy to read.  After the set-up which was straight forward, I got to test the new faster processor and was pleasantly surprised...FAST and SMOOTH!  At this point I start rapidly going from one app to another app to calendar to email and the HDX stays with me without lag...this is the real deal!  Now to access the internet...very smooth.  Now I decide to stream a movie from my video library and again smooth and no lag, really good sound quality and...yes, that beautiful screen.  Ok, now for playing music from the cloud...I select a song, it starts playing and the words to the song are displayed as the song progresses which falls into the neat factor category.  I then had a question, looked at the built in manual which didn't provide the answer so I tried out Mayday.  Just as advertised I had tech support on the screen within 15 seconds and after a short explanation of my question the tech talked me through the solution...even taking over the screen for a moment to show me something.  Amazon is on to something with this Mayday...you do not have to experience frustration if you bump up against an issue you can't quickly resolve on your own.  The tech support is friendly, empathetic and anxious to solve your issue...and it happens almost instantly.  For non-technical people this is a particularly wonderful benefit of owning an HDX!!  Amazon's competition should be worried about this feature of customer service.I am not yet sure what to make of Amazon's decision to not include an HDMI out which I used on my HD 8.9 and enjoyed a lot.  I have ordered a miracast compatible device for my tv and will see if that provides the same quality of mirroring that I got with an HDMI cable linked between my HD 8.9 and the tv.  More to be revealed.UPDATE ON MIRACAST DEVICE:  I received the Netgear Push2TV miracast device and after hooking it up to the tv (without firmware update) and connecting the Kindle Fire HDX for mirroring mode, the mirroring was excellent!  Movies streamed from my Library on the Amazon cloud to the Kindle Fire mirrored to the tv without any latency.  Everything else including web surfing, display of photos (either on device or on the cloud), music, etc. mirrored flawlessly.  I attempted the firmware update but ultimately had to call Netgear tech support due to very poor instructions that come with that product(I will deal with that in a review of that product).  So, Amazon's decision to not include an HDMI out is justified based on my experience with mirroring.So, my early reaction to the Kindle Fire HDX 8.9 is that it is very light, thinnnn and very responsive.", "Title": "Light, Fast and Smooth", "Date": "November 12, 2013"}, {"Author": "Peter R. Forshay", "ReviewID": "R1U1KZ64TCAB2T", "Overall": "1.0", "Content": "My Kindle Fire HDX 8.9\" became unresponsive while trying to delete videos.  It then shut itself off and won't turn back on.  Amazon support tried one restart cycle (hold the power button for 20 sec, then press once more to turn on) and gave up.  Of course it is out of stock at the moment, so the replacement won't get here before leaving for Thanksgiving travel, which I specifically ordered it for.  Time for a refund I guess.It also might be worth noting there is no gmail app.  It's not a deal-breaker, but surprised me.UPDATE (Nov 20)Amazon reported more 8.9\" HDX in stock shortly after my initial support call.  They are currently rushing me a replacement to get here before I leave for vacation.  I'll update my rating if the replacement works.  One of the support emails I received also indicated they have been able to recreate the issue with deleting Prime videos and are working on a fix, for what it's worth.", "Title": "Broke after 48 hours", "Date": "November 17, 2013"}, {"Author": "Illusionofcntrl", "ReviewID": "R1BEZHU26JHTSU", "Overall": "3.0", "Content": "The HDX hardware is great. It's amazing to me the advancements in 12 months (seems like Moore's law is 4 x's faster with tablet tech) when comparing the HDX against the HD. Not only is the HDX much faster and lighter, it just feels better. Don't get me wrong, I'm a fan of the HD, but the HDX is just much more refined. The HD now feels clunky in my hand (if that makes sense). The HDX is feather light, and well trimmed it fits better than the previous generation. Peformance, it's running a snapdragon 800 quad core processor it's fast. Noticeably faster than the previous generation HD. Graphics are as advertised. The device is top notch from a hardware and look and feel. The 8.9\" form factor can't be beat it is the right size for a tablet.The addition of the volume and power button on the back is a step in the right direction. The addition of the rear facing camera another positive (it takes great pics and vids and includes panorama). The custom Android OS Mojito 3.0 is smooth and well thought out.Overall, everything Amazon advertises about the device seems accurate. In my summation  it's flawed in only one way. However, this flaw will keep me from purchasing future Kindle fire devices. I would recommend making sure you are OK with this flawed approach before deciding to purchase. Much like the original Fire, the HD, and now the HDX does not allow access to the Play store. At first that might not seem like a big deal. Amazon has a decent app store with a fair amount of applications to chose from. However, if you like Youtube, Chrome browser, Battlefield 4 Commander, Gmail, and a host of other apps that many folks use daily you won't be able to get them easily. The worst part is that Amazon doesn't even give you the option to have access to the Play store (other tablet manufacturers do - Samsung). I'd be willing to void my warranty, or lose support for my device if they'd just give us the option of having access to the play store.Your options for getting the apps you want on your Kindle HD/HDX? You can side load. Which means getting the .apk from another device and loading it onto the Kindle. Using a couple of programs you can mostly side load fairly easily once you know how. It works but any updates to the application and you will have to complete the process again (if you want the most current version) and application are updated often. Your second options is to load an alternate app store like 1mobile. The risk of this is that you will increase your chance of downloading an app that includes malicious software. This can happen on the play store as well, but it is more likely to occur on alternative app stores.Strongly consider this weakness before purchasing. If I had play store option, I'd give the Kindle Fire HDX 5 stars. Without it, I can only give 3. If you want the applications that everyone uses, you need to look elsewhere because the HDX might have great hardware but without the applications you will be limited. It's a shame that Amazon has taken this approach.", "Title": "Hardware is 5 star, lack of play store access continues to kill this great device", "Date": "November 26, 2013"}, {"Author": "Kaio", "ReviewID": "R1WDBBPUA7MK42", "Overall": "5.0", "Content": "I was an early adopter of the Toshiba Thrive tablet, and after only 2 years, it started getting wonky; (random screen flickers and CPU hiccups.)  So hubby and I decided to splurge and upgrade to the new Kindle Fire HDX.  This is the one and only Kindle Fire review I'll write, because it's the one and only Kindle Fire we plan to use until it bites the dust, which hopefully won't be for awhile.  I'm not just reviewing the HDX for self gratification and vote collecting; I'm writing this because it's finally in my hot little paws, and I genuinely love this tablet.There's an old Native tradition of extinguishing all campfires and going dark, prior to igniting the New Fire.  It's a time for reflection and rebirth, and very much how it felt rebooting our tablet experience; going dark until our new Fire HDX arrived.  So we extinguished our Thrive, offered it up to the Amazon Trade-In gods, and applied the gift card bestowed upon us to our HDX purchase.  Embracing the stillness of our techno-blackout, we postulated the coming spark of a New Fire and reflected on what we really wanted in a tablet.  We're avid Amazon customers, and figured it's time to make the most of it, so we upgraded to Amazon Prime ahead of our eminent Kindle experience.  There always seems to be perks for Kindle users, and we wanted in.  We came to realize that much had changed with tablets these past two years since we had our Thrive, and felt confident in our decision to take the leap with an HDX.  Amazon has a solid reputation for innovation, so when our trusty Thrive stopped being so trustworthy, Kindle Fire HDX was the first, and only, tablet we considered.When the brave delivery warrior pulled his steed up to the curb, my anticipation was palpable; my coveted precious had finally arrived!  I'd visualized this moment for weeks:  my new HDX cradled atop a velour and golden tussled pillow, shrouded by sunbeams and halos, angelic harps crescendo as trumpeters announce the entrance of my coveted new gizmo -- or perhaps it was just in a plain brown shipping box; I can't recall.  My heart was all aflutter, and I was effervescent with excitement, so I might be romanticizing the moment a tad.  Either way, all hail HDX!Is it just me? But whenever I open a new piece of tech, I get all tingly inside; cracking the outer seal, opening the box, getting a waft of that new toy smell -- a blend of fresh circuit boards, and static-free factory environments.  Not a spec of dust to be found as you peel back the protective stickies to reveal that glistening new gizmo. I see why they call it \"Fire\" because it feels smokin' hot in my grabby little paws.  In some ways, it feels like Amazon actually read my Thrive review and the exhaustive comment section, because I see many wish-list improvements implemented into this new Fire I'm anxious to ignite.> AmazoidAmazon's tablets are hybrid Android OS. Coming off my Thrive with Android ICS, this was the one area I was most concerned about. Would I like Amazon's hybrid; or would I miss my standard Android OS?  When I told a friend we were getting an HDX, she was surprised, \"you're both such avid techies, and Kindle Fire seems to be less than a full-fledged tablet.\"  Our friend wondered if we'd miss having a true Android experience.  We had the same concerns, at first, but then started to wonder, what is a \"true\" Android experience anyway?  Different menus and a home screen? Pffft!Sure, Amazoid is a bit of an adjustment; it's completely idiot-proof and more closely mimics what little exposure I've had to Apple iOS, with the addition of carousels.  I'm still a bit concerned that Amazon's hybrid will be overly restrictive, compared to my Android experience, but so far, I like it.  Not having access to Google Play Apps may be the biggest adjustment, but I'm confident that I'll figure out an acceptable workaround, or just learn to live without.  Truthfully, I rarely visit Google Play anyway, and don't need access to endless dreck and borderline malware apps.  I already rent and buy all my movies and books here on Amazon, so other than possibly a few specialty apps, Google Play won't be missed.As far as the OS and my \"true\" experience with it, Android hasn't been around long enough for this to be a huge change for me.  An OS is like a tablecloth -- you need it to dress and protect the table, but hardly notice it once the meal arrives.  In reality, I do far less geek stuff with my tablets than I do with my laptops, so I think I'm good with the lateral OS shift. Even Windows 8 has made the lateral shift to a more homogenized OS experience, (though I far prefer Win 7,) and iOS is literally giving away the latest iteration of their Mac operating system.  So like it or not, the trends are clear: the all-mighty OS isn't the crown jewel it used to be; sure, it matters to share holders, but doesn't add up to much for rest of us.  It's about the gizmo, not the set dressing.  Homogenized operating systems are here to stay, and ultimately, it's a good thing.  And you can bank that future iterations of Android will follow these same trends.I'd say the differences between Amazoid and Android are negligible from a technical perspective; each has its advantages.  The biggest difference comes in the presentation and general user experience.  Fire is activity based, so the standard Android desktop has been streamlined to favor a more inviting and user friendly interface; clearly marked menus, pictorial carousels, all easy to follow and beckoning to be touched and explored.  Fire feels more like a consumer based experience, rather than a technological one.  Sure, Android is simple, but it still felt like I had the ability to do some computing, on some level.  But it also had its share of hiccups.  Whereas, Fire HDX, is a more controlled environment, centered around activities and experiences, yet with the versatility for productivity and business, and enough horsepower to please the nerdiest of geeks (like me, and the Big Bang clan.)  Fire's copy line, \"Designed to do it all\" pretty much covers it.  And I have to say, I'm quite impressed.> They Listened!The 'Zon actually cracked open the Suggestion Box!  Amazon reviews are a bit like trial by fire (coincidence?) in that, every flaw is magnified, and products live and die by customer commentary. From what I've witnessed in the exhaustive comments in my Thrive review, and read elsewhere about other tabs, Amazon seems to have actually paid attention to what's being said in our complaints and wish lists, and tried to address the most common issues. Fire HDX has clearly built upon it's multi-generation iterations; it's refined, elegant, very well thought out, and precisely executed.  This is the tablet I wanted in the first place. The only thing missing, is a replaceable battery, which would have been cool (hint-hint, Amazon) but likely unachievable given the sleek design.> Second ScreenI got the Thrive primarily for 2 reasons - ports, and a replaceable battery.  Turns out, I didn't use the ports nearly as much as I thought I would; the full size HDMI was just a pain, because I'd rather have wireless.  Enter Fire HDX -- Amazon made the genius move of adding what essentially adds up to wireless HDMI -- wish granted; thanks Amazon!  Second Screen can play movies or content from your Fire, directly on your HDTV, freeing up your tablet's screen to check email, fling some Angry Birds, or just control the video on your HDTV with Fire's play, pause, etc. controls.  Sweet!  I have an HTPC setup, so not sure how meaningful Second Screen will be for me in the long run, but I can't wait to really delve into it!  Definitely a high-end, trend-setting feature; Gold Standard, for sure.> MiracastSimilar but different to Second Screen. This feature wirelessly mirrors your Fire's screen on your HDTV. I liked doing this with my Thrive, but came to hate the HDMI cable tying me down. You haven't really experienced Angry Birds until you play it on a 50\" screen! We definitely will be looking for Miracast accessories.  Just a natural addition to my HTPC setup, and sure to be another Gold Standard option others will copy. Yet another indication that Amazon went all out with Fire HDX, and this geek is impressed.> Anorexically ThinOnly, in this case, that's a good thing.  Fire HDX is literally half the thickness of my Thrive, and half the weight too.  I loved the grabby feel of my Thrive, but over time, I admit it was awkward due to the thickness and weight; especially inside the case.  It was like carrying a textbook.  Fire HDX is thin, but doesn't feel like I'm holding a metal tray, or a techno exoskeleton. It's comfortable in the hands and feels solidly built.  And it's svelte silhouette makes it super easy to tuck away and take on the go.> Screen of Tech GodsThe Fire HDX screen is a nerd guru's dream, and anyone possessing the gift of sight will appreciate it's beauty and clarity. Stunningly vibrant, excellent viewing angles, dripping with saturation; I wish my HDTV had pictures this good.  The screen on this HDX is clearly the crown jewel of all it's impressive specs; it's just that good. Words simply don't do it justice.***Hey Amazon*** - How about making a 60\" Kindle HDTV with a stunning screen to rival my new HDX?? Goosebuuumps!!> 10.1\" vs. 8.9\" vs. 7\"I thought I might miss my Thrive's 10.1\" screen.  Truthfully, I hardly notice the transition to 8.9\".  The slightly smaller size helps make HDX lighter, thinner and easier to handle.  Plus the difference in screen quality is so stark, that I could care less that HDX is 1.2\" smaller than my old Thrive.  The 7\" HDX is just downright cute!  Hubby really loves it because he thinks it'd be easy to slip into his cargo pants pockets and take on the go. He may get one, but for now, we settled on the 8.9\", which has proven to be the absolute perfect size.> No Screen Protector RequiredI'm usually a big fan of those military engineered, 'helicopter blade' screen protectors.  However, I have NO plans to dilute or mar the beauty of this gorgeous HDX screen!  Much as I believe in screen protectors, in this instance, I liken it to keeping a posh leather sofa in plastic. This screen is far too nice not to enjoy it as it was meant to be seen. No way, no how, am I covering this beauty with a ten buck screen protector.  Besides, I trust my Origami Case to protect my HDX in style.  If a worthy screen protector presents itself, I might consider it; but for now, it's 'au naturel,' baby.> 16gb vs. 32gb vs. 64gbIf you want to make a budget friendly decision, this is the place to make it. I'm glad Amazon didn't bother making an 8gb tablet; utterly useless.  16gb is decent, but you will definitely have to keep an eye on your storage.  And keep in mind, storage tends to get wonky the closer it gets to full capacity; so be sure to leave yourself some room to spare.  64gb was tempting, especially if I start getting into downloading movies.  But personally, I sprung for the 32gb as it fit my budget and needs best.  I was only using 14gb on my old 32gb Thrive, so I knew 64gb was an indulgence, not a necessity.  And I'm not exactly conservative with what I'll load up on my tablet.  I delete apps I don't use, simply because I no longer want them, not because I need to conserve space.  And I already loaded my HDX with 5gb of Michael Jackson MP3s alone, so I'm not shy about taking advantage of the storage I've got.  Yes, I do own a 5gb waft of Amazon's Cloud storage, but I'm the kinda guy who doesn't want to put their faith in a solid internet connection being available at all times.  Hiccups happen.  I do use the Cloud for some stuff, but local files can be played anywhere, at any time, no hiccups, no data fees. The Cloud is good for storage and convenience, but when it comes to my most important and frequently used files, I want them stored locally for guaranteed access and privacy.*Even Better: Seagate Central 2gb Personal Cloud - access your files from anywhere in the world.  Works great!***Cloud Tip*** - Sure, the cloud is great for storage and convenience, but just don't be surprised when that \"breaking news\" hits about how these tech companies are reading all your documents and looking at all your \"private\" files.  It's been happening since the McCarthy era, at least; now with modern tech.  If I can track my own GPS location and activate my tablet or cell phone's cameras remotely, then I expect others to be able to do the same.  As we know, Amazon 'targets' all of us quite effectively, so it's hardly a big shocker to think others can do the same.  I expect no less, and am somewhat ok with it when people I trust are in charge, and not so thrilled when it's the other guys. If you wanna keep something private, then keep it off the Cloud and keep it to yourself.  It's that simple.> Great Dual CamerasHere's another area where Thrive just sucked over time. I didn't mind the lack of a flash at first, but it soon proved to be a real pain.  Conversely, the dual cams on my HDX take excellent quality pictures. The focus is great, and doesn't take long to zero in on the target.  And the dreaded delay most gadgets have after taking a pic is miniscule to nonexistent.  The LED flash is a HUGE Bonus!  I really came to miss that on my Thrive.  The menus and pic galleries are well laid out, and renderings are fast; just a pleasure to work with all around.***Privacy Tip*** - Keep tabs on what your front facing camera is doing!  My Thrive's front cam used to kick in all on its own, and the little LED would come on, alerting me that the camera was active. Either this was a tech glitch, a rogue app, outright nut-job, or Big Brother was watching every once in a while.  I ended up placing a sticker over the lens since I rarely used the front cam anyway, and didn't like the idea of being spied on by Edward Snowden, or the like. Haven't noticed anything like that with HDX, but I got my eye on it.  So, look sharp, people; that front facing camera may not always be your friend.> Wifi vs. 4g vs. TetheringIt all depends on your needs. 4g will have ongoing fees, and arguably, isn't needed with all the WiFi Hotspots popping up.  (Google is literally launching WiFi balloons into the atmosphere!)  Plus, I'm not fond of Verizon or AT&T.;  (More of a Sprint fan, particularly their budget offshoot, Boost Mobile.)  But if your budget is ok with the data fees, and your needs require it, then go for the 4g model. Just be aware, there are alternatives.Personally, WiFi is all I need. And HDX's dual band antenna really does work quite well; connections are great, with excellent range. However, I do occasionally need the convenience of a 4g data connection, but I do it so infrequently, that an outright data plan is just indulgent.  Besides, I already have a cell phone with unlimited data, and don't feel I should have to pay for that feature twice.  My solution?  I just got the LauncherPro App for my cell phone, found the hidden menu that enables tethering without rooting, and voila -- I can tether my HDX to my cheapo LG Marquee Boost Mobile phone wherever I want; all with unlimited data for $40 bucks a month.  (If you're curious on how to do the same, just poke around a little with LauncherPro on your Android phone; you'll figure it out.  Google search is your friend.)  Truthfully, I rarely tethered my Thrive, but I like knowing I have the capability if needed with this new HDX.  It's more cost effective than being saddled with outright 4g, and I'm not stuck choosing between 2 cell companies I don't like much.***Dear Amazon Gods*** - I've been a very good boy this year.  And I need a good pay-as-you go cell phone.  Kindle Mobile please?  If it's as well thought out and constructed as HDX, I'm in! And pretty please - don't price gouge us by charging extra for tethering.  Tablets are just oversized cell phones when it comes to how they process data.  So just let us tether for free, will ya?  Thanks; cookies and milk are on the table. Love, Kaio> Rooting - Don't Do It!I used to be a fan of it, now I'm not. Frankly, you're putting a lot of faith in the people who created the hacks (yes, \"rooting\" is just a euphemism for \"hacking.\")  Personally, I'd rather not trust complete strangers to imbed whatever hacks they've created into a tablet I use for banking. I'm just funny that way.  And since I figured out how to tether with my cell phone via the hidden menus, rooting became obsolete in my world.  Plus, the ROMs never offer all that that much really, and certainly not all the hackers claim; like improved battery life. It's more about driving website traffic to the host sites, and entertaining clever ROM gurus, rather than any tangible benefit, IMO.These guys are smart, no doubt about it -- that's what scares me.  I'm not interested in being some tech genius' beta tester, nor do I care to unleash their rogue code into my devices and willingly breach its security.  Chances are, it's all good and harmless ...probably ..maybe.  But for me, the slim benefits hardly merit the lingering doubt.  The few ROMs and hacks I've tried literally needed me to turn off my firewalls and security software just to work with them, because by definition, they are Trojans.  Sorry, but I'm just not that trusting anymore.  So, ixnay on the rooting for me, thanks much. Proceed at your own risk.Having said that, I would consider rooting if I end up hating the more restrictive Amazoid experience, or decide I just can't live without Google Play Apps.  But at this point, I seriously doubt I'll do it.  I just don't trust it.  Plus, I already know how to get the apps I want onto the HDX directly, including Google play, all without rooting, so I'm not worried.***No-Root Tip*** - I'm not going to advise anyone on how to tweak their HDX, so there's no need to ask.  But I will point ya'll in the right direction -- Google \"how to side-load apk's\" and you'll figure out the rest pretty easily on your own.  If that doesn't work, I'm 100% confident there's another workaround that doesn't require rooting.> Amazon Fresh AppSpeaking of apps, I consider it a privilege to live in an area where Amazon Fresh is available.  Ordering groceries and electronics from my HDX for same day delivery is pretty dreamy; we just LOVE it!  We've been getting grocery delivery, on and off, for years now, so the switch to Amazon Fresh fits our lives perfectly.  The app works great, and we love seeing all the new green trucks humming around town; cannot recommend this service highly enough -- go Amazon Fresh!***Tip - Other Must-Have Apps***-- WiFi Analyzer App - use this to test the WiFi signals around any of your WiFi environments.  Find the best sweet-spots for optimal connections.  If you're super adventurous, get a couple of High Gain Antennas for your router and watch your signal spike!  Just be sure to enable MAC filtering to keep any pesky neighbors from slipstreaming your network.-- Kaspersky One - Antivirus and Internet Security for 5 devices under one low-cost license; any combo of PC, tablets and phones, up to 5 devices.  The app itself can be loaded via a direct link from Kaspersky or the included QR code.-- Team Viewer - remotely control your PC with your tablet while away from home!  Easily transfer files from PC to PC, or even PC to MAC.  Works great. I've tried them all, and this one is still my fave overall. Can't wait to see HDX's iteration of this feature (coming soon!)And now, back to our regularly scheduled programming...> HDX Ergonomic AppealI love the way the volume and power buttons are placed; very natural and comfy to use.  This tablet was clearly designed to be held.  A lot of thought went into form following function, and how this tab naturally rests in my paws.  The weight is distributed well, and it just feels right to hold it; be it 1 or 2 handed.> Additional 2 Year WarrantyThis Verified Purchase would be your clue that I'm not just fishing for votes to up my reviewer rank; I'm a real HDX user, and this is my new day-to-day tablet for the foreseeable future.  I rarely buy extended warranties. I consider tech toys to be somewhat disposable, hence why I traded-in my Thrive as soon as I saw signs of age.  But Fire's extended warranty is actually worthwhile.  It covers accidental damage, and has free replacements shipped out prior to sending the damaged tablet back; replacements are probably refurbs, but still a nice touch.  The warranty also includes battery failure, screen cracks, and zero deductable. For 90 bucks, I'd say that's a good deal, so I sprung for it. Though, given my Thrive started to getting goofy at just 2 years old, I wish this warranty was for 3 years instead.  But I'll take it for the klutz factor, just in case.  (Check my review on the warranty product page if you're interested!)> Origami Case - The Cherry On TopIngenious! A true 'must-have' accessory. Love how it folds to accommodate multiple viewing positions. Love how it turns the HDX on and off automatically.  Love the feel, magnetic fit, and how the camera turns on automatically when you slide the tablet up.  At first, I wanted the polyurethane version, cuz I like the feel and SciFi look.  But I ended up going for the Blue Leather Origami Case because it just seemed classy.  An HDX without this origami case would just be incomplete. I love everything about this case and can't imagine owning the HDX without it.  Perhaps a tad overpriced, but that'll likely drop as HDX settles in.  More colors, please!> Cool SpeakersThe sound from HDX is surprisingly awesome. This is one area Thrive just sucked at, even with the Volume+ app.  But HDX is fantastic.  The custom Dolby really does enhance the fidelity, and I don't feel the need for any audio booster apps.  Naturally, if I wanna shake the house's foundation, I'll be using my home stereo.  But for tiny little speakers, I'd say HDX is as good as it gets. Plus, it's very cool how the origami case reflects the sound. Genius design. Amazon's really just showing off how clever they are with that one.  Kudos!> Where's My Charging Dock?I really liked the convenience of the dock for my Thrive and really thought I'd miss it.  But I'm guessing there will be plenty of goodies and accessories to buy for HDX. The good thing about standardization, like iPad, is that accessories are easier to come by. Same is true for Kindle. But I like the origami case so much, that I really see no need for the dock anymore. So I splurged the extra dough for the case, and have all but forgotten about my old charging dock.> USB Charging PortA universal USB charging port that works with most any standard charger?!?! What the!?  Give that genius a raise and a corner office!  HDX charges faster with the included charger, but nice to know I can use any USB charger handy, wherever I may be.***File Transfer Tip*** - I made a big to-do about wanting the convenience of USB ports to connect my Thrive to my laptops so I could easily transfer and backup files (too bad you couldn't charge via those ports.)  Newsflash - there's a whole bunch of apps out there that help you do direct file transfers to computers wirelessly (Astro File Manager and AirDroid are personal faves.)  Then there's DropBox and Amazon Cloud, so options are plentiful.  I'm a bigger fan of wireless than I am of wired, and have come to realize ports aren't as important as I first thought. Wireless HDMI, wireless file transfers between tablet and PC; Fire HDX is where it's at and I'm good to go!> Battery LifeThe truth of this one will be told over time, but for right now, I'm quite happy with it.  I'd say the 12 hour estimate is pretty close for me, though probably a bit less.  Screen brightness and data intensive apps will hit the battery hardest.  So naturally, I expect my battery life to fluctuate, depending on what I'm doing and how much luminosity I'm dripping from this gorgeous screen.  I just wish the battery was user replicable, but that likely wasn't possible with the ultra-thin body design.  Battery failure is truly is the one area I'm concerned about most; hence why I sprung for the extended warranty.> BluetoothI rarely use it on any of my devices. Just not a fan cuz I think it's one of the top causes of battery drain and OS abnormalities; faulty technology in IMO. But the signal seems fine. My array of stereo headphones sound good, paired smoothly, and stay connected, even from across the room.  But I expect these connections to get choppier outdoors; that's just how bluetooth is.  I predict (fingers crossed) the technology with soon be obsolete, in favor of something more reliable, with less power consumption.***Headset Tip*** - My fave stereo headphones, by far, is the Sony XBA-BT75. Killer sound and rich fidelity for such tiny bluetooth headphones; though nothing beats a thumping subwoofer that shakes the furniture.> Bang For Your BuckFire HDX has many cutting edge features that another nameless tablet would dole out once a year, and expect everyone shell out extra cash for each nominal upgrade. (P.T. Barnum fondly referred to people like this as \"suckers.\")  HDX is a trend-setting tablet, not a clone or follower.  This is the new Gold Standard, not a money pit.  If you're interested in what a tablet Does in the here and now, then get Fire HDX. If you're interested in owning a status symbol and being accepted by the cool kids, then, that circus is waiting for you.  I already graduated from high school and don't care to revisit that mentality.  Personally, I prefer substance over superficiality; I'm just funny that way.> Business ReadyCompared to HDX, the other Kindle Fires seem like toys. HDX 8.9, specifically, was clearly built for work AND play.  It comes preloaded with my fave OfficeSuite app for Word docs and all that good stuff.  And the specs under the hood are just unmatched.  Miracast and Second Screen would be invaluable in a meeting or presentation. And don't forget TeamViewer for accessing your work computer from anywhere in the world.> Powerhouse IndeedyI've never heard anyone complain that their computer is too fast.  Why buy such a powerhouse tablet? Because everyone, and I mean everyone, wants smooth, snappy and fast tech.  Unless your budget truly does not permit it, don't talk yourself into believing \"I don't really need that for what I do.\"  Remember those words, and live by them, every time your computer or tablet hangs or hiccups.  Don't be the idiot who buys an $80 buck budget tab, and then complains that it doesn't work like iPad.  HDX is the perfect blend of budget and power.  There's just no reason to choose a sub-par gizmo.  The difference in price is nominal, the difference in performance is stark.  The quad core 2gb processor in HDX is an utter beast. It makes my dual core, 1gb Thrive seem like a sloth.  Remote Viewing apps are fast and smooth, as do games, videos, and all processor intensive apps I personally like.> External KeyboardsI'm really not a fan of them for tablets; probably because I hate glitchy bluetooth; invariably, keystrokes are frequently missed.  Besides, I like to touch my tab, even while typing. I do have a keyboard just in case though, and do use it once in awhile. But generally, I just don't see them as necessary for tablets. It just makes things awkward.  I've tried several, and this Logitech Tablet Keyboard is my fave.> MaydayA foolproof brain-fart button that connects you to Amazon Tech Support within 15 seconds. Yup, I tried it, and it works. So glad they couldn't see me in my undies ...I hope -- Eeek!  Another cutting edge, genius feature, sure to become a Gold Standard.> My Little, Preeeecioussssssss....Must have it, I did; love it, I do.  Oh, Kindle HDX; I'm so proud of what you've become. My every dream in a tablet come true; really and truly, that's not just gushing.  Oh ok, it is gushing, but I do mean it.  I just love my tech toys; especially this new HDX!> Accessibility FeaturesKudos, Amazon. As a disabled person myself, I am highly impressed by the screen reader and accessibility options, and your decision to feature them.  But you don't have to be disabled to benefit from them. Tired of squinting at tiny text? Try out one of these great accessibility features, like the screen reader or magnifier.> Read To Me BabyAbsolutely love the Immersive Reading feature and can't wait to really delve into it. Love that Kindle books now have a new way to be enjoyed. I have wanted this feature in a Kindle app since the day I got my Thrive, and so glad that Fire has it; HUGE bonus in my book.> Special Offers or No Special Offers?I debated over this one. It's only a 15 buck difference, and the feature can be turned off at any time by just paying the extra dough.  But I wanted to save a couple bucks, so I opted for the special offers.  Plus, I figure, I'm always shopping at Amazon, so a deal or two once in a while is probably a good thing. However, please keep the ads targeted, Amazon. Please don't start advertizing a bunch of crap to me that my purchase history does not justify. Keep it specific to my needs, and Never, Ever, automatically start playing movie trailers or outright commercials. If I wanna see them, I'll click on it; otherwise, silence is golden.  Last thing I want is my tablet berating me with blatant, noisy advertizing; making a big to-do about something I don't give a crap about. Otherwise, I'll just pay the 15 bucks and dump that feature in a blink.  Do, however, offer me coupons, promotions and deals for stuff you know I'm interested in.  Everyone loves a good coupon!> Holy TrollersYup, it's a real thing, and pretty much what it sounds like; a few highly motivated ones have been stalking me here on Amazon for years, and I'm bored of being 'effed with.  So I took a hiatus from comments a good while ago, and now just focus on trying to write good reviews.  Amazon's new question & answer format integrated into each product's page is a positive step in the right direction, and likely where I'd focus my time if I feel the urge. Perhaps this review will pull me out of my hiatus; so comment away!> Bottom LineThis review is my sizzle to Kindle's Fire; I hope I did this fantastic tab justice.  If you're still reading this, you deserve a prize; I have none for ya, but you deserve one all the same. Perhaps give yourself the prize of a Kindle Fire HDX; and don't forget to nab the Origami case! (Would you believe I even had to shorten this? Looks like I finally found Amazon's review limits.)Yes, I'm one of those nerds who gets excited by tech.  I'm not sure how valuable my skill set is in the real world, but I know gadgets, and HDX gives me goose bumps.  Stunning picture, fast processor and graphics, excellent sound, solidly constructed, superb design, ingenious origami case, and screen readers; plus, Gold Standard features like, Second Screen, Miracast and Mayday tech support -- this tablet is a dream.  Sunbeams, rainbows and angelic harps all over again.In a perfect world, I would have kept my old Thrive forever.  But I'm glad I traded it in while it could still be useful to someone, and was still worth a decent trade-in value to me.  (My gift card from Amazon Trade-In basically got me a free 2 year warranty and origami case for my new HDX.)  I'm thrilled to have made the leap to my new HDX, and absolutely love it!  Now, Amazon, please get busy on that Kindle TV and Kindle Mobile cell phone.  I want your iteration of those toys next! (No doubt they're already in the works.)>>Parting Thoughts<<Haiku of Kindle Fire HDX 8.9 32mb WiFi(*a-hem*).........origami cHictechno-electro-Docious..................maX-azon-azing!Updates likely to follow ...possibly ...maybe ...probably. Meh; whatever.Happy! ;oD*Disclaimer* - The opinions expressed in this review do not necessarily represent anyone whose opinion matters, anyone cares about, or that the author himself remembers typing, though he stands by each and every word vehemently.Time to go play ...HDX style!", "Title": "Invincible! - Kindle Fire HDX Kills Thrive in Cold Blood", "Date": "November 7, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R25MMUS6XKDANU", "Overall": "5.0", "Content": "I am upgrading from my original 8.9\" fire. WOW!! lightning fast, great viability in bright sunlight, Connection to the net great. Sound much improved, light as a feather. I could not be more satisfied. What an improvement! I recommend the Fire HDX to anyone looking for a super fast, well designed tablet. Especially if you are a  book reader, surf the net (which with the HDX is so much faster now it's hard to even compare to the original Fire 8.9\"...... I bought the 32Gig, with WyFi. I didn't opt for 4G. I can only imagine how that could make it better. The Fire HDX 8.9\" 32 GB gets 5 Stars... because there aren't 6 or more.Dr. Geoffrey Britt", "Title": "Unbelieveable how much improved....", "Date": "November 9, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RS4F9T8L9WG8X", "Overall": "5.0", "Content": "Finally, Amazon learned as how to make an excellent tablet. It has all the features you want - light enough to hold on one hand, best resolution in tablets, all the apps that most people use (I am assuming that 80% of the folks use 20% of the apps), outstanding exchange email app that sync contacts with facebook, front/rear facing camera and last but not the least - very fast. Top it off with all the content and the best cover I have seen for a tablet - There is the perfect combination. I bought the wifi version and after 15 minutes, I wish I had ordered a 4G LTE version. It is so good that I want to be able to use it all the time wherever I am. Also it doesnt have a Youtube app, but the safari browser can play youtube in HiDef. So for me, it works!Folks, you wont be disappointed by getting one of this.", "Title": "Finally Amazon Matched or exceeded Ipad", "Date": "November 9, 2013"}, {"Author": "John", "ReviewID": "RS25EF00XLSEJ", "Overall": "5.0", "Content": "Alright, I've been using a Galaxy Tab 8.9.  It's been a good tablet, a workhorse for me, but it's past it's prime.  I initially balked at the Fire when it was first introduced.  Not enough apps, the presentation was so different, etc.  But a few months ago, I ran thru all the apps I use every day and they were all offered by Amazon's App Store.  Combine that with the fact that I'm an Amazon super-user, I decided to take the plunge and get the Kindle HDX 8.9.Well, I've been using it non-stop for about 6 hours and it's awesome.  Display is fantastic, very light, Everything loads fast, video streams well, and my books look great. (No blue tint on border that I can see.  I've read in different settings and lighting, and no color tinge of any kind.)As an Amazon Prime and Audible member, I was also looking forward to their integration into the Fire.  It is great!  Amazon Video is fully integrated and I can even download some shows, apparently.  Haven't tried it, but looking forward to it.  Great option for traveling, I think.  And with Audible integrated into the Fire, you can do immersion reading if you own both the Kindle and Audio versions of a book.  That sounded cool to me when I heard it . . . and it is!  I recommend it to all readers out there.  A lot of great deals to be had as well i.e. Many Kindle books have a deal that once you purchase the ebook, you can purchase the Audible version for $.99-3.99 Great deals.The only thing I'm working thru is getting used to the interface.  It's pretty, and it makes sense, but it's new to me so there's a bit of learning curve.  But I'm getting there.Lots of other bells and whistles, but that's my initial impressions.  I wholly recommend it to anyone looking for a high performance tablet at a reasonable price.", "Title": "Very Cool", "Date": "November 7, 2013"}, {"Author": "Jackie Gill", "ReviewID": "R3LUD8QO8WX33L", "Overall": "5.0", "Content": "First, I am giving this 5 stars because it really is beautiful, has an outstanding display, and is very light. However, it does have some limitations.What I like:The display! I have had an original iPad, a 4th generation iPad with Retina, and an iPad mini - this display blows them out of the water.The speed: This pad works flawlessly. There are no hangups, no freezes, and no stuttering during video playback.iCal CAN sync with this: Many will say that your iCal cannot sync with your Droid based devices. YES IT CAN. All of my computers are Macs and I love iCal. Furthermore, my Macs store all of my contacts and task lists. There are apps that will sync your contacts, calendar, and your tasks. I use CalDav-Sync available via Kindle store and Google play and everything I update on my Mac shows up on my Note 3 and Kindle HDX. I do not care for the included Kindle calendar (I am a big calendar person) so I also bought AwesomeCalendar and it is a great calendar app. CalDav also works to update this calendar with all of my information on my Mac and I never have to do a thing to make it happen.Reading Features: I considered the following before purchasing this Kindle: iPad mini with retina, Samsung Note 8.2\", and a Kindle HDX 7. I am pretty tired of Apple products. I am not saying they aren't great, and it is the only computer I will buy, but I like new things. Each time I purchased a new i-product it seemed so much like the previous that it just didn't feel new. Therefore, even though the new Mini with retina is beautiful, I ruled it out. I really like the size, shape, and feel of the new Samsung Note 8.2.\" Samsung went back to black and moved away from that strange brown decision and I love the ability to use the stylus. Plus, I also switched from an iPhone to a Note 3, so this means all of the Apps I have purchased in Google Play would be available for my pay as well. So, this being said, the Samsung Note 8.2\" was almost my new pad. However, it is very similar to my Note 3 and the the Kindle beats everyone in one area: READING. Yes, you can get the Kindle app on your other products, but you can't get immersion reading. I have not built my library via iBooks, luckily I have purchased all of my books via Kindle. So, when I opened my box and pulled out my new Kindle, they were all there. I am a PhD student in the dissertation phase, so I read A LOT. not all of my books have been available via Kindle, but when they are they are less expensive and I love the note taking features. I do think the note taking features and highlighting works better on the Kindle than it does through the Kindle app. You are allowed multiple highlighting colors to choose from, it keeps track of my notes and reading on all of my devices, and you can get the audio versions of the books (if available) for very good prices. I have been an Audible fan for a long time. I know many do not care for audio versions, they prefer to read. Immersion reading combines them! This is WONDERFUL for me because I like to accomplish tasks while listening to a book, but if I need to highlight something, the immersion reading will show me where I am and I don't have to hunt. This is a big upgrade and what tipped my decision to make this purchase. Now, at the time I was not thinking about actually carrying this thing around while I listened, and the 8.9 is a little large for that, perhaps the 7 would have been the better choice, but the 8.9 isn't too heavy and I can always listen on my sisters 7\", or i-product if I am moving around and it will sync with my 8.9\" to let me know exactly where I left off.The organization of the Home screen: I really like the carousel and the folders that you place apps in. Unlike Apple app folders, the Kindle allows you to place many apps in a folder (this may have changed in recent Apple IOS updates, not sure).Weight: Very light! I like the feel of this pad. It is lighter than the iPad air and does not feel cheap to me (the 7 inch does not feel substantial enough to me).Aesthetics: I love the all over black! I find this to be a beautiful pad. Comparing it to the iPads, I cannot say that one is better looking than the other because I think they are both beautiful in their different ways; however, this has a rubberized back that makes it MUCH easier to hold onto. I also prefer the shape. iPad is a little wider and I don't think it is necessary. I prefer the more 16:9 shape. I had a very difficult time deciding on whether to buy this because of size. I found that an 8\" display was perfect. The full size iPad was too large and too heavy. The iPad mini was just right, although I still prefer the more rectangular look of the Kindle 8.9\" and Samsung 8\". I felt the 7\" Kindle was just too small. The 7\" feel a little cheap to me and there just isn't enough screen for reading. Moving back up from the 8\" mini made me nervous. I will say that I do wish this Kindle was slightly smaller. Even moving down to an 8.3 - 8.5 would probably help, but it is not overwhelming. I am still happy that I chose the 8.9\" over the 7\" and I really do like the size and shape when viewing movies.Ability to download free content: One of the big pluses of a Kindle is Prime. I know you can download content from iTunes and get movies and such that way, but I have NO DESIRE to pay $20 for a download I will watch once. We take a road trip every summer and WiFi/4G is not always available. Plus, streaming via 4G eats up a lot of data. So, I wanted to be able to download movies and TV to watch on the road. You can do this with Prime and they do have free content (I'll also discuss this more under what I don't like). Amazon also gives away a free paid App a day. This is pretty cool. I log in every day and download most of them. Most are games, I would like more variety, but they are free :-).Origami Case: if you buy the Kindle HDX 8.9 or 7, I highly recommend the origami case. For my previous i-products I have purchased multiple cases and contraptions to hold them where and how I wanted them. Never has any case been as nice and met all of my needs like this one. I did and do not like the price of this case. It is about even with Apple brand leather iPad cases, but those are incredibly overpriced as well (and I do not like Apple smart covers, they are far inferior to this case). However, this case, at least, does a GREAT job. I did choose the leather and I am glad I did. It feels like a very nice quality leather, has not scuffed, smells good, and the Kindle fits it perfectly. The case also allows you to easily push the Kindle up to take photos, control power, and control volume. My sister bought one of the non-leather origami cases for her Kindle HDX 7, and while the case functions just the same and is a great color, I really prefer the leather - it just feels better, looks nice, and has a leather rather than chemical smell. The magnets in this case are great, holds very securely, and they turn the unit on and off. The case folds back flat, or holds the unit vertically or horizontally; and, if you like to read it bed, it does a great job of holding the Kindle up on your stomach or on a pillow. Again, while I agree this case is expensive, I do believe it is the only case I will need to buy for my Kindle.What I don't Like:Number one biggest complaint - DESKTOP BACKGROUND and Home screen images. You cannot change them! This is crazy to me. I did not expect this and I am disappointed. This in no way has anything to do with the function of the device, but I really like personalizing. I chose no advertising - there is enough of that in the world - and I removed the Amazon recommends section on the home-screen; but, that is where my choices ended. I cannot change the black background and I cannot choose what images greet me when I open my cover. I don't know if Amazon chose to do this because of their advertisers and/or for ease of help via MayDay (which I have never used, it isn't a complicated tablet), but I DO NOT LIKE IT. I want to open my pad and be greeted by my Boston Terrier, not a generic picture (although the lock screen images are pretty nice looking). I think this could be easily fixed via software update, but I also assume Amazon left this common feature out on purpose and doesn't plan to include it.Amazon Prime Free Content: I stream via Prime and Netflix and between the two I get most of what I want. However, I wanted to be able to download shows and movies and take them on the road with me. First, know that this EATS YOUR MEMORY. I chose the 64GB pad and it doesn't take much to fill it if you choose HD - a couple of movies and a few episodes of a show and you are full. You can choose lower quality, but it does look inferior on this exceptional screen. Downloading HD is also incredibly slow. I have pretty fast connection, but HD takes forever! That being said, the worst part is that there really isn't much to download. Sure, Prime offers a lot, however the majority of Prime cannot be downloaded. Hopefully this will change, but this is a feature that I was hoping to get a lot more out of.Size: The jump from a 7\" to an 8.9\" is pretty big. I wish they would offer an 8.2 - 8.5.\" It would be a little more slender, easier to fit in a large pocket and easier to hold with one hand. One thing I like about the 7\" is that I can hold and control it with one hand. The 8.9\" requires two hands. Still the size it much better than the full size iPad.App Store: I don't feel the app store is all that lacking. It is pretty extensive and serves most of my purposes. Unfortunately I have had to purchase duplicate apps because my iTunes purchases obviously don't transfer and Kindle does not use the Google Play store. The perfect device would allow purchases from all of them, but I get that this won't work. There are apps in all three app stores that are not available for one or the other. So, there are still apps on my i-products that I can't find for my Android devices and there are apps via Droid that I can't find for my i-products.Final thoughts: The perfect pad for me would be around 8.3 inches, include a Samsung-like stylus, have the power and performance of i-products, work with an app store that has all apps for all platforms, be very customizable, be very light, and include all of the reading features and Prime features of Kindle. It would also fit in an Origami case because it really is the best case I have used. That being said, at this point, Kindle simply offers more of what I am looking for in a tablet. I don't know if my perfect pad will ever exist, but, in the mean time, this one is pretty great!", "Title": "Beautiful, but does lack a little.", "Date": "May 21, 2014"}, {"Author": "TLS", "ReviewID": "R9BJL8VK3HJ9G", "Overall": "5.0", "Content": "I have owned a Kindle from the 2nd generation through PaperWhite.  I have looked at the Fire for quite a while but was not sure how the reading experience would be.  Then I saw I could pay for a Fire on a no-interest installment plan - so I went for it.  The marketing beauty of the installment plan is that it lets you upgrade to the larger size Fire over five payments rather than one big lump.  Memo to Jeff Bezos: smart, very smart in coming out with the installment plan.Now about the Fire experience.  It is great on all fronts - I've watched a movie, read The Week magazine, and read a book.  Looked at YouTube videos using the free app.  Downloaded other apps.  The screen is so sharp, the 8.9 size is great and it's not too heavy, the battery life is pretty close to stated, and the interface is very easy to understand.  Since I have the PaperWhite, a lot of the learning curve was already taken care of.  However, even if you have never used a Kindle product, the interface is very intuitive.Of course, the breadth and depth of the Amazon ecosystem means just about any book, digital magazine, movie, or whatever is available with one click (maybe that's why Amazon calls it \"one click\").  And Prime means you can see a lot of movies and TV shows at no cost (think Downtown Abbey, Hunger Games and 007 Skyfall).  Getting Prime if all you are looking for is video content may not be the best deal at $99 (I paid $79 in the last few days before the rate went up).  However, if you do a lot of Amazon purchases, the 2nd day shipping is awesome and on top of that you get video content!The Fire 8.9 out of box experience was great.  No defects, no blue margin haze, started up and has run like a champ from the very first moment.So here is the bottom line from my perspective.  If all you are doing is reading long form text in books, the PaperWhite is the best solution.  However, if you have ever had the desire to watch a movie, read a digital magazine, check out what's happening on YouTube, etc. - buy, buy, buy the Kindle Fire.  The reading experience is very, very good and a whole new world opens up through the diverse capabilities of the Fire.", "Title": "HDX 8.9 is Fantastic and and the Installment Plan is Great!", "Date": "March 25, 2014"}, {"Author": "Cathleen Countryman", "ReviewID": "R3LGC8U84JZUD1", "Overall": "5.0", "Content": "The color is fantastic and even better it's so easy to use which is key for me. I don't have little ones to show me how to use technology and I find this one to be seamlessly easy to use. Plus help is available from Amazon. Super usable and super high quality. I'm so happy to have this.  My sister has the I-PAD and I like mine soooo much better!  Thanks Amazon for a great product.", "Title": "I love it!", "Date": "February 1, 2014"}, {"Author": "Michelle B. \"Originally from Kansas\"", "ReviewID": "R2CM3RNHKHNGHD", "Overall": "5.0", "Content": "I've had all 4 of the iPad generations prior to the iPad Air.  I was trying to decide between getting the new iPad Air or a Kindle Fire HDX 8.9\".  My requirements were for something to take on long haul flights loaded with movies and books.  I chose the Kindle Fire HDX 8.9\" because of its size (lightweight), its resolution and access to my Amazon Prime assets. In my travels with my current iPad, I would have to clear the iPad and reset to load even two movies and 3 books.  Very frustrating.  I've had to go back to factory settings three times.  Granted I have less memory on this iPad, but.....I was a bit worried after I first got it because I had read I couldn't download any of the Amazon Prime free movies....not true....and, because I read that once I rent other movies on amazon, I could only download 2 movies...again, not true. I now have 5 movies and a ton of books downloaded....I'm ready for my next long haul.  I'll update this review after my trip.", "Title": "So much better than my iPad", "Date": "January 26, 2014"}, {"Author": "Robert K. Baldwin", "ReviewID": "R1HUSKE57PX6O2", "Overall": "4.0", "Content": "If I had done this a month ago I would have rated it 5 stars.  It still is, in and of itself; but here is the thing.  I have all Kindles!  All of them.  The first, just a reader is the best thing I have ever bought, it is perfect in every way.  It is old now and I still use it and still does what it is supposed to do.  Then I got the Kindle Fire.  It was ok but had No Volume, I sent it back and Amazon send another one and it was fine.  Not impressive but still ok.  Then came the Kindle HD.  It was great but had one dead pixel, so it went back, the replace is fine.  When it came time for the HDX I was ready!  Couldn't wait, bought it the first day available.  For better than a month it was absolutely perfect!  No problem of any kind in any way.  Then all of a sudden it had full RAM.  Could get out of its own way.  To make it worse, when I called Mayday, they had no idea what I was talking about.  They just said well you have 64 GB and only 11 GB is used so it is ok.  I explained that we were talking about RAM and that it only had 2 GB so they said well in that case it is bad!  So again they replaced it.  This one so far is perfect.  But of the four I've bought three went back!  That is too bad.  I have suggested to a lot of folks that they buy this Kindle and I do believe it is the best choice out there, but I am embarrassed that of those my friends have bought some of them have already gone back.  It is called Quality Control.  Amazon Figure it out!", "Title": "Would have been 5 stars except for...", "Date": "January 19, 2014"}, {"Author": "TEQ \"TEQ1\"", "ReviewID": "R2TBM8YBYLU85W", "Overall": "4.0", "Content": "Sound was the deciding factor when deciding to purchase either an Apple Air or an Android tablet such as the Kindle Fire HDX.  Apple puts not effort into the audio experience of their tablets and laptops, assuming, I guess, that everyone will want to use those damned earbuds all the time.  I got really tired of plugging in an external Logitec stereo device into my iPad 3 whenever I wanted to watch a movie, really tired.  Make no mistake, the HDX's speakers don't generate a concert-like experience, but it's far better than the iPad Air.  I also found the reduction in size and better display resolution to be helpful for reading.  Easier to hold, and fonts are rendered far more smoothly on the HDX display than Apple's retinal screen.  Steve Jobs would have to agree.  I don't understand why buyers would rather put up with continuous advertising than paying the few extra bucks for the ad-free version of the Fire HDX.  The HDX's version of Android also is kind of annoying.  Transferring movies from computer to tablet requires third-party software to remove DRM coding, whereas with Apple and even the plain Kindle Fire, movies are a simple drag and drop task.  Android's a pretty decent OS, but you wouldn't know it by the HDX.  You also have to be careful with Amazon Prime video.  Amazon subtly combines rental/purchase movies & TV with it's free Prime content, and it's pretty easy to press 'Watch Instantly' and later find out you've paid $5.00 to rent a movie.  You also probably notice a yellow cast to the display, especially with skin tones.  This is likely intentional to make the display appear better than it is, but I don't know why the Kindle makers thought this necessary since it's already the best display out there.  OK, so most Kindle buyers will likely just read, watch video and surf the web.  The HDX is very light & handy for doing these things.  Look at the limited accessories & general apps available and you'll understand it's not good to overreach with this devise. You will look silly bringing a Kindle to that important conference. My only other suggestion is to go with a vinyl skin rather than a TPU cover or folding case to protect your Kindle HDX.  I tried a TPU cover and it just bugged me. The Kindle Fire HDX  is really thin and light.  Keep it that way.", "Title": "The Best at What It Does", "Date": "January 16, 2014"}, {"Author": "Stu Redman", "ReviewID": "RE2F4CFQ91C2L", "Overall": "5.0", "Content": "If you go out on the internet and read tablet comparisons, you will find multiple \"professional writers\" running down the Amazon tablets.  They will tell you that you are limited to Amazons selection of apps, which is insufficient.  That the Kindles are only good if you are an Amazon Prime subscriber.  Well, that is simply not true of these newest tablets.  While the Amazon app store is not complete, it does have a ton of the most popular apps.  If you can't find what you need there, you can do an internet search and find out how to load any Android app on your Kindle.  And it is not rocket science.  The interlinking of Amazons content to the Kindle can not be shortchanged.  It is wonderful how my wife and I have all of our music, pictures, documents and videos stored in Amazons cloud and can access them easily, very easily, wherever we are.  The ability to watch many Amazon prime videos is amazing.  We are sold on this tablet.I use Amazon for most of my purchases and update my reviews if anything changes with the products. I do this so other Amazon users can get a real feel for the life of the product. You can look at my review which will be close to my purchase date and tell how the product is doing as time passes.  I am not associated with any company and all opinions are my very own.UPDATE:  It has been about two months since we received our tablet.  We added it to our mobile share plan with AT&T; so that my wife would have access to email and the internet anywhere she wants it.  She can also use a mapping program and since this unit has GPS, she can use it instead of her separate GPS unit when traveling.  She is in the process of converting to using the tablet instead of the daily planner she has been using for years to keep track of appointments and important dates as well as keep notes in.  She uses the tablet for gaming or reading in her downtime wherever she is and occasionally watches Amazon Prime video too.  She is very happy with this unit and can not think of any down sides to it.", "Title": "I compared and this table won out", "Date": "January 6, 2014"}, {"Author": "Moonlight Graham \"Ben\"", "ReviewID": "R2YTI5UGLABLAF", "Overall": "5.0", "Content": "Upon first inspection, I was thoroughly impressed with the look and design of the Kindle Fire HDX. Having owned both the original Kindle Fire and a Kindle Fire HD, I was unsure about the need to upgrade. I couldn't help myself, though. The ability to download Prime movies was exactly what I was waiting for, since I take the train downtown every day. I'm actually impressed with the availability of downloads. I've already downloaded a bunch of episodes of The Shield, Friday Night Lights, and Sherlock. The quantity of available Prime videos for download may seem like it's not enough, but I can only assume Amazon will be vastly expanding this as time goes on.The picture quality was the first thing I noticed. This thing is razor sharp. The video plays very, very well on it, and the sound is good as well. I typically only use my headphones. My only gripe is that changing the volume is a two-step process on the screen now. I'm not sure why they made that harder - you have to tape the screen, then tap the volume icon, then adjust the volume. Previously, the volume slider was available with a simple tap on the screen. I hope they change that with an upgrade. The volume +/- is also on the back of the HDX, which makes it harder to adjust while using a case.This thing is almost weightless. The oragami case more than doubles the weight of it. It is truly impressive how light they have made this while keeping the price down.There is, however, one bad thing, that I'm hoping is just a glitch. My HDX froze after connecting to a new wireless network. It was unable to turn back on. I contacted Amazon's technical support, which was awesome. They're shippng me a replacement, which will be here in two days. The customer service was outstanding, and while this was an unfortunate issue, I wouldn't dock the HDX a star for it (yet). If it happens more often or to other people, it would definitely be a detriment to the reputation of the product. I'm guessing it was an isolated incident, though. I've never had a problem with my other Amazon devices, so I have confidence the replacement HDX will do just fine. I will update the review if anything happens with that one.Overall, this thing is amazing. I do think it's worth the upgrade, especially if you have an original Kindle Fire. The video quality is great, and the ability to download Prime videos is amazing and makes the device worth it on its own if you commute on a train. I'm looking forward to using this thing every day for a long time.", "Title": "Great First Impression", "Date": "November 8, 2013"}, {"Author": "SAB", "ReviewID": "R1YGPJYN4I0ATF", "Overall": "5.0", "Content": "I never thought I would be a tablet person. I got my Kindle Fire and it has become my go to entertainment device. I love reading books on it and love the fact that Kindle book prices are lower than print! I am amazed at the quality of the picture with movies and TV shows. I use it daily and find it easy to use and add apps and books. I am a convert!", "Title": "Kindle Fire HDX 8.9\" Tablet", "Date": "May 31, 2014"}, {"Author": "Kathryn L. Newton \"klofcolo\"", "ReviewID": "R1YJCHG7PEYTTX", "Overall": "4.0", "Content": "I really like it indoors, but I hate it outdoors.  I like to go outside with my dog and sit on the patio and it is almost impossible to see anything on the screen outside.  I like to photograph Birds and Wildlife and outside I can't see what I have - I have just a Kindle Touch reader so I use that outside and the Kindle Fire inside.  I would not order another one!", "Title": "I like it when indoors", "Date": "May 20, 2014"}, {"Author": "Tia", "ReviewID": "R1D6K4594XVXQJ", "Overall": "5.0", "Content": "I received my new kindle this week, and test-drove it on a 6 hour flight. At this time, I have only positive things to say about it, and I will highlight some points for those who are thinking about making the purchase- I know they are expensive.I purchased the 64 gb version because I have an external hard drive of movies that I will rotate on my kindle. At the beginning, I put 8 2-hour movies on it, and still had space. So if you don't plan to add external media, you will be fine with  smaller data size.The internet works fast. All of my amazon media content is stored in my cloud. Any games that you purchased for a previous kindle will not transfer, so be advised of that. The picture quality is awesome, the graphics jump out at you, I couldn't be more pleased.The battery lasts forever. I used the kindle constantly throughout my flight, switching between movies and games, and still had plenty of juice. The machine is very easy to operate, and was cheaper than the iPad.I also like the book display. This kindle has a built-in backlight and magazines display nicely- as do comic books. I highly recommend this kindle.", "Title": "absolutely love it!!", "Date": "May 18, 2014"}, {"Author": "Sharon", "ReviewID": "R1U8YJNYVW890V", "Overall": "1.0", "Content": "I own one of the older Kindle Fires and was excited to receive this as a gift from my husband.  It worked OK in the beginning but within a few months it began shutting itself down. It would not come back on unless you did the hard reset, which is holding the power button down for 30 seconds.  This issue continued along with the fact that it would drop your internet connection and it would not update your email unless you shut it completely off.  After a few months of this my husband convinced me to contact Amazon.  The tech I talked to told me that the covers that Amazon sold could be part of the problem and I removed it.  He also tried to get me to reset to factory defaults and I asked to wait and let me give the coverless Kindle a try.It was better but still not right.  Finally I had enough when it shut down on me over 12 times in a row.  Each time staying on less than 45 seconds and freezing.  I did a reset to factory defaults in one of my 45 second windows.  When I tried to set it up again, it froze up.  Needless to say, I once again contacted Amazon and once again, I had to speak with someone that I could not understand.  He tried to get me to reset again and would not listen when I told him it wouldn't stay on long enough for me to do anything.  I got frustrated and hung up on him.My next step was live chat.  I chatted with someone and explained my problem  He must have clocked out for the day because suddenly I was chatting with someone else and he wanted to know what the problem was again.  He was not helpful and if anything I found him to be defensive.  My only option he said was to return it and he had no idea about the covers being a problem.I asked if I was going to get another new one or a refurbished one and he couldn't tell me.  Although he did agree to replace my cover.  He is sending the cover with one day shipping and my Kindle with two day shipping.  What sense does that make?The only positive thing I can about it is the screen is nice when it does decide to work. If I had it to do over I would have asked for the iPad instead.  Live and Learn.  Don't waste your money.UPDATE 05/20/15:I wanted to let everyone know that I received my refurbished Kindle Fire HDX yesterday.  It was supposed to be here on Friday but even though I verified the correct address with the customer service rep twice, it was sent to another address that is not the main address on my account. I was able to contact another customer service rep and all they could say was that he made a mistake and then they had the Kindle re-routed to my home.  I am not happy that I received a used Kindle and the first customer service rep I spoke with told me he would make a note in my file that since mine wasn't used that often he would request a new one for me.  As I stated before the last rep I spoke with wasn't very nice and he couldn't tell me what they would send. I will update if this one gives me any problems.", "Title": "Buyer Beware of Many Issues", "Date": "May 15, 2014"}, {"Author": "James Duckett", "ReviewID": "R1R8S3BWNPAOSL", "Overall": "4.0", "Content": "I'm a big movie buff, so I wanted 64GB so I'd never have to worry about not having enough video to keep me entertained when I'm away from WiFi for a long time. Also, it's hard to tell what I'll be in the mood for, so I'll often load it up with movies that I might want to catch later. Some have sit there for months, and I still haven't been in the mood for them, but some day I will be and having 64GB certainly helps with that. I don't have to live in fear that I'll get in the mood for a show I don't have.The screen is beautiful. This is my go-to 10\" tablet, mostly used for watching media and for playing a few games. I have a Kindle Paperwhite and I do all of my reading from that, so I don't use this for reading except in some rare situations. I love how this ties into my Audible account, so I always have my Audible books with me as well (again, thank you 64GB).Videos work awesome on this. The resolution is nice and crisp. The speakers are also awesome, though I do wish some tablet maker would have them facing the listener instead of going out the back. I feel like I'm missing a lot of sound with it shooting out its rear end. Sometimes I'll cup the speakers in a way that the sound is redirected back to me, but if I'm listening tot his device, I always do it from the back. Those speakers are awesome, Amazon, please, please, PLEASE figure out a way to move them up front.It says you should get 12 hours of battery life watching video. I've never experienced this. When it was new, maybe 7 hours of battery life. After a few months of using and charging, I can probably burn through a battery in 5 hours watching Hulu or streaming other media. I've seen worse (like Microsoft's Surface tablet and my Dell XPS tablet/laptop), but I expected better from Amazon, especially when it claims 12 hours while watching video and 18 hours while just reading. I'm not seeing it. Apple does tend to live up to their claims on battery life, in my opinion.Otherwise, I've got no regrets dropping $500 on this. I'm usually by a charging source, and since this uses standard USB and not some proprietary connector (*cough* *cough* APPLE *cough*), finding a charging source is easy. It doesn't seem to take long to fully charge this either... maybe an hour or so with a 2.1amp charger. $500 would get you the entry-level Apple iPad, which is only 16GB, which I can fill easily. I have a large-capacity iPad Mini, which is decent for watching shows on, but it seems to struggle with some video and games now and then. I find myself using my iPad Mini less and less and my HDX more and more.If I had to choose again, I'd pick up this HDX over the iPad in a heartbeat. When compared to some Android tablets, I'd have to do a lot more debating, but in that debate Apple would always take third place and, even then, would have to content with the Microsoft Surface.", "Title": "FANTASTIC!!! Almost perfect!", "Date": "May 14, 2014"}, {"Author": "Peter S Park", "ReviewID": "RXB488IMUL6JC", "Overall": "1.0", "Content": "I just spoke with kindle support and they just notified me that my WiFi dropping issue is a known issue and that they are working on a fix.  This is extremely disappointing that amazon would release a product with this bad of a bug and no solutions to work around the problems.  Amazon will have to work hard to regain this customer's trust.Sincerely a long time prime member", "Title": "piece of crap", "Date": "May 14, 2014"}, {"Author": "Jenxie", "ReviewID": "R1BNZYA4LUQKPH", "Overall": "4.0", "Content": "I bought this over a week ago and am loving it. Very user friendly and the screen resolution is great. I bought this because I am about to start chemotherapy and radiation in a few weeks and I wanted something to search the internet and stream movies and tv during my treatments. (I don't do ebooks, real books for life!) The only thing that it's lacking is good apps but that's not surprising as I have an Android phone and already knew this. With that said, I'm still very happy I sprung for the 8.9 instead of the 7.", "Title": "My new baby!", "Date": "April 23, 2014"}, {"Author": "Clark Fleming", "ReviewID": "R1GVGQLL3GTOKT", "Overall": "5.0", "Content": "I had been putting off getting a Fire because I already have an iPad and also have a Kindle Paperwhite (very pleased with the paperwhite - especially for reading in a dark room).  Finally, after a friend's positive experience with a Kindle Fire, I decided to get one.  I truly enjoy this little tablet.  I use it to read, check email, and occasionally go to a web page for something.  Bar none, it's the easiest tablet on which to set up email accounts - all kinds:  POP, iMAP, gmail, Exchange Network.  Usually to get all my email accounts working I have to enter manually several items.  Not so with the Fire; it found it all automatically.  Silk (browser) is fast enough, but not as speedy as Safari.  I find myself carrying the Fire more and more.  The screen is out of sight, very high resolution and it shines through when watching any video.  If it is also reliable (I'll see), then Amazon has a real winner.", "Title": "Kindle Fire HDX 8.9\"", "Date": "April 23, 2014"}, {"Author": "PBoyles \"PBoyles\"", "ReviewID": "R28IATHKVTFYG3", "Overall": "1.0", "Content": "I love, love, love my original Kindle and used it all the time.  The new Kindle Fire awful; it shuts down all the time or it freezes up.  Not just occasionally but every few minutes and all the time no matter what I'm doing.  Even just reading a book the think restarts every couple of pages and does save my location.  Does everyone have this same experience or is mine the only one???", "Title": "What a disappointment!!!", "Date": "April 23, 2014"}, {"Author": "J.C.A", "ReviewID": "R2SMY0EAAV9JTG", "Overall": "5.0", "Content": "I traded in my last Kindle HD with smaller screen because of battery drainage issues (I think these were unique to my unit since no one else complains of problems) and the desire to update to a forward and rear facing camera/video etc.I had no idea what I was about to receive would be a such a POWERHOUSE.  Apps load and run lightning fast, the power button and volume controls were moved to the rear and greatly enlarged, the speakers were moved to the top and seem to greatly improve the sound. Overall I am very pleased, I went back and forth between the 16 GB vs. 32 GB and I chose the smaller unit.  Maybe the 32GB would be a better choice for someone on the go with a number of movies/music.", "Title": "I love it!!", "Date": "January 8, 2014"}, {"Author": "srinivasan ramanan", "ReviewID": "R38G5HUPZT4L2Q", "Overall": "5.0", "Content": "The perfect tablet with the power of Amazon. Needed to work on some issues like e-mail and flash player otherwise this is as good as it gets. I also think that with upgrades to the OS coming this should get better and better.ThanksSrini", "Title": "The Tablet to buy", "Date": "December 3, 2013"}, {"Author": "Joanne Odom \"-Odom\"", "ReviewID": "RUP6T9ZN031XP", "Overall": "5.0", "Content": "Kindle Fire HDX 8.9 is the perfect size.  It has everything that I need.  I love the display layout.  I have the total package.", "Title": "This is the best", "Date": "April 18, 2014"}, {"Author": "Michael", "ReviewID": "R1IXS1HT47N2IH", "Overall": "5.0", "Content": "I heard a few rumors about screen issues, but I bought 2 and use them daily for hours on end watching streaming and shopping and have not had a single issue.  So far it is faster, runs smoother and 0 hiccups it runs better than my high dollar gaming computer.  Definitely blows iPad out of the water hands down, and runs better than some of the other competitors.  The free live visual tech support for any questions comes in handy also.", "Title": "awsome product", "Date": "April 17, 2014"}, {"Author": "Kit", "ReviewID": "R1VJZTHD1WNY2S", "Overall": "5.0", "Content": "I received this as a gift and am over the top pleased! I have a First Generation iPad that is worn out and acting up on me and I wanted a new tablet. I LOVE THIS! It is lightweight and thin and fits in even my small purses. The screen is crisp and clear and there isn't a lag or delay like there is with iPads. My movies, books and music downloaded without a problem. This is exactly what I was expecting and what I was wanting. I enjoyed my iPad while it lasted, but I will never go back. The functionality of the Kindle Fire just shuts down iPad. Battery lasts long and recharges quickly. There are a few games that cause it to drain quickly but that is to be expected from the larger storage games. Do not hesitate to purchase this if it has caught your interest.", "Title": "This product ROCKS!", "Date": "April 17, 2014"}, {"Author": "Jeremy R Redmond", "ReviewID": "RZOWTFXJ2K1KC", "Overall": "5.0", "Content": "The kindle fire HDX 8.9 is the killer of all tablets including iPad. I own an iPad mini and I would easily choose this. This does everything you want it to its honestly the best table on the market", "Title": "killer just killer", "Date": "April 15, 2014"}, {"Author": "Ruiz", "ReviewID": "R3D2HV9VP29PDJ", "Overall": "4.0", "Content": "Kindle Fire HDX - Two week reviewThe tablet has become an entertainment device for the children. The Free Amazon App of the Day has only encouraged this situation. I find it strange that the younger ones rather watch Netflix on the tablet than on the television. I think it is because the image is actually bigger than the screen appears from the couch.The tablet works well as a chant/music e-reader. It is light enough to hold during an entire practice or Mass, and there is enough bezel to do so with one hand and not mistakenly 'flip' the page. The other hand is needed for my lame attempt at chironomy. The ability to digitally draw markings on the music is also a plus (use the free Adobe Reader). It also works well as a regular e-reader for the same reasons listed.I have yet to become that person that can \"do anything\" on a tablet and rarely uses the laptop. That day may never come. The keyboard and mouse have spoiled me, and the quick email-fb check is easier and more practical on the handy smartphone. I do, however, appreciate the occasional quicker web search when the two laptops are in use.I sideloaded Flash onto it and felt content. However, I have yet to use it for anything Flash related. Go figure.I have no iPad related regrets. The Kindle Fire HDX 8.9 is most comparable to the iPad mini (same width in portrait mode), yet it is lighter (good for one hand e-reading), has a brighter screen for outdoor viewing, is less expensive (good for the wallet), and offers up great free apps of the day (some apps that normally retail for $7 at the Amazon and Apple App Stores).So if you are looking for an alternative to the iPad mini, take a hard look at the HDX 8.9.", "Title": "The iPad mini takes a beating.", "Date": "April 15, 2014"}, {"Author": "Nia Adero", "ReviewID": "R2XMBXNPI7NGEY", "Overall": "5.0", "Content": "This is THE BEST tablet ever!!! I have everything else by Apple, but I just did not want to pay the ridiculous price that Apple wanted for an iPad. This tablet is actually better in my opinion, for much less money than I would have paid for an iPad! I love the Mayday button and the new way of navigating, along with more GB and the larger HDX screen. The special offers are not bad either because if I am not interested, I just swipe it away, so the discount off the price I received because of these ads is well worth it! This is a great purchase for anyone of any age!!!", "Title": "Kindle Fire HDX 8.9' HDX Display, WiFi, 64 GB - Includes Special Offers", "Date": "February 26, 2014"}, {"Author": "Thoth", "ReviewID": "R1S36XA9G77WQ8", "Overall": "5.0", "Content": "There not much I can say that hasn't already been said.  Once I got AirDriod installed on it I am free to install what ever I want that isn't available on the Amazon store with out jail breaking the device.", "Title": "Great Tablet for the Price", "Date": "February 26, 2014"}, {"Author": "Beth", "ReviewID": "R1WW90PO7AZ9JE", "Overall": "5.0", "Content": "Love my new kindle fire hdx. I am pretty new to all the touch screen technology but find that this device is pretty user friendly. Display has beautiful picture. I have been able to get any app that I was interested in for free on amazon. Sound is loud and clear when watching a movie. Easy wi-fi connection. Have only used for browsing so far. Have not downloaded music or books but as a web browsing device it is very fast and easy.", "Title": "New Kindle", "Date": "February 25, 2014"}, {"Author": "Jasmyne", "ReviewID": "R1YXTYO9VCSKHL", "Overall": "5.0", "Content": "I picked my Kindle up from the Post Office.  I love it... Now I looking for a real neat cover for my Kindle. Thank you.", "Title": "Thank you", "Date": "February 25, 2014"}, {"Author": "Joyce S, Spence", "ReviewID": "R2U5YYO814VE4R", "Overall": "5.0", "Content": "I wanted a tablet for some time and all the Christmas ads drove me insane!  Finally a day or so before Christmas, my husband told me to order what I wanted.  It took some time to arrive, but was well worth the wait!  I am also a PRIME member, so the free streaming content, free books, and lending library have been wonderful complements. The pictures are so sharp and the colors so vivid!  I worried about the ads, but they are completely unobtrusive.  In fact, I have actually taken advantage of several of them.  My kindle holds a charge for a two or three days, a big improvement over my smart phone or mini computer.  All in all, this has been one of my better purchase decisions!", "Title": "KIndle Fire HDX 8.9\"", "Date": "February 24, 2014"}, {"Author": "Denise", "ReviewID": "R3QFRAVC7TJ6LE", "Overall": "5.0", "Content": "I had the original Kindle and I had some issues with it, however everything is A,O.K. with this one.  I love it, when my granddaughter comes over it's the first think she asks for, can I play with your kindle? She loves it too.", "Title": "my new kindle", "Date": "February 24, 2014"}, {"Author": "dray", "ReviewID": "RVTDH31VH0R02", "Overall": "5.0", "Content": "I am actually glad they made me choose this one. I would not have been as happy with the old style as I am with this one.dra", "Title": "I Love It Love it Love It", "Date": "February 24, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2LA1EDCFE3SFH", "Overall": "5.0", "Content": "I did my homework on the options I wanted for the price. As far as the movies, the amount of movies to download if you are a prime member for offline viewing is limited and the movies are older movies. However, there is a vast amount of movies to watch while you are online. As well at t.v. shows, etc. I signed up for the prime membership to get the most use out of my Kindle Fire. The graphics are great, download speeds are fast, and cloud storage is great! I also love the lending library, many great titles available for free! As well as all of the regular titles that Amazon offers for free! I do not have any issues with apps not being availble from the play store, Amazon has a great many apps available. I love the cloud storage because I do not have to use up my kindle space to store my books, movies, pictures, or any other items.", "Title": "I'm a fan of Amazon", "Date": "February 24, 2014"}, {"Author": "Kathryn Diamond", "ReviewID": "R2KJL01ND890F6", "Overall": "5.0", "Content": "I love this tablet.  It is everything that I was looking for in a tablet and more.  It is so bright and everything is crystal clear on it and I just love using it.  I sure do recommend it to everyone.  The Apple IPad might be the in thing but you can get the same things on this Kindle Fire as the IPad and it is cheaper and so much nicer.  I love the \"Live\" person that is on there to help when you need it.  I had to use it for the first time, just a few days ago, and it was awesome.  She walked me right through everything that I needed help with.  I recommend this product to everyone who is just contemplating buying a tablet.", "Title": "Kindle Fire HDX 8.9\", HDX Display, Wi-Fi, 16 GB", "Date": "February 23, 2014"}, {"Author": "Marge s", "ReviewID": "RZIT6HBH3YNHK", "Overall": "5.0", "Content": "Have last year's version and wondered if it would be noticeably improved. Yes! The clarity of screen is amazing.  The battery life is much improved. I am a heavy user and the battery lasts two days.I am very pleased with this purchase so far.", "Title": "luv it!", "Date": "February 13, 2014"}, {"Author": "Diane S", "ReviewID": "R1KOOP4GHCJO4G", "Overall": "5.0", "Content": "This is by far the best purchase I have ever made for myself.  Some of the reviews had me concerned about the view on the screen but I am not experiencing any problems.  I mostly use mine for reading but I have had no problems with any of the other features.  The camera takes better pictures then my digital camera which I paid almost as much for as the kindle. I like the bigger screen too.  Reading in bed is great too.  Not needing to have a light on is very beneficial if someone else is in the room trying to sleep.  l Love my kindle!", "Title": "Best purchase", "Date": "February 2, 2014"}, {"Author": "Mike", "ReviewID": "R33QNMWSLK771K", "Overall": "5.0", "Content": "I purchased it as a gift and she can't put it down.  Between having all her books and the other internet apps, its constantly in use.  A solid tablet that is focused on her primary love of books.  A winner.", "Title": "Awesome device", "Date": "January 17, 2014"}, {"Author": "Jolene B. Davis", "ReviewID": "RLIIFJF25AAT9", "Overall": "4.0", "Content": "I'm amazed at what the Kindle can do, but wish it had come with a paperback manual.  I checked out a book from the library called Kindle Fire: the missing manual, the book that should have been in the box.  It has helped tremendously.", "Title": "Needs a manual", "Date": "January 17, 2014"}, {"Author": "carmen c. rivera", "ReviewID": "R2GDK8ZGJLF1WK", "Overall": "5.0", "Content": "it's easy to use and small enough to take anywhere yet large enough screen to enjoy it. husband loves it as i bought for him my PC was a bit much but somehow the Kindle is not so intimidating as the large PC i use.", "Title": "Great Gift", "Date": "January 17, 2014"}, {"Author": "diana vanduinen", "ReviewID": "R2E649CT6QBV9Y", "Overall": "5.0", "Content": "I purchased three kindles in December for gifts for my husband and two children.  The picture quality is amazing. They love them..", "Title": "I love it!", "Date": "January 17, 2014"}, {"Author": "terry", "ReviewID": "R1EED1ZIAOQJHY", "Overall": "5.0", "Content": "Have old Kindle but the 7 inch screen was not big enough. was looking for some thing more decided on the HDX 8.9 glad I did love it. Movies are great on it.", "Title": "Kindle Fire HDX 8.9", "Date": "January 16, 2014"}, {"Author": "Jacque Bagwell \"IamLuved\"", "ReviewID": "R3JUQNZB2ZV374", "Overall": "5.0", "Content": "I have three Kindles now and I have to say this Kindle Fire HDX 8.9\" is the very best. I've used my parents iPad before but I wouldn't trade my Kindles for anything in the world. My Kindles are my most treasured possessions. If you're looking for the best tablet/e-reader on the market then a Kindle HDX is a MUST!", "Title": "Loking for the best tablet/e-reader then look no further.", "Date": "January 16, 2014"}, {"Author": "Tourman \"I'm a 4th generation native of Eurek...", "ReviewID": "R2M88R7F2XRIPB", "Overall": "5.0", "Content": "I loved my 1st generation Kindle Fire - 7\" so how do I describe how I love my new HDX 8.9 even more? I just do! It's faster, bigger, yet not too big, it's sharper, thinner, lighter, better sounding, very easy to set up and I love the voice recognition capability. I am a big user of that feature on my cell phone and really missed it on the original Kindle Fire. I am 55 years old and have a 55 inch Samsung TV, yet I find myself watching more and more movies and programs on my HDX 8.9. I guess when you're in love you really can't find anything bad to say about the object of your affection. So, I will leave it at that!", "Title": "How do you love something more?", "Date": "January 16, 2014"}, {"Author": "Deena Jemery", "ReviewID": "R30QL5H7FMY7NW", "Overall": "5.0", "Content": "I love my Kindle Fire.  It is so much fun and so versatile.  Don't know why I waited so long to get one.  Easy to set up (almost no real effort involved) and use it daily.Highly recommend.", "Title": "Love, Love, Love It!", "Date": "January 16, 2014"}, {"Author": "Jerry", "ReviewID": "R35IXTUPJWA9DB", "Overall": "5.0", "Content": "It is very easy to use and video is great I would recommend it to any one. Reading books is easy on the eyes.", "Title": "Good tablet", "Date": "January 16, 2014"}, {"Author": "Lenny Leonard", "ReviewID": "R348X217T0WZZY", "Overall": "5.0", "Content": "If you already have a personal computer, and want an easy way to read, watch tv or movies, listen to music or browse the internet, this is the device for you.  I prefer it to the Apple Ipad Air.I bought the 1st generation Kindle Fire in Dec of 2011 and loved it.  It was much more convenient and portable than a pc for media consumption.  I used it every day.This Dec 2013, I splurged and bought the Fire HDX 8.9.  Every feature has been vastly improved over the 1st gen, including adding front & rear cameras and a microphone.  Books, magazines, music, movies, tv, and games all work great!Caveat:  I never use my Kindle for work, only for fun, so I don't know how it handles work documents.I love:  The gorgeous larger screen, the smooth response, the lighter weight and longer battery life.  I think it is the best value for a tablet computer.However:  You need to have an Amazon account set up, have WiFi available and a home PC.  I think Amazon Prime is overpriced;  you don't need it, but go ahead and use up the 30 day trial period offered.  Also there is no Adobe Flash support, no HMDI, and no access to Google Play apps.  But none of these has been a problem for me.Enjoy!", "Title": "Great compliment to your PC", "Date": "January 13, 2014"}, {"Author": "Sam C.", "ReviewID": "R6AS69N6GLW50", "Overall": "5.0", "Content": "I bought this during December promo ($50 off via amazon cc). I've owned many Ipads and Android tablets. I've read many helpful reviews here (thanks guys) before buying this tablet. Just few thoughts(i) It's lighter than the Ipad Air; ok, I never held the air but this tablet is not feathery light for me. My kindle reader ($69) I think is \"light\". Not that this is heavy but I was not comfortable holding it with one hand.(ii) apps; right. I use dropbox a lot. I know I can side-load those apps whatever but at this point, I don't care. I do all my works on windows laptop. If I need to read something then I will use web to access those files. I just don't care any more. I'm sure Apple has unique apps that you need for your work and school...so then buy ipad. Simple. But for me. I don't use those special apps. So This HDX works out fine for me(iii) in the end, question is, what do you do with your tablet. For me, I read Kindle books and watch Free Prime Videos. I know Ipad is able to watch Prime. But again, this tablet makes everything Amazon content related matter easier. When I went to 3 day trip, I downloaded 2 TV shows and 1 video. With many Kindle book loaded, I felt like I was ready. And my trip was fun and exciting. I know those limit (2 shows) sucks. But in the airplane, I switched to books and watched videos when I had spare time during the trip. So it worked out fine.Ask: what do I do with my tablet? If it's Prime contents and Kindle books, then, you need to get this. If your work requires those special apps for ipad, then, you should get that.Also ask: how long do you keep your gadget? If you spend $500 + tax + accessories on cheapest Ipad, then, you should make or generate more income than $500. But as for me, I never used a device more than 1 year. So if I'm gonna upgrade every 1.5 years, then, I would get by with perfectly fine HDX 8.9. When time comes, then, I will buy newer one.I'm very happy as I read, read, and read on this and watch many cool prime shows (I think they have better TV shows like \"Vikings\" or \"Tudors\" than the movies). And I think $500 + for consumption only is too much.Only thing that I wish for HDX is that other manufactures bring out folio keyboard cases.Buy this. I am enjoying this more than any ipads and android tablets I've owned (total 6 tablets so far)", "Title": "Tablet meets the content!", "Date": "January 12, 2014"}, {"Author": "sinecure", "ReviewID": "R2IVHU9UVYR0KQ", "Overall": "5.0", "Content": "From the specs, I could see this had the best hardware available among tablets (as of Dec 2013) - a 2.2 GHz quad core processor and a display that's out of this world, all with a weight of just over 13 oz. But the OS is not stock Android, so app compatibility was a concern. But I was able to load 1mobile market just fine, and through it several apps including Nook, Firefox, and Chrome. Couldn't be happier.", "Title": "I had my doubts, but this proved to be an excellent purchase", "Date": "January 11, 2014"}, {"Author": "Candy Cane", "ReviewID": "R3QN8QCHKB6KOX", "Overall": "5.0", "Content": "I've had my kindles for several months and we have zero regrets.  They're durable and work amazingly well.  We also have iPad in the house but will not be getting upgrades.  We are sticking with Kindles from now on.  For our uses, primarily entertainment and internet, the Kindle is hands down the favorite.The speakers are far superior in sound and placement to the iPad.  The screen display is on par.  The speed and software seems less temperamental than the iPad.Buy it.  Buy one for someone you love.  The best value of any tablet.", "Title": "Love love love", "Date": "January 11, 2014"}, {"Author": "RWL", "ReviewID": "RJ0G8M9Q4ZXTH", "Overall": "5.0", "Content": "I bought this for my mother for Xmas, and she loves it. She watches movies, and reads books, and plays games, puzzles, etc. She is 71 and learned how to use it quickly, I did have to give her a few updates on how to do things, but she uses it almost everyday!", "Title": "Great tablet", "Date": "January 11, 2014"}, {"Author": "BR \"Boo Ray\"", "ReviewID": "R3RUSEURKLR3J7", "Overall": "5.0", "Content": "It is fast, clear, easy to use, with a great screen resolution! I bought it for my wife for Christmas and she loves it. One reason I did not want an iPad was the proprietary chargers and accessories you must buy from Apple. The Kindle Fire came with a charger but it also recharges with any of our phone chargers, you don't need a special plug like you do with Apple products.It is lightweight and has a longer than expected battery life. The speed, clarity, and ease of use exceeded our expectations! I would recommend to anyone looking for a tablet. No disappointments  here!", "Title": "Great Tablet!", "Date": "January 10, 2014"}, {"Author": "CJ", "ReviewID": "R2DCKYASLHQSQY", "Overall": "5.0", "Content": "Replaced my Kindle Fire 7\" with the HDX 8.9 and am loving it!  Not sure about the \"special offers\" not liking that part.  Might have been worth the few extra bucks to buy without the special offers.", "Title": "Love it!", "Date": "January 10, 2014"}, {"Author": "MonaMe", "ReviewID": "R28078UJJLY65Q", "Overall": "5.0", "Content": "Great little device.  Amazing picture.  Really nice when coupled with Amazon Prime.  You won't be sorry with the Kindle.  Wish they had more choices for covers.  Hopefully Amazon will step up with more choices.", "Title": "You Won't Be Sorry", "Date": "January 9, 2014"}, {"Author": "Kerry Spiker", "ReviewID": "RGDASM2YANHMS", "Overall": "5.0", "Content": "I absolutely love my Kindle HDX. However, I would not recommend purchasing the 4G capability.  It is not necessary if you have access to Wi-Fi.  I did, but I learned  from my cell phone provider that they will assess me an additional charge each month if I activate the device.  So I've chosen not to activate the device.....bottom line...... I paid extra for the 4G capability that I will never use.  In addition, you may need to investigate the compatibility of the HDX's wireless with your television.  I've been unable to push the image from the HDX to any of my TVs.  I used the Mayday button for help (which is pretty cool) and was informed I would need to purchase Netgear's Push to TV device.", "Title": "Incredible Device", "Date": "January 9, 2014"}, {"Author": "Christie L Eller", "ReviewID": "RC7ZXHHM8E4G7", "Overall": "5.0", "Content": "So I been wanting a tablet for awhile but could not afford one. Of course, I was holding out for an iPad. However, Amazon's fantastic offer made my day.  I thought I'd give the Kindle a try and I am glad I did. I love it. I can read books, listen to music, take pictures and video, watch movies and keep up on mail and social networks without lugging my laptop around. I love that I can take it in the kitchen and access my recipe sites, plus listen to music while I cook. It has much better sound than my Dell laptop. Plus, it fits nicely in my purse. I do not find the special offers annoying and there are more than enough apps to meet my needs. I am sort of an anomaly in that I don't have a smart phone or any Apple products. The Kindle really meets all my needs at a fraction of the cost of the iPad. I am very satisfied with this purchase.", "Title": "So happy I bought this Kindle", "Date": "January 9, 2014"}, {"Author": "David N. Olson", "ReviewID": "R1OFMUFQEL9TF0", "Overall": "4.0", "Content": "In general, I'm a big fan of Kindle products and the concept behind them.  I buy a LOT of books, and buying as many of them as possible in Kindle form keeps my house from being completely overrun with them.  I started with the first generation Kindle Fire, and have since purchased a Kindle Paperwhite as well as this item, the Kindle Fire HDX 8.9\"  This is in many ways the best Kindle of all, and is superb for reading my many books on photography.  And on a related note, the Origami cover works very well, too.My only complaint about the entire Kindle experience is the way that mathematical expressions are treated.  Mathematical expressions display on the page much too small in comparison to the text.  In some books, the equations are so small that you can almost miss the fact that they are there at all.  It's true that in most cases, you can press on an equation and then select zoom to make it larger; however, that leaves you with just the equation isolated from the text that describes it.  I can understand that maybe it's cheaper to treat mathematical expressions like illustrations instead of putting them in MathML and displaying them that way.  What I don't understand is why the default size of the expressions has to be so small.  When I read a book on photography, the picture that is being described is displayed at an appropriate scale; if I want to zoom in, I can study it in more detail.  Why can't mathematical expressions display at an appropriate scale.  It really reduces the value of reading books on mathematics or physics on the Kindle.", "Title": "Almost perfect", "Date": "December 27, 2013"}, {"Author": "Ryan Williams", "ReviewID": "R3F22MGC79GXB6", "Overall": "5.0", "Content": "As for an entertainment device, the HDX is outstanding. My only drawback was that the apps are not friendly with my office applications. I am sure as time goes on the app store will be very comparable to the google store.", "Title": "Excellent Graphics", "Date": "December 21, 2013"}, {"Author": "Janice C. Friel", "ReviewID": "R25UMOU4Y7LELC", "Overall": "5.0", "Content": "Never thought a strap would be so convenient. Love the ID pocket and auto on/off. This was a great buy.", "Title": "Love it!", "Date": "December 21, 2013"}, {"Author": "Kindle Customer \"falcon\"", "ReviewID": "R3UN630I4OJQJ6", "Overall": "5.0", "Content": "I was so pleased with my \"HD\" ... I was not looking for significant advances for a long time.  The HDX is really spectacular. Every element of this tablet is the best ... I can't imagine what the next HDX advance could bring.  One caution ... the price tag was a big \"move up\".  If that continues ... the Kindle Fire will lose it's edge!", "Title": "OUTSTANDING!", "Date": "December 21, 2013"}, {"Author": "ken", "ReviewID": "R1YQRN9BLXV2GJ", "Overall": "5.0", "Content": "the HDX is wonderful. the clear bright screen works great both indoors and outside in the sun. I can sit outside and read my books I downloaded. I love the white background also. makes it much easier to read. picking up wifi also works great outside away from the router. I'm very happy I bought the Kindle HDX over the I-pad I was looking at also. thanks for making a great unit.", "Title": "kindle", "Date": "December 21, 2013"}, {"Author": "Kindle Customer \"Penelope Twain\"", "ReviewID": "R2LACM3Y1GQVWP", "Overall": "5.0", "Content": "Pretty light.  Video quality is very crisp.  Sound is good enough...although I wish it were a little louder.  Very easy to navigate and I am just a happy camper.", "Title": "Pretty Happy With My purchase", "Date": "December 20, 2013"}, {"Author": "srh", "ReviewID": "R2GDSPN5QRV8XN", "Overall": "5.0", "Content": "Okay, my husband tried to get me to purchase one of these as my BDAY present from him.  I dithered because I am very untech savvy and was afraid it wouldn't meet my needs.  I finally made the purchase and am so pleased with how easy it is to use.  I spent about 60 minutes with our company IT helpdesk and bingo I was linked in with my company intranet WIFI, getting my Outlook e-mails, etc.  I have been able to download a bunch of free apps.  The picture quality is really amazing.  Crystal clear and it is FAST.  So for a person who wants to turn something on and have it work this has been ideal so far.  Also used Mayday once just to see how that would work out.  I was connected within seconds and the person was super helpful and we were done in a couple of minutes.  Well down AMAZON!!!!!", "Title": "Have only had a couple of days so will add more later if any changes", "Date": "December 20, 2013"}, {"Author": "Kindle Customer \"CEMurray\"", "ReviewID": "R1ZWX7LL379S0M", "Overall": "4.0", "Content": "I'm not a techie so my review is just your average Joe Reviewer. So as a Prime Member Amazon let me experience the AMAZING Kindle HDX Fire 8.9 for 30 days and I was very impressed.Prior to the offer I had been considering purchasing a laptop vs. a tablet. Well I bought the laptop and had to return it after 30-days because it crashed on me.So then I started exploring tablets. I just wanted something that was comparable to a laptop without all the bulk.The Kindle Fire HDX is light, easy hold, sleek and has a beautiful picture screen compared to both the Samsung and Apple tablets. And I love the MAYDAY feature! I wish ALL products had this feature especially for my PARENTS so they don't have to call me (I love my parents dearly but I'm not the tech person they think I am...lol)Movies look great on the HDX Fire, reading is easy. It's VERY FAST and responsive, no lagging. I downloaded an app so I could read and edit Word and Excel documents. And the PREDICTIVE TEXT is on point!If I had one complaint it would be the limited number of apps in the Amazon store compared to Apple and the Android market. And one major missing app for me (and the reason it has 4-stars and not 5) is no dedicated YouTube app! There is a 3rd party YouTube app in the Amazon store but it has ads (yes ads in addition to the ads you get prior to a video starting) and is not as fluid as the dedicated app. Amazon, work it out with Google and get a YouTube app!One other disappointment, which Amazon has no control over, is the lack of animated page turns when reading a book. I love to read, and I love even more the realism you get when turning the pages with an electronic device and it looks like a real book. Well apparently Apple bought the patent/rights to that animated feature (WTH?). At least that's my understanding. But outside of that, reading on the Kindle is a joy and fun with all the interactive features with the highlighting and comments from other users as you read.Overall if you can afford it, I highly recommend the Amazon Kindle Fire HDX 8.9 (the 7 is too small) over any other tablet out there including the Apple iPad Air!", "Title": "Kindle Fire HDX is the BEST Tablet on the Market", "Date": "December 20, 2013"}, {"Author": "Daniel A. Bahr \"Dan\"", "ReviewID": "R3CW3QTNYLZND8", "Overall": "4.0", "Content": "Except for an Office Suite this beauty does everything well  Very thin and surprisingly light with a gorgeous screen, I don't regret moving away from my iPad.", "Title": "Does Everything", "Date": "December 20, 2013"}, {"Author": "JayBird", "ReviewID": "R23Q029J59O0G6", "Overall": "5.0", "Content": "Likes: great for movies and video, fantastic display, games run good, very fast , fling is great for watching movies, easy to create play lists and copy songs to storage or cloud, fast to boot, nearly every feature is as good as they said. Plenty of apps to pick from and a lot are free.  I chose this over apple and am  happy.  Supports Kodak AIO printers on the Cloud.  Holds charge good. Bluetooth keyboard is pretty cool if you decide to get one.  Mayday is pretty cool.  Used it a few times, although they tech support seems a bit lacking on the support skills for this product and often lost/dropped me during support.Dislikes: a lot of sites require adobe flash {not available for this}, also if you want an equalizer for it, none of them seem to work with it {tried a lot of them and no luck} and it does not have its own, so you are stuck with what ever it has as its default {needs more bass}.  I would like a firefox browser also, but theirs is ok for now.Overall I would get one again over Apple {and i am an Apple lover}.  Size, price. performance, and usability are all good reasons to choose this product.", "Title": "Overall, love it", "Date": "December 19, 2013"}, {"Author": "L. Hinojosa \"-Laura\"", "ReviewID": "R2W1T5RY2FPY0", "Overall": "5.0", "Content": "This is an excellent piece of hardware. The screen has stunning resolution and the operating system is pretty intuitive so you should learn the system in no time. The speakers have great sound and the battery life has been more than sufficient for travel days.My main concern when buying was the lack of synchronicity with all my Apple based products. But in retrospect I don't really use the tablet in a way that I would require it to auto push updates to and from my MacBook/iPhone.", "Title": "Excellent", "Date": "December 19, 2013"}, {"Author": "alindwurm", "ReviewID": "R231V795TE5OOO", "Overall": "5.0", "Content": "I have looked at other tablets and even purchased an iPad so I could compare the Fire with it. The Fire, for me at least,  is easier to use.I do wish the screen was larger and wish that I can use the account I already have with Google play to watch the movies I already purchased via my Pantech Flex, but that's okay. The best part is reading my books on a larger screen. And, Mayday is just great! It's wonderful to have a customer service rep ready to help you anytime. I am very happy I chose this Kindle Fire! And, yes, the iPad was returned.", "Title": "Best for me!", "Date": "December 15, 2013"}, {"Author": "HaTsUnE NeKo \"Life is a puzzle, and someone f...", "ReviewID": "R2TYGIFTBG70ZI", "Overall": "4.0", "Content": "Got this to replace my Kindle Fire SD version. love it but it does have a downside at this moment, it don't like netgear wireless modems. At the time of this review that's about the only downside of this product. but since all my wireless and modems are of netgear i cant connect it to the net without piggybacking it off another network.It is a known issue so it is being worked on.So unless you have a netgear network, you should be fine.Awesome product and great picture quality.5 stars for everything, -1 star for the netgear problem.", "Title": "Very nice quality of picture and sound", "Date": "December 15, 2013"}, {"Author": "Tom Airhart", "ReviewID": "R1XS8CZOQGZRSU", "Overall": "5.0", "Content": "This Kindle just arrived on December 10th so I haven't had a chance to put it through its paces yet.  I did take advantage of trying the Mayday button and the service is prompt and efficient.  The HDX is head and shoulders above the Fire HD in performance.", "Title": "Just arrived", "Date": "December 14, 2013"}, {"Author": "Bernice A. Watson \"neicey\"", "ReviewID": "R2F0GH261YB6ZC", "Overall": "5.0", "Content": "I love my new Kindle. Its larger than my old one of course and much easier to see when I play games which I do a lot.", "Title": "Great for games", "Date": "May 28, 2014"}, {"Author": "Diana L. Lillar", "ReviewID": "R3U28R4M4AIPUG", "Overall": "5.0", "Content": "I use it at various meetings and to take notes, and minutes. Love the size and the portability. Awesome Appstore and software.", "Title": "Beest tablt", "Date": "May 28, 2014"}, {"Author": "Micky \"Micky @My Book Habit\"", "ReviewID": "R26QDB90SX2SQK", "Overall": "5.0", "Content": "I love my new Kindle Fire HDX 8.9. It's much lighter and thinner than my last Kindle Fire, so it's much more portable. I can slip this one in my purse and not worry about it weighing it down.With each version Amazon keeps getting better and better. They have added new text-to-speech narrators and other awesome features which is great. I wouldn't trade my Kindle for a thing.", "Title": "In Love With My Kindle Fire HDX", "Date": "May 28, 2014"}, {"Author": "PLEASANT L LINDSEY", "ReviewID": "RWPNEZ0XZLMOX", "Overall": "5.0", "Content": "I want to give it 4.5 stars but Amazon's system won't let you do that.  I've almost stopped reading paper books completely because of the convenience of this tablet.  Interestingly it can do so much more, but I'm so impressed by the the onscreen book reproductions and the unit's available storage that reading is the only thing I use it for anyway.", "Title": "Not a fair rating, but", "Date": "May 27, 2014"}, {"Author": "charlene", "ReviewID": "R3B5A17Z6CER2Z", "Overall": "5.0", "Content": "So far I have been very pleased with my Kindle Fire HDX. I haven't tried to link my Reader's Digest subscription to it yet.  I hope I won't have any problems doing that.", "Title": "My Kindle Upgrade", "Date": "May 27, 2014"}, {"Author": "michelle", "ReviewID": "R3JZYWK85L69YF", "Overall": "5.0", "Content": "This is my third Kindle....Started out with the no bells plain old read a book, then I ventured out and started looking at the Kindle HD Iv'e had a blast with that. then comes the HDX, this has got to be the best yet, it's light does everything they say and more....I am still playing with it, have so much to learn. One thing I wish I would have read on here is about the mirrowing your movies....if you do not have a newer model TV then you need to buy a Devise to stream the movies through. I dont mind but wish I would have known sooner so as I could have bought what I needed then. I'll up date as I learn more when I have the time.", "Title": "OMG.....LOVE IT...../", "Date": "May 27, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R2S9F0KFG23OD0", "Overall": "5.0", "Content": "As some one who travels quite a bit for work being able to download and watch a bunch of moves and tv shows, including HBO shows, and play them offline makes it worth the cost alone.", "Title": "Perfect for flying", "Date": "May 26, 2014"}, {"Author": "Ronnie V", "ReviewID": "R38982TIXMCOGU", "Overall": "2.0", "Content": "I have had my Kindle HDX 8.9 for six months, and I have to say I am terribly disappointed.  Other than the camera and slightly larger screen, it is not much better than my Kindle Fire.  The processing speed is annoyingly slow.  There are other tablets with processors that are so much faster than this one.  It seems that whenever two or more of us with different tablets are looking for an answer, everyone finds it before I do.  And frankly, the Kindle Fire is easier to turn off and on.  I bought this tablet because of a promotion Amazon was running, and frankly, I wish I had not.", "Title": "Nolt what I expected.", "Date": "May 19, 2014"}, {"Author": "Ethel 2", "ReviewID": "R374WFC1CGGP8M", "Overall": "5.0", "Content": "I am very pleased with my purchase of this kindle. I have the original kindle and this one has faster speed and better color. I also like that it has a camera and takes great pictures. I also like that you had the option of choosing a payment plan for it.", "Title": "Kindle Fire HDX 8.9\", HDX Display, WIFI, 64GB", "Date": "May 18, 2014"}, {"Author": "K D Romaine", "ReviewID": "R2CDZ4HC79370G", "Overall": "4.0", "Content": "Being a subscriber to Amazon Prime I decided to give this tablet a try. It has a great screen and impressive sound coming from tablet speakers. It is ideal for watching videos and listening to music. Accessing content from Amazon is almost too easy, but that is one reason I bought it.I still prefer to read books on my old Kindle reader, which is much kinder to my eyes.One major complaint I have regarding the Kindle Fire is the lack of apps, particularly for accessing other cloud storage services like Dropbox and OneDrive. Hopefully this will get resolved in the near future. With more apps this tablet could beat out the iPad.", "Title": "Great tablet for Amazon Prime subscribers", "Date": "May 18, 2014"}, {"Author": "Eggie \"EGGMAN\"", "ReviewID": "R3GFRYQY6EQ9M1", "Overall": "4.0", "Content": "I don't know if it's my device only but this unit will not charge until it's at 10% battery life left. I did the mayday thing but they were not able to help nor was customer service which by the way, Amazon has the best customer service and the reason for the 4 stars", "Title": "Great customer service, bad device", "Date": "March 25, 2014"}, {"Author": "S.J.", "ReviewID": "R2QUFZWP1OWW9R", "Overall": "5.0", "Content": "I love this tablet. It does everything I want and does it quickly. All in all, a very good buy", "Title": "Most excellent", "Date": "March 25, 2014"}, {"Author": "J. Coy", "ReviewID": "R25VY9PG8Q2RTE", "Overall": "5.0", "Content": "I upgraded from a the original Kindle and I dearly love this one (I loved my old one too). I like the fact that I can play my dumb games on it, I can do my facebook and pinterest time. The resolution is superb!! It is thin and lightweight and has a nice backing that doesn't slip through your hands. It's a pleasure to read on it, or do anything on it.If I had one complaint it's that I can only do one thing at a time on it.I also don't like the fact that I have to go into the settings to kill off apps and clear the cache - but I can live with that. Someday I'll find a good app killer for it.I would recommend this to anyone looking for a tablet! I think there are plenty of games available for it, but have seen reviews that say there aren't enough.", "Title": "I love this!", "Date": "March 25, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R3K4VBIE8TPGUT", "Overall": "5.0", "Content": "i love it don't think i would have been any happier if i would have spent more money and purchased a ipad", "Title": "love it", "Date": "March 25, 2014"}, {"Author": "Jennifer Hart", "ReviewID": "R85R94XRWQGAQ", "Overall": "5.0", "Content": "This is a great product with great options and easy to handle. I like it very much and keep it by my side constantly.", "Title": "Kindle fire", "Date": "March 25, 2014"}, {"Author": "Missy Mullins", "ReviewID": "R2SXE5ANN3VZ45", "Overall": "5.0", "Content": "I adore my Kindle Fire HDX. I take it everywhere and use it all the time. Everyone is shocked when I tell them it is a Kindle.", "Title": "Love it!", "Date": "February 25, 2014"}, {"Author": "Elinor P. Olson", "ReviewID": "R1WEWSMGVWEB7G", "Overall": "4.0", "Content": "I like the Kindle Fire HDX 8,9.but have not as yet tried all of the options.  As I learn more about all that can be accomplished on the kindle I'm sure I'll add a star!", "Title": "Kindle Fire HDX 8.9", "Date": "February 24, 2014"}, {"Author": "Anthony M Murray", "ReviewID": "RNFCA6YV40DY", "Overall": "5.0", "Content": "I love it. I have no complaints or comments. It is a great product. It is a very good product.", "Title": "Kindle Fire HDX", "Date": "February 24, 2014"}, {"Author": "TP \"mom\"", "ReviewID": "R20GJPD0AVLKPU", "Overall": "5.0", "Content": "Absolutely love my new Kindle.  I still have so much to learn about it, but I am looking forward to using it for a long time.", "Title": "Kindle Fire HDX 8.9", "Date": "February 24, 2014"}, {"Author": "Steve Townsend", "ReviewID": "R1YZ5370XZA36I", "Overall": "4.0", "Content": "Maybe I'm just behind the times, but I have had trouble getting used to the \"different\" way of navigating on a tablet.  I love the bright, sharp picture, and apps I've downloaded have been good.  I have had trouble with different passwords, which has been rather frustrating.  Overall though, it is a great device, and I'm sure I will get the hang of it eventually.", "Title": "Learning Curve", "Date": "February 24, 2014"}, {"Author": "ArtisticCowboy", "ReviewID": "RRZVXW09Q2U66", "Overall": "5.0", "Content": "Let’s make this review simple and to the point so hopefully it will help someone make a good decision about whether to buy this or not.I am 52 years old, an avid photographer and fairly tech savvy (I build my own computers). I do have a business license for photography but do more free than for paid. My number one goal was to use this device for my photography to make it easier to view images then my excellent but small screen on the back of my Canon EOS 5D Mk-III. I wanted a very bright screen, highest resolution I could find, best color reproduction I could get, light and long lasting on batteries, and easy to use. I also wanted it to be easy to setup and fast for photography because, let’s face it, if I have to wait to see my images on this I won’t use it in the long run and it will become something to collect dust.So how do I feel about it so far? AWESOME! This device lives up to everything I had hoped. Even my wife enjoyed using it and wanted to learn more about the software (CamRanger). I do admit that in a very bright sunny outdoor area (used it yesterday in the mountains for a bridal shot) it is harder to see the screen. Now note I said “harder”, not impossible. It was still much better than the screen on the camera and it allowed my beautiful wife to better assist me in my shoots. You can connect this with an Eye-fi card or with a CamRanger. I did both. (Go look up my name as a reviewer on the CamRanger). I do not recommend the Eye-fi for pros. It is too unreliable and to fussy.Bottom line: I would definitely recommend this to others for photography. I will always have it in my bag wherever my camera goes. It is also very enjoyable to use for surfing the net and reading the latest eBooks (I read a lot of photo how-to books all the time). It is beautiful, light, fast, slick, easy to carry and fun. And did I mention that the screen is downright gorgeous?Enough said.May this review help those who are trying to decide. God bless!Bill C.", "Title": "Kindle Fire HDX 8.9\" 16GB For Photography", "Date": "February 24, 2014"}, {"Author": "Bonnie Loeffler", "ReviewID": "RIHA8GFI0ZYP4", "Overall": "5.0", "Content": "This tablet is a dream come true. It allows me freedom to browse without being tied to my computer.  The only drawback is that it can't open some types of files.", "Title": "Replacing my computer", "Date": "February 23, 2014"}, {"Author": "Mrs Pat McKenny", "ReviewID": "R3DVJIP5NCPA98", "Overall": "5.0", "Content": "I  just love it.  It is with me at all hours!  The screen is so bright, and it makes reading so enjoyable,  And it is so easy to download other apps.  I had gotten an Apple first, but found that it did not live up to expectations...the technical help, such an integral part of the advertised product, was impossible to reach.  This Mayday button really WORKS!", "Title": "Terrific!", "Date": "January 31, 2014"}, {"Author": "Robert Ross", "ReviewID": "R3Q1WM1Z0ZEV7D", "Overall": "3.0", "Content": "I picked three stars because this is the first tablet of any sort I have owned, so I have nothing to compare it to. I am used to windows format and no touch screen so that took a bit of getting used to. The best thing so far is the HELP app. The live people have been great and very helpful to a non tech savy old person.", "Title": "The judge is still out.", "Date": "January 31, 2014"}, {"Author": "CQ80", "ReviewID": "R3IJ5WL3L1UKE8", "Overall": "4.0", "Content": "I really love my Kindle Fire HDX 8.9' 16GB. It's awesome. Sound quality is great. Size is great. I enjoy watching Netflix on it. Facebooking is not slow, like how it is on my iPhone. I love using Overdrive on it for audiobooks rented from my library. I love getting free ebooks through Amazon. The only issue I have with the product is that my wifi doesn't always stay connected. I'm not sure why that is but it's still a great product. If I did a lot of internet browsing on my Kindle I'm sure it would drive me nuts but I mainly use it for eBooks, Overdrive, and Netflixing.", "Title": "Love it - however...", "Date": "January 30, 2014"}, {"Author": "Don Riggs", "ReviewID": "R1DULVDSRH5GOA", "Overall": "5.0", "Content": "I have had a NOOK for three years and really liked it but it had limited uses. My Kindle fire allows me to do so many things that the NOOK did not offer like the number of apps, music, and ease of internet access. The speed of the fire is great. The resolution is fantastic.The complaint I have is the difficulty in getting the NOOK app on the Kindle. I have a lot of books and magazines on that system.", "Title": "Gave up my NOOK", "Date": "January 30, 2014"}, {"Author": "T. Crisman \"Johnny Dangerously\"", "ReviewID": "R2PX5DP3B5BLXJ", "Overall": "4.0", "Content": "Everything about this piece of equipment is incredible, the screen resolution, the response time, even the menu system is excellent.  I also feel a lot less locked in than I do with my apple equipment.  Definitely one of the coolest toys I've ever owned, and the battery life is exceptional, it seems to last at least as long as my ipad 2.  The big problem?  The app store.  Outside of the most popular apps of all time, you're not going to have much luck finding a lot of things that are in other app stores.  The app store is much worse than google play and comically bad when compared to the apple app store.  Still, it's a much better piece of equipment when compared to the alternatives at a much better price.  If you buy it, more software developers will build for it and you'll probably be able to use it longer than the alternatives given the equipment specs.", "Title": "limited application library is the only major problem", "Date": "January 30, 2014"}, {"Author": "Michael John", "ReviewID": "R35ZJ6TDQOGVY9", "Overall": "5.0", "Content": "The Kindle Fire exceeded my expectations. Works great, has good battery life and is extremely fast. Delivery was excellent and product is solid.", "Title": "Amazing", "Date": "January 27, 2014"}, {"Author": "webuff", "ReviewID": "R2JQN65M9O1U6M", "Overall": "5.0", "Content": "Love this tablet, quality, sound, picture, light as a \"feather\" and you can do whatever you can do on most other more expensive tablets. What is there not to like? Nothing! This product exceeded my expectation. I highly recommend this tablet.", "Title": "Fantastic!!", "Date": "January 27, 2014"}, {"Author": "dale mount", "ReviewID": "R2SL0SLYV56NGP", "Overall": "5.0", "Content": "I purchased this for my wife as a Christmas gift, and she is in heaven!!! I am thoroughly impressed with the graphics and performance of this little machine!! If you are considering purchasing a kindle, do it!! You won't regret it.", "Title": "this thing is awesome!!!", "Date": "January 27, 2014"}, {"Author": "Soda Pop \"floppy disk\"", "ReviewID": "RHD10ZR262T6N", "Overall": "5.0", "Content": "I love my new kindle HDX. However, the keyboard is smaller than the Kindle Fire and the charge indicator is so small I can barely see it. I have to log in to the device to see if the HDX is fully charged. I miss the green fully charged indicator light that is on the Kindle Fire.  The Power ON button is in an awkward place so I keep hitting the sound up/down button. The HDX blinks off while in use causing me to log in again.  I am reluctant to sell my Kindle Fire until I see how the HDX will perform over several months.The Apps are wonderful, the screen resolution is bright and clear the HDX has really nice accessories. I love reading and rarely leave home without my Kindle HDX.", "Title": "Wow fantastic Kindle Fire HDX", "Date": "January 27, 2014"}, {"Author": "Carole M. Pearson \"redbird5017\"", "ReviewID": "R1IFI7QS0SUJBD", "Overall": "5.0", "Content": "This is my third Kindle and I am so pleased with it. It is easy to navigate Quick downloading of books, apps and games. Fun to use and the Mayday help is amazing! Almost as soon as you push the help button there is someone there to help with your question or problem. I am very pleased with it and the ads that pop up when you turn it on are not distraction at all.", "Title": "Fantastic display and light and easy to handle", "Date": "January 27, 2014"}, {"Author": "F. Roberts", "ReviewID": "R1IGE8CV8QS0UN", "Overall": "5.0", "Content": "All of my friends have recent iPads. My Kindle stacks up with the iPad in every way. Thanks to the linkage with Amazon it has a number of positives that the iPad does not have. I think it is an excellent product at a very good price.", "Title": "Kindle outshines iPad", "Date": "January 27, 2014"}, {"Author": "Julie", "ReviewID": "RGIQWQA63ECQE", "Overall": "4.0", "Content": "If you move it shuts off, or skips pages then fails to catch up and shuts off.fix this=5 stars", "Title": "Text to Speech", "Date": "January 27, 2014"}, {"Author": "Mike Simpson", "ReviewID": "R28USI4OBVE8S6", "Overall": "5.0", "Content": "Great product, very worth price.  Have used both kindle and iPad, prefer the kindle for many reasons.  Shipping was fast.  Highly recommend.", "Title": "kindle fire hdx 8.9", "Date": "January 26, 2014"}, {"Author": "Joanne Widmer", "ReviewID": "R152TKOEBV6JX9", "Overall": "5.0", "Content": "This is my 3rd Kindle, and by far the best! I am a Mac fanatic but couldn't see spending the extra money for an iPad... The Kindle Fire HDX does everything I need it to do and more.", "Title": "Worth the upgrade", "Date": "January 26, 2014"}, {"Author": "Rodney Lutes", "ReviewID": "R3UY1HESJSY1L", "Overall": "5.0", "Content": "I love it. It is everything I thought it would be. Does everything that my wife's I pad does. It is Crystal clear.", "Title": "Wonderful", "Date": "January 26, 2014"}, {"Author": "JACKIE SPEARS", "ReviewID": "R1RCFM06RJC0VY", "Overall": "5.0", "Content": "VERY GOOD, I AM ABLE TO COMPLETE INFO, THAT WILL HELP MY SELF AND MY GRANDDAUGHTER, THANK YOU THANK YOU!!!!!!!", "Title": "VERY GOOD", "Date": "January 17, 2014"}, {"Author": "Peggy Brennan", "ReviewID": "R22JXW4CKM2BN0", "Overall": "5.0", "Content": "I am never bored, reading or playing games, what a wonderful, colorful and sharp picture item.  Couldn't have asked for better.", "Title": "Got to love it", "Date": "January 17, 2014"}, {"Author": "beej10", "ReviewID": "R338FB4TM510MW", "Overall": "5.0", "Content": "Enjoying my kindle. Very compact and lightweight and does just what I've wanted to stay connected. Pictures are so pretty!", "Title": "KINDLE FIRE 8.9, HDX", "Date": "January 17, 2014"}, {"Author": "Darryl Richardson", "ReviewID": "R2VZAVS0F79FC3", "Overall": "5.0", "Content": "I brought this for my wife for Christmas and she just love it. oh did I mention this is her third kindle. They just keep getting better and better.", "Title": "Great", "Date": "January 17, 2014"}, {"Author": "jbodden", "ReviewID": "R2E3ZE62J7SB90", "Overall": "5.0", "Content": "It works great. I really enjoying using it. So far it has met all my expectations. It is much smoother to operate than my first generation Fire.", "Title": "HDX is smooth", "Date": "January 17, 2014"}, {"Author": "jw", "ReviewID": "R103UVODC7U0VB", "Overall": "5.0", "Content": "My first tablet. It's easy to use. It's all I expected and more. Everyone I've shown it to that already have tablets thinks it's great.", "Title": "Great Tablet", "Date": "January 17, 2014"}, {"Author": "Cooter", "ReviewID": "R1X58HHSV181QV", "Overall": "5.0", "Content": "My wife loves Kindle Fire that I purchased for her for a Christmas present. Kindle Fire and myself are in competition for her private time! Shame on you Kindle Fire!", "Title": "My wife loves her Kindle Fire that I purchasded at Christmas. Now Kindle Fire & myself are in competition for her private time!", "Date": "January 17, 2014"}, {"Author": "OKchic", "ReviewID": "R2EKC925UXE0ZA", "Overall": "5.0", "Content": "I am really enjoying my new Kindle Fire HDX 8.9.  I have had a original Fire, and 2012 Fire HD 7\". I wasn't really sure I could justify the upgrade this time, but I had wanted a little larger screen for a long time and really wanted one. I am glad I did. I had a little problem with the first one I received, but called and Amazon got me a replacement on the way immediately. I was able to use the first one until the replacement arrived and then sent back. This one is great. I love the great display, and I really love how light it is! I got a semi hard plastic shell type back for mine so it added almost no weight, after trying some other cases. I just slide that into a sleeve to put in my purse. It is so light weight for the size and is really comfortable to hold for long periods. I am a huge reader and listener of my Amazon Ebooks, so I love how seamlessly it works and syncs with my Kindle Paperwhite and other Fire HD. I actually had tried a Samsung Note for a few days, thinking I would try something different, but I am too much of an Amazon gal, and my books not being available to listen to easily for my commutes just was not working for me. The new Fire HDX is noticeably faster than the HD. I also love that it is much faster and with no interruptions when viewing Prime videos. I have had almost no problems with that. It sounds great and the videos are crisp and clear. I got a Bluetooth speaker I use some when I am up doing stuff around the house, so I can listen to my books or music. It is quickly becoming my constant companion. I was concerned about the lack of the Google play store just like many others. That is the main reason I tried the Samsung first. I do believe however, that the Amazon app store is improving all the time and for what I do, I have adequate apps. I do have a Samsung phone, so I do have access on it for anything I would run across that I couldn't get on my Fire. I think most people will be pleased. Give it a try! I am really glad I went ahead and got one. I haven't used my laptop in ages!", "Title": "Loving it!", "Date": "January 17, 2014"}, {"Author": "george kolb", "ReviewID": "R360LY06JA2RKI", "Overall": "4.0", "Content": "Good product light weight ! Would recommend to anyone to replace most laptop functionsPrice was right but would recommend ordering cover and blutooth keyboard when purchasing", "Title": "good product", "Date": "January 17, 2014"}, {"Author": "Peggy Payne", "ReviewID": "R3A6NUOM26WMQR", "Overall": "5.0", "Content": "I had the original kindle and recently bought HDX.  I love it. Lit screen for nighttime reading.  Picture is wonderful for movies and games.  If you are on the fence about this,  get it", "Title": "Picture is wonderful", "Date": "January 7, 2014"}, {"Author": "sthrnboy", "ReviewID": "RXIMOF7X8QEAT", "Overall": "5.0", "Content": "I love it so much! I'm always tapped into Amazon if I need them for support or if I want to look for something to get on Amazon as I do most of my buying there, but also I can chat with my friends from it, get my emails, play games or read many of the free Prime member books or movies right at my fingertips! It's wonderful!", "Title": "Best Tablet I've Owned", "Date": "January 6, 2014"}, {"Author": "Carrie Swanson", "ReviewID": "R1C4ID96HMJTMS", "Overall": "5.0", "Content": "Update review. I just received my new Kindle Fire HEX.  It is possibly lighter and definitely thinner than my Kindle Fire 7. The screen seems huge compacted to the 7 too and has better resolution though the 7 was good too. Reading magazines got easier because like a paper magazine you can see two pages minus the staples. Games are fun on it too and I am looking forward to seeing movies. The volume is much improved over the 7 and I don't have to strain to hear it. I like the easy to reach controls in fingers reach on the back. and appreciate that I got a whole charger and not just a sync cable. I now have a spare. Spares are good.", "Title": "Update review.", "Date": "January 6, 2014"}, {"Author": "WayneO", "ReviewID": "R1GUKZH0RGAFTH", "Overall": "5.0", "Content": "We have several lap top computers, a Nook, a Kindle Fire and now this Kindle Fire HDX 8.9.  The HDX surpasses expectations.  It will not replace the lap tops entirely, but for reading books, checking Facebook, reading emails, playing games, and some web surfing; it does a great job!!!  I would highly recommend it. iI is all that is advertised and more!", "Title": "Kindle Fire HDX 8.9 is Great", "Date": "January 4, 2014"}, {"Author": "Patti", "ReviewID": "R38EVHGNOWVL96", "Overall": "5.0", "Content": "Christmas gift for my 10 year old daughter,  so far I can pry it from her hands.  We love  it. She watch movies,  play games,  but must of all she spend plenty of hour reading.", "Title": "I have a Kindle fire HDX, that what she says", "Date": "January 4, 2014"}, {"Author": "Don Carlson", "ReviewID": "R3A77DUY7NTH6A", "Overall": "5.0", "Content": "We love our  Kindle Fire HDX and use it all the time! would recommend it to any one! It is just the right size to carry, love the sound and takes great pictures!", "Title": "Kindle Fire HDX", "Date": "January 4, 2014"}, {"Author": "Dulciecat", "ReviewID": "R32OLN45M7RRQY", "Overall": "5.0", "Content": "It is lighter than the old version and is a great device! I use it every day for reading, games and recipes. I just wish the battery would last longer. I have to remember to charge it every night or it won't last the next day. I started out with a Kindle Keyboard and it would last several days between charges. I realize the HDX is color and I'm using a lot of graphics, etc....but you'd think they could come up with a longer-life battery....or maybe a FASTER charger (I have the rapid charger.) Or......being able to use it while plugged into the charger would be good......Forgetting and leaving the WIFI on drains it super fast......but I still love it!", "Title": "Love it....wish battery lasted longer...", "Date": "January 4, 2014"}, {"Author": "Natalie Caesar", "ReviewID": "R1LK4MJFYQJ4V8", "Overall": "5.0", "Content": "Easy to learn how to use, it teaches u in the beginning. Love the size when watching movies, very lightweight.I'm happy with the product", "Title": "Great product", "Date": "January 4, 2014"}, {"Author": "Marlin Mogan", "ReviewID": "R1SP8QPMK6RFWJ", "Overall": "4.0", "Content": "I like it for reading the morning paper, weather forecast, long with checking emails.  Battery life is shorter than what I expected.  Would be nice if it came with a operating manual.", "Title": "works great on the internet", "Date": "January 4, 2014"}, {"Author": "Ruth Rosamond", "ReviewID": "R25F4TA0A4CFF7", "Overall": "5.0", "Content": "I'm still learning about my kindle, but it's brilliant. The screen size is perfect and its light weight is easier to handle than many books. I love having wireless at my fingertips when I want to look up something. Great new product, thank you.Ruth Rosamond", "Title": "The best Christmas present!", "Date": "January 3, 2014"}, {"Author": "TxLadyrah", "ReviewID": "RUO94BV33MDV", "Overall": "3.0", "Content": "I really like my new KINDLE HDX, but I'm still disappointed about the sound problem.  I like to listen to a book while I'm driving, and the voice reading my book to me will all of a sudden stop for no reason.  I have to pull over & try to reset it, but that doesn't always work.  It's very annoying. I've pressed the MAYDAY button & asked for assistance, but out of the 3 people I called when it keeps happening, not one knew how to fix the problem.  Only one said they would put in a \"Problem Report Ticket\" about the problem I've having with it.  Haven't heard back yet about a fix for it or an explanation.  That was a week ago.", "Title": "Sound Problem with my new Kindle HDX ...", "Date": "January 3, 2014"}, {"Author": "Brownbats", "ReviewID": "R3TC9J0RG3EWH8", "Overall": "5.0", "Content": "Love this Kindle Fire HDX. 8.9 very much  and very simple easy to use. My daughter tells me it is better than Apple because of it's lightweight  & longer battery life than Apple.", "Title": "Better than Apple Air", "Date": "January 3, 2014"}, {"Author": "Elizabeth Hightower \"cloudhair\"", "ReviewID": "RYGDVY1G367TV", "Overall": "5.0", "Content": "I've had my Kindle Fire HDX for a week, and I'm very satisfied so far. I bought it primarily to surf the internet and stream movies and TV on Amazon prime. I have been very happy with those features so far.Browser speed Some people have complained about the browser speed, but it has worked fine for me so far. I've used the HDX to stream a TV show off the internet, and there were no problems there. A screen did pop up saying I needed a flash player, but then another screen popped up saying I could use an experimental Amazon player, and that worked well enough.Screen fingerprintsSome people have complained about fingerprints on the screen, and this can be a problem in certain light. I may invest in a screen cleaning cloth.AppsThe app availability is not as good as the iPad, but I did not buy this to run a bunch of apps. I have an iPhone for that. I did download the Pinterest app and the Facebook app, and I have been satisfied with those so far.PrimeAnother complaint I have seen is the limitations of prime. I agree that there don't seem to be enough shows you can download to your device. Fortunately I have been binge watching The Good Wife, and it was available to download onto my device. It takes a while to download. I ended up letting the episodes download overnight. There are three different download qualities. At first I used the middle quality, but that took too long, so I started downloading with the lowest quality. I'm not really a picture quality snob, so the lowest quality was fine with me. I liked the shorter download time and less memory needed. I have the 16g and had no problems downloading 6 45 minute episodes. It's very easy to delete them as you go. I didn't mind the 48 hour watching window since I watched each episode is one sitting on an airplane.As an ereaderI have an earlier kindle that I use for reading, so I wasn't planning on using this as an eReader. My original kindle is not backlit, so I did end up using my HDX as an ereader while riding in a dark car. It was good for this purpose, but I prefer to read on my other kindle if I am reading for longer periods of time since it is not backlit. I like the dictionary function on the HDX better. It's easier to use since my other kindle is not a touchscreen. I liked how the two kindles synched via the internet, so I could keep my place in my book between devices.Button placementMany people have complained about the on/off switch and volume buttons being located on the back. I would prefer a home button on the front like an iPad, but I've gotten used to the back buttons.Overall I am very pleased with my purchase. I've had no problems with it whatsoever. I love how lightweight it is and how beautiful the screen resolution is. The battery life is great even when streaming. I also love how much cheaper it is than the iPad.", "Title": "loving my Kindle Fire HDX so far!", "Date": "January 3, 2014"}, {"Author": "Edward Ybarra", "ReviewID": "R8WACDQBV5SRW", "Overall": "5.0", "Content": "Spunky, Smart design, Fantastic Graphics! I am so pleased with this new Kindle. I't only needs an SD memory Slot to be incredible.Hint Hint!", "Title": "What a good Tablet", "Date": "December 31, 2013"}, {"Author": "Brant Thornton", "ReviewID": "R1CVCBNDU0HKF8", "Overall": "5.0", "Content": "Love it.  Best yet!  Love everything Amazon does - very good products and delivery and this Kindle is no different!", "Title": "Awesome tablet!", "Date": "December 31, 2013"}, {"Author": "honeydew", "ReviewID": "RZYXPO4JY7KWC", "Overall": "5.0", "Content": "to anyone who has a kindle or a kindle fire, you will love the kindle fire HDX8.9\" or the smaller one. I  just love this one. I already have the kindle.which is in black and white. DI loved that one when I got It. My son gave me the kindle fire for Christmas last year.I loved that one even more.it is in color. But the kindle fire HDX8.9\" is WOW it is faster,I haven't really played with it much, but what I see of it is awesome. I plan on keeping at least the first kindle because there are some games on there that I can't get on the other kindles. It came already set up for me which I liked.", "Title": "kindle fire HDX8.9\"", "Date": "December 31, 2013"}, {"Author": "Stephen \"reader of books\"", "ReviewID": "R2CG8KA09TXAJ8", "Overall": "4.0", "Content": "This is my third Kindle (my second Kindle Fire).  I find it faster and works more smoothly than the first Kindle fire.  I really like the 8.9 form factor.  The Origami case works pretty well but about doubles the weight it seems.The only thing holding it back from 5 stars is the fact it does not have full access to android store or apps.", "Title": "Does what it is supposed to do", "Date": "December 31, 2013"}, {"Author": "roseyv55", "ReviewID": "RCLBZVLDZ5RXX", "Overall": "5.0", "Content": "First tablet I have ever owned, very light weight, display great. Only wish it would of come with a manual so I could learn to navigate, but am figuring it out. Mayday button is very helpful!", "Title": "I Love it!", "Date": "December 31, 2013"}, {"Author": "evaconda", "ReviewID": "R2JTGMJ6BRBU6A", "Overall": "5.0", "Content": "I love my kindle! This is the best kindle, excellent picture and sound, light, the email display is awesome , I love it!!!", "Title": "Feedback", "Date": "December 29, 2013"}, {"Author": "Dennis M. Rees", "ReviewID": "R1BOI1IGWURPOA", "Overall": "5.0", "Content": "This device exceeds all my expectations. So easy to use and so full of wonder. It will do everything imaginable to educate and entertain.", "Title": "Best gift ever", "Date": "December 29, 2013"}, {"Author": "Gary L. Williams", "ReviewID": "RRZPRFBL7QV5I", "Overall": "5.0", "Content": "It is fast, clear, and easy to hold. Light weight does not tire my arm. The camera is excellent and postingor emailing photos is super simple. Although battery life is much better than my original Kindle Fire it stillcould be better, I still have to charge it each night but it gets heavy usage since I am retired and read a lot.The help center is fast and easy to use.Only disappointment was that I could not put Facetime on it. (Apple product) Sure there is something else availablebut have not had time to search for it.. Overall a great product.", "Title": "Excellent for me", "Date": "December 29, 2013"}, {"Author": "M. Bouska", "ReviewID": "R33ZPDUUAD7SF8", "Overall": "5.0", "Content": "Graphics are amazing, and there is no lag or delay with any games I have tried.  Streaming video is perfect as well", "Title": "I enjoy the Kindle Fire HDX 8.9", "Date": "December 29, 2013"}, {"Author": "Paul A Mala", "ReviewID": "RFYCKPV7R0NUR", "Overall": "5.0", "Content": "I parted with my Kindle HD  fire 7 for 2 reasons, I want to read magazines without having to scroll around the screen and my daughter loves to read on it. I gifted the 7 to her and bought this model. This model has an awesome camera, is very light and I can see how much quicker the response time is.I have used both Kindle and Ipad and the Kindle gives me more of the entertainment experience with a balance of games books and music. I do wish there was and itunes for kindle app. not that I don't buy MP3's from Amazon, but most of my collection is already on Itunes. Between the offers and the overall collection this is a great experience especially when paired with an Amazon Prime account .", "Title": "Christmas gift too myself", "Date": "December 29, 2013"}, {"Author": "cflo93", "ReviewID": "R1TVGK1H75HCLK", "Overall": "5.0", "Content": "I like the overall feel of an e-book reader, and the Kindle Fire HDX 8.9 is amazing. I have an iPad mini that I've used since they were released, and I am so used to using that. I do like the OS on the Kindle as well, and it's pretty high up there as far as functionality goes. The only thing that I would say I do not like is the button placement on the device.", "Title": "A-", "Date": "December 25, 2013"}, {"Author": "paul flores", "ReviewID": "R1T3S4GJLNP35T", "Overall": "5.0", "Content": "light, fast boot time big hdd nice cam with high def screen and a big hd displaywould gift to friends and fam con price tag", "Title": "i really love it", "Date": "December 25, 2013"}, {"Author": "Carl F", "ReviewID": "R326T9XO4RVENV", "Overall": "5.0", "Content": "Better battery life, better resolution.  Lighter, easy to carry, easy to read.  This is my 4th tablet. Just a matter of time before is my only one.", "Title": "better than an ipad", "Date": "December 25, 2013"}, {"Author": "Ken Ament", "ReviewID": "R2D1Z5NF49DE35", "Overall": "5.0", "Content": "I ordered the HDX fire for the May day feature.It has turned out to be more  than I could have  expected,it his feature is VERY helpful", "Title": "I love my kindle!!", "Date": "December 24, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RQJRWWCLR10RX", "Overall": "5.0", "Content": "Get one now, so versatile and enjoyable to use. Excellent product! This must be the best in the in industry. We love it.", "Title": "GREAT PURCHASE AND ACQUISITION!!", "Date": "December 24, 2013"}, {"Author": "Trisha Korpa", "ReviewID": "R13AQSJXHZSMYG", "Overall": "5.0", "Content": "I love this kindle it does everything I wanted it to do and more go kindle!!! My kids love it to", "Title": "great!!!", "Date": "December 24, 2013"}, {"Author": "A. Higgins", "ReviewID": "R2WQK3QVPZZ5UV", "Overall": "5.0", "Content": "This device is amazing.....love it. I was hesitant about getting a tablet but this changed my mind. Wonderful graphics easy to use. Great all around.", "Title": "super fast", "Date": "December 23, 2013"}, {"Author": "Terry J Hicks", "ReviewID": "R2AT8ZNZRA9XJN", "Overall": "5.0", "Content": "Love it....Finding new options all the time....Mayday has already been helpful for learning to print from the Kindle including photos", "Title": "Kindle HDX", "Date": "December 22, 2013"}, {"Author": "jason kattenhorn", "ReviewID": "R3UNVGS6HFQUND", "Overall": "5.0", "Content": "Love the kindle, my 3rd one and have enjoyed this product more each time it is improved upon. Great for movies", "Title": "Great toy!", "Date": "December 22, 2013"}, {"Author": "Greg", "ReviewID": "R1LO66OMFZVOWL", "Overall": "5.0", "Content": "This device is great.  Even my 6 year old son loved it. I would recommend this to anyone. Thank you.", "Title": "Awesome", "Date": "December 21, 2013"}, {"Author": "Robbie A. Dobson", "ReviewID": "R2DFY7K06ILTR6", "Overall": "5.0", "Content": "This is my first tablet and first kindle. I only tried it because of the free trial. I am an avid reader and never wanted anything but a physical book in hand. The kindle has added a new level of enjoyment to my favorite pastime.  I'm still discovering new and wonderful things about this device. It is really user friendly.", "Title": "I love it", "Date": "December 19, 2013"}, {"Author": "Reaper2092", "ReviewID": "ROB1ISKPV1N63", "Overall": "5.0", "Content": "Pros. Does whatever you needCons. Using youtube on the browser is a bit glitchy as hitting the back button results in going back to the youtube home page. And when viewing a video it is difficult to skip ahead or back", "Title": "Great product", "Date": "December 19, 2013"}, {"Author": "mehhossein", "ReviewID": "RWGO15EQBVW6F", "Overall": "4.0", "Content": "Awesome screen and if you have prime a good entertainment center for you too. Does the job for a tablet.", "Title": "A decent tablet", "Date": "December 19, 2013"}, {"Author": "C. LaChester \"Cindy\"", "ReviewID": "R1Z6CZPEMNNE2", "Overall": "5.0", "Content": "Love it but need more games that inter line with Facebook, also check out the apps first. Also need more instructions, still having trouble finding things", "Title": "kindle", "Date": "December 18, 2013"}, {"Author": "Pete Vermont \"PeterV\"", "ReviewID": "R3NIOP2O82J2LB", "Overall": "4.0", "Content": "i researched various types of tablets and i decided to go with this one because of the size, weight and mayday feature. The pricing was comparable to the other big name tablets like samsung and ipad. the graphics were very good and applications that come with the hdx were a good starting point. i was less then happy with the fact that it was not a pure android. this means that not all android applications would work with this device. I also wished they would have built in a 'card' slot to upgrade the memory. I bought a 32gb model would should suffice for my needs. the screen is responsive to touch and the functionality & mechanics will take some time for me to understand. the Maybay function does help with learning some of the functions/mechanic unique to the HDX. i think i made the right decision but my learning curve may not be a short of some of the other android type users. I am optimistic that this is the product that is best for my needs!!", "Title": "its a step in the right direction", "Date": "December 18, 2013"}, {"Author": "Ron Stansell", "ReviewID": "R2PICTY2GRG5HX", "Overall": "5.0", "Content": "My wife is addicted to reading and playing games.  The Kindle Fire HDX 8.9\" has replaced her laptop computer.  It is easier to handle and the screen is bright and vivid.  Thank you Amazon for creating such a product.  Would definitely recommend it to all!", "Title": "My wife's favorite toy!", "Date": "December 18, 2013"}, {"Author": "Diane Delvecchio", "ReviewID": "R3016Y1Q87BNX3", "Overall": "5.0", "Content": "Just received it, but so far so good. Only wished it came with a manual. Will let you know if i have any problems.", "Title": "Kindle Fire HDX 8.9 Wi Fi  4g kte 32 gb", "Date": "December 18, 2013"}, {"Author": "Luisa Roberts", "ReviewID": "R3VKV5OOK87DRT", "Overall": "5.0", "Content": "I love the wide array of colors that are available. The pictures are very clear. It's very easy to navigate through the different options and folders.", "Title": "Fantastic tablet!", "Date": "December 18, 2013"}, {"Author": "PEIsinghood", "ReviewID": "R1O4IH0XUH11I6", "Overall": "5.0", "Content": "Shipped quickly. The Kindle Fire HDX performs very fast. The display has an awesome picture. Very light weight and super thin. The camera takes great pictures.  I love it.", "Title": "Kindle Fire HDX 8.9\" Awesome Tablet!", "Date": "December 6, 2013"}, {"Author": "N2Paint25", "ReviewID": "RO9UKSF9PMYX1", "Overall": "5.0", "Content": "I have had two kindles and when my husband wanted something to play games on and watch movies when we travel, we originally looked at small laptops however traveling made them too bulky to carry around so I bought him this for his birthday. He loves it! I have a kindle fire hd but wish I had this new one. It is lightweight and the screen is bigger than my 7\".", "Title": "Great birthday present for my hubby!", "Date": "December 6, 2013"}, {"Author": "wsap", "ReviewID": "R38BX5M908YLYP", "Overall": "3.0", "Content": "Wanted to love this gift but the horrible silk browser ruined it for me. I have a first gen kindle fire that I kept, thank goodness. When you can't access sites you have accessed on your other kindle, then you know the browser is horrible. If the browser were up to par, I would have kept it. Returning it and will use my original. Btw got a blue screen today. On a positive note the setup was a breeze. And a weird note, the 8.9 was too big for me.Update 1/4/14: Returned my kindle hdx via ups. Arrived at amazon yesterday and they have already processed my credit. I used my gift card credit on a new pair of shoes. My credit card credit should show by Monday. Thanks amazon for being so quick and efficient. I hope future kindles have a better browser.", "Title": "silk browser ruins this item", "Date": "January 1, 2014"}, {"Author": "Wilderness \"wilderness1111\"", "ReviewID": "R1J3T05V4YT6KP", "Overall": "4.0", "Content": "With the availability of \"Kindle Free Time\", Amazon is finally recognizing some of the challenges that parents face when buying a device for kids. Unfortunately, they are still a little behind and need to rethink it a bit.It is great to be able to limit the time a kid spends playing apps when he/she could be reading and nice to be able to control the length of time using the tablet per day and control the hours of the day when it can be used. Bravo. Unfortunately, \"free time\" is designed for kids 8 and under and so much of the functionality of the device is eliminated by running free time. They assume a kid is never going to want to use the camera on the device or listen to music, for example. Access to the internet is blocked and so is access to calendar and address book tools. If a child is 9 and over, there is another level of parental control that allows parents to turn off certain features only--for instance, purchasing, internet browsing and social media. Unfortunately, Amazon fails to recognize that parents might want a means to regulate play time with OLDER kids as well. This method also means that if you are using your own account to provide content to more than one device that everyone will have access to everything on the cloud, whether or not something is age-appropriate.My wishlist of changes:(1) Make a level of \"Free Time\" for kids 9-14(2) Make it possible to play music from \"Free Time\" and give selective access to the music cloud.(3) Make it possible to turn on other functional aspects of the device, such as email capability for certain kids.(4) Make it possible to regulate time spent in certain types of apps or to simply lock some apps in favor of others--e.g. if there are educational apps that get the back-seat while game apps are active.", "Title": "Good tablet for kids...but not yet great.", "Date": "December 31, 2013"}, {"Author": "joni cohen", "ReviewID": "R2KJULNDRRPMDD", "Overall": "5.0", "Content": "The Kindle Fire  HDX 8.9 does everything I wanted it to do AND more !!  Love it . Maybe I'll even do some reading.....", "Title": "What more could you ask for????", "Date": "December 8, 2013"}, {"Author": "Richard Blake", "ReviewID": "R1CW7APXWVCMXQ", "Overall": "5.0", "Content": "My original review still exists below. It turned out that my first Kindle Fire HDX had a glitch. I used the SOS help on my Kindle and after speaking with a customer service representative for a few minutes a new device was on its way. Now, except for some minor issues which are not necessarily Amazon's fault, I would give an enthusiastic five stars.I've had trouble downloading content several times. The PBS App, which I was looking forward using frequently, is completely unusable.Other things, like being unable to watch \"Justified\" in Full Screen mode, which means I might as well have a smaller, cheaper tablet. Sometimes it's a pain trying to get controls to appear, especially since you touch or tap different areas on the screen, depending on the program or app running at the time. Sometimes I feel STUPID, while I'm using this SMART Tablet.  I must say that I love the WhisperSync. I read for awhile and then listen to the audiobook which picks up exactly where I left off.  It has a nice browser that I use to check my email at work.", "Title": "Review updated", "Date": "December 7, 2013"}, {"Author": "JRM Book Reviewer \"JRM\"", "ReviewID": "R6Z7FVEQMXU7Y", "Overall": "3.0", "Content": "It's not as exciting as I originally thought.  One issue that irritated me was the fact that on certain screens I couldn't control the font size to my liking.  Also since it's an android device, I thought I could get apps from either Amazon or Google Play.  I couldn't get the same functional bank app that I have on my android phone where I can take pictures of checks for depositing.  The app let's you know that it won't work on Kindle Fire HDX.  Another issue that the help folks couldn't solve was how to use my Holy Bible app that I use on a previous version Kindle on my new Kindle.  Fortunately, I got hold of the author of the app and got instructions that allow me to use the app.  Otherwise, I'd say from the initial turning on, it was very easy to link it to my various e-mail accounts, all my previous Kindle book purchases were readily available for transfer to the new Kindle.  Finally, before resolving the Bible app problem I was going to either return the Kindle or sell it on eBay but now I'm keeping it.", "Title": "Kindle Fire HDX is a Keeper?", "Date": "November 29, 2013"}, {"Author": "S. Koehn \"happy granny\"", "ReviewID": "RKXR6J1M1YO0U", "Overall": "4.0", "Content": "Handy size, good graphics and ease of use make this just what I was looking for. More useful for my purposes than iPad.", "Title": "Recommend my Kindle Fire", "Date": "March 7, 2014"}, {"Author": "B. Clark", "ReviewID": "R30LS80PRYYXMG", "Overall": "5.0", "Content": "I have owned 3 kindles now...so happy I upgraded to the new HDX 8.9.  It is so clear, fast and light.  Just love using it!", "Title": "Love my HDX", "Date": "February 24, 2014"}, {"Author": "george donate", "ReviewID": "R1N8O1829RNNIC", "Overall": "5.0", "Content": "best kindle ever i am very satisfied with this item  best buy for the bucksvery easy to navigate i love itthank you", "Title": "kindle", "Date": "February 21, 2014"}, {"Author": "Christo \"CJK\"", "ReviewID": "R2LEROGG8H50C", "Overall": "5.0", "Content": "I love this device and so glad I did not buy the iPad.  Everyone who has an iPad and sees my kindle is blown  away by the screen resolution, crazy clear and crisp.  Silk web browser is fast, period, web sites fully and speedily load. I got mine on one Amazon sales and saved $160 over the iPad and I like it better", "Title": "Fantastic", "Date": "February 21, 2014"}, {"Author": "David P.", "ReviewID": "R1EU1FSA8Y2B8", "Overall": "5.0", "Content": "Excellent product in every way. Very clear graphics, ingenious leather cover, very good speed response, and brilliant \"mayday\" button. The response and help with the Kindle (from the USA to NZ) was amazing. The device is for my wife, who finds a laptop very intimidating, but the Kindle fire HDX is user-friendly! I'll tell you more we are more familiar with the device.", "Title": "My experience!", "Date": "February 21, 2014"}, {"Author": "Dana Remingon", "ReviewID": "R1P8M47UBX9QOH", "Overall": "5.0", "Content": "I passed along the smaller Kindle to my son and I really like the bigger sized screen for my eyes. This is a Kindle that has sharp colors and is fun to use!", "Title": "Better size for these eyes!", "Date": "February 19, 2014"}, {"Author": "Kent William McMullen", "ReviewID": "R10X5QKMSC3DN3", "Overall": "5.0", "Content": "Got this for my mom for Christmas, and although she is 80 years old, she is enjoying it. For her there was, and still is, a learning curve, but she is getting better with it. The apps work well and the Kindle does what it is suppose to do.", "Title": "Good Purchase", "Date": "February 19, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R3V0SHBDZ8U7CZ", "Overall": "5.0", "Content": "This is the 3rd kindle fire and I really enjoy it.  The only negative...wish Amazon would offer to apply a protective cover, i simply haven't been able to do one on this device.  Other devices, I had no problem.", "Title": "Love it for sure!", "Date": "February 19, 2014"}, {"Author": "Jennifer Johnson", "ReviewID": "R7CVTRUPSZUGH", "Overall": "5.0", "Content": "This version is much better than the 7\" kindle fire I have had for 2 years. Like its weight, thin profile and ease of use", "Title": "Improved", "Date": "February 19, 2014"}, {"Author": "Shane D", "ReviewID": "R3VW8Y2HWS2W0T", "Overall": "5.0", "Content": "Great picture and easy to set up and use.  Does all that they say it can do.  So far no complaints at all.", "Title": "Great Kindle", "Date": "February 19, 2014"}, {"Author": "Susie/Sam", "ReviewID": "R3M7095UQ3VTZD", "Overall": "5.0", "Content": "I have another Kindle but I just love this one. I have read a couple books on it. Have so much more to learn about it and other features but am learning a little at a time.", "Title": "Kindle Fire HDX 8.9\"", "Date": "February 19, 2014"}, {"Author": "plowwife", "ReviewID": "R3I3X6LJX7TT9Y", "Overall": "5.0", "Content": "I really enjoy the larger screen. It makes is easier to read. the grandkids like the screen for watching movies. My books travel with me in a compact form. I can take more then I could with paper backs. Since this is the 5th Kindle I own, I think you can truly say, I love the kindle family. Look forward to seeing what you do next", "Title": "Love is here", "Date": "February 19, 2014"}, {"Author": "ASQ \"happily retired\"", "ReviewID": "R2T0R8IP3WYGD9", "Overall": "5.0", "Content": "When I bought this, I got the bigger memory, but with the cloud available, I don't think I needed it.  It is a mainstay for me now.  Although I don't read books on it very much (I also have a Kindle touch), I like the games and internet capabilities.  It is also light and not bulky, so it will be wonderful when I'm on a trip.", "Title": "Love this", "Date": "February 19, 2014"}, {"Author": "Frances L. Williams \"Frankie\"", "ReviewID": "R28KLLB1O9136M", "Overall": "5.0", "Content": "I have been a Kindle user since their inception. I ordered both the HD and the HDX 8.9. The screen on the HDX is brilliant and bright. I love that I don't need a book light to read it. It is light and easy to hold. I use it mainly for reading and checking e-mail since the Amazon App store doesn't offer very much. This is a must buy if you like to read.", "Title": "The Best Kindle Ever!", "Date": "February 19, 2014"}, {"Author": "Jerilyn L. Kozak", "ReviewID": "RAVFWN2VW0SSD", "Overall": "4.0", "Content": "I find the kindle fire :8.9 very good.  The battery could use improvement.  It is difficult to plug in and in handy to see if the battery is fully charged.", "Title": "Kindle fire HD 8.9", "Date": "February 13, 2014"}, {"Author": "Nicolia", "ReviewID": "R28IZ2G711DJ71", "Overall": "5.0", "Content": "Like so many things about the Kindle HDX: size, weight, clarity, etc.  What I do not like is having to pay the $15.00 to unsubscribe from those annoying ads.  Finally broke down and paid the piper as they were driving me nuts. Amazon certainly is rich enough to refund those of us who shelled out the shekles!", "Title": "Great!", "Date": "February 13, 2014"}, {"Author": "Shopping for me \"Myplace\"", "ReviewID": "RU6DGBTFTQVAQ", "Overall": "5.0", "Content": "What can I say other than this is a wonderful addition that I enjoy very much. Still learning new things it does that I love.", "Title": "Great", "Date": "February 12, 2014"}, {"Author": "Richard", "ReviewID": "R1CLHT1X0ATS2V", "Overall": "5.0", "Content": "This Kindle is remarkable!! Since it's my first tablet (other than an old Kindle reader), I haven't yet learned all that in can do, but I'm thoroughly impressed so far. I'm reading books, watching movies, surfing the Web, handling email, ordering from Amazon, and more. I also downloaded an app call OfficeSuite Professional 7 for $1499 that allows me to use my Kindle to edit my MS Office documents in Word, Excel and PowerPoint. I'd give this Kindle 6 stars if I could.", "Title": "My first tablet", "Date": "February 12, 2014"}, {"Author": "Crazy about Coffee", "ReviewID": "RMGWN85SB3J76", "Overall": "5.0", "Content": "Fantastic next generation Kindle. So easy to watch TV and movies and read and listen to music and to explore the internet. It does everything I could want from a tablet. My Kindle Fire HDX is awesome. My absolute favorite gift to myself.", "Title": "great tablet", "Date": "February 12, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RDKBO7DZLQX3I", "Overall": "5.0", "Content": "After purchasing the kindle Fire I I did not buy any of the upgrades because I was waiting  for one with a camera.I knew it was  onlya matter of time.and i was patient. So glad that I waited.Can't imagine what could be added now to make it betterI got one of the first  HDX models. pre ordered in Oct . and took delivery in Nov as soon as it was released. Couldn't be more pleased.Have had it a little over 3 mo. now and no problems at all . Love It!", "Title": "Everything and more than I wanted.", "Date": "February 12, 2014"}, {"Author": "Mike Hammer", "ReviewID": "R4C3639TUZ2PS", "Overall": "5.0", "Content": "I had a Kindle reader, upgraded to a Kindle Fire HD 7 and now to the Kindle Fire HDX 8.9, I wanted it for the rear camera and larger screen. Have enjoyed it very much so far, but so far the way it stores and handles pictures is not what I would like. Wife's I Pad Mini has a camera roll and is very simple to put pictures in albums to keep events separate. Otherwise I love it and as I have not had it long I may find that it does have something like albums for the pictures.", "Title": "Everything I expected", "Date": "February 12, 2014"}, {"Author": "charles van hessen", "ReviewID": "R2FAEI37WYYT3Y", "Overall": "4.0", "Content": "Very smooth running tablet. If any problem comes up just turn off and back on fixes any issues. Real simple,silk works well if glitches just close recent searches. Great for games,paying bills online,air printer is supported thru apps. Does everything I would expect. Real nice to read books on all in all very pleased.", "Title": "very nice tablet great picture", "Date": "February 12, 2014"}, {"Author": "Lib", "ReviewID": "R1ZT8FUV2J8FPI", "Overall": "5.0", "Content": "I've been wanting a fire for over a year and this year I bought one and I even treated myself to the 8.9.  So far so good, I like it and would recommend it to anyone.", "Title": "Kindle Fire HDX", "Date": "February 12, 2014"}, {"Author": "Raymond B. Rice", "ReviewID": "R3T6MGBHXP3KWV", "Overall": "4.0", "Content": "It has just about taken the place of my PC, there are a few things I can't do with it, but otherwise it has been fun to have.", "Title": "Enjoyed using Kindle", "Date": "February 8, 2014"}, {"Author": "AL", "ReviewID": "R2GM42SD6WA2LP", "Overall": "5.0", "Content": "very pleased with the unit. As with anything new there is a learning curve however the mayday button works as advertised. And without an internet conection help was just a phone call away. I got the Kindle for Christmas and my wife got a Dell tablet. The Dell support was from India and they were very nice however each call for help took from 1/2 to 1 1/2 hours. I had a particular downloading problem with the Kindle. We got most of it cleared right away however there was a small lingering point. I tech did some research and called me back the next day. Not only that but he called back a week later to make sure everything was OK. I wish my doctor was as thoughtful.", "Title": "all I could ask for", "Date": "February 7, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3VDIMGLDEE49E", "Overall": "5.0", "Content": "My son loved this he was not expecting it and loves the bigger size and the color graphics are great.", "Title": "gift", "Date": "February 7, 2014"}, {"Author": "Logachelle", "ReviewID": "RMO83K2WNURR4", "Overall": "5.0", "Content": "What can I say it's awesome. I don't even use my lap top anymore especially with the Poetic keyboard case", "Title": "loving it", "Date": "February 7, 2014"}, {"Author": "Rick&Carla Garduno", "ReviewID": "R1B7LNQ771S1J", "Overall": "5.0", "Content": "This is the first I have ever had a tablet, I'm still learning how to use it.  But  the HD screen is so remarkable to watch movies.  I recommend this table.", "Title": "1st time tablet.", "Date": "February 6, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R20WT3I76027JD", "Overall": "5.0", "Content": "I love this kindle. Pictures are so clear. The only thing I think could use improvement is the speed of the videos. It lags behind when playing.", "Title": "my opinion", "Date": "February 6, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R12FY79NOW482W", "Overall": "5.0", "Content": "I am sitting on my couch writing this review on my kindle fire HDX 8.9\". It has not been very far from my hand since I got it. I am not a technical person but have easily been able to purchase and read books, watched movies, downloaded apps, taken pictures and sent them to Facebook along with many other things with ease. The few things I was unsure of, like downloading a gift card, I access the May day button and someone is on my screen immediately to help.I can't say enough about this product. My 11 year old grandson has the kindle fire and told me this couldn't be any better but everyday after school he asks if I brought mine with me in the car so he can use it and a couple times he's called Mayday  himself. Everyone should buy one of these!!!!", "Title": "love,love,love it!", "Date": "February 3, 2014"}, {"Author": "E. Mitchell", "ReviewID": "R3SQHYKF362U1F", "Overall": "5.0", "Content": "easy to get started with .  I have the Paper White so most of my usage of the Fire HDX is for things relating to the internet and am still finding the ins and out of all that it is capable of doing.", "Title": "great buy", "Date": "February 3, 2014"}, {"Author": "Frank J Vaselewski", "ReviewID": "R1QMH076O5R1ZQ", "Overall": "5.0", "Content": "Had the original kindle this is my first tablet, my wife and daughter have the Ipad.  I think the kindle is every bit as good and maybe better in lots of ways.", "Title": "Love it", "Date": "February 3, 2014"}, {"Author": "cole", "ReviewID": "R3AM6P3FNGJ16P", "Overall": "5.0", "Content": "The Kindle Fire HDX 8.9 is very versatile. It is small enough to carry anywhere yet performs like a larger device.", "Title": "Good product", "Date": "February 1, 2014"}, {"Author": "Jensen Nguyen", "ReviewID": "R3KATIMWYON4M5", "Overall": "5.0", "Content": "I absolutely love this device because it costs a fortune to get this so I hope it will not come with any problems later on. I would recommend buying this.", "Title": "Latest kindle", "Date": "January 31, 2014"}, {"Author": "Bruce \"IT guy\"", "ReviewID": "R3H20BBQYGTD9D", "Overall": "3.0", "Content": "I have waited many years to buy a kindle and I finally made the decision and got one. I am disappointed in that there is no app or way to watch Netflix with the kindle fire hdx 8.9.", "Title": "netflix", "Date": "January 31, 2014"}, {"Author": "maggie k", "ReviewID": "R1OUVA84LNV16B", "Overall": "5.0", "Content": "This is my third kindle. I absolutely don't know what I would do.without it. Super quality.Clear visuals and a wonderful investment.", "Title": "I love my kindle HDX.", "Date": "January 31, 2014"}, {"Author": "Theresa M. Matowitz", "ReviewID": "R1Z18D32P3V1IN", "Overall": "5.0", "Content": "Love the graphics and speed on this light weight tablet. Perfect gift for anyone in your household.  I have to hide it away from my kids and husband.", "Title": "Love it!", "Date": "January 31, 2014"}, {"Author": "Mary S. Joplin", "ReviewID": "R205RB2A2FBN78", "Overall": "5.0", "Content": "I love everything about my Kindle Fire HDX 8.9, it is everything I had hoped it would be.It is easily understood and easy to access everything.", "Title": "I am in love", "Date": "January 31, 2014"}, {"Author": "Gary Tilt", "ReviewID": "R3A6HFGIZZLKUD", "Overall": "5.0", "Content": "Gave to my wife as a Christmas gift to replace her iPad.  She's thrilled so I am too. It says I have to add two more words so here are 13.", "Title": "Gift", "Date": "January 31, 2014"}, {"Author": "s edwards", "ReviewID": "R6ALJ6RJ56XQE", "Overall": "5.0", "Content": "Even though I loved the kindle hd, there has been a significant amount of improvements made to the kindle hdx. The adding of the backward camera wa the greatest improvement that I enjoy.", "Title": "Kindle Hdx 8.9", "Date": "January 31, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1ODKMBW74G2NA", "Overall": "5.0", "Content": "Easy to use, very readable in all lighting.  Love the Mayday.  Great improvement over the Fire.  The addition of Collections is a great tool.  Knowing which books I have read (when memory fails) is a great tool.  I am a person who like order and the \"collection\" part serves me well.", "Title": "Super reader", "Date": "January 31, 2014"}, {"Author": "S. Handel", "ReviewID": "RNYR92ERW2DM6", "Overall": "5.0", "Content": "I am so much more than pleased with my HDX!! I had contemplated getting an iPad but I am so glad I looked at the reviews and the comparison . I had no trouble transferring all my stuff from my original Fire. The only thing lacking is the ability to use Flashplayer. Otherwise I am 1000% happy, happy, happy!!!", "Title": "Love, love, love my kindle!!", "Date": "January 31, 2014"}, {"Author": "William Sample", "ReviewID": "R3C07MHJ2CNE9Q", "Overall": "5.0", "Content": "Fire has a fantastic display. Battery life is OK about 3 days with normal use. App store has most of the ones your Android phone would have. Seems to be as useful as IPad at cheaper price. Only negative is no GPS.", "Title": "Great tablet", "Date": "January 31, 2014"}, {"Author": "Shoe lover", "ReviewID": "R214NR289ODP96", "Overall": "5.0", "Content": "They took away the micro HDMI port on the new HDX!! It's a pain that I have NO WAY to hook my Kindle up to my TV to watch Netflix or shows on Amazon Prime.. luckily my daughter has a Fire HD that still has the port, but I have to fight to get it away from her to watch something... BAD idea to take the micro HDMI port away!! Even if they put it back on the next generation it doesn't do me any good!!! :-(", "Title": "LOVE it, BUT....", "Date": "January 31, 2014"}, {"Author": "Jean McCOmb", "ReviewID": "R2KI5LRQXPHHEP", "Overall": "5.0", "Content": "I love my Kindle! I recommended this tablet to a friend who is not computer savvy . She was skeptical to buy this tablet. I told her how easy this tablet was to use right out of the box. How brilliant the colors were and how easy it was to get apps and shop at her favorite online stores. She bought the tablet and called me raving about this tablet! She even uses the built in camera for taking photos. I love the fact that this tablet is light weight. I like this tablet even more than my iPad. I have both the 7 inch tablet which I use for late night surfing in bed and the 8.9 Kindle. So if you are in the market for a great tablet don't hesitate to get the Kindle HDX, you won't be disappointed.", "Title": "Easy to use!", "Date": "January 31, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R396FB8ZCO4WQ7", "Overall": "5.0", "Content": "Although I haven't used all the features yet, like movie streaming or watching my favorite tv shows, I give the Kindle Fire an excellent rating.  I also own an android tablet and between the 2 - I'll take the Kindle every time.  Picture quality is great and the speakers on the Kindle are better than the ones on the tablet.  I had the smaller Kindle Fire, which I also loved.  I \"traded up\" so I could have a bigger screen.  The battery life is very good.  I only have to recharge every 3 days or so, the tablet - every day.  Yet, I use the Kindle more often.  When I bought my original Kindle Fire, I also bought one for my son (who is an Apple user) and he loves it.  I recommend the Kindle Fire (smaller and larger screen) to everyone in the market for a quality tablet.", "Title": "Kindle Fire", "Date": "January 31, 2014"}, {"Author": "Esther Neumann", "ReviewID": "R2BAJA6YTQT9RP", "Overall": "5.0", "Content": "I absolutely love  my Kindle Fire HDX! I use it every single day. I have owned other tablets in the past, and this is by far my favorite.", "Title": "I love it!", "Date": "January 31, 2014"}, {"Author": "Doris J. Hall", "ReviewID": "R2MLGMF8NGN3LS", "Overall": "5.0", "Content": "I already had a Kindle 7 and loved it.  SO easy to use.  My husband now is using my old one.", "Title": "my second!", "Date": "January 31, 2014"}, {"Author": "R. MCCAUGHEY", "ReviewID": "RFLZY474EHLPJ", "Overall": "5.0", "Content": "I am a great fan of Kindles in general. I love my little one and wanted an upgrade as well so Icould take pictures and Skype with my grandboy. This Kindle is perfect size and perfect weightfor me.  An awesome device!", "Title": "Awesome!", "Date": "January 31, 2014"}, {"Author": "Rachel Simon", "ReviewID": "R3PP2O3N9YTEHW", "Overall": "5.0", "Content": "Love all the Kindle products and very happy with the latest addition!Super easy to use and set up. Would recommend to anyone", "Title": "Like it more than my IPad!", "Date": "January 31, 2014"}, {"Author": "DAVID PEEL", "ReviewID": "R2MHEEXTI17UKR", "Overall": "5.0", "Content": "the resolution and processing speed are outstanding. the price when compares to the apple tablets are a great value. purchased the kindle hd fire 6mos ago, gave it to my daughter, liked the product so much I purchased the hdx for myself.", "Title": "dave, hazleton, pa.", "Date": "January 31, 2014"}, {"Author": "martha cox", "ReviewID": "R3HEY8ABCJRNY8", "Overall": "5.0", "Content": "It is lightweight, easy to use!  I can read, take pictures, surf the net and play games.  Fits easily into my purse.", "Title": "I love it!", "Date": "January 31, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00CLH6DSI", "Features": null, "ImgURL": null, "Name": null}}