{"Reviews": [{"Author": "Frederick J. Yaklin III", "ReviewID": "RQK5DTKO9G209", "Overall": "5.0", "Content": "I'm starting writing smartphone apps and needed a device to test apps on.  This tablet is great.  I couldn't believe the price on this was so low, I was worried it wouldn't last.  I have not had any issues with it yet and use it pretty much all day long.", "Title": "Great Product", "Date": "October 25, 2013"}, {"Author": "Oscar", "ReviewID": "RRH57BEXDFTGJ", "Overall": "4.0", "Content": "If you are a harcore geek, gamer and so on, this is not the tablet for you. If you need it to watch videos, read, check on social websites and others, the item is perfect.Pros:- The price of course.- Design looks much more expensive and it seems to be good quality, even the box and package look pretty.- Touch is very responsive and has 5 finger capabilities.- Carries the Google Play Store.- Expandable memory, HDMI, native USB port, external speakers for only $70.- Has the latest Android OS version.Cons:- Battery life is too short.- The screen brightness and resolution is not as crisp as other tablets, but nothing painful, it looks OK (I just made a comparison with my Toshiba tablet that has LED screen).I purchased two units for my mom and girlfriend. If you are looking for a gift for someone who's not that tech savvy go for it! lol...", "Title": "Good for the price", "Date": "December 14, 2013"}, {"Author": "FengWei", "ReviewID": "R1AOTLHAJG1L9P", "Overall": "5.0", "Content": "I must say that this cute little tablet exceeds my expectation, big time.Plannd to order two for the kids' Christmas surprise, finally put 3 in the shopping cart as the price is irresistable, thinking that it might be a good option for heavy duty purpose so I won’t have toPros:- Great size, compact and sleek, you can easily handle it with just one hand.- Dual core processor, won’t say it super fast, but it did perform as expected, it can load and run apps pretty well, but don’t try the big 3D game, you will be disappointed, but for what it worth, it still a great tablet.- Clarity of the screen is good- HDMI and standard USB output- Last but not least, two thumbs up for the priceCons:- Hard drive is pretty small, claimed to be 4G but actually slightly over 3G, guess the system takes up some of it. Suggest external expansion if you are a heavy app user;- Sound quality is just OK, for gaming, don’t expect more than that.In short, great value android tablet, best gift for kids.", "Title": "Best value android tablet", "Date": "November 18, 2013"}, {"Author": "RODOLFO FERNANDEZ", "ReviewID": "R1KLBB8K875PKS", "Overall": "5.0", "Content": "So far it has been performed perfectly. I installed a class 10,  8 Gb micro-sd and downloaded several usefull appls and everything works fine.", "Title": "It worked as I expected.", "Date": "March 8, 2014"}, {"Author": "Chad \"\"Programming is an art form that fi...", "ReviewID": "R3OOD1CLXGYUQ7", "Overall": "5.0", "Content": "A little slow but for the money and comparable options its pretty good.We order a lot of tablets and this one has the infamous flimsy charging port that many have. Make sure you plug it in straight and pull it out straight and don't tug on it hard though and you'll be fine. But if you don't take care, these types of charging ports break easy. BUT they also DO charge off the USB, so even if the charging pin breaks, you can buy a cheap USB charger for a few dollars or charge from a computer.Over all good value for the money. So if you don't want to spend a lot of money, this is the tablet to get.", "Title": "Nice for the money", "Date": "January 28, 2014"}, {"Author": "charles", "ReviewID": "RFILJUKB24FV8", "Overall": "1.0", "Content": "I usually do not write reviews but this tablet got me super disappointed. when I first got it everything worked perfect for being such a affordable tablet. It ran fine until a couple months after I ordered it, until it stopped charging. I cleaned the charger and the where it plugs into the tablet, but no luck, I tried to return it but it said the return option had expired. I did not drop it or spill anything on it, I babied the thing and it still broke, talk about being cheap, I would not recommend this product to anyone if I could return it and get my money back I would, plus the manual didnt even have a number for me to call to talk to someone, I personally think the company is awful for doing this. If your looking for a tablet go buy a samsung", "Title": "Review", "Date": "April 18, 2014"}, {"Author": "Fay", "ReviewID": "R323X5UQROHR33", "Overall": "5.0", "Content": "Ordered several tablets from this seller for Thansk Giving, turn out to be a good surprise.I should say that they performed as expected, nothing more, nothing less. Web browsing, watching video on YouTube, running little app game, no problem at all, wifi signal sometimes weak, guess it has to go thru a few walls, make sure you stay close to wifi router when you try to watch online video.Anyway, can't complain about the price.Good buy, highly recommend!", "Title": "Cool product", "Date": "December 10, 2013"}, {"Author": "Sylvia Livingston", "ReviewID": "RC72BTXIPIJC7", "Overall": "5.0", "Content": "Didn't expect more from a tablet that worth only 60 USD, but was stunned by the performance. Bought 2 white for the kids and 1 black for my self.Pros:- Great clarity touch screen, vibrant and responsive- Dual core, apps runs pretty smooth- Compact size, robust, best gift for kid or for out door purposeCons:- Internal Storage is low, like 3G, I am buying an expansion TF card- Battery life is just OK, like 3-4 hours top approxOverall the quality is good, comparing with the price I paid, good!", "Title": "Great Tablet", "Date": "December 2, 2013"}, {"Author": "christopher velez", "ReviewID": "RHEERI2GHSCWP", "Overall": "5.0", "Content": "Exceeds my expectations and I'm a heavy user. A great product for such a low price. Highly recommend for people looking to save money and still want good quality.", "Title": "Great Tablet", "Date": "February 21, 2014"}, {"Author": "Niko", "ReviewID": "RF9MMUR4CEOWB", "Overall": "4.0", "Content": "been using this tablet for college, it is no multi tasker, but is great for taking notes, and reading text books. It operates netflix good, however it can not operate large apps simultaneously. It is cheap, but it is great for college go-ers. only thing I have about this tablet that is, to use a USB key bourd with it, you need a micro usb to usb adapter. the keyboard I use is: http://www.amazon.com/gp/product/B00DTGGBSW/ref=oh_details_o03_s00_i00?ie=UTF8&psc;=1 and the adapter you need is: http://www.amazon.com/gp/product/B00AXCRJV8/ref=oh_details_o02_s00_i00?ie=UTF8&psc;=1. this key board allows this tablet to be a perfect size notebook to carry around campus and into a mini laptop.", "Title": "Decent product for college", "Date": "February 4, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00CYKMBS8", "Features": null, "ImgURL": null, "Name": null}}