{"Reviews": [{"Title": "Inaccurate Product Description", "Author": "C. Greene \"Ratdog\"", "ReviewID": "R1IUIDDUKBMQY9", "Overall": "2.0", "Content": "The photos included in the Product Description (at the time I purchased) indicated it was the \"st2\" (with removable battery, HDMI port, micro USB charging port, etc.  The Product Description indicates this unit has a 64 GB hard drive.  What arrived at my door yesterday was the \"st2e\" model (NO removable battery, NO HDMI port, NO micro USB charging port, and only a 24 GB hard drive).During the set-up, I downloaded/installed the \"critical updates\" to bring it up to speed, and went to download the free upgrade to Win 8.1.  That's when I learn there isn't enough hard drive space left to store it (less than 3 GB)... let alone the ability to purchase/download Windows Office so that I can even use the tablet for my work.I'm awaiting reply from the vendor prior to passing judgment on the transaction, but I am NOT at all pleased with the \"surprise\" of it being the \"st2e\" that can't even support the software needed to use it.", "Date": "March 21, 2014"}, {"Title": "Great value", "Author": "Amazon Customer \"secondtimothy\"", "ReviewID": "R10Y92MJ3ZT80U", "Overall": "5.0", "Content": "This came in like new shape.  It works just as well as the one I bought new from Dell for over twice the price.  I may never buy another computer brand new when you can get a perfectly good refurbished at such a discount.", "Date": "March 25, 2014"}, {"Title": "Waste of Money.", "Author": "matt", "ReviewID": "RU171X7KS8UL7", "Overall": "2.0", "Content": "Absolute waste of money. That 32 gigabyte SSD? Consider that with all the bloatware, not to mention windows 8 itself, you end up with less than half of that, about 12 GB. Not nearly enough. It's got windows 8, which is nearly impossible to navigate and half-assed on both the using it as a computer and as a tablet fronts. The seller? They lead you to believe this thing has a wacom active digitizer on it, but this is the Dell Latitude 10 essentials, which does NOT come with a stylus and only has a PASSIVE digitizer, do not be fooled! If you come to this thing looking to use it as a cintiq, you'll be disappointed. A passive digitizer means that you can use only PASSIVE styluses (which are numbered few on this website) and that if you touch the screen at all, it will mess up your drawing/writing. You can't rest your hand on the screen, like you could with an active digitizer in the other models of this. Moreover, it's impossible to close or uninstall half of the useless \"apps\" it comes preinstalled with, making that 1.5 GHZ from the intel atom a whole lot slower, not that you could install very much to begin with.If you're going to get a dell latitude 10, get the FULL version, not this version, or shell out an extra 200 for the microsoft surface. You get way more for your money. At this rate I am going to sell it and instead buy an Android tablet or iPad, as it can run more apps, is more optimized in its OS, and the seller doesn't provide misinformation about what kind of digitizer the device has. If Microsoft wants to enter the Tablet/Smartphone market, I hope they don't intend to do it with windows 8, what an absolute trainwreck. I will make it two stars because the battery life is very good, but the rest of it? Pure feckus.", "Date": "November 4, 2013"}, {"Title": "ABSOLUTELY LOVE IT!", "Author": "Daphne Jech", "ReviewID": "R21WE6A1HCSJ4S", "Overall": "5.0", "Content": "This is the best little computer I have ever owned.  You can put programs like \"pokerstars.net\" and the \"Windows apps\" there is a speed game that two people can play or you can try and beat the computer and it keep up with you and the other player.  LOVE IT!  It is Window Apps not Apple.  but you can put other programs on it like I said.  I play 42-online.com and I can put that on there too.  LOVE IT!", "Date": "November 27, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CLHA9V0"}}