{"Reviews": [{"Author": "Wayne B.", "ReviewID": "RW1V27H98JWL5", "Overall": "5.0", "Content": "I was a long-time Apple fanboy until they stopped innovating over the past couple of years. I sold my iPad to a friend several months back, and decided after a while that I would like to have a tablet again. I started comparing the newer generation iPads to some Android devices, and this one got me hooked. The interface is both streamlined but customizable, and the hardware itself puts Apple to shame. You are paying a premium not for the Sony name (though I personally think that would be worth it) but for the high-performance hardware on this device. I use it regularly to watch 1080p movies while in flight, to stream Netflix, to read from the Kindle app, and to play games. Multitasking is a breeze, and the battery holds up well. I am so glad to have dumped Apple in favor of this. Also, my roommate just purchased an iPad Air, and the Xperia Z tablet is STILL thinner than that. Plus, it's water resistant.", "Title": "High-perfomer puts Apple to shame.", "Date": "November 23, 2013"}, {"Author": "SamTheMan", "ReviewID": "R39AOBX0RM86NS", "Overall": "5.0", "Content": "I also own a 64GB Ipad 4 (Retina Display) which is the latest model prior to IPAD Air. Comparing Video, Camera etc I have to say the Sony is much better. I bought the Sony for my daughter to be used in school as my IPAD is more expensive. However I like the Sony much better and I gave the IPAD to her. I have compared HD videos side by side and even though the IPAD technically has a higher resolution I found the Sony to be better. The new IPAD Air has the same display as mine so I am glad I didn't by the latest IPAD Air. The Sony is much thinner and very light wait (almost unbelievable). And it's water proof! Although I have not tried putting it under water! :-) . I would highly recommend the Sony to anyone. You won't be sorry!", "Title": "Best Tablet - Better than my IPAD Retina Display", "Date": "November 9, 2013"}, {"Author": "mark garrett", "ReviewID": "R13772FIPY8AKJ", "Overall": "5.0", "Content": "I recently purchased an iPad 4th Gen, and kept it about two weeks, I decided that the apple ecosystem wasn't for me. So after doing a tremendous amount of research on the current crop of Android tablets  I purchased the xperia. I am totally blown away by the quality, the feel  and the beauty of this design.It is light and sturdy,a joy to hold in either landscape or portrait, the screen is drop dead gorgeous, and even though the purists will quote less pixel density, there is something about the way the screen fits with the overall design that just makes it pop.The controls and response are spot on  and the little Sony extras are nice but not overbearing.This is the tablet to beat for 2013 , I am a believer!!!", "Title": "from ipad to sony", "Date": "October 3, 2013"}, {"Author": "Jack L. Fagan", "ReviewID": "R1HLC1B2I0T7SM", "Overall": "4.0", "Content": "First off, every time I pick up this tablet it blows my mind how light it is, and it doesn't feel cheap either.Pros: its super fast and sonys version of android works really wellColor reproduction is really nice and deep.IR blaster is really convientMicro SD slot is always a plusBattery is decent for the small size.Screen resolution is amazingIts waterproofConsNo gorilla glassThe covers for all the ports to make it waterproof are a little annoyingPrice is a little heftyBack takes fingerprints easilyOverall I really like this tablet.Speaker arenokay", "Title": "Great tablet, okay price", "Date": "September 22, 2013"}, {"Author": "Bryce Kost-Day", "ReviewID": "R3N52O3KH5KON3", "Overall": "5.0", "Content": "There have been a lot of great Android tablets lately but none quite convinced me to get rid of my iPad and commit to the Android ecosystem.  This tablet finally did it.  It is amazingly thing, thinner than my phone.  The Sony skin over Android is actually very nice and unlike TouchWiz does not immediately make me wish I had a stock Android interface.  The waterproof works, though I have to admit I have very little use for this feature.  The device is fast and responsive - I have yet to be able to stress it even with higher end 3D games.  The screen is beautiful and colors are vibrant.  One downside is it does take an overnight charging session to get the device back to 100%, but other than that minor complaint this is an amazing tablet.  Goodbye iOS!", "Title": "Finally a reason to get rid of my iPad", "Date": "July 22, 2013"}, {"Author": "Amazon Customer \"familyof5\"", "ReviewID": "R317F295TBRA9M", "Overall": "5.0", "Content": "My husband is a Sony addict, and so when the Z released he bought me one for my birthday. In a word: AH-MAZING. So light, so big, fast, reliable, and purrrrrty. I simply love it. It is far better than Sony's first tablet...which I also own. Well worth the money, and on a side note....the new docking station for the Z is a must.", "Title": "The Best There Is", "Date": "June 17, 2013"}, {"Author": "Yan Ying \"SNOW WHITE\"", "ReviewID": "R2E9VCI4YL0VG3", "Overall": "5.0", "Content": "I have purchased this tablet directly from SONY earlier in June. And it is simply, splendid.The good:Just as advertised, this tablet is VERY thin and yet the great build quality makes it feel nevertheless solid and durable. I have checked the waterproof ability and it seems to be pretty impressive. After staying 10 minutes under water(dare not to risk it for 30 min..), everything still works perfectlyOne reason I chose this Android tablet over iPad is its design. Having been a fan of SONY product for years, I always love how delicate and beautiful the SONY-style is, and this design style is undoubtedly adopted by Tablet Z. Call me superficial if you want, but the design of a product, AKA its aesthetic value, is really a big deal to me. Surely, I am not saying that iPad is ugly by any means; it is just a personal preference.This tablet runs on Android 4.1.2 and the user experience is overall satisfactory. Not as smooth as iOS, but it does nor lag very often. Its S4 Pro processor is relatively powerful but I will be happier if it is Snapdragon 800.The not so good:Speakers. Yes, I know how SONY brags about its speaker performance in the ads, but it turned out to be a little disappointing. The sound is totally not loud enough and its quality is not comparable to Note 10.1.Screen is okay but PPI needs to be higher. The display offered by tablet Z is not bad, but the relatively low PPI sometimes can make the pictures seem to be pixelated. I would definitely be more satisfied if it can reach retina level.=========================================ConclusionXperia Tablet Z by SONY is absolutely worth trying. And I personally think it does represent \"the best of SONY in a tablet.\" I am happy with this purchase.", "Title": "Nicely Designed Tablet！", "Date": "June 12, 2013"}, {"Author": "G Man \"Perspective is everything!\"", "ReviewID": "R168IYHFX3XSWI", "Overall": "5.0", "Content": "The Xperia Z from SONY is SONY at it's absolute best: MARKET LEADER.The only reason not to buy this, or the 32gb model, is to buy an iPad instead.If your going to buy an iPad, then you will.But, if you want a tablet SO THIN AND LIGHT that it feels like you are just holding a screen, get this!It has MicroSD and a headphone jack and micro USB. It's waterproof against splashes and POOLS for 30 minutes of full submersion.AMAZING. It has SONY's new Lithium Polymer battery. Lightweight and still gets this tablet to around 10 real full hours.This tablet doesn't quit like some other Android tablets.Unlike other new tablets, this is 1920x1200 resolution, better for reading than 1080p and handles full 1080p video right, not like some new 1280x800 GS3 Tablets.THIS is the ultimate tablet as a book reader too, because the color is calibrated and the white level is WHITE, not bluish. Black is black.See this for yourself before you even THINK of another tablet,phenomenal.", "Title": "Lightest and Sexiest tablet on the market", "Date": "August 5, 2013"}, {"Author": "Paul Vanegas Peña \"Ing. Paul F. Vanegas Peña\"", "ReviewID": "RS8LY10DS39FK", "Overall": "5.0", "Content": "This is my first tablet so perhaps my review is a bit bias but so far I am super satisfied with it. It has been 3 weeks of use and it is fast enough, with a bright screen descent sound. It is extremely light and thin and looks great!  So if you are willing to pay a premium price for an android Tablet this is the one for you...", "Title": "Incredible light and thin", "Date": "June 1, 2014"}, {"Author": "Josh", "ReviewID": "RB8MYLENX58WA", "Overall": "5.0", "Content": "I bought this to replace my ipad and I love this so much more. The only problem I see is the battery life not being the best I think it can be. Though it is usually always at my house it doesn't really matter to me. I recommend it.", "Title": "This is a very good tablet", "Date": "May 27, 2014"}, {"Author": "Shadowcatt77", "ReviewID": "R33UQ20UENZ97Z", "Overall": "5.0", "Content": "I've had this tablet for about 2 weeks now, and I'm very happy.Pros:*Fast Processing*User friendly operating system overlay that is very lightweight and does not slow down the interface*Perfect size - thin and light*Nice industrial design*Beautiful, bright screen - I can even see it while outside.  There is some glare, but if you can position it to avoid glare, you can see the screen just fine outside.*Waterproof - if you use this in the kitchen for a recipe book, you don't have to worry about getting stray liquids or other ingredients on it - or you can read in the bathtub without worrying about dropping it in the water!*Stereo Speakers - nice quality - not perfect, but for a tablet, they are better than most*MicroSD Card expansion*NFC*Media Server DLNA capability*Android upgrade to 4.3 in December 2013, and 4.4 down the road in 2014 have been confirmed by SonyCons:*Battery - this is probably my biggest gripe about this tablet.  With consistent heavy use, it will last about 6-7 hours depending on the activity.  It also doesn't charge very quickly.  I understand that this is a trade-off in order to get such a thin, light tablet.  For me, I'm OK with this, but for others who are more concerned with battery life over the size and weight, this may not be the best choice.*Screen is not made of \"Gorilla Glass\" or other similar glass.  It is a nice quality tempered glass, but to help with the strength, Sony has applied a shatterproof coating.  This coating is horrible with collecting fingerprints, and I'm also afraid that it may scratch over time.  I have gotten an ArmorShield screen protector for this reason.  I'm happy with it, but I wish it wasn't necessary.Summary:Other than a few minor complaints, this is a very solid tablet, and I'm extremely happy with my choice.*Also, I have seen some other reviews mentioning some Wi-Fi issues, but I have not experienced them myself.  I don't know if a recent OS upgrade (from 4.1 to 4.2) has fixed the problem, or if this is just an intermittent problem that only affects some users.", "Title": "Very happy with my choice", "Date": "December 2, 2013"}, {"Author": "mehrdad golchin", "ReviewID": "R1AFRQQO2LAU13", "Overall": "5.0", "Content": "Its very light weight, Thin and good looking! sleek,  powerfull, and complete. Its an excellant buy. I totally recomend it.", "Title": "The best tablet to date!", "Date": "November 25, 2013"}, {"Author": "RAMIRO GUMIEL", "ReviewID": "R3V73Z7GJV762R", "Overall": "5.0", "Content": "I bought this one for myself - initially - then recently gave it to my wife who wanted it. Then I bought an expensive iPad Air but I can tell you this tablet feels much better. Android devices give you a sense of freedom and natural touch compared to iOS-Apple devices.I wish I could return the iPad....but it's too late.", "Title": "It's a nice tablet - I really like it and recommend with an additional 64 GB UHS memory card", "Date": "November 23, 2013"}, {"Author": "Amazon Customer \"WoolTales\"", "ReviewID": "R2VKAPS7G5MTVL", "Overall": "5.0", "Content": "I love, love, LOVE my Xperia Table Z.  It's fast, intuitive, and light.  I added a 64GB micro SD and have 80GB of storage.  That's what I had on my last desktop.  Other than the case and screen protector, I didn't need to buy any other accessories.  The true test of a product is how often one uses it and I use mine every day.", "Title": "Of course, it's great.  It's a SONY!", "Date": "July 20, 2013"}, {"Author": "yezakura", "ReviewID": "R1YYWB72ZKLK4X", "Overall": "5.0", "Content": "I have no complaints man this tablet is worth it i submerged this in water and is still able to use it if your looking to buy i suggest it its worth it its thin waterproof and it runs android 4.1 right now the sound qaulity is not the best or loudest but the display is amazing just like sony tvs this is personal buddy i use it for home and business it does the job beautifully", "Title": "It is perfect", "Date": "June 25, 2013"}, {"Author": "Kendra Trahan", "ReviewID": "R34GDCF16EEY9O", "Overall": "5.0", "Content": "This tablet is awesome. I'm not taking the chance on testing out whether or not it really is waterproof, but I believe PC mag when they say they submerged it and it was still playing a video fine and unaffected. But I've had it for about a month so far. If things change, I'll change my review.It is super fast and clear and I have no complaints except one. Sometimes when my apps update, they will no longer work. I try to open them and they just force close immediately. I don't have that much stuff on it yet so this gets annoying and sometimes restarting the tablet will fix the problem but in one case I had to uninstall and reinstall so I lost my progress in that game. However, its not so bad that I would deduct a star. I just love this thing.The speakers are cleverly positioned in the bottom corners so you can kind of cup them easily with you hands or cover them while still holding the tablet comfortable. It automatically connects to my PS3 and other PS3s whenever linking to YouTube. Usually there is a code you have to enter but I guess since its Sony its easier to connect to another Sony.", "Title": "I love this thing!", "Date": "June 10, 2014"}, {"Author": "April C. Craig \"acerrel\"", "ReviewID": "R3HMME5AL1EMR2", "Overall": "5.0", "Content": "My husband prefers sony products. He enjoys being able to link his tablet to most of our sony products (TV sterio ps3 ect.).", "Title": "Great tablet", "Date": "June 3, 2014"}, {"Author": "Ionut Epure", "ReviewID": "R3KK0GTA86TFDX", "Overall": "4.0", "Content": "I love all about it except for the fact that the speakers are on the sides and in the corner. when holding it in your hands you can easily cover the speakers. good things: sleek, thin, simple, water and dust proof, etc.", "Title": "great tablet", "Date": "May 11, 2014"}, {"Author": "FlaSteve", "ReviewID": "R3LTQ1KMN3RHO2", "Overall": "5.0", "Content": "This tablet is the bestest toy a big boy could ever want! Its expensive yeah, and its all nice watching the videos about it, but when this sucker shows up at your door and you rip into it like Christmas, omg! Wait til you hold it in your hands and the vivid colorful screen hypnotizes you, then you'll see just why this XPERIA is the bomb. Im so glad i chose the Xperia rather than another tablet. The 4 speakers are crazy good sound, not alot of bass though, but still will thrill ya. I still havent put it in any water cause it just doesnt feel natural, lol, but i'll just take Sony's word on it. If you need too, just save up your money and get this tablet! I promise you wont be disappointed! I'm using this baby right now! Go buy it already!  :)", "Title": "BESTEST BIG BOY TOY EVEEEER !!!", "Date": "April 25, 2014"}, {"Author": "KOKO LAY", "ReviewID": "R1AFT8LZCSX313", "Overall": "5.0", "Content": "Highly Recommended . A+. Look forward buying from him again. Thanks so much for . I would give A+ and Excellent!", "Title": "A+", "Date": "April 19, 2014"}, {"Author": "Tofu", "ReviewID": "R3G9LYP4BRRD6P", "Overall": "5.0", "Content": "I wanted to upgrade from the Sony Xperia S so I got the this (had it for about a month). It does great showing movies with real nice picture quality and its fast. I also use it to study math and vocabulary a whole lot too. The Sony Xperia S lasted me so far a couple of years and I really used the heck out of it. It still works great so I have the same expectations on the Sony Xperia Z tablet.", "Title": "Sony Xperia Z Tablet", "Date": "April 18, 2014"}, {"Author": "Chris Trejo", "ReviewID": "R1ZIQMKOFS5XOO", "Overall": "5.0", "Content": "This thing never leaves my side, I use it for school to have my reading books with me wherever I go, I play games on it and use it to watch movies when I'm on the bus, it's so light weight and thin it's almost like I'm holding a small magazine, I love it and highly recommend it for anyone looking for a high end tablet that doesn't want an ipad.", "Title": "Amazing Tablet", "Date": "April 15, 2014"}, {"Author": "MWinSD", "ReviewID": "R1VJVDJ4FYME2V", "Overall": "5.0", "Content": "This is the best tablet that I've owned. It's amazing how thin this thing is, yet it feels like it has a very solid construction. I'm not at all worried about breaking it. It's very fast. I haven't yet seen a game or app in the few months that I've had it that has caused it to lag or show signs that the performance may be lacking. The screen is really sharp, and the colors are bright.My 15\" laptop is about 3 years old now and doesn't really allow for ease of use in multiple locations (kitchen, living room, bedroom). The battery is starting to age as well, so it's not a great option for longer travel or flights. I wanted to get a tablet that could provide media streaming and web browsing in a more portable form factor. What I found was that the Tablet Z has almost completely replaced my laptop with the exception of 1 or 2 functions...basically just iTunes for my old iPod video and PC gaming.For me, Sony's reputation for making solid products that are worth the price has fallen quite a bit in recent years. But for the money, I think that the Tablet Z has really delivered in terms of performance and quality. If you're in the market for an Android tablet, I don't think it gets much better than this.Pros:- Fast- 16GB of storage is more than enough- Great image/video quality- Thin and light, yet feels durable- Battery life is exactly what I needCons:- Remote control functionality really doesn't get used- It takes a while to fully charge the battery- Not a fan of port covers, but that's why it's waterproof- Speakers are placed on the sides, meaning that you need to cup your hands on the bottom edges in landscape mode to really hear anything", "Title": "A really solid Android Tablet", "Date": "April 8, 2014"}, {"Author": "GORDON R CARTER", "ReviewID": "R1CJ5B283JKZC3", "Overall": "4.0", "Content": "Very good & nice & light & don't have to worry about water, dust etc. watching movies & music nice & crisp", "Title": "Wonderful", "Date": "April 6, 2014"}, {"Author": "elizabeth", "ReviewID": "RR6ZFDXMQ5X94", "Overall": "5.0", "Content": "LOVE IT, its a great tablet will recommend to everyone.  It does everything they say it does. Extremely happy with it.", "Title": "Great tablet", "Date": "April 2, 2014"}, {"Author": "Ghost", "ReviewID": "RF9DNZJD4ULSZ", "Overall": "5.0", "Content": "This tablet has exceeded all my expectations. We work outside and bought it for its waterproof features. It has worked flawlessly out of the box. After reading some reviews, I was worried about the camera because we have to document with photos all that we do. This thing takes incredible photos. I found if you just frame the subject and give it a second to adjust, the pictures are as good as our hand held Sony camera. It is fast, lightweight and has been simply great. Battery life is good and my phone charger in the car backs up the charge when I need it. I highly recommend this tablet.", "Title": "Simply Awesome", "Date": "March 27, 2014"}, {"Author": "Galo", "ReviewID": "R2EOQ46VJY008G", "Overall": "5.0", "Content": "The Xperia Z is all they said about it; The incredible hard glass display, the waterproof resistant, the light weight, the fast response, the last long life of the battery (it give me around 8 hours with the save mode)... well, I bought it for my kid and we both enjoy great and/or productive time (it depends if we are playing or I am working) with our Xperia Z. Don't hesitate to buy it.", "Title": "What a beautiful, strong and fast device", "Date": "March 9, 2014"}, {"Author": "Rodney S.", "ReviewID": "R1R487LC8OLVAT", "Overall": "4.0", "Content": "Bought this as a gift for my grown son who had found himself without any sort of computer or smart phone for a while and needed something to browse and do online research. He really likes it and is still using it as his primary online device.", "Title": "Bought as a gift", "Date": "February 23, 2014"}, {"Author": "sarah", "ReviewID": "RLSTT3ZKP9YGM", "Overall": "5.0", "Content": "So I've had this tablet for about a week now. I kept telling myself I wouldn't write a review for at least a few months to see if its going to be as good as it should be. I had another Sony S tablet however the charger pooped out on it and I didn't feel like paying 117dollars for just the charger. So I went tablet shoping, was going to say under 100 dollars but I was just so indecisive I couldnt find one, I wasnt pleased with any of them so with taxes coming back I said F it I never buy myself anything. I've known sony with tablets and tvs and decided to search aa little. I came across this tablet and for whatttt ever reason fell in love with it!! I read  rreviews and watched youtube videos  on it. I loved everything about it! Being thhat I live iin Hastingss, NE there wasn't anywhere to go and look at it and get a feel for  it. So i took the chance andd bought it off of Amazon mainly bc it was the cheapest. I had to contact the seller bc it diddnt ship when  it was suppose to and  being that I spent $425.00 on it I expect it to ship on timeee. but after I contacted them they shipped it right away! So I was thannkful foor thhat. it arrived when it said it would and I love it!! everything is beautiful it even has a swipe keyboard llike on phones which iss a HUGE plus to  me!! this tablet is perfect I love everything abouttttt it and if I had to doo it all over again I wouldnt hesitate to  buy it again without  a doubtt hands down perfect android tablet!!Thank you!", "Title": "AMAZING!!", "Date": "February 21, 2014"}, {"Author": "FlashMan81", "ReviewID": "R1C86P1S666JWT", "Overall": "5.0", "Content": "This is a really nice tablet, and the waterproof quality is both rare and very useful; as you don't have to worry about something getting spilled on it. It's great for listening to music and has good volume and sound quality. It's also fast for surfing the web and has good visual quality. I bought it to replace a netbook, and I didn't think about it having a mobile format. I prefer the PC format on my netbook, and decided that this was too expensive an item to keep if I couldn't get good use out of it for the reason I bought it. It also is more difficult to type on than my netbook, so it wasn't really practical for me to keep it. But if you're not so concerned with the typing aspect, and don't mind the mobile format, it's a great tablet to have. I do believe it is a bit overpriced for the sake of the Sony name however.", "Title": "Very NIce", "Date": "February 12, 2014"}, {"Author": "A. PATEL", "ReviewID": "R2J5AQI92L68XW", "Overall": "5.0", "Content": "After a long and exhaustive research, I decided to go for Xperia Z tablet (rather than Google Nexus 10 inch or the Kindle HDX 8.9 inch). I was looking more for an e-book reader and to some extent, a tablet which can play movies and music... but this tablet works very well as an ebook reader (you have to have a good reader app) and obviously, it does a marvelous job in playing movies and music.", "Title": "An excellent tablet..!!", "Date": "February 9, 2014"}, {"Author": "Skibabette", "ReviewID": "RF5FHDYT45SHH", "Overall": "4.0", "Content": "It's so light and thin and mostly works like it's supposed to. I've had issues with it dropping wifi but I've also been having issues with my internet service so I'm not sure which one is causing the issue. The wifi strength increased dramatically with my new router so I'm pretty happy. Speakers are not bad for such a thin device. Overall, I don't regret my decision to buy this tablet.", "Title": "Nice tablet", "Date": "February 6, 2014"}, {"Author": "Pablo Kao", "ReviewID": "R23VBZ3B7M7886", "Overall": "5.0", "Content": "Laying down and reading in bed using the tablet is no problem. The device is so light and easy to carry around. I put a screen protector just in case but i found that you don't need it at all (only if u care about inevitable finger prints).", "Title": "I love it", "Date": "January 2, 2014"}, {"Author": "Z. Barnett", "ReviewID": "RASCGE436S8BR", "Overall": "5.0", "Content": "My wife got me this tablet for Christmas and I have to say, it's impressive.  The look and feel of the tablet is amazing.  It's incredibly thin and light, but it also feels solid.  I already ran it under the tap, just for the hell of it.  No issue with water.  I also used it as a remote--going to buy a remote app, but the IR blaster seems to work fine.I cast a video to the TV using cromecast--worked great.Played a free car racing game--graphics are kick ass.Did a bit of reading with the kindle app--battery seems to last forever.My only criticism is that it comes with a bit too much firm wear for my taste... but otherwise, absolutely love it.", "Title": "The coolest piece of tech I've seen in a long time...", "Date": "December 25, 2013"}, {"Author": "'Ponmile Olojede", "ReviewID": "R2PAJ6UZY6A2UC", "Overall": "5.0", "Content": "There's nothing to say about this tablet that has not been said. After reading so many reviews online, I finally bought it, and I don't regret it at all!", "Title": "loving it", "Date": "December 23, 2013"}, {"Author": "NN", "ReviewID": "R2C83JVMDPGXWX", "Overall": "5.0", "Content": "As a Sony fan I did my research before purchasing my first tablet and from the reviews all over the web the Sony Xperia Tablet Z got good marks ranking it on par with Apple.  The tablet is quick and has a great screen resolution.  For a first time tablet user it was very intuitive and very easy to be up and running.  Love the fact is accommodates a Mirco SD Card, great for storing downloads and not using up all the internal memory.  If you're in the market for a tablet this is the one to buy.", "Title": "Its a Sony What else can I say?", "Date": "December 23, 2013"}, {"Author": "Wayne \"deltonawb\"", "ReviewID": "R1PUU70MPGAC7C", "Overall": "3.0", "Content": "The Xperia Z is definately a gorgeous tablet. The build material is the best on the market. Thin, light and solid. Water proof is a plus. At first, it seemed to perform flawlessly. My first reaction was it will be a keeper. Even at the high price.However, after using it for some time, some deal breaking flaws starting to show themselves.First, the tablet seems to have a wifi issue. The included android email program could not stay connected to servers. Anytime I attempted to read an email, I would get the can't connect to server messge. Sometimes I could manage reading 1 email. Then when I click on the next one, I would get the message. If I closed the program and tried again, sometimes I could read the next message. Not being able to read emails is a huge problem.Next, this tablet had a battery issue. In reading all the reviews, both here on Amazon, and on the internet, I could not find any bad reviews about the battery.  So this leaves me to belive it was just  my unit. With just the wifi on, (bluetooth and GPS turned off) surfing or watching a video or playing a 'not so intensive' game, the battery would last maybe 4 hours. And even with the charger plugged in, the battery level still dropped while using it.Then for the last problem, while using the tablet with the charger plugged in, the screen would randomly start acting irractic. When touching the screen, it would flash or apps would suddenly start opening like someone was touching these apps all at the same time. Unplugging the charger would stop this behavior.I guess I could have lived with the odd behavior of the screen and bad battery life if the price of the unit was not so high. But the constant email issue was a definate deal breaker. So I reluctantly decided to return it.Had none of these issues been present, I would gladly had given this 5 stars. Any other tablet would get 1 star based on these issues. But the physical quality alone of this tablet deserves a better rating.I probably will try this tablet again in the near future after following more reviews to see if my problems were isolated.", "Title": "I had high hopes for this tablet.", "Date": "August 15, 2013"}, {"Author": "Larry Lee", "ReviewID": "R3VIYXOMTZK3R0", "Overall": "5.0", "Content": "The tablet was in pristine condition. The box was like new, and everything was included as posted. I will be using it as a big screen controller with my new Sony a7r camera. I am very pleased with this purchase. If I had to knock it for anything, it would be the very shinny screen surface. I may have to find a non reflective screen protector, when I use it in the field.", "Title": "Even better then I had expected!", "Date": "March 14, 2014"}, {"Author": "Gail Pace \"Ronnie\"", "ReviewID": "R35JFIPBB5XY0R", "Overall": "3.0", "Content": "While I cannot complain about the usability and performance of this tablet, the 2 major gripes that I have with it is its power consumption and taking forever to charge. This tablet is as good a performer is any tablet in the market hands down. I don't have problems with it freezing up while playing games or watching videos. It works awesome with my Bluetooth keyboard, which I purchased separately for $12 and I am able to type long documents in the purchased version of Office. So, my productivity is exactly what I wanted and what I expected.The problem with this tablet is that it consumes so much power that the OEM charger cannot keep up with it. This is a design flaw that Sony is very aware of (see their support forums), unfortunately, nobody is addressing it.  Honestly, they tend to make it the user's fault or incompetence. I have found that purchasing a high-end 2 amp charger helps a great deal, but not always. This thing is a power hog. Additionally, Sony says that it takes 5 hours from complete discharge to full charge. It has been my experience to be as much a 7 or 8 using the OEM charger, especially if left on standby. It does charge a little faster with the power off.I strongly recommend to anyone purchasing this tablet, to buy several OEM cords, because the micro USB connectors do not hold up very well and seem to fail quite often. I have had this unit for 4 months and I have gone through 4 USB cables. I don't move this around and I typically lay it on my desk or on my nightstand at home so it is not like it is going through abuse with the court attached. I will say that I have dropped this unit a couple occasions and it has been very durable without scratches, nick's or cuts to the screen. While never dropped \"hard,\" it still scared me, but it worked just fine without any problems so I think I can say it is a very durable unit as well.With all that being said, I would love to give this tablet 5 stars because it deserves it BUT, the charging issues and power drainage leave me not trusting it away from a wall socket for very long. For instance, on a daylong trip in a couple of airplanes, you are going to have 3 to 4 hours of use. 2 to 3 hours, if you are watching videos. When you get off the plane, you have to find a power outlet, and if the power has drained significantly, if you want to use it on your next 2 hour flight, you better power it down and leave it plugged in for a 4-5 hr layover, otherwise, you're flat out of luck.  Plugging it into a dc outlet will definitely not keep it charged either.  I do love the Sony Xperia Z tablet, and I can highly recommend it, if they would just fix these power issues.", "Title": "Excellent tab, put really bad charging issues", "Date": "March 10, 2014"}, {"Author": "dmc", "ReviewID": "R1TJQSJS17WYYD", "Overall": "5.0", "Content": "First things first, it is 20$ cheaper in Amazon, but Sony is giving a charging cradle. Really liked the tablet. It is so light and sleek. Agreed its not built like a tank, but it is more than sufficient build quality for my use.Yet to test the water proofing on this :)+ Gorgeous screen+ Super slim+ Super light+ Expandable memory+ Fast+ Responsive- Not built like a tank, there is a bit of flex in the back side- No Gorilla glass- a bit pricier", "Title": "Very good tablet, fast, slim, light and waterproof", "Date": "November 8, 2013"}, {"Author": "B. Reid", "ReviewID": "RN7KDFZYGTX7P", "Overall": "5.0", "Content": "This has performed flawlessly since purchased about a month ago.  Connected to the internet on home wifi and public wifi without a problem.  The picture quality is very good and so far have experienced no problems in the limited operation of the tablet.", "Title": "Sony Xperia Z SGP311U1/B 10.1-Inch 16GB Tablet", "Date": "December 20, 2013"}, {"Author": "Edward Aced \"aced\"", "ReviewID": "R15SFV6TATMSNF", "Overall": "5.0", "Content": "I have a 3rd generation ipad, nexus 7 first generation, and a windows split by hp; I prefer this tab over the rest. I have to admit I am an android guy but I love my iPad. I got this instead of a new iPad air because there is not a lot different between older ipads and newer except weight and processing chip (just like iphones the older ipads come along for the ride for updates). This sony tab is easy to hold for long periods of time because of weight. I personally didnt like the keyboard that fits the whole screen but once I found the truncated keyboard I use it instead and love it. I have found the universal remote app (ir) somewhat helpful if I cant find my remote and set up wasnt too hard. Standby battery life is amazing! Leave power save on and go weeks without plugging. Now actual battery life while using is good buf not great. A little less than my iPad so about 6-8 hours straight. The design is great, doesnt feel cheap like most android tabs. I debated this one with the nexus 10 and ultimatelyam happy I went with this. Love the capability with memory card expandability.", "Title": "love this tab", "Date": "December 17, 2013"}, {"Author": "Jordan", "ReviewID": "R3A7553JZV7UCI", "Overall": "4.0", "Content": "Very sleek and simple look.  Very light and thin.  Chose it because I boycott all Apple products and I liked the waterproof design; we can live at ease even as it is laying surrounded by coffee cups and water glasses.  I will note that the battery life is nothing amazing AND charging time is pretty slow.  I've allowed it to charge overnight and wake to discover it is still hasn't reached 100%.  Battery life will vary depending on the app that you're using; if it kills you phone then expect it to kill the tablet.Other than that it's a sweet tablet with solid performance.  It has a nice feature where different users can be allocated, so you each have your own dedicated \"desktop\".  This allows each user to have their own wallpaper and apps, BUT some system settings carry through to each user; not a very big deal.  The only hindrance is that subsequent users cannot access external memory cards, and there is no way to give administrative rights to anyone else except the owner; that's pretty dumb.As a writer I will say that extended typing on the keyboard can be annoying, since the navigation bar runs along the bottom of the screen; your palm will rest along the bottom and activate the back, home, or menu buttons.  I've emailed Sony and made the suggestion to change the OS layout to correct the issue.  Like I said, it is only an annoyance, I rarely write extended pieces on the touch keyboard, BUT it is very fluid and I can type quite efficiently with it.  If it were not for the OS layout, then I may use it more frequently to write.The waterproof covers can be a pain in the ass to open every time you want to charge it or plug in headphones, so I would opt to purchase the charging cradle.  I don't have it yet, but am looking into it as a future buy.  I think it would mitigate the poor battery life, plus the tablet has an optional slideshow function that is activated during charging; could act nicely as a digital photo frame on an end table.", "Title": "Slim and light.", "Date": "December 7, 2013"}, {"Author": "Bic", "ReviewID": "R6FI28DH1J3DW", "Overall": "4.0", "Content": "Very good tablet.  Not fantastic build quality (as compared to the outstanding Asus tablets), but they had to cut corners to make it light (ie all plastic).  Similar to a Kindle or the Nexus with plastic rather than metal.Biggest advantage is it is light.  Biggest negative is the USB charging is S L O W and fighting the waterproof cover is a bit of a hassle (and gets in the way of some usb plugs).  I ended up buying the charging stand and that takes the hassle out of charging.Overall, a very good tablet (I've had 6 others, so have lots of comparisons with Apple/Samsung/Acer/Motorola and class leading Asus tablets).  I bought (and returned) the new Asus tablet as it seemed like a brick (all of ~3 oz heavier).  But the Asus was gorgeous build and stunning screen, with a much larger battery - and of course was designed to accept their optional keyboard - all of which made the tablet heavier (but much more useful for those who need it).  By contrast, the Xperia is stripped down - lacks the bells and whistles and class leading screen/design/battery life in exchange for being light.I'd place the Xperia a step below the Asus, but I found the power/beauty of the Asus simply lost out to the lightness of the Xperia (I am a power user of my tablets - probably in my hands 12 hours a day, so lightness becomes a top consideration).", "Title": "Biggest asset is it's lightness of being.", "Date": "December 6, 2013"}, {"Author": "Cody", "ReviewID": "RH0VAN9WTRRY7", "Overall": "4.0", "Content": "I bought this tablet trusting the Sony name as easy to use and reliable products. I like the fact that it is water resistant, accidents happen! I think that the instructions are sub-par. they give the basics. I have been using it for about a month now and I must say that it is fast and with 2gig of ram it has more than enough to run multiple apps with out a hiccup. The Experia is competitive in price when compared with they heavy weight tablets. the latest android support and internal gyro make it fun and compatible with the latest app. the camera is not the greatest, so don't expect to use it for professional shots. great in bright sunlight, not so great in the dim lit room. would be nice if it had a larger main storage drive also. Overall I must say that I am satisfied to go off the beaten path and purchase a lesser known tablet. It is fun and versatile....especially if you have a lot of sony products.The only downside was some wifi issues where it would slow down or drop completely but the device has had several updates since launch (now on Android 4.2) and it has been problem free now from what I can tell.", "Title": "Not a \"Main\" Tablet brand but a hidden gem instead.", "Date": "December 5, 2013"}, {"Author": "Craig M. Schmidt", "ReviewID": "R2AECW68R8NDWQ", "Overall": "5.0", "Content": "I dont know much about these tablets but my son does. i bought it for him for christmas. He loves the darn thing. I have to admit the display is beautiful! I keep asking him if he needs anything else like programs but he says there is a slew of them for free out there. cool!. When he connected it up to the wifi it was very speedy. people have complained about it being slow but this one wasnt at all. On initial startup it updated the operating system to the latest (jelly bean something) level. It was a little pricey but you get what you pay for. this unit is very solid feeling and very thin and light to boot. maybe ll tablets are like this but I feel I can trust sony. It my opinion it was a good buy fwiw.", "Title": "Nice!", "Date": "December 5, 2013"}, {"Author": "shopper 212", "ReviewID": "R3ERGLLH78T2AL", "Overall": "5.0", "Content": "Super thin and light tablet from sony! Great work!The screen can be further improved. The color feels too warm to me.", "Title": "Super thin and light tablet", "Date": "November 28, 2013"}, {"Author": "PCGold \"Steve\"", "ReviewID": "RDVV6RN4MIAY7", "Overall": "5.0", "Content": "Almost Perfect... BEATS the Apple ... with one small nitpicky issue.  Everyone so far has done a great job with the obvious things such as being used IN water, sealed tight so dirt and sand does not get in etc.  Therefore I will say the flaw is the charging port.  Remember it is the strength of the sealed ports that make it superiour to others (as well as the amazing image and colours)... BUT to charge with the USB cord it is a chore and weakens the water tight feature.  This is not a deal breaker for me... just annoying so I bought the docking stand that charges with metal contact points.  The stand also is great if you want to use a keyboard or not hold the tablet while watching something.  I used to be an Apple fan, but lately the other brands have caught up and passed them in many ways.  Sony has also added a few things you cannot get on other tablets... such as their Walkman app which is an excellent music player.  Lastly I love the remote function.  Buy it... it is well worth it!", "Title": "Almost Perfect... BEATS the Apple ... with one small nitpicky issue", "Date": "November 27, 2013"}, {"Author": "Carmen", "ReviewID": "R264TX4GQTUSKL", "Overall": "5.0", "Content": "Excelent this is an amazing tabnlet I do recomend you to buy it it is thin, light and have an awsome screen!!!", "Title": "Awsome", "Date": "November 20, 2013"}, {"Author": "Lisa Yeager", "ReviewID": "R2OPM8JDJ711W9", "Overall": "5.0", "Content": "Bought this so I didn't keep having to lug my laptop to work for downtime. I wanted something to play games on ( likke solitare, majhong, ect..) and be able to check email and surf web. Easy set up and have had no problems with tablet.", "Title": "perfect for me", "Date": "October 30, 2013"}, {"Author": "KaizanRaiden", "ReviewID": "R25IKCVQD9JQFP", "Overall": "5.0", "Content": "I chose this tablet over Samsung because it comes with Japanese.  The resolution is better than most tablets on the market.  It is light enough to carry it in my medium sized purse when traveling.", "Title": "I love it!!!", "Date": "January 19, 2014"}, {"Author": "AJ Del Castillo", "ReviewID": "R2L2QR9BQCR036", "Overall": "5.0", "Content": "Fantastic piece of equipment,  couldn't be happier with the build quality and feel it has. The overall software experience Sony added is smooth and quick!!", "Title": "Awesome Tablet", "Date": "January 18, 2014"}, {"Author": "CT", "ReviewID": "RHH0ZA61QEXVQ", "Overall": "5.0", "Content": "Best Tablet!!!!I was always a bit skeptical on Android tablets until I used the tablet Z. It is extremely well designed and built, speed is also very good  although it does not have the latest processor. Overall it is as good as Ipads that we have in the house. It is going to be my personal entertainment unit from for a few years.", "Title": "Perfect Tablet", "Date": "January 18, 2014"}, {"Author": "Sandy4v", "ReviewID": "R1ISIKFJ7QCUE", "Overall": "5.0", "Content": "Thinnest tabletwaterproofvery very lightScreen with bravia beats samsung note 10.1 and Ipad air retina out of watervery good Tab and expandable with microsd", "Title": "Best in tablets for the price", "Date": "January 15, 2014"}, {"Author": "farticular \"Hev\"", "ReviewID": "R2OFSAHIP8834X", "Overall": "4.0", "Content": "This tablet is very fast. IT has a beautiful screen, and produces excellent video.  It throws youtube and most other downloaded videos to the Sony TV very quickly and easily.  I really like how light and thin it is, doesn't produce hand/finger fatigue.  The only reason for the four stars is the battery which seems to drop relatively quickly, and takes a while to charge(I think. have nothing to compare it to. Maybe I'm just impatient..)  This shouldn't be a problem though since outlets are accessible everywhere I could ever go..", "Title": "Great Sony Product", "Date": "January 15, 2014"}, {"Author": "E. Ford", "ReviewID": "R1UCYTRGC5WTI", "Overall": "5.0", "Content": "I researched for several months before finally deciding in this tablet, and I have to say I'm pretty impressed with it.  I purchased it as a Christmas gift for my daughter.  With her being in college, she didn't want to 'lug' around a laptop (reminded her how far along technology has come as compared to the 'old' days, lol).  A bit pricier than some of the tablets I did a comparison analysis with, this one is worth the extra cost.  The graphics are amazing, it's thin and light, waterproof (to a point), and it runs on Wi-Fi so we didn't have to purchase another usage plan with our cell carrier!  But what really matters most is that my daughter absolutely loves it...so if she's happy, I'm happy!", "Title": "Impressive Tablet!", "Date": "January 14, 2014"}, {"Author": "Almir Camargo", "ReviewID": "R3EB67GW7LXRRI", "Overall": "5.0", "Content": "Very light, fast and with an amazing screen resolution.I use to use it connected with my TV that is Sony too and it's works perfect, I even can play my music into the home theater using my home network.I loved.", "Title": "Just Perfect.", "Date": "December 16, 2013"}, {"Author": "teddyomen", "ReviewID": "R51B0V06NV4WF", "Overall": "5.0", "Content": "Just buy it. It's the best ,and it always will be. Bought it month ago. Very amazing. Gorgeous ,good elegant.", "Title": "Gorgeous", "Date": "December 15, 2013"}, {"Author": "Barbara Staton", "ReviewID": "R135JBATTPS8ZJ", "Overall": "5.0", "Content": "This is an amazing tablet! It's fast, lightweight and its graphics are absolutely gorgeous!. I couldn't be happier with it.  :)", "Title": "I love this!", "Date": "December 10, 2013"}, {"Author": "José Miguel Figueroa", "ReviewID": "R2F1D98E5AWRHU", "Overall": "5.0", "Content": "Excellent device, I love it... The product is great, very fast, and integrate perfectly with Sony TV. The graphics are fantastic.", "Title": "José Miguel", "Date": "December 9, 2013"}, {"Author": "pilebuck2520", "ReviewID": "R107NWOOKY627U", "Overall": "5.0", "Content": "PS3 controller works great, tablet is super fast, and games play smooth and lag free. 3d mark ice storm score was 10,328.Also...  remote was easy to set up with both my flat screens and my sound system. If u want a gaming tablet this one is awesome, especially with microsd card for more space.", "Title": "AWESOME TABLET!", "Date": "October 19, 2013"}, {"Author": "Robert Marshall", "ReviewID": "ROKTW7Z1GSWM1", "Overall": "3.0", "Content": "This tablet is very nice. Its basically an oversized phone as far as what kind of processing you get..  slim sleek tablet that shows more fingerprints than you think it will, very nice design though, maybe I should just war gloves.. the back of the tablet is a matte finish which is nice.  but fingerprints.....You will want to buy a case for this.I had to send it back to Sony today.  I'll have to wait 2 weeks to find out if they will fix it or blame it on me.  here is what happenedI;'ve used the tablet maybe 30 hours total in the month I;ve had it.  All indoor use at home.  Last night I plugged my Sony earbuds into the Sony tablet while watching a video.  the tablet did not recognize the headphones, then I tried to restart my tablet thinking that was the issue, and it did not recongnize me pushing the power button.everything else worked fine.I let it charge overnight and woke up, tried to turn it on about 15 times and no response to the power button..  then one time it tirned on.  Figured out that it would only turn on when I was pressing the tablet near the power/headphone jack.  Weird issue, but I still do not know what the results will be from sony.If this is an odd defect and they replace my tablet I would rate this 4 stars. to me the best tablet out there.  But,  if they blame me on the problem, then it can only deserve one star or zero. because the build quality of this device is crap and isn't worth the $500", "Title": "Had to send in after 1 month of very light use.", "Date": "October 23, 2013"}, {"Author": "karl", "ReviewID": "R10HDJXGUBPQ4N", "Overall": "4.0", "Content": "This tablet was amazing when i got it,  two months ago. Three android updates later, now it's falling apart. The screen flickers, the calibration is off, the light is unpredictable, the port covers wont stay on. I have to be plugged in most of the time because it won't hold a charge. Aaaaand the back panel won't stay attached. The remote control functions don't stay once programmed. The list goes on......oh yeah, it's forever freezing up or the screen becomes totally unresponsive.", "Title": "very nice except.....", "Date": "February 20, 2014"}, {"Author": "Joann Wacker", "ReviewID": "RDPRLEY37S8AN", "Overall": "2.0", "Content": "I received my Sony Xperia Z for my birthday Aug 19 2013. It took a while (my first tablet) to get acquainted we the pad, but after a bit I discovered that it was difficult to link to my wireless network and it would often drop the connection. My wife has an iPad and when trying to go to the same web pages as her iPad I found that between dropping connections and slow downloads, the Sony fell way short. I called Sony for help and they had me reload the tablet, erasing everything and starting anew. That didn't work, so I arranged to have the tablet sent in for repairs. I sent the tablet in according to their instructions and they received it on Dec. 3, 2013. It was promised to be repaired and returned in 14 business days. I called on the Dec. 16th and was told they were not sure where the tablet was but would call me in two working days. They didn't call, I called back on Dec. 19th, they still hadn't found my tablet, but would call in two working days. They did not call. I called again on Dec. 26th and asked for a supervisor. He said they knew that they had my tablet, but were not sure where or what the status was and would call me in two working days. They did not call. I called them on Dec. 31st and was told they had created a new RMA and would put my tablet into the system for evaluation. I asked for a new tablet and was told that they couldn't do that until my tablet had been evaluated. They promise to call me by Saturday afternoon, Jan. 4th. I am not happy!!", "Title": "Sony Xperia Z", "Date": "December 31, 2013"}, {"Author": "Andre Miller", "ReviewID": "RN0S6IXW4F36G", "Overall": "4.0", "Content": "I actually Like my Acer tablet better, would be grade a if there was a usb port.. but overall I am satisfied!", "Title": "It's Okay", "Date": "September 23, 2013"}, {"Author": "Igor Oxman", "ReviewID": "RF1OH9C6UEHP8", "Overall": "5.0", "Content": "I love this tablet!The tablet is working properly.Amazing sound, the sharp and juicy colored image.The tablet totally meet my expectation.", "Title": "The tablet totally meet my expectation.", "Date": "June 23, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R33K2LJ2LQJVYC", "Overall": "1.0", "Content": "I had my Xperia Z tablet for 5 weeks when the screen cracked for no reason.  The tablet won't work with a cracked screen.  I sent it in to Sony.  Never heard anything from them.  After repeated calls, finally they told me it would be $380 to fix  It took me 5 weeks to get this information from them.  Their customer service is non-existent.  Needless to say, I did not get it repaired.  They said they would overnight it to me....a week later I had to call again and couldn't get any answer on why I hadn't gotten it back yet.  Finally, I got it yesterday. It had been overnighted the day before.  I am so disgusted with Sony right now, I will probably never buy another Sony product.  They do not stand behind them.", "Title": "Sony's Customer Service is non-existent", "Date": "October 3, 2013"}, {"Author": "Philip R. Heath \"Gadgets, Music, & Books\"", "ReviewID": "R121678E2Q2NE4", "Overall": "4.0", "Content": "The Good:+ Thin and Light Design+ Fast Boot Up+ Great Display+ Excellent Audio+ Video Playback+ Music Playback+ Games+ Universal Remote+ Long Battery Life+ Gmail and Exchange Support+ Secure Wi-Fi - Even Corporate+ BluetoothThe Bad:- Average Browser Experience- Slow Battery Charge- Lots of Bloatware- Skimpy Storage- High Cost- Few Choices for CasesOverall:  Sony plays to their strengths delivering a great media consumption device; however, the relatively high cost for a 16GB tablet may deter some users.Design:  For the most part, Sony did an excellent job in designing the Xperia Z.  It is the thinnest and lightest 10\" tablet that I have seen to date - iPads included.  It follows the design of most Android devices in having a matte plastic back and nice rounded corners.  Users will find the headphone, micro SD, and micro USB ports hard to open unless you look in good light for the slot for your fingernail to pry them open.  The fit is snug, but this is required for the dust and water resistant design to hold up.  Don't expect the water resistant claims to hold up if you have one of these compartments open!  The only things I don't like on the design are the power and volume buttons.  The power button is small and stiff, and it gives no haptic feedback that the device has turned on.  Wait for the blue light next to the power button to flash.  The volume rocker is harsh, hard plastic that just feels out of place on a high-end device.  It does have the tactile advantage of being easy to use without looking, but this is a small concession.Setup:  Getting up and running with the Sony Xperia Z is super easy - especially if you have used other Android devices.  The main thing you will want to do is look at the diagram to find where the various ports are located and how to open them.  Once you do that, plug it in for the stated minimum of 30 minutes or until the charging light turns from yellow to green.  I did the latter, and it took about 2 hours.  After you charge the device, fire it up and enter your wireless information and Google account.  There is a small update that I recommend you download and install before getting started.  Now you are ready to rock and roll.  I should also note that the Xperia Z boots faster (average of 25 seconds) than any other Android device I've had - phones and tablets included.Media Usage:  The display on the Xperia Z is a sight to behold - capable of true 1080p playback with rich, warm colors.  When you combine this with 9 hours of battery life, you have a device that begs to play your favorite video content.  If you plan to download content for use on an airplane, I recommend adding a micro SD card since the onboard storage is a bit puny at 16 GB.  I watched videos on Netflix, Crackle, Watch ESPN, and YouTube, and the playback is outstanding with one small gripe.  When starting up a streaming video, the picture is very pixelated much like the early days of digital cable.  This smooths out once it buffers enough data, and the picture stays crisp from that point on.  The throne room scene at the beginning of Thor is nothing short of stunning.  One other thing I noticed was that navigation of the Netflix UI when selecting a video to watch is very choppy.  I believe this may be an issue with the Netflix Android app because I have observed it on other Android tablets as well.  Be that as it may, it is still disappointing to experience it on a high-end device.  It makes it feel like a cheap knockoff tablet rather than a premium device.  Make no mistake about it.  This is priced as a high-end device.Music Playback:  Just as you would expect videos to pop, sound quality on the Xperia Z also excels.  Without headphones, the four speakers produce a nice overall sound; however, bass is lacking.  When I say that, it is lacking to the point of being unbalanced in its lacking.  K'Naan's \"ABCs\" had no detectable bass line at all.  This changes altogether when I plugged in my Monster Diesel Vektr headphones.  The sound quality is every bit as good (if not better) than what my HTC Rezound produces.  Sound on streaming music and local storage is both outstanding.Gaming:  I'm not the world's biggest gamer, but I found the experience to be better than any of the other tablets I've used.  Plasma Sky was smooth with good sound quality.  I don't own any of the higher end games that would stress the processor, and thus, I cannot speak to its performance there.Universal Remote:  This is a unique feature that I haven't seen on other Android tablets.  I was able to follow the setup steps and add my LG TV and Blu-Ray player, Cisco Cable Box, and Roku with no issues.  The interface also lets you create macros to setup different activities and transitions.  The one thing missing is the Logitech Harmony functionality of knowing how to automatically transition between activities and devices at the touch of a button.  However, as a free add-on, the functionality is more than adequate.  This feature is potentially good enough to justify some of the higher cost if you do not already have something like a Harmony remote.Connectivity:  I had no issues setting up or staying connected to my WPA-2 protected Wi-Fi with a hidden SSID.  My experience was similar at work with our 802.1x user authenticated Wi-Fi.  I was also able to connect my Logitech Bluetooth keyboard and use it without any issues.  It performed as expected based on other tablets I've used.  I own Touchdown for Exchange, and I connected to my e-mail without issue.  This is somewhat of a tangent, but I highly recommend a third party e-mail app for connecting to Exchange if your company has the security PIN functionality turned on.  This limits the PIN scope and data wipe to the third party app rather than your entire device.  I don't want to have to enter a PIN every time I unlock my device even if I'm not accessing my corporate data.  Back to the Xperia - Gmail also works as expected.Complaints:  All is not positive with the Sony Xperia Z.  While battery life is good, charging time leaves something to be desired.  My rough benchmarks are about 20% battery charge per hour putting it at 5 full hours to charge after a full drain.  I work around this by dropping it on the charger anytime I put it down with 50% power or less remaining.  In addition, the browser experience on Chrome is on the lackluster side.  This is not unique to the Xperia Z as I find it underwhelming on every Android device - even the Silk accelerated browser on the Kindle Fire.  The response can also be a bit wonky as an attempted clicking on a link often results in zooming instead.  When you throw in the lack of Flash support, it makes me long for a \"real\" computer.  Then, Sony went over the top with bloatware.  They include a myriad of their music and video products along with a couple of alternate app/game stores.  The nice thing about Android 4.0 and above is that you can disable these apps so that they don't show up, but you need to root your device in order to remove them.  Finally, there are few choices in the way of cases.  The only one that looks worthwhile comes from Sony at a retail price of $79.  Amazon has a few, but my trusty standby brand Targus does not have one.  In the end, none of these is a showstopper, and they are on par with other Android tablets.  I guess I'm just holding out hope that someone will buck the trend of annoying users and taking up space with useless junk.Conclusion:  The Sony Xperia Z is an excellent media consumption tablet with a nice extra in its universal remote software.  It is a bit pricy and skimpy on storage, but the performance is better than average.  Please feel free to ask questions in the comments if I did not address something that you would like to know.", "Title": "Excellent Media Tablet And More", "Date": "June 29, 2013"}, {"Author": "Colorado Guy", "ReviewID": "R2O9KNKER1O3WY", "Overall": "2.0", "Content": "While Sony has a good reputation for design and quality, tablets is not their best achievement. If you have had experience with an iPad or Samsung tablets, this tablet will only disappoint you. All of the \"connectors\" ie. charger, Sim card, SD card are all difficult to access and I suspect over time, they will break off.  Also, with only 30 minute use, there are fingerprints all over the screen, compared to others. And finally, Sony uses a front end that hides the Android OS standard functions and doesn't yet have the latest version, Kitkat.I would suggest an iPad Air for the same price or the new Samsung Galaxy Pro tablets.", "Title": "It aint no ipad nor Galaxy Tab!", "Date": "April 26, 2014"}, {"Author": "jello", "ReviewID": "R2NDC7GZAOH0MY", "Overall": "3.0", "Content": "The tablet was excellent quality, very fast and slim. The layout was simple. However, it takes awhile to turn on and off. For me, after 2 weeks of having it, it began to randomly blink and the text would become condensed and elongated while spazzing out during web browsing. The bluetooth tends to disconnect with the keyboard.  All of this would be fixed after rebooting it but it would occur again after a few hours. I had a replacement for it and it still had the same issues. Also,  the replacement tend to lag slightly. In the end, I had to return it and got a refund. I would have given this a 5 star if it hadn't been for the defects. I really do prefer this tablet over my new one but I probably won't by this until the glitch is fixed.", "Title": "defective", "Date": "March 10, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00CE590Z0", "Features": null, "ImgURL": null, "Name": null}}