{"Reviews": [{"Author": "A. Fischer \"StarHopper\"", "ReviewID": "RS62LEYGNXVON", "Overall": "5.0", "Content": "First off, I need to say that I am fluent in both Macintosh and Windows environments.  In my home there are two ipads, a mac, and a windows 7 laptop.I must say that I purchased this with no small amount of trepidation on 9/14/2013.  I did not purchase it from Amazon, rather, I purchased from a reseller on ebay.After reading so many negative reviews, I was afraid to pull the trigger.  But, I went on Youtube and watched RECENT reviews by ACTUAL USERS and they overwhelmingly seemed to indicate that this little tablet was a worthwhile investment.I knew going into this that Windows 8 \"RT\" was a \"hobbled\" version of Windows 8 and I couldn't use old windows 7 programs on this little guy.  Only apps that can be downloaded from the Microsoft App store will work.  But, if you think about it, this is very similar to the ipad.  You cannot use Macintosh programs on the ipad - you can only use those apps which you can download from the Apple App store.It does help that Microsoft includes, for free, the Microsoft Office 2013 suite on the tablet!So, when I saw the refurbished 64gb model WITH soft keyboard for $279 shipped on ebay - I took the plunge.  I AM SO GLAD I DID!The build quality is ALMOST on par with Apple standards.  Very nicely designed and executed.  Feels great in the hand, and the built-in kickstand is a wonderful touch.  Stays absolutely cool to the touch, even when plugged in to the charger.The screen is quite bright, colorful and contrasty.  NO, it's not a retina screen, but it's clear and crisp.The soft touch keyboard works surprisingly well, and you even get audio \"clicks\" when you type (I'm sure that can be turned off if it bothers you - but I like it)A lot has been said about the Microsft App store being a barren wasteland.  Well, while it does not match the quality and quantity of the Apple App store, it certainly has a lot of great apps and I am very impressed with the growing selection.Anyways, it has been three days and I am thoroughly enjoying this Surface RT. It allows me to experience the Windows 8 environment at a reasonable price - and more importantly, it's just a lot of fun to use!If you can get one on the cheap, I wouldn't hesitate to do so. And, with Windows 8.1RT upgrade coming out next month, even more functionality will be added to an already amazing interface.", "Title": "Don't believe the Naysayers!  This one's a keeper", "Date": "September 19, 2013"}, {"Author": "Don \"Don\"", "ReviewID": "R3E3UN1XM0LJIX", "Overall": "5.0", "Content": "I work on a freelance basis, mainly as a writer. Wanted something I could keep with me when I travel - even on vacations seems like clients come up with last minute projects. Office RT fine for what I need. Have only had for a week, but notice no difference between this version of Word and what I normally use.Surface itself is a remarkable machine. Very small and lightweight - 2 lbs w the Type Cover. Plenty fast for Word and Internet. I do appreciate the long battery life. The Type Cover is fine for touch typists - no issue as long as use it on a desk or table.Now on my lap, a different story. This is not a laptop and the fact that the screen does not stay up is an issue when not at a desk. Interviewed someone in a car the other day - screen just lay flat on my knee and could not see it at all. For apps, that's fine, fold the keyboard behind the screen and use it as a tablet. For touch typing, the major drawback of this system. Other drawback, of course, is the screen size. Fine for working with one document - my dual-screen desktop, or even my laptop, a far better system when I have 3 or 4 (or even 2) documents open so I can refer to reference materials while I write.Still give it 5 stars, even though I'd prefer a form factor more like the Samsung Windows tablet (which is hinged more like a laptop).  It's worth putting up with - half the weight and half the price of that Samsung.And I guess, to be fair, it IS a tablet - and that convertible form factor, with the keyboard folded behind the screen, does have its uses. Kind of fun at times to use it strictly as a tablet.____________Now after 6 weeks, I find I don't really care that much about the form factor. It's fine - figure you need a table if you're going to type much (although I have used it in my lap at the airport - just need to sit in the right position)I do use it in tablet form quite a lot - read the papers in the morning, play some games at night, surf the Internet. Nice to fold the keyboard out of the way but have it handy when need. Though unlike an Android tablet, you really do need to charge it every night or at best, every other.Have traveled with it. No problem at all using it an hour at the airport and then through a four hour flight. Still had battery left. And screen size is fine - you do want to maximize your document then click the Word icon at the bottom of the screen to switch from document to document.", "Title": "A remarkable gadget", "Date": "July 29, 2013"}, {"Author": "Neeraj Bhatnagar \"Amazing Buyer Seller\"", "ReviewID": "R8BF8W6YEGWT6", "Overall": "4.0", "Content": "About myself:  Not much into apps and games.  I bought this computer to manage my work life:  1). reading books 2) managing appointments and emails 3) Web browsing 4) Storage in the cloud 5) Portable way to show power point presentations.What I used or considered before buying:  Nook, Samsung Galaxy, Other Android devices, IPADWhy I am satisfied: 1) Active tiles are very useful.  They give you information without a click.  No other OS matches this.2) Screen size is very convenient.  Any 7\" or 8\" device will not work for me.3) The UI is very fast and fluid.  It all appears to be one single application doing different things for you.  I think Metro is the best touch interface.4) I use Kindle to read e-books.  This tablet has a beautiful Kindle application that works.5) There are many subtle things.  When you click on a link in an email, the screen automatically splits into two parts, one for the email and other for the browser.  Great feature.6). The \"desk top\" or hidden PC is extremely convenient.  Essentially this tablet is a PC and a tablet in one.7) \"Reading list\" is a great feature.  Any time you don't have enough time to finish reading something you can add it to read offline in your \"reading list\".  A very neat version of this thing will be available to you offline when you want it.All in all the number of times I turn my laptop on has gone down by almost ten folds since I bought this device.  Some of the features that I have written above may be available in other devices as well.What is lacking:1) The device took some time to set up.  Multiple windows update (until I finally upgraded to WIndows 8.1).  All free though.2) My bank's App still does not run on this device.  It seems Wells Fargo still does not have an app for Windows 8.1.3) The device stopped responding at least on one occasion.  I had to reboot it.", "Title": "Don't hesitate to buy this product", "Date": "January 16, 2014"}, {"Author": "dreamer", "ReviewID": "R3F603KQOU2162", "Overall": "4.0", "Content": "I looked into a few well known tablets out there, but because I am going to school this seemed like a great choice. I loved that it came with word, power point, and one note. I loved that it is powerful enough to watch Netflix... I loved that it has a usb port making it compatible with usb keyboards, usb flash drives, and the like. This tablet has a nice big screen and its bright too. The keyboard is great to type on, and understands what I'm trying to type well. It also can keep up just fine when I have 20 different tabs open. For how small the speakers are I was surprised at how much, and clear the sound is on the surface Rt. I love how small and portable it is and I have used it many times in class. Its web capabilities are wonderful. I was surprised at all the cool apps Microsoft 8 had attached to it, I have always only used android.So why not a 5 star? I also bought this tablet because I wanted a camera/recorder with me at all times... I always forget mine at home.This camera have very bad resolution.... takes bad pictures and I was disappointedAnother reason was that when I bought it I did not know you could not download anything on this thing. No Google chrome... I need to have Google chrome  to watch pencast from my math teacher. No mincraft... etc...One more thing...not all things with flash will play on the surface Rt . IT has a white list on websites it will play. Some of the tv websites I used to watch won't play. I found on utube how to add the websites onto the white list but it was a pain to do.Overall I paid 268.00 total for my Rt...not with the keyboard... I bought the Logitech keyboard with built in mouse at WalMart for 25.00 its cheaply made but works well on the surface. What do you expect for 25.00 though. I am very impressed with this tablet and to be honest its minor issues were not all that bad if I could give it a 4.5 I wouldP.s it holds its charge for 8+ hours and charges fast", "Title": "almost perfect", "Date": "September 21, 2013"}, {"Author": "Not Old Yet", "ReviewID": "R1CNNHZ6YWLCJJ", "Overall": "4.0", "Content": "I bought this a few days ago, so I'm still getting acquainted with it.  I went to the store considering a Kindle Fire hdx or a Dell Venue 8, but bought this because it has a full USB port in addition to a micro USB and a charging port.  I don't have any Apple products, so I didn't consider an i-pad.This will do what I want it to, which is carry my Powerpoint presentation when I speak, and allow me to use it as a reference when I am within wifi range.  It comes with Office - Word, Powerpoint, and Excel.  I have already loaded up some photos from USB drives I have, and attached a portable hard drive that held other photos and documents.  There was only a $20 difference between the 32 gb and the 64, so I got the 64, although I don't know if I'll come close to using that much.The keyboard seems unnecessary to me so far, because the on screen keyboard is easy enough to use for short messages and doing web searches.  Even though I first was looking for something smaller, I think this will be more useful when I'm working a booth or giving a talk, as it will be easier for people to see.  I'm hoping to be able to use it with a projector.  It has Bluetooth, so that's a plus.  I downloaded Kindle and have already read a short book on it.  You can adjust the brightness so save power and makes it adaptable to various lighting situations.Trying to used the traditional desktop without a keyboard or mouse was somewhat challenging.  I used the desktop to organize my photos into folders.  I had trouble making the screen larger and it was difficult to touch accurately on the tiny print.  With the USB port, I could easily attach a mouse.My desktop used Vista, so there is some learning curve to get used to Windows 8, but it's not that difficult.  I like using the stand to read while eating lunch.  Just, don't swipe the screen with messy fingers.I didn't give 5 stars because I'm a hard grader.  If we could give halves, I give it a 4.5.  And don't expect a manual.  You'll have to go online for directions.  There are tutorials on Youtube.I feel this tablet is a good value.  I plan to order a cover from Amazon - a keyboard, maybe in the future if I need it.", "Title": "Full sized USB", "Date": "January 20, 2014"}, {"Author": "Benjamin  Apple", "ReviewID": "RTN92QNUWT0PN", "Overall": "5.0", "Content": "If you want a wonderful device for internet browsing and getting work done, this is it. I don't download a lot, and just use the internet and Microsoft Word functions and for that it's just what I was looking for. Awesome.", "Title": "Wonderful!", "Date": "February 9, 2014"}, {"Author": "Stacy Smith", "ReviewID": "RSVZX94KNL0KG", "Overall": "4.0", "Content": "I bought a Surface because I needed a new  computer and thought this looked cool. Yeah I know- such a high tech person I am. Well I like it but there's a few things I found frustrating:not all sites are touch friendly so I personally think you need a mouse, that and the fact that not all little boxes, emails, or links can be clicked with ease with everyones fingers.The other thing I hate is when it makes updates, it like freezes and shuts itself off, that is weird. I'm not the only one with that problem because one I googled it I saw many people with a similar issue.Overall I like it but it has taken longer to get used to than any other computer or smart phone that I have owned in the past.", "Title": "Tricky at first", "Date": "January 14, 2014"}, {"Author": "Steve S.", "ReviewID": "R325NQ1TYO4BYY", "Overall": "5.0", "Content": "I liked the surface I bought so much that I bought one for my wife. She uses it to organize pictures and likes the screen resolution.  It does all I used to use my laptop for and goes easily anywhere. I'm now looking for a printer that will work with it.  I recommend the surface to anyone, for use at home or while traveling.", "Title": "Surface is a good traveler", "Date": "January 19, 2014"}, {"Author": "John Pyers \"JEP4\"", "ReviewID": "R2R4I2VIFU4AO6", "Overall": "5.0", "Content": "This is an all-around great option for most people who want to surf the net safely, 'do' email, edit and share documents and do all the normal stuff people generally want to do. Office is included and free, along with Outlook (free upgrade to Windows 8.1). Because you're using Microsoft Office, all your work or school files are compatible. Because you're automatically connected to free cloud storage, your documents are available if you go to another computer connected to the internet and need to grab something.You have a full version of internet explorer to enjoy the full facebook/twitter/ tweetdeck/pinterest  experience. Sure - there are apps, and they're fine - and many of them are actually useful or fun - and free. But a sweet secret is that even the entry level Surface RT has a desktop area with full Outlook, Internet Explorer, Word, Excel and OneNote.This isn't a \"PC Gaming\" computer - you can't install that sort of game; but the games available in the App store are good, and most of what you would expect are available.The Surface weighs next to nothing. Get a keyboard cover for it. it can take a 64GB microSD card and at least a 32GB USB memory stick. With the cloud (OneDrive), you won't really need it - but it's a great way to keep GBs of your music with you. Note: you can't install iTunes. But Xbox music will play your music just fine and making playlists is a snap.Bluetooth 4 connectivity is great. Stereo headsets connect flawlessly, as well as Bluetooth mice and other devices. Free apps will send what's on your screen (movie, web page, app - whatever) to almost any TV or Blue Ray player connected to your internet at home. If you don't have an Amazon Video app on your TV or Blue Ray - just play it on your Surface in Desktop Internet explorer and send it to your TV!HDMI and VGA cables are available too.Overall, I found the Surface RT to be strong enough to handle all my business - my work tasks - while my regular laptop was being repaired - a full two weeks of constant document, internet, email, presentations - travelling and usually connected to a second screen to extend the screen or connected to a projector... This is a great, dependable machine.Oh, and many of the apps are fun and/or useful.if you get it, consider the Microsoft Complete protection - $99 for 2 years is a great deal and covers everything.", "Title": "A Great, Lightweight Powertool", "Date": "March 15, 2014"}, {"Author": "PR", "ReviewID": "R301UG5Z4GV4W5", "Overall": "4.0", "Content": "I love this tablet and use it when I need something with more power than my ipad mini. Here are some things I like about it:1. It has a beautiful screen. It's bright and sharp and the colours look amazing.2. It has expandable storge via the micro sd card slot in the back. I use a SanDisk 64GB micro SD card in addition to the in-built 64GB storage. Works like a charm.3. It has a full size USB port. This is probably the best part as it makes transferring files super easy. This is where I prefer this over my Ipad mini.4. It has a kick stand. This comes in handy for easy viewing as it holds the tablet up without issues.5. It's got a solid build. It does not feel cheap.6. It's powerful! My ipad mini cannot play full hd videos that have been shot with my Canon 5d mark II camera, but this tablet handles it fine! This alone makes it stand out.7. You can connect an XBOX 360 wired controller to this tablet for gaming and it just works! No need to install any drivers or anything. It simply recognizes the remote.8. The best part is that you can play Super Nintendo games on this using the xbox remote. Simply download the SNES emulator app, and just do a google search on how to get the games. Also, some of the other games ( aside from the super nintendo) also work with the controller. This makes it a great portable gaming device....Now here are the things I disliked:1. The battery life is not great in standby mode. Unlike the Ipad mini which seems to last forever in standby mode, the windows surface RT will only last about a week in Standby mode. However, do note that in practical use, it lasts about 8 hours. This standy issue can easily be avoided by simply turning the tablet off when not using it instead of using the sleep function....2. It's a bit heavy. But then again it's packing decent power and a USB interface....3. Windows is terrible for apps!!!! The same apps available on the Ipad or Android devices seem to cost money on the Windows device. This is not fair or right. Furthermore, the apps are just lacking..... Every device seems to cater mainly to apple or android devices, and windows usually gets left in the dust....4. The sound quality of the built in speakers could be better.... But it's not that bad as is.Final thoughts:Overall, this is a great tablet with plenty of power for playing back HD videos and so forth. The display is crisp and clear. Hopefully the apps will catch up soon. Definitely worth the price.", "Title": "Fantastic Tablet! More convenient than an Ipad....", "Date": "May 7, 2014"}, {"Author": "E. L. C. G \"ecg\"", "ReviewID": "R1QDF38X3D9M2K", "Overall": "5.0", "Content": "This was purchased for my husband.  We found it through Amazon at a better price than we would have been able to get it locally.  In fact, one store didn't even have them in stock and couldn't promise when they would be available.  He uses it every day and purchased the keyboard as well.  Great packaging, great product and good price.", "Title": "Microsoft Surface RT 64GB", "Date": "February 6, 2014"}, {"Author": "Michael Casares", "ReviewID": "RIQ965UBLHOZ", "Overall": "5.0", "Content": "The Surface was just as described and works great!  It takes some getting use to but the portable tablet is just what I needed.", "Title": "Microsoft Surface", "Date": "November 7, 2013"}, {"Author": "dd6343", "ReviewID": "R10UYO6H6JLBA0", "Overall": "5.0", "Content": "I recently purchased this tablet after giving my iPad to my wife.  I also have a Kindle Fire, which I have used as a tablet when necessary.  I received the iPad as part of a class I enrolled in, and tried it briefly, but could not get comfortable using it.  Having a Windows 8 phone and a Windows 8 laptop, it just seemed natural to use a Windows 8 tablet.  The Microsoft Surface has been great.I read quite a few reviews prior to purchasing this tablet, to be sure that I would be satisfied.  Having used the Apple/iPad, Android, and Windows formats, I find the Windows 8 the easiest to use.  I noticed that many of the negative reviews complained about the Windows RT/8 format, but once I both updated the device and upgraded to Windows 8.1, the Surface becomes far easier to use than either the Android or the Apple formats.  One of the features I like is that I have easy access to all the apps I want quick access to on the main screen, and the lesser used apps I can move to the \"secondary\" screen, which is easily accessible.  I also noticed complaints about not being able to use programs.  But, just like any other tablet, Android of Apple, it is made for only apps.  That said, the Surface comes with a recent version of Microsoft Office, which the iPad only offered poor imitations of.My only disappointment was the charger.  I will say that I have a hard time understanding why some people had such difficulty with the fit, as I am no tech wiz, and had it connected and charging on about three seconds.  My disappointment comes from Microsoft using some odd connector, rather than a micro USB like most devices.All in all, this is a great tablet.  If you're looking for a \"tablet\" that runs programs, like a laptop, then I'd say purchase a Surface Pro.  But, you're just looking for a user friendly, functional tablet, the Surface works great, especially for the price.", "Title": "Great Tablet, Easy To Use", "Date": "April 22, 2014"}, {"Author": "Bmajic", "ReviewID": "R3K7FL54VY1E41", "Overall": "5.0", "Content": "Very clean and well made tablet with full office and new windows tile based OS. I paid $387 for a 64GB version that includes a 2.0 USB port and a micro SD slot for an additional 64GB of memory! Can't get that with an iPad for anywhere close to that price!! Can't wait to get the keyboard cover that I think is one of the coolest features of this tablet and really sets it apart from everything else out there right now.", "Title": "best bang for the buck tablet", "Date": "February 6, 2014"}, {"Author": "Kelly Thomas", "ReviewID": "R2XMH5MEQVU", "Overall": "5.0", "Content": "I was searching the market to replace my third failed HP computer and one of my college classmates swore by the name of windows surface and showed me the in and outs of it. I was convinced. I decided to buy one off of amazon for a bit cheaper as well as a backlit type keyboard. I have never been happier! I love the versatility of this product. It acts as a computer when you need it to within class but at the touch of a button you can revert it back to being a tablet at any time. The built  in prop stand is awesome for watching movies and ease of use in tablet mode or table top computer mode. Shipping was fast and amazing a usual from this amazon seller.", "Title": "Best Gamble I Ever Made", "Date": "April 21, 2014"}, {"Author": "Bill McLean \"Is this worth the price?\"", "ReviewID": "R2Z5Q8BGRY8ZZY", "Overall": "5.0", "Content": "I was lucky to get my Surface RT 64 GB Tablet at an auction for $199.00, shipping included, but refurbished and without external keyboard.  I think it's actually worth the earlier higher new price.It comes with as many apps, or as many free app downloads, as Ill probably use.  (Click on \"Store\" and find tons of free apps and some at low prices.)  MS Office is a great addition included free and retailing at over $90.00 if purchased separately. Also, with a free download, Amazon will allow me to get my Kindle books on the Surface RT Tablet.The screen is great. Response is very quick. The built-in virtual keyboard is the best of it's kind.  I find that all the good things said about the RT are true.  I haven't found anything wrong with it - yet.UPDATE 3/15/14I found something wrong: It takes me maybe ten minutes to attach the power cord to charge the battery.With that aside, the more I play with my Surface RT the more I love it.  I have Windows 8.1 on my Desktop and so I can duplicate all the apps as appropriate to my Surface.  Windows 8.1 is more complex than any of Microsoft's other operating systems, but it is worth the cost and effort to learn.The list of apps is growing by leaps and bounds.  I also got a wireless Microsoft keyboard, list $30.00, locally on sale for $25.00,  It really is great.  And there exists adapters that can convert Mini USB to standard 2.0 or 3.0 USB.Maybe you will want to wait for the next generation to be available.  That would probably be smart.  I just can't imagine how the next generation could be much better.Microsoft rules.", "Title": "GET ONE - YOU CAN'T GO WRONG", "Date": "February 28, 2014"}, {"Author": "Deba Mohanty", "ReviewID": "R169PJ9EDLPR69", "Overall": "5.0", "Content": "Its multiuser, good battery backup. OS is smooth and silk. Its good value for money . I don't like to use my ipad after I got this one.Office is pre installed. Cant expect anything more at this price .", "Title": "Good value for money", "Date": "February 11, 2014"}, {"Author": "J. W. Osborne", "ReviewID": "R2GCCMVZGVSR6I", "Overall": "5.0", "Content": "I have wanted one for a while but wasn't ready to pay the price...good price and quick service.  Great tablet...and it is Windows based.  So far no problems and functions really well.", "Title": "iPad beater", "Date": "January 25, 2014"}, {"Author": "Sandra M.", "ReviewID": "R3942NOIW7HXZX", "Overall": "5.0", "Content": "Though there are many tablets available out there, I've found the Surface to be excellent in comparison, due to the availability of Microsoft Office on the product, the Windows OS (which I prefer greatly over Apple OS), the clean and simple Start screen, and the minimalistic and clean views.  I absolutely LOVE the Skydrive and am able to use it on all of my computer products (my desktop, my laptop, my Surface, and even my iPhone 4s).  I also absolutely love the fact that with the type cover and the kickstand, I can easily use the Surface as either a tablet or a laptop.  Being a working college student and a mom, it is very important to me to have a device I can do schoolwork on, that doesn't break my back when I carry it around, and that I can also bring to the grocery store to view my lists & coupons on, and use at home to organize my life.  Also, the customer support team is absolutely amazing.  I am completely and utterly elated with the product and wouldn't think twice about recommending it to everyone I know. (And no, I wasn't paid to say all this, lol!)", "Title": "Absolutely perfect for all my needs!", "Date": "January 21, 2014"}, {"Author": "Courtney Sanders", "ReviewID": "R2HLX87CV4RUC9", "Overall": "5.0", "Content": "I absolutely love my new surface! I bough it to replace my laptop and wasn't sure at 1st if I'd like it at all. But it's great, I'm still in the process of learning how to use everything but it is very user friendly. The only thing I don't particularly like about it is the charger. I like the fact that it is magnetic in case I forget it's plugged in a go to move it but it's extremely hard to get it plugged in properly. There have been many times I see the light is on that show's its charging but when I return the light is off and it hasn't charged at all. Overall though it is a great little tablet and I will continue using it.", "Title": "Amazing!", "Date": "May 31, 2014"}, {"Author": "Kelly", "ReviewID": "R1YBFEWV9JZV1B", "Overall": "5.0", "Content": "Bought this for my college student- it is exactly what she needed! It has replaced her laptop and is much more convenient to carry around campus!", "Title": "PERFECT", "Date": "April 12, 2014"}, {"Author": "ruffyy", "ReviewID": "R8C4IY4XWPZDD", "Overall": "5.0", "Content": "My nsurface arrived in new packaging stating refurbished on the back of the package. Upon opening the package there was a completely manufacturer wrapped Surface RT. It was presented in an as new condition and was totally indistingushable from new. That was a good thing. You save money and get a unit comparable to new in look and performance. I am a long time believer in refurbished products especially when they have a warantee attached. Again look and performance like new. I would advise purchasing a Stylus Pen and a nice case. The housing of the surface is metal and could scratch and a case offers additional protection. Buy from this seller with confidence and check out refurbished items because refurbishment is like a second quality inspection.", "Title": "Surface RT is All Right", "Date": "April 6, 2014"}, {"Author": "Sally", "ReviewID": "R2BL7F8DWMHJR5", "Overall": "5.0", "Content": "Well made, sturdy and solidly built. Picture is clear and had quality.  Love the windows and office software.  Like it better than my Ipad", "Title": "Son loves it", "Date": "April 4, 2014"}, {"Author": "Tony DiVincenzo", "ReviewID": "RRYWM4JO68R3N", "Overall": "4.0", "Content": "Bought the RT version for my week day commute and it's working quite well.  The full browser ability of IE along with MS office tools makes the RT a good fit.  And nice to be able to use a mouse.", "Title": "working as planned", "Date": "April 4, 2014"}, {"Author": "Ina Liljedahl", "ReviewID": "R3R3YPY6I2SG68", "Overall": "5.0", "Content": "It is everything I wanted. It is very user friendly .I was disappointed that it didn't come with a keyboard but so far,I don't really need one. .I love the portability and the touchscreen. If I had to do a lot of typing, however, I would need the keyboard. All in all, it's a great device and I would highly recommend it.", "Title": "Love it!", "Date": "March 30, 2014"}, {"Author": "T. Fuquay \"blutober\"", "ReviewID": "R1IS70YAAS3CBA", "Overall": "3.0", "Content": "I preorded the 64gb surface RT before release. I was all in. I have and daily use a surface Pro. After 16 months, the RT will not charge. I have three charging cords and the RT will not charge. I just read another review posted 2 days ago where the RT just failed with the same problem. Coincidence? It is possible for me to use the online Surface Support area to ship the bricked RT into MS and get a replacement for $200. I paid $749 for my RT! This is unacceptable.", "Title": "16 month life span?", "Date": "March 24, 2014"}, {"Author": "MS \"MS\"", "ReviewID": "R2QPECT2FPH0ZW", "Overall": "4.0", "Content": "I'm loving this tablet. I have a Android Yoga tablet and iPhone 5 as well. But I spent most of time on Surface. Only reason I still prefer iPad over Surface is because of apps. Most of the apps crashes on Surface and Yoga but hardly on iPad. As far as for music and file editing or syncing on all your devices Surface with Onedrive is best. Hardware, speed and picture quality is extremely impressive. Also you get a lot more storage with Surface and extra bonus of Office 2013.", "Title": "Satisfied", "Date": "March 21, 2014"}, {"Author": "Darrell Holland", "ReviewID": "R3ENUTFNKM3S4M", "Overall": "4.0", "Content": "I read the reviews and almost did not buy but after getting the Surface RT I love the clarity of the screen, its compact, and does the things I need it to do.  Yes you can't get a few apps for it like Facebook but you can go to your browser and do Facebook that way.  I would recommend it to a friend", "Title": "wonderful for the money", "Date": "February 28, 2014"}, {"Author": "Yeon Seo Lee \"Emilea Yeonseo Lee\"", "ReviewID": "R3U153XOS9TH39", "Overall": "4.0", "Content": "I love it :) Very unique and stylish. Looking forward to utilize this for may different things. Thanks a lot!", "Title": "My first tablet!", "Date": "February 15, 2014"}, {"Author": "L. Viola", "ReviewID": "R16F0NJK2R7K0A", "Overall": "4.0", "Content": "Works great.  The only drawback is the Microsoft app store is kind of new.  It doesn't have as big of a selection as the android market or itunes.", "Title": "Great Tablet", "Date": "February 9, 2014"}, {"Author": "james koontz", "ReviewID": "R2M1ECVZ8D00PG", "Overall": "4.0", "Content": "this was a very good purchase  for my wife and she loves the ease of use and size  of the computer", "Title": "great buy  very good computer", "Date": "February 7, 2014"}, {"Author": "Bobby \"Deals\"", "ReviewID": "RH3BSQ0JDIQNL", "Overall": "3.0", "Content": "Pros: Weight, thin Profile, bright clear screen, decent battery life, full size USB, handy kick-stand. You get the full Microsoft Office loaded and activated. 2GB memory. The good news is you get that all on the cheap. The bad news is .... theCons:Extremely slow, even for browsing. The Tegra architecture just doesn't cut it. You will be frustrated. You just can't load any legacy software. Where are the apps? At the end of the day, you can now get a refurbished to new 32GB surface for $169. Maybe less on Ebay. Use it as an entertainment tablet & some light browsing for that price you say? It just won't cut it. It plays few video files. And you'll think you're on a dial-up connection when surfing. Even at these prices you might be better off getting a name brand refurbished Android tablet, i.e., pick up a Samsung used for <$200.Maybe an Acer for $160. At least there you can play with scores of apps even if it's Android 3.0 Honeycomb let's say. In conclusion, Windows 8 is really a decent operating system and if it had a decent selection of apps it would be a great alternative. But is spite of all the \"Pros\" the browsing experience is horrible and you're stuck with a minimal app using experience especially with RT", "Title": "The Cons Outweigh The pros", "Date": "April 28, 2014"}, {"Author": "movieidol", "ReviewID": "R2V66C9LCGT3YZ", "Overall": "4.0", "Content": "very easy to use and very handy to take on trips, affordable and is fast, I like it very much", "Title": "It's very handy", "Date": "October 26, 2013"}, {"Author": "Donald Dockman", "ReviewID": "R5AEBZNI60O2Q", "Overall": "5.0", "Content": "This is the perfect computer for a student. I am finding that it meets my needs in the Masters degree program I am in. It allows me to easily connect to the network, get all my work done in the included Microsoft Office Home & Student 2013 software, and share the work on SkyDrive.Pay no attention to the negativity you read in the blogosphere.", "Title": "Microsoft Surface RT 64gig", "Date": "October 6, 2013"}, {"Author": "AKUSFAN \"Bluegrass Fanatic\"", "ReviewID": "RCHXJ8FOPAB2N", "Overall": "2.0", "Content": "The Surface will not run Microsoft's own EMET, their (quite good) threat mitigation software. Might want to opt for another device that uses a processor other than the NVIDIA.", "Title": "Questionable security", "Date": "February 20, 2014"}, {"Author": "Danielle Granderson", "ReviewID": "R3UTN5EAISGWMT", "Overall": "4.0", "Content": "Very happy to have received this product. To maximize use, set up definitely takes awhile but it's fun, intuitive and easy to use. It does way more than the iPad; I'm looking forward to using all the features.Currently using without a keyboard. May get one long term, but not immediately needed. I have a stylus pen and recommend getting one. I've only used this Surface RT for about to weeks.", "Title": "So far so good!", "Date": "January 20, 2014"}, {"Author": "rlnpd", "ReviewID": "R23YS2ASSFSQPI", "Overall": "5.0", "Content": "We love it. Many of our friends had recommended surface. We were happy with the quickness of the delivery. We have been very happy with Amazon in all ways.", "Title": "MSoft surface", "Date": "June 8, 2014"}, {"Author": "Lance Mitzel", "ReviewID": "R1VSZ0XVO4YA11", "Overall": "5.0", "Content": "Excellent experienceWe have received the tablet and are working through the use of it. Since it uses the same operating system as my wife Ultrabook it is not difficult to understand how it operates", "Title": "Excellent experience", "Date": "June 7, 2014"}, {"Author": "Russ", "ReviewID": "RVOFNK526U6RA", "Overall": "1.0", "Content": "Not for me. Especially when I have to have a Microsoft account and login where ever I want to go on the web.", "Title": "Returned", "Date": "June 4, 2014"}, {"Author": "Eileen Sordo Wright", "ReviewID": "RSX0NBBDX08AU", "Overall": "5.0", "Content": "It's light, comfortable, durable and exceeded my expectations for a touch screen. Being that it uses windows 8, it took me a little while to learn my way around it...but I would recommend it.", "Title": "Microsoft Surface RT 64 gb", "Date": "May 28, 2014"}, {"Author": "Pete C", "ReviewID": "R3JUDYEGKSP8HM", "Overall": "5.0", "Content": "Very pleased with the way my Surface works also pleased with the fact that it arrived as stated on the order", "Title": "Very Pleased", "Date": "March 9, 2014"}, {"Author": "Sean McPhilomy", "ReviewID": "R1GP3LAUGA0SUH", "Overall": "5.0", "Content": "This is more than just a toy, it is something the kids can do all of their school work on, and it is ultra portable.  They love it, and use it for actual work and just as much for play.  You should definitely get the Type Cover to go with it, but it handles amusingly well without a keypad.  I like the fact that it supports external storage devices, and also came loaded with a toned down version of MS Office.  Since most of the work we do on this (and our laptops) involves Word, Excel, internet searches and checking email, this thing is just about perfect.", "Title": "Got it for my kids for school", "Date": "March 7, 2014"}, {"Author": "Lou", "ReviewID": "R3CX957BH02N31", "Overall": "4.0", "Content": "I'll start off this review by saying I'm not really a tablet person.  I'm more of a laptop user w/ a standard keyboard.  I just got my RT 64 and there are some really great things about this tablet.  It feels really solid; like a well put together machine.  The best thing about my RT 64 is it was 200 dollars from a refurb reseller off Ebay.  It started right up, but first annoyance was the startup process.  Somehow I turned on the voice attendant and I couldn't shut it off until I finished the registration; minor annoyance.  I like the Windows 8 RT format; it's fairly easy to use and being fairly rehearsed in Windows 8 I was able to navigate and my wife was even able to as well.  There are quite a few apps on the Windows store like Facebook, Kindle, and Netflix; all free and they work well.  The biggest downfall of this product is that it is married to the Windows app store; if it's on the W. app store; you can get it; if it's not; then you're out of luck.  It's not a huge deal to me, but for instance my wife likes the Facebook game apps; no Candy Crush Saga.  I'm sure there will be other apps.  The Office Lite is cool, but seriously doubt I will use this device very often for document creation or management.  Last gripe would be lack of gps; it would be really nice to use for navigation.  I'm not sure why they didn't go ahead and include the full Windows 8 version, but that's where many folks will be turned off.  If you want a really nice, solid tablet at a discount from the Ipad, this is a great option, but you may be turned off by the limitation of apps.", "Title": "Very nice tablet for the money, but it has a few shortfalls...", "Date": "March 6, 2014"}, {"Author": "Marlene Rizzo", "ReviewID": "R27OAXBUBRL5PA", "Overall": "5.0", "Content": "I purchased the Microsft Surface RT recently and I just love it.  The touch screen is very responsive and the color is vibrant.  It is just what I wanted and needed for a nice little computer/tablet at home.  I've used it on the bus and in restaurants and it's so light and easy to use.I'm also using some apps.  I added a couple of games and I just started to read a book on the device.It is exactly what I was looking for.", "Title": "Microsoft Surface Tablet is Great", "Date": "March 3, 2014"}, {"Author": "Patricia Stiegler", "ReviewID": "RXURZAAAYJVWX", "Overall": "4.0", "Content": "It has all that my husband needed to organize/plan his daily wit needs. Easy to handle. He has very little tolerance for new electronic equipment change and he is very happ with this one.", "Title": "Star", "Date": "February 13, 2014"}, {"Author": "cindy benedict", "ReviewID": "R1T955HBIKQSWG", "Overall": "5.0", "Content": "Thank you for this product - it was a gift for Christmas for my daughter - she was sooooo surprised and we couldn't be happier.", "Title": "Microsoft Surface", "Date": "December 27, 2013"}, {"Author": "russ", "ReviewID": "R1DWRTV42DX1EW", "Overall": "4.0", "Content": "I've had my eye on the surface for a few years now. I asked my employer to buy one and they rather went with a Samsung that just collects dust now. The price dropped on the older version quite a bit and it made it difficult to purchase myself. I wanted the surface pro 2, but more for personal use than business. I am a controls tech. and have to use office quite a bit. I also repair computers and a ton of other things. I've had this tablet for 2 weeks now and it meets all of my needs for business and great for personal use as well. I upgraded the keyboard because I prefer the actual clicks buttons. I love it. Very glad I purchased this tablet. I've used the ipad and there just aren't enough apps out there than function correctly when using office files. The down size of the Office RT version is that I am unable to run macros in excel. I programmed some macros and for work I'm unable to run them on this tablet. I'm not sure if there's a way to enable them yet as I haven't really looked into it yet, but that's what I've found so far.I do like the functionality of this tablet. I installed a 16GB mini SD card which helps with space and doesn't write to the main flash drive, which will eventually prolong the life of the drive. I will eventually get some of the accessories such as a USB hub that doesn't require a plug in transformer. The size of this tablet is perfect to work with. It's small enough to use in tight spaces or type in my work van while sitting in the driver seat by leaning it up against the steering wheel. It is just absolutely perfect for my line of work. I expect that my employer will eventually buy this tablet for other employees once they see how it saves me a ton of time from working at my desk as well as in the field by having manuals on PDF instead of having to go to the van to grab a manual.Hope this review helps with your decision making. Weigh your options on what you really need out of a tablet before upgrading to the surface pro 2. I'm glad I didn't spend more money on something that meets all my needs right here. I do like some of the features in the pro 2 and if the price comes down I would eventually like to upgrade, but as I said earlier it's more for personal use that I would like to have it.", "Title": "Just another fan", "Date": "March 19, 2014"}, {"Author": "Adam Carroll", "ReviewID": "R3QDP2ZMAW4CRF", "Overall": "5.0", "Content": "Was as described and on time. Item works great and made the old lady happy so I am happy! B", "Title": "Recommended", "Date": "January 7, 2014"}, {"Author": "Seul lee", "ReviewID": "R22LIE9M68QCQ2", "Overall": "4.0", "Content": "I bought a used one but It seems like almost new!! Also someway it is better than i-pad because i'm a student i need power point or word so on. It is perfect for student and working people. :)Size perfect color perfect and they have a facebook app too!But about free fix perioud is too short only 6months something and a few of apps. That made me give 4stars.But I'm not gonna regreat to buy this oneIt is wonderful tablet!!!!!!", "Title": "It is awesome!!!!!!!!!!", "Date": "January 30, 2014"}, {"Author": "Jessie", "ReviewID": "R18N74W19SHTCF", "Overall": "4.0", "Content": "This is a great product. I glad I purchased it. I particularly like the various options on the home screen.", "Title": "I love my new Microsoft Surface", "Date": "May 4, 2014"}, {"Author": "Ivan S.", "ReviewID": "R2MP01KQF7LD1X", "Overall": "5.0", "Content": "Loved it!!! Extremely satisfied with the shipping and handling. Brand New and was exactly what I wanted. Came in so fast", "Title": "10+++ stars", "Date": "April 22, 2014"}, {"Author": "Nadine Kutchenriter", "ReviewID": "R1B2SNM4ETBP3C", "Overall": "5.0", "Content": "Wait do not buy for 300$ and get a keyboardist very helpful great tablet for app store nothing else go windows !!", "Title": "great if you got it for 199$ on black friday", "Date": "April 13, 2014"}, {"Author": "Mark Kramer", "ReviewID": "RJE8H21GS5SUD", "Overall": "3.0", "Content": "Received promptly and works just fine. Installed features work just fine... Not recommended if wanting GPS features or use with other hardware that is non-Microsoft...", "Title": "Microsoft Surface RT Refurbished", "Date": "April 10, 2014"}, {"Author": "Patti Lignoski", "ReviewID": "R1HHUNCCURKKG4", "Overall": "5.0", "Content": "Wasn't sure as it was a reconditioned surfaced and we went between getting a 34GB and a 64 GB but finally decided on the ^$.  Are very happy with it, came with a one year warranty so figured we couldn't go too wrong on that.  Takes some getting used to, its not a laptop and doesn't work quite like a laptop but other than that we are quite happy with it. It's fun learning all the new apps and what a person can do with it, seems like we learn something new about it almost everyday.  Easier to take with us than a laptop, one thing we thought we were going to stream movies on the plane but only if we wanted to pay high internet prices, but once we got to where we were going it worked fine. Love it, and glad we chose it.", "Title": "Microsoft Surface RT 64GB", "Date": "March 28, 2014"}, {"Author": "Thomas E. Anz", "ReviewID": "R2M376VY4QEWHN", "Overall": "5.0", "Content": "The tablet is just what I ordered thank you for your help. The PC worked very well so far as I have only had it for a short time.", "Title": "Microsoft Surface RT 64GB", "Date": "March 26, 2014"}, {"Author": "Debra Turpin", "ReviewID": "RT24STG4TLE32", "Overall": "4.0", "Content": "I am enjoying my Surface. The only thing I'm disappointed with is that the surface is not compatible with my ego external hard drive or my cannon printer.", "Title": "I like it", "Date": "March 10, 2014"}, {"Author": "Lynn R Johnson", "ReviewID": "R2TGIU4U58IKU5", "Overall": "3.0", "Content": "Screen freasing up! Contacting Microsft------- very attractive and light weight! don't know what else to say-- expecting a snow storm tonight!", "Title": "Problem", "Date": "March 12, 2014"}, {"Author": "YY", "ReviewID": "R334KS2QQ8RRX7", "Overall": "5.0", "Content": "It saves me more than 100 dollars, and it is like brand-new.Good deal.I can work everywhere without load of heavy computer.All the software and application are in the surface better than my nexus7.", "Title": "Nice quality, it is like brandnew", "Date": "December 25, 2013"}, {"Author": "Rolanda Marion", "ReviewID": "R2E76CEJVSUB8E", "Overall": "3.0", "Content": "It was very difficult to use and I wasn't able to download my favorite apps. I need something a little more user friendly.", "Title": "Not easy to use and can't download favorite apps.", "Date": "April 15, 2014"}, {"Author": "kasey", "ReviewID": "R2XA2QUJE200XT", "Overall": "4.0", "Content": "Great product, the only drawback is the incompatability between this widows8 &previous; windows editions.when used with a soft keyboard its great", "Title": "like it", "Date": "January 12, 2014"}, {"Author": "Ronnie Wier", "ReviewID": "R1B79QMQ5EAPFO", "Overall": "2.0", "Content": "I received the package but there was no manual, not package receipt to validate my purchase... I feel a like this was a shady deal", "Title": "No instructions", "Date": "March 14, 2014"}, {"Author": "Bill Moore", "ReviewID": "R2JHLACHCXA2N8", "Overall": "2.0", "Content": "I read mixed reviews on the Surface, and after a period of months wanted to create my own.  I surmise this is a crossover product to serve as laptop and tablet, which, does neither very well.  The RT operating system is unwieldy, and even after an upgrade to Windows 8.1, there are still software programs that won't work.  I bought the type cover, which helps.  All in all, the cost of both the Surface and type cover is, in my view, exorbitant.  I understand the price has come down, so I guess the \"market\", whoever that is, agrees with me.  It is too big for a tablet--I've come to learn I like the Kindle 7 inch model for reading fiction (I buy nonfiction in hardcover for my library--to make me look erudite)as tablets the size of the Surface are just too unwieldy.  That could just be my idiosyncrasy, but it is not comfortable to need two hands to read a book, particularly if having a glass of wine and needing the other hand.  The Surface is then too small to comfortably use as a laptop, as I'm squinting at the screen, and then the Office programs are not fully functional.  I had trouble sending a report as an email attachment, which sort of defeats the purpose for me, as I am a psychologist and have to send evaluations to various parties without all the lag time of a fax, which people tend to never get or lose.The product seems to be built well with one somewhat important caveat--the outlet port.  For whatever reason, it is markedly difficult to simply plug the power cord into the tablet, and you have to fuss around to make sure you are actually plugged into the port on the tablet.  I've never found anything so difficult to simply plug in, then you have to look at a miniscule light on the adapter to in fact see if you are getting power.  On the other hand, the battery lasts pretty long, as I found out when I thought the Surface was plugged in when in fact it was not.With respect to reading, the Kindle is so much better at this function, particularly in downloading books and buying things from Amazon, which is my favorite hobby.  The Surface just seems to be an afterthought for Microsoft, without the continuing upgrades one finds with Windows.  So, it looks like a small computer for me is the best option, along with a small Kindle for reading.  Anyone want to buy a Surface?", "Title": "Does nothing well", "Date": "November 4, 2013"}, {"Author": "Chelsea Madison", "ReviewID": "R3AT9YE4LC9TVA", "Overall": "1.0", "Content": "I ordered this from one of Amazon's companies and when I opened it there was a gray bar down the side of it. NOW due to school I have to purchase another one and pray that they give me a refund for the first purchased one, because I don't have the time to wait for a replacement. Hopefully the return will be easy even though it's taking them forever to contact me back. When I had questions about the product I was immediately contacted back. SO it worries me that now that there is an issue I'm not hearing back from them.", "Title": "Very Discouraged", "Date": "March 5, 2014"}, {"Author": "Kathy Barnard", "ReviewID": "RQPR4RP155WSU", "Overall": "3.0", "Content": "I was looking to buy/purchase a Surface 2 and thought I had, but as it turned out I received a Surface RT. . . which has had some sight drawbacks. The Surface 2 has a quad processor and the RT has a duel which is much slower. I bought a stylus to help me with 'clicking' on links to other screens and/or websites only to find out that the stylus I purchased would work with the RT. I'm just disappointed in the RT.", "Title": "Not what I thought I bought", "Date": "January 13, 2014"}, {"Author": "Danny Sayegh", "ReviewID": "R29KRRSD5NXGFW", "Overall": "1.0", "Content": "I purchased the Microsoft Surface RT 64GB for my father for Christmas and was very disappointed when i turned it on.  I was NOT able to download the facebook app due to lack of system requirements?! This also took forever to locate the wifi and is very difficult for someone mature in age who is not computer savvy.", "Title": "horrible device..", "Date": "January 5, 2014"}, {"Author": "Rossi", "ReviewID": "R2QAWPVD2OPK9", "Overall": "1.0", "Content": "I didnt like it because the windows rt is a s***. I couldnt install any program. I cant install java or flash or even google chrome. It was my biggest deception. A lot of money for a tablet that is very limited.", "Title": "windows rt is a s***", "Date": "January 3, 2014"}, {"Author": "James", "ReviewID": "R3RZYCWY3KEH1X", "Overall": "2.0", "Content": "The app store leaves something to be desired. No way that I have been able to play my Amazon MP3 player or download my music to Media player.", "Title": "Fair at best", "Date": "November 10, 2013"}, {"Author": "Hong V. Baker", "ReviewID": "R3IGDCQE17NH8M", "Overall": "1.0", "Content": "The tablet did not work, unable to run programs.  The retailer charge 15% restocking fee which was not disclosed at the time of purchased.  I am still waiting for my refund.", "Title": "Return Microsoft Surface RT", "Date": "October 4, 2013"}, {"Author": "shantinik", "ReviewID": "RFUKCG8GKXFD9", "Overall": "1.0", "Content": "It froze up multiple times. The interface is clunky (and the lack of a back button very, very annoying.) The stand doesn't hold the thing steady on one's lap.Good to watch a movie - when it was working.I returned it.", "Title": "Not for me", "Date": "October 3, 2013"}, {"Author": "Orange One \"Will\"", "ReviewID": "R2FXJK31B479UK", "Overall": "1.0", "Content": "Microsoft garbage!  My wife has an IPad and there is no comparison between the two.  Microsoft cannot touch Apple!  This thing does not work well.  Many of the apps don't work.  When you tap on one it will say \"update.\" When you try to update it just sits there, it says \"pending\" and does nothing! The only reason I bought it is because I need to be able to use Microsoft programs at home for my job.  This product is a rip-off.  If it's just a pad you need, buy an IPad.", "Title": "Not an IPAD", "Date": "November 6, 2013"}], "ProductInfo": {"Price": "$499.99", "ProductID": "B00DP3KOOG", "Features": "Windows RT; 10.6-Inch ClearType HD Display\nQuad-core NVIDIA Tegra 3\n64 GB Storage, 2 GB RAM, Up to 8 Hours of Battery Life\nTwo 720p HD LifeCams, front and rear facing\nWi-Fi (802.11a/b/g/n); Bluetooth 4.0 Technology", "ImgURL": "http://ecx.images-amazon.com/images/I/41yHbEJvGFL._SX300_.jpg", "Name": "Microsoft Surface RT 64GB"}}