{"Reviews": [{"Title": "Pretty darn good", "Author": "Wolfen69 \"coltsman\"", "ReviewID": "R3VPY38FGVD1XX", "Overall": "5.0", "Content": "I didn't buy this model from amazon, but another retailer. But it works great and is really fast. Sure, it's not a high end model, but that's why you're not paying top dollar. But for the price, it's hard to beat. Screen looks really good and is pretty responsive. I recommend it to anyone looking for a budget tablet.", "Date": "November 16, 2013"}, {"Title": "Surprisingly Decent", "Author": "Argentum", "ReviewID": "R3FVX38G0UF8N4", "Overall": "4.0", "Content": "I bought this elsewhere but where else do people go for reviews? My wife has an Ipad. We love the hardware but can't stand Apple. By comparison, Android 4.1 is way more intuitive and easier to use. Using Windows Explorer to move files into and around the Digix is a Godsend compared to having to use Itunes. This Tablet also came ready to play mp3s and just about any video codec, including mkv, right out of the box. HD videos look very nice. OK, not Ipad nice, but very good. This tablet is sufficiently fast too and streams Netflix really well....smooth video and sharp quality. It has blue tooth which I haven't synced yet, the wireless works fine, an hdmi output and USB connectivity. The Google store never asks for my damn password for free apps. Why the hell does Apple do that?So where does it fall short? Well. One forward facing camera. Good for Skyping at best. It takes awful pictures and video, which, of course, the Ipad is great at.  The speaker quality is poor and volume levels are ridiculously low, though better through my earbuds. The battery life is short. 3 to 4 hours at best.But, for under $100 I got a fantastic reader as well as a useful tablet, especially anywhere I can get a wireless connection. I'm happy with it.", "Date": "December 21, 2013"}, {"Title": "Well", "Author": "mike", "ReviewID": "RS8GQBUKGQMCP", "Overall": "3.0", "Content": "The item was shipped like it said, and has the working capacity it sait it would, but the product locks up alot. I noticed that everything you do on it, it runs constantly in the background leaving the system to only crash and lock up. I bought two of these and they both do the same thing. Better off buying a Dell or something more reliable. I will probably leave it for a spare item to use when i have to... My first bad pruchase", "Date": "February 11, 2014"}, {"Title": "Do not buy this TABLET", "Author": "Heidi Walsh-Kirk", "ReviewID": "R13TFHABS21UME", "Overall": "1.0", "Content": "Bought this for my daughter for Christmas...the same day it started to freeze and was not working.  Since then I finally was able to send it back to the company, which is a real hassle.  Now I receive a e-mail asking for a $60 money order.  Again do not buy this item, there is no warranty offered.  Customer service is not easy to navigate through and it seems odd that you have to go to a different website from Digix to get any help.", "Date": "January 22, 2014"}, {"Title": "Died within hours", "Author": "Reviewer Girl", "ReviewID": "R3TPJ6LWJ7PQON", "Overall": "1.0", "Content": "My mom got this tablet at a low Black Friday price and it died within hours of turning on. She charged the tablet for about 20 minutes, turned it on, and everything seemed to work fine. Then she plugged it back in to charge fully and it proceeded to get VERY hot and no longer would turn on. It was too hot to touch before I unplugged it and I assume it overheated/melted inside. Needless to say, it's going back. So much for knockoffs...", "Date": "December 25, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DZUK7QY"}}