{"Reviews": [{"Author": "Amazonner", "ReviewID": "R5HNPJQQ3I9N8", "Overall": "3.0", "Content": "I received this as a gift and I love it! The screen quality is OKAY- could be a bit brighter but for surfing the web, reading books via Kindle app- it's great. It's fast and the touch-screen is very impressive. It's a quality tablet and looks exactly like the iPad 9.7\". I also love having the mini USB and HDMI ports, and the expandable micro SD memory slot. I put a micro 32gb card in my Skypad and now it hold 40gb. The iPad does not have these ports or expandable memory, which is why I chose to go with the Skypad. It's also $400.00+ cheaper than the iPad and it's just as fast! I will update with a video review this week and keep you posted on it's performance. As of now, it's a 5 star product for the price, bells and whistles!Update on the Cons:-Battery life is horrible-Screen isn't very sharp, but it's not horrible-NO GOOGLE PLAY!!!Other than these issues, this is a good tablet - but because the battery runs out of juice in less than 2 hours, and the screen is a bit fuzzy, I'm dropping the star rating to a 3.", "Title": "Good budget tablet with all the bells and whistles", "Date": "November 25, 2013"}, {"Author": "Micah Christiansen", "ReviewID": "RLBCO1Z3N70PF", "Overall": "3.0", "Content": "I'll leave the specs for the description and try to leave my thoughts and impressions.Good-Nice to have MicroUSB, MiniHDMI & MicroSD.-Touch screen works well.-Able to delete any program at anytime-Good priceBad-Freezes frequently, and I have to use the a paperclip to get the the reset button (no hold down power for 10 sec feature)-Proprietary charger (MicroUSB doesn't charge it)-Screen is alright. It doesn't get too bright and isn't very sharp.-Viewing angle is poor. Even looking straight on, parts of the screen don't look \"right\"-Battery life is poor. I might make it 3 hours full brightness.-Volume rocker is backwards to what my intuition would presume-No Google Play. Amazon Appstore, 1 Mobile Market, and Skytex Appstore are available. It's difficult, if not impossible, to root and get the Google Play .apk onto it due to the lack of demand I suppose. If you have a different device with Google Play you can extract the app .apk's from that and bring individual apps over to it.Note that it does not have Bluetooth. This tablet meets most my needs, but doesn't \"wow\" me.", "Title": "It works for most things.", "Date": "April 1, 2014"}, {"Author": "Diane Hoffstedder", "ReviewID": "R28SF84DI8B6YD", "Overall": "1.0", "Content": "My grandson loved it but I am working on sending it back was very messed up with lines running thru it and the screen was not clear. I'm hoping they send me a new one as this one is not my idea of a good tablet. Maybe it happened in the shipping . Will rate it when I see what happens with Skytex. One reason I do not like to order on line. This was ordered through Amazon on line. I sent it back to SKYtex and if I do not receive a new one I will contact Amazon. Maybe I should have went that way to begin with.Diane Hoffstedder", "Title": "Skytex review", "Date": "January 10, 2014"}, {"Author": "RAYMOND R ERICKSON", "ReviewID": "R30ALX60ZKPM93", "Overall": "5.0", "Content": "I purchased this for my wife as a Christmas present. I'm very pleased with it. It performs as well as my tablet that cost twice as much.", "Title": "Works great.", "Date": "January 1, 2014"}, {"Author": "JOE TALKS", "ReviewID": "R1MKBFDXJWQ637", "Overall": "1.0", "Content": "we bought our first one from walmart......did not work, got the next one from amazon......DID NOT WORK !!!!!!  my advice is to notbuy SKYTEX at all its a scam !!!!!", "Title": "DO NOT BUT THIS ITEM", "Date": "January 1, 2014"}, {"Author": "jay", "ReviewID": "RB59S6QE4S19B", "Overall": "2.0", "Content": "Don't work properly when ever you try to play game or run certain apps the screen freezes. Won't reset the way its supposed to have to let it run dead before u can do anything again.", "Title": "freezes", "Date": "November 20, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00DNNQMTO", "Features": null, "ImgURL": null, "Name": null}}