{"Reviews": [{"Author": "Brian J. Baker", "ReviewID": "R6NB867W8GQOF", "Overall": "3.0", "Content": "So I was pretty excited to receive this in the mail today. I did some research on the chipset and it seemed ok for a lower end model. The things that I liked were the fact it said it was supposed to have 1gig ram, 8g storage, and 1.5mhz dual core. All of these are untrue. I knew that the chipset wouldn't be because they are spec'd at 1ghz dual core, but the ram is half of what it says and the storage is only around 2gb. Luckily I had a 16gb micro sd card to install. Benchmarking in An Tu Tu got me a 6087 score which graphs it in between a kindle fire and a Samsung galaxy nexus. In comparison my Samsung galaxy S scored a 4000 and my galaxy S2 around 10000. Performance wise is not bad. My straight talk (att) sim card went right in and worked perfect. Im not in a 3g area to test that yet but phone calls and texting work fine. I would say app speed wise your looking just above kindle fire speeds. Wifi range is better than my other Chinese tablet (2-3 bars @ 35 ft with a wall in the way) I would say if this was spec'd with the 1gig of ram and 8gig storage it would be a 5 star for cost value performance. But storage is low and ram is average of every lower end tablet. Will update as I continue to use.", "Title": "Does what its supposed to but the specs are inflated.", "Date": "August 13, 2013"}, {"Author": "Amor C.", "ReviewID": "RT34JIM980BRC", "Overall": "3.0", "Content": "VERY fast delivery. Just plug sim n microsd card good to go. The coworkers were amazed  with the features and the price. People were saying its very similar to a Galaxy note. One noticeably item..sometimes tap any icon previous pages randomly show up. At times it froze. Imagine rebooting often. On the 3rd day it froze n when I turned it off  it never turned on again. BOY was I SAD.A friend went to Amazon n was aboutto purchase a similar item but backed out when he saw what happened.", "Title": "Fantastic for a phone........but..", "Date": "November 15, 2013"}, {"Author": "Sergio Altamirnao", "ReviewID": "R37CW30CLJRAJQ", "Overall": "1.0", "Content": "From the Begining didn't power up. It came damaged. I have full charged it, but it did not helped to power up", "Title": "No Quality Control", "Date": "September 1, 2013"}, {"Author": "Jeffery Williams", "ReviewID": "R2MOIAHDSNS7KB", "Overall": "5.0", "Content": "Seller is really great and quick! Also responds quick to issues! tablet is  fast,makes phone calls, long battery life (like nexus 7 kind of) google market is on it, but not play services so things like integration w google maps doesnt work completely. it still get 5 stars tho because its just fly to call with an 7 inch phone. bigger is better i can finally see everything!", "Title": "Cheap amazing China Phonetablet", "Date": "September 9, 2013"}, {"Author": "Arquelan Gillion", "ReviewID": "R1TGCKBKDLPVMD", "Overall": "5.0", "Content": "Great I love it works with straight talk sim service swell no comlaints!!!!!!!!! Keep up the good work e passion", "Title": "great phablet", "Date": "January 27, 2014"}, {"Author": "MotoPro", "ReviewID": "R21L4VKR1QO0BR", "Overall": "5.0", "Content": "the price is perfect. you may ask , why is it so cheap,but has so many features? because- processor is about 1 ghz and ram is less than 1gb, rom is less than 2 gb. display is viewable under wide degrees range, but it is a bad idea to hope, that you will get perfect display for this price. works nice, charges nice, performs faster than sony xperia neo l, and many other android based phones. I have rated 5 stars, because this is a perfect solution for those,who doesnt want and/or has  much money for the smartphone. Really good device, highly recommended!", "Title": "great phone, nice android", "Date": "December 19, 2013"}, {"Author": "Joe H.", "ReviewID": "RUO6J2FNAOSOQ", "Overall": "3.0", "Content": "Needs a GOOD user manual. It states that it uses Dual Sim cards, but it does not show where the cards are inserted. Is it the standard sim card?  A good detailed user manual would answer all these questions.", "Title": "Inadequate infrmation", "Date": "November 18, 2013"}, {"Author": "GeeBee", "ReviewID": "R32DNTR45OKH2X", "Overall": "4.0", "Content": "The Good:Tablet has geat touch sensitivity, very responsive. Great features, but to get most out it , root it (4share/YouTube) can show you how), and then petition it.  I got a 64G sd card and petitioned it.  This way it simulates more ram than the actual 4G and you get the max of 32G for your external sd card memory. I have over 80 apps on it and it is still quite snappy. Fanastic wifi response. One of features I looked consciously for was the fm radio.  In emergency situations, even if the cell tower is down or overwhelmingly busy...as they always are in emegencies...you still get news, music and red cross info...folks always seem to dismiss this feature, but if you can get it....DO.  :-) with otg...I have used external flash drives, mini mouse and usb hub.The not so Good:Crappy speakers, get a good pair of headsets or mini stereo speakers. Also, getting it to work with data on Consumer Celluar has been a problem, BUT, this is not just an  Epassion problem, Samsung, Motorola x and other android phones/tablets have similar problems.  I've set over 10 different APNs and have yet to find one that works for me, wierd thing is that over ten different apns has worked with the various android phones... it seems you just have to hit on the right combination.  IMEI  numbers are sometimes described as invalid when trying to get a sim card on line...but they do work, and I was able to get the At&t; online form to accept the IMEI number.Otherwise...wonderful tablet, I love the reboot feature...and inside settings, there is a quick bootup setting.  It is LTE ready, with upgraded viewing features in gmail.  Both sim slots work with tmobile and at&t.;  Command menu is easily accessible to check various modes. You can set data limits....once you get it to work:-)  You can schedule on and off times. The Kingsoft Office is one of its best feature....I like this better than Polaris, Doc to Go, and some of the other miscrosoft compatibles.... plus it's free.  Hopes this help.  GeaBea", "Title": "Excellent Product", "Date": "May 4, 2014"}, {"Author": "Alfred K Mensah", "ReviewID": "R3UWJIYZTRME51", "Overall": "1.0", "Content": "Sometimes it goes off. I don't know if it is battery or what. It have been shouting down on and off like that.", "Title": "Needs more improvement. It shout down even when the battery is full.", "Date": "February 14, 2014"}, {"Author": "Bruce Rosner and/or Sumona Rosner", "ReviewID": "R2278DX02TGS1B", "Overall": "5.0", "Content": "This product performs as well as my $300 Samsung Galaxy although it is slightly flimsier mechanically. Everything I tried worked perfectly. I recommend it if you want phone capability in a 7 in tablet. Incidentally the tablet came with haptic (vibrate) on touch enabled and it took me a while to figure out how to disable it from the phone ring settings menu.", "Title": "Great buy", "Date": "September 29, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00D8JCD1E", "Features": null, "ImgURL": null, "Name": null}}