{"Reviews": [{"Author": "Jack", "ReviewID": "R21YMXA3TDA5A5", "Overall": "4.0", "Content": "I've been using this tablet for 3 purposes.  Firstly as a mini travel laptop that weighs very little and takes up very little space, secondly as a sketchbook, and lastly just as a couch tablet like most people.As a sketchbook, it's pretty solid. I've installed photoshop and while the computer isn't fast enough for giant files, it works perfectly well for light sketching and painting.When it comes down to it, this is not the fastest machine on the market. What it is though, is the cheapest full windows 8 tablet with a pressure sensitive pen that is currently available.  The Surface Pro is faster and overall better, however it's also heavier, costs more, and doesn't come with a keyboard/cover (which costs even more).Weigh your options.  There are android tablets that are pressure sensitive and faster for cheaper if that's what you want.  The newest galaxy tablet is that.  This particular tablet just suited my needs the best based on what was on the market.", "Title": "Pretty solid", "Date": "October 16, 2013"}, {"Author": "Georgi S. Georgiev", "ReviewID": "R3A1UEE838HUZM", "Overall": "4.0", "Content": "This is my first time playing with Windows 8. It took 2 days to decide not to return this product but now after a week or two I'm ok with the Ativ Tab 3.Buy this tablet becayse of:- Full Office 2013- Metro UI- S Pen- Included bluetooth keyboard- Touch and screen interface (picture is crisp and touch screen feels nice)- Very thin and lite full windows 8 tablet/laptopDon't buy this tablet because of:- Rear facing camera- Dual core 1.8ghz (don't try to use it like a standart win7 laptop because it slowwww)- Don't even try to play games (unless they're 7 years old)- 64gb internal storage (I think you start with 23gb of free space)- Not enough power for 1080pOverall it's great for people who are using it for work and casual browsing but I do not recomend for Power Users.", "Title": "Good for work! Terrible for gaming!", "Date": "September 28, 2013"}, {"Author": "Sonia C Rodriguez", "ReviewID": "R2H8YC4JQQ0M82", "Overall": "1.0", "Content": "I bought a supposedly brand new Samsung ATIV Tab 3 through Amazon from Adorama.  Turns out that, although the packaging seemed to be intact, it was previously used.  It was locked down with passwords, etc.  When I tried to return the item within a two days of its delivery to Adorama,  I was advised that if I had opened the package with the tablet in it, I could not longer return it to Adorama.  It is their return policy --or non-return policy.  How can you know that the item is defective if you can't open it?  I am now stuck with a $500+ white elephant that I will have to pay to get fixed.  Amazon, Adorama, and Samsung have all washed their hands of the problem.  Lesson learned!", "Title": "Buyer Beware", "Date": "February 5, 2014"}, {"Author": "reviewer", "ReviewID": "R20G3YQHJJJM1J", "Overall": "5.0", "Content": "Disregard the previous post that says x32 something. What he meant was that this tablet runs 32-bit version of windows 8, which most compact tablets or netbooks do. Most software these days including recent ones gives you the option to install either the 32-bit version or the 64-bit version one so in most cases you won't have any problem. This tablet is so light and so easy to carry but at the same time fully functional with full windows 8. I use the s-pen with microsoft one note to take notes in lectures and I love it. I'm so happy that my backpack is much lighter now.", "Title": "Amazing tablet...", "Date": "September 28, 2013"}, {"Author": "Andrew Corbett", "ReviewID": "RT2B6PZZQFT23", "Overall": "5.0", "Content": "What I love about this tablet:* Integrated stylus that feels natural to write with* My OneNote is now synched between all my computers plus this device* I can easily manage all my to-do lists, calendar, email, from one slim device* It has a sharp, clean, bright display* It runs Windows, so the interface is familiar and any apps I'm used to from my desktop/laptop I can also have on my tablet* It's comfortable to watch my streaming Netflix, Hulu, tennis matches, etc...In short, I finally have a tablet that naturally and comfortably fills the role of the \"organizer\" I used to carry around.  In addition to serving well for networking and entertainment.Many reviews (professional and not) have complained about a deficiency of CPU power.  I have yet to encounter this as a problem.  I imagine I would if I tried to run high-performance apps or games on it.  But as is clear from my list above, that's not why I wanted it.In my first few days of adapting and configuring I had to overcome the following problems:1)  I did not like carrying it around or holding it with the keyboard that comes with it.  Nor did I like holding the device all by itself.  I bought a carrying case for it (Targus makes a nice one that specifically fits this device and the Galaxy Note 10) which it now lives in.  I prop it on top of the Bluetooth keyboard when I want to use that.  On rare occasions I put it back in the original keyboard carrier when I know I'll want to use it as a \"laptop\" for an extended period.2)  The text and icons on the Windows desktop were too small for me.  I hunted around and found the Windows settings to increase the device font and icon sizes and now it feels like a tablet, rather than a microfiche viewer.3)  I had never used Windows 8.  It took me a while to understand that the \"metro\" interface really is the \"Start Menu\".  If you swipe up on the metro interface you get a listing of all the Windows apps -- including the basic accessories and utilities.  Took me forever to find those.4)  The built in Mail app cannot connect to POP email services.  I had to re-configure my email account to IMAP to get it to work.5)  You can't dynamically synch between a Google Calendar and Windows 8 (as of now, thought that may change).  I had to start an office.com account to synch my Windows Calendar app with my Android phone.So, I experience a bit of frustration the first few days.  But since working through the above issues I've had nothing but satisfaction from my Ativ Tab 3.  I highly recommend it.", "Title": "This is the tablet i've been waiting for for decades", "Date": "December 27, 2013"}, {"Author": "mvan42", "ReviewID": "R2C7UJM8R4UYJ4", "Overall": "4.0", "Content": "I just bought the ativ tab 3 and I am loving it.  its perfect to carry with me and is very useful for what I needed.  I had a hard time deciding which to buy but finial decided on this product.The only thing was when I upgraded to windows 8.1 the keyboard didn't work.  but after I did some searching I discovered the SW update from Samsung (can be found on Samsung's web site under the ative tab 3 product info) it was installed on my ativ but not completely  I had to go into the My pc folder, click on windows, then to program files, then click on Samsung then the sw update folder, after that I clicked on secSwmgrguide and installed the update.  when it popped up I saw the updates that needed to be updated so I updated restarted my device....  but in order to get the key board to work I had to remove it from the device and re pair it with the device.  Sounds like a lot I know but it wasn't to hard to do.  and now I have windows 8.1 with a working keyboard.I know I seen quite a few reviews that were having the same problem so I am willing to help if anyone needs the walk threw on the how to.  just let me know mvan42@gmail.com", "Title": "Great product.", "Date": "February 18, 2014"}, {"Author": "Rozzy", "ReviewID": "R1Y77ZJY7OP6YN", "Overall": "5.0", "Content": "I Love my Ativ Tab...The only thing that disappoints me is when you upgrade tablet to windows 8.1 your not able to use your keyboard...That's really a bummer...Other than that...It's Awesome!", "Title": "Ativ Tab", "Date": "January 4, 2014"}, {"Author": "Royce A Rose", "ReviewID": "R1EFOQ6DMB16BL", "Overall": "1.0", "Content": "I wanted a Windows based tablet and this one came with office and Windows 8. It has been a great disappointment. After a purchase in late September, Windows 8.1 came out in November. I attempted the free upgrade. Following the upgrade the WiFi and bluetooth keyboard quit working. After several attempts to reset the computer guided by Samsung customer service. They brought it in for repair and reverted to Win 8.0. The repair lasted two month. At that time it locked up on a normal Windows update and nothing Samsung online service could do was able to get it to boot. Again, it went to the shop for repair (Samsung). I received it back in January and since the 20th of January to now (3/13) it has failed every auto update. There are over 1000 errors in the Windows log. Every time it went for service and every time Samsung customer support had me reset or refresh the tablet, I lost 4-6 days of productivity. Everything had to be re-installed (Office, Norton 360, all apps) and windows had to go through several normal updates. In total, I have lost use of the computer for 28 days in the 4 month I have owned it. I am now waiting for Samsung to take my call requesting a replacement or refund.", "Title": "Trouble from the beginning", "Date": "February 13, 2014"}, {"Author": "Jean Pierre", "ReviewID": "R12PWJGUCDIUBH", "Overall": "5.0", "Content": "The combination of a wireless keyboard, the S pen along with various ports that make connectivity a breeze really impressed me. Actually when I received this tablet my desktop stopped functioning out of the blue and due to the fact I am a student I was able to do an entire research paper using the Samsung Ativ tab 3 by multitasking with Word, Excel, Powerpoint and PDF. Before I bought the tablet many people complained about the screen resolution not being full HD however, that is barely noticeable. This is truly one of the most powerful PC/Tablet I have seen and Im very satisfied with my purchase. I do, however, recommend that consumers are fully aware of the Specs and features of this Pc/Tablet.", "Title": "Excellent Tablet/PC", "Date": "December 31, 2013"}, {"Author": "Larry Dean", "ReviewID": "R28515TA7WLSZW", "Overall": "5.0", "Content": "This is an awesome tablet. I got rid of my iPad and this has opened up an enormous amount of work productivity. Very fast, picture is really good. I would recommend for someone looking to go windows pad. Has the full version of windows which is really worthwhile.", "Title": "great full version tablet. glad i purchased", "Date": "December 2, 2013"}, {"Author": "brenda m. \"DJM\"", "ReviewID": "R1RIZPK9Q2NH7P", "Overall": "5.0", "Content": "This is so light that I take it on all of my trips. Long battery life, and rapid recharge makes this perfect.", "Title": "Perfect all the way", "Date": "October 22, 2013"}, {"Author": "A Lopez", "ReviewID": "R1NAHTRNCJTQ6K", "Overall": "5.0", "Content": "It was exactly what I was looking for! It got faster that I thought it would. It works great!!! Thank you!! :)", "Title": "AWESOME!!!", "Date": "April 27, 2014"}, {"Author": "chrissi", "ReviewID": "R26Z1WA09P7T3Q", "Overall": "5.0", "Content": "Love it wish it had a  regular usb port instead of a micro one overall very wonderful product. I'm impressed.", "Title": "great", "Date": "April 24, 2014"}, {"Author": "adriana", "ReviewID": "R21LNAIQFQSZDN", "Overall": "5.0", "Content": "I love my Ativ...great performance. I like the blue tooth for the keyboard and connecting with my Samsung note 3.One of the features I use most is the snote.Great addition to my Samsung family.", "Title": "Love it...", "Date": "April 22, 2014"}, {"Author": "Luca", "ReviewID": "RYKQ0PU2YUKVQ", "Overall": "2.0", "Content": "I bought this for traveling, because I wanted something small enough to just toss in my bag and go.The computer itself is fine - definitely slow, but I can live with that.The keyboard case, though, is an exercise in pretty but useless design.  I can't use it on my lap, while traveling, because the entire thing falls backwards if it's even slightly tilted back - so I need to have a coat or backpack in my lap, then arrange the Tab 3 on top of that so it's cradled at the right angle.  It's iffy on top of soft quilts/mattresses.  Worst of all, you can't rotate it 360 degrees.  So if I want to use just the \"tablet\" functionality, such as when space is really tight, I can't just flip the keyboard all the way around and lay it flat.  It seems like such a stupid design flaw.  What's the point of having to physically remove the tablet screen from the keyboard cover, store the cover elsewhere, and use only the (now unprotected) Tab 3 by itself?  I might try to chop up the cover to make it work for my purposes at some other point in time, but for now I just wish I hadn't ordered it.", "Title": "Neat, but the keyboard cover sucks.", "Date": "April 17, 2014"}, {"Author": "Darren C.", "ReviewID": "R31SFT8XX30MQX", "Overall": "5.0", "Content": "I've always wanted a tablet that I could use as a laptop. It does come with MSOffice 2013 , but it does not have Outlook.", "Title": "love it", "Date": "April 11, 2014"}, {"Author": "Charles Powell", "ReviewID": "RIFQHAHNWEIEJ", "Overall": "4.0", "Content": "Prior to making this purchase, I researched all of the comparable two in one tablets and determined that the Samsung ATIV was the best product in value, usability and cost. Since purchasing, I remain convinced that this is a great product and have no buyer's remorse. My only issue is the fact that you have to continue to pair the keyboard with the tablet after certain use and the process required some getting used to. Once I got that process down, everything else was smooth sailing and I strongly recommend its consideration for persons looking for purchase.", "Title": "Everything as Advertised", "Date": "April 8, 2014"}, {"Author": "Edwin", "ReviewID": "RR9QOGW3WF0QF", "Overall": "4.0", "Content": "I was very hesitant on getting the ATIV because of some of the negative reviews, AND that Adorama had a \"no return\" policy on tablets.  BUT, I wanted Windows Tablet that was 10.1 (tried 8\" DELL, and it was too small) and the price was very good.  So I took out insurance and jumped!  I did have a major problem with Windows 8.1 install, with my \"wireless\" connection continually falling into a degraded state -- viz. it showed a connection but wouldn't transfer data.  I'd continually start over at base Win 8 install, make restore points, and slowly add functionality up through installing Win 8.1 though the Store, then my wireless would go sideways.  Even with updated wireless drivers from SamsungUpdate app.  Then I ran across a comment on the internet where a guy, with the same problem, un-installed Norton antivirus (using the uninstall tool downloaded from Norton), and the problem went away.  I tried it, downloading Norton uninstall from their site, and that fixed the wireless problem. Upgraded to Win 8.1 (from the Store) with no problems.  OK, now for a list of tips:1) As soon as you get through the initial startup setup of your ATIV, go through Charms-> Settings -> Change PC settings->Update and Recover-> windows update  and put on Win 8 updates until you stop getting notices of updates when you return to this spot (as listed at the start). This should happen a couple of times.  Don't use Samsung Update tool yet.  Note: you'll need to restart repeatedly.2) Remove Norton Antivirus as described above.  You can use Windows defender for your virus protection -- and it's free.  Restart if requested.3) Run Samsung Update app.  Some people have had with GPS, Bluetooth, and Digitizer.  a) Don't work about GPS -- uncheck it -- you don't have a GPS.  b) Update the bluetooth.  c) As for the digitizer  you will HAVE TO go to the Wacom site and download the Win 8 driver as the Samsung Update app driver will fail it's install and tell you the same.  d) restart as needed....4) Go to Store and upgrade to 8.1 -- Give yourself plenty of time!!!!5) If you go to windows update, as described above, I have stayed away from any!! Win 8 updates to date -- cannot vouch for them in terms of their effect.6) make restore points after new installs, so if they goof you up, you can roll back.The ATIV is not a fast machine, but it's ok.  You can install the free Home Office 2013 without issue.  I picked up some utilities from Stardock that go a long ways in facilitating navigation between the traditional Windows desktop and Metro.  With the 10.1 screen, the Windows desktop is very workable by touch!  Suprisingly so -- and I don't have small fingers.So far I pleased with the ATIV.", "Title": "Tip on stabilizing the Windows 8/8.1 behavior on the ATIV Tab 8", "Date": "March 26, 2014"}, {"Author": "Morris Hanley \"Moe3754\"", "ReviewID": "RJVAJA37E5ZQ3", "Overall": "5.0", "Content": "After having trouble with the Dell tablet I purchased I decided to go with this and am very happy with my purchase not only does it come with a s-pen but also a keyboard which that Dell had neither. Scree on this is great and have had no problems at all with it.", "Title": "Great tablet", "Date": "February 26, 2014"}, {"Author": "M. Pio", "ReviewID": "R23VE2RA20GAK6", "Overall": "1.0", "Content": "Received mine 3 days ago and worked perfectly until today. Tablet will not turn on even after being charged. I did a lot of research on this tablet before purchase and did not find any negative ratings on this product. After the tablet stopped working I searched and found similar issues (Sudden Death Syndrome for Samsung devices) with other Samsung ATIV Tab3. Thankfully it happened to me only 3 days after receipt so I am able to get my full refund. It is a really neat little tablet/pc and has a ton of potential BUT you are definitely taking a risk purchasing this product as the SDS has happened to people months after being purchased.", "Title": "BUYER BEWARE", "Date": "December 8, 2013"}, {"Author": "Jason H.", "ReviewID": "R1PMPBVKH1HJTZ", "Overall": "2.0", "Content": "I purchased two of these devices one for myself and one for my wife. Both displays died within hours of each other approximately 7 days after receiving them. Called Samsungs \"customer no service\" and was informed that I would need to ship them To a repair facility so they could be repaired, I don't think so. Did some research and found out that this is a very common problem with this device. I really did like the device when it was working. In the box going to return them.  I found hundreds of these links, I wish I had found them before I purchased them though. Apparently Samsung is getting a little too big for their britches can anyone say Apple. [...]", "Title": "Dead sceens after 7 days", "Date": "December 18, 2013"}, {"Author": "D. Morrissette \"EasyDoesIt\"", "ReviewID": "R257P00RU1N229", "Overall": "2.0", "Content": "This is conceptually a good idea, but bad implementation.  Back stand has one position.  Gruesome lengthy initial start up.  Two faced, icons and old desktop, moving between the two is not obvious.  New MS version, same shell game of old functions hidden in new locations.  Invited to upgade immediately, ran their upgade assistant, which said the system was good to go, updated to 8.1.  8.1 upgrade had no support for bluetooth keyboard... hours uninstalling the hours to install upgrade.  High nuisance in the short time I've owned it.  Regarding power, two cables, one for tablet, and one for keyboard.  There's been no advantage over a laptop.", "Title": "Regret this purchase", "Date": "December 16, 2013"}, {"Author": "Gilberto", "ReviewID": "R1OKAO3MLWJBT2", "Overall": "5.0", "Content": "The perfect device what I was looking for!!...I'm a PC regular user (office(which is included...great!), internet, music, that's it), not expert or advanced user, coming from laptops I'm sure that I took the right decision, I travel a lot so the weight is an important factor, the battery lasts almost  all day long and the keyboard is amazing, I had it just from a week ago but I couldn't resist to write a review immediately. I recommend to buy adittional a microUSB to USB adapter, a microSD card and in my case I bought a bluetooth minimouse which has been very useful. What I didn't like was the power button, is very sensible and probably is exposed easily for an inadverted start while in your backpack.", "Title": "Perfect windows device", "Date": "November 28, 2013"}, {"Author": "ashley.matecki", "ReviewID": "R8UTMFCJTYE6F", "Overall": "3.0", "Content": "I was super excited to get this tablet to replace my old Toshiba laptop. Overall, I like the operating system well enough.... but there are 3 things that I do not like.1. You cannot download the Facebook app onto this tablet. It says that your system does not meet the minimum requirements.2. The screen size is pretty small. You'd better have some good eyes to read regular print on this baby. Rookie mistake I guess... I assumed the SCREEN was 10.1\", not the whole tablet itself. My bad.3. The keyboard that comes with it has no mouse pad. If you are expecting this to work as a laptop in that sense, BUYER BEWARE. You have to use the stylus that comes with it, and also your finger. Why both? Because the stylus will allow you to click on things, but will not scroll down. Which to some people, might not be a big deal, but for me-- pretty frustrating. I have to go between typing, touching the screen with my finger, and using the stylus to do what I want. That's a lotta doin'!I am requesting that the company allows me to return this product even though it has already been opened. In their policy, they state that they strive for 100% customer satisfaction, yet you cannot return this item once it has been opened. How are you supposed to know if you are satisfied or not unless you open it?!", "Title": "No MousePad on Keyboard", "Date": "January 9, 2014"}, {"Author": "Candice", "ReviewID": "R1LIXEV8SGM9VA", "Overall": "5.0", "Content": "It is completely intuitive. One of the best purchases I have ever made. There is not 1 bad thing I can say.", "Title": "intuitive", "Date": "January 20, 2014"}, {"Author": "ajgriff", "ReviewID": "R2B6O2K6LKNTDM", "Overall": "4.0", "Content": "I got this laptop/tablet for my husband and he occasionally needs word & excel and a full keyboard so this was a good choice for us and a little smaller and less expensive then a surface with full windows 8. I'm slowly working on getting used to windows 8 but the upgrading to 8.1 helps.  Overall for what we need it's good.  But, as others have noted it is a little slow and don't even think about using the camera it's terrible (but that's not what we needed it for).  But, it looks good, works fine, and for watching videos, surfing net, checking email it's great.  I still wish windows had more of the popular droid and apple apps but hubby isn't really interested in playing games so it's not a big deal to him.", "Title": "So Far So Good", "Date": "January 1, 2014"}, {"Author": "Xiong Wan", "ReviewID": "R3NNFNN5NELEU5", "Overall": "5.0", "Content": "I bought it as a gift, I hope it will meet the demand. I really hope so. I like it.", "Title": "I bought it as a gift, I hope it will meet the demand", "Date": "December 13, 2013"}, {"Author": "Clint", "ReviewID": "RAL5YAO153TWK", "Overall": "2.0", "Content": "The tablet itself was nice. I had my favorite 90s games on it like Starcraft / Diablo 2 / Warcraft 3 on it. Ran them nicely. I loved it till it stopped working all of the sudden. No LCD nor Battery splash screen. The only thing I can think so is SDS or Sudden Death Syndrome. Its pretty common on most Samsung products like the S3, Note 2, Note 10.1 2013, etc. The EMMC (Internal storage, etc.) becomes corrupt and no longer functions, causing the product to become useless. I got a hold of a Samsung Repair Shop and they said its a known issue and will be fixed in future updates but till then, be prepared.", "Title": "Great Till...", "Date": "October 20, 2013"}, {"Author": "Simon", "ReviewID": "RPHF1PH4ESOMY", "Overall": "1.0", "Content": "I purchased this item because on the pictures of product demontration it is clearly indicated that the unit has a sim card port but beware do not rely on that it is misrepresentative of the device which does at all come with this port. Now i am not sure why there isnt somekind of disclamer stating that the version they sell you does not have it or they should photoshop it out of the picture if they do want problems. I am not happy at about that but the headaches of dealing with customer service traumatize me even more. Its misleading period.", "Title": "Beware not as indicated on the pictures", "Date": "January 5, 2014"}, {"Author": "Brizzle \"Briz\"", "ReviewID": "RZDQZ23EFYFRU", "Overall": "3.0", "Content": "It feels so cheaply made. It feels like the windows surface I guess. I hate built in keyboards like those. It's that stupid foamy textured mess. It has no substance. If you plan on travelling with it, I wouldn't. It's best just at a desk or carrying without the stupid keyboard. Did not like!", "Title": "too small, too cheap", "Date": "January 25, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00DVFMBRG", "Features": null, "ImgURL": null, "Name": null}}