{"Reviews": [{"Author": "Mike", "ReviewID": "RVGJWYCFPOQPF", "Overall": "5.0", "Content": "I've had the new 8.9\" Fire HDX for about two weeks.  It's great.  I was looking for something as flexible as possible, but I really wanted to have a good video service for off-line viewing as well as on-line.  I wanted something that I could use in the gym, moving vehicles, etc.  I checked out various tablets before making my decision and I definitely made the right one.  People in stores don't know much about Amazon's products and really only want to sell iPads and other Android tablets, especially Samsung.  The Samsung Galaxy note is a great tablet, but no other video service is as good as Amazon's and you can't get it on other Androids.  I have watched videos via both streaming and after downloading and it works really well both ways.  I've streamed video at home where I have 30 MB/sec service and at a place with about 1 MB/sec service and was surprised at how well it worked even there. I have a Prime membership, and that makes the Fire even better.  It was very easy to set up my home email on it and that works well too.  The Silk browser works well and so far I've experienced no problems as a result of it not supporting Flash.  If a website has small type, you can zoom with a stretching motion with your fingers as with some other tablets.  We have a 2013 Samsung smart TV and the second screen feature works exactly as advertised - pretty cool.  I haven't tried the WiDi/Miracast feature yet and also haven't tried to import other music yet, but will do so soon.  The battery lasts as long as they say.  Also have the origami cover and like it a lot as well.  I've briefly tried Officesuite Professional 7, but so far only to view a Word document (docx) and that worked fine. Personally, I'd much rather use a laptop for any serious work than any tablet on the market, but at least this gives some ability to work if you need it.  The build quality seems excellent (for the cover too), the screen is great, and the sound quality is great.  With its quad core processor, it is very responsive and natural to use.  I haven't found anything negative yet. I'm extremely happy with it.", "Title": "Fire HDX is a great product!", "Date": "December 8, 2013"}, {"Author": "meowloricat", "ReviewID": "R1QY1Q7MZ7LGTQ", "Overall": "5.0", "Content": "Love it! Fast, easy, clear. I own second generation kindle and this new kindle fire 8.9 HDX. Bought the 32 with special offers.  Wasn't sure if special offers were taking up memory. Used May day button and received fast answer of no. Fast response and very helpful. Easy to setup WiFi connection. Set up 2email boxes into one combined box. Clear, sharp display. Great present to myself! Haven't had any problems and would recommend.", "Title": "Love it!", "Date": "December 1, 2013"}, {"Author": "Blaine Butenhoff", "ReviewID": "RBGDL1GVZ20CF", "Overall": "5.0", "Content": "We have had ours since the day they shipped, and received ours exactly when they said it would arrive, November 7th.  Admittedly, this is my first kindle, and it has not disappointed. Video is beautiful, web surfing is way better than my ipad(2), it has a great interface, which may take a bit to get used to, but certainly doesn't detract from the devise. I find the interface design perfectly suited for both the size and functionality of the kindle.  I have the 8.9\", 64gb ad-free version. Opening/closing apps, browsing the Internet, reading, etc respond extremely fast to the touch. I have had a really hard time picking up my ipad since purchasing the HDX (I write this review on the ipad, however, due to my wife reading on the HDX). We also bought the hardback/leather flap case as well, which fits on in seconds, no fumbling with clipping it in place, and is equally easy to remove if necessary. I find this to be a fantastic product; not only is it well worth the purchase price (it feels to me like you get more than what amazon just advertises about it) but also the time invested in using this devise since we've had it! I would highly recommend this to anybody who's looking for a different tablet to try, as well as anyone who uses Amazon's services (prime, streaming video, cloud, etc); I've found their interaction through the kindle HDX to be quite enjoyable.  Quite thrilled with this!", "Title": "Fantastic product; thrilled with what we have!", "Date": "November 26, 2013"}, {"Author": "Steve", "ReviewID": "R9LUAHFI4JJR9", "Overall": "3.0", "Content": "I've had this for a couple of days now and have been putting it through its paces.  There are some really great things about it and some not very great things about it.Owned Gadgets:Kindle PaperwhiteSero 7 ProNexus 7 2012Ipad 2Iconia A500Pros:*The biggest plus is the screen.  This is the first HD device I've owned and it makes a huge difference.  I browsed the web, read books, etc. and it felt and looked great.  I then picked up my iPad 2 to do some similar things and it was blah.*Speed and smoothness!  It's much speedier and smoother than any of my other devices.*I actually like the OS.  Quick access to most used apps, recently used apps, and content tabs on one page.  It's very different from iOS and Android which use folders and pages to organize apps and content.*Having it tapped in to the Amazon ecosystem is great (I'm a prime member).Cons:*My device has rebooted 7 or 8 times for reasons I can't figure out.  Some reboots were before I loaded any other apps and some after.  I've had reboots opening settings, silk, and camera app.  Some happened while I was in the middle of a show or listening to music.  Kind of frustrating.*This one doesn't bother me as much, but there's a slight flicker to my screen when going from a white background to a darker like the home page.  It's like it's trying to dim down as if it was doing an auto-brightness adjustment and finally settles (I never use auto, I just manually change brightness if I feel like I need to so I can better conserve battery).*App selection is limited and at least one app, Splashtop one of my faves, doesn't work as well as on iOS and Android.Neither Here Nor There:*There is no quickoffice app that gives you editing abilities like I thought there would be (I read all of the product info I just misinterpreted it.  Why advertise office \"reading\" software as a perk, right?  So I just assumed.)  This didn't bother me much as I've always used and even prefer Kingsoft Office which is free and works just fine on the hdx.*There is no Youtube app and Youtube on the Silk browser stinks.  The videos look worse than on my low res iPad 2.  However, I found a tolerable third party app that gets the job done.I am keeping an eye on it and I'd be interested to know if anyone else has experienced any of my cons.  Perhaps I have one that's a little off?", "Title": "Almost Great?", "Date": "November 9, 2013"}, {"Author": "Nereus", "ReviewID": "R3E22DEOR7WLI", "Overall": "4.0", "Content": "My wife purchased this tablet for me. While this tablet is, in my opinion, currently without equal as a media tablet, I was surprised to find that the in-built Office Suite did not have the ability to *produce* anything - it only has document viewing capability, meaning that you cannot edit/author documents such as spreadsheets using the built-in Office Suite. The line that misled me (and numerous others) was this:\"Stay productive on the go with ultra-fast web browsing, built-in Office Suite, plus e-mail and calendar support for Gmail, Outlook, and more.\"Kind of difficult to 'stay productive' with an Office Suite that can't actually produce anything!Please be aware that if you are expecting fully functional Office Suite productivity with this tablet (word processor, spreadsheets etc), it is NOT included, and you have to pay for additional app(s) to enable full Office Suite functionality, albeit some for as little as $5.This review is intended to help those who, like me, require that functionality in a tablet, and would prefer to know these facts *before* purchasing the tablet. Please consider this simple fact before marking this review as unhelpful and/or making ad hominem attacks in the comments section. Thank you.", "Title": "Nice tablet. Note: full Office Suite functionality is not included.", "Date": "November 11, 2013"}, {"Author": "A K Martin", "ReviewID": "R1C0RSGXS95DWB", "Overall": "1.0", "Content": "Just bought the Kindle Fire HDX 8.9\" for business and entertainment - I travel a lot and was hoping to be able to use this device for my business e-mail rather than carrying a laptop with me. The advertising for the Kindle claims that it can receive e-mails and Office Docs. Turns out the Kindle won't open any Office docs if they are mailed to my normal business e-mail address. According to the tech support person I reached through the live chat feature, any e-mails with Office attachments have to be sent to my '@kindle' e-mail address with the word 'convert' in the subject line! This is quite impractical when receiving files from customers and clients - it means I have to e-mail them back and request they send the attachment again to a strange address - extremely unprofessional. The support persons other suggestion was to receive the mails at my computer and then froward them to my kindle e-mail address - kind of defeats the object of a tablet as it means I have to carry my laptop with me anyway. Once again, the Kindle disappoints as something other than a play thing for games or watching movies.", "Title": "Kindle Fire HDX does not work with e-mailed Office documents", "Date": "December 20, 2013"}, {"Author": "Stephen", "ReviewID": "R3TEGGONZYT8QL", "Overall": "4.0", "Content": "I have been using a Motorola Xoom as my go to media device for about 2 years now. My only complaints being that is quite heavy in the hands when reading books or magazines, and it is a little bit on the slow side when multiple apps are running in the background.So I decided to do some research on the latest (greatest?) tablets on the market. I am not a fan of the Apple ecosystem so the iPad (mini or other) was out of the question. My wife as the 2nd generation Kindle Fire and loves it...me not so much. It's good for what it does, but I'm not a fan of the Kindle overlay on top of the android OS. I had a feeling that this newer version would be similar, but I wasn't sure so I decided to give it a test drive.First let me say that this tablet is super light-weight! It makes my Xoom feel like a 10lb dumbbell. Not only is it light, but it is very thin (maybe even thinner than the iPad Mini). The tablet is super fast and smooth. There was absolutely no lag as I switched between screens and apps. Surfing webpages was effortless and there was little to no load times. The tablet is an excellent media device and I would definitely recommend it to anyone that is already using or thinking about signing up for Amazon Prime.Well why 4 stars then?! As with the original Kindle Fire and all of it's newer versions, I just can't get into the customized layout that Kindle has ontop of Android's OS. I am one of those people that absolutely hates the \"Kindle Carousel\"! I much prefer a clean and simple interface that I can customize to my liking.I would give the tablet 4.5 stars, but that wasn't an option. All in all I would say that the new Kindle Fire HDX is about as excellent a tablet as one can buy (if you like that crazy carousel) and I would certainly recommend it.", "Title": "This tablet WOW'ed me...but,", "Date": "December 23, 2013"}, {"Author": "Michael Bigger", "ReviewID": "R27MXEH871LH3M", "Overall": "5.0", "Content": "(Bought 2 * 32 GB for my kids and 1 *64 Gb for myself, all wi-fi, 3 Origami covers)The big drivers for this tablet are its light weight, the amazing screen quality and resolution, and its speed (fast with no lags). I haven't used Mayday, so I can't comment on it.The device's weight and how it feels in your hands makes me want to hold the device without a cover. I bought one Origami cover initially and I will go against the current and state that this is a great cover because it is a breeze to take the device in and out of the cover; As simple as putting and removing a magnetic strip on a fridge. I want to hold the device in my hands because it feels great and it is super light. For me the cover is great for protecting the device when not in use. A great deal of effort goes into making a tablet feel good in the hands, why should I not enjoy it? My kids like the cover so much, I ordered 2 additional covers.The screen is amazing. DisplayMate did a tablet screen study. You can check the metrics at [...] Just amazing...Some tidbits...The Fling feature, Goodreads, ...: We really like the latest software upgrade to Mojito. It includes the \"Fling\" feature in the  Amazon shopping app. You can create a placeholder by flinging the picture of a product you are browsing to the bottom of the app for future reference. This feature improves the shopping experience.Goodreads, the reader social media platform is excellent.Some people have complained about the limitation on Prime Videos...To that I say Amazon offers some sweet deals on videos for purchase. I have no hesitation buying a few movies in addition to downloading some of the free stuff Amazon makes available for us. The value is unbeatableArea for improvement...Goodreads should be integrated in the tablet like it is on the Paperwhite.At full brightness, it gets hard to reads black text on a white background...not a biggie but I wish the text would pop out more.Superstar product, highly recommended.", "Title": "The Drivers Making the HDX a 5 Stars Product", "Date": "November 23, 2013"}, {"Author": "Shopper", "ReviewID": "R3KJ1HN7DFOXH0", "Overall": "5.0", "Content": "I love the display!  The screen is very responsive.  It is a huge improvement over the Fire HD.  Mayday is so easy to use and the gentleman I talked to was super helpful, friendly and polite.  Thanks, Amazon!", "Title": "Wonderful Product!", "Date": "November 13, 2013"}, {"Author": "Keddie", "ReviewID": "R2GJKAPN60Y3Q0", "Overall": "5.0", "Content": "Amazon offered me a 30 day trial of this item odd enough just 1 day after I packed up an iPad Air and said holy crap I want one of these.  Pulled it out of the box and I have to say for the first time in 4 years Apple lost a product competition to me.  This thing is lighter, cleaner, and just overall better in almost every way.Now before all the Apple haters jump on me for this review hear me out.  Yes I know your precious little iPad does integrate directly into iTunes and transferring of Movies, Music, and Pictures is a snap.  However, this box does all of that too for anyone who know's how to use a PC or a Mac.  I personally have this attached to my 17\" MacBook Pro now and transfer all my stuff with a single click as well.Pros:Amazon is finally giving me a \"Usable\" OS for the tablet market.  Fire OS RocksIntegrated Amazon Creds and access to all my needs such as Email, Facebook, Twitter, and every game on the Google Marketplace.It's VERY fastVivid colors and a super bright screen.CRAZY light.  13.6 oz on my scaleLove that there is no home button (My daughter always hits the button then throws the iPad because it exits her movie)  Yes I know theres guidance mode but I can't run this mode on an old iPad 1 because Apple decided updating to iOS 6 is not possible.Access to Amazon InstantMUCH Cheaper than iPad and has better battery life and processing.Cons:Not as large as iPad screenDoesn't integrate directly with iTunes.Camera's on front and back aren't great but NO mobile device has a ASPC sensor equipped.Doesn't have built in GPS but that's what my phone is for.Overall for the price you can't beat this device.", "Title": "Not an iPad killer but close", "Date": "December 21, 2013"}, {"Author": "Daveg61", "ReviewID": "R32YCOGR8HZJGT", "Overall": "5.0", "Content": "Best decision I ever made.  Battery life is good, great picture.  Easy to use, you can do everything you need to.  If you're still thinking about one, stop thinking and order one..you won't be sorry!", "Title": "love it!", "Date": "June 2, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RH85YQY1J8N41", "Overall": "5.0", "Content": "I had an iPad. I gave it to my daughter. Bought my wife an iPad mini. Returned it. She is now using my Kindle7hd and loves it.Anyway, I tried out the iPad air and it was the same old same old. I was not impressed.Now for this unit. It is the same width screen when in landscape as the iPad air but with a higher resolution. How can 9.7 equal 8.9 you might ask. 4 to 3 vs 16 to 10 screen ratio is why. Now I can surf comfortably. I can read the net without zooming. Portrait reading is more like a book feel at 16:10 compared to 4:3. Format is sweet for movies. This thing is fast. The app store is smallish but has grown a lot and is still growing. 1 mobile market will get me whatever Google play store refuses to.ANDThis is one of the best you can buy right now relative to hardware. And it was 170 less than comparable iPad.I will never buy another iPad.This thing is sweeeeeeeeeeeeeeet.Instantly connected to my WiFi.fast fast fast and Crystal clear.", "Title": "Fantastic", "Date": "January 8, 2014"}, {"Author": "G. Murrill", "ReviewID": "R21LEOSBB3KEPC", "Overall": "5.0", "Content": "Crisp, clear, sharp display,awesome sound and with customer service unmatched in the tablet world. All things considered, it's almost worth being limited to the Amazon universe where apps are concerned. I give it five stars base on how great it handles e-books and videos. But I'd take back half of a star because of all the great android apps that can't be found in Amazons app market. I'm sure that, in time, some of the great android apps I used on my previous tablet will make their way into Amazons app market. But for now, I'm holding back on giving the half star back", "Title": "Light, fast, powerful.....A turbo charged beast of an e-reader in android clothing", "Date": "January 7, 2014"}, {"Author": "Big Kahuna", "ReviewID": "R17BFBU1ECQWUC", "Overall": "5.0", "Content": "I haven't had the kindle fire for very long, but I'm impressed with it's performance. The only downside I've seen is not being able to get more apps in the kindle store. They need to get more android apps into the kindle store or open up the kindle more to the outside apps. Hint, get the largest memory you can afford.", "Title": "Great Tablet", "Date": "January 7, 2014"}, {"Author": "Hallie girl", "ReviewID": "R2G0U30FPGLRZQ", "Overall": "5.0", "Content": "I love my Kindle Fire HDX.  It's so much better than my Paperwhite or my Kindle Fire.  This is my 3rd one.  The Paperwhite is great if you're only going to read; but again, it only shows the book titles in black & white and it was truly hard to remember which ones I had read as I usually purchase more than one at the time.  With the HDX, the books are shown in bright living color and easy to see what has been read and what hasn't.  What is frustrating is to delete duplicates (free games) from the stream on the homepage.  Will have to work on that.  It takes beautiful pictures and the color is amazing.  Even though I'm basically computer illiterate, I'm able to make this Kindle work pretty good.  So far, so good!  I would highly recommend it over the iPad - I guess I'm not an Apple user although I do use an iPhone.", "Title": "A wonderful device", "Date": "January 6, 2014"}, {"Author": "MCBCL10", "ReviewID": "RU54VNP5T89J6", "Overall": "5.0", "Content": "Love it....cant keep the wife off it...every time I go to grab it....she shoos me like she is swatting flies!", "Title": "Kindle fire hdx", "Date": "January 5, 2014"}, {"Author": "John and Lauren", "ReviewID": "RNW182YUQQNA0", "Overall": "5.0", "Content": "I'd give this product 5 stars! It is super fast and the color is great. Reading at night while my husband sleeps has never been easier! The screen does not strain my eyes at all. It's very light weight making it easy to read while laying down. The graphics on this device are very nice. The sound quality is pretty impressive compared to our other tablet. We are very satisfied with this purchase.", "Title": "Great device!", "Date": "January 4, 2014"}, {"Author": "Wickgeo \"wickgeo\"", "ReviewID": "R39HR9ETT0HZHC", "Overall": "5.0", "Content": "I will not review all the features of the Kindle as that has been done very well by others. I do wish there was a charging light on the edge of the Kindle HDX 8.9 like my regular Kindle Fire.  With the cover closed you have to check inside for the battery charge.  Very minor issue.  I really didn't realize that the Special Offers would appear every time you turn on the Kindle.  I find it annoying and unattractive.  Does anybody know how to get rid of them?  I am sure others probably like the feature but I would prefer to just see a screensaver not an ad.", "Title": "I love the Kindle but do NOT like the Special Offers", "Date": "January 4, 2014"}, {"Author": "Fergie", "ReviewID": "R1Z0IZ1N4PMMTC", "Overall": "5.0", "Content": "This is a super-slim, lightweight multi-functional Android-based tablet. The screen resolution and color is dazzling.  Connect to the Internet, play downloaded games or music, read books, or take photographs or video - it does it all.My suggestion - buy an e-book user manual, install the Kindle Reader app for PC to your computer, and then download the manual to your computer (we bought \"The Kindle Fire HDX User Guide\" by Charles Tulley ($2.99)).  Take the time to read the user manual BEFORE you futz with the device.The Kindle Fire HDX is pretty intuitive..... any tech-savy teenager or twenty-something will figure out the basics in just an hour or so.  But, if you want to save yourself grief, read a user manual and find out how to do things correctly.  That way, you won't end up with a frozen or goobered device,  the result of doing something horribly wrong (like a bad sync with Windows Media Player).Users should also be aware of the re-boot process..... holding down the on/off button for a full 20 seconds;  it will back you out of many (if not most) problems that you'll encounter.Finally, bookmark the Amazon.com \"Help\" and \"Help Forum\" sites for Kindle Fire HDX on your computer.  The answer to just about any question, and solution to just about any problem, can be found on those sites.Overall:  Kindle Fire HDX 8.9\"......  it's just amazingly excellent.Final Thoughts:  You really need security software on any device that connects to the Internet.  We downloaded the free ESET Mobile Security app from the App Store.  If your Kindle has 3G/4G wireless capability, the ESET software also provides an anti-theft feature.  If your Kindle is only WiFi capable, consider the free Locked and Found (Geek Squad) app to remotely lock and help you recover your device if it is ever lost or stolen.", "Title": "Amazing", "Date": "January 3, 2014"}, {"Author": "CookieCocoChanel \"KMH\"", "ReviewID": "RVRMSHW51JAM", "Overall": "3.0", "Content": "My second kindle fire has 64GBP. I returned 1st one within the 30 days because of WiFi issues getting booted off constantly. It was not my WiFi. Amazon replaced it w/o a blink. Since this is my 1st kindle, I just love it. It's fast, presice, awesome resolution and takes pretty good pics! I own a Canon T3i so I didn't get this for the pics. I got it for the videos, shopping and,surfing net. I'd rather use this in my living room instead of my heavy Alien laptop. Resolution is beautiful, I love the quality of the overall kindle. The only flaw is the keyboard, I have a hard time typing accuratly. I guess ill get used to it. Besides I didn't buy it for writing a book.So far iove it! Battery is awesome. Since I'm a prime member it holds true to lasting 12 hours, and that's with watching movies, listen to music, surfing the web.If this would be your 1st tablet then get it!! It's awesome and easy to navigate !I will post an update in 2weeks. Oh, download time is fast as hec,  music transfer from pc is super fast! Not sure why people complain about downloading 1 movie at  time. Amazon has a boat load of movies to watch and download! Really? HowHow many movies can you watch at once??Since I fly across the country every month movie time is,awesome and reliable.Soon as I figure out how to add some pictures I took I will add them._________________________________________________________________________________________________________________________________________________NEW UPDATE----CHANGE 5 STARS TO 3 BECASUE OF CUSTOMER SERVICE ISSUES....________________________________________________________________________________________________________________________________________________AFTER RETURING MY 1ST TABLET BECASUE OF CONNECTIVITY ISSUES ON A REGUALR BASIS AMAZON REPLACE IT WITH A NEW ONE-SENT-AN EXHANGE. GREAT RIGHT!! WOOHO, GREAT INVESTMENT..UPDATE:JANURARY 16, 2014-PACIFIC TIME:AROUND 12:20AMI JUST GOT HOME AFTER A 10 HOUR FLIGHT. THIS WAS THE REAL TEST OF THE \"NEW\" REPLACEMENT. I WAS REGUARLY RENTING-BUYING MOVIES.BEFORE MY TRIP I DOWNLOADED \"RUSH\" AND A FREE PRIME MOVIE TO MY DEVICE-NOT CLOUD. SINCE I BOUGHT RUSH, IT WILL BE IN MY ON MY DEVICE.A FEW DIFFERENCE'S FROM 1ST-1- SPEED, IT SEEMED TO LAG, NOT AS SHARP FAST AS 1ST AND STILL GOING TO WIFI (NOT AS MUCH AS1ST ONE) SO I FIGURED I'D WAIT A BIT, SEE IF IT WOULD IMPROVE.WELL IT DID, ABOUT 60% BETTER, I WANTED 100%..SO I STUCK IT OUT. I JUST WANT THEM TO FIX IT-I TRAVEL TO MUCH AND I JUST WANT A RELIABLE PRODUCT---WATCHED RUSH AFTER DINNER-ONLY INTO 1 HOUR OR SO, EASTERN TIME, I TOOK A 20 MINUTE BREAK,WATCHED THE REST OF THE MOVIE. GREAT-AFTER THAT, TALKED TO THE GUY NEXT TO ME-BELIEVE ME, YOU WILL ALL GET THIS ONCE I FINISH THIS!!THE WANTED TO WATCH MY DOWNLOADED NO WAY BACK--WELL, I COULD OPEN THE MOVIE-I TRIED REBOOT 5 TIMES, LET IT REST, BUT SINCE I NEVER STARTED THESE MOVIES BUT FOR THE 1st TIME-IT SHOULD OF WENT SMOOTHLY...-FINALY FOR 2 HOURS NEITHER MOVIE WOULD DOWNLOAD!MAKE NOTE THIS WAS MY CONVERSATION TO THE AMAZON KINDLE SPECIALIST THE MINUTE I GOT HOME-QUOTE-THE MOVIE HAS TO RE-LICENSE ITSELF AFTER WATCHING MOVING..HUH? I DIDNT WATCH THE OTHER MOVIE AT ALL, SO THERE WAS NO REASON THE MOVIE SHOULD OF NEEDED THIS--AND THIS REPLY CAME BACK AFTER BEING ON HOLD FOR 1--15 MINUTES..ALL THESE EXCUSES!!!IM NOT HAPPY WITH THIS PRODUCT, I WANT MY $497++ BACK-NOP PER AMAZON-YOU CAN RETURN IT BUT I WONT GET ME MONEY BACKKK\"\"\"WHAT\"\"\" AMAZON REP ALSO STATED SOME OTHER RENEW LICENSE BULL.....VERY VERY UNAHPPY..I BET ITS IN THE MANNUAL NOW----OR SEND ME ANOTHER DARN ONE--IM TO0 TIRED NOW BUT I HAVE TO GET THIS OUT THERE.IF ANYONE IS EXPERIENCING ANY ISSUES PLEASE CALL AND TELL THEM!!!! IT DOES NO GOOD IF THEY ARE NOT WORKING PROBABLY AND THEY NEED TO KNOW..I HOPE THIS DOESNT HAPPEN TO ANYONE ELSE...STINKS.....ANY QUESTIONS I WILL REPLY, UPDATE TOMORROW..VERY VERY DISAPPOINTED AMAZON.I SPEND A LOT OF MONEY AND A PRIME MEMBER!!ONE MORE THING-WHAT'S REALLY THE DIFFERENCE IF THE SERVER IS ON PACIFIC, EAST, ICELAND, RUSSIA  ETC TIME?...JUST FELT LIKE I GOT THE BRUSH OFF... TIME--WHAT, PEOPLE WONT BUY THEM ON THE EAST COAST, OTHER COUNTRIES--______________________________________________________________________________________________________________________________________________LAST UPDATE--I JUST GOT AN EMAIL THEY WILL REFUND..ALL I WANT OS FOR IT TO WORK GREAT!! MOVIES, EMAIL, WIFI ...SHOP--ON AMAZON....  :-(", "Title": "MAJOR TECHNICAL ISSURE-FOR ME ANYWAY", "Date": "January 2, 2014"}, {"Author": "Jimmy C. Saunders \"Papa Smurf\"", "ReviewID": "RCG7OKIF0AD1Z", "Overall": "5.0", "Content": "Very pleased with it's performance. IT IS MY COMPUTER ON THE GO. Plus my entertainment at home and away. The panic button is the greatest thing since.certainly sliced bread. It and my hotspot GO wherever I go.", "Title": "Tht HDX is the  ery dinktium!", "Date": "November 30, 2013"}, {"Author": "J. Michelle Wynn \"Church Girl\"", "ReviewID": "R1J82R2BEHE8UJ", "Overall": "5.0", "Content": "Like it even better than the last kindle fire hd. The picture is better, the audio is better and a few more features. I HATE the case - they should have stuck with the last one - it's design was simple and easy to use. Love my kindle - hoping to find a better case.", "Title": "Happy with the purchase", "Date": "November 29, 2013"}, {"Author": "John N. Schëar \"cxxi121\"", "ReviewID": "RJZYARE80EKU6", "Overall": "5.0", "Content": "December 13, 2013 Update:In conclusion, this is the finest tablet I have ever had or used.  It is faster than any of the others.  It has a display unmatched by others.  The resolution is so good that I do not have to put my cheating glasses on to read the screen.  If the screen output is too small a little expanded pinch enlarges it.  All together usage boils down to needs.  While 16GB is fine now, I can see where it would not take too long to need 32GB and while I do not now have a need to use the Kindle for a phone it could very well be handy at some later date.  The cameras are far better than several dedicated point and shoot cameras I use although it is not quite as good as the Coolpix 820 but that's an unfair comparison.  The Kindle's internet is so much faster than my desktop and laptop computers are.  In short it is a growing element on each of us here and we thoroughly enjoy using it and its applications with a positive outlook for tomorrow's adventures.Original comments:I have had this Kindle for only a few days and I have found it to be better than I imagined.  It is fast.  It has beautiful resolution and it is so good that I do not have to wear glasses to read the written words or graphics.  It is light and easy to hold.  Battery life is better than many of similar size.  The front and back cameras do a surer job and with its High Definition output I was astonished at the quality of the pictures.Right now I am simply getting to know the Kindle and it is a pleasure to keep its company.  It pairs quickly with Bluetooth and connects faster.  WiFi works well and has not kicked me off yet.  So far I have used about 36% of the 16Gb memory and could easily exceed that unless I pay closer attention.I readily admit to being a dummy now; however, with continued examination and exploration I can see no reason to change my initial rating other than to find more of the internal goodies.  Amazon and its partners did its customers a fine service and presented to them the top tablet.  There may be other tablets that rate higher by one service or another but each that exceeds the Kindle Fire HDX cost a whole lot more and does not have flexibility.In a few days I will update this to include any additional observations and thoughts.", "Title": "TOP of the Line Tablet", "Date": "November 29, 2013"}, {"Author": "kevo", "ReviewID": "RXYT7CIGBX6JE", "Overall": "5.0", "Content": "I'm currently test driving the Kindle Fire HDX 8.9\" via Amazon's 30-day free trial.  Well, I'm definitely buying this because it has already exceeded expectations.  Set up was a breeze and I haven't had any issues web surfing and viewing media. The only problem so far has been how disruptive this technological masterpiece can be on time management - completely lost track of time while catching up on Season 3 of Downton Abbey in one day. Yep, Amazon Prime rocks!  This is an excellent product for the price!", "Title": "So far so great..", "Date": "November 29, 2013"}, {"Author": "Garrett", "ReviewID": "R3UUTHGWJ685NF", "Overall": "4.0", "Content": "I like the new HDX 8.9, very light weight, clear and bright screen, good on battery, great ecosystem.  Coming from a ipad 2 gen, and nexus 7 i do miss little things like folders, widgets, multi tasking.  For what it does it delivers.  If your a amazon customer or Prime memeber and have the money to keep spending on music, books, videos in the amazon market place then this is something you would like.  I am disappointed about the app selection.  It pales to the like of Android and Apple, I hope more developers will start to build apps for these tabs but we will see.", "Title": "Surprised by a lot it can do, disappointed a little.", "Date": "November 27, 2013"}, {"Author": "USer", "ReviewID": "R6JTFJZYNA05Y", "Overall": "5.0", "Content": "Excellent video quality and great to have on a plane with videos downloaded onto the device. There was a problem with getting the videos downloaded initially because it kept telling me that I had topped off my permitted 25 videos. The problem took 2 days to resolve. I think 2 days to resolve a problem is too long.", "Title": "Excellent video quality", "Date": "November 27, 2013"}, {"Author": "TC", "ReviewID": "R10XDFHF5U5CMD", "Overall": "4.0", "Content": "Pretty great device, especially if you plan on reading or viewing movies for long periods of time. The screen resolution is outstanding, and the light weight of this tablet makes it a pleasure to hold for hours. The software interface is very quick, and I really do not miss the Google apps too much, although it would make the tablet much more functional if you could load them natively (I am aware that some of the Google apps can be sideloaded, but not all of them work appropriately). Many apps that people complain are not available through the Amazon store such as Firefox can easily be obtained by downloading the apk file directly from their website.I do wish there were more Prime movies and shows available for offline viewing, but hopefully the selection will expand soon. I also wish that the speakers were louder. I tried out a 7-inch HDX and the speakers were obviously louder, but that blue haze around the screen borders drove me crazy.", "Title": "Very Satisfied With Purchase", "Date": "November 25, 2013"}, {"Author": "Pen Name", "ReviewID": "RC3ZDRNDT8646", "Overall": "5.0", "Content": "Excelent screen, thinner and lighter than others. It is a pleasure to take it anywhere. It is a good investment.", "Title": "One of the best choices in the market", "Date": "November 24, 2013"}, {"Author": "Kindle Customer \"Jo\"", "ReviewID": "RS59QYGYWFD2Z", "Overall": "5.0", "Content": "WOW!!!  Love, Love my new 8.9, WiFi, 32GB, HDX.  I have never owned any type of tablet or ereader but with the help of 2 free guides downloaded to my PC, I had  WiFi turned on, my email & facebook set up, and  downloaded 8 books from my PC wish list within 1 hour.  I used it for reading for approx. 6 hours and 75% of battery life remains.  I used the black background w/ white text and liked that screen view.  No glitches during set up or reading. Thanks to Amazon for an amazing product.", "Title": "Amazon hit a home run with the Kindle HDX", "Date": "November 23, 2013"}, {"Author": "Kellett A. Goodwin", "ReviewID": "RAH8O3XX53IPE", "Overall": "5.0", "Content": "I think that this product (Kindle HDX 8.9 in) is the greatest thing that I've ever seen and I'm sure that I won't be without the latest version again. :) Tony Goodwin", "Title": "Kindle Fire HDX", "Date": "December 4, 2013"}, {"Author": "michellevmcfall \"Michelle\"", "ReviewID": "R1GV44H0WLVZAF", "Overall": "5.0", "Content": "I chose the 5 star because since it was delivered I have had no problems with playing with it what is really great is that it's a sleeker smaller package what ever the games apps or books you got it came up on the cloud all I had to was touch it was downloaded the Camera works really great the front facing and the rear facing both it does what was promised.  Thank You Amazon", "Title": "The Kindle Fire HDX 8.9 64gb Love It", "Date": "November 27, 2013"}, {"Author": "Casey Reed", "ReviewID": "R3Q9T1Y9GGHT6A", "Overall": "5.0", "Content": "REALLY NICE !  Wow !  Not enough good things to say about the hardware. The confusion with any new platform has been well thought out by Amazon's tech team and owner who designed this tablet. Help is \"MayDay\" and live 24-7 Damn!What you can't find out that you need like subtitles on your movies (mpg4 - h264 ) files, is not a problem with VLC pro app to allow you to select available subtitles, and this app even goes on the internet to look for alternative subtitle files.Interfaces easily with PC and updates using WIFI quickly.Forget waiting when you turn it on: BANG !  It is on !  Quick as that it is on and you unlock the screen and there is the desktop or home with app icons ready to go on the internet, watch movies, listen to music, or see photos. Just a real high tech email checker for people who do not want to carry a laptop to stay in touch and be entertained.2.2Ghz Quadcore CPU makes this very high definition screen work beautifully !  Get enough memory now because there is NO card slot and you can NOT upgrade your memory later.Highly recommend as a PC builder and user.", "Title": "Fast High Tech Tablet - 1st Quality on the market !", "Date": "November 26, 2013"}, {"Author": "CSS", "ReviewID": "R52LF2Y4RUXAT", "Overall": "5.0", "Content": "Got mine Saturday! Estimated date was Monday, but it came early. I like under promise and over deliver! I had the 8.9 fire HD. I loved it. I did not like the button placement on the Fire HD. So that was my main reason to get the HDX. But man was i wrong! There's a whole world of better reasons to upgrade from the HD!Get the Origami case! When you slide the HDX up, which is seamless, the camera comes on automatically. The new OS incorporated every suggestion I submitted and many I never even though of. All of which have been positives for me.In a world of ever increasing pour costumer service and even worse product releases this product sets the standard. I mean to say that nothing less than this should ever be acceptable. Mayday Mayday Mayday!!! A product that works with great customer service being Sold Here!", "Title": "Mayday Mayday Mayday!!!", "Date": "November 24, 2013"}, {"Author": "J. Peter Jorgensen", "ReviewID": "R1WT8QP73NHP88", "Overall": "4.0", "Content": "I just purchased the Fire HDX 8.9 16gb from Staples last night for $329 - WHAT A DEAL!  I love this tablet and upgraded to if from a Kindle Keyboard e-reader.  I thought long and hard about how I would use a tablet and have very few issues with going into Amazon's \"walled garden\".  The only reason for 4 stars is the lack of Google Drive (Google Docs).  If I can sideload this and it works, I will change to 5 stars.  I don't care about the other Google Apps because the Kindle offers good alternatives for e-mail and calendar.  I also do not use Google Books or Music.  I purchased the 16gb model because I get all of my video entertainment from Netflix via streaming.  I am heavy into Kindle Books and keep most of my books in the cloud (keeping about 50 on the device at one time).  I downloaded FBReader for ePub books and may sideload Nook Reader because my wife is a Nook HD+ owner and may need access to her Nook library.  I do know about Calibre e-book management software but complicated books such as 3000 page bibles with thousands of internal links do NOT convert well from ePub to Kindle.The hardware is OUTSTANDING, the price at $50 off was OUTSTANDING and the \"Walled Garden\" is more of a nuisance and not a deal breaker at all.  With the HDX being so popular, ANY of my \"nuisances\" with be overcome from the EXTREMELY large HDX user community.The Kindle HDX is what the Kindle HDX is - it's perfect.  It's not Android, it's not Apple BUT, I can make it do EVERYTHING I need it to do while looking better then ALL the other tablets and at a lower cost.", "Title": "It is what it is...might even say perfect.", "Date": "November 18, 2013"}, {"Author": "C. Bowman", "ReviewID": "R122PH54V88Q7", "Overall": "5.0", "Content": "Received my new Kindle Fire HDX 8.9, 32 GB today, and am totally pleased with the improvements I see so far from the older version of the 8.9.The first thing I noticed was how much lighter it seemed.  The picture quality is crisper and the sound is very impressive.I sold my older version of the 8.9 and have been using the 7\" KF HD, but having the extra 1.9\" is awesome. I use my Kindle everyday for shopping, e-reading, watching movies and  playing games and I know this new version will give me more enjoyment especially with the rear facing camera.Amazon has listened to customers of previous versions of the Kindle Fire and have given us a tablet that will be hard to beat.  Enjoy!!!", "Title": "Wonderful!!!", "Date": "November 7, 2013"}, {"Author": "Richard Spafford", "ReviewID": "R23B1PGL5E3NWW", "Overall": "5.0", "Content": "I have only used the HDX for a few hours, but I've had every iteration of Kindle machines except the DX, and I think this is a stunningly good tablet. The weight of this tablet, as compared to the new iPad Air, for instance, is incredible. When you compare the two tablet's weight versus their volume, the HDX would be equal in weight to the one pound Air if it weighed 15.5 ounces. But it doesn't; it only weighs 13.1 oz!Thinness? The iPad air only has a two one hundredths of a millimeter advantage.The screen is just flat out brilliant. Watching movies and playing app games on this tablet is superior to everything else I own.The last thing I would add about the specs is that the more I use it, the better I like the size. I have a 10\" Nexus 10, a 9.7\" iPad, an 8.0\" Samsung Note, and a few 7\" tablets. For the combination of size, weight, and useful portability, I like the 8.9\" of the HDX best.BUT, the most important thing about this new Kindle tablet is the increased usability. It just flies through everything and all the moves I want to make are much simpler, more intuitive than the 8.9 HD. My various Samsung devices have massive tricks and features, and the iPad on the new iOS is interesting, but neither works as easily as the new HDX. The only device that compares favorably to this in usability is the pure Android experience on the new Nexus 7... but it came with touch screen weirdness.Finally on the \"pro\" side, my 64 GB cost $20 less than the iPad Air's 16 GB tablet, and their 64 GB cost is $220 higher.Cons? In general, while greatly improved, the browsing experience cannot compare to Google.This is a first look. As I go, I'll add.", "Title": "Incredible", "Date": "November 8, 2013"}, {"Author": "Ken", "ReviewID": "RRXL5KF6LD1ON", "Overall": "1.0", "Content": "I have had many issues with the HDX and WiFi since December. During a technical support call, their rep said that \"The HDX has been experiencing issues with connecting to WiFi in high-traffic environments.\"  Amazing Amazon, exactly what has been happening.  They sent me another unit to test.  Same issue.  When I pressed them to fix the issue (because I do not want to send it back), they said they were a \"customer centric company\".  I asked if they had looked at their own webpage and the 40+ pages of customer comments on the WiFi issue, the customer service rep would not validate.  But yet she said that they are a company that focused on reading and listening to their customers' comments and feedback.  Contradictory.  When I asked for an response, she said she would investigate and respond.  Here is their response ...\"I'm sorry, Amazon.com does not comment about rumors or speculative news reports. We haven't announced any plans to update the wireless capabilities on the kindle devices as there is not a known issue at this time. Furthermore, we cannot speculate or disclose information about what another customer may be facing. If you continue to experience wireless issues in high traffic areas, please contact our kindle specialists at 1-877-453-4512. I'm sorry I can't provide any additional information. We hope to see you  again soon. \"Sounds like someone from public relations or legal crafted this.  Always been a big fan of Amazon. Loved the Kindle. Want to keep it. Ordered many things from Amazon. But can't use it outside of my home (not in a 'high traffic environment').Now? Returning both kindles. Prime membership ending. No more orders to Amazon.Note to Amazon, if you wish to \"Build Earth's Most Customer-Centric Company\" ... then maybe your words have to connect to actions.  Transparency.", "Title": "Transparency and Honesty from Amazon", "Date": "April 25, 2014"}, {"Author": "Gina", "ReviewID": "R2T8Y2U32NYP12", "Overall": "2.0", "Content": "The Pros of this proucts were the size, weight, and feel. The 8.9\" was PERFECT for me. Not too big, but bigger than the \"mini\" tablets. The weight was super light and easy to hold, and the feel of it was great. The back was sort of rubberized which was nice. The display was beautiful and the sound.The Cons however, were too much to get over to consider keeping it. The product does not allow for much customization as far as wallpaper, screen saver, icons, etc. I couldn't put things where I wanted them. I also was not happy with the operating system itself. It was almost too user friendly. The system ran quickly, but just not \"up to par\" with other current systems out there. I have a Samsung Galxy S4 phone, and couldn't stop comparing the two. My biggest complaint though, is that is does not allow many of the most popular \"normal\" apps available. I was aware before purchasing that they did not have the vast amount of apps as on Google Play or the Apple store. However, I couldn't believe that I couldn't even download Dropbox! One of the main reasons for getting a tablet was for me to put work files on it when I travel. I was going to use Dropbox for this. I couldn't do it! They also have blocked most Google branded apps. So it did not sync well with my Google accounts. They had a gmail app, but it wasn't up to date with the newest style so things would look different from my phone to my tablet.Overall, just very frustrated with the Operating system setup, look, and the lack of apps. Also annoying that you have to pay extra to REMOVE the ads! I had to return it. I ended up buying the brand new Samsung Tab Pro and LOVE it. The size is a tad smaller and weighs a BIT more, but It is much more \"modern\" and works so much better! The Tab Pro was also cheaper and allows me to add a memory card if I ever need it!", "Title": "Very unhappy!", "Date": "March 12, 2014"}, {"Author": "spuds366", "ReviewID": "R1YSSUVNZU4VDK", "Overall": "5.0", "Content": "My husband has his I-pad and I would put my Kindle against it any day! He has been put through the rigor after calling customer service and was amazed at the mayday option on my HDX. To bad so sad for him, it's mine all mine and he knows to keep his I-pad and stop hating LOL", "Title": "Love My Kindle Fire HDX", "Date": "January 9, 2014"}, {"Author": "MickeyJoe", "ReviewID": "R3QIQDZAVPNENP", "Overall": "5.0", "Content": "Amazon Prime + Amazon Fire TV + Kindle Fire HDX = :-OI have the very first 7\" Kindle Fire from 2011, and it still works perfectly.  I got the Verso Marrakesh Genuine Leather Cover for that, and love it so much.  It has worn around the Kindle and looks like a well worn vintage book.But with the new Amazon Fire TV, and loving it, I decided to go all out an upgrade to the larger 8.9\" HDX, and so glad I did.  The interaction between the two is awesome.  I love the screen swapping and basically using the Kindle as a remote.  The \"second screen\" is awesome when watching movies and tv.  Since Amazon owns IMDB, it literally pops up information on each actor as they appear, as well as various info in all scenes.  Like a non-intrusive commentary.  No more \"who is that actor\" as you just look at your HDX and there it is.Since 2011, I have collected thousands of free apps via Amazon's app store.  They give at least one app away free every day, so the value of the apps I have make it well worth the investment to get the largest storage available of 64GB.  But I love being able to listen to my 51,000 songs stored on my Amazon Cloud and listen on the Cloud player taking no device space at all.All apps and functions are blazing fast and quite a jump from my 2011 Kindle Fire.  I also have Apple's iPad, iPhone etc.  But the HDX is all about the Amazon experience for me.  I'm quite embedded with products and services by Amazon, and you cannot beat their customer service.  Which I have to also say that the HDX customer service feature called MayDay is quite amazing.  When setting it up, I had a question, and you click MayDay and an actual person appears on your screen.  They can see your screen and help you with anything, or show you features right in front of you.  They talk you through it, or you watch how they do it.  All while seeing who you are talking to in a video box in the corner.  They don't see you, but it would be an interesting option.I have the HDX on all day.  Either on stand-by or full use, I get a full day of use at home or travel.  I would say at least 10-12 hours of use.  I just charge when I go to bed.  I feel like I use the Kindles more than my iThings, but both serve different needs.  However go all out and go for it.  A great investment.  Sure there will be something new around the corner, but you know that this is still going to be working years down the road.  Quality product and customer service.  Priceless.", "Title": "Jump into Amazon's ecosystem full-force with HDX!", "Date": "May 15, 2014"}, {"Author": "VicChik", "ReviewID": "R2PQOA1KSPIFZT", "Overall": "5.0", "Content": "I had been wanting to try the new Kindle Fire HDX and finally I did. WOW.  I also recently bought a new laptop.  My laptop sits.  I carry my Kindle everywhere I go.  It's so light--like carrying a small book but the things this little package can do.  The graphics is excellent. Its very easy to use.  But perhaps most of all, the customer service rep at the touch of a button is nothing short of genius. I just used it and am so impressed.  Super fast response and fixed my problem right a way with a personal phone call.  It's unheard of.  Today when personal customer service is nearly a thing of the past, Amazon sets yet a new standard.  Hats off and many many kudos to Amazon for a great product and THE BEST customer service anywhere.  Without question, I would recommend this product  . If you want to give someone something special, definitely consider the Kindle Fire HDX.  They will love you for it.  I wish I had bought my Kindle Fire first and not the laptop.", "Title": "Absolutely brilliant!", "Date": "April 22, 2014"}, {"Author": "LaWanda J. Taylor", "ReviewID": "R3FPJZRJ04LQJP", "Overall": "3.0", "Content": "I like my previous Kindle better for screen quality - there is too much glare on the screen to make it easy for reading.  I am sure I will like it for the other functions it offers but since I am an avid reader, I will be using my other Kindle more.", "Title": "I find display screen lacking", "Date": "April 22, 2014"}, {"Author": "Mark m", "ReviewID": "RPMKSM2AYWYES", "Overall": "4.0", "Content": "Very happy with the fire hdx. it just needs a sim card slot. an ability to plug in a card reader would be nice", "Title": "missing one thing", "Date": "April 19, 2014"}, {"Author": "Tilaran Rita \"Rita\"", "ReviewID": "R14AYQHC01LBRF", "Overall": "5.0", "Content": "I did all the research and it was everything I wanted it to be.  I need to take advantage of the online support because I haven't figured out how to take advantage of all it's abilities.  And I don't know how to organize my book collections yet.  It's totally different from the system I was used to in my old Kindle, which still works beautifully, it's just a dinosaur.  It takes a while to get used to the gorgeous display after my black and white.  Love my Kindle.", "Title": "Everything it was expected to be.", "Date": "April 18, 2014"}, {"Author": "A. R. St Jean \"ARS\"", "ReviewID": "R8J67VYZAI5B2", "Overall": "5.0", "Content": "This is a great product. It replaces my first generation fire. So far I have found the performance to be perfect, great visual characteristics and great sound from such tiny speakers. Highly recommend.", "Title": "Dynamite", "Date": "March 2, 2014"}, {"Author": "ankitkat", "ReviewID": "R2M37WPY7GLJAV", "Overall": "4.0", "Content": "Positive -Really Good Display.  Excellent for Reading Books, Magazines and PDF files . Very Light and thin. Awesome  Battery life and quick charging put this device ahead of iPad. I bought it because of these positive points only.Negative -Crashes very often while reading TIMES or NAT. GEO. magazines ,specially running videos or reading from in build pop up functionality of magazines. Very poor web browser compare to iPad Safari or Android  Phone Browser.  No GOOGLE apps .Yes you read it write - You cannot find Google Apps in Amazon App store.In Sort, If you are fan of Amazon content , just go for it. If you are looking for android tablet , please search fro Samsung Galaxy Tab. :)", "Title": "Four Star - Excellent for Reading , Poor for Tableting", "Date": "January 13, 2014"}, {"Author": "Gregg C. Michael", "ReviewID": "R2HWE3SNKTVDYP", "Overall": "5.0", "Content": "I have waited a long time for a product to please me and it is fantastic. Plus I have never found something so user friendly.", "Title": "Love this damn thing!", "Date": "January 8, 2014"}, {"Author": "J. S.", "ReviewID": "RQ4HUMVPCJ2IA", "Overall": "4.0", "Content": "There is a problem with the camera when in the case (with camera hole - purchased on Amazon), the forward facing camera is used a big logo appears in the view finder that states 'slide camera up to take picture'.  Now why in the world should I have to take the camera out of the case to take a picture?  This type of issue requires a software upgrade or fix.  The picture still takes, but it make is impossible to focus in on something.  I have seen on blogs where others have this problem also, and I know someone who has a different 3rd party case - purchased on Amazon with the same problem.  Come on Amazon - you have a great product here - now come up with a great and easy solution to fix this, or my rating may go down - I'd like to make it 5 stars.  Thank you.", "Title": "Love the new Kindle - but...", "Date": "January 8, 2014"}, {"Author": "Beth A. Sokol", "ReviewID": "R2LT7WFLEC40N3", "Overall": "5.0", "Content": "Finally, I got this for Christmas.  Absolutely love it so far.  Beautiful screen color and clarity.  Just the right size.  Still figuring some things out yet.  Gaming on the HDX is impressive.", "Title": "Merry Christmas to Me...", "Date": "January 8, 2014"}, {"Author": "alanm32", "ReviewID": "R1ON49HN2CU59A", "Overall": "5.0", "Content": "I will make this short, to the point and focus on what I feel really matters.  Starting with the display, It is as advertised sharp with  great color and contrast. Next the kindle is fast, it has a Quad-core 2.2 GHz Krait 400 which in conjunction with a fast gpu (Adreno 330)  provides outstanding performance whether your playing games or general computing.  To sum it all up, its very light very fast great display and very good battery life.  Prior to the most recent update it would occasionally reboot by itself.  Since then  I have had  and no operating issues AT ALL.  I have owned it since 11/13.  Great Purchase.", "Title": "Great Choice", "Date": "January 8, 2014"}, {"Author": "kd \"Kathezplc\"", "ReviewID": "R24HK2S6ZCKB5Z", "Overall": "5.0", "Content": "I Have Enjoyed each day I have had this New 8.9 HDX. I have the smaller 2012 7\" HD from last year, which I was thrilled with.However I had wished I had the larger screen. My Family surprised me this year with The New HDX 8.9.I Love the larger screen of course, the clarity and Beauty of this screen is Amazing. Sound is also improved. As far as how quickly my New Kindle works it moves its faster than my last years model. I do have occasional issues with my Wifi and not a Kindle issue. We know this because in another home works great with no issues.  So I have to go into settings and turn off my wifi for a second and turn it back on, ususally works fine.  Some of you who blamed your kindle might look at your Wi Fi connection. Does this bother me No....usually takes care of its self quickly.This time around I don't have the little annoying advertisements, that was a sweet surprise.Have not had to use the help button. It is wonderful to know that I have that option.  There are changes, some of your Apps are in your cloud & take a few minutes to download to your new Kindle. Frankly I thought this was nothing to get excited about. Though some found it insulting. I found that some Apps can stay in the cloud. Music, books, games, etc....I can get them anytime its not an issue.This Kindle is So Light, and thin its like air.  It also takes Beautiful front and back pictures, & Movies.  Also if you are like me you will need a Nice case to keep you New Kindle protected. Just read the reviews or the general feel of them. I chose one made by Amazon for the Kindle. I works very well. To each her or his own likes for that.So now I have read a lot of reviews, many people find issues with everything.  I am not techy enough to rate it item to item.I can tell you the HDX is a Beautiful improvement from last years Kindle HD. I have not compared it item by item. I can say its thinner, Lighter, Screen is just Stunning.......and that was comparing it to family memebers I Pad, and that is what they said as well.So I would say do your homework (as someone said) then follow your way to the New Kindle HDX 8.9Really don't think you will be disappointed. I certainly am not. Our family bought two at the same time. Although these gifts are at different homes, we keep in touch comparing things. Both of us can not say enough about our new Kindles.Great Job Amazon, Another Winner!  Enjoy", "Title": "Kindle Fire HDX 8.9\"", "Date": "January 8, 2014"}, {"Author": "Alan", "ReviewID": "RNNVDXABQRFTN", "Overall": "5.0", "Content": "I really like the 8.9 HDX. The build quality is excellent,  the OS enhancements are well thought out, and the processor is fast. And of course the screen resolution is incomparable. This table meets my needs and I think Amazon has done themselves proud.", "Title": "I love this device.", "Date": "January 7, 2014"}, {"Author": "richard", "ReviewID": "R1XM7X411D2ASY", "Overall": "4.0", "Content": "I give this unit a 4 because the opportunity was there for kindle to have had it built with a sd-slot card capability,, they choose not to, this would have made it perfect.  rick, in Cincinnati", "Title": "the last step could have been taken", "Date": "January 7, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R3Q2QFVYFBZ7Y0", "Overall": "5.0", "Content": "Just received my new Fire HDX 8.9\" (about an hour ago) and am still exploring it, but I have made one discovery that I can't wait to share.Collections are back!!The ability to organize my books into collections has been the thing I have missed most since going from Kindle Touch to fire.  Even my iPad, which is slowly losing it's mind but the Kindle App still works, doesn't let me organize my books into collections, but my new Ire HDX does.I actually bought this kindle to use as a tablet since my old iPad has been going senile and losing things.  I figured since the Kindle app still worked, I would simply use it as an eReader with a larger screen.  It's still good for that and I may give it to my granddaughter, but I have nearly a thousand books and finding a particular one can take ten minutes.No more long searches.  Collections are back.", "Title": "I Can Organize My Books Again!!", "Date": "January 7, 2014"}, {"Author": "Walter F. Baranowski Jr.", "ReviewID": "R1T42X2TA8Y7L0", "Overall": "4.0", "Content": "It is so easy to read and all the great app.,  As a 79 year old I found easy and you always have help", "Title": "My new Christmas present", "Date": "January 3, 2014"}, {"Author": "Dawn R", "ReviewID": "R2FKE5HEIFJUJL", "Overall": "5.0", "Content": "I LOVE THIS KINDLE. I HAVE ONLY USED FOR EMAILS AND READING BUT I JUST LOVE IT. I DIDN'T RECEIVE MY SPECIAL OFFERS SO I AM NOT SURE WHAT THEY ARE OR WERE. IF YOU ARE ON THE FENCE ABOUT GETTING A KINDLE GO FOR THE BIGGER SCREEN AND HDX DISPLAY-GLAD I PICKED THIS TABLET OVER ANOTHER BRAND.", "Title": "KINDLE FIRE HDX 8.9", "Date": "January 2, 2014"}, {"Author": "Good Guy", "ReviewID": "RY4SLXFML7EEV", "Overall": "5.0", "Content": "I researched tablets heavily and eventually decided on the Kindle HDX. All features that I saw in most tablets work seamlessly and quickly. The immediate definitions while reading is a big plus. The only downfall, which may or may not be unique to the Kindle, is it had very poor connectivity to my Wi-Fi. I had to buy a stronger router, but that fixed the problem.I would recommend this.", "Title": "Fabulous tablet", "Date": "January 2, 2014"}, {"Author": "Diana Fournier", "ReviewID": "R3QRU6Q1L32LW5", "Overall": "5.0", "Content": "This is our sixth kindle fire in the household and I'm in love! I love the larger screen, dual cameras, best present from my hubby I've gotten in awhile! I didn't originally think I needed am upgrade from the original fire hd but I'm glad he did!", "Title": "wonderful again Amazon!", "Date": "January 2, 2014"}, {"Author": "fifthzepin", "ReviewID": "R1LGEVX9UM7TS9", "Overall": "5.0", "Content": "I've had a Kindel Fire for almost 3 years. I have been considering a purchase of a tablet or another Kindle. I finally decided to make the jump and purchase the new Kindle Fire HDX with the large screen. I am so pleased, what a wonderful thing.....I loved my old \"Fire\" but this 8.9 display is just perfect. I also purchased the case at the same time and didn't know if I'd like it but the origami case is great, glad I took a chance and choose it.I was on my old \"Fire\" almost everyday, this beautiful new HDX 8.9 took up where the old left off and soars higher.Go ahead, jump, you will not be disappointed.", "Title": "What's not to LOVE", "Date": "January 2, 2014"}, {"Author": "Rafael Olivo", "ReviewID": "R1NCSCVK197OAF", "Overall": "5.0", "Content": "The images are crisp and beautiful, no pixel distortion even in shadowed areas of images. Movies run smoothly and internal speakers have reasonable fidelity. Book and magazine reading offers excellent features. Allows to highlight sections, take notes, look up definitions automatically in dictionaries and Wikipedia, connects you on-line with a word or phrase selected. Mayday button was used once for help locating a file and the response was immediate and very helpful. Battery duration even with constant usage is dependable.", "Title": "highly recommended", "Date": "January 2, 2014"}, {"Author": "lyn", "ReviewID": "R3RNKVNXABKOAP", "Overall": "5.0", "Content": "I bought the 32 gb  8.9 HDX . I have only used it about a week.  So far I am impressed with the speed of it.  The screen is awesome.  I am so happy I checked out all the other tablets for months and finally decided on this one!  I have downloaded free movies from prime and watched them recently.  Borrowed a book on it from my local library and bought a couple books on Amazon.  Got some games on the app store and the graphics are excellent.  So far I really like everything about this tablet.  However the Mayday option does not work on mine, it takes me to a help page with a picture of a sad dog that says sorry this link is no longer here.  Anyone know how to get this function to work?  I'm not sure why it doesn't,  but I'm still going to give five stars because I'm really enjoying this.  This is my favorite tablet I've had so far.", "Title": "my Mayday doesn't work,  but i really like everything ether about this tablet!", "Date": "January 1, 2014"}, {"Author": "DesertFey \"DesertFey\"", "ReviewID": "R23885M4L7NXXY", "Overall": "3.0", "Content": "I am on hour TWO with a THIRD person trying to get items from my 'yourMediaLibrary' up to the Amazon Cloud so I can then get them to my new Kindle.  Really loving the Kindle, but if Amazon can't get stuff to the Cloud that I have purchased over the years, I'm going to return it and go with another tablet.  I specifically bought the Kindle to start using their highly hyped Cloud availability.  If I want to sit around and transfer Amazon purchased items to my Kindle from my computer, I think I'll do it with another tablet.  Still sitting here waiting for help...... Cannot believe that after the first Mayday call (pretty cool feature) that the second person went off and then disconnected.  NOT happy with the help (all very nice and sorry about everything) but lets get this Kindle and YourMediaLibrary connected.  Two and one-half hours.............not how I wanted to spend New Year's Day on my Kindle.", "Title": "Kindle Help - Now at hour two", "Date": "January 1, 2014"}, {"Author": "Nancy Gilliam", "ReviewID": "R2I8Q5I2K6QDIV", "Overall": "5.0", "Content": "This is our 5th kindle.  All have done what they were designed to do and do it well.  We use Amazon a lot and this works for us.  It is great to not have to purchase our books, movies & apps again. We just downloaded them to our new Kindle.  I will not repeat to much all the good things others have said.  Now I have seen a common complaint about goggle apps, not being able to load. This is a none issue.  It can be done. Just check the internet.  I do it all the time.  I had to do a factory reset when I was trying to down load 2 movies, 10 books, 3 songs and about 15 apps all at the same time..  My books would not stay open. I pushed the Mayday button & was able to get straightened out.  It was great.All the tablets are great.  This one is one of the best out there.", "Title": "Another great Kindle", "Date": "December 31, 2013"}, {"Author": "Paulette J. Perez", "ReviewID": "R1VC75SXNTO8ZQ", "Overall": "5.0", "Content": "I am still learning it but I really love having my new Kindle. It is really great and I will continue checking out all it's really great things.", "Title": "Love it !", "Date": "December 31, 2013"}, {"Author": "Tracy", "ReviewID": "R3AMTI3JAU7YCQ", "Overall": "5.0", "Content": "Can't wait for new apps to come but love what I have!! Video and audio quality are out of this world", "Title": "Love it!!", "Date": "December 23, 2013"}, {"Author": "Sonya Mosley", "ReviewID": "R1Z24CA1FCFTXG", "Overall": "5.0", "Content": "best thing I ever bought. Very good product I would buy again. I haven't had a problem with it yet. I love how music plays on it, download speed is fast. taking pictures  is quick and easy.I love my kindle", "Title": "I love my kindle", "Date": "December 23, 2013"}, {"Author": "tracy", "ReviewID": "R19Z9A2ZDHZ7IU", "Overall": "5.0", "Content": "Really enjoyed the kindle fire, very user friendly.... Initiative, great display and fun to use. Definitely going to be buying one... Love how my books sync with each device.", "Title": "Loved the kindle fire hdx!", "Date": "December 22, 2013"}, {"Author": "Kris", "ReviewID": "R3BV1PVABTZQ76", "Overall": "4.0", "Content": "Got the free trial offer it was really hard to give it up but Xmas was around the corner. This is by far is the best Kindle ever.", "Title": "GOT EVEN BETTER", "Date": "December 21, 2013"}, {"Author": "Susan L. Kaul", "ReviewID": "R6UTU3BPJE957", "Overall": "5.0", "Content": "I love this Kindle fire I had the original Kindle fire before the screens started getting so fancy but now the HDX is unbelievable it is so fast I have never had a computer online more fast than this thing it also has the crystal clarity of  beauty on every page. I love it ! also picture taking is unbelievable it's the best I I just can't believe how many improvements have been done to it", "Title": "Top of the line", "Date": "December 14, 2013"}, {"Author": "Anne Mummert", "ReviewID": "R21W65KLFS131T", "Overall": "5.0", "Content": "I'm not a gadget girl so I'm slowly finding my way around my new Kindle. Was able to take and email a photo yesterday.Only critical thing I've found thus far is not being able to personalize your screen. Don't particularly like the mechanical images selected. Ok. I'm a girl and NOT mechanical. How about some beautiful beaches, mountains, flowers, dogs or kittens?!", "Title": "Love my new tablet", "Date": "December 14, 2013"}, {"Author": "Sergio Basilides Pascual \"Basilides\"", "ReviewID": "R16DFU2L86FZK0", "Overall": "5.0", "Content": "First time entering the world of Tablets. I advise a lot, and all they said Sansung and Mac, I decided to go for Amazon, and I was not wrong at all, fast, friendly and easy to operate. I gave it to my wife, I want to have one for me. My compliments.", "Title": "DO NOT HESITATE, BUY IT", "Date": "December 12, 2013"}, {"Author": "Gandalfe", "ReviewID": "R3A3OI878R34KD", "Overall": "5.0", "Content": "Wow, okay I'm biased, but wow. I use this device at least two hours a day on my bus commute and people now rely on me for certain kinds of research. With the 4G this is blazingly fast. The video is stunning and the speakers surprisingly good considering the small form factor. I also really appreciate that the battery last longer, the device is lighter than my HD, and the rear-mounted camera is very nice.", "Title": "And the winning tablet is ...", "Date": "December 11, 2013"}, {"Author": "Sweets Ervin", "ReviewID": "R15H1YJLA05VZX", "Overall": "5.0", "Content": "I absolutely  love  this Kindle, Mayday  is  always  so helpful, I currently  own  the Kindle Hd  and 1st  generation.  If  this  one  would  have  came  out  first,  would  not  have brought  the  other two.  This kindle  is  thinner  than the iPad 2, a little  smaller  but  side  by  side,  you  really  can't  tell  the  difference. If  you  own 2  Kindles  and  read a  lot,  once  you  put  one  down and  pick  up  the  other  one,  it  takes  you  to  that  location.  This  wasn't  something  mentioned  on  the  website  but  an  added  bonus,  just  wanted  to  share.", "Title": "Kindle 8.9 HDX", "Date": "December 11, 2013"}, {"Author": "John J. Beeler \"JB\"", "ReviewID": "R2K2O59AJFXTTM", "Overall": "5.0", "Content": "This year I switched from my Nook HD to the new Kindle Fire HDX 8.9 and love it.  It is super easy to use and super fast.  I even used the Mayday button on my first day and had my question answered immediately, by a friendly tech.  He was very helpful.  So glad I made the switch.  I even used Amazon Prime many times and amazed how fast I receive my purchases.  I will recommend the Fire HDX 8.9 to all my friends!", "Title": "Using and loving it!!", "Date": "December 10, 2013"}, {"Author": "Barbie Mitchell", "ReviewID": "RN8Z5IBCFZ4S6", "Overall": "5.0", "Content": "This was everything I hoped for. My birthday and Christmas gift in one.This is my third Kindle. We have become a kindle family.", "Title": "Absolutely love it!", "Date": "December 10, 2013"}, {"Author": "Eleanor Hufnagel", "ReviewID": "R1LKM5O1MBY8I6", "Overall": "1.0", "Content": "I originally chose the kindle fire HDX because of their claim of being lighter and better screen resolution  It's delivers in that respect but  fails in so many others.  WiFi is sketchy.  Apps (only a fraction of available apps compared to apple or android market) don't load and I've spent hours watching a spinning circle.. I have  high end router and although it says my connection is \"excellent\", nothing is smooth.I've had to boot from factory settings several times and the help screen unfortunately is staffed with folks, that are nice but not very knowledgeable.  I keep getting kicked up to the next tech over and over with nothing solved.  I regret this purchase.", "Title": "Big disappointment", "Date": "May 3, 2014"}, {"Author": "Missus  B", "ReviewID": "R3TAR9J6Z275PY", "Overall": "5.0", "Content": "I'm pretty sure that it doesn't get any better than this. This kindle does everything I want and a whole lot I probably haven't discovered yet. The picture is clear as a bell and it's lighter than my older 8.9\" HD. It has easy to use functions and apps and if I get hopelessly confused I have Mayday, or chat or the web for help. I use it every day for just about everything but phone calls and texts. My husband is also ecstatic that I bought this one, although I have to say he has an ulterior motive; I gave him my old one! I think that secretly I want to be a \"tech junky\" and this lets me feel like I am. I would very much recommend this to anyone in the market for a tablet that isn't looking to use it as a laptop substitute using large software packages. It has the best of all (that it was designed for) and I'm happy as can be with it. I can't speak to the inner specifications as I know little about that stuff, I only know that I am totally satisfied with it and believe that it was worth every penny I paid for it.", "Title": "I love this kindle!!", "Date": "February 1, 2014"}, {"Author": "SingleMommy", "ReviewID": "RBLH19AQJKELM", "Overall": "5.0", "Content": "My wife got me the Kindle Fire HDX 8.9\" for Christmas.  It is my first tablet.  I really like the way it works, its' speed and the quality of the product.  I am not an Apple fan.  My wife has an iPad and I like mine much better.  Apps are great.  I especially like the Bloomberg free app.", "Title": "Beats iPad hands down!!!", "Date": "February 1, 2014"}, {"Author": "SF Reader", "ReviewID": "R1KTG9X15E2NUN", "Overall": "3.0", "Content": "I bought this after reading great reviews about this. Here are my key issues with it:Cons:a) HDMI connection not available - you cannot connect this kindle via an hdmi cable to a TV for instance. To mirror the screen you have to use Miracast. The equipment for that costs another $50 and hasn't recd. good reviews. Perhaps I should have read the reviews more carefully? I just assumed that this option would be available.b) Silk browser - very unstable. It appears to be a known issue. I now use Mozilla (was unable to download the Dolphin Browser)c) Slingbox not supported - I am unable to see my TV remotely as Slingbox doesn't support it.Pros:a) Mayday - great feature. Responsive teamb) 4G  connection seemed pretty fast - however if you run into issues and call your phone company they don't know how to troubleshoot stuff as they dont' have much of a database/knowlege regarding the new kindle yet.", "Title": "Underwhelmed - certain key features missing", "Date": "January 29, 2014"}, {"Author": "Judi Green", "ReviewID": "RNIXQLPVGKIWM", "Overall": "1.0", "Content": "I have had to shut it down way to many times just to get it to work, I only had to do that with my other Kindle fire once. This froze on me and I had to get on my computer to get help well what if I didn't have a computer where would I be. I'm not to happy with it.", "Title": "To many problems with it", "Date": "January 28, 2014"}, {"Author": "durward Smith", "ReviewID": "R24PP690ERYQ3B", "Overall": "1.0", "Content": "The Kindle Fire HDX is designed to promote sales of other merchandize for Amazon.  It is limited in its use, and not at all what I expected.  I wanted a small device where I could archive Word documents and Power Point files.  I did not want to buy books or movies, or be inundated with adds.  I wish I would have bought an Apple or Windows device!", "Title": "Kindle Fire HDX", "Date": "January 28, 2014"}, {"Author": "Aquaman", "ReviewID": "R1ACVWY365OHT3", "Overall": "5.0", "Content": "Just upgraded my Kindle Fire for the new 8.9\" HDX. Totally worth the money, especially since Amazon offered to upgrade with installment payments for the new model. I like the larger screen and the camera was a great addition. I use it all the time, I recommend joining Amazon Prime too. Tons of movies and TV shows. I also am an Audible book club member. Listening to books on the train is great. I hardly get a chance to read anymore so Audible is terrific. All this entertainment in such a compact, portable device is amazing. I take it everywhere. Thanks Amazon!", "Title": "Loving my Kindle Fire HDX upgrade, thanks Amazon!", "Date": "January 16, 2014"}, {"Author": "Boo Radley", "ReviewID": "R2Y2FW01SUAHB8", "Overall": "4.0", "Content": "Bought this to replace my iPad – had high hopes for it, think it has some great features, and really wanted to give my money to Amazon rather than Apple.  I think it’s a great device for a first-time tablet owner, but ultimately I think it falls short as an IPad replacement.I have first generation iPad that has become virtually unusable. There is nothing physically wrong with it – it just crashes continually because its memory can’t keep up with “advances” in operating system and apps since I bought it three years ago.  This problem plagues earlier generation iPad’s and Apple’s response is “EOL” – the device is end-of-life and they won’t support it; buy a new one if you want one that works. I think Apple meant “SOL.”Not enamored with this attitude, I looked for an alternative and thought I had found one in the Kindle Fire HDX 8.9. Great specs, beautiful display, most of the apps I wanted  (I thought) in the Amazon app store.  And cheaper (although it is a little smaller). And I think Amazon’s a great company so I ordered one.The display is beautiful, and it was a huge pleasure to watch video on the device. I like my viewing on a big screen and never watch much on a tablet, but I had a bunch of waiting-around time the weekend I got the Fire HDX and binge watched some shows from Amazon Prime (Luther, Sherlock, Alpha House). Download was easy, video was terrific, and though I originally thought it was just a gimmick, I LOVE the X-Ray feature on the Fire HDX. Sound is good, too, although I mostly used headphones.I also love the cursor control when typing text on the Fire. A slider appears under the text box that lets you precisely place the cursor for editing, much easier to use than Apple’s.The device was snappy, but not eye-wateringly fast, as I expected upgrading from the original iPad.I don’t use a ton of apps, and before I bought the Fire I checked that a couple I use regularly on the IPad were available for the Fire in the Amazon App store. But being available doesn’t mean they’re the same. For example, on the iPad I have the paid version of Words With Friends, but the only one available for the Fire is the ad-based version, which pops up an ad after every move. It also sometimes  will not let me escape from the ad without exiting the app.  Very annoying, and I would be willing to pay a couple bucks for the upgrade, but it’s not available. I also use Zite (an online magazine) quite a bit – again, the Kindle version looks different (not a big deal) but also frequently hung up when I tried to play video from within the app.I also surprised to find the lack of customization available on the Kindle. Really, I can’t put my kids’ picture on the home screen or lock screen? I can’t put shortcuts to web pages on the home screen? Well, maybe I can do that, but if so, I have no idea how, which brings me to another point of frustration – finding information on how to do things on this device.As far as I can tell, all Kindle devices come under the same user forum on Amazon. Whether you’ve got an original Kindle, an HDX, or any of the e-reader and Fire devices in between, all the discussions are in one big lump. Makes for a lot of wading through irrelevant material to find what you need. For example, I was trying to figure out how to put a bookmark to a website on my home screen, so I could just tap that icon and go straight to that webpage, rather than firing up the Silk browser and then navigating to the website. Can I do it? I don’t know. I found instructions on how to do this, but they were for an earlier Fire tablet (or browser version?) and the instructions didn’t track to what I was seeing on the HDX. Eventually, I gave up. I also gave up on finding a comprehensive user manual for the device – the only one I could find on Amazon was a .pdf of the quickstart guide, and the “User guide” on the device is almost as bare bones. Yes, I could have tried the Mayday feature but I really don’t want to fire up an A/V connection and talk to someone every time I have a question about the device.Ultimately, the tablet didn’t do – or didn’t do as well – some of the things I was used to doing on my IPad, and the time I was investing in figuring all that out just wasn’t worth the price difference between the HDX and the iPad. So, hating myself, I reluctantly bought an iPad Air and am returning the HDX.If this were my first, tablet, I think I would be very happy with it. In fact, we bought a Fire HDX 7 for my 11-year-old and she loves it. But for me, it was not an adequate replacement for my iPad.", "Title": "Reluctantly Returning this Very Good Tablet", "Date": "January 16, 2014"}, {"Author": "ecojackie \"ecojackie\"", "ReviewID": "R22NQRZM1R338N", "Overall": "5.0", "Content": "I bought this device for my wife who was in the market for a computer. The advances of the HDX give it nearly all the functionality she needs to research, surf, watch media, and write. The form is outstanding, it is light, and faster than any other device we own. Bravo Amazon!", "Title": "The best thing since sliced bread!", "Date": "January 9, 2014"}, {"Author": "blue boy", "ReviewID": "R2XCBNOVAU54Q5", "Overall": "5.0", "Content": "This is my first tablet and i'm still learning how to use it. It is very lightweight. The screen is a good size and the color is amazing. I had to use mayday twice and the second time i could not hear the mayday lady and my sound was on but she does come on fairly quickly. I will update later when I learn more. My grandaughter is helping me. Got the 32 gig. don't know if i will need it but I got the tablet with a special on paying it off in installments so i went for  the 32 instead of the 16. Love taking pictures and sending them to FB. The sound is very good also. I did buy a cover for it which makes it quite a bit heavier but i think you would need one to protect it.", "Title": "kindle hdx8.9", "Date": "December 29, 2013"}, {"Author": "L. Guzzo", "ReviewID": "R37R0TF548R7BG", "Overall": "5.0", "Content": "Resolution is fantastic.  Started using the front camera.  Takes excellent pictures but a little unweldy to hold for a long period of time.  Connects with internet very quickly.  Had an opportunity to use the Mayday feature to ask a question.  Very fast response and the person handling the question did so quickly and to the point.", "Title": "Good Choice", "Date": "December 2, 2013"}, {"Author": "lojo", "ReviewID": "RM8Z9OARG2JXX", "Overall": "5.0", "Content": "Loving the Kindle,  would recommend it to everyone!The only negative would be that I cannot pair it with my bluetooth headset but if that's the only thing it's still perfect.", "Title": "Love it!!!", "Date": "May 25, 2014"}, {"Author": "Doris", "ReviewID": "R3C097A8B4T6F2", "Overall": "5.0", "Content": "The new Kindle is so much lighter  and is a lot faster. I thought it would be larger than the one I had,but I had a fire 8.9.  I like the new features on the new one. This is my 3rd kindle and I am on it eachday for several hours.", "Title": "Kindle 8.9", "Date": "May 25, 2014"}, {"Author": "Jbiel \"Traveler\"", "ReviewID": "R1JUN90SQOMSG1", "Overall": "2.0", "Content": "I use this Kindle every day. Great for reading books getting the news. I think the pictures show up better  on this screen than on an iPad. Would have given it 4 stars if it could play a greater range of video types. More importantly there are a number of Android apps that I would like to use that will not run on the Kindle. For instance LightTrac. I am a photographer this is an app that landscape photographers use all the time. It does not play on a kindle.", "Title": "good but could be better", "Date": "May 25, 2014"}, {"Author": "Diana P. Lewis", "ReviewID": "R2DD8TE7GO8ER8", "Overall": "5.0", "Content": "I just love this Kindle!! It is incredibly light,weight, and the graphics and color are amazing!! Takes great pictures, and very easy to use..Great promotional sale, also...if you are in the market for a replacement tablet, not just a book reader, definitely put Kindle at the top of your list!", "Title": "Kindle HDX", "Date": "May 23, 2014"}, {"Author": "Beverly Mallow", "ReviewID": "RDIIJUGMROCT7", "Overall": "5.0", "Content": "I used this a few times but my sister loves it as she is a great reader so I just have to go with what I'm told.", "Title": "Kindle Fire HDX", "Date": "May 23, 2014"}, {"Author": "drcast", "ReviewID": "R2RZAGS02NL339", "Overall": "5.0", "Content": "I loved my kindle fire and now my daughter is enjoying it  since I upgraded to the HDX 8.9. I am still learning all the cool ways to use it but the big reason I purchased it was to have a tablet linked to kindle and Amazon that has bigger screen. I can create documents with the free download and so much more, like magazines which are larger and color is great. Also the camera with reverse picture taking is a plus. So far I really like it.", "Title": "i had the kindle fire for two years", "Date": "May 23, 2014"}, {"Author": "james clark", "ReviewID": "RCCY50HP0RSC1", "Overall": "5.0", "Content": "My wife Love's it! This is much faster than expected. Very easy to use, the mayday button is great. Awsome print capability.", "Title": "great tablet", "Date": "May 23, 2014"}, {"Author": "Irina", "ReviewID": "R76PZICLNBXDF", "Overall": "5.0", "Content": "very clear and sharp image, super-light, nice to hold! just the right size to combine reading and movie watching functions.highly recommend!!! worth every dollar!If only there were more accessories...", "Title": "fantastic device", "Date": "May 23, 2014"}, {"Author": "Amazon Customer \"arcon\"", "ReviewID": "R1Q8MMU09XEKLJ", "Overall": "5.0", "Content": "I'd recommend the Kindle Fire HDX 8.9 without reservation. It works and performs exactly as described by Amazon. Worth it. So, if you are hesitating, don't. Just buy it. But, if you must read in sunlight, pick up the Kindle that is best for reading outdoors, at the beach, in the sun; I did. The convenience of having your library on the go under any lighting condition makes it ll worthwhile.", "Title": "Great Product", "Date": "May 23, 2014"}, {"Author": "David Boege", "ReviewID": "R30NXHCPVDMZSY", "Overall": "5.0", "Content": "Picture quality is unbelievable and syncing with all the amazon features (prime, kindle library, etc.) is seamless...  Incredible power and quality- has the possibility to be life transforming, if you are willing...", "Title": "Awesome Tablet", "Date": "May 19, 2014"}, {"Author": "Mel", "ReviewID": "RH13VG7Y3A6PU", "Overall": "5.0", "Content": "There really is nothing intrusive with the \"special offers\", other than seeing when when you first \"wake\" the tablet. So much memory, and what a crytal clear picture and sound. I have yet to find anything that I dont love about this.", "Title": "I LOVE MY KINDLE FIRE HDX!", "Date": "May 19, 2014"}, {"Author": "D. Bates", "ReviewID": "R6TYNB5GU3ZD9", "Overall": "5.0", "Content": "I had the previous model Kindle and loved it. But I always find myself saying \"I wish I had my camera\" well, since I go nowhere without my Kindle I no longer have to say that. LOVE IT LOVE IT LOVE IT!! I only wish the 7\" came with the camera on both sides like the 8.9 does. Made that mistake and had to exchange it. I like the 8.9\" but it does not fit as well in my purse.", "Title": "Love it!!!", "Date": "April 14, 2014"}, {"Author": "atmtore", "ReviewID": "R2EEMU5NLD4WUN", "Overall": "5.0", "Content": "The video viewing is absolutly unbelievable.  I have never seen an HD screen look as great this device does.I am having trouble trying to read books, it is just a matter of finding the user manual online.", "Title": "Incredible", "Date": "April 13, 2014"}, {"Author": "J. Terrell \"Avid TV Watcher\"", "ReviewID": "R1R4J5WQ9OMAIY", "Overall": "5.0", "Content": "This is my best purchase ever!  It has such beautiful color and so many other terrific features. I LOVE IT!", "Title": "This is sooooo cool, I have been wanting this kindle since it came out!", "Date": "April 13, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R3LGRGQYIFMW51", "Overall": "5.0", "Content": "I wish I could buy one for each of our grandkids! These are the best! I've always loves to read but when we go somewhere it's so awkward to take a bunch of books in the car. And as you get older it's so wonderful to be able to make the print larger. Also to be able to check email on the same device is just the best!", "Title": "I love it! I had a 7\" which my husband uses now!", "Date": "April 13, 2014"}, {"Author": "Margaret", "ReviewID": "R16XVGE3GGJRJ3", "Overall": "5.0", "Content": "I was a proud, and very addicted owner of the original Kindle Fire which I purchased on it's release.  Although I was tempted to buy the first 8.9 HD, I'm glad I waited for this device... it's everything I read in the reviews and then some.A few of my favorite features:The keyboard is Swype enabled.  Might not seem like a big deal to some, but I'm so used to swyping on my android, tapping away at the keyboard slows me down.  On my old kindle, I gave up on accessing email, doc applications, and even writing reviews :)  There's also a voice recording function.  Simply put, I can do so much more on this device than I could on the old Fire.After reading multiple reviews on how the processor speed puts the Nexus 7 and iPad to shame.... I can tell you it's absolutely true.Bluetooth...and the range is pretty great.Front facing camera along with the improved screen resolution is great for video chat on Skype and imo\"Collections\" feature for both apps and books.  While I still wish someone could come up with a stellar app to import all my books into some type of folder or collection hierarchy, this feature is still an improvement.Audio books are now part of the menu instead of having to run them through the Audible app.  Not only do they download faster, they run better.Technical specs aside...part of what makes a great device is the UI/UX.... little features that improve usability and overall user experience are critical, and Amazon really did nail it with this device.", "Title": "Amazon really nailed it with this device", "Date": "April 12, 2014"}, {"Author": "CW FISHER \"stars for connie\"", "ReviewID": "RBVJ5SX5SIKUF", "Overall": "5.0", "Content": "This is my third kindle and I am enjoying this one very much.  The things I like about this one you can see page number and location number on the kindle.  It has a camera that can take pictures from the front and the back. The books are easy to read and I am enjoying playing scrabble on my kindle.  It is light weight and it has a large screen.  I do not look at movies just books, comic books, and sometimes my audio books.  I am very please with this kindle.  What I dislike about the kindle is it is not light on the outside letting you know that the battery have finish charging.  In other electronics you do not want to overcharge the battery but you have to turn in on to check to see if the battery is fully charged unless you cannot overcharge the battery that the device cuts off the charging when it is full I do not know.", "Title": "Love my Kindle", "Date": "March 14, 2014"}, {"Author": "Renee Hall", "ReviewID": "R1I43TS4YP3YU0", "Overall": "3.0", "Content": "I REALLY LOVE MY KINDLE but it keeps falling off line I have called my helper several times and it will work for one good day and then stop again.if someone can help please please help me out", "Title": "The fire keeps going out on my kindle", "Date": "March 14, 2014"}, {"Author": "Evert Meulie", "ReviewID": "R17EHNAUNQ6D4U", "Overall": "4.0", "Content": "Very nice, all and all. A bit cumbersome that some apps need to be installed via a 3rd party app store because the Amazon app store either doesn't have them, or they're hopelessly outdated.", "Title": "Nice, but some apps are cumbersome to install...", "Date": "March 14, 2014"}, {"Author": "Angela Williams", "ReviewID": "RYNBNFRVK5WD8", "Overall": "5.0", "Content": "I cannot begin to express how dark and dull my life was before this amazing machine showed up on my doorstep.  We are now rarely apart, we do everything together.I bought a bluetooth keyboard at a discount with an Amazon local deal and now I can actually tolerate writing reviews, such as this one.It has changed me.  I'm a much more interesting person than I was before.", "Title": "Just chillin with my Kindle", "Date": "March 13, 2014"}, {"Author": "Margaret", "ReviewID": "RIUPONV1SUJI5", "Overall": "4.0", "Content": "I am having some problems with it though.  It freezes up frequently and has to be rebooted frequently. Occasionally it doesn't start at all and seems dead, but if you hold the on/off button for more than 20 seconds it wil reboot.  Anything less than 20 seconds won't work.  I am still getting used to it and finding new things to do with it.  It should come with a detailed instruction book, but did not.  Had to borrow a book on Amazon prime to get how to use it.  For something so expensive it should come with detailed instructions.Margaret", "Title": "I like it", "Date": "March 13, 2014"}, {"Author": "C. Celestine", "ReviewID": "R2TZCKB1I8ICH7", "Overall": "4.0", "Content": "I love my Kindle Fire HDX 8.9!! I had a Kindle Fire, but it died (RIP, Sweet Pea) so I purchased this one & I would not trade it for anything. It's so much faster and the battery lasts longer. It doesn't take long to load up during start-up like the Kindle Fire did and there are more apps included like a clock, a calendar, and Goodreads, which I absolutely love! I am so happy I made the upgrade to this version of Kindle Fire.", "Title": "So much better!!", "Date": "March 13, 2014"}, {"Author": "Steve", "ReviewID": "R3JMB5SHF13QSI", "Overall": "4.0", "Content": "Great device. I just bought on and love it.However I got annoyed at all these special offers on the lock screen and on the home tab.Amazon discloses that they will be there, Best Buy doesn't. None of them discloses that you will have to pay $15 to get rid of them, even when you click on \"learn more\".Amazon claims that these ads don't interfer with the use of the tablet, but they do. They popped up several times  while i was playing Fruit Ninja and actually paused the game.We called Amazon customer service and at first the rep said that we didn't read carefully all the fine print. We told him that we got it from Best Buy, because the same model was $40 cheaper than Amazon, and they had no information anywhere about these \"special Offers\".  He was understanding, waived the $15, told us to restart the device and they were gone!That's the reason I will give only 4 stars. The sellers should be more upfront about these things.Otherwise, it was very easy to get started, since I had a first generation Kindle Fire HD. As soon as I entered the account info, everything got automatically uploaded. E-mail was much easier to set up that the previous model, and it now supports Outlook. Good camera, not I would really be caught taking a picture or a movie holding a big flat thing in front of me :). Like the way that the camera is activated when you lift the device from the origami case. Also the Kindle conveniently turns of or turns on when you close or open the case.Great battery life, going on 3 days of heavy use, still trying to get it empty so I can power cycle it. Handles wifi from our wacko router much better than my laptop.", "Title": "Hidden $15 fee to get rid of annoying special offers", "Date": "March 12, 2014"}, {"Author": "Lori F", "ReviewID": "R3BVP4NJIMDW12", "Overall": "4.0", "Content": "I love the new kindle fire HDX 64g 8.9. I was already a kindle owner of a 7\" 8 g, which was a gift last Christmas when I became new to the internet but I realized I was almost out of memory which is why I purchased the 64g and went with the larger screen. I've chosen this rating just because I haven't been able to use all of its features yet.. There has been a problem with editing the calendar, which amazon technicians are working on to resolve as quickly as possible. The photos are fantastic and with having the front and rear facing camera makes it easier to use. The picture quality is great and watching a movie is so clear. I believe the best feature that was developed was being able to print from my kindle. I recommend this product to everyone, it is a great little laptop.", "Title": "kindle fire HDX 64g 8.9\" is the perfect little \"laptop\" for home or on the go", "Date": "February 23, 2014"}, {"Author": "trixie", "ReviewID": "R96IBMZOWGSGU", "Overall": "5.0", "Content": "Love my Kindle, way nicer than my 2 yr old nook. I can read at night & it doesn't bother my eyes at all.  With my nook I'd be reading a really good book over the weekend & the color to read with would cause so much eyestrain that glasses & giant letters wouldn't help me everything was still fuzzy so I'd have to quit reading. Now it's no problem at all.  I can read all day & all night.  Still do not need my glasses or the giant letters. And the video is awesome!!!!", "Title": "hd rocks", "Date": "February 22, 2014"}, {"Author": "David Lorden", "ReviewID": "R1DV2PJU8WN1BI", "Overall": "5.0", "Content": "I was having trouble with my Kindle Fire and was able to troubleshoot the problem by going to the Amazon site.  Great customer service and even better product!", "Title": "Love My Kindle Fire", "Date": "February 22, 2014"}, {"Author": "Nancie Cornwall", "ReviewID": "R1BI7ULX69D0PT", "Overall": "5.0", "Content": "Very easy to use. Great display, sound quality and apps.  The \"help\" feature is outstanding.  I like the fact that it syncs to my kindle and I downloaded a free manual for the tablet.", "Title": "Everything the commercials claim!", "Date": "February 12, 2014"}, {"Author": "Cheri MorningStar", "ReviewID": "R31LNM5ULFI3ST", "Overall": "5.0", "Content": "The color is beyond belief.  Characters in a locale you don't know?  Speaking to each other by song titles?  Need an instant dictionary?  A few taps and pictures, music, word definitions are instant.  You can put books by genre, author lists.  Down stream movies, Netflix or HBO GO.  This Kindle is awesome.", "Title": "Interactive Reading", "Date": "February 12, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RDYRBP0FQ1ZJ9", "Overall": "5.0", "Content": "I really love this little device!  Very easy to use and comfortable to handle.  I've used it for email, social media, reading books, etc.  I haven't watched a movie yet but that's next.  The pictures are amazing as well.  Great purchase for the price!  Highly recommend.", "Title": "KINDLE FIRE", "Date": "February 12, 2014"}, {"Author": "Mike A.", "ReviewID": "RWG4MK0YGEOGL", "Overall": "5.0", "Content": "It is perfect for consuming content.  Nice size and easy to carry around in a jacket pocket (I have some big ones!).The picture quality is superb.  Really enjoying it.", "Title": "Kindle Fire", "Date": "February 11, 2014"}, {"Author": "F &T", "ReviewID": "R2T9W80VMJZH2X", "Overall": "5.0", "Content": "I can read a book, watch Netflix, watch Amazon Prime movies or tv shows, play games, accesses the internet, read the news of the day, get the weather forecast! Whats not to like!!!!", "Title": "Love my Kindle!", "Date": "February 11, 2014"}, {"Author": "Steve Martin", "ReviewID": "R28R7ZNGHRZ922", "Overall": "5.0", "Content": "Bought this for the wife for Christmas and she loves it. So much so, I have to hide the charger to get some alone time... I would write more, but she doesn't let me use it. I can tell you that I can read the screen clearly from the next seat over.", "Title": "Great gift idea", "Date": "February 10, 2014"}, {"Author": "S. Lichty \"TeacherMom\"", "ReviewID": "R32M02SQO3XAVQ", "Overall": "4.0", "Content": "Hey y'all! Thanks for indulging me for a minute. I bought the 7 inch version, then returned it for the bigger one. I love them both, but the bigger one is  a better size for me, and it has a couple extras such as front and rear cameras and a little sharper image. It starts up fast, and it is convenient. As a prime student member, I can borrow one book a month from the Amazon owner's library. Pretty awesome!However, the silk browser, which is the kindle browser doesn't support flash. So many online games and such will not work on your kindle. I've read online about how to download a flash app for kindle and a different browser, but c'mon Amazon! Why should I have to go through the hassle? Why can't you just update Silk to support flash, and give us a flash app yourself? Should be very easy.Lastly, you cannot use the g---le play store on kindle. This is a shame because you can often get some apps cheaper at one versus the Amazon app store. I like to have options! So if we could rix these two minor issues, I could have given my kindle fire hdx 8.9 a 5 star rating!", "Title": "Love my kindle Fire HDX. Wish it had FLASH!", "Date": "February 10, 2014"}, {"Author": "angiebc", "ReviewID": "R30FFYGXZHO18S", "Overall": "5.0", "Content": "I really love the new Kindle Fire HDX. The picture quality is great. It's light weight and just the right size to slip into your bag of choice.", "Title": "Great Product!", "Date": "February 10, 2014"}, {"Author": "Jacqueline Dana", "ReviewID": "R3GZ7U3JH6WWZW", "Overall": "4.0", "Content": "I loved my first generation kindle fire but when I started having problems I went to the HDX 8.9.  I love it except for one thing.  The battery life isn't long enough for me.  Of course I use it for 4 hours usually at a time.  I've been know to read a couple of books at a sitting so it might be my fault.  I love the kindle and will always have one.", "Title": "wonderful", "Date": "February 9, 2014"}, {"Author": "grandma", "ReviewID": "R2VLAOAPSXX2WG", "Overall": "5.0", "Content": "I LOVE MAY KINDLE FIRE.  IT HAS BEEN A GREAT SOURCE OF PLEASURE.  I use it for face book, e-mail and games.", "Title": "GREAT", "Date": "February 9, 2014"}, {"Author": "Melissa", "ReviewID": "RQYUIAO4EPJSE", "Overall": "4.0", "Content": "Would give the kindle fire hdx 8.9 5 stars but it freezes at least 2x a day and it gets very frustrating", "Title": "Great but.....,,", "Date": "January 28, 2014"}, {"Author": "Albert D Barksdale", "ReviewID": "R3T1XJJBLEYTVW", "Overall": "4.0", "Content": "Excellent play and operation provided you have a fast internet Wi-Fi. Otherwise it doesn't perform so good. Well, nor does any computer or laptop. Definition and viewing is great and everything else is fine. The charge holds good.The key is a good Wi-Fi. Without it, you might be a little frustrated.", "Title": "HDX 8.9 Blazes", "Date": "January 28, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R30LAFPFB1MU61", "Overall": "3.0", "Content": "It's still not as user friendly as an IPad but it does have high quality pictures. I am going to download a manual so I better understand it", "Title": "Good for the price", "Date": "January 28, 2014"}, {"Author": "Anita", "ReviewID": "R2YVJHY65MACXV", "Overall": "5.0", "Content": "This is my fourth Kindle purchase and it is awesome.  I am a huge fan of the Kindle family and would never consider any other tablet.  I started with the 7\" black and white reader (which I still own) and advanced to each upgraded device as they became available.  The Kindle Fire HDX 8.9 is, in my opinion, the perfect tablet and e reader.  The colors on this KIndle Fire is amazing.  Reading and watching movies on the Kindle Fire HDX 8.9 is unbelievable.  You have to experience it to know just how awesome it is, TV commercials and the computer screen does not convey the clarity of this device.  I love the great customer service that Amazon offers, especially the mayday service that is offered with the Kindle Fire HDX, and the ease of purchasing swiftly through Amazon.  I have become a huge Amazon fan through my Kindles.  Keep up the great work Amazon!", "Title": "Love it!", "Date": "January 25, 2014"}, {"Author": "Terry L. Broadbent \"tlbroadbent\"", "ReviewID": "R1HFPH2VLDMHCH", "Overall": "5.0", "Content": "I had an original 7\" Kindle Fire. I made good use of it but ran up against its limitations - slow processor, limited memory and storage. I couldn't load all of the Apps that I wanted and many ran very slowly and frequently stopped. I also found the 7\" screen limiting for the things I wanted to do.The 8.9\" Kindle Fire HDX with 32GB and WiFi meets my needs very well. The quad-core processor makes this a fast and very responsive tablet. I've not had any problems loading and running the Apps that I want. The Silk browser doesn't fail on some web pages like the original Kindle Fire.The display is outstanding. I love the 8.9\" screen.Sound is adequate but volume still seems weak. I usually listen with headphones so this isn't a big issue.I can now leave my laptop at home when I travel because the Kindle Fire HDX does what I need.", "Title": "Love My New Kindle Fire HDX!", "Date": "January 25, 2014"}, {"Author": "Carol M. in NC \"nurseicm\"", "ReviewID": "R2GYZ9E0DAC8PO", "Overall": "5.0", "Content": "i love the new kindle fire hdx not only was it a good deal with amazon allowing the purchase in 90 day increments, it is really light weight, thinner than previous kindle fire. only thing that makes it heavy is the otterbox i also purchased for protection since i am slightly clumsy and prone to dropping things. I love the display and the clarity of videos and movies i enjoy. love to read, still exploring the whole thing it is definately different from kindle fire. I really dont like the book or video recommendations that show up under the book carousel. And i still am looking for a way to list faves like the other kindle, since im exploring i will either find it or i wont so its not a big issue......", "Title": "love it", "Date": "January 24, 2014"}, {"Author": "Gloria S. Wells", "ReviewID": "R2TSBYJ15TDHVY", "Overall": "4.0", "Content": "The Kindle Fire has great sound and good picture. The only complaint I have is touching the power button accidentally turns it off too quickly.  Needs to have a delay in shutting down.", "Title": "Kindle Fire", "Date": "January 24, 2014"}, {"Author": "Alex G", "ReviewID": "R85KYEA7C1DSE", "Overall": "5.0", "Content": "I waited for this version over getting an iPad because I'm an Amazon Prime member and you can download loads of the already included Prime content and watch offline. I read on this and watch way too many TV shows and movies. I've never regretted getting this over an iPad (like my wife owns) for a second.", "Title": "Can't put it down", "Date": "January 24, 2014"}, {"Author": "Movie fan \"good books only!\"", "ReviewID": "R29CZ9VLE6NYBI", "Overall": "4.0", "Content": "Ok, I'm going to be honest here. I own an ipad 4 with retina display and a google nexus 7 as well as having a windows phone and having had an android phone in the past. I like all variations of tech and prefer to be immersed in all instead of being ridiculously close minded and loyal to only one. Each has its own merits.  I bought the Kindle for my kids because they have the option of the lending library and I can control their time on the device. I have an amazon prime account, which in this case, is a plus. All of my already owned apps via the amazon app store were automatically downloaded as well as any kindle books I've purchased in the past.  The amazon app store does not have near the breadth of the apps that the ipad is but they have the major ones for game playing including ones the boys really like like minecraft pocket edition, angry birds go, etc. The most limiting app store would be that for the windows phone. Not the case with this device. You can also buy amazon coins on amazon so you have purchasing power for any apps in the store and depending on how man you buy, I believe you can save up to $10. Assuming you are going to spend that much on apps. It's not good towards books.  The OS on the kindle is good. It is lightning fast, has all of the settings at your fingertips and I've had 0 problems so far.  It holds a charge as well as the ipad with consistent use and the charging port is easy to access and secure. I'm still getting used to the buttons on the back but I like that I cant accidentally hit the home button. I actually have to go for it. The nexus 7 is disappointing as far as battery life goes and the charging port. Within two months of having the nexus, I had to ship it off to have the charging port replaced. The ipad I've replaced twice due to a malfunctioning home key and the wifi not working at all. I have cellular service on the ipad but do not on the kindle. I almost wish I did to see how well it functions.  Kindle has an incredible photo editing program. The photos it takes are as good as those the ipad takes (I don't expect much from tablet devices) and I was shocked to see the variety of editing features the program offered without having to buy an extra app. You could make a meme, add stickers, crop, etc. Many things as well as sharing features. Kindle is not compatible with instagram yet, which is a shame. It just became compatible with windows in December of last year. Hopefully this will be resolved soon.  Also, the Kindle has the unique and convenient feature (like the nexus 7) of typing by swiping the word across the keyboard. It is amazingly accurate, fast and easy to use once you practice once or twice. Because of the size of the screen and the touch accuracy, I've used it often on the Kindle if I've needed to type.  The only truly disappointing thing for me which may sound trivial is the fact you cannot personalize the background or lock screen. I paid the extra $15 not to be inundated with commercials because ultimately this is my device, not Amazon's to sell stuff to me. Even if they are great offers, I shouldn't have to feel like I have to buy something if I want to turn the thing on for the kids, etc. There is a pin lock screen available, just like the ipad. It does not have facial recognition or pattern offered like the nexus 7, though.  Mostly, I have been satisfied with this device. I have no real complaints and I care about performance and the visual screen first. The screen is beautiful. I like looking at it better than my ipad. The reason I got the ipad over a year ago was for the screen. Now they have better options. However, I like my ipad for the apps.  For kids, for reading, for those with an amazon account, this is perfect!  If you have any questions, feel free to contact me. I'm happy to answer.", "Title": "Great screen and light", "Date": "January 15, 2014"}, {"Author": "DD", "ReviewID": "R17JWKUKZ3RHJD", "Overall": "5.0", "Content": "My Kindle Fire HDX is everything I expected and more.  I love the fact that I can dictate emails without having to type them out.  The colors are very vivid and all functions work very quickly.", "Title": "Everything I expected and more!", "Date": "January 15, 2014"}, {"Author": "t.holmes", "ReviewID": "R9R6OFXREQ4OX", "Overall": "5.0", "Content": "When I purchased my first Kindle Fire I was very frustrated with it because I didn't know how to use it and it was hard to find someone to show me how to use the tablet and the same when I purchased the Kindle Fire HD 8.9.  I found it difficult to even find a telephone number for Amazon so I could call someone to tell me how to use the tablet.  I complained to Amazon about the lack of not having a company or someone locally who could help teach me how to use the table.  I was really frustrated because I wasn't able to take good pictures with the Kindle Fire HD 8.9 since it didn't have a back camera.  Oh, but baby!  Extra! Extra!  Read all about it! I know somebody really loves me because I got the new Kindle Fire HDX 8.9 as a Christmas present! Let me tell you now about my new Kindle Fire HDX 8.9.  I am now the proud owner of a Kindle Fire HDX 8.9 and every time I use this tablet, it's a new day with a new play!  Kindle Fire has stepped up it's game!  I can take great pictures all day long because it now has a front and back camera.  I now am a believer, that for the price, IPADs don't have anything any more on Kindle Fire HDX 8.9. I love using the May Day which have live people showing you how to navigate the table.  The May Day People are fun to talk to and make me feel at ease. The Kindle Fire HDX 8.9 is much lighter.  I really love watching movies on my Kindle.  I like the new, improved \"Contact List\" app. The one disappointment with the new Kindle Fire HDX is the \"Office Suite\" that was advertised as being a integral part of Kindle Fire HDX 8.9  which doesn't seem to exist.  I'm not sure this app exist because there isn't an \"Office Suite\" icon on my Kindle Fire HDX 8.9.  It's been confusing as to why the \"Office Suite\" is not on the tablet as advertised.  May Day People weren't able to explain to me in a manner that I can understand why the app icon is not on the device and weren't able to clearly explain how I should use this app. Not having the \"Office Suite\" icon app on my new Kindle Fire HDX 8.9 is the only area where I feel slighted because that is one of the main reasons I purchased this new tablet. Otherwise, I most definitely am very satisfied with my new Kindle Fire HDX 8.9.  One other thing, Kindle Fire has also improved with the number of great movies and books that can be obtained if one purchases \"Prime Time\" each year. This is the first time I've purchased \"Prime Time\" since I began getting Kindle Fires. I am glad I paid the prime time fee because I've seen some great movies on my Kindle Fire HDX 8.9. It's so much fun watching a movie on my Kindle while I'm lying in bed! With the Kindle Fire, one is able to store music in the cloud.  One last thing, on this past Sunday, when I visited my sister who was using her Kindle Fire HD 8.9 while I used my Kindle Fire HDX 8.9, we could differently see the big and improved differences in the newest tablet.  Now, my sister is eager to get the new Kindle Fire HDX 8.9.", "Title": "Now This Kindle Fire HDX 8.9 Is GREAT!  Love It!", "Date": "January 15, 2014"}, {"Author": "Lin Boffeli", "ReviewID": "R1T03IU4IU5N7V", "Overall": "5.0", "Content": "Love it.  It is my constant companion. It is fast and the color is wonderful. You should buy it today.", "Title": "Love it!", "Date": "January 14, 2014"}, {"Author": "Fawn  K.  Williams", "ReviewID": "R2K2UGLCCL3XB2", "Overall": "5.0", "Content": "Best money I've spent in a long time. Have wanted one forever..If I'd have known what I was missing I'd of bought a Kindle years ago. My eyes don't focus well so I picked the black background with white print, reading is so easy now. I don't have to keep looking away from the page so my eyes can re-focus. Awesome if you don't have a lot of extra space for bookcases. Love that I can check my email, facebook and play my games. Kindle Fire HDX 8.9 is so much more than an e-reader...you won't be disapointed.", "Title": "Kindle Fire HDX 8.9", "Date": "January 14, 2014"}, {"Author": "Mr. Mike W. Naylor", "ReviewID": "RE9ZT6BLZ0ULL", "Overall": "5.0", "Content": "Pretty simple.  I Love this thing and Amazon has is right. I can watch on all my devices no BS.  I love that.", "Title": "Love it", "Date": "January 12, 2014"}, {"Author": "Tigerlaw", "ReviewID": "R1E3OSNFDJ763I", "Overall": "5.0", "Content": "This is hands down the best deal in tablets. The presentation is stunning, compared to everything else. May day is a great plus.", "Title": "What a great tool", "Date": "January 12, 2014"}, {"Author": "demo 717", "ReviewID": "R183TK9NSBRV35", "Overall": "5.0", "Content": "The resolution on the HDX is like no other. My wife has an ipad and the resolution on the HDX is much better.It's incredibly light and fast, very happy to say the least.No doubt this is the most bang for your buck.", "Title": "Amazing!", "Date": "January 12, 2014"}, {"Author": "Stacey*FamilyKindleCoffeLover*", "ReviewID": "RX2RK6HP1YD4A", "Overall": "5.0", "Content": "I've had no problems with this product so far.  The screen is clear and good quality.  I mainly use this device for reading, but it has been handy for using the other apps such as games for my kids and using goodreads.Downloading books from Amazon is very quick and I like that all of my recent purchases are on the home screen ready to go. I had an older version of kindle and was able to transfer all the folders and books easily.  I found adding my purchases and maneuvering between folders and screens easy.It did take a couple of days to get used to the screen as my old one was the Kindle DX - not backlit.  The new kindle means I don't need to have extra light which was a major selling point for me.The battery life seems quite long, I can generally get nearly 2 full days of reading before having to charge. I bought this device because it claimed to have a longer battery life than an ipad if used for mainly reading.I'm happy with my kindle purchase and will continue using Amazon for my book purchases.", "Title": "No problems so far", "Date": "January 12, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R3O3UA6RBW7TER", "Overall": "3.0", "Content": "I bought this Kindle fire hdx as a Christmas gift to myself. I wanted to step up a bit with new technology from my old kindle fire and I am just unsure of my purchase. It was bought 28th November, 2013 and since I am living out of the USA my relative ship it to me. I was so excited when I received it on the 16th December and started to use it immediately. I love the feel of it ,larger screen and sound quality. Unfortunately, I was very disappointed and frustrated on 31st December,2013 when it refused to power on. After several tries and troubleshooting it came on. So I am going to update my review as time progress but for now I going to say it's okay.", "Title": "I am still unsure of my Kindle Fire HDX 8.9\", HDX Display, Wi-Fi, 32 GB - Includes Special Offers (Electronics", "Date": "January 3, 2014"}, {"Author": "Ron Cooper", "ReviewID": "R1LXRCYABDFKSQ", "Overall": "3.0", "Content": "I'm still rather new to this device as I actually unboxed it on Christmas.  I would consider myself a power user that must push the boundaries of making a device do what I would like it to do.  I rooted my Nexus 7 so I can use apps like Titanium Backup Pro, etc.  However, I was getting tired of needing to root and deal with that headache and just get a device that works.  The Kindle HDX is a beautiful device and interface.  I have enjoyed it so far, but there are a bunch of App compatibility issues that I immediately ran into.I'll keep this short and maybe revisit and expand after I have had more time to settle in with this device.Pros:Beautiful display and I\\interfaceIntegration with Amazon contentHandles about 80% of what I want to do with a tabletBook reading has been pleasant so farSpeakers and audio sound really good coming from a tabletCons:Locked into Silk BrowserLast Pass seems a little weird - not tied to Silk Browser - uses an embedded Dolphin browser I believe - wish this was integrated into Silk with a plugin or somethingNo Google integration - you don't know you miss it until it's not there any moreLack of GPSApps in the Amazon app store are not the same revision as current ones in the Google Play storeThings like Candy Crush - since its an older version, I'm missing features I get on my Google based devicesStuff I purchased in Google Play I cannot easily get to Kindle Fire or if I do it might not be supported (if I sideload something)Price.  Due to being so locked in to the Amazon marketplace, I feel this device should be priced lower or I wouldn't have a problem paying more if more of my apps worked out of the box.In short, there are challenges that need to be overcome on a directional level from Amazon.  I'm not sure why developers or Amazon are not keeping Apps up to date or what is preventing developers from moving to the Amazon Marketplace, but if I were Amazon I'd be addressing these issues.  If I had more compatibility and flexibility I wouldn't have such a problem losing a few apps, but the percentage is too high for me to give a 4 or 5 star review as the current device and platform sit.Companies that try to limit what we want or can do with these devices are going to pay the price, by losing users and sales.  It seems Amazon is following Apple's model more closely than Google's.  I'm happy with a mix in the middle.  Considered sending this back to Amazon but I'll wait it out some more and see how things go.  I would really like this device to replace all of my others but right now it is a complimentary tablet to my phone and other tablet usage.", "Title": "Review coming from a Nexus 7 user", "Date": "January 2, 2014"}, {"Author": "D. Boyle", "ReviewID": "R2V9KHB08EMG2T", "Overall": "5.0", "Content": "I have the original Kindle Fire--so I was pleasantly surprised by how light and sleek the HDX is. The display is great and I'm pleased by how fast the web browser is. Hulu Plus and Netflix also work perfectly.", "Title": "Totally Satisfied", "Date": "January 2, 2014"}, {"Author": "Wile E's Mom", "ReviewID": "R2ATMPJ5ZNM62G", "Overall": "5.0", "Content": "What a treat to be able to easily and clearly see the content. Very bright, very crisp.  And the simplicity of use!  Hardly a learning curve!", "Title": "joy", "Date": "January 2, 2014"}, {"Author": "David Ziring", "ReviewID": "RWJUR0W7DWP3A", "Overall": "5.0", "Content": "My wife won't let go of this - she now watches more movies and TV shows on the HDX than on the television.It's not nearly as portable as the 7\" tablets, but much easier to use.", "Title": "Great screen and functionality", "Date": "January 2, 2014"}, {"Author": "1215", "ReviewID": "R3UBK01TNMTGX7", "Overall": "5.0", "Content": "I have tried the smaller kindle we bought one for my husband. I thought it was to small. I love this size. It is easy to put  it in my purse and go. Big enough to see without enlarging the page. So many free apps and games.  My daughter has an IPad and this is so much better. I also recommend this pad if your new to using a pad it has the May day feature that you just can,t beat. I have had to use it and the support Tec was fast super nice. Made it an easy fix. I love my kindle.", "Title": "i love this kindle fire 8.9 HDX.", "Date": "January 2, 2014"}, {"Author": "carol piazza", "ReviewID": "RL5GTD62Q4PG2", "Overall": "4.0", "Content": "First of all I am a senior . This is great , I love it. I have a computer so I do know a little. I am enjoying  it.l learn something new every day.Carol", "Title": "my new info center", "Date": "January 2, 2014"}, {"Author": "C. Ellis", "ReviewID": "REUE1563IXUCN", "Overall": "5.0", "Content": "Much better than the 1st generation.  Lightweight, fast, love the increased storage space.  Makes me want to read more.  Easy to navigate.", "Title": "Love it", "Date": "January 1, 2014"}, {"Author": "English teacher", "ReviewID": "R2FTK8YZWCRBE1", "Overall": "5.0", "Content": "I love the Kindle Fire HDX … vivid screen, easy to use … all that Amazon advertises it to be. Amazon did a great job on delivery time too! If you're an Amazon prime customer, you can't go wrong with this.", "Title": "I'm a happy consumer.", "Date": "January 1, 2014"}, {"Author": "abacus", "ReviewID": "RHYFK38Z9AILS", "Overall": "5.0", "Content": "This is not a tablet for everybody. If one wants a tablet with a fully accessible operating system, this is not for you. Get a Samsung Note 10 2014 or an iPad Air. If you are a regular participant in the Amazon universe and you want to read both books and magazines, and consume other material that needs a superb screen, buy the Fire HDX.Screen quality is as good as the best of the other tablets and the device is lighter. It is designed to promote and facilitate the sale of Amazon products and Amazon is upfront about this. This concept works for me and I am very pleased with the device.", "Title": "Truly Excellent Specialized Device", "Date": "January 1, 2014"}, {"Author": "E. Wenzel", "ReviewID": "R2X2E4YZANRSI6", "Overall": "4.0", "Content": "Screen is good. Sound not so much. The rear facing speakers are pretty weak. Battery life is good. The power and volume buttons on the back side leave the kids complaining. The back plate that forms the body has a fairly sharp edge that catches a little on things. However the performance of the kindle fire was nice and responsive. So overall a good device with a few drawbacks.", "Title": "Good with a few drawbacks", "Date": "December 25, 2013"}, {"Author": "Gary Lewis \"Gerald L Lewis\"", "ReviewID": "R1UUGPD5XGZN92", "Overall": "5.0", "Content": "I've been a Kindle customer and fan since the first one came out (I lost one and now own 3 including a 2nd generation 7\", a DX, and now the Fire HDX). I also use the Kindle Windows client on my desktop and Microsoft Surface RT device. For my money, the HDX is the best platform for reading books and watching movies of them all. I particularly like the fact that I was able to download multiple high-quality movies that I can watch comfortably using my Bluetooth headphones, on the device since I don't always have WiFi access. I already have moved 6 movies and about 40 books to the device and I still have over 20GB available space. I've also installed several productivity applications and, OK, a couple of games as well. I'm extremely pleased with the speed of the device (downloading a book over WiFi occurs in seconds) and the quality of the display and sound. I chose the 32GB version without special offers. The Kindle HDX will be a very hard act to follow!", "Title": "Outstanding tablet!", "Date": "December 25, 2013"}, {"Author": "Cheyenne Harris \"Cmarie\"", "ReviewID": "R23J9OSIRVN75N", "Overall": "5.0", "Content": "This is the best tablet ever. I am so happy with it! The 30 day trial was perfect so I could try this out and see what I was missing.", "Title": "love it", "Date": "December 25, 2013"}, {"Author": "Madeline Starnes", "ReviewID": "R13A5LGQQROAAF", "Overall": "5.0", "Content": "I love the kindle fire it's light weight and easy to use. The screen is beautiful!  I currently own an iPad 2 so the screen technology isn't the greatest. I like the design of the kindle except for the material of the back. Not sure why but it was hard to keep clean. I would have kept the kindle but I just couldn't afford it after the free trial. Great tablet for someone who is looking to buy a tablet but isn't sure which to buy. I also liked how your amazon account was integrated throughout the kindle made purchasing books or apps super easy!!!", "Title": "Love the new kindle fire!!!", "Date": "December 25, 2013"}, {"Author": "Jon Williquette", "ReviewID": "R1OH38SX0GN5DO", "Overall": "5.0", "Content": "I have loved this tablet since the moment I opened the box! It's an amazing piece of work, and I'm proud to say I own one. The only little thing that I dislike about it is the scrolling carousel on the home page. Seems a bit unnecessary to me, but no big deal. Thanks Amazon for creating a great tablet!", "Title": "FANTASTIC!!", "Date": "December 25, 2013"}, {"Author": "RUBY E NARANJO", "ReviewID": "R2E4DEZOE1OQUQ", "Overall": "4.0", "Content": "I was pleasantly surprised how easy it is to use this tablet...no problems whatsoever.  Love it and would recommend to friends and family.", "Title": "kindle fire", "Date": "January 10, 2014"}, {"Author": "Barbara J. Esmedina", "ReviewID": "R1M0SRB02DEHR9", "Overall": "5.0", "Content": "Fantastic tablet. I bought as a gift for my 81 year old mother and she loves it. She finally keeps  up with her email. I have an iPad I received as a gift, it is a joke as far as functionality goes compared to the Kindle Fire HDX", "Title": "Better than the iPad", "Date": "January 10, 2014"}, {"Author": "Cynthia", "ReviewID": "R3I4MZ1GD0W3WW", "Overall": "4.0", "Content": "I have only had my Kindle two days so can't be sure yet how everything works, but so far I am doing well with it.  I find that the black buttons on the black frame of the Kindle are hard for me to see however.  Wish that the on and off, etc. buttons could have been in silver or another color to help me locate them better.  Once I get to know more about the features I will update my review but for a first timer using a Kindle I will say that my ten year old granddaughter is doing great at figuring things out, thus I am not having much trouble either as she is guiding me along.  (laugh). One thing that I really wish the Kindle had was a slot to keep my stylus.  Neither the Kindle nor the case has any place to secure a stylus and that is really inconvenient to me.  Thank you.Cynthia", "Title": "GOING WELL AFTER ONLY TWO DAYS OF HAVING MY KINDLE", "Date": "November 26, 2013"}, {"Author": "TamiLee", "ReviewID": "R1CCHBXW6PQBRB", "Overall": "5.0", "Content": "Amazing quality with a great price! My whole family loves it, hard to get my hands on it when anyone is home.", "Title": "Worth every penny!", "Date": "November 24, 2013"}, {"Author": "Beverly A. Davis", "ReviewID": "R2ID356I9T3JK5", "Overall": "5.0", "Content": "Beautiful Screen & colors, Sound is incredible, & processor is super fast. Silk is a great browser. I think this is the best tablet for the money.", "Title": "Great Tablet!!!", "Date": "November 21, 2013"}, {"Author": "Tireguy510", "ReviewID": "R1LA8EQSZWVQI3", "Overall": "5.0", "Content": "This is a really nice tablet. I was fortunate to be invited to try it by Amazon for 30 days free. Light, easy to carry and FAST! Much faster than my iPad. Screen is beautiful and far superior to the Retina. I compared the Kindle side by side and WOW! Dolby speakers to boot, so you know the sound is going to be better than most other tablets. I had an Android phone before, so I already had a good understanding of the OS. That being said, here are some things that could be improved. The OS is not as fluid or as intuitive as Apple. Not a surprise here. And the battery life is NOT as advertised. The iPad can last up to three days with light to moderate use. The Kindle will run all the way down the night before, charge all night, and before 9 AM, the battery will be depleted 10%. So, I strongly dispute that claim about battery life. I have not used the Mayday button yet and didn't even know about that feature until the Kindle arrived. I really like that part of it and I think that it sets the Fire apart. It's nice to have instant help if needed and I think that Amazon is on to something here. Also, if you have Prime, this is your device. For videos, your watch list and all access to anything Amazon offers is literally at your fingertips. Same goes for shopping. It is quite easy and dangerous! LOL It was hard to stay off the Fire some days. I will be returning the Kindle due to costs, not desire. Would I recommend this? Absolutely, positively, 100% YES!!!!! It is a device that is great now, and only going to get better.", "Title": "Fantastic device and screen with some minor flaws.", "Date": "November 29, 2013"}, {"Author": "This is not my life", "ReviewID": "RK5L9VPFJLGVG", "Overall": "1.0", "Content": "I'm very unhappy with my Kindle HDX, it's slow, movies are not crisp and clear and they skip. I doesn't respond to touch well at all. I tried contacting Amazon to return this because it was one day past my 30-day window and I couldn't do it online through the return window.  I am extremely disappointed and can't believe with as much as I've spent on this and and how much I spend at Amazon, nobody cares.  I was really looking forward to getting this Kindle after reading all the good reviews, now I just get frustrated every time I have to use it. I purchased the original Kindle when it first came out, I bought my son a Paperwhite Kindle, which he loves and my other son has the Kindle fire, we are satisfied with those, but this is a big let down.", "Title": "Doesn't live up to my expectations", "Date": "March 1, 2014"}, {"Author": "Chris", "ReviewID": "R2AOOVSAEZ6H3C", "Overall": "4.0", "Content": "I got the chance to try out the Kindle HDX 8.9\" thanks to a free 30 day trial from Amazon. I've been on the fence about tablets for a long time, I consider them more of a novelty than a need and I thought this was the perfect opportunity to make up my mind. The HDX is a very attractive device, it feels good in your hand and the rubbery material looks great. It's also extremely light, The screen has an incredible resolution and looks outstanding when browsing and playing around. The sound is also excellent as well. There were a few things however I wasn't too impressed with. The Silk browser is meh at times, the app store is lacking, the buttons are located in weird spots, and the OS is just too integrated with Amazon. The OS isn't hard to get used to and the set up is easy but after about 3 days of use the novelty kind of wore off for me. It's an excellent device but I don't see the real need for it. It doesn't feel like the tablet would be able to do anything else but browse the web, read books, and watch movies. For a device that is close to $400 that isn't enough. I would rather spent the extra money on the Surface 2 which at least gets you Microsoft Office. I'm giving it four stars because I feel the device has a great build, great screen, is light, and does what its suppose to do very well. I just think it's a little overpriced and for the money there are a lot better options. The OS could use some work, either way if you love Amazon and use it all the time this is the perfect device for you", "Title": "Excellent device but not for me", "Date": "December 9, 2013"}, {"Author": "JH", "ReviewID": "R2RYCIW6ADD0HD", "Overall": "3.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo33PE4QAXIAWWDembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo33PE4QAXIAWWDrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo33PE4QAXIAWWDchiDiv\").innerHTML = document.getElementById(\"cv_mo33PE4QAXIAWWDhiddenPre\").innerHTML;\n};\ncv_mo33PE4QAXIAWWDrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo33PE4QAXIAWWDso;\t   \n\n\nfunction cv_mo33PE4QAXIAWWDloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo33PE4QAXIAWWDso = new SWFObject(swfLocation, \"cv_mo33PE4QAXIAWWDAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo33PE4QAXIAWWDso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo33PE4QAXIAWWDso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo33PE4QAXIAWWDso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo33PE4QAXIAWWDso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo33PE4QAXIAWWDso.setAttribute(\"height\", swfHeight);\n          cv_mo33PE4QAXIAWWDso.setAttribute(\"width\", swfWidth);\n          cv_mo33PE4QAXIAWWDso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo33PE4QAXIAWWDso.write(\"cv_mo33PE4QAXIAWWDflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo33PE4QAXIAWWD', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo33PE4QAXIAWWD';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo33PE4QAXIAWWD', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo33PE4QAXIAWWDloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo33PE4QAXIAWWD\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"185-2488423-4562533\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2HJWV7QHYQLFT\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2HJWV7QHYQLFT\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2RYCIW6ADD0HD\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2HJWV7QHYQLFT/185-2488423-4562533\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/185-2488423-4562533\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo33PE4QAXIAWWDduration')) {\n      document.getElementById('cv_mo33PE4QAXIAWWDduration').style.display='none';\n    }\n    cv_mo33PE4QAXIAWWDloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo33PE4QAXIAWWDloadSwf(movieID, playerVersion) {\n   return _cv_mo33PE4QAXIAWWDloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo33PE4QAXIAWWDnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo33PE4QAXIAWWD', 0, h);\n}\n\nfunction cv_mo33PE4QAXIAWWDresetPlayer(w,h,bw,cc) {\n  cv_mo33PE4QAXIAWWDnewHeight(h);\n\n  cv_mo33PE4QAXIAWWDso.addVariable(\"resetBandwidth\", bw);\n  cv_mo33PE4QAXIAWWDso.addVariable(\"cacheCode\", cc);\n  cv_mo33PE4QAXIAWWDso.setAttribute(\"height\", h);\n  cv_mo33PE4QAXIAWWDso.setAttribute(\"width\", w);\n  cv_mo33PE4QAXIAWWDso.write(\"cv_mo33PE4QAXIAWWDflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo33PE4QAXIAWWDRollOverImg = new Image();\ncv_mo33PE4QAXIAWWDRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81JTzuFHyjS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo33PE4QAXIAWWDpreplay = document.getElementById('cv_mo33PE4QAXIAWWDpreplayImageId');\nif (cv_mo33PE4QAXIAWWDpreplay) {\n  cv_mo33PE4QAXIAWWDpreplay.onmouseover = function() {\n    cv_mo33PE4QAXIAWWDpreplay.src = \"http://ecx.images-amazon.com/images/I/81JTzuFHyjS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo33PE4QAXIAWWDpreplay.onmouseout = function() {\n    cv_mo33PE4QAXIAWWDpreplay.src = \"http://ecx.images-amazon.com/images/I/81JTzuFHyjS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo33PE4QAXIAWWDpreplay.parentNode;\n\n  var cv_mo33PE4QAXIAWWDcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_mo33PE4QAXIAWWD/185-2488423-4562533?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo33PE4QAXIAWWDcurrentClick) {\n      return cv_mo33PE4QAXIAWWDcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:30 MinsI've had the kindle HDX 8.9 for about a week now.  It's ok.  I also own an ipad and I'm trying not to compare the two but it is hard not to.  I agree with other reviewers that the amazon AppStore is lacking.  The kindle will play amazon movies without a hitch including prime if you are a member. I've needed mayday 3 times.  Twice for problems with downloading apps and once because of a problem with the camera.  The answer every time is reset the device.  Every time! Which doesn't work by the way.  One major annoyance is that when using the rear camera while in a magnetic case there is an animation that blocks your view.  It tells you to slide up your device.  The kindle basically doesn't want to be in a magnetic case while taking a pictured. However, since the magnetic case doesn't interfere with taking a picture it is just annoying while I blocks your view.  I hope that it will be removed in a future update.  At the very least, there should be a setting option that allows you to remove the reminder alert from the middle of the screen.  Other than that, the kindle is fine.  You just need to be conscious of the (limited) market you are buying into.", "Title": "Software could use an update, but it's ok", "Date": "November 28, 2013"}, {"Author": "M. Epstein", "ReviewID": "R10N0J4WB1S3AU", "Overall": "5.0", "Content": "Great tablet and a perfect way to enjoy Amazon Prime benefits.  Specifically, I LOVE being able to download TV shows and movies for the plane when I don't have wifi.  The tablet is fast and smart and the screen is beautiful.  I sold my iPad mini to get the HDX 8.9\" and so far I'm very pleased with my decision.", "Title": "Kindle Fire HDX 8.9\" is a beautiful tablet", "Date": "November 8, 2013"}, {"Author": "Calin N Borca", "ReviewID": "R134EFIVRZLYCO", "Overall": "3.0", "Content": "Kindle,  great reading device. Amazing screen and it's fast. Why only 3 stars then? This is supposed to be a media device on top of just being able to read books. Being that most media apps from Google aren't available on kindle, that's a full star off. On top of that the battery performance is pretty poor. The lack of apps, due to Amazon's greed I'm sure, makes this less of a media tablet and more of an overpriced digital reading device. Overall, these two big negatives make me wish I would have bought another device.", "Title": "want a media tablet? look somewhere else.", "Date": "May 30, 2014"}, {"Author": "JanJan", "ReviewID": "R1GR6NMELODWC4", "Overall": "3.0", "Content": "Sent it back and bought the newest version of the iPad.  Love iPad, the Kindle was anti-climatic.  Of course, I have an android phone (that I hate….waiting with bated breath to get a larger screen iPhone if/when they come out.  I also have a MacBook Pro.  I guess I'm just an apple girl.", "Title": "Returned it, just wasn't impressed", "Date": "May 30, 2014"}, {"Author": "Kripa T.", "ReviewID": "R1DO2C2EME11SJ", "Overall": "5.0", "Content": "I have had a first gen kindle but it was too slow and i wanted to upgrade it. I went for a refurbished Kindle HD. I was not happy as i had Apps crashing issues. I bought this when it went to $339 sale 2-3 weeks ago. As usual prime shipping i had it in 2 days. The color and picture quality is so vibrant. The sound is breath taking. Much better than IPAD mini or IPAD i have had. I am a prime member and it is a bonus that i could download my rental and certain prime videos. I have already bought kindle book rental for month of April. I also downloaded 2 books which is a free offer for kindle owners. I also love Kindle free time for kids and i can set the timings on weekdays and weekends. I do not need to monitor as the kindle shuts it off. I have not had a chance to experience May Day service but i am sure it is revolutionary. Amazon has decent number of Apps but would be great if they had google play available. I have HBO Go, directv App, ESPN app all working perfectly fine. It comes with a charger unlike the other Kindles which is a huge plus. After i bought it went on sale with a extra 10% off for PRIME members and i contacted CS reps and within 5 min i was refunded. So i ended up paying $305. Great price for this power house! If you are thinking of buying pull the trigger !!Update: used the camera much better than iPad mini and photos gets automatically stored in the cloud. Skype works perfect too.", "Title": "The Killer Kindle!", "Date": "April 15, 2014"}, {"Author": "F. One", "ReviewID": "R2Y2EVBCZSAUOV", "Overall": "4.0", "Content": "If you have Amazon Prime the Kindle Fire tables are the only mobile devices you can watch Amazon TV from.  The tablet it self is very fast, responsive, and light.  The display is is vibrant and sharp.  Kindle books and magazines function better than the kindle app for Android or IOS.  The only negative keeping this from being five stars is the abstinence of Google apps.  If Amazon gets these app this will be the perfect tablet for me hands down.", "Title": "Amazing but no Google support", "Date": "April 11, 2014"}, {"Author": "KulaKop", "ReviewID": "R33NHLMSRM3CDV", "Overall": "5.0", "Content": "Amazing product!!! Bought my 7 year old son the HDX 7 version and was so impressed by it that I bought the HDX 8.9 version for myself!!! I was an Apple guy for the last 10 years plus and this kindle has turned me into a traitor. Great everything. I live on Maui and this was delivered on the 10th of February from New Jersey it made it to me on the 11th!!!! One day?! Love AMAZON!!!!!!!!!!!!!!!!!", "Title": "The greatest thing since SLICED BREAD!!!!", "Date": "February 11, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R3BLO4QT6ARS1N", "Overall": "5.0", "Content": "Great tablet for Media, Surfing, and Amazon ecosystem.If you need a light-weight tablet for playing Media, for surfing or for using the Amazon ecosystem (Kindle e-reader, Amazon shopping, Amazon cloud service, Amazon Instant Video, etc) then this is it!  Well, I setup 3 of these for my wife and kids and while I found this tablet lacking on the technical/features side (I prefer Windows 8 tablets for that matter,) my wife and kids loved it, ironically, for these same reasons. Since it is a locked-down, and watered-down version of Android, it is not overly overwhelming in features, making it easier to use for kids and non-technical people. So this tablet fills this niche perfectly. And the 4G LTE option makes it a great portable tablet on the go (travel/beach/school/etc.)To nitpick, I'm surprised Amazon didn't add wireless-ac and Bluetooth mouse support in this hardware refresh, To nitpick even more, a 13MP or even 20MP rear camera would have been more attractive than 8MP for this price range. I also found its charger, though very cute and small, is also very slow, specially if the Kindle is charging in sleep mode and not in shutdown mode. For that slow charging, maybe Amazon should have added wireless charging as an added feature to cancel out this shortcoming (it will still be slow to charge, but at least it will be a convenient wireless charging :-) ) But this is all nitpicking;  this a 5-star product!If I were to pick the one thing this tablet shines most at, it is, not surprisingly, on the (Kindle) e-reader side. The text-to-speech feature in the reader is a very well done feature...", "Title": "Great tablet for Media, Surfing, and the Amazon ecosystem.", "Date": "February 9, 2014"}, {"Author": "Cheryl Bryant", "ReviewID": "RG3MF7V97JCHJ", "Overall": "5.0", "Content": "The help was printed in very tiny type and could not get it bigger so the help section was very hard to read.  Still have not figured out how to not have another person's notes show up on a book I am reading.  Screen is touchy at times and I end up in places I didn't really want to go to.  The Silk browser was hard to get used to.  Still haven't figured out how to add bookmarks but working on it.  Takes some time to boot up but very quick to shut off, just the opposite of the Paperwhite Kindle I have.  I use the HDX more for the games for the 1st grade student I tutor so the color and sound is great for him.  After a few weeks, I wasn't sorry I bought it but the learning curve was not fun.  I realize this review sounds negative but I do like the HDX but wish I would have known more about how to operate it when I bought it.", "Title": "Very handy once you get the hang of it", "Date": "February 7, 2014"}, {"Author": "Larry Garber", "ReviewID": "R3RP5SPFWD2OK6", "Overall": "5.0", "Content": "I love the speed, great display and it's very lightweight, the battery lasts all day.before I purchased the Kindle Fire 8.9\" HDX I had a concern that the screen would be to small, not so, it's a great size for home use and travel. I'm using it more now then my laptop. go Kindle fire HDX. I would recommend the Kindle fire HDX 8.9\" to anyone that is looking for a tablet or an e-reader. it's awesome.", "Title": "fast, lightweight, and fun.", "Date": "February 5, 2014"}, {"Author": "Edward Miller", "ReviewID": "R2LHRSG33J55WV", "Overall": "5.0", "Content": "I love the Kindle Fire HDX Display Wi Fi however I wish we had not accepted with Special Offers it just too much distraction. Will be contacting Amazon to see if we can drop \"Special Offers\".", "Title": "Kindle Fire HDX Display WI Fi, 16 GB Includes Special Offers", "Date": "February 2, 2014"}, {"Author": "brian", "ReviewID": "R1O7HPYS1CW6KE", "Overall": "5.0", "Content": "I got the kindle fire hdx 8.9  for my grand daughter.  She turned two years old on 7 dec 2013.I was amazed at how light weight it was, and the picture is crystal clear.  The camera on it takesexcellent pictures and  I feel it was well worth the $379.00 I paid for it. I think there are a lot ofapps at the kindle store that will help her improve her learning experience.", "Title": "kindle fire hdx 8.9", "Date": "February 1, 2014"}, {"Author": "Angela Bee Bee \"angela bee bee\"", "ReviewID": "R1WQ9ZW1YP2E2", "Overall": "5.0", "Content": "I love the bigger screen, the speed and the mayday button is amazing. I like the integration with Goodreads, you can quote directly from your book to GR, similar to Facebook. There is also a way now to select and copy and paste text from ebooks using the google search tool.Your Goodreads review shows up at the end of the book. The font inside book menus is still way too small and light gray, hard to read (definitions and translations, love the translator too). There is still also no way to customize the screen when reading except for the three colors they had before. I downloaded a screen dim app to dim the screen while reading and use sepia and that seems to help reduce eye strain.I also tried the whole whispersync thing through Audible. It's expensive and confusing but nice if you like to listen to books. The speaker could be louder, but it does have a headphone port.The text to speech works awesome.You can also take a screengrab jpg file by pressing and holding the volume down and power off button at the same time.The only thing I don't like is the lack of Google Apps. You can't even sideload them, it's very proprietary. If you are Amazon friendly, it's no big problem, but it will be annoying for i people to try to switch over. And you have to download a file management browser, like ES file browser to get to your files.I bought mine at Best Buy for $350 in January 2014.I love my new Kindle Fire HDX and can not imagine how I read for so long on my previous gen 7\". I am very happy with it.  I got a nice cover and stylus too that work great.Get one for yourself, you will not regret it.", "Title": "Love the Mayday and Goodreads, but no Google Apps", "Date": "February 1, 2014"}, {"Author": "lucy laudenbach", "ReviewID": "R26R23RDXFE6LL", "Overall": "1.0", "Content": "My kindle does not shut off . I cannot do a thing with it.I had it plugged in rather than battery. I need to know what to do . It must still be under warrenty.", "Title": "Kindle fire HDX will not turn off. What is wrong? What can I do to fix it?", "Date": "January 29, 2014"}, {"Author": "billyboy", "ReviewID": "R2JV67HP8L5ZUQ", "Overall": "2.0", "Content": "bad sound. My wife has a kindle fire small one it has better sound than my hdx 8.9.  It is hard to download apps and make them work like adobe for an example.  you download it and go to internet and click on things to view and it say to download adobe which I already did.  very touchy.  always have to start over.  I would recommend getting an apple ipad.  Bill.", "Title": "dont like it", "Date": "January 29, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R2JVN1JEBN7WXQ", "Overall": "1.0", "Content": "So if for example your cable company's app is somewhere else and it likely is NOT on amazon, you can't get it.  It's an incomplete tablet.  If you just want to use it to read, than it's fine.", "Title": "Can only get apps from the amazon store", "Date": "January 28, 2014"}, {"Author": "Ginger L. Simons", "ReviewID": "RIN3NY4VNH2JZ", "Overall": "3.0", "Content": "I have had three kindles. All with no problems until purchasing the kindle fire HDX. Half of the time it disconnects from my WiFi and I have to repeatedly reconnect.", "Title": "wifi issues", "Date": "January 28, 2014"}, {"Author": "Char Fuller", "ReviewID": "R3837C854NJU57", "Overall": "4.0", "Content": "It would have been nice to have written instructions come in the box with the Kindle Fire HDX.  Good overall.", "Title": "manual", "Date": "June 12, 2014"}, {"Author": "Keith Barber \"Computer Geek\"", "ReviewID": "RCB3SLMINK7GQ", "Overall": "5.0", "Content": "It took me 3 months to choose from the different Kindle models.  Mostly I will use this for reading on a cruise.  The tipping point for me to choose this model was the rear facing 8 megapixel camera.  The fact that it was $40 off in a sale enticed me to get it.", "Title": "Very pleased.  Glad this is my first tablet.", "Date": "June 10, 2014"}, {"Author": "Herb Reed", "ReviewID": "R3I6H3R3Y7C5QF", "Overall": "5.0", "Content": "My wife likes it very much, it was a gift for her, the only problem she is having, she can not get on facebook, she has tried several times with no luck. Other than that she enjoys it alot", "Title": "Her Kindle Fire HDX 8.9", "Date": "June 10, 2014"}, {"Author": "Holly S. Bedard \"Holly\"", "ReviewID": "R3M98TM11VZ4EO", "Overall": "5.0", "Content": "The Kindle Fire HDX is all that it claims in HD clarity. I love the portability and it is easy to use.", "Title": "Great clarity of images", "Date": "June 10, 2014"}, {"Author": "Kelly L. Kreahling", "ReviewID": "RUGVCB3UNSJQ7", "Overall": "5.0", "Content": "i highly recommend the new 8.9 kindle hdx its very easy to use great display and steaming movies and tv is smooth no interruptions and battery life almost twice my old kindle", "Title": "my new kindle", "Date": "June 10, 2014"}, {"Author": "Felipe Amigo", "ReviewID": "R2FSYTWGLU0IPV", "Overall": "5.0", "Content": "There is really nothing to dislike about it, you just have to get used to the launcher (the way it is displayed in comparison to other Android devices).There are many apps that I can sideload, but there are some key one that I use with Google that I would love to use with the Kindle Fire, but it doesn't mean that I don't like it.It is really snappy, slim, great sound, lovely picture, great battery life and well ... just love it!", "Title": "just love it... but man I miss not having the google play store", "Date": "June 10, 2014"}, {"Author": "CDF \"luv2teach\"", "ReviewID": "R7D0KEA7SIV13", "Overall": "5.0", "Content": "I love it!  I use it all the time.  I am glad this is what I chose because I find it easy to use. So far, no complaints.  I have had it for 6 months.", "Title": "My KIndle Fire", "Date": "June 9, 2014"}, {"Author": "W. Yee \"WY\"", "ReviewID": "R1177CM8RWM8F2", "Overall": "3.0", "Content": "One reason we bought the Kindle is to watch movies on Amazon Prime and have access to more recent movies that you pay for that are otherwise available only on DVD/Blu-Ray.  I believe that Amazon prime only is available on Ipads, computers, streaming boxes, smart TV's but definitely not on Android phones and tablets. The ipad, iPhone, and other I devices are not on my desired list.Amazon doesn't allow many Google apps to be installed such as maps, chrome, gmail (app) that work much better than the substitutes that are at their app store.  The browser app Silk they provide is really terrible.  When you use it to visit the Google search site, it really bogs down to almost not working.  If you use the Netflix app, it hardly works, just spins its wheels.What is disappointing about the Fire HDX is that I had expected the device to improve with time but it hasn't. It's on an island by itself with little reason to listen to its critics.  Though it is an Android device it doesn't take advantage of the large collection of great apps at the Android Play Store.  That makes it less than 2nd place if you consider Android and I devices to be 1 and 2 or 2 and 1.", "Title": "Disappointing in a way that makes it expensive.", "Date": "June 9, 2014"}, {"Author": "Oannas", "ReviewID": "R1XHGB795EJPNO", "Overall": "3.0", "Content": "A nice product if you don't mind being bumped off the Internet every 10 minutes. Even after buying a new docsis 3 modem, I still lose my connection just as frequently with the Silk browser. The problem persists even after Amazon sent replacement Kindles (one of which was a refurbished model that also turned off just as often).", "Title": "Silk Browser Stinks", "Date": "May 13, 2014"}, {"Author": "Robin Stone", "ReviewID": "R2Y1C40D7L1JLV", "Overall": "5.0", "Content": "I have the first Kindle fire and this newer HDX 8.9, if you have the cash spend the money on the 8.9 its a great laptop replacement. The color and speed is excellent.", "Title": "Got it last Christmas and I love it", "Date": "May 13, 2014"}, {"Author": "xraylarry", "ReviewID": "R2IT4M2093M4GN", "Overall": "1.0", "Content": "I was so excited to get this for my wife.  I would love to give this 5 stars. But, there is a problem with the camera that Kindle knows about and has not fixed.  It was my wife's 50th birthday, and the first thing I wanted to show her was how to use the camera.  We had bought a new Finite Amazon Folio Case and the DigitalsOnDemand 12 item accessory bundle. When the Kindle Fire is in the case and you turn on the camera, there is a message in the middle of the screen that says \"slide the kindle up.\" It stays there the whole time. This is a problem Kindle should easily be able to solve.  In fact there is a work around but you have to do it each time you turn the Kindle off.  Why?  It seems they are forcing you to buy the case that they sell.I will update this rating when Amazon fixes this problem.", "Title": "The Kindle Fire HDX 8.9 camera will not work correctly in the two cases we purchased from Amazon.", "Date": "May 13, 2014"}, {"Author": "Elizabeth Taylor", "ReviewID": "RNQ4BZMO62NOH", "Overall": "5.0", "Content": "I love it!  I use it almost exclusively for reading, the quality of the 'printed' page is great, crisp and easy to see/read.  I have recommended it to many people.", "Title": "I love it!", "Date": "April 30, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R33K0I7A58LELX", "Overall": "5.0", "Content": "It arrived on the date that it was expected.  She opened it when she got home from work and started charging it and started checking the books that she had bought while she was waiting for it.  She loved it.", "Title": "Kindle Fire HDX 8.9\"", "Date": "April 29, 2014"}, {"Author": "Avid Kindle Reader", "ReviewID": "RFC3D1I5I9589", "Overall": "5.0", "Content": "I have not figured it all out yet, but I am working on it.  It will be great when I get it all figured out. This is my sixth Kindle and I love all of them.  My favorites are the larger ones since I read so fast.  Buy it and try it.", "Title": "Myh newest one", "Date": "April 29, 2014"}, {"Author": "Charles S. Berg", "ReviewID": "R1QUA5L42DCOHG", "Overall": "4.0", "Content": "I have had the Kindle fire HD 64 for three weeks and it is an excellent product.  I would give it five stars except that I'm having occasional screen jitters and I can't obtain some of the apps I would like.  Otherwise I am very happy with the device.  Colors and clarity are excellent.  It is fast and easy to use.  I would recommend it to anyone who is interested in a tablet.", "Title": "My new Kindle Fire", "Date": "April 13, 2014"}, {"Author": "Hiromi Capelle", "ReviewID": "R11ZP3Z47I34QV", "Overall": "5.0", "Content": "There are many tablets out there but this has been the best for me.  I have more than one and feel that I kind of wasted my money on some.  I'll give them away and become the best friend in the world.  I guess that it will not become a complete waste of money!  I also have a Kindle Fire D 7\" screen with 32 GB and was very happy with that also.  Be sure when you chose your tablet that you chose one that fits your needs.  My need was more for entertainment and this is hands down the best.  For a work or office based tablet I may want to research more and might have chosen another.  What ever your choice I recommend this for entertainment!", "Title": "The best!", "Date": "April 13, 2014"}, {"Author": "Andrew Meyer", "ReviewID": "R2BHD9A1NH1XZI", "Overall": "5.0", "Content": "The Kindle does exactly what I wanted it to.  I can download movies/TV Series and watch them on airplanes.  It makes reading much easier and it let's me keep up with email in meetings at work without being distracted by endless chat messages.", "Title": "Great product", "Date": "April 13, 2014"}, {"Author": "Michael Huhndorf \"Apposite\"", "ReviewID": "RX1EL889ZNK6L", "Overall": "5.0", "Content": "This unit does it all! For years, various devices have been coming out that do a number of things well but I have never seen it all in one package like the Kindle Fire HDX! It has the web, it takes pictures, you can download books, subscribe to magazines and newspapers, immediately upload pictures to E-mail and  Facebook, Use Skype to speak face to face, print pictures,  take online photos, and play games. The apps are usually minimal in expense and books come with audibe capacity. One major selling  point was the size of the screen. The phones were just too small and I personally had no need for mobile phones.  Land lines suited us well without the extra expense and we had a satellite dish for our PC. I also did not want to go through changing phone numbers. When we do need a mobile phone, the Trac phones were good enough.It is not that I had not wanted something more usable. I was looking for something that  would sit nearby that didn't require being tethered to a chair and screen. this little jewel sits handily nearby and is a joy to use. Finally, the  right technology came along for us.", "Title": "This was the device I was waiting for!", "Date": "April 13, 2014"}, {"Author": "Sjfjoky48", "ReviewID": "R2RXDN0SD1X12C", "Overall": "5.0", "Content": "Very easy to work on and very fast on the internet.  A real necessity to keep handy for surfing, for reading, for games, etc.  Just a delight  to have and use.", "Title": "A Breeze To Work On", "Date": "April 13, 2014"}, {"Author": "Amazon Customer \"Ken\"", "ReviewID": "R3U2Z1U2S4EL2J", "Overall": "5.0", "Content": "I have used the customer service button three times now and have been very impressed with the knowledge and helpfulness of the people I have talked to. It is significantly better to talk to someone than texting or sending emails. I didn't reset the contrast on my screen when I first tried to use it in the sunlight, but after finding out how to do that AI have been very pleased.", "Title": "Love it", "Date": "April 11, 2014"}, {"Author": "Susan Kemmerling", "ReviewID": "R1PE58EVTOML9Y", "Overall": "5.0", "Content": "I use it mostly to read. I use it a lot for my online classes and it works great. I am not the most tech smart person but it is helping me learn and if I need help it is there.", "Title": "does what i need it to", "Date": "April 11, 2014"}, {"Author": "J Eric Hoehn", "ReviewID": "RVN8PYZWSHT6U", "Overall": "5.0", "Content": "Great for reading and entertainment on flights.  Some aps I have on android aren't there for Kindle yet, but I'm hoping they keep adding more.", "Title": "Excellent tablet", "Date": "April 11, 2014"}, {"Author": "K. Shortell \"knspaint\"", "ReviewID": "R1W56HY9P8HQT4", "Overall": "5.0", "Content": "I haven't owned a Kindle Fire HDX for long, but I love it already.  It is so much easier to use than other tablets I have tried, and it offers everything I need.  I will update this review as I use it more, and learn more about it.  So far, the only thing that I wish that the Kindle had is an expansion slot for micro sd cards.  One thing I really love is the ability to download Amazon Prime instant movies easily  so that I can watch them when wireless connection is not available.", "Title": "Kindle is the best!!!!!!!!", "Date": "April 11, 2014"}, {"Author": "Neilson", "ReviewID": "RBHYQ93YN6RDR", "Overall": "2.0", "Content": "sorry i cant find the \"ask question\" button, so i write this in review.most of the android device has SD slot for additional memory as i use almost 100GB for picture. for tiny 16g internal memory+5G cloud, it is merely enough for simple apps, some apps even need >1.5G!will drop my note 8 for this if there is a slot for SD card, so sad :(", "Title": "no expandable memory?", "Date": "April 8, 2014"}, {"Author": "JTF", "ReviewID": "R1L0D9DROFRBKL", "Overall": "3.0", "Content": "Not sure if this is a problem due to shipping or just a defective unit, but one of the speakers has a rattling that just won't go away. Just opened up my Kindle Fire HDX 8.9 brand new and wanted to see the quality of the speakers, and one rattles. Besides that.. love it so far! Easy to use/set up, and was happy to see all my Prime content automatically accessible on the device. Didn't purchase the extended warranty, so not sure how to go about sending it back to exchange for a non-defective unit.", "Title": "Busted Speaker On Arrival..", "Date": "April 8, 2014"}, {"Author": "Katie", "ReviewID": "R21AKUSKRK3PQU", "Overall": "4.0", "Content": "The apps could use some work but the overall quality is superb! And the May day feature is so helpful.", "Title": "great picture!", "Date": "April 8, 2014"}, {"Author": "robert clifton", "ReviewID": "REVRU6KFEDJAE", "Overall": "4.0", "Content": "display was awesome apps were easy to figure out and install and were very plentiful just no phone app and that was a main reason for purchase so i had to return it and go with a phone.", "Title": "good display and lots of features apps were easy", "Date": "March 18, 2014"}, {"Author": "H", "ReviewID": "R1ASC2Q3747RXM", "Overall": "5.0", "Content": "This came lickity split and my husband is convinced I am the best wife ever.... which I am.  Great product.", "Title": "Great Gift", "Date": "March 18, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R19D726BKMEW0W", "Overall": "4.0", "Content": "I love the Kindle, and especially being able to go on the Internet without going to my computer.  I gave it a 4 because there was so little documentation with it.  I actually do read stuff like that, and it's helpful to someone like me.  I'm \"tech-savvy\" but not \"gadget-savvy.\"  If there had been more help/documentation, I would have given it a \"5\".  I would recommend it to anyone except someone who needs a lot of office-type work.", "Title": "It's wonderful", "Date": "March 10, 2014"}, {"Author": "Kindle Customer", "ReviewID": "RV8OZF5DOUTI9", "Overall": "4.0", "Content": "I do love my new Kindle HDX, but there is one little flaw that is very annoying, especially when reading a book that illustrations, charts, etc.  I find that in books, and some other applications, the pinch-to-expand android feature will not work.  I recently got $11+ Kindle book with charts and they showed up so small you would need a magnifying glass to see them.  The important info in these charts was unreadable on the HDX.  I had to download the book to my old Samsung tablet so I could expand the material and read it.Other than that one drawback, the HDX is a great tablet.  Very speedy processor, unequaled display.  If you can live without being able to use the pinch-to-expand feature most of the time, then you will be very happy with the Kindle HDX.  BTW, enlarging the print size in settings did not make the material more readable for me.  It's possible there may be a way to PTE to work; I haven't taken time to dig into it yet.", "Title": "Perfect, But Not Quite", "Date": "March 10, 2014"}, {"Author": "Randy", "ReviewID": "R1V28VAZ77I48K", "Overall": "5.0", "Content": "This device was as expected. It is very fast, downloaded videos, music and books well and the screen is beyond description. Took a little while to adapt to it, from other kindle, but the instant help was fantastic, dare I say awesome? Hate that word as it is overused, but in this case, adept. The little girl that helped us was on the line in less then 10 seconds and answered our question, in less time than that. I had tried to get my answer using the FAQ's but could not find it, but the instant help was a God send. All the required screen movements were outlined by the tech guru. I had to laugh at my wife, as we could see the teckie on our screen as she assisted us, and my wife was standing behind me naked and quickly dived away, as she thought the teckie could see us too. I told her not to worry as the view was only one way. Well, I hope it was only one way, or if not, the teckie got a great view. Believe me, this 8.9 HDX is one great device. If you buy it, you will not be sorry. One more thing, the large storage is a must. We downloaded the entire first season of StarTrek DS9, and it barely used 10% of our memory.", "Title": "Great device", "Date": "March 10, 2014"}, {"Author": "Phillip", "ReviewID": "R31FLU94Q09U52", "Overall": "5.0", "Content": "Gave this as a gift but tried it out during setup and was very impressed. The Verizon rep did not want to give it back to us after programming.", "Title": "Great screen resolution", "Date": "March 10, 2014"}, {"Author": "ann m greene", "ReviewID": "R3JRLA783MHA97", "Overall": "5.0", "Content": "Love and appreciate the May day feature. I have used this feature and found it extremely helpful,my questions are answered . The technicians are friendly and eager to help.", "Title": "new kindle", "Date": "March 10, 2014"}, {"Author": "Lura Claywell \"fedepi\"", "ReviewID": "R1FU4P7D72787V", "Overall": "5.0", "Content": "I love this kindle fire hdx 8.9. You can do alot with it. Picture is sharp and clear. Love it", "Title": "Love this kindle", "Date": "March 10, 2014"}, {"Author": "Matt", "ReviewID": "R10YK0RFDMCPIE", "Overall": "5.0", "Content": "Bought this for my wife for Valentines day and she loves it. Very well made and we are happy with it.Streams movies fast with my prime account also.", "Title": "great product", "Date": "March 9, 2014"}, {"Author": "Judy", "ReviewID": "R1YQBC4UWI7Q7J", "Overall": "5.0", "Content": "I am so happy with my new kindle fire HDX 8.9.  I use it every day rather than getting on my desk computer.  The email set up is so efficient and convenient.  I've had the regular kindle fire for a couple of years and was happy with it, but this is so much faster and more fun.  I haven't tried the front camera yet, but the rear camera takes great pictures.  I've used the photo editing and sent the pictures on to friends.  Amazon has really done a great job on this tablet and made it very user friendly.  I was able to.buy it when it was $40 off so the price was exceptionally good.", "Title": "What a wonderful tablet!", "Date": "March 9, 2014"}, {"Author": "Linda Starry", "ReviewID": "RC41A74B1HC4H", "Overall": "5.0", "Content": "It is every thing I thought it would be. Can not put it down. I have the Kindle Fire and this is so much better.", "Title": "I love it.", "Date": "March 9, 2014"}, {"Author": "THOMAS R HOLBROOK", "ReviewID": "R2FGNQZ08A4DNZ", "Overall": "4.0", "Content": "But some fonts to small for my old eyes! Very good apps and the prime membership is g r eat for finding.items to buy!", "Title": "Gret so far", "Date": "March 9, 2014"}, {"Author": "Sharon Mcclellan \"Garden Nana\"", "ReviewID": "R2V42R3GVP6MB0", "Overall": "5.0", "Content": "The display on this Kindle is awesome.  Even clearer and brighter than my HD tv!  Love the rear facing camera, so easy to take pictures of my grand children in their sports activities.  Very pleased with the Kindle.", "Title": "Very happy with the Kindle HDX 8.9.", "Date": "March 9, 2014"}, {"Author": "kato", "ReviewID": "R24EGT1HG1GPKU", "Overall": "5.0", "Content": "The Kindle is fun and I'm enjoying getting to know it!  So far so good.....I need to figure out how to get the movies from the kindle to my tv....", "Title": "Kindle Fire HDX 8.9", "Date": "March 7, 2014"}, {"Author": "Katherine", "ReviewID": "R1NKL7B7SJEIGX", "Overall": "5.0", "Content": "I would definitely recommend anyone to buy this! Its fantastic!! I love all the books I can get on it.", "Title": "Great reader!!", "Date": "March 7, 2014"}, {"Author": "anonymous", "ReviewID": "R3LOKMIPB0X5CH", "Overall": "5.0", "Content": "Tried many tablets, even ones with detachable keyboards, and went back to the one I trust most from  my first one - Kindle. Great product and the quality is superior. Very fast and I love the HD version. Great unit for the price, especially if you're not looking for something for word processing or as your main \"laptop\" as it is not that, but a great tablet. If you're familiar with the Kindle family, this is a great upgrade.", "Title": "GREAT", "Date": "March 5, 2014"}, {"Author": "Bobbie Heaps", "ReviewID": "R5V8U0R645F89", "Overall": "5.0", "Content": "I'm still getting used to this new Kindle.  I had the regular HD and loved it, but the interface is different with this one.  I've also added a bluetooth mouse which works perfectly.  I miss the easy ability of borrowing books from the Library and I'm not sure I've perfected it with this model.  But this is my 4th Kindle and I'm very happy with the performance and the ability of adding android apps which is why I purchased it.", "Title": "Kindle Fire HDX 8.9", "Date": "March 5, 2014"}, {"Author": "Cindy L. Thompson", "ReviewID": "R4Q3FROJJWMMY", "Overall": "5.0", "Content": "so far everything I have used it for and what I have seen that it can be used for is great, I love the clarity and the vivid colors. I love it and very glad I purchased it", "Title": "My Kindle Fire HDX 8.9\"", "Date": "March 5, 2014"}, {"Author": "B. Kozloski", "ReviewID": "R2FV6ULXVRFMTA", "Overall": "5.0", "Content": "Although I haave not used all the settings available, I like the ones I use very much.  It is so easy to use.", "Title": "Glad I bought.  I take it with me everywhere I go", "Date": "March 5, 2014"}, {"Author": "jacqueline grider", "ReviewID": "R2072Y2SMSOAHS", "Overall": "5.0", "Content": "Very wonderful new kindle. I just  ordered number 4 kindle! A new e reader to go along with my kidle fire!", "Title": "Another great product", "Date": "March 5, 2014"}, {"Author": "Katherine C.", "ReviewID": "R2ZMW09WXDMPHS", "Overall": "5.0", "Content": "Love love love my Kindle Fire HDX 8.9\"!!  I went with no ads and 64 GB, it goes everywhere with me.  I have my books, movies, games, facebook, etc. all on that one tablet which is fantastic.  The display is so clear, I love watching movies/shows on it!", "Title": "Love love love!", "Date": "March 5, 2014"}, {"Author": "Barbara Ingram", "ReviewID": "R2I47M74KY8VBD", "Overall": "5.0", "Content": "I HAVE ENJOYED IT VERY MUCH.  MY GROWN CHILDRED ARE ALSO GOING TO THINK ABOUT BUYING IT.  I WAS DISPOINTED THAT IT WENT ON SALE RIGHT AFTER I BOUGHT IT.", "Title": "GOOD", "Date": "March 5, 2014"}, {"Author": "wolfie", "ReviewID": "R2HLJ7TDYQP6T5", "Overall": "4.0", "Content": "this kindle fire hdx is one of those things.  my wife has pretty much taken it over but thats ok it keeps her entertained", "Title": "there are somethings that just work well", "Date": "March 5, 2014"}, {"Author": "James Miles", "ReviewID": "R37YBAA5PY2VY8", "Overall": "5.0", "Content": "I bought the Kindle HDX 8.9\" for my wife and kids.  She primarily uses is to catch up on her favorite Netflix or Amazon Prime shows - and she loves it.  The screen is brilliant, the controls are simple, and the form is lightweight and elegent.  She takes it all over the house since it so so portable and sturdy.  My boys also use the HDX for their games and for the internet access.  So far so good, I would recommend 8.9\" HDX to anyone who is interested in a simple tablet and doesn't need the full computer capability of a laptop or desktop.", "Title": "Wonderful Device", "Date": "March 5, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R3BNWEF3SQYVW4", "Overall": "5.0", "Content": "I really chose the Kindle Fire HDX 8.9\" because of the camera. I read many comparsions between IPad  Air and the Kindle Fire HDX 9.8\" and they rated equal on some areas, but the camera was rated clearer, etc on the KFire. I really enjoy the weight and the quickness of operation. I would recommend it to anyone that enjoys games, reading, taking pictures and many other good features.", "Title": "Kindle Fire HDX 8.9\",", "Date": "March 5, 2014"}, {"Author": "generic customer1", "ReviewID": "R1NGZKVXRB25DZ", "Overall": "5.0", "Content": "I had hesitated to purchase a tablet since I have a computer but I liked the idea of reading ebooks instead of having all these paper books. This tablet shows a very clear, crisp & sharp page, easy to read; & no problem to return to the exact place I had stopped reading. Easy & quick to purchase a book; & all the books are on this one tablet. I also enjoy watching all the TED talks on the Kindle; I have no problem hearing & understanding what is said. I'm glad I bought this Kindle Fire.", "Title": "great tablet!", "Date": "February 13, 2014"}, {"Author": "maryscopes", "ReviewID": "R1F2VMQAPXA92", "Overall": "5.0", "Content": "I love it.  I watched a t.v. show on it, and it is great.  I am still exploring all the things I can do with it.  I love the camera front and back.  I am like a kid with a new toy.  At 68, that is a good thing to have something new to play with.", "Title": "8.9 Kindle Fire HDX", "Date": "February 8, 2014"}, {"Author": "Barbara O. Cassel \"Barcee\"", "ReviewID": "R340Z3JYUHC3NO", "Overall": "5.0", "Content": "This is my first android and I am loving it. Very convenient way to keep track of emails when travelling.", "Title": "Beautiful Graffics", "Date": "February 7, 2014"}, {"Author": "d a", "ReviewID": "R2EA2XD13F84UV", "Overall": "5.0", "Content": "I was given the new Kindle Fire HDX 8.9\" by my wonderful husband for Christmas, and I love it!  I had no idea how much I would enjoy it.  I have downloaded games, accessed my email, etc.  It is easy to use, it has a beautiful screen, I've accessed the online chat \"help\", which was also great.", "Title": "Love My Kindle Fire!", "Date": "February 7, 2014"}, {"Author": "denise hoffman", "ReviewID": "R2XCQVGM8C6J8A", "Overall": "5.0", "Content": "I ABSOLUTELY LOVE MY KINDLE FIRE HDX 8.9. THIS IS THE FIRST NOTEBOOK I'VE EVER HAD. GREAT COLOR SCREEN. I LOVE THE SIZE. IT'S LIGHT WEIGHT. EASY TO USE. I LIKE THE MAYDAY OPTION BECAUSE I'M NOT GREAT WITH COMPUTERS.", "Title": "KINDLE FIRE HDX 8.9", "Date": "February 3, 2014"}, {"Author": "G. Thompson", "ReviewID": "RP4VYJQXNFEK3", "Overall": "5.0", "Content": "Great clarity in the new technology for the display.  Easy to use with new features causing thetablet to offer help even when no help is requested.  I have a first generation Fire and loved it too.This one is better in every way, sound, display, function.  Love reading on it (my first love), but alsonow love going to the web, webcam, games, videos, my personal photos....Truly worth all myanxiety about getting a new reader/tablet.  I love it!", "Title": "I love it!", "Date": "February 3, 2014"}, {"Author": "Kenneth", "ReviewID": "R3OR2AA7VP34OW", "Overall": "5.0", "Content": "The HD quality is amazing,  love the 8.9\" screen and the one touch help with face talk is awesome, thanks Amazon!", "Title": "I got mine, what are you waiting for? :-)", "Date": "January 31, 2014"}, {"Author": "Ruby \"RNR \"history fan\"\"", "ReviewID": "R2CAHT4UNUGGSD", "Overall": "4.0", "Content": "Pictures are sharp & clear. Wish there was a Zoom Feature.Not supporting Adobe Flash Player is the biggest letdown. I can't view anyone's video's on facebook. The bigger screen is much better and the wi-fi & Verizon support is great.", "Title": "Love It except it does not support Adobe Flash", "Date": "January 31, 2014"}, {"Author": "Jill Nagle", "ReviewID": "R3M4E2NKM1DVRU", "Overall": "5.0", "Content": "I have looked for two years at all the tablets as they appeared on the store shelves. This is the first tablet that did everything I wanted and is fast. The battery lasts for 12 hours just like advertised. It is my \"go to\" minny computer and my reader all in one. I appreciate the thought that went into all the desin features. Particularly the reading features. Now I can adjust the back lighting to white or black, zoom in and out or c change the text font very quickly and easily. I am very happy with my new toy. Oh, did I mention how much I enjoy watching movies on my Kindle. And it takes a very clear photo from front or back. Thank you Amazon.", "Title": "Kindle FIRE HDX 8.9\"", "Date": "January 31, 2014"}, {"Author": "Rob Hanna", "ReviewID": "R3E6P8JG1H83VJ", "Overall": "5.0", "Content": "Absolutely love everything about it! Easy to use, great resolution, lightweight! So easy to download books, apps, etc. I take it everywhere.", "Title": "Absolutely love everything about it!", "Date": "January 31, 2014"}, {"Author": "Petr", "ReviewID": "R2BFP14Q7X5CRV", "Overall": "5.0", "Content": "Engineering masterpiece. For such price this is the best tablet on market. Easy to use, good battery life, awesome screen and amazon features!", "Title": "God bless America!", "Date": "January 31, 2014"}, {"Author": "cboo1970", "ReviewID": "R1E1YEN7ZURQA9", "Overall": "5.0", "Content": "I don't have much to say except I love my HDX. I use it more than my computer and I use it for everything. If you are looking for a tablet, you can't go wrong with it.", "Title": "Love it!!", "Date": "January 29, 2014"}, {"Author": "Carol Weeks \"Carol Weeks Speaks!\"", "ReviewID": "RUTX944RRYRXS", "Overall": "5.0", "Content": "My first Kindle was 2nd generation, so this was quite a change for me.  The colors are brilliant.  I keep expecting something I'm watching to jump out into my lap!  Love the apps.  Battery charge is very good, but of course, games eat up the battery pretty quickly.  I was able to load my e-mail, facebook, twitter, etc. very easily.  Books are wonderful to read and I love the highlight function.  I like the size of it and the weight.  I bought a beautiful Belkin cover that fits it perfectly.  I bought the cover in the Kindle store.  The speed is incredible. It is instantly on and ready to go.  The camera takes excellent pictures, although it's a bit bulky to actually take the pictures.  I'm used to a much smaller phone with camera.", "Title": "Love at First Sight!", "Date": "January 29, 2014"}, {"Author": "Timothy D Parker", "ReviewID": "R3EDLKLNA6J6QK", "Overall": "4.0", "Content": "Great device great hardware software is restrictive for customization....home screen you can't change the background, permanently change the carousel or turn it off. I don't mind the special offers but they don't open the device to it's fullest. If you have a decent idea what you want to do in a tablet and know how to use it don't get this one. If you want a tablet that just works \"Mac style\" with out the cost get this one. If you have enough devices to do what you want with any how (like myself) this is a great addition to the arsenal.", "Title": "Great Device", "Date": "January 29, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00D4BO224", "Features": null, "ImgURL": null, "Name": null}}