{"Reviews": [{"Title": "Love it", "Author": "Carla Jolly", "ReviewID": "RNNO8PR1LTR34", "Overall": "5.0", "Content": "Works Great!!! Worth every penny I spent on it! Bought it for my little girl and I belive she will will be very excited Christmas morning :)", "Date": "November 27, 2013"}, {"Title": "Granddaughter's Christmas Present", "Author": "J. Kratzer", "ReviewID": "R21HP7ECJFXD07", "Overall": "4.0", "Content": "My granddaughter is 8 years old and loves this netbook.  She calls it her laptop and uses it for math tutoring and reading and games.  The camera only takes selfies, but she is in to that so she is having fun with it.", "Date": "January 23, 2014"}, {"Title": "IT SUCKS", "Author": "mays alzihery", "ReviewID": "R39XUPU3HJBMMX", "Overall": "1.0", "Content": "This thing does not work. My baby girl used it once before it started to freez and not turn on. The screen sucks, you can't view or do anything with it.", "Date": "January 20, 2014"}, {"Title": "Not for everyone.", "Author": "libbyd", "ReviewID": "R3FUA3B1KPETNU", "Overall": "4.0", "Content": "This a good product. I would only recommend it to kids that just started to learn a laptop or a tablet.", "Date": "January 9, 2014"}, {"Title": "dont like this \"laptop\"", "Author": "Kendra", "ReviewID": "R2WI6V26N87YI9", "Overall": "1.0", "Content": "it doesn't have any games in the google play store ti reads that it is compatible with, its very very slow, and does not work like a computer at all. not happy with this product at all", "Date": "January 4, 2014"}, {"Title": "Nice", "Author": "Michelle Bridges", "ReviewID": "R3IZ4JMLUYP9WZ", "Overall": "4.0", "Content": "My rating is 4 because the netbook is great. I originally thought I was ordering a tablet with a keyboard, but I received a netbook. Net book is better with more features.", "Date": "December 31, 2013"}, {"Title": "Good for kids.", "Author": "Tammy", "ReviewID": "R3BZY0P90NYUMQ", "Overall": "3.0", "Content": "I bought this for my 5 year old who was obsessed with my laptop. It is great for her for some kids games and online but that's about it. It would be a lot better if the screen was touch screen. The one problem we do have is a lot of the games you download from google play is stuck in tablet mode and will only show the game on the screen sideways.", "Date": "December 31, 2013"}, {"Title": "laptop had virus", "Author": "Shanna", "ReviewID": "R1PXUNH8NPBROL", "Overall": "1.0", "Content": "Laptop had virus. It was for my daughter. ...The next day it was moving slow. ..wouldn't allow us to getOn the Internet.  The posting also said it was a tablet & a laptop. ...it's only laptop.  False advertising", "Date": "December 29, 2013"}, {"Title": "nice for the price!", "Author": "Pepper power", "ReviewID": "R20I8GN00F4ZG", "Overall": "4.0", "Content": "This is a great Android device for a great price..  I did have a little problem with the mouse but it was easily resolved by using a plug-n-play wireless mouse..  My wife is happy to have her pink Android. Thank You!", "Date": "December 26, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DUIZYR8"}}