{"Reviews": [{"Author": "ravenrain", "ReviewID": "RX8HX10NZ07RS", "Overall": "4.0", "Content": "it was cheap perfect for my five year old.takes it everywhere he goes. battery live really low. takes a beating my son has dropped it a few times. still ticking.", "Title": "nice", "Date": "January 8, 2014"}, {"Author": "Cannaoil Queen", "ReviewID": "R31JIROBYPE8MY", "Overall": "5.0", "Content": "My son just turned 4.  We decided to purchase this for him so he would leave his older brothers ipad mini alone & it is awesome!", "Title": "Perfect Gift", "Date": "February 19, 2014"}, {"Author": "erin", "ReviewID": "R393XJP8FFJF0M", "Overall": "4.0", "Content": "It is a good tablet except when powering it on sometimes it takes a long time to come on. At the price it is at it is a good deal.", "Title": "one thing wrong", "Date": "December 28, 2013"}, {"Author": "clayton aguilera", "ReviewID": "RSXRFEC27HJCI", "Overall": "4.0", "Content": "Tablet works pretty well. Battery life is short but can live with that. Biggest complaint is the volume is way to low. Is there a fix for this?As a benchmark Plants vs Zombies 2 runs slow. Can be kind of helpful in planning but infuriating when the touch screen doesn't want to work.Most other apps work well though and it serves it's purpose. Just sucks that I can't hear the audio very well. No Netflix or youtube unless the source audio is high.Bought it to play simple apps and read kindle and for that it does a good job.", "Title": "Volume low and a little slow", "Date": "April 19, 2014"}, {"Author": "svmkit oh", "ReviewID": "R1R3X0JLEJE48M", "Overall": "3.0", "Content": "The battery does not last very long and is not very efficient.  I have to constantly turn off apps in the app manager to prevent battery drain. The charger that came with the tablet is short and does not work consistently.I was able to find and download apps quickly. I like the front page. It is easy to customize this tablet.Skype works great on this tablet. It provides my family an additional device to Skype on, and we like that.The tablet usually works at a decent speed. Sometimes it sounds loud. The tablet makes much more noise than my laptop. The tablet sounds like a full size computer sometimes. It can be annoying.", "Title": "Generic tablet, worth it's price", "Date": "April 16, 2014"}], "ProductInfo": {"Price": "$56.45", "ProductID": "B00DE0C7R2", "Features": "NULL", "ImgURL": "NULL", "Name": "Black Color 7.0 Android 4.0 Tablet Pc Computer 4gb Wifi, Camera, Youtube, Games , Skype Video Calling &Netflix; Movies"}}