{"Reviews": [{"Author": "Daisy S \"Daisy S\"", "ReviewID": "R3R66LZ6ZVN4Q6", "Overall": "5.0", "Content": "For almost months now, I have owned this tablet and it has run wonderfully for  me.Because I used it so much, I have tested thoroughly  and found that it does have overall advantages. So as a techie, I tested this tablet out and below I will list what I have found to be the Pros and Cons of this tablet and have listed what I personally discovered. Then this will hopefully help you to decide if this is the right tablet for you or not...(By the way, to let you know,Something to consider: If you are looking for a COMPACT VERY PORTABLE and lightweight WiFi only tablet (and do not need the phone part), consider this tablet. (This is my favorite size because I can carry in my purse, tote, gym bag etc so easily! While it does not have every bell and whistle installed on it, it is a good choice for: Checking emails, Getting Online, Looking at Pictures, Watching Home Movies.Here are the Pros and the Cons below.PROS:1- WiFi connects easily and the signal is SUPERB in most places I tested. (Found the WiFi signal is VERY STRONG in my home and even in my backyard). This model has the strongest WiFi signal of any tablet or phone that I own! And it stays on the WiFi for long distances without dropping the signal EVER!2- The advantage of having a SD card slot that will hold up to 64GB.3- Small and lightweight. Comfortable to carry around and place in backpack or briefcase easily.4- Micro USB Port - This is common in most tablets these days, but the older Tab 2 line did not have micro port but the propriety wider port.5- Screen clarity - For me, I found this screen easy to read eBooks on and view internet pages.CONS:- 8GB internal storage - this it the advertized storage before Samsung added the OS, apps, Touch Wiz and because the OS takes up room, apps etc, take up room, the tablet just has about 4.7GB in the internal storage when you receive the tablet. No problem really I still have over 4 GB left on mine after all of my apps I added from Playstore.Bottom line and Summary:** Price and New to Tablet Person (or for a child/student) - For the low cost of about 160 (or less if used) dollars, this tablet will make a very nice FIRST TABLET or a TABLET FOR KIDS as it is a lower cost tablet that is easy to learn and has lots of features for the money. For just 160 dollars or so new, I find this a very good buy and this tablet may just be the one for you.** Experienced Tablet Person - If this is NOT your first tablet and you want a higher end tablet, and want to spend just a little bit more say about 90 more dollars, then you may want to consider the Tab 3 8.0 with 16GB of internal storage and larger screen etc. Also there are many very nice 7 inch tablets out there to choose from that have better specs and better screen resolution and better internal storage.If you are to have any questions about this tablet, you may ask me in the comment section and I will answer right away.", "Title": "This compact tablet is easy to carry around, easy to learn with nice features! Detailed Review", "Date": "July 25, 2013"}, {"Author": "rpv", "ReviewID": "R78ORS5ALXE5G", "Overall": "4.0", "Content": "There are too many tablets these days, right?! Samsung's third generation of Galaxy Tab series is highly anticipated and for this price point phenomenal. I have been using Galaxy Tab 2 and I will compare and contrast here. I played around with review units of all sizes and I have since returned them. My reviews are unbiased and neutral! First, if you have not had any tablets before, Get THIS! Yes, Get this 7\". It is ideal for plane trips, long journeys. I had used a 7\" Tablet on a long journey to listen to songs and read epub books (Aldiko) and it was a very pleasant experience. 7\" form factor is lightweight, compact and great. If you are a bit experienced and can afford it, I highly recommend the 8\". In my opinion 8\" is the maximum value for the money and features and hence I gave 8\" a 5 star. I gave 7\" a 4 star (but no means undermining it). I gave the 10\" also a 4 star because of some strange spec `limitations'.Samsung has introduced 7\", 8\" and 10.1\" of the Tab 3 series. They are entering all form factors. As I know they have something in 4, 5, 6, 7, 8, 10\" lines. Woo.. All of the 7, 8, 10\" Galaxy Tabs come in white and golden brown color. My preference is white color. Looks pretty!Let's start off with salient points of all of the Galaxy Tab 3 series. I will later compare with the previous Tab 2 model.7-inch tablet: 1024 x 600, Marvell dual-core 1.2GHz processor, 1GB RAM, 8GB built-in storage (ROM), a microSD card slot (up to 64 GB), Camera: 3MP rear-facing, 1.3MP front-facing and weighs 10.58 oz. (300 grams). Android 4.1.28-inch model: 1280 x 800, Exynos 1.5GHz dual-core processor, 1.5GB ram, 16GB of built-in storage (ROM), a microSD slot (up to 64 GB), Camera: 5MP rear-facing, 1.3MP front-facing and weighs 10.9 oz. (309 grams) Android 4.210.1-inch model: 1280 x 800,  Intel Atom 1.6GHz Z2560 dual-core processor, 1GB RAM, a 16GB built-in storage (ROM), a microSD slot (up to 64 GB), Camera: 3.2MP rear-facing, 1.3MP front-facing and weighs 17.99 oz. (510 grams). Android 4.2I am not going into other details like accelerometer etc. as they are all standard these days, Audio support - AAC, AMR, MP3, OGG, WMA/ASF, 3GA/M4A, FLAC, WAV; MP3/MP4/Music Tones; Music Player; Ringtones, Polyphonic. Video support: AVI/DIVX, WMV/ASF, FLV, MKV, MP4/3GP, WEBM; Video Player; Video Streaming. Software is current of release date, and it is expected could be upgraded as next version Android 5 Key Lime Pie. (Currently targeted for Oct 2013). Key Lime Pie's one of the main touting points is compatibility to avoid fragmentation, so I can foresee, all of these models being able to upgrade if Google keeps their promise.The 7\" has a physical home button so are others in the series.  Also has capacitive Back and Menu buttons. Camera is a 1.3-megapixel front-facing camera for skype, and a 3-megapixel rear-facing camera. It is also equipped with an IR blaster so it will work as a universal remote on both your TV and cable box. Camera is only so and so, and I will not rely on it to produce outstanding photos. Weighs only 300 gm. 64 GB SD card is awesome! With prices plummeting for 64 GB cards, it is a great boon. Put all your music, books, photos on the SD card and you have a powerful computer in hand always! I personally use the 64 GB microSD card on my mobile devices. Get this mobileUltra (SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging.Galaxy Tab 2 is 345 grams, so Tab 3 is lighter by 45 grams.  Processors are similar 1.2 GHz dual core in Tab 3 Vs 1 GHz dual core in Tab 2. Resolutions are same with Tab 2 1024 x 600 pixels (~170 ppi pixel density). Tab 3 supports up to 64 GB whereas Tab2 is 32 GB. Not a big deal unless you have tons of video/photo/ebooks/music you want to carry with you all the time. I use a mixture of on device storage + Google Music + box for my data needs.  Battery is also same between Tab 2 and Tab 3 7\" versions - Non-removable Li-Ion 4000 mAh battery.Both have Bluetooth 3.0.  I cannot confirm still if Tab 3 7\" supports OTG.  I know for sure Tab 3 8\" supports as I tested it.  USB Host is one of the most undernoticed features of Androids and is in my opinion one of the best features compared to iPad lines. What this means you get a USB Host cable also otherwise called OTG (On the Go) cables and plug in your USB thumb drive or other USB devices and the device recognizes it. I have used it with Alfa AWUS036H for a wireless project with Android PCAP Capture from reputable Kismet wireless.  Another much ignored feature is the TV-out (via MHL A/V link). Unfortunately the 7\" does not support it whereas 8in and 10.1 in supports it. You can connect Galaxy devices to a TV to make it truly a fantastic computer if the device supports MHL. Throw in a Bluetooth keyboard and it is awesome. Leo Laporte's TwIT TV which is Internet based show has one full episode in Know How on covering this topic. GPS was spot on and I tried multiple GPS apps. It was bright outdoors (had to crank the brightness all the way up). I personally use Navigon from Garmin and have downloaded several apps.Finally, believe me, don't get mired in the spec game. 7\" is equally capable as a 8in for `most' day to day apps. If you are reading books, browsing, listening to music, looking at photos 7\" is more than enough. Samsung is creating markets for all form factors and I would consider this as an exploratory stage. Just like Ford or Toyota has cars in different shapes, sizes and price range, so are the tablet vendors now. Remember the laptop wars, 10\", 12\" 13\", 15, 17 and even some 19\" if I remember right few years ago. We used to debate endlessly which laptop sizes are better, which has better speakers and so on. The time has come to fight it out for tablets!I tried following apps and they just worked awesome. A tablet is only as good as the apps you have and how productive it makes you. It's almost like the camera/lens analogy in the DSLR space. What good it is to have a great DSLR body if you have no good lens? Same with Tablet body and apps you have.WolframAlpha (I can go on for hours praising this. This is a truly genius app powered by hundreds of supercomputers in the background. Wolfram is a computational genius). Well worth the $3 price.Withings HealthMate. (another remarkable app great UI/UX). I am getting the Pulse device as soon as it hit stores. I have been using Fitbit and just itching to get the Pulse as I like the intergrated weight/track runs in one app)Aldiko Book Reader Premium (absolutely love it)Amazon MobileAndroid StatusAndroid Central app (great and must have for Android users)AndroidifyAngry Birds (Space/Seasons)Asphalt 7Amazon App StoreBattery Monitor Widget Pro (a great app)BeyondPod (excellent for podcasts, I haven't used Pocketcast, some friends say it is very good too)BoxCar Maintenance Reminder ProChromeCloudShark UploadCNET TVDespicable Me Game! And weather widget (cute for kids)Dictionary M-W PremiumDragonvaleNAVIGON (from Garmin - offline maps)Google Navigation/Earth/Maps using a portable MiFi boxGoogle Currents (nice way to read News)Google Keep/Keboard/Drive/Search/Books/Voice/HangoutsDraw SomethingEbayLinkedinGoogle Music (Awesome, I have now upto 10,000 songs halfway through Google's 20K Limit)Tapatalk HD (awesome forum browsing app)OverDrive Media Console: Library eBooks & AudiobooksMicrosoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTerminal Emulator (still need to use vi, yes this is it)TweetCaster Pro for AndroidASIN:B007R6PKBY Twit.TvSkypeSphero (Awesome bluetooth ball game)RealCalc Plus (Awesome calculator app)Tweetcaster Pro (again awesomeness)Plenty of WidgetsAsk questions, the reviews cannot do full justice. I will be glad to answer any questions and usually answer within 24 hours to any query.", "Title": "Excellent form factor, and good improvement from previous model", "Date": "July 7, 2013"}, {"Author": "Arnab", "ReviewID": "R4FUHV9S0MEMJ", "Overall": "4.0", "Content": "I have an ipad,which I use for everyday.Was looking for something portable and cheaper for travel. I bought this product after a thorough research on all the contemporary products at this range.Samsung has done great with the package and look. I got mine in white and it looks great,easy to carry especially if you read when you travel . Good thing they added the home button which makes the navigation much simpler and faster. Memory is expandable upto 64 gb. Comes with an unique feature tv remote,it's pretty cool to be able o control ur smart tv without any additional hardware. It has a sensor which communicates perfect with various brands of tv. The difference of this remote from the other ones,is this does not require the tv to be on network. Samsung watch on is a great feature, I think this wasn't there in the earlier versions. Jelly bean processor,1.2 ghz dual core processor makes the navigation much smoother than galaxy tab 2. The price is a big plus for this one. Now comes the cons. The voice assist feature is very very slow and robotic compared to Siri. The wifi connectivity needs improvement. It's not that fast compared to apple( but you get what you pay for). One more negative point is the resolution , kindle fire hd and nexus has hd resolution for the same price when this product comes with hundred times lesser resolution of 1024*800. Don't know why samsung dint add hd which is very very common in the recent devices. Other than all this ,if you are looking a easy to carry,light,smart and stylish device with a great storage and most Importantly cheaper tab, then this is the one for you", "Title": "Excellent product and a great choice", "Date": "July 7, 2013"}, {"Author": "Nick Adegite", "ReviewID": "R3TPF6XMNHJDMU", "Overall": "1.0", "Content": "Did some research as to high quality but low cost tablets and found three main competitors; Galaxy tab 3, Google nexus 7 and I-pad mini. Granted I-pad mini isn't that cheap but size wise in same bracket.I purchased the SG tab 3 because it was comparable price to nexus 7 but huge interest in expandable storage. Since I brought that up I'll address that now. Expandable storage was a great concept but wasted idea. In past android was able to move all apps to your SD card in order to improve your performance for your device.SD Card:Currently however, it appears everyone and there mother has moved away from that feature. Basically, songs and documents can be moved over to the SD card and the card itself is purely internal storage. Doesn’t sound like a bad deal, well here’s some insight. If you like apps like mostly everyone does, the more apps you have, the slower your tablet will operate. I found myself waiting more times than not for simple apps to load or simply swiping to the next screen. If you want a tablet for the sole purpose of looking at pictures and opening documents, you got a winner. If apps, gaming, and productivity are you’re strong point, this tablet is not for you.Features:The next point of information, the SG tab 3 is the lowest grade tablet for the SG market. It does have a beautiful display and when the planets align a generally good overall experience but this usually only happens when you first load the tablet, remove any background tasks and operate only one app, like a new reader. Instructions on features for the tablet are none existent and if advertised features on the internet sparked you interest for this tablet, it’s only for the SG tab3 8 inches. Not even the 10 inch has theses bells and whistles.The pull down menu is however amazing allowing you to control all features such as turning on and off options like Wi-Fi, airplane mode, battery saving without ever having to open the settings. Some features have like the auto dimmer for instance end up being more of a pain then a luxury constantly changing your screen brightness making it usually to dim.BatteryAs far as the battery life for the tablet….don‘t hold your breath. If max charge is achieved it is after several hours of charging. Once you’ve waited 2.5 to 3 hours to enjoy your tablet, the power quickly drains away never really reaching that advertised 8 hour lifetime.This next point I have separated because it is VERY IMPORTANT…UNDER NO CIRCUMSTANCES SHOULD YOU DEPLETE YOU’RE BATTERY TO 0%.  A common grip on the internet is that tablets of all brands and style are not turning back on. Either China is pissed or android has got a major problem on their hands. Once the battery dies from use, unless you immediately charge it after dying, you’re tablet will not turn back on. If you think I’m joking go to this link [...]I understand they are saying it happens to the SG tab 2, but Tab 3 owners of the 7.0 inch beware…it happens to you to. I received my tab on 9/6/2013 and it died 9/10/2013. RIP Tab 3, we never really got to know each other. That aside I have requested for another to replace my currently dead and defective SG tab 3 7 inch so we shall see how that pans out. If it doesn’t work out, there’s always I pad. I will admit, though my hate or apple is quite large, they know how to make a fully functional device.Overall:Screen has great display and movies look great as well as reading whether it be books or comic books. The Google Play store has a ton of apps making the tablet a good source of entertainment but don’t get too many apps of you’ll bog down your tablet. No matter how big your SD card is, it won’t make you tablet faster. Features are basic and are comparable to that of a generic low budget tablet. The SG tab 3 operates fairly slowly no matter how much ram you free up. Battery life is abysmal and if you ever let the battery reach zero, you’ll never turn it back on again unless you have your charger with you at all time. Hate to say it but if Android is lacking the tablet department and unless you want to spend high dollar for a tablet ($300+) you might be better off using your smart phone.Good luck and happy hunting,Android enthusiast.", "Title": "Raging Disappoinment", "Date": "September 10, 2013"}, {"Author": "Truthteller", "ReviewID": "R20V51I5TLSMHK", "Overall": "1.0", "Content": "The Samsung 3 7\" should probably not be considered in the same grouping as the other Tab 3 products (the 8\" and 10.1\"), because it is so much less that either of those.  The problem isn't that it is poorly made, just that it is missing some very important features found on the other models, and it is way overpriced for what it does have in today's market.Before going further, and not to insult any other reviewers, but I have read a lot of reviews on this product on many websites now, and the conclusion I have come to is that the people who rave about this product very often are 1) speaking from a very short experience with it or 2) this tablet is their first one and they have neither good comparisons, nor have they researched the market well enough to know where this tablet fits in the current market in terms of features and pricing. It is a nice \"looking\" tablet.  Mine is white and its \"handsome\".  It's size is comfortable, although it is slightly heavy for its size\".  It is thin and pretty sleek, but all of that is pretty superficial.  It is, however, at least \"last year's\" technology if not 18 month old, and so is the pricing.There are several reviews here which indicate people had the Tab 2 7\" and were pleased with it, and then \"upgraded\" to the Tab 3 7\" and were blindsided by the throwback in technology.  While I have not owned the Tab 2 7\", I have looked it over, and compared it to my Tab 3 7\" and I have to agree. The Tab 2 7\" has the same resolution screen as the Tab 3 7\" but the older one is brighter and has higher contrast, which can be important if you are in brighter lighting.  The Tab 2 7\" uses a 30 pint connector, which some don't like, but one very important aspect to that connector was that you could buy numerous inexpensive cables and accessories (for under $5) that allowed you to plug a card reader, thumb drive, hard drive, keyboard, mouse or game controller into it.  The Tab 3 7\" has a more standard micro USB port, but it is only useful for charging the tablet or to connect it to a USB cable to interface it with a computer.  It will not acknowledge any of the other devices mentioned, regardless of the cable you use because Samsung decided to remove the hosting ability of the USB port on this model.  The Tab 3 8\" for about $100 more or the 10.1\" both have hosting USB and work with a cheap OTG USB cable.  Not the Tab 3 7\".What this means is that your only choice for storage of images, documents, music or videos is to transfer them onto a micro SD card and use the micro SD reader in the tablet.  If you have stuff already stored on a full size SD card from your camera, or a thumb drive, you have to use a computer in between, or WiFi or Bluetooth if your other devices have that ability.  Most Android devices since about version 3.1 (the Tab 3 7\" uses 4.1.2) have a host USB port.  Google suggests they all SHOULD (their emphasis) have one.The screen itself is acceptable but not that sharp.  You can do much better with resolution, brightness and contrast in the same price range with other brands.  The colors are a bit muted on the Tab 3 7\".The WiFi and GPS are both weak.  Mine unit drops the connections quite often.As others have mentioned, although the Tab 3 7\" allows you to put up to a 64 GB micro SD card into the unit, it only can be used to store personal media (documents, music, movies, images, etc).  You can't access and run apps from it.  The 8 GB RAM within the unit is pretty limited, as the basic OS and out of package apps leave you with under 5 GB left to store apps.  Once again, currently the market in tablets supports units with 16 to 32 GB internal memory for about the same price as the Tab 3 7\". The unit has a dual core 1.2 GHz processor, but its pretty slow for those specs and gets bogged down easily.  Once again, in the same price range one can find tablets running faster processors of dual to quad core and 1.5 to 2 GHz.The provided factory apps are enough to start with, but basic.  Unfortunately, Samsung, like everyone else, wants to get you to their own app store for content (ebooks, movies, and other media) and so they have apps for these gateways.  I don't see any advantage over Google Play and other options, and those extra apps just take up precious RAM space.Like several others have mentioned, my unit has been a bit flaky so far. The auto screen brightness gets stuck in dim mode and won't come out of it unless I reset the brightness manually.  The screen occasionally jitters for no apparent reason.  The screen text size will suddenly decide to shrink while I am scrolling with one finger.  For a while, when I asked the weather report, it gave me Cambridge Mass, even though I am on the west coast of Canada.However, by far, the worst aspect of this tablet (besides the inflated price for its features) is Samsung's customer service.  Their people are very pleasant, will promise you the world, and will deliver on nothing they promise.  They do not advance your case even when they say they will, they do not email you back even when they promise, you can call them, email them, it makes no difference.  They basically give lip service. Their \"executive customer service\" supposedly a second tier, is a joke.  Do not expect any assistance from these people, you are on your own, whether it is a technical question or a warranty issue.If you do not believe how bad their support is, Google Samsung Customer Service Reviews, their are literally thousands of complaints you can read.If this tablet cost about half of its list price, I would probably give it 2-3 stars, but these days ratings are not just about what you get, but what you get for the price you pay, and how that compares to other products on the market, and so with that in mind, the one start seems appropriate.  Lastly, for those of you who are wondering why I ended up with this device when I know what else is out there, it was unfortunately a gift.  I just want to warn those of you who can select a tablet yourself, that you can do much better for the same money with other brands (and maybe even customer support that cares about you).", "Title": "Overpriced in todays market, Much better value out there", "Date": "November 16, 2013"}, {"Author": "Denise M. DiFalco \"The Greatest Revenge Is Yo...", "ReviewID": "RX48EK0ZQM4RX", "Overall": "5.0", "Content": "Outstanding portable electronic device.  I'm writing a book and my husband & I travel alot.  Tired of carrying my laptop around and the Samsung Galaxy Tab 3 seemed to be the perfect little investment.  Whenever  and wherever I get ideas I can pull my tablet out of my purse and write down things I need to remember.  Love the various applications that can be downloaded from the Google store for free or at a low cost.  I can watch movies, read my e-books, download favorite rock tunes, do my banking, shop at all my favorite stores and even read our Church's Bible lessons on my Samsung.  Convenient and worth the small cost.  I love that it synch's with my samsung phone and my desktop pc.  As a reviewer for a number of websites I can do my assignments while on vacation in my extra time rather than wait til I get home to complete with worry of not making deadlines.  Also love all the space for contact numbers and addresses.  I've bought three tablets in the past that I was not happy with, this one is staying with me.  Highly recommend~", "Title": "My Constant Companion, Samsung Galaxy  Tab 3,~zero complaints...", "Date": "December 2, 2013"}, {"Author": "Ordinary guy", "ReviewID": "R391Z2EX30ZHU3", "Overall": "5.0", "Content": "First off I am not nor do I pretend to be an expert on tablet devices.  I own three: the original NookColor, which is highly outdated and is now used by my grandchildren. A 8.9\" KindleFire wi-fi/4G which both my wife and I really like.  And this Galaxy Tab 3, 7\".Making comparisons is very subjective since what I like maybe isn't what you're looking for.I definately like the Tab 3.  It has good screen resolution for a 7\".  Decent sound from its tiny stereo speakers located on the bottom when its standing upright. It's easy to use and came with a lot of apps.  Any other apps are readily availabe.  I downloaded the Amazon app program and the Barnes and Noble book reader so I have access to everything I already paid for from those two sources.One thing I like about the Samsung that's not on the Kindle is I can view QuickTime videos taken with an I-phone.  The Samsung offers you the opportunity to convert Q-Time to a more usable non-Apple format.This is a very competetive market and tablets will undoubtedly offer more features for less money as time goes by. If you're looking for an affordable, easy to handle tablet with lots of features you can't go wrong with the 7\" Galaxy Tab 3 by Samsung.  In it's latest edition Consumer Reports list it in the best product for its category. Nice!Brief update after exploring this tablet:The more I use this device, the more I like it.", "Title": "Lotsa fun for 200 bucks", "Date": "September 28, 2013"}, {"Author": "R Rated \"Keeping it real\"", "ReviewID": "R2KW51Y4K76FAB", "Overall": "5.0", "Content": "I'm a long time user and owner of Samsung devices including the original Tab 1 and currently have the Note II smartphone.  I lead with that information in order to provide some context in describing the Tab 3 which is simply a wonderful device for the money and for the ease of operation in most anything you'd want a tablet for and to do.The display is far improved over the earlier tab.  It's like going for SD to HD in one fell swoop.  The setup and getting it synced with the home network wifi was far easier than I had thought it would be.  The same can be said for tying into the Google disciplines.  Once I set up my existing Google Gmail transfer, I was able to easily tap into my existing Amazon kindle account and start reading from my personal books library.  The Tab 3 is fast, looks great and is easy to operate.  Also, within the first 10 minutes of setup, I accessed my Netflix account and was viewing various movies which came in LOUD (good volume/speakers) and clear.Summing up, the Tab 3 is a significant upgrade over the first Samsung Tab and for the price of about $200, I don't see how you can beat the value with any other device out there.", "Title": "Under-promises & OVER performs=Excellent", "Date": "July 9, 2013"}, {"Author": "Emily", "ReviewID": "R33UK56ROZEWQ1", "Overall": "5.0", "Content": "I got this as my first tablet, and I must say I really like it a lot. The size is perfect to fit in one hand. The screen is nice, bright, and clear. It's perfect for what I wanted and needed it for. It took a while to figure out and get used to (and after having it about 3 weeks I'm still figuring out a few things).Youtube videos are good quality. The only issue with these is that sometimes your hand blocks the wifi signal so the video buffers until you move your hand, or in some cases I've had to hold the whole tablet away to get the signal back.Apps and games load quickly and are fast and clear.I use chrome as a browser and at times it is a bit slow loading pages, but usually closing active apps and clearing the ram helps the speed a bit. The ability to stretch the page to zoom in is useful for sites with very small fonts/images.It's very easy to customize your pages (once you figure out how) and personalize the tablet to your liking. I have played around with ipods and ipads and they have no customizing other than moving the app icons around, so using the android wins in this case. It's hard to find wallpapers that fit the screen properly, but since there are so many other ways to customize the tablet with widgets and such, it's not a big issue.The 8GB space (which is really only around 5GB when you get it) isn't very much but is fine for using a few apps and playing games. You have the option of adding an SD card, but since I don't plan on downloading movies or music I won't need it, since you can't put apps on the card anyway.The camera quality is pretty good, especially outdoors. Indoor photos aren't quite as good and are more grainy, but there are always apps that make photos more clear.If there was one thing I'd want to have on this tablet is better notifications. That's one of the only ways the ipod/ipad beats this with features. Often the tablet makes a sound when there is a notification but nothing comes up on the screen at the same time or even shows on the lock screen. If you want to see what the sound was for, you have to unlock the tablet, pull down the top bar and then see it. It's much more convenient to see a notification message pop up right on the screen.I've recommended this tablet to a few people already. Maybe in the future I'd even be willing to spend a bit more to get the 10-inch one (especially since I really want the split-screen feature). But for the price of $200, this is a high-quality tablet.", "Title": "Awesome tablet", "Date": "August 25, 2013"}, {"Author": "Twylajane", "ReviewID": "RF7YHZDSPHMNO", "Overall": "4.0", "Content": "I actually bought this for my seventy year old mother and she loves it. It is simple to use and fits her needs to surf the web, read e-mail and play solitaire. She even figured out how to watch videos all on her own. So thumbs up on this little tablet", "Title": "Samsung Galaxy Tab 3 (7 inch)", "Date": "September 13, 2013"}, {"Author": "Ravi Kumar Siluveru", "ReviewID": "R2PERLA0PCGMMU", "Overall": "2.0", "Content": "This is the first time I am using tablet. My thought for buying 7 inch tablet is that I can hold it easily rather thatn 10 inch one. For that purpose it is good for me. Features wise also it is good. But coming to battery life it is really worst. I need to put charging entire night and I can use it hardly 2 hours. My kid plays games for 2 hours and battery is down, again I need to charge. I am afraid now, if I can take it out or not when I am going for a long drive.", "Title": "Battery life is really pathetic", "Date": "September 9, 2013"}, {"Author": "Mr. Ryan", "ReviewID": "R186F4E3QR5NSF", "Overall": "5.0", "Content": "I LOVEEE this tablet. I have been looking for a nice portable tablet for a long time now that was priced well, meaning I was not planning on it being an apple product. (Wayy too overpriced)  I love the small size, it isn't too small but it is convenient to see and work on, plus can fit in a pocketbook or large pocket.  The IR reader and TV app are a huge sell for me, the ability to see what is currently on without disrupting the current channel and then have the tablet control the tv is awesome and easy to set up.  My parents fell in love with it as well, So you know what they are getting for Christmas! :)  The front and rear camera are great, graphics are awesome.  I would not trade it for a $500 apple tablet.  I like the ability to add and remove the microSD card as well.  The battery life is great and charges really fast.  The promos you get with the tablet are pretty exceptional as well.", "Title": "This is a must have, must give for Christmas, best bang for your buck!", "Date": "December 2, 2013"}, {"Author": "D. Knoll \"D knoll\"", "ReviewID": "R1KDMCNEV7Y1QW", "Overall": "3.0", "Content": "I had a very hard time getting this thing to print on the road. I bought the hp 100 office jet printer to print in my truck.  This does not work at all with an ipad. So I bought the galaxy tab 3 7\" as it is android and bluetooth and has the ability to print. WHAT samsung does NOT SHARE is that the galaxy will only print to a samsung printer!  What kind of crap is that. There is plenty of software that hp has but it is no help.  Finally I find this app for $13 called printershare that will let the samsung communicate with the hp officejet 100.  This works but forget printing a document more than 3 to 4 pages long.  Somewhere the 3rd or 4 th page gets lost.Not a plug and play.", "Title": "Printing instructions not there.", "Date": "November 7, 2013"}, {"Author": "Dmitri", "ReviewID": "RLKAF2Q6ZC5AT", "Overall": "1.0", "Content": "It stops working after 32 days...and does not charged anymore..Support could not help me..they said charge for 1 hour from PC, etc..but device completely dead!!Please stay away!! it looks like unit was not tested properly, not passed even simple QA and QC, don't waste your money!!Customer support could not help you in such case..", "Title": "It stops working after 32 days...", "Date": "September 17, 2013"}, {"Author": "Enrique Fernandez Roberts \"Stray Dog and comm...", "ReviewID": "R1ASK3NJ9MTTMA", "Overall": "1.0", "Content": "This tablet pc WILL NOT TRANSFER APPS TO THE SD CARD! Because of its anemic storage capacity (8gb, and half of it is used up by worthless shovelware which can't be uninstalled), users of this tablet will want to transfer apps to the sd card. Unfortunately, Samnsung's Galaxy Tab 3 will not support ANY App to SD applications.Say you download a movie from vudu. The Vudu app does not show up in \"my files\" and can't be moved, even with a \"workaround nor with \"rooting. \"  So even if you have a 64 gb sd card, your storage capacity is extremely limited.  Since all downloads go straight to your internal memory (NO SUPPORT IS OFFERED FOR YOU TO DOWNLOAD STRAIGHT TO EXTERNAL SD), for downloads you must remove the the sd card, download the item to your sd via pc, and then put it back in.For those of us who download large files (like movies and pdf files), this is an unacceptable oversight.  I chose this tablet over the nexus 7 specifically because of the sd slot.  Now it is too late to return this garbage tablet.  So don't be a fool like I was. Buy a tablet that will suit your needs.  I can guarantee, beyond a shadow of a doubt, that it WON'T be this garbage tablet.Before any Android/Samsung fanboys get all defensive,  this is a well known manufacturer's  issue that vendors always fail to mention. Samsung has NOT offered any solutions to this serious problem. And trust me, with only 5 usable gbs of memory, it is a BIG problem.  Again, the usual workarounds do  NOT work with this tablet.Oh, and to those who say this is a Google issue, I disagree.  Many tablet manufacturers were aware of this and provide ROMS that allow App2SD to work.  Also, Android OS 4.2 will not have this problem.  I had read that the Tab 3 runs 4.2 but it does NOT, it runs 4.1.2.  According to Samsung, who I contacted directly, their 4.2 update will include App2SD support.  BUT, they have no idea when they plan to provide the update!Meanwhile, other tablets are already running 4.2 and allowing for App2SD to function properly.", "Title": "It's hard to believe Samsung can sell this garbage legally", "Date": "January 7, 2014"}, {"Author": "Signman Dave \"Signman Dave\"", "ReviewID": "RTHPFRAMOOVGM", "Overall": "5.0", "Content": "As a contractor on the go the Tab 3 offers all the features I require to stay competitive. From contact management to local suppliers apps the 4G LTE affords our supervisors and project managers a compact easy to use tablet. When combined with the Otterbox case and the Galaxy S4 our communications have improved ten fold. From office apps, the opportunity to view PDF files and the estimating applications we have bought this is definitely the tablet for us. Durable and long battery life are a huge plus as well as the small size that allows the device to be carried in a jacket pocket while on the job site are a huge plus. Manage multiple email accounts and view both personal and business mail in the same front page widget. Estimating apps sync well with the office desktops or laptops allowing for fast data transfer and by using the HP eprint app this has been great for interoffice correspondence. A real workhorse for the construction trades.", "Title": "Construction trades friendly", "Date": "November 28, 2013"}, {"Author": "Patricia Tricorache", "ReviewID": "R2D6M3A1KQJA39", "Overall": "1.0", "Content": "I've had this tablet for four months, and barely have the energy to try to use it. To wake it up, I have to press the button repeatedly, or even try the power button. Eventually it does turn on, and that's when the challenge begins.Most times I am trying to watch a video, the tablet freezes and makes a maddening noise. The only way I was able to stop it was by trying to turn it off repeatedly, since I couldn't figure out how to open it and remove the battery.Typing anything when browsing the internet is a challenge. I press a letter and it takes a few seconds for the letter to be entered. And it freezes or opens other pages when I simply get my finger too close too a link. If I try the back button, it usually doesn't work or simply kicks me out of the internet.I should clarify that I have not overloaded my tablet with apps. The internal memory has more than half left. Samsung support suggested I clear my internet apps completely, but this didn't work. I simply hate this product and will have to try to get it replaced or just throw it out the window.", "Title": "Did I get a lemon?", "Date": "March 17, 2014"}, {"Author": "Scott H.", "ReviewID": "R298NYABDGW62G", "Overall": "5.0", "Content": "You really can't complain about this little tablet for the price ($129.00) at the time of purchase.  My wife has had it for a couple of month now and it works perfectly.  Not had any problems with the tablet slowing down, hanging-up, etc..  If you need a simple day-to-day tablet you should give this a good look over.  It's not super high tech or bleeding edge technology, but it works very well for 95 percent of what you'd need a 7\" tablet to do. Recommended.", "Title": "White Samsung Galaxy Tab 3", "Date": "March 18, 2014"}, {"Author": "Jean Bernard DuPoux", "ReviewID": "R1PN9RF6OA2T4S", "Overall": "1.0", "Content": "Very disappointed, purchased this product as a christmas gift and after 45 days it just died. no way to fix it, will cost more to fix then buy a new one. Read how many people are in the same position as me!", "Title": "Product Died after 2 months!!!!  The warranty doesn't cover it !!! MANY PEOPLE  same issue. these are junk, AMAZON sells junk!", "Date": "March 10, 2014"}, {"Author": "Yulia Danielyan", "ReviewID": "R3HW0R5VV39TCS", "Overall": "1.0", "Content": "I purchased this tablet for Christmas gift, today is December 28th and the tab , stoped working..... only 4 days of using it's too sad.", "Title": "stoped working..... only 4 days of using", "Date": "December 29, 2013"}, {"Author": "L.", "ReviewID": "R1CJRQX0HEJMPR", "Overall": "5.0", "Content": "What sold me on this is the other reviews I had read...and being I am an avid Samsung user for many years now..I didn't even need to take out the manual...set-up is a cinch...I am a first time tablet user so anything that doesn't require to much thought,works for me..the screen is absolutely crystal clear...nice weight and feels good holding it...and lets face it...THE PRICE IS RIGHT!!", "Title": "an easy one to use...", "Date": "December 2, 2013"}, {"Author": "Jeannie K", "ReviewID": "R1NPKONL5I48Q2", "Overall": "5.0", "Content": "I am so loving this tablet. Very good size when traveling and everyday use.  Will recommend to others about this product", "Title": "Love this product", "Date": "September 2, 2013"}, {"Author": "Kenneth Takada", "ReviewID": "R19KPVNKLBSHQR", "Overall": "3.0", "Content": "I bought this tablet because I was in the market to upgrade from my iPad 1gen. I was curious about it and my friends that have the Galaxy phones always speak very highly of it, that and the attractive price all sounded pretty good.That said, it's got a wealth of features including the micro SD expansion slot (which is a huge plus). Having come from iOS, it was a little hard to get used to, especially with muscle memory being accustomed to the iPad layout.Started up just fine and the display was really nice. Took a minute to get m bearings straight and download apps. After that, it was pretty easy and quick.My issue was with the tablet freezing up when I browse. It happened pretty often in the 3 days I owned it... That and the screen was flickering a little.I bought a smaller tablet because I'm going on deployment in a week, having issues like that immediately after purchase was enough to make me take it back.I ended up going with what I know... An iPad mini.I reaaaally wanted to like this tablet...", "Title": "I really wanted to like this.", "Date": "August 5, 2013"}, {"Author": "lmc", "ReviewID": "R3A8GFPRYMH9EK", "Overall": "5.0", "Content": "Update: My wife got the order last night and before she wrapped them I tested them out! Great!Have to say what a great tablet this is! I have a Google Nexus 7 and I always find myself using my wife's Galaxy Tab. Samsung just has done such a great job with the interface and the hardware.Of course, our kids want to use both our tablets and so I am getting the three of them the kids edition of this Galaxy Tab. It is basically the same powerful hardware but has a child-friendly grip and easy-to-grip C Pen. It also features an interface for kids which the parents can control what apps the kids can play and a timer on how many hours they can spend each day on the device.Amazon has the Samsung Galaxy Tab 3 Kids Edition here. Amazon always has the best prices. :-)[...]", "Title": "Great Tablet - Version for Kids is Awesome!", "Date": "November 28, 2013"}, {"Author": "Jen", "ReviewID": "R7ZJU3ODYB2R", "Overall": "5.0", "Content": "So I just bought this as a Christmas present for my older girls .I tested last night and I really liked it was fun to use easy to use and I got a present black Friday price of 159.99 and had a 100 gift card. The camara was easy to use so where all the other features. I was going to get a couple cheap tablets but those say play store and you actually have to install it which I have no time or patience for I like the Samsung name and I thought it was a well crafted tablet.I like The remote feature and when I get a smart TV I'll try it out.", "Title": "samsung galaxy tab 3 7.0", "Date": "November 28, 2013"}, {"Author": "Jeffrey W. Timblin", "ReviewID": "R2J7A1T9DXWG1E", "Overall": "1.0", "Content": "If the battery dies completely, the tablet must be disassembled with special tools, and then reset by disconnecting the battery, and then reconnecting it.  This has now happened twice, uuuuugh.Other than this major flaw, it is a below average laggy tablet, but you don't need to expect much from a $120 tablet.", "Title": "Don't let the battery completely die unless you like disassembling the tablet with special tools!", "Date": "May 20, 2014"}, {"Author": "Loren Hunt", "ReviewID": "RWOHEK6CQE2IY", "Overall": "4.0", "Content": "I started with a pre owned Tab 3. It was about a 25% savings so I gave it a try. It looks like I bought someone else's problems. The battery life was less than 45 minutes of reading at low screen intensity and in airplane mode. It would also crash and reset the date to 2011. Amazon return policy is excellent. 2nd unit was brand new and is perfect in every way.", "Title": "Good if you get a new one", "Date": "March 4, 2014"}, {"Author": "Chris Boylan \"MrBoylan\"", "ReviewID": "R3SV1DOF0TWRPI", "Overall": "3.0", "Content": "First off, if you already own this tablet, and are having a problem getting your device to charge, turn on or power up, see below for a fix. For those considering buying one, here are my thoughts.Samsung makes great Android tablets (for the most part). I've owned a Galaxy Tab 2 and done some testing of other Samsung tablets as well.  They're responsive, offer a pretty straight-forward interface, full access to the Google Play Store (unlike Kindles), front and rear cameras, Bluetooth keyboard *and* Bluetooth mouse support and expandable storage via the microSD slot. This last bit is important if you want to keep local copies of music or movies (e.g., not rely on the Cloud) for mobile media entertainment.Also, the inclusion of an IR (InfraRed) port on the Galaxy Tab 3, and the remote app allows you to turn your tablet into a full-fledged touch screen home theater controller at no additional cost. For a gadget freak, this is pretty cool.  Overall, the fast processor, expandable storage, relatively low price, and wide selection of apps make the Tab 3 an excellent choice for a 7-inch tablet.But my experience with the Galaxy Tab 3 has been marred by a recurrent problem: sometimes the Tab 3 will become unresponsive: it won't charge, nothing lights up, and it won't turn on. This happened to the white Tab 3 I bought my daughter for Christmas after exactly one day of use. It happened again on the Tab 3 that Samsung sent as a replacement (the yellow kids' version) after about a week of use.  The first time, my daughter ran the tablet until the battery was exhausted and the unit shut itself down. After that, it never turned back on again despite multiple charging attempts from the factory charger plugged into the wall, or the factory USB/microUSB cable plugged into a computer.I looked online and found all kinds of suggested fixes: Hold the power button for 10 seconds, 30 seconds or 60 seconds (no joy).  Hold the power button and volume down button (again, nope). Hold the power button, home button and volume up button.  Still, NOPE! Try a trickle charge - plug the Tab 3 into a computer via the USB cable instead of the wall charger hoping that the lower amp charge from the computer would \"trickle charge\" the battery and fool it into charging. Again (at least for me) - FAIL!  But you are more than welcome to try these approaches as they are pretty simple and completely non-invasive.*HOW TO REALLY FIX THE POWER UP PROBLEM*What did work for me was to disconnect and reconnect the battery, then plug the unit back into its factory wall charger. After less than a minute, I saw the battery icon on the screen, and the unit began charging normally. Hooray! The only bad news about this is that it's not as simple as removing the back of a Galaxy phone. In fact, it's possible that attempting this will void your warranty, so proceed with caution!Getting the back off the Galaxy Tab 3 requires gently prying the edges away from the screen in the little crack between the screen and the case all around the perimeter of the screen. Doing this properly requires a thin plastic pry tool and some patience. I used a small jack knife, but would not recommend it due to the risk of scratches or even shorting out something inside the case. Once you've removed the back of the unit, gently lift the battery connector off its port by prying it toward you. Once it's disconnected, plug it back in by pushing it back down into place. Replace the cover by gently placing the tablet into its shell and pushing along the perimeter, snapping all the tabs back into place.There's an excellent video of this on YouTube by a user called, \"JerryRigEverything\" - search for \"Galaxy Tab 3 Battery Replacement\" and you should find it.  The only part you need to watch is the first one minute and 15 seconds to see how the cover comes off and how to separate the battery leads from the motherboard. You don't need to physically remove the battery or remove the screws that hold it in place to detach the battery leads from the motherboard. Once you've put it all back together, plug the tablet into the factory wall charger and USB cable. Within about a minute you should see the battery icon appear and normal charging should begin.Without this \"little\" issue, I'd rate the Galaxy Tab 3 as a 4-star or 5-star product. But with this major inconvenience, I have to downgrade it to 3 stars.  If it had only happened to one sample, I would have written it off, but seeing it happen to two different samples, and seeing how many other people are saying the exact same thing, I have to think it is endemic to all Tab 3s and it's only a matter of time before it happens to most owners. Let's hope Samsung figures out a software fix for this. Otherwise expect to see a bumper crop of factory-refurbished Tab 3s in the near future.If this helps you get your Tab 3 back up and running (or doesn't!), please let me know in the comments.By the way, in our case, the failures occurred when the app, \"Dragon City\" was running while the battery died. I know that can be a flaky app so am curious as to whether others who have this problem are also running that app.UPDATE: One more piece of flakiness on the Galaxy Tab 3. My daughter was unable to connect to the internet on her tablet the other day, even though it was successfully connected to WiFi and our router was fine. Upon investigation, we saw that the Tab 3 had reset its date to 1/1/2012. Once we went in and manually updated the date/time to the correct values, the tablet was able to connect to the internet again. No idea what caused this, but it's apparently another common problem with this tablet.", "Title": "Nice tablet, plagued by a pesky power problem. Here's how to fix", "Date": "January 21, 2014"}, {"Author": "polska blondynka", "ReviewID": "RSQ6VJ1D8I8XK", "Overall": "5.0", "Content": "I got this tablet as a gift and I am currently writing this review from it! I originally wanted something smaller for college to replace my laptop. I know for a fact that this tablet will not fail me. Besides using it for school work, I do travel a couple times a year, and sometimes bringing a laptop seems like too much. I plan on using this tablet for entertainment on flights.I'm not super techy but I love electronics. I can tell you that this is a great choice for all you out there who prefer a 7inch over 10inch. It has lots of space but if you find you need more, an SD card is always compatible.I have a white Samsung Galaxy S3 and I love it. Samsung makes some awesome phones and tablets.Do I recommend? Absolutely.", "Title": "Sleek, clean, perfect.", "Date": "December 9, 2013"}, {"Author": "Myles Horvath", "ReviewID": "R1GPXT5E6W1STK", "Overall": "4.0", "Content": "Great value on tablet.  Bought it for my son to watch movies and play games. This is a mid grade tablet. For better resolution and experience go for the 8 inch.  Has better features like mirror technology and better screen.  I own the 8 inch and works great. I'm also a technology buff.  The 7 inch is for my young son.  He won't notice the difference with resolution or speed. So saving the $100 was the best option. Still 7inch is great. Does what it needs to do and is way better then those off brand tablets for $100. Spend the money and get a samsung.", "Title": "Great tablet for price", "Date": "December 1, 2013"}, {"Author": "TIR \"TIR\"", "ReviewID": "R881DONG13FST", "Overall": "5.0", "Content": "I purchased this tablet for my 11 year old niece and I must say that I am very pleased with the overall performance. I have been looking for a small tablet for her for about a year and while I have a mini & a new ipad; I did not want to spend that much on something for her. I looked at the Nexus 7 (specs included) but I could not make myself like it as much as the reviews I read. I also looked at the Kindle and while the screen was beautiful, I did did not like the fact that it was not as easy to download epub & pdfs as I would have liked.I have had an android phone for years and every time, I upgrade my niece gets the old phone. She loves android and she is extremely proficient with apple products. Well, I read the reviews for the Samsung tab 3 7 inch and I wasn't very impressed. I decided to give my niece my mini and while she was greatful, she wasn't that excited. My husband suggested we buy the Samusung anyway and from the moment she took it out the box, she was excited. This kid has thoroughly tested her tablet and I heard her say to her big sister (who has an ipad 3), I love this. She is a smart tech savvy kid and I told her to tell me if she had any problems with wifi, heat, etc. She is still going strong and is just as pleased as ever. I played with her tablet and so did my husband (who has the new ipad)  and he said if he needed a 7 inch that he would consider this one. The screen actually looks nice with pics and we zoomed in on pdf documents and words were surprisingly clear. She has been playing games and I asked if there is any lag and she said no. The internet works fine at my house and at my sisters.I bought a mini because I did not like any of the small android tablets available in late 2012; but if I were going to buy one for myself now, I would lean heavily toward this tablet. I was presently surprised. I typed this review on my Macbook. As you can see,  I have a lot of apple products; but I also have an android phone. Some people like spec sheets, which are important; but sometimes other factors can affect your final decision.", "Title": "Very Nice", "Date": "July 23, 2013"}, {"Author": "Hasi", "ReviewID": "R2NL1Z7W7K3CH4", "Overall": "1.0", "Content": "I bought this at Costco and was disappointed with it's performance. It only has 1gb of memory and most of the apps got stuck. Returned it and got a nexus 7. My advice to all is go for a nexus 7 and you will be far more satisfied.", "Title": "Poor performance. Do not buy.", "Date": "December 28, 2013"}, {"Author": "S. Gayle Puckett", "ReviewID": "R393993X8BZ3P2", "Overall": "5.0", "Content": "Love it. Met expectations.  Really use it a lot. Couldn't ask for any thing to be any better.  Thanks for sending", "Title": "Love it", "Date": "November 29, 2013"}, {"Author": "D. Best", "ReviewID": "R1KH31TV0GC9Z8", "Overall": "5.0", "Content": "This is my very first tablet and I love it.  I'm still learning all the things it can do.  Love the portability of it.", "Title": "First Tablet I've Owned", "Date": "November 6, 2013"}, {"Author": "William A. Roe", "ReviewID": "R1O8L0Z1ZRE2SE", "Overall": "3.0", "Content": "I received my Samsung Galaxy Tab 3 and had no problems setting it up. Two days later when I went to use it the screen was frozen and would not allow to use the tablet.I made three calls to the Samsung Tech support people This did NO GOOD at all. I felt they were lacking in solving the problem. Their answer was \" you need to send it in for service\" I called Amazon and they provided me the option of a refund or a new device.In all fairness I elected to try the tablet. I can only say Amazon is the BEST. I will post  a updated review.", "Title": "Samsung Galaxy Tab3 7-inck, Gold Brown", "Date": "August 11, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RALDF55V0B7LD", "Overall": "2.0", "Content": "I did what I thought was a good deal of research before buying this. Unfortunately, none of the review articles (and certainly not the Samsung site) will let you know that this device will not work with many of the accessories. Most important is the lack of an HDMI connection via MHL/micro-USB port (I also wasn't able to get any of the micro USB to USB connectors to work with this device and couldn't get the Peel remote to control the TV). I didn't find this out until I had already bought a MHL/micro-USB to HDMI connection and tried to get it to work. Don't bother, it wont. If you want to attempt to connect this device to a television, there is no good way that I can think of. Apparently the 8 and 10.1 models have this capability. Nothing on the Amazon or Samsung websites point out this discrepancy. Even the older (Tab 2 models) can be connected via a dock, not the Tab 3 7-inch though. Returning my 7 inch tablet as a result.", "Title": "Less than stellar compared to 8 & 10.1", "Date": "August 26, 2013"}, {"Author": "K. R. Marshall \"ruess\"", "ReviewID": "R380Z0IG0JGRCM", "Overall": "2.0", "Content": "OK so I just returned my Galaxy Tab back to Costco and picked up the Nexus 7. Oh my goodness what a difference!Yes the Galaxy Tab is a lot more attractive design-wise in my opinion which is why I initially got it over the Nexus, but now that I've used both there's no comparison. For $30 more the nexus is nearly twice as fast, lighter and the interface is so much more intuitive and smart. The nexus comes with stock android which allows for for faster app switching and higher productivity in my opinion. What I didn't like about the galaxy is that they changed the interface but not in ways that made it better, rather ways that made it worse and more difficult to use.Finally the galaxy is slow, it's fine if you only want to read a book, but some high def videos were choppy, browsing was slow, and it bogged down when using multiple apps at once.Again, it's not a terrible device, and it's well made hardware wise, but if you have a choice, go with the Nexus as it will make you happier in the long run.", "Title": "Get the Nexus 7", "Date": "August 27, 2013"}, {"Author": "David Hardy", "ReviewID": "R1L65RDC6V0EVL", "Overall": "2.0", "Content": "I have owned and used many Samsung products and have been happy with all of them in the past.  I wanted an affordable and reliable android tablet for around the house to replace an Original Kindle Fire,  so I purchased the Galaxy Tab 3.After I received the Galaxy Tab 3 and started using it,  I noticed how sluggish the interface was in comparison to other devices that I have used such as the Kindle Fire HD and the iPad Mini.  It also did not feel as \"solid\" as some other the other devices I was used to.  Under normal use such as web browsing or streaming movies, it got hot to the touch.  I also had to frequently reboot the unit to keep it responsive.Unfortunately, After about a month after purchase, the unit locked up and shut down to a black screen.  It would not come back on after that.  I have had to send it back for warranty repair and am anxiously awaiting the results of the repair.Other Samsung tablets may be better and may be worth the money.  However, I can not recommend this unit.", "Title": "Not the quality I expected from Samsung", "Date": "May 13, 2014"}, {"Author": "P. J. Campbell", "ReviewID": "R1S90GI9RX6LW5", "Overall": "1.0", "Content": "When I first got 2 of these tablets for my 2 children just last Christmas, we were very happy. We the parents have iPads and very pleased with the performance of the galaxy tab for the kids....and they were pleased as well. The problem came when they let the battery die. The tablets refused to turn on even after being left to charge for days and trying all the 'resets' we found online. We have since returned tablet to Amazon who was very helpful and refunded the amount less a restocking fee. That restocking fee should be paid by Samsung as it is clearly a defect with their product ( just Google it and you will see how many persons have the same issue. ( the other tablet was purchased directly from Best Buy and also had the same issue and was also returned). A reasonable expectation would be for such a device to work for more than 3 months. Samsung needs to fix that problem!!We have decided to just stick to what we know and love.....Apple products cost more, but will work and in the unlikely event that there is a problem 3 months after from normal use, you take it back to the Apple Store and they'll replace it .", "Title": "3 month old tablet just will not turn on !!", "Date": "April 22, 2014"}, {"Author": "sheryl johnson", "ReviewID": "R3SG8SPSIAA4PD", "Overall": "3.0", "Content": "I wanted this tablet cause I figured It would be like my phone and it is the problom is its almost exactly like the phone its to restricted from certain on the web I wanted a tablet that was more like a laptop like my last one. I like it but I dont love it it often freezes and the worst freeze and kicks me out of what im doing. It has a fairly slow response on almost everything but otherwise its ok. I think it has a pretty good battery life.  But if I could I'd probably get something else. Maybe my expectations were to high but thats the product I have so im slightly disappointed.", "Title": "my galaxy tablet", "Date": "April 13, 2014"}, {"Author": "ReaderinReno", "ReviewID": "RGWRP6AVF7DCY", "Overall": "4.0", "Content": "This is an excellent tablet with a screen that is good for watching movies, and a size where typing is not inherently difficult. The Android operating system has some Samsung things I didn't like (particularly the keyboard with its miniscule keys), but it is easy enough to download SwiftKey or Google Keyboard and fix that.I have the Sprint version, which isn't for sale here. The 4G works well and is reasonably priced. I spent some time in the store looking at this tablet and others (Kindle Fire, IPad Mini, Nexus 7, Galaxy Tab 3 8.0, Nexus 10) in the store. I found this one to be the best size--anything bigger was too big to hold vertically, with the 8.0 inch tablets being particularly awkward. I find the typing input to be good vertically and OK horizontally on this tablet.Overall very happy with the tablet. It comes with Polaris Office software, which I find really useful.  I wish the camera was 5 megapixels instead of 3, but other than that have nothing to complain about.", "Title": "Excellent Tablet", "Date": "February 17, 2014"}, {"Author": "Kevin Green", "ReviewID": "R5JZ0WQGT16DQ", "Overall": "5.0", "Content": "Invested alot this year for Christmas in this present.  Bought 4 of them.  One for Wife and one each for kids.  Loved it so much that I bought one for myself.  I really like the MicroSD option to add disk space has come in real handy.  We all use them daily with not one issue on any of them.  The highlight of our Christmas that made it a success.  Great product!", "Title": "first tablet ever", "Date": "February 13, 2014"}, {"Author": "Connie Kopacek", "ReviewID": "R3P5332I7AWQSX", "Overall": "5.0", "Content": "Bought it for my husband and he loves it, he looks up all kinds of trivia on the internet. He is not a computer/tablet person but this was so easy to use it didn't take him long to figure it out. Bought 2 more for the kids.", "Title": "Great item", "Date": "February 12, 2014"}, {"Author": "Prairie Wanderer", "ReviewID": "R2R0B3922IM25O", "Overall": "5.0", "Content": "Loaded a great app for making free wifi phone calls and is paying for itself. Voice command works well. screen is very responsive. Pocketable version of the 8.0. Good mp3 player. Have yet to try the GPS.", "Title": "Good tablet", "Date": "February 11, 2014"}, {"Author": "Diane Burritt", "ReviewID": "R1Y8ZX09ROB3DP", "Overall": "5.0", "Content": "Just love it. Perfect size, everything works, I can watch netflix. I use Skype and it works great. Nocomplaints here.", "Title": "Love it!", "Date": "February 11, 2014"}, {"Author": "mspops", "ReviewID": "RCD2A8UE3SFD8", "Overall": "5.0", "Content": "There is not much to say other than this is a very nice, high quality tablet. It works with a decent dual core processor speed although a quad core processor would of been very nice like the Asus TF300 we have! Great graphics, easy to use interface, and nice sized on screen keyboard. The only annoying issue I had was that I had an issue with the set up of the Samsung account, but, I cannot say for sure if it was just a slow connection with my wi-fi gateway. Received it in a timely manner and boy oh boy, Amazon customer representatives REALLY know how to give you a fantastic deal, especially if you couldn't buy (out of stock) what you originally wanted to purchase! I always return to Amazon for the best deals, period. Thank you Amazon for such a great buy!", "Title": "A beauty of a tablet", "Date": "February 11, 2014"}, {"Author": "andrew", "ReviewID": "R2RS1QBU1MEBAE", "Overall": "5.0", "Content": "tablet is perfect for me. It has 2 different app stores you can search through. Apps are great! I haven't had this long, maybe a week, but so far it has been so helpful. I love to get on facebook, and it is super fast. It updates quickly. Finding and connecting with wifi is super fast, and it sensitive. It picked up wifi great in my office, and the router was in a completely different part of the building. I love it! I love the alarms in the morning that updates me on current weather conditions, and the top news headlines", "Title": "samsung Galaxi tab 3", "Date": "February 10, 2014"}, {"Author": "Ana", "ReviewID": "R2C2GVZ6XGN8LC", "Overall": "4.0", "Content": "I have bought this tablet for my brother, as a gift, he is using it a lot and until now, no complaints(only one week).He told me that he uses every single day and really likes the size and the light weight!! I bought it , because the price was amazing and also because I like the face of this tablet.", "Title": "So far so good!!", "Date": "January 24, 2014"}, {"Author": "fanesa williams", "ReviewID": "R1NWBS84CRUB7C", "Overall": "4.0", "Content": "Very nice tablet. Lightweight, reasonably priced and easy to navigate. Nothing bad to say about this tablet. Would definitely recommend.", "Title": "Nice tablet", "Date": "January 24, 2014"}, {"Author": "lala83", "ReviewID": "RKGJVG7IGY3Q2", "Overall": "5.0", "Content": "working just great use it for travel and games. Size was important and does fit in my purse with no problems", "Title": "good", "Date": "January 23, 2014"}, {"Author": "mahmlh", "ReviewID": "R2P31IN1Y07WMN", "Overall": "5.0", "Content": "Seen some bad reviews for this.  I have to say that I don't agree this tab is great.  If you are familiar with the Android system then the useage of this tab should be no problem at all.  If you have a gmail account it will sync with it and load all apps and info to it that you have on other Android devices.  It does have instructions but like all Samsung products you have to go online to get the manual as that's how they do it to save paper.", "Title": "love it", "Date": "October 29, 2013"}, {"Author": "Lauren Paul", "ReviewID": "RDUY04UT75Q8Q", "Overall": "5.0", "Content": "My daughter loves this tablet. She uses it all the time. Its all that I expected. The seller ran out of white so I got in a goldish/brown, but I actually like this color better. So I am a happy customer", "Title": "Best tablet ever", "Date": "October 28, 2013"}, {"Author": "Kyle", "ReviewID": "RK2YCUY2HWQYO", "Overall": "5.0", "Content": "I am not sure what is wrong with other people's tablet mine is fine and runs good as any other tablet. This is also my first tablet I have had a an ipod touch but wanted something bigger.Pros:Beautiful screenGood battery lifeThe charger cord is decently long which is a plus in my bookLightLOUD SPEAKERS (I compared to my brother's ipad 4th gen and my speakers ARE much louder)Comes with free $10 google play creditCons:Some apps can take a while to load if you don't kill some processes that are running.In the end I love this thing and it is a great tablet for the money!", "Title": "GREAT Tablet!!!", "Date": "October 21, 2013"}, {"Author": "jrzcell", "ReviewID": "R2M19HMX7GNK0J", "Overall": "5.0", "Content": "I have other Samsung devices to link up with this one.  I can use the tv remote on some of my entertainment equipment but not all.  Over all I love the tablet.", "Title": "Awesome device", "Date": "October 2, 2013"}, {"Author": "GASHIE \"GASHIE\"", "ReviewID": "R3OB5T47DYOOGW", "Overall": "5.0", "Content": "I LOVE IT, I was a little scared of getting one because I never saw this one at a store or anything. The picture quality is great even though its not hd. I just got  it so I havent done that much yet so when I do I will get in more details.. if it lives up to all my expectations for sure. Whould be cool if it had the note feature though...", "Title": "AWESOME", "Date": "September 27, 2013"}, {"Author": "Kevin", "ReviewID": "R26XSI42RXE04X", "Overall": "5.0", "Content": "It is a great tablet. I would recommend the galaxy line of products over apple any day. I have a galaxy media player 5.0, the galaxy s4 phone and and the galaxy tab 3 7\" and all are excellent devices.", "Title": "Samsung quality", "Date": "September 24, 2013"}, {"Author": "Joi Hagens", "ReviewID": "RRSUTLQUM6QSU", "Overall": "5.0", "Content": "I own the Galaxy 10 inch tab and it is great.  It rates up there with the IPAD.  So I wanted one that was smaller that I could carry around with me that wasn't as large.  It is a great traveler and I just adore the size.", "Title": "Great to be so small", "Date": "September 23, 2013"}, {"Author": "Dahlia", "ReviewID": "R2JJH46KF0TVYR", "Overall": "5.0", "Content": "Item purchased on 6 Sept 2013 and so far I'm please with it. No complaints re the apps that I've utilised thus far. Camera quality could however be better but since I did not purchase it for this feature I can live with it.", "Title": "Meet requirements thus far", "Date": "September 15, 2013"}, {"Author": "cristian-pozo", "ReviewID": "R144YOT5LMM1ZP", "Overall": "5.0", "Content": "is amazing table can do anything i recommended for those who like everything in your hands this table is your choise", "Title": "amazing galaxy tab 3", "Date": "September 11, 2013"}, {"Author": "Joseph Bitsko", "ReviewID": "R1UKVQZEXH04H", "Overall": "4.0", "Content": "It can do all I want it to do web browsing is amazing can watch videos in hd too well. Buy it if your really wanting a good tablet dont waste your time with apple.", "Title": "worth the money", "Date": "August 21, 2013"}, {"Author": "read55", "ReviewID": "ROT6Y3H5AJ57V", "Overall": "4.0", "Content": "Perfect size and does pretty much what I need it to but several of the television apps are not available in the app store. Also the fact fhat Adobe flash player is no longer supported for the newer OS is a real minus. If you're thinking of using this tablet for watching tv, be sure to check out the Google play store before buying so you know what tv apps are available.", "Title": "Android needs more apps", "Date": "May 9, 2014"}, {"Author": "Gabriel Sabino", "ReviewID": "R34VYK30OENVT2", "Overall": "3.0", "Content": "I  really expected more from this tablet but I works fine until now. Beware the battery runs out too fast.", "Title": "Good enough for the price but a lot behind similar products.", "Date": "May 7, 2014"}, {"Author": "Norman Spaulding", "ReviewID": "R3MJEL8NRN8QNC", "Overall": "2.0", "Content": "Slow wifi connection, can't use for internet chat, signal for wifi not as good as Tab 2.. I'd rather had bought a Tab 2.", "Title": "Tab 3?", "Date": "May 6, 2014"}, {"Author": "Marc Faucher", "ReviewID": "RAM62L2K2MDRS", "Overall": "1.0", "Content": "I bought this for a Christmas gift in 2013, thinking it would be a good entry level tablet. It isn't. I should have just spent the extra money and bought an iPad. I ended up keeping it for myself (gave replacement gift card to original recipient who obviously didn't like it) and when I occasionally try to use it, it's nothing but a frustrating experience. Even simple tasks can prove annoyingly difficult at times. It's basically worthless and I'm not sure why I ever bother charging the battery.", "Title": "Not Very Good", "Date": "May 4, 2014"}, {"Author": "Amazon Customer \"Jer\"", "ReviewID": "RQLQYFMOVRIWZ", "Overall": "2.0", "Content": "We've had the 10.1 inch version 1 and 2, and a 7 inch version 2 in our family - and this one is garbage. It's slower than the original, constantly locks up and doesn't seem to be capable of handling most of the apps we attempt on it.If this is the third version - I don't understand why the specs are so awful on it. It should have a noticeable improvement over version 1 - but I don't see what they've changed. Aside from making it slower.I got it for someone as a gift, and feel horrible, as the thing is always having problems.", "Title": "Worst of the Galaxy Tab family I've seen", "Date": "May 3, 2014"}, {"Author": "Liana Mayle", "ReviewID": "R3SCRD47BQORUV", "Overall": "3.0", "Content": "The tablet is ok, I like the quality of the screen, all the apps etc. But it has one major problem...it's very slow!! My previous tablet was a Google Nexus 7, worked impeccably and was almost the same as this one, 8 GB of storage, 1 GB of RAM. I am honestly disappointed, but I am dealing with it, I can't afford another one. I always chose my Nexus over my laptop, but with the Samsung I pretty much try to stay away from it as much as possible, I'd rather use my laptop. Wouldn't recommend it unfortunately. I wish I would've purchased a Nexus again. If anybody has a solution to my problem please share...", "Title": "S L O W", "Date": "April 30, 2014"}, {"Author": "OSWALDO ARTIAGA", "ReviewID": "R2CQUALJQIQFDY", "Overall": "5.0", "Content": "I AM USER OF TABLES FOR MORE OR LESS 3 Anor, THIS 7 \"I'M VERY PLEASED AS ME ALLOWED TO DO ALL MY WORK ME REQUIRES ALSO ME OFFERS MANY OPTIONS ENTRETEIMIENTO AND MAKE SEVERAL TASKS AT THE SAME TIME AS HIGHLY RECOMMEND, THANKS TO MY SUPPLIER, THE TRADEMARK AND AMAZON IN MY CLIENT A THANKFUL AND HAPPY, I WISH YOU ALL MANY SUCCESSES.", "Title": "EXCELENT", "Date": "April 28, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1F1D8K8UIA54", "Overall": "1.0", "Content": "I bought this thinking I was upgrading from my tired (yet still fully functional) Tab 2 7.  My intention was to give the old Tab 2 to my sons and I'd have a brand new, snappier device - wrong!  This thing was very sluggish since day one.  I decided to make a few tweaks to it (launcher, turning off some settings) but it never improved.  It was very sluggish, there was a delay to any action performed, and it would freeze just using Chrome  (pre-installed) until it would just restart on its own.  It also had random restarts even though I wasn't doing anything with it.  I'd want to think that I received a defective unit but found a lot of people having similar results with theirs.  I'm fed up with it, can't do basic things (I don't play video games on it - just read articles and watch YouTube videos).  So, it's going back.Edit 4/29/2014:  Forgot to add that the power button will get stuck so that will also cause it to turn off/reset.  Also, some apps like Google Play store would stop working and I finally noticed that the time would reset - different year, different day/month, different time and time zone.  Couldn't figure out why.", "Title": "Not an upgrade to the Tab 2", "Date": "April 26, 2014"}, {"Author": "Christal Munroe", "ReviewID": "R2829AB428DKQX", "Overall": "2.0", "Content": "I started off saying this is a great product but it started giving alot of problems. Major problem saying it is connected to the wifi and it really is not connecting at all. I recently had to send it out to samsung to have it repaired. This is after having it for 3 months. They did not even replace it.", "Title": "Problems", "Date": "April 23, 2014"}, {"Author": "Marjorie Vernell", "ReviewID": "R3VJOV6PDRP88L", "Overall": "5.0", "Content": "It fits in my purse. I can use it when I travel. I love having it among the books in my livingroom so that I can get extra information on the  subject I am reading about. My omly wish is that it had a usb port.", "Title": "Love it!", "Date": "April 22, 2014"}, {"Author": "RobtheTechGuy", "ReviewID": "RUOFV2NVQWTEU", "Overall": "5.0", "Content": "Nice little tablet. Size is excellent and performance is 9 out of 10. I love Samsung's feature where you can turn off apps you don't want to use. The only annoyance is that it only trickle charges from a usb port and the only way to correct that is to root it. Which I've done. So no serious complaints. Performance is there screen is beautiful. Highly recommended!", "Title": "Love it!", "Date": "April 9, 2014"}, {"Author": "EUN S. CHANG", "ReviewID": "R1OK011H9MERM0", "Overall": "5.0", "Content": "We purchased 4 of these for our key plant people to keep track of inventory, to communicate with each other through either e-mails, skype, or via pictures and videos.  Could not fathom that a tablet with a $150.00 per unit could do all this and more.  We were original thinking of Apple products but only spent a fraction.  This unit comes with a program that is fully compatible with Microsoft Office which sealed the deal.  We also purchase some [Rhino] Black Heavy Duty rugged impact Hybrid Case with Build In Kickstand Protective Case For Samsung Tablet Galaxy Tab 3 7\" P3200 which made these rugged enough to be used in our plant.", "Title": "Best little tablet for the money", "Date": "April 8, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1RMYND4509RC4", "Overall": "5.0", "Content": "I have been using Ipad for as long as four years. This is a great tab. Less expensive than Apple, fast, great expandible memory, excelent view for less than 150 bucks.", "Title": "Excelent tab", "Date": "April 7, 2014"}, {"Author": "bataille", "ReviewID": "RA40U54VZAWCN", "Overall": "5.0", "Content": "I already had the galaxy note 10.1. This one goes everywhere with me  . It is discrete and light and does everything like the bigger one. But it is not a replacement. It is a usefull confortable additional equipment", "Title": "confortable additional equipment", "Date": "March 31, 2014"}, {"Author": "Luz", "ReviewID": "R2P5T2LN594FUP", "Overall": "5.0", "Content": "I would highly recommend to anyone whose considering a tablet to purchase Samsung galaxy 3 tablet it works great I am very pleased.", "Title": "samsung galaxy 3 tablet", "Date": "March 29, 2014"}, {"Author": "Lee", "ReviewID": "R26829CXPCFUYI", "Overall": "5.0", "Content": "Didn't know this would the the only gift he required for Christmas. Can't get him to put it down and has become the homework helper in addition to his game center.", "Title": "My grandson loves this", "Date": "March 28, 2014"}, {"Author": "demin", "ReviewID": "R3KZ2FLE3U9EFF", "Overall": "5.0", "Content": "Great product love it very much. small compact, light and fits easily in the palm of my hand.highly recommended. Thanks .", "Title": "Sweet, Elegant", "Date": "March 27, 2014"}, {"Author": "argadames", "ReviewID": "R57JMYBMLULON", "Overall": "5.0", "Content": "I wanted a tablet so my baby daughter can see her sesame street videos and since the price was so cheap I purchased a Dragon Touch, big mistake.. Let it be known I dropped it and that was the end... So I purchased this Samsung Galaxy Tab 3, I should have done that from the beginning. It has a clear image, great sound and the design is way sturdier. The only downside is It needs an adapter to connect to the TV via HDMI, regardless I would definitely recommend it!", "Title": "I should of purchased this from right from the get go..", "Date": "March 26, 2014"}, {"Author": "M jackson", "ReviewID": "R2MR2ZWL7BSUKO", "Overall": "5.0", "Content": "Meet my needs and expectations not bad for the price. Sometimes the screen switches out on its own. Overall ok.", "Title": "Practical", "Date": "March 25, 2014"}, {"Author": "Jose Dorado", "ReviewID": "R2NAYIKI9D41UL", "Overall": "5.0", "Content": "best deal in town the galaxy tab 3 works great to play games and self the web would recomend to any body", "Title": "great", "Date": "March 24, 2014"}, {"Author": "Damita", "ReviewID": "R2CXHVQMQLI5F9", "Overall": "2.0", "Content": "I bought it because I had a GalaxyTab 2 that got wet so I had to replace it. the Tab 3 is slow.Takes along time to load.Maybe mine was refurbished?Sold as new. It doesn't have good features like the Tab 2.", "Title": "Runs slow", "Date": "February 20, 2014"}, {"Author": "Charlie 29 Palms , CA", "ReviewID": "RAELYLBSJ8RAQ", "Overall": "5.0", "Content": "This tablet has kept me completely connected to e-mail, internet, music and multiple tasks without paying for a data package for a smart phone. I now own a phone for just texting and phone use. The operation is seamless and quick. I would highly recommend this tablet to anyone.", "Title": "This is wonderful!", "Date": "February 19, 2014"}, {"Author": "C. A. Cobarruvias", "ReviewID": "R1OSFNJUDLKW0O", "Overall": "5.0", "Content": "But as tablets go, and for the price (less than 1/3 a mini) it's probably the best small tablet currently available.  Versatile, funcitonal, smooth, fast.  I've bought three and wouldn't hesitate to buy more if we had a need.", "Title": "It's not an iPad mini.", "Date": "February 18, 2014"}, {"Author": "Erin L. Dodgen", "ReviewID": "R1E4A2MD92QJDZ", "Overall": "5.0", "Content": "I go this for my daughter and she loves it! Very user friendly and holds a charge well. Helps that I have a Samsung tablet and phone myself!", "Title": "Awesome", "Date": "February 18, 2014"}, {"Author": "J. Hub", "ReviewID": "R39OFCOKLJP9RR", "Overall": "4.0", "Content": "Bought at a great price for a name brand Tablet.  When you buy this one the overall width is 4 1/2 inches and the length is a bit over 7 1/2 inches.  The diagonal length of the screen is the 7 inches.  Smaller than my e reader I have but still worth the price.  Still have a few issues to work out because it's different than the e reader of course.", "Title": "Good buy", "Date": "February 18, 2014"}, {"Author": "Dana O'Brien", "ReviewID": "R1YNWVJT0Z15MA", "Overall": "5.0", "Content": "Manufactures packaging, works flawlessly. No problems. Packaging was perfect. Great hand held tablet for the price.  We are Android lovers here!", "Title": "Awesome!", "Date": "February 18, 2014"}, {"Author": "Richard S. Teeple", "ReviewID": "R1ZYXKVBJL32Z3", "Overall": "4.0", "Content": "pretty cool little device. didnt think i would like it but i do. easier to travel with than my lap top. cool front and rear cameras.", "Title": "tab", "Date": "February 18, 2014"}, {"Author": "Noel C Stranahan", "ReviewID": "R2VR63M6RX0HS9", "Overall": "4.0", "Content": "Had  wanted a tablet because of the convenience.  The Tab 3 does everything I need it for. Not the top of the line but pretty good if you just want something to keep up with Facebook or play some games or follow e mail. I love it.", "Title": "Gift to myself", "Date": "February 17, 2014"}, {"Author": "rosa m colon", "ReviewID": "R12L0WAP4NW1Y6", "Overall": "5.0", "Content": "This tablet is great I love it I can go any where with it fixs in any all my bags I can get into any of my apps the sound on it so good I can be in the next room and still hear my music playing  niceeeee :)", "Title": "Samsung", "Date": "February 17, 2014"}, {"Author": "Paulo", "ReviewID": "R1V5BWEED9R1LY", "Overall": "5.0", "Content": "battery last between 2 and 5 days, depending on how much I use it, if I don't use it at all, probably would last 3 or 4 days more.all the applications I have installed work perfectly, it nevers freezes and the size makes it portable, and you still have a decent screen.", "Title": "probably the best tablet for its price range", "Date": "February 17, 2014"}, {"Author": "fanny", "ReviewID": "R3FKPM6KTXPRB2", "Overall": "5.0", "Content": "My mom loved the tablet.  She is not a technology person and got the hang of it pretty fast. Also its easy to use.", "Title": "Great for beginners.", "Date": "January 30, 2014"}, {"Author": "chadwick", "ReviewID": "R3NFWLKB2L7LKS", "Overall": "5.0", "Content": "This Samsung Galaxy Tab 3 is an all-around great tablet for the price. It runs Android 4.1.2 Jelly Bean, has a 1.2 GHz dual-core processor, with 8 GB of storage. This tablet is not the top of the line, fastest and best tablet on the market- it was designed to be a basic tablet and be affordable. For the price, you can't beat this tablet.The OS on this tablet is Android 4.1.2 Jelly Bean. The OS runs well on the system, and is able to handle multiple applications at the same time. The OS also includes the ability to force close apps and clear RAM.The Tab 3 is also well designed. It is encased in white plastic, with a metal strip around the outside. The power and volume buttons are on the sides, with touch sensitive \"Back\" and \"Menu\" buttons, and one physical \"Home\" button on the face of the tablet. The charger port and speakers are on the bottom of the tablet, and the headphone jack is on the top. There is also a compartment for a MicroSD card on the side of the tablet.The Tab 3 also includes a cool feature for controlling other devices- there is an IR port built in to the side. Software comes loaded on the tablet to set up with your TV, Blu Ray, cable box, etc. Plus if you subscribe to major cable companies, you can load their channel lineups and guides right on screen.There is one last feature worth noting about this tablet. Since it is a Samsung product, it comes enabled with Samsung All Share Play. This is a great feature that allows you to share Photos, Videos and Music between Samsung devices. It's easy to set up within the device's Settings, there is an option to \"search\" for other devices. In my case, I have mine paired with my Samsung UN46EH5300 TV (review for that coming soon!). So if I want to watch a video on my tablet right on my TV (currently stored on a 64 GB MicroSD card), I just have to turn my tablet on and it appears in my TV's input selection list! When the video starts playing the tablet becomes the remote, giving you options to play, pause, rewind, etc. This All Share Play also integrates with apps like YouTube. For example, if I am watching a YouTube video, I have the ability to \"send\" the video feed to the TV (as long as it is turned on).Overall- I would recommend this to anyone looking for a tablet for everyday use. If you have any questions, feel free to ask!!", "Title": "Excellent Tablet!", "Date": "January 30, 2014"}, {"Author": "shanella Brooks", "ReviewID": "RTBYR5WVCSZA1", "Overall": "4.0", "Content": "No flash on the camera do picture quality is very limited. Other than that seems great. Amaxon needs to cut out this \"amount of words required\" crap", "Title": "no flash on camera", "Date": "January 3, 2014"}, {"Author": "blev", "ReviewID": "R185OT2QCV9KMZ", "Overall": "3.0", "Content": "Has a grainier screen image than I thought it would! The camera is not good at all either! Would spend a little more on a better one!", "Title": "not the Best", "Date": "January 3, 2014"}, {"Author": "LA DESHA FRASER", "ReviewID": "R3LCRG6PMJ4KER", "Overall": "4.0", "Content": "This tab has very cool features. I do not have to type, I can speak, say what I want and it is Written by the tablet for me. on the other hand the quality of the pictureS are poor. If you are going to take pics at night do not even bother. The pictures will not have  a good quality, unless you are taking out the pics in the daytime in the daylight", "Title": "nice tablet but I hate the picture quality", "Date": "January 2, 2014"}, {"Author": "diana espinosa", "ReviewID": "R2X2VBO3BWYBU", "Overall": "5.0", "Content": "My husband won't put it down! By far best gift yet.  Great husband sitter.The speed is up to par. You can log into your Google account and get all your apps and settings to reflect what's on your Android phone.", "Title": "keeps your other half entertained", "Date": "January 2, 2014"}, {"Author": "Peggy Carr", "ReviewID": "R11YF8WBUUG54L", "Overall": "4.0", "Content": "I ordered 3 Tabs for presents. 2 work fine, but 1 Tab flickers when the back light setting is turned down to its lowest setting. It was sent back to Samsung. If 1 out of 3 Tabs had this problem, I feel there is a pretty good chance of getting one that doesn't preform properly. The other 2 are nice.", "Title": "1 of 3 Tabs had a flicker...", "Date": "January 1, 2014"}, {"Author": "A. Sulaiman \"ghostman126\"", "ReviewID": "R3OOBE8XTU0QY5", "Overall": "5.0", "Content": "Works like it's supposed to. However, an OTG cable for does not work with the 7 inch version. Everything else seems ok.", "Title": "Works.", "Date": "January 1, 2014"}, {"Author": "PC in DFWTX", "ReviewID": "R2Q2063QCX4KJ1", "Overall": "5.0", "Content": "Perfect size. Fast. Works Great!As long as you're not expecting it do the work of an i7 core processor laptop, you won't be dissappointed.Bought this for the wife and it does everything she needs it to do including reading books, listening to music, Facebook and video time with the grand kids!Fits in her purse with the case on and isn't too heavy.I could go on and on, but I'll let the 5 stars do the talking.", "Title": "Perfect Handheld Tablet", "Date": "December 31, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2AVICGNZQJHIX", "Overall": "5.0", "Content": "This is my second Samsung Galaxy Tab 3 (7 inch).  I truly can say it is AMAZING.  So quick and easy to use.  I can'timaging owning any other brand of tablet.  The apps are all fully functional.  The screen size is great.  Picks up myWi-Fi connections much better than the Tab 2.  My only problem is the back button.  I can't seem to keep from hitting this over and over by mistake.  Will try out a new case to see if this helps any.  Overall...this is one great little tablet.", "Title": "Love the Samsung Galaxy Tab 3", "Date": "December 31, 2013"}, {"Author": "Rudolph Mullings", "ReviewID": "R333F6137HTY5H", "Overall": "3.0", "Content": "Delivery was in the estimated time given, product was in good condition. There was 1 concern I had that the device was not starting after a few days of use. However after an internet search I found this was more a manufacturer issue in that I had 2 hold the power button and the volume down button for 10sec to get it to turn on.", "Title": "No problem", "Date": "December 31, 2013"}, {"Author": "Agustin david III", "ReviewID": "R1KHY9NMEF1SVL", "Overall": "4.0", "Content": "Kids Love it... but my Galaxy S4 runs faster than the Tablet, I would think the tablet should be faster", "Title": "Christmas Gift for the kids", "Date": "December 31, 2013"}, {"Author": "sandra l battle", "ReviewID": "RDH81Z8JAMBJE", "Overall": "5.0", "Content": "My daughter love this product. I gave it to her for Christmas and she really enjoy it. Great gift for her.", "Title": "Great", "Date": "December 25, 2013"}, {"Author": "J Ihrke", "ReviewID": "RWZ01973ZOW4", "Overall": "5.0", "Content": "It's good for any new tablet user. Fast, compact, useful and sturdy. I recommend getting a case for it, though. You might need it.", "Title": "Love it!", "Date": "December 25, 2013"}, {"Author": "coralie maynard", "ReviewID": "R2NW391Y5HCZDL", "Overall": "5.0", "Content": "love the speed and the neat size of this tablet and it came in my favorite colour for devices, well done", "Title": "My samsung tablet", "Date": "December 25, 2013"}, {"Author": "krishal", "ReviewID": "R1S06PZG4OEQ34", "Overall": "5.0", "Content": "It does everything I was hoping it would! It is Prefect! Works like a dream. I would buy from here again. The process was so easy and it arived very quickly. I am so happy!", "Title": "awesome!", "Date": "December 25, 2013"}, {"Author": "Rafael J. Luces \"RJLL\"", "ReviewID": "RZC3Q8VKMGZMU", "Overall": "4.0", "Content": "Im very happy with my tablet. Great Screen, good battery life, you can use an micro sd card, which is really nice because you can watch movies, see your pictures and Listening to your music. The camera is not the best, but it is a good product for the money", "Title": "Very good product", "Date": "December 23, 2013"}, {"Author": "heather", "ReviewID": "R3G0A2PV72G7LL", "Overall": "5.0", "Content": "Love love love this tablet. My kids and I both use it daily. I am a tutor and I take it with me on the job and it helps in so many ways.", "Title": "Works great", "Date": "December 23, 2013"}, {"Author": "Leehu Zysberg", "ReviewID": "R3LPCYZ7IVIWQ7", "Overall": "5.0", "Content": "Got this one for my son to play games and use it for email and facebook stuff. It works great, NEVER crashes down, my son dropped it twice to the ground - with no damage whatsoever. Display is vivid and razor-sharp. Sound quality is fair but nothing stunning. Overall a great value and a decent performer if you don't need a big screen.", "Title": "A great little tablet!!", "Date": "December 20, 2013"}, {"Author": "Suzanne Patterson", "ReviewID": "R1U1TOYW7WOO04", "Overall": "3.0", "Content": "Okay tablet, should have gotten the kindle fire is much better and bigger.  There is no flash on the camera, resolution average, very grainy video, was sold this by Sprint store in Phoenix, AZ, there is no 4G in AZ so, using data only on it was pretty much worthless and when I tried to return it, there was a $75 restocking fee.  Buy from Amazon and go wifi route unless you have 4G, don't waste your money on data service and the $50 offer unless you want to end up paying $400 after 2 years with poor data coverage.", "Title": "Don't buy at Sprint data in Phoenix not worth the service fees", "Date": "December 17, 2013"}, {"Author": "Alan M.", "ReviewID": "R2HML83BXLVPLS", "Overall": "5.0", "Content": "Good : Works fine , nice lookBad :  i bought it at 179, the day after was at 149Nice purchase", "Title": "AS expected from Samsung", "Date": "December 16, 2013"}, {"Author": "Henry Miller \"Tha Hotboy\"", "ReviewID": "R1911POMZRMVHA", "Overall": "4.0", "Content": "At first I wasn't really sure weather to order this tablet. But after reading many of the reviews I decided to give it a shot. I ordered this as like and early Christmas present for my girlfriend and boy does she love it. It has a easy to learn setup and android is a breeze. We spend many nights playing \"Candy Crush\" and other apps. It makes me want to now invest in a tablet of my own �...", "Title": "Great Tablet", "Date": "December 13, 2013"}, {"Author": "Vincent Rosenberger", "ReviewID": "R342IWT130YM0S", "Overall": "5.0", "Content": "Great product for a great price!  The 8GB hard drive can be expanded using the MicroSD card slot on the side of the unit.  I liked the fact that this unit was wi-fi only and did not need a contract or monthly bill.  And the AMOLED screen, fast processor, and convenient size all made this tablet an excellent choice for me without breaking the bank.", "Title": "Fantastic Tablet with lots of extras without the marked up price or monthly bill", "Date": "December 12, 2013"}, {"Author": "jay", "ReviewID": "R1L5CDYMGAF8VB", "Overall": "4.0", "Content": "Works great after I got it to work correctly, with the help of a guy from Samsung's support site.  Note:  If you have problems, don't call late at night or on weekends - you might get someone from the Philippines.  The guy from the Philippines couldn't help me at all, made me feel like a complete idiot and gave me a pick up number to return my tablet!  Samsung's USA support is great - their rep walked me through everything, realized what the problem was and solved it!", "Title": "Wish I got this earlier!", "Date": "December 7, 2013"}, {"Author": "David Lambert", "ReviewID": "R3JYRG5SNAHHTL", "Overall": "5.0", "Content": "I've had it for almost a week and have found the user experience to be exceptional for a little notepad of this price.  Don't buy the cheap Insignia notepad from Best Buy.  The graphics freeze up all the time.  I returned that and bought the Samsung Galaxy Tab 3 7.0.  Night and day experience.  Very responsive all the time.  The only problem that I've seen occasionally has been YouTube video locking up the device.  That requires a reboot.  (Hold the screen button down for 15 seconds.)  But that only happened twice to me so far.If you have a Samsung Galaxy phone and you like it, you'll love this because it functions pretty much the same, except without the cellular phone or data.", "Title": "I LOVE THIS THING!!!  GREAT VALUE FOR THE PRICE!", "Date": "December 5, 2013"}, {"Author": "Patricia A. Donald", "ReviewID": "R1UQ5C90MTKLA3", "Overall": "5.0", "Content": "No question about it - I love this and all that I use it for. Complaints about the low resolution are so nit picky - this little Galaxy is awesome.", "Title": "I recommend it!", "Date": "December 5, 2013"}, {"Author": "Kathy-ann  Mendoza", "ReviewID": "R5JZJLF2GB8RD", "Overall": "5.0", "Content": "It is light and surprisingly durable.  I am not a big tec person but I think it is great.  It fits well in my hand bag when I travel.", "Title": "Great compact tab", "Date": "December 3, 2013"}, {"Author": "Stephani", "ReviewID": "REMJS1X1ZBHT", "Overall": "5.0", "Content": "Bought this item it is perfect since I got it I haven't put it down I highly recommend it.  10 stars", "Title": "Tablet", "Date": "November 24, 2013"}, {"Author": "Sireeka J.", "ReviewID": "R1E32DURWCIS3M", "Overall": "4.0", "Content": "bought it for my son really cool,he loves it  and i love how simple and easy the apps are to download", "Title": "best buy", "Date": "November 20, 2013"}, {"Author": "DG", "ReviewID": "R2TJEG8ITIMA4C", "Overall": "5.0", "Content": "I love this tablet. It has everything need it for those that are learning to use tablet for the first time. Very simple to use and easy to handle and take around. It connect really easy if wi-fi is available. It is like having a small laptop. You may add extra memory too.  I like it more than the Ipad.", "Title": "Great for children that are learning!", "Date": "November 18, 2013"}, {"Author": "Antulio Salazar", "ReviewID": "R1DNGKHXG64ZQI", "Overall": "5.0", "Content": "Excellent! The Tablets fill the expectations. They will be a good gift of navidad for my daughters. The Tablets are light, with a high speed, good resolution, great brightness of the screen, good and resaltantes colors.", "Title": "The Tablets are light, with a high speed, good resolution, great brightness of the screen, good and resaltantes colors.", "Date": "November 18, 2013"}, {"Author": "Mr.LindenWillow \"Mr.LindenWillow\"", "ReviewID": "R2ZNV66Y90BTP8", "Overall": "5.0", "Content": "I got a refurbished one, and am not ashamed the beast runs great, light responsive comes with all the necessary apps.  All for a great price!  Not going to ever be angry about that! My iPhone can charge at night while I read my news headlines on this well sized screen! Super!", "Title": "I'd buy another one", "Date": "November 15, 2013"}, {"Author": "Susan E. Kaylor", "ReviewID": "RJRELOVJ9S9C4", "Overall": "5.0", "Content": "I watched the price fluctuate and managed to grab it while at its lowest.  It's easy to set up and use, and I love what it offers, esp. for the novice user.  This is one of the best-priced tabs on the market and it won't disappoint you!", "Title": "Great purchase", "Date": "June 8, 2014"}, {"Author": "Dennis", "ReviewID": "R26LXJ5HMOKUPN", "Overall": "5.0", "Content": "I bought this as a gift for someone and we're both very happy with it.I was happy to get it at a fair price and it works great.", "Title": "Bought as a gift and the recipient loved it", "Date": "June 7, 2014"}, {"Author": "Ingrid Colebrook", "ReviewID": "R3QK8LRZJFHG7C", "Overall": "4.0", "Content": "i live outside the us. will it be able to work with the phone company (btc) the bahamas mobile phone network . can i download snapchat,viber whatsapp, vine etc. can i take and make calls. can i text", "Title": "is it a phone and a tablet", "Date": "June 6, 2014"}, {"Author": "marjoriehope", "ReviewID": "R15HB9WJ2FYIRG", "Overall": "5.0", "Content": "I gave this tab as a gift, being that I thought it was an unlocked cell, at least they are enjoying it, thank you amazon!", "Title": "Samsung Galaxy Mega Tab 3", "Date": "June 6, 2014"}, {"Author": "Chelsy Armstrong", "ReviewID": "R3V2BCFYY2N7I0", "Overall": "5.0", "Content": "I got this tablet a few days ago and I love it my money was not wasted I am very happy with my purchase.", "Title": "a good buy", "Date": "June 5, 2014"}, {"Author": "marie", "ReviewID": "R6TPVTI9U2Z11", "Overall": "5.0", "Content": "I bought this for my son and I use it as much as he does! Super fast and the picture is perfect!! Very vivid colors and clarity.", "Title": "What a great tablet!", "Date": "June 5, 2014"}, {"Author": "Doug", "ReviewID": "RUV04HN40CC5H", "Overall": "1.0", "Content": "Had the Tablet for 3 days when it suddenly deleted all my apps then reverted back to a different time and date. Called Samsung and they were very nice and offered to fix it free of charge. Sent it back with their return label and waited a week and-a-half for it to return. Got it back, turned it on and it worked, but only for a few hours when it started doing the same thing as before. Called Samsung again and told them I wanted it replaced. The nice gal I spoke to said it is Samsung's policy to attempt to fix items two times before replacement. So, I sent it back a second time and waited another week and-a-half. Just got it back yesterday and loaded all my apps, etc. and it worked again, until today when it reverted back again to a different date and time... So frustrating!!!! Now, I've been on hold 37 minutes and still have not gotten anywhere. Hopefully when someone answers they will take care of me. I like Samsung products, but I won't buy another Tab 3, maybe they will let me upgrade to a Tab 4.", "Title": "Garbage", "Date": "June 5, 2014"}, {"Author": "jogi pattisapu", "ReviewID": "R19LUCUTQ3HYE0", "Overall": "3.0", "Content": "wifi only tabletcant run more than 2 or 3 apps or it will bog downpower button is easy to push in backpack - found my tab fully drained many times", "Title": "slow and under powered", "Date": "June 5, 2014"}, {"Author": "Cristina", "ReviewID": "R3IIS63LWZTKOM", "Overall": "5.0", "Content": "Samsung chose this because I like the brand, has front and rear camera and multiple applications can be downloaded, i love it", "Title": "Excellent", "Date": "June 5, 2014"}, {"Author": "Katiuska M. Barreto \"Katiuska\"", "ReviewID": "R8L9H476ZL85S", "Overall": "1.0", "Content": "I bought this tablet for a gift. The day I received I turned on and it was okay. Today that I gave it as a gift, after half hour working the screen is not working anymore. I paid for a new device and with this I supposed it is refurbished. No matter I chose a seller Fulfilled by Amazon. Terrible experience. Can you imagine receive a gift and after half hour it doesnt work anymore.", "Title": "Bad quality.", "Date": "June 4, 2014"}, {"Author": "DONALD B. SHERMAN \"COWBOY DON\"", "ReviewID": "R11QWL7QBT2KM9", "Overall": "4.0", "Content": "I am very excited to own this tablet.  the colors on screen are vived.  the speed to connect online is very good.having received it about 2 weeks ago, I am still on the learning curve.  I use it every day to become more fluent in the use and potential of this tablet.", "Title": "samsung galaxy t3 tablet", "Date": "May 11, 2014"}, {"Author": "Dane R. Jones Jr. \"G. W. Danar\"", "ReviewID": "R211ZGT2U2ZZ9N", "Overall": "4.0", "Content": "This tablet is good. Almost perfect size. Good size screen but still can fit in some large pockets. The stock memory of 8gb can be filled quick because some games can be 1gb in size. But the memory can be expanded easily and not for too much. Performance is good. I am still surprised by the graphics of some games. I just wish I could get or find a gimp or photoshop like app to do graphic designs on the go without having to root or basically hack the tablet. The wifi range is good if you are within your home or the same building as the router but it can get weak when  you are outside. I am looking for a way to boost its signal by maybe using an usb wifi adapter for rasberrry pi like boards and use a usb to micro usb adapter to connect it to the tablet. Should work since rasberry pi uses android and linux like this can but this tablet has to be hacked to root it so you can install linux while it comes with android out of box. I would recommend and buy this tablet again. Battery is about 12 hours with wifi off but with wifi on it can be drained in about 6 hours if you surf the net alot and can be drained even quicker if playing a game with 3d graphics while wifi is on. But with all the usb power adapters on the market I doubt that will be much of a problem for most people. I have two wall power adapters and one car adapter while only spending about 40 us dollars so i can not complain too much about having enough power for my needs.", "Title": "Good tablet but short range wifi", "Date": "May 11, 2014"}, {"Author": "M. Pedraza \"evil_23666\"", "ReviewID": "R2TCHBVTH8ANUF", "Overall": "5.0", "Content": "I have the Gal 3 8 inch tablet. So when my son dropped & shattered his we decided to get him this tablet. We figured we'd get a refurb to save some money. It arrived sooner than expected. But there were issue with it as well. We contacted the seller & it was promptly addressed & we opted for replacement and figured we would give it another shot. Replacement turned up & is working just as awesome as expected!!", "Title": "Great tablet", "Date": "May 9, 2014"}, {"Author": "yolanda flores", "ReviewID": "R2MMHN1SFDGW71", "Overall": "5.0", "Content": "Work's great and can't go wrong for the price that why I give it 5 stars so far so good", "Title": "work's great", "Date": "May 8, 2014"}, {"Author": "Daniel Mendonça Vargas", "ReviewID": "REODF88VETK2L", "Overall": "4.0", "Content": "Good tablet. Fast, easy to use. I bought it to my girl and she loves it. Very useful for her purposes.", "Title": "This is good", "Date": "May 8, 2014"}, {"Author": "Xavier", "ReviewID": "R2CIJTY7NQOVVY", "Overall": "4.0", "Content": "I ordered 3 of these tablets for my family and so far they've been great.Games, social apps, streaming services all perform above average. I almost went for an off brand tablet but then I realized that this was not that much more expensive for what I needed them for. My kids love them and stay glued to them for hours(after homework of course).I know they come out with a new model every year or so but in the mean time this will do then I'll probably upgrade to the new models when the time comes. Samsung and Android have made wonderful technology and I can't wait to see what's next.", "Title": "Very satisfied", "Date": "May 7, 2014"}, {"Author": "ben ross", "ReviewID": "R2Y3UY9EG2HFKN", "Overall": "5.0", "Content": "I bought this tablet from my sprint store as an anniversary gift for me and my girlfriend and I have been pleased with it ever since then( which was roughly 3 to 6 months ago ). I would definitely recommend somebody buy this tablet.Featuresone of the features I enjoy the most about this tablet is the amount of apps that you can use on the device, Skype, Pandora, Netflix , all run smoothly on it. you can also change out memory cards on this device to get up to 64 GB of storage. there is also an average battery life not exactly awesome but had to say itcomfortthis tablet is a decent size. it fits in your hand fairly comfortably even with prolonged use ( watching Netflix for about 4 hours ).  its also a somewhat light weight tablet its around one pound so not to great but not terrible.priceI paid fifty dollars for my tablet but that was only because of the deal sprint had going on., it was a very decent price. i admit if it costed any  more I would not have bought it though( only because i would not of had the money ).screen sizei like the 7 inch version over the 10 inch version because of the ability to change out the memory cards also the 7 inch is great for watching Netflix .accessory'sI admit I haven't explored much in the way of extras but I admit I bought the case that sprint had which was the standard case it was good. also my stylus pen works with my tablet so using my drawing apps is fun and easy.conclusionI would highly recommend this tablet for anyone who like to change out music or pictures via the memory cards , or the people who just like to have a tablet to do anything like playing games. I would also recommend getting a case for the tablet because I have dropped mine a couple of times and wouldn't want it to get damaged. ending note I would just like to say that this tablet is awesome !!", "Title": "great pruduct", "Date": "May 7, 2014"}, {"Author": "Jorge's Amazons", "ReviewID": "R2BPE30UE9PSV7", "Overall": "3.0", "Content": "The tablet is now old and clearly lags behind in terms of screen quality, processing power, and overall graphics.  I would recommend spending a little more and getting a tablet that is twice as good as this one.", "Title": "It's Meh...", "Date": "May 6, 2014"}, {"Author": "Karina Garcia", "ReviewID": "R3J74TU7TDEWO6", "Overall": "5.0", "Content": "The Samsung Galaxy Tab is a great product. It has all the features that I need and more. I am very happy with the Samsung Galaxy Tab", "Title": "Great product", "Date": "May 6, 2014"}, {"Author": "Leslie goheen", "ReviewID": "R1ZFJ8VVO3PWLG", "Overall": "5.0", "Content": "My son loves it can't hardly make him put it down.  Since all of are tablets r Samsung we can share games", "Title": "awesome", "Date": "May 5, 2014"}, {"Author": "Lynnae Ruberg", "ReviewID": "R2WL81286OYAZ0", "Overall": "4.0", "Content": "The Samsung Galaxy Tab 3 is perfect for my work. I needed a simple Android tool for doing some mobile surveys, but one that would also let me try out other Android data collection apps in the future. The form factor is great - a little larger than I'd like, but the phone is a little too small - and I'm hoping the higher quality means it'll last 2-3 years.", "Title": "Beautiful little tablet", "Date": "May 5, 2014"}, {"Author": "Ginny", "ReviewID": "R1BXJ1ZR8XXTWK", "Overall": "5.0", "Content": "Love the tablet.  More than I expected.  Does a lot for a small tablet, very versatile and useful.  Love it.", "Title": "Samsung Galaxy Tab 3", "Date": "May 4, 2014"}, {"Author": "Larry Hanson", "ReviewID": "R1O0SJVX9DLWQT", "Overall": "5.0", "Content": "Just the right size for my wife. the unit responds well and quickly, that is what she wanted beside being small and light. The price was right and it arrived in a timely manner.Thanks.", "Title": "Samsung is Good", "Date": "May 3, 2014"}, {"Author": "Carlos Torres", "ReviewID": "RO9O51LNZEJ4B", "Overall": "5.0", "Content": "I am in the Middle east and I bought this Samsung Tablet for my wife, as a birthday gift. She loves her tablet and the many features.", "Title": "WIFE LOVES IT!", "Date": "May 3, 2014"}, {"Author": "mandy morgan", "ReviewID": "R38X4YSWTGRV7A", "Overall": "5.0", "Content": "Love my samsung galaxy 3 tablet. Very easy to use with lots of options. Still trying to navigate my way around...alot like my cell phone.", "Title": "love my sg3 tab", "Date": "May 2, 2014"}, {"Author": "T. Pereira", "ReviewID": "ROEPA9HBMI16P", "Overall": "5.0", "Content": "What a wonderful little tablet.  It was very easy to set up and has all the apps that I need.  My next purchase will be a larger Samsung Galaxy tablet.  Bye Bye overpriced ipads.", "Title": "Great little tablet", "Date": "May 2, 2014"}, {"Author": "Lynda Fox", "ReviewID": "R2EMJ4AH753P7A", "Overall": "4.0", "Content": "This was a gift to replace a Kendal which had stopped charging. I am hoping she likes it better and it continues to work well.", "Title": "A gift", "Date": "May 2, 2014"}, {"Author": "A.Law", "ReviewID": "R1PJB62F9TW0CB", "Overall": "4.0", "Content": "I got this product pretty fast in the mail practically \"brand new\". The only thing wrong was a dent in the packaging. I'm still learning how to use it but this was a good buy. My only cons on this product so far would be that the screen sometimes is very sensitive but overall I'm satisfied with the product I received.", "Title": "Great Deal!", "Date": "May 1, 2014"}, {"Author": "E. Steele", "ReviewID": "R2GUFYQH2EA8U3", "Overall": "5.0", "Content": "Replaced the Mini/laptop with the Samsung Tab 3. I have a grandfathered unlimited mobile Wifi setup so it is always connected to the internet. I am looking to add the wireless charging.", "Title": "Got rid of the Mini/Laptop", "Date": "May 1, 2014"}, {"Author": "LN \"LN\"", "ReviewID": "R3A5W2SO0DVTBF", "Overall": "5.0", "Content": "bought one for my daugher after buying her a Lenovo that lasted about a month, then it froze on her. Got a replacement and same thing. Bought her the Galaxy tab and the only problem we've had with it is that we did not get it sooner.", "Title": "Luv IT", "Date": "April 30, 2014"}, {"Author": "Barbara S. Bedard \"Barbara B\"", "ReviewID": "R1L5LT2UQVSJWT", "Overall": "4.0", "Content": "I really love this ! It charges pretty quick and the battery lasts a long time...I can watch movies great pix.. read books play games I also listen to books on the road !and I am sure it does a ton more !  I haven't put my music on it yet.. I hardly ever use my ipod anymore since I got this ! The only thing it doesn't have is facetime which is a bummer but I can Skype ,,, anyway its great !", "Title": "loving it !", "Date": "April 29, 2014"}, {"Author": "MIGUEL BRUNO", "ReviewID": "R14I9IZBGVXQ3O", "Overall": "5.0", "Content": "This tablet is excellent. Highly recommended. Can do almost everything you ask. Just had to add the SD card for better storage.", "Title": "Excellent", "Date": "April 29, 2014"}, {"Author": "Felix J Pineau", "ReviewID": "R24PWZ8MG8BSA8", "Overall": "5.0", "Content": "I bought this as a gift for my Grand Daughter.  She loves it.  I think she\"d rather I tear her hair out than make her put it down.", "Title": "Wonderful product and great service", "Date": "April 29, 2014"}, {"Author": "D felicia", "ReviewID": "R3379GCNRB4AX3", "Overall": "5.0", "Content": "it was a gift for my daughter is a very good brand . we own many Samsung devices so this was the perfect gift.", "Title": "galaxy tablet", "Date": "April 28, 2014"}, {"Author": "Omar Sostre-Tirado", "ReviewID": "R3HM2CVURJWORJ", "Overall": "5.0", "Content": "Full features, Samsung brand reliabilty at a very reasonable  price. Very good resolution display. Wifi . Will buy it again..", "Title": "Best Features on this price range!", "Date": "April 28, 2014"}, {"Author": "Melanie Gordon", "ReviewID": "R3HY08EN22IKZ3", "Overall": "4.0", "Content": "This is a great product.  Definitely recommend buying.  It's size is great, especially for traveling; packs away neatly, accessories and all.", "Title": "Very good", "Date": "April 28, 2014"}, {"Author": "Carolyn F. Hickox \"Carolyn, aunt-in-law\"", "ReviewID": "R2DGA3E4T6WVKN", "Overall": "5.0", "Content": "Purchased this as a graduation gift for a friend in the Phillipines. She LOVED it. It works perfectly and the camera is fantastic. We just skyped last night and it was like I was there with her.", "Title": "Wonderful tablet", "Date": "April 28, 2014"}, {"Author": "Terrence Wood", "ReviewID": "RB1927745HH2X", "Overall": "5.0", "Content": "This was my first tablet purchase and for the small things I needed it for, it has surpassed my expectations.  For beginning users or skilled users, it is perfect.  I would recommend this product highly.  I have had no issues with the applications, or downloads, connecting to wi-fi none of the things I had read in the reviews prior to purchasing.  I am happy!  Samsung rocks!", "Title": "I am impressed....", "Date": "April 28, 2014"}, {"Author": "anibal guacaran", "ReviewID": "R1RG216PEVJ4KC", "Overall": "5.0", "Content": "this is an excellent productvery good to my kids learn and have fun with iti recomend it ok", "Title": "good", "Date": "April 28, 2014"}, {"Author": "sheerli veg", "ReviewID": "RM0HI4YJPUGA5", "Overall": "5.0", "Content": "i love this tab- it has enough space to put the apps i want on it, i love the calendar/organizer feature, and i use it for kindle ebook downloads as well, which i wasnt planning to when i bought it. sometimes its a bit slow to load, but i cant complain- its a great buy for the price i paid!", "Title": "great buy", "Date": "April 28, 2014"}, {"Author": "R. Williams", "ReviewID": "R25V8D390K5JE8", "Overall": "4.0", "Content": "Works pretty good.  Wife is not a tablet person but she likes it.  Kids love it.  I have had the Tab 2 for a while and find it faster than the newer Tab 3.  Tab 3 lags behind inputs and is a little glitchy.  Games are a little jerky, lessor quality video card or something I guess.  Tab 2 has upgraded Android 4.2.2 but Tab 3 is stuck at 4.1.2.  Don't know if an update will come any time soon.  I have rooted the Tab 3 to get rid of the bloatware... so far so good I guess.", "Title": "Samsung Galaxy Tab 3 (7-Inch, Gold-Brown)", "Date": "April 27, 2014"}, {"Author": "Dan", "ReviewID": "R342M7W0BNF16V", "Overall": "3.0", "Content": "I have been satisfied with the purchase, the size is great and it works well for my kids to use.My one/main complaint is that I can NOT utilize amazon Prime videos on the device and that is extremely frustrating. Other than that it has done everything I expected and has many good to great qualities for a small tablet.", "Title": "Satisfied", "Date": "April 27, 2014"}, {"Author": "dudeman", "ReviewID": "RTIWQH7QN0H51", "Overall": "3.0", "Content": "I like my tab works great except it losses time every once in a while and won't connect to WiFi. Quick fix not a too big of a deal. Plays most android games. For daily use works pretty good. Runs constantly for 6 months now. I would 5 star but its not pre rooted -1star and its just a little slow typing sometimes -1star", "Title": "daily use works great", "Date": "April 26, 2014"}, {"Author": "Doris V Alarcon", "ReviewID": "RME37FNT25KL5", "Overall": "4.0", "Content": "I love all Samsung products this was a little disappointing because the first tablet I got the charging port wouldn't work so they had to send me a replacement. The replacement is working good so far but it freezes a lot, it seems very slow at times.", "Title": "Good brand but not what I expected", "Date": "April 26, 2014"}, {"Author": "L. R. Nagy \"lani02\"", "ReviewID": "R32FXDZYD4PCZE", "Overall": "4.0", "Content": "I have enjoyed my tablet and use it for many things including email, internet, games and  pictures. It works great", "Title": "Galaxy tab", "Date": "April 23, 2014"}, {"Author": "Malissia", "ReviewID": "R2LO2SFR5404O7", "Overall": "5.0", "Content": "Everything worked pretty nicely, just don't use it with slow internet. I liked the size, and how u use your finger tips to operate it.", "Title": "Best purchase ever", "Date": "April 18, 2014"}, {"Author": "Maxey M. Kempt", "ReviewID": "R2IDZDTKHD2L7W", "Overall": "5.0", "Content": "I OWN THE 10INCH VERSION OF THIS AND I REALLY ENJOY IT ALOT. I BOUGHT THIS ONE FOR A GIFT,BUT THIS ONE HAS ALL THE BELLS AND WHISTLES OF THE 10 INCH JUST IN A SMALLER PACKAGE", "Title": "SAMSUNG GALAXY TAB 3", "Date": "April 17, 2014"}, {"Author": "marcos t. loera", "ReviewID": "R3LJD3PKDC7HOD", "Overall": "4.0", "Content": "The Galaxy Tab 3 is a neat little tablet.  It's not too big nor too small, the processing speed is quick and it doesn't lag when you flip through pages of apps.  It also has some pretty cool apps that I have gotten attached to and play around with quite often.  I wanted a tablet because I didn't want to use my phone for ever single thing and run my battery down back to back, so the Galaxy was a perfect choice for a tablet .", "Title": "Great Tablet", "Date": "April 16, 2014"}, {"Author": "Victor", "ReviewID": "R2Y8OWQSUE6ABY", "Overall": "4.0", "Content": "I am sorry I waited so long to buy one. However, I'm trying to figure out why there is no multi- screen. I am using it as a wireless keyboard and mouse in connection with my laptop when I'm watching in bed. I am also using it as a remote connection so I can use my laptop anywhere. It works great.", "Title": "Works great", "Date": "April 16, 2014"}, {"Author": "Raul.Mendoza", "ReviewID": "R2X5BROCMDRPJK", "Overall": "4.0", "Content": "It's very small and seems very fragile. It works great, but the battery life is a bit short which would be my only complain.", "Title": "Pretty good", "Date": "April 16, 2014"}, {"Author": "Lee", "ReviewID": "R1F5KH9C0ZEORG", "Overall": "4.0", "Content": "This tab 3 is amazing, the color is jus cool, never saw this color in my country before, will recommend any time", "Title": "tab 3", "Date": "April 16, 2014"}, {"Author": "Walter Sr", "ReviewID": "R3PLVYLF2AKGUE", "Overall": "5.0", "Content": "My daughter really loves this device. She says that it takes good pictures, surf the internet well, is decent for reading a book, and the operating system is very stable.", "Title": "My Daughter loves it", "Date": "April 15, 2014"}, {"Author": "Robin Saunders", "ReviewID": "RAHR5DMIIZAAX", "Overall": "5.0", "Content": "I love this tablet its very fast and I use it for everything definitely worth the money I want to get 1 for my daughter", "Title": "love it", "Date": "April 15, 2014"}, {"Author": "PsySCHopper \"KayCee79\"", "ReviewID": "RF2Y8IPQ1KZZQ", "Overall": "5.0", "Content": "This was a birthday gift for my 12-year old son, who is absolutely fascinated with it! We upgraded (I guess) from the NABI 2 tablet to this Galaxy Tab 3, which in, and of itself, is quite literally galaxies away in performance/functioning and capabilities from the NABI 2!  This tablet is a remote control (which, for me is a HUGE seller), it has access to the Amazon marketplace, GooglePlay, and the Samsung marketplace as well. This tablet also allows for PIP, or rather, for one to watch a video on Netflix while browsing the internet! It has been dropped outside of its case and kept ticking! I'd say more, but why?! ;-) I also purchased one for my 6 year old, and the 10 inch for my 15 year old! At all ages, they are winners, with plenty of educational tools and apps for each of them! Color me one satisfied customer! Oh and the shipment was extremely swift!", "Title": "Love, Love, Love this tablet!", "Date": "April 15, 2014"}, {"Author": "Jasmine Washington", "ReviewID": "R2YCSQKFZ3DWVD", "Overall": "5.0", "Content": "Love this tablet...First tablet I've ever had and it's working perfectly. More than just a tablet, it's becoming my number on piece of electronics.", "Title": "Wonderful Tablet", "Date": "April 15, 2014"}, {"Author": "Marilyn Moore", "ReviewID": "RLNICRI627YTC", "Overall": "5.0", "Content": "Loving my tablet. Just great and easy to carry with you .Use it in the bed Just great and love it.  Thanks !!!!!!", "Title": "tablet", "Date": "April 15, 2014"}, {"Author": "HITESH", "ReviewID": "R2W2KH0U2I83Z0", "Overall": "1.0", "Content": "Very very slow.no proper product description on the Amazon web page. Not matching Samsung's image at all. Not worth buying", "Title": "never go for it", "Date": "April 15, 2014"}, {"Author": "Pen Name", "ReviewID": "RL27B2EXPGSQW", "Overall": "3.0", "Content": "I was really disappointed.  I thought it would be better. Its ok for surfing, facebook, these stuff but it's really slow if u wanna watch a video on websites. It also doesn't support flash and even if u download a built in flash browser, it's extremely slow", "Title": "disappointed", "Date": "April 14, 2014"}, {"Author": "italo bolanos", "ReviewID": "R2CWEVQXRHJ1K8", "Overall": "4.0", "Content": "This tablet, I have used and tested thoroughly and found that it does have overall advantages. So as a techie, I tested this tablet out and below I will list what I have found to be the Pros and Cons of this tablet. *Also, I own the Tab 3 7.0 3G (T211)UNLOCKED PHONE/TABLET COMBO (in white and I purchased it recently on Amazon and it is just 96 dollars more than this WiFi only one). The 3G model is a real phone and has a Micro Sim card slot in it. For just about 90 dollars more, I got the phone part and the 3g data abilities in the Tab 3 with 3g (which is very much worth the added cost). The P211 I also purchased on Amazon and now I carry it everyday as a phone and mini tablet combo. So if you need a phone and tablet in one unit consider the Tab 3 7.0 3g as it is just one unit to carry for phone and tablet! Both my Tab 3 versions are peppy and run great!", "Title": "good", "Date": "April 14, 2014"}, {"Author": "Caroline G Metcalf", "ReviewID": "RLCDS1FKCR7Y0", "Overall": "4.0", "Content": "It is new to me and I am still learning a lot about it. I would recommend it as a good tablet especially if you are smarter at it, but I am a slow learner. Still i would say it is a good buy.", "Title": "Very portable", "Date": "April 14, 2014"}, {"Author": "E. Sine \"Javaman\"", "ReviewID": "R1KE3N01UOJTY9", "Overall": "1.0", "Content": "When it worked,  it was good - it was very very goodBut when it was bad, it was horrid.We purchased this as a student kit (included keyboard) and rarely used the keyboard.We ended up using this mainly for our daughter's videos on car trips (the expandable memory was nice).Then the apocalypse came.  During our last update (4.3.1 or some such) the file ended up being corrupted, and we were unable to recover from it.  Samsung was absolutely no help,  since we were out of warranty, they said \"so sorry, can't help you, why not you buy a new one?\"Tried everything under the sun,  system resart, cold booting,  system restore,  and each time it would show the little android guy falling over and saying corrupt files/data.Needless to say we became an expensive paper weight.That's too bad because we cannot recommend any samsung tablets anymore.  We have Asus now and they are running great for the same price and better processors.", "Title": "worked great for a year then Bricked when update failed", "Date": "April 3, 2014"}, {"Author": "RMH", "ReviewID": "RP0QP7RHH3U6J", "Overall": "5.0", "Content": "Great product and great company. I highly recommend them both. You can not go wrong with this tab and far superior to apps to that of iPad.", "Title": "Excellent all the way around!", "Date": "April 3, 2014"}, {"Author": "M. Prieto", "ReviewID": "R2WF55337K7N45", "Overall": "4.0", "Content": "First the good, people put down the screen resolution being low, but samsung screens are one of the best , there 1024 by 600 resoution is so much better than other screen with same resolution . Side by side with my kindle fire hd i can barely notice much difference. The tab is not extreme fast but it is not slow either, if you install  a task killer or ram manger , you can keep the ram clear and it will improve your browsing experience. People say it take 3 secs more to open apps, really 3 secs if you cant wait an extra 3 secs, its time to slow down your life.  I test the wifi and it works great the bars are not correct , when iam outside i get one bar but the tab work perfectly still loading pages and loading u-tube, test it yourself u will find even with 1 bar showing the connection is great.This is a perfect tab for movies and emails, the size is quite small and light fits almost perfectly in my pants pocket.  Since the price drop you can find these as low as 149.00 , which is a great price for the tab. The tv remote is great for using the tab to control tv.  Most people make fun or hate samsung touch wiz, but i love it , it has lots of useful features and mekes it easy to use the tablet, i have own the nexus 7 2013 and yes it is faster and smoother, but i like the samsung so much better, with the nexus you have to be very gental as it is very thin I was always afraid the screen would crack.  Like i said if you install a ram manager or task killer and keep the memory clear , you will find the tab work fine, as long as your not expecting it to be blazing fast....  Really the only real bad is the 8 gigs of strorage which is about 4.5 gigs useable .....", "Title": "good tablet for your basic needs", "Date": "April 3, 2014"}, {"Author": "Shyvonne Anderson", "ReviewID": "RI5KU9CJELQVJ", "Overall": "5.0", "Content": "It's light weight, easy to store and carry, really easy to use, battery life is excellent.  I was really impressed once I got used to it. really like it. I think it's great. I would recommend this.", "Title": "Really impressive", "Date": "April 2, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RTR037R5JPQBD", "Overall": "5.0", "Content": "tablet to use for checking email, surfing web instead of going to my laptop.  Mostly use with the kindle app as an e reader and it works great.", "Title": "Nice", "Date": "April 2, 2014"}, {"Author": "dsuasnavar", "ReviewID": "R3T6W6GMIAMXUS", "Overall": "5.0", "Content": "I like it.  I got the 7-inch which is just right for me.  I can read my ebooks,  check my email,  and many more.It runs smoothly and is fast.", "Title": "Samsung Galaxy Tab 3 7inch", "Date": "April 1, 2014"}, {"Author": "Thelma L Hopkins", "ReviewID": "R2UGFEQBPF732L", "Overall": "5.0", "Content": "I bought it for my Nephew for Christmas and he loves it, he brag to all of his friends about it. I am going to get me one.", "Title": "Love It", "Date": "April 1, 2014"}, {"Author": "Evelyn Arreaza", "ReviewID": "R1QZ9Y4LKSVIIV", "Overall": "5.0", "Content": "When I got my tablet, I got really excited. I've been enjoying it ever since. It's very easy to use.", "Title": "I love this product!", "Date": "March 30, 2014"}, {"Author": "Satesh N.", "ReviewID": "R2UWMAOIN2GSDN", "Overall": "5.0", "Content": "I own a TAB2 and I must say that the performance is the same. However if you dont have a TAB 2 get this since the design is superior. the TAB3 gives a more sturdy hold since i feel like my TAB2 can roll out of my hand with its rounded smmoth design, not so with the TAB3. Also with the TAB3 actual buttons for home and back its more convenient than the TAB2 which had a display touch screen home button which can be a hassle with screen rotation.", "Title": "Upgrade", "Date": "March 30, 2014"}, {"Author": "Emma Alvarez", "ReviewID": "R296AHEN7YWJDX", "Overall": "5.0", "Content": "I love it. Preferred. This item fits what I wanted. Excellent quality. Beautiful. Confortable. Perfect size. Good Color and well-made", "Title": "love it", "Date": "March 29, 2014"}, {"Author": "Courtney A.", "ReviewID": "RFYYMHQNM8L5Y", "Overall": "5.0", "Content": "as a lover of samsung products this tablet met all of my expectations. I would recommend this product to anyone.", "Title": "loved it", "Date": "March 17, 2014"}, {"Author": "Jose Lozano", "ReviewID": "R7NAHSEEMKR6W", "Overall": "5.0", "Content": "My mother isn't tech savvy so I bought her this tablet to help her catch up with today's world. She loves it and is obsessed with it.", "Title": "Great Gift", "Date": "March 16, 2014"}, {"Author": "D.", "ReviewID": "R3PNMLX1VBU93E", "Overall": "4.0", "Content": "It's a nice tab and has the same interface as my galaxy S3, so working with it is very easy. I just needed something to read my pdf files and e-books on, and this does the job. It is slow and isn't really fast, actually slower than my phone, but if you're not looking for top of the line and just want a small tab for reading and occasional youtube viewing, this product is great!", "Title": "nice little tab to get the job done", "Date": "March 15, 2014"}, {"Author": "Fernando Rubalcava \"fride19832\"", "ReviewID": "R11HKS5IHVHUDK", "Overall": "4.0", "Content": "Tablet is very responsive, no problems setting  up the mail,calendar,WiFi, and contacts. It's been only 1 month and so far the wife love's it. This tablet at that price is a great buy. Nice Amazon!!!", "Title": "Good Tablet for the right amount of MOney!", "Date": "March 15, 2014"}, {"Author": "Ri Ki", "ReviewID": "R2TNBKYQ0ZBA7X", "Overall": "4.0", "Content": "I love it. It is absolutely cute and neat and came the way that it was described. It doesn't have a sim card slot, however, but it's fine without one.", "Title": "Awesome device", "Date": "March 15, 2014"}, {"Author": "Phyllis L.", "ReviewID": "R1I364R9BCCVDF", "Overall": "5.0", "Content": "I am having fun learning my Galaxy. There are so many different things to do on it, I am amazed. I have already read one book on Kindle and starting another. It takes great pictures but I haven't figured out yet if I can send them. I am sure there is a way. I keep referring back to the online instruction manual so it will all come to me eventually. It's a wonderful product", "Title": "I chose this product instead of a new phone", "Date": "March 14, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3H9SGPNR4I4TT", "Overall": "5.0", "Content": "I bought this for my daughter and she loves it. She has another tablet which doesn't have a back camera so she is happy with this one", "Title": "love love love it", "Date": "March 14, 2014"}, {"Author": "jay", "ReviewID": "R1GDF65ZBN6CTE", "Overall": "4.0", "Content": "It's a little slow at times, but as always with Android tablets, there are good customization options and a wide range of apps.", "Title": "Good tablet", "Date": "March 14, 2014"}, {"Author": "Monica", "ReviewID": "R2D4883GS9GTT5", "Overall": "4.0", "Content": "The tablet was for my son. He said it quickly searches and it's clear. he only wish the Samsung Galaxy was able to gett optimum now, access to watch his favorite T.V. shows on the tablet.", "Title": "Amazingly fast download.", "Date": "March 14, 2014"}, {"Author": "Tarsha Singletary", "ReviewID": "R2JSVPZLXZAEYG", "Overall": "5.0", "Content": "I love my tablet and a big fan of SAMSUNG galaxy products. If you own a galaxy phone then you will love this tablet", "Title": "my birthday gift to me", "Date": "March 14, 2014"}, {"Author": "Priscila Diaz \"PRI18\"", "ReviewID": "R14Z22S43YUX12", "Overall": "5.0", "Content": "it's was awesome , what you see is what you get , totally new , not damaged.I recommed it .", "Title": "tab 3", "Date": "March 4, 2014"}, {"Author": "Amanda Reeder", "ReviewID": "RHKNSOCZ3ATZ9", "Overall": "4.0", "Content": "I got this so I could put my textbooks on it and carry it to class. I wanted something lighter than my laptop. It has been working pretty well. I have a problem  with one textbook it is very sluggish, but it is a very large textbook and the other 3 do not have that problem. I used Google drive to put them there. I liked that all the apps from my phone went onto the Tab. It has been pretty good. I'm still learning some things but so far I'm happy", "Title": "Pretty good", "Date": "March 4, 2014"}, {"Author": "Amanda Chavez", "ReviewID": "R36FL7L0JGL5WX", "Overall": "5.0", "Content": "Absolutely great tablet. Love it! Would recommend it to anyone. It works great and does what I need it to do. Awesome.", "Title": "great", "Date": "March 4, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R21BD0CW42AD8U", "Overall": "4.0", "Content": "Its a great device for the price. A little glichy and hesitant at times but overall good. It can be very handy", "Title": "good enough 4 stars", "Date": "March 3, 2014"}, {"Author": "T-bone", "ReviewID": "R1IXIWMN9Y0QUG", "Overall": "2.0", "Content": "This is a good size for everyday use.  Easy to carry.  Memory/storage is barely adequate, had to use supplement.  The battery would not re-charge after using it for 6 weeks, one week after return policy had expired.  Money down drain.", "Title": "Wait on this one.", "Date": "March 3, 2014"}, {"Author": "kerft2_74", "ReviewID": "RFKOCYPFQ7LX9", "Overall": "5.0", "Content": "This was a gift for my 5-y-o daughter.  She really enjoys it so much it was worth the money.  I got a good price too.  She uses it extensively, all other gifts have paled in comparison.  I now have my Kindle to myself!", "Title": "Best gift ever", "Date": "March 3, 2014"}, {"Author": "Jackie Hamm", "ReviewID": "R2LKS872T38J74", "Overall": "5.0", "Content": "I received my Galaxy Tab and immediately began using it... I love the size fits in my purse with ease...", "Title": "Impressed", "Date": "March 2, 2014"}, {"Author": "Smith family", "ReviewID": "R1V6BTOOB9IS42", "Overall": "5.0", "Content": "Very good product, it has even been able to withstand the wear and tear of having it here in afganistan.", "Title": "Great buy", "Date": "March 1, 2014"}, {"Author": "Gurkan", "ReviewID": "R2QUB0IBXZ6N1J", "Overall": "5.0", "Content": "It was awesome product but i sold to my friend.  It is as described. But i am not samsung user i couldnt deal", "Title": "Very Nice", "Date": "March 1, 2014"}, {"Author": "F. Lynn Walker", "ReviewID": "R15EKMFSSOOVOY", "Overall": "4.0", "Content": "I purchased 3 tablets for Christmas presents.  One of them died in less than a month (it wouldn't turn on at all).  I returned it and received a new one in less than a week.  So far, the new one is working well.", "Title": "I bought 3 of these", "Date": "March 1, 2014"}, {"Author": "D. Machata \"machata\"", "ReviewID": "R2UCVUCLKM9HOC", "Overall": "4.0", "Content": "I bought it because I got tired of lugging around a heavy laptop on vacation. It is very small, lightweight and convenient. It doesn't have the computing power of a laptop, but the display is sharp and high quality. I don't have a smartphone, so it is my first experience with apps too. I find them problematic, for example flash is NOT supported by Android, so most videos won't play. That sucks, but it's not Samsung's fault. Overall I am very happy with the purchase.", "Title": "My first tablet", "Date": "March 1, 2014"}, {"Author": "CHERYL GABRIEL", "ReviewID": "RJYMMD38ZQKDB", "Overall": "5.0", "Content": "I bought this for my sister and she loves it!  Easy for her to use and easy for her to jump on wifi no matter where she is.  Small enough to throw in her purse but not too expensive that you can't let you kids play on it.", "Title": "Great gift!", "Date": "February 28, 2014"}, {"Author": "Britt Dahl", "ReviewID": "R2WNKQ1QZXFUIS", "Overall": "5.0", "Content": "My kids love these and they are user friendly. The battery life is very good as well. Also a great size for the kids to take with them and not be cumbersome.", "Title": "User friendly, Very Good Battery Life", "Date": "February 27, 2014"}, {"Author": "GSDLover \"GSDLover\"", "ReviewID": "RWWXHQCEA64CX", "Overall": "5.0", "Content": "And my mother will not put it down.  They use it for everything, especially with the optional Chromecast I purchased for them.", "Title": "Purchased as a gift", "Date": "February 27, 2014"}, {"Author": "GayT", "ReviewID": "R34B2EGCVQZ4M0", "Overall": "5.0", "Content": "Bought this for my husband although he had never expressed wanting a tablet.  HE LOVES IT!!  Its a larger version of the Samsung Galaxy 4 phone so my 23 year old was able to navigate and assist DAD with setting up his apps.  GREAT device.", "Title": "The BEST Christmas gift!", "Date": "February 27, 2014"}, {"Author": "Douglas Powell", "ReviewID": "R3OVBUKAWPCAXM", "Overall": "5.0", "Content": "Great product. Easy to set up and use.  My only computer now. Even print great pics to my wireless printer", "Title": "works like advertised", "Date": "February 25, 2014"}, {"Author": "Charly of Bay Ridge, Brooklyn, NY", "ReviewID": "RXJWJ0VIEFGLD", "Overall": "4.0", "Content": "I shopped around online & on the internet before purchasing. Great price. Tablet works well. Battery last a long time.", "Title": "Great price. Slow shipping.", "Date": "February 25, 2014"}, {"Author": "Shelita", "ReviewID": "R1ZV9BANTOUB5N", "Overall": "5.0", "Content": "My daughter is 11 and was tired of the cheap tab,  She looks her samsung galaxy tab, she doesn't put it down and she found more apps to help with reading.  Made me so jealous i purchase another tab for me.  LOL  Fast deliver", "Title": "purchase for my daugher", "Date": "February 24, 2014"}, {"Author": "Nielle", "ReviewID": "R1B3DJJP4WRQHZ", "Overall": "5.0", "Content": "I love it! I use it to read, keep track of my life, and other things. I haven't really looked through a lot of the stuff it has on there yet but pretty cool so far. Can't see my life without my Samsung.", "Title": "Love it with a passion", "Date": "February 24, 2014"}, {"Author": "Rock J", "ReviewID": "RG1XMH8D5ILTQ", "Overall": "5.0", "Content": "When I received this item it was sealed in its original box as if it was brand new.  Everything was there no problems with the devise and I have used it everyday since I received it.  It is my alarm/nightstand/music desk clock.  I love the color.  I bought an Otterbox outside case with stand and it is the best tablet I have seen or had.  Fast and I can sync it with my Samsung Galaxy S4 cell phone and Dell Laptop.  It's great at this price.", "Title": "Great Deal for Refurbished.", "Date": "February 24, 2014"}, {"Author": "JESUS", "ReviewID": "R3EJJ1QC1WDKSD", "Overall": "5.0", "Content": "THE TABLET DO NOT WANT TO LEAVE STARTING THE LOADING ALL DAY AND NOT START I WANT TO KNOW THAT I HAVE TO FOLLOW STEPS IN ORDER TO USE THE WARRANTY OF THIS EQUIPMENT BUY IT IN AUGUST 2013THANKS A LOT FOR ME know HELP WITH THIS GREETINGS", "Title": "WARRANTY", "Date": "January 27, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1QQK3T416ZTMM", "Overall": "5.0", "Content": "Fast tablet,best performance for the price .  Easy to operate. Highly recommend to all. ages. Thanks for guiding me  there.", "Title": "Top end tablet", "Date": "January 27, 2014"}, {"Author": "Maria C Bernetich", "ReviewID": "R224FL6665KUZQ", "Overall": "5.0", "Content": "Highly fullfilled my expectations. I would recommend it to a friend (though I will probably choose the 10-inch one the next time).", "Title": "Excellent performance at a convenient price", "Date": "January 27, 2014"}, {"Author": "Dario", "ReviewID": "R3VG4ELNF98IVV", "Overall": "5.0", "Content": "I really loved this product. the tablet is fast. easy to use. good quality.I recomend this product for everyone, no doubts.", "Title": "Excellent", "Date": "January 27, 2014"}, {"Author": "Copper", "ReviewID": "REN4Y8D2TWJ77", "Overall": "5.0", "Content": "My Samsung Galaxy Tab 3 is perfect.  I can check my e-mail and reply.  I can check my facebook, the weather, weather radar, amazon, autotrader or anyother www site I wish to look at.  The camera is handy, post-it note reminder, etc.", "Title": "Love it", "Date": "January 27, 2014"}, {"Author": "Zena Henderson", "ReviewID": "R3DPYYVF1154VZ", "Overall": "4.0", "Content": "This is a great beginning Tablet for my dad. He's relatively new to electronics and he loves. Good product.  Just a bit smaller than what I'm used too", "Title": "Samsung Galaxy Tab 3", "Date": "January 26, 2014"}, {"Author": "Riqui", "ReviewID": "R2WICJ6OKWR9V4", "Overall": "5.0", "Content": "I absolutely love my Galaxy Tab 3!  It's small enough to fit in my handbagand light enough to hold, carry & watch movies or play games. I just wishthat the available warranty was visable when ordering but I did notice I can go baback & order it.", "Title": "Beautiful in Brown", "Date": "January 26, 2014"}, {"Author": "kelly lim", "ReviewID": "R1F9CQ7VL392GQ", "Overall": "5.0", "Content": "I bought this for my mom's Christmas present,she uses it so well and with \"google Chrome\", it's so much fun to watch movies and tv series (especially with the Netflix app),I think the size is great, and it's just ideal to have if you are looking for a small cheap tablet :) (quality seems better than the price for me)", "Title": "Great tablet!", "Date": "January 26, 2014"}, {"Author": "Pj Magee-guagliano \"PJ\"", "ReviewID": "R2NNP99N4HWM7B", "Overall": "5.0", "Content": "I Love this Tab....  Perfect to carry in my purse, yet big enough to easily navigate the screen.  Holds a great charge and crisp color.  I use this more than my NoteBook as it is lighter and just easier all around !  Recommend !!", "Title": "Galaxy Tab", "Date": "January 26, 2014"}, {"Author": "Kase", "ReviewID": "R28S0PS992ZZ1C", "Overall": "4.0", "Content": "Bought it for my son's birthday and he is in love with it. One of the features that he liked the most is the ability to video chat with me whenever he has WIFI access. 'Google Hang out', allows him to talk to anyone who has the 'Google hang out' app on their smart phone. All that is required is a Gmail account. It also had a neat app called Watch-On, this app acts as a remote control and can change channels, change the volume, power the TV and set top box on/off. Very cool app, very cool tablet, would purchase another one.", "Title": "Working Great", "Date": "January 26, 2014"}, {"Author": "Gonzalez Gilbert", "ReviewID": "R2GUH4JSWR1BOH", "Overall": "5.0", "Content": "I highly recomend this seller, it works perfect. It is exactly as described, this a very fast tablet, is the perfect size to fit anywhere and the perfect power to make all the task.", "Title": "Excelent!", "Date": "January 21, 2014"}, {"Author": "Ronald", "ReviewID": "R3CEW0HWFB8L3Y", "Overall": "5.0", "Content": "I got this for a friend of mine and she just love it. It was delivered even before the estimated time and the product features and just what I expected from a Samsung product, the display it's just great and the performance it's excellent, I have the galaxy tab 2 and I feel just tempted to get one this for me as well.... bottom line, good product strongly recommended.", "Title": "excellent service excellent product", "Date": "January 21, 2014"}, {"Author": "John Leavitt", "ReviewID": "R2KZU4SSRN5FL0", "Overall": "1.0", "Content": "I planned to use as Flight Computer, nifty device when working, had all of about ten hours on it, charged it overnight went to boot it up and nothing, nothing at all!Infant mortality at it's finest...", "Title": "Stopped working in less than 60 days", "Date": "January 21, 2014"}, {"Author": "L. Jones", "ReviewID": "RLJ78IW306DP2", "Overall": "5.0", "Content": "This is a perfect tablet and just the right size for me - wanting to carry it around all the time rather than leave at home like the bigger IPAD.  Ideal for scheduling, note-taking and email and internet access on the go.  Gone are my little post-its that get lost.", "Title": "A great tablet that does it all!", "Date": "January 21, 2014"}, {"Author": "Courtney VanDamme", "ReviewID": "RKT8UYNMBMO6V", "Overall": "5.0", "Content": "System is a little slow, not sure if its just my interweb that interferes with that though. But I love the color (brown) nice and sparkly", "Title": "little slow", "Date": "January 21, 2014"}, {"Author": "Rachel Brown", "ReviewID": "R2BJTTJDWH0XTR", "Overall": "5.0", "Content": "Wonderful wonderful product, could not be happier with android. Thanks samsung for your wonderful awesome products that work so great.", "Title": "Perfect", "Date": "January 21, 2014"}, {"Author": "Stephanie Exley", "ReviewID": "R3CU1QYKLXDWCS", "Overall": "5.0", "Content": "This is a Great tab! I Love it and so does my son. Easy to use and great pictures :)", "Title": "awesome!", "Date": "January 21, 2014"}, {"Author": "Militza", "ReviewID": "R3DAL0TWXHTNGK", "Overall": "5.0", "Content": "It's a great product I used in skype and is very fast really, I love how it works and is so easy to having for everywhere. Thank you very much.", "Title": "was what I expected", "Date": "January 21, 2014"}, {"Author": "Ali", "ReviewID": "R1C7G29CJAE34G", "Overall": "5.0", "Content": "This Galaxy 3 is everything I expected. It's fast, has a great picture, and is easy to set up and use.", "Title": "Great Devise", "Date": "January 21, 2014"}, {"Author": "summer kempf", "ReviewID": "R1JMZ198APJVNH", "Overall": "5.0", "Content": "Works great and just plain awesome!!!!!!!!!!!!!!!!' Pure amazing. Thinking about which is better though? Kindle Fire HDX or Samsung Galaxy Tab 3?", "Title": "Amazing", "Date": "January 20, 2014"}, {"Author": "John Tomaszewski \"shesky\"", "ReviewID": "R2RJCM74MN3C0N", "Overall": "2.0", "Content": "I have a galaxy s3 that I love so it was a no Brainer to take a chance on a tab 3.  Very disappointed so far.  Its slow and crashes all the time.  I have an original kindle from years ago that out performs this tablet on my favorite apart and games.  Would not buy again", "Title": "crashes all the time", "Date": "January 17, 2014"}, {"Author": "JR", "ReviewID": "R3HRO9K74KLMC", "Overall": "5.0", "Content": "First of all, I want to say I got this at a special in Best Buy for $139 dollars, so if a seller is charging more than that, he is ripping you off and you need to contact amazon. Its a great tablet for the money you pay(Unless you pay more than the amount cleared). Anyway, the tablet is great for music, pictures and quality for the price. You get a 50gb upgrade for dropbox and you can upgrade your memory to 64gb with a micro sd card. There is a little wifi problem, but, what tablet is perfect? Me, I'm a huge music fan and have a big collection, so with the micro sd card it fitted perfectly. Hardware wise, the specs are last years, but if you're on a budget, you can never go wrong with this one. The battery life lasts me more than enough, I'm a collage guy so i'm mostly listening to music and facebooking any chance I get. I recomend getting yourself a screen protector and cover, since the screen will get dirty with your fingers quickly. Great tablet overall.", "Title": "Greatest budget tablet", "Date": "January 16, 2014"}, {"Author": "Destiny N. Savage", "ReviewID": "R3PG7YUT8RBZEI", "Overall": "3.0", "Content": "should have spent the extra money for the galaxy 8\"  2 weeks after getting this for Christmas its worked great, battery drained overnight and now it wont take a charge with any of the methods available from Samsung or online.  It is not the fastest tablet so after using my kids ipads it seems even slower now.Update  Spoke to Jon at Amazon and he quickly understood the issue and exchanged the broken one for a new one. Even paid the shipping both ways. Extremely helpful even with my having thrown away the packaging. Still not the best tablet but customer service was outstanding", "Title": "get what you pay for", "Date": "January 16, 2014"}, {"Author": "J. Jones", "ReviewID": "R9UIB8CHNZB0H", "Overall": "5.0", "Content": "i just scored a brand new galaxy tab 3 for only $139 ... i am already stocked just about that ... i went ahead and upgraded to next day shipping since it was so cheap. and after my order confimation, i checked the website again just to read over the specs again and the price had jumped back up to $169. i wil write a better review later.Ok its later now .., ive had the tablet for 3days now. I love it and the kids love it too. May order them one to play with during spring break. I think the price was an absolute steal. I amm very satisfied. I see other tablets cheaper but they aren't as fast as this one.  I am becoming a Samsung fan.", "Title": "great deal", "Date": "January 16, 2014"}, {"Author": "Cicylea Knowles", "ReviewID": "R3U61BLD2PDLXC", "Overall": "5.0", "Content": "I bought this for my 5 year old as a Christmas  gift, she loves it & so do I. Apps are easy to purchase", "Title": "perfect", "Date": "January 16, 2014"}, {"Author": "Neal Treadwell", "ReviewID": "RIH8PKG1IBRDW", "Overall": "5.0", "Content": "Love it works out for me drive for a living gets great wifi reception fast fast fast.  Except they lowered price after purchase n refused to refund difference", "Title": "Great", "Date": "January 16, 2014"}, {"Author": "Jorge O. Espejo", "ReviewID": "RXY823D6PB0MF", "Overall": "5.0", "Content": "My Daughter s enjoying the tablet. She has yet to explore its capability with the Bluetooth keyboard, but is finding ways to utilize it productively.", "Title": "Excellent buy", "Date": "January 16, 2014"}, {"Author": "Saquib Masud", "ReviewID": "R2ACIUPTAW2YOW", "Overall": "2.0", "Content": "unfortunately I cannot read comic books properly i.e. cannot view cbr files without the screen getting blurry.  Right now, I'm just hoping Samsung redeems themselves with tablets.  I have no complaints about their phones though.", "Title": "slow and weak", "Date": "January 16, 2014"}, {"Author": "Aleesha Allen-Daley", "ReviewID": "RK5FPYLOSU96W", "Overall": "5.0", "Content": "just wat I needed. the right size and all. its user friendly, whereas I take it everywhere I go. I just cant help it,  I'm obsess with this tab.", "Title": "Great", "Date": "January 16, 2014"}, {"Author": "Robert Tranchant", "ReviewID": "R2TD3Y4W3LR01Y", "Overall": "4.0", "Content": "I like this pad. It provides me with what I was looking for in a pad at this cost. My Nexus is nicer but also more expensive.", "Title": "nice pad.", "Date": "January 16, 2014"}, {"Author": "Jeremy Frye", "ReviewID": "R32A70HL0XWV5T", "Overall": "5.0", "Content": "It Met all my expectations. The look on my wife's face when she opened it up at Christmas was priceless.", "Title": "Excellent", "Date": "January 16, 2014"}, {"Author": "rebecca", "ReviewID": "R1K7UAJZPKHUKX", "Overall": "5.0", "Content": "my bf loved it, brand new sealed works great & its nice and small and lighweight reminds me of a book and fast shipping", "Title": "bought it for a christmas present", "Date": "January 15, 2014"}, {"Author": "Jason", "ReviewID": "R3AALFYTRUQ569", "Overall": "5.0", "Content": "The tablet is awesome for any price, but for $180 it's easily the best deal out there on a tablet. Exceptional display, incredible ease of use, and a ton of great features make this an outstanding tablet.", "Title": "Outstanding tablet at a stunning price", "Date": "January 15, 2014"}, {"Author": "Jermaine Lewis", "ReviewID": "R11SWBODD49JKJ", "Overall": "5.0", "Content": "Its everything I thought it would be, the 7 inchbscreen is perfect as it combines portability and usability, small enough to transport but big enough to be productive efficiently. Great buy!", "Title": "simply amazing!", "Date": "January 15, 2014"}, {"Author": "Melvin Allen", "ReviewID": "R3STN4OY094THV", "Overall": "2.0", "Content": "It's ok however it doesn't do all that I thought it would... I am still working out the final touches...", "Title": "7 inch tablet.", "Date": "January 14, 2014"}, {"Author": "Joan E Schade", "ReviewID": "R1X8VX4QBCQQBW", "Overall": "4.0", "Content": "The instruction booklet was difficult to read and therefore understand.  Lighter colored paper would have helped and a good index.", "Title": "instruction book", "Date": "January 14, 2014"}, {"Author": "Rick", "ReviewID": "R17GT65G54JUGJ", "Overall": "4.0", "Content": "Not much negative to say about this one.  I really like the fact that it has expandable memory via a microSD card and it runs fast and seamlessly.  It's a very good tablet in this price range.", "Title": "Nice tablet for the money", "Date": "January 14, 2014"}, {"Author": "Lisa M garcia", "ReviewID": "R14VXJIMG24X9V", "Overall": "5.0", "Content": "I bought this for my daughter for Christmas she loves the size and it work great.  She wants to eliminate her phone and just use the tablet.", "Title": "Works great", "Date": "January 14, 2014"}, {"Author": "Pedro Camorlinga", "ReviewID": "R282DCPR2W28AK", "Overall": "3.0", "Content": "I bought it mainly as a gaming device for my kids. I like the design; it is sleek, easy to hold and lightweight. However, the processing speed is significantly slow; it has a slow response time and some games (for instance Minion Rush) appear with broken graphics (e.g. slow image rendering) and are almost impossible to play, even though the storage is at 50% capacity. I will buy an external Micro SD to see if it improves the response time.", "Title": "Nice and slim but slow", "Date": "January 14, 2014"}, {"Author": "Jose", "ReviewID": "R41CV3IKFTSV2", "Overall": "5.0", "Content": "GREAT SIZE TABLET. I BOUGHT 2 OF THEM. A WHITE AND A BROWN ONE. FOR EACH OF MY KIDS. (WISHED I HAD KNOWN ABOUT THE KIDS EDITION BEFORE) . BUT OTHER THAN THAT, ITS GREAT. I DOWNLOADED A LOT OF KIDS LEARNING APPS  FOR THEM. THEY ENJOY THEM.", "Title": "NICE TABLET.", "Date": "January 14, 2014"}, {"Author": "lventura", "ReviewID": "R2C1DVVAQ3GV73", "Overall": "5.0", "Content": "It's an excellent tablet, very well built and the size makes it very portable while still keeping very good quality for videos or reading", "Title": "kids loved it", "Date": "January 14, 2014"}, {"Author": "wolf", "ReviewID": "R1IKHSGCGG82T", "Overall": "5.0", "Content": "I've always been a fan of Samsung and every portable electronic device we own is samsung. They have never let us down, and for the price you can't beat that. They are working great and with the additional memory slot it's almost impossible for the kids to fill it up.", "Title": "Works great", "Date": "January 13, 2014"}, {"Author": "George", "ReviewID": "ROTPV1U1JSG63", "Overall": "5.0", "Content": "I missed the low price sale and paid $159. It is fun to have in my house. It makes noises when I get mail or some other notification. It is there on standby to wakeup and do some quick web surfing. Battery life in standby is excellent. I have played some videos and the native player is limited on the CODEX it runs. I tried some free video APPS that kind of ran one CODEX better than another. I did not find a player yet that is as robust as some PC software (MPC, VLC). might help. I tried it in the car as GPS with some freeware, works OK. You can transfer GPX files (multi point GPS tracks). I might try some commercial GPS software.  GREAT screen daylight. I don't know if iPad is better, but for 1/4th the price it is great for me. My phone is an HTC EVO 4G and so the learning curve was low.... since the galaxy Tab 3 is an Android device as well.", "Title": "Great device for cheap", "Date": "January 13, 2014"}, {"Author": "Kandice", "ReviewID": "RMGIGMWNPLLPN", "Overall": "5.0", "Content": "Love that it is easy to use and my daughter can use it easily to play puzzles. I just wish there was more memory.", "Title": "Wonderful", "Date": "January 13, 2014"}, {"Author": "Jesse Trujillo", "ReviewID": "R2LA07MB9VIZIQ", "Overall": "5.0", "Content": "great convenient tool. it is always there when I need it. I will recommend this to a friend. It is just what I needed. I will recommend this to a friend. THANK-YOU", "Title": "one happy camper", "Date": "January 13, 2014"}, {"Author": "James22", "ReviewID": "R38B87AE59BOBD", "Overall": "5.0", "Content": "We bought two tablets for our daughters for Christmas.  Each received the Samsung Galaxy Tab 3 (7 inch).  Our daughters are 11 and 9.  It was a perfect gift.  First, the price was very reasonable for a quality product.  They use their tablets each day playing games, skyping with relatives and friends, email, etc.  And what I love most is that they enjoy it.  It was hard to justify buying an ipad for them when the Samsung offers everything for them that an ipad would.  And our experience with all Samsung products has been a good one.", "Title": "Perfect", "Date": "January 11, 2014"}, {"Author": "Clare Williams", "ReviewID": "RZ24UGIY7OPF2", "Overall": "5.0", "Content": "Surprise Christmas gift for 9 year old and she's thrilled! She hasn't put it down yet! Very easy for her to navigate.", "Title": "Daughters favorite", "Date": "January 11, 2014"}, {"Author": "Carlton Joyner", "ReviewID": "R2O0N4YWPAEDEM", "Overall": "5.0", "Content": "Bought this tablet for my daughter for Christmas, she loved it. The only compaint she had was it took so long for the battery to be fully charged. Other than that no more compaints.", "Title": "Good tablet for the money!", "Date": "January 11, 2014"}, {"Author": "Socrates Wep", "ReviewID": "R1LR0LV1QMMIZP", "Overall": "2.0", "Content": "I was using an iPad Mini before trying out this. All I can say is big difference in performance and responsiveness to touch. I'm going to stick to Apple.", "Title": "Slow compared to iPad Mini", "Date": "January 11, 2014"}, {"Author": "MamaofIII", "ReviewID": "R3625EIT1QF0CA", "Overall": "3.0", "Content": "Right off the bat it didn't charge when I plugged it in. Seems like I always have to double & triple check when I plug it in. Sometimes it works, sometimes it doesn't. Next I was disappointed in how slowly it operates with the internet. I guess I'm spoiled to my iPhone.", "Title": "Operates a lot slower than I thought it would", "Date": "January 10, 2014"}, {"Author": "Gregorio", "ReviewID": "R7W5FO1SX9BG3", "Overall": "5.0", "Content": "excellent productis for my personal use I am very happy to get this article sending was excellent to deal with Venezuela always attentive seller everything perfect charm me when I gave all the excellent sealing I'm very happy", "Title": "excellent product", "Date": "January 9, 2014"}, {"Author": "Ramiro Martinez", "ReviewID": "RNLBQY0NG0QOS", "Overall": "5.0", "Content": "i liked everything about this tablet, it is very nice for the kids that like playing games & apps. thank you!", "Title": "Good Tablet", "Date": "January 9, 2014"}, {"Author": "Get-A-Geek", "ReviewID": "R3L236CU82RKPJ", "Overall": "4.0", "Content": "I purchased this for my daughter for Christmas. This is a great tablet for the price. The screen does NOT have as good of resolution as the Nexus 7 Gen 1, but it does have the SD slot which imho needed for a device such as this, which will be used for Music and Videos. I found the gui responsive, and once again a great value for the price if found this on sale for $139.00", "Title": "Great Value for the money", "Date": "January 9, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RV5TG4A3JUHHD", "Overall": "5.0", "Content": "I purchased this for my mom for Christmas as an alternative to replacing her MP3 player. For the price, it seemed like a waste to buy another MP3 player when she could have a mini tablet which can still fit in her bag but does everything her HP Touchpad does. She's very happy with it. The price was $159 when I purchased it. I have the 10.1 inch Galaxy Tab 2, which I love, but I considered purchasing one of these for myself as well because of the handy size. I also have an S4 phone so I'm a fan of Samsung. I wished I had purchased one for my mother-in-law instead of the Kindle, which has no camera, no memory card slot and very limited apps.I'm very happy with the purchase.", "Title": "Great tablet, handy size", "Date": "January 9, 2014"}, {"Author": "edward", "ReviewID": "R3LW83A6QFVVML", "Overall": "5.0", "Content": "Ok so before i owned a ipad 2 i gave it to my siste4 because i didnt like it. Nd i just bought the samsung tab 3 nd its so awsome! I really like it. (Note when first getting this tab update the tab there will be about 5) alot of ppl never update there stuff nd leave poor reviews for the bugs etc. It really made a difference. I can use all my favorite apps. Nd i own a samsung galaxy s3 nd i love my phone so now i have a bigger version haha. Internet is a bit slow but not enough to hate it over all i really like it nd i have been on it all the time.", "Title": "Samsung did great.", "Date": "January 9, 2014"}, {"Author": "KSCANT", "ReviewID": "R2DM4YGGNWJBC0", "Overall": "5.0", "Content": "I bought this tablet for my granddaughter for Christmas and she loves it. She says it is so easy to use. Coming from a 6 year old that is saying something.", "Title": "Easy to use", "Date": "January 9, 2014"}, {"Author": "ktowndiva \"Isadabomb\"", "ReviewID": "RIP4WND7WVBX3", "Overall": "5.0", "Content": "I bought this for my 19 year old daughter. I wasn't sure if she'd even be interested in it. But, to my suprise, she loves it. The only downside to it is all of the bloat wear Samsung adds to their phones and tablets. But, if you like Samsung phones, you'll love the Galaxy tablet!", "Title": "Great product", "Date": "January 9, 2014"}, {"Author": "Joel B.", "ReviewID": "R2O6086DGGMGRY", "Overall": "5.0", "Content": "WE love it just like every body ,I must keep a watch full eye on it .However I told the admirers where they can purchase any amount they want .Thank you very much.", "Title": "Pleased costomer", "Date": "January 9, 2014"}, {"Author": "Michael", "ReviewID": "RXIYWOGSOZLPT", "Overall": "3.0", "Content": "If you're a fan of the phone you'll be quite impressed with the tablet. It may look small but it's quite impressive and the load time isn't bad at all. The downside is the screen. If you're clumsy and drop things a lot the screen will shatter if dropped so get the extended warranty and a case that's sturdy and will protect the screen.", "Title": "Delicate screen but solid tablet", "Date": "January 9, 2014"}, {"Author": "hi", "ReviewID": "R322YDYPANHQUY", "Overall": "3.0", "Content": "The only thing I do not like about this is about the option of putting in a micro SD card to add more GBs to the Tablet. The Tablet doesn't allow you to transfer apps onto the micro SD card at all. Now I have a 32 gb micro SD card with nothing to put on it.", "Title": "micro sd card", "Date": "January 8, 2014"}, {"Author": "Andy Whipp", "ReviewID": "R8H6IARAA4VX6", "Overall": "5.0", "Content": "Good LiTtle tablet Only Compliant I Can Think Of Would Be The Camera Doesn't Have A FLash. Would Buy Samsung Again.", "Title": "nice tablet", "Date": "January 8, 2014"}, {"Author": "maggie", "ReviewID": "ROOVKVNCBT0AY", "Overall": "5.0", "Content": "Great buy, it came new and works like a dream. My husband loves it and he carries it around every where he goes.", "Title": "Wonderful", "Date": "January 8, 2014"}, {"Author": "jessica", "ReviewID": "R1KS2MG8197EIQ", "Overall": "5.0", "Content": "arrive in perfect condition. this product is perfect. pleased. I do not even handle lack of knowledge but equally this very cool", "Title": "galaxy tab", "Date": "January 8, 2014"}, {"Author": "John Carter", "ReviewID": "RB23VL8JLKHM1", "Overall": "5.0", "Content": "The receiver of this gift was happy with it. is still adding new apps and games, also enjoys the two camera angles.", "Title": "was gift .", "Date": "January 8, 2014"}, {"Author": "Scott Whitfield", "ReviewID": "RK0FUWVA8MYUZ", "Overall": "4.0", "Content": "Solid, affordable tablet.  Gave as a gift for Xmas, and family member was very happy with it.  Would suggest to others.", "Title": "Good buy", "Date": "January 8, 2014"}, {"Author": "Discover", "ReviewID": "R3E4BQVL73M4CN", "Overall": "5.0", "Content": "Got this tablet for my wife and she loves it.  She had a knook tablet that is now a forgotten item.  This tablet makes up all the things that were missing on her other tablet.", "Title": "great gift", "Date": "January 7, 2014"}, {"Author": "kadene kirlew", "ReviewID": "R2YG4VA286D474", "Overall": "5.0", "Content": "This product exceeded my expectation, super phenomenal,loving it !I would definitely recommend this product to any one who is always on the go.", "Title": "Samsung Galaxy Tab 3", "Date": "January 7, 2014"}, {"Author": "Michelle Reimers", "ReviewID": "R1XQH34OG0O3FN", "Overall": "5.0", "Content": "my son in law chose it. And my granddaughter was so happy, she was speechless which is worth more than the weight of gold.", "Title": "GREAT CHRISTMAS GIFT", "Date": "January 7, 2014"}, {"Author": "lewis g webb", "ReviewID": "R14M1IRJ37871", "Overall": "5.0", "Content": "I love my tablet  l enjoy  I can't do anything with it  is make my day  I like the color of it", "Title": "I'm very happy with my tablet", "Date": "January 7, 2014"}, {"Author": "merrygumbo \"merrygumbo\"", "ReviewID": "R1A2F2VOKBF2BQ", "Overall": "5.0", "Content": "I really like the convenience and light weight of this tablet. It does everything my big one does but in a carry it with you package.", "Title": "So light and fits in my purse", "Date": "January 7, 2014"}, {"Author": "Trecy Sutton", "ReviewID": "R1KHRH99AJDTP8", "Overall": "5.0", "Content": "These were a Christmas gift for my boys ages 8 and 10. After reading reviews on several tablets after many months I finally settled on the Samsung Galaxy and I am happy with my purchase.  They loved the tablet and it has so many apps. Runs great. And the price was awesome.  Thanks for everyone else's detailed reviews, you made my choice easy. I'm thinking of buying the larger one, same brand, for myself.", "Title": "Perfect", "Date": "January 5, 2014"}, {"Author": "GLENYS UMBRIA", "ReviewID": "R2ULYF7CNR4E1S", "Overall": "5.0", "Content": "If you are looking for: a lightweight tablet that is very easy to hold in one hand comfortably and you want a basic and easy to use tablet, then consider this is your tablet", "Title": "very good product", "Date": "January 5, 2014"}, {"Author": "DANIELA A MARQUEZ V", "ReviewID": "R1E7EMXABDGCX9", "Overall": "4.0", "Content": "So far, so good! Its great for traveling and staying conected. I can do everything I do from my PC. I rate it 4 because i would like it to be a little faster when i need de keyboard. For 150$ it's GREAT!", "Title": "GREAT!", "Date": "January 5, 2014"}, {"Author": "love to hunt", "ReviewID": "R3SME5P6WE652Z", "Overall": "5.0", "Content": "Our family now has three of this and love them they are great for all of your books, record keeping, calendaring and so much more I don't even know what all it can do. The kids are better at it than I am.", "Title": "grate", "Date": "January 5, 2014"}, {"Author": "monica olson", "ReviewID": "RPROUV6PY3VPE", "Overall": "5.0", "Content": "I got really frustrated with this tablet and I threw it up against a wall, and now it's working... Lol didn't break. 5 stars just for that", "Title": "Well", "Date": "January 5, 2014"}, {"Author": "Ricky", "ReviewID": "R2FK4221HJ8CCE", "Overall": "5.0", "Content": "It's a Christmas gift for my wife. It's very neat and allows her to leave her laptop at home. So far, absolutely no problems. Exceeded our expectation!.", "Title": "very stylish", "Date": "January 4, 2014"}, {"Author": "E.S.", "ReviewID": "R139BZEO3OOJMD", "Overall": "1.0", "Content": "This tablet is noticeably slower than the Nexus 7 (first generation) and the extra Samsung software is redundant and confusing.", "Title": "Not a great tablet", "Date": "January 4, 2014"}, {"Author": "Seeo", "ReviewID": "R3OK94G67NCSVB", "Overall": "5.0", "Content": "Outstanding portable electronic device. I'm writing a book and my husband & I travel alot. Tired of carrying my laptop around and the Samsung Galaxy Tab 3 seemed to be the perfect little investment. Whenever and wherever I get ideas I can pull my tablet out of my purse and write down things I need to remember. Love the various applications that can be downloaded from the Google store for free or at a low cost. I can watch movies, read my e-books, download favorite rock tunes, do my banking, shop at all my favorite stores and even read our Church's Bible lessons on my Samsung. Convenient and worth the small cost. I love that it synch's with my samsung phone and my desktop pc. As a reviewer for a number of websites I can do my assignments while on vacation in my extra time rather than wait til I get home to complete with worry of not making deadlines. Also love all the space for contact numbers and addresses. I've bought three tablets in the past that I was not happy with, this one is staying with me. Highly recommend~", "Title": "My Constant Companion, Samsung Galaxy Tab 3,~zero complaints...", "Date": "January 4, 2014"}, {"Author": "Amy L. Clements \"h2hfan\"", "ReviewID": "RLW4XXF1XHJNO", "Overall": "5.0", "Content": "awesome little table. its smaller than my ipad mini so it definitely gets a plus for that. also its easy to travel with. love it,love it, love it.", "Title": "love it", "Date": "January 4, 2014"}, {"Author": "Raquel Flores", "ReviewID": "R3US581MZIZR6H", "Overall": "4.0", "Content": "I bought this as a gift for my daughter and it works great for some reason the tablet has froze twice but over all its a good tablet.", "Title": "my opinion", "Date": "January 4, 2014"}, {"Author": "diva", "ReviewID": "R2RREH0LSVMSQK", "Overall": "5.0", "Content": "I live in the Caribbean and the prices for the tab 3 are really expensive.  And my neice wanted one so bad. I decided to browse through amazon.  And guess what the prices were phenomenal.  I must have one for myself. In my country they hike up the price for every thing simple thing as color. But with Amazon the sellers are more considerate.  This is a great product at a bargain price.  A must have.", "Title": "Great product at a bargain price", "Date": "January 4, 2014"}, {"Author": "Debra Campbell", "ReviewID": "R7GU0S4FOYVNU", "Overall": "5.0", "Content": "This was a gift for my father.  I have one just like it. He absolutely loves it. It's easy to use and the perfect size for his needs.", "Title": "Absolutely love it!", "Date": "January 4, 2014"}, {"Author": "By Atomika92", "ReviewID": "R1XWFGJBXDB3RZ", "Overall": "5.0", "Content": "Got it for my girlfriend and she loves it, i would purchase another it's very sturdy the quality is great and shipping was fantastic.", "Title": "Fast Shipping", "Date": "January 3, 2014"}, {"Author": "Kathleen", "ReviewID": "R2DLNY6B1KFBZI", "Overall": "4.0", "Content": "I definitely enjoy this tablet and the practical apps I use on it. However when it comes to video quality and fun apps that require video its very laggy and produces poor, low quality video and its also hard to get good lighting with the video camera. Also browsing the internet on this(Chrome, Google search bar) is very laggy and at times unresponsive. If you are using this tablet simply for practical apps that you would use daily such as banking, weather, stocks, Instagram, Facebook, pinterest etc. it performs fine in that department. When it comes to apps that would require using the video camera or camera for much detail (keep in mind the camera on this tablet does allow you to focus on one object) I would definitely go with a different tablet. But since I am not too invested in a camera on my tablet, I'm not too upset about it. overall, I am satisfied with my purchase but just had a few complaints.", "Title": "Good for the price but you get what you pay for.", "Date": "January 3, 2014"}, {"Author": "Dara", "ReviewID": "RWYZAPA2ODUMA", "Overall": "5.0", "Content": "This tablet is great. Only wish I could have afforded a bigger screen version, and  I think it should come standard with a screen saver already on it . I bought my kid a Dell and it came with one already on it, perfectlyperhaps tablet makers can either follow suit or make it an option. An option that they could charge an additional, nominal fee, of courseaside from that I'm very well pleased with this tablet. It does all I need and more. Always been a Samsung fan.", "Title": "Samsung, never disappointed", "Date": "January 3, 2014"}, {"Author": "LNJKIDS", "ReviewID": "R25QK7ENO0Z0TA", "Overall": "4.0", "Content": "The screen is a  bit small at times but better than the larger 10\".  Overall a great value for the money.", "Title": "Good tablet", "Date": "January 3, 2014"}, {"Author": "Patricia McCormick", "ReviewID": "R1XL4HEA04BGEV", "Overall": "5.0", "Content": "I had a Galaxy Tab2 but left it in a taxi and was lost without it. I was so happy to get the #3, and the best thing about it is that the connector has been changed so that it is the same as my Sony camera and my Motorola phone! No more having all those wires lying around.", "Title": "Love it!", "Date": "January 3, 2014"}, {"Author": "Trisha Lea", "ReviewID": "R2YGYH5DP8P4NL", "Overall": "4.0", "Content": "The shipping time exceeded my expectation! The Samsung tablet preforms well and looks great! My son loves it. It was a good buy.", "Title": "Bought for teenage son for Xmas", "Date": "January 3, 2014"}, {"Author": "Christine", "ReviewID": "R37IDXRQM6A35C", "Overall": "4.0", "Content": "I ordered this as a gift but my boss at work has one. It is slim and very portable. The screen has great resolution. It takes pretty good pictures and they are easy to send/download. Easy connectivity to wifi.", "Title": "Great product, great price", "Date": "January 3, 2014"}, {"Author": "Harmony & Rachel", "ReviewID": "R2LH1J6L7HIEDR", "Overall": "3.0", "Content": "Works goid, not as fast as I thought it would be and the pictures aren't the best, I expected more than I got. Although it does what I need it to for now. I had a sony Xperia worked so much better than this so does the kindle fire hdx not to impressed with this tablet more hyped up than it turned out to be worth unfortunately.", "Title": "good for now", "Date": "January 3, 2014"}, {"Author": "Tonya Hayes", "ReviewID": "R15Q8VEK3M0W3O", "Overall": "5.0", "Content": "I ordered this for my husband for Christmas and it was just what he wanted! It's small enough to take anywhere and it gives him everything he needs and then some. I really liked the gold - brown color as well. It was nice to have a choice other than black or white.", "Title": "Just what I was looking for!", "Date": "January 3, 2014"}, {"Author": "DIANA LOZANO", "ReviewID": "R3PXL9Z3M702MJ", "Overall": "5.0", "Content": "Very nice picture on tab. would recommend to all. very chic. I got the gold brown tab. Look's nice. So glad I got this. works great too.", "Title": "Good Quality", "Date": "January 3, 2014"}, {"Author": "KATENJ", "ReviewID": "R2KDR2KDUYQJQ1", "Overall": "5.0", "Content": "Best price around!  Nice tablet for excellent price.  Love Cyber Monday and Amazon.  Still haven't found a better price even with after Christmas sales.", "Title": "Great Tablet and Price", "Date": "January 3, 2014"}, {"Author": "Jayra", "ReviewID": "R2XCHOTAHCVP25", "Overall": "5.0", "Content": "I am not a technology fanatic but it does what we expected to do. My son is happy and I am happy because we have bought all the learning games that helps him for school.", "Title": "It is what my little boy expected.", "Date": "January 3, 2014"}, {"Author": "Aurelia Ramirez", "ReviewID": "R1BVHH5YABYF27", "Overall": "3.0", "Content": "the tablet it self is good but the battery life no so. have to charged the tablet twice a day", "Title": "battery", "Date": "January 3, 2014"}, {"Author": "ITS \"Its\"", "ReviewID": "RJ1FW1AH6R60E", "Overall": "5.0", "Content": "This was a gift to my son for Christmas!  I worried that the 7 inch might be too small, but he says it is just the right size for his busy graduate student lifestyle.  Not as bulky as some Tablets can be.  We added a leather case with a wireless keyboard to complete the gift.  He couldn't be happier.  It's fast, it's efficient, it has a lot of features.  Couldn't be happier with this purchase.  Well worth the money!", "Title": "HUGE hit!", "Date": "January 3, 2014"}, {"Author": "booboobear", "ReviewID": "R27S0HV2RHMEA1", "Overall": "4.0", "Content": "I bought this for my wife for Christmas, I guess she likes it, bigger to see than an Iphone so she can play her games and other stuff on the web.  Is another learning curve again for her, but she likes it.Seems like it has a lag in the time to bring up the next window, but for the price of the tablet, it is a pretty good deal.Wish there was a way to increase the 8 gb memory in it, yes you can put a chip in it on the side to increase the memory for the pictures, music and other stuff.  Don't know how much apps you can put in it with the 8 gb memory.", "Title": "Samsung Tablet", "Date": "January 3, 2014"}, {"Author": "B", "ReviewID": "R3LSX6KLRFQS9B", "Overall": "3.0", "Content": "Highly recommend going with faster processor and spending the extra $100. The tablet continues to lock up and crash when trying to use the GPS and Google maps", "Title": "Mediocre", "Date": "January 3, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3LSA4AYBSMDW7", "Overall": "5.0", "Content": "works great. just like my Samsung phone. very easy for even a beginner tablet user. son is very happy to be high-tech.", "Title": "so easy to use", "Date": "January 3, 2014"}, {"Author": "Mike", "ReviewID": "R1IR8O470G5086", "Overall": "5.0", "Content": "Just about every Android product that I have owned has been a Samsung.  Love their products and sleek styles.  I could not ask for a better product.", "Title": "Another great Samsung product", "Date": "January 3, 2014"}, {"Author": "Marlon Gooden", "ReviewID": "R22ZQBTJAXPGS1", "Overall": "5.0", "Content": "Great product got it in time for Christmas it's small and handy easy to use for adults n kids alike", "Title": "Galaxy tablet 3", "Date": "January 3, 2014"}, {"Author": "maggie", "ReviewID": "R8X02M9G294DT", "Overall": "5.0", "Content": "It is beautiful. Full of tools, easy to work with, the screan resolution is the best I've seen. It is light and what I really wanted to have. Thanks Amazon.", "Title": "The most useful I ever had!", "Date": "January 3, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2OCOMVVQNT46N", "Overall": "4.0", "Content": "I Love this tablet is awesome! Is a little slow but is okay. If u are looking for something that is not to fast then this is okay.", "Title": "This Tablet Rocks! The only complaint I have is that I can't watch Amazon instant prime videos. But all in all is a good tablet.", "Date": "January 3, 2014"}, {"Author": "Travis Nevels", "ReviewID": "R3VFDNCJ379KLS", "Overall": "4.0", "Content": "Camera quality isn't the best but it works great and my parents loved it. Great tablet for a first timer.", "Title": "Good gift", "Date": "January 3, 2014"}, {"Author": "Anish", "ReviewID": "R1HC91Y6T7D2IF", "Overall": "5.0", "Content": "Good Product...nice sound and the screen clarity is very good..dont much expect for high graphics games but you can play many good games.", "Title": "Good Product", "Date": "January 3, 2014"}, {"Author": "Cathy Serex", "ReviewID": "R2V1Q20GZMDLKP", "Overall": "5.0", "Content": "We are still learning about all the capabilties that the Galaxy has. We can turn on and off our televisions with it, as well as surf the Internet and keep up with email.", "Title": "Meets all our expectations and then some!", "Date": "January 3, 2014"}, {"Author": "Nilda Martinez", "ReviewID": "RGRQY9REK0TO4", "Overall": "5.0", "Content": "Just great! My son loved it. Loves how fast it is, movies are clear, and battery life is greatest thing.", "Title": "Great present for my son", "Date": "January 3, 2014"}, {"Author": "Julie", "ReviewID": "RSCZC37O5PDVC", "Overall": "5.0", "Content": "We chose this tablet for my daughter because we had similiar phones and she knew how to work them already. She has loved it and I have used it several times myself. Battery life is good as well. Highly recommend this tablet if your looking for something small.", "Title": "great tablet", "Date": "January 3, 2014"}, {"Author": "Ronny Nieto Pasquel", "ReviewID": "R1S0TV0QDI0YIP", "Overall": "4.0", "Content": "Very good article, fulfilled the expectations of purchase. One is to install programs and enjoy the tablet with my family. Thank you.", "Title": "Samsung Galaxy Tab 3", "Date": "January 3, 2014"}, {"Author": "SB", "ReviewID": "R17SO4FM5KP51E", "Overall": "2.0", "Content": "Samsung always has good products but i think this is below their standards for what I paid.  Yes this is my first table but I expected a flash on the camera and video because i  planned to take plenty of pictures and record the kids.  This is a big problem for me.  Other than the camera the rest of the tablet is cool, pre-loaded apps are great, size is great.  Still debating on sending it back.  I think I rather use my laptop for surfing, maybe buy a new digital camera and continue to use my cell for internet.", "Title": "did not live up to its name", "Date": "January 2, 2014"}, {"Author": "nilantha Jayathilake", "ReviewID": "R3JJOSIG0BYWXP", "Overall": "5.0", "Content": "I love it, it gave me the expected value for me. I'm using it mostly for Skype calls and social media.", "Title": "It is Great", "Date": "January 2, 2014"}, {"Author": "thenursemommy", "ReviewID": "R19KI9XUO5LG0R", "Overall": "5.0", "Content": "Much better performance than the generic tablets. We had bought the Tagital generic tablet for $90 thinking it would be sufficient for our 6 year old son but we were wrong. We returned it to Amazon, spent a little bit more money and we're very pleased with this Samsung tablet!", "Title": "Much better than the Tagital Tablet!", "Date": "January 2, 2014"}, {"Author": "Marista McKain", "ReviewID": "R3GQXQ6KJBX6EF", "Overall": "4.0", "Content": "I have a Galaxy S3 mini and it is similar in style and function with a bigger screen and a few more perks. Good buy.", "Title": "Its Great", "Date": "January 2, 2014"}, {"Author": "Mother of 9", "ReviewID": "R1KXTJXSTOCNY3", "Overall": "5.0", "Content": "Bought this for my son, who likes to check NFL scores while he's watching football.  It has a nice clear display and hooked up to our wireless network easily.  The price was good.", "Title": "Nice little tablet", "Date": "January 2, 2014"}, {"Author": "germee", "ReviewID": "R2XOMFYFP933QN", "Overall": "4.0", "Content": "I bought the Galaxy Tab 3 as a Christmas present for my husband because I like the Tab 2 so much myself.  The only reason I didn't give it 5 stars is because the Wi Fi range isn't as good as the Tab 2.", "Title": "Love Android", "Date": "January 1, 2014"}, {"Author": "n2oyv", "ReviewID": "R2Q4NI22PKVMQY", "Overall": "5.0", "Content": "Got this tablet for my 13 year old son for Christmas.  Great product for the price.  I would recommend it", "Title": "Great tablet", "Date": "January 1, 2014"}, {"Author": "JC24", "ReviewID": "R1JNFYB2EJSG26", "Overall": "4.0", "Content": "Nice tablet for us, wish the battery lasted longer though. Screen is nice and is fast for the simple apps we use.", "Title": "Good tablet for 150$", "Date": "January 1, 2014"}, {"Author": "Elizabeth", "ReviewID": "R2L5A02I663XVT", "Overall": "4.0", "Content": "Received my tablet immediately on time for Christmas. Is exactly as described. Great present for my family !!! I love it!!", "Title": "quick delivery", "Date": "January 1, 2014"}, {"Author": "susi boothby", "ReviewID": "R3T1G0825VAPWK", "Overall": "5.0", "Content": "Friends have had this kind of tablet for over a year and have had no trouble. That is what I wanted for my first tablet and ii have not been disappointed.", "Title": "excited.", "Date": "January 1, 2014"}, {"Author": "mom02pink", "ReviewID": "RLEUV8IKB5OMX", "Overall": "4.0", "Content": "I love this Samsung Galaxy Tablet 3.  Awesome price. I wasn't sure about color when I ordered but love it.", "Title": "Samsung", "Date": "January 1, 2014"}, {"Author": "Melvis E. Leon", "ReviewID": "R3KS0U4B8HUKSI", "Overall": "5.0", "Content": "Good Tablet at great price (US $150.00), good processor, enough space (16 GB), memory 1 GB and microSD Card Reader.", "Title": "Good Tablet", "Date": "January 1, 2014"}, {"Author": "Greg Newman", "ReviewID": "RHJ82D6M3YKW9", "Overall": "3.0", "Content": "After using apple products I decided to try an android. It works and the price was nice. It's not great but will do what it says", "Title": "Good for the price", "Date": "January 1, 2014"}, {"Author": "Nicole F.", "ReviewID": "R16DUVODRZ2CPZ", "Overall": "4.0", "Content": "Thanks Amazon once again I'm a pleased customer. I purchased this tablet for my daughter for Christmas and have received no issues thus far and with all other purchases that I've made I hope I'd get no issues.", "Title": "This is what I expected", "Date": "January 1, 2014"}, {"Author": "George Menke", "ReviewID": "R32FOO07GGQILY", "Overall": "5.0", "Content": "Purchased for grandson. He really likes it, uses it all the time. WiFi used for Facebook and Google. Even used at school !", "Title": "Great tablet at an amazing price", "Date": "January 1, 2014"}, {"Author": "rangarit", "ReviewID": "R3RPY4JJ546C17", "Overall": "3.0", "Content": "However, I've just bought it and the charger icon does not work properly.. some apps are not available for these tablets yetOften , turns off suddenly...", "Title": "good product", "Date": "December 31, 2013"}, {"Author": "Unclebenny \"Ben\"", "ReviewID": "RSCTZ1QSFQC4P", "Overall": "5.0", "Content": "Outstanding 7 inch tablet, easy to use, and I haven't ran into any issue using it so far.  Well priced for a top tier brand tablet, it's worth spending the extra bucks than going with a cheaper price NO NAME brand tablets, with limited or close to none tech & customer support.", "Title": "Great brand comes with reliable products!!", "Date": "December 31, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RGWNALAV27US9", "Overall": "5.0", "Content": "This was a Christmas present for our 10 year old. She loves it. The camera was the selling point for us.", "Title": "excellent", "Date": "December 31, 2013"}, {"Author": "kareem", "ReviewID": "R3O32PLGIC0QR7", "Overall": "5.0", "Content": "the SG3 is surely a step up from the tab two, definitely worth the purchase met all my expectations of a tab", "Title": "Met all expectations", "Date": "December 31, 2013"}, {"Author": "Braulio", "ReviewID": "RX8QFDFWAGQK3", "Overall": "4.0", "Content": "perfect conditions, its cheaper than an apple but very good choise, its strong and fast, very cleen system and fast", "Title": "i love this one", "Date": "December 31, 2013"}, {"Author": "Cierra", "ReviewID": "RGV1W7QUPHCZ5", "Overall": "5.0", "Content": "Works great . Exactly what I was expecting to get. Got it in brown, something a little different that you don't see often", "Title": "Tab 3", "Date": "December 31, 2013"}, {"Author": "damaris barnabas", "ReviewID": "RDH11WWK72KGQ", "Overall": "4.0", "Content": "It's good very helpful wanderfull product it has google connection I like it  good for kids and the family very personal", "Title": "My Samsun Galaxy Loving it", "Date": "December 31, 2013"}, {"Author": "JOAN", "ReviewID": "RGBYWN2M7BU9X", "Overall": "5.0", "Content": "so far,it hasnt given me any problems & I think its worth the price.. my 5y/o daughter loves it.. :-)", "Title": "samsung galaxy tab3", "Date": "December 31, 2013"}, {"Author": "Matt", "ReviewID": "R1H4NF44M8HJRM", "Overall": "5.0", "Content": "Gift for son he can use it out of the box with little instruction resolution is perfect for what he needs. Perfect fit for him", "Title": "perfect gift", "Date": "December 31, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2AB0L15Y8HV4D", "Overall": "5.0", "Content": "Cant beat the price at $150. I bought this for my 8 year old son, instead of getting him a pricier and smaller iPod for xmas. I also bought a 64 gig card with it, so I can load it up with movies and games for him. (I have a program that downscales DVD's for mobile devices on my PC, so all the movies are free for us). I'll put some music on there for him also, all from my own collection. All sorts of free games he loves off of the Android Google Play marketplace. Plus, I can get him all sorts of childrens books that he'll have more fun reading on here than an actual real book. And lots of interactive books, which he loves. I totally recommend this tablet for kids. Just buy a decent case for it, and a screen protector, or take it to one of those cell phone accessory stores and have them put a screen protector on it.", "Title": "Good starter tablet", "Date": "December 30, 2013"}, {"Author": "R. Smith", "ReviewID": "R2ZNAUIMXQ1F6D", "Overall": "1.0", "Content": "I have owned several Samsung phones, so I didn't hesitate to buy this tablet for my toddler son to watch movies/shows and to keep him away from my iPad.  I clearly should have read more reviews.  This tablet is unbelievably SLOW.  As others have stated, it takes forever to open/close apps.  I won't buy another Samsung tablet.", "Title": "SLOW.", "Date": "December 30, 2013"}, {"Author": "V. Hervey \"soul of beauty\"", "ReviewID": "R34FT5WP9LXGDH", "Overall": "5.0", "Content": "This was an awesome purchase.  This tablet is great.  I use everyday and all the time.  it's awesome and I recommend it.", "Title": "Samsung Galaxy Tab 3 (7-Inch, White)", "Date": "December 30, 2013"}, {"Author": "Carlos Perez", "ReviewID": "R2ITP0ZX6LV1WG", "Overall": "5.0", "Content": "Before the purchase, I checked the other options and decided on the samsung tab 3. It was the best decision.", "Title": "Excellent purchase", "Date": "December 30, 2013"}, {"Author": "Maria Sookoo", "ReviewID": "R3HAFBR3SZLQWI", "Overall": "5.0", "Content": "Everything I expected it to be. I spend more time on it than on my laptop. The best is the battery life, I have two 7 year olds and they are always on the tab3.", "Title": "Great product", "Date": "December 30, 2013"}, {"Author": "Elaine", "ReviewID": "R221G81C9VWUYA", "Overall": "4.0", "Content": "Purchased this tablet as a gift for my niece and she loves it! Provides her all the internet access she needs as well as plenty of apps", "Title": "Great tablet", "Date": "December 30, 2013"}, {"Author": "Gerry Ricker", "ReviewID": "R27I1WBPXYO494", "Overall": "5.0", "Content": "My wife already had the Samsung Galaxy Tab 2 and loved it.  I, and our son, kept borrowing hers so she bought each of us one for Christmas.  Great product!!  It is easy to use and has a very crisp display.  I highly recommend this product!!!", "Title": "Great Product", "Date": "December 30, 2013"}, {"Author": "eudoralight", "ReviewID": "R2IBKEG3SULTIO", "Overall": "5.0", "Content": "This was purchased for a friend who is bedridden most of the time. He enjoys the size, he is still refining the settings but says that it suits him just fine.", "Title": "Tab 3", "Date": "December 30, 2013"}, {"Author": "Carlos C. Garay \"edcgaray\"", "ReviewID": "R26BKP4N1AK8S3", "Overall": "5.0", "Content": "Excellent product very high wifi speedAnd working with all my Google account perfect thanks for the product lol..Recommend", "Title": "totally recomend", "Date": "December 30, 2013"}, {"Author": "tammie", "ReviewID": "R103WB9TTVG465", "Overall": "5.0", "Content": "I amvery  pleased with this product, it is smaller than the rest of the tablets but it serves my purpose,. It has a very good picture, and it is very quick when hooked up to the internet", "Title": "samsung galaxy tab 3", "Date": "December 30, 2013"}, {"Author": "TomG", "ReviewID": "R10MM8015S2J2E", "Overall": "4.0", "Content": "My granddaughter loved her new tablet. She has been setting up apps, downloading games and taking selfies ever since she opened it.", "Title": "Nice tablet", "Date": "December 30, 2013"}, {"Author": "Momma C", "ReviewID": "R26AVTKRCYGXF2", "Overall": "5.0", "Content": "Purchased two of these tablets for my children, they absolutely LOVE IT!!! This tablet is user friendly and easy to use. The only negative to me is that the clarity of the graphics is not as great as it could be, but the children didn't notice the difference.", "Title": "Perfect for small hands", "Date": "December 30, 2013"}, {"Author": "seam", "ReviewID": "R881R1WU7IPCI", "Overall": "5.0", "Content": "I ordered two Samsung Galaxys for Christmas for my daughters. They are great and arrived quickly after my order. They are exactly what my girls wanted for Christmas.", "Title": "Galaxy", "Date": "December 30, 2013"}, {"Author": "caretta richmond", "ReviewID": "R26DIXGKM70KBM", "Overall": "5.0", "Content": "My grandson and his mom really liked the tablet.  She will be able to get more apps with this one.", "Title": "Great gift", "Date": "December 30, 2013"}, {"Author": "Robert Muszynski", "ReviewID": "R2Z7ZHLLNW18R2", "Overall": "4.0", "Content": "Good tablet overall, not quite the processing power of the Nexus 7, so for gaming, if you want to run games on the highest graphics settings (resolution), I would go Nexus 7. Also, getting the most recent version of Android is better on the Nexus, but otherwise, a very solid tablet. Got it for my son for xmas, and he is happy with it....", "Title": "Solid tablet", "Date": "December 30, 2013"}, {"Author": "Robin Vancil", "ReviewID": "R1RXBF0B3DGL2N", "Overall": "5.0", "Content": "I love my Galaxy Tab 3 !  I travel a lot, and I can throw this in my purse and not feel like I'm carrying extra luggage !", "Title": "Perfect size", "Date": "December 30, 2013"}, {"Author": "Aretha", "ReviewID": "R2ZJM033X3FP2G", "Overall": "5.0", "Content": "This was a gift for my 10 year old son and he loves it! It's mostly for playing games but it keeps him quiet.", "Title": "Galaxy Tab 3", "Date": "December 29, 2013"}, {"Author": "Reddobie71 \"A reading fool who also loves Cel...", "ReviewID": "R36ZEVYAG1ZJYS", "Overall": "4.0", "Content": "I like the tablet but it did not come with a owner's manual.  I had to look it up on line to read it.  I can't copy it because it's overt 200 pages long.", "Title": "Samsung Galaxy Tab 3 (7-Inch, White)", "Date": "December 29, 2013"}, {"Author": "Jerry&Melody;'s momma", "ReviewID": "R257GY98KQC8AH", "Overall": "5.0", "Content": "I got it quickly and I love it!!! I use it for everything,  from pictures to games for my 8yr old son, to an app that tracks my 5month old daughters doctor appointments :D", "Title": "Amazing!", "Date": "December 29, 2013"}, {"Author": "Lazar L.", "ReviewID": "R2BHBWNUVD10PY", "Overall": "3.0", "Content": "But without the phone, you can not put chip in in it. And it`s camera does not have flash. But it is Samsung galaxy", "Title": "It is like phone", "Date": "December 28, 2013"}, {"Author": "B. Ginkel \"bilobaman\"", "ReviewID": "R9XZNHXHCB8DB", "Overall": "4.0", "Content": "First of all, this is a decent tab.  I like it for what I use it for.  Value wise, it is a 'great success.'  I use it as my car navigation/radio device.  First thing I did was root it (XDA developers is AWESOME).  I left the stock rom on there, but needed root access for the Tasker app to be able to do all the things I wanted it to do.  I use an Akron dash holder to keep it mounted in my car.  When I power on the car, it boots Pandora, Waze, and other apps I want open while driving.  This thing spends 98% of it's time on my dash.  It does all these tasks admirably.  I have no idea how well it will do in the Utah summer heat though.  This is the WiFi model, I use WiFi hotspot from my phone for data while driving.Pros:- Bright screen with decent resolution- Battery life is quite long (even though it is always plugged in while driving)- It's Android rooted, so you can do whatever you want if you know what you are doing- Audio is sufficiently loud (I normally have the headphones plugged in to my aux while driving but sound is good)Cons:- Doesn't do great in the cold, even though I can't expect that; if it's cold, prepare for cold warnings and no charging, sluggish LCD refresh.- Menu/Back buttons don't light up on this 7\" model, sucks when night driving while trying to use it- Camera might as well not even be there, it has terrible resolution and horrible color.  Don't plan on using it for any reason.Overall, for a dash rider, it rocks.  Using Waze, Torque app for car data, Pandora or whatever music app you like, and Tasker seals the whole deal.  This app has a medium learning curve, but once you master it, you can make you phone do just about whatever you can imagine automatically.  8/10 would buy again.  Good for kids too at home with the WiFi.  If it breaks, oh well.  Not $500 bucks down the drain like an Ipad if it gets broken.  This thing has 200% more VALUE dollar for dollar over the Ipad.", "Title": "Great beater tablet.  Does most jobs well.", "Date": "December 28, 2013"}, {"Author": "valentina tulbure", "ReviewID": "R3UIJ5UVLJKBK1", "Overall": "5.0", "Content": "Great tab, perfect size/weight for everyday use! Easy to navigate, great screen resolution, awesome features! Would def recommend to friends/fam.", "Title": "Perfect little tab.", "Date": "December 28, 2013"}, {"Author": "Ryan Brewer", "ReviewID": "R25AHPOSD8W4M2", "Overall": "5.0", "Content": "Easy to use, awesome camera and features. All 3 of my kids absolutely love thier tablets. Buy this with confidence and be ready to have fun!!!!", "Title": "As awesome as my phone!!!!!!", "Date": "December 28, 2013"}, {"Author": "NJones", "ReviewID": "R2R78KOIRFZLMM", "Overall": "4.0", "Content": "The tablet performs well for the price. It doesn't have the highest screen res or performance stats, but I can use the internet when I don't want to lug my laptop around, and that's all I was asking for.", "Title": "Good tablet", "Date": "December 28, 2013"}, {"Author": "Wendy", "ReviewID": "RORFJKZN013MB", "Overall": "3.0", "Content": "My 11 year old loved the tablet. It was easy to configure. fast response.  But... two days after she started using it it would not charge.  If I had gotten it from a regular store I would have exchanged it that day.  So we sent it to Samsung to repair it.  Two weeks later  it was repaired and now working great again.", "Title": "sometimes brick and mortar is better...", "Date": "December 28, 2013"}, {"Author": "LezleyA", "ReviewID": "R3BZCIJP2PN0RG", "Overall": "5.0", "Content": "Bought this along with a rooCASE and my niece says it's the best present ever.  Since she got it she's constantly on the tablet.", "Title": "Best present for a 10 year old.", "Date": "December 28, 2013"}, {"Author": "DERRICK LOFTON", "ReviewID": "R3FHQUI4K7S9S7", "Overall": "5.0", "Content": "I absolutely love thie tablet!!! I get to down any book I need on the spot, great alternative to the Apple Mini, this tablature perform above and beyond my expectations!!!!", "Title": "Tablet", "Date": "December 28, 2013"}, {"Author": "Marlyse Purnell", "ReviewID": "R2EB0YNVJY1C3R", "Overall": "5.0", "Content": "My daughter loves her Samsung Galaxy tab. It was easy to use and it sink with her galaxy S3 cellphone. The music and pictures transferes easily.  Great purchase.", "Title": "Great purchase", "Date": "December 28, 2013"}, {"Author": "Amber Michael", "ReviewID": "R3ERL94V3WLW51", "Overall": "5.0", "Content": "This is the 4th Samsung tablet I've bought, and the 8th Samsung product.  I love this tablet and it keeps getting better!  I'm glad I decided to purchase this instead of the iPad mini.", "Title": "I will forever love Samsung", "Date": "December 27, 2013"}, {"Author": "Kenn", "ReviewID": "RBEA12HS2PBBZ", "Overall": "5.0", "Content": "Purchased as a gift for my daughter for Christmas.  Things were SO hectic during the opening of the presents (17 people at once), that I never got to see her reaction to the gift.  I assume she likes it as I haven't heard any complaints about it yet.", "Title": "Samsung Galaxy Tab 3/7", "Date": "December 27, 2013"}, {"Author": "M. Perry \"M Perry\"", "ReviewID": "R1U1555MI8D38Z", "Overall": "5.0", "Content": "I received this tablet as a gift, and as a proud owner of a galaxy phone, I like how both devices operate similarly. I know the phone is a higher end device in regards to resolution and raw power, but this tablet does everything I need it to, and much more. I like the build of galaxy devices, and this tablet is no exception. The screen is sharp and colors accurate. I noticed that the resolution is not on par with a lot of the new tablets, but the screen is still very clear and easy on the eyes. For the price, you really cant complain. Everything looks great on this tablet, and all the negative reviews you read are from really critical people. There is always something better out there in terms of specs, and you can drive yourself crazy comparing devices. Ibreally haveca hard time putting this tablet down, and I enjoy its performance. I use it primarily to web surf, shop onlinr, control my home theater, and basic tasks and it does them admirably,  with little lag. This is a great little tab, and am grateful to own it. Also, if you have a samsung smart tv...it integrates well with it. I consider myself a slight techie and this is a more than capable tablet except for maybe the most demanding games. If you use it for the basics and light gaming. Pick one up!!", "Title": "Everything MOST people need in a tablet.", "Date": "December 27, 2013"}, {"Author": "random", "ReviewID": "R1MKPPVBKYUWFZ", "Overall": "5.0", "Content": "So its a very good tablet in my opinion the keyboard is ugly though so installed a new one. It runs apps like modern combat with minor not at utters but little lag. My major complaint is this probably has happened to u with it maybe. So if your date on the tablet is wrong like now its the 27th but on my tablet it said the 31st. If u don't have the right date stuff will go slow and your internet will work but it will ask u to check the certificate every time. Also the YouTube app and amazon app won't work. So make sure its on the right date. All in all I love it", "Title": "I wanted to give it 4 and a half but my tablet wouldn't let me", "Date": "December 27, 2013"}, {"Author": "Peter", "ReviewID": "R29UF52D5XZ7UH", "Overall": "5.0", "Content": "Great price and does all that you need. Yes, there's no Microsoft Office programs or Windows but that makes it better. Less chances for programs to freeze. Its literally an oversized smart phone less the capabilities of making a phone call. If you are familiar with Android devices, then this is a very easy transition. Amazingly easy to work with, intuitive in the way you would want. I would recommend getting an extra memory card otherwise this thing rocks. Programs/apps open with ease and there's no lag time as it should be. A little heavy so laying on your back and balancing may be an issue but otherwise its a mean machine.", "Title": "love it", "Date": "December 27, 2013"}, {"Author": "Thomas M Ryan", "ReviewID": "R28BZG3RTFF7YV", "Overall": "5.0", "Content": "This was a Christmas gift for my less than technical wife.  She loves it.  It was easy to set up load apps.  I was able to install here gmail and Facebook accounts.  Display is clear and bright.  Processor is fast.", "Title": "fully satisfied", "Date": "December 27, 2013"}, {"Author": "Rakelia", "ReviewID": "RWM6S6O7GO0BX", "Overall": "5.0", "Content": "Tablet works great have no problems with it this far I have no issues with it. Arrived on time thanks for the great service.", "Title": "Works great", "Date": "December 27, 2013"}, {"Author": "Vivene Harris", "ReviewID": "R3H9MPQHYB57W", "Overall": "5.0", "Content": "I purchased this for my teenage daughter and she adores it. So I guess that this was another great purchase. I was also pleased with the service.", "Title": "Another great purchase", "Date": "December 27, 2013"}, {"Author": "Christine Tosner", "ReviewID": "R211DCESEX0GS9", "Overall": "5.0", "Content": "Easy to use. Clear screen.  Product shipped fast. Good price.  Able to sync apps from cell phone. Would recommend to others.", "Title": "easy to operate", "Date": "December 27, 2013"}, {"Author": "Romel \"Rom\"", "ReviewID": "R2UHQ22W1VYGIV", "Overall": "5.0", "Content": "Great Christmas gift .... my son is very happy ... because it is one of the electronic devices of the moment ...", "Title": "The Best", "Date": "December 27, 2013"}, {"Author": "T. Cabel \"amateur geek\"", "ReviewID": "R1ECC0OC7BDUXW", "Overall": "4.0", "Content": "Aside from no flash this is a great tablet. Links up to wifi with no problem. Easy to use with nice sounding speakers and even better sound with headsets. HD picture is great. You can load lots of music and pics on SD Card. Apps install quickly. If you want a tablet to use with wifi only consider this one.", "Title": "Samsung Tab 3", "Date": "December 27, 2013"}, {"Author": "DONALD L.", "ReviewID": "R2ZHEKJ39FYH7B", "Overall": "5.0", "Content": "Bought this sgt3 for my grandson.  Good size, good features, and most of all, the best price available at that time.  Would recommend to anyone.", "Title": "Samsung Galaxy Tab 3", "Date": "December 27, 2013"}, {"Author": "Javier Pinon", "ReviewID": "R11OQQCLI9XPAJ", "Overall": "5.0", "Content": "This is a nice tablet.. It was deceived in a decent time..it works  great out of the box ready to go...I give it five stars no problems...", "Title": "Samsung", "Date": "December 27, 2013"}, {"Author": "Katora", "ReviewID": "R3E5EK34JNCZGT", "Overall": "5.0", "Content": "Love the size. It was a great hit as a Thank you gift and will get much use. It is easy to use and very addicting. My nephew said if I had this before I went for my glasses, I may not have needed them!", "Title": "Fantastic", "Date": "December 26, 2013"}, {"Author": "Sergio M. Arizola Perez", "ReviewID": "R3AOC9Y1MGNBRB", "Overall": "3.0", "Content": "I bought 2 of them and one of the tablets stopped working a couple of days after just started using them, I need for you to help me out with this, where can I file a complaint or how can I get a refund or a change for the one not working?", "Title": "GOOD but...", "Date": "December 26, 2013"}, {"Author": "dk", "ReviewID": "R3GO4GJFGWWNO3", "Overall": "4.0", "Content": "Pros:* Great price on sale* Nice look & feel* Works well for our simple needs* AndroidCons:* A little underpowered, definitely feel some lag.* Battery life. But that's expected, nothing unusual.* Front camera is underwhelming, especially since Skype was one of the main reasons for buying this.* Registration took several tries, was a bit annoying.Definitely the best value at this price range. But if we were to do it all over again, might have spent a few $ more on a Nexus 7. But this was bought as a gift and the recipient is very happy with it.", "Title": "Great entry-level tablet", "Date": "December 26, 2013"}, {"Author": "Sabrina Jamerson", "ReviewID": "R1ICGUTWWIUKPC", "Overall": "5.0", "Content": "I bought this for my husband and it's a really nice tablet, great deal, super quality! It's like a bigger version of a cell phone. Easy to travel with and great to take notes, listen to music, take pictures and so on. I have a iPad mini myself but I think I am getting to like this samsung galaxy tab.3 7 inch better. The design is great and it's very light weight. It reacts quick, the sound is awesome, I have nothing negative to say:-)", "Title": "Awesome!!!", "Date": "December 26, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R5FE4T3NJBEX1", "Overall": "2.0", "Content": "Had it for less than a month and the battery would never last more than a few hours. Finally gave up the ghost and guit taking a charge at all. Love the Samsung phones but not to impressed with their tablets.", "Title": "Not up to par.", "Date": "December 26, 2013"}, {"Author": "Herbert Gomez", "ReviewID": "R3MAHAATRKMDWM", "Overall": "5.0", "Content": "Item was as described. It came in the original box which seems ok just older and not a good constructed cardboard box like you would expect. Charge cord and a book came with it.", "Title": "As Described", "Date": "December 26, 2013"}, {"Author": "abatemember", "ReviewID": "R3TF341TGU4EHS", "Overall": "5.0", "Content": "This tablet was bought for the grand daughter. She would always play games on the wife Samsung phone. This freed up my wifes phone and the grand daughter (5 years old) knew exactly how to use it.", "Title": "for the grand daughter", "Date": "December 26, 2013"}, {"Author": "maricia hawes", "ReviewID": "R2GLDAOGFM511G", "Overall": "5.0", "Content": "Colour was as described and my son can't seem to put it down. It has replaces his computer and is great.", "Title": "great tablet", "Date": "December 26, 2013"}, {"Author": "Stephen", "ReviewID": "R2XSP9G0PSDCAL", "Overall": "5.0", "Content": "Samsung devices really speaks for themselves, this device works great and is very attractive,  if you don't want anything to big but looking for alot of  great features similar to larger tablets check out this tablet.", "Title": "Samsung GT3", "Date": "December 26, 2013"}, {"Author": "Elynu", "ReviewID": "R3W2GVOOZVX5IQ", "Overall": "5.0", "Content": "I bought this tablet to download stuff to read and I love it! I find myself now trying to manage my time because otherwise I'll be on my tablet most of my free time on social media, skype and just searching. It's compact, lightweight but very efficient. My husband (who is a programer) was so impressed with my tablet that he went to the store and bought one for himself and also one for my daughter but I got a better deal than him at Amazon. I also ordered a cover for the tablet at Amazon to protect my treasure. It also came with offers for Hulu+ (free for 3 months, but there's a charge if you don't cancel afterwards) games, and much more.  I love it and recomend it to anyone that's looking for a light, compact and action packed excellent tablet with lots of xtras.", "Title": "Excellent Tablet!", "Date": "December 26, 2013"}, {"Author": "Randol F.", "ReviewID": "R1BTYGDMWW7M11", "Overall": "4.0", "Content": "I like it my new samsung galaxy tab 3!! the battery life is very good and the camara is perfect", "Title": "Perfect!!", "Date": "December 26, 2013"}, {"Author": "Brian Hinks", "ReviewID": "RLJSTOT7X2OI9", "Overall": "5.0", "Content": "I was very happy with this product.No complaints at all.I would recommend this tablet to anyone.shipment came on time.", "Title": "Great product", "Date": "December 26, 2013"}, {"Author": "Ellen R. McDaniel", "ReviewID": "R1JYIOJK0KYJ0", "Overall": "5.0", "Content": "Last year we purchased the Galaxy 2 for our son and it's been great- no issues! So this year I purchased the Galaxy 3 for my husband so he'd stop using my sons!!! I guess you could say we are a Galaxy family now!!!", "Title": "Absolutely LOVE the Samsung Galaxy line!", "Date": "December 26, 2013"}, {"Author": "Laurie", "ReviewID": "R29WUKSCGADVHY", "Overall": "5.0", "Content": "Purchased for a 12 year old who has not put it down since she got it. I have yet to hear anything negative so we are giving it five stars", "Title": "Samsung GalaxyTab", "Date": "December 26, 2013"}, {"Author": "marig_x", "ReviewID": "RLEDWH3MBGHYF", "Overall": "5.0", "Content": "Excellent!. This tablet is absolutely amazing! It's a perfect size not too big not too small. Is super fast & has so many features I have yet to uncover.", "Title": "Great!!!!", "Date": "December 26, 2013"}, {"Author": "Jeremy Howard", "ReviewID": "R3O29OOXYJ3ZBW", "Overall": "4.0", "Content": "I do love my iPad, but I will say for something small and portable, this is very good. Had a great price point and fits good in my hand. Registration is a bit of a pain, and there is no iHeart radio in the samsung app store, but it still has a majority of the other major apps.", "Title": "Good for android!", "Date": "December 25, 2013"}, {"Author": "Anjaiah", "ReviewID": "R17AFFZ97WOP2M", "Overall": "4.0", "Content": "Pros :Handy, excellent touch screen and value for money device.Cons: difficult to close opened tabs,I would definitely recommend this to friends.", "Title": "good device", "Date": "December 25, 2013"}, {"Author": "Joseph Jackson", "ReviewID": "R1PV3P1M488ZLI", "Overall": "5.0", "Content": "Now i am witness to the products to my familly and freind Leting them no that they works and they or in good condition.So now I am looling fom the to go on my  site for orders.", "Title": "Another I love it", "Date": "December 25, 2013"}, {"Author": "Richard L. Schaut \"Small Business owner\"", "ReviewID": "R2MJTVIFN6GGCM", "Overall": "5.0", "Content": "we have Bought a cheaper Tablet , good luck I tried it out first junk would not boot up.. ordered this for our granddaughter for Christmas.. outstanding value .. down loaded a few games on it for her. set up an email address for her so we can email her. i love the live wall paper app . i down loaded she is going to flip.. Thanks", "Title": "Granddaughters Christmas present", "Date": "December 24, 2013"}, {"Author": "Mariela Alvarez G", "ReviewID": "RYYXQGIGK46FF", "Overall": "5.0", "Content": "Great choice  and arrived  on time..it is going to be the right gift for my kid  thank you very much  it works well  and  have a great resolution", "Title": "just want i wanted", "Date": "December 24, 2013"}, {"Author": "Carlos Duque", "ReviewID": "R159EJCC6PI5WT", "Overall": "5.0", "Content": "Because the service and the product were spectacular, everything was as requested, therefore recominedo all buy the product. Also the store is completely reliable, it delivers what it offers", "Title": "EXCELLENT SERVICE", "Date": "December 24, 2013"}, {"Author": "K. Carter", "ReviewID": "R95WKF32L1HYN", "Overall": "5.0", "Content": "This tablet has met my expectations.  I enjoy using it and look forward to exploring it more.  The tablet came earlier than expected and I am happy with the purchase.", "Title": "very good product", "Date": "December 24, 2013"}, {"Author": "Chip French", "ReviewID": "R2QLWFEN37NMOA", "Overall": "5.0", "Content": "I ordered 2 for my children ... TOTALLY not functional but if you wanna play and get on internet PERFECT", "Title": "I LOVE MINE", "Date": "December 23, 2013"}, {"Author": "Lucas", "ReviewID": "R2PGTLXEVTLFL9", "Overall": "5.0", "Content": "I recommend this product 100% its size is ideal for trnsportar and take it where you want your graphics and photos are excellent addition to its processor which is the best in the market. If you want to buy a tablet last generation and these indesiso even this is definitely your best option. Buy it you will not regret", "Title": "Excellent", "Date": "December 23, 2013"}, {"Author": "Jhoanmar", "ReviewID": "R3TUJP91B8IM0N", "Overall": "5.0", "Content": "Is amazing this product. I really like it, and the purchase was a really fast and clear. Continue with this service as well as it", "Title": "Excellent Product", "Date": "December 23, 2013"}, {"Author": "Corrie F.", "ReviewID": "R3JCFK7C9OAYJR", "Overall": "5.0", "Content": "Awesome Tablet especially the cyber Monday price. This is my second Galaxy 3 tab. the first one was for my kids and this one is for me! lol It speaks for itself!! I placed the order and I received it in 2 days with free shipping!! You can't get any better than that. Amazon Rocks!!", "Title": "Samsung Galaxy Tab of \"Awesome-ness\" 3", "Date": "December 6, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RM6C68D28NP7W", "Overall": "5.0", "Content": "I received this for my birthday gift and this is the first tablet PC in my life. This 7-inch tablet is portable and not small.", "Title": "I love this", "Date": "December 5, 2013"}, {"Author": "jordan2380", "ReviewID": "R10YJKF4NYHXEL", "Overall": "4.0", "Content": "So I've had this tablet for a few days noe to play around with it and I must say I  pretty im pressed with  it so far. I did get it for a few different reasons like school and entertainment. Haven't done the school thing yet but  I have checked out some movies and I almost freaked out because the first movie I chose was from '92 and it was very poor quality but I chose a different movie from that same era and it was digitally remastered and it was much better. I tried a few more and Im satisfied with this tablet. It can be a bit sluggish at times but Im diggin it.", "Title": "Im diggin it.", "Date": "December 4, 2013"}, {"Author": "Debbie Stephenson", "ReviewID": "R1V3KFH3FLBLZ", "Overall": "5.0", "Content": "Great little tablet. Clean, crisp picture. Fast surfing & gaming. Perfect size to just slip in your purse. Love it", "Title": "A great little tablet. Perfect size, very portable", "Date": "November 21, 2013"}, {"Author": "chris", "ReviewID": "R1OTTS9986FA18", "Overall": "5.0", "Content": "Arrived on time, which is a plus.  The case not damaged or bent.  This is a Christmas gift for wife and when it arrived at our house it was in a plain box, which was great because my wife picked up the box and had no idea what was inside it.", "Title": "tab", "Date": "November 18, 2013"}, {"Author": "Fernando B.", "ReviewID": "R2PUZJ7C4SKR4L", "Overall": "5.0", "Content": "A very good gift to  my sister. She loved it. Practic, usefull and fast Internet connection. Excellent and easy to naviguate on the www.", "Title": "An excellent gift: no way for a mistake. Everybody will love it.", "Date": "November 15, 2013"}, {"Author": "Ms.T.Jones", "ReviewID": "R3G5CWW66QFOWK", "Overall": "4.0", "Content": "It over heats an shuts off by it's self alotIt's kid friendly fast light easy to manage adult friendly as wel", "Title": "good buy", "Date": "November 13, 2013"}, {"Author": "pink4tuesday", "ReviewID": "R11ATZJTDPG4CW", "Overall": "5.0", "Content": "It's the perfect size. Fit's nicely in my purse. Great amount of storage space for apps, audio books, podcasts, music and pictures. Intuitive to use.Love the gold-brown color. Very classy.", "Title": "Love my Tab 3!", "Date": "November 13, 2013"}, {"Author": "Steve Haskell", "ReviewID": "R2M0SJ2RODTPDX", "Overall": "5.0", "Content": "I really like my tablet. I'm finding though that there is not a whole lot that I do on my tablet that I can't just do on my phone.", "Title": "cool tablet", "Date": "November 11, 2013"}, {"Author": "Pablo242", "ReviewID": "R1FHCBLOT8J5O9", "Overall": "5.0", "Content": "This tablet is great and it is very fast. It does everything and more as described. I am getting me one next.", "Title": "Gift for the wife...great all around product", "Date": "November 11, 2013"}, {"Author": "tie", "ReviewID": "R2YMZ56KY0921G", "Overall": "5.0", "Content": "This is the third Galaxy Tablet our family has purchased this year as a gift. They're super fun, easy, and portable. We absolutely love them.", "Title": "Love them", "Date": "September 6, 2013"}, {"Author": "Perkonx", "ReviewID": "R15XXHWRJSG0VG", "Overall": "5.0", "Content": "This was a gift for my mother in law and she is thrilled with it. I also like it, it's pretty much fast and have a nice design. I don't know do other users have issues with it when speaking on camera on Skype, but the one that I bought is frosting the picture from time to time. Me personally never would buy an android, I am a Apple fan, but for android lovers it's great.", "Title": "Great gift", "Date": "September 5, 2013"}, {"Author": "Amazon Customer \"Man with Van\"", "ReviewID": "R3SEP2GG71EHBQ", "Overall": "5.0", "Content": "I setup my tab with Messagease, an alternative keyboard, SimpleMind, a mindmapping program (Pro), Wordpress for Android and all my usual web stuff. I use my phone for mobile data so wifi is all I need on the tab.For some people, this may be all you need for a computer. It's wicked portable. You can dash out the door without worrying about grabbing the charger. Available apps are dirt cheap or free.In the two weeks that I've owned the tab it's become my main device. I wanted something cheap and portable. Way better choice than a netbook. Couldn't be happier.", "Title": "My laptop misses me.", "Date": "September 5, 2013"}, {"Author": "Soibibo Tonye Angala", "ReviewID": "RLDFTWC5OHZ6M", "Overall": "4.0", "Content": "the product description doesn't indicate if it's a wifi only version or a 3G vesion or a sim card slot", "Title": "I need a 3G vesion with a sim card slot", "Date": "September 4, 2013"}, {"Author": "Gretchen L.", "ReviewID": "RNSMM2KV13Y53", "Overall": "5.0", "Content": "Compact and easy to use.  It was an excellent buy and came very quickly.  Haven't had any problems whatsoever thus far.  Thank you!", "Title": "love it!", "Date": "September 3, 2013"}, {"Author": "candicelhumphrey", "ReviewID": "R2W5Y67CR6F17D", "Overall": "1.0", "Content": "I purchase this Samsung galaxy 3 in November, since then it freeze and wont turn on or off easily plus Amazon only cover it until Jan 31, 2014. So I would not recommend buying this product.", "Title": "Dont waste your MONEY!!!!", "Date": "March 9, 2014"}, {"Author": "M. Boraz \"beanth\"", "ReviewID": "R3UYL7IRI88Q6F", "Overall": "1.0", "Content": "I should have suspected something was wrong when it seemed like the apps weren't responding and the wifi seemed spotty.  Pages took a long time to load, and apps were sluggish and/or hesitant.Then one day, it just wouldn't take a charge and wouldn't turn on.  We are so disappointed !  While it was working well (for a few weeks at most), we really liked it.  Now we have to figure out what to do with the thing.", "Title": "Worked for just over a month, then just wouldn't turn on.", "Date": "February 25, 2014"}, {"Author": "STEVEN C SNOW", "ReviewID": "RIK74EA43JR3V", "Overall": "4.0", "Content": "I really enjoy this Galaxy Tab 3.  I had played with one that my friend had and it was really cool to see all the features and apps and really just how much its like a computer.  The speed to it is fast and it doesn't freeze up.  It has many different features just by itself as a Tablet.  Then you add apps and you have the world.  This is a nice toy!", "Title": "I like it", "Date": "February 21, 2014"}, {"Author": "Anita Vail", "ReviewID": "RI6VHVZ3PBISX", "Overall": "5.0", "Content": "I got this tablet for my boyfriend for Christmas...He absolutely loves it..Colors are beautiful when streaming an event or watching a movie.", "Title": "A satisfied customer", "Date": "February 18, 2014"}, {"Author": "Rachel Brink", "ReviewID": "R10XX1UHIF2G1S", "Overall": "3.0", "Content": "I have owned several different brands of tablets- the 1st gen 10\" iPad, the original 7\" Google Nexus (ASUS), and now the Samsung Galaxy Tab 3, 7\". I must say that this Samsung tablet is by far the slowest and has the worst battery life of the three. I actually bought this tablet while it was on a ridiculous sale of $129.99, which is a very reasonable price, but I did expect it to either match or exceed the performance of the 1st-gen Nexus. It does not.I owned a Nexus 7 for EXACTLY one year (to the day!) when it fell off the dresser and cracked the digitizer, rendering the touch capabilities useless. Being a computer repair technician for a living, I attempted to replace the digitizer/LCD assembly- which is ridiculously difficult- and ended up frying the motherboard in the process. Because it was so user-unfriendly when it came to service, I didn't want to buy another Nexus, but now I wish I had..... This Note 3 is SOOOOO slow.", "Title": "Very reasonable price if you don't mind the lag....", "Date": "February 18, 2014"}, {"Author": "Hernando Garavito", "ReviewID": "RL4YRZIEKA8NM", "Overall": "5.0", "Content": "My child was witing a long for a tabled. I was waiting too. This tables works great, excellent graphics, good life time batery, and all you can download in the market....", "Title": "Best gift for my 6 years old girls", "Date": "February 18, 2014"}, {"Author": "Sydney Sperry", "ReviewID": "R56Q3GVP7M8KE", "Overall": "3.0", "Content": "i recently bought this device and quickly noticed a few things.first, it has great graphics and sound quality.second, it is equipped with the Google play store.third, its wi-fi connectivity is very shoddy. if you are someone with a need for speed, don't get this device. simple acts such as changing the volume slow it down. it is very laggy. however if you enjoy sitting around for 5 minutes to open or even simply play on your games, this is the device for you.", "Title": "good, but not great.", "Date": "February 17, 2014"}, {"Author": "JTW \"jtw\"", "ReviewID": "R2F22QAXA0KSM8", "Overall": "3.0", "Content": "Expected a much better performance from this tablet.  I have a Galaxy S4 that is awesome and the Galaxy Tab doesn't even compare to the phone.  Not really sure how a cell phone half the size of this tablet is faster and more responsive, but it is.  I am looking to upgrade or go with another brand.", "Title": "Expected better", "Date": "February 17, 2014"}, {"Author": "Amazon Customer", "ReviewID": "ROAB8SOF42OA", "Overall": "3.0", "Content": "I am a Mac user and have a Mac Air. Bought this instead of the Mac Mini because of its small size that is easily pocketable. Had the Mac Mini but not that pocketable with its larger screen. That said the Samsung is usable but very slow. Often have to wait several seconds for response to load a page or close an App. Also some of the Apps aren't as polished as those on the Mac. My Fitbit works fine on the Mac but not on many Android devices including this one. I paid $135. At that price it's okay but wouldn't pay more.", "Title": "Decent Tablet but slow", "Date": "February 14, 2014"}, {"Author": "Fong Her", "ReviewID": "RBVQ683TV2QP9", "Overall": "4.0", "Content": "This was a Christmas present for my wife.  However, she didn't like it and I could return it since she was traveled on job.  I wish the return policy allowed a longer range.", "Title": "Delivery and product is very good.", "Date": "February 9, 2014"}, {"Author": "T. R. Draper", "ReviewID": "R2RJP7YE4Q56I6", "Overall": "3.0", "Content": "this is my first tablet and wanted to see how the DROID system worked so educational as well as fun...I gave ONLY 3 stars cause I really feel it has problems bringing in wifi signals...to be fair hotel and house only experience but other equipment in my house have a much stronger signal than this model pulls in...it works fine in my house and enjoy the bigger screen than phone etc...pictures were fuzzy sometimes...and to be honest I have only had since Christmas so still learning but you asked  ;-)", "Title": "enjoy mini tablet", "Date": "February 6, 2014"}, {"Author": "Beba1973", "ReviewID": "R1JBZ9R2NW1UNF", "Overall": "5.0", "Content": "I got 2 of these for my kids & they are of very good quality, known name-brand & easy to carry. The price is great too. The Android system is wonderful.", "Title": "Worth Buying", "Date": "February 4, 2014"}, {"Author": "Jessica", "ReviewID": "R1C1JU84XA1W9W", "Overall": "5.0", "Content": "I started with a kindle then kindle hd after 6 months of owning the hd  it kept typing on its own after having it sent back 7 times to get a refurbished one losing all my game data each time. I was pretty irritated. Now comes my samsung which saves most of my game data so even if I delete a game it comes back when I reinstall the game. Only thing I dont like is thebapps that can not be removed.", "Title": "I love my samsung", "Date": "February 3, 2014"}, {"Author": "teeganz", "ReviewID": "R1X4DA2YO9MBW", "Overall": "5.0", "Content": "It has performed all that I had expected. Only wished in had memory card that came with it. Other than that awesome product.", "Title": "would buy again", "Date": "February 3, 2014"}, {"Author": "LJE", "ReviewID": "R2NH3MEW69XWXW", "Overall": "4.0", "Content": "Perfect for the average user.  Right size for reading books, checking email, and traversing through the internet using the WiFi.  Graphics are fairly good with adaptable key strokes.  There was issues with internet response, pages flashed as I scrolled through the pages of a website.  May have been the website.", "Title": "Perfect gift", "Date": "February 1, 2014"}, {"Author": "Frankp48094 \"Retired, not a fan of sports, Li...", "ReviewID": "R1EUR7H1RNENI4", "Overall": "5.0", "Content": "I purchased this 7 inch Galaxy 3 T for the ability to take it with me everywhere I go... I also own a 10 inch iPad thatI use daily, but it is difficult to take with me.. I am male, and I do not have pockets to accommodate a 10 inchtablet.. I am not prepared to carry a Murse, or Man Bag.. with my 7 inch tablet, I can stick it in my jacket pocket, oreven in some of my pants pockets... I like it because as long as there is WIFI, I can stay in touch...", "Title": "Great product, great price.", "Date": "January 23, 2014"}, {"Author": "Amazon Customer \"walking girl\"", "ReviewID": "R1OFZVWQAWPITH", "Overall": "1.0", "Content": "I have had the original tablet and the 2 so I thought it would be great to get the 3. I have had it for one month and I am returning it.  It is so slow, lags when you try to get information and sticks when you hit websites.  You can touch the icon over and over and finally it will move to what you want.  It has been very frustrating.  I am going to buy the Nexus 7 2013 instead.", "Title": "A big disappointment", "Date": "December 22, 2013"}, {"Author": "Gwen Roulx", "ReviewID": "RYJEM5IYIR6MS", "Overall": "1.0", "Content": "The charger was missing from the box.  So I'm unable to use it.  I don't want to return it because they are no longer in stock.  But can not get a charger sent to me.  Also no book or warranty information in the box.", "Title": "Missing parts", "Date": "December 22, 2013"}, {"Author": "Josh Hunt", "ReviewID": "RIOQN4A5JB1YX", "Overall": "1.0", "Content": "Had it just over a month when it started randomly restarting. When it comes back on, the date and time is wrong. Sent it off for repair. Same thing. Contacted tech support. They told me to restart it and contact them again if problem persists. My first and last Samsung device. I can understand lemons, we all make mistakes. I just expect better service when a mistake happens.", "Title": "Piece of junk; terrible customer service", "Date": "December 21, 2013"}, {"Author": "victor boyukansky", "ReviewID": "R3RKSY6AGB8RZE", "Overall": "1.0", "Content": "I've been playing with this for about a week and i'm not satisfied. Wifi turns off and on by itself, chat on always fails to work. The tab freezes sometimes, Keyboard doesn't pop up right away when you need to type.The worst part of all I can't download skype on this. While trying to download from google play it gets stuck at 12%. When it does download, it won't install and a message comes up that says Error: unknown error code during application install: \"920\"The only good use I found for it so far is to read the news but that wasn't the reason I bought this for. Waste of money. Need to return!!I own a galaxy s3 and am a fan of Samsung products but this one didn't do it for me.If seller has tips on how to fix this please contact me.", "Title": "Doesn't work properly", "Date": "December 18, 2013"}, {"Author": "Zayad", "ReviewID": "R1L7MM8BZP1F2M", "Overall": "5.0", "Content": "Completely satisfied...Another winner from Samsung. Would recommend it to anyone who wants a quality tab at a reasonable price. I would also definitely recommend getting a quality screen protector, my choice was Ghost Armour, bought invellop protectors which turned out to be complete crap. They are NOT completely clear, makes the screen look grainy & reduces image quality.", "Title": "Absolutely Love It :)))", "Date": "October 6, 2013"}, {"Author": "Janet Ousley", "ReviewID": "R5FV6IXZIHARL", "Overall": "4.0", "Content": "To start off I read every review on every tablet I could find. Tech reviews user reviews etc.before making up my mind. I have a 10\" ipad which  I use for work and have enjoyed it immensly  however as small as it is it still was too cumberson to carry around in purse or tote. My friend purchased a Nexus 7  it was nice just not the bells and whistles I wanted.Long story short went to a local retailer for a hands on comparison...felt the Samsung was for me.  Sorry for those experiencing issues but the Tab 3 is awesome.. was very easy to setup found my home wifi immediately, the speed is all I need  had 3 email accounts set up in 15 min or less.  the screen display is bright and  vivid, the apps are plenty! I reccommend this to anyone who wants a easy enjoyable 7\" tablet experience!", "Title": "Lovi'n My Samsung", "Date": "September 23, 2013"}, {"Author": "Karen", "ReviewID": "R129KMAZU7N0CU", "Overall": "4.0", "Content": "was as great gift, my friend loved it.He wanted it for his wife but kept it for himself .....oh shame", "Title": "Great gift for anyone", "Date": "September 22, 2013"}, {"Author": "Michelle Hames", "ReviewID": "RWXSOT6UOSDF4", "Overall": "5.0", "Content": "Love it!  I mainly use for an e-reader, but I also use it to check e-mail and tool around on the internet and PInterest.  The battery life is great and it charges quickly.  Love the size.  Not too big so it's easy to hold one handed when reading, big enough to have a decent length on a page.", "Title": "Excellent product for the price.", "Date": "September 18, 2013"}, {"Author": "Ns", "ReviewID": "RVXMYBJ1DLCYN", "Overall": "5.0", "Content": "My son and I love this. Works great has enough memory for my things and for my sons games and books. Im very happy I bought this!!!", "Title": "great!", "Date": "September 16, 2013"}, {"Author": "michelle", "ReviewID": "R19I0FIRY07DE4", "Overall": "4.0", "Content": "Is a friendly product, strong, reliable and helpful, sometimes there sre \"software conflics\" with webpages (yahoo for ex) and apps (email app doesn't allow me to load my gmail account) but I can live with this.  Would buy it again if hae the chance", "Title": "so far so good", "Date": "September 11, 2013"}, {"Author": "Ms. Tee", "ReviewID": "R293IPCF2IT9JE", "Overall": "5.0", "Content": "I bought this Samusung Galaxy Tab for my Mom and she says her tablet is her new best friend. Now she barely pays attention when I call her.", "Title": "Bought it for my Mom- SHe loves it", "Date": "September 10, 2013"}, {"Author": "Mama43", "ReviewID": "R2C1I24CQDTPD1", "Overall": "4.0", "Content": "I was hoping the other reviews about picking up the wifi just had to do with other peoples wifi connections, but it is doing the same with mines as well. I have perfect internet at my house, but you have to be close to the router in order to get good signal otherwise is very slow.  Love that you can print from this tab, which is a plus", "Title": "It works okay", "Date": "September 7, 2013"}, {"Author": "Alicia Martinez", "ReviewID": "R2AUHHVL25SFI7", "Overall": "5.0", "Content": "There's no way you can ever go wrong with this Galaxy tablet! I take it everywhere with me and love it.", "Title": "when it comes to Samsung", "Date": "September 6, 2013"}, {"Author": "Nidal Malla Ahmed \"xebato\"", "ReviewID": "R1E0K509MI3606", "Overall": "5.0", "Content": "The quality of this tab is amazing, I loved it, the size is exactly what I need, thanks samsung :)", "Title": "Perfect ..", "Date": "September 5, 2013"}, {"Author": "Daniel G. Saavedra, AIA", "ReviewID": "RWW0G1L48YKXV", "Overall": "1.0", "Content": "I purchased tis for my daughter. She used three or four times, now does not start! does not take a charge! Absolutely horrible!", "Title": "Poor Quality", "Date": "May 26, 2014"}, {"Author": "andrea", "ReviewID": "R48MZ90QHTGIE", "Overall": "3.0", "Content": "THE TABLET I GOT HAS NO \"\"SIM SLOT\"\" AS SHOWN IN VIEDOI DID NOT RECIEVED NO PEN WITH THE ITEM AS SHOWN IN THE VIEDOCAN SOMEBODY EXPLAIN .......WHY!!!!THE TABLETS WORKS VERY GOOD!!!", "Title": "NOT AS SHOWN IN VIEDO", "Date": "May 25, 2014"}, {"Author": "Geraldine", "ReviewID": "R1GW6XIANBG0HT", "Overall": "1.0", "Content": "This seller, itś not good. the product looked great but when I received in My country the tablet was broken on the left side...so that's why I hate it...Because of that this product should be cost less than this price that i just bought! .SO I do NOT RECOMMEND THIS COST!", "Title": "This product came with a side broken", "Date": "May 23, 2014"}, {"Author": "Howard Giuliano", "ReviewID": "R2WC0AO0XG33NW", "Overall": "3.0", "Content": "I never thought this could happen...my battery got really thick and popped the back ... when I went to the service they said it wasn't something uncommon and they had similar cases with some S4s... good thing is that they replaced the product on the spot... this one works.The model is exquisite and once you play with it a little you won't leave it out of your sight soon. Beautiful toy!", "Title": "the battery popped", "Date": "May 16, 2014"}, {"Author": "MaryLaw", "ReviewID": "R6ZARKIGQOI9A", "Overall": "3.0", "Content": "I like this Tab but I much prefer the Tab 3 10\" and the Tab 2 10\". This one seems to get stuck when I search things on Google and sometimes the response time isn't what I'm used to with the bigger devices. It's really convenient for carrying in your bag though. I have a Galaxy Note II phone so this Tab doesn't really add much to my needs. If you don't have any other tablet or similar device, then this would be a great tablet to start with.", "Title": "It's just ok", "Date": "May 15, 2014"}, {"Author": "Buzz'n'Boooo", "ReviewID": "R6EV7XEPWC9GD", "Overall": "5.0", "Content": "In fact, he's addicted to it. He doesn't know what he's doing sometime, but he love the swipe some of the fun app design for kids. Surprisingly, he know exactly where all of the apps button are and how to get to them. He loves the camera and photo gallery and he know how to pull it up. Make sure you have backup enable as he also know how to delete them.", "Title": "My 2 year old love it", "Date": "May 15, 2014"}, {"Author": "drwho", "ReviewID": "R1UCYWXWFDLOSU", "Overall": "1.0", "Content": "currently the Google play store is corrupt with in Android os and as far as what limited research i have done the fix is on you tube which requires rooting the tablet this issue maybe limited to the wifi version which is what i have over all the o.s is faster how ever with the main app store down that limits you to Samsung which n some cases when you find a app it leads you to the Google store with this issue updates are not forth coming  the issue with Google play store is two fold time out error and seemingly long down loads as for the music app Google music player seems to be okay in lies another issue if you place music on the sd card no built in media player will play from it another issue which has more to do with the whole Android echo system know one is in charge as of  late kit kat is being slooowly rolled out by summer a few more devices are being updated i believe this model will be how ever if the play store is still broken no one will be getting updates  who do we user go for help the store like best buy and have one of there geeks tell you it not our fault Samsung how are the going to fix it", "Title": "dont buy play store is broken", "Date": "April 4, 2014"}, {"Author": "Erion Mile", "ReviewID": "R21OMRBP02IL7", "Overall": "3.0", "Content": "Not bad, not good. Something in between. Not as i expected to be. I would not recomend it to buy.", "Title": "Not very good", "Date": "April 3, 2014"}, {"Author": "Delana Guinn", "ReviewID": "R2XSWQ28GNVQZS", "Overall": "3.0", "Content": "A lil slow camera sucks but it gets the job done. I would prefer apple for all. Over android any day", "Title": "Samsung galaxy tab", "Date": "April 1, 2014"}, {"Author": "D. reid \"ms shopalot\"", "ReviewID": "R711LRQUFBF7J", "Overall": "1.0", "Content": "I purchased this tablet for myself in November and it already quit working. I should have returned when I first started using it because I was having trouble with it then but thought it was nothing. Contacted Amazon they sold this item but was told the warranty expired after 90 days and to contact Samsung. I contacted Samsung and they are telling me that the serial number on it is no good so now what do I do with it. I spent $150.00 and can't use it I really am disappointed with Amazon for selling me a piece of crap.", "Title": "Lousy product", "Date": "March 30, 2014"}, {"Author": "Dean Moore", "ReviewID": "RWLWRA335G047", "Overall": "4.0", "Content": "Got this tablet from a Promo from Staples/BBVA Compass for opening a Biz Account.No complaints thus far except one.It is WiFi ONLY .. No Cell data use ..That stings however it is a great tablet.Camera/Video stings badly in comparison to my I Phone 5s", "Title": "Pretty Cool", "Date": "March 27, 2014"}, {"Author": "laporsha fletcher", "ReviewID": "R2KUYHQBZT5UBH", "Overall": "4.0", "Content": "Its alot smaller than I thought it would be and it took forever for them to send it. But im ok with it cant complain but I still have to fix my laptop screen because I cant do as much on here.", "Title": "its ok", "Date": "March 27, 2014"}, {"Author": "Tammy McGee", "ReviewID": "R2BIDPZ06KJQ7T", "Overall": "4.0", "Content": "Just wanted yall to know that I was on the computer for 2hrs. looking at tablets.I did my homework really good, the tablet I ordered was $115.00 and yall charged me $149.00.just wanted yall to be sure and check your price's. So far the samsung 3 tablet is alsome, I'm so excited to finally get one.I did that with Mehag's (amazon)giving me a much  earned credit .THANKS AGAIN FOR YOUR HELP!! YOU ROCK GIRL!!!", "Title": "price's for samsung 3 tablet", "Date": "March 19, 2014"}, {"Author": "Joseph Liou", "ReviewID": "R1J6VCJ1194Y69", "Overall": "3.0", "Content": "I bought this tablet knowing it was refurbished, but it wasn't the box was banged up and also it was at it's original box when refurbished should have been white with 90 day returnpros: great unit to use and lite and easy to carriercons: Keep Rebooting and Core processor is kinda slow, and freezes even with new updates", "Title": "Nice Tablet and Great Purchase", "Date": "March 18, 2014"}, {"Author": "Sherry Ford", "ReviewID": "R2QE5OTBQ28K1D", "Overall": "2.0", "Content": "Pros: portable, looks good in hand, IR remote works well.Cons: no MHL function (the tab 3 8\" and 10\" have MHL function), which means you cannot mirror the screen to TV via a single cable. If I had known this before purchase, I would buy a 8\" instead of 7\".Mine won't charge after 6 months. Contact the Samsung CS, had it repaired with no charge. Through the quality is not great, but their CS works.", "Title": "No MHL function, won't charge after 6 month", "Date": "March 17, 2014"}, {"Author": "ROGER", "ReviewID": "R3SY7OE2RMXCM9", "Overall": "4.0", "Content": "The Samsung is an improvement from my older model as far as the WIFI . The complaint I have with the unit is it lack the auto flash  for the camera.my older model had it. Samsung should have add flash and improve the camera. my complaint is with Samsung not the seller. The seller was great, just as promised in the ad. I love it I replaced the case and remove the plastic from the screen.All the functions work as promised.", "Title": "Samsung Galaxy Tab 3 [ 7-inch, White.", "Date": "March 15, 2014"}, {"Author": "Jermaine Grandison", "ReviewID": "R1ZZP9J4TKBDI4", "Overall": "5.0", "Content": "im finding it more useful to take about instead of backpacking my laptop everywhere i go. One thing though, i cant use it as a gps", "Title": "yay", "Date": "January 24, 2014"}, {"Author": "cplogic", "ReviewID": "R3OJ05Y4DZWPLJ", "Overall": "3.0", "Content": "The first one I ordered would not work at all on WiFi.  Being the standard version (not for a cell phone company) is has no other method of communication.  Returned it.  The second one works, but download is far slower than my Kindle.  Wifi connections seem to be a challenge for the device.  Otherwise, it works great.", "Title": "Good tablet - first was bad", "Date": "January 23, 2014"}, {"Author": "Ryan Case", "ReviewID": "R215IOL6O5F2M", "Overall": "3.0", "Content": "Bought this tablet for my son for Christmas. I have a GS4, rooted with a ton of customization and tasker automation. I wanted to start really making the move to the Android infrastructure away from the IOS infrastructure, and love my GS4, so I went with this tablet.This tablet looks good, feels good in your hand, has a great screen, I love the removable microSD card, but it is just under-powered and lags. I don't think that my 10 year old knows the difference, but if I had bought it for myself I would have returned it for the slow performance. Really too bad.", "Title": "Good Form, Nice Screen, Underpowered.", "Date": "January 23, 2014"}, {"Author": "Brandi", "ReviewID": "RYPTRFB47PX3V", "Overall": "4.0", "Content": "Is a great item and convenient. I will recomended to any one. I want to order another one. The side is perfect.", "Title": "I love it", "Date": "January 22, 2014"}, {"Author": "Hedda Abbott \"LV Mom\"", "ReviewID": "R2SV7ONOLV1WYZ", "Overall": "3.0", "Content": "I have been using this tablet for a number of months.  When on the internet, it will throw me off.  When playing games it will take me back to the desktop.  Sometimes difficult to hit a letter on the keyboard and othertimes you barely have to touch the keyboard for a letter to type.  When on the internet, especially Facebook, the screen will automatically enlarge and when trying to minimize the screen it will go back to the blank page and your have to ask for the site again.  I have tried calling Samsung but have not had any luck,  I will try again this week and hope they can fix the problems with this tablet.", "Title": "Not all it's cracked up to be", "Date": "January 21, 2014"}, {"Author": "R. Perry", "ReviewID": "R2CR99SDVZRKNY", "Overall": "3.0", "Content": "It's a great machine when it's working fine, just like my Galaxy 3 phone but has a tendency to freeze often when playing games and has to be restarted.  It was given to my wife as a gift and she started to complain about the freezing.  When playing Angry Birds it acts kinda whacky.  I know that doesnt say much except that Angry Birds becomes un-playable.  The screen flashes, the birds do not react to the correct finger movements and go off in the opposite direction.  When play slots it will just freeze.  I hoping that Samsung will address this issue and put out a software patch to fix this soon.", "Title": "Seems to Freeze Up Often", "Date": "January 20, 2014"}, {"Author": "cespy", "ReviewID": "R89UBCM56CCXB", "Overall": "2.0", "Content": "The size and screen are great however those pluses are offset by the fact that it does not have enough RAM memory 1 gb).  You cannot uninstall the pre-installed programs which tie up much of the RAM memory. These preinstalled programs don't  leave enough memory to run the programs you really want to.  This leaves it very clunky and slow to move between apps etc.  Also while expandable memory with a micro SD card is a great idea, they do not allow you to install apps to the micro SD card making it much less advantageous. I would not purchase again nor what I recommend to anyone.", "Title": "Reconsider", "Date": "January 12, 2014"}, {"Author": "stellaquery", "ReviewID": "R2C2EUKKAYC9FI", "Overall": "2.0", "Content": "Recently purchased this and a Galaxy s3 mini. USB specs so confusing, do they have mhl or not? Only safe way (??) to purchase Samsung accessories ($$$) and that's questionable. No Samsung for me again.. Also, no adobe flash support.", "Title": "Won't buy Samsung again", "Date": "January 12, 2014"}, {"Author": "Billy1968", "ReviewID": "R2ZDUCNBBAVNM4", "Overall": "5.0", "Content": "I bought one for each of my daughters for Christmas and they are sweet! Very affordable and just plain Samsung quality all the way around.", "Title": "AWESOME TABLET", "Date": "January 9, 2014"}, {"Author": "Davide Chan", "ReviewID": "R8GE5QEPX9FRI", "Overall": "2.0", "Content": "I didn't quite like it.  It's not very intuitive.  It took a few tries to figured everything out.  The micro SD got stuck in the slot.  Unable to inject from the miscro SD slot.  CPU is a little slagish when playing Angry Bird.  I would not buy for myselft...Bought it for 6-year old girls.", "Title": "Samsung Galaxy Tab 3", "Date": "January 9, 2014"}, {"Author": "B. Gapinski", "ReviewID": "R3P3TI9YQKC5AD", "Overall": "1.0", "Content": "Not sure why, but hooked it up to the charger after using for one day.  Wouldnt turn on the next day.  Cant exchange because amazon jacked the price on it now.", "Title": "Died within one day", "Date": "January 7, 2014"}, {"Author": "Tee", "ReviewID": "R3VWYV72SJL8WG", "Overall": "1.0", "Content": "This was a rip off.  It's not touch screen. When you type the screen jumps all oveoverplacplace. This typing error is an example of the poor quality. I am requesting a refund. Dissatisfied and disappointed.", "Title": "SamsungGalaxy tab 3 7inch", "Date": "January 4, 2014"}, {"Author": "kittylover \"MCB\"", "ReviewID": "R2QGGBQRELYCDD", "Overall": "5.0", "Content": "I love all Samsung products. My first was a cell phone(smartphone) then I bought a mp3 player with a 5 inch screen. Love it and wanted something a few inches larger screenwise to watch movies on. Also as I am older I wanted something with larger print. I considered the 10 inch but glad now I got the 7 inch as I can still hold it with one hand. I can't tell you how much I love my new toy. It takes wonderful vidio and photos,no matter what others have said. I am not a professional photo shooter but love a decent picture and this tablet gives you one. It connects easy to Wi Fi on my pc. I love reading as well and it  is great for that. It has alot of other functions which i haven't explored  as of yet. I like the fact that since my phone,mp3 player are samsung as well that I can sync alot of apps with it. Good product for the price.", "Title": "Electronic toys", "Date": "January 4, 2014"}, {"Author": "Debs", "ReviewID": "R23ECXHV4AD803", "Overall": "2.0", "Content": "Hard to use without a stylus.  I ordered a pkg of stylus over two weeks ago and  still have not received. Cannot it is taking so lobg. Secondly, screen gets so streaky. Boght thr clear film to go over screen and now have what looks like bubbles and all full of marks.  Film does not protect screen.Screen is always streaked even with buying screen protector. After putting screen protector on screen is full of bubbles. If I take protector on the film cannot be used again. Already wasted a few. Also waiting 3 weeks for a pkg of stylus.cannot beleive that it is taking so long. Plus each item I ordered had an extra s and handling charge.But do like the tablet. This the first obe I ever had", "Title": "rating", "Date": "January 3, 2014"}, {"Author": "Carolyn Richards", "ReviewID": "R1AHCQIADKR399", "Overall": "4.0", "Content": "I was very satisfied with my Samsung Galaxy Tab 3 until it fell out of my hand and the face shattered.  I think the best improvement that can be made is to make the face shatter proof.This tablet takes beautiful pictures and one of the features that I like the most is that it can control any TV.  On, off and change channels.", "Title": "Mostly Satisfy", "Date": "January 3, 2014"}, {"Author": "Lamarque Lockhart", "ReviewID": "R2UZE2VGICTHER", "Overall": "1.0", "Content": "I am upset actually I ordered the brown/gold and u guys shipped black with no explanation or apology....disappointedThe 2 kids editions were great", "Title": "Dissapointed", "Date": "January 3, 2014"}, {"Author": "Tori", "ReviewID": "ROMSOXZBFL4KY", "Overall": "4.0", "Content": "I love the button layout being physical rather than on screen. It gives it a bigger overall display. Very fast and decent graphics. Handles any game in the app store. Very excellent for web browsing! This is a great buy for the price.", "Title": "Good purchase for price", "Date": "December 27, 2013"}, {"Author": "Some Help", "ReviewID": "RQ8K71BCH8M8I", "Overall": "5.0", "Content": "I've owned it for about 1 week, it is perfect for me to tinker on. The price was worth it. GOOD PRICE. A must have for the pocket. Good Job on this one Samsung.. Can't wait for the 4th generation. So far I have found nothing wrong with this besides the small onboard memory but I can work around it.", "Title": "A Must Have for the Budget.......", "Date": "December 23, 2013"}, {"Author": "Joseph Coscarart", "ReviewID": "RTPWQR3NU9OLD", "Overall": "4.0", "Content": "11 year old purchased.  He likes it for its educational value and gaming.  Someday when we let him spread his wings more, he'll enjoy the communication features.", "Title": "Kid like it", "Date": "December 16, 2013"}, {"Author": "Robert D. El", "ReviewID": "R1WS6A326OXPKL", "Overall": "4.0", "Content": "I purchased this item for another individual because one I purchased last year , I've am enjoying; and I trust she will too.", "Title": "wonderful produce!", "Date": "December 16, 2013"}, {"Author": "Manuel Ramirez", "ReviewID": "R19JCYGTA3Y9PO", "Overall": "5.0", "Content": "I'm very pleased whit this tab, good purchased, I really recommend it, you will not be disappointed, kids love it too.", "Title": "Great Tab very good product", "Date": "December 9, 2013"}, {"Author": "elick", "ReviewID": "R1030BVLJ6ZLP4", "Overall": "5.0", "Content": "Exactly as I expected as my first tablet. The price is affordable and it has been a great way to stay off home pc and laptop.", "Title": "Excellent!", "Date": "December 8, 2013"}, {"Author": "Pelin", "ReviewID": "RPVLRM42PXWR3", "Overall": "3.0", "Content": "It's not like the newest tablets it's good for kids or just to browse the internet or for games. It's nothing to special I would rather spend the money n get something better. It also hurts my eyes", "Title": "You get what you pay for", "Date": "December 5, 2013"}, {"Author": "IRVING", "ReviewID": "RM478XTAURHZ3", "Overall": "5.0", "Content": "perfect, love android, love samsung great quality and support items, i bought a new one again for my daughter and she loves it, lightweight, beautifull brightness, it is slimer than the previous model, highly recommended, good battery life, works great with waze, skype, facebook and other apps.", "Title": "Just love it!, my child loves it too!", "Date": "November 20, 2013"}, {"Author": "Michael E. Mills", "ReviewID": "RAD4BKHUD1ZX6", "Overall": "4.0", "Content": "I have the Samsung 2 Tab, so was expecting a bigger difference than I got. Overall very pleased with both.", "Title": "Samsung tab 3 review", "Date": "November 12, 2013"}, {"Author": "misha", "ReviewID": "R3PEZ7HLOSJKVX", "Overall": "5.0", "Content": "This is my first time using something other than an apple product and I love it.  I have been an iphone and ipad user since they arrived on the scene and have been drinking the cool aid ever since .  My experiment with Samdsung galaxy has been an eye opener.  The Tab 3 7 inch works great for me.  I do recommend getting versions with built in wifi.  This version is great around the house and anywhere wifi is available.  ALL stars from me.  Samsung Galaxy,  out of the park.  M", "Title": "first time droid", "Date": "August 1, 2013"}, {"Author": "L. Cupit", "ReviewID": "R1WZ6G31APIEGZ", "Overall": "1.0", "Content": "I know that my experience with the Samsung Galaxy will not deter most people from buying one.... As for myself I read plenty negatives reviews on the Samsung Galaxy Tab 3 totally ignoring common issues other users had with the product only to purchase it and then discover I would have the same issues that others have expressed.My experience with the Samsung Galaxy Tab 3 did not fair well for many reasons. I decided to purchase the Galaxy Tab 3 after hearing good reviews from friends & family bout the Samsung S4 Smartphone.  First issue that I had with the Galaxy Tab 3 out the box is that it will only pick an extra strong WIFI singnal in the same room as my WIFI router. I just purchased the router in recent months and never had issue with WiFi signals with any of our other WiFi enabled products....Smartphones, Laptop computers, etc. Potential buyers can & should confirm this WiFi signal issue with the Galaxy Tab 3 through a Google search on the topic. The Galaxy Tab 3; as with most computers; does auto-updates on the pre-installed applications and also any apps that I install through the Samsung/Google \"Play Store\". My Galaxy Tab 3 was giving me constant error messages when it would attempt auto updates on the applications. Last count I had 26 error messages....when I would clear them out the errors would cycle again. I tried to do the research online though Samsung and Android help forums on this one issue to no avail though it seems to be a persistant problem for many users with application update error -110.  A big negative for the Samsung Galaxy Tab 3 is no ADOBE FLASH. This is a bad if like my family you have Amazon Prime as you cannot play movies from the website and there is no app for Amazon Prime movies. This is just a personal issue for me, but I had to create a username and password to use most of the applications pre-installed on the Samsung Galaxy Tab 3. This got extremely frustrating for me as I decided to forgo use of some apps because of this.  Also, when I was able to do a search through Yahoo search engine it was common to get a message alert message saying - \"Too many redirects from search engine\".  Needless to say, I will be returning my Samsung Galaxy Tab 3. Obviously others experience with the Galaxy Tab 3 has been good, but satisfaction would depend on what you plan on using it for.", "Title": "Exitement turned to frustration", "Date": "August 4, 2013"}, {"Author": "YUSTHYN RUEDA", "ReviewID": "RJXFJOZDKLWIF", "Overall": "1.0", "Content": "wrong tablet, the tablet just arrived in Venezuela  new but it not works. turns itself off, the tablet will not download apps, amazon and the seller said I can not to accept the return", "Title": "Tablet bad", "Date": "May 18, 2014"}, {"Author": "Wendy", "ReviewID": "R1950HL12M67GZ", "Overall": "1.0", "Content": "Let me just say that this was a gift so I did not order personally.  I received this gift in April of 2013 and it no longer works at first they said that the plug or the charger had a short when I called Samsung directly.  I took it into Best Buy and went to the geek squad to find out that it was neither it is the actually tablet itself.  When I received the gift I immediately ordered a leather case for it and a screen protector.  Then they asked me at Samsung if I dropped it.  because they don't understand why the USB port would be damaged so in order to send it to them there is a $34.99 charge and if the USB port has to be replaced which I already told them it did there are additional charges not to mention I have to pay to ship it and for them to return it which will be billed on my credit card.  The warrantee literally expired 16 days after I reported that it would not turn on and to no avail would they honor taking a look at it.  Just like my handbags if you don’t stand behind your product I won’t purchase it I am 40 years old and take very good care of my things however technology is fickle and even though the warrantee expired two weeks before it broke this product should’ve lasted much longer.  I am not a child throwing it around or dropping it.  I don’t even use it at the gym while working out I have a MP3 player that I have had for 3 years and still going strong by Sony.  Needless to say I am replacing this because I do like the tablets and will go with Google Nexus going forward.  Very disappointed yet again with Mr. Samsung.  Hope this review helps the next person purchasing it for themselves or a gift to someone else.", "Title": "not a fan of samsung from way back and still standing", "Date": "May 7, 2014"}, {"Author": "Amazon Customer \"reverendlinux\"", "ReviewID": "R1JMYWVX189FTS", "Overall": "3.0", "Content": "I bought this tablet for two reasons. First as a replacement for my aging Kindle. I loved it, but it was on it's last leg. I wanted something I could easily tote around but could also do more than just read books on. Second, and more importantly, I'm in the IT field and wanted to get some experience with the Android platform. After 60 days of use, here's what I've come to learn about these devices.PROS:- Decent weight. The tablet plus the simple Belkin cover are about the same as a Kindle Fire; easy to hold and use as an e-reader.- Excellent design. The tablet overall has a good layout with buttons in the right place (versus in the way). It looks good and the components used seem to be of excellent quality. Although the casing is plastic, it's thick and doesn't flex.- Clear screen. Some reviews I saw marked this tablet down for having a screen resolution that was lower than competitors and not as sharp. Really, in comparison to other Android tablets I can't see a difference. Streaming movies look to be DVD quality with only slight blurring during action scenes. Colors are sharp. Print is easily legible.- Good performance. On occasion I get lags starting up an application or during use. But overall performance is responsive. I've only experienced a couple of application crashes.- Battery life.  Without the wifi on, the battery goes about a week.  With the wifi on, about two days.  Not stellar, but easy to live with.CONS:- NO ANDROID UPDATES. This is my number one gripe. The thing came with Android 4.1.2 while 4.4.2 was released nearly 5 months ago. I would expect slow or no updates from the bottom feeder tablets like Polaroids. But when you shell out $179 for a product from a company that's going toe-to-toe with king of the hill Apple, you expect a bit more in the way of updates.- Shiny screen. The screen is slick and super shiny. It shows finger prints really easy and is hard to clean. Glare can be an issue sometimes.- Screen responsiveness. The touch screen takes more pressure than it should requiring more of a stab than a tap.- Weak WiFi. The tablet can usually manage only about 3/4 signal strength unless I'm within 15 feet of my wifi router. Although I haven't found any dead spots in my 2-story house, the signal gets weak really fast as you move away from the router.- Camera. Although the rear camera is a decent 3MP, the front camera is pretty weak at 1.3MP.  Additionally, the cameras have no flash.- Crapware.  There's a ton of Samsung apps that I'll never use and no way to delete them (short of rooting it which most folks probably aren't going to do).In summary, this is a good tablet for everyday use and at a reasonable price.  It's met my original two goals of being a Kindle replacement and getting to learn Android. However, in comparison to my daughter's iPad Mini...well, there really isn't any comparison. The Apple (among other things) is more responsive, made of better materials, is regularly updated and has a better wifi range.  In the end, if you're on a budget, go with the Samsung.  If you're not, go with the Apple.", "Title": "Good Enough, But No iPad", "Date": "May 1, 2014"}, {"Author": "Cen", "ReviewID": "RSZD1K7R653U3", "Overall": "1.0", "Content": "Having owned each generation of galaxy, this iteration is not up to par.  Don't let the trusted name of Samsung or Galaxy fool you into thinking that this is a similar product.Samsung has made it next to impossible to actually use an external memory card.  Google \"move apps to sd card tab 3\" and you will discover what many people have discovered. Functionally you have about 4gigs to work with for apps after the system usage.  With very restricted ability to moving apps to a card, that 4 gigs goes fast.The main camera is garbage.  No flash either.  They should have just skipped it and made the front facing camera better.The system is clunky and slow for today's apps.Samsung's separate account is annoying and useless.  It barges in to update or relog.  Nobody uses it, nobody cares about it, it's intrusive bloat.  Users are at the saturation point of user accounts across the tech world.We have one for a child and one for an adult.  With the amount of faults we found on each, we would have been better off getting non/Samsung tabs.  There are cheaper, faster, bigger it there.  The Samsung brand should not influence you on this one, since it is a misfit gutted option.", "Title": "get something else", "Date": "April 7, 2014"}, {"Author": "subrata biswas", "ReviewID": "R2EMZFLNIWBFXG", "Overall": "1.0", "Content": "It's too slow and hangs frequently.I regret for buying it.  The gravity sensor does not work well.I do not recommend to buy it.", "Title": "Worst tab", "Date": "March 26, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3VSNR4AGQVLKB", "Overall": "1.0", "Content": "The system lags, it cuts off for no reason and just last week it completely shut off and won't turn back on. I've only had it about a month. Im returning it!", "Title": "Awful experience, system is laggy", "Date": "March 19, 2014"}, {"Author": "Krystal Newey", "ReviewID": "R1BEZW3P71NRDK", "Overall": "1.0", "Content": "Processing affected the delivery date, which we were told it wouldn't do. Tablet would charge and turn on, but turned off as soon as you tried to do anything.", "Title": "Broken", "Date": "March 2, 2014"}, {"Author": "pluto.45", "ReviewID": "R2WHWOFTQC3706", "Overall": "1.0", "Content": "I got this as a xmas gift. I'm disappointed in it. It's slow and crammed with google crap that I won't use. I can't eve totally delete thethings I don't and won't use. I shouldn't be ungrateful but, I would have asked for something else if asked before hand.This is not worth the money. I wouldn't suggest to anyone, buying this tablet.", "Title": "Bummed out !!!", "Date": "March 2, 2014"}, {"Author": "Zhou B.", "ReviewID": "RGY95Q43ED6AD", "Overall": "5.0", "Content": "Beautiful appearance, the price of the tunnel, the black five before buy, cheaper to $50, look at the video, play games can also, better lower-end tablet", "Title": "great tab", "Date": "March 2, 2014"}, {"Author": "Brian D. Henry", "ReviewID": "RCOMVIW78G0Y2", "Overall": "1.0", "Content": "Apps crash on a regular basis and the lock screen comes on and stays on until the battery dies. I should have paid more and bought an iPad-mini.", "Title": "I hate this piece of junk!", "Date": "February 25, 2014"}, {"Author": "Mike James", "ReviewID": "R3IAV5F1E3CRGL", "Overall": "1.0", "Content": "I have tried everything to get it to do anything and it will not. My gf has an iPad and it works great here as well as my phone, her phone, and her three girls's iPhones. The only device in the house that will not get online is the galaxy I wasted my money on.", "Title": "I had it a week and it quit working. Now I have a $200 paper weight.", "Date": "February 23, 2014"}, {"Author": "Jose Frank Sosa Diaz \"Achilles\"", "ReviewID": "RM34EFZ4JTCT9", "Overall": "1.0", "Content": "For the average 7 inch tablet, this screen is very poorly, pixels are clearly visible and it has tons of lagging, not satisfied at all, much better deal with the nexus 7 which I own and has an exceptional screen! I only bought this as a gift because it was very cheap, but even thought,  it expensive for the mediocre screen you receive and the mediocre processor which produces tons and tons of lagging", "Title": "mediocre screen and processor", "Date": "February 23, 2014"}, {"Author": "Corey shaud", "ReviewID": "R1OBL13N217UCE", "Overall": "1.0", "Content": "I had two of these, I am sure they are great for just searching the web and sending email. The real problem is when you actually want to use them for work or if you play a game that relies on ram. The first tab 3 I had would turn it self on and off and kept trying to update to 4.3 and could not.The second tab 3 stopped charging and would not turn on at all. I will not be purchasing any more of these. I am going to go with something that has better ram and more processing power, nexus 7.", "Title": "Trouble from day one", "Date": "February 17, 2014"}, {"Author": "tudy wiley", "ReviewID": "RYIPJQOHCGN5Q", "Overall": "5.0", "Content": "I love my galaxy 4 phone so I wanted to try thw ravlet I already have an ipad 2 but was looking for a smaller one to rake in my purse for dres appts greT tablet an price I got it for awesome", "Title": "samsung galaxy tablet", "Date": "December 21, 2013"}, {"Author": "shermin", "ReviewID": "R399R3E24P76KW", "Overall": "4.0", "Content": "It was a gift to my nephew for his birthday and he was very pleased. So far there is no complaint. The product has met his expectations.", "Title": "Satisfactory", "Date": "December 21, 2013"}, {"Author": "Hyacinth", "ReviewID": "R2ONSXBA9MESVO", "Overall": "5.0", "Content": "I Just received it from shippers have not used it yet it is an xmas gift so will be able to best asses after", "Title": "seems to be ok", "Date": "December 19, 2013"}, {"Author": "Princess J", "ReviewID": "R2HVIDRRT1AICO", "Overall": "5.0", "Content": "This tab was delivered on time and so far i'm enjoying it. Only thing is that it does not have a sim card slot as i expected.", "Title": "Luving my tab", "Date": "December 19, 2013"}, {"Author": "Stacee", "ReviewID": "R2B6THAZ37IJ82", "Overall": "4.0", "Content": "Since it is a gift I have not had a chance to use it but it's worth the price paid", "Title": "cool", "Date": "December 14, 2013"}, {"Author": "WjFost11", "ReviewID": "R3CQHL1K2V4DWV", "Overall": "4.0", "Content": "Does everything I need in a tablet...alot of people say nexus 7 is superior ..but who cares...this is what I chose to purchase and I'm very satisfied with my purchase..don't listen to the negative talk...unless your like a super geeky nerd who loves what the massed like maybe you should roll with the nexus 7...but my Galaxy Tab 3 does everything I need, so take THAT...LOL", "Title": "Love it, just an all around great tablet...", "Date": "August 22, 2013"}, {"Author": "Allolo", "ReviewID": "R21NXOJC5N3XZ3", "Overall": "4.0", "Content": "Very nice thank you very much for your good and your credibility will be a pleasure to deal with you again <3", "Title": "Very nice", "Date": "August 16, 2013"}, {"Author": "Dollhunter \"Diana\"", "ReviewID": "R11FK6QNA1BY66", "Overall": "5.0", "Content": "I've just had mine for a couple of days, but so far, so good.  I did find a User's manual online, and that's much easier to read than the one that came in the box. I don't think anyone has mentioned that before.  I have a big tablet, and use it mainly for reading and playing games, but it is a little heavy for my purse, so now I am brushing up on things I just never bothered to learn because I was using the first for different things.  I am having a little trouble getting Prime to recognize that I have two, but I probably missed something in the directions..  One comment.  I didn't think I wanted white, but was confused by the color gold-brown.  I still am confused.  To me it looks black.", "Title": "So far, so good.", "Date": "August 4, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1J4CEMRSTT6I9", "Overall": "5.0", "Content": "I love my Tab 3! Great price and super fast delivery!  I love the price of the Tab 3 compared to the IPad! Try it out, I  guarantee  you'll enjoy it!", "Title": "Awesome product and price!", "Date": "August 3, 2013"}, {"Author": "yelitza rodriguez", "ReviewID": "R1L2SECLYY62Z1", "Overall": "5.0", "Content": "The price is exactly what you pay for.. Very useful and practice. Is not to big just big enough to carry everywhere.", "Title": "Right price for the tab.", "Date": "August 3, 2013"}, {"Author": "Anthony Phillips", "ReviewID": "R1YCEY41CJOCU6", "Overall": "5.0", "Content": "Fantastic product.  Works as advertised. Hane recommended this to my workmates.  Will also recommend it to my personal friends. Thanks", "Title": "Excellent", "Date": "August 2, 2013"}, {"Author": "June", "ReviewID": "RD04A6JP36JAM", "Overall": "5.0", "Content": "it is fast. no lagging at all and the screen has very good quality to watch those HD movies and shows.jellybean is well known fast OS.samsung hardwares inside,i bought this for my gf and she loves it.but the camera has low megapixel but what do you expect when you spend only $200 for a tablet?if you want to compare this 200 bucks device to the high-end tablets, it proves us what type of consumer you are.but i can tell this one fact, this device does definitely better job worth $200.", "Title": "What can you get and expect with $200?", "Date": "July 18, 2013"}, {"Author": "Ambercool", "ReviewID": "R1F7VQ54NFZPHF", "Overall": "3.0", "Content": "I wanted to get this because it can support a 64gb micro-sd card in a small form factor.  I wanted to use WAV and/or FLAC formats for my music with this device.  It takes a few seconds just to load the player when my 1st generation iPad and iPhone 5s loads instantly.  The music loads fine after the player is up, but this is too long for this kind of device.  So I thought it was the player and music caching so I tried the internet.Launching the internet browser and other apps gave me the same result.  I really wanted to like this small tablet, but it's just an under performer.  Even my old HTC EVO phone loads faster than this.If you like speed don't get this.  If you want something fast or at least as fast as the technology available from its competitors than this is not for you.I'm going to return this soon.", "Title": "Not What I Expected for MUSIC", "Date": "July 20, 2013"}, {"Author": "justjen9012", "ReviewID": "R3FTIE4IC1XNXO", "Overall": "1.0", "Content": "Wasn't worth the money. It is slow and \"glichy\"and it only works with WiFi which is my fault for not reading the details better but it still is very slow and doesn't respond well to opening apps.", "Title": "Not what I was expecting m", "Date": "May 30, 2014"}, {"Author": "Shawn F Reynolds", "ReviewID": "R1IAJS7JOOZ9PS", "Overall": "3.0", "Content": "My Samsung was delivered timely, packaged to arrive safely.  The product itself isn't very good however.  There are 64 bloatware applications that can't be removed.  That is very frustrating and ensures that my next tablet will not be a Samsung.", "Title": "Disappointed by bloatware", "Date": "May 15, 2014"}, {"Author": "Kerry", "ReviewID": "RJ0OGEH4B8VVW", "Overall": "4.0", "Content": "It works well and is a nice tablet, but I actually liked the Tab2 much better.  Sometimes changes made aren't the best.", "Title": "Nice tablet", "Date": "November 30, 2013"}, {"Author": "Rita Nones", "ReviewID": "RVMVCI75KMFDX", "Overall": "4.0", "Content": "i received it yesterday its for my boyfriend's bday present its okay but its kinda slow i mean we have a good internet connection but its slow.", "Title": "uhh.so-so", "Date": "August 6, 2013"}, {"Author": "Nello O. Mehl \"Online instructor\"", "ReviewID": "R1D25Q19AEWHVT", "Overall": "3.0", "Content": "I returned it  It is too smooth and hard to handle with big hands. It is too sensitive to touch. Difficult to find different type of cases let's say similiar to iPad.  I have used a Tab 2 before and I loved it but didn't have the same experience with this one.They are fantastic about refunding money.  Quick. Accurate and overall experience GREAT", "Title": "Didn't like it so I returned it.", "Date": "November 25, 2013"}, {"Author": "Xavier Roberts", "ReviewID": "RJZYIFAUIOJP7", "Overall": "1.0", "Content": "terriable do not buy the wifi doesn't work it moves slow please do not by this terrible item. noo good!!", "Title": "Dont spend your money", "Date": "September 21, 2013"}, {"Author": "AMAZON", "ReviewID": "R312MICZM6V0MV", "Overall": "3.0", "Content": "The site is advertising a 300 dollar credit towards services, THERE IS NOTHING INCLUDED IN THE PACKAGE, NO EMAIL, NO DIRECTIONS HOW TO GET THIS. COSTCO IS SELLING THESE FOR 179 WITH A CASE. I WILL BE RETURNIBG THIS ONE.", "Title": "false advertising by Amazon", "Date": "August 3, 2013"}, {"Author": "jinhui wu", "ReviewID": "R2D3O3BZDCNLT2", "Overall": "2.0", "Content": "my note 2 is better than this tab  ..so slow and crash few times .nothing so special about this product", "Title": "slow..", "Date": "July 30, 2013"}, {"Author": "wuSchu", "ReviewID": "R2ZF6JOBO5IDXG", "Overall": "1.0", "Content": "Completely fried in a week and a half. Only had 1 app and 2 widgets on it. Was using it to display my photographs to customers. Fried... Seriously... Fried! Non responsive, not turning on, using it as a paper weight FRIED!!!! So... 1 star it is. What a POS.", "Title": "Fried after a week and a half", "Date": "August 24, 2013"}, {"Author": "Mohammed", "ReviewID": "R3FV8GL8U27QX", "Overall": "1.0", "Content": "He left it on the door steps. And it could be stolen if i didnt pay atention i hope that wouled change", "Title": "Bad shepment", "Date": "May 27, 2014"}, {"Author": "djm1976", "ReviewID": "RAOA53C0Z4QK8", "Overall": "1.0", "Content": "I bought mine at Fry's electronics for the every day price of  $160. As far as the tablet goes it's just alright. Deinitely not what I expected from a Galaxy product at all. I would save your $ if I were you. Not Samsung's best product by a long shot.", "Title": "Way overpriced!", "Date": "February 10, 2014"}, {"Author": "DianaD \"DianaD\"", "ReviewID": "RUP9ATALPWCGH", "Overall": "2.0", "Content": "My 21 year old grandson thought I was crazy when I returned it.  He loved it!  He said I am missing out on the whole Internet \"revolution\".  It was perfect for him!  I am going to order the Kindle Fire HDX.  It sounds perfect for me!", "Title": "This item turned out to be more than I wanted.", "Date": "January 7, 2014"}, {"Author": "abagels", "ReviewID": "R20K5RRBH5S9TB", "Overall": "1.0", "Content": "Don't waste your money!!! It's a cheap knock off of the iPad mini. I had this for one week and the charger port broke. Battery life is short. You will rip threw a battery just surfing the web. It's so slow loading pictures and or videos. You get what you pay for, cheep junk.", "Title": "You get what you pay for", "Date": "December 15, 2013"}, {"Author": "Wait4Retire \"Wait4Retire\"", "ReviewID": "R25OVKJRWE0XTQ", "Overall": "3.0", "Content": "Quick and nice, but no handwriting function. Some games are not available, I was told to download handwriting apps, I did and tried 2 apps, none worked. Returned.", "Title": "No handwriting.", "Date": "December 7, 2013"}, {"Author": "Joanna R Snow", "ReviewID": "RNS4NT9VHE8WB", "Overall": "5.0", "Content": "I chose this rating because it is so cool. Wow like so cool I really mean that you know right.", "Title": "It is so Cool.", "Date": "October 16, 2013"}, {"Author": "carrie fowler", "ReviewID": "R1S4ZTA74IP5AC", "Overall": "1.0", "Content": "I have had this tablet for literally 2 days and I hate it. It looks great and is a nice size, however, it is so slow! I will click an app and the tablet doesn't even recognize my touch and when it does it takes at least 5 seconds to respond. Every single app I have downloaded (a whopping total of 5) are slow and don't load. I am pretty sure it's not the app itself since these apps work just fine on my Galaxy S3. I bought this tablet because I love my phone, but it is obvious that Samsung dropped the ball on this tablet. I definitely do NOT recommend and am returning it asap!", "Title": "Do not buy this", "Date": "December 6, 2013"}, {"Author": "Mauricio Jordan", "ReviewID": "R1KHF1CJRRGWD5", "Overall": "2.0", "Content": "I tested the Samsung Tab2 WIFI only(sent by Samsung Sales Dept to do a product review in my Blog)The listed specs by Samsung seem to \"inflate\" the actual performance of the 7\" Tab2( I have not tested the Tab3,or the 8\" or 10\" models),for starters the default 8G becomes almost 4.7 G of internal memory,because of the operating system and default apps using a big \"chunk\" of memory.It might be fine if you don't go crazy downloading myriad apps,but very limited for serious use.A minor disappointment is the front 1.3 pixel camera,and even the 3.5 pixel rear camera,grainy photos and \"jaggy\"videos. Decent but unsharp screen resolution,and bad finish=\"greenish\" cast on screen surface and bad colors at times,plus touch-screen retains finger print marks and looks \"messy\". Buy an Apple Ipad instead,if you want to brag about a tablet! Worst,battery life is disappointing.", "Title": "Not the best of Tablets!", "Date": "October 14, 2013"}, {"Author": "Beth", "ReviewID": "R3E0K5Q2OSQZG", "Overall": "3.0", "Content": "i was disappointed to discover that you have to purchase the Tablet directly from Verizon to have it compatible with cell phone data plan.  I wanted this tablet to be not only wifi capable, but also useful when on the road and no access to wifi.  I wanted it then to be used via cell phone data plan.  unfortunately the sales people at Verizon were NOT helpful about this.  They wanted to offer me $35 for my new tablet to trade in for a Verizon capable tablet which cost over $200.  Wish someone would have pointed out prior to purchase.  But as far as using it - I do love that feature!  User friendly, light weight and easy to carry and manage.  Nice graphics and taking pictures is a breeze.  Quality seems good.", "Title": "love the easiness of it, don't care for the limitations of use", "Date": "December 2, 2013"}, {"Author": "paul \"50 year old woodworker\"", "ReviewID": "R3P8890C9XQVTU", "Overall": "3.0", "Content": "good utility tablet. I got mine from sprint for $49, and a data plan of 2gb for $20 and I like it. But if I were to pay the $150 or so, I would have chosen the Nexus 7 for its better screen resoulation, camera, and operation system.The Samsung is a good tablet and I'm happy with it for what I use it for, but if your looking for latest and greatest this isn't it.", "Title": "good utility tablet, but behind others", "Date": "November 30, 2013"}, {"Author": "Balaji Selvaraju", "ReviewID": "R1GDV5LO0X431M", "Overall": "3.0", "Content": "It lacks one of the basic feature in the display setting ->Touch key light duration:Which means the menu and the Back keys will not have lighting option or will not glow. so you can understand the difficulty in working with the device in no/low lights.Not sure if Samsung will take this defect call and come up with upgrades to rectify this defect with millions of cusotmers who bought Galaxy tab3 7.0 around the world?", "Title": "It's Ok for the cost, compact and handy", "Date": "July 18, 2013"}, {"Author": "MobileAppProgrammerMan", "ReviewID": "R33A2MLWH5U2OO", "Overall": "2.0", "Content": "I am returning this and getting the 8.0 inch model--the performance of the 7.0 is just too slow and sometimes it will flicker and redraw the screen for no apparent reason. Can't scroll smoothly or load web pages in a reasonable amount of time. Compared to an iPad mini, I expected the performance to be a bit slower but not this bad. The iPad is worlds better than this. Samsung has obviously done everything possible to make this inexpensive and unfortunately, it shows. It might be ok for some people but not for my needs.", "Title": "Choppy performance", "Date": "July 12, 2013"}, {"Author": "Santiago R. Castillo", "ReviewID": "RK60FUTSXG1WE", "Overall": "1.0", "Content": "The galaxy tab 3 is like a gameboy, buy an ipad mini will be a better option. Samsung is for dummies.", "Title": "Ipad is expensive, but too much better.", "Date": "May 30, 2014"}, {"Author": "Suzie-Ana Boyne", "ReviewID": "R159Y60FO00OUF", "Overall": "1.0", "Content": "I did not get the Samsung Tab with sim card as listed on the site and as I had ordered!!!", "Title": "Disappointed", "Date": "February 10, 2014"}, {"Author": "nefeteri", "ReviewID": "R2GAY0A75O3TDE", "Overall": "1.0", "Content": "phone worked for one month and then shut down.....waste of my hard earned money and the sad part is my return window expired", "Title": "DO NOT BUY FROM THIS SELLER", "Date": "February 5, 2014"}, {"Author": "Ian Pulley", "ReviewID": "R2XWPRU2DTU8OL", "Overall": "1.0", "Content": "Terribly slow and terribly clunky interface. Not worth it. Had it less than 3 hours and hated it. Just buy an apple product (this coming from a dyed in the wool windows user).", "Title": "Slow and clunky", "Date": "December 12, 2013"}, {"Author": "katharina", "ReviewID": "RXYG18O10Y4NY", "Overall": "1.0", "Content": "I am so fed up of purchasing stuff for amazon and it doesn't work! Plus paying for prime! Bought this for my kid and it less than a week it froze!", "Title": "Don't waste your money", "Date": "February 12, 2014"}, {"Author": "Pudda22", "ReviewID": "R1QTXX5RT6YGE6", "Overall": "5.0", "Content": "I brought this for My son he's been asking for this forever now. I told him to get award like this I need good grades & I received his report card wednesday & the boy got honor roll Although he doesn't get nothing less than honor roll I wanted to reward him for his good grades", "Title": "best gift", "Date": "December 6, 2013"}, {"Author": "randi130", "ReviewID": "RJIOPF6AAJ9B4", "Overall": "3.0", "Content": "Hi!Very difficult to use. No manual. Like apple product betterVery slow wifi. Apps had to google play to downloadDo not find this user friendly. Everything sync to a google accountSticking with apple in future. Refund? Or exchange available?", "Title": "Not like apple product", "Date": "October 6, 2013"}, {"Author": "Lipscomb student", "ReviewID": "R2KH516R790WR5", "Overall": "5.0", "Content": "Hi!I am 3rd year, stressed out pharmacy student and I need to have quick access to lots of tables/charts/detailed decision trees based on guidelines that fits in my white coat pocket.Right now all my text books are on Access Pharmacy or APhA Library, but Amazon caries all the textbooks we use or I might need in the near future as a resident. My questions are these:1. Do I need Kindle Fire HD or Samsung Galaxy 3 Tab or should I wait until Christmas?2. Can I download a textbook/reference, save it as an app and have access to it whenever I need it without internet connection?3. What kind of screen size will fit in my regular white coat pocket? Thank you so much!", "Title": "Pharmacy student/future resident needs help: Kindle Fire HD or Smasung Galaxy Tab 3", "Date": "July 29, 2013"}, {"Author": "Josh Hudson", "ReviewID": "R2RDQXN2503JA6", "Overall": "2.0", "Content": "I purchased this on Black Friday for $149.99 and will be returning it soon. This is a horrible tablet. I tried to play a game on it and it was moving in slow motion, the touch screen is not responsive, and the screen is mediocre. Luckily i was able to pick up the last 8gb Nook HD for $79.99 at B&N.; I ran the same apps on the Nook and it was SO much faster and ran sooo smooth. Do yourself a favor and look elsewhere.", "Title": "Disapointing tablet", "Date": "December 2, 2013"}, {"Author": "Mary.J", "ReviewID": "R35MGYPUKUOTX6", "Overall": "3.0", "Content": "Does not support adobe flash. This was a big problem for me since I Iake online courses and needed it for that soul purpose. Ah I will keep it anyways and it will be my new toy.", "Title": "No Adobe Flash", "Date": "November 23, 2013"}, {"Author": "William Orasma", "ReviewID": "R2EMAU6NDSLM73", "Overall": "2.0", "Content": "hello one of the tablets is defective, I can not handle well the screen is very hard because I wanted to know the shipping address for me to replenish one is in good condition", "Title": "I do not agree", "Date": "February 4, 2014"}, {"Author": "Cesar Gomez", "ReviewID": "R1G29YT0SQHFN4", "Overall": "1.0", "Content": "Way to slow tablet. Not meet my criteria I need something faster something different may be a beer version or may be a tab note", "Title": "Need a newer version, so it cut be faster that this on", "Date": "January 18, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2RYXJREC0OKJH", "Overall": "1.0", "Content": "IT WAS NOT WHAT I EXPECTED, I NEED A TAB WITH SIM CARD COMPATIBILITY.KEEP THE GOOD WORK FOREVER. I REST MY CASE", "Title": "VERY POOR THAN EXPECTED", "Date": "March 11, 2014"}, {"Author": "Marilyn A. Chorman", "ReviewID": "R7NULNHCVIKDB", "Overall": "1.0", "Content": "It's not Amazon's fault, but I never received my Samsung Galaxy Tab 3. The vendor Data Vision is conducting an investigation with Federal Express to find out what happened. FedEx said it was delivered to me but I never got it.  Therefore, I cannot provide Amazon with a review.  I really hope we get a replacement and that we can provide you with a great review.  Until then, we wait...", "Title": "NEVER RECEIVED MY SAMSUNG GALAXY TAB3", "Date": "January 20, 2014"}, {"Author": "D. M. Adam", "ReviewID": "R3J1ZJET8IJ2QK", "Overall": "1.0", "Content": "I'm a Mac person. iPhone, iPad, iMac, Macbook.  I'm taking a class in cloud computing and we are working on Google drive.  I thought I'd buy an android device.  I thought android would be more compatible with all the google apps.This Tab3 is really clunky.  I found it s-l-o-w.  While supposedly running a 1.2gb processor and 8gb flash memory and 1gb memory.  It became really annoying while trying to open an app, then it would automatically close.I tried to load some music on it.  I found on Youtube, a suggestion to connect it as an external drive than upload.  I unloaded one album, but could never find the music.  Another suggestion was to download an app called 'Kies' -  Kies asks if I wanted ALL my music, and i checked 'NO' I then downloaded one album, when I opened my Galaxy Tab3, I couldn't find the music, but i did find my entire iPhoto library.Trying to delete my photos was impossible, unless I deleted them one at a time.  I had over 4,000 photos uploaded.Finally getting so frustrated, I wiped it, reset to original condition, repacked it and sent it back to Amazon.", "Title": "I tried, Lord knows I tried.", "Date": "December 8, 2013"}, {"Author": "Kyle Ryan", "ReviewID": "R160Z4FIXVRAOV", "Overall": "1.0", "Content": "DON'T BUY UNLESS YOU ALSO INTEND TO BUY ALL PRINTERS ETC... FROM SAMSUNG (Forever).  Samsung, decided to prevent you from printing from Samsung Devices to anything but a Samsung printer.  I assumed this was a software glitch but Samsung verified that they made the phones that way.  Of course I may want to buy that HP PRinter that can print from everything (including all android devices) except Samsung.  This is simply Samsung deciding to inconvenience their customers (in my case former customer) in the hopes that they will buy their other more expensive printers (let alone they aren't even available near me).  Besides, why do I want to be forced to use Samsung products for everything in the future regardless of the value that they provide, the wireless printer Samsung won't print to is an HP and it prints from my HP computer, my microsoft computer and my Apple IPAD.", "Title": "Used to be an Samsung Fan - No More", "Date": "November 29, 2013"}], "ProductInfo": {"Price": "$199.99", "ProductID": "B00D02AGU4", "Features": "Android 4.1.2 Jelly Bean OS, 1.2 GHz dual-core processor\n8 GB Flash Memory, 1 GB RAM Memory\nStore photos, videos, music, and more with up to 64GB of memory available through a microSD slot and 50GB of free Dropbox storage\nCamera: 3MP rear-facing, 1.3MP front-facing\nPre-loaded with free content including Hulu Plus membership, Google Play credit and Boingo Wi-Fi Access", "ImgURL": "http://ecx.images-amazon.com/images/I/41z3ffC2XwL._SY300_.jpg", "Name": "Samsung Galaxy Tab 3 (7-Inch, White) 2013 Model"}}