{"Reviews": [{"Title": "Trying it out for the little one", "Author": "Candice", "ReviewID": "R29FDFPN4V3ZGK", "Overall": "5.0", "Content": "We bought this for our 7 year old son for Christmas. Now, he can not rate on it yet, but my husband and I love it -we have been playing on it to make sure everything works on it. It is a wonder tablet, works great and fast - there is practically no lag time, which is a first for us. We love it, and will hate to have to give it to him, but I know that he is going to be so excited and beside himself come Christmas morning! I like the fact that you can get them in different colors - better to personal our childrens personality", "Date": "September 19, 2013"}, {"Title": "Wonderful tablet for Gamer Apps", "Author": "Regina A.", "ReviewID": "R2MOK8PMD3J6YW", "Overall": "5.0", "Content": "I purchased this tablet for my son.  It works fabulous for the avid app gamer and at an unbeatable price.", "Date": "October 22, 2013"}, {"Title": "great!!!", "Author": "Becki", "ReviewID": "R1HII7K0P1R6KK", "Overall": "5.0", "Content": "My previous tablet had a accident with a puddle,  found this one, received it two days earlier than expected and its great!!!!  Fast and very easy to nagivate!", "Date": "October 21, 2013"}, {"Title": "Excellent Tablet", "Author": "rose", "ReviewID": "R18K3WO1YBQ4D9", "Overall": "5.0", "Content": "The tablet was boxed with everything in it. I charged it up, which tablet was already charged.  Tablet comes up right away, easy to get into Apps.  Great condition, brand new.Screen For myself, screen is a good size, able to see everything. No problems at all.  I ordered one without the Skype Video Calling and Netflix Movies. They were more than happy to send me out a new one immediately, no problems, no questions.  I will always do business with Amazon and Wholesale Direct 88.  I am one very, very happy buyer.  I always wanted a tablet and finally have one that I could afford.Thank you.", "Date": "October 28, 2013"}, {"Title": "Great tablet for great price!", "Author": "rvannoy", "ReviewID": "R2GVP77D11J2DC", "Overall": "5.0", "Content": "Purchased as a gift for my 9 yr old granddaughter.  I know she will love it.  Very user friendly.  Can't wait to see her face.", "Date": "October 21, 2013"}, {"Title": "Unbelievable fast shipping!", "Author": "Isadora Choute", "ReviewID": "R24TQ47INV43HU", "Overall": "5.0", "Content": "I just received the item and I purchased it two days ago. I tested it out and so far it works better than another expensive tablet that I bought my mother a few years back. It's a Christmas present for my daughter, so I know she will love it. The price for this and the fast shipping is definitely a good deal.Hopefully it continues to work as time progress, if so, I will definitely purchase another one.", "Date": "October 30, 2013"}, {"Title": "Great product!", "Author": "OLG", "ReviewID": "R2BIPEZWWPBZ8X", "Overall": "5.0", "Content": "Purchased for 10 year old -- he loves it! Easy to use and great size! He's enjoying reading books on it, listening to music, and playing games!", "Date": "November 3, 2013"}, {"Title": "Love this tablet!", "Author": "Amazon Customer", "ReviewID": "R1JW0R4GM82PB4", "Overall": "5.0", "Content": "This is a great little tablet! I've put several apps on it for myself and my daughter and haven't had any trouble out of it! I'm considering buying one for my daughter for Christmas so I can have mine all to myself!", "Date": "October 25, 2013"}, {"Title": "IF YOU WANT TO BE HAPPY BUY FROM THIS SELLER", "Author": "woody", "ReviewID": "R103NRSQXC1CQF", "Overall": "5.0", "Content": "very happy with this seller pic showed a case in it thought it was included because it said free items inside the box but what came with it was the normal thing's that come with something like this a charger,cheap ear headphones that is it .I contacted the seller and they said it was a problem with the ad and they have been trying to remove it and said they would send me a silicone sleeve instead it is like a soft body glove fit perfect and it was red like the tablet. very happy they contacted me fast and shipped it fast got the tablet early and checked it all out for sons christmas present .will order here again soon.", "Date": "December 6, 2013"}, {"Title": "Very nice for a kids' tablet or light usage for an adult", "Author": "Reviewer", "ReviewID": "R3FGFC5YFNB6J9", "Overall": "5.0", "Content": "I ordered this product as a gift for my 6 year old daughter.  I chose the red after the pink sold out; I was very happy to see that the color was more of a \"hot pink\" than a true red which made it perfect for a little girl.  She has been addicted to my Android phone with games like \"Shark Evolution\" and \"Candy Crush\", so I downloaded those games immediately through the Google Play Store.  They reportedly :) worked well, as did internet browsing and Netflix, so it appeared to give her basically the same experience as the phone.  While setting it up, I noticed that the speed is noticeably a bit slower than my LG Motion, but again, the basic Android functionality is there so to most children this little tablet will be their own IPad or Samasung Galaxy Pad without as much pain to your bank account.  As an added bonus, your child will be able to access their educational websites through the tablet (e.g. Razkids) and the touchscreen works well enough (with or without the stylus).  It does have a camera and comes with all of the basic charging accessories.  Physically, the device is very lightweight and obviously fragile so a case is necessary.To be clear, this is not a tablet that you should be buying if you require state-of-the-art high-end performance.  But at 70 dollars it is definitely a nice little gadget for kids and acceptable for light-duty adult use as well.", "Date": "January 7, 2014"}, {"Title": "Pretty good tablet!", "Author": "nponch75", "ReviewID": "RUHVLAF50QTL4", "Overall": "5.0", "Content": "This is the first tablet I've ever purchased and was just looking for something low cost for basic web surfing. I'm really happy with it so far. I wouldn't describe it as blazing quick or anything but I am happy with this purchase nonetheless.", "Date": "October 31, 2013"}, {"Title": "Great for my Grandson", "Author": "Gary M Nilsson", "ReviewID": "R1XFNY2YZM3F4T", "Overall": "4.0", "Content": "Grandson loves this tablet. Instead of using my phone for games he now has his own Android device to play thos games on.", "Date": "February 26, 2014"}, {"Title": "Great Tablet!", "Author": "Jaclyn M. Overbey", "ReviewID": "R2UI9C0RBZJBGD", "Overall": "4.0", "Content": "I purchased this tablet for my son who is 12.  It has been great so far.  The speed is fairly fast and he has all the current games downloaded.  His main use of the tablet is playing the games such as Subway Surfers.  The only reason I did not give it a 5 star is because the power.  He has to constantly keep it plugged up in order to keep it charged.  But besides that, it is a great tablet to have.  I am considering getting myself one!!!", "Date": "February 21, 2014"}, {"Title": "Smaller than what I expected, but over all a good product", "Author": "fargomedic", "ReviewID": "R3H14HJ9MYG68F", "Overall": "5.0", "Content": "This product came 2 days early, which is a plus.  So far it does what the description said it would do.Great product, small in size, excellent for surfing the web.", "Date": "October 23, 2013"}, {"Title": "Great little Tablet", "Author": "Michael B. Rakow \"golferme63\"", "ReviewID": "R2W8RO7B4DEKEI", "Overall": "5.0", "Content": "Just ordered this for our caregiver. She has helped us so much with our son we wanted to give her this tablet as she does not have a computer. Now she can use this for movies,games,reading, and the internet, not to mention all the app's that come with it. She love's this tablet.This thing does so much and the price is fantastic. This was our 2nd purchase of this tablet, might just get a few more for Christmas.", "Date": "October 13, 2013"}, {"Title": "Great little tablet", "Author": "Melissa wood", "ReviewID": "R38L2BWBROOKAF", "Overall": "5.0", "Content": "Great tablet for my son's sixth birthday - and the red color is a bonus!  He uses it for educational games and apps and so far so good :)", "Date": "May 20, 2014"}, {"Title": "I got what I paid for.", "Author": "Julie Carmean", "ReviewID": "R2OWXA0A6D1DNR", "Overall": "1.0", "Content": "I bought two of these as presents based on all the 5 star reviews given here. When I first got them I was surprised to learn that the two were different even thought they were listed as the same item. I bought a red one and a blue one. Same vendor. They looked the same on the outside but the operating systems were different in slight ways that made installing the same apps difficult. Sadly, both tablets broke in about a month of infrequent use. The red one would turn on and get to the loading screen and stay there for several hours until either the battery died, even if it was plugged in. The screen on the blue one stopped working. When you turned it on the screen would turn a flat grey. You couldn't see a picture but the screen could still tell you were touching it and start apps and such. Pointless since you couldn't see them. Luckily, I bought the warranty for them. After paying to ship them back I was told that because I didn't send back the box or instruction pamphlet they came with I would be charged a 15% restocking fee. They said they would waive that if I left two 5 star reviews for the product. We consumers have to look out for each other so I will not lie to you for a 15% savings. Stay away. Spend your hard earned money on a better product.", "Date": "May 10, 2014"}, {"Title": "Love it!", "Author": "danny", "ReviewID": "R3DBZZOLL5GSUW", "Overall": "5.0", "Content": "Purchased this for my teenage nephew uncertain if he would take care of a tablet.I purchased this tablet for the price and the features.The tablet is still going strong.Im really happy with my purchase.If you have young kids or teenagers at home.This is a must buy.", "Date": "April 29, 2014"}, {"Title": "droid tablet", "Author": "Gerald Kaes \"engineering consultant\"", "ReviewID": "R3C6DTC1NFL5ND", "Overall": "2.0", "Content": "I found this difficult to use, but must admit I am a novice at use of tablets.  I returned the tablet - refund was quick and without lengthy explanation.It is a droid system and someone familiar with such systems might find it to be a real steal.", "Date": "April 29, 2014"}, {"Title": "don't buy", "Author": "Robin", "ReviewID": "RPX651EJSHZI0", "Overall": "1.0", "Content": "Very cheap ... do not buy ... tablet broke after a month later..  a waste of time and money ... never was shipped to home... it was shipped to my local post office... waste of time", "Date": "April 28, 2014"}, {"Title": "Stopped Charging/runs slow", "Author": "Nonnie B", "ReviewID": "R2P7JF12EJ83IL", "Overall": "1.0", "Content": "Bought this for my 7 year old because he wanted a red tablet.  My daughter has a Noria jr. Which is SO much better than this.  It runs very slow, and in a months time it just stopped charging all together!! Will be sending this back to get him a Noria Jr.  Same price MUCH better tablet!!", "Date": "March 27, 2014"}, {"Title": "Awesome", "Author": "Pen Name", "ReviewID": "R1W42WZLC6X0QD", "Overall": "5.0", "Content": "My 7 year old grandson loves this! We have tried other tablets and this is the only one he has truly enjoyed", "Date": "March 15, 2014"}, {"Title": "Off brand junk!", "Author": "Chris Haun", "ReviewID": "R9R0DHFDJXQ7O", "Overall": "1.0", "Content": "When we first received this product I noticed a small scratch at the bottom left corner of the screen. The stylus is a ridiculous looking piece of junk that barely works. Using the touch screen requires you to push down hard on the screen. The battery life last maybe an hour if you are lucky. It's a pretty useful paperweight though.", "Date": "February 18, 2014"}, {"Title": "not worth it!I", "Author": "Amazon Customer", "ReviewID": "R25TAC0CL76O6L", "Overall": "1.0", "Content": "Just did not work I don't know if there was something wrong with it or were they all like that slow slow slow...", "Date": "February 15, 2014"}, {"Title": "Great Tablet!", "Author": "Nichole Garza", "ReviewID": "R3PP00MOUOYVBM", "Overall": "5.0", "Content": "This was a Christmas gift for my 8 year old son! He loves it! Works great. Absolutely no problems. Connects to WiFi which means he can play all of his favorite games and even watch Netflix.Would definitely recommend this to anyone looking for a children's tablet!", "Date": "February 10, 2014"}, {"Title": "Fast Touch Tablet Review", "Author": "aaronevans23", "ReviewID": "R1UPPA3HPGEQ9W", "Overall": "5.0", "Content": "This tablet is the best. When I purchased it I new I would love it at first sight. You can surf the web and look on it's Google Play AppStore. It's simply amazing.", "Date": "February 7, 2014"}, {"Title": "Great for the kids", "Author": "D. E. Strothers", "ReviewID": "R2X9YQN843EW2T", "Overall": "4.0", "Content": "Bought six of these for the grandkids they are holding up well but need a little more memory. Great for the money though.", "Date": "February 5, 2014"}, {"Title": "Updated review", "Author": "Sheri", "ReviewID": "R1FI5X0Z93EESY", "Overall": "4.0", "Content": "I bought this for my daughter for x mas. It was really cute and fast. The screen was a little foggy but over all I was very pleased with this tablet BUT only a month later it started to come apart. One day my daughter snapped it back together an the screen broke so that it is no longer usable. Was good...while it lasted...Update..Contacted seller an they sent me a new one. Haven't had it long enough toKnow if ill have the same problem but hoping this one will last longer.", "Date": "February 4, 2014"}, {"Title": "Great tablet for a 13 year old!", "Author": "J. Bouman", "ReviewID": "R1GUEBL9OCM0VW", "Overall": "5.0", "Content": "The tablet was not even the main Christmas present but my son loves it!  He says it is not as fast as his friend's full IPAD, but it's pretty close.  For the price, this is a great deal.", "Date": "February 3, 2014"}, {"Title": "this is nice", "Author": "sumera javed", "ReviewID": "R1IXPQBGDJDGIT", "Overall": "3.0", "Content": "This is nice a little bit slow but it is good for my 3 years old son he liked it very much", "Date": "February 2, 2014"}, {"Title": "Good for the price", "Author": "Katherine Vyborny \"kvyborny\"", "ReviewID": "R26625FE2IHQ4Z", "Overall": "4.0", "Content": "The tablet is very nice for the price but the battery life is not so good and the screen scratches very easily. I had to order screen covers to protect it.", "Date": "December 6, 2013"}, {"Title": "upset", "Author": "melissa ransom", "ReviewID": "R3GWVFPO98ONCW", "Overall": "3.0", "Content": "it didnt really come with detailed user manual also was scratched an sounded like a big hasel to return an get a better one", "Date": "December 3, 2013"}, {"Title": "Great tablet for the 5-10 year olds", "Author": "Leroy Svoboda", "ReviewID": "R3PGOJ0VRU7ASM", "Overall": "5.0", "Content": "Love the colors this offers for the younger children.  Bought this for our 9 year old grandson and it is perfect for his age.", "Date": "November 23, 2013"}, {"Title": "No bang for bucks", "Author": "Cee Colors", "ReviewID": "R1K4KVVQWRTRAB", "Overall": "1.0", "Content": "Very slow...shuts down..won't connect..good for the price for a child to learn how to work tablets..seller is great responding to questions", "Date": "November 14, 2013"}, {"Title": "VERY slow when loading apps", "Author": "Maleficent \"Book Junkie\"", "ReviewID": "R2F7I684NPKELQ", "Overall": "1.0", "Content": "I bought this for my nephew who quickly became frustrated with it because it was so slow.  He ended up giving it to his little sister.", "Date": "March 5, 2014"}, {"Title": "not as expected", "Author": "sery", "ReviewID": "R30NEO4CQK9G6J", "Overall": "2.0", "Content": "This to me is a child tablet. I can't set my favorite home page, the browser keeps defaulting on the factory home page. Skype doesn't work properly, but works fine when I log in from a different device. Not happy!", "Date": "January 7, 2014"}, {"Title": "Good timeing", "Author": "Shenae davis", "ReviewID": "R1FB3GD7EQ59IV", "Overall": "3.0", "Content": "My son said he liked it and he got it two days before Christmas so if he's happy then I'm a happy mom", "Date": "December 30, 2013"}, {"Title": "4GB storage or 2GB?", "Author": "Ron", "ReviewID": "RSUMYWY5U7MQT", "Overall": "2.0", "Content": "My wife bought me one of these for Christmas and though it is listed as having 4GB of storage it only shows 2GB in the storage area under settings--one GB internal and one GB SD card.  A couple of hardware apps also only reported 350 or so MB ram as opposed to the 512 MB listed.  It feels cheap and is pretty slow when using the internet, but you can't expect a lot of performance at this price.", "Date": "January 5, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DP4INH0"}}