{"Reviews": [{"Title": "Stan the Man Reviews:  APEX Tablet", "Author": "Stanley Troy Thompson \"Stan the Man\"", "ReviewID": "RI4O9I8AHDQEN", "Overall": "4.0", "Content": "I didn't buy this tablet from Amazon.  I picked one up for sixty four bucks plus tax at Office Depot and I was seeing if I could find it on Amazon and how much they wanted for it.I give it four stars mostly because of the price.  It works reasonably well, though, compared to something like my Kindle Fire HD it is rather slow.I had the old model Jitterbug phones and got the new model ones.  I nearly threw the old chargers out but when I got this tablet I found that the charger fitted it.  I just throw this out in case you do have a similar phone. My APEX tablet did not come with a charger for a wall outlet--only a long and a short USB typed connector to charge from your computer.  Save all your old chargers is my advice. Also--in case you haven't noticed--Lowe's and other hardware stores now cell power strips with USB ports built into them and I believe you can get other types of electrical adapters with a USB plue socket.Like I said, it is a bit slow but, for the price, it seems to be decent enough if it lasts.There is one really dynamite thing if you know somebody who is partially visually impaired.  I have a Kindle Paperwhite which cost a bit more than this tablet and I have always wished I could switch it to white lettering on a black background like on my Kindle Fire HD.  With this tablet, you can download the App from Amazon and do exactly that--all for about the same price as the regular Kindle reader which isn't even illuminated like the Paperwhite.So, for a person on a budget on a budget who needs a fairly good reader this would be a good choice.  I imagine that other inexpensive tablets can do the same thing with the free Amazon APP--free if you have registered Kindles at least.That about sums up the review.  I do imagine in two or three years these kinds of tablets may be thirty bucks or even less.", "Date": "October 30, 2013"}, {"Title": "Slow, slow, slow but Sure", "Author": "burke \"RTB\"", "ReviewID": "R3AIQ16OZOXM9I", "Overall": "3.0", "Content": "I picked one of these up at Office Depot for $50 plus tax.  I wasn't expecting a lot but for that price I was somewhat surprised.  Not many Android 4.2 tablets out there for that kind of money. The APEX 7 tablet does almost everything it claims but at a very slow pace.  The display is not at all great but adequate in my opinion. The battery lasts for about six hours.  Google Play is available and apparently has been added recently as it is not mentioned in the reviews I read.  There are some errors in the Get Started pamphlet that comes with it.  There is no bluetooth function as claimed and no microphone unless it doubles with the speaker.  Sound is a bit weak but audible.  I've added several Apps with no problems.  I don't do games but I doubt  if any fast paced ones worked well if at all.  I would recommend this tablet to anyone not in a hurry and who enjoys messing with Android without dropping a lot of $.I'll have to upgrade my review to 4 stars.  It definitely has a working microphone that inputs voice commands but is not mentioned in the user manual as I mentioned in my initial review.  The microphone  must  share input with the speaker. It apparently isn't all that slow on all fronts.  I've downloaded several PDF files and noticed that the apps I've used download in a reasonable amount of time but the browser and boot up time are  as slow as molasses.  I didn't comment on the build quality but after a closer look it appears to be very decent although made all of plastic.  All the seams are even and there are no gaps where they meet.", "Date": "February 18, 2014"}, {"Title": "You get what you pay for, basically", "Author": "Daniel Clark", "ReviewID": "R19R0ER883XAEC", "Overall": "3.0", "Content": "Pretty slow, speaker is very weak, touch screen doesn't always respond, and many times it's off by enough that you click the wrong thing.  No bluetooth.  OS is nice.  Display is OK.  Taking it back to Office Depot and spending a little more money on something that will work better.", "Date": "February 26, 2014"}, {"Title": "Best Little Tablets.", "Author": "Dick tracy-BDA", "ReviewID": "RK0VKXSXACG42", "Overall": "5.0", "Content": "I would truly say that this little Tablet is Great. I have to send for a few more because every one loves them.", "Date": "February 23, 2014"}, {"Title": "Not A great deal", "Author": "Amazon Customer", "ReviewID": "R2LJZKCIAKXENL", "Overall": "1.0", "Content": "This is dreadfully slow. A real waste of money and no one to c complain to. I didn't expect a great deal but this was/is ridiculous!", "Date": "November 23, 2013"}, {"Title": "Apex Tablet", "Author": "DexaQun", "ReviewID": "RLLML161X39BT", "Overall": "5.0", "Content": "I chose this rating because I like the size and weight of the tablet along with the price.  I would recommend it to anyone.", "Date": "December 29, 2013"}, {"Title": "TABLET FOR A SENIOR", "Author": "James Reuther", "ReviewID": "R3P5CIS9K8TEZ1", "Overall": "4.0", "Content": "Nice little tablet....also purchased a keyboard and case. I really like it...as soon as I learn how to use it...I'll like it even more!", "Date": "February 5, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DHOGBZE"}}