{"Reviews": [{"Author": "Jarvis", "ReviewID": "R2M3AHWK9AH34K", "Overall": "5.0", "Content": "First I have to say, I own a Nintendo 3DS and have played around alot with Android devices. This tablet is essentially those 2 combined, BUT I have to say its the first device I've come across that does 2D to 3D streaming on Youtube in real-time! Wow, so the videos I love watching on Youtube I can convert any of them into 3D! You can also watch vids from DailyMotion and Vimeo in 3D.Second, this device also lets you play games in 3D, like Angry Birds, Grand Theft Auto, lots of others. It's all through TriDef technology, they also convert literally hundreds of PC games into 3D.Third, the 3D experience at least to me, is more flexible in terms of viewing angles than the 3DS. You have more angles to view from, colors don't shift as much, and the viewing distance isn't as restricting as the 3DS. Feels closer to an IPS panel than a TN panel.Aside from all the 3D (the OS is in 2D), it pretty much functions like any other Android tablet, it comes with Jelly Bean (4.1).Obviously the specs aren't killer, but it runs everything just fine: browsing, e-mail, apps, games. IMO it's a great value for the amount of 3D-enabled things you can actually do.", "Title": "Full throttle 3D entertainment!!", "Date": "February 16, 2014"}, {"Author": "John Clement", "ReviewID": "RL3WYZDNEPWID", "Overall": "4.0", "Content": "This a rebranded version of the Gadmei or the Fusion Inferno 3D tablet.  For reviews on this device look at the other devices.  At present there are no affordable excellent glasses free 3D displays.  The older lower resolution picture frames are pretty bad, but this is an acceptable device, especially since it can be used as a standard Android tablet.  Unfortunately it is impossible to buy this device in most local stores, so read the reviews carefully, as Amazon will not accept free returns of a working computer.", "Title": "Good but not great 3D autostereo tablet", "Date": "March 18, 2014"}, {"Author": "James P. Ltaestro \"Pat Maestro\"", "ReviewID": "R127WGSR5JVHQ9", "Overall": "3.0", "Content": "I regret to say how disappointed I am with the 3-D tablet.I have high speed internet but could not watch the 3-D video in HD because my broadband is too slow according to the manual.It's keeps buffering every 3 seconds.If I put the 2 minute HD video in pause and wait about 5 minutes I can then watch the 2 minute video in 3-D without buffering.Most of the time I recieve an ERROR when I attempt to watch 3-D videos on line with one of the installed apps.The 3-D player was not installed as an app on the tablet, only 3-D games from Tridef.Also, Yabazam is not installed as described.So, I had to do a lot of menu apllications to find my installed 3-D videos and every file required me to return to the menu and install the next file and then I have to click on 3-D, choose Side by Side,EVERYTIME since it defaults 2-DCustomer service was very helpful in finding a way for me to finally watch my personal 3-D videos in 3-D since there was no 3-D player installed as described.What a time comsuming pain in the A and I have to spend $250.00 plus tax for this headache....No way.It's being returned within 24 hours of delivery.The touch screen did not respond 60 percent of the time and sometimes it would give me the keyboard?By the way, there were no installed samples of 3-D videos or photos.All of the files read: Zero memory.I doubt if I'll buy any of the other similar models available after this bad experience.Save your money and watch your 3-D videos on your big screen 3-D TV with glasses.", "Title": "Trivax MiTraveler 3-D Tablet it a real disappointment", "Date": "March 26, 2014"}, {"Author": "Maria L. Lantin", "ReviewID": "R887RZAVBM4QM", "Overall": "2.0", "Content": "It's ok but I was expecting the stereo to be a little less finicky.  I have to hold it just so, and tilt it at an angle to get the 3D to work properly.  It's nice to have for testing but it's not good for any kind of exhibit.  Lots of ghosting.  Also it seems to run out of battery very quickly.  I am not used to Android and find the user interface a little cumbersome.", "Title": "Ok but not great", "Date": "March 29, 2014"}, {"Author": "James Honeycutt \"Mr. Aroid\"", "ReviewID": "R1AAAV0ZRLVZM", "Overall": "1.0", "Content": "At a minimum, this tablet let should support 1920 X 1080i or 1920 X 1080p so you can watch HD and or HD in 3D.  And, if it had a HDMI port in it (which it does not), you could plug your 3D blu-ray player into it and watch your favorite 3D blu-ray movies with it.  But no, you can not.  Do you have any idea what 3D Blu-ray/DVD players are selling for now (march 2014)?  You can buy several brands (including Sony) for well under $100.  You can find several band names you know for $79-$89.  But would it do you any good with this device?  No.  Pass on it.  It is a novelty toy that you can not move forward in time with.  When this vender puts a model out that supports HDMI 3.1 - HDMI 2.0, AND the screen will give you at least 1920 X 1080, then go for it.  This model is way behind the times and stuck in the past.  Pass on it and save your money.", "Title": "Not even 1920 X 1080 and no blu-ray support", "Date": "March 15, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00DQ621WK", "Features": null, "ImgURL": null, "Name": null}}