{"Reviews": [{"Author": "p brin", "ReviewID": "R2K0KCZMRAA1UY", "Overall": "5.0", "Content": "The tablet had been great.  Just wish it had more battery life to it.  But never the less I'm satisfied with the end result.  Its a great tablet.  The supply was awesome and got it to me on time.  I could not have asked for a better experience.", "Title": "great job", "Date": "October 10, 2013"}, {"Author": "Dave", "ReviewID": "RJVYIQJFJMPC9", "Overall": "5.0", "Content": "I already had the WolVol (LIME GREEN) NEW 7\" inch Mini Laptop PC, which I love.  I have it plugged into my TV watching TV from France while i write this.  I decided to get a tablet and went with WolVol again.  I love it.  I love the USB port.  I can plug in a thumb drive and watch movies.  I love the micro SD card slot.  I can use those old micro SD cards from old phones and load audio books.  I love the mini HDMI port.  i can hook this to my TV.  Yes, the battery only lasts 2 or 3 hours in use, but when not in use it lasts a long time.  I use this at home, where I can plug it in.  I use it as a mini TV and watch foreign TV.  I hook it to speakers and watch training videos from YouTube on the treadmill.  $95.  It is great!", "Title": "I Love Wolvol", "Date": "February 7, 2014"}, {"Author": "Jim York", "ReviewID": "R3BX830730GQKS", "Overall": "5.0", "Content": "Purchased as a gift because he could only get his email on his office computer.  With this table he has been to get his mail at home and also play a number of games.  So far he likes it and has just started loading apps.", "Title": "Christmas gift", "Date": "December 29, 2013"}, {"Author": "satisfied", "ReviewID": "RTA5XLCE36OCF", "Overall": "5.0", "Content": "We have this one, as well as one in blue, and one in white.  We have been happy with these for our kids.  Wolvol customer service is AWESOME !  If you are looking for a cover/case for this tablet the following item will fit this 7 inch tablet very well.ProntoTec Ultra Slim Lightweight Smart-shell Stand Leather Case ... by ProntoTec", "Title": "WolVol NEWEST MODEL 7 inch  (16 GB Android 4.2 - 1 GB RAM) Dual Core Processor", "Date": "March 17, 2014"}, {"Author": "Pothead81", "ReviewID": "R1GQTFFQNV6OFZ", "Overall": "5.0", "Content": "I love it it is better than the apple, samsung or other top brands out there!  i reconfnd it to anyone who is 'on the with' of the new world order", "Title": "most excellent tablet i love wolvol its the new so", "Date": "November 4, 2013"}, {"Author": "Lloyd C. Painter", "ReviewID": "R2DZYSSQVTUL2Q", "Overall": "5.0", "Content": "I ordered the WOLVOL 7 inch black Android 4.2 tablet (8 GB hard drive) from WOLVOL in NYC. The item was processed and arrived in the time prescribed. I give WOLVO, NYC, a 5 Star Rating. I am very satisfied with the product and WOLVOL's Customer Service. I highly recommend WOLVOL.", "Title": "WOLVO 7 inch Black Android 4.2 Tablet", "Date": "October 15, 2013"}, {"Author": "Xetrae", "ReviewID": "RXO6DLIOPKOWS", "Overall": "3.0", "Content": "When I got this android, I was veconfused. Every program was failing upon system power on. There was no online troubleshooting, and I would be the last person to pick up a phone for help with gadgets. Thankfully, the play store lasted long enough for me to search for a launcher in the apps section, and once I did that then it was good.I've only had it for a day and I'm still working on how to get all apps to work under the new launcher. Otherwise it works decently. The time zone needs to be manually set. And the battery life is pretty bad, but its to be expected of a cheap tablet that can't even run by itself.On the positive side, once I installed the new launcher everything is good. Kingsoft Office Word is great, file manager is standard android, touchscreen is well calibrated. Camera works, but I haven't tried the back one with the flash yet. Plastic is cheap though, so be careful. Oh, and it took a little while for my eyes to get used to the screen even though I look at screens all dayfor work and school.I give wolvol 3 stars for decent but not perfect or beginner friendly programming. Shipping was perfect though.", "Title": "Terrible Launcher and Battery", "Date": "December 4, 2013"}, {"Author": "Angelina Pereira", "ReviewID": "R96M4A0DPZENL", "Overall": "5.0", "Content": "It is compact, and does everything I expected to be able to do with it and more.  Even for a not so computer  wise person like me, It is  easy to use.", "Title": "I love it!", "Date": "November 9, 2013"}, {"Author": "Antonio F. Sanchez", "ReviewID": "R2B263A8ISIJBY", "Overall": "5.0", "Content": "This was honestly my first tablet I ever got. I love it works exactly like I expected it too :D", "Title": "Its awesome!", "Date": "December 14, 2013"}], "ProductInfo": {"Price": "$169.94", "ProductID": "B00DTIIFSY", "Features": "Supports 1080P video playback, HDMI output and connection with HDTV.\n5 Point Capacitive Multi Touch Display. Gravity Sensor.\nBuilt with Dual Core which enables better performance. Installed with a regular USB port.\nBrowse the Web, YouTube Facebook Twitter, Check Emails, Write Documents, Save Photos/Videos\nDownload/View Thousands of Free Exciting Videos, Games and Apps", "ImgURL": "http://ecx.images-amazon.com/images/I/51DZaHoP1uL._SX300_.jpg", "Name": "WolVol NEWEST MODEL (16 GB Android 4.2 - 1 GB RAM) Dual Core Processor, Dual Cameras, 7 inch Tablet with WIFI Capacitive Touch Screen (Accessories included) - BLACK"}}