{"Reviews": [{"Author": "Paul \"Paul\"", "ReviewID": "REIIEB9I3YIY5", "Overall": "4.0", "Content": "This is by far the best mix of performance and price I have found in small tablets. But perhaps the biggest reason to love this is the aspect ratio: it is 4:3 rather than the standard 16:9 used by the vast majority of Android tablets.I have a 7\" tablet which I use mostly for reading and web browsing, but the screen is just too small to comfortably view most web pages. I want a \"one-hand-able\" device so don't want a 9/10\" tablet, so a 4:3 small tablet is the perfect mix. The iPad Mini would be great hardware-wise, but I strongly prefer Android to iOS.Except when viewing movies (which I rarely do) I hold the device in Portrait mode, and the extra screen width makes a huge difference. For example, the screen is nearly 40% larger than a 7\" tablet, and is actually *wider* than 9\" tablets, but much shorter, lighter, and less expensive.PROS4:3 aspect ratioLightness and portabilityExcellent build qualityAndroid, not iOSMuch cheaper than an iPad miniMore tablet-aware apps than I expectedQuad-core CPU performanceUSB port, SD card slotLatest 4.2.2 Android releaseCONSNon-Retina display (1024x768, same as iPad Mini)Slightly larger than an iPad Mini, so its accessories (e.g., covers) cannot be usedNot as many tablet-aware apps as the iPad MiniMy first unit would not boot up, but an amazingly quick and painless return process (thanks Amazon!) had a new and perfect unit at my door in 36 hours.NOTE ON L416 vs L888 MODELSThere are two model numbers of this tablet: A1-810-L416 and -L888. Each is listed for sale separately at Amazon, which has led to much confusion.Contrary to information in other reviews/answers above, L888 is merely a minor hardware revision--the fundamental hardware/software specs are identical: [...]The only difference seems to be the CPU: L416 uses the Cortex A7, L888 is A9. Sources differ on which is better. This is the best article I've found, which gives the nod to the A9: [...]HEADS UPThe \"HP Slate 8 Pro\" is a 4:3 tablet coming in Fall 2013, with a Retina-quality display. This will be the perfect device in my opinion, and you may want to wait and check it out. However it will surely be significantly more expensive.RANTWhy the heck don't more Android tablet-makers use 4:3??!! In my opinion this is one of the main reasons iPads have been so much more successful than Android tablets. I'm amazed and frustrated that so few seem to notice or care about this extremely important difference.", "Title": "Perfect small tablet in the ideal 4:3 aspect ratio", "Date": "September 23, 2013"}, {"Author": "Annie Wong", "ReviewID": "RAKUYWHHC21D", "Overall": "4.0", "Content": "This tablet comes with a lot of popular and useful pre-loaded apps.  I mainly bought it for the GPS and video playback features.  The unit is light and small so it fits in my handbag nicely.  The white plastic back is not cheap nor ugly.  Picture quality is good enough for general viewing though not as great as retina display but for $179, it is not bad.  A lot of users claimed the screen is not bright and the speaker volume is low.  If you are watching Netflix up close, just adjust the speaker volume to the highest setting, you should have no problem hearing.  I typically leave the brightness at the highest setting so the brightness is not an issue.  For reading, the 4:3 screen is better than the 16:9 screen and the 7.9\" screen size is adequate.The unit comes with a micro HDMI output which you can output any video contents from the tablet to a TV via a micro HDMI cable(does not come with the box). I used it in a recent trip and it worked well other than the output aspect ratio was not output properly as the picture was stretched.  I used it on two hotel a TV's and had the same issue.  This issue could be resolve by adjusting the aspect ratio in the tablet or the TV but I can not be for sure for I didn't have a chance to play with it yet.  The TV quality on a 32\" is good but not great, it could be because the hotel wifi was weak.The GPS doesn't work well so if you want to replace your Garmin or Tom Tom, this is not a good option.  In order for the GPS to work without wifi, you must pre-upload the maps from one of the apps available in Google Play.  I paid $1 for an app called GPS Navigation and Maps which gives you all the US maps and they are stored in my micro SD card.  If you don't have wifi, the address search doesn't work properly as it can not locate the house number, it will only take you to the center of the street.  I tried several off-line map apps, none of them worked properly without wifi.  I got around the issue by using geo coordinates, I did an address to geo coordinate conversion with my iPhone, once I input the coordinates, the exact location came right up.  I also address searched for all the locations that I visit often when I was connected to wifi, and saved them as favorites. The next time I visit one of these locations without wifi, the GPS will take me to the exact spot. To make a long story short, search the location where you want to go while you have wifi before starting your trip, the route will come right up.  If not, it will not work well..", "Title": "Great little tablet", "Date": "October 26, 2013"}, {"Author": "annieoftirol", "ReviewID": "R3G2YDZ5SYPC8S", "Overall": "4.0", "Content": "Love this tablet. Has the HDMI out which my galaxy did not have. Great for hooking up your tablet to your HD TV and use the TV as a giant android screen. I love this feature and use it all the time. It has a front and a back camera. Many other tablets no longer have the back camera, so you cannot take pictures and videos of your friends.  It uses the micro USB port for charging, while others still use a proprietary charger, like my old Samsung galaxy tab. I love the 8 inch screen size, much better for reading than the 7 inch, but not as bulky as a 10 inch, this one feels good in the hand. It's very fast, streaming via WIFI is excellent for online class videos, u tube, etc. The on board memory is good for having a number of android apps on it. The memory can be expanded, I have 32 extra GB, great for carrying videos.  All in all, I'm very happy with this tablet.Add: It's running android 4.2.2, very fast. Also, there was an over the air software update just last week, tells me Acer cares about this tablet and keeps it current.Edit: 12/30/2013: Well, after having the tablet for two months, I need to take off one point, why? I find the speaker volume to be very low, much lower than my older tablets and phone. Even with headphones I don't get enough volume. I am not someone who loves ear busting volume, just like a normal sound level, which I am not getting. I downloaded the MX player app from google play, which has a sound amplifier and it helps some. I think they need to increase volume capability.", "Title": "Full of features, great size.", "Date": "October 6, 2013"}, {"Author": "S. E. Larmer \"Ecclectic reader\"", "ReviewID": "R1W831ELIY9HR6", "Overall": "5.0", "Content": "Since I am used to an android phone, this was easy to use, good display, good battery life. The price was good as well.", "Title": "Exactly what I was wanting.", "Date": "January 31, 2014"}, {"Author": "MikePC", "ReviewID": "R1DT8NK2RNWASJ", "Overall": "5.0", "Content": "Easy to use and just the right size for me. Freedom to pick Apps that I chose and not what some Mfg's force you to use theirs.", "Title": "My kind of tablet.", "Date": "December 30, 2013"}, {"Author": "Jose", "ReviewID": "R3FJVXSDV4JU5X", "Overall": "5.0", "Content": "Excellent tablet...best value for money.YESs: Brilliant processor performance and reasonable graphics, right and convenient screen size, acceptable battery running time, good camera resolution and best of everything it's an open mind device because you can adapt external devices to it...NOs:  A bit bulky and a bit heavy.Overall:  Best tablet money can buy...", "Title": "Best value for money", "Date": "December 20, 2013"}, {"Author": "thomas misdom", "ReviewID": "RF87NPC2AOTX9", "Overall": "1.0", "Content": "piece of crap broke in less than 2 months never dropped it and now it doesn't turn on at all", "Title": "was ok", "Date": "December 14, 2013"}, {"Author": "sue", "ReviewID": "R1FZV641ELOTE7", "Overall": "1.0", "Content": "Can't watch movie streaming in from netflex or amazon on it. doesn't have the apps to do it. Cannot even download them to the tablet. If I had known this, I would not have purchase it. By the time I figure how to get from a to z on the tablet, my 30 days period was up. Could not return it to HSN. Sorry that I ever brought it. I love my Kindle Fire, can watch netflex and amazon.com on it.", "Title": "can't watch movies on it", "Date": "October 5, 2013"}], "ProductInfo": {"Price": "$231.83", "ProductID": "B00D02AASC", "Features": "Android 4.0 Ice Cream Sandwich, 7.9 inches Display\nA4 1.2 GHz\n16 GB Flash Memory, 1 GB RAM Memory\n0.90 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/51L9HznUGFL._SY300_.jpg", "Name": "Acer NT.L1CAA.002;A1-810-L888 7.9-Inch 16GB Tablet"}}