{"Reviews": [{"Author": "Jeremy Graves", "ReviewID": "RPPHV2E1IRJAH", "Overall": "1.0", "Content": "I purchased this for my son, in hopes he would be able to let my more expensive one go.  That he did, and boy did he love it. However the battery died and he went to charge it for the night, and it never woke up.  The back got real hot, and neither the battery or the charger will make it come on.  I would think again about purchasing this.  Hopefully the seller can help me out here, I will keep you posted.  Was his big Christmas gift, and if I can't get it to work or replaced will have to spend more money to get another.Update:Well I got a response from the seller, and they had me try some things.  Even had me reflash the tablet, yet it still doesnt turn on. Haven't heard from them in a couple days.", "Title": "Lasted 8 days", "Date": "January 3, 2013"}, {"Author": "Lisa Wirhanowicz \"Lizzie Wishkabibble\"", "ReviewID": "R1O47W5LWUP53N", "Overall": "1.0", "Content": "fake number on package saying it was sent out.Ruined my whole christmas,my gifts never came,i am so angry,i trusted Amazon to make sure their distributors were legit.I have ordered on amazon for years,i really at this point never want to again.", "Title": "never order from this seller", "Date": "December 30, 2012"}, {"Author": "Margaret", "ReviewID": "R28T7EMR3NRQGO", "Overall": "1.0", "Content": "I purchase 2 tablets and 2 keypads from importers127 for a Christmas gift. It was suppose to arrive between Dec 20-26 by 8:00pm. It is now Dec 28 and still have not received the items or heard from importers127.", "Title": "Importers127", "Date": "December 28, 2012"}, {"Author": "Stacie Coble", "ReviewID": "R3OI90HZG80MD6", "Overall": "4.0", "Content": "This was purchased for child that wanted ipod touch for christmas. her response to recieving this instead was - it took my breath away ; it is better than an ipod touch! Thanks for making my little girls Christmas - ps bought a used coby tablet for younger sibling for similar price and like that this one has a camera and uses google play store for downloading apps! Great product!!!", "Title": "GREAT for an 8 year old", "Date": "December 27, 2012"}, {"Author": "N. K. Sosa", "ReviewID": "RXP398ZWFISMV", "Overall": "4.0", "Content": "got it today, very difficult to read manual.  it has to be charged before use.  totally dead battery.  after that it is pretty easy to set up.Lets eee how the kids like it", "Title": "so far so good", "Date": "December 26, 2012"}, {"Author": "Starmom", "ReviewID": "R31W7FCMP723EZ", "Overall": "4.0", "Content": "This really is a NICE tablet!  It works great, downloading apps was really quick and EASY!!  So many fun free game.I have not tryed everything, just got it a week or two ago for my 12 yr old son for Christmas.  I did play with and charge it 100% and had lots of games for him already downloaded for Christmas morning.  I only gave a 4 star because the tablet does freeze up some.", "Title": "Really nice tablet!!", "Date": "December 26, 2012"}, {"Author": "Antoni Stoychev", "ReviewID": "R3CQTC51RGXLA7", "Overall": "4.0", "Content": "In general no big problems with this tablet. Sometimes I had to restart my wi-fi modem, because tablet shows it's connected, but  is not. Otherwise good CPU speed and response of the screen. Runs smoothly.", "Title": "It's good for the money", "Date": "December 23, 2012"}, {"Author": "Donna", "ReviewID": "R1DO3SQARZUPHO", "Overall": "5.0", "Content": "I bought this tablet for my grandchildren ages 6-11.  They are all happy with it.  The protective screen and gel cover helps to protect the tablet", "Title": "Great tablet", "Date": "December 15, 2012"}, {"Author": "Cindre", "ReviewID": "R2ZZE2R3NP0CPO", "Overall": "2.0", "Content": "Okay, so I bought this tablet in March 1, 2013 for my daughter's birthday and received it March 27, 2013. When we first got it the tablet worked fine. The screen was nice, the battery life wasn't all that good but it was okay, and it allowed us to download a few apps. But a week later part of the screen stopped responding to touch. It froze a lot, and even locked us out a few times. The camera hardly ever opened and the video calling wouldn't work at all. Finally the back randomly came off and the whole tablet just stopped. Got my money back and will not be ordering another.", "Title": "I wouldn't buy another one.", "Date": "June 28, 2013"}, {"Author": "Christina Franklin", "ReviewID": "R1G895QU6M19V4", "Overall": "1.0", "Content": "This tablet was a Christmas gift for my daughter.  The first day she got it, the power button locked and I couldn't turn it on at all.  So, we got a replacement one.  Now it also doesn't function properly.  The tilt doesn't function proplerly, so games like Temple Run are out.  And also, whenever she tries to get on Netflix or YouTube, a jumbled screen shows up with gibberish words and nonsense parts of pictures.  I would NOT recommend this product to anyone!", "Title": "absolute junk!", "Date": "March 14, 2013"}, {"Author": "amandaaa", "ReviewID": "R4GJONX1522E4", "Overall": "3.0", "Content": "I had the Zeepad Tablet(White) for about 3 months before it was broken. First, the usb charger slot had broke( I dont know how) and Im positive it was not me. Then, the power button had broken and then the tablet started acting funny. Like it would shut off randomly and reset by itself. However, right around the time I was going to take it back, I realized I called the Goodios company and it was 90 days exactly, my friend had the same exact tablet and the same happened to her. So, I believe that these tablets are only made to last past the 90 days so you can not get your refund. Overall, the games and apps work perfect, it is just the manufactering part that does not come up to par. In my opinion, DO NOT BUY!. Save your money and buy something like a Samsung Tablet 3.", "Title": "Average For a Tablet", "Date": "December 20, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00DQBZUD2", "Features": null, "ImgURL": null, "Name": null}}