{"Reviews": [{"Author": "msschemist@yahoo.com", "ReviewID": "R345AIH47OJPIV", "Overall": "4.0", "Content": "After reading reviews, I finally chose this jewel of a tablet.  It was so easy to set up. The graphics are so clear. It smoothly paired with my android Cricket phone as well as the blue tooth keyboard. At a fingers touch, it also connected to house Wi-Fi.  I immediately linked to my email and many apps.  This beautiful tablet came loaded with much more than what I expected.  I took nice photos, bank online, read from Google books and listened to clear music. The speakers are located on the front and sound great.  I'm so happy because I don't have to lug my heavy 5-yr old pc.  I can sit next to my dad on sofa while we use this light, cool tablet to watch news, YouTube clips, listen to music & connect with family.  I think this is a great deal for the price $249.00 because it came with a dock and keyboard. UPDATE: The tablet works well with photo/file cloud services. It plays Netflix, YouTube and HuluPlus videos well, Previously installed adroid compatible flashplayer via adobe's archive, but no longer works on Amazon instant videos.  So installed glitchy Puffin Free to access Amazon Instant Videos.  How strange that Amazon does not sell a flash player app so Prime members who bought android devices on Amazon can access videos. SO FINALLY I DECIDED if my android tablet can not access Prime videos, why keep the Prime membership?  Customer service agreed and refunded the full amount I paid for Prime.;)", "Title": "So delighted with this, except for...little problem with Amazon instant videos", "Date": "July 24, 2013"}, {"Author": "Jason", "ReviewID": "R1F6AY66MKXNYD", "Overall": "5.0", "Content": "Not a bad tablet for the price. I ordered this tablet bundle on a whim and I have not been disappointed. I love the Android OS and it seems much more user friendly than IOS. Having also owned an Ipad I can say that I prefer the Android. Graphics seem plenty adequate. In my opinion as far as my eye can see, the difference between the graphics on this tablet and the Ipad 3 are minimal. Sure the Ipad has better numbers in the specs but in reality the difference is subtle and I am able to do so much more with this tablet that suites my needs. The keyboard works great and the docking stand is a nice addition if you want to use your tablet more like a computer. Battery life is excellent. I use  the tablet multiple times throughout the day and the battery lasts pretty much from the time I get up until I go to bed then I charge it overnight. Also the front firing speakers are a plus with decent audio quality and plenty of volume. Apps are plentiful for this tablet and I haven't had any problems finding what I need. Streaming video over the internet works great too and yes, it does work with Adobe Flash player which is sweet. The only possible negative that I can think of is that the charging port is on the bottom of the tablet below the Samsung logo. I think it would have been more convenient if it had been on the left or right side of the tablet but I don't consider it to be a huge deal. In all if you are considering an Ipad I think this is a great alternative that wont disappoint. Also it is about half the price of the Ipad. In addition (unlike with the Ipad) you can add additional memory via a micro sd card which works great. I'm not trying to give the Ipad a bad rap with my review because they are excellent tablets in their own right. I'm simply using it as a platform to base my review off of as I am familiar with them. I just think this unit is much more user friendly and allows more flexibility in making it do what you want it to do. In all I think this is a great tablet for the price and you definitely get more than you pay for which is rare these days. Again these are just my opinions but I am very satisfied with my purchase of this tablet.Additional Note: One reason I bought this tablet is because I am an avid photographer and I wanted a photo storage medium to travel with. I can transfer my photos to this tablet from my camera and I don't have to lug around a huge laptop plus I have most other conveniences of a computer. This is much easier and lighter to travel with and there are plenty of photography apps for this tablet, especially for reading camera raw files. I can't do a lot of hardcore photo editing but that is not my intent so much as a storage platform until I get back home where I can transfer them to the computer.", "Title": "Better than I expected.", "Date": "September 18, 2013"}, {"Author": "David D. Gali II", "ReviewID": "R1W2S14JITCO3L", "Overall": "5.0", "Content": "After reading reviews and looking into the Tab 3, I definitely wanted to get another Tab 2 before they are not available any more.With the added keyboard and stand it's very handy on my desk.  I added a small Bluetooth mouse to make this a perfect little half-way computer. The keyboard seems to work flawlessly and the keystroke reaction time is good. I'm a computer and network administrator, and I'm always on the go and not in an office. I maintain about 30 computers remotely and can access them all from my tablet to perform small tasks. And tethered to my phone allows me to do all that on the go. I am also a musician and perform out a lot. So I have gotten rid of my music binder and music stand, and now use the tablet for all my sheet/chart music, attached to my microphone stand. It's awesome!  One problem I ran into with this product was with Samsung, when it/they offered an upgrade with the firmware and Android OS, which I regretfully accepted and performed. It upgraded the Android system from 4.1.1 to 4.2.2, which I immediately hated in every way. (Specifically where it changed the location of the home and back buttons, as well as the menu options. Simply annoying.)  Then it/they would not allow me to go back to the previous version.  After some time I was able to download the previous firmware and an installation utility to reset the system back to the previous firmware and OS. So it's back to the way I loved it when I purchased it.  (Basically,\"If it ain't broke, don't fix it!\")  I definitely love this product and use it daily.", "Title": "I definitely love the Samsung tablets (We now have two of them)", "Date": "September 22, 2013"}, {"Author": "LaDonna Elliott", "ReviewID": "R11R3IDQY4P3TQ", "Overall": "4.0", "Content": "Never owning a tablet before and working over what I wanted, a tablet or a laptop, this is a cool little tablet.POSITIVE: It satifies the need for both a laptop or a tablet.  I'm able to do some of my office work on it, and at the same time download whatever receipe, craft, app I want.POSITIVE: It's very simple to work with.  My 2.5yr old grandson and computer illiteral, new-fangle gadget technically challenged husband both play games on it, and can find them with great ease by flipping the pages.POSITIVE: I love the fact that it has it's own stand and own blue tooth keyboard.  This feature gives it that quick feeling of a laptop and the quick typing on a keyboard rather than a \"swipe board\".POSITIVE: It's easy to learn and find applications ~ that's the biggest neatest thing about it.  There are no hidden folders, hidden apps.NEGATIVE: It lacks is a camera flash and a USB port.NEGATIVE: When there are android / platform updates, there are SERIOUS UPDATES, which change keyboards, screens, app preferences, etc.NEGATIVE: A lot of the Google Play apps want to know location, location, location. Really?  Do they REALLY need to know my location for me to download their program?NEGATIVE: There is not a help guide that comes with the book.POSITIVE: The Samsung service support desk is very quick to answer the calls, extremely knowledgable about current updates/upgrades, and speak very clearly and comprehensively, not like some call centers where you have to have an interpreter on the line with you.", "Title": "Awesome little tablet, missing camera flash/USB, android updates change platform", "Date": "October 21, 2013"}, {"Author": "Memaw 43", "ReviewID": "R2SVEIMA1BGEVX", "Overall": "5.0", "Content": "This is a very responsive tablet and very sensitive to the touch.  It is clear and can move easily through the screens...cannot say anything negative about it except that is does not accept Flash Player, but I can live without that.  Would highly recommend.  This is the 3rd tablet that I have gotten - sent the other 2 back as could not keep a connection at my house for 1 and the other one would not hold a charge, so decided to go with something that I was sure of and it was well worth the extra money spent...", "Title": "Love Samsung Galaxy2 10.1", "Date": "July 25, 2013"}, {"Author": "JH", "ReviewID": "RRC7ZTEMK57VS", "Overall": "5.0", "Content": "I am big fan of apple products and I needed to buy a computer device for my 80 yr old mom.  Ipad was just too expensive for what my mom needs.  Came across this one and bought it.  I am very impressed after using it for about a week .  It is not as seamless as an OSX device but for the money I do not believe it can be beat.  I'm seriously thinking about buying one for myself.The screen although not a retina display is really very good.  The forward firing speakers are a welcomed feature and it is lighter in weight compared to the iPad, very nice to handle and hold.  I have to say I've been reaching for this device over my iPad lately.  I really like the stand and keyboard that come with this package.  Is nice to have when you just want to park yourself at the table and do some emails or web searchs.  Overall, I am very pleased with this device and would highly recommend if you do not have the bucks to buy an iPad.  Awesome device!", "Title": "very impressed", "Date": "September 12, 2013"}, {"Author": "Jeremy L. Loomis", "ReviewID": "R2A8JOKJ5YJPAU", "Overall": "5.0", "Content": "Very nice package excellent value.  I was debating between a IPad and the Galaxy and am very happy I chose the Samsung", "Title": "Excellent Value", "Date": "August 7, 2013"}, {"Author": "davep", "ReviewID": "R1OF9DXHVISEOR", "Overall": "5.0", "Content": "I am still learning how to use it, but I am amazed what it can do.  I really love the bundle package.  It saved me a bundle and works very nicely.", "Title": "Great deal.", "Date": "September 12, 2013"}, {"Author": "Tosha Mittag", "ReviewID": "R190QWS8MM59Y3", "Overall": "5.0", "Content": "My husband and I love this product well worth the money all mt books transfered on it from my kindle which was nice and we love playing our games and its just like a computer love it love it i recommend this to everyone", "Title": "awesome", "Date": "September 3, 2013"}, {"Author": "Pilar Portela", "ReviewID": "R2VA6XJI480P7V", "Overall": "5.0", "Content": "Excellent buy! Perfect for my family especially for logging onto school applications. The price is perfect and it's less expensive than an iPad.", "Title": "Perfect for a family tablet", "Date": "September 4, 2013"}, {"Author": "James D Johnston", "ReviewID": "R2TQE4MA12J52S", "Overall": "5.0", "Content": "Great tablet.  Does what I want with a screen larger than a postage stamp.  The key board is a great value with the Galaxy Tab 2.  The touch screen is quite responsive.  It was worth the buy.", "Title": "Great Tab", "Date": "November 4, 2013"}, {"Author": "Julian \"Aussie\"", "ReviewID": "RY1XDJVGHX9LX", "Overall": "5.0", "Content": "Does as expected. Why buy an iPad. This thing is as good or better. Even the screen keyboard is good enough for some writing at the coffee shop or traveling.", "Title": "This is agreat product. GO SAMSUNG!", "Date": "November 2, 2013"}, {"Author": "Jan \"SpeechJan\"", "ReviewID": "R1UIKZMHF09J8", "Overall": "5.0", "Content": "My sister and mom have one, so I knew what I was getting.  I love the dock and keyboard! I was going to get a keyboard and mouse anyways.", "Title": "Love it!", "Date": "September 6, 2013"}, {"Author": "Yinka L Humes", "ReviewID": "R3Q2NUKVENT1IV", "Overall": "5.0", "Content": "I Loved this product, it is beautiful and really user friendly.  I would highly recommend buying it to any friend.", "Title": "Impressive", "Date": "November 9, 2013"}, {"Author": "Charles Hale", "ReviewID": "RA8QU8XF6H0U2", "Overall": "4.0", "Content": "Very happy with my purchase.  A lot of value for the price.  The product was delivered on time and in new condition as expected.", "Title": "A Bundle Best!", "Date": "October 30, 2013"}, {"Author": "HappyFromSC", "ReviewID": "R2A6BP4DT3MKZ", "Overall": "5.0", "Content": "No need to buy the Note and pay that much.  This one works great.  Fast processor, great screen resolution, and with the keyboard, it doubles as a laptop.  Great for taking notes in class.", "Title": "Great product, love it!!", "Date": "October 10, 2013"}, {"Author": "Veronica", "ReviewID": "R3U4OXSOPYRRJG", "Overall": "4.0", "Content": "Love it! Perfect that it has a full size keyboard. Only down side is I cannot find a full version of Microsoft offie. I'm in school and need to full editing capabilites in word and excel.", "Title": "Almost perfect", "Date": "November 23, 2013"}, {"Author": "mfdockery", "ReviewID": "R3F6K95JDQQOU7", "Overall": "5.0", "Content": "This is our second Galaxy Tab and our kids really like them. They can do school activities, play games, watch videos, take pictures and video's. All around nice units.", "Title": "Excellent Tab for Junior High Student keeps her interested in learning new technology.", "Date": "October 22, 2013"}, {"Author": "Amazon Customer \"Fireman292\"", "ReviewID": "R172J1FO0KGX1G", "Overall": "5.0", "Content": "Enjoying the tablet, do not use stand and key board much as i put it in a tough shell case.Has worked great, learning to like the OS. Connected to internet and downloaded items from Samsung, Google and Amazon with no problems.", "Title": "Exceeded expectations for the price", "Date": "October 20, 2013"}, {"Author": "Carroll1865", "ReviewID": "R2JVW55P02NHW1", "Overall": "5.0", "Content": "This is a great tablet. I don't bother getting out my laptop any more when I just want to surf the web while relaxing in my chair. It is also great for bringing it to bed for reading or doing a game app because it is so light. The 10 in screen size is the best part.", "Title": "Samsung Galaxy Student Edition Tablet Bundle", "Date": "October 14, 2013"}, {"Author": "Brock bundy", "ReviewID": "R1UIDVK4J0MCY9", "Overall": "4.0", "Content": "Works great wonderful item. Wish the battery would last longer. When battery gets low tend to lose wifi and drops out of screen.", "Title": "Really like the tablet", "Date": "October 20, 2013"}, {"Author": "Sherry Whitaker", "ReviewID": "R2OY79VG2N8AAH", "Overall": "4.0", "Content": "I like it very much I can take it with me eaiser and I like the touch screen. I do like amazon it is great!", "Title": "Samsung Galaxy", "Date": "October 17, 2013"}, {"Author": "Ashley", "ReviewID": "R1FJ3NQTV37I2K", "Overall": "5.0", "Content": "I just bought this product and I love it. I bought it to replace the Microsoft Surface RT which started gliching 5 months after I bought it. I love Samsung products I have a Galaxy III phone and the one time I had a problem with it. I sent it to them they fixed it and sent it back within a week.", "Title": "Love Samsung Tab", "Date": "September 30, 2013"}, {"Author": "Rocha4theWIN", "ReviewID": "R279UKQ3PC8FQA", "Overall": "5.0", "Content": "I was shopping around for a reliable and affordable tablet or lap top when I finally decided on this Samsung Galaxy 2 10.1 Tab. The features have been more than I ever expected and Im more than happy with it!!! Thank you everyone at Samsung!", "Title": "Incredible! Doesn't let you down!", "Date": "September 22, 2013"}, {"Author": "D. Moreau", "ReviewID": "R35GXDGC2QP30C", "Overall": "5.0", "Content": "This is a great tablet at an even greater price! Why would you want to spend 600-1,000 on an apple tablet?I got this bad-boy for free because I sold some thrown-away college textbooks on the Amazon trade-in and ended up getting enough to cover buying a tablet, and I did not go wrong with Samsung! I almost caved and bought one of those off-brand 100 dollar tablets, but after seeing some sketchy reviews I knew I should go with a brand I love and trust: Samsung. I visited Samsung headquarters when I visited Korea a couple years ago, and I knew one day I'd become a huge Samsung user.You have speedy browsing, great apps, this tablet is sleek and sexy, the keyboard worked to perfection, and it's really easy to set up! If you have a Samsung phone (especially if you have a Galaxy) just imagine your phone, but 7 inches bigger, faster, and better at multi-tasking. That is pretty much what the Samsung Galaxy Tab 2 is!", "Title": "Why go Apple?", "Date": "May 14, 2014"}, {"Author": "Celina De La Fuente", "ReviewID": "R4ZMAK0QJJCTN", "Overall": "5.0", "Content": "I am currently still becoming familiar with this product but so far I am pleased with this purchase.  I have learned that depending on the quality of the wireless service availability determines the quality of product service.", "Title": "Samsung galaxy tab 2", "Date": "May 13, 2014"}, {"Author": "hugh leonard", "ReviewID": "R3VKZNA0YLOAVA", "Overall": "5.0", "Content": "Girlfriend loves tablet. She takes it to work an takes pictures of her shop. I wish I had bought it sooner.", "Title": "I don't know what I'm supposed to write", "Date": "May 4, 2014"}, {"Author": "Karlene", "ReviewID": "R1H6LG574SROHO", "Overall": "5.0", "Content": "What can I say?  I've had this for a while now and it works really well.  No problems at all.  I'm a serious typist so \"hunt and peck\" method doesn't work for me.  I needed a real keyboard and this one great - lightweight and portable.  Very good buy.  I would definitely recommend this product.", "Title": "Samsung Bundle", "Date": "April 22, 2014"}, {"Author": "Jordan Moore", "ReviewID": "R7EF0QO0T7YYG", "Overall": "5.0", "Content": "Love this product I use it every day for work,school, and personal stuff. The product arrived on time and in perfect condition.", "Title": "Awesome", "Date": "April 14, 2014"}, {"Author": "Teffany", "ReviewID": "R21G6YEE1FZBJ5", "Overall": "5.0", "Content": "Great bundle! I am inseperable from this tablet, it does everything better than my 2 year old laptop.  The accessories are great too.  They make working or typing from a tabletop easy.", "Title": "I am inseperable from this tablet", "Date": "April 9, 2014"}, {"Author": "Amazon Customer \"sonothsouth\"", "ReviewID": "R3PA2XGVWQ7I2H", "Overall": "5.0", "Content": "I already had a Samsung tablet and my wife really liked it so I got her one for Christmas and the bundle was the best buy.", "Title": "Pretty good buy.", "Date": "January 28, 2014"}, {"Author": "anonymous", "ReviewID": "R3DTI5OUARBLWR", "Overall": "2.0", "Content": "It was not clear when ordering this Samsung that the keyboard didn't completely attach to the tablet for multiple uses. I was looking for one that attached and actually closed when not in use. Was able to find one that was more suiting to my needs.", "Title": "Samsung Galaxy Tab 2 Bundle", "Date": "January 26, 2014"}, {"Author": "BETTY LENTZ", "ReviewID": "RW3N97SIGBKB9", "Overall": "5.0", "Content": "the product is great for the price and works well for what i pruchased it for, i would purchase and another.", "Title": "just what my husband wanted", "Date": "January 24, 2014"}, {"Author": "LeAnn Hall Lary \"LeAnn Hall Lary\"", "ReviewID": "R38YKPQP2DBKGB", "Overall": "5.0", "Content": "My son started college this year and found that this tablet is very easy to use. Adding and using the schools apps is a breeze. Downloading the school's digital text books was easy and are pleasant on the eyes when reading. He is able to access all the school links and websites and email account. The school's calendar linked with no problem. So far he has had no bad experiences using this tablet. He also watches movies and plays several games.", "Title": "Great for College Students", "Date": "January 16, 2014"}, {"Author": "Elaine McKee", "ReviewID": "R3HWCGHWYUR8JE", "Overall": "5.0", "Content": "Being a student, this is a great mini-computer (with the keyboard) to work on as well as play.Affordably priced in comparison to others!", "Title": "Great package!", "Date": "January 15, 2014"}, {"Author": "Cheryl Spencer \"cds96\"", "ReviewID": "R5U4PW8X6ZVCE", "Overall": "5.0", "Content": "I have found Samsung to be a great tech company. I bought  the Galaxy tab 2 for my wife for Christmas , and it's great.Easy to set up, connected easily to our Wi-Fi network. The thin frame and clear focused screen is easy on the eyes and the clarity is superb . Thanks Samsung for a great product.And thank you to Amazon for speedy delivery at Christmas time and for being a good shopping experience.", "Title": "Galaxy, out of this world", "Date": "January 12, 2014"}, {"Author": "mary123", "ReviewID": "RFGGEFSAOBKO", "Overall": "5.0", "Content": "excellent product. totally met expectations.  tablet is addictive!  could use a Bluetooth mouse  with keyboard. dock is great to use tablet as monitor.", "Title": "love it", "Date": "January 11, 2014"}, {"Author": "linda lee", "ReviewID": "R2MZDEM63X9NEE", "Overall": "4.0", "Content": "bought this for my husband for Christmas. He's always used a pc but likes this very much. Only negative would be the shortness of the power cord.", "Title": "Likes it", "Date": "January 10, 2014"}, {"Author": "L. Chance", "ReviewID": "R1BAEZZL90J819", "Overall": "5.0", "Content": "The tablet and accessories arrived safely and on time. The tablet words beautifully. I purchased a cover separately from the tablet combo.  The shipping box had the original sealing tape on the outside, but the seal was broken on the tablet box inside the shipping box. The cover that comes with the tablet was missing.", "Title": "Tablet", "Date": "January 10, 2014"}, {"Author": "Sery", "ReviewID": "R1J8E9PFMKYAXE", "Overall": "5.0", "Content": "It works great! I can do everything with it. The only thing that I have changed is a few apps that i dont need and the open office i changed it for Kingsoft office and .. yes. It's a bit of heaven. - For the time to charge it, i had some issues but aparently it depends on the power of the outlet so that is fixed.", "Title": "Im in love with it! (L)", "Date": "January 9, 2014"}, {"Author": "cowgirl11", "ReviewID": "R13IYB12ZAPUJD", "Overall": "5.0", "Content": "The tablet was great just wasn't what I needed for work. I need something more to run our apps here at work.", "Title": "Samsung Galaxy Tab 2 Bundle: 10.1-Inch 16 GB Tablet (White)", "Date": "October 17, 2013"}, {"Author": "cman", "ReviewID": "R14HTL39JFGMXE", "Overall": "4.0", "Content": "Great piece of gear.  Lacked instructions and I could not find user manual online.  Impressed with product but not iformation on it.", "Title": "product is ok", "Date": "October 16, 2013"}, {"Author": "Kathleen Philbroom", "ReviewID": "RKP86JCS7M6X1", "Overall": "5.0", "Content": "I bought the Galaxy for my husband. He love it and I get to have my lapt top back. Thank you", "Title": "tab", "Date": "October 8, 2013"}, {"Author": "travis", "ReviewID": "R2JA48QE607CJ1", "Overall": "5.0", "Content": "Thanks my son likes and enjoys it a lot it is allhe had been lookin for much better than the kindle he was lookong at", "Title": "Thanks", "Date": "October 7, 2013"}, {"Author": "Gonzalo Pérez D'Angelo", "ReviewID": "R24KH84IL7LRGS", "Overall": "4.0", "Content": "Fast enough, and convenient for familiar use, my kids love it. the keyboard is very easy to connect to the tablet and the docking is useful.", "Title": "Good for family use", "Date": "October 3, 2013"}, {"Author": "Ann Moore", "ReviewID": "RLH0A01TX5Y6G", "Overall": "3.0", "Content": "I bought this as a gift for my daughter and the keyboard doesn't work.  Not much of a gift if you have to send it back right off the bat.  Very disappointing.", "Title": "very disappointed at the opening", "Date": "December 31, 2013"}, {"Author": "2204rob", "ReviewID": "R1VWIO5XIKRIXZ", "Overall": "4.0", "Content": "Love it. Works well and as advertised. I think it works as well as my friends Apples ... but with the Android platform I am used to", "Title": "Good buy.", "Date": "December 1, 2013"}, {"Author": "Morland Williams", "ReviewID": "R302KVT4E6OBP3", "Overall": "4.0", "Content": "No regrets. Software Applications are nice. display and graphics clear. seem to be a robust product. Hardly use the keyboard though!", "Title": "A Good Buy", "Date": "November 15, 2013"}, {"Author": "Thomas E. Elam", "ReviewID": "R3ILXRVGVEOZ0B", "Overall": "5.0", "Content": "Nice tablet, bought it for the wife's birthday. She loves it. We use these devices for Kindle reading, light web browsing and e-mail. Wonderful to take on the road instead of a laptop.This bundle was about the same price as the same machine without the keyboard. Great vale.", "Title": "Great value", "Date": "October 20, 2013"}, {"Author": "Lyneer Banks", "ReviewID": "RVO4W281KWEDP", "Overall": "1.0", "Content": "When I received my Samsung Galaxy 10in tab in October I absolutely LOVED IT...well here it is December...& my Galaxy tab has died!...why?...I guess I'll have to send it back...so sad because I REALLY enjoyed it...when it was \"alive\"", "Title": "Samsung Galaxy Death!", "Date": "December 7, 2013"}, {"Author": "Ray Sundar", "ReviewID": "RUQS4IPJLOI9Y", "Overall": "3.0", "Content": "Just good for browsing web.does  not easily connect to networked devices at home.Need special apps for any thing one wants to do.", "Title": "ok", "Date": "October 14, 2013"}, {"Author": "Nujeth Navarro", "ReviewID": "R358DIC90GI5ZK", "Overall": "5.0", "Content": "Hello Guys , I like and recommend this supplier , everything was in perfect conditions as well the time of delivery which is very important.The package that they offered was just right and fare for the price, especially because when you realize that you are a owner of a tablet you will need a stand and the keyboard will be the compliment.Continue with the Good Job", "Title": "Excellent Service", "Date": "September 23, 2013"}, {"Author": "Peninsula Par", "ReviewID": "R1BV7KPM2GVTET", "Overall": "2.0", "Content": "Just as the title above speaks, when I opened the box I find I have the student edition. In the Amazon description of products it did not mention that it was a student edition. That was shabby and misleading, unlike Amazon.", "Title": "Galaxy Tab 2 Bundle 10 inch", "Date": "October 5, 2013"}, {"Author": "Randy Sprague", "ReviewID": "R3PFA4BWTZQ53O", "Overall": "2.0", "Content": "shows networks available, but when you try to connect states that the network is not available. I have not tried other networks like McDonalds, etcc.", "Title": "wlll not sync with home wireless network", "Date": "October 14, 2013"}, {"Author": "Wendy Ann Walker", "ReviewID": "R1392T0H41JUNC", "Overall": "1.0", "Content": "Why aren't they disclosing this?Does anyone know what the student edition lacks from the regular edition?Or perhaps the Bundle with keyboard is Why they're calling this the Student Edition but tablet itself is exactly the same?", "Title": "Ordered and received.  Box says Student Edition. This is not disclosed.", "Date": "December 16, 2013"}, {"Author": "Anna", "ReviewID": "R1VL0MGACGH3CL", "Overall": "5.0", "Content": "MI ESPOSA ME DIJO QUE LA COMPRARA POR EL COMBO CON EL QUE VENIA...... TENIA BUENAS EXPECTATIVAS DEL PRODUCTO...PERO CUANDO LLEGO A MIS MANOS...SOLO PUEDO DECIR QUE ES EXCELENTE.....MUY BUENOS GRÁFICOS....BUEN VOLUMEN.....EXCELENTE INTERFAZ....EL TECLADO ES UNA MARAVILLA ADEMAS EL TECLADO LO PUEDO USAR CON MI COMPUTADORA, CELULAR GALAXY NOTE....LA BASE PARA ESCRITORIO ES EXCELENTE EN LA HORA DE HACER TRABAJOS Y PUEDO COLOCAR MIS AUDIFONOS O COMPONENTE EN SU SALIDA DE AUDIO.....MUY BUEN PRODUCTO...LO RECOMIENDO MUCHO E INCLUSO PARA LOS NIÑOS ES EXCELENTE CON LOS JUEGOS DIDÁCTICOS......VALE LA PENA EL PRECIO.......YO SOY DE ECUADOR-GALÁPAGOS.....FELICIDADES.", "Title": "EXCELENTE TABLETA...........", "Date": "September 26, 2013"}, {"Author": "lovebrits", "ReviewID": "R2SPW7B8Q8FMOE", "Overall": "4.0", "Content": "Good value for money, but I would rather have had the Dell 32GB for$299.00 that came out after I bought this bundle.  The extras are nice, but I would rather have the better tablet and bought the extras later.The tablet is a good tablet, but it does not have Microsoft office or the higher GB.", "Title": "Nice bundle package", "Date": "August 22, 2013"}, {"Author": "Anthony Gintoli", "ReviewID": "R3JSTTAJW433TC", "Overall": "3.0", "Content": "Not bad, not great. I'm an iPhone user and feel I should have held out for an iPad.  That alone does not make this bad, I just need to learn a new OS.", "Title": "Not bad", "Date": "September 22, 2013"}, {"Author": "mboko", "ReviewID": "R2N23XI3X7XHS0", "Overall": "1.0", "Content": "product broke in less than 1/12 months, would not charge or connect to computer, driver issues.  should have ordered ipad.", "Title": "stay away FROM SAMSUNG", "Date": "December 7, 2013"}, {"Author": "Jason", "ReviewID": "R24U699J2V3JWU", "Overall": "2.0", "Content": "It looked like it had been opened, the reaction time on the screen was slow, the USB port required a special adapter that I could only find by ordering it through Walmart. I don't know why they didn't put it on the docking station?I sent it back, spent the $200 more and got the IPAD 4 with retina display, light years better!", "Title": "Its an ok alternative to the Ipad.", "Date": "September 4, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00DQ5LSO8", "Features": null, "ImgURL": null, "Name": null}}