{"Reviews": [{"Author": "bob", "ReviewID": "R2NW48P7E3ZDE4", "Overall": "3.0", "Content": "I bought this tablet a week ago and I'm not sure yet how to rate it.  I am having problems streaming live news programs through the HDMI port.  The live stream will start and then quit in a second or two.  I've tried changing the resolution but no help.  The browser is a bit clutzy and the touch does not work as well as I would have expected.  Might be my fingers so a little more experience with it may help.  It has the features I wanted.  Now the question is will they work.", "Title": "Not too Sure", "Date": "August 6, 2013"}, {"Author": "Earl Wells \"brotherman\"", "ReviewID": "R1C3MN76GG6ZO8", "Overall": "5.0", "Content": "this tablet is nice, it work well, its fast, slim, light weight, and functions very well. I see no problems", "Title": "this tablet works very good", "Date": "December 5, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1KZ1GEEXNW2WC", "Overall": "2.0", "Content": "The Tivax got 2 stars because I got a good price on this inferior tablet at local Office Max  If someone has never had a quality tablet they might think this spotty performance, slow dinosaur is acceptable.  However, having previously had a name brand small tablet I'm aware of a what a work horse they can be.  If I can I'm going to take it back and get a refund or exchange.  I spent about 5 hours last night trying to get the Kindle for Android to work and thus access a large library of books I've purchased from Amazon.  It appears to download the app but when you open the app to read a book, it shuts the system down.  After an hour this morning of the same, trying every fix I can think of or find, I realize I can't have a tablet that doesn't allow me to read my books.The sound is limited I can't turn the volume up loudly enough to hear it, now that I loaded some pictures on it, its operating extremely slow.  I used my previous tablet constantly--this one, will sit unused because it is so slow.  Once again is a reminder of the folly of buying a Chinese manufactured off brand that price sucks a person in because of price.  The owners manual is tiny, no helpful information there, no trouble shooting.", "Title": "Issues with 10QB", "Date": "June 8, 2014"}, {"Author": "erin", "ReviewID": "R34367CMX7DASI", "Overall": "1.0", "Content": "Awful camera, I mean my goodness,its impossible to get a good picture. WiFi connection is pretty bad too. I'll be right by router and it won't have full reception bars. Super slow. Glitches, freezes. Charging is awful. This is my  second tablet because the first one didn't charge and the headphone  input didn't work properly. Well....thus input still doesn't work and the charging input broke too now. So I have to charge using the mini USB which takes forever!!!!! Meaning turnedf off and plugged in all night and day. Idk why this brand sucks  but they really need to get their ish together. I do not recommend. Do i really need a third one?????", "Title": "dont bother", "Date": "March 22, 2014"}, {"Author": "ShariLee \"Proud Army Wife\"", "ReviewID": "R381XTJM7CVJWE", "Overall": "5.0", "Content": "I purchased this tablet for my 7 year old grand-daughter.  I contacted the seller because I was worried the tablet would not arrive in time. My tablet arrived before the day I thought it would be here. It's a nice tablet for a child or an adult. There are so many apps you can download for free. It's a wonderful gift. Not only does a child spend time playing but they are also learning. I love it the best when we are waiting at the doctors or some other appt. My grand-daughter sits quietly playing on her tablet. Also, the Inferno Market company are great about working with you and helping resolve any possible problem..", "Title": "Like tablet with a good price", "Date": "March 21, 2014"}, {"Author": "Richard Ellison", "ReviewID": "R459ARWONL2AB", "Overall": "4.0", "Content": "I replied to one other review about this tablet.  I was using this last night and found a few more things a would have liked to have seen.first there is no led light or sound telling you its fully charged,. For the price I paid ($300.00) it shouldhave come with all the cables , the adapter cord should have been much longer ,why they installed this I don't know when all you need to do is plug into the USB to charge. It likes to freeze up upond touching the keypad from time to time . Oh one more thing the camera icon....it should have been put some place else, because I hit it from time to time and end up with pictures I never wanted. If your willing to look pass these things I say get :-)", "Title": "It has a few bumps but ,it ok", "Date": "January 26, 2014"}, {"Author": "Mark", "ReviewID": "R2F2TTXBK6DJIF", "Overall": "4.0", "Content": "Tivax MiTraveler 10Q8 10-Inch 8 GB TabletPro:  It has Google Play, iPad lookalike, sturdy-looking design, its features.Con:  Lags sometimes, poor WiFi reception, high privilege mode, capacitive touchscreen issue, short battery life, security screen lock missing, charges very slow, and features.Tivax MiTraveler 10Q8 10-Inch 8 GB Tablet is generic tablet running on android 4.1 version. From afar, it looks like an iPad.  When touched upon, It feels like sturdy and quality-made product.  It has google play.  It has good features that I wanted:  miniUSB port, miniHDMI port, mic, microSD card slot, front and rear camera, screenshot button, capacitive touchscreen, and able to create portable Wifi hotspot.  No bluetooth.  Sound quality is great and clear, but then I'm kinda have hearing problems. The screen is bright and vivid.  It is so bright that I have to dim down it to the lowest setting to be comfortable on my eyes.  It kinda burns my eyes because its too bright for me. The security screen lock feature is missing.  It is present (somewhere), but I was unable to find the button to either turn it off or change the password.  You can activate it by going to => settings => VPN .Its processor is Quad Core and its ram is about 684MB (according to Clean Master app).  It runs better than my smartphone: samsung stratosphere.  Its performance is ok...  it lags from time to time.  Whenever I surfed the internet, use apps or play games, it lags sometimes... especially when you are doing something else and then apps are currently updating in the background (lag spike!).  Its capacitive touchscreen is ok.. sometimes it does not respond to my touch.  Its annoying when I'm playing a game that require constant touching/swiping.  I am considered to be heavy user tablet (for now Dec 2013), so I think this tablet only have 3-4 hours battery life.I think that it has poor wifi reception, because even when this tablet connects to a particular wifi hotspot with 2 or less bars wifi strength.  Internet is either super slow/unresponsive or no connection. Either forget that wifi hotspot and find another better wifi hotspot, or move closer to the router.Its charging rate is very slow about 5-6 hours when the tablet is inactive or in airplane mode.  I don't think its charging while I'm using it especially when connected to the internet.Since this tablet is pre-rooted.. (I think) and if you're using AVG antivirus app. AVG probably will send you a message that this tablet is running in high privilege mode and considered to be a threat.  I think its false alarm.  Try using Avast or other antivirus.  I use Avast and it says the tablet is fine.As I stated about features before, this tablet has miniUSB and miniHDMI which are cool, but problem is I don't have those cables. I only have microUSB and microHDMI cables.  I guess that I have to pay more to get the correct cables.I will recommend this tablet if you are very tolerate person with low expectation and will only use this tablet for light use of checking email, surfing internet and watching videos.  Moderate/Heavy users or someone with high expectations of performance tablets, you're better off buying popular high-end brand name tablets.", "Title": "Tivax MiTraveler 10Q8 10-Inch 8 GB Tablet", "Date": "December 21, 2013"}, {"Author": "Owyn999", "ReviewID": "R4J2BIJZ357KD", "Overall": "5.0", "Content": "I got this from Office Max about two weeks ago.  At first before I saw it I was worried about the price and size considering the specs.  So far I have put it through a few runs of moderate use and have found the battery to be of a fair quality.I have one or two gripes about it but for the most part I have found this tab to be very solid.  My main complaint is the brightness, it seems a little bit dim even at full bright.  Though this isn't too bad considering that I bought it for another device.  Another great thing is that this device comes pre-rooted, and with the Play Store installed and fully functional.  I haven't had the chance to run full battery tests on time yet but from what I have seen with moderate useage you can get at least 3-4 hours out of the device.I plan on running a few tests to see what exactly we are talking about in terms of battery life but so far I am sorely impressed by a company that I never even knew existed.", "Title": "Bought this a couple weeks ago at OfficeMax", "Date": "August 5, 2013"}, {"Author": "Jay", "ReviewID": "RT1C1MXCFDFT9", "Overall": "1.0", "Content": "Bought this model from my local store. As many of the generic Android tablets attached with a random manufacture. It is very, very, very slow. I'm shocked it can even run 4.1. I had to download a task killer just so I can get through 1 function at a time. No HDMI port, bad Wi-Fi internal adapter, poor reception, dim screen, poor made power input and even the power button gets stuck from time to time. Most of the Apps pre-installed it cannot support.", "Title": "Not worth it...", "Date": "September 17, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00DQ6236E", "Features": null, "ImgURL": null, "Name": null}}