{"Reviews": [{"Author": "Rebecca Seymour", "ReviewID": "R3PUX2EH8UY99P", "Overall": "5.0", "Content": "Got these for my twin 9 year olds who constantly play games on my iPad. Such a great deal, and does everything a 9 year old would want.", "Title": "Great product, great price!!", "Date": "January 7, 2014"}, {"Author": "John B.", "ReviewID": "R2WSX5JYBA4C8S", "Overall": "5.0", "Content": "I love this tablet among all of my devices. It is quick and very user friendly without the gimmicks in other quick to market and cheap tablets. It has not failed me one time,and I really recommend it to anyone just starting out in the tablet market. I love it, love it, love it and you will too!", "Title": "This is the greatest of the mid price android tablets", "Date": "January 4, 2014"}, {"Author": "Alex", "ReviewID": "RGYFGOGOKLAG8", "Overall": "5.0", "Content": "Great size, great features, high quality material and make for the price.Worked like a charm straight out of the box.Every App I've installed works great and I don't see it having any trouble in the future.I bought a universal tablet case, and a messenger bag to keep this baby safe.I look forward to using it everywhere.", "Title": "Great entry level Tablet, worked straight out of the box", "Date": "February 20, 2014"}, {"Author": "MICHAEL J BENNIE", "ReviewID": "R8EJ3CTCTF76E", "Overall": "5.0", "Content": "Very functional tablet for the price. No complaints. I originally spent $60 for a laggy, crash-prone, barely workable tablet on nomorerack, but returned it and got this one, which was well worth the extra $40. Kids are happy now.", "Title": "solid 7\" tablet for good price", "Date": "February 23, 2014"}, {"Author": "Tim Crump", "ReviewID": "R1IDZU4GNQ25HL", "Overall": "2.0", "Content": "I like my tablet, but I have had some issues with it and when I tried to email the company about it I did not get a reply?  Some application functions only work when I stand it on end, and the sd card I inserted will not come back out?", "Title": "non responsive tech support:", "Date": "February 11, 2014"}, {"Author": "Rema Beamer", "ReviewID": "R1BXNTV5JIRGTU", "Overall": "5.0", "Content": "I bought this for my son and he loves it. Does exactly what he wanted it to do. He mainly uses it for Netflix.", "Title": "Great Tablet", "Date": "January 27, 2014"}, {"Author": "Stanley J. Sulewski \"Stan JS\"", "ReviewID": "R3JNW1BFAAU7XO", "Overall": "5.0", "Content": "If I have a problem with any of these tablets I have a problem with the Android OS, not with the tablet. It's simple things I don't like. The book reading app had me going nuts when I picked the tablet up and my thumb changed the brightness setting and it ended up being too dim. I hit the brightness control everywhere I could find it but it was still too dim. After messing with it for a long time I found out that there was a second brightness control in the reading app as well as the main brightness control. The second control might have been part of the Amazon book reader app but not knowing that can have you chasing your own tail for a long time.  I found it by accident and I set the brightness to the way I like it. The tablet itself is a winner. I can't find a flaw with it so far. I'm glad that I chose this tablet with the 1GB RAM. I think that the tablets with 512MB RAM could end up slowing down or locking up. When I set up a new PC I always install as much RAM as the mother board will recognize. A tablet is a small PC after all and they run better with more RAM. In the end I think the 7\" Latte is a great little tablet. I'm glad that I purchased it instead of any of the others. I purchased a second Latte for my son as well. It's a nice little machine!", "Title": "Works great.", "Date": "April 12, 2014"}, {"Author": "Ruben Dario Perez", "ReviewID": "R2NI3EIO3RB8CR", "Overall": "5.0", "Content": "I love this Tablet, its compact size and weight. It fits perfectly into what I want. Applications that are installed by default, are enough for me. I was very pleased with this product.", "Title": "I love this Tablet", "Date": "March 20, 2014"}, {"Author": "Louise Davis", "ReviewID": "RQG96IFUP3C7T", "Overall": "2.0", "Content": "I like the tablet.  Its functions are good except for the battery.  The power does not last the five hours it is supposed to last.  In around two hours of use the tablet starts running wild, flashing different possts on it.", "Title": "convenience", "Date": "February 27, 2014"}, {"Author": "Prime MiMom", "ReviewID": "R1LHL1QARRZ4N4", "Overall": "5.0", "Content": "Our son loves it. It does all he wants and more.  Charges pretty quickly. Was a GREAT price and deal! Very happy. Was a great transition from just a phone without buying a laptop.", "Title": "Everything he wanted", "Date": "February 20, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00DT2054W", "Features": null, "ImgURL": null, "Name": null}}