{"Reviews": [{"Author": "Judith Christian \"JCisDway\"", "ReviewID": "R1QE87029O5RVG", "Overall": "3.0", "Content": "Some apps didn't work unless I had it turned a specific way once I learned that it was smooth sailing.", "Title": "It works ok", "Date": "August 15, 2013"}, {"Author": "love tennessee", "ReviewID": "R26NTGXWVRRJPR", "Overall": "1.0", "Content": "DO NOT BUY THIS IT IS A SCAM, IT WORKS FOR A FEW DAYS THEN STOPS, YOU CANT REACH ANYONE TO HELP YOU AND ITS MORE HASSLE TRYING TO RETURN IT, SO JUST BUY SOMETHING ELSE IF YOU WANT IT TO WORK, MY DAUGHTER IN LAW HATES IT WILL NOT EVER REBUY", "Title": "dont", "Date": "August 15, 2013"}, {"Author": "Kathski", "ReviewID": "R21M7FH0GO8K3T", "Overall": "3.0", "Content": "Bought this April 13, 2013. So far, my son loves it. Its still working great til now, its fast, and easy to use. The only complaint we have is somehow whenever my son is using this for browsing the web or watching videos, it seems to suck up all the internet bandwidth as any other device (laptop, phone, or tv) that uses our wireless internet as well tends to not be able to connect at all.", "Title": "works great except it eats up the internet bandwidth", "Date": "August 12, 2013"}, {"Author": "linda", "ReviewID": "R2Y58EBIZ1E5J0", "Overall": "2.0", "Content": "1)  Tried to find some directions for setup and options - found very little.  Would still be nice to get info on this Tablet.2)  Pressing Keys to bring up different app or screen - Very slow or not at all to switch screens - Very disappointed.3)  Would like to return it and use my $30.00 credit on something else.", "Title": "Zeepad 7\" Allwinner Tablet", "Date": "July 26, 2013"}, {"Author": "ASHTEK", "ReviewID": "R1DD6JZNU1QEVL", "Overall": "1.0", "Content": "It is not a zeepad. ordered this for my daughters birthday, what I got is a knock off of a zeepad. It was just too late to return it, at least it looked good when she got to open it.", "Title": "Item received is not the item listed or pictured.", "Date": "July 25, 2013"}, {"Author": "willy sanchez", "ReviewID": "R1VBBB5I0J4WHS", "Overall": "2.0", "Content": "The team is not charging, apparently the current power makes bad wine or port of the tablet is damaged, I will buy another power cable to check if it is the port that is damaged", "Title": "Damaged Charging Port", "Date": "July 25, 2013"}, {"Author": "Denise B", "ReviewID": "R5W40RABO55E6", "Overall": "2.0", "Content": "The touch screen is often very delayed. The wifi is weak . The browser often closes. I guess  you get what you pay for.", "Title": "very disappointed", "Date": "July 23, 2013"}, {"Author": "Tim \"Timdiana\" Dunn", "ReviewID": "R28406GGQD7POE", "Overall": "5.0", "Content": "I really like this android. I'm surprised at how well the operation work , such as streaming Netflix, being able to talk on Skype; and connecting to the AccuRave ELM327 Bluetooth OBD2 Diagnostic Code Scanner - Scan Tool Check Engine Light CAR Code Reader - Android Compatible. It may not look it, but this android is fantastic. I highly recommend getting it.", "Title": "Great", "Date": "July 23, 2013"}, {"Author": "robin cedrone", "ReviewID": "R1KTOYP9HZN9JP", "Overall": "1.0", "Content": "this Zeepad, is not what i thought it was. it was cheaply made. not only that it cost me 30 dollars to return it to China, and they kept saying they never got it back. they still have not got it back so Amazon was kind enough to not only reimburse me for the shipping and handling, but they also gave me my money back. I would look for where they are shipping your item from because if i knew it was china, i would not have ordered it. they promised to reimburse me for shipping and handling, then reneged on their promise.", "Title": "cheap", "Date": "July 22, 2013"}, {"Author": "Dionne N.", "ReviewID": "R321UJ5S367MVW", "Overall": "1.0", "Content": "I should have took the advise form the others and not bought it! It worked for only a weekand stopped working. I'm in the process of trying to return it.", "Title": "It broke in 2 weeks", "Date": "July 22, 2013"}, {"Author": "Honey Bunny", "ReviewID": "R1DNM1KQUPCP99", "Overall": "5.0", "Content": "I love this product. The speed and accuracy of which it was received was unbelievable. This was the first purchase that I have made with Amazon and I dare to say that this will be one of many. Great job! Awesome product and service.", "Title": "Zee Pad 7.0", "Date": "July 22, 2013"}, {"Author": "Mom of 2", "ReviewID": "R1ULE9TOGAIO9E", "Overall": "2.0", "Content": "We bought these for each of our girls for Christmas.  They can barely play any games on them.  The screens black out and processor cannot keep up.  Our 6 year old actually called it a 'fake tablet'.  It is.  We were excited to present these to them, but they were just a waste.  We have really tried to get them to work.  Battery is great on them though, but its probably because they cant really play anything!", "Title": "works, but barely", "Date": "July 22, 2013"}, {"Author": "Family's kindle", "ReviewID": "R1TMXW9VJB2B2D", "Overall": "5.0", "Content": "i am getting this tablet next week and i was worndering can i go om instergram and twitter and facebook and can i take videos too??", "Title": "please answer me", "Date": "July 22, 2013"}, {"Author": "Beverley Pomeroy  Beverley Pomeroy", "ReviewID": "R1GCQJJSEWSE8Q", "Overall": "5.0", "Content": "it was what she thought it would be... she uses it daily..she loves it....  i have been thinking about getting one", "Title": "it was pink and what we thought it would be....  she wanted a tablet but this was cheaper and does the same thing", "Date": "February 21, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00DCE8JLS", "Features": null, "ImgURL": null, "Name": null}}