{"Reviews": [{"Author": "K. Fengler", "ReviewID": "R4BDZ3JN9GQWX", "Overall": "5.0", "Content": "Does what I want it to do. It's an addition to my Galaxy S4 and together they work well and makes what I us them for easier. The price was the best I've found.", "Title": "Great tablet for te money.", "Date": "January 19, 2014"}, {"Author": "victoria Xochilt Guevara", "ReviewID": "RQKTBEUP4HZ0L", "Overall": "5.0", "Content": "It is comfortable to use and really fast. All task are greatly done and it is easy to go from one app to another.", "Title": "Great Tablet", "Date": "January 19, 2014"}, {"Author": "John Clayman", "ReviewID": "R22APD58FYONWO", "Overall": "5.0", "Content": "I had a Samsung Galaxy Tab 10.1 - version one.  It was good and lasted well; however I wanted a new one before it stopped working so I traded it in and bought this Tab 3 8\".  Faster.  Great screen.  Small and fits in one hand well.", "Title": "Samsung Galaxy Tab 3 8\"", "Date": "January 18, 2014"}, {"Author": "R. Sullivan \"Gina\"", "ReviewID": "R1PXMSOUDLU7JO", "Overall": "5.0", "Content": "I thought the 8 inch screen might be too small, but didn't want to lug around a big screen model.  The size is perfect!  Fast and easy for any Android user.  Easy access to settings with pull down menu, easy to pair with bluetooth devices, easy to connect to my Android phone that I use for mobile hotspot, and the Google speak works very well and rarely has trouble deciphering what I am saying.  I'd recommend only the Samsung official cover though, available at Samsung.com.", "Title": "LOVE it!", "Date": "January 18, 2014"}, {"Author": "Pegster59070", "ReviewID": "RNDU2XEWBMWMO", "Overall": "4.0", "Content": "My 13 year old loves her new Tab 3!  This was a replacement for the Tab 2.  The graphics are much better, the speed is better - all around I would have to say it's an improvement over the Tab 2.The only disappointment I've encountered with this is the offer of free Hulu Plus - that has become a headache.  I have had so much difficulty getting the tablet registered with Samsung.  I have contacted their Live Chat 3 times and gotten 3 different answers.  Tried calling but got passed from one rep to another and just overall disappointed with that entire aspect.  So - good luck on trying to get your free Hulu Plus and/or Boingo!If it weren't for the hassles with Samsung Customer Service I would have rated this tablet a 5 star.", "Title": "13 year old is loving it!", "Date": "January 17, 2014"}, {"Author": "stevef", "ReviewID": "R3VE0IC6MOB09G", "Overall": "5.0", "Content": "I bought this for my wife for Christmas, she told me she hasn't found anything on it that she doesn't like. I asked her on a 10 scale how she would rate it and she said a definite 10! I did a lot of shopping around and as usual Amazon had the best price and It got delivered in time for Christmas. One of the main things she liked was the 8 inch size versus the 7 inch. With no tax and on time free shipping who could ask for anything more.", "Title": "She love's it!", "Date": "January 14, 2014"}, {"Author": "Angir Mitra", "ReviewID": "R3HJ2QQU2X7MC7", "Overall": "5.0", "Content": "I bought this on Black Friday sale from a store and have been using it extensively for last few weeks. Till now it's held up pretty good with no crashes even while being heavily loaded with games and apps.Main reason why I bought this:1. Screen size of 8in is just right for reading/gaming/surfing. Not too big/heavy as a 10in and nicer than a 7in. I could have bought the 7in also but this is only slightly heavier and has much better hardware. Its easy to hold for long reading hours.2. More RAM/Memory + good CPU means better gaming experience and no lags during surfing/movies.3. I don't a personal PC/Laptop right now (2 office ones). So I use this one for surfing, personal mails, games, etc.4. I read lots of comics and magazines. This is where this excels. Bright colors and very vivid.Rest of advantages you can check from other reviews.Cons:None really. Though it would have been good if back cover could be opened, but its sealed tight. So no getting to the battery. Side buttons seem bit too thin at times (but Tabs really slim which is plus).Must have add-ons which I bought on Amazon : 1) Screen Guard (ArmorSuit MilitaryShield - 4*), 2) Good Case (MoKo Samsung Galaxy Tab 3 8.0 Case - 5*), 3) Micro SD (SanDisk Ultra 16 GB MicroSDHC Class 10 - 5*, fast but later regretted not buying 32 Gbs)My frequently used Android Apps : Perfect Viewer for Comics/Mags (great app), Dead Trigger 2 (plays very smooth), Injustice.., Skype, WeChat, PvZ2, etc. All working fine with no lags. Hope this helps.", "Title": "An excellent all purpose Tab", "Date": "January 14, 2014"}, {"Author": "W. Fondren", "ReviewID": "R3KLENU8CWZSDX", "Overall": "5.0", "Content": "I've owned two 7\" tablets that I enjoyed and was very surprised at what a difference the extra screen space made. The screen display is beautiful and the touch very responsive. I'm not crazy about Samsung's Touchwhiz, but I'll fix that loading a custom ROM soon. The tablet size is ideal for using and carrying. I looked at a lot of different tablets and none offered so much for this price.The brown/gold looks very nice. Several people have complimented me on how nice it looks. I'm very satisfied.", "Title": "Exactly what I wanted", "Date": "January 10, 2014"}, {"Author": "Laura", "ReviewID": "R2WFMF10U1L8VG", "Overall": "5.0", "Content": "great love the product no issues with it very clear well worth the money great size and all...!! thanks you", "Title": "great", "Date": "January 9, 2014"}, {"Author": "LarryS", "ReviewID": "R2XF95UOE8P99Z", "Overall": "5.0", "Content": "I've used this tablet now for a little over a week and I'm impressed. The early media reviews of this unit are no longer valid wrt performance issues - performance is fine even with running multi-window. Also, the extra inch over the Nexus 7 make a big difference for me beside my requirement that a tablet needs to have an SD card. It's also nice that I can make the Tab 3 look just like my Galaxy S4 phone.  My only nit with the tablet is that I couldn't get the SD card to \"latch\" using my finger nail. I had to get a small screwdriver to push the SD card all the way in. Chomecast from this device works great, too!", "Title": "Excellent tablet", "Date": "January 9, 2014"}, {"Author": "Joe", "ReviewID": "R325USARS1IVQD", "Overall": "5.0", "Content": "I was skeptical of buying this tablet because I was waiting for the new Nexus 7 to come out.  Eventually, the anticipation was killing me, so I went for it and bought the Tab 3.  From a technical standpoint, the Tab 3 isn't that eye-popping.  It may not have the quad-core processor or highest resolution screen available, but it is a quality tablet that is the perfect size.  Compared to my 7 inch tablet, the extra inch goes a long way.  It is great for watching Netflix or surfing the web.I would recommend this tablet to anyone.  It has a great look, is light in weight, and has a big screen that can still fit in your pocket when you need it to.  This thing is great!", "Title": "The 8\" is perfect! Stop waiting for the new Nexus and get one!", "Date": "August 19, 2013"}, {"Author": "Alain A. Mccallum \"chi11_factor\"", "ReviewID": "RMW3MLCYN0S", "Overall": "5.0", "Content": "I got this the first day it came out and i must say, i find it extremely hard to put down. It's light, sleek, fast and just downright gorgeous. Samsung products just keeps getting better and better, i bought the tab 2 7.0 as a present for my girlfriend a few months ago and i was extremely impress that i even find myself a little jealous. However the tab 3 8.0 is on another level, it's not too small or too big, it's the perfect size. It fits in my hand perfectly, but my hands are a little big. I am so impress with this device that it completely convinced me that i need to get a Galaxy S4.", "Title": "Awesome Tablet", "Date": "July 13, 2013"}, {"Author": "Kelly", "ReviewID": "R22ZCYA54N0RXE", "Overall": "5.0", "Content": "I've had this tab for a few days and I am a little obsessed with it. It's always in my hand. You get everything listed and more. This will be a great tool for work, travel, and play.I chose the 8 inch as a compromise between my small hands and my husband's large hands. Also, the 10.0 was a little heavy for us as we would be holding it with one hand for long periods of time while teaching. The multi screen feature is also great for our uses!The only downside right now is that there aren't any cases for this tab yet. The tab 2 cases for the 7 and 10 fit the tab 3's but because this is a new size I'm left waiting for the accessories to catch up. I'm worried that if the 8 doesn't sell as much there won't be a lot of options in that area.At first I laughed at the $100 price bump for an inch. But after trying out the 10 and the 7 and really thinking through how we would use the tab we made the choice to go with the 8 inch.For us, the 8 was worth it so far.", "Title": "Love it so far!", "Date": "July 12, 2013"}, {"Author": "Pcprntr", "ReviewID": "R9BRVNVRPR0SW", "Overall": "5.0", "Content": "I've owned the ipad 10\" and the nexus 7. This 8\" tablet far excels over  'other manufacterers' tablet products. I switched from the nexus 7 (this time), of which I can say is a 'fairly good' piece of electronics. But... this Samsung Galaxy Tab 3 8\" is truly amazing. And by far has more features than anyone else on the market at this time. As far as my tablet needs go for now. I say... Bye Bye ipad & Bye Bye nexus. Hellooooow Galaxy Tab 3. It's my only choice for a 8\" tablet for my foreseeable future.  GREAT JOB SAMSUNG..!!", "Title": "Best one 'out there' so far!  Really!", "Date": "July 19, 2013"}, {"Author": "Jeff", "ReviewID": "R3SCR88XOO0LY1", "Overall": "5.0", "Content": "I've had a few tablets - starting with the first generation iPad.  I've also owned a BlackBerry Playbook, and the Samsung Galaxy Tab.  Of all three, I consider the Samsung the best!  I like that Samsung includes a microSD card slot - means you can get more storage relatively inexpensively - beats both Apple and BlackBerry - and, unlike BlackBerry, I have confidence that Samsung will be around in five years.  For only having 1.5GB of RAM, the Android OS runs smooth as silk, and the multi window feature is a definite plus - means true multitasking - you can actually be DOING two things at once.", "Title": "Great 8 inch tablet", "Date": "July 18, 2013"}, {"Author": "J. Wong", "ReviewID": "RQK17W1AKM5IJ", "Overall": "5.0", "Content": "Bought it at the brick and mortar store called BB, got to support my local community you know. Well, this gadget is really nice. Sometimes you just want to lay in bed and not hold a 10.1 size tablet and this one is sure to make you happy. The colors are so bright I don't think anyone will have the screen to highest brightness unless they are outdoors. I sold my IPAD 3 to buy this and don't regret it at all, the IPAD retina is overrated, its bland in colors. This one feels like a mini HDTV LEDTV. I also have the Samsung 10.1 Note both in white, I think they make it less industrail looking than black/brown, more like something to have fun with. Samsung is eating Apple's lunch.Sorry to say I have exchanged it for the Note 8.0. Reason-watching YouTube when you switch from landscape to portrait mode the video stops for bit. Drove me nuts, the Note 8.0 does not do this.The 8.0 can be a burden to hold at times I admit. So if I had my wish I wojld take a tab 3 8. With perfect YouTube viewing.", "Title": "Better than IPADs", "Date": "July 17, 2013"}, {"Author": "anzicco", "ReviewID": "R25B83QSUUDLH6", "Overall": "5.0", "Content": "First let me say that until recently, I have been an absolute Apple freak since before the first iPod and still respect the products they have made as innovative and simple to use....the problem is while they have been busy recreating the same thing over and over for the past couple of years now, others, especially Samsung have been building on the innovation and coming out with a wide variety of products that are now technologically more advanced.  Apple prides itself on aesthetics and beauty, but they haven't had much of a hardware change in more than 2 years.  If you want to talk about beauty, The GOLD-BROWN TAB 3 8 inch is perhaps the most beautiful and aesthetically pleasing tablet in its class.I recently upgraded my iPhone4S to a GALAXY S4 and couldn't be more pleased!  Although there is a bit of a learning curve for me in regards to certain Android OS differences from iOS (in particularly  all the settings choices), I am getting the hang of my S4 and have become a bit angry that Apple puts a lot of roadblocks up not allowing android devices direct access to iTunes and the whole Samsung vs. Apple thing that only hurts customers in the long run.  I have begun to find ways around Apple's roadblocks with the many apps that get around Apple's nonsense and allow me access to my music on whatever device I want it on.  My frustration with Apple has now led me to the GALAXY TAB 3 which is slowly replacing my 3rd Generation iPad.  Through Kies, DropBox, Chrome, Google Music, and Polaris suite of apps, I am finding my way into the world of Samsung and the many choices Jelly Bean android allows me to sync and personalize my devices MY WAY, instead of having some Apple designer in his IVES Tower tell me how they want my devices to work!", "Title": "Great Small  8\" Tablet!  An inch does make a difference!", "Date": "July 12, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1O157LKGEM8PG", "Overall": "5.0", "Content": "I never write reviews and I am writing this one from my tab 3. I have the nexus 10 that I am now getting rid of.  The 8 inch is the perfect size and weight. The ir remote  feature is awesome as it can also be my universal remote control, especially when I travel and am in hotels (no need to touch the dirty hotel remote control) and for home as well. This device is truly a perfect life companion. You will not disappointed if you purchase one of these.", "Title": "This tablet is awesome", "Date": "July 10, 2013"}, {"Author": "Neil Martin", "ReviewID": "R10MFW0QYP5GGW", "Overall": "5.0", "Content": "Great tablet! Awesome form and screen quality! Great battery life and performance! Also love the quickness of its performqnce and great wifi connection!", "Title": "Great tablet!", "Date": "June 8, 2014"}, {"Author": "Bernard H.", "ReviewID": "R3S9X04I25S2MB", "Overall": "5.0", "Content": "I totally satisfied with this tablet. I would recommend it to anyone that's in the market for a small tablet. It is a highly functional tablet.", "Title": "I love The Samsung Tab 3 8 inch!", "Date": "June 6, 2014"}, {"Author": "adrienne wise", "ReviewID": "R3GV4LUWQ3KQGX", "Overall": "5.0", "Content": "I absolutely love this tablet! I wanted something I could place in my purse but yet big enough to enjoy. I use everyday for the majority of my internet usage. I watch movies on it from Netflix and the resolution is great. I've received compliments from IPad users who feel they have over paid for the same quality. I highly recommend this tablet.", "Title": "Love it!", "Date": "February 28, 2014"}, {"Author": "Charlotte", "ReviewID": "R3240M42HRWJ2I", "Overall": "5.0", "Content": "This was a gift for my granddaughter to replace her galaxy 7 inch that took a beating. Her response was awesome Grammy !! She loves the size and the capabilities for surfing the web and for mobile apps.", "Title": "Awesome", "Date": "February 26, 2014"}, {"Author": "Kris", "ReviewID": "R85DZVMH4KLKU", "Overall": "5.0", "Content": "This tablet is a great little machine, Easy to use, large screen, great resolution. At times will get slow, but I've found this is because it keeps any program running that you open (so once i figured out how to close them im good). Use it for all kinds of school work: MATLAB, PDF's, sending/receiving documents, email, and some note taking. The response time for note taking (even with a stylus) is not as good so its very hard to write with. Also recently have had trouble with plugging in to charge, the pin connector gets jammed. Overall still a great tablet.", "Title": "Excellent Tablet", "Date": "February 25, 2014"}, {"Author": "Berchman Pinn Jr", "ReviewID": "R1D4VET2B6D8GZ", "Overall": "5.0", "Content": "Loving it !!!!!!!!!! Truly the best tablet I ever purchesd !!!!!!!!!!!! This is something that I deffenitly would recomend to anybody", "Title": "love it", "Date": "February 24, 2014"}, {"Author": "Kristin Donald", "ReviewID": "R1YC98TGWFMA2A", "Overall": "5.0", "Content": "I bought this for my husband and when we got it we could not believe the picture and its size (width). I would recommend this tablet.", "Title": "Light and perfect size", "Date": "February 24, 2014"}, {"Author": "angie", "ReviewID": "R1IDXQW19UUNHM", "Overall": "5.0", "Content": "Perfect. Worth the splurge. I use it everyday and I've had it for around 4 months and its never given me any trouble. The volume of the speakers is great, my apps have never frozen and its the perfect size! The battery life is amazing totally what it says in the product details. I hope it lasts me a long time and when I buy a new one im going Samsung again definately.", "Title": "Love it!!!!", "Date": "February 22, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1MV8P1DJ5MY8F", "Overall": "5.0", "Content": "I recently purchased a Samsung Smart TV they gave me $170 off for a Samsung Galaxy Tab 3 8.0 - so my net cost was $130 (I also own a Samsung galaxy note 2) love their products. The size of this tablet is awesome I wish they will upgrade to Android 4.3 or 4.4 soon! Highly recommend this perfect size tablet it's very fast and fluid!", "Title": "Owner of Apple and Samsung Products", "Date": "February 20, 2014"}, {"Author": "FASV \"FASV\"", "ReviewID": "R17CBLEQR9P3GK", "Overall": "5.0", "Content": "THIS IS MY FIRST TABLET. I LIKE IT BECAUSE IS SMALL, LIGHT, THIN, HAS AN INCREDIBLE HD SCREEN AND MORE IMPORTANTLY IS 1/2 PRICE THAN THE \"A\" BRAND. VERY EASY AND INTUITIVE TO OPERATE. EVEN WITHOUT ANY EXPERIENCE WITH TABLETS ANYONE CAN  USE IT IN A FEW MINUTES.", "Title": "BETTER THAN THE \"A\" BRAND", "Date": "February 18, 2014"}, {"Author": "R. Martinetto", "ReviewID": "R1SQVHOIPJKNQ5", "Overall": "5.0", "Content": "It's a fantastic product. Grate screen resolution, good memory (I expanded it with an 32 GB micro card). Perfect size. Good battery life and PERFECT for travellers.And the prize was even better. I love it.", "Title": "Fantastic item", "Date": "February 17, 2014"}, {"Author": "Uana Wilson", "ReviewID": "R2WXCURCF4GU0L", "Overall": "5.0", "Content": "I'm very please with my Samsung GalaxyTab I still have a lot to learn about it,  It's easy to learn but didn't realize how much fun you can have learning all the different apps to play with.", "Title": "Samsung Galaxy Tab", "Date": "February 17, 2014"}, {"Author": "R. robison", "ReviewID": "R1G962Z30K92OS", "Overall": "4.0", "Content": "Very fadt delivery brand new quality and it does everything I want only wished that in standby mode the battery lasted longer.", "Title": "just what I wanted", "Date": "February 10, 2014"}, {"Author": "Mike", "ReviewID": "R2E6UKFT2IK41E", "Overall": "5.0", "Content": "Bought this for myself for xmas. I love it, very very nice product, fast , good games, great for wifi easy set up wished they would send out a instruction booklet with it . Great for wifi and connects very easily, great price throuigh amazon", "Title": "Very Nice", "Date": "February 1, 2014"}, {"Author": "chun zhang", "ReviewID": "RUF3W0KRTG5R5", "Overall": "5.0", "Content": "This product is really works well. like my htc table. Easy to download apps and run any programs.it's thin cool.", "Title": "just love it.", "Date": "February 1, 2014"}, {"Author": "Brianna Lebkey", "ReviewID": "R2Q8XUM13HBT0C", "Overall": "5.0", "Content": "This tablet is very easy to use especially if you already have a galaxy phone this will be a piece of cake for you to use.The battery life is great im very pleased. Very good screen size not to big not to small just perfect. I also suggest that you order a case on Amazon because I've looked in a lot of stores and have not been able to find a case that is maid for the Samsung Galaxy 3 tablet mostly cases for the iPads .there are some cases that say they fit and 8in tablet but i wouldent risk it .I bought one from Amazon and it fits perfectly.", "Title": "Love this tablet!!!!!!", "Date": "January 31, 2014"}, {"Author": "Robert J. Nielsen", "ReviewID": "RN4W3NLD9ICXH", "Overall": "5.0", "Content": "Just the right size and weight for what I want to use it for. Good size keyboard for large fingers.", "Title": "Easy to view, easy to use.", "Date": "January 27, 2014"}, {"Author": "Crystal Williams", "ReviewID": "R1HETGABXKGRK", "Overall": "5.0", "Content": "The tablet has many things to explore, very good apps, excellent clarity and very good camera. Very addictive and enjoyable.", "Title": "Recommended...", "Date": "January 25, 2014"}, {"Author": "ARL", "ReviewID": "R3IDOUSKT6SRQQ", "Overall": "5.0", "Content": "The reason why i bought this is due to my work and personal needs and found that this device is perfect for my need. The OS is smooth. 6 days shipping from WA to Guam is really fast for me. Price is also reasonable. Size is good,not so small and not so big. This is an amazing device, I love this very much.", "Title": "Perfect for my needs", "Date": "January 24, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R23WKH5EHK6FYN", "Overall": "5.0", "Content": "I got this tablet as a Christmas present and it's wonderful. The screen is very clear and the camera quality is perfect.", "Title": "Wonderful Tablet!!", "Date": "January 21, 2014"}, {"Author": "Jae", "ReviewID": "RXPL26PVJU283", "Overall": "2.0", "Content": "I received this in December. I bought it mainly for reading because I was running out of space to keep books. I have not had a single problem with it. I can watch videos, read, check my email, browse. I don't regret the purchase._______________________________________________________UpdateAbout a month ago I tried charging the tab but there was no indication that power was reaching the device. I changed the charger a couple times and tried changing the charging source from the electrical outlet on the wall to the PC via a USB cord. I restarted it, this did not work either. I tried 'googling' the problem and after two or three words google had auto-completed the problem.....I wasn't the only one having the same issue with a Samsung device. I saw and tried several fixes. The one that eventually worked was re-setting the device - which annoyed me because I had to wait for all the apps to be re-installed. This I had to make sure was done while I had a wifi connection in order for me to access my offline apps when I am not able to receive a wifi connection.After thinking that the problem was solved, it happened a week later. I did the same re-set and it worked, again. After a little over another week, it happened again, except this time the re-set didn't work. I found another fix online that recommended holding down the power+volume buttons at the said simultaneously. I have had to do that about 3 times since the first fix stop responding. Holding down the buttons have been working so far. But sometimes I think the speed at which it is charged moves a bit slow.It's such a shame that I have to downgrade my 5 star rating because I really like the look, feel and operation of the device. But a faulty charging issue is way past annoying to say the least..it's poor. I gave it 2 stars because 3 stars means 'it's OK' and it's not.", "Title": "satisfied with my purchase/Until now", "Date": "January 20, 2014"}, {"Author": "Mingus Mt Acadamy", "ReviewID": "R2DRQVQ8BTPV50", "Overall": "5.0", "Content": "Works great! I love watching movies and renting them on Google Play. The size is perfect for travel. Great product!", "Title": "Great overall tablet!", "Date": "January 18, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2TUJ873SUJ49I", "Overall": "3.0", "Content": "I had this for a few days all worked great, was very happy w/ my purchase but then I went to view a video and use headphones. The headphone jack did not work at all, had to return it after wasting all that time setting up email accounts, and various other accounts, ugh hate wasting time! I would have given this tablet all of 5 stars had it not been for that, I was afraid to replace with the same.", "Title": "headphone jack DOA otherwise great", "Date": "December 15, 2013"}, {"Author": "PharNaWay \"Reme\"", "ReviewID": "RBP40PAJ0M5IJ", "Overall": "5.0", "Content": "It's beautiful, easy to use, the display is fantastic, and the price is so much more reasonable than other tablets in its class. I'm considering purchasing one for my grown son. Well, it will be either the Galaxy Tab 3 or the Galaxy Mega cell phone. I have both in white with white cases and I love using each and both. With the Mega, I probably don't need the Tab 3 but I want both. The cell phone has a monthly charge attached for services as all cell phones have. Can't make calls with the Tab 3? There is Skype and video chats. The Mega has a 6.3\" screen which is fantastic. Large for a cell phone but although I'm on the small side with small hands, it doesn't pose any problems for me. I always use a bluetooth headset anyway. So I say...Buy the Tab 3 and/or the Mega. You will not be sorry in the least.", "Title": "LOVE THIS TABLET!!!", "Date": "December 15, 2013"}, {"Author": "Kristopher Rattansingh", "ReviewID": "R1SNOI5KRJC5W7", "Overall": "5.0", "Content": "Perfect tablet! Better than anything Apple can offer. Excellent functionality, no restrictions and the ability to get around any obstacle with more than enough resources.", "Title": "Excellent purchase!", "Date": "December 12, 2013"}, {"Author": "mike", "ReviewID": "R3TJSX7FHY0WM1", "Overall": "5.0", "Content": "amazing tablet love it fun big great to play on vut still don't know how to download music from computer to tablet but overall its amazing", "Title": "greatt", "Date": "December 12, 2013"}, {"Author": "Lynda Colwell", "ReviewID": "R1M40I10692S5O", "Overall": "5.0", "Content": "I really love my Samsung Galaxy Tab3. The 8 inch size is really good because it's bigger than the 7 inch and smaller than the 10 inch, so is easy to handle, easy to use, easy to read. The battery life is good also. I can work most of the day before recharging.", "Title": "great tablet", "Date": "December 12, 2013"}, {"Author": "BALLS803", "ReviewID": "RWI92K8M8C170", "Overall": "5.0", "Content": "This thing is great. I purchased it so I didn't have to use my personal computer to do my work on. Does what I need and I can also play games on it.", "Title": "Galaxy Tab 3 8\"", "Date": "December 11, 2013"}, {"Author": "Miguel", "ReviewID": "RXVDE8RHVT6RZ", "Overall": "5.0", "Content": "Its the same color as appears on the monitor. I like it a lot ! the first day i got it everyone complimented my tablet. Its really good for connection. The only thing i wish, was that it had a little handle to wrap around my wrist. Its good and the seller shipped it here in IN in an ample amount of time.", "Title": "Nice TABLET", "Date": "December 10, 2013"}, {"Author": "Manuel Mendoza", "ReviewID": "RC3S08FKBLJU8", "Overall": "5.0", "Content": "Great tablet...simply love it! easy to use, to connect with other equipments (even my tv and cable box), great apps, the screen has a woderfull resolution, it is really good.", "Title": "Great tablet...simply love it!", "Date": "December 10, 2013"}, {"Author": "Lizzy Kim", "ReviewID": "R3HXCECVFKCN26", "Overall": "5.0", "Content": "I love it. I'm absolutely in love with my new tablet. The shipping was faster that I expected it and the item arrived in perfect condition. It's amazing. I have tried a few tablets before but this one is definetely the best out of them all. I'm very satisfied with my purchase.", "Title": "I'm not using my laptop as much as I used to before this arrived.", "Date": "December 10, 2013"}, {"Author": "Raajindra Charles", "ReviewID": "R2NWO3N2SLN5U0", "Overall": "5.0", "Content": "Only started using it 3 days. size is perfect not too big not to small. great camera quality. fast browsing. will definitely recommend to any one.", "Title": "love it!!!", "Date": "December 9, 2013"}, {"Author": "Cow", "ReviewID": "R27WKIUUD8LX8U", "Overall": "5.0", "Content": "My Hubby is very happy with his new Samsung Galaxy. I have to say that I have purchased 2 Samsung products this past month and feedback from family who items were purchased say they work great. The picture is super clear. Samsung makes really great products.", "Title": "Samsung is a winner in my book", "Date": "December 8, 2013"}, {"Author": "I<3Amazon", "ReviewID": "RBSGRN7XZI3X3", "Overall": "5.0", "Content": "Fantastic. Great sound, lovely screen, comfortable for me to hold with one hand (I even have small hands.) Fun for games, great for everything like consuming media, PDFs, video chatting, social media, using apps, checking weather...and more. Perfect size, too.I simply love it.", "Title": "Great tablet!", "Date": "December 7, 2013"}, {"Author": "Larry Hasbargen", "ReviewID": "R2N9K17FAP92FM", "Overall": "5.0", "Content": "Great tablet. Screen is clear and bright. Battery holds a charge for a long time. Easy to use. Would recommend it.", "Title": "I love it", "Date": "December 7, 2013"}, {"Author": "kay", "ReviewID": "R17S4DMQYR1SR0", "Overall": "5.0", "Content": "I got this for my son and now I want one. I was very impressed.Was better then my galaxy s4active phone. I love the android andthe apps that come with it. I give them a 5 on delivery as well. fantastic job.I love the tab 3  thanks now I have to get me one lol", "Title": "Fantastic", "Date": "December 6, 2013"}, {"Author": "Karijana", "ReviewID": "R8P5VE8ZZFQ2V", "Overall": "5.0", "Content": "Shipped in only a couple of days. Galaxy tablets and phones are such wonderful, user friendly products! I used to be an apple snob until my boyfriend bought the galaxy note then I fell in love with Samsung!", "Title": "samsung > apple.", "Date": "December 6, 2013"}, {"Author": "Sol Jung", "ReviewID": "R24DSH6V7X2OQ6", "Overall": "5.0", "Content": "It's a very nice tablet.Sized equal to the iPad Mini, I decided to get this one since I already have a iOS device.Love it!", "Title": "Great tablet for education/entertainment", "Date": "December 4, 2013"}, {"Author": "Amazon Customer \"Today is all that you have.\"", "ReviewID": "RR3F05KXBF1GD", "Overall": "5.0", "Content": "I love my Galaxy Tab 3. I had bought a google Nexus 7 and was happy with it, until I found out about the tab 3. It is luxurious and very sleek. Beautiful bronze color and just plain sexy. You cant go wrong with the tab 3.", "Title": "Sexy tablet.", "Date": "November 30, 2013"}, {"Author": "mparmy98", "ReviewID": "R26U4AFCXZQGXL", "Overall": "5.0", "Content": "Excellent tablet.  Fast, easy to set up and just as easy to use. Best on the market, beats iPad in my mind.", "Title": "Love my tablet", "Date": "November 27, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RL5LUT6PR18IS", "Overall": "5.0", "Content": "This was a \"used\" tablet from Amazon Warehouse, but like everything else from them, the tablet was in new condition. The box had been opened, but that was all. This is a great way to save money. The tablet is awesome with a nice size screen and easy to use features. I am super happy with this purchase", "Title": "Awesome value!", "Date": "November 26, 2013"}, {"Author": "Luis Enderle", "ReviewID": "R1TU9ZCIKMPA4A", "Overall": "5.0", "Content": "Fast, Light, with an excellent size. Samsung's features are nice and useful. battery life is good. I have used it as GPS in a rental car in my last trip and it works perfectly without internet connection, speakers volume is louder than other tablets, I think.", "Title": "It's a very nice product!", "Date": "November 26, 2013"}, {"Author": "dvreyna", "ReviewID": "R1O3IPWVQ78WA2", "Overall": "5.0", "Content": "I love this tablet everything you have been reading about this tablet in the five star reviews is accurate. Perfect size and function.", "Title": "Awesome", "Date": "May 15, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1LQ4QPYR95LNN", "Overall": "5.0", "Content": "I had purchased this product mostly for my Kindle application.  It has well exceeded my expectations.I have been shopping for a tablet since about September or October of last year mostly for my husband.  Black Friday had one on sale, but at the time he didn't want one.  Since then he was playing with the store display ones in the store.  We both have android phones so we decided to stay with an Android device when we purchased.When we finally purchased the Tables I found myself,  as well as my husband,  are using the tablet like a mini computer.  So many times it has come in handy to pull up an app to check on something,  or an account for a balance.  The speed is great for what we need.  We have the micro sd card so that helps.Hubvy and I are very happy with the product within the last few weeks of ownership.", "Title": "Great product!", "Date": "May 13, 2014"}, {"Author": "Yoly", "ReviewID": "RNH3DEMBIAY1M", "Overall": "5.0", "Content": "I have two iPad and 1 iPod, but this tablet it is better, I recommend completely. I will by another", "Title": "Love it", "Date": "May 12, 2014"}, {"Author": "Oscar Arias", "ReviewID": "R23FH7DFUF79PE", "Overall": "5.0", "Content": "Got this as replacement for my Toshiba Thrive 10\" after it fell on the concrete face-first.  (That tablet while chunky and heavy served me well for several years).  I wanted to get something a little smaller so I first purchased an Asus Memopad HD 7.  I was a little underwhelmed by the clarity of the screen, and the build quality of the Asus felt cheap.  I ended up giving the Asus as a Christmas present to someone.Decided I that what I needed was something slightly bigger, so I started looking at the 8-inchers.  I was sold on the Samsung when I saw that it came in a Gold-Brown color  (I really didn't want an all-white or all-black tablet).  As I wanted it right away I ended up purchasing it from a nearby \"big-box office supply store\" (honestly 6 months later, I couldn't tell you which one).  It doesn't really matter as this is one of those price controlled products that will end up being the same price on Azon or a big box retailer.At any rate, when I picked up the tablet for the first time, I was really impressed with the build quality.  The build quality (along with the great brown-gold color scheme) really made this tablet feel like an \"executive\" accessory.The screen on this is MUCH sharper and colorful than the screen on my old Toshiba Thrive or the Asus Memopad.Sorry, didn't run any sort of benchmark tests on it, but the interface felt very responsive.  It's very \"smooth\" unlike the Asus Memopad, which (while faster than the Galaxy Tab) had a somewhat \"jerky\" UI experience.  The Samsung was just a better experience.I use Netflix on this tablet, and it runs and looks great.  I don't do much gaming on tablets so I can't speak about that, but the Amazon Kindle app runs great on it, as does the standard stuff like my email client, evernote, etc.As a bonus, the tablet came with free 50gb of drop box storage, which I found to be VERY useful to move files between PC/Laptop/Tablet and phone.  I think I also got some Google Play credit, as well as some other \"Samsung Perks\" that I never used like 3 months of free XM radio, free audio books from Audible, etc.Of course just as I write this review, the new Galaxy Tab 4's have just been released.  I think I'll hold on to this one for another year or two, as the new ones don't come in brown-gold!", "Title": "Great tablet, wonderful color!", "Date": "May 12, 2014"}, {"Author": "Cate", "ReviewID": "R2GJVS6CTQSUQ9", "Overall": "4.0", "Content": "I find the Samsung Galaxy Tab 3 8.0 to be very similar to the iPad mini and a little more affordable, the pictures are good and you can get most of the popular apps.. I got it for my teenage girls who like to Facebook, Snapchat, use Instagram and watch YouTube videos. They can also use Google to research info for homework. I would recommend it to anyone who wants a small, convenient, easy to use tablet for themselves or their children!", "Title": "Samsung Galaxy Tab 3 (8-Inch, White)", "Date": "May 10, 2014"}, {"Author": "Casey Hayhurst", "ReviewID": "R3I2RKA5SQUDUC", "Overall": "5.0", "Content": "Rocks ...it works really well...I am so glad I bought this...I bought an off brand before getting this one and it was crap", "Title": "Great!!!", "Date": "May 10, 2014"}, {"Author": "lauren", "ReviewID": "R19UBDXH6G09PG", "Overall": "5.0", "Content": "This was a Christmas present for my daughter is still continues to be her favorite gift. She uses this everyday and it works great. I bought the screen protectors and a flip case just to be safe.", "Title": "Love, love, love", "Date": "May 9, 2014"}, {"Author": "Jack Riddell", "ReviewID": "RVGU9S35B60OC", "Overall": "5.0", "Content": "I bought this 8-inch Galaxy Tab 3 based on forum reviews and my own research. It does everything I wanted in a tablet and I plan to put it to good use during a one month vacation in Europe. I love the sharpness and clarity of the display, the quick response to touch commands, and the near endless applications available for this device. So far, I am extremely pleased with this purchase.", "Title": "My First Tablet", "Date": "May 9, 2014"}, {"Author": "bri", "ReviewID": "R31H6RQUHLAA4G", "Overall": "5.0", "Content": "Got my tab 3 8 inch last October at Best Buy. Could not be more pleased. My better half and I shared an ipad 3 since they came out but I was not satisfied.  I bought a galaxy s4 phone in july 2013 and I love how they can be connected to easily transfer files, pics, movies etc back and forth. I find my better half even using it and liking it. The ipad speakers are just terrible. This tab is so much better to watch movies, videos, and listen to music. And yes I share all that between my 2 Samsung devices. Sure the screen is smaller but it's so much easier to hold. I've never had 1 issue. I see other bad reviews and it really surprises me. But I still would recommend what I think is a good product to friends and family. Hope you try this out.", "Title": "Very Happy", "Date": "May 8, 2014"}, {"Author": "Courtney B.", "ReviewID": "RD2HKUCPEPJW1", "Overall": "5.0", "Content": "It's fast enough for me for browsing the web and playing games. The battery life is great, picture is very clear, and it's easy to use. This is my first tablet so I really have nothing to compare it to, but I've always had Samsung phones and was impressed by them so that's why I bought this. I'd recommend it.", "Title": "Love it", "Date": "May 8, 2014"}, {"Author": "John Collins", "ReviewID": "RDD30IRKSG4BT", "Overall": "2.0", "Content": "I had gotten one of these Samsung tablets for Christmas without having owned a tablet or an Android device. The experience of owning one for the first time was great. My problem happened about a week or less before I took it back to Costco. The battery on my brand new tablet device was bad. It stopped giving an accurate estimation of the battery life and stopped charging altogether. I tried different cables and outlets (it uses a universal USB cable) and it still would not charge. The battery ended up dying and I held the power button to see if it was really out of battery. It wasn't! It had 4x% battery remaining. It had to reboot to see the remaining energy. It's nice to know when my tablet is going to die and when it isn't. I plugged the tablet back in with its new 4x% and it still remained uncharged.Needless to say, I returned it to get a new one. This one lasted about a month longer until I ran into the same battery issue. I plugged it in and it no longer charged. On top of that I had an issue where my screen went completely bonkers and wouldn't let me control anything (this was a one time thing, but it was interesting seeing my tablet rearrange itself).Is this device all bad? No.Should you buy a different tablet? YesFinal comments:It works as a device, but I'm unsure of how long it will last. The design is average having a few physical buttons and a couple touch screen buttons (which are pressed frequently by accident)", "Title": "Returned twice due to the same issue. Choose another tablet.", "Date": "March 7, 2014"}, {"Author": "Mark Tussing", "ReviewID": "R21BZAXVTES7HS", "Overall": "5.0", "Content": "My wife enjoyed her christmas present and i enjoyed saving alot of money.I would recommend this tab to evreyone Who enjoys electronics.", "Title": "Very nice tablet !", "Date": "January 28, 2014"}, {"Author": "Craig", "ReviewID": "R108EEQNZADX91", "Overall": "2.0", "Content": "The battery doesn't last long at all and it takes almost as long to charge it.Other than that its pretty good.", "Title": "battery", "Date": "December 28, 2013"}, {"Author": "Jose Berrios", "ReviewID": "RF6BBISBGHLJA", "Overall": "5.0", "Content": "Thank you beach camera for being the only one who would ship it to me!! Had problems with FedEx though . They couldn't find my house and claimed it was the wrong address. Even though I only use that one address. And I ordered countless things before and never had problems. so I had to go and picked it up. But other than that.  I love my awesome tablet!", "Title": "LOVE IT!!", "Date": "October 28, 2013"}, {"Author": "eyeziko", "ReviewID": "REVDA6087WYC8", "Overall": "5.0", "Content": "Doing great so far.........,is meeting all expectations. Smart,light and sleek and not as large as it looks and the size is just right.", "Title": "Great phone.", "Date": "August 30, 2013"}, {"Author": "Go blue 10", "ReviewID": "RDHM3JTGHN1Q3", "Overall": "4.0", "Content": "They shipped it in a envelope which had no protection. The tablet it self is great. Perfect for people who only need the basics in a tablet.", "Title": "Great", "Date": "August 14, 2013"}, {"Author": "Baofu Qiao", "ReviewID": "R3JYLBJ07MTI4F", "Overall": "5.0", "Content": "I am using it for couple of days. So far, I enjoy it very much. But I have a few of questions. Anyone can help me?1. My MicroSDHC (class 4) card doesn't fit the memory card slot physically. It can not be locked inside the slot. From the manual I downloaded from samsung.dom, MicroSD and MicroSDHC cards both are compatible with the Samsung Tablet3 8.0. so what kind of problem could it be?2. Anyone knows how to run multi-windows on the same screen? I have tried \"Samsung Multi Window Manager\". But it keeps asking me to reboot the device when I run the program.", "Title": "Great tablet, but I have few questions", "Date": "July 17, 2013"}, {"Author": "SF Guy USF \"SF Guy USF\"", "ReviewID": "R2BZJMPTQBXT1W", "Overall": "2.0", "Content": "Compared to the iPad Mini - it is weak hence 2 *'s - again it maybe unfair to compare it but considering the price is the same you get so much more quality for the money with the iPad. I tried to break away from Apple and after reading the AMZN reviews the Samsung Galaxy Tab 3 8\" seemed really solid. How wrong I was!However, here are the reasons I give it 2 stars:1) BATTERY LIFE IS TERRIBLE.  I would leave mine over night with 90% charge, bluetooth off, battery saving mode off, most apps shut down and it would be dead the next morning. A 30 min run on the treadmill watching a movie would kill 20% of the battery.  Compared to iPad Mini - you will go a solid 10 hours no questions.2) Usability for kids - nowhere near that of the iPad.3) Overall usability - weak.4) Playing movies directly to my new Samsung Smart TV was very clunky and it would crash every 5 mins!!!I moved to Android because I loved the idea of open apps (which are wonderful) and the SD card expansion slot (which is a HUGE +) - but the device itself currently is far inferior to the iPad.I just returned it today after a solid 2 week test drive. I lost out on a new case I bought and a screen protector.... but that is the price I paid.  Back to buy another iPad Mini. Just wish it did not cost $100 for every 16GB - that is a rip off and Apple should be ashamed.", "Title": "Compared to the iPad Mini - it is weak hence 2 Stars - BATTERY TERRIBLE", "Date": "November 21, 2013"}, {"Author": "D. Snow", "ReviewID": "RWU8IZ43F52B", "Overall": "4.0", "Content": "`The perfect tablet would have an 8-inch screen like the Galaxy Tab 3 8\", and the resolution of the new Nexus 7 tablet:  1920 x 1200 pixels.When will Samsung offer this tablet?Because reading small text on screen looks MUCH better if the resolution is 1900 x 1200.", "Title": "Where is the perfect Galaxy tablet?", "Date": "July 31, 2013"}, {"Author": "A. Ferrin", "ReviewID": "R32PTCROC3W3YH", "Overall": "3.0", "Content": "But the fact is, I'm not a big Android fan and Samsung has made it harder to like Android. Between Samsung and Google stuff loaded on the device, it's hard to strip it down to being a useful tablet.Right now this tablet spends 95% of it's time running Touchsquid (app) and being used as a remote for our entertainment system. Got it mainly for it's IR blaster...so to that end, it works.", "Title": "would love to give it 5 stars", "Date": "January 17, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00DEZ5DRS", "Features": "Android 4.2 Jelly Bean OS, 1.5GHz Dual-Core Processor\n16 GB Flash Memory, 1.5 GB RAM Memory\nStore photos, videos, music, and more with up to 64GB of memory available through a microSD slot and 50GB of free Dropbox storage\nCamera: 5MP rear-facing, 1.3MP front-facing\nPre-loaded with free content including Hulu Plus membership, Google Play credit and Boingo Wi-Fi Access", "ImgURL": "http://ecx.images-amazon.com/images/I/41JoGauLg9L._SY300_.jpg", "Name": "Samsung Galaxy Tab 3 (8-Inch, Gold-Brown)"}}