{"Reviews": [{"Author": "dogtag1968 \"Robin Paullin\"", "ReviewID": "R1UR2WWOMKHKUU", "Overall": "4.0", "Content": "I'm very happy with the product i recieved, the only issue I've found is that in other Q & A's, and the description I've read 'AGPTEK' state that Google PlayStore is preinstalled. At this point I have not been able to achieve ability to use the Playstore,also I'm having a problem getting Netflix to preform.  But other than those two issues I'm very pleases with this 7\" Tablet, and would recommend it to family and friends.", "Title": "Very timely deliverey", "Date": "July 21, 2013"}, {"Author": "ayeandus", "ReviewID": "R1Y9HSY9IFLUK2", "Overall": "2.0", "Content": "Delicate screen. 2 out of the 4gigs memory advertised is all you will have for apps.And that's before you download anything. Does not use external micro SD for memory expansion.Charger cheaply made and though it looks like a standard micro USB charger it will not work on other devices and vice versa. Looks nice and the stats look great but too many short comings even for $90Most sites think your using a iPad but trust me you will not. They had two postings for the same tablet so please don't think I didn't buy it because I did. The seller's will except returns with little to no problem but as I told them had it just performed as advertised there would be no need. You may be okay with these issues but i could not recommend.", "Title": "problems", "Date": "October 28, 2013"}, {"Author": "Bill", "ReviewID": "R1R1YOHPO5TUX3", "Overall": "3.0", "Content": "I have used several models of android tablets over the years ranging in price and functions. The follow are observations while setting up and using the AGPTEX tablet for less than a week.first the good:• Low cost• Quad code processor (very Fast)• Stable platform with latest operating Android system.• Plays Movies, including Netflix without any performance issues.• Connecting  to a external USB memory with the supplied OTG cable was a no brainerNow the not so good:• No Bluetooth. You will need to plug-in ear phones in for audio and movies for better sound• The G sensor (gyro) is very basic and has no Auto rotate• No GPS: If you use your table for travel, you will want the GPS to identify your current location for local information.• No near field function.• No rear camera.• Forward camera (this is the one facing you) is dark and no so good of qualityI was not impressed by the video quality when connected to a HDMI TV with a 10ft HDMI. Netflix was grainy, but I was on a slow connection so, It may be better when connected over a faster network.I used the Wattpad application to check out the tablet as an E book reader. It performed as good as any more expensive tablet.Final Note: Compared to the $200 Nexus 7 tablet I miss the Blue tooth and GPS function that is missing from the AGPTEX. However, having all the software and rooted  for adding external memory for storing video's and music is a big plus for the $80 AQGPTEX tablet. The AGPTEX also has HDMI output that the Nexus 7 does not.", "Title": "AGPtek® 7 inch Android 4.2 Jelly Bean Cortex A7 1.5GHz Quad Core 1GB DDR3...", "Date": "January 30, 2014"}, {"Author": "Jake", "ReviewID": "R3G8ABZ8V35KYQ", "Overall": "5.0", "Content": "I have had the tablet for a couple hours now. For the price it's incredible! Its fast, screen looks great, and it seems very durable. You cannot go wrong with this tablet!", "Title": "AMAZING", "Date": "December 19, 2013"}, {"Author": "Seth Marshall", "ReviewID": "R2IOZ5RW8NLQ6I", "Overall": "4.0", "Content": "I bought this little tablet while I was waiting for my more pricey tablet to be fixed with its warranty.  Though at first it appears to have navigation/GPS  abilities when using the Google maps/nav App. I found it didn't.  Upon further inspection of the item description/manual etc, there is no mention of including GPS capability. A slight bummer as this Tablet actually has a decent looking picture and, though not the fasted tablet I've played on, it generally performs at reasonable speeds. Netflix works well enough and the internet browsing is quick and works well when connect to high speed wifi.  For a tablet under $90 its a nice affordable media and internet browsing tablet. It is definitely a good back up secondary tablet.  I haven't had it long enough to say anything about its longevity or durability, but i'm happy with it so far.", "Title": "No GPS, but good for the price", "Date": "October 22, 2013"}, {"Author": "Amazing Seller \"Jewelry Designer Lover\"", "ReviewID": "RUZCXAQO9ZCQ6", "Overall": "5.0", "Content": "The AGPtek Android tablet is a great tablet.  The AGPtek comes ready to use, straight out of box.  Plus the price was less expensive than other comparable ipads.", "Title": "Great Tablet", "Date": "April 4, 2014"}, {"Author": "Henry Hannible", "ReviewID": "R3PRR4225K4NDF", "Overall": "5.0", "Content": "Was a bit skeptical at first about the abiltiy of this product to perform as advertised. I am pleasantly surprised. I absolutely lovethis product and would highly recommend it to others.", "Title": "Excellent product", "Date": "March 26, 2014"}, {"Author": "Quicksilver's Daughter \"If you remain silent,...", "ReviewID": "R2BACCQGF2I9CV", "Overall": "1.0", "Content": "Fully 50% of about 100 apps I wanted to download were not compatable. After about 4 weeks of use the screen malfunctioned. I would tap to open an app but a different app would open. I would tap something within an app but something else happened as if I had clicked for it instead. After a month of frustration caused by the over-sensitivity of the screen I stopped using the tablet. I won't buy this brand again because so many app can't be downloaded.", "Title": "Most Apps Won't Work", "Date": "February 4, 2014"}, {"Author": "Michael T. King", "ReviewID": "R188NTUQU9AUU", "Overall": "1.0", "Content": "Touch screen stopped working within a week.  Just going to stick with my first gen kindle. Refund was the only option I was given.", "Title": "junk", "Date": "January 23, 2014"}, {"Author": "Bruce Neville \"bneville\"", "ReviewID": "R1LLHOQ9FVOU8K", "Overall": "5.0", "Content": "Yes, a quad core processor DOES make a difference!Minimum main memory for app storage, but there is a SD card slotThe 1M of RAM makes the active apps run smoothly.", "Title": "Excellent, fast tablet for a reasonable price", "Date": "January 19, 2014"}], "ProductInfo": {"Price": "$199.99", "ProductID": "B00DU8P7GG", "Features": "Built in Newest Android 4.2 Jelly Bean, better reliability and compatibility, support tens of thousands of software upgraded.\n1.5GHZ Allwinner A31S Quad Core CPU and SGX544MP2 Open GLES 2.0OpenCL1.x,DX9_3 GPU.\nSimple and fashion IML shell design for high quality life. 5 point capacitive touch screen for easy operation.\n7 inch 1024*600 HD TFT display for beautiful pictures.\nPackage including: 1 x AGPtek tablet, 1 x Charger with a USB Cable, 1 x Micro USB to USB(OTG) Cable, 1 x AGPtek User Manual", "ImgURL": "http://ecx.images-amazon.com/images/I/514by2cahcL._SY300_.jpg", "Name": "AGPtek® 7 inch Android 4.2 Jelly Bean Cortex A7 1.5GHz Quad Core 1GB DDR3 RAM 1024*600 HD Touch Screen G-sensor Wifi Tablet PC Mini Pad, Built in 4GB Storage, Google Play Pre-Installed, 1080P HDMI Output, OTG Function, Compatible With Skype Video Calling, Youtube, eBook Reader"}}