{"Reviews": [{"Author": "Mitch H.", "ReviewID": "R2BJ0A49PBMR31", "Overall": "5.0", "Content": "This is pretty cool tablet to use. Screen is nice, speakers are positioned correctly and the controller is more comfortable than first thought.I did have to call customer care to help with a small issue. They were great. Called back to make sure was working right after a couple days. Who does that now? I spoke with Dave, Awesome.Be advised that when you touch the power button on top to put unit in sleep mode your battery will drain if still connected to controller. To put asleep and have minimum battery loss, first disconnect from controller.It is late in the life of Tegra3 to introduce a new product, but the T3 is an awesome processor. I will probably buy a NVidia Shield when it becomes avail, however I think they already dropped the ball with a mere 5 inch screen.Back to the wikipad.Build Quality: 9/10 Solid unitWeight:  7/10 A lil on the heavy side w-controller. But you have a CONTROLLERScreen:  9/10 Nice and bright when needs to be.Battery Life:  6/10 I'd love to have some more juice with this babyCust. Service  10/10 Just awesome. Good job Dave-Size:  8/10 I thought I would like an 8in. But they did good homework and the  size is nice with added controller.Hopefully it sells well and we can look forward to a unit with a T4 :)", "Title": "Fun Device", "Date": "June 27, 2013"}, {"Author": "Majed Saif Abdulla Hamed \"Marcopolo\"", "ReviewID": "RAACRD1460NSK", "Overall": "5.0", "Content": "I'm not a stranger to portable retro gaming on various devices. I've owned rooted iDevices, android phones, hacked game consoles. The works. I also dabbled a bit with the GPH series of handhelds, the JXD series, and have kickstarted the GCW Zero (still waiting on that one!).Therefore, once I finally got my hands on a Wikipad, I wasn't expecting much right out of the box. This thing was delayed and then pushed back even more. However, once it was out of the box, everything changed.The build quality is simply phenomenal and it caught me by surprise. The device has a nice balance to it, the screen is lush, and the controller is fantastic! I knew that the controller would make or break the wikipad and honestly I can't recommend it enough. The responsiveness and feedback are top notch and it never feels too heavy to hold.Now to the interesting part, the emulators!It ran everything I threw at it from the NES era until the Playstation One without a hitch (except for some well known games that have inherit comparability issues). I got a 64GB SDXC card, formatted into FAT32 and filled it to the brim with games. MAME is also supported and runs splendidly on this Tegra 3 powered device.The two main weaknesses that I have found were the speakers (solvable by wearing earplugs or headphones), and no button mapping support (which is currently being worked on by the Wikipad development staff).Finally, the device has also been rooted, so you'll get even more options to install.Buy it, and enjoy. :)", "Title": "Wikipad?!", "Date": "July 25, 2013"}, {"Author": "G. M. Volk", "ReviewID": "R13GO1JFMMWJ2Q", "Overall": "4.0", "Content": "Ever since I first saw the Wikipad, I wanted it.  I looked at lots of tablets, Kindle, Nexus, Sheild, etc.  I always came back to the Wikipad.  I ordered mine as soon as it was released, from Walmart.  Got it a couple days later and while there were a few disappointments, overall I like this tablet and I am finding ways to do things on it so I don't have to use my laptop.First the good: as a tablet this is up there, similar in design to the Google Nexus 7 but add in a micro-SD slot.  Now you can't intstall and run apps from it, but several apps have given me the option to store there data files to it, Bards Tale for instance wanted a whopping 3.7G of extra files to download!  So the SD slot is a must now-a-days.  The screen is very vivid and colors look great watching movies or playing games.  Touch response is better than I expected, my kids both have sub $100 tablets and touch sucks on those.Second the not so good:  Sound, it's stereo, but as expected with a tablet this size the sound is very tinny.  Never seems to be loud enough, and when you go to loud it sounds bad.  Use headphones.  On the headphone side, I have a decent pair of bluetooth headphones that I wanted to use with this tablet, the Artic p311.  For movies they work well, and can even pause/play using the button on them.  With games, there is a noticeable lag and I have to use wired headphones.  So I plug in my Sony earbuds, don't recall the model as I bought them a long time ago.  These I have always used with my Sansa Clip MP3 player and they have always sounded excellent.  On this tablet, they sound distorted and clicky.  Touch taps sound like static and all in all are not useable.  I have a pair of cheapy headphones, sub $10(maybe even sub $5) and they actually sound pretty damn good!  Go figure!  Now the bluetooth is only BT 3.0, as I think that is the highest Android supports.  I use a BT 4.0 adapter on my laptop and with the Artic P311 I have no problem with games or movies.On to the gaming controller.  This is a mixed bag as far as I am concerned.  The control are OK, not xbox quality or anything but not bad.  At first I was disappointed in them. They felt sloppy and awkward.  I was almost ready to return the Wikipad as I really wanted it to play games.  I was playing Shadow Gun, which comes with the Wikipad, and found some settings to tweak and to get the controller mapped how I wanted(still fiddleing with it).  With the controllers, I can usually place in the top 5 on Shadowgun, once I came in first on deathmatch and out of the two Zone games I've played I've been first in kills on them.  I tried playing without the controllers and I was dead-last everytime!  So they controls do make a difference, but they took me some time to get used to.  The other bad thing is that not all games support controllers.  I bought Bards Tale, since Tegra Zone claims it had controller support, plus it was one game I really wanted.  Well it does not support the Wikipad!  I have also downloaded Dungeon Hunter 4, and while it does not specifically state it supports controllers, I was surprised when I was able to move the character and cast spells with it.  Now you can't customize it, and not all buttons work but to be able to use the left thumbstick to move while using touch to attack/spells/etc does make the game a little better.  Hopefully the folks at Wikipad will get an app that allows mapping touch to the controller for whatever app/game you use, that would be cool.Final thoughts:  this is a very solid tablet.  I have found my self using it for more things than I thought I would.  Initially thought I would only use it for gaming, but I use it for Reddit,GPS, Email/Gmail, news and weather, watching movies, web surfing, banking, etc.  It's convenient as I can put it in my pocket and have it with me when I need it(need to get a mobile hot-spot next).  The game controller is usable, and games are enjoyable with it, but it's by no means the be-all/end-all of controllers.  This does have the Tegra 3 CPU/GPU and that has been out for quite some time, but I don't feel this is a downside as I don't really see tablets utilizing massive CPU/GPU, as least not yet.  Don't let that stop you from buying this versus waiting for \"next-gen\", you'll always be waiting.", "Title": "Very nice", "Date": "June 28, 2013"}, {"Author": "Mitchell Plyler", "ReviewID": "RSPZZTJ5PBUQQ", "Overall": "5.0", "Content": "I've had this tablet for 2 months and I have enjoyed it a lot. Smooth Gameplay and it functions well for all the apps I use at work.Some reviews talk about games not working, but all you have to do is Check the Wikipad website for compatible games on Google Play.I've loved mine, so I suggest you give it a shot.", "Title": "It's a great tablet that's a lot of fun", "Date": "September 27, 2013"}, {"Author": "Thanoa", "ReviewID": "R1J224TYXRKY36", "Overall": "4.0", "Content": "I will posting pics to those that are doubting that I own one. I just didn't buy it on Amazon, is all..Pros:-Though the size of the tablet, docked into controller, will throw your eyes off...the controller feels nice to the touch. Even with the controller mounted to the tablet, you'll be surprised to see how light it still remains.-Stock Android...without the crappy UI or skins...-Comes with some free games pre-loaded; for some out the box gaming-I like how this tablet has a led battery status indicator. I know that seems so minuscule to highlight, but I'm glad they threw it in.-Accepts Micro SD cards...thank you...I tossed a 64 GB Class 10 Sandisk and it performs brilliantly. I have my music and movies and still enough space for games :)-I like that you don't have to remove the controller dock to recharge it. It has a charging bay in the rear of the controller dock.Cons:-Though the battery life is decent; it's not amazing either...I wish this bad boy had a better battery installed. I sometimes get lost in a game only to realize that I'm running low on juice. As a last resort I usually have an external battery that can be hooked up...but the device stops being portable at that point. I do have a tip for newbs to the Wikipad 7. Remember to kill Wifi/Bluetooth/GPS if you are not using it. Also, I find that the Wikipad 7 loses charge sooner, even idle and not in use, if left on the controller dock. You will be amazed how much battery life you will have left over, if you simply removed the controller dock from the tablet when not gaming.-This next con is a pinch nit picky...but this tablet (though considered a 7 inch tab) is a bit wider and bulkier than the average 7 inch tablet on the market. That being said, it's hard to find a good case for this tablet. I know that it's fairly new; but they should have thought ahead a bit. This will, undoubtedly, change as time goes on.-I'm not a huge fan of the power/standby button and volume rocker. It just could have been a bit  smoother. The feel very rigid and you really have to press down hard on them to get a response. May just need more time to be 'broken in' as they say.- Top Buttons (L and R in most classic controller setups) are also pretty rigid. The D-Pad is not too bad, but could have been better. I just feel the top buttons (L and R) are super stiff.-Wish the speakers on the controller dock were louder. I have to crank these bad boys all they way up to make out most of the game play dialog and music. It's not a deal breaker, but my 3DS or Vita seem to have louder speakers, LOL.-Camera is very below average...although not a deal breaker for me, because I rarely capture moments with a tablet. I do Skype with my relatives in Spain and France and my folks say I don't come across as clear/sharp as with another electronic medium.Conclusion:I have to say that I am very happy with the purchase of the Wikipad 7 (flaws and all). This can truly be considered a gaming tablet. A great effort that deserves support and makes me hopeful about gaming on tablets (not for everything of course) in the future.I sold my Nexus 7 to get this puppy. I don't miss very many things about the Nexus 7 as great as it was. It performs well as a tablet outside of the gaming activities too. It's quickly become my favorite travel item while I'm away on business. The price point is very fair considering the competition. I sold my old tablet and paid like 25 dollars difference to get this one. That could be your angle.Thank you for reading this review.Happy Shopping!", "Title": "Great tablet for the gamer who prefers Android", "Date": "July 19, 2013"}, {"Author": "ikonkar", "ReviewID": "R20SUP6L8SBEJF", "Overall": "4.0", "Content": "The tablet isn't a 10 inch although a it might seem small to an adult, but you have to look at this in a kids perspective. My son thought the size was perfect he has some cousins with 10' tablets and he thinks they are huge and doesn't like the way he has to hold and carry them. He has stated that he's likes that it's small because the others are TOO big. The tablet works great it's just like a huge phone I let my son use my phone all the time so he already knew how to navigate and work with it. That would only apply I suppose if you have a Android like I did before. My windows phone is more similar to android as well than Apple would be I suppose so he didn't have to learn much.The control- Well I gave it 4 stars because the area to connect the power cord already broke on the controller. Many state it feels a little flimsy it does, but it's not that bad it feels as good as an aftermarket control you would buy for a xbox or playstation. Many complain about the size of the control, I don't see the problem me and my son both will dock the tablet to the controller when watching movies because it gives us something to hold instead of holding it right near the screen just feels a lot better in my opinion. My son is 7 his hands are a little bigger than most 7 year olds I don't know if that has anything to do with it or not but he can function the controller with no problems.The charger- another reason I gave it 4 stars. The charger is not your regular charger and is hard to find you basically have to order it from the company along with the mini usb cord which isn't standard as well. They pulled an Apple on this one I hate when companies do that. Make non-standard equipment just to boost sales ridiculous.Audio- It's low as everyone has said the sound of my Lumia 1020 phone is louder than the tablet, just something you've got to live with it's a curse and a blessing. Blessing because when my son uses it, it doesn't annoy me to death like the audio from my phone when playing games lol! But when were watching a movie on it in bed or traveling on the highway you would wish it was a bit louder ear phones sound great on them though for traveling he uses earphones. It is what it is, I haven't gone out and bought any mini speaker or anything to attach to it so it's not that bad if so I would have bought one by now.Anyway I don't regret the purchase nor does my son works great at home, on the road, or at family members home. Hopefully they can make it a little better more durable on the power sockets on the next version and stop with the non-standard stuff.", "Title": "Worked out great for my son!", "Date": "March 6, 2014"}, {"Author": "Brian Cady \"B Cady\"", "ReviewID": "RTP7FXW8X9QK", "Overall": "5.0", "Content": "This is an amazing device for road warriors.  Great quality hardware, easy to find buttons, great sound, fast processor and the best gaming control I have seen for any tablet devices.Everywhere I go I get questions and comments due to the cool nature of this device.Buy one, you will not be disappointed.", "Title": "Amazing for mobile gaming", "Date": "August 23, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1438N91X8BL3S", "Overall": "5.0", "Content": "IT NEEDS ONE MORE GIG OF RAM THEN IT BE PERFECT PLUS S0ME BETTER SPEAKERS OTHERWISE IT IS WHAT I HAVE BIN LOOKING FOR ALL MY LIFE", "Title": "MORE RAM", "Date": "August 18, 2013"}, {"Author": "Hellcatenstein", "ReviewID": "R35QZKH1N4KMVO", "Overall": "4.0", "Content": "I've owned this tablet for about a month now, and can safely say that I enjoy it a great deal as a tablet.  It's quick, the screen is clear, and has a lot of hardware features built into it.  As a gaming device, I'm not quite as satisfied.First off, the positive aspects.  The Wikipad has a Tegra 3, which is a great little mobile processor.  It's got a nice 720p screen which has a \"60\"hz refresh rate(it's like 59.9999995hz).  The controller attachment is a comfortable and functional \"Xbox 360-like\" controller.  The tablet has access to pretty much every game on the Play Store, and also has access to the Playstation Mobile store, which is a neat little bonus.  Additionally, it has an Micro SD card slot, which supports up to 32 gigs, which SHOULD be a good thing, but isn't completely.Now the negative aspects.  The battery life isn't terrible, but leaves a lot to be desired.  The battery drains incredibly fast while the controller is attached, so keep that in mind.  The controller itself is only partially supported by some games, and only fully supported by a handful of others.  There's no virtual button mapping as of yet, though the developers claim to be working on it.  Specific issues are with the L2/R2 triggers, and the D Pad, as nothing seems to want to pick them up as actual, available buttons.  The Mirco SD card slot is great, except that the version of Android running on the tablet does not support transferring installed apps onto an installed Micro SD card.  Good for ROMs, not so great for actual Android games.I would definitely recommend the tablet, as it still works great as a regular tablet, and has the added bonus of gaming options available.  It has a lot of potential, but it's left to the developers and modders to develop the product further and make it a truly great machine.", "Title": "Great little tablet, good gaming device", "Date": "August 13, 2013"}, {"Author": "Pen Name", "ReviewID": "R2JLVPRDCZXPRL", "Overall": "4.0", "Content": "The Wikipad is awesome, but it needs more RAM. Keep Working on it. Other than that it's a great product.", "Title": "RAM", "Date": "October 6, 2013"}, {"Author": "M. Wilson \"ghosthead\"", "ReviewID": "R1OL2WCXHMOT1O", "Overall": "3.0", "Content": "While this is a decent tablet in and of itself, and the controller attachment IS a nice touch, I've had far better than this device. Like others have said...- The battery life leaves quite a bit to be desired, lasting only about three or four hours per charge.- The speakers are incredibly poor that you almost have to hold them up to your ear to barely hear them on your highest setting.- While you literally have to press hard on the power button for it to register so it can boot up.Those three issues are the main reason I would NOT recommend this product. Just save up another hundred dollars and buy a better made tablet.", "Title": "I've had better...", "Date": "May 18, 2014"}, {"Author": "jerimiah", "ReviewID": "R3TQ77BAUHZRX3", "Overall": "5.0", "Content": "The wikipad let you add game mapping control to  touch screen game that don't have controller support.The Holding the controller part of it feel like a Real game pad controller and fee conformableGood Device to have to play own Classic game with emulators", "Title": "It good Gaming Tablet", "Date": "March 21, 2014"}, {"Author": "Vincent Giardina \"VINMAN\"", "ReviewID": "R34QKF44MCSJWI", "Overall": "5.0", "Content": "This is the best 7\" gaming tablet hands down and with the controller \"home-run\"  as for the tablet great for emails, movies surfing on line.  Well made", "Title": "This is a quality tablet", "Date": "December 8, 2013"}, {"Author": "Chris Kinney", "ReviewID": "R1XYNRTG9MH8PE", "Overall": "5.0", "Content": "It runs all my games great. I really like the controller, it feels like an Xbox controller. The games are fun. The battery life isn't very good though.", "Title": "Its an awsome tablet.", "Date": "November 1, 2013"}, {"Author": "NathimusPrime", "ReviewID": "R2EUJNPGYXZ4VH", "Overall": "5.0", "Content": "ProsThe controller is comfortable.The library is large and growing.Without the controller the tablet is fairly light, and the logo on the back makes it easy to hold.Makes emulators better then ever!ConsThe specs are a little average for gaming, some of the more graphicly intense games won't run well on the highest settings.The device gets hot doing basic things.Leaving it in the dock when on standby drains the battery.Overall I'm very pleased with it. I love the controller dock, I love the games, and the game library is great.", "Title": "Okay tablet made great by the controller.", "Date": "November 1, 2013"}, {"Author": "matthew", "ReviewID": "R1BMRJP1OGJT54", "Overall": "5.0", "Content": "Great little Tablet very very fast - the controller  really works well -  my son loves this tablet great for road trips and rewarding homework.Does email, everything you want Netflix, Amazon Prime and whip fast to get on the internet - great backlight for reading compatible with all Kindle books great device.", "Title": "MY REVIEW", "Date": "June 22, 2013"}, {"Author": "Nelson", "ReviewID": "R3NPGI2E620K39", "Overall": "4.0", "Content": "The Wikipad is a great Android tablet for the price of only $200 dollars, any game you throw at it will run at ease. But I find many things wrong with the Wikipad, one is the HORRIBLE battery. Wikipad team, make power efficient kernel or start shipping with bigger internal batteries, now. Oh, but the battery is not the only thing that bothers me. Micro USB was never great to start with, I wish it was a MINI USB instead so it wouldn't break and make the Wikipad UNCHARGEABLE WHATSOEVER. While it lasted though, I found one of their OTA updates to cause color bit issues, making the visual experience questionably bad. While gaming, the screen is still usable, but why does the controller ergonomics be so BIG!!? It dwarfs my hand and make it mildly awkward to grip, but I got used to that and continued to play until either my hands get tired or the battery dies, usually the latter, due to it's low cap battery. Speaking of batteries, it takes AGES for this tablet to charge, which is bad because I am missing out on what Wikipad has to offer, which I can feel is that they have A LOT to offer in this package. The packaging took the form of an extremely high quality shoebox with adequate foam protection to prevent damage during shipping, which I find unnecessary, as this can survive several drops, albeit one time a drop knocked the backplate clean off, which was kind of big deal as it allows dust to enter the screen, which is KILLER on my OCD. I HATE DUST. Anyways, the plate did not get damaged, so I snapped it back on, dust forever trapped in the tablet... *sniffle*I've been rough on the tablet, but even after all of those bad things (except the micro USB port, which is unusable in my tablet's state. May RMA.), I still feel that Wikipad (company) has made a tablet that is great (as this is I assume their first and only tablet), but could be WAY BETTER if all of the issue aforementioned were addressed and fixed.Wikipad, it's a good tablet. But the saying \"If it ain't broke, don't fix it\" still applies, and as aforementioned, there are a LOT of things that are broken and needs to be fixed. Looking forward to Wikipad Revision 1!", "Title": "Portability limited by it's small battery, plus some other minor complaints.", "Date": "April 22, 2014"}, {"Author": "Lakshmi Narayan", "ReviewID": "R1SIIV4XDAM3B2", "Overall": "3.0", "Content": "not many games support the controller,not a single racing game that i tried was supported by this controller.(so Disappointed )", "Title": "Not many games support this controller", "Date": "November 3, 2013"}, {"Author": "Echo", "ReviewID": "R3US09IWPUMDYZ", "Overall": "1.0", "Content": "I bought this tablet PC few days ago, and downloaded some games, but couldn't play with controller. When it's charging, the AC adapter was very very hot and had a bad smell. So I returned.", "Title": "AC adapter is too hot!", "Date": "September 12, 2013"}, {"Author": "theshonen8899", "ReviewID": "RTR0X8DV6HT8N", "Overall": "2.0", "Content": "I've been waiting for this device to come out since last year's CES when it was first announced. Back then the idea of a $200 Tegra 3 tablet with a $50 controller attachment was unthinkable. Then Google I/O happened and the Nexus 7 was unleashed upon the world. We have since had two generations of Nexus 7, and now the Wikipad has the gall to launch at $250 with the exact same specs as the old Nexus 7. Same CPU, same amount of RAM, same screen, same form factor.Compared to my first gen Nexus 7 (I don't have a second gen to compare it to), the device is noticeably thicker. It has this odd ridged square on the back that helps slide the tablet into the controller. It helps with holding the tablet but makes it difficult to find cases for and doesn't slide into my back pocket the way a Nexus 7 would.The controller feels comfortable enough but I am not at all a fan of the concave analog sticks and the horrible 360 style D-Pad. It's also incredibly huge and bulky, it reminds me very much of my old Sega GameGear. I find it odd that they chose such an enormous design, since it's hardly portable. I've found that using a PS3 controller with a GameKlip attachment on a Nexus 7 or smartphone to be a superior setup. Game compatibility is also a problem so be sure to research whether or not this gamepad will work with your game.I'm not entirely sure what the WikiPad is aiming for. It's priced competitively against the new Nexus 7 despite being profoundly inferior. It's functionally competitive with the nVidia Shield despite being significantly weaker , less portable, and less comfortable. At the same time, it uses Google Play, TegraZone, and PlayStation Mobile, meaning it's not making any cash on software purchases and is purely trying to establish profits through it's lackluster hardware, unlike the Nintendo 3DS or PS Vita.I advise the Wikipad team to either step up their tablet game or simply try to create controller accessories for superior products. This isn't going to cut it.", "Title": "A Last Generation Nexus 7 with an expensive controller", "Date": "August 18, 2013"}, {"Author": "nats", "ReviewID": "R2QNPSYRAB8N7L", "Overall": "1.0", "Content": "Worse thing I ever bought.  Looks like just another scam to raise money for a few of the guys.  Stay away get a Asus or Acer if you like windows or any other droid tablet.So sad I lost money on this junk.", "Title": "coo", "Date": "September 20, 2013"}, {"Author": "C. Chu \"Critial Thinker\"", "ReviewID": "R2VV4XLDNKJIFX", "Overall": "1.0", "Content": "Is it just me or , these are weird Non-Verified Amazon reviews for WIKIPAD?ARe these the employees or owners writing these reviews?", "Title": "Weird reviews from people who are not Amazon Verified Purchase", "Date": "July 11, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00DE2EKSE", "Features": null, "ImgURL": null, "Name": null}}