{"Reviews": [{"Author": "Nina Twyman", "ReviewID": "RC01B54O1JJWR", "Overall": "5.0", "Content": "I have to say, using this tablet is nice. It's fast and easy to use. I would recommend this tablet to others. Battery life is not that long and I noticed that when it was plugged up all night and I had it unplugged for an hour with not much use to it because I was getting my WIFI together and after an hour I have 74% battery usuage left. I love the color. The screen is clear.", "Title": "Great Buy", "Date": "October 8, 2013"}, {"Author": "Disappointed", "ReviewID": "RZBDYZNG6N6BX", "Overall": "4.0", "Content": "This is a good tablet for the price. I recommend that you buy additional memory card at the time of purchase.", "Title": "This is a good tablet for the price", "Date": "October 5, 2013"}, {"Author": "angie", "ReviewID": "R1UHASS8Z5HK0", "Overall": "5.0", "Content": "The tablet arrived sooner than expected which is a plus.  Also, really easy to set up.  I would definetly recommend this to all of my friends.  Great product for a great price. Amen", "Title": "love iiiittttttttt", "Date": "October 17, 2013"}, {"Author": "Regina A.", "ReviewID": "R2RZWJX0HLMDO0", "Overall": "5.0", "Content": "I purchased this tablet for my son.  It works fabulous for the avid app gamer and at an unbeatable price.", "Title": "Wonderful tablet for Gamer Apps", "Date": "October 22, 2013"}, {"Author": "Michaela L. Landwehr \"mland22\"", "ReviewID": "R4RJBNLOB9OW0", "Overall": "5.0", "Content": "Super happy with this tablet! I was looking for something inexpensive but proficient and this was both. I plan on buying a few more for my kids.", "Title": "Just what I wanted!", "Date": "October 24, 2013"}, {"Author": "Leroy Svoboda", "ReviewID": "R3P3UWQ7G4QG33", "Overall": "5.0", "Content": "Bought this for our 6 year old grandson and was perfect for him.  Great product for the price. Like the colors", "Title": "Great Tablet for elementary age children", "Date": "November 23, 2013"}, {"Author": "tamntn", "ReviewID": "R1H3WVCOLPCS4J", "Overall": "4.0", "Content": "...until it stopped charging. I probably just got a defective one.  I liked the speed of the WiFi and the speed of how quickly it charged when it was working.  There was no delay in reading books, playing games or being on the web.  For the price, it was a good little tablet.  I could have exchanged it, but just didn't want to go through the hassle should the next stop charging as well AFTER the 30 days from purchase was up.  The company was GREAT to deal with and I appreciated the ease with which they handled the return and refund, the quickness of their replies to each email.", "Title": "Product was good...", "Date": "November 12, 2013"}, {"Author": "AVH", "ReviewID": "R24NV7EJYBC1AY", "Overall": "5.0", "Content": "Tablet Is Easy to Use and Good Value for the Money..Definitely worth buying if you are interested in a cheap tablet.", "Title": "Great Tablet", "Date": "October 15, 2013"}, {"Author": "Candice", "ReviewID": "RKA3YHX9EYB8K", "Overall": "5.0", "Content": "We bought this for our 9 year old son for Christmas. Now, he can not rate on it yet, but my husband and I love it -we have been playing on it to make sure everything works on it. It is a wonder tablet, works great and fast - there is practically no lag time, which is a first for us. We love it, and will hate to have to give it to him, but I know that he is going to be so excited and beside himself come Christmas morning! I like the fact that you can get them in different colors - better to personal our childrens personality.", "Title": "Hate to give it to them . . .", "Date": "September 19, 2013"}, {"Author": "JOSH L", "ReviewID": "R10BY4DH92TZRN", "Overall": "5.0", "Content": "I love this product. The speed and accuracy of which it was received was unbelievable. Very Good Price, unlike the other Name Branded Companies out there. This was the first purchase that I have made with Amazon and I dare to say that this will be one of many. Great job! Awesome product and service.", "Title": "Bang for the BUCK!!!", "Date": "August 9, 2013"}, {"Author": "Angel", "ReviewID": "R1GTNLH8RKMW3G", "Overall": "5.0", "Content": "great product at a great price.  was great havingapps like angry birds and other games. I bought two and they were ready to go out of the box..the kids didn't have to wait for me to have time..  I recommend this product.", "Title": "excellent deal", "Date": "December 11, 2013"}, {"Author": "Daryl King", "ReviewID": "RQBYBIXLIVFD4", "Overall": "5.0", "Content": "I bought this for my son.  I tested it before I gave it to him and am very impressed.  It's a great starter pad for anyone.", "Title": "You got my vote.", "Date": "December 9, 2013"}, {"Author": "E.K.", "ReviewID": "R1LBAWPXSMWV3", "Overall": "1.0", "Content": "I can't set any kind of parental controls, and the internet will not hook up. Even though the wi-fi is on, it continues to tell me that it's unsupported. It is completely useless.", "Title": "Doesn't Stand Up", "Date": "November 21, 2013"}, {"Author": "numba9", "ReviewID": "R3MM7B6GNPCWZ5", "Overall": "5.0", "Content": "This is a great tablet, it has great colors for playing the apps. games look good and move at great speed. I bought this for my teen son and he just loves it. Skype is easy to use, Google Play is simple use. I love the fact I can come to Amazon android order apps, and when he goes on line they download the apps to it. Download is fast easy to use. battery time is about 2-3 hrs. Recharge is fast. Suggest you order screen protectors for it, my kids like to touch it with dirty hands alot. They say to use a External SD card, but it is not that easy to make Google Android pick it up, there is 2 apps you will need to hook the external SD card to link with the one inside.I suggest you use Amazon Andoid Apps if you can, after you get tired of a game you want to unistall it, Amazon holds you apps in it folder and it is very easy to just re-load if you want to play it again, take out your old apps to make room.Put a cleaner app in it, after each day it will remove the junk you may of got while on the net and it boost the speed greatly of the hard drive.Now I did have one issue with them, because they fixed the issue, I will not say what it was. had nothing to do with the Tablet as for how good it works. The Customer Service is OUTSTANDING, They will try their best to help you with any problem. For that I would give them a extra star if I could.I have 4 teens in the family, so I am going to order more for Christams from them. The price is great, you get a lot of features for the price you pay. If you got kids or even for adults this is a very smart item to buy. It is worth every penny you pay. Also I got this very fast after my order was made.Music sound okay, better when ear phones, have little kids, then they will be able to use it easy and play their games.Watch out for one thing, it is habit forming, just cant seem to put it down.One Hint, please contact Customer Service first, they do go out of the way to help you. If you have any kind of problem", "Title": "Simple- Fast Tablet Great Customer Service", "Date": "December 5, 2013"}, {"Author": "Old Man77", "ReviewID": "R3MCUY3UC4HYTC", "Overall": "3.0", "Content": "Nice overall performance. It is the first device of its kind for me. My problem is with the user \"manual\"; obviously translated by someone with poor English skills and hastily assembled to be read  by computer novices like myself.  There is a slot marked \"TP  CARD\" that is a mystery. Amazon does not market such a product. It may be a micro SD card slot (???).", "Title": "Google Fast Touch", "Date": "November 5, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3GGT9YVZ8MPFE", "Overall": "5.0", "Content": "Purchased this tablet for my son and am so amazed by it that I wish I had bought a bunch more. I love the dual camera and the color. It runs great and I was able to download games for my son and play them easily. Subway suffers is his favorite and it runs like pro. I didn't know what to expect when I purchased it but am so happy with my purchase and I cant wait to see my sons face Christmas morning.", "Title": "Love it!", "Date": "October 24, 2013"}, {"Author": "sharon", "ReviewID": "RWBTW5ON69JXU", "Overall": "2.0", "Content": "I purchased for my grandson so he would  not bother my IPad.  But  this does not work well. Not enough memory. I returned after a week. Freezes alot and slow.", "Title": "Not Good", "Date": "November 20, 2013"}, {"Author": "T30", "ReviewID": "R2VZV7DRV3E4G", "Overall": "5.0", "Content": "I really enjoy my tablet n the color its simple to work n I can put it in my purse ..love it", "Title": "My New Blue Tablet", "Date": "October 24, 2013"}, {"Author": "Bruce Whitehead", "ReviewID": "RTIASA4KWBTZO", "Overall": "5.0", "Content": "I've had a lot of tablets over the years with many costing $500 - $600. But for the money, this is one of the best. Got it for my grandson and he loves it. Bright blue is nice color for kids (and adults!)", "Title": "Best Deal for the Money", "Date": "October 20, 2013"}, {"Author": "Samantha", "ReviewID": "R3EU5NHXLJOYIB", "Overall": "5.0", "Content": "We bought this tablet for our daughters 4th birthday to assist in learning apps. As I was downloading apps I became attached. I see another purchase in the future.", "Title": "Definitely worth the money!", "Date": "October 18, 2013"}, {"Author": "Tressa Winters", "ReviewID": "R9Z7CFLR3FWVC", "Overall": "5.0", "Content": "My 6 and 8 year old both received tablets and this one is definitely the one I recommend. It works great and runs much faster than I expected. The quantum axis tablet my 8 year old got had to be returned within days of receiving it for defects.", "Title": "Love it", "Date": "January 28, 2014"}, {"Author": "amelia", "ReviewID": "RHVKNNTBN4PBA", "Overall": "2.0", "Content": "The screen freezes and one of the tablets came crack in the screen i have no time to going back and forth so i just left it like that.. but thank u for asking i cant expect much for the price that i bought it for..", "Title": "Theres not much more to say...", "Date": "January 27, 2014"}, {"Author": "J. jernigan", "ReviewID": "R1DPCHFMXX10YZ", "Overall": "4.0", "Content": "I can't really rate this project well. We bought it for our daughter who is 6 and 30 minites after opening it she dropped it and the screen shattered and quit working. However I did have an oppurtunity to download lots of apps on to it prior to her getting it. It was easy to use very pretty. If its for a child, I recommend buying a protection case along with it.", "Title": "tablet was great", "Date": "January 18, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3D2HWTW6MWMXZ", "Overall": "3.0", "Content": "I had a pandigital before & this is much slower & doesn't download  apps very well. Doesn't work as well.", "Title": "Not as reliable as I thought it would be.", "Date": "January 16, 2014"}, {"Author": "ErinO", "ReviewID": "RQ3LENJXEDMGV", "Overall": "3.0", "Content": "This one never turned on but they are happily replacing it. Will update with more info after we get the replacement.", "Title": "More info later!", "Date": "January 11, 2014"}, {"Author": "Craig A R \"CAR\"", "ReviewID": "R2LB9KZZHNSHY6", "Overall": "4.0", "Content": "This is the 3rd FastTouch tablet purchased.  First two as gifts and purchased Square Trade warranty with them.  Good that we had the warranty as my wife dropped one of the grandkids tablets and broke the casing and the on-off switch.  Square Trade warranty worked as advertised and they reimbursed the full cost of the broken tablet, so I could order the same one as a replacement.  I also ordered a protective case as well this time.  Tablet works better than I expected for the price, but is not very durable if dropped.  Buy a case and the warranty with it, you'll be glad you did.", "Title": "Replacement for broken tablet", "Date": "January 10, 2014"}, {"Author": "Sharon Daniels", "ReviewID": "R2W7FAMPY21K9R", "Overall": "5.0", "Content": "I had originally gotten my son the Kindle Fire and then he upgraded to the Kindle Fire HD, he was so disapointed because he was so limited with down loads and what he could do with the camera. He pleaded with me to go for this tablet. I figured for the price why not. I cannot even find his Kindle Fire HD, I believe he may have tosses it because he now has the ability to download all android alps and the picture quality is great. Last but least he can go on all the site needed to do his school work. My son is happy and so am I dispite the fact I have no clue of where that other tablet is. lol.", "Title": "Must see review", "Date": "January 9, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3M9SYIM8FO6X9", "Overall": "3.0", "Content": "Pros: lightweight , nice color, great price, lots of free apps, parental lock, better than advertised!Cons: only holds charge for 2-3 hours, not much memory( I bought an extra SD 32 memory card and have no problems), doesn't handle fast paced games well (ie. Subway Surfer), too many sexy pop up ads( I mean seriously unappropriate ads)", "Title": "Great buy for a child! My 4 year old loves it ! Very happy!", "Date": "January 7, 2014"}, {"Author": "Russell Ridenbaugh", "ReviewID": "R1OEJTXURHCE17", "Overall": "4.0", "Content": "Very pleased with the tablet as it does all that it says it does is very easy to use carry with you", "Title": "Google Androie 4.1 Tablet", "Date": "January 3, 2014"}, {"Author": "SUSAN GROS", "ReviewID": "R1K2MLEI71F5Q7", "Overall": "4.0", "Content": "only one issue the battery life is not that long other than that its good. Lightweight and easy too use", "Title": "good product", "Date": "January 1, 2014"}], "ProductInfo": {"Price": "$139.99", "ProductID": "B00DP4FN3W", "Features": "Android 4.1 Operating System (Latest 2013 Model) By FastTouch(TM)\nAllWinner A13, Cortex A8, Capacitive Multitouch Screen\nBuilt in WiFi, Camera, Latest Apps (Facebook, Twitter, Angry Birds, Netflix, YouTube)\nLight Weight And Easy To Use, Comes Ready To Go\nBox Includes (Tablet PC, Wall Charger, Screen Protector, Stylus Pen, Manual, USB Cable and EarPhones)", "ImgURL": "http://ecx.images-amazon.com/images/I/413lfjnEnHL._SX300_.jpg", "Name": "7 Inch FastTouch(TM) A13 GOOGLE Android 4.1 AllWinner Tablet PC, Boxchip Cortex A8 1.2Ghz MID Capacitive Touch Screen G-Sensor WiFi, Camera, Skype Video Calling, Netflix Movies, 4GB BLUE"}}