{"Reviews": [{"Title": "A Child's First Tablet", "Author": "Dianne E. Socci-Tetro \"Never Judge a Book by ...", "ReviewID": "R2IJXASDSTZWGX", "Overall": "3.0", "Content": "From the product description:* Full fledged 7-Inch Android Tablet display with 1024x600 Pixels* 4GB Storage plus an expandable MicroSD slot* Tablet changes into your favorite character with app card and bumper kit* Features rear and front cameras* Parental control capabilityMake no mistake about this product... this product is *really* geared for the very young crowd, and I can see that it is a good product to be a child's first tablet.  There are a lot of educational games loaded on it and for an extra cost you can dress it up in several different ways that will make each child sharing this, happy - but you poorer! The parental controls are strong.However, it is something that adults can use too if they do not mind all the constraints.It is easy to set up and it is mostly intuitive for anything else you need to do.CONS -----------> It is slow, slow, slow.  Installing anything that isn't already installed, can take hours and the Camilio can and will freeze up when down-loading.Wi-Fi is sporadic no matter what your other Wi-Fi products tell you.  I had a very strong signal on my Kindle Fire, my phone and my net-book; they all opened no problems - but the Camelio kept telling me I had no inter-net connection. What can I say?  It can take quite a while to connectThe battery does not retain a charge for more than 4 hours while the product is being used.It heats up fast, but not to a worrisome temperature.  I noticed that the back cover got very warm if left on a table on top of a magazine for an hour or so.  Moreover, this is while it was off.This is the worst, and biggest drawback for me  - the colors used and the contrast of them (Pale color back-grounds with only slightly darker colored letters --- I cannot find a way to change this) are such that it is *extremely* difficult to read anything that has already been down-loaded, so that took care of  most of  what an adult would use this for. Watching to see that revolving circle that lets you know a page is loading is impossible.  (And the page usually times out and these are the apps that are already loaded in here.)The camera's make it easy to take selfies, film videos etc IF you can figure out how to use them.No matter what button you push, such as the \"always\" button -the Camelio is ALWAYS going to ask what browser you want to use -I find this annoying, but  I can live with it.You had better be a huge Google fan; it is dominated by Google apps. Among other thingsI didn't find the camera to be intuitive to use.  I found them difficult at best to use. As a matter of fact after 3 days I still can't figure out how to switch them from taking self portraits to taking regular pictures. There is no info in the user's guide about the camera's use and there is no information on their web-site or the down-loaded owner's manual.PROS----------------------->Inexpensive for what you CAN do with this.For a kid, it is a thrill to have a tablet just like Mom or Dad.  This could be a good way to go.It is  great for a serious reader. It is cheaper to down-load a Kindle app and use this for reading, although an app. really ca not do what the real thing can.I liked being able to use the sound bar to turn pages while I was reading - this was unique.It is light, slim and difficult to destroy (I tried).Getting help with anything was less than useful. Using the manuals, whether the down-loaded one or the written one is only helpful to set up your Google account and to learn how to buy and install the theme  packs.So, all in all you pretty much get what you pay for - a childs first tablet - difficult to destroy, educational and fun.", "Date": "September 28, 2013"}, {"Title": "Perfect family tablet!", "Author": "Genevieve", "ReviewID": "R1P6L0ZNH011ZU", "Overall": "5.0", "Content": "I bought this tablet for my son for his birthday, and I couldn't be happier with it!Here's what I love:1. The entire tablet can be \"skinned\" to be whichever character you choose (!!!). I bought the Hot Wheels Personality Pack Camelio Tablet Hot Wheels Accessory Pack (ACC-CAM84) It is an awesome Hot Wheels case (gel and a hard case, so it definitely is shock-absorbing), but what's even better is how the tablet changes on the inside. The main screen is a Hot Wheels screen, the address book is Hot Wheels, the camera is Hot Wheels, etc! Side note on the camera -- the camera app also has Hot Wheels frames and \"clip art,\" so my son took a picture of himself with his sister and added the Hot Wheels logo and a few stickers/\"clip art\" things -- he thought it was the coolest thing ever!2. It is an Android tablet with Google Play Store. A lot of tablets that are on the market for kids don't have the Google Play Store and you can only add apps that are available in their own store. The problem that I have with that is the prices are insane because it is a monopoly and they don't have everything my kids want. I downloaded a couple of apps that my son loves playing on my iPad, and he loves it -- honestly he loves it even more than the iPad since it is his own tablet with Hot Wheels :)3. It comes with a bunch of apps already. Moment of mom honesty -- I was having a crazy day on his birthday and unfortunately barely had time to stop and celebrate with him... the last thing I needed was to be stuck trying to configure it. It was ready to go right out of the box, which was a lifesaver for me. For example, MeeGenius is a very cool app that it comes with which helps kids learn to read and he loves that too!4. Parental Controls were a cinch to set up! I chose what I wanted him to have access to and he isn't the wiser :) I haven't found any apps on it where I can limit how much time he can spend on the tablet, but to be honest, I think parents who need technology to monitor their kids using technology need to get off their cell phones and engage with their kids. Just tell your child to put it down and play a game with you!5. BEST OF ALL: I'm buying my daughter the My Little Pony Personality Pack for Christmas and the two of them can SHARE the tablet! It says it can have up to 5 different \"themes\" -- I haven't tested this yet, but it seems very easy to add another character and they both will get to play (and even learn) on the tablet with their favorite character. Camelio Tablet My Little Pony Accessory Pack (ACC-CAM57)Overall, I could not be happier with my purchase. Kids love it, they can share it, it is an excellent value (especially considering that it is a tablet, not a toy). It has great wifi, 2 cameras, Google Play Store, great \"touch screen\" -- everything I wanted and I'm shocked I could get for the price. Highly recommend!", "Date": "November 12, 2013"}, {"Title": "Decent starter tablet for kids & families with a small budget", "Author": "Rebekah", "ReviewID": "R2OFNI6BX28R8N", "Overall": "4.0", "Content": "Let's face it, if you're going to buy an iPad, you're going to buy an iPad, and nothing is going to deter you.  But if you don't have the cash for a pricey tablet, or don't relish the idea of your expensive tablet being left behind a rocking chair by a child only to hear a sickening crunch sound when you sit down (true story!), then chances are you're looking for tablet functions and entertainment without a huge investment.Both my kids (ages 13 & 10) and I played around a lot with the Camelio, adding and using many of our favorite apps.  My kids each have the original Kindle Fire, and I have a Toshiba Thrive, for comparison.- The interface was easy to learn and work with; if you're used to Android, this will be a snap for you to start using- The screen is bright, clear, and colorful- My kids both said playing their games felt exactly the same as on their Kindle Fires- The Camelio is the exact same dimensions as the original Kindle Fire, so my kids' accessories (covers, screen protectors) fit the Camelio just right- The Camelio is 11.8 oz, while the original Kindle Fire measures in at 14.2 oz- The parental controls are easy to set, and are a necessity, in my opinion, as a family with kids- I felt it was a bit more pixelated, and occasionally pokey, depending on the app I used compared to my Thrive, which could have been due to file size or the app design, but in any case it wasn't very noticeable most of the time- At times,we had trouble picking up the wifi in our home, in places where our other devices don't have any trouble, which was frustrating- The power button is right where the ball of my right hand rests when holding it in portrait mode, resulting in some accidental power-offs when I was still using it- The back of the Camelio feels more hollow than our other devices, somewhat cheap- When the battery has fully died and you plug it in, it will not power up right away on the charger.  Rather, I ended up having to wait about 5 minutes before it would start- The personalization packs are an added expense, and are not necessary to make good use of this tabletFor the price point, this is a decent starter tablet for a young person or for families with young kids.  The quality is lower than high-end devices, but not so much that kids will care.", "Date": "November 8, 2013"}, {"Title": "Absolute JUNK!!!", "Author": "dinko1x", "ReviewID": "R3PJGZHCZ1YVLS", "Overall": "1.0", "Content": "I bought two of these from a local store for Christmas gifts and have had nothing but problems with them. They were great the first day. I had them all charged and ready to go.The first one was all setup and my son (6 yrs.) was having a great time using it Christmas day. He brought it to me the next day saying it had lines on screen. When I looked at it I could see some micro cracks in the screen. It has since grown and he longer can use the tablet. I am researching to see if I could get it replaced.The second was also all setup and my daughter (8 yrs.) is using hers, but it has developed an issue with the charging connection. You place the charger into the connection on the tablet and it feels loose. You have to angle the connection to see the charge light come on.The battery also is crap - barely lasts 4-6 hours, if lucky. I wish I would have just bought a Fire or Galaxy Tab.Oh by the way I have emailed Vivitar multiple times, but keep receiving a 'bounce-back' from the email address listed on the website. Trying to call is also a joke as I cannot get ahold of anyone.STAY AWAY!!!", "Date": "January 20, 2014"}, {"Title": "crappy batteries", "Author": "natashia peebles", "ReviewID": "RAIEE25RKBQTM", "Overall": "1.0", "Content": "I had to return both tablets because the did not charge. They also had very finicky screens, which made it had to use them", "Date": "December 30, 2013"}, {"Title": "Buy something else...anything else!!!", "Author": "MommyOfZaria", "ReviewID": "R1UT4SNT6GQAHY", "Overall": "1.0", "Content": "We bought two of these tablets, 1 hello kitty theme kit and 1 my little pony theme kit.  Vivitar doesn't tell you that the theme kit serial number is for one time use.  In case you don't know, the serial number is used to activate the wallpapers and change several other apps into the theme you purchased.  I always test electronics before giving them as gifts. The problems I've had are present on both tablets.I downloaded several apps and immediately noticed the shortcuts to the apps kept disappearing when switching from a horizontal view to a vertical view.  I should have returned it all to the store at that moment, but no, I called Vivitar instead on 12/9/13.  At this point, I only had the my little pony tablet in my possession.  The hello kitty tablet was in another state with my sister. I explained this to the rep.  He says it's fine and to call them back when I have the other tablet to be walked through for the fix.  Vivitar notified me that the fix is to reset the tablet to factory settings.  I let the rep know that I have already installed the theme kits.  I'm told it's no problem and they will replace the theme kits by mail.  He walks me through it, I re-downloaded the apps and everything seemed ok.Since the hello kitty tablet was in another state, I got my sister to call to get it reset to factory settings and remind them to replace the hello kitty theme kit.  The rep gets nasty with my sister because he doesn't want to replace the theme kit.  At this point, I called back to remind them of what they told me.  And I should not have to lose money because both tablets were defective out of the box.  The theme kits cost around $30 each, so that was $60 I spent on personalization products that I couldn't use because I can't re-install the theme kits with the original serial numbers.  The rep speaks to his manager and they say they are shipping a second replacement theme kit.It is now 3 days before Christmas and I have yet to receive the replacement theme kits!So tonight I've been trying to use my own background photos.  I have both tablets in my possession now.  The tablets force me to crop my background photo no matter what size it is.  I am forced to crop only a small portion of the photo for use.  This is annoying, but I thought I could work around it.  The big problem now is that the tablets automatically revert back to the default Vivitar theme. No matter what background you choose (be it yours or pre-installed backgrounds), after a minute or so, it reverts to default theme pack.  UGH!!And guess what...my shortcuts are now disappearing every time an app does an automatic update!Save your money, Save your time, Buy something else.", "Date": "December 22, 2013"}, {"Title": "Great Kids Tablet", "Author": "Chris & Melissa", "ReviewID": "R3QQ4FH0K7O6KC", "Overall": "1.0", "Content": "Great tablet for kids...  It's small and runs pretty good.Only complaint is that the processor on it isn't fast enough to keep up with games that have a lot of movement going on.1/4/13 Edit: Sending tablet back!!  You can't move apps to and from the SD card if you choose to buy extra storage!! This was confirmed by Vivitar itself... So beware, with all the Google crap that's put on the tablets, that is not removable, we only had room for about 5 or 6 games for the tablet.  Very disappointed. Going to spend the extra $40 and get a Kindle Fire HD", "Date": "December 25, 2013"}, {"Title": "Junk", "Author": "Shawn McKellar", "ReviewID": "RB1KFS6XA88V7", "Overall": "1.0", "Content": "I did not buy this tablet from here, but these tablets are junk.  My wife bought two of these for Christmas, one for each child.  After about a month one of the tablets froze up.  You could turn it on, but the screen froze up and you could do nothing with it.  I returned it and the second one had no sound.  The volume was turned all the way up and still no sound.  I talked to my nephew, and he was having trouble getting it to charge.  Please do your self a favor and do not buy this tablet, they are absolute junk.  I would give it zero stars if I could.", "Date": "January 18, 2014"}, {"Title": "A Decent Starter Tablet", "Author": "Scooter McGavin", "ReviewID": "R1MXI4YBM86UUT", "Overall": "3.0", "Content": "I have held off on owning a tablet because I really never understood what it would be used for.  What is nice about this tablet it is easy to use with many pre-loaded apps on it, many that you would probably want on it (at least of the free variety).  And it is easy to go to the Google Play store to download some more which was easy to purchase and download to the tablet.  I am not sure if it will be as easy if you do not already have a Google account.  Same goes for Chrome which automatically loaded all my setting, bookmarks, and history from my computer.There are a few drawbacks, most notably it reboots sometime quite frequently.  I originally thought it automatically rebooted whenever you reinstall a program, but sometimes it restarts without even downloading an update.  I also noticed that sometimes the icons on the main screen disappear and then reappear after a short time.  Also some passwords are saved while others do not (I am not sure if that is exclusive to this tablet or if it is the app itself that does not save the password).  Most puzzlingly, when charging while off, when I turn the tablet back on, it shows that the battery level is still the same than before I charged it.  It is not that the charge does not take, it just stays at that percentage charge for a couple hours before it starts going down again.One major reason I avoided such devises for so long is that I have thick fingers making it hard to type.  There is a microphone function that is really nice and will dictate your voice, but unless it gets you right on the first try, it may just be easier to type with your fingers.  And the tablet is not very easy to hold, right hand (which is my non-typing hand) would cramp after about a minute holding this tablet.  Luckily I have an iPod stand that this tablet easily fits on so I really do not have to hold on to it very much.", "Date": "October 28, 2013"}, {"Title": "This is for Kids, Adults best served elsewhere.  WiFi works with TKIP encryption, not AES", "Author": "Justin Moran", "ReviewID": "R3RNX8Q98ZARDG", "Overall": "4.0", "Content": "I give this 4 stars based on being a kid's tablet.  Were it for an adult I'd have rated it lower since it is slower than a higher end tablet since the chips are slower, but that' not what we bought it for and not really not what it's marketed for.  It does have quite a few of the free apps preinstalled, most seem appropriate (does my kid really need navigation?).  Wi Fi does work well, but doesn't support all current encryption protocols, which may require tweaking router settings (see my notes below if you're concerned about Wi Fi based on other reviews).If you're looking for an older kid (let's say10-12+) who would want/need a more 'unlocked' flavor of Android then this is probably not the one for you since a lot of the settings are changeable only through the Camelio software settings rather than the Android menus.  For younger kids I find the restrictions nice in a way, a sort of introduction to tablets if you will.The one major con is the lack of support in the manual, if you have any issues you're on your own searching online forums.  Some of the settings can be changed in standard Android settings menus and some can only be changed in the Camelio software, which is somewhat straightforward, but not well documented.Regarding Wi-Fi, the one warning I'll give is that the Wi-Fi does support WPA2 (in fact this is the setting shown on their support site video tutorial).  The kicker is that is seemingly only works with TKIP encryption.  If you try setting up using only AES encryption the tablet freezes up, indicates a loss of signal (i.e. 5 bars to 1 instantly), and eventually drops the connection after a few minutes of 'attempting to connect'.  I fortunately realized the issue was with AES fairly early on, despite lack of guidance in the manual, because I had a Wi-Fi Blu-ray player with a similar issue in the past.  Most modern routers that support WPA2 will default to AES encryption only, which is a newer protocol than TKIP... this device, either through older software, or morel likely hardware, seems to not know how to handle AES.  The easy fix is to change the encryption typed within your router's settings.  Under WPA2 you'd use a down menu under the WPA2 selection to change the encryption to 'TKIP+AES' instead of just 'AES'.  Alternatively, on some brands of routers (ASUS is one main example) you would change from WPA2 to WPA2-Auto, in which case the firmware is designed so that WPA2 = AES only and WPA2-Auto = TKIP+AES.", "Date": "December 23, 2013"}, {"Title": "Great product!", "Author": "Cathy Juntura", "ReviewID": "R1QMBOE07J1FV2", "Overall": "5.0", "Content": "Got this today and i'm liking it, well of a cheap price its a good deal. It has 1.1GHz processor,1GB for playing games is good since its for my little sister and brother since its OS Android 4.1 Jelly Bean. It comes with a slick design, easy to hold for them to use. I recommend this tablet to you guys for your little bros or sis. With a cheap price its a good deal for me.", "Date": "June 10, 2014"}, {"Title": "Cheap and easy to carry", "Author": "Shen", "ReviewID": "R39FQ10MV8LVL3", "Overall": "5.0", "Content": "The reason I bought this one was because it was a birthday present for my younger brother and so far as what I've seen when I tried to use it, there are many things that a kid could do with it like educational games, also I used to borrow it on him when I'm reading e-books and also there are many options on it like having Google playstore which most of the tablets in this price doesn't have. So in the end, having a cheap price for a quality item esp. for your kids or younger ones, this was the best for them.", "Date": "June 7, 2014"}, {"Title": "Great for what it is", "Author": "Samuel Flowers", "ReviewID": "R1532VX5ZPTZAW", "Overall": "5.0", "Content": "I bought this little tablet for my 6 year old to be able to get online to do some of the educational activities that her school supports as well as be able to play some games and read books. Audio is actually pretty good. It's actually a bit louder than I would have expected it to be, and it's pretty clear. No complaints there at all.", "Date": "June 3, 2014"}, {"Title": "Best tablet", "Author": "Christal Brown", "ReviewID": "R1CJBJEL5Q2DJ6", "Overall": "5.0", "Content": "Really amazed that this level of technology is available for this price. The simple and elegant design rivals that of ipad, yet it come pre-loaded with google play so you can download all the apps you want. I use for business mostly, PDF, CRMs, etc. Works great with any Wi Fi. Really good tablet for this price.", "Date": "May 31, 2014"}, {"Title": "Perfect tablet!", "Author": "Davit", "ReviewID": "R2MNHBWAPRUPSU", "Overall": "5.0", "Content": "Perfect tablet from the company Cameleo. If you want to buy a tablet, this is the best choice! The price is low, and the characteristics of the technical details are acceptable. Screen Size 7 inches is good.", "Date": "May 28, 2014"}, {"Title": "Gorgeous and Easy to Use", "Author": "Rose Luxden", "ReviewID": "RSOWEUZNINDWE", "Overall": "5.0", "Content": "I really like my Camelio tablet. The 7-inch display is very clear and it has 1 GB of storage space, which is more than what I need. Its pretty simple to use and only took me a few hours to master use. Great product. I'd recommend it for anyone who needs access to a computer while traveling.", "Date": "May 24, 2014"}, {"Title": "Camelio CAM7", "Author": "Delois", "ReviewID": "RROCL3Z1RZ2HU", "Overall": "3.0", "Content": "There wasn't enough storage space, most of the space was used by google, both a 4gb microsdhc and it didn't work, the speaker was on the back. I have purchased another brand and it works great.", "Date": "May 21, 2014"}, {"Title": "Headache", "Author": "Al K.", "ReviewID": "RTQY6LJ0NQ914", "Overall": "1.0", "Content": "Pros:Runs Android OS and is compatible with all of the Apps I've wanted to download.Decent response time.Lightweight.Cons:Can't Use custom Wallpapers. You can set one, but the Theme manager will reset your wallpaper to one of the defaults every time.Theme manager app doesn't go away. It constantly updates and adds new instances to your app list. You can't delete these new instances or uninstall the app.Generally cheap construction. I don't like the feel in my hands and I can bend the tablet easily.Very short battery life.Buttons are in a convenient place to turn the tablet off when holding it or switching hands.Clicking sound when typing can't be turned off.Would not recommend.", "Date": "May 18, 2014"}, {"Title": "Comfortable :)", "Author": "mishka", "ReviewID": "RWJBY6J2I4XHU", "Overall": "5.0", "Content": "This tab is really comfortable, I have just bought it for my children and they use it perfectly, I Just loved it ,in this Tablet you can capture cool pictures, take videos and  play Apps, there is Play store  where you can download everything you want ! there A lot of tablets that are on the market for kids don't have the Google Play Store and you can only add apps that are available in their own store,that's why it's better than Tablets which has their own Markets...There are many different Themes you can apply and there are too much Enjoyment , It's too attractive !!!", "Date": "May 14, 2014"}, {"Title": "One of the best tabs on the market hands down", "Author": "noureldeen mohamed abdalaziz saber", "ReviewID": "R2QQ9D850WQILG", "Overall": "5.0", "Content": "In my opinion, this tablet won't just do anything you want it to do, but it'll make your experience fun, fast, and convenient. However, I also wanna add that this is one of the best tablets available on the market as of today.", "Date": "May 13, 2014"}, {"Title": "High quality, affordable tablet.", "Author": "Bobby Johnson", "ReviewID": "R1CH06TKKIYTGY", "Overall": "5.0", "Content": "This tablet has so many cool features for a more than reasonable price. My kids and I love to use it and I couldn't be happier with it. The material is of pretty good quality and I can't think of many negative things for this tablet.", "Date": "May 12, 2014"}, {"Title": "Amazing value for the money", "Author": "bob", "ReviewID": "R33OG1ALJ075FQ", "Overall": "5.0", "Content": "I purchased this tablet for my son after he started \"borrowing\" my iPad too often.  I was afraid he was going to break mine.  So far he loves it.  It's very sturdy as he has dropped it a few times and no dings or breaks.  The battery is very strong as I typically only charge it during his naps.  It's very easy to use even for a 5 year old  It pretty much does everything you could want it to and again the price was way too good to pass upI'd give this 6 stars if I could", "Date": "May 9, 2014"}, {"Title": "very disapointed", "Author": "jjlewbrid", "ReviewID": "R1QI0416DOTB5P", "Overall": "2.0", "Content": "I am very disappointed in this product. We bought two of these for Christmas for our kids ages 8 and 4. On both tablets the charging port crapped out in less then two months (luckily we bought at wal-mart with the replacement plan). We got them replaced and again on one of them the charging port has crapped out. Now we have to replace it again. Another thing is that the \"parental controls\"  are a joke. The child's e-mail that you set up on the tablet is the one it sends the password to if you \"forgot\" the password. Hello now the kids know the password. Also both my kids the 8 and 4 year old has figured out how to bypass the parental controls all together. It is a good tablet for the most part, but again a child's tablet with \"parental controls\" that a 4 year old figured out how to bypass in not even a year is not what i expected for a \"kids\" tablet.", "Date": "May 7, 2014"}, {"Title": "cameilo", "Author": "wally", "ReviewID": "R16957PJJMHMUU", "Overall": "4.0", "Content": "after just 3 weeks it just stopped taking a charge until then I was very happy with it maybe just a manufacture defect on this one", "Date": "April 11, 2014"}, {"Title": "horrible", "Author": "honorable", "ReviewID": "R14U0Y34CN9ZY7", "Overall": "1.0", "Content": "charging plugin broke after a week  the expandable memory is for photos and video only  this tablet sucks and i will by nothing from vivitar after this disaster.  but wait you get a whole 2gb of memory........idiots", "Date": "April 7, 2014"}, {"Title": "A good product for younger kids.", "Author": "Cindy Webster", "ReviewID": "R376BDR89HTVIF", "Overall": "4.0", "Content": "I bought this for my 2 & 4 year old grandkids. They love it as it user friendly for their age group.", "Date": "April 4, 2014"}, {"Title": "For my daughter", "Author": "Katrina", "ReviewID": "R39IEQ5LU6KHFF", "Overall": "5.0", "Content": "My daughter just loves her new tablet. the best things is that it has the option of changing the background depending on what they like.", "Date": "March 27, 2014"}, {"Title": "awsome!!!!", "Author": "Krystal Peralta-Ruiz", "ReviewID": "R2RXRR38MNV6GM", "Overall": "5.0", "Content": "I have 4 of these tablets and they are awesome! My kids have had these for over a month and we have had no problems with them at all. I would recommend these tablets.", "Date": "March 25, 2014"}, {"Title": "gave as gift", "Author": "love2shop", "ReviewID": "R37ATXW0WNLC19", "Overall": "4.0", "Content": "She really likes it, however, the first one we bought dropped face down and the LCD screen cracked. This is a replacement..", "Date": "March 5, 2014"}, {"Title": "loved", "Author": "katie trinkley", "ReviewID": "R32EVBJ21L9KE7", "Overall": "4.0", "Content": "Love the tablet it's great for kids had no problems with the first two however the third one malfunctioned but company had no problem replacing it", "Date": "February 28, 2014"}, {"Title": "4th Failure", "Author": "Marci L Blandford", "ReviewID": "R1SE0FQ6VI8PML", "Overall": "1.0", "Content": "We received two of these, one for each of my sons as Christmas gifts for 2013. The original two were purchased from Costco. Within just a month,  the charging connection on both of these failed.  The connection on the inside of the tablet became loose and we couldn't get them to connect and charge and had to return both to Costco.  We liked the overall tablet and had hoped that we just had a bad couple so ordered another two here on Amazon.  First replacement lasted 5 weeks and now won't turn on or charge fully.  2nd replacement came defective and would only turn on if plugged in.  When unplugged, even if it looked fully charged, would drain completely in only 15 minutes.  We've gone through four of these in just about 75 days and now look at the hassle of trying to get them covered under the extended warranty we purchased.  I think a record of trying it 4 times proves that this is not a quality product!", "Date": "February 28, 2014"}, {"Title": "LOVE THIS PRODUCT!!!", "Author": "Sherri Delman", "ReviewID": "R37VDICCMHZRFE", "Overall": "5.0", "Content": "I bought two of them for my two daughters and they love it, and so do I!  The parental controls are wonderful, and the girls loved that they could pick their own theme for their tablets.  One picked Barbie and the other picked Monster High.  So cute!", "Date": "February 28, 2014"}, {"Title": "there are better tablets out there for the price", "Author": "Jenna G.", "ReviewID": "R2YISOI0UYXJ8W", "Overall": "3.0", "Content": "I bought my 8 yr old and 5yr old each there own Camellio tablet.  my biggest complaint is the memory.  it clearly describes 1G of memory, but me not being so computer savvy, didn't really understand how little that is.  The girls often have do delete apps to be able to have enough memory to download another app.  Kind of frustrating for them.  other than the memory issue, it works great and is easy for the girls to navigate.  I just think that for the price there are better tablets out there.", "Date": "February 17, 2014"}, {"Title": "Christmas Gift for My Granddaughter", "Author": "Andrea Williams-Strong", "ReviewID": "R5RTMZ9L1T77L", "Overall": "5.0", "Content": "My granddaughter was always using Kindle Fire. She now has her Camelio Tablet and it keeps her occupied for hours . I also purchased the Hello Kitty accessory pack and it brings even more life to the tablet.... She LOVES her tablet , takes it with her wherever she goes ... Great choice I made for her !!!", "Date": "January 19, 2014"}, {"Title": "It's a Good Tablet for a very young Kid", "Author": "D. Bezboruah", "ReviewID": "R3LV2FIMZ6C2RP", "Overall": "4.0", "Content": "Like other reviewers have mentioned, this is a tablet designed for children to use.  If you are an adult looking for a cheap tablet, then this isn't for you.  The hardware is your typical tablet stuff, with a responsive touch screen and a nice finish.  I've seen the reviews about bad wireless connectivity, but I didn't have any issues there so it looks like YMMV.It is the software and corresponding apps which are simplified and designed specifically with little children in mind.  In my personal experience, I would say that this is probably best suited to children in their early formative years, probably under the age of 6 (geez, we're giving our little kids gadgets this early??).  I had my 10-year old cousin play with this rather than my iPad, and he got bored with it after 15 minutes and wanted the iPad again.  The pre-installed apps are very educational and simple, which is probably what drew him away as he likes more action-packed games.", "Date": "December 30, 2013"}, {"Title": "Great kid tablet!", "Author": "Kaila", "ReviewID": "R2JFAU9TNB6D7", "Overall": "4.0", "Content": "I don't know why this tablet has bad reviews.  I own 2 iPads and a Kindle Fire HD.  I bought this tablet for my four year old so I could get my iPad back.  This tablet comes with customizations and she just loves the Hello Kitty pack.  Overall this tablet is no iPad or Kindle but it's perfect for my daughter.  I haven't had any issues with the wifi connection, apps all downloaded quickly and work without any issues.  My daughter has figured out how to use this as well as the iPad, overall it's a great little tablet for her.  Not too bad at all.", "Date": "December 29, 2013"}, {"Title": "DOA - Does not work out of the box.", "Author": "Stacey Brewer", "ReviewID": "RHJFRSOZ28XZR", "Overall": "1.0", "Content": "This product is not recommended for purchase.It does not work out of the box. If you buy this, you will be wasting your time and money.I returned it and received a second unit which was DOA also.Gave up and ordered an ASUS which works perfectly out of the box.", "Date": "December 28, 2013"}, {"Title": "Nice Little Tablet", "Author": "Janet Chandler \"Music/Movie Lover\"", "ReviewID": "R39PJ73AWNCT9N", "Overall": "4.0", "Content": "For some time now I have been thinking about getting a tablet but was not sure which kind to get. We recently received as a gift the Camelio by Vivitar and so far I find it to be a nice little tablet. I know in reading some of the other reviews for it many reviewers say it is perfect for children to use and I would agree to that as it is very easy to use. I would however recommend this to two other groups, both that I would fall into. First would be someone who has never used a tablet before. You won't feel intimidated by using the Camelio and will feel like an expert in no time. The second group would be those who like me feel they are technologically challenged. Again this is so simple to use that you won't have a problem getting around on it. For those who work with computers on a daily basis so feel at home in front of one an Ipad or Ipad Mini will be more to your liking. But for those of us who are not computer savvy this tablet is a dream come true to use.", "Date": "December 15, 2013"}, {"Title": "Little ones' tablet!", "Author": "Wisdom Twin", "ReviewID": "R1D1B2NAWI1F1K", "Overall": "4.0", "Content": "If you are over 8 and considering this tablet, then please look elsewhere.  Our son is seven years old and has already destroyed (broke the glass) on an expensive expandable Toshiba tablet last year.  His sisters will not let him near any of their devices including their Kindle Fire HD because he 'makes it nasty (their words)'.  When this little tablet arrived, we handed it over to him.  It is lightweight and it feels like my old generation Kindle reader.  Out of the box it comes with kiddy-centric apps and needs to be charged for a long time.  My son went about his business downloading his apps.  I was a bit concerned regarding the available space and rams but he has not said anything to us yet.  We have downloaded the Kindle app and he has been using this as a reader; this makes him feel like a BIG boy because he has his very own books stored on his own device.  The device does take a very long to come to a full charge and does not last over 3 hours.If you need a very very entry level inexpensive device that is geared towards children then this might be a nice fit.  Google play is available which makes it a breeze finding free apps.  The tablet also has skins and themes that can be purchased for fourteen-ninety-nine.  We have personally not purchased any of these regardless of how much he has begged ;)  This device would also be great for an older parent/grandparent that would like to venture out.  I still would suggest a Kindle Fire though, if you are willing to spend more.Recommend for little ones or individuals that have no prior Android experience.", "Date": "November 20, 2013"}, {"Title": "Horrible", "Author": "Larry D. Rhodes", "ReviewID": "RYN8ACL40USLY", "Overall": "1.0", "Content": "Horrible product!!! Do not buy!!! Bought two tablets for our boys ages nine and seven and ever since they came out of the box we have had nothing but problems!!! Have had to reset both tablets to factory settings multiple times because once you fill up the memory with apps it no longer works!!! Can only have a few games or apps on the tablet at one time!! My iPhone can have 10 times as many apps or games! To get new apps or games you have to delete other apps you have already downloaded!! The kids got mad because then they lost all there games and the progress on those games! Stay away! My husband is currently resetting one tablet to factory settings as I type!", "Date": "February 15, 2014"}, {"Title": "A decent family-oriented tablet given its price point", "Author": "Beldini", "ReviewID": "RY0ORYZBP4X3F", "Overall": "3.0", "Content": "Vivitar's entry into the family tablet marketplace, the Camelio CAM740 7-inch tablet boasts a customizable \"Personality Pack,\" which allows young users to personalize their experience with Hot Wheels or Barbie Themes (among others), which are sold separately.That gimmick aside, the Camelio is a okay tablet for its $100 list price, but it pales (both literally and figurately) against much of the Android competition.Compared to, say, the Kindle Fire (which is the only other tablet we own), the resolution isn't nearly as crsip or vivid and the screen isn't as responsive.The initial set up process (you'll need a Google account) feels really slow, as does the average boot-up time and downloads.  The Camelio comes pre-installed with several game apps, as well as apps for YouTube and Skype, but it's a given that your child will want cooler apps, which can be found at Google Play.  The 1 GB of storage doesn't allow for an embarrassment of dowloads.Because it's from Vivitar, it also has rear and front cameras and battery usage isn't bad.  All in all, it makes for a sturdy/affordable first tablet for young family members--it also would be a good choice to take on trips, downloading books and magazines in advance.  But if you're looking for an HD movie/video-viewing experience, look elsewhere.  The Camelio isn't the sharpest new kid on the block.", "Date": "October 16, 2013"}, {"Title": "For kids", "Author": "grumpyrainbow", "ReviewID": "R33R1D7FF2PVVT", "Overall": "1.0", "Content": "This is pretty slow and awkward.  Good for a kid, but not much else.  Though it might actually frustrate kids while playing with it.  I opened and played Cut the Rope (included) and it lags on the screen when you play it.  With the price of the Kindle HD being so low I find it hard to justify buying this.  It does have Google Play though, which is a plus.  It's not a bad tablet, but the price is way too high for what it is.eta : 12/27 - I have barely used this, but now it won't charge/turn on at all.  I've probably charged it a total of two times and now it's dead.  Not sure what could have happened and I'm tried all the tricks suggested, but it won't do anything.  It's worthless now.  Now giving it 1 star.", "Date": "November 21, 2013"}, {"Title": "ok for kids!", "Author": "A. John \"military mom\"", "ReviewID": "R2VKQHRZ1P8DZZ", "Overall": "3.0", "Content": "We were not entirely impressed with this tablet. For the price that it was offered for I didn't really expect too much but still wanted it to be great. Wishful thinking on my part. The set up was pretty easy but it constantly turned off when in the middle of doing something. The touchscreen was touch sensitive so that worked. Just wished that it did a better job of connecting and also staying connecting to our internet connection as well. If it wasn't for those issues I would certainly give it at least a 4 1/2 stars. It is an ok tablet for kids but for an adult no way!", "Date": "November 20, 2013"}, {"Title": "Not very impressed", "Author": "Lightning Rod \"TM\"", "ReviewID": "R26AIR2Z5W1K6X", "Overall": "3.0", "Content": "I'm more into Apple products so this was a new area of technology for me.  I like that each person can have their own screen; that makes it nice if people are sharing it.  It's meant to be for children through adult.  I don't really agree with the children part.  It's still too advanced, in my opinion, for children.  I'm not the biggest fan of Android anyway so I'm a little harsh when it comes to judging this product.  I would continue looking and/or look for one specifically made for children if you want one for them.", "Date": "November 20, 2013"}, {"Title": "So far, so good", "Author": "DaCrFrCo", "ReviewID": "R1DPNU8Y42CUB5", "Overall": "5.0", "Content": "We purchased this for our 8 year old granddaughter and she is just starting out with it, but seems to be enjoying it so far with little problems in figuring it out.", "Date": "December 26, 2013"}, {"Title": "Terrible. Get Something Else. Anything Else.", "Author": "Ron Wis \"Rw\"", "ReviewID": "RESPPP99DAO8K", "Overall": "1.0", "Content": "The Camelio CAM740 is supposed to be an cheaper alternative to the various tablets on the market. You'd think that it would be easy enough task to accomplish, but there's nothing easy or fun about the CAM740.An initial sign-in to Google is required before you can use the Camelio. Ugh.The tablet is SLOW. I have a Kindle Fire which is several years old. The Kindle Fire beats the pants off this thing in terms of speed and display quality. Want to use the Camelio as an e-reader? I hope you like waiting 3-4 seconds (or longer) to turn a page. Want to change the font in your Camelio e-reader? Put it down and go do dishes. And the unit flickers when used as an e-reader. Nice touch.The WIFI connection is SLOW so web pages open agonizingly slow.Important settings are buried in the non-intuitive interface.The Camelio comes with a bunch of apps preloaded.  The camera is of fair quality. Nothing amazing here.As I said. Get something else. Anything!", "Date": "October 9, 2013"}, {"Title": "My 3 year old son loves it.", "Author": "Yoshie", "ReviewID": "RNFJUVP1OINWW", "Overall": "4.0", "Content": "It's hard to use web email since reaction after touch is slow but since we bought is for my three yeas old son,it's great for my son. :)", "Date": "November 3, 2013"}, {"Title": "Great for younger kids", "Author": "Bladen's Mommy", "ReviewID": "RTE0F1JOAZ2MH", "Overall": "4.0", "Content": "Out of the box, the Camelio is easy to start up. It does say you have to charge it first, so we were able to play with it within 2 hours. This tablet is no ipad, but good as a starter tablet for younger kids that don't already have an ipad or equivalent. We already have an ipad, so I thought my 8 year old was going to laugh at this, but surprisingly, he was really into it for a week or so. I think because it was \"his\", but then the newness wore off and he hasn't showed much interest in it in a while. Keep in mind he has a ton of other electronics, so that may be why he lost interest. The wifi works most of the time, but this is extremely inexpensive, so maybe that's ok with most people. I gave it 4 stars because it is geared toward younger kids, does do what it's supposed to do, for the most part, and is inexpensive enough that if your child was to lose it, it wouldn't be a huge loss. My son was able to get online and on twitter with no issues. It's much slower than our ipad and iphones, but once again, in this price point, I'd expect it to have minor issues. It still isn't terribly slow, just not as fast. I like that it has the option of buying character covers and theme, but my son is a little past that, so I just bought a generic 7\" tablet case and it works great.", "Date": "November 20, 2013"}, {"Title": "Camelio CAM740 7-Inch 1GB Tablet", "Author": "Loveguitar", "ReviewID": "R1BH8867Q7ZDXT", "Overall": "3.0", "Content": "PLEASE READ UPDATES AT BOTTOM OF REVIEW FIRST!!!!!I'd really just like to give this tablet 3 1/2 stars but it's definitely not over 4.  It has 1GB RAM and 4GB storage and comes with a MicroSD slot for additional storage.Here is my list of features and my opinion of them:It takes approximately 36 seconds to fully boot up.  The colors are fairly vivid on the home screen but that can't be maintained when actually using the device.Intuitive.  I didn't have any trouble getting familiar with this android and it didn't ask me a ton of questions and passwords to finally get started using it and surfing the net.Wi-fi connection is pretty good!  I haven't been dropped a single time yet and it seems to find my router fast and connects quickly.  Movement on the net is not fast but that is because I have inherently slow internet service. I will take it with me to other wi-fi spots and see how fast it moves.  But I'm o.k. with the speed so far.It's not heavy, but not a feather-weight either.  My guess is that it weighs approximately one U.S. pound.Google based Android with several apps already pre-loaded. Google app store has a large selection of free and apps to purchase.  I downloaded the Kindle app and so far it works nicely on this android.Resolution: (1024 x 600) 7-inch display.  I'm not thrilled with the resolution.  It is not very clear especially when being held horizontally.  If I want to look at picture on Facebook for example, I have to turn the android vertically to more clearly see the pictures and even then they are not very clear.  I'm not really complaining since it costs less than $100.Color quality - most definitely could be more vivid.  Color is pale and reading posts on FB and blog sites can be somewhat difficult depending on the color font.  FB is definitely washed out/faded but for what you pay the color is o.k.  However, the color when using app games like mahjong is a bit brighter and slightly more vivid.Sound effects are good when playing games but you've got to use earbuds/earphones when watching a movie on Netflix or watching YouTube videos.  Otherwise, when the sound is turned up loud enough to hear, it can be mumbly sounding or the case of the android vibrates.  Sounds fine with earbuds, no complaints there.  However, you will have to furnish your own earbuds since it doesn't come with any.Camera/video - barely above useless.  I took some pics and they were fuzzy, faded, grayish and really not ideal at all.  I guess the camera is better than not having one, but I wouldn't use it for an important occasion. Video is equally grainy, fuzzy and washed out.  Camera lens works both ways, towards you/away from you.  You can instantly upload any video or pictures to several social networking sites like FaceBook, Twitter, etc...Battery life - I have only had this android for about a week now and have used it intermittently so I don't have  a firm grasp on battery life, but so far I would estimate that it will go at least 2 hours before needing a recharge.  It was very nice that a USB/AC outlet converter was included along with a USB cord (albeit short, approx. 18 inches).  Will recharge fairly quickly (about an hour from depleted battery) when not in use.Scrolling - This could be better.  I am still trying to learn how to finesse this particular android's scrolling needs.  It sticks a lot and when it finally scrolls it will ZOOM scroll very quickly and I have to try and stop it before it goes too far.  And sometimes when I try to get it to scroll down it will go the other way and scroll up!  It seems to like a firm scroll and does better when I apply more pressure to the screen and scroll slowly.  But that doesn't always work either.  The scroll feature can get irritating.Bookmarks - it seems to only save bookmarks in icon form.  I can't get it to save my bookmarks in a list.  Also, I have accidentally added apps to the wrong category on the home page screen and cannot seem to delete them or move them to the correct category.  So, most of the apps I use including game apps are all in the \"tools\" category.Screen rotation function works alright.  It will flip rather quickly to vertical or horizontal.  Netflix seems to work only in horizontal.  Interesting because my other inexpensive androids will only allow vertical for Netflix.  (I have had several less than $100.00 androids in the past few years).  The Kindle app with rotate depending on how you want to read.  I like that a lot because I like having a choice.The clock function seems to be very accurate.  My other androids clocks would drift but this one seems to remain accurate time-wise.Does not read well outside in natural light even with screen brightness set to highest setting.  Might not be good for poolside use unless you are in shade.It does not have Bluetooth capability.It has GPS tracking (which I have turned off) and parental controls (which I do not need to use).  One of the advertising features of this android is that it can be customized for up to 4 people's differing tastes.  Kits are sold to change this android into your favorite characters such as \"Hello Kitty\", \"Barbie\", \"Spiderman\", etc...for your kids to use.  Personally, that doesn't appeal to me and I'm going to be the only person using this android, but it can be specially set up for whatever your children would like.  But you have to buy the kits separately.I have only had this android for a few days and am still becoming familiar with this device. As I learn more about it or need to update what I've already written about it I will do so.  So far, I am fairly pleased with it and it's functions.  It's better than the other less that $100 android devices that I have bought in the past but still has some buggy issues like the scrolling.  I don't go for the individual customizing gimmick but if you like that then this might be the android you been looking for.And finally, here are the specs:Display 7\" 1024 x 600 pixelsStorage: 4 GB + Expandable MicroSD slotRAM: 1GBNetworking:  Wi-fi 802.11 b/g/nOS: Android 4.1 Jelly BeanBattery:  Rechargeable 3800 mAh batteryCameras: Front Camera (300K) & rear camera(2.0MP) W/ Built-in MicrophoneOther features:  Micro-USB Port, Stereo Headset (not in mine!)Parental ControlsUPDATE 10.5.13 - I've dropped the original star rating from 4 stars to 3 because of a charging problem.  At first I thought the cord had gone bad so I replaced it with another but it is the connection port in the Camelio. It has loosened and the red charging light will not indicate it is being charged unless the cord is very carefully positioned.  This is a real hassle and I expect it to eventually stop charging entirely.UPDATE: 10.12.13  I contacted the company via e-mail, told them about the charging problem and after sending in proof of purchase (in this case, Amazon Vine receipt), they said for me to mail it back and they will replace it with another one.  I will mail it back tomorrow.  I think this is pretty good customer service.  If I get a replacement Camelio, I will raise the rating by one star.UPDATE: 11.1.13 - I got the replacement Camelio yesterday but it has a bad problem and I'm not going to spend another 8 dollars to send this one back for another replacement.  With the volume turned off and all sound effects turned off, it will still scream with static electricity making it impossible to listen to music or watch anything involving sound.  It does this intermittently and lasts a long 10+ seconds and I can find no way to make it stop.  It is extremely irritating.  Don't waste one dime buying this tablet because it is pure junk!!!UPDATE: 1.6.14 - For some unknown reason, the Android has stopped screaming at me when I type with it.  It used to really scream LOUD and wouldn't stop until I closed the keyboard.  I supposed it was possessed or something, and finally got tired of me not being scared of it and left.....who knows....but I've raised the star level back to 3 since it seems to be functioning alright now.", "Date": "October 1, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DR6RUSY"}}