{"Reviews": [{"Author": "Cheapergear", "ReviewID": "R2BULON3HCACAI", "Overall": "4.0", "Content": "This is an excellent tablet. I didn't expect much with the slow atom processor and low price, but this is a complete windows computer and a smooth tablet at the same time.  I don't play games, but it runs Office and other productivity software as quickly as any high powered laptop.  Internet browsing is excellent on the tablet. It's as smooth as my ipad, and at the same time, it's a full browser without the limitations of browsing with an ipad or android.  The digitizer functions as a mouse to allow hover selection and use pull down down menus.  However the Dell digitizer has to pressed a little harder than other tablets that I have used.  But the screen is very responsive to touches.The screen is excellent with a very wide angle of view. The battery lasts all day with normal computer use. The speaker is weak and the back location doesnt help.  If you want one device for all your computing needs, this is it.  There is no reason to have both a laptop and a tablet.", "Title": "Both an excellent windows laptop and a great tablet.", "Date": "November 25, 2013"}, {"Author": "Router user", "ReviewID": "RI27YP2NODE4E", "Overall": "2.0", "Content": "I have had one for a couple of months.Pros:Battery life is 3-4 hours.Screen is good and bright.Speed is ok.  I wouldn't try games but for everyday computing the processor works well.The Kensington Pro 2 keyfolio universal keyboard works well with the tablet and gives you a typing option. Of course this adds bulk and weight (you cannot charge the tablet in the case because of the port location, see below)Cons - some may be related to the Windows 8 vs the tabletThe voice command application is terrible.  It rarely recognizes my words and the microphone location on the top is poor.  It is difficult to type on a tablet so this really is a necessity.  Dell and Microsoft don't seem to get it.The essentials version of the tablet does not have a micro USB charger which means you need to lug around the bulky charger. All tablets should have a micro USB option.The position of the charging connector is on the bottom.  If you try to use with a keyboard this gets in the way.  The port should have been on the side.Uses significant battery power in sleep mode.  To conserve battery you need to shut it down when not using it.I would not purchase again.  This is an initial effort that needs some work.", "Title": "A first try for Dell", "Date": "September 7, 2013"}, {"Author": "Kendal Harr", "ReviewID": "R6BQFN64OEHZW", "Overall": "1.0", "Content": "Do not buy from Dell.com online.  Horrible product.  Had a login issue that makes the table inaccessible and tried with over 10 hours of tech call time to India, the Phillipines, and El Salvador - even a Better Business Bureau compllaint did not rate an American representative.  No fixes and no functional product for $327.RUN AWAY FROM DELL PRODUCTS", "Title": "Horrible", "Date": "February 10, 2014"}, {"Author": "startdelete", "ReviewID": "R12GTTRYS94LSS", "Overall": "4.0", "Content": "So I've been using the Dell Latitude 10 with the removable battery for the first semester of a graduate medical sciences program and here are my thoughts on the device:-It's slow. The processing power of this thing is below average.-The screen is subpar. You won't be watching any high quality videos on this thing.-The memory is limited. I have the 64GB version and only 16GB are left after installing just essential programs like word and ppt. You'll definitely need an external SD card.-The charging port is inconveniently place on the bottom of the device so you can't have it stand upright while charging.So with all these negatives, why am I giving the device 4 stars? Two reasons:-The wacom digitizer is on par with a wacom pad. I can easily write notes on Onenote with excellent precision.-Battery Life. With the extended battery I can go from 7 A.M to 9 P.M. on a single charge with almost continuous usage. This means I can just grab and go with thing and not have to worry about cables. No other tablet provides this kind of functionality (ie having a wacom digitizer) and battery life.Until a tablet that has 14+ hours of battery life, can run windows, and has wacom support comes out, I'll be sticking with this thing. I'll have to see what the Dell Venue 11 Pro has to offer in the coming months.", "Title": "For all its flaws, it's still the only tablet of its kind.", "Date": "December 8, 2013"}, {"Author": "Robert Hartwell", "ReviewID": "R2OK55YLH0BTQ6", "Overall": "5.0", "Content": "As with all new toys, it takes getting used to. I recommend a stylus and keyfolio or other keyboard for improved productivity. Touch keyboard is kind of a pain, but what on screen keyboard isn't?Great battery life. I unplug from 6:30 am until 5:30 pm and still have plenty of battery life.", "Title": "Exactly what I wanted", "Date": "September 4, 2013"}, {"Author": "IMHO", "ReviewID": "R2KH3PPBIRGCES", "Overall": "1.0", "Content": "If ever there was a love/hate relationship.During our honeymoon period we were happy. I loved the long battery life, the portability, the replaceable battery and the ability to dock. I invested in our relationship with a 60wh battery, soft cover (that I lovingly hacked to take said 60wh battery), numerous Bluetooth appendages and two docks. A year later the first hint of failure reared its ugly head. A blue vertical line appeared sporadically. Then two, then three. Upon returning to the store from where I purchased it, I was told that my one year warranty was up by two weeks and there was nothing they could do. I could try to fix it, they said, but it would probably be more than the depreciated tablet is worth. It mulled it over for a week and three more lines before calling Dell.Let me preface this by saying I am in Taiwan and thus this part may not apply to you. Dell told me that they had pulled all their service centers out May 5, 2014. I was a little less than a month late. Now to get anything fixed, they would send someone over. Minimum charge? $200. Because it was a display problem they said I would likely need a new LCD or a cable, neither of which was in stock. As someone else mentioned, they are not supporting the consumer. And I don't blame them, they are more interested in the business customers and any spares they have would go on to support them. Since they are not making these any more, one less spare for business users is one more headache for Dell. On the other hand we, individual consumers, are left in the cold to fend for ourselves. Furthermore, I don't think Dell cares about this market (Taiwan consumer) anymore! As such I no longer can vouch for Dell in Taiwan.While it seems I harp on the service shortfalls, I am equally shocked at the quality of the product. 1 year is all it took to get the first gremlin to come out. I now have 6 lines on the screen. Sometimes I have as many as 9. While I can still use the tablet, it gets me angry having to. I'm holding out for the Surface 3 to reach my shores. But when I do get a replacement, I will be so sad to see all that I've invested in this tablet go to waste. The docks in particular.I loved this tablet when it didn't give me trouble but now that it has, I can't wait to get rid of it. I guess that does not describe a love hate relationship... more like a normal relationship.", "Title": "Great under warranty (1YR), crappy immediately afterward.", "Date": "June 9, 2014"}, {"Author": "E. Smelser \"All about the game\"", "ReviewID": "RNC69HFMGBTR8", "Overall": "4.0", "Content": "This is a great laptop replacement, but not a desktop replacement.  The Atom processor is put together with a weak video chip means you will not be doing any type of serious gaming.  You can still play Java games, word process, search the internet, play music and videos with no problems.  The battery life is really good considering the screen size.  This gives you the full windows 8.0 windows experience, and can be upgraded to windows 8.1.  I upgraded my device and it works great.  A Bluetooth keyboard is a must if you plan on using it like a laptop.  If your goal is just to have a screen while you are sitting down relaxing you probably won't need it.  The touch screen works rather well for me, This is really a great device, the only draw backs would be lack of apps compared to other devices in this price range.  It has all the apps I want, but I just use the internet to get what I need done.", "Title": "great for the basics", "Date": "January 9, 2014"}, {"Author": "Sadie", "ReviewID": "R17MRECCRVLHRN", "Overall": "4.0", "Content": "I am loving my new latitude 10. Windows 8 I have found to be very easy to use. The only thing that is confusing is the game store and the Xbox are connected even if you don't have an Xbox I think. I have found that the internet work extremely well. So far I don't have much to complain about", "Title": "my latitude 10", "Date": "October 15, 2013"}, {"Author": "Mary D", "ReviewID": "R2J5FQ6UA8QM4R", "Overall": "1.0", "Content": "Tablet arrived without working speakers and parts were back ordered.  While waiting for rep to receive parts and install, software started to malfunction.  Customer service repeated over and over that they would get it functioning.  Meanwhile, the 21 day return policy ran out.  This tablet was recommended to run a non-Microsoft program, but it's not happening on this tablet. while others who purchased this tablet for the same program have no problems.  Dell refuses to let us return the tablet for credit toward the newer tablet w/stronger processor.  Dell has now lost a whole family who have used Dell products for years and they don't care at all.  The history of \"fixes\" on this tablet is so extensive that they ask what months the re-installs to factory settings were done!  Seriously, is this what Dell calls service?  Should have spent the extra $$$ for the Microsoft Surface Pro and that's a soon to be purchase.  This thing can't even do online mail successfully and it would be unethical to try and sell it! Wish I had purchased through Amazon and not Dell; I probably would have gotten better service.", "Title": "Dell not backing product", "Date": "January 14, 2014"}, {"Author": "Disappointed with Dell", "ReviewID": "R1B7X5NTOTV88A", "Overall": "2.0", "Content": "Bought through Dell.com (but unable to 'review' it through their site).First - Dell did not deliver on the specs they promised and are now not willing to make the changes to meet the agreed upon specs (despite having documented chat logs with their sales representative).  Not happy with Dell's Customer Service.I like Windows 8.  It takes a bit to get used to as I have a non-windows phone and the gestures are a bit different but still very intuitive.  It just takes a little time as any system requires.Tablet - I thought a tablet was the way to go, but unless being used for media, the tablet is not very functional for work unless docked.Hopefully Dell will give me full refund back and I will go with a PC convertible, probably well worth it despite the additional cost.", "Title": "Bait and Switch", "Date": "October 9, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00DCFWNCI", "Features": null, "ImgURL": null, "Name": null}}