{"Reviews": [{"Author": "kenosha taylor", "ReviewID": "R3G5GAIHJLTPVF", "Overall": "4.0", "Content": "I purchased this tablet for my 4year old daughter. It  is very easy to use and it comes with children apps already installed. She loves it.", "Title": "Great for my little one", "Date": "September 23, 2013"}, {"Author": "Carrie", "ReviewID": "RZ3MOZXQMLLV3", "Overall": "5.0", "Content": "Recently bought this tablet for my 3 year old son! Absolutely love it! Easy to use, many fun games for all ages. Stylus is easy to grip for small hands and Silicon protective cover is great too!", "Title": "TUVVA BuddiTab is awesome!!!", "Date": "September 24, 2013"}, {"Author": "Jena Bergeron", "ReviewID": "R3UYHB12R1VE44", "Overall": "4.0", "Content": "Delivered right on time, easy to navigate, great learning apps (most are free) from Google Play, and ebooks from Kindle. I had a question, when the tablet first arrived and emailed the Tuvva support team. They got back to me right away and answered my question, clearly and concisely. The only negative so far is that the charger cord did not fit securely into the device and would fall out when charging. I emailed Tuvva team once again and they said they'd send out a replacement right away. Within 4 days I had a new one and it works fine. So far a great value overall. This is a Christmas present, and I believe it will be a hit.", "Title": "Tuvva 7\" BuddiTab review", "Date": "November 29, 2013"}, {"Author": "jane m tipton", "ReviewID": "R328Y1X5DW3RQ4", "Overall": "5.0", "Content": "My grandson loves this, sad to say though his mother says he is on it ALL the time !  Meant and exceeded expectations.", "Title": "Love the tablet", "Date": "October 18, 2013"}, {"Author": "Richard Cooper", "ReviewID": "RKXN4X6JEK81V", "Overall": "2.0", "Content": "Not really a kids tablet.  It is android tablet with a few kid apps loaded.  It requires way to much setup to make it kid friendly and safe tablet.  I recommend the Nabi and or the new Samsung which are both ready to go for kids.", "Title": "Not really kid ready.", "Date": "December 7, 2013"}, {"Author": "Mariana Daniel", "ReviewID": "R3S2R5QH2V6FTS", "Overall": "3.0", "Content": "Tablet is ok.....however the charger is giving me problems.....have to fidget with it all the time. Also the screen seems to get stuck when pressing at times.", "Title": "okay", "Date": "October 9, 2013"}, {"Author": "Nicole", "ReviewID": "R2ADUPRQA08J1V", "Overall": "3.0", "Content": "The pre-loaded games are ok, but I  had to down load games more appropriate games  for an 8 year old.", "Title": "OK for the price", "Date": "May 15, 2014"}, {"Author": "melva stewart", "ReviewID": "R2IN00D7D09EH9", "Overall": "1.0", "Content": "I'm not one to write bad things about company's. With this device you defiantly get what you pay for. The tablet is very cheaply made. Compared to other tablets out there. It pays to pay a little more. Not impressed.", "Title": "you get what you pay...", "Date": "May 13, 2014"}, {"Author": "Mapleafs", "ReviewID": "R1D2YGFJJ43X8C", "Overall": "3.0", "Content": "Bought this tablet for my 3 year old son. It's inexpensive and if it lasts 2 years I would be happy. The screen quality is very poor however and if you do not look directly at it you cannot see the image. The camera on it only faces \"IN\" so only selfies can be taken BUT the camera is unusable and takes terrible pictures. They should not even include this feature on the device it is that bad. For what we bought it for it does the job but if you intend to use it for reading or video watching do not buy this item. I actually had thought of buying their 10\" device for $159 but definitely would not even consider it after seeing the quality of the 7\". I will stick with Samsung for my devices.", "Title": "You get what you pay for!", "Date": "January 9, 2014"}, {"Author": "Lisa Bosten", "ReviewID": "R1P8UIZ9MKGVTL", "Overall": "4.0", "Content": "At first I had problems connecting to my internet but once I did it has brought joy to my 7year old niece.", "Title": "problems at first", "Date": "January 5, 2014"}, {"Author": "kris", "ReviewID": "RF2OZWWY5MG77", "Overall": "2.0", "Content": "The tablet takes to long to charge. It  dies to soon when the kids are playing with it. I would not recomend this to anyone.", "Title": "Tablet I got my kids for christmas.", "Date": "December 28, 2013"}, {"Author": "BigBoy", "ReviewID": "R1GOB1FACUNC4G", "Overall": "5.0", "Content": "My grand daughter loved the TUVVA BuddiTab  she plays with it all the time. We will probably buy other items from this company.", "Title": "TUVVA BUddiTab 7'' Fun & Educational Tablet PC for Kids(Android 4.1", "Date": "October 15, 2013"}, {"Author": "angela sandifer", "ReviewID": "R1U7QWAKWC0I2P", "Overall": "3.0", "Content": "It was just okay. My kids didn't like the camera or the way the games were set up. Will return.", "Title": "My kids got Bored", "Date": "December 26, 2013"}, {"Author": "janice mills", "ReviewID": "R35K6PPZV7DME3", "Overall": "5.0", "Content": "Easy to set up it dont freeze or shut down keep kids quite for hours i love this tablet !", "Title": "good product", "Date": "September 25, 2013"}, {"Author": "sergio", "ReviewID": "R1AOC0JFWOHB6P", "Overall": "2.0", "Content": "It doesn’t has any games, it a little bit hard to use.I don’t think, kid will understand this tablet.", "Title": "Is not friendly to used.", "Date": "October 30, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00DUQ42SW", "Features": null, "ImgURL": null, "Name": null}}