{"Reviews": [{"Author": "Happy_He", "ReviewID": "RYHNJA6FYFBFK", "Overall": "5.0", "Content": "I'm very pleased and surprised at the quality of the product for such a great price. So the plus points are: Fast -  thanks to \"CPU ACT-ATM7029 A9 QUAD CORE\"; Fantastic  - the package and tablet case look very nice; High resolution  - 1280 x 800 pixels; It has so many functions but very easy to use！", "Title": "Great value for money product!", "Date": "August 2, 2013"}, {"Author": "Fanesa", "ReviewID": "R1VES3AK4ZNH6B", "Overall": "5.0", "Content": "For the price you cannot beat this product. I have an Ipad which I paid over double the price for, and this tablet can do everything the Ipad can do and even more. There is an HDMI hook up which allows me to stream high definition quality television off the internet onto my TV, and also has a USB –OTG (on-the-go) hook up that lets you to link a keyboard and other items to the device. The compact size and sturdiness of this tablet makes it very easy to store and travel with, and along with being a well-made device it is also very easy to use. The built in android system makes the tablet a joy to work and play with. Anything from downloading apps to emailing clients is easy and fun. This tablet is very unique and is great for all ages.", "Title": "I am very pleased after purchasing the TBS2700 Quad Core Tablet Hamlet.", "Date": "December 29, 2013"}, {"Author": "Cameron Stuart", "ReviewID": "RPIP2LG5X4MGT", "Overall": "4.0", "Content": "A decent tablet, does everything that I need it to for cheap.I would have liked to see a newer version of android, but it works just fine on 4.1.", "Title": "Good tablet, Good price", "Date": "January 18, 2014"}, {"Author": "Gail Fugate", "ReviewID": "R1OXK7HV8CRVFL", "Overall": "5.0", "Content": "The tablet got here really fast and in excellent condition! I am very pleased with the product with one exception.  I only have 4 games downloaded and it keeps saying the browser speed is too slow.", "Title": "TBS Hamlet", "Date": "January 6, 2014"}, {"Author": "madcow", "ReviewID": "RMID8Y6Z3K5KC", "Overall": "1.0", "Content": "Have to return this.  One week in, the tablet and charger have heated up and burned out. Before that, l admit it was a nice little tablet.Received phone call and email from company rep. He was very polite gave me a refund promptly.  They're all cool with me.", "Title": "Too hot to handle", "Date": "December 30, 2013"}, {"Author": "David Webb", "ReviewID": "R3CQQYWG7OJED8", "Overall": "4.0", "Content": "No.it hasn.t.tthe tablet hasn^t performed adeququately' since first dy i got it from mailbox.thr unit is extremely slow, touch screen freezes often, andit chsnges locations randomly on its own.there are a grouop  of things it does on its own!!", "Title": "This unit doesn't represent the majority of this product line'which is good!", "Date": "February 20, 2014"}, {"Author": "Victor Manuel Diaz", "ReviewID": "R3F0U09JRJC5AF", "Overall": "3.0", "Content": "One week of use with the tablet and the battery is burned out.  functions only with the charger connected directly.", "Title": "Battery", "Date": "January 27, 2014"}, {"Author": "Eda Davila", "ReviewID": "R1OUAPGKHLUF5I", "Overall": "5.0", "Content": "I go a few days using it, for the time being it is rapid. Easy to use, light, the simple instructions, which does not convince me is the loader of the battery, you have to move it so that the battery could be loaded, they must correct that thing about the loader of battery, of the rest it is up to the moment quite well, I like.", "Title": "I love it", "Date": "August 20, 2013"}], "ProductInfo": {"Price": "$199.99", "ProductID": "B00D86LVGK", "Features": "Quad Core ARM cortex A9 processor(more powerful than iPad Mini A6 dual core processor) and Quad Core GPU brings super fast performance on tasks and games.\n1280x800 HD Display IPS screen: 216 ppi High Definition IPS screen means clearer, sharper images. It allows you to watch HD movies, video and TV.\nDual Cameras(Front 0.3+Rear 2.0 Mega Pixels) let you shoot beautiful images and record HD videos anytime and anywhere.\nLarge Capacity: 1GB RAM, 16GB internal storage and it supports up to 32GB external TF card. Support Android apps, games, Netflix, Youtube, Facebook, Gmail, Skype and more. HDMI output to TV.\nYou pay much less for almost the same features hardware as iPad Mini, Google Nexus 7 and Kindle Fire HD.", "ImgURL": "http://ecx.images-amazon.com/images/I/51zCmJZ9ZoL._SY300_.jpg", "Name": "TBS®2700 Hamlet 7\" inch Google Android Tablet PC, Quad Core Cortex A9 Processor, Quad Core GPU,1GB RAM, 16GB Internal Storage, 1280x800 HD Display IPS screen, Wifi, Dual Camera, for Netflix and Games, HDMI Output to TV(Black)"}}