{"Reviews": [{"Title": "Akaso R7X", "Author": "Paws", "ReviewID": "R1PG315K73KCF8", "Overall": "5.0", "Content": "I bought the Akaso R7X with the expectation of receiving a cheap tablet, i am typically not a person to settle for something cheaper, i have expensive Samsung screens, Asus and Samsung 120hz monitors.-PerformanceThe performance of this tablet is actually very good for it's price point, Antutu Benchmarked an average score of 11780, in comparison an ASUS Transformer prime scores just over 12400 and that is a $320+ tablet. The Google Nexus 7 tablet scores only just above the R7X, a negligible difference, most of what you're paying for is the screen in both of those devices. In real world applications, i had a podcast running in the background while reading a PDF transcript, while switching between Office SuitePro 7 and my college school app, i occasionally had to open the browser to copy text for reference, needless to say this device has plenty of power to run multitasking apps. I tested 720p, 1080p, 1080p 120fps and 4000 resolution videos, the 720 did fine, 1080p did great aswell, the 1080p 120fps video ran at 92fps, meaning the hardware hit it's limit in bit rate streaming, most BluRay are 60fps so this device can perform BluRay standard quality in video streaming, the 4k video file was unwatchable, however my Nexus 7 can't play it smoothly either.The amount of memory available is about 520MB as the JellyBean OS uses a good chunk of memory compared to the previous ICS, it is more likely you will hit the RAM limit of this device before you experience any real multitasking performance problem.The browsing experience is nice and fluid on this tablet, in fact i find it to be a better experience than my Nexus 7. It is important to note that Adobe has cut flash support for android devices in JellyBean (Which the R7X runs on) If you download the Dolphin browser you can still access some flash content, however embedded videos will not play, there are alternative browsers with a forced built in flash but the quality is not there.-ScreenThe first thing i did when i got my tablet was look it over for issues and defects, because the screen is the majority of user interaction, from visual fidelity to touch sensitivity. The touch sensitivity is good, accurate and keeps up with games and applications i tested.The screen is between \"moderate\" and \"ok\", you will find quickly that the maximum brightness is rather low in my opinion, but still enough to be vibrant in an Indoor-sunlit area. All of the colors are very nice and clean however the blacks have a minor wash out, nothing you really couldn't look past and the whites look like a grayish paper tone compared to the Samsung displays.One of my worries was the clarity of the display, i can say with confidence that this display's clarity is suitable for most anything, because i read a lot of Japanese text it is important that i can identify small strokes in Kanji, which i can do with this.-BatteryI am not taking a star away for this, the battery takes quite awhile to charge and under heavy use this tablet will start warning you of low battery after about 2 hours, that's rather short lived (Please note, \"Heavy use\" is defined as using more applications and features simultaneously than the average or even super user) watching videos that do not require WiFi, music or just casual web browsing will give you a good 4 to 6 hours, having the brightness down half way when not using the display (such as for music) or having the display off with music in the background can yield even more time, but be wary the battery life is enough to complete one or (big maybe) two movies streaming.The cost to performance for this tablet is unmatched, If i were on the fence between the Nexus 7, the Asus Transformer or anything of the sort, you will be much happier with this tablet and that extra $100 to spend on other things, or even a second tablet, if i have any alternate recommendations, it is that a 9 or 10 inch screen would make a better experience in my opinion.-Things to consider*I recommend the Dolphin Browser instead of the one they have preinstalled, it will enhance your experience and negate any feeling of poor performance the stock browser may give.*Find an \"App Killer\" on the Play Store when you get this tablet, there is no way to kill processes and this will run your battery down in standby mode if left on, plus it will eat the memory quickly.*This tablet supports my 32GB HC Class10, i was able to transfer at around 17MB/s using USB 3.0 through the device.I would recommend this tablet to anyone, as long as you don't set your expectations ridiculously high, you will actually be very surprised at how powerful and well done this tablet is.", "Date": "July 3, 2013"}, {"Title": "great", "Author": "timothy j bartolovich", "ReviewID": "R3QJKZUE2YG4NO", "Overall": "5.0", "Content": "It was everything I expected and then some . The screen is very clear not much glare. Fast works as good as my laptop.it wasn't charged I plunged it in and have been playing with it for awhile now and it is charging while I've been on it. I would recommend it works great", "Date": "July 29, 2013"}, {"Title": "Pleasantly Surprised!", "Author": "BobInKyle", "ReviewID": "R86NIM9ZTKTH8", "Overall": "5.0", "Content": "This is a great little tablet at this price point that includes USB and HDMI interface.  Very happy with purchase.  If you are looking for a tablet that is reasonably priced for the kids, this is the ticket.  Also fits the need where perhaps one does not want to pay Apple's bloated prices.  Competition is beginning to surpass Apple in many ways.  Kindle could take a few lessons from this tablet.", "Date": "July 2, 2013"}, {"Title": "husband loved it", "Author": "Veronica Asher", "ReviewID": "RWAXOL1VSOHSO", "Overall": "5.0", "Content": "got it for my husband and he is very happy with it got it very quickly and was happy with the fact tht is as advertised and works n functions properly", "Date": "July 1, 2013"}, {"Title": "Good tablet with miserable battery life and bad storage options.", "Author": "Evan Arsenault", "ReviewID": "R1U103LEH6EMNC", "Overall": "2.0", "Content": "I spec'ed out this tablet as an alternative to a more expensive Nexus 7 and it was a pleasant surprise in every aspect....except battery life. When using it for email and facebook you might get 2 hours of solid use but gaming kills the battery at under 45 minutes, kind of defeating the purpose of a tablet. The packaging was impressive and they give you plenty of adapters but I found it strange that I couldn't use the micros USB adapter I power my phone with on this tablet. Also another bad area is the storage, they give you 8GB BUT its spread across 2 drives. You main OS drive has about 512mb free after the OS, then there is roughly 7.5GB on a 2nd HDD, which is fine except if you download a large app from the Play Store (BTW some generic android tablets won't even run the Play store so it was nice its installed) it won't see the 2nd storage space and just won't install. Smaller apps are easily installed to the first HDD and moved to the second HDD via the application manager. It took less than a week to realize that it just would not work out and I sent the tablet back.", "Date": "August 10, 2013"}, {"Title": "Dual Core - thumbs up!", "Author": "jay", "ReviewID": "R35N8Q49IY6C0J", "Overall": "5.0", "Content": "We have had it only 24 hours.  So far it is great!  It is fast and updated itself as soon as we turned it on.  We have surfed the web and played games.  Love it so far!  I will write another review in a month.", "Date": "July 27, 2013"}, {"Title": "does what the specs. says it should do...................from a( gotta have something fast) above avg. user", "Author": "Ritchie Cuthbertson \"biggcity704\"", "ReviewID": "R3IBHK3CGK5HCX", "Overall": "5.0", "Content": "very impressed.  pros- beautiful screen, fast processor, jelly bean os, nice multi touch screen, just a great tablet for aveg. user and good tablet for above aveg. users  cons.- screen acts funny when trying to use while charging(just unplug),  side note using just wifi this tablet runs faster than my samsung S 3 phone(at least a little faster). This tablet(so far) is at least worth 150-200 $ easy compared to those 7\" price range tables.0 notice more cons below avg. Battery life and as expected poor back camera other than that I feel like I got steal price have Already gone up.", "Date": "August 8, 2013"}, {"Title": "Wow, great bang for the buck!", "Author": "Mr Jellybean", "ReviewID": "R4064AK48B3ZM", "Overall": "5.0", "Content": "This is the 3rd tablet in my house.  I have a Nexus 7, my son has an el cheapo chinese 7\" ICS tablet for games and educational apps, and we bought this tablet for my wife.This thing nicely splits the difference between the cheap chinese tab and my N7.  The screen is bright and clear, and while it isn't as crisp as my N7's display, it is easy to look at and read from.  It is very snappy and responsive.  The build quality is better than expected.  All in all this is a GREAT tab for under $100.Weaknesses:  It can get a bit warm, the battery indicator isn't always exactly accurate, and if you run the screen at full brightness you will drain the battery VERY FAST.  Keep it dimmed!  Even at 25% brightness everything is clear.  The speakers are a bit weak, but if you are plugging in headphones or external speakers this won't be an issue.Overall, I don't think you'll find a better tablet for the price (new).  If something ever happened to my N7 I wouldn't feel terrible about replacing it with a tablet like this, which I could not say about my son's cheaper lower resolution tablet.", "Date": "July 26, 2013"}, {"Title": "Is good for the money!", "Author": "Gerardo", "ReviewID": "R26LA2MAMML3O4", "Overall": "4.0", "Content": "I need it to Check E-mail's, if you have a Google account this tablet can be sync to it. It does have GPS, any android market app can be download it to it. This is my first tablet so I'm happy with it. It does not have a slot for SIM a card, it is Wi-Fi only This is why I did not love it.", "Date": "August 11, 2013"}, {"Title": "Perfect", "Author": "Meghan", "ReviewID": "R2XK1L9UFXBIUU", "Overall": "5.0", "Content": "Though it froze once and had to be rebooted from the little hard reset hole, other than that there are no issues (this could have been user error and the power button held down too long).  Perfect for us and is a great second tablet!", "Date": "August 9, 2013"}, {"Title": "BIG MISTAKE", "Author": "johnny", "ReviewID": "R1XCWFAG1A8MMY", "Overall": "2.0", "Content": "poor tablet, battery gos out after thirty min. sometimes doesn't go on, sometimes will not shut down, bad service from tablet express, mailed them twice and got no answer, WHY? BECAUSE THEY ALREADY GOT MY MONEY. my advice, spend alittle more. but not with Tablet express. mine is going in the trash.", "Date": "August 6, 2013"}, {"Title": "Great!!!!!", "Author": "B. Hayes \"bhayes\"", "ReviewID": "REI67EEL2LSGI", "Overall": "5.0", "Content": "I purchased a $100.00 tablet last year from Amazon, the Coby 7016, and that is no comparison to this one. This King Pad can play Netflix and YouTube seamlessly over HDMI output to TV and Smart-board and the resolution for eBook reading and streaming videos is excellent. I do not know what more can be asked of a tablet. I am a school teacher and this is just what I need to connect to Smart-boards and TV sets to play computer content for my students.", "Date": "July 12, 2013"}, {"Title": "Do not buy", "Author": "Basshead", "ReviewID": "R1G1PVPCG3874I", "Overall": "1.0", "Content": "For starters right out of the box it looks great. On the other hand the wifi signal was crap. It wouldn't maintain a connection longer than opening a single web page.That is the reason for the one star rating.Tablets live off wifi this thing had little to no signal strength at all.Wouldnt even open google play or if it did open it would loose connection immediatly. Would not reccomend buying this spend a little more get something better ie a name brand. My other wifi devices get raging signals anywhere i used them  this thing no wifi bars equal no internet which equals99 dollar paperweight. Do not buy would be my advice.", "Date": "September 7, 2013"}, {"Title": "Good tablet for the money!", "Author": "Big Bill", "ReviewID": "R4L15QT3HER5F", "Overall": "5.0", "Content": "Not really sure what these negative reviews are talking about.  I ordered the tablet, then started seeing the negative reviews pop up.  Let me answer some of those complaints:Bad screen angles:  Those users must be blind.  Mine kept full HD at every angle, no loss of image at all.Slow:  Not slow at all.  This thing is actually faster responding than my wife's Galaxy 3.Battery life:  This one I'll agree on.  Unfortunately, the battery seems to have less juice than other tablets I've seen, but still respectable.All in all, I'm impressed for a $95 tablet.  Will get things done just fine.", "Date": "August 1, 2013"}, {"Title": "fast but low battery life", "Author": "dreadiejosh", "ReviewID": "RU2ARGPZXYYDJ", "Overall": "4.0", "Content": "this tablet seems to go nearly as fast as my girlfriends nexus. It has a up to date jellybean so its great for all the new apps, it just has a low battery life. But, i did get a tablet with a defective battery after 1 month and TableExpress replaced it for no charge!", "Date": "May 9, 2014"}, {"Title": "HORRIBLE customer service and defective product", "Author": "Tashia Miles", "ReviewID": "R10020X0B5HQJQ", "Overall": "1.0", "Content": "When I received the 7' tablet, I followed all instructions and when the tablet was finished charging I turned it on. Once on, I proceeded to unlock the tablet and then the tablet froze and the screen went black. I tried powering the tablet off but it did not move from the black screen; I waited a while and nothing happened. I emailed tablet express Monday morning (tablet delivered Saturday) and never got a response. I called right before they closed and the most rude, disrespectful person answered the phone and was no help at all. I tried explaining the problem and she cut me off and told me to send it to Amazon. I explained to her Amazon said tablet express shipped the tablet, she will still not listening to me. I hung up the phone and contacted Amazon and was able to get my problem solved. Ultimately the product was defective and I requested a full refund NOT a replacement as I will NEVER purchase anything from tablet express as their customer service is horrible", "Date": "January 27, 2014"}, {"Title": "Great, cheap tablet", "Author": "Jose Martinez Leon", "ReviewID": "R33OUFFP3SBLHQ", "Overall": "5.0", "Content": "0 complains so far, sometimes it takes a while to connect to the wifi network, but that is not a big deal", "Date": "October 27, 2013"}, {"Title": "Nice tablet but it stopped working in less than a month", "Author": "nancy merrell", "ReviewID": "R1DBZEKAT5JTJC", "Overall": "3.0", "Content": "I liked the features and it worked well. One day after a few weeks or so it stopped working. It did not turn on at all. I have never had a tablet before so I was pretty disappointed.", "Date": "September 12, 2013"}, {"Title": "Badd", "Author": "Braa", "ReviewID": "R2AQ51U6A0ZGGS", "Overall": "1.0", "Content": "The sound is terrible won't work well without headphones, short life battery, spend a little more and by a better brand", "Date": "September 6, 2013"}, {"Title": "Bad luck with this buy", "Author": "Amazon Customer", "ReviewID": "R3JQVXCPDNN0OK", "Overall": "1.0", "Content": "If it weren't for bad luck, I had no luck at all with this product.  When it ran, it was ok, as long as it was charging.  Unplugged and depending on what your were doing, the battery lasted anywhere from 20 minutes to 2 hours.  Finally sent it back when it started rapidly moving from screen 1 to 2 to 3 to 4 to 5 and there was no way to stop it.", "Date": "September 2, 2013"}, {"Title": "KingPad® 7'' Google Android 4.1 Dual Core IPS Tablet MID PC, Rockchips...", "Author": "Jaime J. Pozo Moreno \"JJPM\"", "ReviewID": "RVLSHK4M6GUC8", "Overall": "4.0", "Content": "Two months of continuous use and has not presented any problems. With 32 gb microsd memory becomes a tablet that has nothing to envy to other higher priced. If you have many loads applications, has good speed. It has the same utility as other higher priced. I recommend it.", "Date": "May 23, 2014"}, {"Title": "Stopped working", "Author": "April D", "ReviewID": "R3TMSZ8PJZ5A5A", "Overall": "1.0", "Content": "had this for 1 week and it stpped working! Only used it for looking things up. Never watched movies on it or played games. 1 week what a shame.", "Date": "May 21, 2014"}, {"Title": "so so", "Author": "franklin c. travis", "ReviewID": "R3VW07X8L0JMY0", "Overall": "3.0", "Content": "Nice for the price I thought the dual processor would make it a lot faster then the kindle  and it doesn't have a lot of memory", "Date": "May 11, 2014"}, {"Title": "tablet 7inch black", "Author": "Marylou Spanyard", "ReviewID": "RMOHU52G8CYHX", "Overall": "5.0", "Content": "Great tablet / pc . Product. Made a great birthday gift. Grandson says its easy to use.just what he needs for school.he loves it..  received it on time enjoyed doing buissness with them .I like it so much ordering anotherone. Thank you .Marylou", "Date": "May 10, 2014"}, {"Title": "Functions fine, but very little battery life and internal memory.", "Author": "Pauly Walnuts", "ReviewID": "RHGZXLYQW6DKG", "Overall": "4.0", "Content": "This was my first tablet and a good learning experience.  Here's my experience based pros and coins....Pros:External buttons.  Decent picture.  Good WiFi reception.  Reliable function.  Affordable price.Cons:Battery life. Download storage(only a few apps at a time). Screen brightness(bad in direct sunlight, good anywhere else). Cameras(only use able in bright light). Will not charge via micro USB.Conclusion, do your research.  Its a good pad for web browsing, that's about it.  But I personally don't require much more, so its good for my use.  If you require more than a basic pad, I'd say to spend more money.I'm writing this review on my akaso r7x, 8months after purchase, after lots of adult and kid use.Its a good buy for the basics, but don't expect too much for $100.", "Date": "February 24, 2014"}, {"Title": "Do not buy this tablet", "Author": "Don", "ReviewID": "R4676HO20PD1N", "Overall": "1.0", "Content": "We bought this tablet for our son for Christmas 2013.  The tablet does not seem to charge via USB.  The location of the DC jack is on a slanted edge of the tablet, which causes the plug on the adapter to bend.  The housing for the DC jack in the tablet itself also cracked due to the angled side putting pressure on the adapter.  I would be looking to return this tablet, only my son also dropped it and the back popped off, and the QC sticker ripped.  The screen also has cracks now.", "Date": "February 11, 2014"}, {"Title": "Value ok BUT!", "Author": "alan jones", "ReviewID": "RAIPU3XJC6P9B", "Overall": "3.0", "Content": "Good value for money. Battery capacity weak point of tablet.You are lucky to get 1 to 2 hours of gaming! Screen response little slow and corners are dead. Arrived quickly. If you want better quality  you have to pay more. I think I will return this item.", "Date": "January 24, 2014"}, {"Title": "Questions to be Asked before you OPEN package", "Author": "Linda S.", "ReviewID": "R8Y3CSFNOB21N", "Overall": "1.0", "Content": "Still trying to figure out how to use it. Would have sent it back if the instruction inside didn't say that you can not return it after opening.!!!!!!!!!!!!!!!!!!!!!!", "Date": "January 10, 2014"}, {"Title": "Great kids tablet", "Author": "Amazonian", "ReviewID": "R2A8DK390W0J10", "Overall": "5.0", "Content": "Bought 4 of these tablets for my grandkids. They are having a great time with them. Battery time usually last about 2 hours so they work out great as to limiting their daily use. Have returned one due to self discharge so waiting to see how replacing it works out with Amazon.", "Date": "January 8, 2014"}, {"Title": "ubs port broke customer service RUDE", "Author": "D. Cox", "ReviewID": "R2J6AVVAOQMBNS", "Overall": "1.0", "Content": "I gave this tablet to my husband for Christmas with a keyboard case that ran off the UBS port. After only 4 days off use, the UBS port stopped working. When we called the company they were rude and condescending. We told them we wanted to give them a chance to resolve the issue before giving them a bad review and they said they didn't care about a bad review...so HERE YOU GO! HERE IS YOUR BAD REVIEW!", "Date": "December 30, 2013"}, {"Title": "very disappointed with product!", "Author": "Diane M.", "ReviewID": "R32NN1LBP0BSN4", "Overall": "2.0", "Content": "I  was so excited to receive my first ever tablet.  For a day everything was great,  then began the problems.  First  I found that it did not retain a charge very well.  Then  right in the middle of what I was doing the screen froze up and I couldn't do anything at all including turning it off.  The only resolution was to let the battery completely die and recharge in order to use it again.  But within an hour or less it froze up again requireing the process all over again.  I tried for several days to use the tablet but it was obvious something was wrong so I made arrangements to return the tablet to Amazon.  This was very disappointing to say the least.", "Date": "September 22, 2013"}, {"Title": "Battery is slowly loosing ablity to keep charge.", "Author": "Bimmer Pilot", "ReviewID": "R2S7T481DG7RI3", "Overall": "1.0", "Content": "This tablet works well but the battery is worthless.  It does not keep a charge and I have only had it for little over a month.  I would not recommend this to my worse enemy.", "Date": "September 20, 2013"}, {"Title": "Returned as defective", "Author": "Mike Brucci", "ReviewID": "R3IZPH5PACPJS0", "Overall": "1.0", "Content": "Upon my first use of this tablet I installed 3 apps and went to test the camera, that's when it crashed and went to a white screen and wouldn't budge. The device would not turn off or do anything beside sit at a white screen. I had to wait for the battery to drain and then plug it in to try it again. On my second use of the tablet I was logging into HBO Go when it crashed to the same white screen. Very disappointed, this was purchased as a gift for my mothers birthday.", "Date": "September 20, 2013"}, {"Title": "great for a child not so. great for college student", "Author": "college student", "ReviewID": "R3493KRLSLEJNB", "Overall": "3.0", "Content": "Works great however does not have blue tooth so to use with a key board i had to purchse an acer at best buy. The keyboad/case combo that this is psired with the keys are too small to type with. Great first tablet for kids however for a college student i would say get one with bluetooth. Also cant handle many of the functions on my college web site. For kids though its a great first tab for the price", "Date": "September 20, 2013"}, {"Title": "dead in less than 30 days", "Author": "GLRCMARY", "ReviewID": "R176HDBPV10WL8", "Overall": "2.0", "Content": "Loved this when I first got it. But before 30 days were up, it died.  Would not turn on.  In addition, after using the Micro USB port, it would not turn off...just got \"shutting down\" message and could not do anything until the battery ran out of power.", "Date": "September 20, 2013"}, {"Title": "I like it.", "Author": "Sharon Stevenson Bandoo", "ReviewID": "R854733O7KGT3", "Overall": "4.0", "Content": "My neice love her Tablet & she can't stop downloading games for this. The only problem I have with this is the battery its running down to fast. But other than that its a good product & the speed is excellent & the Camera's are very clean.", "Date": "September 19, 2013"}, {"Title": "Kid friendly", "Author": "Donna Lewis", "ReviewID": "R13B0EDQVWMP0", "Overall": "4.0", "Content": "My child just loves it!! Good first tablet for a child. Help with school work and can be very educational.", "Date": "September 18, 2013"}, {"Title": "KingPad 7'' Google Android 4.1 Dual Core IPS Tablet MID PC, Rockchips", "Author": "CAAC", "ReviewID": "R3K89YMZF71L6D", "Overall": "3.0", "Content": "Internet is very very slow. The setup was easy. Good screen viewing angle. Poor cameras quality. But my daughter is happy.", "Date": "September 17, 2013"}, {"Title": "Very good product", "Author": "The Rock-r", "ReviewID": "R2UJ9TVT767HWR", "Overall": "5.0", "Content": "Excellent good quality and the color isgreat very good material thanks I can notcomplain terrific bay I hope to do morebusiness with you .  It's faster than I thought", "Date": "September 15, 2013"}, {"Title": "Its okay.", "Author": "KDM", "ReviewID": "R1O7VIHBGX470M", "Overall": "3.0", "Content": "For a $96 tablet, it's nice. Personally, I wish I had saved my money and just bought an ipad instead. If it is a gift for a tween, than this is the tablet for you. When it works, it works wonderfully, but the touch pad is mediocre around the edges of the screen. I find myself having to aggressively tap the screen multiple times in certain areas of the screen. However, like I said, for a $96 tablet it runs really well.", "Date": "August 26, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00D9NRUY4"}}