{"Reviews": [{"Author": "CatFan \"catfan\"", "ReviewID": "R1LBLIJW62AS4L", "Overall": "5.0", "Content": "I have to say, this is the best tablet I have owned yet. I have owned at least five tablets within the last two years, and out of all of them this has been the best overall. Except, maybe, for the Acer a 100 I purchased in the beginning two years ago.this tablet has the same screen size as the iPad mini, but this one also has everything with it including extra SD memory card slot. Also it has the front and rear facing cameras, plus quad core processor!!! Not to mention it has a high definition screen and all the extras including bluetooth 4.0.  I can easily hold it with one hand without any issues.  Unlike what it says in the description, this comes fully equipped with Android 4.2.2.  This tablet is super fast!  It also comes equipped with GPS, I opened Google Navigation and within seconds, it connected to satellites and found me within 1 foot of where I was!  What's great is the fact that it doesn't have to be connected to the internet for directions. I immediately hopped in my car and drove forty-five miles to my parents house and it got me there in one piece without any wifi connection whatsoever. I can honestly say I think this tablet deserves five stars across the board! Absoluely a fabulous tablet and I recommend it to anyone and everyone wanting a tablet. The best thing about this tablet, is the fact that it is under $200. That is an unbelievable price for a quad core processor for Android 4.2 tablet!!!  In fact, this tablet out does earlier Acer models, there are not any heat problems with this model either.  Just buy it, you will not regret it!  This tablet is even better than the iPad mini easily.  Just try it, you will definitely agree.  Wow!  I spoke this review via the microphone option on my Acer a1-810 tablet.  It does great!", "Title": "what a tablet!!", "Date": "July 12, 2013"}, {"Author": "W. Soh", "ReviewID": "R2FCHO5W68A6UO", "Overall": "4.0", "Content": "This is the tablet I've been waiting for forever! I have an apple ipad mini and I love the screen size over the more common 7inch tablets most brands are offering now. I love the fact than I can view flash content videos which the mini iPad couldn't do.Enter the acer a1:The good:It has the lovely 7.9inch screen ratio 4:3 for better web browsing. I'm not fond of 16:9 formats.Quad core - Boot up is 1 sec slower than ipad mini.HDMI !! Very useful for playing movies on.External sd! I just inserted a 16GB microSD - it works :)Cheap!The bad:1)Larger, thicker and 100g heavier than ipad mini.2)Front camera is pretty bad for webcam. Acer placed the 5MP camera at the back.3) Although the resolution is supposedly similar to Ipad Mini, the Acer is really less sharp and has yellow cast in the whites. The screen is really not as good as the IPAD mini. Image looks sunken in - unlike Samsung & Ipads - image appears near surface of screen. (viewing angle is also not as good).4)Battery life is not comparable to iPad mini - ipads are invincible when it comes to battery life.5)The speaker is too soft!6) Web browsing tends to hang sometimes.At half the price it is very good.Plus i can now watch flash content and live streaming, which the main reason I bought this pad for.UPdate: 17th July 2013I realise a bug in the Acer A1 8100:Took 4 hours to trouble shoot.If you enable the 4 tap image enlarger (correction: its actually 3 tap image enlarger - under settings=> accessibility), the tap function of the pad delays up to a second making it impossible to play pinball and all tap games.So I disabled the 3 tap imager enlarger under \"settings=>accessibility\" and the tap becomes ultra responsive now.", "Title": "The right size at the right price!", "Date": "July 12, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2NIT05H8RI2X2", "Overall": "5.0", "Content": "I bought my first *new* tablet recently, an Acer Iconia (A1-810). My old Galaxy Tab was from a client. The Acer has a 7.9\" screen, front (skype) and rear (5.0mp) cameras, HDMI output (for video to your HDTV) and a MicroSD expansion slot (you can add more storage to it).I had it on my Amazon wish list at $199.99. It dropped to $169.99 and I got an Amazon gift card for my birthday so I snapped it up. I have Amazon Prime, with 2-day shipping. I got it in about 30 hours! I must live near one of their fulfillment centers.So far, I'm happy with it. What makes a good tablet depends on your use case. Some people want to carry around a portable cinema to watch videos on. If so, this is not the tablet for you. My main uses for it are Google Maps / Google Earth, traffic maps, PC remote control (e.g. Teamviewer), e-books (e.g. Kindle), web browsing and sometimes working with documents (Word, Excel). The GPS works without a WiFi connection, I'll never be lost again! Skype, on-the-spot picture taking, light gaming and of course, e-mail.The tablet is adequate for all of these tasks (or it should be, haven't tried all of them yet). I'd venture to say it is the best under-$200 tablet you can buy for these uses, and damn sure the best for under $170!Pros: Great screen size and form-factor (4:3) for web browsing, looking at maps, remote-controlling my PC and for reading e-books. Front and rear cameras, GPS without a data plan, Android 4.2.2, expandable storage.Cons: OK but not great for movies and video. Built-in speaker sucks. Rather heavy and unwieldy for reading in bed (still much easier than a hardcover book!). Seemingly iffy speech recognition.", "Title": "It's no iPad Mini, but that's not what I wanted!", "Date": "September 3, 2013"}, {"Author": "Khaled Reviewer", "ReviewID": "R2FTDM96KAZK5N", "Overall": "4.0", "Content": "Before i bought this product i watch and read tens of reviews & videos about this product , i was totally aware about it , and knew the pros and cons , there are 2 myths i didn't found actually in my iconia a1 : the screen is dimmed ! .. that's absolutely not correct , the screen is very clear and very good , you can read things and articles as you do on your laptop but on 8 inch display , it's not very high resolution but it's very good for a normal person , just don't compare it with iPad 4 generation with retenia display and everything well be alright !the second myth that it's too fast in web browsing and videos ! , unfortunately that is not correct , it take few second to load the pages , not too much but not ultra fast for a quad core device but it's fine and you can live with itthe tablet is not heavy as i thought , it's not as thin as iPad mini of course but it's not heavy to hold it while walking or even when you are laying on your bedas the previous reviewers said , you have to press a little bit more especially in the back button , i don't like that but it's not a big deal indeed , anyway it's a major con and cause to give 4 star instead of 5 !camera is good as a 5 mega pixel , but don't expect more !well , if you are a user who don't like to hold 7 inch tablet \" too small \" or 10 inch \" too big \" .. this is the perfect choice for youif you don't like to pay hundreds of dollars on a device and tens of dollars on it's accessories and repairing in case , and own a tablet with the latest OS with a very good features in a good price from a well known company , so it's a good deal .. go aheadmy advice if you are going to buy it :1- buy screen protector as the fingerprint is shown clearly on the screen2 - update the applications once you open it ,3- if you are a hard user buy a case - any type whatever - as it getting warm a little bit with continuous using \" most of new generation of tablets and smartphones do that , don't worry \"finally , the tablet is worth to buy , it's really a perfect balance and i recommend it", "Title": "My Review - Iconia A1", "Date": "September 22, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1URYLPJY8N3MH", "Overall": "5.0", "Content": "For $169.00 this was an amazing buy.  I LOVE the size.  The 7\" is just a bit too small for my eyesight.  This 7.9\" acer just feels right.  I have the ipad 3 and I like it, but I don't care for the size. Too big for my purse.  My 14 year old sort of took it over anyway!  So, I wanted something just for me and I didn't want to spend a fortune.  And I wanted it to be lightweight.  This is lightweight (just short of 14 oz, weighed it on my food scale).  I like the bezel on the sides, because if there isn't a  big enough bezel it's too easy to hit stuff on the touch screen you don't want to.  I originally thought I wouldn't like it because it didn't have flash.  Then I learned that adobe quit supporting flash on all mobile devices, and any android after I believe 4.0 won't have a flash made for it.  I learned that basically most websites are using things other than flash due to their decision not to support it.  If you have an older device you probably already have it Flash - after Anddroid 2.2 I believe - but it will no longer be updated or supported. I go to a Weight wtchrs site and wanted to do the recipe builder but it said my device didn't support flash.  All I did was download Firefox from Android market and then I went to the adobe website and downloaded the last archived flash for android app (you won't find it on Google play).  I was then able to use that function when on Firefox.  Other than that I have not gotten the annoying 'flash' message on the android browser or on chrome.  The camera on the back is pretty good, not great in low light but not bad.  Keep in mind it cost $169.00 and you get a 5 mp camera with it, that's pretty amazing.  I don't do Skype, and don't really have a use for the front camera, so I can't comment on how good that is.  This also has face recognition for unlocking, if you want to use it.  It is fast and fun to use.  The 'negatives' are the sound - not so loud, but I'm ok with that for the price.  The screen isn't quite as crisp or bright as the Ipad, but also to be expected for the price.  I haven't tried the HDMI out yet, gotta get a mini hdmi cable.  So I can't comment on that yet.  The battery life has been pretty decent too, not as awe-inspiring as the ipad...but again, the price.  I have a mifi that I use for this when we go to our camper.  It's an at&t; mifi, and something odd did happen when trying to access the internet.  When my son was on the ipad surfing the web, and I was as well, the touch screen acted goofy.  Some links just couldn't be clicked on.  But once he got off his ipad, it worked fine.  So, I think it must have something to do with the mifi strength or something...just really odd.  They both work great together on our home cable wifi.  One thing I also couldn't get to work - the GPS without wifi support.  I hoped it would, but it didn't work on my lg optimus 9 phone without wifi, and it didn't work on the ipad of course (no high speed internet on the ipad, and no gps on the wifi only ipad, so even with a supporting wifi, no gps).  Maybe it's operator error, but I have not had much luck with it.  Also, as far as build quality, I think it's fine, but some would feel it was little too thick.  It's a bit 'plasticy' but that's fine with me.  Once I put it in the case that I ordered from Amazon, it won't matter anyway.  To surmise - I've had it a few weeks.  I'm happy with it and so far so good.  Cannot yet speak to it's longevity, but hopefully it will last a few years.  Good luck on your tablet shopping!", "Title": "Amazing specs for the price", "Date": "September 2, 2013"}, {"Author": "NNBBFL", "ReviewID": "ROSMR6VEDCSHU", "Overall": "5.0", "Content": "Just received this, it is my first tablet (I do have iPhone) so am still learning all the features and how to use it. Have wanted a tablet but couldn't really justify spending a lot of money since I do also have a laptop. It is a want rather than a need but figured this was a great way to keep up with technology and see if it would satisfy my computing needs. Now that I have it I can't believe what I got for the price!  I love the size and will use this for reading kindle books and web surfing. Never have played games on my phone but  I will on this. I am 64 so being able to see without my glasses is a big plus. I just figured out how to compose emails by speaking like I saw in another seller's demo and that is also another reason I bought this .Also it is a plus being able to edit all the Office documents with the OfficePro app.", "Title": "My first tablet - Love at first sight", "Date": "July 13, 2013"}, {"Author": "Frank Collins", "ReviewID": "R16ZIVJR4BWB8S", "Overall": "4.0", "Content": "After trying and returning two 2013 Google Nexus 7's and two Samsung Note 8.0's because both examples of each pair had essentially the same unacceptable problems, purchasing this Acer tablet was a move of desperation. One would have thought that a tablet this inexpensive and somewhat of an off brand would have been even worse than those I had already tried. However, I was surprised to find that this tablet performs quite well and has given me no problems at all, with the strange exception noted below.The touchscreen was at first quite difficult to use. One had to almost punch the screen before getting a response. As another reviewer said, you have to press so hard that you come to feel that the screen might be resistive rather than capacitive. However, I finally figured out that it must be some kind of grounding problem that can be dealt with. When I had to punch the screen to get a response, the tablet was in a case that I purchased at the same time as the tablet. So, the tablet had always been in the case. I noticed that if I was charging the tablet, the touchscreen behaved normally and responded to normal pressure touches. Then I tried the tablet without the case and, if I held it in my hands, the touchscreen also behaved normally under those circumstances. I don't mind using the tablet without a case, but I took off one star from an otherwise five star product, for the inconvenience and potential for damage if dropped.I have thought because of the touchscreen issue that perhaps I have a defective tablet, but, as noted above, other reviewers have seen the same thing. Also, my pervious experience with the Google/ASUS and Samsung tablets, suggests that defects are often not specific to one sample but are generic or at least quite common. In other words, I would probably have the same touchscreen issue if I exchanged the tablet and possibly other problems also.Other than this, the screen is somewhat low resolution but looks OK and videos also look fine, even HD movies. For movies, you need to set the brightness to its maximum value, which is fine for viewing movies but, for some reason, is nowhere near as bright as other tablets I have used. There apparently is not an ambient light sensor, so there is no auto brightness control.Music sounds good through headphones. I have only used the tablet's speakers for touch sounds and notifications. I haven't noticed any delays in responding or jerky playback of videos. I haven't had any freezes or reboots (this was the major problem with the Nexus 7's). I am still learning how to preserve battery life by turning off functions I don't need, but the battery life is not bad. I need to recharge by the end of the second day, or sooner if I watch a movie.I use the tablet multiple times every day and I like using it. I would recommend it to someone else, with the caveats noted above.Update: The difficulty getting the touchscreen to respond has been getting worse over time, even when hand held. Also, I noticed that a stylus was essentially ineffective in evoking a response from the touchscreen, again even when hand held. At this point, it seemed inescapable that I had a defective unit that might eventually become completely unresponsive. I, therefore, decided to return the item. I still feel that if you happen to get one of these in which the touchscreen works properly, it is a very good tablet.", "Title": "Good value and performance", "Date": "September 9, 2013"}, {"Author": "Paul \"Paul\"", "ReviewID": "R3PIK6PIPU2OIJ", "Overall": "4.0", "Content": "This is by far the best mix of performance and price I have found in small tablets. But perhaps the biggest reason to love this is the aspect ratio: it is 4:3 rather than the standard 16:9 used by the vast majority of Android tablets.I have a 7\" tablet which I use mostly for reading and web browsing, but the screen is just too small to comfortably view most web pages. I want a \"one-hand-able\" device so don't want a 9/10\" tablet, so a 4:3 small tablet is the perfect mix. The iPad Mini would be great hardware-wise, but I strongly prefer Android to iOS.Except when viewing movies (which I rarely do) I hold the device in Portrait mode, and the extra screen width makes a huge difference. For example, the screen is nearly 40% larger than a 7\" tablet, and is actually *wider* than 9\" tablets, but much shorter, lighter, and less expensive.PROS4:3 aspect ratioLightness and portabilityExcellent build qualityAndroid, not iOSMuch cheaper than an iPad miniMore tablet-aware apps than I expectedQuad-core CPU performanceUSB port, SD card slotLatest 4.2.2 Android releaseCONSNon-Retina display (1024x768, same as iPad Mini)Slightly larger than an iPad Mini, so its accessories (e.g., covers) cannot be usedNot as many tablet-aware apps as the iPad MiniMy first unit would not boot up, but an amazingly quick and painless return process (thanks Amazon!) had a new and perfect unit at my door in 36 hours.NOTE ON L416 vs L888 MODELS:There are two model numbers of this tablet: A1-810-L416 and -L888. Each is listed for sale separately at Amazon, which has led to much confusion.Contrary to information in other reviews/answers above, L888 is merely a minor hardware revision--the fundamental hardware/software specs are identical: [...]The only difference seems to be the CPU: L416 uses the Cortex A7, L888 is A9. Sources differ on which is better. This is the best article I've found, which gives the nod to the A9: [...]HEADS UPThe \"HP Slate 8 Pro\" is a 4:3 tablet coming in Fall 2013, with a Retina-quality display. This will be the perfect device in my opinion, and you may want to wait and check it out. However it will surely be significantly more expensive.UPDATE 12/2/2013: The HP Slate 8 Pro is now available, and is almost exactly double the price of the Acer. HP Slate S 8-7600US 8-Inch 16 GB Tablet (Soft White) Is the higher-resolution screen and other hardware specs worth the difference? Perhaps to you, but for me: not even close.RANTWhy the heck don't more Android tablet-makers use 4:3??!! In my opinion this is one of the main reasons iPads have been so much more successful than Android tablets. I'm amazed and frustrated that so few seem to notice or care about this extremely important difference.", "Title": "Perfect small tablet in the ideal 4:3 aspect ratio", "Date": "September 24, 2013"}, {"Author": "Laurie A.", "ReviewID": "R1MXY7P7HB164O", "Overall": "5.0", "Content": "The Acer Iconia A1-810 Tablet is the best.  Don't let the price fool you.  This same tablet is being sold elsewhere for a lot more money.  I have tried other more expensive tablets and this blows them away.  The quad-core is lightening fast.  The tablet is so responsive, and I am able to do everything I want with it.I have found all the claims in the write up about the tablet to be true.  The HD quality is excellent, the battery life is about 7-8 hours depending on what you are doing with it.  The size is perfect, and is not heavy.  It fits in your hands nicely.  It looks elegant and professional.If you want an excellent operating, great looking tablet at an unbelievable price, I couldn't recommend the Acer A-1810 enough.It so deserves the 5 stars and more.", "Title": "Wonderful Tablet", "Date": "September 22, 2013"}, {"Author": "Kevin Chang", "ReviewID": "RCTSVE7KUVK1H", "Overall": "5.0", "Content": "I have been following the news and reviews about Acer's new Iconia A1 since I first heard about it a few months ago. It has everything I was looking for with a very attractive price tag.  I ordered it as soon as it was available on Amazon and I am loving it. I love how clear and crisp the tablet looks, and the pictures it provides, I love how easy the apps can be downloaded and removed, and the best of all to my opinion is now I can easily watch programs on Youtube, Netflix, VIki, espn3 on my big screen TV through this Tablet's micro HDMI output, and the picture is great.  I am canceling my cable.The front facing camera can be a little better, but people can still see me ok on Skype.  For the price, I will probably get a second one as a gift for my dad.", "Title": "Just what I have been waiting for", "Date": "July 30, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RXAZC8IU3M5MB", "Overall": "5.0", "Content": "Overall excellent tablet. Apps run quickly and easy to use. The only thing is that even though there is a SD card, you can't save apps or download to the card. Files can only be loaded to the card via a USB cable from a computer.", "Title": "Great tablet", "Date": "August 14, 2013"}, {"Author": "David C. Wells", "ReviewID": "R1VY57ZCSALL0N", "Overall": "4.0", "Content": "this isnt a bad tablet for the money the most impressive thing about this tab is how fast it is very fast faster then my first generation nexus. the screen is decent not close to the quality of the nexus 7 but a good screen none the less. it also gets points for the expandable storage and front camera both things the first gen nexus didnt have there is a lot of good things about this tab the only negative part is that the touch sensitivity could be better! not that its really bad but it aint the best either. i had the same problem with my 10 inch acer iconia a700. then acer put out a update that added a extra setting called performance where you could tweek the touch sesitivity it really helped with the performance of that device lets hope acer will do the same thing for this one all in all a very well made solid tablet its probably not in the same league withe the second generation nexus! but if you really need more storage then nexus can give you(as i did)  then you should consider this device.", "Title": "nice tablet", "Date": "August 21, 2013"}, {"Author": "Olga Lee", "ReviewID": "R1PC2126A126BR", "Overall": "1.0", "Content": "My tablet was two and a half month old when it lost sound. The seller said that the return period (two months) is over and I have to contact Acer and they would provide an outstanding service, no phone numbers. After multiple phone calls I was permitted to ship(on my expense) the tablet for repair to Texas facility. Later they contacted me and said that the tablet has a screen crack(no it was not there, but there is no way you can prove it) and to repair that would cost me $245 (warranty does not cover that)and otherwise it is not repairable. Also I should file a claim to the USPS like it was damaged while shipment  (I would get $50 compensation).P.S. I required my tablet to be shipped back to me. When it came it had very obvious intended damage like when it was hit against hard surface. It would not even turn on anymore. Indeed outstanding service!!!", "Title": "poor quality, unbelievable service", "Date": "November 22, 2013"}, {"Author": "JMac", "ReviewID": "R2JD608FVGAEGD", "Overall": "5.0", "Content": "OK, what I do when I review is give a review based on the product compared to what I paid for it. I can't stand reviewers who buy a $169 tablet and then rate it at 2 Stars because it is not an Ipad. So here is my review for this Acer...This thing seriously rocks. I can't believe this tablet is only $169... Does not make sense to me. I think they are under-pricing it big time. I have had tablets for about 4 years now, starting with the Archos IT70, then the first Kindle Fire, then the Kindle Fire HD for my wife, and finally this Acer 7.9' Iconia. This tablet is very, very good for the price. Actually, I think it would still be a good value at a $200 price point.Mine came with Android 4.2.2 installed. So far, no problems. All apps seem to work just fine. Wifi works great and does not drop. I watch tons of Netflix and it works great. Internet Browser works great (I downloaded Firefox). Yes, there is an easy way to sideload Flash. Screen looks great. Kindle app works great. Hulu plus shows videos flawlessly.I bought a Bluetooth speaker here on Amazon (the Anker 4.0 for $30). You will need an external speaker, because the Acer tablet speaker is perhaps the worst speaker on any tablet ever made. You should know that going in, though, since so many reviewers have written about it. This Anker speaker really puts this tablet up to a very high level.GPS works fine. So many great things about this tablet.. Oh, the 4.3 aspect ratio is cool. I really like it!All in all, this is a very fine tablet especially at $169. I am glad I bought it!", "Title": "Fantastic tablet!", "Date": "October 5, 2013"}, {"Author": "Sexxysavvy", "ReviewID": "R20JI0KOPRT5VT", "Overall": "4.0", "Content": "This is my first tablet and I am beyond impressed.  This tablet is very fast, responsive, nice size, dual cameras, great picture quality, SD slot, HDMI connection to stream movies and videos... not to mention Im writing a book and I can upload my documents and finish my book...very impressed!", "Title": "AMAZING!", "Date": "July 14, 2013"}, {"Author": "Dman", "ReviewID": "R2OIP0OHOUX35I", "Overall": "4.0", "Content": "As another reviewer has noted, the Iconia A1-810-L416 purchased via Amazon DOES come with Android OS 4.2.2, and it DOES include a GPS receiver. I don't know why Amazon's listing says OS 4.1 and doesn't mention the GPS, but it might be misinformation from the seller, Adorama: Their packing list indicates the product has OS 4.1, but that IS incorrect.  This is my first tablet, and I've only gotten started with it, so I can't give a detailed review. I'm getting used to using gestures (easy so far) and the virtual keyboard (still learning how hard to tap, but I already like it better than my old HP PDA stylus-operated leyboard). Everything I've tried works the way I expected it to.  Google Voice Search is the only speech recognition feature I've tried, but it's gotten evrything I've tried right the first time. I'm looking forward to dictating notes and emails, etc., rather than relying on typing.  I can instantly view stills/video from my Canon camera on the tablet using the micro SD slot, as I had hoped.  Now to gear up with the apps I need in order to synch via USB with OneNote and Outlook. (Not a cloud user, yet.)  I might go to 5 stars once I've had time to use this tablet for more than the few hours since it arrived.", "Title": "Better than specified: includes Android 4.2 and GPS", "Date": "July 18, 2013"}, {"Author": "Chris E Nordyke", "ReviewID": "R3UOA1UNYA3VRA", "Overall": "4.0", "Content": "I tried several differnt tablets and the Acer did well against the competition.  Movie playback is good with crisp resolution. Two cameras are a plus. SD slot and hdmi are a huge bonus over the competition. The only major flaw is the horrible speaker sound.  It was easily fixed with an $8 tablet speaker set.  Overall, I love this tablet esp if you can find it under 160!", "Title": "Nice android tablet", "Date": "November 27, 2013"}, {"Author": "KSev 83", "ReviewID": "R1PTUV1BJ50LY0", "Overall": "5.0", "Content": "Love the 8\" tablet! I owned an original Acer Iconia11\", and it was stolen along with laptop. When replacing, I bought an Acer touchscreen laptop and decided to go for a smaller tablet. The 8\" is so mych better than a 7\".. It is small enough to tuck into my purse or bag and use anywhere. This tablet is quick and responsive and has yet to freeze up or falter. Great choice for someone who doesn't need the much higher price of the iPad mini, but wants to surf the net, play games, read email, and other tasks. Worked great with google maps on my last long drive (used phone for 4g connection). Screen much bigger than phone, and sound was great.The screen is crystal clear and watching Netflicks is enjoyable. I recommend earbuds for movie or music.", "Title": "Great android tablet", "Date": "October 28, 2013"}, {"Author": "Sojwal Pohekar", "ReviewID": "RMPJ5CEIH1MUX", "Overall": "4.0", "Content": "s tablet after a lot of research. And indeed my research has paid off. I now have one of the best tablets in the market..I am happy with the display, processor speed, interface.. All in all a tablet that i really wanted. I think 8 inch is an ideal size for a tablet..7 inch tends to be small. 10 inch feels bulky.Only thing I would like to improve in this tablet is its sound quality. But its not a show stopper. You can still enjoy music, movies with a good quality headfones..", "Title": "Super fast speed and great battery", "Date": "September 7, 2013"}, {"Author": "Jeff Martens", "ReviewID": "R1WVJIFVJCU9NK", "Overall": "1.0", "Content": "First, the touch screen sensitivity is far too low to use a stylus. A number of people at the Acer community site have complained of the low sensitivity. Apparently an update a few months ago fixed it for some users, and not others. Mine is at the newer version, so I doubt there will be a patch. When dragging items with my finger or long-tapping, very, very often the device thinks I have let my finger up, and drops something in the wrong place or opens a document I was trying to select.Also, the screen doesn't brighten and dim automatically based on ambient light like the Nexus, but this might be a setup option I can't find. However, even at it's brightest setting it's a bit dim for a brightly lit room, and nearly unusable outdoors.The sound from the speaker is very poor. Not enough volume for listening to podcasts if there is any ambient noise.With the Nexus I downloaded from an OpenSSH server on my wireless LAN at 20Mb/s; this can never manage over 16Mb/s. So it's not just limited range, but overall Wi-Fi performance is weak.Twice in the last week I've had a fairly decent charge (30% or better), had the screen and Wi-Fi turned off, and then heard it clicking and picked it up with it warning the battery is low and asking me to type my password to decrypt storage. (1) Why did it forget the encryption key? (2) Why is the battery so nearly dead?My advice: spend just a little more and get something you won't hate.", "Title": "Unusable with Stylus; Wi-Fi & Sound Feeble, Battery Life Poor", "Date": "October 30, 2013"}, {"Author": "donald dalton", "ReviewID": "R23D0SJ8DIQ0YH", "Overall": "5.0", "Content": "This tablet is super fast,the right size and at this price it is one of the best deals out there.", "Title": "Great tablet", "Date": "December 6, 2013"}, {"Author": "Denise K.", "ReviewID": "R2U9TOPLKPCM7V", "Overall": "5.0", "Content": "Love, love, love my tablet! It does everything I wanted it for and so much more. I don't lose my lists anymore because everything is stored on my tablet. I've not used any others so I can't compare, but this tablet is awesome!", "Title": "Love it!", "Date": "November 30, 2013"}, {"Author": "Tracy Vialpando", "ReviewID": "R376GKBOP1GFFT", "Overall": "5.0", "Content": "I just received my Acer Iconia a couple of days ago and am still working through various apps. After a few weeks of research I found that this economical yet outstanding performing tablet is perfect for me. I love the resolution and clarity, the speed of the processor and the ease of navigation. I have a iphone and thought moving to an android platform would be hard to navigate and I couldn't have been more wrong. If you are looking for an 8\" tablet with HDMI and WiFi this is your tablet. Set-up took literally 2-3 minutes so I was quite impressed.", "Title": "Fabulous cost, great product.", "Date": "November 15, 2013"}, {"Author": "Simon Templar III", "ReviewID": "R123K3H1CKNDU", "Overall": "5.0", "Content": "Was skeptical at first but with super fast internet browsing, excellent camera, plenty of apps, and the ability to connect to my tv and use a wireless keyboard I don't even touch my laptop.  Plus, Android is much much better than Windows 8 which explains why everyone is abandoning Windows and switching to Android.  Super good product and will be buying several for my family.", "Title": "True laptop replacement", "Date": "November 1, 2013"}, {"Author": "carlos españa", "ReviewID": "RUH2LK7JMMD6N", "Overall": "4.0", "Content": "I liked the acer cloud you can save your music or documents in this site and you can sincronize you computer, phone or tablet and use whereever you are.", "Title": "It's fast", "Date": "October 18, 2013"}, {"Author": "Shamikah", "ReviewID": "R3TTCKZMFOI7GL", "Overall": "5.0", "Content": "I wanted a tablet with look of the ipad mini.  And I was happy to see that acer had such  a tablet. I'm very pleased and extremely happy with the overall function Of this tablet.  The only thing that could be better is the speaker it needs an up grade otherwise Its amazing.", "Title": "amazing", "Date": "October 5, 2013"}, {"Author": "PATRICIA S KENNARD", "ReviewID": "R3EQSOMBYS4THF", "Overall": "5.0", "Content": "I love this tablet. It is easy to use and I think it's wonderful. I love the camera, the storage capacity is great.", "Title": "Love it", "Date": "September 30, 2013"}, {"Author": "Carol M. Conrad", "ReviewID": "R3H1KXOY6CMRJX", "Overall": "5.0", "Content": "I love this tablet.  It is the perfect size - not too small and not too big.  It is easy to use and set up.  I use it mainly for reading and a few games.", "Title": "Great tablet.", "Date": "September 12, 2013"}, {"Author": "Robert Linville", "ReviewID": "R3TRRQIUEM70L5", "Overall": "5.0", "Content": "This is a great tablet. It will not wow you and blow your soxs off but it works smoothly and easily for the price. You cannot beat this.", "Title": "Great", "Date": "August 21, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2OQ03E3JX2E59", "Overall": "4.0", "Content": "I recently received this tablet and love it except for one thing. The touch screen is too sensitive. It duplicates letters, spaces, etc. when typing. Hope Acer fixes it in a future system update.", "Title": "Great Tablet", "Date": "July 18, 2013"}, {"Author": "Robert K.", "ReviewID": "R1CA7KWF542CHR", "Overall": "1.0", "Content": "If you can figure out how to receive customer support from Acer, you're a better man than me. Yes, you can find 800 numbers out there, but can you talk to a live body, NO. I tried for two hours to get a couple of questions answered, to no avail. I'm basically unable to use this product due to lack of customer support. If you are thinking of buying this, BEWARE, you are on your own without customer support from Acer.Note - Am email address I found (for tech support) also came back with a \"no such user here.\" Acer should be ashamed.", "Title": "No Customer Support", "Date": "November 6, 2013"}, {"Author": "Lois Dufner", "ReviewID": "R3F3OV0JSXQGUI", "Overall": "5.0", "Content": "Love it!!!  I tried the Nook Plus 9 and Kindle Fire and sent them both back...This Acer Iconia is just what I need.....the touch has quick response and I love reading books frommy library....price was terrific!!! Did I forget to mention that I received it within 3 days ofordering it?  How great is that?????", "Title": "Love it!!!", "Date": "April 9, 2014"}, {"Author": "ND22", "ReviewID": "R3MZWD0QWSS0NY", "Overall": "5.0", "Content": "Great battery life. Love that my husband and I can have separate profiles. We wanted a low cost and android tablet. Weren't in the market for any Macintosh stuff. We wanted cheap and easy-- and it is! Plenty fast and plenty great for us.", "Title": "We really like it", "Date": "April 8, 2014"}, {"Author": "T.C. Doust", "ReviewID": "R3LUOFXL2Z4Q5E", "Overall": "5.0", "Content": "Nice tablet. It's an Acer and lives up to the reputation. Good camera, plenty of memory and looks good in the hand.", "Title": "Hard to go wrong", "Date": "March 19, 2014"}, {"Author": "sally", "ReviewID": "R3N7YEX26NWUDJ", "Overall": "5.0", "Content": "I just received my Acer iconia a1 and totally loved it, perfect size' nice performance, amazon 's excellent service as usual. I,m happy!!!!!!", "Title": "Love it", "Date": "February 17, 2014"}, {"Author": "Oscar", "ReviewID": "R1KOWOPZ7AB7M2", "Overall": "5.0", "Content": "I bought it mostly for reading and occasional gaming. The price is just ridiculous for such a great tablet, I use to have a Toshiba Thrive 10.1 inches but it was too bulky and the size of the screen is to big to hold if you want to do certain stuff, it was difficult to carry.PROS:- Excellent battery life- Outstanding performance, it runs pretty much any game on Google Play Store, I tried games like Dead Trigger 2, Asphalt 8 among other games with the latest graphics for Android and had not issues at all.- Latest Jelly Bean version- Screen size is very convenient for reading- It has expandable memory up to 64 gigs, it has mini HDMI tested with my TV.- It feels nice when you hold it, it is not as heavy as many people say, at least not to me. It looks expensive and materials are good quality, screen seems to be against scratches.CONS:- Poor speaker volume, it is mono by the way, not sure why they did not make it stereo.- Screen brightness could be improved, it does have good brightness, but at the time you adjust it to the lowest the screen is still to bright, the other tablets could adjust brightness better, I lower it all the way to read books in the night.Overall, I give it 5 start for its price and performance. You will not regret.", "Title": "Great Tablet", "Date": "February 5, 2014"}, {"Author": "The Tall Man", "ReviewID": "R13MTJXHRBNQKW", "Overall": "5.0", "Content": "Where do I start. Well before the system update there was I strange transperacy on the side of the screen but after the update its fine. The performance of the this tablet is quite good its pretty fast. The screen is decent . Sure its not iPad mini clarity but its also not 299.00. Love the aspect ratio just like the iPad mini same size screen. The weight is fine contrary to what Manny have said. Its also a nice looking tablet. The touch screen is quit good for the price. Also like the fact that it has GPS and an HDMI out for movies.The WiFi works well and is pretty fast. The battery life is also pretty good. I also like the 5 finger wake feature. Also it has a quad quare CPU and a nice GPU the power vx sgx540 which is also very good for games. Latest update is 4.2.2 not bad. The speaker isn't a boom box but adiquite. It  also has a front and rear camera for Skype etc. For the 149.00 with all the features it has a quad core CPU and decent GPU it destroyes the iPad mini is better than the tiny 7 inch nexus 7 and is a better value than the Samsung galaxy 3  plus it has an HDMI and a micro sd expansion slot which the nexus and iPad mini don't have. If your looking for a nice 8 inch tablet that's reasonably priced look no further . Thumbs up Acer!", "Title": "awsome tablet for the money best deal on a tablet that has everything!", "Date": "January 31, 2014"}, {"Author": "malinda", "ReviewID": "RGVGBZYFSX6DK", "Overall": "5.0", "Content": "This is my second Acer tablet.  I broke the first one when I smashed it in the car door but I knew I would not buy anything else but this one as a replacement.  For the price it does everything I need it to do.  Easy to use and understand if you are a first time tablet user (which I was).  Screen is very very clear.  Love that it has the front and rear camera which takes crisp clear pictures.  It is very lightweight and fits in a purse well.  I love that it also has an expandable card slot to upgrade from 16 to 32 GB.  I can't imagine how anyone could be disappointed with this tablet.", "Title": "Great Tablet", "Date": "January 31, 2014"}, {"Author": "Ariel Nosrati", "ReviewID": "RKFQB6TLQNR2W", "Overall": "5.0", "Content": "The GPS works AMAZING!!!!! It tells you the mph and more! I will never be lost again, The tablet's camera is pretty good. Just buy it from the seller that amazon provides!!!!!!!!", "Title": "Nice Tablet", "Date": "January 23, 2014"}, {"Author": "PA", "ReviewID": "R2PF4HKVBLF23C", "Overall": "5.0", "Content": "This is my first tablet. The Acer is the right size, not too big and not too small. So far I have not found any negatives, except one.  Like other reviewers the speaker system is not great. For me that is no big deal I do not plan on using the tablet for gaming or movies. I do a lot of internet surfing and reading. This is amazing for Kindle books. One main reason I bought this is also for the USB port. This makes it that much easier to transfer pictures. I find that I rarely use my laptop. Overall, I am satisfied with this tablet.", "Title": "Great Deal. Perfect Size.", "Date": "January 5, 2014"}, {"Author": "Lori A. Berentsen \"Lori A. Berentsen\"", "ReviewID": "R3V6XQXBXDSKLC", "Overall": "5.0", "Content": "This is one of the best android  sed tablets that I have ever used!!  I love everything about it.  It is perfectly sized, the processor is lightning fast, HDMI and GPS without the need for an internet connection.  I also purchased the official case from Acer for $14.99.It is perfect to use and I have not found any problems running any apps within google play.  There is no bloatware on this tablet and it is fully customizable in terms of apps and widgets.  It is also very easy to hold for long periods of time, the weight of it feels perfect and the backing is comfortable.  So far the battery life has been great as well while multitasking for hours without a charge....If you purchase this tablet, you will not be disappointed..", "Title": "This is an awesome android tablet!!", "Date": "August 4, 2013"}, {"Author": "FulltimeDad2Twins \"Mom2twins\"", "ReviewID": "R16GEEPOMWQAJS", "Overall": "1.0", "Content": "I loved this tablet, until the touch screen was broken just months after purchasing it, now it's completely worthless. This was a great little tablet, with fast and trouble free operation. The screen size is noticeably better than the typical 7 inch, and the picture is beautiful. I had no complaints and would even have purchased more, if I didn't know a cracked digitizer would cost more to fix than purchasing an entirely new tablet. The digitizer is the touch screen that sits in front of the LCD screen. They typically cost just a small fraction of what en entire LCD screen would, because it's just the touch sensitive glass in front of the actual display. So I tried to set up a repair, thinking it couldn't cost as much as a brand new tablet, WRONG!!!!I set up a work order, and here's what they sent back to my email:Dear Mr...We have received your request for repair, but unfortunately we’re unable to complete your request because physical damage is not covered under the standard manufacturer’s warranty. Our standard repair charge for this repair is $249.00 plus local taxes. Please contact technical support by telephone at 1-800-816-2237 for assistance in setting up an out of warranty repair.Note: this email address is not monitored; therefore an Acer Service agent will not be able to respond to your email request. In the event you need support assistance for your Acer product, please contact Support at one of our Web sites below or call the Support number in your documentation.[...] for Acer productsThank you,Acer Service Corp.Now if I was stupid, I would have it repaired, although it seems this is what they are banking on when you consider buying one of their products. I'm considering replacing the digitizer my self, but they cost around $80 to replace, and it voids the original warranty. So now I have a device that is less than 3 months old, with a cracked screen, and no warranty. So you can purchase one, knowing that they don't have their customers in there best interest, and if you don't have any problems with it, you might not be as angry as I am with ACER.", "Title": "ACER does not deserve your business.", "Date": "November 25, 2013"}, {"Author": "Reader89800", "ReviewID": "R1L1RRWH95EJ4C", "Overall": "5.0", "Content": "I just love this tablet. I feel like it is a quality tablet. It feels solid, not like other Android tablets. It reminds me of the iPad. Nice big, bright screen and it's zippy. I am very pleased with the experience, and Amazon's free shipping made it even better.", "Title": "Awesome tablet.", "Date": "November 20, 2013"}, {"Author": "Amazon Customer \"cherriej63\"", "ReviewID": "R2SWCNSG86EHB6", "Overall": "3.0", "Content": "Good price and you get lots of features, it's also very fast and good battery life.  However, the screen seems to have a matte finish so the display isn't super sharp and the sound, while wearing earbuds, is just ok.  It also seems really heavy and thick, the cases don't help (I tried two different ones).  The spec say it only weighs 1 lb., which doesn't seem like a lot, but it is uncomfortable to hold for a long period of time.  This seems to be the case with Acer tablets - I did some research and they're all heavier than other tablets on the market.", "Title": "Too heavy!!", "Date": "November 11, 2013"}, {"Author": "kevin nguyen", "ReviewID": "R1VAKHKSYRF0T9", "Overall": "5.0", "Content": "Good tablet with cheap price. Responsive. Good resolution. Reasonable price for usb, hdmi, expandable SD card, dual camera tablet. Love it.", "Title": "good tablet", "Date": "October 19, 2013"}, {"Author": "Eric R. Townsend", "ReviewID": "RSKOFU89M21PK", "Overall": "3.0", "Content": "Mine stopped working after applying an official update and i returned but while i had it, i liked it.  it was perfect for me because i wanted the same form-factor as the ipad mini but with the flexibility of android.  it is thick compared to all the rest and feel kind-a cheap (plastic white back) but it's quick and responsive.  It has good specs, the built-in gps works pretty good; it usually say about 7-8 sats and got a fix from 5-6, enough to navigate.  Darn thing is quad-core too.However, having felt it and played with it, i don't think it's worth that kind of money.  I'll look for another one cheaper.", "Title": "Very good!  While i had it.", "Date": "October 12, 2013"}, {"Author": "Smrfcop", "ReviewID": "RJW0OVMOL2YVV", "Overall": "5.0", "Content": "Good price for a perfectly packaged tablet. Price is competitive with HSN.com so shop around but this is a fast processing tablet with loads of good features and am especially happy with the responsiveness of the keyboard that I don't need to use the external Bluetooth keyboard I bought.", "Title": "Great buy", "Date": "May 22, 2014"}, {"Author": "Alejandro", "ReviewID": "R1JUC6OOCDDL82", "Overall": "4.0", "Content": "It was a gift for my niece eleven. She loved it. But asked by the camera flash. None. But has dual camera!", "Title": "Nice design.", "Date": "May 19, 2014"}, {"Author": "Ana Beatriz", "ReviewID": "R3SAQE6MNWOREY", "Overall": "5.0", "Content": "I haven't  tested it completely yet. But for now all the things work. I find it elegant and beautiful. I will be writing more when I have the oportunity to test everything.", "Title": "It's awesome", "Date": "May 18, 2014"}, {"Author": "Ahmed", "ReviewID": "R32OFXOQ6AXK5H", "Overall": "5.0", "Content": "I am one of Acer fans, but to be honest its nice device the screen is wide help more in reading and not big, fast, easy to use, bright screen which give you relaxing and happy with pictureFor the price its sorted and give you what you needI recommended", "Title": "great", "Date": "May 13, 2014"}, {"Author": "Joseph M.", "ReviewID": "R1A78VI5FSW2AP", "Overall": "3.0", "Content": "I bought this tablet for my daughter. I noticed after downloading movies and apps that although there is a SD card slot, there is no ability to move apps to the SD card.  I have had other android devices where the option was right in the App Manager setting, but it isn't present on this tablet.  I also tried to use 3rd party apps to try to move apps over to the SD card, but those also can not do it.  This defeats the reason why i bought a tablet with an SD slot. I found that some apps, like some of the TV apps (like CBS) will not work on this tablet.For the most part this tablet is fine, but mostly as a kid's toy.", "Title": "OK Tablet, But Missing Some Things", "Date": "May 2, 2014"}, {"Author": "Phyllis", "ReviewID": "RJI359KHWLOC5", "Overall": "5.0", "Content": "I am enjoying but should have gotten a bigger screen my fault.  Plus I didn't realize I also needed a Microsoft compatible tablet but overall I am definitely satisfied.", "Title": "enjoying it.", "Date": "April 23, 2014"}, {"Author": "Bonnie Mazis", "ReviewID": "R35JHWY0WIVPM8", "Overall": "5.0", "Content": "I received one as a gift and I love it ! Don't know what I ever did with it..My daughter when she came home from college borrowed it again and again. She loved it so much I got her one . I can go online and shop, do my banking, watch Netflix, take pictures and easily upload to Facebook, and play games..also has a kindle and can get free books from my library !It's very fast with the quad core processors and I can expand the memory when needed. Did buy a screen protector, and love my fintie case for both tablets. Only 1 drawback is the user manual you have to download .but haven't had use for it yet, andI'm new to tablets.", "Title": "love this tablet", "Date": "April 18, 2014"}, {"Author": "BobbieS", "ReviewID": "R3KM3R8CUJC44F", "Overall": "4.0", "Content": "The tablet is great. I Love it. Only thing is there is a very small white spot on display. Hopefully it will stay small. Secondipity gave me The option of refunding or they would refund some of The payment. I recommend The company & product.", "Title": "Great tablet", "Date": "March 31, 2014"}, {"Author": "Victor", "ReviewID": "R27NWY9VKYNRX4", "Overall": "5.0", "Content": "This tablet is verry fast and compering price va others this is the best, better than a sus memo par AMD galaxy tab", "Title": "Best tablet", "Date": "March 27, 2014"}, {"Author": "Gregory A. Smith \"Blkdiamnnj\"", "ReviewID": "R21E7JDC1W21WX", "Overall": "5.0", "Content": "This was a home run!  Was a Christmas Gift for my mother who enjoys playing games on the pc, and this let her play/surf while in bed or traveling.  So far no issues...good size screen too!", "Title": "Christmas Gift", "Date": "March 24, 2014"}, {"Author": "fob911", "ReviewID": "R13E06GCZSOQXH", "Overall": "5.0", "Content": "As a first generation American in my family along with my two brothers (no, we're not chinese! lol) my mom struggles with both learning English (though she has come a long way and is pretty good for an immigrant), it's hard for my mother to try to keep up with technology, especially when her home country Pakistan is so behind on it even today (they JUST got iPhones). Because I love technology and computer hardware so much, I decided that this tablet is the best bang for your buck tablet you could possibly get. My mother bought this for $179.00 online and it has made her life so much easier. The processor is blazing-fast, Android runs smooth as butter, the 1gb ram surprisingly does not slow down the tablet at all. After showing her how to use chrome, youtube, and google maps, my mother can now do so many things she couldn't do before. She watches all her shows on it, and also plugs it into the tv with the mini-hdmi output, looks up directions to places, checks her email, and can google various things to her liking now.Pros:Quad-Core Processor (oh yeah!)Android 4.1-4.2 Jelly Bean (for the gameboy emulators)Mini-HDMI OutputMicro-SD Card SupportCons:Both cameras are, in my opinion, terrible. If you're buying this for the cameras, you're not buying it for the right reasonMini-HDMi isn't as crystal clear as you'd think and seems a bit washed out.The instruction manual said it would have an optional SIM card slot that has, to my recollection, not have been released yet (a model of this with a sim card slot). If it had that this would be poppin!My mother struggled for years with learning technology. She could never get the hang of computers, even though I tried to teach her for years. She had an old iphone a few years back and got used to that, but then she gave it to my brother so she may have forgotten how to use it over the years. With advancing technology, now she doesn't have to. She uses it everyday and it keeps her entertained. It's helping her use her blackberry now too, just today she pulled out her phone and took a picture and I was shocked because I never taught her how to do that, I only installed a flashlight app on her phone. She's now also excited to get the new iPhone, which makes me excited to know that my mother will not one day reject technology when she's old like many old people do. And I know this isn't the best one out there, but for the price vs content/functionality, this is by far the best \"bang for your buck\" tablet-PC on the market at this time, and I would definitely recommend it (expect for people who truly want to use the camera)", "Title": "Great for my mom", "Date": "March 22, 2014"}, {"Author": "Anonymous", "ReviewID": "R2HFVII1LSPLP2", "Overall": "4.0", "Content": "I have to say that I was surprise at the Acer Iconia A1-810 tablet. I wanted to wait before providing a review, it will be a year in July2013.  I think the Acer Iconia is a good alternative to the iPad Mini.  Certainly does not have the speed of the iPad Mini nor the bells and whistles. However, it offers expanded memory whereas the iPad Mini does not.  To add additional memory for the iPad is at a cost of about 100.00 per GB.The Acer, does not have the great battery life as the iPad Mini, it does offer a similar screen size.There are also apps available for the Android tablet that is not or at a charge for the iPad Mini.  But there are not a lot of accessories available, to date, for the Acer Iconia A1-810 tablet.I’m able to watch movies from my personal collection from the micro sd card or from the Netflix’s app.If you don’t want to pay the extra cost for a tablet, consider the Acer Iconia A1-810!", "Title": "Good sub for iPad Mini", "Date": "March 22, 2014"}, {"Author": "Coleen Denson", "ReviewID": "R3ONF9BR7R1RLE", "Overall": "5.0", "Content": "I LOVE< LOVE the Acer Tablet. Does much more than expected. I would defiantly recommend this to all my friends", "Title": "Tablet", "Date": "March 20, 2014"}, {"Author": "Senior User", "ReviewID": "RYTXDJ61JZAYG", "Overall": "5.0", "Content": "Very nice size.  Recharges quickly, my only gripe would be that it is hard to navigate files when used to Windows.  Excellent value for the money.", "Title": "Very nice unit.", "Date": "March 19, 2014"}, {"Author": "La Torshia James", "ReviewID": "R1SJ5JZOP2NTM3", "Overall": "5.0", "Content": "Luv this tab, the price was awesome,.first saw this on one of the shopping networks, and price was 3× higher @ Christmas, even though it said refurbished It looked brand new no scratches, nicks  glad I waited,. thanks Amazon", "Title": "Happy camper", "Date": "February 3, 2014"}, {"Author": "Mary Panzino", "ReviewID": "RCY9GV5YFRJJH", "Overall": "4.0", "Content": "This tablet has a high definition picture and is light weight. Unlike other tablets which have more weight to them and are uncomfortable to hold.", "Title": "comfortable", "Date": "January 31, 2014"}, {"Author": "pam", "ReviewID": "R3UXK90LC5O11D", "Overall": "5.0", "Content": "It is a good tablet for the price loved the size easy to take in my purse. I sent it back beca.use I bough a samsung galaxy note 8 inch to pair with my new galaxy cell phone.", "Title": "Good tablet", "Date": "January 30, 2014"}, {"Author": "jaclyn", "ReviewID": "R38PVT6IYRQHAC", "Overall": "5.0", "Content": "i ordered this tablet a year ago. being budget conscious i tried to buy the best for my money. i originally bought the acer b that is 7 inches and i HATED IT. so i returned it and found this on amazon. this tablet is amazing. i have never had a problem with it and i dont think i would ever get a different one. the size is perfect! it is hard to find a 7.9 inch tablet other than the ipad mini, which during my research this tablet is actually better than the ipad mini in many areas.  my favorite feature is the dual cameras and the quad core processor, this tablet is super fast and efficient!i am so in love with this tablet i actually just bought another one for my boyfriend as a birthday present! and i know that i got him an incredible tablet and it didnt break the bank!", "Title": "BEST TABLET FOR THE PRICE!! love it!", "Date": "January 29, 2014"}, {"Author": "Thomas", "ReviewID": "RCWEYU9MZ0ZTZ", "Overall": "3.0", "Content": "This tablet is good, but not awesome. I love the size of it! But it keeps crashing 2/4 times a day. It's pretty smooth to run other than that. Smooth, pretty fast, newest version of Android. I bought it on sale, so it was worth the price. Not sure I would pay full price for what I have. I may have a bad apple, I don't know.  If you want a bigger, but not huge, tablet with new Android, and pretty fast, for a good price, this may be the one your looking for.", "Title": "Good but could be better.", "Date": "January 26, 2014"}, {"Author": "Jayde", "ReviewID": "R2C5MGSQGD36XA", "Overall": "5.0", "Content": "I got this tablet for email, games, music and reading. It's great for all of that. It's quick and the screen is clear and bright. There is no reason to spend a lot of money on a tablet. This is a great buy.", "Title": "Great little tablet...", "Date": "January 22, 2014"}, {"Author": "Raul Vazquez", "ReviewID": "R1NABBM2YOF1WE", "Overall": "5.0", "Content": "This was my moms Christmas present! She isn't that much of a tech person lol but she knows how to use the tablet and she loves it. It's simple, wasn't to expensive, and plus it's an awesome tablet. Works very well! If you want a tablet and don't want to dish out all the money for an iPad than this is your best bet!", "Title": "Great tablet at a great price!", "Date": "January 22, 2014"}, {"Author": "Jean Pierre", "ReviewID": "R8QZHYXIHQFEK", "Overall": "4.0", "Content": "I need a cheap tablet to communicate with my mom and this one was perfect has a good performance and great skype communication if you are looking for a cheap table to navigate and chat. I highlight recommend it .my mom loves it and now I can skype with her really fast , easy and handy :)", "Title": "usefull for its price", "Date": "January 20, 2014"}, {"Author": "Commentator", "ReviewID": "R2LC16UMRK39SW", "Overall": "5.0", "Content": "Got it for hubs for Chrîßtmas.  Wish I had gotten one for myself, instead of a Next book, but I will when the Next book wears out. Already the gyro has gone out on the Next book...The Iconia is a good quality tablet purchased after a lot of research.", "Title": "Excellent", "Date": "January 19, 2014"}, {"Author": "Ryan macainan", "ReviewID": "R324PGURL5PRC3", "Overall": "5.0", "Content": "Although the tablet is alittle bit thick than the other tablets in the market but the performance is very good. Did not have problem in with the delivery, no extra charges when i received it. I reccomend the item as well as the seller.", "Title": "Very good tablet.", "Date": "January 19, 2014"}, {"Author": "Mario", "ReviewID": "R3VZSGS7SHNTZV", "Overall": "5.0", "Content": "I waited a few months while I used this before I wrote a review. I have to say this is a very good tablet. I have not had a single problem with it and there really is nothing to complain about. It does everything I wanted and needed it to do. I have played around with plenty of different tablets and used them often. I have used the Kindle Fire HD, Galaxy Tab 3, the IPad and really this tablet is just perfect. It has pretty much everything you'd want and it has an microSD slot for expansion. I am very glad I bought this.", "Title": "Just great", "Date": "January 17, 2014"}, {"Author": "Kristen Nims", "ReviewID": "RV2OYKYFTJ3DA", "Overall": "5.0", "Content": "Had this tablet about 5 days, so still discovering about it. But so far, better than I expected. Love the fact you can set up different users. 16Gb is plently big. I will update once I learn more about it.", "Title": "Love it", "Date": "January 14, 2014"}, {"Author": "Marsha Pata", "ReviewID": "R1LJDFJ8RL0L00", "Overall": "5.0", "Content": "I love this tablet. Easy to operate right out of the box. Battery lasts a long time. Use for games, reading and the internet.", "Title": "Awesome!", "Date": "January 11, 2014"}, {"Author": "darryl sharpe", "ReviewID": "R3TD16VHO52384", "Overall": "5.0", "Content": "Does everything that a more expensive tablet does at great price. This is the one for you if you don't have alot of money to spend or just don't see the need to fork out more money for an Ipad or Samsung", "Title": "Love it", "Date": "January 11, 2014"}, {"Author": "NDN1", "ReviewID": "R3NTYBI8J5FU9W", "Overall": "4.0", "Content": "All of my electronics are made my Acer.  I have purchased Acer products since '94, so it was a clear choice on the tablet.  It is fast and runs the latest Jelly Bean 4.2.  I love the size and color of the tablet, but my only complaint would be the weight.  It is a bit on the heavy side but still not enough to bash the product.  I would highly recommend it for any person looking for a reasonably priced tablet.", "Title": "Love Acer Products", "Date": "January 10, 2014"}, {"Author": "Tysha Johnston", "ReviewID": "R27Y7HKOD6XKL0", "Overall": "5.0", "Content": "The tablet is awesome!! Runs all my apps  with no issues. Happy I went with a brand I know rather than a slightly cheaper unknown brand. The only complaint I have is that it dose not run Flash Player and the whole reason I got the tablet was to do my school work. Many of the sites for school require Flash Player and so I was extremely upset about that. Cameras are OK no auto focus. Love the size 7.9 Overall happy!!!!", "Title": "love it!", "Date": "January 9, 2014"}, {"Author": "Amazon Customer \"rumbledolly\"", "ReviewID": "R30LKOWPVMTPWS", "Overall": "5.0", "Content": "So far I've been using this since Christmas.  I am very impressed with the speed and how easy it was to integrate with my Google Accounts.  I use for both work and play and so far I have no had any issues with downloading, looking at documents (through Google Drive and/or Kindle).  Very easy to personalize.  You can add a microSD card for more storage space though without you'll still have plenty of room. The camera is so-so at 5 mps but it's much better than the iPad/iPad Mini quality I've seen and who really takes photos with their tablet?  In a pinch it works great.  Easy to add my Kindle books to it plus you have the option of using Google Play books.  Typing is easy though for heavy duty work I'd suggest a keypad.  I only wish, just like my Android phone, I could remove some of the programs I'm not going to use.  I don't need Google Play Music, Amazon MP3, 7Digitial and Zinio for instance.  I use G Play Music and Amazon and really could survive with just one of them if I had too.The weight of this tablet is slightly more than the iPad mini.  The price difference is over $200+ dollars.  I think I'd rather carry around something slightly heavier than pay the extra money.  The screen is clear with rich colors though I have found I really need to turn down the brightness though I've since purchased a screen protector that seems to have helped that.  Sound is meh...it's a tablet...with headphones or a portable speaker the sound is perfect.  Streaming tv/movies is easy with no lag time.Battery life is amazing.  I've gone 8 hours + on a single charge.  Streaming does cut that down but I still only charge at night (and have skipped a day when I've only read email and surfed the web and read a book on the Kindle app).All and all it is an excellent tablet for an excellent price.  I will update as I use it more.  If you have a gmail address the set up is as simple as logging in.", "Title": "Nice Tablet, Good Speed, Good Sized", "Date": "January 8, 2014"}, {"Author": "kenny", "ReviewID": "R12QSWLB7LFMXN", "Overall": "5.0", "Content": "works great. i haven't had any problems with it. does every thing it says. would definitely recommend for anyone. this is the second acer tablet i have bought. and would buy again.", "Title": "works great", "Date": "January 7, 2014"}, {"Author": "sue", "ReviewID": "RUCXTRS7L2EVP", "Overall": "5.0", "Content": "Bought this for xmas for my daughter, she absolutely loves it! I think it a good tablet for the price keep in mind my daughter is 8 so most her time is spent playing games, reading books, or watching videos on youtube. The tablet runs fast and efficiently.", "Title": "Happy!", "Date": "January 7, 2014"}, {"Author": "sally g.", "ReviewID": "R1ASY69LYB9808", "Overall": "4.0", "Content": "As a 70+ woman and not a techie I was happy to find using my Christmas present was easier than expected.  I did have some training on my son's $500 IPad so that helped.  I was surprised to find that my much less expensive Acer tablet was just as much fun and maybe even a bit easier to use.  I don't feel deprived by not having the I Pad instead.  When I learn how to use everything on it I'll probably give it 5 stars.", "Title": "Easy to use", "Date": "January 7, 2014"}, {"Author": "brenllin", "ReviewID": "R2923C05PW65OP", "Overall": "5.0", "Content": "This is my first tablet. I did quite a bit of research! I determined that for me the 7.9 inch size is just right. I have been surfing and reading on a smart phone every day and finally decided to save my eyes and get a tablet. Glad I did that. I read all reviews posted on Amazon for the Acer Iconia and also found out that Consumer Reports recommends this tablet ...not as highly as the IPad or Samsung tablet but it is in the top ten. Also, the Acer costs less and fits my budget . I discovered that your tablet's  processor is very important and Acer has a very powerful processor. I'd like to address some of the other reviewer's complaints. To me the screen is bright and clear. The speakers are loud enough for me but, if I need them, I can use earphones or buds. I did not expect powerful speakers and these work for me. I have had no problems with the touch screen. It is equal to my Samsung Galaxy S III smartphone in sensitivity. The only complaint I have is that the Facebook App does not show pictures and I must sign in through the browser to see FB. I like Android and the tablet came fully charged. I keep it charged .The battery has not run out yet. WiFi is impeccable. I am very pleased with this tablet. It is so great to be able to read all the reviews on Amazon and come to an informed decision.", "Title": "Acer Aces it!", "Date": "December 6, 2013"}, {"Author": "InTheseShoes", "ReviewID": "RABPMDRIMU8F9", "Overall": "5.0", "Content": "Really nice size for me. I see a lot of reviews saying that 7 inch is the best size, because you can use it with one hand and put it in your pocket. Well, I am a petite female, and I can't use any tablet with one hand or fit any tablet in my pocket. As long as I will be using two hands and carrying this in my purse, I care about readability and available apps, and I don't want to spend a bunch of time figuring out how to set the thing up . What can I say? The display is very easy to read, the interface is intuitive, and it has played very nice with the Google Play store.The only thing I am sad about is the price has dropped $9 since I bought it a few days ago. I am going to see if my credit card company offers some sort of price guarantee protection. Some of them do.I am not having any problems with the touchscreen or video/sound quality as some had mentioned. I would not normally listen to this without headphones. It would be rude to do so in public anyway, and it has a standard headphone connection and sounds just fine through headphones.I could probably find a tablet that was faster, but it's plenty fast enough for me. I could also find one with a longer battery life but this hasn't run out on me when I needed it. And I could probably find one with better cameras but I already have an iPhone and just use that. I would rather save a few dollars than spend money on higher speeds and stuff that I would never really appreciate or notice.", "Title": "Great value for the price!", "Date": "December 2, 2013"}, {"Author": "Sophany Touch", "ReviewID": "R3RMMRZUQYRG57", "Overall": "4.0", "Content": "I have just received it to day. I am so interested with this tablet every thing is fine, but except camera is not so good.I love this tablet.", "Title": "Good tablet for me!", "Date": "October 31, 2013"}, {"Author": "jason", "ReviewID": "R1SMMBGAAKMWGR", "Overall": "4.0", "Content": "Tablet was a great purchase for the money. Perfect gift for my wife. Picture quality is pretty good. Sound quality is pretty good.", "Title": "Great tablet for money.", "Date": "October 24, 2013"}, {"Author": "FEde", "ReviewID": "RWXDUX3R9GKIH", "Overall": "4.0", "Content": "I bought two for my kids and both of them are very happy with them. Since I have had Samsung mobile phones needed some time to adjust to the dispay Acer makes to the android System.The only dificulties I could mention is that the screen in both of them is not as responsive as some other devices I have tested (turned off all recognition like the 5 finger and improoved bt still not the best) and also the front camera also is not as good.Otherwise it is an excelent device and for that price it is excelent.", "Title": "Good Tablets", "Date": "October 20, 2013"}, {"Author": "M. D. Williams \"EVO Rocks\"", "ReviewID": "R17RMO6QXEV9IF", "Overall": "4.0", "Content": "Arrived as promised. No defects. Exactly as was advertised. But keeps shutting down and restarting on its own. Need to investigate further.", "Title": "Cute Tablet.", "Date": "October 12, 2013"}, {"Author": "Dira", "ReviewID": "R2HBH809MHATWS", "Overall": "4.0", "Content": "Purchased for my granddaughter's birthday... she loves it and is using it for school.  As far as I know, she is happy with it.", "Title": "Good", "Date": "August 2, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RV9QOYRSC4HPF", "Overall": "4.0", "Content": "The Acer Iconia A1-810 is a very nice tablet:  4x3 Ipad Mini form factor, micro USB,  HDMI, micro SD, sufficiently fast for browsing, email, word processing, etc.  All that at a  reasonable price!After over a month of use, I experienced some frustration:1. Touch screen keyboard is lagging and inaccurate, causing mistypings.2.  Touch screen to select text in a browser or Kindle apps is unresponsive. In fact, it is almost impossible to select text (to copy or to find in a dictionary). This, to me, is a SERIOUS FLAW that makes using the tablet not as pleasant as could be.If anyone experiences similar problems, please mention them in your review soo thaat Acer may take note and correct them", "Title": "Excellent tablet with serious flaw: unresponsive touch screen to select text.", "Date": "August 20, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R26A2SYTTE7C3", "Overall": "5.0", "Content": "I've been waiting for the Acer Iconia A1 from when it was first announced. I just received the tablet about 20 minutes ago. So far So good,  I was a bit concerned that it may not have had GPS (not specified on the Amazon site or on Acer.com). No worries, it does indeed have GPS.I am loading my apps now and will update this review when I have had more time with the tablet.At this point I am giving the Acer Iconia A1 2 Thumbs Up.", "Title": "Nice Tablet", "Date": "July 5, 2013"}, {"Author": "Steven F.", "ReviewID": "R1L8S0IUNTSZ9Y", "Overall": "1.0", "Content": "Personally this tablet when it worked was a very good product, if I had been handled by the warrenty department correctly I probably would have given this 5 stars but sadly we purchased a refurbished model through ACER OUTLET and it worked fine for about a week but as most things go with these things the charging port just stopped charging out of the blue. From there we contacted them, and followed what we were pointed to do so it would be fixed but soon as we sent in the PROOF OF PURCHASE they pointed us to download on here and email....well from that point we keep getting responses its not the proper paperwork. Be warned when you get products on here to look at your paperwork the product comes with, some reason ours only listed the item but no purchase date so its beyond me what to do to make this thing work like it should. Refurbished products are supposed to come to you working I hope way past a week but seems to me its more a pawn off of a horrible working item through the route we went. We are pretty fed up, when I call the warranty department they always tell us to send in the one thing that by email is being rejected and seems whoever is running that department has major miscommunication going on. Now I have to deal with the fact I bought this for my girlfriend, she is now gonna have to wait on us to either buy a whole other product or have this one fixed but personally after this experience I may stop using Amazon all together and definitely probably never touching an Acer product again. We aren't rich people here, we feel if you pay over a hundred bucks for something you pretty much should have more than a weeks time using it, but seems to me this warranty department is doing all it can to not make it right over doing something as common as making sure a customer is happy and wanted to warn anyone thinking about buying a refurbished product of this to be careful. Far as ours, it was not dropped....cord never was pulled out, nothing happened to it, just did not work all the sudden...not even loose so its beyond me what is going on. We probably will just throw it away and make sure when we avoid buying any future electronics offsite from Amazon, its pretty much set me off that much. Its a great tablet, don't get me wrong if you get a new one I am sure you will not get a headache like this one, our issue is the refurbished one. Sad cause we been saving up to get a macked out gaming pc on here but I think I am gonna take that purchase elsewhere cause I will use the pc for work in my recording studio and can't trust this warranty department if I have issues with that thing. Hope I save someone from this type of issue and people really read these reviews about the refurbished, as I see I am not the only one", "Title": "Warning with refurbished purchases", "Date": "April 5, 2014"}, {"Author": "Doris M.", "ReviewID": "RWRU23EZR946C", "Overall": "4.0", "Content": "Dislike the it  not havingjan office program and would like to be notified of if they become available.Satisfied with battery preformace.", "Title": "Acer works great.", "Date": "September 18, 2013"}, {"Author": "Donna", "ReviewID": "R1H07HPMXG1UFC", "Overall": "2.0", "Content": "I like this product it was purchased for my mom,, however after a month of lite use. It would not hold a charge, and eventually would not charge, a couple days later, the product came on, but needed to be charged. Now it is working at this time, but I already purchased my mom another tablet,,the IPAD MINI,  So now she will give the acer to my sister but I am glad that we purchased additional protection. So if you buy this product do your research. I just pray that this acer tab will perform as advertised. PRAYING IN CHICAGO.", "Title": "Stopped working after 1month", "Date": "January 30, 2014"}, {"Author": "dc103 \"SONGMAN\"", "ReviewID": "R2Q4T88UG8B6JI", "Overall": "4.0", "Content": "I'm not into spending all kinds of cash on a mere phone that shows everything super tiny.  This tablet takes decent pictures, very crisp, sharp images, and has everything I need in a tablet.  I would have liked to have more than 1gb of Ram, but this doesn't seem to be a problem.  The battery will need to be recharged if you are surfing the net for hours on end.  I don't think there is much this tablet can't do and for the price how can you possibly lose.  I have had mine for over 2 mos. and am completely satisfied.  Even my son was impressed and he is also is a \"phone\" guy.  He is thinking about getting the same tablet now:-).", "Title": "1st Tablet", "Date": "January 2, 2014"}, {"Author": "STEVE MARTIN", "ReviewID": "R2BYLCQ79KKUFZ", "Overall": "4.0", "Content": "Like most things about it, better than most I've seen. But very poor speaker system, and hard to hear without headset. Still haven't figured out how to transfer pictures to the mini SD card?", "Title": "first tablet.", "Date": "August 18, 2013"}, {"Author": "Patrick", "ReviewID": "R1AW4FE8RS8CUU", "Overall": "5.0", "Content": "This table works well and for the price it is hard to beat. Now I just need to add a phone so I can link them without any issues.", "Title": "Love the size", "Date": "October 17, 2013"}, {"Author": "THOMAS ROHKOHL", "ReviewID": "R1FKDIHJAOU0G6", "Overall": "1.0", "Content": "Not responsive to touch at times. Internet slow even 6 feet from wireless router. Hate to admit, might have to try apple.", "Title": "Not their yet.", "Date": "December 6, 2013"}, {"Author": "FaithLoveGrace", "ReviewID": "R1O6YP5MADZ5U", "Overall": "4.0", "Content": "crashed day three. was able to eat reset but still like the swype feature and app selection great size and great value", "Title": "would give four stars but", "Date": "September 24, 2013"}, {"Author": "Robert Brooks", "ReviewID": "R227BCNZO70DJI", "Overall": "5.0", "Content": "OK so I've had a few tablets in my days all acer brand. Every size and op system. Bought this for my sis and I'm sooooo jealous. The speed is outragous in every aspect. WiFi is unreal fast. Big props to Acer for making such a affordable lil tablet that beats a handfull of other right out of the gate. Perfect size and the light weight just adds to big plus of this. As far as I can see theirs not a thing I would want different.", "Title": "superman look out cz this baby is faster!!", "Date": "October 19, 2013"}, {"Author": "Blackcherry", "ReviewID": "R170M04DLLOLPK", "Overall": "5.0", "Content": "was ordered for a Christmas present so it will not be opened until Christmas day but I that it should be as dependable at the Acer lap top that is owned that is why I ordered it", "Title": "quality product by reputation", "Date": "September 26, 2013"}, {"Author": "T. Folse \"fpdoc\"", "ReviewID": "R327SS2OI6LQGR", "Overall": "3.0", "Content": "Got this for my daughter for Christmas, but she really wanted an iPad Mini.  We returned the Acer and got the iPad last week and she is much happier with the iPad.", "Title": "average Android tablet", "Date": "February 3, 2014"}, {"Author": "Tina", "ReviewID": "R1G8VJZUIU93UQ", "Overall": "1.0", "Content": "It does not like WiFi! So its a huge calculator and that it. It never stays on line for more than five minutes. Which is very frustrating. You play a game and will stop and say no internet connection but I can see three bars of reception? I hate this tablet and will never buy their products again. Talked with customer service, if that's what you call that, they have no idea what they are doing. I can erase everything off than put it back on and if that does nothing send it back. But after reading reviews of sending it back, I'm not wasting my time.This is a crappy product and will NEVER buy Acer again!!!! Dont buy this product or any other, we have to start weeding out these company putting 5 cents tablets on the market selling it for the same price has Samsung! I have no idea how this product gets so many stars and I know its not just mine cause all the other one star review say the same, no decent WiFi connection. Thats what its supposed to be for, getting on line. NEVER AGAIN and when you call customer service you need the tablet serial number to get a human, so when your 4 year old pulls off the sicker that tells you that info and no human to help you receive that info than you know they dont care about their customers cause the setting are hard to figure out.And to reply to Mary c, you don't know me so get a life. Tablets are making kids smarter and you probably don't have kids in this decade so you don't get that!and if you do have a child I feel very bad for them, all the TABLET kids will know so much more than your trolls! My son only plays sitting next to mom and dad on the couch.  This is a awful tablet and my 3 g phone works better. It's a shame people don't come to review products but people.  So please get a life instead of calling me a troll, that's so petty. It's probably the company reviewing, I wouldn't be surprised cause it's a cheap, lazy company. This is to help people not to bully other with your nonsense", "Title": "I hate this tablet", "Date": "January 6, 2014"}, {"Author": "Klukva", "ReviewID": "R2HKM1XZLMM5A0", "Overall": "1.0", "Content": "Network connection was 'good', but Internet didn't work.That left all pre-loaded apps useless.Then I found that it's common problem of Acer and Samsung tablets.Return this one. Going to try iPad.", "Title": "good for nothing", "Date": "October 21, 2013"}, {"Author": "Sentimldy", "ReviewID": "R1ZHLKJAERQQT4", "Overall": "5.0", "Content": "I can't really rate it yet ( amazon rating site is making me) but I am very excited to get it, if only Amazon would ship it!!! I ordered it 2 days ago. After reading all the WONDERFUL reviews here on Amazon and on other websites I feel very confident that this will be just what I am looking for! Some other websites that were Googled/searched by me, gave in depth tech specs and evaluations and this little powerhouse of a tablet got 4.5-5 stars on almost every review. Keeping in mind most of the comparisons were against the I-Pad mini! I can't wait to get it and start playing with it!", "Title": "Can't wait to get this tablet!  Acer Iconia A1-810-L416", "Date": "August 1, 2013"}, {"Author": "Linden Beardsley", "ReviewID": "R1PAL0MU47ZE63", "Overall": "2.0", "Content": "The directions on how to use it are not clear.  I cannot find a way to send things to the printer.  I don't know what is what.  It is not an Apple product which I am usually using.", "Title": "Bad directions", "Date": "November 5, 2013"}, {"Author": "Pat Lee", "ReviewID": "R30FG02OGFX764", "Overall": "1.0", "Content": "I love it. It is a great tablet. I would recommend this tablet for use to my family and friends. It meets my expectations.", "Title": "It is what I expected and more", "Date": "February 13, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00D3F9H62", "Features": null, "ImgURL": null, "Name": null}}