{"Reviews": [{"Author": "Bernie", "ReviewID": "RJ430VQDEHQ6W", "Overall": "3.0", "Content": "While the tablet itself is priced right, some people may be annoyed with the lag that it experiences sometimes. I am one of those people. In addition, WIFI is sometimes disconnected at random and is annoying when it is buffering through a lengthy video. I do like that it has a lot of connections (micro USB, Micro HDMI, charger plugg-in that allows the micro USB to be available). I returned it and upgraded to the ACER Iconia 8\". I will say the screen is beautiful.", "Title": "Has some concerns", "Date": "March 19, 2014"}, {"Author": "Daisychick", "ReviewID": "R2YM21ALO1E1UA", "Overall": "1.0", "Content": "Painfully slow and incompatible with pretty much EVERY application I tried to install from the Play store. Sent it back.", "Title": "SLOOOOOOW", "Date": "March 16, 2014"}, {"Author": "Jorge Paniagua Vargas", "ReviewID": "R3U35WLXXTM7OH", "Overall": "5.0", "Content": "This item met all my expectations, I have no problem working around me very well satisfied with this purchase I recommend", "Title": "work vell", "Date": "March 6, 2014"}, {"Author": "Mark Miller", "ReviewID": "RLSK48ERJGYU", "Overall": "5.0", "Content": "The extra inch of screen makes this clear to view. Very functional product that I have already recommended to others.", "Title": "An excellent value", "Date": "March 1, 2014"}, {"Author": "carol newman", "ReviewID": "R2YSXGHKSJXTF", "Overall": "5.0", "Content": "I love it, gives me the ability to use lots of apps without cluttering my laptop. The picture is clear and the navigation  is easy.", "Title": "tivax mi traveler", "Date": "February 27, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2Q26BJQREHP62", "Overall": "1.0", "Content": "The battery on this doesn't charge correctly or hold a charge.  Very frustrating.  Would not buy again.  Difficult to use.", "Title": "Malfunction", "Date": "April 4, 2014"}, {"Author": "J. Berndt", "ReviewID": "R32JBTQ5JWUS40", "Overall": "4.0", "Content": "likes to shut down when in the middle of looking up stuff.  Did not come with a screen protector.  Perfect for the fast or even browsing of the web and e-mail.", "Title": "a good price for what you get", "Date": "February 1, 2014"}, {"Author": "Rebertha Munroe", "ReviewID": "R16RS3VRB1MH85", "Overall": "3.0", "Content": "before I order dis tablet I read the other comments and the way they talk about the tablet made me buy it. After I received it and use it for a short period of time I realize that it wasn't all they  said it was and its very slow and the volume is very low. the camera isn't all  that.", "Title": "the tablet", "Date": "February 27, 2014"}, {"Author": "Oliver N. Ward \"pax man\"", "ReviewID": "R9NTT7FIHVT7O", "Overall": "1.0", "Content": "This device is a piece of crap! Keyboard function failed in the first minutes of test use! They probably will have me pay shipping on item. I think it must be a racket. If they sell an item they know will be returned over and over again they can make money just on the unrefunded shipping and handling!", "Title": "WARNING!", "Date": "March 17, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00DQ623GY", "Features": null, "ImgURL": null, "Name": null}}