{"Reviews": [{"Author": "Jonathan R Bell", "ReviewID": "R59XDMXZB8NM6", "Overall": "2.0", "Content": "This tablet would be OK for a child, however you could spend just a little more and get a much better device.  The screen has decent resolution and it has a fairly recent version of Android which is nice.  It is all plastic, and has a plastic feel.  But at the price I paid I expected that and it was not an issue for me. It has a decent amount storage and a MicroSD slot for expansion.The downside:The applications touch button in the top right hand corner of the screen only works in landscape mode.  If the table is oriented portrait mode it does not respond which can be annoying.The micro USB port is very flimsy and broke within three days when using it to charge the tablet instead of the power cable.The worst thing is that the broken USB port is not really and issue for this tablet because there do not seem to be any computer drivers for this device.  I plugged it in to five different computers and none of them would recognize the device.I knew I was not getting a top of the line device and expected most the perceived issues that most people complain about when reviewing their purchases of a lower end tablet.  So the plastic feel and lower screend resolutions were not going to be issues for me and I don't think bear weight here considering what I bought.How ever the last two items, the lack drivers to be able to connect to a computer and the TERRIBLE construction around the USB port prevent me from recommending this tablet.", "Title": "Not Recommended.", "Date": "December 6, 2013"}, {"Author": "Kaycee79", "ReviewID": "R1N8DFH3DKDVK8", "Overall": "2.0", "Content": "I bought my daughter a proscan for half the price and her battery lasts all day. This zeki barely lasts 2 hrs. I had no idea that wasn't normal. It gets extremely hot and bogs down after 15 min. The adapter sparks when you plug it into w wall. I got this one for the HDMI port but if you don't have enough charge on it before hooking up to tv , it will still die while plugged in. Horrible piece of junk, look elsewhere.", "Title": "Not worth it.", "Date": "December 26, 2013"}, {"Author": "Julia Nevius", "ReviewID": "R397XGNGKFDDIF", "Overall": "1.0", "Content": "I bought one for each of my grand kids but then bought one from Amazon and it has quit working after 3 uses.  Switch will not turn back on.", "Title": "Malfuction after 3 uses.", "Date": "April 9, 2014"}, {"Author": "bargainhunter", "ReviewID": "RM22HWL7JOP1C", "Overall": "2.0", "Content": "Broke after 1st use. I was on YouTube and it started vibrating and the screen started freezing. After I restarted it, it worked fine.", "Title": "ok while it lasted", "Date": "February 14, 2014"}, {"Author": "Mushy", "ReviewID": "R33WK5PQTZFYYI", "Overall": "4.0", "Content": "Although I can not watch one of my favorite local channels, I am still very happy and impressed with this $25 tablet!!!", "Title": "LOVE IT!!", "Date": "May 7, 2014"}, {"Author": "Justin", "ReviewID": "R39P4E5IC2C142", "Overall": "4.0", "Content": "This tablet is better than the one I had before, but that's not saying much because the one I had before was pretty bad.  It is easy to use and downloads video pretty well, but I quite often have a lot of trouble downloading and installing free apps.  Some installed easily, others have been all but impossible.  And it doesn't give a status while it's installing apps.  I have to keep going back to see if it actually installed or not.  My old one was even worse, but I expected better.  Nevertheless, I'm happy with it and just hope someone comes up with an upgrade to solve this problem.", "Title": "Improvement", "Date": "April 16, 2014"}, {"Author": "berroni", "ReviewID": "R2XU6CGEKS7PNN", "Overall": "3.0", "Content": "great price (paid $25 brand new)  this tablet is flimsy believe it or not it actually started to squeak after one weektablet freezes often and half the time apps are unresponsive on the other hand when it does work it works quite well  for the price(you get what you pay for)", "Title": "okay tablet with a good price", "Date": "April 7, 2014"}, {"Author": "sandra fleming", "ReviewID": "R2SQCAO8JRZVHW", "Overall": "5.0", "Content": "great tablet for great price have two grandsons that live with me and they love it gives grandma some time off", "Title": "keeping grandsons busy", "Date": "April 5, 2014"}, {"Author": "Jaybyrd365", "ReviewID": "RPO4OOAE5P7O", "Overall": "4.0", "Content": "Tablet is great! Purchased it for our daughter she loves it. It wasn't  too expensive. We got our monies worth.gr", "Title": "Great", "Date": "March 20, 2014"}, {"Author": "Geneva Cardinas", "ReviewID": "R2GPRRHIBG273X", "Overall": "1.0", "Content": "I bought two of these to replace the originals ones they received for christmas as a gift from a relative.Rather than telling the relative that their gift was broken(Screen cracked on both) I decided to just purchase two more especially since the price was right.First let me start off with the two I received did not look like the same tablets even though the box stated they were the same the boxes looked a little different but the images and the specs all stated the same thing...the chargers were the same type but looked different as well. After charging them We turned them on and one tablet was configured with all the apps stated on the box and the other was not...Did not discover this until after my kids were playing with them and trying to figure things out..Also when i looked up the memory one stated it only had 4 GB and the other stated only 1GB in its memory. When i read the invoice it stated once opened no returns will be granted...I did get the additional warranty i still need to find out more info on how that will work..but overall I am extremely upset about this!", "Title": "Not as described", "Date": "March 17, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00DRML5LG", "Features": null, "ImgURL": null, "Name": null}}