{"Reviews": [{"Author": "Marisa Wolfe", "ReviewID": "R2YUFNSF1MPAG2", "Overall": "3.0", "Content": "I'm a 24 / m that has been rooting and ROMing phones for years so I know my way around android. I am also broke and needed a budget tablet.Pros:----------(EDIT)After tweaking everything a few times, I have found the best performance with these settings.- No frills CPU set to 48mhz lowest, 1.1ghz - 1.2ghz (any higher freezes often with no noticable speed increase)- Use Interactive governor (fast cpu scaling, quick to rev up and kills it when screen off to save battery)use- Use DEADLINE  I/O  (best for multi tasking, least crashes)With these settings and FAST REBOOT and task killer (do not set to auto-clean, just use the task killer widget and fast reboot to clean up ram when you pick it up) I have greatly improved performance.I also ran through many launchers and found Nova to be the best with least lag.-------Original ReviewDecent camera - 1.3mp is better than you think, and it doesn't only work with skype so ignore that reviewScreen was pretty clear. Not HD, but its not the poor low quality I was expecting. Looks fineComes rooted (but there aren't any roms I would recommend. Just use a CPU app and titanium backup / other root apps).Nice design. I was pleaseantly impressed. Pretty thin and lightRuns ICS with PLAY STORE - not all of these a13 allwinner tablets run off the real play store.USB host. Just plug whatever you want into it. It has worked fine with a keyboard and a mouse (yes, a pointer appears on the screen). I will be trying it with a USB hub and see if it will run a mouse and keyboard togetherUSB cannot be used to charge. It is HORRIBLY slow, and not reccomended. BUT, if you are in a pinch, a usb charger will let it stay on. So as long as you have a phone charger, you can at least turn it on.Good quality, but only for the price. If you want a tablet that runs like a thunderbolt or higher quality phone, go to the $150 - $200 range and grab a dual-coreCons:CPU! - Although these are all advertised as 1.2 - 1.5GHZ, they are not. Yes, the software will allow setCPU (or others) to set it to 1.5GHZ, but this is just overclocking a 1GHZ CPU. Which is why people are getting horrible battery life and freezing. Just set it to 1GHZ. its not really slower, because any higher than 1.2 freezes up and crashes.wifi speed isnt the fastest. all around, its about as fast as a 3rd gen ipod touch for web. Just about every phone I have had has been faster.Screen - My biggest complaint is the screen. quality was good, but the viewing angle is horrible. you have to hold it just right to avoid bad contrast. ESPECIALLY portrait viewing. You cannot look straight at it in portrait. And the screen is about 5% hidden underneath the black edges of the screen.Battery - I have only had it one day, but the battery life seems to be 3-5 hrs if you barely use it. I dont care to keep mine on the charger a lot. otherwise its about 2-3 hrs if you are lucky.(EDIT) After having it for a full 24 hours I have run a battery test from 100%. Battery has lasted almost 13 hours through the night. Up time was about 5 hours. down time (idle or in airplane mode) was 8. So if you set it down in airplane mode, it will do A LOT better.Laggy - music was skipping a little, if you dont constantly close apps, it will get pretty slow. And if you are downloading / installing an app, it can really ONLY do that. everything else slows up til its done. But again, its a budget tablet. And still does better than others in the price range (EDIT: after changing the cpu settings I posted at the top, lagging has almost disappeared. especially if I keep ram clean.Sound - you're gonna need speakers or headphones to watch anything if there is any noise around. pretty quiet. (EDIT: sound can be improved by downloading speaker boost. dont boost more than 40% or you might blow the speaker.)All in all, I like it enough to keep it. Its not great, but I just use it to browse the web and netflix and a few other apps. Nothing major. If you don't have $150 to buy a tablet, this is for you. Just remember its a budget tablet. If you really want a Nexus tablet, save and get it.", "Title": "Could be better, but best under $150 I'd say", "Date": "February 1, 2013"}, {"Author": "Tianna Morgan", "ReviewID": "R1GC24YH9I0BQK", "Overall": "1.0", "Content": "I bought three of these tablets for my children after reading the reviews and there being so many 5 stars. Let me start by saying I was weary on this tablets as soon as I opened them because the screens were already scratched up like they had been used we though it may have been from the manufacturing of them. First tablet came on great, downloaded apps netflix worked which was one of the 2 most important apps for them.However the second game the kids want so they can play with us will not allow an account to be created because the google location services cannot locate it for some reason. Also when attempting to log into an account already made for that game it says there is already an account linked to the tablet even though we factory reset it multiple times.Second tablet came on great. However the touchscreen is constantly having issues. I could see it showing as if it was being touched somewhere, no where near where we were actually touching. This was leading to frustration and getting no response from the tablet without hitting power button putting it to sleep then waking it up again only to have it do the same thing 3 minutes later. Attempted to use the stylus it comes with and same result no response half the time without putting to sleep first.Third tablet....This tablet would not even turn on at all.This is an aggravation, this is the 3rd tablets we have tried since Christmas and the kids still do not have their christmas presents. Last year we had really good luck getting a tablet that runs exactly what we want for around this same price however now we can't seem to find anything and we can't afford $400-500 tablets for our children to use.", "Title": "Do not buy", "Date": "March 6, 2013"}, {"Author": "Judy Wilson", "ReviewID": "R2SA86C0NI6CYD", "Overall": "5.0", "Content": "I want to say 'Thank you' to Amazon, for their on time delivery.  I ordered this product back in December for my grand-kids and it never arrived.  I was very skeptical about reordering again on Amazon.com.  But this time I re-ordered through Amazon directly and received my goods without any problems.  I knew their was a reason why I had to have the Zeepad for my grand children.  This tablet is brilliant.  It has more features on it then my Sumsung Tab 10.  The Zeepad also came with a screen protector, and a  pen.  It took less than an hour to charge.  I am thinking of getting one for myself. My grand-kids are in love with their new tablet.", "Title": "Zeepad for my grandkids", "Date": "January 28, 2013"}, {"Author": "Purplefish20", "ReviewID": "RS1BJE27RVZ9W", "Overall": "4.0", "Content": "If you're in the market for an product that's awesome, but not a national brand ... the Zeepad is for you.  I wasn't expecting this mini-tab to outperform the more technologically-infused tablets, and it doesn't.  However, it definitely exceeded my expectations for a Tab in this price point.  I purchased it for my mother, who basically uses it for games like Angry Birds, Solitaire, etc., as well as email and web-surfing.  She loves it!I actually purchased another mini-tab prior to the Zeepad by another brand ... and returned it immediately, so I'm able to give a little bit of a comparison review.  The hardware, software and battery life of the Zeepad, far outweighs the other Tab.  I strongly recommend this Zeepad if you're looking for a mid-to-low market product that's awesome!", "Title": "Looking for Awesomeness?", "Date": "January 22, 2013"}, {"Author": "mhdz!", "ReviewID": "R2GYDH4EC53UBK", "Overall": "5.0", "Content": "My husband really loves this tablet.  It was a great buy and would recommend it to everyone. I want to purchase another in the future.", "Title": "Gift for Christmas", "Date": "January 22, 2013"}, {"Author": "jamie", "ReviewID": "R3EYLVNNOZ4TFX", "Overall": "5.0", "Content": "At first i got a different tablet but when it came it did not support play store...so i found this tablet and it is so easy to use...kids luv it", "Title": "love it", "Date": "January 8, 2013"}, {"Author": "DOC", "ReviewID": "R2YF1SKIC465MU", "Overall": "4.0", "Content": "Ordered them last minute for christmas gifts for twins (10) and a 15-year-old....they are amazing and they came overnight and in time for Christmas.  The kids love them....the biggest issue is that they WILL NOT put them down!  THANKS!!", "Title": "I'm a WINNER", "Date": "December 30, 2012"}, {"Author": "claudia gonzales", "ReviewID": "R25CXZYMHMZGZ", "Overall": "5.0", "Content": "very good computer very easy to use for my five year old he loves it and so do i im going to purchase a pink one very good picture good quality  for the low price i paid it came with a screeen protector a pen and also a connection to tv and to  the cell phone we lovethe productthank you very much", "Title": "we love my 5 year old zeepad", "Date": "December 26, 2012"}, {"Author": "jose sanchez", "ReviewID": "R8JHJTK3M2EX1", "Overall": "5.0", "Content": "this was more then i was expecting for the price perfect runs real smooth great for my daughter as a first tab", "Title": "daughters gift", "Date": "December 25, 2012"}, {"Author": "laura", "ReviewID": "R1KZ7QEFWUMGSL", "Overall": "5.0", "Content": "this was bought as a christmas present and it was just what we wanted perfect for kids we love it", "Title": "great product", "Date": "December 18, 2012"}, {"Author": "Kevin D McMillan", "ReviewID": "R344YR1H2TPTK", "Overall": "5.0", "Content": "We are very pleased with what our zeepad can do.  It meets our expectations and more.  I was a little disappointed in how long it took to ship, but once the product got here it has been great.", "Title": "I love it", "Date": "January 16, 2013"}, {"Author": "Steve", "ReviewID": "R1J6WLF5GSWWGM", "Overall": "4.0", "Content": "It works well not as fast as the more expensive tablets but much cheaper. I would recomed it to any one looking for a good price.", "Title": "What I expected.", "Date": "January 8, 2013"}, {"Author": "Makeda", "ReviewID": "R1FE3WEDNDUB5M", "Overall": "4.0", "Content": "Bought it for my 5 and 7 year old girls, they love it and it was good quality for the money!!  I would definitely recommend it, cause I find myself using theirs alot.", "Title": "Zeepad Review", "Date": "January 8, 2013"}, {"Author": "marino fernandez", "ReviewID": "R1EXI9R2T98KKL", "Overall": "5.0", "Content": "For the price its a good product. Email set up is very easy, I bought this tablet to use it while on the road. I use my phone hot spot to connect to the internet and I was pretty surprise on the speed of the tablet, I thought it would be much slower. I use it for basic stuff just to read books, go online and watch some videos. The screen is really responsive, the tablet comes with head phones but the material is really cheap I didn't even bother on putting it on, it also come with a screen protector A+, charger, usb cable and a stylus pen (very nice). I also like that you can also charge it via usb since the charger pin looks a little fragile, so when that brakes you can always use the usb. I would recommend this product.", "Title": "excellent", "Date": "January 8, 2013"}, {"Author": "Bill", "ReviewID": "R1NFY1YJUMOBFD", "Overall": "4.0", "Content": "I just received my zeepad yesterday...I am very happy with this product.  I am suprised how fast it is...The picture is great....For the small amount it costs, it a great deal!.....", "Title": "7\" Zeepad", "Date": "January 8, 2013"}, {"Author": "NoDakGrl \"nodakgrl\"", "ReviewID": "RYYPI9FHZHMBE", "Overall": "4.0", "Content": "My daughter loves it.  It does all that it needs to do.  Its not the best picture, but for just basic internet viewing and watching movies and videos.....it is good.", "Title": "good for what I paid for it", "Date": "January 8, 2013"}, {"Author": "Maria", "ReviewID": "R2R0BKIZY0NID6", "Overall": "5.0", "Content": "For the money i am very impressed with this tablet. My son has a Lenovo with close to the same features, but cost almost 3 times as much. The only thing i was not impressed with is the battery power, which only lasts about an hour when you are doing stuff constantly.", "Title": "Excellent Tablet for the Price", "Date": "January 5, 2013"}, {"Author": "Grammacoop", "ReviewID": "RV38H0YC4QIR", "Overall": "5.0", "Content": "We reinstalled the Skype and now I get to spend quality time with my 8 year old grandson. He was totally taken by surprise that we bought it just for him.", "Title": "this ended up to be even more than I had hoped.", "Date": "January 5, 2013"}, {"Author": "Kendra Dias", "ReviewID": "R1UFE6ZKWUT7BZ", "Overall": "5.0", "Content": "I have several coworkers who are interested in my fun sized \"toy\".  It is easy  to carry, and Im enjoying learning all of its features.", "Title": "Zeepad Tablet", "Date": "December 28, 2012"}, {"Author": "travisia", "ReviewID": "RVM1XASBI0V8A", "Overall": "5.0", "Content": "I bought it for my four year old for Christmas and it works like a charm! Very good tablet. The touch screen is excellent, and the setup was very easy!", "Title": "Love Love Love it", "Date": "January 6, 2013"}, {"Author": "Sandra K. Mcbride", "ReviewID": "RFWA2C7ZIN14K", "Overall": "5.0", "Content": "signed her right up for skype so she could keep in touch with friend that moved to Wash. state. good buy", "Title": "granddaughter loves it", "Date": "January 5, 2013"}, {"Author": "Michelle t", "ReviewID": "R2PKJLNB0TV0GI", "Overall": "3.0", "Content": "This was a nice christmas gift. My daughter likes this zeepad but its not as heavy as my kindle and if you press on the screen or back too hard there are small ripples that appear on the screen. This is my only concern because my daughter like most kids are not gentle when it comes to electronics. However, i think for the price im not worried and she will become use to not pressing the screen too hard when playing games on it. Will update within a few months !", "Title": "Bought this for my eight year old daughter.", "Date": "December 31, 2012"}, {"Author": "Tammy", "ReviewID": "R1IAKWY1O9HFGB", "Overall": "5.0", "Content": "I purchased two of these for my younger sister and cousin. They absolutely love them. Great product for younger children!", "Title": "They Love It!", "Date": "December 24, 2012"}, {"Author": "Yo Health Pro -- MK", "ReviewID": "RAX9M3TN16EWJ", "Overall": "5.0", "Content": "I cannot tell you how extremely happy I am with this tablet.  Some of the comments on Amazon had me so concerned about this tablet that I had asked to return it before I even opened it.  After the seller assured me that they would accept this tablet back, I felt guilty for not giving it a try.  When i first opened and saw it, I was impressed.  It is so streamlined, it is beautiful.  It is so intuitive.  If you have ever used a computer before, using this tablet will be a breeze.  I have only had this tablet for a week, but I am in love with it.  The time was preset to China time, but I touched on (selected) Settings (the three little lines on the bottom right of the screen just above the time).  Then I went to System (scroll down) and clicked on Date and Time.  Click on both Automatic Date and Time and Automaic Time Zone to turn them off.  Then click on Select Time Zone to chose your time zone.  Once this is done, Click on both Auomatic Date and Time and Automatic Time Zone to turn them back on.  This will set the date and time according to your time zone.  You will not have to adjust the time at all.  I also was able to get all of the Google Apps that I wanted, once I got the time zone and time settings correct.  And the selection of Google Apps are voluminous, and almost overwhelming.  But you can search the Apps for the App you want.  I was able to get Norton Utilities to protect from viruses, for free.  I was even albe to download an App to do my banking with Chase Bank on this tablet, again free.  I have downloaded the Pandora App (again free).  Talking about impressive.  The sound is great, especially with the headphone attachment included.  Enjoying Pandora itself is enought to be impressed with this tablet alone.  f you have a cell phone, you can use the Google Phone App (free)to receive and make all your phone calls on this tablet.  Google Phone even transcribes your conversations so you can have a hard copy of what was said.  Skype App (free) is also included.  You can make video phone calls once yuo download the software and purchase a Skype phone number.  And all of this works.  It comes with an attachment that allows you to connect directly to USB hardware.  I have not tried it yet, but I can only imagine the number of hardware that I will attach to this tablet, including external speakers with an external power supply,  my full keyboard, a USB hub so I connect more than one piece of hardware at a time (again with an external power supply), my mouse, and even an external hard-drive with its own power supply.  And when I want to just carry the tablet with me, I can disconnect all of this hardware and have all the computing power I need for most of my applications.  When I tell you this tablet is awesome, it is truly awesome.  I can do everything on it that I would do on a regular computer, laptop or stand-up.  I must say that the processing speed will not be as fast as a laptop or stand-up, but I have not used any applications where I noticed the speed to be a problem, not yet!!  I am even thinking of attaching a second external wireless adapter to extend the range of the Wi-Fi.  Talking about a great computer, this is a great computer.  Who would expect to able to do all of this with a tablet.  I would highly recommend it to anyone looking for a compact computer. that is easy to carry yet powerful enough to do most of your computing needs.  It is extremely powerful, and the screen resolution and icons are beautiful.  I would give it 10 stars if I could.  A great buy.  My best buy on Amazon since I started shopping on Amazon over 10 years ago.  And the price is more than reasonable.  I think anyone who takes the time to learn to use this tablet will be just as impressed with it as I am.  Cudos, Marvelous, Wonderbar, Fanterrific, Wondermous, Fantabulous, Excellentaprimo, and so many other adjectives that cannot come close to how impressed I am with this tablet.  A definite jewel in the rough!!!  I will write a follow up in the future to let you know if all of these external attachments will work.  But I don't see why they wouldn't.  Again, like I said, an extremely impressive tablet and an awesome buy!!!", "Title": "Awesome, Magnificent Tablet -- Well Worth The Money", "Date": "January 29, 2013"}, {"Author": "bhenjo", "ReviewID": "R1WIB402ANIT8T", "Overall": "4.0", "Content": "not bad for the price everything that you need is there except it wjll be more better if it has more memory rom", "Title": "not. bad tablet", "Date": "November 5, 2012"}, {"Author": "misty", "ReviewID": "R4W1N3133WIO", "Overall": "1.0", "Content": "I have had nothing but issues with this dumb things since i bought it! I would not even give it half a star!!! Dont waste your money! the screen freezes all the time, the charging dock is broken! and now i cant reach the company to see if it still has a manufacturing warrenty on it!!", "Title": "CRAP!!!", "Date": "May 18, 2014"}, {"Author": "bernadette", "ReviewID": "R3VZ0ULVIV2LUC", "Overall": "3.0", "Content": "The zeepad is OK the charger stop work to soon and the camera is very poor I don't thing I will purchase a zeepad again", "Title": "not please", "Date": "March 25, 2014"}, {"Author": "Amazon Customer \"average joe\"", "ReviewID": "R2J5DMP038LXVU", "Overall": "3.0", "Content": "If you're looking for a cheap tablet to watch youtube videos, play a few (and only a few!) games, and occasionally check e-mail/facebook, this is a steal.  If you're looking for a fully functioning tablet, stay away...this becomes slow and nearly unusable with multiple apps running and memory filled more than 25%.I've bought 2 for my 8-year-old son (he sat on the first and broke the screen), and they both worked great.  Perfect tablet for simple use by a young child (or maybe an IT-challenged senior).", "Title": "5 stars for the right purpose, 1 star otherwise", "Date": "March 21, 2014"}, {"Author": "lauren", "ReviewID": "RX0IPJQAMTPRZ", "Overall": "5.0", "Content": "I know there quite a bit cheaper than all the other tablets, they feel cheap also, but there still a really good buy! Great for kids that are first time users of tablets to break them in....there actually really fast at downloading books and apps and looking at web pages.", "Title": "Great buy!", "Date": "March 18, 2014"}, {"Author": "CH", "ReviewID": "R3HOGQOIR717IB", "Overall": "1.0", "Content": "Won't hold a charge even when it hasn't been used, so we have to keep it plugged in all the time. Now the wi-fi is failing, so it's sitting right next to a wi-fi hotspot but says there's no internet available. We can try toggling the wi-fi on and off, but that only works part of the time. The other half of the time it gets stuck on the \"Turning wi-fi on\" screen and we end up restarting it... and then still have no wifi. Apps somehow seem to freeze up and crash constantly. I'm a big fan of Android but if this was my first introduction I'd think it was the pits.", "Title": "You get what you pay for.", "Date": "March 24, 2014"}, {"Author": "C. Lohrmann \"Lane\"", "ReviewID": "R1ICFROEPIKH3L", "Overall": "2.0", "Content": "My 9-year old daughter has been able to play a few games on the Zeepad, but it's terribly hard to load anything.  The reaction time on the touch screen is so bad, it makes it difficult to do anything and most of the time it just crashes.  This was a waste of money.  I wish I would have spent more on something that worked.  I would never buy a cheap tablet again.", "Title": "It just doesn't work", "Date": "March 22, 2014"}, {"Author": "Kissy Miller", "ReviewID": "RIO1K6H6K80FQ", "Overall": "3.0", "Content": "We constantly Have issues with the pad charging.  It Won't charge one day and then the next day charges fine.", "Title": "Just ok", "Date": "March 21, 2014"}, {"Author": "Cristina Palmerin", "ReviewID": "R20OIIW0WLW7NM", "Overall": "1.0", "Content": "Bought three (3) and one of the three has given us problems from day one. Was able to return it for a new one but I am skeptical now that I received a new one being that a couple weeks the screen is going crazy. The product comes with a 1 year manufacturer warranty but good luck trying to register and/or let alone contact the vendor for warranty issues. Doesn't matter where you purchase this item - BUYER BEWARE if you get lucky with one that last you for a at least a year you got a good deal, not the best but good. The other two tablets are working just fine for now but I'm not getting my hopes up and will probably have to invest in better quality tablets. So if you decide to buy one keep your fingers cross that you get a good one. Only have been able to obtain an email address... \"The best that I can do for you is to refer you to our supplier and hope that your item qualifies for a warranty. You can also contact the manufacturer to assist you with any product related questions at helpdeskworryfreegadgets@gmail.com\" Sent an email and still waiting for a response.", "Title": "WARRANTY ISSUES - NO CONTACT INFO. BUYER BEWARE", "Date": "March 21, 2014"}, {"Author": "James M.", "ReviewID": "R15KEYD0W16FRZ", "Overall": "3.0", "Content": "she plays with it but she's quick t o grab mom's ipad. it's a decent starter pad for a young child but, an adult will have to assist in the set ups.", "Title": "bought for 4 year old,", "Date": "March 20, 2014"}, {"Author": "Marilyn hawkins", "ReviewID": "R10585QZ3W5FD3", "Overall": "1.0", "Content": "It came broken... i need a refund or another item...im trying to find out how to return it. My son can not even enjoy it.", "Title": "broken item", "Date": "March 20, 2014"}, {"Author": "jacky", "ReviewID": "R1OZHPM61U8XMV", "Overall": "2.0", "Content": "bought 3  one wont stay charged,one isnt coming on after a week and one works perfectly but we love the one", "Title": "bought 3", "Date": "March 20, 2014"}, {"Author": "Megan", "ReviewID": "R3JB4TFUH2EBAP", "Overall": "5.0", "Content": "Perfect starter tablet! Has everything my kids need. No worries about them having trouble using the tablet. Nice for long car rides.", "Title": "My kids love it", "Date": "March 19, 2014"}, {"Author": "SCK", "ReviewID": "R388D5H45EAAYI", "Overall": "3.0", "Content": "Have had it for 6 months and it still works fine, accept for the touch screen calibration is off so I use a mouse most of the time, was thinking of looking at the calibration config file to see if it was tampered with.Plays most simple games, adding the setcpu app and lowering the cpu speed below 400MH gives me about 4 hours on a plane with Wi-Fi off, that along with a usb charger pack it will get me through most flight playing games or watching movies.Downloaded 3gpp files videos youtube and put on 16G SD card and they play wellUsed as web/email machine on vacations and it served the purpose using mouseincreasing the cpu to 800MH it chromecast youtube videos well if the network connection is good", "Title": "OK for the price", "Date": "March 18, 2014"}, {"Author": "dee bowers", "ReviewID": "R3LF3HLZ85T0S4", "Overall": "5.0", "Content": "Just what I wanted, enjoying it very much.  A++++++++++++++++++  My GrandDaughter really enjoys the games on it and plays with it more than I do.", "Title": "great, love it.  A+++++++++++++++", "Date": "March 15, 2014"}, {"Author": "S. Jones \"Steff\"", "ReviewID": "R28FWIP572ZMPV", "Overall": "5.0", "Content": "My son really enjoys this. A bit of a lag with the screen and glare but not bad for a pretty cheap tablet the android market is great he has his instagram fb twitter kik and all the apps he uses no complaints", "Title": "cool for the price", "Date": "January 2, 2014"}, {"Author": "lane", "ReviewID": "R1VTUFKYFWGZ2Z", "Overall": "5.0", "Content": "I got this for a 11 year old girl at church, she absolutely loves it. She has it with her constantly. So glad that I got it for her. Would definitely buy another one as a gift", "Title": "Great girl gift", "Date": "January 2, 2014"}, {"Author": "Telly L", "ReviewID": "R2I0N0VAFXDKB8", "Overall": "2.0", "Content": "After only two days, the screen just went off. it has to be pressed really hard inorder to see the items on the screen.", "Title": "Screen gone", "Date": "January 2, 2014"}, {"Author": "Kendra Briese", "ReviewID": "R3BZ8HO4Y6KCV4", "Overall": "4.0", "Content": "I chose to buy my 7 year old daughter a zeepad cause of the price, I was surprised that it turned out to be a pretty good product, its a little slower but that's ok I wanted to buy my daughter something that wouldn't be expensive if it needed to be replaced. over we are very happy with it", "Title": "good product", "Date": "November 13, 2013"}, {"Author": "sherelyn johnson", "ReviewID": "R1AEXTQ1HHVGQ0", "Overall": "5.0", "Content": "I bought this for my husband who has never used a computer of any kind.  He is in love with his tablet.", "Title": "Zeepad Tablet", "Date": "July 29, 2013"}, {"Author": "hg088", "ReviewID": "R1PR984N2NYR3N", "Overall": "5.0", "Content": "I think that for the price this is absolutely a bargain. You can't compare this with other pricier tabs but i works really well and you can  do most tasks these tabs do", "Title": "Great for the price", "Date": "July 28, 2013"}, {"Author": "J. Morgan", "ReviewID": "R1Y46R90UW1NT9", "Overall": "1.0", "Content": "Within the first WEEK this thing stopped working. It gets stuck at the Android screen and refuses to boot. I checked everywhere online for a solution and there isn't one. Not to mention, this is a VERY common issue with this product! Search yourself!I went on Youtube where the guy was doing a Zeepad review, and I advised others to not buy this thing. And guess what? A few days afterward someone replied to me and told me it just happened to them.Thank god this was backed by Amazons return policy and happened within 30 days.I don't have any frets against the seller, everything was received and delivered quickly. The actual product is my only issue.", "Title": "DO NOT BUY THIS JUNK!!! (Most helpful comment!)", "Date": "July 27, 2013"}, {"Author": "Lunari Grimm", "ReviewID": "R2MSOVHCY7NP2V", "Overall": "3.0", "Content": "if the battery actually worked. then again i'm not even sure what i had received from PCTVSHOP was an actual zeepad considering there was no indication on the tablet or box that it was. It seemed that either there was no battery in the item or it might not have even been connected. when i sent my first request for a replacement of the faulty and questionable device i got no response from PCTVSHOP so i sent in a second and finally an A to Z claim with amazon. i then received a rude note from PCTVSHOP saying that i complained to easily and killed sellers. i finally returned it through amazon and got my money back. i gave the zeepad a 3-star because i don't know if i can honestly review it all things considered. i do give PCTVSHOP a big fat F though all around the board. don't buy from them. i'm extremely disappointed.", "Title": "this would have been a good product", "Date": "June 5, 2013"}, {"Author": "nataliesmall", "ReviewID": "R373LIL7Q5TVNQ", "Overall": "4.0", "Content": "we bought this tablet for our 8 year old daughters birthday she had been wanting one for a while now since she got addicted to my kindle fire but we did not want to spend a lot of money for her age. We got the tablet in just a few days and came in good condition and with all the accessories. it is a little slow at time but works just fine for her connects to wi fi and really like that it has the play store so we are able to download a lot of FREE apps for her and i can also sync my kindle to her tablet and she can read the books that i have on her tablets as well. The one thing i do reccomend is getting screen protectors right away for the tablet.and the last issue that i seem to be having is after about a few weeks of having the tablet for some reason the word DEMO is now shoing on the screen in the left hand corner and i dont know how to get it off i have tried re setting the tablet in hopes that it would come off but no luck so far so if anyone has any suggestions on what i could try it would be greatly appreciated.I would definately recommend buying this for someone especially if you have a child wanting one for the first time. I know i will be planning on buying more in the near future seeing as i have 3 more daughters that are also now beeging for one!!!!", "Title": "good for the price", "Date": "June 5, 2013"}, {"Author": "nemo", "ReviewID": "R3C2Y23Q94BDBN", "Overall": "1.0", "Content": "had it for about 4 months. Was slow and unresponsive at times and especially when it was nearing its end. Now it won't turn on no matter how long I wait for the screen to load, which on average took about 5 seconds after you hit the button to show the slide to unlock screen (not from startup.) In my opinion, not worth the money. Would rather have bought a 2nd generation ipod (and I hate apple products) that I know would hold up for a while. If u need something temporary to hold you and you have a lot of patience with technology, then this tablet will work for you. I had the patience but I was expecting something to last me for at least a year not 4 months.but the sellers were great. would buy from them again, just not this particular product.", "Title": "worked less than average till it broke", "Date": "June 4, 2013"}, {"Author": "jill", "ReviewID": "R7EVV31N552DP", "Overall": "1.0", "Content": "They tell you it's a zeepad, but when I've received my tablet it was no zeepad at all !! and also used. It was a lousy android tablet with no brand name. And worst of all, it's stopped working within 1 month. BAD COMPANY! SCAMMER!I've bought my tablet from this company on 7 march 2013, now the have changed the picture of the tablet for you to fall in, DONT BUY IT!", "Title": "scam", "Date": "June 4, 2013"}, {"Author": "Ash", "ReviewID": "R2MI6GLAXXR7AS", "Overall": "1.0", "Content": "I purchased this item for my son to free up my iPad. My son did not even have this a week before the screen was broke (and I had it in a case). The quality really sucks and I DO NOT recommend this product to anyone else. And you still have to pay a fee to get it fixed.", "Title": "Not worth a crap!", "Date": "June 4, 2013"}, {"Author": "myersmemories", "ReviewID": "R2H1IV44OS2PVQ", "Overall": "1.0", "Content": "I GOT TWO AND BOTH WERE RETURNED DONT WASTE YOUR MONEY ON THIS ITEM. SPEND THE MONEY ON SOMETHING BETTER", "Title": "WASTE OF MONEY", "Date": "June 4, 2013"}, {"Author": "Laurie Burke \"Larke333\"", "ReviewID": "R20354OWC9UJ7Q", "Overall": "5.0", "Content": "I bought this for my son's 9th birthday and he loves it!  He had asked for a Kindle HD but I couldn't see spending that kind of money for him to just play games on.  I found this and read the reviews and decided to take a chance and I'm glad I did.  I may even buy one for myself now!  He seems to have figured it out pretty easily and he loves that its preloaded with Angry Birds and Fruit Ninja.  Take a chance, it's worth the money!", "Title": "What a great product for the price!", "Date": "June 4, 2013"}, {"Author": "Ryan Harris", "ReviewID": "R11JW74GC4HK2A", "Overall": "3.0", "Content": "Everything worked great on the tablet but the mic, i ordered two one from a different seller and this one. The pink one i ordered for my daughter's birthday worked great. The main reason of purchase was to skype with her. Given this ones mic did not work or at least it did not on skype, i sent it back. prior to, I checked all the settings and could not locate anything that would cause interference from the tablet and the program. The two tablets were suppose to be the same as well, but seemed the pink one had a different/newer desk top, even though they were both listed as the same product with the same system.", "Title": "Good first tablet", "Date": "May 14, 2013"}, {"Author": "Babsy 314", "ReviewID": "R18C2NP5F9H7ZQ", "Overall": "1.0", "Content": "I purchased this tablet 4/9/13 and received it in early May.  It did not arrive in a timely manner in my opinion. The tablet that I received (I ordered two) loaded the wi-fi easily enough but the charger cord did not work after three charges and usb port did not work after the second plug in.  Yes, I opened it and saw that the port wasn't connected.  Then the tablet no longer accessed the wi-fi so I could not connect to the internet.  Because both tablets have been used and neither one works, I am stuck paying over $150.00 for items that do not work.  I have a few items that require a usb plug in and haven't had a problem at all with them. Maybe I got a lemon but either way, I will not order electronics from Amazon any more because the return policy is to restricted.", "Title": "CHEAP JUNK - NOT A HAPPY CAMPER", "Date": "May 13, 2013"}, {"Author": "Yecenia", "ReviewID": "R19O6756I5M3UV", "Overall": "2.0", "Content": "i just got my tablet on time and everything was fine but now its not working after 1 month of using it '-'", "Title": "its not worth it at all", "Date": "May 13, 2013"}, {"Author": "Big Boy", "ReviewID": "R3JBZQED8B92CJ", "Overall": "2.0", "Content": "I purchased 5 of these for my girls within a week 3 of them had technical problemsIf you can afford better go ahead and buy better", "Title": "You get what you pay for These zeepads are junk", "Date": "May 13, 2013"}, {"Author": "Linda Samplawski \"OzarkRoze\"", "ReviewID": "RT6MK31QUR337", "Overall": "1.0", "Content": "I bought two for my daughter and myself.  Mine quit working the second day I used it.  Wasn't happy at all.", "Title": "Horrible", "Date": "May 12, 2013"}, {"Author": "Nyah W.", "ReviewID": "R3EKBO1RNP82J8", "Overall": "4.0", "Content": "DO I need to buy an SD for the \"Zeepad Tablet\" or do I need to buy one by itself? The \"Zeeped Table\" is great I play on my cousins. LOVED IT!!!!", "Title": "DO I NEED ONE?", "Date": "May 12, 2013"}, {"Author": "tamara", "ReviewID": "R2T6IAB3QR2DCM", "Overall": "5.0", "Content": "Yes it  works great my kids play with it everyday and just love it. The apps that r already o it are great", "Title": "yes we love our red zeepad", "Date": "May 11, 2013"}, {"Author": "meshop2", "ReviewID": "R35MCJ5JDMGIAG", "Overall": "2.0", "Content": "This is a purchase I regret making.  It has many issues- including disconnecting from the internet, screen freezing up, slow to respond to a command.  Sometimes it won't turn on or off.  Also the front screen is plastic.  It came scratched and since then has bubbled up in places.  Very cheap.  I guess you get what you pay for.  I would not recommend this Zeepad to anyone.", "Title": "Make a different purchase", "Date": "April 23, 2013"}, {"Author": "shell \"urs truly,chele\"", "ReviewID": "R32YMY5PEH2FKB", "Overall": "5.0", "Content": "I just received my zeepad everything was in perfect condition.....the seller packaged my product very good and kept me happy this is a nice tablet ..there's a lot of people saying negative things about the product even though mines came from china everything is excellent so far....", "Title": "Excellent", "Date": "April 15, 2013"}, {"Author": "Thomas L. Cole", "ReviewID": "R2VG3DBEMK67GC", "Overall": "5.0", "Content": "I purchased this tablet for my 18 year old daughter who likes it very much. It can Skype and works with Google Play so you can get new apps. She uses it as an ereader and for chatting with friends. In all it is a nice tablet, comfortable in your hands, is very thin and has a good picture. The battery life is not as good as high end tablets about 4 hours of use but, is better than expected for the price of the tablet. I did not expect it to be this nice of a tablet and have been very surprised with its performance. She has not used it for watching movies yet but it works well for checking email and weather when you are in a hurry", "Title": "Not a bad Tab", "Date": "April 6, 2013"}, {"Author": "mamajpo", "ReviewID": "R3D8T8WWQ5QB1T", "Overall": "4.0", "Content": "Google Play is a added plus to this inexpensive tablet. Took awhile for shipping but it was international and came few days earlier than estimated date. The outter shell seems a bit cheep but no problems so far..2 weeks into", "Title": "So far So good!", "Date": "April 3, 2013"}, {"Author": "chris walker", "ReviewID": "R34RZUBLIMUW2V", "Overall": "5.0", "Content": "I LIKED THID ITEM BECAUSE IT WAS EASY TO USE AND EASY TO DOWNLOAD GAMES AND MUSIC TO. IT IS VERY KID FRIENDLY AND I WOULD RECOMMEND THIS ITEM TO ANOTHER PARENT FOR THEIR CHILDREN", "Title": "VERY NICE (CHEAPER THAN IPAD) GIFT FOR KIDS", "Date": "April 2, 2013"}, {"Author": "Nia", "ReviewID": "R30VOFR8N54Q8U", "Overall": "2.0", "Content": "Crappy battery life. Screen keeps going all white even when not in use. Slow to download and launch web. Not a happy buyer.", "Title": "Never Again!", "Date": "April 2, 2013"}, {"Author": "trino", "ReviewID": "R22JYYTEZYVXVV", "Overall": "2.0", "Content": "Screen keep blacking on and off and while playing a game it don't even show the whole board..could barely hear any sound coming from it", "Title": "zeepad", "Date": "April 2, 2013"}, {"Author": "rickangabi", "ReviewID": "RNLTO0G135T8Q", "Overall": "1.0", "Content": "Bought two of these things for my twin boys birthday, complete pieces of junk.  Touch screen is not very responsive, keyboard attachment port wore out within days. All little electronic devices are going to get dropped eventually, one of ours fell out of the keyboard/case we bought, the unit fell right apart, not durable what so ever, buttons fell out and when put back together no longer worked.  There are issues with the google play store app. and one of them is stuck on the Android start up screen.  What a waste of money.  Beware, check to see if they have a warranty before purchasing.", "Title": "Very Fragile, Very Poor Quality, Piece of Junk", "Date": "April 1, 2013"}, {"Author": "kori Hensen", "ReviewID": "R33U3A8W0VOZFO", "Overall": "1.0", "Content": "We just wanted an inexpensive tablet for a family member.  We already own a very nice tablet so just needed an extra.  We did not expect much, but we did expect it to work.  The cords did not fit properly, the tablet was unable to turn on after charging.  What a big waste of 76 dollars.  The company that sent it did not have very good packaging, poor customer service, etc.  will not purchase from this company or Amazon ever again!!  Buyers beware!  We are shipping back (which we have to pay for) what a horrible experience.", "Title": "Very cheap, arrived not working, defective equipment", "Date": "April 1, 2013"}, {"Author": "Patricia Moorman", "ReviewID": "R35QJ3ONJSUJD9", "Overall": "5.0", "Content": "I consider it money well spent, it is very easy to take it with me everywhere I go. great buy", "Title": "great little tablet for the price", "Date": "February 27, 2013"}, {"Author": "Jnicole", "ReviewID": "RJC9VH6AGSF7L", "Overall": "5.0", "Content": "Love this product, great for the price! Product came early and works perfectly. Just make sure you charge it, only thing is it loses battery but I mean what product doesn't!? Just make sure you have charger handy and you are good to go! Apps are easy to use and download, customization, setting changes are simple and maneuvering everything is on simple task as well", "Title": "Excellent", "Date": "February 7, 2013"}, {"Author": "Richard M. Wood", "ReviewID": "RKVM8BVQFCLRD", "Overall": "1.0", "Content": "You try to go cheap but not always win. Garbage right out of the box, through and through in every function. You will lose your money here and the Seller blows you off. I now have a claim with Amazon (big hassle) begging for my money back. Meanwhile appeased my son with a nicely priced used Kindle Fire which he loves. Imagine what I could have bought him if I put all those dollars together! You live and you learn. Very proud of my son for being patient through the process.", "Title": "100% Garbage. Buy a used Kindle Fire or similar to save money before considering this", "Date": "February 6, 2013"}, {"Author": "Amy", "ReviewID": "R6R8DHADP1SP8", "Overall": "2.0", "Content": "Product seemed ok upon arrival but quickly had issues with dead spots on screen and freezing up a lot. Had great hopes for it but that excitement died down quickly.", "Title": "excitement died quickly", "Date": "January 23, 2013"}, {"Author": "trudy carey", "ReviewID": "R38F4IP0R9YR1J", "Overall": "4.0", "Content": "Got these for my grandsons at Christmas. I didn't want to buy a high dollar one due to their ages. They love them! One of the boys dropped his while charging and it did not break! A adult might want something more but for the price..this one is great!", "Title": "Bought two of them", "Date": "January 23, 2013"}, {"Author": "A.Sellhausen", "ReviewID": "R391TO3T7KXXT3", "Overall": "3.0", "Content": "I bought the tablet for my boyfriend for Christmas. i was disappointed the only way to get sound was to use earphones. We didnt find out right away. Other than that you get what you pay for. He likes it but i will buy a better one later on.", "Title": "Cheap", "Date": "January 22, 2013"}, {"Author": "Pen Name", "ReviewID": "R2P8TBTQ5XY27B", "Overall": "3.0", "Content": "I brought this for my daughter it's a great price and I loved everything that came worth it but it would not let me connect to the internet w/wifi. The wifi button was defected b/c it froze and i couldn't do anything.", "Title": "GREAT FOR KIDS", "Date": "January 21, 2013"}, {"Author": "Jon Gold", "ReviewID": "R26N60WW89YC81", "Overall": "1.0", "Content": "I didn't even get it this guy rips you off. Don't get it I'm telling you. Don't fall for what I did.", "Title": "Sucks", "Date": "January 21, 2013"}, {"Author": "Pen Name", "ReviewID": "R3BYPG7ASL6NV4", "Overall": "4.0", "Content": "The first one I received was DOA. It only worked for the first 8 min and then came back on again. I had to return it back to get a new one. The second one works great and I haven't had any problems with.", "Title": "Zeepad review", "Date": "January 19, 2013"}, {"Author": "Shavon Mo", "ReviewID": "R11SSS2AFLNEWA", "Overall": "4.0", "Content": "My baby sister can't get enough of it.... all she wants to do is play on her tablet. So its very good", "Title": "nice", "Date": "January 19, 2013"}, {"Author": "shakur", "ReviewID": "RDPEZVB4KWDSQ", "Overall": "1.0", "Content": "I ordered the zeepad paid 94.00 and git a 49.00 cheap no name android tablet from somewhere in China with instructions written in Chinese. So disappointed! My rating is 0 stars til I get the correct tablet!", "Title": "wrong tablet", "Date": "January 18, 2013"}, {"Author": "lisa walker", "ReviewID": "R222KRNS6R7N43", "Overall": "1.0", "Content": "So far we've had difficulty with every task: downloading games, netflix, setting up email, getting it to charge...everything. It's been a headache.", "Title": "Many problems", "Date": "January 18, 2013"}, {"Author": "michelle drabek \"momof3_theyremyworld\"", "ReviewID": "RBJLE8597Q5IX", "Overall": "5.0", "Content": "Bought this for my 7 year old... A GREAT PLUS is that it came with Google Play, so we can download all her favorite games and find new favorites!  This tablet is darker than it looks, it's more of a hot pink (deeper in color)...which is perfect for my daughter!!", "Title": "a great tablet!!!", "Date": "January 18, 2013"}, {"Author": "Tweety", "ReviewID": "R3KPN0HYVV64O2", "Overall": "4.0", "Content": "The tablet works great! Value for the money is totally there. Works as good if not better than the name brand tablets. Only reason I did not give 5stars is because unpaid extra $22 shipping and it was 2days later than expected arrival. Thank God it made it before Christmas!", "Title": "Awesome tablet", "Date": "January 16, 2013"}, {"Author": "Steph73", "ReviewID": "R1OVDIYN03F15F", "Overall": "5.0", "Content": "I got this zeepad for my daughter. I was a little worried about how it was compared to other tablets, but it turned out to be the best investment I made. It has so many features on it for adults too. I love the apps.", "Title": "Best gift", "Date": "January 16, 2013"}, {"Author": "tykeisha", "ReviewID": "RMG7Y4QILXOC1", "Overall": "4.0", "Content": "i love this tablet i bought it for my four year old daughter and she loves it.  I would recommend anyone to get this tablet especially if you want something small and cute to do all your little internet tasks.", "Title": "i love it", "Date": "January 16, 2013"}, {"Author": "Terri Metcalf \"one happy mom\"", "ReviewID": "R3CCHQY0G1T61F", "Overall": "4.0", "Content": "I bought a Zeepad for my 5 year old for Christmas. So far, she loves it and it keeps her off my phone! I wish it were a little faster, but that could also have something to do with my internet speed.  It is certainly worth the low price I paid for it.  She loves the pink color too!", "Title": "Good value for price", "Date": "January 16, 2013"}, {"Author": "DARWISHA RUSH", "ReviewID": "RVDODAFD42TMQ", "Overall": "1.0", "Content": "I RECEIVED THIS ITEM BROKEN/IT IS IN TRANSIT COMING BACK. THE ON AND OFF BUTTON KEEPS GOING DOWN INTO THE TABLET AND ONE OTHER BUTTON IS OFF COMPLETELY. MY DAUGHTER DID NOT ENJOY HER CHRISTMAS. SO, IF SHE IS MAD, SO AM I.", "Title": "I RECEIVED THIS ITEM BROKEN/IT IS IN TRANSIT COMING BACK", "Date": "January 16, 2013"}, {"Author": "jodee", "ReviewID": "R3C43M0610OF9P", "Overall": "5.0", "Content": "everything i expected n more still learning all features love it want another one  it is evev kid friendly great deal also 4 price", "Title": "super deal", "Date": "January 16, 2013"}, {"Author": "jessica", "ReviewID": "R14SD0YKMVM9W1", "Overall": "4.0", "Content": "My son loves it and all the apps that he can get helps him learn a lot of cool stuff. A good bargain tablet for a 4 yr old.", "Title": "ZEEPPAD is pretty good for an affodable tablet", "Date": "January 15, 2013"}, {"Author": "celestialbev", "ReviewID": "R3NPHS6E56ZSYZ", "Overall": "4.0", "Content": "I really liked all the accessories that came with this product and the price was great. The tablet comes with access to Google Play, a definite bonus. My kid loves the color. Here is what irritated me to no end. The enclosed stylus had rough spots on the barrel and scratched the screen, then the screen saver. Thankfully, the scratch is small and I don't think we have ever had a touch screen without a scratch, but I was irritated that it was enclosed and of poor quality. I quickly bough new styluses for the tablet and all is well now. The table is working out wonderfully for my child and you can expand the memory with a MicroSD card, a real bonus in the realm of budget tablets. I recommend it. Just check out the end of the stylus before you let your kid use it ;)", "Title": "Good tablet", "Date": "January 8, 2013"}, {"Author": "PhilMo", "ReviewID": "R3PGCDUD5S0CX", "Overall": "1.0", "Content": "I know you get what you pay for but I expected it to at least be useable. The charger fell apart the first day. Within a week it no longer could stay charged. The only way to use it was to have it connected to a power supply. It kept switching back to what I think was Japanese. It wouldn't remember the WIFI so we had to set it up at least once a week. It is very slow to respond when you touch the screen. It feels so cheap that I was afraid it would snap in half. Please stay away from the horrible device. Its so bad, I wouldn't pay $15 for it.", "Title": "This is the worst product I have ever purchased", "Date": "January 28, 2013"}, {"Author": "Tobi", "ReviewID": "R1XW0UTY5X4B9B", "Overall": "1.0", "Content": "Purchased for a Christmas gift to my 10 year old. Worked well for the first day. On day 2, the screen had lines running across it. Also, the screen began to flash while using this item. So, unfortunately, I sent it back right away. This left my son with no tablet until I could return this one and purchase another brand. But, the customer service was wonderful.", "Title": "Terrible product! Great customer service!", "Date": "January 27, 2013"}], "ProductInfo": {"Price": "$89.99", "ProductID": "B00DCE8JFY", "Features": "ZEEPAD 7.0 Android 4.2 Tablet PC, Capacitive Touch Screen\nBoxchip A13 1.2GHz Cortex A8, 4GB Drive (2.8GB Avail), TF card support up to 32GB  512MB RAM\nWi-Fi, Gryoscope, Accelerometer, Dual Front & Rear Facing Cameras\nGoogle Play Store, Skype Video Calling, Netflix Movies, eReader, Games etc    Super-Thin & Super-Light", "ImgURL": "http://ecx.images-amazon.com/images/I/31QI0VmbDYL._SX300_.jpg", "Name": "7\" Zeepad 7.0 Allwinnwer A13 Boxchip Cortex A8 Android 4.2, 4GB Capacity, 512 MB RAM, Multiple Touch Capactive screen, WIFI, Camera, Skype Video Calling, Netflix Movies. (7'' Dual Camera, Cobalt Blue)"}}