{"Reviews": [{"Title": "Best Value", "Author": "Consumer, Frisco TX", "ReviewID": "RHBN44HYRTU1Q", "Overall": "5.0", "Content": "Compare tablets of this size to any other tablet on the market.  The fact that it has Google Play loaded, display is crisp and processing power is excellent, make this a best buy for the price.  Packaging is typically plain brown box so gift givers will have to be creative.An excellent buy!", "Date": "October 28, 2013"}, {"Title": "Good so far!", "Author": "kojak", "ReviewID": "R1ZIE1X2U8WF4", "Overall": "4.0", "Content": "Wish there had been an owner's manual with it. But received it in good condition, and a week after I ordered it. Still learning how to use it but fairly simple for someone familiar to computers.Love the picture, but camera is kind of weak. But overall a great deal!", "Date": "November 18, 2013"}, {"Title": "SVP 10\" is a cheap build", "Author": "stephen j griffin", "ReviewID": "R3ICZ2ZF1PI6IF", "Overall": "2.0", "Content": "it's a cheap build, not to mention that it doesn't seem to update it's software and THE MOST DISAPPOINTING ASPECT IS THAT IT DOESN'T SUPPORT BATTERY RECHARGE VIA IT'S USB PORT (REQUIRES THE USE OF A POWER ADAPTER USING AC)", "Date": "October 5, 2013"}, {"Title": "Great tab", "Author": "Cat", "ReviewID": "R370P7HYGXKOHK", "Overall": "5.0", "Content": "Wonderful tablet it works well for me and family ,we use it all day long no regrets.I would recommended it to any one on the go to do anything .", "Date": "January 25, 2014"}, {"Title": "SVP 10\" Android tablet", "Author": "wilma gooch", "ReviewID": "R2FZXYQI6B6JN6", "Overall": "5.0", "Content": "I am VERY happy with my new tablet, works great...just what I needed---delivery was very fast, would recommend it to anyone.", "Date": "January 4, 2014"}, {"Title": "SVP - meets my expectations", "Author": "Bruno Pletscher", "ReviewID": "R2DYAD6I7R5VR1", "Overall": "4.0", "Content": "I was asked for a report - I have chosen this product as the price was very attractive and it works out to be worth it", "Date": "December 18, 2013"}, {"Title": "Doesnt play websites or games built in flash.", "Author": "Dereck M.", "ReviewID": "R20R5ABSO4OLAY", "Overall": "3.0", "Content": "Seems to run kinda slow and it wont play anything that is built in flash. I found out how to manually install flash on the device and now it will play flash movies and games but it seems to always crash. According to my research that google isnt putting flash on there new andriod devices so you have to manually install it. Just go to the google store and type flash install and then have google play install it.You should be able to play flash after that.", "Date": "November 21, 2013"}, {"Title": "Awesome product", "Author": "Waisea", "ReviewID": "R2N144UVKTPK7U", "Overall": "5.0", "Content": "It was working really good but than the screen broke, so i am going to order a new one or used one.", "Date": "February 26, 2014"}, {"Title": "JUNK", "Author": "Anthony stanek", "ReviewID": "RV9XGFUJRQYN1", "Overall": "1.0", "Content": "ck money PLEASE..THIS IS TOO DIFFICULT....SCREEN WAS BROKE...SHUT OFF AND ON REPEEDEDLY WITHOUT ANY REASON  Basicallly just a shotty piece of morkman", "Date": "January 5, 2014"}, {"Title": "very satisfied.", "Author": "lymarie", "ReviewID": "RX3ZJF3D0NNM9", "Overall": "4.0", "Content": "A wonderful affordable price. Works very good.  I have a 7in tablet but had been longing for a 10in but there was no way I was going to go broke buying a IPad.  name brands i don't care for.  The feature of google play was a must and plus. The only set back is I can not charge using usb. but other wise is very good.", "Date": "December 22, 2013"}], "ProductInfo": {"Price": "$99.99", "Features": "Supports Google Play Store, Skype, Netflix, YouTube, and more!\nAndroid 4.1 OS ; Supports Flash, Wifi, and videos\nCPU;RK2928 Cortex-A9, 1.2GHz\nMP3,WMA,MP2,OGG,AAC,M4A,MA4,FLAC,APE,3GP,WAV\n(Support 1080P) AVI（H.264, DIVX, DIVX, XVID, rm, rmvb,  MKV（H.264, DIVX, DIVX, XVID), WMV, MOV, MP4（H.264, MPEG, DIVX, XVID), MPEG, MPG, FLV（H.263，H.264)", "Name": "SVP® 10\" Android 4.1 Capacitive Touchscreen Tablet (Features Google Play Store, Skype, YouTube, Netflix, Camera, Wifi, and G-Sensor!", "ImgURL": "http://ecx.images-amazon.com/images/I/51UvvPNDLyL._SX300_.jpg", "ProductID": "B00DBJCI34"}}