{"Reviews": [{"Author": "AM", "ReviewID": "RPP3CYBAQM3AB", "Overall": "1.0", "Content": "I saw only good reviews for this product and I thought it was a reasonable price, so I purchased it. I was really excited the day that it came in the mail. Everything was there and I got ready to charge the tablet for the recommended 8 hours before the first use. The AC adapter was very small and thin. I was worried that it would break when I tried to insert it. When the 8 hours were over, I turned the tablet on and used it for a few minutes. It lagged terribly and had only charged to 80%. After 2 days of charging my tablet had still not charged fully. It actually appeared to loose it's charge while I had it plugged in. It also started to make a crackling noise. The small manual is written in broken English and I was unable to find any support for this product online. I was really disappointed and contacted the seller to send it back and get a refund. The seller was nice and helpful. BEWARE though, there is a 15% restocking fee that I was charged. The seller did not inform me of the fee until after the product was returned. So, you will lose money if you return it. :-(", "Title": "Disappointed.", "Date": "October 22, 2013"}, {"Author": "sparrow", "ReviewID": "R55IR0BAM163J", "Overall": "5.0", "Content": "Great for kids! This tablet was affordable & comes with a stylus pen (great for drawing apps). I have owned many tablets all of which have broken in the hands of a child. Buying cheap only resulted in a poor quality product with the cheap version googleplay. This product is well worth the cost!!!", "Title": "Great for kids!", "Date": "October 13, 2013"}, {"Author": "joel cadogan", "ReviewID": "R1O9RCO5IASUUB", "Overall": "5.0", "Content": "works great for the price and its really quick also. its pretty light weight not very bulky. really like how it came with a screen protector and a stylus.", "Title": "tablet", "Date": "September 17, 2013"}, {"Author": "PK", "ReviewID": "R5UH3DATCJFWG", "Overall": "5.0", "Content": "This product is worth buying at a very good price like this and 2160p HD is amazing, I have ever seen", "Title": "Tablet at a real affordable price", "Date": "September 8, 2013"}, {"Author": "Pearlbird \"Online shopper\"", "ReviewID": "R2XEK35UMVYZ2S", "Overall": "5.0", "Content": "Good tablet. Compact but very efficient and works well for email and Internet. Came in box with all accessories. Would recommend.", "Title": "Love it", "Date": "September 5, 2013"}, {"Author": "Rafael Gomez", "ReviewID": "R1LCR0VOGTNWB6", "Overall": "5.0", "Content": "I have used other products like this one before and i have to admit this one is the better i've had .It has a good system,it works great and amazon even offers you extra things for your tablet .Everything works great on it ,all the apps work perfectly and everything else.In my opinion it's a great product and it has a great prize and quality", "Title": "A perfect product", "Date": "September 24, 2013"}, {"Author": "Michael R. Curry \"Tenacious--M\"", "ReviewID": "R37D00S9LHSSM1", "Overall": "5.0", "Content": "I bought one of these for each of my three daughters.  I figured they would be very laggy and slow, but might work ok for them.  To my surprise this little tablet is great.  Still a bit slow for real techie folks, but for kids or adults just getting into it, this is a steal!!!The thing I like the most about this tablet besides the price is it has all the options:1.  Front Camera2.  Rear Camera3.  Dual core processor4.  Memory card expansion slot - MUST HAVE5.  WIFI6.  Comes in many different colorsBuy this little tablet with confidence!  You wont be dissapointed.", "Title": "Android Tablet for this price...sucks right?  WRONG!!!", "Date": "January 31, 2014"}, {"Author": "K.H Allen", "ReviewID": "R3ALFBKX64QURM", "Overall": "2.0", "Content": "the picture quality is actually very poor, can't access the bluetooth setting and the tablet takes forever to turn on. it was given two star because its sturdy and has more internal memory than my other tablet.", "Title": "Very disappointed", "Date": "December 31, 2013"}, {"Author": "JOSH L", "ReviewID": "R3K2J9BC9Y8J1U", "Overall": "5.0", "Content": "nice and really easy to use, came with alot of accessories in the box, i really love this product, good to play games and check all my emails while im sitting on the sofa. great resolution and preloaded games come on it.", "Title": "love it, great buy", "Date": "August 19, 2013"}, {"Author": "bridge", "ReviewID": "R5S59BFU0N5FY", "Overall": "2.0", "Content": "This is a really bad excuse for a tablet. It lags so terribly and not to mention the camera.quality is horrible! They day it came the sender wrote a seperate note with instructions on how to use, and in addition wrote to not leave any bad reviews on Amazon. I do not recommend this tablet at all. Invest in a good one!", "Title": "just wasted money", "Date": "November 8, 2013"}, {"Author": "melissa nielsen", "ReviewID": "R1XIYHM5WR23PP", "Overall": "5.0", "Content": "Great product.  Great memory for the price -and the accessories that are included.  Researched and had the strongest reviews for an item in this price range.", "Title": "Great purchase", "Date": "November 27, 2013"}, {"Author": "Mollie", "ReviewID": "R1AZWJWWLEO5M1", "Overall": "5.0", "Content": "I Love my android tablet its fast . I Love the camera. u can zoom in and out . I think its fast And the screen is fast to used . recommend it to any buyers. Awesome!! Glad I got this one . its light weight . it has apps that goes with it like Facebook and more and flip it .", "Title": "its great", "Date": "November 13, 2013"}, {"Author": "gary cleveland", "ReviewID": "R2HT05QMTQL3I9", "Overall": "5.0", "Content": "Everything is as it should be.  No complaints. Bought this for my wife and I am always borrowing from her!", "Title": "Happy!", "Date": "October 23, 2013"}, {"Author": "Brian Mott", "ReviewID": "R29YE3FMWOWE4D", "Overall": "5.0", "Content": "It is a good budget tablet.  It works as it is supposed to and is good for the budget minded person.", "Title": "Good budget tablet", "Date": "October 22, 2013"}, {"Author": "marcelo", "ReviewID": "R1DB026AGLKWVS", "Overall": "5.0", "Content": "Its a fast and realible tablet. It works very well and have a great screen. The resolution is good .Perfect", "Title": "outstanding tablet", "Date": "October 19, 2013"}, {"Author": "troutlady", "ReviewID": "R1F0ZB9IGJRXMP", "Overall": "4.0", "Content": "This tablet is good for the price. I bought it for my young grandson but I'm concerned he'll break it so my daughter was happy to have this little portable tablet. 8gb will allow her to watch movies and play games.", "Title": "Good for the price", "Date": "October 24, 2013"}, {"Author": "Mr D", "ReviewID": "R36KSKFQIAGZMW", "Overall": "5.0", "Content": "So far so good. It's my first tablet and for the price it works great. Don't really have any complaints so far. Only thing I'm having a prob with is accessing it via my desktop with the usb cable. Recognizes it but it seems i need some drivers...", "Title": "Works Great", "Date": "October 18, 2013"}, {"Author": "Andresa", "ReviewID": "R3JVWH9UF4RENP", "Overall": "1.0", "Content": "Would give ZERO STARS but that's not an option.I want a refund. Point blank. I literally wait over 5 minutes for everything to load: Internet, apps, main home page! It's ridiculous. And it's not my internet service because my other gadgets operate fine.This tablet is trash and these other reviews are VERY MISLEADING and SOLICITED BY THE SELLER.I bought my daughter a $60 tablet by another company and it is twice as fast and we have no problems. This is terrible even for its price point. I'm very disappointed and upset I spent my money on thisHow do I send this CRAP BACK!? for a FULL REFUND?", "Title": "Piece of shii. Do NOT WASTE YOUR MONEY", "Date": "October 22, 2013"}, {"Author": "L. Rivera", "ReviewID": "R3AIZEXNDJAI56", "Overall": "4.0", "Content": "We ordered 2. 1 works perfectly, the other had some issues. The mm Jack port won't work, but the mini usb port works fine. Random issue with the screen. It turns gray with horizontal lines across the screen. Like a channel on tv you can almost see but haven't subscribed to. If I put pressure on corner where faulty port is the screen clears normal. When I release pressure the gray returns.Seller has offered replacement. In process of submitting request now. Hoping next tablet will be as perfect as our other one!The good one is fast, clear, handles games efficiently and has loads of storage! We also use 16gb micro sd card. We install clean master to help keep the tablet running smooth. Many times the tablet slows because there is too much memory taken by cache. So far clean master is our favorite to keep this tablet fast.Pic and video quality are as others have stated, pretty poor. Video is very choppy and not bright indoors. The sound capture leaves a lot to be desired as well.If you are getting this for web surfing, playing videos, watching tv, playing games or checking email, in my opinion it's perfect. If you want a good camera, get a camera.=-)", "Title": "50/50", "Date": "February 5, 2014"}, {"Author": "Angie Staten", "ReviewID": "RLEN4EUJ5I41N", "Overall": "4.0", "Content": "My daughter loves it,  she says it doesn't get hot nor freezes up, she loves it. Able to download games with ease", "Title": "xmas gift", "Date": "January 6, 2014"}, {"Author": "kimberly wilson", "ReviewID": "RXI5QKE7V65NK", "Overall": "5.0", "Content": "This tablet is great for the money. Fast internet, clear screen, great picture, I would recommend this as a christmas gift for any age.", "Title": "Fast internet, clear screen, made great, fast shipping", "Date": "December 6, 2013"}, {"Author": "Kachuck", "ReviewID": "R2VJHIEKLSXQ4J", "Overall": "4.0", "Content": "It is a gift for a family member. It appears to function as advertised. Have not used it as my own but have loaded apps onto it and took it for a test drive. It seems to run fine for android games such as Sudoku, angry birds, pool. I usually plug in my battery equipped items such as laptops etc. This gets at least a couple of hours of battery life when I did have it unplugged.", "Title": "Good", "Date": "December 4, 2013"}, {"Author": "amb", "ReviewID": "R35OU6VZJJGHCD", "Overall": "1.0", "Content": "Charger doesn't work. Tough to tell if its wifi issues with my system, found out it isn't. Slow and not worth the price even thought it was cheap.", "Title": "Do not waste your time", "Date": "November 10, 2013"}, {"Author": "Brittiny R", "ReviewID": "RXF8VRM254S5A", "Overall": "5.0", "Content": "I bought this tablet because the one I had previously was difficult to use. You had to stab the screen repeatedly in order to be able to click on anything. This tablet is much easier to use. Its light weight and you barely have to touch the screen for it to work. Not to mention, I love how it has google play so I can get the same apps on my tablet that I have on my phone.", "Title": "highly recommend", "Date": "October 22, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00DR3ZE12", "Features": null, "ImgURL": null, "Name": null}}