{"Reviews": [{"Author": "Amazon Customer", "ReviewID": "R35PIRFAJ4FCTI", "Overall": "5.0", "Content": "I have used this tablet for 6 weeks now.  The setup time from the box to working was less than 10 minutes.  Every App that I have downloaded works well. It boots fast and the response on my wireless network is the same as I experience with my HP laptop. Screens render fast; almost instantaneously.I was a little hesitant on purchasing reading the negative reviews. From my research before purchasing, some of the issues I decided are operator related. For example, when  plugging in the charge cord, the tablets starts up. That is common with Android devices; it works the same way with my Nook.I cannot see any practical difference compared to an iPad other than price. In fact, the screen resolution is better on the Dragon tablet.  Overall, it exceeds my expectations as a generic tablet in lieu of purchasing an iPad. I would highly recommend this tablet to anyone.If you decide to buy, make sure to purchase the tablet with the 4.2 Jelly Bean OS and not an earlier version. The earlier OS versions may be problematic.", "Title": "EXCELLENT VALUE", "Date": "February 10, 2014"}, {"Author": "J. F. KIRKPATRICK Jr.", "ReviewID": "R1A3ZGUA61N27D", "Overall": "5.0", "Content": "As benchmarks I have a Samsung Note 10.1 and a gen 1  Ipad.The Dragon Touch has the best screen...more brilliant colors...retina resolution.The side facing stereo speakers are better than the mono IPAD but not as loud as the Samsung's front facing speakers.The Wifi radio picks up distant routers the others just don't see.  Downloads are noticably faster in marginal areas.Its generally faster...19,000 Antutu vs. 17,900 for Samsung.Battery life seems to be 7 hours give or take.Mine showed Jelly Bean 4.2.2 with an August, 2013 date. .APPS run smoothly...Pandora, Kimble, Playstore, etc.The custom case leaves access to all ports and buttons.", "Title": "FAST, GOOD WIFI RADIO, BRILLIANT SCREEN, JELLY BEAN", "Date": "November 28, 2013"}, {"Author": "melvin davis", "ReviewID": "R1R7M9C74ZCSG9", "Overall": "4.0", "Content": "i am getting used to it. But I must say that the wi-fi is very weak indeed.They could do better. Also the camera at 2.0 front and back could be left off completely.I compensated for the camera because I use a Kodak and Nikon digital . I bought this to replace a 7\" ainol basic which was ok,but did not have gorrilla glass and got broken. Its all about price. Where is the customer support ? This tablet has so much that you need a work shop and /or a phone no.from the manufacturer to make full use of it.", "Title": "jelly bean tablet support", "Date": "August 24, 2013"}, {"Author": "Cool Sailor", "ReviewID": "RINW5CI0EJ1GG", "Overall": "5.0", "Content": "After waiting some time for it to come out, in the first week of August I ordered a Nexus 7 (2013) directly from Google. Unfortunately, the first Nexus 7 that I received suffered from freezing and shutting down issues, as did the next two replacements. I finally received a refund last week. The whole process was time consuming and tied up my money for almost 2 1/2 months. Now the dilemma as to what to order next... I looked through what Amazon has to offer and found the Dragon Touch 9.7 with its' high resolution. The price was right - same price as the Nexus 7 and with a larger screen. So, after much deliberation, I decided to order one and received it in just two days.The Dragon Touch now comes with Android 4.2 already loaded! The tablet operated perfectly right out of the box (great packaging). I have downloaded several apps now (including Kindle Books) - everything, including games, run great - fast / no lags. The sound from the single speaker is loud enough... just not stereo (the Dragon Touch 9.7 comes with ear buds which are good). Its' camera takes acceptable pictures. It is a well built tablet and easy to use (basically same screen set up as the Nexus 7). The case fits well too. I am very pleased to finally have a tablet that works!!!", "Title": "Dragon Touch 9.7 now comes loaded with Android 4.2", "Date": "October 16, 2013"}, {"Author": "JR Brown \"Buckstar\"", "ReviewID": "R39FZ7C4GB0ZWW", "Overall": "2.0", "Content": "I was happy with the product for the first week.Then I started downloading more apps & I noticed the performance significantly slow down, to the point where I no longer wanted to use the device.  I put it away & stopped using it.I began using the device again as an e-reader on a cross-country road trip.  However, the power button broke so I cannot turn on the device.  When I tried to contact them through Amazon company's response was that it was past the return/service period.  This was less than 4 months after purchasing the device.Overall, the specs were good.  However, it appears as if they have taken some shortcuts on quality and service and it really shows.  I wish I would have paid for a better tablet because now I just have a piece of garbage.", "Title": "Not great", "Date": "November 11, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1MJLNGJGHX20W", "Overall": "5.0", "Content": "First, I'm comparing this tablet to a Kindle Fire Happy. The Dragon Touch screen is quite comparable to the Kindle vivid colors, bright and quite smooth scrolling. Processor wise,  this is way faster and provides additional storage  (Kindle doesn't)  Wifi isn't up to the Kindle, it is not capable of seeing the 5 gigahertz frequencies nor does the Dragon have the better antenna. The sound of the Dragon is better than most tablets but isn't Dolby. Battery life is better than I anticipated. Google Apps work great and I have yet to find any of the any apps that don't work. Amazon's sensorship of apps does not come into play. I could continue on praises.The down side, so far my only complaints are with touch screen sensitivity and that Dragon Touch does not build auto brightness into their devices. Neither of these items deter significantly from my enjoyment of this tablet. If you take the differences in cost,  this device is well worth the investment.", "Title": "The Dragon Touch R97 Tablet", "Date": "January 2, 2014"}, {"Author": "lt_4ever", "ReviewID": "R14MBAXLTPHYDD", "Overall": "4.0", "Content": "I must say it was worth the money I've spent [bough mine for $217] At my purchased price, it beat all other brand name tablets with same system specs. I have it for 2 months and I am super happy with it :-) The only downside to this tablet is that it does not come with larger internal storage. with so many great game out there and 16gb does not hold much [A good game file is averaging 1gb] There are 32mb tablet with same system specs but the cost is $80 more, around $300 and that was too steep just for 16 more gbs. Also its camera are not so great, only 2MP. If you looking just for a tablet for browsing online + Game + Video [forget those brand name tablets which are overpriced] get this one. It is fast and retina display is amazing. Battery is great, last up to 8-10 hours of watching video or game play.For all Android device, I do highly recommend some best FREE useful apps from play store: [video player] Archos video player + Archos codecs [CLEAN & RAM BOOST] Clean Master from KS mobile. And last but not least, you also can make FREE UNLIMITED CALL within the US on any Android devices using WIFI by combining these two apps: Google Vocie + GrooVe IP Lite [google it]PS: The reason I give this tablet only 4 stars because I had it only for 2 months and I always reserve the last star for when this tablet quality & performance do surpass at least one year of usage.. Also if you gonna get it from else where, make sure the Android OS version is from 4.2 and up [Mine came with version 4.2.2] because I do see user reviews complaining of its performance when use with Android OS lower version.", "Title": "I am luving it :-)", "Date": "November 25, 2013"}, {"Author": "Craig R. Crabtree", "ReviewID": "RVEFQSL3I2U79", "Overall": "5.0", "Content": "I've used this thing a couple of weeks and it handles the video well, takes a 32gb micro SD card without a hitch, and lasts all day. 'No GPS and the wifi has trouble connecting every once in awhile. Still, the screen is beautiful, the motion sensor works, and the price is remarkable for what you get. It doesn't charge through the micro USB but its charger will quickly replenish it (a couple of hours max) even when I'm using the thing to watch a movie through the wifi. The back does get a little warm when I do both.NOTE: the screen resolution given is correct. However, Android uses a few rows at the bottom. Also, 4.2 is available on the TabletExpress website.", "Title": "Excellent Price/Performance ratio", "Date": "September 30, 2013"}, {"Author": "shopper", "ReviewID": "RXKAQ160Y05Z9", "Overall": "5.0", "Content": "Second Tablet I have purchase. I learn what to look for after purchase the first, can't bypass the learning curve. The Dragon Touch Tablet video is the about the best there is, looking at any angle give great picture not like my first tablet that you had to look at just certain angle to see the picture. For my use I didn't have any operational problems. Can't be more happy with product! Cost is about one hundred dollar less than any other tablet I could compare it to!", "Title": "Dragon Touch Tablet", "Date": "September 28, 2013"}, {"Author": "Robert Komisar", "ReviewID": "R2OZTUCHC46EF7", "Overall": "4.0", "Content": "Received this tablet last night and have spent most of this morning setting up.Build quality is quite strong for this price point and so far so good.This came to me with JB 4.2.2 installed and fully rooted which I did not expect.All apps running smooth so far except for DTV Geniego which says it won't run on a rooted device.Strange though since Sunday Ticket and DTV Everywhere are both running fine.Antutu scores are over 17,000 which seems pretty good. Email set up along with wi fi networks all loaded and set up automatically.I have ordered the micro HDMI cable and the USB OTG from Amazon a minute ago so we will see how all of this works but surprised with the quality so far.Highly recommend this purchase at this point in time.UPDATE: Received the OTG cable today from Amazon and it works like a champ. Easy plug and play since all I did was insert the micro into the micro input, plugged in a flash drive and VIOLA it worked!Went into settings and mounted the USB storage and the tablet recognized the drive right away.I am a little confused by the HDMI Micro cable that I purchased since it states that it has Ethernet but I am not clear as to what do they mean exactly?UPDATE: Well now that a little time has passed the tablet is beginning to lag once more apps are loaded.The sound levels on this are terrible and I have tried to boost the volume but no real improvement with Volume Boosters from the market.The touch screen sounds are just about non existent and the music and video playback volume is terrible.This is beginning to lose it's shine.UPDATE: So Tablet Express has instructed me to reload the software from their site in order to fix any problems.Their severs will not provide the download and the customer service phone line goes unanswered.Amazon are you there to resolve??", "Title": "New Android Tablet Purchase from Amazon", "Date": "November 21, 2013"}, {"Author": "JPhill", "ReviewID": "R2HFJEOBG8DDGA", "Overall": "4.0", "Content": "I've been doing the third party shuffle trying to find myself a quality tablet without paying AAA brand premium mark-ups. I've only had the tablet a day but I am blown away by the craftsmanship. The tablet has a steel frame and back. It's about half an inch thick and the supporting frame is also steel! The touch screen is protected initially by a frame with helpful gesture instructions along with warranty/ replacement fulfillment information.  The speakers for this unit are located on the sides of the unit which is great because it allows me to use the device with my portfolio stand/keyboard case without losing sound quality. I haven't had a chance to play around with many apps on it, but it boots up very quickly and works between screens with ease. I'll update this review in 30 days after I've put the tablet through it's paces!", "Title": "First impressions = Awesome", "Date": "October 31, 2013"}, {"Author": "kris", "ReviewID": "R1292YY02PP6JQ", "Overall": "5.0", "Content": "Dragon Touch 9.7 this item is a good buy, meet my needs, retina display fantastic, bluetooth is a plus even though I haven't used it yet, wifi is excellent, camera front and back is good too.", "Title": "Dragon Touch 9.7 this item is a good buy", "Date": "October 26, 2013"}, {"Author": "JMS", "ReviewID": "R2L8WHIVECQJ83", "Overall": "2.0", "Content": "some of these reviews look a little fake which I should have noticed.I really, really wanted to like this tablet.  Finally, something with a nice screen not limited by the apple universe.  Was willing to accept some compromises for the price and realize it is not an ipad.  The screen is very nice and the hdmi out is a great feature. It's a downer that you can't charge it with the usb.  Seems decently responsive but some apps run a little slow.I upgraded it to android 4.2 successfully using the website instructions, since then it has locked up 3 times in way that is impossible to reboot.  There is no way to remove the battery and no hard reset button.  Could not determine any combination of buttons that would reboot it.  You have to wait a day for the battery to run down before it will reboot.4.2 is nicer but the netflix app no longer works.  My guess is they need to debug the hardware/software interface a little more.  I'm going to return it and hope I just got one that was defective.", "Title": "Would be great if I could get it to work properly", "Date": "October 8, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3N9Y39XYECYIR", "Overall": "4.0", "Content": "I got this tablet and was impressed by the feel of it.  Nice build quality.Not impressed by the rear camera, but I don't use it that much so it's not a major issue with me.I did like JohnnieD and loaded the kasty-visture-v97hd-422-20131120-rooted4.zip ROM from ArcTools and went to full HD resolution with good performance.I've had experience with older 7\" Asus and Samsung tablets and an Asus Memo.  This tablet performs very well for the price.", "Title": "Great tablet", "Date": "February 28, 2014"}, {"Author": "MJV", "ReviewID": "R2FGIIQAXOA4TB", "Overall": "3.0", "Content": "Good deal on this tablet for what you get. I have had several problems after owning it for a couple weeks though.1) Wireless connection drops and then reconnects periodically. Annoying for streaming or online games.2) Tablet will freeze up sometimes, screen freezes and touch screen stops working. Have to power off and restart it.Otherwise, the screen is very nice and battery life is good.I don't regret the purchase because I'm willing to put up with these issues to save $300....that's a personal preference though :)", "Title": "You get what you pay for", "Date": "January 24, 2014"}, {"Author": "Kathleen C.", "ReviewID": "R3C3YMADRSK32J", "Overall": "2.0", "Content": "Display, battery, is are all exc withwi fi reliable. Pleased. I can't get any files to transfer to the SD card I put in via the storage settings....or any other way. Memory will get used up fast..then may have to root device since internal removable SD cards not accessibleConsider buying a windows tablet or a rooted android tablet. There is no way to copy files, even downloaded a file manager, cannot copy nor save anything to SD card in tablet slot. Yes, I tried the settings option to \"save to external sd\" about twenty times, Memory filled in one week, can't save to, copy and paste nor select files from internal memory, like your jpegs, and not able to send or copy to SD tablet slot. Keyboard became glitchy with more use. Tap response became glitchy. Even after remove second skin protect.Nice people at tech, just this is not practical, very little available memory. Must always connect to a computer then copy to it.", "Title": "great quality, good support, expensive toy, cant save or copy to sd", "Date": "December 30, 2013"}, {"Author": "TimothyC", "ReviewID": "R2GL1VCDTO6Z8U", "Overall": "3.0", "Content": "This tablet is not bad but still has some critical software problems,1. not able to use Skype Video call. It simply hands every time when I try to use video call, but voice-only call is OK.2. switching between apps is slow... like a 4-5 years old previous generation device.I wish there could be an OS upgrade or some patches from the vendor to address these problems.Hardware wise, there is a separated charger rather than sharing the USB port, it's not convenient especially for travelers.", "Title": "not able to perform Skype Video call. Slow response when switching between apps.", "Date": "December 25, 2013"}, {"Author": "Nameer", "ReviewID": "RQUMYHQCNI75A", "Overall": "5.0", "Content": "Well, it came on time and I was so happy to see it. it looks so cool and the screen is so bright. its sound is ok and I was listening to music while I was cooking. I put it in the living room and I was cooking about 10 meters away. the price is good for a good quality tablet. by the way, sometimes it slowdown while playing some games, but overall is good.", "Title": "i like it :)", "Date": "November 3, 2013"}, {"Author": "Sam Benveniste", "ReviewID": "R4M2I90ZK9FWZ", "Overall": "3.0", "Content": "1. Unfortunately, the battery life is very short; only about 3 hours video streaming time.  My Nook gets over 4 hours.2. Must be keep within very close range of a WiFi device to receive adequate reception.  All my other mobile devices can be kept very far from my HotSpot such as, on another floor and on the opposite end of my house.  Otherwise, I receive very poor reception.  Don't understand why.3. Biggest complaint is that the volume is not very high.  I can keep the tablet plugged-in for extended battery use and place my modem close-by for decent signal strength, but I have to sit/lie very, very close to hear the volume (unless I get a pair of earphones.)  I can hear my Nook in another room on another floor, but I have to strain to hear the volume on full blast with this device.I needed a full-functional Android tablet, since the Nook has limited Chrome OS capability.  The Kindle has its own limited OS as well.  One can not download streaming video from simple broadcast, as well as, basic cable networks.  No problem with premium cable channels and Netflix & Hulu, since you pay for these services.  So, in a nutshell, the Dragon Touch R97 is a good alternative, if you can live with the fore mentioned flaws.", "Title": "Adequate & Affordable Retina Display Android Tablet but with at least 3 Flaws", "Date": "June 4, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00DIIH6YY", "Features": null, "ImgURL": null, "Name": null}}