{"Reviews": [{"Title": "Tivax MiTraveler does a great job", "Author": "T. Hogan \"tshogan\"", "ReviewID": "RO77QEEEPWDG7", "Overall": "4.0", "Content": "This is a nice size Tablet, review is for 8\" in case Amazon lumps them together.  It is my second Tablet (I have a first gen Kindle Fire) but I am also an IT professional with a background of PC repair and networking, soPicture: (10/10)  Nice resolution and color is excellent.  Watched videos from Netflix and added my favorite android games I was using on my phone.  They looked great.  Added the Kindle app also.Sound: (8/10)  Most tablets are not known for their speaker output and this is similar to the Kindle first generation sound.  Also it only has one speaker so if you want that stereo sound, use the headphones.  The ones I have sounded excellent.Book/Reading: (9/10)  The Kindle fire app does the job and the pages look great.  Would rate this about where the Kindle fire looks but not the book reading Kindle.  Still a great job and no problems here.  Same as other tablets for reading in bright sunlight, not very wellWeb Browsing: (9/10)  This one has flash capabilities and uses Opera and Google Chrome.  Some issues with clicking on small print and where you click is not always what you get.  I have not seen where you can calibrate this but I would give my Kindle Fire an 8.App Availability: (8/10)  So far I cannot seem to get my Amazon app store and Android has fewer apps than the IPad, but there are plenty to choose from and seem to be more free apps than the IPhone/IPad.Look/Feel: (10/10) Light, thin, sleek.  What you would expect from a high end tabletThe accessories are the power charger, a usb connector which does a trickle charge, and a mini to usb port adapter to connect a usb memory stick or external hard drive.Overall: (54/60).Note:  Getting some errors with updating and error with google apps out of the box.  Hopefully their support will help with these issues.  Lots of potential in this tablet.", "Date": "December 10, 2013"}, {"Title": "Exceeds expectations!! ((Ipad Mini for Android))", "Author": "Amazonian Lavor", "ReviewID": "R2K8F88J4M1KQG", "Overall": "5.0", "Content": "I purchased this item for only $99 on Prime, looking for a tablet for use in college. I saw the Ipad Mini in Best Buy, and I loved the form factor,but I didn't want to spend $300. However, I am very familiar with the Android System (Droid Razr Maxx phone) and wanted a \"pure Android\" device. So this tablet seemed to have what I was looking for: Sleek Style, An updated (& stable) version of Android, and an awesome price.CASE: B00CF1ITJ6(Fits perfectly! This device matches the Archos 80, so those cases work)PROS:Display-True HD, can't really be seen on the home screen or app drawer, but more in movies, youtube, and browsingDesign- Ipad Mini, simply beautifulSystem- Android 4.2 with Google Play. Every App I have tested works well.Battery- Lasts maybe 4 hours with constant use, great standby time (days with no use)Bluetooth- Can be used with a bluetooth speaker or keyboardCONS:Security Lock- Missing from the settings menu, however it can be set! Using an app called QuickShortCutMaker (Settings/ Unlock Selection)I noticed a slight lag while downloading many apps, and running another app.Suggestions:Go to settings, then developer options and-Force GPU rendering-Check mark-Window Animation Scale- Animation off-Transition Animation Scale-Animation offFor school:I convert powerpoint presentations to PDF Files (using an app) and then open using Adobe Reader. Then I can write and take notes on powerpointOverall, this tablet is excellent! Even better if you are familiar with the Android System, I suggest watching Youtube videos on Android 4.2. I can do everything on this tablet.", "Date": "January 8, 2014"}, {"Title": "Fast, Lightweight, Easy to use, HD Screen", "Author": "Simon H", "ReviewID": "R28IQ0ZL6ZHMKJ", "Overall": "4.0", "Content": "I bought this for a friend who wanted a tablet below $200. When it arrived I had it for 2 days to download the apps he wanted and test it out.I have Samsung Tab 2, but this one here is very fast and easy to use. The screen is very good HD. The battery lasted a while and the wifi seemed fast with my internet.The only BAD THING if there is one, I went to the Google Play store and went download a number of apps and had a big list waiting to download. I left it on and went out thinking when I came back it would be finished but I came home 2 hours later and it had not downloaded anything while I was gone. It seemed like when it turned the screen off and locked it's self it stopped downloading everything. Very weird.But for a cheap tablet to use for going on the internet and play games and music etc then this is great. If you want a high tech tablet to do more and use for work then go for the Samsung tablets.  - Hope this helps anyone thinking of buying this.", "Date": "February 1, 2014"}, {"Title": "Nice product", "Author": "David Bu", "ReviewID": "R2ANEPQ3JU0OZ", "Overall": "5.0", "Content": "This is nice product, looks like an iPad mini. It responds pretty fast.I called the support hotline for video/picture format issues. The lady was pretty nice and professional and she knows the product very well.I got a protective case in the local store and bring the tablet with me wherever I go.", "Date": "December 4, 2013"}, {"Title": "good tablet", "Author": "Stefan Calin", "ReviewID": "R3448XBYTYSZ7J", "Overall": "5.0", "Content": "I am happy with this tablet. Good picture quality and very responsive. It does what I need. The tech support was nice and helpful. I had a different experience than the previous review.", "Date": "December 4, 2013"}, {"Title": "Love it", "Author": "Logan Bauer", "ReviewID": "R3KK5Q98KN9IRV", "Overall": "5.0", "Content": "I've had a great experience with this tablet so far.  It runs fast, it's got a nice clear picture, and it's just the right size to fit in my bag.  It does everything I need it to.  All in all I'm very happy with the product.", "Date": "December 4, 2013"}, {"Title": "TIvax is junk", "Author": "Jr&Ethansmom", "ReviewID": "R31Y0EOSYQAPT0", "Overall": "1.0", "Content": "Charger dock goes out very easily and only after 30 days. Customer service is a joke they claim that tablet was opened before so that they could avoid fulfilling the warranty then try to charge you to send the tablet back! TIvax does not care about their customers at all, just pawning off their junk for a quick buck.PS if you don't believe me search for reviews on other Tivax products.... I wish someone would have warned me.", "Date": "November 29, 2013"}, {"Title": "Its of for the money.", "Author": "Anthony Bleeker", "ReviewID": "RO1HCOH9KB9BE", "Overall": "4.0", "Content": "I got it on sale on black Friday for my two yr old daughter.  It works just fine for her to play games on.", "Date": "January 7, 2014"}, {"Title": "The Company SUCKS, OK tablet", "Author": "dawnkegler", "ReviewID": "R354G961I6FA2B", "Overall": "3.0", "Content": "I bought this at Office Max and the sd card slot was broke so I contacted the company and they just said I'm not doing it write.If they look at it they have to charge me. Office max was told about the problem and let me return it.", "Date": "December 30, 2013"}, {"Title": "Not worth it", "Author": "Micah Gonzalez", "ReviewID": "R37I9ILLZGS7UJ", "Overall": "1.0", "Content": "We purchased this tablet and had to promptly return because the screen became distorted. We replaced it for a new one, which seemed to be working fine. But within a few days, it would not turn on at all. This tablet promises but fails to deliver.", "Date": "February 3, 2014"}], "ProductInfo": {"Price": "$149.99", "Features": ", 7 inches Display\nAll winner AML8726-M6 A20 Dual-Core 1.5 GHz\n8 GB Flash Memory, 1 GB RAM Memory\n0.8 pounds", "Name": "Tivax MiTraveler 7D8C 7-Inch 8 GB Tablet (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/410meugCysL._SX300_.jpg", "ProductID": "B00DQ623TQ"}}