{"Reviews": [{"Author": "Christopher J. Cowen", "ReviewID": "RWYW5ERMLH74E", "Overall": "5.0", "Content": "Double Power GS-918 Dual Core Google Certified 9-Inch Android Tablet  is a nice little tablet for the money.  This tablet has a beautiful display (9\") and displays 800 x 480 pixels resolution. Text looks sharper, colors are more vivid, and games stand out. It comes with 1G DDR3 memory and a 8G hard drive for Storage.  This tablet has a front facing camera and up to 4 hours usage with battery.  This tablet will not do as much as a Kindle HD Fire but it is perfect for simple application and games. I think this laptop would be great to use to play games or watch movies on. The fact that this tablet is under $100 dollars is amazing. I would definitely recommend this tablet.I have listed some more specifications that I considered important for this tablet. They are as follows:* Operating System - Android 4.1 Jelly Bean* Display - 9-Inch Display* Processor - 1.2 GHz Apple A4* Memory - 1G DDR3 memory, 8G flash memory storage* Number of USB 2.0 Ports - 1* Weight - 1.1 pounds* Item Dimensions - 9.40 x 0.50 x 5.80 inches* Wi-Fi (802.11 b/g/n)Thank you for reading my review, if you have any questions feel free to email me, I would be happy to help you with any questions you have.", "Title": "A tablet for just under $100 dollars, wow!", "Date": "March 11, 2014"}, {"Author": "Rade Radosevich", "ReviewID": "RXLER85MN73IP", "Overall": "5.0", "Content": "I would have never bought my iPad II!  I am not a fan of Android, and tablets I've messed around with have been miserable experiences... until this GS-918.  We bought a Google Chromecast for the bedroom and wanted something inexpensive to run YouTube and Netflix videos through.  I ordered this GS-918 to serve as that \"remote\", but once I got the unit, I realized how exceptional and versatile the system is!  The unit loads Chrome, Chromcast, Chrome Play Store, Google+ and a lot of other goodies; PLUS it has a small office suite with MS Office compatible apps like Word, Excel and PowerPoint.  The unit is a LOT faster than the iPad, and considerably lighter.  We loved it so much, we ordered a second one!  Highly recommend the system!", "Title": "...had I known...", "Date": "March 26, 2014"}, {"Author": "kimberley oconnell", "ReviewID": "R11ZBBS2G2U4L1", "Overall": "4.0", "Content": "very good tablet for price, does everything i want it to do. would buy it again. had everything that was listed on it.", "Title": "good", "Date": "April 16, 2014"}, {"Author": "Teresa L. Sinclair", "ReviewID": "R3207JBPHZ10R2", "Overall": "5.0", "Content": "I purchased this for my daughter, and she is absolutely thrilled with it.  She loves being able to sit on her couch and get all her updates in \"social media\" done easily and quickly.  She is very very happy with it.", "Title": "Gift Purchase", "Date": "February 28, 2014"}, {"Author": "KAYLENE", "ReviewID": "R2NGASQH3ZHI3E", "Overall": "4.0", "Content": "This is a great product for the price ...Does everything I need it to do i give it four stars", "Title": "nice for the price", "Date": "April 16, 2014"}, {"Author": "Gail", "ReviewID": "R789JF48BO7D8", "Overall": "1.0", "Content": "I wish someone would have steered me away from this. The resolution is terrible and now my touchscreen isn't working.", "Title": "piece of garbage", "Date": "June 8, 2014"}, {"Author": "Ron Harris", "ReviewID": "R1XD47R5F64RS8", "Overall": "5.0", "Content": "Love the price, that's my initial driver for buying it.This tablet fits my need for a third pc/tablet that is portable and is easy to use.I've added a keyboard to it and I like it better than my toshiba laptop for accessing the web.Really recommend this one!", "Title": "Great low cost tablet", "Date": "May 24, 2014"}, {"Author": "Chloe A. Kellum", "ReviewID": "R2YYS03X6ILZ7G", "Overall": "5.0", "Content": "Was skep when buying this tablet, then it arrived and it is awesome i love it its all its claimed to be and i don't know how i survived w/o it :)very pleased thanx", "Title": "fantastic", "Date": "May 23, 2014"}, {"Author": "Mario", "ReviewID": "R2Q9Z8YJGS821M", "Overall": "1.0", "Content": "Good for the.first.day.but by.the second.it was freezing up on me , I would restart and it will freeze in the restart mode and or it wouldn't.turn on! I restarted it no lie about 10 times n it kept acting up still .", "Title": "freezes up constantly!!!", "Date": "April 27, 2014"}, {"Author": "Pauls ddd3 \"Paulsddd3\"", "ReviewID": "R12NIDFFFB0OA4", "Overall": "1.0", "Content": "Says I got the tablet and I didn't. I have no device. Please look into this matter. I am quit upset.", "Title": "Not delievered!!!", "Date": "April 15, 2014"}], "ProductInfo": {"Price": "$139.99", "ProductID": "B00DOJIZF6", "Features": "Android 4.1 Jelly Bean, 9\" capacitive touch screen\nCortex A9 Dual Core 1.2 GHZ CPU\n1G DDR3 memory, 8G flash memory storage\nExpandable storage using Micro SD card of up to 32 GB\nFront facing camera, Up to 4 hours usage with battery", "ImgURL": "http://ecx.images-amazon.com/images/I/41b4rzD%2BMQL._SX300_.jpg", "Name": "Double Power GS-918 Dual Core Google Certified 9-Inch Android Tablet"}}