{"Reviews": [{"Author": "Pamela Ash", "ReviewID": "R3J8TM20NN4N6K", "Overall": "5.0", "Content": "Purchased this tablet as a replacement for the 7\" Matricom .TAB Nero Tablet (the absolute WORSE).  I can genuinely say that this tablet is as good as my Nexus Google and it's kid friendly.  Google play downloads EVERYTHING...Chrome works on this tablet, it even has an app called KIDS PLACE, where you as the parent pick all of the applications you want your child to have access to.  It also has an app that has free books for kids, as well a free movie installed on the tablet!  It's also very fast!  The battery life is good....but I can't tell you the specifics because when my son is off the tablet, my husband uses it and he has it plugged in while using it.  It's a GREAT childrens tablet--and perfect for adults!", "Title": "My second review (and it's a GREAT one)", "Date": "August 18, 2013"}, {"Author": "Robert", "ReviewID": "RMOTBE0QMGMF1", "Overall": "4.0", "Content": "I just got one of these for my birthday.  What a nice tablet!  The screen is very responsive, video is nice and clear, my only complaints are the battery life and the speakers.  The speakers are not very loud at all, and the battery only lasts about 3 hours tops.  Other than that, this is a great little tablet.  Google play works on it right out of the box and so far, all the apps I have downloaded work fine.  I've not has a single problem with it, but then this is only my second day.  The browser is very fast, just a tap and you are right at the page you want.  I like this tablet!", "Title": "What A Nice Tablet", "Date": "November 6, 2013"}, {"Author": "cody", "ReviewID": "RCW7VQF2IT71C", "Overall": "5.0", "Content": "Great price for this pad.  Work very well.  Screen is a 7\" but works well for younger children.  Really nice pad", "Title": "Great buy", "Date": "November 25, 2013"}, {"Author": "sharon", "ReviewID": "RMTP6O794G8KR", "Overall": "5.0", "Content": "I purchased this for my 7yo grand daughter's birthday present, it is the second one I have purchased. I set it up for her and had no issues with it. I especially like the company support.", "Title": "Great tablet", "Date": "January 10, 2014"}, {"Author": "T Glen", "ReviewID": "RW28KIX4XPOVM", "Overall": "4.0", "Content": "This tablet has Google Play, and I've been able to download a lot of apps, including Netflix (a must have). It looks good, but has a pretty narrow viewing angle. The biggest problem I have with this product though, is that the usb port WILL NOT charge the tablet. It uses a 5v adapter that plugs into the wall. It will void the warranty if you use anything except the OEM charger. If that wasn't enough, the charger for this product broke when the tablet took a tumble off the bed. Besides these things, it is great.UPDATE: I contacted Digital 2, the makers of this tablet. Their customer service has been fantastic! They sent me a new charger at no charge, and were very quick in responding via email.", "Title": "My Daughter loves it, but...", "Date": "December 31, 2013"}, {"Author": "kate", "ReviewID": "RBKUWWGRHV8BW", "Overall": "3.0", "Content": "so far it just seems ok.  i bought these for my children for christmas and they like them.  i ordered with high hopes due to other reviews.  mine came with the charger missing and when i did get a charger it wont hold the charge for long.  so im thinking it was used abd repackaged as new. quite a bummer.  ill be contacting amazon about these issues soon.", "Title": "ok", "Date": "December 26, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00D4B5T2G", "Features": null, "ImgURL": null, "Name": null}}