{"Reviews": [{"Author": "yorleny Dominguez", "ReviewID": "R3P1O3MX7ZC1QO", "Overall": "5.0", "Content": "My daughter loved it, great tablet for kids i had no problems with it. So i really recommend this for kids.", "Title": "Awesome", "Date": "June 11, 2014"}, {"Author": "Bradley Johnson", "ReviewID": "R3G6BRBHKOPTTJ", "Overall": "1.0", "Content": "Received this as a gift in March, along with a keyboard, as I planned to use it for writing. At first it was great, no problems. Then I started populating it with apps- and by \"populating\" I mean I downloaded two, and it slowed down. While connected to my home Wifi, it acted slower than if it were operating on dial up. Even disconnected and only opening apps was appallingly slow. One may sound spoiled by making such complaints, but I just think a thing should work as intended.I dared not load games on this thing as I feared it would melt, and decided to only use it as a reader and for using Evernote. Both were still incredibly slow and just plain frustrating. Reading apps took forever to load, and despite my less than speeding typing, it couldn't keep up: I'd type a sentence on the keys only to watch as the letters on the screen tried (and often failed) to follow suit. I considered being done after I noticed this, but decided to just read with it. Until today. After reading on it last night, I awake to find it will do nothing. I'm pretty sure the battery is charged- can't know for sure as the screen is dead,just like my faith in this product.", "Title": "Skip this one", "Date": "June 10, 2014"}, {"Author": "Misty Hanke", "ReviewID": "R1CJW1U1XS5NA5", "Overall": "3.0", "Content": "Bought this for my son for Christmas. It lasted 5 months. It won't turn on or charge. For the price, it was a great little tablet. He did all kinds of games and was able to watch Youtube videos on it. I thought it was great! But sad that it's now broken.", "Title": "Wont charge", "Date": "June 10, 2014"}, {"Author": "Tarah Peery", "ReviewID": "R34SUTVXJ7E9QC", "Overall": "5.0", "Content": "I ordered this tablet at the same time of another, and this one is definitely the superior product. It's thickness is a lot smaller than the other tablet, but it moves a lot quicker and smoother than the other. Easy to use, small (but not too small), and also came with a stylus and a screen protector!", "Title": "Very impressed", "Date": "December 25, 2013"}, {"Author": "FabMomshopper", "ReviewID": "R358OA717GDRGR", "Overall": "2.0", "Content": "Bought this for my 4 year old's christmas gift. Love the preloaded apps but the battery life is ridiculously short.", "Title": "Poor battery life", "Date": "December 25, 2013"}, {"Author": "K. Smith", "ReviewID": "R2L17SFU9710WX", "Overall": "1.0", "Content": "I knew I was taking a chance on this but optimistically thought it would be fine for an 8 y/o to play games. It was definitely not.  Excitement quickly turned to frustration as soon as she tried to use it.  It was an all-around disappointment. The screen froze constantly and it was incredibly slow both internally (it took at least 30 seconds, often longer, for most programs to even open) and when attempting to use the internet. I had high hopes, but I absolutely cannot recommend this product.", "Title": "Awful", "Date": "December 24, 2013"}, {"Author": "Jose Solis", "ReviewID": "R2XZ1VZ881AZ0F", "Overall": "5.0", "Content": "I wanted a tablet for my daughter for Christmas However, I was skeptical of the cost, and how functional it would really be.", "Title": "Wow, well worth the money", "Date": "December 23, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2S3VNCPKGW7BP", "Overall": "1.0", "Content": "right out of the box, this didn't even work.  It didn't turn on.  I let it charge to see if it just needed to charge more first and it still didn't turn on.  I'm sad because it is so cute and a perfect size tablet.  All I saw when I hit the power button was a flash of light for a few seconds and some lines across the screen, then nothing at all.  Every time.  It would never boot up.  So disappointed :(", "Title": "arrived already broken :(", "Date": "December 23, 2013"}, {"Author": "amazonbuyer", "ReviewID": "R1G8ONCSGHNV5T", "Overall": "4.0", "Content": "Got two of these for my sons last year and they have enjoyed them. Takes a good picture, plays good apps, they have lots of music on them. Sure it doesn't load as fast as higher price tablets but for the $ it's good. Battery life may be the biggest disappointment, playing a game it will last about a hour, but recharges quickly.", "Title": "For the $$ it's good", "Date": "December 23, 2013"}, {"Author": "AP \"matrix\"", "ReviewID": "R24QC5V2OAK1H1", "Overall": "5.0", "Content": "This is really a great device for the price Netflix and Wi-Fi work perfectly fine, great screen. the battery life is awesome the camera is pretty much worthless. Downloaded some educational games and books from my eight year old I couldn't ask for a better device for the price!", "Title": "Awesome considering the price", "Date": "December 22, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00DQC822W", "Features": null, "ImgURL": null, "Name": null}}