{"Reviews": [{"Author": "Amazon Customer", "ReviewID": "R1AVF6VFAVF5T4", "Overall": "4.0", "Content": "I am a former 1st gen iPad user that was in the market for an update.  I chose to move away from the iPad because I found that I'm a fairly basic tablet user that walked away from the itunes network a few years ago.For music I had transitioned over to Spotify & SiriusXM.  For movies, Netflix & Amazon Prime.  For reading, Kindle app, but with the iPad I was not able to fully utilize the Prime membership advantages.Further, my iPad was quickly becoming obsolete because Apple didn't allow for it to download the latest iOS updates so within 2 years of ownership some of my iPad apps were constantly slow and/or crashing.  This was the straw...After shopping around for approximately 30 days I ended up purchasing 2 tablets for my household of 4 - the 2nd gen Nexus 7 32gb and the Kindle Fire HDX 8.9\" 32gb.  (By the way, I picked up two 32gb tablets for about the same price of one 32gb iPad mini with retinal display)Pros of Kindle Fire HDX 8.9\": Size, weight, display (unbelievable), sound (those little speakers work really well, including virtual surround!), and the speed on Amazon Network.  Being an Amazon Prime member, this machine is really, really slick.  From the home screen you can easily shop, access games, apps, books, music, videos, etc., etc., etc..  This is combined with their carousel feature of recently accessed programs, books, etc..  I have to add that pulling up a video from Amazon was lightening fast.  This can't be said for the Netflix app.Which leads me to the Cons of the Kindle Fire HDX 8.9\": This tablet crashes - without warning - but I've only experienced the crashing when using apps outside of the Amazon ecosystem.  But when the Netflix app crashed on me yesterday it required me uninstalling the Netflix app, restarting, then adding the app back for it to work again.  Also, streaming music via bluetooth, which is all I do anymore (Spotify is a truly fantastic service that gets better everyday), can be tricky.  The bluetooth pairing struggled a bit the first time I tried it, but has since locked on seamlessly.  However, the Spotify app is a very stripped-down version compared to Apple's and Google's.  So much so that it is missing some pretty significant components that I will truly miss.  Further, last night after I paired it with my stereo system and launched a song on Spotify, it crashed.  When streaming SiriusXM at times there are gaps in the songs where the streaming fails a bit.  Maybe a system update will correct a lot of this (fingers crossed)?I understand that they are different machines in many ways, but comparing the Pros of the Kindle Fire HDX 8.9\" to the Nexus 7 - the Kindle Fire HDX 8.9\" wins.  The Nexus 7 can't compete with the specs, particularly if you are a Prime member.  As a Prime member, I really get a kick out of the extras I get by also owning a Kindle.  The book lending alone is a truly fantastic perk.  Also, the display and sound on the Kindle Fire HDX 8.9\" are truly remarkable especially when you consider that the device weighs so little!However, if you're looking for an all around tablet that will work both within and outside of the Amazon ecosystem (Spotify, SiriusXM, Kindle, and Netflix apps specifically), I'm sorry, but the Nexus wins.  I have yet to have an issue with crashing.  Pairing to bluetooth - no issues.  Streaming music and movies on the apps mentioned - no issues.  And by the way, I'll stream music for entire days without an issue.To top it off, rumor has it that Nexus is planning a Nexus 8 launch before the end of the year (the \"8\" referring to an 8\" size).So, needless to say, I will be weighing the pros and cons of trading in my Kindle Fire HDX 8.9\" for a Nexus 8 if that day comes.  iPad, however, will not be considered.UPDATE: Amazon let me return my HDX for a new one and the crashes have ceased.  Also, Spotify has been updated (finally), but the bluetooth streaming still struggles.  That being said, I love my HDX and have changed my rating from 3 to 4 stars.  Thanks Amazon!", "Title": "Outstanding specs/perks within Amazon Prime Ecosystem.  Struggles a bit outside of it.", "Date": "November 13, 2013"}, {"Author": "S. Siepel", "ReviewID": "RZNMRJUKQ48P7", "Overall": "5.0", "Content": "I've waited a long time to purchase this tablet, waiting for one with both front and rear facing cameras and trying to save up enough Amazon points so that I could afford it. Finally, this December my hubby and I ordered one as my Christmas gift. Christmas day I pulled it out of the box and everything worked perfectly. However, early January I went to turn on my new Kindle in the morning and nothing. Dead. I followed the suggestions given on the Amazon website, but to no avail. Called customer service, and they end up sending me a new Kindle. I was truly bummed that my new device was faulty, but Amazon's customer service was excellent!So, after playing with my second Kindle and reading other reviews, here are my thoughts on this device.1. I love most everything about this Kindle, the light weight, the features, etc. Things that drive me a little crazy include the fact that the power and volume buttons are on the back.  It is awkward to feel around for the volume button while you are watching a video or whatever.2. Mayday is helpful but a little creepy. So, I was trying to figure out how to open Word documents that were sent as attachments via email. I had purchased the OfficeSuite Professional App and had no problems opening documents sent via Yahoo mail, but couldn't figure out how to use it for Gmail. I pushed the Mayday button and right away had a customer service rep online. He walked me through the issue. At first I thought \"This tech is so cool. He can see/control everything on my Kindle,\" followed by, \"Oh, that is kind of creepy.\" Not that this is any different then was Dell or any other computer customer service can do with your permission on your computer, it just struck me a little weird. BTW, contrary to other reviews, you can open email attachments on this Kindle from both Yahoo and Google mail servers.3. I love the video quality when watching something on this device, but not sure why they did not include an HDMI outlet so that you could watch on other devices, like your TV.4. Having Amazon Prime is definitely worth it, you just need to be aware of its limits. We have had Amazon Prime for years and use at least one of its features almost daily, whether it is free shipping, the free movies/TV, or checking out a free book from the Kindle collection. Amazon's new feature lets you download some (that should be capital SOME) Primes movies and TV programs.5. I have yet to find a cover/case that I really love for this device. I have the Amazon Origami case and the MarBlue Ultra Lightweight Origin Case for Kindle Fire. Neither have all the features I am looking for, like really good protection. If you have any suggestions I would like to hear them.6. I will probably continue to read books mostly on my Kindle keyboard e-reader. I work on a computer during the day. When I go to read at night I find the back-lit screens really bother my eyes. I have read on this Kindle just fine, but I prefer the size and screen of my Kindle e-reader for long stretches of reading.7. I would recommend setting up some parent controls, even if you are the only one using your Kindle. Once you turn on the controls you can go into the settings and choose the controls you want to use. For example, I want my Kindle to ask for a password before a purchase is made or a video is watched, just in case I accidentally hit a button or my kids happen to be using it.8 If for any reason you have to return your Kindle, I was  told by a customer service rep to deactivate the Kindle from your account for security reasons, even though the first thing Amazon does it delete all information on returned Kindles.9. I wish there was a charging indicator light. You plug the thing in and there is no way of knowing if it is charging or is fully charged.", "Title": "Love it, even though I already had to return one for a replacement. (also some notes on Mayday)", "Date": "January 11, 2014"}, {"Author": "John Barry", "ReviewID": "REC223NN4ZULO", "Overall": "5.0", "Content": "HistoryWe've owned two original Kindle Fire's, a Kindle HD 8.9, Kindle HD 7\" and now the Kindle HDX 8.9 64gig version.It is amazing. High resolution, fast and compatible with most of the apps on our cloud. We love it. We love having our books, movies (prime), music, games and apps all on the cloud. All accessible to our devices and smart phones.EmotionWe love it. By \"we\" I mean me, my wife and our 5 year old daughter, who has been using it since she was 3. She would have been using it earlier but we didn't have one.ConstructionIt is very thin, very fast and elegant. More-so than the HD version. The original Fire, which is highly functional, seems very primitive by comparison. Now one of our original Fire's broke. Amazon was kind enough to give us $75 credit on it. For this we are very grateful.FunctionalityMy wife is a Database developer and has resources that help her with her job.I am a musician. I have wonderful books, a 4 track mixer, can write notes, take video notes... browse the web, run apps, games, movies. it is beyond my wildest dreams and I am very impressed. At this stage in my life it takes a lot to impress me, but this has a lot.My daughter has tons of games (minecraft, reading apps, etc) that she adores. The worst thing is we have strive to limit her. Now the kindle will do that for us, but we still reserve the right to do that. She's very careful with her \"Piggy\" as she calls it. This is based on an early application (2 years back) that featured a \"Piggy\". Well, she loves it. We all call our kindles \"Piggies\" because of this.LongevityI don't know how it will hold up. I pray it will last years. I can see using it for years if it does. I can't imagine what Amazon's engineers will come up with in the coming years. It's yet another reason to fight to stay alive. I am amazed by technology. I rank this right up there with innovations such as the Kemper and almost the cell phone. It's just amazing and a game changer. IMHO, easily the leader in it's field.Tech SupportAmazon's tech support is top notch and second to none. They make a mistake they'll break their backs to fix it. If carriers make a mistake they do their best to make it right and then some. They don't have to, but this reinforces good-will and makes us come back to them time and time again. We love amazon. This product is tied to amazon and their success and quality shines through in this product. They deserve all of their success.Originality and other tabletsThere are many tablets on the market. The key competitor is the iPad and the two are very comparable. The iPad's keys to success are it's larger screen and it's elegant programs. It's weakness is it's cloud is too proprietary compared to the Kindle. I have two iTouches and like the elegant, well designed programs, but dislike iTunes. The Kindle beats the iPad in every other department. The Kindle HDX is less expensive, the programs are usually on par or close to Apple, and the resolution is actually higher on the HDX. The HDX also boast a faster quad core processor. This might be negated by the higher resolution of the Kindle but the difference is negligible.VerdictBoth. I would be happy with an iPad and a Kindle. If I had to choose one it would be the Kindle. Amazon has found a way to worm themselves into our lives and our hearts. Their relatively low priced kindle, great shipping, excellent selection of everything has done it. They are part of our culture with south park making episodes based on UPS/Amazon deliveries and so forth. It's a huge deal and probably the beginning of something larger than we can imagine. The only thing is, as Amazon grows, will it maintain it's integrity to itself and it's customers -- not sell out to corporate and powerful investors.", "Title": "The laptop of the future is here.", "Date": "December 27, 2013"}, {"Author": "Johnny Kenehan \"Johnny Kenehan\"", "ReviewID": "R2KYT5ZTNXB0WX", "Overall": "5.0", "Content": "I purchased the Kindle for my wife for Christmas; ordered it the 23rd and had it the 24th!  The unit is just unbelievably thin and sleek and it was fully charged out of the box.  It is an amazing unit, fast response, fantastic screen and then there is the live help.We had some problem getting the smtp settings right, just wouldn't work.  This is certainly not Amazon's issue, but an issue with finding the right settings for my internet provider.  In desperation, I thought I'd try the live help but I didn't hold out much hope, it was just before midnight on CHRISTMAS DAY!  After LESS THAN FIVE SECONDS after pushing the button, Deborah popped up in a little window and asked me how she could help.  I immediately looked to see if I had pants on ... but she said only I could see her!She was GREAT.  Took us about 10 minutes and I was up.  It was so cool seeing her draw on my screen and point to the needed settings.  I just could not believe the customer attention I got.  Damn, if I could give 10 stars I would!!!!  Amazon, you've really done it this time.  Even had the Kindle been less than stellar, I wouldn't have minded knowing my wife or I will always have the help we need.  BTW, YouTube videos played immediately and just as expected.  Well done Amazon, and \"Deborah\"!!!", "Title": "Video help", "Date": "December 26, 2013"}, {"Author": "Judy L.", "ReviewID": "RV42E1NTCMKNC", "Overall": "4.0", "Content": "I am not going to repeat what has be expressed on other reviews, but will only tell you my opinion of the improvements over the Fire HD and compare to other tablets I have. If you want the tech specs, you can read them on the page for the tablet. So I won't repeat them here. I have and have had a number of tablets including the iPad AIR, iPad 3rd gen, iPad 7\", Nexus 7, Nexus 7 2nd gen, Galaxy Note, Galaxy Note 3, Galaxy Note 8, and an Asus 10\" (I don't remember the model). So I am very familiar with the different models and operating systems.I had a Kindle Fire Hd 7\" that I sold because I didn't like the carousel, and getting to apps that I wanted to used wasn't convenient. The color, resolution, and sound were fine for my purposes to watch Amazon movies and to uses some apps, but it was cumbersome as compared to other android tablets that I had. Apps couldn't be grouped or organized as they could be on other tablets, and every app used was added to the carousel making the carousel lengthy and virtually useless.I decided to give the Kindle Fire HDX a try in hopes that some of the disappointments I experienced with the Fire HD were resolved. I have had the Kindle Fire HDX only a couple of days, but so far, I am impressed with the improvements. It still has the carousel, that can be useless if you use a number of apps or new apps are added - all are added to the carousel. Those that you don't use often have to be remove, one-by-one, manually. It would be nice if adding apps to the carousel was an option so that only most used apps could be added. (Hint to Amazon).On the plus side, you can now view all of your installed apps and execute them by swiping up in the screen. You can also group your apps into collections, or folders, and name the folders. In addition, apps in the apps view can be arranged in a way that makes sense to you by dragging and dropping them into position. In this matter, the Kindle Fire HDX function much more like other android tablets and is a huge improvement over previous versions of the Kindle Fire. This versions offers much more user control for organization and usage of the tablet.A couple other improvements that are obvious to me are the resolution and the crisp true colors. The colors on the screen really do \"pop\". In comparison to other tablets that I have, the touch response is extremely good, and the accuracy of the on-screen keyboard has been flawless. In addition, moving from the carousel to the apps screen and going from one app to another has been very smooth. There is no lag at all.I did have an opportunity access Mayday, that is reached by clicking the \"?\" icon. I used this at 3am, and go almost an immediate response. The representative was very helpful and answered all of my questions. I did find out that many of the Google apps are not compatible with the Kindle Fire HDX because developers have not made them compatible. They hope that this will change with future updates to the OS. In my experience, developers of apps have most developed the iPad apps and then the Google apps. The Google apps never seem to be quite as good as the iPad apps. Now that Amazon has developed  a very capable tablet, maybe developers will start to create more apps that are compatible. This is yet to be seen. In the meantime, users of the Kindle tablets are pretty much limited to apps available on Amazon other than a few Google apps that may be compatible.At this point, I would recommend the Kindle Fire HDX tor android flexibility, the improved display, and for use with Amazon Prime deals. I will update this review as I get more experience with the features of this device.", "Title": "A great improvement over the Kindle Fire HD", "Date": "December 26, 2013"}, {"Author": "Steward H.", "ReviewID": "R144K5Y0T0A88P", "Overall": "5.0", "Content": "While being very satisfied with our Kindle Fire HD 8.9, we were pleased to upgrade to the Kindle Fire HDX 8.9 when Amazon offered the four payment plan. We purchased both of our Kindle Fire 8.9's with 32 GM of memory, without the special offers feature.We want to emphasize that the Kindle Fire HD 8.9 is a very fine tablet, and if you do not have the extra funds to purchase the HDX 8.9, you should purchase the Kindle Fire HD 8.9 while they are still available from Amazon for $229. The two are very close in the quality of still and video graphics. At this price, they are an incredible bargain.Nevertheless, we were very pleased (amazed might be a better term) by the new Kindle Fire HDX 8.9. In the following commentary, keep in mind we are comparing the HDX to the HD 8.9.The new HDX 8.9 is noticeably lighter to hold, yet retains the solid build quality of the original 8.9. As far as still graphics are concerned, the colors are more vivid, contrast is even higher, blacks appear even blacker. In short, the display is amazingly impressive!  Comparing the two tablets side by side, it is as if the original image is being viewed through a very slight polarizing filter on the original HD 8.9.As far as viewing Video content, we noticed very little difference between the two tablets, with the original KF HD 8.9 perhaps having a slight edge. Both are excellent, movie picture quality varies widely. If you are a Prime member, try The Robe, or Contact if you want to see just how good the video quality truly is. The soundtrack on Contact showcases the sound quality possible with these tablets.The rear/back facing camera is fun to use, color is quite accurate. The camera is effective in relatively low light situations with low \"noise\". If high picture quality is required, we would recommend using your digital camera.The sound quality seems to be slightly better on the new model, which might be due to the altered position of the dual speakers. If you are watching a movie, you will definitely want to use high quality lightweight headphones. With these, the sound quality is very impressive.The New Silk browser is greatly improved.  Internet browsing is significantly faster with snappy response.Battery life is significantly improved, we noticed at least a 20% increase in useable battery life.Overall, the new Kindle FIre HDX 8.9 has managed to improve an already excellent screen image,  provide slightly better sound, added a useful rear/back facing camera, while being significantly lighter in weight.There really isn't anything we would describe as being negative with this tablet. Some icons, apps, and text appear slightly smaller in size because of the increased screen resolution, and one of our apps did not run properly on the new Kindle fire. If a reset is required, one must now depress the power button for a full 20 seconds, release, and repress the button to allow the kindle to reset. We only experienced one lockup requiring a reset, which we are sure was software related.If Amazon is still offering the four payment plan, there is no better time to purchase or upgrade. If not, we still are impressed enough to spend the full $444 for the 32G KF HDX 8.9, without special offers. (If you opt for 16GB and special offers, the price is less). You will not regret purchasing this item!", "Title": "Impressive Improvement over KF HD 8.9", "Date": "December 25, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R115UDREAS7XRX", "Overall": "5.0", "Content": "I have been a Kindle user since the 1st generation readers came out, I have followed successive generations through all the iterations except the KIndle HD as I had helped a friend with one and really didn't like the weight, I had a 10.9 Android tablet that didn't weight anymore than her little 7 inch.  However, I had seen some of the reviews referring to how light the HDX was and my husband was like, well my little tech junky would you like that for Christmas. I of course did some research on the forums and said yes.  Now, one caveat, if you get frustrated with not being able to get a specific app you really want, be sure to go to the forums, I have not yet found an app that I couldn't get one way or another so I'm very happy with this light little unit.  I streamed a video or two from Amazon Prime without downloading and no hiccups or pauses, I was amazed at the image quality.  So, if you do your homework to make sure you can get the apps you want, then I would highly recommend this speedy, light, amazing graphics tablet.", "Title": "Best Kindle so far!", "Date": "December 21, 2013"}, {"Author": "Vamsi P.", "ReviewID": "R2D2TEJN1GXZOI", "Overall": "5.0", "Content": "I was not sure about the Kindle HDX and almost bought the iPad Air but glad I got the Kindle instead. The screen is slightly smaller compared to iPad but Kindle is far better option especially if you have kids and if you want to use the device for media. I love the integration with Amazon Prime, Parental Controls are awesome and like the app store as well. I can say for sure, i am not  missing anything so far that I had with the iPad and this is a  great tablet  for both adults and kids.", "Title": "Smaller screen than the iPad but far better in other areas", "Date": "December 19, 2013"}, {"Author": "W. G. Butler", "ReviewID": "R2RASZJABY89PP", "Overall": "5.0", "Content": "I am tech geek and own a Nexus 7 (2013 model), an iPad Air, and now a Kindle Fire HDX 8.9.  The Kindle Fire HDX could possibly be my favorite of the three (although they are all excellent devices).1) LOVE the form factor.  It's unbelievably light and makes the iPad Air, which I was previously amazed by, feel chunky in comparison.2) Fast processor and zippy graphics.  No lag in the user interface.  Everything loads up instantaneously and even graphically demanding games like Riptide GP run as smooth as butter.3) Great Amazon interface that gives me access to my Amazon Prime videos and video library (which I do not get on my Nexus).  I own many movies and TV shows in my Amazon library and it is nice to have access to these, as well as the dozens of Kindle books I own.4) Kid friendly options like Kindle free time offer tons of content for parents to let their kids enjoy.5) Mayday option is pretty cool.  I tried it out twice when I had some general questions about Kindle Fire OS and the representatives were friendly and helpful.  I never had to wait more than 10 seconds for a representative to appear.Here is how I would compare the devices:vs iPad AirI can do anything on my iPad Air that I can do on my Kindle Fire HDX, plus I have access to all of my Apple content.  The app environment is MUCH richer for the iPad then it is for the Kindle Fire HDX as there are many more apps and especially many more tablet optimized apps.Having said that the Kindle Fire is significantly cheaper and is also lighter, and Amazon pretty much has everything you need in terms of Apps, books, and media content.  So I would say that the Kindle Fire HDX is a poor man's iPad Air that is almost as good and would satisfy the great majority of consumers.  I also prefer the slightly smaller form factor and lighter weight of the Fire HDX.vs Nexus 7The Nexus 7 has a better app environment through Google play.  However, the Kindle Fire HDX 8.9 has access to the video content from Amazon Prime and a bigger screen, more storage, and more powerful graphics and CPU.  I honestly like the HDX 8.9 better and would choose this between the two if I could only have one.  The Nexus 7 is still a great tablet though, especially for the price.  This is just a personal preference for me.  But Nexus 7 is the way to go if you are an Android fanatic or prefer a richer app environment.", "Title": "Superlative", "Date": "December 19, 2013"}, {"Author": "Dominic Wu \"Digitari\"", "ReviewID": "R86F65N2CG4XM", "Overall": "5.0", "Content": "It is thinner, lighter, and has a better screen than the 800 lbs gorilla in the tablet market, especially considering that if you are viewing this review chances are you are already part of the Amazon ecosystem.  The HDX integrates with Amazon seamlessly making everything you do just works even better.  Your Kindle books (many free ones), your Android apps through Amazon app shop, Prime Instant Video streaming (ironically available on iOS but not Android).  Granted, it would have been nice to have the Play store feature but that would make the HDX with Mojito just another super thin and light Android tablet with a beautiful screen.  No star subtracted since it is meant to provide a complete user experience and differentiate itself from the other offerings.  The size is perfect and the way it balances in your hand, the placement of buttons (only 3, Power, Vol+ and Vol-) are all subtle yet greatly appreciated design choices..  I cant say enough good things about this tablet.  If you are in the market, have Prime, this is a no brainer.  About the only thing that could make this a better tablet is an even lower price to really seed the market.  Don't worry for Amazon, though, they will definitely make it back in added purchasing activities based on the HDX's usage, not unlike the Prime membership doubling the average purchases of the its members.", "Title": "A tablet superior to the iPad Air ( have both)", "Date": "December 19, 2013"}, {"Author": "Venus2471", "ReviewID": "RBAWYKO2OOSDB", "Overall": "5.0", "Content": "The only con I find in this is I wish the battery time was longer.  I would recommend ordering a case and stylus at the same time you do the Kindle HDX.  I work better with a stylus then I do my stubby fingers.  I am not tech savvy but so far so good. I love the May Day button. I was a little freaked out the first time I used it thinking the Amazon tech could see me sitting in my PJ's with my hair a mess the same way I could see him. I quickly found out that wasn't the case. LOL...relief!  I've had it a few day's and have no real complaints thus far. The only problem I have had is having to hunt it down because family members keep stealing it from me. I would highly recommend this as a gift for yourself or someone special to you that likes to read books & magazines, use the internet, watch movies, listen to music, etc.  I just begun to tap into all the neat functions this device has. To me, tablets & ecspecially Kindle's, are the best new technological devices that have come out in awhile. My first was a Kindle Keyboard that I got for really cheap thru gathering points on another web site and this is my second. I do get the extended warranty but did not use it with my first Kindle. I did get it again with this one only because I began to have problems with the Kindle Keyboard after my warranty expired. I can't complain because it was heavily used & abused...LOL...I love Amazon's Kindles and the price is right for what I need it for. I do recommend getting the 8.9\" because the size is just right to me.  I hope you enjoy it as much as we do ours!", "Title": "Amazon did it again! We love the Kindle HDX 8.9\" in our house!", "Date": "December 2, 2013"}, {"Author": "Paul Hysen \"book owl\"", "ReviewID": "RASE83IY7Q72I", "Overall": "5.0", "Content": "The display on this device is amazing. There is no pixelation, even under a magnifier. This makes it very easy on the eyes. It is light and no burden to carry wherever you go and the battery lasts quite a while between charges, for a device of this nature. As you do not need a light to read by, it is the best book to take to bed. The wifi works great and eBooks are downloaded quickly. The interface works well and there are no obvious bugs. The book reader side of the Kindle Fire is as-easy-as and once a wifi connection has been established, you are set to go. My only criticism is that setting up the device can be a little confusing and at times frustratingly challenging, even for a seasoned computer user like myself. But I guess that is due to its Linux based Android operating systems, the inner workings of which only a seasoned Linux user would find anything less than esoteric. So some work on that aspect please Amazon, calling the help line is great, but the success of a device as regards the ease of setting it up, should be measured in the lack of calls, not its volume. But as far as the Kindle Fire HDX as a book reader is concerned, it's the Rolls Royce of readers, there is no better.", "Title": "Thumbs up for the Kindle Fire HDX", "Date": "December 2, 2013"}, {"Author": "Syreeta Brown", "ReviewID": "R1TIBDGZXVM9RF", "Overall": "5.0", "Content": "It's east to use, fairly lightweight, and I can take it with me anywhere and pull it out whenever I need it. It also works better with some apps than my phone does. Love it!", "Title": "Love the Kindle Fire!", "Date": "December 1, 2013"}, {"Author": "Tom Henderson \"musician in my mind\"", "ReviewID": "R23P15PJHW7S1T", "Overall": "5.0", "Content": "I have the kindle touch and the first kindle fire and had no issues with them so when the HDX was announced I decided that an upgrade was due.  I received my HDX two weeks earlier than first promised and it has been better than expected.", "Title": "Amazon has done it again", "Date": "December 1, 2013"}, {"Author": "Cheryl Carter \"cartec\"", "ReviewID": "R32GBUHW9OUD73", "Overall": "4.0", "Content": "I have owned three devices over the past ten years and this by far the best.  I know there are other pads, smart phones and readers to choose from but think any of them compare to the speed,  convenience, and ease the new kindle fire 8.9.", "Title": "kindle 8.9", "Date": "November 30, 2013"}, {"Author": "Vicky Bolen OHara \"Kindle Lover\"", "ReviewID": "R1IUICTRH4EFOB", "Overall": "5.0", "Content": "I love my Kindle Fire HDX 8.9\", HDX Display, Wi-Fi, 64 GB with special Offers.  The problems I've encountered are with wi-fi.  Sometimes, I like working on my tablet, and sometimes, I like working on my Chrome Book (which I also purchased at Amazon).I think I have found the solution to the problem.  When I'm working on my Kindle HDX Tablet, I have to completely unplug my Chrome Book.  It worked last night, and today my Chrome Book is working fine, when I plugged it back in.  This might be a solution for Amazon's Customer Service if anyone calls in with the same problem.  Meanwhile, I had to spend more dollars with my internet people for a Wi-Fi Extender.  The Wi-Fi extender is mine to keep, so I've elected to keep it. However, if anyone has a problem with different devices vying for their Wi-Fi, this is the solution--completely unplug one device before using another device.As I said before, I Love, Love, Love, my new Kindle Fire Tablet. :-)", "Title": "Amazon Kindle Fire HDX 8.9\", HDX Display, WI-FI, 64 GB - Includes Special Offers", "Date": "November 29, 2013"}, {"Author": "Forest Fun", "ReviewID": "R7HLLTFNLGQH8", "Overall": "5.0", "Content": "More powerful, faster, out of this world pix, front & rear camera, great sound on & on, but best of all is having Amazon at your side. May day!!!!  My few problems have been operator stupidity & were handled cheerfuly.  I  Iove Amazon !!!", "Title": "BEST KINDLE EVER!!!", "Date": "November 27, 2013"}, {"Author": "SAM", "ReviewID": "R68QA5VZ9PV17", "Overall": "5.0", "Content": "Lightweight, on/off and volume buttons flat on the back, better definition on most game screens - I have the original Kindle Fire, and the second version with the larger screen and still use them both, but the 8.9\" with the HDX display really does have improvements over the last version.  I also have an I-Pad Mini which is not as easy to use and I have had to call their Help desk multiple times because of problems accessing features and starting apps.  I have never had to call Help for any of the Kindle Fires I have because I could always find an answer in the pre-loaded Guide.", "Title": "Great - lighter than any of the earlier Kindle Fire's and only one ounce heavier than the smaller I-Pad Mini", "Date": "November 26, 2013"}, {"Author": "Brian Real", "ReviewID": "R1Y2A8VE4PHRQ5", "Overall": "3.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1VSXOSX3IV21AembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1VSXOSX3IV21Arefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1VSXOSX3IV21AchiDiv\").innerHTML = document.getElementById(\"cv_mo1VSXOSX3IV21AhiddenPre\").innerHTML;\n};\ncv_mo1VSXOSX3IV21Arefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1VSXOSX3IV21Aso;\t   \n\n\nfunction cv_mo1VSXOSX3IV21AloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1VSXOSX3IV21Aso = new SWFObject(swfLocation, \"cv_mo1VSXOSX3IV21AAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1VSXOSX3IV21Aso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1VSXOSX3IV21Aso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1VSXOSX3IV21Aso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1VSXOSX3IV21Aso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1VSXOSX3IV21Aso.setAttribute(\"height\", swfHeight);\n          cv_mo1VSXOSX3IV21Aso.setAttribute(\"width\", swfWidth);\n          cv_mo1VSXOSX3IV21Aso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1VSXOSX3IV21Aso.write(\"cv_mo1VSXOSX3IV21Aflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1VSXOSX3IV21A', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1VSXOSX3IV21A';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1VSXOSX3IV21A', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1VSXOSX3IV21AloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1VSXOSX3IV21A\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3PEHVGP3F6S57\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3PEHVGP3F6S57\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1Y2A8VE4PHRQ5\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3PEHVGP3F6S57/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1VSXOSX3IV21Aduration')) {\n      document.getElementById('cv_mo1VSXOSX3IV21Aduration').style.display='none';\n    }\n    cv_mo1VSXOSX3IV21AloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1VSXOSX3IV21AloadSwf(movieID, playerVersion) {\n   return _cv_mo1VSXOSX3IV21AloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1VSXOSX3IV21AnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1VSXOSX3IV21A', 0, h);\n}\n\nfunction cv_mo1VSXOSX3IV21AresetPlayer(w,h,bw,cc) {\n  cv_mo1VSXOSX3IV21AnewHeight(h);\n\n  cv_mo1VSXOSX3IV21Aso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1VSXOSX3IV21Aso.addVariable(\"cacheCode\", cc);\n  cv_mo1VSXOSX3IV21Aso.setAttribute(\"height\", h);\n  cv_mo1VSXOSX3IV21Aso.setAttribute(\"width\", w);\n  cv_mo1VSXOSX3IV21Aso.write(\"cv_mo1VSXOSX3IV21Aflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1VSXOSX3IV21ARollOverImg = new Image();\ncv_mo1VSXOSX3IV21ARollOverImg.src = \"http://ecx.images-amazon.com/images/I/81AXkHYgtSS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1VSXOSX3IV21Apreplay = document.getElementById('cv_mo1VSXOSX3IV21ApreplayImageId');\nif (cv_mo1VSXOSX3IV21Apreplay) {\n  cv_mo1VSXOSX3IV21Apreplay.onmouseover = function() {\n    cv_mo1VSXOSX3IV21Apreplay.src = \"http://ecx.images-amazon.com/images/I/81AXkHYgtSS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1VSXOSX3IV21Apreplay.onmouseout = function() {\n    cv_mo1VSXOSX3IV21Apreplay.src = \"http://ecx.images-amazon.com/images/I/81AXkHYgtSS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1VSXOSX3IV21Apreplay.parentNode;\n\n  var cv_mo1VSXOSX3IV21AcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1VSXOSX3IV21AcurrentClick) {\n      return cv_mo1VSXOSX3IV21AcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:21 MinsThe tech behind the HDX 8.9 is amazing and completely lives up to any and all hype. However, I have had some hiccups with service quality worth noting.The big issue is that the device would not download anything a couple of days ago, with everything just hanging in the queue. I hit the Mayday button, and someone eventually called me back. This was the second time I used Mayday, and the second time I was shifted over to someone else on a different platform. So, to be clear: Mayday is not a tech support service, but what you use when you can't figure out how to crop an image or something else simple. Considering the considerable amount of promotion around instant customer service via Mayday, this is a massive limitation and is the reason for one of the missing stars in this review.I received a phone call from an Amazon rep immediately after getting off the line with the Mayday rep, and this phone interaction lasted more than an hour. He made an earnest effort to help, but it actually made the problem worse. See the attached video - which I made for an earlier and considerably different draft of this review - to see what happened. I actually lost access to my book library. I eventually fixed this myself, by resetting to factory default. But, this then required more than an hour of re-customizing my device.On top of this, five graphic novels I purchased for the Kindle are only downloading in low-resolution files, making them look outright blurry. This appears to be a software issue, since a service rep was able to download higher res files to his device. It is automatically pushing these five - and just these five - titles to my device in inferior quality. I did both a Mayday call and an e-mail about this about two weeks ago, with no resolution, and no follow-up until yesterday.A very friendly customer service rep called me last night and took notes on both the major problem that led to the reset, and the graphic novel issue. He is still researching the latter.I hope that these are temporary issues that are just coming with a new launch and that I will be able to add another star to this review soon. However, until I can get content I paid for at a reasonable quality and go a few more weeks without having to reset my device (note: I never had to reset my original model Kindle Fire in two years of ownership), I am hesitant to enthusiastically recommend this, despite the awesome hardware.Note: This review is almost completely rewritten from the original post, reflecting some responses from Amazon.", "Title": "Amazing tech, but deserves some hesitancy", "Date": "November 25, 2013"}, {"Author": "Chow", "ReviewID": "RS7WXHXW7G2P3", "Overall": "5.0", "Content": "What an improvement over the Kindle Fire HD! First impression was, Oh my God! its so light! lol A real contender in competing with the Apple iPad Air. Light, thin, and very responsive. Some folks have complained about a light blue haze around the border of the display frame, but I dont see it on mine. I bought the 32GB wi fi model and the price difference from a comparable Apple product is a difference of $150 savings. Audible.com is owned by Amazon now so your audible books are instantly available from the cloud. Sound is very good. Reading books, superb. Gmail, oh yeah. My favorite apps like Evernote, Pandora, PBS videos, Twitter, Facebook, mulitle News channels, and of course Amazon movies rental are all there.", "Title": "Light, Thin, an iPad contender", "Date": "November 8, 2013"}, {"Author": "Dee", "ReviewID": "RY4F539N8X1Q0", "Overall": "3.0", "Content": "The Kindle Fire is OK for playing games but not much else.  Don't like the carousel or the fact that you are asked to download/purchase other items constantly.  Should have bought an ipad.", "Title": "Not an ipad", "Date": "May 31, 2014"}, {"Author": "YukonCat", "ReviewID": "RO7HPBHOSA7AX", "Overall": "2.0", "Content": "I had a disabling injury in the Fall, and my husband got me an early Christmas present of a Kindle 8.9 HDX.  Mostly I used it for reading, and sometimes web surfing.  I never left the house so my WiFi was always available.  Yes, the ads were annoying,and yes, the screen design seemed very non-intuitive. It took me weeks to find basic settings.  But then I was sick.But now, it's summer in Texas and the pool is warming up.  My favorite summertime activity of the past few years has been pool floating with my kindle in hand.  Imagine my shock and dismay when I took my glitzy new color Kindle outside, only to find it is hopeless in sunlight.  The screen resolution is reduced to about 10% of indoor view-ability.  I felt betrayed.  I don't remember seeing anything about that little issue in any of the reviews or product descriptions.  Had I known, I would have gotten another basic kindle and saved myself $300 and a big disappointment.  Cathy - Houston.", "Title": "If you got it for christmas, you might not know … it's blind in sunlight", "Date": "May 12, 2014"}, {"Author": "tim", "ReviewID": "RGKHNHYYH7KFN", "Overall": "4.0", "Content": "Probably the best tablet out there.  Many positives but only two negatives really.The screen looks great.  The size and weight are perfect.  The battery lasts a really really long time.  Definitely the smoothest and fastest tablet I've used.  It just falls short in two areas.  The price is $379.99 which is probably about $100 too much and for one reason really.  Which leads us into the other negative, it only has access to the amazon store and not Google Play.Now again let me reiterate.  At doing web browsing and kindle things it is fantastic.  But if you wanted to play games or access to any app out there it falls short.", "Title": "Near perfection", "Date": "December 19, 2013"}, {"Author": "HS", "ReviewID": "RU129SWVQOV3P", "Overall": "4.0", "Content": "For the price and features I believe I will recommend buying this compared to the IPAD mini which I have. The only feature that i did not like about, which is not a big deal, is its restarting all over again if you have turned on the off wireless feature.Has software and hardware that makes it easy to print out and view docs. No technical details.Space is enough.", "Title": "KindleFire Better than IPAD mini", "Date": "December 19, 2013"}, {"Author": "Steven rivas", "ReviewID": "R2C8JYEOQQZX9", "Overall": "5.0", "Content": "this was Super fast and it had an excellent interface and easy to use.  I willl certainly recommend it to others.", "Title": "simply awesome", "Date": "December 19, 2013"}, {"Author": "Heidi Argyle", "ReviewID": "R2HRGK0G81E8L7", "Overall": "5.0", "Content": "I have tried several tablets and am always frustrated with slowness/loading time. This tablet is super fast and the hd is superb.The whole family loves it and it gets passed from person to person all day long! I also really love the kindle free time for the kids as we can control how much time is spent on games and focus them toward books as well to help improve their reading. :)", "Title": "great tablet", "Date": "December 19, 2013"}, {"Author": "Michael", "ReviewID": "R1B063UJZ3S85I", "Overall": "5.0", "Content": "I finally decided that it was time to upgrade my Kindle Fire (original 7\" version - not HD), which I loved.  In fact, it still works.  My son inherited it.Anyway, I was ready for something bigger, faster, able to do more, but not as heavy or big as my laptop.  So, I started researching, and quickly narrowed the field down to either the Lenovo Yoga Tab 10 (my laptop is a Yoga 13, which I LOVE) or the Kindle Fire HDX 8.9.  I had just about decided to save the $100 and get the Yoga, but there were a few things that kept nagging at me on some of the reviews.  The Yoga's processor lagged when it tried to do too much, the screen resolution was sub-par compared to other 10-inch tablets - those were the big two.So, finally, I bit the bullet and spent the extra money for the Fire HDX 8.9 - and I'm SO glad I did.This machine is so much faster than my old Kindle Fire, and pretty much anything else I've tried.  The screen is big, bright and crisp, making graphics just jump out at you.  The speakers are wonderful - loud and clear  The Wi-Fi works very well.  I have had no issues connecting to my network, even all the way across the house - meaning the signal has to travel through at least 5 walls.The battery holds up pretty well for me.  I have had the tablet for 8 days, and it is just now charging for the second time.  As a caveat, I have been at work for much of that 8 days, but I'm pretty sure that even on my off week, I should get 2 days per charge or so.  Now, I also bought a 11,000 mAh external battery pack at the same time I bought this, and I HIGHLY recommend the one I bought ( B00DUTVOU8 ).  I would really love a bigger battery (or a case with built-in battery), but it works just fine as-is.I have a co-worker who is an Apple aficionado, and he was impressed by the picture and sound quality.  We compared it to his iPad Air - and the Kindle was better in both picture and sound quality.Overall, I have nothing bad to say about this machine. I absolutely love it.", "Title": "I love it!", "Date": "December 19, 2013"}, {"Author": "Julie", "ReviewID": "R2MEX3LQMKG9G9", "Overall": "5.0", "Content": "Brilliant colors, very responsive.  The Mayday button is a great feature.  I have only used it twice, but it looks and works just as it does in the ads.", "Title": "Very nice", "Date": "June 10, 2014"}, {"Author": "shorty", "ReviewID": "RD07JDNI9KTY0", "Overall": "5.0", "Content": "There's more to it than I thought.  I'm loving the May day! I need a lot of help as I am not electronically inclined.  The battery lasts way longer than my Kindle Fire, so my big decision now is, should I use the Fire for reading or music or....should I use the HDX  for that or visa versa(sp) .  And which one should I use for games?  I  receive and send email, check FB on HDX and much more.  As the saying goes, \"I'm lovin' it!\"", "Title": "suprised", "Date": "May 26, 2014"}, {"Author": "Betty J Rector", "ReviewID": "R33TQS3SPPX2DU", "Overall": "5.0", "Content": "I love this Kindle. It is so powerful and user friendly. The clarity is awesome. I had the first generation Kindle Fire prior to this and am so pleased with this upgrade.", "Title": "Awesome", "Date": "May 26, 2014"}, {"Author": "Jose Artur Lobo", "ReviewID": "RJHQC221BIXCF", "Overall": "5.0", "Content": "I love my Kindle Fire HDX 8.9\" Fast downloading, excellent picture quality. Transaction was fast, dispatch was very fast. Great!", "Title": "Astounding", "Date": "May 26, 2014"}, {"Author": "Jim D. Combs", "ReviewID": "R12GNX5SP14PMD", "Overall": "5.0", "Content": "Love the display on this device. Have an IPad Air and IPad 3Gen and love the res and video on the Kindle HDX more than I do the Retina on the IPads. Both are nice, but for me the Kindle gets the edge. Have an Amazon Prime account so that makes being locked down, in with the Kindle tolerable. Makes being limited in my droid choices tolerable. I really loved this puppy when I had it rooted and got out of the box could pick and play with Droid. Still a great device that I love. Use it for reading and video on the road, SOHO, and at home. Had to go with ATT for the mobile service, cell, and it sucks as usual in my area, but you live with what you have. Out of the mountains ATT service isn't as frustrating. Great device and worth the price. Use it for movies and books, a great front as I say  for Amazon services especially if you go Prime and definitely get the ad free unit.", "Title": "Great device even better when I could root", "Date": "May 25, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R2AGYHU5ALAJSK", "Overall": "5.0", "Content": "Enjoying every bit of it.  Should have bought this sooner, have been enjoying it even though our WiFi system out here is sub-standard.  Couldn't have made a better investment.  Thank you.", "Title": "Love It!!!", "Date": "April 8, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3QOH8MMHOZOZ4", "Overall": "5.0", "Content": "I started from the beginning and have moved up with each change.  Thank you Amazon.  The Kindle Fire HDX 8.9\" is awesome.  Can hardly wait to see what is next.  Keep passing on the older versions to my family.  This time is was my daughter instead of my granddaughter.", "Title": "Moving on Up", "Date": "April 7, 2014"}, {"Author": "Warren", "ReviewID": "R2H6EH20CP3D0V", "Overall": "5.0", "Content": "Had the regular kindle fire hd 8.9 and like it. however I wanted the front camera for pictures. Should have got the 64 gig for the storage. Maybe amazon will add a usb or memory slot someday.", "Title": "Like it very much.", "Date": "April 7, 2014"}, {"Author": "fgski", "ReviewID": "R1ZYR1RFENRSSC", "Overall": "5.0", "Content": "Wanted a Kindle Fire when they were introduced, instead I got another table which was OK.  Picked up the Fire HDX and I am blown away with the display, the design (less weight) how easy it is to operate.  Great deal at the offered price.", "Title": "Unbelievable", "Date": "April 7, 2014"}, {"Author": "Pauline", "ReviewID": "R1XGQSE7RR9OO4", "Overall": "5.0", "Content": "I love, love, love handheld computers, and was thrilled with an Android smart phone for a couple of years.  My eyesight is failing (the only thing worse than growing old is its opposite) so the Kindle Fire 7 was a great improvement.  Then I decided I would like something larger with a keyboard and print capable.  The Ipad Air was very attractive in a store, but the price and operating system made me hesitate.  Then I read a review comparing the Kindle Fire HDX 8.9\" to the Air, and was sold.  I love the extra size to make print larger.  An external keyboard did not work out for me, I need to hold the screen too close, and printing is still unexplored.  The young, sharp-eyed engineers decided that with the improved screen resolution they could decrease font size(!) of system text, like settings and messages.  Fie on them!  But web sites are easier to read.I tried the online help feature, and it is wonderful.  A helpful tech showed up in a postage stamp size window and we discussed my problem, I had accidentally turned on an awkward keyboard option, and she drew a red circle around the screen key to long press to turn off the option.  Great!Reading more closely about settings, I discovered I could turn off auto correct on keyboard entry.  That plus using a stylus makes writing on a Fire much easier.I am very pleased with this little computer.  I still need to find out about printing or maybe about storing files on line so I can access them from phone or Kindles.  I would be tempted by a larger one, too, within limits, but this one will do for some time.", "Title": "Love it!", "Date": "April 6, 2014"}, {"Author": "Richard A Schauer \"Jack Shadow\"", "ReviewID": "R2T3VDDD71VN3Y", "Overall": "5.0", "Content": "A gift for wife. Great color, great sound. Books to read, movies to watch, music to listen to, games to play. She loves it. She is happy, I am happy.", "Title": "Kindle = Happy Wife", "Date": "April 6, 2014"}, {"Author": "Txgranny", "ReviewID": "R9UB2Q8YSTFCX", "Overall": "5.0", "Content": "My family all gave me gift certificates or gift cards to Amazon.  They were combined and a Kindle Fire HDX was ordered on my birthday.  I have enjoyed it very much.  It is the first tablet form of computer that i have had.  If I wanted it as a way to rad ebooks, i think i would have liked a lighter-weight Kindle.  But this has so much more that you can do with it and it has been a pleasure to us.  It is like a toy for me.", "Title": "A Birthday Gift", "Date": "April 6, 2014"}, {"Author": "mormor", "ReviewID": "R2PWQ7VJ4NSCCO", "Overall": "5.0", "Content": "When my kindle fire first generation lost the ability to recharge the battery, I was trying to purchase a new battery.  When I talked to customer support, they told me I could not buy new batteries, but they had special prices on newer models in these situations.  I am very pleased.  Thank you, Amazon.  I did need to send back my old kindle fire.", "Title": "excellent value", "Date": "April 5, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3VY1ENFI3QD0R", "Overall": "5.0", "Content": "I have had so much fun with this thing.  Lightweight. Plenty of power.  Was delivered so quickly (overnight), arrived in great shape and was working right out of the box once I hooked it up to my home server.  Now that I had it connected with AT&T; it works everywhere.  It was so worth the price.", "Title": "My Favorite Tablet!", "Date": "April 4, 2014"}, {"Author": "B. D. Beagles \"bookbird\"", "ReviewID": "R17JU2UXISIUJM", "Overall": "5.0", "Content": "I love this new 8.9\" HDX Kindle.  I really don't know what I would do if I didn't have it!", "Title": "Love my new Kindle!!", "Date": "April 4, 2014"}, {"Author": "Mandy", "ReviewID": "R1XFMYQBPPESYD", "Overall": "5.0", "Content": "There is not much more I can say other then this tablet it amazing! Its my first and after months and months of research and comparing, Im so happy I chose this one!", "Title": "Love it love it love it!", "Date": "April 4, 2014"}, {"Author": "Kathleen", "ReviewID": "R2PPJQ02YUOUUN", "Overall": "5.0", "Content": "We choose Kindle because not only can we read the greatest books but also stream  Great movies and programs. We can travel easily with it as it takes only a small amount of space and works almost as well as a laptop . Everyone can use it from our 2yr old grandson on up.", "Title": "easiest most user friendly tablet out there.", "Date": "April 4, 2014"}, {"Author": "P. F. Navas", "ReviewID": "R34HBMLE0I9X5F", "Overall": "4.0", "Content": "I'm still learning how to use all the features, but the main reason I bought it was for reading and it's met my expectations.", "Title": "So far, so good", "Date": "April 4, 2014"}, {"Author": "K. Funk \"kfunk\"", "ReviewID": "R1EVGMF5DW07NJ", "Overall": "5.0", "Content": "Brought for my mother who has lost 90% of her eyesight and loves to read. She love this new kindle with the Mayday and text to speech. This has made her life much easy and a little less stressful. Thank you Amazon again are number 1 with us.", "Title": "Great kindle HDX", "Date": "April 3, 2014"}, {"Author": "Ronald Riccitelli", "ReviewID": "R15YAOZ2R4CXB8", "Overall": "3.0", "Content": "everything is proprietary to amazon. web search and browsing in multiple tabs not there. cannot use Google or Firefox or adobe or anything that isn't amazon. this rates with google's cromebook, the palm, and apple mac vs. windows pc for compatibility with third party software. bottom line it's great if you don't mind buying everything amazon if you can find it!", "Title": "doesn't blow me away", "Date": "March 11, 2014"}, {"Author": "jvw", "ReviewID": "RMEDBK34JK90U", "Overall": "5.0", "Content": "Great product exactly what I wanted. Easy to setup and use, the only exception was getting my hook up to Verizon.  I already use Verizon so just changed my plan increasing my data limit and sharing the minutes between my phone and the Kindle. I was on the phone with Verizon 3 separate times and they couldn't get me connected. I went to my Verizon store and their technical people at the store got me connected up in about 30 minutes or less.  One catch though there are several Verizon merchants in my town but only one of them was a Verizon company or corporate store, the other smaller stores did not have technicians at their stores. So a word to the wise just call your local store first and ask them if they would be able to help you setup a Kindle Fire HDX with the 4GL before you zip on down to their store.", "Title": "Easy to Setup with exception of Verizon 4G side", "Date": "March 11, 2014"}, {"Author": "Sophoeuth Seng", "ReviewID": "R17VSG0KHX8U53", "Overall": "4.0", "Content": "Everything is good with this device, good graphic, battery life, nice size, easy navigation and more. The downside is that I wish I have the option to extend the storage and put my own picture as the background instead of seeing the black background color all the time.", "Title": "Good graphic and good speed", "Date": "March 11, 2014"}, {"Author": "tcl", "ReviewID": "R2TPKL5ZENJOTL", "Overall": "5.0", "Content": "This is my 4th Kindle and the best of them all.The graphics and displAy are great. It automatically goes off so I dontHave. To worry about leaving.it on. 100% better than the first ones", "Title": "Tinas newest Kindle", "Date": "March 11, 2014"}, {"Author": "Judith Walker", "ReviewID": "R32033WMTIAWKB", "Overall": "3.0", "Content": "Basically, after I get it figured out, I think I'll like my Kindle.  I was disappointed to find that it wouldn't work @ 3G, so without some wifi, I wasn't able to use a lot of features.  Not a lot of areas have 4G.  Also, after considerable research (on my computer), I learned I could not show any movies on the TV without a $60 device for the TV to connect to the Kindle.  I haven't done this yet.  Another time when the device kept turning off and the touchscreen didn't work, I learned how to correctly reboot it.  I'm still learning.", "Title": "Some problems with my Kindle", "Date": "March 11, 2014"}, {"Author": "wewokadokie", "ReviewID": "R1EZBAWECK6HDG", "Overall": "5.0", "Content": "I thought my previous kindle fire 8.9 was exceptional, but you just gotta upgrade when you see all the improvements they made with this one! It has met all my expectations, and then some! I find it in my hand every spare minute of the day, and if the truth were known, find myself procrastinating just a little when I need to put it aside a bit....I have a couple of games I go back to over and over, and am building my reading library even more than before....this gizmo is the best!", "Title": "I absolutely love this gizmo!", "Date": "March 11, 2014"}, {"Author": "patricia ennis", "ReviewID": "R3JK82SSV0D24V", "Overall": "5.0", "Content": "Love it, love it, love it!  Much more than I expected.  I haven't had it very long, but have read several books already.", "Title": "It's great!", "Date": "March 10, 2014"}, {"Author": "Letsgorvn", "ReviewID": "RXL1ZRULKC8D2", "Overall": "5.0", "Content": "I love the HDX! I used to have another type of 'tablet' that had a color screen but it was not as user friendly as the Kindle Fire HDX is. I have already used the \"Panic Button\" and within 5-15 seconds someone is right there on your Kindle wanting to help you out! And they are there 24 hrs./day. 7days/per week! The greatest thing Amazon has ever come up with! The clarity on the screen is absolutely  indescribable, it is so good!I would absolutely recommend this!", "Title": "Kindle Fire HDX 8.9\", HDX Display, Wi-Fi, 16 GB", "Date": "March 10, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R2TB1X4QIOF4U3", "Overall": "3.0", "Content": "The jury is still out. I love the feature of having a live person to help me with questions, don't like the glare when I'm reading from the screen being so shiny. I haven't spent that much time doing other things yet. So as time goes by my rating could change.", "Title": "mixed feelings", "Date": "January 28, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1GG9VNU0YSCR7", "Overall": "4.0", "Content": "I owned the first kindle fire when it came out. It was slow, the touch key pad never typed right and where you plug in for power on the device was poorly designed that it finally detached from the mother board where you could no longer charge it. I believe amazon has fixed those problems with this one. I love the image, the touch screen, the size and it's fast. Things they need to fix is the camera. It says it is a 8 meg pix but my picture come out blurry or poor quality. The footage part comes out ok. The sound on the device could be louder. Also I bought a Fintie cover for my kindle and due to the magnetic for the automatic turn off when you shut the cover, it interrupts the use of the camera. Meaning when you want to use the camera or video there is a picture in the middle of the screen telling you to slide your device up to change the front camera to rear. I talked to someone in technical support and they told me they have had many compliments about the issue and they are trying to resolve an update to fix that problem. That was in December and now it is end of January no updates  yet to fix it. I do like this product and I would recommend to those that want to watch movies, play games read books, and research the net.", "Title": "Amazon fixed problems from the first one they made but they still have some issues with this new one", "Date": "January 28, 2014"}, {"Author": "Conrad Kimbrough", "ReviewID": "R2CIZ3HAZP7CJO", "Overall": "5.0", "Content": "I don't know what I would do without it. All my friends have a different \"fruity\" brand.My Kindle will connect to Wi-Fi when theirs won't. It makes them angry that they paid more than I did.The Kindle Fire HDX is easy to use, has all the features that anyone needs. Lots of Apps are available  and are easy to install.This is the best tablet available in my opinion. The graphics are amazing. I plan to order another one in the future for my best friend and future wife. Thank you Kindle!", "Title": "AMAZING!", "Date": "January 24, 2014"}, {"Author": "Ethan", "ReviewID": "R2XO1ORT7G6Q7T", "Overall": "5.0", "Content": "Qualcom 4-core 2.2G CPU, 2560x1600 8.9 inches screen in a tablet, OMG!The design of each hardware component is great, the most beautiful tablet I've ever met.", "Title": "Great hardware, amazon life-style software, a wonderful product", "Date": "January 24, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3ISVCYIJ1XFK2", "Overall": "5.0", "Content": "I bought this after owning several Android tablets, each with th Kindle reading app. The actual Kindle is light years ahead!  I like my Kindle HDX 8.9\" so much I have pretty much sidelined my netbook in its favor.  If you love to read and you want to enjoy using the Internet quickly and easily, you'll love this Kindle.", "Title": "Great Product!", "Date": "January 24, 2014"}, {"Author": "Mike Binns", "ReviewID": "R34U125ZL5Z7GS", "Overall": "5.0", "Content": "got and never looked backed the Mayday feature is a fantastic idea used it and got answers fast and a lot of good appsto sink your teeth into I have news movies and weather with me at al times", "Title": "really great", "Date": "January 24, 2014"}, {"Author": "Gary D. Church \"pawnman\"", "ReviewID": "R223YM30G2VRPL", "Overall": "5.0", "Content": "I truly Love my new KJindle Fire HDX. The first plus is the weight of it. It is so much easier to hold and read or whatever you may be doing with it. The screen color is outstanding. My wife has an Ipad Air and my Kindle Fire HDX is lighter and has better color. I occasionally watch short movies and the picture was amazing. I would recommend the Kindle Fire HDX to anyone. Plus, having the Mayday button to use as needed. I used it once and was very impressed as to how quickly my question was addressed and resolved. I would recommend this product to anyone who is looking for a great value and a great product.", "Title": "Great Kindle Fire HDX!", "Date": "January 24, 2014"}, {"Author": "riderrick65", "ReviewID": "R1YN7PO1STZU59", "Overall": "5.0", "Content": "I self gifted myself with the Kindle Fire this past Christmas after seeing & reading the reviews on it. I am in my late 60's and trying to keep up with the younger crowd and couldn't have picked a better tablet for the money! I find it easy to use and the online support is great! There is so much you can do with this tablet it is unbelievable and I would recommend this Kindle Fire to anyone who is looking for a good inexpensive tablet!", "Title": "I couldnt be happier!", "Date": "January 17, 2014"}, {"Author": "Bernie", "ReviewID": "R2FGT0JFF4Y13M", "Overall": "5.0", "Content": "Absolutely beautiful picture. Even better than expected. Would recommend this item to everybody. I bought it for my wife and she loves it.", "Title": "Beautiful", "Date": "January 17, 2014"}, {"Author": "R. S. Hood \"Movie buff\"", "ReviewID": "RO6ZKJ1NCWYNH", "Overall": "5.0", "Content": "The screen is really sharp, great size, lightweight and responsive. I had to get used to the touch screen as I never used one before, but after a while It's easy to navigate. The help app is awesome and free. Great for watching videos and surfing the net, Check your e-mail on the go.", "Title": "Great tablet.", "Date": "January 17, 2014"}, {"Author": "rkhjr", "ReviewID": "R1FWDTNYEQKDDS", "Overall": "5.0", "Content": "I purchased this kindle for my wife during Christmas!  She has nothing but good things to say about  it and recommends it highly.", "Title": "Christmas gift", "Date": "January 17, 2014"}, {"Author": "Darlene N. Blacketer", "ReviewID": "R2G1ZHJM4Q82EO", "Overall": "5.0", "Content": "The resolution, the size, the colors, everything about it, I love it, love it, love it.  I recommend the kindle to everyone that will listen.", "Title": "Love it", "Date": "January 16, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R9B9U8DRIZX61", "Overall": "5.0", "Content": "I am very pleased with my kindle fire HDX 8.9 mine was given to me as a gift for Christmas.  I primarily use mine for reading and web surfing.  Since Christmas I have only had to charge it once and I heavily use it for reading nightly for at least two hours or longer. I am able to dim the screen where it does not effect having light on or off.", "Title": "best gift in a long time", "Date": "January 16, 2014"}, {"Author": "Willie Jones", "ReviewID": "R1IEJMQ6GDKEV9", "Overall": "5.0", "Content": "This is wife writing review!!!!  Love my new Kindle - does everything I need in just a small package.  Usually take my laptop on trips - but this is my new companion!  Also have the first Kindle Fire which will be going to my daughter!", "Title": "Perfect Gift", "Date": "January 16, 2014"}, {"Author": "Harshjudge", "ReviewID": "R15XSEIAQURC9A", "Overall": "5.0", "Content": "Great graphics, easy to to select a wide variety of media. This has become one of my all time favorite devices. And the little girl that responds to your one button request for help, is amazingly helpful. So impressed was I that I bought one as a gift for one who has been struggling with other readers for half a decade. The Kindle Fire HDX 8.9  has ended the struggle. Another happy reader and researcher thanks to the fiery Kindl;e.", "Title": "'nother hit from Amazon", "Date": "January 16, 2014"}, {"Author": "WWS the 4th", "ReviewID": "R2KVP4SONBESJS", "Overall": "5.0", "Content": "User friendly! I Love the high def screen and the weight of this product. I look forward to future products by amazon.", "Title": "Solid tablet", "Date": "January 16, 2014"}, {"Author": "feathers", "ReviewID": "R38XFK7TJZLTU5", "Overall": "5.0", "Content": "I HAVE HAD THIS FOR ABOUT ONE MONTH, AND IT HAS MET ALL MY EXPECTATIONS.  CRISP CLEAR SCREEN, AND REALLY LIKE THE SPECIAL ORAGOMY (SPELLING) COVER.", "Title": "Met all expectations", "Date": "January 16, 2014"}, {"Author": "K B", "ReviewID": "R73QIKTAISUF7", "Overall": "5.0", "Content": "I bought this as a Christmas present for my girlfriend this year after owning a 1st Generation Kindle Fire.  The difference is STAGGERING.  The 1st Gen is a really great unit in its own right, but the HDX is leaps and bounds ahead.  The processor is so much faster, the load up for any apps or books is hands down the quickest of anything I've seen (even faster than her Galaxy SIII phone with the non-hd apps) and the display is by far the most amazing I've seen on any tablet or handheld device.  Without a doubt, well worth the money!  So much so, that I'll be upgrading to one in the near future!", "Title": "Amazing!", "Date": "January 16, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R14KRYQJW3IPMP", "Overall": "5.0", "Content": "This is a great upgrade from my first kindle, easy to use and great from other uses as well. May not need my laptop any longer!", "Title": "Kindle HDX", "Date": "January 16, 2014"}, {"Author": "Joseph Waschak", "ReviewID": "R4C6PLIN5QUQN", "Overall": "5.0", "Content": "Large display!  Finally when I watch TV or download a magazine I don't have to scroll all over, like I do on my smartphone.", "Title": "Great tool", "Date": "January 16, 2014"}, {"Author": "ThePeoplesChamp", "ReviewID": "R310O5TX5IDWWY", "Overall": "5.0", "Content": "This is my 3rd Tablet PC. It is very smooth and fast! By far the best Kindle yet. Sturdy built unit and the quad core processor makes for an almost instant no lag program load. Highly recommended! Skype runs smooth as butter. My other tablets did not run skype without using alot of its resources which made video quality poor. Not this unit HD front and back camera's for superior photo and video shots.", "Title": "Great Tablet", "Date": "January 16, 2014"}, {"Author": "Leta M. Franklin", "ReviewID": "R6BRKGR3SPJGI", "Overall": "4.0", "Content": "I gave this to my grown son after he suggested he would like to have same.  He was happy and he is knowledgeable, so I know it measured up to his expectations.", "Title": "This was a gift.", "Date": "January 16, 2014"}, {"Author": "David K.", "ReviewID": "R2ODUCSA0V7PPV", "Overall": "5.0", "Content": "I love the picture quality..... you cant even see the pixels on the 8.9 HDX. Watching movies is the the number one thing for this tablet, along with reading books. For the price.... the Kindle Fire HDX has the Apple I-pad and the Samsung tablet beat hands down. Silk is fast and runs great. I get G-mail and YouTube just fine on this tablet, not sure what people are talking about not being able to get gmail and YouTube. I have a Apple I-Pad 2 soooo glad I bought this and saved some money.  I have shone all my friends and they all love it ! Several have since purchased the Fire HDX.....they have yet to be disappointed ! Only thing that really wasn't needed was the 64GB because the Kindle Fire HDX has cloud storage. But what ever ! I have it if I ever need it !", "Title": "HDX the best Kindle Fire to Date !!", "Date": "January 13, 2014"}, {"Author": "Amazon Customer \"JKM\"", "ReviewID": "R2A5DA7C86RJF2", "Overall": "4.0", "Content": "I like the clarity and ease of use of this tablet.  It is fast and easy to use.  It is good to hold, light, I almost hated to put a cover on it, so I purchased a more open cover that doesn't detract so much from the tablet itself. The apps are pretty good, and I have found replacements close to those that I enjoy on my other Android tablet.  Of course it is very linked to the Amazon sphere of products.  I wish I had waited to add Amazon Prime, because of the delivery delay from ordering that my one month free trial was almost all used up before I received my tablet so I was not fully able to enjoy on the tablet.  That is why I cancelled Amazon Prime. My main complaint is that I still miss Google Play Store access.", "Title": "Very good tablet, fast, clear, light.  Would be perfect with access to Google Play.", "Date": "December 6, 2013"}, {"Author": "Constance", "ReviewID": "R1LXZ4WCD9QTBJ", "Overall": "5.0", "Content": "Perfect size screen and so sharp and easy to read books on. . Not to heavy. Movies look fantastic. Amazon Prime has so many movies and books for me to choose from.....  is a very good value  and with free shipping.... How can you beat this?", "Title": "love this new kindle fire hdx 8.9", "Date": "December 6, 2013"}, {"Author": "aml", "ReviewID": "R37QK3YP1ZNKI8", "Overall": "5.0", "Content": "Very quick to load information.  The clarity of the pictures and web information is just unreal.  The ease of using this kindle and the weight for this size of tablet is great. Another great feature is \"May Day\", which I have used and the tech. support has been great.", "Title": "Excellent  Tablet", "Date": "December 6, 2013"}, {"Author": "daniel lane", "ReviewID": "R37OAI03TCFJ1A", "Overall": "5.0", "Content": "I was not sure how much I liked  the Fire at first but after using it for the last two weeks I love it.  It is my first experience with a tablet as i've only used a laptop before. The mayday button is a great feature. Very helpful. I thought at first I would return it  but have decided to keep it. I am very happy with the purchase and would recommend it.", "Title": "Great purchase", "Date": "December 4, 2013"}, {"Author": "Stephen J. Lemmons \"DocTronics\"", "ReviewID": "R3AP666YIASZNH", "Overall": "5.0", "Content": "It is outstanding and easy to use no matter if you use it as an ebook or to access the internet and use it as a tablet.  There is one draw back I see a lack of an instruction manual.  It more than justifies the five stars if possible and it needs a sixth star.", "Title": "Outstanding tablet/ebook.", "Date": "December 4, 2013"}, {"Author": "djtaylor", "ReviewID": "RUMR5O2GXUVTO", "Overall": "5.0", "Content": "I love my Kindle.  This is my fourth one.  Started out with the paperwhite which still can't be beat for reading in the sun, helped one of my grandsons have a Kindle Fire by helping him purchase my last one.  Love the lightness of my HDX!", "Title": "Love the HDX!", "Date": "December 3, 2013"}, {"Author": "Ann Hawley", "ReviewID": "RP7FUP150P1AE", "Overall": "5.0", "Content": "Easty to use - hopefully I will have more time to play with it over the holidays; but I was very satisfied with my decision to purchase the Kindle Fire HDX.", "Title": "Love it!!", "Date": "November 29, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3PKLQ0NULJQ1I", "Overall": "5.0", "Content": "Love how light it is & how quickly it responds. Wish the glass screen didn't show fingerprints, this is my only complaint. Can't imagine using any other tablet. My husband is enjoying my old kindle fire 8.9\".", "Title": "Love my kindle fire HDX 8.9\"", "Date": "November 29, 2013"}, {"Author": "Todd Lee", "ReviewID": "R1U4IWHSBULNQZ", "Overall": "4.0", "Content": "While this tablet is great for most things, it just wasn't right for me. If you need flash player for anything, you will be disappointed. Otherwise, the picture, sound, and everything else works great. I really wish I could have kept it.", "Title": "Great tablet but......", "Date": "November 29, 2013"}, {"Author": "Pablo Alfaro Porras", "ReviewID": "R1VB0OAWGU7JKI", "Overall": "5.0", "Content": "I am very satisfied with my new Kindle Fire HDX.  It's very fast and the resolution is great!  New features are amazing!  It is very light to hold.", "Title": "My new Kindle Fire HDX!", "Date": "November 25, 2013"}, {"Author": "LisaLisa", "ReviewID": "RH9ETF0JZA7YV", "Overall": "5.0", "Content": "I thought long and hard..iPad or Kindle? I decided to purchase the new  Kindle and I am most pleased. I have found some really fun apps and love the built in camera and video. Amazon has much to offer in apps and I just appreciate getting such a great product at such a reasonable price. This is my first tablet and I enjoy it everyday!", "Title": "I Love it!", "Date": "January 9, 2014"}, {"Author": "Dru", "ReviewID": "R1W256KDSDB5LR", "Overall": "5.0", "Content": "Fast, light, responsive and affordable! Comparing to my iPad Air, this device is truly goes head to head with it. I would recommend this to anyone in the market for a tablet.", "Title": "Great product!", "Date": "January 9, 2014"}, {"Author": "Rockndaddy", "ReviewID": "RLGEJY6M3GNNA", "Overall": "5.0", "Content": "The Kindle HDX 8.9 is nothing short of FANTASTIC!!!13.2 ounces with 5.1 dolby audio is amazing !!!The picture is unbelievably sharp and clear sporting an 2560X1600 HDX displaythat has 1080P falling way behind.Office Suite is preloaded so you can keep up with your office work.This little Jewel also has front HD 720 camera and an rear 8MP camera that takes vivid lifelike pictures.The action of the Silk Browser is remarkable and very easy to navigate.There is so much more about the Kindle HDX,free books to borrow from Amazon library, kids games,over 100,000 apps.The 8.9 HDX Kindle does it all.It seems like there is not enough hours in the day to use all the features of this little wonder.Now I am thinking when is Amazon going to give us an Kindle phone?", "Title": "Truly An Wonder In Its' Own Right", "Date": "January 8, 2014"}, {"Author": "Lori Hinkle \"Emerald\"", "ReviewID": "R37IGQTTZP6Q7J", "Overall": "5.0", "Content": "Overall I love this device. The only bad thing so far is it still won't run Adobe flash player which is a pain. Picture and sound are amazing. The camera is a great addition and takes good quality pics. This is my second kindle fire and I recommend it to everyone.", "Title": "I love it!", "Date": "January 7, 2014"}, {"Author": "Sherrie Mccauley \"shermorley\"", "ReviewID": "RA38TY7ZHYEA", "Overall": "5.0", "Content": "I am a kindle junkie, this is my forth Kindle fire, 5 if you count my original kindle. I absolutely love it. Now my son, daughter and granddaughter all have one. I do not leave home without it. I have friends who have the iPad, they've asked about the kindle and I've told them that my fire can do everything their iPad can and It didn't cost me as much. I totally love this thing.", "Title": "Awesome, can't say more.", "Date": "January 7, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3051Y5YA1PE75", "Overall": "3.0", "Content": "I used the Amazon trade-in program to purchase the HDX 32 GB (wanted the 64 but it was unavailable).  I had been using the 8.9 Fire HD model and I really loved it.  I decided to upgrade because we are so often away from WiFi and I wanted the 4G LTE model.  The issue for me was that once I received the tablet, it was only then that I was made aware that this tablet will only support 4G not 3G at all(Verizon).  I live in an area with 3G and I travel to remote areas where I am lucky to get even a 3G signal.  I let Amazon know how disappointing this was and they kindly refunded the $100 I paid to get the 4G enabled tablet.  I was grateful but I would not have traded my Fire HD in the first place for just another tablet that was WiFi enabled.  Yes the graphics are better than the old tablet and yes there is now the ability to use Miracast technology so streaming is wireless with the use of a dongle I purchased, but this new tablet has issues.  I am writing this review on my laptop because while trying to type the review on the Kindle, it, for no good reason reloads the web page on which I am attempting to type, requiring me to start the review over and over again.  I fianlly gave up and decided to use my computer instead.  This issue has plagued my tablet since the first time I turned it on.  Generally it is only annoying but when you are typing and you have to begin a long review again, it becomes more than annoying.The books, music and video download with no problems and reading works seamlessly.  I did learn that with 3MG on my wifi I can stream a movie or TV show as long as it isn't in HD.  I will keep the HDX and live with the web page reloading issue but if you already have a Kindle Fire HD I would recommend keeping it.  Mine worked flawlessly 100% of the time.  I agree with some other reviewers that this device was rushed to market before all of the bugs were identified and corrected.  I am hopeful that software updates will remedy what ails my tablet.", "Title": "Not everything is as advertised", "Date": "January 3, 2014"}, {"Author": "Circe", "ReviewID": "R28WSLXN6UWIQY", "Overall": "5.0", "Content": "I'm so excited to have the new Fire. I'm learning how to use it and need to figure out a few things. Do wish it came with a primer to learn the basics though and don't want to use Mayday for silly little things that I don't understand. I'm not very tech oriented unfortunately. I'm looking forward to using Skype when I travel and it has a great camera!", "Title": "Super!", "Date": "December 2, 2013"}, {"Author": "Kintan Brahmbhatt \"Kintan\"", "ReviewID": "RQVOOTAXDYXD4", "Overall": "5.0", "Content": "I love everything about it except placement of volume buttons.I was blown away by May day. This is the future of customer support!", "Title": "Insanely light. Love Mayday!", "Date": "November 28, 2013"}, {"Author": "Sharon Friedman", "ReviewID": "RVGHXCYZTQSV8", "Overall": "1.0", "Content": "Think twice before using the installment plan!!I received 2 defective Kindles,and by the time both were returned,the plan had begun charging my credit card in monthly installments. This continued for weeks, long after I had received notices via email that I owed Amazon nothing. If you choose to use this plan, and the tablet needs to be  returned, be prepared for many long conversations with customer service.", "Title": "Kindle MIS-Fire", "Date": "May 9, 2014"}, {"Author": "Teresa Weber", "ReviewID": "R1Q6DJDLP32F9P", "Overall": "1.0", "Content": "I just received my new Kindle Fire HDX 8.9 with wi-fi and 4g. Paid a lot but at first look I loved it. Then after trying several attempts to connect the 4g with my Verizon account, Guess what? Verizon does not support the Kindle 8.9 ! Even though this very web page says that the 8.9  is compatible and runs on both AT&T; and Verizon Data Plans. Verizon does not accept it! Very angered and disappointed because I was told by an Amazon Representative that it did work with Verizon . Shame on you guys for advertising it on the 8.9 advertisement page. I am totally returning this device and expect every cent returned to me. Also used the Mayday feature it worked great. Karen a kindle representative was great and Mayday worked as advertised. And yes Karen did acknowledge that the Kindle HDX 8.9 4g is not applicable to Verizon. So there you go. False advertising ? Very Dissapointed.  Danny Weber", "Title": "\"Totally Dissapointed\"", "Date": "May 7, 2014"}, {"Author": "Pedro A. Vera", "ReviewID": "R19I6IWACT3FK4", "Overall": "5.0", "Content": "We were early adopters to almost every single Kindle ebook reader, and we picked three of the original Kindle Fire 7\" as soon as they were announced. We eventually moved to the 7\" HD and last Christmas I got my wife the 8.9\" HDX because she wanted a larger screen.Our son had an iPad 2 as a Christmas gift in 2012 and my company issued me a second iPad 2 sometime in 2013. He likes his, but has already gone through one warranty repair for a bad GPU and three insurance claims for cracked screens (Walmart has an amazing warranty extension plus insurance, it's insane). My work iPad 2 hasn't broken yet, mostly because I don't use it. I hate the damn thing. It is slow, it is heavy and it is weird.And my hate for the iPad 2 got worse when I got the 8.9\" HDX for my wife because while the screen was smaller, the device practically weights nothing. And the screen is amazing. So I got myself one too.I actually like this thing so much that many times I read with it instead of using my PaperWhite. The PaperWhite is now used mostly when I am out of the house. If I am at home I rotate between the 8.9\" HDX and the PaperWhite. It is light enough that I can read or watch movies in bed, something I can't do with the iPad 2.Cons: Very hard to locate the back buttons by feel. In the 7\" HD I was used to run my finger along the edge (this is in the dark) until I felt the headphone jack, but now I have to feel for the speaker grille, which tells me if I am holding the device right.  Yes, I could turn on the lights, but the idea is to turn on the device without waking up my wife.Durability: it is too early to tell, but mine has already survived a nasty fall that would had murdered my iPad 2. I had the 8.9\" HDX on the holding tray on a treadmill, I knocked it over, it landed on the treadmill track, BANG, it bounced, landed on the hardwood floor, BANG. Not a scratch.Screen: fantastic. Photos look like glossy prints. Video looks incredible, no slowdowns at all. Reading is much more pleasant than on a 7\" Kindle Fire (for reading purposes you can't compare the original Fire to any of the e-ink Kindles), and nicer than the 7\" Kindle Fire HD (not by much, but it is better). I never play games but my wife seems to spend hours playing games on hers, never a complaint except mine whenever I see a new order for Amazon coins.Chassis: really nice, I like what Amazon did except that they could have added some kind of marking one could use to locate the buttons by touch. The buttons are better placed than on the HD 7\". And it weights nothing, it is amazing how light it feels.Software: Not a problem unless you depend on Google-branded apps. If you aren't joined to Google at the hip, then you won't feel much of a difference between this and a pure Android device. You can side load without jail breaking, or you can jail break the device and risk warranty issues later, but that's up to you. I believe that for most people this is very handy, especially if you are a Prime subscriber.Sound: I prefer headphones, but my wife uses hers with the built-in speakers exclusively, and they sound very nice.Value: Even tacking a 2-year square trade warranty+insurance policy, and even taking into account that you won't get Google-branded applications, this is a fantastic deal. I expect to pick up a third one as soon as my son's 7\" HD runs out of its warranty extension.", "Title": "I hate our two iPad 2s", "Date": "March 23, 2014"}, {"Author": "Marsha Goddard", "ReviewID": "R6YL0CKKNALRU", "Overall": "5.0", "Content": "My new Kindle Fire is great! I can store multiple books AND play games on this one unit. Only disappointment is in the apps available.", "Title": "So Glad I bought this!", "Date": "May 8, 2014"}, {"Author": "Guy W. Shoemaker", "ReviewID": "RX5IU2ZL0J7KP", "Overall": "5.0", "Content": "Good-bye iPad!!  Much stabler, great screen, does everything the iPad did for me plus I can get my subscriptions on a device I actually like.", "Title": "Better than an iPad for a lot less", "Date": "May 7, 2014"}, {"Author": "lildeb", "ReviewID": "R2UP09BCYBHZ7M", "Overall": "5.0", "Content": "I love this tablet.  It is small enough to fit anywhere but large enough to play games, enjoy movies and see my e-mail.  As I am getting older i thought a larger tablet was a good idea...I was right.  Will recommend it to anyone.", "Title": "Kindle Fire 8.9", "Date": "May 7, 2014"}, {"Author": "beverly cooper", "ReviewID": "ROUGL6XBYUEAE", "Overall": "5.0", "Content": "More memory for book and music lover.Easy access to email and magazine without problems and sign-inAutomatically download game, music, TV series(other than amazon prime)Clear and cyber screen", "Title": "Useful for Entertainments and for Traveling", "Date": "May 5, 2014"}, {"Author": "P. NARAYANAN", "ReviewID": "R2XPHLVPXLE5EZ", "Overall": "5.0", "Content": "So I'm an apple fan boy, I have an iPad, iPhone, macbook.. I went into Best Buy to buy a iPad mini, then i checked out amazon kindle fire hd.. I was certainly blown up by the product. I know from content perspective, it's not clean as apple store, or fire os is better than ios. But who cares, I get mostly the same contents, and love to read on kindle fire HDX. the best part is the sheer light weight of the device, it is incredibly light. you could certainly hold it with one hand and use it most of the times. The screen resolution is far superior that iPad. So far I have been using it for 2 days, and I love it.  Buy it for 339, you won't be disappointed. It's cheaper than iPad mini. so It's not even that hard.", "Title": "love it better than Ipad", "Date": "May 4, 2014"}, {"Author": "Dodie", "ReviewID": "R95NJGBPAIVIZ", "Overall": "3.0", "Content": "I chose only three stars on this device because I have had a few problems with it so far. I need to use the May day soon, haven't really had time. It randomly shuts off or locks up. It does not have to reboot but I still find it somewhat annoying. And the sound is not as good as my old kindle fire hd 7 inch. It's a little hard to hear sometimes. But I do love how the kindle fires are set up. If these problems are fixed, this would be the best tablet ever!", "Title": "kindle fire 8.9 hdx", "Date": "April 23, 2014"}, {"Author": "Gerald Lacerda Sr.", "ReviewID": "RV955AJ5FBU68", "Overall": "4.0", "Content": "I like it very much except It needs to let you have access to the Google play store. That would make it perfect. That is the reason I don't buy Apple products. If I buy something you should have no right to control what I put on it. You did not give it to me for free. I can side load some stuff, but the play store won't work due to it being blocked. That is a major drawback. This is my 2nd one and probably my last due to the app issue.", "Title": "Very nice", "Date": "April 17, 2014"}, {"Author": "Deborah", "ReviewID": "R25ZLRM6N07XZN", "Overall": "5.0", "Content": "I rated this product as 5 stars because I can do anything I desire and it is portable.I like (love) this product because of many positive factors.  I can do anything I desire and take it anywhere.  I can read my eBooks' at home, in the car, at school, etc.  I can listen to music, watch TV, watch videos, play games, and utilize apps for other businesses such as Internet programs on my computer and laptop.  It has quick to access technical support at any time with the 'Mayday' button.  My Kindle has access to wireless sites anywhere in my state, country, and the world.  The Kindle Fire HDX is everything I could expect for a portable device.  Therefore, there really is not any reason right now for me to dislike my Kindle.  There is only one negative aspect about my Kindle Fire HDX.  It does not come with any instructions on how to use the Kindle.  I had to buy a manual on how to use the Kindle Fire HDX when I believe it should come with it.  Therefore, I have had to access technical support with the 'Mayday' button constantly!Yes, I would recommend the Kindle Fire HDX to family/friends because of all it can do.  It was less expensive compared to other products similar to the Kindle Fire HDX.  I researched many devices and the Kindle is the best and least expensive device.", "Title": "Kindle Fire HDX", "Date": "April 16, 2014"}, {"Author": "Doug", "ReviewID": "R3JZCK1S8ILSCG", "Overall": "5.0", "Content": "I enjoy the Kindle Fire HDX for its ability to do different apps and games. The Kindle Fire HDX is a great reading device.", "Title": "Kindle Fire HDX", "Date": "June 9, 2014"}, {"Author": "Nancy Norris", "ReviewID": "R2KPFF9Y7M17KC", "Overall": "4.0", "Content": "I love the size of this HDX but ....it doesn't have flash there's a lot of thing's I can't watch. With my old fire I didn't have that problem. The color is great when you look at pictures.", "Title": "kindle fire 8.9\" hdx,Wi-Fi,16 GB- includes special offers", "Date": "April 29, 2014"}, {"Author": "Donna", "ReviewID": "RJO4UVEYT9L2D", "Overall": "5.0", "Content": "I like that it was real easy to start using it right out of the box. the game graphics are superb.", "Title": "Love it", "Date": "April 29, 2014"}, {"Author": "Patricia A. Wilson", "ReviewID": "R18S0877D9C070", "Overall": "5.0", "Content": "This one is worth the cost and more. Very fast and the graphics are outstanding. So far I have absolutely no complaints. My other Kindle is the Kindle Fire HD,  32 GB and it works just fine but was a little too heavy for my small hands and was getting slow because of all the books I had on it but overall a really good reader. Now I have the best. I can't wait till they release a new Kindle with double the GB's.", "Title": "LOVE MY NEW KINDLE", "Date": "April 29, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R3NE6HNU3KOQVS", "Overall": "5.0", "Content": "I love my Fire, HDX.  Had a question when I first got it and had immediate help from Amazon.  The books are a joy to read - so crystal clear - and games and videos are bright and eye-catching.  Had a friend pick it up to take a peek and his first reaction was \"Whoa\"!  That about says it all.", "Title": "Wow!", "Date": "April 22, 2014"}, {"Author": "Pamela", "ReviewID": "R3G5WGTYFFQ831", "Overall": "5.0", "Content": "I love my Kindle Fire HDX it is perfect I find i'm reading more and even on the web with it. I can watch movies any where that has wi-fi. It doesn't glare badly at all I just had it outside with me on a beautiful sunny day and it was perfect.", "Title": "Can't stop using it", "Date": "April 22, 2014"}, {"Author": "aimrehab", "ReviewID": "R1CSX7H33AU06T", "Overall": "5.0", "Content": "Still learning how to use all the capabilities, I love what I've mastered so far. So much easier at times to use rather than pulling out my laptop. I was reading all my Kindle books on my phone and it so much easier to read on the tablet.", "Title": "Love it", "Date": "April 21, 2014"}, {"Author": "parrington43", "ReviewID": "R1YVAO3ZY60PQY", "Overall": "5.0", "Content": "This is so much lighter than the 1st generation Fire. The screen is bigger but it's lighter! Same apps available, same fast charging, same quality. The only thing I am not sure about is the Silk Browser. Flash does not work with Silk and when available, you are prompted to use an \"experimental\" player. Some videos just will not play on this format. Too bad. Am hoping they are working on this.", "Title": "Kindle Fire HDX", "Date": "April 21, 2014"}, {"Author": "Judy", "ReviewID": "RKU5HDK9GG6YV", "Overall": "5.0", "Content": "As a long time Kindle owner, I looked forward to a larger version for better readability for magazines and maybe videos and I wasn't disappointed.  This size is perfect to hold and read and large enough for watching videos, unbelievably sharp screen, good sound and connects easily to Wifi.. It has a \"learning curve\" but not too difficult for most, lots of nice features, holds a long charge, camera is useful and O.K. I would have liked a detailed hard copy users manual instead of the quickie \"how to charge and turn on\" starter guide.  All in all, impressive, awesome and I'm pleased.", "Title": "Simply Awesome!", "Date": "April 21, 2014"}, {"Author": "Sandra Campbell", "ReviewID": "R361GG7LGING9J", "Overall": "5.0", "Content": "I got my granddaughter one for Christmas, the 7 inch display, and when I found out what it can do, I had to get one for myself! It is amazing !! I am glad I bought that and not a  different Tablet that cost hundreds more, I think this Kindle holds up to most of the other.", "Title": "I love my Kindle", "Date": "April 21, 2014"}, {"Author": "michelle epp", "ReviewID": "R187QMPZ2F12H7", "Overall": "3.0", "Content": "I got the new HDX a few day's ago. I use to have the kindle fire HD, but that stopped working...for no reason. I did have it a little over a year, so I couldn't get it replaced:(  but anyway, I got the new one 3 days ago, and last night IT STOPPED WORKING! For no reason! I didn't drop, spill anything on it. It just STOPPED WORKING! I put it on the charger and let it charge over night, next morning,  hit the power botton and it still didn't work! I tried holding the botton for 1 min, then 2 min... still didn't turn on. Luckily I still had the receipt (bought it from mejier) and they replaced it:) but seriously, this is the second time I have had a problem with the kindle products. If it happens AGAIN, I will be done purchasing kindle tablets, and all that ish.", "Title": "good product just has duds.", "Date": "March 24, 2014"}, {"Author": "deborah Miller", "ReviewID": "R30IDQTTA4OZFL", "Overall": "5.0", "Content": "I upgraded from a Kindle Fire HD to the HDX 8.9, and I love it. It comes with the mayday help button, but I've never used it. The device is so simple to use.I've loaded movies from amazon and mp4 also, with no problems.I love this Kindle", "Title": "Kindle Fire HDX great product", "Date": "March 24, 2014"}, {"Author": "Andrea Pena", "ReviewID": "R3UE6MRZIX50CN", "Overall": "5.0", "Content": "I really love how intuitive this device is.  The picture quality and sound are excellent.  The camera for videos and pictures are as good as to be expected for a mobile device.", "Title": "Awesome device, easy to use.  Picture quality and sound are stellar", "Date": "March 24, 2014"}, {"Author": "Sandra", "ReviewID": "RMHS0A90Q2UZ5", "Overall": "5.0", "Content": "I love this product it is amazing especially watching movies and TV show, it shows the true colors and really fast!", "Title": "Great product!", "Date": "March 24, 2014"}, {"Author": "noah", "ReviewID": "R29AO2UH2QV9JA", "Overall": "5.0", "Content": "I got all my family members kindles HDX we are the biggest fans of these tablets we just love everything about it I think it beats all I pads tablets.. I recommend this tablet to everyone you can do everything on this tablet :)", "Title": "what can I say one of the best tablet I have ever own", "Date": "March 23, 2014"}, {"Author": "Mel", "ReviewID": "RL7HVNVWYJUP6", "Overall": "3.0", "Content": "I was very happy at first, but I soon realized that some websites, like my medical insurance site, it does not work. Also the website I really wanted to enjoy, it does not work for that either. Google's app for android does not work. And now I am pretty disappointed. If anyone out there wants to listen to coast to coast am, don't plan on using this kindle. Maybe some day there will be apps to solve my problems. The excitement is OVER.", "Title": "Nice, but lacking", "Date": "March 23, 2014"}, {"Author": "debbie vanmeter", "ReviewID": "R3GC4OY2FAZX0J", "Overall": "5.0", "Content": "this is great,i have last years and it was ok but this one is crisp to watch shows on or play games would tell everyone to buy one....", "Title": "my 6th kindle", "Date": "March 23, 2014"}, {"Author": "M. McCracken \"mikemtn\"", "ReviewID": "R1XAVK879O1U5N", "Overall": "4.0", "Content": "It seems to me they could have put the speakers on the front just as easily. Would have made it 5 stars.", "Title": "Wish the speakers were front facing", "Date": "March 23, 2014"}, {"Author": "M. Sanders", "ReviewID": "R2SU1JU0G5IPE0", "Overall": "5.0", "Content": "Deciding which tablet to purchase was an easy decision.  The crystal clear display on the Kindle Fire HDX is easy on the eyes.  The touch screen responds quickly.  Although I have worked on desktop computers for years, I still don't consider myself tech savvy.  Being able to consult \"Mayday\" support instantly on my Kindle was probably the biggest selling point steering me to the Kindle Fire HDX.  It is almost too good to be true.  The politeness, expertise, and most of all problem solving of the Mayday personnel has been outstanding.  My consultations have been \"user\" oriented - no problems with my Kindle.", "Title": "Mayday Feature a big selling point and lives up to its billing.", "Date": "March 23, 2014"}, {"Author": "rtc", "ReviewID": "R32HK5IJNUJ4RC", "Overall": "5.0", "Content": "A very good buy.  I have had two earlier models and this makes my third generation. Does everything I want it to do.", "Title": "perfect", "Date": "March 18, 2014"}, {"Author": "verdinia", "ReviewID": "R3E4STA5H1V0LB", "Overall": "5.0", "Content": "Love this one.I have had two previously I still love my plain he with 4g it has the hdim that plugs in.This one blues what ever you have to buy a $99.item. Maybe I'll get one.", "Title": "GREAT", "Date": "March 18, 2014"}, {"Author": "Kay Bowling", "ReviewID": "R1E3PF6EI7M66D", "Overall": "4.0", "Content": "Disappointed that you can't put books into separate Libraries as in the kindle white otherwise quite happyDoes the job", "Title": "No Library for books", "Date": "March 17, 2014"}, {"Author": "Janie Hendrix", "ReviewID": "R2M8MXKM95OC2W", "Overall": "5.0", "Content": "LOVE LOVE LOVE.  BETTER THAN I EXPECTED.  I STILL USE MY KINDLE FIRE, BUT THE HDX IS SO MUCH MORE.  THE QUALITY OF VIEWING IS AWESOME.  SO MUCH BETTER THAN ANYTHING I HAVE SEEN.  WOULD RECOMMEND IT VERY HIGHLY TO EVERYONE.  A MUST HAVE.  WOULD PURCHASE IT AGIAN.", "Title": "HDX 8.9", "Date": "March 17, 2014"}, {"Author": "K. Broussard", "ReviewID": "R3FLLUB1BLGMXO", "Overall": "5.0", "Content": "I decided that my older 2012 Kindle Fire HD 7 wasn't big enough for my fast changing school needs.  As technology is progressing, more and more of my classes are offering ebooks or online access to supplemental software/programs.  This semester 2 of my required books were only available as an ebook.  I did purchase them for the Kindle Fire HD 7, but it was a pain to use them.  I had to zoom in and out to see different areas of problems and pages and read ok.  Being accounting themed books, I was doing a lot of zooming and scrolling and shrinking to see the whole problem I needed to do for homework.  This of course took up a lot of time.  I also only got my Kindle in 8gb at the time and I was running out of storage room for items I wanted at all times on my kindle (music, movies, books, etc).  So I decided with my school refund I would apply it towards the Kindle HDX 8.9.What a smart move!  I have only had this 2 days and I am in love.  Even though it is \"8.9\" inches bigger, it seems to me like double the size.  I can see 1 whole accounting problem on the same page in a font that is easily to read.  Makes my homework much easier to get done.The screen clarity is much clear.  This was not a huge importance to me, but a big plus.  HD movies are crystal clear.  On the Older fire I had the HD movies were a smudge blurry.  In addition, it processes much faster.  I feel like my old kindle fire was \"dial up\" and this is \"cable'.The sound quality is impressive.  I feel like I was sitting in an i max theater watching an episode on prime last night.For the size this is very light.  Yes it weighs a few ounces with the case on than my previous fire, but overall when I hold it in my hand (most likely because of the larger size and more balanced weight) it feels lighter.  I got the Trident case to go with it.  (If you go with that case I do suggest a zippered tablet case in addition just to protect the screen.)The onscreen keyboard is much easier for me to use vs previous model kindle fires I have personally owned.The front and rear cameras are amazing. The rear camera does take some very nice quality photos.  I had a fun time today going around the apt complex snapping various shots.It is very nice we can download some of the prime movies and shows now to watch at a future date when we aren't or may not be connected to the internet (or maybe a really slow connection).I did go ahead and get the 64 gb.  I was going back and forth between the 32 and 64.  But honestly for the $50 difference, I knew I would be happier with 64.  I have many cd's and movies that I purchased.  I travel via train and plane often so like to load the kindle up with enough movies/music for the trip.  My parents are 7 hours away, so depending on what deals I get, I either fly or take amtrak.  It's nice to have the room to put enough entertainment onto the kindle for the trip.  My grandparent's don't have decent internet (they are still dial up) so I put enough for the length of my trip when I travel to them.  And with technology going towards e books I do have the room to put all my school books on there.I am not disappointing with my purchase at all.  When I have more funds I will be ordering a second for my roommate. She was eying one long before I gave it though.  Just made it into PTK (International Honor Society for 2 year colleges) and she got me a nice gift when I got into PTK, so I figured would be well worth a gift for her.  This would make a very nice gift for a graduating high school student or someone in college.  Like I said, technology for college is going towards all electronic.  All of my classes had e book options this semester...but 2 classes I could only get e books.  I am going to rent the e book for the other 2 classes just so I don't have to lug heavy books to/from school any more.The only one downside I want to share is Amazon put the $500 charge on my account as a \"hold\" and then charged again when shipped.  I was a little upset by this as I\"m still 2 days later waiting for that \"hold\" to clear.  I have ordered hundred of times off of amazon over several years and never has this happened.  So be aware this may happen to you.", "Title": "In Love", "Date": "March 12, 2014"}, {"Author": "Sharron Bugbee", "ReviewID": "R2OXZIJL6O4Y21", "Overall": "5.0", "Content": "I am amazed with my new Kindle Fire HDX.  I like to Skype with my family and the Cameras on this Kindle are of better quality than the webcam on my laptop.  Way to go Amazon!!!!!", "Title": "I love my new Kindle!!!", "Date": "March 12, 2014"}, {"Author": "MICHAEL", "ReviewID": "R1U3M4FQ6DRCDJ", "Overall": "5.0", "Content": "I am very impressed on how light weight it is for its size. The display is bright and crisp. No problem surfing the web at home or at hot spots. I haven't noticed any lagging with apps. I let my 14 year old use it to read. And I like that I can manage the time he spends on it.", "Title": "Kindle Fire HDX 8.9", "Date": "March 12, 2014"}, {"Author": "M. Auger \"TechPerson52\"", "ReviewID": "R3OZ4LOLEC95PY", "Overall": "5.0", "Content": "The Fire HDX 8.9 is the perfect size and weight. It does everything that the Droid line can do. It is not difficult to operate. The screen is very clear and precise. Best of all devices I use. I use an iPad Air and can tell you I much prefer the HDX. the HDX has a better screen, it is lighter, and operates much faster. It has all the Apps I use with Droid and the iPad. I would definitely purchase this again.", "Title": "Kindle Fire HDX", "Date": "March 12, 2014"}, {"Author": "Carol A. Nahm", "ReviewID": "R1J4063IMYUICC", "Overall": "5.0", "Content": "Great colors & versitility. Love the mayday support. Would recommend it to anyone. Children and adults love using all the applications.", "Title": "Great addition to the tech devices", "Date": "March 12, 2014"}, {"Author": "Kim G \"kim\"", "ReviewID": "R3J675M9JQVUV0", "Overall": "4.0", "Content": "over all I'm Happy with my new bigger Kindle, went on a trip-downloaded 2 movies to watch. Watched 1 on way to destination..was wonderful! On the way home I could NOT get the Kindle to play the 2nd movie, I couldn't even get it to play the 1st movie again.! aarrghhh!!  I have a cover that has a hole for the camera lens so I do not have to take the Kindle out of the case to take a picture, but everytime I take a picture I get this notice that I must lift Kindle out of case to take a picture, and this \"box\" will not go away, so I have to take a picture with it in the middle of my sight. The picture comes out without that box..but it is very irritating, I tried to use \"Mayday\" to tell them all of the above, but only got in about 5 mins and got cut off, (I have very good internet service) I tried two more times and it just said I could not connect ?!?!  The Kindle also died for 2 days, don't know what happend, I put it on the charger and left it for 3 days, Now it works fine..?!?  I guess it sounds like I'M not happy with the Kindle, but overall I do like it, just some bugs.", "Title": "my new Kindle", "Date": "March 12, 2014"}, {"Author": "kyshel", "ReviewID": "R2ZD2PCFUTVXJT", "Overall": "4.0", "Content": "My husband travels alot and this new toy is making him very happy.  I'm looking forward to trying it this weekend when we go to Paris.", "Title": "Gift for Husband", "Date": "March 12, 2014"}, {"Author": "Big Aunt Sal \"samc\"", "ReviewID": "R2JCO9KFIBPBQ", "Overall": "5.0", "Content": "I had the Kindle Fire--which I loved but the HDX wowed me.  The display and new features are wonderful. Since it is lighter than my first Kindle, it is very comfortable to use for longer periods.", "Title": "Great!", "Date": "March 12, 2014"}, {"Author": "P. Lawrence", "ReviewID": "RXMQWC8FE3RWL", "Overall": "4.0", "Content": "I am still not proficient on all the aspects on this tablet, but enjoy the high definition screen.  I use it mainly to check news websites, the weather, to check my email and read books downloaded on the device.", "Title": "Replaced old tablet with this one.", "Date": "March 11, 2014"}, {"Author": "Evangelist Dr. Wilmoth", "ReviewID": "R1FDNXC2IGFKMK", "Overall": "5.0", "Content": "The quality and performance of the device is perfect. Apps are abundant, the live help is fabulous. We are still having a bit of a learning curve on how to find a good video player to play free movies, or watch TV. The battery last a long time which is very good, but the little 9W charger takes up to 10 hours to fully charge it if you don't completely power down. The HDX Display is amazing!  My wife is thrilled with it. We do not have a case that fits it well so the buttons and cameras are available while inside the case. We had to modify it. Over all I give it a 5 star purchase!", "Title": "extrenely WOW", "Date": "March 6, 2014"}, {"Author": "Mimi", "ReviewID": "R31CDRU7QN7OUW", "Overall": "4.0", "Content": "Clear,crisp picture.  Easy to use.  Lighweight and easy to move from room to room.  Would recommend getting a protective cover, which can be found at a department store.", "Title": "would recommend", "Date": "March 6, 2014"}, {"Author": "arkansassy", "ReviewID": "R21AAYCVCAM4UW", "Overall": "4.0", "Content": "I love the graphics.  The picture resolution is awesome.  However, I have deducted a star for two reasons.  I cannot share my MP3 music with my child's profile.  Also, I am greatly disappointed that I am unable to use an HDMI cable to mirror to my Kindle 8.9 with my HDTV television.  I could purchase a dongle but the resolution for my current HDTV I have would be of poor quality.  I would have to purchase another Miracast television if I am understanding this technology correctly in order to have adequate resolution.", "Title": "Kindle Fire HDS 8.9\"", "Date": "March 5, 2014"}, {"Author": "aei", "ReviewID": "R345P2V3Z4ZC1Q", "Overall": "4.0", "Content": "I love it!!!  I would have given five stars except I can't view videos on Facebook or play some games as the flash player doesn't have a download for kindle.  I am going to research to see if there's some way to get around this issue.", "Title": "love love!!!", "Date": "February 20, 2014"}, {"Author": "catherine", "ReviewID": "R2ME3VKIW1PD8Y", "Overall": "5.0", "Content": "It does all expected.  It is very lite and easy to use.  Everyday I learn a little more on this kindle.", "Title": "very good", "Date": "February 20, 2014"}, {"Author": "Deacon Pete", "ReviewID": "RCD91YOVNWMEM", "Overall": "5.0", "Content": "This thing is miles ahead of my old 7\" Kindle fire. Features, display, everything. All of the things that I was frustrated with in my old Fire seem to have been corrected or improved upon. This is my third kindle (keyboard, 7\" Fire, and 8.9 HDX) and it is by far the best device I've found for reading and watching movies and show on. The display is outstanding and the sound is great. I love this thing!", "Title": "WOW!", "Date": "February 20, 2014"}, {"Author": "Xeentash631", "ReviewID": "R30XXOEN0U6WR0", "Overall": "5.0", "Content": "Have you ever wondered how \"measured diagonally'\" cheats you out of screen size sooo very much on all TV's moniters and laptops these days? Screens are getting wider and wider all the time so how many of us play a video game or watch a movie or even read a book diagonally these days? the wider the screen the shorter the height and what you see in the middle of the screen is usually where the action is so 8'9\" isnt really your viewing screen in any logical direction you see a picture especially in TVs where you look at the picture in landscape so a so called picture is only about 20 inches tall if they say it 27. Think about how rich they're getting and how we get less and less screen to play video games or watch a movie every year. Your getting 20 inches tall thats how big a 27 inch TV is. Just think about it.", "Title": "Have you ever wondered measured diagonally before?", "Date": "February 20, 2014"}, {"Author": "Rodney J. Sweitzer", "ReviewID": "RP37J29PGUIQU", "Overall": "5.0", "Content": "This is my 4th Kindle and loved each one. Started years ago with the reader and as the technology increased, I upgraded. This one will last a long time as it has so much more. Very good product.", "Title": "Great tablet", "Date": "February 20, 2014"}, {"Author": "Maxine O'neil \"Maxine O'Neil\"", "ReviewID": "R1TDM9CQ920SND", "Overall": "5.0", "Content": "A good friend at the time when all your other friends are either asleep or otherwise engaged.  I give it a big Harrah!", "Title": "Happy is the only way to say it!", "Date": "February 20, 2014"}, {"Author": "Peggyann \"Peggyannvt\"", "ReviewID": "R2RHU20ZZ86COT", "Overall": "5.0", "Content": "I like having two tablets.  I use one during the day more than the other which I use more at night.I could not get my local TV news but could get the station across state lines.  (So I don't check that out of state station.)The color is more vivid on the Kindle in compare to the other Tablet playing the same game.Sometimes I wish it were had a larger screen.", "Title": "Enjoy getting free books with prime", "Date": "February 18, 2014"}, {"Author": "vivianv", "ReviewID": "RTE8QMION3WC7", "Overall": "5.0", "Content": "LOVE IT ITS MY 3RD KINDLE AND I AM SOO HAPPY WITH IT, CANT WAIT TO GO ON VACATION WITH IT", "Title": "LOVE IT", "Date": "February 18, 2014"}, {"Author": "Kathy A Williams", "ReviewID": "RG4ZSIVVXQ5NY", "Overall": "5.0", "Content": "I am able to do so much with my kindle.  I download articles now and save them for later. I love watching movies on my larger screen.", "Title": "I love my kindle!", "Date": "February 18, 2014"}, {"Author": "becky", "ReviewID": "R2MBWZ0ISJZG5R", "Overall": "5.0", "Content": "you name it , everything in a little device, love love it, you can take it with you no problem.", "Title": "what dosn't it do", "Date": "February 1, 2014"}, {"Author": "charles h stewart", "ReviewID": "R3OJ4X9EC6UR7D", "Overall": "5.0", "Content": "Speed, clarity, picture quality and ease are great. Much easier to use than the I-Pad Air. Love to use it.", "Title": "Great buy", "Date": "February 1, 2014"}, {"Author": "M. Williams \"mjsw\"", "ReviewID": "R1RPQVV8FKMTA2", "Overall": "5.0", "Content": "This is a fantastic table/reader. There are more than ample apps for what ever your interests are. And they are reasonably priced and often free! I get my news, my games and my books all in one device. The only negative item I have found is you can not use any application that uses Flash. And some videos won't play on it. For what it DOES do, it out weights the couple of things it doesn't do.", "Title": "I take it everywhere!", "Date": "January 29, 2014"}, {"Author": "raquel", "ReviewID": "R29JMXRB4KY9Y1", "Overall": "5.0", "Content": "this is my 3rd kindle and I love it!!!  its nice and slim.  I can now enjoy my movies. thanks", "Title": "im in love!!", "Date": "January 29, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00D4BNBZ8", "Features": null, "ImgURL": null, "Name": null}}