{"Reviews": [{"Title": "No HDMI Port", "Author": "Isaac Ashun", "ReviewID": "R1UYCNBDQ159SL", "Overall": "3.0", "Content": "Was advertised as having an HDMI port for connecting to HD TV sets but it doesn't. Good battery life though.", "Date": "October 31, 2013"}, {"Title": "Tablet", "Author": "Davona L Parisher", "ReviewID": "RHCQ3TLT8WQL5", "Overall": "5.0", "Content": "My son switched from a  laptop to this table with wireless keyboard and loves it for college!! I was a great investment.", "Date": "October 14, 2013"}, {"Title": "Missing Adaptor", "Author": "Cherrie May", "ReviewID": "R1T4JJUKT3LT6U", "Overall": "1.0", "Content": "The tablet is great however when it was delivered it was missing the power adaptor.  I have tried to contact Amazon and Dell and each says its the others problem.  So, I have a Tablet that I cannot use because I dont have a power adaptor and neither company will provide me with one.  Yes, I can purchase one but since I spent over 600 dollars on this Tablet it should have been in my order to begin with!", "Date": "August 7, 2013"}, {"Title": "Nightmare", "Author": "ar10", "ReviewID": "R1GMXY1RFOYO1S", "Overall": "1.0", "Content": "Arrived intact. Missing windows 8 product key. Dell customer support told me to call Microsoft. Useless product no customer help. They have hung up on me twice and have called me a liar, they asked me if I lived in Brazil. No wonder Dell are going belly up. No mini hdmi out. Do not buy.", "Date": "August 26, 2013"}, {"Title": "Limited but ok", "Author": "ce33", "ReviewID": "R1T2WZY4G3NK5S", "Overall": "4.0", "Content": "Most tablets are very limited to what they can do therefore that's why I give this tablet 4 stars. You do not buy a tablet because you want the power and ports that a laptop has... You give up size and weight for a comfortable compact screen... To expect a lot of ports and speed is like expecting a motorcycle to have the same luxury and speed as a car.Good product , for what it is a \"tablet\". A better docking system maybe in order but so far okMaybe the problem the past reviews have is the seller ... Not dell... I have had nothing but incomparable customer support from dell when I purchased directly from them.", "Date": "October 8, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00D6HBYCC"}}