{"Reviews": [{"Title": "Regret buying it!", "Author": "deebrown", "ReviewID": "R9WACMPBU4ZE9", "Overall": "1.0", "Content": "The tablet has been crashing and not responding ever since i have received it. Apps are not responding and crashing, too. Google store isn't work so i can't download or delete apps. I also stopped using the tablet for a week and never touched it and when i came back to use it, the screen bubbled (screwing up the screen) and the volume button is so messed up! It turns down every second without touching it. It's so annoying!! The screen is terrible, too. It looks like you are holding it sideways when you look straight at it. It hurts my eyes! Also the format for the internet sucks. I cant even get pictures in their correct size. I feel bad because i bought this as a Christmas gift for my daughter and it doesn't even work. I wish i never got the thing. Was NOT worth it!", "Date": "January 29, 2014"}, {"Title": "Tablet", "Author": "cheryl l joyce", "ReviewID": "RTKH0KOT86VOM", "Overall": "5.0", "Content": "It was wonderful an a I think the price was even better. A great anytime gift. My sons an daughters love their tablet", "Date": "November 13, 2013"}, {"Title": "Nice!", "Author": "Elizabeth", "ReviewID": "R9VXMTP9K7XUJ", "Overall": "4.0", "Content": "It came in nice, secure, nothing damage. Everything was really great that we actually ordered another one. One thing was that the stylus it came with was completely worthless. It would not work at all and it was sharp enough to cut the cover on the screen. Other then that no problem so far, a really nice product.", "Date": "November 2, 2013"}, {"Title": "Very nice!!!", "Author": "hotrod", "ReviewID": "R10DDEMFGDHJU6", "Overall": "4.0", "Content": "Very nice I like the unit but just took some getting use to and for some reason have had to reboot it completely like it was new right out of the box for some strange reason but have had no problems since doing that .", "Date": "October 29, 2013"}, {"Title": "ok", "Author": "Rodney D. Robinson", "ReviewID": "R26OY2QN1N863F", "Overall": "2.0", "Content": "Slow processorNot the best but you get wh a t you pay for right would not recommend it but the service w as good", "Date": "September 20, 2013"}, {"Title": "junk", "Author": "Susie", "ReviewID": "R2TQ1H0O3FO2ZH", "Overall": "1.0", "Content": "from the day i got this no good the keys were fallen out now it wont charge very upset with this.", "Date": "June 5, 2014"}, {"Title": "tablet :(", "Author": "julia", "ReviewID": "RU5SYX13NHN20", "Overall": "2.0", "Content": "At first I liked it. Then started messing up then stopped working yesterday.  :(not even a month using it now let's see how it goes with returning it. So I can order a new one.", "Date": "May 28, 2014"}, {"Title": "unhappy", "Author": "Donne Nylander", "ReviewID": "R10Q52OAJ58MP9", "Overall": "1.0", "Content": "my tablet was sent to me without a charger and I was told by you all to purchase one from Radio Shack I'm very unhappy with that. I do not appreciate the way you are conducting business", "Date": "May 9, 2014"}, {"Title": "Great Buy", "Author": "Ray35", "ReviewID": "R2M6TZR5ETNT7T", "Overall": "4.0", "Content": "Really good value for money. My daughter is enjoying it so far. The keyboard keeps the touch screen cleaner than without .", "Date": "May 8, 2014"}, {"Title": "Disappointed", "Author": "Donna Stevens", "ReviewID": "R2RP6UQT553GJW", "Overall": "1.0", "Content": "This lasted about a week. Keeps freezing up then you have to let it die before you can recharge and get back on.  Doesn't always recharge right.  Connector seems faulty. Wasted my money on this one!", "Date": "April 6, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00D8URVOC"}}