{"Reviews": [{"Title": "Finally a Great Android Tablet for under $100", "Author": "TLC", "ReviewID": "R2YSLN66BRTDJM", "Overall": "4.0", "Content": "I bought a few of these tablets for gifts. I kept one and so far pretty impressed with the quality.  The clarity of the HD screen and the overall performance of the 1.5 GHz dual-core processor are impressive.  Netflix and Crackle works great on the tablet.  The battery could last longer (around 4 hours of use, similar to laptops, but half as long as an iPad) and the screen is not IPS, but what do you expect for under $100.  Too me this was a great purchase!  Saved a lot of money compared to the name brands (Samsung, Asus, Dell...) without much sacrafice in quality or performance.Pros:1) Fast duo-core processor2) HD screen (1024 x 600)3) Good wifi (better than my Asus T100TA tablet)4) Loud audioCons:1) Short a battery life (after a full charge, almost 5 hours or regular use (checking email, surfing web...) or around 3 hours of intense use (watching Netflix or Crackle over wifi))2) Screen is not IPS pannel (viewing angle from one of four direction is limited)Overall, I gave it 4 stars becasue of the value I got.Video review link:[...]", "Date": "December 2, 2013"}, {"Title": "Great inexpensive Android tablet", "Author": "Fred J. Love", "ReviewID": "RFMH9I1YYA26G", "Overall": "5.0", "Content": "This is a great tablet if you are looking for basic features.  I am very impressed with the look and feel for it being a $70+ tablet.  It was one of the only tablets inexpensive tablets that that I could find video review one (I won't post the link since the reviewer uses some potty language but you can find it on your own on YouTube).  I found it to be very responsive with no delay to any user interactions (starting apps, any swiping gestures, volume up/down, rotating from portrait to landscape, etc).  The screen is very clear.  It also has a Micro SD slot which I added a 32GB card. This is huge plus over other tablets (iPads) that don't allow you to add more memory.  Please note that this tablet DOES NOT have Bluetooth.  I also like that it comes with a nice little travel pouch, lint cloth and noise isolating earbud headsets. Thus far I have not found any apps that would not run on it.  The only issue that I have found is that when I wake it up it does take a few seconds to connect to our wifi access point but once its connected its fine.  When comparing this table to others be sure to note that this one has a dual core processor and 8GB of storage.  I have seen a few in the <$100 price range that are single core, processors  <1.5 Ghz, 4GB (or less).Pros:-1.5 Ghz dual core processor-Clear HD screen-Highly responsive-Micro SD slot to add more memory when you need itCons-Delay in connecting to wifi on wake up.(Update)Not all 7 inch tablet cases will work with this tablet based on the location of the buttons.  I picked up the Visual Land Pro Folio Universal Case and Stand from Fry's.  It works ok as it has elastic bands to hold the tablet in place.  The only issue is that I can only use 3 of the bands due to the location of the volume button.  Using 3 bands still keeps the tablet snug in the case.  It appears that Amazon carries the Visual Land Prestige 7L tablet case which has clasps that hold the corners of the tablet which should work for this tablet", "Date": "January 2, 2014"}, {"Title": "Died at 35 days", "Author": "Izzy Hood", "ReviewID": "R12RA095CKJJVB", "Overall": "2.0", "Content": "At 35 days, the unit never got past the post screen and booted into the android OS.A factory reset was attempted after this, but the formatting screen never proceeded after the text which read \"Formatting\", even after letting it work for several hours.Unfortunately, this is outside of Amazon's return policy. We contacted and left a message for the manufacturer via phone and email. After 24 hours they got back with us and informed us we must send it back and pay for shipping ourselves.In summary:*Product will not boot after 1 month of (light) use.*We have to spend roughly 20 bucks in shipping to return it.*We are going to be getting a refurbished unit back for a 1 month old unit.I will try and follow up with how well the service process goes, but for now, I cannot advise purchasing such an unreliable unit.Followup review:The return RMA process was fairly painless, as it only took 1-2 weeks to have a fully functional unit returned to us.I still have a bitter taste in our mouth over the fact we had to pay roughly 20 bucks in shipping, but I will elevate this to 2 stars.The manufacturer should have paid for the shipping for their defective product.", "Date": "January 22, 2014"}, {"Title": "I am in love!", "Author": "Haifeng G.", "ReviewID": "R12SVKE63GCTEN", "Overall": "5.0", "Content": "After weeks of trying to decide which tablet to get, I finally settled on this one because most of the reviews were good (and the RCA tablet that I was interested in felt a little on the cheap side). We ordered two, the blue one and the red one. The colors are beautiful (albeit the red is a little darker than I expected, but it looks much better than the red in the pictures). The tablet is very fast and it goes just as fast on my mobile hotspot as it does on the regular wi-fi hook-up. I haven't had any problems with it thus far! The only con to this is that I kill the batter pretty fast because of a few of the games that I play, watching movies (screen is VERY clear!) and using my kindle app. I think we made a good decision because the tablet really does out perform my mother's RCA tablet, and my nephew's Nextbook!", "Date": "December 20, 2013"}, {"Title": "Better than coby", "Author": "Amazon Customer", "ReviewID": "R2ZVOQIO73HJ47", "Overall": "4.0", "Content": "This was given to me as a gift. It is great for the price but like everyone else the battery stinks.  I have not used camera yet. Despite the battery I would recommend this item.", "Date": "December 28, 2013"}, {"Title": "Great little tablet for the price", "Author": "M Ubben", "ReviewID": "R2RZUA5ZZ8ZHXI", "Overall": "5.0", "Content": "We got this for our boy, since he always was trying to grab the phone to play games. He already knew how to download and install apps on the phone so this was an easy trade off for him. There are parental controls that you can get for free from Google Play Store, some are very controlling such a time frames, apps and internet access, while others just control time usage. As for the tablet itself, it was quiet impressed. I'm used to paying more for my electronics, but I thought since this was for a kid, it shouldn't be more than 100$.For the price, this is down right amazing. The screen is bright and clear, can watch videos seamlessly, there is a headphone jack, a USB and even a mini HDMI connection. I haven't found if the USB can power the tablet yet, it does come with a DC Power jack connection and power cord.  That might give it 4 stars if it doesn't, because honestly, that's just universal at this point.Like all androids, the interface is simple and easy. Plenty of apps and games.It does seem a little slower than I expected sometimes, but most people wont even realize it unless you are used to having an much higher price tablet. Honestly I expected less for the price, and this is a great gift for the value. I even thought about getting it for myself.", "Date": "December 25, 2013"}, {"Title": "MEMORY & CUSTOMER SERVICE ISSUES", "Author": "Amazon Customer", "ReviewID": "R3CZ9R66YPVLB9", "Overall": "1.0", "Content": "After about a month, my EM63 tablet’s 1GB system memory was 100% full.  I could not download any apps & none of the installed apps would update. Conversely there was still 4.63GB of the total 4.73GB of on-board storage memory available for apps and files. The specs for the EM63 tablet show * 1GB of system memory and 8GB on-board storage memory*. It does not appear the on-board storage memory is being used correctly.Generally technical support can be accomplished directly with the user, but I was forced to send the tablet back to Double Power at my expense, ($15 shipping and insurance), to have them “fix” the system memory full problem. They refused to deal with the issue via email or phone.When DOPO returned the tablet, system memory had 900MB available. I logged into Google Play Store and all EM63 pre-loaded apps started to automatically update. Within minutes the system memory was again ½ full but the available storage memory stats had not changed. Next day when the system memory was still ½ full, I attempted to contact DOPO technical support to find out why this was happening. I have continued to follow up with DOPO every few days, but they refuse to provide any help with this issue. I refuse to return this tablet a second time when the system memory is again 100% full.It appears that apps and app updates download to the system memory only. This causes the 1GB of system memory to quickly fill up and render the device unavailable for any additional apps or updates.  Although I can save pictures and music to the external micro SD card without problems; for me, the device is really nothing more than a 1GB tablet – useful as an e-reader but not a good choice if you like to download and use many apps.I cannot recommend this model or company.  Specs are inaccurate, device is unreliable, and customer service is extremely poor. I accept that some products will have issues, but I will not accept a company that doesn’t stand behind its products. Double Power has lost my business forever.", "Date": "March 26, 2014"}, {"Title": "Greatly Surpassed my Expectations", "Author": "Matthew Ehrlich", "ReviewID": "R2IXO5XPOKG3KF", "Overall": "5.0", "Content": "i charged it for about 1 hour and i was able to use it for 6 hours. and it still didn't die i just had to go to bed! i havent tried the camera yet but everything else has been awesome! I LOVE THIS!!!!!!!!!!!!!!", "Date": "January 1, 2014"}, {"Title": "Love this tablet!!", "Author": "Wishfire", "ReviewID": "R2O6H8KAJ3D5XC", "Overall": "5.0", "Content": "So I was a little worried about buying a tablet for such a low cost, but I am really glad I did. Tablet responds very quickly, graphics are awesome and it seems to run any applications or games that I could want. I have a friend who spent several hundred on her tablet and she thinks mine runs better, yay me. I have several applications installed on the tablet, Netflix runs really smooth on it. I do however suggest getting a micro sd card though, so that you have more space. There isnt any bloat ware on the tablet, so essentially it comes with very little on it. It does have google books, but I downloaded an app called cool reader instead, that I like better. Without the micro sd card (which mine is coming in the mail soon).. i have installed netflix, cool books, draw something, polyvore, live backgrounds, facebook and there is still plenty of space.. so dont feel a need to rush on the micro sd card. All in all, great tablet, highly recommended.  Oh and as for battery power, I watched 5 45 min episodes of sliders on my tablet and it still wasn't dead.", "Date": "January 6, 2014"}, {"Title": "Sent the wrong item in the box", "Author": "Francis Stern", "ReviewID": "R3H00OVRMCHY7P", "Overall": "1.0", "Content": "Actually had 2, the first one had a crack in the screen I didn't see till after using it for the first day- Worked very well considering the price! Camera wasn't all that great, but you get what you pay for!After seeing the crack, returned the item for repacement (shipped quickly no problems at all!) The replacement how ever is not the one I ordered.The one I ordered is supposed to be the 8GB I was sent a 4gb in an 8gb box... didn't notice this till well after the time to send it back. It's incredibly slow, can't download anything, essentially USESLESS! I ordered it for my business (since I'm still getting my feet I needed a cheap alternative to the big brands, at least till I can afford a better one).Had this been as described, like the first one, I wouldn't have any issues with it.80 bucks... down the drain!", "Date": "December 30, 2013"}, {"Title": "Could have been great.", "Author": "Lindsey Shannon", "ReviewID": "R1UL3BHD27E0PP", "Overall": "1.0", "Content": "This tablet did all of the functions expected at this price range. HOWEVER, after the initial 6 hour charge, I took it off the cord and downloaded some apps, played around on it, etc. When the battery died back down that night, I plugged it back into the charger and walked away. Hours later, I came back to discover it had a 0% battery. I moved the cord, unplugged and plugged it back in, restarted it, factory reset it, etc. Nothing worked. After searching the internet, I discovered the charging port on the Double Power tablet tends to break randomly, and it stops holding a charge.  I had to return mine, and with my refund will be buying a different brand.", "Date": "December 30, 2013"}, {"Title": "it will not charge only had it 3 weeks", "Author": "bella", "ReviewID": "R2ESXRCA5A6RDD", "Overall": "1.0", "Content": "it will not charge after an hour plugged in. Will leave it in all night but appears to be a piece of junk ...", "Date": "February 4, 2014"}, {"Title": "1 month and dead", "Author": "Jolene M.", "ReviewID": "RLJFRSUNNWWWP", "Overall": "1.0", "Content": "after just 1 month of use it would not charge. it would not even recognize that the charger was plugged in. I have called 3 times and never talked to a person. I have left messages and sent emails and still have not heard from DoPo. When it was working it did a decent job. I did have some issues with VuDu not working or jerkiness in game apps.", "Date": "January 29, 2014"}, {"Title": "Piece of garbage....", "Author": "Hoeymojo", "ReviewID": "R2JFSE6LD2Z3WM", "Overall": "1.0", "Content": "Christmas present for my son. He used it for about 2 weeks and now it won't load past the dopo logo screen. I have tried contacting the manufacturer half a dozen times. Called, left messages, sent emails. No response. What a great company! What a piece of junk! I have tried resetting it multiple times with the same result. A call back, or an email back from the company would be great. Very disappointed.", "Date": "January 23, 2014"}, {"Title": "Cheap tablet for first time user", "Author": "Scrufferton", "ReviewID": "R26LM8RXMPAS3I", "Overall": "5.0", "Content": "I got this on sale for $70 so it's reflective of that price. I got it for my mom who hinted that she wanted a tablet over christmas. I picked this up hoping that it would play netflix, youtube, and do whatever a 60+ woman with little to no experience with a computer. It is reasonably fast, holds a charge for 3 hours, and looks sleek and well made. She is thrilled with it, and it would have been worth  a little more than I paid for it.", "Date": "December 30, 2013"}, {"Title": "nice tablet", "Author": "peggy a payson", "ReviewID": "R108PK3S6EMFML", "Overall": "4.0", "Content": "for the little money this is a really nice tablet comes with games and youtube the camera works really good", "Date": "December 29, 2013"}, {"Title": "good products", "Author": "G. Yau \"TY\"", "ReviewID": "R3DX9RX9X8V2MU", "Overall": "4.0", "Content": "nice and fast delivery, easy to set up and use, I bought this one to my nice for game and fun. She loves it. Sometime, it will stuck on some prog, just restart will be fine", "Date": "June 3, 2014"}, {"Title": "My 6th grader loves her tablet", "Author": "Christina H.", "ReviewID": "RLSSFSOW8O0E", "Overall": "5.0", "Content": "She has been using it for about 6 months now. It's held up very well, and we've not had any issues with it. She saved her allowance and bought this herself. I'm glad that it's been a good product.", "Date": "June 1, 2014"}, {"Title": "Nice tablet.", "Author": "Naj", "ReviewID": "R4Z2QQ20O6330", "Overall": "4.0", "Content": "Nice tablet that works responsively and easily.  Battery life could be better.  Oh, by the way, I dropped it and it did stand up to the shock, still works perfect.", "Date": "May 31, 2014"}, {"Title": "Great Value", "Author": "Vic Stewart", "ReviewID": "R2I4YM7QHF7AV2", "Overall": "5.0", "Content": "I bought 2 of these a month ago and both have been in quite heavy use daily. So far I can't think of anything negative to say about them other than the boot time is a little slow and the camera could have been a little better. Besides being low res and a bit grainy one of them has a camera which is out of line and noticeable when using video chat apps, you have to alter the angle of the tablet so that the camera can 'see' you.I have one connected to a 50\" TV and it plays video flawlessly.Overall, excellent value for money.", "Date": "May 28, 2014"}, {"Title": "Breaks / locks up", "Author": "Jason Nichols \"Jas\"", "ReviewID": "R2KXKLYCB4QYWZ", "Overall": "1.0", "Content": "First one we got froze up after three weeks.  Amazon was good enough to send us a replacement when they didn't have to, the replacement froze up two weeks later.  Crappy product, poor developer product and lousy customer service.  Don't buy this product.", "Date": "May 21, 2014"}, {"Title": "Worked well at first for a $60 tablet, and I've tried plenty, this was the best of this price range, but touch became unreliable", "Author": "cheese hair", "ReviewID": "RZ6YWS148ZW2B", "Overall": "3.0", "Content": "Worked well at first for a $60 tablet, and I've tried plenty, this was the best of this price range, but touch became unreliable, so I had to return it. Would consider getting another, but am worried by other numerous reviews saying it died after 30 days. The one I got was quick, but began having problems with the touch, it would register a drag or gesture as a tap, so I downloaded an app that tested multi-touch, which this one has up to 5 finger touch, and with 5 fingertips on the screen, it would flicker between 3-4-5 touches, even while I rested my fingers on the screen not moving. I'd say if you get a good one, you'll be happy, but the odds are against it given the number of complaints in the reviews.", "Date": "May 16, 2014"}, {"Title": "dopo Tablet", "Author": "Tameco", "ReviewID": "R3LDR8RR8XEXIW", "Overall": "3.0", "Content": "Just got this Tablet so far so good Not:Sound very low and Battery life not so bad overall great produced!!.", "Date": "May 11, 2014"}, {"Title": "Nice for the price", "Author": "PA user", "ReviewID": "R3HCTFYI08ZB90", "Overall": "4.0", "Content": "Can't beat it for the price.  My daughter has had no issues with it.  She uses it all the time.", "Date": "May 10, 2014"}, {"Title": "simple and fine", "Author": "patricia onuoha", "ReviewID": "R24H2GXM4EDPOK", "Overall": "5.0", "Content": "at least easy to carry at all times ,makes you think about studying, again down loading is no more a case for me.", "Date": "May 4, 2014"}, {"Title": "Piece of crap!!", "Author": "David G. Vermillion", "ReviewID": "R3GLR5NAXJQCL5", "Overall": "1.0", "Content": "Do NOT buy this.  It is a piece of junk. Frequently needs to be reset. Battery life was less than 2 hours.  My son got his for Christmas and it was freezing up after only 3 1/2 months. Won't boot past the start up screen. It even froze up on the factory reset. Tech support is useless.  Too bad the manufacturer doesn't care about their reputation. Web reviews are lousy, all with the same problems and all with complaints about tech support.  Don't waste your money. Buy a different brand and get your money's worth!  I wish I could rate it zero stars because it isn't even worth 1 star.", "Date": "April 25, 2014"}, {"Title": "REVISED: OK, except for the meltdown part. . .", "Author": "Lulu Moretti", "ReviewID": "R1XCITHT7RQHI4", "Overall": "2.0", "Content": "I bought 3 of these pups to replace disappointingly limited Leap Frogs and one just melted down after 60 days. Or 30 days past return window. Until the thing died it worked well. The other two are still working well . . .for now. . .sigh. However, the 3 cost less than one Samsung tab, so if two survive it's still a good bargain. If not, it's back to the store!", "Date": "April 2, 2014"}, {"Title": "Tablet", "Author": "Kara Whitehurst", "ReviewID": "R850UNQECFHIQ", "Overall": "5.0", "Content": "I love it!  The only thing I don't like is that it won't allow you to use ITunes because its an Android based thing.  Other than that, for 60.00 it's great and allows me to check my email, surf the internet, and play games!!", "Date": "March 9, 2014"}, {"Title": "Stopped working after 5 weeks.", "Author": "Daniel Williams", "ReviewID": "REDHOQZW23CYA", "Overall": "1.0", "Content": "This item stopped working after about 5 weeks of receiving it. Now I'm shipping it back to be repaired. It worked great for a short period.", "Date": "March 7, 2014"}, {"Title": "IT WAS GREAT", "Author": "RHM", "ReviewID": "R2QHIUIGBQYE26", "Overall": "5.0", "Content": "It was real sturdy and  the volume is plenty loud enough,,,,,,,,,,,, thhe screen nice and bright and the storage and speed is great", "Date": "March 2, 2014"}, {"Title": "Double Power M Series EM63-BLK 7-Inch 8 GB Tablet", "Author": "R. Nelson \"Geek13\"", "ReviewID": "R198W25FJI5W1D", "Overall": "5.0", "Content": "Just a great little tablet.  My 10 year old has been wanting a laptop for email and games and I just did not want to spend the money to get something that would make her happy.  So after reviewing the current market of tablets I bought the Double Power M Series EM63-BLK 7-Inch 8 GB Tablet.  This unit has plenty of power and with an 16GB Micro SD chip the unit has plenty of space and plays her games plenty fast.  The unit is smaller but works well for someone her size.  She can email, watch movies we put on it for her and play Google games which are safe for her age.  Defiantly a big thumbs up from both of us, and by the way sometimes she even lets dad play some games too.", "Date": "February 28, 2014"}, {"Title": "It works, but isn't ideal", "Author": "rtsboy", "ReviewID": "R2ZJL7O7VA79D1", "Overall": "1.0", "Content": "I bought this tablet as a cheap device for testing app development on. However, connecting your android device to your Windows PC requires special drivers. The manufacturer for this tablet does not make those drivers available to the user/owner. I contacted support at the company but received no response whatsoever. So unless you feel like writing or modifying your own drivers (which is possible and the only reasons why I haven't returned the device) I would advise against getting it if you are interested in developing apps with it.The device itself is fairly cheaply made. It takes a lot of force to get the hdmi and micro-usb plugs in. The screen has an absurdly bad viewing angle. I really wouldn't recommend this tablet. There are other similarly priced tablets out there that will work better.", "Date": "February 24, 2014"}, {"Title": "Well worth the money for my needs", "Author": "Harry De Gray Cat", "ReviewID": "R3FAHSSC5L9DT8", "Overall": "5.0", "Content": "Having been very disappointed with my $200-plus Samsung P3 Mp3  player whose touchscreen was iffy at best and quickly became full of dead spots - I had to replace it fast since I used it professionally.This was a perfect replacement/upgrade- with many more features and under $80.The tablet, Android and wi-fi features are all icing on the cake- my need being only a good high-capacity Mp3 player with a touchscreen that actually works.The performance is great and I don't actually need a tablet since I meet all those needs with my home computer. I  don't have to always be in touch with everything at all times.Having said that, I still look forward to getting into the other features (not games) of this machine.  I've already added free apps that expand the voice-recording flexibility and also a primitive piano simulation. These come in handy for meeting with singers to find their keys and record their phrasing so I can construct  backing tracks for their acts.I added a 16 GB mini-SD expansion card for another $10 and also a cheap protective case that even includes a USB keyboard for another $9.I think this is a good value so far- will update if necessary or if any problems arise.. ALSO- when looking at this item a few days after receiving it I noticed the price went down by $9- I did online chat with Amazon and they gladly gave me credit for the difference.How cool is that?Also- I don't know what battery life is expected (most people say expect crappy)  and I keep an AC power supply closeby anyway. Last night my gig was 2 1/2 hours and my battery was at 54% after starting out full.That's good enough for now. I also forgot to engage the 'battery doctor' app that saves power-so who knows next time?", "Date": "February 8, 2014"}, {"Title": "Was very disappointed", "Author": "Tqmeesh", "ReviewID": "R2OY4MU91B9QMC", "Overall": "1.0", "Content": "I am new to the tablet world and did not want to pay a whole of money,so I go this for myself for Christmas.  Worked beautifully for about 3 weeks.  My apps started freezing, so I went online and did reviews of the apps.  some of the apps did have freezing problems, but then it was everything.  I would click on a app that's not internet based or game based and it would tell me app not installed or so and so app stopp responding.  Had to reset and reset and restart and restart.  Then it reset it self to the original manufacturer's settings which meant it wiped out all apps and even the ones on my sd card.  Finally it just froze.  I left it to charge all day and it charged only to 12 percent.  Not worth the hassle.  It worked great for the first few weeks and then it did not", "Date": "January 29, 2014"}, {"Title": "Great little tablet!!", "Author": "Margaret Wallce", "ReviewID": "R1GA6EXRNJMV4A", "Overall": "5.0", "Content": "The touch screen is VERY responsive - battery life is so -so but manageable - constant use while on facebook used 60% of the battery charge in 3.5 hours - not too bad.  Hoped for a little more though.  Clear picture; key pad, etc. is user friendly - all in all I am very happy with my purchase -", "Date": "January 26, 2014"}, {"Title": "Great little tablet!", "Author": "Bill C.", "ReviewID": "R1W5WUPT204OSH", "Overall": "5.0", "Content": "I bought this as my second tablet.  It has a good battery for the price and will last almost all day.  It is very light and easy to carry around. I'm using it in concert with my Chromebook.  I use them on trips and carry them in the same case.  The tablet works well with my IPhone as a hotspot.  I'm going \"Google\" with Google drive and Google Docs.  It's a very inexpensive way to go.  On the downside, this tablet is all plastic and a long way from being rugged.  You will need to baby it and get it a good case.  Considering the price, it's a nice tablet.", "Date": "January 18, 2014"}, {"Title": "A Terrible Investment", "Author": "CLK", "ReviewID": "R1GP8S04QHP3KI", "Overall": "1.0", "Content": "I've never so much as held a tablet or smartphone before I got this tablet, so obviously there was somewhat of a learning curve and and it took me a while to get used to a touchscreen. But when I did, it was awesome.It arrived waaaaay earlier than I expected; only two days after I ordered it, even though I went for the standard 5-8 day shipping. I don't know if it was because I ordered it on Christmas Day, but it certainly made the end of last year great for me.I haven't had a problem with the battery life yet, but I always have it plugged it when it's off or not really in use. It has a lot of storage space, but with all the apps I put on it, I'll probably have to get an TF card for any music or pictures I want to put on it, but that doesn't really bother me, either, since I was planning on that already. My only real concern is how hot the back gets when running certain apps. Once, when I was playing music from a music streaming app, it got so hot it felt like I burned my hand on the back (I didn't actually, so no worries). I think this has more to do with the apps themselves, however; I have since switched to a different music app and it doesn't get nearly as warm.Also, even though I saw nothing listed about it, it came with a drawstring case, a pair of headphones, and a cleaning cloth, as well as the USB cord and AC adapter. I don't know if this is a common thing, but it certainly surprised me.3/20/2014 EDIT:Okay, so after writing this review, I had a whole ton of problems occur. First, after getting a micro SD card for it, it stopped working properly, so I hard reset it as per the instructions in the manual. This caused it to become completely useless, and it acted as if all the essential files to make it work were gone. The launcher stopped working, and the settings could not be accessed.I contacted the manufacturer about what had happened and I got a response after a couple days, with instructions to send the tablet and the charger back. I did, and luckily the shipping cost wasn't bad at all since I live relatively near them, and within a few days I got it back; or rather, I got a replacement. This one was 4GB, nearly half the space I had in the other one, but it did seem to work better. I tried setting it up with my micro SD, but it caused some problems and I had to soft reset it, which actually fixed it and didn't cause any more issues as long as I kept the SD card out of it. Now it works fine, with some minor app crashes every now and then (usually after updates so I don't think that's the tablet's fault), but still great.Today the AC adapter broke. The little 'metal' pin that plugs into the tablet itself literally broke off like cheap plastic. I have to charge it primarily through the USB cord now, which can be a bit of a hassle considering my desk setup. I don't think I'll have any problems getting a replacement, but this is just getting ridiculous. I don't think I'll be buying anything else from Double Power. My friends and family all suggest that a tablet that is a bit more expensive and sturdier would be a better investment, and I am totally inclined to agree.3/24/2014 EDIT:It has crashed completely and will not boot past the splash screen. There is no option of entering a recovery mode and I have tried every button combo available. I am sick of all these issues and I will never be buying from Double Power again.", "Date": "January 14, 2014"}, {"Title": "Great Tablet", "Author": "Clarence Price", "ReviewID": "R148TAHGNZA9GX", "Overall": "5.0", "Content": "Pros-charges fast-easy to set up & work-big screen- Light weightCons- there are not any", "Date": "January 4, 2014"}, {"Title": "Affordable and Efficient!", "Author": "Bree", "ReviewID": "R3SNIGMG11ACKI", "Overall": "5.0", "Content": "My package came in on time, and I've had the tablet for about a week now. It's worked flawlessly, and I haven't had any problems with it. I would recommend this tablet to anyone, because it is affordable and efficient. I'll keep this review up-to-date if anything seems to go wrong. I'm a very happy customer!", "Date": "January 2, 2014"}, {"Title": "Not for streaming video", "Author": "Biomed", "ReviewID": "RY0N3HQGAARA8", "Overall": "3.0", "Content": "Good overall beginner tablet; but won't cleanly process video. Video is choppy. Has a barrel charging adapter; good for charging and running a jump drive at the same time; but you'll have to rig something up to recharge on the go (5 VDC 2.1A); if your going to use the GPS function. Battery life a bit short ~5 hrs of constant downloading and configuration.Bottom line: good e-reader, social communications unit, music player, news hub, phone apps, and basic games on the cheap.", "Date": "January 1, 2014"}, {"Title": "didnt work right", "Author": "lorretta ortiz", "ReviewID": "R1HYFM7XCWT6I8", "Overall": "1.0", "Content": "It worked 1 time and after that it wouldn't turn on or keep a charge so why would i want some thing that wont charge and work", "Date": "April 7, 2014"}, {"Title": "decent buy", "Author": "Krea Taylor", "ReviewID": "R3B9EJUO15Y5UC", "Overall": "3.0", "Content": "my daughter enjoys this tablet. Thought it was a great price for a starter device being that she is 9years old. This is our second tablet of this type/brand...I just hope it lasts, the previous one stopped working at random", "Date": "April 3, 2014"}, {"Title": "Exchanged it a few times", "Author": "Unbeatablebonz", "ReviewID": "RIAKA621WKY7O", "Overall": "3.0", "Content": "We are on our third one.  Keep in mind - a 5 yr old boy is the owner of this tablet.  However,  it's nothing special. Battery life stinks!  Sound is okay and it doesn't get real hot like other cheaper tablets.  If this is for an adult or teenager - Spend the extra money and get a Nexus or the like.  This doesn't compare. (unless its for a 5 year old and ya really don't care about the quality so much :)", "Date": "April 2, 2014"}, {"Title": "Great deal here !", "Author": "David Baez", "ReviewID": "R2X6L3EEGU9LVM", "Overall": "5.0", "Content": "I bought this unit used but came packed like new. It even had the protective cover on it like new. Works great. Arrived fast.", "Date": "April 1, 2014"}, {"Title": "DO NOT BUY THIS ITEM!", "Author": "Claudia", "ReviewID": "RZT04W5QV1A6P", "Overall": "1.0", "Content": "I purchased this item for my 10 year old nephew's birthday. He loved it at first but just informed me that the battery has not charged in over 2 weeks so he is unable to use it. The tablet was only 6 weeks old when it stopped working! From reading the reviews it seems like this is a very common problem. I attempted to get a hold of the seller but was unable to.  I expected that the tablet would not last forever but I did expect it to last much longer than six weeks.  If I had known I would have spent the extra $20 to buy something of way better quality.", "Date": "March 31, 2014"}, {"Title": "Excellent tablet", "Author": "Sarita", "ReviewID": "R1BLDVYZWLB849", "Overall": "5.0", "Content": "I'm pretty impressed with the quality, this is an excellent tablet and works perfect for me. I highly recommend this product.", "Date": "March 30, 2014"}, {"Title": "nice tablet", "Author": "Gregory W. Finn \"from the oil patch\"", "ReviewID": "R2D3YRZQWE0GYC", "Overall": "4.0", "Content": "Just received and this tablet was very easy to get configured and up and running. Like the Qualcom 10.1 \" tablet this one comes with 8 Gb memory but the Android OS eats up half. There are some good file management apps in the Google store that allows you to move some data to the external SD card. That helps considerably. I bought this primarily as an HDMI to tv device for use in a guest room that has a tv but no box. Note this is a type C hdmi port as opposed to the first generation Kindle Fire HD which has a type D HDMI port so a different cable is required.", "Date": "March 29, 2014"}, {"Title": "not bad for $70", "Author": "Stephen King \"Chris\"", "ReviewID": "R4WO764PGH0S8", "Overall": "4.0", "Content": "Was expecting it to be a cheap facsimile was pleasantly surprised. Not to mention my children were happy with it", "Date": "March 25, 2014"}, {"Title": "Grandson loves it", "Author": "Cindy L. Gould CCA, CAA, CNHC \"sacredearth\"", "ReviewID": "RYL11TCJATD9P", "Overall": "5.0", "Content": "I ordered this for my Grandson. He loves it. This is a wonderful item that will not break the bank.", "Date": "March 21, 2014"}, {"Title": "It's good for what it is.", "Author": "Neil McCormick", "ReviewID": "R27WEU0RI30HNM", "Overall": "4.0", "Content": "I bought this more as a personal organizer and reader.  It does take a moment to initialize the wifi connections when configured.  It works great, even had a keyboard that I bought for it to take notes when in meetings, etc, to keep me on task for things.I noticed that dependent on the apps (not the ones that come on the device standard), they can drain the battery really fast!  So, be wary of the apps you download and use.Now, I bought this at the end of February, this year.  It's now March 21st and I'm sending it in to be serviced.  It reset itself back to factory and wouldn't turn off without using the trick to force it.  I'd have to run through the setup every time for all my settings, etc, then couldn't install any of my apps again.  This is apparently a manufacturing defect with the internals.  They got back to me via email the same day, confirmed everything with regard to my purchase, etc, then gave me my return number.  Use Priority Mail to ship it back, cost me just under $14.  Not a huge deal.  Very easy to work with in this regard.  We'll see how the device works after it's been serviced.I like it for what it is, didn't have high expectations of it, but wanted it because I could easily move documents between it and my work PC for meetings, etc.  So, it meets my needs for taking notes, updating my calendar and being an e-reader.", "Date": "March 21, 2014"}, {"Title": "For the price it is a great tablet.", "Author": "Robert lamothe", "ReviewID": "R3M5EJ5QK1G3HI", "Overall": "5.0", "Content": "Great product for the price. No issues at all with this tablet. Does everything a tablet should. Great for doing homework.", "Date": "March 20, 2014"}, {"Title": "7\" Tablet Double Power", "Author": "genel64", "ReviewID": "R3B7R3QXPGKSSL", "Overall": "5.0", "Content": "I got this tablet today and only took a few minutes to set up as you are prompted through the process.  The tablet is very responsive and very fast.  The 1 gb of ram really helps.  I read a few bad reviews before I bought this, but I had no problems.  I was familiar with Android, but if you are not, there is a learning curve.  If you want an inexpensive fast tablet, then this is the one.  Mine came with earbuds, cleaning cloth, cloth carrying bag.  This is as fast as a friend's Kindle Fire HD.", "Date": "March 20, 2014"}, {"Title": "not great", "Author": "rvjacker", "ReviewID": "R1I0R3I40E6444", "Overall": "2.0", "Content": "Choppy, slow, sub par screen quality. It is cheap, but do yourself a favor and spend a few more bucks for a real one.", "Date": "March 18, 2014"}, {"Title": "NOT SATISFIED", "Author": "cheryl register", "ReviewID": "R2UZG76PHJD5B", "Overall": "1.0", "Content": "Not SatisfiedArrived with a small crack in screen now the crack is all the way across the screen I am returning this one also.Please contact me at cheryl.register@rockportcoasta.com", "Date": "March 16, 2014"}, {"Title": "pleased", "Author": "cmassey3", "ReviewID": "R25EENHHA8MH7P", "Overall": "5.0", "Content": "My son is enjoying the tablet every minute. I haven't had any issues but one. After hitting the reset button everything has been great!", "Date": "March 15, 2014"}, {"Title": "this tablet sucks", "Author": "Patty brasher", "ReviewID": "RF0GQFWO429EQ", "Overall": "1.0", "Content": "I needed a cheep tablet so I picked this one worst mistake ever now I knew it wouldn't be the greatest but I just got it downloaded Facebook and the tablet keeps cutting off every ten minutes I don't even want to try downloading games WORST TABLET EVER", "Date": "March 14, 2014"}, {"Title": "NI OT WORKING", "Author": "Connie Valderas", "ReviewID": "R3DO5OYFMMLKI9", "Overall": "1.0", "Content": "Bought this for my husband and it was great for the 1st day and after that it FROZEN UP and has never unfroze yet!! it didn't deserve 1 star but at least one is required.  I am in process of trying to get my money back or a replacement. DO NOT BUY THIS ITEM!", "Date": "March 13, 2014"}, {"Title": "unsatisfied customer", "Author": "angel davis", "ReviewID": "RZDJ6VU3O187Q", "Overall": "1.0", "Content": "After a month it stopped working! ! Can you say i was Pissed, but look at the price what can you expect! !", "Date": "March 13, 2014"}, {"Title": "Unbelievably disappointed", "Author": "Debbie Gee", "ReviewID": "R1LR2K7G8JOWPM", "Overall": "1.0", "Content": "I got my tablet Tuesday March 11,2014.  I plugged it in overnight to charge.  I got up Wednesday morning,  March 12, 2014 downloaded some apps, laid the tablet down to go to the bathroom and when i came back the screen was locked... It has been locked ever since.  I went to work and when I came back home, I used the reset on the back to no avail.  The screen is still locked, It is now Wednesday evening March 12,2014 and the screen is still locked..  I called Amazon, who emailed me a return label and needless to say, the tablet is going back tomorrow.  DO!.....NOT!.....BUY!.....THIS!.....PIECE!.....OF!.....CRAP!not unless you have a thing for being disappointed and have loads of time to waste..  The only saving grace in this whole experience was Amazon's help to return it.  ***** UPDATE *****It is now Thursday March 13, 2014 and the screen is still locked..  I am on my way to the UPS store now..  Bye bye, garbage.  Hello, refund.", "Date": "March 12, 2014"}, {"Title": "At least I got a fund", "Author": "latoya", "ReviewID": "R14M4QK139U5DK", "Overall": "3.0", "Content": "The product was good its self, but After trying to get the know the product. Well i never got to know it because after about the third time cutting it on it wouldnt charge no more. Then once I left it on the charger allnite and I took it to a doctors appointment with me I cut on and off twice then when I tried to cut it on at home its was over.", "Date": "March 10, 2014"}, {"Title": "great product for the value", "Author": "the budget man", "ReviewID": "R2JBJXRFAVLVGL", "Overall": "4.0", "Content": "Shipped fast, and accurate.works great easy to use. only two things Ive noticed. if I'm on the far end of my house the wireless doesn't stay connected, when my old net book connects good. and the auto rotate stopped rotating. I think its a conflict with an update on one of the apps but not sure. its not that big of deal. so definitely recommend for the price and function ability.", "Date": "March 9, 2014"}, {"Title": "Do not buy this!", "Author": "Mary E. Wehr-Anderson", "ReviewID": "R22DQU7UBLVSIQ", "Overall": "1.0", "Content": "We bought 3 of these tablets for our girls for Christmas gifts, and they loved them for a week.  Then, they wouldn't start until we pushed reset button, and now they don't work at all.  Not one of them!!  Also, I tried to get ahold of the company by phone and email.  No response on email and phone is constantly busy.  I think we just have to throw them away.  So sad for our girls...and us!!", "Date": "March 8, 2014"}, {"Title": "Can't beat the price", "Author": "Mike74", "ReviewID": "R3BFZ30H8K6KSN", "Overall": "5.0", "Content": "Great deal.  I needed a small tablet to carry around when I travel for work and I did not want to take my more expensive one. It is not the fastest by any means but suits my purposes for internet and email.", "Date": "March 8, 2014"}, {"Title": "Great Starter Tablet, I would definitely recommend to anyone interested.", "Author": "Steph", "ReviewID": "R3LTLJSZB3GOV7", "Overall": "4.0", "Content": "During all the black Friday sales I decided to pick up a tablet since I didn’t have a phone at the time and thought that a tablet would be fun to have games on and movies. Those were my main interests when purchasing a tablet. I found a considerably well priced tablet during one of the sales for cyber Monday. It was this tablet.  The tablet itself is a pretty sturdy tablet. The plastic is nice and hard. It doesn’t look cheap and it doesn’t look like it’d crack easily or become funky with time. The printed letters on the back letting you know what the details of the tablet were did fade rather quickly though. All outlets seemed to work as well as all the buttons. The sound works and is clear and loud.  The touch screen itself is, I’d say, a normal setting of sensitive. I’m sure there’s a way to change it but I found the factory setting to be fine for me. Not overly sensitive but not too hard to use. The time it takes to download games is less than a minute. All games I run on it as well as movies look great. The camera could be a little better and I would’ve preferred it had both a front facing camera and a camera on the back. The front facing camera is a little bit of a hassle but you can work around it’s not something you’re majorly interested in. When taking pictures with the camera they come out fairly blurry so it’s not the highest quality camera.  Video playback is 1080 p which is fine by me, it looks great visually so I don’t miss much when I’m watching movies or shows on it. The tablet itself isn’t overly heavy and I find it the perfect size to carry in my purse. The gameplay is pretty smooth, rarely does it freeze or skip or anything. It comes with google play so there are a lot of great apps and everything is really easy to download. The battery lasts about 4 hours of constant use, it can last more but it depends on whether you have the wifi feature on or off. If you have it off you get more battery life out of it. The memory is expandable to 32gb which I find to be completely awesome and gives me enough room to do everything I have to do.  The only problem that I’ve run into is that sometimes it turns off by itself and you have to start it up and when you start it up you find that it has no battery and you have to recharge it but this is usually of having it for a full day and toting it around in my purse. Another problem that I’ve run into twice is that sometimes when I unlock it the touch screen doesn’t respond to touch so I’d have to force a shutdown but after that it would be fine. I don’t know if these problems are specific to my tablet or maybe it’s a program problem but I don’t find it to be too cumbersome.  Overall I’d say I really like this tablet. For what I use it for and what the price was I think it was definitely worth it. I was doubtful at first because the price was low and it’s not a very popular brand but I’m very happy with my purchase and have used my tablet for over 3 months now and in that time I’ve encountered very few problems. It definitely keeps me entertained which is what I was looking for. I would definitely recommend this tablet for anyone who was looking for a reasonably priced tablet to use more for entertainment than for work.", "Date": "March 7, 2014"}, {"Title": "Piece of JUNK", "Author": "M. Ball \"jb\"", "ReviewID": "R311PA2MR5U4VZ", "Overall": "1.0", "Content": "Got two of these for my kid's for Christmas.  In less than a week the screen keeps making these blue lines and the image freezes on both of them, you have to turn it off and back on again to get it to stop.  Then the next thing that happened is the micro SD card that we got for it would not stay in the slot and I had to send it back to the manufacturer for them to repair it.", "Date": "March 7, 2014"}, {"Title": "AWESOME-AWESOME-AWESOME", "Author": "Noreen Smedley", "ReviewID": "R17WI7HT8C0BCP", "Overall": "5.0", "Content": "This tablet rocks!!!  And for the price, you can't beat it.  It has many more features than even some of the \"big name brands\" out there.  It however, IS NOT COMPATIBLE with the SANOXY 7\" Tablet Stand w/USB Keyboard - Blk. Faux Leather Carry Case.", "Date": "March 5, 2014"}, {"Title": "You get what you pay for", "Author": "ryesteve", "ReviewID": "RXQOJ8CJ0TK37", "Overall": "2.0", "Content": "Maybe this tablet is a good value for the price, but just evaluating it for what it is, it's a pretty poor device.  The touch screen is not very responsive at all, and the battery life is awful.  Even worse, if you let it drain down to 0%, you literally need to charge it for hours before it will let you power it back on.  Can't understand why this is so outside the norm of every other device I've ever owned, where at most, 5 minutes of charging is enough to get you back in business.", "Date": "March 4, 2014"}, {"Title": "usage", "Author": "Louise Davis", "ReviewID": "R2YONOVI5DLB3I", "Overall": "1.0", "Content": "the tablet shut down and did not work at all.  I don't know if it was the battery or not.", "Date": "February 27, 2014"}, {"Title": "Compares to the Galaxy 3", "Author": "L. Gooding", "ReviewID": "R2LAJGPN6PSJT6", "Overall": "4.0", "Content": "About the only things I can find that makes the Galaxy different is, the Galaxy has a rear facing camera, you can use it as a remote control and it's suppose to have a better life. Also it's $100+ more than this one.So far the only complaints I have with this one is that even when you add the extra SD card you can NOT move apps to it, which is causing a storage problem with the internal memory. From what I've read the Galaxy also works the same way, so I'm assuming that's the way it works with all tablets. This one also has been having issues when I click on a link on the internet it either doesn't register or it's really lagging because of the internal storage issue. I have to click and click  before it will do anything which is very aggravating. I'm writing this review from this tablet right and it seems to be working pretty good so far today though.  I'm still not sure if I'm going to keep it though (or any tablet). My Samsung Note 2 phone has everything and more than I need. I just wanted a tablet for playing games, searching the internet, the bigger screen and not using up my battery in my phone when I'm at home.I've just clicked submit 5 times and it done nothing.  My thoughts are the capacitive screen isn't working properly as far as being able to hit little things accurately.  But the keyboard works great, with printing the letters that type.", "Date": "February 26, 2014"}, {"Title": "great little tablet so far", "Author": "coffeelover1985", "ReviewID": "RCQ4CEU32F2DE", "Overall": "3.0", "Content": "The tablet works great so far,but now it keeps powering off,not sure why other than that it is great compared to many Walmart ones", "Date": "February 24, 2014"}, {"Title": "piece of crap", "Author": "Daniel Valdez", "ReviewID": "R2YUL6FY44UGG9", "Overall": "1.0", "Content": "didnt have for 2 weeks and the pad took a downhill slide worked great when it worked was really dissapointed", "Date": "February 23, 2014"}, {"Title": "Wouldnt turn on after less than a month", "Author": "jonnyb", "ReviewID": "R35A16EPP8PVED", "Overall": "2.0", "Content": "I bought this for my sons birthday. It worked great for a few weeks then stopped turning on. I am glad I bought the replacement coverage but the same thing will probably happen with the new one.", "Date": "February 22, 2014"}, {"Title": "double power 7\" tab", "Author": "Brian J. Berger", "ReviewID": "RYKTGQQGBLYZH", "Overall": "4.0", "Content": "For less than $100 its a great tab. Taxing the processor heavily it was pretty laggy but under normal circumstances it runs fine. The screen is great if looking at it straight on but off axsis viewing is difficult. Battery life is ok. Wish it could be longer but then it gives me an excuse to tell kids to put it down and let charge. Daughter dropped it twice and second time it cracked screen. Sent to dopo with $40 and they sent new one back to me in a little over a week. Over all great tab for price and customer service from double power!", "Date": "February 19, 2014"}, {"Title": "good for nothing", "Author": "Linda L. Hodges", "ReviewID": "R23TIT138XV5LD", "Overall": "2.0", "Content": "This tablet is cheap for a reason. It says 8gb, I guess technically it is, but after the android app, and all the apps that name it function, you might 3gb out of it. Yes you can purchase a micro SD card for it, but the problem with that is this tablet WILL NOT let you download app straight to it. All app go straight to internal memory unless you get them from your computer and put them directly on on the external memory (sd card). It only gets worse from there, after you spend a couple hours charging this thing, you might get 2 or three hours out of it. So being the people that made thing are so smart, they decided to put a whopping 3 foot charging cord in it. So guess what you have to eat the wall socket to be able to use the thing when it plugged. Do yourself a favor and spend the extra 20 or thirty bucks, and get a real tablet.", "Date": "February 17, 2014"}, {"Title": "Great bang for your buck!", "Author": "S. May", "ReviewID": "R3C3UEJDCKX7SK", "Overall": "5.0", "Content": "I got this for my partner for Christmas and she loves it. It works great and doesn't freeze up. Nice clear screen and easy to set up.", "Date": "February 17, 2014"}, {"Title": "Awesome value", "Author": "Dawn", "ReviewID": "R12KK7EDVW96RB", "Overall": "4.0", "Content": "Best online purchase I've made! Only downfall is battery life could be better. But other than that I haven't had any issues with the excessive daily use I've put it through !!", "Date": "February 14, 2014"}, {"Title": "I expected more.", "Author": "Haxele", "ReviewID": "R1TZWLJIXRN0AU", "Overall": "1.0", "Content": "Read real good reviews, but I was very disappointed when I received mine.The screen is a bit hazy from certain angles. The touchscreen did not function properly. I was trying scroll up/down but it ended up clicking on links or apps. Can't get the latest android either unless you root it.I returned the tablet and bought the newest Nexus 7 instead for $200. It's worth the extra bucks.", "Date": "February 14, 2014"}, {"Title": "doesn't work after 6 weeks", "Author": "ridha abdulridha", "ReviewID": "R1UKBIB6BYICZV", "Overall": "1.0", "Content": "i use it for six weeks only. and now it doesn't work. it is trash. i really disappointed with this product.", "Date": "February 14, 2014"}, {"Title": "Save your money and buy one a little more expensive", "Author": "yj93jeeper", "ReviewID": "R3I4YBS5FRL2BW", "Overall": "2.0", "Content": "I bought the EM63 in blue through Groupon.  i have owned it for 3 months, and it has caused me nothing but headaches.  I have already had to reset to factory settings 3 times and reload all the apps.  I bought it for my wife to use as an e-reader and do some light surfing of facebook and pinterest.  The last straw was this month it decided not to work at all, I was finally able to get it to boot up by going into recovery mode and doing a factory reset yet again.  I have tried to get in touch with Double power and all you get is a voice mail box.  I called 4 times left 3 messages, as well as emailed 4 times before I finally received an email back basically telling me that I would have to pay for shipping to have them look at it, then if they deemed it non-waranted (to their discretion)work I would have to pay for the repairs.  Do yourself a favor and save your money, step up to the galaxy tab or the Nexus for an extra $70.", "Date": "February 13, 2014"}, {"Title": "Awesome tablet!!", "Author": "Sarah Meek", "ReviewID": "R1CUEI0MWQ5H6K", "Overall": "5.0", "Content": "These tablets are wonderful. I bought four of these..two for my kids for Christmas and two for me and my husband. My kids tend to be a little rough on things and these were no exception. They have been dropped multiple times and still work perfectly. For the price it's a great deal!!!", "Date": "February 12, 2014"}, {"Title": "not a good tablet", "Author": "jvazjr", "ReviewID": "R16SXPTNYIPHVH", "Overall": "1.0", "Content": "This tablet is not good. The internet is not that good either. Way too small and hard to type anything", "Date": "February 7, 2014"}, {"Title": "Wheeler", "Author": "Wheeler", "ReviewID": "R3975JKVGGCZRU", "Overall": "5.0", "Content": "Great product for the price.  I had purchased a different tablet from a different manufacture and had all kinds of problems with it.  So I decided to try this one and if it did not work send both back. This works great and I won't be sending this one back.", "Date": "February 7, 2014"}, {"Title": "good tablet for the price, but camera could be better", "Author": "Kendra F Mathna", "ReviewID": "R3EXFGIQ3MVKKW", "Overall": "4.0", "Content": "First tablet I have owned seems like a good tablet for the price but the camera could be better. Would recommend", "Date": "February 6, 2014"}, {"Title": "I was VERY wary of this.", "Author": "bradley mendenhall", "ReviewID": "R1YEF271GR5RK", "Overall": "4.0", "Content": "i bought two with a bunch of nervous hopes.  one for my mother in law and one for one of my brothers.  they were christmas presents.  it is now february and guess what, still no problems!  i am amazed.  there is even a tiny tiny button on the back to press just in case of failure.  so far no need for it.  so far both my mother in law and bro think i paid at least 150 or so on these (i am not telling).  they love them.  the battery life could be better but you can watch 240 minutes of video before recharging.  if i ever felt a need for a tablet (doubtful) i might consider one of these.", "Date": "February 5, 2014"}, {"Title": "Works for me", "Author": "Amazon Customer", "ReviewID": "R1J1P5BWWGGFNF", "Overall": "4.0", "Content": "Nice tablet for the price. The charge only lasts a couple of hours and it runs rather slow. Great gift for a teen!", "Date": "February 4, 2014"}, {"Title": "Some apps don't work", "Author": "Pen Name", "ReviewID": "RHSE0W1JVNT1B", "Overall": "3.0", "Content": "Easy to use tablet. Very convenient. Some apps don't work compared to other tablets I've used. Very simple and basic.", "Date": "February 3, 2014"}, {"Title": "Buyer Beware...", "Author": "C.Marriner", "ReviewID": "R2WFE181CFSK41", "Overall": "3.0", "Content": "The tablet is good. Works well. The dual core and 1GB of RAM is great for the price. I purchased 2 of these, 1 for me and 1 for my girlfriend.However, here is where the tablet, or company lacks.I've only had this tablet for a little under a month when the screen cracked from me doing nothing to it. I had it on my bedside table charging over night and when I woke up in the morning the screen was cracked. I contacted customer support to see what could be done and the manufacturers warranty doesn't really cover anything. From my gathering of the email sent to me, it only covers hardware defects. Apparently sub-par glass on a defective tablet does not constitute warranty returns. The email stated I have to pay ~$50 (On a $70 tablet) to have it repaired and I have to send it in to be repaired... That's all well and good however, all my banking and business information is on it and I can't do a factory data reset as I can't even use the screen. I can't very well allow them access to all of my information while they repair it. So, for the price, it is a great tablet. But customer support is severly lacking.Pros:All the ports you'll ever need.Decent display.Under $100.Dual core and 1GB of RAM.Cons:Glass easily broken.Tech Support is moot at best.", "Date": "January 27, 2014"}, {"Title": "Pleasantly surprised!", "Author": "DARON PRUSSE", "ReviewID": "R17TM9T2MG806Q", "Overall": "5.0", "Content": "I purchased this tablet for my son last month for Christmas. He loves video gaming and playing around on the net. I've even joined in on a few games as well. Other than a quirky battery issue once in a while I am very happy with the overall graphics, speed and durability of this product. It is very sturdy and well constructed.  I bought a warranty just in case something went awry, but so far so good. Definitely worth the $80 in comparison to other devices I've seen around.", "Date": "January 25, 2014"}, {"Title": "7 inch tablet", "Author": "Greg Lawson", "ReviewID": "R3NLJA79F4ZQAT", "Overall": "5.0", "Content": "The tablet works great, got it for my grandson to play games on so he would leave his moms phone alone. He loves it", "Date": "January 25, 2014"}, {"Title": "Disappointing", "Author": "Robert Ward", "ReviewID": "R15ONIK3W1EDQA", "Overall": "2.0", "Content": "This tablet is decent enough for the price, but you also need to offer a case that will actually fit thia device. i ordered what should have been the appropriate leathet cover only to find it is half an inch too narrow and the tabletwill not fit. That was a waste of money, for sure. If Amazon actually offers a case that fits this tablet, I wish they would let me know.", "Date": "January 24, 2014"}, {"Title": "Second one turned out great", "Author": "Patsy", "ReviewID": "R104XPN7JBYIQ3", "Overall": "4.0", "Content": "The reason I said second one was due to the fact that the first one arrived and the screen was crack but after getting online chat with Amazon they replaced it with another one and even shipped it overnite express , it was here early the very next day, so Im happy with it, it does al i need it to do, it downloads fast, the speed is fast, doesnt pick up hospital internet real good but other than that i love it, im giving it a 4 due to the problems with the first one being cracked but i would for sure recommend it to others,", "Date": "January 24, 2014"}, {"Title": "Great tablet for the price", "Author": "H. Conde", "ReviewID": "RWHW3G5U9O1BI", "Overall": "5.0", "Content": "My son has been using this tablet since I bought it for him as a Christmas gift. He uses it every time he gets a chance. So far, the tablet has been working perfectly. It doesn't have a lot of the apps as my IPAD but for the price you just can't beat it. My wife wants me to get her one and I think I will.", "Date": "January 21, 2014"}, {"Title": "very good", "Author": "cdy", "ReviewID": "R1F51IMIM0QO3E", "Overall": "5.0", "Content": "this tablet works like a charmprosbattery life good enough for a 13 year olddecent screen qualityvery responsive not much laggingcan be charged by usb portconsneeded sd card not enough internal storage  there is no physical home button", "Date": "January 19, 2014"}, {"Title": "Double Power M Series EM63-BLK 7-Inch 8 GB Tablet", "Author": "Seandsun", "ReviewID": "R2H6UQ8VNM9L4B", "Overall": "5.0", "Content": "This tablet was better than I expected. It runs great, loads quickly.  Great screen and graphic for the price.  My 7 year old loves it and so do I.Thank youIt's a great TabletMarisol Scotto", "Date": "January 18, 2014"}, {"Title": "very impressed", "Author": "aquarian", "ReviewID": "R1IUSF5MPWZPR4", "Overall": "5.0", "Content": "This tablet is as good as kindle but less expensive.  I can't tell much difference between them. Very responsive and quick for most downloads.  Bought one for grandson then had to do same for his brother. Easy to operate even for 8 year old.", "Date": "January 18, 2014"}, {"Title": "great tablet", "Author": "Nathaniel c garner", "ReviewID": "R9DL008OY1CGX", "Overall": "5.0", "Content": "i have been very pleased with this tablet.  it has done everything that i could ask.  surfing the internet and playing games and skypeing have been great so far.  i have had this tablet for 3 weeks now so far so awesome", "Date": "January 16, 2014"}, {"Title": "Not Bad at all", "Author": "Sandra Maraj-Bharath", "ReviewID": "R3AG2DTPO2KP92", "Overall": "4.0", "Content": "Bought this for my son and he loves itit's a bit slow but what more wouldyou expect from something like this?it's fully working and not one problem since", "Date": "January 16, 2014"}, {"Title": "Very happy!", "Author": "1fish2fish", "ReviewID": "R3O7FSRR78JOMI", "Overall": "4.0", "Content": "Perfect for my 6 year-old.  Very clear, sharp picture.  No lag time. The screen is very touchy which can be a little irritating and the battery life isn't overly impressive.  It also doesn't have built-in parental controls but there are several free apps to download on Google Play.  Overall, I'm very impressed with this tablet that I can and filter and customize for my son ,the price is great, and I've got my Kindle Fire back!  Very good investment!", "Date": "January 16, 2014"}, {"Title": "Perfect for a toddler", "Author": "robert m robbins II", "ReviewID": "R31ZY2M1LT4ZM4", "Overall": "4.0", "Content": "Our 2 year old learned how to use my tablet and our smart phones quickly. We looked at all the educational tablets but we already have lots of educational activities in the home and just wanted something for entertainment.  We limit screen time but this tablet is great.  I actually stumbled upon it here on Amazon when looking at other Android tablets.  We couldn't be happier with the price and functionality.  We installed video player apps and games and he is quite happy.  I would recommend this along with the FlexArmour cover B00DEOZ5GS", "Date": "January 13, 2014"}, {"Title": "So far so good.", "Author": "B. Mclean", "ReviewID": "R2N2KS3DTJ6XG8", "Overall": "4.0", "Content": "It seems to do everything we ask of it...It runs out of batteries a little quick...Less than 4 hours but my girls like to watch internet stuff so there you go.....Good picture quality and a nice tablet, but not made for multi-tasking.", "Date": "January 13, 2014"}, {"Title": "Battery only last 2-3 hours.  NG", "Author": "ray", "ReviewID": "R1XY8SHQCQHCUW", "Overall": "2.0", "Content": "Battery is a big problem, it last less than 2-3 hours.  Only support 3 languages.  Don't know why?Anyway, try another one, not this one.", "Date": "January 12, 2014"}, {"Title": "i like it", "Author": "Michele Roberts", "ReviewID": "RGZ7OBV7PZ3VO", "Overall": "4.0", "Content": "I love using this tablet. the only thing is that my battery charge doesn't last very long. I think that this tablet is the perfect size and it works very well. The camera has very bad quality.  I am all together very satisfied with this product and I love having it(:", "Date": "January 8, 2014"}, {"Title": "Nice tablet for the money!!", "Author": "Darren Pettry", "ReviewID": "R3FADM1E9BWOUI", "Overall": "5.0", "Content": "Purchased this tablet for my young daughter and she loves it. Works well and seems to be quit durable. It has been dropped a couple times already and still holding up well. Would recommed to anyone..", "Date": "January 7, 2014"}, {"Title": "Ok tablet", "Author": "Amazon Customer", "ReviewID": "R3EFOPYBUFKRLA", "Overall": "2.0", "Content": "I bought this for my son and didn't have app for amazon App Store and is really hard to get it uploaded because of security settings and usually dies within an hour.", "Date": "January 7, 2014"}, {"Title": "Tablet", "Author": "A.G. Bradford", "ReviewID": "R2XTWQO8Z685PQ", "Overall": "4.0", "Content": "Just what I needed I love it I have had so much fun with my new tablet can't put it down for too long!!!", "Date": "January 5, 2014"}, {"Title": "Good tablet", "Author": "QN \"Just a buyer\"", "ReviewID": "R3BW5QNILBMW14", "Overall": "5.0", "Content": "Got it as a cheap (sacrificial) tablet for learning Android app development.  Got ADB drivers working after installing Android SDK and running AdbDriverInstaller on Windows.After that, interactive debugging works with this tablet.You can get AdbDriverInstaller  from [...]", "Date": "January 4, 2014"}, {"Title": "Love it", "Author": "Adanne", "ReviewID": "R371PEBYPJT2PN", "Overall": "5.0", "Content": "I had to replace my nexus 7 which I purchased from Walmart.. I loved it but I had so many issues with it and hadn't even had it a full year. I just received a l new laptop for Christmas so this will just be used to carry with me to school. I love it so far :)", "Date": "December 31, 2013"}, {"Title": "Pretty good", "Author": "Michelle M.", "ReviewID": "R1U9JGK9GI00DW", "Overall": "4.0", "Content": "I like this tablet a lot! The reason I gave it 4 stars, though, is because of its battery life and sucky camera. I charged it to a full 100% but it only lasted 4 to 5 hours max( of course that was with the wifi on). I also liked the little bonus pack that it came with. All in all, it's a pretty good tablet, especially for its price.", "Date": "December 27, 2013"}, {"Title": "So far so good", "Author": "D. Laster", "ReviewID": "R3GQICRRAQ8JS3", "Overall": "4.0", "Content": "So far so good.  My 12 year old nephew really likes it.  He figured it out quickly.  It looks like a good buy.", "Date": "December 27, 2013"}, {"Title": "POOR QUALITY", "Author": "shelly tracy", "ReviewID": "R4Z7UM45OBPFC", "Overall": "1.0", "Content": "I purchased 4 of these for Christmas gifts. One was dead on arrival and returned. Two of the other three have all failed. Two were sent to the company for charging port issues in less than a month of use. One of those two also went into a \"google play app failure\" and was locked up. I contacted customer support and they sent instructions to do a factory reboot, which wipes ALL of the content. That worked for less than 2 weeks and now it won't load at all. I am sending that tablet back now for the second time (charging port issue and won't load). The tablet is only 3 months old. I am now at $60 in return shipping costs. Save yourself a headache and buy another brand. The tablets are great when they work but they are unreliable. Only one of the four I purchased has not had a problem...yet. To contact customer service you have to call and leave a message and wait for a call back or send an email through the company website and wait for a response. I was issued a return label only once and that was after I already paid to ship it back myself. The website states a 14 day turnaround for repairs. It has been less than that thankfully.", "Date": "April 2, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DHKGAAE"}}