{"Reviews": [{"Title": "Great Platform for My Purposes", "Author": "J. Ferris \"tunawish\"", "ReviewID": "R2W89YBWYYVJLU", "Overall": "5.0", "Content": "I travel a lot & got this iPad mainly for reading magazines (wanted to cut down on paper weight in my bags.)I had tried the Kindle Fire & didn't like the smaller screen & definitely didn't like Amazon's flavor of Android (the home screen stinks & you can't download apps from Google Play.)I soon discovered that this iPad was not only great for magazines but I wind up using it a lot more than my MacBook since it fits on my lap better & the battery lasts longer.FYI - I prefer using Safari to go straight to sites like eBay, Amazon & Yahoo Finance on the iPad instead of using the dedicated apps.The apps will narrow & restrict your abilities on these & other sites (OK on a phone with limited screen real estate) but I prefer the full browsing experience.I'd like to move up to the 128gb model since I've got 90+ gb of music in iTunes & can only put my 5 star selections onto the iPad (not a huge deal but I would like to selectively add whole CD's from time to time.)Unfortunately; Apple does not include a slot to expand the amount of memory in this iPad (or any other iPad for that matter.)You can; however, you can use a wireless device like the portable SanDisk Connect 32GB Wireless Flash Drive (SDWS2-032G-E57) or the [5-in-1] RAVPower® Wireless SD Card Reader,USB External HDD / SDD / USB Flash Disk Reader,3000mAh External Battery Pack & NAS File Server & Wi-Fi Hot Spot Wireless Media Streaming FileHub RP-WD01 either of which will allow you to store & access more music, books, magazines & photo/video with your iPad.Overall; a nice pad for the price...", "Date": "November 12, 2013"}, {"Title": "No complaints so far", "Author": "songbird", "ReviewID": "R3AFSSPYWBP083", "Overall": "5.0", "Content": "I've had this ipad for about a month now and so far so good.  I basically only use it for song lyrics.  I downloaded the setlist app so that I don't have to use my notebook on stage (very unprofessional). The words to all my tunes are highlighted and it's so much better than turning pages in a notebook which would always end up falling out of the rings.  I am happy so far, but I really need to learn this ipad better.  Great battery life also.", "Date": "January 3, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DJA20CE"}}