{"Reviews": [{"Title": "The Galaxy Tab 3 8.0 - What A Superb Tablet! Just The Right Size!", "Author": "Daisy S \"Daisy S\"", "ReviewID": "R389582PNFZUTD", "Overall": "5.0", "Content": "Updated Review - June 8, 2014 (after close to ONE YEAR of ownership): So I have found that this tablet CONTINUES to exceed all of my expectations and more! If you are looking a high quality eight inch tablet, this may very well be the once for you as the superb improvements in this Tab 3 8.0 over the older Tab 2 7.0 are just fantastic with more internal RAM Memory and more internal storage (double) and this is just a couple of improvements as there are MANY improvements in the Tab 3 8.0 that has truly has given this tablet that WOW Factor.  So below, I am listing the many Pros I personally have found while using this tablet:PROS:+ Overall Speed And Performance and Android OS:With the fast 1.5 GHz processor, I have found this to be a very fast tablet and for me, all has been running so smoothly on this tablet. Love that this tablet has 16GB Internal memory.The Android OS is 4.2 and inside it has Samsung TouchWiz overlay which is beautiful and user friendly. In fact, if you have used a Samsung Galaxy device as S2, S3, S4 or other Galaxy type, you will love the OS and the Samsung TouchWiz interface on this. Perhaps you have never used Android OS or even a Samsung device? No worries, as this tablet is easy to learn in my opinion.+ SCREEN SIZE IS JUST RIGHT SIZE - VERY CLEAR/SHARP SCREEN FOR READING eBooks or VIEWING WEBPAGES. (Screen in my opinion is large and has superb clarity/clearness for reading eBooks and webpages as the print is so readable as I find it VERY CLEAR/VIVID. This is a great in-between size tablet to use. And I found that the screen was large enough to read webpages easily or watch videos. The screen has a PPI (pixels per inch) of 189, which renders a crisp and clear screen. **There is a new selection under Settings and Display, under Font, an option to Increase legibility of fonts. I check marked this and noticed that the fonts/letters on the screen, internet and more are very crystal clear. Also, there is in Settings/Display - Screen Mode, with choices of Dynamic, Standard and Movie. And I selected Dynamic and found that the colors are super vivid and very colorful.+ EXTERNAL SLOT FOR MICRO SD CARD - It is said that you can add a 64gb SD card for personal files. In my case, I have a 32GB SD card and still have plenty of room after my songs, files and photos are added. (A 64 GB card has different formatting and I have not used this size, just the 32GB) About SD Cards: Keep in mind where External SD cards are concerned: They are JUST for your personal files: music, videos, photos, and other files. When you install apps from the Playstore or other sources, they store either in INTERNAL SD Card area or the main internal area. This is the law of the land where Android is concerned and ALL newer Android devices (including Samsung) work this way where storing your downloaded apps are concerned.+ WiFi Connecting/Speed of WiFi - Setting up WiFi and keeping a great signal and long distance WiFi strong signal is one superb feature on this tablet. So I compared the signal strength with the Tab 3 vs my regular Android phone. The Tab 3 had about 35% stronger signal then the phone. I believe it is because there is a very strong WiFi receiver in this tablet. At home or on the road, I am able to connect to many free WiFi hotspots very easily with great signal strength.****Do you need to know how to get on the internet when you are out of a WiFi range? Ask me about this as I have written an article on how to do this using a MiFi type of service from different service providers (please ask in the comment section for more info).+ Internet/Watching Online Flash Videos: After I installed Adobe Archived Flash I can watch internet (flash) videos directly.Because this is archived flash it does take a little longer to load flash videos. If you need instructions on how to do this, please ask in the comments and I will answer this or any questions.*Viewing of webpages in browsers on this tablet: Reading/viewing a webpage is OUTSTANDING using this tablet as the fonts, pictures and videos are very crisp and clear as well as the colors are very vivid.+ Reading/Creating/Editing Word, Excel, Text Files and much more on this tablet: This comes with a OK app for reading Office documents, however, I prefer Kingsoft Office which is a free app from Playstore. It is the best I have ever tried and I am very picky about so called Office programs. It is very compatible with MS Office as it reads, edits and creates Office files and reads PDF files, and it has more features of any other Android Office program that I tried. This app is a MUST have for tablet owners in my opinion.+ Home Videos - The stock video player is OK and plays MOST home videos, however, may I suggest QQ Player, this is a free App from Playstore and it plays every home video I tried). Also MX Video Player is very good, however, I prefer QQ Player.+ Music Player/Sound Quality - Stock player has clear sound through the outside \"speakers\" are really OK. Better with good quality headphones or a BlueTooth Speaker. To sync easily with Windows Media Player may I suggest the Playstore app free called WinAmp for the tablet as it is very highly rated and the sound is SUPERB!+ Battery Life- Excellent, so far, however, this is what I have found: When I am on WiFi, I go to the websites I need and then as soon as I am done (reasonable time), I exit the browser (or YouTube, etc) and TURN OFF WiFi. However, I run my brightness at 100%. So this seems to keep the battery going longer. *In addition, I have found that my battery life is improved over the Tab 2 7.0 and the Tab 2 10.1.+ Kindle App - I installed the Kindle App and synced my Kindle books. Began to read a new book and was very impressed with how exceptional the book rendered using this Tab 3 8.0. Very impressed as the text was very crisp and clear.+ Camera - The 5MP rear camera on this Tab 3 8.0 has improved over the Tab 2 line. There is no flash on the camera, yet there are several helpful modes to enhance your shots. For me, I use Auto mode. And I tried the camera and video and was happily surprised in the quality - it is pretty good. However, I will continue to use my regular camera for serious picture taking and videos.+ OTG USB Compatible - You can add an optional OTG (On the Go Micro USB adapter cable to the Micro port for copying files to your flash drive and from your flash drive to the Tab 3). I already had one from my Note I and it works great on the Tab. You can also plug in a mouse, I tried it and it worked. *Note that portable external hard drives and portable DVD/CD drives will not work using OTG in the Tab 3 as I discovered when I tried to read my hard disks via OTG in the Tab 3. However, it is still good to know that you can easily plug in your flash drive and copy files to the Tab 3 and from Tab 3 to PC--what a time-saver.+ Bluetooth Speed and Performance - The Bluetooth paired quickly with several devices as well as Bluetooth keyboards, Bluetooth Stereo Headsets, Bluetooth speakers (all I tried) and copied files at a great rate of speed. SUPERB and FAST Bluetooth.+ Screenshots: There is no ICON for screenshots, however, to take a quick screenshot, hold down home button and power button (at the same time), and then it will take a beautiful screenshot. You can find your screenshot in MyFiles, Internal Storage, Pictures, and Screenshots. I use this sometimes for a map on the internet it saves time and this way it is SAVED for later viewing when I am offline.+ MICRO USB PORT - No more having to use the old type of (non standard) USB charger/cable that the Tab 2 line had. However, this tablet requires a 2 AMP USB Charger to charge the tablet so it will not charge on a standard 1 AMP (phone charger) as I tried and only the 2 AMP one will work. This tablet uses the same Micro 2 AMP type of chargers that the Galaxy Note 8 uses.CON (Just ONE however, NOT the fault of Samsung):- Just one con/concern: New Adobe Flash is not supported, however, I found that archived flash gets the online videos to play and they even play in the stock browser. So I downloaded the older archived flash which gives me the ability to view many internet videos. If you need instructions, just ask me in the comments and I will answer.* Bottom line/My Suggestions to You: Would I buy this WiFi only model over again? Yes because this Tab 3 8.0 is lightweight, easy to hold in ONE HAND, and it just as easy to hold as the Tab 3 7 inch, yet has so much more screen real-estate than the Tab 3 7 inch and clarity etc, for just 90 dollars more, this is a MUCH BETTER BUY! And I have found because the screen is so crisp and clear, it reads internet pages CLEARER, Videos are larger and much clearer to see etc. And the 8 inch is so easy to pop into a briefcase, bag or purse etc than say a large 10 inch is...if you travel and want to go light, may I suggest this Tab 3 8.0 to you!Also, since I am somewhat of a techie person, I will be glad to answer any questions that you may have. Just ask in the comment section and I will answer promptly.", "Date": "July 9, 2013"}, {"Title": "I ditched my iPad Mini for a Galaxy Tab 3 8.0 and couldn't be happier!", "Author": "MOAR COARS", "ReviewID": "R1YTRONAD0J95M", "Overall": "5.0", "Content": "So it's been three days since I got my Galaxy Tab 3 8\" (my brother is a manager at BestBuy so I got it early if you are wondering) and before I start my review, I just want to say that I used to own an iPhone 5 but ditched it for a Galaxy S4 and now I'm ditching my iPad Mini for a Galaxy Tab 3 8\". I've literally had enough of Apple products and will not be buying their products any longer. I have become an Android fanboy and literally love all the products that Samsung makes.The Galaxy Tab 3 8.0 has the same look and feel as the Galaxy S4 but it's just bigger which I have no problems with. My brand new Galaxy Tab 3 8\" makes my iPad Mini look like a joke in everything that I have tested so far, from battery life, web browsing to 3D games etc. The Galaxy Tab 3 8.0 comes with the latest version of Android which is Android 4.2.2 (Jelly Bean) and it is liquid smooth. I haven't experienced a single slow down so far and everything seems to open very quickly. It also has a very fast CPU (Mali 400) that runs at 1.5Ghz and handles 3D games like a champ. I have listed some things below that I love about the Tab 3 8.0.These are some of the things that I love about the Galaxy Tab 3 8.0:Pros:+Build Quality / Design:If you are familiar with Samsung's devices and have no problems with their glossy plastic design, then you will love the design of Tab 3 8.0 as well. The Galaxy Tab 3 8.0 has a nice thin bezel that's thinner than its predecessor and also better looking as well. While my iPad mini was made of aluminum, Samsung continues to use the same glossy plastic with their devices and this isn't a bad thing by any means because my Galaxy S4 is plastic as well and I absolutely love it. The Galaxy Tab 3 8.0 is a bit taller than my iPad Mini but also a bit narrower and both of them are extremely light, around 310g.+Web Browsing:The web browsing experience is awesome on the Tab 3 8.0, everything looks sharp and loads quickly. I'm not using the stock browsing app because it lacks many features that I use on a daily basis but instead, I'm using Chrome and Dolphin Browser. I'm also not using the stock Samsung keyboard because it doesn't have the swipe feature that I use quite a lot so I downloaded the official Google keyboard from the Play Store and I love it. I highly recommend you guys try the official Google Keyboard if you want a clean and slick keyboard that's not cluttered with a lot of useless stuff.+Screen/Display:The Galaxy Tab 3 8.0 is the perfect size for me because tablets that are usually 7 inches are too small (I have large hands btw) and tablets that are over 9 inches are sort of big and this makes the Tab 3 8.0 the sweet spot for me. The Galaxy Tab 3 8.0 has a nice 8 inches screen that makes everything looks sharp with vivid colors when watching HD videos or playing games. The colors and viewing angles are fantastic, I have absolutely no complaints. The screen resolution and ppi is also much higher on the Galaxy Tab 3 8.0 (1280x800, 189ppi) than the iPad mini (1024x768, 162ppi) so this makes everything look sharper on the Tab 3 8.0.  The iPad Mini has an aspect ratio of 4:3 while my Tab 3 8.0 has an aspect ratio of 16:10.+Android OS:It ships with the most up to date version of Android, Android 4.2.2 (Jelly Bean) which is the fastest Android version yet. Everything is liquid smooth, from web browsing, watching HD videos, recording videos and playing intensive 3D games. Samsung has added many new features to TouchWiz which is great but I'm not really a fan of TouchWiz. I usually just disable all the things that I don't use to improve the performance of the tablet and the battery life. I just wish Google would force all these manufactures to use stock Android OS instead of coming with pre-installed bloatware and whatnot that slows the tablet down and kills the battery life.+Camera:The rear camera on the Tab 3 8.0 is 5MP (2592x1944 pixels) and the front camera is 1.3MP. It can only take 720p videos which is more than acceptable for me but it would have been better if it had an 8MP camera and took 1080p videos. My iPad mini was able to take 1080p videos @30fps and I just wish I had that option with the Tab 3 8.0. There's nothing wrong with 720p and 5MP camera because it takes great pictures and videos and this is not really a deal breaker for me.+Battery:The battery on the Galaxy Tab 3 8.0 is 4450 mAh which is more than enough to last a full day (brightness turned down a bit) with a single charge if you watch YouTube videos, web browsing, picture taking or even watch HD movies for that matter. I can get through the day with a single charge and still have 10% left at the end of the day. My brightness is currently set at 40% and it's perfectly visible both indoors and outdoors. The battery life is one of the most important aspects when deciding which tablet to buy for me because I travel a lot and I need a tablet that can last the entire day.+Storage:With the option of an external sdcard, the Tab 3 8.0 supports an sdcard of up to 64GB. If you are someone who wants that amount of space on their tablet than you have that option with the Tab 3 8.0. I can store as many pictures, music, games and HD videos as I want and it will never come close to being full. I am the type of person who stores large collections of pictures, music, videos, and movies and the Tab 3 8.0 lets me do all of that easily. I also play 3D games that require a minimum of 2-3GB of space and this tablet is perfect for that. It comes with 16GB of storage (11.2GB usable) which is plenty for taking a ton of pictures/videos, installing large 3D games and whatnot.  It also comes with 1.5GB of ram which is three times as more as my iPad Mini (512MB). I hated the lag that I would get when running out of ram on my iPad mini but now I don't have that problem with my new Tab 3 8.0.+Processor:The Galaxy Tab 3 8.0 comes with ARM Mali-400 which is a dual core CPU that runs at 1.5Ghz and it has no problems handling everything you throw at it, from 3D games to HD videos. The tablet comes with a ton of bloatware as always and I always try to disable most of it because it can really waste precious battery life and slow down the tablet. I rarely ever use all the features that Samsung provides so I just disable it. The Mali-400 has no problems playing games such GTA Vice City on the highest settings and that says a lot about the performance of the CPU. Multi-tasking is fantastic on the Tab 3 8.0 because it has a ton of ram and a fast CPU to handle all your apps running in the background if you need to.Cons:-Not 1080p display:I just wish Samsung would have upgraded the display to 1080p since that's the standard nowadays but oh well, I'm perfectly fine with what I have. That's the only negative that I can think of but it's not a deal breaker for me because it won't make a huge difference to the eyes even if it had a 1080p screen.Conclusion:Overall, the Galaxy Tab 3 8.0 is the perfect tablet for people who want a mid-range device with amazing specs that's not too small and not too big but somewhere in between. The Galaxy Tab 3 8.0 fills the sweet spot for me and the fact that it lasts a full day with the brightness turned day a bit is great for me. I can get all of my work done when traveling without having to constantly charge the device. It also comes with a fast CPU, Mali-400 that runs at 1.5Ghz and has a ton of ram, 1.5GB. I was a little disappointed that it didn't come with a 1080p screen but it's not the end of the world because it still delivers an amazing web browsing experience, watching HD videos, battery life and playing 3D games. The iPad Mini is $349.99 while the Tab 3 8.0 is only $299.00 and it's still faster and better overall. I highly recommend the Samsung Galaxy Tab 3 8.0 to anyone who want the best mid-range tablet on the market!I hope this was helpful and I will update my review once I do more tests. If you guys have a question about the tablet then just leave a comment and I will respond.", "Date": "July 7, 2013"}, {"Title": "The BEST of Galaxy Tab 3 series.", "Author": "rpv", "ReviewID": "R1EDJ05MCF3Z5C", "Overall": "5.0", "Content": "There are too many tablets these days, right?! Samsung's third generation of Galaxy Tab series is highly anticipated and for this price point phenomenal. I have been using Galaxy Tab 2 and I will compare and contrast here. I played around with review units of all sizes and I have since returned them. I liked the Tab 8 so much, I purchased 2 for myself and my family. My reviews are unbiased and neutral! 7 and 8\" are ideal for plane trips, long journeys. I had used a 7\" Tablet on a long journey to listen to songs and read epub books (Aldiko) and it was a very pleasant experience. 7\" form factor is lightweight, compact and great. If you are a bit experienced and can afford it, I recommend the 8\". Samsung has made 8\" and 7\" almost same weight. In my opinion 8\" is the maximum value for the money and features and hence I gave 8\" a 5 star. I am personally getting the 8\" version. I gave 7\" a 4 star (but no means undermining it). I gave the 10\" also a 4 star because of some strange feature `limitations'.Samsung has introduced 7\", 8\" and 10.1\" of the Tab 3 series. They are entering all form factors. As I know they have something in 4, 5, 6, 7, 8, 10\" lines. Woo.. All of the 7, 8, 10\" Galaxy Tabs come in white and golden brown color. My preference is white color. Looks pretty!Let's start off with salient points of all of the Galaxy Tab 3 series. In previous version of Tab 2, there was simply no 8\" form factor. So I will compare with Note 8 later.7-inch tablet: 1024 x 600, Marvell dual-core 1.2GHz processor, 1GB RAM and 8GB storage or ROM, a microSD card slot (upto 64 GB), Camera: 3MP rear-facing, 1.3MP front-facing and weighs 10.58 ounces (300 grams). Android 4.1.28-inch model: 1280 x 800, Exynos 1.5GHz dual-core processor, 1.5GB ram, 16GB of built-in storage (ROM), a microSD slot (upto 64 GB, 5MP rear-facing, 1.3MP front-facing and 10.9 ounce (309 grams) Android 4.2.10.1-inch model: 1280 x 800,  Intel Atom 1.6GHz Z2560 dual-core processor, 1GB RAM, a 16GB built-in storage (ROM), a microSD slot, 3.2MP rear-facing, 1.3MP front-facing and weighs 17.99 oz (510 grams). Android 4.2I am not going into other details like accelerometer etc as they are all standard these days, Audio support - AAC, AMR, MP3, OGG, WMA/ASF, 3GA/M4A, FLAC, WAV; MP3/MP4/Music Tones; Music Player; Ringtones, Polyphonic. Video support: AVI/DIVX, WMV/ASF, FLV, MKV, MP4/3GP, WEBM; Video Player; Video Streaming. Software is current of release date, and it is expected could be upgraded as next version Android 5 Key Lime Pie. (Currently targeted for Oct 2013). Key Lime Pie's one of the main touting points is compatibility to avoid fragmentation, so I can foresee, all of these models being able to upgrade if Google keeps their promise.The 8\" has a physical home button so are others in the series.  Also has capacitive Back and Menu buttons. 64 GB SD card is awesome! With prices plummeting for 64 GB cards, it is a great boon. Put all your music, books, photos on the SD card and you have a powerful computer in hand always! I personally use the 64 GB microSD card on my mobile devices. Get this mobileUltra (SanDisk 64GB Mobile Ultra MicroSDXC Class 6 Memory Card with SD Adapter - Retail Packaging.Best thing about Tab 3 8.0 is how holdable it is. It's narrower than the Galaxy Note 8.0. But in every other way, including lightness, comfortable curves, and screen brightness, it feels the same. There is a $100 prices difference between Tab 3 7\" and Tab 3 8\". If that matters get a Tab 3 7in. Otherwise 8\" is more portable and lightweight compared to 10\". The Galaxy Note 2 as well as iPad Mini are same form factors as this one.  There are other reasons to pick the 8-incher over the 7.0. The larger Tab 3 gets Android 4.2 instead of 4.1, 1280 x 800 resolution, twice as much (16GB) internal storage, and 1.5GB of RAM.The comparison with 8\" Note are: Note 8 is slightly heavier 338 grams compared to 309 grams of Tab 8. Each gram matters for long holding.  From CPU processor perspective, Note has a Quad-core 1.6 GHz Cortex-A9  Versus  dual-core 1.5 GHz  of Tab 2 8\". Resolution same on both 1280 x 800 pixels, 8.0 inches (~189 ppi pixel density). The Tab has - Dolby Surround sound enhancement,  it does sound good! The Note has no such mention and I am sure does not have dolby enhancement. Note 8 has 2 GB RAM compared to 1.5 GB here. Both have Bluetooth 4.0\" and have USB Host capability. USB Host is one of the most under noticed features of Androids and is in my opinion one of the best features compared to iPad lines. What this means you get a USB Host cable also otherwise called OTG (On the Go) cables and plug in your USB thumb drive or other USB devices and the device recognizes it. I have used it with Alfa AWUS036H for a wireless project with Android PCAP Capture from reputable Kismet wireless. Both have same camera 5 MP, 2560х1920 pixels, and 720p@30fps.  Another much ignored feature is the TV-out (via MHL A/V link). 8 and 10.1in supports it, whereas 7in does not. You can connect Galaxy devices to a TV to make it truly a fantastic computer if MHL is supported. Throw in a Bluetooth keyboard and it is awesome. Leo Laporte's TwIT TV which is Internet based show has one full episode in Know How on covering this topic. Battery on Note 8 is slightly bigger Non-removable Li-Ion 4600 mAh battery than 4450 mAh on Tab 3 which is not a big difference.Believe me, don't get mired in the spec game. Samsung is creating markets for all form factors and I would consider this as an exploratory stage. Just like Ford or Toyota has cars in different shapes, sizes and price range, so are the tablet vendors now. Remember the laptop wars, 10\", 12\" 13\", 15, 17 and even some 19\" if I remember right few years ago. We used to debate endlessly which laptop sizes are better, which has better speakers and so on. The time has come to fight it out for tablets! I would say go from budget and size. If budget is not a concern, I would say go for Samsung Tab 8. I am usually not a big fan of 10\". 8\" is a sweet spot. If budget is a concern, Tab 3 7\" is awesome, otherwise get the Tab 8. 10\" is marketed for specific segments in business who use for spreadsheets, presentations, remote desktop like Citrix GoToMeeting. GPS was spot on and I tried multiple GPS apps. It was bright outdoors (had to crank the brightness all the way up). I personally use Navigon from Garmin and have downloaded several apps.I tried following apps and they just worked awesome. A tablet is only as good as the apps you have how productive it makes you. It's almost like the camera/lens analogy in the DSLR space. What good it is to have a great DSLR body if you have no good lens? Same with Tablet body and apps you have.WolframAlpha (I can go on for hours praising this. This is a truly genius app powered by hundreds of supercomputers in the background. Wolfram is a computational genius). Well worth the $3 price.Withings HealthMate. (another remarkable app great UI/UX). I am getting the Pulse device as soon as it hit stores. I have been using Fitbit and just itching to get the Pulse as I like the intergrated weight/track runs in one app)Aldiko Book Reader Premium (absolutely love it)Amazon MobileAndroid StatusAndroid Central app (great and must have for Android users)AndroidifyAngry Birds (Space/Seasons)Asphalt 7Amazon App StoreBattery Monitor Widget Pro (a great app)BeyondPod (excellent for podcasts, I haven't used Pocketcast, some friends say it is very good too)BoxCar Maintenance Reminder ProChromeCloudShark UploadCNET TVDespicable Me Game! And weather widget (cute for kids)Dictionary M-W PremiumDragonvaleNAVIGON (from Garmin - offline maps)Google Navigation/Earth/Maps using a portable MiFi boxGoogle Currents (nice way to read News)Google Keep/Keboard/Drive/Search/Books/Voice/HangoutsDraw SomethingEbayLinkedinGoogle Music (Awesome, I have now upto 10,000 songs halfway through Google's 20K Limit)Tapatalk HD (awesome forum browsing app)OverDrive Media Console: Library eBooks & AudiobooksMicrosoft One Note (legacy docs, skydrive of 25 GB is good)Subsonic Music StreamerTerminal Emulator (still need to use vi, yes this is it)TweetCaster Pro for AndroidTwit.TVSkypeSphero (Awesome bluetooth ball game)RealCalc Plus (Awesome calculator app)Tweetcaster Pro (again awesomeness)Plenty of WidgetsAsk questions, the reviews cannot do full justice. I will be glad to answer any questions and usually answer within 24 hours to any query.", "Date": "July 7, 2013"}, {"Title": "Nice tablet, but at a premium price", "Author": "Computer Tech", "ReviewID": "R27EG86EV596DB", "Overall": "3.0", "Content": "Due to the recent releases of the Asus MeMO 8 and the Dell Venue 8, I have updated this review to reflect the new tablets and the price drops of each of the tablets.The Samsung Tab 3 8 is an attractive, light weight, easy to use tablet with a decent screen.  It is reasonably fast, but it is still IMO a slight bit overpriced for it's specs.UPDATE 27 Nov 2013:The price of the Samsung Tab 3 8 has recently dropped to 249 dollars.  At this price, it is more competitive.  Asus has recently released the ASUS ME180, an 8 inch tablet with a quad core processor, micro sd card slot, and front and back cameras.  The Asus is selling for 229 dollars and is a worthy competitor.  Based on my experiences with Asus and Samsung, I would rate these two tablets neck and neck for features.  I rate the Samsung ever so slightly better for overall build quality, however, build quality can vary greatly among tablets.  The Samsung also feels a bit more comfortable in the hand.  Unless you have a brand preference or prefer one over the other because of design or ergonomics, either of these two tablets are very good.UPDATE 3 Dec 2013:  The Dell Venue 8 is a pure android tablet.  It has been selling for $179.00 and even as much as 20 to 50 dollars less on sale.  It runs on an atom (dual core) chip and has 2gb of memory and 16gb of storage.  It looks like a good budget tablet but still offers reasonable quality and a one year warranty.  Dell tends to be much better at honoring their warranties and at customer service than any of the other tablet makers other than Apple.  The display is 1280 x 800.  The most significant complaint about the tablet appears to be the touch screen sensitivity not being very good or at times unresponsive.  It also has an micro sd slot and camera.UPDATE 10 Dec 2013:  The ASUS MeMO 8 tablet has dropped to 199 dollars.  Unless you have a brand preference for Samsung, need the TV remote control features, or have a preference for the lightest tablet possible, then you may want to seriously consider the Asus MeMO 8 or the Dell Venue 8 as less costly alternatives to the Samsung Tab 3 8.  The Tab 3 8 is still selling at a premium ($249) to the cost of the Asus Memo 8 ($199) and the Dell Venue 8 ($179).In the 8 inch tablet category there is now the following tablets in the order of my overall judgment of their desirability (see specs at the end of each for comparison purposes):Samsung Tab 3 8 - at 249.00, this is still a bit costly, but it is light, responsive and has a good screen. Probably has a slight edge on reliability over the others.Specs: 1.5 GHz Samsung Exynos 4210 Dual Core processor, 1.5 GB DDR2 SDRAM memory, 1280 X 800 resolution, Mali 400 GPU, .68 poundsAsus Memo 8 - at 199.00, the ASUS MeMO 8 is the best value in price vs. performance for the 8\" tablet market.  Samsung is placing itself as a premium tablet while the Asus Memo 8 is priced as a good quality tablet at a reasonable price.Specs: AMD Quad Core 1.6GHz processor, 1 GB DDR3L SDRAM memory, 1280 X 800 resolution, Mali 400 MP4 graphics, .8 poundsDell Venue 8 - at prices ranging from 129.00 to 179.00 for the 16GB tablet, it is definitely worth a look. Dell tends to be good on customer service and this tablet has 2GB of DDR memory which is definitely a plus. One review commented on the lack of response for the touch screen, however reviews on Dell's site have been positive. The Dell Venue 8 runs true android. If you can get a branded 8\" pure android tablet for the $129 Black Friday sale price, the deal is hard to pass up.  Note: As of 12/19/2013, Dell has released an update so that multiple user profiles can be used on the Venue 8.Specs: Intel Atom Z2580(up to 2.0GHZ)Dual Core processor, 2GB DDR2 memory, 1280 X 800 resolution, Intel HD Graphics, .82 poundsAcer Iconia A1-810 - gets some good reviews and sells for about 170.00. It is kind of heavy at 1.01 pounds (If Amazon's specs are correct). It also has a lower resolution than the other tablets.  With the release of the Asus MeMO 8 and the Dell Venue 8, this tablet is trailing the others by a bit.  Amazon shows a few complaints about the customer service.  The Acer A1-810 was on sale for as low as 149 dollars recently.Specs: Acer MTK MT8125 1.2 Ghz Quad Core processor, 1 GB DDR3L SDRAM, 1024 X 768 resolution, Integrated PowerVR SGX 544 Graphics, 1.01 pounds (website says 14.46 ounces or approximately .9 pounds)Happy shopping!", "Date": "September 17, 2013"}, {"Title": "Simply a Great Product", "Author": "JL", "ReviewID": "R3KLRHWHXD07L7", "Overall": "5.0", "Content": "I'd like to preface my review by saying that I've always had an affinity for Samsung products. I've owned the original Galaxy tab 10.1, Samsung Series 9 ultrabook,  Galaxy s3, Note 2, and the Nexus 10 tablet. But for those that may simply dismiss me as a fanboy, that's not to take away from my enthusiasm towards tech in general - I own a 15' Retina macbook pro, Ipad 4, Vaio Pro 13, and have had a myriad of other products along the way which I have thoroughly enjoyed. If it works well and fits my needs, I will get it.I like to appreciate each product for what it truly is: the value and usefulness it can provide me. This Galaxy tab 3 8 is as good as any tablet out there on the market today.Size and Build Quality:In my opinion, 8 inches is the perfect size for tablets. 7 feels a little cramped, and isn't the best for reading books or watching media on. 10 inches is great if you're always at home, but not so much if you're on the go or traveling. The 8 feels like that perfect equilibrium between the two that combines screen usability, with portability.Build quality? What can I say, it's typical Samsung. It's not made of crazy precious metals and rare materials; nor should you expect it to be. However, it's sturdy, light, durable, and doesn't have any flex or creaking when held. It's also extremely light so you won't even feel the difference in weight when you throw this thing in your backpack or bag. You can also easily hold it in your hands without having to use a brace for hours without fatigue or discomfort. The Gold Brown color looks luxurious to me and is a unique offering by Samsung.Display:Is it a 300+ PPI, top-of-the-line incredible monster display? No. Does it pack enough pixels to rival retina displays? No. Does it really make a difference? Well, I can honestly say in terms of actual everyday use and color reproduction, no it does not make a difference.Side by side to a Retina Ipad 4, I watched 1080p videos of a wide variety ranging from Nature, Cars, Sports, Music Videos, you name it. The Galaxy Tab 8 easily held its own, and you'd be hard pressed to notice enough of a difference between the 2 displays to really complain or nitpick at all. I'd venture as far as to say that the color looked even better on certain videos on the Tab 8, but I don't want to start another online feud with Apple loyalists so I'll stop right here.The 1280 x 800 display is plenty for a tab of this size, and for comparison is a higher resolution than the iPad Mini.For games, movies, pictures and browsing, it's a perfectly fine display. The only thing I will say, is that text is more crisp, clear and sharp on the Ipad and Nexus 10. If you're not used to those displays, you'll have no complaints with the display on the Tab 8. Nor does the difference make reading/browsing difficult or straining by ANY means. Simply put, the displays on those other 2 devices are out of this world, and you shouldn't expect this tablet in this price range to match that offering.Functionality:TouchWiz: Most people hate it or love it. I've tolerated it in the past, but have grown to appreciate its added features over the years. It's not as cartoon-y or bloated as in the past. TW on this tab is fast, responsive, and offers some nice features you won't get on Nexus devices or other brands. All I can say is, try it for yourself. They've made it easy to use and it doesn't interfere or get in the way of the Android experience in my opinion.If you hate it, you can install Nova or other launchers and customize your look and layout from there.Processor: The Dual core exynos and 1.5 gb ram should be plenty for 90% of users out there.I don't play too many games on tablets so I'll let some of the other reviews answer those questions. But I played Candy Crush, Baseball Superstars 2k13, and a few others for test, and they all played smooth and fast. Note that the referenced games aren't the most graphically demanding or intense.For normal tasks such as browsing, media, email, video chatting? You've got plenty of power, don't worry.The Tab 8 comes with Polaris Office which is great as it offers a comparable experience to the Office Suite of products on your tablet. You're not going to be writing a novel on this thing, nor are you going to open up 40,000 line spreadsheets and perform data analysis. However, for touching up documents on the go here and there, it's a perfectly fine alternative solution.IR blaster: Samsung gave us this nifty feature along with the SmartOn remote app. It hooked up to my LGTV and Comcast set top box within seconds, and I was able to control almost every function of my Home entertainment system from my tablet. It's great to see a large colorful TV guide, and I appreciate and enjoy this feature. If you don't like it, you don't have to use it.Camera: Adequate. I myself don't take photos with a tablet. If you do, this will work for things like taking a quick food pic or family pic. It won't blow your shoes off, but you probably shouldn't be expecting a tablet camera to do that.Speakers: Blah. They're both positioned at the bottom which is not ideal, especially in Landscape mode. The volume levels are decent but nothing to write home about. I wish Samsung stuck with the 2 stereo front facing speakers of the 10.1 2 and Nexus 10. Easy fix? Use earphones.Micro SD Card: Oh, the feature that so many users covet, but so few manufacturers actually provide. HTC, Apple, and Nexus devices all fail to grasp the importance of this functionality. Samsung provides this so you can store your music, photos, books, documents, and movies when you need that extra storage space.There's not too much else that will be a different experience from other Android tab offerings. Apps such as Kindle, Amazon, Netflix, Flipboard, etc are all what you'd expect and work great.If apps, more specifically tablet optimized apps are important to you, then perhaps an Android tablet still isn't the right choice for you. Apple still has far more tablet optimized Apps than the Play Store. However, with the advances already made over the past few iterations of Android, and the rising popularity of tablets in general, I think developers will see the value for providing tablet optimized Apps for Android going forward.Lastly, price: at $299, the value of this product is really hard to beat. It's in the price range to appeal to a wide base of users' budgets, and backs it up with great functionality, features, and design. I'd recommend to any of my friends and family.", "Date": "July 26, 2013"}, {"Title": "Samsung nailed it in the 8\" category.", "Author": "B. Nelson", "ReviewID": "R2W0UFSP37LTF", "Overall": "5.0", "Content": "I bought this tablet on release day at Best Buy. This tablet is the perfect blend of portability with a big enough screen to comfortably web browse. It is lightweight and the slim side bezels allow me to grip it with one hand. It is designed with portrait orientation being it's preferred position which is the way I find myself holding it 90% of the time anyways unless watching videos.The inclusion of hard buttons makes the most of the screen real estate, but take some getting use to if you come from non-Samsung android devices as myself.  This device has become my favorite android device that I use on a daily basis. It fits in cargo pants/shorts pockets. I also have an HP Touchpad running android that I never use that much due to its weight and size. I use this to read books, web browse, listen to music, and watch videos.  I am a tech junkie. I have also been involved with android since its first device, the original Motorola Droid. I want to highlight some of the features of this tablet that make it stand out from the rest of the pack. I also want to correct misleading and sometimes incorrect information presented in other reviews.-Hardware-Unfortunately, Samsung chose to skimp a little on specs of this device. I'm sure it was because of the cost of the 8\" screen and yet trying to keep the overall cost cheaper than Samsung's premium line Note 8.0. If you are one that is dead set on using specs,i.e. processor, ram, resolution, as the main determining factor, this tablet will not stand out amongst competitors. What will stand out is the 8\" screen. This tablet is using the same screen as the Note 8.0. I find it sharp with natural colors and not over-saturated. Photos and videos look excellent.Samsung includes a microSD slot that can use cards up to 64GB. This can hold music, documents, and videos.This model also comes with a forward and rear camera. The forward camera can be used with Skype and Google Hangouts and is also used in one of Samsung's software enhancements that I will touch on in a minute.As you can see, nothing pops out from a hardware standpoint except it's form factor, 8\" screen, and microSD slot. It also has an InfraRed blaster built-in for controlling A/V equipment. I wanted to add that while this tablet may not be using top of the line specs, it does not suffer in the least bit from its exclusion. I have not experienced any lag or long delay.-Software-This is where Samsung shines. It has some innovative features that enhance the tablet experience and brought back a much requested feature that was included in past versions of android.Multi-window - This allows more than one app to be open at the same time. This is a feature I don't use that much, but I find it nice if someone emails me to setup an appointment. I can have the calendar app and email app open at the same time to input the time/place from the email into the calendar. The multi-window feature does not work with all apps, only the ones pre-selected in the scrollable list which is understandably geared toward productivity.Smart Screen - This is a feature that uses the front camera to look at your eyes. This is a great feature when web browsing. It keeps the screen lit as long as you are looking at the tablet. When you look away, it allows the screen to timeout. I find this feature does not work well when reclined because it does not detect my eyes. This is due to the angle I am looking at the tablet with my eyes half closed. It also does not work well in landscape orientation most likely due to the camera being on the left edge in that position.Move apps to SD - This is a feature that was available in past versions of android. Google removed this feature in all current builds. Samsung reintroduced this feature in their tweaked version of Jellybean 4.2.2. This allows you to move compatible apps to your microSD which help frees up precious internal storage. Keep in mind, this does not work with all apps. It is up to developers of the apps to allow this feature. I tested this with Angry Birds, Netflix, Kindle. They all successfully moved to my microSD and ran flawlessly. Tip: You may have to format your microSD with the tablet instead of a PC for this feature to work.Miracast/Screen Mirroring - This device is Miracast certified. This allows you to wirelessly mirror the tablet's screen to your TV. For this to work you need a Miracast certified TV. Sony, Samsung, and LG all make Miracast certified TVs. You can also use a Miracast certified dongle that attaches to an HDMI input on your TV. This is the only small portable tablet that currently has this feature besides the Note 8.0. Even Samsung's new Tab 3 7\" does not have this feature.Bluetooth v4.0 with aptX codec support - I had to dig to find that this tablet supports aptX codec. This is a huge improvement in sound quality via bluetooth. To use this, you also need bluetooth headphones that support aptX or an bluetooth dongle for your home stereo that supports aptX. Not all new devices support this, but I have found that Motorola and Samsung both have been including this in their newer products.Polaris Office - This tablet ships with Polaris Office installed. This lets you edit, create, and view Microsoft Office documents, spreadsheets, and powerpoint presentations. Some tablets and phones only come with a version that lets you view the files while Samsung included a full version with this tablet.-Conclusion-This tablet is selling with mid-range specs, but a high-end user experience. It comes with Samsung's optimized version of android Jellybean 4.2.2. The only notable feature missing from this tablet is NFC which would have come in handy for the Miracast feature. Overall, this tablet comes packed with features not available on any other tablet in this price range or form factor. This is the first android device that I haven't wanted to root right away to gain more functions and abilities.", "Date": "July 21, 2013"}, {"Title": "Highly Recommended", "Author": "walt \"kromerser\"", "ReviewID": "R2YW625L8935MB", "Overall": "5.0", "Content": "I don't write reviews, but this tablet deserves a 5 star because of its functionality and user friendliness.I'm not an tech expert by any means, but this product is pretty easy to use and the main apps and basic functions are mostly self explanatory.With that in mind, if you are in the middle of the fence, like I was a few weeks ago trying to decide  between buying a kindle HD or a Nexus 7, I recommend you to pick up a Samsung instead, preferably this model instead the 7\" because of its better features.I have friends who have Kindle and Nexus tablets, but this one blows them out of the park mostly because you can add an external memory card and have your music and family photos loaded on the card instead of going through an online storage service like \"cloud\", the remote control app and and included charger which the kindle doesn't include.This tablet holds a charge with no problem.Again, i'm not a tech expert, so please don't bash me, but as i mentioned from the get go this tablet is great for a person who wants to browse the web, watch videos on you tube, use skype, to watch shows on netflix of hulu plus and to play games and listen to music.You just can't go wrong with it. As a side note, the Invellop HD screen protector for this model fits like a glove.Thanks", "Date": "July 18, 2013"}, {"Title": "Extremely nice 8\" tablet - I chose it over iPad Mini with Retina & Air", "Author": "Douglas R. Hindman \"Dougiebaby\"", "ReviewID": "R3MRQQV6D18HYW", "Overall": "4.0", "Content": "On November 1st, 2013 I purchased the new iPad Air and really enjoyed it.  However, I did not like the 10\" form factor and returned the unit.  Luckily, I was able to purchase the new iPad Mini with Retina display on its first day launch at the Apple Store on November 15th.  I was able to spend a good deal of time with this unit since it was in the \"holiday season\" and I was able to return it on January 6th.To be honest, I absolutely loved both Apple products but it was somewhat of a hollow feeling as I really felt like I paid too much vs. the competition.  I don't mind paying a premium price for a premium product, but the iPads are no longer the only premium products in this space.So, after almost 2 months with the Mini I purchased this Samsung Tab 3 8\".  Technically, it does not match the impressive spec sheet of the Mini with Retina.  But in real world performance (viewing videos, surfing the web, running applications, running games - from Candy Crush Saga to Asphalt 8, reading e-books and Flipboard magazines, etc.) there is actually no noticeable performance differences between this and the Mini with Retina with the exception that the Mini seemed to hold its charge a bit longer (about 1 extra hour).Oddly, the Mini would stutter when I scrolled in the Facebook app whereas the Samsung does not.  Another odd thing about the Mini would be it would start Netflix videos in Standard Def then about a minute or two in switch to High Def.I don't mean to bash the Mini as it is a great product.  But I don't think it is worth 160 dollars more than this Samsung (I purchased mine at Costco for 239 vs. the 399 Mini).On to the Samsung Tab 3 8\"...The 16:9 aspect ratio screen is perfect for watching videos.  The screen is brilliant and stunning to look at ... more brilliant than the Mini even though the Mini has a higher resolution screen.The camera has many more features and shooting modes than the Mini.  The Mini does shoot video in 1080p vs. Samsung's 720p.  Oddly enough, I actually prefer shooting video in 720p as it is still HD but the files are much smaller and easier to process on my MacBook Pro (using iMovie).Another fantastic feature about this Sammy is that you can upgrade storage using micro SD cards.  I purchased one, here on Amazon (http://www.amazon.com/SanDisk-MicroSDHC-Memory-Adapter-SDSDQU-032G-AFFP-/dp/B009QZH7BU/ref=sr_1_1?s=electronics&ie;=UTF8&qid;=1391452164&sr;=1-1&keywords;=sandisk+ultra+32+gb), for 22 bucks - thus, increasing storage to 48 GB (16GB standard + 32GB card).  Apple charges $100 to upgrade Mini from 16GB to 32GB.Another interesting thing is that the same apps on this device take up less space than on the Mini.  For example, the Facebook app on this is 44MB vs. over 300MB on the Mini.  Also, Asphalt 8 is only 27MB on this vs. 1.5GB on the Mini.  So, you very quickly use up storage on the Mini vs. this.I love the IR blaster on this tablet and use it to control all of the TV's/satellite in my home -- it's awesome!The \"Cons\" of this tablet are: the back and menu buttons on the bottom can be mistakenly hit when you don't mean to push them ... this can be very frustrating when watching a movie or playing a game, then suddenly the movie/game stops because of an errant back button touch.My only real wish for this tablet is that it lacks (as almost all tablets do) a LED flash for the back camera.  Unlike the popular consensus that \"why should a tablet have a camera anyways?\", I completely disagree.  Sure with a big 10\" tablet it looks odd taking a pic or video, but with a smaller 7-8\" tablet it really is quite nice/easy to frame shots/video and playback of the pics/videos in this larger size (vs. phone) is awesome for all who view it.For the price and performance, I love this tablet.", "Date": "February 3, 2014"}, {"Title": "Very competitive tablet. Vs google nexus and kindle fire hdx", "Author": "Dominic Bronson", "ReviewID": "R15Z7JMVWXJU6P", "Overall": "5.0", "Content": "So I did my research on tablets. And I found three small tablets that seemed to be the best for the money: the google nexus 7, Kindle fire hdx, and samsung tab 3 8.0.  The first thing that really stood out was the 8\" screen on the samsung. Yeah the nexus 7 has a sharper screen when you look closely but it had both larger bezels and a significantly thicker frame making it feel chunky campared to samsung. The nexus does have a quadcore processor which is clocked at the same speed as the tab 3 8.0. But both are very fast. Otherwise these tablets are similar. They both have plenty of RAM, front and back cameras with HD video shooting, access to google play, and android's jelly bean OS. The samsung tablet felt so thin and sleek in hand. And the nexus' limited you to 32gb of storage, while samsung's tablet allowed you to expand from 16gb all the way to 80gb by adding a 64gb sd card which is now supported by the tab 3 line. This is very helpful if you like to carry your movies around with you. I ruled the kindle fire hdx out for several reasons before but mainly because it restricted you to amazons app store and media supply.  I bought the samsung tab 3 8.0. But i can confidently say that overall, all three tablets are great choices just be sure you actually look at them and play with them before choosing the one that's right for you.", "Date": "October 29, 2013"}, {"Title": "The perfect size and an excellent tab for the price", "Author": "Amazon Customer \"macsfive\"", "ReviewID": "R2G5P2T6JHUDEW", "Overall": "5.0", "Content": "I've used my Galaxy 3.0 tablet for 2 weeks, every day, and I couldn't be happier.  I find the screen to be great, very sharp and very responsive, and am not having any issues with rapid discharge - in fact I have been able to go 2+ days on one charge as long as I let the tablet sleep when I am not using it.  I purchased one of the cases that put the tablet in sleep mode when the cover is closed, and this may be hapling with battery life.  So far I have not watched videos much but I have spent lots of time on the internet, listening to music (through earbuds) and on youtube and with multiple apps open at the same time.I often edit documents and photos on the tab and am very happy with its performance. OTG capability is a must for me as I use my tablet as a laptop replacement when I travel and I need to be able to transfer files from SD cards and USB drives. File transfer and uploading/downloading to the internet are all very fast, much faster than my previous android tab, which was a relatively new and very well-rated 10-inch tab from a different manufacturer. I have a Motorola bluetooth keyboard which works beautifully with this Samsung tab (all the keys work properly with no resetting).I am finding the 8-inch size to be perfect for me, just big enough for all the \"work\" I do (file and photo editing) and for watching videos but small enough to be very easily transportable.  It is also a perfect size for reading (eg using the Kindle app), and the tablet has a \"reading mode\" setting that is easily accessible that optimizes the screen for such apps.A few caveats - I use a Samsung Galaxy phone and so am used to the Samsung interface and am a fan of it.  I like the external buttons and I love that my phone and tablet interface so well.  Also, I have small hands so am not bothered by small buttons or form factor.  I am not a gamer so do not use my tab with those apps.I am very happy with my purchase.", "Date": "July 28, 2013"}, {"Title": "Great product but", "Author": "BW", "ReviewID": "R33ZU8RQDE6QNF", "Overall": "3.0", "Content": "If it didn't die and subject me to the worlds most ponderous support session I would give this 5 stars.Two hours of my life i won't get back wasted on worlds worst replacement process.UgghhDid I mention how horrible support process is?", "Date": "March 11, 2014"}, {"Title": "Love this device!", "Author": "Amazon Customer", "ReviewID": "R102AEBUZ9CW4W", "Overall": "5.0", "Content": "I actually sold my Kindle HDX 7inch and replaced it with this.  The other device wanted to be too many things and couldn't really do any successfully.  An iPad Mini was just way more money than I wanted to part with.  The device had good reviews so I thought I would give it a try.  It arrived quickly, set up was a breeze and it does everything I want and need in a tablet.  It also runs powerful e-reader apps for Kindle, Nook, Bookstrand and others.Worth every penny and if you're even considering getting a new tablet give this one a serious look.  Go to a brick and mortar and hold it in your hands.  Such power in a small package, even in a safety case it pops right into my handbag and I've always got my books and any other apps I need everywhere I go!", "Date": "March 6, 2014"}, {"Title": "Great small tablet, fast response, great screen quality.", "Author": "D. Fox", "ReviewID": "R531VLBGKIWTH", "Overall": "5.0", "Content": "This is a great tablet for the price, and is expandable up to 64GB additional through the micro SD slot. I have my Tab 3.0 running with a SanDisk Ultra 64GB card, and it works flawlessly. The response time on this tablet seems to be better than my Galaxy 3, also runnning with a 64GB micro SD.With the 8in screen its size is comparable to the iPad Mini. I was trying to find a decent tablet in this size without breaking the bank. A new iPad mini 64 GB is $700!! This Galaxy Tab 3 8in new was $250, a new 64 GB card was $45, giving me 80GB total memory for under $300. Not only does it have more memory available, but in my opinion, it is a better tablet. Android OS is so much more compatible when it comes to different media types and sources.I would recommend this tablet to anyone looking for a quality Android tablet comparable to the iPad Mini.", "Date": "February 6, 2014"}, {"Title": "love", "Author": "Sharon", "ReviewID": "R2OBSML6E4NRWS", "Overall": "5.0", "Content": "I love my tablet. Wouldn't trade it for the world. It goes everywhere I go. My personal assistant. Smart purchase", "Date": "February 4, 2014"}, {"Title": "Great product", "Author": "Michael S. Poppe", "ReviewID": "R16AGCNRGSKACJ", "Overall": "5.0", "Content": "A tremendous amount of research went into making this choice.  I bought a cheapie tablet a year ago to try and educate myself how they worked, and what I needed and what I didn't.  I about wore out all the cyber ink in my computer monitor going from site to site, utube to utube, getting as much information on the available Tablets.  In the end, the choice for me, was clear.  The Galaxy Tab3 8 inch was a perfect fit for my needs.It's very quick, settings and controls are easy to get to.  Movies and videos are billiant on it's display.  Love the WiFi software.  Click the wifi on, and it connects in the blink of an eye, with a strong signal.I've downloaded all the apps that I intend to use, have transferred a couple of movies, and utube videos, along with taking lots of pictures and a few videos with the camera, and I still have about half the storage space available.  I will eventually buy a sd card, but it won't be needed for some time.Google maps and Google earth work amazingly well on this device.  I've been using this tablet for about 2 months, and believe me, being retired,  I've USED it.I've found that I get a full day of heavy use out of the battery before it needs to be recharged.  (I recharge when it gets down to 30%)I'm just delighted with this tablet.  The 8 inch size is the perfect compromise as far as I'm concerned.  It's light and mobile,  and has my laptop sits idle.  The only time I've used my laptop since I bought this tablet, was to hook it up and charge it a couple of times.Trying to present a balanced review, the only \"con\" I can offer, is that the placement of the speaker on the side sometimes causes the sound to muffle because my hand is in the way.  However, that's easily fixed by simply moving the position of my hand, or using headphones.", "Date": "January 27, 2014"}, {"Title": "Love my Tab 3!", "Author": "Michelle E. Behme \"Michelle E. Behme\"", "ReviewID": "RFGNPA05V0JA7", "Overall": "5.0", "Content": "I am just going to keep this simple . . . My daughter has an iPad 3rd generation, my husband the Nexus 7, and out of the 3 of them, I think mine is the best.  It is easy to use, the 8-inch size is the perfect in between size of the 10-inch and 7-inch tablets out there.  I have had not one issue at all with the Tab 3.  I watch many shows and movies on it, I read a lot, and surf the web as well.  Battery life is great, screen picture and sound is fabulous, it is fast, the price is great, and I love it!", "Date": "January 27, 2014"}, {"Title": "I can't believe how good this is.", "Author": "Don Steinweg \"SteinDon\"", "ReviewID": "R64QA5DHHB4B5", "Overall": "5.0", "Content": "I have owned several Android tablets over the last couple of years, but I was really taken aback with this.  I can go right down the list of problems I have had with different tablets, and this tablet has solved each one of them.To begin with, standby battery is extremely good. I can leave this unplugged all night, with wi-fi off, and it will be at 99% battery in the morning.  Also, since it has 1.5 GB of RAM, you have enough room to run 20 apps at the same time.I had the original Nexus 7 and it ran great until the first Android update. Now I have to restart it once a day. Not this one.  I have several tablets and about 5% of the apps that I want will not load, saying that the app is not compatible with this device.  100% of the apps I want that won't load on other tablets will load on this one. Another thing, on the original Nexus 7 the microUSB for charging is too loose, and one cannot charge it while you are using it. Here, it is nice and snug and easy to charge while using.One nice little touch.  If you are in a field to log in with your email address, it can remember email addresses (plural) and suggest them, so you don't have to enter the whole thing.10 inch tablets are too big for me, but this handles as well as a 7 inch tablet but with extra screen space.The only thing I wish was different was the traditional Samsung launcher displays apps in chronilogical order.  I simply use an alternate launcher to solve that problem and to get them in alpha order.I really think this tablet is great. 5 stars does not do it justice.", "Date": "December 18, 2013"}, {"Title": "Great size, features and price. See update 12/1/2013", "Author": "lucy jack", "ReviewID": "R1RVTH3ZMX4AI8", "Overall": "4.0", "Content": "This tablet is exactly what I was looking for, in size, ease of use, clarity, features, and speed. It was almost overwhelming, trying to decide which tablet to buy. The deciding factor for me was that I already use a Samsung Galaxy S4 phone, and this tablet is very similar to the phone. The buttons, icons, menu, and apps were all very familiar, so it was very easy to learn how to use the tablet. I love how simple and quick it is to accomplish tasks that you adjust and readjust often, such as WiFi, Bluetooth, SafeStay, or Airplane Mode). Like the Galaxy S4, it has some extra features that are just for show. I mean, it's almost annoying to have a tablet or phone that reacts to where you move your eyes. And the tablet's \"virtual assistant\" (substitute Siri) is fun to experiment with, but it's faster and easier to just get the jobs done yourself, using the internet or the phone's features. Voice recognition and mind reading still have a long way to go. Size-wise, the 8-inch format is perfect. That extra inch makes a world of difference, but doesn't make the tablet unwieldy. Battery life is decent, recharging is fast. Watching movies and TV is fun (note: to watch Amazon videos, download Maxthon Browser), and the sound quality is fine. Downloading pdf files is occasionally slow, but it gets the job done.  Last thing:  If you're a student, think about getting the Samsung Galaxy Note. It's more expensive, but seems like a great tablet for using in class.Update 12/1/2013:  I've dropped my review from 5-stars to 4 because it seems that a common problem with the Tab 3 is that the battery fails to charge and you have to jump through a few hoops to solve the problem. When I noticed that charging my tablet overnight only got me a 42% charge, I went online to find out why. First suggestion was to \"restart\" it by unplugging it, holding the power button for 30 seconds, and then plugging it back in. This worked and I got a 100% charge in a couple of hours. But I'm worried it seems to be losing its charge faster than it has in the past. Over the past few months that I've had it, it would stay charged overnight. Now, it seems to be draining the battery while it sits, in resting mode. If this continues, my next step is to call Samsung tech support, and then possibly send it back to them for them to look at and hopefully fix. It's still under its 12-month limited warranty, so I'll see how it goes and get back with updates later.", "Date": "November 26, 2013"}, {"Title": "Lots of Bang for the Buck", "Author": "R. T. Shafer \"Ofra Haza Fan\"", "ReviewID": "R2PBHYKKQ31B5W", "Overall": "5.0", "Content": "Fast. Simple to use. More RAM than the 10\" or the 7\" Tab 3. Really nice that it updates itself, no messing with Itunes or update buttons. 64GB in the Micro-SD slot how nice is that!!  Now I can carry huge numbers of books, movies, music with me.Size is perfect for carry around and still easy to see.", "Date": "November 14, 2013"}, {"Title": "Awesome - Awesome - Awesome", "Author": "Pauline Piggott", "ReviewID": "R3VTHXF4IHYXPF", "Overall": "5.0", "Content": "This one I was thinking about the 10. inch but then I change my mind because I wanted something neater.  So I decided on the 8.inch.  Have not regret it.  Beautiful.  It's always with me where ever I go. Would advice if you don't want the bigger and wants something smaller, this is the buy.", "Date": "November 11, 2013"}, {"Title": "Great in the beginning", "Author": "Lewis C. Johnson", "ReviewID": "R24MUR2UIGS4Z6", "Overall": "3.0", "Content": "I liked just about everything about this tablet, size, screen resolution the familiar android experience however after six days owning my first galaxy tab 3 I noticed that the wifi would cut in and out until finally it wouldn't connect at all. I thought it would clear up after a while. It didn't, after two days of not connecting to wifi I returned it and got another. The second performed correctly out the box, but 5 hours later dropped wifi giving the error message (AUTHENTIFICATION ERROR OCCURRED). The funny thing is none of the other equipment connected via wifi was affected. I was able to log onto the internet without issue with both my laptops. Of course I googled the error message and found that a number of people had the same issue and no forthcoming solutions from Android or Samsung. I tried all of the routine checks, restarting the router, checking the settings on the tab itself nothing worked. Unfortunately I will be returning my second tab 3. As I write this I noticed my galaxy s3 has the wifi issue. I never noticed before, I guess because I can still surf the net via the sprint network. The forums online are clear that this is not an isolated thing but a real credible issue. I hope android or Samsung find a fix because I so want to keep the galaxy tab 3.", "Date": "September 16, 2013"}, {"Title": "The right size!", "Author": "H", "ReviewID": "RHG2JO7U965RB", "Overall": "5.0", "Content": "Received very quickly and it had about 70% power which was nice because you could check it out right out of the box.  I purchased the Gold-Brown because we will watch movies and the white is distracting.  The size is perfect.  It's the right size for holding and reading plus so much more.  It takes great pictures - I'm not picky - so for me the clarity is a plus!  Decided to wait for this as I wanted to pay for something that I could get the most out of.  You can an add more storage and search anything and view anything which Apple Mini-Ipad cannot do because of their restrictions - adobe, java, and other limitations.  Rated it a five for my needs.  I love how seamless it is and how I can customize what I what on the screen.  I love the Samsung keyboard which has all the numbers and letters on the screen.  Haven't watched a video yet but will update this when I get around to it.  The brown is a nice color and doesn't interfere at all with the screen.", "Date": "July 17, 2013"}, {"Title": "It has done everything I expected", "Author": "Roger Quitter", "ReviewID": "R24X1H95DM6YPB", "Overall": "5.0", "Content": "This tab has done everything I expected.  It has run all my apps and navigates the internet fast and efficiently.  I have also been pleased with battery life.  I also love the 8\" size; my last pad was 10.5 and I found it to be too big and to heavy.  The 8 inch screen is small enough to be continent but large enough to be readable.", "Date": "July 31, 2013"}, {"Title": "Galaxy Tab 3 8\"", "Author": "Jack", "ReviewID": "R280X02CPJ5AFU", "Overall": "5.0", "Content": "Absolutely love this tablet. 8\" size makes a big difference in viewing over the 7\" sizes. Android system is great and offers all the best Apps. Liked it so much that my wife got one too and sold her Kindle Fire HD. This tablet is great for relaxing in an easy chair and reading latest news and sending / receiving all my emails, surfing the Web, and all the Apps. I highly recommend this tablet. Also bought the \"Supcase\" for a cover and it fits perfectly and works well.", "Date": "February 4, 2014"}, {"Title": "Great tablet.  Be care of your choices in accessories.", "Author": "Andrew J. Kearney", "ReviewID": "RZHJDFJWFR29A", "Overall": "5.0", "Content": "Excellent tablet.  But, pick your accessories carefully.  I usually go with what Amazon suggests but got burned on their pick for a case for this tablet.  You want something that fits tight and protects the tablet.  The case they suggest did not meet that standard.", "Date": "November 19, 2013"}, {"Title": "Good but not Great", "Author": "PenName25", "ReviewID": "R7THNDF3IKY2V", "Overall": "4.0", "Content": "Overall, this is a good product and is definitely at the higher end of the tablet spectrum. However, there are a few questionable aspects to this tablet and you definitely pay the premium for one extra inch of screen. I got this because I did want the 8 inch screen and prefer android over apple. But I feel this is overpriced for the following reasons: you pay $100 extra for the 1 extra inch of screen, a first generation ipad mini starts at the same price, and the processor is dual and not quad like any other higher end tablets now. My biggest complaint is that Samsung still uses the cheap slippery plastic backing. This product is nice and thin which I like, but the extra width that the 8 inch screen causes mixed with the slippery back makes it a necessity to buy a case just so you have something to grip onto. This is still the nicest tablet I have had and I definitely like it, but I would only recommend it to people that strongly prefer android over apple and people that really want that 8 inch screen. Otherwise, there are definitely more cost effective alternatives. This is another classic Samsung product move designed to eat into Apple's sales so it will not likely blow you away so to say.Pros: nice 8 inch screen, thin and light for the size, a few nice apps that allow you to multi-task, use as remote control, etc., less than average bloatwareCons: very slippery and can be awkward to hold, price seems high when compared to other products", "Date": "November 13, 2013"}, {"Title": "fantastic!", "Author": "lily", "ReviewID": "RNEFCEQWB6CV1", "Overall": "5.0", "Content": "I bought the galaxy tab 3 8\" tablet a few days ago.  I own the galaxy tab 2 8.9\" and 10.1\", love them both.  When I saw that the tab 3 had an 8\" out I read reviews about it and when I saw how happy others are with it I decided to order it.  I am thrilled with it!  The 8\" size is very nice, it is lightning fast, the screen is crystal clear and the myriad of upgrades make it the best tablet I have ever used.  I am not that tech savy, I can only say that it is so easy and fun to use.  The price is a bit high, but after actually seeing it in person and using it for awhile it is worth every penny.  I think the Samsung tablets are far superior to the Apple ipads.  I am very happy with with it and would say to anyone thinking of purchasing this tablet to go for it, you won't be disappointed.  As usual Amazon was great, shipping was free and it arrived within just a few days!! Enjoy!", "Date": "July 26, 2013"}, {"Title": "Finally, the perfect size.", "Author": "P. Firth", "ReviewID": "R1XD50CGFRJZFE", "Overall": "5.0", "Content": "I have an iPad 4, TRIED the Kindle Fire HD 7-inch, and have owned at least 6 Kindle and other readers. For me, the iPad is just too heavy to use comfortably. It is tiring and annoying in any position. Check the specs -- this 8.0 is actually LIGHTER than the Kindle Fire HD 7-inch. The Kindle HD has better sound, but I wouldn't use either device for anything that needs audio without earbuds. It is the perfect size and weight for a personal device. I was really surprised how much difference the 8-inch screen makes over the 7-inch. I can use the browser(s) comfortably, where the 7-inch was almost unreadable. Note that the aspect ratio is wider than the iPad, so you're getting a much more usable screen for many purposes, especially browsing and watching videos. Most of the screen of the iPad (at least my 8.9 inch) is completely wasted for movies - large black bars above and below. NOTE: If you want to download movies, Google Play ONLY lets you store them on the device, which is pretty nearly useless since there are only about 9 or 10 GB left out of 16 GB. I immediately added a 64 GB Class 10 SDHC card, but Google and Samsung don't use it. The ONLY movie service I've found that downloads movies or TV to SD is VUDU. I highly recommend it, unless anyone can suggest an alternative.I was concerned that this device might be slower than the Kindle Fire HD or the Galaxy Note 8.0, but I cannot see any lag, and surfing seems very good and plenty fast. I'm getting over 20 MBPS download speeds using the GIST test tool and FIOS. Unless you specifically need the drawing features of the Note, I think you'll be pleased with the Tab 3 8-inch.One criticism: I found that the AUTO brightness default on the Tab 3 8.0 was FAR too dim for indoor use, and I was adjusting manually instead. Download LUX Free, and you can change those characteristics. For me, I added two \"links\" with LUX: 1 lux=25% bright and 400 lux=80% bright  It now works perfectly.", "Date": "July 19, 2013"}, {"Title": "Awesome tablet", "Author": "Jeff D. Hagan", "ReviewID": "R360446YO34ACZ", "Overall": "5.0", "Content": "Love this Galaxy Tab 3 8 inch tablet. It has a great, bright screen and is fairly snappy. It does sometimes have a lag compared to my Note 3. Functionality with other Samsung Galaxy products is a huge benefit. The S-Beam and Music / Photo share is especially useful. The battery life is good overall, but screen brightness has a huge effect on longevity. 8 inch is a perfect size. Easy to handle, but noticeable difference over 7\" options. Came from a Blackberry Playbook. There is no comparison!", "Date": "March 12, 2014"}, {"Title": "LOVE IT!!", "Author": "Jessie S.", "ReviewID": "RST7QJAVA6W70", "Overall": "5.0", "Content": "I got this as a birthday present and I absolutely LOVE it! It's very easy to figure out & use, not to mention the battery life on it is outstanding! No matter what I am doing on it, whether its looking online, watching videos or playing games the battery does phenomenal! So far I am very very pleased with this particular brand & product, I would recommend this tablet to anyone.", "Date": "March 11, 2014"}, {"Title": "Great tablet!", "Author": "Danielle", "ReviewID": "R14EB183PNYDBC", "Overall": "5.0", "Content": "I love this thing! :)It does everything I have asked it to do so far. Music sounds great, screen is nice and clear, fast even when I have several tabs open. Im still exploring allll the features, but so far I have not been disappointed.the only tiny problem I have is that sometimes it takes several 'pokes' at the screen to register that I touched it, this doesnt happen alot, but enough that I get very mildly annoyed when it does... I wipe the screen (even if it doesnt look dirty) and usually that sorts it out.besides that I love it... very happy with my Samsung Galaxy Tab 3 8\"", "Date": "March 13, 2014"}, {"Title": "Nice", "Author": "Lisa Wang", "ReviewID": "R1KMTNFEZCL1TR", "Overall": "4.0", "Content": "Very light, the screen is clear, need to be careful to protect the screen, need to by a case for it.", "Date": "March 12, 2014"}, {"Title": "nice tablet. great price", "Author": "M. Aburto \"bookworm\"", "ReviewID": "R2NZUV1DIX6J6N", "Overall": "5.0", "Content": "This is one of the best tablets Samsung created. Long lasting battery, big memory capacity. fast processor. Screen is significantly bigger than the 7 inches. light weight. it looks just like a giant phone. I could buy a Kindle Fire HD for the same money but this tablet is way more versatile. I am glad I listen my son's recommendations.", "Date": "March 11, 2014"}, {"Title": "Just the right size!!", "Author": "Nancy Powell", "ReviewID": "RS8HP3NNYZ477", "Overall": "4.0", "Content": "Love the size of this tablet. It fits perfectly in my purse without a big bulge from the outside. I use it often since I gave up using my PC for the convrnience of a tablet. My Samsung fits the bill for most of my computer needs. I hope they will update to a white screen to make e-books more enjoyable to read. That's the only thing Kindle has on this tablet.", "Date": "March 11, 2014"}, {"Title": "excellent", "Author": "Alban Mucolli", "ReviewID": "R300RRI2RPI7TL", "Overall": "4.0", "Content": "just as I expected, it easy to use and it big enough and has superb screen and features that I need", "Date": "March 11, 2014"}, {"Title": "Love this tablet!", "Author": "Roger Leek", "ReviewID": "R1IRQYKG3QDF98", "Overall": "5.0", "Content": "The screen is just the right size.  The hardware is mean, the software is familiar (because I have a Samsung phone) and overall it is a beautiful device.  Not too heavy.  Very thin.  Screen resolution is excellent.  The \"auto\" screen brightness is too low for my taste, so I have it set just under half brightness.  With this setting I get around 6 hours of non-stop use.  Bought the Samsung cover too, which I love.  If these tablets ever go on clearance I will buy a couple more.", "Date": "March 11, 2014"}, {"Title": "Great product", "Author": "Erin Rooney", "ReviewID": "RMLZCF96MGR7R", "Overall": "4.0", "Content": "My laptop died and I didn't want another laptop. I wanted something I could sit on the couch and play a game on, or read a book, or check my email. It's perfect for that. I don't know if I went about charging incorrectly, but the battery, after a couple of weeks went from a solid 12 hours a day to maybe 4. Not sure what the fix is for this, if any. I just have to plug it in if I'm going to be watching something on netflix or playing an app/game. I chose the Galaxy Tab because of the option of inserting a memory card in the side if you need more storage too.", "Date": "March 4, 2014"}, {"Title": "Loving it so far", "Author": "Amazon Customer", "ReviewID": "R8IWI8YAE1BUS", "Overall": "4.0", "Content": "I'm an android user, and have wanted an android tablet for a while. I've enjoyed the Tab 3 so far.Buttons on the bottom could be better placed, and it's a little touchy, but overall, a great product.", "Date": "March 3, 2014"}, {"Title": "Galaxy Tab 8\"", "Author": "Ronald", "ReviewID": "R22J8HPW6G14R9", "Overall": "4.0", "Content": "Great Tablet except no FlashPlayer App.Lengthy process to download it and install so I can watch posted videos on FB.", "Date": "February 22, 2014"}, {"Title": "I Love This Tab", "Author": "D. Jett", "ReviewID": "R36LO2MWQ69T6B", "Overall": "5.0", "Content": "I love the mini tabs. A 10 inch tab is a bit too big for my tastes at this point (maybe in the future). I decided I wanted to try out this 8 inch tab and I have not been disappointed. The extra screen size is great for those in my boat that like the mini tabs but also want a little larger screen than the 7 inch minis. I don't play a lot of games, so I can't say much about the screen resolution vs the high resolution Google's Nexus promotes, but from what little games I have played on it and videos watched, the resolution seems to be great.", "Date": "February 21, 2014"}, {"Title": "I really like this tablet", "Author": "Mel White", "ReviewID": "R2TCQ57IG704KU", "Overall": "5.0", "Content": "I had an Asus tablet that I liked, but I had to return it when it simply stopped working after a few days. This one does what I want it to do and shares apps and other things seamlessly with my Samsung phone. The screen looks great and it's plenty fast enough for me. I would never buy a tablet that didn't have the ability to accept a memory card.", "Date": "February 15, 2014"}, {"Title": "A very good tablet for the price", "Author": "Patricia A. Kline", "ReviewID": "R1TZZN0N0BXV4M", "Overall": "4.0", "Content": "It's a very, very good tablet. I like the size and the features, but for some of us older people it can be very confusing.  I would recommend  it to anyone. Just because I have to have time to figure it out doesn't mean not to buy it.", "Date": "February 11, 2014"}, {"Title": "Great tablet!", "Author": "David", "ReviewID": "R386Z1QS0AE0RS", "Overall": "5.0", "Content": "I enjoy the Samsung products, and this one is no exception.  Snappy responses, runs all my Android apps, works like a charm.", "Date": "February 11, 2014"}, {"Title": "TAB 3", "Author": "MPMcK", "ReviewID": "RSBM5WQ4G6688", "Overall": "4.0", "Content": "A few of these seems to have a screen tracking capacitance issue-my first one was not sensitive at all to screen taps, selections, and tapping. The screen sensitivity is NOT adjustable, so I had to return it--the second one works as expected and is a very nice product indeed. It'll blow away an ipad if not just for the built in IR blaster--which makes it the best home entertainment remote on the market, once you find the app you want to use. Thinking of buying a HARMONY remote for more money? Forgetaboutit...this thing will rock circles around a harmony, hands down. Plus it does surfing, emails, and the dishes.", "Date": "February 10, 2014"}, {"Title": "Samsung Galaxy Tab 3", "Author": "Marion Moore", "ReviewID": "RWJX7JSVICF22", "Overall": "5.0", "Content": "It is larger enough to read easily but light enough to transport and even put into a handbag.  Ideal for elderly.", "Date": "February 9, 2014"}, {"Title": "Went with my gut", "Author": "Micqualani T.", "ReviewID": "R7TVUQYLHA1IU", "Overall": "5.0", "Content": "Heard so many bad things about it had to see for myself, I love it. I dont like to customize so this works. Went to Besy Buy and fell in love with this tablet. This was sitting right by the nexus 7 ewww its ugly to me. This tab is a beauty.  It does everything I need it to do, read, surf, and play games.  So glad I went eith my own feelings.  Dont regret my purchase at all.", "Date": "February 5, 2014"}, {"Title": "Best purchase ever", "Author": "Logan Shayna", "ReviewID": "RVB9CZCX4VLYY", "Overall": "5.0", "Content": "I love this tablet I use it over my laptop I never use my laptop I can take it to school and Use it too take notes and I love how small it is and how cheap it was compared to the ipad by apple. It was everything I thought it would be. Samsung always makes amazing products. This one is the best", "Date": "February 5, 2014"}, {"Title": "Great product for the everyday user.", "Author": "Theresa Goebel", "ReviewID": "R2HHRYAEAFSMMB", "Overall": "5.0", "Content": "I would recommend the Samsung Galaxy Tab 3 to anyone who is looking for a relatively inexpensive tablet. After using this one, I think I would  have liked the bigger size better. Having said that, the smaller size does everything I need it to do.", "Date": "February 3, 2014"}, {"Title": "Great quality tablet", "Author": "D. Morris \"DM\"", "ReviewID": "R1E9SURI643GPO", "Overall": "5.0", "Content": "This tablet is awesome. It's just the right size. I have an iPad, but find it too big. This tablet is much easier to use and more intuitive and easier to navigate. I highly recommend this to anyone that's looking to give it as a gift. It will be a hit!", "Date": "February 2, 2014"}, {"Title": "Nifty", "Author": "Aaron \"Shakes\"", "ReviewID": "R1WEBN11I7MW2S", "Overall": "5.0", "Content": "Size is good; fits in one hand.  Screen is really clear and bright.  All of the buttons work and it turns on, so that's what it is supposed to do. It's fast with the home wifi.", "Date": "February 2, 2014"}, {"Title": "perfect", "Author": "Kimberly", "ReviewID": "RXUJSUTDD802B", "Overall": "5.0", "Content": "I couldn't be happier. I was about to go the \"cheap\" route and get a Google dragon touch but my husband insisted that I loosen up and get what I deserve he couldn't have been more right! My old Tablet reminded me of an oversized cell phone with absolutely no battery life. But this Tablet is just like a computer and the battery life is amazing the memory is great and the size is just perfect for me I love it", "Date": "December 15, 2013"}, {"Title": "Very nice tablet.", "Author": "Scott59mhd", "ReviewID": "R2J2P680SEJM46", "Overall": "4.0", "Content": "I've had it for a month and like it a lot, especially the size.  I use it mostly to read email or surf the web. I bought it primarily for travel so I can leave my laptop home. The touch screen isnt quite as sensitive as my iphone4s but I'm getting used to it.  This is my first tablet and android device.  Set up was easy. I haven't had any problems with it", "Date": "December 7, 2013"}, {"Title": "FROM ECUADOR", "Author": "Anna", "ReviewID": "R18XZ0U9G42TSU", "Overall": "5.0", "Content": "excellent product. comprehensive tablet, compact, fast and very good design in view, excellent touch. in my family we only use galaxy tab. I use it to watch movies on the Internet, download files, view magazines, leers books, emails etc..in other words is a great tablet, highly recommend it is very easy to use.", "Date": "November 26, 2013"}, {"Title": "Love It!", "Author": "Amazon Customer", "ReviewID": "R39Y1JJRU08K6P", "Overall": "5.0", "Content": "I love my tablet! I am now able to read  books again. I love that you can adjust the font and having the light in the back of it make it so much easier. Easy to take with you too!", "Date": "November 16, 2013"}, {"Title": "Great Device", "Author": "B. Thornton \"Gum-shoe\"", "ReviewID": "R2NUV1UDO1EZH4", "Overall": "5.0", "Content": "Use it everyday.  I have an iPad 2, a Nook HD+ and this device is easily my 1st choice.  What makes it great is the added ability to have 64gb of expanded memory.  Have tons of movies and books at my beckon call w/o having to depend totally on a wifi connection. Fast processor to play all the games.  I almost got sucked into the abyss of spec warfare.  The Tab 3 is not about having the greatest physical specs. It is about usability and expandable content. After using the Tab 3 for more than a month I am extremely happy with the purchase.  BTW the remote control blaster makes this device a treat watching TV and jumping around for us channel surfers...", "Date": "November 13, 2013"}, {"Title": "Really happy with this one, after giving Tab 2 10\" away", "Author": "C. Wang \"C\"", "ReviewID": "R158DL6FUQ1UDY", "Overall": "5.0", "Content": "No, this is neither the fastest, nor with the most bells and whistles, but it is more than adequate for all general applications. I had just purchased Tab 2 10\" a few months ago and was so bothered by the terrible lag that I gave it away...  This one works much better and although not quite up to task like the Note 2 (which I have had for a year), I have not experienced any lag or other technical issues.  All apps load smoothly and quite quickly, even in split screen mode. The form factor is PERFECT!  Perfect size, weight, thiness, bezel, screen,  lay out of buttons,  physical home key, etc.  It is like a larger Note phablet!  I REALLY, REALLY, REALLY like this 8 incher!  Highly, highly recommended!", "Date": "September 19, 2013"}, {"Title": "Awesome Tablet", "Author": "mar roble", "ReviewID": "RQA6EJT7O8HXI", "Overall": "5.0", "Content": "I had a 7-inch Galaxy S tablet and I liked it.  I have not upgraded to the second generation as I kept my old beloved tablet.  I then purchased third generation and upgraded to the 8-inch tablet and I loved it since opening the package.  I have seen the 10.1 in local stores and it seemed larger to be carrying around as I will be doing more reading, writing and applications instead of just videos or movies.  You still can do pretty much everything on that larger screen as well and even better on videos by the bed side if that is what you are interested for using the product.The tablet is leakier and thinner than first generation.  It is very fast and execute multiple tasks with ease.  I am amazed with it actually.  And for the price, can you say,\"What an awesome deal?\"  Yes, I know it is $300.00 for the 8-inch even in local stores but that is a steal for the quality and performance of this epic machine.  I gave 5/5 because it really deserves it.I will recommend this product to everyone and anyone who maybe interested for owning or using a tablet.", "Date": "September 12, 2013"}, {"Title": "Love the 8 inch tablet", "Author": "ocean", "ReviewID": "R3A60PAGO3PDLF", "Overall": "5.0", "Content": "7 inch tablets are great for portability being close to the size of a paperback book.  10 inch tablets give more screen space though.  The 8 inch tablet is a great combination of both advantages.  It is easy to carry anywhere but has a larger screen.  Love it !", "Date": "August 21, 2013"}, {"Title": "Can't be beat for the price", "Author": "Kim Faulkner", "ReviewID": "R1K3LOLVLSC4CF", "Overall": "5.0", "Content": "We have had an Ipad 2 for almost two years and I have become fed up with Apple's approach to locking down the operating system. I decided to go with Android. I looked at all of the Android tablets and kept coming back to Samsung.I initially bought a Galaxy Tab 3 7 inch. The first one had defective home button so I exchanged it. I used the GT3-7 for a few days and wasn't satisfied. I found it to be sluggish and the screen was just too small. The next week,  the 8 inch GT3 went on sale at a local big box store for $70 off the list price,  just $30 more than the 7 inch. So I traded the 7 for an 8. What a difference! Better operating system, better screen,  faster processor,  etc.The GT3-8 is very fast, smooth and easy to use.  Web browsing is very pleasant because the screen is so crisp. I find that I can read many websites without my glasses, when I need the glasses to read the same sites on the Ipad 2.One factor that makes this a winner over the ipad is the SD expansion slot.  I don’t know why Apple thinks 16 gb is all anyone will need in an affordable tablet. And they want to charge you an extra $100 for every additional 16 gb. I added 16 gb to my GT3 for $15. If I need more, I can easily add 64 GB for less than $100.The IR blaster was an unexpected bonus. We use the Smart Remote app and it has pretty much replaced our old remotes, plus finding shows is so much easier using this app than the cruide guides provided by cable systems.Battery life is at least as good with this tablet as it is with the ipad. I can get more than 8 hours of heavy use with no problems.I am now an Android convert.  I have used PCs for 25 years and I like to have the ability to move files, etc. using an explorer. Again, Apple seems to think I should not be able to look under the hood of my device,  while Android opens it up for anyone who wants it. Moving files from a PC to this device is as easy as connecting the usb cable and away you go.I am also finding the predictive keyboard to be a time saver. It seems to learn your writing style and improves over time.  I am much faster on this tablet than on the Ipad. No doubt you can get better keyboard apps for the ipad,  but this feature was built in with the GT3.The Google play store has everything I need. I downloaded Kingsoft Office as I find it better than Polaris,  which shipped on the GT3. This tablet is very easy to use for reading work documents,  pdfs, etc.The only downsides I've found with this tablet are- the capacitive back and menu keys are easy to touch accidentally,  but you get used to working around them. And I’ve found that having the back key always under your thumb is actually very convenient most of the time.- there isn't much of a selection of cases for the GT3-8. If you have an Ipad,  there are hundreds,  but only a few for this unit.  That's not a fault of Samsung,  but it is a downside.The upsides are many,  a few of which I have listed above. But the bottom line is that this is the best tablet I have found for the money.  It looks great, works fantastic and seems to be built to last.  If you are looking for a tablet in this size range,  don't waste your money on the Ipad mini.  Buy the GT3-8. You won't regret it.", "Date": "January 26, 2014"}, {"Title": "Light, small, fast, awesome", "Author": "S. Larsen \"Occasional Gamer\"", "ReviewID": "R12KCL8MTUUZ1Y", "Overall": "5.0", "Content": "I purchased one of these after stepping on and cracking my Galaxy Note 8.0, as the Tab was a cheaper replacement.  While the processor is dual instead of quad, I have not noticed a difference in speed.The device is super light and sleek and I love it more than the Note 8.0! Ive put in a 64 mb SD and have plenty of storage. Download the Double Twist app and you can sync your iTunes music and play lists without a problem!In closing, I love it more than my iPad and more than the Note 8.0.", "Date": "December 9, 2013"}, {"Title": "Just the right size", "Author": "rowen88", "ReviewID": "R1LRPYLROEX5XB", "Overall": "5.0", "Content": "My new Samsung Galaxy Tab 3 8\" in the perfect size.  Not too big and not too small.  It fits in my side cargo pockets easily and I whip it out and take photos and videos quickly.  The quality of the photos are very good.  The internet works well on this device.  I'm very happy with this product.", "Date": "March 4, 2014"}, {"Title": "i like it", "Author": "Miguel Ochoa", "ReviewID": "R1W785WE26FWG2", "Overall": "4.0", "Content": "it was really good and secure purchase came pretty fast, I recommend them as they are responsible for sending without any doubt and if it was so requests, the colors are tastefully designed also bring your charger and slot for memory expansion, which some of similar characteristics not bring ..", "Date": "March 3, 2014"}, {"Title": "love love love it.", "Author": "sas davis", "ReviewID": "R1UKXF3JAE28IX", "Overall": "5.0", "Content": "Still learning all the great tricks of this tablet.  Very happy with the value and quality.  Should have opted for wi-fi.", "Date": "March 1, 2014"}, {"Title": "love it", "Author": "Colleen Arnier \"BorderBoardz\"", "ReviewID": "R34V1VWRSIDAMG", "Overall": "5.0", "Content": "I've had this since October 2013.  I absolutely love it and being an Apple product person it is so completely different.  I'm still learning the ins and outs and am it just takes using it to discover the capabilities.  I like myiPhone but didn't want an iPad so I went with something completely different.  And different it is.  It takes awesome pictures!", "Date": "February 26, 2014"}, {"Title": "Fun, Confusing and Battery Life Short", "Author": "Clarice", "ReviewID": "R21PWDC9P8IWCZ", "Overall": "4.0", "Content": "This tablet is just for fun nothing serious. Games, puzzles, websites, searching...not a heavy user. It is a bit confusing navigating through the different functions. I have to watch Utube to find out how to do general things. I find it a bit slow though, it came out in 2013 so I am not sure why it loads apps and webpages slower than the Kindle fire, iph5, Toshiba laptop, newer Mini. I was thinking to return it because of the speed but I've gotten use to it and I rarely use it. The battery life is short. If playing a game or searching thru sites it drains the battery quickly. Overall I like it and I know I won't use it often but family members will. Worth the money? nah more like $150 price", "Date": "February 26, 2014"}, {"Title": "Amazing!", "Author": "Jacqueline B.", "ReviewID": "R2HTPMIOH1MMZ2", "Overall": "5.0", "Content": "Don't even bother with any other tablet!  Nextbook sucks and Asus is overpriced!  This tablet is amazing for games and really anything you want to do on it!", "Date": "February 23, 2014"}, {"Title": "Excelent tablet", "Author": "jorgitodejesus", "ReviewID": "R1ESUEU2V24AM3", "Overall": "5.0", "Content": "Samsung was generous when designed and worked the features that I needFast application response, fast power up, long battery lifeRecommended to someone that wants a general purpose tablet at a affordable price", "Date": "February 23, 2014"}, {"Title": "Good tablet", "Author": "kj1313", "ReviewID": "RKES9JOJ8HRPG", "Overall": "4.0", "Content": "No problem, but I did send it back because I wanted a larger tablet. I ended up purchasing the Samsung Galaxy Tab 3 (10-inch, White.)", "Date": "February 19, 2014"}, {"Title": "Love my Galaxy Tab 3", "Author": "E. Karch", "ReviewID": "R1HKJQPTFNVI1A", "Overall": "5.0", "Content": "It took me a long long time to decide to let go of my baby laptop computer and migrate to a tablet.  But I'm so glad I did.  I really like my Samsung s4 phone and am not a fan of Apple (yet I do have an old iPod ... as a gift!).  I would recommend the Galaxy Tab to anyone who is looking for a fun, easy and small mini computer.", "Date": "February 18, 2014"}, {"Title": "Samsung Galaxy Tab 3 (8-inch, white", "Author": "yvonne ibarra", "ReviewID": "R1XCG3VNBPOGR5", "Overall": "4.0", "Content": "I like the Samsung Galaxy  I'm still learning  about the different programs it has the only thing. I don't like the battery die in 30min so I have to recharge it  all the time . Its just the right size for me", "Date": "February 17, 2014"}, {"Title": "works great", "Author": "robert", "ReviewID": "R29HX7FF5PID29", "Overall": "4.0", "Content": "great size, easier to use than a smaller tablet or smart phone yet small enough to easily carry.  Has basically replaced my \"netbook\" 10\" laptop for travel", "Date": "February 17, 2014"}, {"Title": "perfect size.", "Author": "Donna H. Noble", "ReviewID": "RBQOAF2KK4B7S", "Overall": "5.0", "Content": "I am rating this from the point of view of why I bought it. I have a larger tablet but wanted  one light weight and small enough for almost any handbag.  All the features are there and the 8\" is easy for reading for a long period of time. Also, it is easy to hold with one hand. I really like it", "Date": "February 14, 2014"}, {"Title": "5 Star rating..", "Author": "Calvin Byrd", "ReviewID": "R13I1Z5YZ2Z8P6", "Overall": "5.0", "Content": "I love this Samsung Galaxy.. One thing, I am kinda disappointed that it does not have flasher or vibrant when someone text me. My mother in law have a 10.1 Samsung Galaxy and it has vibrant and flasher. Thanks...", "Date": "February 11, 2014"}, {"Title": "My Husband is Turning into a tekkie", "Author": "Monica Garner", "ReviewID": "R1ZUF997GYZ5HX", "Overall": "5.0", "Content": "Best Christmas gift I could have gotten. The Samsung Galaxy Tab 3 is very easy to use my Husband even controls our Samsung tv with it.", "Date": "February 9, 2014"}, {"Title": "Tab 3 8.0 is perfect!", "Author": "A Shopper", "ReviewID": "RLP57DW75IC0Z", "Overall": "5.0", "Content": "Fits great in my hand, yet big enough to read and type with ease.  Great clarity, great video.  YES, you want this tablet.", "Date": "February 9, 2014"}, {"Title": "Good tablet", "Author": "Mark Davis", "ReviewID": "R2VEYYHOAK790B", "Overall": "5.0", "Content": "Like the tablet unfortunately also purchased an ill fitting case from Amazon. But happy with the tablet itself. I use it on a daily basis.", "Date": "February 6, 2014"}, {"Title": "lyv it", "Author": "Amazon Customer", "ReviewID": "R1Y89UANK26E5W", "Overall": "5.0", "Content": "Loved it so much I ordered thd 10inch! Arrived safe intact abd ontime. No complaints thus far. Easy set up anc sync, wish I'd gone android sooner lol", "Date": "February 6, 2014"}, {"Title": "Yayyyy!", "Author": "isis", "ReviewID": "R15NRJLYNEG8MU", "Overall": "5.0", "Content": "This tablet is too awesome! It's small and easy to use, very lightweight yet durable, and super cute. Excellent product", "Date": "February 6, 2014"}, {"Title": "Galaxy Tab 3 - 8 inch, white", "Author": "Amazon Customer", "ReviewID": "R2G9MYWRMUEP2Q", "Overall": "5.0", "Content": "Even though this is almost identical to my Galaxy S3 phone, it is an awesome little tablet that does so much! I upgraded from the original Tab - 8.9 inch to this and I am very impressed with how different (updated) yet similar (user friendly) it is. Samsung is, in my opinion, the best mobile manufacturer in the world.", "Date": "February 6, 2014"}, {"Title": "Awesome device", "Author": "Marvin Jones", "ReviewID": "R3CSDXJFS6MP5Z", "Overall": "5.0", "Content": "We bought this a few months ago and it has fully met our expectation in terms of size, weight etc. All the other Tech specific features are what they're stated. work's great!", "Date": "February 1, 2014"}, {"Title": "Great tablet for te money.", "Author": "K. Fengler", "ReviewID": "R4BDZ3JN9GQWX", "Overall": "5.0", "Content": "Does what I want it to do. It's an addition to my Galaxy S4 and together they work well and makes what I us them for easier. The price was the best I've found.", "Date": "January 19, 2014"}, {"Title": "Great Tablet", "Author": "victoria Xochilt Guevara", "ReviewID": "RQKTBEUP4HZ0L", "Overall": "5.0", "Content": "It is comfortable to use and really fast. All task are greatly done and it is easy to go from one app to another.", "Date": "January 19, 2014"}, {"Title": "Samsung Galaxy Tab 3 8\"", "Author": "John Clayman", "ReviewID": "R22APD58FYONWO", "Overall": "5.0", "Content": "I had a Samsung Galaxy Tab 10.1 - version one.  It was good and lasted well; however I wanted a new one before it stopped working so I traded it in and bought this Tab 3 8\".  Faster.  Great screen.  Small and fits in one hand well.", "Date": "January 18, 2014"}, {"Title": "LOVE it!", "Author": "R. Sullivan \"Gina\"", "ReviewID": "R1PXMSOUDLU7JO", "Overall": "5.0", "Content": "I thought the 8 inch screen might be too small, but didn't want to lug around a big screen model.  The size is perfect!  Fast and easy for any Android user.  Easy access to settings with pull down menu, easy to pair with bluetooth devices, easy to connect to my Android phone that I use for mobile hotspot, and the Google speak works very well and rarely has trouble deciphering what I am saying.  I'd recommend only the Samsung official cover though, available at Samsung.com.", "Date": "January 18, 2014"}, {"Title": "13 year old is loving it!", "Author": "Pegster59070", "ReviewID": "RNDU2XEWBMWMO", "Overall": "4.0", "Content": "My 13 year old loves her new Tab 3!  This was a replacement for the Tab 2.  The graphics are much better, the speed is better - all around I would have to say it's an improvement over the Tab 2.The only disappointment I've encountered with this is the offer of free Hulu Plus - that has become a headache.  I have had so much difficulty getting the tablet registered with Samsung.  I have contacted their Live Chat 3 times and gotten 3 different answers.  Tried calling but got passed from one rep to another and just overall disappointed with that entire aspect.  So - good luck on trying to get your free Hulu Plus and/or Boingo!If it weren't for the hassles with Samsung Customer Service I would have rated this tablet a 5 star.", "Date": "January 17, 2014"}, {"Title": "She love's it!", "Author": "stevef", "ReviewID": "R3VE0IC6MOB09G", "Overall": "5.0", "Content": "I bought this for my wife for Christmas, she told me she hasn't found anything on it that she doesn't like. I asked her on a 10 scale how she would rate it and she said a definite 10! I did a lot of shopping around and as usual Amazon had the best price and It got delivered in time for Christmas. One of the main things she liked was the 8 inch size versus the 7 inch. With no tax and on time free shipping who could ask for anything more.", "Date": "January 14, 2014"}, {"Title": "An excellent all purpose Tab", "Author": "Angir Mitra", "ReviewID": "R3HJ2QQU2X7MC7", "Overall": "5.0", "Content": "I bought this on Black Friday sale from a store and have been using it extensively for last few weeks. Till now it's held up pretty good with no crashes even while being heavily loaded with games and apps.Main reason why I bought this:1. Screen size of 8in is just right for reading/gaming/surfing. Not too big/heavy as a 10in and nicer than a 7in. I could have bought the 7in also but this is only slightly heavier and has much better hardware. Its easy to hold for long reading hours.2. More RAM/Memory + good CPU means better gaming experience and no lags during surfing/movies.3. I don't a personal PC/Laptop right now (2 office ones). So I use this one for surfing, personal mails, games, etc.4. I read lots of comics and magazines. This is where this excels. Bright colors and very vivid.Rest of advantages you can check from other reviews.Cons:None really. Though it would have been good if back cover could be opened, but its sealed tight. So no getting to the battery. Side buttons seem bit too thin at times (but Tabs really slim which is plus).Must have add-ons which I bought on Amazon : 1) Screen Guard (ArmorSuit MilitaryShield - 4*), 2) Good Case (MoKo Samsung Galaxy Tab 3 8.0 Case - 5*), 3) Micro SD (SanDisk Ultra 16 GB MicroSDHC Class 10 - 5*, fast but later regretted not buying 32 Gbs)My frequently used Android Apps : Perfect Viewer for Comics/Mags (great app), Dead Trigger 2 (plays very smooth), Injustice.., Skype, WeChat, PvZ2, etc. All working fine with no lags. Hope this helps.", "Date": "January 14, 2014"}, {"Title": "Exactly what I wanted", "Author": "W. Fondren", "ReviewID": "R3KLENU8CWZSDX", "Overall": "5.0", "Content": "I've owned two 7\" tablets that I enjoyed and was very surprised at what a difference the extra screen space made. The screen display is beautiful and the touch very responsive. I'm not crazy about Samsung's Touchwhiz, but I'll fix that loading a custom ROM soon. The tablet size is ideal for using and carrying. I looked at a lot of different tablets and none offered so much for this price.The brown/gold looks very nice. Several people have complimented me on how nice it looks. I'm very satisfied.", "Date": "January 10, 2014"}, {"Title": "great", "Author": "Laura", "ReviewID": "R2WFMF10U1L8VG", "Overall": "5.0", "Content": "great love the product no issues with it very clear well worth the money great size and all...!! thanks you", "Date": "January 9, 2014"}, {"Title": "Excellent tablet", "Author": "LarryS", "ReviewID": "R2XF95UOE8P99Z", "Overall": "5.0", "Content": "I've used this tablet now for a little over a week and I'm impressed. The early media reviews of this unit are no longer valid wrt performance issues - performance is fine even with running multi-window. Also, the extra inch over the Nexus 7 make a big difference for me beside my requirement that a tablet needs to have an SD card. It's also nice that I can make the Tab 3 look just like my Galaxy S4 phone.  My only nit with the tablet is that I couldn't get the SD card to \"latch\" using my finger nail. I had to get a small screwdriver to push the SD card all the way in. Chomecast from this device works great, too!", "Date": "January 9, 2014"}, {"Title": "it was good choice", "Author": "Kang Byungsoo \"bsman\"", "ReviewID": "R1CPWMP1FGQJTZ", "Overall": "4.0", "Content": "very good to use ^^but it was not new one.. when i got parcel... the galaxy tab box was opend.. i was shocked...", "Date": "January 8, 2014"}, {"Title": "Good", "Author": "Ted", "ReviewID": "RTIQ3GPDTW8YH", "Overall": "5.0", "Content": "On time, everything is good, as promised. Tab is brand new, with manual and all required info included, no problems.", "Date": "January 8, 2014"}, {"Title": "Great choice", "Author": "David V. Rinaldi", "ReviewID": "RFRC5JAENPA1D", "Overall": "5.0", "Content": "My daughter in law was very pleased with it and has been usinf it everyday since Christmas day. No complaints as of yet", "Date": "January 8, 2014"}, {"Title": "This is the bomb dot com", "Author": "Mr Amazin", "ReviewID": "R1AY1OCSPJGL44", "Overall": "5.0", "Content": "I haven't taken much time to learn and use all of the wonderful amenities that come with my Galaxy Tab 3 - 8\" but so far...so very good.  The size, color, weight and functionality all are quite impressive and did I mention the display?  Kaboom!  Sharp, crisp and clean.  When placed beside an S4 or Note, you get a true wow factor!  This is a perfect sized winner of a tablet in my book.", "Date": "January 8, 2014"}, {"Title": "Very good!", "Author": "suresh.v.kulkarni", "ReviewID": "R3CZ8R7SY4GP5H", "Overall": "5.0", "Content": "I am liking it with respect to the form, features and speed. Very convenient to use and resolution is very good.", "Date": "January 7, 2014"}, {"Title": "Perfect Size: :Brown and Gold is Sexy!", "Author": "Bertie Rob Blac", "ReviewID": "R2NUPH78VV714N", "Overall": "5.0", "Content": "I love the brown and gold colors, it is very very sexy, but manly.  I wanted to get the 10.1 size, but because this 8-inch did the split-screen while the 10\" didn't, I bit down and went for this 8\".  Turns out this is the perfect size for a tablet--I love it.Im a guy, and this tablet easily fits in my pant front pockets (believe it or not).Pros:-FIts in a mans pants front pocket very easily-Sexy, but masculine color-Perfect size-Can do the Split screenCons:-I only wish theyre more keyboard type accessories for this device.-I think this tablet is a little slow and choppy, especialy hard to pull done the task bar from the top, but it's ok.", "Date": "January 7, 2014"}, {"Title": "what was advertised.", "Author": "L Trout \"Fish\"", "ReviewID": "R2YUOKH12XQZHY", "Overall": "5.0", "Content": "Very nice.....just what was advertised. Still learning to use...will let you know when tutorital is completed and understood. okay then", "Date": "January 7, 2014"}, {"Title": "THE tablet of choice", "Author": "SonnyR", "ReviewID": "R21E4WA71QDIPP", "Overall": "5.0", "Content": "Been pleased with the Samsung 8\" Galaxy 3 tablet from day one. Like the Android O/S asmuch as Windows 8 or slightly more. The tablet is attractive and has a solid feel to it. The 8\"screen provides a clear view. The front & back camera lens are functional and produce good photos and videos.The sound is good, also. The included apps are good and I enjoy using the S Voice app. Very handy. I could goon and on about the tablet's many features of which I'm still finding and learning about. However, so far, I am very pleased with the entire tablet. It has been a good investment.", "Date": "January 7, 2014"}, {"Title": "Best bang for the buck", "Author": "JPH Saluki \"JPHJr.\"", "ReviewID": "R22D532WFDTM0C", "Overall": "5.0", "Content": "The eight-inch form factor is my favorite.  This is my third tablet; first a seven,  next a ten.  This is the ideal compromise. The SD slot increases the versatility,  and the screen is amazing. I'm sure the durability could be better, but that has yet to be put to the test, and with luck, it won't be.  Speed is more than acceptable,  although I don't game; someone else will have to comment on that.  Overall,  as one who had been in tech since the '70s, I'm very pleased, and would strongly recommend the Galaxy Tab 3, eight-inch.", "Date": "January 7, 2014"}, {"Title": "Excellent for a first Tab!", "Author": "Charles", "ReviewID": "RWWCY1PT0AV6X", "Overall": "5.0", "Content": "Shipping 10/10Quality 10/10Aesthetic value 10/10 Performance 10/10 Now, I need the one with a sim card slot  to increase my acquisitions :-)", "Date": "January 7, 2014"}, {"Title": "Love this tablet!", "Author": "Lois J. Allison", "ReviewID": "R2HA0QB435YGX7", "Overall": "5.0", "Content": "I love this tablet. There is nothing I do not love about thi tablet. I also have an iPad 3rd generation.  I'm not putting that down but this I will use more often. It is fast ,  the screen resolution is fine. I originally bought the samsung tab 3 7 inch. But when I found out I could not move anything to the sd card from internal memory I decided I wanted to move up to the 8 inch.", "Date": "January 7, 2014"}, {"Title": "A good low budget tablet.", "Author": "Macbeth", "ReviewID": "R2WQ3URCA6XSNZ", "Overall": "5.0", "Content": "Its a very good low budget tablet. I only use it for internet browsing and reading books and so far it has not dissapointed.", "Date": "January 7, 2014"}, {"Title": "sharp pictures, easy to use.", "Author": "sondra glass", "ReviewID": "R17NCATGD3LFIW", "Overall": "5.0", "Content": "bought as a gift for my sister.  We're both techno-challenged but could set up easily for use.  However, we can't figure out how to \"marry\" the Tab with the keyboard cover I bought for it.", "Date": "January 6, 2014"}, {"Title": "Love this Tablet!", "Author": "Ray", "ReviewID": "R2PSZT87F91CET", "Overall": "5.0", "Content": "I think everyone on here has already said how great this tablet is and i must agree, my personal favorite feature on here is the multiscreen function. I love how i can run simultaneously both chrome and youtube on the same screen and while im surfing the web looking up stuff on chrome i can enter that item on you tube and then watch a video review all with out having to open another tab or browser! Of course there's so much more you can do on this tablet but that's just my personal favorite. I did buy a Snugg case which i love and it fits the tablet perfect while still keeping a slim and sleek look, here is the link to the case which i bought here on Amazon....Snugg Galaxy Leather Case Black", "Date": "January 6, 2014"}, {"Title": "Out of the box surprises.", "Author": "Craig Hartley \"hotdog\"", "ReviewID": "R3P0MG71OQ54IN", "Overall": "5.0", "Content": "First, let me say I love my Galaxy Tab 3 8.0. It closely resembles my Galaxy S3 smartphone, but even thinner with three times the screen space. Web surfing is far peppier than with Kindle Fire's wretched Silk browser. I typically have 65% power at the end of the day even though I use it for web surfing, email, Netflix, Kindle and Nook books, full-length movies, mp3, Facebook and tons of other \"stuff.\" It contains front and rear facing cameras of low to medium resolution, but sports a brilliant sharp screen. Road warriors can find inexpensive Bluetooth keyboard/case combinations.One of the Galaxy Tab's biggest benefits is that marvelous microSD slot that is missing from most tablets--I mean YOU, Kindle Fire and overpriced iPad! You can load 64 GB of movies, mp3, books, documents and other media to avoid clogging the tablet's resources. The Samsung micro SDXC UHS-1 PRO 64GB Class 10 card works perfectly without formatting. You can even attach a thumb drive to the Galaxy Tab via an OTG connector.--MINOR QUIBBLES--The two speakers on the bottom produce decent volume, but I wish they had placed them at the top/bottom (left/right) for better stereo separation. A bigger negative is that there are NO power or email notification or white light LEDs. The unit is a blank slab until powered up.I received my Galaxy Tab 3 8.0 from Amazon in just two days, but experienced a couple of unpleasant surprises when I opened the package. First, the Samsung box was torn open at both ends! Even though there is a big warning sticker not to accept the device if the seal is broken, I decided to risk it and see if it worked.I plugged it in and pressed the power button, but my heart sank when nothing happened. I kept mashing the button, waiting for the screen to flicker, when suddenly heard the musical boot tone sounded. Surprise! It turns out that the transparent-looking plastic screen covering is actually opaque black plastic! It looks just like a blank screen and I had left it attached in case I needed to return the tablet. Huh--a rather poor packaging idea, IMO.The minimal instructions and box are printed on crummy brown recycled paper about the color and texture of old cardboard. Bleah. Luckily you can find the real manual in .pdf form on line.Then it took me FOREVER to find the darn serial number so I could register my new toy. Turns out the serial number is actually printed on the label of the box that tears when you open it. D'oh! You get a bunch of freebies if you register, but only a couple are worthwhile.--FINALLY--I connected to my WiFi in seconds with a maxed-out signal. There was a big firmware upgrade available bringing it up to Android version 4.2.2. Sweet!Lightweight, slim and powerful at at a modest price, the Galaxy Tab 3 8.0 earns a solid five stars! If I ever have an issue with this device, I will immediately update this review.", "Date": "January 6, 2014"}, {"Title": "Excellent Tablet", "Author": "Bryan", "ReviewID": "R37TW42WT0I7XI", "Overall": "5.0", "Content": "Ive had the 8 inch Samsung Galaxy tab 3 about 4 weeks now, and here are my thoughts. It has a, beautiful, crisp display, and great processing speed for any task I preformed.  You can't go wrong with this tablet, and it's very reasonably priced.  I enjoy reading eBooks, and watching Netflix movies and TV shows.  Plug in a good pair of earbuds, and it's a wonderful experience. I'd recommend adding some additional memory, via sdcard, I added 32GB for plenty of storage space for pics and music imported from my PC. I would also recommend some sorta case or skin for protection, especially if you travel with the device.  There are zillions of great apps in the Google Play store and many are free.  I'm very glad I purchased this item, and hope others will get the same satisfaction I did.", "Date": "January 5, 2014"}, {"Title": "Really Good", "Author": "Jasnael Benitez", "ReviewID": "R3AC30IC7RU9U0", "Overall": "5.0", "Content": "Very good tablet, low price but very high quality. Nice design, ithink its a good item to buh. With all accesories and specifications. I recommend to get it from amazon.com", "Date": "January 5, 2014"}, {"Title": "Lovesss", "Author": "Ariann Greenidge", "ReviewID": "R3HHT9MJ4SPVV1", "Overall": "5.0", "Content": "Bought 2 of these, again for my dad and myself. My dad opened his andhe loves it. He says it is smooth and not laggy, I agree as well, I love samsung products and this tablet is amazing, comparing it to the tab two which I have as well, I just love it. The size is amazing, love taking itaround with me", "Date": "January 5, 2014"}, {"Title": "Samsung makes great product and the 8\" is just what you need for mobility", "Author": "R.D. \"R.D.\"", "ReviewID": "R1VVE5PGNWCV7Q", "Overall": "5.0", "Content": "I already have a Samsung 10.1 inch device.  It is great but a little inconvenient when traveling about in a plane.  The 8\" appears to be the best in size and function.  Put a 64GB Mini SDHC in it and you are set.", "Date": "January 4, 2014"}, {"Title": "Awesome", "Author": "Timothy H. Scott", "ReviewID": "R7TYA5BEEB17E", "Overall": "5.0", "Content": "Beautiful picture, fast, easy to connect wifi, most everything you need or ever use. So far it has worked flawlessly.", "Date": "January 4, 2014"}, {"Title": "Fantastic Value", "Author": "Jon", "ReviewID": "R1EP8I0YE4HLK1", "Overall": "5.0", "Content": "Got this tablet 2 days ago and couldn't be any happier with it. I sold my ipad 2 in order to buy it and wow what a great improvement this is. Its fast ive yet to really experience any lag. The tablet is very sleek and easy on the eyes as well. The only thing I've had a problem with is inserting the SD card you have to use a pen or another small object to push it all the way in. Minor problem so still a 5 star rating for me I'd definitely suggest this tablet to anyone!", "Date": "December 25, 2013"}, {"Title": "Very satisfied!", "Author": "Douglas Parmele", "ReviewID": "R1BU5IJ8QH88QS", "Overall": "5.0", "Content": "I have not found a flaw with this tablet so far! it's way above what my expectations were. I highly recommend this for anyone looking to purchase a great tablet for a great price.", "Date": "December 24, 2013"}, {"Title": "Samsung Galaxy Tab 3-7.0 -I Lv It!!!", "Author": "Nana Bryant", "ReviewID": "R2PV9WCCQK2PJ", "Overall": "5.0", "Content": "I was new to tablets but I quickly learned when you buy cheap-you get cheap. I'm speaking of adults and older kids.  I purchased cheap two times and had to take them back for freezing up or the keys would not work.  I started researching and reading other people's experiences with tablets.  I know everyone has their favorites but I really like my Gal-T3-7.0.  I love all the features and the battery life.  I like the 7\" version because it is easy for me to hold.  I have had heart surgery-lung surgery and a stroke in June.  I am a person who does not give up-working on my laptop and tablet help me increase my recovery.  I purchased two Samsung Gal-2-7.0 tablets for my grandsons for Christmas.  I read good things about them and this is their first tablet.  Samsung is quality to me.  Love it!", "Date": "December 24, 2013"}, {"Title": "great one samsung really did good", "Author": "Alan McCoy", "ReviewID": "R2QXZRWVH3S6LJ", "Overall": "5.0", "Content": "it is one of the fastest tabets and it works better then i ever imagine. look great and light and thin.", "Date": "December 19, 2013"}, {"Title": "Carry it everywhere.", "Author": "James W Hainesworth Jr", "ReviewID": "R1S17NMCZO64ID", "Overall": "5.0", "Content": "Love the size that's comfortable in my hand. With plenty of apps and WiFi it makes 8 hour bus trips manageable.", "Date": "December 19, 2013"}, {"Title": "Samsung Galaxy Tutorial, Perks and Promotions . . .", "Author": "CD", "ReviewID": "R2WAIL8WE8E32E", "Overall": "4.0", "Content": "This tablet itself is really good and easy to maneuver, and  I am pleased with the purchase.  Be aware that the documentation provided with the device  is in extremely small print and is uncomfortable to read, so expect to have to go to the website if you're new to tablets or maybe find something on YouTube (such as Samsung Galaxy Tab 3 7.0 for Beginners, [...]Also the tablet's product description states that it comes with special offers and provides a web site in smaller print. These offers did not come up when I registered the product through Samsung support site included on the super-small-print device documentation.  Here's a link you can copy and paste to take advantage of those \"special offers\":  [...]Suffice it to say, Samsung-out-of-box-experience/marketing people, medium to large printing fonts are preferable to the squinting and magnifying glasses that your super-minute micro-print documentation requires.  Come on, help us aged technofiles out a bit in the future, please.  I mean really, the least you can do is put a variable-font user manual that includes a large print option on the device's home screen.  Really, is that too much to ask!Yours truly,Not even a granny yet,but felt like a great-grandma after reviewing Samsung's product documentation", "Date": "December 15, 2013"}, {"Title": "LOVE MY SAMSUNG GALAXY TAB 3...8 INCH", "Author": "mdh88", "ReviewID": "R2QW9DKTIKZJQJ", "Overall": "5.0", "Content": "All I can say is I'm very happy with my New Samsung Galaxy Tab 3, 8 inch. I'm not a techy but this is sooo easy to use and was a snap to set up. The speed of the processor is wonderful and I know I finally picked the right tablet for me.", "Date": "December 11, 2013"}, {"Title": "it works beautifully. good speed, good sound, good colour contrast, good everything. two thumbs up from me.", "Author": "Shaquille W.", "ReviewID": "R3A3E9UU9S3D8E", "Overall": "5.0", "Content": "I just love it. Simply brilliant! I am currently a university student and I must admit that this device has enhanced my university experience thus far. What is also commendable is that it was delivered on time without any harm done. Good stuff amazon, good stuff.", "Date": "December 9, 2013"}, {"Title": "Is lightweight !", "Author": "Rcheto", "ReviewID": "R394QUDF0V4IT5", "Overall": "5.0", "Content": "Excellent product I was surprised this vesion Galaxy Tab 3.0 is lightweight with optimized with 8-inch screen size the previous version is heavy making it difficult portability", "Date": "December 6, 2013"}, {"Title": "Chocolate Thunder! This is a beautiful thing. I'll pay for PRETTY.", "Author": "Darth Tesla", "ReviewID": "R941KR47A1EVJ", "Overall": "5.0", "Content": "I also have the 2012 Nexus 7 and I can tell you that the extra inch is well worth the money. I couldn't resist the chocolate tablet. Samsung has succeeded in surpassing ASUS/Nexus in design and implementation. At first the first-release Jellybeans were welcomed on my Nexus, until they bogged the speed down to a crawl. There is something about the aspect-ratio on this tablets brilliant screen that simply makes reading and videos BETTER... all of this while still fitting comfortably in my hand. This tablet was completely ergonomically designed from the previous model to make for a comfortable experience. The SD-slot will come in handy if this tablet is used to entertain kids traveling in a car, when a streaming WiFi signal is not available.", "Date": "December 2, 2013"}, {"Title": "Great Tablet - Version for Kids is Awesome!", "Author": "lmc", "ReviewID": "R3HKTLIBXG3M1W", "Overall": "5.0", "Content": "Have to say what a great tablet this! I have a Google Nexus 7 and I always find myself using my wife's Galaxy Tab. Samsung just has done such a great job with the interface and the hardware.Of course, our kids want to use both our tablets and so I am getting the three of them the kids edition of this Galaxy Tab. It is basically the same powerful hardware but has a child-friendly grip and easy-to-grip C Pen. It also features an interface for kids which the parents can control what apps the kids can play and a timer on how many hours they can spend each day on the device.Amazon has the Samsung Galaxy Tab 3 Kids Edition here. Amazon always has the best prices. :-)B00F3U2H80", "Date": "November 29, 2013"}, {"Title": "This tablet is great!", "Author": "S. Brown \"Steveo\"", "ReviewID": "R344GB70NSEA1B", "Overall": "5.0", "Content": "Fast with almost no boot up time.  I rarely use my laptop anymore!  Got a cover and screen protector for it as well through Amazon.", "Date": "November 27, 2013"}, {"Title": "Samsung Galaxy 3", "Author": "Allison", "ReviewID": "RRQ4VRYOLG21B", "Overall": "4.0", "Content": "A little too sensitive around the edges making it too easy to turn it off and the function buttons are too easily to accidentally touch. Other than that the performance is great!", "Date": "November 27, 2013"}, {"Title": "great tablet", "Author": "Patrice N.", "ReviewID": "R2FV3M128CKE2R", "Overall": "4.0", "Content": "i am a first time tablet owner. ive used my friends ipads and id say its on the same level with them. the only thing is that it dents easily so be careful but my screen has no scratches on it and i dont have a screen protector over it. i also wish it had better touch sensitivity. i also thought it was going to be bigger for some reason but that was because i was watching 10\" ipads for comparisoni was REALLY disappointed in the way it was packaged. it was just in the box it came in and in an envelope. it wasnt even labelled as fragile. luckily it came in perfect condition.another thing is that the free stuff it came with (free hulu access, etc) is not applicable internationally (im from the caribbean) which sucked. i could even get to use the $10 credit you get from the play storeoverall i love samsung and i love my tab, its works great, battery holds up well and does everything i expected it to.", "Date": "November 17, 2013"}, {"Title": "Slam Dunk !", "Author": "Waialuahaole", "ReviewID": "RJF6V6HA8W4Z8", "Overall": "5.0", "Content": "Absolutely the state of the art.  Samsung has a home run with this unit.  Right size, very quick, incredible graphics.  There is nothing not to like about it.", "Date": "November 17, 2013"}, {"Title": "The best tablet .", "Author": "Xpious", "ReviewID": "R2WY452MM6MDY3", "Overall": "5.0", "Content": "I got this tablet a few days ago and so far I am loving it ! Last month I bought one on QVC for $100.00 , but a month later it froze on me . You get what you pay for .", "Date": "November 16, 2013"}, {"Title": "Great buy for the price!", "Author": "Barbara G.", "ReviewID": "R1T11C96E354TY", "Overall": "5.0", "Content": "Just the right size for convenience and portability.  Camera is great!  Bought it for a convention I attended in Houston--was able to use it for note taking and keeping track of various activities and locations.", "Date": "November 14, 2013"}, {"Title": "Great Buy!", "Author": "Amazon Customer", "ReviewID": "R1Z48AYR9B3LKW", "Overall": "5.0", "Content": "I love this tablet.  While I love my Kindle Fire, it was time for an upgrade.  I also have a Samsung phone, so all my apps and info from my phone autopopulated onto my tablet!  It's fast, light and easy to navigate!", "Date": "November 11, 2013"}, {"Title": "Amazing", "Author": "Fred", "ReviewID": "R1F6CHYYU8JERS", "Overall": "5.0", "Content": "This thing is amazing so far.  I've had it for several months and I haven't found anything I don't like about it yet.  The screen is great, it's fast, and the battery seems to last forever even under constant use.  I've always been impressed with Samsung products and this definitely didn't disappoint.", "Date": "November 4, 2013"}, {"Title": "very useful", "Author": "G. Lee", "ReviewID": "RTZMK1IN7DOBB", "Overall": "5.0", "Content": "When I first bought this tab, I thought I would just be using it to surf the net, go on fb and play words with friends,  however this thing can almost replace my laptop. I was surprised to see how easily I could edit word and Excel documents. Every app works flawlessly, and the speed is great.However,  the only issue I have with this tab thus far is I can't seem to find the option to reset my screen lock pattern. From what I read, it is possible in the earlier tab versions. Don't know if my issue was deliberate or if an update is in the making to fix it.Ok finally figured out how to remove the lock screen pattern.", "Date": "November 3, 2013"}, {"Title": "Nice, but Happier With Note 8.0", "Author": "Period Movie/Film Noir Lover", "ReviewID": "R41Y8JYF55E3C", "Overall": "4.0", "Content": "The reason I initially opted for the Tab 3 instead of the Note 8 was mainly because of the Tab 3's lower price.  However, after using the Tab 3 for a few weeks, I regretted not having bought the Note 8 instead. Though I loved the size, feel, look, features and light weight of the Tab 3, I was ultimately disappointed with it, and ended up sending it back for a few reasons. It seemed to lag on a fairly frequent basis, and scrolling wasn't usually very smooth. Also, since it has such a thin bezel on the sides, I had difficulty holding it, which to my annoyance resulted in accidentally pressing the buttons on the bottom of the device countless times (though I ordered a case for it after about two weeks of use without one, which did make it somewhat easier to hold).  After sending it back,  Amazon quickly credited my account, and I ordered the Note 8 instead, which I am quite happy with. It's easier to hold because the bezel is wider. I have not experienced any lagging after a couple of weeks of use. I also have to say that with the Tab 3, I really missed not having the S Pen like my Note 2 phone and the Note 8 both have. I much prefer the S Pen over using my fingers or a regular size stylus.Overall, I thought the Tab 3 was a nice tablet for the most part, and I probably would have kept it if it weren't for the lagging and the accidental button pressing. From the reviews I read on Amazon, lots of people are very happy with it, but for me it was worth the extra money to switch to the Note 8 (although I must say I do think that Samsung has priced it too high).", "Date": "October 29, 2013"}, {"Title": "Loving it - Esp. the IR Remote/Peel App", "Author": "SMB", "ReviewID": "R3R6VEZCM81XN5", "Overall": "5.0", "Content": "I've had this for a few days now and I'm loving it.  Why the Galaxy?  I recently got a Macbook Air (which is awesome) but I decided that a very similar OS on a tablet would be boring (and didn't want to spent over $500 on a tablet!) so I decided to look for an android tablet over iPad.  Based on ratings and reviews, I narrowed it to the Galaxy Tab 3 and the Google Nexus.  The Google Nexus has slightly higher specs and a super hi res screen but it isn't as polished a device as the Galaxy.  Users commented on the Nexus saying that it was lagging and freezing.  It also looks like something from a couple years ago both in terms of exterior appearance and the interface.  Super hi res screens on tablets is a bit ridiculous IMO - my 47\" LED is 1080 so having something double that on a 7-10\" screen is just not a huge improvement.  The reviews on the Galaxy were high, it is an established and polished model, the interface looks great and my favorite - it includes an IR emitter and the Peel entertainment system app.  I chose the 8\" size as it's the perfect size and has higher RAM than the 8\" and 10.1\".  Also, I think that 7\" and below is too small for a tablet and 10\" is encroaching on too large for ease of portability and handling.It has been great so far - some pros:-Easy to set up-Has been zippy-Good interface-Clear, nice image-Size is perfect and it's really thin - thinner than my Motorola Droid Razr Maxx-Well pricedI love the IR emitter and Peel application - in addition to the low price, this added feature made getting a tablet definitely worth it.  I've set it up with my living room entertainment system consisting of a LED, A/V Receiver w/ Surround, Verizon FIOS cable box, Blu Ray player and Roku.  I can enter the app and choose 'watch roku, watch blu ray or watch tv' and when I select those options - it will set the correct TV and Receiver input, turn on the necessary components and then gives you an on tablet remote control for that device to navigate the Roku, DVD player or TV.  You can set it to use the AV receiver as your sound for each device so when you use the + - sound keys on the digital remote - it will change the receiver sound.  The home page lists everything that's currently on cable by categories like 'drama' or 'reality'.  You can click on the program and it changes your cable box to that channel.  I like this more than the Verizon FIOS remote app which gives you a TV guide like interface to browse to choose a show as it organizes shows by categories and has a picture for each program so you can more quickly see what's on.  You can also add your favorite channels to the top bar and under each channel image it lists what is currently airing on each.  You can also view what's on later in the day and set alarm reminders for upcoming shows.  Very sweet.  I love it as I watch a lot of TV/movies and do not like using 5 different remotes.  There are universal remotes with LCD screens that cost $200 - why get one of those when you can have it in within an even better interface and multifunctioning tablet.Of note:  To set up my receiver, I had to run the pairing a few times....  it will find a code that turns off your receiver but that doesn't mean that the first one it finds is the right one for your model.  I had to rerun it three times telling it that a specific code did not turn on the receiver when it really did as when that code was used - the list of inputs did not match its actual inputs.", "Date": "September 2, 2013"}, {"Title": "Great Tablet", "Author": "Lorie", "ReviewID": "R1JLCXE6PH41PV", "Overall": "5.0", "Content": "I really only use this tablet to check email and go online and once in a while I will play some games.  The buttons on the bottom are very sensitive if you are holding it with one hand as I haven't bought a case for it yet. Everything displayed is clear and bright which I love.  Anything else that is technical, I can't tell you but for what I use it for, it's great.  I just hate to spend more money on data plans so will probably use it with wi-fi around.", "Date": "August 11, 2013"}, {"Title": "Good Product", "Author": "Andrew Bayer", "ReviewID": "RQT6XP6179132", "Overall": "5.0", "Content": "Everything I expected. I have used a Galaxy Tab 10.1, the original, for a couple years, and like the idea of holding the tablet easily with one hand for reading etc. This one does the trick and the seamless movement and response time is nice compared to the old one 10.1, due to the small RAM increase and better proc. Don't know why they don't have more internal memory in all tablets with how cheap it is now, but the expandable is a functional alternative.", "Date": "August 7, 2013"}, {"Title": "Perfect for my needs", "Author": "LJD \"LJD\"", "ReviewID": "RXE8H1AUEMW76", "Overall": "5.0", "Content": "After a lot of reviewing I chose the samsung because of the perks and the expandable memory card.  Set up is easy and I was able to customize to my needs.  I am new to the tablet so it will be a while before I am into it.  The size is great but it is heavier than the 7 inch though not a lot.  Amazon was the only place to have the brown one and I didn't want the white one.  I can't say enough about the service from Amazon.  They handled the purchase and some returns of the cases I bought so easily.", "Date": "August 5, 2013"}, {"Title": "Best product", "Author": "N. Ranganathan", "ReviewID": "R3OBJPMPRT5E42", "Overall": "5.0", "Content": "One of the best tablet I have ever seen. Lot features, very handy, very cool stuff..It automatically syncs with Samsung tv without code and awesome sharing....", "Date": "August 2, 2013"}, {"Title": "Perfect size!", "Author": "kris", "ReviewID": "R3H85WJLSQZ92Z", "Overall": "5.0", "Content": "Love mine. The 8 inch screen is the absolute right size. Very light n sturdy. Was worried about the dual core processor but works great. Runs modern combat 4 (very high graphics) without a problem. Highly recommend", "Date": "July 26, 2013"}, {"Title": "Exceeding Expectations", "Author": "Amazon Customer \"spiffydg\"", "ReviewID": "R7K6TCX8L8DCM", "Overall": "5.0", "Content": "I am very impressed by the picture quality.  The device is light and sylish.  I was surprised that the 8\" had the higher performance processor and camera over the 10\" but the 8\" is the perfect size for the application I was looking for in this tablet, which is book and magazine reading, email on the go, news, weather, simple games to pass the time.  I have not been successful at getting it to take notes with a stylus, however, maybe this tablet is not meant for that.", "Date": "July 21, 2013"}, {"Title": "Micro USB, minimal side bezels, great USB functionality!", "Author": "Raymond Perry", "ReviewID": "R1UG0O21BI2KWB", "Overall": "5.0", "Content": "ADDED 8/25/2013:  I have to apologize for not correcting this review earlier regarding HDMI.  As far as I have been able to determine the Tab 3 8.0 does not have HDMI out at all, even with an adapter.  While HDMI is a nice feature its lack is not a deal breaker for me since I would rarely use it.ADDED 7/30/2013:  If anyone needs a nice carrying case (not cover) check out a Rip Offs CO-58.  It is the perfect size for the Tab 3 8.0, even in a Moko cover and has a couple of small pockets on the front just right for OTG adapter, flash drives, USB cables, etc.  CO is clip on, BL-58 has a belt loop.  I mainly use it for packing everything together and adding a little extra protection when I travel.ADDED later on 7/19/2013:  Does anyone else find the micro USB port difficult to plug into?  I sent my firt Tab 3 back because I could not get either the cable that came with it or any of the many I own to even start to plug in.  When I got a replacement I was able to get the factory cable and most others plugged in, but a couple still won't go in at all.  They work fine on the many other micro USB devices I own.Following up my comments about USB keyboard below, I found an app called External Keyboard Helper that reprograms some USB keyboard keys such as the Esc key to emulate the Android \"Back\" button and Shift+Alt Esc to emulate the \"Home\" button.  Like holding \"Home\" holding Shift+Alt Esc displays open apps.  It also works with most bluetooth keyboards.ORIGINAL POST:I deleted my earlier pre-delivery post rather than update it.  I am thrilled with the features I mentioned in the title.  They are the only things that kept my Tab 2 7 from being nearly perfect for me.  I have grown to HATE proprietary connectors as they limit your choices of available adapters.  Now I I like to have HDMI out capability for travel.  The Tab 2 does not have this capability, period.  Even with an adapter.  I am very happy the side bezels have been narrowed.  The Tab 3 8 is only .07\" wider than Tab 2 7, which is nothing, and only .5\" longer.  8\" screen and not much bigger overall.  Even in a case I can slip it in my pocket if I need to.  8\" vs 7\" is a HUGE difference.  For the last 4 years I spent a couple of hours a day on a 7\" netbook then a 10.1\" so I am very comfortable with the 8\", though I will still use my new 11.6\" netbook most of the time!  Other reviewers have done a great job praising the many features of the Tab 3 8.0 so I will limit my review to try to flesh out some of its USB capabilities.I immediately tried this micro USB OTG adapter and a flash drive:  T & S Electronics Micro USB[[ASIN:B000Q8UAWY Belkin USB 2.0 4-Port Ultra-Mini Hub OTG Cable - LIFETIME WARRANTY! (Micro USB OTG to USB Adapter. Samsung Galaxy S4, HTC ONE, Nexus 7 & Nexus 10, Galaxy Tab 3 and all OTG compatible devices.]]  The Tab 3 read the drive just fine.  Next, I unmounted the flash drive and plugged in this Belkin Ultra Mini USB Hub: Belkin USB 2.0 4-Port Ultra-Mini Hub and re-inserted the flash drive.  Still good.  Then I plugged in a USB keyboard and mouse, and all three devices were fully functional.  Now the piece de resistance.  Using this Y cable, Apricorn USB Power Adapter Y Cable AUSB-Y USB (Black/Grey), I connected a 2.5\" external hard drive to the hub and a USB power adapter (you could use the Tab 3's).  The Tab 3 recognized it, but could not read the NTFS file system.  I am certain a drive formatted FAT32 would work fine.  Using the N_xus (fill in an e) Photo Viewer app I could read the drive but could only open photos.  There is a paid version of the app that may allow more access.  This was just a test.  Unfortunately the only apps to fully read NTFS seem to require root.I have an HDMI adapter for my Galaxy Note phone that I will try as soon as I can and report back.That's about it for now except that I am typing this using the USB keyboard and mouse connected to the Belkin Hub!  Sometimes the onscreen keyboard will pop up and consume half the screen.  A right click on the mouse closes it.  Oh, the only minor thing that may have been better on the Tab 2 is that because the Menu Home Return buttons were soft buttons you could click on them with the mouse.  On the Tab 3 those are hard buttons that are off the screen so you cannot access them by mouse.  I am going to search to see if there are keyboard or mouse alternatives.", "Date": "July 15, 2013"}, {"Title": "Samsung Tab 3", "Author": "P. Montgomery", "ReviewID": "R1WLDQBHEAVRDA", "Overall": "5.0", "Content": "Purchased as an early anniversary gift the wife loves it, once she updated her gmail account. Went with Samsung Tab 3 since she has the Galaxy 3 and is familiar with the Android UI.", "Date": "July 13, 2013"}, {"Title": "The 8\" is perfect! Stop waiting for the new Nexus and get one!", "Author": "Joe", "ReviewID": "R325USARS1IVQD", "Overall": "5.0", "Content": "I was skeptical of buying this tablet because I was waiting for the new Nexus 7 to come out.  Eventually, the anticipation was killing me, so I went for it and bought the Tab 3.  From a technical standpoint, the Tab 3 isn't that eye-popping.  It may not have the quad-core processor or highest resolution screen available, but it is a quality tablet that is the perfect size.  Compared to my 7 inch tablet, the extra inch goes a long way.  It is great for watching Netflix or surfing the web.I would recommend this tablet to anyone.  It has a great look, is light in weight, and has a big screen that can still fit in your pocket when you need it to.  This thing is great!", "Date": "August 19, 2013"}, {"Title": "Awesome Tablet", "Author": "Alain A. Mccallum \"chi11_factor\"", "ReviewID": "RMW3MLCYN0S", "Overall": "5.0", "Content": "I got this the first day it came out and i must say, i find it extremely hard to put down. It's light, sleek, fast and just downright gorgeous. Samsung products just keeps getting better and better, i bought the tab 2 7.0 as a present for my girlfriend a few months ago and i was extremely impress that i even find myself a little jealous. However the tab 3 8.0 is on another level, it's not too small or too big, it's the perfect size. It fits in my hand perfectly, but my hands are a little big. I am so impress with this device that it completely convinced me that i need to get a Galaxy S4.", "Date": "July 13, 2013"}, {"Title": "Love it so far!", "Author": "Kelly", "ReviewID": "R22ZCYA54N0RXE", "Overall": "5.0", "Content": "I've had this tab for a few days and I am a little obsessed with it. It's always in my hand. You get everything listed and more. This will be a great tool for work, travel, and play.I chose the 8 inch as a compromise between my small hands and my husband's large hands. Also, the 10.0 was a little heavy for us as we would be holding it with one hand for long periods of time while teaching. The multi screen feature is also great for our uses!The only downside right now is that there aren't any cases for this tab yet. The tab 2 cases for the 7 and 10 fit the tab 3's but because this is a new size I'm left waiting for the accessories to catch up. I'm worried that if the 8 doesn't sell as much there won't be a lot of options in that area.At first I laughed at the $100 price bump for an inch. But after trying out the 10 and the 7 and really thinking through how we would use the tab we made the choice to go with the 8 inch.For us, the 8 was worth it so far.", "Date": "July 12, 2013"}, {"Title": "Best one 'out there' so far!  Really!", "Author": "Pcprntr", "ReviewID": "R9BRVNVRPR0SW", "Overall": "5.0", "Content": "I've owned the ipad 10\" and the nexus 7. This 8\" tablet far excels over  'other manufacterers' tablet products. I switched from the nexus 7 (this time), of which I can say is a 'fairly good' piece of electronics. But... this Samsung Galaxy Tab 3 8\" is truly amazing. And by far has more features than anyone else on the market at this time. As far as my tablet needs go for now. I say... Bye Bye ipad & Bye Bye nexus. Hellooooow Galaxy Tab 3. It's my only choice for a 8\" tablet for my foreseeable future.  GREAT JOB SAMSUNG..!!", "Date": "July 19, 2013"}, {"Title": "Great 8 inch tablet", "Author": "Jeff", "ReviewID": "R3SCR88XOO0LY1", "Overall": "5.0", "Content": "I've had a few tablets - starting with the first generation iPad.  I've also owned a BlackBerry Playbook, and the Samsung Galaxy Tab.  Of all three, I consider the Samsung the best!  I like that Samsung includes a microSD card slot - means you can get more storage relatively inexpensively - beats both Apple and BlackBerry - and, unlike BlackBerry, I have confidence that Samsung will be around in five years.  For only having 1.5GB of RAM, the Android OS runs smooth as silk, and the multi window feature is a definite plus - means true multitasking - you can actually be DOING two things at once.", "Date": "July 18, 2013"}, {"Title": "Better than IPADs", "Author": "J. Wong", "ReviewID": "RQK17W1AKM5IJ", "Overall": "5.0", "Content": "Bought it at the brick and mortar store called BB, got to support my local community you know. Well, this gadget is really nice. Sometimes you just want to lay in bed and not hold a 10.1 size tablet and this one is sure to make you happy. The colors are so bright I don't think anyone will have the screen to highest brightness unless they are outdoors. I sold my IPAD 3 to buy this and don't regret it at all, the IPAD retina is overrated, its bland in colors. This one feels like a mini HDTV LEDTV. I also have the Samsung 10.1 Note both in white, I think they make it less industrail looking than black/brown, more like something to have fun with. Samsung is eating Apple's lunch.Sorry to say I have exchanged it for the Note 8.0. Reason-watching YouTube when you switch from landscape to portrait mode the video stops for bit. Drove me nuts, the Note 8.0 does not do this.The 8.0 can be a burden to hold at times I admit. So if I had my wish I wojld take a tab 3 8. With perfect YouTube viewing.", "Date": "July 17, 2013"}, {"Title": "Great Small  8\" Tablet!  An inch does make a difference!", "Author": "anzicco", "ReviewID": "R25B83QSUUDLH6", "Overall": "5.0", "Content": "First let me say that until recently, I have been an absolute Apple freak since before the first iPod and still respect the products they have made as innovative and simple to use....the problem is while they have been busy recreating the same thing over and over for the past couple of years now, others, especially Samsung have been building on the innovation and coming out with a wide variety of products that are now technologically more advanced.  Apple prides itself on aesthetics and beauty, but they haven't had much of a hardware change in more than 2 years.  If you want to talk about beauty, The GOLD-BROWN TAB 3 8 inch is perhaps the most beautiful and aesthetically pleasing tablet in its class.I recently upgraded my iPhone4S to a GALAXY S4 and couldn't be more pleased!  Although there is a bit of a learning curve for me in regards to certain Android OS differences from iOS (in particularly  all the settings choices), I am getting the hang of my S4 and have become a bit angry that Apple puts a lot of roadblocks up not allowing android devices direct access to iTunes and the whole Samsung vs. Apple thing that only hurts customers in the long run.  I have begun to find ways around Apple's roadblocks with the many apps that get around Apple's nonsense and allow me access to my music on whatever device I want it on.  My frustration with Apple has now led me to the GALAXY TAB 3 which is slowly replacing my 3rd Generation iPad.  Through Kies, DropBox, Chrome, Google Music, and Polaris suite of apps, I am finding my way into the world of Samsung and the many choices Jelly Bean android allows me to sync and personalize my devices MY WAY, instead of having some Apple designer in his IVES Tower tell me how they want my devices to work!", "Date": "July 12, 2013"}, {"Title": "This tablet is awesome", "Author": "Amazon Customer", "ReviewID": "R1O157LKGEM8PG", "Overall": "5.0", "Content": "I never write reviews and I am writing this one from my tab 3. I have the nexus 10 that I am now getting rid of.  The 8 inch is the perfect size and weight. The ir remote  feature is awesome as it can also be my universal remote control, especially when I travel and am in hotels (no need to touch the dirty hotel remote control) and for home as well. This device is truly a perfect life companion. You will not disappointed if you purchase one of these.", "Date": "July 10, 2013"}, {"Title": "Great tablet!", "Author": "Neil Martin", "ReviewID": "R10MFW0QYP5GGW", "Overall": "5.0", "Content": "Great tablet! Awesome form and screen quality! Great battery life and performance! Also love the quickness of its performqnce and great wifi connection!", "Date": "June 8, 2014"}, {"Title": "I love The Samsung Tab 3 8 inch!", "Author": "Bernard H.", "ReviewID": "R3S9X04I25S2MB", "Overall": "5.0", "Content": "I totally satisfied with this tablet. I would recommend it to anyone that's in the market for a small tablet. It is a highly functional tablet.", "Date": "June 6, 2014"}, {"Title": "Free perks will cost you", "Author": "george", "ReviewID": "R27AQIIGT6C0PW", "Overall": "5.0", "Content": "This is a great tablet and it's exactly what I expected it to be after researching it online (and going to a store and playing with it for a while - which I would recommend everyone to do).Just a few words about free stuff: This product is advertised as \"Pre-loaded with free content including Hulu Plus membership, Google Play credit and Boingo Wi-Fi Access\". If you register your tablet with Samsung you'll get even more \"free\" perks: Audible, Zinio and SiriusXM Internet Radio. However, you'll need to provide credit card number and monthly charges apply after trial period, so if you accept all of these \"free\" perks you'll end up with $53 monthly charges. The only true free perk is $10 Google Play Store Credit.", "Date": "April 17, 2014"}, {"Title": "Samsung Tab", "Author": "Angie \"Angie\"", "ReviewID": "RMLBNGQ2IB4YS", "Overall": "5.0", "Content": "I love my Tab, take with me every were, and I was able to set it up without asking my sons to help me. Thank you Samsung", "Date": "April 10, 2014"}, {"Title": "I love the Tab 3", "Author": "Oscar Hernandez", "ReviewID": "R2MI70C9EZ9O2Y", "Overall": "4.0", "Content": "I received the item way before expected delivery time. My only issue with this is the way it was shipped. I opened the box and the tab was on and battery was almost dead. The item was not damaged, Thank God! It seemed as if the item was just thrown into a box and delivered. I know that it is a refurbished item, however, I hope all product is not shipped the same. The box was sealed and the charger and instructions were provided. Very fast tab and works great so far. I have only owned this item for approximately 3 days and will update at a later time if anything changes. Make sure if you are going to buy this item that you buy a case and matte/anti-fingerprint screen protectors for this item as fingerprints are very evident on the tab.", "Date": "April 7, 2014"}, {"Title": "love this tablet", "Author": "Steve", "ReviewID": "R1ZQ7UVX4LZ4OI", "Overall": "5.0", "Content": "Upgrade from my 2nd gen nexus 7... shipping was fast and everything came as described. It looked brand new! Would recommend this tablet to anyone", "Date": "April 6, 2014"}, {"Title": "Not one regret", "Author": "Yayko Lindsey", "ReviewID": "R107022KJYYU50", "Overall": "5.0", "Content": "So, I have had this tablet for 4 months, and I honestly use it more than I do my phone and laptop. I have used it every day since I have owned it, for at LEAST 2 hours. It does everything I wished, while looking incredibly stunning. I do advise getting a nice case and a couple screen protectors. My case came with a very nice stylus, and it works perfectly with the tablet. I hype this product up constantly to my friends and family, because I have used the Nexus 7, all iPads released up until March of 2014, and I have used Samsung's Note tablets also. This tablet, being only $250, is definitely my favorite. Sure, if the Samsung Note tablet was $250, I would have gotten that, but it isn't. So, this is by far the best choice. I also love the Brown/Gold color. It makes it look super classy. I just recently ROOTed my tablet just to check it out, and it works perfectly fine still, and I play graphically intense games on it with ease. I love playing Asphalt 8 on it. It is a great, free, game on the app store. I advise EVERYONE to get this tablet. It is perfect for kids, teenagers, young adults, and mature adults. Please be smart, and purchase this tablet.", "Date": "April 3, 2014"}, {"Title": "Love it.", "Author": "Yssac De Js Ruiz", "ReviewID": "R2YG6E2KCZZKWU", "Overall": "5.0", "Content": "i really love this tablet, because it is light weight, and great screen resolution. The battery life is superb. Extremely recommended.", "Date": "April 1, 2014"}, {"Title": "A1", "Author": "Quentin", "ReviewID": "R3DIZM0PE2M2DN", "Overall": "4.0", "Content": "What I was lookin for, it does everything that I need it to do. I have no problems with it", "Date": "April 1, 2014"}, {"Title": "Samsung Galaxy tab 3 works great nice size", "Author": "nomonthybill", "ReviewID": "R35QEL8VTXVBG1", "Overall": "5.0", "Content": "Having the 16Gbits of local memory is very nice to have.Using the external card for music and movies (which I switch sometimes to other cards) is very nice.Having a slightly larger (8\" vs 7\") really makes a big difference, more than you would think.I haven't noticed any real lag time.Screen resolution works well and the touch works well with no issues.Have not had any issue with battery life, while I have not any testing on battery life it does last all day for most normal use.I do like the extra buttons outside of the screen (the \"back\" button, menu, and home buttons).The on/off and volume controls are easy to use and well placed.The small side bezels does make it harder to hold on to, getting a case is almost a must.Would have really liked the speakers to be on opposite sides (or ends).I've used this tablet for over a month.  This is my first tablet.  I have a Kindle e-reader which I still use when just reading (really like the battery life and using it outside).My main use for the Samsung tablet is for reading emails, web surfing, some games, Skype, listening to music and watching videos at times.  I do some file editing and it works OK.  Replaces the laptop for most simple thingsOverall I'm very pleased with the unit.", "Date": "March 31, 2014"}, {"Title": "Great tablet", "Author": "cg918", "ReviewID": "R1OYTHPSKO2845", "Overall": "5.0", "Content": "Great bu.y Love it Fast delivery. Better than expected. Item received as described. I would recommend to anyone looking to purchase a new tablet", "Date": "March 31, 2014"}, {"Title": "I like it a lot", "Author": "Barbara Lohr", "ReviewID": "R2MDIOPFVL5IVP", "Overall": "4.0", "Content": "It is a good size and light weight, which is what I was looking for. I am still learning what all it can do, but so far I like what I see.", "Date": "March 31, 2014"}, {"Title": "Great Tablet!", "Author": "Randall Hummer \"Randy & Candy\"", "ReviewID": "R3IYELSFRAOK70", "Overall": "5.0", "Content": "I love this tablet, so glad I went with it, it is compatible (obviously) with my SIII phone, very user friendly, durable and so convenient!There are plenty other tablets out there to choose from but this one is worth every cent we spent on it!Highly recomended!", "Date": "March 31, 2014"}, {"Title": "Great tablet!!", "Author": "Rin", "ReviewID": "R2UGEP1NOXJUQA", "Overall": "5.0", "Content": "It's a great tablet, lightweight, fast, nice screen, has expansion slot. I considered getting an iPad Mini, but this costs less and does more.", "Date": "March 31, 2014"}, {"Title": "Good purchase from Amazon Warehouse Deals", "Author": "Chairman of the Board \"Smith Board of Directors\"", "ReviewID": "R345T9950OJI0H", "Overall": "4.0", "Content": "So far so good.  The unit appears to be nearly new with no scratches.  I also purchased the square trade 2-year tablet protection.  I wanted to replace my iPad 1 but the price was outta my budget right now...My sister has the iPad mini and I compared it to the Samsung Tab 3 8\" and decided to give it a chance.  I have an Android phone so the setup on my Tab was seamless.  All the apps and settings transferred as soon as I logged in.", "Date": "March 26, 2014"}, {"Title": "like a giant phone!", "Author": "sarah bae", "ReviewID": "RXHFIRPOBBAUX", "Overall": "5.0", "Content": "i love the size. easy to use. reminds me of my phone. haven't had any problems with it thus far. does everything i need it to do.", "Date": "March 24, 2014"}, {"Title": "Great device, great bang for the buck, even nicer rooted", "Author": "Steve \"Steve (Walnut Creek, CA, USA)\"", "ReviewID": "R2ENEWL98YLSGY", "Overall": "4.0", "Content": "Got this for my daughter, and I use it for a for trips as a navigation/reading/TV watching device.It'd be 5 star if it came either rooted or with the ability to disable or uninstall various built-in apps.Pros:====LightweightEasy to operateThe dual-app split-screen capability is niceDecent battery lifeBang for the buck - it has GPS - in the Apple world you have to spring for the more costly cellular versions to get GPS.  I use it, tethered to a rooted GS2, for navigation in the car.Cons====Unrooted, there are a lot of Samsung apps that run automatically and can't be turned off or uninstalled. I'd hoped for less of that because there aren't any cell carriers involved.Can't disable S Voice (I prefer Google voice) without rooting to the best of my knowledge.This is an Android comment - both Play or Amazon's stores don't do a good job of tracking game progress across devices.  This tablet replaced a rooted Nook Tablet running Cyanogen that died.  Very hard for me to get her game progress to come to the new device.  In a few cases I could copy data from the appropriate folder on the SD card.Would like it if it was easier to theme.Neither Pro nor Con================Rooting this is a piece of cake.I happen to find IOS's multi-finger swipe to switch apps to be easy if you're switching between 2 apps a lot - like e-mail and a browser.  Easier than either holding the button (IOS and android) then scrolling to your desired app.  I installed Pie Control (doesn't require root) and set it up with my most-commonly used stuff (2 arcs 4 positions each plus long-hold choices for each if desired).I found the built-in keyboard to be interesting - number keys are drawn in above the alpha.  This isn't an option in either Swype or IOS.I use Swype by preference - the ability to do such things is a primary dislike I have of IOS.I've set Chrome as the defualt browser so e-mail links automatically open in Chrome (also impossible on IOS).I happen to prefer browsing using a BT keyboard in my lap for typing.  Ditto serious e-mail.", "Date": "March 22, 2014"}, {"Title": "why i like this tablet", "Author": "Guadalupe Martinez", "ReviewID": "R1RKI3PV1AKY7K", "Overall": "5.0", "Content": "Find. It easy to use when we need to search an address or email and search the web. We acess the maps for directions on our trips. Very handy.", "Date": "March 19, 2014"}, {"Title": "Reliable & Easy to Operate", "Author": "Harrison A. Curtis \"Techy\"", "ReviewID": "RZODFX3K4GIGM", "Overall": "4.0", "Content": "I have had this Galaxy Tab 3 (8\") for more than 9 months and it has become my primary entrance to email and WEB access.  The fact it instantly comes on makes it easy with Android notifications to respond to my outside world.  The lap top gets turned on only when I need to access a non-mobile WEB sites or special Windows applications.  Also, the installed Android Apps operate well in the Samsung environment, everything from calculators, music, YouTube, to shopping like Amazon work reliably as expected.  I really like the fixed position cancel, home and menu keys at the bottom. They are not part of the display in a known position no matter how the tablet is oriented. The only issue is the raised home button isn't as responsive as I would hope.  I don't know if that is hardware or software.  In most cases it works just fine.I added a 64GB SDHC card and have all my music, pictures, and quick reference Word & PDF documents instantly available.  I keep this tablet close to me all day.  One other thing, I rarely run out of battery power by the end of the day even though I use it almost constantly.", "Date": "March 17, 2014"}, {"Title": "Samsung Galaxy Tab 3", "Author": "marylou ovaska", "ReviewID": "R3AUATS29W0Q55", "Overall": "5.0", "Content": "This product is excellent. I love it..Used for many different tasks. I chose this product because i heard it was the best out there", "Date": "March 15, 2014"}, {"Title": "Fantastic tablet", "Author": "Richard W.", "ReviewID": "RRN6ZAPY1GPK6", "Overall": "5.0", "Content": "This item is a Samsung, so it obviously works great.  The ease of use and response of this unit is fantastic.", "Date": "March 14, 2014"}, {"Title": "love it", "Author": "Kalena Graham", "ReviewID": "R27DWBWGVMJP2O", "Overall": "5.0", "Content": "Did a lot of research not knowing much about tablets. I have the Samsung family and it melds perfectly into it. It nice to just open it and get to what I need. I put Google drive on it for school and it's so much quicker than getting on my computer. And much easier to take to work.", "Date": "March 14, 2014"}, {"Title": "Love it!", "Author": "adrienne wise", "ReviewID": "R3GV4LUWQ3KQGX", "Overall": "5.0", "Content": "I absolutely love this tablet! I wanted something I could place in my purse but yet big enough to enjoy. I use everyday for the majority of my internet usage. I watch movies on it from Netflix and the resolution is great. I've received compliments from IPad users who feel they have over paid for the same quality. I highly recommend this tablet.", "Date": "February 28, 2014"}, {"Title": "Awesome", "Author": "Charlotte", "ReviewID": "R3240M42HRWJ2I", "Overall": "5.0", "Content": "This was a gift for my granddaughter to replace her galaxy 7 inch that took a beating. Her response was awesome Grammy !! She loves the size and the capabilities for surfing the web and for mobile apps.", "Date": "February 26, 2014"}, {"Title": "Excellent Tablet", "Author": "Kris", "ReviewID": "R85DZVMH4KLKU", "Overall": "5.0", "Content": "This tablet is a great little machine, Easy to use, large screen, great resolution. At times will get slow, but I've found this is because it keeps any program running that you open (so once i figured out how to close them im good). Use it for all kinds of school work: MATLAB, PDF's, sending/receiving documents, email, and some note taking. The response time for note taking (even with a stylus) is not as good so its very hard to write with. Also recently have had trouble with plugging in to charge, the pin connector gets jammed. Overall still a great tablet.", "Date": "February 25, 2014"}, {"Title": "love it", "Author": "Berchman Pinn Jr", "ReviewID": "R1D4VET2B6D8GZ", "Overall": "5.0", "Content": "Loving it !!!!!!!!!! Truly the best tablet I ever purchesd !!!!!!!!!!!! This is something that I deffenitly would recomend to anybody", "Date": "February 24, 2014"}, {"Title": "Light and perfect size", "Author": "Kristin Donald", "ReviewID": "R1YC98TGWFMA2A", "Overall": "5.0", "Content": "I bought this for my husband and when we got it we could not believe the picture and its size (width). I would recommend this tablet.", "Date": "February 24, 2014"}, {"Title": "Love it!!!!", "Author": "angie", "ReviewID": "R1IDXQW19UUNHM", "Overall": "5.0", "Content": "Perfect. Worth the splurge. I use it everyday and I've had it for around 4 months and its never given me any trouble. The volume of the speakers is great, my apps have never frozen and its the perfect size! The battery life is amazing totally what it says in the product details. I hope it lasts me a long time and when I buy a new one im going Samsung again definately.", "Date": "February 22, 2014"}, {"Title": "Owner of Apple and Samsung Products", "Author": "Amazon Customer", "ReviewID": "R1MV8P1DJ5MY8F", "Overall": "5.0", "Content": "I recently purchased a Samsung Smart TV they gave me $170 off for a Samsung Galaxy Tab 3 8.0 - so my net cost was $130 (I also own a Samsung galaxy note 2) love their products. The size of this tablet is awesome I wish they will upgrade to Android 4.3 or 4.4 soon! Highly recommend this perfect size tablet it's very fast and fluid!", "Date": "February 20, 2014"}, {"Title": "BETTER THAN THE \"A\" BRAND", "Author": "FASV \"FASV\"", "ReviewID": "R17CBLEQR9P3GK", "Overall": "5.0", "Content": "THIS IS MY FIRST TABLET. I LIKE IT BECAUSE IS SMALL, LIGHT, THIN, HAS AN INCREDIBLE HD SCREEN AND MORE IMPORTANTLY IS 1/2 PRICE THAN THE \"A\" BRAND. VERY EASY AND INTUITIVE TO OPERATE. EVEN WITHOUT ANY EXPERIENCE WITH TABLETS ANYONE CAN  USE IT IN A FEW MINUTES.", "Date": "February 18, 2014"}, {"Title": "Fantastic item", "Author": "R. Martinetto", "ReviewID": "R1SQVHOIPJKNQ5", "Overall": "5.0", "Content": "It's a fantastic product. Grate screen resolution, good memory (I expanded it with an 32 GB micro card). Perfect size. Good battery life and PERFECT for travellers.And the prize was even better. I love it.", "Date": "February 17, 2014"}, {"Title": "Samsung Galaxy Tab", "Author": "Uana Wilson", "ReviewID": "R2WXCURCF4GU0L", "Overall": "5.0", "Content": "I'm very please with my Samsung GalaxyTab I still have a lot to learn about it,  It's easy to learn but didn't realize how much fun you can have learning all the different apps to play with.", "Date": "February 17, 2014"}, {"Title": "Love it", "Author": "Francisco Flores", "ReviewID": "R333ZBJTCIDHT0", "Overall": "5.0", "Content": "This samsung tablet is amazing. For the price it does much more than the ipad. Got it as a gift and my gf doesn't put it down.", "Date": "February 16, 2014"}, {"Title": "great tablet", "Author": "Carol Higgins", "ReviewID": "R26Q1X9T06YRP5", "Overall": "5.0", "Content": "Christmas gift for my husband. H had wanted an iPad but now really loves his Galaxy. Fast, easy to use with great options and functions", "Date": "February 14, 2014"}, {"Title": "I like it!", "Author": "Laurennecole", "ReviewID": "R3R442T5MZG1BI", "Overall": "4.0", "Content": "Debated on getting the bigger screen but this one does fine. Great for what I use it for! Good purchase!", "Date": "February 14, 2014"}, {"Title": "This is amazing", "Author": "progolfer_20", "ReviewID": "RBS9YYY7E56MF", "Overall": "5.0", "Content": "I have been converting over from Apple and love the perfect size of the 8\" tab. I plan on using it for movies for my kids by putting a permanent mounting system in my Toyota FJ with some Ram mounts and arms; also it does have GPS and GLONAS which I plan on using for running various mapping software for my off road trail runs. The camera isn't that great but it works.", "Date": "February 14, 2014"}, {"Title": "Samsung Galaxy Tab 3 8 inch", "Author": "Lauri", "ReviewID": "R29I6O7B8X5Y7N", "Overall": "5.0", "Content": "This is a great gift for yourself or others, its very responsive. This was a Christmas gift, and was a big hit", "Date": "February 14, 2014"}, {"Title": "Great tablet", "Author": "Tom", "ReviewID": "R1F4OUAONAEIM1", "Overall": "4.0", "Content": "Great tablet, other than the fact that it could use a flash. Also, what's up with not being able to charge it on an airplane where all other devices can be charged? Other than that, great piece of tech.", "Date": "February 12, 2014"}, {"Title": "Loving My Tablet", "Author": "tracy jenkins", "ReviewID": "RTVYG9LXVSC0X", "Overall": "5.0", "Content": "I have been wanting a tablet since Christmas but could never decide on which one until I started reading the reviews.  I contacted the Amazon team and asked that this tablet be delivered on a certain day and guess what-they did exactly that. I have loved it since I received it. Today makes a week and I'm still adding apps.  Very pleased customer.", "Date": "February 12, 2014"}, {"Title": "Samsung Galaxy Tab 8.0", "Author": "Diana \"Crystola\"", "ReviewID": "R2NXKT2RXE0U7R", "Overall": "5.0", "Content": "this is my third generation tablet. And Samsung has increasingly made each one more efficient. I really like this tablet the size and the processing speed is really much better then the 7 inch.I receive the tablet in perfect shape on time and the cost was very reasonable.", "Date": "February 12, 2014"}, {"Title": "Wow", "Author": "Charles Mauldin", "ReviewID": "R3LHZKR2ONBPKF", "Overall": "5.0", "Content": "This tablet is awesome. I have the Galaxy S III phone and this a great team. Samsung nailed it. I could not be happier. The service and I got it very quick. Buy one!", "Date": "February 12, 2014"}, {"Title": "awesome", "Author": "jhon ampuero", "ReviewID": "R18T29L251IEO6", "Overall": "5.0", "Content": "It is really really nice it came sealed, well packed and arrived very quickly so im very happy with the tab no regrets", "Date": "February 11, 2014"}, {"Title": "just what I wanted", "Author": "R. robison", "ReviewID": "R1G962Z30K92OS", "Overall": "4.0", "Content": "Very fadt delivery brand new quality and it does everything I want only wished that in standby mode the battery lasted longer.", "Date": "February 10, 2014"}, {"Title": "Very Nice", "Author": "Mike", "ReviewID": "R2E6UKFT2IK41E", "Overall": "5.0", "Content": "Bought this for myself for xmas. I love it, very very nice product, fast , good games, great for wifi easy set up wished they would send out a instruction booklet with it . Great for wifi and connects very easily, great price throuigh amazon", "Date": "February 1, 2014"}, {"Title": "just love it.", "Author": "chun zhang", "ReviewID": "RUF3W0KRTG5R5", "Overall": "5.0", "Content": "This product is really works well. like my htc table. Easy to download apps and run any programs.it's thin cool.", "Date": "February 1, 2014"}, {"Title": "Love this tablet!!!!!!", "Author": "Brianna Lebkey", "ReviewID": "R2Q8XUM13HBT0C", "Overall": "5.0", "Content": "This tablet is very easy to use especially if you already have a galaxy phone this will be a piece of cake for you to use.The battery life is great im very pleased. Very good screen size not to big not to small just perfect. I also suggest that you order a case on Amazon because I've looked in a lot of stores and have not been able to find a case that is maid for the Samsung Galaxy 3 tablet mostly cases for the iPads .there are some cases that say they fit and 8in tablet but i wouldent risk it .I bought one from Amazon and it fits perfectly.", "Date": "January 31, 2014"}, {"Title": "Easy to view, easy to use.", "Author": "Robert J. Nielsen", "ReviewID": "RN4W3NLD9ICXH", "Overall": "5.0", "Content": "Just the right size and weight for what I want to use it for. Good size keyboard for large fingers.", "Date": "January 27, 2014"}, {"Title": "Recommended...", "Author": "Crystal Williams", "ReviewID": "R1HETGABXKGRK", "Overall": "5.0", "Content": "The tablet has many things to explore, very good apps, excellent clarity and very good camera. Very addictive and enjoyable.", "Date": "January 25, 2014"}, {"Title": "Perfect for my needs", "Author": "ARL", "ReviewID": "R3IDOUSKT6SRQQ", "Overall": "5.0", "Content": "The reason why i bought this is due to my work and personal needs and found that this device is perfect for my need. The OS is smooth. 6 days shipping from WA to Guam is really fast for me. Price is also reasonable. Size is good,not so small and not so big. This is an amazing device, I love this very much.", "Date": "January 24, 2014"}, {"Title": "Wonderful Tablet!!", "Author": "Amazon Customer", "ReviewID": "R23WKH5EHK6FYN", "Overall": "5.0", "Content": "I got this tablet as a Christmas present and it's wonderful. The screen is very clear and the camera quality is perfect.", "Date": "January 21, 2014"}, {"Title": "satisfied with my purchase/Until now", "Author": "Jae", "ReviewID": "RXPL26PVJU283", "Overall": "2.0", "Content": "I received this in December. I bought it mainly for reading because I was running out of space to keep books. I have not had a single problem with it. I can watch videos, read, check my email, browse. I don't regret the purchase._______________________________________________________UpdateAbout a month ago I tried charging the tab but there was no indication that power was reaching the device. I changed the charger a couple times and tried changing the charging source from the electrical outlet on the wall to the PC via a USB cord. I restarted it, this did not work either. I tried 'googling' the problem and after two or three words google had auto-completed the problem.....I wasn't the only one having the same issue with a Samsung device. I saw and tried several fixes. The one that eventually worked was re-setting the device - which annoyed me because I had to wait for all the apps to be re-installed. This I had to make sure was done while I had a wifi connection in order for me to access my offline apps when I am not able to receive a wifi connection.After thinking that the problem was solved, it happened a week later. I did the same re-set and it worked, again. After a little over another week, it happened again, except this time the re-set didn't work. I found another fix online that recommended holding down the power+volume buttons at the said simultaneously. I have had to do that about 3 times since the first fix stop responding. Holding down the buttons have been working so far. But sometimes I think the speed at which it is charged moves a bit slow.It's such a shame that I have to downgrade my 5 star rating because I really like the look, feel and operation of the device. But a faulty charging issue is way past annoying to say the least..it's poor. I gave it 2 stars because 3 stars means 'it's OK' and it's not.", "Date": "January 20, 2014"}, {"Title": "Great overall tablet!", "Author": "Mingus Mt Acadamy", "ReviewID": "R2DRQVQ8BTPV50", "Overall": "5.0", "Content": "Works great! I love watching movies and renting them on Google Play. The size is perfect for travel. Great product!", "Date": "January 18, 2014"}, {"Title": "Bought this for my mom and she loves it!", "Author": "Daniele", "ReviewID": "R86WQB9YHZEH8", "Overall": "5.0", "Content": "Bought this for my mom and she loves it! It's been easy for her to use and figure out. She lives that you can expand the memory.", "Date": "January 12, 2014"}, {"Title": "good tablet", "Author": "R. Barrish", "ReviewID": "R35XJO1TZ834A3", "Overall": "5.0", "Content": "goat this, December I am using this now for this review I'm really  satisfied with it?would recommend it to other people.", "Date": "January 12, 2014"}, {"Title": "glad", "Author": "Leslie Lewis", "ReviewID": "R1KYVKUVC9MAUG", "Overall": "5.0", "Content": "I am glad that I purchased it was not sure what to expect but I am happy with my purchase", "Date": "January 10, 2014"}, {"Title": "Great Value for the Price", "Author": "Get-A-Geek", "ReviewID": "R2AC31DK9UOD2E", "Overall": "5.0", "Content": "This is a great tablet for the price.  I replaced my Nexus 7 for this device mainly due to the fact it does have a SD slot which I find important.  I did try the Dell Venue Pro 8, however it was not suited for my needs.Samsung does seem to over do things a bit with the skinning of the unit, but it does perform well.  One nice bonus with the unit is the universal remote feature.  Not that it is a must have for me I do find that I like it.", "Date": "January 9, 2014"}, {"Title": "Great Buy!", "Author": "Anthony Paternoster", "ReviewID": "RCHCDZUSXTL08", "Overall": "5.0", "Content": "Great buy for the money, went back and forth between this and the 7 inch, couldn't be happier, worth the money!", "Date": "January 9, 2014"}, {"Title": "l am the happy owner of the Samsung tab3 8 inch Tablet", "Author": "Felix Lewis", "ReviewID": "R3HUT94M3B8G4E", "Overall": "4.0", "Content": "I recently purchased this device and I have since parked my lap top at home. Mosft of what I ussd the laptop at home for can be done effectively and effeciently on the tablet. The device is powerful and very easy to travel with. As someone who travels quite a lot (airtravel) this device is the right size. Very convenient without compromising power and capacity.", "Date": "January 3, 2014"}, {"Title": "Samsung Galaxy Tab3", "Author": "barbara Huggins", "ReviewID": "R361YJOI8MHWST", "Overall": "5.0", "Content": "Love my new tablet.Very user friendly, which is good for a novice like me.All my friends are jealous!", "Date": "January 3, 2014"}, {"Title": "Great service, Great Product", "Author": "Troy Illum", "ReviewID": "RSX75LGX8XE2M", "Overall": "5.0", "Content": "Delivery was fast and the product has been working great over the last couple of weeks.  This was a perfect gift/price point for a tablet for my 12 year old.", "Date": "January 3, 2014"}, {"Title": "Loved it", "Author": "Kendall Thomas", "ReviewID": "R16V65GI8RGXNT", "Overall": "5.0", "Content": "Bought it for my wife for Christmas 2013 and it was the perfect gift we both love it excellent device", "Date": "January 3, 2014"}, {"Title": "wonderful tablet", "Author": "Becca", "ReviewID": "R2HPYV1614BQLN", "Overall": "5.0", "Content": "This samsung tablet 3 works great! I have had no problems with it since i have had it. I would recommend this tablet to anyone.", "Date": "January 3, 2014"}, {"Title": "Great product", "Author": "Paul", "ReviewID": "R2RYOQKNXCSKJA", "Overall": "5.0", "Content": "It was as described , Works well and light weight . There is no lagging or speed issue and google play has as many apps as apple", "Date": "January 3, 2014"}, {"Title": "galaxy tab", "Author": "Dawn", "ReviewID": "R1UKAA1UYNHVS7", "Overall": "5.0", "Content": "it speaks for itself Nice item for the moneyThe tablet is great love itwould recommend to friends and families", "Date": "January 3, 2014"}, {"Title": "love it", "Author": "jimmy szamski", "ReviewID": "R162EJ3AY9WFM4", "Overall": "5.0", "Content": "Only have had it for a month and so far it has been absolutely great. I have an IPhone and the samsung works perfect. The App Store is great and the picture quality is awesome.", "Date": "January 2, 2014"}, {"Title": "Better than iPad", "Author": "eec", "ReviewID": "RGNWE7O9VWWW2", "Overall": "5.0", "Content": "I've had this for quite some time now and I still love it. Its so easy to use and the size is perfect. The screen is sharp and bright. I must admit there is some slight lag sometimes with some of the larger gaming apps but its ok, considering I didn't shell out $500 for it like I would've for an iPad that small lag doesn't bother me at all and I'm a techie so lags usually annoy me. My favorite feature is the multi window on this and the free Office type app Polaris. The size is perfect not too small like the 7\" and not too big like a 10\".", "Date": "January 2, 2014"}, {"Title": "The best for the money", "Author": "Rclark", "ReviewID": "R24321V997V0D4", "Overall": "5.0", "Content": "My husband and I have Samsung Galaxy phones so this was perfect for us to have.  It is basically identical to the phone without the ... phone.  I mainly am going to use it for school, but it was super handy to download a couple of movies to for my children to watch on the road during the Christmas traveling.  The screen is super clear.  It gets great WiFi reception - better than my phone did, it seemed at times.  For the money, you can't beat it.  I thought about getting the new Kindle Fire HDX and decided not to because of all of the limitations compared to the Sam GTab.  LOVE IT!!  Very happy about my purchase.", "Date": "January 1, 2014"}, {"Title": "Great Christmas Present", "Author": "linda", "ReviewID": "R1GXPMW2F1KE4K", "Overall": "5.0", "Content": "Bought it for my son and he loves it. Was easy to set up and now he has lots of movies and music on it.  Size is easy to use and carry around.  Was very pleased with his gift.", "Date": "January 1, 2014"}, {"Title": "Great Beginner's Tablet", "Author": "Alex Ortiz", "ReviewID": "R2X3FUA8KB8RKP", "Overall": "5.0", "Content": "The tablets size is perfect for getting things done, multitasking works withoutlag as long as you're not using the keyboard on top of 2 apps. The dual core has played every game with little to no lag.The tab 3 is not a \"powerhouse\" tablet like the note 8 or note 10 but fairs well for day to day usage.Good battery life, easy to use and lightweight.", "Date": "December 31, 2013"}, {"Title": "i love it!", "Author": "I love reading", "ReviewID": "R3K7BVF5R5WFPO", "Overall": "5.0", "Content": "I am 45 years old and the larger screen size is a definite plus for me.  I also love the colour...the white is very attractive. The  display is absolutely amazing...you should see my photos and videos!  My daughter has a tab 2 and my son has a tab 3 but both are 7 inch... I think mine is the best!  If you can afford it, buy the 8 inch... the camera is better, it has more memory, and its easier on your eyes.", "Date": "December 31, 2013"}, {"Title": "Merry Christmas to me!", "Author": "Richard Rogers", "ReviewID": "R1WP2U8Z2L4A5O", "Overall": "4.0", "Content": "Great tablet! I highly recommend it. Mine however seems to have a problem with the automatic brightness; when enabled, the LCD screen brightness remains at a low level as if the ambient light is always very low. I haven't contacted Samsung about this yet. For now, I just manually set the brightness.", "Date": "December 31, 2013"}, {"Title": "super tablet", "Author": "Amazon Customer", "ReviewID": "R2V8L664YFMLIK", "Overall": "5.0", "Content": "Very pleased with tablet. Big enough for Netflix streaming good sound.Many things can be done with tablet, sadly the enclosed instruction bookletnot very helpful. Unable to register tried several times. Due to that unable toreceive the bonuses given for purchase.Now that I finished my poor me's, this is worth the purchase. If your looking for a Tablet and8.0 screen suits you this is a good one.", "Date": "December 31, 2013"}, {"Title": "Great so far", "Author": "Janelle Pierre", "ReviewID": "RUDWKA0V35Y71", "Overall": "5.0", "Content": "Great so far, no problems, its a sleek well made device. My son got it for Christmas so am hoping it pleases him.", "Date": "December 27, 2013"}, {"Title": "Great!", "Author": "DesiPallo", "ReviewID": "R1ZK8KZ0JXDQV7", "Overall": "5.0", "Content": "I just love it so much! It is the perfect tablet, not too small, not too big, enough memory, pretty and useful!", "Date": "December 27, 2013"}, {"Title": "Great tablet.", "Author": "dlp", "ReviewID": "R2K2OTVAKUJ6RP", "Overall": "5.0", "Content": "This was a gift, but I liked the look and feel of it after he opened it.  He seemed to like it too.  :)", "Date": "December 27, 2013"}, {"Title": "Very good tablet....not updated OS 4.4.2", "Author": "Khalil N. Canady \"Khalil N. Canady\"", "ReviewID": "R46MRRSN6NVZR", "Overall": "4.0", "Content": "I like Samsung products.... But it is the OS that I want. Although Samsung was up to 4.2 OS, Google Nexus not as sophisticated but has the latest OS 4.4.2 and less money.Would recommend highly...", "Date": "December 26, 2013"}, {"Title": "my christmas present to me", "Author": "Korkie Bullard", "ReviewID": "ROWN6N0FH1SAW", "Overall": "5.0", "Content": "I love my tablet!! The perks they give with it are kind of bogus but other than that I am in love.  Fast, smart, handy, just overall amazing. I have been playing with it for a few hours and the battery is still in the green. Holds a better charge than my phone. I love the TV controls,  they are just so cool. My remote can't even do all the things that one app can.", "Date": "December 24, 2013"}, {"Title": "Fantastic tablet!", "Author": "Kathryn", "ReviewID": "R2FCXLE41LBM65", "Overall": "5.0", "Content": "FAST, slim, light-weight, and does so many things that I don't have the time or room to discuss!  I'm glad I sold my Best Buy Ensignia tablet, and bought this one; no comparison.", "Date": "December 23, 2013"}, {"Title": "Excelent Galaxy Tab 3", "Author": "Roberto Jerez", "ReviewID": "R3GBS5QMA2VBSM", "Overall": "5.0", "Content": "The Samsung Galaxy Tab 3 - 8\" was the best choice for my kids, for their school homework and great quality.", "Date": "December 21, 2013"}, {"Title": "Great Tablet especially if you have Samsung S Cell Phone", "Author": "R. Hammons", "ReviewID": "R3L8TJ9AWLHQ0W", "Overall": "5.0", "Content": "Excellent Tablet, and the 8 inch is 30 percent larger screen that the 7 inch but smaller that the 10 inch to fit in your hand.  Have a Samsung cell S3 and great match up.  Lost of compatibility and apps transferred easily including the ones I had paid for on my S3.  Because it is so similar, there is almost no learning curve, only bigger display.", "Date": "December 15, 2013"}, {"Title": "In love with my new baby!!!", "Author": "NaiNai", "ReviewID": "R39JLY829GJA6Z", "Overall": "5.0", "Content": "My awesome bf got the S4 for my bday and for xmas got this great tab, I've been using it for school all the time , super fast,  works just like my phone, no problems with wifi, perfect size.... to me it works perfectly!!!! Very good pictures with both cameras too!!♡", "Date": "December 15, 2013"}, {"Title": "best tablet for android samsung phone users!!!", "Author": "Amazon Customer", "ReviewID": "R1H4OR7PMFDR6G", "Overall": "5.0", "Content": "This tablet is like having huge samsung galaxy s 3 phoneSmooth, fast, and best of all outstanding GPS performanceA+++", "Date": "December 15, 2013"}, {"Title": "headphone jack DOA otherwise great", "Author": "Amazon Customer", "ReviewID": "R2TUJ873SUJ49I", "Overall": "3.0", "Content": "I had this for a few days all worked great, was very happy w/ my purchase but then I went to view a video and use headphones. The headphone jack did not work at all, had to return it after wasting all that time setting up email accounts, and various other accounts, ugh hate wasting time! I would have given this tablet all of 5 stars had it not been for that, I was afraid to replace with the same.", "Date": "December 15, 2013"}, {"Title": "LOVE THIS TABLET!!!", "Author": "PharNaWay \"Reme\"", "ReviewID": "RBP40PAJ0M5IJ", "Overall": "5.0", "Content": "It's beautiful, easy to use, the display is fantastic, and the price is so much more reasonable than other tablets in its class. I'm considering purchasing one for my grown son. Well, it will be either the Galaxy Tab 3 or the Galaxy Mega cell phone. I have both in white with white cases and I love using each and both. With the Mega, I probably don't need the Tab 3 but I want both. The cell phone has a monthly charge attached for services as all cell phones have. Can't make calls with the Tab 3? There is Skype and video chats. The Mega has a 6.3\" screen which is fantastic. Large for a cell phone but although I'm on the small side with small hands, it doesn't pose any problems for me. I always use a bluetooth headset anyway. So I say...Buy the Tab 3 and/or the Mega. You will not be sorry in the least.", "Date": "December 15, 2013"}, {"Title": "Excellent purchase!", "Author": "Kristopher Rattansingh", "ReviewID": "R1SNOI5KRJC5W7", "Overall": "5.0", "Content": "Perfect tablet! Better than anything Apple can offer. Excellent functionality, no restrictions and the ability to get around any obstacle with more than enough resources.", "Date": "December 12, 2013"}, {"Title": "greatt", "Author": "mike", "ReviewID": "R3TJSX7FHY0WM1", "Overall": "5.0", "Content": "amazing tablet love it fun big great to play on vut still don't know how to download music from computer to tablet but overall its amazing", "Date": "December 12, 2013"}, {"Title": "great tablet", "Author": "Lynda Colwell", "ReviewID": "R1M40I10692S5O", "Overall": "5.0", "Content": "I really love my Samsung Galaxy Tab3. The 8 inch size is really good because it's bigger than the 7 inch and smaller than the 10 inch, so is easy to handle, easy to use, easy to read. The battery life is good also. I can work most of the day before recharging.", "Date": "December 12, 2013"}, {"Title": "Galaxy Tab 3 8\"", "Author": "BALLS803", "ReviewID": "RWI92K8M8C170", "Overall": "5.0", "Content": "This thing is great. I purchased it so I didn't have to use my personal computer to do my work on. Does what I need and I can also play games on it.", "Date": "December 11, 2013"}, {"Title": "Nice TABLET", "Author": "Miguel", "ReviewID": "RXVDE8RHVT6RZ", "Overall": "5.0", "Content": "Its the same color as appears on the monitor. I like it a lot ! the first day i got it everyone complimented my tablet. Its really good for connection. The only thing i wish, was that it had a little handle to wrap around my wrist. Its good and the seller shipped it here in IN in an ample amount of time.", "Date": "December 10, 2013"}, {"Title": "Great tablet...simply love it!", "Author": "Manuel Mendoza", "ReviewID": "RC3S08FKBLJU8", "Overall": "5.0", "Content": "Great tablet...simply love it! easy to use, to connect with other equipments (even my tv and cable box), great apps, the screen has a woderfull resolution, it is really good.", "Date": "December 10, 2013"}, {"Title": "I'm not using my laptop as much as I used to before this arrived.", "Author": "Lizzy Kim", "ReviewID": "R3HXCECVFKCN26", "Overall": "5.0", "Content": "I love it. I'm absolutely in love with my new tablet. The shipping was faster that I expected it and the item arrived in perfect condition. It's amazing. I have tried a few tablets before but this one is definetely the best out of them all. I'm very satisfied with my purchase.", "Date": "December 10, 2013"}, {"Title": "love it!!!", "Author": "Raajindra Charles", "ReviewID": "R2NWO3N2SLN5U0", "Overall": "5.0", "Content": "Only started using it 3 days. size is perfect not too big not to small. great camera quality. fast browsing. will definitely recommend to any one.", "Date": "December 9, 2013"}, {"Title": "Samsung is a winner in my book", "Author": "Cow", "ReviewID": "R27WKIUUD8LX8U", "Overall": "5.0", "Content": "My Hubby is very happy with his new Samsung Galaxy. I have to say that I have purchased 2 Samsung products this past month and feedback from family who items were purchased say they work great. The picture is super clear. Samsung makes really great products.", "Date": "December 8, 2013"}, {"Title": "Great tablet!", "Author": "I<3Amazon", "ReviewID": "RBSGRN7XZI3X3", "Overall": "5.0", "Content": "Fantastic. Great sound, lovely screen, comfortable for me to hold with one hand (I even have small hands.) Fun for games, great for everything like consuming media, PDFs, video chatting, social media, using apps, checking weather...and more. Perfect size, too.I simply love it.", "Date": "December 7, 2013"}, {"Title": "I love it", "Author": "Larry Hasbargen", "ReviewID": "R2N9K17FAP92FM", "Overall": "5.0", "Content": "Great tablet. Screen is clear and bright. Battery holds a charge for a long time. Easy to use. Would recommend it.", "Date": "December 7, 2013"}, {"Title": "Fantastic", "Author": "kay", "ReviewID": "R17S4DMQYR1SR0", "Overall": "5.0", "Content": "I got this for my son and now I want one. I was very impressed.Was better then my galaxy s4active phone. I love the android andthe apps that come with it. I give them a 5 on delivery as well. fantastic job.I love the tab 3  thanks now I have to get me one lol", "Date": "December 6, 2013"}, {"Title": "samsung > apple.", "Author": "Karijana", "ReviewID": "R8P5VE8ZZFQ2V", "Overall": "5.0", "Content": "Shipped in only a couple of days. Galaxy tablets and phones are such wonderful, user friendly products! I used to be an apple snob until my boyfriend bought the galaxy note then I fell in love with Samsung!", "Date": "December 6, 2013"}, {"Title": "Great tablet for education/entertainment", "Author": "Sol Jung", "ReviewID": "R24DSH6V7X2OQ6", "Overall": "5.0", "Content": "It's a very nice tablet.Sized equal to the iPad Mini, I decided to get this one since I already have a iOS device.Love it!", "Date": "December 4, 2013"}, {"Title": "Sexy tablet.", "Author": "Amazon Customer \"Today is all that you have.\"", "ReviewID": "RR3F05KXBF1GD", "Overall": "5.0", "Content": "I love my Galaxy Tab 3. I had bought a google Nexus 7 and was happy with it, until I found out about the tab 3. It is luxurious and very sleek. Beautiful bronze color and just plain sexy. You cant go wrong with the tab 3.", "Date": "November 30, 2013"}, {"Title": "Love my tablet", "Author": "mparmy98", "ReviewID": "R26U4AFCXZQGXL", "Overall": "5.0", "Content": "Excellent tablet.  Fast, easy to set up and just as easy to use. Best on the market, beats iPad in my mind.", "Date": "November 27, 2013"}, {"Title": "Awesome value!", "Author": "Amazon Customer", "ReviewID": "RL5LUT6PR18IS", "Overall": "5.0", "Content": "This was a \"used\" tablet from Amazon Warehouse, but like everything else from them, the tablet was in new condition. The box had been opened, but that was all. This is a great way to save money. The tablet is awesome with a nice size screen and easy to use features. I am super happy with this purchase", "Date": "November 26, 2013"}, {"Title": "It's a very nice product!", "Author": "Luis Enderle", "ReviewID": "R1TU9ZCIKMPA4A", "Overall": "5.0", "Content": "Fast, Light, with an excellent size. Samsung's features are nice and useful. battery life is good. I have used it as GPS in a rental car in my last trip and it works perfectly without internet connection, speakers volume is louder than other tablets, I think.", "Date": "November 26, 2013"}, {"Title": "Very Good unit", "Author": "Aaron Madden", "ReviewID": "RHJOD3NBE21UG", "Overall": "5.0", "Content": "Very happy with this Tab 3. I bought Tab 1 when it was released and worked great. It was time to upgrade and bought this and very impressed with the improvements.", "Date": "November 5, 2013"}, {"Title": "Excellent Tablet!", "Author": "djloki05", "ReviewID": "R2Y7I7ZZ47PBYW", "Overall": "5.0", "Content": "perfect size! not too big, not too small. beautiful resolution! fast processor, great multitasking! easy user interface. great product - it's a must have!", "Date": "November 4, 2013"}, {"Title": "love my tablet", "Author": "Amazon Customer \"mgypsy62\"", "ReviewID": "R1GONTH7VXJ6BG", "Overall": "5.0", "Content": "I love it, even tho I had to buy a car and screen protectors and insurance!  Highly rec downloading a Swype program tho.  I bought a wireless keyboard because I don't like virtual ones, but am so used to Swype on my phone...couldn't go back to a keyboard.", "Date": "November 2, 2013"}, {"Title": "I'm glad I made the right choice!", "Author": "Josephine L. Libunao", "ReviewID": "R2K22WO7MGYPNV", "Overall": "5.0", "Content": "Buying this Samsung tab 3 8.0 in brown and gold was the best purchase I made online! I am extremely happy with its excellent features, fast processor,  and very sleek design. Great job Samsung! You are awesome!", "Date": "November 1, 2013"}, {"Title": "Best tablet around!", "Author": "DD", "ReviewID": "R1U0HHQLNOBIAT", "Overall": "5.0", "Content": "I did a lot of searching (and test driving) before getting the Samsung Galaxy Tab 3 (8\"). My 89 year young Mom has the 10\" and loves it...she is so cute...she reads books from the library all the time and gets on utube, facebook and does her gmail...great for her age or any age...and the Samsung tablet makes it all so easy! My sister has the 7\" that she carries in her purse to keep in touch with all her followers (smile). I found the 8\" best for me because I read books, play cards, do eBay, Facebook, search and shop. Great tablet and I would recommend to everyone!PS:  The battery life is great...much better than a tablet laptop!", "Date": "October 26, 2013"}, {"Title": "LOVE", "Author": "D. de Gannes \"Dilly\"", "ReviewID": "R3I00MQUKEMRDX", "Overall": "5.0", "Content": "I love my Tab - Samsun have outdone themselves once again - this purchase was a gift to myself I love it and would recommend it to anyone looking for a Tab with some exceptionally great features", "Date": "October 22, 2013"}, {"Title": "I am still learning the system", "Author": "Honest Review \"Honest Review\"", "ReviewID": "RTV3VK8MXYI54", "Overall": "4.0", "Content": "I am still learning the system -- I downloaded most of the manual (188 pages) so I could read about all that it does. I am currently not fond of the book marks -- as I like the drop down list like on the computers -- so I am trying to learn how best manage that as well as importing my book marks from Chrome as you can not import from IE", "Date": "October 20, 2013"}, {"Title": "love my SGT3!!", "Author": "Ro", "ReviewID": "R1QIYHFR8JPRZO", "Overall": "5.0", "Content": "I love my SGT3 8!!! So glad I got it.Perfect size! Brown gold color is classy & sleek. Beautiful screen display. It is super fast.You can't go wrong with this purchase; moku cover & invellop screen/glare protectors top off the product! Hats off to Samsung!!!", "Date": "October 20, 2013"}, {"Title": "Good tablet", "Author": "robert murphy", "ReviewID": "R3VLP1M1SCH0DC", "Overall": "5.0", "Content": "Had problems with registering it something with it not being scanned somewhere but after pictures to samsung they fixed it quick and ever since then it is a great tablet the speed is good no problems with it", "Date": "October 17, 2013"}, {"Title": "Very nice 7-8'' solution", "Author": "gsisson", "ReviewID": "R3AM80VD7CD0Z6", "Overall": "5.0", "Content": "Used to have an ASUS eee pad transformer which I liked very much. Chose this one as a 7-8'' solution. I'm very satisfied with the hardware, weight and looks of this tablet.", "Date": "October 15, 2013"}, {"Title": "great tablet", "Author": "Amazon Customer", "ReviewID": "R42F3RPFUGBRF", "Overall": "5.0", "Content": "I first bought Samsung Galaxy Tab 2 7.0 but now I wanted a bigger one so I got Galaxy Tab 3 8.0. Not to small, not to big, great for me. I really like it. It works great.", "Date": "October 15, 2013"}, {"Title": "galaxy tab 3 8 ln. review.", "Author": "luis m. guzman", "ReviewID": "R1WP4QL5VJB0TG", "Overall": "4.0", "Content": "Liked the fact that memory can be  expanded.  All other features are excellent. Don't like the messages that pop up atany moment and freeze the screen even while watching videos/movies.", "Date": "October 12, 2013"}, {"Title": "Love my Samsung Galaxy Tab 3", "Author": "Amazon Customer", "ReviewID": "R2NHWAFPKWY7RE", "Overall": "5.0", "Content": "Because I love it. I am having so much fun with it. It is the perfect size for me. I think the 10\" would have been too big.", "Date": "October 10, 2013"}, {"Title": "Tablet", "Author": "Lynne Shaw", "ReviewID": "RZLBWYRSHJY2Q", "Overall": "4.0", "Content": "This was agift for my daughter, and it was hard to get to some apps for updating, but other than that she seams happy with it.", "Date": "October 4, 2013"}, {"Title": "Samsung Galaxy Tab 3", "Author": "Alene Hubbard", "ReviewID": "R28YDV8P0LQE49", "Overall": "5.0", "Content": "I am in love with the Samsung galaxy tablet 3.  It is just the right size and easy to search things in.  If you are looking for a  tablet at a good price try this one.", "Date": "October 3, 2013"}, {"Title": "Samsung Galaxy Tab (8-inch White)", "Author": "Virginia Borner", "ReviewID": "R32JNM1MLBZJ", "Overall": "5.0", "Content": "It was priced right.  I have told many of friends about it and would highly recommend it.  It's very easy to navigate and the battery  last a long time before having to recharge it.", "Date": "October 2, 2013"}, {"Title": "Great tablet, excellent price!", "Author": "Arlyn", "ReviewID": "R3IX02T17V9UGX", "Overall": "5.0", "Content": "I researched a good bit before making a decision on a tablet and I'm very pleased with the Samsung Galaxy Tab 3!  I was concerned about learning how to use it since I have and am used to the format on the Iphone, but it was not hard at all to get the hang of it.  Great product!", "Date": "October 2, 2013"}, {"Title": "Wow", "Author": "Grubby", "ReviewID": "R1EOFMKHD569NY", "Overall": "5.0", "Content": "All it said to be and more.  Just as good quick fast as any othdrs proclaim.  Can't put it dowm  great for reading emails presentation notes pictures  name it it does it.  A perfect buy - Samsung  is top notch!", "Date": "October 2, 2013"}, {"Title": "Rocks", "Author": "Kevin J. Hickson \"kevin j hickson\"", "ReviewID": "RNMX1T84XGIVC", "Overall": "5.0", "Content": "The Samsung Tab3 is probably one if not the best tablets around. Very well priced and very well packed with features.The display is crisp and not color shopped.Colors are true.Very good consumer settings.Pack it with a 64gig micro sd/card and you can store plenty.", "Date": "September 28, 2013"}, {"Title": "Love It", "Author": "Joanne Anderson Schultz", "ReviewID": "RHAK1IP3HBW79", "Overall": "5.0", "Content": "I received the Samsung Tablet as a gift and I just love it. I am not a cell phone user and felt I had no need for this, but I was wrong.  Works superbly.", "Date": "September 27, 2013"}, {"Title": "Good tablet for the money!", "Author": "Cory Purcell", "ReviewID": "R2CNR45T9YTMTJ", "Overall": "4.0", "Content": "It does just about everything that I can do on my laptop,  good battery life, takes decent pictures, and when I can't find the remote it does that too, I am happy with it!", "Date": "January 4, 2014"}, {"Title": "Overall a very nice tablet", "Author": "Sounds", "ReviewID": "R3QKANC352638W", "Overall": "4.0", "Content": "UPDATE 2/1/14: I'm knocking my rating down a half star due to a persistent problem with the Tab losing Wifi connectivity. I have a strong WiFi signal throughout my house and no issues with any other WiFi enabled device, only the Tab. Sometimes I have to retype the WiFi password even though I've entered in multiple times before. I've contacted Samsung to see if there a known fix. I'll update my review one way or the other.----------------------------------------------------------------------------------Nice size and graphics are very good. I choose this one for its size and also that it has an expansion slot for micro cards. My negatives are that without a cover, its a bit touchy, easy to hit a button or change orientation. With a cover, holding in my left hand, its perfect.I wish I could move apps to an SD card to make more room, but so far not a big issue.Overall I'm pleased with my purchase.", "Date": "January 4, 2014"}, {"Title": "a gift", "Author": "Arthur Robinson", "ReviewID": "R2AD0J2MKY2M54", "Overall": "5.0", "Content": "Brought this for  my wife and she loves it, it feels light in her hand and very bright the screen. She would recommend this product, and doex sync well with her phone.", "Date": "December 25, 2013"}, {"Title": "im loving my tab", "Author": "Sally", "ReviewID": "R2FGWY4EQFEZBF", "Overall": "5.0", "Content": "Im loving my tab. 8inch is perfect for me as I prefer a larger screen versus a 7inch. Im still learning the features.  The only hiccup I encountered was not being able to download a flash player to watch videos onlline. That problem was easily remedied by downloading a different browser. Its a great tab and I love the tv remote feature ♡", "Date": "December 19, 2013"}, {"Title": "Samsung has done it again! Outstanding tablet!", "Author": "CM", "ReviewID": "RCRPFS92S82L6", "Overall": "5.0", "Content": "Look, I have used a few tablets but don't claim to be an expert or power user. Just the average guy that surfs the Net, play a couple games, check calendar, and send a few texts. But in every instance I've use this bad boy I'm impressed! Speed, ease of use, and the Google App Store makes it all worthwhile.. You will not be disappointed! (Samsung should pay me for this review :-)", "Date": "November 1, 2013"}, {"Title": "Great tablet, convert from ipad", "Author": "Cmac", "ReviewID": "R2CPRVAMTDBSQR", "Overall": "5.0", "Content": "I had the original ipad, which was performing poorly since the OS is no longer upgradeable, and as a result, many apps were not running effectively.  I decided to go to a smaller format, and was looking at the ipad mini and several android tablets.  Mostly I do a lot of reading in landscape on my tablet so I focused on the ipad and android 8 inch formats.  For a slightly older set of eyes, I thought 8\" would be more useful than smaller screen sizes.  I ended up with the Samsung because of  the screen resolution, latest version of Android, and powerful processor.  It is far faster than my old ipad, and I love the HD size screen rather than the 4:3 proportion of ipads.  In a pinch, I can put it in one of my pants pockets for carrying around, but the screen is plenty large enough for reading and using apps.  I actually really like the Samsung mail app that comes preloaded, but I do use the Chrome browser, which loads quickly and allows easy selection of desktop vs. mobile sites.  Since I'm a gmail user, the seamless integration of android works terrifically.  After 4 months of use, the only downside I see is that it doesn't co-exist with my apple tv, and battery life is compromised vs my old ipad.  I easily get a full days use on battery, but recharge every night.  My old ipad I would charge probably every third day, but such is the reality of a brighter display in a smaller form factor. Very pleased with my 8\" tab3.", "Date": "October 27, 2013"}, {"Title": "go buy it.", "Author": "bernssss", "ReviewID": "R3PYD0LEG8NQVI", "Overall": "5.0", "Content": "I have been using gal tab 2 7.0 for a while without a problem or complaints but this gal tab 3 8.0 makes my gal tab 2 look/feel/use like a ancient artifact. So much faster, thinner and the screen reaolution is just awesome. Feels like im using a giant gs4, which is my phone, and i have no complaints. It also looks beautiful.", "Date": "October 13, 2013"}, {"Title": "Galaxy Tab 3 (8-inch) review", "Author": "Sizzlechest_K", "ReviewID": "RJFUEXSTZNZSM", "Overall": "5.0", "Content": "This tablet is just what I was looking for.  I transitioned to this tablet from a Kindle Fire HD 8.9.  The Galaxy is slightly smaller than the aforementioned Fire and the I-Pad, which I also have.  It is the perfect size though.  Its small and light enough to be comfortable to hold while reading it, yet large enough to show a decent picture when watching videos.  The screen is bright and the controls are responsive.  The only slight negative is the battery while the wi-fi is on.  It drains quicker than expected, even in standby.  Other than that issue, the Galaxy tablet 8 is a great product.  If you are on the fence, give it a shot. you won't be disappointed.", "Date": "October 10, 2013"}, {"Title": "I love this Tablet", "Author": "Danny Beavers", "ReviewID": "RLR8H18GPVL1R", "Overall": "5.0", "Content": "Coming from a 10\" Toshiba (Which I loved) I was skeptical of the downgrade in size to a 8\". However after using it for a week, It is perfect.I love this tab and it has all the great features you would expect from Samsung.", "Date": "September 2, 2013"}, {"Title": "Absolutely love my tablet!!!!", "Author": "Juicypooh", "ReviewID": "RVAH2KFLSN66X", "Overall": "5.0", "Content": "I love love love my tablet only had it for a couple days and I'm hooked everything was easy to setup it's fast and I'm enjoying it thanks amazon and thanks samsung for coming out with an awesome product!!!! Oh the 10 bucks in google play credit I received  also you get three months of free Hulu plus, 50 GB storage for photos etc on the tablet that's for two years, you also receive 12 months of boingo wifi hotspot so great deals when you purchase this tablet.", "Date": "August 28, 2013"}, {"Title": "Awesome", "Author": "warren", "ReviewID": "RV3DSW9SB4OLX", "Overall": "5.0", "Content": "This is tablet is better then any other tablet you can buy including the ipad. The 8 inch screen is the perfect size for gaming, surfing the web, or for work. Even though there is only a dual core procssor it is still perfect for web browsing.This is extreamly light- weight for all it can do. With over 450,000 apps you will be able to find what you need. If you need to do alot of work on the tab 3 just purchase a keyboard and connect it to the tablet with bluetooth. I could go on and on about this tablet if I had time. So to conclude, this is the greatest tablet of all modern time.", "Date": "August 19, 2013"}, {"Title": "Samsung tablet 3 review", "Author": "Leonna Brathwaite", "ReviewID": "R5RIRNVPO0G6C", "Overall": "5.0", "Content": "I am soooooo in love with this tablet. I wasnt sure if to get the ipad but after checking other reviews and speaking to ipad users I was more persuaded to get the samsung tablet. Then I was just so happy to see the 3 was coming out that I pre ordered it (lol). It came very quickly and its a fabulous little gadget.", "Date": "August 15, 2013"}, {"Title": "way more than expected", "Author": "Jab", "ReviewID": "R36890YWA87Z1B", "Overall": "5.0", "Content": "Perfect size, great features, great battery life.  Couldn't be more pleased.  Surprised this device isn't flash capable but flash is increasingly irrelevant.", "Date": "July 30, 2013"}, {"Title": "Stunning", "Author": "Dr. XYZ", "ReviewID": "R2PNN1BU8ZRT3", "Overall": "5.0", "Content": "I can only compare this tablet to my Kindle Fire HD 7.  I did not give the Kindle a rave review as I feel the software implementation is rather poor.Now this tablet is a full Android and the functionality is impressive, especially comparing to Kindle Fire HD7,It is fast, supports full device encryption, allows a microSD .The KFHD7 does have better speakers though.No amazon prime instant streaming app available to android phones/tablets, and Adobe stopped support for mobile devices browsers. Old versions of Flash player will work for now, but the point is Amazon lacks an app for Android. Amazon is leveraging that to drive sales of Kindle. That could be a reason not to buy this tablet, however netflix works great.So the KFHD7 does not come with power charger and Amazon charges $19.95 for one and $15.00 to make the Kindle add free. Add that up and the price between this 8 inch Galaxy and the KFHD7 is pretty small. I was lured into the Kindle by price and I feel I got robbed! My child is now the sole user of the Kindle.It should be noted that no concept of \"FreeTime\" is available for this tablet. I'd still recommend the KFHD7 for youngsters. Freetime is a sloppy mess,  but a 5 year old won't know it.This tablet is SO good I WILL look at Samsung phones when my phone plan allows me to upgrade from my HORRIFIC Win7.5 phone. (tricked again by low price)GREAT WORK SAMSUNG!", "Date": "July 25, 2013"}, {"Title": "Decent device but customer service falls short", "Author": "Fizz", "ReviewID": "R27Y49A5AP33FI", "Overall": "3.0", "Content": "I've been a multi year Apple user ams used this purchase of the Samsung Galaxy tan to see if I want to make the transition over come my next phone upgrade.While I've enjoyed the overall experience,  I've had battery problems.  I'll change it for hours and it will move a few percent.  I called samsung and they directed me too a best buy to test my charger. Sometimes my tablet will charge just fine,  but the customer service rep didn't seem interested in helping me until I did that.Meanwhile with Apple I have always been treated as a valued customer and they are more than glad to get to the bottom of any issues I experience.I'm not sure I will make the jump to samsung based on my recent experience.", "Date": "February 8, 2014"}, {"Title": "Dissappointed", "Author": "TALISA M. COHEN", "ReviewID": "R2544V20XZ43J3", "Overall": "2.0", "Content": "I received my Galaxy tablet yesterday.  I was super excited only to open it and have nothing but issues with connecting to the wi-fi.  I tried staying optimistic and thought it was just my router at home.  I brought the tablet to the office and I am still having the same problem.  It says that the network is not in range.  Every other device I have is able to connect.  :-(", "Date": "September 10, 2013"}, {"Title": "Oh, Yeah!", "Author": "PurpleLadyO", "ReviewID": "R2KXE4MATV4F7Y", "Overall": "4.0", "Content": "Bravo, Samsung!  This 8.0-inch Samsung Galaxy Tab 3 is my third Samsung Tablet.  The previous Tabs have 7.0-inch screens.  Unequivocally, I like the slim and sleek style of the 8.0-inch Tab.  The speed of this Tab is excellent; the charger is the standard charger that I use with my smartphone.  Moreover, it is somewhat lighter than my previous Tabs.I did not want to pay the extra cost for the Samsung 8 Galaxy Note.  Likewise, I did not want to lose the Verizon Wireless telephone number associated with my 7.0 Samsung Galaxy Tab.  So, I still carry the 7.0 Tab in order to access the 7.0 Tablet's mobile hotspot for connecting to the Internet in areas where I cannot access Wi-Fi or use Wi-Fi over a secure network.  This option is somewhat cumbersome; yet it is practical.  Because of the \"Wi-Fi only\" limitation, I did not indicate a 5-star rating.", "Date": "August 13, 2013"}, {"Title": "Warranty is useless", "Author": "Sammy D. Kuhn \"sdkuhn\"", "ReviewID": "R20RN2I1BYT9NK", "Overall": "1.0", "Content": "After a month the screen got scrambled. There were no cracks in the screen. It had never been dropped. Never crushed. Never been wet. I am overly cautious with my electronic toys. Yet they are claiming the LCD was cracked. The warranty is simply useless. If I could zero stars I would.", "Date": "March 5, 2014"}, {"Title": "The great features weren't enough to win me over", "Author": "S. Bell", "ReviewID": "R30J511V4WG9AG", "Overall": "2.0", "Content": "Perhaps my unit was a lemon, but I can only speak from my experience.  This is coming from a PC-owner (an HP laptop running on Windows 8, jumping to this from XP), and an iPod Touch 4(first and only Apple product) owner. So, setting up a device under different types of platforms is not a completely new concept to me (though I'll admit, I'm no expert). However, family and friends usually come to ME for help when they have computer tech issues.I was pushed into purchasing the Galaxy instead of the Kindle Fire HDX 7\" at a local store by a rep for Samsung working inside said store. I should have sensed a problem because the first time I went into the store after Christmas, the Samsung reps were swarming over the tablet section pushing their product over the Kindles, iPads, and Google Nexus tabs. (They get a commission, and each claims to own a Samsung tablet with which they are thrilled, which I suspect they get for a deep discount. It makes sense they are less than objective.) So sadly, I caved from my original intention when I entered the store, and came home with the Galaxy.(As a side note:  I've noticed the bad reviews on this device are getting a \"not helpful\" vote on them, which makes me suspect many votes are from Samsung reps who are working on commission, based on the attitudes and behaviors of the reps I saw in the electronics store.)I regretted my purchase within an hour of turning it on, setting it up, and starting to download apps when I got home. The download time was slower than molasses even with my broadband WiFi connection, and the interface was cluttered and confusing on the tablet.  Trying to group apps into folders was confusing at best.For those people who would say I just didn't get used to Android because Apple had \"spoiled\" me, let me say that the Kindle uses Android, but Amazon makes the setup process and UI much easier to navigate. Perhaps Android could take some lessons from both Amazon and Apple.Physically, I'd also say that owning a case for this is a MUST. It's way too thin to hold comfortably, the back is slick and tends to heat up on one side too much while charging, which can cause your hands to sweat and have a moist and slippery environment with your equipment (not a good combo at all for electronic devices that you want to last). I also found this device uncomfortable to hold in one hand because of its size. The weight is distributed across the device such that holding with one hand can be difficult, and would especially be for anyone with small hands.Let me give some positives on the device, which had convinced me to buy it over the Kindle to start with:1. Expandable memory with MicroSD card.2. Multi-window App Accessibility.... (NOTE: It only works with CERTAIN pre-installed apps on the device, NOT every app you install. This was not revealed by the rep who sold the device to me. I thought it worked with everything, much like my split-screen functionality of my Windows 8 laptop.)3. Screen-mirroring (which could only be used with purchase of additional $70 device to hook up to TV, etc.) The rep claimed that the Kindle Fire HDX did not have this, but upon getting the Fire, I learned that the Fire DOES have this ability under the Settings menu, called \"Display Mirroring... same thing.4. 5MP rear cameraHowever, all the great features in the world don't mean squat if you can't get the equipment to work. When you can't download apps because they are loading at a snail's pace, and when you try YouTube and Netflix to have them buffer every 10 seconds (tried even at 2AM, when no one else was using our Internet connection), it's clear you have a slow piece of overpriced electronic equipment. It took deleting all but 3 apps on the tablet to get YouTube to even work without immediately buffering.Multi-tasking on this device is difficult because of the processor speed. It doesn't run other apps well if you are downloading something in the background. It simply doesn't have the processor speed or RAM to support it, so don't expect to download an app in the background while trying to play a game. It won't be pretty.So great was my frustration that I returned it to the store within 24 hours and bought what I had originally intended to get in the first place for $70 less... the Kindle Fire HDX 7\" (purchased on sale for $199).  My experience with the Kindle has been like day versus night in comparison to the Galaxy with setup and UI. The speed outshines Samsung by miles (compare a 2.2GHz quad-core processor with 2GB RAM in the Kindle HDX to a 1.5GHz dual-core and 1.5GB RAM in the Galaxy, and you will notice a HUGE difference). I have had the Kindle for 3 days now, and have not had a problem yet.Based on my experience, in my opinion, Samsung should stick to producing TVs and BluRay players and stay out of the tablet business. If you'd like to see my more detailed review and comparison with the Kindle Fire HDX, look here: http://www.amazon.com/review/R27WLATCO02ZHD/ref=cm_cr_rdp_perm (which I'm not being paid or compensated for... just a pleased owner/user).", "Date": "January 18, 2014"}, {"Title": "Where have you been all my life", "Author": "EH", "ReviewID": "RXSZ62A1GGNH8", "Overall": "5.0", "Content": "I love this tablet. The display is amazing. The camera is awesome. Recording a video is great. So easy to use. The battery lasts me all day. (and I use it quite a bit) I dont have a single complaint on this tablet..", "Date": "July 22, 2013"}, {"Title": "Great tablet unitl you want to print", "Author": "Shawn Badger", "ReviewID": "R2RML2W82JLQJ3", "Overall": "3.0", "Content": "I love my tablet or at least I did until I went to print.  I installed the HP print app like I did on my phone, but unlike my phone I could not add a printer in the settings. I then do some Goggling and and try to print some when it says you can only print to Samsung printers. Huge fail. I am now waiting Goggling for an alternative ROM to get rid of Samsung's vendor locked in ROM.", "Date": "January 2, 2014"}, {"Title": "Outstanding Tablet", "Author": "WJW", "ReviewID": "R1Q0MFYJMURI1Q", "Overall": "5.0", "Content": "The price was right for this tablet on Amazon. Purchased this as an early Christmas present for my wife. My wife has used the tablet for over two weeks now.  We have other tablets such as the higher end of Toshiba and Archos tablets. The Samsung tablet is top notch.  Without all the technical chatter just want to say this tablet is simple to use, the sound quality is outstanding, the screen display is super and it is a Samsung product! The ratings on Amazon show over 70 percent of 300 reviews give this a rating of five stars, other sites even better. I don't particularly trust all reviews but trust the over 70 percent on this item. I do recommend this tablet to others.", "Date": "December 18, 2013"}, {"Title": "Worth every penny!", "Author": "Frankmarte", "ReviewID": "R31TQLQ4QRRU10", "Overall": "5.0", "Content": "This is a money worth product. For me is easy to handle with one hand. Nice display and really good battery life!5 stars!", "Date": "December 9, 2013"}, {"Title": "samsung galaxy tab 3", "Author": "michael thomas", "ReviewID": "RA49U8CUWBSFN", "Overall": "4.0", "Content": "I always go with Samsung over apple. I can almost everything I did on my desktop with this tablet.Once you learn how to use it,it is awesome.", "Date": "November 23, 2013"}, {"Title": "A great Tablet!", "Author": "Ron G", "ReviewID": "R143LWBI35179R", "Overall": "5.0", "Content": "It's everything the Tab2 7\" was supposed to be.  A *real* camera, that focuses. It can see barcodes!  Lacking a light, but that's OK  Love it!", "Date": "November 17, 2013"}, {"Title": "Amazingly a unique piece of equipment.", "Author": "Lisa Forde", "ReviewID": "R24C7CDZW70F3Y", "Overall": "5.0", "Content": "Its really an amazing piece of equipment and its user friendly which is what most people are looking for to help them in today's society.", "Date": "October 22, 2013"}, {"Title": "major points", "Author": "d_makeitlookeasy", "ReviewID": "R2B7VQVQ0658RY", "Overall": "5.0", "Content": "Bought this for the wife.... She friggin loved it! People talk so much crap about specs but in all honesty who really cares if a screen is different by a few pixels? Point is.... devices moves fast enough and completes all the tasks expected of it.... GREAT BUY!!!", "Date": "September 1, 2013"}, {"Title": "Samsung Galaxy tab 3", "Author": "Elect Lady", "ReviewID": "R2MM38ST47MK0H", "Overall": "4.0", "Content": "I am pleased with my tab 3. I enjoy the neatness and the light weight of this tab.  Easy to travel with and I intend to enjoy for a long time.  It met my requirements", "Date": "August 29, 2013"}, {"Title": "Perfect Tablet", "Author": "Jason Rommel", "ReviewID": "RSH1O3UYNRL12", "Overall": "5.0", "Content": "I love this tablet, easy to navigate, fast and great for travel.  I would highly recommend the Samsung Galaxy tablet.", "Date": "August 29, 2013"}, {"Title": "Samsung Galaxy Tab 3 8.0", "Author": "Darda", "ReviewID": "R8W2ERYF2IW17", "Overall": "5.0", "Content": "Just received my 8.0 tab and I have the Samsung Galaxy S phone.. So simple to use, great screen quality, Love the size, the weight.  Very easy to navigate, Glad I went with the 8\" versus the 7\"Synced with mail very easily, cant wait to really get into it.Definealty Recommend the Samsung tab over the over rated IPad", "Date": "August 28, 2013"}, {"Title": "Galaxy Tab 3", "Author": "Helen Quon", "ReviewID": "R2ZHL6RYPRAGRS", "Overall": "5.0", "Content": "Exceptional - was able to pick up wi-fi link well before others in same room (in a meeting room in Hong Kong no less).  Response was so much faster than my iPhone!  Display is beautiful.  Will be using it to record minutes of a meeting - beats a tape recorder or a digital recorder which I hesitate to buy:)", "Date": "August 16, 2013"}, {"Title": "Impressive", "Author": "H. J. Boudreaux", "ReviewID": "RXXS16Q0N7E0R", "Overall": "5.0", "Content": "I am the IT guy for our community group. I have used Android 2,3,4.1,4.2 tablets. This new 8 inch is very impressive (I got it for testing purposes). It is thinner. The size is only slightly bigger then the Tab 2 7\" despite a 20% increase in view able area. It uses most all of the screen, and pushes the \"home, return, menu\" functions over to the side like the Galaxy Tab 2 phone. The resolution is significantly sharper than the Tab 2 7\", which says a lot.At this price point this is an impressive achievement. \"My\" tablet is the Galaxy Tab 2 7\", and I use it for several hours a day. Mostly for internet browsing and HBO GO. I work on a laptop. Started programming in 1970 in Fortran.Our group got a grant to set up a tech center for community improvement. We have shifted focus from Win Vista, 7, 8 to Android, because that is what our end users wanted/needed.", "Date": "August 14, 2013"}, {"Title": "Great", "Author": "Jake R. Thimsen", "ReviewID": "R2ZV9DUTRIA651", "Overall": "5.0", "Content": "Awesome. Wife loved it for Mother's Day. She's always on it.  Great for watching media, or just hanging out online. She is always reading books on it. Makes her sched with it. Kids love it too.", "Date": "June 9, 2014"}, {"Title": "Battery problems after 2 months", "Author": "Joel Tunnah", "ReviewID": "R2AFIITLHWGR0T", "Overall": "1.0", "Content": "My Galaxy Tab worked OK for two months, then the battery stopped taking a charge. I leave it on the charger all day, turned off. Remove the charger, reboot, and the battery level is at 25%...Google it, this is a very common problem on the Galaxy Tabs. People are prying the covers off to try to fix it.Lesson learned: avoid Samdung products. My Nexus 5 and 7 are both running as good as day 1.", "Date": "June 9, 2014"}, {"Title": "Very pleased so far", "Author": "Fabra A.", "ReviewID": "R35G6QHXSXG5MG", "Overall": "5.0", "Content": "Very pleased so far none of the issues from the previous one by not being able to charge that is not a problem anymore.", "Date": "June 9, 2014"}, {"Title": "Loved it....no more", "Author": "GrannySue \"GrannySue\"", "ReviewID": "R2MEIKQ7PXI9CD", "Overall": "3.0", "Content": "After purchasing this Sept 21, May 30 it doesn't recognize charger. Contacted Samsung, sent it in, under warranty, received it June 5th. Started charging, would not go to 100%. June 6th, doesn't charge at all!!! It doesn't even know a charger is connected. This was supposed to be fixed, but it isn't. I loved this tablet, but I thought it would last longer than eight months. Very disappointed in Samsung.", "Date": "June 7, 2014"}, {"Title": "Perfect size!/ Tamaño ideal!", "Author": "Cristopher", "ReviewID": "R2YWXHFB03WBZS", "Overall": "5.0", "Content": "Not too big or too small!! Its fast and easy to use!/ No es muy grande ni pequeña se adapta bien , la recomiendo!!", "Date": "June 7, 2014"}, {"Title": "Excellent", "Author": "Topocho02", "ReviewID": "RBB647UD09BH7", "Overall": "5.0", "Content": "i work every day whith this table and is super fast no problem at all android 4.2 work excellent the apps work really fast only the cam is no so good in darknees places", "Date": "June 6, 2014"}, {"Title": "love this tablet", "Author": "sjones642", "ReviewID": "R2FVGDB7ZE4DKG", "Overall": "5.0", "Content": "Now my daughter wants one. I fully trust in Samsung products all around. My daughter will be getting one soon!", "Date": "June 6, 2014"}, {"Title": "Sammy", "Author": "Andrew Miner", "ReviewID": "RC8WIR69WDNXM", "Overall": "5.0", "Content": "Good tablet at a great size. Very portable and small enough to carry around to use for many things. GPS, video/music player and email use is great on the go.", "Date": "June 3, 2014"}, {"Title": "Like new", "Author": "Ninja", "ReviewID": "R2IFIL9PK5AXK3", "Overall": "5.0", "Content": "The product came in plastic and everything look brand new. The tablet run very fast as a iPad 3 and the internet log on quick! The resolution is clear as a retina screen. For the price I would bought another one, but I have 2 iPads!", "Date": "May 19, 2014"}, {"Title": "Great tablet!", "Author": "Angelica Valenzuela \"Angie V\"", "ReviewID": "RCFM6ZIPQP7VP", "Overall": "5.0", "Content": "Bought this as a gift for my boyfriend and he loves it! Since we are both android users this tablet is very easy to navigate and gives us everything we need. Great size and the images it takes are good quality.", "Date": "May 18, 2014"}, {"Title": "Amazing!", "Author": "Jane E Murray", "ReviewID": "RKL41T80LLY23", "Overall": "5.0", "Content": "I absolutely love it! The picture quality is beautiful and the apps are great! I contemplated the Nexus 7 but I'm so happy I went with the Samsung!", "Date": "May 18, 2014"}, {"Title": "good", "Author": "RJ", "ReviewID": "R3H7YDK9WRP5CO", "Overall": "5.0", "Content": "Very fast, clear screen, ergonomic. Not too small or too large. Fits perfectly in hand. Recommend it to everyone.Three only negative thing was the pre installed Samsung apps that you can't uninstall. Even if you are not using them, they keep updating.", "Date": "May 17, 2014"}, {"Title": "Best Tablet", "Author": "Mike Fisch", "ReviewID": "R7HGRYQNXETJ6", "Overall": "5.0", "Content": "Great size and does everything!  Love the fact you can use it as your remote for TV as well as looking up stuff.", "Date": "May 17, 2014"}, {"Title": "Excellent", "Author": "Sakasdak", "ReviewID": "R2A6IHWN2WSOUQ", "Overall": "5.0", "Content": "Fast and good. The tablet works perfectly and i loved the price. Recommended.I wilo buy things of electronic deals", "Date": "May 17, 2014"}, {"Title": "Great Tablet for the price", "Author": "Earle S. Greene", "ReviewID": "R37DZ5S1YOSPHR", "Overall": "5.0", "Content": "For the price you can't get much better than this.  This is my third Galaxy Tab (previously owned models were the original Galaxy Tab and the Galaxy Tab 7.7).  Also, it appears that Samsung has managed to hack Android because the option to move your programs to the external SD card is once again available.  Screen has the 16:9 viewing ratio which is perfect for watching videos.  I have the Galaxy S4 Mini phone, and this tablet duplicates the S4 experience on a larger screen, which is fine by me.  For $249.99 it's a very good tablet.  If you don't mind buying refurbished, Woot.com (where I bought mine) is selling the same model now for $159.99, and for that price it's an outstanding tablet.  Is it better than an Ipad?  Maybe not.  Android hasn't caught up with IOS in terms of user experience, but it's a lot better and a lot closer than it used to be.", "Date": "May 17, 2014"}, {"Title": "Awesome", "Author": "Amazon Customer", "ReviewID": "R38P0GM9XTKCBX", "Overall": "5.0", "Content": "Bought this to replace our Samsung Galaxy Tab 3 (7in 8GB) this one runs ALOT smoother no freezing or lagging. I love it!!", "Date": "May 16, 2014"}, {"Title": "kindle was showing it age and decided to go Samsung", "Author": "Charles", "ReviewID": "R220VL4VMZ1I6B", "Overall": "5.0", "Content": "love my new Tab. As my original kindle fire was showing its age I thought why not look at what was out there. I already had a samsung galaxy phone and was super happy with it. Looked at the 8\" Tab and the reviews and what it could offer more than the kindle this time around. So far I am extremely happy with it. Packaging was perfect and shipping was super quick!", "Date": "May 16, 2014"}, {"Title": "First tablet", "Author": "Amazon Customer", "ReviewID": "R2Q2SZQZA9N92Z", "Overall": "5.0", "Content": "so I don't have much to compare to but this thing is great. The IR Sensor is what gives this 5 stars. Even worked with my older TV", "Date": "May 15, 2014"}, {"Title": "Awesome", "Author": "dvreyna", "ReviewID": "R1O3IPWVQ78WA2", "Overall": "5.0", "Content": "I love this tablet everything you have been reading about this tablet in the five star reviews is accurate. Perfect size and function.", "Date": "May 15, 2014"}, {"Title": "Great product!", "Author": "Amazon Customer", "ReviewID": "R1LQ4QPYR95LNN", "Overall": "5.0", "Content": "I had purchased this product mostly for my Kindle application.  It has well exceeded my expectations.I have been shopping for a tablet since about September or October of last year mostly for my husband.  Black Friday had one on sale, but at the time he didn't want one.  Since then he was playing with the store display ones in the store.  We both have android phones so we decided to stay with an Android device when we purchased.When we finally purchased the Tables I found myself,  as well as my husband,  are using the tablet like a mini computer.  So many times it has come in handy to pull up an app to check on something,  or an account for a balance.  The speed is great for what we need.  We have the micro sd card so that helps.Hubvy and I are very happy with the product within the last few weeks of ownership.", "Date": "May 13, 2014"}, {"Title": "Love it", "Author": "Yoly", "ReviewID": "RNH3DEMBIAY1M", "Overall": "5.0", "Content": "I have two iPad and 1 iPod, but this tablet it is better, I recommend completely. I will by another", "Date": "May 12, 2014"}, {"Title": "Great tablet, wonderful color!", "Author": "Oscar Arias", "ReviewID": "R23FH7DFUF79PE", "Overall": "5.0", "Content": "Got this as replacement for my Toshiba Thrive 10\" after it fell on the concrete face-first.  (That tablet while chunky and heavy served me well for several years).  I wanted to get something a little smaller so I first purchased an Asus Memopad HD 7.  I was a little underwhelmed by the clarity of the screen, and the build quality of the Asus felt cheap.  I ended up giving the Asus as a Christmas present to someone.Decided I that what I needed was something slightly bigger, so I started looking at the 8-inchers.  I was sold on the Samsung when I saw that it came in a Gold-Brown color  (I really didn't want an all-white or all-black tablet).  As I wanted it right away I ended up purchasing it from a nearby \"big-box office supply store\" (honestly 6 months later, I couldn't tell you which one).  It doesn't really matter as this is one of those price controlled products that will end up being the same price on Azon or a big box retailer.At any rate, when I picked up the tablet for the first time, I was really impressed with the build quality.  The build quality (along with the great brown-gold color scheme) really made this tablet feel like an \"executive\" accessory.The screen on this is MUCH sharper and colorful than the screen on my old Toshiba Thrive or the Asus Memopad.Sorry, didn't run any sort of benchmark tests on it, but the interface felt very responsive.  It's very \"smooth\" unlike the Asus Memopad, which (while faster than the Galaxy Tab) had a somewhat \"jerky\" UI experience.  The Samsung was just a better experience.I use Netflix on this tablet, and it runs and looks great.  I don't do much gaming on tablets so I can't speak about that, but the Amazon Kindle app runs great on it, as does the standard stuff like my email client, evernote, etc.As a bonus, the tablet came with free 50gb of drop box storage, which I found to be VERY useful to move files between PC/Laptop/Tablet and phone.  I think I also got some Google Play credit, as well as some other \"Samsung Perks\" that I never used like 3 months of free XM radio, free audio books from Audible, etc.Of course just as I write this review, the new Galaxy Tab 4's have just been released.  I think I'll hold on to this one for another year or two, as the new ones don't come in brown-gold!", "Date": "May 12, 2014"}, {"Title": "Samsung Galaxy Tab 3 (8-Inch, White)", "Author": "Cate", "ReviewID": "R2GJVS6CTQSUQ9", "Overall": "4.0", "Content": "I find the Samsung Galaxy Tab 3 8.0 to be very similar to the iPad mini and a little more affordable, the pictures are good and you can get most of the popular apps.. I got it for my teenage girls who like to Facebook, Snapchat, use Instagram and watch YouTube videos. They can also use Google to research info for homework. I would recommend it to anyone who wants a small, convenient, easy to use tablet for themselves or their children!", "Date": "May 10, 2014"}, {"Title": "Great!!!", "Author": "Casey Hayhurst", "ReviewID": "R3I2RKA5SQUDUC", "Overall": "5.0", "Content": "Rocks ...it works really well...I am so glad I bought this...I bought an off brand before getting this one and it was crap", "Date": "May 10, 2014"}, {"Title": "Love, love, love", "Author": "lauren", "ReviewID": "R19UBDXH6G09PG", "Overall": "5.0", "Content": "This was a Christmas present for my daughter is still continues to be her favorite gift. She uses this everyday and it works great. I bought the screen protectors and a flip case just to be safe.", "Date": "May 9, 2014"}, {"Title": "My First Tablet", "Author": "Jack Riddell", "ReviewID": "RVGU9S35B60OC", "Overall": "5.0", "Content": "I bought this 8-inch Galaxy Tab 3 based on forum reviews and my own research. It does everything I wanted in a tablet and I plan to put it to good use during a one month vacation in Europe. I love the sharpness and clarity of the display, the quick response to touch commands, and the near endless applications available for this device. So far, I am extremely pleased with this purchase.", "Date": "May 9, 2014"}, {"Title": "Very Happy", "Author": "bri", "ReviewID": "R31H6RQUHLAA4G", "Overall": "5.0", "Content": "Got my tab 3 8 inch last October at Best Buy. Could not be more pleased. My better half and I shared an ipad 3 since they came out but I was not satisfied.  I bought a galaxy s4 phone in july 2013 and I love how they can be connected to easily transfer files, pics, movies etc back and forth. I find my better half even using it and liking it. The ipad speakers are just terrible. This tab is so much better to watch movies, videos, and listen to music. And yes I share all that between my 2 Samsung devices. Sure the screen is smaller but it's so much easier to hold. I've never had 1 issue. I see other bad reviews and it really surprises me. But I still would recommend what I think is a good product to friends and family. Hope you try this out.", "Date": "May 8, 2014"}, {"Title": "Love it", "Author": "Courtney B.", "ReviewID": "RD2HKUCPEPJW1", "Overall": "5.0", "Content": "It's fast enough for me for browsing the web and playing games. The battery life is great, picture is very clear, and it's easy to use. This is my first tablet so I really have nothing to compare it to, but I've always had Samsung phones and was impressed by them so that's why I bought this. I'd recommend it.", "Date": "May 8, 2014"}, {"Title": "exceed all my expectation", "Author": "sanjay morris", "ReviewID": "R1ZTWDKUIHTCVS", "Overall": "5.0", "Content": "I luv this tablet the perfect size everything that was mention is there I will always love samsung and this tab is just perfect for everything the cameras are greatbmusic sound excellent easy to set up performance is excellent the graphics are superb the games works well and they are very clear the resultion is magnificent and persons talking about the nexus if you want your moneys worth stick to your samsung tab inluv with this tab cant get enuff of it", "Date": "April 16, 2014"}, {"Title": "Just what my Wife needed.", "Author": "Chris", "ReviewID": "R5XA03KUAKMRF", "Overall": "5.0", "Content": "My Wife had been wanting a Tablet for the last few months so I tried to figure out which one of the Samsung tablets to get.  At the end of the day it came down to the Tab 3 and the Note tablets.  From there I had to decide what size she would want.  I took a chance on the 8 inch because I felt the 7 inch might be too small and the 10.1 might be a little to large to carry around.  The 8.0 does the job perfect because its large enough to really enjoy the screen size and the bright display and small enough to carry around or put neatly in a bag.", "Date": "April 16, 2014"}, {"Title": "Wife was elated!", "Author": "J. Brandt", "ReviewID": "RPX6NKKLNCC7G", "Overall": "5.0", "Content": "I purchased this tablet for my wife on her birthday (early).  She's had it for 2 weeks now and I can't get it out of her hot little hand.  She tried the iPad mini at retailers, but the Android OS along with the preloaded apps have blown her away.", "Date": "April 15, 2014"}, {"Title": "so far, so good!", "Author": "snruss", "ReviewID": "RZGE0KMKH3K9D", "Overall": "5.0", "Content": "Love it so far,  really like how you can have a split screen and have 2 apps or Windows open.  I thought it would be too small after having a 10\" tablet,  but it's a great size,  and still fits in my purse.", "Date": "April 8, 2014"}, {"Title": "the right size", "Author": "jorge roman", "ReviewID": "R2A1G48EDEXI", "Overall": "5.0", "Content": "and 8 inch tablet is the perfect size for a tablet.. you can carry it wherever you want and it will fit in any place", "Date": "April 7, 2014"}, {"Title": "Why switch to an iPad?", "Author": "Jeff Davis", "ReviewID": "R1AM8VJGIRKSTA", "Overall": "5.0", "Content": "The Samsung Tab 3 8\" is a fantastic tablet!  It's fast and easy to use.  Set up was really easy, all the Apps I have on my Android phone automatically moved over to the new tablet!", "Date": "April 7, 2014"}, {"Title": "I love it", "Author": "nanu \"nunu\"", "ReviewID": "R28D6OLI717CNB", "Overall": "5.0", "Content": "I love my tablet! I got a like new one and its like it is brand new. The pixel quality is great. I would recommend this tablet to anyone.", "Date": "April 4, 2014"}, {"Title": "I love it so far!", "Author": "Luis Esparza", "ReviewID": "R2EG0VJRH8JOBC", "Overall": "5.0", "Content": "Awesome tablet. Worth it. Im a bussy college student and this comes in handy instead of carrying my laptop with me all the time.", "Date": "April 3, 2014"}, {"Title": "Fast delivery and well packed the way I like", "Author": "Keith", "ReviewID": "R3JXWGFAQ3ODOQ", "Overall": "4.0", "Content": "Good product. Good price. But cannot use WhatsApp. WeChat not working very well. We like it overall. Very happy with it.", "Date": "April 3, 2014"}, {"Title": "Great product", "Author": "AB", "ReviewID": "R3PT3FIXV36RUP", "Overall": "5.0", "Content": "Came in great condition, even though it was an open box product (as listed).  I was surprised!  Would definitely buy another!", "Date": "April 3, 2014"}, {"Title": "amazing product", "Author": "Ziombo G.", "ReviewID": "R274Z13I5OZ3L6", "Overall": "5.0", "Content": "The best product that i ever gotten. Powerful..amazing..shame that i had to return it. I will get one in the future", "Date": "March 15, 2014"}, {"Title": "its just like my phone I love it!", "Author": "Genevieve Contreras", "ReviewID": "R3E5IKSUTM1HVP", "Overall": "5.0", "Content": "I purchasedso that I can have something biggerthat my phone.  And since basically is a larger version of the s4 im able to useitthe same way. I liked that it had pre loaded apps that whereon the s3 so something new.the battery life lastsa really long time  so thatsawsome. Itsa really good product!", "Date": "March 15, 2014"}, {"Title": "Fantastic Tablet!!", "Author": "M. Holland", "ReviewID": "R1WG8CTVM4EEPM", "Overall": "5.0", "Content": "Very sleek, fast and long battery life. My first tablet and I couldnt be happier! Beautiful screen and Android is very customizable compared to my iPhone iOS7.", "Date": "March 7, 2014"}, {"Title": "Great Buy!!!!!", "Author": "reelthugz", "ReviewID": "R31NN1K5TC2T4F", "Overall": "5.0", "Content": "This tablet performs perfectly no issues so far with it, definately recommend buying one for anyone who is considering getting a tablet.", "Date": "March 7, 2014"}, {"Title": "Fantastic Buy!", "Author": "J.Bowman", "ReviewID": "R9HLBQCZCQ3MB", "Overall": "5.0", "Content": "I absolutely love my samsung galaxy tab 3! I would recommend it to anyone looking for a great tablet. Easy access to just about anything I need from my calander to recipes for dinner and pictures of my wedding. I love the brown gold color too, very unique.", "Date": "March 6, 2014"}, {"Title": "Great Tablet", "Author": "amir70-il", "ReviewID": "R2R6R0ZOPJLDV2", "Overall": "5.0", "Content": "I love this Tablet, samsung made it very thin and light, packed with app and widgets, easy to use and download movies, games, and pictures oveall great tablet recommeded.", "Date": "March 5, 2014"}, {"Title": "great gift", "Author": "Yvonne Lesesne", "ReviewID": "R3ECQFTLVWSMH1", "Overall": "5.0", "Content": "This was a Christmas present for my daughter.  She didn't want another laptop so this was just right.  Can't get her to put it down, just wish I had gotten the warranty.", "Date": "March 5, 2014"}, {"Title": "Superior Tablet at Great Price", "Author": "Stefan Sommerfield", "ReviewID": "R1B9BW1W9W8WZK", "Overall": "5.0", "Content": "Replaced a very nice but near death Nook HD with the Samsung Galaxy using a Square Trade warranty refund to cover most of the cost. Already have a Samsung Galaxy 3 phone so set-up was very easy, format and icons similar so was up and running shortly after fully charging the unit. Downloaded both Nook and Kindle apps so reading problem solved. Very happy with screen quality, speed of processor, even the little speakers for music are not bad.Transferred my 16gb micro sd from the Nook, after formatting back to blank, and uploaded a bunch of music and photos, leaving 12 gb of free space for movies if I want to download for travel purpose.All in all an excellent device confirming Samsung's strength in this market.", "Date": "March 4, 2014"}, {"Title": "Just as required", "Author": "Jorge A. Garcia", "ReviewID": "R3379VDDYGFU1A", "Overall": "5.0", "Content": "This is the perfect size since I can hold it with one hand and has almost everything you need for your day to day work.", "Date": "March 4, 2014"}, {"Title": "Love it!", "Author": "Laura K. Kouns", "ReviewID": "RIL0DRZPY20VB", "Overall": "5.0", "Content": "The color is awesome!  I have a Samsung phone, and this device was so easy to use from the moment I took it out of the box!", "Date": "March 4, 2014"}, {"Title": "Samsung Tablet", "Author": "McJanny \"Cooking Nut\"", "ReviewID": "R3PPXEI0MU55YP", "Overall": "5.0", "Content": "I bought for my Speech Therapy application.  I haven't own Ipad or Tablet before but Samsung Galaxy Tab was excellent choice!  I have no dislikes - never.", "Date": "February 18, 2014"}, {"Title": "Love it", "Author": "julianrojas", "ReviewID": "R2DTB691Z8L1XT", "Overall": "5.0", "Content": "These tablet was for my wife but now i want one for me is espectqcular and the size compared to a 11 inch ipad is better cause you can handle it better", "Date": "January 31, 2014"}, {"Title": "Samsung 8 \" tablet", "Author": "karenf", "ReviewID": "R6Q86N7Q6OTM5", "Overall": "4.0", "Content": "Have a 7\" nexus tablet which I love.  Now my 8\" tablet Is truly fabulous. Love the response of the Samsung and clarity", "Date": "January 30, 2014"}, {"Title": "Tab 3 8 inch", "Author": "Tom", "ReviewID": "R2YSH5DH6KPP7M", "Overall": "5.0", "Content": "This product is outstanding and really works well. Easy to download apps and programs. I wish I could figure out how to send and receive texts using my current phone number.  Sure there is an app I just have not located it yet", "Date": "January 30, 2014"}, {"Title": "Great Gift for my Grandaughter", "Author": "Becky Gillespie", "ReviewID": "R3C8LV8316ZPET", "Overall": "5.0", "Content": "We bought this for our 8 year old granddaughter for Christmas. It is easy for her to use and for us to download apps and movies and music and books for her.", "Date": "January 29, 2014"}, {"Title": "PERFECT", "Author": "Roxanne W.", "ReviewID": "R3Q8XLJ3S7PEZG", "Overall": "5.0", "Content": "Amazing.  We have an ipad and I would rather use this.  I was wanting something easy to hold on to while walking on the treadmil and I found it!!!", "Date": "January 28, 2014"}, {"Title": "Awesome", "Author": "Steven Norris", "ReviewID": "R3HV37HFTBW9ED", "Overall": "5.0", "Content": "Bought this for my daughter and she loves it. She takes it everywhere and all her friends love it. Fast shipping", "Date": "January 27, 2014"}, {"Title": "5 stars", "Author": "jacob stover", "ReviewID": "R3139CVFGTF2R6", "Overall": "5.0", "Content": "The samsung galaxy tab 3 was everything I expected it to be and I liked how I was able to instantly transfer all my apps from galaxy 3 phone to the tablet. It also has a great battery life also.", "Date": "January 27, 2014"}, {"Title": "Samsung Galaxy Tab 3 (8-Inch, White)", "Author": "Wendell J", "ReviewID": "RAS41CF77UZ58", "Overall": "5.0", "Content": "Great tablet lots of cool features but what else would you expect from Samsung. I brought this as a gift for my wife and she loves it.", "Date": "January 25, 2014"}, {"Title": "SAMSUMG GALAXY TAB 8", "Author": "Donie Patterson", "ReviewID": "R1K46TXPN4DJWB", "Overall": "5.0", "Content": "I BROUGHT THIS AS A GIFT FOR SOMEONE. ITS GREAT TABLET THAT CAN DO MANY THINGS & LIGHTWEIGHT. I PLAN TO PURCHASE ONE FOR MYSELF.", "Date": "January 21, 2014"}, {"Title": "Awesome", "Author": "Texas210", "ReviewID": "R1LX2SHAD6P7OG", "Overall": "5.0", "Content": "New to the tablet world but this is a wonderful and user friendly device. Would like it to be about an inch bigger but can settle for this one since the 10 inch is to large.", "Date": "September 11, 2013"}, {"Title": "love it", "Author": "SexyMexy", "ReviewID": "R19G8THLG4FC1A", "Overall": "5.0", "Content": "Really are enjoying my Samsung tablet.  Only wished it had stylus pen. Didn't notice when I purchased this tablet it didn't come with it", "Date": "August 27, 2013"}, {"Title": "I love the tablet", "Author": "Jonnathan Javier", "ReviewID": "R2MJITXQ0F8IHP", "Overall": "5.0", "Content": "I'm very happy with this purchase. The tablet is awesome. No lag in games or app. The only complain so far is with the camera. I used to have a Motorola Xoom with a 5mpx camera and I'm pretty sure that the photos were better that the ones a get with this tablet. Anyway this is not a deal-breaker for me because I do not take to many pictures with it.", "Date": "August 20, 2013"}, {"Title": "The Samsung Galay 3", "Author": "MT", "ReviewID": "R277ZTQ2GSN8UB", "Overall": "5.0", "Content": "It is great.  Can do so many things and is easy to use.  I would definitely recommend it to friends", "Date": "August 12, 2013"}, {"Title": "Samsung Galaxy Tab 3", "Author": "Jen", "ReviewID": "R1VMSIFJ5R6CAJ", "Overall": "5.0", "Content": "I absolutely love my new tab, there has been no issue with it thus far and as such would recommend it to anyone who wants one.", "Date": "August 8, 2013"}, {"Title": "Samsung 3 is Awesome!!!", "Author": "M. Teague \"Franklydelicious\"", "ReviewID": "R1YLQUA4BKXVKT", "Overall": "5.0", "Content": "I have had for 2 weeks now and just love it!! The size is perfect for me and you can most everything on it. The processor is extremely fast and the retina display is cool!! Amazon has a great price as well!!!", "Date": "August 5, 2013"}, {"Title": "Simply Awesome!!!", "Author": "Tito", "ReviewID": "R7KLOQ0DYNBTN", "Overall": "5.0", "Content": "I love everything about it!.  It is just the right size, amazingly fast and user friendly.  Compatible to almost everything and easily set up.  Another home run for Samsung!", "Date": "August 5, 2013"}, {"Title": "Great tablet", "Author": "Bob", "ReviewID": "R29SMX24KPDFEW", "Overall": "5.0", "Content": "Fast, quick downloads, camera takes great pictures, great graphics for games, easy to use. The purchase experience was great, quick delivery.", "Date": "August 3, 2013"}, {"Title": "Great tablet", "Author": "Marty", "ReviewID": "R1IB1UNBR9N5SO", "Overall": "5.0", "Content": "Really love this tablet. I think the 8\" is a better choice than the 7\". Display is bright and very sharp. Even reads OK outdoors in bright light. Battery life is good. It's a great sized device to take on short trips when you don't want to bring a laptop.", "Date": "July 30, 2013"}, {"Title": "Not satisfied", "Author": "Susan Powers", "ReviewID": "RWA5QAIN9EIWS", "Overall": "1.0", "Content": "I want to exchange this item, but Samsung's support center is about useless.  I have tried every way possible to get a response to my complaint, as follows:I purchased a Galaxy 3 Tablet 8\" in December, 2013.  I have become increasingly frustrated because the battery runs out very quickly. Even if the device is off and I have not used it, within 24 hours the battery will be completely dead.  I have followed all the instructions to increase battery life, but it makes no difference.  Also, I have to  manually turn off/on the device, it does not have a \"sleep\" mode.  Is it supposed to?  I bought a cover that is supposed to turn the devise off when not in use, but it does not work.  I purchased my tablet on Amazon, but since it has been over 30 days, I cannot return it.I know it has been more than 30 days since purchased, but if you are able to help please let me know.", "Date": "February 23, 2014"}, {"Title": "best and cool", "Author": "T. Z.", "ReviewID": "R1P18LHS3SZM8O", "Overall": "5.0", "Content": "i compared my mini ipad and samsung galaxy tab  both are different because apple using iOS software and android  software but i love both", "Date": "February 14, 2014"}, {"Title": "Tablet", "Author": "Sharon Johnson", "ReviewID": "R3I6G3ALCMEJIL", "Overall": "5.0", "Content": "my daughter requried it for university purpose, she did the research and found that this would be suitable for her", "Date": "December 9, 2013"}, {"Title": "Good tablet", "Author": "JDandy", "ReviewID": "R1NFZ47SIKWLXL", "Overall": "4.0", "Content": "Nice tablet. It is a bit slow and, if I am not very careful handling the narrow edges, the screen will blank. It does perform most tasks well. It is pricey compared with the 7 inch model.", "Date": "November 22, 2013"}, {"Title": "Power Connection Concerns", "Author": "horanr", "ReviewID": "ROIXQLWF79XHM", "Overall": "4.0", "Content": "Overall I'm enjoying this purchase.  My concern is the conversion of Samsungs propriety power input to USB2, the failure of which condemned My Kindle Fire to the trashcan :(", "Date": "September 25, 2013"}, {"Title": "Samsung Galaxy Tab 3", "Author": "jelliebean60", "ReviewID": "RSBY7LTJE371U", "Overall": "5.0", "Content": "bought as a gift to my son's birthday.  He adores it... so easy, convenient, fast, reliable, durable and most of all handy.  He does all his homeworks with it, talk to friends via Skype, lots of storage with SD cards, receives messaging, hardly have any use for a phone anymore.  But I have a contract to adhere so for now he has his cell phone.  I am hoping to cancel our cells as soon as my contract is over.  Very wonderful to have... not to mention the social nets site.  He loves it!", "Date": "September 6, 2013"}, {"Title": "False advertising", "Author": "michael tardell", "ReviewID": "R37JVRL322JF6V", "Overall": "1.0", "Content": "The tab 3 doesnt have a MHL adapter.  Because of this, you cannot stream movies, pics, presentations, etc.  to a hdtv.  There are cables made for this for the Tab 3, but it doesnt support them.  Samsung advertises that the Tab3 has MHL, but it doesnt.  Even offers cables to support this function.  But they don't work.  Also, the Tab 3 has connectivity issues, my wireless router needs to be reset everytime I turn on the Tab. It sees the network, but wont connect.  No other devise in my house needs this.Also, the split screen function only works with certain Samsung programs.  Like clock, you tube, google play.  None of your installed programs can be split screened.  Maybe only 9 preinstalled programs will split screen,RETURNED FOR A BETTER PRODUCT", "Date": "September 23, 2013"}, {"Title": "First tablet, well worth the wait...", "Author": "Erick Bautista", "ReviewID": "R1ND6NZT6NAO1P", "Overall": "5.0", "Content": "If you've been holding out on a tablet, this is the one.Great display, responsive keyboard, highly recommended, now its time to get a case for it...Battery life on it is great, went almost a full day with heavy usage", "Date": "July 7, 2013"}, {"Title": "Yo, Samsung! Tech support outweighs glitz", "Author": "review2u \"review2u\"", "ReviewID": "R3AJIBZ97B1Y7T", "Overall": "1.0", "Content": "It was gorgeous, the tablet. It sparkled. It was easy to fall in love with. But a problem here, an issue there, and within a few weeks off we went for e-therapy, commonly known as tech support. Sadly, Samsung tech support was . . . unsupportive. It was lackluster. It didn't sparkle. So the gorgeous tablet, with its issues unresolved, went back to Amazon -- which has a fabulous customer support staff -- and I went on to another tablet from a company that wasn't Samsung and was willing to provide detailed, helpful tech support. When you fall in love with an e-device, you're basically marrying its tech support. No matter how gorgeous the e-device is, no matter what it promises you, it's only as good as the tech support staff behind it. My experience is that Samsung produces glitzy devices but doesn't adequately support them. If you don't have time or money to waste, be careful out there.", "Date": "October 24, 2013"}, {"Title": "Great tablet, bad camera!!!", "Author": "Tin Tin", "ReviewID": "RCBES6NV2KZ6H", "Overall": "4.0", "Content": "This is the first time I write a review on Amazon.com. I give 4 stars for this product because of the quality of the camera. I've tried camera of Galaxy S4 (phone), Galaxy Note 2 (phone), Galaxy Tab 2 (this one), iPad 3, and iPhone 4. The quality of the pictures taken from Apple products are way better than Samsung's. I think my iPhone 4 has better camera compare to Samsung Galaxy S4 & Note 2 (iPhone 4 has 5.0MP, Note 2 has 8.0MP, S4 has 13.0MP).  Besides, I am so satisfied with features of this tablet. It is light enough to be held with one hand, whenever you stand, sit, or lie. I like the widgets, which Apple products don't have. Moreover, I can use this tablet as a GPS. I downloaded the app called \"Navigator\" and use it as an GPS. It works offline because of the maps saved in microSD card.  I used this tablet mostly for reading. I have a lot of pdf, epub, and other files on Dropbox. All I have to do is download them to the tablet and enjoy the books.  It does have \"Smart Remote\" which can be used for most TV. It worked with my old CRT Mitsubishi. S Voice is also very funny to play with.  Things I do not really like are music app, Youtube app, and the files are so unorganized. I used Chrome for watching Youtube, instead.  I prefer this one to iPad because it's light and doesn't stick with iTunes. In my opinion, the touch technology of Apple is the better than other companies, at least for now. Although this has better specs than iPad 3 does, I still feel iPad are smoother than this.  In general, this is a good tablet. I would be happier if it was less expensive a little. I recommend this tablet for students and people who like to read. Do not buy if you want to use it for taking pictures.", "Date": "July 22, 2013"}, {"Title": "Amazon Prime Movies? No!", "Author": "GracieLou731", "ReviewID": "RABMCZUFXO3NZ", "Overall": "2.0", "Content": "Update 11-24-2013: Here's a link to compatible devices for amazon instant downloads.http://www.amazon.com/gp/video/ontv/devices#Compatible%20Mobile%20DevicesYou can access Amazon instant downloads only on Kindles or iPads. Also, I learned through a chat with Amazon customer service that Amazon is now using Silverlight for their instant videos and is no longer using Flash.Original Review: I bought this primarily for traveling, so I could access the internet, play movies and games on the plane, etc.This has a wonderful display. But to stream or download Amazon Prime Movies you need Adobe Flash. And unfortunately, the Samsung Galaxy Tab 3 8 doesn't support Adobe Flash. So you can't stream or download Amazon Prime movies. You can view movies through Google Play, but they seem much more limited in the number of free or reasonably priced movies.I agree with another reviewer who said that the Samsung Galaxy is very google-centric, which I'm not crazy about due to data privacy issues. This device is really designed to work with google apps and products. Unless you want to go down the google road, this device is a headache. (For example it took me 30 minutes to change the default browser from Google.)This is my first experience with tablets and I have to say I feel that they are very overrated, or if they were less expensive it might be worth it. Most of the tablet platforms don't play well together or force you to use certain products, which is unfortunate for consumers. I would rather get a smaller laptop and have full features and have more flexibility in choosing the products and service providers I use.Update: 11/11/12 -I signed out to update my review in terms of privacy with this device.If you value your privacy (and I don't mean that sarcastically -- some people really don't care about sharing a lot of information) you may have a hard time with how much of your privacy you are prompted to or must waive to google to use the device and many of the features. For example, I have received book suggestions based on the content in my gmail/google hangouts, you have to enter a credit card to download free content from the google play store, and many others. I realize that most people born after 1990 have a different outlook on this compared to people who remember life before facebook, and computers for that matter.I agree with the person who commented that another tablet might be better for people who want to use a tablet for pure recreation. I want to turn the thing on and be able to watch a movie or play a few games. I don't want to spend a lot of time searching for ways to do something that I should be able to do with a single tap on the tablet.For people who say there is a way to stream or download amazon prime movies on this device and/or download adobe flash (that's required to stream/download amazon prime movies), please share the step-by-step how-to details in the comments. If I find a way to do so, I will update the review. I've seen a lot of how-tos on installing flash on tablets running jellybean 4.1, but nothing for jellybean 4.3. Also there seems to be a way to download flash on android phones running 4.3, but not tablets. So until then, I stand by my review that you cannot stream or download amazon prime movies on this device.", "Date": "November 7, 2013"}, {"Title": "Returned twice due to the same issue. Choose another tablet.", "Author": "John Collins", "ReviewID": "RDD30IRKSG4BT", "Overall": "2.0", "Content": "I had gotten one of these Samsung tablets for Christmas without having owned a tablet or an Android device. The experience of owning one for the first time was great. My problem happened about a week or less before I took it back to Costco. The battery on my brand new tablet device was bad. It stopped giving an accurate estimation of the battery life and stopped charging altogether. I tried different cables and outlets (it uses a universal USB cable) and it still would not charge. The battery ended up dying and I held the power button to see if it was really out of battery. It wasn't! It had 4x% battery remaining. It had to reboot to see the remaining energy. It's nice to know when my tablet is going to die and when it isn't. I plugged the tablet back in with its new 4x% and it still remained uncharged.Needless to say, I returned it to get a new one. This one lasted about a month longer until I ran into the same battery issue. I plugged it in and it no longer charged. On top of that I had an issue where my screen went completely bonkers and wouldn't let me control anything (this was a one time thing, but it was interesting seeing my tablet rearrange itself).Is this device all bad? No.Should you buy a different tablet? YesFinal comments:It works as a device, but I'm unsure of how long it will last. The design is average having a few physical buttons and a couple touch screen buttons (which are pressed frequently by accident)", "Date": "March 7, 2014"}, {"Title": "Very nice tablet !", "Author": "Mark Tussing", "ReviewID": "R21BZAXVTES7HS", "Overall": "5.0", "Content": "My wife enjoyed her christmas present and i enjoyed saving alot of money.I would recommend this tab to evreyone Who enjoys electronics.", "Date": "January 28, 2014"}, {"Title": "battery", "Author": "Craig", "ReviewID": "R108EEQNZADX91", "Overall": "2.0", "Content": "The battery doesn't last long at all and it takes almost as long to charge it.Other than that its pretty good.", "Date": "December 28, 2013"}, {"Title": "LOVE IT!!", "Author": "Jose Berrios", "ReviewID": "RF6BBISBGHLJA", "Overall": "5.0", "Content": "Thank you beach camera for being the only one who would ship it to me!! Had problems with FedEx though . They couldn't find my house and claimed it was the wrong address. Even though I only use that one address. And I ordered countless things before and never had problems. so I had to go and picked it up. But other than that.  I love my awesome tablet!", "Date": "October 28, 2013"}, {"Title": "Great phone.", "Author": "eyeziko", "ReviewID": "REVDA6087WYC8", "Overall": "5.0", "Content": "Doing great so far.........,is meeting all expectations. Smart,light and sleek and not as large as it looks and the size is just right.", "Date": "August 30, 2013"}, {"Title": "Great", "Author": "Go blue 10", "ReviewID": "RDHM3JTGHN1Q3", "Overall": "4.0", "Content": "They shipped it in a envelope which had no protection. The tablet it self is great. Perfect for people who only need the basics in a tablet.", "Date": "August 14, 2013"}, {"Title": "Great tablet, but I have few questions", "Author": "Baofu Qiao", "ReviewID": "R3JYLBJ07MTI4F", "Overall": "5.0", "Content": "I am using it for couple of days. So far, I enjoy it very much. But I have a few of questions. Anyone can help me?1. My MicroSDHC (class 4) card doesn't fit the memory card slot physically. It can not be locked inside the slot. From the manual I downloaded from samsung.dom, MicroSD and MicroSDHC cards both are compatible with the Samsung Tablet3 8.0. so what kind of problem could it be?2. Anyone knows how to run multi-windows on the same screen? I have tried \"Samsung Multi Window Manager\". But it keeps asking me to reboot the device when I run the program.", "Date": "July 17, 2013"}, {"Title": "Compared to the iPad Mini - it is weak hence 2 Stars - BATTERY TERRIBLE", "Author": "SF Guy USF \"SF Guy USF\"", "ReviewID": "R2BZJMPTQBXT1W", "Overall": "2.0", "Content": "Compared to the iPad Mini - it is weak hence 2 *'s - again it maybe unfair to compare it but considering the price is the same you get so much more quality for the money with the iPad. I tried to break away from Apple and after reading the AMZN reviews the Samsung Galaxy Tab 3 8\" seemed really solid. How wrong I was!However, here are the reasons I give it 2 stars:1) BATTERY LIFE IS TERRIBLE.  I would leave mine over night with 90% charge, bluetooth off, battery saving mode off, most apps shut down and it would be dead the next morning. A 30 min run on the treadmill watching a movie would kill 20% of the battery.  Compared to iPad Mini - you will go a solid 10 hours no questions.2) Usability for kids - nowhere near that of the iPad.3) Overall usability - weak.4) Playing movies directly to my new Samsung Smart TV was very clunky and it would crash every 5 mins!!!I moved to Android because I loved the idea of open apps (which are wonderful) and the SD card expansion slot (which is a HUGE +) - but the device itself currently is far inferior to the iPad.I just returned it today after a solid 2 week test drive. I lost out on a new case I bought and a screen protector.... but that is the price I paid.  Back to buy another iPad Mini. Just wish it did not cost $100 for every 16GB - that is a rip off and Apple should be ashamed.", "Date": "November 21, 2013"}, {"Title": "Where is the perfect Galaxy tablet?", "Author": "D. Snow", "ReviewID": "RWU8IZ43F52B", "Overall": "4.0", "Content": "`The perfect tablet would have an 8-inch screen like the Galaxy Tab 3 8\", and the resolution of the new Nexus 7 tablet:  1920 x 1200 pixels.When will Samsung offer this tablet?Because reading small text on screen looks MUCH better if the resolution is 1900 x 1200.", "Date": "July 31, 2013"}, {"Title": "would love to give it 5 stars", "Author": "A. Ferrin", "ReviewID": "R32PTCROC3W3YH", "Overall": "3.0", "Content": "But the fact is, I'm not a big Android fan and Samsung has made it harder to like Android. Between Samsung and Google stuff loaded on the device, it's hard to strip it down to being a useful tablet.Right now this tablet spends 95% of it's time running Touchsquid (app) and being used as a remote for our entertainment system. Got it mainly for it's IR blaster...so to that end, it works.", "Date": "January 17, 2014"}, {"Title": "possibly the worst tablet", "Author": "Jk Sharif \"JK\"", "ReviewID": "RMV9403IB9B7Y", "Overall": "1.0", "Content": "bought this tablet because of the size 8\" but the tablet is terrible. Freezes up all the time and the Smart stay does not work at all.", "Date": "January 14, 2014"}, {"Title": "No service", "Author": "V. Zhuo \"VZ\"", "ReviewID": "R1L89ZDLO8AV3", "Overall": "1.0", "Content": "The Galaxy Tab 3 I purchased from Amazon didn't even pass the initial set up. I came to Amazon to find service and found the only service I have is to return it. But unfortunately I have passed the return day. I went to Google maps to find Samsung authorized service center in San Francisco bay area and found none. I went to Samsung's web site and found I can't get too far. There is no way I can find something similar to Apple store. The live chat was too busy and it didn't even give me a choice to wait. I own iPhones. I bought Samsung Tab 2 and now Tab 3 thinking to support competition and to learn Android. It's been fine until I need service. I would think twice, and many times, next time when I want to buy a Samsung product.", "Date": "October 24, 2013"}, {"Title": "Would not recommend this product", "Author": "Jack \"Jack\"", "ReviewID": "RI0K4NAQ64UYZ", "Overall": "1.0", "Content": "Product failed to work with my WIFI. Called Samsung customer service , spent almost 3 hours on the phone trying everything they suggested but nothing worked. I finality gave up when it became apparent they were not going to help. I decided to return it.", "Date": "January 1, 2014"}, {"Title": "price is very high", "Author": "giorgi arabuli", "ReviewID": "R1CZKNWPD8ILUH", "Overall": "3.0", "Content": "i thins price is very high because another tablet's price is lower than this..tab is good but price is bad", "Date": "February 25, 2014"}, {"Title": "As expected", "Author": "Muggie", "ReviewID": "RC37BI7QINT2U", "Overall": "5.0", "Content": "I bought this as an unlocked phone and as usual Samsung has not disappointed. Most of my electronic gadgets are from Samsung. I just love the product.", "Date": "August 12, 2013"}, {"Title": "DO NOT BUY", "Author": "Amazon Customer", "ReviewID": "R1UI9VMM3ORFL2", "Overall": "1.0", "Content": "You have successfully lost another Samsung customer.  My Tab hasn't been working more than it has been working.  I switched from my iPad to this and I am 100% unhappy with my decision.I lost all my sales today because my tablet will not charge and I use it to accept Visa.  When I call, they ask me to SEND IT BACK IN. Are you kidding me?!  For the same exact issue?!  No way.Send me a new tablet.  I cannot be out WEEKS while I wait for it to ship. then get repaired, then ship back.  I guarantee you it won't even be fixed anyway.Your customer service is just as bad as your products.  I'll be sure to share my story whenever and wherever I can.  If I can save customers from this headache, I will.Make it better Samsung.  Without your customers, you wouldn't be Samsung.", "Date": "February 24, 2014"}, {"Title": "Not a fan", "Author": "Jane Cisonno \"Jane-O\"", "ReviewID": "R32W3QRZDX0CBU", "Overall": "2.0", "Content": "Not a fan of the tablet or the phone.  Purchased the Samsung S III phone new and 3 months later had to get a replacement in the form of a reconditioned phone. The tablet is no better as it switches websites whenever its ready to and pulls up previous searches.  Just wish I could return it", "Date": "February 3, 2014"}, {"Title": "Sumsung Galaxy Tab 3, Model SM -T310, E mail feature not compatible with Apple Router in conjuction with a Windows Laptop", "Author": "Teddy Aclan", "ReviewID": "R2UQYE98J0NO1N", "Overall": "2.0", "Content": "If you are using an Apple Router,and have a Laptop with Windows OS, The E mail feature of a Windows Base computer via  Outlook Express will not work. I have to turn Off the Tablet and re-boot my Laptop to make it work. Very annoying. The Sumsang Tech support using 1-800-SAMSUNG is no Help and will take you more than 25 Minutes to get a live person.Thank to Amazon, I was allowed to return my Galaxy Tablet without any hassle. It may just Take a while to get my refund back.", "Date": "January 22, 2014"}, {"Title": "Open box!", "Author": "John Calvin \"Geneva\"", "ReviewID": "R2DR8NHAQ2HHKH", "Overall": "1.0", "Content": "Purchased this for my wife for Christmas. It arrived on Christmas Eve (VERY FAST), but it was an open box! The factory seal was broken, screen protectors had been removed and put back on (air bubbles all over the screen cover and the back cover). Returning it!", "Date": "December 31, 2013"}, {"Title": "Happy with it", "Author": "Arihana", "ReviewID": "R1Y1X5W95T54PN", "Overall": "4.0", "Content": "Happy so far it is very convinient, ligth, and great size. Just one thing, it does not accept SIM CARD :(", "Date": "November 27, 2013"}, {"Title": "Just what I wanted", "Author": "Pedro Guerra", "ReviewID": "R1YJZ2T0H059RA", "Overall": "5.0", "Content": "much better that the I-pad.easy to use and much more accessible. Apiticaonand gramenawer to complete all the words required. OK", "Date": "August 10, 2013"}, {"Title": "Not bad at all", "Author": "Jean Baptiste Glardimy", "ReviewID": "R2O2OT7EFRZSRE", "Overall": "4.0", "Content": "It's really performent, light, beautiful, and have a lots of features. Only thing is the battery that i think is not perfect. It should give more using time. map relax mwen avel la toujou", "Date": "August 9, 2013"}, {"Title": "It okay.", "Author": "hoang pham", "ReviewID": "R1D1BKV47I2ZS8", "Overall": "4.0", "Content": "Good, but I,m not impress. Samsung need to do more to beat apple. I have  galaxy phone. I love it. But not the tablet.", "Date": "August 27, 2013"}, {"Title": "D.O.A. after 2 months", "Author": "Mark Holm", "ReviewID": "R217S70O6KRJDF", "Overall": "1.0", "Content": "I am a multi system computer user. I've been using Windows since before windows - in the era of DOS and currently have a Win 7 PC. I've been using various distros of Linux since 99 and Mac OS since 0S 8 and loved my Amiga 2000. My current phone is an iPhone 4s. My wife wanted a tablet so after some research, the Samsung appeared to fit the requirements. Once it was received and a few minor hiccups resolved, it quickly became my wife's daily choice for her computing needs. I had a chance to also use it to become familiar with it and help my wife who is defiantly a non tech type. Over all I was fairly pleased with the android OS  though have had issues getting credit for appps that came with buying the device. Android on this device was easy for me to pick up and the only initial complaints I had were the case I bought and difficulty of getting a easy to apply screen cover which no matter how hard I tried would not adhere to the screen without bubbles which would get worse after just a few days usage - made me truly appreciate my otterbox for my iPhone. generally speaking the apps are good - just not quite as good as my iPhone apps but over all I'd say They did the their job good -I care for my electronics so I can assure that this device was well cared for and protected from tje elements than can cripple or ruin any electronic device. So today after, after charging was completed, and indicated that the battery was full. The unit was unplugged from the wall and NO GO. The on/ off switch did not function and so far have been unable to get the table to turn. So the only rating I can give it is 1  - for it to die with less than 2 months of usage is unacceptable. So this is an initial review ... story to be continued as I try to trouble shoot the issue and see what samsung will do", "Date": "November 11, 2013"}, {"Title": "8-inch screen + 2012 tech + questionable ergonomics", "Author": "Geek-by-heart", "ReviewID": "R2MQ7JA6J1CBS6", "Overall": "3.0", "Content": "The only single reason to buy this tablet is if you need an 8-inch Android tablet from a big-name manufacturer. That is it. No other reasons.If you are content with 7-inch then get a new Nexus7, it is faster, has higher resolution and is cheaper. If you like Macs or prefer 4x3 screen then get iPad Mini, although its pixel density is too low for reading. Finally, if you want an Android tablet larger than 7-inch then find a Toshiba Excite 7.7 on a closeout sale for $200, it is a better tablet than the Tab3 8.0.Now in more detail.* The screen is ok. Not super high-res, but higher resolution than the iPad Mini, ok for reading although I can see some aliasing but I don't see pixels. I do see pixels on the iPad Mini, which means that 163 ppi (the Mini) is not enough, while 189 ppi (the Tab3 8.0) is just ok. I would prefer 250 ppi for comfortable reading. The screen has proper white balance, not bluish or greenish, and shadows and highlights are rendered well.* It is fast enough for reading, some gaming and watching movies. No problem with 720p MKV video.* JB 4.2 is a rather modern Android version. But it is in phone mode, not tablet mode, meaning different location of some controls like notifications. Just a gotcha, not really a problem.* Physical buttons are old tech for Android, but Samsung still uses them. Ok, I don't mind, with physical buttons the whole screen is used for content, which is always good. But the Menu and Back buttons are too sensitive and get in the way when you use the tablet with two hands in landscape mode. Really, really annoying and you cannot turn them off! I've read that only if you root the system you can change system properties to turn the pesky buttons off. But then some people have problems turning them back on. So beware.* No finger rejection feature that the iPad Mini has. Basically, you can hold the Mini with the thumb on the screen and still use another finger for tapping. Not so with the Tab3 8.0, and you cannot hold it at the edge as the bezel is too thin. Holding it with two hands is problematic as I wrote above, so the only way to hold the Tab3 is across the back, in open palm of the hand. Pitiful ergonomics. Samsung engineers never tried using their product, I am sure it went directly from a computer model to production.* White plastic instead of aluminum or magnesium. I personally don't care, but after a couple of weeks the shiny plastic will get all scratched, and the tablet will look like 5-year old device.* MicroSD slot is good, what can I say. No HDMI out, whatever.* Charges through USB, no separate charge port. This is good as you don't need extra cables, but charging takes long time.* Specs: ok for 2012, not enough for 2013. The Toshiba Excite 7.7 released a year ago has the same or better specs and better build quality and is thinner.* Discharge when in standby mode: initially it discharged in less than a day, twice. But charged for the third time and it is already a day and a half, and still 91% of juice left (wi-fi left on). So not so bad as I initially thought.", "Date": "July 27, 2013"}, {"Title": "NICE LITTLE MIN TABLET", "Author": "MS. TERRI MIMS", "ReviewID": "R3JM6A21Q2F8LL", "Overall": "5.0", "Content": "AFTER GETTING IN THE WORLD OF TOUCH SCREEN LAST YEAR I THUOGHT I WOULD NEVER LEARN TO WORK MY FIRST PHONE  MINE YOU I AM IN MY LAST 40*S  AND ARE NEW TO ALL THIS WITH BEEN WITH MY DESK TOP FOR YEARS  WANTED TO TRY MY HAND @ THE TABLE MY HUSBAND GOT THE 8 INCH  I THOUGHT ABOUT THE 7 AND THE 10  AND IT FIXS IN MY PURSE FINE HE PURCHASE THE BLUETOOTH KEYBOARD ALSO WHAT CAN I SAY I AM  TYPING THIS REVIEW ON IT  THANK YOU HUSBAND FOR MAKING A GREAT CHOICE AND AMAZON FOR SHIPPING IT QUICKLY", "Date": "January 1, 2014"}, {"Title": "Good One.", "Author": "chandra", "ReviewID": "R3MFCWNSEM9EE9", "Overall": "4.0", "Content": "My first impression.Its is light and looks pity decent and screen resolutin is not so great it is decent and wi-fi is good and sound is normal. I have jbl flip and when connected it play good. I would say it decent take.", "Date": "August 15, 2013"}, {"Title": "Seriously flawed.  Keeps rebooting.  Can't  get it out of reboot loop", "Author": "E. J. Penn", "ReviewID": "R1W7FYAZMHV5CY", "Overall": "1.0", "Content": "Product seriously flawed.  Poor customer support from Samsung.  Went on line and did the recommended Samsung protocol to fix the problem.  Right back to the reboot loop.  Can't return it to Amazon.  Return period mysteriously expired just 7 days prior.  Very disappointed with Samsun and Amazon.  I am done with both.", "Date": "February 5, 2014"}, {"Title": "Disappointed", "Author": "Galen", "ReviewID": "RBCCAGDZY0GMV", "Overall": "1.0", "Content": "Bought this 8\" Tab for my wife for Xmas from Best Buys.The charger cord plug in is very small & it had a defective pin.This was caused by a defective charger cord right out of the Box!Down loading books to read was very slow & some times was not complete.Online credit card account a pain ,to buy most books.Very Disappointed with Best Buy Service TechI didn't buy the extended service contract ,Big Mistake!", "Date": "January 13, 2014"}, {"Title": "No Flash Player support - doesn't work on airlnes or Amazon Prime instant videos.", "Author": "Bill", "ReviewID": "R3TQNUH1P6WSUC", "Overall": "1.0", "Content": "Purchased to use while traveling.  No Flash Player support available so the Galaxy Tab 3 does not play Amazon Prime instant videos, or work on SW Airlines for in flight movies and internet access, etc.  I was told by Amazon that \"At this time, Amazon Instant Videos cannot be streamed or downloaded to Android devices. I'm sorry for the disappointment this may cause. The Android OS has been switched over to HTML/ HTML5 platform from Flash. This is the reason you will not be able to stream the videos.\"  It would have been useful to know the product's limitations before placing an order.Another problem is the user manual.  I could not access the internet via public access at airport and, without online access, I could not remedy this problem since the user manual is online.  Once I got home and was able to access the online user manual, I found it poorly written and not well organized.  The answers may be there but the user is constantly referred back and forth to multiple pages to answer even the most straightforward questions.  Recommend an aftermarket book, e.g., \"My Samsung Galaxy Tab 3\" by Eric Butow.My family members have not had similar problems with their iPads or Kindle Fire tablets, so I will try one of those next.", "Date": "November 4, 2013"}, {"Title": "Disappointed!", "Author": "Randy", "ReviewID": "R1G7EGUZAME9TA", "Overall": "1.0", "Content": "I should have spent a few more dollars and got an iPad air. I am disappointed for not going with my gut feeling!", "Date": "December 16, 2013"}, {"Title": "for geeks only", "Author": "john kaufmann", "ReviewID": "R3BTW6HTK5RQ0T", "Overall": "2.0", "Content": "If you are new to the world of tabs/pads  don't buy this one. It is not user friendly and has virtually no instructions. (they are printed on a piece of paper the size of a credit card.) Apparently the mfrs figure anyone who orders this unit is upgrading.It is stuffed with all kinds of apps you probably don't want or need.It also has this creepy eyeball thing that stares at your face to see if you're looking at it.(only works in the right lighting). I don't like some device connected to the world, recording my face.Worst of all, the unit is almost impossible to use in the hand held horizontal position. They've got the \"back\" and \"menu\" buttons almost at the edge of the case, and you constantly are touching them inadvertently. Lots of fun when watching a video.I'll probably give this a gift to my daughter for BD. I'll stick with my Kindle.", "Date": "August 6, 2013"}, {"Title": "I'm holding out hope...", "Author": "Bill Jones", "ReviewID": "R3KFYMFEYQ1PXR", "Overall": "2.0", "Content": "My first tablet the screen died in 1 day, Amazon is sending me a new one overnight. I will update my score after I have a few days with it. Only issue I had found for me, was not hardware related but with the Smartwiz launcher. Apps screens the fonts were to large and icon spacing could have been tighter. But I downloaded Apex Launcher Pro, and it fullfilled all my configeration needs.", "Date": "July 17, 2013"}, {"Title": "No Multi-User Function!", "Author": "Jurgen Braungardt", "ReviewID": "R1GX4WSR9QNR4G", "Overall": "2.0", "Content": "This is a nice tablet, and a great form-factor. My main complaint is the lack of a multi-user function, which is built into Android 4.2 and already offered for Google Nexus tablets. I don't understand why Samsung does not offer something as important as this for a mainstream tablet. At this point, I can not recommend buying this device, and I suggest you wait until the new Google Nexus becomes available.", "Date": "July 16, 2013"}, {"Title": "I would rather have my first gen ipad back", "Author": "christina1521", "ReviewID": "R2EE4F06TK5HVK", "Overall": "1.0", "Content": "Maybe best buy sold me a bad egg, maybe it's really not worth a penny...I've had it for 3 days, google chrome already crashes regularly.  The zooming and copying capabilities are terribly inconvenient.  What do you do with a keyboard that refuses to retract?  I seriously can't download firefox?  It's going back asap.1) illogical settings RE: copy/paste2) no clear way to retract a keyboard that takes up half the screen3) system is already crashing and freezing4) downloads from chrome don't work5) search boxes on engines and email constantly freeze6) polaris office set up is also illogical, it allows you to edit before giving the option to actually create a docafter some wear and tear and a few months? Maybe.  After 3 days? Come on.", "Date": "July 17, 2013"}, {"Title": "No joy here", "Author": "W J. LANE", "ReviewID": "R6EN3J0I9JD9U", "Overall": "2.0", "Content": "This d- vice had a bad display. After waiting for a while to get It, it only took me a couple of hours to see the bad corner on the display.Why did it take so long you ask?  I was trying to work my way through the Android op system and Google app system.Had it  bout 3-4 hours before  I boxed It up.", "Date": "July 18, 2013"}, {"Title": "Low quality, slow plasticky.", "Author": "Book buyer", "ReviewID": "ROFVRW5UAGO18", "Overall": "1.0", "Content": "This device feels and look every cheap.  the screen is low resolution with garish colors and is basically invisible outside.  it is slow and laggy as well.  Junk.", "Date": "July 18, 2013"}], "ProductInfo": {"Price": null, "Features": "Android 4.2 Jelly Bean OS, 1.5GHz Dual-Core Processor\n16 GB Flash Memory, 1.5 GB RAM Memory\nStore photos, videos, music, and more with up to 64GB of memory available through a microSD slot and 50GB of free Dropbox storage\nCamera: 5MP rear-facing, 1.3MP front-facing\nPre-loaded with free content including Hulu Plus membership, Google Play credit and Boingo Wi-Fi Access", "Name": "Samsung Galaxy Tab 3 (8-Inch, Gold-Brown)", "ImgURL": "http://ecx.images-amazon.com/images/I/41JoGauLg9L._SY300_.jpg", "ProductID": "B00DEZ5DRS"}}