{"Reviews": [{"Author": "Anthony", "ReviewID": "R2GKZZK9PNHK92", "Overall": "5.0", "Content": "This tablet is very impressive and I was shocked when i realized how nice this tablet actually is. I own 4 tablets as well as a Kindle Fire, and this tablet definitely keeps up with everything I throw at it. It is surprisingly fast and rich in features.This is NOT one of those \"cheap\" tablets that are always run-of-the-mill, and lack in features. It has Google Play where as others don't. Oddly enough, this tablet keeps up with one of my other tablets that I paid about twice the price for. Also, I noticed that this tablet is the exact same size as an iPad mini.I really have no complaints about this tablet. Everything works as expected and often times better than expected. It really does.As for people who complain that it is plastic, that complaint is ridiculous. Of course it is made from durable plastic, That kind of complaint is most likely made by people who have iPhones that have metal backs, other than that, they are plastic as well! Not to mention, the problem you see on EVERY iPhone is that the metal backs are seriously scratched up, where as this isn't. So keep that in mind.If you want to be a hipster that has a scratched iPad like everyone else, then go ahead.... However, if you want an incredible Android tablet for an incredible price, then you found it.", "Title": "This has to be one of the best Android tablets for the price!", "Date": "November 1, 2013"}, {"Author": "L. S. Gildersleeve \"Webdiva\"", "ReviewID": "ROLMBJUTIXJQ0", "Overall": "5.0", "Content": "I bought this ACER Tablet for my 11 year old Grandson for Christmas.  He loved it.  I also bought a 16gb SD Card to expand the memory because he loves music and I knew he would most likely use the 8gb's up.  The tablet is smooth and very fast considering that it is only a dual core processor.  He should get a lot of use out of it and you cannot beat the price.", "Title": "Awesome Tablet", "Date": "January 1, 2014"}, {"Author": "sue petrie", "ReviewID": "R20LQETUQJCQUH", "Overall": "4.0", "Content": "I was concerned this tablet would not perform well because it was not expensive. Very happily surprised with its performance. Loads fast, the battery does not get hot, and the graphics are clear and sharp. I didn't give it 5 stars because the viewing screen doesn't always expand ti fill total screen area available.", "Title": "Great tablet", "Date": "December 28, 2013"}, {"Author": "Amazon Customer \"sunnyside44\"", "ReviewID": "RKEWWIJRYBK64", "Overall": "5.0", "Content": "I hope I am not jinxing this but this unit really made someone happy and I got the kisses to prove it.It is sleek  and has all the functions a beginner unit needs before the bigger and more costly units.It has space for a mini card and has the ability to run Netflix or shop or load some apps.  Though I gave a warning that complex app are usually put on the hard drive and this only has 8 not the 16 my unit has.  So chose wisely and use happily.Fast Amazon service and so far a great product.I have had many Acer products and only one was a looser and that one was a unit they used the \"Atom\" brand chip with.  It was a mini laptop.To date there are 3 Acer tablets purring happily in our home.I am pleased and a lot richer than if I bought the...I someting", "Title": "BINGO THIS WAS A REAL CHRISTMAS HIT", "Date": "January 12, 2014"}, {"Author": "maurica king", "ReviewID": "R1EOTD04K5MJXY", "Overall": "5.0", "Content": "i am very pleased with this product, it is serving the purpose for which it was bought, and i would recommend it to anyone.", "Title": "worth the buy, works well.", "Date": "September 15, 2013"}, {"Author": "Robert M Kelliher", "ReviewID": "R30JC5XR2N7MM3", "Overall": "4.0", "Content": "Usually when I get something cheap it is truly cheap. I bought my first tablet a couple of years ago it was truly horrid. It had issues with YouTube and.wouldn't load most apps. This tablet is a vast improvement. It has met or exceeded most expectations. I was especially pleased when I discovered it had 12 gigs of internal memory. 50% more than the 8 gigs that were advertised. Usually I get less than I paid for, this time I got more.", "Title": "Great Value", "Date": "February 11, 2014"}, {"Author": "Throne Drone", "ReviewID": "R3E6H913T2ZBT5", "Overall": "5.0", "Content": "In this day and age where new gadgets are coming out every 6 months, this is a smart purchase. I bought this for a cousin who I know will use it for a year and then move on to better things. It's got the android market, user friendly, it's screen light is comfortable. Looks more expensive then I bought it for, and I would buy it again.", "Title": "Nice and affordable tablet.", "Date": "January 24, 2014"}, {"Author": "Sol Rivera", "ReviewID": "R23VTU6T2F2KHP", "Overall": "5.0", "Content": "In a simple review. Excellent tablet as seller for price!!!  Truly recommend it....Excellent for children over 10 years!!! buy this tablet you'll not regret.", "Title": "Really happy with the purchase...", "Date": "November 24, 2013"}, {"Author": "DERLIN PLASENCIA", "ReviewID": "R3VY3ATK901TLK", "Overall": "5.0", "Content": "PLEASED. I'M REALLY HAPPY WITH THIS TABLET, VERY GOOD, THE ONLY THING I IS BAD QUALITY CAM. RUN VERY WELL", "Title": "VERY GOOD !!", "Date": "January 20, 2014"}, {"Author": "Lee Traylor", "ReviewID": "R31HFPPBJFOTHE", "Overall": "3.0", "Content": "My son loves playing with his Mom's phone, but I always try (unsuccessfully) to dissuade her from leaving her expensive phone in the hands of our rough-and-tumble toddler. I thought getting him his own tablet for Christmas would give him a sense of independence and get Mom's more expensive phone out of harm's way. It's a decent tablet considering it's low price, but there are some definite limitations. I'm used to using an iPad 2, iPhone 4, and Surface Pro 2, so my review is in comparison to those higher-end devices.PROS:Budget tablet that won't be a huge problem if he breaks it.Has the Google Play store, so a ton of major apps and games.Decent screen - doesn't look like a cheap tablet at first glance.Build quality is pretty good for a \"cheap\" product.CONS:Slower than I'm used to. If you're used to using an iPad, be prepared to notice some lag with this device.Limited storage space. A lot of newer, more popular games on the Play store are around a GB - one or two of those and the device is chock full.Screen has very limited viewing angles. It's fine if you're looking straight-on, but as your line-of-sight gets angled, view ability drops off precipitously.All in all, it's plenty fine for my 3 year old son. However, if you're an adult and expect a frustration-free tablet experience, I'd recommend spending just a little bit more money to get a device that doesn't have quite as many limitations.", "Title": "Decent tablet for a 3 year old", "Date": "December 25, 2013"}, {"Author": "Steam-name: Gavnation00", "ReviewID": "R17ML7MWVE6PPG", "Overall": "4.0", "Content": "Well to start out: Its a budget tablet. You get what you pay for. You can expect as much as the hardware is described. For the price it performs very well. You can also do some things to increase the battery life to about 4-7 hours. There is some lag when moving things around but its not to much of a problem.The only actual problem I have is the:Bad viewing angels. Its either right at it or not at all.&The plastic backing. It feels very flimsy so it can worry me a little on how easy it might break but that can be fixed with a 12 dollar case.", "Title": "Great for the price!", "Date": "May 14, 2014"}, {"Author": "Raiza Calzadilla", "ReviewID": "R29CYBIY7T36X8", "Overall": "4.0", "Content": "It's a nice table, has good resolution on the screen, youtube videos look great. The photos are of lesser quality, but the price seems fair.", "Title": "Es buena", "Date": "April 29, 2014"}, {"Author": "Tiara Amethyst Wilds", "ReviewID": "RTQ2457STZ1LJ", "Overall": "4.0", "Content": "I thought it would be a little crappy, honestly, with the price tag, but it actually turned out to be a great tablet that fits all of my needs. The only downside is that the camera is only facing me. There is no outside camera. And the volume on it is really terrible. I just use headphones or separate speakers for it. But it's okay. I wasn't expecting gold. It was a good purchase, though.", "Title": "Worth the $120", "Date": "April 8, 2014"}, {"Author": "Deborah", "ReviewID": "R2GD54VLKIRFDQ", "Overall": "4.0", "Content": "I like it, my only complaints are that I cannot find where to set the browser I wish to use each and every time & the camera function. It appears that you can either guess that you have everyone or thing in the center or it is a selfie  - camera is a function of screen side only.  Also, it is hard to utilize in sunlight due to refection of the light - considering a security type screen to see if that helps.  Hope this is helpful.", "Title": "Acer - refurbished", "Date": "March 21, 2014"}, {"Author": "james g.", "ReviewID": "R2G14LDGQ1CE85", "Overall": "5.0", "Content": "got one for my niece for Christmas worked out great getting another one for another niece for her birthday.great tablet for the money", "Title": "great tablet for the money", "Date": "January 13, 2014"}, {"Author": "DEBORAH HIBBARD", "ReviewID": "R2KNTP42XKH4CC", "Overall": "5.0", "Content": "I WOULD RECOMMEND THIS TABLET TO ANYONE .......ITS GREAT AND  THE  COLORS ARE  VIBRANT  MANY PROGRAMS TO CHOOSE FROM .  I DO RECOMMEND  BUYING THE  CASE , DID NOT COME WITH IT BUT IT LETS YOU HANDLE THE TABLET EASIER .THE BACK OF ALL TABLETS SEEMS TO BE SLIPPERY AND WILL SLIDE OUT OF YOUR HANDS A LOT BUT THE CASE  KEEPS THAT FROM HAPPENING .  I GOT MINE DELIVERED 2 DAYS BEFORE I EXPECTED IT WHICH WAS A PLUS . OVER ALL I AM VERY PLEASED WITH MY TABLET .", "Title": "WAS SURPRISED HOW NICE THIS TABLET WAS !", "Date": "December 29, 2013"}, {"Author": "Herbert E. Larson \"helarson\"", "ReviewID": "ROJ9VMBP8LMPU", "Overall": "4.0", "Content": "I got the Iconia B1 because my desktop died it was a very good buy I was able to do what I would do with the desktop just as fast faster for some things. It does have a lot of bloarware but it has useful items to like AcerCloud and weather app. which has come in handy lately. I prefer Chrome for a browser and it downloaded and has worked excellent if your new to the mobile it takes a little learning not much then your good to go.", "Title": "Surprised It Filled All My Needs", "Date": "January 4, 2014"}, {"Author": "Jenn", "ReviewID": "RG3C3AM40GO15", "Overall": "5.0", "Content": "Pros:+ Price+ Android OS & the Google Play marketplace for apps (many are free)+ Fits nicely into your hands+ Fits nicely into a purse / bag+ Lightweight+ The screen can be dimmed down nicely (I hate blaring bright screens in the dark, it hurts my eyes)+ Video runs smoothly+ Picks up wifi just fineCons:- The volume doesn't get up loud (but neither does a phone & you have to realize that this isn't that much bigger than a phone). I choose to use my earbuds for any apps with sound (e.g. Duolingo)- Battery life is good but not greatOther:I bought mine about 3 weeks ago, so I have not attempted to use the camera. I have no use for the camera because I use my PC with Skype.Overall impression:I'm 35, so I use my tablet primarily to check business messages (e-mail and social media). I'm not a gamer.The reason I purchased this tablet is because my iPhone broke and instead of getting another expensive smart phone, I opted for a basic no-contract phone. However, I started missing the ability to check FB and e-mail when I'm not in my office. Coming from using an apple product every day, I honestly didn't expect much. I had two no name android tablets before and they were terrible... so much so that I gave them to my kids.I took a chance on this product because 1) the price is amazing and 2) I have an Acer PC that seems indestructible.I'm very satisfied with my tablet and I am glad I took a chance.", "Title": "Excellent Android tablet, can't beat the value!", "Date": "May 31, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3974KYZ7XF6IP", "Overall": "4.0", "Content": "Love it! I use it daily. The only drawback is the OS won't support video streaming from Facebook :-( bummer. Other than this it is a fine tablet.", "Title": "daily use", "Date": "May 18, 2014"}, {"Author": "l'homme de guerre", "ReviewID": "R38T42OR0YZ67Y", "Overall": "5.0", "Content": "this tablet works wonderfully and delivers all that i hoped for. When compared with prices for tablets that exceed four hundred dollars I think this is money well invested. Delivery of the item was quick and timely as well.", "Title": "Its Aces!", "Date": "May 18, 2014"}, {"Author": "Kandii", "ReviewID": "R3IS30D9WKYKTB", "Overall": "5.0", "Content": "I decided to buy this tablet for my 6yo son after going through 3 other tablets before that gave a lot of problems. He uses it all day, every day and its still performing well. Its a great buy.", "Title": "Happy as everrrr", "Date": "May 8, 2014"}, {"Author": "alvaro ruiz", "ReviewID": "R1LFFQR24SJABP", "Overall": "5.0", "Content": "lo unico que le falta para ser una tableta magnifica es conexion a internet por trajeta Sim, de resto es ideal. cuando está conectada a una red WiFi es ideal. la recomiendo.  the only thing missing to be a wonderful tablet is internet Connection Sim Card Cell of rest is ideal. when it is connected to a WiFi network is ideal. I recommend it.", "Title": "consideraciones sobre ACER ICONIA. ACER ICONIA lconsideraciones on.", "Date": "April 21, 2014"}, {"Author": "Mauricio Magana Salinas", "ReviewID": "R2XZRNS4EQZ459", "Overall": "4.0", "Content": "I bought two for a gift. Persons I gave them are really happy with the device. Quality is good. Camera and sound are not good.", "Title": "Decent Tablet", "Date": "April 8, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1BOG5TK477BKD", "Overall": "5.0", "Content": "I love it! I have been back and forth over purchasing a tablet for quite sometime. I saw how slow other tablets ran and it made me weary, I don't like slow things - when it comes to electronics, I expect instantaneous response from the devices. Since first starting this tablet after receiving, set up was lightning quick. I've had this thing a few weeks now, it is still quick as all get out - even with a bunch of apps on it and more! I am so happy I bought it, I can't express how much I've enjoyed having my Acer Iconia B1 :-D ..great price, too! with free shipping!", "Title": "LOVELOVELOVELOVE!!!", "Date": "March 16, 2014"}, {"Author": "nicholas fisher", "ReviewID": "R2SMBG9ORT7UU8", "Overall": "5.0", "Content": "I'm very happy another great Acer product. Fast shipment as well. I read a few bad reviews and he had me scared honestly. Let's say they were wrong", "Title": "Very good", "Date": "March 5, 2014"}, {"Author": "Diego", "ReviewID": "R3KGJD7CGZAX9I", "Overall": "5.0", "Content": "This is tablet is great, it does everything I am looking for, and it doesn't give me any issue with what I am doing", "Title": "Great", "Date": "February 10, 2014"}, {"Author": "Fabricio C.", "ReviewID": "R2PTPIGB051ZGB", "Overall": "5.0", "Content": "It's just what I had ordered, good price and good brand, it has GPS but no HDMI connection. I am very satisfied with my Acer IconiaGreetings from Ecuador, South America", "Title": "I love it", "Date": "January 28, 2014"}, {"Author": "nestor", "ReviewID": "R1C1T6SGZ5VFNQ", "Overall": "5.0", "Content": "Great Perfomance, Excelent Desing, fast and easy to use it, I'm using it to play Candy Crush, Read mails, and it works perfectly perfect gift", "Title": "Excelent tablet", "Date": "January 23, 2014"}, {"Author": "Brenda Pearson", "ReviewID": "R3DB2C2KZKUYF6", "Overall": "5.0", "Content": "The accessories are great and the speed is fast. Battery life could be a little better. However, compared to most, the battery life is exceptional.", "Title": "Great buy", "Date": "January 18, 2014"}, {"Author": "Marcia", "ReviewID": "R15SJ5K1WYP69X", "Overall": "4.0", "Content": "My daughter loves this tablet, it was a christmas present and it is eady for her to use she's eight", "Title": "present!", "Date": "January 13, 2014"}, {"Author": "potcakes62", "ReviewID": "R29V572REWYC64", "Overall": "3.0", "Content": "I was given this as a gift and I do love it but it has a serious flaw. The battery. I have to have this on charge all the time. It is no use to carry anywhere because the battery goes dead so fast. And another thing it is always saying running out of storage space. I tried deleting a bunch of stuff and one  or two days later it says the same thing. I tried researching what to do but I'm not that computer savvy.", "Title": "Would not buy because...", "Date": "April 26, 2014"}, {"Author": "kelly", "ReviewID": "RAXZ9B7QK7RRO", "Overall": "4.0", "Content": "I bought this as a Christmas gift for my mom.  She just needed a simple tablet for email and to listen to Pandora.  The tablet is simple to use and is perfect for my mom since she is not a computer savvy person. Great tablet for the price!", "Title": "Great tablet, great price!", "Date": "January 7, 2014"}, {"Author": "Luella L.", "ReviewID": "R2CBKFDDRA2FNS", "Overall": "3.0", "Content": "It was alright for a beginner it's light easy to use, fit in your purse, backpack and you can't beat the price", "Title": "Acer 7\" tablet", "Date": "December 31, 2013"}, {"Author": "Amazon Customer \"Maria LaFontaine\"", "ReviewID": "R3RASGIR365DS4", "Overall": "5.0", "Content": "I bought this tablet in a bundle set from Best Buy and I had to say that it's awesome!!! The screen resolution is better than the HP Tablet my husband pay $200 for! I love all the features and the personalization options. Unlike the Kindle Fire HD, you put on live wallpapers, a screensaver, and so much more!I'm so happy with it! For the price I paid I only expected to get a low quality product but really got an amazing tablet!", "Title": "Better than I expected!", "Date": "June 8, 2014"}, {"Author": "Buyer", "ReviewID": "R29KBZBJ915XKM", "Overall": "5.0", "Content": "Why would anyone buy an ipad when they have these for so much cheaper?  Works great, battery life is not the best but that is the only downside.  Very clear screen.  Does not have a car charger and DO NOT plug the usb charger into anything besides the provided wall jack or it will fry.", "Title": "very nice", "Date": "June 8, 2014"}, {"Author": "thomas", "ReviewID": "R2EQQPI2PRGEMV", "Overall": "5.0", "Content": "For the money I think this is a great buy. It's not the normal junk tablets we all made the mistake of buying at some point for 50 bucks . The a-1 Acer tablet is in the top 25 tablets, This however is the b-1  and not on that list however it is a value tablet. For what it cost I think anyone would be impressed .", "Title": "Did my homework, walked away with this one.", "Date": "June 5, 2014"}, {"Author": "Edward Hunt", "ReviewID": "R1HXU8V20RO1UM", "Overall": "5.0", "Content": "Nice tablet for the price. Screen resolution is good and the touch screen works well. My 11 year old nephew plays games on it all the time.", "Title": "Nice tablet", "Date": "June 1, 2014"}, {"Author": "N. Davis", "ReviewID": "R13JMM1SQY8412", "Overall": "5.0", "Content": "This is the perfect tablet for someone who does not want to spend an outrageous amount of money.  I purchased this for my spouse and we both now have one.  This is perfect for someone who is not using it as a personnel computer but as an extension.  Recently added the mini sd card to it and now have 15 extra movies. Love this little thing.", "Title": "Perfect for what I need", "Date": "March 12, 2014"}, {"Author": "Brittany", "ReviewID": "R14SQ3HS5C80LW", "Overall": "4.0", "Content": "I bought this product for my children and they love it.The shipping was fast and on time.The volume isn't very loud butfor kids that's not a bad thing.comes with a lot of apps which is awesomeits well worth buying and isn't too expensive!", "Title": "good for younger children", "Date": "March 4, 2014"}, {"Author": "Christine Fuller \"love my pets\"", "ReviewID": "RDIK5ANMOFAFE", "Overall": "5.0", "Content": "This table works great, internet connection was quick, he could do everything on it he needed to do.  Easy to use, he is only 4 and he plays on it all the time.", "Title": "christmas gift for grandson", "Date": "February 27, 2014"}, {"Author": "anita", "ReviewID": "R3F9G3WWKU9G1G", "Overall": "5.0", "Content": "purchase this product for my grandson for christmas 2013, dad bought the grandgirls some other brand and i like this the most will purchase again", "Title": "excellent", "Date": "February 25, 2014"}, {"Author": "Omar Alayoubi", "ReviewID": "R3ES1OVOA4FI9H", "Overall": "5.0", "Content": "It is fast and it is not that expensive. The price is really worth the product. I used it to check my emails to watch some movies online and to read books.", "Title": "Totally worth it", "Date": "February 14, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RG1K1UATXW1QH", "Overall": "5.0", "Content": "Fast shipping--product as listed. Love the Acer tablet.Reburbished-but (just like new).Well worth the price. I believe it is as good as a Samsung Galaxy.", "Title": "Exellent Tablet.", "Date": "January 31, 2014"}, {"Author": "E. Swenson \"esoterik1967\"", "ReviewID": "R2MUMOTSWSER2K", "Overall": "4.0", "Content": "I got this tablet from brownbox.com (refurb) for $80 and it works just fine. I don't expect it to perform like a $200+ tablet. It is what it is. Decent specs for the money except the camera is my only complaint. Its a dismal 0.3MP Front facing camera placed in a strange spot. And I wish I could unlock the bootloader and install a custom ROM.", "Title": "It is what it is. No complaints except the camera and I wish I could unlock the bootloader and install a custom ROM.", "Date": "January 30, 2014"}, {"Author": "Keith", "ReviewID": "R3COC870Y45O8Z", "Overall": "4.0", "Content": "Very nice tablet for the money. Works very well but the sound volume could be a little better.  Above average overall.", "Title": "Acer b710 tablet", "Date": "January 2, 2014"}, {"Author": "Fred N", "ReviewID": "RLAUOY4727IVP", "Overall": "2.0", "Content": "I've always had good luck with Acer laptops so I decided to try this tablet. Unfortunately it doesn't respond well to the touch, whether by hand or the stylus. But my biggest problem is with the Android operating system. I am unable to sign in to my online email accounts; I haven't been able to add this to my kindle device list; and I can't browse Amazon and other sites as well as  I can with a regular browser, by that I mean that it's crippled, I can't access all of the different categories. I believe that this is the fault of the built in browser.", "Title": "Too hard to work with", "Date": "December 30, 2013"}, {"Author": "Patricia Del Gatto", "ReviewID": "R22C93C5RKGVNF", "Overall": "3.0", "Content": "This tablet somehow cannot be charged via USB, only via AC outlet. Also, the screen has an odd sheen, and you must be looking at it perfectly in front, otherwise you won't be able to see much.", "Title": "no USB charging", "Date": "November 9, 2013"}, {"Author": "Patricia Love", "ReviewID": "R3CWFP5Q8UP88N", "Overall": "5.0", "Content": "i bought 3 of these for my grandchildren as Christmas gifts....i have set them up, and they work well. I was able to get online with them (after i put in the password) after they'd been charging for about 15 minsFrom the little time I spent  setting it up, it seems like it will be easy to navigate once the kids get the hang of it. once they know what button is for what......", "Title": "easy to use", "Date": "December 11, 2013"}, {"Author": "Anil Narayan", "ReviewID": "R26LWXTRYN354X", "Overall": "5.0", "Content": "Bought this for my Kid brother to use in school, so far it has done all that needs it for in school and he is on it all day some times with games and musicor on the various social sites, the battery life on this tablet is awesome.", "Title": "Great Tablet", "Date": "February 13, 2014"}, {"Author": "Happy Me", "ReviewID": "R2FQIXG66NOXRK", "Overall": "5.0", "Content": "Very responsive tablet. Easy set up. Son uses it primarily for school but enjoys the gaming, apps, and web. For the price - you can't beat it!", "Title": "Great tablet", "Date": "January 18, 2014"}, {"Author": "John", "ReviewID": "R10GDHCE25O65D", "Overall": "4.0", "Content": "Nice little tab I am giving it 4 stares because. It won't load pics in Facebook well. It takes forever. I even got adobe flash installedbut it did not help. All so when U use Google chrome and scrolling the screen jumps allover. And there is a lot of bloatware that youcan't uuninstall other than that Nice tab. I just did this review on it. Will update to 5 Stars if it gets better.", "Title": "Not bad.", "Date": "December 10, 2013"}, {"Author": "Alberto Gomez-rivas", "ReviewID": "R1GJZGSVEC40E3", "Overall": "4.0", "Content": "I read the specifications of this tablet and it says camera, who on earth will think or assume that the lens of the camera points to you and not to the world. Furthermore you start operating the camera and spend days to find what's obvious ! The table has a. Lens looking to you. Poor excuse to call this device fitted for teleconferences. The naive person purchasing this inexpensive camaraderie assumes that is for taking pictures of the world and friends. What it hurts me is that I advised it to a naive person that could not afford the expensive version but was hoping to run to take pictures, what an embarrassment for me.", "Title": "A good product with a big , unexpected shortcoming", "Date": "January 24, 2014"}, {"Author": "ada", "ReviewID": "R26RWXG6J5IVPH", "Overall": "3.0", "Content": "tablet has rear camera in addition to the camera is bad, no volume or short is absolutely nothing just listening to speakers and headphones, if you are going to acquire thinking listening to music or taking photos are not ever buy this product. the shipping was fast.", "Title": "volume sucks", "Date": "January 13, 2014"}, {"Author": "rob", "ReviewID": "RIOWZML04CBF9", "Overall": "4.0", "Content": "This was a great tab but I could not get the screen to auto rotate. The tab is as powerful as a lot of computers and I would have probably overlooked the auto rotate issue but I got a new iPad the day it was delivered.", "Title": "Lv it", "Date": "December 25, 2013"}, {"Author": "Captain EMO", "ReviewID": "R480B2NDHSHBI", "Overall": "3.0", "Content": "I bought a case with a built-in keyboard that was supposed to work with most tablets. Unfortunately supposed to didn't include this tablet. After looking around for a software update to allow it to work with the keyboard, I found out the USB port won't do it. If you look further into the specs, you will see that there are only 2 input ports. No HDMI outs, I got the tablet for free because of an ACER class action settlement so I don't feel too bad.", "Title": "The USB port has limitations.", "Date": "January 16, 2014"}, {"Author": "Ronald Brad Murphy", "ReviewID": "R18SCZXCQY5Q7W", "Overall": "5.0", "Content": "This is a gift for my son in California, an 8 year old.  I shipped  it directly to him, so I can not do an actual review, but the price was a great deal!", "Title": "Christmas Gift", "Date": "December 8, 2013"}, {"Author": "Kevin", "ReviewID": "R1M69TJU57GBKO", "Overall": "2.0", "Content": "When i read the specs it said it had front and back camera it has no back camera. This was unsatisfactory. Would have returned it if not for xmas.", "Title": "Disappointed", "Date": "January 3, 2014"}, {"Author": "S. Murrell", "ReviewID": "R3MW8FZXTU28YZ", "Overall": "3.0", "Content": "It's a nice tablet with a solid feel and very good specs but the sound quality is poor. I purchased this for my grand daughter so that she could play games and watch movies and videos but the sound is barely above a whisper, so the purpose is defeated.I did call the Acer service number and their representative suggested using a speaker with the tablet or sending it back for them to check for hardware issues, neither suggestion was feasible for me as the sound shouldn't be so poor as to need external speakers and I planned to give my grand this as a gift for xmas. Ah well, back to the drawing board.", "Title": "It's a nice tablet with a solid feel and very good specs ...", "Date": "December 12, 2013"}, {"Author": "Judith Ann Kramer/Johnson", "ReviewID": "R26I1D55A1ICGJ", "Overall": "1.0", "Content": "I bought this tablet at HSN 11-22 and still cannot get it working.  Am  I the only one in the country having a problem.", "Title": "not working", "Date": "December 27, 2013"}, {"Author": "andrew rackerby", "ReviewID": "R2AMMU7LNKZM4I", "Overall": "2.0", "Content": "Does basics, internet, email, apps etc.  Don't expect the bluetooth to connect to your Iphone though for a hotspot.  Not compatible.  Camara Sucks.", "Title": "Only an OK device", "Date": "December 26, 2013"}, {"Author": "Delise Wight \"Wighty\"", "ReviewID": "R2FAMRLK4VN2SK", "Overall": "1.0", "Content": "speedy delivery ,packaged excellent  but I if was disappointed i when my 7 yr old told she couldn't take picture outside she only could take pics of herself I was really disappointed", "Title": "Was disappointed", "Date": "December 26, 2013"}, {"Author": "Aneka", "ReviewID": "R29RU0O23Q9CF5", "Overall": "2.0", "Content": "This is the worst tablet I have bought and believe me when I tell you I have bought more than 6 different brands.  This is not user friendly and need work.", "Title": "Not User Friendly", "Date": "February 17, 2014"}, {"Author": "Edgar Alourbano", "ReviewID": "R13V2SWY1CU7DS", "Overall": "5.0", "Content": "Recibi mis equipos y los configure, son el regalo de navidad de mis hijos. Lo poco que la use me gusto. parece ser un buen equipo. saludos! / I received my equipment and set up are the Christmas gift of my children. What little I liked using it. seems to be a good team. greetings!", "Title": "mi opinion / my view", "Date": "October 19, 2013"}, {"Author": "Jesï¿½s Uruchurtu", "ReviewID": "R37I3MHEGACR0J", "Overall": "2.0", "Content": "I thought it was the one that came with Windows 8, and that's why I bought it, I can't exchange it now, so I think I'm gonna give it to one of my kids to watch movies while we travel, I don't see any other use for it.", "Title": "Not what I expected", "Date": "December 14, 2013"}], "ProductInfo": {"Price": "$129.99", "ProductID": "B00DKFF386", "Features": "Android 4.1 Jelly Bean, 7 inches Display\nMedia Tek MT8317T 1.2 GHz\n8 GB Flash Memory, 1 GB RAM Memory\n3.5-hour battery life, .73 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/413X4RPUUDL._SY300_.jpg", "Name": "Acer Iconia B1-710-L401 7.0-inch 8GB Tablet (Pure White)"}}