{"Reviews": [{"Title": "Feel grownup", "Author": "C. M. Denny", "ReviewID": "R3MCUULUML94WL", "Overall": "5.0", "Content": "It's so nice to find a product that is for a little girl that doesn't seem like an infant toy. This tablet fit the bill, well made yet kid friendly.", "Date": "January 21, 2014"}, {"Title": "Great Product", "Author": "tabitha tyner", "ReviewID": "R1FY3MCASE363V", "Overall": "4.0", "Content": "Overall its a very good product.  It has very nice features.  My daughter loves the app store, she downloads tons of free games. It does run slow loading up different apps. Great gift for any child.", "Date": "January 8, 2014"}, {"Title": "Great Gift", "Author": "Brittany Koehnle", "ReviewID": "R1XLL82GNXPUVE", "Overall": "5.0", "Content": "this tablet is amazing! my daughter loves it and nvr puts it down! perfect birthday gift. i think im gonna get the blue one for my son.", "Date": "April 6, 2014"}, {"Title": "I liked", "Author": "redrumsport \"redrumsport26\"", "ReviewID": "R3BHRQM8NC5BDY", "Overall": "5.0", "Content": "I bought this for my 10 year old daughter she fall in love with it that what makes me happy and that's all I'll sayI know there's a lot of bad reviews but people please get real with it you cannot compare this whit tablet is for kids not for adults remember that", "Date": "February 3, 2014"}, {"Title": "Not worth it!", "Author": "Tim", "ReviewID": "R122021B5SR9UI", "Overall": "1.0", "Content": "My daughter had protection case and her cousin drop it by accident now the touching sensor is not working so she really didnt get to play with it!", "Date": "June 6, 2014"}, {"Title": "I tried to like this but it just doesn't live up.", "Author": "C. Mcgill", "ReviewID": "R1GMP2W4WW9BPO", "Overall": "2.0", "Content": "I wanted a tablet for my kid who is almost three and he broke and cracked the screen on the ipad so I was looking to get him a kid centric tablet to replace it. I ended up with this afunta af705 with the dual core cpu. I can't really tell it is a dual core anything though and it is a bit sluggish and I hate to imagine the single core model. I mean this thing is not awful for a $60 tablet but it just looks and feels like a $60 tablet which is a letdown no matter how you look at it. I mean they seemed to try, the case is cool and all but the awful low res screen and crappy kids software that confused my kid more than helped him. Why for instance does it remind us every time we load an app from the kids screen that we can press home to go back with a big arrow pointing to home. That makes my kid want to just push that button before the game even launches. But the real problem here is the simple unavoidable fact that the apple ipad in any form is a far far far better device for kids. The apps are super top notch and actually keep my kid entertained and learning for long periods of time. The apps on the afunta and even most of the crap I found on the wild west app market they call the play store only kept my kid interested for a few seconds. I mean the quality difference for toddler apps is astonishing.  Granted this is a 60$ device and the ipad is at least 250 and likely more, I am just stating my own observation that this device is no replacement for an ipad for my son, not even close so I am sending it back.", "Date": "May 15, 2014"}, {"Title": "Would buy again", "Author": "joshworld22", "ReviewID": "R28A9LZZU3GZXF", "Overall": "4.0", "Content": "Really good kids tablet, she loves the kid mode.. Lots of videos to get kids attention. Would buy again and again for her", "Date": "April 30, 2014"}, {"Title": "One minor isuse", "Author": "Amanda Kreger", "ReviewID": "R24RMIATAJ4948", "Overall": "3.0", "Content": "I was a little disappointed that the button u use to turn it on an off broke the very first day so my daughter is still waiting to play with it...other then that it was good..", "Date": "April 29, 2014"}, {"Title": "great service", "Author": "christina", "ReviewID": "RXBWKAMDTJ2WY", "Overall": "5.0", "Content": "The original tablet I ordered got ruined in the weather on its way to me. I got an email apologizing for it happening and was asked if I wanted another sent to me or my money back. I was very pleased with the politeness in the email and of course asked for another to be sent. I was told 15 days and got it in 10. Am very pleased with thetablet. It is perfect for my daughter. Ty.", "Date": "April 16, 2014"}, {"Title": "Worked for an hour.", "Author": "Aminahab", "ReviewID": "R2DUGUSMGZFLUN", "Overall": "1.0", "Content": "Ordered this tablet for my 4 year old daughter. After charging it for about an hour took it off the charger to use it and noticed the battery was very hot and the tablet was very glitchy. Then after about another 30 mins it completely froze,shut off  and would not come back on. Let it sit over night and tried to turn it back on the next morning and nothing happened. I called Amazon later that day and had it returned the following business day. I would not recommend this product!", "Date": "April 15, 2014"}, {"Title": "great but no movies", "Author": "Deerodwal", "ReviewID": "R1X0NPLC8MICB8", "Overall": "4.0", "Content": "I love the features and the games along with being able to download android apps. However, we're really bummed that my kids cant watch netflix or google play movies. That was the main reason we got it. No matter. That is the only downfall. Aside from that that games that come pre programed are great. And you can download more apps", "Date": "April 4, 2014"}, {"Title": "pretty great tablet", "Author": "sheila king", "ReviewID": "R39UZNE0EQJ9OB", "Overall": "4.0", "Content": "We had to restart it 3 times when we first got it because it wouldn't load properly. Since then, we haven't had any problems!", "Date": "March 31, 2014"}, {"Title": "Great product", "Author": "cynt", "ReviewID": "R36PVLPO4PC32L", "Overall": "5.0", "Content": "I bought this one for my granddaughter and she is enjoying it every day.  She call me to say Gammie I love you.", "Date": "March 28, 2014"}, {"Title": "i will be ordering more of my stuf at amazion now i love this to shop at home at amarzon", "Author": "Madelyn", "ReviewID": "R2CZNF9XWLUUTM", "Overall": "5.0", "Content": "my little girls love it there are very happy and my little boy see soo happy with his we will be shopping more with you", "Date": "March 27, 2014"}, {"Title": "faulty", "Author": "Isaac Williams", "ReviewID": "R1JJ2FP2R0DL2C", "Overall": "2.0", "Content": "one of the tablet did not work and it cost to much to re-ship to you so i did not bother sending it back", "Date": "March 4, 2014"}, {"Title": "beware", "Author": "eddie richardson", "ReviewID": "RWBG29Y8UEU97", "Overall": "1.0", "Content": "do not buy if one child sets password and another trys to many times to guess the password the tablet locks up and then you have to send it back to the manufacturer.  i called amazon and they gave me a phone number that does not exist.  i have to pay to send it back to the manufacturer and see if i get it back.", "Date": "April 1, 2014"}, {"Title": "Terrible battery life, slow and not responsive enough", "Author": "C. C. De Lara", "ReviewID": "R3O1HVF9G2UFL7", "Overall": "1.0", "Content": "If you want a tablet for your kids and don't want them to stay using it for longer than 1.5-2 hours, then this is the one. The battery will not last longer than 2 hour. The pink frame is made out of the same hard plastic of the tablet, is not made of rubber, so no protection if it drops. This seller marks the item as hazard material so you will not get automatic return slip. You will have to pay the $20 shipping to China and then expect to see if you will get your money back..... He offer me partial refund of $25 and I took it, just to don't deal with the hassle of having to pay shipping and wait to see if when the tablet arrives he was really going to refund my money. I know many things get stuck in China custom,  he could always argue that he didn't receive the tablet back and might not refund anything!", "Date": "December 13, 2013"}, {"Title": "Great for Younger Children", "Author": "Tianna Peterson", "ReviewID": "R3ISSBQP2M4FW8", "Overall": "4.0", "Content": "My children are 3 and 7. I was tired of my Kindle HD always disappearing so my Husband and I decided to get the girls their own Tablets for Christmas. These Tablets are no where near the quality of a Kindle however for younger children that like to play the games, read and do puzzles this Tablet works just fine. Also we are not going tobe as devastated if they manage to break it.Decent Tablet for a first time young user.", "Date": "February 5, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EB8JXJG"}}