{"Reviews": [{"Author": "faeriemyst", "ReviewID": "R3IYHLOWDLG7VX", "Overall": "4.0", "Content": "So far the ASUS MeMOPad HD 7\" has been a terrific tablet to use for a variety of reasons. These will be spelled out via pros and cons, partially because I'm too lazy to compose paragraphs, but mostly because I find those the easiest to find out what I'd like to know in reviews.Pros:- Easy set-up, though I did have a little trouble with wi-fi, but that might have more to do with my provider.- Great screen resolution - pretty much anything shown (images, videos, sites, whatever) is crisp and clear.- Lightweight and slim, so it won't cause much strain in wrists or arms if held for a decent amount of time.- There are a ton of features for every kind of user: casual, gaming, social, business, etc. There are even separate displays that can be modified to fit your needs.- Features five scrolling \"pages\" that can be filled with apps, and believe me, that holds a lot since the app icons are generally small. The default/home setting is right in the middle (or page three, if you'd rather).- Has both front and back cameras, which took better pictures than I thought they would.- Plenty of apps and widgets, both free and pay, in Google's app store.- On the bottom of the screen are the options: go back, go home, and switch apps (a.k.a. recent apps), so they are easily accessible at all times.- Excellent value!- Battery life has been true to ASUS' claims and lasts throughout the day (or longer) with intermittent use. At 16%, a notification shows to recharge the battery.- The tablet has a decent amount of storage space already available.- Has a slot for a micro SD card, though I'm not sure mine works right (or is working at all), it constantly keeps removing it and I can't be positive it's even using it. So that's a con as well.- The sound quality is good and it features an audio port.- Nice variety of color choices. I generally like brighter colors, but the navy blue has a nice, sedate feel to it that I like.- Can be used with a computer.- Works with Bluetooth easily.- If swiped from top to bottom, a menu-display-option thingie (obviously I'm a techie) comes down for easy access to the most used items, such as screen brightness, turning on/off wireless, Bluetooth, silent mode, auto rotate, etc., a link to settings, and will show the latest updates and notices the tablet needs or has finished.Cons:- Occasionally I've had glitches where the screen would go wonky and I'd have to turn it off, but they've been few and far between.- See micro SD problem above.- The USB cord for charging is shorter than I'd like, so makes using it while charging a pain so I don't usually do it.- On the save wavelength, I think the micro usb port has sunk in because the cord doesn't stay in very well and is easily pulled out with little movement. It wasn't that way when I first started using the tablet. It's also located on the top (if you want the ASUS print to be right-side up, as I do) which seems like a dumb choice to me and makes it more difficult to use.- Switching apps isn't the smoothest, and while fairly easy, isn't the best way I've switched apps on a tablet (my favorite is swiping left to right to get to another app, so I sometimes forget which device I'm using and end up trying it on the ASUS with no results. :P). Added to that, when I'm using a browser (usually Firefox), I constantly hit that icon to switch tabs. What can I say? I ain't the brightest. ;D- I've now got a disturbing addiction to Sims Freeplay.So overall, while I have some cons about the ASUS, they're mostly minor and I've been pretty darned happy with the tablet. This should be ideal for most people, especially those who generally use it for the basics: to check email, browse around, listen to music, play games, and stuff like that, which is the category I fall into. At this price, it's a steal and I can't imagine there's an equivalent tablet out there in this price range.", "Title": "(4.25 stars) Not perfect, but still more than worth the price", "Date": "September 23, 2013"}, {"Author": "Eric B. Mcmurtry", "ReviewID": "R3EFJDQ4LG5MJV", "Overall": "5.0", "Content": "This is a great device for the price.  I am a tablet afficianado so I was intrigued to get my hands on an inexpensive 7\" with HD.  The display is beautiful, and the unit is light weight.  The processor is fast enough for streaming audio and video - it's actually a pretty quick little machine for most purposes.  I'm a fan of ASUS products.  However, it will be interesting to see how many Android version upgrades ASUS will release for this device.  If you want lots of ports, huge horse power and a keyboard dock - this isn't what you are looking for.  If you want a pretty quick little Android device for email, streaming, document review and other day to day stuff this is the device you are looking for. The price now at $129 is unbeatable so well with the expense for what you get.  Rethink the ipad mini purchase!  Technology has become so inexpensive for good quality items there is no reason to over spend.", "Title": "This product is a winner.", "Date": "November 8, 2013"}, {"Author": "CY", "ReviewID": "R1RFU3B25RPLD0", "Overall": "3.0", "Content": "Bought it about 2 weeks ago. Love it the first week. Great graphic, great color, light weight. Love it and about to tell all my friends. Ops than it just went DEAD. Won't charge, no screen, no light. no hard reset button. Going to return it for exchange. I will give it another try.Update after the exchange:Five stars exchange experiencesDid the exchange with Amazon. The exchange experiences(the cross-ship) is FIVE (5) Stars. I push a button for replacement and Amazon ship me the replacement unit right the way. I got the new unit in two days. After a week, I pack the bad unit nicely and got the print the return label and just drop of the bad unit with the logistic company. The great thing is I can use the new Amazon packaging to repack the old unit.The new unit:Two words, Love it! I am using all the Android Apps. The ASUS MEMO HD7 build in interface is great. This product can do multitasking, open several apps and switch between apps. The graphic quality in HD is excellent. The Google Search is excellent with voice recognition. I am playing FIFA 14 on it and it is pretty smooth and went well.I used the bluetooth to transfer files between my laptop and Memo pad. The file manager is user friendly.On the down side, the speaker quality is good not great. The file download is a bit slow. I downloaded a 2GB app and it took a while. It might due to the Wifi and internet speed.", "Title": "Love it! But Dead after 10 days; will give it another try.", "Date": "September 13, 2013"}, {"Author": "Hamlet423", "ReviewID": "R2CX7P9K3MB9OR", "Overall": "5.0", "Content": "I think others have much more detailed reviews of the Asus MemOPAD HD, but I wanted to point out a few things1) Wifi-performance seems good, but there is NO 5 gig mhz antenna, so you are limited to the 2.4 gig band.  For a lower cost tablet this is not a huge surprise. But Given how crowded 2.4 gig is these days, for things that are very dependent on wi-fi, its a bit of a let down. And many sights incorrectly report this as having 5 mhz support. Unless I am missing something it does NOT have the antenna for that support.2) Micro-SD slot.  I Have been able to get a 64 gig card to work (sandisk sdxc 64 gig ultra).  The problem is these cards are formatted with ExFAT. You need to find a program that can format it to FAT32.  Once I did that, it worked fine.  Many programs available for windows to do the format  if you google it.  I think for 32 gig cards you can do it in windows 7 but for 64 gig cards you need another program to give you the fat32 option.The word on the street is that the memory read/write speed is poor. So I dunno about running apps from the card--but for media I think it should be ok.3) I do not see any auto brightness settings, so be prepared to mess with the brightness as needed for environment and to preserve battery.4) NO NFC and no wireless charging.  Oh well.I think for the price its an excellent value.  Although I am wondering about the utility of a 7 inch vs a 10 inch. Its all about screen size vs ease of carrying it around.  But as phones get bigger, I wonder--this is not that much bigger than my 5 inch samsung galaxy s4. But at least while traveling its another 7 to 10 hours of watching media.So far I got my 64 gig card in it, and using it to sync a lot of movies for remote/off line watching when traveling.  We'll see how it goes!I hope its upgraded to 4.3 soon since that provides TRIM support, which should prevent these tablets from getting slower and slower over time. The changes that ASUS made in the OS seem minimal and not too annoying.", "Title": "Good but there ARE some trade offs", "Date": "August 31, 2013"}, {"Author": "rbhatta \"A Dinosaur you can trust!\"", "ReviewID": "R88NFSVZJ2JLH", "Overall": "5.0", "Content": "In this market wherein most of the costly tablets are dominated by Apple, it is a pleasant surprise that ASUS who are known for making quality tablets and PCs finally managed to build a product perfectly suitable for budget conscious customers.  BTW if you did not already know, ASUS are the manufacturer behind the highly successful Google branded product namely Nexus 7.ASUS did try before to make a `budget' tablet for the masses before with ME172v but were unsuccessful, but with this new revision based on ARM A7 Quad core CPU from Mediatek (MTK8125) It is a `no brainer' after testing this Memo PAD ME173x and finding out that it is remarkably similar performing tablet to original Nexus 7 with fraction of the cost. Granted the new NEXUS 7 is still better in most other aspects but for the price I think this product from ASUS is still a very good deal.One of the many cost factors for manufacturers are the total build quality, type of CPU used, Screen quality, battery capacity etc; While ASUS did make some compromises over all build quality by employing all plastic case & in selecting Mediatek's 'MTK8125' Quad core ARM-A7 CPU versus other expensive CPUs, but this CPU can easily compete with Nvidia Tegra 3 which was used in original Nexus 7.In real life tests, the 28 nm manufacturing process of the Mediatek SoC MTK8125 pays off, the battery life is amazing for a budget tablet like this employing a slower CPU which itself compensates for most other shortfalls one might nitpick in a tablet like this. BTW, the tablet has enough CPU power for most common tasks one might want for casual gaming & running productivity apps and never really felt any slowness whatsoever even with highly conservative battery plans.The Wireless LAN & Bluetooth are adequately enough for most needs. In fact, The Wireless LAN performance is pretty darn good. It connects fast to my router at home and maintains very good link speeds. Browsing the internet with built-In browser was fast & very responsive. I am impressed by the overall performance of the Wi-Fi interface.The Micro-SD slot is a dream come true. If the missing MicroSD card slot prevented you from buying the ASUS manufactured original Google Nexus 7 earlier, now you can get that with MeMo Pad ME173x. The availability of Micro-SD card slot greatly enhances the productivity of the tablet. You can store thousands of MP3 songs & good amount of videos, Movies and make this a highly portable useful tablet to have. I have tried with 32GB MicroSD card and it works great with Amazon MP3 application. You can also use Google Play Music app if you want.All the currently available games & apps work just fine on this tablet. You can get apps from Google Play store as well as Amazon App store and it has the best of both ecosystems. You can even install Adobe Flash by side loading it and watch videos that requires flash player. YouTube video looks great & works flawlessly without any streaming issues.PROS[+] MTK8125 Quad core CPU which actually consumes less power thus providing more battery life[+] MicroSD card slot which greatly enhances the capability of the tablet[+] Wi-Fi interface is fast to connect to hotspots & maintains good link speeds[+] Less weight (only about 300 grams) makes it very comfortable in hands[+] Gorgeous 7-inch IPS screen displays with vibrant color and brightness even at odd angles[+] Main 5MP camera is decent enough for casual photography[+] Tablet runs cool even when playing games with high details frame rates[+] Includes Power Adapter and USB cable for charging unlike most other manufacturersCONS[-] The screen has tendency to attract finger prints that is hard to get off.[-] With more demanding apps 1GB RAM can be issue in certain cases[-] Main camera video can be choppy at times; the front camera is somewhat fuzzy.[-] ASUS launcher app has tendency to force close at random especially in landscape mode.Bottom-line:--------------This is by far the best performing low cost tablet on the market today. There are no serious flaws to report, the truth is that it is a less expensive Nexus 7 with less CPU power, but for most casual tablet use and gaming it did not have any problems whatsoever. The battery life is amazing & availability of MicroSD card slot makes up for most of the other shortfalls one might nitpick in a budget tablet.Highly recommended for budget conscious buyers - Very good deal!", "Title": "Very Good Deal!", "Date": "August 20, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3N1WSFWW8KBJH", "Overall": "4.0", "Content": "I have had the ASUS Memo Pad HD7 for 2-3 days and have been putting it to the test.  In my opinion the screen is great with crisp lines vibrant back lighting.  Videos including the ones taken with the tablet look good on the screen.  The camera takes decent photos and will not disappoint if you keep in mind you are taking a picture with a tablet and not a digital camera that is specifically designed for pictures.  The option to add a mini SD card has been nice.  The Android OS is running good.  I had one minor setback when sometime the table froze at the lock screen.  I did a factory resent and have not had a problem since.  It is running fast and has been reliable each time I pick it up and use it.This is a great tablet if you take into consideration the price.  I think it rivals in performance with a first generation Kindle Fire but it has the benefit of having an SD Card Slot and a Camera.  For now I would recommend this tablet for a budgeted minded consumer that does not want to compromise technical specs and performance and would like a mid-level quality tablet for a very good price.If you are realistic in your expectations of this tablet in relationship to its price you will not be disappointed.  For entertainment, organization, casual gaming, music, videos and some small business office applications it works great.", "Title": "Very nice preforming tablet with mid-level technical features for a Value Packed Price!!", "Date": "August 16, 2013"}, {"Author": "Tyson", "ReviewID": "R3KO2T5F5NCK30", "Overall": "1.0", "Content": "I started using Asus when they came out with the tf101. After a year it quit charging. I sent it in for repair and found out it was a motherboard issue and was not under warranty. (I researched and found out a LOT of people were having the same issue.) I decided to give Asus a second chance and ordered the tf700t in July. It was working great, so I ordered my daughter the Memo Pad HD 7 in November for Christmas. I got it all set up and wrapped up ready for Christmas. In the mean time, my tf700t stopped working and was stuck in boot-up mode. I sent it in for repair, it was under warranty. On Christmas morning my daughter opened her new memo pad hd 7. It worked great. The next day it reset itself. I then set it up again. Then it froze up and said the boot loader had stopped working. I messed with it for a while with no luck. I promptly did the paperwork to send it back. I decided to replace hers and mine with Samsung tablets to get away from Asus. I will never buy another Asus tablet again! I've had 3 out of 3 go bad. That's NOT a good record for Asus!", "Title": "Asus is junk!", "Date": "December 30, 2013"}, {"Author": "scott", "ReviewID": "R540CNNKTO0UA", "Overall": "5.0", "Content": "This is my first tablet an I have to admit, I love it! I am a big movie and music buff, and the fact that I can change micro SD cards and with a little help of VLC media player, I can watch any movie I want! In some reviews, many people say that the plastic back feels cheap and there is a slight lip, meaning the back overhangs a little bit. While yes, the lip is there it is by no means uncomfortable. The fact that the back is made of plastic is handy, I say this because it cuts down on weight and definitely helps with wifi connectivity. I pick up wifi better than the iPad!. To the screen, it is HD and very beautiful, I will say that with a stylus, it can be kinda tricky to open apps and what not, there have been times I have had to double tap, but using your fingers is not an issue. I love the fact that with this tablet I can write notes, have all of my textbooks and books for pleasure, I have my Bible, movies, music, facebook, weather and email updates with me everywhere I go! This little powerhouse has many apps pre-installed and can be uninstalled and new added. You cannot ignore the 10hr battery life either, I was playing and testing how the batter works, and watching movies it lasted 8 hrs and would have gone longer but I charged it at 30%. This also comes with many widgets that are very helpful, I love that I can operate my Bing search engine directly from my home page, I can watch a movie and float multiple search engines and the audio/video screen without interrupting the video. Finally, you cannot ignore the price tag. This is a name brand tablet and an incredible tag! $129.00 is unbeatable. I hope this helps!", "Title": "Great tablet, even better price!", "Date": "November 8, 2013"}, {"Author": "JAy.", "ReviewID": "RMV5536KSYG27", "Overall": "4.0", "Content": "I recently purchased the Asus MeMOPad HD 7 from a local retailer (same price as Amazon - at the time), and I love it!  No, this tablet is not going to solve world hunger or create world peace, but I would argue it is the best Android tablet available currently.Pros:Amazing display - it may not have the over-the-top pixel count of some tablets, but I can't see the pixels on this, so why pay for more.  Plus, the IPS technology means that viewing angles are almost limitless - the angle distorts the image before the colors fade.Great battery life - I occasionally play a simple game that on all my other devices devours the battery.  Not so on this one.  After about a week of use (charging about every other day), I am yet to run low on the battery life, even after using it heavily on Saturday while watching football!Perfect size - I like the 7\" tablets and this fits the bill!Good weight - it is really light and easy to hold.  May not be the lightest 7\" tablet on the market, but as long as I don't get tired using it, it doesn't need to be lighter.Good looks - I like the contrast of the white back on the tablet - looks classy to meIncludes a stand - OK, it is a cheap injection molded plastic stand that probably won't last.  But is was included in the box and it works, so I will use it as long as I can!Has all the sensors you need - includes all the necessary sensors and connection modes, so there isn't anything that I want to do but can't.  OK, it doesn't have cellular service, but I don't really need that anyway, so I am happy to not have to pay for the hardware.The price on this table is so low that the value proposition cannot be beaten!Neutral IssuesThe back case appears to overlap the front case slightly.  If you hold it one-handed with your hand squeezing the edges, you can feel a plastic ridge that eventually starts to feel uncomfortable.  But I have already figured out how to adjust the way I hold the tablet.The version of Android installed is not the most current, but it certainly gets the job done.  The ASUS skin is light enough to not be bothersome.  It is worth replacing the keyboard, however.Negative issuesThe worst thing I can think of is that the speaker is on the back of the tablet, so the sound projects away from the user.  However, this is true of lots of tablets.  Also, the volume on the MeMOPad HD is loud enough to overcome the issue.The power/micro-USB connection is on the top of the tablet.  If you are trying to use it while plugged in, it may be easier to hold upside down depending on where your power outlet is.So, only a couple of negatives that aren't really negatives.  I think that shows how much I like my new tablet!", "Title": "Best Android tablet for the money!", "Date": "November 5, 2013"}, {"Author": "Kevin Nicholls \"jaded, aging hipster\"", "ReviewID": "R3NZ04LJ3ZKDZM", "Overall": "5.0", "Content": "To be honest, I was really torn when I received this. For the past few weeks you could get the Kindle Fire HD 7\", Dolby Audio, Dual-Band Wi-Fi, 16 GB for the same price, or get a Nexus 7 for not much more.The Fire is great for people who are looking mostly for media consumption and kids' use, while the stock Android experience and near-instant OS updates make the Nexus 7 very attractive. Except... neither of them have extra storage, and these days, 16 gigs on a tablet isn't a ton of space.Call me a geezer, but one of the times I'm most interested in using a tablet for content, is when I'm somewhere that doesn't have a super-fast internet connection or 60\" LED TV to watch content on, and that's where the SD card is a huge deal to me.And while my preference is for a vanilla Android experience, I have to say Asus has done a wonderful job putting only minor (and largely useful) tweaks in to the operating system. Short of the \"pure\" Nexus, this is hands-down my favorite third-party version of Android.The tablet itself feels really great. For the price, it's very solid, with no creaking pieces, and a really sharp display. The screen is as responsive as any tablet I've used, and because Asus hasn't tinkered too heavily with the OS, it happily zips through each app. Nobody's going to confuse this with an octocore, but it definitely gives higher-end devices a run for their money.For the serious tablet user, you can't do much better in this range.", "Title": "Excellent choice, if you need the SD slot.", "Date": "September 24, 2013"}, {"Author": "Matthew", "ReviewID": "R3K26KCU9VNUKD", "Overall": "3.0", "Content": "It also takes way to long to charge, I'd say about three times longer to fully charge it than it takes to drain the battery. Even turned off it takes over 5 hours to reach a full charge", "Title": "The battery could last longer", "Date": "April 29, 2014"}, {"Author": "Wes", "ReviewID": "RIXBCC6OUUI1Y", "Overall": "1.0", "Content": "Was very happy the first 60 days or so that we got it.  But tonight, it won't turn on.Searched the web and reviews here.  Apparently this is common.  YES COMMON!Asus - NEVER AGAIN!Very disappointing . Out $140...", "Title": "used to love it but now it won't turn on", "Date": "April 22, 2014"}, {"Author": "Alice M Navarro", "ReviewID": "R31H3W0M90N05J", "Overall": "5.0", "Content": "Brought this for my 70 yr old mom. She loves it and truthfully I like it more than my kindle fire Hd. Thinking of getting myself one soon.", "Title": "love it!!!", "Date": "April 21, 2014"}, {"Author": "sueshire", "ReviewID": "R1OTFNJTPLMG1A", "Overall": "1.0", "Content": "This was a great little tablet. I purchased it in February of this year (2014). No problems at all until yesterday, when for no reason that I could find, it simply would not turn on after charging. Checked user blogs and apparently others have had this same issue. I tried trickle charging, as recommended, tried the reset button after tearing my house apart looking for a paper clip to use as a tool, and finally smacked it a time or two (not recommended). It's about a month past the warranty period, so it is now a paperweight. I should have spent a little extra and got the iPad mini I wanted.", "Title": "Loved this...past tense", "Date": "April 17, 2014"}, {"Author": "James Hawkins Jr", "ReviewID": "R1N55G8WWBPE2J", "Overall": "2.0", "Content": "Not a great tablet get a galaxy... Disappointed!!! Jerky movement no flash player bad touch sensability I wish I could get my money back!!!", "Title": "disappointed!!@", "Date": "April 16, 2014"}, {"Author": "victor heng", "ReviewID": "R21HKHQBUW22KN", "Overall": "1.0", "Content": "Something just so wrong with the design, the start button just quit on you. Back to back same problem with the replacement.", "Title": "Suck !!", "Date": "April 15, 2014"}, {"Author": "Rollo Tomassi \"pinzone\"", "ReviewID": "R3MQUHR8F5F14S", "Overall": "1.0", "Content": "I bought two for Christmas.  They turned on about 3 times each, and did not turn on after that.  I send one back, which cost me 40 dollars-- in the end.  And I am on the phone with Asus customer support right now with the second for the same reason.It worked well when it would start and run.  But sometimes it just would not start.  I'd hold the button down for 15 second-- or 10 years.  It just won't turn on.I really think these were made and rushed out for selling.", "Title": "I bought 2 for Christmas, neither worked", "Date": "April 4, 2014"}, {"Author": "Luna Kot", "ReviewID": "R11YT9VOCFMK5F", "Overall": "1.0", "Content": "I purchased it in November and it was my first tablet and first Asus product ever. It worked more or less fine till today, except never-ending annoying intro while it was charging. Unfortunately, it stopped turning on since this morning, just from nowhere - I am always very careful with my electronics. I contacted customer service, and they couldn't proceed with the RMA because their return system is dead, meaning that I will have to bug them and waste my time again later. After that I will have to pay for shipping and wait for another who knows how long to get it back.I am very skeptical about considering another Asus device in future. Anybody who is thinking of purchasing Memo Pad, please, read all types of the review before. I did it too late - it looks like this kind of problem is very common with Memo Pads.UPDATE: I just got the tablet back. It works now, BUT there is a huge ~ 3 inch SCRATCH across the screen which was not there before!!! Can you imagine this?! I do not even know what has been done with my tablet since there is no feedback documentation included with the return package. I assume that they either replaced my tablet with some refurbished junk or made the scratch themselves during the repair.I have few questions to ASUS representatives now: why do you treat your customers as if you follow a simple rule \"sell and forget\"? Do you want people to purchase your products again? For me it looks like you do not want returning customers at all. Final question: what should I do with the tablet and the scratch now?", "Title": "Stopped working in 5 months", "Date": "March 31, 2014"}, {"Author": "TangledJeansAndBeans", "ReviewID": "R2JWVRP8ICD4RN", "Overall": "2.0", "Content": "I loved this at the start, but slowly things started going wrong. The touch screen only works some of the time. I have found that changing the orientation then back again will bring it back to life. A bit of a pain, but that keeps it working.No updates since buying this so I am stuck with the foibles in the lock-screen launcher. The drop-down main menu leaves artifacts on the screen that can only be removed by a reboot. It randomly drops wifi, the list is long.The ASUS customer service has to be the worst in the world. They are nice, friendly, supportive and interested in the issues but they then dispense useless advice. After an hour+ wasted on the phone several times, they could not resolve any of the issues. I am not sure if they hung up on me, or the line just dropped out, but that happened on three wasted calls.I sent it in for repairs, they kept it three weeks and sent it back with NOTHING different. A total waste of time and money. I now only have this in the bathroom (where it belongs) where I can sit and read a few pages of a book. For anything else it is getting to be useless.I used to be a fan of ASUS, but this is my last ASUS purchase and that's a pity as we are in the market for two 8\" win 8.1 tablets, but the vendor list just got shorter by one.Hopefully someone from ASUS will be reading these bad reviews on customer service (there are LOT here) and do something about it. This is like Dell back around the 2000 era when they were regarded as the best, until let down by poor customer service. It took them more than three years to recover. Amazon moderators reviewing this before publication could do ASUS a favor and get them to read a few of the bad reviews as they used to be great product manufacturers.", "Title": "Poor customer service for faulty device", "Date": "March 28, 2014"}, {"Author": "Jim in PA", "ReviewID": "RHD20SRPVVEN1", "Overall": "5.0", "Content": "The only complaint is all the extra crap software that gets loaded on it at the factory that you can't remove without root access.", "Title": "great little tablet", "Date": "March 27, 2014"}, {"Author": "Jorge Maciel", "ReviewID": "R3OKDGZ8ZI7EXS", "Overall": "5.0", "Content": "I got the previous memo pad tablet (not hd) but the resolution was not so good, for reading was bad since the letters were not clear so I returned it, now I got this one and Im glad I got it, the HD looks really good, you can read newspapers/magazines with no issues, great for the price!", "Title": "the perfect budget HD tablet so far", "Date": "December 7, 2013"}, {"Author": "Chrisleah", "ReviewID": "R2PAN3XB6IMVVM", "Overall": "2.0", "Content": "I had ordered this because of the reasonable price for a 7inch tablet. The battery life is pretty good at around 9 hours. The reason for the poor rating is that the back of the tablet scratches pretty easily (I have a protective case for it now), the problem with external storage my card unmount and remounts a lot. Sometimes the tablet is just lying there on the table when I would hear the 'sound' of the SD card being unmounted sometimes I would be reading book when my book would just disappear then I would have to wait a bit before the book would reappear again, this is very frustrating because I use my tablet a lot for reading books. I have used other SD cards in it to test whether it was my card that was defective but the same thing happened the card kept getting unmounted. I wished someone had told me about the SD card problem because I would never have bought this tablet but the Samsung galaxy tab 3 8 inch instead.", "Title": "problems with SD card slot", "Date": "December 6, 2013"}, {"Author": "Roland Pokornyik", "ReviewID": "R3B92TQ4EQY9VX", "Overall": "5.0", "Content": "This is the best value tablet in the market I think. You get 4 Cores 1 GB ram for less than 200 bucks. Must have!", "Title": "Great value, fast, nice, great battery life.", "Date": "December 6, 2013"}, {"Author": "W. Povse", "ReviewID": "RRA0HGN4BO7AP", "Overall": "5.0", "Content": "Great price for what you get. Never had a tablet before but if you have an android smart phone learning to use this is easy.", "Title": "Good product", "Date": "December 5, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R389Q4D7RCDUFS", "Overall": "5.0", "Content": "I got this tablet because I wanted an upgrade from my Kindle Touch and I was not disappointed! I can still read all my Kindle media through the Kindle app, but there is just so much more to it. Not only can I read, but I can social network, store my crochet patterns and recipes, and game like no one's business. The resolution is great and the speed is great too. My husband has a Galaxy tablet and he is jealous of my Asus. This little tablet really knocks it out of the park!", "Title": "Home Run Tablet!", "Date": "December 5, 2013"}, {"Author": "Amazon Don", "ReviewID": "R3110DU24CDJYP", "Overall": "5.0", "Content": "I did a lot of research on 7 inch Android tablets looking to replace my first exposure and purchase of an Acer A110. While a decent tablet at the time, it had the all the desired features but lacked that \"brilliant screen\"This tablet has it ALL except a mini HDMI. It is basically a Nexus (Asus makes Nexus) BUT with a Micro SD slot (a very desirable feature) at great price. Its screen is \"brilliant\" enough for the average user. The OS is close to Vanilla Android. What Asus does change is good.Besides the hardware,  Asus includes some App's that are REALLY USEFUL and User Friendly, even compared to some comparable apps one can get on the store. Two notable apps are  their \"To-Do\" list (VERY WELL thought out and easy to use) and  SuperNote Lite. SuperNote is an app where one can make separate notebooks and take notes via writing with ones finger (or stylus), typing or voice via the voice key on the keyboard. One can also \"draw\" in multiple colors and SEND notebook pages via email or other options to others.It also comes with a decent app for organizing and reading your epub (and other format) books once you learn how easy it is to get free books from sites like FeedBooks etc.  I like book readers that have that \"real page turning\" feature and this does.I almost forgot, it has a great \"File Manager\" as well !They have some mini \"floating apps\" which help one multi-task. I especially like the floating mail and video play apps (which can be expanded if and when desired). Very Cool..Includes keyboard that can be set up with \"Swipe\" functionality  (another desirable feature) and it has good battery life.You REALLY get a \"bang for your buck\" at this point in time with this model, the features and included apps.If you are in the market for a 7\" Android, stop looking, shop for the best price, buy and start using using your time enjoying and being productive.. !", "Title": "Currently the \"Best Buy\" for 7 \" Android Tablet", "Date": "December 4, 2013"}, {"Author": "Amy", "ReviewID": "RCC4NXBF59C87", "Overall": "4.0", "Content": "Does not support Adobe flash.  Otherwise, would be 5 stars.  Cameras could use some improvements.  Overall, very happy with the tablet.", "Title": "nice overall product", "Date": "December 3, 2013"}, {"Author": "Mark Lundgren", "ReviewID": "R2WZZ0XIAIAT7Y", "Overall": "5.0", "Content": "This is a great little tablet.  The screen is awesome.  The sound is good.  It's pretty fast.  I had an issue with the SD card unmounting but Amazon hooked me up and sent me a new one. Then I got a Sony micro SD card and I don't have that issue.  This does everything I need it to. I play games, check emails, fantasy football.... all that. I don't watch movies on it but I have looked at HD video online and the screen was great.  Battery last forever.  Great tablet for the money.", "Title": "Great tablet at a great price.", "Date": "December 3, 2013"}, {"Author": "Damodar Chandru", "ReviewID": "R2JJ68D7TEW6RM", "Overall": "5.0", "Content": "I know there are better Tablets then this, but this one is doing all I expected out of it without a glitch. For the price I paid, this is an excellent tab and does go through the job in a decent manner.There was sum sticky thing on the screen when it arrived, when I held it I realised the sticky thing is exactly where you put your finger on the screen.The tab was dead and had obsolutely no charge let, even after plugging in it wouldn't start for 10 mins or so.Pros -1. Resolution is decent for the price2. Almost Stock Android3. Snappy for normal activities4. Decent on GamesCons -1. Camera is pathetic for 5 MP2. On/Off and Volume button are placed awkardly3. The flig mechanism is slow when you go from potrait to landscape.Overall, a good bet for the price.", "Title": "Excellent for the Price", "Date": "December 3, 2013"}, {"Author": "ktarantino", "ReviewID": "RQMPT1J46SX4Q", "Overall": "5.0", "Content": "We were debating between the new Kindle and this ASUS tablet.  I ended up going with the ASUS (my boyfriend went with the Kindle) after reading the highly revered amazon reviews and they were spot on again.  My son likes to tote it along with him to read and the 7 inch fits well in his bag/jacket pocket. The price of course was a huge selling point.  My son absolutely loves it and wasn't interested in trying out any other versions of tablets after using this for a week.  I have a nexus 7 and the ASUS looks and works just as good if not better. He said he finds himself using his computer much less because his tablet is so convenient and fast.  I also own an ASUS laptop and have had such success with it, I was fairly confident with the brand.  Highly recommend to anyone wanting a good tablet for a great price.", "Title": "Bargain shopping pays off!", "Date": "December 2, 2013"}, {"Author": "Deborah Nelson", "ReviewID": "R3GIKNNKF83VVG", "Overall": "2.0", "Content": "Love it when we first got the product.  Only had three months and the touch screen stopped working.  No the best deal for the money and have not found any way to fix the problem.", "Title": "Asus memopad", "Date": "June 9, 2014"}, {"Author": "Scot Mayo", "ReviewID": "R2AASKKLNLZISJ", "Overall": "2.0", "Content": "first unit has SIM slot problems within the first month. Square Trade is a joke!Amazon stepped up and replaced the unit with a new one...  now after 60 days, this unit is also have SIM slot problems... keeps saying to mount the SD Card....  \"its already in the damn machine!\".past my  Amazon return date, so I will work with American Express to return it for credit under their extended return policy.", "Title": "2nd unit has problems too", "Date": "May 31, 2014"}, {"Author": "Skalla", "ReviewID": "RY4XWQ4UVOEQN", "Overall": "1.0", "Content": "Bought this at Christmas, was a great purchase until 2 days ago. It powered off due to low battery, I charged it but now it won't power on no matter what. Have tried usb charging, overnight charge, it will not come on. I previously had a 10\" Transformer that is now a 10\" brick that I can't bring myself to to throw out. Save yourself the hassle and wasted money and just get a Samsung :(", "Title": "Another dead Asus", "Date": "May 30, 2014"}, {"Author": "Ruth Henderson", "ReviewID": "R1OHTNAVXO8W7M", "Overall": "5.0", "Content": "Love this! Use it allll the time and all of the functions still work great. I have never had any issues with it this far. Its conveniently small and puts tons of apps st your fingertips.", "Title": "Great tablet!", "Date": "May 29, 2014"}, {"Author": "Oscar", "ReviewID": "RN0A0BHV0ORTQ", "Overall": "1.0", "Content": "I bought one on January 16th, 2014 and the return or exchange is expired since February 22nd, I believe. Anyway, today is May 29th and this tablet turned off by itself and didn't respond no more. It's dead, it doesn't turn back on. Let's see if Asus could helps me with the warranty. Don't by any Chinese electronic via Amazon. So disappointed.", "Title": "This is not good.", "Date": "May 29, 2014"}, {"Author": "antech", "ReviewID": "R5LJH1UDM92CN", "Overall": "5.0", "Content": "I bought mine in January and I'm happy with it. Less issues with it than my Samsung Galaxy tab 7.0 plus. Better resolution, more processing power, newer version of android, no touchwiz (Samsung's android eye candy overlay), just to name a few. Except for the one gentleman who has returned it 3 times so far everyone else needs to understand this is a budget tablet. I paid $128.99 locally so I can't complain it was a good deal for me and I would recommend it to anyone who is looking for a tablet for reading ebooks, music, media streaming and video chat.", "Title": "Great tablet great price...", "Date": "May 29, 2014"}, {"Author": "Raine", "ReviewID": "R3E17XBXF95LBA", "Overall": "4.0", "Content": "For the price, this can't be beat. i ordered this two months ago, and it's still using nicely. I have a lot of apps esp Kindle, Google drive, games, and lots of other things that i like access too. Its wifi connection is instant once it knows automatically where to connect. It hasn't died on me yet, which amazes me for the cheap price... It's the same price as a Ipod nano...and it's still working well.The memopad app that it comes with is nice when drawing and writing, but the only downside is that there's no stylus that goes with it, like the Samsung tablets, so my writing and drawings are all scribbles. I don't want other styluses that are incompatible to scratch the screen.Mostly i just do lots of typing, editing of school papers or my own personal stories, and of course play my touchscreen games. It still has a lot of memory...Love this!!!!", "Title": "Excellent!!!", "Date": "May 28, 2014"}, {"Author": "M. Sederquist \"Mypron @2013\"", "ReviewID": "R18SHBQWJLSLH4", "Overall": "3.0", "Content": "I purchased this item on August 27, 2013 from Amazon. After about 4 months it began shutting off at random times and I would need to reboot it. This happened with full battery, or any state of battery. It only restarted on me two times while in use, the other times it was in standby. While using it, I found it very responsive and extremely nice. The screen was amazing and the UI was very good. The battery life was really good (even better when it would randomly turn off on me.. it would last for weeks!)I've sent the unit off to ASUS for service, but I'll be surprised if they fix it and send my original back.. To me it seems like a bad battery connection that only happens when it heats up or is set down..", "Title": "Really like it, but randomly turned off..", "Date": "May 27, 2014"}, {"Author": "Angel", "ReviewID": "R3CSZJD3IEOI59", "Overall": "5.0", "Content": "This tablet is really good the screen is so clear and perfect colors and its just perfect in every way.", "Title": "AMAZING TABLET", "Date": "May 27, 2014"}, {"Author": "Traveler", "ReviewID": "R1K6JCPBLM6EDA", "Overall": "4.0", "Content": "I really am enjoying my new Asus Memopad.  It is quick and I like the size of it.  I'd recommend this tablet.", "Title": "ASUS MeMOPad great buy for the price", "Date": "May 27, 2014"}, {"Author": "Bahamut", "ReviewID": "R9T1KEH1FJHM0", "Overall": "5.0", "Content": "Great buy girl friend literally will not put it down.  She watches movies, plays games, email the whole 9 yards, plus it takes excellent pictures.", "Title": "Great buy as good or better than a name brand tablet.", "Date": "March 31, 2014"}, {"Author": "Kevin Fitzpatrick", "ReviewID": "R6TSPFLBZRKZ5", "Overall": "4.0", "Content": "I purchased two of these tablets for a 5 and 7 year old for Christmas. I received the nexus 7 for me. The nexus and memopad have identical chargers and cables. These tablets have performed great for my kids. I did all the updates immediately before my kids first used them which I think is important. Now for the only problem, and its kind of big, but I can work with it. My daughters tablet would not charge nor come on. I opened the case which was very easy using a plastic triangle shaped tool that looks kinda like a guitar pick. I checked the battery voltage which was 3.1v. Too low to start charging. I disconnected it and reconnected it a few times and got it charging again. I gave it back to her with a full battery. The same problem happened again. I took her cable and connected it to my sons tablet over night. His tablet then would not turn on. Opened it up and battery was at 3.2v. Anyway, after testing everything I found the cable to be faulty and caused the battery to drain. Google \"micro usb cable drain/wake problem\". I purchased a mediabridge charge cable and all is well again. The only way I found to get the tablet to wake again was to disconnect the battery. Luckily it only takes 30 seconds to open the case. If you have any questions feel free to ask. Overall the tablet is awesome.", "Title": "Great tablet for my household", "Date": "March 29, 2014"}, {"Author": "Simone Houle", "ReviewID": "R11OFVI3WCPKDC", "Overall": "4.0", "Content": "After 3 months of using the MeMOPad to play a game, it suddenly died on me for no apparent reason. Until this happened, It was the best tablet on which to play games. However, Amazon made it right by refunding my money. I am going to order another tablet and hopefully this one will last longer.", "Title": "ASUS MeMOPad", "Date": "March 28, 2014"}, {"Author": "Andrew Yoo", "ReviewID": "R2XM3PTIV8UWNE", "Overall": "5.0", "Content": "I like this product for the fact its easier to use than a ipad, I gave it a 5 star rating because it does what I need it to do.", "Title": "Good investmenT", "Date": "March 28, 2014"}, {"Author": "Mitchell Austin Wrenn", "ReviewID": "R1ENEKAL9HPRVV", "Overall": "5.0", "Content": "After 3 weeks I have had no problems and enjoy the Tablet. I took it with me on a trip to the UK to take pictures and the camera could have been better, but overall it worked fine.", "Title": "Awesome", "Date": "March 28, 2014"}, {"Author": "lisa", "ReviewID": "RHN5VKR0NHRZ0", "Overall": "4.0", "Content": "my son loves this to play games.  It's good enough for the price for a kid to keep busy when in need.", "Title": "memo pad", "Date": "March 26, 2014"}, {"Author": "T. Brown", "ReviewID": "R3C1YV1BAZR3G7", "Overall": "5.0", "Content": "Bought this tablet for myself a few days after Christmas,I read tons of the reviews about it prior to order it from another site. The 16GB of internal memory is 11GBs of usable memory,which is very fine for me since I use a 64GB microSD card with the tablet,plan to upgrade to a 128GB microSD too in the future for it. The screen is a finger print magnet,but a good screen protector does the trick to help with this,and a microfiber cloth too. The battery lasts for about 12 hours on wifi and with videos,I've played a few high resolution games on the tablet till it died,and I can confirm it'll last a long time. I use the tablet for viewing 720P movies and videos using a MX player app,plays majority of the videos I throw onto it very well. I also use it to play wifi games too. Note that in order to get the full 12 hours of wifi and videos from it,the screen must be on the lowest setting.Prior to owning this tablet,I had a Samsung Galaxy Tab 2 7.0,which was a fine tablet while I used it,but this one is a great upgrade with the better CPU,memory and screen. This memopad may not have a high scratch resistant screen like the Tab did,but it does its job well.I just hope that I don't run into any of the similar issues that others have had with theirs dying in a few months. If it lasts for a year,then I'll update this review.Edit: Forgot to note that my memopad is rooted and using the SuperDragon custom ROM from the XDA forum and the tablet runs buttery smooth with no lag.Update: 6/2/2014Had mine for 6 months so far and in perfect condition still and no problems whatsoever with this tablet.", "Title": "Love it!!! Worth every penny!!!", "Date": "March 25, 2014"}, {"Author": "D. K. Watkins \"Amateur Everythinger\"", "ReviewID": "R13FTQ7TTTWGZG", "Overall": "5.0", "Content": "I bought this for a child's gift based on the recommendation of a consumer affairs reporter, adn I haven't been dissapointed.  Easy to use and decent battery life.", "Title": "Bought for a Kid--It's Been Great", "Date": "March 23, 2014"}, {"Author": "gloria henry", "ReviewID": "R2Y19J62NCWCZ3", "Overall": "5.0", "Content": "I like this product. this ASUS MeMoPad allowes me to use it anywhere  in my house.I would recommend this to anyone.", "Title": "*`*-//", "Date": "March 23, 2014"}, {"Author": "Mr Royal", "ReviewID": "RLTRDGSCDMGJJ", "Overall": "5.0", "Content": "I have owned my Asus memo pad HD-7 for about two and a half months now. I haven't had any problems with it whatsoever. It doesn't have the most sensitive touch screen out on the market and every now and then I will have to double or triple tap on something to open it. The HD display is quite simply beautiful when watching videos or viewing pictures. Also the sound is not too shabby either, it actually sounds as good if not better than my first gen Asus Nexus 7. All said and done, in my humble opinion, if you are in the market for an excellent low budget tablet this is the one for you!!", "Title": "I love my blue asus memo pad HD-7!!!!!!!!", "Date": "March 23, 2014"}, {"Author": "Glendon K. Blake", "ReviewID": "R37IM2E62AGIJR", "Overall": "5.0", "Content": "Best gift i ever received save time when looking up stuff online and i can take it anywhere WiFi is available", "Title": "Love it", "Date": "January 20, 2014"}, {"Author": "Billy Boy", "ReviewID": "R1JW3VFLB3N5DS", "Overall": "5.0", "Content": "I had bought an Allwinner tablet about a year ago for about the same price as I paid for this ASUS. What an improvement in speed and functionality. I haven't had any apps that have not worked. Great buy.", "Title": "Great Android Tablet", "Date": "January 19, 2014"}, {"Author": "Lydia Johnson \"Say something about yourself!\"", "ReviewID": "R2ALMFER8NAJCW", "Overall": "5.0", "Content": "This was a great buy! Sometimes I am not sure about buying electronics online. In this case it was worth it.", "Title": "Tablet", "Date": "January 19, 2014"}, {"Author": "Ng Chong Wee", "ReviewID": "R23X9CJNP2NV7M", "Overall": "5.0", "Content": "A value for money piece of tablet made by ASUS. The tablet was very well-built and apps run smoothly on it. A recommended buy for budget users.", "Title": "Value for money tablet", "Date": "January 19, 2014"}, {"Author": "busy_shopper", "ReviewID": "R1UQGQBHGJDH1I", "Overall": "4.0", "Content": "Considering its a lower priced product compared to other 7\" tablets it is a good buy. Apps tend to just close for no apparent reason, and overall a bit slow. Still meets my needs and glad I didn't pay $400 or more considering I mostly use it for Kindle and for my 6 year old to play on.", "Title": "Good deal for the price", "Date": "January 19, 2014"}, {"Author": "Corey Gibbard", "ReviewID": "RIF58BEPK1QQL", "Overall": "5.0", "Content": "I have no complaints about this tablet. The functionality is great, and it has the SD card slot that is misreading on both the Kindle Fire and the Nexus 7. I would absolutely recommend this tablet.", "Title": "great tablet for the price", "Date": "January 19, 2014"}, {"Author": "fabito", "ReviewID": "R1LM5IW7U6TMBV", "Overall": "5.0", "Content": "awesome piece of equipment. Beautiful. Runs very good w/ all apps i have installed on it. Screen resolution is great.", "Title": "Best value for the price", "Date": "January 18, 2014"}, {"Author": "Jerry W. Hillius \"Sentimental grandpa\"", "ReviewID": "R17A96ZU68RH4W", "Overall": "2.0", "Content": "My wife got a new Asus MemoPad HD at the first of the year on a $129 special at Office Depot.  It has been a great tablet until 3 weeks later and it won't turn on after a night of be charged.  Went to the bogs and tried \"holding the power button for 30 sec\", tried holding down the \"power and volume keys together\", tried a \"trickle charge from my laptop\".  Nothing works.Looks like a trip to Office Depot for an exchange....maybe an upgrade. Bottomline:  If you can get it to turn-on, it is a great little tablet.", "Title": "Love - hate relationship", "Date": "January 18, 2014"}, {"Author": "X2 user", "ReviewID": "R27Q2944F5AQZ1", "Overall": "5.0", "Content": "Battery life on this thing is incredible.  Don't cheap out on the $80 ones but don't sell out on the iPads.  Sound, resolution, speed, and battery exceeds expectations.  I'm glad I returned the dragon touch for this.", "Title": "easy choice", "Date": "January 17, 2014"}, {"Author": "Caitlin Anderson", "ReviewID": "R3RM2EEFHWPZJU", "Overall": "5.0", "Content": "I researched long and hard on for a good tablet for everyday use. I have an Asus Computer with a touch screen and I thought the tablet verison would be great. Turns out I love this tablet!I recommend this to anyone who is going to school or needs it for everyday use!", "Title": "Great Great Tablet!", "Date": "January 17, 2014"}, {"Author": "Wyoming Eagle", "ReviewID": "R2XO402P55K7FK", "Overall": "4.0", "Content": "I had never owned or used a tablet before.  I only needed it for a few things due to the wireless capability, so I did not want to spend a great deal.  This tablet was the best price I found for the overall quality and features.  The screen display is very good.  The solidness, which was mentioned in some reviews as not as good as ipads, seems quite good to me.  I didn't use the tablet before I put a screen cover on it, so I don't have a response about the fingerprint issue mentioned.  I've had it for about a month and am glad I bought it.  I didn't give it five stars because I have yet to \"love\" an electronic device.", "Title": "Pleased with this tablet.  Great price.", "Date": "January 14, 2014"}, {"Author": "Rob Romero \"texas4rob\"", "ReviewID": "RSOSL7FHA2RQ1", "Overall": "5.0", "Content": "I think this is a great tablet at a great price. The Cameras work great as this was one of the reasons that I purchased it.( 2 cameras ). It has no problems running any games and it keeps my kids off of my tablet! They were always on mine since I bought them a low budget tablet last year. Never again!! I also have other Asus tablets in the house that work great", "Title": "Great tablet at a great price!", "Date": "January 14, 2014"}, {"Author": "D. MacQueen \"Dave M.\"", "ReviewID": "R3MA863XO3S0PR", "Overall": "4.0", "Content": "I bought this for my wife to replace her first edition  ipad. she was delighted with the performance and ease of use. She particularly enjoyed the voice activated browser search , which retrieved what she was looking for every time. We have had the tablet for two months now and, so far, no problems.", "Title": "a great value for the price", "Date": "January 14, 2014"}, {"Author": "Colin \"cwood5\"", "ReviewID": "RD7PXJLU61R1V", "Overall": "5.0", "Content": "Very fast and responsive.  For the price it is as good as any mid level tablet.  Plus it has a nice camera on both the front and back.", "Title": "Awesome tablet.", "Date": "January 14, 2014"}, {"Author": "Dale Rose", "ReviewID": "R22I48ISK21IXA", "Overall": "3.0", "Content": "Yes did very well. But still does not have gaming attachments like the Nexus, so my son still takes my Nexus and is not charged when I need it.", "Title": "Asus MeMOPad HD 7-inch", "Date": "January 14, 2014"}, {"Author": "Mainsil", "ReviewID": "R10WZH4TA52YPA", "Overall": "3.0", "Content": "Nice tablet, I would give it five stars but it had a pretty big problem.  My son had this for a month and it suddenly stopped communicating with the internet, even though Wifi Connection was solid, and it was cleared through the router.  Tried the on-off, off battery out, reset the WiFi, went through all the configuration settings, etc.Finally gave up and reset the machine back to factory settings.  I was able to get it connected to the internet again, but my son had to re-download all his apps.", "Title": "Had to reset the device one already", "Date": "January 13, 2014"}, {"Author": "cubao boy", "ReviewID": "R2F0CPRS89HAUW", "Overall": "5.0", "Content": "Consumer's report recommended this model. so far so good. can stand toe-to-toe with galaxy tab 3. what's more, it has 16 gb - double that of other competing brands.", "Title": "great buy at a great price", "Date": "January 13, 2014"}, {"Author": "C. L. Hornung \"new grandma\"", "ReviewID": "R1GCEB9N7BSAKA", "Overall": "5.0", "Content": "We bought this for a Christmas gift for our 10-year old grandson (it was on his Santa list). He jumped so high when he opened it and I am sure that he loves his tablet!  This is enough storage for a kid and has many apps on it!", "Title": "Our Grandson LOVES this!", "Date": "January 13, 2014"}, {"Author": "Robert Whited", "ReviewID": "RKRRZM1893CD7", "Overall": "5.0", "Content": "Does everything a young boy  would want.  Great peace of mind as its cost was low, but quality is great.", "Title": "Great tablet and my son loves it on all hockey road trips!", "Date": "January 12, 2014"}, {"Author": "Linda", "ReviewID": "R1VFFWB0G1TA9Q", "Overall": "5.0", "Content": "I was looking for a kindle, but this tablet offered so much more for the same price. It is used mostly by my kids ages 8 and 4. I love that it has a camera. Great deal.", "Title": "Awesome tablet", "Date": "December 19, 2013"}, {"Author": "Robert J Ewers", "ReviewID": "R34E0YH8SVH8NA", "Overall": "5.0", "Content": "Really covers all my needs very well, including being able to load my memory card from my camera while on trips and upload photos to family.", "Title": "Fills my needs completely", "Date": "December 19, 2013"}, {"Author": "Hans", "ReviewID": "R2SKGE1WSPBZF1", "Overall": "5.0", "Content": "I recently bought the 10\" MeMo Pad and also the new 7\" inch Memo Pad for my family. It has been a complete success story. My wife is searching the web for professional information, taking pictures in her workshops and classes, even making a video. My son is connecting to his social networks posting selfies and enjoying games once in a while while listening to his favorite music or doing a video conference with farway relatives. My daughter also tries to master some of the simpler games for children. I downloaded Ebooks and have them read out as \"good night stories and regarding the games, look for educational games supporting the development of intelligence and logical thinking. There is lot's of good stuff around, It's not all shoot/kill/trick out etc. This Asus HD 7\" Memo Pad has been highly appreciated within my family and it turned out to be a very nice gift at an affordable price. Before they were carrying around one of my old laptops (15.6\" screen, icore3, 5.5lbs of weight). I analysed what they used it for and decided to buy them a tablet rather than another laptop. Any serious computer work they can do at very well equipped workstations. This tablet was the perfect solution. Ever since they haven't used the Laotop anymore! As to compare it to other tablets: In our country the Asus is not available and we had envious requests of friends and tablet owners (owning Samsung, and others owning some cheap low end brands which at the end cost the same or even more) to get an Asus for them! Conclusion: So folks it's worth studying the test reports of all the tablets/notebooks etc. and be clear about what yre you going to use it for and how much are you prepared to pay for it. This all helps to make a good decision.", "Title": "Great value for money! Great fun for all the family.", "Date": "December 18, 2013"}, {"Author": "Debbie", "ReviewID": "R1MRHUEP615SPF", "Overall": "4.0", "Content": "i  LILKED THIS TABLET VERY  MUCH.  i DO WISH IT CAME WITH INSTRUCTIONS ON HOW TO DOWNLOAD AND/OR OPEN CERTAIN SITES.  iS THERE ANYWHERE THAT I CAN GET AN INSTRUCTION BOOKLET?", "Title": "ASUS REVIEW", "Date": "December 18, 2013"}, {"Author": "Crazybob", "ReviewID": "R3B3DW179F6LPL", "Overall": "5.0", "Content": "This is my first tablet. After the frustration of learning android I really like it now. It's well worth the price. Some comments say the case is cheap, I found the case to seem strong. It has a good 8-10 hour battery life on a charge. Only con I have found is that the microphone is not very sensitive and there is no level adjustment. ASUS said to try a factory reset, but that didn't help.I have a stereo Bluetooth receiver(hotspot nfc) and is great to link up to my stereo or digital wireless headphones!Bob", "Title": "mostly happy with it", "Date": "December 18, 2013"}, {"Author": "Donald J. Browney Jr. \"SuwaneeGA\"", "ReviewID": "R34C3JJBWRJELN", "Overall": "4.0", "Content": "This is a really nice tablet. I have only had it for a short time but I have not had any problems with it.I have 2 other tablets that I got through Amazon but they came from China directly so they took several weeks to arrive. The last one I got was a Ployer Momo7 which was a nice tablet but it had a ton of fine scratches all over the screen even though it was supposed to be new.After that experience I wanted a tablet coming from a US distributer with a brand name so Asus fit the bill especially since they make the Nexus also.This is basically the original 16GB Nexus only with a micro SD slot that can take a 32GB card. The wifi picks up neighbors that my laptop does not. The screen is beautiful and I have watched movies from Netflix and HBO.The only thing that seems off is that the headphones do not get as loud as I would expect when I try to make it loud it comes with a pop up saying something about loud volume damaging your ears. It might be auto limiting the sound output from the headphones. I haven't figured that out yet. This tablet has a ton of features. I find new things constantly, some that I have not seen in the manual which is not as good as it could be but better than the China tablets I previously bought.What is also nice is that I didn't have to change the default language to English and get rid of a bunch of Chinese apps. I had to root the Chinese tablets to do this. I didn't have to do that with this ASUS. I would buy this again and through the same seller. It is a fingerprint magnet as others have written about so the screen is in constant need of cleaning  and this is why I only gave it 4 stars.", "Title": "Really nice tablet", "Date": "December 17, 2013"}, {"Author": "Jean R.", "ReviewID": "R3QPXDHZDBGEQB", "Overall": "5.0", "Content": "Took me a few days to orientate myself with this Pad but a phone call to the support line and I was on my way.  Great gadget.  Looking forward to using it when I travel.  Haven't had any experience with any other product but my son (ITT guy) recommended this product.", "Title": "ASUS MeMOPad HD 7 inch", "Date": "December 17, 2013"}, {"Author": "Monica Hayden", "ReviewID": "R1QU2FO8XP9W83", "Overall": "5.0", "Content": "I am very happy with it so far. I like the Android OS, and the fact that it is compatible with my phone, also an Android. It is also Google-friendly (unlike my Kindle Fire, which I also like).", "Title": "great iPad alternative", "Date": "December 17, 2013"}, {"Author": "Tony L Mosley", "ReviewID": "RUS3KPKAN5FY3", "Overall": "5.0", "Content": "My wife already had one of this model, decided to get one for myself. Was able to buy from Amazon for the same price I paid for hers at Sam's wholesale and without a membership card. Plus shipping was free. Thanks", "Title": "Great deal", "Date": "December 16, 2013"}, {"Author": "book reader \"book reader\"", "ReviewID": "RVKSURKI4GY3C", "Overall": "4.0", "Content": "Just about has everything i want to do. I want to be able to record in text while writing like Samsung Galaxy tablet. But i cannot do it with this tablet. It is also a little bit slow in response with my input, especially when changing application. Sometimes it just stopped. Overall, it is still a good buy.", "Title": "A very good buy", "Date": "December 16, 2013"}, {"Author": "Richard B", "ReviewID": "R2GN42FLW1HV7V", "Overall": "4.0", "Content": "Great for the price.  Could not pass up the opportunity to purchase a good quality device at this price.  Came quickly.", "Title": "Nice", "Date": "December 12, 2013"}, {"Author": "J. Lee", "ReviewID": "R3SPO41XRO478R", "Overall": "4.0", "Content": "Picked this up for my son and we are both very pleased.  Pretty snappy even under the heavy game content.", "Title": "Pretty snappy even under the heavy game content.", "Date": "December 12, 2013"}, {"Author": "Paul M. Antolik", "ReviewID": "R3PB0WC2XSCOEP", "Overall": "4.0", "Content": "I have never used a tablet before..this came without any instructions!  It has definetly been learning by trial and lots of errors.  i'm sure there is a ton of stuff I should be able to do with it but don't know how to access.  Screen isn't good in sunlight, very dim.", "Title": "Screen isn't good in sunlight.  Can't read if there is any glare.", "Date": "December 12, 2013"}, {"Author": "michael a mcdowell", "ReviewID": "R15V1C0DH5IX04", "Overall": "5.0", "Content": "This tablet is amazing! Id say a must buy ! I got it on sale for 130 so i couldnt psss it up! Evenat full price its worth the money.", "Title": "asus tablet rock!", "Date": "December 12, 2013"}, {"Author": "BigJ", "ReviewID": "R1MZQ1DFHX1IZG", "Overall": "5.0", "Content": "This is a terrific tablet with lot's of computing power at a very reasonable price.  Glad I got one and would recommend it to others.", "Title": "Terrific!", "Date": "December 11, 2013"}, {"Author": "Dave", "ReviewID": "R2LHQ9JQ043ZS8", "Overall": "5.0", "Content": "For a tablet this one is more than amazing.The price was very reasonable and the tablet was very comparable to the high priced ones. You can't go wrong with this product.", "Title": "memo 7 inch tablet", "Date": "December 11, 2013"}, {"Author": "Phillip", "ReviewID": "R3EDUJL6VRNSDD", "Overall": "5.0", "Content": "Amazing product, got it when it was on sale for 120 dollars, couldn't be happier. Very fast, very clear screen. Buy the Transcover case for it right away, you will not be displeased. As well as an Anti Fingerprint screen protector. Helps a TON with the fingerprints.Best bang for the buck you can have right now. Don't waste your money on a 400 ipad, or whatnot. This is a beast for the money. Good updates from Asus as well, firmware updates are fast and reliable.You may see some reviews talking about how \"weird\" it is that the bottom is a bit wider than the top and causes an \"uncomfortable\" edge around the unit. First of all, its barely noticeable. Second of all, its so the Transcover will snap onto the device and you don't have to worry about things coming up around the edges of your screen.", "Title": "AMAZING!", "Date": "December 10, 2013"}, {"Author": "Mitch", "ReviewID": "R3FD3ZBM8H12Z5", "Overall": "5.0", "Content": "My kids were given the MeMo after my wife and I did a lot of research.  The best thing about the kids using the MeMo for school and fun was the low cost and timely delivery.", "Title": "MeMO", "Date": "December 10, 2013"}, {"Author": "Andrey", "ReviewID": "R2EWRY3URPZ26R", "Overall": "5.0", "Content": "Pros: good battery life, design and durability, softwareCons: the screen is not too good on the sunlight, but that's the issue with the most of tablets", "Title": "Very happy with the tablet, especially after the latest update 4.2.2.", "Date": "December 9, 2013"}, {"Author": "chunglouie", "ReviewID": "R29ZUFQ1YH6EUZ", "Overall": "1.0", "Content": "I  GOT THE MACHINE IN OCT. IT CANNOT CONNECT WITH YOUTUBE ALL THE TIME. 2/8. IT TURNS DARK IN SCREEN TOTALLY WITHOUT WARNING. VERY UPSET FOR THIS PRODUCT. IT IS NOT EVEN PASS QUALITY CHECK. SHAME TO ASUS.", "Title": "HOW COME ASUS TURNS OUT SUCH PRODUCT.", "Date": "February 8, 2014"}, {"Author": "mp3dude", "ReviewID": "R2ZQA23H6GWW35", "Overall": "1.0", "Content": "i was using this tablet for facebook or some games and after about 90 days it failed to work it wont turn on and im very dissapointed , i even got the square trade warranty and they say i have to contact the manufacturer to get it fixed im very frustrated with this tablet :(I don't recommend it to anyone you should get the nexus 7 2013 its way better.", "Title": "Failed to work after a 90 days", "Date": "February 5, 2014"}, {"Author": "Elizabeth S.", "ReviewID": "R1EVSEPKQ1WWBR", "Overall": "1.0", "Content": "My MeMO died after about ten days. Just wouldn't turn on anymore. Major dissapointment to the owner who is nine and treated it like it was made of eggshells.", "Title": "Bad present!", "Date": "January 30, 2014"}, {"Author": "russting", "ReviewID": "R1OLUWRJCPV5FZ", "Overall": "1.0", "Content": "Second issue in less than a month. Had to factory reset the first time, second time had to send in for repair. Piece of Junk.", "Title": "Less than a month and sending in for repair.", "Date": "January 28, 2014"}, {"Author": "RT", "ReviewID": "R2AB37IDQUKJ0Q", "Overall": "1.0", "Content": "Lied to about delivery date for days.  Sent me an email asking if I was satisfied with a link for the review practically flashing in my face,  A small part, were you would miss it, asked me to let them know If I wasn't satisfied and they would make it right.  I did and it has been a month now with no response back.  This was $30 more than normal with the guaranteed LIE!Find someone else to buy this product from.", "Title": "Don't trust this seller!", "Date": "January 26, 2014"}, {"Author": "Muffy", "ReviewID": "ROZN8DXPN939Y", "Overall": "2.0", "Content": "I did a lot of research on tablets and settled on this make and model. I narrowed it down to this and a Nexus 7. The deciding factor between this and a Nexus was the SD Card storage and price.The screen on the ASUS is wonderful, the processor fast and the speakers are decent.What's wrong with it:the touchscreen controller is very laggy, the applications are severely lacking and the SD card slot keeps losing connection with my card. It doesn't have applications that are standard on most devices such as swype or a video player that plays anything but mp4. The annoyance factor with this tablet is sky high. The volume control button is right next to the power button, so half the time you want to turn it up, you turn it off. Arrgh. I wouldn't hold my breath waiting for ASUS to update to KitKat 4.4 either.I'm going to see if I can get the SD card slot fixed under warranty and give it to the kids.", "Title": "Wouldn't purchase again", "Date": "January 26, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1LSZGRM92K9DV", "Overall": "2.0", "Content": "We purchased one of these for my daughter for Christmas.My wife charged it fully on the 23rd or 24th of 12 hours.My daughter loved it used it none stop all during Christmas vacation, downloaded required reading to it and after school started was using a planner function to keep track of assignments etc.Awesome.Then it quit working one evening. It wouldn't respond. This was the second week of January.So, the following day I began my search for the correct customer service phone number to call, not nearly as easy as it should be. Finally I found the number and began wading through the warranty mire. To begin with this process is long and drawn out and be sure to have the original box that the unit came in with you, you will need that. After completing the questioning and plugging the tablet into the charger as asked, I was asked to hold the \"on\" button in at which time the charging icon began to show up intermittently. I was told to let the unit charge for 30 minutes and see what happens. I requested and received a warranty or incident number, thinking I wouldn't have to jump through all of the hoops again. About 10:00 pm it finally had a full charge and worked normally another few days, then failed again.We charged it overnight, nothing. Another call, this is when I found that the previous incident number apparently meant nothing because I had to repeat all of the information again, asked to perform all of the same trouble shooting tasks, again. Now, in my mind to me with a product like this when it is determined that the customer isn't doing something stupid and there is something wrong with the tablet the company should issue a call tag have the unit picked up and as soon as they receive it ship a new one to the customer and sold the repaired on as a refurbished tablet. This isn't what happened. We had to ship the tablet to the repair center to be repaired. Today we learned, because my wife was vigilant that the customer service representative we talked to had managed to misspell or address, which is staggering because to my recollection I gave them our address no fewer than three times, carefully spelling it each time.The tablet worked fine while it worked, which is why I gave it two stars. The failure of the unit after only two weeks and then the abysmal customer service makes me waiver on the two stars leaning toward lowering it to one.I would not recommend this unit to anyone. I would recommend an android tablet however.", "Title": "Pray you don't have problems with it", "Date": "January 22, 2014"}, {"Author": "Rick E.", "ReviewID": "RK9ARHHYXOJ27", "Overall": "3.0", "Content": "slower processor and graphics card than the Nexus 7. Parts of the touch screen no longer work. I've only had it since September 2013 and it was even lost under a bed for 3 of those months.", "Title": "Wish I spent more on the Nexus 7", "Date": "January 13, 2014"}, {"Author": "K. Moran \"K. Moran\"", "ReviewID": "R3NYZCGWX9UPXD", "Overall": "2.0", "Content": "This tablet was pretty nice, but I had noticed that it wasn't doing updates at the same time the other one I purchased had been doing. (I bought 2 at the same time) Great screen. Decent sound. Fairly fast and ran well UNTIL after using 3 weeks... it will not turn on at all. Will contact Asus on Monday and see how quickly they resolve this matter. I will post an update on my experience with Asus Customer Service and how they handle the warranty. Disappointed. I bought 2 and so far, the other one is still running fine.", "Title": "Won't turn on after 3 weeks using", "Date": "January 12, 2014"}, {"Author": "Sean Reynolds", "ReviewID": "R29QECKM74VJ82", "Overall": "1.0", "Content": "I was very happy with this tablet. It has a very solid build and design. Worked great for just over two weeks and then decided to stop charging. It wouldnt even turn on while plugged in. If Asus gets this problem worked out, then it's a great product.", "Title": "Worked great for two weeks.", "Date": "January 12, 2014"}, {"Author": "muneca", "ReviewID": "RG09U80RQ83ZY", "Overall": "5.0", "Content": "I bought this little gem after returning a kindle fire hd 16gb that was nothing but trouble.  The fire crapped out within 8 hours of unboxing it. Amazon customer service is really phenomenal.  They sent a new one, but alas it had the same issues. I was very disappointed. Sent it packing and got a refund.  I looked and looked for a different tablet.  I researched this one and took the plunge.  I have had it for over a week and it is awesome!!  Not a single glitch, performs flawlessly. The HD picture is fabulous. It runs netfix without a hitch. Google has tons of great apps. The camera (which the fire did not have) takes great pictures.  I could not be happier with this purchase.  It was less expensive than the Kindle and has expandable memory, microphone, and front and back cameras.  The only thing that is not quite as good as the fire is the sound.  The sound on the memo is very good, but the dolby on the fire was incredible. I would highly recommend the moko cover for it. It fits like a glove and is so well made.  All the cutouts for cameras and buttons fit perfectly.", "Title": "Memo Rocks!!", "Date": "November 26, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00E0FDYLI", "Features": null, "ImgURL": null, "Name": null}}