{"Reviews": [{"Author": "Marty", "ReviewID": "R3JP0MNZJVHUMA", "Overall": "4.0", "Content": "First of all, understand what I'm liking about it. This is being used as 7\" tablet for work and home, where I'm reading PDFs, websites, multiple email apps, music playback, etc. I'm not using it to play complex games or stream 1080p content or higher. I wanted a tablet with a very good screen, but didn't want to spend $500+. The MemoPad HD 7 has 1280x resolution which is what I was after, it makes a big difference. It's very bright, clear and crisp. Excellent quality screen. Battery life was my next big need. This thing has lasted me 3 days of random use with still half a battery to go. It just sleeps when I'm not using it. I leave WiFi on the whole time too. The 10 hour rating, sure, but I'm using it for days at a time between charges so far with my usage (email, websites, PDFs, etc). I'm sure streamed video would take more battery faster. Keep that in mind. So for those kinds of uses, this thing delivers everything with a bright screen and a long life battery for $150 which is way less than the expensive stuff but does the same job basically.If you want something for complex games and intense high definition streaming playback, pay for a more expensive device probably. This is not a substitute for a work station or camera. It's basically a really pretty e-reader, but with very wide open Droid and Google parts/backing. If you just want something to run apps, email, websites, some music, etc, some random youtube, this will do it without needing to pay $300+ more for the same stuff with a big name.", "Title": "Eat your heart out i-mini and nexus.", "Date": "August 23, 2013"}, {"Author": "J. Harley", "ReviewID": "R22HWX1DUBU3N5", "Overall": "5.0", "Content": "Given the price point and specs, I was very eager to compare the MeMo to my 32GB last gen Nexus 7.  I wish I could compare it to the newer Nexus but last gen will have to do.The MeMo comes packaged pretty much identical to the Nexus 7 with the tablet, micro-USB cable and AC adpater included.  Although the quality of the plastic body isn't exactly on par with the other Asus tablets, it's far from what I would consider cheap feeling, esepcially at this price.  I have the blue model.  The only complaints I have with the body is the placement of the power and volume buttons as well as the USB port.  The design of the case causes a tiny overlap of the back panel around the entire tablet.  This is because the back panel is larger than the front panel.  The overlap doesn't bother me during normal use, however, the placement of the power and sound buttons on the right rear behind the bezel make them a little awkward to find by feel. Although I don't have a case yet, I can only imagine a case would make things a little more cumbersome.  Asus also decided to place the USB port on the top of the tablet which also seems awkward considering the standard location, including on my Nexus 7, is on the bottom.  I often pick the MeMo up and try to operate it upside down based on the plug orientation if it's charging.  I guess I just have to get accustomed to it.The display is beautiful.  Colors are nicely saturated and text and graphics are sharp and bright.  The 1280x800 resolution keeps text sharp even when zoomed in.  Asus includes a calibration tool to further fine-tune and enhance the display if desired.  There were no dead/stuck pixels or noticeable light bleeding along the edges.  The screen doesn't feel like it has any type coating nor do I believe it's Gorilla Glass, although I wouldn't expect either option at this price.  There is a fair amount of friction when swiping on the bare screen and fingerprints accumulate quickly.  I plan to purchase screen protectors to resolve these issues.Performance is generally good on the MeMo.  I don't really notice any difference between the Nexus 7 and MeMo HD during normal operation.  Non-demanding apps like financial, weather, email and social networking apps run just fine with no lag or performance issues.  Less-demanding games like Subway Surfers also run perfect, even when the action speeds up to a frenzied pace.  Where I do encounter trouble is with CPU-intensive games like Asphalt 7.  Asphalt ran on the MeMo but with a slow choppy frame-rate that was noticeably inferior to the Nexus 7.  Even the cut scenes were choppy.  My suggestion is to step up to the Nexus 7 if you are an intense tablet gamer and usually play resource hungry games.  Battery life seems a hair better than my Nexus 7.The front camera resolution is 1.2MP but nothing to write home about.  Pictures appear a little fuzzy, especially in low light.  The front cam video can be set to 480P or 720P and does a decent job when used as a web cam for social video conferencing apps like Skype. The one biggest advantage the MeMo has over the Nexus 7, is a 5MP rear camera which is pretty good.  Still photos and video are acceptably sharp and accurate.  ASUS throws in a ton of features for both still and video formats including creative filters, preset modes, adjustable resolution (video only is adjustable on front camera), exposure compensation, white balance, panorama and HDR, and more.The biggest difference between the Nexus 7 and the MeMo HD is the fact that the Nexus comes with plain vanilla Android.  No extra software is included.  The advantage of plain vanilla Android is that you always stay frequent with the latest Android updates first because it comes directly from Google instead of the manufacturer.  My Nexus is on Android Jellybean version 4.3 while the MeMo is still on Jellybean 4.2.1.  In addition to the above mentioned camera app, the MeMo comes pre-loaded with a ton of pre-installed apps and widgets in a similar looking but slightly different version of Android.  It's not the bleeding edge latest version of Android like the Nexus but is still more recent than most other manufacturers.Overall, unless you routinely use apps and games requiring gobs of horsepower, the MeMo HD is an excellent low-cost tablet.  It's basically a less expensive Nexus 7 with a little less horsepower and memory but makes up for it with useful pre-installed apps, a micro-SD slot and rear facing camera.", "Title": "Excellent Low Cost Alternative", "Date": "August 18, 2013"}, {"Author": "NutRoll", "ReviewID": "RM7JHH3RUBM9Q", "Overall": "5.0", "Content": "I've bought 3 of these.  So far they work great.  One is for me, and the other two are for my kids.  I'm in IT and use tablets on a daily basis.  I've used the iPad, Surface, and the Note.  It's not going to be high end like those 3 devices, but for the price you get a good tablet.  I would say the battery lasts (constant use) about 6 to 8 hours.  This can very depending if you are just reading or playing movies and games.  The screen is very responsive.  The only suggestion I have is get a screen protector, because the screen likes to show figure prints.  With the screen protector, you don't have this issue.  The only con I can think of is that it doesn't have a auto brightness, but that hasn't been an issue for me.What we use them for:- Read Kindle books- Watch Netflix and Plex- Take video and pictures (doesn't take bad pictures) No Flash- Check email- Surf the web- Control my Roku's- Vmware View- RDP Client- Mind CraftIf you are getting it for your kids.  There are some nice apps included to protect your kids.  I set them up with my account, and then use the applocker to prevent them from using the Play Store to purchase anything or making any setting changes.  It also has a parental software, but I haven't use that yet (I use opendns of web filtering).Regarding Amazon.  When I first bought this tablet it was priced at $150, but then a week later dropped to $120.  Amazon was great and refunded me the difference.  Love Amazon customer service!", "Title": "Very good tablet for the price", "Date": "November 14, 2013"}, {"Author": "Matt from SD", "ReviewID": "R1P7R6BJAEGCL8", "Overall": "5.0", "Content": "I love this tablet. I have the older model as well that I purchased in May 2013. This one is so much faster and the screen is excellent. What a great value with all the features you'll need. The touch screen is very responsive and the operating system is really fast and easy to use. Why buy a Nexus 7 when you can get this?", "Title": "HD 7 ROCKS!!!", "Date": "August 13, 2013"}, {"Author": "B.L.", "ReviewID": "RMN7E379TLTY9", "Overall": "5.0", "Content": "In many ways, this little tablet is a lot like the Nexus in its styling, which isn't surprising since it was made by the same people.On the question of the case, it honestly doesn't feel cheap to me. I also don't really spend much time in physical contact with the back of the tablet, because I keep a cover on it the vast majority of the time.Asus added some software to it that's actually pretty nice. One of the items they put on gives you some cloud storage to use to augment your tablet. It looks like that lasts for a year. Of course, unlike the Nexus line, you can also use a microsd card. (With the revelations about spying on the Internet lately, I think more people will be valuing microsd cards over using cloud storage.)One of the features that really doesn't get much attention for this device is the option of using Miracast. I used it with Actiontec SBWD100A01 ScreenBeam Pro Wireless Display Receiver for WiDi Laptops/ Miracast Devices and was able to very quickly have my tablet screen mirrored to my HD television. This was nice for putting videos up that I wanted to watch on a bigger screen, and for showing off some pictures (particularly to a couple of aging family members who need things to be BIG so they can see them).Miracast basically takes exactly what's on your tablet screen, and puts it on an HDTV (there are some that have this built in, or you can get a separate receiver and connect with HDMI). This is different from something like Chromecast, in that your tablet has to be actually playing the videos or whatever you're doing (where the Chromecast device will take over your Netflix stream if you tell it to). On the other hand, the Miracast approach lets you mirror _anything_ that can show up on the tablet screen. This means no limitations based on who wants to provide special apps or whether they'll give special approval to have their content put on a TV via a mobile device.I've found the performance of this little Asus to be very good, considering its price range. For some people, the extra you'll spend to get up to a 2013 Nexus (or something comparable) won't seem like much, but it IS roughly a 50% additional premium over the base price of this tablet, so that's really not a small difference by comparison.This will run a whole range of apps and games. I'd imagine it'll struggle with the absolute top of the heap Android games meant to be run on devices that cost at least twice as much, but that shouldn't be a surprise to anyone. For day-to-day purposes, I've been using it around the house and I took it with me to a technology conference over the weekend (using it as my primary device during that time) and it was easy to carry around and to do everything I needed to do.Note that this won't get Android updates as fast as Nexus (it currently runs 4.2.2, while Nexus is at 4.3). However, many people haven't realized this yet, but Google is working toward having most of their functionality-boosts for Android distributed without having to go through device OEMs for special builds. This will make it less important to be sure that you're buying from a manufacturer that's serious about updating quickly.For the vast majority of people (who want to check email, go to social networking sites, play Candy Crush, and that kind of thing), I'm very comfortable saying that this will be able to meet their needs and the price point is very good for what you get. I truly don't think most people will see enough of a performance boost from going with something more expensive that it's actually worth the money. This is a great buy.", "Title": "Solid Offering From Asus", "Date": "September 17, 2013"}, {"Author": "A. Stanton", "ReviewID": "R2V97OHIASSZX4", "Overall": "5.0", "Content": "I've only had the Asus Memo Pad HD 7 for a few hours but so far I'm very pleased.  The tablet seems very well made.  I haven't noticed any creaks or cheap-looking parts.  It looks elegant (I have the blue back) and feels well balanced in the hand.  I like its light weight and appreciate the size of the bezel - not too large to look awkward or too small so you have nothing to hold onto.  Some of the reviews I read mentioned problems with the build quality but I don't find that to be the case at all.I really like the HD display.  The colors are rich (not overly saturated but definitely not \"washed out\" as some reviews have stated) and the text is very sharp.  Setup was a breeze.  The WiFi works very well - web browsing is at least as fast as my PC.  Sound quality is good for such a small device.  And I am very impressed with the cameras, especially the 5 MP rear camera.  Even indoor shots look good.  The camera also produces sharp, colorful 720p videos.It will take awhile until I'm familiar with all the HD 7 has to offer but so far I haven't encountered any negatives.  You won't find a better tablet for $149.", "Title": "A pleasure to use", "Date": "August 16, 2013"}, {"Author": "Brian", "ReviewID": "RMKINF9IYM5S9", "Overall": "2.0", "Content": "Update:We wanted so much to like this tablet. It has so much going for it. But about every 5 to 10 minutes, it would turn on for about 5 seconds and then turn off.  This was especially frustrating at night with the tablet next to the bed on the nightstand.Also, the SD card would randomly unmount and then remount. It made watching a movie difficult as it would unmount the card several times through a 90 minute movie and each time, we would have to find the place where the movie had just quit. We are not sure if these two problems are related.We returned the original and Amazon sent a replacement but within a week, it also suffered from the same problems. We are also returning this one in exchange for a Nexus 7 (2013).Original review:Wow!  Where to begin.  Just a note on our background for perspective.  In our family, we have a Google Nexus 10, Samsung Note 8, Samsung Galaxy S3 and a Samsung Note 2.  I have also used an iPad extensively for training purposes.  We just purchased the Asus Memo Pad HD 7 for my son who just started college.Asus has come a long ways in the last couple of years.  My wife received an Asus notebook computer for Christmas last year and it has run great for the last 9 months.  When we saw that Asus released the Memo Pad HD 7 for $150, I was intrigued and decided to take the plunge.  My son has been using it for the last 6 days and he is very impressed.  We visited him yesterday and I got to see the Memo Pad for the first time.  I was impressed and here are my thoughts.A little bit about resolution and pixel density.  Apple settled on a resolution density of about 260 to 270 ppi because, as they claimed, the human eye can not differentiate the pixels at higher resolutions.  That begs the question of why Google released the Nexus 10 with a resolution of 300 ppi.  The extra resolution may be waste but they got a lot of mileage out of it claiming the highest tablet resolution.The first thing I looked at on the Memo Pad was the screen.  OK, it does not have as high of resolution as my Note 2 or the Nexus 10, but honestly, it doesn't matter.  Why?  Because I could only tell the difference when I looked really close at very small characters on the screen.  And I had to really look for the difference.  So how high of resolution is practical?  Well, I could tell a slight difference when the tablets were about 5 or 6 inches from my face.  But I don't use tablets this way.  I usually have them about 12 to 18 inches from my face while using them.  At that distance, I honestly could not see the difference in clarity and sharpness.I have looked at the new Nexus 7 and it has a very nice screen.  But I couldn't help asking myself why I would pay an extra $130 more for the Nexus 7 (32 gb version).  I would gain a slightly better screen but would only be able to tell the difference at unrealistically close distances.  But I would loose storage expansion since the Nexus does not have an SD card slot.  By the way, while visiting my son, I wanted to copy a couple of movies to his device.  I could not do it with my Nexus 10.  I had to use my Note 2 to copy the movies to his card, put the card back into his Memo Pad and voila, he had the movies.  Sadly, this is not an option with my Nexus because it does not have an SD card slot. :(Some reviews have complained about the location of the power and volume buttons.  Asus moved the buttons further toward the back, more on the back radius of the device instead of being on the side.  Both my son and I love the new position.  When the buttons are on the side, it almost requires two hands to push the button, one to hold the tablet and then the other to push sidewards on the button.  But by moving the buttons farther towards the back, all that is required is a \"pinch\" with your thumb and finger to engage the button.  From my perspective, this is genius!  I love the button placement.My son installed Google's new replacement for \"Talk\".  It's called \"Hangouts\".  Basically, it's Google's version of Skype and allows video conferencing.  It worked perfectly on my son's Memo Pad HD 7 but my Nexus struggled with the sound.  The sound was choppy and the volume was very low.  A little research revealed that this has been a problem with the Nexus 10 for about a year. It will never make sense to me how Asus can get the application to work flawlessly on a $150 table while Google can't even get it to work correctly on their flagship product, the $500 Nexus 10!  It works great on every other Android device that we have.  But the Nexus 10 couldn't handle it!The camera on the Memo Pad HD 7 seems adequate.  I don't use the cameras on the tablets because my Note 2 has a better camera than any of the tablets.  I always have my phone with me but I don't always have a tablet.  Camera's on tablets are not a big deal to me.The only real negative to the device is that it has no ambient light sensor so the screen will not automatically dim or brighten depending on lighting conditions.  However, I am not sure how much of an impact this actually has.  On my Nexus 10, outside in bright conditions, the brightness never goes to maximum automatically.  I always have to go into the settings and manually set the brightness to max when I want full brightness.One last note on the cheap feel of the tablet.  I don't see it.  Sure, the iPads are always touted for their great build quality and feel.  I personally prefer the lighter weight of the Nexus 10 over the iPad.  The aluminum is cold.  The rubberized back of the Nexus is warm and easy to hold.  The Memo Pad HD 7 does not have the grippy back like the Nexus but it doesn't feel cheap either.  It is slightly thicker than what I would prefer but that is almost a non issue.  I even commented to my son that if Asus simply charged $200 more for the device, people probably would stop commenting on the cheap feel.  They simply have the perception that it must feel cheap because the tablet is so inexpensive!The only three cons that I see in this tablet are:1. SD card size is limited to 32 gb.2. No ambient light sensor.3. Does not have wireless charging.However, every one of these negatives is overcome by it's price.  Asus has created an incredible tablet at an unbelievable price.The bottom line is this.  I know that Asus will soon be releasing the Memo Pad FHD 10.  It will be very similar to the Memo Pad HD 7 only with a larger screen.  The price will probably be somewhere between $300 and $400 and should have Miracast (wireless display).  If I were to sell my Nexus 10 and buy the new Memo Pad FHD 10, I would gain an SD card slot and may even put a little bit of change back into my pocket!  I'm seriously considering it! :)", "Title": "Life is good.  Great wife, great kids and the Memo Pad HD 7!", "Date": "August 26, 2013"}, {"Author": "suzatm", "ReviewID": "R1UP496MOX2F82", "Overall": "5.0", "Content": "I received mine yesterday and I am very happy with it.  First thing you notice is how light it is - a good bit lighter than the previous MeMo pad.  It is even a little bit lighter than the Ipad Mini.  The next thing you notice is the beautiful screen resolution. Videos are up there with the Fire and the crispness of the print in ebooks is very close to the print on the high resolution Ipod touch 5.  This is a wonderful tablet that allows for a lot of customization.  You now also have the ability to designate where you want your default main storage to be - device or SD card.  You have the ability to set your power saving mode to turn off wifi automatically when you are reading your book and turn on automatically when you move out of your book. You can change the color intensity/scale of your screen. It was easy to set up and wifi has a really good strong hold - no dropped signals so far.  The camera does a very decent job - I think better than the Ipad mini. I didn't notice the back of the device or the screen  being more of a fingerprint magnet than any other device though I am waiting for a screen protector to arrive. The lowest light setting is still not low enough for me but then the Screen Filter app is pretty good at helping to lower the light intensity. I gave it a full charge last night and sitting with wifi on overnight it only lost about 3 percent where the previous Memo would drop a lot more than that.  I bought it mostly to have all of my ebooks from all sources (Kobo, Sony, Amazon, Nook) on one device and to be able to carry it with me all of the time (Ipad mini is too expensive to do this without worry). So for what I bought it for - it is wonderful.  I'm still playing with it but I don't think my opinion will change other than to go higher. Asus has really delivered a low priced, excellent tablet.", "Title": "Great upgrade from earlier verson of Memo Pad 7", "Date": "August 16, 2013"}, {"Author": "Computer Tech", "ReviewID": "R8GO979DM6NO3", "Overall": "5.0", "Content": "Finally, a great tablet at a really great price that has it all (at least most of it!)If you want a great tablet, you can get a Nexus 7 FHD, a Samsung Note 8 or Samsung Tab 3 8.  These are really good tablets at a premium price.  The Nexus FHD is a great tablet and affordable; however it has a few bugs to work out and I refuse to buy a tablet with no expansion (MicroSD card) slot.  (Yes, Apple, I am speaking to you too!)  This is the Nexus 7's big downfall as well.  Sorry Google, I don't want everything I have to be living in your cloud.  Some things I want to carry with me!The Samsung Note 8 is a great tablet at a premium price.  Sure it has handwriting recognition, but really, it's just not a good value at $379 to $399!  The Samsung Tab 3 8 is a great 8 inch tablet and that extra inch of space (diagonally) is really kind of nice.  But Samsung wants $299 for it.  C'mon guys, its good, but not that good.  Samsung could be a favorite of all if they would lower the Note 8 price to $329 and the Tab 3 8 to $229 with a quad core processor!Enter the Asus Memo HD 7.  A great quad core tablet.  IMO it's as good or better than the original Nexus 7 and has an microSD slot and a decent camera too!  It's well made and super affordable!Pros:Quad Core Tablet (AMD 1.2GHz processor)1280 x 800 Screen Resolution on an IPS Panel1.2MP Camera on front, 5MP camera on back.Micro SD slot for expandability and convenience!!!Reasonably well made by a top player in the market - ASUS!149 bucks and you can catch it on sale - got mine for 135 bucks!You get GPS and some pretty decent ASUS apps like a To Do list included16GB of flash memoryReasonably good sound for a tablet!Has wireless and BluetoothCons:1. The charger is not a smart charger.  Consequently, you cannot just leave it plugged in.  If the charge on the Asus MeMO 7 gets too low, it has issues with charging.  I had to use a high quality (Apple IPod) charger with a micro HDMI cable to get my unit to charge when it discharged so much that it would no longer charge with the Asus charger.2. No magnetic sensor for auto on and off with a tablet case.3. The back is a slight bit slippery (smooth, not textured).  You need a case to hold this rascal.  Otherwise, keep a good grip on it...4. Only 1GB internal SDRAM.Observations:To keep it affordable you get a lower screen resolution than the Nexus 7 FHD - I hardly notice it.To keep it affordable the processor is a bit slower (but still quad core) and you only get 1GB of RAM memory instead of 2GB - (well you get what you pay for!!!)Suggestions to ASUS to improve this tablet:1. Give us a smart charger with this tablet!2. The MeMO HD 7 needs a sensor to turn the tablet on and off when a tablet cover is used.3. Give it some texture on the back of the tablet to grip it a bit better.4. Find a better place for the power button!  I'd like a power button on the front of the tablet for easy reach, but I guess it is cheaper to have a solid piece of glass on the front of the tablet. Maybe put the power button on the top of the tablet in the future for easy access.5. The obvious stuff - give us more internal memory (32GB), a higher resolution screen and an extra MB of RAM memory (up to 2GB) when you can do it at a good price.6. The cost of your case is a bit high. Other manufacturers are offering leather and leatherette cases that seem more practical to me and at a better price.I really want to thank ASUS for making an affordable tablet with some great features!I heartily recommend that you buy this tablet!  At this price, you won't be disappointed!!  I absolutely love it!For those of you who are considering an 8 inch tablet:I recommend you look at the ASUS MeMO 8 for $199.  There is also the Dell Venue 8 for $179.  Recently the Samsung Tab 3 8 has dropped to $249 which is still a bit high, but if you can find it on sale for $229 or less, it would be worth considering.", "Title": "Great tablet at an affordable price!  Has everything you need!", "Date": "August 24, 2013"}, {"Author": "SisikyouScoj", "ReviewID": "R20QQIPKQ3J1V6", "Overall": "5.0", "Content": "I am a Mac guy and have been one since the 80s. I'm also on a budget. I've been waiting for the new iPad mini, thinking it would replace my aging iPod and my (non-Apple) cell phone. And I also wanted something easy to carry around. The iPad mini would not replace my cell (none of these tablets have phones except a high-end Samsung), AND the new iPad mini costs close to $400. A tablet, I thought, wasn't something I needed but something I wanted. I was envious of my friends who had one.So I did a little research and came across this ASUS, with the Android operating system and a price about 1/3 of an iPad mini. I had some credit card Rewards points, and it was really inexpensive so I decided to take the chance.Buhbye Apple--at least as far as tablets are concerned. This thing is awesome. Learning curve was a couple of days (DO download the PDF manual and DO order a nice folio case) but I was able to port over my address book, my iTunes songs (MP3s) and pretty much anything else I would need. I also installed Skype and this device is AWESOME. Great size, too, like a paperback book that links you to the world.If you're on a budget and don't want the world to pass you by, I highly recommend this tablet. I've been an Apple guy so long, I didn't realize how far the competition has come!!!", "Title": "This Asus is Aces", "Date": "November 19, 2013"}, {"Author": "funnymama", "ReviewID": "RR7RSSVHBXZH1", "Overall": "4.0", "Content": "I have had it for a short time, but so far the functionality seen fine. I still have a lot to learn about all its functions, and I have some difficulty with the touch screen reaction time and sensitivity. However I have had this same issue with two other tablets that my family owns.", "Title": "Nice Christmas gift", "Date": "January 4, 2014"}, {"Author": "Michael Goldsmith", "ReviewID": "R1ZDI6FEPVEBSN", "Overall": "5.0", "Content": "We chose the little Asus after a bit of research. It's one of the best bargains out there for a tablet IMO. It's got good speed, an excellent screen and 2 cameras compared to none on the Kindle Fire HD, and only one front-facing for the Fire HDX.The only two complaints I have is that I wish it had 2 gigs of RAM, but 1 is standard in this price range across manufacturers. The other is that although the screen is bright with punchy colors, the glass picks up smudges and fingerprints like crazy. Still, I'm very pleased with my choice.", "Title": "Great bang for the buck!", "Date": "January 3, 2014"}, {"Author": "Doug Didier", "ReviewID": "R3931BUBWZMK9G", "Overall": "4.0", "Content": "Bought this tablet for my 5 year old daughter.  Her brothers both have the old editions of Nexus 7s and are pleased with them, but the Nexus is a bit more expensive and being 5 I have my doubts about if this won't get stepped on/broken/put in a toilet, so I wanted to minimize spending.  The display is nice, the processor is quick, and it's pretty obvious to tell this is just a  slightly lesser version of the Nexus 7.  The construction quality feels a bit cheap, but I got a protective case (bobj gear FTW) so that wasn't as big of an issue.  I did have a few software bugs (Unfortunately launcher has stopped was the error, preventing me from doing almost anything) but I reset the tablet (done under settings) and updated the firmware and all is right with the world.Pros:  Good display, nice camera, quick responseCons: Construction seems cheapAfter getting this for the Daughter, my wife purchased one as well.  She is equally satisfied.", "Title": "Great price, nice tablet", "Date": "January 3, 2014"}, {"Author": "jason", "ReviewID": "R29OKMN4Q5AXO7", "Overall": "5.0", "Content": "Works great so far,i would recommend this to anyone looking for an entry level tablet that is inexpensive and is great for my kiddo.I find myself using it more than my son.", "Title": "Buy it people.", "Date": "December 30, 2013"}, {"Author": "Kerbear", "ReviewID": "R3SCCFCBZUMFS", "Overall": "5.0", "Content": "I read and read and read reviews before finally selecting this ASUS meMOPad for my 8 year old daughter.  We have only been using it for about a week, but so far it has proven to be awesome!  For a child (or for myself for that matter), I just couldn't justify purchasing a $400+ ipad.  This tablet, with a $150 price tag, will not disappoint!!!  It is actually much nicer than I expected.", "Title": "So far so good!", "Date": "December 30, 2013"}, {"Author": "sofla", "ReviewID": "RP4ZS1KE7JQ0W", "Overall": "5.0", "Content": "I really love this Android tablet and it deserves a good review. I had the problem where the micro SD memory mounts and dismounts and mounts, etc. Someone in one of the reviews tried putting some card board behind the chip. I cut the corner off of a business card and slid it in with the SD chip. So far, problem solved. Otherwise, I love this thing for $129. Mine is blue.", "Title": "Great Android. MicroSD Mount/Unmount Issue (Solved)", "Date": "December 29, 2013"}, {"Author": "Dani", "ReviewID": "R2ACGDSTUJQDF3", "Overall": "5.0", "Content": "My son is in his twenties and wanted a tablet that he could use. For FB and to play poker, as well add take pictures, and this fit the bill!!!!  He is pleased and I checked consumer reports, this model was a \"recommended buy\"", "Title": "it's everything my son wanted!!!!!!", "Date": "December 29, 2013"}, {"Author": "Christopher Bishop", "ReviewID": "R1202EHTN7XIL2", "Overall": "5.0", "Content": "This is my first tablet and I am very happy with it.Inexpensive enough to use heavily without being afraid to break it. I considered getting a case then figured why pay 15-25% of cost of the tablet for a case? I can just replace the tablet.It does everything I want: browse internet, watch internet videos on most sites, android apps...I still need to set up for e-reading.Browsing and use speed are sufficient--I haven't had any serious performance hickups that have made me feel that it would be worth it to spend more $ for faster perfromance. Then again, I am not editing excel, powerpoint, or video...just consuming content.Many options between the ASUS installed apps, Google branded apps, and everything available on android/play. In many cases many there is overlapping in uses/purpose among these 3, so you have many options to choose from.I compared to other known brands under $150. The Walmart 7\" (was it HiSense?) which had a mini-HDMI port but only 8gb, no expandable memory, and I think worse screen. Also compared to the Kindle Fire HD and I think the Memo HD had faster performance (and I liked the idea of sitting outside the Amazon pay gardens).One cool feature is the ability to set up several user profiles so different family members can manage their own desktops, apps, and profile logins. The downside is that it appears to install duplicate copies of apps if both users install it (ie 2 copies of Facebook app). This might eventually affect storage capacity but with 16gb I'm doing ok.One small issue was that, at first, I had trouble using earphones. The earphone jack would not enter all the way into the plug--even with a somewhat above normal amount of pressure. Therefore sound would cut back and forth between the speakers and earphones as connection with the half-inserted jack was made and lost. After a few uses, I was annoyed enough that I decided that I would just force the jack all the way in and return the whole thing if something went wrong. Well, it worked and the plug has been normal ever since--a normal amount of pressure to insert and remove and sound is 100%.All in all pretty good--but I would have loved a mini-HDMI", "Title": "Awesome", "Date": "December 28, 2013"}, {"Author": "philip murphy", "ReviewID": "R3T812Y6CY7IR5", "Overall": "1.0", "Content": "This is a great tablet except for one thing. I've had two of them die in a month. As far as I can tell, the weak link on this tablet is the build quality. The power switch was always a bit sketchy on my first one. It wouldn't always wake up on the first try. Then about a month after I got it, it went dead. I returned it. Unfortunately the next one died the second day I had it from the same problem. I'm going to try something else next time.I have no idea how this slipped through Asus' QA, but this is a terrible flaw in this product. Just get something else. I've definitely lost my faith in Asus over this.", "Title": "Pathetic Build Quality", "Date": "December 27, 2013"}, {"Author": "Melchor S.", "ReviewID": "RNOMHHMI1S9TD", "Overall": "5.0", "Content": "For the price, speed and performance this is excellent to me, only I don't know how durable this device is.I have a Kindle FireHD but my problem is it doesn't have a rear camera on it and there's no slot for  microSD unlike the Asus Memo7, I recommend this Asus Tablet all.", "Title": "Back to Back Cameras and additional memory storage", "Date": "December 27, 2013"}, {"Author": "Rachel", "ReviewID": "R32MI2JQ83D5C", "Overall": "5.0", "Content": "I got this for my mom for her birthday and I like it more than my Nexus 7 (1st gen). It's fast, has lots of fun apps (including a camera mirror app so she can check her makeup with it) and the volume is great for watching movies. Thinking about getting another and regifting my Nexus.", "Title": "Better than Nexus", "Date": "April 15, 2014"}, {"Author": "greg carothers", "ReviewID": "R1QFHDPY38A9LE", "Overall": "4.0", "Content": "I'm satisfied with this tablet however it has limitations but for me this enough, with I recommend to older crowd", "Title": "ASUS Tablet", "Date": "April 3, 2014"}, {"Author": "Mrs. Arnold", "ReviewID": "RALK2ZDIGR6WG", "Overall": "5.0", "Content": "Before I bought my Memo Pad, about a month ago, I read all the reviews about it. The reviews that talked about the merits of the tablet itself are the ones I paid attention to. One thing that seemed to fuel my purchase were the constant comparisons to iPad minis and Samsungs. I know in some aspects, comparisons must be made to make a judgement, but the ones that put down the Memo Pad because it wasn't an iPad were ridiculous. This will be a review based on personal experience with the Memo Pad HD.Over the last month I have thoroughly enjoyed myself. I worried about using a 7\" tablet because I was used to a 10.1\", but it was so heavy! Once it died it was the perfect reason to look into small form factors. Having a smaller budget to work with and knowing what I wanted in a tablet left me with a small group to choose from and this Memo Pad was always at the top.Here's what I like about it:-The 7\" size is a perfect fit for me. Fits in my bag nicely and doesn't add much weight. I can hold it in my hands for a long time without my hands, arms or shoulders getting tired. I have wrist and shoulder injuries and can't hold much weight for long. I bought a case for it and I love that too. It fits perfectly with access to the buttons and camera without having to remove it. It's great!-The speed. The quad-core processor was a huge factor in my decision to buy it. I didn't see another tablet in this size with a quad-core processor AND all the other features I was looking for in my price range.-The memory. 16 GB with 32 GB expandable where my 64GB micro sd works and shows up just fine.-The sound is awesome for such a tiny tablet. Louder than my laptop!-The battery life. It's excellent. Heavy usage all day after a full charge and I never need to charge it more than that. I just plug it in before bed.-HD quality. It's high res screen is evident as every color is bright and vibrant and can be even more enhanced with the built in software.-And finally, it's hot pink....HOT PINK!! :)But there's no HDMI output? ... Not once since I've had it have a had the need for one. Not once.Games play great on it, graphics are amazing and sound is outstanding. It's really fast and it hasn't disappointed me yet. There's nothing I don't like about it and that's my honest opinion.", "Title": "I didn't buy an iPad mini....I bought a Memo Pad HD!", "Date": "April 2, 2014"}, {"Author": "Jairaj", "ReviewID": "R14H70J7LXNB2G", "Overall": "5.0", "Content": "This is a high  quality product without the high quality price. It can run any app even including GTA San Andreas one you download it of the internet", "Title": "Really Great Device", "Date": "April 2, 2014"}, {"Author": "himan", "ReviewID": "RQEERTV6C6P1E", "Overall": "4.0", "Content": "This is my first android experience. It is good, but it doesn't work as smooth as iPad.It is hard to touch a small area on the screen. Even when I touch a button carefully, it works unexpectedly.", "Title": "Good for the price. Not as smooth as iPad.", "Date": "April 2, 2014"}, {"Author": "Benjamin", "ReviewID": "R11XCVNEDFCL09", "Overall": "5.0", "Content": "I have used this tablet for a little under a year now. It stayed in my pocket everyday while downrange. Battery lasts for around ten hours and around eight if used extensively.", "Title": "I love this tablet", "Date": "April 2, 2014"}, {"Author": "Daniel Thomas Arnold", "ReviewID": "R1KEXA2KAX9PE9", "Overall": "5.0", "Content": "I bought this tablet for my eight year old. It's a great value.  Solid construction and good looks for a reasonable price.  She loves the pink case too.", "Title": "great tablet for school age kids", "Date": "April 2, 2014"}, {"Author": "Tracy B. McLendon", "ReviewID": "R2GXSRB5R2CBGH", "Overall": "4.0", "Content": "This tablet was a good pick for my 81 year old mother. (I say \"was\" because she has lost it already!) � the only draw back from what I experienced was downloading apps. An error message would come up each time an app was added. Which made me hesitant to add more on it.  I had to turn it completely off and begin anew after each app was added. So only two extra apps were added. But the picture was excellent.  Just right for mom.  I wish there was recourse for finding it now.", "Title": "Good choice good price", "Date": "April 1, 2014"}, {"Author": "Patrick G.", "ReviewID": "R2JJDUVBLVMF4L", "Overall": "5.0", "Content": "I've only had this for 5 days. Will update my review in a month.So far I love this tablet. It is not as responsive as the 2013 Nexus 7 but I primarily surf the web, watch movies and TV shows, and play board games like Carcassonne, Elder Sign, & Ticket to Ride. All of Wichita performed flawlessly. I also use it to read PDF's and comics. The screen resolution allows for clear, crisp viewing of both these mediums. There is some hesitation when countering vertical to horizontal viewing and occasional hesitation at launching some apps but nothing to really take a star from the review over.", "Title": "Love it!", "Date": "April 1, 2014"}, {"Author": "James H \"James H\"", "ReviewID": "R2X4T63P3DLLZ9", "Overall": "4.0", "Content": "A very good basic android table for the price! Nice bright screen, good sound, easy to operate. The only drawback is very poor graphics and the fact that is doesn't support any flash player videos (like most tablets).", "Title": "Good tablet for the money!", "Date": "March 31, 2014"}, {"Author": "Thomas", "ReviewID": "R20N2MEOL8TN68", "Overall": "4.0", "Content": "I read some reviews, and was hesitant in purchasing.  After tax time, I went ahead and bought and I've been happy with its performance.  While it may not be as powerful as a Ipad, its cheaper and so far runs smooth, feels well built and has a good battery.", "Title": "My First Tablet", "Date": "March 6, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2IMPWSW9WOUO9", "Overall": "4.0", "Content": "Great value for money Tablet.Excellent and very responsive screen.I bought this for my daughter,who is happy with this tablet.There is almost no lagtime and display resolution is excellent.However the download speed can be slow on wifi.I am unable to find a appropriate cover and case for this in India.Please someone,help me.", "Title": "Asus Memopad HD7 16 inch", "Date": "February 20, 2014"}, {"Author": "Niklaus Schroeder", "ReviewID": "RW0BUZAYNIBGF", "Overall": "5.0", "Content": "As a poor college student, I wanted to buy myself a tablet, but it needed to be affordable. There in lies the problem. I search high and low, but was never satisfied with either the price, or the hardware in the device. Finally my dreams came true. I found the MeMOPad. It has awesome battery life (like 4+ hours on Netflix with max screen brightness), a decent processor, awesome native apps, and an SD card slot that supports up to 32 gigs of extra storage. Unlike some other android devices, without rooting, and with the proper app, you can store many apps on the external storage card.The screen is crystal clear, and the tablet has an app to adjust the color settings on the device to make the screen more comfortable to read off of. I have used the camera, and even though it has a smaller megapixel resolution than others, both cameras worked extremely well with very good HD quality video.For the price this tablet is unmatched. I love mine and use it every day.", "Title": "PERFECT for the price", "Date": "February 19, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RLLLK9B54X6DG", "Overall": "5.0", "Content": "I researched various tablets, as I wanted to change from the Kindle (I found it too restrictive and it did not allow us to take advantage of the various B&N; gift cards). I had purchased the Samsung Galaxy 3 for my mom and though it was nice, it did not have the quad processor. The Google Nexus 7 had the quad processor but did not have the dual cameras. I found this and it has a everything and was cheaper then both of the others. It has worked great since Christmas (and my son puts it through constant use). So far it has been an excellent deal.", "Title": "Great Tablet", "Date": "February 19, 2014"}, {"Author": "Suinbeda", "ReviewID": "R3BU1CFZ6Z3LMU", "Overall": "5.0", "Content": "This tablet is fast. Video is awesome, the sound could be better. The size I think is perfect. Battery life seems to be great so far.", "Title": "i Love this tab", "Date": "February 19, 2014"}, {"Author": "kirt antoine", "ReviewID": "R3EMWVUZAEB3IO", "Overall": "5.0", "Content": "considering the price this tablet is really great. the front facing camera is really grainy but otherwise its a great lil tablet", "Title": "great bang for your buck", "Date": "February 18, 2014"}, {"Author": "Simone M \"Simone M\"", "ReviewID": "R2PAMZP68MO9OK", "Overall": "5.0", "Content": "This thing works wonders, I've done all my homework assignments with this tablet, and the HD screen just makes it more better, it takes amazing pictures, play with it a little and see what different tricks it has, and the price isn't bad at all, highly suggested", "Title": "awesome awesome awesome", "Date": "February 18, 2014"}, {"Author": "Doug", "ReviewID": "R1YRWWZ5FY3E61", "Overall": "4.0", "Content": "It is a good product for the price. The speed is excellent compared to a dual core. The image resolution is excellent. The 5mp camera takes excellent photos and video with good color and decent for image stabilization.What I don't like. My eyes tend to hurt after using for long periods of time. Sound volume drops when you plug in external speakers instead of headphones. Trouble finding a cover that would work for the 5mp camera. Most are minor inconveniences.I would definitely recommend it to someone else.", "Title": "Great Product for the price", "Date": "February 18, 2014"}, {"Author": "Jay Henman", "ReviewID": "R37ACIL74C7TSO", "Overall": "5.0", "Content": "It Works great. Have had no problems at all and have had them for 2 months now and still going strong", "Title": "Great tablets for kids", "Date": "February 18, 2014"}, {"Author": "C. L. Cecil \"ouchie\"", "ReviewID": "R3KHD0YNVYWF95", "Overall": "4.0", "Content": "The tablet is great for the price point.  It could do with 2 gb of ram as some games and YouTube stutter a bit.  Quad core is pretty useless if it only has 1 gb of ram--it produces a bottleneck.I bought two and one of them immediately started having a battery problem.  It would charge fine but if you restarted or powered it on without it being plugged in, it would report as having 1% battery left and then shut off.  It was incorrect because the tablet was indeed charged 100%.  You had to make sure you turned it on while it was plugged in for it to report correctly.  I contacted Asus and they wanted me to send it in for warranty service and we would have to be without it for a couple weeks.  This wasn't going to cut it because we used that one for my autistic son and he wasn't going to tolerate it being gone (he wouldn't have understood why).  I wanted Asus to charge me for a new one, let me return that one, and then have them refund the money upon receipt of my return.  They were not willing to do this--a major lapse on their part I feel.  Even though it was after the initial 30 days, a VERY helpful Amazon rep sent me one OVERNIGHT and let me return the malfunctioning one.  Yay Amazon!Now the replacement is having similar battery reporting issues.  It had powered off for low battery last night, I plugged it in while off for a bit, then turned it on.  It reported that it was charging and was at 7%.  It remained as 7% for an hour!  I tried different cables and chargers, still would not increase.  I turned it off and let it charge for a bit while off.  When I turned it on it reported having 40%.  It was charging the whole time, but the meter was not changing.  I have a different battery app on it and both were reporting incorrectly, therefore I must assume it must be something about the hardware around the battery.I really hope this doesn't get to be like the one I returned.  My son relies on this tablet and I hate worrying if it's going to reliably charge or not.  I have to check on it like it's a baby.  Very silly.Otherwise, the screen is good...good responsiveness.  I would recommend to others with slight reservations.  I wish the battery was user replaceable/swappable.", "Title": "Great little tablet...problems with battery percentage meter", "Date": "February 18, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1MKFCCKEI4XOE", "Overall": "5.0", "Content": "I use this mostly for entertainment. It's a great, portable size. I pull out my laptop when I get frustrated at the lack of keyboard. It does allow me to quickly check on shipment statuses on the go and check email. These are the only two functions that help me from a business stand point at this time.", "Title": "Just the right size for me", "Date": "February 18, 2014"}, {"Author": "singermom", "ReviewID": "R37YUCMZZ6TLS3", "Overall": "5.0", "Content": "Got this for my husband to use for podcasts, audio books and of course surfing the web.  Fast processing, lightweight and clear, bright display.", "Title": "My husband loves it!", "Date": "February 10, 2014"}, {"Author": "JeepNut", "ReviewID": "RX9BNFEXOCA3P", "Overall": "5.0", "Content": "Bought this for a family member but it was a gift from a different family member who's married to my best friend, and her GRANDDAUGHTER hasn't said there's been any problems with it.  So it must be good.", "Title": "Not sure I can help much, but a Subject line is required...", "Date": "February 10, 2014"}, {"Author": "lennie hulo", "ReviewID": "R3AP4KZ1YQHK71", "Overall": "4.0", "Content": "This tablet has met all my expectations and then some. I was pleased to find the quality of the Asus tablet was great. I researched many tablets before I decided on this one and I am very happy with my choice. I have had the Asus  tablet since Christmas and have not had any issues what so ever. I would  have given it five stars but I have only had it such a short time.", "Title": "Asus tablet a very well built affordable tablet that has all the bells and whistles.", "Date": "February 10, 2014"}, {"Author": "Alex Ortiz", "ReviewID": "R392FT8HOT0ENW", "Overall": "5.0", "Content": "Bought this for my little sister! They loved it, it handles the myriads of apps they download and never lags!", "Title": "Great !", "Date": "February 10, 2014"}, {"Author": "Jonathan Johnson", "ReviewID": "R19QUPLR2QINHZ", "Overall": "4.0", "Content": "Great tablet just make sure you get a case. Keep in mind the screen is not gorilla glass which means if you aren't careful this screen will cracked easily other than that phenomenal tablet. Fast and very responsive", "Title": "Great tablet just needs better screen", "Date": "February 9, 2014"}, {"Author": "Melinda McCarthy", "ReviewID": "RCBAKM5UAVJ6X", "Overall": "5.0", "Content": "This is my first tablet and I really like it. It does everything I want it to do. I love the convenience vs my old laptop. I am still getting used to the on screen keyboard and some email/internet work is easier to do on my laptop", "Title": "great for a newbie like me.", "Date": "February 8, 2014"}, {"Author": "E Miller", "ReviewID": "R3V0T07RYUMTHJ", "Overall": "2.0", "Content": "I had this Asus for about a month. It was quite heavy, and felt clunky and didn't respond to touch as well as I expected. I teamed it with a Bluetooth keyboard, and they never seemed to sync well. I was down with the flu for a week, and tried to stream video, and do all the internet stuff I would normally do at the pc., but I just got tired, frustrated. The price was good, but not the quality I wanted. I replaced it with a Kindle Fire HDX, and have been extremely happy ever since.", "Title": "Too Heavy & Not As Nimble as Kindle", "Date": "February 6, 2014"}, {"Author": "abrar", "ReviewID": "R1MXSR1UUJ2A7D", "Overall": "4.0", "Content": "The asus memopad is a grwat tablet. It has a fast processor which can handle most games but some are very laggy. The battery can last up to 8 hours. However when you olay graphically intense games it loses battery life rapidly about 1%evety two minutes games like fifa 14. However if you play small games like flappybird and just surf the web and stuff you will have about 5 hours of battery life. Daily optimizes are requiredif you want the battery to last longer. In conclusion great device ciuld be better", "Title": "Good bur could be better", "Date": "February 5, 2014"}, {"Author": "Sebastian Vallejo \"malchuchaki\"", "ReviewID": "R1DGMMO2NEJB6B", "Overall": "4.0", "Content": "I was thinkin a lot about buying a tablet and i was searching to much, i saw a lot of reviews in youtube, and i found this tablet, the price is really nice, because the tablet is fast, nice screen, the software is good, wifi works very good, front camera is good, but i dont like the rear camera too much, because my wife have a samsung galaxy tab, and the camera is better and it is less resolution, the plastic is ok for the price.If you dont have to much money or you dont want to spend to much money in a tablet and you want good stuff i recommend it!", "Title": "I like this tablet, its very good for the price", "Date": "February 5, 2014"}, {"Author": "Shyam Kumar", "ReviewID": "R1L267II50OYJ4", "Overall": "3.0", "Content": "I bought this in Oct 2013 and till a few weeks back, it was working great and I was very happy with the tablet. Then a few weeks back, it just wouldn't power up. I left it charging overnight still it wouldn't come up. I left it for dead and was going to call ASUS. Just before calling I tried one more time to power up where it came up showing the battery needs charging. After charging it came up and worked fine!!!Exact same thing happened again last week. It wouldn't power up - charged it for a couple of hours which didn't help - left it for 2 days - tried again to power up where it showed that it needs charging - charged it and it came back to life.I think there is a problem with either battery or charger. Since I have a work around, I am going to keep it. I don't want to send it to factory with all my email unprotected.  Gave 3 starts because I like the tablet , in spite of the battery issue. In future, however, I will be careful buying ASUS products.", "Title": "good tablet, keep dying every now and then", "Date": "December 26, 2013"}, {"Author": "WandsMagic", "ReviewID": "R3LXULVY3BM2EZ", "Overall": "5.0", "Content": "I was looking for a 7 inch tablet to replace a Z-Pad that I had purchased earlier this year. This tablet is extremely fast. The battery seems to last forever. The screen is sharp and bright. The WiFi is very reliable and fast. Asus seems to really standby their products.  I had a problem viewing Netflix and after loading a couple of system updates, it works perfectly. I really love this tablet. The sale price has increased on Amazon, probably because it was such a bargain at $129 when I purchased it.", "Title": "Great tablet by Asus.", "Date": "December 9, 2013"}, {"Author": "Amazon Customer \"theskeemer\"", "ReviewID": "R3B2BCPHTXZBJF", "Overall": "5.0", "Content": "I got this for my kid and it is great. Very easily rooted with the Framaroot one-click apk rooting tool. The stock rom is very nice and if you delete it you can easily remove the bloatware with titanium backup.", "Title": "Amazing tablet for the price!", "Date": "September 30, 2013"}, {"Author": "jmachado", "ReviewID": "R1JR3GSE2M270K", "Overall": "5.0", "Content": "This table asus memopad is gift for my wife. Is fast. The screen is hd. Fast acces at internet. I recomended.", "Title": "High perfomance", "Date": "January 12, 2014"}, {"Author": "Xskinner", "ReviewID": "R3DTD3SK9S2PSB", "Overall": "5.0", "Content": "This is a great product by a reliable company like Asus. I recommend this for those who are on a budget and like quality  for their money.", "Title": "Terrell Xskinner", "Date": "September 5, 2013"}, {"Author": "Jeremy", "ReviewID": "R1XUQ5QMVB8IUH", "Overall": "1.0", "Content": "This tablet is getting the same fate as the Asus laptop I bought: Going back for a refund! This is the last time I buy Asus! The specs look great for this tablet but in the end its not worth it. It has everything I wanted: GPS, bluetooth, IPS screen, plenty of storage, quad core cpu. I bought this tablet to replace a generic tablet that I use in my car that doesnt have GPS. Primary use has been connecting to 4g, streaming music via bluetooth to the stereo. For that function my generic tablet works GREAT, never have any problems with it, but I wanted GPS so I bought the Memopad.Problems started when trying to connect this to my Virgin wifi 4g hotspot. After less than a minute the connection would freeze. It would say it was connected but it wouldnt transfer data and give network errors. My other devices (phone and Acer laptop) have no problem maintaining the connection to the hotspot. After hours of trial and error the only way to make this work was to disable wifi security on my hotspot. I did this and then the tablet would stay connected. What a terrible work-around, but I could live with this.Next was syncing the bluetooth to my car stereo, which wasn't a problem. But once the bluetooth is connected the tablet displays \"bluetooth has stopped\" errors every few minutes. This is really annoying when trying to use google maps for nav. Nothing I could do would make this error stop, except disabling bluetooth altogether.After a full charge, which surprisingly only took 1 hour, the tablet lasted for about 2. Far cry from the 10 its advertising. For my purpose wouldnt be a problem because I would keep it connected to the charger at all times anyways but buyer discretion anyways. For full disclosure the screen was on most of the time of this 2 hours which probably drained if fast but it advertises up to 10 hours! 2 hours is just long enough for one movie - which you would be using the screen the entire time for anyways.Now I cant even get it to turn back on! The screen is black and plugging it in to charge doesnt bring up the battery charge indicator anymore. Since this is a very common charge plug (samsung style) I have many chargers laying around but none of them work so that's ruled out. I have let the tablet sit for most of the day hoping it would recover but no luck. Dead as a nail leaving me no choice but to return it. Sad because Ive only had this thing for two days. Actually I should be happy that it died now instead of in a few months outside of the warranty.This is my 2nd bad experience with an Asus product. My other purchase was their high-end touchscreen 1080p laptop. Nothing but problems with every aspect of that laptop and had to return it. This is the last straw for them. The price of their products is tempting but obviously they skipped the quality control to make their stuff more affordable! I cannot recommend anything they make to anyone!", "Title": "Endless nightmare of a tablet!!", "Date": "September 21, 2013"}, {"Author": "Walter Sanchez Chaves", "ReviewID": "R1Q8CUSW24WRGC", "Overall": "1.0", "Content": "I bought this item as a Christmas gift for my daughter and it worked well the first day, but after two months had problems and now I'm processing a claim to see if I change the product as my daughter is very sad.", "Title": "?????", "Date": "April 7, 2014"}, {"Author": "J. Watkins", "ReviewID": "R3V8WDW0KIXASS", "Overall": "1.0", "Content": "The ASUS Memopad HD7 seemed like it was a great little tablet, and I wanted one with a microSD slot.But one night it needed a charge, so I charged it, and in the morning, the tablet was dead. Worked just over a month.I love ASUS monitors, I will stick with those from now on..Plus, the android marketplace is so fragmented, many many apps were incompatible with this device.Apple products are overpriced and don't last, so it's back to Windows for me.. Adios Android. I gave you a chance!", "Title": "Power issues with this tablet.", "Date": "February 3, 2014"}, {"Author": "Tazz T", "ReviewID": "R3LJJUMLHIJN0Q", "Overall": "1.0", "Content": "I purchased this tablet in December 2013. When I got the tablet it turned on and worked great. Next day the tablet would not even turn on. I sent it back to exchange thinking that is was defective. Well I got the replacement in the mail on January 15, 2013. And this tablet turned on just one time. And it has not turned on again. Asus I thought made great tablets. but after reading other reviews of other customers. This is Tablet should be pulled off the market. Horrible tablet. DO NOT BUY!.", "Title": "This tablet is horriable", "Date": "January 18, 2014"}, {"Author": "Wowly", "ReviewID": "R20MAYX7UACIJH", "Overall": "1.0", "Content": "I bought this from Amazon on September 7 so I have used for almost 3 months. Everything was great and I really loved this tablet, then it started losing the wireless connection constantly.  My computer was working so I guess the tablet is not working anymore. I guess from what others have said in reviews about this problem  not much I can do but trash it. Oh well I will not buy another product that has the Asus name on it.  I am on fixed income and cannot afford to replace the tablet so I guess I learned a lesson!", "Title": "I think it is JUNK!", "Date": "December 3, 2013"}, {"Author": "Pankaj Sharma \"Living e-life\"", "ReviewID": "R2IEB8VR38X39X", "Overall": "2.0", "Content": "Update 1:Second unit stopped charging at the end of 4th week! Luckily Amazon refunded my money on 31st day of return period. This is the first device I have owned that gave up on charging so quickly.================================================================================================================Memo pad is great value. I really like the screen and weight of this tablet. I use it mainly for reading offline during the train commute but also use it for light browsing at home.The first unit stopped charging within 3 weeks. Amazon promptly replaced it. The second one survived the charging test but showing issues related to Wi-Fi. Someone had noted that the tablet has weak Wi-Fi radio. Well it's the same for me. I am sitting at a point in my house where all my devices are showing maximum Wi-Fi signal strength. Wheeras the memo pad is at the least level.I have an iPad and couple of smartphones in my house that move around the house but never show weak(lowest) Wi-Fi signal.The problem does not end there. The tablet drops connection every now and then. I don't know if it is because I move around in the house (as far as I know there are no dead zones in my house) or its the tendency of the hardware. It's quite frustrating at this point. It could be a defective piece also but my confidence levels have gone very low. I can't deal with WiFi issues for a device that is mainly WiFi.Asus has done well with the software. The android version is not bloated and gives enjoyable experience. Battery is good but can't be compared to the beast like iPad. Surprisingly the camera is good for a tablet.", "Title": "Good value but weak wifi issue for me.", "Date": "November 5, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1353PUUI28P1I", "Overall": "3.0", "Content": "Overall I really like this little tablet but I've had to return 2 for the same defect, SD card will unmount and mount when applying pressure to certain areas.This tablet has a nice screen resolution, standalone GPS, bluetooth, and its quick to respond. I'm would like to think that I was just unlucky and this isn't a trend from Asus.", "Title": "2 Defective units", "Date": "September 16, 2013"}, {"Author": "Gary Belton", "ReviewID": "RU5T58UM8Z762", "Overall": "3.0", "Content": "Well I must say for a budget tablet this little device surprised me!  It is fast enough to handle all of my casual gaming needs and works great as a kindle alternative. The reason for my three stars begins here.  I finally got to put my rooCASE on it today and then my wife noticed a problem.  She saw an artifact right in the middle of the screen!  At first she thought she had scratched the screen protector but upon further investigation (and removing the screen protector) I found out that this \"artifact\" indeed is a defect in the screen and not the protector or glass.  I am regrettably shipping it back tomorrow for a full refund and will be looking for another tablet to suit my needs.  If you are considering this table I wish you better luck than we had!", "Title": "Was enjoying it....", "Date": "September 11, 2013"}, {"Author": "jeremy stratton", "ReviewID": "R2OE197TBKPYBG", "Overall": "1.0", "Content": "Loved this tab till today, went to use it and it was dead. Wouldn't charge or turn on, only a week old!  Girl friends is 2 weeks old and working fine, hopefully I got a lemon and the replacement will be good... Will update.. As usual though amazon customer service was first rate and a new one is on the way.", "Title": "Good while it lasted...", "Date": "October 15, 2013"}, {"Author": "Larry Johnston", "ReviewID": "RVQ6BMICMUCUY", "Overall": "2.0", "Content": "After reading all the negative comments I bought it anyway. Worked great for a bout a month. Sure enough the memory card is no longer recognized by the tablet. Can't get it to find the card. Stuck with the 16 MG. This was a low cost tablet to see if I wanted to upgrade at a later date. Other than the external memory issue it works. I will upgrade no doubt. Not with this manufacturer.", "Title": "No external memory! Card not seated.", "Date": "January 6, 2014"}], "ProductInfo": {"Price": "$252.58", "ProductID": "B00E0FDYU4", "Features": "7-Inch Display\nQuad Core 1.2 GHz\n16 GB Flash Memory, 1 GB RAM Memory\n10-hour battery life, .67 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41ECV6oZfkL._SY300_.jpg", "Name": "ASUS Memo Pad HD 7-Inch 16 GB Tablet, Pink (ME173X-A1-PK)"}}