{"Reviews": [{"Author": "Liza Ann Gregory-Hammett", "ReviewID": "RO6R4W63VPDKR", "Overall": "3.0", "Content": "The tablet is great. I bought it for my ten year old son and he loves it. But when we got the keyboard out, the case had come completely unglued. Some hot glue fixes the problem but it would have been nice to not have to go through the trouble.", "Title": "Tablet Good Keyboard Not", "Date": "August 21, 2013"}, {"Author": "arturo cabrera", "ReviewID": "RIPB5QKQW8YY", "Overall": "1.0", "Content": "i used it once and after i charged it, it would leave the loading screen. had to return it. Didn't like it.", "Title": "bad", "Date": "September 24, 2013"}, {"Author": "April", "ReviewID": "REKUG6A0ARFCQ", "Overall": "5.0", "Content": "Love this tablet after ordering 11 and gotta say my family has not had any problems at all They love them I have since told family member about them and they are and have also ordered them .. Great product and even better customer service Love the company and intend on doing more business with them in the future", "Title": "Love this tablet", "Date": "March 28, 2014"}, {"Author": "Regina Holub", "ReviewID": "R1WG0WN1VB4VDL", "Overall": "3.0", "Content": "I just purchased this tablet, as a gift for my mom to have something to do setting in her recliner sometimes. I just charged it and gave it to her on the 8/13/2013 and in less than an hour it was needing to be charged again, and that was before we even had it set up properly.Other than the battery problems, I think she may enjoy it.", "Title": "Battery seems to be the worst problem", "Date": "August 14, 2013"}, {"Author": "Ronda", "ReviewID": "R121P5DDIZLHUG", "Overall": "1.0", "Content": "It worked great for about 2 weeks, then the screen went black and wouldn't turn on.  I am in the process of returning it for a refund.", "Title": "Poor quality", "Date": "January 14, 2014"}, {"Author": "jthmnina", "ReviewID": "RXXU7HZWRIP1A", "Overall": "1.0", "Content": "broke right away  . i am not too happy with this item... it stopped working right away. I don't know if i can ship it to get fixed. all i have is a black screen", "Title": "no way", "Date": "June 2, 2014"}, {"Author": "sedalia lozano", "ReviewID": "R22AFNHEMS8UW1", "Overall": "5.0", "Content": "Arrived today....so far my grandson has been absolutely happy with his product....it is lightweight but sturdy...with the nifty case and the keyboard....has performed very well on this first day of receipt....", "Title": "tablet", "Date": "May 7, 2014"}, {"Author": "Laura B.", "ReviewID": "R1A7DG3WEQYDP", "Overall": "4.0", "Content": "I bought this for my oldest grandson.  The younger 2 wanted it also. I saved money this year by buying them all this Android!", "Title": "Your kids will love it!", "Date": "March 25, 2014"}, {"Author": "Rhonda R.", "ReviewID": "R3KEWZNRP4CIIY", "Overall": "4.0", "Content": "Although it's a little bit slow, I like it. I wanted something to read my kindle books on and it works great for that. I didn't want to spend a lot of money because I have a computer for everything else so I'm very satisfied with it.", "Title": "Just what I was looking for!!!", "Date": "March 20, 2014"}, {"Author": "Xioli Vásquez", "ReviewID": "R28QS1SDTIRESM", "Overall": "1.0", "Content": "I bought it for a gift, when the i handed in two days did not want to turn on the tablet, and until now will not comprising because not light  and I do not have ways to contact the seller. Thank you please contact me as it is quite expensive.", "Title": "Problems with tablet", "Date": "March 18, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00E9O3M0I", "Features": null, "ImgURL": null, "Name": null}}