{"Reviews": [{"Title": "Great personal tablet", "Author": "George", "ReviewID": "RPEWJ8CYW4VT8", "Overall": "4.0", "Content": "Overall I am very happy with the product. I can't say I would replace it for a laptop if I needed a computer for business, but I think for personal use it is great. Sooo much better than a heavy laptop or tied to your desk. I did have issues with waking it from sleep mode but Samsung Tech Help got me through it.", "Date": "February 27, 2014"}, {"Title": "Somewhat harder to figure out", "Author": "Ex-Amazon Customer", "ReviewID": "R1V2AMWUGQLKRW", "Overall": "4.0", "Content": "There is so many features on this tablet you do spend the first week or so just keeping up with all the updates and everyday you learn something new about how to use this PC. We only use it with the keyboard so we don't have that problem with the noise but did need to discover the button that makes it easier to select the keyboard (the right control key) it's maybe a little too much but we'll figure it all out one day. Went from an iPad so, but we have Samsung TV, Blueray and Galaxy phone. This is much different.", "Date": "January 12, 2014"}, {"Title": "Nice table PC but requires patience to learn.", "Author": "K. Afsar", "ReviewID": "R25R2UNC4GHIVM", "Overall": "4.0", "Content": "Give yourself a few days of playing around with Windows 8. Basically Windows 8 offers both a Windows XP/7 like interface, as well as applications or apps (like android or iPad) that can be downloaded from the MS app store. Took forever to download the Win 8.1 update. Make sure you run all the updates for Win 8, or the Win 8.1 update will not show up in the app store. After all the updates, it's a fine machine to play with. Like the ability to hold it in my hand, write with the stylus using my handwriting which can also be used to serf the net. USB, Micro SD and HDMI connections. What else can you ask for!", "Date": "January 4, 2014"}, {"Title": "COMMON Touchscreen Failure For ALL Samsung ATIV Tablet PC Models (500t and 700t)", "Author": "MrGuy", "ReviewID": "RXKVNFQ4QV6CU", "Overall": "1.0", "Content": "I bought the 700t from eBAY and it worked fantastically for almost three months until the touchscreen stopped working... s-pen still works, but who cares. (FYI: Samsung DOES NOT honor transferred warranties, so I'm on my own)I was using it for about an hour as a tablet one morning, and when I was finished I put it on the keyboard dock, and put it to sleep. I turned the unit back on about an hour later and the touchscreen did not work; no indication that it was going to fail before-hand, just completely did not work.I have nearly 20 years of technical experience with computers, with certifications, and even I can't resolve this problem, which looking in forums all over the internet, is a VERY common problem for this and ALL Samsung ATIV tablet PC models (500t and 700t).Samsungs ONLY solution is to return and replace.My unit:- All Samsung updates are installed- All Windows updates are installed- Unit has been lovingly handledThings I've done to fix the touchscreen problem:- Wiped drive/factory recovery 3x- Repeatedly uninstalled/reinstalled Wacom and touch drivers (even tried older versions, and some 3rd party)- Windows restore 3x- Spent days looking on forums for answers- Cleared CMOS- Hacked BIOS update program and reflashed BIOS firmware- Disassembled unit, cleaned all cables/connections with isopropyl alcohol, reassembled- Replaced digitizer with exact OEM- Cried inside...Why Samsung???Short of replacing the main HannStar board, I've done everything in my power to fix the number one major feature of a tablet. I didn't give you $1400 for a TOUCHLESS TABLET!!!!It wouldn't be so infuriating if this thing wasn't perfect for me :(That being said... PLEASE save your money and buy a Surface 2.", "Date": "December 6, 2013"}, {"Title": "Great product!! Would recommend to anyone", "Author": "Andy Pless", "ReviewID": "R34V953JO3FM4P", "Overall": "5.0", "Content": "Everything as promised. I could not tell it was refurbished. Thank you! Will probably buy 2 more for use in our command vehicles.", "Date": "September 22, 2013"}, {"Title": "great product, low quality product tracking", "Author": "Chris Petersen", "ReviewID": "R1H414NI0814OX", "Overall": "5.0", "Content": "Bought the tablet for general use for my business. No issues with check out I received a tracking number immediately after the purchase was completed.  Only issue was the tracking thru FedEx and the amazon tracking  link was poor. I had to go thru 3 different avenues to get an accurate up to date location of the tablets where abouts. Even then it took days for each site to update.", "Date": "October 22, 2013"}, {"Title": "So good!", "Author": "YOUNG-BEOL YOON", "ReviewID": "RJ9LEPP088CPX", "Overall": "5.0", "Content": "Satisfied with it!Good quality and Design!High Density Display(High Resolution)In particular, I love the color, White.This will meet everyone's expectation.", "Date": "June 12, 2014"}, {"Title": "Lots of great features", "Author": "Paul", "ReviewID": "R2ZPNSI2UHTEK5", "Overall": "2.0", "Content": "Great tablet when it wanted to work... Too many system failures with an inability to re boot without being plugged in and then it was only maybe. Bought a Microsoft Surface instead... Samsung is on the right track... but they need to do something about the operating systems failure.", "Date": "June 6, 2014"}, {"Title": "Dead on arrival.", "Author": "DangerousShadow", "ReviewID": "R366LYK1MF5QYV", "Overall": "1.0", "Content": "Cons:unable to useBad return policy (not Amazon)14 to return a dead devicea Restocking Fee! so someone else can get a used oneso, they send you one that last 14 day then you have to pay them more money and your timePros:SamsungAmazonhas a nice weight to it (if dead it can hold down the paper you are now using)\"You may return any new electronic items purchased from Sunshine Tradethat is still in unopened boxes, for a full refund within 14 days of purchase. Buyer is responsible for return shipping fee. A customer feeequal to 18% of the product sales price is applied to all open boxreturn. In case of Dead On Arrival, we will ship a replacement forfree once the return package is received and checked. Provided you have contacted the product manufacturer and been issued a defectiveconfirmation code.  Any returned item that is damaged through customermisuse, is missing parts, or is in unsellable condition due tocustomer tampering will result in the customer being charged a higher restocking fee based on the condition of the product. Sunshine Tradewill not accept returns of any items more than 14 days after youreceive the shipment.\"", "Date": "June 4, 2014"}, {"Title": "Ativ tab is okay", "Author": "Bongani  Zimuto", "ReviewID": "R3DI8EPAKM0Q3C", "Overall": "4.0", "Content": "The product is perfect, but however the your sim slot doesnt work it cant fit. I thought its 3G embebed but yet i cant seem to make a sim fit in.", "Date": "December 20, 2013"}, {"Title": "Glad to have it.", "Author": "dlr", "ReviewID": "R18V06NMJGPFLA", "Overall": "5.0", "Content": "Finally bought a new one after my husband took over the one I had before.  It was old but still worked good.  This one I can keep by me on the couch for easy access.  Light weight.  Good deal.", "Date": "November 20, 2013"}, {"Title": "Amazing tablet for the prize", "Author": "Dylan", "ReviewID": "R346HIAKAQ0P3B", "Overall": "5.0", "Content": "If you're interested n something portable and nicelooking, go with this one. It plays old games well, it is fast, responsive and has a pen for not taking . Make sure to download windows 8.1!Cons: magnetic sleep/wake doesn't work....as advertised a least. Don't buy one of them cases.Windows has a lot of bugs.Tip: this is a good tab, don't get me wrong, but....don't buy this for more than ¡Ö420 USD. Its not worth it. It has an atom processor after all...and battery life is not super great.", "Date": "August 29, 2013"}, {"Title": "Like the tablet hate the windows tiles", "Author": "Amazon Customer", "ReviewID": "R28EK1ESQOGDMN", "Overall": "3.0", "Content": "Ok ok I've been using regular old windows user for years and this is my first tile experience. All I can say about is BLEAH. Get yourself something with Windows 7 if you don't want to spend half your time swiping away. Otherwise a very nice little table with beautiful color. But those tiles...", "Date": "October 23, 2013"}, {"Title": "DOA", "Author": "whitney french", "ReviewID": "RHMUJ3S747Q90", "Overall": "1.0", "Content": "didn't work on arrival had to send it back. Still waiting. Might change my mind if it works well when I get it back.", "Date": "September 24, 2013"}, {"Title": "bad customer service", "Author": "Serdal", "ReviewID": "RP59Q5BB34M25", "Overall": "1.0", "Content": "please be advised thatI returned my purchase on September 10,2013 but I did not receive any money back and get any response from you guys I have been waiting for over 2 months just let me know when you guys will be returned my money. I am really worry about it and want to know when will I money back.The tracking number is 1Z2630AF9009195060.When I checked my tracking details it is shown that it was delivered which means you guys got backplease let me know as quickly as possible otherwise I will try to get my money from the different ways.Thanks...", "Date": "November 7, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00E9FNS6A"}}