{"Reviews": [{"Title": "Absolute Garbage...", "Author": "Andrew", "ReviewID": "R23MT6GJCV5CAL", "Overall": "1.0", "Content": "I bought this tablet for a first time buy. It was on sale elsewhere for $60 so I said what the heck, why not..... This tablet is incredibly slow and unresponsive. The AC cable it comes with did not charge it but rather drained it completely when plugged in. I used the USB adapter and plugged it into my computer where it would charge occationally. I had numerous problems trying to get any sort of charge. I tried it at 4 different locations and there never seemed to be a solution. when I first got it, it worked out of the box ok.... and I mean OK. the touch keyboard is very slow to respond, and it always froze. The 512 RAM is garbage because it runs everything half paced. The resoultion is crap too because when first looking at it, you have to tilt it to where your eyes can see it clearly. This wasnt just the one I got, but on a lot of customers reviews. When it died completely it would never hold a charge, and I thought for a long time that it was deffective. after about 6 days it finally started back up but its completely unreliable. NOT WORTH your time or effort. It will only piss you off with every use. Kocaso is of course an off brand company, and its not really suitable for anyone. sorry guys, but you have failed.", "Date": "December 18, 2013"}, {"Title": "Bad Choice", "Author": "Judy", "ReviewID": "RUS14OTGMKMHR", "Overall": "2.0", "Content": "Don't get lured by the low price. The tablet is slow, battery life is poor, and the display is only OK. If you buy it, be sure you can return it when you find out what it is really like. The onboard memory will let you install only a few apps before it is full. It does have a slot for a micro SD chip, which you can purchase separately to overcome the storage space issue.It did operate correctly and for a starting out low cost tablet for a low intensity user, it is probably OK. Just know what you are getting.", "Date": "February 15, 2014"}, {"Title": "great tablet for the price!", "Author": "beth constant", "ReviewID": "R1ZR2RDVEFLWSJ", "Overall": "4.0", "Content": "I bought this tablet for my husbannd and he just loves it..uses it for down loading music to movies and everything in between...I would recommend this tablet for everyone..i ended up buying 4 :)", "Date": "January 21, 2014"}, {"Title": "Uh.....", "Author": "Jackie Chen", "ReviewID": "R1AB222MIF2OL7", "Overall": "2.0", "Content": "So, I was sent an used tablet when I paid for a new one? Why do I think that?Because after I received it in my mail, I opened the Amazon Packaging box and noticed that the plastic wrap around the Tablet box was missing, slight damage to the box itself, tablet didn't have the plastic sheet on screen and the person was still log on to their Gmail. So yeah, I feel a bit sad, do I get a partial refund for it being used?Either way, the tablet seems to be functioning fine, making me wonder why the person before returned it; is there something wrong with it that I just haven't noticed yet? I'll keep updating this as time pass.", "Date": "February 1, 2014"}, {"Title": "Great", "Author": "Keri Walsh", "ReviewID": "R2BZI59VXOJQ1O", "Overall": "5.0", "Content": "Thank you I got my tablet in 2 days and i love it... Thank you for everything. The tablet is wonderful perfect size and the keyboard is great.", "Date": "February 1, 2014"}, {"Title": "Time and money waster", "Author": "John", "ReviewID": "R31FASFW49ZL44", "Overall": "1.0", "Content": "Worked out of the box for four hours. When I plugged it  the charger, screen completely froze. I contacted Kocaso support, and was advised to download firmware to memory chip and reboot. This was an incredibly complicated process, made worse because of badly translated instructions from Kocaso website, and in the end, the reboot failed. Returned product with pledge to myself to avoid Kocaso products.", "Date": "January 16, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EHDN4U4"}}