{"Reviews": [{"Title": "Excellent tablet give it 5 stars", "Author": "JUSTO ESTABA", "ReviewID": "R3G7U2D6GZVDPD", "Overall": "5.0", "Content": "Arrived at time...fast response...sensitive touchscreen...great screen resolution...playstore preinstalled with lots of apps..solid and well built...at first I thought it would be another cheap chinese slow tab but I am really impressed... so far working great...a real low price for so much... congratulations afunta guys... give it 5", "Date": "May 28, 2014"}, {"Title": "great", "Author": "Stelios Georgiou", "ReviewID": "R3F9K26C0BCAMN", "Overall": "5.0", "Content": "got it in time no problems so far tried other brands and was not happy untill i found this one", "Date": "May 28, 2014"}, {"Title": "nice", "Author": "Brian T.", "ReviewID": "R1X9TMFKT4H6O7", "Overall": "3.0", "Content": "it's ok. had a good picture to it. i like it. it was my first tablet. still would like to have a better one.", "Date": "June 9, 2014"}, {"Title": "I love this tablet!", "Author": "MCMICHAEL C.", "ReviewID": "R18IDZG6CNQLOS", "Overall": "5.0", "Content": "So I was interested in getting a tablet for a little money but also wanted it to do a lot so I kind of thought I was reaching for the stars. I looked on amazon and saw one from Pyle astro (PTBL92BC) which was a 9 inch tablet for 69.99 I was excited then it arrived it had really low resolution and the worst response to touches and I thought man this tablet is not for me none of the apps I wanted didnt work (the wwe app) I couldn't blame myself because I didn't do any research it was just a bad impulse buy. So I looked on amazon again trying to redeem myself I was still looking to spend a little money and wanting it to do a lot then I ran across the Afunta 10 inch tablet it had everything I wanted Bluetooth 1 gig of ram and an HDMI port and a good resolution so I bought it. I arrived on Sunday I turned it on and was surprised it had a 100% battery life I really liked it and most importantly the wwe app worked So overall this tablet is a really good inexpensive device I'm very happy with my purchase and Ill definitely recommend it to a friend", "Date": "June 8, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00E9TNEXI"}}