{"Reviews": [{"Title": "better than i thought", "Author": "smakolski adam", "ReviewID": "R2MQQY558SBAZ9", "Overall": "5.0", "Content": "rather unexpected little thing better than overpriced overhyped ipadworth the money now my daughter wants one and does not use ipad anymore after trying it", "Date": "January 27, 2014"}, {"Title": "It's ok I guess.", "Author": "William B. Stringham", "ReviewID": "R2AIA1MY8AN89N", "Overall": "3.0", "Content": "For a tablet to have 4gb's, quad core 1.5 ghz I would have expected it to perform faster with no hang-ups. Tablet is pretty heavy and feels like it is built physically well. Internal WIFI antenna is very week. In order to get a signal you must be withing 20 feet of the router. I cannot pick up the signal from my wireless router that is in the living room when I am in my bedroom room which is no further then 40 feet. My laptop can pick it up with full bars. Overall..........I would have purchased something else if I knew how this one performed.", "Date": "January 1, 2014"}, {"Title": "GOOD TABLET", "Author": "john", "ReviewID": "RUZ1J69YDYF5", "Overall": "4.0", "Content": "Nice little tablet. built sturdy and preloaded with enough apps to get started with. Nice color and clarity on the screen and ample amount of storage also came with a card for extra storage. would recommend to a friend.", "Date": "January 2, 2014"}, {"Title": "This tablet works well.", "Author": "Yi Ji Hoon", "ReviewID": "R1KQD2ZPM6AF72", "Overall": "5.0", "Content": "This tablet is really good with comparing price. I used this as e-Book reader and Television watching purpose (IPTV). But not recommended for big size game with default configuration (4GB capacity, some game is jittery to be installed into external SD card, so you have no choice but to install into the internal). And I thank the supplier for providing unexpected 16GB micro SD card!", "Date": "April 14, 2014"}, {"Title": "Good Little Tablet", "Author": "K. Anderson", "ReviewID": "R29X53VLIB60TH", "Overall": "4.0", "Content": "This is a great tablet for games, email, etc.  The battery life is a bit short though.  Longer lasting battery between charges would be great.", "Date": "April 3, 2014"}, {"Title": "Meh", "Author": "Amber Higley", "ReviewID": "R1WY3NRDZHE2BI", "Overall": "2.0", "Content": "First of all, before I begin my review, I'll explain how to get the most out of this tablet since none of the reviews really didn't say much..This tablet only has 2 gigs of internal memory. It comes with an 8 gig micro SD card. In order for you to get the most out of this tablet, you have to get your tablet to transfer your apps to your external SD card. In order to do that, there's a program you have to download from google. In order to get that program to run, you have to debug the tablet so your computer can read it. Simply just switching the tablet to debugging mode didn't work. I had to manually install the drivers. I searched everywhere for the drivers, even went to the companies website, but the drivers didn't work. I gave up, until I switched computers. The computer I initially used was windows 8.1. I switched to my laptop which has windows 7 and windows automatically installed the drivers for the tablet, so that problem was fixed.Rooting this tablet was a breeze. It literally took me 2 minutes to root. If you want to root it, there's a thread on the companies website to show you what to do. Just google it and type how to root this device, simple and easy.Now with my review.I was looking on amazon for a while to buy a tablet. I didn't really need a tablet, I just wanted one to experiment with it and to try out games and didn't really want to spend over 100 dollars. I found this tablet, what really surprised me was that it was a quadcore tablet for less than 100 dollars, I was so excited. I read the reviews and immediately bought it.It came earlier than expected, I plugged it in and got to work customizing it. What I noticed was that this tablet takes A LOT of power to run and drains faster than anything I've ever had. In fact, the battery was actually draining when I had it plugged in. I immediately found out the problem. I was using my wall charger for my samsung galaxy s3 instead of the original one that came with the packaging. Even with the default wall charger, when I'm playing a high powered game, it barely charges at all. Probably gain about 1 percent every 15 minutes or it just stays the same.Other than the charging problem, the screen is smuggy and isn't clear as other tablets or phones. I put the display at 100% and it looks like 40 percent compared to my phone. Like others have said, even though this is a quadcore tablet, it runs like a first generation dual core phone.If you want to know how this tablet runs with games, it runs pretty good so far. It runs ps1 emulators perfectly, and even psp games work pretty good if you fixed the settings a little. Therefore it'll run most if not all games in the google market.In short, this is an ok tablet if you're just gonna use it for facebook, web browsing, netflix, etc. However, the point of a tablet is that it's supposed to be portable. If I take it out of the charger and play a game, it'll die in about an hour to an hour and a half.  Due to the abysmal battery life, I can't rate this tablet more than 2 stars. If they fixed this problem, I'd of given it 4 stars.", "Date": "March 31, 2014"}, {"Title": "Good buy for the price.", "Author": "Trevor Hays", "ReviewID": "R1YJHTH9INJMHA", "Overall": "5.0", "Content": "Accurate description. Everything was included brand new. Great tablet for anyone and I reccomend this to my friends. Number one customer service.", "Date": "March 31, 2014"}, {"Title": "THE WORST THING I'VE BOUGHT IN AMAZON", "Author": "Hector Leonardo Villalobos Duno", "ReviewID": "R1MN1H7YO98TC0", "Overall": "2.0", "Content": "There is something wrong with this tablet or with the AGPtek company. I can't understand how a tablet has a Quad-core processor and has such a poor performance. I advise you not to buy this tablet. I think is better to save a little more money and buy something better... Something like Dell or nexus 7 i guess.... PLEASE DO NOT WASTE YOUR MONEY IN THIS TABLE............", "Date": "March 28, 2014"}, {"Title": "NICE!!!", "Author": "Aaron", "ReviewID": "R3C1G0ZD2QWKPN", "Overall": "5.0", "Content": "This tablet runs apps Very well, not a single lag. I play Survival craft and the game actually said that my device is fast ;D. Not much I could say that is bad about this tablet.The only thing though some reason, you cant store apps by default in the external SD card for this device has an internal SD card that's only 1 GB (and a tablet storage of 2 GB).Unlike the brand name tablets that have that option,You'll have to manually program this device to install apps by Default to the external SD card (through the computer).  << Do the research on how to install apps manually on the external SD Card. It requires a program.", "Date": "March 13, 2014"}, {"Title": "Better than my last tablet", "Author": "Amazon Customer", "ReviewID": "R3TI84WI0XFRJ6", "Overall": "4.0", "Content": "I got this tablet as a replacement for my FastTouch tablet that died after 3 months. So far, this tablet is much faster & I really like it. The only thing I dont like is that I cant take screen shots with it & sometimes the preinstalled Picsel Smart app crashes.", "Date": "March 7, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EHB6BQ0"}}