{"Reviews": [{"Author": "Ion54", "ReviewID": "R3GDN9ZAIXZEUH", "Overall": "4.0", "Content": "The benchmarks are very good.Built quality is good (Acer comparable)The screen quality is excellent.Battery life is good (not as good as my other tablet - Asus MeMo pad HD 7\") at about 7 hours of use.WiFi is very good.Cameras are OK but the flash for the back camera is a joke.It comes with Android 4.2.2 and Flash installed. Google Play Store is installed too.There are some \"custom\" firmware available, based on the factory firmware, but you can root the tablet quite easy and delete what you don't want.For rooting I have used \"unlockroot\" free version. Run it as administrator on W7 or Vista machines. It will tell you the tablet is rooted but you should choose to root it again.What I do not like that much is the smoothness of the firmware. It is not at the level of big name tablets (Asus, Samsung, Sony) and far, far away of the quality feel of the iPad.It has hesitations and short hick-ups, but I had few of those on the Asus tablet too.", "Title": "Pipo M7 Pro no internal 3G", "Date": "October 18, 2013"}, {"Author": "Xavier Perez", "ReviewID": "R3QFEBXFR7T3YR", "Overall": "4.0", "Content": "The tablet works great, just wish there were volume buttons, the on screen buttons work fine but its annoying to not have those volume buttons on the side. The other is issue us that the screen resolution/screen brightness aren't that great. Wish the screen could be brighter so when I'm outdoors. Other than that the tablet is fast, responsive and does everything described. Great value, might not be as good at a 600 dollar tablet but it's a 250 dollar tablet that works like a 500 dollar tablet.", "Title": "250 dollar tablet that works better than some 500 dollar tablets", "Date": "December 30, 2013"}, {"Author": "John Aston", "ReviewID": "R38WQOJ8Z2IB3M", "Overall": "4.0", "Content": "I've own a Pipo M7 Pro and the larger Pipo M9 Pro for two months and both are quality devices.  If you have problems like the person from the above comment, simply do a Factory Restore and most of the time that resolves such issues, if not, there's a factory warranty.This new model series is on par with most other brands - worth the investment based on my extensive testing - unlike many other China-marketed tablets - this one is geared toward the English language consumer and most Google services and Netflix work well on this model.", "Title": "Pipo Pro is a Solid Choice", "Date": "November 27, 2013"}, {"Author": "Alexandre Viladevall", "ReviewID": "R1P04JAEZXTPJ3", "Overall": "1.0", "Content": "I have owned this tablet for more than a month now, and all I can say is that it is the worst electronic device that I have ever owned. When i 1st got it it would crash, freeze, and reboot every time I tried to use it. I then looked for a update to see if that would solve the issue. Well, the update made things worse. 70% of the time the tablet will get stuck on the \"Pipo\" splash screen and will sit there until the battery is drained. If you keep on resetting it via the hardware reset button on the back, you may get lucky and the dammed thin g will boot all the way up to the log on screen. Then the fun begins. The tablet is sluggish, the battery will barely last a day on standby, and the tablet will randomly reboot, whence you are stuck with the dammed \"Pipo\" splash screen of death (it will sit there forever!) I have owned and still own  many tablets: Asus Transformer, Viewsonic Gtab, Acer A110, Acer W500, Nexus 7, Fuhu Nabi2, and Lenovo A1, and this is by far the worst I have ever owned. DO NOT BUY THIS!!! unless you enjoy throwing your money away and spending many frustrating days trying to get this thing to work.", "Title": "DO NOT BUY THIS !", "Date": "November 11, 2013"}, {"Author": "jeffw79", "ReviewID": "R2J9OFBYT2XM15", "Overall": "2.0", "Content": "I had to return mine. The software was very bad. Build quality was pretty good. Nice size and it was pretty light. The display is nice!", "Title": "Defective returned", "Date": "April 7, 2014"}], "ProductInfo": {"Price": "$399.00", "ProductID": "B00ECV0W3I", "Features": null, "ImgURL": "http://ecx.images-amazon.com/images/I/41uYPoalDzL._SX300_.jpg", "Name": "8.9 Inch Pipo M7 Pro External 3g Android 4.2 Rk3188 1.6ghz Retina 1920x1200 Bluetooth GPS Hdmi 5.0mp Camera--wifi Version"}}