{"Reviews": [{"Author": "Scott M Newcomb", "ReviewID": "R2N1UKCHRCAZML", "Overall": "4.0", "Content": "I was expecting a cheap knockoff tablet but I was surprised when I opened it up. Looks clean and it's light weight. This thing performs as well. It supports flash the apps pop and overall it's pretty snappy. For the money I'd say it's one of the best in $100 bracket. The only bummer is no bluetooth. If your looking for a decent and cheap tablet... these are the way to go.", "Title": "Great tablet for the $$", "Date": "July 30, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RXM8CYG2PFCQH", "Overall": "5.0", "Content": "This tablet is better than you would expect for the money. I carry it around everyday and stiil works well. As long as you dont need a good camera it has eeverthing a mid grade tablet should!", "Title": "good choice for the price", "Date": "August 28, 2013"}, {"Author": "Lori Wallis", "ReviewID": "RLNCAT2MKNBHC", "Overall": "5.0", "Content": "This tablet has worked very well from the day I received it! No problems with it so far. It is quicker than either of my son's Kindles, and comparable in speed to our laptops. I don't know a lot about resolution, but the picture is plenty clear for my purposes. I mostly do e-mail, facebook, and shop on it. No problems connecting to wifi. I didn't want to spend a lot, so I settled for the small screen size in order to get the speed. If I had it to do over, I would spend more and get a bigger screen. Otherwise, I'm completely satisfied with this product!", "Title": "Great little tablet for the price", "Date": "September 20, 2013"}, {"Author": "M.P.U. Review", "ReviewID": "R1H490ZYD1GZTA", "Overall": "4.0", "Content": "R7/16 GIG - LI-ION BATT. /// bad reviews are for 8 GIG model w/LI-POLY BATT.9/6/2013Very fast, Pretty happy for my first tablet. Audio is very good, the speaker hole is on the back but even if you cover it it's as thoe the sound comes from around the screen very clearly. video clear and sharp. Stalled shutting down once and had to use reset pin hole but NO OTHER OPERATING PROBLEMS. Draw backs; CHARGES THROUGH MICRO USB ONLY, so no key board or phone tether charging at the same time. (Booklet was for 8GB model and states LITHIUM-POLYMER BATT.), charge at least 10hrs. 2x then 7hrs. after that. I followed and have tested several ways. I get 2:35 hrs. down to 12% with WIFI ON / FULL BRIGHT / FULL VOL.  ---  and 2:56 hrs. WIFI OFF / 1/2 BRIGHT / 1/2 VOL., BATTERY HISTORY STATES ESTAMATED BATT. LIFE OF 4:30. It charges to 80% in 2:30 hrs. and to 100% by 3:00 hrs. WIFI on / full bright / screen on with game on but not but not played. Front and rear cameras are both center at top, that's good but 3MP is low quality so don't expect to use it as anything more then a novelty. At $105.00 its a nice unit but the short battery life and lack separate charging makes it more of a home toy then a work tool.UPDATE;9/15 5hrs. with WIFI music screen asleep, add screen on first 1hr. + reckless racing 2 last :30 min.  After 9dys. of charging for at least 10hrs. and then unplugging and using until drained down to 10%.For 10dys charge it for 10hrs. drain to 10%. music playing screen at 1/3 or off I REACHED 5:15hrs at 4%.TWO separate batt. saver prog. say battery is a LI-ION not LI-PLY - ??ALL YOU NEED  is an APP. KILLER and to keep your screen low and WIFI OFF as much as possible.BOO 1 STAR FOR NO SEPERATE CHARGE PORT BOOOOO!UPDATE;9/16 WILL use screen 1/3 to play and see if time drops back to 2:30mins.UPDATE; I'M FROM THE FURTHER,FURTHER FUTURE: Actually it's still 9/15 11:37pm.+ 3:00hrs to charge to 100%- 3:40hrs to drain to 10% playing RECKLESS RACER 2, SCREEN AT 1/3.. A few more tests to see if times hold.the times would be:10x10hr charge/drain to 10%- 2:35 100% bright- 2:56  66% bright- 3:45  33% bright- 4:20  33% WIFI OFF, 3 SHORTER MOVIES.- 5:15  0% bright-sleep+music.85% of the time on.? 6:00  0 screen-music only?GET an auto APP. killer, or close your APPS. instead of skipping to desk top.DONT get a BATTERY SAVER, Just DIMM the lights, KILL the APPS and turn off WIFI as much as possible.USE the internal GRAPH for BATT. charge/discharge records.P/S The BATT. has never been more then slightly temped once while charging.UPDATE 10/14/13 BATTERY DROPS VERY QUICKLY FROM 100 - 77%, as little as 20mn but can be extended to as much as 1:05hr with 1/3 bright, WIFI OFF, low process task like note taking - drawing n such. THEN holds on much better / progressively longer down to the 14% warning and the 2nd warning at 4%. charging gives a little beep once in a while. A very good sounding but cheaper set of Head phones with 2AAA batt powered noise canceling gave me a little hum while charging but a GOOD set of ear buds sound AWSOME and really make the movie watching an EXPERIANCE, the buds that came with it I threw out / l-side did not work, then fell apart.UPDATE 10/18/13 Question was asked -ALL APPS ARE ON MICRO-SD-CARD BUT SAYS MEMORY FULL, WHY IS THIS?- Open -settings- and tap -storage- , The first level of -internal storage- is for the operating system and down loads, next is the partitioned -nand flash- which is 13.70 of your 16gig internal memory. 3rd is -SD CARD- which in your case is the 8gig micro sd card, 4th is -USB STORAGE- should you want to use an EXTERNAL FLASH DRIVE... Now tap -APPS- to the right you will see -DOWNLOADED-, tap each APP you will see 4 option buttons, if the bottom left says -move to sd card- and is lit up- tap and move to sd card /which is actually the /internal nand flash/, wait until it changes to -move to tablet-, if it's not lit you can't move it, if you don't need or want it,, uninstall it,, tap back up arrow and tap the next APP, if your still FULL you have way,way,way too many APPS, APPS do not run off micro-sd-card/ it is for photo's video's and movies. APP KILLERS do not remove they just stop them from running and eating up battery power and processor time, Try -ADVANCED TASK MANAGER- icon is a -green robot with a red x on it/ it's free. turn off WIFI when ever possible to extend batt. //GOOD LUCK//Question; What kind of charger? : A 2' micro usb to usb that plugs in to the wall adaptor, car or computer. Get a 6' you'll want it. I'm going to get the -90* right hand- as the port is on top in landscape position.", "Title": "VERY FAST. update; BATT. 5hrs W/MUSIC+SLEEP screen", "Date": "September 13, 2013"}, {"Author": "Adriana Rosado", "ReviewID": "R2ATB250BK16CC", "Overall": "1.0", "Content": "I am very disappointed with this product completely,it never fully charged and now it only works while plugged to the wall (not what i bought it for) which doesn't allow me to move,wish i could return it because i am very upset and wouldn't recommend this to anybody.", "Title": "Horrible product:", "Date": "January 6, 2014"}, {"Author": "Buyer", "ReviewID": "R2AV68YLITPHPG", "Overall": "1.0", "Content": "This tablet does not have any battery life.  If you get an hour out of it you will be lucky!  W received this tablet on 30 Jul 13 and something inside it broke on 20 May 14 getting the tablet so hot you could not hold you hand on it for more than 2 seconds.  Once it cooled off it has not started back up since.  This is a complete piece of junk!", "Title": "Do not buy!", "Date": "May 27, 2014"}, {"Author": "Guy Madison", "ReviewID": "RVYPM4PRP49P0", "Overall": "2.0", "Content": "We bought this for our daughter for Christmas. This was her first tablet. Because she is young, we felt that spending a lot for a tablet wasn't appropriate. However, that appears to be the reason that you pay more in most cases for better tables...to get a better quality product. On the surface, this product seemed to be perfect for her. Immediately upon using this product, we noticed that when she was using the device while it was charging, that it didn't work properly. For example, the screen started shaking or \"twitching\" as my daughter called it. Also, the charger got so hot, we were afraid it could be a fire hazard in our home. Then the device started to have all kinds of issues... screen freezing up, keyboard freezing up, apps were disappearing from the desktop, etc. Unless the product issues are corrected, I wouldn't recommend this to anyone...even for the price.", "Title": "Daughter sad and disappointed", "Date": "January 20, 2014"}, {"Author": "Brian Riggins", "ReviewID": "R3GV7AW692TD69", "Overall": "1.0", "Content": "I was made to understand that the dragon touch tablet would be a decent unit for a reasonable price. But I have nothing but trouble. Battery only lasts one hour and doesn't have the power to play a video without stopping. My phone has better technology in it that this tablet.", "Title": "Not quality", "Date": "January 19, 2014"}, {"Author": "Lee Smith", "ReviewID": "R37KWQWK4QOAYX", "Overall": "2.0", "Content": "This tablet losing battery power VERY quickly but can be played while plugged in. The price was low for tablets when purchased & you obviously get what you pay for.", "Title": "Poor battery but price point is low", "Date": "December 14, 2013"}, {"Author": "Susan Masse", "ReviewID": "R38PLTJGXQEOY4", "Overall": "3.0", "Content": "My biggest disappointment with this tablet ,is that I can not play facebook games,due to the fact you cannot download adobe flash player on google android . It could be part my fault,I do not know much about all this new technology.", "Title": "Not Satisfied", "Date": "November 13, 2013"}, {"Author": "Marc \"Marc\"", "ReviewID": "R1FSBUST66AFB5", "Overall": "1.0", "Content": "The device doesn't charge as the charger does not make solid contact in the device.  This small cost effective tablet seems nice, but since I was holding it as a small gift I missed the return window and am very disappointed that the device cannot be charged making it useless. The charger was not working immediately.  I would happily revise my rating if the seller would fix the issue so the device could work.  I will have to try buying a replacement charger and hope that works or the purchase will be a complete waste.", "Title": "charger does not work", "Date": "November 22, 2013"}, {"Author": "Lori S \"sylvia\"", "ReviewID": "R296AJVZA97T0N", "Overall": "5.0", "Content": "This is a great little tablet for the money. I'm writing this review with it as a matter of fact. Great size key board, large and easy to type with. Surfs web quickly and without freezing up. I haven't streamed video yet but if its terrible I'll update this review. I purchased this for at night bedside, I like to read at night and this is great for that.  U can add a micro SD card like most tab.sets along with full size keyboard with an adapter.....not included. This a.so hooks up to your HD TV and other video device. Very pleased with this purchase.", "Title": "great deal", "Date": "September 5, 2013"}, {"Author": "Michelle Griffith", "ReviewID": "R3M5DZO5HZ5MNT", "Overall": "5.0", "Content": "gave as a gift to my husband who reads alot, and he cant seem to put it down.in just the first couple days he had 6 books down loadednobody can read that fast", "Title": "gift", "Date": "August 20, 2013"}, {"Author": "ynverh", "ReviewID": "R1DLPKYOHQN4QV", "Overall": "3.0", "Content": "This is a good tablet for the price. Performs well with apps. However the only dreaded problem is the battery life. goes from 100% to 15% in as little as 20 minutes depending on what you are running, so you constantly have to have it on charge.And it takes forever to charge.", "Title": "Good Tablet", "Date": "August 25, 2013"}, {"Author": "Kerron Braham", "ReviewID": "R33EK5QIOK2GN", "Overall": "4.0", "Content": "Dragon Touch 7 inch is a great product but the battery sucks, needs constant recharging my son is frustrated. Based on price i guess it is acceptable.", "Title": "Dragon Touch rocks  almost", "Date": "August 13, 2013"}, {"Author": "SNOWY VINE", "ReviewID": "R1V9FPTOSA2I2O", "Overall": "5.0", "Content": "VERY FAST RESPONSE, MANY FEATURES, WELL BUILT, CANNOT GO WRONG WITH THIS PURCHASE! DO YOURSELF A FAVOR. MAKES A GREAT GIFT TOO.", "Title": "BEST UNDER $100 TABLET", "Date": "August 23, 2013"}, {"Author": "Cathy", "ReviewID": "R7B82CZKF9E3Q", "Overall": "3.0", "Content": "This tablet is a very nice size that is easy to store and function. I plan to purchase another one in the future.", "Title": "I like it", "Date": "August 9, 2013"}, {"Author": "jennifer spain", "ReviewID": "RAE5FFL97IG8A", "Overall": "5.0", "Content": "just don't stress it if you open to many apps at once it freezes. down load an app killer first and save yourself the headache otherwise awesome machine! Just got off the phone with tech support it won't charge anymore! Customer Support is right on the ball sending a return label and taking care of this asap! very happy with customer service I will update when the new unit arrives!", "Title": "works great!", "Date": "September 8, 2013"}, {"Author": "DEE", "ReviewID": "R33G2GWFWIX3X", "Overall": "5.0", "Content": "i was expecting this item too be less functional than actual brands, was i sooo wrong! its amazing . my son loves it . great seller as well, shipping all on time .!!!", "Title": "just love it!", "Date": "September 5, 2013"}, {"Author": "JAMES M HOOPER JR", "ReviewID": "R2Y8F6FCSRZ9RL", "Overall": "1.0", "Content": "Dont buy it is crap. It quit working after 30 days couldn't get my money back only 30 day warranty", "Title": "Not Happy!", "Date": "November 3, 2013"}, {"Author": "Phyllida Ludd", "ReviewID": "R2HW7KPW62VX2R", "Overall": "2.0", "Content": "This was the first tablet I ever bought for myself. I have used tablets which have belonged to other people, but I never thought I needed one myself. Within the same week, both my desktop and my laptop died (power supply and hard drive failure, respectively) so I bought a tablet while I was waiting on my dead electronics to be repaired (both were still under warranty thankfully!). I didn't want to spend a lot of money on something that would be relegated to a shelf most of the time once I had my PC and laptop back up and running, so I read through many reviews of tablets on Amazon, NewEgg, and TigerDirect, and decided to purchase this one. It was a complete mistake.Out of the box it was perfectly fine; I had no problems with anything. The wifi connected everywhere I tried it, the Play Store worked fine, apps installed and updated fine, the only problem is that it had to be constantly restarted to keep everything running fine. I would open Chrome and then watch a show on Netflix and then open the Kindle app and read a while and then watch a video on YouTube and by the time I got to YouTube, it was so boggy that I had to restart to get it running smoothly again. You guys ever use a PC that's so old and decrepit and the video card is such a piece of junk that when you close a window sometimes you still see parts of the window left on the desktop for a couple of minutes before the icons come back? That's what this tablet was like. The screen is pretty unresponsive too; trying to use the Facebook app was torture. You'd just have to keep poking around until the screen finally let you open the thing you were trying to open. I guess I could have gotten a stylus, but that doesn't change that fact that the touch screen is more of a you-have-to-jab-it-firmly-a-couple-of-times screen.I probably still would have kept this junky tablet anyway just to take to my second job because for all its problems, I still liked having a tablet, except that one night (about a week after I had gotten it) while I was watching a video I downloaded, a yellowish dotted line appeared down the screen and never went away. It was a line of dead pixels. I contacted Amazon immediately and was sent a how-to-return email within 5 hours. I sent it back the next day, and a day after they received it, my money was refunded to my debit card. Hardware fails and we all know it's unpredictable, but even if this tablet hadn't gotten the line of dead pixels I still couldn't in good conscience rate this tablet at any more than 2 stars, even when it was in perfect working order, new out of the box. Amazon gets 5 stars for their amazing service, but this tablet only gets 2 stars.I do have a recommendation to make: when I got the money refunded, I decided to buy the tablet I was going to buy in the first place--the Asus MeMo HD 7. It's got 16 GB internal, with up to 64 GB external (microSD or SDHC), a 1.2 GhZ quad core processor, a 1.2 MP front facing camera, a 5.0 MP rear facing camera, and 1 gig RAM. The video and sound quality are AMAZING, and it doesn't get bogged down. It's Jellybean 4.2, which still isn't the most current version (we're up to 4.3 now) but I LOVE it. It is as responsive the the touch as an iPad or Galaxy Tab 3, and the best part is that it's being sold on Amazon for 149.99. Seriously, if you can't spare an extra $45 right now, wait until you can and buy the MeMo.", "Title": "I would have given it more stars, but...", "Date": "October 4, 2013"}, {"Author": "Thomas", "ReviewID": "R3J36Q9Q9SAZ47", "Overall": "1.0", "Content": "I am very disappointed in this tablet. The speakers blower within the first to weeks and now I have to plug in external speakers to listen to it. I don't recommend this product.", "Title": "Very disapointed in this tablet", "Date": "January 3, 2014"}, {"Author": "DC", "ReviewID": "R36WVTXUJT6A7D", "Overall": "1.0", "Content": "I read misleading reviews from unknowing individuals. Not recommended. Spend the extra money for a better known tablet. N n", "Title": "Don't buy", "Date": "December 30, 2013"}, {"Author": "Cindy Merrill", "ReviewID": "R1TDA5YMYY7JQ", "Overall": "1.0", "Content": "I ordered a black one, received a red one!When I opened it I noticed the charger cord and the USB cable were not in packaging just loose in box.I started to charge it, waited nearly 24 hours before powering up and that first power up put me at just 67% battery life. When I reattached the power charger it refused to charge at all, would show the charger on but would go off seconds later.I started to explore its features, it took 2 hours to download one 500 Mb app whereas our Ipad that takes just seconds to a minute.I explored the tablet further and found that the storage said only 2.47 GB available??!! How in the world when I what I ordered was a 16 GB HDD?Bad bad, asked for a refund and am returning this", "Title": "Not at all what I ordered!!!", "Date": "December 25, 2013"}, {"Author": "DL", "ReviewID": "RLLGSVV35TYK4", "Overall": "1.0", "Content": "This tablet is terrible!!! The battery only lasts an hour at best. At least I was able to return it without any problems.", "Title": "Terrible Tablet", "Date": "October 25, 2013"}, {"Author": "luis vacaflor", "ReviewID": "R3FWYLCSAZT3WO", "Overall": "1.0", "Content": "Every time when an app its downloades, the tablet freezes and shuts down automatically. later, when you enter an app, the screen turns black and it has to be shut down using the reset buttom.  Also the tablet cannot be actualized as its supposed to be.very bad product, i am very dissapointed with it", "Title": "It works only like a 10% of what it should do", "Date": "October 20, 2013"}, {"Author": "Wanda", "ReviewID": "RYRCXVDKY1JR9", "Overall": "5.0", "Content": "It arrived in perfect condition. My seven year old loves it and there isn't anything he can't do that a $300 tablet does. It is cost effective and worth the small investment. The tablet does not look cheap and his friends parents are shocked of how in expensive it was.  The set up is easy and in less than 20 minutes my little one was reading books, downloading apps, and surfing the internet. By the way it has great parent controls!", "Title": "Great tablet!", "Date": "September 6, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2K6KUNTS3UO7", "Overall": "1.0", "Content": "I bought this for my 16 year old son for Christmas, but never saw him use it, as he continued to use his iPhone. Finally I bought it off him so I could use it for video games and also to download ebooks to read online. Unfortunately it is the slowest electronic device I have ever used. I was unable to download the free Kindle reader. It constantly shuts down in the middle of a game. I see there's an sd card slot but am reluctant to invest in one as I don't think it'll make much difference with this cheap piece of junk. Save your dollars for a higher quality tablet, you'll be money ahead.", "Title": "Save your money for a higher quality tablet", "Date": "June 10, 2014"}, {"Author": "Amber Bien", "ReviewID": "R1YF4VWYVXCT1J", "Overall": "1.0", "Content": "When I took it out of the box right when I got it through the mail, I grabbed it within the box and it instantly cracked under my hand. I couldn't even get it out of the box!!! After that, the touch screen was defaulty and I couldn't use the screen opposite of the crack. Not even to turn it off. Piece of junk. You should at least be able to take it out of the box without having it crack underneath your hand to grab around the foam holding it there....very flimsy and thin. Poorly made for a tablet.", "Title": "flimsy and piece of junk.", "Date": "June 7, 2014"}, {"Author": "denise cooper", "ReviewID": "R28BLGNS3R7OIF", "Overall": "1.0", "Content": "Bought this in February 2014 for my mom for her to listen to music and go on the web when she's at work bored. It broke last week. For one the graphics on this tablet is really horrible and I wouldn't recommend this to anyone, especially kids because it can be damaging to their eyesight. The quality is really poor. Last week the screen starting freezing. It got to the point where everything on the screen kept running down.My warrant was up on March 29, luckily I was able to still get a refund after.", "Title": "Not worth it.", "Date": "April 29, 2014"}, {"Author": "martin", "ReviewID": "R5KZMNCV8OYWN", "Overall": "1.0", "Content": "You always get what you pay for, and these tablets are cheap for a reason. We read the reviews on this product and most were good, so we thought we would take a chance. Tablets use battery very quickly, does not hold a charge well and is sporadic in its ability to be used on a regular basis.", "Title": "Not Worth it", "Date": "February 8, 2014"}, {"Author": "Fred smith", "ReviewID": "R1O7RJB54JNRX0", "Overall": "3.0", "Content": "It worked wonderfully for 2 days.  Then it froze up and would never turn back on.  Returned with fast refund within 3 days.  It may be a good product but I may have just received a bad one.  I really liked it and am kinda bummed.", "Title": "It worked wonderfully for 2 days", "Date": "February 7, 2014"}, {"Author": "Laureen", "ReviewID": "R3GUFT7IOT3L5Q", "Overall": "4.0", "Content": "Fast processor, good memory compared to a lot. Screen resolution is a little low compared to my Galaxy 3 7\" Tablet, but lets face it, thats a $200 tablet vs this for $70. Good screen colors and watching youtube or Netflix looks good. ITs an Android, so it's easy to use and just like my Galaxy Tab and phone. Seems like it'll be durable as the case is well made. My only two wishes would be to have a usb for charging & bluetooth. It has a straight pin charger which is proprietary to the unit. Means having to carry an extra charger. All my other units charge off standard USB. Also, no Bluetooth which would be a big help. But that said, very happy and a great little unit for the money.", "Title": "Nice little Tablet for the money.", "Date": "February 5, 2014"}, {"Author": "LouAnn Allred", "ReviewID": "R27UMIHJVYLQU2", "Overall": "5.0", "Content": "Read a lot of different reviews on tablets. This is my first time having one its easy to use for someone who is not real great on computers. I find the dragon user friendly and would recommend to anyone who is looking for a tablet.Great for the price.", "Title": "Dragon Touch R7", "Date": "February 3, 2014"}, {"Author": "ROBIN DANDREA", "ReviewID": "R4PBWLFD2PC9E", "Overall": "3.0", "Content": "bought it for my 6 year old and she loved it. Shut it down one day and it never turned back on. If you buy it get the warranty.", "Title": "shutdown after 6 months", "Date": "February 3, 2014"}, {"Author": "George Barton", "ReviewID": "R3OEU6IZZL7AP", "Overall": "5.0", "Content": "this product works very well and surpasses my expectations.  You can do just as much on this as an ipad  money very well spent", "Title": "very awsome", "Date": "February 3, 2014"}, {"Author": "casualreader", "ReviewID": "R3B2WC0CRAO9B5", "Overall": "1.0", "Content": "Ridiculously slow even with app kill.  took an hour just to download the app kill as recommended by the manufacturer.  Screen is nowhere close to an iPad as 1 reviewer said, but for the price I was not expecting that.real disappointed.  I returned it product.  In the end, you get what you pay for (if you are lucky).  Don't expect an iPad, because it is nowhere close.  :(", "Title": "sucks", "Date": "February 1, 2014"}, {"Author": "Florencio Hernandez", "ReviewID": "R2SE5EF1QBV3OO", "Overall": "4.0", "Content": "Very good palm at low price with lot of functions and high quality display. I have to get familiar wit it, to give a wider opinion, but in short time, it well cover my expectations.", "Title": "Low priced, high quality palm.", "Date": "January 30, 2014"}, {"Author": "rafael gonzalez", "ReviewID": "R34HNZPG4ATMVV", "Overall": "4.0", "Content": "good tablet but poor battery life approximately less than 4 hours of continuous use.good resolution video, good audio, fast navigation on internet, good wifi connection right through", "Title": "good table", "Date": "January 29, 2014"}, {"Author": "Fatoumata Haidara", "ReviewID": "RZLM5TWC3L24N", "Overall": "4.0", "Content": "I like this, so small and discreet, very convenientI will not hesitate to recommend it to a friendThank you", "Title": "wonderful", "Date": "January 28, 2014"}, {"Author": "Anthonny Garcia", "ReviewID": "R5RL4DBP4PAUF", "Overall": "5.0", "Content": "I loved it, I recommend it totally worth buying, the screen is very censible excellent quality, the system is very fast and everything works perfect", "Title": "very good product", "Date": "January 27, 2014"}, {"Author": "Diana Wyers", "ReviewID": "R1CW9JM7TYNRRM", "Overall": "1.0", "Content": "Tried 2 ,both failed to work! Bummer Christmas present, and a hassel to return. Do not recommend this tablet, Try another!", "Title": "Failed performance", "Date": "January 27, 2014"}, {"Author": "Josephine", "ReviewID": "R3IFOXQHRPME6M", "Overall": "1.0", "Content": "This tablet was awful. I bought two. One for me and one for my boyfriend, mine was glitchy, and his wouldn't turn on after the first day of use regardless of how long it had on the charger.", "Title": "Awful", "Date": "January 25, 2014"}, {"Author": "Christopher smith", "ReviewID": "RDLNL7PE0FFM2", "Overall": "1.0", "Content": "I purchased two the first one came with Broken charger the second one after one use wouldn't turn on again, do not buy", "Title": "Do not buy", "Date": "January 25, 2014"}, {"Author": "Georg Trimborn", "ReviewID": "R3FLLZWHB5DOKH", "Overall": "3.0", "Content": "The battery life is a bit less than what I'd like, but considering what I paid for this, that's an issue I'm willing to live with.", "Title": "Not bad for the price", "Date": "January 21, 2014"}, {"Author": "Jayne Matthews", "ReviewID": "R3RYAYKLTP4ZYI", "Overall": "5.0", "Content": "Got these for Christmas gifts for my adult daughters. They seem very pleased with it, for what they are using it for. No problems maneuvering around or figuring out what & how to do things. Very please, considering looking into one for myself.", "Title": "Impressed", "Date": "January 19, 2014"}, {"Author": "Ben", "ReviewID": "RCBP59ET48XHZ", "Overall": "5.0", "Content": "awesome tablet best bang for your buck right here!  You can't go wrong.  Don't get a slow tablet get this baby!", "Title": "great tablet!", "Date": "January 18, 2014"}, {"Author": "Angela Morris", "ReviewID": "R2ZE7JPMFG0Y5L", "Overall": "5.0", "Content": "I bought this tablet as a Christmas present for my husband. He loves it!The screen is clear, it has great sound, and easy to handle.This was a great deal for the price.", "Title": "Great Deal!", "Date": "January 17, 2014"}, {"Author": "david a monnar", "ReviewID": "R2X6PSFRIOFTE2", "Overall": "5.0", "Content": "It's a fast and nice looking tablet at reasonable price plus with all the features that I need. Got enough memory to run any app.", "Title": "Excellent !!!!!", "Date": "January 17, 2014"}, {"Author": "Loren", "ReviewID": "R1FWM3XPR2NU3Z", "Overall": "3.0", "Content": "Battery goes  fast when your online. Charging time is quick and runs programs very well. Over all its a good tablet. Just the battery life is short", "Title": "battery", "Date": "January 16, 2014"}, {"Author": "Tirra", "ReviewID": "RWWHNSWUGPV6H", "Overall": "4.0", "Content": "This is a pretty good tablet for the money.  I bought my mom a Nook with similar specifications(but a larger screen).  This Dragon touch can do everything the Nook can do so far.  It doesn't have as good a screen resolution as the Nook and the touch sensitivity isn't as good(but not a big problem either).  The Nook also feels a bit more solid but that's about it.  The Nook cost $215 bucks.  The Dragon Touch cost $89.  Im glad I got my mom the Nook but Im very happy I got myself the Dragon.", "Title": "Pretty decent for the price", "Date": "January 14, 2014"}, {"Author": "Philip Bowen", "ReviewID": "RR5RQWE1GCN5G", "Overall": "2.0", "Content": "Im not going to say much about this item. I bought this to replace a allwinner tablet I accidentally broke. This Dragon cost more and the quality was bad. Charger worked only when it wanted to and the screen resolution is terrible. Reading the specs and mainly the reviews on it I thought it would be decent. I was wrong. Please pass this one up. If you do want a reasonable tablet look for allwinner.", "Title": "poor quality.", "Date": "January 14, 2014"}, {"Author": "J. Liss \"Jovi Fan\"", "ReviewID": "R56C5O7451U6X", "Overall": "1.0", "Content": "If I could give this negative reviews....I would. Not the tablet exactly....but definitely TabletExpress. We had this tablet for a short 3 months. Plugged it in to charge one evening and it was working fine. Turn it on the next morning and the screen is white, nothing. Contacted tablet express and all they had to say was that it was not returnable because their return policy had expired. I didn't even want a return, I just wanted them to send a new tablet that worked. Before the tablet quit, it worked great...had beautiful color, plenty of space and was all around a good purchase. But, a product is only as good as the company you buy it from and TABLET EXPRESS has the worst customer service I have EVER experienced. I had to throw this tablet away, it was useless. Save your money and buy from a reputable company that will stand behind their product for more than 3 months! I also have a Motorola Droid Xyboard 10.1 tablet and it has a manufacturers warranty of 1 year...I know you read a lot of good and bad reviews, please don't buy this tablet, don't waste your money on something that doesn't last longer than 3 months! I plan to write a blog and get the word out all over the internet about how bad this company is. What ever happened to the customer is always right? 3 months people, 3 months!!!I have had my motorola tablet for a year and half. Maybe it was just a fluke that the tablet quit. That's fine. But this company will do NOTHING about it, absolutely nothing!I have purchased so many items from Amazon and I have never written a review, good or bad. But, with this experience, I felt I needed to let other people know how this company operates and maybe someone else doesn't get ripped off like it did.", "Title": "PLEASE DON'T WASTE YOUR MONEY!!!", "Date": "January 13, 2014"}, {"Author": "Harold Phipps", "ReviewID": "R19GPAEVXUQV0L", "Overall": "1.0", "Content": "Not exactly happy with this out of the box.  It seems the bottom of the screen does not work when held in a vertical orientation unless the buttons are on the top.  You can see the icons but not use them.  It sucks if you happen to launch a app when it is held like that.  You try to exit out and the icons will not work.  The same area of screen works fine when held with any other orientation.  It started having problem a little over a week of having it.  Locking up, display flaking out etc..really skip this.", "Title": "Worked ok for about a week", "Date": "January 13, 2014"}, {"Author": "Diane Hoffstedder", "ReviewID": "R1J6X7YQKRB0N2", "Overall": "5.0", "Content": "this one was fine and my other grandson loved it the screen is very bright and clear. for the price it was greatDiane Hoffstedder", "Title": "Dragon Touch review", "Date": "January 10, 2014"}, {"Author": "jsparo", "ReviewID": "RCU2UZK3PRGW5", "Overall": "5.0", "Content": "PURCHASED 3 FOR GRAND KID FOR CHRISTMAS. THEY HAVE NOT PUT THEM DOWN. VERY GOOD BUY. THEY ARE NOW TEACHING ME TO USE THEM.", "Title": "GREAT 7\" TABLET", "Date": "January 8, 2014"}, {"Author": "Daniel Oliverio", "ReviewID": "RO170C7Z2KR7F", "Overall": "1.0", "Content": "First one I bought was immediately defective out of the box as it came with a broken pixel. I called and had a new one sent out and that one will not take a charge and also had to be returned. I wish I read all these reviews before making a purchase. You get what you pay for, just spend a couple extra bucks and get something brand name. This is product is crap.", "Title": "This item is junk!", "Date": "January 7, 2014"}, {"Author": "Maria", "ReviewID": "R5TQMUBC3SULJ", "Overall": "5.0", "Content": "I bought this R7 for my son for Christmas. It is really fast. For this price you getting a deal.", "Title": "very fast", "Date": "January 7, 2014"}, {"Author": "Miguel", "ReviewID": "R1YA4ZYZ8G2YT9", "Overall": "1.0", "Content": "The screen dont work properly the resolution to bad so im sorry i dont recomend even freeBut maybe my tablet only not all", "Title": "really bad", "Date": "January 7, 2014"}, {"Author": "Rajendra L. Shahi", "ReviewID": "R3QP7RJ27EJVTG", "Overall": "2.0", "Content": "I had to return it because I couldn't download flash player to view facebook clips, so returned it right away and ordered same brand with 10.1\"screen that has bigger memory and hd and also supports flash player. But the sad thing is, they charged and shipped new one, but has not refunded the 7\" Dragon Touch that I returned. I am wondering how long it will take for them to refund the money.", "Title": "Can't download flash player", "Date": "January 6, 2014"}, {"Author": "michael", "ReviewID": "R1A69PBHAOTCDO", "Overall": "4.0", "Content": "So far.  Battery life is not Amazing. but satisfactory. lasts 3 to 4 hours.Screen is good size but has a small halo effect of 3D looking like an old computer monitor when stared at from the side a blue haze not comfortable to stare at for long periods of time. However the battery life prevents that.The screen has 2 spots of dust trapped behing the front glass and the touchscreen. kind of annoying but not enough to return for.Works great for games and watching movies. the External memory slot is great for connecting to computer.Overall for the money you get what you pay for.", "Title": "Decent for what you pay for.", "Date": "January 3, 2014"}, {"Author": "Aston Kemp", "ReviewID": "R3FTHIRMNRO3XY", "Overall": "4.0", "Content": "Purchased recieved late but not do to Seller UPS decided to ruin Christmas for half the world. Has specific instructions for how to maintain and maximize battery life its still very short though after following instructions.  It run fast and with ease does everything that the 400$ tablets do which is why I recommend to anyone.  Battery life is about 3 hours fully charged just surfing the web.  Playing a game i have gotten no more the 1 hour out of it.  If the battery life was better I would rate this one of the best tablets on the market.", "Title": "Great Tablet Low Batter Life", "Date": "January 3, 2014"}, {"Author": "pike", "ReviewID": "RBVUZ6GFAMMZ7", "Overall": "5.0", "Content": "This table works well and is a good value for the price. I got it for my 10 year old and he loves it and it works very well for him.", "Title": "Nice tablet for the price", "Date": "January 2, 2014"}, {"Author": "Crickett", "ReviewID": "R3IDW3IS8PJCWV", "Overall": "1.0", "Content": "I ordered this for my 15 year old daughter who has a lot of experience using and caring for computers.  She used it twice and black lines appeared across the screen halfway up the vertical axis.  I sent it back.  Not sure if anyone else had this problem but we tried restarting, recharging and nothing worked.", "Title": "Not Impressed", "Date": "January 1, 2014"}, {"Author": "B. Hamlett", "ReviewID": "RBHX7CQ7780IT", "Overall": "4.0", "Content": "All my daughter wanted for her birthday was an ipad... Seeing as that was not in our budget I bought this tablet instead. It's been months and she's had zero issues. It works well, is quick, runs tons of applications at once without getting slow. I bought my other daughter a tablet I found on sale for Christmas, after five days I was ready to throw it out the window because it was so slow and hard to navigate. Instead I returned it and paid full price for a second dragon touch. I highly recommend it for younger users as it's so user friendly, but I've also borrowed it a few times and was able to do anything I needed without issue.**Edited notes: The charger on this item is a custom style that got wobbly and wouldn't charge. While a new charger wasn't too expensive, the new A7 model takes a standard charger that can be found at any store for a few dollars. I'd recommend buying the newer style for that reason.**", "Title": "Bought Another...", "Date": "January 1, 2014"}, {"Author": "Somebody That You Used To Know", "ReviewID": "RRO37TBBR7AVM", "Overall": "4.0", "Content": "So far my tablet works like a charm. The only reason for it getting 4 stars instead of 5 is because sometimes when I press a button on the keyboard it presses on next to it instead and its kinda annoying. This happens about 1 out of 20 letters or so and I am typing slow so its not like I fat fingered it.This tablet is fast and the battery life is a couple hours of actual use, just laying around it lasts longer.I wouldn't put this tablet up against a Samsung Galaxy or an iPad but for the price there is nothing to really complain about. If you don't like it return it and spend more than twice the money on the cheapest Galaxy. I have had other cheap tablets before and for this kind of price I would say this is the best one that I have had so far.", "Title": "So far so good", "Date": "January 1, 2014"}, {"Author": "V. Mousharbash \"Lady 2008\"", "ReviewID": "R33I22NCBR9DI7", "Overall": "5.0", "Content": "It's a great product for the price!!! The kids liked it so much !!! Fast shipping too !! Happy holidays to all of you 2014", "Title": "Love it", "Date": "December 31, 2013"}, {"Author": "N. Meyer", "ReviewID": "R51O78ZC6SSQN", "Overall": "2.0", "Content": "I had received this as a gift for Christmas, and the screen broke this morning when I was putting the screen protector back on it. This tablet performed beautifully until the screen broke, then it would only recognized input in the bottom right corner of the screen. I would not recommend this tablet for the simple fact that they used very weak plastic for the touch screen, and it broke from less than 10 pounds of pressure. I would have been fine with continuing to use this tablet with the crack in the screen, as it was barely noticeable, however because it would not recognize my touch after that, I am not able to recommend this product at it's current price.", "Title": "Great Performance. Weak Plastic.", "Date": "December 29, 2013"}, {"Author": "Bobbie J. Haynes", "ReviewID": "R3ADNIENXS0PEU", "Overall": "5.0", "Content": "Has a very fast touch capability. Better than the kindle fire! Loads faster and with a 32 SD card it's amazing!", "Title": "Fantastic for the price!", "Date": "December 28, 2013"}, {"Author": "Chelle", "ReviewID": "R2M9OB1ND7STK9", "Overall": "5.0", "Content": "The item arrived before Christmas, my son loves it no problems at all, and the tablet is very quick to load apps and other things. Good product.", "Title": "Dragon touch tablet", "Date": "December 27, 2013"}, {"Author": "hugo", "ReviewID": "REV4HS360A0PT", "Overall": "3.0", "Content": "thi is  a good article but is has too much dificulties it is not bad but it freezes too much........anyways is good for just 105 dollars", "Title": "good item", "Date": "October 24, 2013"}, {"Author": "jh", "ReviewID": "R3DDJCFPDDBGR6", "Overall": "4.0", "Content": "Does what I expected for the price.  Was delivered quickly.  Runs all the apps I was looking for it to run.  GPS and bluetooth would have been nice.", "Title": "Works well for the price", "Date": "October 21, 2013"}, {"Author": "Gregory J. Barth \"Stumblefoot\"", "ReviewID": "R14VY67YA4P9XP", "Overall": "4.0", "Content": "The tablet works well nice crisp video, pretty low battery life, and long charge time. Is advertised with a USB keyboard, but there is NO USB connection. So save the money on the case, keyboard. It don't work. I downloaded some kids games and gave it to my daughter. She likes it. Fairly short attention span so gets plugged in often.", "Title": "good deal for the money", "Date": "October 14, 2013"}, {"Author": "nancy merrell", "ReviewID": "R20OQ8J6XE9HN1", "Overall": "5.0", "Content": "I had returned the first tablet I bought which was an Android 7\", I am not sure of the rest of the title on the tablet. It stopped working after a few weeks and I was refunded my purchase price. Then I was hesitant to get another one. Therefore, I bought a different model,  the Dragon Touch R7 7\"  to try it. I have been very pleased with it and so far it works well. I use it daily. Hopefully, it will continue to work well.", "Title": "So far so good", "Date": "October 14, 2013"}, {"Author": "Maria Cristina Arndt", "ReviewID": "R1S4FMB8JMJYAW", "Overall": "5.0", "Content": "It is fantastic, fast and confortable.photos are very good.I recommend it. buy it!My son is very happy with it.", "Title": "GREAT", "Date": "October 5, 2013"}, {"Author": "Rene Ansuarez", "ReviewID": "R2A8QF41YFY25T", "Overall": "4.0", "Content": "Liked, faster processing speed than other tablets. liked that it allows and sd card unlike Kindle Fire.Great price for what this product can do.", "Title": "like", "Date": "October 3, 2013"}, {"Author": "Nevisian Pride", "ReviewID": "R1JQA1QB0DFX6O", "Overall": "2.0", "Content": "It started to freeze just weeks after receiving it. it just did not live up to what was expected unfortunately", "Title": "nah", "Date": "September 29, 2013"}, {"Author": "C. Dinkins \"Chocoreeses\"", "ReviewID": "R12KOSRTBTFSE0", "Overall": "4.0", "Content": "I bought this for my business. I have yet to use it fully but so far I like it.I will have to update my review in a couple months.", "Title": "Great buy", "Date": "September 25, 2013"}, {"Author": "Bruna Seco", "ReviewID": "R3OGD4V9BKLOZ0", "Overall": "4.0", "Content": "The tablet is good, but is not enough if your looking for lots of memory. But apart of it it is very good.", "Title": "Good enough", "Date": "September 16, 2013"}, {"Author": "michael d dyer", "ReviewID": "R2A1CRXCK29L1G", "Overall": "5.0", "Content": "For the price of this device you can not beat its capabilities. I can't wait to get all I can out of this device.", "Title": "Great Product", "Date": "September 6, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00E8PWGXC", "Features": null, "ImgURL": null, "Name": null}}