{"Reviews": [{"Author": "Terrance Wilson", "ReviewID": "R3C5JXAEVLCNS2", "Overall": "5.0", "Content": "More than what I expected! Very easy to use, have a 7\" tablet w/2.0 so operating a tablet isn't new to me.Opened the box found a extra screen film and a pouch that fits the Kocaso 10\" tablet!!! <<< Did NOT expect these!!!!Rear camera works well, clear pictures and video, wish the tablet had a tripod mount. That would make taking steadier video's.", "Title": "SURPRIZED!!!!!", "Date": "October 11, 2013"}, {"Author": "mft", "ReviewID": "R1CZ5NTFOYFLG9", "Overall": "5.0", "Content": "I bought this tablet back in November as an early Christmas treat to myself. This is the third tablet I've purchased. I wanted both a bit bigger higher definition screen but also a faster machine as there's a few live games I've grown fond of and the smaller/slower tablets would run them but at times would hang.The first thing I noticed was how well packaged this tablet was. As everyone knows due to handling during shipping almost anything can become damaged in the process but Kocaso did a very fine job with their packaging to help ensure that possibility is at a minimum. Other than a few small bubbles under the pre-installed screen protector (easily fixed) everything was pristine perfection and the tablet even had a charge. To make sure I'd get the most out of the battery the first few times I used it I used it all out then fully recharged. Battery has been great. I can read my kindle books for as long as six hours without problem. Games and high graphic apps of course cut the time down a lot but over all am thrilled with it's battery life.Everything with this tablet has been easy....and being as how I have used it a good 8+ hours a day for over the past 4 months I do think I have put it through a fair trial period. Compared to most common tablets with less than 1g speed processors, and only 512mb ddram, this thing seems to fly.....the speed and smoothness of operation from app to app is amazing coming from such a modestly priced unit/impressive. The only time I have noticed it to want to lag is when I've had a ton of apps/windows open at once.....and if I'd get a memory card for additional space I'm thinking even that would improve.Here's perhaps the best thing about Kocaso:  I had an 'oopsy' moment and fell asleep dropping my beloved tablet and the screen cracked on the corner of the coffee table....HELP! No worries....even though I had not the foresight to have been wise enough to purchase the protection plan (trust me they are good to have!) I was able to call Kocaso direct at their NY office, email them my proof of purchase here from amazon, and for a pittance they are sending me a brand spankin new replacement....YES REALLY!This device, and especially those good folks standing behind it, are top notch. You won't find a tablet of this size offering more quality at a better price. :)", "Title": "Lots For Your $!", "Date": "February 20, 2014"}, {"Author": "Lori E Lindau", "ReviewID": "R1QMHSV7BD9QR7", "Overall": "5.0", "Content": "My grandson is delighted with the large, bright display. Connectivity seems to be excellent. The stylus and soft case are nice additions to the package.", "Title": "So far so good", "Date": "December 28, 2013"}, {"Author": "Yael Bradshaw", "ReviewID": "R2JLQ8L80DUVU4", "Overall": "3.0", "Content": "nice tablet! does the job, basic tablet, nice size screen seems like all around good tablet for light uncomplicated users", "Title": "nice", "Date": "March 19, 2014"}, {"Author": "Bill McNair", "ReviewID": "R1VDR56AV7QNKC", "Overall": "5.0", "Content": "Wife loves it she uses it every day plays games and goes on internet with it  camera leaves a bit to be desired but hey for the price it's just fine", "Title": "Great product", "Date": "May 30, 2014"}, {"Author": "MandyPants \"SpinGrrl\"", "ReviewID": "R1BF4NMI90OZV5", "Overall": "1.0", "Content": "This tablet is such a cheap piece of crap that I submitted to return it. Unfortunately for me I ended up buried and work and never got around to it so I had to eat the money wasted on this. The screen is so bad that you can only view it in one angle (landscape mode). If you move it to portrait mode half the screen becomes blacked becomes blacked out. I definitely do not recommend this product.", "Title": "Awful", "Date": "May 12, 2014"}, {"Author": "Dawn Bradley", "ReviewID": "R10GFKT8DYQSAK", "Overall": "2.0", "Content": "Love the tablet, but the battery will only last about 2 hours!  Bought this for husband and he gets frustrated because when he gets into something it goes dead!", "Title": "Terrible battery life", "Date": "May 7, 2014"}, {"Author": "Bobby Waddle", "ReviewID": "RS04HIRTCRVBP", "Overall": "5.0", "Content": "Is a great pad and would recommend this pad too my friends!!! So thanks to amazon I got a great deal!!!!", "Title": "Kocasco Tablet", "Date": "March 3, 2014"}, {"Author": "Mary Heffernan", "ReviewID": "R3C4CZ2R2AX8FW", "Overall": "1.0", "Content": "I have posted my extreme disappointment in this tablet, and by the way is the second one in one and half months to stop working..I also purchased a protection plan and it doesn't seem to help.  I'm so unhappy with the result. You don't  publish a phone number so I can talk to a real live person. I'm almost 86 and reading and sewing is the only activities for me now. Tablet is shut down when I go to sleep and then when I pick it up to read again, it doesn't work", "Title": "Where oh where has my android gone ?  Mary", "Date": "April 24, 2014"}, {"Author": "Karen H.", "ReviewID": "R1NIIAZV8TDVBB", "Overall": "5.0", "Content": "It is good but on our second one so far the second one is okay thank u very much kh", "Title": "Warrant and prolbem", "Date": "February 20, 2014"}, {"Author": "Kim Wright", "ReviewID": "R2F09FVB5V115A", "Overall": "3.0", "Content": "I purchased 2 of these for Christmas gifts. The only complaint I have heard is that it runs a little slow. You have to be close to the router for the wifi to work. Other than that they work good for the money.", "Title": "A little slow", "Date": "February 14, 2014"}, {"Author": "Josh", "ReviewID": "R342L6C3JBAH10", "Overall": "1.0", "Content": "Got one as a freebee after buying an expensive memory foam mattress.  This is a very budget tablet. Trying to use this after an IPad or Google nexus is painful.  Terrible screen with minimal viewing angle.  The feedback is slow and unresponsive.  You get what you paid for. Not me but I weep for anyone who willingly buys one. Please save your money.  I did type this review on it though:)", "Title": "Horrible", "Date": "February 7, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00ERDGQ7M", "Features": null, "ImgURL": null, "Name": null}}