{"Reviews": [{"Title": "This SUPERB Tab 3 10.1 PHONE and TABLET COMBO is so amazing and it has a beautiful and vivid screen! A detailed review.", "Author": "Daisy S \"Daisy S\"", "ReviewID": "RYN2ZMLPVXEAX", "Overall": "5.0", "Content": "Yes this tablet is WiFi yet it also has a phone (Micro Sim card slot) and data in it (if you have a data plan). Both work just great. Since I am so happy with this superb and great value Tab 3 10.1 combo phone and tablet, here is my detailed review. First it has exceeded ALL of my expectations and so much more! This phone / tablet combo, I paid just about 90 dollars more than the WiFi only of this version and now I have a small data plan in it and minutes (both on no contract) and so I use this tablet as a phone and as a tablet. The fact that this is a 10.1 tablet with data and phone capabilities; I found this device an all-around SUPERB VALUE for the features in it and the usability even over the newer Tab Pro line which just has WiFi! Yes, this has a phone in the tablet (even though the picture does not show a phone icon on the Home Screen). So please read the PROS below...PROS:+ Phone Info/Sim Card and Data Info - There is a phone app icon for the phone dialer, works great). This device accepts a Micro Sim card. So you can use this tablet as a phone and a tablet! There is a regular phone dialer in this tablet, the front home screen did not show it in the picture, yet when I received my tablet, it was on the bottom front. And the phone is loud and clear. In fact, I was able to install my Micro Sim and the phone part read my plan (minutes and small data plan) so I could use it at once.The data is FAST, I noticed it is about 3G+ or faster (where I live is no 4G or LTE). In fact the data was almost as fast as on my home WiFi so I am very happy about that! So I it is advertised as 3G, yet I ran a speed test on it and found that I am getting very great speeds for my data, I am very happy about this as it seems to be getting 3G+ speeds or higher! And also, the phone part of this makes very clear phone calls. There is a PHONE KEYPAD in this tablet for dialing to make a phone call, text, etc.There is a Micro Sim card slot that will accept a smaller Micro Sim card (like the Galaxy S4 and S3 size). This will only accept a GSM type of Micro Sim as AT&T;, T-Mobile or Straight Talk. For me, I use a no contract prepaid plan on AT&T; that allows me to buy a very small and reasonably cost data plan (I just need a small data plan as I use WiFi about 98% of the time).+ Screen Resolution/Weight/Size etc - The first thing I noticed is that side by side (comparing the Tab 2 10.1 and Tab 3 10.1 in weight and size is that the Tab 3 has same screen size, but overall size is a bit smaller and it is so much LIGHTER and easy to carry around than my old Tab 2 10.1! This model has a very colorful and vivid screen. In fact, I can now comfortably hold it in one hand to read a book in portrait, so I appreciate this Tab 3 of being less in weight! And I love the HOME BUTTON.Note: To take a quick Screen Shot, press the Home Button (and hold it down) and press the Power Button. You will hear the click of the camera. Your screen shot is in MyFiles under Pictures, Screenshots.This is so handy if you want to take a picture of say a quick map or something like that...+ WiFi Connection and Range - This tablet is AMAZING at how quickly it connects to my home router or other hot spots - just seconds! And there is a very strong signal on the WiFi on this tablet. So I went outside in the backyard and had 3.5 stars.+ OS - Jelly Bean 4.2.2 comes with this unit, I find very easy to use and this tablet is very fast in opening apps, going  to Websites etc.+ Ability to turn off the apps I did not want (helped my battery life). Did an actual test today to see if this made a difference and it did. After I safely turned off the apps that are safe to turn off, I now have more free memory and my battery life per hour has increased. So I documented this. If you have any questions about this, please ask in the comment section. Just a little tweak like this can really make a difference in battery lasting longer and better control over the memory etc.+ Internet & Webpage & Video Viewing - The stock browser does a great job, however, I use Maxthon Browser and installed archived flash so I have great internet flash video viewing results and it renders webpages quite fast for me. And I suggest the free app called Pocket from the Playstore so you can read internet articles later offline.+ Watching Flash Videos - This device does not come with installed flash, however, I found a workaround to solve this. So if you request it in the comments, I will send you instructions on how to installed Archived Flash so you can watch flash videos and what proper browsers I recommend for this tablet...The only browsers that I could get the Archived Flash to play on and well was Maxthon Browser or Puffin Browser for 2.99 in the Playstore.Other Browsers I use when not watching flash: When I want to NOT watch flash, I like Boat Mini or Opera Mini because they use LESS BATTERY and LESS MEMORY, but they are just quick and basic browsers.+ EXTERNAL SLOT FOR MICRO SD CARD up to 64GB - Note that this was one of the deciding factors that sold me on this tablet. *Keep in mind where External SD cards are concerned: They are JUST for your personal files: music, videos, photos, and other files. When you install apps from the Playstore or other sources, they store either in INTERNAL SD Card area or the main internal area.+ On-Screen Keyboard / Bluetooth Keyboard Stand I suggest - The on-screen one is so so, however, I use the OXA Bluetooth Keyboard and it basically turns my Tab 3 into a mini laptop as I can get some serious work done on this tablet (using Kingsoft Office for creating Word, Excel etc docs) with it and it types much like my regular laptop keyboard does so I love it! And it has an built in stand for my Tab 3 and it fits my other tablets. This lets me fold my tablet down in it and I keep them both in a 10 inch sleeve.If you want the link for this keyboard (it came from Amazon) and also I have another Bluetooth one I like with this tablet that uses AA batteries, but the OXA is by far the one I use DAILY!!!+ Bluetooth Accessories - The speaker on this tablet is pretty good. However, I use a very good mid sized Bluetooth Speaker with it to play my music and to watch my movies etc that also came from Amazon. The sound is superb with this Bluetooth Speaker. For best enjoyment of music, a Bluetooth speaker is recommended for this tablet. Let me know if you need my list of accessories for this tablet including Bluetooth items. Every Bluetooth item such as keyboards, speakers or headsets, and other Bluetooth devices, paired and connected to this device right away with no problems.+ Camera / Video Camera - Although I do not use this as a regular camera (no flash and low resolution), I went outside and took some very clear pictures, I was pleased with the results! Then I took some videos inside and outside to test this and they are much clearer than I thought they would be. So in a pinch, I will use this as as camera.+ Home Videos - The stock video player is OK and plays MOST home videos, however, may I suggest QQ Player (Free App from Playstore and the ONLY one I recommend as it plays every home video I tried).+ Reading/Creating/Editing Word, Excel, Text Files and much more on this tablet: This comes with a So So Office app (viewer) for reading Office documents, however, I STILL prefer Kingsoft Office which is a free app from Playstore. It is the best I have ever tried and I am very picky about so called Office programs. It is very compatible with MS Office as it reads, edits and creates Office files and reads PDF files, and it has more features of any other Android Office program that I tried. This app is a MUST have for tablet owners in my opinion.+ Music Player/Sound Quality - Stock player has clear sound through the outside \"speakers\" and very clear using headphones. To sync easily with Windows Media Player may I suggest the Playstore app free) WinAmp for the tablet as it is very highly rated and the sound is good, but I use a very high quality Bluetooth speaker for great sound! Suggestions: The best way to really enjoy music is through a high quality Bluetooth speaker or Bluetooth headset as the sound quality is superb this way and you can walk about your home listening to your music!+ Battery Life- Since I have done a few tweaks on this tablet, now I have found that my battery life is better than the first and even the second day. In fact, the battery life now I find that when I use WiFi just when I need it, I now get about 6 to 8 hours with it(this reflects 100 percent brightness however). Still this is better than I received on my older Tab 2, so I am happy.***Where battery life is concerned: To make your battery last as long as possible is to be sure to turn off BLUETOOTH AND WIFI when you do not need these. Both are these are memory hogs! Also, I turn off my GPS and even SYNC sometimes to conserve battery and then turn them on later.+ OTG USB Compatible - You can add an optional OTG (On the Go adapter cable to the Micro port for copying files to your flash drive and from your flash drive to the Tab Pro). You can also plug in a mouse, I tried it and it worked. *Note that portable external hard drives and portable DVD/CD drives will not work using OTG in the TabPro because these both require a lot of power to be compatible with the Tab Pro and most tablets that have the OTG. However, it is still good to know that you can easily plug in your flash drive and copy files to the Tab Pro and from Tab Pro to PC--what a time-saver.+ Bluetooth Speed and Performance - The Bluetooth keyboard I own (generic OKA) paired quickly with several devices and copied files at a great rate of speed. Speaking of Bluetooth: Also there will be Bluetooth keyboards out for the Tab Pro coming soon. (Just make sure you purchase one for JUST THE TAB Pro 10.1 size).CONS: (Just one con I found, however, this con is NOT the fault of Samsung)- New Adobe Flash is not supported; however, I found that archived flash gets the online videos to play. So I downloaded the older archived flash which gives me the ability to view many internet videos.Bottom line: Would I buy this combo phone and tablet model over again? Yes in a heartbeat as I love that it has a phone and data capabilities! This is a wonderful tablet and I like the fact that the OS looks like other Android OS like the S3 and S4 etc. Should you consider purchasing this tablet? In my opinion YES if you have Android tablet experience and want to have these nice pros!Well, I hope that this review has been of help to you and thank you for reading it. Also, since I am somewhat of a techie person, I will be happy to answer any questions you may have through the comment section.", "Date": "February 24, 2014"}, {"Title": "Money well spent!", "Author": "Orpheil D.", "ReviewID": "R1PH8M0A75EBYN", "Overall": "5.0", "Content": "Loving this product like wow! This is money well spent. My only regret is the battery life. This leaves a little to be desired. My co-workers have two other brands and this seems to be the worst when it comes to battery life, but what it lacks in that department it surely makes up for in screen quality and speed. Its extremely fast, though I'm a bit disappointed with the hard drive space (16GB). Yes, there is a slot for expanded memory but personally a 32GB would have been really nice.", "Date": "December 9, 2013"}, {"Title": "Love it", "Author": "bawklar", "ReviewID": "R2QJIKSNUEW2WD", "Overall": "5.0", "Content": "This is both phone and tablet. I am able to use T-mobile sim card. No issue whatsoever. 1gb memory is abit less. 1.5 like tab 8 would be perfect. no flash on the back camera. It is not a big issue since it is tablet. it is UNLOCKED", "Date": "April 17, 2014"}, {"Title": "Just great", "Author": "Salvador Covelo \"majua\"", "ReviewID": "R3KEVI6GEF1QE5", "Overall": "5.0", "Content": "Samsung does it again: I started with the samsung 2, went to the samsung three, then Note three and this samsung tablet is just great", "Date": "March 31, 2014"}, {"Title": "beautiful display, good speed, lightweight", "Author": "deberney", "ReviewID": "R26UI5FKQ67PBR", "Overall": "4.0", "Content": "I've had mine about 5 months now.  It is a good product.  Well made, stable.  The graphics/video on this are amazing.  It has the latest Android installed on it and it works flawlessly.The wifi on this isn't very strong.  My iPad can get strong signals in rooms the Galaxy can't.  When playing the same game on this and an iPad air, I notice a slight touch screen advantage with the iPad.  This is a nice product and it does everything I expect it to do without any delays or freezes.  I can watch Netflix on this without any snags and the video is very high quality.  There is a problem with using any video needing FLASH.  You do have to install third party app to view video that uses FLASH like Amazon Prime and a bit of Youtube.  The Youtube videos are hit and miss on this with pausing and starting.  Game graphics are stunning.  I haven't been able to get anything to print directly from this but Eprint is pretty easy to use instead of direct printing.  The Micro SD card is very handy.  I transport files back and forth from SD card.  Hooking up with USB to MAC was done with third party APP.All in all this is a nice tablet.  But, I do like my partners iPad, but it cost a lot more as well.", "Date": "February 22, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00E83AM44"}}