{"Reviews": [{"Title": "Nice Tablet", "Author": "Ivelisse and Paul Saylor", "ReviewID": "R15IZTEYGQ20MA", "Overall": "5.0", "Content": "This is a very nice tablet for the price.  My grandson is five years and autistic and he is enjoying using this tablet.It looks pretty sturdy.  I am considering buying several for my other grandkids.iarias", "Date": "December 17, 2013"}, {"Title": "BUYER BEWARE", "Author": "angie", "ReviewID": "R1ZJZG221U3SDK", "Overall": "1.0", "Content": "Do not waste your time or money. they sent me a broken tablet then told me to send it back and they would replace it...instead of sending me a replacement they told me that the tablet fell out during shipping and it was my problem. so, no replacement and no refund and between the cost of the tablet and shipping im out 100 dollars and my son doesnt have his birthday present. RIP OFF!!!!", "Date": "April 8, 2014"}, {"Title": "disappointed", "Author": "Claude Thomas", "ReviewID": "R3AOU8PZS3GOYD", "Overall": "1.0", "Content": "I ordered my kid's tablet since December.I never got it.All they to tell me was customs too it and they do not know when they will release it.This is April and nothing yet.No refund,nothing and no answer from then.Crooks nothing more.", "Date": "April 13, 2014"}, {"Title": "My 4 year old loves this", "Author": "Jason M Glasser", "ReviewID": "R151J32UBP0O5G", "Overall": "4.0", "Content": "I like it a lot , but it does not stay charged very long. Charge only last like 2 hour , if its being used.", "Date": "February 8, 2014"}, {"Title": "Great investment", "Author": "cynt", "ReviewID": "R2Y1FW6U92Q8VG", "Overall": "5.0", "Content": "I had this item shipped to my grandson and he has not put it down.  He called me to say Gammie thank you so much.", "Date": "March 28, 2014"}, {"Title": "Beware Beware Beware", "Author": "Mel", "ReviewID": "R376A0ZRZ953JF", "Overall": "1.0", "Content": "Do not buy this tablet!!!!!! Whether its for a kid or not! I recieved my tablet the beginning of feb. it is now the beginning of march. My son has this tablet and was hardly using it because he's in school and only allowed him to play with it on the weekends. Now the thing wont charge or come back on. Besides that it doesn't hold a very good charge.... and the two halves of the tablet started separating from eachother. You get what you pay for guys. If you want something that's not going to last that long go for it. These things are very cheaply made and you can tell.", "Date": "March 11, 2014"}, {"Title": "Not what I thought", "Author": "Pjochuacs", "ReviewID": "R1TSR9TDMR6EF1", "Overall": "2.0", "Content": "This tablet was not very good. It takes a long time to boot up/turn on, very slow, my little brother is still using our smart phones...", "Date": "February 16, 2014"}, {"Title": "Childrens tablet", "Author": "Neu", "ReviewID": "R2Z65SQYWR9D0N", "Overall": "5.0", "Content": "Was very pleased with tablet  once it arrived.  I felt it took too long...my grandson did as well.  I was made a little anxious because it wasn't being shipped or tracked by Amazon.  Not certain I would use again, although my one year old grand daughter might make me eat my words!", "Date": "January 31, 2014"}, {"Title": "GREAT", "Author": "merrylyn phillip gulston", "ReviewID": "R2XIG8QKPG0U5J", "Overall": "5.0", "Content": "THIS WAS A GOOD NO GREAT CHOSE MY NIECE DONT WANT TO PUT IT OUT OF HER HAND WE HAVE TO TAKE IT WHEN SHE FALLS OF TO SLEEP", "Date": "December 29, 2013"}, {"Title": "It's ok", "Author": "Ingrid Duncan", "ReviewID": "R3B0YLJBJQD53R", "Overall": "2.0", "Content": "It's ok very slow can't seem to download much I would not recommend break very easy my sun is very frustrated", "Date": "February 15, 2014"}], "ProductInfo": {"Price": "$130.00", "Features": "7 inch 5 Point TFT LCD Capacitive Screen, Resolution: 800*480.\nCPU: Rockchip rk3026 Dual core, GPU Mali400, support 3D Gaming.\nRAM 512MB, ROM 4GB.\nOperating System: Android 4.2.2.\nDual camera: Front 0.3MP; Back 0.3MP.", "Name": "AFUNTA AF704 7-Inch Kid Tablet PC Android 4.2 MID 4GB HDD Dual Camera Dual Core CPU Wifi External 3G for Children Christmas/Birthday Gift (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/51ZL23PDGyL._SX300_.jpg", "ProductID": "B00EB8JSYQ"}}