{"Reviews": [{"Author": "Andrea Polk", "ReviewID": "R38PQZIQE29D51", "Overall": "5.0", "Content": "This model originally came out in March of 2012, but 'Certified Apple Refurbished' is the key here.  It's like brand new for less.  New accessories; 30-pin connector and AC adapter are included. You plug in the USB end to the AC to charge the iPad, and the USB to your PC or Mac to sync.  1 year warranty from Apple (90 days phone support and 1 year system/hardware), is identical to the warranty offered on brand new models. The iPad looks, feels and performs as new'.  (NOTE: Purchasing on Amazon you also are given the opportunity to extend your warranty with a tablet protection plan, for just under a hundred extra.)I purchased one directly from Apple, and then a second one for my Mom.  I intend on buying a 3rd one for my daughter.  They are THAT good! Why pay more for 'brand new' when certified Apple refurbished products are available, and equally high in quality and performance?This model uses the 30-pin connector instead of the latest lightning connector, which for some is an issue.  Frankly I prefer the 30-pin for its durability and for all the cool speaker docks and chargers that use the 30-pin which are now on sale due to the lightning connector coming out. Sony ICFCS15iPBLK 30-Pin iPod/iPhone Speaker Dock for example.Out of the box go to Settings-General-Software Update, to download and install the latest operating system: iOS 7 (which was released last week).  Some cool features like swiping up from the bottom to have a control panel for most used settings, and the addition of iTunes Radio (accessible through the Music app) are worth the upgrade to iOS 7.  In addition, you'll have the latest and greatest which ships on the new iPhone 5s/c.The screen is big, bright and clear (9.7\" size with 2048 x 1536 Resolution), and with 64GB of on-device storage space you have tons of room for all kinds of cool and useful apps, music and movies. You get 5GB of free iCloud storage as well, and can purchase more.  (I highly recommend frequent back-ups to iCloud; done in iTunes, in case your device ever needs to be 'reset' - the equivalent to being returned to out of the box.)Great sound comes out of the onboard speakers, but you can also pair it with Bluetooth (it has Bluetooth 4.0) speakers or headsets for expanding your enjoyment of the device.  I've enjoyed Netflix, Hulu Plus, Amazon Instant Video and music on my device this way and love it!With up to 10 hours of battery life - your screen brightness, whether location services are enabled, and apps used will all change useage times per charge - you'll be very pleased with how long the iPad 3 provides you with productivity and entertainment options.  I carry an external battery with me to recharge the device when I'm traveling.  Like this one: EasyAcc 12000mAh External Battery Charger Pack 4 USB Power Bank For iPhone 5 4S 4 3GS; iPad Mini, iPad 4 3 2; Android Tablets:Samsung Galaxy Tab 2, Note 8.0 10.1; Google Nexus 7,10; Acer B1; iPod; Android Smartphone: Samsung Galaxy S4, S3, S2, Ace,Note ...].The camera is incredible for both video (1080P video recording) and stills, and if you turn on 'My Photo Stream' in Settings-Photos & Camera, you'll automatically upload photos and video taken with your iPad to your iCloud account, for access by all your devices including your i-devices and PC.Mirroring (showing what's on your iPad's screen on your HDTV through a device like Apple TV MD199LL/A is great, especially if you want to stream movies from your iPad to a friend's HDTV.I also recommend these accessories: Snugg iPad 4 & iPad 3 Leather Case in Black - Flip Stand Cover with Elastic Hand Strap and Premium Nubuck Fibre Interior - Automatically Wakes and Puts the Apple iPad 4 & 3 to Sleep and Tech Armor Apple New iPad 4, 3 & 2 HD Clear Screen Protector with Lifetime Replacement Warranty [2-Pack] - Retail Packaging, to keep your new device protected.  I use both on mine, and give them as gifts - they're that good!I've enjoyed rock-solid performance with my like new Certified Apple Refurbished iPad 3, and I highly recommend this quality refurbished device, which is available in both black and white.Despite my whole-hearted thumbs-up recommendation, I would also suggest looking at your own needs and wants prior to your purchase so you buy the right iPad for you.Here are a few key points to consider before you buy.iPad 3 vs 4:The lightning connector (found on the 4th generation iPad, iPad mini and iPod touch) offers faster transfer speeds for uploads and downloads via this cable. That can be a big issue for some folks.  If it's a big issue for you or you think you want the slightly faster dual-core A6X processor (iPad 3's have a dual-core A5X processor) that the 4 provides, then don't buy this iPad, go for the Apple iPad with Retina Display MD512LL/A (64GB, Wi-Fi, Black) NEWEST VERSION. But you will pay more for only a slightly faster set-up.Other 4th generation changes are more subtle. Tweaks to the capability of the front facing camera (720P HD video with 1.2MP stills), are nothing special in my book as I tend to only use that camera for occasional Facetime - noticing the picture quality affected more by my Wifi connection than anything else.  There's an iSight 5mp camera (back of device)on both the iPad 3 and 4.If you have questions about the differences (more than explained here) go to the Apple site and look for a link to Support.  The tech specs for all their products are found there.", "Title": "Largest storage capacity, upgrades to iOS 7, like brand new for less", "Date": "September 25, 2013"}, {"Author": "Janelle", "ReviewID": "R2Q9A1ANU1T1WN", "Overall": "5.0", "Content": "Great deal on an iPad!  I was worried buying a refurbished ipad, but the discount was great and the Seller was fantastic to work with!  This includes all original accessories and packaging, basically it's a brand new ipad.", "Title": "Fantastic Deal!!", "Date": "September 11, 2013"}, {"Author": "Emmy", "ReviewID": "R2UAE077QPXJN8", "Overall": "4.0", "Content": "This was as advertised but I had concerns about the 3rd generation since it showed up as a 2nd generation in my charging app.  Went to the apple store and sure enough it was exactly as advertised. The only reason for 4 stars vs 5 stars is that you cannot purchase the apple care since the purchase date does not show up as YOUR purchase date but the date Vendor purchased it from Apple so you are already months into warranty.  Also iPad 3 does not support air drop to share files/photos. I would recommend this vendor.", "Title": "Good value and on time delivery", "Date": "October 17, 2013"}, {"Author": "Robin Skeen", "ReviewID": "R3Q8WY98NNSW5H", "Overall": "5.0", "Content": "I teach kindergarten and this has made me a better teacher. It works perfectly and looks great! This was a great purchase!", "Title": "My new favorite thing", "Date": "March 3, 2014"}, {"Author": "Daniel Nogueira", "ReviewID": "R2G8R2H8DGFX1Z", "Overall": "5.0", "Content": "I don't need to say too much. The product is awsome and it's like a brand new one. PERFECTO!!!! Love that.", "Title": "As NEW!!!", "Date": "October 11, 2013"}, {"Author": "Ray \"Ray\"", "ReviewID": "R1JMNISNQVMT1X", "Overall": "5.0", "Content": "It's packaged as brand new, and I upgraded it to iOS7, for 64G by 16G iPad4 price is absolutely good deal.", "Title": "It's brand new!", "Date": "September 21, 2013"}, {"Author": "kjw \"kb\"", "ReviewID": "R19TOAV87NMXWF", "Overall": "5.0", "Content": "New accessories, original packaging, and Apple certified warranty make this just like buying new....except the price. Enjoy the discount, great deal.", "Title": "Enjoy the discount", "Date": "September 11, 2013"}, {"Author": "Isaac Wilson", "ReviewID": "R3S30H1MJLIXX1", "Overall": "4.0", "Content": "Great, but I wish I had gotten it with 4G. I love everything else about it and I am not an apple fan.", "Title": "Great!", "Date": "November 7, 2013"}, {"Author": "Shannon M.", "ReviewID": "R58JEM4K4Z39N", "Overall": "5.0", "Content": "I purchased this same exact deal from Apple last year. I highly recommend checking out the refurbished products first!I was hesitant at first, but after doing a lot of reading, I took the chance on the refurb.  I haven't regretted my decision once. The only difference is the box the items come in. You get the same warranty as new products, yet save a substantial amount of money!The iPad is great!  It has almost replaced my laptop completely. I still have a desktop PC that I use for a few things (which I wouldn't give up), but you can do a lot on the iPad too!  I've tried other ppl's tablets, various brands, & AFAIC, nothing compares to the iPad.", "Title": "I couldn't live without my iPad!", "Date": "October 19, 2013"}, {"Author": "T. Stevenson", "ReviewID": "R180CJ3GUD4F91", "Overall": "5.0", "Content": "Excellent product.  This iPad works perfectly.  I previously owned three other iPads and this works just as well or better.  I also recommend this seller.  They were very responsive and my package arrived quickly.", "Title": "Great Product", "Date": "October 17, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00EYGMHY8", "Features": null, "ImgURL": null, "Name": null}}