{"Reviews": [{"Title": "A amazing tablet for the price", "Author": "Jesse Cortez \"psn- orlando29\"", "ReviewID": "R3EIN88F3IH29H", "Overall": "5.0", "Content": "FYIMy brother bought me this tablet for XMAS but he did get it from amazon.com.This tablet is amazing for someone who is looking for a great tablet for someone looking for simple video, movies, communication(facebook, tritter, skype, etc.) This is my first tablet and it is a good start for someone new to tablets who is looking to just pick it up and get right into it. It is preloaded already with your favorite and most used apps likeyoutube, gmail, google play, google maps, facebook, and tritter.I have not tried gaming yet but video steaming like youtube and netflix this tablet handle them great.PRO>Simple to use, great for beginners to tablet or smartphones looking to just get right into it.>It say's 3 hrs. video streaming but mine went up to 4 1/2 hrs. with a mixture of youtube and netflix videos which is not bad for a cheap tablet.>Different back panel colors, I think there are atleast 3+ back panel colors to choose from my brother got the white one which looks great.>Expansion slot, not sure it is a standard for tablet but it does have a memory card slot look's like a micro SD so you can increase your memory storage.CONS>The only con from a tablet noob standpoint is there is no volume buttons on the exterior tablet itself. You will have to do it in the tablet itself. Minor CON but just so you will know", "Date": "January 2, 2014"}, {"Title": "love it", "Author": "J.Hughes", "ReviewID": "R2O1SMXOS3TWCI", "Overall": "5.0", "Content": "I love my tablet unfortunately I dropped it causing it to open and the sensor strip ripped. I had absolutely no problem with this tablet however I do recommend buying a mini usb for it if you haven't already done so.", "Date": "May 16, 2014"}, {"Title": "I like it fine!", "Author": "Harold Dennis", "ReviewID": "RCZWCMD1JQDSN", "Overall": "3.0", "Content": "It is just have a little difficult to navigate thru the operating system. It will just take a while to figure it out.The greatest problem I have with it is the operating booklet doesn't show how get rid of things you don't want, etc!", "Date": "May 10, 2014"}, {"Title": "An excellent tablet!", "Author": "Jim Clark", "ReviewID": "R2WJOW8ZUP089O", "Overall": "5.0", "Content": "I ordered this tablet on recommendation from someone who owns a HKC tablet and is very happy with it. My expectations were more than fulfilled with this order.", "Date": "March 2, 2014"}, {"Title": "defective", "Author": "Revae  M.Houk", "ReviewID": "R19XBGKWHP888P", "Overall": "1.0", "Content": "not there fault I guess but was very disappointed and it wasn't what I thought it would be either returned for full refund and it was replace with better table cheaper tablet that I love and over night for free from amazon ,thank you very much amazon", "Date": "February 1, 2014"}], "ProductInfo": {"Price": "$199.99", "Features": "7\", 800x480, 16:9, capacitive multi-touch screen and Android 4.1 Jelly Bean\n1.5 GHz Dual Core processor with 1GB RAM. Front facing camera and Built in speaker\n16GB Storage - 5GB free cloud storage with Google Drive with Micro SD card expansion slot\nGoogle Mobile Apps Preloaded including Gmail, YouTube, Google Maps, Google Play Music, Google Play Books and Google Drive.\nBattery: 3600 mAH ~ 5 hours for music / 3 hours for video", "Name": "7\" HKC 16GB Dual Core Tablet with Android 4.1 & Google Mobile Apps & Capacitive Multi-Touch Screen P774A", "ImgURL": "http://ecx.images-amazon.com/images/I/41kdkBJajoL._SX300_.jpg", "ProductID": "B00E3JJZ5U"}}