{"Reviews": [{"Title": "GRAB IT", "Author": "Bill McLean \"Is this worth the price?\"", "ReviewID": "RYJJQQOL04SIQ", "Overall": "5.0", "Content": "I got my surface (refurbished) 64GB for only $199.00 including Prime free shipping.  It was just that - no case and no external keyboard.  I am delighted with this deal.  It looks and functions as new.  It truly is as advertised.  It is all the good things that have been published on-line, and only few criticisms are even a little true.  It is more than worth the original suggested retail price.  Grab it refurbished.Amazon is probably the best overall on-line retailers at this time.  But we must keep them honest.  There is always the temptation to grab extra profits.  So always shop around - even with local stores.  I pinch every penny until it screams.  You too should do the same.  Technology is moving fast.UPDATE: 03/26/14The best thing is happening:  Thoughtful people can now write, and have published and distributed, solutions for real world problems.  Not just for commerce, but also for science and everyday life. I am glad about Google, Amazon. And now even Microsoft.  More than a thousand apps are now available for Windows 8. The same for the others.  We can now shop for exactly the solutions we need.Suddenly the world is a better place.UPDATE: 4/25/14It just keeps getting better.  I'm astonished at the number and quality of free apps that are already available.  I now really believe that this is better than my 7\" Kindle HD.  64 GB and micro SD compared to 32GB, without extra memory card?  Big screen compared to 7\" Kindle screen?  Don't get me wrong, nobody better touch my Kindle, and I will be buying a future update with the larger screen and as much memory as possible.  And the same goes for my Surface.  Damn, I wish I were 50 years younger.", "Date": "March 18, 2014"}, {"Title": "great deal on excellent technology", "Author": "Michael C. Callahan", "ReviewID": "R2LSQ9U50I3WR5", "Overall": "5.0", "Content": "This was a great deal on our second RT surface tablet.  This one needed more storage because it's used for water master duties, including gate maps and real time measurements from multiple locations. Getting it refurbished got the price down to something we could deal with and it's performance has been outstanding - just like new!", "Date": "April 21, 2014"}, {"Title": "Love It", "Author": "jkg", "ReviewID": "R3LCO74J3V0VW1", "Overall": "5.0", "Content": "I can't say enough about it I use it for everything this the fastest PC I have ever had I love the look and the size.and it's built for people like me how drop everything. T is is something everyone should experience before buying there next PC or tablet.", "Date": "June 5, 2014"}, {"Title": "Surface", "Author": "Lara", "ReviewID": "R39FWCM5S6OTF0", "Overall": "5.0", "Content": "LOVE, LOVE, LOVE the Surface.It's is the best tablet and since it comes with \"Word\", it far surpasses the I-Pad!!", "Date": "May 21, 2014"}, {"Title": "Excellent  traveling compoanion.", "Author": "gbowersr", "ReviewID": "RSVNAAWZ3DFM4", "Overall": "5.0", "Content": "I chose Microsoft Surface because it was the closes small unit to a laptop with all the same functions. It was lighter and easier to use when on the go/traveling. The software and touch screen (Windows 8) takes a bit of getting use to, but once that's done the unit is ver pleasant to use. I was very pleased with the unit.", "Date": "May 8, 2014"}, {"Title": "It doesn't get any better", "Author": "rebecca smith", "ReviewID": "R2GAKJZAKACAQE", "Overall": "5.0", "Content": "I love my surface. It works great. The Best tablet I have ever used. If you are considering getting one. Do it. You won't regret it.", "Date": "May 1, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Microsoft 64GB Surface RT Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/41OWMQx2VGL._SY300_.jpg", "ProductID": "B00ET0H9R4"}}