{"Reviews": [{"Title": "great item", "Author": "SHIFAN WANG", "ReviewID": "R2NVBYFWMDRPFE", "Overall": "5.0", "Content": "The Seller delivers it very quickly as well,I got it just in 2 days.Works great and a good compact size.The screen onit is clear like a lead. The speed of the tablet is faster than my Acer A100.The tablet does have full access to the Google Play store and I have not found any app that isn't compatible yet.Android 4.2 is a powerful OS and the tablet it's self as far as the hardware is a solid buy at 60$.I have had zero complaints. Down loaded several games. They have played well. No issues.This tablet is light. My kids love it. It has exceeded my expectations.I would recommend  it to anyone who is looking to purchase a nice tablet.", "Date": "April 6, 2014"}, {"Title": "Great Tablet for a Great Price!", "Author": "L. Evans", "ReviewID": "R1HG1FJG1MDGLL", "Overall": "4.0", "Content": "This is a nice little tablet...everything works great!  It is very fast & has a lot of apps...now I only wanted it for email, Facebook & Netflix but I am able to do a lot more. The only drawback so far is that the battery doesn't last very long but it does charge real fast. If you are looking for a small tablet just to do the basics and still have some fun this is it.", "Date": "May 27, 2014"}, {"Title": "just as expected and very quick delivery", "Author": "Loretta Griner \"Lolly\"", "ReviewID": "R2M2EP55IEVP91", "Overall": "5.0", "Content": "This tablet is just what I wanted and it was delivered quicker than any other merchant could do.  I read the other reviews and was encouraged by them so I do believe in the review process. Thank you for your quick, courteous purchase.", "Date": "June 8, 2014"}, {"Title": "Pleasantly surprised.", "Author": "Joseph Lee", "ReviewID": "R3M5JROV69KJLE", "Overall": "5.0", "Content": "For the price I really expected much less. The OS, like any OEM installed OS needed some tweaking but that's normal. The installed file manager is function-free. Unlike most Unix clones, connecting to the www is quick and painless. It works as well as tablets costing hundreds.", "Date": "June 5, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00E9TN5PU"}}