{"Reviews": [{"Author": "luis quitumba", "ReviewID": "RHWHXVVLFPHA4", "Overall": "5.0", "Content": "All i was waiting for my kid, and I suggest to everyone that's looking for something similar to stop the search cos Kurio 7 is the best choice", "Title": "Mr.", "Date": "April 27, 2013"}, {"Author": "Luis", "ReviewID": "R2KYHWBB7YTTF0", "Overall": "5.0", "Content": "The Kurio 7 Tablet is by far one of the most amazing tablets I have had the honor of purchasing for my kids! They are able to play on it for as long as I allow them with the wonderful time management feature and the parents controls allow me to dictate what and what they cannot see! =] Not to mention the 100s, yes you read correctly HUNDREDS of free games allow me to save money on all of the games that can entertain my kids. This product is very cost-effect. I am thoroughly happy with my purchase!", "Title": "Amazing!", "Date": "January 28, 2013"}, {"Author": "April Williams \"Best Guess\"", "ReviewID": "R3UFGL6I69SWF8", "Overall": "5.0", "Content": "What a great little tablet!  My daughter got both this and the LeapPad 2 for Christmas.  I must confess playing with this a little more than she has (perhaps she'd play more if I let her).  ;)Set-up and user profile management is a breeze.  In no time, I'd logged into the Kurio store and downloaded a whole batch of free games...all FREE.  Contrast that to the very limited apps pre-loaded on that LeapPad 2, coupled with the additional $15 I paid to add five more games.  The prices on those LeapPad apps are pretty outrageous when I can get that and better on Kurio for free.The Kurio is wireless ready and is rechargeable (just plug it up at night like a giant cell phone).Had I had it to do all over, I'd have bought the Kurio and left the LeapPad 2 at the store (then again, what would my daughter play with when I have her Kurio).", "Title": "I'm stealing this from my kid...", "Date": "December 27, 2012"}, {"Author": "maegan l lufkin", "ReviewID": "RXRUQYXF25WD2", "Overall": "1.0", "Content": "I would give this product negative stars if possible.  We originally purchased on  11/12 as a Christmas gift for my son at Toys r us.  I read both negative and positive reviews about it.  And they seemed similar to all the other kids tablet on the market.  We decided on this tablet because it could get the amazon app store.  All the other tablets had device specific stores only.  Soon we will be on our 4th device.  1st was dead right out of the sealed box, second one died 2/3 wouldn't take a charge.  Kurio sent replacement received on 2/14.  Device was glitchy after only 24 hours then all the amazon apps had problems.  I followed the previous advise from techs about correcting the amazon app store, but end up having to uninstall amazon app store.  I could not get it to reload.  Called tt amazon tech support no luck.  Contacted Kurio and they can not resolve issue either, and I am still having to fight to get the device replaced under warranty.  Bottom line look at kindle fire almost the same price.  with proven amazon product and support.", "Title": "PLEASE DO NOT BUY THIS DEVICE!", "Date": "February 22, 2013"}, {"Author": "mitch", "ReviewID": "RVOIGEMG8UPY4", "Overall": "1.0", "Content": "i am gutted bought 2 of these 1 for each of my children, did loads of research, looked at user manual before buying, customer reviews which at the time were good, looked at the apps that could be downloaded from amazon and number 1 market seemed a good buy.i have taken 2 of my daughters back and exchanged them and finally finding out the shop had sent the whole batch back to kurio as they were faulty. both kurios are that slow its painful, the apps don't always load if at all the meegenius never works even after several times in contacting customer support and following their instructions, the internet protection settings you have to go through about 4 times for them to save, it loses wi fi connection all the time, i could carry on but i think you get the jist", "Title": "disappointment", "Date": "September 26, 2013"}, {"Author": "LaShanda Jordan", "ReviewID": "R1UH13FMLA835Y", "Overall": "3.0", "Content": "It's a nice tablet, but I bought it for my 7 year old son and he hates it. He cannot download the games on it that he wants. So it has only been used twice since it came for Christmas. I guess I should have read up on the product a little more.", "Title": "Disappointed", "Date": "March 25, 2014"}, {"Author": "Lillian Elliott", "ReviewID": "RXZ6WX8DEJDFD", "Overall": "4.0", "Content": "Because my daughter really enjoys it, she can't get on the internet without my code, there's a lot of games to enhance her math and reading skills, and it's just the right size for her.", "Title": "I like this tablet alot", "Date": "March 24, 2014"}, {"Author": "sandria berry", "ReviewID": "R7KL5OKCF928G", "Overall": "4.0", "Content": "This product was on time in good packaging. I was happy to see that the case that came with it was a good sturdy case. I love the parental account so that I am able to monitor what my  daughter can view on the web and able to choose age appropriate apps! I love that it cam preinstalled with apps already to go. I also like the fact that more then one profile can be added. The camera is not the best but good enough for my girls", "Title": "great", "Date": "March 23, 2014"}, {"Author": "Misius P \"Misius\"", "ReviewID": "ROGNB1FA1Z13P", "Overall": "5.0", "Content": "Excellent value for the money.  Just as fast as many of the 200 dollar tablets that are out there. The kids mode is very good and granular. I can choose which applications are visible to each of up to 8 profiles. The parent mode is just plain unrestricted Android access.  And with the recent update to allow Google play makes it even better.", "Title": "powerful kid's tablet", "Date": "March 22, 2014"}, {"Author": "Charles Lowe", "ReviewID": "R1VOKX9239R2JD", "Overall": "4.0", "Content": "This was the first Tablet that I have ever purchased.  It was purchased for my daughter for Christmas 2013.  Initially I was going to buy the 7s, but once I saw the 10 inch it was a done deal.  I have since bought an IPad Air for my wife as well.  The IPad Air my have a better cameras etc, but I haven't found anything the IPad Air does that the Kurio 10s can't.ProsGreat parental controlEasy to setup your child's accountKurio made good on their promise that they would support Google Play and they didSupports Google PlayCan connect up to HDTV via HDMI mini cable, sold seperatelyDecent resolution for AppsAppears to be fairly sturdy, my daughter has dropped it on several occasionsDecent price for a 10 inch screenCons:Camera is not all that great, but I knew what I was getting before I bought itBattery life doesn't compare to my IPad AirCharging port needs to be handled with caution, I have already had to exchange due to the charging port not working.  As long as an adult is plugging or removing the charging cable it should be okDoesn't support bluetoothOverall, I would recommend this tablet.  Everyone in my family has used it and we all enjoy it with no issues.  I would highly recommend getting a screen protector.  They can be a little tricky to line up and get perfect placement.  I bought a package of three, the first one I had to peel off and try again.This tablet supports Google Play, which really opens up the game selection.  Google is a recent upgrade available for this tablet.  I have not had any issue with any Apps, I installed Sykpe and my daughter loves it.  It works perfectly even with a low resolution camera.I paid $149 for this tablet at Toy R Us.", "Title": "I like the Kurio 10s Tablet", "Date": "March 18, 2014"}, {"Author": "Lisa Thomas", "ReviewID": "RAO7U6YH2SAR6", "Overall": "5.0", "Content": "Great gift for children, love the time limits and parental control. Charges easy and quick. My son plays with it for hours which is good because I loaded it with educational games.", "Title": "Great", "Date": "March 17, 2014"}, {"Author": "Loyd", "ReviewID": "R1P1XBIQWFRUX1", "Overall": "5.0", "Content": "I am pleased with the Kurio.  I looked around town at several of the tech stores and toy stores and couldn't find a device that does what I was looking for.  My Grandson was extremely pleased because it was loaded with his favorite game - Angry birds.  He's 3 and can operate the Kurio extremely well.", "Title": "Kurio Touch 4S", "Date": "March 12, 2014"}, {"Author": "Teresa Salmon", "ReviewID": "R3ARZG1Y0WEF6H", "Overall": "3.0", "Content": "We actually bought it for our 2 yr old granddaughter. She has already cracked the screen even though it has a pink otter box rye case on it. We got it because she is constantly screaming to play w our cell phones which results in her calling people. Deleting things ,taking pictures and last but not least. Dropping and throwing our expensive cell phones. So this is her phone. She was not fooled by toy cell phones. We bought 5 or 6. This does fool her! She loves it. Plays little games on it. Loves the talking cats and bursting bubbles games. We are sending it back for replacement. But it was great till she cracked it! Was not screaming for our phones anymore! Hopefully can get another.", "Title": "Good for price", "Date": "March 6, 2014"}, {"Author": "cheryl bernstine", "ReviewID": "R35UIKJ8RQU4JJ", "Overall": "5.0", "Content": "bought it for my 6 year old grandson he loves it and easy for him to use i would recommend it", "Title": "kurio7 tablet with 8gb memory 7", "Date": "March 6, 2014"}, {"Author": "connie neaves", "ReviewID": "RCEH9LTJA7YYG", "Overall": "5.0", "Content": "Highly recommend this product for family ..... kid control #1 & totally problem free device.  Best hands down. You will love this product.", "Title": "kurio kids tablet", "Date": "March 2, 2014"}, {"Author": "Lori \"cats12188\"", "ReviewID": "R14N2BIXG11OLB", "Overall": "2.0", "Content": "I purchased this thinking it would be sturdier than other tablets. I also loved the idea of the parental controls. Well after a week, the screen was malfunctioning. Not really sure what happened but my son denies that it was dropped, stepped on etc. He is 7 so who knows. I am in the process of discussing how to get a replacement w/ Kurio. Parents beware. It is still a tablet that needs to be carefully handled. Don't be fooled by the bumper.", "Title": "not as kid friendly as I had hoped", "Date": "January 10, 2013"}, {"Author": "Francesca", "ReviewID": "R23QZPN1RW9BKV", "Overall": "1.0", "Content": "Poor tech support.  Only via live-chat.  I'm rather computer savvy and couldn't understand how to install system updates.  Finally, I was told to return the unit for replacement at my shipping expense.  The unit didn't even make the one year warrantee.  Very small battery life.  slow processor... etc.  ZERO STARS.", "Title": "DO NOT PURCHASE!", "Date": "September 14, 2013"}, {"Author": "DONETTE CHAMBERS", "ReviewID": "RLMKOB5279Q4O", "Overall": "1.0", "Content": "I like the kids friendly features,the protective bumper. Every month a different problem quite often it will not go on the Internet,recently the keyboard is not coming up. It is unfair to the customer to pay each time to send it to the manufacture,at the end of the manufacture's warranty courier service will add up to the cost of another Kurio. Do not purchase this product before you read the reviews and try to look deeper into the negative ones they are the true reviews that will help you make the right decision.", "Title": "It is crapy", "Date": "March 7, 2013"}, {"Author": "Mama \"Mama\"", "ReviewID": "R2LQPI8CXDNKUS", "Overall": "1.0", "Content": "My daughter (10) saved for this for a LONG time.  It arrived yesterday and would not connect to wifi at all.  I called customer service only to be rudely told I must be doing something wrong!  The rep told me I had to send an email for help they have no tech support!  I explained I just wanted to return it at this point since I had an issue right out of the box and they were unable to help.  She was rude and I asked for a supervisor who refused to take the item back until I had 6 emails from them attempting to fix the issue and informed me I would have to pay to ship back and would not get a refund on tax or shipping and could take up to 12 weeks to get a refund and then she HUNG UP ON ME!  At a loss I emailed for help and the first email I got after explainingy problem started out \" obviously you are incorrectly...\" I emailed back and got the same form letter back!  I did get it connected thanks to MY Internet provider and its not all its made out to be very confusing for a child but am keeping since I would only get about half my money back after 3 months!  Pass on this item get a kindle fire!", "Title": "Horrid customer service!  Skip it!", "Date": "February 7, 2013"}, {"Author": "Teresa Link \"Miss Shopper\"", "ReviewID": "R1R3DTQIUJ0N0R", "Overall": "1.0", "Content": "WE bought this tablet and were so excited to get it and try it out. I bought it in November and tried to get it set up before Christmas so ti would be ready to go. No Google Play store was a huge drawback for us. But there is suppose to be the Kurio Store to get new apps from and Amazon App Store. Neither of them work. Upon contacting Kurio, they say the Third Party (SlideMe) is the app provider and they are having problems. They had NO answer as to why the amazon app store never works either. I didn't find all this out til Christmas day when nothing would work as it was suppose to. I cannot return it to Amazon since it wasn't DEAD ON ARRIVAL so I am left with my only recourse being dealing with Kurio. I am not a happy camper. I wish I had just gotten a kindle fire. $199 buck down the tubes if Kurio won't back their product.", "Title": "Very poor", "Date": "December 26, 2012"}, {"Author": "Dawn Jackson", "ReviewID": "R1IK4729QCTJ7Z", "Overall": "1.0", "Content": "I bought 2 of these, one for each of my boys (age 2 and 5). I have to say I am less than impressed with them! Although they have stood up to my 2 year olds throwing them around (very sturdy and no cracked screens yet, I really wished we had picked another system for our boys. So far they've lasted 4 months and still going although I'm tempted to throw them out the window at times. Save your $150 and buy something else.The good:*Sturdy and come with a rubber case to protect them from being thrown around.* A good selection of games to download for free. I chose these over a traditional gaming + cartridge system because the games get so expensive. Lots of free apps/games here to download (also one's you can buy too) My kids love the free angry birds apps!The bad:*BATTERY LIFE is tiny. I think we've rarely gone more than an hour or 90 minutes without the device going dead. Really inconvenient when you're about to take them on a road trip into town and you forgot to charge the battery for one of the. My boys argue over the one that still has battery left in it....that's why we bought 2 in the first place! Grrr!*Takes forever to load to the home screen. It takes at least a full 2 minutes before it's in play mode on the home screen and to a 2 year old that is an eternity!*also is not very user friendly to set up. It kept asking me to register the device and complete the setup. This included inputting my home wi-fi password and setting parental controls, email address, etc. Until I competed the setup my kids had to keep handing them back to me to get them to the home screen so they could play the games. Very annoying.*Once I did get the devices set up, then they automatically go to the \"kids friendly\" screen while my kids started out using the alternate (non-registered) screen and they don't like the kid screen. In order to get it set up on the alternate screen I have to enter the password from the parental controls EVERY TIME my kids want to play with them. Again, very annoying!!!****The most annoying feature of all is when I attempt to enter the password for the parental controls, the device somehow enters phantom characters while I'm trying to enter the password. Totally messes up the password entry and I have to delete and start over. I've had to do this many times and this is where I wanted to throw the device out the window. I try to type something like \"2345\" and it types \"2_djfkla;j\" sometimes there's 3 characters for every 1 I actually type into the on screen keyboard.And done. Never again! I should have read Amazon reviews before I chose a device for my kids. These were an impulse buy with much regret! This is what I get for not having a smart phone and being able to check online reviews on the spot!", "Title": "Stay Away!!! Buy a different kids gaming system!", "Date": "April 23, 2013"}, {"Author": "Teacher55", "ReviewID": "RXCXYX1LSOB74", "Overall": "4.0", "Content": "I thought the Kurio would be the right tablet for my kids.  Although it was a bit frustrating to set up, my kids do seem thoroughly entertained by it.  They love to play the built-in apps, but I wish they had full access to android market. Most of the games are typical apps. like Angry Birds etc., but there are some cute educational apps like Nussbaum teaching apps which I use in my actual classroom sometimes. My kids liked the boxing app where they could practice adding and subtracting numbers, although the touch-screen can be less than responsive.  Wish there was a greater selection of these learning apps.", "Title": "Kurio", "Date": "July 20, 2012"}, {"Author": "Dr.Remulac", "ReviewID": "R1MBH1S4HYITYV", "Overall": "1.0", "Content": "my daughter got thtis for her birthday literally used it maybeeeeee 20 times within 3 months , it will not charge, it will not power on, ive tried different outlets and still nothing . I have emailed kurio support at least 5 times  . the first time the rep tell me stick a paperclip in the hole and I did that and nothing the second time I replied that ive tried that and im still waiting for a response  the third time I resubmitted my plea and the 4th and 5th im just begging to hear anything from that company at all.  do not buy and if you received this as a gift just tell the person if you can kindly exchange it for different tablet", "Title": "SUCKS BIG TIME AND KURIO SUPPORT IS HORRIBLE!!!", "Date": "November 24, 2013"}, {"Author": "Elizabeth21t", "ReviewID": "RH64SEOCPFBYF", "Overall": "1.0", "Content": "My mom bought this for my son and TWICE we have had to send our device back due to the charger not working BOTH times.", "Title": ":((", "Date": "October 12, 2013"}, {"Author": "Betsy Tennant", "ReviewID": "RRWSU3NE25KED", "Overall": "1.0", "Content": "My daughter got one for Christmas (she is 10) its HORIBLE! For littler kids it would be fun. She HATED it, we returned it to toysrus.", "Title": "HORIBLE!", "Date": "January 25, 2014"}, {"Author": "Tracey Brewer", "ReviewID": "RRJOC4ON0W28O", "Overall": "1.0", "Content": "I paid 100$ for this and day one the charging cord fell apart. It no longer charges or updates the sad slot shot the card out hit me in the eye I had to go to ER! Really safe for kids! It's useless! Good luck getting any help from them I tried 3 live chats and 7 emails! I've gotten no where! If anyone knows a phone number or the real manufacturer of these rip off kings please let me know ASAP!", "Title": "Junk!", "Date": "January 21, 2014"}, {"Author": "sopharin may", "ReviewID": "RFRTGN0DTN4WA", "Overall": "1.0", "Content": "Been only a month. My son played it only on weekends so that's about 6 use? Turns on but the screen is blank. I'm not going thru the hassle of returning n trying to get it replaced.. Over all.. Will not be ordering ever again", "Title": "Waste of money", "Date": "January 21, 2014"}, {"Author": "Brent Malley \"OpmgruV\"", "ReviewID": "RDN0SO7CC9OMB", "Overall": "3.0", "Content": "We ordered this for our son for Christmas.  The first day we took it out the battery would not charge, so we contacted customer service (which by the way is only on line.)  They were very quick to respond, and asked us to send back the tablet, at our expense. They replaced it with a Kurio7s because the Kurio is no longer being made.  So the upgrade was wonderful!  Got the tablet out and charged it.  Worked great until it ran completely out of battery and we could not get it to turn on.  Read the directions and it is not to be played once it gets lower than 5% battery and can not be played while plugged in.  We had to hard reset the tablet, and it was only used for a few hours.  We sent it back to Amazon and ordered a Kindle for our son!!  He loves it.  The tablet seemed to have some fun games, and could be connected to the Google play store.  Keep that in mine when you are buying this tablet.  I am glad that we went with the Kindle Fire.  I am giving the tablet a 3 star rating because the customer service was wonderful!!!", "Title": "Great Customer Service.", "Date": "January 20, 2014"}, {"Author": "LaShondria Smith", "ReviewID": "R1K97FTXF9QOYT", "Overall": "3.0", "Content": "My 9 yo wants more apps available other than that great learning device and is fun as well. Get one", "Title": "need more apps", "Date": "January 19, 2014"}, {"Author": "tamara stubbs", "ReviewID": "R1D54RND3VRXOO", "Overall": "1.0", "Content": "The kurio is a good tool for a child but it freezes a lot when watching a movie sometimes it goes of and doesn't come on that out is a piece of crap I wouldn't recommend that any one purchase until they check the operation system on it again", "Title": "kurio", "Date": "January 17, 2014"}, {"Author": "L", "ReviewID": "R4EK2IWY7F1RM", "Overall": "1.0", "Content": "Got this from TRU for my daughter's birthday. She loved it -- until it completely died on her 2 weeks later and was an inconsolable wreck. She thought her pet cat (one of the apps, apparently) was dead, too. Great. Thanks, Kurio. Returned it and got the Samsung Galaxy Tab instead.", "Title": "Completely died after 2 weeks.", "Date": "January 15, 2014"}, {"Author": "lance taylor", "ReviewID": "R2UDOR10LPGN28", "Overall": "2.0", "Content": "I purchased 7 of these kurio for my grandkids for christmas and with not very much use two of them have allready broke the screen just goes black and will not do anything .I am going to have to send them back and see if they will replace them.", "Title": "Broken Kurio", "Date": "January 15, 2014"}, {"Author": "Patricia Clark", "ReviewID": "R3A3G2AVU5E632", "Overall": "1.0", "Content": "It arrive with crack/broken screen and unable to use.  I had to order another one because my grandchild was insistent on a Kurio Kids Tablet.", "Title": "Arrived broken", "Date": "January 13, 2014"}, {"Author": "pastor", "ReviewID": "R194V44ZGB6T09", "Overall": "1.0", "Content": "I bought this to replace one that was broken. But have had problems from the beginning with it. It never fully charged and was always needing to be plugged up. When I realized there was a problem it was too late to return because I had it for 3 months. It now sits in the closet until I can find some place to recycle it. Even took it out the other day to just see if could charge but would not even begin charge up. I am very dissatisfied with this seller and except for the fact that 1 star is the lowest rating possible there would be a negative in my book. I will not purchase any product from this place.", "Title": "did not work", "Date": "January 13, 2014"}, {"Author": "Unfortunately....", "ReviewID": "R1ZPBOSX8S0X0R", "Overall": "1.0", "Content": "Do not purchase this product, or anything from Kurio. I purchased 2 of the Kurio 7 tablets for my kids on September 20th 2012, within 1 month the Kurio interface no longer worked on one of them, and within 3 months the other will not charge or power on. The only way to contact the company is through email (which I have no received no reply) or through their \"live chat\", which you will never actually be connected to a representative. As far as the device goes, when it was working it was not a quality device, the touch screen isn't sensitive enough, you can not access Google Play, the Amazon App store runs poorly. the Kurio market is a joke, and adding new apps was painful to say the least. Save yourself some money and a headache, don't buy this.", "Title": "Garbage", "Date": "January 11, 2014"}, {"Author": "K Carr", "ReviewID": "R35PMYTZLAJD0", "Overall": "1.0", "Content": "Please do yourselves a favor and stop looking at the Kurio tablet and get a Kindle Fire for your kids instead.  The Kurio is a waste of money and energy.  The battery has completely died and the device will not power on after less than 3 months of normal use.  The graphics are sub-par at best and the interface is not very user-friendly even for adults.  I am currently trying to file a claim under the company's 1 year warranty, but they require a proof of purchase, which I don't have because the tablet was a gift.  While I wait and listen to my son ask me for his \"computer\" every other day, I have installed the Kindle Free Time app on my Kindle Fire and my son and I have been sharing it.  He is 2 and a half and can navigate easily between apps and books on the Kindle.  Save yourself the frustration and get a tablet your whole family can enjoy.", "Title": "Horrible product", "Date": "June 10, 2013"}, {"Author": "Thumbs up", "ReviewID": "R1MOPSN5E2KNE2", "Overall": "4.0", "Content": "Easy to set up.  Easy to connect to WiFi.  Easy to download apps.  Love that there is a time management setting.  Easy for my 6 year old to use and 'get around\" the tablet.", "Title": "Easy and Fun", "Date": "March 3, 2013"}, {"Author": "Angela Burris", "ReviewID": "R1LC0F5BEWDNO3", "Overall": "2.0", "Content": "I bought this item for my daughter for Christmas, I did enjoy the product, however, just ONE day after Christmas, my daughter went to take the cover off of the tablet, and her thumb cracked the screen, and then it stopped working completely! She is only five, so I don't believe the strength of a 5 year olds thumb, should be able to cause that much damage! So my opinion is, it just must be poorly made. I also did not recieve a charger for it, as stated on the box as included. I only recieved the USB cord, which it is possible to charge it that way, but it is not at all the intended charger, and as with all electronics, charging them that way, can cause damage to your product.", "Title": "Kurio", "Date": "January 16, 2013"}, {"Author": "Avid Customer", "ReviewID": "R2UEPOND9923K9", "Overall": "1.0", "Content": "This was a horrible purchase!!! We bought it for my daughter for Christmas less than a month ago, and as of January 10th, it is not working.  The screen froze and would no longer respond.  I tried the fix they suggested on the help site.  Didn't work!! The Amazon app store didn't work well on it, nor did most of the other programs.  It was very slow on the internet usage.  The idea was a great one, as it is oriented for kids, but their execution.... Really, I wish they had charged more money but made sure they put out a better product, because this one is a flop. Please, DON'T BUY THIS TABLET!!!!!!!  The Nabi has better reviews.  That maybe worth the money....Fuhu NABI NABI2-NV7A 7-Inch Tablet", "Title": "This Kurio is Horrible!!!!!!!", "Date": "January 11, 2013"}, {"Author": "Thomas D Greenwood", "ReviewID": "R2VZ37J66N3GYG", "Overall": "1.0", "Content": "We got rid of the Tabeo and was recommended to buy the Kurio.  It's horribly slow and the wireless connection cuts in and out all the time.  We are dumping it.", "Title": "Terrible Choice", "Date": "January 10, 2013"}, {"Author": "Dan", "ReviewID": "R2HYUOX5MIGLKZ", "Overall": "1.0", "Content": "A very very disappointing purchase. Aside from the apps pre loaded nothing works from downloading the Amazon & One Mobile App stores, to frozen internet connection, a shoddy camera and very limited app options in the Kurio Store.Poorly manufactured with buttons that feel loose. Feels cheap for more money! Clearly a strong marketing campaign but the product does not deliver and is a huge disappointment.Had to replace and buy son a Kindle Fire HD instead for less cost and better usability.", "Title": "Awful, Awful, Awful", "Date": "December 28, 2012"}, {"Author": "E. Hoffman \"That Guy\"", "ReviewID": "RBU964YUH5V9E", "Overall": "2.0", "Content": "I purchased the Kurio 7 for my son on behalf of his grandmother.From the start the device wouldn't work.  At first it wouldn't accept our WiFi connection, which is the first time I have ever had this happen.  I had to skip the setup and get in to the Android program to make the WiFi work.Then it wouldn't accept its own serial number which is printed on the back of the device.  I could have been getting the number wrong because they use a \"cutsie\" font that is't very easy to intrepret.Without the serial number I couldn't use there technical support, so the only other option was their \"live chat\".  I dealt with their live chat twice and found out that \"live chat\" doesn't actually do anything other than direct you to their e-mail based support.The E-mail based support didn't respond to my e-mails, and after getting back on their only other communications option...live chat...I was told that I must have done it wrong and to send it again from a different domain.To make a long story short, I took the device back.  There are way too many hassles to make it worth owning, when other manufacturers have very similar products.Epic fail as far as I am concerned.", "Title": "Failed to meet potential on all levels...what a waste", "Date": "November 16, 2012"}, {"Author": "Jody Byerly", "ReviewID": "R1AH4B48V6IAG3", "Overall": "1.0", "Content": "Do not waste your money! We bought these for Christmas 2013 and they are junk. They would not hold any of the downloaded apps. (We bought 2 one black and one white both had the same problem and both have been returned already) We bought them from Walmart and when we returned them they told us this is a common problem, with all the Kurio brand products including the Kurio Touch S4, the tablets and MP 3 players.", "Title": "We loaded ours 4 times and nothing stayed!!", "Date": "December 30, 2013"}, {"Author": "james silvey", "ReviewID": "RR0MP7ZL7J4TI", "Overall": "5.0", "Content": "My youngest has been asking for a tablet for some time but with the scary internet these days I wouldn't allow it but with this I can monitor his activities and can control what he does and see !!!!", "Title": "Great for kids", "Date": "December 12, 2013"}, {"Author": "Terry", "ReviewID": "R1FNLEQDPR10XD", "Overall": "5.0", "Content": "This was. Bithday present and our 4 year old loves everything except the blocks a nd tome limit(we love this part) it was easy to set up, we are working on downloads. It was a good buy. It was a little more,or cost more than a few other places. It was worth it! Other places tried to upsale,  etc, even on an online purchase. Simple, and it was done.", "Title": "Yay", "Date": "November 27, 2013"}, {"Author": "Zahra", "ReviewID": "R2CXFMBTCXHZFY", "Overall": "1.0", "Content": "Bought this for my daughter as a gift, she loved it for the two weeks before it just stopped working. The screen started to get disoriented then turned white then grey; before that, the apps stopped working. I'm so disappointed with this, especially seeing how much she loved it when she got it. I'd say forget the Kurio7 and go with the Kindle fire!", "Title": "Angry and Disappointed", "Date": "June 13, 2013"}, {"Author": "mountainbiker", "ReviewID": "R2NHZ73F8V0QNU", "Overall": "2.0", "Content": "tech support at Kurio is worthless all i wanted were the steps on how to download a game from the Internet for free. i guess they want you to pay for all the games. ill try to figure this out on my own and if i cannot they lost a customer and ill return it.18:39:46 Thank you for contacting us. An operator will be with you shortly...18:39:46 nick: how do i load a game from the internet onto my kurio?18:40:14 Operator Andrew H. joined the chat18:40:37 Andrew H.: To install additional Applications you would use the Kurio Store, 1Mobile Market, or Amazon App Store18:41:31 nick: can i load it from the internet? for free18:41:52 nick: from google?18:42:14 Andrew H.: I'm not sure what you mean18:43:03 nick: can i just go on line and find the game i want and load it?do u have a number i can call 4 help?18:44:04 Andrew H.: We do not have Phone Support. That might be possible but I do not know if it is or not. That would all be dependent upon how the maker of the Application has their software available.18:44:36 nick: what are the steps to try doing that?18:45:16 Andrew H.: I don't know. As stated we do not know if that would be possible as that is all dependent upon the maker of the Application. You'd need to talk to them.18:45:58 nick: how do i get on line to try and what are the steps to do it18:47:12 Andrew H.: You need to first connect to your Home's Wireless Network and then launch the Browser18:47:37 nick: then18:48:18 nick: do i click back to android?18:48:33 Andrew H.: No18:48:43 Andrew H.: Do you have a Wireless Network in your home?18:48:53 nick: how? yes its on now18:49:03 Andrew H.: How what?18:49:32 nick: how do i launch the browser18:50:30 Andrew H.: You press the Browser button on the Profile or in the Android Interface18:51:04 nick: so i press back to android button?18:51:20 Andrew H.: Sure yes18:51:36 nick: then?18:51:53 nick: just give me all the steps18:52:15 Andrew H.: Steps for what? I still don't know what it is you are looking for assistance with still as your earlier question that started all this I have answered18:52:28 Andrew H.: If you mean to get online you just launch the Browser like I have stated18:52:39 nick: look im trying to download a game18:53:01 nick: if you want i can just return this item18:53:08 Andrew H.: I'm aware and I told you that I have informed you how to obtain Applications.18:53:15 nick: you do not seem to know anything18:53:16 Andrew H.: To install additional Applications you would use the Kurio Store, 1Mobile Market, or Amazon App Store18:53:41 nick: let me talk to someone who knows something18:53:50 Andrew H.: I am the only one available and I do know the units.18:53:59 nick: im trying to load a free game off the INTERNET18:54:07 Andrew H.: I have answered the question on how to get an Applicaiton onto the unit. You use one of those three programs18:54:35 nick: who are you i will write the company18:54:47 Andrew H.: you are trying to get something DIRECTLY through the internet by using a Browser. That is NOT something we can help with as we DO NOT make that program and have no knowledge on it's distribution, programming, or compatibility.18:54:55 Andrew H.: \"18:54:47 Andrew H.:\"18:55:00 nick: you are of no help at all18:55:29 nick: i did not ask you to make a program18:55:34 Andrew H.: I'm sorry I can't help with something that we don't help with. I've told you you're SPECIFIC question is outside the realm of our support capabilities. All i can do is point you in a direction to get the assistance you need which I have done.18:55:46 nick: just how t down load it18:56:13 nick: ill make sure i blog how this company works18:56:29 nick: zero support18:56:33 nick: bye18:56:37 Andrew H.: How to download what? A game form a random website that we know nothing about?18:56:58 nick: from the Internet18:58:25 Andrew H.: Sir, you are asking me to help you obtain a completely different companies software from a completely different companies website (when using the internet you go to websites). That is NOT something we can do as we do not own that game or that website. As such we know nothing about them. You need to talk to the people who DO own the game and website18:58:34 nick: i have to go your wasting my time, u should be fired. you do not know anything18:58:43 Andrew H.: Have a wonderful evening sir", "Title": "kurio 7.0", "Date": "May 14, 2013"}, {"Author": "juanita", "ReviewID": "R4Y7KR32Z12AL", "Overall": "1.0", "Content": "for this to be 150 dollars it should not had stop working for all of that I would just have bought a reglar tablet for tha price But it had great games and educational games", "Title": "I bought had it for one month and stop working very upset", "Date": "February 17, 2013"}, {"Author": "tiffany", "ReviewID": "R2DRDOJ51F2TKC", "Overall": "1.0", "Content": "This tablet is horrible!!!! First noff let me start by saying I tried to ge this tablet to update for 3 hours and it would not do it!!! It tried to update from the computer and update over wifi the dang thing won't staed connected long enough to down load anything!!! Kurios customer care advice update it so it will stay connected!!! You can't update if you can't stay connected to WIFI!!! Needless to say it went back and I think it is a over priced piece of junk!!!", "Title": "What a shame!!!", "Date": "December 30, 2012"}, {"Author": "Kindle Customer", "ReviewID": "R2I00GZ91BKHB8", "Overall": "2.0", "Content": "It make sense to buy a brand new one instead, this one sames to have a problem it does not stay charge.my son has to connect it to the computer so that it can charge or stay on. next time a purchase brand new.", "Title": "Used items are not always a good choice", "Date": "December 29, 2012"}, {"Author": "noelle", "ReviewID": "R1LB9QOX77JOF", "Overall": "2.0", "Content": "Quirky interface, can't figure out how to connect to amazon app store.  I spent over 5 hours trying to figure this tablet out.  I suppose it would be fine if all you wanted to use was what is preloaded.  We liked the idea of the time management, but my 9 year old son wasn't thrilled with the apps.  So far I find the kurio to be useless.  We will return this immediately.", "Title": "Very frustrating", "Date": "December 25, 2012"}, {"Author": "Gabriela", "ReviewID": "R2H546I9QLHAGM", "Overall": "5.0", "Content": "My son got this tablet for Christmas and it never even worked we couldn't charge it better kindle firehdWe", "Title": "Didn't work", "Date": "January 20, 2013"}, {"Author": "radiograpy student", "ReviewID": "R74GIJ758IRUN", "Overall": "1.0", "Content": "I was looking at several kid friendly tablets for my 4 year old son. I was originally drawn to the kurio because it came preloaded with some of the games that my son likes such as angry birds, and cut the rope. The tablet was cute and the reviews were mixed but there were some good ones and for $149 I thought it was worth a shot. Luckily I decided to open the tablet and set it up for my son before i wrapped it and gave it to him and boy am I glad i did. First thing i noticed was it took a while to boot up. I wasnt too bothered by that because for the price i wasnt expecting it to be lightning fast. Next i went through set up. I put the wifi information in and it connected. After set up i tried to go to the app store and it said i was not connected to the internet. I set up wifi again and same thing happened. Finally i got technical support and they instructed me how to do it and keep it connected. It would have been nice for those steps to be in set up. Then i tried to download some apps and they wouldnt download. I kept getting failed messages. I tried to download the Amamzon store and got same problem. Back to technical support I went. They told me it was Amazon's problem and they couldnt help me even though apps from the KURIO store werent working either. That was the last straw and i took it back. I bought a NABI2 instead, It Is 1000 times better than the kurio and worth the extra money. The kurio was way too slow and their customer service sucked big time! GET THE NABI2 if you are looking for a kid friendly tablet!!", "Title": "This tablet is a waste of money", "Date": "November 24, 2012"}, {"Author": "jasen harviston", "ReviewID": "R33RWPA9VNP32M", "Overall": "1.0", "Content": "DO NOT BUY THIS IT IS JUNK!!! SPEND YOUR MONEY ON A I PAD MINI AND JUST PUT PARENTAL CONTROLS ON IT.", "Title": "NOTHING WORKS AS ADVERTISED", "Date": "June 19, 2013"}, {"Author": "Judith Garner", "ReviewID": "RH7AFY5OZAUGQ", "Overall": "5.0", "Content": "I chose to give this a 5 star rating based on the prompt delivery and excellent packaging. I purchased the Kurio Kids Tablet as a gift for a Christmas child...this was the only item he wished for. I was excited to receive it and wrap it for this special child.", "Title": "Kurio Tablet", "Date": "December 13, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00E8SDQY2", "Features": null, "ImgURL": null, "Name": null}}