{"Reviews": [{"Title": "Amazing Android tablet PC", "Author": "Anthony", "ReviewID": "R8FSE8XR9KYMJ", "Overall": "5.0", "Content": "This is the second android pad I bought. Fast response, good customer services, and shipped to me quickly. The package was pristine; everything is new and sealed: the screen has its original film protector (it was a little bit hard to notice the film at first. The film protector stuck to the screen perfectly; it’s like printed on it. And I think there is no need to remove it), and the wire is sealed in a bag, etc.I tested the performance with Antutu Benchmark app, and I’m surprised with its score: 11800! compare with my friend’s Google Nexus 7 scored 12540, my previous one (I think it’s A13) tablet scored 4000. All apps run smooth and fluent; I don’t really feel any freezes.Speaking of the video playback, it’s just superb. It has a UHD player installed, a really powerful player, which supports different formats of video files, like mp4, avi, mov, flv, wmv, mpg..........and UHD can play all of them without lags or freezes, it’s all fluent.The battery life is fair enough. Based on my test, it could last at least 5 hours on video playback, and my old one can last only 3 hours.Speaking of the Wi-Fi, the detection and connection is so powerful and flawless; it could search about 18 Wi-Fi hot spots, compare with my iPhone 5 only gets 3, in my office. Overall, it has the strongest and most stable Wi-Fi among my devices. I can always find signal anywhere in my house.What I love this pad the most is the standard USB port. I just realized how powerful it is after I tried my desktop PC’s keyboard, mouse on it. And even USB flash drive and my USB Portable Hard Drive can work it. Although it has a Micro SD card slot, I don’t need to buy any Micro SD card, I just feel more convenient with my USB flash drive. It also has a micro usb port, it can be used for charging (but I usually use the regular DC charging, I feel it charges faster that way)and data transferring. It’s easy to move files from PC.Also, it has two cameras, and of course, front and back. Compare with A13, the big improvement is that A23 has a flashlight with its back camera.It has Google Play Store installed when I got it, so I could download YouTube, Skype, Kindle, Facebook, Netflix, and games (clash of clan, worms 2, Angry birds star wars HD) from it, and it all works fine.The Android system is 4.2.2, and I don’t see anything wrong with it.For the screen is crisp and clear, and it works perfect: very responsive which can read all your finger touches, I didn’t feel any lags or freezes. I tried the HD games on it, and the pad has no problems run them; it displayed and performed all well.What’s the weakness? Of course, the display is not that good enough compare with ipad. The colors look a little bit pale from certain angles. So if you are looking for an ipad retina quality screen, this isn't the one. But considering of the price, i can accept that.I have to say that this A23 tablet goes far beyond my expectations, I mean it really exceeds all my expectations for this price. I would definitely recommend it.", "Date": "January 29, 2014"}, {"Title": "Big tablet--small price!!!!!", "Author": "funexnm", "ReviewID": "R1GTLMDQJ2PS52", "Overall": "5.0", "Content": "I have to agree with my fellow reviewer's comments about this product.  For the price, you cannot go wrong with this tablet.  It is fast and responsive and I haven't had it lag or freeze on me yet!!  I watch quite a few videos/movies, and the picture quality most certainly meets my expectations.  Connection to WiFi is a breeze and, unlike my other tablet, it stays connected. It is preloaded with all kinds of apps, some of which I will never use, but it's easy to customize your preferences thru google play.  Haven't tried the camera yet, but I expect it too will perform superbly.  So, if you are considering purchasing a tablet,  definitely consider this item", "Date": "March 5, 2014"}, {"Title": "Great for the price", "Author": "Donna Baker", "ReviewID": "R100QPJ2J9NO3D", "Overall": "4.0", "Content": "I like this tablet a lot. But I can't seem to keep the time current.  Everything else seems to work.  Camera is not great but for what I need it for it is sufficient.  Grand kids can use it and I don't worry about it as much because I did not pay that much for it.  It is sturdy and has survived several drops from me not the grand kids.  I would recommend it to anyone that wants to try an android tablet.  Great for your first android.  Wifi is good anywhere I go it connects spot on.  Never an issue with the internet.  Video is good from a wireless network that I keep in my pocket. I ran out of space pretty fast though with just a few apps but I don't care as long as my grand kids are happy and they have the games they want then I am happy.  I bought sd card (has micro sd connection) to load up games etc.  All and all it is good.  I will give an update when the sd card arrives.", "Date": "March 25, 2014"}, {"Title": "So far very good.....until a few days later", "Author": "Amazon Customer", "ReviewID": "R2CLFPV9MWXLV0", "Overall": "2.0", "Content": "I have only been using the tablet a couple of days, but it is meeting my needs and then some. I love the USB that actually works and is embedded in the tablet. No need for a dongle like I had to have with my galaxy tab 2 that cost 3 times as much as this. It even picks up my external hard drive and USB flash drive seamlessly!!!! So far I love it and its very budget friendly. I will update if anything gets better or worse. Will definitely recommend!!Update 3/27/14I guess I may have spoken a little too soon. The USB host mounts and unmounts on its own.  When I attempt to open an app that I installed, I receive a message that says the app isn't installed. I tried to bare with the subpar screen resolution, but it became intolerable since I would have to tilt the tablet at an angle to get a decent viewing. But for under 90 bucks, you get what you pay for. With technology, you take a gamble every time you make a purchase. I had to reduce the rating to 2 stars since the device does not fully function and I haven't had a week yet. So, I would no longer recommend it!", "Date": "March 22, 2014"}, {"Title": "My first Tablet", "Author": "Lorraine S.", "ReviewID": "R2GCQJ0PFM7I3Z", "Overall": "5.0", "Content": "It worked better than I expected and I am having fun with it. Not too hard to set up. I am a new tablet user with no experience and I figured it out without really looking at the directions. A really fun device and reasonabley priced for the product. I am not a heavy user, but it works just fine for my needs. Web browsing, e mail etc.", "Date": "March 19, 2014"}, {"Title": "Afunta 9 inch allwinner A32 dual core tablet", "Author": "Rosey Platinum", "ReviewID": "RM0BBNZRJA7T", "Overall": "5.0", "Content": "No problems. This is a great tablet has a lot of features nice size screen for viewing. I would recommend this product to anyone. Also the battery life is okay.", "Date": "April 4, 2014"}, {"Title": "Pleased", "Author": "Sally Jinkins", "ReviewID": "RRATO0PMDOO24", "Overall": "4.0", "Content": "We really like this purchase however it would of gotten a five star had it come with an instruction booklet and a battery charger. Otherwise prompt shipping and all and all it seems like a good tablet.", "Date": "March 18, 2014"}, {"Title": "Not even close to my Kindle Fire", "Author": "Jo Smith", "ReviewID": "R445TLXXJV3VO", "Overall": "2.0", "Content": "I am sorry I bought this tablet.  I have a previous edition Kindle Fire which I absolutely love!  I wanted something like it, but with more capabilities.  I read the reviews and did other research on this tablet and the price was good, so I bought it.  Right from the first day, when I couldn't get it to function properly, I was not happy.  But I kept plugging away at it thinking it was me and I would just get used to it.  That did not happen. My \"not\" smart android phone works way better than this tablet.  I have to have a straight pin stuck in the case at all times because I have to reset the tablet so many times to continue working.  I use it mainly at night now reading in bed.  But even doing that makes me unhappy because the screen is a little fuzzy and you can't adjust the text to make it darker.  There is a display control, but that doesn't do anything except make it lighter or darker...nothing to clarify the picture.  I am not one to return things, because I don't like a hassle, but every time I turn this tablet on, I think I should return it.  I would NOT recommend this tablet to my friends.", "Date": "April 25, 2014"}, {"Title": "Cheap but Cool Running!", "Author": "Fred Nolting", "ReviewID": "R3S0660FOPGJDT", "Overall": "5.0", "Content": "May be the steal of the \"cheap\" android tablet set. Lightweight body but does everything I've asked of it. Camera will be used for vacations & it runs all the Sports & movies I can watch. The sound volume is definitely for personal use, but that's ok. After adding beyond xbmc (yes, it can handle this), I can watch anything that my android TV boxes run. But this thing is small, personal & portable. Great for a traveler as a companion. Shipping was fast. A great product. A great (did I say cheap?) product.", "Date": "May 14, 2014"}, {"Title": "poor screen display quality, poor camera quality and no blue-tooth", "Author": "Tony Moore", "ReviewID": "R3ULV4MXSG9DSA", "Overall": "2.0", "Content": "I was quick to notice the screen  visibility was poor; small letters were very blur and had to zoom in to make them readable.  I also found out the camera was of pour quality when I tried to snap a photo of my daughter and could not get a clear picture.  The camera lacks in settings for resolution and picture quality.  The camera is nearly useless.  I set down with my son one night to transfer some music files to this tablet and found it had no blue tooth.  It was like \"what\" no blue tooth!  Very disappointed: i would not have bought it if I'd known all this!", "Date": "April 15, 2014"}, {"Title": "Not once BUT TWICE!", "Author": "Amazon Customer", "ReviewID": "R2YE8X6L668GCE", "Overall": "1.0", "Content": "I wish I can rate this a ZERO, but since one is next to zero I had to rate this a one even though the tablets I had received deserved a zero. I had made this purchase as my first tablet. First one was DOA!! The second one had 83% charge and I thought okay this is good now I will just charge it for 4 hrs and use it. Well I did do just that and like the first one I tried to get Google to be my home page and it wouldn't.. no matter what I tried to do it just wouldn't stay.. it would go back to the original Homepage. At least my mom's tablet (RCA) let her get to choose which homepage she wanted and it stayed. I so badly wanted to let this be the tablet I was going to own because I did like it for one reason or another but then BOTH had a bluish to purplish tint to it and the color just seemed off. The first tablet looked like someone had previously used it because when I got it.. it says that the battery was on for 14 days. The second tablet....  I let it charged while the tablet was off or so I thought (I had turned it off) and and took it off the charger.. I didn't use it at all until the next day. When I turned it on Thinking I will have a full charge since it hadn't been used or turned on for 24 hrs... The battery was down at 29%. SERIOUSLY??  So I ended up sending both back and am going to spend a few extra bucks and get me another one of a different brand.The one thing I did like about it.. it was fast and easy to use for a first time tablet buyer. Just had bad luck I guess", "Date": "May 26, 2014"}, {"Title": "TERRIBLE FOR PICTURES", "Author": "Miss T", "ReviewID": "R3JW0WC4P0HFC6", "Overall": "2.0", "Content": "I do not like this tablet at all. The directions on how to use it is not made clear at all. I love pictures and the picture quality is terrible in this tablet. It does not take good pictures at all and you have to jump through hoops to locate the pictures you take. It looks nice but is not what it seems to be. Not a good buy!", "Date": "May 16, 2014"}, {"Title": "so so and so", "Author": "Tanner Szanto", "ReviewID": "R2KIRH0GIJ0OEJ", "Overall": "3.0", "Content": "This is a decent little tablet for the price, however for me the viewing angle was too small and when held vertically each eye saw a different color which hurt to look at.  If you only plan to use it horizontally for movies and the like, go for it.The usb port eliminates the need for an otg adapter, but the tablet doesn't seem capable of connecting with midi controllers.On the positive, the seller does take pride in making sure you are satisfied with your tablet and will offer assistance if you aren't, so it's worth trying this buddy out.", "Date": "April 13, 2014"}, {"Title": "Very fast tablet", "Author": "SHIFAN WANG", "ReviewID": "R31BIO9ETQQDQI", "Overall": "5.0", "Content": "First of all,it was shipped to me very quickly, just arrived in 2 days.Google play app market is installed and works well.Decent battery life, it could last at least 5 hours on video playback.Applications are pretty responsive, never feel any freezesWifi signal is pretty good throughout the house, much better than my Iphone.1 speaker in the back,audio quality is pretty loud. Flash player actually works.There is the standard USB port,can connect to  USB keyboard or USB driver directly.Attached keyboard case fits well. Two cameras, has a flashlight with its back camera.This is a very nice tablet, for this price. I would definitely recommend it.", "Date": "April 6, 2014"}, {"Title": "great for the price!", "Author": "linda brinker", "ReviewID": "R3OD80DOMGP4FC", "Overall": "4.0", "Content": "Works great.  The wifi is quick and everything is easy to use.  Only problem i had was the screen protecter scratched after only a day.  Would recommend this for sure!", "Date": "March 15, 2014"}, {"Title": "Good for the price.", "Author": "Fernando Nogueira", "ReviewID": "RTW7M2A9OSFNR", "Overall": "3.0", "Content": "Good for the price paid,Battery lasts about 5 hours of use in videos and browsing the Web.The screen could have a better quality.Sometimes is necessary to restart to resume normal functionality.", "Date": "March 15, 2014"}, {"Title": "Difficult", "Author": "Shirley MacKenzie", "ReviewID": "R3KSTKH8STZ7DW", "Overall": "1.0", "Content": "Even though I have related experience on IPAD, two kindles and many computers, it has been difficult to use.  The instruction manual is such tiny print that I cannot read it even with readers and a magnifying glass.To be fair, I really have not put the effort into it I should.  After looking at it, I have tucked it away and just now have recharged it so I can look at it again.  AllI did attempt to search for an easier manual but was unsuccessful.  I will try again.a", "Date": "April 23, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EB8JPTY"}}