{"Reviews": [{"Title": "little pink tablet", "Author": "prestina milligan", "ReviewID": "RFX74JSKI7X0X", "Overall": "5.0", "Content": "This little tablet is great. Perfect size for my little girl.does what she wants it to do. She loves the color. Gets to download all her favorite games. Im glad i purchased it, it works well.", "Date": "October 19, 2013"}, {"Title": "Great product. The price is worth it.", "Author": "HAYDELUZ T.", "ReviewID": "R1Q4TQAWLVGOH7", "Overall": "5.0", "Content": "Great little tablet. The display is neat and colors are clear. the tactile screen is very responsive, and it is easy for kids to use.", "Date": "October 19, 2013"}, {"Title": "Love my Fast Touch !", "Author": "Connie Blackwell", "ReviewID": "R2ICZG86U5WYP9", "Overall": "5.0", "Content": "First off my fast touch came into the mail before projected date ! This Fast Touch is leaving the country to go to Mazatlan Mexico for a little girl. So getting it early made me feel the best to this company ! Second of all it is in my favorite color ! Hot Pink ! Yea...... This little girl can not speak English and she will learn from this Fast Touch. This is the second one I have bought.... My sister just loves it for camera being able to Skype me while I'm in Mexico and Belize ! I will be buying my 3rd one soon ! Love it, Love it !Connie", "Date": "October 8, 2013"}, {"Title": "love the tab", "Author": "artisia", "ReviewID": "R1S01LV1LKAS6B", "Overall": "5.0", "Content": "i absolutely love this tablet!! perfect size, perfect color and my5yr old loves it as well...plenty of apps....games...and the camera is great as well", "Date": "November 19, 2013"}, {"Title": "Awesome tablet", "Author": "Erin M. Brink", "ReviewID": "R3Q9RE8GT0FK8D", "Overall": "5.0", "Content": "This is a great tablet. My kids love it. It is an awseome tablet u can use for many things,and u get what u pay for.", "Date": "November 29, 2013"}, {"Title": "good for the price", "Author": "Amazon Customer", "ReviewID": "R3N0MQWZQB77LH", "Overall": "5.0", "Content": "I really like this tablet. Everting seems good. The speaker is pretty good as well as other stuff on it for the price.", "Date": "September 26, 2013"}, {"Title": "It's A Great Tablet", "Author": "Janet Johnson", "ReviewID": "R2KRXMSNQRP0Q7", "Overall": "5.0", "Content": "I am happy with it and they are the perfect size for little kids. The kids manage very well with this tablet.", "Date": "September 23, 2013"}, {"Title": "Great Tablet", "Author": "Jessica", "ReviewID": "R3RACCD80RLBK3", "Overall": "5.0", "Content": "Super fast shipping. I ordered it on November 22 and had it November 25. It is a Christmas present for my daughter. I have been playing around with it and downloading her favorite games and apps. Its a great little tablet for the price!", "Date": "December 3, 2013"}, {"Title": "Happy with Amazon, 88 Direct,  and the Android Tablet", "Author": "Billy J Short", "ReviewID": "R104RY3A4RKPSH", "Overall": "5.0", "Content": "I purchased this tablet for my granddaughter for her Christmas present,  When I received the tablet, I attempted to turn it on to insure that it worked.  The tablet would not turn on.  I contacted 88 Direct,  the provider of the tablet and spoke with one of their customer representatives.  I explained my problem and she gave me a couple of suggestions for correcting the problem.  I tried her suggestions and the tablet still did not power up.  I called back and got the same representative and explained that I was still having the problem.  She asked that I return the tablet and they would replace the tablet with a new one that did work.  I returned the tablet and explained that the tabled was to be a Christmas gift and requested that they expedite the exchange.  She was very plesant and professional.  I returned the tablet and received a new tablet in just a few days and it works fine.  I am pleased with the customer service I received from 88 Direct and the Customer Representative that assisted me. Although the tablet is to be a Christmas gift and therefore my granddaughter has not receive it or had opportunity to use it,  I have read about the tablet and am pleased with the features it provides and I am confindent that my granddaughter will be very happy with this tablet.", "Date": "December 22, 2013"}, {"Title": "Don't do it no matter the kids age.", "Author": "Brad Tym", "ReviewID": "R1HBQC2ACSEA75", "Overall": "1.0", "Content": "All the features that this thing has may as well not even come with it. My child just wanted to play some games like temple run or something like that and enjoys watching movies and listening to music on youtube on it. when she does take pictures with it they are all fuzzy and slows the entire tablet almost to a stop. When you push a button I hope you don't mind waiting 30 seconds for the tablit to catch up. She is six and still comes and asks me for my Note 3 to do these things. I read the reviews most seemed decent and even the bad reviews didn't seem awful. Her birthday is in a few months I supose I will just get her a kindle or ipad. Buyer beware I didn't listen to the warnings and i paid the price about 80 Dollars, hope you do.", "Date": "January 15, 2014"}, {"Title": "Not happy with the tablet", "Author": "jasmine jordan", "ReviewID": "R2HX8UBHUYYLM1", "Overall": "2.0", "Content": "The tablet completely fell apart after the second day. My 7 years old daughter  tripped over the cord while it was charging and the back came off completely. I am disappointed in this item.", "Date": "January 15, 2014"}, {"Title": "waste of money.", "Author": "Tz", "ReviewID": "R333CWLK0R75AX", "Overall": "1.0", "Content": "Absolutely terrible.  Slow moving and thinking. It freezes on me all the time. And it even won't turn on at times. It started acting up on me the very first day I got it. I emailed the company I ordered it from on here and they talked to me as if I was an idiot and would not give me a refund.", "Date": "March 18, 2014"}, {"Title": "disappointment", "Author": "Tina Lamb", "ReviewID": "RCMW65SX4I3RX", "Overall": "1.0", "Content": "It would not power up at all. Very disappointing. I ordered it as a Christmas present so it was a huge disappointment.", "Date": "January 19, 2014"}, {"Title": "Do the fooled by the cute colors....", "Author": "April", "ReviewID": "R2Q8RW5M1WIECK", "Overall": "1.0", "Content": "Other than the nice color options, I Wouldn't recommend these tablets at all! We didn't even have it a week and the screen went white and it was not usable anymore. The only thing I did like about it was that it came with a stylus.", "Date": "January 13, 2014"}, {"Title": "short battery life", "Author": "Brittany Garcia", "ReviewID": "RV61K62228406", "Overall": "1.0", "Content": "Battery would only last about 1 hr after fully charging it. They agreed to let me return it, but before I could my 1 yr decided to throw it.", "Date": "January 13, 2014"}, {"Title": "A little disappointed........", "Author": "amina", "ReviewID": "R10CM6BAY1BKL2", "Overall": "1.0", "Content": "I ordered this tablet a few weeks before Christmas for my two toddlers and although I received in about a week, I was sorely disappointed Christmas morning when the kids turned it on. We spent the entire morning trying to have it open up anything. After about three ours it needed to be charged. Could not even open up basic games. I am not one to talk bad about anyone or anything but to save someone the inconvenience I would suggest that you look somewhere else.", "Date": "January 13, 2014"}, {"Title": "Not happy", "Author": "Gwen", "ReviewID": "R2CARC46E8EH2G", "Overall": "1.0", "Content": "It's a cute tablet but the camera is not good and the screen isn't as clear.  It also just stop charging.", "Date": "January 12, 2014"}, {"Title": "Does not take charge properly", "Author": "Kendra", "ReviewID": "R3SK7VIVNB1J", "Overall": "1.0", "Content": "Beware! I ordered three of these tablets for my kids and within the first week two of them won't take charge.  I tried swopping the charger it came with, with another charger and it still did not work.  Now I'm in the process of sending the faulty tablets back to company.", "Date": "January 7, 2014"}, {"Title": "never again", "Author": "Tiffany Edmonds", "ReviewID": "R1358HEQE63UPG", "Overall": "1.0", "Content": "i just got my tablet monday and for some reason it made a funny noise the screen started getting fuzy and it shut off im am in the process of returing it now i am so upset that this happen. i needed it for christmas getaway and my new years trip. keep every one updated on how things turn out because this was a WRECK!", "Date": "December 17, 2013"}, {"Title": "Great Tablet Great Price", "Author": "tim rodkey", "ReviewID": "R3PR9X995054FL", "Overall": "5.0", "Content": "This Tablets does everything I need from surfing the web to watching a movie. It came as described and was very easy to set up and use. I found the installed apps to be useful and the quality of the tablet to be as expected \"Great\" . the Shipment came quickly with no damage. I will buy Again !!", "Date": "December 14, 2013"}, {"Title": "no problem", "Author": "JARMEL POWELL", "ReviewID": "R3MVIIRKT226SG", "Overall": "1.0", "Content": "Didnt get to use i sent it back, i found a device that i liked much better, so thanks forasking", "Date": "January 15, 2014"}, {"Title": "great gift ideas for young children", "Author": "Fred evans", "ReviewID": "R2Y7FPOM0BGIJE", "Overall": "5.0", "Content": "I bought 2 of them one for my 12 year old daughter and one for my 9 year old son. They really love them. It does everything it is supposed to and everything they want it to. They really enjoy the 2way camera. I could not be any more happier with this product than I am now. Thanks.", "Date": "January 14, 2014"}, {"Title": "love it", "Author": "Yolanda Ayala", "ReviewID": "R3L9CAUYJU7ERU", "Overall": "5.0", "Content": "i recommended this website and product for a friend..he purchase it ..and he and i loved it very much, bought it for his daughter for christmas..its beautiful", "Date": "January 13, 2014"}, {"Title": "Simple and cute", "Author": "Pretty Pink", "ReviewID": "R3UZLU6K4XAHGM", "Overall": "5.0", "Content": "It's simple and really cute for my little girl. It arrived quickly.And so far all is good with it. My daughter loves it. I would buy from here again", "Date": "January 10, 2014"}, {"Title": "Not working", "Author": "Renee", "ReviewID": "ROD27VCRNIB8R", "Overall": "2.0", "Content": "My grand daughter just opened and Christmas day and it stopped working on 5 January...totally disappointed. I gave them a two rating because she really enjoyed it while it was working.", "Date": "January 9, 2014"}, {"Title": "ASUME", "Author": "kimberley", "ReviewID": "R7WTXFCRFG44H", "Overall": "5.0", "Content": "I love it. It was more then I could want for Christmas. Great gift thank u hubby I.L.U. so much", "Date": "January 7, 2014"}, {"Title": "fast touch 7 inch dual tablet", "Author": "Bobbi", "ReviewID": "R5HUWDSO0W4JH", "Overall": "5.0", "Content": "It worked fine and my granddaughter loved it! I can't seem to get it out of her hands! Battery life is gone fast so we have to keep the charger close by,but other than that it works good!", "Date": "January 7, 2014"}, {"Title": "Rated on basis of reviewing many other tablets in this category", "Author": "Sarah H. Adams", "ReviewID": "R3H76KJCMLKZNM", "Overall": "3.0", "Content": "I scoured the internet for a tablet for an 8 year old girl whose first language, I suspect, is Spanish.  She is a member of a family for whom I purchased Christmas gifts as a part of a program run by my church and she had specifically requested a tablet.  The Leap Pad seemed to be geared to younger children, as did most of the others I found within a price range I could afford and that were not intended for adults.  The Fast Touch seemed to be the best, if not the only, interactive tablet that I thought might remain appealing to her for several years.  It also got generally good reviews.  Since I am not in touch with her or her mother, I have no idea how it has worked for them although I did translate the directions which came with it into Spanish and enclosed them with the wrapped gift.  I gave it 3 stars in the hope that it met the expectations I had and performed as previously reviewed.", "Date": "January 7, 2014"}, {"Title": "nice tablet if you dont want to play games", "Author": "daniel crowder", "ReviewID": "R1DV9A2JSWB0Q7", "Overall": "3.0", "Content": "i bought it initially to play puzzles and dragons and it works for that but the game lags horribly at random times and when i plug in the tablet it also gets rely hot so i assume it is going slow because it is overheating now im not saying its a bad tablet its nice for the price so if you dont have a ton of money get it but if you have options get something better", "Date": "January 3, 2014"}, {"Title": "Great as a child starter tablet", "Author": "Eric Restrepo", "ReviewID": "RYNXIZ3H789FN", "Overall": "5.0", "Content": "Excellent as a startup tablet for children. My 8 year old daughter and I simply love it !! She feels like a grown up she says.", "Date": "January 3, 2014"}, {"Title": "Good!", "Author": "rachael parent", "ReviewID": "R24UAILSDYFPG6", "Overall": "4.0", "Content": "My daughter loves it!! Works very well! She is 8 years old and I think this is very appropriate for her.", "Date": "January 2, 2014"}, {"Title": "It's okay", "Author": "vanessa palmerin", "ReviewID": "R1JNV3ZJ0GKXIG", "Overall": "4.0", "Content": "For a 11 year old girl it's good but the charger that comes with it don't charge the tablet so we got charge it with a cell phone charger", "Date": "January 1, 2014"}, {"Title": "good choice for a starter tablet", "Author": "Vanessa Ali", "ReviewID": "R2C1PEXCH33L11", "Overall": "4.0", "Content": "my 9yo daughter saved up her own money to buy this tablet.  She wanted a Kindle but I wanted her to start with something less expensive.  I think this is a decent starter tablet.  We received it 5 days after placing the order.  Charged it for less than an hour and she started using it right away without any assistance from me.  So far we are happy.", "Date": "December 31, 2013"}, {"Title": "no complaints.", "Author": "inhere", "ReviewID": "R2WKVGCG43CXVT", "Overall": "5.0", "Content": "I brought this for my daughter for Christmas and she hasn't put it down yet. She complains it runs slow sometimes but that's because she has 20 apps open at one time.", "Date": "December 31, 2013"}, {"Title": "My 8 year old daughter likes it.", "Author": "Amy G", "ReviewID": "R3ON3KS8K60PSO", "Overall": "3.0", "Content": "Good for the money. Not sure I would buy it if the other tablet companies lowered their prices by another 40 bucks.", "Date": "December 30, 2013"}, {"Title": "pretty good", "Author": "Josie", "ReviewID": "RQ3Y7BO9XC0BW", "Overall": "4.0", "Content": "Over all a good, cheap tablet. My 6 your old loves it. The camera leaves something to be desired but not really surprised because of the cost.", "Date": "December 30, 2013"}, {"Title": "dont buy it save your money", "Author": "Erisheniqua", "ReviewID": "R15DFIHOJI6HQ6", "Overall": "1.0", "Content": "I want my money back .these Things are crap its not worth buying it freeze the first day i got it not within the second hour. It have no charger i would never buy from u guys again", "Date": "December 28, 2013"}, {"Title": "sricks", "Author": "srick218", "ReviewID": "R3I54326SUO52N", "Overall": "2.0", "Content": "it is very slow And it continually cuts off why using it. It took forever to get it to register my wfi", "Date": "December 28, 2013"}, {"Title": "Terrible Product", "Author": "Cathy D. Nutter", "ReviewID": "R269EWIBPC5A0I", "Overall": "1.0", "Content": "Will never buy this tablet again,  bought as a christmas gift, wish we had checked it out better!  One dissapointed child, this tablet won't do anything, very slow!  Will never recommend it!  Amazon should not sell it!  Did not want to give any stars!", "Date": "December 27, 2013"}, {"Title": "love it", "Author": "sheila scott", "ReviewID": "R1Z6E0STSUT70N", "Overall": "3.0", "Content": "It was suppose to be 4 star. Typo error. Didd get to use it. It was sent overseas as a gift", "Date": "December 27, 2013"}, {"Title": "Good for the money", "Author": "Loni Miller", "ReviewID": "R2FA1DD25VYUQO", "Overall": "3.0", "Content": "This is something I bought for my 9 yr old daughter.  I wanted my android phone back and this was an opportunity to get it.  I bought this for her to play games on.  It served the purpose, it isn't as fast as an android phone but it is a cute pink color.", "Date": "December 17, 2013"}, {"Title": "IN DISGUISE HUH!", "Author": "Gloria J. Dukes", "ReviewID": "R1GKLZQTH131CU", "Overall": "1.0", "Content": "This nothing but that ragedy .TAB Nero by Matricom. Do not purchase this you will be sending it back. Purchasing one of these is like flipping a coin with good and bad on it's side. You might get a good....", "Date": "January 3, 2014"}, {"Title": "BULLSH*T", "Author": "Jordyn Leighton", "ReviewID": "RTXAKD7IGG7GJ", "Overall": "1.0", "Content": "HORRIBLE TABLET! DO NOT BUY THIS PIECE OF! SAVE YOUR MONEY. IF I CAN GIVE NO STARS I WOULD. HORRIBLE", "Date": "December 24, 2013"}, {"Title": "good to terrible! Do Not Buy!!", "Author": "Renaissance Woman \"EM\"", "ReviewID": "R2ZQXS6BLQ20HT", "Overall": "1.0", "Content": "I can name a lot of reasons not to like this tablet. first, I got this late. I ordered this on November 2 but I got it on November 15.the battery runs out EXTREMELY FAST! it's not very durable. I dropped it once, and it fell apart. also it takes extremely long for it to charge, about 2 or 3 hours for it to be completely charged 100% and one minute later, the battery is at 92%. you also have to hold it at a certain angle for it to charge. the name fast touch doesn't fit the tablet's speed at all. It's as slow as a turtle! to conclude this, the storage runs out EXTREMELY fast. I downloaded 2 things and the storage was almost full. this tablet was good the first day I got it, now it's terrible! Please, do not buy this!!!!!!!!!!!!!!!", "Date": "November 14, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00ECKHCN2"}}