{"Reviews": [{"Author": "nannette simon", "ReviewID": "R9FIGDEER74U5", "Overall": "5.0", "Content": "I received my tablet 2days after I ordered it. I didn't think it would work too good because of the low price, but it works great. Its fast and enjoyable. I see some people say its slow as dialup. I have wireless internet on my laptop so I just turn my tablet on and it did everything else. You got to have wireless internet to do that. I see now that its even cheaper for what I paid for it. I only paid 83and its great. I give it a five star", "Title": "i love it", "Date": "March 5, 2014"}, {"Author": "Bonnie Collins", "ReviewID": "R1NGASL0Y3ODL0", "Overall": "4.0", "Content": "Like it a lot ,enjoy using it.  Price was right thanks.Might get another one sometime in the future maybe", "Title": "9\" Tanlet PC", "Date": "March 16, 2014"}, {"Author": "fredpadilla", "ReviewID": "R3BB3F542XS57V", "Overall": "5.0", "Content": "T his tablet is great its fast smooth and the microphone works great the resolution is good Netflix works really good and YouTube the weight of the tablet has an nice feel not to heavy not to light battery lasts about 4 hoursmaybe 5 if you exit out of your apps or use task killer app great buy.", "Title": "pc tablet", "Date": "April 19, 2014"}, {"Author": "April Dionne", "ReviewID": "R3BH8VR298J6P7", "Overall": "5.0", "Content": "It works great I love it. also love the two leather stand cases.I would tell my friends about them.Thank You!", "Title": "good stuff", "Date": "March 19, 2014"}, {"Author": "Kathleen Martin", "ReviewID": "R2WQ211WERXS9M", "Overall": "5.0", "Content": "Works great is everything expected in a tablet. My friend has not put it down since receiving it except when he sleeps of course.", "Title": "Tablet", "Date": "December 7, 2013"}, {"Author": "sm boyd", "ReviewID": "R19WSXIN62CRYE", "Overall": "5.0", "Content": "best tablet for the price.  lightweight, easy to use, and supports everything I need wifi, email, web, and several apps I use", "Title": "great tablet", "Date": "April 20, 2014"}, {"Author": "mamma bear4", "ReviewID": "R3LRLJ1K31W4J4", "Overall": "3.0", "Content": "This is a nice tablet, functions all work, etc.However, no matter how fast your internet speed, it runs very slowly.It can be very frustrating.Reminds me of dial-up.", "Title": "Nice tablet but you get what you pay for", "Date": "February 6, 2014"}, {"Author": "Samantha Breneisen", "ReviewID": "R36POET90SY3R9", "Overall": "5.0", "Content": "Purchase for a gift for my mum and she is loving it.  Screen size is great for her, and light weight easy to handle.  She wishes the cord to plug in the wall was longer, but other than that loves its ease of use.", "Title": "Great for price.", "Date": "April 24, 2014"}, {"Author": "noxcuses", "ReviewID": "RRO6ABCBF7558", "Overall": "3.0", "Content": "It works fine but it does not support a lot of apps or other stuff that I need on a daily basis. My fault though as I did not do my homework about this product.  Sometimes it's better to spend a few extra dollars to get what you need.", "Title": "This Product For Minimal Use Only", "Date": "March 6, 2014"}, {"Author": "Jose A. Rico \"Computer Programmer\"", "ReviewID": "R6JTDNH69BDMB", "Overall": "3.0", "Content": "Don't get me wrong, this Table is not that bad, I bought it as a gift for a child,Pros: the size is fair.  the feel is perfect, is not to heavy like the Ipad.  slot for MicroSD  USB connector  Headphones connectorConts: the touch sensibility is not good  Battery life is poor  screen resolution is fair  the size, make you difficult to find a protector case.", "Title": "You get what you pay.", "Date": "April 28, 2014"}, {"Author": "Rex Ankrom", "ReviewID": "R2F18C01ZAHTXU", "Overall": "4.0", "Content": "Perfect for the casual browser. I wouldn't download any apps that use a large amount of memory though. It won't run utorrent smoothly...", "Title": "Good for the price", "Date": "May 30, 2014"}, {"Author": "Wendy", "ReviewID": "R3EI0WZBR8BDAE", "Overall": "3.0", "Content": "Love the size, however even when connecting to wifi this product is kind of slow, however if you are just looking for something easy to work with it is worth the money.  Just keep in mind you get what you pay for", "Title": "Can't beat it for the money", "Date": "May 30, 2014"}, {"Author": "Kerry Williams", "ReviewID": "R3O4I1OG5Z15M7", "Overall": "3.0", "Content": "I bought it for my mother to play games.  The games play well but there is not much other use for it.  The camera is horrible.", "Title": "Cheaply Made", "Date": "May 30, 2014"}, {"Author": "J. Owens", "ReviewID": "R326G3RG8DMOQA", "Overall": "5.0", "Content": "I had to return an older model of this item from a different company. I was hesitant to order this one, but for the price I thought I would try. After several weeks, this tablet is exceeding my expectations. Loads search browser quickly and has not \"frozen\" yet. There is a wide range of apps and the 4.2 is much better than the older Android model. I would highly recommend this tablet - it does as advertised.", "Title": "exceptional value", "Date": "May 27, 2014"}, {"Author": "larry peterle", "ReviewID": "R31LSFFNTIIT0K", "Overall": "5.0", "Content": "Very nice person to do business with and very easy to work with. I wish you much success in the future.", "Title": "thankyou", "Date": "May 27, 2014"}, {"Author": "Tiea Zehnbauer", "ReviewID": "R38ZGLEJF4FGKN", "Overall": "5.0", "Content": "I read the reviews and they were very helpful.  I've just started using my Acer C720 but I'm very pleased so far!  Very portable, good battery life, easy to use - definitely worth the money.", "Title": "Was skeptical but pleased!", "Date": "May 25, 2014"}, {"Author": "natasha", "ReviewID": "R3N7N28UXL9JOL", "Overall": "1.0", "Content": "As soon as I received it, the tablet started to freeze, it keeps on shutting off. All it does is freeze", "Title": "review on the tablet", "Date": "May 24, 2014"}, {"Author": "sallie rau", "ReviewID": "R3RBS9HE7JH0JA", "Overall": "3.0", "Content": "the tablet was to confusing for me no matter how many times i tried it. maybe in the furture i might try again", "Title": "tablet", "Date": "May 22, 2014"}, {"Author": "Mary Torres", "ReviewID": "R2RP4X386J3LK7", "Overall": "1.0", "Content": "did not connect to the internet and nothing was resolved. I was given the run around. so I gave up", "Title": "9\" tablet not any good", "Date": "April 13, 2014"}, {"Author": "Franklin Slagle", "ReviewID": "R1YS2OSSMGRXWD", "Overall": "2.0", "Content": "A nice tablet WITH a cash register size instruction sheet.  Where is an owners manual ?And the battery seems to only last 40 minutes or so.", "Title": "Android for EXPERTS", "Date": "April 8, 2014"}, {"Author": "Patrick Grant", "ReviewID": "R27A44NQW5JBGV", "Overall": "1.0", "Content": "I bought two of these Androids and disappointed in them. Not only are they slow and have to be restarted frequently, one of my tablets lost half the screen in just two weeks. I only used that tablet for Pandora and placing Sysco orders twice a week for work. The tablet was never damaged in any way and just took a crap!! I just ordered a new tablet on Amazon and will be using the old Android for target practice. GIANT POS!!!", "Title": "Sorry Product!!", "Date": "May 15, 2014"}, {"Author": "taylor", "ReviewID": "R1G8X13UPV8VU9", "Overall": "3.0", "Content": "Not Bad for the price but if you want a 5 star rating product you should save your money. slow reaching on loading web pages and the battier dosnt hold a charge very long but if it would be great for a young kid to learn how to play games on a tablet then this would be for you.", "Title": "Not bad for the price.", "Date": "April 29, 2014"}, {"Author": "kathleen presley", "ReviewID": "R1F2RD996RMHU", "Overall": "3.0", "Content": "The touch spot is offset- its a pain to try to touch about a half inch above where you need to click :(", "Title": "the touch spot is offset", "Date": "April 26, 2014"}, {"Author": "dale baker", "ReviewID": "R3ARQG67X1754O", "Overall": "2.0", "Content": "this tablet would not do one thing I wanted to do which was down load the app \"March Madness Live\". the instruction booklet wasn't very good either. I would not recommend it.", "Title": "tablet", "Date": "April 10, 2014"}, {"Author": "Will", "ReviewID": "R1SUORPJI3BZR6", "Overall": "4.0", "Content": "My Son live in California and I live in the UK, I brought it Him for is Home work and to chat to Him on Skype, We haven't chattedyet as it being set up for Him. But going off what I've read from it reports I think it will be good, and the price was right will keep you informed.", "Title": "Got it for My Son age 10", "Date": "May 21, 2014"}, {"Author": "Lisa Cronkhite", "ReviewID": "R3JX7EOJS1S8W0", "Overall": "1.0", "Content": "ok so i ordered this the first on i got kept glitching really bad i would be looking at it not touching it and it was doing things then i sent it back they sent me a new one and that one was freezing up on me", "Title": "VERY UPSET!!!!", "Date": "April 11, 2014"}, {"Author": "floyd", "ReviewID": "R27YWTCRNCVRW", "Overall": "1.0", "Content": "This was the worst tablet ever! I guess you get what you pay for. I bought it and when I realized how slow it was and the fact that first generation smart phones where more effective I tried to return it, that was about 3 days later. They excepted the return but the shipping was rediculous so I decided to give it to my 9 yr. The truth is its even to slow for her so now its a paper weight. The one star is for overall appearance. Its a nice looking paper weight.", "Title": "JUNK", "Date": "March 4, 2014"}, {"Author": "Amanda Froehlich", "ReviewID": "R2HY6C2RPHD54P", "Overall": "4.0", "Content": "My boyfriend wanted a tablet and this was priced well. It was a bit weird to start because it was linked to some other language and kept saving those sites, but he's working out the kinks. He loves having it and that's all that matters.", "Title": "nice", "Date": "April 2, 2014"}, {"Author": "Pen Name", "ReviewID": "R23EACS4KLSW2I", "Overall": "1.0", "Content": "Waiting for approval to send back. Nothing like I expected. Battery didn't last even an hour, resolution was terrible there was a halo affect on all text no matter what setting and graphics were blurry. Also took hours to charge before it would even come on. I've had it three days now the screen won't even load! I absolutely hate it! I have an iPhone and love it so just going to spend the money and buy an iPad", "Title": "Not what I expected", "Date": "April 25, 2014"}, {"Author": "JAMES DAVIS", "ReviewID": "R22EFFQV3GZRUQ", "Overall": "4.0", "Content": "it did not work right numbers not working well  letters were same way so i returned it for credit  thats all", "Title": "i like it", "Date": "October 12, 2013"}], "ProductInfo": {"Price": "$175.00", "ProductID": "B00E87YPNE", "Features": "Great Tablet, Great Price! Dual Cameras and built in speaker make it a portable media machine.\nDual Core - With twice the processor, this tablet is much faster than our previous version\nAndroid 4 (Jelly Bean) with Google Play installed\nInternal Memory 8GB expandable up to 32GB\n9-inch capacitive multi touch screen", "ImgURL": "http://ecx.images-amazon.com/images/I/41MQs5110BL._SY300_.jpg", "Name": "Digital Reins 9\" Inch Tablet PC - Google Android 4.2 WiFi 8GB 512DDR3 Dual Camera & Dual Core - A23 Processor - Supports Skype Video Chatting, YouTube, Google Play"}}