{"Reviews": [{"Author": "kkalasa", "ReviewID": "R2GI5UGM9CVPF6", "Overall": "1.0", "Content": "I have had two of these devices fail on me.  The first failed within the first week and Amazon replaced the device.  The second device worked fine for about a week but I stopped using it and the battery ran dead. I tried every trick possible to get it to charge.  I searched online forums for similar problems.  I plugged the tablet into the USB hub on my computer, I used multiple wall chargers all for a minimum of 12 hours.  The device is completely dead.  Since I'm out of the 30 day return window with Amazon I now have to go through Asus support.  No telling how long that will take to get my device back.There are obviously people that are happy with this device so if you still want to buy it I suggest putting it through the ringer and use it hard the first 25 days you have it so if it fails you can return it to Amazon.", "Title": "Not worth the risk", "Date": "November 13, 2013"}, {"Author": "Bradford Schmidt", "ReviewID": "R192ROV48GQYID", "Overall": "5.0", "Content": "Frankly, I'm still blown away that you can purchase a 7\" HD tablet for a hundred and fifty bucks. You'd think that'd mean it would skimp on features and quality, but the MeMO Pad 7 certainly does not.Setup is quick and easy; turn it on, go through the usual input of your Google account, update the software and you're up and running. The MeMO Pad runs a skinned version of Android, but it's not as bad as some of the skinned versions I've run into. However, if you're looking for pure Android, you won't find it here. On the upside, some of the Asus apps (for sound and color registration, for example) are actually useful, so that's nice.Construction is fine. It's lighter than many tablets, which some may say feels cheap, but I like the weight reduction. Fit and finish is just great, buttons push well and feel solid, and it feels good in my hand.I'm not in love with the surface of the screen though. It's a fingerprint magnet, is actually flexible, and feels like plastic, not glass. When I clean it, I flexes noticeably in the center, making contact with the panel beneath and sticking there for a moment. Other issues with the screen: it's not nearly as slippery as the surface on other tablets or any of my phones, and the touch isn't quite as responsive as some, occasionally requiring more than one touch to register.The display, though, is lovely. Great color and angle of viewing, as well as excellent brightness. On the downside, there's no way to set it to auto-brightness, which is a drag for me - I don't like having to change it depending on viewing conditions. On the other hand, my Kindle HD 8.9 has an auto-brightness feature that simply doesn't work, so there's that.Speed is excellent on most apps, though I was lagging like crazy using the NY Times app this morning - that may be an app issue, I don't know. YouTube works great though, and video in general looks quite nice. Social apps and mail work a treat, as does outlook.com.The built in web browser is excellent with one issue (I'll get to that in a minute). It's fast and works on just about every site I've hit, and it actually reflows (YAY!) text when you zoom in and out - something that WAY too few browsers do right. The problem with it is this: the FIRST time you run it, you'll notice it immediately logs you into your Google account. One assumes it is now tracking every click and cookie, and there does NOT appear to be a way to log it OUT of Google. And it's not obvious it's done that unless you notice it when you first run it. I'm not a big fan of that sort of behavior, sorry.WiFi reception has been very good but not phenomenal, in the upper middle pack of devices I've tested. However, the connections have been solid and the MeMO Pad has never dropped off of my router. WiFi is also extremely fast; large files send and receive quickly and I've never found myself tapping my foot in impatience.The built-in camera is a pleasant surprise: it takes really fine pictures and decent video. It includes a full compliment of features and the filters anyone that's ever used Instagram is familiar with. A nice plus: Asus provides a group of nice filters on the video side as well as the still camera side.A huge plus: it's expandable. Rather than trying to get you drop extra cash on a device with more built-in memory, you can use an SD card to expand memory. This is just such a standard feature I'm amazed that the market lets certain companies get away with excluding it.Here'e the thing I'm most impressed with: I have a Kindle HD 8.9, a 17\" laptop, a 15\" laptop, a desktop and a Samsung GS3 to choose from when I want to check mail, hit YouTube, bid on an Ebay item, research stuff, or shop online. And unless I'm sitting at my desk, this little 7\" tablet is the one thing I reach for more than any other; that's high praise indeed.It's fast and light, does exactly what I need, and the battery lasts a good long time. I'm not a fan of the screen surface, but the rest of the package is so good (and expandable) that it's still going to cop a 5-star rating from me. In my opinion, it's the best value in tablets on the market right now, and hits the sweet spot of power, size, battery life and weight.", "Title": "A Fantastic Value That Works Beautifully", "Date": "September 26, 2013"}, {"Author": "K. Burnett", "ReviewID": "R1AE2NBEX7380U", "Overall": "5.0", "Content": "Was considering this tablet and a Nexus 7hd.  Opted for the cheaper one.  It's for the wife, so I'm not looking for gaming performance.  Just wanted something snappy.  It works great.  Far speedier than both the $400 tablets I popped for two years ago.  Screen is gorgeous.  The microsd expansion card was the clincher.  Need more space.  Will likely order another for myself.", "Title": "NICE little tablet.", "Date": "August 18, 2013"}, {"Author": "evan roussos", "ReviewID": "R1JKUBFFBLL01U", "Overall": "5.0", "Content": "Great first tablet, I`m very fond of the android platform and this is just that. Just turn it on and set up your accounts, Wi-Fi ,favorite apps, etc. You don't even need the manual! Great screen and fast processor,Oh yea ---- fantastic price for a new generation tablet.", "Title": "My first tablet", "Date": "August 13, 2013"}, {"Author": "rbfisher", "ReviewID": "RTSVXU3E8SFEH", "Overall": "1.0", "Content": "We saw some of the bad reviews but figured they were unusual situations. The device had a short battery life. Even when careful not to let the battery go low, it was difficult and eventually impossible to turn it on. We returned the first one and received a replacement. The second device had the same problem so we returned it as a defective product but AMAZON CHARGED US A $28 RESTOCKING FEE!!! We now think twice about purchasing items like this through Amazon. We recently bought a lap top and a Galaxy tablet through COSTCO because we are NOT CHARGED for returning defective items there!", "Title": "Do NOT buy this!", "Date": "April 14, 2014"}, {"Author": "Carol", "ReviewID": "R1MD615BWEI7WD", "Overall": "1.0", "Content": "I just got the MeMOPad in the mail yesterday and the screen doesnt even respond to my touch! Now, I have to send it in for repairs which will cost me even more money.", "Title": "DIDNT EVEN WORK!! DO NOT BUY!!!", "Date": "April 12, 2014"}, {"Author": "Aubrey Dobbs \"VW Enthusiast\"", "ReviewID": "RJSDU41UTGSBJ", "Overall": "1.0", "Content": "My Asus MeMOPad is dead after less than four months of use.  This tablet was too good to be true, and I'm almost certain that ASUS knew this prior to launch.  The specs blow away anything at it's pricepoint and it provided approximately three months of great ownership.I bought this tablet to replace a 5+ year old laptop that was failing.  I had never owned a Tablet before, but had previous good experiences with ASUS products.  I was so excited about the MeMOPad for the first two months of ownership that I nearly convinced a few friends to buy one (I'm glad I didn't).I own a Samsung Galaxy S2 and the wife has a Galaxy S3, so I'm familiar with the Android platform.  I was thrilled with the speed of the processor, the quality of display, the battery life, etc.  I used the tablet primarily for browsing the internet (Amazon, Gmail, etc.), but it was also fairly capably of handling games (even those that are graphically intensive).I bought this Tablet in late November.  It functioned very well for the first two months, but began occasionally failing to power on.  The first time it failed to power on, I thought the battery had just died.  I plugged it up and attempted to power it back on, but it didn't give any indication that it was charging.  I thought it was strange, so I left it plugged up for a while.  The next time I attempted to power it on, it came right back on.  I thought nothing else about and everything seemed fine again.A month passes and the issue reoccurs a few times.  The second time it happened, I started thinking about what might have killed the battery (nothing came to mind).  I plugged it up to charge and it gave me the battery charging indication.  The third time, nothing seemed to help.  I couldn't get it to indicate that it was charging and it refused to power on.  I eventually opened up the casing (I had planned on removing/replacing the battery), but the battery doesn't remove (it's attached to the board).  I closed the case back up, and strangely enough, it powered back on.At this point, I started reading the 1-star reviews and it seems to be a VERY common issue with the MeMOPAd.  I have removed the case two more times successfully to power it back on (may be a problem with the actual power button), but it's still \"asleep\" from the most recent failure.  I'm not sure what causes this tablet to fail, but it's a legit problem.  ASUS may have discovered the issue too close to the holiday shopping season to retool/resolve this problem.  They probably believed that lowering the price point would be enough to move these defective units.  I'm sure that I could send mine back to ASUS and have them ship me a \"refurb\" unit that was returned by another sucker (owner).If you need a good throw-away Tablet that functions for about three months, this maybe exactly what you're looking for.  If you want your electronics to last more than a season, spend your money on something better.  As for me, this will be the last ASUS product that I purchase.  They are selling lemons...and they've left a really sour taste in my mouth.", "Title": "This should have been a Five Star review, but...", "Date": "March 23, 2014"}, {"Author": "Kimberly Decker", "ReviewID": "R3NPNMF305EVQ7", "Overall": "1.0", "Content": "I ordered two of these items. One worked fine, the other stopped working entirely after less than a week. I replaced the non-working tablet and the replacement stopped working after about 4 weeks.  I followed the charging instructions carefully, but the product stopped working entirely. It would not charge or turn on in any way. On the plus side, the ASUS warranty covers repairs, but you have to pay shipping. 2 out of 3 of these products have not worked, so I recommend shopping for a different brand to avoid the hassle. On the positive side, the one tablet I have gotten to work has been a pretty good product.", "Title": "Stops working completely", "Date": "March 11, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2J8O12UZ1JNOB", "Overall": "1.0", "Content": "bought this for my wife she loved it . beutifull display . now 3 months later it wont turn on i tried diffrent chargers still nothing called asus awfull customer support .", "Title": "JUNK", "Date": "March 11, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1PGJ6TGTVRDHQ", "Overall": "1.0", "Content": "This is our second unit with the same problem. It was working well until all of a sudden it would fail to power on. I can't tell if it is charging, because it won't even start up. The bummer this time is that it failed just outside of Amazon's return window. Now I have to deal with warranty repair for a product that I would rather not even own.Ugh! I am not a happy customer! Buyer beware!", "Title": "Two units, two fail to charge/power on problems", "Date": "February 27, 2014"}, {"Author": "Darren", "ReviewID": "R2KAX3MSGHTMBI", "Overall": "1.0", "Content": "Just like you, I read the negative reviews for this product. I decided to give it a chance anyway because I really wanted it and didn't think I'd have any problems.And I didn't have any problems... for the first two months. Eventually the device would do this thing where it would go completely dead and not turn on, even when the battery is charged. No matter how many times I pressed the power button or plugged it into the charger, it DOES NOT turn on/wake up/show charging status/nothing! The only way to fix this was to leave it on the charger and to come back to it in a couple hours. This was very annoying because it could happen at anytime, even when it's charged or on the charger. This seems to be the case with other reviewers also, but I didn't think it would happen to mine.  -___-If that wasn't bad enough, about a week later the screen became unresponsive in TWO places. I could barely use the device because my touches wouldn't register in some spots. As days went by, the unresponsiveness of the screen began to spread to more and more spots. Now I can barely click on anything! I'M DONE! I'm selling it for parts because it's completely unusable. STAY AWAY.", "Title": "DON'T BUY! THIS WILL EVENTUALLY HAPPEN TO YOU TOO.", "Date": "May 11, 2014"}, {"Author": "Jacob R. Kozlowski", "ReviewID": "R3AST0SWXUEOJG", "Overall": "1.0", "Content": "These devices are riddled with bugs.  I purchases three and they've all malfunctioned and/or failed within a month.  I've requested a refund on all three.  Spend a little more and get a better tablet. These are not worth buying.", "Title": "Junk", "Date": "May 7, 2014"}, {"Author": "tekvoodoo", "ReviewID": "R1Y0AN9BTZKLIV", "Overall": "1.0", "Content": "Right after 2 months the battery stopped charging. Contacted ASUS. Sending  back to their repair house. Sad, ASUS products started giving such kinda problem. This is my last purchase from ASUS. I will look for another brand next time. Was a profound user of ASUS motherboard. Changed to MSI and Gigabytes now. Looks like ASUS is sliding from the top hill. Amazon is always great, shipped right on time.", "Title": "Asus Substandard product", "Date": "April 27, 2014"}, {"Author": "Timothy A. Johnson", "ReviewID": "RC8CLLZGQM6F9", "Overall": "1.0", "Content": "This product is defective and a waste of money.  I purchased two of these tablets; one for each of my kids for Christmas and the touch screen for both of them stopped responding after less than two months.  I sent one in to be repaired and the screen stopped working again a little over a month after the replacement was recieved.  Also know once the tablet is out of the Amazon return period you have to pay return shipping to ASUS if you send it back under the manufacturers warrenty.  A table should work for more than two months.  DO NOT BUT THIS PRODUCT IT IS DEFECTIVE!", "Title": "This product is defective and a waste of money", "Date": "April 23, 2014"}, {"Author": "S. Meakim", "ReviewID": "R1AE0NVK7KUT62", "Overall": "1.0", "Content": "I ordered this for my daughter for Christmas and put it in the bobj rugged case.  It was never dropped but had problems from the very start.  It was sent to ASUS twice to be fixed.  When I got it back on the second time it went to install and update and just looped.  ASUS said I would have to send it back again.  I will never buy another tablet from them again.  The first time it died and would not recharge.  The second time was because the MicroSD card would continually mount and unmount and the tablet wouldn't recharge.  This time after the OTA it would not boot.  I could not shut it off.  I called square trade and they took care of it for me.  FYI also they try to get you to pay for shipping to them each time even under warranty.  Complain and they will cover it.  They even tried to get me to pay for shipping the second time I got it back. #ASUSSUCKS.  Please spend a little more and get a quality product", "Title": "Poor Quality. Multiple Problems.  ASUS Won't Stand Behind Product BEWARE.", "Date": "April 1, 2014"}, {"Author": "Michael Caroff", "ReviewID": "RA8LH0ZN8KNGA", "Overall": "1.0", "Content": "I bought it originally last year (2013). Within a week, it just \"died.\" Wouldn't turn on no re-charging worked, etc. So I sent into Amazon for an exchange. They sent a replacement, and that one died with 2 weeks.By the way, I didn't abuse either one. Never even took it out of my office, didn't drop it, and fact didn't even use it that much. Unfortunately, this one has now passed the \"return period.\" Which means I paid $150 for a piece of black plastic.I would DEFINITELY recommend against purchasing this.", "Title": "This died within 2 weeks of receiving it -- TWICE", "Date": "March 25, 2014"}, {"Author": "A. Marsh \"golf nut\"", "ReviewID": "RQF029ICXGYZ6", "Overall": "1.0", "Content": "I loved this little tablet.  Smooth, fast, easy to use and navigate.  After 5 months, it just crapped out.  Nothing goes on, won't charge using any outlet, cable, or usb charger.  Dead.  And I'm very disappointed.  Buyer beware.", "Title": "Was great for 5 months", "Date": "March 19, 2014"}, {"Author": "faith", "ReviewID": "RZHDPNJLPZ9MW", "Overall": "1.0", "Content": "bought the tablet for my son for Christmas, already died, and it's only March.  It says I can no longer return it, really bummed out!", "Title": "Quit working in less than 3 months.", "Date": "March 13, 2014"}, {"Author": "RoodyPoo", "ReviewID": "R3604I5U9T2RCH", "Overall": "5.0", "Content": "My daughter loves to play with our phones and tablets so we got her one to play with herself. This thing looks very well made. It is definitely not one of the cheapo tablets that quit working in a couple weeks or months. It may be as sturdy as our Samsung Galaxy tablet.  The screen is just as responsive too. Look, if my 5 year old is not having a problem with the screen, there's no way you are going to. I have used it and it is really an amazing tablet for the price. I would recommend several times over.", "Title": "for my 5 year old girl", "Date": "March 10, 2014"}, {"Author": "B. King", "ReviewID": "R1CI34XCETB7IG", "Overall": "1.0", "Content": "This was all fun, except The screen went unresponsive after less than 30 days.  Amazon replaced it, then the replacement went bad within 30 days. They are doing what they can, but, I should not have to mess with this kind of crap", "Title": "I'm just gunna call it out as junk", "Date": "March 5, 2014"}, {"Author": "Adam G.", "ReviewID": "R2P4EWYUTVVZEL", "Overall": "1.0", "Content": "received it 12/30.13 and it died 3/01/14. Up until it's death I loved it. This was my first tablet and while it worked it was great. It was a speedy little guy and the sound it put out was fantastic. The display was crisp and clear and it never had any problems streaming youtube or netflix. Well till death do us part and all that. Just started a warranty claim with Asus will see how that goes. I have been using Asus PC components for a decade with no problems so to say I am let down is a bit of an understatement. Sorry little bugger you would have been a 10 star review if there were such a thing but you actually have to keep alive to receive such a review and can not receive it when you are dead.", "Title": "worked for 2 months then dead!!!", "Date": "March 2, 2014"}, {"Author": "Jason L", "ReviewID": "R3AGRB9RMXJS9D", "Overall": "1.0", "Content": "I have two of these tablets and the more recent purchase is now dead five weeks later.  Both have issues of not turning on easy at seemingly random times.  Even with a charged battery there are times when I have had to plug the tablet into my laptop then hold the power button for a few minutes at a time to get it to turn on. The tablet now has not been functional for a few days and is basically a paperweight now.Update March 2014: The other tablet now has a loose micro USB port and is darn near impossible to charge.  That is a definite 0 for 2 on these now.", "Title": "Power Issues and now dead", "Date": "February 23, 2014"}, {"Author": "Aaron", "ReviewID": "R1N2A7QR5TLB1G", "Overall": "1.0", "Content": "Of course, this was a Christmas gift I bought for my daughter... and it waited until after the 30 day return window to stop working.  It will not turn on.  Amazon has washed their hands of it.  It's very difficult to get in touch with the Asus people about this.Not happy.", "Title": "Tablet Died. AFTER the 30 day return window...", "Date": "February 22, 2014"}, {"Author": "Bob", "ReviewID": "R1HQ4I9BBW81X2", "Overall": "1.0", "Content": "Defective out of box. Would not recognize external sd card. This is a recognized problem with this unit. Went over 30 day return period with Amazon, now stuck in RMA situation with ASUS. If you want to add external memory to this tablet, BEWARE!", "Title": "Defective micro SD card reader", "Date": "February 18, 2014"}, {"Author": "Ramisan", "ReviewID": "RHW2T6LV2C5GT", "Overall": "1.0", "Content": "parts of the touch screen fail. battery died, and had to have it replaced.  not what i expected from ASUS.", "Title": "sent in to repairs twice already.", "Date": "February 16, 2014"}, {"Author": "Jim", "ReviewID": "RR76EJAYMVW30", "Overall": "1.0", "Content": "Words cannot convey my disappointment. I've always had a loyalty towards the Asus brand. Near-Nexus 7 specs for almost half the price was too good to be true... And you know what the say about that. First one broke in two weeks, the second one in a little over a month. Now that I'm past the return window, I had to eat a restocking fee. Same problem both times, unit becomes completely bricked out of nowhere. With light to moderate use, mind you. PLEASE don't buy this. We have to get Asus back on the right track by not accepting incompetence!", "Title": "Horrible. Two of these broke on me in two months. Please avoid!", "Date": "February 15, 2014"}, {"Author": "Mon B. Gurung", "ReviewID": "RNN6X2KY8Q7UC", "Overall": "1.0", "Content": "Stopped working right after 2 or 3 months of using, I had to throw it in trash...Waste of money", "Title": "Ain't gonna last long", "Date": "February 15, 2014"}, {"Author": "Stacy Springer", "ReviewID": "R1ASWIYNHYQZAG", "Overall": "1.0", "Content": "I gave it to my 25 year old daughter for Christmas.  She used it one day and later that day it stopped working.  It will not turn on and has not been dropped or damaged.  I have found other reviews that say the exact same thing!  Unfortunately I did not buy the additional warranty.  Do not buy this model of tablet, do your own search on \"ASUS MemoPad  HD 7 Tablet will not turn on\".  Tried hard reset and still not working.  Very disappointed!", "Title": "Stopped working after 1 1/2 months!", "Date": "February 14, 2014"}, {"Author": "Austin A.", "ReviewID": "R3I0NME83CY1AO", "Overall": "1.0", "Content": "At first it seemed like a good tablet for the money, it was not as fast as I had hoped but it did the job. Then it just stopped working, will not turn on at all!", "Title": "Quit working after less than 4 months", "Date": "February 13, 2014"}, {"Author": "Sean", "ReviewID": "R39W6QO5P0UQ4S", "Overall": "4.0", "Content": "I bought this tablet for my girlfriend for her birthday (in pink, of course) and she loves it. She was previously using my Nexus 7 1st gen. Needless to say the tablets are so similar in size and construction, it was a flawless transition.The build quality of the Asus isn't up to par with the nexus 7 2012, simply because of the plastic backing that gets scratched very easily. With that said, comparing the screen quality of this tablet to that of the nexus is like night and day. Surprisingly the Asus just appears a lot more vibrant and sharper. Maybe its just my nexus, but I think the responsiveness is much better as well.This tablet isn't the fastest thing out there, as you would probably expect. But with one gig of memory and a 1.2ghz dual core processor it isn't too bad. It scores somewhere in the region of 13k on antutu, so youre looking at a galaxy S3 level of performance. Some apps to happen to slow it to a complete crawl sometimes however.Since the tablet is built on the mediatek architecture you're not going to get a lot of custom ROM support for it. I did however manage to find one that gives you some kit Kat goodies and some much needed stability improvements.We did experience the problem a lot of reviewers complained about: the tablet drains the battery and then will not turn back on. While I don't think you should have to go through this kind of thing with any product, this kind of thing happens, I guess. I contacted asus and opened up an RMA because it happened only 40 days after purchase, so amazon wouldn't let me send it back. But then I decided I'd try to fix it on my own.I popped the back cover off, removed the battery connector from the main board and shorted the terminals, kind of like a \"clear CMOS\" procedure on computers. Needless to say, I plugged it back in and connected the charger, and everything was good to go again! The problem hasn't happened since, and we've had it for about 3 months now.Overall if you're on a tight budget I would recommend this tablet without hesitation. The price is awesome, the screen is really good, the front and rear cameras are surprisingly better than my iPad mini retina's own, and its great value for the money. If you can manage to throw on about $80 more however, I would recommend the nexus 2013.", "Title": "Awesome for the price", "Date": "January 12, 2014"}, {"Author": "mosprott", "ReviewID": "R3096BABX78P6X", "Overall": "5.0", "Content": "I've had the MeMOPad (ME173X) for a week - my first Android device after more than a decade of Mac-centricity. I'll say up front that I purchased this because (a) I wanted some Android OS experience under my belt, (b) I liked the idea of expandability with the mini-SD slot, and (c) the price point ($149) was so much better than a similarly configured iPad mini - or even other Android tablets.In response to other reviews, my unit has no build issues - doesn't feel flimsy, the glass doesn't seem *that* much different than iPad glass; the SD card has remained seated and non-problematic; and I'm finding the OS to be fairly easy to deal with. Interestingly, iOS 7 seems to have stolen a few things from the Android OS!If I had it to do over again, I'd buy this again in a heartbeat.", "Title": "Build quality - solid", "Date": "September 23, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RW6GWNMX2E50K", "Overall": "4.0", "Content": "Received my tablet Asus memo pad HD 7, 16 GB, Sept. 19 2013.  Polaroid 16 GB high speed class 10 micro SDHC flash memory card.  The display is easy for me to see, I have poor vision.Can use Google calender offline and sync when online.Google drive works well.  Also installed a swipe keyboard, it works great. Found a tablet anti virus program, AVG.Loaded my music to the sd card and created a play list.  Played music with loaded software, sounded great.Tried loading a Kindle book, but can not find it!Up to now I am loving this tablet.  The touch screen is sluggish. Takes 2-3 taps to activate apps at random moments.Today, 3rd day of use, the tablet will not access the sd card, then it does!  Again, it is random when it will work.This keeps up, the tablet will be useless to me, so back it will go!Asus support wants $38 to chat with me on the issues!  This will end up a $400 tablet by the time support gets done with me!9/28/13 Update:SD Card Issue:I tried the power off/reinsert and power on reinsert, neither worked.  I put in a older micro SD (Patriot 4 GB, not a class 10) card and it has stayed mounted for 4 days now and is playing music from it.  I put the Polaroid card in my cell phone and it works.  Asus support suggested trading out the SD card.  I don't know if it is an issue with class 10 or Polaroid, Asus only said if another card did not work, it was a card reader issue, nothing about the type of card or brand being an issue.Support responded with 3 days.Registering device:when you register your device, it says to look for the Serial number on the product box.  On my box the serial number clearly contained a zero (0), even by Asus's check list of what a zero & an O would look like.On my device, Settings Icon/ System section/ About tablet/ Status, I found the device serial number that worked to register my device, which showed an O, not 0 (zero)Suggestion for Asus: DON'T USE THE LETTERS O & I IN SERIAL NUMBERS!Google Docs:It has been really easy to up-load Word and Excel docs from my main computer.  The down side is I have not found away to edit them yet.  Still exploring that.  I can create new docs on my Asus and convert them to Word or Excel on the computer.I can't give it 5 stars with Asus not making it clear if class 10 cards will work or not, plus the registering issue.Oct. 13: I have been using a Transcend 32gb Class 10 MicoSD and have not had any issues with it.Streaming Amazon videos (you will need to download Flash): I tried Dolphin browser, but it stopped working and hanging up the system. Was very difficult to get flash on it.  I am now using Puffin browser for 5 days, It was very easy to get Flash on it.issues:  1. Has a bit of lag when streaming, but not always  2. Not easy to get it to open to full screen. Not really sure how I got it to go to full screen!ASUS MeMOPad HD 7-Inch 16 GB Tablet, White (ME173X-A1-WH)", "Title": "Asus card issues update & Streaming Amazon videos", "Date": "September 21, 2013"}, {"Author": "TPerki", "ReviewID": "RR94DKL5AMZDX", "Overall": "5.0", "Content": "I have another ASUS tablet, so not much new here. Updated to latest Android when I powered it up. I really like the form factor. I have a 10\" Transformer (TF300T). I pretty much keep it in the keyboard dock, as 10\" is hard to hold in your hand. 7\" is much easier, and you don't sacrifice that much screen for normal day to day stuff. That said, I bought the MeMoPad as a \"front end\" for Google Play Music and ChromeCast. I connect the MeMo to my Bose Wave Radio using bluetooth and stream cast to the TV using ChromeCast (check it out, it is wild for the money).", "Title": "So far so good", "Date": "September 6, 2013"}, {"Author": "Maxx", "ReviewID": "R1MQ89OPC9AK5M", "Overall": "5.0", "Content": "I am completely sold on this unit, unlike the 172, the 173 handles very well.No lag, very easy set up, and best of all the micro SD. (Nexus,I pads, Kindles are missing this)It will NOT support a 64 GB micro. a 32 GB is the max.Special Notes...Apps are stored on device. Not SD card..so use care on what you get.A Protective outer case is HIGHLY recommended.Battery life is amazing! ( on power saver expect 12-15 hours, my personal experience)Movies on SD card play beautifully!Games like Plants vs Zombies load slow but play as normal.I'm super happy about this little unit,I wanted a unit with alot without the price tag.If your looking for the same..here it is.", "Title": "Excellent buy without the high price", "Date": "September 3, 2013"}, {"Author": "Josh", "ReviewID": "R1CM4H96S6YHH8", "Overall": "5.0", "Content": "As far as a \"budget\" Android tablet goes, this thing is amazing.  I have owned several tablets over the years and this is the most impressive, especially considering price.  My wife has the 1st gen Nexus 7 and this thing, in my opinion is as nice or nicer than it.Some things of note: screen is amazing, the colors are good and images crisp, the SD card slot is very handy and one of the factors that led me to buy this over the new Nexus 7, the camera is so-so, but for a pinch (and in the right lighting...) it's not bad, Asus UI is probably the least intrusive custom UI on the market.  It's also pretty quick, thanks in part to good mid range hardware as well as a light UI.  I don't really play games but the following played well: Plants vs. Zombies, Gun Bros 2 and Dungeon Hunter 4.  Fit and finish isn't bad, the back plate feels a bit flimsy, but once in a case it's a moot point.  Music sounds good, videos look good, the internal speakers are good enough.  I'm just really quite impressed with this little tablet.  I'm very happy to have spent about $150 on this instead of $230 on the new Nexus 7, but your mileage may vary.", "Title": "Amazing", "Date": "September 3, 2013"}, {"Author": "soki", "ReviewID": "R1L28RYUMBQCOL", "Overall": "5.0", "Content": "The lack of a camera flash, and no mini hdmi jack are hardly missed. Plug a bid sd class 10 card into it and the thing runs android absolutely seamlessly and open all files/app in a snap. Best value out the dollar for dollar. We'll see in a year if the construction is good enough. Bought this and paired it to some decent Bluetooth speakers for my father to replace his old CD player set up (transoding hell but well worth it).", "Title": "Really nice little device.", "Date": "August 26, 2013"}, {"Author": "Brian M.", "ReviewID": "R26DETP706PUPN", "Overall": "5.0", "Content": "This thing is fast at processing. Copy and paste from a micro SD is speedy even when doing gigs at a time. On standby with bluetooth on does 24 hours easily. Sound from speaker is great but on my bluetooth headphones amazing. The Asus apps built in are fun to use and each serve a purpose. The buttons feel good and are very responsive. The multitask works with no lag and apps start in the blink of an eye. Tablet feels great in hand and is very lightweight and thin.BUY ONE NOW, IF YOU CAN BUY 2 BECAUSE EVERYONE WHO SEES YOU WITH IT WILL WANT TO TRY IT. I wanted another one but spent cash right before the semester so Nexus 7 2 didn't make the cut and this is the true winner.", "Title": "Awesome Tablet, extraordinary price AUG26", "Date": "August 26, 2013"}, {"Author": "teddyb", "ReviewID": "R38DQESKKDVB7B", "Overall": "1.0", "Content": "Well after reading the reviews on here, i can see there are a mixture of experiences; mostly positive, unfortunately, mine was not a good one. Very disappointed with this Asus product. Purchased this as a Christmas gift for my son December 14th 2013. After one month of use, the tablet failed to respond. Thinking maybe it was just a defect, I ordered a replacement. The tablet worked great for about 4 months then suddenly stopped working again, now i can't return it because the warranty has expired. I'm basically stuck with a heap of junk that i can do nothing with, only had the item for a total of four months. Now I'm out of a tablet and $144.00. I would not recommend this product to anyone. Take my advise, if you happen to come across one that you're having problems with and you're considering sending in for a replacement, DON'T, get your money back and be done with it. Would give it a rating of zero if i could.", "Title": "A piece of trash", "Date": "April 8, 2014"}, {"Author": "Deb Brinker", "ReviewID": "R3KH82KUSCSR2I", "Overall": "1.0", "Content": "RECEIVED MY ME-173X-A1-BL FOR CHRISTMAS. ON OFF SWITCH WAS HARD TO TURN ON AND OFF. WORKED FOR 5 DAYS COULD NOT GET IT TO POWER ON. TOOK IT BACK FOR A NEW ONE THIS ONE DIDN'T LAST A DAY. WILL NEVER BUY ANOTHER ASUS PRODUCT AGAIN.", "Title": "SAME PROBLEM OTHER 1 STAR RATINGS ARE HAVING", "Date": "January 1, 2014"}, {"Author": "Song Sopher", "ReviewID": "R510CBWMSLTDT", "Overall": "1.0", "Content": "I bought Asus Memopad for my husband for christmas and he loved it. It has everything he needed for work and personal. But on 3rd day, It stoped working and charging.  Somehow I got it to start the power and it keep dying, It was charged over nigt but it says charged 15%.  Than I start smell some wire burnnng and it was coming from charger cord.  I took back to store and they told me to order it online. They discontinue Asus Memopad!  I read other reviews and seems alke many buyer had same issues. I won't go trouble to get another Asus. Although it is great tablet, wish they fix the issue and make new model. but for now NO, I won't recommend it to friends.", "Title": "It stop worked on 3rd day...", "Date": "December 31, 2013"}, {"Author": "jfink11", "ReviewID": "R2WV609OQM7TBA", "Overall": "5.0", "Content": "This thing is great. I use it all the time. My wife always steals it from me. Much lighter and easier than iPad. Plus it's android so it works with our phones. I like the expandable memory slot also. I haven't had a single problem with it in the last 3 months I've had it. The battery last long just like the iPad even though they say it's only rated 7 hours.", "Title": "Nexus for half price", "Date": "March 26, 2014"}, {"Author": "Adam Bedard", "ReviewID": "R12R8ZS5EAAGAP", "Overall": "1.0", "Content": "got this for my daughter for christmas and I sent it in once because the screen kept freezing and you couldnt do anything on it. Just got in back 3 weeks ago and the same thing is happening again. should have just put the money we wasted on this and put towards an ipad mini. I know we wouldnt have had any issues like this in just a few months of having it !!!", "Title": "Dont wast your $$$$", "Date": "March 25, 2014"}, {"Author": "Mikhail Tagallie \"PuppyOfDoom\"", "ReviewID": "R3FYZSREJZNOTM", "Overall": "1.0", "Content": "hey yall i bought this end of nov been playing with it dec jan feb thismarch it just died. randomly while charing connected to my laptop, it wont charge i use the cable provided. i use the wall outlet an connect it to my pc often enough.  its just dead. the cable works. i can charge my phone with it also.This is the second product ASUS has failed me on hardcore. the last one was a MOBO. i was like lemme give these guys a chance seems like a sweet deal good specs.Dont waste your money. also the Camera has a problem with the way it takes mirror pics and you have to manually mirror everything yourself when taking self photos. it wont save like you see it. itll save as a mirrored image.  its quite ackward and frustrating.  Find a better tablet dont waste your money like i did. Im thinking clearly here. not angry at the company just quite dissapointed in the product and its random dying. i didnt drop the thing or crush it i was careful with it. it just felt like dying.Im quite sad too i had some videos of my cat n some stuff on there. i cant retrieve it.", "Title": "5th month review Just randomly died after a few months use.  Problems with features.", "Date": "March 23, 2014"}, {"Author": "Beth Brassfield", "ReviewID": "R1P8ACAKZEUB53", "Overall": "1.0", "Content": "We ordered this for our daughter for Christmas and after 1 month it simply stopped working.  We returned it and Amazon immediately replaced it but again after 1 1/2 months it just refused to charge or turn on.  Amazon was great about returning it for a full refund but we will not be purchasing this again.", "Title": "stopped working after 1-2 months", "Date": "March 21, 2014"}, {"Author": "CaptJax", "ReviewID": "R39YDBZAJH8V1H", "Overall": "1.0", "Content": "Garbage. I bought my first one and the SD slot stopped working almost immediatly. I returned it and got a new one. The second one stopped working outright about three days after the 90 day warranty expired. It's now an expensive paperweight.", "Title": "Get a different tablet", "Date": "March 20, 2014"}, {"Author": "Reviewer13", "ReviewID": "R6BM3UW9R7JGN", "Overall": "1.0", "Content": "We ordered 6 of these for our 6 kids for Christmas.  We were very happy with the device and the price but ultimately 3 of them had completely failed within 3 months.  One kept over heating and shutting down even when not in the case.  One refused to turn on after awhile and we tried all the solutions that we read about online and it didn't work.  The third started having areas of the touch screen that quit being responsive to touch.  Two of these went bad soon enough to be able to get replacements for free but the third one didn't.  Also, we expect that we will see the same sort of failure rate with the new devices as we did originally and that we will have more trouble with the ones that haven't went bad yet.", "Title": "%50 failure in 3 months", "Date": "March 20, 2014"}, {"Author": "Jose Mendoza Peña", "ReviewID": "RHPUY0J1DFT76", "Overall": "5.0", "Content": "I really like this tablet is what I was looking for .. and with a memory capacity of more than 32 is complete ..", "Title": "this tablet were you looking", "Date": "March 15, 2014"}, {"Author": "NH Camper", "ReviewID": "R1FA9MW97XBYJC", "Overall": "5.0", "Content": "I do not have alot of experiences with tablet but the picture is awesome and it surf very well.Excellent streaming from Netflix", "Title": "Very Good Display", "Date": "March 10, 2014"}, {"Author": "Thomas Aycock Jr.", "ReviewID": "R3PUF3KR3B9LW1", "Overall": "5.0", "Content": "Best Pad under 200.00 with more improved features like memory slot and front camera over the Google Nexus. Best price & quick shipping", "Title": "Best Pad, Great Price", "Date": "March 6, 2014"}, {"Author": "christian", "ReviewID": "R1A4UL586ETF3K", "Overall": "5.0", "Content": "This is a great product that is very inexpensive and does what other tablets say they do. I own the three major tablets and this one is right on par with the rest.", "Title": "Great product", "Date": "March 5, 2014"}, {"Author": "Robert \"Robert\"", "ReviewID": "R3C3V1ZJF71X6H", "Overall": "1.0", "Content": "I guess it's a game of luck with this product.  Either you get one that works, or you get one that doesn't.  From the get-go, it took numerous tries to get the thing to turn on.  Then after less than a day, it just died.  In the brief time it worked, it was fine.  I ended up sending it back and getting a different brand and more expensive tablet.  Amazon service was exceptional.", "Title": "Good for less than a day", "Date": "February 10, 2014"}, {"Author": "Topper Shopper", "ReviewID": "R1E1CXH3D19DLN", "Overall": "5.0", "Content": "In addition to all the good things the other reviews have stated, I started to take this tablet on overseas trips instead of my small laptop. It's not just lighter; you don't have to take it out of bag when going through airport security, just like a kindle!", "Title": "Nice Little Tablet", "Date": "February 8, 2014"}, {"Author": "Nadia H", "ReviewID": "R4Y9YQ3B03T5M", "Overall": "1.0", "Content": "I purchased this item thinking it was a very great buy. I was sorely disappointed. Bought it as a Christmas present and by January the tablet failed to accept charge and would not power on. Returned it to amazon for a replacement. Same thing happened again!!! This time i want a refund. who knows if i'll get it because the window for return is shorter than before.  There is a saying in my country that cheap things ain't good and good things ain't cheap. This is definitely the case with this tablet. Save your money and purchase a  better tablet and brand!", "Title": "Don't buy!", "Date": "February 8, 2014"}, {"Author": "Monica", "ReviewID": "R1D4FP11NA305H", "Overall": "5.0", "Content": "I purchased two of these for my two granddaughters.  I could not have done better for Holiday presents.  They were so happy. Connected right away to wifi and the screens are so bright and beautiful.I would have gotten one for me except that I need mine 4G-4G, so I went with the Sprint Galaxy 3 Tab.  These are as fast and skinnier and slicker looking.  I love my Galaxy tab 3, but these are really great!I now have one ASUS monitor and my grands two tablets. Very happy with all of them.  Good job ASUS!", "Title": "Awesome tablet for the money...", "Date": "February 6, 2014"}, {"Author": "Brian Hall", "ReviewID": "R3W2V0XFDA8WDJ", "Overall": "5.0", "Content": "Great tablet fast and battery last a long time top of the line for the price you can't beat this tablet.", "Title": "great fast tablet", "Date": "February 5, 2014"}, {"Author": "Amy", "ReviewID": "RCKMNQND0JQOF", "Overall": "5.0", "Content": "Perfect size works great very compatible battery life is long lasting.. it is just a great tablet does everything i hoped it would", "Title": "love love love it...great for my 10 year old but i also love it..looks and works great", "Date": "February 2, 2014"}, {"Author": "Chad Kruse", "ReviewID": "R3CN4NT3NL2QCU", "Overall": "1.0", "Content": "I bought this tablet for my wife for Christmas; I was between two tablets and chose to go with the ASUS with the hope that name brand would support and deliver a better product.  Within a week of receiving the tablet it suddenly for no reason died and would not turn on.  We returned the tablet and received a new one; this one lasted 3 weeks this time before going black.  The tablet was only outside it's protective case for the 5 minutes it took to open the box and transfer to the case.  The tablet was never dropped or anything of that nature.  Extremely disappointed in this product and will think twice before purchasing anything ASUS in the future.", "Title": "Dies in less than a month.", "Date": "February 1, 2014"}, {"Author": "Michael Covellone", "ReviewID": "R38WQQGU19F3X", "Overall": "1.0", "Content": "After 3 days the tablet crashed and I had to send it back to the manufacturer for repair. I just got it back - we'll see!", "Title": "Quick crash", "Date": "January 31, 2014"}, {"Author": "Andy", "ReviewID": "R3A5C9EQSKF6XI", "Overall": "1.0", "Content": "It was a great tablet for a couple of months then it stopped working.  The tablet no longer turns on or charges.  ASUS customer service was no help.  After doing some research on how to fix the problem, I found many people with the same problem but no solution.If you are going to get it, purchase it with an insurance plan or just get a better tablet.", "Title": "Great Tablet While It Lasted", "Date": "January 30, 2014"}, {"Author": "stevegso", "ReviewID": "R188YP1B39QZWK", "Overall": "1.0", "Content": "I ordered TWO of these tablets as gifts - one works just fine and the second wouldn't restart after being charged the first time.  Amazon was great - we returned the defective tablet and they sent us a replacement.  The replacement tablet has the SAME issue...it worked once, but after charging the second time it would not turn on.  Went through all the procedures mentioned online about finding a fix.  Nothing worked.  We are returning the second tablet and will get a refund.  In the mean time, the first tablet still works just fine!  So, one out of three tablets worked.  Not good odds, if you ask me!  I can only give one star, even though the first tablet works great.", "Title": "Technical Issues After Recharging", "Date": "January 30, 2014"}, {"Author": "Amazon Customer", "ReviewID": "ROB8KD7WF8CM4", "Overall": "5.0", "Content": "Worked right out of the box.  Haven't had much time to play around with it yet since it is a Christmas present.  I loaded games and updated the system.  Easy to use and very responsive.", "Title": "Great", "Date": "December 2, 2013"}, {"Author": "Amazon Customer", "ReviewID": "REN8L8S4ZAHOT", "Overall": "5.0", "Content": "My first tablet was a Lenovo ideatap 2107. Poor quality display, heavy and not really fast. But this ASUS tablet is wonderfull. It is smart, it has a very good battery the screen is really good. Love it.", "Title": "Love it. Very good tablet", "Date": "December 2, 2013"}, {"Author": "JAMES R IRONS", "ReviewID": "R32VU7WOH3V4KX", "Overall": "5.0", "Content": "Clear, crisp display, more than adequate processor speed,  fast networking, works well with Netflix, Hulu and media stored on home lan.  Also useful as reader interfacing with Calibre. Was able to root it using framaroot.", "Title": "Excellent small low-cost tablet", "Date": "November 29, 2013"}, {"Author": "Catherine Grothe", "ReviewID": "R2KPH4OTZG6TFY", "Overall": "5.0", "Content": "After much research I recently bought the Asus Memo Pad HD 7 for $130 and it has performed up to expectations. Definitely the most bang for the buck although it's not a \"super performer\" but performs well for a standard user.  Quad core, 1.2 GHz, Android Jelly Bean 4.2, 16 GB internal storage plus SD card slot, long battery life (haven't fully tested battery for all day use yet, but definitely lasts more than a few hours, and lasts days just sitting on standby), 5 MP rear camera, and 1280 x 800 resolution.  Only \"negative\" I can think of is that it has a hard plastic body instead of something more durable...but since I always planned to keep it in a case even when in use this was never a problem for me. I have not had any issues with the SD card spontaneously \"unmounting\" like others have posted, so don't know if they got a \"lemon\" or if my protective case keeps the SD slot from being bumped. IMPORTANT NOTES:  1) Just make sure you get the HD version as well as the 16GB version if you want all the features I listed.  2) I followed the directions and fully charged the tablet before turning it on (trying to prevent the battery issues some others have listed). I've had the tablet about two weeks.", "Title": "Biggest Bang for Your Buck in my opinion", "Date": "November 29, 2013"}, {"Author": "L.Gildart", "ReviewID": "R1VKYLTTYH1OSP", "Overall": "3.0", "Content": "UPDATE: After some very careful cycling (after reading about instances in which allowing the battery to drain completely apparently killed it), my standby time has improved quite a lot. It's still nowhere near as good as my iPad (currently at 91% after 5 days without a charge) or the Samsung (96% after two days), but the MeMO was at 89% after standing by for 2 days, and that's much better than how it started out.This tablet is like a bad high school boyfriend: cute as all get out, lots of potential, but some of its behaviors are borderline unacceptable.I bought this a week ago. It's the second android tablet I have bought in a month; the first is a Samsung Galaxy Tab 3 7.0, and, for what I need in a 7 inch tablet, it is pretty darned good. I also have a 4th generation iPad (retina display) and a first gen iPad (so obsolete, but so reliable).Next to all of the other tablets I own, the Asus Memo Pad HD looked great on paper - the quad-core processor, the better display resolution than the galaxy, the way lower price, the fact that I could get it in green (okay, silly, I know, but cute!)But, check it out: battery life is abysmal. I don't just mean while you are doing things with it. Actually, it performed comparably with the 7 inch Galaxy on an hour long streaming video, going from 99% charged down to 92%, where the Galaxy went from 100% down to 94%. It's the standby time that is highly problematic. To see how the battery compares to my other tablets, I charged everything and then left all of the tablets on standby overnight and all the next day, doing nothing. At bedtime, the newer iPad was at 100% still, the Galaxy at 97%, the old iPad at 96%, and the MeMO pad was dead.Today after testing the battery on video playback, I left the Galaxy and MeMO sitting next to each other and came back to check later. Galaxy was down to 90%. MeMO was at 82%. I have it on the ultrasaver power setting. I just don't get why it would run down so fast.Next comparison - displays. My 4th Gen iPad is beautiful, and I thought I might be a little spoiled, but the MeMO's display is very clear. Video renders smoothly with excellent motion. Resolution is 1280 by 800 (compared to 1024 x 600 on the Galaxy). Totally doable. The Samsung seemed less smooth. However, the Samsung performs better on sound and touch. Dialogue is a bit muddy on the MeMO, and upper range is not quite bright. The touchscreen seems to have the slightest hint of lag, as does the accelerometer. Not terrible. But noticeable.The MeMO pad camera is a lot better than the Samsung - especially in low light - but nowhere near as good as the 4th Gen iPad (which also has led flash).In terms of form factor, the MeMO is a little bit bigger, but still fits in your hand. Not sure it would fit in a pocket like the Galaxy. Or that you would want to put it in one, since the MeMO is lighter and seems quite a bit less sturdy. It will fit in a very small man-bag or pocketbook.As for pre-loaded software, features, etc., the Galaxy comes with a nice voice assistant, but you can get a very similar app for free at the app store for the MeMO. Galaxy has better alarm sounds (I think), but both alarms are reliable and fairly customizable.So which little android tablet is better? Well, with the battery issue, I have to say the Galaxy is better. By quite a bit. The MeMO would be great for portable entertainment, if the battery lasted longer. Without good battery life, the thing just isn't that portable. And the lower price doesn't make up for it. Not in my opinion, anyway.OTOH, if you're looking for something that will be plugged in most of the time, like a bedside tablet/alarm/home automation controller, this will be great and it does save you some money over the Galaxy and a ton of money over any iPad.", "Title": "Weak Battery Life", "Date": "November 26, 2013"}, {"Author": "Comtap", "ReviewID": "RVSNSM9NNHSFP", "Overall": "5.0", "Content": "Worth every Penny,  I recently bought the Dragon Touch 7in tablet from amazon for my wife for a present and it was a total piece of garbage and sent it back and bought this instead. and the Asus Memopad HD is Fantastic it cost way less than a kendel fire but with all the same funcionality. I highly Recomend this to anyone looking to get a new tablet.  she has played with it heavly for 4 days so far and it still has half a charge on the battery before it runs down.great Picture Quality on Screen and taken with the Cameras both front and back.fast and easy to usegood operating systemgreat 10 touch display very responsivethis is a MUST BUY!!  we are very happy with it", "Title": "A Terrific Product !!", "Date": "November 26, 2013"}, {"Author": "Jennifer Dupree", "ReviewID": "R11R2RYUZU1DMC", "Overall": "4.0", "Content": "Great value tablet this one. Whilst some reviewers have commented on the construction of tablets, saying it feels a little cheap and breakable, I have found it to be a study little thing, sure it feels light weight but you are not going to beat a whale to death with it, are you? It should be light weight and functional.  The resolution is better than its predecessor and the only complainers will be those looking for a hard core gaming platform, which this is not (no would you expect it to be given the price) and those who want to show off their cliquey device. Another reviewer commented on a power lag but I can’t say I have ever experienced a problem and I use this tablet for email and creative writing.", "Title": "In this price it was the best one I found", "Date": "November 24, 2013"}, {"Author": "cactus", "ReviewID": "R19CX8280QPNNH", "Overall": "5.0", "Content": "this tablet is just the right size and the quality is better than it should be at this price point.i've had mine since they were first available and i waited till i put some miles on it before i reviewed it.it's great.the android operating system is showcased perfectly in this machine. just enough apps, awesome display, mico sd card reader, slim and light. it's perfect right out of the box (i did run the firmware update after i charged it)!i've pushed it hard and it won't freeze.i can't really give you examples of torture tests, because i take care of my stuff. however, i do like to tweak my computers, and i feel that this one is good enough as it is.i put off buying a tablet till this one came out and it payed off for me.it's just a great quality and well engineered product.", "Title": "perfect.", "Date": "November 23, 2013"}, {"Author": "DMC \"DMC\"", "ReviewID": "R3ND0JULOIBVKU", "Overall": "5.0", "Content": "awesome awesome awesome... this pad does it all.  i say Asus hit it on the head.fast. and fantastic graphics. the reaction and capabilities of this pad are like lighting.Asus has made the world of computers easier to take with you..... goood bye  laptop!", "Title": "computer heaven", "Date": "November 22, 2013"}, {"Author": "Ravi", "ReviewID": "R1ZN8BEDAQ61HB", "Overall": "3.0", "Content": "It was a gift to someone old who couldn't use it. So I decided to keep for myself. 5 days of usage and issues started to show up.1. The body is fragile and loose as if there are some screws left untight. There chripring noise if you move tablet up and down slowly. That makes sure this tablet is not made with due care or one can blame entirely in plastic body too.2. \"Micro SD card unexpectely removed\" which if happens during watching a movie or playing games becomes very annoying. Since one can move couple of apps without rooting this tablet the problem multiplies as you either keep all necessary apps on phone storage or get sudden card removed notice.3. WiFi is horribly disconnecting even though I'm a half meter away from my router. This makes surfing stressful and failed downloads. Annoying when I download large files and all of a sudden WiFi gets disconnect. Reception of WiFi is also not great as it should be. On my mobile I get full strength signal in my next room whereas this tablet struggles.4. Too many unwanted apps by Asus. Don't know if I require any ever. Have disabled them, can't uninstall.Now some positive - this machine is beast in speed, usage and battery life. Be it playing high def games or be it running tab on WiFi for almost 10 hours or watching movies this tablet doesn't disappoint.Screen is superb, glows well outdoors and pretty viewable. Lacks automatic brightness but one wouldn't require if not used too often in changed environment like in and out too frequently.Camera is adequate for Skype or Google hangout (Skype's old version is running well, new one keeps crashing). Rear camera is decent for random clicks. Gives good result. Video recording too is very clear and in HD.No problems faced using any app as of now. All games and apps supported. Looking to buy a miracast display adapter preferably netgear ptv3000. One thing that stops me doing so is mood of returning it back. Have written to Amazon and guys were very nice. Let's see how it pans out.Taking away 2 stars for micro SD issue, weak WiFi and plastic body which is very fragile to hold. Could have given 5/5 with double thumbs up had these issues were not there. Also worried on warranty as being a user in India I doubt Asus India will oblige worldwide warranty as they are sort of unprofessional here.Will keep updated as and when I see anything to be shared. Thanks for reading.", "Title": "Have some serious issues, still a good bargain for price. Not very satisfied, but that's life.", "Date": "November 22, 2013"}, {"Author": "MATTHEW EDDY", "ReviewID": "R1QU0K3ITT1D8O", "Overall": "5.0", "Content": "Really love this tablet, does everything I want and has the ability to expand it's storage with the micro sd slot.  Screen can be a little bad with glare but a matte finish screen protector really helped cut that down.", "Title": "it's what i had hoped for", "Date": "October 15, 2013"}, {"Author": "Rick Paterala", "ReviewID": "R16B0XVX9JR7S", "Overall": "5.0", "Content": "Best tablet I have found for the price.  Not complaints as of yet, wifi connection extends the entire range of the home over 3,000 sq ft.", "Title": "Great tablet for the price", "Date": "October 13, 2013"}, {"Author": "Kandace Roque", "ReviewID": "R3TZ211PCRPMUK", "Overall": "5.0", "Content": "I have had it for a few days now and I love it! The screen display is crystal clear. Movies and TV shows look perfect. I love the color on the back. It is extremely thin so I will be looking into getting a cover for it. Both cameras are surprising good and take a decent picture. I was pleasantly surprised at how long the battery lasted, about 11 hours. It runs smoothly, the apps open up and load within 2 seconds. I know people who have the Galaxy Tab 3 and it runs the same, if not better. If you are looking for a tablet and don't want to pay $200 or more, this is the one!", "Title": "Great tablet!", "Date": "October 13, 2013"}, {"Author": "Rocket Rancher \"Laura\"", "ReviewID": "R229ACYJHU1EYL", "Overall": "5.0", "Content": "I bought this for my daughter; she's a junior in college. Said she didn't need a tablet so much to take notes, but needed it to keep electronic \"handouts\" the professors give her. She loves it and I am jealous. I'm thinking of getting myself one.", "Title": "My Daughter Loves it", "Date": "October 8, 2013"}, {"Author": "Beatlelover", "ReviewID": "R21HZYZ304KGC8", "Overall": "5.0", "Content": "Fantastic... Great sound, very responsive... Picture is crystal clear, very comfortable to hold in one hand... Tried a basic Acer Iconia before purchasing the ASUS, the ASUS put it to shame... I wish I had the money to hand these out to family and friends... I have an ASUS laptop and have had it about 6 mos; love ASUS products! Thank you for a wonderful product!", "Title": "ASUS MeMOPad HD 7-Inch 16 GB Tablet, Blue (ME173X-A1-BL)", "Date": "October 7, 2013"}, {"Author": "Planker", "ReviewID": "R2NIIENL0N0Z32", "Overall": "4.0", "Content": "The tablet is excellent for the price. The only major issue is that there are no physical navigation buttons, only soft keys.The soft key bar takes up almost a 1/2\" of diagonal screen space, reducing the actual screen size to 6.5\".Asus needs to work with Google to create an Android update that will allow full screen by hiding the soft keys or making them semitransparent. This would greatly improve the user experience.", "Title": "Memo Pad Android 4.2 issue", "Date": "October 7, 2013"}, {"Author": "Hung N.", "ReviewID": "R1C72W2K4OH4IA", "Overall": "4.0", "Content": "It's working good. But there was a little bit problem. When I tried to move it around, then MicroSD card slot won't recognize my \"microSD\" and I put on table micrSD works again.", "Title": "MicroSD problem", "Date": "October 5, 2013"}, {"Author": "Marie Daniels", "ReviewID": "R27YOEVHDH7TBV", "Overall": "5.0", "Content": "My first tablet yeah! Its pretty nice for the price and really easy to setup. The manual says that you should fully charge it before turning it on for the first time. Didn't take long to do that. Also within a few minutes there was a OS upgrade that took about 15 minutes to download and install. Its not to heavy, looks nice and for the price I can get past the finger prints lol. Also make sure to go online and register it. Anyway I would recommend if you need this one buy it.", "Title": "Love It!", "Date": "October 5, 2013"}, {"Author": "Cindy R. Triplett", "ReviewID": "RJE7ES5KWHO7", "Overall": "4.0", "Content": "This was a purchase made by my husband.  It is exactly what he wanted, and therefore makes me happy (not dealing with his unhappiness)", "Title": "Tablet", "Date": "October 4, 2013"}, {"Author": "diego", "ReviewID": "RZ2HSU8GLU6LW", "Overall": "5.0", "Content": "What an awesome tablet, this device's screen it's awesome for the price point, the performance is more than adequate, at least for my girlfriend that just plays The Simpsons and UNO and open like 15 tabs on Chrome, runs all without problems, battery life is good too but what we're in love is with the design and that beautiful green color. The cameras suck but that was not the reason we bought it. For the price point go get a device with a decent screen, good overall performance, good size and good speaker output. Fully recommended", "Title": "Great Value for your money", "Date": "October 4, 2013"}, {"Author": "Jacqueline Rogers", "ReviewID": "R1JFF5J87ASYFK", "Overall": "4.0", "Content": "Packaging could have been better. It's literally in a box with no padding or cover over the tablet. Besides like the size and quick response. The power buttons almost seemed placed under the tablet and not alongside. Other than that for the money it's fine.", "Title": "So Far so Good", "Date": "February 26, 2014"}, {"Author": "R.R", "ReviewID": "R3O5OMQZNHE27G", "Overall": "5.0", "Content": "I bought this as a Christmas present for my mom. She is not really a tech person and I wanted something inexpensive but still with decent specs to introduce her to tablet world. Definitely worth the price. I paid $129.99 and worth every penny. Works very smoothly. The display is crisp. Camera is great. She is really enjoying it. I am thinking about getting one for myself. I would definitely recommend for someone who is on a budget and wants a bang for their buck.", "Title": "Excellent Product!", "Date": "January 12, 2014"}, {"Author": "Kiarra O'Neal", "ReviewID": "R324UIZEVZE7OH", "Overall": "1.0", "Content": "In the palm size owners manual if you happen to read any of it you will find a very fine line that states \"do not leave plugged up once charged memo pad 7 is not designed to stay plugged in long periods of time\" try to explain that one to a responsible 6yr old. Need to put a warning label on this one \"ASUS\" complete waste of time", "Title": "Over Charging issue", "Date": "January 9, 2014"}, {"Author": "george", "ReviewID": "R3AC45AI7WIFKW", "Overall": "1.0", "Content": "It broke down after 4days  it was a Christmas gift  not very happy about it now I have to return it", "Title": "Return Xmas gift", "Date": "December 30, 2013"}, {"Author": "Raymond", "ReviewID": "R1W18VG09Y6WD2", "Overall": "2.0", "Content": "I bought this tablet about a month ago and I had a wonderful experience with it until yesterday.  For the tablet itself has some impressive features: A colorful screen; responsive processor; high resolution(1280 x 800 for 7\" tablet); good battery performance and Android 4.x.  It's compact design makes it easy to hold and it is compatible with all my other devices.  I have continuously enjoyed using it until yesterday when I plugged it to charge and it won't turn on again.  I have try using different cables and outlets, still nothing.  Based on some of the reviews I have read here, I guess it is a common problem.  I am calling ASUS support and hope they can provide me with a solution.", "Title": "Great tablet if you buy one that works.", "Date": "December 26, 2013"}, {"Author": "P. Lancho \"patlancho\"", "ReviewID": "ROQYDHX7HCKNI", "Overall": "1.0", "Content": "Just I  said in the header, I bought a MEMO PAD HD 7-inch and I received it trough EPS courier, the package was unopened and sealed, then I turned on and put to charge, but it never turn on again, I write to AMAZON and they answer to me that their police it is that when you bought something with a carrier, they not replace or reimburse it. I carry the tablet to local representative of ASUS , they check it and say to me it has bad card, and the guarantee of my tablet is not valid here, because I bought it in United States. So if you live outside United States, you must be careful with this tablet because they can be a problem. I am very disappointed with ASUS because the tablet was broken and with AMAZON because they won a lot of money with people like me, in this global world, but when we have some problem, they did not assume the responsible.", "Title": "I bought an ASUS MEMO PAD and it never functioned", "Date": "December 25, 2013"}, {"Author": "Jason Anstice", "ReviewID": "ROKNVWWMZKNFY", "Overall": "2.0", "Content": "I ordered 2 of them. Played with the one for 10 mins and it shut off and will not turn on now.. not the battery.. junk", "Title": "BAd luck!", "Date": "December 24, 2013"}, {"Author": "wm.", "ReviewID": "RXL6WINRBIMH8", "Overall": "1.0", "Content": "Within 48 hrs. of getting this, the sound \"broke\" after a firmware update. It was barely audible and would not allow for any volume increase. \"Support\" (e-mail only as I couldn't find a number to call) walked me thru a factory reset, and all was fine...other than the fact that there was a great deal of frustration with pages loading. Sometimes it seemed fine, and other times very slow. Since the screen was really too small to do many of the things I wanted to do, I decided to return it. When I tried to do another factory reset, it froze up again.", "Title": "not reliable", "Date": "December 20, 2013"}, {"Author": "Patrick Kohler", "ReviewID": "R3JM8G9J51C678", "Overall": "3.0", "Content": "So I really like using this tablet. It is snappy, not to much bloatware. My first one I had to send back to Amazon after a few days due to it not turning back on. My second is currently at the Asus repair center for the same problem. Not sure why it is having this problem. Otherwise it is a great tablet. Hopefully I was just unlucky to have gotten the percentage that are expected to fail. Back in my retail days, the talking point was that 10% of all electronics are dead out of the box.", "Title": "Great in operation, but may have design flaw with the power", "Date": "December 14, 2013"}, {"Author": "Samantha A Tidd", "ReviewID": "R2YKXCQBRXJ8V4", "Overall": "3.0", "Content": "I was impressed with this tablet until I attempted to run Netflix. I can only get the sound, with no video, to run. I reinstalled the app several times with the same results. I have checked for system updates to get android 4.2.2, but after several attempts it still says the system is up to date (4.2.1).  I called ASUS customer support (no esay task) and they said it must be a prblem with the app.  I called Netflix customer support (only slightly easier to do) and they said the device must be defective. Typical run around.  However, I am hoping this is just a bug with this particular device. I'm going to try replacing it to see if I have the same problem with another unit. I suspect I might, but I'm giving ASUS the benefit of the doubt before seeking out another solution.", "Title": "Kind of disappointed.", "Date": "December 3, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3ANOHFWJU3LQS", "Overall": "5.0", "Content": "I tried so many tablets to get this one.  It's a good size, bigger than my beloved iPod and smaller than my husbands gargantuan tablet so it's easy to hold.  It has great internet speed and is able to show video quite well, I have no complaints.  I have even put the Dish app on here so I can watch tv on it.  The few games I play work without a hitch, photos show well and it takes decent photos, too.  I think this is one of the best tablets available and I should know, I think I bought them all!", "Title": "Four tries to find a tablet I liked and this is it", "Date": "May 25, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RISQR5BXJ2NCR", "Overall": "4.0", "Content": "PLEASE HELPCan someone tell me how to get around the Parental Lock feature when you've forgotten the pass code?", "Title": "Parental Lock", "Date": "May 5, 2014"}, {"Author": "ProductSleuth", "ReviewID": "R15R4SZE1WWJ0H", "Overall": "5.0", "Content": "I have several of these units.  All have done reasonably well.  The one failure was in the auxiliary storage stick.  Upon removal, it snapped out of the unit and apparently broke the lock for the SD stick.  As it happened, this unit could be switched to the one position that  did not need additional storage.  Note: Be extremely careful in the removal of the memory stick.  If it snaps out of the slot, it can easily eject several feet from where you are.  It could also damage the SD lock.The display is clear and readable.  Battery life is several days in standby and approximately 10 hours under normal use.  There are some free apps that help in maximizing battery life by shutting down unused applications when they are unused.  I find that I use this memo pad as often as my much more expensive iPad.I would definitely recommend the purchase of a case.", "Title": "Nice Unit", "Date": "May 4, 2014"}, {"Author": "Jeremiah", "ReviewID": "R1PQ4YICR09ZE6", "Overall": "4.0", "Content": "Touchscreen is sometimes finicky, but it may work well with a stylus. Also, very susceptible to fingerprints and streaking. Display and sound are great.", "Title": "Works great for my use, which is light recreational.", "Date": "April 29, 2014"}, {"Author": "MrTwistoff \"hobbesclarity\"", "ReviewID": "RDDPZOKEYJ0QX", "Overall": "5.0", "Content": "My first tablet. And I am really enjoying having this. It's small enough to slide into cargo pants pockets, and quite handy to have on travel for maintaining email/Skype calls/etc. Really happy with this purchase. Perfect size - got a padded soft case for carrying it around. I do have an issue with the microSD card disconnecting a lot, need to test against another brand. Other than that no complaints. (NOTE: the micro USB connection cannot be used for a keyboard - not supported. It only serves to connect to a PC, or for charging. Important to know.) Also this did not come with a Swype Keyboard, so I will probably by an app for it - otherwise typing emails is slow (although the predictive word generator is pretty good at learning words I use).", "Title": "A Great Deal", "Date": "April 28, 2014"}, {"Author": "John", "ReviewID": "R3UTZPSOEOA4A2", "Overall": "4.0", "Content": "I love this tablet for the price. Make sure you install the system update right after getting through the Android setup procedure or it may start coming up with exceptions. Also, the screen is not ridged like other tablets so be careful on cleaning the screen. I think I broke the screens touch sensors in my first one by pressing too hard cleaning the screen. Many people say get a screen protector for it and I think that is wise advise.Has lots of power. Lasts a long time on a battery charge.great wireless capabilities (no NFC). And get a 32 gb flash card to store your data on.", "Title": "Good tablet for little money", "Date": "April 27, 2014"}, {"Author": "Victoria R.", "ReviewID": "R3HZDKU2MPWQ7Q", "Overall": "5.0", "Content": "I like the tablet,  it is very easy to use.  It downloads fast, I can connect to wifi in different locations and feel safe using it.", "Title": "Tablet", "Date": "April 24, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2F6E5DRARDFON", "Overall": "4.0", "Content": "The basic functions like screen resolution and response are better than expected. The user interface is easy to use and videos play very well. I would recommend this tablet to anyone.", "Title": "Pleasantly surprised!", "Date": "April 23, 2014"}, {"Author": "Doctor Anne", "ReviewID": "R2DB7Q0R5H48X5", "Overall": "5.0", "Content": "Pros:Cost! This is a good deal. Much less expensive than a iPAD miniGreat Kindle-substitute, in color.Small and lightweight-fits in all but the smallest of my pursesI can check my email, facebook, and weather on it.Good camera!Cons:considering the price, noneDifficult to type long messages, but that is true of any pad", "Title": "This is quite functional for trips when I do not wish to carry my laptop!", "Date": "April 22, 2014"}, {"Author": "Amy C.", "ReviewID": "R16JN44Y4FLZFE", "Overall": "5.0", "Content": "For the money this has to be the best tablet you can buy. If you do research online it has a good reliability rating and a high battery life rating compared to other tablets. I can attest to both, and I go days without charging the battery, depending on how often I use it. Hours and hours and hours of gameplay!  Graphics are good too.  Plus it's android, so you get a lot more free apps and don't have to worry about conforming to the standards of Apple or other tablet devices.", "Title": "Great tablet value!", "Date": "April 22, 2014"}, {"Author": "N. L.", "ReviewID": "R1H16EOJGVXZXE", "Overall": "5.0", "Content": "Got it for my wife.  I configured it and added some apps for her.  So far she's been very happy with it.", "Title": "Got It For The Wife, She Likes It", "Date": "March 23, 2014"}, {"Author": "M. Ondich \"MelLO\"", "ReviewID": "R1XLDZJL3077QI", "Overall": "4.0", "Content": "I bought two; one for my daughter, and one for me.  I think she's permanently attached to it.  She has been playing The Sims a lot, as well as other games and has not complained of any issues.  Battery life is amazingly long for what I've seen in tablets.  I don't use mine a lot and will last several days while turned on, but locked. I was surprised to pick it up almost two weeks later and still have 30% battery left.My daughter charges hers every night, but it lasts several hours on weekends when she is off and on all day.  YouTube, Netflix, etc looks good.  The screen is crisp and clear.  Typical Android device, but I do miss the Swype technology my Samsung phone has.The screen does seem to have a little tiny lag or delayed reaction.  I'm used to my Galaxy S4 which just does things immediately when touched, this I have to pause for a split second on each touch to get it to register.  Irritating when you're highly impatient like I am.  And there seems to be some weird error that happens, if I back out of a screen I seem to get stuck in a loop of an error stating something has stopped.  It doesn't happen all the time, and I find if I just hit the home screen then run a task kill it doesn't happen.  But so far my only complaints.", "Title": "Good value for price", "Date": "March 11, 2014"}, {"Author": "tyler", "ReviewID": "R2ORPSZM5CDSU5", "Overall": "3.0", "Content": "I've had this only for a day so I may change my mind later but so far so good. I had to download an app to play movies, I feel this should already be on the tablet. I like that it's easy enough for a two year old to use, even though the screen is a bit smaller than expected (might be an issue). Still checking it out though.", "Title": "Nice buy!", "Date": "March 11, 2014"}, {"Author": "M. Manternach", "ReviewID": "R2AWG0KQOY8S78", "Overall": "4.0", "Content": "I got the Asus MemoPad for the kids for Christmas.  It has been a good product.  The only issue is battery life, and it is very slow to come on (one might have to hold the on button for more than 10 seconds for a power up).  It does not have a swype capable keyboard installed which is annoying once you come to expect it in a device.  Otherwise, it is fast, perfectly sized, and fun to use.", "Title": "Nice handy tablet", "Date": "March 11, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RCVXNMM76PIGQ", "Overall": "5.0", "Content": "My friend has a Nexus and I researched information noting that Asus is a manufacturer of that tablet, so I took a chance at this more generic one. (I am NOT a technologically savvy person.) Being the owner of a Samsung Galaxy Tab 2, as well as having messed around with my friend's tablets from other brands, is the only credibility I have when I say that this tablet is amazing. For a prices that is less expensive than a Galaxy, I get great camera shots (Galaxy disappointed me with this when I first owned one) with what is apparently 5 MP (although the front-facing camera is only 1.5 MP), and the speed of this tablet is impressive. Also, I do not have to worry much about the battery life. Those who own a Galaxy will know that at some point throughout an eight-hour day a worry will sink in about whether or not to plug in our tablet. This (Asus) tablet actually makes me feel secure not only about not plugging in the battery, but about not having to wait long for it to recharge once it does require to be plugged-in to an outlet. Wow. The battery (again, not a technologically savvy person) charges quickly and lasts probably more than the 10 hours noted on the product description. I am noticing that I can go on and on about this product, so I will only say this: buy it. It made me happy and will likely make others like me happy as well. (Note: I was worried about reviews concerning glitches on this device. After a week of ownership, I think I know what that is about. It is not that this device has glitches, but that it is very rigid in the way its features function. For example, I have noticed that I have to reopen my setting app if I choose to unpair a device through a bluetooth connection. However, for the price and great features that come with that price, one can easily adapt to this extra step in the process.)Thanks Asus!", "Title": "Nexus at an inexpensive price?", "Date": "March 10, 2014"}, {"Author": "ananthalakshmi", "ReviewID": "R2XYBCDYPJET2D", "Overall": "3.0", "Content": "Good for through price I guessGiving lite troubleStill getting good in a whileI am OK with the product.", "Title": "good", "Date": "March 10, 2014"}, {"Author": "JON E SHORT", "ReviewID": "R7YOGEDYO422Y", "Overall": "5.0", "Content": "We bought this tablet for our 6 year old daughter. It is perfect for her! The Play Store is exactly like the Play Store on the Android phones which is perfect bc she was able to download all of the apps she was already familiar with from my phone. Camera takes great pics! This is an exceptional tablet at a low cost.", "Title": "Extremely satisfied", "Date": "March 9, 2014"}, {"Author": "collegekidd16", "ReviewID": "RWHK0Q5RAJEWV", "Overall": "5.0", "Content": "This tablet is great. Picture is great, camera is great, love that you can expand the storage, very few glitches, and a great size. Sound could be louder and the back gets scratched quickly, so make sure you buy a case.", "Title": "Great tablet, great price", "Date": "March 8, 2014"}, {"Author": "Valeren", "ReviewID": "R292ZZ2F4WHU8T", "Overall": "5.0", "Content": "I have had product for 3 weeks, although I did not purchase on amazon i did get a (returned) pad from the store. In simple words the tablet is exactly what i needed. I have a tf300t and its has worked very well with minmal issues for 2 years and the memo hd was its perfect companion.  The main pupose of the tablet was for flying and being able to look at approach plates and maps. However because of screen resolution and overall solid performance of tablet ill probably use it for more. The gps works very well even at 27k feet. I would recommend to others but looking at other reviews the warranty might be a good option.", "Title": "Sokid tsblet for 150$", "Date": "March 7, 2014"}, {"Author": "Al G", "ReviewID": "R1XPCHLZ9BCA55", "Overall": "5.0", "Content": "Great bang for the buck!  I wanted a capable tablet with good specs that would serve my needs.  This tablet has a lot of higher priced features in a Mid-price range.  It has a Quad Core 1.2 GHz processor, 16 GB Flash Memory, 1 GB RAM Memory with a 10-hour battery life.  It also has a 5MP rear camera and a 1.2 MP front.  A lot tablets don't have any rear facing camera at all, especially within this price range!  It has built in WIFI which means you can connect to WIFI when available and then don't have the ongoing charges from a wireless carrier to deal with. The screen is also a respectable 1280 x 800 resolution which means the colors will pop and you don't go blind trying to read anything with it, especially a book.It's updates have been to Android Jelly Bean 4.2.2.  Hopeful Asus will make available and release updates to Android 4.4.2 soon.  An entry level tablet can leave you wanting more and a premium price of $400 will make you poor but this tablet is respectable for all but the super power user.  It's 16GB memory is fairly large but if you need more it can be expanded with a SD memory card for massive music or pictures storage.  And with Cloud Storages available you may prefer to use that for access from multiple devices.  With access to \"Google Play\" you can have hundreds of thousands of free apps to choose from and make your tablet do what ever you like.  Can't go wrong with this tablet, a great value from a respected manufacturer!", "Title": "Perfect Mid-Priced Tablet", "Date": "March 7, 2014"}, {"Author": "Vinny", "ReviewID": "RLUDJNC9FGY0Z", "Overall": "5.0", "Content": "I received this tablet for Christmas 2013, and I absolutely love it every single day. Connection to WiFi networks in terms of bandwidth effectively doubled from what my phone can do. Handles Madden 25 Mobile without any lag at all (To give you an idea of what this tablet can do in terms of gaming), and has an absolutely beautiful display! I use it for everything, work, play, study, and it has yet to give me any problems!!! The only way for you to truly understand what I am saying...buy one! :)", "Title": "Great Tablet!!!", "Date": "March 6, 2014"}, {"Author": "David Galli", "ReviewID": "R2CJ1ZZ2BB2DGP", "Overall": "4.0", "Content": "Great device for work! Has everything you need to get organized because everything syncs to Google. I docked 1 star for the stock apps that are installed which can't be removed. If you are considering a tablet, this is a great tablet at a great price. Plenty of space with the extra MicroSD card (sold separately). The only issue is you cannot move apps to the SD. Only personal files and pictures or videos. All-in-all, a great little tablet.", "Title": "Great tablet for organization!", "Date": "February 18, 2014"}, {"Author": "Steven L. Bledsoe \"RC Jet Freak\"", "ReviewID": "RI1S9S7Q50SFX", "Overall": "5.0", "Content": "I did a lot of research before picking up 2 of these. I was getting tablets for my 9yo twins, so I was looking at price, durability, and something that they could grow with. I didn't want to by some child specific built tablet which some were even higher priced than the ASUS or the cheaper ones that didn't get very good reviews. In my weeks of research it became evident that the best bang for the buck for this size entry level tablet was between this and the Nexus 7. Both have their pros and cons but they are pretty close in comparison. Everything will tell you the Nexus 7(newer model) is best but it will cost you more too. They said the new ASUS MEMO HD was closely designed to the previous Nexus 7. For me it was not worth the price difference since this was going to be for my kids first tablets. These also had the sd card expansion the Nexus does not. We have had these for about a month and they are used non-stop by my boys. If you are used to using and android based smart phones you will have a easy learning curve in setting up and using these tablets. It runs fast. We have had no issues with internet or running games. My boys run Netflix constantly and there has been no lag. This also has a front and rear camera with decent quality. I set them up with Skype accounts so they can video chat with the grandparents anytime they want. Looked good on our end and my parents said the picture on their end was good too. I find myself grabbing their tablets a lot to use vs. my laptop or cell phone now. I think the viewer angles are good. The only \"con\" I can see as noted by others is this unit does show finger prints easily. But that is only a issue depending on how the light hits it and come on, how hard is it to just wipe it off. They do sell screen protectors for this that helps with this issue, but honestly ours is in a case and I always tell the boys to wash there hands before they use them. Battery life is really good. My boys can use them almost non-stop playing games, streaming movies, internet, etc. and it would be at 20-30% battery life. This has parent control features but I have not set them up. This is a good entry level tablet and perfect size for portability. Will fit in your purse with a case easily ladies. We bought the Procase ASUS MeMO Pad HD Protective case here on Amazon which fit perfect and are very durable( Also come with free stylus). If you been looking at this tablet or want a good entry level tablet this is it. I honestly don't know why anyone would need to spend 300+ for a tablet. If your one of those people who can do everything from their phone but just would like to have a bigger screen to look at then this is your answer. Were happy, and we got 2 for less than 1 in the higher end models. This is perfect for those of us on a budget.", "Title": "Best Entry Tablet", "Date": "January 29, 2014"}, {"Author": "Janneth", "ReviewID": "RAN8KYX9LO2H3", "Overall": "5.0", "Content": "I bought this tablet for my niece as a Christmas gift. She is eleven years old and this is her first tablet. I looked at cheaper tablets, but this tablet has good specs, reviews, and Bluetooth. She was able to get a Bluetooth keyboard to do her homework. I paid $129 for the tablet, which is not a bad price for a dependable brand and sturdy tablet. My niece uses it everyday and she loves it! She has not encountered any issues.", "Title": "Great gift!", "Date": "January 22, 2014"}, {"Author": "kevin \"Old HP Guy\"", "ReviewID": "R1CUAB67DYGK5F", "Overall": "5.0", "Content": "As an owner of a first generation Nexus 7 from December 2012,I can certainly recommend this MemoPad by Asus. It has virtually the same screen setup as before so it has been a snap for me to get all my software installed and all the other accounts that I use. What is really nice is the much faster processor speed. I don't have to wait around for programs to load and for data to download. I am VERY pleased with this unit and frankly, for what it does, you can't beat the price.", "Title": "Good old Android Operating System but much faster", "Date": "January 22, 2014"}, {"Author": "W. Wallace", "ReviewID": "R1AMO8Z6CLGYRL", "Overall": "5.0", "Content": "I bought this for my daughter a month ago and she loves it. The screen has good color, battery charge holds well and we haven't had a single problem with it.", "Title": "Excellent bargin for the price", "Date": "January 22, 2014"}, {"Author": "Trismegistus \"Trismegistus\"", "ReviewID": "R27IXDS979AFAE", "Overall": "5.0", "Content": "Bought several different tablets on Amazon, have reviewed most of them.This is a great tablet, on par with the similarly-priced Galaxy Tab series. All it lacks is the Tab's IR remote capabilities, and it has a much better charger than the Galaxy's, which is known to be a problem the manufacturer has yet to correct, Out of the tabets I have purchased here on Amazon, dollar-for-dollar this has been the best buy, and I continue to use it every day for email, games, surfing the web, and it has yet to fail me. If I just check my email, play an hour or so of games, maybe surf an hour or so each day, I can go almost 3 days without a charge. The actual uptime on a full charge with constant active use (i.e. playing something) for me has been about 8 hours. if I just check my email and do little else, I can go days.In sum, if you want a top of the line tablet at a good price, one that has an expansion slot for more space, and dual cameras, with an HD screen, and even a transcover (close the optional case cover and it sends your tablet to sleep, saving power), you can't, in my opinion, do any better than this Asus Memopad HD. A great purchase.", "Title": "Great tablet", "Date": "January 22, 2014"}, {"Author": "Jay White", "ReviewID": "R3Q6HBPE5YSZIO", "Overall": "5.0", "Content": "This is a great little tablet that does everything I need. Couldn't be happier. I would recommend a matt finish screen protector, the ASUS Transcover and a 32 GB micro SD card -- you'll be all set.", "Title": "Great tablet", "Date": "January 22, 2014"}, {"Author": "tony fishman", "ReviewID": "R1OKCCQUOGGGA6", "Overall": "5.0", "Content": "it a really good tablet I use it all the time to get to the internet carry it everywhere good price good deal what can I say", "Title": "a great device", "Date": "January 21, 2014"}, {"Author": "Dktom", "ReviewID": "R1ZVZQ535WSIID", "Overall": "5.0", "Content": "Works well, I bought it for my son and he really enjoys using it. I like that you can expand the storage.", "Title": "Nice device", "Date": "January 21, 2014"}, {"Author": "dgd", "ReviewID": "R19AEE49FB8W6H", "Overall": "4.0", "Content": "My daughter likes this tablet, but it did not come in blue. Otherwise no complaints yet.I would buy another one.", "Title": "review for Asus tablet", "Date": "January 21, 2014"}, {"Author": "Zamobafood", "ReviewID": "R1KIXCS9QBGCAF", "Overall": "5.0", "Content": "I purchased this for my son to reclaim my iPad. I was very impressed by the build quality. It feels heavy but it's solid.Performance is great for the many games he plays. With numerous apps opened in the background it runs sooth and without hesitation. The included app locker is great for children. You can select any app to require a password to use.The only negative is the some what awkward position of the lock button. It's reseed on the right side under a lip and sometimes hard to find with a rubber skin installed.", "Title": "A great buy for the price!", "Date": "January 20, 2014"}, {"Author": "Gary Patton", "ReviewID": "R307UE30ZHD8P8", "Overall": "5.0", "Content": "My first tablet and getting to know it is fun. It fits the hand well and isn't heavy. Right now it is worth 5 stars for me. It is what I expected", "Title": "I love it", "Date": "January 17, 2014"}, {"Author": "Tammy D. Brown \"T. Brown\"", "ReviewID": "R101CAW8L8QT29", "Overall": "5.0", "Content": "I bought this for my 9 year old daughter for Christmas! Even with 100% importation taxes into Brazil this MeMoPad was cheaper to buy online them buying in Brazil. My daughter cannot stop playing with this. It was super easy for her to download the free games on the internet and she just LOVES this. Very good buy.", "Title": "My 9 year cant stop playing with this!", "Date": "January 1, 2014"}, {"Author": "Ocblee", "ReviewID": "R2G360IO70IV01", "Overall": "5.0", "Content": "good product. fast delivery and good quality pad from Asus. it is a product that will meet expectation with fast processor and great stock rom.", "Title": "Good buy. highly recommended", "Date": "January 1, 2014"}, {"Author": "THUNDERFAN#1", "ReviewID": "R2LV7GHF20LM40", "Overall": "5.0", "Content": "wife loves it works great also great if your budgeting. very clean crisp easy to use and does almost everything", "Title": "greatttttttttt", "Date": "January 1, 2014"}, {"Author": "Eugene F Phillips", "ReviewID": "R7PRDK7C2VJIM", "Overall": "5.0", "Content": "I bought this for the wife for Christmas.  It is able to perform for her and her game playing.  She has also started reading more on it,", "Title": "Gift for the wife", "Date": "December 31, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RK5DLS068QNDD", "Overall": "5.0", "Content": "I have been using mine (Christmas present from me to me) and gave one to my son.  They are great for what we use them for.  He uses his for skyping and email and music.  I use mine for games and web searching.  We both love it.", "Title": "This is a wonderful tablet.", "Date": "December 31, 2013"}, {"Author": "Cynthia Saavedra \"CSthePoet\"", "ReviewID": "R33I1SJ8W97FV", "Overall": "5.0", "Content": "It does everything I need it to do and has great video viewing quality. Very light weight and durable. I love it! Great price!", "Title": "Just what I needed", "Date": "December 31, 2013"}, {"Author": "LEATRICS", "ReviewID": "R30NHAUA5X8YI8", "Overall": "5.0", "Content": "I gave this to my daughter to do school assignments. It has worked well for what we needed. The pricing is great. Only thing is I probably need to find out all the tablet do. I am sure we are not using it to its full potential", "Title": "Tablet", "Date": "December 31, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2K3KPFB5LBCKP", "Overall": "5.0", "Content": "It is everything I expected and more. The screen resolution has so much quality, beautiful and rich colors. Stupendous audio and it is very fast. I love it!", "Title": "Totally in love with it", "Date": "December 31, 2013"}, {"Author": "Stanley Raba", "ReviewID": "R1Y821LD0HGYPI", "Overall": "5.0", "Content": "Highly recommended---if you like your Android phone, this is a great tablet that allows you to move seamlessly from phone to tablet without having to remember what system you're in. Been working with it for about a week, and very impressed with its utility and functionality. Biggest star goes to the price---super-affordable with lots of features.", "Title": "Great tablet for the price!", "Date": "December 30, 2013"}, {"Author": "Mary Ellen Stettner", "ReviewID": "R2BR7C8UNV8PS0", "Overall": "5.0", "Content": "I bought this tablet as a Christmas gift for my 8 year old  granddaughter.  The graphics are great and she absolutely loves it!!!", "Title": "Great Tablet", "Date": "December 30, 2013"}, {"Author": "Jaydee Gutierrez", "ReviewID": "R2Q5KQ22L33EZT", "Overall": "5.0", "Content": "Asus memo pad is a great little tablet. I used it on vacation and it was very easy to travel with, it's very light and does so much.  It's a lot of bang for the buck", "Title": "Wonderful tablet", "Date": "December 28, 2013"}, {"Author": "Jer", "ReviewID": "R37009QL1UPB0L", "Overall": "5.0", "Content": "Very fast tablet.  My 11 year old son is impressed and happy with his Christmas present.  No complaints or problems.  Asus has updated the firmware twice since I purchased in November.", "Title": "Great tablet for a low price.", "Date": "December 28, 2013"}, {"Author": "Donna Lynne Thomas", "ReviewID": "R2BYVIP9RRNXM5", "Overall": "4.0", "Content": "I bought this as a Christmas gift for my 8 year old Granddaughter. She loves it. I am technically challenged but she has already figured out how to do all the things she was doing on the old Kindle she had plus she loves the voice commands.", "Title": "So Far So Good", "Date": "December 28, 2013"}, {"Author": "L. Foster", "ReviewID": "RUS65GNXG3ECH", "Overall": "5.0", "Content": "I read many reviews on a number of different tablets.  I have a laptop but wanted something to use with more ease and a tablet that took good pics as well.  This tablet more than exceeds my expectations.  The dual camera is great.  I get a much larger view of the pic I took compared to my digital camera.  The quality is great.  The navigation is easy.  I have read a number of books as well.  A Kindle app. is already installed on the device.The keyboard is easy to use without errors in touching other keys.I have downloaded a few free games and have found them to be very entertaining too.Overall, this tablet is great for the price and I would highly recommend to anyone if you are looking for the same kind of functions.", "Title": "Awesome tablet", "Date": "December 28, 2013"}, {"Author": "Jamk", "ReviewID": "R1ZMD2XSGNVZRK", "Overall": "5.0", "Content": "Whats there not to like about this tablet. Nice feel to it, works great and comes at a great price.recommends it to everyone", "Title": "Awesome", "Date": "December 28, 2013"}, {"Author": "PPD1607", "ReviewID": "R2S5SJCTWDZS5D", "Overall": "5.0", "Content": "Bought it for my daughter.  She has been using almost constantly for several days with no problems.  It is not as high powered as a higher end tablet but you should not expect it to be a powerhouse.  Very slight pause almost not noticeable.  The power button is on the bottom side of the tablet making it slightly awkward in a case, but only a minor issue.  Will update if anything changes.", "Title": "Can't be beat for the money", "Date": "December 27, 2013"}, {"Author": "mspice", "ReviewID": "R12K2CX7J5GLO1", "Overall": "4.0", "Content": "the screen is great. The performance is great. It's bigger than the Nexus 7 but it's so much cheaper is worth it and kids don't care about that", "Title": "perfect tablet for young kids", "Date": "December 27, 2013"}, {"Author": "Don", "ReviewID": "R2ZQB8ADRCRY1A", "Overall": "5.0", "Content": "Bought this for my daughter for Christmwas and so far it is working well for her.  Great sceen and runs fast so far.  Needs a better owners manual though.  She gets a little frustrated trying to learn how everything works.  Got on line and down loaded her a more complete manual for her.  Seems to be a very good value for the money.", "Title": "So far so good!", "Date": "December 27, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3BARCJ9Z6NF4E", "Overall": "4.0", "Content": "Since we just got the tablet and have really not had a chance to put it to task, I can only go by appearance.  Has a nice clear picture, is light weight and does everything a larger tablet does but in a more convenient to carry size.", "Title": "A nice little tablet", "Date": "December 27, 2013"}, {"Author": "Tria Thao", "ReviewID": "RGM0XISSJPPOM", "Overall": "4.0", "Content": "My 9 year old daughter has been wanting a tablet.  I was a little hesitant on ordering this one but of course reviews sold it to me.  So far, my daughter's enjoyed it.  I just don't know how to watch movies on it but it isn't for me anyway.  For the price and quality, I'm happy with it as well as my daughter.  However, the battery use to last long wen we first got it.  Now it has to be charged everyday otherwise it'll milk the battery life quick.  Before, the battery lasted for days before charging it but now it's only good for the day.  Overall, great price for it!!! I'd probably order another again...", "Title": "Great for a 9 year old", "Date": "December 27, 2013"}, {"Author": "Sam", "ReviewID": "R2CW2DLPPWJIT5", "Overall": "5.0", "Content": "Just got this tablet today and I'm thrilled with it. I have an IPad for use at my job and the screen clarity of my new Asus is at very least as good as my iPad. All programs I've installed have ran smoothly and I really feel like I got more tablet than I paid for.", "Title": "Far exceeded my expectations", "Date": "December 27, 2013"}, {"Author": "T. Brown", "ReviewID": "R3VIDT90VG9GGY", "Overall": "5.0", "Content": "Purchased two of these tablets as Xmas gifts for my teenaged nephew and niece. They have yet to put them down, even for food or water. Excellent technology for what they require (school and play) at a great price point. On a related note, these and the dozen+ other gifts I ordered for the Holidays arrived on time and in perfect shape. Kudos to Amazon and UPS (and FedEx) for continuing to lead the world in innovative product delivery, despite the bellyaching of a distinct minority who believe once you hit \"order\" at 11:59 pm on December 23rd that all your Christmas dreams will magically come true.", "Title": "Great Tablet, Great Price.", "Date": "December 27, 2013"}, {"Author": "Patricia Bynoe", "ReviewID": "R3QZIKJKUBH33N", "Overall": "5.0", "Content": "My first android device and it is quite an experience. It comes on in mere seconds (unlike my previous tablet which took all of three minutes to warm up), it is supersensitive to touch and I can work with it in one hand for a long time because it is so light and comfortable to hold but most of all I can easily find Asus brand accessories for it. I just wish there were more English language apps and less of the Middle-eastern/ Arabic type language apps that I am finding.", "Title": "Absolutely love it", "Date": "December 27, 2013"}, {"Author": "Jodan Daniel Marte", "ReviewID": "ROJTW862DHYR7", "Overall": "4.0", "Content": "with technology as advance as we have now and the cost of system on a chip getting cheaper. asus being the giant that it is could have made this tablet faster and better. But compare to the other tablets out around the same price this tablet brings more to the table and its better than most except maybe the hisense sero 7 pro, now that is a tablet that gives you a lot for your money", "Title": "its good but could be better", "Date": "December 27, 2013"}, {"Author": "Jane Kehoe", "ReviewID": "R25O9OUVBKZVG5", "Overall": "4.0", "Content": "This pad was given as a gift to teenage computer geek and they love it! I let her set it up for her needs (music and gaming) so far it is doing great", "Title": "Great pad", "Date": "December 27, 2013"}, {"Author": "Johnny L. Schneberger", "ReviewID": "R2FHMCV35QI1X6", "Overall": "4.0", "Content": "Timely arrival.  Product was as advertised.This tablet was a gift.  And though I'm not techie, I can say say is that my G-son was very pleased with the gift.  In fact, my son was also impressed and thought he'd buy one for himself.Very bright screen,  Appears to be well-made.", "Title": "Very well received.", "Date": "December 27, 2013"}, {"Author": "Richard A Lanuez", "ReviewID": "RCXQLL8DHPAN7", "Overall": "5.0", "Content": "I got this for a back up one & its just as good as the nexus one that I have. My grand children liked it that I got them one each. You can\"t go wrong for the money.", "Title": "great tablet", "Date": "December 26, 2013"}, {"Author": "WCE1972@YAHOO.COM", "ReviewID": "RY83XGPRQ5PJ8", "Overall": "5.0", "Content": "After extensive research, my husband and I purchased this tablet for my daughter. We are very happy with this product. No issues thus far. I would def recomend this one.", "Title": "White ASUS Tablet", "Date": "December 26, 2013"}, {"Author": "Carlos A. Ruiz Rivera", "ReviewID": "RIDLJXGUU7WWH", "Overall": "3.0", "Content": "Careful the first few days make sure it is working alright. Mine seem to have some trouble in charging the battery. I send it back got another one and so far so good.", "Title": "it's okay", "Date": "December 26, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RVDIWVHG8X5PT", "Overall": "5.0", "Content": "awesome tablet. I bought 2 of these for my kids for Christmas and of course i had to try them to make sure they worked. they worked quickly and i did not see any problems with them at all. They feel solid and not cheap at all. the screen is not smooth like glass, but i don't have a problem with it.", "Title": "great tablet", "Date": "November 21, 2013"}, {"Author": "C. Farley", "ReviewID": "R2S94U0YAW9FUL", "Overall": "5.0", "Content": "holds kindle books, hours of music, data, gets on the internet, fits in purse, easy to hold and use, processor accesses books and music without a glitch", "Title": "This gift was well received and enjoyed", "Date": "November 20, 2013"}, {"Author": "Tom L. \"Tom\"", "ReviewID": "R1CU7VGE0S6IHZ", "Overall": "4.0", "Content": "There's not a lot I can add to the already thorough reviews here - this tablet is a great value for money. I just want to mention that although it says the external storage is up to 32gb, I put a 64gb Sandisk micro-sd in mine and it recognized it without problem. Now I have effectively 70+gb of storage on this little thing. Awesome.The only thing preventing me from giving it five stars is the build quality. There is a certain flex to it which causes a few creaks, and sometimes causes the tablet to think that SD card has become unmounted. It usually recognizes it again pretty quickly, but this could be an issue if it happens when you're in the middle of downloading something.", "Title": "Great Value. Will accept 64gb SD card.", "Date": "November 20, 2013"}, {"Author": "Jeannie", "ReviewID": "R1LD8U0C3WQXCZ", "Overall": "5.0", "Content": "I bought it as a gift for my husband and he loved it so much that he bought me a pink one! The sound quality is better than my laptop. The picture quality is excellent, very vibrant, crisp, and clear. Games played on it is very fun. It doesn't lag very much behind. Web pages load great. It comes preloaded with about 60 apps, some of which are really useful like Asus artist and Asus to-do. In addition, there are tons of free apps that are easy and fast to download from the Google play store in just about any category you could ask for. The camera can take pictures and video from the front and back. There's even a mirror app! My husband's favorite thing is that all his notes and checklists are all in one place. He doesn't have to search through thirty different notebooks to find whatever he's looking for now. What I like best is the versatility. It can do just about anything I want except make phone calls and it's a great size for viewing and taking it with you wherever you go. We certainly do take our's everywhere!There are only two very small complaints, there's a small lag in picture orientation when you turn the tablet and the power and volume control buttons are a little difficult to access.", "Title": "simply awesome", "Date": "November 18, 2013"}, {"Author": "jonathan scott", "ReviewID": "R3IQTBP4OZEWRJ", "Overall": "5.0", "Content": "Got it for a gift for my wife. I love that I could get pink for her gave it to her she's been using it it works great again came really fast. Very pleased.", "Title": "jobs order review", "Date": "November 18, 2013"}, {"Author": "Bob", "ReviewID": "R1BRVUPEKEXZM", "Overall": "5.0", "Content": "After owning a few Google Nexus 7 tablets, I have to say that this is all the same bang for half of the bucks. Same resolution but with the added second camera and microSD slot make this a far better option. Placing an order for family members that do not have tablets today. This is a far superior tablet to any other $100-ish tablet on the market. Amazon has beat everyone elses price by offering this through the warehouse deals also. Big savings and fast shipping. I am off to buy a pink one and a blue one for the in-laws.", "Title": "Nexus 7 re-imagined and cheaper!", "Date": "November 18, 2013"}, {"Author": "rafael gonzalez", "ReviewID": "RJTEM8VMO5XSV", "Overall": "5.0", "Content": "excellent divise, works perfect, good resolutiion, battery life is very good, sound very nice,weight is very good, unfortunatlly does not have a flash for the camara", "Title": "ASUS MeMOPad HD 7-Inch 16 GB Tablet, Blue (ME173X-A1-BL)", "Date": "November 18, 2013"}, {"Author": "Chris Sarkela", "ReviewID": "R219NIW9FFE1W5", "Overall": "5.0", "Content": "This is a great tablet for me as I use it for e-mails and checking things on line when I travel.  Easy to use and I like the size, a bit to sensitive for me, but that is the only negative.  Great picture, sound and easy to use.", "Title": "Great tablet", "Date": "November 17, 2013"}, {"Author": "Claudia Meka", "ReviewID": "R257SSAOPLGG02", "Overall": "3.0", "Content": "It's sorta  hard to turn the tablet on with it in the Memo pad you have to squeeze into the side to turn it on.  The pad is very good after you turn it on.", "Title": "Difficult to turn on when in the memo pad", "Date": "November 17, 2013"}, {"Author": "Moshe", "ReviewID": "R3G3W4DI3DVB11", "Overall": "2.0", "Content": "Great product while it worked. I bought two devices and after one month I had two RMA both of them. One of the devices had a problem with the touch screen stop responding and the other one just died a few days later. Not to mention that ASUS wouldn't pick up the shipment cost and I had to pay it from my own pocket. They agreed to wave the shipping cost for the second tablet after I made a lot of noise. I purchased the product because it was rare to see a product like that with great specs for such a low price. Unfortunately it didn't take a long time to realize that there are no free lunches :(", "Title": "Two lemons...", "Date": "November 15, 2013"}, {"Author": "Chris Thornton", "ReviewID": "R18LXTQHVNP7V7", "Overall": "5.0", "Content": "Great price and easy to use.  I bought for my wife to use on an upcoming trip and she is already an expert with the tablet.", "Title": "Great price and easy to use.", "Date": "November 15, 2013"}, {"Author": "tony", "ReviewID": "RSFK8INULUDV5", "Overall": "5.0", "Content": "good item and better then other tablet.very easy access.also,very handy for take anywhere you like.also, pretty light for carry any place I want", "Title": "wonderful tablet", "Date": "October 2, 2013"}, {"Author": "Rick Maes", "ReviewID": "R2XJL8TRBKK2X7", "Overall": "5.0", "Content": "Great price for well performing tablet.  Also have a nexus 7 and this tablet is better on price and camera capabilities.", "Title": "Good value", "Date": "October 2, 2013"}, {"Author": "Roger E. Mundinger \"rem.\"", "ReviewID": "R29C75IZO9B7WH", "Overall": "5.0", "Content": "I love the tablet for traveling and is just the right size for what I do with it. It is fast and I have had lots of fun with it.", "Title": "Great tablet !", "Date": "October 2, 2013"}, {"Author": "Douglas Borrero Villamizar", "ReviewID": "R3SU5XVSPDLUSG", "Overall": "5.0", "Content": "I'm gratefully pleased with this purchase. This tablet is powerful, ligthweigth, and performs smoothly. The screen resolution is perfect, and the sound is very good. Updates to Android 4.2.2 as soon as you connect it to wi-fi. Really recommend this product.", "Title": "Excelent tablet for the price", "Date": "October 2, 2013"}, {"Author": "shopper", "ReviewID": "R115E41D0VYZCT", "Overall": "5.0", "Content": "Satisfied after a month of use. $120 less than the nexus I was considering. Will consider more upscale tablet once the operating systems debate is settled.", "Title": "Good alternative to the new Nexus HD 7", "Date": "October 2, 2013"}, {"Author": "The Shadow", "ReviewID": "R3T3K2HITR30H7", "Overall": "5.0", "Content": "My initial impressions are overwhelmingly positive. The more I use the tablet the more amazed I am that something at this price point can be so capable. One nice surprise: when I close my tablet cover, the screen automatically sleeps and it automatically awakens when I open the cover. This is by far the best performing low cost tablet on the market today. I may get the 10\" version of it.", "Title": "Asus as done it again excellent tablet.", "Date": "October 2, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2GB75Q9P0EB8W", "Overall": "4.0", "Content": "Everything my phone will do except the telephone. Only downside is accessibility of on/off and volume switches. Case turns it on when opened which minimizes the problem.", "Title": "Very usable, cost effective tablet", "Date": "October 2, 2013"}, {"Author": "Bagehi", "ReviewID": "R3B0Z9FKMMM880", "Overall": "5.0", "Content": "Bought these for the kids.  They love them.  Easy to use, sturdy, and the charger is standard so can easily be replaced when they lose theirs.  Perfect!", "Title": "Great for the kids", "Date": "October 2, 2013"}, {"Author": "Rich", "ReviewID": "R34YO9BGX7DAA5", "Overall": "5.0", "Content": "While I don't have a lot of experience with different tablets I know I like this one. At first I wondered if something was wrong when it would not work with Netflix. Then ASUS updated the OS (automatically) and Netflix worked without a hitch. In my mind, for the money, you will not find a better deal right now.", "Title": "It's ASUS, you know it's good", "Date": "October 2, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R15AKLWTTQSCUO", "Overall": "1.0", "Content": "I received this tablet and was immediately impressed by the screen, it was gorgeous!  The only other small tablet I have used is the Kindle Fire HD, and I much preferred the Asus because of the screen and the very nice OS (I hate the Kindle carousel).  This tablet seemed faster, and was very easy to setup.  I installed a few apps from the Google Play store and it was all flawless.So why 1 star?The battery came partially charged, and that's all the use I've gotten out of it, about 3 hours.  Now it is completely dead.  It will not charge, connecting it to a PC does not help.  I've tried different outlets, different chargers, all to no avail.I probably received a lemon, and will revise my review based on the service I get.Update: I sent the first unit in for repair.  It took a 20 minute phone call or so.  I received the unit back in a bit over a week.  The second unit lasted a month or so.  It was just sent in for repair, for exactly the same problem, it just dies.  My wife really likes the tablet when it works, so we're a bit bummed that it keeps dieing.  Hopefully it will last a bit longer when we receive it back.", "Title": "Good while it lasted", "Date": "September 9, 2013"}, {"Author": "Emil Jorge Manzur", "ReviewID": "RNC9R137MTZLM", "Overall": "1.0", "Content": "First off let me say I've had many tablets and also ASUS products, but this one is close to the worst i have ever had, right after i received i started experiencing some funny BATTERY OVERHEATING ISSUE, it happened seldomly and the tablet would turn off, over the last couple of months, the issue has developed and now the tablet is useless, it so bad that drains the battery in a matter of minutes, so honestly i wouldn't recommend it to anyone, stick to the M172 its way better and these issues don't happen, extremely disappointed, will think twice before buying this tablet", "Title": "Not the best experience", "Date": "December 6, 2013"}, {"Author": "Devinder Singh", "ReviewID": "R3Q1WB8LE22SUC", "Overall": "1.0", "Content": "Garbage Tablet. After 4 Month not turning on. Cheap in quality. I saw lots of review not turning on. They should call it back.Not recommended at all. Just Garbage and wastage of money.", "Title": "Garbage Asus Tablet", "Date": "April 18, 2014"}, {"Author": "Jerry Vanalstyne \"radio lover\"", "ReviewID": "R1IPADI33IOT8L", "Overall": "2.0", "Content": "It never worked from the first time I tried it. I took it from the box plugged it in to charge it. After about 5 hours I unplugged it and tried to use it. It froze up  and would never work.Amazon was great about the problem and I returned for refund.I also returned a cover I bought for it which was fine but since I don't have the asus I won't need the cover.I'm hopeing amazon doesn't charge me the shipping for returning it.True there's nothing wrong  with it but I can't use it because of no fault of mine. i giving 2 stars for easy returns to amazon", "Title": "Not good", "Date": "April 6, 2014"}, {"Author": "shawn911 \"shawn911\"", "ReviewID": "R25MR1ODV5ABMS", "Overall": "1.0", "Content": "This device has been shutting down over and over i purchased it for the black Friday sale 2013. It would normally shut down 50 - 40 % of the battery.When it normally shuts down it would come on the following day. This would only happen when plugged to the charger and in doing so there is a always flashing of the battery symbol in red. Yesterday 24th march 2014 it recently shut down at 100% of the battery  and won't come on.!!! I also know another asus user who purchased their device same time around like i did and is encountering the same issue. the funny thing is I made another purshace of this item not to long ago  i await to see if it is going to do the same thing.DONT BUY THIS PRODUCT !!!!!!!!!!!!!!!MY SECOND PURCHASE OF THIS DEVICE STILL HAS ISSUES. THE SECOND ONE HAS DIFFICULTY POWERING IT UP.HOLDING THE POWER BUTTON FOR THE REQUIRED TIME WONT HELP. PLEASE GET ANOTHER PRODUCT DONT PURCHASE THIS ITEM!!!", "Title": "waste of money ( updated review)", "Date": "March 25, 2014"}, {"Author": "Gary", "ReviewID": "RWSUFGW1YS3X5", "Overall": "4.0", "Content": "This is a great tablet when the battery does not give you problems. Really great. I got two returned both because of battery problems. Amazon was good enough to give me my money back on both occasions.But, I missed the tablet. It's that good. So, I bought another and, so far, the battery has not given any problems. Hence, the 4 star rating.I think the trick is to never turn the thing off. Just keep on charging as recommended on the internet.", "Title": "Five Stars For Amazon's Return Policy", "Date": "February 26, 2014"}, {"Author": "Donna Wynn \"Retired RN on a spiritual journey.\"", "ReviewID": "RUYH7KA5UPLDR", "Overall": "1.0", "Content": "The tablet won't charge, I did everything because I like the tablet, changed plugs tried different sockets, nothing.  Saw this review from a customer today...............UPDATE: 1/2/2014 - Some bad news. My MemoPad refuses to charge now. Suddenly, I plugged the MicroUSB cable to the MemoPad for charging yesterday and nothing happened. I checked the plug and it was fine but I tried two other cables just to ensure it wasn't a flaky cable. It wasn't. Also checked it with several different AC chargers and on my laptop. NO dice. It won't charge. I then tried a hard reset by holding the power button for 1 minute, connecting USB to power and repeating the procedure. Nothing. My MemoPad is on it's way back to ASUS for warranty repair. I'll leave my rating intact for the time being. I may have to lower it depending on the outcome. I realize that some defects occur so I will give the benefit of the doubt for now.", "Title": "Battery stopped charging", "Date": "February 21, 2014"}, {"Author": "Jeff Warner", "ReviewID": "R3R65SLFHGHHEU", "Overall": "1.0", "Content": "We bought this tablet in late November for Christmas. We really enjoyed it for the first two months. We took very good care of it and followed all the instructions and rules. The tablet will not turn on and will not charge. I have heard that they're a few lemons out there and it just so happens we bought one of them. I am very disappointed in this purchase. We are not able to return this lemon because it's been over two months. I'm also disappointed in Amazon for not giving us a replacement after only two months. What a waste of money!", "Title": "Lemon", "Date": "February 17, 2014"}, {"Author": "Kenneth", "ReviewID": "R2BIBF2O9FC7N2", "Overall": "4.0", "Content": "Got this with birthday money when it came out and pleasantly surprised by the quality. I new I wanted a smaller tablet just wasn't sure which one. Usually in electronics if the price is cheap then the product is. I knew wanted android os for some apps like snes emulator and torrent ones, but there weren't many good choices at the time. Then Asus released the memo and the updated version of the nexus. I picked this over the nexus because the ability to use memory cards. The screen is really nice, but shows fingerprints and is rubbish in direct sunlight. The plastic back doesn't feel cheap and the speaker is nice. I have been using it constantly watching videos, playing games, and browsing the internet. Even with the very heavy use the battery still lasts all day on one charge.", "Title": "surprisingly great tablet", "Date": "February 11, 2014"}, {"Author": "Angela Pietro", "ReviewID": "RNA9DDD3L6VT9", "Overall": "5.0", "Content": "I got this for my 15 yr old son.. tried it out before i wrap it for christmas.... and for the price it will def do.. i would def recommend .. and cant wait for him to get it.", "Title": "SO GLAD I GOT THIS..", "Date": "November 26, 2013"}, {"Author": "joseph agoglia", "ReviewID": "R50KE0BHEC1CA", "Overall": "3.0", "Content": "Having trouble with the external micro SD card. The tablet continually displays a message that \"the sd card was unexpectedly removed\",  then after a few minutes it installs the SD card again.The apps loaded on the SD card don't run", "Title": "ASUS Memopad HD 7 problem", "Date": "November 14, 2013"}, {"Author": "Stephanie Hostettler", "ReviewID": "R3W2T0HUM4O4XY", "Overall": "5.0", "Content": "I was looking for a reasonably priced tablet for a 5th grader.  This is definitely the answer.  It was affordable.  The choice of color was also a plus.  It uses the Google market which was a must for us, we are devoted android users, and it is very user friendly.  We were up and running in no time at all.  This was ready to go right out of the box.  My daughter also liked the camera, many tablets do not have cameras and this was a bonus we have come to love.  External memory spot means we do not have to pick and choose what to download, it all fits!", "Title": "Excellent product, great tablet", "Date": "October 29, 2013"}, {"Author": "cathy", "ReviewID": "R3QGAJ8VX7B70F", "Overall": "5.0", "Content": "My mom loves it and we are considering to buy the second one. My father got Samsung sm-t310 in the store and he felt like to get this one instead now!", "Title": "My mom loves it!", "Date": "October 26, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2X9PKMKZYLXX4", "Overall": "4.0", "Content": "My original intent at delving into the \"tablet\" world was to purchase an e-reader.  I found that I was constantly reading epub books on my iPhone and wanted something with a larger screen.  I tried out our iPad for a bit and found it just a little unwieldy for reading with, especially in bed.  So I started researching with most of my efforts slated toward a Kindle.  I had basically decided to purchase a Kindle Paperwhite but kept going back to our local retailer and was really just not happy with the screen (oddly enough).  What I really didnt like was that there was a visible \"regeneration\" of each page as you flipped along.  It became very noticeable and then turned into very distracting.  So I broadened my search to the 7\" tablet line which led me to this ASUS Memo Pad HD.  And honestly, for the money - which was the MAIN focus for my search, I don't think you can beat it.  During my research there were a LOT of articles that I came across that basically said that you should skip this level of tablet (sub-$200, 7\") and just shell out the extra money for the Nexus 7.  Which missed my goal entirely, I absolutely did NOT want to spend more than $150 for a tablet that was mostly going to be used to read on.  And if I could avoid it, I didnt want to get to the money limit by settling on a refurbed product.  Below are some of the Pros and Cons that I got out of this specific purchase:Pros -* Great Price!* Beautiful Screen* Really Good Sound (honestly, I keep going back to Google Music to randomly play music because it impresses me)* Full version of Android - which Kindle wasnt getting me in ANY version.* Functionality at a LOT of other things besides e-reader* Expansion card slot - picked up a 16gb card for $13, now its essentially a 32gb tablet.* Had a reason to require some ASUS Customer service and found it to be great - good response times and fixed a software issue I was having with Netflix* HUGE array of apps through the Google Play store.* Surprisingly adequate camera - not that this is a function I plan on using much but nice to know its there!Cons:* The screen is GREAT, but one thing the Kindle readers have over these tablets is anti-glare.  Reading outside takes some creative \"angles\" at times to avoid the mirror affect.* Battery life could be better, but I knew this was going to be a trade off from an actual e-reader.* seems somewhat \"fragile\" when you're holding it.  Still waiting for my cover to arrive from Amazon, until then I am deathly afraid of dropping this!* I've noticed some screen \"flashing\" on websites in Chrome - assuming its hardware related.  (Not a problem I would have had on the Paperwhite - hehe...)That's all I can think of for now.  Honestly, the Pros so completely outweigh the Cons for what I was looking for and I REALLY do recommend this tablet for anyone looking for a good, solid-performing and value-conscious device!UPDATE 10-18-13:  Woke up this morning to a brick.  I had the tablet charging overnight, with the ASUS peripherals and this morning the tablet is dead.  I contacted Amazon Customer Service and they are replacing the unit (which is 13 days past my \"30 Day Return window\" so THANK YOU AMAZON!!!).  I will update again after I receive the new unit and use it for a little while.  I am a little surprised and disappointed as I think ASUS has a great reputation.  Hopefully this was a fluke!!Update 11-01-13: So far so good.  The new unit has been performing well for the last two weeks, including a business trip.  I will say on the trip I was using Southwest's Wifi and TV access and I was NOT able to access the Live TV which was available, I kept getting an error that the video would not load.  However I was using this tablet to access my emails, responding to and writing emails on the wifi with no issues.  Cross my fingers but the unit is performing well again and hopefully that issue with the previous unit was in fact a fluke.  I've upgraded back to four stars.", "Title": "Updated 10/18 Uh Oh....  Great value!", "Date": "October 2, 2013"}, {"Author": "viswa mohan tripathi", "ReviewID": "R21SRUAO5MF0BR", "Overall": "4.0", "Content": "Good and worth buying.i dont see any issues till now.. interface,battery backup, camera quality,ease of use everything is good...", "Title": "Good one..", "Date": "September 29, 2013"}, {"Author": "Marie", "ReviewID": "RRPH68XE0SEBD", "Overall": "5.0", "Content": "I would recommend any and everybody to get this tablet! The picture quality is great, the features are marvelous, it takes beautiful pictures! I just love it!!!!!!!! I am so happy that my boyfriend bought it for me. It's the best gift ever!!", "Title": "loving my tab!", "Date": "September 24, 2013"}, {"Author": "Siba", "ReviewID": "RFXNW5X2Y6K6T", "Overall": "5.0", "Content": "I got this for my wife and I keep finding myself wanting to grab it out of her hands. She loves it. I'm going to ask for one for Christmas this year. Its performance is snappy and the screen looks great. Most of the stuff we were doing on our laptop (internet browsing, paying bills online, watching cat videos) we now do on this tablet because of its form factor, long battery life, and convenience. Our laptop is now collecting dust and comes out only if I need to do some work or burn some CD's.Asus really hit the sweet spot balancing performance with price. This is nice device for a fair price.", "Title": "Great tablet. Go Ahead and get one.", "Date": "September 18, 2013"}, {"Author": "Omran Jumah Mohamed Dhanhani", "ReviewID": "R3KBEK78UJ3O61", "Overall": "5.0", "Content": "Great buy for me, I was very not sure if I will like this but thanks God I bought it, first thing I would recommend to install nova launcher and use it as default to get free lag tablet ..because the stock launcher is pure trash and lag so much..also would recommend to change the animation of apps opening In nova launcher from system.to.slide , as slide animation is lag free and uses very less drawGaming is greatScreen is perfectMain thing I liked Better than nexus is screen color and sound of stereo speakers", "Title": "I love it more than my nexus7", "Date": "September 9, 2013"}, {"Author": "Kevin Yang", "ReviewID": "R2KF1S818EO4HK", "Overall": "1.0", "Content": "This is a piece of garbage !!!After charging for 8 hours, 1st time boot up OK.Updated system as instructed by ASUS software.2nd time boot up OK.Headset also works, but the internal speaker is active at the same time.Why would I want to annoy my partner while I have the headset in my ears?That is so dumb !!!After I remove the headset, the power button fail to launch the shutdown popup window.I tried various options, including holding the power button for 8 seconds to 20 seconds.Nothing works, the screen simply goes on and off, but Android is still active.After about 30 minutes of frustrating attempts, the shutdown popup window eventually shows up.I shutdown Android and leave the tablet on the computer desk.About 6 hours later, I couldn't power up the tablet.  Even the Asus logon is not showing.Again, I tried holding the power buttons for 2 seconds, 8 seconds, 30 seconds, whatever ...Nothing works.The screen remains dark and it won't even flash like the previous successful boot up sequence I have observed.There is no indicator lights can be found anywhere.Initially, I thought 6 hours of sleeping ( even though it was power off ) probably have drained the battery.So I use the USB cable ( provided by Asus ) to recharge the tablet.Amazingly, the screen display the battery logo and it goes to fully charged within 10 seconds.So the darn tablet is not discharged in the fist place.Well, now I need help to return this tablet.Anyone has good suggestions?", "Title": "This is a piece of garbage !!!", "Date": "November 15, 2013"}, {"Author": "Joshua", "ReviewID": "R2U6SOREMC5VS4", "Overall": "5.0", "Content": "This is a decent tablet for the price, I was happily surprised to find out that I didn't feel as limited as I thought I was going to be. Would really recommend this over many other budget tablets, and most certainly over a kindle fire.", "Title": "Definitely no complains", "Date": "December 29, 2013"}, {"Author": "mike", "ReviewID": "R38Q7NTQSY1CBP", "Overall": "3.0", "Content": "this tablet is ok for the price and I hope I will figure out how to use all the functions. It comes with no instructions, you have to download 106 pages from ASUS website. I printed them out and they are so basic that they are pretty much no help. ASUS support is also no help. If you contact them good luck getting a response that is useful. I contacted them about getting a good set of insructions because the online version sucks and they responded \" You can download instuctions online at ASUS website\". WOW no kidding!!!  This tablet is ok and probably a great little device if you can figure out how to use it. The front and rear cameras are nice and getting online is not hard but it will not accept any of my passwords from accounts on my home computer. If you have the time to play with it and figure it out you will probably like it. I'm going to keep it but like I said i's ok at best. I wish ASUS would put instuction that are helpful in the box or online and I would probably be a repeat customer.", "Title": "if you know about these things its ok", "Date": "December 26, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1BY7DLEEYP1OX", "Overall": "4.0", "Content": "Great tablet for the price.. good software.. good hardware.. kinda cheap assembly. Feels very light and fragile compared to our nexus", "Title": "alright alright", "Date": "December 24, 2013"}, {"Author": "Michael S Clayton", "ReviewID": "R2D3D1R08T2J4K", "Overall": "5.0", "Content": "A year or so ago I wanted to get the original Nexus 7, but I held off because it didn't have expandable storage or a camera on the back. The MeMOPad has both and is cheaper too.  I know it may not be the best small tablet out there, but it is a really great value.  I am very pleased with it.", "Title": "A great budget tablet", "Date": "December 21, 2013"}, {"Author": "deepbashi", "ReviewID": "R33CDIRPKXZJNU", "Overall": "2.0", "Content": "The main reason I purchased this tablet is to review emails and watch Netflix. I find the email management very cumbersome with multiple email accounts. However, the main reason I want to return the product is after calling ASUS Tech service and spending over an hour, none of the Netflix movies display any video, although audio comes through. I did not see the video problem with YouTube. Only Netflix seems to have problem displaying videos. If anyone knows the fix, please share.MFAZ", "Title": "No video for Netflix movies", "Date": "December 15, 2013"}, {"Author": "Fenglin", "ReviewID": "RBGGZU6DBX77I", "Overall": "3.0", "Content": "it is good, but sometimes the apps stop working.  actually something wrong happened after i updated the system, and now it does not work. i am going to send it back to asus to see if they can fix it.", "Title": "good", "Date": "December 11, 2013"}, {"Author": "Klouda", "ReviewID": "RAREZNSM6CK3U", "Overall": "2.0", "Content": "I had two of them. Both have same problem. Flashing display. For first on low brightness then all the time. another problem - slot for external card was removing the card few times per day.", "Title": "problem with display", "Date": "December 8, 2013"}, {"Author": "Marko", "ReviewID": "R3CSIQK8RCZ2KR", "Overall": "5.0", "Content": "Perfect Price/Performance 7\" tablet. I'm going to get one of these for my two daughters and wife for Christmas. I wouldn't call it cheaply made (I've dropped it several times and only scratched the edge). I do have to restart it once in a while when I get fast fingers and try to do too much too fast. Other than that, I'm super pleased. Only thing I would like is the ability to update with standard Android rather than Asus, but I'm probably going to root it.", "Title": "Great product for the price!", "Date": "November 30, 2013"}, {"Author": "J. L. McNair.", "ReviewID": "R1FI8OWKGXHY6J", "Overall": "5.0", "Content": "It was a gift for a special someone,  and she happy wiith it.  my brief  encounter with the device  was good.", "Title": "A great device in its class of tablets", "Date": "November 28, 2013"}, {"Author": "Sukhdeep Kaur", "ReviewID": "R1RXSK1DPJOCX8", "Overall": "2.0", "Content": "Pre-ordered for my father. He used it for 2 months, it worked really well and then it just died. It did not power ON. After dealing with poor Asus customer support (ironically Asus support did not have an option for tablet support), I returned it to Amazon and received a full refund. Thank you, Amazon!Aside, I'm not sure if I could now trust Google Nexus manufactured by Asus. I am sure under the hood Nexus is using the same hardware as this MeMOPad.", "Title": "~short-lived~", "Date": "November 27, 2013"}, {"Author": "Mel White", "ReviewID": "RO0032ZFGBEFZ", "Overall": "1.0", "Content": "I loved this tablet for five days: great price, great screen, worked fine, transferred my apps, etc. Second day it didn't want to boot, but I finally got it to work. Fifth day it just refused to boot up, Period. Tried plugging in charger, USB, holding start button. Nothing works. It's a brick. I'm returning it. I may try the Samsung Tab 3. Doesn't ASUS build the Nexus 7? It's also famous for terrible quality control. Too bad, because this would have been nice to have if it worked.", "Title": "Died after five days", "Date": "January 7, 2014"}, {"Author": "byPryorDesign", "ReviewID": "R20WJCSSS34BZB", "Overall": "3.0", "Content": "(I changed the star rating from 4 to 3) My original review was: This tablet is very good quality, the only reason for not giving it 5 stars is that there are not quite as many apps available as there are for other devices. It is simple to use, and has a wide range of uses. It's a good size and has good sound quality.Updated 3/5/14after a couple of months it began to occasionally turn off and nothing we did could make it turn back on. At first, if we left it plugged in overnight or longer, it would turn on again, but it kept getting worse - to the point where it just wouldn't come back on. Supposedly, if you hold down the \"on\" and the \"volume up\" buttons at the same time it should force it to restart, but that didn't work either. Asus was helpful, and we sent it back and they got it up and going again. Fortunately, it was still under warranty, so it didn't cost us anything. So far so good!", "Title": "A Good little tablet for the price, but has some issues", "Date": "December 11, 2013"}, {"Author": "sohail", "ReviewID": "R1NDFYJ4FI8TMH", "Overall": "1.0", "Content": "it doesnot turn on,i am so angry for this.I don't recomend anybody to buy this better to spend $100 more buy samsung", "Title": "no good", "Date": "November 30, 2013"}, {"Author": "Mitchell Neill", "ReviewID": "RCVQU7GXBAEMG", "Overall": "2.0", "Content": "The First one I got work great except the Bluetooth would not stay on. I got it to use as an obd 2 reader on my truck with a Bluetooth device that plugged into my obd 2 port. So i needed the Bluetooth, they let me send it back and sent me another. same issue so i just dealt with it. 5 weeks later it died.", "Title": "Bluetooth is bunk", "Date": "November 27, 2013"}, {"Author": "Tony Romeo \"ElderGeek\"", "ReviewID": "RM9CET5H1FB9U", "Overall": "5.0", "Content": "Nice job, Asus!  This is $130 very well spent! Sure it has a few flaws, but so does every other 7\" tablet out there. I am very pleased with the video quality, and have been loading mp4 movies on to the 32GB SD card I bought with the Memopad HD 7.  This unit compares almost exactly with the first version of the Nexus 7: Quad Core processor, etc, but it has something that even the new Nexus and old or new Samsung's are still lacking: an SD card slot to increase how much media you can carry with you.  The Asus Apps that come with the unit are actually useful, and the packaging is top notch.  I would suggest a clear screen protector: you finger slides across the screen much easier with one, but, skip the \"matt\" finish screensavers for this unit. Has the chops to be visible outdoors, and I have not had a problem with this unit connecting to my WiFi network, either at home, or on the move ( sorry, no cell radio available for this unit).  You can have a lot of fun with this, believe me!  Its compact enough, you can use it as a remote ( with the proper apps from the Play Store of course).  My grand kids ( 5 and 12) love them!  They are kind of jaded too: they both have 14\" Laptops! It has gone down a bit in price since I bought mine...so take advantage!  You won't have buyer's remorse with this 7\" Tablet, especially at the current price! As the owner of a few Lenovo laptops, an IT guy, and the owner of an iPad, I find myself using this 7\" doozy more than my iPad!", "Title": "Best 7\" Tablet for the money...Hands Down!", "Date": "November 26, 2013"}, {"Author": "Chad W. Shumway", "ReviewID": "R38AIGDHIBQZOA", "Overall": "3.0", "Content": "Down 16% in 20 minutes with wifi only, nothing running, black background, brightness dialed all the way down and battery doctor running with all unnecessary apps stopped. At this rate I'll get 2 hrs run time with nothing running. Played Angry birds for 10 minutes the battery down another 11%. Now at 37% and less than 40 minutes total time used the majority doing nothing but looking at the screen. Looks like about 1 hours total use on a charge. Disappointing battery life. So is the advertised battery life of 8 hours based on not using it? Or is my pad defective? I work in electronic design. Not impressed. Anyone having better results?UPDATE Nov14-13: I received an RMA# from Asus. I ship it back today. I will report back on how long it takes and if the problem is resolved satisfactorily. Also I'm not happy the price of the tablet dropped to $129 from the $149 I payed. We shall see. Until then, 1 star stands.UPDATE Dec21-13: It took 3 weeks to be shipped back to me. A little long IMO and a now has a scratch on the display.Hmmn!After putting it to the teswt, it's performance has increased tremendously. Battery life is now on par with the reviews. First thing I did on initial purchase was update the OS. Maybe a bad flash job killed the battery life perhaps, I have no way to know. I'll have to find a way to back up the ROM before running the OS update again.I'm bumping it to 3 stars, 4 is too many. 3.75 maybe. Overall experience kinda sucked. Should have just returned it.", "Title": "Not so good battery life on mine. Is this the norm?", "Date": "November 10, 2013"}, {"Author": "magbaez83", "ReviewID": "R22ERGDGX1ZHI6", "Overall": "5.0", "Content": "MAN FOR THE PRICE, THIS LITTLE TABLET IS A VANG FOR UR BUCK..LIKE PEOPLE SAY...SO FAR IS RESPONSIVE..IT LOOKS GOOD TO ME THE RESOLUTION ( I DEAL WITH PHOTOGRAPHY )..WHAT ELSE..IT FITS ON MY COAT POCKETS...NOW IN THE WINTER TIME ..MAN IS JUST A GOOD TABLET..MY KIDS LOVE THIS LITTLE THING!!", "Title": "GOOD TABLET GOOD PRICE..AND SO FAR TO ME..GOOD QUALITY IN AND OUT!!", "Date": "November 5, 2013"}, {"Author": "Brad Hanson", "ReviewID": "R14LVU7A8LGU70", "Overall": "5.0", "Content": "For less than $150, why pay more. Yeah it might not be as crisp or fast or whatever.  For the price it is an incredible device.  Agree that the screen smudges, but it isn't that much different than other devices I have used.  Good entry tablet.  And the Google Andorid OS will run circles around Apple IOS.", "Title": "Nice Android 'Nexus 7' like tablet", "Date": "October 27, 2013"}, {"Author": "Sevylla M.", "ReviewID": "ROYC96XBTVF72", "Overall": "4.0", "Content": "So I purchased the Asus Memo pad original version and was very impressed with its functionality for $100 for my kids. Then I thought, \"this tablet is so great,how awesome will the next version be?\" So, I bought the Asuss Memo HD 7, and was so excited...it arrived, and the screen is super responsive, quad core processor is lightning fast, graphics look great and of course, both front and rear facing camera much better than the original.Here is where I'm disappointed: the battery drains rapidly, and the USB port does not support on the go(OTG) cable. What does that mean? It means that my super cool $10 keyboard with case that I bought from Amazon ( and works great on the older version), does not function at all on this newer version! Cannot plug in keyboard, and cannot read flash drive...rendering what should have been an AWESOME $150 stand alone computing device almost useless for me (and many grownups)...great tab for the kids for gaming and vids, but without external keyboard, this cannot replace my laptop on the go....bummer.UPDATE 10/23/13:  I've resolved the battery drain issue by installing an app killer/battery checker, and this seems to be helping...also making sure to close ALL the floating apps if I know I will leave the unit sleeping a while...also found reference somewhere that the unit hardware CAN support USB OTG, but programmers have not released software fix yet...hopefully that will happen...in general, I'm pleased with the tablet after the initial disappointment.", "Title": "Wanted love it but am disappointed :(", "Date": "October 14, 2013"}, {"Author": "C120", "ReviewID": "R17Z88JGJKDFM4", "Overall": "5.0", "Content": "I like this company - I like the products - Buy this product if you like to - Expect the Arts & Science Undergraduate Society to deliver - Nice display - Nice software - Quick - Responsive. No Safari no problem embrace the PHABLET experience - Are you the person phone from a handle computer platform - Stop - No - Don'tASUS no funny biz. The motherboards are nice to.", "Title": "Arts and Science", "Date": "January 7, 2014"}, {"Author": "Michael", "ReviewID": "R3VCT7249W6LWU", "Overall": "2.0", "Content": "The BATTERY needs charging every time I use the MeMoPad - all I use it for is reading ebooks and occasionally check email.WotUp? Acer?Also, your Deliverer is not coming to my apartment address - just leaves the notice lying around - I only noticed it 3-4 days later.Please ask the deliverer to attach notice to my mailbox - after giving me a call!TX Amazon - your stuff is always good - I will continue our relationship!Best RegardsM.I. Bennetts", "Title": "Battery Problem", "Date": "December 13, 2013"}, {"Author": "Manik Kumar", "ReviewID": "R385LRC50R8ECN", "Overall": "4.0", "Content": "its 5 star, just missing GPS...hence 4 star only. Everything else about the tablet is perfect at this little price...", "Title": "its 5 star, just missing GPS...hence 4.", "Date": "November 1, 2013"}, {"Author": "Pedro Garrido", "ReviewID": "R226087L2FZPE8", "Overall": "2.0", "Content": "I bought this tablet august 29-2013 and when I press home button that show me a message the launcher has stopped and dont allow me to do anything, I call to asus support and they told me to fix the tablet I have to send it to him. I have to wait for use the tablet", "Title": "AWFUL EXPERIENCE", "Date": "September 23, 2013"}, {"Author": "Ifigenia Rangel", "ReviewID": "R1W2XJ4B4PALF9", "Overall": "5.0", "Content": "Hello Everyone, i still dont have my tablet because i live in Venezuela and i sent it to my sister house in the USA, but i must say that is a very good tablet i dont need to use it to write an excellent review.. my sister told me looks very nice and not cheap at all !!!!i really like it i cant wait to have it  in my own hand. i bought two accesories for it ..Fintie Folio Case for ASUS MeMO Pad HD ME173X 7-inch Tablet Slim Fit With Stylus Holder - PurpleEvecase 7~8 inch Tablet Ultraportable Neoprene Zipper Carrying Case with Dual Hidden Pocket & Handle -- Hot Pink/ Green", "Title": "still not with me", "Date": "August 30, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RZBY2DFPH5MX4", "Overall": "3.0", "Content": "Wrong color (black vs package marking stating it was blue). Other then that works great. Now to see if I can increase the time before it goes into standby mode.", "Title": "Standby time", "Date": "November 2, 2013"}, {"Author": "CLIFF", "ReviewID": "R3EGH145M5UHIG", "Overall": "5.0", "Content": "Manufacturer #  ME173X-A1-BLtablet operating system  Android 4.2tablet processor speed  1.2 GHzstorage capacity  16 GBdiagonal screen size  7 inchesscreen resolution  1280 x 800Wi-Fi capability included (Wi-Fi ready)  yesweight  0.7 ozcomputer battery type  lithium-ionmaximum battery life  10 hoursports  micro USBwireless connectivity  802.11a/b/g/nintegrated speakers  yesimage file formats  jpegmemory card reader  yeshard drive type  eMMCvideo graphics  SGX544audio hardware  Sonicvideo playback file formats  mp4audio playback file formats  MP3warranty length  1-year limitedform factor  tabletoperating platform  Androidtablet processor number  MT8125brand name  ASUSmanufacturer  ASUSmodel name  ASUS MeMO Pad HD 7 (ME173x-A1-BL)postconsumer recycled content  0 %total recycled content  0 %depth  0.4 inchesgift  yesheight  7.7 inchesmemory  1 GBon-the-go gifts  on-the-go giftsprocessor brand  Mediatekprocessor model  MT8125processor type  MT8125teacher gifts  teacher giftstechnology gifts  technology giftstouch-screen  yeswidth  4.7 inches", "Title": "Here is some info on this tablet i'm shareing..", "Date": "September 27, 2013"}, {"Author": "NYC consumer", "ReviewID": "R2GQLCVIHHLPIE", "Overall": "3.0", "Content": "Honestly, as a long time Apple user, wanting not to spend too much on a tablet- it is a bit of a disappointment. I guess you get what you pay for.", "Title": "it's no ipad", "Date": "December 20, 2013"}, {"Author": "terez", "ReviewID": "RB0ZIA1SF72HE", "Overall": "3.0", "Content": "So far, This tablet is good for generic kinds of functions like reading and using the internet, EXCEPT, That This DOES NOT SUPPORT ADOBE FLASH PLAYER. I am really quite angry about that and it greatly limits my activities and even on sites like facebook.", "Title": "no flash player :(", "Date": "October 19, 2013"}, {"Author": "jhix", "ReviewID": "R3FE31R6YTH6NE", "Overall": "1.0", "Content": "Research the forums and BBB before you purchase an ASUS product.  I received a TF700t whose screen cracked all by itself one day...found out that this is a recurring problem and the BBB has 1000's of compaints against the company - they don't stand by their products - $265 to fix a defective screen when we paid $380 for the tablet?  No thank you, Asus", "Title": "BBB of California - over 1000 complaints against ASUS - read them first!", "Date": "November 22, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00E0FDYKY", "Features": null, "ImgURL": null, "Name": null}}