{"Reviews": [{"Title": "Le Pan delivers another quality tablet", "Author": "ND Mike \"rabid1\"", "ReviewID": "R24UGWEHE01WY4", "Overall": "5.0", "Content": "This review has been a little while coming as I have been enjoying the tablet so much. My previous experience with the Le Pan line of tablets told me that this could be a really nice tablet and it didn't lie. Currently the tablet is completely stock and unmodified.First the basic specifications:Operation System• Google Android 4.2.2Processor• MTK MT8125, Cortex-A7 (1.2 GHz, Quad-core)Memory• 1 GBStorage• 8 GB NAND FlashDisplay• Panel – IPS Capacitive Multi-touch LCD Screen• Screen - 8\", 1024 X 768Network• Wi-Fi - Yes, 802.11 b / g / n• Bluetooth - V4.0 + EDR GPS and E-CompassBattery• Type - Rechargeable Lithium Battery• Capacity - 3260 mAhSensors• E-Compass• G-SensorSupport Format• Audio - AMR / AAC / AAC+ / MP3 / WAV /PCM • Video - MPEG4 / 3GPP / H.263/ H.264Camera• 1.2MP Front Webcam• 5.0MP Rear CameraConnector• Micro USB 2.0• Headphone - Standard 3.5mm Headphone Jack• Micro SD Card Slot - Support up to 32 GBLe Pan has always made a aesthetically pleasing tablet line, although they also never varied far from the original design of the TC970 9.7 in form factor.The mini is a complete rework in a slender light 8 inch case. There is a slight nod to the old design with the silver edges, but without the raised edge bezel. It has a very light feel, but remains solid in your hands. No case creeks or phantom taps through the back plate.[url=[...][url=[...]It has a simple I/O layout with the power, MicroSD, audio jack, Micro USB, and volume rocker all on the side.[url=[...]Sticking to what they do best is the display Le Pan used. A bright crisp IPS screen with excellent viewing angles. When the view is lost it is a slight fade rather than the sepia/monochrome blur of a lot of tablets. 3 people sitting side by side on a couch can easily watch a movie. The lowest quick setting for brightness is a little low but useable. I prefer using the slider in settings. I normally run about 25% and it is more than bright enough. The speaker quality, based on other tablets within the price range is very good. You have to remember this is not Beats Audio but a budget level tablet speakers.With my Netflix account settings to best there is little to no sync when the movies starts, which brings us to WiFI. While previous Le Pan tablet had good WiFi the 8” TC802A is even better. I can hold a steady -55dBm all around the house. Out to the curb I get -63dBm. The signal is steady with no major spikes or drops.The Dual cameras are nice. The 5MP rear camera takes great pictures in daylight and good pictures in average room light.[url=[...] Camera Picture[/url]While not officially supported I have been using a 64GB PNY Class 10 MicroSD with no issues, but I did have some difficulty getting it to recognize at first.It does come Google Certified with the full suite of apps including Play..The GPS is pretty strong. I can connect and find satellites much faster then my Excite 10 or the old Le Pan S. The E-compass is sensitive enough to pick up the smallest turns.The overall performance of the quad core Mediatek MT8125 processor and the PowerVR GPU are very respectable. One of the reasons I purchased the Mini was to try out this combo. Mediatek processors have always been good processors but not always mainstream.I decided to test the two games that are the most demanding of CPU and GPU. I started with the latest GTA: San Andreas. I set all of the video setting to the maximum and started the game. Much to my surprise it ran nearly perfect. The response to the controls was a little slow so all I had to do was drop the draw distance a little and it was fine.The second game is one I use all the time as it is difficult to find a tablet it will work at all on, Backstab HD. This Gameloft game has driven me crazy getting to work since I bought it. I have only had one tablet that just played the game no issue. Now I have two. The Mini ran it first try. I believe the game needs a lot of free memory and that is why the only other tablet I have it working on has 2GB. The Mini did force close, but once I dropped some of the video quality settings it worked fine. I had the same issue with Splinter Cell, I may have to dig that one out and give it a try.This bring me to benchmarks. While benchmarks may not always be translatable to real world application they are still good overall performance indicators for comparison. I decide to use 2 similarly specification tablets for benching. The Sero 7” Pro with the quad core Tegra 3 and the Afunta 8” with the Allwinner A31 and 2GB of RAM.[url=[...]I used Antutu Benchmark and Quadrant Standard since they are the most popular. The results were as follows: Le Pan MiniAntutu -  13785  OpenGL 13FPSQuadrant - 4567Sero ProAntutu -  13456 OpenGLQuadrant -  4787Afunta 8”Antutu – 12637 OpenGL 13FPSQuadrant -  3105You can see the Mediatek MT8125 holds it's own against the much touted Tegra 3 but because of what I mentioned before about real world I added the Antutu OpenGL 3D results. The Mini actually handled the graphics better than the Tegra 3. If you note the Afunta score it too also uses a PowerVR GPU .Battery life is above average for the price range. I have yet to run a complete pon to dead.Over all the Le Pan Mini does not disappoint. The design can easily fit in a work environment and the performance makes it a great game and media experience. At $179 finding a tablet within $50 of the Mini that has all the features and quality of the Le Pan Mini TC802A is a tall order.The original Le Pan community on the web lost it's original site but has been resurrected in the form of Lepanforum. They have a great bunch of users and are building a nice online community. You can find it easily with Google.", "Date": "December 27, 2013"}, {"Title": "Surprisingly good for a no-name brand", "Author": "ChilliConCarnage", "ReviewID": "R2P9LC6L4CYVGX", "Overall": "4.0", "Content": "Bought a black version of this tablet locally on BF.  Tough competition at this price point from name brand tablets,  like the Asus Memopad.  But I wanted a little bit bigger screen than the 7\" that most of the competition sports, as my LG phone already has a 5+ inch screen, and the 8\" IPS screen of the Le Pan fit the bill.I've owned a bunch of tablets -  here's my thoughts on the \"Le Pan\" :I was pleasantly surprised how snappy this 4-core machine was out of the box (Although it takes a relatively long time to boot up).  I was also pleasantly surprised that there was a firmware update available - it's good to see that an unknown brand like this actively supporting the product.  After updating the firmware, the biggest problem with this tablet was with the touchscreen.  It was very inaccurate around the edges, making it difficult to use. In fact, the screen would have earned this a thumbs down if not for the fact that another firmware update came out today that specifically updated the touchscreen.For the most part, the update did the trick, and I have only minor complaints now.  My main complaint is that the bezel is too small, making it a little bit difficult to hold.  Other than that, I think the form factor is great.  Also, I wish this thing had an HDMI output. My only other real complaint is that the sound is a bit tinny sounding.  The camera is nothing special either, but I use my cell for its camera - I can't think of a situation where I'd use my tablet to take pictures.Overall, I think I can recommend this tablet, despite some good products from the competition.  Snappy performance, Android 4.2.2, full Google Play support, no bloatware, good size, good battery life, and upgradable with a micro-sd card (I installed a 32GB).P. S.  When I plug in a generic 2.1 amp USB charger, an alert pops up on the screen telling me that USB charging is not supported and to use the included charger. I ignore this alert and have has no problems charging the battery to 100% dozens of times.", "Date": "December 19, 2013"}, {"Title": "Great tablet!  Highly recommended", "Author": "JohnA2u", "ReviewID": "R8J4PRMX07XXU", "Overall": "5.0", "Content": "First of all the white tablet pictured in the description  is not a Le Pan mini.  All the other pictures are though.Le Pan may not be be well known to most, but they are to me.  The Mini is my forth Le Pan tablet.  The company has a good track record for providing at least 1 version upgrade for most of their tablet models.  I wiuld expect the same for the mini.  They have a US based service center and stand behind their products.The build quality is great, the viewing angles are wide and clear no matter how you hold it.A few things not mentioned in the description above:It does have an IPS screen, GPS and wireless display capability.  Earlier Le Pan tablets have a proprietary 30 pin connector which makes it a little difficult if you need a replacement.  The mini has a standard micro USB port for syncing and charging instead.  It is also USBotg capable which means you can plug in a standard otg adaptor and then read a flash drive, plug in a card reader, mouse etc. If you plug in a powered USB hub, you can run all those things at the same time.  This is a very handy feature.Le Pan has had an active user forum for a few years now.  Read more about Le Pan at LePanforum.com. I can strongly recommend Le Pan tablets in general  and the Le Pan mini as their best so far.", "Date": "December 21, 2013"}, {"Title": "Exellent tablet, built solid..", "Author": "David V. Norris", "ReviewID": "R2DP59QZ3T93O6", "Overall": "5.0", "Content": "This is an excellent tablet and a fantastic value. I have read reviews complaining about not being able to transfer apps to the external SD card. Just root it by using framaroot, which is so simple, and install link2sd and folder mount. You will love this tablet. I play a lot of visually intensive games on it and it doesn't even break a sweat. Please read how to partition your SD card prior to installing link2sd. Enjoy.....", "Date": "March 2, 2014"}, {"Title": "5 stars if you can get it for $100", "Author": "Mike", "ReviewID": "R19RCBDZK46RQK", "Overall": "4.0", "Content": "Bottom line: This is a surprisingly good tablet.  I give it 4 stars at Amazon's price, 5 stars if you can get it for $100.A buddy bought one of these 8 inch tablets for $100 from OfficeMax over Presidents' Day. Since it was his first table, I set it up for him and played with it for a day.As an owner of a tweaked Samsung Galaxy Tab 2 7 inch, I'm impressed with the Le Pan TC802A. I even thought about buying one for myself at that price. (Am holding out for a similar promised unit, the Acer Iconia A1-830 with 16GB instead of 8.)While I like my Galaxy Tab, I now want a tablet with a wider 4:3 aspect ratio screen. (Like the iPad.) The Le Pan 8 incher is such a tablet. (Better for web surfing.)The resolution isn't the best by today's standards. It's the same as the pre-retina iPad. But it's good enough for all but the most demanding.Display brightness is on par with my Galaxy Tab 2 7. I've taken the both out in the Arizona sunlight and compared them side by side. They're virtually the same. (Washed out, barely readable.)But the Galaxy does have the better IPS display in that you can see it thru larger viewing angles. The Le Pan is not a \"group tablet\" for giving presentations. You have to be looking at it within 15 degrees of boresight.There is no auto-brightness. But the auto-brightness on the Tab isn't that great either, so I use manual brightness for both.But the Le Pan has haptic feedback, which my Galaxy does not. A nice touch. (No pun intended.) It feels like something is missing when I go back to my Galaxy.It only recognizes 5 touches (not the usual 10). I've never used more than 2 touches on my Galaxy, but I suppose if you play a keyboard on your tablet, then this isn't the tab for you.Similarly, it seems the GPS receiver can only lock on to a max of 6 satellites. Whereas I've seen my Galaxy lock on to 16. Even so, the Android App \"GPS Status\" reports more accuracy on the Le Pan than my Galaxy!The Le Pan runs Android 4.2.2 out of the box. That's the same as my Galaxy, yet there is more free RAM on the Le Pan than on my Galaxy, despite having rooted my Galaxy and disabling a ton of apps. Maybe that's because the Le Pan is running a purer Android. (No Touch-Wiz.)I've yet to see any lag. It benchmarked at 13000 on AnTuTu stock, without any tweaks.I like the Samsung keyboard better in that it has a row of numbers always present. I suppose you can install other keyboards.There's no crapware except the usual google apps that come with Android. Play store plays.Physically, the corners are square. (That is, not rounded.) Makes for less expensive production for the aluminum back. It's not painful when it digs into your palm, but rounded corners would be nicer.Weight is fine and the Center of Gravity is right in the center.Battery life is fine. (A day with normal use.)The volume and power buttons could be better. Too stiff and the volume button isn't long enough to easily lever.No dust cover for the SD slot.WiFi seems on par with my Galaxy. Both can work with weak signal throughout the house.The Settings page says it can work with an OTG cable and a flash drive. Haven't tried it.Speakers are on the back and aren't very good sounding. Youtube videos are hard to understand.Mic seems okay in that Google Search almost always gets it right.Haven't played with the camera.As other reviewers have said here, the Le Pan will update out of the box. They update the kernel and the touch screen.I have read on the xda-developer website that it is possible to get root on this tablet. But, since it's not mine, I haven't tried it.While you may be able to get root, I haven't seen anyone say they can install a custom recovery. (So no Nandroid backup.)It comes with a 1 year warranty, but I'd be surprised if there's any meaningful way to act on that if needs be.There aren't many 4:3 aspect ratio Android tablets on the market. You could buy the HP Slate 8 Pro for $310 here on Amazon. Even tho it has a higher res screen, it's heavier, thicker and has a reported flaw in the touch screen interface. (See the review at androidpolice.)Amazon isn't selling the Acer Iconia A1-810 new anymore. You can buy a refurb'd unit from Acer for $115. The slated replacement A1-830 is supposed to list for $150. (Any day now.)So, at Amazon's current price, the Le Pan TC802A is over priced. It's a fine unit, but if you can buy it for $125 or less, it's even better.", "Date": "February 23, 2014"}, {"Title": "Excellent tablet for the price", "Author": "Richard Kilen", "ReviewID": "R1Z8VYK6B5K31Q", "Overall": "5.0", "Content": "I purchased the LePan 8\" tablet on sale from another outlet, but wanted to post a review here. For the $100 I paid, I got a good tablet out of the box. As other reviewers have noted, there are some touch panel problems (sluggish response was what I noticed the most), and after the system and firmware upgrades they disappeared, so I now have an excellent tablet. For the retail price, I would probably be giving four stars.While this is the first tablet that's my own, I have a 2nd gen Kindle, and my household has two Kindle Fire tablets, plus another Android tablet. I also had Samsung smartphone until I broke the screen (that was a bad day), so I am quite comfortable using and configuring similar devices.As other reviewers have noted, the speakers are weak, but I expected that in a tablet in the lower end of the price range. However, I've watched several YouTube videos, and haven't found experienced any difficulty hearing clearly. For a good movie, though, I'd go with headphones or external speakers. I haven't tried using any Bluetooth speakers/headphones, yet.The viewing angle is good enough that my wife, granddaughter and I were able to watch and enjoy the YouTube videos. For a quality movie, that may not still be true, and that's where an HDMI jack might come in handy, but that carries the trade-off of needing to be near a TV, which could likely be able to play the same video without using the tablet.The 8GB of on-board storage is reasonably generous, but was insufficient to hold my 6GB of music files, so the MicroSD slot was immediately useful. The documentation refers to this as a MicroSD, but in reality it is MicroSDHC, or it couldn't support up to 32GB cards. I've read one report of it working with a 64GB card, in spite of that not being supported.Before I purchased the LePan, I had been planning to buy a NextBook 8\" tablet, as it seemed to be the best for my needs in the under $125 price range. When I saw the LePan on sale, I compared the two, and found the quad core processor and IPS display were improvements over the NextBook. I believe the only thing the NextBook had that the LePan didn't was the HDMI port. Since the two were very close in price, I took a chance on the LePan. I've not looked back.", "Date": "March 6, 2014"}, {"Title": "Great little tablet", "Author": "person", "ReviewID": "R2YV9FLJCHEIOK", "Overall": "5.0", "Content": "This is my second Le Pan tablet. The first one was the Le Pan S. After a manual update to jellybean that thing rocks. You can download the update from their website. It really made a big difference, a pleasant one. On to this new mini. This new Le Pan mini had an update waiting for download after boot up! The update really made a big difference once again. A very nice, fast little tablet. The camera is not bad, the same as other tablets I have seen, good enough for nice Facebook updates. The tablet has a nice solid look and feel, quite upscale in my opinion. No cheap flexy plastic here. Everything runs smooth and solid so far. I recommend it.", "Date": "May 16, 2014"}, {"Title": "Not my first Le Pan", "Author": "Amazon Customer", "ReviewID": "R18B0CDOK35TEH", "Overall": "5.0", "Content": "A perfectly adequate tablet and a nice size, too. Too bad about the speaker quality and location, but I don't see much room for improvement. Turning the tablet to landscape view and cupping my hand behind it does help amplify the sound. Very happy with my purchase.", "Date": "April 29, 2014"}, {"Title": "Had to send the first one back...", "Author": "swimminginthoughts", "ReviewID": "R2C8OHO0IA9OV1", "Overall": "4.0", "Content": "The first one would not boot after getting the OTA update.  I sent it back for a replacement and this one has worked fine.  I also own the Le Pan II and would recommend any of their products!", "Date": "April 27, 2014"}, {"Title": "Not really  the best purchase.", "Author": "Kathy Rhoads", "ReviewID": "R2CEH9HM7V5GEO", "Overall": "2.0", "Content": "It started out OK,but knows it just continually loads.I'd send it back but I threw away all the packaging.I like my Nook much better.", "Date": "April 24, 2014"}], "ProductInfo": {"Price": "$169.99", "Features": ", 8 inches Display\nA-Series Quad-Core A8 1.2 GHz\n8 GB Flash Memory, 1.0 GB RAM Memory\n0.77 pounds", "Name": "Le Pan 8GB 8-Inch Quad Core Android 4.2 Tablet (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41ltcVFcwiL._SX300_.jpg", "ProductID": "B00EN8UN4S"}}