{"Reviews": [{"Author": "Blake", "ReviewID": "R1MOKVVDJUR9VJ", "Overall": "3.0", "Content": "Got this tablet a few days ago because it was on sale. It's decent. The build quality isn't great (when you push you fingers on the back panel you can see warpage in pixels on the screen). But if you take care of it, it doesn't seem too bad. The performance is decent enough. I am mainly using it to hook up via mini hdmi to my 2nd tv to stream netflix and hulu. As the other reviewer mentioned, the sound isn't very good. I've also noticed that the battery life seems to be terrible. I've only had it for a couple days, but I charged it before I went to sleep, did some minor website viewing for 10-15 minutes and when I woke up 8 hours later, it was at 18% and a couple minutes later was requesting a charge. I may try and root and see if theres any skytex software on it that may be causing the issue (uninstalled other skytex apps). Will update if that works. All in all, a decent purchase if you can get it at the right price.", "Title": "Decent tablet (if you can get it for the right price)", "Date": "November 21, 2013"}, {"Author": "leslie benjamin", "ReviewID": "R24JSQFXGV2LKS", "Overall": "4.0", "Content": "Seems very pleased with the Skytex, although the name was not a real familiar one to me. Boots up quick....Looks like a winner.", "Title": "XMAS gift for husband, again", "Date": "January 26, 2014"}, {"Author": "Slim Thick", "ReviewID": "R3W18DPBJPU4NP", "Overall": "2.0", "Content": "Looked good. Felt good. Works okay but the battery life is crap. It would not last more than two hours before it needs recharging.", "Title": "Poor", "Date": "January 31, 2014"}, {"Author": "bossgyal", "ReviewID": "R22WX797EPWG05", "Overall": "1.0", "Content": "i charge  for hours and still shows low battery....battery goes down without even using the tablet. i am so disappointed.", "Title": "battery is useless", "Date": "May 11, 2014"}, {"Author": "Jamie Whitaker", "ReviewID": "RZYFTBWYW8EGV", "Overall": "1.0", "Content": "One of the two has frozen up can't do anything with it. The other has barely been used & not sure if there's been any problems. The batteries don't last long. I guess it must be true you get what you pay for!!!!", "Title": "Skytex tablets not a happy with as well", "Date": "March 1, 2014"}, {"Author": "Donna Terkelsen", "ReviewID": "R2KXBL4FUU9ODP", "Overall": "3.0", "Content": "bought this for my daughter for christmas.  within 2 weeks it would not come on properly.  did what was instructed and then contacted technical support.  they had me ship back the tablet and then tell me that the screen was broken, of course not when it left my home and that I would have to pay the entire purchase price for it to be fixed.  No warranty there.Have now received a new skypad and it seems to be working fine.  Thank you Patrick, the only thing missing was the charger for the wall.", "Title": "Good for kids", "Date": "February 21, 2014"}, {"Author": "twins mom", "ReviewID": "R23I08X4AW3J2B", "Overall": "3.0", "Content": "This product has a lot to offer, however the software is not standard and if you are unfamiliar with the Skytex system, you won't be able to use as you would other tablets or your standard software, web browsing, downloading apps.  I had to reconfigure the system to make it more user friendly.  Love the camera and video feature which I wanted for my 10 year old daughter.  I bought a Kindle for me but even at almost $200 it doesn't have camera/video.", "Title": "If you know how to work this thing . . . .", "Date": "January 6, 2014"}, {"Author": "Vic Buchanon", "ReviewID": "R32M0IMOPG03RH", "Overall": "2.0", "Content": "Bought this item for my wife. She loves the idea of being mobile and not having to carry something around too heavy, however the one thing that really upset her about this item is the battery seems to only last 1 1/2 to 2 hours. The specs says the battery life should be closer to eight hours. If she is on a long flight, the battery will die out before she gets to her destination and once she gets there she still has to wait for it to charge.This factor alone would give me pause to recommend this item.", "Title": "Not what i expected", "Date": "January 3, 2014"}, {"Author": "james broadhead", "ReviewID": "R1UVEVYN6NHR6D", "Overall": "1.0", "Content": "Terrible tablet. The resolution sucks. The apps are limited. The accessories are cheap. About 10 pixels went out withen an hour of use. I returned this item.", "Title": "Sucked", "Date": "January 1, 2014"}, {"Author": "wrbrkln", "ReviewID": "RFGHS7L7XKKBK", "Overall": "3.0", "Content": "I bought this on an Amazon deal for my kids to have something to play games on. For that purpose it works fine. If you are looking for a cheap tablet, this is for you. If not, spend the extra money and get something more sturdy.", "Title": "Works fine for the kids", "Date": "December 30, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00E3I3CU0", "Features": null, "ImgURL": null, "Name": null}}