{"Reviews": [{"Title": "Wrong choice", "Author": "ovejazin", "ReviewID": "R2XZFF6HVYLXEA", "Overall": "1.0", "Content": "I bought it as a repacement, and I have to say that this is junk, Out of the box very slow start up, will say is connected to the network but it will not load the play store 90% of the time, as soon as you update \"google play services\" for the play store and to use some apps that require the update.... it crashes the play store. I try my best to be fair considering the price but I have bought other tablets on the same price range with similar specs and this one wins the worst tablet I ever had hands down. I will not wait any longer, return label already print and back on the box same day I got it.", "Date": "April 18, 2014"}, {"Title": "TURRIBULL", "Author": "Duane F.", "ReviewID": "R1RCP8D07GUID9", "Overall": "1.0", "Content": "I had this for several months . I got this as my first tab to see if I liked tablets . Purchased on the bases of positive reviews on here that seem to have disappeared . The reviews here now seem to be more true to the Quality of this item . It seemed ok if not great until my wife asked for A larger tablet for Christmas . I got her a Lenova A2109 and the difference is stunning .My Akaso is SLOW .It wakes up slow , and loads web pages slow . Like 30 + seconds . I added A 16gb SD card and loaded it full of pictures and music and it would not let me use the camera saying the memory was full although the settings said otherwise . I tried deleting photos and apps but it still would not work .I contacted support and was told to reset which would erase all my loaded stuff , I did not want to but eventually did so.Support responded to my questions promptly .I dropped it off a low shelf while charging and bent the jack causing charge problems and now it is dead , thank god .I ordered my own A2109 refurbished $110.", "Date": "March 23, 2014"}, {"Title": "Worst tablet ever!", "Author": "14Kgold", "ReviewID": "RYN7XJVJAXHYL", "Overall": "1.0", "Content": "Bought this as a Christmas gift for my grandson. Worst idea ever!  I guess you get what you pay for but this thing was returned 3 weeks in. It never held a charge for more than 5 minutes and eventually wouldn't hold a charge at all. Returned. Lesson learned.", "Date": "January 24, 2014"}, {"Title": "Waste of time and money.", "Author": "Florida Mercantile", "ReviewID": "R194MAM6JAVIFL", "Overall": "1.0", "Content": "Wi-Fi doesn't connect. Continues to scan but fails to locate any networks. Have 2 other tablets, a laptop and 2 smartphones that have no problem finding networks, so I know there are available networks, just the Akaso tablet has problems.", "Date": "January 12, 2014"}, {"Title": "is not what i expected", "Author": "silvio rojas", "ReviewID": "R2STHJOBRJBKQL", "Overall": "2.0", "Content": "the tablet gets freeze when conect to internet, and the windows close suddenly, i'm very disapointed.because i was expecting a  good product .", "Date": "December 2, 2013"}, {"Title": "Keep in mind for the price it can not be the perfect one -> save money and time do not buy!o be satisfied s", "Author": "Hans-Joachim Seifert", "ReviewID": "RHW5DLR2655QG", "Overall": "1.0", "Content": "Update 28/01/14:After laying for a month the cams of the tablet are not usable. They now detect only a green something. Tablet resetdid not help. Rating reduced to one star. Do not buy!The price is/was (very) low of cause and therefore it could not be the perfect one, but the tablet does not met myreduced expectations or satisfiy me.Pro:-Thin, lightweight.-USB-OTG is working with mouse, keyboard, USB-drive... Some other (more expensive) tablets are not able to doUSB-OTG or without trouble-The tablet can handle several types of micro-SD cards.Contra:-You do not know, what you get in the box, because there are diffent pictures existing showing different housings and cam positions.-The digitizer-surface (with the black frame) is a little greater than the surounding housing or was not placed correctlyand bend itself at the edges and was not possible to press or stroke even. A cutter and skilled hands fixed it finally-Wifi-usage is not strong and is switching permanent between connected and not connected in hotel room or airport lounge.You have to sit right next to the hotspot to have a quite stable connection. And even then the transfer speed can not bedescribed as fast-The CPU cannot operate without small delays or short stops in programs or during operator usage-The accu will last 1 hour by permanent work only-The quality of the cam brings you back in time to late 1990s digicams or early 2000s handys. Today the customers could expect better quality-There will be the day you will miss Bluetooth. It is not built in, of cause I knew at purchase, but later I longed for...-The company gives not much infos or support on their homepage and does not offer additional apps or matchinggadgets like bags or screen protectorsLong story short:I will keep the tablet at home for testing software or when USB-OTG is necessary.I made another deal on Amazon 2 days later and spent only 50 bucks more for a new tablet from another company (A..s), and wastotally satisfied by workmanship, speed, GPS, Bluetooth, accu stamina, user interface add-ons, cam, andandand...But USB-OTG is not working and the new tablet is not able to handle all my micro-SD cards like the Akaso - so there is always something... ;-)", "Date": "November 29, 2013"}, {"Title": "UNSATIFIED KINGPIN TABLET CUSTOMER", "Author": "Thelma", "ReviewID": "R1E0OR3UGMBE9", "Overall": "1.0", "Content": "I though that I was getting a goo d deal for the price just to find out that was not even the case. I had problems about a week after I received the tablet. Screen freezing, very slow, the battery life is the pit. It is just not what is not like what they say it is at all. The only good thing about it is the price. Trying to get in touch with the seller is out of the question. I tried numerous time. I was told that they are the ones to call.If you ask me it is just a rip off selling a product and does not make yourself available if there are problems with the item. Contacted amazon they are suppose to be working on the problem with the Kingpin company We will see what happens.I am not happy with the tablet or the sellers of this tablet.", "Date": "June 2, 2014"}, {"Title": "Beware", "Author": "Charity Collins", "ReviewID": "R30PG6BC49WULR", "Overall": "2.0", "Content": "The tablet was small for 7 inches. It would also stay frozen and I would have to turn it on and off. I returned the tablet after a couple of weeks because of the problems. The battery on the tablet runs low really fast. My expectations were not met with this tablet.", "Date": "May 27, 2014"}, {"Title": "Nice!", "Author": "M. Berdan \"angelnurse97\"", "ReviewID": "R28AYWFBZZL0A3", "Overall": "5.0", "Content": "I waited a bit before writing this review. I got this tablet for my son for Christmas. Like many of you, I've heard conflicting opinions about Android Devices. This one I'm pleased to say meets all the good things you've heard! My son loves it!Nice size screen, loaded with useful apps and easy to use. Holds a charge well. Pairs quickly to your wifi and to any Bluetooth accessories. I got my son the recommended keyboard case with it.I'm pleased to say after almost six months of use I can't find anything bad to say. It's just not there. I'm truly pleased that I purchased this tablet!!", "Date": "May 23, 2014"}, {"Title": "Get what you pay for.", "Author": "Stephen Brown", "ReviewID": "R2DCZIO61QRPLU", "Overall": "2.0", "Content": "Good first tablet for kids - plays most fun and educational games just fine (as long as you have an outlet or a battery nearby and attached).  Short battery life, mediocre camera, nearly unusable for video chat.On a positive note, no great financial loss if it gets destroyed.", "Date": "April 19, 2014"}, {"Title": "Not what I expected!", "Author": "Kindle Customer", "ReviewID": "R2GFEB8ZFF1OE4", "Overall": "1.0", "Content": "No. I was not happy with it. Gave it to my son. He likes it. Uses it on his job!", "Date": "November 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EOZ27W6"}}