{"Reviews": [{"Title": "Don't waste your money.", "Author": "Rebecca R Sutton", "ReviewID": "R27I2ATDQIA2BU", "Overall": "1.0", "Content": "Slow didn't hold a charge. Stopped working and this all happened after it charged for 8 hours in a row. When dealing with Amazon about it they refunded and told me that they would wave shipping if I bought a  new one but they didn't.  Also it was such a hassel working with them.", "Date": "November 26, 2013"}, {"Title": "Don't waste your money like I did. Junk.", "Author": "Clinton", "ReviewID": "R3OYHUSLW8JJTL", "Overall": "1.0", "Content": "Don't waste your money like I did. Quit working in less than a month. Spent 69 dollars and got junk in return.", "Date": "May 28, 2014"}, {"Title": "You get what you pay for", "Author": "Leonardo J. Botelho", "ReviewID": "R3LS1CXTFARPYD", "Overall": "1.0", "Content": "There is no other definition to this item. It is cheap in price and quality. If it was not so slow, I might have kept, but I returned it.", "Date": "January 29, 2014"}, {"Title": "great gift", "Author": "rosangelina palacio", "ReviewID": "R10R5SPQF9NRTV", "Overall": "5.0", "Content": "this tablet was for my 14 year old son. its light weight non expensive . good for children thanks amazon", "Date": "January 25, 2014"}, {"Title": "Tablet", "Author": "SHEILA A.HORTON", "ReviewID": "R3FNUT7N8AN5MH", "Overall": "5.0", "Content": "This is a very good tablet works like a rabbit yes it links with the internet very fast, no programing needed. Easy to download items", "Date": "January 17, 2014"}, {"Title": "Total Junk", "Author": "R. C. Goddard \"Whitetail Fanatic\"", "ReviewID": "R15TPQP9YGBOPO", "Overall": "1.0", "Content": "Took a chance, and failed.I had an Archos tablet prior to this one, but when the mini-usb power solder connection broke I wanted a quick cheap replacement.CHEAP being the operative word here - this Axess tablet has poor battery life, network connectivity is spotty at best, can't multitask, cheaply constructed switch platforms....frankly I can't think of a single facet of this product that I would have a kind word for.  This being my 3rd tablet experience with 3 different brands, I can honestly say it's a total piece of crap.", "Date": "September 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00E01D36S"}}