{"Reviews": [{"Author": "Jerinechia", "ReviewID": "R2CZJ1OVG62SC3", "Overall": "4.0", "Content": "its great!!! i purchased it for my 12 yr old girls...cause i didn't want to get anything to expensive...but i would purchase it for myself...the only thing i suggest u do is go thru it to make sure there was nothing that  was downloaded that might be inappropriate for kids...it also fits gud in the case witht the keyboard attached...other than.that..the touch screen slides bk n forward easy...color on screen ..wonderful..IT'S A GREAT PRODUCT!!", "Title": "gud for the price", "Date": "October 24, 2012"}, {"Author": "Jeremy", "ReviewID": "R6H0DNJMJ5DTG", "Overall": "1.0", "Content": "It seems maybe this person is somehow removing reviews from their page....so I hope they sees this one.  I will personally see to it that this person won't be able to sell anything online again.  I ordered this product on the 12th, and it never showed up!  Tracking was never updated.  My wife did not receive her gift.  Times have been hard on our family this past year, and I was hoping to use this gift as my wife's surprise.  I guess the seller didn't care that their products got to the locations on time.  I'm not the only one with this issue!  Merry Christmas with my money.  This will be the last time you take anyone for their money.  I PROMISE!", "Title": "Item is fine: seller destroyed my wife's Christmas", "Date": "December 25, 2012"}, {"Author": "rn6277", "ReviewID": "R307YBOSJMDLDQ", "Overall": "1.0", "Content": "The positives first...the tablet came very quickly, no problem with delivery as some others have had. Negatives....you get what you pay for. It was completely broken, as in would not even power on within a week...complete waste of money.", "Title": "not happy", "Date": "March 4, 2013"}, {"Author": "thadarksandman", "ReviewID": "R3Q9OMQUJMEQ6L", "Overall": "5.0", "Content": "Got this for my fiance, as we have a budget but she wanted a tablet. She adores it. It runs android 4.0.4 out of the box(can't update to newer ones as far as I can tell, but I haven't had a chance to play around with it because she won't put it down.)It is smaller than an Ipad, at 7 inches, but the same size as the Ipad Mini. The camera is good(not great) quality. It has a pretty fast CPU/ram setup because it can run 7-8 apps at once before slowdown occurs. We know this because by default it DOES NOT close apps when you leave them. You need to adjust the settings or you will have a lot more running than you would like. There is a setting that closes apps on exit. It comes with a USB adapter which allows you to plug in a USB mouse or keyboard(why my fiance uses a mouse on a touchscreen,I have no idea but it makes her happy). The resolution on the screen is decent, not HD quality but good enough. I would say DVD quality.For 75$, it is a great bargain. She loves the pink color.My only issues are that it is prone to scratching(on the case) and it does not come with a screen protector(which is a MUST for a touchscreen, the Kindle 7\" ones will work for very cheap.) If you buy it, plan to buy a case, screen protector and an SDHC micro flash card(the one it comes with is 1GB, with about 1GB built in, decent but if you want more than a few apps and pictures, grab an 8GB or 16GB cheap.)Overall well worth the money.::Edit::It is important to note you can also use the other USB chord to connect to a PC. Useful for downloading apps. Also it supports WiFi tranfers of data. So you can actually transfer apps, music and movies from a laptop or wifi enabled PC without using the USB chord, which is very nice", "Title": "Can't go wrong for the price", "Date": "March 27, 2013"}, {"Author": "M. Elbulok", "ReviewID": "R2MIE3RBVDSIU4", "Overall": "4.0", "Content": "This was a great buy for my daughters 9th birthday. She loved the color as well as having netflix which are hard to find on some androids. The value for money is fantastic too.", "Title": "Wow!!", "Date": "October 17, 2012"}, {"Author": "JP", "ReviewID": "R6AA6TFO9285R", "Overall": "4.0", "Content": "Unit is not real fast, but has access to the google play store and overall works very well. This would be great to see if you liked the tablet format.", "Title": "Impressive for it's price", "Date": "January 23, 2013"}, {"Author": "David Johnson", "ReviewID": "R3W33OOCS3QP22", "Overall": "3.0", "Content": "I just got this last night. It is a Christmas present for my 18-month-old daughter. I set up Skype so we can talk to grandma, downloaded a bunch of videos, and installed a bunch of toddler games and kiddie music apps. If you have used a newer Android phone, you will be very familiar with this interface because it is almost identical and it was very easy to set up. All of my setup work went off without a hitch and it never crashed once (surprising for an Android)! As an added bonus, they included a screen protector, so they must have been paying attention to other reviewers who said that it needed one!For all intents, this will be a perfectly functional tablet for my toddler and because of the low price I won't have to worry if it gets damaged. I would have given it four stars but there are a few problems that I find worth mentioning, and they were enough to knock off a star:1. Internal memory is 1GB, NOT 4GB as stated in the product details. Thankfully, Apps2SD works on this tablet without rooting, and I already had a 32GB micro SD card from an old phone that mounted with no problem in this tablet, so I shouldn't run into much trouble with the limited onboard memory.2. Charger stopped working the first night. There are two ways to charge this tablet - through the DC charger port and through the micro USB port. I was originally charging through the DC port and for some reason it just stopped charging. I unplugged and re-plugged the charger but it still wouldn't charge. I can charge through the USB with no problem but it is something worth mentioning.3. Strange angle on the front facing camera. While testing Skype I noticed that the front-facing camera is angled up. That will be a slight inconvenience because one would typically hold this tablet on his/her lap and tilt it up to use the front camera. If you do that on this tablet, the camera will be aimed at your forehead, so it must be slightly angled downward to get a good angle with that camera. This is not an issue of my height because I am 6' tall.4. Poor viewing at an angle. The picture quality drops off rapidly as you tilt or turn the screen, so one must keep it close to perpendicular with ones eyes to get a good picture.I will come back and update if I find anything else worth mentioning, but so far it is a \"just ok\" tablet that will work for its intended purpose.", "Title": "Simple device which works, but nothing special", "Date": "December 17, 2013"}, {"Author": "T. Catron \"expert reviews\"", "ReviewID": "R3KGUZPHWWHGHP", "Overall": "1.0", "Content": "I ordered this on march 9th, by April the power button had already quit working and had receded into the body of the tablet. The return policy is very limited for this product for a reason. It is made from very cheap flimsy material. I guess you get what you pay for and it this case it is definitely true.", "Title": "Junk", "Date": "April 19, 2013"}, {"Author": "Mae Butler", "ReviewID": "RZNMWAVCP9B2", "Overall": "5.0", "Content": "Pleasantly surprised!  After purchasing and returning another tablet a few weeks ago I wasn't expecting too much.  But I am completely satified with this one.  1. Arrived 1 day early.  2.  Included extra items that were not listed in the item description.  3.  Very smooth and fast operation.  4. Great pre-loaded apps.  5.  Easy set-up, contected to WiFi as soon as I turned it on.  If I could I would give more stars!!!  I would certainly recommend it to others!", "Title": "Awesome product!", "Date": "December 4, 2012"}, {"Author": "Tremper com", "ReviewID": "R1QP14UPUY2OWM", "Overall": "1.0", "Content": "This is the second unit purchased and it too is not no working.  The first unit's power cord would not stay in and it got to the point it was too hard to charge.  The second unit worked a little longer and then would not boot up.  Spent lots of time researching Google and trying things but all that did was waste my time.", "Title": "Not Happy -- Will not buy again!", "Date": "September 8, 2013"}, {"Author": "laura", "ReviewID": "RGHFKSA9K5GZS", "Overall": "1.0", "Content": "The power button broke off within a week of receiving the tablet. This was my daughters 4th birthday present and she absolutely loved it until she couldn't use it anymore. It wasn't anything she did wrong either, I was actually using it when it happened. I contacted the seller to try to exchange it within the 30 day period but they conveniently never responded. Now its past the 30 days so I guess I'm stuck with it.", "Title": "broke within a week", "Date": "March 10, 2013"}, {"Author": "Mary Crosby", "ReviewID": "R61MURB67N0BW", "Overall": "4.0", "Content": "It is perfect for what I wanted.  It does everything my laptop does but it is slow.  I wanted something I could put in my purse and take with me and this is great.  I can read books on it, play games and surf the net.  I could not use the directions because they were too small for me to read and the type written instructions did not cover basics.  It covered only problems with the computer.  I would highly recommend this to people who are just looking for something to use to pass the time away when waiting at the doctors or other places.", "Title": "This is great", "Date": "December 28, 2012"}, {"Author": "Brwneyez", "ReviewID": "R1YQTO1FPK40A8", "Overall": "5.0", "Content": "My nieces love their tablets.  It satisfies all their needs.  YouTube, movies and educational games.  Oh, I almost forgot...they can take pictures and record videos!", "Title": "Great Buy", "Date": "January 16, 2013"}, {"Author": "C.Amison", "ReviewID": "R21FC9C5OUJ77Z", "Overall": "3.0", "Content": "This is a very nice tablet,but if you want to buy it from a company you can trust you need to go with someone else,NOT MARY TRADING! You can get this same item with a gel pad in the same price range. This company took a long time to get this item to me ( after an accidental order) and then when I explained that it was an accident and that I wanted to return this,they never responded. I have been trying for 2-3 weeks to get this returned and have my account refunded,but they keep ignoring me. If you want this item,it seems to be a good tablet,just don't use this company when purchasing anything.", "Title": "I recommend this item-BUT DO NOT BUY IT FROM THIS COMPANY!", "Date": "December 24, 2012"}, {"Author": "jennifer tommaso", "ReviewID": "RN2O5JNZUV26P", "Overall": "1.0", "Content": "I was very mad that i turned this on one time and then it stopped charging and would never work again worst buy ever!!!!!!!!!", "Title": "never worked", "Date": "May 13, 2013"}, {"Author": "stephanie ritchie", "ReviewID": "R1FRLVR5FFMLH6", "Overall": "4.0", "Content": "I bought this for my 9year old for Christmas. She LOVES it. It works great. Does everything she needs it to do. She watches netflix, you tube, takes pictures, surfs the net. She hasn't tried the skype yet. The only downfall is battery life. She needs to charge it every few hours and the earplugs don't work. But other than that great for the money.My 13 yr old, who is a critic, thinks it was a great buy too! I would recommend this tablet.", "Title": "ZEEPAD", "Date": "January 16, 2013"}, {"Author": "kristi", "ReviewID": "RHYQ0D4MMAIV0", "Overall": "5.0", "Content": "i got this for my daughter for an early christmas present (santas elf dropped it in the mail) she loves it!!! she is so excited and loves it. as of now there are no problems with this product", "Title": "zeepad is awesome!!!!", "Date": "November 21, 2012"}, {"Author": "Rory Cupen", "ReviewID": "R1AP7TV8EA5Y27", "Overall": "5.0", "Content": "Specs:Android 4.2 Jellybean OSMemory 1GB; 8GB StorageDual Core; Dual CameraA lot of stuff for $80 .. worry free.There is no GPS or Cell service for location services .. but for the price and typical Internet surfing, YouTube, Games and Apps - it's great!", "Title": "Well worth the price!", "Date": "September 23, 2013"}, {"Author": "Amaoze L.", "ReviewID": "RHEOFVGZNRQ08", "Overall": "1.0", "Content": "It has the worse camera ever and the battery does not hold charge at all.i wouldn't recommend anyone yo purchase that device at all its a waste of money.", "Title": "its bad device", "Date": "June 19, 2013"}, {"Author": "Meribeth hickey", "ReviewID": "R1DO4QWED067TH", "Overall": "1.0", "Content": "Thought these would be good for my kids and they were for about 2 weeks and then it just stoped working. It only turns on if you put it on the charger and says android on the screen thats it wont actually turn on all the way. save your money and buy something else.", "Title": "not worth the money", "Date": "February 25, 2013"}, {"Author": "Franklin Wills", "ReviewID": "R345GJX4IOGAZY", "Overall": "4.0", "Content": "Bought this tablet for my 3 yr. old grandaughter, she loves it, the games and netflix keep her occupied for hours. If it breaks i'll just have to buy another.", "Title": "great product", "Date": "November 18, 2012"}, {"Author": "Amazon Customer", "ReviewID": "RJ259BWDTKGNM", "Overall": "5.0", "Content": "Got this for my son for xmas . Hope he will enjoy this tablet as much as I  do mine.", "Title": "Xmas gift", "Date": "November 26, 2012"}, {"Author": "Amy Ford", "ReviewID": "R3PT541ASA5VKR", "Overall": "5.0", "Content": "I bought this tablet to use for our homeschool. The children can take it anywhere and it is very durable and charges quickly. I would highly recommend.", "Title": "Great Product", "Date": "March 20, 2014"}, {"Author": "Joseph Lucito", "ReviewID": "R1QE8YQFD2I35U", "Overall": "4.0", "Content": "it is easy to use and has meny good feathers,it runs fast , and is light weight and easy to carried", "Title": "ease of using", "Date": "March 10, 2014"}, {"Author": "kristen harmon", "ReviewID": "R3MHSYFOUJ794G", "Overall": "3.0", "Content": "When I touch the back of the tablet it makes the screen blur. Its slow and has to shut down ts applications a lot. Its good quality for 50 bucks or so", "Title": "not bad...", "Date": "February 28, 2014"}, {"Author": "kynda darnell", "ReviewID": "R25KV6B3UAQX3K", "Overall": "1.0", "Content": "do not buy this item. it is a nightmare. it wont let you load movies or music. most of the games you try to load wont. and you cannot get a hold of anyone for help. and amazon cannot help.", "Title": "do not buy this it is a nightmare!!!!!!!!!! it wont let you load movies or music. only games and some of them you cant load.", "Date": "February 20, 2014"}, {"Author": "ArcadeAddict", "ReviewID": "RING7V9ICKDU7", "Overall": "3.0", "Content": "So after everyone else in my family got tablets or smartphones, I knew I would have to get one too.  I found this on NoMoreRack and the price was rights so I got it.  I was a little nervous, since it was a no-name brand and my track record with NoMoreRack has not been great (brought so called $80 headphones for $7, sounded like $2), but I ended up getting it just before Christmas and trying it out.I was very impressed!  It was fast and responsive, and handled gaming, surfing, and even Youtube quite well.  It was a bit thick and heavy, but not unbearably so and it performed much better than any of my family's budget tablets.  I thought that I'd found a real winner!Until it died.  The day after I got it, I was doing some light gaming.  The battery was wearing down, and I was going to run it out and recharge it.  It gave me a message about the battery being low (10% I think), and then the screen was covered with white lines and static (that's the best way I can describe it).  I put it to sleep and then woke it up, but the lines/static remained.  And then it shut down with a pop.  Needless to say, I doubt it will recover, though I am going to try.  It has a 12 month warranty, so I'll see how well they respond.  If they do well, then this is just an exception and not the rule, and I'll change my rating.  If not, it will remain.So in conclusion, based on the other reviews here, it appears that this is an impressive tablet that suffers from quality control problems.  If you get it, be sure you can take it back or be prepared to wait on warranty service (I'll edit this review when I've had that experience).UPDATE: It seems that the whole \"white out\" thing happens every time that the thing gets low on power.  As such, I am confident in my rating.  If they can fix that irritating bug, then this will be a 4 or 5 star product...", "Title": "Great... Until It Died", "Date": "December 25, 2013"}, {"Author": "Brenda Richardson", "ReviewID": "R3OFOQ001UVNDU", "Overall": "3.0", "Content": "The Zeepad Tablet doesn't download more three items, before u have to factory reset, than you loose what you did down load.", "Title": "Pink ZeePad", "Date": "December 9, 2013"}, {"Author": "Meli333", "ReviewID": "R35YAC6H7U2FDC", "Overall": "2.0", "Content": "This tablet is slow, has very little memory, and the battery life is horrid!  We purchased for our toddler to use for education apps, etc, in hopes of reclaiming our iPads.  The tablet can only hold about 4-5 apps before memory is gone, and even then, loads very slowly.  If purchasing, definitely get some kind of additional memory card.  Battery lasts about 30 minutes.", "Title": "Slow, very little memory, poor battery life", "Date": "November 16, 2013"}, {"Author": "Daiana Marcano", "ReviewID": "R3M427F0ADRZGX", "Overall": "5.0", "Content": "I got this for my 7 year old niece for her birthday.  Works great and she loves it!  Downloads all Android apps.  Worth above and beyond what I paid for it.", "Title": "Great item for the price!", "Date": "September 19, 2013"}, {"Author": "Cheryl Souders \"cheryl\"", "ReviewID": "R235L4ZSF3B640", "Overall": "2.0", "Content": "I really liked this tablet until I tried to get the speaker to work there is no sound at all so it is being sent back its sad because it did have a really nice picture", "Title": "zeepad 7.0 dont waste your money", "Date": "September 4, 2013"}, {"Author": "Gianna", "ReviewID": "R3RVFP6U5FHA9J", "Overall": "1.0", "Content": "I READ THE REVIEWS AND I AM MAD AT MYSELF FOR NOT TAKING THE WARNING. DO NOT BUY THIS PAD. WE RECEIVED IN MAIL ON A WEDNESDAY. IT BROKE YESTERDAY ON THE FOLLOWING TUESDAY 6DAYS LATER! IT WAS MY 11 YEAR OLD DAUGHTERS GRADUATION PRESENT. THE VOLUME WAS LOW. I COULD NOT CHANGE THE TIME. AND THE CAMERA WAS FUNKY IN USE. AVOID THE CHEAP ONES AND BUY A HIGH QUALITY ONE THAT LAST YOU YEARS. I AM BOYCOTTING THIS PAD!", "Title": "BROKE AFTER 6 DAYS", "Date": "July 24, 2013"}, {"Author": "dori hodges", "ReviewID": "R1YAJA6IXCQ8VN", "Overall": "1.0", "Content": "My daughter just started using this tablet a few months ago because she did not have a wireless internet modem.this item stopped taking a charge.it's not even a year old.it was ordered Dec 6 2012.I'm having problems getting in touch with the seller importers 127.", "Title": "will not hold a charge", "Date": "July 23, 2013"}, {"Author": "DEE DEE", "ReviewID": "R2HZ3F28TO2J14", "Overall": "1.0", "Content": "I ordered 2 zee pads for my daughters. One worked fine the other did not connect to the internet. When i sent it back to be replaced the seller lied about shipment not once but three times, and then tried to insinuate that I never returned the product. It took almost 2 months to get my refund only after calling amazon customer care to complain. I will never purchase another product from this seller and would recommend that no one else does either.", "Title": "worst amazon experience ever", "Date": "July 17, 2013"}, {"Author": "Sebastian Villamayor", "ReviewID": "R32M0FCDJ7AD5J", "Overall": "4.0", "Content": "I bought it for my 7 year old daughter and so far I can not complain, she likes a lot, the games work properly and also YouTube videosI also use the Tablet sometimes and usability is quite good considering the price of the product", "Title": "good product for the price", "Date": "May 20, 2013"}, {"Author": "Tiffany M.", "ReviewID": "R2HXTTNLIVI1MY", "Overall": "4.0", "Content": "I recently brought a zeepad for myself, I liked it so much that I decided to get one for my younger sister who's in college. also brought her the case with a keyboard so she can take it to class with her and not have to lug her heavy laptop everywhere.", "Title": "Second one", "Date": "May 19, 2013"}, {"Author": "Shanicka Rumph", "ReviewID": "R13ECYRG9B8R4F", "Overall": "2.0", "Content": "It works slow the pen want cum out and it will not charge anymore. The first two weeks worked great after that down hill from there.", "Title": "Slow, and not charging", "Date": "May 13, 2013"}, {"Author": "Humberto", "ReviewID": "R3I49AVLRS2JLA", "Overall": "2.0", "Content": "I ordered them as a gift, when open by my girls (Twins) both of them had problems , 1 with the camera and the other with the wireless connection , then they both started to freeze ......and couldn't get them to work.......I have returned them for a refund", "Title": "Items not working properly", "Date": "May 7, 2013"}, {"Author": "Pen Name", "ReviewID": "R3JA2D90G11LEB", "Overall": "5.0", "Content": "Great product for my 9 year old!! Does everything u could want and more!! Fast on the internet!! Nice that it has Google play unlike some other tablets that u buy under $200. My daughter loves to tango chat on it. Lots of stuff it will do!! Camera takes quality pictures and video... would recommend this to anyone and have.. my daughter has dropped it already and all that happened is it popped apart but snapped right back together and there is nothing wrong with it. High quality made. Husband is a computer tech and picked it apart before we bought it he was thrilled when he saw and started playing with it!! A+++++++++", "Title": "zeepad 7\"", "Date": "April 28, 2013"}, {"Author": "Mr. Pilachi", "ReviewID": "RQML4OWJDFUGY", "Overall": "5.0", "Content": "this in nice I bout one 4 me and my friends they all love it if I have to buy another one I wouldn't think it 4 time.", "Title": "Zeepad", "Date": "February 10, 2013"}, {"Author": "Kenneth A. Williams", "ReviewID": "R1VAGZXTHZ3MZ3", "Overall": "3.0", "Content": "THIS TABLET IS VERY SLOW AT PROCESSING AND LOADING. THE DESIGN IS GREAT AND JUST THE RIGHT SIZE FOR MY CHILD. BUT OTHER THEN THAT THE CHARGER WENT OUT AFTER TWO WEEKS AND IT'S EVEN SLOWER THEN MY BLACKBERRY PLAYBOOK WHICH ISN'T A GOOD DEVICE.", "Title": "ITS DECENT", "Date": "January 15, 2013"}, {"Author": "ladydenise43", "ReviewID": "R7JIRC0UCN0L6", "Overall": "5.0", "Content": "I use this tablet everyday I forgot about my computer this product do everything I use my computer for but this is easy to carry anywhere. LUVIN IT!", "Title": "luvin it tablet", "Date": "January 5, 2013"}, {"Author": "Davida Disaster", "ReviewID": "RT3PN499LAR0X", "Overall": "3.0", "Content": "I got this as a cheaper alternative to the ipad for my kids (age 3 & 4) and I truly got what I paid for. I'm still unsure if the product I received is actually a Zeepad or a knockoff.PROS:*Only $70*I was one of the few buyers to actually receive their order from the seller.*Easy to set upCONS:*The packaging looked cheap and the pads themselves feel like they will break if not handle carefully.*I have tried adjusting the sensitivity of the screen but it's still a bit hard to use, many times you have to jab at things a few times and the stylus is useless.*The audio port is tiny and you can't plug in headphones.*The prong inside of the power port is offset a bit, as though someone pulled the power cord out at an angle. I have to carefully shimmy the power cord in whenever I want to charge it.*The date and time won't stay set.*Screen has lines.All in all they are okay but I should have just paid the extra money for a nook or kindle. At least I won't be too upset if the kids break them.", "Title": "Bleh", "Date": "December 26, 2012"}, {"Author": "Pen Name", "ReviewID": "RKRTRRQI4BRTW", "Overall": "1.0", "Content": "I bought mine almost 2 weeks ago and still have not received it... the have not updated their mail tracking and will not reply back to my emails... also when I looked up the location of where their business is I found that their one city away not more than 5 mins away from me... DO NOT BUY BEWARE", "Title": "poor product", "Date": "December 21, 2012"}, {"Author": "Nee_nique", "ReviewID": "R1KGZCRT56SZVN", "Overall": "1.0", "Content": "I ordered this product for my daughter for Christmas. She was able to get about a good month or two of use out of it. Now something is going on with charger port. It won't even stay charging long enough to get a full charge. In order to get a full charge on this device you would literally have to sit and hold the charger in the device with pressure applied for it to charge. I'm not sure if its even worth having device repaired or to just purchase a better device all together. Other than that my daughter really enjoyed this tablet. Just a waste of money for me. It's now collecting dust !!!", "Title": "Not a Great Buy !!!", "Date": "March 15, 2013"}, {"Author": "rahman", "ReviewID": "R1AIWG1CG03N0G", "Overall": "1.0", "Content": "Power cord was not a good fit to begin with, eventually, unit showed fully charged and wasn't.  Other units from this asian market have improper power cord fittings from what people have told me[ unfortunately after my purchase].", "Title": "bad fit power cord-eventual failure to charge tablet", "Date": "February 3, 2013"}, {"Author": "Love it", "ReviewID": "R1W3D5V3EPTQVW", "Overall": "4.0", "Content": "I got this for  my daughter for Christmas it made it Christmas Eve just in time for Christmas plus she loved that it had a lot of apps and the color of it.....sad thing she already cracked the screen :(", "Title": "Loved it", "Date": "January 17, 2013"}, {"Author": "Harlene Sellers \"reader1942\"", "ReviewID": "R3OKMZPXB8VPC9", "Overall": "4.0", "Content": "The only problem I had is the instructions are in broken English.  Seemed to be translated from another language and unclear what the instructions were.  I finally managed.", "Title": "looks great", "Date": "June 6, 2014"}, {"Author": "Donna Reaves", "ReviewID": "R1TEADP2MHRGNJ", "Overall": "2.0", "Content": "ALL OF THE 7' TABLETS I PURCHASED THIS YEAR HAS CAUGHT ON FIRE, REFUSED TO COME ON, I WASTED THAT MONEY BECAUSE WHEN HOUSE WAS BROKEN INTO THE TABLETS WERE DESTROYED COMPLETELY BECAUSE I AM GUESSING THEY DIDN'T WORK WAS TOLD I COULDNT RETURN", "Title": "The risk you take on used itemspy", "Date": "June 4, 2014"}, {"Author": "Livia P.", "ReviewID": "R24LNVGLZ1GH9H", "Overall": "1.0", "Content": "Horrible product, very cheaply made, disposable and breakable. Seriously, I bought 2 for my daughters and had to replace 1 in months and now the 2nd one is broken. Not worth it, you'll end up paying 2x when you could just have spent a little more and bought a better one. I'm not a firm believer of you get what you paid for, but in this case it is DEFINITELY FACT!", "Title": "DISPOSABLE,  6 MONTH EXPIRATION, NOT WORTH IT", "Date": "May 31, 2014"}, {"Author": "ChocoSlime", "ReviewID": "R2GK001A6B5H5K", "Overall": "2.0", "Content": "I got a Zeepad 7.0 as a Christmas gift in 2013. Although I never heard of this brand before and I was skeptical about its customer assistance and quality, I gave this tablet the benefit of a doubt because the ones who bought it for me weren't able to afford any of the most recognizable and reliable brands. After owning a Zeepad 7.0 for a couple months now, I now able to form my opinions about it.PROS:01. It's affordable compared to most higher end tablets, but it's not worth it in the long run.02. Although it's manual is lousy, the tablet itself is fairly easy to use.CONS:01. The firmware available on Zeepad's website WAS NOT the same firmware that was pre-installed on this tablet. One incident beyond my control caused my tablet to freeze on its third boot up screen and factory reset couldn't resolve that issue. I was forced to download a firmware from Zeepad's website and was in for the following surprise:A. My tablet's Internal Storage for apps went from 0.98GB to a lousy 504MB.B. My tablet's Internal Storage for system functions went from 0.98GB to 1.50GB.C. My tablet won't rotate between landscape and portrait orientations unless certain apps are launched. It rotated just fine on its pre-installed firmware.D. (This is more of a Google issue.) The Google Play icon was no longer a permanent icon on the home screen's menu bar. This appeared on the navigation bar on its pre-installed firmware.E. Two volume icons and some \"Emergency Calls\" icon are now on the navigation bar. These icons, which I find unless, weren't on my tablet's pre-installed firmware.02. Zeepad's website has NO contact info listed. Sure, they have \"About US\" and \"Contact US\" on their website's navigation menu, but clicking on to them does nothing.03. The user manual that came with this Zeepad 7.0 is one of the worst manuals I ever read. Even an seasoned reader will have difficulty figuring out how to interpret this manual's broken English.04. Google's stupid \"no downloading apps directly onto a microSD Card actually discourages users from even using Google Play in the first place. Why bother downloading new apps when your tablet barely has any internal storage for them.05. Sometimes the tablet wouldn't turn on when I'm powering it on. It would take about 2-3 attempts before I can turn it back on at times.06. I initially had trouble inserting my earphone jack into this tablet. Oh, and the earphones that come with it are quite flimsy.07. The AC adapter cord is too short. You'll likely need an extension cord for it.08. The battery life is as pitiful as its manual. Even when fully charged and on low brightness, it'll still drain within an hour or so", "Title": "This tablet's affordable, but not worth it in the long run.", "Date": "May 29, 2014"}, {"Author": "Frank P.", "ReviewID": "R1ZAQ0UZGDN5LY", "Overall": "4.0", "Content": "My 6 year old granddaughter found this (Pink 7.0 android tablet) to be easy to run and learn other things on it. Think about it 6 years old and she still love it. We bought a cover at Wal-Mart for almost nothing and it is still working great. Many thanks.The second is my 10\" Google Android Tablet. I thought this was going to be a nightmare. Had a little trouble with it but when it was working it was GREAT. I am a Capt. Firefighter /EMT. This tablet is great for looking up info. instantly, good size print and clear photos. I sent it out the first time and it was a month before I got it back. NOT from Amazon but the Post office. I emailed Amazon and the guys were great. I got my package back marked \"Unclaimed\". They looked high and low to find out why. I sent it a second time and this time they received it back in a shambles. The bag was opened, my letter was missing and I said well there goes $180.00 bucks. No these guys are great. They helped me right along. The thing is I got an email EVERY SINGLE DAY I was not ignored. Someone helped me everyday and my new Tablet is on the way. Jessica you have a great crew. Those guys should have a raise. Just plain simple. I wasn't ignored.", "Title": "Great Buy", "Date": "May 26, 2014"}, {"Author": "chris mcnair", "ReviewID": "R2UI9CW8RR7LMU", "Overall": "1.0", "Content": "By. Far worst android tablet ever they put android 4.0  and up without the hardware to support it far below minimum specs needed major problems with external SD card there is a internal storage 1gig and a built in SD card that prevents Downloads to the actual external SD card the 1 gig  built in SD card is not large enough  storage to hold  downloaded apps and  most things  to transfer to actual external SD card making the external SD slot useless and due to the internal SD card that's built in 80% of apps only recognize the built in SD card and dose not let you change the default download location tablet is extremely slow and is a waste of money there is for example there is a  $70 tablet made by Rca sold at Walmart amazon etc... That is a 1000 times better none of this is an exaggeration and I do not give bad reviews for no good reason for a little  more you can get a tablet that is A thothousand  times better", "Title": "do not buy", "Date": "May 17, 2014"}, {"Author": "Joseph Parks", "ReviewID": "R1OBT0NWUD4YP", "Overall": "2.0", "Content": "This newest z-pad worked great on its own for the first two months that wehad it. Now however it won't even turn on. my daughter was super excited to get it now its just a huge disappointment.", "Title": "delayed disappointment", "Date": "April 28, 2014"}, {"Author": "James_FGD", "ReviewID": "R1DP5UZ6ADVTYZ", "Overall": "1.0", "Content": "So this worked as well as I expected a \"zeepad\" to work; however, after three months the usb adapter unattached and fell into the tablet.  So much for a good thing I guess.", "Title": "It broke in three months", "Date": "April 22, 2014"}, {"Author": "Heather Paul", "ReviewID": "ROQDF1HVQZ82H", "Overall": "1.0", "Content": "I wouldn't give GOODIOS a Half star if I had that option. Not good customer service at all. I bought a zeepad for my niece birthday just about six months ago, it stopped working tried to contact seller to get the manufactures information, never received any contact from them..wouldn't recommend them at all. Customer service is very important to me and you failed.", "Title": "Too much inconvenience", "Date": "April 19, 2014"}, {"Author": "Alison Warren", "ReviewID": "R1IG8KLJVCQ7ZH", "Overall": "1.0", "Content": "When we finally picked up this product and brought it home, we tried to turn it on and it wouldn't turn on....we were very disappointed and now it says we cant return it....even more disappointed!! We never even got to use it a and paid $70  We would like to have a refund or replacement!", "Title": "Product Will nit turn on !", "Date": "April 12, 2014"}, {"Author": "MM", "ReviewID": "R36QH73BHDCJ8Q", "Overall": "1.0", "Content": "I bought this tablet for my daughter and it is very slow and doesn't hold much charge. I would not recommend this product to anyone.", "Title": "Not very satified", "Date": "April 5, 2014"}, {"Author": "debra", "ReviewID": "R4CJVUZZFDJXZ", "Overall": "5.0", "Content": "thank you for having this product. we bought for our daughter because she wanted a tablet. it didn't last very long but she enjoyed it while it lasted.", "Title": "cute", "Date": "April 2, 2014"}, {"Author": "barbara", "ReviewID": "RJHUXG9I4GQBQ", "Overall": "2.0", "Content": "it ran slow didn't play games good and it broke after 7 months I don't feel it was worth my money it was a big dissapontment", "Title": "zeepad android", "Date": "January 24, 2014"}, {"Author": "Saltamazon", "ReviewID": "R3FFTK2770AGFS", "Overall": "2.0", "Content": "Sound is note very good...keeps getting pop up for the same spam site that I keep deleting.  No way to close out possible apps that are still open.  Most androids let you hold down the home button so you can close them out  Plus side..it plays netflix", "Title": "sfvvg", "Date": "January 14, 2014"}, {"Author": "Margaret Isbell", "ReviewID": "R2E2W8YONKUEBQ", "Overall": "5.0", "Content": "Great little tablet for my 3 year old daughter. I received this item very quickly! Working with the seller was a very easy experience.", "Title": "Great All the Way Around", "Date": "January 13, 2014"}, {"Author": "dean yawson", "ReviewID": "R1CB2446X0CU7M", "Overall": "1.0", "Content": "The quality was low and the front camera was not working when you are skyping.it had a background noise when there is a voice chat", "Title": "Did not meet my expectation", "Date": "January 13, 2014"}, {"Author": "henry", "ReviewID": "R135SH59RWUFTZ", "Overall": "5.0", "Content": "it far exeeded my expectations it blows my mind what this little tablet can do it has all the ports to", "Title": "great product", "Date": "January 11, 2014"}, {"Author": "Yudi V.", "ReviewID": "RIEJ1Q6PTECIS", "Overall": "5.0", "Content": "Can't beat this tablet's price. My 9 year old daughter loves it. Clear picture, good sound. Great pink color. I hope it last long!", "Title": "Good Quality for the price", "Date": "January 6, 2014"}, {"Author": "Charlotte Crowder", "ReviewID": "R19QRAFLEGG8JW", "Overall": "5.0", "Content": "I love love this product. One reason is because I have dropped this item over and over and quess what it still works and works excellently. This item is well well recommended and grateful to have a well working machine that never really breaks and works with people like me that tend to drop objects a lot..lolI highly highly recommend this item.", "Title": "Excellent", "Date": "January 5, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R13DL8YFMTUWQ6", "Overall": "2.0", "Content": "You only can use the tablet 20 min or less. Is very slow. dont buy this tablet are bad quality dont waste money.", "Title": "Bad Battery life", "Date": "January 3, 2014"}, {"Author": "Suzette Lydick", "ReviewID": "R122YJW9FRDOQ1", "Overall": "1.0", "Content": "these are really cheap and thats great but its not a very fast product and leaves a lot of room for improvement.", "Title": "Cheap", "Date": "January 3, 2014"}, {"Author": "EC12", "ReviewID": "R6Q29S3ET5VA3", "Overall": "1.0", "Content": "The worst purchase since I have been shopping with Amazon. I should have trusted the reviews and my better judgement. It was not worth the price. It ruined my daughter's birthday.", "Title": "Not worth a penny", "Date": "January 1, 2014"}, {"Author": "mattt Steck", "ReviewID": "R3P7NJHY2TMGSK", "Overall": "1.0", "Content": "I ordered this product despite some of the varied reviews saying how poor it was.  I thought it was ridiculous and that I didn't need anything fancy to take notes on and such, well I was wrong.  This device is completely unable to do even the simplest of tasks without freezing up or taking forever.  I recommend avoiding this purchase at all costs.", "Title": "Terrible", "Date": "December 26, 2013"}, {"Author": "shorty", "ReviewID": "R3G47PWH4UFB6Q", "Overall": "5.0", "Content": "i love this pad it works great it has cool apps and play games very good i like the color", "Title": "the zeepad is the best tablet", "Date": "November 24, 2013"}, {"Author": "brittnik", "ReviewID": "R22RJB1CKMTO7P", "Overall": "5.0", "Content": "I love this Zeepad! Definitely worth the money. If you are looking for a tablet but don't want to spend tons of money the zeepad is perfect.", "Title": "Love it!!!", "Date": "October 24, 2013"}, {"Author": "jae", "ReviewID": "R312GM5SA2QSRF", "Overall": "1.0", "Content": "i bought this pink zeepad as a xmas gift it stop working less than a month later my kids was truly up set the thing would get so hot i thought the case was gone melt it was freezing up and everything im unhappy with the pink zee pad", "Title": "pink zee pad", "Date": "September 1, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RIX2XESUK6K0G", "Overall": "3.0", "Content": "The battery doesn't hold a charge for long but it works to limit tablet time for my 5 year old daughter.  The power button is VERY flimsy and I am terrified it is going to break at any minute but so far so good.", "Title": "Okay for my 5 year old", "Date": "August 24, 2013"}, {"Author": "noslen", "ReviewID": "R2JXGXYHC2TGY5", "Overall": "3.0", "Content": "Cool But it froze most of the time.but still a pretty good choice for those who watch movies on netflex", "Title": "good", "Date": "August 22, 2013"}, {"Author": "sarah mogu", "ReviewID": "R18VUSJCWUVQW6", "Overall": "1.0", "Content": "all of them broke within 1 month of buying the product. The charger broke it was a waste of money. I tried to contact them they will not refund back the money or take back their product because it is worthless keeping.", "Title": "upset with qaulity", "Date": "August 22, 2013"}, {"Author": "Elizabeth Rider", "ReviewID": "R11TWAUXXU1WKV", "Overall": "2.0", "Content": "I wasnt too thrilled with the product. It runs slow, and you have to push pretty hard on the screen to get it to work.", "Title": "zeepad", "Date": "August 21, 2013"}, {"Author": "Krista Lippert", "ReviewID": "R1DJRFOBWBUURZ", "Overall": "2.0", "Content": "Get what you pay for. Directions difficult to understand. Not user friendly...camera didn't work from the second we opened it and now won't charge.  Won't play most videos.  Not worth wasting your time or energy...frustrating", "Title": "Cheap", "Date": "August 14, 2013"}, {"Author": "ladii", "ReviewID": "RFZH1O70758EF", "Overall": "1.0", "Content": "I bought this tablet it turned on but did not let me  even get on the actual tablet to do.anything..first time buyer and worst experience...wouldnt recommend it ..still waitin on seller responds", "Title": "not worth", "Date": "August 14, 2013"}, {"Author": "kate", "ReviewID": "R11UGC22WNMW4E", "Overall": "3.0", "Content": "I bought this tablet for may daughter. The first one I bought was good. There was an accident and the company was great about replacing it. The second tablet arrived shortly but it didn't last long. The battery in the second unit would not charge. Eventually she couldn't use it even if it was plugged in. The camera, wi-fi, ect. worked great. I would recommend this tablet for minimal use or maybe as a back up kind of thing. Bubblestar was easy to deal with on returns. The only thing is you have to pay return shipping, which can be a little pricey. In the end I wound up buying another brand of tablet. So far, so good on that one.", "Title": "just my thoughts", "Date": "July 3, 2013"}, {"Author": "amandaaa", "ReviewID": "R3VGKDQTE8AA24", "Overall": "5.0", "Content": "The Zeepad Tablet 7.0 is wonderful ! I use it everyday without any major problems. The Internet works fine and as we'll as the apps.  Downloading apps from Google Play doesnt take but 45 seconds .However, when you set your notifications to vibrate it does not work. Also, when you try to play Temple Run the character stays on one side of the screen. Otherwise, this is the perfect tablet ! I love it and recommend it to everyone !", "Title": "Amazing tablet !", "Date": "July 2, 2013"}, {"Author": "Carol Miller", "ReviewID": "R1ENR117UNMW5F", "Overall": "5.0", "Content": "This product exceeds my expectations. I was a little worried because the price was so reasonable. but I have been very pleasantly surprised. My granddaughter loves it", "Title": "My granddaughter loves it.", "Date": "June 30, 2013"}, {"Author": "umer", "ReviewID": "R3SE7RDANUBJ60", "Overall": "4.0", "Content": "I wasn't expecting this little under $100 gadget to be that good, reliable, consistent, and durable. I bought it for my daughter as a gift, she has been using it for the last two months and can't take her hands off.. She plays videos, youtube, games, and all the stuff!! another daughter is now insisting that I get one for her.. Great product, good price, except it is costing me another one!!", "Title": "My daughter loves it, another wants it too!!", "Date": "June 28, 2013"}, {"Author": "Mary", "ReviewID": "R3R70FER60WONJ", "Overall": "1.0", "Content": "Probably ok for people who had an android  -  the user manual is useless -  tiny print , not literate \"English\" -  need a magnifying glass and flashlight to read  -  anddoesn't help much.", "Title": "Can't use it yet", "Date": "June 22, 2013"}, {"Author": "Madelein Fernández", "ReviewID": "R3P82KKXG3CZJ1", "Overall": "4.0", "Content": "Product comes in perfect condition and is a good choice for the price, I bought it for my niece she have 8 year old and she loves it.", "Title": "Product comes in perfect condition", "Date": "June 20, 2013"}, {"Author": "Kathy in Florida", "ReviewID": "R1I5MWP23MGHNP", "Overall": "1.0", "Content": "This Zeepad is a replacement for one I bought for my daughter because the first one stopped working.  In the instructions you receive it tells you not to charge it for more than four hours.  I found my 10 year old charging it more than the four hours because she forgot about it.  I told her over and over not to but heck, don't we all plug in our other devices and forget about them, or plug them in overnight with no ill effects?  Overcharging is the only thing I can figure that caused it to COMPLETELY STOP WORKING.  It worked fine for the first month and a half but of course now the return time period has expired so I am out the $75 for the Zeepad plus $15 for the cover I bought for it, and my daughter is disappointed.  Buy the tried and true, a Kindle or ITouch.  You get what you pay for I guess.", "Title": "Waste of Money--Dissapointed", "Date": "June 15, 2013"}, {"Author": "SJReiny", "ReviewID": "R3IHNFMLXF8DQO", "Overall": "4.0", "Content": "Bought the zeepad for my 10 year old daughter (who's a bit careless) in January 2013 because I didn't trust her with my tablet.  Overall, tablet works fine.  I like how it has a microcard for more memory.  However, overnight about 2 weeks ago, she turned it on and everything was wiped clean ... it's like it was formatted.  It also went back to the default language of Chinese.  So frustrating.  I've been searching the internet looking how to set the language back to English .. with no success.  Today I finally went back to my Amazon account, contacted the company Bubble Star (where I purchased it from through Amazon Store) and they contacted me within 1/2 an hour after my email.  After a whole 20 seconds on the phone the problem was solved.  Amazing!  They were just wonderful, and my daughter is back on her tablet looking up her fav apps again ... just in time for vacation!  Thank you so much, Bubble Star for all of your help!  If only I had thought of that earlier ...", "Title": "Zeepad -- some complications, but great customer service", "Date": "June 12, 2013"}, {"Author": "Matt Renini", "ReviewID": "R17GKZTYWDVS5P", "Overall": "3.0", "Content": "if you plug the power cord into the tablet then into the wall it makes a decent sized spark so you need to plug it into the wall first then into the tablet and you don't get a spark.  I don't think it will last to long make sure you fill out your warrenty", "Title": "don't know if it will last long", "Date": "June 6, 2013"}, {"Author": "pawpawpockets", "ReviewID": "R3JJX69GGYZRFO", "Overall": "4.0", "Content": "after reading reviews. I was not so sure if I wanted to try this product. So far worth the money. Easy enough set up. Got it for my 5 year old she loves the net fliks option. And we have loaded a few games already. But if your expectying kindle quality you will be disappointed. But your not spending Kindle money.Hope this helps. and have not had a problem with the battery life yet.", "Title": "took a chance", "Date": "June 5, 2013"}, {"Author": "nemo", "ReviewID": "RI23IJRTLMK58", "Overall": "1.0", "Content": "had it for about 4 months. Was slow and unresponsive at times and especially when it was nearing its end. Now it won't turn on no matter how long I wait for the screen to load, which on average took about 5 seconds after you hit the button to show the slide to unlock screen (not from startup.) In my opinion, not worth the money. Would rather have bought a 2nd generation ipod (and I hate apple products) that I know would hold up for a while. If u need something temporary to hold you and you have a lot of patience with technology, then this tablet will work for you. I had the patience but I was expecting something to last me for at least a year not 4 months.", "Title": "worked less than average till it broke", "Date": "June 4, 2013"}, {"Author": "#happydad", "ReviewID": "RBCS40GN0J7VQ", "Overall": "4.0", "Content": "Brought this tablet for my two girls (13) and (9) and they love it. They played with my IPad for weeks and wanted one. I thought it might be to much for them to handle at that age. I got them the Zeepad to see how they would handle it and they loved it more because it fit in there hands better. They use it everyday and anyone with kids know how hard it is to find something your kids will play with longer then a week. They are satisfied with it and that's good enough for me. Great buy for the money. #happydad.", "Title": "Enough for me", "Date": "June 1, 2013"}, {"Author": "melodylb", "ReviewID": "R3T7TH85F5EGXQ", "Overall": "4.0", "Content": "We purchased this tablet for our 3 year old, it is not blazing fast but it is able to play games and watch videos.", "Title": "Good unit for price", "Date": "May 29, 2013"}, {"Author": "tanmin", "ReviewID": "R3TNF399DZK1EJ", "Overall": "5.0", "Content": "I love it.I ordered it for my niece, to stop using her mom'slaptop.I'm sure she will be very happy!", "Title": "Great prodict", "Date": "May 22, 2013"}, {"Author": "SAN2RXE", "ReviewID": "R2GMH3GHBJSIWA", "Overall": "4.0", "Content": "this tablet makes a great tech gift for teens as the technology moves forward its a good price incase they break it you wouldn't feel the pain", "Title": "great gift for teens", "Date": "May 20, 2013"}, {"Author": "DICESS", "ReviewID": "R196648CMDND78", "Overall": "4.0", "Content": "I LOVE IT THE PRICE IS RIGHT GREAT FOR BEGINNERS HAS JUST ABOUT EVERYTHING THAT A 300.00 TABLET HAS VERY COMPACT AND I RECOMMEND THE THE CASE AS WELL THIS TABLET ALSO COMES WITH EARPHONES WHICH MY EXPENSIVE TABLET DIDNT COME WITH", "Title": "GREAT FOR BEGINNERS", "Date": "May 13, 2013"}, {"Author": "William C Frederickson", "ReviewID": "RDHC47JAGI313", "Overall": "5.0", "Content": "The color was just right for an 8 yr old girl.  The tablet does just as much for a different unit I paid much more for.Takes great pictures and connects to the internet with ease.It is a great gift.", "Title": "This was a gift to my grandaughter", "Date": "May 10, 2013"}, {"Author": "Denny Dederick", "ReviewID": "R295ZYXHP6GLXS", "Overall": "4.0", "Content": "I already wrote a review for this Tablet in the White ZeePad reviews sold by Goodios. If you're interested in this Tablet you should read it. I'm writing this right now from the ZeePad Tablet.", "Title": "For My Review of This Tablet Check the White ZeePad Sold by Goodios", "Date": "May 6, 2013"}, {"Author": "Denny Dederick", "ReviewID": "R1HCVF65ZIT4IC", "Overall": "4.0", "Content": "I bought the first ZeePad for my grandson on Christmas. The second I bought for my girlfriend in the Philipines.  I hadn't sent it to her yet and my laptop's hard drive failed. I used the ZeePad to order a new hard drive online. This just happened yesterday so I am writing this review from the ZeePad. This little machine does pretty good considering the price. Yeah, they're slow from site to site and page to page...but it usually gets there. If you ever experienced the old dial-up service you've got a pretty good idea of the speed of this Tablet. Games work really well. I've uploaded several movies onto it to send to my girlfriend and they play really nicely. I installed an equalizer app and it doubled the sound quality. Music and movies sound fantastic now with even cheap headphones. I've been talking to my girlfriend in the Philippines on the chat messenger using the built in webcam. Not a bad little machine. Really glad I have it till I fix my laptop. Sorry Anamae, you'll have to wait a little longer.", "Title": "Really Came In Handy", "Date": "May 6, 2013"}, {"Author": "ajoy76", "ReviewID": "R2CVHHZ98IL9WZ", "Overall": "5.0", "Content": "I bought this for my son to use for high school, it works great but needs a power booster for the battery because your not supposed to use it while its charging.  We removed all games but you can put apps on it to password protect games or whatever so you control when your child uses certain things.  We bought a keyboard with it it works well, we attached the cord over the back of the case.  Although the stylus does not fit well in the case but that is the case not the tablet for you.", "Title": "Use it for school", "Date": "May 5, 2013"}, {"Author": "melissa opperman", "ReviewID": "R2ZW5756HDFH4O", "Overall": "5.0", "Content": "The tablet is great! Well worth the wait to receive it. I plan on buying another one in the near future.", "Title": "Pink tablet well worth the wait", "Date": "April 2, 2013"}, {"Author": "SueSue68 \"Simply Me\"", "ReviewID": "R12SSKW8XK0BCU", "Overall": "5.0", "Content": "I bought this for my grand-daughter, and now I'm considering buying myself one!!! Meets all my expectations!!! She is simply loving it!!!!", "Title": "Simply Wonderful!!!", "Date": "March 30, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RHVOUMZUCAQEL", "Overall": "1.0", "Content": "Had to return product would not turn on. It cost me 14.00 to send it back and still have not heard back I have a VERY upset daughter.", "Title": "pink tablet", "Date": "March 30, 2013"}, {"Author": "Natalie Dennis", "ReviewID": "R2SRZBNBCFCP75", "Overall": "3.0", "Content": "screen blacks out some time. Could be a bit bigger for the price of the pad. so far so good", "Title": "Zeepad", "Date": "March 26, 2013"}, {"Author": "amanda", "ReviewID": "R294GIGR6KC6ND", "Overall": "5.0", "Content": "I love the product. Only have 2 complaints. The first one being that there is hair underneath the screen. And its not small! And the next being that the back wasn't snapped on all the way. At first I thought it was broken, but then I just pushed it together. I will be buying 4 more for presents.", "Title": "love it...but...", "Date": "March 25, 2013"}, {"Author": "L. Free", "ReviewID": "R2WRLKM6CRTUEO", "Overall": "1.0", "Content": "The manual is very small and not user friendly. Had a question so thru Amazon went to a email trying to get an answer. that was a joke. No where in any of the paperwork does it give you a manufacturer name or contact infro. so if needed for warranty, guess I will be screwed. said not to charge over 4 hrs at any given time. Do not Use while being charged. Charge holds about 2 1/2 hrs at the most. So this could be a challenge. UPDATE: I ordered 1 for me then 4 days later ordered 1 for grdkid. On 9th day mine quit, so I returned to Amazon. Other kept locking up and in 3 1/2 weeks quit. She did not save her box and it had to be returned in orig. box. Plus with No factory service infro available, I might as well roasted marshmellows with that money.", "Title": "lower quality", "Date": "March 23, 2013"}, {"Author": "Ltsouder", "ReviewID": "R2260P2WO40DQB", "Overall": "4.0", "Content": "I bought this for my daughter. She is only six so, I didn't want to spend too much. Just something for her to read and play games on. Great choice. Cute and inexpensive.", "Title": "Great for kids!", "Date": "March 22, 2013"}, {"Author": "dayhigh", "ReviewID": "R3N2EGOFC0JFDC", "Overall": "5.0", "Content": "This is an amazing little tablet...my daughter loves it.  We purchased one we had to return because of tons of problems. (different brand).  We have had no issues...problems...with this one at all!!", "Title": "LOVE IT!!", "Date": "March 20, 2013"}, {"Author": "amv89", "ReviewID": "RV57OLXI77Q99", "Overall": "1.0", "Content": "I got this for my daughter and I can't even log onto to it.. It's not even a zeepad.. I can't long onto my gmail for her to get on if I can't log onto the Internet :| seriously! Wasted money! I knew I should have went with a better brand instead of trying to save a little money.", "Title": "Wow thanks for nothing", "Date": "March 19, 2013"}, {"Author": "Kathy", "ReviewID": "R1X8USL8DEHUZ4", "Overall": "1.0", "Content": "Its now in my junk drawer. it don't hold a charge worth crap! Not worth 20 bucks! waste of my money!", "Title": "horrid product", "Date": "March 18, 2013"}, {"Author": "LindaG \"Linda\"", "ReviewID": "RKCIABS7SU0YB", "Overall": "3.0", "Content": "I bought this for my  10 year old daughter.  She loves it but I don't expect it will last.  It's cheaply made and the speakers are awful!  Its also kind of slow.  Overall for a kid it will work but when it dies on her I will get her a \"real\" tablet.  Lesson learned.... When it comes to electronics...... Cheap is not better.", "Title": "You get what you pay for.....", "Date": "March 15, 2013"}, {"Author": "Mom of 2", "ReviewID": "R2V9FHCYD6ZPQD", "Overall": "3.0", "Content": "It was ok there are nicer ones out there. But it does the job my daughter is happy with it. I would buy a different one for myself.", "Title": "It works great for kids.", "Date": "March 15, 2013"}, {"Author": "Sandra Lee", "ReviewID": "R2KR6XJ36IRYPX", "Overall": "4.0", "Content": "I love my zeepad it is great.It does the job  that I need it too do. Can I get a free case for it.", "Title": "sandra lee", "Date": "March 6, 2013"}, {"Author": "patty", "ReviewID": "RVBQOE9ZKTJ1N", "Overall": "4.0", "Content": "Item was as described. My Granddaughter loves it. would recommend it. took about a week and half getting here on acclunt of ups taking it several different places.", "Title": "great Item", "Date": "March 3, 2013"}, {"Author": "Earnest A. Hooton", "ReviewID": "R3PLMNA9203Q5C", "Overall": "1.0", "Content": "The screen on this piece of crap broke within three deays of receipt.  Spend the additional money for a Samsumg.", "Title": "not worth it", "Date": "February 22, 2013"}, {"Author": "marty", "ReviewID": "R3VMF6P5IV8ICB", "Overall": "5.0", "Content": "I WAS REALY SURPRISED OF THE QUALITY OF THIS TABLET AND HOW CHEAP IN COST IT WAS. i WOULD FOR SURE PURSHASE ANOTHER  ONE", "Title": "pink tablet", "Date": "February 19, 2013"}, {"Author": "reba emery", "ReviewID": "R2F4YQGJ7PXP1B", "Overall": "5.0", "Content": "I bought this for my daughter for her birthday, I really like the fact that it has the google play on this tablet, whereas some of them don't. This tablet is actually high quality, it came with a nice stylus, so far it hasn't froze or had any glitches!", "Title": "Nice tablet!", "Date": "February 12, 2013"}, {"Author": "Regina F. Love", "ReviewID": "RSDT5M8LSHHHC", "Overall": "5.0", "Content": "Bought these for Christmas gifts for my daughter and grandaughters this year.  So far they work really good.  I am also thinking of getting one for myself.", "Title": "Gifts", "Date": "February 12, 2013"}, {"Author": "Elizabeth m wilkins", "ReviewID": "R1ZYR2VTPEYCKR", "Overall": "2.0", "Content": "mad it was brocken i am getting it fixed where i canget it fixed at and i will pay a low price for it", "Title": "it was broken when i got it", "Date": "January 17, 2013"}, {"Author": "Amelio Arroyo", "ReviewID": "R1CMLNKYK9TA6N", "Overall": "5.0", "Content": "It is not what I order online it might look the same but it those not do what I thought it would do and it's not working right.", "Title": "Arroyo's Reveiw", "Date": "January 12, 2013"}, {"Author": "Patti Dye", "ReviewID": "RXXE1JTNANNRH", "Overall": "5.0", "Content": "It was a perfect first tablet for my 9 year old niece! She loves being the only one with this color! The screen is a nice size and she can easily do what she wants with it!", "Title": "PINK 7.0 ZEEPAD ANDROID 4.0 TABLET PC COMPUTER", "Date": "January 7, 2013"}, {"Author": "Rafael Pedraza", "ReviewID": "R39C0J7K7EDCF0", "Overall": "4.0", "Content": "Great for my daughter, great quality, excellent price.  I didn't give it five stars because battery doesn't last very long.", "Title": "Great product for the price", "Date": "January 7, 2013"}, {"Author": "Indy Tool Man", "ReviewID": "R2N46XN2YSW9NP", "Overall": "4.0", "Content": "Nice little tablet for my daughter, however i wish it used the same charger as every other android device in america uses.  My only real complaint on this is the charger and the plug ins are kind of tight, for instance the charger and headphone jack have to be wiggled to get them in.  My daughter usually brings it to me to install either one so she doesnt break it", "Title": "Nice little tablet", "Date": "January 7, 2013"}, {"Author": "Kenneth King", "ReviewID": "REFG9FCX3T8U", "Overall": "4.0", "Content": "It took a minute to get here, but it was worth the wait, very good tablet many options, many aps available, camera, is great, security is also good, would recommend", "Title": "TABLET", "Date": "January 6, 2013"}, {"Author": "Destiny C-Roc", "ReviewID": "R2ESKZEZRG9YLR", "Overall": "3.0", "Content": "This is made in China quality at it's best. The tablet is very functional and perfect for my 9 year old. She wanted a Kindle so I cheaped out and got this. The android interface is just like the phones and the Google play store is great. The internet browser is horrible but I just installed Mozilla and that works fine. There is a lag sometimes and I did notice banding in the screen. Games that use tilting motion are not recommended. The camera is crap but Skype is fun on it. There are lights behind the plastic that you can see and feel the heat! Overall I am happy with it. We saved $100 on something she will probably break or lose before it goes out on it's own.", "Title": "Familiar interface and apps", "Date": "January 2, 2013"}, {"Author": "Jackie Lilleodden", "ReviewID": "R3QNJREL9T8XWL", "Overall": "4.0", "Content": "My daughter loves her! She downloaded texting app. Wish I would have known they could use the Zeepad to text and not gotten her a phone.", "Title": "Great product", "Date": "December 31, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R16YSZTB7TB5LL", "Overall": "5.0", "Content": "I really love my tablet. It dose everything it says it advertised. Now that I have on I have to get my children one. I notice you have different colors by any chance do you have green?", "Title": "I love my tablet", "Date": "December 30, 2012"}, {"Author": "Kristina", "ReviewID": "R1OQTEUOIP2TSN", "Overall": "5.0", "Content": "Came in earlier than I thought and my daughter loved it for her Christmas gift. Loved that I had a choice to buy pink!", "Title": "Just what I expected", "Date": "December 29, 2012"}, {"Author": "amos laclair", "ReviewID": "R1HO7LD09B5YEN", "Overall": "2.0", "Content": "order'ed two pink  android's One came in white with no explanation? both came on time, but was not well package'd", "Title": "color bline", "Date": "December 28, 2012"}, {"Author": "Jude", "ReviewID": "R2GHQQVICGCHA1", "Overall": "5.0", "Content": "the color is even better than it looks and has your apps ready to use. The color is like a neon pink , Was able to download skype from playstore easily. works great. netflix works. For long use only; you will need to stay plugged in. But works great.", "Title": "Good Buy", "Date": "December 28, 2012"}, {"Author": "VALDIRENE BACCHUS", "ReviewID": "R2CMYSJ5Q19EYS", "Overall": "3.0", "Content": "take long time to turn it on, and the battery get low very fast, but for kids play it's fine,", "Title": "to slow", "Date": "December 27, 2012"}, {"Author": "Starlimac", "ReviewID": "R7OMD6QUG4X6F", "Overall": "5.0", "Content": "Bought for 14 year old daughter, works great, does eveything its supposed to.She loves it and I get some peace and quiet.", "Title": "GREAT DEAL", "Date": "December 27, 2012"}, {"Author": "Trish", "ReviewID": "RZ4ECMQMCTEP3", "Overall": "4.0", "Content": "Got this for my daughter for a starter. She enjoys it for the most part, sometimes the connection is a little slower than she would like & has frozen up a couple times. But for the most part has been a great buy.", "Title": "For the price", "Date": "December 20, 2012"}, {"Author": "Wanda Powers", "ReviewID": "R3966S87762RH2", "Overall": "4.0", "Content": "Price was right, ordering was easy and it arrived very quickly.  Is very cute, does what I was expecting it to do.  I'm giving 4 stars at the moment as I purchased 2 as Christmas gifts and I have opened and used and downloaded games for the 2 grandchildren I purchased it for but haven't had enough usage time to give an outright raving review.  I have had little issues so far with the charging, but charge has held since the last charging.  I did have an issue of getting 1 to shut down & then starting back up again, however, I unplugged charger and the little bug seemed to straighten out.  Hopefully once the children have received their gift & played with them awhile I can give a better review.  Seller is awesome so far!!  Haven't had to ask for technical support yet so can't answer to that.  Instruction booklets are TOO tiny to read, however Seller did enclose printout w/some directions & hints in package, didn't see until later though, so check your package for the instructions! Oh!! and they come with all kinds of cords & hookup options, earphones AND a stylus!!", "Title": "NICE", "Date": "December 12, 2012"}, {"Author": "Jessica Rabe", "ReviewID": "R124YJ6UY34F2C", "Overall": "1.0", "Content": "I worried about whether to purchase a non name brand tablet for my daughter, who wanted one more than anything.  Looks like I was right, it doesn't even turn on without the charger, and even then, it won't go to the home page.  Looks I will be purchasing a Kindle, at least I can trust that.", "Title": "Ruined my daughter's Christmas", "Date": "December 25, 2012"}, {"Author": "historianchick83", "ReviewID": "R2GRDRB8AORO1X", "Overall": "2.0", "Content": "First, the color in the picture is not AT ALL what I recieved. This one is a Dark Hot Pink, not the pale, lighter pink featured. Had I known that, I would have gotten it a bit cheaper with another seller, but my daughter wanted this one. Second, it did not come with the gel pad or a pen. I purchased the same one in red for my son that came with both, but that is my fault for not CAREFULLY reading the product detail. Most definately a misrepresentation on the color though. Other wise, they are charging, and my daughter will either get over the fact its a darker pink, or I will have a new ZEEPAD!", "Title": "Not what I expected....", "Date": "December 7, 2012"}, {"Author": "kendra mcelfresh", "ReviewID": "R3KTMNBV5LZ0Z3", "Overall": "1.0", "Content": "I bought this got it on a wednesday i believe and by friday the touch was out of it. two buttons fell off of it , my keyboard wouldnt plug up to it  because a piece inside fell out and it stopped taking charge,", "Title": "had to end up trashing it", "Date": "November 27, 2012"}, {"Author": "Terry Mills", "ReviewID": "R1N336TZ4UGUME", "Overall": "5.0", "Content": "Zeepad is exactly as advertised. Was delivered in a timely fashion and works great.Pink is not my normal color but with a cover it looks fine.", "Title": "great buy", "Date": "May 16, 2013"}, {"Author": "P. Duboc", "ReviewID": "R21ZZTYNL3KOJT", "Overall": "5.0", "Content": "First off this tablet is priced VERY low!It's able to play FLASH, APPLE Tablets CAN NOT........It's able to stream Netflix, HBOGO, Crackle, and The CW.It's everything I was looking for in a tablet, I love this tablet!", "Title": "THIS TABLET IS A GREAT DEAL!!", "Date": "May 14, 2013"}, {"Author": "Don", "ReviewID": "R10O7MGXLQSWF1", "Overall": "1.0", "Content": "I was looking forward to getting an inexpensive off-brand tablet that came rooted and appeared to be comparable(hardware wise -cpu/processor & ram)to the more expensive brand-name tablets. It worked fine for about a week then the touchscreen started becoming unresponsive occasionally, which was usually fixed with a reboot. The touchscreen became totally unresponsive after about 2 weeks. After trying to reset/reinstall the firmware unsuccessfully, I concluded that it is a hardware issue. It is a cheap off-brand implementation of a tablet, I don't recommend buying this one. Other reviewers have noted this same issue on similar tablets so it's probably a good idea to check them out before buying.", "Title": "Worked for about 2 weeks...", "Date": "April 24, 2013"}, {"Author": "Mark", "ReviewID": "R1YZ9018F9O0RA", "Overall": "5.0", "Content": "I am no beginner with smart phones and tablets. The screen is sensitive and responsive, the sound is surprisingly loud and clear, the screen is bright although it's not great for angled viewing (as is typical), and it seems like a solid build. ( it does not creak when applying some pressure from the corners). The accessories are welcome. I used the included screen cover, but opted to buy a cheap case for it.  I had no problem charging it although the charger seems to go into the charging hole only with moderate pressure (more than I expected) and I hope that pressure is not going directly to the circuit board because if it is, that may be why people have charging issues over time. I might suggest using a USB wall charger instead. I love having access to the play store over something like a proprietary game echo system. I installed an app that locks the home screen with a pin number, sets up a kids screen allowing only the apps you want them to have access to and I'm off and running with a smile. I will post back after my 5 yrs old grandson plays with it for a while to post.", "Title": "Seems very capable", "Date": "April 4, 2013"}, {"Author": "pennybrowne", "ReviewID": "R3TSL25GI5HE7N", "Overall": "1.0", "Content": "After 2 weeks of usage, the thing has stopped working. While it did work, skype was awful as the Microphone installed with the webcam delivered nothing but white noise, the charger has decided it won't charge it anymore, and it won't work at all. All in all, it should never had been made, and I was silly enough to purchase this product. It is a total waste of money. Cut your loses and just buy a well established tablet, you get what you pay for.", "Title": "Total waste of money.", "Date": "March 1, 2013"}, {"Author": "Preston Bibbs", "ReviewID": "R1I7H2ESPL2SB4", "Overall": "1.0", "Content": "The tablet always has a kind of defective charger. Every Zeepad I bought which i'm pretty sure is like 3 have all broken. No refunds Stay Away!", "Title": "Chargers break easily all 6.", "Date": "February 10, 2013"}, {"Author": "cr", "ReviewID": "R2F00AUH5F8EU3", "Overall": "3.0", "Content": "Haven't purchased yet, but want to buy for my mom and the reviews tell me it should work out for her. She's not tech savvy, but would like the basics of a tablet - email, skype, Facebook, reading, and games. She's not all about the best or newest gadget, and I think this is what she would get for herself.I'm.hoping this will also be good for my 3 year old who spends a lot of time with her. When I get it, I'll try it out and make it simpler for her and possibly will buy one for myself if its as good as it seems.I'd also want to get her a keyboard/case and was wondering which would be a good fit for this particular tablet?", "Title": "Hoping To Buy", "Date": "February 6, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R28VYC709IGAFV", "Overall": "4.0", "Content": "I ordered the zeepad as an alternative to letting my 3 year old granddaughter play with my kindle fire.  It's great for her and she is very proud to have her own.  Very easy to use.", "Title": "zeepad is great", "Date": "February 4, 2013"}, {"Author": "Gramma4d", "ReviewID": "RCS284GWQ34HF", "Overall": "1.0", "Content": "It is not the brand stated it was supposed to be a Zeepad but it is a MID.  It does not turn on most of the time. It works randomly. It has not worked at all for two weeks now.", "Title": "Very Dissapointed", "Date": "February 3, 2013"}, {"Author": "Pen Name", "ReviewID": "R8VHE8T6J6N1", "Overall": "1.0", "Content": "I ordered this tablet for my 10 year old daughter. My other two teenage daughters have the  iPods touch and I figured trying this tablet would be cheaper. It worked wonderfully for a day, but the screen froze permanently. I returned it and received a new one, but sadly to say it happened again. I asked for a full refund and within two days the refund showed on my account, so I'm very satisfied with the customer service provided by the seller. I will now buy my daughter an iPod touch instead.", "Title": "You get what you pay for!", "Date": "January 30, 2013"}, {"Author": "Daniel Benda", "ReviewID": "R1PSKFL4YZ2063", "Overall": "3.0", "Content": "Not the highest quality product, but for the price it works as expected. I bought this for my daughter and she is fairly happy with it. The one issue it does have is that the volume down button gets stuck occasionally.", "Title": "Works for my 6 year old", "Date": "January 21, 2013"}, {"Author": "Deidre Lynn Salcido", "ReviewID": "R2LOXDASNRWQTG", "Overall": "5.0", "Content": "I bought this for my niece.  She hasn't seen it yet but I have and it is a nice piece of technology.  It is slim and lightweight.  Thank you!", "Title": "I Love It!", "Date": "January 20, 2013"}, {"Author": "Niecy", "ReviewID": "R3ICP8XBOLE6F0", "Overall": "1.0", "Content": "ZeePad is a piece of Junk. Did not come with a manual as stated. Worked for  less than 2 months! Don't buy!!!", "Title": "ZeePad", "Date": "December 7, 2012"}, {"Author": "vanessa", "ReviewID": "R2B9FSHDGQNO7Y", "Overall": "1.0", "Content": "It freezes non stop the it doesnt work dont waste your money not kid friendly and takes bad pix if you can get it to work", "Title": "Sucks", "Date": "March 27, 2014"}, {"Author": "Pancit25", "ReviewID": "R1EJG7000ZBWQ7", "Overall": "1.0", "Content": "Piece of crap! 2 weeks in and it broke- wont turn on at all! Before that the damn thing keeps shutting off! So mad.... I spend and wasted my money & time. I didnt bother to return it & bought an ipad for my kid instead.", "Title": "Dont waste ur DOLLAR!", "Date": "March 20, 2014"}, {"Author": "Patricia Schumacher", "ReviewID": "R16W39BILFHK3I", "Overall": "1.0", "Content": "Bought one for my granddaughter and it worked for less than a month. Now it locks up all the time if  you can even get it to turn on at all. Save your money for a better tablet.", "Title": "DO NOT BUY THIS", "Date": "February 1, 2014"}, {"Author": "A. Cherry", "ReviewID": "R2FMVKNZ7XR55A", "Overall": "1.0", "Content": "This product was not a ZeePad and came in completely different packaging than our ZeePad.  Battery life VERY poor and applications very slow.  Not a good tablet even for the small price tag", "Title": "Not a ZeePad", "Date": "January 14, 2014"}, {"Author": "Ruth himes maslin", "ReviewID": "R3D8UGF38FPMZI", "Overall": "5.0", "Content": "Christmas gift for my granddaughter...age 5.  She loves it...the service was prompt and accurate.  It is a great product...would order it again", "Title": "Great!", "Date": "January 2, 2014"}, {"Author": "D. Swindell \"Swindda\"", "ReviewID": "R3DFLYX7WXS1XH", "Overall": "5.0", "Content": "The is an unbelievable tablet/PC for the price. It was a gift for my granddaughter who just turned 6. She loves the fact that she has her own computer.I tested and set it up for her before I gave it to her. I must say that as an iPad 2 user I was a little jealous of some of the features it has being a PC also. I love that she can call me on Face Time since I have trouble understanding her little girl voice on the phone. Somehow I can understand a little easier on Face Time.Goodios's service was very good. I received the tablet quickly and it was well-packaged.Thank you!", "Title": "Great tablet/PC for a low, low price! EXCELLENT!", "Date": "November 29, 2013"}, {"Author": "demetral", "ReviewID": "R31YCHUS8XMX0S", "Overall": "1.0", "Content": "very poor quality..it worked one week and then.crashed..I guess I got what I paid for...I will make a.better purchase next time. don't buy it", "Title": "very poor", "Date": "September 16, 2013"}, {"Author": "Lburton2316", "ReviewID": "RJQA228ER3XX", "Overall": "1.0", "Content": "This item I purchased months ago is very slow at downloading or even loading you guys definitely get a zero I will never purchase anything from your company again my money totally went down the drain the tablet also dies very quickly meaning like a half hour after using it u have to recharge it again", "Title": "Slow", "Date": "August 26, 2013"}, {"Author": "care", "ReviewID": "R2ZWQQVZUQSDHH", "Overall": "5.0", "Content": "It works good and small in compact, I use it for everything when I don't feel like logging onto my laptop. Would recommend getting.", "Title": "Pink 7/0 Android Tablet Computer 4 GB", "Date": "April 22, 2013"}, {"Author": "Jennifer", "ReviewID": "R328E5XRNKD7N0", "Overall": "5.0", "Content": "This tablet is great for the price! No problems with it at all. My shipment was lost in the mail and the seller was very helpful working with me and the postal service. Even with the delay, I still received it 2weeks before estimated delivery. The tablet isn't ipad material but it is well worth my money. Would definitely reccommend!", "Title": "Love it! Great seller!", "Date": "April 17, 2013"}, {"Author": "mc819", "ReviewID": "R3UEAD29V779R7", "Overall": "4.0", "Content": "i bought this for my brother and he liked it, i did too, it doesn't have the best quality camera but it's still pretty cool", "Title": "c", "Date": "April 12, 2013"}, {"Author": "Zoeldar", "ReviewID": "R3QLYVEH6YQKWO", "Overall": "1.0", "Content": "While impressive out of the box, the connector for the charger has become too loose, and the device no longer charges...looking to return (??) and replace.", "Title": "Zeepad broke in month 2", "Date": "April 4, 2013"}, {"Author": "Michael Gonzalez", "ReviewID": "R1P1J2S390BYH1", "Overall": "5.0", "Content": "THANKS... GOOD NICE.. ALL BE FINETHANKS... GOOD NICE.. ALL BE FINETHANKS... GOOD NICE.. ALL BE FINETHANKS... GOOD NICE.. ALL BE FINE", "Title": "THANKS... GOOD NICE.. ALL BE FINE", "Date": "April 1, 2013"}, {"Author": "Karen crosby", "ReviewID": "R16CFXRS4JTU0L", "Overall": "1.0", "Content": "It didn't come at all and I would like my money back! I have 4girls and do not have money to give away, my kids are heart broken! If anyone can help me to bring this guy down plz let me know! In the mean time I will be checking things on my end! I will not let this rest, I'm so upset!", "Title": "He's a fake", "Date": "March 24, 2013"}, {"Author": "Robert Fetty", "ReviewID": "R2Y0RYTK8OOOUT", "Overall": "1.0", "Content": "This is a cute little TOY.  You have to charge it every few hours.  The first time I used it I charged it for over 9 hours and it was still not fully charged.  The only return policy is dead on arrival. I WOULD NOT BUY THIS PRODUCT AGAIN.PINK Color 7.0 ZEEPAD(TM) ANDROID 4.0 TABLET PC COMPUTER 4GB WIFI, CAMERA, YOUTUBE, GAMES , SKYPE VIDEO CALLING &NETFLIX; MOVIES", "Title": "Battery life is horrible but it is an ok TOY for kids.", "Date": "February 11, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1XB0LS3T6V5M2", "Overall": "1.0", "Content": "After reading the reviews on this device, I ordered it f or a friend for Christmas. He gave it to his child and it stopped taking a charge at the beginning of February. Now the child has no Christmas gift and we can’t return it. This product is awful. Save your money", "Title": "Dont waste your time", "Date": "February 11, 2013"}, {"Author": "Susy", "ReviewID": "R3KO4QNC2OOL94", "Overall": "2.0", "Content": "My daughter loves It however the batterie in this tablet is horrible she leaves it charging all day and after A half hour of playing with it it's already beeping that its got low batterie", "Title": "Mmm batterie sucks", "Date": "January 31, 2013"}, {"Author": "crystal", "ReviewID": "R2AGIOP7SHWIVE", "Overall": "1.0", "Content": "The product was not what I thought it would be.. IT looked thrown together like the manufactur made it to quickly.IT had some scratches with no manual or warranty.. The zeepad did not arrive by Christmas even though it said it would before I submitted Amazon. I have been purchasing from Amazon for years and this has never happened before However I will not be using them again", "Title": "Zeepad", "Date": "January 23, 2013"}], "ProductInfo": {"Price": "$73.98", "ProductID": "B00ED56QQU", "Features": "Android 4.2 Jellybean Operating System/ Nandflash: 8GB\nRAM 512MB;ROM 4GB\nLCD: 1024* 600; Dual Camera\nSkype Video Calling and Netflix Movies, eReader. Market App, Games etc\nLimited warranty: 1 Year; physical damages are not covered by this warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/316HRWOuTiL._SX300_.jpg", "Name": "ZEEPAD LATEST VERSION 7\" Android Tablet 4.2 Jellybean Capacitive Touch Screen A20 1GB RAM 8GB Hard Drive Dual Core with Dual Cam (7'' Dual Camera Dual-Core (A20), Bubblegum Pink)"}}