{"Reviews": [{"Author": "Renee A. Bristow", "ReviewID": "R35SRQ8P4NHG2F", "Overall": "1.0", "Content": "This tablet is extremely hard to operate, even for adults. I have my own tablet that runs android, so I understand how they work. It takes several taps for the unit to recognize anything, and it is very hard to navigate. I tried to reset to factory settings, in case I did something wrong, and it gets to a step that says press enter...but there is no enter button! I tried every button that I could think of, nothing worked. It's extremely frustrating for my 5 year old granddaughter. Now I have to take it away from her and send it back. Don't buy this!!", "Title": "frustrating", "Date": "September 6, 2013"}, {"Author": "Leo S.", "ReviewID": "R2E09Q0FRI9EU3", "Overall": "1.0", "Content": "Only worked a few times then the touch screen mechanism locked up. features are nice if it would last longer than 3 days", "Title": "don't buy it", "Date": "December 14, 2013"}, {"Author": "Trina Westfield", "ReviewID": "R2H8S0HMK5T38Z", "Overall": "1.0", "Content": "My husband bought one for each of our kids at Christmas. He was going to buy another tablet for them, and the sales person at the store talked him into this because he said it was a much better product, more durable, easier to use, etc. Boy, was he wrong. We have had nothing but trouble from both of them since day 1. It took forever to get them started up so the kids could try them out. They crashed every few minutes, froze up, took forever to load anything. We were not able to return them to the store they were bought from and could not return them by the time we realized there was no way we were going to get them to ever work. My kids refused to touch them because all they do is crash and freeze up. The buttons already fell off one of them, and not from hard use, just normal turning off/on! I can't seem to find any information on the company itself to see if one can be fixed under some kind of manufacturer warranty. It's so frustrating, and I wish we would have stuck with the tablets we were going to originally buy.", "Title": "Not user friendly, freezes up, will not load programs, constantly crashing...", "Date": "April 6, 2014"}, {"Author": "J. Mcdonald \"Jen McD\"", "ReviewID": "R19H7SNMZ0259M", "Overall": "1.0", "Content": "I did not buy this from amazon, but did purchase two from zulilly for Christmas. We bought them for our two year old twins since her big sister has an iPad. These are truly junk- slow operating system, no memory, not user friendly and a complete waste of money. My twins cried because they could only use the calculator and camera functions on our four hour plane ride. Please save yourself the headache and avoid this tablet at all costs!", "Title": "Worst purchase ever", "Date": "December 26, 2013"}, {"Author": "april briggs", "ReviewID": "R30GLP41FTZMHP", "Overall": "1.0", "Content": "I bought this for my 2 year old for Christmas cause it looks so darn cute, and to keep her out of trouble for getting my phone.  I've spent the last week trying to figure out why it \"won't connect to the Playstore server\", why the \"connection has timed out\", and why I have to \"try again later\".  These are not the exact words of the errors I've been getting, but you get the idea.  I thought it was my lack of computer programing knowledge, but when I downloaded the same game on my 7 year old's tablet (not a Munchkinz), I knew it wasn't me.  I only wish I had read the reviews before I purchased it.  Don't waste your money on this piece of garbage!", "Title": "This thing is a piece of junk!", "Date": "December 26, 2013"}, {"Author": "Chicago  Girl", "ReviewID": "R126AM7460B3A9", "Overall": "1.0", "Content": "Crashed after one month!! DO NOT BUY IT!!  Total waste of time AND money! Buyer beware of this horrible product!", "Title": "Terrible", "Date": "February 17, 2014"}, {"Author": "Lindsay Allmon", "ReviewID": "R2S9FFPCSJ6HJR", "Overall": "1.0", "Content": "I regret telling my mother-in-law to buy this for our kids.  The operating system is horrible.  To even get the app working where they can play the pre-loaded apps, you have to be connected to Wi-Fi - which I don't have yet in my car so it's worthless on long car rides.  IF you can get it to connect to the Google Play store & IF you can download other games, the memory gets full very quickly.It took me hours to get both tablets set up.  The kids keep trying to play them, and the system keeps crashing.  Save your money or buy a more trusted tablet because this is junk.", "Title": "HORRIBLE!", "Date": "January 4, 2014"}, {"Author": "Mommy of Four", "ReviewID": "RHP8M7IPTBKFQ", "Overall": "1.0", "Content": "I bought two of these for my kids (5 and 8) for Christmas and they've been nothing but trouble.  The touch screen is frustrating for adults and kids, alike, the android operating system is unbearably slow and now that we've loaded three apps (all highly rated frequently used apps on our Samsung tablet so we know they are good apps) on each one the units are giving us error after error in both installing free or paid apps on the play store, the play store is locking up and the Kiddoz app is also not allowing us to use the games that are \"preloaded\" or browse the kids app store.  They now only work, and not very well, with the three apps we loaded on to each.  Neither one is near the memory capacity of the device.  At any rate, this is probably one of the worst purchases I've ever made and is a terrible product.", "Title": "Don't waste your money!", "Date": "December 26, 2013"}, {"Author": "mmllngr", "ReviewID": "R1ZKAIED0PX0L7", "Overall": "3.0", "Content": "We got this for our daughter and it stopped working within a week so i read all these reviews and everyones having problems. I was dreading calling bc everyone knows how customer service can be but Zulily gave me an option to refund or get a new one. I was on the phone for less than 5 minutes! I suggest everyone to call. Easy fix! :)", "Title": "zulily", "Date": "January 8, 2014"}, {"Author": "rootbeerslop", "ReviewID": "RQNBQ1ZATXWXM", "Overall": "1.0", "Content": "The construction is cheap.  One side of the volume button barely responds.... there is basically no HD room to add any other games... so you are stuck with playing the Wi-Fi only Kids games... so what about in the car ?????  ARRRRGH !!If I could turn back time, I'd just buy a cheap 7\" Acer tablet (or something like that).  It is also NEARLY IMPOSSIBLE to install games from the Play Store... you get Errors every time !!!  -  I finally got a few on there after hours of trying.  The troubleshooting for this is NIL, and you are supposed to just be able to Log Out of the kidzo stuff to have regular Android functionality... NOT THE CASE.. I could go on and on about how much this thing irritates me... and on top of that, the kids don't even want to play with it... they just want to use mine or my wife's because they actually have cool games on them.  A waste of 80 bucks....At this juncture I'm trying to install games to the Micro SD card, but I have the feeling I'm going to waste my entire Sunday evening with no positive results, and I'm quite technically savvy.", "Title": "Not worth the money...and impossible to set up / add games.  BEWARE - NO HD SPACE !!!", "Date": "January 5, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00E05KD4Y", "Features": null, "ImgURL": null, "Name": null}}