{"Reviews": [{"Title": "I want to return it!! its horrible!!!", "Author": "Luther Anderson", "ReviewID": "R291F703CP4N7O", "Overall": "1.0", "Content": "I hate this tablet the resolution is extremely poor and the battery life is extremelyyyyyyyyyyyyyyy poor I cant use it for 10 minutes and I really mean 10 minutes without it dying. is there anyway i can return this tablet and purchase a better one? This is very unacceptable. I literally cannot take it of the charger for 10 minutes without it dying and no apps are on. I want to return it for a better one", "Date": "November 28, 2013"}, {"Title": "Awful Screen Display!", "Author": "James Porter", "ReviewID": "RR4FNYMYEUI25", "Overall": "1.0", "Content": "This tablet is not for a person who plans to really use it to do important things. The screen is awful and I really would want to return it. It may work for children.", "Date": "December 11, 2013"}, {"Title": "well worth the money!", "Author": "James Thurman", "ReviewID": "R29N0NHN115VGY", "Overall": "5.0", "Content": "bought it as a gift for my grandaughter, she loves it, never puts it down. she truely gets full enjoyment out of it. she is three years old and it has been very educational for her, i am very glad i made the purchase!", "Date": "March 6, 2014"}, {"Title": "Lemon", "Author": "Lori P.", "ReviewID": "R1CJ91YU7U9EMP", "Overall": "1.0", "Content": "I sent the tablet back. The battery would not stay charged. It had a static noise all the time and everything was in Chinese and I couldn't change the language. It was a lemon!!!", "Date": "December 25, 2013"}, {"Title": "Good Products", "Author": "Chris C.", "ReviewID": "R277I7C5YX8MK", "Overall": "5.0", "Content": "My friend recommend the tablet, the told me it is very good product, fast and easy play, I check the description is great.", "Date": "November 20, 2013"}, {"Title": "Not what I expected", "Author": "Trisha harrison", "ReviewID": "R2BTQMOO8VT92M", "Overall": "2.0", "Content": "I find this tablet has Very poor picture quality. The max volume is not loud at all, we have yo strain to hear it.", "Date": "April 9, 2014"}, {"Title": "Not happy", "Author": "butterflyliz", "ReviewID": "R2JZ1DQ95KOLBM", "Overall": "2.0", "Content": "It arrived on time. Well that's good.  For a week. It worked fine.  But the charging. Doesn't work anymore after a week. I plug it.  And it won't charge. You can only charge it. Thru the USB. When at a computer. And unfortunately  I don't have a PC.  So. This tablet. Is a good tablet. But mine came with a defective. Charging port. And. Customer service wants. You to explain  that like a 100 times.  Oh. I also. Tried.  Another charger. From. The same tablet. My daughter has.  It won't charge. And it loose.", "Date": "March 15, 2014"}, {"Title": "Nice product", "Author": "Marlene Bates", "ReviewID": "R259B6A3U7VNG7", "Overall": "4.0", "Content": "I purchased this tablet for my 10yr old grandson. He is very pleased with it. He can do everything on it that Ican do on my much more expensive Samsung. Well worth the price! I recommend this product, you won't be disappointed.", "Date": "March 13, 2014"}, {"Title": "SVP Tablet", "Author": "Susan Fasano", "ReviewID": "R30C731BVQ63C9", "Overall": "4.0", "Content": "I like the fact that you can use this anywhere you go.  Like to watch movies on it while I work.", "Date": "February 3, 2014"}, {"Title": "broken Christmas, broken childs heart,", "Author": "Charles Bradshaw jr", "ReviewID": "R1W5ZK5FMB23OI", "Overall": "1.0", "Content": "It was not replaced! Amazon should have sent me another tablet.  I spent $90. This was a rip off deal. People shop local for your electronic goods.  that way it would not be a issue. You still have my money.", "Date": "January 20, 2014"}], "ProductInfo": {"Price": "$169.99", "Features": "CPU: AT7021 Cortex A7 1.3GHZ ANDROID 4.1\nGravity: 360 degree gravity induction\nStorage Device: 8GB, Memory: 512MB,Support external TF card, maximum capacity of 32GB\nLCD: Size 9\", TFT LCD The capacitive touch screen 5 points\nBattery: 3.7V/3800mA rechargable battery,stand-by time: 5-10H,By Wifi about 3-5H", "Name": "SVP® 9 inch Tablet , Android 4.0, Dual Camera,8GB Internal Memory,Google Play Store, Capacitive Touchscreen", "ImgURL": "http://ecx.images-amazon.com/images/I/51rrIs9vt2L._SX300_.jpg", "ProductID": "B00ENRPNPI"}}