{"Reviews": [{"Author": "Amazon Customer", "ReviewID": "R2YE8X6L668GCE", "Overall": "1.0", "Content": "I wish I can rate this a ZERO, but since one is next to zero I had to rate this a one even though the tablets I had received deserved a zero. I had made this purchase as my first tablet. First one was DOA!! The second one had 83% charge and I thought okay this is good now I will just charge it for 4 hrs and use it. Well I did do just that and like the first one I tried to get Google to be my home page and it wouldn't.. no matter what I tried to do it just wouldn't stay.. it would go back to the original Homepage. At least my mom's tablet (RCA) let her get to choose which homepage she wanted and it stayed. I so badly wanted to let this be the tablet I was going to own because I did like it for one reason or another but then BOTH had a bluish to purplish tint to it and the color just seemed off. The first tablet looked like someone had previously used it because when I got it.. it says that the battery was on for 14 days. The second tablet....  I let it charged while the tablet was off or so I thought (I had turned it off) and and took it off the charger.. I didn't use it at all until the next day. When I turned it on Thinking I will have a full charge since it hadn't been used or turned on for 24 hrs... The battery was down at 29%. SERIOUSLY??  So I ended up sending both back and am going to spend a few extra bucks and get me another one of a different brand.The one thing I did like about it.. it was fast and easy to use for a first time tablet buyer. Just had bad luck I guess", "Title": "Not once BUT TWICE!", "Date": "May 26, 2014"}, {"Author": "Miss T", "ReviewID": "R3JW0WC4P0HFC6", "Overall": "2.0", "Content": "I do not like this tablet at all. The directions on how to use it is not made clear at all. I love pictures and the picture quality is terrible in this tablet. It does not take good pictures at all and you have to jump through hoops to locate the pictures you take. It looks nice but is not what it seems to be. Not a good buy!", "Title": "TERRIBLE FOR PICTURES", "Date": "May 16, 2014"}, {"Author": "Tanner Szanto", "ReviewID": "R2KIRH0GIJ0OEJ", "Overall": "3.0", "Content": "This is a decent little tablet for the price, however for me the viewing angle was too small and when held vertically each eye saw a different color which hurt to look at.  If you only plan to use it horizontally for movies and the like, go for it.The usb port eliminates the need for an otg adapter, but the tablet doesn't seem capable of connecting with midi controllers.On the positive, the seller does take pride in making sure you are satisfied with your tablet and will offer assistance if you aren't, so it's worth trying this buddy out.", "Title": "so so and so", "Date": "April 13, 2014"}, {"Author": "SHIFAN WANG", "ReviewID": "R31BIO9ETQQDQI", "Overall": "5.0", "Content": "First of all,it was shipped to me very quickly, just arrived in 2 days.Google play app market is installed and works well.Decent battery life, it could last at least 5 hours on video playback.Applications are pretty responsive, never feel any freezesWifi signal is pretty good throughout the house, much better than my Iphone.1 speaker in the back,audio quality is pretty loud. Flash player actually works.There is the standard USB port,can connect to  USB keyboard or USB driver directly.Attached keyboard case fits well. Two cameras, has a flashlight with its back camera.This is a very nice tablet, for this price. I would definitely recommend it.", "Title": "Very fast tablet", "Date": "April 6, 2014"}, {"Author": "linda brinker", "ReviewID": "R3OD80DOMGP4FC", "Overall": "4.0", "Content": "Works great.  The wifi is quick and everything is easy to use.  Only problem i had was the screen protecter scratched after only a day.  Would recommend this for sure!", "Title": "great for the price!", "Date": "March 15, 2014"}, {"Author": "Fernando Nogueira", "ReviewID": "RTW7M2A9OSFNR", "Overall": "3.0", "Content": "Good for the price paid,Battery lasts about 5 hours of use in videos and browsing the Web.The screen could have a better quality.Sometimes is necessary to restart to resume normal functionality.", "Title": "Good for the price.", "Date": "March 15, 2014"}, {"Author": "Shirley MacKenzie", "ReviewID": "R3KSTKH8STZ7DW", "Overall": "1.0", "Content": "Even though I have related experience on IPAD, two kindles and many computers, it has been difficult to use.  The instruction manual is such tiny print that I cannot read it even with readers and a magnifying glass.To be fair, I really have not put the effort into it I should.  After looking at it, I have tucked it away and just now have recharged it so I can look at it again.  AllI did attempt to search for an easier manual but was unsuccessful.  I will try again.a", "Title": "Difficult", "Date": "April 23, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00EB8JPTY", "Features": null, "ImgURL": null, "Name": null}}