{"Reviews": [{"Author": "Mike Williams", "ReviewID": "R3SFNL9TYSHIPP", "Overall": "3.0", "Content": "We purchased 3 of these for Christmas and while we had some issues right off the bat, they are currently working well and if they continue to hold up as they performed today (first full day of use) I will consider them an excellent buy in spite of the work I had to do to set them up.Pros:Speed:  This tablet has an immediate response to touch, which seems to be rare in the world of cheap tablets.  Apps play at normal speeds (important, especially for kids).Apps: The box says that the tablet has access to Google Play store which is vital.  However, while this is eventually true, it requires a bit of work.  I'll get to that in the Cons section.  Once you do have your Google Play access, the sky is the limit with apps.Looks:  Has the look of a nice tablet, not a toy. My kids were impressed,Camera: Does have a dual camera which does not seem to be the norm for tablets in this price range.Wireless: Easy set up, quick response.Cons:Customer Service: The first Con was that of the 3 tablets we bought, only 2 would even boot up.  The third got to the first screen with the Polaroid logo and a spinning wheel and just stayed there.  I left it running, thinking maybe it just needed extra time to boot and 4 hours later it was still stuck on that screen.  The tablets came with a customer service number and a plea to not return them to the store but to call the number to resolve problems.  I called the number and was on hold for 1 hour, having never talked to a human being in all that time, before I hung up.  You are taking a risk buying the S7, as customer service appears to be non-existent.App Store/Google Play update:  The tablet does not come with immediate access to Google Play as the wording on the box would have you believe, (table would be virtually worthless without this access).  You don't know this until you open the box and are greeted by a flyer that informs you of this fact and gives a website where you download an update to your computer and then load it to your tablet.  Sounds easy enough, right?  The download was problematic, as it continued to give me a \"drivers failed to load\" warning.  If you are not fairly savvy with computers and downloads, don't bother with this tablet.  I was never able to get the update to load in the standard manner, but when it failed, the program prompted me with instructions to force an upload and this worked on the 2 tablets that were booting up properly.  On the third tablet that wouldn't even boot, the update actually fixed the problem, (I had to force a full factory reset and update) and it booted and has worked well since.Cheap feel:  I'm not sure how to explain this one other than that the buttons feel like they won't last a long time.  The power button especially.  I'll update this review as time passes, but the power button will be hit thousands of times on this thing, and it doesn't give me a lot of confidence that it'll hold up.Bottom line:  Buyer beware!  This thing is a great tablet when it's working, but it took some work to get to that point, and from other reviews it sounds like they are getting returned in droves.  All 3 of mine got their first full day of heavy use by children, and survived.  If they continue to function at the level they have so far, they will have been an excellent buy (we got them for $65/each).  If you choose the S7, go into it knowing you have some footwork to do, and that you'll be doing it on your own.", "Title": "Good performance so far but requires update for Google Play store.  Customer service non-existent Buyer beware.", "Date": "December 31, 2013"}, {"Author": "blackebob", "ReviewID": "RTZQ57COCCSQV", "Overall": "5.0", "Content": "We picked these up tor the kids for Christmas on a cyber Monday sale. They have been on them all day. The S7's we got were the 4.2 IOS, and wifi was a snap. It found our router, and we entered the key code. Online seconds later. Every app they downloaded has worked. I could not be happier with our purchase. I can hardly tell the difference between them and our Nexus True 4GB memory is not that much, but when you pay what we did for these, the external memory upgrade is well worth it. I cant speak about the problems others have had on here with S7's, but I can only assume we got the most current version, both of them work great! I plugged in my mini hdmi charger cord to see if it would charge it in addition to the round plug charger it came with and it charges that way as well, which means the car chargers will work which had me worried. Overall very impressed.", "Title": "Great presents for tablet hogging teens!", "Date": "December 25, 2013"}, {"Author": "steve pinon", "ReviewID": "R3KDX6TMF6W6DQ", "Overall": "2.0", "Content": "I expected from the information that it would have google play on it. But could not use it for that reason.  Called manufacture and they tried to help but in the end it would not download the app. that I was buying it for.", "Title": "Nice tablet but if need apps from google play , I would not suggest it.", "Date": "November 28, 2013"}, {"Author": "sol", "ReviewID": "R3KCNGVZLIOS6X", "Overall": "5.0", "Content": "this Tablet is great in my eyes, Im really happy with the internet speed and the sensitivity of the touch. so far so good, great price ether, and compact. using it for business. its great.", "Title": "Love it!", "Date": "February 8, 2014"}, {"Author": "LegendaryGoulet", "ReviewID": "R3SFFZHSUR9ZZK", "Overall": "4.0", "Content": "Great tablet I love it it's a little slow but when it gets going it's the best tablet I have owned.", "Title": "Good tablet", "Date": "May 16, 2014"}, {"Author": "Hanna", "ReviewID": "R1A34VGCDWIPDK", "Overall": "5.0", "Content": "I had before a different android tablet, it broke and i decided for this great price i will buy this one - im not disappointing Its fast the touch is vary sharp and vary compact, I would recommend this better then others", "Title": "Great Tablet", "Date": "February 6, 2014"}, {"Author": "Bill Ginal", "ReviewID": "R2TGK6K844BCXQ", "Overall": "1.0", "Content": "I purchased 3 Polaroid S7 tablets as part of a black Friday special and all 3 had problems. One of them I couldn't get to turn on at all  even after charging for 8 hours. One of them only worked for about 1 hour before turning itself off and only stayed when I held the power button down, and the third tablet worked fine for 1 day before deciding it was no longer going to go on the internet, which made it completely useless. When I checked the manual and box for a customer service line and there was nothing. I ended up getting the customer service number for Polaroid off of gethuman.com. When I called the first time I selected option four which is the extension for internet tablets. Upon selecting option 4 I got a recording stating that Polaroid doesn't actually manufacture their own tablets and cannot offer support on any of their tablets, even though they all have Polaroid on the box. The recording then referred me  to a 877 number that only gave a busy signal, not even a recording. That was not satisfactory so I called Polaroid again but did not select the tablet option. This time I actually got through to a person who was less helpful than the recording from my previous call. He referred me to the same bogus 877 number. When I explained that this number was off the hook he told me to contact the manufacturer directly, which apparently isn't Polaroid even though it says Polaroid on the box  and on the tablet. I asked CSR for a customer service number for the manufacturer, he did not have one and basically told me to look it up myself. I finally decided to take all the tablets back to the store where I purchased them. When I did the nice gentleman working told me that almost every single Polaroid S7 tablet they had in stock along with the dozens they special ordered for their customers after selling out, had all been returned with similar issues, and as a result of this fiasco, they are no longer going to sell Polaroid tablets of any model. If only one of the tablets I purchased was faulty I could live with that, but to go0 for 3 is absolutely ridiculous. Stay far away from this one, especially considering Polaroid won't even stand behind it.", "Title": "DO NOT BUY THIS TABLET!!!", "Date": "December 26, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00EECQY3C", "Features": null, "ImgURL": null, "Name": null}}