{"Reviews": [{"Author": "Meister Coolfresh", "ReviewID": "R2EQ9TGVWQ6HNB", "Overall": "5.0", "Content": "Do not fall for other sellers on amazon selling Afunta Q88. I got scammed. The unit I got from Onebook US is the best. The one I got from Afunta-mall was not Q88. It was garbage. If you really want this awesome tablet google A23 android 4.2.2 tablet.The one I love is:build number q88 4.2.2model number q88ALL OTHER AFUNTA Q88 on AMAZON ARE GARBAGE.I got lucky and scored one from Onebook USStay away from Afunta-mallremember google A23 android 4.2.2 tablet", "Title": "Awesome. Super fast", "Date": "April 26, 2014"}, {"Author": "Math Man", "ReviewID": "RNAUID09E7W0V", "Overall": "4.0", "Content": "Great for handling my music, my videos, and my ebooks. Not fabulous for serious web browsing but gives me the weather and other things I need when I am out and about or traveling. Easier than packing a sony walkman or a paperback book (anyone out there remember them, I mean other than from history classes) One suggestion, consider buying a supplementary battery pack to plug into it.  they are cheep and it keeps you going longer.", "Title": "Handy little entertainment center.", "Date": "May 26, 2014"}, {"Author": "liliana", "ReviewID": "R30YVNN7Q2WUWC", "Overall": "2.0", "Content": "battery dies to soon and take forever to charge, also it takes to long to turn on I hope I could have got something better", "Title": "It kinda sucks", "Date": "April 16, 2014"}, {"Author": "Jason", "ReviewID": "R3JM3XVV4MXM4R", "Overall": "4.0", "Content": "I got the for Christmas. I use it for school and as a multimedia device. I wish the battery life was longer but its worth the money. some apps run slow and the camera is only .3 but in overall its great. better than a children's tablet from toys r us.", "Title": "Worth it!", "Date": "January 22, 2014"}, {"Author": "avery", "ReviewID": "R1VHC0D3GN2AKC", "Overall": "1.0", "Content": "Not fast at all....locks up and has trouble starting when powering on.Bought it for my dad to view pictures with......", "Title": "7 tablet...", "Date": "December 31, 2013"}, {"Author": "Shaun", "ReviewID": "R1JW0GNZ8ZY7WO", "Overall": "4.0", "Content": "Great buy for the money.  Great for kids.  Just wish the volume was louder and the clarity was clearer.  Great buy tho.", "Title": "great buy", "Date": "October 28, 2013"}], "ProductInfo": {"Price": "$98.00", "ProductID": "B00E8CGC2Q", "Features": "CPU: Infotmic Dual Core A5\n7 inch Capacitive Touchscreen Screen 800*480\nOperating System: Android 4.1\nBuilt-in RAM :DDR3 512MB / Built-in Flash: 4GB", "ImgURL": "http://ecx.images-amazon.com/images/I/41Vm32YqnXL._SX300_.jpg", "Name": "Afunta Q88 III 7 Inch Tablet Pc Dual Core Dual Camera Android 4.1 Capacitive Touch Screen 512m RAM 4gb ROM Support Wifi (Black)"}}