{"Reviews": [{"Title": "great service", "Author": "christina", "ReviewID": "RXBWKAMDTJ2WY", "Overall": "5.0", "Content": "The original tablet I ordered got ruined in the weather on its way to me. I got an email apologizing for it happening and was asked if I wanted another sent to me or my money back. I was very pleased with the politeness in the email and of course asked for another to be sent. I was told 15 days and got it in 10. Am very pleased with thetablet. It is perfect for my daughter. Ty.", "Date": "April 16, 2014"}, {"Title": "great but no movies", "Author": "Deerodwal", "ReviewID": "R1X0NPLC8MICB8", "Overall": "4.0", "Content": "I love the features and the games along with being able to download android apps. However, we're really bummed that my kids cant watch netflix or google play movies. That was the main reason we got it. No matter. That is the only downfall. Aside from that that games that come pre programed are great. And you can download more apps", "Date": "April 4, 2014"}, {"Title": "pretty great tablet", "Author": "sheila king", "ReviewID": "R39UZNE0EQJ9OB", "Overall": "4.0", "Content": "We had to restart it 3 times when we first got it because it wouldn't load properly. Since then, we haven't had any problems!", "Date": "March 31, 2014"}, {"Title": "Great product", "Author": "cynt", "ReviewID": "R36PVLPO4PC32L", "Overall": "5.0", "Content": "I bought this one for my granddaughter and she is enjoying it every day.  She call me to say Gammie I love you.", "Date": "March 28, 2014"}, {"Title": "i will be ordering more of my stuf at amazion now i love this to shop at home at amarzon", "Author": "Madelyn", "ReviewID": "R2CZNF9XWLUUTM", "Overall": "5.0", "Content": "my little girls love it there are very happy and my little boy see soo happy with his we will be shopping more with you", "Date": "March 27, 2014"}, {"Title": "faulty", "Author": "Isaac Williams", "ReviewID": "R1JJ2FP2R0DL2C", "Overall": "2.0", "Content": "one of the tablet did not work and it cost to much to re-ship to you so i did not bother sending it back", "Date": "March 4, 2014"}, {"Title": "beware", "Author": "eddie richardson", "ReviewID": "RWBG29Y8UEU97", "Overall": "1.0", "Content": "do not buy if one child sets password and another trys to many times to guess the password the tablet locks up and then you have to send it back to the manufacturer.  i called amazon and they gave me a phone number that does not exist.  i have to pay to send it back to the manufacturer and see if i get it back.", "Date": "April 1, 2014"}, {"Title": "Terrible battery life, slow and not responsive enough", "Author": "C. C. De Lara", "ReviewID": "R3O1HVF9G2UFL7", "Overall": "1.0", "Content": "If you want a tablet for your kids and don't want them to stay using it for longer than 1.5-2 hours, then this is the one. The battery will not last longer than 2 hour. The pink frame is made out of the same hard plastic of the tablet, is not made of rubber, so no protection if it drops. This seller marks the item as hazard material so you will not get automatic return slip. You will have to pay the $20 shipping to China and then expect to see if you will get your money back..... He offer me partial refund of $25 and I took it, just to don't deal with the hassle of having to pay shipping and wait to see if when the tablet arrives he was really going to refund my money. I know many things get stuck in China custom,  he could always argue that he didn't receive the tablet back and might not refund anything!", "Date": "December 13, 2013"}, {"Title": "Great for Younger Children", "Author": "Tianna Peterson", "ReviewID": "R3ISSBQP2M4FW8", "Overall": "4.0", "Content": "My children are 3 and 7. I was tired of my Kindle HD always disappearing so my Husband and I decided to get the girls their own Tablets for Christmas. These Tablets are no where near the quality of a Kindle however for younger children that like to play the games, read and do puzzles this Tablet works just fine. Also we are not going tobe as devastated if they manage to break it.Decent Tablet for a first time young user.", "Date": "February 5, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EB8JYFY"}}