{"Reviews": [{"Title": "Wow...", "Author": "robincharly", "ReviewID": "R35XFQEWN4BXL2", "Overall": "5.0", "Content": "I love my tablet. Im in college and my computer is so big and bulk, so i bought the tablet because its light weight. Its great for looking stuff up for school. It goes everywhere with me.", "Date": "October 22, 2013"}, {"Title": "Afunta Android Tablet", "Author": "Mrskaye", "ReviewID": "R2LGLJMKZLXJ36", "Overall": "2.0", "Content": "I purchased this Afunta Android Tablet from the Weize company in Hong Kong, which was my first mistake.I didn't realize that it was coming from Hong Kong until it was to late.It took a month and 6 days before i received it.That in itself disturb me, but again my fault.It was delivered in the time they specified,but I would have ordered from a US base company had i been paying attention.The tablet is not the tablet i ordered (Afunta)just and android tablet.I want you to know this is my second review on this product.This review comes after two weeks of use.I am upset about it not being what I ordered.The tablet even though it's not the one i ordered works fine the only issue with it is the battery life and to me that's a big issue,because you can't get through anything without having to charge it up.It has a nice bright screen,which i turned down the brightness looking for more battery time.It's not happening.It surfs good and it's not slow at all,downloads apps well,connects to internet well.The charger that came with this tablet blew when taking out of plug socket.I found another around the house.My biggest issue is the battery life,and sending me wrong tablet same processor and all,but i wanted the looks as well.This Afunta has a better look than the regular android tablet.I have learn from this experience.I will always make sure that what I purchase comes from a US base company.When you purchase something who wants to wait a month and 6 days before you get it.Oh after i place my ordered i guess being the last one left at the time they switch over to SVP tablet. The one I have doesn't even have a name how about that.The box only says android and there's nothing on the tablet itself.Battery life that i get is 21/2 hours so far.They need to do better with the battery and the charger..They seem to misrepresent their product.Charger looks and feel cheap.I know it was a low cost for this tablet,but still could have had a better charger.", "Date": "October 19, 2013"}, {"Title": "Great Price, Great Tablet!", "Author": "Michael Keller", "ReviewID": "R3CJ5ZXDELPO7F", "Overall": "5.0", "Content": "Got this tablet for my granddaughter. Wanted a larger screen to watch netflix on.  Had a couple 7 inch tablets I had bought before but this tablet out performed them.  It has a faster processor (ran very smooth) and great screen resolution, with 8 gig of memoryI had plenty of room to download games for her.  It was delivered early and right out of the package started up with battery charge. I have encountered no problems or glitches. The only bad thing I could report was I wish the speakers were a little louder but I bought a tablet stand with speaker enhancement now can hear netflix great. 5 stars worked out so well I'm buying 3 more for my other grandchildren for Christmas.  Great Price, Great Tablet!", "Date": "December 12, 2013"}, {"Title": "Totally pleased", "Author": "KIM PAUL", "ReviewID": "R1X2WRR8Q2CHT0", "Overall": "5.0", "Content": "Brought this tablet for my sister this is her first tablet an she loves it , the delivery was quick order it an it arrived within 3days time ,so far so good works great downloaded apps well works well with the WiFi at home no problems yet still waiting to see how things work out . The only thing for me is the charger is heating a little to much will have to check for a new one but overall nice tablet for the price will encourage anyone to purchase  .", "Date": "November 29, 2013"}, {"Title": "Good for 1st time android users!", "Author": "Mark Kjornes", "ReviewID": "RTH23VO78RT5B", "Overall": "4.0", "Content": "This android is very good for the price. Large screen with nice picture. Easy to learn and great for the basic app nacesities.", "Date": "October 6, 2013"}, {"Title": "Great for older folk, as I am.(not great, but older)", "Author": "david keys", "ReviewID": "RT6FRWQ9XT56X", "Overall": "4.0", "Content": "It's a very fine product, good size and easy use for the over 50 crowd. I'm just getting into it,but am pleased with it thus far.An accompanying bit of information about the basic ways to get around in it would be most useful, as many of it's users won't be as adept as the newer generation.", "Date": "September 24, 2013"}, {"Title": "cant believe it", "Author": "fernando torres", "ReviewID": "R12X0KVMSGC3XL", "Overall": "1.0", "Content": "Very cheap product. I know I get what I played for but I mean come on. I turned it on and it froze right away", "Date": "February 18, 2014"}, {"Title": "very well", "Author": "Yohen Mendoza", "ReviewID": "R2YIK2QDR9Y8S0", "Overall": "4.0", "Content": "Everything arrived as expected, without fail, a day as he said, good price, serious and responsible in all cases recommend!.", "Date": "November 25, 2013"}, {"Title": "Afunta 9-Inch Google Android 4.0 512MB/8GB Tablet PC Dual Camera MID", "Author": "pat", "ReviewID": "R28BUGX0JKKSLH", "Overall": "5.0", "Content": "I bought this for my husband so he could do his paperwork for his job, so right away while it was still fresh he loves this tablet.", "Date": "November 4, 2013"}, {"Title": "Nice device", "Author": "Dataeagle", "ReviewID": "RLNRS1O0B3LVK", "Overall": "5.0", "Content": "Exactly what I was looking for.  I haven't tested full battery life yet, but works for what I needed in my life.", "Date": "October 8, 2013"}, {"Title": "Great Tablet", "Author": "Penny S. Workinger \"headangel1\"", "ReviewID": "R7GTWQTJR7SH3", "Overall": "5.0", "Content": "this is a great item It replaced the tablet that my nine year old got water on and killed it", "Date": "December 4, 2013"}, {"Title": "review of afunda 9 inch tablet", "Author": "judy", "ReviewID": "R356LOD3W7KHXH", "Overall": "2.0", "Content": "didn't have Skype, videos were awful to watch and hear. there was no Netflix. the tablet seemed just difficult to use.it just wasn't what it said it was. You get what you paid for. My son has a Galaxy that's great. But he paid a lot more. I don.t recommend this tablet.", "Date": "September 25, 2013"}, {"Title": "did love it", "Author": "Johnny Walker Jr.", "ReviewID": "R3HVPQTBQEBPQF", "Overall": "2.0", "Content": "a game was on the tablet when I got it, was playing it then it froze up. I charged it, the green light is on, full charge but will not turn on or light up, nothing! I dislike like it because even with my pen or finger the touch screen wont let my click on small items. I recommend this to no one untill I hear a response back from the seller.", "Date": "January 25, 2014"}, {"Title": "bad", "Author": "yaya", "ReviewID": "R1DC6NA3EZO70R", "Overall": "1.0", "Content": "i dont recommend it felt so cheap for the price, go to wal mart and buy one for $50 bucks its better quality", "Date": "December 2, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00E9TMZL0"}}