{"Reviews": [{"Title": "Not User Friendly", "Author": "Daniel I. Rabun \"Journey Dude\"", "ReviewID": "R1LZZ95OY1PMV2", "Overall": "2.0", "Content": "Very hard to work with. I finally had to get a professional IT guy to assist me with it. His advice was to return it.", "Date": "December 13, 2013"}, {"Title": "CHEAP - YOU GET WHAT YOU PAY FOR!!", "Author": "USO 314", "ReviewID": "RMTFQ3DM2DD6R", "Overall": "1.0", "Content": "ok. The operating system is ok. you cannot put parental locks or setup multiple users. I bought this for my 12 year old son so having an administrator on the comutr would be a must. Also, the screen resolution is HORRIBLE!!!! if i had known the true quality and limited capabilities of the Polaroid - i would not have purchased it!! lastly, the camera - you would think that POLAROID would have a decent camera on the tablet - not the case. there are much better products out there for the money - DO NOT WASTE YOUR TIME!!!! OR MONEY ON THIS ITEM!!!", "Date": "December 11, 2013"}, {"Title": "very dissappointing", "Author": "gracie", "ReviewID": "R34F1VOD3VJSXF", "Overall": "1.0", "Content": "This tablet worked okay the first three days only. The power button does not function properly. Sometimes I get no internet connection. Almost always it disconnects me when I am in the middle of typing or browsing! It rotates screen without even touching or holding it. Switches me from one website to another. Has many malfunctions. It gives me so much stress I can't bear the thought of dealing with th return!!!  So much for a happy new year. It SUCKS, don't buy it. I really was excited when I ordered but so depressed now and unhappy with it.", "Date": "January 1, 2014"}, {"Title": "You get what you pay for..", "Author": "Tim", "ReviewID": "R1FXHZ7704LRY0", "Overall": "1.0", "Content": "I was warned...I thought they would work ok, for my use. I ordered two units, one would not boot up right out of the box. The other would \"lock up\" during use. I sent them both back 4 weeks ago, and am still waiting for results.", "Date": "January 26, 2014"}, {"Title": "DO NOT BUY!", "Author": "William Johnson", "ReviewID": "R1YSOKFUZDBCRN", "Overall": "1.0", "Content": "Purchased it because of the price,just needed something  for e- books and checking e-mails.Have high speed internet and the tablet was still extremely slow and the screen is non-responsive 30% of the time.Ended up buying a different one.....the polaroid is now in the trash...", "Date": "April 24, 2014"}, {"Title": "why i return the tablet", "Author": "jaime sanchez", "ReviewID": "R3VRZFYRXCMNGF", "Overall": "3.0", "Content": "The tablet was good till one morning you could hear something but can't see nothing when the tablet worked i think is a good tablet", "Date": "April 2, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "High Resolution 10.1\" Capacitive Multi-Touch Color Display (1024x600); Front & Rear Cameras; Wireless Internet Connection (Wi-Fi)\n1GB DDR3 RAM; 8GB Internal Memory\nOperating System: Android 4.0 (Ice Cream Sandwich); Processor: 1.0Ghz Cortex A8\nBuilt-in Stereo Speakers & Microphone; Micro SD Card Slot (External Memory); HDMI output (HDMI cable not supplied)\nPre loaded with facebook and twitter; PC and mac compatible.", "Name": "Polaroid PMID1000 Android 10.1-inch Capacitive Multi-Touch Color Display Tablet w/ Dual Cameras 8GB Internal Memory WiFi Built-In Stereo Speakers and Microphone (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/510VKhU7AIL._SX300_.jpg", "ProductID": "B00EMJNIFO"}}