{"Reviews": [{"Title": "Satisfied, so far", "Author": "glasscapt", "ReviewID": "R5WE69KNQ2FWK", "Overall": "4.0", "Content": "The price is right, and the product performs as advertised.  I'm not experienced with smartphones or tablets; only computers.  My learning curve was greater than most users, but I managed to stumble through getting the tablet/phone up and running within a couple of days.  First evening was spent charging the device's battery so that it would power on.  Then the next step was figuring out how to gently pry the back/cap off to insert the sim card; and then learning that I had to reboot so that the device recognized the sim card.  After that, it was just learning how to use all the interfaces.  It picked up my Wi-Fi signal with no problem.  The down side here...  no real user manual, either printed or online, the reason for the 4 stars instead of 5.  It comes with a tiny, 14 page 'manual' with only the bare basics, and the illustrations are illegible, (blacked out).  Fortunately, the seller sent a card with his email address and he very quickly responded to my queries, and helped to get me going.  I'm also very happy that they sent along a good leather case.  I love the big screen, big keyboard, and not having to use a stylus to slide around, or for the typing.  If this device will last, I'll consider myself to be very lucky to have found this tablet/phone.  These are early days... but time will tell.  Right now, I'm very satisfied.  I'm considering buying a second one in several months, for another user.", "Date": "October 31, 2013"}], "ProductInfo": {"Price": "$119.99", "Features": "Goldengulf is Professional seller, Quality and service are guaranteed, Each item is tested and wrapped very well before shipment\nDual Sim Card, Dual Camera, Dual Core, Anroid 4.1, Fast Speed\n100% new, unused, unopened in original retail hard box\nGPS, Youtube, Facebook......\nIncluding a Leather cover and led Keychain", "Name": "Goldengulf-2014 Newest 7 inch Dual Core 3G Dual Sim Phone Call Tablet, Android 4.1 4GB, GPS, Facebook, Youtube", "ImgURL": "http://ecx.images-amazon.com/images/I/41ZRQBAqfpL._SX300_.jpg", "ProductID": "B00EQ5GCR0"}}