{"Reviews": [{"Title": "This thing is awesome!!!", "Author": "S. Manda", "ReviewID": "RMUGB2PJIS1ZR", "Overall": "5.0", "Content": "The person who rated this thing a 1 star needs a serious reality check.  I'd like to emphasize that this thing gets 5 stars because it is WATER RESISTANT!  This product makes the perfect second tablet for use in the shower or hot tub.  If you expect a water resistant high performance quad core trillion terabyte machine for 90 bucks then you need to wake up.  This is America and Amazon is awesome, but it isn't some liberal fantasyland where everybody just gets what they want for free.Most of us are dweebs who waste our time in the shower doing mundane things like shampoo our hair.  I would highly recommend purchasing this product alongside the PadTab ($15 on Amazon).  In no time, you will be using Spotify, Netflix, Facebook, Snapchat, or Skype while checking your emails all in the comfort of your shower.This tablet is not the most fast or responsive and that is likely due to the water resistant coating or slower processor.  However, unless you're writing your senior thesis in the shower or hot tub, I think this device works awesome.  It is as water resistant as they said it is.  I've been using it daily in the shower for almost a month and it has been splashed with water several times and handled it like Michael Phelps.  The battery lasts over a week before I have to take it out of the shower to charge.If you are purchasing this to be your primary device to use in both wet and dry environments, you will not be happy.If you purchase this as a secondary device to use in a shower or hot tub, the only downside is the increase in your water bill.", "Date": "January 4, 2014"}, {"Title": "I can not in good conscience recommend this product to anyone.", "Author": "Brenda K. Skipper", "ReviewID": "RKPI0JMOBQ2V0", "Overall": "1.0", "Content": "If ever a product deserved 0 stars this one is it, too bad I can't give it that. I bought 2 of these in July to give as Christmas gifts to my 12 year old son and 19 year old daughter. Bad decision on my part, I will never buy a gift that early again. Now I can't even return it to get them a better tablet. I didn't expect a lot from this but I did expect what was advertised. It is advertised as a 4 gig tablet, try 1 gig after all the \"system\" files that are preloaded and undeletable. It says it can take a 32 gig micro sd card for additional space. I thought that would work well, not so much. You can not move any apps to it, none! They have put a few games on them and now get an out of space message and nothing moves over to the micro sd card that I bought them for the extra space. On top of the out of space message these tablets are poor performing, they are unresponsive most of the time. If you do not want to download any apps, and don't mind the unresponsiveness maybe you will like this tablet. I can't think of many people who buy a tablet and don't have intentions of downloading any apps to it.", "Date": "January 1, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EPY0IA4"}}