{"Reviews": [{"Title": "Great little tablet", "Author": "HCTS", "ReviewID": "RMPY8GPMS1PU6", "Overall": "3.0", "Content": "This is a great little tablet, but the battery life is about two hours and that's it. I bought it for business credit card service as our elderly customers were unable to sign on a smart phone. The screen is sharp and crisp, but it's that darn battery that is the problem,", "Date": "January 20, 2014"}, {"Title": "Not a good tablet", "Author": "tony h.", "ReviewID": "RKE0BD1NUA1QN", "Overall": "1.0", "Content": "The price says it all its very cheap I didn't like it from the moment I started using it so I bought a  better one anyway my kids play with it a little they dropped it not that hard but it just flung open all the wires everything what a joke the battery last a half hour at the most.", "Date": "March 20, 2014"}, {"Title": "This is an awful product you should avoid at all costs.", "Author": "Jon Byswinger", "ReviewID": "R3V96SUZG7S2W6", "Overall": "1.0", "Content": "From the moment I openned the package and turned it on, this tablet has been buggy, slow and crash-prone. Internet browsing was frustrating. Snapchat is non-functional. Apps crash at random.In total, I may have used this tablet two days since owning it-- for over 2 months, now. I became so frustrated with the crashes and slowness that I just stopped using it. I stopped bothering to charge it. Speaking of which....The battery life is ridiculously bad. I can't imagine using this for many media applications beyond casual games like Angry Birds. Forget music or a tv show (I haven't tried loading a show on it--- it's so bad at everything else, I wouldn't want to waste the hours trying to set it up).Bottom line: you get what you pay for. And this is definitely not a product you should pay for.", "Date": "March 10, 2014"}, {"Title": "Good for the budget minded", "Author": "timpclimber", "ReviewID": "RK6N2W4EM6RER", "Overall": "4.0", "Content": "Well built, easy to up and use if you buy one with a key board case.  Love it church with a scripture and bible dictionary app.  As a teacher allows me to prepare power point presentations and carry to meeting to take notes.  for $60.00 hard to beat.", "Date": "February 14, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "TeSoar® 7\" 8GB Black Tablet PC Allwinner A13 Processor Google Android 4.0 Multi-touch Capacitive Screen TF/MiniSD Card Supported 1.3M Front Camera MID Wifi", "ImgURL": "http://ecx.images-amazon.com/images/I/41D17wLvdIL._SY300_.jpg", "ProductID": "B00FYF0I5I"}}