{"Reviews": [{"Title": "Great tablet and you can't beat the price.", "Author": "KirkCameronSlayer", "ReviewID": "R3J78J1G8DIFBZ", "Overall": "5.0", "Content": "This is a great tablet, and you can't beat the price. I've never heard of \"Megafeis\" until I bought this tablet for my wife. I have to say I'm very impressed with their product. This is just as good as any other tablet on the market.", "Date": "November 28, 2013"}, {"Title": "Over all good", "Author": "Christy Rose", "ReviewID": "RSAFSH1V3AYWU", "Overall": "5.0", "Content": "I bought this tablet for my work out in the field. I have to say it does on. Battery last about 4 hours. I would buy another one soon. Only down side was the shipping time.", "Date": "December 25, 2013"}, {"Title": "Perfect for kids", "Author": "Victoria Vassilious", "ReviewID": "R22PDRKWTZ0A56", "Overall": "5.0", "Content": "I think for the price it is great for what it does.My daughter is able to download tons of games/apps and play to her hearts content. she also watches movies from netflix. it is perfect, i was nervous at first because i have never heard of this name, but it works just as good as my kindle fireno risk if she breaks it because it is not expensive like an ipad!", "Date": "December 30, 2013"}, {"Title": "Megafeis is Great!", "Author": "D. Hamer", "ReviewID": "R2ZVKAH7HX0C1I", "Overall": "5.0", "Content": "Can't beat this tablet for the price. Works and functions just as well as my Dell Streak 7. Highly recommend!", "Date": "January 27, 2014"}, {"Title": "tablet", "Author": "susan alvarez", "ReviewID": "RUEDFPJY0IAQK", "Overall": "5.0", "Content": "Great tablet for the price. Perfect for my son! He loves it. Could have paid more elsewhere for the same thing, worth the wait for shipping.", "Date": "January 16, 2014"}, {"Title": "android tablet", "Author": "ala guy", "ReviewID": "R2KVD4KJDGKA0D", "Overall": "1.0", "Content": "This product is not what title says. It is not a 4.2. It is only 4.0. Read description before buying..... Thank you.Concerned fraud locator.", "Date": "December 14, 2013"}, {"Title": "reasonable", "Author": "Arnoldas", "ReviewID": "R9COZ2ETU19JT", "Overall": "5.0", "Content": "The price and item quality is reasonable. Item is solid. It would be better that chineese words wuoldnt appear o a back but other than that- ok.", "Date": "December 19, 2013"}, {"Title": "Best deal this Christmas!", "Author": "Michael Robert Slezak", "ReviewID": "RD5Q9PL3Y3UL9", "Overall": "5.0", "Content": "My wife absolutely loved this gift from me and Santa! My daughter helped her get connected with out Wi-Fi and she was off and running.  She loved the flexibility and the size.  I got her some additional items to support the unit and created a complete tabet experience for her.  I scores huge 'good boy' points with this one!", "Date": "December 30, 2013"}, {"Title": "good tablet", "Author": "gurinderjit", "ReviewID": "RU8JGV5HN9GH4", "Overall": "5.0", "Content": "good tablet and fast and good for the price.but there is a problem that is not a big deal sometimes.and that little problem is it sometimes freezes.", "Date": "April 27, 2014"}, {"Title": "Great deal!", "Author": "Sam Denton", "ReviewID": "R2HINKPJWX7FW1", "Overall": "5.0", "Content": "This tablet is great for children and young adults.  Functional enough for them to use many popular programs on and to use the camera and video function for projects they enjoy.  Games and information can be accessed easily.  Good deal for the price.", "Date": "April 25, 2014"}, {"Title": "The megafeis tablet", "Author": "Shannon Clairmont", "ReviewID": "R299QLF4DZ5TRH", "Overall": "5.0", "Content": "This tablet was very affordable and met my needs perfectly. It is very user friendly. I am not technology savvy and I was worried about utilizing all the functions but I had no problem navigating the tablet.", "Date": "March 24, 2014"}, {"Title": "good and well worth every penny", "Author": "megan", "ReviewID": "R2N08DCMPNVKNL", "Overall": "4.0", "Content": "it has its quirks, like every now and then it won't recognize any apps that are installed (rebooting is an easy fix), or it takes forever to boot up, but beyond that, it was well worth every penny spent on it.", "Date": "March 15, 2014"}, {"Title": "she loved it", "Author": "sandy", "ReviewID": "R3D5SBONPDDEEJ", "Overall": "5.0", "Content": "bought this for a birth day gift for my daughter and she lovesshe was upset because she didn'tget one for Christmas", "Date": "March 15, 2014"}, {"Title": "Mom Loves!!!", "Author": "LilyEsk", "ReviewID": "R5SFSYEA0ICJR", "Overall": "5.0", "Content": "I got this for my mother for Christmas, she really loves and it thought that I spent a lot more on it than I did. She is happy to have something light that she can skype with.", "Date": "January 30, 2014"}, {"Title": ":-)", "Author": "Kenishia Richardson", "ReviewID": "R3L8F7FTCNQXCZ", "Overall": "4.0", "Content": "Great for price.however, the speakers are a lil low and freezes daily. I also think something is wrong with the adobe reader. Other than thst great :-)", "Date": "January 24, 2014"}, {"Title": "First Tablet for me", "Author": "Cillie", "ReviewID": "R1ZI626V88UJYK", "Overall": "4.0", "Content": "Being this is my first tablet, I went inexpensive to see if I would like it or not. It's a bit slow, but hey, so am I. SMILE....The price was definitely right. The only trouble I had was that it had preloaded MSN and Google and they were in Chinese, so took awhile to get the icons and English language sites on it. Also no manual, though Youtube has some learning videos on this tablet. If you are looking for inexpensive, simple tasks like Facebook, browsing and email, this is worth that money. The front camera on it is fun to play with to.", "Date": "January 13, 2014"}, {"Title": "great tablet", "Author": "leo", "ReviewID": "R2ICP45R0O2W1W", "Overall": "5.0", "Content": "it s great! and for that price .amazing!, it s fast, clear screen , battery last, fast charging, i m very happy", "Date": "December 26, 2013"}, {"Title": "mediocr", "Author": "john haman", "ReviewID": "R2A4G2SASMBQ62", "Overall": "2.0", "Content": "Device is really slow responding.  Battery life is poor as well.  Maybe OK for use for short intervals.  Thank you", "Date": "December 12, 2013"}, {"Title": "Died in less than a month!", "Author": "Marji", "ReviewID": "R1G8SP2T5WK98A", "Overall": "1.0", "Content": "I wouldn't recommend this product to anyone.  I got it cheap, (gift for my son) but it died in less than a month.  VERY disappointing!  BUT, on a  GOOD note, I DID receive quick and thorough customer service via email.  I received a new, slightly upgraded tablet - from M700 to M700P, in just a few days and SO FAR have no problems with it.  But I'm not holding my breath.  Sorry Megafeis, but I would not recommend this tablet to anyone for any use ... \"you get what you pay for\".", "Date": "January 28, 2014"}, {"Title": "3 stars for the tablet but five for the seller", "Author": "L. Thornhill", "ReviewID": "R18IGHFZQJ6MU1", "Overall": "3.0", "Content": "I ordered this tablet in hopes of doing a few basic things: playing Netflix on the run, browsing a few websites occasionally, playing a few games in my spare time, jotting down a few stray stories and tapping into my nook and overdrive library accounts for casual reading. I did not expect the tablet to replace a computer.Unfortunately the tablet I received was an Android 4.0 system not the 4.2 described. It was a bit slow and I could play every video app I tried except Netflix. I was more than disappointed that the tablet didn't live up to my expectations considering I didn't expect iPad or Samsung quality for the price I paid.I will say that I had no trouble with the games I downloaded from Google's Play system.I came back here and read other reports of disappointment. Sure, the tablet didn't cost much but everyone here wants the tablet to at least work so I contacted the seller. I received a response back almost immediately. The seller apologized and promised me a M700 Plus tablet from the warehouse in the U.S. The new tablet arrived before he promised. It is Android 4.1 (an upgrade that is significant enough for my needs) and it's not slow or clunky. All the apps work brilliantly including Netflix and I noticed things like word suggestion that was broken on the M700 is perfect on the M700 Plus. I would give the M700 Plus tablet 4.7 stars easily. I would advise people check that tablet out instead of this one.", "Date": "January 23, 2014"}, {"Title": "Don't buy!", "Author": "Amazon Customer", "ReviewID": "R3V5GAQEOAWK7D", "Overall": "1.0", "Content": "Works sometimes! Lines trough it like is has been dropped. Foreign language when start up. Don't recommend to anyone. Waste if money.", "Date": "December 31, 2013"}, {"Title": "Sent back", "Author": "Lea", "ReviewID": "R10N77YW36D51M", "Overall": "1.0", "Content": "Nothing on the box was English for one thing and I ordered it by accident.  I don't need it now", "Date": "December 31, 2013"}, {"Title": "Garbage", "Author": "Jacqueline Milligan", "ReviewID": "R3449JW1P5ZO2Y", "Overall": "1.0", "Content": "Piece of *****. Got one for my Mom fr Christmas. It was missing parts. Took forever to get the part I needed, thing doesn't work worth a darn. Don't waste you're money!! Worst decision I ever made was to buy this thing.", "Date": "March 30, 2014"}, {"Title": "slow", "Author": "Nichole", "ReviewID": "R1DBLQT30OE6K2", "Overall": "2.0", "Content": "It is slow to react when touching the screen. It freezes up when my kids are playing games, which is why I bought the tablet.", "Date": "December 31, 2013"}, {"Title": "It isn't an Android 4.2 its an Android 4.04 icecream", "Author": "Katelyn", "ReviewID": "R8IFZ2FLJFD62", "Overall": "3.0", "Content": "Its not bad if you are looking for something cheap and easy to use. Its not a bad product it just wasn't exactly what I thought it would be. The battery life is kinda sad it lasts about 4 hours. looking back I would probably still buy it, I just want to warn people that its not all its made out to sound like.", "Date": "January 8, 2014"}, {"Title": "It's Okay for a tablet", "Author": "Julie Loeffler", "ReviewID": "R2HW0MYUQ5XF01", "Overall": "3.0", "Content": "You can't beat the price for this, however, I would have gladly paid a little more once I realized it was missing some important features. It has a camera, but no back lens to allow you to see the pic before you take it. Secondly, the touch screen is a little too sensitive and frustrating when using it. Lesson learned on shopping for another tablet.", "Date": "March 28, 2014"}, {"Title": "Worst Tablet Ever!!", "Author": "Jamie Martinez", "ReviewID": "R2WBZ7MJQWDUX2", "Overall": "1.0", "Content": "I had got this tablet for my daughter it is horrible! Apps dont download and if you try to download one it freezes the hole tablet and you have to reset everything then try and find you way around the settings because it resets to chineese.. Worst tablet ever!!", "Date": "February 24, 2014"}, {"Title": "wait before you buy", "Author": "julie spears", "ReviewID": "RDOVKB3V9FZ8F", "Overall": "2.0", "Content": "Nice features but it lasted two weeks.  On off button broke and it cost as much to fix it as to buy a new one", "Date": "February 12, 2014"}, {"Title": "cheap", "Author": "pamela e comadoll", "ReviewID": "RU7DRMU63JCX4", "Overall": "2.0", "Content": "Speakers faded to no sound. Didn't return because it came from out of the USA. Was not worth the postage to return.", "Date": "February 8, 2014"}, {"Title": "Less than what I expected", "Author": "Norman Schall", "ReviewID": "RZ2MLD3H1908", "Overall": "2.0", "Content": "Did not come with power supply.Came with usb cable that was NOT compatible.Instructions were on a single sheet of paper in barely legible fine print.", "Date": "January 29, 2014"}, {"Title": "Not bad", "Author": "lee", "ReviewID": "R2IP3ILVXEOA4R", "Overall": "1.0", "Content": "Good u it nit what about a cover for it customer service For this product is good and I'm pretty happy With", "Date": "January 15, 2014"}, {"Title": "good product", "Author": "warrner Radcliffe", "ReviewID": "R248R4FJKDZGRN", "Overall": "3.0", "Content": "it is what i thought it would be, a little slow but functions ok, and has done what i needed it to do.", "Date": "January 7, 2014"}, {"Title": "Hope you have a wonderful holiday and new year best of wishes", "Author": "john mccloud", "ReviewID": "R1PAUIF7MFDQX", "Overall": "5.0", "Content": "Thank you and they are great and thank you hope you have a wonderful holiday and new year .... thank you", "Date": "December 11, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00FGI5WX6"}}