{"Reviews": [{"Author": "Patrick", "ReviewID": "R29BKXR3CI0IDU", "Overall": "5.0", "Content": "This tablet exceeds my expectations, and every day I find new ways to integrate it into my personal and professional life.  The different functions I can find to use it for astonish me.  I've used it to take,  transcribe,  and post meeting minutes (the pen works great in drawing mode,  but text recognition isn't quite fast enough to use while in the meeting,  I go over them at leisure later).  I have about a zillion books on it, reference and otherwise (does just fine as a reader).  Plays movies and Internet videos with beautiful quality - if the source video is not so great,  you notice it, but HD source is rendered perfectly.  The extras that Samsung threw in to sweeten the deal are nice to have.  I have bigger hands than most, and find it easy to use and manipulate- smaller hands might find it a little unwieldy to hold while using the on-screen keyboard. Also,  carrying it one handed must be done with care, as I've almost slung it discus style a couple of times- I really recommend getting a holder for it. It's nice and light, the battery goes on (figuratively) forever- I use it all day,  and charge it at night.  Can't do that with my phone.  It does LOVE to be hooked to the Internet, tho it functions fine when out of range.  A lot of the built in apps and email functionality will just cease, but books, movies, and music loaded onto the thing work fine. They just pick back up where they left or when you're back in range.  In closing, I'll leave you with this:  I've gotten a digital only subscription to my local news paper with this thing, I read it every day, and it lets me do the cross word puzzle (that took some thought,  but I figured out how! ).  I hadn't read the news in a decade before I got this thing.  I'm writing this review on it now.  One other thought- heavy media hoarders will want to get the 32 gigabyte model, or plan on spending for a SD card.  The \"bloat-ware\" that comes with it does take up quite a chunk of space.", "Title": "Oh, my Lord,  I love this thing!!!", "Date": "May 12, 2014"}, {"Author": "Ray Shiva", "ReviewID": "R3KGFSUCAO8MGP", "Overall": "5.0", "Content": "I had an older generation of the Samsung tablet and then decided to upgrade to this new one. It is really worth it. One thing that I had to \"fix\" was that the tablet will not play flash animation. This is fixed by implementing the work around which is easily found by googling the issue on the internet. It involves downloading a browser called Dolphin and also installing a specific version of Adobe Flash. It took me about 10 minutes to implement the work around and since then all is good.", "Title": "Love it!", "Date": "May 7, 2014"}, {"Author": "theMountinman", "ReviewID": "RLNYJH7CC6CI0", "Overall": "5.0", "Content": "You know how you can see something new and intriguing online, investigate it, really build up your expectations about it, only to have them come crashing down when the actual product is in your hands?This is NOT that case (for me)!I became interested in the Note 10.1 back when it first came out, because I was really drawn to the incorporation of the Spen (no pun intended). But the poor screen resolution and the lag issues reported made me reconsider. I decided to wait for the next generation. So, I was excited to see an upgrade appear late last year. It appeared to me that many of the issues I was concerned about had been addressed. So, when my birthday rolled around, I hit my wife up for the 2014 edition.It is EVERYTHING I had hoped and more.I wanted a device with a crisp and vibrant display. Check. I wanted a device that would let me take handwritten notes in my meetings and let me draw/design with decent drawing tools. Check. I wanted a device that was reasonably fast with no serious lag issues. Check. I wanted a device that would let me multitask. Check (with caveats). I wanted cool apps and utility and convenience. Check, check, check.This thing is AWESOME! I have loved it from the moment I opened, and that feeling only grows with time.When I powered it up and logged on with my google account, it automatically uploaded all most of my apps from my Galaxy S III phone. Everything was there, my contacts, my music, my cloud. It has changed how I do many of my daily activities (I have probably cut my PC and smartphone time by more than half), and, with some modest changes, I can easily see how a tablet could eliminate my need for a PC or phone at all (think tablet partnered with and voice controlled communication device the size of a dollar coin - similar to the communicators from ST Next Gen - the technology is nearly there).I'm still learning how to use all the apps and features (it takes me a while to get comfortable with new systems and apps), but I am very pleased with everything. Well, almost everything...Here are the few things I don't care for:1. I hate that the power connection is on the bottom edge of the device. This makes it awkward to use with a case in a vertical or semi-vertical position with the power connected. You basically have to flip it, which puts the power and volume controls on the bottom where they are more difficult to reach. I would have preferred a left/right side power access. I'm also concerned about the durability of that miniUSB port.2. Speaking of power, this device is a hog. A PC UPC connection will not provide enough power to keep you working continuously.  In fact, trying to recharge the Note from a PC with the display and all apps turned off is not really practical (for me, <10% an hour). If you are doing anything active (gaming, video, etc) long term (more than an hour or two), you will have to hook directly to an AC outlet. If you want to recharge in a reasonable amount of time (>%10/hr), you will need direct AC as well.3. Some Samsung app interfaces are not intuitive to me. The SNote app is a prime example. Creating, editing, and organising notes is cumbersome and different than what I'm used to with other systems. It's even different than the note app on my Samsung phone. To me, it is more difficult than it needs to be.My wife purchased this on sale at $470 (I got the 16GB version, as I don't do a lot of video and I knew I was going to add a 64GB miniSD for less than the $50 cost for the extra 16GB internal). But, I would have paid the $500 with no qualms. This is absolutely one of the best purchases I (well, my wife...) have ever made.", "Title": "EVERTHING I expected and more!", "Date": "May 3, 2014"}, {"Author": "Anslem John", "ReviewID": "R28X13JEOQERCG", "Overall": "5.0", "Content": "This is a great product and I would recomend to anyone who is looking to invest in a tablet to do work. The pen is the main seller for this device; you can write with it , Select items , and do calculations. The tablet is very fast and responsive I have had it for 6 months and has not let me down.with the right case its great for watching movies while traveling.What is also good is the KNOX feature thats like a secure are to work and store data.The only downside of this product is its cost, but it is worth it.Samsung have really raised the bar when it comes to the Tablet Industry Thank you Samsung!!", "Title": "A very good product!!", "Date": "April 1, 2014"}, {"Author": "mkostial05", "ReviewID": "RPG4PEK62S8HR", "Overall": "5.0", "Content": "I have been nothing but impressed with this tablet from the first moment that I purchased it. I am a field engineer. So, I use demanding applications on a daily basis. This tablet runs them all seamlessly with no lag whatsoever.  I will usually have three or so applications running at the same time . There is no hesitation at all. Also, this tablet has the ability to connect to up to seven blue tooth devices at the same time.  Now, I have not used that many at once. But, I have hooked up to three devices and my blue tooth speaker at the same time. It worked perfectly.  This tablet has OTG capability.  So, with the purchase of a OTG four port hub and sd card reader,  I have been able to use standard USB wireless devices, thumb drives, and SD cards simultaneously. The tablet will recognize every single one of them. The multi tasking ability of this tablet is amazing. The display is absolutely gorgeous. The speakers are surprisingly loud and very clear. To sum it up, there is no I pad that can even come close to doing what this tablet can do. Go ahead and buy it. You won't be disappointed.", "Title": "What an amazing tablet!", "Date": "March 22, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R33FFKK6EIRKYB", "Overall": "5.0", "Content": "I love my new tablet.  I buy books on here alot,  but after buying numerous electronic devices that have problems and getting nowhere.  I decided to see if Walmart or Bestbuy would price match and BestBuy does and DID!  Anyone who is scared because of defects  need not worry,  just buy one at your local BestBuy... Makes life alot easier especially after reading the One Star bad reviews...", "Title": "Best Buy.. Thanks...", "Date": "March 21, 2014"}, {"Author": "countryboy85", "ReviewID": "R29KXDC93OONN1", "Overall": "5.0", "Content": "First off, i am not an Apple guy.  I have used Android devices for many years.  I have used both Apple and Samsung and my preference is Samsung.  This has a great picture, fast processor and is plenty light for my purposes.  I am very happy I went with this product over the iPad Air.", "Title": "Exactly what I wanted and expected", "Date": "March 20, 2014"}, {"Author": "loretta remeder", "ReviewID": "R100R8UDT1N8DT", "Overall": "5.0", "Content": "I had bern shopping around for months before i decide to go with the tablet and the note was perfect for me with all the notes i take...and everyday i discover something new about it....it has a beautiful screen sound is great and the price and that what sold me it finally went on sale for under 500 dollars....this tablet is for those that want all the extra features and if thsts what you looking for than the note is definitely for you!", "Title": "love it!!!", "Date": "March 15, 2014"}, {"Author": "A. Taylor", "ReviewID": "R378VYW2ZYHM88", "Overall": "5.0", "Content": "I have had other tablets and I can honestly say this is the best I have ever used.  The HD screen is the best there is on a tablet to date. I have the 32GB version and am using a 64GB sd-card as well. This will handle anything I will thow at it. The 3GB RAM is a far cry from the 1GB in most tablets. It navigates smoothly from page to page. Being able to have multi pages on screen is a plus. Now I can email with my daughter and surf the web at the same time. Setting this to print was an easy setup, which was a much appreciated surprise. As with most Samsung products there is software that one may never use, if only you could remove it to gain the extra space. Hint, Hint... ;) Polaris 5 is a great Word compatible program that is included that makes anyone needing such a program very happy. Overall, this is extremely fast, has a beautiful display, adequate storage space especially with the extended storage of a 64GB sd-card.  The only downfall with this and any Samsung product is trying to collect the Samsung Perks promised with the purchase. This item comes with a $25.00 Google Play gift card, 2 audiobooks, free Hulu Plus airtime, as well as many others program offers. Problem is getting Samsung to send the email with the Perk code needed to collect them upon registration. I have emailed, then called with no results. I Googled to see if I was the only one experiencing this issue, but no, low and behold many many others are as well. So if you are expecting to go shopping for your favorite apps or sitting down to a good book or tv show don't hold your breath.........UPDATE:4/2/2014  A note to let the people that so kindly responded to my review know where I stand on the above Samsung Perks issue.I have contacted Samsung's customer service a total of 4 times now, still no email containing the perks code.  After the third call I was contacted by the survey department. Following a brief explanation of why I was giving Samsung such low ratings, he told me never talk to a level 1 customer service person. He said the tier goes to a level 4, ask for at least a 3. He stated the 1st level people I spoke with previously probably never escalated the issue like they said they would. Needless to say the survey did not bode well for Samsung. :(  Today I called for the 4th time. Right off I asked for a level 3 rep. She acted as if she did not hear me so I waited for her to finish the sentence she interrupted me with and asked again. She assured me she could definitely help me so after going thru all the same questions of the first 3 calls, and being put on hold 4 times, she again wanted to escalate the ticket. It was then I demanded to speak with a level 3 rep. I told her I had gone thru this 3 times before and am not doing so again. I asked why this issue was so hard to resolve? No answer. Finally she said she would transfer me if a higher level \"was available\". I was transfered to another person who refused tell me what CS level he was. He asked me all the same questions again!! He even asked me if I knew how to check my email, lol!!... I asked \"him\" why the issue has not been addressed,.... I was asked to hold again. When he returned he answered, \"they did not have the model number so they could not continue resolving the issue\". I responded that they certainly did have that info, I had provided all the info the last 3 times I had called. I then asked why they did not contact me if they needed more info to resolve it. He was dumbfounded, studdered a few times, then silence.  When he could talk, he apologized that they had not contacted me. So, here I sit waiting, once again, with the strong asuridness that all my problems will be solved within 48 hours. Still not holding my breath.....sigh.", "Title": "Best Tablet Out There!! Perks or no Perks...", "Date": "March 14, 2014"}, {"Author": "Steven Asher", "ReviewID": "R304GZKQOOS8O1", "Overall": "5.0", "Content": "An amazing tablet for the cost!!! So worth every penny. with the same specs as the pro 10.1 tab but this having the note feature on top of the 3gb ram and not just the 2 with the PRO tab ( which makes no sense considering they cost right about the same) is lighting fast!!! I freaking couldn't ask for a better tablet with the size of screen! Great job Samsung!", "Title": "Seriously!", "Date": "March 13, 2014"}, {"Author": "G. Bluitt", "ReviewID": "R300BFUCT65FI", "Overall": "4.0", "Content": "Up until recently I owned the Galaxy Note 10.1 (2012 Edition) and coming from that tablet to the 2014 Edition I have to say that Samsung has made a lot of improvements over last year's model.The device is very snappy, even snappier out of the box than my original Note 10.1 was (tested it after wiping it just before selling it). The display is a lot better than before as well. Battery life has me not needing to charge it as much, even after streaming videos all day (the previous model would last several hours but the battery would be in the red. Not the case on the 2014 model).The S-Pen functions better than before, especially with the Air Commands and multiple windows.I did not give it 5 stars because of a few quirks ..Settings menu - It is in a tabbed view, similar to the Galaxy S4 and it cannot be changed (the Note 3 has the same menu but it can be changed to a traditional list view).Button Placement - While I am used to the Home Button and capacitive menu and back buttons on my phone, I was not used to them on this tablet. I had to get used to them being in the same spot and not changing when switching the tablet from landscape to portrait. The tablet design is the same as the Galaxy Tab 3 line (this is good to remember when ordering accessories, as the cases for the Tab 3 10.1 will fit the Note 10.1 2014), so if you have one of those tablets, then you should be OK with the button placement.Overall, the speed, display, S-Pen functionality and battery life are a marked improvement over the 2012 model, the software and button placement you will have to get used to. Beyond those quirks, it is a quality tablet.Finally, as for the price, it is higher than the previous model, but I was paying $600 for the Motorola Xoom nearly 3 years ago so the price doesn't bother me really. But for anyone wanting the 32GB model, I would definitely take that into consideration before buying.", "Title": "Decent Tablet and a worthy successor to previous model", "Date": "October 17, 2013"}, {"Author": "verygoodsushi", "ReviewID": "RVW6XXC9YDWWA", "Overall": "5.0", "Content": "I have this tablet now for about a week and it is absolutely fantastic. I runs smooth and I love the freedom Android gives you...especially when it comes to multimedia codec support! The display is just stunning with vivid colors. The battery life is alright but there I must that the iPad is better...but then again the Ipad just a bigger battery.All in all I am more then happy with this tablet and I definitely would recommend it to anyone!", "Title": "As good or better then an Ipad", "Date": "October 17, 2013"}, {"Author": "Smalba", "ReviewID": "R16I0U3APSWFR4", "Overall": "5.0", "Content": "If you're familiar with the note series, you're going to be in love with the note 10.1 2014. This thing is fast and awesome.  The new design is great, it's thinner and weighs less.  I'm loving it.", "Title": "Best tablet out there.", "Date": "October 17, 2013"}, {"Author": "tz", "ReviewID": "R130M78NGPPFR5", "Overall": "4.0", "Content": "(updated 1x, at bottom)I got a refurbished version through a recent Woot! and I'm impressed with the speed, functionality, quality, usability.  The only sensor it is missing is barometric pressure, but the GPS (using GLONASS and QZSS) has no problems.It has one major flaw.  My last and sometimes current tablet is a Toshiba Thrive.  While watching an HD stream it will charge in an hour, but it has a laptop style charger - it also has swappable batteries.The Samsung can only charge at 2.1a, which means over 4 hours to get the 8Ah back to full WHEN IT IS OFF.  When it is running, e.g. using Google Maps to navigate with other things in the background, it will at best breakeven or slowly go down.  This is without \"powersave\", but even with it on, charging is glacial.There were some very pleasant surprises.  First is a hard app/home button, and offscreen menu and back buttons (which I accidentally press when holding it at times, aargh, but I think I can get used to it).  On my Thrive and other devices where this is \"soft\", when things bog down, whatever system that reads the screen/touch needs to do its thing to detect it.  The home hard button always works.The digitizer pen is nice.  Even things like typing just work better.  At least for me, touch will never be precise, so it is nice to have this when I need it.  The place where it is absolutely vital is selecting text for cut-paste.  I have never been able to move the cursors - they always disappear or select the wrong thing.  With the pen, no problem at all.I'm annoyed that to use a bluetooth keyboard, I have to switch back to the Samsung keyboard (I prefer Hacker's keyboard).The Browser works and manages to get a zoom-to-select right.  I wish it had more junk filters though (maybe a local privoxy type app?).I haven't tried all the facial recognition scrolling, pausing, etc. but may explore that, and some of the more advanced apps later.The brightness can be made both bright - and as importantly dark enough for any time of day or night.There's more but I will need to continue exploring.  Again, my only real complaint is the charge rate, especially when I'm using the tablet.Update: Pleasant surprise - it uses bluetooth headsets (my EtyBlu2 or BlueParrot noise cancelling)!  So I can Skype or GrooveIP (Google Voice) or use SIP phones.  Unpleasant surprise: it won't use a bluetooth keyboard unless the original samsung onscreen keyboard is selected (so I have to keep resetting to Hacker's keyboard).  Still having problems charging - they need two USB connectors, or a special dock, or a laptop/netbook high current plugin.", "Title": "If only the battery could charge quickly...", "Date": "June 8, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2PSRWBFHB2M68", "Overall": "5.0", "Content": "I already owned the note 10,1 and first generation surface, I loved my note , but resolution while ok left me wanting better clarity, The note 10.1 2014 fills the gap I spent weeks pondering getting the new 2014, It is just so damn pricey, but I must admit it is worth it. The tablet performs great and it might need some software patches here and then, but so far, so good using the tablet.The pen works great and this is better then any ipad i had owned and offers more. Buy it and it will not dissapointed. A+++ Samsung product.Just to add one more thing Samsung changed the buttons from the first generation model. They put buttons on the bottom panel not on the screen like on the original Not 10.1. I guess it was done to make the new 2014 model smaller. For me, I do not like the change. I have to move my hands to much to hit the new buttons. I had to install button savior non root to get my on screen buttons back. Still a great tablet, but worth a mention.", "Title": "Great tablet", "Date": "May 26, 2014"}, {"Author": "N. Wolter \"photog gal\"", "ReviewID": "R3FVBJSMLJTSGD", "Overall": "5.0", "Content": "Awesome tablet! Slight learning curve, but I'm getting around the tablet fine. Google Play and perfect Chromecast usage.absolutely no video buffering!I have a Kindle Fire HDX as well, love it, but Chromecast is limited to YouTube, Netflix, Hulu. Some video buffering.", "Title": "Love this tablet!", "Date": "May 23, 2014"}, {"Author": "Matrix Mole", "ReviewID": "R2DIRHWCAQEJU0", "Overall": "5.0", "Content": "This tablet has replaced nearly all of the desktop and laptop computing within my life. I use it for streaming media from the web and my file server, reading electronic novels and comic books, along with artwork and general email and web usage. I haven't done a lot of excessive battery testing, and don't use it as heavily as others may. I've noticed that I generally have to charge it up a couple of times a day. I've had twice where the battery has ran completely dead from nearly 80% charge in the span of only an hour with almost no apps in use. Unknown what caused it, but after charging back up to full it worked fine without errors for over a week. The pen is extremely responsive, and works beautifully for artwork and jotting down quick notes. Writing or drawing on the tablet screen feels very natural.", "Title": "Great for what it is designed for", "Date": "May 23, 2014"}, {"Author": "AMT", "ReviewID": "R3JCGUZLJGPDON", "Overall": "5.0", "Content": "I am surprised that this got such mixed reviews with some people just hating it.  I love it and have not had any problems with it!  The pixel is amazing and it is incredibly fast!  Does everything it is advertised to do.  It is my \"work\" tablet which means that there are no games on it for my boys to fight over and to play on!!  I have also have  the original 10.1, which I love, to compare it to.  I'm not a techie so this is just a lay person's review.  Is there a huge difference between the first and second generation note 10.1?  Not really.  The 10.1 2014 is the original note on steroids!  Faster, more powerful and brighter!  The screen resolution is AMAZING!  Surfing the net is as fast as a desktop/laptop.  Multi-tasking is a snap and you can have multiple windows up without any lag time.  Taking notes is easily done with the stylus pen.  I bought the App 7 notes with mazec to enhance the writing recognition and it works great!  It seems to read my handwriting better than the Samusung version.If you don't have a tablet, this is the tablet to get.  If you have the original 10.1, you don't need this.  That being said, you may not need it, but you certainly will WANT it!  It has not disappointed me yet!", "Title": "LOVE, LOVE, LOVE", "Date": "May 17, 2014"}, {"Author": "Alex Zuniga", "ReviewID": "R10RI6ZQU6GNBE", "Overall": "5.0", "Content": "I originally bought the 2012 edition on amazon, after having it for a month ...It was stolen at school out of my backpack. I was very dissapointed because I really loved that tablet, very useful if you are a student, taking notes, watching videos, playing games on my free time, tuning in to netflix to catch up on some shows, it was great and it did it all. So when it was gone, it felt like my life was missing something. I had to get another one, which I did, but this time I got the 2014 edition, I have fallen in love all over again, but this time the love is bigger, the resolution on this screen is amazing 10x better then the 2012 edition, the note taking has improved too. This is a great tablet for the do it all type of person, I bought my tablet from best buy this time though to take advantage of the 0% for 18 months interest, but Amazon sells the same great tablet, I enjoy Amazon a lot, I do most of my shopping here, but best buy just had a better financing deal this time around....Great tablet!", "Title": "Wonderful tablet", "Date": "May 12, 2014"}, {"Author": "Sandeep Rao", "ReviewID": "R8XUISS7S2MK3", "Overall": "5.0", "Content": "I am a Prof.  by profession and use this device for reading and writing, most of my reading material is in pdf format and this device renders it pretty well. For note taking I use S.note and lecture notes. For reading I use repligo.", "Title": "Good for reading and writing", "Date": "May 11, 2014"}, {"Author": "Otto J Wittner", "ReviewID": "R3SAXN61O4G3S6", "Overall": "5.0", "Content": "An excellent tablet. I bought two. Both were delivered smoothly and are working fine. They are slim, light and fast compared to my older Asus TF 101 tablets. Note that the 2014 edition is smaller than earlier editions, hence take care when ordering a cover.", "Title": "Slim, light and fast", "Date": "April 2, 2014"}, {"Author": "e. reed", "ReviewID": "R1Q2YR6E5OPTRH", "Overall": "5.0", "Content": "The original Galaxy Note 10.1 is excellent and we still have it (husband got the hand me down and wife gets the new one). This 2014 edition is incredibly better. A lot of the same features but a lot faster, crisper images and overall a joy to use. This is more of a casual device for us, but looking at all the software, someone could use this as their main device - school, work, and play. Samsung is at the top of their game right and we strongly recommend any and all of their products!", "Title": "Awesome!", "Date": "March 24, 2014"}, {"Author": "Aaron Ward", "ReviewID": "R5HWFPOBC7SQ2", "Overall": "4.0", "Content": "1st venture into the tablet world.  Portability & intuitiveness is its greatest feature thus far.  More options than I'll probably ever learn to use.Only reason I didn't give 5 starts is twice it has \"locked up\".  Would not power on/off.  Found a suggestion online to press on the screen while holding down the power button for at least 15 seconds.  This did allow it to reboot.  My only concern is why?....and will it lead to long term issues?Other than that, it is the coolest, slickest device I ever purchased.  Love the online credits Samsung gave to Google Play, Hulu +, etc.", "Title": "Sweet device", "Date": "March 24, 2014"}, {"Author": "murad", "ReviewID": "R2EYWNZ50GYHOF", "Overall": "5.0", "Content": "Its awesome and better then the previous edition , easy to use more creative upgrade the S-pen functions and alot more .", "Title": "awesome", "Date": "March 23, 2014"}, {"Author": "Katt Winter", "ReviewID": "RPGSX3QZSD2I8", "Overall": "5.0", "Content": "My dream media, productivity, art, and daily driver tablet. I got such a good deal on this on pure luck.Some Cons: I had to factory reset a few times, because there was some heinous lagging. Ditched Touch Wiz for Apex, and it's so pretty. I worried item was defective. Loose charging port, and it was not described as such. Speakers should be nicer and front facing. No USB 3.0 charging like Note 3. Smart features drain battery and do not work as nicely as Samsung phones.Pros: Amazing resolution even in daylight. Strong battery life for what it does. Fast streaming. Great gaming tablet, wagon tech... make design, art, and note taking fun. Is not a restrictive IOS product. Innovation. Speedier charging than Ipad4.What I use it for: media, writing, reading, productivity, research, multitasking, games, and to quickly jot down a note via action memo. Basically it does everything, and that is why it my go to tablet. It's a bit big to be my everywhere I go buddy, but that's why I have a Note 3. Wouldn't mind 4g on it but can't rationalize the price of a 16 gig retail w let. Ouch on the normal price, Sammy. Again, I got it at a great bargain here.Registration of the product will score you many great deals as well, and I would recommend this tablet to tech artist types or to anyone who wants something for everything.", "Title": "Note 10.1", "Date": "March 23, 2014"}, {"Author": "Adam F", "ReviewID": "R6RL15845YQE4", "Overall": "5.0", "Content": "The notes app looses my notes some times even if I save them is my only complaint.  I would buy this again", "Title": "Works Great wonderful Screen!!!", "Date": "March 20, 2014"}, {"Author": "A.English", "ReviewID": "R2GZ9HZLKGK3OR", "Overall": "5.0", "Content": "It definitely serves its purpose.  I would recommend this to any of my friends looking to purchase a tablet. I even purchased another one for my mom.", "Title": "I love my Galaxy Note", "Date": "March 16, 2014"}, {"Author": "Pen Name", "ReviewID": "R19QCQTJVY5H1Y", "Overall": "5.0", "Content": "It is the best tablet ever!! Its amazing, and has awesome features!!! Love it!!!! The quality of the pictures, videos, just everything is awesome!! Plus including like $600 worth of free stuff to download!! Absolutely love it", "Title": "BUY IT!! U WONT REGRET IT!!!", "Date": "March 13, 2014"}, {"Author": "Heather Johnson", "ReviewID": "R16ME6NKPH797Q", "Overall": "5.0", "Content": "Very very happy with this tablet! I have been attaching for one to meet my needs for almost 6 months. Finally choose to go with this one and haven't regretted it not once! The only 2 things that I wish this tablet had was, 1 4g lte connection capabilities, and hdmi connection capabilities. Other then that you can't go wrong with this tablet. I love the s pen!  Works flawlessly and I can rest my hand on the screen and write with out any interference with the writing.  I have had the tablet for about a month now and I am still learning new things I can do with it. Very very happy! Samsung did it again! Thanks to Amazon warehouse prices I was able to purchase this tablet for right at $450. Great Tablet at a Excellent Price!", "Title": "excellent tablet! excellent price!", "Date": "March 12, 2014"}, {"Author": "Curt", "ReviewID": "RAHTBG4XVW458", "Overall": "5.0", "Content": "This is a highly functional, fast and flexible tablet.  I have been extremely pleased with this unit especially with the handwriting capabilities.  I take plenty of notes and i have been able to totally get rid of paper by using my tablet everywhere I go.As other posters have shared it does appear to be a bit slow straight out the box but by turning off some of the unnecessary options this tablet flies.  I have yet to find any tablet on the market that gives the highly usable functionality as this tablet with the ability to use stylus for writing and navigation, speed, minimal interference from the O/S (my unit stays on for weeks at a time without any crashes, restarts, reboots, or slow down).However, if you do not need the handwriting capability I would say get the Tab version instead of the note version and save some money.  But with very few options out their with the handwriting stylus and capabilities there is nothing that compares to this unit.By the way the screen is awesome, the colors pop and clarity is great.Samsung did a great job with this tablet!", "Title": "BEST Tablet I've Owned", "Date": "March 12, 2014"}, {"Author": "Milagros Cuellar", "ReviewID": "R1NX6517RQEU8Q", "Overall": "5.0", "Content": "I've always have A wonderful experience on amazon that's why I have been shopping on amazon for many yearsthe galaxy note is a precious Jem it's a wonderful tablet Fast gorgeous colors I also have an I pad the galaxy note 10.1 2014 16 gb has nothing to envythe ipad it's as fast and performance is as good and it has extra memory you can add.ipad doesn't I got my note 10.1 2014 edition  used on amazon warehouse dealsfor half the price I saved about 152.oo free shipping you can't beat that got it in 2 days it came like described perfect condition all power cords brochures etc in boxHappy with the note 10.1 2014 edition and amazons fast service thanks amazon", "Title": "The galaxy note 10.1 2014 edition is a great tablet", "Date": "March 9, 2014"}, {"Author": "M3", "ReviewID": "R2UJ8GRXL7DQ0Z", "Overall": "5.0", "Content": "Best Tablet I've ever owned !Samsung did a great job here. almost can get rid of my laptop.It follows me everywhere I go.", "Title": "Fantastic !", "Date": "February 6, 2014"}, {"Author": "The Sween \"Ride Like the Wind\"", "ReviewID": "R1QR5K5BC0BG5F", "Overall": "5.0", "Content": "I purchased our Samsung Galaxy Note 10.1 2014 edition from Best Buy in January 2014.  (Sorry Amazon - my laptop died and I needed a quick fix.)  I looked at the newest Amazon tablet Kindle Fire HDX 8.9\", and the screen seemed small to me as well as the text.  I'm sure I could improve the text size, but overall, the Samsung Galaxy Note felt more comfortable to drive.I own a Samsung Galaxy S4.  The tablet feels like a giant version of my phone which I really love.I haven't scratched the service of all of the features, but I wanted to post that I'm not feeling any lag or slowness.  Now I have a cable modem at home, so we have pretty fast internet service.  I haven't seen anything with this device where I feel like I'm waiting on it.  It may be that whatever operating system updates that have been implemented since its initial release have fixed any performance issues.  Or people are blaming their wireless sluggishness on the tablet.The screen is beautiful.I'll post back with any other observations, but I just wanted to comment on the main reason that I hesitated to purchase it in the first place, which were the reviews that people said that the performance wasn't there.  This is not true.", "Title": "Not slow.", "Date": "January 29, 2014"}, {"Author": "kittymom", "ReviewID": "RE8FOXUM1O419", "Overall": "5.0", "Content": "If you're a PC person, you'll mostly like it. Even an Apple person who uses an iPhone & Mac computer in my family just loves it too.There were little complaints at first but after we all got learned to how to properly use it, everyone became happy with it.I have used ipads & iphone before but I love Android so much now I don't think I am ever going back to the iOS or itunes.", "Title": "Perfect tablet", "Date": "January 29, 2014"}, {"Author": "Ramsey D.", "ReviewID": "R2LLSO08FJU7PZ", "Overall": "5.0", "Content": "THE BEST tablet I have ever had the pleasure of using. The note 10.1 2014 edition absolutely blows the rest of the competition out of the water. This thing is great. First off, the screen. This beauty sports the highest definition screen I have ever seen on any tablet. Many of the reviews complain about the lag, but I'm fairly sure Samsung updated its touchwiz launcher to rectify that. Either way, I use Action Launcher Pro, my personal favorite on any android device. Anyway, buy this tablet, you won't regret it. blows", "Title": "best tablet on the market", "Date": "January 27, 2014"}, {"Author": "Diane Glabman", "ReviewID": "R2ORU4HLW85WNT", "Overall": "5.0", "Content": "Bought this tablet after reading many reviews. Thanks to all the reviews posted. Very interesting. No regrets. Would recommend to another first timer. Definitely watch the You tube postings.", "Title": "First tablet", "Date": "January 25, 2014"}, {"Author": "Colleen Stephens", "ReviewID": "R3AP7NA54AE8V4", "Overall": "4.0", "Content": "I love the tablet, have had great success with it, no lag when multitasking. I bought it for college for note taking and it's what I was looking for -  a perfect size to see professor's powerpoint slides and type notes, yet small enough to leave enough room on the desk for my books and such. My only problem has been the horrible lack of keyboard cases for it. I bought it several weeks ago and even the store I purchased it in did not have keyboard cases for it (and still does not). The ones I've checked into online are either ugly as sin or bulky and awkward. There are some great USB keyboards I've seen in person, but they are a separate keyboard and would require purchasing a book case separately, making more to carry and manage. On Samsung's website, it does not even have a keyboard case attached with this item for us to purchase, and calls to local retailers that carry this tablet have yielded \"Sorry, we don't have any of those or have any coming.\" So I love my tablet, but am highly disappointed at the accessory support lag for it.", "Title": "Love tablet, hate keyboard case lack of options", "Date": "January 25, 2014"}, {"Author": "kk", "ReviewID": "R2OPSZTM4S8KWE", "Overall": "5.0", "Content": "I have done lot of research before getting this \"Galaxy Note 10.1 2014 edition tablet\".  and it settled for my expectations. I m using this since last 2 months and m loving this. I wanted top level tablet in all respects and I went for Galaxy line.PROs:1) Galaxy Note 10.1 2014 edition has excellent screen resolution , u wont be able to notice any small pixels on screen and picture/video are so crisp. Youtube viewing is best experience!2) Front camera is good and Skype chatting which I use a lot. Not experimented much with back camera, I use it rarely.3) Many people tell this tablet is laggy but I never experienced any lag or delay opening pages or even flipboard is fine. In real life, no one flips 10 pages in 2 seconds. So be practical while deciding if tablet is lagging or fast. I have no issues with its speed.4) Very good in multitasking and S pen, u will find many videos on explanation of these features. 3GB RAM is enough as of next 2 years.5) I am enjoying free 50GB dropbox and $25 google play store credit with this. They have also given $50 Samsung app store credit but nothing really good to purchase from there.6) Front speakers are so loud, no complaints at all.7) I play lot of games like Prince of Persia, Riptide GP2, subway surfers, temple run 2 and all doing good, no hang or frame drops.Battery life is more than expected. I get more than 10 hours of life even watching extensive videos and playing games and reading FB/Twitter.CONs:1) Truly there r no major cons related to hardware.2) Samsung has bloated this Galaxy Note 10.1 2014 edition tablet with hell lot of apps- few are from Samsung Touchwiz and few from third party. They make tablet storage heavy and android becomes dirty. I have disabled / uninstalled many built-in apps.3) Not sure when android 4.4 comes to this Galaxy Note 10.1 2014 edition.For me, Galaxy Note 10.1 2014 edition is best android tablet in 10 inches category. Anyone can pick this and enjoy all features..", "Title": "Best tablet for gaming, videos, reading", "Date": "January 24, 2014"}, {"Author": "Christopher Bailey", "ReviewID": "R1ZNUJWEEL4IGF", "Overall": "5.0", "Content": "OK, so I'm still in the Honeymoon phase but I've done a crap ton of research on this tab before I bought it. So first off let me break down the quick pros and cons (not including price)Pros:-Screen (it's amazing)-Speed (blows most everything else out of the water....right now)-Feel (It's super solid)-Best multitasking exp. on Android-S-pen isn't useless (quite the opposite)Cons:-Lag (it's Touchwiz what do you expect?)-Battery life?-Physical buttonsYou can read other reviews about the Pros. Let me tell you about the Cons. Of course I gave a 5/5 why would I talk about cons? Well, I'm going to explain how most of these issues aren't really issues if you're a power user, and lets face it this is definitely a power user device. First off, Don't use touch-wiz. I installed Nova and removed all Samsung software that I didn't need. This can be done by installing another ROM (look at xda-developers.com) or just by rooting and removing those apps. BTW root is a MUST with this tablet. I suggest installing Xposed and Gravity Box. This will allow you to setup up your Note so that it has virtual buttons in portrait but physical buttons in landscape.But what if you use your tab in landscape all the time?? follow the instructions here [URL was removed do a search for \"[MOD][GUIDE]Disable Galaxy Note 8 Capacitive Keys\" on XDA] and you'll be able to make the competitive buttons only react to the S-pen. this is very handy to make it so you can have your hand on the side without rising accidental taps. This takes care of two of the biggest cons. The third...batterylife varies depending on who you talk to. I haven't had enough time with it to say one way or the other (my tab just turned 24....hours) but I imaging under-clocking it with setCPU or something would help.", "Title": "I'm Lovin' It!!", "Date": "January 23, 2014"}, {"Author": "pcglobal", "ReviewID": "RCEUT25I8KS8N", "Overall": "5.0", "Content": "We have had our tablet for a few months and can't stop using it. It runs smooth and Android runs great. We have loaded it up with apps and games and the battery life is great. Definite buy!", "Title": "Awesome Tablet", "Date": "January 22, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R34TE0OZU0WLLJ", "Overall": "5.0", "Content": "This tablet does everything you could want from a tablet plus more.  Has helped with my research tremendously. Highly recommended", "Title": "Improved many Facets of life.", "Date": "January 22, 2014"}, {"Author": "Melody Guidry", "ReviewID": "R2SB5SJXP45NKL", "Overall": "5.0", "Content": "love it  its light and fast  just right my first tablet and its everything I expected and more  great product", "Title": "Samsung gaaxy Note 2014", "Date": "December 6, 2013"}, {"Author": "boyduffer", "ReviewID": "R3FI1T593FKT7G", "Overall": "5.0", "Content": "The Samsung Galaxy Note 10.1 2014 edition is a great product. Easy to use with great apps. The 10.1 screen is big enough for users of all ages. The cameras are an improvement over the previous editions.", "Title": "Great Tablet", "Date": "December 6, 2013"}, {"Author": "Tessa Goth", "ReviewID": "R3LACICDATEU9A", "Overall": "5.0", "Content": "Responsive,  gorgeous screen resolution,  nice battery life and a stylus that I now can't  live without.  I was able to create a nice powerpoint presentation on a train before a job interview.  It took me about 10 mins to get familiar with the program,  but after that,  was able to create 4 slides in about 30 minutes using on screen keyboard and stylus.  No laptop needed!  Still learning about all the functions this tablet has to offer but no regrets passing on an iPad.", "Title": "Loving this tablet!", "Date": "December 6, 2013"}, {"Author": "abdikarim", "ReviewID": "R3PO2XZB45HVSY", "Overall": "5.0", "Content": "There is no words to describe this. I am a fan of samsung galaxy now. I sold my ipad mini and bought this, because is worth it and I love it.", "Title": "best investment on Amazon.com", "Date": "December 4, 2013"}, {"Author": "mrskbg \"mrskbg\"", "ReviewID": "R54FHFOWL9VNP", "Overall": "5.0", "Content": "This is my first tablet so I have no prior experience to compare. Thought I wanted an I pad Air, but after reading reviews here, I thought Samsung sounded closer to what I wanted. One week and so far, I love it! Dual screens, music while I work, photos and viewing, So Beautiful! Only thing I still wish is addition of phone in this pad so I only have one complete unit to attend to. Would love to hear what others think of Samsung Galaxy Note!", "Title": "Samsung Galaxy Note", "Date": "December 4, 2013"}, {"Author": "David Bologna", "ReviewID": "R30CU3UKUQNHU1", "Overall": "5.0", "Content": "So far this is my favorite tablet and trust me I own them all. Performance is outstanding and the screen resolution is outstanding.", "Title": "Wonderful product", "Date": "December 4, 2013"}, {"Author": "robert webster", "ReviewID": "R3PN6VIXJJTH3V", "Overall": "5.0", "Content": "I think without a doubt that this is the most versatile device on the market today...hands down!  No regrets whatsoever", "Title": "Great Device!", "Date": "December 4, 2013"}, {"Author": "Darren H.", "ReviewID": "R2JNQU1P6ODMGW", "Overall": "5.0", "Content": "An excellent tablet!!  I owned a Galaxy Tab 2.0 (7 in.) for about a year and loved its functionality, but the need came for a larger screened device.  For me, the change was drastic!  A clearer, more sharper screen, faster browsing on the Internet and a much better battery,  This tablet is a gem!", "Title": "An Excellent Upgrade - Bar None!", "Date": "December 4, 2013"}, {"Author": "Richard B Harrison", "ReviewID": "R1GV53L2FSTQ1V", "Overall": "5.0", "Content": "This replaces my first gen ipad, so clear, so bright, so fast. Decided to go to android as Apple stopped updating my product 6 months after it was purchased for x-mas and I didn't want to be stuck like that again. Last year I moved to a Samsung Note 2 for my phone and have been happy with it so the switch to this 2014 tablet seemed obvious. Like the update to the s-pen which I find very handy as I can write faster than I can type.", "Title": "Love this product", "Date": "December 3, 2013"}, {"Author": "Elena Filippova", "ReviewID": "R1S5QI3SOT0GJL", "Overall": "5.0", "Content": "It's a very good tablet, without a thecnical problems. Recieved at time. I recomend it to a society of amazon.", "Title": "Very good product.", "Date": "May 26, 2014"}, {"Author": "Paul Sargeant", "ReviewID": "R6FH9ARV4BMM8", "Overall": "5.0", "Content": "Love it. Bright, brilliant screen and lightning fast. Simple set up and easy to use. Greta experience with this vendor", "Title": "Great product, delivered really quickly, excellent service", "Date": "May 23, 2014"}, {"Author": "James P. Kelaher", "ReviewID": "R26PL1V1RWO9DJ", "Overall": "5.0", "Content": "Samsung has knocked it out of the park once again! I replaced my iPad with this tablet and like it a whole lot more.", "Title": "Great tablet", "Date": "May 23, 2014"}, {"Author": "Jose Alejo", "ReviewID": "R3CMK9TD0DV2ZA", "Overall": "5.0", "Content": "I say for the moments because is new, just 2 days using :) i had before a Xoom Tablet from Motorola, this my first experience with Samsung Tablet. I liked so much, but i wish native upgrades.", "Title": "For the moments GREAT", "Date": "May 22, 2014"}, {"Author": "marian", "ReviewID": "R1RKNSI9SHFEXG", "Overall": "5.0", "Content": "i purchased this Tablet because i already had the Galaxy Tab 10.1. I'm glad i did buy it the picture is so much clearer and loading programs and surfing the web is so much faster.", "Title": "Love it!!!!!!", "Date": "May 20, 2014"}, {"Author": "Alice", "ReviewID": "RLHTHLKEBTUSB", "Overall": "5.0", "Content": "This Samsung Galaxy Note 10.1 2014 Edition is freakin awesome, and works great.  If you are looking for an Android Tablet this size and don't mind the price then look no further.  Samsung is one of the best electronics companies out there today and they stand behind their products as well.  This tablet is easy to customize and run flawlessly.  I own several Samsung products including TV's, Phones, and now a great tablet.  Honestly I prefer Samsung over any other manufacturer at this time.  I have no issues with any of their products that I own..", "Title": "Best Tablet Available today!!", "Date": "March 5, 2014"}, {"Author": "Paul", "ReviewID": "R3KYPFFGA1JX6", "Overall": "5.0", "Content": "great product! easy to use, the colors are so vivid and it is so easy to navigate.  I would recommend this product", "Title": "love it", "Date": "March 5, 2014"}, {"Author": "A Gottschald", "ReviewID": "R2Z168G2RLVTL2", "Overall": "5.0", "Content": "Better than an ipad, wonderful display lots of free apps streams movies and music from my home network. Great for email or browsing the web while there are repeats on the TV.", "Title": "Really Nice", "Date": "March 3, 2014"}, {"Author": "Rayman", "ReviewID": "R2GH84VFNRMZOK", "Overall": "5.0", "Content": "Mind blowing. Puts the i-pad to shame. Well worth the money. It's flawless. Samsung is way ahead of he game with this one", "Title": "You can't go wrong", "Date": "March 2, 2014"}, {"Author": "SA1969 \"SDA&AAN;\"", "ReviewID": "R1OGY5B8RHX87L", "Overall": "5.0", "Content": "bought tablet right befor the price jump so its met all of our expectations the screen is crystal clear .", "Title": "great tablet", "Date": "March 1, 2014"}, {"Author": "golan hadar", "ReviewID": "RKRZFA9QXESAZ", "Overall": "5.0", "Content": "arrived quickly and well sealed. i have it for 3 weeks. the s-pen is a useful feature for notes and adding remarks on pictures. the screen resolution is awesome and also the face smart detection works great.however, if you dont need or like stylus, not sure if this tablet is more recommended than tje google nexus 10.", "Title": "great tablet", "Date": "January 3, 2014"}, {"Author": "Nishant Sangar", "ReviewID": "R3OXVAII7RFHCC", "Overall": "4.0", "Content": "The tablet is excellent to use, has very good screen and is fast. It came with Android 4.3 pre - installed which was not common when I bought it. The reasons I have deducted 1 star are :1. Price (which are very high,  but still lower than iPad)2. Screen is little hard to read under sunlight.3. Sometimes the tablet goes to sleep even when you are working on the tab. The frequency is less and hence it is not annoying (yet).The stylus has been a major reason for me choosing this tablet and I have been very impressed by it. Samsung has given lot of tools for using this stylus but they get confusing sometimes. Overall I have no regret using this tablet and would recommend it to anybody who is neutral towards iOS or Android.", "Title": "A very potent tablet for working class!", "Date": "January 3, 2014"}, {"Author": "sameer somu", "ReviewID": "RZ5A7Q9VRZWZH", "Overall": "5.0", "Content": "This tablet is very good and performed well past my expectations from a tablet made by samsung. Having owned every galaxy series smartphone from samsung (S-SIV), i was expecting some initial problems and bugs like lag and build quality. I previously was an ipad person, having owned an ipad 2 and 4. felt limited by the ecosystem and bought my first android tablet (Note 10.1 2014). I was impressed with the out of box performance of this device. Even with all of the preliminary bloat running on this device, it was very smooth and ready to go. Rooting was not necessary to unlock acceptable performance (as i have done with my samsung phones). after a few days of disabling certain services and installing all of my apps, i was surprised at its build quality (for being made of polycarbonate) and robustness. No issues whatsoever. Screen is just amazing. the LCD display is incredible and the resolution is very complimentary of the LCD display. A few weeks of usage and i found myself using this more than i used my iPad 4. S pen is very convenient for making dimensions while building things, drawing symbols and taking notes. I knew i made the right choice by buying this over the iPad Air.Pros:-Speed-Screen-S pen (probably one of the best features)-expandable sd-buildCons:-speakers a bit dull?-lockscreen wake up lag (maybe by 1-2 seconds)-couldve had a micro hdmi slot (for a $550 tablet these days, should be standard)-shouldve made hardware buttons since portrait orientation of home button and capacitive buttons is kinda awkwardI would definately recommend this to anyone looking to buy a tablet. Although no tablet can truly substitute for a laptop or desktop (don't count those complicated and useless windows tablets), this one definitely takes several steps closer.", "Title": "Best Tablet of 2013 consideration", "Date": "January 2, 2014"}, {"Author": "Alecia Hinds", "ReviewID": "R2IETV3P7OHTJD", "Overall": "5.0", "Content": "I love it! So many features that I'm yet to discover.  Bought the 32 GB for 549 during black Friday sale and had it brought out to me in Jamaica.  I must say I'm not disappointed it's an amazing product. I just need to take the time to familiarize myself with all it has to offer.  I bought it for school which was to start this month but has been postponed till March so I have a little time to get used to it before school since I'm still working. But thus far 5 stars!", "Title": "Great product", "Date": "January 2, 2014"}, {"Author": "Debbie Hill", "ReviewID": "RNSI3UGU0X56I", "Overall": "5.0", "Content": "I am having a great time learning to use the Note 10.1.  It works great but there is a lot to learn.  I have a Kindle but it just wasn't that good for the Internet usages.  This is so much better with great possibilities.", "Title": "so far so good", "Date": "January 2, 2014"}, {"Author": "melissa allen", "ReviewID": "R1VUS07Z2LS9JZ", "Overall": "5.0", "Content": "This tablet is amazing. I'm using it to write the review. It's very functional.  It has great features! Fast shipping it actually camea day early!  I definitely recommend.", "Title": "PERFECT", "Date": "December 31, 2013"}, {"Author": "Lilian", "ReviewID": "R24L4FG58JI7AY", "Overall": "5.0", "Content": "I like the function provided and the way it works. I also like the design and look. I would recommend it to my friends.", "Title": "i like it very much!", "Date": "December 31, 2013"}, {"Author": "A. Roberts", "ReviewID": "R1SNZH7FM6NVKS", "Overall": "5.0", "Content": "I got this for my husbands Christmas gift and he really seems to love it. Have not had a problem with it yet.", "Title": "Great Tablet", "Date": "December 31, 2013"}, {"Author": "Nikki", "ReviewID": "RLXSWUQYVVK2E", "Overall": "5.0", "Content": "I'm so happy I chose this over the iPad Air.  The features are amazing and I have not been disappointed yet.", "Title": "Love it!", "Date": "December 30, 2013"}, {"Author": "Martha Skeen", "ReviewID": "RZKOUPQMOQC6M", "Overall": "5.0", "Content": "The only negative I have is that the battery life drains rather quickly, the description makes it sound like you have quite awhile to go between charges.", "Title": "Love my Galaxy Note!!!", "Date": "December 30, 2013"}, {"Author": "texas momo", "ReviewID": "R2IC879TO7BIRF", "Overall": "5.0", "Content": "Granddaughter who is a interior design student at Texas State loves it....!It will be very helpful to her at college.", "Title": "It is great", "Date": "December 30, 2013"}, {"Author": "Jane Fite", "ReviewID": "R1II1EGG8NS2K8", "Overall": "5.0", "Content": "This tablet is excellent. The display is incredible. And I was very surprised by the quality of the sound. Netflix shows/movies sound great. The S Pen is very nice and combined with the S Note app, it works great. I did notice the speaker grills are a little loose. Other than that, tablet is excellent. I should add that I don't run the touchwiz interface. I downloaded Nova laucher (free one) on Play store. This made a huge difference in speed. I highly recommend doing that.", "Title": "awesome tablet", "Date": "December 30, 2013"}, {"Author": "RST10", "ReviewID": "R2ASTF3RSUSE4R", "Overall": "4.0", "Content": "I've tried a LOT of tablets over the years trying to find the right tablet for me. I've either returned them all or traded them in on another. iPads, Androids, Samsung Galaxy's, Lenovos, even HP Touchpads. Not to mention Microsoft Slate RT, and more. So far, I tend to have loved the latest Nexus 7 and iPad Mini.This tablet is stylus focused, and with Samsung add ons in software, makes it less desirable to me as compared to vanilla Android (Google edition with no added bloatware). That being said, if you haven't had a Nexus device, this is a powerful device with a lot of productivity apps and productivity apps built in. If you're really looking to replace a laptop or do more things than tablets are typically considered for, this is a power tablet that may fit some needs for you. I wouldn't recommend it for the average consumer.HardwareThe look, feel, design and finish of this tablet are superb. The back has a leather \"feel\" and texture to help you keep grip. It's thin and fairly light. The screen is bright enough and quite high quality-- I wouldn't put it up there with the Fire HDX's, or maybe not even Retina, but it's very nice.It is Samsung, so it tends to be \"buttony\" around the edges. Spots for memory cards, a stylus, volume and screen brightness, a \"home\" type button, a right click button and so on. This is part of the \"nerdy\". Things that do mar the style and svelte simplicity, but at the gain of some functionality not used by all, but by some. If you are in that \"some\" you will care about these features.SoftwareUpon turning the device on, I was forced into more than one update sequentially. This was disruptive as I first started my journey with the tablet, but after reading some other reviews, it fixed some pretty significant issues so all for the better. The OS is quick and snappy. Very little lag.Next is my biggest pain point: The threshold between Android and Samsung software. I feel like Samsung has overdone that and went a bit too much customized. I am almost always a strong proponent for vanilla Android, and given that this one is intended to be \"note\" it has some additional functionality and applications that take advantage of a stylus. All of that software is usable, but I feel like the over-presence of apps that go beyond the \"note\" focus and outside/beyond that added value on top of Android is where I get annoyed: A side bar that gets in the way, and some other functions that I don't find useful and more often than not feel like are in the way.I spent some time on the tablet, and took it to a friend who has had Kindles and iPads and does prefer a stylus to a finger. She spent a lot of time on it, gleefully enjoying some features, and in the end said: Is it half the price of an iPad? If so, I might be interested.\" The conversation ended there.So, I give it 4 stars because I like it and I don't think Samsung has done a bad job with this kit. I don't like how much they've intruded with their own software, unnecessarily to present a tablet as a note, some additional features beyond stock android. It feels distracting.In conclusion, if you are strongly demanding a stylus and software that can accommodate it, this is probably the right tablet for you. If you are just generally in the tablet market, and aren't sure what you want/need, this tablet is probably not for you. If you are the nerdy type and want memory card slots, the ability to install non-OEM software around an app store and prefer not iOS or stock andriod, this tablet might be for you.As for me, I am going to continue banging on this thing. If I discover more that I like or don't, I will update the review again later.In a nutshell, unless you have a specific need or reason for a specific brand or model because of an off-the-beaten path feature or function, the best experience for me has been to stay on the road most traveled and go with an iPad, a Kindle Fire, or a vanilla Android (Google edition) tablet. You get the simplest least cluttered experience, have the best track record of constant frequent software updates and the best app availability.My conclusion on this tablet is the same.", "Title": "A deeper take on tablet.", "Date": "December 27, 2013"}, {"Author": "Tony", "ReviewID": "RNVBR02NLZGOF", "Overall": "4.0", "Content": "The tablets works good, it is light and thin. Can use s-pen, finger, or both at the same time. The change of line's width and change color is good for taking notes.", "Title": "Like how it works.", "Date": "December 26, 2013"}, {"Author": "KJ", "ReviewID": "RKJFCO5HP29O3", "Overall": "5.0", "Content": "Love my Samsung Note 2014 edition- easy to read, navigate, with vivid colors and I enjoy the Samsung quality product.", "Title": "Love the Note 2014", "Date": "December 26, 2013"}, {"Author": "blahblahblah", "ReviewID": "R3R8E7FZB68UFQ", "Overall": "3.0", "Content": "Build quality is great, not the best but it's better that what I expected. But the light bleed is horrible. Nexus 10 is infamous for light bleed issues but this one is actually worse, much worse. Usually I could live with minor light bleeds since LCDs rarely come with absolutely free of light bleed. But the one I received has light bleeds so terrible that is beyond my tolerance. I am going to exchange it and see if the next one any better.", "Title": "horrible light bleed...", "Date": "December 2, 2013"}, {"Author": "S. Curcio \"Gator Bay Outdoors\"", "ReviewID": "R1OHFMF5SZW8TU", "Overall": "2.0", "Content": "I have had this tablet for about a week and trying to decide if I want to keep it. There are nice things about it and not so nice, too. The screen is very bright and sharp. The color saturation is right on. The sound is loud enough to enjoy a movie, but will get lost in a busy environment.As for the negatives, I would have to start with the web browsing, because that's what these tablets are used for mostly. Pages tend to render in packets. The text will come up first, then the pictures. But, don't be too fast to click on anything just yet. The pages have to then arrange the contents, which takes longer than I experienced on an iPad or Windows tablet. Pictures and text slide around on the screen until everything is situated. Maybe the browsers cannot handle the floating content well. Who knows?As for the power, I have notice that it drops pretty fast from 100% to 30%. It's quicker than an iPad. Let's put it this way, after an evening of using it starting fully charged, I make sure to plug the tablet in before going to sleep. If I don't, it will not have much power left to use the next day. I suppose I am a bit spoiled after using an iPad, which had enough power to see me through two days of heavy usage. Still, I should be getting longer use out of this tablet per charge.The writing functions work nice. The pen produces very sharp lines as it glides smoothly across the display. However, the handwriting recognition is not working. I read that it is a problem Samsung will address shortly.Overall, I am still disappointed with many of the apps that are supposedly made for tablets. Although Google has pushed developers to produce apps specifically for larger screens, many of the apps look as though they are nothing more than stretched-out versions of the smartphone variety. I know there are diehard Android fans out there, but most of them are phone users, therefore they cannot see what I am talking about. In my eyes, even the Windows 8 tablet apps are better formatted for larger screens. Of course, I need not mention the iPad apps. Those are the best.So, I am deliberating whether to keep the Note 10.1 or not. There are too many quarks for me to use the tablet and be satisfied while doing so. I gave it a try because it is supposedly the best Android tablet being sold right now. So much for that. I tried.10/16/2013: Here is another annoyance I found. Samsung placed a couple of capacitive touch buttons in an awkward area on the bezel. One of those buttons is the back button, which is very sensitive. And, since the bezel is smaller with this model, it is more likely that you will touch that button and be taken away from the screen you are currently viewing. I had this happen to me quite often.", "Title": "Not quite there", "Date": "October 15, 2013"}, {"Author": "C. Baird \"Dyson Lover Now\"", "ReviewID": "R2NLBJ0V9NZKCC", "Overall": "3.0", "Content": "This purchase was over $600 and I was dissapointed on how long it took to ship. I did complain to Amazon and received order many days after it was expected to arrive. After 2 days of using the tablet it had to be restored to factory setting, technician from Samsung recommended to return if it had any more issues. This is why I waited a month to send in the reveiw to ensure no more issues with this tablet. Otherwise it is a great investment", "Title": "Took much longer to ship, I was very dissapointed in the speed of shipping", "Date": "April 21, 2014"}, {"Author": "Parahat", "ReviewID": "R1RVA6UDUB2IZU", "Overall": "3.0", "Content": "It wa not clear that this is wi-fi only. Before items clearly identified as wi-fi only or 3G/LTE. There is minor lag compare to ipad.", "Title": "It wa not clear that this is wi-fi only", "Date": "March 6, 2014"}, {"Author": "Bob Jones", "ReviewID": "R2RIGU94UAY029", "Overall": "2.0", "Content": "I bought this Samsung tablet after having tons of fun with it at the popup Samsung Experience store.  The staff there were so in love with their Samsung products that I decided to give it a try.  Unfortunately it doesn't compare well to my IPad Air.  The Samsung's battery will drain twice as quickly and will get noticeably hot.  It's also heavier than the Ipad and is less intuitive for me and my son and two toddler nieces.  Other than those main pet peeves, the experience is very similar to the IPad.  But, I value the things I mention above quite a lot so likely won't buy another Samsung until they fix the above.", "Title": "Gets hot and battery drains twice as fast as my IPad Air", "Date": "February 22, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00F3SOJ7O", "Features": null, "ImgURL": null, "Name": null}}