{"Reviews": [{"Author": "Joyce", "ReviewID": "R2FIR7IW69C0XU", "Overall": "5.0", "Content": "I purchased this tablet because I didn't have a lot of money to spend and I thought that it had all the features that other much higher priced brand names have. It arrived sooner than expected by two weeks and was packaged very well. There was no damage and everything on it works. None of the connectors were loose or broken. The battery charger and additional cables work excellently. I put Sketch Book Pro on it right away and have been enjoying myself immensely ever since. I also liked the design for the micro SD card, it is recessed in the back so the card doesn't stick out or have a chance of getting accidentally hit with something. I put a 16GB micro card in there and it works without a hitch. The sound of the speakers is just as good as the HD 9 NOOK that I have and the display is better. Also, you get the newest version of android and there's no hindrance as to what vendor you purchase your apps from. My headphones sound well from the headphone jack and both of the cameras take excellent pictures. This is a very solid value for the price.", "Title": "Best Value", "Date": "November 11, 2013"}, {"Author": "Y. Simon", "ReviewID": "R1SO80ZUFZI5A3", "Overall": "4.0", "Content": "Goldengulf 9\" dual core tablet opinion:Pros:Decent battery lifeApplications are pretty responsiveScreen resolution pretty clear despite lower resolutionGoogle play app market is installedBare clean installation with few apps installed(no angry birds, only  flash and google chrome installed, safari 4.0 is the default browser)Android 4.2.2Wifi signal is pretty good throughout the house, can get decent signal even in the basementAudio quality is pretty loud, 1 speaker in the backFlash player actually worksCons:Camera could be a little better, it feels like a standard laptop camera that you get when you buy a computer.Power adapter gets quite warm despite it being only a 5v charger and charging when tablet is shut offUSB to recharge the tablet takes forever even if you have and use USB power adapter.Homepage default to some sort of weird news/feed website. Try setting it to google.com a few times keep resetting to some random website?Screen smudges somewhat easyCharge indication light confusing? Red when you plug in the power adapter, but the green light is still on at the same time(see next sentence). No extra light when using usb to charge just a green light next to the front camera.When you plug in the USB and have the tablet on. You will see a battery icon that says charging, in reality it is not even charging and battery percentage will still drop even if you don't have it in mass storage mode. You actually need the tablet off first in order for it to be actually charging. It will actually be charging with power adapter.. but that adapter gets hot already just charging when the tablet is off.Some websites with smaller text tends to get a bit pixelated, images are fine.Other/Misc:When you select free shipping. It will take a while before it arrives: My order was placed on November 4th 2013, and it was shipped out November 5th 2013. I finally receive the tablet today which is November 18th, It took 13 days to arrive to the east coast. I was not in a hurry, but for people who select free shipping be prepared to wait a while before it arrives.This tablet comes in a standard white box and what looks like a generic tablet printed on the top. On the inside you get a screen protector if you want to install it and then the tablet itself. Under the tablet is the power adapter and an adapter for USB. The tablet uses the very small USB port but gives you an adapter so you can connect standard USB devices.If you decide to use the screen protector, install it immediately. I put it(screen protector) aside to test the tablet out first and then my finger prints smudge the screen real easily and all over the place. I cleaned it then try to install the screen protector only to find that it was getting quite a few annoying air bubbles while installing. If you do install the protector, do it while the screen is clean and the protector being very static  so you don't have to use your credit card to try and remove air bubbles. The more dust, and wiping on the screen the more bubbles you will get. Maybe they should just install the screen protector instead by default?Tablet is shipped with 25% battery charge and got a good half an hour installing apps and running stuff before it told me battery low.The user manual was.. not so helpful. It told you how to do a few stuff on android like check email use some buttons but it didn't actually point out any of the tablet features like how to insert the MicroSD card slot, where the speaker is adjusting volume etc.. basic stuff. Easy enough to figure out, but it looks like it was just a generic catch all manual which is a very small folded sheets of paper stapled together.Generic Benchmarks:AnTuTu benchmark app - ranking 12860 (better then Samsung galaxy S2, less then HTC One X)*for some reason this app list it as a Allwinner A10 frequency 60.0-1056.0MHz x2 cpu (bug in the app software)cpu: allwinner a20 dual core ??Mhzgpu: Mali-400mpFinal Thoughts:For the price this tablet I think it is worth getting, A generic brand is good for people who want to learn how to use a tablet and to use it as a ebook reader. I have not test this tablet out for gaming, but for basic stuff like surfing the web and actually being portable throughout the house is a plus. The decent battery life is something that I like also, though time will tell if the battery will actually last a while before I have to replace it. I am not to happy about the charger getting very hot, might stop by radioshack to see what they have in terms of chargers. Watching youtube and visiting most websites, you probably won't notice the smaller screen resolution.Also I would to point out, no where on the box or tablet does it say Goldengulf, other then the key chain(mine came in red). It is just a plain white box with a generic tablet picture(not the tablet that is in the box) and when you take the tablet out. It is a plain white tablet with some grainy design in the back. When you turn on the tablet you get the A20 dual core logo, then \"tablet pc android\" on the loading screen.Yes, it can run angry brids, youtube and skype.. but you gotta install the apps yourself as mine came with just a bare installation which is good! Sometimes companies install so much useless stuff you don't need, it is a pain to uninstall. This means that you get plenty of storage space to actually install and put what you want.", "Title": "My first day impression", "Date": "November 18, 2013"}, {"Author": "medman", "ReviewID": "R260UVXI2PSCLB", "Overall": "5.0", "Content": "My laptop power jack burned out, so decided to get a tablet instead of a new laptop.  I have an Android smartphone, and like it, so I thought a tablet with an Android OS would be a nice change from my Windows laptop.  The tablet arrived much earlier than Amazon predicted.  Was packed very well and is of very high quality.  Well built with nice features.  Processor is fast as it is dual core and is running the latest Android OS. Apps are available for anything from games to productive software. The 9inch size is perfect for videos, yet small enough to carry around.  Screen is bright and resolution is great.  Great tablet for the price.", "Title": "Best 9 inch tablet for the price you can find!", "Date": "November 9, 2013"}, {"Author": "DB", "ReviewID": "R3TQ0OB2I1DYTH", "Overall": "5.0", "Content": "I bought this tablet for use on our production floor for audits, data collection , and other various things.  It has a really good camera and I was impressed bit its speed.  Hands down - you can't beat it for the price vs. functionality.", "Title": "Great tablet for great price!", "Date": "October 29, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RXK8VZT2YL4MS", "Overall": "5.0", "Content": "Received the item quicker than expected, it was packaged very well protected and for the price, this tablet is wonderful...does even more than expected.  After I bought the first one for my daughter, I ordered a second for myself as well.", "Title": "Bought it as a gift, after receiving I ordered a second for myself!", "Date": "November 14, 2013"}, {"Author": "Charmaine DeLong", "ReviewID": "R3APRN6H6W0RXM", "Overall": "5.0", "Content": "I chose this Goldengulf android because it was the newest MID Google.  It really runs fast and great.  I would recommend this to anyone because of the apps, and search capabilities. I just can't say enough great things about it!  It's worth every penny!!", "Title": "Goldengul Android 4.2.2 Wow!", "Date": "October 7, 2013"}, {"Author": "Rex Logan", "ReviewID": "R1WG327RZYHJ7C", "Overall": "4.0", "Content": "Excellent tablet for the price. Received much earlier than promised and worked right out of the box. I have ordered a 32g micro card for it and am giving as a gift for Christmas. The tablet speed is quite impressive, battery life is ok and internet connection and speed are excellent. The screen resolution and camera are not the quality of a Galaxy or iPad , but if that is what you are looking for you don't need to be shopping for a $100 tablet! If you are looking for something to surf the web, use to read e-books and look at Facebook, I think it is a great purchase!", "Title": "Great Value", "Date": "November 14, 2013"}, {"Author": "Amazon Customer \"Jacqui\"", "ReviewID": "R33XGYCSHBR1GI", "Overall": "5.0", "Content": "First of all, the seller, Mr. Li is amazing!  I had a situation with the timing of my delivery.  I wasn't going to be home when it was supposed to arrive and didn't want it to sit in the cold weather.  Mr. Li was wonderful when we spoke via email and made sure that my Tablet arrived in time.  This is my first tablet, and I'm not really how should I say it, computer savvy.  But for me this tablet is just like my android phone so it's very easy to use.  It's very fast which was my main concern since I'm used to my phone and computer being super fast.  The downloads were easy - basically it is brilliant!  Thanks again Mr. Li  !  I will order everything that you sell via Goldengulf !!!!", "Title": "Goldengulf is wonderful !", "Date": "November 22, 2013"}, {"Author": "Desmond", "ReviewID": "R1T6VKI6I3OTWR", "Overall": "4.0", "Content": "I WOULD LIKE TO SAY FOR THE RECORD THAT GOLDENGULF  IS GREAT COMPANY AND THEY HONOR THERE WORD ON ALL THERE PRODUCTS AND I LOOK FORWARD TO DOING BUSINESS AGAIN IN THE FUTURE .", "Title": "THEY HONOR THERE WORD", "Date": "December 20, 2013"}, {"Author": "d bezzz", "ReviewID": "R3SM70IKDIU81O", "Overall": "5.0", "Content": "great customer service I received a tablet in 12 days I had contact with the buyer to throughout the process. the tablet is lightweight everything I've wanted in a tablet", "Title": "great buy", "Date": "November 13, 2013"}, {"Author": "Fran S", "ReviewID": "R3JKQU5238XAWS", "Overall": "5.0", "Content": "Quality seems good, colors very clear.  no problems, but I don't use it everyday. I have it as a back up for my laptop.Download apps easy. Makes this great as I am no Techie. Have taken it with me shopping, but not all stores have wifiaccessibility. Looking for a portable hotspot.I would recommend this & the size makes it easier to see for us older citizens.Haven't had any reason to contact their customer service.", "Title": "Nicer than expected.", "Date": "March 27, 2014"}, {"Author": "bernard green", "ReviewID": "ROLJ6200GYD3V", "Overall": "5.0", "Content": "The gulfstream android arrived way ahead of expected time and was expertly wrapped. I brought the leather keyboard for an extra 10 dollars and would recommend that you buy this along with the tablet. This was an overall excellent transaction and Mr. Li is a man of his word  and will respond almost instantly to any questions that you may have.  .", "Title": "Excellant custermer service.", "Date": "March 25, 2014"}, {"Author": "Antoinette Poole", "ReviewID": "RGYO7PSWWNW8V", "Overall": "3.0", "Content": "I wish the camera was clearer and the battery doesn't last long.....but overall it is very useful for me as a student...it comes in handy when reading PDF files and going on the internet when I need to in class.", "Title": "it comes in handy", "Date": "March 25, 2014"}, {"Author": "Eliezer Rivera", "ReviewID": "RKJAHVQZ0318", "Overall": "5.0", "Content": "While it may not be as fancy as, let's say, a Galaxy Tab or a Nexus, it's a good device, quick enough for what I use it for and works without a hiccup.", "Title": "A good alternative for anyone that wants a good price tablet", "Date": "March 22, 2014"}, {"Author": "Bobbie", "ReviewID": "RXXEBWM36D9LG", "Overall": "4.0", "Content": "I got this tablet today and I have to say I'm impressed. It's so fast. It works right out of the box. No funny stuff like the Coby Kyros tablets.We have 4 kindle fires in my house and we love them but this tablet does much more. There's a camera and you can download games from the Google play store. There are screen savers to choose from and much more. This tablet would be beyond perfect for a beginner because it's so easy to operate. I would definitely recommend this tablet to anyone.", "Title": "Not  bad for $109", "Date": "March 17, 2014"}, {"Author": "Dennis", "ReviewID": "R2LEZ6ZTPL1HZJ", "Overall": "3.0", "Content": "Got this from nomorerack for $79 and free shipping. As far as I can tell it is this tablet shown above. Mine has a white plastic back cover. It is hard to tell who makes it as it says nothing on the box, manual, etc. Though inside the terrible users manual it says MID-Android. So based on the fact that my tablet has a 9\" screen, a 1.6 Ghz Dual Core A23 processor and it apparently comes with 512MB RAM and 8GB of storage this is likely the right tablet. I say supposedly because if you go into settings/storage it says \"Internal Storage\" 504MB, then it says \"internal storage\" 8GB.I'm assuming the first number is actually the memory, why it labels them both as \"Internal Storage\" is anyone's guess.It also has an SD card section on the storage settings screen though the slot on the tablet says \"TD\"?.It is running 4.2.2 Ice Cream Sandwich. I have no clue what the screen resolution is as it doesn't say anywhere in the settings, in the user manual, on the box, etc., but it's pretty low, washed out, and grainy. Maybe 1024x640 or so? Several apps such as the Paypal app and Yahoo weather will not even install because the play store says \"this app is not compatible with your device\". I can only assume it is because the app requires a higher screen resolution to run? -shrug-Battery life seems fair. When it arrived it was 76% charged and I used it for an hour or two and it got down to about 25%. It fully charged up in about an hour so we'll see how it goes. It connected to my wi-fi just fine. I also plugged it into my laptop using the included micro USB adapter (it comes with 2 of them, one with a male and one with a female USB adapter on the other end of the dongle) and they seem to talk to each other just fine. I'm not going to try to figure out the permissions right now so I just put everything in the public user folder (Windows 7) that I want to copy to the tablet because it can access that just fine.I also have a Samsung Galaxy 4S and an iPad 4. This is clearly inferior to both but my expectations were pretty low. You get what you pay for.Most of the apps I wanted to install did install just fine and they seem to work fine, such as eBay, Flipboard, StumbleUpon all seem OK. I also installed a free file manager called \"File Manager (Explorer)\" that works fine for connecting to other computers on my network over wi-fi. I used to have a Motorola Xoom tablet (sold it and bought an iPad 2 years ago) and this is what I used on that tablet for the same purpose and it works great. There was another file manager that was pre-installed on the tablet but I didn't see a way to access files on the network, only local files so I disabled that one and downloaded the other which is much better for my purposes.It has dual cameras but they both suck, especially the front facing camera, but I don't plan to ever take pictures or video with this anyway.All in all, so far so good. We'll have to wait and see how well it holds up over time.I hope this helps somebody in making an informed purchasing decision.", "Title": "OK for the price", "Date": "March 16, 2014"}, {"Author": "big", "ReviewID": "R1CRUTY3QRBYJ8", "Overall": "5.0", "Content": "The unit is as stated in the description . I also got the keyboard case .Loaded the kindle app , Works great with my home wi fi system and on the road .for a $ 109.00 you can not go wrong", "Title": "This is a nice unit", "Date": "March 6, 2014"}, {"Author": "Tammy P.", "ReviewID": "R1NR0VEHH5XYLL", "Overall": "4.0", "Content": "I was very pleased with my purchase. It was a gift for my husband, and he loves it.  We are new to using it so we still have to figure out how some things work, but so far its been great!", "Title": "My new tablet purchase, Goldengulf 9\" inch DUAL CORE dual camera Newest MID Google Android 4.2...", "Date": "March 5, 2014"}, {"Author": "David Hillard", "ReviewID": "R1BOIJ14J5Q1NZ", "Overall": "5.0", "Content": "Everything that I expected and even more.  This is a great unit at a great price. I highly recommend it.", "Title": "What a great unit!", "Date": "February 26, 2014"}, {"Author": "Connie R", "ReviewID": "R1RSSA61CZPKC1", "Overall": "4.0", "Content": "I wanted a tablet for reading books, watching movies and playing games to pass the time while on a nine day bus trip. I don't have a smartphone and I'm not on facebook or twitter. I didn't want to invest too much. My techie son and son-in-law have pointed out what it lacks compared to their devices but I am quite happy with it. I easily got on the internet, and downloaded apps. I've watched movies, played games, and downloaded books. I'm glad I got it.", "Title": "First tablet", "Date": "February 26, 2014"}, {"Author": "Arthur Perreault", "ReviewID": "R29C1VNKE1HSD1", "Overall": "5.0", "Content": "I,m retired and find it very friendly and easy to use and highly recommend it.for the money you can't go wrong.", "Title": "ipad watch out", "Date": "February 23, 2014"}, {"Author": "ossieola moore", "ReviewID": "R3I0R1K0EELL23", "Overall": "5.0", "Content": "They were great to deal with. . On time and understanding. ..  and I wish my on line shopping was all ways like this one.", "Title": "Great tablet", "Date": "February 23, 2014"}, {"Author": "Adi", "ReviewID": "R2YUPLW150DQKT", "Overall": "5.0", "Content": "A nice looking tablet and very good for the price! If the name-brand tablets are out of your price-range, this is definitely the one to get. :)", "Title": "Very happy!", "Date": "February 19, 2014"}, {"Author": "Richard J Mohrbach", "ReviewID": "R1A6IM1WYTFR1U", "Overall": "3.0", "Content": "This being my first tablet I found it to be okay for the price. Everything works fine on it albeit a little slow. The graphics are not great and the speaker and mic are horrible.  I also wish it had come with an instruction manual. Also it was a little deceiving about the shipping as it states it is registered in Washington, but ends up coming from China, hence the nearly 4 weeks it took to receive it. My suggestion would be to get a Kindle Fire and pay the extra bucks for a quality product.", "Title": "Okay for The Price", "Date": "February 19, 2014"}, {"Author": "Samuel Ruiz", "ReviewID": "R2E9J7AVZJH8QV", "Overall": "5.0", "Content": "It works the way it is supposed to and the way it was described. It is a very good product.", "Title": "Goldengulf", "Date": "February 17, 2014"}, {"Author": "David M. Williams Jr.", "ReviewID": "R1U3P0FOOG78MF", "Overall": "5.0", "Content": "The Tablet is good. I have not used it much. The shipment was fast. I received an email asking me what color that I wanted and was told that was the color that was shipped. That was great. Not a lot on the tablet. needed to download the programs. The tablet isGood and the service was great. Thank you David", "Title": "Goldengulf 9\" Tablet", "Date": "February 11, 2014"}, {"Author": "Luis Affonso Buzaglo Kaner", "ReviewID": "R2SQFE8A46ZFKW", "Overall": "4.0", "Content": "The vendor is quiclky and availableand the merchandise was delivered in time.The tablet works like an android smartphone, is fast to play games from Google Play (my 7 year old son's evaluation) and didn't get overloaded by the time.Comparing to my android smartphone's wifi I was  expecting a little bit more from the tablet.", "Title": "Nice entry level tablet. Consider it if your are really close to a wifi spot", "Date": "February 10, 2014"}, {"Author": "hailey", "ReviewID": "RFU46G2JEU6OR", "Overall": "5.0", "Content": "I really like this tablet, but sadly it was not needed anymore. It worked great, had a great touch screen, quality was great and the camera worked great in the light. I really loved this tablet. Perfect for kids or adults. Came in super fast, and was great.", "Title": "I loved the tablet", "Date": "January 29, 2014"}, {"Author": "Charlene Saelee", "ReviewID": "R1F3S6RK5Q7O4Z", "Overall": "5.0", "Content": "I bought this for my 8 year old daughter and it was everything I expected. It is a good tablet for the price. I was happy with my purchase.", "Title": "Great deal!", "Date": "January 27, 2014"}, {"Author": "Gabriel4545", "ReviewID": "R2NHULTY8R9XIP", "Overall": "4.0", "Content": "All in all it's probably good for the price.Next time I would buy a tablet with:- a higher resolution (and rather a smaller size)- more battery time", "Title": "Ok, but wouldn't buy it again", "Date": "January 25, 2014"}, {"Author": "Liz", "ReviewID": "RTCM9AA1EZHL7", "Overall": "5.0", "Content": "still learning but is nice \"toy\" to take with you as you go-what now I need it is case cower", "Title": "my first tablets", "Date": "January 25, 2014"}, {"Author": "HOLLY BRYANT", "ReviewID": "R1YA7FTWZVADNB", "Overall": "5.0", "Content": "Works great and is user friendly!! My parents are elderly and this tablet works like their android phones but of course are much easier for them to read!! I say this is a MUST BUY!!!!!", "Title": "MUST BUY!!!!", "Date": "January 18, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2EUTON2WJBRFM", "Overall": "5.0", "Content": "This is my first tablet and I am very pleased with it.  I found out after loading a few apps that I needed a memory card.  It  runs Netflix with no problems.  Ordered a case with keyboard and it works great with the keyboard.  Have not tried the camera yet.  You can play games and charge it at the same time.  Right after I got it, which was about 7 days after I ordered it, it froze up on me and I couldn't get it to shut off.  E-mailed Mr. Li and he got right back to me and said to hold the on/off button down for about 10 seconds and it shut off.  Haven't had anymore problems with it.  I bought the Square Trade Warranty with it.  For the price, you can't go wrong.....it is a nice tablet.", "Title": "Goldengulf 9\" dual core Google Android 4.2.2", "Date": "January 10, 2014"}, {"Author": "Kay Bennett", "ReviewID": "R3K8MDFCZYV5LM", "Overall": "3.0", "Content": "the tablet seems to work well,  so far, but I cant read the manual and find the tablet difficult to navigate without a manual.  also the cover with keyboard works , but was made for another tablet.  the cord needs an adapter which is included but does not fit in folded cover and hangs out . Very inconvenient.  the cost to fix these two problems is a few pennies.why not provide the correct cover and a decent manual??", "Title": "instruction manual is the size of a playing card , only a few pages and nearly impossible to read. It looks like it has been red", "Date": "January 5, 2014"}, {"Author": "John", "ReviewID": "RDK4OITT6XK1B", "Overall": "5.0", "Content": "Mr Li was a pleasure to communicate with. His customer service far exceeded all my expectations! The tablet is fast and a great price. I would highly recommend it for anyone!", "Title": "Great tablet for a great price! Plus the customer service behind it is phenomenal!", "Date": "December 17, 2013"}, {"Author": "Maurice Henry", "ReviewID": "R17I3L2D1RY28J", "Overall": "5.0", "Content": "This tablet does all that was expected. We have been using it for about two weeks. Worked out of the box.", "Title": "Works well", "Date": "December 17, 2013"}, {"Author": "Everette M. Gerringer", "ReviewID": "RAATDUPRL0692", "Overall": "4.0", "Content": "Works great, and at a great price. Perfect for the young or first time tablet user. I bought for a 14 year old and it works so good I am going to purchase another for myself when I travel.", "Title": "Good buy, good price", "Date": "December 10, 2013"}, {"Author": "windtalker", "ReviewID": "R15YZJ7P0YP3FH", "Overall": "5.0", "Content": "This product is coming from China so if you want one for Xmas, better order it a few weeks ahead of time. Mine took two weeks to get here and I'm in Florida. It's an Allwinner which in the past didn't get good reviews. Evidently they have improved because the only complaint I could bring up is typical of tabs, the battery life leaves a bit to be desired. I don't use mine for work. Normally I'll use mine for an Ereader since Android tabs are a heckuva lot cheaper than a Kindle and Moon Reader will read pretty much anything. I'll listen to music as well and play games like solitaire if we're in a Doc's office or something. It's a lot faster than the old 7\" Irulu that the power button is worn out on and I have to fiddle with. Brightness out of the box is fine. Audio is more than adequate. Video is adequate. Wifi is fast. Over all feel is it does have a \"solid\"  weight to it. Not chintzy, cheap plastic. It actually feels like you're holding an Acer only a lot thinner. For a little over $100 bucks it's the best bargain on the market IMHO.", "Title": "Not bad at all.", "Date": "November 29, 2013"}, {"Author": "UberL33t", "ReviewID": "R17A0709073SVN", "Overall": "5.0", "Content": "I have to say that this is one of the best shopping experiences that I have had on Amazon. Mr. Li is the epitome of Customer Service and this tablet was everything my fiance expected and more. I purchased this in the hopes that it would arrive for her birthday, Mr. Li assured me that he would get it to me by at least a day after her birthday which was acceptable but not ideal. Well, it arrived on her birthday so I could not be more pleased. Mr. Li answered every question I posed and I was extremely confident that I was getting everything as advertised with this purchase...and I did. The tablet is awesome, and my girlfriend absolutely loves it. I highly recommend this product and for the casual to frequent tablet user, this will be a sound purchase. Friendly little FYI though, DO NOT look directly at the free LED Key Chain light...my word is it bright!", "Title": "Great experience all around.", "Date": "November 26, 2013"}, {"Author": "techmark", "ReviewID": "R3V9KFYWXNE053", "Overall": "1.0", "Content": "I really like the tablet and it is fast and well built and packaged properly and even came in only 2 weeks.  the problem is that golden gulfhijacks the browser !!  it keeps resetting to [...] .  this is totaly unacceptable and if I had the time, I would demand my money back.  instead I'll have to break in to operating system and get rid of whatever java script they stuck on to chrome.  It does it's thing when you close it (chrome browser) it resets the home page to vipcj.com.  there is no easy way to remove it !! . DO NOT BUY THIS TABLET (or anything else from goldengulf for that mater).  IT HAS SPYWEAR YOU CANNOT REMOVE !!!  browser hi-jack  vipcj.com", "Title": "not a buy !!!", "Date": "January 31, 2014"}, {"Author": "zoso967 \"zoso\"", "ReviewID": "RVAL9SB2KD1EB", "Overall": "5.0", "Content": "Let me start by saying I bought this as a gift and have never seen it in person. However, the recipient was quite impressed with the quality. She's not a very tech savvy girl but she managed to set it up,  join Google Play and Skype me within an hour. The pic on my side was quite acceptable and on theirs as well. She loved it and was up and running very quickly. I really expected to have to jump through hoops to get it to work remotely but she had no problem at all.I'm glad I took a chance on this tablet....", "Title": "Impressive and quite a bargain", "Date": "December 27, 2013"}, {"Author": "Charles W.", "ReviewID": "R3ULTFGUZ38UEQ", "Overall": "5.0", "Content": "This is one fantastic Tablet, I purchased it for my wife for Christmas.  I was worried that I wouldn't get it in time so I paid the extra and got the quicker shipping.  I have to say this seller is great, the Tablet arrived very fast and it was packaged perfectly.  When I received it I turned it on and it connected to our home network in seconds.  I have a much more expensive tablet and if something happens to mine I'm going to replace it with a Golden Gulf.  My wife loves her gift and I recommend this seller Five Star", "Title": "Golden Gulf 9\" Tablet", "Date": "December 26, 2013"}, {"Author": "Renate Schewe-Weeden", "ReviewID": "R1GOV750OMK1Z6", "Overall": "3.0", "Content": "Received item way before estimated delivery date.Item was very good wrapped.Camera is not as good as I expected.Battery life really bad. It will maybe last the most for 3 to 4 hours. So not good for someone who will use this time a lot.Overall its not a bad tablet for first time users.", "Title": "fast shipping", "Date": "December 19, 2013"}, {"Author": "serrano01", "ReviewID": "R4KIN8CXMTK93", "Overall": "5.0", "Content": "Its a great tablet, i bought two for my kids and they love it, its fast and just awsome, and most important i'ved received personal attention from my seller about my purchase, that' s a PLUS in my book. i would recommend this tablet to everyone.", "Title": "Great tablet!", "Date": "December 16, 2013"}, {"Author": "Heather", "ReviewID": "R1ZXVUASOCA4BN", "Overall": "3.0", "Content": "purchased for my 7 year olds first tablet. First be aware it ships from China and the charger adapter and USB adapter is different from what I have seen on other tablets. I tried to return because of the length for shipping and seller was hesitant but was willing to negotiate. My daughter likes it though, we have had no problems with setting it up and so far works for her needs.", "Title": "okay for first tablet", "Date": "December 29, 2013"}, {"Author": "Cajun Lady \"Cajun Lady\"", "ReviewID": "R2YR9TYQRLESS6", "Overall": "4.0", "Content": "THIS CAME IN VERY QUICKLY, WAS WORRIED BECAUSE AFTER ORDERING, SAW THAT WASHINGTON REGISTERED, BUT CAME FROM CHINA;  BUT IT WAS HERE IN ONLY 13 DAYS.  LOOKS NICE, BUT CHILD HAS NOT GOTTEN IT YET AND HAVE NOT USED IT; ;SHE LIVES OUT OF STATE.  THOUGHT SHE WOULD BE HERE SOONER.  BUT TABLET GOT HERE BEFORE SHE DID!  WILL WRITE AND UPDATE LATER, HOW GOOD EVERYTHING WORKS.", "Title": "ARRIVED IN ONLY 13 DAYS; LOOKS GOOD.", "Date": "February 27, 2014"}, {"Author": "cynthia toussaint", "ReviewID": "R39G0LUV7GUTQK", "Overall": "1.0", "Content": "i',m not satified with this product the resolution is off you have to tilt the tablet to get clearity andthe sound is horrible. So with this saying l need my refunds plus it looks refrubuiish", "Title": "you ll be taking ur own risk", "Date": "February 16, 2014"}, {"Author": "Robert L. Woldman", "ReviewID": "R2M9EKYECFD1PL", "Overall": "1.0", "Content": "I bought two of these as Christmas presents.  In the end, I had to return both of them.  The first stopped working an hour after it was opened.  We could get nothing but a white screen.  The other lasted about 2 weeks before it could no longer hold a charge, but during those 2 weeks it was very slow.  I cannot believe the processor claims.  Streaming video was very frustrating to watch as it was constantly stopping and starting.  The only positive thing I can say is that the customer service was excellent.  I received both of my refunds very quickly.  Also, the order was shipped from China and the first order was held up in customs, so they had another set sent to me by a rush shipment.I am confounded by all of the positive reviews of this product.  It leaves me wondering as to who could be leaving them.", "Title": "This product is not worth your money", "Date": "January 28, 2014"}, {"Author": "R. Root", "ReviewID": "R15IWGX7JEQT6L", "Overall": "5.0", "Content": "I bought this product because it had nearly a five star rating and thought it looked like a good value for the money.  Well perhaps I was unlucky but I ended up with a tablet I think is defective.  After being on for 20 minutes it starts typing in random characters and randomly changing screens.  The screen starts shifting back and forth.  It stops responding to touch commands.Mr Li said the tablet might initially be unstable but it would settle down after a few days and it has actually.  Seems to work ok now most of the time.  But I'm a bit too nervous about what I have seen it do to keep it.After emailing Mr Li he has assured me if I send it back he will reimburse the shipping costs as well.  When I read the reviews of Mr Li I thought he must have had his friends log on and write them...but no... he really is that good.I would have to give the product a one star, but Mr Li five.", "Title": "Product defective, but I trust Mr Li to nake it right.", "Date": "January 16, 2014"}, {"Author": "Lynette", "ReviewID": "R2UE6CBI4LIW5O", "Overall": "5.0", "Content": "This is my first tablet. And I didn't want to spend a lot of money on it. But when I opened the box I was amazed at how beautiful it was right out of the box. I was excited to charge it and get it working. It has been taking 4 hours to charge, I have been playing with it while it has been on charge. Downloaded some apps and learned how to use it while changing the look of it. I love Android for that reason. Customizing! The camera is not great. I wouldn't even use it. It sucks. But if you're just going to use this tablet, like I will be, some internet surfing, Vine, Youtube, movie watching. Then it's perfect. The picture quality is awesome. The sound quality is great. It could be louder, but I don't intend on watching anything without headphones anyway. I'm impressed with this item. It worked right out of the box. And I knew it was coming from China when I ordered it, and I expected it to take a lot longer than it did. I ordered it Dec 30, 2013. And it arrived today, Jan 10, 2014. Less than 3 weeks! That's pretty amazing in itself! Shipping was fast!Also, I was planning on buying a screen protector, it did not say it came with one. But it did. I was happy about that. But I will be buying backups eventually. I am very pleased with this tablet. Would purchase it again.", "Title": "First time tablet user", "Date": "January 11, 2014"}, {"Author": "paulette k best", "ReviewID": "R2KB79NTODZ68S", "Overall": "5.0", "Content": "This item worked for 5 months. Now it will not even turn on. I would not recommend this product even for a child.", "Title": "bad buy", "Date": "June 5, 2014"}, {"Author": "marlene r", "ReviewID": "RJTDUABMTJ7V2", "Overall": "2.0", "Content": "It is not picking up the internet properly and the screen has marks on it. Sorry I would not recommend it anyone", "Title": "Faulty tablet", "Date": "May 29, 2014"}, {"Author": "Kelly M. Mcdonough \"Kelly\"", "ReviewID": "R13RV7O6LBF4MV", "Overall": "5.0", "Content": "I received this tablet in Jan 2014. I just bought a 2nd one yesterday. My daughter & I have put this tablet through its paces. I am on it through out the day & then she is when she comes home from school. I am purchasing another so that my daughter (age 10) can have her own. The tablet is cheap enough to be able to do so but it is not flimsy. We have not had any issues in the months that we have both used it pretty much all day long. The only problem is the metal piece that connects to the tablet to charger broke off. However, there is another port on the tablet that happens to fit the charger to my Virgin Moble cell. If you don't have one of these chargers, you can purchase one on Amazon for only $3. Mr.Li stands behind his product, of course & he resolves any issues that you might have. I emailed him about the time frame in which the 2nd  tablet would arrive(1st tablet came in 4 weeks from China) & he returned my email within minutes letting me know that it already had shipped from Amazon & would be delievered in a couple of days. If you have any questions, feel free to contact me. Thank you.Kelly", "Title": "Well worth your $$", "Date": "May 25, 2014"}, {"Author": "Carl", "ReviewID": "RJZD982ISWBX5", "Overall": "3.0", "Content": "Nice tablet for the price, only down fall is the home page memory, but the history will bring back you to home page. Just an click, but a good tablet to start with.", "Title": "Good value.", "Date": "May 23, 2014"}, {"Author": "Michael Civitano", "ReviewID": "R3KF2QQZK57IKY", "Overall": "3.0", "Content": "Owner is great helped me with any problems I have. This will make me recommend the Goldengulf in the future.", "Title": "owner helped me.", "Date": "May 22, 2014"}, {"Author": "jennifer campbell", "ReviewID": "R1JLMIP8JVO493", "Overall": "5.0", "Content": "Bought for family. hubby loves it and so do the kids. I am sure I would too if I got a chance to use it! LOL I will say that the seller is awesome and the product is great too! I chose this tablet because of the reviews on the seller. I will be buying on for myself soon!", "Title": "seller is awesome!", "Date": "May 6, 2014"}, {"Author": "Bill Klein", "ReviewID": "R14JKEPIKN09IL", "Overall": "3.0", "Content": "The only thing I didn't like is the book that came with it. The icons were all black so when they said push this you had no idea which icon they were talking about. The book looks like a zerox copy and then shrunk the type size.", "Title": "works fine", "Date": "April 26, 2014"}, {"Author": "Dennis R. Moriarty", "ReviewID": "RK2HJWXWMVMJ1", "Overall": "5.0", "Content": "TYhis tablet has excellent sound and wifi connectivity is seemless.  This is well worth purchasing.  Also suggest Kamora case with keyboard.  Works flawlessly with bot connected.  A smart purchase.", "Title": "Goldengulf 9\" Dual Core tablet", "Date": "April 24, 2014"}, {"Author": "L. Curtis \"lacy4u\"", "ReviewID": "RJI2Y73Y99MMX", "Overall": "3.0", "Content": "I was happy to received my 9\" Goldengulf tablet a few weeks earlier than expected. Its a really nice tablet and I'd recommend it to anyone. My only issue is everytime I try to download xbmc on it, the words on the movies and tv shows go in slow motion and sound distorted and garbled up so I'm unsure how to fix this. Too bad since this is one of the reasons why I got the tablet in the first place so", "Title": "Nice tablet, good delivery time", "Date": "March 31, 2014"}, {"Author": "Brittany", "ReviewID": "RGI1NN361PUIH", "Overall": "5.0", "Content": "This is a very nice tablet. Especially for the price. It got here way before the expected delivery date. Definitely would purchase again if need be!", "Title": "loved it", "Date": "March 28, 2014"}, {"Author": "Shawn M.", "ReviewID": "R3ETX0PQM7LNH9", "Overall": "3.0", "Content": "Works fine but kinda slow and the play store pops up on its own camara ant that great. Good starter tablet. Not comparable to ipad by far", "Title": "Ok", "Date": "March 27, 2014"}, {"Author": "connie", "ReviewID": "R1TQCUX6JXA39R", "Overall": "2.0", "Content": "screen very pix elated  ok for a little kid but graphics are sub par. works fine though. As long as you have the exact dead on viewing angle you get what you pay for .", "Title": "screen sucks", "Date": "March 18, 2014"}, {"Author": "Syed A Khaleque", "ReviewID": "RQ0ONVPHDICMR", "Overall": "3.0", "Content": "Not a bad tablet for kids but this shouldn't consider for elder use. also screen resolution and WIFI connectivity strength are not good enough.", "Title": "ok tablet", "Date": "February 2, 2014"}, {"Author": "albert topjian", "ReviewID": "R1RMDMYVUW3967", "Overall": "2.0", "Content": "giving this item a 2 star because the screen quality is so grainy and bad. Might just be me but you can see every pixel on the screen and it hurts the eyes after a while of use.", "Title": "Screen quality", "Date": "February 1, 2014"}, {"Author": "VK in SD", "ReviewID": "R11HXY1HKJ5FLR", "Overall": "4.0", "Content": "Bought tablet for 11 yr. old daughter.  Had the single core one previously, but it got dropped.  She really enjoyed that one.  This one is faster and she enjoys it as well, except for the front facing camera--it's pretty crappy--much worse than the one on the previous tablet.  Emailed Goldengulf, but the response was that's just the way it is on the dual core.  The back facing camera is good, so my daughter wanted to keep it as it is rather than be without it.  Others seem to say their cameras are good, so I guess it's just by chance whether you get one with both cameras being good.", "Title": "Great tablet, only one good camera.", "Date": "January 23, 2014"}, {"Author": "Danya L.", "ReviewID": "R30OIR7TMRE8NG", "Overall": "5.0", "Content": "First of all Mr. Li deserves 10 stars for his amazing customer service!I read at the time the 9 reviews for this and they were all 4 and 5 star reviews so I placed anorder for two of them.  I received them very fast!By the time I received them there were 18 reviews and again all 4 and 5 stars.As I said, I bought TWO of them.  Had problems with both of them not staying connectedto wifi long enough to even open a page. (Had my computer geek son-in-law look at them and he couldn't figure it out either because they did the same thing at his house).  While I was trying to figure that out one of themfroze up and went blue screen. I finally got that one off then couldn't ever get it to come on again.I ended up having to send BOTH of them back because of these problems.Mr. Li was very kind and understanding and refunded me right away.NOTE: I am givng Mr Li the 5 stars.  The tablets only ONE STAR.", "Title": "I can't believe I got the only two that didn't work (?)", "Date": "December 8, 2013"}, {"Author": "Kyla R.", "ReviewID": "R7JEATF9RO73K", "Overall": "5.0", "Content": "This product was more than expected.  It came preloaded with a few things.  It also has a pretty good battery life span.", "Title": "Great product", "Date": "December 3, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R28JDUFF3H9WBA", "Overall": "5.0", "Content": "Great tablet for the price. I have been searching for a tablet for my mom who is 88 years old, she mostly plays games on it. This is perfect for her, she has easy access and it does everything she needs. I have also used it a couple of times and it works great on searches and other internet activity.", "Title": "Great tablet for the price", "Date": "December 3, 2013"}, {"Author": "Pamela Jones", "ReviewID": "R3GEN169QFXO8Y", "Overall": "5.0", "Content": "I bought three (3)for my grandchildren.  Had to ship these to them and the seller accommodated me greatly.  Packaged well!  Had a little time to view item before I reshipped it.  Everything looks fine.  I know my grandchildren will love having their own tablets.  Thanks again!!  Would buy for this seller again and again!!", "Title": "Awesome Seller/product", "Date": "November 30, 2013"}, {"Author": "Randall B", "ReviewID": "R2CU1X8LYUAM6U", "Overall": "4.0", "Content": "After a few weeks of testing the tablet seems to do all I needed/wanted it to do. I can have multiple apps open and still peruse the internet with acceptable speed. I can stream video with average resolution fine, but higher resolution does seem to have a delay here and there. Your internet experience will depend upon which browser you use, as with any tablet using android. I played a boxing video game and it seemed to run smoothly. The only negatives are you need to turn the brightness down or the battery will drain in about an hour. If you use a lower brightness the battery lasts around 4 hours. You will need a micro SD card, or TF card, as the internal memory is sparse. Considering how cheap micro SD is now that is not really an issue. For the price I could not expect perfection, but it is reliably fast for my needs and has worked fine thus after nearly 3 weeks of use.Update: power adapter broker after a month. I unplugged/plugged the bulky adapter a few times. The area with the two metal prongs pushed inward when I tried to push the adapter in to the wall socket. I still have the usb cable to charge the tablet, but usb is much slower method to recharge.", "Title": "Decent For The Price", "Date": "November 25, 2013"}], "ProductInfo": {"Price": "$99.00", "ProductID": "B00F96JG78", "Features": "2014 Newsest version, Dual core Dual Camera, Fast Speed.\nProfessional seller.  Brand Registered in Washington\nBrand New, Hard box package, Including a free Led Keychain\nGoogle Android V4.2  JELLY BEAN\nPlay store, Facebook, Skype, Youtube", "ImgURL": "http://ecx.images-amazon.com/images/I/51PhNfEpdtL._SY300_.jpg", "Name": "Goldengulf 9\" inch DUAL CORE dual camera Newest MID Google Android 4.2 Tablet PC Capacitive Allwinner A23 8GB/512M RAM Flash 11.1,Registered in Washington"}}