{"Reviews": [{"Title": "Dell Venue 8 Pro vs Lenovo Miix 8", "Author": "Amazon Lover", "ReviewID": "R1TDSDFEZE6RS6", "Overall": "5.0", "Content": "I'm going to post this review under both the Dell Venue 8 Pro and the Lenovo Miix 8 as I believe some people may find the comparison helpful.I will cut to the chase and say that I have decided to keep the Venue 8 Pro and return the Lenovo Miix 8. I rated both of the devices a 5 because they are both very similar and I didn't feel it was fair to dock the Lenovo just because I preferred the Dell. If I could have rated the Lenovo 4.75, I would have.Here is what I like and dislike about both devices:1. Screen on the Dell is better than the Lenovo in my opinion. For example, in the Kindle App for Windows 8, after changing the settings to white text on black background, you get a truly \"black\" background on the Dell whereas it is more of a gray on the Lenovo. Also, the colors just seem to be more accurate on the Dell. The Lenovo offers a brighter screen but the Dell is plenty bright for me. I was also able to dim the backlight on the Dell more than the Lenovo which was helpful to me for nighttime reading. These are not major issues but it was something I noticed after comparing side by side.2. I have grown to prefer the build materials and quality of the Dell more than the Lenovo. The Lenovo is thinner and lighter which I thought was something that was important to me, but the Dell is much more comfortable to hold. This is mainly because the Dell is made from some sort of rubberized plastic material that is very \"grippy\". It just feels comfortable to hold. The Lenovo on the other hand is made from some sort of slick plastic and it always felt like I was going to drop it. Also, the Lenovo made a faint \"creaking\" and \"crackling\" sound whenever I held it.3. I originally didn't like Dell's placement of the start button on top of the device, and this was one of the reasons that I purchased the Lenovo. After using them both, I have grown to prefer Dell's implementation since I don't ever power off the device. The Start button acts as my \"on\" button and I have grown accustomed to the placement. I thought I would prefer the Lenovo with its capacitive button, but I find myself having to hit the button at least twice to activate it which is very frustrating. I realize it must be very difficult to design a capacitive button with just the right level of sensitivity, but if Surface and many Android tablets can pull it off, so should Lenovo. Hopefully both companies will figure out a way to engineer a hard button on the front like on the iPad.4. I thought I would prefer having the GPS that the Lenovo offers, but since there aren't currently any good GPS apps for Windows 8 touch devices, I didn't find much use for it. I tried it with Streets and Trips and the program would not recognize the GPS sensor.5. I get slightly better sound quality from the headphone jack of the Dell than I do with the Lenovo. It's just a minor difference and probably just a matter of personal preference, but it is something that is important to me.6. Actual user performance on both devices was about equal for me, even though the Lenovo apparently offers a slightly better processor.7. The Lenovo offers a cheaper case and stylus than the Dell. I have found the Lenovo case and stylus for as low as twenty dollars here on Amazon.8. I was able to pick up the Dell unit for twenty five dollars less than the Lenovo and see a lot of deals on the 32 gb version of the Dell. Something to consider.9. Battery life seems to be similar on both but I can't say I have performed any scientific tests to verify.Here is a list of tablets that I currently own and used as reference points in deciding whether or not to keep the Dell:1. iPad 2. I no longer have any need for this device and find it to be too limited for its size and weight. I have handed this down to my wife and kids. The kids get a LOT of mileage out of it playing various learning and leisure games. My wife mainly reads books and plays candy crush on it.2. Kindle Fire HD 8.9. I ONLY use this device because of the text to speech feature and only when I need to read something technical and/or boring for work. I tried to \"upgrade\" to the Kindle Fire HDX 7\" and later learned that Amazon crippled this amazing feature (you have to buy the audio book now) so I ended up returning the HDX. I may upgrade again if Amazon ever brings this functionality back.3. ThinkPad Tablet 2. This is my go to device for customer meetings as it is very convenient for taking notes with the screen size and dock-able stylus. That said, the device is a little slow for my taste so I'm really looking forward to the new version early next year.4. Nexus 7 (1st gen). Too slow and battery life sucks. Pretty much collects dust now but I do use it occasionally as a controller for my Sonos system.5. Surface 2. Love this device with the Type Cover 2 and use it as a bridge between my home pc (Samsung Series 7 Slate) and work pc.6. Kindle Paperwhite. Love this device for long reading sessions as I don't get any eye strain like I do on my LCD devices.7. iPad Mini (1st gen) Great for what it is, but very limited in what I can do with it. I use it mainly as a quick consumption device and ebook reader. I might end up getting rid of it now that I have decided to keep the Dell Venue 8 pro.Well, I think that is everything I wanted to share. I do want to make it clear that I like both the Dell and Lenovo very much, and would have kept the Lenovo if the Dell wasn't a choice. Thankfully, I have a choice and will stick with the Dell.", "Date": "November 29, 2013"}, {"Title": "Internal GPS, and brightest screen of all current Win 8 tablets", "Author": "Rick S", "ReviewID": "R1HN7SIBQPEJQV", "Overall": "5.0", "Content": "I've had the Miix 2 8\" for two weeks, and it's definitely a keeper for me. I plan to use this for a different purpose than many of you. I need to mount this in my sailboat for use as a navigation tool (chartplotter) by the steering wheel. I've interfaced it to my boat's instruments using Bluetooth, and all the marine software that I use is written for Windows. So I have a special requirement for a Windows tablet (not Android or iOS) with an extremely bright display for daylight viewability, which this tablet excels at better than all the Windows 8 competitors out there right now. Also, this tablet has a built-in GPS, which makes it perfect for navigation. Most Windows tablets out there right now do not have GPS (though I'm sure they'll become more common over time). A quick note of warning - Windows 8.1 supports tablets with internal GPS chips in a way that only works with Metro apps, not with legacy desktop programs that expect to see the GPS on a COM port or TCP port. But there are free and low-cost programs available that will take the internal Metro GPS and emulate a COM port and/or TCP port, so you can use your old programs with it.For me, the screen brightness and GPS are the two features that make the Miix2 8\" stand out over the other 8\" tablets from Dell, Asus, and the others. Those features may not be that important to you, but if they are, this tablet deserves a long, hard look.The only significant weakness is the low audio volume, but that can be addressed with headphones or external speakers. I plan to get some Bluetooth speakers for use on my boat. The other weakness for some is the bright display. Some have complained that its minimum setting is too high to use in a dark room. Not a problem for me, but maybe it is for you.Let me also dispel a few myths that are out there:Myth 1: The Miix2 does not have a GPS. NOT TRUE. It definitely has one. It shows up in Device Manager, works with Metro apps, and works with my legacy PC software when running \"Geolocation TCP\" freeware. (Google it.)Myth 2: Because there is only one microUSB port, \"it is impossible\" charge the Miix while it's connected to an external device. (Stated in several magazine reviews.) NOT TRUE. You just need a little creativity and a few adapter cables. You need a USB Y-adapter (two Type A plugs at one end, one Mini B plug at the other end) like those used for many portable hard drives, and also a USB adapter with micro B plug on one end and Type A female receptacle at the other end. Plug the power-only USB plug (often colored red or marked \"Power only\") into the Miix's power cube (or similar 2-amp USB power supply). Plug the other type A plug into the Miix using the micro adapter. Now plug the Mini B plug into a USB 2.0 hub and you have multiple USB ports while the Miix charges that you can plug in mice, keyboards, thumb drives, or another SD card reader. All the required parts are available at Amazon or DX for a few dollars each. I had them all lying around from other old computers.Myth 3: 32 GB is not enough space. NOT TRUE (maybe). Everyone's need are different, but the first thing I did was put in a 32GB microSD card. I keep it in the microSD slot all the time, and I put everything I can on it, leaving the internal memory free for stuff that can only be installed there. It is true that there is only about 10 GB of available space on the 32 GB tablet, but 7 GB of that is contained on two recovery partitions that can be moved to an external drive, so you can get some of it back. If you need more, spend the extra $$ for the 64 GB version. But I got the 32GB because it was on sale for $100 less than the 64 GB version.Myth 4: Windows 8.1 sucks because there is no start menu. NOT TRUE. Just install Classic Shell and be done with it. With Classic Shell, it can works just like Windows 7 for PC apps, and you can always switch over to Metro apps for things that a tablet does best.The Miix2 is not meant to be your primary PC, but if you need a portable 8\" Windows tablet for under $300, this is a great one to consider.Addendum 2/9/2014:I did have some difficulty connecting a portable hard drive to the Miix through my USB hub. It worked fine if I directly connected to the microUSB port on the Miix, but would not come up when connected through the hub. The problem is probably the $5 hub and not the Miix - I recall having similar problems connecting hard drives to other computers through a hub.Mice, keyboards, thumb drives, and even additional card readers connected through the hub just fine. And when you use the Y-cable adapter mentioned in my review, you can charge the Miix at the same time you're using the external devices.", "Date": "January 25, 2014"}, {"Title": "Solid Performer vs. Dell Venue 8 Pro", "Author": "Paul A. Bigelow", "ReviewID": "R2255YSEL2RLNL", "Overall": "4.0", "Content": "The Lenovo is a good tablet and should suffice for users of previous Windows tablets and those familiar with Windows 8.1Brief review and comparison vs. the Dell Venue 8 pro:Processor/Memory:The Dell has the 3740D and utilizes single channel memory -- 2GB maxThe Lenovo has the 3740 and utilizes dual channel memory -- 4GB max (but the Lenovo does not allow for a memory upgrade)A look at the System Performance file shows a 6.4 memory for the Dell and 7.1 for the Lenovo.The other performance scores are virtually identical.So theoretically, the Lenovo should be a bit more snappy but I haven't really noticed it yet in \"real world\" use.Physical:Under similar loads the Dell's back gets a bit warmer than the Lenovo's.  The Lenovo has never become *hot*, so far.The Dell *feels* nicer and more solid, the Lenovo makes a few creaking noises if flexed even a little.The Dell's buttons certainly feel better with a good tactile response, the Lenovo's feel \"mushy\".Screen:The Lenovo screen can be made the brightest, but the Dell screen can be made the darkest and looks better in a low light environment. The Dell seems to reproduce colors better at the widest angles while the Lenovo washes out (both are still, IPS though). The Dell has warmer screen temperature, the Lenovo is a bit on the cool side (partially explains the perception of brighter but the backlight is a contributor also).Sound:I'm still evaluating the sound, Dell has released an update for both firmware and screen.Misc:Haven't tried the Dell active pen, no one locally has it. A Targus aluminum barreled capacitive stylus works pretty good.  Both have good handwriting recognition.The Dell has the more feature-ladden BIOS while the Lenovo's is fairly simple. The Dell also has a nice hardware diagnostic menu/program as well.The Lenovo camera allows for panoramic shots the Dell does not (same Windows app version)The Lenovo has GPS the Dell does not.I had to return my first Lenovo as the SD card slot was broken and wouldn't hold the sdcard. The second Lenovo was fine.Impression:The Lenovo is a fine, if not extraordinarily well-built tablet.  Snappy performance.", "Date": "December 8, 2013"}, {"Title": "Dell venue 8 pro is better despite being barely heavier", "Author": "Mike", "ReviewID": "R1GXKANE2WW5M1", "Overall": "3.0", "Content": "I bought this as well as the dell venue 8 pro and the dell one is better for a few reasons. The display is more color accurate, touch screen taps are more accurate, the WiFi speed and signal strength are better when placed in the exact same location and connected to the exact same AP, the build quality is more durable, and the speaker volume goes around twice as loud. No joke.I have to admit that the mix had a slightly better camera and was lighter, but the above features were more important to me.", "Date": "November 15, 2013"}, {"Title": "excellent hybrid tablet for work/play", "Author": "Wirt W. Cross Jr.", "ReviewID": "R1BPK7YLLDQLTN", "Overall": "5.0", "Content": "At work I use word and power point quite frequently.  I am also more comfortable with windows vs. mac.  I bought an ipad 2 back in the day, and just never used it that much.  Oh, it was fun for the first week or 2, but after that I realized I'd surf the net occasionally or play a game or 2 on it but that was it.  Once the windows tablets started coming out I was interested in seeing how they worked.  the surface was not for me because I don't like the idea of a windows lite.  I'd rather have a full version, but the fact they had power point and word seemed pretty nice.  I needed something the was portable and able to be comfortably held in one hand so I continued to wait.  I almost got an ipad mini but held out, and I am definitely glad I did.  I started looking into the miix2 when my wife got the miix 10.  It seemed pretty nice but too big.  I saw a review about a pending offer from lenovo the miix 2  I happened to check amazon and lo and behold the had it in stock.  i ordered it immediately and it arrived 2 days later.External appearance: Opening the box I was very pleased with it's initial looks.  It seems very sturdy, maybe aluminum or something but there was certainly no flimsiness that i noted.  I didn't like all the stickers on the back but they peeled off very easily and you can't tell they were ever there.  It has a micro usb an SC card slot and a headphone jack.  Speakers on the back one on top of each other and front and rear facing cameras.  Windows button in good position bottom center.  Plugged it in and after a few hours charge booted it up.First use: Set up went just fine without a glitch.  Mine didn't have the facial recognition software which I would have removed anyways.  The apps preset were fairly minimal in keeping with lenovo's other offerings. I also removed mcaffee and several other non-essential aps without difficulty.  The uninstall is extremely easy.  Windows 8 is a great OS.  I use 7 on my other computers but I really like 8 so far.  The really nice thing is word, power point, excel, and one note are all there to be installed using the key provided in the packaging.  Also while trying to get used to the new start screen, the desktop was literally a touch away.  I installed itunes just to see if I could and that brings up another plus. This is full windows.  If there isn't an app for something you need you can just install the program (size pending obviously).  I don't need a citrix receiver app, I just install the client and it boots up.  I can also port into my home or work cpu without difficulty.  I have used this almost exclusively for the past 2 weeks and still love it.  Although the ipad was never a laptop replacement I can see this tablet being close.  I have a bluetooth keyboard and power point and word are with me wherever.Screen: Very nice very bright.  people have complained that the black isn't black but I found that by fiddling with the adjustments it a pretty good pure black to me.  the contrast is very nice and the high def is great for me. Although like any other tablet it collects smudges, they don't seem to interfere with visibility that much.Sound: Speakers are fine, nothing great but adequate.  Certainly not busy airport loud, but I use headphones mostly.Speed: I am very happy with the speed of internet connection as well as processing.  Another plus is that I can run 2 apps/programs simultaneously without losing noticeable speed.  I'm working on a powerpoint and need info I bring up chrome to one side and get the info.  This is extremely useful.Storage size:  I have the 32 GB, and can see needing more space but with the SD slot you can just add a card and viola you have it.  There is also a 128 GB coming out that should be great.Battery life:I haven't tested it extensively, but I typically plug it in at night and haven't lost power during the day yet.  I use it modestly though.  Not sure how far it'd last if you were on it literally all day.Work use:  I already alluded to this but i am able to do pretty much everything I need to for my business on this it really is very close to being a laptop replacement. (If you have vision impairments (wear glasses, etc) the small screen may be an issue plus it you need a larger display this won't work as well but for me it's great.Apps:  the windows App store is still a bit light although getting better per report.  There's also a lenovo app store which seems a waste of time but there are some exclusive apps there. If all you want is games, the ipad of android may be better, although xbox is getting a larger presence on the windows platforms and I can see them starting to push exclusive content. Just something to think about.Overall durability:  I have been using think pads for almost a decade now from back when IBM still made them and am definitely slightly biased as I think they are hands down the best laptops.  The Miix 2 is definitely in keeping with their reputation for sturdiness.  Now bear in mind its a tablet and I'm not going to go around dropping it just to see, but it certainly feels sturdy and the screen seems tough.Overall: Great tablet I'm recommending to everyone I work with and anyone who reads the reviews on amazon.  I bought a screen cover which I'd recommend anyone buying this to do ( they literally cost only a few bucks) and a evercase thin case for it both of which are great additions to make this a perfect tablet for me.  The case was under $10 when I bought it and is very nice.  Great value for the cost.", "Date": "December 25, 2013"}, {"Title": "Nice Tablet (better than Venue 8 Pro, IMO)", "Author": "B. Harris", "ReviewID": "R9REB02F1M2Y9", "Overall": "5.0", "Content": "Ordered the Miix 2 8 after giving up on the Dell Venue 8 Pro.  Both Dell models I tried suffered from touch issues causing keys to repeat when typing and gestures and taps to be misinterpreted.  Just search online for \"dell venue 8 pro sensitivity\" and you'll find a thread on Dell's forums (but ignored by Dell) about the issue.  It was even worse when trying to use any kind of screen protector.I've only had the Miix 2 8 briefly, but so far I am impressed.  Will update my review and rating accordingly.Won't rehash what others have said better than I can, but I did want to address a few topics that haven't already been covered or with which I differ/disagree.Wifi Speed: I've seen several people mention wifi speed as an advantage of the Venue over the Miix 2.  I believe the problem is that, by default, the Miix 2 wifi isn't taking full advantage of it's hardware. If you go to the Advanced properties of the Broadcom wireless adapter, there is an option to choose \"Bandwidth Capability\".  By default, it is set to only use both the 20Mhz and 40Mhz bands on 11a networks.  This limits the maximum connection speed on 11n networks to 150Mbs.  If you change the setting to \"11a/b/g:20/40Mhz\", this will allow it to connect at the full capability of 300Mbs.  I had a Dell laptop with the same default limitation.Speaker: For me, the speaker volume which others have discussed isn't a huge issue.  The Dell was definitely louder and fuller, but the Miix 2 isn't terrible.Display: I personally prefer the display on the Miix 2 over the Venue.  Both are very nice, but the Miix 2 is clearly brighter.  I also feel that text appears sharper on the Miix 2.  I used my Datacolor Sypder colorimeter on both devices to calibrate the displays.  The Dell was more accurately calibrated from the factory, but the Miix 2 looks better after calibration and has better color reproduction/gamut - ~75% sRGB for the Miix 2 vs only ~65% sRGB for the Dell.USB: Using an OtG adapter, the Venue could only access low-power USB devices like flash drives.  Portable 2.5\" drives or DVD drives simply wouldn't work.  These higher-power devices do work on the Miix 2 without needing separate/supplemental power.Charging: The Venue can only be charged with it's own charging block.  The Miix 2 can be charged from other USB power sources/chargers.Resolution: In researching the available 8\" Windows 8 tablets, I've seen many individuals and reviewers knock them because of the relatively low 1280x800 resolution.  Many people said that the upcoming Thinkpad 8 (with a resolution of 1920x1200) was the one to wait for.  As much as I wanted the higher build quality and specs of the Thinkpad 8, the higher resolution was actually the reason I did NOT want it.  Unfortunately, the Retina world of iOS is a very different environment than Windows 8.  High resolution displays simply aren't handled well in Windows or with Windows applications - specifically classic desktop applications.  One option is to use 100% - in which case UI elements will be so ridiculously tiny on a high PPI screen that they can't be seen on the 8\" display.  The second option is to use Windows' DPI scaling to increase icon and text size, but then the problem is that many applications (and even some aspects of Windows) don't properly support/implement scaling (or don't do it at all) resulting in content that doesn't display properly or is actually less legible/sharp than 100% at 1280x800.  The third option is to run the 1920x1200 panel at a reduced resolution (i.e. 1680x1050) to make elements slightly larger, but running an LCD panel at a non-native resolution will always result in blurry text and is defeating the purpose of having a higher resolution LCD.  Another thing to keep in mind is that if you plan to establish any RDP connections to any other systems from an 8\" Windows tablet, it's not possible to use DPI scaling on remote sessions.I have seen comments elsewhere saying that using a cheap OtG plus power adapter for devices like the Nexus 7 and Galaxy S3 will allow simultaneous charging and use of the USB port.  I'll have to give this a try and see.  This definitely won't work with the Venue.I've also seen comments saying that cheap MHL USB/microHDMI adapters allow HDMI out directly from the USB port without additional hardware.  I will likely experiment with this, too.  Have seen that this option also does not work on the Venue.", "Date": "February 10, 2014"}, {"Title": "A tablet that can work seamlessly with desktop", "Author": "C. Lau", "ReviewID": "RV78XT059BL4R", "Overall": "5.0", "Content": "Got this today.  Just inputted my Microsoft account and all my settings were set up in 5 minutes in the exact way of my desktop settings.  Skydrive, Skype, email settings are all there and sync seamlessly.  Saving a lot of time.  The screen is very good; resolution is fine at this size, no need to spend more money for higher res.  Viewing angle and contrast is superb. Unlike iPAD, this tablet can be used effectively in portrait and landscape orientation. The new atom CPU is super fast.  The touch response is so good.  If you think to get an IPAD mini retina, try this one first or you will be regretted.  At the price of $299, with a full version of Office 2013, and now with real time authoring in Office web apps launched directly from Skydrive, there is no reason to use Google Docs or Apple iWork.Con :  no HDMI output.  Toshiba Encore has HDMI output but it is a bit heavier and more expensive.", "Date": "November 9, 2013"}, {"Title": "Great Choice", "Author": "ANDREW KEITH BISHOP \"Andrew Bishop\"", "ReviewID": "RUFG5IWKWEAW7", "Overall": "5.0", "Content": "This is a really great product. A perfect size for reading books, browsing the web and reading emails, plus it's a full PC. Battery life is about 7 hours and the performance is great. The screen is fantastic and the miix 2's weight is fine for holding in 1 hand for long periods.", "Date": "December 8, 2013"}, {"Title": "This is the one!  Get this Lenovo and stay out of Dell Venue 8 Pro!", "Author": "K. Li", "ReviewID": "R1NYD5RY0S8U6Y", "Overall": "5.0", "Content": "UPDATE:  i bought Dell Venue 8 Pro for 199$ on Microsoft store sale.  The Dell will not charge on home charger less than 2A, miix2 does!  charge using PC usb port?  dell No, miix2 yes!  The Dell just wont charge in the car!  i tried two different 2A car charger, it still wont charge!  miix2 does!Now back to Lenovo miix2 tablet.  This tablet is the thinnest and lightest on the market in 2013 (dont know what 2014 will bring).  The screen is 1280x800. The screen is sensitive, you only need to touch it lightly for it to register, just like your Samsung galaxy. Go take a look at your or friend Samsung Note3, that' how thin this tablet is!  Just like a girl, thin is sexy! haha.  This tablet also very light!  When i hold it on my hand, it doesnt feel heavy at all!  The included usb charger output is 5.2V==2.0A, it' the same output as my galaxy note3 charger!  So you can use your cellphone charger to charge this tablet (Do this at  your own risk! i'm not responsible for damage to the tablet if any)! I tried to use my Samsung Note3 stylus on it, it does NOT work.  So you need to buy Lenovo miix2 stylus.  This tablet has microSD slot and micro usb port (for charging). With microUsb to USB adaptor, you can hook up flash drive, keyboard, mouse, Ethernet connection on it!  There is no HDMI or micro/mini HDMI port.  The CPU speed on amazon showing 1.8Gzh is incorrect! When i go to system info, it said Intel Atom cpu Z3740 @1.33Gzh.  System type:  32-bit operating system, x64 based processor.", "Date": "November 7, 2013"}, {"Title": "A great little tablet", "Author": "barlourd", "ReviewID": "R1DHQMY932FUYK", "Overall": "5.0", "Content": "I have been using this tablet since the first day it came out. I originally purchased it to serve as an eBook reader and for light entertainment on trips, but have found myself using it more than my iPad. Having a full version of Windows in my pocket is amazing and having a the real Office pre-installed is a great bonus. I have been using it mainly for writing reports and performing off-site computer support. On a side note, if you are going to use it for office applications, a bluetooth keyboard is a must. The screen is simply too small to touch type either in landscape or portrait mode.On the performance side, it is nice and zippy, not what you would expect from an Atom processor. I would not suggest using it for gaming or 3d graphics manipulation, but as an everyday computer.I have seen some complaints about the screen and it having lower resolution than a certain competitor's tablet. This is true, though I have not seen any issues. As for color accuracy, I have yet to see an issue with this.", "Date": "November 25, 2013"}, {"Title": "Great tablet for the price that easily becomes a full-fledged laptop equivalent", "Author": "Daddio Dave", "ReviewID": "R1X0G7QYD3DT8W", "Overall": "5.0", "Content": "After researching 8 inch Windows tablets, I settled on the Lenovo Miix 2 8, the Dell Venue 8 Pro and the Acer Iconia W4 as my top three picks based on price and features.  These three tablets have more similarities than differences. HDMI output was not important for me. I'm sure I'd be happy with any one of these, and when I found Lenovo selling their factory refurbished Miix 2 8's for $160, I pulled the trigger. My Miix 2 8 included a copy of Microsoft Office Home and School 2013, a $140 value. I don't really need Office on my tablet (I'm a LibreOffice user), so I downloaded the Office program on my desktop computer and used the provided key to activate it on that machine (Microsoft allows you to move Office to a different computer using the same Microsoft account up to once every 90 days).After using the Miix 2 8 for the past week, I've become a total devotee to these small Windows tablets. It's just like using a desktop computer for the majority of my computer activities (email, web browsing etc.). Of course I wouldn't try editing video on this, but it is quick and snappy and gives me the same user experience as my desktop, in a portable package. My main reason for wanting a tablet was to be able to transfer image files from my camera SD cards to backup thumb drives or portable hard drive while traveling. After seeing what this tablet can do, I have no problem using this as my main computer while on the road. I'll probably even be able to do some initial photo processing and organization with this on vacation.Of course a touch screen tablet by itself has limitations, limitations that can easily be overcome with the purchase of a few accessories. I've purchased the following accessories from Amazon and am extremely pleased with each.  I've included the Amazon item number so you can search for the correct item. Prices are at the time of my purchase. Some have gone down since.Samsung Electronics 64GB EVO Micro SDXC  (Samsung-Electronics-Adapter-MB-MP64DA-AM)  ($40)This memory card gives me a lot of extra space. You can tell Windows to store all your Documents, Downloads, Music, Videos and Pictures folders on this card, which shows up as your D: drive. I also made a folder called 'Programs' on this card and install all my Desktop applications there. This card is pretty fast, so these programs run quite well from this card (I'm typing this in LibreOffice Writer with no lag at all). Any Metro app you use will have to go into main memory, your C: drive. I don't use many Metro apps. I also copied my Windows Recovery partition onto a USB thumb drive and deleted the partition, freeing up over 6 GB of main memory.  I currently have around 11 GB of main memory available on my 32 GB tablet.Lumsing Ultrathin Wireless Keyboard (B00GX0CDU6)  ($22)There are a lot of portable bluetooth keyboards out there. After reading the reviews, I bought this one and find it to be great. It's what I'm typing this review on. The keys have a nice feel while touch typing and the aluminum keyboard is solid enough to not bend or flex when you type with it on your lap. It's about one inch longer than the Miix 2 8 and the same width. It is very thin. This brings my tablet half way to being a laptop.Micro USB Host OTG Cable with Micro USB Power (B00CXAC1ZW) ($5.50)This is a micro USB OnTheGo cable you'll need to use the Miix 2 8 to read USB devices. In OTG cables, lead 4 in the micro USB plug is grounded. This tells the Miix 2 8 that it should act as a host for whatever is connected. Since micro USB standards dictate that there be only one Micro USB port on a tablet, you cannot normally plug your power adapter into the tablet when using this port. This cable solves that problem. You can simply plug your power adapter micro USB cable into the \"power\" pigtail on this cable, which has a female micro USB receptacle. Now I can charge my tablet at the same time that I have a USB device connected. I happen to keep a USB mouse dongle plugged into this port. The use of a mouse gives me a full laptop experience.  You can also plug in a USB thumb drive, or SD card reader. I've also successfully used a USB hub with multiple thumb drives plugged in.Fintie Lenovo IdeaTab Miix 2 8 Smart Shell Case (B00JB57TOU)  ($13)This case fits my Miix 2 8 perfectly, giving it great protection, and looks pretty good to boot. I got it in Navy color. It doesn't add much size or weight to the tablet and nicely holds it in viewing position when I use it in \"laptop\" mode with my mouse and keyboard. There is another case very similar to this one, but the close-up photos suggested this one had slightly better details. It does. A magnet firmly holds the cover closed, but this will not automatically put or wake the tablet to/from sleep.So what started out as a simple tablet to help with my travel photos, has now turned into a fully functional highly portable laptop equivalent. Who would have thought you could get all this for so little money?Update(6/1/14): I decided to try some games on my Miix 2 8, so loaded Supreme Commander 2 onto the SD card. It runs flawlessly with no lag. This micro-computer continues to amaze me.", "Date": "May 27, 2014"}, {"Title": "Nice (and useful) little tablet!", "Author": "JM224", "ReviewID": "R3Q35KKWPYQM7K", "Overall": "5.0", "Content": "After reading mediocre reviews about this tablet, I was slightly discouraged when I ordered it, and honestly, I have to completely disagree with most of the bad ratings. First of all, while Windows 8.1 can be frustrating, it's better than RT and the only OS you can find on most new Windows tablets; besides, you can download Windows 7 and change to that if it's too difficult. Also, the start button is capacitive, which means that you have to actually hold it down for a second for it to go back to the start screen; you cannot simply tap it. I find this to be a useful feature, and I've had no issues with it so far. Also, I do not have any complaints as far as startup or slow storage either; it's not meant to be entirely fast anyway. I've had almost no overall problems so far except that there isn't a second microUSB port so that you can charge the tablet and plug in a USB device at the same time. I find it very useful for editing documents/presentations and playing undemanding games at low settings when I'm on the go and taking my laptop is too cumbersome. This product is perfect for anyone who wants a fully-functional Windows tablet for simple tasks, work, and entertainment.", "Date": "January 2, 2014"}, {"Title": "Best tablet I have ever used", "Author": "D. Chauran", "ReviewID": "R3IDQXGAEBYECC", "Overall": "5.0", "Content": "I love it. It's light, it has great battery life. It's very responsive. It has office, and I can install all of my normal software on it. I even installed Civ 5 on this tablet, and while it wasn't the as fast as it runs on my gaming desktop, it was still playable.Just a few tips for people buying the 32 gb version. Look for articles on moving the recovery partition to a flash drive. This saves you about 8GB of precious disk space. I also moved my SkyDrive, plus default save locations to a Micro SD card, and store my PSTs on the card as well. The result is that i now have plenty of free space for even the larger apps like Adera and Halo Reach.", "Date": "December 18, 2013"}, {"Title": "Fantastic Tablet!!!", "Author": "James Fredrick", "ReviewID": "R2PZHZOUPSL7US", "Overall": "4.0", "Content": "I own an Ipad mini, an android tablet and decided to give windows tablet a go. I'm extremely happy with this product. Lightweight, easy to handle, operating system extremely fast and stable, unlike the android experience, which always seems to have a lag. Tablet splits its time with the mini, 4 stars only because of the lack of apps and the camera on this tablet is not very functional, more a product of Lenovo then windows. Not that I would use a tablet as a functional camera, but there are times when it comes in handy. I'm extremely happy that I pulled the trigger and ordered this tablet.", "Date": "December 7, 2013"}, {"Title": "bought one and returned it, replaced with Miix 2 10.", "Author": "Sean Li \"Sean\"", "ReviewID": "R11RN5G07WXN5R", "Overall": "3.0", "Content": "okay, for those who doesn't know it already, i will list the following issues with this tablet (or any 32G version of windows 8.1 tablet at the time of this review).1. after installing all the windows update and office update, i left with less than 6G (i think it was 5.8G to be exact). Yes, you actual user space is about 6 G out of 32 G. think about it, and think again which version do you want to purchase.2. we all know windows phone lacks apps, and window 8.1 store lacks even more than windows phone. i honestly cannot think about any useful app you can find in the store asides from Nokia and MS.3. legacy app can be run, but it isn't a pleasure simply because the device is too tiny to operate without a stylus. you will be using mostly metro style apps on a 8 inch form factor. see point 2.4. if you say, i don't care about storage, there is a SD card. think again. win 8.1, at the time of this review, does not allow you to install metro app on SD card. so what you say, it is not like app is going to be 1 G in space. well. the wonderful nokia here map can store off line map and combined with the GPS module, make a great GPS device. but WAIT. the U.S. map is about 5 G, world map is about 18 G, and you cannot move them on SD card. so pretty soon you find that 6G user space is really good for nothing.look around, the 32G windows tablet is on a fire sale and is about 200 dollar a piece, from lenovo, toshiba, dell or what have you, but you rarely see 64G on sale, if at all, there is a good reason for it.", "Date": "March 16, 2014"}, {"Title": "unbelievable", "Author": "Roger Wise", "ReviewID": "R2FIKHX2ZESNJR", "Overall": "5.0", "Content": "It's astounding that this screen has a complete computer inside.  If it was just a screen it would still have to be this thick.  Android/iPad may have more apps but they don't touch a full version of Windows!  The \"store\" is sparse but a few things (One Note) are cool.Other first impressions - a few surprises:_I was dismayed to learn about the new \"sleep\" for Windows 8.  It goes into a \"connected\" state which drains battery unless you do a full shut down.  Turn off all notifications and remove them from your start up screen to triple \"sleep\" time.  Mine went from a bit over 18 hours to almost 72 hours._Unlike the Dell, Miix uses any charger, at least the ones I've tried.  Lower power ones will not charge it as fast but you won't be sol if you forget the one that comes with it.  I'm not very happy with Windows 8 power management (see below)_Miracast reportedly doesn't work properly (as of 2/25/14) it does in the Dell._There are no true driving apps but maybe someday.  Dell's Venue doesn't have a GPS at all_It only uses basic styluses (afaik it can't use the Venue's) - I like slimline \"fiber\" ones and the extra long ones sold here: The Friendly Swede Extra Long - Bundle of 3 Premium XXL Micro-Knit Hybrid Fiber Tip Capacitive Stylus Pens 7.3\" + 2 x 15'' Elastic Tether Lanyards (Silver) the length really helps with the larger phone sized screen, it's relaxing.  I want to try a slimline xl._Dell's active stylus is far better than both btw... it's the main thing I missed out on by getting the Lenovo._I got a nice case (still slim) and it has a pleasant grip.  The aluminum back obviously isn't intended to be in contact with your hand and isn't comfortable, but not an issue for actual users.-this is it: VSTN®Lenovo IdeaTab Miix 2 8 8-Inch Ultra-Thin Multi-angle Stand Slim Smart Cover Case, only fit Lenovo IdeaTab Miix 2 8-inch tablet (For Lenovo IdeaTab Miix 2 8, Black)_I can use it with an old Belkin Nostromo left handed game pad, this gives me pretty decent access to keyboard shortcuts and all three mouse buttons.  I also got a blumote and I've installed blumote pc software.  It's far more portable and great for keyboard shortcuts but has no mouse emulation._I use Blender 3D creation software, (it's why I need the Nostromo), performance is fluid until around 100,000 quads.It should play most games compatible with Dx9 - I don't really know.-to charge and use usb devices at the same time you need this: Ultra Compact Micro USB OTG to USB 2.0 Adapter Self Powered My feelings are mixed about this particular one, it's beautifully compact but may exert more pull on the connection that the more wirey versions, especially while charging._I tried installing Chrome browser and lost the beautiful \"modern\" version of IE.  Be sure to create a restore point before installing programs - mine didn't do it automatically and uninstalling Chrome didn't fix IE.  You risk your Lenovo apps when you do a factory-refresh._I bought an intellishield but I'm not using it. It shows smears much more than the glass screen which only shows them at an angle.  Btw it was also hard to install, I've done it easily with iPods but it's hard to get an 8 inch screen to line up \"perfectly\" which is required.  It has gorilla glass and it'll never be in my pocket so I don't feel at risk._Lenovo's facial recognition sign in feature works amazingly well, even in a dark room due to a tiny spotlight._The 64GB version comes with Office Home which among other things has an even better version of OneNote.  No maddening dials, back to good old toolbars and lots of them, nicely sized on the 8\" screen.  OneNote free is very cool too, mostly it's just slower to get things done but it also skips a few key tools.All in all I think this is a better unit than the Dell.  Additionally I've heard that the Dell runs hot which isn't good for the electronics or your comfort.  The prices are coming down, I got mine at another major retailer and in this past week I saw the 32Gig versions both drop $60 on Amazon.  Keep an eye out, at these prices they're blowing the Andropods away.", "Date": "February 25, 2014"}, {"Title": "Amazing tablet, but go for 64MB version", "Author": "Richard De La Torre \"Richard\"", "ReviewID": "R2FF0IKHNQ14UF", "Overall": "4.0", "Content": "I got this tablet as part of a bundle with a Lenovo Ultrabook I bought.  The tablet itself is fantastic.  Light weight yet doesn't feel cheap at all.  The screen is absolutely gorgeous, the colors absolutely pop.  The performance of the tablet is also very impressive. Intel Bay Trail lives up to the hype. I actually have an older Windows 8 tablet running an Intel Atom processor, first gen, and the performance on this Bay Trail tablet is noticeable better.  Much better.That said, it's not perfect.  The cameras, while functional, are nothing to write home about.  Pictures in what I call house-lights (ie at night in a house), come out grainy and yellowish.  The speaker is rather paltry, though I've yet to own a tablet that had anything but paltry speakers, so that's not so much of a knock on the Miix 2 as it is a statement on just how poor speakers continue to be on tablets.  Finally my biggest gripe is the enormous amount of space Windows 8 takes up. Even after uninstalling McAfee and even Office (as I don't see myself doing any work on an 8 inch screen), I found the drive space on the app to fill up after installing just a handful of apps.  As I said, this was bundled into my Ultrabook purchase, but should I ever decide to purchase a Windows 8 tablet again, I would never purchase one that didn't have at least 64 gb of storage (for the record my older Windows tablet had 128 gb so that was never an issue).  This could easily be resolved if Microsoft allowed users to install Windows 8 apps on an SD card for example, but that's just not possible at the moment and as I said, 32 gb just doesn't cut it.Would I recommend this particular tablet?  It depends. If you're just going to do some web surfing, and watching Netflix, or reading an e-book, or listening to music on the cloud, absolutely.  However, if you're looking to install a bunch of apps or games, or want to have a camera that's halfway decent, look elsewhere.  (for the record, the games run fine - except for Halo Spartan Assault which suffers from display issues that are supposed to be fixed in an update soon - but there's barely enough space to install two maybe 3 high quality games).", "Date": "January 25, 2014"}, {"Title": "OK, but for the same price the Venue 8 Pro is better", "Author": "J. Cohen", "ReviewID": "R30J9KVCHA1CIZ", "Overall": "3.0", "Content": "I ordered both this and the Venue 8 Pro at the same time to compare and contrast. While this Lenovo offered a good first impression - it felt a bit lighter, the screen was brighter - digging in further left me with an obvious choice to keep the Dell.The main issues are with the speaker and the screen. The speaker is extremely tinny, quiet, and yet still distorts when turned all the way up. It was the worst combination of poor sound quality combined with being enable to hear it.The screen does get bright, but at the expense of low-light visibility. Whether auto-brightness was turned on or off, I couldn't make the screen dim enough to be comfortable to be used in a dark-ish room. Whether on the bus at night or in my room, the screen was still painful to look at when turned all the way down. There was also a ton of backlight bleeding.The rest of the details you can get from other reviews for this and the Dell. The device is fast, immensely capable, super-portable, and really impressive overall for the size and price. Just beware of these issues if they're important to you.", "Date": "January 20, 2014"}, {"Title": "Great little tablet", "Author": "LisaG", "ReviewID": "R7RF74JB8H9C5", "Overall": "5.0", "Content": "Finally a windows tablet that is as good as any iPad or Android tablet out there and it can do so much more.  Only real weakness is the windows app store, as it is lacking a few of the most popular apps out there but even that is not bad.  One app I hear people complain about lacking in windows apps is candy crush, but you can just bring it up in a browser on Facebook and play it just the same if you really want it.Since this is a full blown version of windows, you can use it just as you would a laptop.  I have a small Bluetooth keyboard and I use a micro USB adapter to add a wireless mini mouse and this setup functions pretty well in a pinch.  Even though storage is a bit limited in this model, I still have about 7Gb free after installing everything I need and I added a 64Gb micro SD card for keeping my music and photos.So considering the size, the cost, and all the other factors it really is a great deal and a nice traveling companion that can do most of what a laptop can do when you need it.", "Date": "December 26, 2013"}, {"Title": "Lenovo and my GPS", "Author": "Amazon Customer", "ReviewID": "R28HFPJDQ8DMRA", "Overall": "5.0", "Content": "I chose the Lenovo because I needed a Win 8.1 device. This was mainly so that I could plug my USB connected GPS and upload my bicycle riding results to Strata. I also wanted to be able to load a map route into my GPS. The Lenovo does all this flawlessly.", "Date": "April 20, 2014"}, {"Title": "Lenova has non-existent product support", "Author": "Raymond Wee", "ReviewID": "R14GUWYDFM8J02", "Overall": "1.0", "Content": "This was an okay product totally let down by Lenovo's incompetent software support.  There's obviously some driver issues because for my set, the touchscreen will stop responding after a while that can only be fixed by a forced reset affecting the usability majorly.  And this is something that's affecting quite a number of other owners going by a simple Google search.  And while Dell and Acer have upgraded their display drivers a few times to support mirroring for Miracast, Lenovo don't seem to bother with even one update.This will be my last Lenovo product.", "Date": "May 18, 2014"}, {"Title": "Touchscreen issues with Insufficient response and Support from Lenovo", "Author": "Ryan Palmer \"It Junkie\"", "ReviewID": "R1NA5HB9IZMF45", "Overall": "2.0", "Content": "I bought this tablet for my girlfriend for her birthday. A few weeks later I purchased a Dell Venue 8 Pro for myself.Comparing the 2, I really did feel like the Lenovo was a better unit. I liked the fit, finish and construction a little more then the Dell, and honestly in my mind it seemed slightly faster.That being said, the touchscreen started randomly not working on the unit. I looked around online, and found a thread on the Lenovo forums that covers the issues[...]My girlfriend contacted Lenovo support about the issue, and was told to reset the unit, and not install windows updates or to install them one by one.While this is a \"Solution\", it is not practical, or reasonable to expect a user to reset their device and test every single windows update, expecting that it could be the one that results in their touchscreen not working.Lenovo currently doesn't have a answer to the problem, and exchanging the unit for another Miix 2 won't necessarily resolve it. Until they get their touchscreen drivers worked out with windows 8.1, the unit is going back, and is going to be traded in for a Venue 8 Pro. While the Dell Venue 8 Pro has its own issues, at least the touchscreen consistently works.Would have liked this to be a great birthday present, but instead it's been an exercise in frustration for my girlfriend, and a spoiled present.", "Date": "April 29, 2014"}, {"Title": "Good value for the money", "Author": "LarrySky", "ReviewID": "R36F7O47SGT0MQ", "Overall": "4.0", "Content": "All I do with this is light surfing/music listening.I'm Windows centric so Android is a pain in the ass.External printer support up and running in 5 mins. Android? (Takes a paid utility)Added a 64G SD, (slot is twitchey) enough room for music, portable apps etc.BT mouse added no issues and I like a mouse input better than poke.Like the full version of windows included would be better if it was x64, next time.Remember its a tablet small light easy to carry.Need horsepower, space, speed, options thenuse your laptop.", "Date": "April 21, 2014"}, {"Title": "Would definitely buy it again.", "Author": "Viorica Bragagiu", "ReviewID": "R1F0UZ8CC7RV7N", "Overall": "5.0", "Content": "I bought this tablet because it had windows, was very thin, light, and had a very pleasant to the eye design. It did not disappoint. Would definitely purchase it again.", "Date": "April 17, 2014"}, {"Title": "Nice Windows 8.1 tablet", "Author": "Win", "ReviewID": "R1C1EOWOPCHNYF", "Overall": "5.0", "Content": "Speedy for my needs. Nice, bright screen. Good battery life. Runs Windows well. Bluetooth hookup easy. Wi-Fi as good as anything else in my house. Runs well with free Classic Shell when I need the old Windows desktop interface. I like the new, speedy Intel Atom processor.  64gb version +32gb memory card provide all the storage I need.Lenovo support site leaves much to be desired.  Detailed knowledge about newer products is lacking on site.Serves my needs for lightweight, portable Windows computer very well. I put a well known free office suite on this tablet,but don't expect to use it that much.  So I don't miss Microsoft's offerings of this kind.If you need that old Windows desktop/start menu interface, just load the free Classic Shell and be done with it. On this smalltablet, I boot into the new Start menu because it works well on smaller screens.", "Date": "April 13, 2014"}, {"Title": "Exactly What I Need", "Author": "dasn0wman \"dasn0wman\"", "ReviewID": "RDQ6FPMAGI911", "Overall": "5.0", "Content": "I want a computer that I can use to write code while in bed so this means Windows 8 OS because it is the only full os on a tablet.  Would love to have Mac OS on a tablet.Previously tried the Sony Viao Tap 11 but it was just too big and way too heavy.  The size of this tablet is perfection.  You will be able to hold it for long periods of time while in bed.  The resolution is also perfect because it is big enough to navigate in desktop view which was my primary concern for a tablet this small.I have a feeling I will be using this computer a lot as I'm really lazy and like to sleep all day.  I was going to get the Dell Vue but read too many negative reviews.  This one has a lot as well but I finally bit the bullet and tried it out.  I think you will get a lemon now and then but lucky for me, everything works great!The Miix2 is a very sexy machine with a metallic back that you won't find in the Vue.  The weight is more hefty than an Ipad Mini but the heft and metal of the Miix2 makes it feel solid!  And don't be concern about disk space because Windows is not like those nasty people at apple restricting you from using memory sticks, etc.  I use a wireless external drive and plus this comes with free cloud storage from Microsoft.  Lastly, this will be the cheapest computer you will ever buy!", "Date": "April 10, 2014"}, {"Title": "Great tablet", "Author": "YangYoon", "ReviewID": "R3IXVA31KAJU17", "Overall": "5.0", "Content": "I read every review available, tried the venue 8 and the miix2, and I landed on the miix2, and I am very happy with it. Its super light, has GPS, great screen, is very snappy, and battery life is awesome. I do see why some people would prefer the Dell, but in my mind, the GPS and the fact its lighter, made up for the fact you may be able to say the venue feels more solid.I have personally had zero issues with the miix2, love it and would recommend it to anyone. I still cannot believe how cheap this thing is.", "Date": "April 6, 2014"}, {"Title": "Lenovo miix2 8 performance as well as expected", "Author": "Liu Man Fai", "ReviewID": "RLWSBWATUA1E2", "Overall": "5.0", "Content": "Item received in excellent condition. Maybe I had the wrong impression when I thought it came with MS office. Performance is excellent.", "Date": "April 2, 2014"}, {"Title": "A good machine, hobbled only by the lack of native Windows 8 apps.", "Author": "J. E. Romeo", "ReviewID": "R38HI16IBRIPJY", "Overall": "4.0", "Content": "The tablet itself is good.  I would say great, but the battery life is a little less that expected (and considerably less that promised).  If you can live in the world of Windows 8, the tablet is a dream to work with.  If however you have to spend a lot of time on the desktop with legacy apps, well.... the experience is less that ideal and really needs a stylus to work for any length of time because everything is so small when scaled down to the 8\" inch screen.  It is this (and only this) time that I wish you could go to a lower resolution than the tablet allows.So overall, the form factor is nice, the tablet works well, but is hobbled by the lack of apps that are designed to work in the Windows 8 environment.  But as a Kindle reader, a web browser, and/or e-mail type tool, it works very well.", "Date": "March 31, 2014"}, {"Title": "Lenovo Miix2", "Author": "zauja lahtaw", "ReviewID": "R1170P57JNTEVT", "Overall": "4.0", "Content": "It is a reliable one. It does not give me any problem at all. After updating everything, you will end up with around 8G left in the internal memory. That is the only concern I have with this one. Also it won't let you choose the drive when you would like to install something. Or may be I don't know how to do it.", "Date": "March 31, 2014"}, {"Title": "I love it", "Author": "gustavo", "ReviewID": "R1K5XTWMG1MY7C", "Overall": "5.0", "Content": "very good product", "Date": "May 9, 2014"}, {"Title": "Excellent tablet!", "Author": "Kate G", "ReviewID": "R2ICWHZC2RRIGV", "Overall": "5.0", "Content": "This tablet is one of the best I have used in awhile!  The picture is clear and beautiful?  Seller is amazing in all they offer in service, product and delivery!  I highly recommend!", "Date": "May 6, 2014"}, {"Title": "Review", "Author": "Carlos E.", "ReviewID": "RG50APADSKS0J", "Overall": "5.0", "Content": "I rated like this, because it was exactly what I wanted and I'll recommend this product to each person that is looking a good tablet it's works well", "Date": "May 6, 2014"}, {"Title": "Cool", "Author": "cb", "ReviewID": "R2185V7D0OILKU", "Overall": "4.0", "Content": "All in all it is an okay device. It's a little bit sluggish to respond every now and then but good for the cost.", "Date": "April 27, 2014"}, {"Title": "I truly enjoy it", "Author": "martin roman", "ReviewID": "R29KJ4CBS3GZQ1", "Overall": "4.0", "Content": "Nice device I wish it came with its own stylus.it is light and makes perfect sense for portability. Good job lenovo", "Date": "April 24, 2014"}, {"Title": "Nice little windows 8.1 tablet", "Author": "Hector Arias", "ReviewID": "R2YT5XK0Z49YNM", "Overall": "5.0", "Content": "I got a steal with this little tablet.  It came with a laptop 14in. with an i7 processor.  This deal was for $699.00 but since they were all sold l was able to get the display model for $100.00 less. So, l got all for $657.00 after taxes.To my review:In a few words it is like having a pc in the palm of your hands. Very easy to set up. I added it to my home network and automatically detected my network printer...YES!!!!... since l have a subscription to office 365 it installed with no issues at all.  I increased the display resolution to 150 and it looks perfect......yeah, l am over 40 so.....l am starting to have problems reading small print.  Wish l was 20 or 30 again.I ran nextflix, you tube and skype at the same time and no lack on speed at all.  This processor is pretty fast. I was just doing a test. I use this tabler only for browsing and checking email on the go BUT you know you have a full pc as well if you need it.  I have to agree with another reviewer here....if you want horsepower then just get a regular laptop.  You only have 8GB space left in the hard drive if you get the one with 32GB.  Adding an extra 64GB micro sd card does the trick if you want to install more programs or just add music and movies.You will not regret if you get this tablet before they stop selling it since summer is around the corner and new gadgets will take over.I have to be honest here......l did not need either one but just could not let pass this deal  $699.00.......just like a little kid.....mom l want it.", "Date": "April 23, 2014"}, {"Title": "perfect.", "Author": "Natasha Rochelle", "ReviewID": "R1APYMJWOCOZH1", "Overall": "5.0", "Content": "I bought this for my 13 year old, home-schooled son for his birthday. best gift he's ever received. He keeps in contact with his friends, no cell phone bill, and it frees up the home computer for mom/", "Date": "April 11, 2014"}, {"Title": "great servce", "Author": "Sid", "ReviewID": "R3IW72K29FZ3HQ", "Overall": "4.0", "Content": "Lenovo Mii2Works good, looks good and runs good, it meet my expectations.I would purchase this tablet again. Fast shipping and excellent service.", "Date": "April 4, 2014"}, {"Title": "good good", "Author": "hyesoo", "ReviewID": "RGDVQN0AQTWDI", "Overall": "5.0", "Content": "very good for me.i have already dell venue but bought again win 8 tablet lol!!both tablet good good", "Date": "April 4, 2014"}, {"Title": "Nice win8.1 Tablet", "Author": "Carl Zhong", "ReviewID": "R1PQJCIY5KPPBC", "Overall": "5.0", "Content": "It is bright and fast！Thin and light . But 32GB is very tide to use! Thanks god it has a micro-sd slot!!", "Date": "April 4, 2014"}, {"Title": "Less Useful Than a Smartphone", "Author": "MaxSmart", "ReviewID": "R17BQKVYPPXHR3", "Overall": "2.0", "Content": "We got this, thinking we could tether it to a mobile hotspot and it would offer us all the functionality of a smartphone, but with an easier to use interface that comes with the larger screen.  We've found it to be far less usable than our smartphones.First, the GPS - DOES NOT WORK with most applications you'd want to use, such as Google Maps.  It apparently isn't compatible with the Windows 8 location service, which is what everything relies on to track position.  It only seems to work with Bing Maps, which I could care less about.Second, Windows 8 is terrible.  I had experienced it on desktops, and was reassured that the reason it was terrible was because it was designed with tablets in mind.  In reality, it's even worse on a tablet.  I quickly installed the Classic Shell to make it somewhat resemble the pre-ripping-off-Apple era of Microsoft Windows, so I could have a desktop on which to manipulate files and folders.Third, the claim is has USB.  It has a micro-USB port - NOT a real USB port you could plug a keyboard, mouse, USB hub, or thumb drive into.  Which is a shame, because it would be nice to have a usable user interface.  The on-screen keyboard is hard to use while holding the device, and if you put in on a flat surface, the rotation feature kicks in randomly while you're typing.  And clicking on things on-screen DEFINITELY requires a stylus (which is not included) unless you have toothpick-sized fingers.", "Date": "April 25, 2014"}, {"Title": "Not really impressed.  I'll wait till they improve on the tablets.", "Author": "Remus Z \"Car Lover\"", "ReviewID": "R2IG6WNJT6LYVM", "Overall": "3.0", "Content": "The lenovo tablet was a bit of disappointment.  I've barely had it for a week and the screen has frozen on me 3 times.  Had to do a hard reset by holding the volume up and power key for 5 seconds.  The weather app that came installed did not want use my location.  Tried it a few times with no success.I would love the tablet if they worked out the kinks.  I ended up picking up a Dell Venue 8 64GB from Costco and will see how that works out.  I'll keep the Dell Venue for now as it has not frozen up on me.  Hopefully 2014 is a better year for window tablets.", "Date": "December 4, 2013"}, {"Title": "Not my favorite tablet", "Author": "J. Tynjala", "ReviewID": "R104X7WY5YVCK", "Overall": "3.0", "Content": "I frequently find battery life down to 50% or so after a day of light use. It sometimes enters a state where pressing the power button won't turn the screen on (but the capacitive start button vibrates if I press it, so it hasn't turned off), and I need to force boot it by holding the power button down for several seconds. I've seen Windows laptops do this sometimes over the years when coming out of sleep, but I'm surprised to see it happening on a tablet where it should be expected to go in and out of sleep often.As a Windows user on my laptop, I felt right at home, but I feel that Android and iOS are more polished on tablets. I'm looking forward to future updates to Windows that will refine the experience a bit more.", "Date": "November 27, 2013"}, {"Title": "going back to Android", "Author": "Alexander I Mills", "ReviewID": "R2OU513KTXQM9I", "Overall": "1.0", "Content": "I had to send back the first idea tab because there was an issue with the wireless adapter. The replacement IdeaTab that was sent to me had other issues. There was some problem with the battery because it would not hold a charge for more than one hour. It would also randomly update Windows and turn itself off almost every day. It seems like the power would be lost midway through the update as it would do this over and over again. It also seems like the micro USB port port was faulty as it would not always charge when plugged in. All in all not a great experience.", "Date": "March 3, 2014"}, {"Title": "Lenovo Miix2", "Author": "Harvest1", "ReviewID": "R3C5EVBJ97JAX9", "Overall": "4.0", "Content": "First, Miix 2 is a stupid name or designation for a computer.  I have yet to actually load down the necessary protection programs, but the preliminary comment I wish to make is that the computer tablet was very poorly packaged.  It had no padding on top, or on the bottom of the shipping box.  The Miix, in its original package was just placed inside the shipping box with absolutely no vibration protection padding.  That, to me as a consumer, is unacceptable.  I will rate the computer itself later.", "Date": "December 30, 2013"}, {"Title": "Lenovo quality.", "Author": "Gregory Sharrow", "ReviewID": "R89QHJ3V5S5U6", "Overall": "4.0", "Content": "quirky but it is Win 8.1 Sloppy touch screen response. No support from Lenovo. No listing for model. And it is an 8\" tablet, so that makes it workable. It has the new Intel Atom Bay Trail quad-core processor, which makes it a livable laptop computer. It runs a full Windows 8.1, Not Win RT, and comes with the free current student version of MSOffice. I'm getting used to using Win 8 via touch-screen. Plus how to access items like \"Control panel\" for mods.I've enhanced my opinion of its usefulness, and I will start carrying it in place of my Nexus 7 Android tablet.", "Date": "December 2, 2013"}, {"Title": "straight garbage!!", "Author": "L. Wright \"mont345\"", "ReviewID": "RUQE8E51HT57Y", "Overall": "2.0", "Content": "received tablet with marks on back even tho it was new, used tablet for 1 day then the next day would not power on, should have listened to other reviews about this table, can't believe how terrible this tablet is. i have a nexus 7 2013 and it is light years better than this...Why can't companies make a decent windows 8 tablet!!", "Date": "December 22, 2013"}, {"Title": "Immediate buyers remorse", "Author": "netjet \"netjet\"", "ReviewID": "R1FQ9A2EEZIE49", "Overall": "2.0", "Content": "Hardware seems ok.  Windows 8 is horribly frustrating.When I have to Google on how to simply close an app, something is wrong.When I have to use my Windows 7 machine to Google on how to Google on Windows 8, something is broken.I'm regretting not purchasing an Android or iPad instead.", "Date": "February 7, 2014"}, {"Title": "excellent hardware ... but no swype onscreen keyboard", "Author": "cerealus", "ReviewID": "R24YBFVM16X2P5", "Overall": "4.0", "Content": "this is a 4-star device, all day long ... it comes with no keyboard ... at which, you're left with the onscreen keyboard ... it only automatically appears and resizes your apps accordingly, when in \"metro\" mode ... in \"desktop\" mode, you need to tap it from the taskbar (not horrible) ... what is horrible is that, in either mode, it's not swype-capable ... if you don't know what that means, maybe it's not a big deal for you ... I've been using swype keyboards on android for almost 3yr ... it's not as fast as a real keyboard ... but it's a lot closer than pick n poke ... this is no worse than any other windows device (sans real keyboard) ... so this is really a star against microsoft ... with all the brew-ha-ha over windows 8 ... and the resultant 8.1 ... not addressing this is huge! ... they'll probly sell millions of these ... but so will apple and samsung ... not that I care ... but boy! ... microsoft simply can't get out of their own way ... had they implemented a swype onscreen keyboard ... automatic in both \"desktop\" and \"metro\" modes, apple and samsung would (eventually) be in some very serious pain ... as of yet, windows tablets are a 2nd-class device ... if you need to type more than 3 words at once ... and know how ... the resolution is very nice for the screen size ... no, it's not 25,000x19,000 or whatever android's up to ... but it's plenty nice ... however, control panel doesn't allow you to set text bigger ... or even change the resolution (it does ... but only to one other setting, that shouldn't be afforded) ... this isn't a huge issue, except that with fingers larger than an average 3yr-old's, tapping little x's on brower tabs can be a real challenge ... I've since taken to using an old bluetooth mouse I had laying around ... thankfully, my la-z-boy's leather ... and the armrest is huge ... makes the perfect mousepad ... in fact, it's actually quite comfortable ... also, just today, I have a logitech K810 bluetooth keyboard connected, and writing this review ... nearly as fast as I can, at work ... awesome keyboard, BTW! ... I've also rigged up a little stand so I can see my tablet with 2 hands on the keyboard (no, it's not cardboard and duct tape ... but it's close!) ... basically like a regular laptop ... which is what I'd recommend over this device ... if you know how to type ... and want to ... ever! ... the transformer is a head-n-shoulders better device ... and I bought one ... but, it had major issues (rebooting itself, locking up, ???) ... so I had to return it ... I still wanted something that I could open more than 2 browser tabs w/o having to reboot (ala android) ... and while I'm not supposed to go to pages that use flash anymore, I still do ... and it's nice when they work, as intended ... aside from running bonafide windows programs, and being able to print on nearly any printer in the world, w/o having to do a thing! ... that's all this device currently offers, over android ... so if you don't need any of those, and still want to type faster than 2 words per minute, I'd recommend an android device ... otherwise, until microsoft can deliver windows with a good swype-capable onscreen keyboard, for a tablet, a transformer-type device is definitely the way to go ... or a laptop ... or, build a redneck tablet/keyboard stand and pick up a bluetooth keyboard n mouse", "Date": "November 27, 2013"}, {"Title": "Lenovo ok - Windows 8.1 experience is similar to functionality of IOS 2.x at best", "Author": "John Gerun", "ReviewID": "R2W2J1CGW5ZFW", "Overall": "1.0", "Content": "I never write reviews, but really felt so disappointed in the Windows tablet experience that I really need to express it.  I bought this device to have an integrated solution with Microsoft Office for my desktop and not having to haul my laptop Dell E4310 around on presentation, business trips, etc.The newest Windows 8.1 tablet from reviews and ravings give the impression that Microsoft has woken up - sorry no they have not.  I wanted something that would allow me to correct contracts on screen with a stylus - make comments, etc.  Unfortunately this device and more-so Windows 8.1 implementation is a long-long-long way away from that and based on what I see will not get there anytime soon.So first let me start with tablets / phablets / PCs that I own - so, I have somewhat of a valid perspective:- iPad first generation- iPad 3 with retina display- iPad mini- Nexus 7 second generation- Note 10.1 2014- Note 3- Macbook Air- Macbook Retina- Dell e4310- LGA2100 desktop with the latest cool stuffOn technology, my first computer experience was an Apple 2E, then IBM PC, etc.  I have programmed and used computers since 1981.  My main machine for work is the Dell e4310 (I have an office and home office setup that is identical with docking station and dual 27' Samsung monitors).I decided to purchase this device at the promise of Windows 8.1 having a single under experience to your laptop and desktop.  I have to say the Windows 8.1 interface is terrible - way too many gestures, too many tricks to remember - the Note 10.1 has garbage creep - but Windows is champion on that.Now to the actual hardware:I purchased the 64GB model.  With the base (no software installed) you only have 43GB left (if you want one of these Windows tablets make sure you consider this - I would not get a 32GB version - leaves you with 10-11GB for all apps and data).  Yes, you can plug in a microSD up to 64GB but even the fastest cards are around 1/3 the performance of the onboard SSD.The package has a nice feel and is solid, I purchased the cover with the stylus - it has a magnetic clip on - again clean construction and feels nice in the hand.Screen is listed at 1200 x 800, when compared side-to-side with my original iPad mini, the mini destroys it on quality and appearance of text, photos, etc.  This is true even when you zoom items.Stylus and cover.  First, the cover does not put the tablet into sleep mode - this can be achieved on any Android or iOS tablet for about $4, this cover costs $29 on Amazon - truly a joke.  As for the stylus, well I read reviews that the touch interface on new Windows 8.1 devices has been much improved, etc - I am not sure what devices they are using, it's not this one.  When writing text with the Lenovo stylus at best it would pickup every third movement.  Writing the letter T was the most interesting, the Miix 2 was able to read the motion of the stylus for the horizontal line every-time and would miss the vertical every-time.  Totally useless and going back for a refund.Camera.  The camera for quality is what you would expect from a tablet - decent, not great.  I took several pictures in bright and dim light as well as outside.  All were reasonable and usable.  The biggest issue is the orientation when taking a photo.  If you have the Miix 2 in landscape mode, the camera shows you the photo in portrait with a letterbox cutoff on the screen - come on Lenovo - how about rotating it and using some of that screen resolution.  Again a basic feature that is missing and very irritating.CPU - the new intel chip is fast and performs well, but has video skips and hesitation that it should not.  A relative test that was fun was a game that my son plays - Minion Run.  He uses the iPad 3 Retina.  I downloaded this game for the Miix 2.  Ran them side by side.  The A5x chip in the iPad blew away the performance on this new Lenovo sad to say - the A5x is 2 years old now.  Minion Run on the Lenovo had choppy video and pauses, also movements of the Minion from side to side and jumps were delayed.  So, where is the performance on the device - I guess for Microsoft Office loading or scrolling the screen?Buttons and setup.  Power button and volume are placed as they should.  Power works as it should.  Volume is interesting though.  As you adjust volume up and down a normal user interface should indicate the level of the volume - Windows 8.1 does not allowing you to guess where the level is.  I found this out the hard way playing with the device in the bedroom at 1:30 am and clicking on a video clip - full blast audio that woke my wife up and subsequent profanity.  Come on Microsoft and Lenovo - how about a visual indicator of where the volume is set - Windows 7 has it in the tray bar???  This is a really bad mis-step.  On the Windows home button I did not have the issue that others mentioned, but again did notice that Windows 8.1 does not always react to the pressing of the Windows home button. The Miix 2 (once volume was turned off) would vibrate when keys were depressed, including the Windows home button - well it did, but Windows 8.1 OS took no action.  Again another bug or issue?Now the main part, the Windows 8.1. OS.  Microsoft are you kidding???  I have used your product since DOS.  All my home machines use Windows 7.  Since the release of Windows 8 (I did a store test of one of the machines, I can conclude what a joke).  Reviews show that 8.1 is a vast improvement - on what basis?  Here are my issues:- why are there so many gestures?- why can't I just press a home button (like iOS, Andriod, Steam, Linux, etc) to get back to a home screen or metro screen?- the Windows button on the Miix 2 only worked on the 2nd press to return me to metro - why?- why not have it work on a single press, also, why not allow settings to allow it to toggle between that and desktop mode?- I read that IE11 is fully developed for a tablet experience - if yes, no-one at Microsoft has ever used Safari or Chrome, none of the in screen \"Gestures\" are active.  For instance if you read Yahoo news they on the other browsers and OS implementations you can scroll pictures to get to the next story - not on Windows 8.1 and IE 11.- can you please tell me how you terminate an active application - maybe something like x out?  Does not seem to exist, nor does Microsoft tell you how to do it.  Again iOS and Android destroy in this area.- Access to all applications - only available through Metro with a swipe up gesture - huh???  Why can't I get it from the desktop - I may want access to an application that I run once per week - do I have to pin it to the desktop?  No, you have to click the home button (twice) get to metro, then swipe up and find the application and then execute it, then find what you were doing on the desktop again with four more gestures.Need I continue?  For anyone reading this, it is a total waste of time and money to purchase any Microsoft Windows 8.1 tablet unless you enjoy mediocrity.  If you want handwriting recognition - Note 10.1 or Note 3.  For the rest, iOS products are my favorite, they just work and are stable - my dream device would be a 5.5\" iOS device with an Active Stylus.To sum up this device and Windows Tablets overall - what is Microsoft thinking?  A tablet is not a desktop and Windows 8.1 is neither.  That's why Apple and Google have separated them.For the Lenovo Miix 2.  The only reason that I may keep it is for my son's video collection.  Having 43GB free and capability to add an additional 64GB microSD would let me store a lot of windows movie and MP4 files without headaches of workarounds on iOS and Android.  Also, it supports Flash - big, big issue for iOS and Android.  But is it worth it to have a video player for $350 - not sure?", "Date": "December 18, 2013"}, {"Title": "IS FAR FROM MY ESPECTATIONS", "Author": "Amazon Customer", "ReviewID": "R25OOGTCUJQ0TD", "Overall": "2.0", "Content": "You need magnifying glass for use it, it is very far from the android system. Windows is not yet a system for tablets.", "Date": "December 20, 2013"}, {"Title": "wish it would reliably turn on", "Author": "nagendra Mishr", "ReviewID": "RQ1G8T1LSBYEX", "Overall": "1.0", "Content": "worthless piece... works ok when it turns on / if it turns on... compare to the Dell Venue Pro 8\"... that is real the star winner.", "Date": "December 9, 2013"}, {"Title": "DONT BUY THIS--PIECE OF CRAP", "Author": "ALOMGIR ABDUL MANNAN MIAH", "ReviewID": "R3AK7ESEHR2ZA5", "Overall": "1.0", "Content": "DONT BUY THIS--PIECE OF CRAP. DOES NOT WORK AS EXPECTED. SOPMETIMES RESTARTS. AUTO WAKE UP NEVER WORKS. PIECE OF JUNK. I WASTED MY $300 ON THIS CRAP. DONT BUY THIS.", "Date": "February 12, 2014"}, {"Title": "A protoype at best", "Author": "Carissa R.", "ReviewID": "RT6AORR9072ND", "Overall": "1.0", "Content": "I won't waste even more time on this product by writing a big review- simply put it is a glimpse into the future, a prototype at best to be used to show that we can \"imagine\" (and it will take some imagination) how it will be to run a fully functioning operating system on a tablet.  Windows 8.1 (Microsoft) can take the full blame for the failure of this product; the operating system (Win 8.1) is slow, sluggish and demanding on the processor and memory that it resembles a computer today running XP.  This does not function like a tablet should for 2013, the first iPhone was better put together, heck, LG probably makes a smartphone more usable than this.I don't recommend this, but I VERY MUCH look forward to SSD tablets that functionally run full operating systems with great components and plenty of drive space!  On that note, we should be demanding that companies like Microsoft, Apple and Samsung release excellent top technological devices with components that rival any laptop because the technology is here and it's cheap!  They're milking us and slowing their own evolution.Much love", "Date": "December 4, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F2ENTYI"}}