{"Reviews": [{"Title": "ONLY LASTED TWO MONTHS!!!!", "Author": "Kristina M Utley", "ReviewID": "R3B0AC56JXX1XG", "Overall": "2.0", "Content": "Everything seemed great especially for the great price BUT..... Stopped charging. Super bummed so I hope this is helpful for someone considering purchasing", "Date": "December 23, 2013"}, {"Title": "Excellent tablet for all round purpose. Unbeatable price!", "Author": "rpv", "ReviewID": "RZSM6D8VBMD9L", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3FH3XPA9127CCembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3FH3XPA9127CCrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3FH3XPA9127CCchiDiv\").innerHTML = document.getElementById(\"cv_mo3FH3XPA9127CChiddenPre\").innerHTML;\n};\ncv_mo3FH3XPA9127CCrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3FH3XPA9127CCso;\t   \n\n\nfunction cv_mo3FH3XPA9127CCloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3FH3XPA9127CCso = new SWFObject(swfLocation, \"cv_mo3FH3XPA9127CCAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3FH3XPA9127CCso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3FH3XPA9127CCso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3FH3XPA9127CCso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3FH3XPA9127CCso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3FH3XPA9127CCso.setAttribute(\"height\", swfHeight);\n          cv_mo3FH3XPA9127CCso.setAttribute(\"width\", swfWidth);\n          cv_mo3FH3XPA9127CCso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3FH3XPA9127CCso.write(\"cv_mo3FH3XPA9127CCflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3FH3XPA9127CC', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3FH3XPA9127CC';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3FH3XPA9127CC', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3FH3XPA9127CCloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3FH3XPA9127CC\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1T700LUGOF76A\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1T700LUGOF76A\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RZSM6D8VBMD9L\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1T700LUGOF76A/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3FH3XPA9127CCduration')) {\n      document.getElementById('cv_mo3FH3XPA9127CCduration').style.display='none';\n    }\n    cv_mo3FH3XPA9127CCloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3FH3XPA9127CCloadSwf(movieID, playerVersion) {\n   return _cv_mo3FH3XPA9127CCloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3FH3XPA9127CCnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3FH3XPA9127CC', 0, h);\n}\n\nfunction cv_mo3FH3XPA9127CCresetPlayer(w,h,bw,cc) {\n  cv_mo3FH3XPA9127CCnewHeight(h);\n\n  cv_mo3FH3XPA9127CCso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3FH3XPA9127CCso.addVariable(\"cacheCode\", cc);\n  cv_mo3FH3XPA9127CCso.setAttribute(\"height\", h);\n  cv_mo3FH3XPA9127CCso.setAttribute(\"width\", w);\n  cv_mo3FH3XPA9127CCso.write(\"cv_mo3FH3XPA9127CCflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3FH3XPA9127CCRollOverImg = new Image();\ncv_mo3FH3XPA9127CCRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81NmdTEqaFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3FH3XPA9127CCpreplay = document.getElementById('cv_mo3FH3XPA9127CCpreplayImageId');\nif (cv_mo3FH3XPA9127CCpreplay) {\n  cv_mo3FH3XPA9127CCpreplay.onmouseover = function() {\n    cv_mo3FH3XPA9127CCpreplay.src = \"http://ecx.images-amazon.com/images/I/81NmdTEqaFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3FH3XPA9127CCpreplay.onmouseout = function() {\n    cv_mo3FH3XPA9127CCpreplay.src = \"http://ecx.images-amazon.com/images/I/81NmdTEqaFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3FH3XPA9127CCpreplay.parentNode;\n\n  var cv_mo3FH3XPA9127CCcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3FH3XPA9127CCcurrentClick) {\n      return cv_mo3FH3XPA9127CCcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 8:02 MinsNote: I have the pink version of this tablet and reviewed it. Video is for pink version. Here color is different. ProntoTec 9 inch PT9 series is an All Winner Dual Core A20, Cortex A9 at 1.5GHz and is a very good value in price per performance. It has 512 MB RAM and also has a GPU. This runs Android 4.2.2 Android. I will go into the specifications and review based on my user experience. The dimensions are 9.25 x 0.43 x 5.91 in and weighs just over a pound. The screen resolution is 800 x 480. Please see my video review for details on performance - I do Temple run Oz and YouTube which are best indicators of the performance.Most of tablets have ARM based processors. This makes sure all of the Apps in Google Play ecosystem available. If you look at my video review, I have screenshots showing the CPU speed and other kernel details. The screen is 800 x 480 Pixels. This supports a wireless with Wi-Fi (802.11 BGN). Tablet has 2 cameras - front and back. This has 8 GB storage and you can use an extensible SD card slot as well as cloud storage. Though not built in, the tablet supports external 3G/WCDMA dongle. Battery, 4200 mAh came for a good 8 hours with moderate usage. Battery usage really depends on how heavy you use the system. Overnight it drained very less. Mobile Networking was on by default. I switched off as I was using only Wi-Fi mode. I suggest you go to Settings and tweak things which are not required. Developer Mode was enabled by default. I turned it off. The capacitive touch screen was really good, some occasions I had to press little harder and at right locations, but pinch-zoom, highlight, Copy-Paste all worked very well.It is great the tablet has micro USB Port, 3.5-mm stereo Headphone Jack, built-in speaker, microphone, micro SD card slot and a DC Input Jack. Note that for powering through wall adapter you need to use the provided DC input jack. Speaker was loud enough. In a room, once I keep the tablet in a stand it was good. Speaker is on the backside, so you don't want to lie this down on back as it will hamper the audio coming out. This is a design I hope changes in Android manufacturers in future. Android tablets are really customizable to your heart's content. It is here where Prontotec shines. Using a native Android 4.2.2, they have achieved something at a low cost. This can have a very wide reaching audience. In many countries, where affordability is key, having a tablet like this with Wi-Fi is a big boon. Imagine having entire Wikipedia at your fingertips for a child. I tried few educational applications on this. I consider this as a big hit with educators than gamers.I tried Google Voice Search and asked \"what is capital of United States\". The voice recognition part was great and it was able to recognize and dictate the answer. I also tried Wolfram Alpha and asked bunch of questions. E.g., what is world population, what is population of China etc? The microphone picked up correctly and answered through Wolfram Alpha. Apps like Calculator, Gmail performed flawlessly. I watched multiple video through few applications. Obvious first choice was YouTube. Was able to search and watch videos. I used TwIT.TV app and watched some segments of a podcast (video streaming through Wi-Fi). Again smooth playback. Handholding is really easy given the weight of it. It was a colorful blue; no heat observed handholding the tablet. It is plastic, and buttons are made of plastic. For a kid, this is perfect also though the feature set is equally appealing to an adult. I was so enamored with low cost computers in late 90s and it seems I am reliving them with tablet. If you want to listen to podcasts/watch video then this is perfect. Just keep it in a stand and connect to power. See my video review to get an idea of what I am referring to.The keyboard dock makes it very easy to type documents in Google Drive or other note taking apps like Evernote. The USB attached keyboard is rugged and keys are smooth to type. This is an excellent innovation and dual serves as a case + keyboard combo. It also serves as a stand for watching playback videos.For a computer geek, it is a challenge to design something with minimal resources - screen resolution, RAM, storage, chipset. Prontotec has designed a tablet with budget conscious customer in mind. Out of the box, it worked to my satisfaction given the specification and price. Once powered on, it directly came to a working condition. No need to setup account prior to using. I signed with Wi-Fi, the Wi-Fi router was in one bedroom. I configured in another room separated by two rooms. There was no issue with Wi-Fi signal. Once connected, I created a Google account as well. I generated a Application Specific password as I had 2 factor authentication. Once signed on, I updated applications like YouTube, Google Keyboard etc. I also downloaded few applications like TwitT.TV, Tetris from EA, etc. I downloaded Chrome and browsed few websites. Listened to Audio / Watched Video. Out of the box battery needed a full charge. Initially without charge, I did a video stream and wanted to see how device shutdown. Sure enough it shut down as battery drained. Powered on after charging and everything was fine.Chinese chip-maker Allwinner's A20 is a dual-core design with 512KB L2 cache, dual-core Mali 400 graphics and 2160p HD video playback support. This tablet has 1080p support. The Allwinner A20 CPU has 2 core(s), resulting in good multi-tasking when compared to a single core processor. As a result of following the Harvard architecture, the CPU has a separate Level 1 instruction and data cache leading to a slight improvement in performance over a unified Level 1 cache. The instruction cache is only used for storing instructions and executes in a sequential manner. The data cache stores data used by instructions; the point of access or storage is generally specified by an instruction. This processor is based on the Reduced Instruction Set Computing (RISC) design strategy enabling instructions to execute faster, as opposed to the Complex Instruction Set Computing (CISC) design strategy, which is generally slower at executing due to lengthy instructions.I am impressed enough at the engineering for the price/value/budget it delivers. The ARM Cortex(tm)-A9 processor is the power-efficient and popular high performance choice in low power or thermally constrained cost-sensitive devices. Cortex-A9 is available as a single processor solution offering an overall performance enhancement of well above 50% compared to ARM Cortex-A8 solutions. Cortex-A9 MPCore offers up to 4 processors delivering when needed, on lightweight workload as well as peak performance. Its configurability and flexibility allows Cortex-A9 to scale across a wide variety of markets and applications. This is from ARM specification. Prontotec has pulled in many off the shelf components and assembled at a terrific value. I was particularly interested how it performs to streaming video. That is the golden test and it performed beautifully!", "Date": "April 1, 2014"}, {"Title": "GREAT PRODUCT FOR THE PRICE", "Author": "bargainfinder", "ReviewID": "R3R6116DXWL9FK", "Overall": "4.0", "Content": "I purchased 4 of these tablets for my kids last Christmas. Kids do not need and overpriced extravagant tablet. The fact that this is also a 9 inch screen is amazing! I made sure to purchase squaretrade with this product because it's a generic brand. And lets be real...anytime you get a generic brand cheap electronic there's bound to eventually be issues. 3 out of the 4 ended up working out just fine. 1 after a few months would not connect to the internet or pick up wifi signal. all four chargers ended up not working after 6 months. This company is new so the products do not have a serial number on it. It's fine because Square Trade will still cover the product.All I had to do with the one that would not connect to wifi is call square trade, email them a copy of the receipt and once Fed Ex scanned the label I was emailed an amazon gift card number for the amount it was purchased at. Now this product is only $70?! Guess its time to replace that tablet!!!My kids have no problems accessing google play, hulu, netfix, etc!!! The sound quality is alirght its not the best, but then again think about what you are paying for the product. I just wanted something cheap to keep the kids entertained and this product does exactly that. With a decent set of $20 sony headphones this product is pretty good. But do expect to have malfunctions with the chargers. All four of mine do not work now.", "Date": "January 2, 2014"}, {"Title": "Get what you pay for...", "Author": "Miranda", "ReviewID": "R2H6R5OSWGET0Y", "Overall": "3.0", "Content": "I liked everything about this tablet and it works great... However the screen is very difficult to see. You have to hold it certain ways to be able to see anything without struggle. Not a very clear screen.", "Date": "February 18, 2014"}, {"Title": "another one bites the dust", "Author": "Sonovavitch \"Sonovavitch\"", "ReviewID": "R37RDLV4DZIZJF", "Overall": "2.0", "Content": "after 4 tablets in the last couple years, I have found out 1 thing. When the warranty is up, the tablet is down. I had a plan to use a tablet for ebooks, and actually see the print. Started out thinking I was a genius! Now just dumb. I don't run a bunch of games or apps, but weather, KOBO and cool reader. I bought 1 rather expensive and 3 cheaper tablets. They all end up in a stack of junk. I look online for ways to cure them, but I haven't figured out anything that helps. The charging unit went in a couple weeks, then the settings started changing all by them selves. Sometimes 50+ times a minute.So a cheap tablet as an ereader is not a \"smart idea\"", "Date": "December 22, 2013"}, {"Title": "Fair while it lasted", "Author": "RM", "ReviewID": "R1SY9P2VXGBF4R", "Overall": "2.0", "Content": "Connects to the Internet well.  The voice interactive and the touch keyboard work well.  It is hard to keep the screen from getting scratched.  The HDMI package was somehow deleted the first day I received the tablet.  After just 2 months, the tablet died.", "Date": "December 9, 2013"}, {"Title": "great value, user friendly", "Author": "heather", "ReviewID": "R30RTP3KOLUK33", "Overall": "5.0", "Content": "this tablet is a great value, very easy to set up, connect to wifi, download apps, etc. i would definitely recommend to friends.", "Date": "October 24, 2013"}, {"Title": "The product is good,", "Author": "Rick", "ReviewID": "R5TFDCTC1YFE7", "Overall": "5.0", "Content": "The product is good, I think it is awesome . I hope you can make more like this product again.", "Date": "May 15, 2014"}, {"Title": "p", "Author": "liz borzacchiello", "ReviewID": "R1RKJ3IBITYFRT", "Overall": "1.0", "Content": "pronto tec 9 inch kept freezing up on apps everytime you click on them it took a long time to load. had to keep restarting tablet.", "Date": "April 12, 2014"}, {"Title": "it works really good", "Author": "giselle seaforth", "ReviewID": "R2CQ9A91KLCT8R", "Overall": "4.0", "Content": "it works really good shipping an handing is really face the only thing  is that the camera  isnt really clear but its nice", "Date": "February 17, 2014"}, {"Title": "Not great, but good.", "Author": "John Borges", "ReviewID": "R18T0IA8A0BQL6", "Overall": "3.0", "Content": "Only worked for two days before it died, Before it died, graphics were good and tablet was responsive, Play store worked well. Wifi worked but was slow and weak, I couldn't stream video and transferring/downloading files was slow. After a day it came back on, so I'm going to keep it, since I mostly use it for reading books, and playing games it meets my needs.", "Date": "October 12, 2013"}, {"Title": "DO NOT WASTE YOUR MONEY!", "Author": "Brad Anderson", "ReviewID": "R3Q81HG3M99ZW0", "Overall": "1.0", "Content": "Bought two of these for my kids for Christmas.  They died, frozen screens, batteries wouldn't charge, crashes, the whole nine yards before they even went to bed Christmas day.  All-in-all they got about 4 hours of usage out of them before they became paper weights.  Even bought the one year protection plan, never got the information on the plans.  Doing a review for that one next.", "Date": "December 31, 2013"}, {"Title": "Bad tablet!", "Author": "Emilija Z.", "ReviewID": "R3Q8XJG1OY43HV", "Overall": "1.0", "Content": "This is a terrible tablet. I bought it from a bad seller. Because the seller mistake I had to pay more money to take my tablet. But this is a lie he has only 1Ghz processor, 1.5 is not as described. And battery life is horrible. She wants to be fully charged, only 88% and about 40 minutes work. Very bad purchase. I regret.", "Date": "November 4, 2013"}, {"Title": "You get what you pay for", "Author": "LeAndrea Cizek", "ReviewID": "R3EBS0Z9SAZK6W", "Overall": "1.0", "Content": "Very hard to type on this. Very hard to figure out. Good for 5 year olds maybe for like a starter tablet.", "Date": "February 27, 2014"}, {"Title": "Great tablet", "Author": "Arlene Swenor", "ReviewID": "RT11K5GLI1ZN6", "Overall": "5.0", "Content": "This is my first tablet, I looked at so many, it took a few days to decide. This one is so very easy to learn and use. I have gone to facebook and played  my games.My husband, that had trouble using my lap top, loves it as well. Great price!", "Date": "January 11, 2014"}, {"Title": "My ordered Tablet", "Author": "Judy Comer", "ReviewID": "RIT5PKRQ9GUWN", "Overall": "3.0", "Content": "I ordered it and then it was to come in November. I wanted one sooner, so I just returned it and never did open it. I presume it was just fine.", "Date": "October 22, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F4U4TLW"}}