{"Reviews": [{"Author": "derekmski", "ReviewID": "RTMRR39NIDKL9", "Overall": "5.0", "Content": "This is a really great tablet.  I got it for $149 so I didn't have my hopes too high with it being this cheap but it's an excellent tablet.  I would say this is by far the best tablet for $149.  The build quality seems to be really good, not cheap and creaky like the Hisense Sero 7 Pro from Walmart.  The back is mildy grippy like the nexus 7.  It's super light only weighing 314g!  It has front and rear cameras that aren't that great but it's better than nothing.  The tablet comes with Android 4.2.2 and it's stock Android with only 2 Dell cloud apps that can be disabled anyways so it's nice and clean.  Dell says it'll get 4.4 KitKit soon.  This does have a GPS, and an ambient light sensor for automatic brightness.  The micro sd slot works well, I have a 32GB card in it working great.  The speaker is on the bottom side to when laying flat the sound isn't muffled, it gets really loud for a little speaker.  The sound quality when you plug headphones in is excellent, blew me a way, the sound is full and rich if you're listening to a good source.  The screen is very bright and sharp, good viewing angles because it's an IPS display. This plays a bunch of high end games without a hitch.  Battery life seems to be pretty good, they claim up to 10 hours.  Comes with a nice 10W power adapter and a micro usb cable.UPDATE 11/15/2013:I'm still liking this tablet overall but I noticed a thing after using it for awhile.  The automatic brightness level at night or in a darker room is way too bright, it's very hard on the eyes and I have to manually turn the brightness down because it's so bright at night.  I have contacted Dell about this and they have forwarded it to the department that handles the software on this tablet so hopefully it's adjusted in a future update.", "Title": "Best tablet out there for $149!", "Date": "November 4, 2013"}, {"Author": "Dirk", "ReviewID": "R3IG3HCCG2X0N0", "Overall": "5.0", "Content": "I just got this tablet so I can't speak to longevity, etc., but as for first impressions, this is a really great tablet for the price.  What I like:-Build quality seems excellent - really solid feel.-Micro SD slot for expansion is great.-Pretty much stock Android (I have used the Samsung version in the past, I found it almost unworkable).-Lots of RAM and a fairly fast processor means apps run quicklyOn the negative side, it has cameras, though they are pretty low quality - good enough for Skype, etc., but won't beat your phone for pictures.Overall, I would recommend.  I will update after a while if anything goes wrong.EDIT 11/7/2013: Just thought I would give an update about the Micro SD card reader, as I was a bit confused about it.  On the Dell site, it says it is SDXC compatible, supporting up to 128GB (when they are available), but in other spots it says \"a micro SD slot for up to 32GB of additional storage\", which would imply it is not SDXC compatible.  Well, tonight I put in a 64GB SDXC card, formatted to FAT32, and all 64GB were available.  Copied files from my desktop onto the card, and the Venue was able to read them no problem.  So that is a very nice feature if you have a lot of movies, music, etc you want to lug around with this tablet.", "Title": "Great Deal", "Date": "November 4, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2BO1ZUNAXV4DM", "Overall": "5.0", "Content": "Seven inches seems to be the \"sweet spot\" in size for a tablet that is convenient to carry around and yet large enough to actually use, so I ordered this one to see if it works for me. I find this tablet to be very well designed, with good screen viewing angles and adequate battery life, but to have limited internal speakers.Design:The tablet is very comfortable to hold and quite compact. The device is designed for portrait mode (the camera is at the top when held that way), although it works fine in landscape, which is my preferred mode. The top has the power button and jack for a standard headset. The left side has volume +/- and the MicroUSB port. The bottom has the speakers in the middle, and the Dell asset tag. The right side has a compartment that opens to reveal the MicroSD card slot and a slot for a MicroSIM card (which is filled in for my WiFi model). The rear is smooth but not slippery.Use:The device is quite snappy in use, and never got hot even when running benchmarks or movies. The interface is pretty basic, but easy to use, unlike other vendors who put too much stuff on top of Android. I was able to open a lot of programs and switch back and forth between them easily; multitasking is quite good. I was concerned about the Intel Atom based tablet being fast enough, but this one does well (benchmarks below). HTML 5 and YouTube movies worked well and looked fine, but it will not support flash (see below). The screen is not the highest resolution (that would be the Nexus 7 in the Android community), but it is very clear, and will support HD. It can be seen even in bright sunlight, although I think it is really best indoors - it was readable in sunlight but not absolutely bright. The device includes the Android browser and Chrome, plus a minimal suite of included software, mostly Google products such as Mail and Calendar. Overall, I am pleased with the user experience.Good:+ Capable of 4G operation when ordered that way. Mine is the WiFi only model.+ Support for a Micro SD card. I didn't test this because in my particular use I don't need that much storage. The box and Amazon page say it will support up to 64Gb, but the Dell web site says it will support 128Gb SDXC as well.+ Very good screen angles, left, right, up, down. The resolution is not the highest, but it plays HD videos very well.+ Battery life is about 8 hours of normal browsing at average screen brightness. I was able to browse for a couple of hours and then watch two full movies before it got below 30%. This was indoors; battery life will be different if the screen is turned all the way up, or automatically goes to maximum when used outside. Nevertheless I think for the size of the device it is good.+ Performance is good, but not maximum. The device uses the Intel Atom (Z2560) chip running at 1.6 Ghz (the Amazon site says 2 Ghz). I was interested to discover that it is actually a dual core chip running with hyper-threading, rather than actually having 4 physical cores. It rendered a Quadrant benchmark score of 6102. As a comparison, my Snapdragon powered HTC One (also 1.6 Ghz, but four physical cores) achieved 9120 on the same test. However it feels fine in use, and because of the 2Gb of RAM (many tablets still use 1GB), multitasking was great.+ There is not a lot of \"bloatware\" on the tablet - it installed pretty \"clean\".+ There is a low resolution front camera for use when video conferencing.+ Charging is via a standard MicroUSB, which is good, because in the past Dell has opted for non-standard chargers.Not-So-Good:- The tablet will not display flash content. This means that one cannot watch Amazon streaming movies, or most web cam type shows. I was simply unable to get the Adobe flash player working on this model. It comes with Android 4.2.2, which does not include Flash.  There is a work around that I have used before (download Flash from the Adobe website), but that did not work; I finally gave up on trying to get Flash to show up. I subsequently tried it on my HTC One, which is running 4.3, and it doesn't work there either, so I did not detract any stars. The tablet will display HTML5 just fine.- The screen really picks up fingerprints. I didn't detract for this either, but it will get marked up!- There is only a single speaker, at the bottom of the device, so there is no stereo output. Sound is not really that good unless one is using headphones; it is strong but not that clear.- The device comes with Pocket Cloud software. In theory, this allows one to access the desktop from the tablet. The Companion software is available for PC or Mac. When I attempted to use it my antivirus warned that there was an attack on a security hole, so I uninstalled it and did not go any further. I'm not sure what the software was attempting, but I won't accept any security risk.- The main camera is a bit small - only 3 megapixels. Considering that a tablet this small really is designed to carry around, I would have hoped for an 8 Megapixel at least.- My device has a slight defect. When the screen is held landscape and tilted so that one is looking down at the device, there is a strip of orange showing for about 1/3 the length of the screen, across the bottom. It is obviously some kind of manufacturing problem. Since it does not show up when the tablet is viewed from any angle except a ridiculously steep angle (I'd never use it this way), I am not going to submit it for warranty. Yes, it is a defect, but it doesn't impact normal use.Summary: A small, very affordable tablet that works well and is convenient to carry. Highly recommended.UPDATED BENCHMARKS Dec 2013:3d Mark Ice Storm:Score 6739 | Graphics 6403 | Physics 8253 | Graphics 1 31.3 | Graphics 2 25.1Ice Storm Extreme:Score 3695 | Graphics 3192 | Physics 8244 | Graphics 1 - 18.1 | Graphics 2 - 26.2 | Physics 26.2Ice Storm Unlimited:Score 6112 | Graphics 5624 | Physics 8778 | Graphics 1 33.7 | Graphics 2 19.2 | Physics 27.9Antutu Benchmark:Overall 18564 | Multitask 2776 | Dalvik 1274 | CPU Integer 1357 | CPU Floating point 1508 | RAM Operation 1120 | Ram Speed 1463 | 2D Graphics [800x1216] 1408 | 3d Graphics [800x1216] 5916 | Storage I/O 1127 | Database IO 615.", "Title": "Great Value For The Price", "Date": "November 25, 2013"}, {"Author": "John Russell", "ReviewID": "R3AR4DE7QMBN4Y", "Overall": "3.0", "Content": "so far so good. I like everything about this tablet. its fast and works very well, A lot of people complain about the screen its not a bad screen really. It could be better but i have seen much worse too. I am comparing this to a galaxy player that i had. This is a million times better then it ever was except for one thing. and that would be my biggest complaint about the dell venue is the camera's there is tablets out there for half this price with cameras twice as good as these are the camera on the front is completely useless for me, its way to blurry and you have to have a ton of light to even see anything and the back camera is the same way, it just does not take clear pictures at all, but i did expect that after seeing other reviews, just didn't thinking it would really be that bad.", "Title": "its a good tablet....but", "Date": "December 14, 2013"}, {"Author": "Ryan", "ReviewID": "R2JR7MAF87VQHA", "Overall": "5.0", "Content": "I am very pleased.Overall good deal.I admit I did not get my hopes up when I ordered it - $150 for 7\" tablet? When the \"big names\" are selling at two to three times as much (or more)?But I am quite happy with it.* It is lightweight. A great size too - can hold it easily in one hand and navigate with the other.* Screen is bright enough to see on a sunny day.* Speed/Performance is very smooth. All my favorite Android apps run on it. (I was wondering about that since it's an Intel chip versus the ARM usually found on these devices.)* Browsing the web is a breeze (home wifi).Can easily zoom in out on the page areas for reading - double tap and/or pinching both work nicely.* In general, a 7\" screen is a bit small to watch movies. But the Venue plays them very well and sharp and crisp too.* Downside is maybe battery life. But even that isn't too bad.Just to see how it would do ... I used it at full screen brightness, playing HD video not stop streamed off the network -- and it lasted over 6 hours. (about 4 hours or so to recharge it from 0)", "Title": "Pleasantly Surprised", "Date": "November 9, 2013"}, {"Author": "TorridlyBoredShopper \"T(to the)B(to the)S\"", "ReviewID": "R3S0D0YDXL2Y9G", "Overall": "5.0", "Content": "I've been slow to pick up a new tablet after purchasing one a few years back, finding that initial exposure disappointing. A couple of months ago I did get  a new one for my wife, and after playing with hers for a little while I decided I needed one of my own.I'm really, really glad I got this model. I like it enough that I'm going to purchase another as a gift for family. With the holidays fast approaching, it would be a good addition for application use. My mother wants something that streams for shopping and watching videos and for applications like the bible online, and she also wants games. This handles all those well, plus it is easy to  use even if a person isn't so computer savvy.  The device is durable, lightweight, and you can see it well on bright days.I always hated not being able to do that - what's the point otherwise? It loads fast, processes well, and has all the user-friendly features I would want. You can easily access the menus, change settings, place applications or widgets where you want. The picture quality is great, coming in  above my expectations, and the sound is nice. Accessing files from the SD card is easy, with everything loading fairly quickly. When you look at the price, it well surpasses others in the range too.And battery life - that's been good.Battery life has always been a sticking point with others, because they die so easily. This one, with features you can tinker with to save more energy, lasts a good deal longer than I expected. If I play games it burns it faster, but when I'm reading in the day or travelling and wanting to use it, it holds up well. The device charges decently fast too, which is pretty nice.One thing I really wanted for myself was something that could easily read .cbr files (comic books) and .pdf files so I could carry them on the go. I have a Kindle but  Kindles have an issue with that; they put borders around comics if you convert them yourself, making it tiny. Even when you add applications, they have yet to handle it well. This does a great job with them. I use Comicrack since I've used them for a long time and Foxit PDF for my PDF files; there are other programs but these do a great job.Very pleased with this item!", "Title": "Great tablet - (I wanted it mine for .cbr files as well as other multimedia demands)", "Date": "December 1, 2013"}, {"Author": "Iowa 50126", "ReviewID": "R17Q5AVCVK6ZIA", "Overall": "5.0", "Content": "I've had PC's for almost 20 years. But, I was born when Truman was president so my addiction to being on-line is minimal.  My requirements for speed and data storage are easily met by this device.  This is my first tablet. I bought it to use when I travel and to read Kindle books. I'm now using it all over the house. In my shop to look up some parts and plans. In the \"throne room\" to read the morning newspapers. And ... it also works great for Kindle books.", "Title": "Easy to use", "Date": "December 19, 2013"}, {"Author": "Sunny Sewing Honeybee", "ReviewID": "R2OKTXLKERC5AO", "Overall": "5.0", "Content": "I'm really pleased with this tablet. It's thin, light, and not clunky at all--operation is very smooth. The screen has pretty good touch recognition (more on this later), and the screen is bright and clear. The WiFi connectivity is quite good (While this will vary based on your WiFi, of course, I do have a tablet that can't pick up a signal where this one can, so I'm referring to the tablet's ability itself).The rest of my review may sound negative, but it's not--it's really just the things I noticed that I thought might help you with making a purchasing decision.THE PHYSICAL TABLETIt's a nice size, although I'd recommend possibly going up to the 8 if you don't mind a larger size. I can see doing that if you're all thumbs. What I've found is that it can be a challenge for me to touch exactly the right thing, especially with long fingernails. I tried a few different stylus styles, and the one that has worked for me is a wide rubber tip stylus (which mimics a fingertip). It especially comes in handy for Internet surfing or when you need to click/select something very small. But if you're a bit clumsy with small screens, that might be something to keep in mind--especially if you plan to do any sort of word processing (without a keyboard) or e-mail. Certainly it's easier to use than a smartphone, though. And while I've seen it elsewhere mentioned as being pocket sized, you'd have to have rather large pockets to accommodate the dimensions (It doesn't fit any pockets I have).The speaker is located on the bottom (when held the tall way). It probably would have been better for it to be on the top/side, since if it's propped up on something, the sound gets a bit muffled.If a camera feature is important to you, then the one in this tablet may not be sufficient--it's really just passable.USING, CHARGING, CONVENIENCE, ETC.Turning the tablet on is a bit of a learning curve. I have to hold the button down for several seconds until the DELL logo shows up. Additionally, the screen blacks out pretty quickly, and this button has to be pressed to bring it back. When you use the tablet, you must drag the \"locked\" area to another one on the screen--I turned this feature off after figuring it out.Perhaps I'm one of the few people in the world who didn't have one, but you have to have a Google account to get the most out of the tablet, such as being able to use Google Play and download apps. The process is easy, but I recommend trying to sign up from a desktop computer. When I tried to sign up on the tablet, anything--even highly obscure--I input for a new username said it was unavailable. I switched to a desktop, put in one of the same terms, and registered that way. It doesn't take too long to get an account.The battery life isn't all that long--you'll likely need to plug it in once a day if you plan to use the tablet daily. However, it's convenient and this comes with an adapter for a wall outlet (unlike some tablets!).My main surprise with this tablet was that it didn't come with a print manual! While a lot of what's on it is intuitive to figure out, and the best way to learn might be by exploring it, I'm the type of person who likes to have a manual due to being intimidated by unfamiliar technology.I've tried to be honest about things, to the point where it possibly sounds like I don't like the tablet. I really do like it! These are just things I know I would have wanted to know before getting one, and thought would be things you might want to consider. I'm really happy with the tablet and its processing speed and other basics.", "Title": "Nice basic tablet; things to consider", "Date": "December 3, 2013"}, {"Author": "LIFEisSHORT", "ReviewID": "RJ27MM1TIB46", "Overall": "5.0", "Content": "This tablet is awesome so far. My first tablet, this thing is just an over sized smart phone. Comparing it to my HTC ONE X Plus, it does everything my phone does with a bigger screen. Google Earth, Field Runners, Temple Run 2, Yahoo Fantasy Football, Google Drive,World of Goo, TW Battles, Google Play Store, Netflix.....plays them all no problem.  $150 well spent!", "Title": "1 week in", "Date": "November 10, 2013"}, {"Author": "kevin98", "ReviewID": "R35HL3WR75DLKF", "Overall": "4.0", "Content": "i bought these to use as an mp3 player. keep in mind it takes micro sdxc, not sdxc as the specs say. the biggest micro sdxc you can get is 64gb right now ( not 128gb)  the processor is decent but obviously not as good what you will get in a more expensive tablet. android is 'barebones' without bloatware and i love that. the screen is good but not great. the speakers are pretty bad sounding unfortunately, but the sound sounds great on headphones.will recommend and this will do most of what you will need in a tablet. unless you need to take notes or sketch and then you might want to get a more expensive one with a stylus.", "Title": "exceeded expectations", "Date": "November 13, 2013"}, {"Author": "Pomegranate", "ReviewID": "R1E3Y6W4752FV8", "Overall": "5.0", "Content": "I have owned 6 of the Dell Venue 7 16GB tablets for work for a few weeks, and they are great. I use them to train employees and do fieldwork. Here is my impression of this tablet, short and sweet:PROS:- Pure Android, pure bliss. No proprietary Apple, Microsoft or Amazon nonsense. I can download apps and executable files without going through an \"app store.\"- If the apps/programs you want are standard, you will definitely find them in the Google Play store. Google's suite of products is arguably the best among the competitors.- Runs browsers and web content like a PC, but with the touchscreen ease of a smartphone. I was surprised how smooth this is. The same content will load in the browser or in an app with equal speed and display. The default browser that comes with the tablet is Google Chrome, an excellent browser.- Multi-tasking does not seem to slow down this tablet, such as streaming music simultaneously to doing work on the web/apps.- The tablet is fully integrated with Google, so if you choose to sign in with your Google account, all of your data syncs.- BUT!!!!!!!!! If you choose not to sign in with Google (or don't want a Google account), everything still works wonderfully. I love that the option exists to sync or not to sync, depending on personal preference. The consumer is not pressured into a cloud storage program, or into yet another software subscription, or into jailbreaking the device to keep one's sanity.- YOU CAN ADD STORAGE!!!!!!!!!!!!! The SD card reader will take additional storage up to 128GB!- The power supply is delivered by Micro USB connection, which is very convenient since almost all of the good devices use this now. In a pinch, I can charge it with my cell phone (Samsung Galaxy) cord, or vice versa.- It is so light and thin, but it doesn't seem fragile. I dropped it while doing fieldwork out on a boat onto a hard aluminum surface, and it didn't get a scratch.- The audio sounds surprisingly full, not tinny and hard to hear as with many smaller devices. Earbuds get excellent sound quality as well from the audio jack.- The security, wifi, accessibility, and preference settings are easy to understand. You can set more than one user account.- The battery lasts all day. I haven't tested it specifically for battery life, but I did use it recently on and off all day (probably 6 hours active) using various programs/camera, and it was only drawn down to 64% battery.- The 7\" screen is large enough to effectively use the touch keyboard to take notes, send emails, review documents, etc. for those interested in workplace applications. I am toying with the idea of a plugin/Bluetooth keyboard but it doesn't seem necessary.-$149? I can buy 2-3 of these for the same price as an iPad Mini!CONS:- The cameras aren't spectacular, but what do you expect from an amazing tablet priced at $149 MSRP? Don't you have a smartphone with a gazillion megapixel camera anyway??? The rear camera takes totally acceptable quality photos with good colors and light detection, but the front camera is basically just OK -- sufficient for Skype and FaceTime (or the odd selfie) but does not have very high resolution or intense colors.BOTTOM LINE;- With the incredible price point and rock solid features, I will be buying about a dozen more of these for our office in the next year.P. S. The Dell Venue 8\" has almost the exact same features, and while I would prefer the larger size screen for personal use, the smaller 7\" screen is ideal because it's a little lighter and takes up less space for travel/work.", "Title": "Lean Mean Tablet Machine", "Date": "January 30, 2014"}, {"Author": "Tom B.", "ReviewID": "R1AGMI189D5SXP", "Overall": "5.0", "Content": "This is a great tablet for the money. It is sturdy, lightweight, and easy to use.The tablet has a good weight for its size. It featues a 7 inch screen, the back of the devise smooth matte black with the Dell logo on it.The power button is on the top right, Volume rocker buttons are on the left along with the micro USB port (used for charging with the included charger or for connecting to your computer) The right has an expansion slot for a micro SD card.It runs Android 4.2.2. If you are at all familiar with Android this will be a snap. I have a Samsung Galaxy and they are pretty much identical in the way they operate. Only difference is the slight additions that Samsung adds to their phone operating system user interface. The system is pretty clear of bloatware, so there are very few apps that usually come preloaded on your phones.Setup is easy. Answer a few questions and you are off and running. If you have a google account (gmail, google plus) you enter that and you can begin downloading apps you've previously downloaded on our phone or purchased.The system runs very smooth and fast. It boots in under 30 seconds. Switching screens, loading apps, and opening menus is blazingly fast. It is really really fast.The screen is very bright and can be viewed at some intense angles and it looks very good.The front facing camera is decent, though not excellent. It comes in at about 3 megapixels, pretty good for taking photos. They are a bit grainy, though passable. Definable will not replace your regular camera. The rear facing camera is not good at all, you will not be taking very good selfies with this. It is passable, though, for doing things like Skype or participating in a Google hangout or video conference it will do a good job because you usually don't want to broadcast on too high a resolution anyway.Most any google apps will run on this. I've seen no problems or incompatible apps. I've used Netflix, Hula, Pandora, and others. They load fast and multimedia looks good.This does not run flash! So if you want to view sits like Amazon streaming movies you will have a hard time. I am looking for a workaround, but as of writing this have not found one.The sound quality is very good. the speakers are on the bottom and they sound pretty good. There is a headphone/data port on the top. So you can listen to music with headphones or use an input device such as a credit card reader like I have with the Square Register app or with headphone/microphone devices.Battery life is good. If you are using it hard, you'll have to charge it every evening, though if you use it here and there, you can get a few days out of it.It also has Bluetooth connectivity and it has worked well connecting to my various devices. Wireless is fast and easy to set upThe only weird thing is the micro USB cord seems to be upside down. That is though the plug fits in snugly to the device, it seems contrary to what you expect. I'm always trying to put the USB connector in upside down. Just kind of funny and does not diminish the device.Overall a sturdy capable tablet. Runs very fast, good battery life, clear screen, and good sound. Will run most any app you'd care to run. If you are familiar with Android, you'll have no problems using this and it'll seem like old hat. Very easy to learn, setup, and use.I highly recommend!!UPDATE!!:: As of December 19th, 2013 there is an OS upgrade. This now runs Android 4.3. If you have this already and it is NOT running 4.3, go to Settings/About Tablet/system updates", "Title": "Buy this tablet, it's worth the money. Powerful, good screen, decent battery life.", "Date": "December 19, 2013"}, {"Author": "Paul L.", "ReviewID": "R2EXI07RCAZ8S4", "Overall": "4.0", "Content": "I mildly considered buying this table because it is one of the few atom-based tablets available, which I heard has a good power-to-performance ratio (even with Haskwell on the horizon).  At the various price points, I would really only consider the Nexus 7, Kindle HDX (Amazon has earned my business and loyalty), and this model.  When I noticed that a local electronic chain had it on sale for $30 off, and had stock at a store nearby, it was a no-brainer to pull the trigger.  It is a Dell, after all, and it's got 2GB RAM, 16GB of storage with SD expansion capability.  At this price, I wouldn't sweat it if my daughter (or myself) accidentally drop it on the floor.A few points after ~24 hours of heavy use:- If you are sensitive to non-uniform backlight, this model (or my particular unit) would bother you, when the background is black.  I will try to post a picture.  It is hardly noticeable on anything else other than pure black.- It does not last through the day, with ~3 hours of game play (my daughter).  This may be due to the game being poorly written though, as the background music continues even with screen off (game should have been suspended).  The tablet also gets warm- 2GB really makes a difference, a lesson I learned from my phones before getting a Nexus 4.- There were cases when my daughter had trouble clicking on icons, but the touch screen seems pretty responsive to me.- The front and back cameras are nothing to write home about, consistent with everything I have read.  It's passable for video chat I suppose in a well-lit area.- 1280x800 (pixel density not as high as higher end tablets) isn't very noticeable.  I loaded my kindle app and read a few pages to try it out.", "Title": "Name brand with 2GB RAM at no-name 1GB price.  There are rough edges but exceeded my expectations", "Date": "November 24, 2013"}, {"Author": "SUDS \"SS\"", "ReviewID": "R2N30IO1CF55KI", "Overall": "4.0", "Content": "I had previously purchased the Lenovo A3000 for my son and wanted to purchase a second one for my other son. I tried to order it from Lenovo, but the ship date was far out. I had planned to give it to my son for his birthday and it was not anticipated to ship till a good month later. I found this on Dell's website and thought it seemed comparable. It is very comparable. I think that the speaker on this device is not quite as good as the speaker on the Lenovo, but it is for a little kid and I don't think he would appreciate the difference. The difference is not all that big. I prefer the way that you access the memory card on this device over the Lenovo. With the Dell there is a little door of sorts on the side of the device that you open to insert or remove the memory card. For the Lenovo I need to take the device out of the case and then remove the back of the device to get to the memory card slot. Once you get to the memory card on the Lenovo it is quite difficult to remove the card. With this Dell Venue 7 I find that it is easy to insert and remove the memory card.The sound and the memory card are the main differences between the Lenovo A3000 and this device. The Dell Venue 7 functions similarly to other Android devices. The power on the two devices seems similar. I think this device may be slightly smaller than the Lenovo A3000, but they both fit into the generic 7 inch tablet kids case so they could not be that different.I would recommend this or the Lenovo A3000 equally. I paid $20 more for this device simply because I could get a firm ship date versus the Lenovo which I could not get a ship date. The main recommendation that I have when buying a tablet is to look for a device with removable media. We have a 16 GB iPad, it is still receiving updates, but 16 GB just is not enough memory and it seems crazy to pay $100 or so for an extra 16GB of memory when I was able to get a free 16 GB micro SD card for my son's Lenovo tablet. We have two tablets for under $300 where a 16GB iPad mini would be $399. The kids games on Androids are fairly comparable. Most games are available for both operating systems and it is much easier to learn how to use an Android than I had anticipated. You can also find apps that will allow you to sync music, movies, contacts and calendars with your itunes and icloud. This allows for a much more seamless transition.I hope you find this helpful! Feel free to ask me questions.We own the following:Samsung Note 8iPad 2 - 16 GBLenovo A3000Dell Venue 7", "Title": "Nice tablet", "Date": "March 4, 2014"}, {"Author": "J. Rivas", "ReviewID": "R31AD8FSN8KVEK", "Overall": "3.0", "Content": "Overall I'm pleased with this tablet.  It does what it's supposed to do, the apps download fast and run at a decent speed, the wifi has been very reliable, it's a good product.  However listening to music (one of the main reasons I got this) is not enjoyable at all.I understand how these days they want to avoid any potential liability but they've taken it too far.  I can hear the music but the max volume is way too low.  I've tried various mp3 player apps as well as several headphones, so it's clearly a limitation of the tablet itself (i know someone's going to not read this and suggest it anyway but gonna stress it nonetheless in the hopes that someone actually READS THIS).  My favorite headphones are Klipsh earbuds and they work great on every other device.If anyone knows of a way of increasing the max volume I'd greatly appreciate it if you could let me know, but I wouldn't have bought this if I knew it was going to be this bad.  For many people maybe it's loud enough, but I like my music a bit on the loud side.", "Title": "Music playback way too quiet", "Date": "February 22, 2014"}, {"Author": "Stephanie Zakrzewski", "ReviewID": "RKKRH575YXXIY", "Overall": "5.0", "Content": "I was wary and very particular about the specs I was looking for in a tablet. I spent more than three weeks searching for a tablet with decent processing speed and video capabilities, and eventually came across this. The mixed reviews set alarms off at first, but couldn't find anything with a 2 GB processor and 2 GB of RAM for a better price. So I went out on a limb and bought this tablet with a 32 GB hard drive, and prayed it would show up unharmed and functioning.Once I got the tablet I was presently surprised at how fast it powered on and I saw what other reviewers had already talked about. Little bloatware, speedy and great HD picture. I am a gamer to the core, and this tablet plays every game I have installed flawlessly. I haven't found a single issue with ANYTHING. It is faster and easier to use than my laptop, so I end up spending more time on my tablet, instead.  XD  Here is a detailed breakdown of the Pros and Con's.Pros - Fast, Good Video Quality, Sound is crisp for only having one speaker and is louder than you would expect, charges relatively quickly, size makes for easy navigation and use of virtual controls when playing highly demanding games such as MOBAs, full 3D FPSs, and RTSs, and has a nice feel when holding it. Also, doesn't feel flimsy.Cons - It *DOES* have only one speaker, so sound quality could be much better, but plug in some headphones and you won't notice a difference. Also, related to sound, I like to watch Netflix at night while I'm in bed with my one year old and fiance', and the sound can't be adjusted by percentages. Meaning that there are \"steps\" in which it automatically is set to. So when you push the volume button up one \"step\" it is a pretty big difference in how loud it is. There is no slider to adjust volume, so it is either too loud or too quiet for my liking. But this is a very miniscule inconvenience, because I can use headphones. Other than that, the only other problem I have with the dell venue 7 is that the charger port has gotten a little loose and the charger moves around a bit when plugged in. Although this doesn't stop the tablet for on charging,so its really just st a pet peeve of mine. XDSide notes - I have had this tablet for a couple months now for your knowledge. My baby girl and fiance' love to use the tablet as well for reading and learning apps. The app store is in no shortage of these and it is a good feeling to know that my 15 month old is having fun while learning. Also, I am currently ordering a Bluetooth keyboard/case combo and Bluetooth mouse, so I will update when they arrive to discuss how well they work. All in all, I am very pleased with this product, and will be getting another for my soon to be wife. Hope this is useful to everyone! Dell NAILED it!", "Title": "Nailed it, Dell.", "Date": "February 22, 2014"}, {"Author": "V. Garcia Hernandez", "ReviewID": "RYWILW960AGJ3", "Overall": "5.0", "Content": "Excellent product. Very fast. Size and weight appropriate. The video quality is excellent. Very good start to Dell in the tablet with Android. Excellent quality. Recommended entirely. We add one 64GB microSD and it works perfectly.", "Title": "Excellent product from Dell", "Date": "December 2, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1ATR05UHB66E4", "Overall": "2.0", "Content": "The Dell Venue 7 tablet is SLOW, has terrible battery life (typical for Dell tablets), and \"glitches\" all the time.  In the last month, I've had to do hard-resets at least three times.  I think all of the performance/functionality issues are, as others have pointed out, because the Intel Atom processor is not optimized for Android, and visa-versa.There are a total of seven android tablets in our household: 2x Dell, 2x Samsung, 2x Asus, and 1x Acer (yes, we're geeks). The Asus Prime tablets are the fastest, followed by the Samsung Galaxy Tabs. The Samsungs have better features and longer battery life. The Dell Streak 7 (Dell's previous 7\" tablet) and the Acer Icona Tab are about tied for speed and functionality, but the Dell's battery life leaves you tethered to a plug after about 2 hours of use. In last place is the Dell Venue 7 -- BY FAR the weakest performer of the bunch. All of our tablets get used frequently, EXCEPT the Venue. We wanted to like it and give it a chance, but no joy...Time will tell if Dell bothers to address any of the Venue’s issues, but I’m not holding my breath.  Dell’s track record of supporting their tablets is absolutely shameful – just ask owners of Dell Streak tablets who were left high and dry when Dell “temporarily” abandoned the tablet market in 2011 (myself included).  ALL support for Dell tablets promptly vanished by early 2012. Dell not only abandoned the tablet market, they also abandoned their customers.  Now that Dell is back in the tablet market, there is little reason to hope they've improved their technical support base.Bottom line: I cannot, in good faith, recommend this tablet.  You can find better for less out there...", "Title": "NOT Recommended", "Date": "December 25, 2013"}, {"Author": "starbox189", "ReviewID": "R1NVPVSE5KORJ8", "Overall": "5.0", "Content": "I've had this tablet for a few days now. and I really like it.  Immediately updated to Jelly Beam 4.3.  I bought it to replace my previous Samsung 7 Tab 2 which was a piece of junk.  Wouldn't update past 4.1.  That tablet would not keep a wifi connection and loose it when ever I moved into the next room.  It was very slow to impossible to down load webpages.  Very frustrating.  This Dell maintains a strong connection throughout the house which is essential and downloads very quickly.  The screen is very sharp, too.  Very pleased.  Plus is has a micro SD card slot.  Wouldn't have a tablet without one.  It was very reasonably priced at $149.  Definitely would buy again.", "Title": "Nice Tablet", "Date": "December 21, 2013"}, {"Author": "D. Polwort \"DP\"", "ReviewID": "R4V2U2G44EJGG", "Overall": "5.0", "Content": "This is a very good tablet and found that I was able to get it at a very reasonable price.  I also received it prior to the promised delivery date.  I am very happy with its performance and easiness in operation.", "Title": "Dell Venue 7 tablet", "Date": "November 23, 2013"}, {"Author": "Juan Vasquez", "ReviewID": "R214ZNB58HNJQI", "Overall": "5.0", "Content": "They claim to last up to 10hrs of battery life. Its not bad, not great either, but its about the same as the Nextbook 8 SE Premium (great tablet for 99$). About 6 hrs.Other than is a great purchase; fast, awesome screen resolution, great screen can easily be cleaned up, and android 4.2.2, still no upgrade.Update on the battery life, it will depend a lot on the use of the tablet, doing a little bit of everything it might last over a day or 2, unless you play 6 straight hrs or watch movies.", "Title": "Con was the battery life", "Date": "November 13, 2013"}, {"Author": "evelina", "ReviewID": "R18HFMMM7NO1M4", "Overall": "5.0", "Content": "I bought Kindle Fire HD just few days before Dell launched Venue 7And after reading all specification from Dell Venue 7, i already immediately felt regret (even before Kindle was delivered) but I told myself I would give Kindle a try. Later i bought Dell Venue 7 and return Kindle.Below is the comparison :Pro of Dell Venue 7 vs Kindle Fire HDDell has all below which Kindle Fire HD does not have- 2 Camera front and back, even with zoom- GPS so also has navigation turn by turn, even in the car (with no wifi obviously). what you need is to load the map in the wifi area before you start driving (save you money to buy GPS)- Microphone so also have voice command, speech to text (good for people who type very slow),- can download free voice recorder apps with 100+ hours and skip blank function,- can do free call with skype, mango etc and- with Groove Ip Lite it turns tablet into phone and make free call to any US phone number (either land line or cell number)- Micro SD card for additional storage up to 32GB- Bluetooth, easier transferring files between laptop to tablet or vice versa- Gmail application pre-installed vs must buy $5 in kindle fire- Youtube application- Speed : Dell 2Ghz Dual Core vs Kindle 1.5Ghz Dual Core- RAM : Dell 2GB vs Kindle 1GB so Dell is really very fast- Flash Memory : Dell 16 GB vs Kindle 8 GB, more storage in Dell- Browser : Dell Chrome browser hold the page while Kindle Silk Browser will need to re-download the page every time u change screen so resulting in waiting time. to download Chrome browser in Kindle is another $5Dell has two browser, in case you need to save different password in different browser- Dell email apps for multiple emails account shows complete name or user define name vs kindle name it with gmail1, gmail2, gmail3, very confusing and you dont know which is which- Dell is lighter 0.69lb = 11oz vs Kindle 12.2oz so no sore hand holding it up for a long time- Dell width 4.65\" vs Kindle 5\" so easier to hold with palm (without need to stretch the palm all the way for people with small hand)Pro of Kindle Fire HD vs Dell Venue 7- Dell less wide screen results in smaller on screen keyboard so the swype keyboard often interpret wrongly- Battery Dell 5 hours average vs Kindle 10 hours, but as long as you always remember to turn off screen whenever it is not used, with heavy browsing and about 30-40 email per day, it last whole day without charge- Speaker Dell mono vs Kindle Dolby Stereo, but for me who seldom watch movie it makes no differenceDell only $10 ($149) more than Kindle ($139),with Dell pre-installed Gmal apps and Chrome browser apps $5 each, make both price equal.no one should ever consider kindle at all. too bad Dell is lack of advertisement so not so many people know the many plus points of Dell Venue 7 vs Kindle Fire HD", "Title": "Love it so much", "Date": "February 12, 2014"}, {"Author": "Tim is me", "ReviewID": "R2Y1SKXRZ515MZ", "Overall": "3.0", "Content": "Fair warning: This tablet won't allow you to store app data to the external SD card. This is a feature which is available in Android but which they left as an option for manufacturers to enable or not, and Dell chose to disable it. You can still store media (pictures, music, videos etc.) on the external card, but if you use apps that store data (in my case, GPS maps) you can ONLY save the data to the 16GB internal memory. Since I purchased this tablet solely for use as a GPS device this is a HUGE letdown for me. YMMV", "Title": "Can't store program data to SD card", "Date": "May 20, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R22MVFVG30PIUM", "Overall": "5.0", "Content": "I was concerned my 2 adult children would not be happy with this smaller tablet, but I was oh so wrong! I bought each of them one for Christmas 2013 and they were super excited.  They use them almost non-stop for everything from Facebook to streaming videos and everything in between...and it's a Dell!! They auto-updated as soon as the devices were turned on with super easy setup to our secured wireless! Absolutely no issues/complaints about this product.  What more could you ask for??", "Title": "Don't be fooled by the size!", "Date": "February 7, 2014"}, {"Author": "Randall Rap", "ReviewID": "R3I5GU9OVNDKDJ", "Overall": "5.0", "Content": "I'd been shopping for tablets since Black Friday.  Just bought this Dell Venue 7 (model 3730).  It isn't a 2.0Ghz dual-core chip, but is a 1.6Ghz dual-core.  So on that count, it's better than the lower priced Lenova IdealTab A1000 series AND the higher priced Samsung Tab 3 7\" where both are running a 1.2Ghz dual-core.  Plus the Venue has hyper-threading!  The screen resolution is yet another reason... 1280x800 (or low HD) versus the 1024x600 on the other two models mentioned.  Plus came with 2Gb RAM versus their 1Gb... and has 16Gb storage.  The camera would have been a reason to only check 4 stars, but is a feature I'm not planning on using so 3MP for the rear-facing camera is fine by me.  Tablet is responsive, switches apps quickly and videos look wonderful.  The screen might be more touch-responsive or it could be the plastic film protector which makes it a bit less than normal.  After downloading the PDF manual, finding there isn't a thing to detract from this product.  I would DEFINITELY recommend it to friends/family, even over the Samsung Tab 3 if it were the exact same price.", "Title": "Floored by Features", "Date": "February 5, 2014"}, {"Author": "mb", "ReviewID": "R2K0QVOOKIJN5W", "Overall": "5.0", "Content": "Does the job. Battery seems to last longer. More apps available (google play store). Would recommend over the original Fire.", "Title": "Replaced Kindle Fire With This", "Date": "January 23, 2014"}, {"Author": "George Fleming", "ReviewID": "R3344V24KEIJU3", "Overall": "4.0", "Content": "I have owned this for a month and find that it is a well built Android tablet with good performance and battery life. I picked this Dell based on the online specs and description, and for the most part I have not been disappointed. I would recommend this model to anyone who only wants to use Wi-Fi,  As a handy computing tool away from the laptop, I am well pleased. Now that I have said that, let me get a little more critical, while admitting that any problems could be my error.  I could have wished for better printed instructions. The small difficulties I have are probably due to the operating system and not the hardware. First, for some reason it did not connect to my older Belkin-G router, so I bought a new router and it worked fine. This was strange because other laptops and tablets could connected OK, and the Dell Venue had no problem on a couple public networks that I tried. Also, I have tried three different MP3 playing apps and sometimes no audio will come out. When this happens, I can still get audio from a piano app. So it seems this must be software related. I am hoping that perhaps an update to Android will fix this problem. Finally, I do not know if all Android tablets do this, but it seems that the extra SD micro memory chip is not automatically mounted by the system unless you pull it out and re- insert it after every reboot. Since I reboot often, the SD micro memory slot seems useless for local storage.", "Title": "Very Nice Tablet, But Keep Your Old MP3 Player", "Date": "December 16, 2013"}, {"Author": "CJ", "ReviewID": "R31MTSM00RBW2Q", "Overall": "4.0", "Content": "This product has been a surprisingly good value!  At $150, this little table not only offers Wireless Display, but a very comparable battery life to other more expensive tablets.  Having used this tablet now for several weeks, the only downside I've encountered is the aforementioned battery life, but I'd have that with almost every tablet of this size.  The Dell Venue 7 seems sturdy enough for a responsible user, while being supported by a decent company which has a history of offering reasonable customer service.  While I cannot speak to the next generation of these tablets from Dell, I can say that this unit is great for a first time tablet user.", "Title": "A good little tablet at a good little price", "Date": "December 11, 2013"}, {"Author": "MacGregor", "ReviewID": "R2KSVH01AQTWIB", "Overall": "5.0", "Content": "I am having so much fun with this tablet. I am elderly and was worried that I wouldn't get the hang of it without a lot of effort, but it is a delight to use! I'm enjoying books, news articles, email, and many other features. My only regret is that I didn't get a 10-inch. Didn't realize I'd be using it so much.", "Title": "I Love It!", "Date": "December 11, 2013"}, {"Author": "ynolton", "ReviewID": "R1ELBB1OGC7XAT", "Overall": "5.0", "Content": "I just purchased this item an it has exceeded my expectation. The description given online regrading this item is very accurate. I would recommend this product.", "Title": "A must have product", "Date": "November 29, 2013"}, {"Author": "Scott M. \"SAM\"", "ReviewID": "R117B38SH9ZE8P", "Overall": "4.0", "Content": "Well, this is my first tablet, so I have nothing to compare it to.  I'm a retired techie, happy with my laptop, but everyone asks me about tablets and I have no experience with them so I thought it was time.  I got the one with only wifi & bluetooth connectivity.  I've had it a week or so and have no complaints.  I was concerned about the small speaker on the side, but I've found cupping my hand directs it at me.  I don't play a lot of 'action' games, so I don't know how well they perform.  Camera isn't as good as some, but it works.  Seems to be plenty of memory and storage for all the apps I'm finding. The GPS with the google maps is cool, it actually pinpointed the part of the house I was sitting in and works from inside the house.  I REALLY like the Android 4.2, I wish they had a beefed up version I could run on my laptop instead of the new Windows 8.1.....  I had thought of buying a Lenovo.  I had an issue with Lenovo sales that was going to cost me $20 more, after requesting a supervisor, I was told that \"I was at the end of the line\".  If that happens with Lenovo sales, I can only imagine what happens with their support.  I've worked with Dells for years and have always seemed of good quality as this does.  This had twice the memory (2Gig) of the Lenovo and the Intel processor.  The charging cord is EXTREMELY short, so buy yourself a longer power cable.  I did connect the tablet to the laptop and I can access the files on the tablet, but USB adapter on the tablet isn't the standard micro-USB.  It looks very similar, but they are different. I've streamed some videos and they seem to work quite well.  The case seems to be quite rugged too.  Since I'm using it mostly at home, it's been plugged in, so I can't give an honest report on battery life.", "Title": "My first tablet", "Date": "December 19, 2013"}, {"Author": "Shahjada I.", "ReviewID": "R24EAISPNIX7XQ", "Overall": "4.0", "Content": "I got this tablet to use at school for reading, taking notes, listening to music, and to browse the web.  I like it because the 2GB of RAM and 1.6ghz Intel Atom processor and means the tablet runs pretty fast, and is OK with multitasking.  I also love the new version of Android.  Would be better if it had more preinstalled apps though (such as an office app) and more widgets, and if there was a way to sync it to my computer.", "Title": "Dell Venue 7 16GB", "Date": "November 18, 2013"}, {"Author": "BillVN", "ReviewID": "R29QJTJOFAS1YR", "Overall": "5.0", "Content": "Initially I wanted a Nexus 7 2013 based on features, specs, and on-line reviews. When I dug a bit deeper I found there are a number of quality issues and many users are not happy. So I decided to look further. My requirements are:1. Replace my 4 year old Kindle for reading.2. General web surfing.3. Play on/offline games.4. Play movies, music, videos, and photos.5. Good quality, hi-res screen, fast Wifi, good battery life, recent pure Android OS, Google Play, Chrome, YouTube, GPS, cameras, Bluetooth, expandable memory, no apps I don't need, and reasonably priced.So, after further research, I decided to try the new Dell Venue 7. It looked like it met the above requirements, online reviews looked good, and I like that it has a Gorilla glass screen.I have had it for a week and this is what I think.- The screen has excellent resolution, clarity, and colors, but I would prefer a less glossy screen.- Wifi connected easily and works well. It appears to have good range.- Battery life seems adequate. I played a 2.5hr movie and still had 66% battery. It seems to charge quickly.- Works great as a Kindle replacement. Loaded up the free Kindle app and it works very well inside or outside (in the shade). Not good in bright sun due to the glossy screen.- Excellent for the web surfing (Chrome), Gmail/calendar, Facebook, online banking, news, etc.- Downloaded free apps for chess, solitaire, and poker. They are very enjoyable on this tablet.I also downloaded free apps for games such as car racing, shooting, and geocaching to make sure the internal sensors worked properly. They did and I noticed no response lag.- Loaded up a movie from Google play and was very impressed with the video. Sound from the speaker was ok but much better with a headset.- Loaded a bunch of music and photos from my computer onto a 32GB micro SD card that I installed. I was amazed at the quality of the sound with a cheap headset and the beautiful photos.- I verified the Bluetooth, GPS, and cameras work well. The cameras are weak but useable.- I really like the pure Android and lack of bloat-ware.Bottom line, I really like it. For my needs, this beats out the Kindle Fire and Nexus 7 (2013).I think I made a good purchase at an excellent price.I hope it is as reliable as other Dell products I have owned.I will try to update this review if anything changes.12/22/13 update:Tablet still working fine. Updated to Android 4.3 - no significant changes.1. Tired of glossy screen and finger prints? The matte screen helped me:  Evecase Clear & Anti-Glare Matte Screen Protector Mix Set for Dell Venue 7 - 7.0 inch IPS Screen Android Tablet - 4-Pack2. I bought and like this case: Evecase SlimBook Leather HandStrap Folio Stand Case Cover for Dell Venue 7 - 7.0'' IPS Screen Android Tablet (Black)3. Here are a couple of apps that can greatly improve the tablet:AVG Antivirus Security - FREEEasy Battery Saver - Free (on that other app site)", "Title": "Excellent tablet!", "Date": "December 14, 2013"}, {"Author": "smoke", "ReviewID": "R1IWBP3M39971X", "Overall": "1.0", "Content": "Read all the reviews sounded like a great tablet for the price.Was so dissapointed, the minute I started using it it would freeze up and reboot. When it did stay on it was fast and nice quality screen. I think it must of been defected. Had to send it back I  ordered a nexus 7. Hope I have been luck with this one.I must say amazon was fantastic about the return!!! No question asked and did not have to pay to ship it back. I never worry when I order anything from amazon!! The best customer service anywhere", "Title": "crashes !!!!", "Date": "January 25, 2014"}, {"Author": "Cashcar1979", "ReviewID": "R8KBC1MZFJ4K1", "Overall": "5.0", "Content": "Paid $139 for this, and its a nice little tablet for the price.  Solid build quality, decent enough speed, and nice HD screen.  No this isn't as high end as the Nexus 7, but keep in mind its nearly $100 less!!  Excellent low cost device for the kids.", "Title": "Dell crafted a very solid, low-cost Android tablet", "Date": "November 9, 2013"}, {"Author": "Donna Rodriguez", "ReviewID": "R360CWS0DVUUR5", "Overall": "5.0", "Content": "I love this tablet, it has just about everything anyone could want in a tablet. It is very versible. I would recommend this to anyone.", "Title": "Dell Venue tablet", "Date": "May 5, 2014"}, {"Author": "Dianna Baker", "ReviewID": "R3VGIBPU9Q7B3M", "Overall": "5.0", "Content": "Really nice tablet, another great dell product! Wasnt looking to spend to much and im really happy with this tablet. Perfect for me, fits right in my purse!", "Title": "great tablet!", "Date": "April 7, 2014"}, {"Author": "smileylizard", "ReviewID": "R1VWNZXQEL1NX3", "Overall": "5.0", "Content": "2 gb RAM helps out alot. I purchased it for $150 from Amazon. Not sure if they sell this model anymore. I haven't checked on sim card status yet. as i have mobile hotspot. The back camera sensor is a bit weak, but takes much better photos than i anticipated. by far the best out of five tablets i've owned including asus tft 300", "Title": "fast, good size, good price", "Date": "March 5, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1OLCBAQTVGCZZ", "Overall": "4.0", "Content": "I needed a small tablet for email, facebook, photos, watching video and the occasional book (when I've forgotten my kindle). At $150 this has surprisingly good battery life and is well built and easy to use.", "Title": "Perfect for my needs", "Date": "March 4, 2014"}, {"Author": "Mr. Anibal Alanis", "ReviewID": "RNGBKGQGALT25", "Overall": "5.0", "Content": "I bought this primarily cause it was cheap, and I just wanted a tablet to play games on. I use to have a Nexus 7 (2012) edition, but I dropped it, so I bought this as a replacement. Turns out it works just as good as my old Nexus 7 (2012) edition or even better. There is no lagging, and the graphics while playing games are amazing. Only thing I didn't like was the front facing camera, it's kind of blurry when I use it. Overall it's definitely one of the best tablets for less then $200.", "Title": "Wasn't expecting so much for the price!", "Date": "March 2, 2014"}, {"Author": "ed vick", "ReviewID": "RX53LBHLU0G0S", "Overall": "2.0", "Content": "Ordered two tablets for Christmas gifts. One operates fine the other turns itself off once in sleep mode and then takes several attempts to get it powered on again.", "Title": "50/50", "Date": "January 2, 2014"}, {"Author": "John", "ReviewID": "R2QH3EZWAJD914", "Overall": "5.0", "Content": "In my house there are three tablets, Ipad2 16GB, Blackberry 16GB (the worst investment of my life), and 2 months ago I bought my new Dell Venue 7 16 GB Tablet, for me it is as good in every way as Apple Ipad2, nothing to envy, 100% recommend this tablet, as your camera is read in another review so regular, but I assure q the main objective of most buyers, is not having it as a photographic camera, it is important to be fast and multifunctional, with android system you can set you all the app you want, also if you buy a 64GB external memory, you have all the desired space, do not hesitate to buy thismagnificent tablet.JohnJ.", "Title": "Nothing to envy from apple Ipad2", "Date": "December 13, 2013"}, {"Author": "Jason Sanchez", "ReviewID": "R3TWCINLB11AGH", "Overall": "5.0", "Content": "We bought these tablets for my kids for Christmas. We got them in the other day and began to fiddle with them (had to get them all set up before we wrap them up for Christmas). And man I've got to say, these are some great tablets!", "Title": "Good Tablets!", "Date": "December 1, 2013"}, {"Author": "Kathryn E. Etier \"Miss Bob\"", "ReviewID": "R2J0VXZ1A3U4AP", "Overall": "1.0", "Content": "One thing about those folks at Dell--they have a great sense of humor. My husband, a dedicated Dell PC user, was buying a new desktop and the fellow at Dell told him that because of his purchase he qualified to get this Dell Tablet for only $150, which is only one cent higher than Amazon and big box stores are charging (he didn't mention that part).The problem with this device is that the plug on the charger does not fit snugly in the tablet. Example, I have been recharging the battery for three days and it is all the way up to 5%! The tablet does not run when the charger is plugged in unless it is fully (or mostly) charged. So I used it for a day, and then let it charge overnight. Nothing. Let it charge for days. That worked. But even when I use gravity to keep the charger plugged in, often the thing just doesn't charge.  Now there may be other issuses with the charger or the devices charging mechanism (whatever that may be), but the loose charger that falls out at the thought of moving the tablet is an obvious problem.I don't really need a tablet that may work one day out of ten--I certainly don't need the irritation. As far as my experience goes, the only person who could use this tablet is a dead person.", "Title": "One Day Wonder", "Date": "February 18, 2014"}, {"Author": "Byron Gourley", "ReviewID": "R12REAQV42B8A8", "Overall": "3.0", "Content": "This tablet was performing nicely, good picture, camera was taking good photos for a tablet of it's price range. After a few days use, the charger connection (mini usb port) on the tablet would not connect and allow the battery to charge. I tried another charger and cable, same results. End result, unit was working nicely but had to be returned.", "Title": "Nice tablet but had to return", "Date": "May 25, 2014"}, {"Author": "jose valderrama", "ReviewID": "R2O8EWJIZLXC1B", "Overall": "5.0", "Content": "excellent table, is very fast and all applications under heavy game excellent work going very well.is the appropriate size, is lightweight, and storage is good.", "Title": "I really like", "Date": "May 12, 2014"}, {"Author": "sassysue", "ReviewID": "R3BYQARLU2NYN4", "Overall": "5.0", "Content": "I love this Dell tablet.  The size is perfect to fit into a cross body bag, the system is fast and efficient.  The camera takes awesome pictures, and all the apps download very quickly.  Best decision I ever made.", "Title": "Dell tablet", "Date": "May 9, 2014"}, {"Author": "GREAT PRODUCT.", "ReviewID": "R1Y7WI4D94WLSA", "Overall": "5.0", "Content": "Awesome. Great tablet. I bought for my mom. Easy to use. 16 GB of memory and 2 DDR for velocity,double camera. Works great. defenitely I recommend it.", "Title": "Great product.", "Date": "May 8, 2014"}, {"Author": "Peggy Dalberto", "ReviewID": "R2M8SBAIFSG9IY", "Overall": "4.0", "Content": "First time tablet, got it to use with the square card reader for sales. Easy to figure out how to find settings, etc. I'm not a techy person, but seems easy. Got son-in-law to load apps on, so have no idea about that. He however has \"tablet envy\" and likes this better than his.  I looked at a Lenovo tablet too, cost less, but the headphone jack and the power point were too close together to have square card reader plugged in and the power cord at same time.  Hence, the dell.", "Title": "dell tablet", "Date": "May 8, 2014"}, {"Author": "cell challenged", "ReviewID": "RA4390R3P5WPV", "Overall": "5.0", "Content": "Excellent product for price. Has everything I needed in this product. Needed GPS, Bluetooth,sc card slot,WiFi. Filled all the specs I needed for a good price", "Title": "Excellent product", "Date": "April 24, 2014"}, {"Author": "korakas", "ReviewID": "RQ2T2H54OK39L", "Overall": "5.0", "Content": "Out family has owned 3 Kindle Fire tablets and has been very pleased with them.  When my husband suggested that we try this Dell tablet for one of the kids, I was a bit skeptical.  However, it's a great tablet ... with a great design and functions.  We liked it so good that we've already purchased a second Dell tablet.  This is a great tablet at a great price.  This has definitely been money well spent.", "Title": "Exceptional tablet", "Date": "February 11, 2014"}, {"Author": "tangelheart", "ReviewID": "R10REAWHP26TU3", "Overall": "4.0", "Content": "While it isn't the cheapest tablet on the market and it isn't a highend product; it is stable, consistent and does what I need/want. I think the android OS Jellybean is a wonderful improvement to Windows CE.", "Title": "Awesome product!", "Date": "February 10, 2014"}, {"Author": "Teresa A.Peterkin", "ReviewID": "R52LY1PYH3CJZ", "Overall": "5.0", "Content": "The tablet was bought for my husband. Because  I bought  Polaroid Tablet and it was terrible.  I returned it. It was a Christmas gift.  So I looked on line and saw the dell tablet and good price. He loved it. Won't put it down.  Thank you", "Title": "saved our Christmas of 2013.", "Date": "February 9, 2014"}, {"Author": "Bill C Clark", "ReviewID": "R3SEWJZYHZKPHC", "Overall": "5.0", "Content": "Very pleased with this product.Was very fast, and simple to work with.I would definitly, and highly recommend this product.", "Title": "Dell Venu 7\"", "Date": "February 7, 2014"}, {"Author": "maria castro", "ReviewID": "R2EPG0GSQK2TDW", "Overall": "5.0", "Content": "I chose five start because I love it. it is perfect and practical.it is light easy to carry. I would recommended this table.", "Title": "I love it", "Date": "February 2, 2014"}, {"Author": "David W. Miller", "ReviewID": "R25KVC6T220L5X", "Overall": "4.0", "Content": "We bought this to take traveling instead of lugging a laptop around. It's great for game play and I can handle what email I need to with it.", "Title": "Works fine", "Date": "January 31, 2014"}, {"Author": "MAC", "ReviewID": "R14CB91KRG6GC2", "Overall": "5.0", "Content": "I recieved it yesterday so I can't say much about the overall long term performance. It is a great machine, i absolutly love it. it is fast and I can scroll through things quickly. There are some great APPs that I was able to download to take notes and open powerpoints and also write on them. It was really simple to use out of the box. (nothing confusing). I am a college student on a budget, I have a dell laptop that has served me well so this was the best option for me. I don't play games or anything, mostly need it for school so honestly this tablet is great. It doesn't have a USB port.It has the most up to date system so instead of the 4.2 jelly bean everyone is talking about, it has actually been updated to the 4.3 jellybean.It also has the swype keyboard (swipe your fingers through each letter to write words faster) and you can type by speaking. So far I love the tablet, it fits my needs perfectly. I will update in a couple of months.", "Title": "Great for school", "Date": "January 28, 2014"}, {"Author": "Charles Crawford \"c.c\"", "ReviewID": "R3GQANNNE14WGI", "Overall": "5.0", "Content": "Great tablet for the price. I would recommend this one for sure. Love it better than the nexus which I returned.", "Title": "I love it!!!!!!!", "Date": "January 27, 2014"}, {"Author": "Jacqueline Lockhart", "ReviewID": "R3I1JSGXE6NVQG", "Overall": "5.0", "Content": "My boyfriend absolutely loved this tablet that I got him for Christmas. It works pretty good although it's not an iPad. But, for the price I would recommend this to anyone�", "Title": "Dell tablet�", "Date": "January 26, 2014"}, {"Author": "S. Elam", "ReviewID": "R8UNZQWXGQVIQ", "Overall": "5.0", "Content": "I bought this on dell.com.  It is extremely fast for web browsing, which is really the main requirement I have in a tablet.  The GPS is also good, it's GNSS and works indoors.  The Wifi signal strength is amazingly strong. The headphone jack sound is also very good compared to other tablets I have used.  The only annoyance I have is with the touchscreen not registering clicks in the chrome browser, and accuracy can be a problem when selecting among tightly packed links, though this doesn't happen too often.", "Title": "First Android tablet that I find pleasant to use", "Date": "January 25, 2014"}, {"Author": "Ricky Johnston", "ReviewID": "R3T71U5ZWD9UTM", "Overall": "4.0", "Content": "This tablet was bought for my wife for Christmas, and she loves it!  It allows her to do everything she needs to do including checking emails, browsing the internet, staying up with social media, and listening to music.  Thank you Amazon for the wonderful offer!", "Title": "Dell tablet works as advertised", "Date": "January 23, 2014"}, {"Author": "erma l.johnson", "ReviewID": "RMMPSN8BHG7A7", "Overall": "4.0", "Content": "I like My Venue 7 very much; I purchase this tablet to use away from home, so I would not have to carry my laptop with me and its great in so many ways, communication, searching, directions, games, shopping, and much more, I am still learning how to use it, Would I recommend it to someone else? Yes I would. I am very happy with mine.", "Title": "The Dell Venue 7 16 GB Tablet", "Date": "January 7, 2014"}, {"Author": "Michael Pepper \"Computer Guy\"", "ReviewID": "R22LMJYO9YGXU5", "Overall": "5.0", "Content": "This is not a perfect tablet, and it won't stand up if compared to the Nexus and Samsung machines, but it is a terrific tablet that does, indeed, work very well, with decent battery life, blocks no apps -- having a deliciously vanilla Android 4.2.It is satisfyingly responsive, while still giving a few hours of good run time before needing a charge.  You do need to beware of apps built by inconsiderate programmers with no good sense of battery life -- like \"ooVoo\" or \"Skype\". Those guys do drain the battery here very quickly.  (But those apps do that on just about any device they get installed on.There are faster Android tablets out there, and lighter ones too; but this is really a better-than-decent performer -- Waaay better than the one's currently selling between $50 and $100 -- and for only a pittance more.Very easy to recommend for anyone who wants a _good_ 7\" Android tablet, but who can't or doesn't want to spend $300 or more.One minor design fault, not a flaw but an issue, is that the power port is on the [long] side, instead of on the [short, top or bottom] end of the tablet.  This is very inconvenient for charging, and if you have a poorly designed case for the Venue 7, then it is even extremely inconvenient.  But, generally, it's just a minor pain.", "Title": "For the price; best Android deal around!", "Date": "January 7, 2014"}, {"Author": "Jesse Hernandez", "ReviewID": "R2MZV6DM7QCB0X", "Overall": "5.0", "Content": "Don't let the brand fool you this is tablet is running AOSP Android with little customizations added on by Dell.  It is running version 4.2.  I bought it for my mom for Christmas and she loves it.  The camera is a no frills camera but get's the job done for video chatting via the Hangouts app.  Overall would recommend it to anyone looking for a solidly built budget android tablet running native Android.", "Title": "Great Android Tablet", "Date": "January 5, 2014"}, {"Author": "William Yepez", "ReviewID": "R5MVP28A3175R", "Overall": "5.0", "Content": "really good for its price, my wife said \"that's a fantastic movil device\" and i pleased that she's loved it... exellent gift...", "Title": "exellent tablet", "Date": "January 2, 2014"}, {"Author": "rico", "ReviewID": "R3BC0WIU0FXNOQ", "Overall": "5.0", "Content": "the tablet is the most faster than others the battery life is awesome and the screen is very hd definition and they send very fast in only 2 days thanks", "Title": "exellent", "Date": "January 2, 2014"}, {"Author": "R. Nicotri", "ReviewID": "R1S38VMQT1TYKN", "Overall": "5.0", "Content": "Many Apps available and many functions to use. It was a gift for my wife and she is pleased with how easy it is to learn how to customize it for herself.", "Title": "Dell Android Tablet", "Date": "January 1, 2014"}, {"Author": "Sally \"Sally\"", "ReviewID": "R4CYMUJNHIORX", "Overall": "4.0", "Content": "The tablet seems to work well for the basic tasks I need it for. Overall I like it, apart from it needing to charge every day, despite the low usage.Iit also takes about two hours to charge fully from a wall socket.It works just like a smartphone, in that I can access the apps through Google Play.It works well with my Wi-Fi.It's slim and fits easily into my purse.It hasn't crashed, although the Scrabble app stopped working twice in the month I've had it and I had to restart.The buttons are easy to access on the sides.The screen quality is excellent - very clear and the brightness is enough at about 35%. Even though the difference between there and 100% isn't drastic, I like to think I'm saving battery power by not needing to have it up full all the time.The camera is good, but definitely not a replacement for the DSLR (not that a tablet should be).The unit is really fast compared to my Asus HD7, which has slowed down in the 4 months of ownership.Wireless signal strength is not a major plus with this product - I am sitting next to my WiFi router that my Asus HD7 can get the full 50mbps down, and in testing with speedtest.net, the Dell Venue 7 keeps getting around 17.95. This isn't critical for most users, but I'd like to think that the very best components were used in anything I buy, and in this situation that doesn't appear to be the case for the WiFi.All in all, it is a lot of tablet for the money, especially considering it is a quality brand like a Dell. Very thankful it hasn't suddenly died, like my ASUS HD7.", "Title": "Good performance", "Date": "December 31, 2013"}, {"Author": "jdavis4297", "ReviewID": "R25TNBQLMK3G3E", "Overall": "4.0", "Content": "This tablet is the best bang for your buck you can get, i just got it today but it has not lagged or slowed down and I've been pushing this thing to the Max, the screen is exceptionally good and the intel processor inside this hauls ass. Its only a dual core processor clocked at about 1.6ghz but it also has 2gb of ram which is the averageamount for more high end tablets. I only have 2 complaints. First the stock keyboard...it is horrible, it lagged like crazy and just wasn't an enjoyable experience to type on. But i just downloaded another from the app store and problem solved! Second, this is more than likely just bad luck. But after barely using it for not even 15min the speaker just stopped working for no reason. And Dells customer service has not been helping me out at all. They just keep redirecting me to different offices saying that they can't do anything. But im not going to stop trying. I've been using earbuds for now, but this is a bit of a problem i wish dell wouldn't leave me in the dark about. But like I said, more than likely bad luck on my end, probably just got a defective model", "Title": "Great tablet!!", "Date": "December 25, 2013"}, {"Author": "Rhonda Ferrell", "ReviewID": "R14Q9I8VWB7SC8", "Overall": "5.0", "Content": "This is a great 7 inch tablet!  For the price, you just can't beat it.  Lots of apps and is super fast.", "Title": "Great Tablet", "Date": "December 25, 2013"}, {"Author": "C. Sweatt", "ReviewID": "R1SBJ82AR897DN", "Overall": "5.0", "Content": "Great Tablet for the money, Dell got it right. Only Con Dell should have added a fullsize USB port for a Aircard.", "Title": "Great Tablet", "Date": "December 21, 2013"}, {"Author": "Matt Barton", "ReviewID": "RPAS9IOYDD22J", "Overall": "5.0", "Content": "i just received my dell venue 7 and am completely blown away. I bought this on a flash sale from newegg for $99 with free shipping. Sold out in 10 minutes. The tablet is built tough but small enough to take with you anywhere. I would recommend buying a case ASAP. I purchased the universal 7 inch case from rocketfish and it fits perfect, doesnt block anywhere. I also bought the logitech bluetooth keyboard for android.for the price, cant beat it", "Title": "best tablet for the price", "Date": "December 16, 2013"}, {"Author": "Scottie", "ReviewID": "R1QD72S25Q1RWR", "Overall": "5.0", "Content": "I've been using the Dell Venue of a week or so now & it all works good. I'm new at using a tablet so I can't compare to other models. I ordered a 32GB mini SD card and it recognized it OK. I am pleased with it.", "Title": "Great Tablet!", "Date": "December 15, 2013"}, {"Author": "Fran Scenna", "ReviewID": "R3FFTRMSJANG89", "Overall": "5.0", "Content": "The right size ,works great and it\"s a Dell ,but for the money it should have come with a case.", "Title": "dell", "Date": "December 14, 2013"}, {"Author": "veoden", "ReviewID": "R1RX6FRP5Y1568", "Overall": "5.0", "Content": "Very good product. Affordable; Strong performance; Comfortable design; 7-inch HD display with strong overall performance and a low price. alex", "Title": "Very good product. Affordable", "Date": "December 12, 2013"}, {"Author": "Amazon Customer \"rrvinion\"", "ReviewID": "R2JHJT4I5Q2WSO", "Overall": "5.0", "Content": "I love it does everything I need it to do.  Nice sharp picture, games run extremely well on this tablet. All the apps I had on my last tablet loaded quickly on this tablet from the play store.  I love the larger flash drive to my last tablet only had like a 4gb and this one has a 16gb. Very light tablet to easy to hold on to.", "Title": "Very nice tablet I love it...", "Date": "December 10, 2013"}, {"Author": "Jim", "ReviewID": "RGRN2X1ZIZ0IM", "Overall": "4.0", "Content": "My wife got two of these tablet one for her and one for me we love how easy they are to run and smooth and fast anyone looking for a tablet this is the one to buy.", "Title": "Great Tablet", "Date": "December 7, 2013"}, {"Author": "R. Gyles", "ReviewID": "R365NOTZ4PXU7V", "Overall": "3.0", "Content": "I bought this Dell Tablet for my 10 yr old daughter as a gift, I was disappointed at the image quality of the front camera and also the one at the back. Come on Dell we are living in a digital age, phones are being made with 16 megapixel cameras, this is a tablet, a general communication device much more can be done to fit these instruments with better quality cameras for that cost. However, the device is fast and downloads apps and updates really quickly, I have no issues in that regard except the cameras which have no adjustments such as outdoors/indoors, scenery etc. I don't think I'm asking too much for that price.", "Title": "Cameras Not Good", "Date": "February 11, 2014"}, {"Author": "FaithLoveGrace", "ReviewID": "REX6XH0P9OAK1", "Overall": "5.0", "Content": "Great tablet for such such a little thing.  I have a 7.9 by Acer and purchased this for my boyfriend for his birthday and I must say I was jealous and wanted to trade him.", "Title": "Great Little Tablet  (smaller than iPod mini)", "Date": "November 21, 2013"}, {"Author": "Willie Flint", "ReviewID": "R2WGWL9W9A06XP", "Overall": "5.0", "Content": "I have researched this item thoroughly before purchasing it and was looking forward to receiving it.  I must say that it far exceeds my expectations of it.  My wife has an Ipad that she loves, but is truly impressed with my new Dell Venue 7.  I think that most people who has a true understanding of what they are buying for the price they are paying will find it exceptional.", "Title": "Truly Satisfied", "Date": "November 21, 2013"}, {"Author": "E. Nickerson", "ReviewID": "R3BS33QGKY8H5U", "Overall": "5.0", "Content": "This tablet is a great buy and the price was very reasonable.  I would recommend to others as an option to an Apple product.", "Title": "Great tablet", "Date": "May 11, 2014"}, {"Author": "Melissa Winters", "ReviewID": "R3CCX2FPYZGD9F", "Overall": "4.0", "Content": "One of my favorite games won't play on it, while it plays on the samsung tablet. it even plays on cell phones.", "Title": "won't play all games", "Date": "May 3, 2014"}, {"Author": "Rowdy \"Rowdy\"", "ReviewID": "R3DOBDLLTJMGJD", "Overall": "3.0", "Content": "The shipping was prompt from Amazon but this tablet was defective.  I couldn't even log on to my router due to the keyboad being unable to process the number 0 and the letter P.The fact it didn't work right out of the box is not a good sign of quality.****************************** UPDATE ************************************The second Dell fared much better.  The display is not rich but still acceptableno problems connecting over WI-FI and bluetooth.  Apps started quickly.For the price this is a good tablet so I will increase the rating to 3 stars4 stars overall for the Dell but I need to knock it down a star due to having a defectivetablet and needing to return it.Great job by Amazon getting a replacement out to me ASAP", "Title": "Had to return the defective first one", "Date": "May 2, 2014"}, {"Author": "Juan Z.", "ReviewID": "R26DQ9I8PA7PU2", "Overall": "5.0", "Content": "it does everything I expect it to do and more.  No problems so far.  I would recommend this product.  My wife wants her own now.", "Title": "good product", "Date": "April 27, 2014"}, {"Author": "David Earl Moton", "ReviewID": "R1QYQ8015LATBG", "Overall": "5.0", "Content": "It Is User Friendly, I Use It Pretty Much Daily. It Is Compatible With A Lots Of Apps Too.I Love It.David Earl", "Title": "I'm A Older Fellow, It Works For Me", "Date": "April 25, 2014"}, {"Author": "Allen Eliu Martinez", "ReviewID": "R3JZVPQ0QWBL1B", "Overall": "5.0", "Content": "This is my first tablet, i am happy, this tablet is very light, thin, and have all i needed.  I really recommended.<", "Title": "Excelent", "Date": "April 23, 2014"}, {"Author": "Veronica", "ReviewID": "R8G5C7706FNTZ", "Overall": "4.0", "Content": "Excellent tablet, quality/price ratio is great. Took one star because the camera is really not good. Then again, tablet cameras are not that important. Recommended.", "Title": "Quality/price ratio really high", "Date": "April 20, 2014"}, {"Author": "dave", "ReviewID": "R81H2YA30LLD9", "Overall": "5.0", "Content": "Pros: Fast shipping! superb tablet, very stylish too (android) my kid love it.Cons: No adobe media player.But would recommend (price wise).", "Title": "great!", "Date": "April 17, 2014"}, {"Author": "Merlin Villalona Abreu", "ReviewID": "R3O34B3UUCVF0U", "Overall": "5.0", "Content": "I bought it in February and it works very goodI spend a lot of time listening to music,reading books,playing games like asphalt 8,GTA vice city and othersI only can say that I love it.", "Title": "This tablet is very fast and cheap", "Date": "April 16, 2014"}, {"Author": "LKS", "ReviewID": "R23TJRJN0OUFXE", "Overall": "5.0", "Content": "This was a Christmas gift for the hubby. He loved it and the teen in the house would steal it when Dad wasn't looking so she could play on it, even though she had a laptop. Her laptop got killed in an unfortunate accident, and she went right out and got one of these. Hubby plays games, teen watches movies/YouTube. Great resolution, fast, and the perfect size.", "Title": "So good we bought a second one.", "Date": "April 15, 2014"}, {"Author": "KALIM GUZMAN", "ReviewID": "R251J8X7EC60IW", "Overall": "5.0", "Content": "VERY FAST PROCESSOR, BEAUTIFUL AND VERY GOOD MANUFATURED PRODUCT, MORE THAN I EXPECTED I RECOMEND IT. GOOD DEFINITION DISPLAY. I SUGGEST IT", "Title": "EXCELENT TABLET", "Date": "April 12, 2014"}, {"Author": "Dave", "ReviewID": "R3KV0TUPIRS40F", "Overall": "5.0", "Content": "I love this tablet.  I bought this for my son for his birthday, he loves it.  I have a Dell Venue 8 so I thought I would try a 7 for my son.  I'll be buying another one later on.", "Title": "Great Tablet", "Date": "April 7, 2014"}, {"Author": "Heather Ringbauer", "ReviewID": "RE8YF166911QA", "Overall": "5.0", "Content": "I really liked this tablet. It is easy to use and I have not had any problems. It really works great and have had a lot of fun with it.", "Title": "Great Tablet!", "Date": "April 7, 2014"}, {"Author": "GA Classroom Gift Card", "ReviewID": "R3F5OSRNCHZAM7", "Overall": "5.0", "Content": "Very good tablet, responsive, great screen, light and great feel. Does not have a lot of extra software installed which was important to me.", "Title": "excellent", "Date": "April 5, 2014"}, {"Author": "ChrisG", "ReviewID": "R3EXLRUMZOTF7J", "Overall": "5.0", "Content": "I purchased this as a gift for a sister. She set it up and reported that it works great. She uses it for e-mail, Netflix viewing and other multimedia applications.", "Title": "Awesome screen resoultion.", "Date": "April 3, 2014"}, {"Author": "Jeff", "ReviewID": "R1MAS68GAU56RL", "Overall": "5.0", "Content": "This is my first tablet. It has a clean android platform and it includes an update to 4.3 which works real smooth. It's simply great for everyday basic use with no issues to report.Update 5/15: Dell venue 7 still working well and now has an update to android 4.4!", "Title": "Works Great", "Date": "April 2, 2014"}, {"Author": "John Viechweg", "ReviewID": "R29VPY4GVR6LBP", "Overall": "5.0", "Content": "This tablet is definitely worth every penny paid and some extra. The only improvement that can be made would be to the cameras although this is a work tablet thus it does not affect me.", "Title": "Worth it!", "Date": "April 2, 2014"}, {"Author": "ariel l.", "ReviewID": "R3L45KTLQNIJX1", "Overall": "4.0", "Content": "Very nice...the processor is fast. The only thing i don't like is getting rid of the notifications on the top. I have to click on them one by one to open before i can close them instead of the usual minus sign.", "Title": "Not bad for the price.", "Date": "March 30, 2014"}, {"Author": "tipoblanco", "ReviewID": "RDBQ0GYAQZA60", "Overall": "5.0", "Content": "bought the dell venue 7 for my wife at christmas to listen to books on her commute to work,is a very nice tablet,and great process speed", "Title": "dell venue", "Date": "March 8, 2014"}, {"Author": "kristin mccann", "ReviewID": "R1LKZLHI6LO4UT", "Overall": "5.0", "Content": "I bought this for my seventeen year old who killed his laptop and was looking at tablets vs laptops. He can do a lot of what he could on a laptop and more with all of the apps available. He still uses our laptop for word processing but he is really happy with this tablet for surfing the web and playing games and he can take it a lot more places than a laptop. We have several other tablets around the same price range and this one is by far the best in its class. Very satisfied.", "Title": "Best in class!!!!", "Date": "March 7, 2014"}, {"Author": "Richard L. Walker", "ReviewID": "R3DLMBRT6F51JB", "Overall": "5.0", "Content": "I replaced a chromebook with this little tablet, and I love it I can chromecast with it to my TV and can watch a couple netflix movies on one charge.", "Title": "Everything it said it was", "Date": "March 4, 2014"}, {"Author": "Gaia2Joe", "ReviewID": "R28OQVAFYN2T8R", "Overall": "5.0", "Content": "I almost like this better than my Kindle for reading books -- and my children love my Kindle for playing games!", "Title": "Awesome", "Date": "February 18, 2014"}, {"Author": "Stephen D. Jones", "ReviewID": "R1POIOMNP59TTT", "Overall": "3.0", "Content": "USB charge port failed in 3 weeks-loose internal hardware. Thank goodness for Square Trade allowing for a refund. I believe Dell could do a better job with manufacturing standards-although  the price point for this device is on the lower end. Hard to recommend given the concern for longevity and performance. I would recommend paying a little more for better quality devices.", "Title": "Quality issues", "Date": "February 17, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R26NGC8O00VRE8", "Overall": "5.0", "Content": "Really enjoy the ease of use and it is easy for my daughter to use. Using the tablet has really become fun to use when playing games or watching tv.", "Title": "fun to usw", "Date": "February 16, 2014"}, {"Author": "Bob \"Robert Lloyd\"", "ReviewID": "R15D1SFNDIIYDT", "Overall": "4.0", "Content": "Should have HDMI and 4G to make it Great...Like the small form for traveling. Still testing it to see how useful it is.", "Title": "Its OK", "Date": "February 15, 2014"}, {"Author": "Teresa Higashi", "ReviewID": "R2Y4LYZU0SLZ8H", "Overall": "4.0", "Content": "I like it, it holds a 64 sd card inside.. I like that. The only thing I don't like is no instructions, although dell on the phone has been great. What they do not say is that it comes with very few apps. You have to download the apps you want from the play store. They say it eliminates having a bunch of apps you do not want on it.", "Title": "Dell Venue 7", "Date": "February 14, 2014"}, {"Author": "Trekkie71", "ReviewID": "R2PS07698OKJ38", "Overall": "4.0", "Content": "To start off, I love this tablet. It has a good amount of memory, and a microSDHC slot for more memory. The color and clarity of the screen is great, easy to use buttons. My only complaint I have, is that the plug-in to charge is on the bottom of the tablet, so if you are trying to use it in a case (standing), the cord is in the way, otherwise I'd give this 5 stars. The price was decent. I bought the i-UniK Slim Folio Dell Venue 7 Android 7 inch Tablet Protection Case with Bonus Stylus to go with it. Overall, it's a good tablet for the money, and I will probably buy this product again.This is an add on to my review from several months ago.I do have another issue with this tablet. The camera takes crappy photos/videos. Quite pointless to even try it, since there are not a lot of options to modify the camera settings. Unless someone can tell me what I'm not doing right?", "Title": "Dell Venue & - 16 GB Tablet", "Date": "February 1, 2014"}, {"Author": "John", "ReviewID": "R1QWW7JOQDFQL2", "Overall": "5.0", "Content": "Love it have not had it long enough to figure out all the functions it does what I expected it to do . For me it's a new learning curve on how to use the android system. getting apps is a curve for me I cannot figure out how to cancel pages searched the net nothing shows up so still have a long way to go.", "Title": "fast and good graphics", "Date": "January 28, 2014"}, {"Author": "Francisco M.", "ReviewID": "R9NLG5DM0YF2A", "Overall": "5.0", "Content": "Well, until now this product is working well for me. It is a recognized mark and with good price.It has more features than another tablets more expensive and with less features like the storage space.That's the reason beacause I advise to purchase it.", "Title": "I recommend this product", "Date": "January 25, 2014"}, {"Author": "Darcy L. Hamm", "ReviewID": "R36UEBYWGAS8VB", "Overall": "5.0", "Content": "I purchased this tablet for my husband after one of our friends bought one. He uses it every day and loves it. I've also used it on occasion and found it to be a good little tablet. It's fast, actually faster than my much higher priced big name brand tablet. I haven't found anything about this tablet to complain about. The price is great and it'll do pretty much anything you would want/expect a tablet to do. I highly recommend this product.", "Title": "Good little tablet", "Date": "January 22, 2014"}, {"Author": "kenneth markham", "ReviewID": "RHQKK9VZHBGF4", "Overall": "4.0", "Content": "the graphics and nice...plug is a little hard to pull out after charging...but other than that....love it :) thank u to my dad for getting it for my daughter for christmas... thanks dad!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Title": "very nice...", "Date": "January 22, 2014"}, {"Author": "Hoops", "ReviewID": "R23NITBQFKHQ8J", "Overall": "5.0", "Content": "This is a great tablet for the money . Very nice screen and color . Easy to use and set up . I like it so much thinking of getting the 8 inch also .", "Title": "Dell Venue 7", "Date": "January 22, 2014"}, {"Author": "Yuri Birfer", "ReviewID": "R1K0CKD8FENTTH", "Overall": "5.0", "Content": "I bought this amazing tablet for my five year old daughter and she calls it iPad :) we'll she wouldn't know the difference any ways. When I got in the beginning of a last year for my oldest one 12 year old a real iPad mini my little one just kept on bugging her sister almost fighting every time so that she could use it and she did so I promised her that with her good behaviour Santa just might bring her one for Christmas so since the 25th of January my little one has never let it out of her site, she sleeps with it too. Me personally I have done many things on it such as setting it up installing games and etc. on Dell Venue and I was really amazed how slick and fast this tablet is having 2GB of Ram and 16 GB of storage it's more then enough  not only for a five year old but for my self as a back up to my iPad Air it does everything that you throw at it with ease, you tube videos and Netflix is pure enjoyment to watch on it never crashes or any problem what so ever.I would strongly recommend to anyone who is looking for a android tablet and wants safe money!DELL has never let me down even when I had my first laptop latitude about eight years agoLook no further and buy this well built and easy to use tablet, you won't regret it, and will remember my review I promise.", "Title": "Dell Venue 7 16GB", "Date": "January 22, 2014"}, {"Author": "OLIVER BACANI", "ReviewID": "RJC23QCBEV03X", "Overall": "5.0", "Content": "This is the most affordable tablet so far in the market I found from a known brand. Performance is a breeze and specs are comparable to the top tier tablets available right now.", "Title": "Great value, Geat Tablet..", "Date": "January 21, 2014"}, {"Author": "Nole fan", "ReviewID": "R3LAYHVVFHIYRL", "Overall": "5.0", "Content": "We have a Motorola Razr smart phone with Android that made the familiarzation quite simple.  Battery power is very good.", "Title": "Dell Venue 7 16 GB Tablet (Android)", "Date": "January 21, 2014"}, {"Author": "Amazon Customer \"Jim\"", "ReviewID": "R1TWIY1L2EDODM", "Overall": "5.0", "Content": "Nice little tablet, does what you want it to do. Recommend getting a micro SD card to increase storage. Not fancy but better then most of those cheapo tablets.", "Title": "Nice little tablet", "Date": "January 21, 2014"}, {"Author": "tope", "ReviewID": "R29IASUMVWQX22", "Overall": "4.0", "Content": "Nice size, works well, as advertised. Wish battery life was longer, gets about 4.5 hours off each charge. I would recommend!", "Title": "Nice product", "Date": "January 17, 2014"}, {"Author": "Lauren Pirrung", "ReviewID": "R32ISA2YTVTDEF", "Overall": "5.0", "Content": "I bought this tablet for my dad, and he loves it. It hasn't had any problems, it's the perfect size, and it has a great display. The camera quality isn't the best but that was expected. Love this tablet!!", "Title": "Dad loved it!!!", "Date": "January 17, 2014"}, {"Author": "Peachperfection \"Shoeholic\"", "ReviewID": "R3MVPCV23E7YG6", "Overall": "5.0", "Content": "Great gift item especially for someone who is constantly on the go.  It has 16GB of memory so there's a huge capacity for storing books, apps etc.", "Title": "Great Gift", "Date": "January 16, 2014"}, {"Author": "Xander", "ReviewID": "R1TPEO8YMRVMLZ", "Overall": "5.0", "Content": "Dell seems to have resurrected itself into the modern era with new devices and is proving that a quality product does not have to be expensive. I cannot say anything bad about this tablet, it works as well as the others for much less. This really holds its own.", "Title": "Great Device", "Date": "January 14, 2014"}, {"Author": "FS529", "ReviewID": "R33EKKSY5632SP", "Overall": "5.0", "Content": "I had an iPad mini once, then moved to Android with this Dell Venue 7 and I can tell that this was not a bad move. This device is flawless, I've owned it for about a month now and it runs smoothly, the design and manufacturing are totally perfect. Cherry on the top? I would say the 3MP camera: it's not professional, you look like an alien when you take pictures, but it's very handy and can take pretty good pictures.If you consider buying your first tablet, this is definitely a go.If you consider buying an inexpensive top quality tablet, this is what you are looking for.One big downside, just so you know: Android doesn't support Flash... Other than that it's just great!", "Title": "Beautiful piece of technology", "Date": "January 13, 2014"}, {"Author": "S. J. Hall \"onesh\"", "ReviewID": "R1XW9PTMQ8RJX7", "Overall": "5.0", "Content": "First class delivery service, excellent speed at answering questions about delivery before Christmas time so the tablet arrived at the right place and in time.Dell tablet is a force to be reckoned with. Nexus / Google 7 has better watch out.​", "Title": "Great tablet", "Date": "January 13, 2014"}, {"Author": "Cathie Burkland", "ReviewID": "RNDEPI4IMFI6H", "Overall": "5.0", "Content": "I have a blackberry playbook, but I'm kinda hooked on android so I finally decided to grab up an android tablet. I'm really only using it fit web browsing, social media & email -rather than turning on the computer or messing with my phone.Have had this 3 days now. Impressively thin & lightweight. Screen resolution is nice & sharp. Screen is responsive - darned near perfect (playbook's is crap.)Like that it has 2G operating RAM. Processor its nice & fast.I did not buy this for the camera -who does???Overall very pleased with performance. Great for the price & my uses. Great Dell guarantee. Recommended.", "Title": "Very much worth the price", "Date": "January 12, 2014"}, {"Author": "richard", "ReviewID": "RL0U31RP6N6AS", "Overall": "5.0", "Content": "Preforms above our expectations. Looks and sounds great.  Would give as a gift and recommend this to anyone. Even picks up our homes wifi in previously low.connection areas.", "Title": "a must buy", "Date": "January 11, 2014"}, {"Author": "StephanieLynn", "ReviewID": "R1MK8ICATKFZSR", "Overall": "5.0", "Content": "I bought this tablet for my Mom for Christmas. She loves it!! She learned how to use it very quickly. It the perfect size too. You can easily put it in your purse or bag. Its fast and user friendly. I definitely recommend this tablet. And at $150, its a super great deal!!", "Title": "Amazing Tablet!", "Date": "January 10, 2014"}, {"Author": "Lee", "ReviewID": "R3VM5FXCRQVN5L", "Overall": "3.0", "Content": "It has some 'critical problem' of screen cracked.  I mean, not the physical screen, but graphic is often crashed while watching Youtube movie. unfortunately, had to return... but it was very fast and touch works well.", "Title": "It's really fast, but..", "Date": "January 9, 2014"}, {"Author": "Sharon Johnson", "ReviewID": "R9MH5M1PKIQWX", "Overall": "5.0", "Content": "I feel that it gives a good quality picture for the price. I especially like the google feature that responds to your voice.", "Title": "Good Tablet", "Date": "January 9, 2014"}, {"Author": "Valerie Clingerman", "ReviewID": "R1L0DREXPW4ULZ", "Overall": "5.0", "Content": "We have been very pleased with the quality of this item.  We especially like having both  a front and rear facing camera on this.  The color and graphics are very clear.", "Title": "Dell Android tablet", "Date": "January 8, 2014"}, {"Author": "Dr. Eason", "ReviewID": "R3FZOS0ED6USUB", "Overall": "5.0", "Content": "Orginially, I am a HP junkie, but this Dell is working great for me.  I can't say enough good things about it.  I had wanted to get a tablet that had a dual camera on it but decided against it because I already have a great canon camera and an excellent camera on my Iphone4.  This is easy to use has lots of memory and gets the job done for me.  I would recommend it for college students and even professionals who want some simply yet have the capacity to store lots of info.  Besides, dell products are depenable and have great warranties.", "Title": "Dell Venue 7", "Date": "January 1, 2014"}, {"Author": "K. Sterling", "ReviewID": "R1ZLFER2K7BAWP", "Overall": "5.0", "Content": "I have recently started traveling to more conferences and I decided to buy a new tablet so that I could send email, read, and do all that sort of thing. I decided to buy the best cheapest tablet I could find and wound up getting the Dell Venue. This tablet is great. It is nice to surf the web, read/send email, read books, comic books, write the occasional document, video chat with my family and so on.Pros1) Inexpensive, powerful, light = really everything you want from a tablet2) Runs almost stock Android. This was a huge point for me. My Samsung G3 has a ton of bloatware that I cannot take off. The experience on stock Android is great.3) Does everything I want a tablet to do.Cons1) Front camera is weak. I hardly use it so this isn't an issue for me. It works great for video chats (I use Google Hangouts all the time)2) Battery life is only ok. I think I am getting 6 hours of use. I would like that to be higher but hard to complain about.", "Title": "Great table, great price", "Date": "December 31, 2013"}, {"Author": "Erich Maria Remarque", "ReviewID": "R3CM5O31FR3XQB", "Overall": "5.0", "Content": "Super speedy and not too bloated. It looks almost like stock Android 4.2. The screen feels very responsive and there is plenty of space (as a secondary tablet, and I haven't found the need to use the built in MicroSD card slot).This actually comes with an Intel Atom CPU so there is potential to actually put WIndows on this device.Price wise this is decent as well. Netflix is very smooth, and the sound is very loud with headphones on.I honestly can't think of any downsides. :)", "Title": "Great tablet", "Date": "December 31, 2013"}, {"Author": "Donna H.", "ReviewID": "R9YYZ2TOINGII", "Overall": "5.0", "Content": "I bought this for my 9 year old to use and love it!  His dad wants to take it over! He watches videos and plays games without any trouble. I was a little apprehensive to purchase an android system after using an iPad for the last several years. No trouble at all.  I am pleased!", "Title": "Wonderful!", "Date": "December 30, 2013"}, {"Author": "Darlene Atkinson", "ReviewID": "R320CXDUL9SXFT", "Overall": "4.0", "Content": "I love the clear picture, but it a little overy touchy and my apps change to quickly, that might be great for a 15 year age person, for meI like it not to be so touchy why 4 stars, I also love it cause I can climb into bed yet still go online. thank great product.", "Title": "Dell Venue 7 16 GB Tablet", "Date": "December 30, 2013"}, {"Author": "Jedd", "ReviewID": "RBZZNNGFSJ46A", "Overall": "5.0", "Content": "My 6-year-old daughter lost her iPod touch so I decided to replace it with a 7\" tablet. After shopping around, this looked like the best option. It was cheaper than buying another iPod, with a larger screen, expandable memory with the Micro SD slot and the same battery life. She loves the tablet and has no interest in another iPod touch. Great product from Dell!", "Title": "Great product and a great price", "Date": "December 30, 2013"}, {"Author": "Basil \"A Work in Progress\"", "ReviewID": "R1I3UMB8L2TUSO", "Overall": "4.0", "Content": "Everything about this is perfect.  The processing speed is good. I listen to jango and the music sounds very good. It is very bright at night so its good for night reading. Overall it is a great product and good buy. The negatives include the fact there are software that I will never use that keep updating. without the option to stop the auto updates s lot of storage will be sucked up.", "Title": "Really great", "Date": "December 29, 2013"}, {"Author": "Tisha Warren", "ReviewID": "RFE6890FUH8UB", "Overall": "5.0", "Content": "Love Dell products. Have had 2 dell laptops in the family with no problems so bought a tablet for youngest son as a gift. He was completely surprised and loves it", "Title": "Great item", "Date": "December 28, 2013"}, {"Author": "Nancy", "ReviewID": "R257K2Z14VYKG7", "Overall": "5.0", "Content": "I bought this for my mom and decided to keep it for my self. I love it so compact .", "Title": "Love it", "Date": "December 26, 2013"}, {"Author": "David Alexander Smathers", "ReviewID": "R2W82MBT8LQTOV", "Overall": "5.0", "Content": "We ordered Two for Grandchildren.  The are saying there approval.  This was a good choice for them.  We picked them for there reliability.  We looked for Ruggedness.  We looked for their leading to better school work.  Very nice presentation.  Read buyers review at Website.", "Title": "A Gift of the Future", "Date": "December 26, 2013"}, {"Author": "Sandy Brown", "ReviewID": "RNW5MCTLGJXPA", "Overall": "5.0", "Content": "My husband loved it he has not stop playing it since he opened it on Christmas Eve. The price was great.", "Title": "Christmas Gift", "Date": "December 26, 2013"}, {"Author": "Omar", "ReviewID": "RJYPYRKW4J7PJ", "Overall": "4.0", "Content": "Very good Tablet but battery life isn't very good.it runs very smooth without any lags.best tablet for its price.", "Title": "Very good Tablet", "Date": "June 6, 2014"}, {"Author": "Dagny", "ReviewID": "R2DYILK9T9GXMF", "Overall": "5.0", "Content": "I love the tablet, but the charger cord they sent with it only worked to charge it a few times, which was really irritating.I use the tablet daily for work, gaming, and other app use.  It works for everything I'd hoped it would.  I love the tablet.  I've recommended it to friends and family.  Their chargers all work fine, it was only mine that was faulty.  I wish there was a way to fix that.  The charge lasts a decent amount of time.  It is a tablet, so the camera isn't anything special.Overall it's an awesome tablet and I love it.  Great buy for my budget.  Given the choice (in my budget - I can't afford an ipad which was my first pick) I'd buy it again.", "Title": "Awesome buy for the price", "Date": "June 6, 2014"}, {"Author": "LT2000", "ReviewID": "R3VNU2NMKFJR7X", "Overall": "5.0", "Content": "I love this thing. I was on the fence about getting a windows based tablet, but decided i would give the Jelly Bean tablet a shot. Was i sure surprised!!!! the apps available give me all the accessibility i need to remote access my office and do whatever i need to do (office, excel, project, even some low level CAD!!!). The 2GBRAM really makes a difference and this thing runs smoothly. I would really like to see it with the KitKat system, but for the price, you really cannot beat it. I was torn between this and a few other competitorss, but if computing is important, the extra RAM makes a WORLD of difference. BRAVO!!!!", "Title": "GREAT GREAT GREAT!!!", "Date": "June 5, 2014"}, {"Author": "Andrew aeckman", "ReviewID": "R2EBSTZOEPWSZB", "Overall": "5.0", "Content": "Had the tablet 1 month and 100% satisfied. Cashed in on the Amazon Credit Card offer and saved $30. For a $100 tablet, I am blown away. Speed, battery life, ease of use - all 5 stars.", "Title": "Love love love", "Date": "June 2, 2014"}, {"Author": "Lusa", "ReviewID": "RN0RGPCHR0D5M", "Overall": "4.0", "Content": "the battery runs out faster than i thought of, and it takes a long to turn it on.but the overview was good!", "Title": "is ok", "Date": "May 31, 2014"}, {"Author": "gr8ladysc", "ReviewID": "R3GIWTXI9JS3OH", "Overall": "5.0", "Content": "Small but powerful. I love how easy it is to navigate and use. Have not been disappointed with its performance...fast!", "Title": "Big things come in small packages", "Date": "May 31, 2014"}, {"Author": "TRICKY", "ReviewID": "R1NQWQ3K6UBNYX", "Overall": "5.0", "Content": "I LIKE THE COMPACT DESIGN. IT PLAYS GAMES GREAT AND IS FAST WHEN WEB SEARCHING. CHARGE WILL LAST ABOUT 5 HOURS WITH HEAVY GAMING. I WOULD RECOMMEND THIS TABLET BUT BUY A PROTECTIVE CASE FOR IT.", "Title": "\"GREAT LITTLE TABLET\"", "Date": "May 31, 2014"}, {"Author": "Amanda", "ReviewID": "R3ET0DPUUXTM49", "Overall": "5.0", "Content": "I really like the tablet. It was a great price and it does the trick for what I need it for- mostly surfing the net. The only thing that I don't like is that it isn't compatible with Amazon Instant Video, which really sucks because I wanted to watch movies on it from Amazon.Overall, good purchase. Would recommend.Thanks!", "Title": "Great price and tablet", "Date": "May 28, 2014"}, {"Author": "Karyn B.", "ReviewID": "R1SZWFBQNRQW6O", "Overall": "5.0", "Content": "Love this product.  This is actually the second one we have purchased. The first was for myself,  and the second was for my son. Their are many similar products out there obviously,  however this one has a larger memory capability, faster processor, and was much cheaper!  I don't know why you would chose anything else!!", "Title": "Best tablet around with the best price!!!", "Date": "May 22, 2014"}, {"Author": "Mark A. Biernbaum \"Researcher and Psychologist\"", "ReviewID": "R20W7EJHTQT26A", "Overall": "4.0", "Content": "The Dell Venue 7 looks like most of the chinese tablets coming out these days - it is indeed made in China.  The specs are really excellent for a tablet that is less than 140$.  Good speed, decent multitasking.  Nice touch screen.  The speaker is actually pretty good.  I've had a glitch or two, but mostly no problems at all and have been using it daily for a month.  Great size when you are on the go.  The HD screen is very nice quality.", "Title": "For the money, it's very good", "Date": "May 21, 2014"}, {"Author": "Joseph W. Reneau", "ReviewID": "R1BMQB0HNA1EMM", "Overall": "5.0", "Content": "I love it. I only wish I could afford the one with more ram and storage. I definitely recommend it.", "Title": "its the best tablet ive used so far", "Date": "May 17, 2014"}, {"Author": "Stacy Blest", "ReviewID": "R3C7W9NM2S6EJQ", "Overall": "4.0", "Content": "I enjoy my new tablet. Very sharp picture...great for watching movies on. I also love the long battery life it has.", "Title": "Good value for the buck", "Date": "May 14, 2014"}, {"Author": "Jerome King", "ReviewID": "R1LYEFU2DE11OM", "Overall": "3.0", "Content": "Worth the money. very compact and processing speed is decent. I would recommend this product to my friends and family.", "Title": "Ok for the money", "Date": "April 16, 2014"}, {"Author": "T. Crane \"thatguynatl\"", "ReviewID": "RPMFC6FJFCZYS", "Overall": "3.0", "Content": "neat tablet, but very lacking in the battery performance area.  Not as impressed with Dell's support of their tablet products as with their standard fare.", "Title": "Neat tab", "Date": "April 10, 2014"}, {"Author": "reginald hathaway", "ReviewID": "R24KSYCGB3GKOK", "Overall": "5.0", "Content": "Have had no problems with this tablet.  Runs great and looks great too. good value for the price!!  hard to keep away from my son", "Title": "great tablet", "Date": "April 10, 2014"}, {"Author": "Micbax77", "ReviewID": "R11ZLV04LTRHWD", "Overall": "5.0", "Content": "I've had this tablet for about 3 weeks now and I can honestly say that I am completely satisfied. It runs very smooth as far as watching videos on YouTube or Netflix, and it actually handles 3D graphics quite well for only having a dual core processor. As soon as I received it and connected to WiFi there was a notification for a system update to android 4.3 which went off without a hitch. I have tried numerous apps and have yet to encounter any problems. I ran the AnTuTu benchmark test and it scored 19126. If you don't want to or can't afford to spend $230 on a nexus 7 I think you would find this to be a very capable alternative.", "Title": "Very capable tablet for the price", "Date": "March 29, 2014"}, {"Author": "Viveca Ronelle Allen", "ReviewID": "R3PXQO38YV796V", "Overall": "5.0", "Content": "I've enjoyed my new tablet. I bought this one to replace my Kindle Fire (2013) and it has suited my needs well. I didn't need all the bells and whistles that higher-end tablets have...just needed something of great quality for a great price. This Dell Venue 7 allows me to expand my memory with its handy SD slot (currently have a 64G microSD)...I have no complaints so far!!", "Title": "Loving It", "Date": "March 28, 2014"}, {"Author": "J. Edward Hurst", "ReviewID": "R2HF2PHMIXDR3A", "Overall": "4.0", "Content": "The specs are rather good for the money and I've always had good luck with Dells. Gave this to my wife as a gift for travel use.", "Title": "Good value for the price", "Date": "March 28, 2014"}, {"Author": "S. Mclaughlin \"tennis53\"", "ReviewID": "R3EY33B75GYZMU", "Overall": "5.0", "Content": "Having had an inexpensive generic tablet, I am very pleased with the responsiveness in the Dell Venue.  It does everything it's more expensive sister tablets do at a fraction of the cost.  Highly recommend it.", "Title": "Dell Venue ~ great value", "Date": "March 27, 2014"}, {"Author": "Robert L. Fastner \"monkeyboy\"", "ReviewID": "RX158M5X6UQL1", "Overall": "4.0", "Content": "My technologically challenged wife streams her Vietnamese TV series and music with her Venue and uses it every day since I bought it for her in December. It was a good deal at $149. I'd give it more stars if it had broadband but then it would have cost much more.", "Title": "My wife loves it.", "Date": "March 26, 2014"}, {"Author": "Esteban", "ReviewID": "R3F0BSZUIASFXT", "Overall": "5.0", "Content": "Works Ok, Screen its perfect, battery life is very good, better than a crappy ipad.. it's dell always with really good products!", "Title": "So far, so good!", "Date": "March 26, 2014"}, {"Author": "Mike", "ReviewID": "R2B8GK6ECNLZ08", "Overall": "5.0", "Content": "This replaces a 10\" tablet that had 1gb mem. This one is smaller but I actually like the size better than the 10\". The screen is clear and easy to read. The speed of the tablet is great for my uses. Mainly I want something to do some quick email reading and surfing the internet.", "Title": "Worth the money", "Date": "March 25, 2014"}, {"Author": "Torry rice", "ReviewID": "R2FY0RAAN98ML6", "Overall": "5.0", "Content": "Great tablet! Easy to use, lots of good features as well. Would recommend this as a gift for any one", "Title": "Great tablet", "Date": "March 25, 2014"}, {"Author": "Christine Barrows", "ReviewID": "R7F91ECOS5U77", "Overall": "4.0", "Content": "I bought a Dell Venue 7 a few months ago, and so far, I'm really enjoying it. I use it around the house for a variety of things. I like bringing it into the kitchen for reading recipes online while I'm cooking and baking. Takes up much less space that plopping my big laptop on the counter. I frequently use it as a controller for my Chromecast, and for playing games on the couch while I'm having lazy days. I find the camera to be underwhelming, but it is usable under the right light conditions.  It's small and light enough for me to carry in my purse without adding too much bulk. Ultimately, it's a great companion device, and I'm very happy with the purchase.", "Title": "Enjoyable device for around the house", "Date": "March 24, 2014"}, {"Author": "Babygirl45", "ReviewID": "R1XI0EMLHZZI63", "Overall": "2.0", "Content": "The tablet was good but the charger doesn't work. I would recommend it for kids 12 and under and may a beginner.", "Title": "Dell tablet", "Date": "March 23, 2014"}, {"Author": "Jose Vicente Ruiz", "ReviewID": "R16HQNJQ8YQMQD", "Overall": "4.0", "Content": "I chose this because I have a tablet not as big size, good 2GHz processor, Android 4.2.2 OS, 2 GB RAM and only for $ 149.99. Highly recommended.", "Title": "This tablet is very good.", "Date": "March 20, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RIOJK03MHXAHN", "Overall": "4.0", "Content": "This is my first tablet and I wanted one mainly to travel. Carrying along my mac book was becoming too heavy. The first one I ordered was a second hand that I had to return as the screen would freeze. So with less than 15 dollars more I ordered a new one. I've been playing with it for the last 3 weeks and I'm happy with it. In terms of speed, visuals and size. The down side is that the WIFI receptor is not the best, as it can't get the sign when I'm at the garden (where my mac has no problems), and the other down side is the speakers which don't produce the best sound and it has a low volume in general. But this is not an obstacle for me, so I might get some speakers.", "Title": "Aside from it's WIFI receptor....", "Date": "March 20, 2014"}, {"Author": "corpt \"TC\"", "ReviewID": "R57BTSSEQ5E3L", "Overall": "4.0", "Content": "would have rated it higher,if was compatible with a specific app I need for work,like that it has a clean version of android", "Title": "Really like this tablet", "Date": "March 18, 2014"}, {"Author": "Toddy", "ReviewID": "R6ROBBWAAPRL0", "Overall": "5.0", "Content": "I was looking for something that i could take with me on certain Outing in which by i seen this awesome Device that is light weight and  is easy to take pics or videos of Places & or Events that i travel to where ever i may go. I also like the Idea i can get on Facebook, check my online Account or track a Package at the swipe of the Finger.", "Title": "Glued to my Hand...", "Date": "March 17, 2014"}, {"Author": "Sam Grove", "ReviewID": "R18T6HKA41NQ6K", "Overall": "5.0", "Content": "Does everything I want it to so far.  I'm very pleased with it.  I would recommend it for any one else.", "Title": "New Tablet", "Date": "March 16, 2014"}, {"Author": "William E. Rogers", "ReviewID": "R3P7IU1BUQ2ZLX", "Overall": "2.0", "Content": "If you are ,looking for a tablet that can maintain battery life, then this is NOT the tablet for you.", "Title": "Bad Battery Life", "Date": "January 3, 2014"}, {"Author": "Joel6960", "ReviewID": "R1XH20X21ABVM1", "Overall": "5.0", "Content": "I like that one I just upgrade your OS is also being fast, I see no slowness or latency in it. It's for my father, he plays a lot of facebook games and others. Does the job, the consumption of multimedia content.", "Title": "Tablet is very good, I like it.", "Date": "May 24, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R18B4Z921A60NE", "Overall": "4.0", "Content": "I gave this product a 4-star rating because I think it is a super tablet. I have only otherwise used an iPad, so I don't have much basis to compare to other tablets. But it does everything I wanted it to, and more. The only reason I did not give it a 5-star rating is the battery life between charges has diminished quite a bit. It is rated at 6-10 hours, I probably started at 6 hours, and am now down to about 4 hours. I attribute that to having downloaded more and more apps, but am not sure.", "Title": "Great tablet", "Date": "April 10, 2014"}, {"Author": "Marrielle", "ReviewID": "R1N6HQMWR3TS50", "Overall": "1.0", "Content": "Dell makes a very bad product with this. Never had a bad Dell PC or Laptop. The tablet overheats after 20 minutes of continuous use. Keyboard freezes up, pages freeze, tablet blacks out. This was less than 60 days out of the box. Amazon was no help. Threw me to Dell. Dell would only replace it with a Refurbished Tablet. Disappointed? No. ANGRY !!!!. had to take refurbished unit. SAME PROBLEMS RIGHT AWAY!Bought a Google  Nexus 7 2nd Generation to use. It has the very same overheating then keyboard problems!I switch between the two. Very bad experience x 2 !!", "Title": "Dell Venue 7", "Date": "March 30, 2014"}, {"Author": "Angelo Felix", "ReviewID": "R1DKPAD9F4B1UA", "Overall": "1.0", "Content": "Dell is hell-bent on blocking root attempts on their tablets. Every time developers create a root-hack, Dell proceeds to block it with their obligatory \"updates\".I guess the way Dell sees it is, the tablet belongs to Dell, even though you paid for it.", "Title": "Can't root it so it's no good to me", "Date": "February 11, 2014"}, {"Author": "yulimir \"YULIMIR MANZANARES\"", "ReviewID": "R3IRH72VL6YZKL", "Overall": "5.0", "Content": "goodexcellentvery good materialI recommend itI like his responsibilityThey are attentiverecommend the truthgoodgood", "Title": "very good", "Date": "April 26, 2014"}, {"Author": "Mitchell B. Fox", "ReviewID": "RLQ2THS6SI653", "Overall": "3.0", "Content": "I have not used my new dell venue 7 that much yet, but I have not encountered any significant tissues. A few things: I did find the display a little dim, and another review found that the display was significantly duller (less lux output) than many other tablets, including the asus memo pad hd 7. I found that the display resulting from various youtube videos were sharp and clear, with good resolution, but I found that several netlfix films, tv shows, seemed to have lower resolution and a lot of \"jaggies.\" Is that because the netflix ap in 4.2.2 is only in sd, not HD? Or does it depend on the content? I also found that text in general had a lot of aliasing (jaggies). Will the above improve with android 4.3 or 4.4? Is there any likelihood that Dell will make these available to the venue 7 soon?", "Title": "venue 7 -display dim, netflix resolution", "Date": "November 18, 2013"}, {"Author": "Kao Yian Saeteurn", "ReviewID": "R29PA1MY6JA86B", "Overall": "1.0", "Content": "This item looks like a well made tablet, however when you start to download programs from the play store, this tablet cant seem to handle apps. Most of the apps just froze and had to system shut down. I am returning this tablet.Would not recommend this at all.Now I have the apple mini and love this. The extra cost is definitely worth it!", "Title": "returning this", "Date": "March 15, 2014"}, {"Author": "Bex", "ReviewID": "R2SCQ7NM5EZ0Z0", "Overall": "5.0", "Content": "Dell is the answer to low cost tablets!!! B&N; really upset me over blocking buying games, etc. except from Google Play or their Playstore. I was told when I bought the Nook HD that I could download ANY android apps except for those that say \"for Kindle\". I hate \"Google everything\". Did you know that if you use Google Play the game manufactures and who else knows is privy to ALL of your info, including your credit card on Nook as well as the security code. I confronted B&N; about these lies, and even though I've had my Nook for over 3 months they are refunding every dime I paid for the Nook, the cover, the books & games & even a $25.00 B&N; gift card I got for Christmas. I can't wait to get the Dell Venue 7. I went straight to Dell.com & a chat popped up. I asked them everything I could think to ask. They said the Venue 7 is the best Dell tablet out there & You CAN by android apps from Amazon or anywhere else without being blocked or having your info shared! The reviews of all other tablets in the $200.00 or less price range really fail in comparison to the Dell Venue 7. Good luck!", "Title": "I hope! I researched all tablets & read all reviews. Dell Venue 7 seems to be the winner!", "Date": "January 3, 2014"}, {"Author": "Imtiaz Jamil", "ReviewID": "R23SNVX46VQVN9", "Overall": "4.0", "Content": "Nothing much to say. You get what you pay for. I'd probably recommend it people in a tight budget. The only con: The screen is pretty bad.", "Title": "Good tablet for the price.", "Date": "February 26, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00FFVYSE8", "Features": null, "ImgURL": null, "Name": null}}