{"Reviews": [{"Author": "Troglodyte \"USArmyRetired\"", "ReviewID": "RO0S4IZFNKHFY", "Overall": "4.0", "Content": "Nice unit with a lot of open standard features and interfaces, hooked it up to a Kamor 9\" keyboard protective case and it make a great gift for my Mom this Christmas. I installed some Google apps and Avast anti-virus software and had no problems, the unit is solid and has a crisp display and good screen response.  Oh and yea my Mom will get a kick out of it being Pink ;)", "Title": "Nice at a good price!", "Date": "December 12, 2013"}, {"Author": "Caroline Castillo", "ReviewID": "R2PCQP8OJPZ8XN", "Overall": "5.0", "Content": "I loved this tablet...it is faster than my husbands which is a dragon touch...I used it for about a week and then it locked me out...I was very pleased to get a full refund rather quickly upon mailing it back free of charge...but purchased another one since i was so pleased with the first one and very unhappy to see that their was a price increase...I felt I should have been charged the same amount or less due to problems with tablet that were no fault of mine..", "Title": "Pronto Tec 9inch Tablet", "Date": "February 15, 2014"}, {"Author": "Jacqueline", "ReviewID": "R1R2GAVF5SYAYW", "Overall": "4.0", "Content": "I love it. But, I only wish the speakers were louder. When I play music it isn't very loud. The volume on my android phone is substantially louder.", "Title": "Love it.", "Date": "January 12, 2014"}, {"Author": "erica posey", "ReviewID": "R1LXFOWE8T5UF2", "Overall": "3.0", "Content": "It's cool for the money for my daughter I have been using it to see how it work so its good its really good for kids", "Title": "its cool", "Date": "December 26, 2013"}, {"Author": "rpv", "ReviewID": "R29H0NTLDOXMTG", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2ONMYG2MMTR4DembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2ONMYG2MMTR4Drefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2ONMYG2MMTR4DchiDiv\").innerHTML = document.getElementById(\"cv_mo2ONMYG2MMTR4DhiddenPre\").innerHTML;\n};\ncv_mo2ONMYG2MMTR4Drefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2ONMYG2MMTR4Dso;\t   \n\n\nfunction cv_mo2ONMYG2MMTR4DloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2ONMYG2MMTR4Dso = new SWFObject(swfLocation, \"cv_mo2ONMYG2MMTR4DAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2ONMYG2MMTR4Dso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2ONMYG2MMTR4Dso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2ONMYG2MMTR4Dso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2ONMYG2MMTR4Dso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2ONMYG2MMTR4Dso.setAttribute(\"height\", swfHeight);\n          cv_mo2ONMYG2MMTR4Dso.setAttribute(\"width\", swfWidth);\n          cv_mo2ONMYG2MMTR4Dso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2ONMYG2MMTR4Dso.write(\"cv_mo2ONMYG2MMTR4Dflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2ONMYG2MMTR4D', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2ONMYG2MMTR4D';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2ONMYG2MMTR4D', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2ONMYG2MMTR4DloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2ONMYG2MMTR4D\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m38FWRQYJTMU31\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m38FWRQYJTMU31\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R29H0NTLDOXMTG\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m38FWRQYJTMU31/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2ONMYG2MMTR4Dduration')) {\n      document.getElementById('cv_mo2ONMYG2MMTR4Dduration').style.display='none';\n    }\n    cv_mo2ONMYG2MMTR4DloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2ONMYG2MMTR4DloadSwf(movieID, playerVersion) {\n   return _cv_mo2ONMYG2MMTR4DloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2ONMYG2MMTR4DnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2ONMYG2MMTR4D', 0, h);\n}\n\nfunction cv_mo2ONMYG2MMTR4DresetPlayer(w,h,bw,cc) {\n  cv_mo2ONMYG2MMTR4DnewHeight(h);\n\n  cv_mo2ONMYG2MMTR4Dso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2ONMYG2MMTR4Dso.addVariable(\"cacheCode\", cc);\n  cv_mo2ONMYG2MMTR4Dso.setAttribute(\"height\", h);\n  cv_mo2ONMYG2MMTR4Dso.setAttribute(\"width\", w);\n  cv_mo2ONMYG2MMTR4Dso.write(\"cv_mo2ONMYG2MMTR4Dflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2ONMYG2MMTR4DRollOverImg = new Image();\ncv_mo2ONMYG2MMTR4DRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81NmdTEqaFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2ONMYG2MMTR4Dpreplay = document.getElementById('cv_mo2ONMYG2MMTR4DpreplayImageId');\nif (cv_mo2ONMYG2MMTR4Dpreplay) {\n  cv_mo2ONMYG2MMTR4Dpreplay.onmouseover = function() {\n    cv_mo2ONMYG2MMTR4Dpreplay.src = \"http://ecx.images-amazon.com/images/I/81NmdTEqaFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2ONMYG2MMTR4Dpreplay.onmouseout = function() {\n    cv_mo2ONMYG2MMTR4Dpreplay.src = \"http://ecx.images-amazon.com/images/I/81NmdTEqaFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2ONMYG2MMTR4Dpreplay.parentNode;\n\n  var cv_mo2ONMYG2MMTR4DcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2ONMYG2MMTR4DcurrentClick) {\n      return cv_mo2ONMYG2MMTR4DcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 8:02 MinsProntoTec 9 inch PT9 series is an All Winner Dual Core A20, Cortex A9 at 1.5GHz  and is a very good value in price per performance.  It has 512 MB RAM and also has a GPU. This runs Android 4.2.2 Android. I will go into the specifications and review based on my user experience.  The dimensions are 9.25 x 0.43 x 5.91 in and weighs just over a pound. The screen resolution is 800 x 480. Please see my video review for details on performance - I do Temple run Oz and YouTube which are best indicators of the performance.Most of tablets have ARM based processors.  This makes sure all of the Apps in Google Play ecosystem available.  If you look at my video review, I have screenshots showing the CPU speed and other kernel details.  The screen is 800 x 480 Pixels. This supports a wireless with Wi-Fi (802.11 BGN). Tablet has 2 cameras - front and back.  This has 8 GB storage and you can use an extensible SD card slot as well as cloud storage.  Though not built in, the tablet supports external 3G/WCDMA dongle.  Battery, 4200 mAh came for a good 8 hours with moderate usage. Battery usage really depends on how heavy you use the system. Overnight it drained very less. Mobile Networking was on by default. I switched off as I was using only Wi-Fi mode.  I suggest you go to Settings and tweak things which are not required. Developer Mode was enabled by default. I turned it off. The capacitive touch screen was really good, some occasions I had to press little harder and at right locations, but pinch-zoom, highlight, Copy-Paste all worked very well.It is great the tablet has micro USB Port, 3.5-mm stereo Headphone Jack, built-in speaker, microphone, micro SD card slot and a DC Input Jack. Note that for powering through wall adapter you need to use the provided DC input jack. Speaker was loud enough. In a room, once I keep the tablet in a stand it was good. Speaker is on the backside, so you don't want to lie this down on back as it will hamper the audio coming out. This is a design I hope changes in Android manufacturers in future. Android tablets are really customizable to your heart's content. It is here where Prontotec shines. Using a native Android 4.2.2, they have achieved something at a low cost. This can have a very wide reaching audience. In many countries, where affordability is key, having a tablet like this with Wi-Fi is a big boon. Imagine having entire Wikipedia at your fingertips for a child. I tried few educational applications on this. I consider this as a big hit with educators than gamers.I tried Google Voice Search and asked \"what is capital of United States\". The voice recognition part was great and it was able to recognize and dictate the answer. I also tried Wolfram Alpha and asked bunch of questions. E.g., what is world population, what is population of China etc? The microphone picked up correctly and answered through Wolfram Alpha.  Apps like Calculator, Gmail performed flawlessly. I watched multiple video through few applications. Obvious first choice was YouTube. Was able to search and watch videos. I used TwIT.TV app and watched some segments of a podcast (video streaming through Wi-Fi). Again smooth playback. Handholding is really easy given the weight of it. It was a colorful blue; no heat observed handholding the tablet. It is plastic, and buttons are made of plastic. For a kid, this is perfect also though the feature set is equally appealing to an adult. I was so enamored with low cost computers in late 90s and it seems I am reliving them with tablet. If you want to listen to podcasts/watch video then this is perfect. Just keep it in a stand and connect to power. See my video review to get an idea of what I am referring to.The keyboard dock makes it very easy to type documents in Google Drive or other note taking apps like Evernote. The USB attached keyboard is rugged and keys are smooth to type. This is an excellent innovation and dual serves as a case + keyboard combo. It also serves as a stand for watching playback videos.For a computer geek, it is a challenge to design something with minimal resources - screen resolution, RAM, storage, chipset. Prontotec has designed a tablet with budget conscious customer in mind. Out of the box, it worked to my satisfaction given the specification and price. Once powered on, it directly came to a working condition. No need to setup account prior to using. I signed with Wi-Fi, the Wi-Fi router was in one bedroom. I configured in another room separated by two rooms. There was no issue with Wi-Fi signal. Once connected, I created a Google account as well. I generated a Application Specific password as I had 2 factor authentication. Once signed on, I updated applications like YouTube, Google Keyboard etc. I also downloaded few applications like TwitT.TV, Tetris from EA, etc. I downloaded Chrome and browsed few websites. Listened to Audio / Watched Video. Out of the box battery needed a full charge. Initially without charge, I did a video stream and wanted to see how device shutdown. Sure enough it shut down as battery drained. Powered on after charging and everything was fine.Chinese chip-maker Allwinner's A20 is a dual-core design with 512KB L2 cache, dual-core Mali 400 graphics and 2160p HD video playback support.  This tablet has 1080p support. The Allwinner A20 CPU has 2 core(s), resulting in good multi-tasking when compared to a single core processor. As a result of following the Harvard architecture, the CPU has a separate Level 1 instruction and data cache leading to a slight improvement in performance over a unified Level 1 cache. The instruction cache is only used for storing instructions and executes in a sequential manner. The data cache stores data used by instructions; the point of access or storage is generally specified by an instruction. This processor is based on the Reduced Instruction Set Computing (RISC) design strategy enabling instructions to execute faster, as opposed to the Complex Instruction Set Computing (CISC) design strategy, which is generally slower at executing due to lengthy instructions.I am impressed enough at the engineering for the price/value/budget it delivers. The ARM Cortex(tm)-A9 processor is the power-efficient and popular high performance choice in low power or thermally constrained cost-sensitive devices. Cortex-A9 is available as a single processor solution offering an overall performance enhancement of well above 50% compared to ARM Cortex-A8 solutions. Cortex-A9 MPCore offers up to 4 processors delivering when needed, on lightweight workload as well as peak performance. Its configurability and flexibility allows Cortex-A9 to scale across a wide variety of markets and applications.  This is from ARM specification. Prontotec has pulled in many off the shelf components and assembled at a terrific value. I was particularly interested how it performs to streaming video. That is the golden test and it performed beautifully!", "Title": "Excellent tablet for all round purpose. Unbeatable price!", "Date": "March 29, 2014"}, {"Author": "Carlos Reyes", "ReviewID": "R1AK6L7SSX0XGI", "Overall": "5.0", "Content": "speed,weight and quality is verry good for my child good good good i am a prouved this tablet pronto tec9", "Title": "colors", "Date": "January 7, 2014"}, {"Author": "Maria Moore", "ReviewID": "R3INS9FEINPHKT", "Overall": "5.0", "Content": "I am very pleased with this tablet bought 2 for my 6 & 5 year olds. The screen is very responsive the camera is not the best but other than that it is a great tablet", "Title": "In Love with this Tablet", "Date": "January 31, 2014"}, {"Author": "Rachell", "ReviewID": "R223JB68UDYLGV", "Overall": "5.0", "Content": "I love this tablet. The battery life is amazing. It does everything I wanted it to do. Very easy to learn how to run. It was at my house 2 days before I excepted to even look for it. All around very pleased!", "Title": "Very pleased", "Date": "March 15, 2014"}, {"Author": "Brice  Beach \"Brice Beach\"", "ReviewID": "R1BAMFJJJ8UTZM", "Overall": "1.0", "Content": "bought two of these for my grandchildren-what a mistake-constantly freezes up, will not play netflix-won't be buying from this bunch again-total rip-off!!!", "Title": "junk", "Date": "June 3, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2AJKKDA3SFI33", "Overall": "3.0", "Content": "I am FAR from tech savvy. However, even I found this tablet to be rather slow and clumsy at times. It doesn't have a lot of memory, so if you are ordering it, make sure you get a micro SD card at the same time. I use my tablet mostly for social networking, reading ebooks(kindle app), and watching streaming movies/series, with the occasional game being played. It didn't take me long to realize that this was not the tablet for my use as it turned out to be very slow, and locked up quite a bit. However, if you're new to tablets and just want a starter to see if you will enjoy them, you can't beat the price for a simple system. I only had it a month before the headphone jack broke up inside it, so I couldn't watch movies on it anymore. I have since moved up to another tablet, and passed this one on to another family member who was new to tablets. No further problems with it, but it would be nice if the option to use headphones were still there. Overall, you get what you pay for. It's not a great piece of equipment, but for a child or someone older who just wants to do the basics, it works fine.", "Title": "good for basic user", "Date": "May 25, 2014"}, {"Author": "shawna graves", "ReviewID": "R394L9CDO5TCKC", "Overall": "1.0", "Content": "Havent even used this tablet 5 times and just stoped working.Tablet is just dead nothing not even a light comes on to charge the battery!", "Title": "DO NOT WASTE YOUR MONEY!", "Date": "May 23, 2014"}, {"Author": "Shiva Seepaul", "ReviewID": "R17ZJVEOTEGPE7", "Overall": "5.0", "Content": "Excellent", "Title": "I love it", "Date": "May 6, 2014"}, {"Author": "Seafisch", "ReviewID": "R27ZTYW3XKBJVB", "Overall": "2.0", "Content": "Worked fine . . . for 1 week and then stopped working altogether.  Notebook would not turn on.  Sent it back.", "Title": "Worked for a week", "Date": "April 25, 2014"}, {"Author": "Ruth", "ReviewID": "R7I7ENRNZCN8U", "Overall": "1.0", "Content": "PLEASE DO NOT PURCHASE THIS ITEM!!The tablet works great for 2 days, but on the 3rd day it would not power up at all it was very disappointing!", "Title": "Good Product: For A Day Or Two!", "Date": "April 15, 2014"}, {"Author": "MeshaunH", "ReviewID": "R1SCO8D90JKU3J", "Overall": "3.0", "Content": "I like the tablet but the only thing that I was dissatisfied with is the screen, it made everything look pixalated and in poor quality, and that was the only deal breaker for me. I would recommend this for a child and not a adult at all.", "Title": "I wish the screen was better", "Date": "April 9, 2014"}, {"Author": "TJ", "ReviewID": "R1BMF39IRZK3Q8", "Overall": "5.0", "Content": "This may b cheap but works great and I would recommend if u like pink everything works great on it", "Title": "a", "Date": "April 7, 2014"}, {"Author": "Wilson Machining", "ReviewID": "R225GR8KVQOOMC", "Overall": "1.0", "Content": "Tablet is slow, buttons sometimes stick, screen is very sensitive to the touchis just an ok tablet to have", "Title": "tablet", "Date": "April 7, 2014"}, {"Author": "Ann", "ReviewID": "R1KOBNVA1FE00I", "Overall": "5.0", "Content": "this is the best thing  keeps her off my phone she is able to play her games ...  it works quick and she doesn't complain at all  ...", "Title": "daughter loves it", "Date": "April 6, 2014"}, {"Author": "danielle", "ReviewID": "R19S5S5SYUXMBC", "Overall": "1.0", "Content": "Just got it, paid for overnight and it doesnt even work, waste of my money. Even if it is sold as refurbished it should be checked to make sure it works befor sent off", "Title": "dont buy", "Date": "April 4, 2014"}, {"Author": "Anna-Marie Batt", "ReviewID": "R3II1UZE4CNGWO", "Overall": "2.0", "Content": "I purchased this for my daughter and it came with the screen scratched, its a hassle for me to return it and hope to get it back on time for her birthday, especially when my town is closed off from a major landslide!", "Title": "scratched screen on brand new product", "Date": "April 2, 2014"}, {"Author": "Ilovesailorminimoon", "ReviewID": "R2OG08JX2IFRJW", "Overall": "4.0", "Content": "I bought this tablet for my little girl and it works,But their one little problem their a video that I can't delete that is Gangnam style that came with the tablet Kinda weird.Do you have that problem too?", "Title": "Good tablet for my girls", "Date": "March 11, 2014"}, {"Author": "VERNON DUNN", "ReviewID": "R13H5F1AICJUNP", "Overall": "1.0", "Content": "When i first got it netflix wouldn't work along with updating the abdoe app and updating the tablet itself. Also out of no where the tablet froze and started blinking for no reason. It turned off and now it won't turn back on. It really sucks!", "Title": "defective", "Date": "January 17, 2014"}, {"Author": "Keta Jolly", "ReviewID": "R27AW45XDBIFOG", "Overall": "1.0", "Content": "This item will only work for one week before dying or wont turn on, after usage. I would not waste my time", "Title": "don't buy", "Date": "March 25, 2014"}, {"Author": "Alas, 'tis I!", "ReviewID": "R2OGDV2Y5154BE", "Overall": "2.0", "Content": "I have some 2nd gen Nexus 7 tablets as well as iPads. And I have this. It looks and feels cheap, is slow, doesn't connect well to the wifi network, doesn't work with an external mouse and keyboard (wha?) and can't even browse a server on our Intranet. Of course the Nexus 7s and iPad can browse the Intranet site. Of course they can.", "Title": "Get what you pay for", "Date": "March 7, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00F4TUAA2", "Features": null, "ImgURL": null, "Name": null}}