{"Reviews": [{"Author": "julian", "ReviewID": "R1T9E6CQAFMYP6", "Overall": "5.0", "Content": "The specs speak for themselves. Quad core processor. A whopping 2gb RAM. But what really sold it for me was the cameras. Front is a full 2mp and the rear is a complete 5mp. Other tabs have a weak 0.3 mp front and a dismal 3 mp rear camera. Furthermore the resolution is supreme. Even other tabs that were recently released on 5-1-14 have less RAM. So let's review: higher performance, lower cost. The specs compete or go above and beyond the other devices on the market. I was sold even before I had it in my hands, but now that I do I rave about it to everybody.", "Title": "More device for the price", "Date": "May 5, 2014"}, {"Author": "Jeremy", "ReviewID": "R3TZVSXOFDJH9E", "Overall": "5.0", "Content": "UPDATEAfter using this tablet for about a week or two I noticed that after rooting, installing battery saver apps, recalibrating the battery, and hunting down and deleting everything causing cell standby, the tablet still had an insanely quick battery drain.My order was for a used very good condition tablet. Product was eventually deemed defective instead. Luckily Amazon's return policy is very good. That being said I've since sent it back (free) and am awaiting money to be credited back to my account.All in all I would recommend this tablet for someone that likes a challenge and tinkering around on a more technical aspect. Sure it has snags, occasional crashes, and would lag on more than one occasion but the screen really is impressive.I did hate the resistive touchscreen with a passion and input adjusting only did so much to address that issue.I picked up the kindle fire HDX 7 instead and haven't looked back since. It is so incredibly smooth and vibrant-------I picked up this tablet from amazon warehouse deals at a considerable discount. The package read, \"Used - very good - in original packaging, package may come damaged.\" Upon it's arrival i noticed that the packaging didn't look damaged at all. Everything looked rather good. The tablet itself came with a screen protector on it, yet you could tell that it was gently used.The screen is great. It's decently bright, not as color accurate as my LG g2 but still very sharp. I noticed it was a bit laggy and that it had a considerable battery drain. After investigating i found that cell standby was the culprit.I began to investigate how to turn it off. All signs pointed to rooting this tablet. After researching the tablet quite a bit and finding absolutely nothing. I came back and read a review on here that mentioned using a program called kingo root.It didn't work rooting my tablet at my girlfriend's house, but on my asus g75vw at home it rooted it no problem. It was really easy. That being said i disabled the apps behind cell standby and then proceeded to download apps such as performance booster (root) donate edition, battery booster, android assistant and some touch screen sensitivity app.All those combined creates a budget tablet that is both zippy and powerful.It pretty much blows whatever you can get in the 150-250 (as of 4/25/2014).I do have some gripes.1. Charger sometimes stops charging and i have to wiggle it around a bit for it to work. It doesn't really wiggle so i find myself thinking i'm crazy but it seems to start working again every time. If i plug it in and make sure its charging then leave it, it will not stop the charge process, so that's good.2. Currently stress testing it so i'll update it if i run into anything...", "Title": "Great tablet for the intermediate user. Not for casual users probably.", "Date": "April 24, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00FNPMFYG", "Features": null, "ImgURL": null, "Name": null}}