{"Reviews": [{"Author": "Ciaran", "ReviewID": "R2E0R517CXDV9A", "Overall": "5.0", "Content": "Before starting  my review, there are a few things that I would like to mention.1) This is my first experience with an Android tablet. I have owned several iPads and a couple of windows-based devices, but this is my first Android.2) The title of my review is probably the most important sentence in this entire review.3) I received a sample of this tablet to test from the manufacturer on the understanding that I would review this without bias. The following is my honest opinion.--------------------------------INTRO--------------------------------As mentioned, I am a new Android user. I'm not going to lie - I've been an Apple-lover for many years now, and use an iPhone and iMac on a daily basis. That said, I've also been a Linux user since 2009 (mostly Ubuntu with some Tails and Arch to test my webserver's security) and am very aware of the pros of using linux-based android devices. I decided to test this tablet because it seemed to offer quite a lot for a very reasonable price tag.Some of the devices specs:- Dual core processor- High Definition Screen- Above-average construction- Dual Cameras (one front, one back)- Running on Android 4.2 (Jelly Bean)- Has HDMI output- Comes with Google Play pre-installedWith some promising specs, I was excited when my tablet arrived and quickly tore open the box.--------------------------------OUT OF THE BOX--------------------------------A few things I want to point out. The first is that this device ships with a screen protector already applied. While you can keep it on, it really diminishes the quality of the screen and I highly recommend removing it (as does the manufacturer). Secondly, there is a piece of paper included with the table that recommends installing some sort of \"App Killer\" to close background apps for better performance and battery life. I ignored this at first, thinking Android's app manager would be enough. It wasn't, and after installing an app to automatically and periodically kill certain apps there was a noticeable increase in both performance and battery life.Inside the box is the tablet, a wall charger, a USB adapter, a user guide and various other bit of paper (some of them already mentioned). My tablet shipped about 75% charged, so the first thing I did was allow it to charge fully before using it, so as to get an accurate gauge on battery life during usage.The first thing I noticed (after removing the screen protector) was just how sharp the screen was. Included on my tablet was an HD video of a popular Chinese (I believe) girl band, so I fired that up to see how everything looked. I was and am impressed. The quality was certainly better than watching HD videos on my iPhone 4, and arguably better than videos were on my second gen iPad. While I'm sure that Retina screens (and HD screens from brand-name tablet makers) blow this thing out of the water, for less than $70 I was extremely impressed with the quality. It may be a little bit too sharp for some people's tastes, but you certainly get used to it.--------------------------------THE EXPERIENCE--------------------------------Note: this will be a long entry broke up into different sections. I apologize in advance for the wordiness, but since my experience with this tablet varied while performing various functions, I believe it to be necessary. I have added individual scores for each section.The tablet itself has a nice feel in the hands - I've never used a 7\" tablet before and I find it much more comfortable to use for longer periods of time than larger tablets. On top is a lock button, also used for turning off the device, as well as a back button, headphone jack, HDMI port and MicroUSB port for charging/connectivity.MEDIA - 8/10I have really enjoyed media consumption on this tablet. Watching videos is near flawless - even large movie files played from a MicroSD card do so without issue, although anything over 1GB is going to make the tablet struggle so I would consider compressing movie files to 700MB or so for optimal performance. Listening to music is just fine, both from the SD card in the music player and using the Pandora app. Youtube is interesting - when I first fire up a video it struggles a little bit (for about 15 seconds or so), but once it gets playing, I have had no real issues, even while watching 1hr+ documentaries. I do recommend downloading apps for functions like this, especially Youtube. They are optimized for tablet performance and almost always result in a better experience (even my iPhone prefers the Youtube app to watching videos in Safari). My Netflix experience was very similar to Youtube - some stuttering every now and then but totally usable. I do want to point out that the built-in speakers on this tablet are not great...they simply lack the power for anything other than watching videos in bed/on the couch in a quieter environment. I would recommend an external speaker/headphones if you intend to use the tablet for media. I have not yet tried using the HDMI out port, but will do so tonight and update my review.BROWSING - 9/10Browsing the internet has been great - every now and then I've had the browser crash, but mostly on plugin-heavy websites. Reading the news, blogs and general browsing is excellent! I did find Google Chrome to be pretty slow, but the included browser (based on Google Chrome seemingly) and Firefox both work fine. I mainly use this tablet for browsing Craigslist, various news websites and a couple of forums - thankfully all of them work well.GAMING - 7/10I don't game much (at all), but decided to install Temple Run to see how the tablet handled it. On first launch, it crashed and I had to use my App Killer to close it out completely. I then opened it up again, and it actually played pretty well. Some of the cinematic sequences weren't totally smooth, but gameplay was definitely doable. I'll try a few other gamesSKYPE/GOOGLE HANGOUTS - 7/10Using Skype was decent. I am told the microphone on the tablet sounded fine, and I didn't have any issues with performance. Switching to video caused a little bit of stuttering (sort of like with Youtube), but eventually kicked in and was as good as my iPhone so no complaints there. Again, headphones are recommended unless you're in a quiet environment.TAKING PICTURES - 6/10Though the camera works fine for video calling, I do not recommend choosing this tablet if you want to take important pictures, the quality is just not that great.EMAIL - 10/10Using email on this device is excellent - on par with using it on my iPad. I have had no issues with the included mail app on Jelly Bean, and the A7 handles it fluidly, perhaps the most fluidly out of any other app. I quickly set up my seven email accounts (yes, a lot I know) and can now receive and respond to email without any issues.--------------------------------THE DOWNSIDES--------------------------------- SpeedAs mentioned, this tablet does struggle with certain CPU/Memory-intensive applications. Every now and then a key press won't register for a second or two and other little annoyances. I was just about to type: \"If you want a super-fast tablet, this might not be for you\", but I really hope that nobody is looking at a $70 tablet expecting it to be \"super fast\".  Again, after installing an app killer I found the performance to increase noticeably, so I highly recommend doing so.- SoundThe built in speakers are not great. This may be a deal breaker for some, but I almost always use headphones or an external speaker any way and did so with my iPad too.--------------------------------WHO IS THIS TABLET FOR?--------------------------------I can think of a plethora of people who will enjoy this device, so I'm just going to list them:- People who can't afford a more expensive tablet- People who would only use a tablet for general media consumption (web surfing, youtube, etc.)- People who want a cheap tablet for kids (this is an excellent choice)- People who aren't sure about Android and want to try it cheaply- People who don't care about having a fast device--------------------------------CONCLUSION--------------------------------Overall, I keep having to remind myself of the price. It's not the fastest or slickest tablet on the market, but did exceed my expectations for a sub-$80 electronic device. With decent performance, a really nice screen and a solid operating system, I can definitely recommend this product. Given that manufacturers like Coby are putting out far inferior tablets for the same (or greater) price, if you're in the market for a cheap tablet and you're not willing to spend $150+ on a brand name tablet, this is definitely one to consider.I went back and forth between a four and five star rating (in regards to my title) - in the end, price won the battle. You simply cannot beat this tablet for the price, and in that respect, it deserves five stars for value for money. This is not meant to be an iPad, nor is it mean to be a Nexus. It is an affordable tablet that puts mobile computing in your hands for the price of family trip to the movies, and I'm overall quite pleased with it. If Amazon allowed half star ratings, I would probably go with 4.5 stars, but given that doing so is not possible, five stars it is.", "Title": "A four-star tablet at a five-star price.", "Date": "November 4, 2013"}, {"Author": "Rooster", "ReviewID": "R718VTA2AIYG4", "Overall": "5.0", "Content": "All you geniuses who have problem try reading the direction FIRST!  It says charge for 10 hours before you do anything.  Then install app killer so you don't get freezing and battery drain.  It's what is know as an ID 10 T error.  Put those characters together and you'll understand.", "Title": "Be smarter than the tablet.", "Date": "December 25, 2013"}, {"Author": "Raycard M. R. Lovera", "ReviewID": "R4YCSSVS7OCO2", "Overall": "4.0", "Content": "I just bought this tablet (first tablet). In my honest opinion its a first class tablet, really great if you are a beginner using tablets and the price is very convenient. I've followed the golden rules which I found out by doing research on android tablets which are : (downloading an App Killer, turning the brightness down, downloading Nova to be my launcher, download Youtube player for faster viewing of their videos). If you follow these rules, your battery life gets a huge boost, you can have a better tablet overall.Downside is that it doesn't come with its won earpiece, its a bit slow at times(with App killer installed it gets a bit faster), the on screen keyboard gets stuck while writing at times. The volume is really low even on max. Overall I'm really glad I bought this tablet.", "Title": "Great Choice", "Date": "November 9, 2013"}, {"Author": "Don R Medina", "ReviewID": "R1VZ3EUZ5E7H41", "Overall": "4.0", "Content": "I purchased this tablet as a first time tablet owner. While there are some issues with power consumption and a less than great camera, it's growing on me. My games play well, videos are clear. Overall I'm happy. Not a bad tablet for the price.", "Title": "It's growing on me", "Date": "November 13, 2013"}, {"Author": "Melanie C \"MC\"", "ReviewID": "R1CT3J9ALA29EL", "Overall": "5.0", "Content": "Ok, I've wanted a tablet for a while - but I didn't want to jump in for $300 or more, until I saw if I liked it or not, and if it would actually fit a need for me, first. I found this Dragon Touch on Amazon for $65, it arrived fast - but in the meantime, I went back and read all the reviews here. The two major complaints that have caused this tablet to be rated a 3-star item are: 1.  Died after 1 week, and 2. Would not take or hold a charge.To this point, the instructions in the box are quite clear - it tells you to disregard any charge the tablet may have, and BEFORE USE, charge it at least 10-hours, NOT ONCE, BUT TWICE! After that, 7-hour charges are sufficient for maintenance. Ok, easy enough to follow instructions. I did just that, I charged it about 11-hours the first time, almost 12 the second. I am getting about 3-4 hours of heavy app-installing use out of it, 4+ hours if just browsing or surfing.It is a nice pad, relatively fast for the price, feels solid, well-built, has the most-current Android OS on it, and has decent memory for the price (8-gb). It can be expanded with a micro-SD up to 32 more gigs, and has an HDMI and 1/8 mono output port, as well as a micro-USB input for charging and accessing USB devices. It has a rotating screen, for those times when you are watching Netflix and want wide-screen, instead of tiny vertical screen (just lay it over, the gyro senses it). As with all tablet Android devices, it can play music, movies, take pictures (still and video, but the resolution is crappy - hey, come on, it's a $65 tablet, what did you expect, a 2-Meg Pixel camera?) It has two cameras, built-in (crappy) speakers, and a microphone. Plug in a nice set of external speakers, and it actually has decent sound output. I have not HDMI'd it to my TV monitor, but I am sure that works well, too.I have not had problems with rebooting, or needing to. Apparently, like most computers, if you install junk, you will have trouble - if you stick with mainline stuff, you will have few. I use mostly browsers, news readers, Netflix, etc., so staying with mainline stuff, I don't have a lot of quirky programs that glitch me out. Resolution is excellent, I can watch NOAA radar live on it, and the detail resolution on it, or Google Maps is amazing.IF anything, the battery life is still expanding - but I have noticed that it slowed down when I got ALL my apps on it, as I started filling memory up. Time for a 32-gb chip. The pre-loaded apps are great, and help get you going, and the only recommendation I would offer is to have them also put Amazon Apps Store on it default, too. (right now, it only has Google Play...but you can just go to amazon.com and go to 'apps for android' to get to the store app).Anyway, this is a GREAT tablet for the money. Obviously, anyone can review the tablet, but when they tell you it died right out of the box, that tells me that they used it RIGHT OUT OF THE BOX, even when the box said to NOT DO THIS. Follow instructions, and live a much more pain-free life. I can't recommend this tablet enough, just read what it says when you open it, and you will be fine.", "Title": "Great Tablet - Ignore the low reviews, and here's why", "Date": "April 18, 2014"}, {"Author": "Sparrow1988", "ReviewID": "R1J7XN2KK8XOZZ", "Overall": "5.0", "Content": "Dragon Touch A7 met all my expectations. Easy to set up and intuitive, user friendly. This 7\" is a very good size for viewing and holding in one hand. I've installed a lot of apps and movies and it's still running good. Antutu score is over 10k. A lot of capability for under $100. I highly recommend.", "Title": "Great value, great quality.", "Date": "November 5, 2013"}, {"Author": "katdog", "ReviewID": "R3QH6AQHA5GLC6", "Overall": "5.0", "Content": "I read quite a few reviews before purchasing for my son.  It works great and he loves it.  Good first tablet for a 12 year old.  He didn't need anything too fancy or high tech.", "Title": "Good Tablet for the price", "Date": "November 23, 2013"}, {"Author": "Mr. Epic", "ReviewID": "R2CV23LTAKKCK2", "Overall": "4.0", "Content": "I bought this tablet for $60. The actual box that they put it in is very neat and tidy. The box comes with-the tablet (duh)-wall charger-micro usb to usb cable-SOMETIMES with a female usb to male micro usbPerformance:With the tablet only being $60, the performance really wasn't that great. It can run casual games like subway surfers, temple run, clash of clans, etc. Though when I tried 3D intensive games like Dead Trigger, it ran badly at 15 FPS. Though other apps worked just fine. You DON'T need a app killer though, since it's android 4.2.2; it comes with a built in multitasker. The screen though doesn't have good calibration, I find that I have to tap slightly above something for it to work. 90% of the games on Google play where compatible with this device.Camera: They should have not even put a camera, because it sucks THAT bad. It's only .3 megapixel, which is VERY little; though it could still scan stuff like QR codes just fine.Sound: Everyone says the speaker sucks, not as good as ones that items like the iPad have, but it's moderately loud, and sound quality if O.K.Durability: This is where the tablet completely lost a star, I bought this tablet and it only lasted for 6 days. I dropped is from a measly 1 foot, and the screen cracked, but the crack was under the screen, I tried to use the screen, but it didn't work. Amazon issued me with a refund and I bought a another one. I HIGHLY recommend a case, without one, you will regret it.Defective tablets: I bought my SECOND ONE, I used it, and from the first day I ever had it, it would turn off randomly; but I found a fix. When ever I want to lock the tablet, I don't press the lock button , but just wait for it to auto turn-off.Battery: The battery only lasts 4 hrs, without WiFI, and with Wifi it's 3-4 hrs.What really annoys me is people saying the tablet it slow and stuff. People are comparing this cheap $60 to tablets that cost $400.As for the reviews that say that it can't hold charge, the first thing you must do right after you get it is to charge it for 10 hours, even if it says it has 100% right out of the box. And to keep it in good condition, it says to charge for 7 hour periods after that. In which I just turn the tablet and do an overnight charge.This tablet will suit you if you:-play casual games-use the internet-watch YouTubeNOT GOOD FOR:-Heavy gaming-if you want a super fast tablet-super fast typing", "Title": "OK tablet, though big hassle", "Date": "April 20, 2014"}, {"Author": "Alisha Arias", "ReviewID": "R1YYJ9K5CP7LRR", "Overall": "5.0", "Content": "My daughter loves it! She uses it for school and games. Very good purchase. She has nothing bad to say about her dragon touch.", "Title": "Dragon Touch tablet express", "Date": "February 5, 2014"}, {"Author": "Laowai", "ReviewID": "R16W2A2HAXF0BC", "Overall": "1.0", "Content": "If it didn't stop working after 7 days of use then it would have been ok for kids 1st tablet, but it did.  It died after just one week and wouldn't turn on again.  Amazon was nice enough to refund the purchase without a problem.", "Title": "Died after 1 week", "Date": "December 7, 2013"}, {"Author": "judy Noyola", "ReviewID": "RV0AIU60SD946", "Overall": "1.0", "Content": "I purchased one last year and the tablet didn't wanna work at all. Because the box was damaged and the tablet had a chip on the corner.", "Title": "tablet was damaged", "Date": "June 6, 2014"}, {"Author": "J. Refenes", "ReviewID": "R3423PL7ZOX5UF", "Overall": "5.0", "Content": "This is a great first tablet for a 6 and 11 year old.  The charger that comes with it is slow, but works just fine.", "Title": "Good Product", "Date": "June 1, 2014"}, {"Author": "Daddy Dav", "ReviewID": "R44NCT7KOL7UW", "Overall": "4.0", "Content": "Bought this for my son to play youtube videos on and didn't want to invest too much money in something he is likely to break.  It is doing a great job so far connecting to wifi and playing videos.", "Title": "Great deal", "Date": "May 31, 2014"}, {"Author": "terra hatter", "ReviewID": "R16PBCBGPK8VU3", "Overall": "5.0", "Content": "It was a graduation present for my son, and let just say its like a glove in his hand. Really appreciated", "Title": "GRADUATION GIFT FOR MY SON", "Date": "May 31, 2014"}, {"Author": "Stormchaser.johnson", "ReviewID": "R3VV8QY51XDMEI", "Overall": "3.0", "Content": "I returned this tablet.As a frequent user of tablets, I was accustomed to typical wifi range.  This device could not remain connected, even though my old tablet and my wifes tablets would easily stream Netflix at the same distance to the router.ProsGood lookingGreat priceDid remain connected within 15 feet of the router.ConsConsistently dropped wifi at 25-30 foot of the router, when my phone and other devices did not drop wifi", "Title": "needs improvement", "Date": "May 29, 2014"}, {"Author": "Mother Theresa \"Mother of 4\"", "ReviewID": "R1LOVKZBCH1LAU", "Overall": "1.0", "Content": "Very slow. Memory won't even hold the \"smurfs\" download.Broke within a month... with no warrenty.NOT WORTH THE MONEY", "Title": "not worth the money", "Date": "May 27, 2014"}, {"Author": "sam12587", "ReviewID": "R12ADRIPFMZ3PL", "Overall": "5.0", "Content": "I bought this for playing Pandora at my kid's bedtime & checking emai/internet while in bed - about 2 to 3 hours a day. I have not been trying to use this as a primary device.  It's been almost a month & it works great. The sound is Ok for a mobile device, I am probably going to get an external speaker eventually. I have been able to play videos for my online college course & access e-text books fine.  Pandora seems to hogg our bandwidth but the Dragon tablet has been performing fine otherwise. I reboot every 3-4 days for best performance. If I put off rebooting then it does freeze up occasionally. Battery life has been very acceptable compared to other mobile devices I support.", "Title": "Has been working great so far", "Date": "May 25, 2014"}, {"Author": "Juanita R.", "ReviewID": "R28AYHIHPL205O", "Overall": "5.0", "Content": "Bought 3 for Christmas.  My family loves them.  Easy to use with minimal knowledge of tablets.  Good size for easy carrying.", "Title": "Excellent", "Date": "May 25, 2014"}, {"Author": "JLG928", "ReviewID": "R2DJ88F836XPRE", "Overall": "1.0", "Content": "This was definitely a mistake ... can't get the unit to remain turned on and while customer support was wonderful in getting back to me via emails, they weren't able to provide any kind of user's manual or online tutorial that were able to help us figure it out.  It now sits collecting dust and I'm going to get an iPad mini to replace it.", "Title": "Ugh", "Date": "May 23, 2014"}, {"Author": "Valarie Cooper", "ReviewID": "RSURU4W3VNFPR", "Overall": "1.0", "Content": "I bought 4  tablets and one has already stopped working, screen just blacked out.  it wont come back on... the gift couldn't be used", "Title": "i hate it", "Date": "May 21, 2014"}, {"Author": "Luticia Winston", "ReviewID": "R3KF4XL1R9TRCK", "Overall": "5.0", "Content": "Bought as a gift for my son and he just loves his very own tablet for easy access and a larger screen for android games.", "Title": "Wow", "Date": "February 25, 2014"}, {"Author": "Mallorie", "ReviewID": "R1670BBWUGW5CB", "Overall": "2.0", "Content": "This tablet is made for a child. After only a day it lagged and froze on me. I decided not to go the cheap route. I'm returning it and just purchased the Nexus 7.", "Title": "Bad Decision!", "Date": "February 24, 2014"}, {"Author": "Heidi", "ReviewID": "R39J206IQ60ZCL", "Overall": "1.0", "Content": "product quit working after 3 daysand had to return.just didnt want to wait and try anothertablet my granddaughter wanted now and rightfully deserve that", "Title": "product did not work", "Date": "February 24, 2014"}, {"Author": "M. Davis \"master of myst games\"", "ReviewID": "R13P04LN15IRP1", "Overall": "3.0", "Content": "well I swiped my Idolian TURBO TAB C8, for this, Boy my god, this I've had for about a month and already has problems, lost my camera app, and picture app, and have a pop up of exchange services has stopped, not much fun with this Dragon touch tablet, I would like to go back but I sold my Turbo tablet,for $45 oh well, may have to buy another from Idolian, tablet had that for over a yr and was a lot better than this one, and this is an 8gb when my other was a 4gb, wanted something more, my fault, should of stayed with that one, sorry Dragon touch, you are not worthy of the name, want a good tablet try idolian, thank you", "Title": "Overated a bit!", "Date": "February 23, 2014"}, {"Author": "Katherine Schaefer", "ReviewID": "R34EFZA2RKS51H", "Overall": "1.0", "Content": "Run away fast! Biggest piece of crap ever. Lagging right out of box. After a full charge, unplugged for two minutes and power dropped to 98%. Rapidly discharged. Came witha note to installa task killer. Got a refurbished kindle for same price.", "Title": "should be zero stars", "Date": "February 20, 2014"}, {"Author": "Demar Stewart", "ReviewID": "R201Z4ZZTYQCO", "Overall": "2.0", "Content": "I buy this tablet November of 2013 and in January of 2014 it stop work.. it just not turning on I try everything still not turning on..", "Title": "I dont like it and will never recommend it to no one.", "Date": "February 14, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3QCWN9BHXISQ4", "Overall": "2.0", "Content": "regretting this purchase as a Christmas present for my 9 year old.  very slow, tried multiple ways to download games like minecraft all methods fail and will run in the background, never completing.  you have to force stop the downloads.  this now sits on the shelf and the old iPod Touch is back in play. wasted money :(", "Title": "Dragon Touch® A7 7'' Google Android 4.2 Jelly Bean Dual Core Tablet PC,...", "Date": "February 12, 2014"}, {"Author": "ed laster", "ReviewID": "R1JH9PNB706G8L", "Overall": "2.0", "Content": "Bought two of them and thanks to Amazons return policy was able to replace with better tablets. Sorry but I call it as it was. Improve the product Both of mine locked up and in my attempts to repair online was very confusing and did not do as was explained. Poor website for understanding and practice.", "Title": "Would not purchase", "Date": "February 8, 2014"}, {"Author": "Rebecca L Doremus \"The Dream Watcher\"", "ReviewID": "R37D6KMYXWT7PP", "Overall": "2.0", "Content": "I researched before buying this model. It was purchased to work specifically at my business with the register app. Although this device was not on the list of known devices with issues at the app makers website, it appears that even though the version of Android is higher than the minimum specifications - and even though the Google Store was on it - and that the app could be installed and would open .... the tablet would not see the device that is needed to scan the cards for the sales. Now I did not expect much from a tablet in this price range but I really do not understand how most of the latest reviews were pretty good.The capacitive touch on this device is non-responsive and lags no matter what you are doing. After a full overnight charge, opening the app (register) and setting up a test sale, 3% of the battery was already gone. This took seconds to do.All-in-All, I think this would be ok for a kid would would typically apply more pressure than an adult when using a touch device. As the device to run my business sales through, this is definitely not a good choice as the response time and card swipe device matter a great deal. I am returning this an will wait for a better replacement to become available.", "Title": "Not what I was expecting", "Date": "February 5, 2014"}, {"Author": "IA", "ReviewID": "R2XL0KSLD79Q5K", "Overall": "3.0", "Content": "I got this for my 2.5 year old daughter since she was always using my son's ipod touch.  She likes it when it isn't having a mind of its own.  Sometimes the screen dances and we have to shut it off and restart.  She get frustrated and keeps touching everything to make it work.  So would not buy again.  Right now it is not being used at all.  Battery life is really, reallyt short as well.", "Title": "OK", "Date": "February 4, 2014"}, {"Author": "AronBott", "ReviewID": "R1X38A6ZUI5EP2", "Overall": "4.0", "Content": "everythings works as avertized. very fast. great resolution. google search by talking was not even mentioned but worked great. lots of fun. great unit for the money.", "Title": "great unit for the money", "Date": "January 27, 2014"}, {"Author": "Vickie Warren", "ReviewID": "RY9TKPIVCDS72", "Overall": "1.0", "Content": "This tablet is very difficult to use.  I have trouble downloading to it.  I had to have a friend look at the settings and fix them because it was getting uncharged in 15 minutes!  I am sorry I bought this.  I would never buy it again.", "Title": "Hard to use", "Date": "January 26, 2014"}, {"Author": "Katie", "ReviewID": "R10QDWG9SNJR0G", "Overall": "1.0", "Content": "My grandson has had this less than a month as it was a Christmas present and it is already broken.  It will not hold the charge.  I've taken it to all the repair places and they can't fix it as they can't get parts for Dragontouch.  I would like a refund and will be glad to return it.  Please advise.", "Title": "Very poor product", "Date": "January 24, 2014"}, {"Author": "Jenna", "ReviewID": "RFRAREHIQWQV4", "Overall": "3.0", "Content": "This tablet is incredibly slow and has been since I received it. I bought this for my kids and they complain about how slow it is and how games do not load. They have stopped asking to play it. The battery life is not what was advertised. It dies after an hour or less of play. The memory is not what was advertised. It should have had 8 GB memory and I am lucky if there was 4 GB on it. Pretty upsetting! I guess it has served a purpose (to see if my kids were ready for the responsibility of owning such a device) and we will be upgrading to another tablet.", "Title": "Perfect for kids...", "Date": "January 24, 2014"}, {"Author": "Wilhelmina Johnson", "ReviewID": "R1XGY9EH7N46OB", "Overall": "4.0", "Content": "I am enjoying my tablet.  The only thing is it doesn't hold a charge long enough.Saying that means, I've been doing the dam thang !!", "Title": "lots of fun, just the right size to fit my purse.  Now I am never alone.", "Date": "January 23, 2014"}, {"Author": "Lorraine Hughes", "ReviewID": "R2KJMDDVGCE18A", "Overall": "3.0", "Content": "The Tablet runs slow after a while during stat up and also while in use; Now it has stopped charging!", "Title": "It's Ok", "Date": "January 23, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1MK3XU67MSIU9", "Overall": "3.0", "Content": "As others have reported the tablet has issues.Battery life is at best 2 hours. However the battery recharges fairly quickly.1 of the 4 Tablets I purchased for me and my family are being returned as it no longer loads the Android software. Which is why I am writing this review.While the tablet was working most applications worked well, 2 games ran very \"buggy\", PvZ2 and Fairway Golf Solitaire, both caused tablet reboots, lagging run times. Other 6 games were fine without issue.The Tablet will remain returned and will try a different slightly better quality tablet.Good for kids that want a tablet other than that spend another $50 and get something better.", "Title": "It's a $100 tablet", "Date": "January 22, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3OX4TXRSTRXMQ", "Overall": "4.0", "Content": "Gave the unit away as a Xmas present, but did have the chance to go over some of the features of the unit with him after delivering the gift.  He seemed fairly well pleased with it before I left his place that day.", "Title": "Reksut", "Date": "January 21, 2014"}, {"Author": "Jardun", "ReviewID": "R1E135WBI6FWI4", "Overall": "1.0", "Content": "This tablet worked great until the USB port broke off after only gentle use.  After inspecting, there was virtually nothing holding the usb port onto the motherboard. I'm surprised it lasted as long as it did.  It looked like the tines that should support the usb port were not actually attached to anything, and the only thing holding the port on were the actual data connections in the back.", "Title": "Not put together carefully", "Date": "January 21, 2014"}, {"Author": "Paul R. Poliquin JR", "ReviewID": "R1SWBXSYMRSH04", "Overall": "4.0", "Content": "seems fairly easy to operate for young ones but runs a little slow. A great buy for the little ones though", "Title": "not too bad", "Date": "January 19, 2014"}, {"Author": "bronxbull53 \"bronxbull1166\"", "ReviewID": "R1PQPDNGJ67NYT", "Overall": "5.0", "Content": "THERE IS NOTHING WRONG WITH THIS TABLET !!! WORKED A-OK RIGHT OUT THE BOX !!!  I HAVE HAD IT A WEEK NOW WITH NO PROBLEMS ... SOME THINGS TO DO TO KEEP THIS TABLET FUNCTIONING FOR A LONG TIME :: DON'T OVERLOAD THE O/S WITH APPS (HAS 8 GBS JUST USE 6 GBS) OR BUY A SD CARD AND EXPAND IT ... ISSUE ONE COMMAND AT A TIME !!! DON'T OVERHEAT YOUR LITTLE DUAL PROCESSORS BY MUTLI-TAPPING! BE PATIENT WITH THIS TABLET IT WILL WORK FINE ITS NOT THE SMARTEST BUT *NIETHER AM I lol ... I JUST KNOW BETTER ENJOY !!! SELLER RECOMMENDED ... CAME AS DESCRIBED & ON TIME SHIPPING WAS IMPECCABLE I PLAN ON BUYING 2 MORE FOR FAMILY ... ENJOY HAPPY HOLIDAZE ...", "Title": "NICE ITEM 100% HAPPY", "Date": "November 29, 2013"}, {"Author": "Arnold Alegre", "ReviewID": "R2T03FCX8DMPS8", "Overall": "1.0", "Content": "Bought this table for my mom in October 2013.  She only uses it to play basic games so it performed well enough.  But the USB charging port fell out/off earlier this week.  I contacted TabletExpress but they said they only offer a 90 day warranty for their tablets sold on Amazon.  Tablet is less than 5 months old and is now a table weight.  I will buy my mom a new tablet but I will steer clear of this brand.  I would recommend you stay clear as well.", "Title": "Ok performance for its price but its quality is bad", "Date": "March 20, 2014"}, {"Author": "anna", "ReviewID": "R2PO0EQPWG0GOX", "Overall": "1.0", "Content": "I bought this item for my daughter for Christmas, she was so excited when she opened it, we put in on the charger she was able to turn it one for a brief few minutes, long enough to take one picture then the device went black, even though there was 50% battery before  it did this, and will not turn back on. No way of resetting the device back to factory settings since there are no volume buttons on the side of the device and tech support hours are crap and not convenient at all, no weekends and close before i am even able to get home from work during the day, and no troubleshooting options other than reset to factory settings, but no instructions on to how to do this. I guess I will be sending back and requesting my money back and upgrading her to a better tablet.", "Title": "Doesn't work", "Date": "December 25, 2013"}, {"Author": "charlene", "ReviewID": "R1GS6ZL1HC2AAP", "Overall": "1.0", "Content": "This tablet is the worst my daughter just turn it on to take a pic have extend memory n is saying not enough storage n I can't seem to find no where to get assistance on how to fix the problem. Oh yea my sis daughter own is doing the same", "Title": "Tablet poor", "Date": "December 25, 2013"}, {"Author": "MississippiMike", "ReviewID": "R1B1VMI6MVHXJ0", "Overall": "4.0", "Content": "Has all the same features as the expensive tablets if you are looking for a WiFi only tablet. All android apps will work on this tablet. The only problem is that it did not have a task manager app and was hard to determine why the battery drains quickly. After loading a task manager app, it was discovered that a game app was running in the background. After turning off the game app, the battery holds a charge much longer.", "Title": "A great value for a tablet", "Date": "December 18, 2013"}, {"Author": "News", "ReviewID": "R16AS7DG050ISP", "Overall": "5.0", "Content": "I was looking for an entry level tablet for my gurl and this was the one I settled on.Over all the build quality is very nice, looks more expensive than it is.The camera is actually pretty good for a quick selfie, though its not going to win you a pulitzer prize.It is a little slow once you open a few apps but that is to be expected on a dual core machine with limited memory.As long as you understand this is a $50 tablet and not the Nexus 7 you will be very happy with it.", "Title": "Great for the price.", "Date": "December 15, 2013"}, {"Author": "Alexander S.", "ReviewID": "R1BJ5BEUCW5GYY", "Overall": "1.0", "Content": "I had to return this tablet. I knew this wasn't the fastest tablet but it was ridiculously slow. Also, the launcher was crashing all the time. And I'm talking about one day after I got it. When creating a simple shortcut for an app to put it in the home screen the launcher would crash and wouldn't create the shortcut. And then again, in every aspect, just in general the tablet was ridiculously slow.", "Title": "I had to return this tablet. I DON'T RECOMMEND IT", "Date": "December 5, 2013"}, {"Author": "Tracey Knorr", "ReviewID": "R1D9F955Q4HBO9", "Overall": "1.0", "Content": "DOES NOT WORK AND TABLETEXPRESS WILL NOT WORK WITH YOU. IF YOU WANT TO WASTE YOUR MONEY, THEN THIS IS THE PRODCUT FOR YOU!", "Title": "IF YOU WANT TO WASTE YOUR MONEY, THEN THIS IS THE PRODUT FOR YOU!", "Date": "December 9, 2013"}, {"Author": "Joe McCoy", "ReviewID": "RLW6V3OMI5YYV", "Overall": "4.0", "Content": "This is my first Tablet and I wanted to start small and inexpensive. I was not sure what to expect from a tablet, and I was pleasantly surprised. Worked well out of the box after changing the 10 hours (as recommended.) Had to learn how to navigate around on it (there allot of you tube videos on the web to help you.) I have not really had anything to complain about, does everything I need it to do! It is a bit small for my fingers, next tablet will be a 10\". Have had lots of fun so far installing apps. Battery life is okay, and I tend to have allot of apps running at the same time. Wifi is a bit lacking though, connects great at home but have not been able to connect anywhere that offers \"free wifi\", this may be \"user error\" though...  I think I will enjoy this tablet for a few months then turn it over to my son to enjoy. It is a good starter tablet and I do recommend it.Update 12/28/13The Wall charger USB port didn't feel tight when plugged into the tablet. Charging became erratic, I had to position the cord and a certain angle for it to charge. Now 12/28/13 the wall charger is not working (unless I want to hold it until it is fully charged. The problem seems to be the mini USB plug, not the tablet socket itself. When I plug other mini USB things into it they work great. I have contacted Tablet Express to see what they will do for me.I'll keep posting as this progresses. I hope for a quick happy resolution.", "Title": "Not a bad tablet to start with.", "Date": "December 8, 2013"}, {"Author": "JLanz", "ReviewID": "R1VAQ2SIQ2NZUC", "Overall": "1.0", "Content": "Bought this for my little son but it was so slow. He was getting frustrated just trying to get into the app that he wants. Dont waste your money on this. I swear you are going to regret it! Worst product ever!!!  I would have given it a negative star if I could, yes not a zero, but a negative infinity rating because it's that horrible! Ughhh", "Title": "Worst product ever!!!!", "Date": "May 13, 2014"}, {"Author": "Lois Scheiner", "ReviewID": "R26FYIXN3H5N6C", "Overall": "1.0", "Content": "Does not work too well.  Must be close to router.  Must always be charged to startup.  Would not buy again.", "Title": "Weak product", "Date": "May 13, 2014"}, {"Author": "\"Bondo\" \"Paul\"", "ReviewID": "R6QUQGOVPM3ON", "Overall": "2.0", "Content": "Don't waste your time and money. Never could get a decent wifi connection. Tried to reset to factory specs several times and it had no effect whatsoever. Tried to upgrade firmware-sent me to some Russian Language Upgrade Page. I did contact Customer Service. Ended up returning the item-it just wasn't worth the hassle.", "Title": "Didn't work for me", "Date": "March 10, 2014"}, {"Author": "Kim Paylor kim. paylor", "ReviewID": "RISPGU146C0XP", "Overall": "2.0", "Content": "I bought two of these tablets for my children for Christmas December 2013. By February 2014 neither of them would charge.  the ports both no good .  so now I am stuck with both of them, they wont work . I even bought nice cases with keyboards for the kids to go with them .  no worth it.  Google chrome on sale for 199  by the time I bought the key boards and both of these items I could have bought one of those.  just beware when purchase.However, I will say other than the port when my kids did use it  ( on the plane ride to California ) it worked well,  was a  decent speed and had Google play.  they used it about 3 more times  while in California over the holidays.", "Title": "Do not purchase", "Date": "March 3, 2014"}, {"Author": "Jessica Nardone", "ReviewID": "R1FIRDGE9EMVG", "Overall": "1.0", "Content": "The tablet it fine, but mine came with a sizable \"bubble\" in the touchscreen, and since I received it as a gift (so I was just shy of the 30 day return policy because I was out of town), they refuse to exchange it!  No one that I talked to was helpful, and they only offered me a PARTIAL REFUND.  I'd watch out if I were you, if you decide to purchase this item and it is delivered all bubbled like mine was - you best be sure to return it ASAP before you are rudely told that it is your fault that your fault that you received something as a gift while you were out of town and by the time you got back home and opened it up to find the bubbled screen that you cannot exchange it or even get the FULL refund.  Classy, Amazon.", "Title": "mine came with a bubble in the screen and Amazon refused to exchange it!!!!", "Date": "February 25, 2014"}, {"Author": "Tyra Ingram", "ReviewID": "R3EQUS4AOBNS2B", "Overall": "1.0", "Content": "Bought this for my 5 year old for Christmas.  Immediately started to see a huge delay in response and VERY limited abilities to download.  Kept getting \"package manifest\" and other errors when downloading apps from Google.  Now the final straw is the port for the charger is damagedso as soon as the battery dies the tablet will be no good.  Lesson learned.", "Title": "You get what you pay for", "Date": "February 6, 2014"}, {"Author": "Marlon turcios", "ReviewID": "R3HGZC5FH7JGDH", "Overall": "5.0", "Content": "For a better reviewCheck out this video on YouTube:http://youtu.be/kkJFPV2X6BsFor a better reviewCheck out this video on YouTube:http://youtu.be/kkJFPV2X6Bs", "Title": "Good product", "Date": "January 5, 2014"}, {"Author": "claudettesad \"claudettesad\"", "ReviewID": "R3OJT32ZTXLYFB", "Overall": "1.0", "Content": "I tried to reason with the CS reps but they talk over you and demand that you listen to them.  In my attempts to get a satisfactory resolution,Two of their reps hung up on me during the calls.  By now they know my tel number so they do not answer when I call.", "Title": "Refuse to start up after three weeks of purchase......customer service is the worst I've ever experienced", "Date": "January 5, 2014"}, {"Author": "S. R. Hill", "ReviewID": "R2W3OJ7R2FSSYI", "Overall": "1.0", "Content": "I recieved what was suppose to be an enjoyable product, but I cannot open any web pages. Why is this? The wifi is connected and very strong. Please help. I will change rating upon connection.", "Title": "discusted right now", "Date": "January 4, 2014"}, {"Author": "Larry G Rowe", "ReviewID": "RM2KTPI81N9EN", "Overall": "2.0", "Content": "Lousy android brand, won't accept many typical apps like iheart I get on much older models. CRAP! Sorry to say.", "Title": "Crap android model", "Date": "December 24, 2013"}, {"Author": "consg005", "ReviewID": "R10VOUDRMCWQTT", "Overall": "3.0", "Content": "Does it have Adobe Flash Player installed? If anybody knows give us an answer I would like to purchase this Item", "Title": "FLASH", "Date": "December 20, 2013"}, {"Author": "michael", "ReviewID": "R3MQAEC957QRNQ", "Overall": "2.0", "Content": "the tablet was slow and froze within a minute of turning it on every time i turned it on.  i guess you get what you pay for.  smashed this one on the ground and bought a galaxy note 10.1 2014 edition, and im much happier with that purchase", "Title": "garbage", "Date": "December 19, 2013"}, {"Author": "Ric Vane", "ReviewID": "R1VIZ4FNHO2KKM", "Overall": "2.0", "Content": "I ordered two of these.  Shipping was fast as usual.  The tablet seems to be OK.  I haven't had enough experience with it to really make a good judgement yet.  What I can tell you is that contrary to the listing of the item... it does not have a 8GB HDD.  (internal memory)  When viewing the system information the Internal Storage states: 'Total Space: 4.83GB, available 4.60GB'  The other internal storage listed is the RAM: 'Total Space: 527MB, available 412MB'  No other internal storage space is listed.I have emailed back and forth with the seller regarding this issue.  They couldn't really explain the discrepancy.  The end result is they say that if I'm unhappy with the purchase I can return the tablets.  I feel a bit cheated, but I'll continue to try the tablets -  maybe they will still work for my purpose.", "Title": "There isn't 8GB of internal memory.", "Date": "December 5, 2013"}, {"Author": "charleen samuels", "ReviewID": "R36M659EUZV7TF", "Overall": "2.0", "Content": "I was expecting a tablet with 8GB as was advertised but received one with 4GB. I feel cheating with the product I purchase for my 3 years old daughter as this is her Christmas gift. Not able to return as I don not have a back up Christmas gift and she is really looking forward to get her tablet as was promised. I believe I desire a 45% full compensation on this item. I had already email my disappointment but still awaiting reply. I am getting the feeling that my request is been ignored. Please update.", "Title": "Did not get what was advertised", "Date": "December 20, 2013"}, {"Author": "sherry carver", "ReviewID": "R3CU74KIO7W3XL", "Overall": "1.0", "Content": "i did not receive on time because amazon makes me re add my credit card number no matter what i buy.i did not right charger,they sent a broke usb charger. i've to use extra usb cord until i can buy correct kind of charger.it does not stay charger more a hour. now it won't come on with out being plug in", "Title": "bad", "Date": "May 10, 2014"}, {"Author": "Simao Macaia Bumba", "ReviewID": "R6F0PODCOP4MJ", "Overall": "3.0", "Content": "Dear Sir/Madam,Please add the invoice to the order containing above items, i won' t be able to get it without invoiceto allow me declare it at customs as it goes to Africa after thenWaiting to hear from youSimao Macaia Bumba", "Title": "Requesting Invoice require to this to order to allow me declare it at customs as it goes to Africa after then", "Date": "December 17, 2013"}, {"Author": "David", "ReviewID": "R1R60NMVOGUDIV", "Overall": "2.0", "Content": "I have to give this a low score because its made very badly... The screen will \"spaz out\" which then I have to flick it in the back... It's also very slow, and not at all HD. The battery life is total trash.Pros I have with it though, is that the Android Operating system works well, cheap, and if I break it I won't care as much.", "Title": "It's ok... But limping...", "Date": "November 3, 2013"}, {"Author": "vincia dunrod", "ReviewID": "R3FQPDFSIFD4KL", "Overall": "5.0", "Content": "IT'S not what i expected  DRAGON TOUCHi cannot download the stuff i want and i cannot get books to read. upset", "Title": "not what i expected", "Date": "November 7, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00FFJDYHM", "Features": null, "ImgURL": null, "Name": null}}