{"Reviews": [{"Title": "GREEEEEAAAAAAT", "Author": "lucy", "ReviewID": "R2ZLTUHFOCN2P5", "Overall": "5.0", "Content": "it is great tablet, works good with what i needed it for. The shipping of the item itself would need to be changed the box should be labled fragile. Was nervous when i open the shipping box and the tablet box was open and a few of the items were inside the shipping box. Not Good. but otherwise the tablet is great and working great.. So far so good since i have only had it for four days.", "Date": "November 7, 2013"}, {"Title": "not perfect but pretty close !", "Author": "Aaron M. Smith \"Aarowsmith\"", "ReviewID": "R1MB4GYF915UVV", "Overall": "4.0", "Content": "I was sent this tablet by mistake, well it turned out to be a good thing. The screen is pretty crisp and bright. The WiFi reception is excellent as good as it gets, of the best tablets. The touch response on the screen is pretty accurate. Sometimes I will need to touch twice, not sure but sometimes web pages lag and touch response suffers. Overall I do like this tablet's very long battery life, and build quality and it looks really great. You just may have to be careful with twisting this case hence screen distortions can occur and it also may break the LCD ?Games and most apps work very well and seem to play smoothly for only a dual core. If you can find this tablet for about $109 then it is a real steal and worth every penny ! A much better tablet this one is !! Than anything else in this price range.", "Date": "June 9, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Operating System : Android 4.2 Jelly Beans\nCPU : Allwinner A20 Boxchip Cortex-A9 Dual Core 1.5Ghz\nHard Drive Capacity 8GB ,Extended Memory Support external TF card extend up to 32GB\nSupports HDMI , DUAL CAMERA\nCOLOR : WHITE", "Name": "Flytouch XR Android 4.2 Capacitive Touch Screen 10-Point Touch, Dual Core Cortex A9 Processor 1.5Ghz, HDMI", "ImgURL": "http://ecx.images-amazon.com/images/I/412YTlP%2BxdL._SY300_.jpg", "ProductID": "B00FY2TZOG"}}