{"Reviews": [{"Author": "Joni Landmesser", "ReviewID": "R3DO4VQDEXVW70", "Overall": "5.0", "Content": "I bought these for my 11 grandkids for Christmas.  They were thrilled.  Within an hour we had all the kids up and running.", "Title": "Great value", "Date": "January 21, 2014"}, {"Author": "K Clagett", "ReviewID": "R1S1OX19MS5V4K", "Overall": "1.0", "Content": "Purchased this for a Christmas present after the decent reviews. I have had it 3 weeks and has been freezing up. Now it is black screen and will not reboot like so many other posts from the end of December forward. I will be returning mine tomorrow when UPS opens.", "Title": "Do not buy", "Date": "January 17, 2014"}, {"Author": "LeoSr", "ReviewID": "RX5BWBA4SF46N", "Overall": "4.0", "Content": "I wanted to enable the HDMI port to project/play downloaded videos to my bigger TV screen.  Following the user manual, I bought a micro-hdmi to hdmi cable but the connection did not work.  My son suggested that I order a \"mini-hdmi to hdmi\" cable which I did, and it worked.  I wonder why the need for this kind of cable (mini-hdmi to regular hdmi) is not mentioned in the user manual.  It would satisfy the customer more if this cable is delivered along with the tablet.  With a wide screen and audible volume, I have proven that the tablet is good for streaming movies from Netflix, Amazon Instant Video & Hulu Plus, checking e-mails from my Yahoo & G-Mail.accounts, and playing music collections with the use of micro-sd memory cards.  These are the only functions that I have tried.  I am slowly trying the other aspects, like adding and removing apps, storing and removing data, etc., more comments to follow.  Meantime, I recommend this great tablet to other customers.", "Title": "Enable HDMI with correct cable.", "Date": "March 15, 2014"}, {"Author": "Jessie Clem", "ReviewID": "R3E2W5A8OG73O4", "Overall": "3.0", "Content": "Absolutely love everything about this tablet except one thing.  It is better than expected for the price.  However, after only one month, it is now starting to lock up.  First time, it did so when I was reading a pdf file.  I've only downloaded a few apps.  I also locks up at the login screen.  Might have to do with it updating every time I start up and it asks if I want to close the program or wait for it to respond.  The other day, I started the unit up and walked away for a few moments.  When I came back it was dead.  Couldn't bring it back to life until I depressed the reset button just above the mic.I've worked professionally on Kindle tablets (all models) and now on one model of the Verizon tablet.  And I see the same issues that I'm having  So, I'm still ruling out a mere software issue.  I know code can still be sloppy on all these free apps out there.  So that's where I'm troubleshooting for now.  But, it does leave the thought in my mind that it might just be cheap hardware.  (You get what you pay for, is the saying).As soon as I figure it out.......more to follow.CheersUpdate to Review:  Now 5/28/2014.  Love this tablet.  Turns out that the issues that I was having were entirely software related and due to how many apps were updating on boot.  After resetting to defaults and carefully choosing apps I wanted, now no problems.  Soooo, it was something I did to hose the operating system in the first place.  We also bought another Noria for our daughter.  Both now going strong.  Glad we made the purchases.", "Title": "Love it, am concerned because after only about a month.......", "Date": "March 5, 2014"}, {"Author": "faucet", "ReviewID": "R2T5HGH75YTT5Z", "Overall": "1.0", "Content": "Actually  when I took this out of the box to set it up for my grandson at Christmas I thought it might be a pretty good little tablet for the price.  But I was wrong within 3 weeks the on off button fell off which was part of the mfg warranty - they would only cover if I sent it back to them in China at a tune of $25.00 postage.  In this day and age with all shipping labels being offered on line they couldn't send me a pre-paid  label.....Never again.", "Title": "A piece of Junk!", "Date": "March 1, 2014"}, {"Author": "Edwin R.", "ReviewID": "R2SPBDNCTWEFY4", "Overall": "1.0", "Content": "I bought this tablet from Seller1on1, an it didn't work I returned  keep in mind this it was for Xmas. They sent me another one which I received the following Saturday after Xmas I returned it an per Seller1on1 they to me to write on the box \"return to sender\"  which I did an now they act like they don't know I'm talking about an won't give my money back. They are a bunch of crooks.....", "Title": "got ripped off by Seller1on1", "Date": "February 20, 2014"}, {"Author": "ANDREA TABIN", "ReviewID": "R3KC7G09F5TZ43", "Overall": "1.0", "Content": "Ordered 3 of these tablets for my kids.  Once we took them out of the box we could not get them to connect to WiFi.  It was so disappointing and frustrating.  1 of the tablets did connect for about 5 minutes, but that was about it.  Sent them back the next day.", "Title": "Thumbs Down!!", "Date": "February 18, 2014"}, {"Author": "Chris Townsend", "ReviewID": "RQLL1I4T21OHQ", "Overall": "1.0", "Content": "Worked flawless for 20 min then shut offhad to hard reset holding both power and vol buttonand now its locking up again the next dayreturning", "Title": "was ok while it worked 20 min", "Date": "December 26, 2013"}, {"Author": "Clemente Vazquez", "ReviewID": "R3PJS5OQS84NLQ", "Overall": "5.0", "Content": "Great gift for the price. Perfect gift for my grandkids. Simple to use they are going to be very happy", "Title": "great value", "Date": "November 27, 2013"}, {"Author": "Nicki", "ReviewID": "R25AB2AEUVQ604", "Overall": "3.0", "Content": "The tablet is good quality. The only problem I have is under the glass is a long piece of hair going across the screen.. for kids this tablet is great , very basic and easy to use.***update****Only day two and with no dropping the screen is on static and won't change.. my daughter is very upset and so am I.*** After trying to get it to die so i can charge it, thinking it might help, i decided to plug it into my laptop (windows 8) and the screen popped up and stated it was debugging.Its working fine now.", "Title": "good for a two year old.", "Date": "June 3, 2013"}, {"Author": "Jennifer Lukic", "ReviewID": "R27YOUHK8HJAUJ", "Overall": "5.0", "Content": "I bought this for my 11 year old.  It's light and easy for him to use for school and home", "Title": "Perfect", "Date": "May 18, 2014"}, {"Author": "Sonia Friberg", "ReviewID": "R2JUG7GQZ6H49", "Overall": "2.0", "Content": "The unit would not fully turn on, nor would it turn off.  I returned it as defective.  Amazon.com was very cooperative on the return.", "Title": "Not what I expected", "Date": "May 15, 2014"}, {"Author": "Charles E.", "ReviewID": "R17UH5EYLKVQR2", "Overall": "1.0", "Content": "The tablet is not goodIf you are playing a game (for instance a car game) the car will skip across the screenAnd the tablet fell in half and then snapped back together", "Title": "not the best", "Date": "May 15, 2014"}, {"Author": "Nana", "ReviewID": "RIF4T58BBRZOR", "Overall": "5.0", "Content": "This is a great tablet for my grandson who is almost 11 years old. It has plenty of space for the games he wanted downloaded.", "Title": "Noria T2 7\" Android Tablet", "Date": "May 14, 2014"}, {"Author": "CB", "ReviewID": "R3JFSMNT2VGG18", "Overall": "1.0", "Content": "I opened the box charged the product and checked it could connect to wifi. Barely used it at all and it will not turn on, battery level was fine yesterday, charging does not help, product is completely non functional.", "Title": "Would not turn on after one week", "Date": "May 14, 2014"}, {"Author": "William Hogue", "ReviewID": "R209BXO5XDFD0Z", "Overall": "5.0", "Content": "First off, the tablet has a excellent picture, better than I expected, the games take no time to load nor download. It charges fast and I'm very pleased with the tablet. It has excelled my expectations.", "Title": "A great tablet!", "Date": "May 13, 2014"}, {"Author": "Javier cichello", "ReviewID": "R1VU8CJX8JDHB6", "Overall": "3.0", "Content": "I have bought this tablet for my kids and i really believe is very good according the price and quality.", "Title": "Good for the price", "Date": "May 13, 2014"}, {"Author": "velly", "ReviewID": "R3OPB56HWRJ107", "Overall": "2.0", "Content": "It started great out the box, but after a couple of days use, it began to crash, I know that it's a manufacture error because you don't buy a product, and it's ok, that's just careless thinking. So knowing computers the way I do, became full, I should've went with the samsung tablet.", "Title": "Wasn't to happy with this to be honest, just to many issues", "Date": "May 12, 2014"}, {"Author": "April", "ReviewID": "R2G70UBBAMK808", "Overall": "3.0", "Content": "The speakers are very quiet, and the camera is absolutely awful. But for the price, you get what you pay for. It's cheap and it does simple things. I wanted a tablet for apps basically, games and social apps. If you want it to listen to music on or to take photos, definite no. But other than that, for just a cheap tablet to play with it's alright.", "Title": "Cheap", "Date": "May 9, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1ZB1YEE83OPAV", "Overall": "1.0", "Content": "It quit working within 4-6 weeks. I'm retired & used it mainly for emailing and reading. It just shut down and wouldn't come back on. I was very happy that I received a full refund and zi ordered a different brand immediately. I'm very happy with my new Dragon Touch.", "Title": "Disappointed", "Date": "May 7, 2014"}, {"Author": "BS", "ReviewID": "R3L4JYJI3NPQ5N", "Overall": "1.0", "Content": "I am returning this thing as I type. When I got the product the DC input on the tablet was wobbly and you had to put pressure on it to get the thing to charge not to mention it didn't charge fast enough for stable use. It would run out of battery and die while it was plugged in. This has been the only thing I have ever returned on Amazon, but that's what you get for $55.", "Title": "Charging", "Date": "April 14, 2014"}, {"Author": "ratman", "ReviewID": "R1PGM04HL8Z7U6", "Overall": "4.0", "Content": "It's a little slow but you get what you pay for. It also hangs up a lot. Ok besides that.", "Title": "tablet", "Date": "April 11, 2014"}, {"Author": "Kairaanne", "ReviewID": "R2IHIRBNO04Z09", "Overall": "3.0", "Content": "Have decided to give it to my kids, it is not for everyday use. Very slow with the Wi-Fi this one is better than the white one the battery life lasts longer than posted.", "Title": "Okay for the price", "Date": "April 11, 2014"}, {"Author": "Anna M. Rhoades", "ReviewID": "R3SB48SL9RECLV", "Overall": "1.0", "Content": "My granson (16) put a voice password on it and then forgot the password. access is not possible, which makes this unit useless. have contacted company for instructions to unlock it , with no response.", "Title": "locked out", "Date": "April 11, 2014"}, {"Author": "donte fleming", "ReviewID": "R1W6YA1ZMTP4QJ", "Overall": "1.0", "Content": "This android tablet was a complete rip off,as soon as I got it the thing kept turning off repeatedly so I suspect that it has a virus in it,and it was supposed to be brand new,waist of money!", "Title": "virus virus virus", "Date": "April 9, 2014"}, {"Author": "cher russ", "ReviewID": "R85BO54O06OYX", "Overall": "4.0", "Content": "This was a gift for our son (28yr old-MMR) He is loving it. So many things he can do with it.", "Title": "Loving our NORIA", "Date": "April 9, 2014"}, {"Author": "Roy Lamberton", "ReviewID": "R3QXCXTYJV7TUD", "Overall": "5.0", "Content": "Got this for my wife to replace an old PC that is slowly dieing.She uses it to run her e-mail and social media stuff, and really likes it. It doesn't totally replace the PC or a laptop, but it is great for staying in touch and keeping yourself organized.", "Title": "Good low price alternative to a PC", "Date": "April 8, 2014"}, {"Author": "Mildred Miller", "ReviewID": "RJL1LCD0DZVAS", "Overall": "5.0", "Content": "The tablet will do everything I wanted it to do.Quality is very good once I got it on my wifi it was easy to set up.I bought it so I could get on google play.", "Title": "happy with my tablet.", "Date": "April 8, 2014"}, {"Author": "kacey ownby", "ReviewID": "R3R4DE8PIQDJKG", "Overall": "3.0", "Content": "If you just need a basic tablet for apps and web surfing its ok. I bought two for my kids and ended up returning them. They were not exactly kid friendly, as they require a great deal of setup and configuring.", "Title": "Ok for the price", "Date": "April 7, 2014"}, {"Author": "teresa young", "ReviewID": "R1QM2IIWVOJWFP", "Overall": "5.0", "Content": "Great graphics, met all my expectations. Would refer my friends to purchase one too, lots of fun and great price.", "Title": "Great Choice", "Date": "April 4, 2014"}, {"Author": "lisa", "ReviewID": "R3HIOHA1HOJGM1", "Overall": "1.0", "Content": "I got i for Christmas, it worked fine until it froze on me for 10 minutes and the charger is so cheap the tip will break eventually", "Title": "awful don't buy it", "Date": "April 3, 2014"}, {"Author": "Janice Smith", "ReviewID": "RGD7LFCC9I6D9", "Overall": "2.0", "Content": "Didn't like this tablet at all. Don't have know internet you wouth need wi-fi to get on internet.will know work if didn't have wi-fi", "Title": "know happy", "Date": "April 3, 2014"}, {"Author": "Sharnice Fenner", "ReviewID": "R2SNP6Z2I02TTT", "Overall": "3.0", "Content": "ordered 1 pink & 1 black both download very slow & freeze @ times. My husband & I will try different wifi locations if there's no change we'll return them & maybe order some other 1's.", "Title": "tablets", "Date": "April 3, 2014"}, {"Author": "Stacey L. Edie \"sstacinator\"", "ReviewID": "R1DIXYOHWLIIL9", "Overall": "2.0", "Content": "I guess I am use to Samsung quality because this tablet is slow and feels cheap. I am sticking with my cracked old Samsung 10.1 tablet I got years ago. Gave  this slow one  to my son.", "Title": "Too slow and feels cheap", "Date": "April 3, 2014"}, {"Author": "venkata rao", "ReviewID": "RMSPB7RDZ4HZF", "Overall": "1.0", "Content": "weaste it purchase it's very slow not working well i suggest you to don't purchase this item please i hate this one", "Title": "weaste it purchase it's very slow not working well i suggest you to don't purchase this item", "Date": "April 2, 2014"}, {"Author": "Debbie Westbay", "ReviewID": "R1170EUL0MX3AZ", "Overall": "3.0", "Content": "I don't have the patience to wait for things to load. Its ok for kids. After all I did buy 2.", "Title": "slow", "Date": "April 2, 2014"}, {"Author": "sk8queen", "ReviewID": "R1OPXWG0THS0GY", "Overall": "1.0", "Content": "Returned it. Wifi wouldn't stay connected unless I was in the room with the router... (I hate how Amazon forces you to add more words. I said what I wanted to say!)", "Title": "Thumbs down.", "Date": "April 2, 2014"}, {"Author": "Kathy G Stone", "ReviewID": "R1UZ2X8OAVUVQ0", "Overall": "1.0", "Content": "I know this was sent in january but, I wanted to give it a chance B-4 writing a review...with that being said, this tablet is not worth buying. The only thing you can use this for are games and even then its freezes up all the time. It will not let u download anything!!! Worse tablet ever!", "Title": "7\" chromo tablet", "Date": "April 2, 2014"}, {"Author": "Mukendi Jules", "ReviewID": "R16LSLSRX5FOU6", "Overall": "5.0", "Content": "Estimation rate and requestMy kids and I like your product! it is working well with high performance.I have a request. Three days after these tablets arrival, one felt down and broken. So we paid for warranty, I plan to send it back to you for changing.ThanksYour customer, Mukendi Jules", "Title": "Appreciation", "Date": "April 2, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2LMH0S422D8S8", "Overall": "1.0", "Content": "It want charge. I am so upset it was fine .Then it just wouldn't charge . So it you want a table that want charge after a month get this one. O yeah I didn't want to give it any stars but I had to .", "Title": "This table would be great.If i never got it.....", "Date": "April 2, 2014"}, {"Author": "BARBARA LAMMI", "ReviewID": "R1NK6IMS0I0U7M", "Overall": "2.0", "Content": "compared to others we have it is very hard to use and understand.the sound is very low I have trouble putting apps in cannot get my kindle books set up to read.google has a strong hold on the use of it.we are seniors and would not pass on a positive word on it Barbara.  ps  the manual is not easy to follow or instructive.to small to read no way to turn up the sound not bad with earphone.", "Title": "comments on the noria tablet by a senior", "Date": "March 19, 2014"}, {"Author": "gamer", "ReviewID": "RLWABLNP8J8IA", "Overall": "1.0", "Content": "I bought this tablet in December and by February it just stopped working; the screen went blank and that was it. I need to know how do I return this product. My kindle is going one year and still working so it must be this tablet.", "Title": "Poor", "Date": "March 18, 2014"}, {"Author": "Duvan Moreno", "ReviewID": "R1XE2ZP4AIZT98", "Overall": "4.0", "Content": "Easy to use, really good product for the price i'm really satisfied with this tablet, nice color and presentation runs fast", "Title": "Really good tablet", "Date": "March 15, 2014"}, {"Author": "Oushadevi Surage", "ReviewID": "RVKHQ7GSRSAYD", "Overall": "5.0", "Content": "I love this. It's very portable and handy. So far I haven't experienced any problems with it except that I should order 10\" ones. Very good.", "Title": "Love it", "Date": "March 14, 2014"}, {"Author": "Jason X", "ReviewID": "R2F69C83HZ2JQG", "Overall": "5.0", "Content": "Great 7 inch runs smooth no lag and arrived on time so far no problems which is all good would definitely recommend for cheap and small tablet", "Title": "Great for 7inch", "Date": "March 13, 2014"}, {"Author": "neicka", "ReviewID": "R2V0448YZQEZA2", "Overall": "2.0", "Content": "it came right on time. that was good. but the bad part is that1. it has an low quality camera2. freezes the 1st week3. really slowdon't buy this this a total rip off", "Title": "cheap and useless tablet", "Date": "March 11, 2014"}, {"Author": "Iraida Lopez-King", "ReviewID": "R3119XQE8GSTZ4", "Overall": "5.0", "Content": "Very easy to manage. I thought it was not that much but now that I tried it myself is a good product", "Title": "I recommend as an entry level or for elders", "Date": "March 11, 2014"}, {"Author": "sharon rowell", "ReviewID": "R6KAA2SFELBME", "Overall": "1.0", "Content": "Tablet stopped working. Returning it. Warranty company giving me a hard time.They cancelled warranty.  Or never had one. Not fair.", "Title": "tablet no good!!!", "Date": "March 11, 2014"}, {"Author": "Diane Rohde", "ReviewID": "R2TDV1LK8AYO8P", "Overall": "5.0", "Content": "We are very pleased with our tablet. The size fits into my purse and so easy to use in any room.", "Title": "Noria Tablet", "Date": "March 11, 2014"}, {"Author": "Frank Rohm", "ReviewID": "R3RDWCZ3F1S7J2", "Overall": "2.0", "Content": "We didn't have high expectations given that we'd never heard of the brand before, but the price was very low so we decided to give it a try. Luckily we bought a Square Trade warranty because there is no mention of a manufacturer's warranty in the paperwork that ships with the product, nor on the manufacturer's web site and it stopped working within 60 days of it being opened and used for the first time.We purchased the item as a Christmas gift. My son used if very gently (and sparingly) between Christmas day and it stopped working before the end of February.My son rates it as a 3 or 4 and enjoyed it while it was working. He was very disappointed when it stopped. So, we're out the shipping and tax and the price of the warranty, but that's it. Happy with the Square Trade, not so happy with Chromo.", "Title": "Screen stopped working after <60 days", "Date": "March 10, 2014"}, {"Author": "Julian Perez", "ReviewID": "R3OZRG8VEFI7G7", "Overall": "5.0", "Content": "This was a present for my nephews and they love it.they use it mostly for watching movies, listening music and playing on line.", "Title": "A great tablet for this price", "Date": "February 13, 2014"}, {"Author": "armies", "ReviewID": "R28II1EL8MUP85", "Overall": "1.0", "Content": "I did not received the tablet, I tried to reply to amazon that I did not received the merchandise although I got a text message stating that it left outside of the door. It is the first time that I order merchandise and do not get it", "Title": "not satisfied", "Date": "February 12, 2014"}, {"Author": "Natasha L. Decker \"Tasha\"", "ReviewID": "R1FFFO4GI8E8VQ", "Overall": "2.0", "Content": "It worked great for about a month. It started with the volume button not working and the volume would go up and down on its own.  Then one day I went to turn it on and the screen was blue, green and red. Never worked again. :(", "Title": "Good tablet for about 30 days...then it went kaput!", "Date": "February 12, 2014"}, {"Author": "lamylouy", "ReviewID": "R31R6SXJU7G6RR", "Overall": "4.0", "Content": "No problem other then wanting it. Easy to set up and use. Love the duel camera it will take me a while to learn what all it dose", "Title": "no problem", "Date": "February 12, 2014"}, {"Author": "Betty Tynan \"retired at last\"", "ReviewID": "RN974ADC6TGB", "Overall": "3.0", "Content": "The hole in the case was a little off center causing a problem attaching charger to unit. Being returned tomorrow.", "Title": "Where charger goes in is messed up.", "Date": "February 11, 2014"}, {"Author": "Helen Pelzer-Lane", "ReviewID": "R31AXSEPVBMB1K", "Overall": "5.0", "Content": "Purchased as a Christmas gift for my nine-year-old grandson, and he LOVES it!  We can hardly keep him off of it.  He'd rather \"play\" on the tablet than on the new laptop computer.  Takes great photos, too.  Highly recommend this item.", "Title": "Terrific Christmas Gift for Grandson!", "Date": "February 11, 2014"}, {"Author": "Romanita Womack", "ReviewID": "R620OJZR79L1X", "Overall": "1.0", "Content": "I bought it for my 15yr old son. He actually chose it for his self . The size was what we wanted and the price even better. The first thing that wrong with it was the head phone jack stopped working , then it stop responding to our wi-fi signal.we had to reset it several times. I guess you get what you pay for.", "Title": "not what I expected", "Date": "February 11, 2014"}, {"Author": "Kristie and Dominic Viramethi", "ReviewID": "R6GY4MMZTGW8P", "Overall": "1.0", "Content": "Just opened it, really slow and freezing up all the time. Cant do anything on it. HORRIBLE HORRIBLE HORRIBLE HORRIBLE", "Title": "Horrible", "Date": "February 10, 2014"}, {"Author": "granville", "ReviewID": "RTXAQ47WNORT5", "Overall": "4.0", "Content": "OK i like noria tablet run 4.2 jellybean  it is very fast  and i have no dislike a bout it any one who like it can buy it", "Title": "noria expanse 10 android 4.2 jellybean", "Date": "February 10, 2014"}, {"Author": "Felicia Abrahams", "ReviewID": "R2MWAIA3COYRRW", "Overall": "1.0", "Content": "First day I got this tablet it was freezing up. So slow takes like 1 minute to load anything. Device would be on but then you couldn't turn on the screen. Eventually it just wouldn't power on completely and only had product for less then 3 weeks at that point. Purchased warranty on it. Called them they said they will issue me a check for purchase price once I ship item back to them. So the waiting games begins.", "Title": "Unsatisfied", "Date": "February 10, 2014"}, {"Author": "Manuel", "ReviewID": "R1XWUNHWX759UB", "Overall": "4.0", "Content": "I bought 11 tablet to resell since September 2013 and have had no problems with any client, all have left me very good and satisfied customers thanks", "Title": "great", "Date": "January 30, 2014"}, {"Author": "Glenn", "ReviewID": "R238H89NQ3HXX8", "Overall": "1.0", "Content": "The tablet worked fine for about 10 days. Then one day I went to use it.  It was completely dead. It wouldn't take a charge or anything. Just stopped working.", "Title": "Bad experienc", "Date": "January 30, 2014"}, {"Author": "Fran", "ReviewID": "R2EHH0NRLOM47N", "Overall": "1.0", "Content": "I charged the tablet on Christmas Eve, as this was a Christmas gift for our son.  Work one day & then the battery died, & never got the tablet to work again...  It would not re-charge :(", "Title": "Disappointed", "Date": "January 29, 2014"}, {"Author": "jbolling", "ReviewID": "R2MAFZ0QZMAIZ8", "Overall": "2.0", "Content": "I needed the information to get a charger for it.  No one could help me unless I had all the purchase information.  I don't keep it because I buy so many small things through Amazon.  I expected to be able to replace the item since it was only a month old and my daughter uses it to read e-books.", "Title": "7\" android tablet for an adult child", "Date": "January 29, 2014"}, {"Author": "Christina Blakely", "ReviewID": "RNWFSMYEYK3TH", "Overall": "5.0", "Content": "Fantastic tablet! My 10 year old absolutely loves it. It is easy to use right out of the box! The price is unbeatable too.", "Title": "Chromo 7 inch tablet", "Date": "January 29, 2014"}, {"Author": "Usnvet67", "ReviewID": "R1M6GGQQU3H4OW", "Overall": "2.0", "Content": "The Chromo Inc® 7\" Android 4.1 Capacitive 5 Point Multi-Touch Screen - Black. I purchased did not measure up to the hype seen in the advertisements. The battery does not stay charged but for a couple of hours. It is very difficult of navigate and find what I am seeking. I have given it to my grand daughter to play games on and will seek a more useful tablet that I can use for educational purposes as that is what I bought this tablet for. I am very disappointed with this product.", "Title": "Not what I expected it to be or do", "Date": "January 29, 2014"}, {"Author": "Gunney F.", "ReviewID": "R2LPF91HGJP8LS", "Overall": "5.0", "Content": "Does everything I need to do.  Light and easy to carry around.  Like the 10 inch screen the best. Thanks", "Title": "Great Tablet", "Date": "January 29, 2014"}, {"Author": "E. Husseini \"not 2 serious\"", "ReviewID": "R2NYW6N8PRI7N8", "Overall": "5.0", "Content": "I bought two of these for my grandkids for Christmas--they were a big hit, and work very well with a reward system their parents quickly set up.  They were inexpensive, but play simple kid games quite well (the kids are 5 and 6).", "Title": "great kid tablets", "Date": "January 28, 2014"}, {"Author": "Shreeram Sridharan", "ReviewID": "REZO6IW1VC3UH", "Overall": "1.0", "Content": "It restarted 2 time immediately after switching on. The brightness was very low and I was not able to increase it.Hangs quite often when using some apps after that I have to leave it to drain the battery to reset.Returned it immediately", "Title": "Not Good", "Date": "January 28, 2014"}, {"Author": "Harlean McCarthy", "ReviewID": "R2RJOEHQIDA34W", "Overall": "5.0", "Content": "My husband is in 7th heaven with this tablet.  I have had a Swiffer before.  liked it so bought another one.", "Title": "Both Great", "Date": "January 28, 2014"}, {"Author": "Robert Paris", "ReviewID": "R3MEOYK9MGLEW8", "Overall": "4.0", "Content": "I bought two of these for my kids for Christmas. They work fine and the only issue we've had was breaking the charging power supply. I may be heavy handed but that thing seems kind of fragile. Luckily we had two. The charger for my phone works in the micro usb port but seems to take forever to charge. Overall we're happy with them.", "Title": "Meets expectations", "Date": "January 28, 2014"}, {"Author": "DebRobbins", "ReviewID": "R1RN9WBAAFWPDO", "Overall": "2.0", "Content": "We ordered 2 for Christmas gifts.  One stopped working right away.  The other 3 are doing fine.  I wanted one too but I am not sure how easy it will be to take care of the problem with the broken one.  We bought warranties and still need to send those in. They were suppose to have been sent on line.", "Title": "Black Tablet PC", "Date": "January 28, 2014"}, {"Author": "Anthony Sanguinetti", "ReviewID": "R3CQSWEQURMYZT", "Overall": "2.0", "Content": "My reasons for purchasing this product for my children was not validated as they continue to gravitate back to my tablet. The display is dull and not vivid, the wifi connectivity not good at all. I should have spend a little more and get a better tablet.", "Title": "This tablet was not to my expectation", "Date": "January 28, 2014"}, {"Author": "jose", "ReviewID": "R3IVB5SR2B4DGB", "Overall": "1.0", "Content": "Not good I ben have problems with it but the happen wen you buy something for the price I don't think it's worth may money", "Title": "01 28 2014", "Date": "January 28, 2014"}, {"Author": "comfort", "ReviewID": "R2G8ZGFPI54NPA", "Overall": "1.0", "Content": "I was disappointed with this product \"Noria Expanse 10\" Android 4.2\".  I owned this tablet for only four days and it died on me. This was my first tablet and I have so much I wanted to use it for but to discovered that it wouldn't turned on at all. So, I had to return it.", "Title": "Noria Expanse 10\" Android 4.2", "Date": "January 28, 2014"}, {"Author": "amanda Cornelison", "ReviewID": "R1Z9Z0MMRE0C1V", "Overall": "1.0", "Content": "It was cheap which was good for my pocket but not made good my son dropped it a week later and broke screen on carpet floor", "Title": "cheap", "Date": "January 27, 2014"}, {"Author": "Miraflor Ellis", "ReviewID": "R2NP62UMVHQJZN", "Overall": "2.0", "Content": "Nice device if it were properly tested before its debut. I read a couple of reviews detailing the problem with the device locking up. But, I bought it anyway hoping that it was not a problem throughout the product line. BUT, with the first initial boot , It froze. And after that, it froze within minutes of use. Nice try, but I've never seen an IP@D lock up.", "Title": "WOULD have been a hit!!", "Date": "January 27, 2014"}, {"Author": "danielle branton", "ReviewID": "R3ACJPC2OH76AX", "Overall": "5.0", "Content": "going to get one for my mother, the only down fall is the large Pictures it take using the front view camera. all others is fine", "Title": "every thing was great", "Date": "January 26, 2014"}, {"Author": "Dolly Paige", "ReviewID": "R1U180ILA8BH9K", "Overall": "5.0", "Content": "I ordered this for Christmas for my grandson. It was delivered on time and in great shape. it was working right out of the package. He said it was perfect. The apps were easy to install and he was up and running really fast. He chats with his friends and plays games with his friends. So happy with this. Thanks for a great product.", "Title": "He loves it", "Date": "January 25, 2014"}, {"Author": "Leslie", "ReviewID": "R1NICGLYPTENBZ", "Overall": "1.0", "Content": "This tablet is horrible! It doesn't hold a charge and wnt connect to the internet. I would not recommend this tablet to anyone! What a waste of money.", "Title": "Don't buy it!!!!", "Date": "January 20, 2014"}, {"Author": "carmelo", "ReviewID": "R1QAA1O20GH4HK", "Overall": "1.0", "Content": "I chuse this rating because the chromo i got didn't work propperly and i haven't get the new one yet so i cab't said what i like or dislike of this product", "Title": "This is why i chuse the rating.", "Date": "January 19, 2014"}, {"Author": "Charlye Hahn", "ReviewID": "R1OLESWRMM723W", "Overall": "5.0", "Content": "I purchased the 7' tablet for my teenagers.  I liked the price, the size, and the versatility of the machine.  My teens were excited and expressed the opinion that \"although you are electronically challenged, you did good\"  I am always happy to be able to surprise my teens.  This tablet was awesome and made me look good. I would recommend anyone with teens to try this as a first step into a computer of their own.", "Title": "The teens in my home applauded me!", "Date": "January 19, 2014"}, {"Author": "Sophia Swink", "ReviewID": "R2WU6VWQDS6O84", "Overall": "5.0", "Content": "Got this for my 4 year old as she grew out of her innotab. Very user friendly for her. Also works great for me too!", "Title": "Great product", "Date": "January 19, 2014"}, {"Author": "bobdelduca", "ReviewID": "R2GIPL7Z8T7DLJ", "Overall": "4.0", "Content": "Product is worth the cost and works okay. Certainly not the best. It functions well but a lil clumsy to operate.", "Title": "Worth the $$$", "Date": "January 19, 2014"}, {"Author": "Hans J. Pluhar \"panama1\"", "ReviewID": "R1VJXGZLB0BUBB", "Overall": "1.0", "Content": "A Tablet with 1 HR battery live should not be offered a a valuable item by Amazon. It hurts your reputation. I hope that the offered return policy will be better and I get my money back", "Title": "Poor", "Date": "January 18, 2014"}, {"Author": "Elida Gonzalez", "ReviewID": "R1HUALAEIHJSI9", "Overall": "5.0", "Content": "I was always looking around for a great school tablet. I'm 12 in middle school and this is the perfect one. I use it of office (free) and I do my HW on it and its budget friendly if you're looking for a cheap tablet you should get this one. Came in 2 days and perfect packaging I ordered a 4gb tablet and instated I got an 8 GB at the same price! I love it.", "Title": "Great For Middle School", "Date": "January 18, 2014"}, {"Author": "Jason T Polite", "ReviewID": "R2Z6455JBI0IEX", "Overall": "5.0", "Content": "This product is perfect for first time users ....I got this tablet for my mother in law and she loves it... You can take pictures front or rear wifi is good no problems at all", "Title": "Great for first time users", "Date": "January 18, 2014"}, {"Author": "T. Kohenskey \"BMT Nightingale\"", "ReviewID": "R3EMMA0OYVILVG", "Overall": "5.0", "Content": "Bought for young Grandson. He loves it. I was very impressed with it for the price.  Responsive screen. Plus it has sd slot. Wish my iPad had one lol", "Title": "Great first pad for kids.", "Date": "January 18, 2014"}, {"Author": "Bessie Small", "ReviewID": "R3T6YK4BY13R3U", "Overall": "5.0", "Content": "Bought this tablet for a 5 year old and he loves it no complaints yet. I would definitely recommend this product to someone else.", "Title": "Tablet", "Date": "January 17, 2014"}, {"Author": "Patrina", "ReviewID": "R20POHV7ASJJXS", "Overall": "5.0", "Content": "I ordered this for a gift and they love it. Works very well i am pleased its a must have if u want sumthing nice and resonable", "Title": "Love it", "Date": "January 3, 2014"}, {"Author": "tjdarr79", "ReviewID": "R1VZE16SZMME53", "Overall": "3.0", "Content": "I ordered two tablets but I had to send one back, because it would not start pass the android logo.  The other tablets is working just find and have not problems and my kid is having fun with it.", "Title": "ordered two", "Date": "January 3, 2014"}, {"Author": "Martha H. McGough", "ReviewID": "R239F83V13IB6C", "Overall": "4.0", "Content": "my granddaughter got it for Christmas and was very happy until the charger stopped working.  now she is unable to use it she used it when it was charged and then no more, not sure what to do?  maybe return it?  tried to get a replacement charger but not available so I am returning the item to bad.", "Title": "unfortunatley the charger was damaged", "Date": "January 2, 2014"}, {"Author": "photojunkie", "ReviewID": "RK1C0VF0DCMOC", "Overall": "3.0", "Content": "Tablet is okay and serves it's purpose. However, I FIRMLY recommend not removing the protective film over the screen that is on the tablet until you purchase a screen protector.  This screen scratches very, very easily.", "Title": "Okay but screen is very sensitive", "Date": "January 2, 2014"}, {"Author": "Toya Hunter", "ReviewID": "R1UBZCOEXY9B3L", "Overall": "2.0", "Content": "My tablet makes a sizzling like noise between changing web pages n sometimes just because. I don't believe this should be happening. Also the touch screen pens were not in the box. What. Do I need to do to receive them.", "Title": "sizzling sound and missing touch screen pens", "Date": "January 1, 2014"}, {"Author": "Nguyen", "ReviewID": "R3HCGTCE8WKM2X", "Overall": "3.0", "Content": "I haven't had my tablet. Its like a month now! i was late of Christmas present for my kid. Now its just too late. Please track down my order", "Title": "where's my stuff?", "Date": "January 1, 2014"}, {"Author": "Sonji Evans", "ReviewID": "RJ36ODEL28BRM", "Overall": "5.0", "Content": "The item was given as a gift.  The person has informed me that he enjoys it and uses it daily.", "Title": "review", "Date": "January 1, 2014"}, {"Author": "Betty", "ReviewID": "R1UJNT1QXA116", "Overall": "2.0", "Content": "I HAD TO RETURN it because it didn't function properly.  I really tried to operate it but it wasn't allowing me to get into certain area's that it should have.  But with some maintenance  on the tablet it could be a Good tablet for the price. I really hated to have had to return it but now I'm glad I did.", "Title": "Chromo Inc 7\" Android", "Date": "January 1, 2014"}, {"Author": "shareka", "ReviewID": "R3HNAB548TEAXF", "Overall": "5.0", "Content": "This 7\" android tablet is incredible. It keeps the teen busy reading once the Kindle is downloaded. It just awesome you would not want to use your laptop again", "Title": "incredible Chromo Android Tablet", "Date": "January 1, 2014"}, {"Author": "rick", "ReviewID": "RP3X29KE002DG", "Overall": "5.0", "Content": "My kids love them and they are good priced for a kids first tablet . I would even buy one for myself", "Title": "Good price", "Date": "January 1, 2014"}, {"Author": "GEORGE CHEGE", "ReviewID": "R3H2J6PNM6DEXS", "Overall": "1.0", "Content": "I BOUGHT A TABLET FOR MY HUSBAND FOR CHRISTMAS I OPENED IT THE DAY BEFORE CHRISTMAS IT LOOKED FINE WASNT BROKEN OR ANYTHING BUT WHEN HE OPENED IT AND TURNED IT ON IT MADE A LOUD SOUND AND THE SPECKERS WERE BLOWN OUT I WAS SO PISSED OFF IT WAS A CHISTMAS GIFT AND ITS BROKEN HAD TO BUY MY HUSBAND A DIFFERENT GIFT THE NEXT DAY BECAUSE I FELT SO BAD IF YOU LIKE TO SPEND YOUR MONEY ON BROKEN GIFTS THEN BUT FROM THEM", "Title": "DO NOT BUY A TABLE FROM THIS COMPANY", "Date": "December 26, 2013"}, {"Author": "Amber Whitaker", "ReviewID": "R1S0NQQ7J7XCXH", "Overall": "5.0", "Content": "The picture above is the tablet I ordered but I actually received a different one. This is the 2nd one I have bought from Seller1on1.  Its a great tablet. Perfect for my 8 year old. The first was bought for my 5 year old. Now the first one is a little different. Its more cheaply made, but as I said, its for a 5 year old boy. Its does what I need it to do for both kids and the price was great so I'm happy, especially since the 5 year old breaks everything lol. I just wish it had Bluetooth so we could get the wireless game controller for it.", "Title": "Surprised!!", "Date": "December 16, 2013"}, {"Author": "FRANCISCO ENRIQUE LOPEZ  MALAVE", "ReviewID": "R3PHIEE3YSW916", "Overall": "5.0", "Content": "It is a good product I recommend I hope will please everyone as it was for me to receive a cordial greeting", "Title": "It is a good product I recommend I hope will please everyone as it was for me to receive a cordial greeting", "Date": "November 22, 2013"}, {"Author": "norma", "ReviewID": "R1V3MJ437RBG0A", "Overall": "5.0", "Content": "right on .......its awsome i love it thanks amozon. and iam buying another 1 for my daughter she likes it to right on.", "Title": "chromo .......right on........", "Date": "November 18, 2013"}, {"Author": "Robert", "ReviewID": "R14JAPKKE5EEQM", "Overall": "5.0", "Content": "A great product very pleased and will recommend this to all my friends and family..Can't wait to give these as presents..", "Title": "Looking for a Great tablet for a great price", "Date": "November 17, 2013"}, {"Author": "Shannon", "ReviewID": "R1DS6KE72PII5Q", "Overall": "3.0", "Content": "Works okay, has some trouble with wifi strength. It is good for it's price. It works great for traveling, need internet access, playing videos and games.", "Title": "Good for price", "Date": "November 14, 2013"}, {"Author": "Reese", "ReviewID": "RHMR4IF3TA6TF", "Overall": "5.0", "Content": "I am glad I finally  made the purchase. I am still learning my way  around it but what I`ve done so far I like.  I have  reccommended it to a couple of people I know and one person has already purchased theirs.", "Title": "Still  Learning", "Date": "October 12, 2013"}, {"Author": "chelsea", "ReviewID": "R393RV6NF8RAMW", "Overall": "1.0", "Content": "Nothing to do with the seller - it arrived in good shape and on time.  Previous reviews prior to ordering indicated it was be good for kids. This was ordered for a stroke victim with hopes that he could use it.  Upon receipt it kept giving messages that google store items would not download and gave error messages.  Appears there are problems with the tablet communicating with Google so we have not been unable to load any games.  Pictures are not easy to get to for viewing, you have about six screens to get to see them and they are not able to be seen in slide show mode.  Overall we have three people try to work on this tablet and have not been able to do what we thought it would do. So disappointed in it not to mention the person the gift was for is very frustrated at trying to load it.  About the only thing he is able to do on it is view facebook.  Don't waste you time or money on this table.", "Title": "not satisfied", "Date": "August 14, 2013"}, {"Author": "Aaron White", "ReviewID": "R3SS04DXT851VD", "Overall": "3.0", "Content": "This is a nice tablet but battery dies fast and cannot download the apps you like to.I am having to charge the battery while in use.", "Title": "Low", "Date": "June 23, 2013"}, {"Author": "Joyce Rodriguez", "ReviewID": "R38VC6HCTYJ681", "Overall": "1.0", "Content": "This was second one of these tablets , poor quality un like the first one,this one did turn on , but did't work for long, it shut off,we put back on charger, thinking battery needed charged, it got exstreamly hot on back part...in my opnion not a safe product", "Title": "Quality of product not saticifing", "Date": "March 27, 2013"}, {"Author": "Clam Canoe", "ReviewID": "R8S9ZVIPQFVTM", "Overall": "1.0", "Content": "Do yourself a huge favor, and save up a couple of extra bucks, and buy an HP Touchpad 32GB from eBay for like $150. It's almost 10\" and fast as hell. These things are total crap. Cheap Chinese tablet that's virtually unusable. Horrible.", "Title": "Total unusable Chinese garbage.", "Date": "January 25, 2013"}, {"Author": "Astrid", "ReviewID": "R1X5HERARBK5EU", "Overall": "1.0", "Content": "this product never served, and when i want to return it, i cant do it because i have just 1 month for it, i feel chated by this people, amazon.com must be more serious with us the costumers. mi peor compra y eso que hago muchas con regularidad, nunca sirvio el aparato y ahora me dicen que no puedo regresarlo, que estafa no lo recomiendo por nada del mundo", "Title": "it doesnt work, my worst buy in amazon.com (hablo espanol)", "Date": "May 3, 2014"}, {"Author": "larry keane", "ReviewID": "R2LIX3F75UIY5X", "Overall": "1.0", "Content": "Same as above, plus the thing stinks. Gave it to my cat to play with. She likes to swat it around the house.", "Title": "poor quality", "Date": "May 2, 2014"}, {"Author": "Susan Mayhan", "ReviewID": "RBLUABFWU332S", "Overall": "3.0", "Content": "My grandson loves this tablet. I think it would be a nice one for adults if it were a little larger. But he loves it and the price was great.", "Title": "grandson", "Date": "March 27, 2014"}, {"Author": "vit", "ReviewID": "R2ALWXGHMWXY5D", "Overall": "4.0", "Content": "I m fine with this device except the fact that battery keeps much less than what is written in the product description. Quite usual issue with tablets.My real rating would be 3.5 which is not possible here.", "Title": "Reasonable value for the price", "Date": "March 25, 2014"}, {"Author": "D. W. Butler \"Silly Philosopher and Alchemist\"", "ReviewID": "R22AMBRMZNU9SR", "Overall": "1.0", "Content": "I bought two of these for my adult sons. The first one developed a crack within a week and the other in about 2 months. In both cases there was no clear reason, such as a drop, for the cracks. Worked fine before the cracks but it wouldn't matter if they were better than iPads if you can't use them due to the defect.", "Title": "Mysterious cracks", "Date": "February 19, 2014"}, {"Author": "sherene M", "ReviewID": "R3FRS1ETV2WJTY", "Overall": "3.0", "Content": "Decent product. I ordered colours blue and black they sent me only black. One is working just fine the other does not. One started giving problems the same day I received them and I hate returning purchases. After all I ordered NEW PRODUCTS. However price wasn't too bad", "Title": "Improvements needed", "Date": "February 13, 2014"}, {"Author": "Patricia Pickett", "ReviewID": "R3OUYU3IGZV6Z1", "Overall": "1.0", "Content": "I keep loosing service and it is extremely slow even though I have high speed internet.  On my candy crush from Sega I lose games and cannot get the screen to react to send lives.  I have to hiut the screen at least 10 times.", "Title": "My candy crush game on Facebook.", "Date": "February 7, 2014"}, {"Author": "KathrynR", "ReviewID": "R1N5YAIN9ACHRS", "Overall": "4.0", "Content": "Good for small children's use. They are easy to use and have enough room to add games and learning programs. Thanks", "Title": "Very good for small children's use.", "Date": "February 5, 2014"}, {"Author": "TP", "ReviewID": "R2L3VE4HUNS6JL", "Overall": "5.0", "Content": "I chose this particular Tablet because I am very familiar with Android and I love it. Also I researched the features and apps it could download. I went to the stores and compared the pricing which online AMAZON has frequently beat. The JellyBean itself is light weight, touch screen feature is precise, clarity of screen is great for pics & its compact.", "Title": "My 1st Tablet", "Date": "January 31, 2014"}], "ProductInfo": {"Price": "$199.99", "ProductID": "B00F2PFDLO", "Features": "The NORIA T2 features the fastest in its category Dual Core CPU with top speeds at 1.2 GHz and 8GB of integrated flash memory HD which all lend to a faster responsive experience.\nThe Noria T2 is capable of being used as a dedicated Chromecast Controller\n5 point Multi Touch feature means you can expand and minimize content seamlessly using the Android JellyBean 4.1 Software. Dual integrated front and rear facing cameras work GREAT as a webcam with SKYPE (pre-installed)/Google Video call as well as recording video and pictures in multiple settings\nThis tablet allows you to stream video on and HD 16:9 Display directly from the pre installed Google Chrome browser, Netflix App and all other streaming websites as well as download apps from Google Play Store over fast Wifi 802.11b/g/n.\nMini HDMI connects the NORIA T2 to your TV screen giving you a full internet streaming experience . Bonus HDMI Cable Included.", "ImgURL": "http://ecx.images-amazon.com/images/I/51DPpG0KgKL._SY300_.jpg", "Name": "NORIA T2 7\" Android JellyBean Tablet PC - Multi Touch. 8GB Flash Local Memory. HDMI Port (Bonus HDMI Cable Included). Dual Core CPU. Integrated Dual Camera 2MP - Black - September 2013."}}