{"Reviews": [{"Title": "Hard to beat the price and performance!", "Author": "Greg Lupinski", "ReviewID": "RDU2CKRORM4Q2", "Overall": "5.0", "Content": "Can't beat it for the price.I've had a few tablets, including name brand and so far this is very impressive.The display is outstanding.  The graphics speed very good.It reminds me of my old Asus.  The construction is solid with a metal backing.  I personally like the little extra heft.I've put a 32GB card in it for extra storage, you'll need it.Battery life so far is good.It's running android 4.2.2 and I like that.No issues with compatibility on any apps I've run so far.Bluetooth 4.0.  Works flawlessly.Connected quickly to my wireless and see's all my network devices.Wireless speed is very good and so far so it the distance on it.Ran some of the speed tests and it comes out in the middle of the pack, not bad when it's half the cost!I had an issue with the first charger with it and their support was very responsive.  That's a plus! I had the same issue with my Asus.Folks, for the price, comparing the features it's hard to beat.  I like it!To sum it up, put a 32gb card in it, speed is very good, battery life is good, it's smooth, construction is very good, the display is great.  Hard to beat the price and performance.  I'll update as time goes on!", "Date": "November 28, 2013"}, {"Title": "Hard to beat for the price", "Author": "Brooklyn808", "ReviewID": "RN25A6DI3H01T", "Overall": "4.0", "Content": "First, let me start by saying that I did not purchase this tablet from Amazon. I got a good deal directly from Latte on the biggest auction site in the world. Free Shipping in addition to a free leather case. For $129 the build quality is exceptional. The back and sides have a nice brushed metal look and feel, no cheap plastics. As others have mentioned the screen looks great, I bought two other cheap tablets this Christmas season; a Nobis Quad core and also an Insignia flex 8, both fail in comparison. I returned those and took a gamble on this. While the screen is very nice I do wish it had more sensitivity, Its not as sensitive as my S3, Nook HD+ or even my first generation Galaxy tab. Hopefully that can be remedied with a future update; if that ever occurs. The android install on this tablet has minimal bloatware which is the way I like it. The first App I installed was Antutu benchmarks, this tablet scored 20,000 which is really good for a tablet in this price range. Antutu system info also verified that all the specs are as advertised. This is for my son so I did not test any games but as others reviewers have stated it plays graphics intensive games without issue. I took a look at the cameras and they are mediocre at best, not an issue since this tablets primary use will be for gaming and watching video.  One of the main reasons I purchased this tablet was due to its dedicated charge port, it does not charge through USB. This may be good or bad depending on how you look at it. USB ports are everywhere which makes charging at various location alot easier. I like this tablet's dedicated charge port because it allows charging  while using the USB port, it means no battery drain while using an OTG USB device. All you need is a micro USB to USB adapter. I tested my wireless keyboard and mouse and it worked without issue. For gamers this means you can use an xbox 360 controller without worrying about battery drain. I have not used it long enough to rate battery life, I'll provide an update after my son has used this for a week. If it survives the week and gets good battery life then I'll add another star.", "Date": "December 22, 2013"}, {"Title": "BEWARE", "Author": "Margueritte A. Mertz \"Music Lover\"", "ReviewID": "R2HVBB0WI41SZV", "Overall": "1.0", "Content": "There is absolutely no customer service at all for this item. Have been trying for months to receive a replacement to no avail. There are many comparable products out there. Be sure to check the products Facebook page, everything you'd want to know can be seen there..", "Date": "March 8, 2014"}, {"Title": "superb tablet!!", "Author": "sokae", "ReviewID": "R5Y4BC2LP9CR", "Overall": "5.0", "Content": "##### Buy it from LatteZone cause you get a free case and priority mail shipping!!####- before I start, I am using the tablet typing this. When I first receive it, I was really excited. The package come in perfect condition and everything is in there including manual, chargee, USB and the new latte ice tab2 itself.- the tablet run on quad core RK3188 which is faster than tegra 3 in terms of benchmarks. It has quad core GPU Mali 400 which I wish it was something else since its not that good and lots of games aren't optimized for it.- the tablet is very fast and screen display is clear/crispy than my old iPad mini 2012. The batteryLife is really good. I would say around 8-9 hrs we browsing with 1/4 brightness. 5-6 hrs of heavy gaming which is really good and it doesn't heat up fast like others tablets i had so far. The build quality is superb! Its really well nice design. Its really thin and really buff like how I say it......fell like a premium tablet like apple products lol. Even my older brother who had an iPad air say the tablet is really well built and design considering it only cost me $129.99 with fast free shipping.- Gaming## I try modern combat 3-4, dead trigger 1-2, Asphalt 7-8, real racing 3, Blitz brigade, shadowgun dead zone, unjustic god among us, GTA vice city, gangstar las Vegas, subway surfer, temple run 1-2, dispicable me minions etc......and I could say that all those games run fine on the tablet. As you know, Mali 400 are not that good with heavy 3d games so the graphic might be off and laggy. If the tablet were to have sgx540+, its would be a really good gaming tablet coupe with a fast RK3188.- the internet on this tablet is good. It haven't loss signal or anything. The web browser is fast, load pages quickly. The speaker is what make this tablet different from others. Its on the bottom front of the tablet instead on the back. I like it since when you watch movies or videos, you can hear better. The quality of the speaker is really good. If you have ever own an nook HD, its the same loudness.- overall, the tablet itself is amazing, well design, fast, amazing display and really good battery life! For $129.99, what more could you ask???##update##  12/26/13---  - after 2 weeks, the tablet shut down by itself and when I turn it back on, it just show a blue blank screen. I have contact lattezone for a stock Rom since I could restore it using rkbatch tool. it'd been 2 days since I message them about uploading their stock filmware for latte ice tab2 which they say they will message me once they upload but so far no message about the filmware. Will update once I get a reply....12/27/13--fix my tablet! super easy to flash the stock filmware plus lattezone also give me instruction on how to. their customers service are awesome, thanks a latte!#update 12/27/13#- hey guys, just heard that Rock chip will be getting android kik kat 4.4 and SDK 2.0 for all RK3066&3188 tablets! Hopefully latte will put out a filmware update on this baby. Here's what I found that will improve:- 30% increase in videos and gaming performance plus graphics!- more optimized OS meaning smoother performance!-Bluetooth 4.0 and etc...Overall, this tablet is a steal plus the premium feel to it so look no further and start buying directly from LatteZone....( get free case plus fast shipping, if your lucky enough like me)", "Date": "December 13, 2013"}, {"Title": "MUST READ", "Author": "Siscowolf", "ReviewID": "R2I68D4OUEPDPM", "Overall": "2.0", "Content": "If I'm being totally honest, this is a waste if money.  You would be better off spending an extra 30 bucks to buy a refurbished nexus 7 or Asus tablet, and here is why:1. Latte is an unknown, unworthy, Chinese company that prides itself in customer service - until you buy the product, then they never talk to you again!  No lie - go to Facebook or try to google it... You can't find almost anything on the Internet and there Facebook is riddled with dissatisfaction!2.The hardware sucks.  Plain and simple, it is cheap.  At first I was impressed with how pretty it looks and it feels light and fantastic.  Start to watch movies and play with the buttons and you realize - the buttons feel like they are broken, the speaker is quiet and crappy, the headphone jack doesn't work, and the screen resolution is tolerable... The specs are fine, but the way it is built and the materials used leave you disappointed!3. IT IS A TEEZ!!!! This tablet is great for making you feel like you have a nice piece of technology, and then letting you know that you can't really do the things that you wanted to do... Like mix music, or use it as a drawing pad, neither of which are very practical with this product.  I eventually have up trying to fix the issues since there is no support and no forums, and no help anywhere.  Gave it to my 5 year old daughter - all it's useful for is the vast market of google play games... And even then the sound still sucks.To sum it up: this tablet is not for anyone who wants a tablet.  This is a high priced kids toy!  It looks and feels great, has a nice screen that could use some more pxls, and runs great android 4.2 jelly bean software.  But this is where the good ends and a line of harsh disappointments fallow.  Bad speaker, broken headphone jack, terrible customer service, no support or online forums, and worst of all I couldn't use it for what I needed a tablet for!  This is only good for little games, movies (with bad sound), and browsing the Internet...I bought myself a new Nexus 7 - cuz I'm worth it! And so are you...", "Date": "April 13, 2014"}, {"Title": "Too good to be true unfortunatley", "Author": "Micbax77", "ReviewID": "RRYUZDKB78KIS", "Overall": "1.0", "Content": "Got one of these for my brother as a birthday gift. He loved it and said he used it all the time so about a week later I purchased one for myself. After a week the screen became very dim. Adjusting the brightness and doing a factory reset didn't work so had to return it. I decided to give it another shot for some reason but the replacement one also worked fine for a week before I had issues with the touchscreen. I would select an app from the home screen but another app nowhere near it would light up and open. Soon after that, anytime I tried to touch something on the screen one or more other things on the screen would light up and attempt to open/activate. Became impossible to use. Trying to pause, advance or rewind something on netflix or you tube was mind numbingly frustrating. Just trying to shut it off became a huge pain because the touch screen was so messed up. This tablet has pretty good specs for it's price (Quad core, 1280 x 800 res.) but the quality seems to be just awful, judging by my experience and many of the reviews left by others.", "Date": "March 3, 2014"}, {"Title": "decent tablet", "Author": "Kenneth Kay", "ReviewID": "R14OJGICNVZN6U", "Overall": "2.0", "Content": "Nice screen, runs apps pretty well. Won't charge via USB cable and has annoying cover over ports. Charging via the supplied charger only is a killer since nearly everyone has a micro usb cord to use wherever you go", "Date": "February 12, 2014"}, {"Title": "For the money -- it's pretty good", "Author": "Stephen S. Benge", "ReviewID": "R2H5FQQ9RV16E3", "Overall": "4.0", "Content": "Well ....I was skeptical at first...I was looking for an 8\" Android tablet with- sturdy case (metal)- micro SD Card- fast processor- HDMI outI do like the size of the iPad mini, but I am not a fan of the price, nor the closed OS (iOS).Let me state this upfront: this unit does not perform as well as the nexus 7 2013 edition (made by Asus).Now .... the good:For the money: this tablet is actually pretty good!- fast enough for light office use and to run some apps- very light weight (lighter than an iPad mini)- graphics are okay (but I am not into the games nor picture taking)- sturdy case (aluminum backing)- USB and HDMI port- separate AC charging port-PRICE (less than half the price of the iPad mini w/o retina display)- micro SD portI like the feel and the nice, big 8\" screen (7.85\" actually).Now - frustrations:- some of the apps don't work on the tablet (I have some apps that will not produce sound when they should).- hangs sometimes- can't upgrade the Android OS (easily)*- screen resolution is a little -- outdated- sometimes it drops the wifi- sometimes it reboots- sound is OK - not great (works great with head phones)- battery life is so-so (so far).For what I generally use it for (at the office) - works great; at home, there are two apps that I need the audio in the app for (and they are not working on this tablet).Hey for $119 - this tablet is actually a steal!!", "Date": "January 29, 2014"}, {"Title": "Worst tablet ever", "Author": "pichorra9", "ReviewID": "R30IPVQICPEKMM", "Overall": "1.0", "Content": "Even after rooting this tablet sucks, my HP touchpad with cyanogenmod was 100%better.If you already own this tablet and want to root it, use Kingo root after installing the program go to device manager in windows 7 click action at the top and select ad legacy hardware, select installed hardware automatically, choose android device and then android composite ADB interface. kingo will then recognize your device.", "Date": "April 14, 2014"}, {"Title": "No Product Support from LatteZone", "Author": "Disgruntled \"somewhat\"", "ReviewID": "RANR5S6DR0MB7", "Overall": "4.0", "Content": "I bought the Q8 tablet this month and I like the tablet. Very little bloatware, pretty much only the essentials installed and you can install everything you want or need from Play Store. The tablet has a fast enough processor and enough RAM. I bought a 64GB SDXC card and formatted FAT32 and it works in the SDHC slot so there is now a massive amount of storage for a small cheap tablet.I have no complaints about the tablet's build, workmanship or quality. I was aware of the screen size and resolution before I bought so there is no disappointment there. I consider this an excellent bargain, all things considered.But if you ever need any product support you won't get it from lattezone.com .", "Date": "February 13, 2014"}, {"Title": "faulty product", "Author": "Heath", "ReviewID": "R33PRWKGQ5IYCW", "Overall": "1.0", "Content": "Buy the warranty if you want this cheap product.Was a great tablet at first until week two where the screen would no longer turn on, i didnt drop it and took good care of it. I thought I was saving myself money not getting the warrenty but instead I'm screwed. Unreliable device", "Date": "May 26, 2014"}, {"Title": "Great hardware, not a lot of manufacturer support", "Author": "B. Ikehara", "ReviewID": "R3UYBB8NJ0OFFC", "Overall": "2.0", "Content": "FYI, i bought the tablet during sale for $105, so I will write my review in regards to this price point.The Good:tl;dr Device hardware is of good value.1. This tablet has great hardware for the price. I cannot think of a tablet that has better specs for the price.2. Fast charging. The charger is a 2 amps.3. Cool aluminum backing4. Easy to root.5. Android 4.2.2 Jelly beanThe Bad:tl;dr Device needs polish mainly in the software.1. Old version of Google play apps. I cannot sync my Google account that has GAuthenticator enabled. Regular account will sync perfectly fine. This also means that externally manage accounts (education, business, or etc) will not be able to sync. =[2. The software doesn't seem to be optimized for the tablet screen. The size of the font or menu bars seem to be out of proportion for the device. Avoid if you have bad eyes or don't want to squint.3. Charging using the micro usb does not work. I must use the included charger.4. LCD light bleeding. Although this is not too bad, back light bleeding is visible under very low light.5. Charger port is not fully aligned. The internal motherboard could be aligned better.6. SD Card slot is hard to use. The internal motherboard could be aligned better.7. Device doesn't understand the top from the bottom. The camera is on top and speaker is on the bottom. This can be verified if you rotate the device and read the text on the back of the device. But certain apps recognize the device as the camera is on the bottom and speaker on the top. The same app on my Galaxy Nexus recognizes the phone orientation correctly. Another software optimization problem.8. Manual screen brightness. At the price point, I don't expect there to be an ambient sensor, but it still would have been nice.The Ugly:tl;dr Don't buy the tablet.1. The manufacturer website seems dead. People have posted messages about not hearing from the manufacturer. Basically, if you hardware dies, you are out of luck.2. I have sent a message to the manufacturer and seller. Since I bought it from LatteZone as a 3rd party seller, I hope to hear back to them soon. If not, I am returning this tablet.3. Not many resources for this particular device. Other devices based on the Rockchip varient exists have a plethora of resources. Search by its processor model RK3188Conclusion:If only support for this tablet was better, then I confidently tell others to buy this tablet.", "Date": "March 7, 2014"}, {"Title": "Do not buy!", "Author": "Jose M. Traviesa", "ReviewID": "R2OHSU2YHV57GL", "Overall": "1.0", "Content": "Tablet looks awesome...that's it though. Got two defective tablets in a row, both had issues with the screen. First they worked ok, then I couldn't see anything. One of the tablets I got didn't even charge. Got my money back! Buying a nexus instead.", "Date": "February 25, 2014"}, {"Title": "Great tablet when it works", "Author": "Jimmy Turner", "ReviewID": "R3MD9EPZ61EPDX", "Overall": "3.0", "Content": "Love the hd display and size of the tablet.  Have had 2 times when tablet just stopped responding and had to let battery drain down to get it working again.  Contacted Lattezone tech support but got no response.  Another negative other than tech support is lack of accessories for the tablet.", "Date": "January 21, 2014"}, {"Title": "TERRIBLE PRODUCT, TERRIBLE COMPANY", "Author": "Daniel Gates", "ReviewID": "R2K9WWJCFS6K3Q", "Overall": "1.0", "Content": "I would not recommend anyone purchase from this company.  I got the Ice Tab 2 lv70Q and the screen stopped working after a month.  My brother went through 3 of them before finally getting a different brand.  I have been waiting for weeks to hear back from their so called support.  No one ever responds to emails/phone calls/support tickets/etc.  If you look at them on the Better Business Beura you will see they have an F rating. People that do get through to support will mail in their broken item and never receive it back.  Now they have your money and your device. DO NOT TRUST THIS COMPANY!!!:  [...]", "Date": "March 27, 2014"}, {"Title": "love it", "Author": "Falisha", "ReviewID": "RJUIG50T93ZND", "Overall": "5.0", "Content": "If you are getting a tablet for the first time this is a good one. Easy to use. Using it now. It looks good, not too big. I had a zeki returned it in 2 weeks too many bugs. The latte I've had for 2 months NO problems, fast, great color. Well worth the money.Cons:Battery life could be betterSound could be betterDidn't come with headphones", "Date": "February 22, 2014"}, {"Title": "Looks Good on Paper, But....", "Author": "Frank", "ReviewID": "R39MOD3O76NIXO", "Overall": "1.0", "Content": "The spec looks good on paper, but I wouldn't recommend it to anyone.  Here are some flaws that I found out in a hard way....1. Doesn't support 5 GHz WiFi.2. There is no sensor for the screen brightness.3. Poor Camera quality4. It's can't be upgraded to the newest version of Android.5. Fit and finish is hit or miss.  Some reviewers said it's good, but mine was making squeaky sound.  Poorly put together....The overall experience with this tablet was disappointing.  My 2012 Nexus 7 performs better than this overall....surfing web and apps.  After all, you get what you pay for.  So, I returned it.", "Date": "January 6, 2014"}, {"Title": "Review for Latte IMuz Q8", "Author": "Tracey Ann Miller", "ReviewID": "R2LDC2EZV91ICE", "Overall": "2.0", "Content": "Let me just say I gambled really hard when choosing this tablet because only one person said which specific tablet they purchased while writing their review!!! We have three options and I wasn't sure which review went with which tablet offer....but anyway I took a chance and got the 7.85 inch Imuz q8 . Its beautiful but the sensors really suck at first I had trouble simply deleting an app off my home screen, it wouldn't allow me to drag it to the remove space. Then it wouldn't let me type the first row on my keyboard unless I turned it horizontally now it won't let me drag the lock to unlock I have to drag it to Google or camera just to get in the tablet. I have to return it. I thought it was just one part of the touch screen but found out very quickly that its a lot of it.", "Date": "December 25, 2013"}, {"Title": "This review is for the Latte ICE Tab2 Quad Core (in black)", "Author": "mike44", "ReviewID": "R2ND4UM12LTMMU", "Overall": "3.0", "Content": "This is my first tablet; I've only had it for a day, but so far, everything works fine.  The wireless range and speed (10 Mpbs through our U-Verse connection) is pretty good.  The screen has a wide viewing angle, and has good color and tone, especially for the price.  It seems pretty snappy bringing up browser windows, and the few games I tried (including a 3D one) ran fine, as well.Update-12/21/13: One week after I had the tablet; it stopped working.  I just shut it off when I was done using it this morning, and about an hour later when I went to turn it back on, nothing.  I tried holding the power button for 10 seconds, using the reset button, nothing works.  Finally, an hour and a half later, it powered back on.  I'm going to put my review at 3 stars for right now, and hope this doesn't happen again.Last update-it did it again.  This time, it took about 6 hours for it to finally turn back on.  I returned the tablet to Amazon.  I thank the company for responding to this post (they also responded to a post I put on the support section of their website, for a different issue/question).  Instead of lowering my review to 1 star, I'll just leave it at 3; for the week that it worked, I really liked it.", "Date": "December 13, 2013"}, {"Title": "I Wanted To Like This Tablet But....", "Author": "Kareem Bedford", "ReviewID": "R1IQRBB42D5M8H", "Overall": "2.0", "Content": "I'm going to be honest for the price this is a decent tablet. Unfortunately for that price they cut corners on these tablets. It has a nice screen and a pretty good processor, these are the pros. The cons are the the cameras is garbage, barely usable. And the speakers are absolutely trash! I ordered the 1st tablet lasted about 2 weeks and the speakers stopped.  Returned the 1st and purchased the 2nd. I swear to you within 1 hour of unboxing  the 2nd tablet the speaker stopped working! If these tablets had even decent camera's and speakers I would recommend them. Until then I would pass on buying these. I returned both tablets, saved about 40 more bucks and bought a Nexus 7. I haven't looked back since!", "Date": "February 24, 2014"}, {"Title": "Specs On Paper Does Not Match Performance.", "Author": "G. Davis", "ReviewID": "R1UGCDYLBV57D3", "Overall": "1.0", "Content": "I received my Latte iMuz Q9 Android 4.2 9.7\" XHD IPS screen quad core tablet on Jan 3, 2014. Let me say that Amazon shipping service is great! The table looked great; it came in a nice professional package. However, the specs that look good on paper doesn't perform well in reality. Let me start with the Tablet itself. It almost looked like an Ipad with exception of the metal back plate (which I thought looked cool). It was your typical built tablet like any other brand when it came to the materials. Next the screen, I will have to say the screen was nice indeed though the brightness control was very poor. The camera was terrible. I know that is not the main reason why we get a tablet but it should be working properly and take great pics. I found the pics and the videos to be grainy and was very poor quality. I did not like the fact it came with a charger instead of charging it through the USB port. It isn't a deal breaker, but it is just more stuff to carry with you if you plan on traveling. The videos from Netflix and HBOGo ran choppy. It should have been smoothed considering the hardware inside. It did come installed with Google Play so that was a plus. When flicking between screens, it seemed like you have to flick quick to get the screen moving. I was real excited when it came in but was disappointed. Even worse, after 30 minutes of play time with it, I could never get it to come back on. I have already sent it back to Amazon for a refund. If you are looking to root or whatever, it is best to move on to something that is more familiar to electronic consumers. This tablet had potential but just couldn't reach the mark.", "Date": "January 6, 2014"}, {"Title": "Excellent Tablet", "Author": "Darryl", "ReviewID": "R1OHWHKBWVNDEQ", "Overall": "5.0", "Content": "Bought the Latte Tab2 for myself, as I was looking for an affordable quad core tablet. No complaints so far. Build quality is excellent, processor is snap fast, and has Android 4.2 installed. For the $129, I paid, was an excellent buy.", "Date": "December 30, 2013"}, {"Title": "Blazing Fast!!", "Author": "RonB", "ReviewID": "R11J38SURJF4AA", "Overall": "5.0", "Content": "Just received this and loving it.  It is just as advertised.  Google Play is installed and works perfectly with it.  Netflix works without a hitch.  Youtube works through the web browser.This is very close in appearance and size to iPad 4 with the exception of where the camera is located.You can't beat the price for the specs on this.", "Date": "December 20, 2013"}, {"Title": "tablet", "Author": "thelma i smith", "ReviewID": "R11J0LXCSH86D2", "Overall": "4.0", "Content": "the glass is  very is to break.  i used  it twice back of it is so smooth and slippery there is no grip  it just slid out of my hands and the glass cracked.", "Date": "June 5, 2014"}, {"Title": "great buy!", "Author": "tyree carpenter", "ReviewID": "R1T0YYK0C5SS79", "Overall": "4.0", "Content": "Its a really good tab and well worth the money, its not an iPad so don't expect that level of performance but it is very close. Definetly the next best and cheapest tab out there", "Date": "June 5, 2014"}, {"Title": "IMUZ Q9 4.2 9.7\" screen", "Author": "PCDuck \"PCDuck\"", "ReviewID": "R1UOA7P7H3A8OE", "Overall": "3.0", "Content": "Buying this tablet is like playing lottery. Maybe you will get a good one and maybe you'll get a real crappy one. I tried two of these. One had the battery life of less than two hours and the other more than 6 hours. It takes a long time like around 90 seconds to boot up. But still after booting it takes another 45 seconds to show the Wifi icon so you can touch to connect to wifi. After that it is ok. It is a fast tablet but sometimes it is not responsive. Again as I said this depends on YOUR tablet. Maybe your tablet has different issues than others'. The quality control is not really exercised so you will get this on your own risk.", "Date": "June 5, 2014"}, {"Title": "Love the tablet", "Author": "Quincy Kennedy", "ReviewID": "R3A12Z2S5XCDBJ", "Overall": "4.0", "Content": "Love this tablet it has a hard time being used while charging but is a very nice tablet for the price I would recommend it to any one with a medium size family cause it a good family tablet got a case for it from the latte web site and it works awesome good tablet", "Date": "June 1, 2014"}, {"Title": "there is two things that dosent like me", "Author": "VE256953", "ReviewID": "R2T5KM5NZ6MTN0", "Overall": "4.0", "Content": "The WiFi signal bits falls, ocasionally,  this happens in the same room when I got installed the WiFi router.  Also I think this problem makes the navigation by the internet explorer of the thablettablet some slow, more than the other tables that I got. The box of this product says that it have 16gb of internal memory but android sistem recognize 10 GB. Out of that the quality of the screen its good. And the quad core a have  to test first whit some program to tel you how it is. That's is the cause where I cualify 4 starts", "Date": "May 18, 2014"}, {"Title": "Absolutely love it!!", "Author": "Margaret L. Betz \"Jambini\"", "ReviewID": "RH1NW5TRKNDQ3", "Overall": "5.0", "Content": "We couldn't be happier with our son's new tablet.  It's just the right size for him to carry around and it does everything he wants it to do.  I personally like the bigger screen but he likes it just fine.", "Date": "May 15, 2014"}, {"Title": "Nice item for the buck", "Author": "John J. O'brien", "ReviewID": "R67M0XK7E6H2B", "Overall": "4.0", "Content": "Is as advertised, but takes a long time to boot up. The user guide could use some help, it is not intuitive and should be in a size larger than a postage stamp.", "Date": "May 6, 2014"}, {"Title": "Best for value", "Author": "Juan Francisco Casal", "ReviewID": "RN7571EQXMAMR", "Overall": "5.0", "Content": "Best tablet for value. Need, as other android, to be tuned for your needs.Had some problems with my email until downloaded outlook and is wrking perfect, syncronized, all good.", "Date": "December 31, 2013"}, {"Title": "Had high hopes but...", "Author": "Amanda N. Grell", "ReviewID": "RCIJOY59VK8NP", "Overall": "1.0", "Content": "We purchased this tablet as an Xmas gift for our 9 year old daughter and had high hopes based on the specs. Initially we were pleased with the screen res, color and overall feel. However, we started having issues right away with certain areas on the screen not responding to touch. It seemed to be the upper right-hand corner that wasn't responsive. Additionally, my daughter opened it and we set it up on Christmas Day. She played with it sporadically for less than a week (leaving it in a newly purchased case) and it stopped working all together. It was fully charged but wouldn't turn on or do anything. Tried hard reset. Tried charging using the USB and wall charger. Nothing worked. Returned to Amazon. Wish this tablet would have worked, because it looked like a great deal.", "Date": "January 7, 2014"}, {"Title": "Tablet", "Author": "Bms", "ReviewID": "R1F6K0BB1DSDTC", "Overall": "5.0", "Content": "So far tablet is working great, I'm waiting for my 32gb san disk memory cardto arrive to make my tablet even better.", "Date": "January 1, 2014"}, {"Title": "Best design and well performed tablet!", "Author": "Sang Bok Lee", "ReviewID": "R30THHH50CM1EN", "Overall": "5.0", "Content": "I choose this tablet based on hardware specs and OS with price. So far this tablet has been showing with good performance on most of apps and task.It has 1GB RAM to perform better than other cheap quad core tablets(most of them had 512MB RAM) also dual cameras is very useful if you compare with others did not have dual cameras.7\" HD screen is good with resolution of 1280x800 and other tablets had a only 1024x768 or 800x600 which makes this tablet perform better than other 7\" quad core tablets.Built-in front speaker makes Big difference, most of tablets has speaker on the back which it is hard to hear on outside but this tablet has front speaker and it is loud and clear.It supports memory expansion with built-in micro SD slot and i am using 32GB mirco sd card without any problems.It can run most of games without any issues and web browsing is fast!I would recommend this tablet to others!", "Date": "December 24, 2013"}, {"Title": "Price Dropped Drastically After New Year", "Author": "Phebe Chew", "ReviewID": "R3LCSBZW3W81X3", "Overall": "2.0", "Content": "Bought this at $259.99 as a Christmas gift for my mother-in-law who was leaving just before Christmas 2013. Come the New Year in 2014, I was surprised that the price dropped significantly to $199.99. Wrote in to ask about this in hope of some kind of courtesy refund but got no response. Highly disappointed that they do not price guarantee even for less than a month!The unit have a trouble recognizing the inserted micro-SD card even when all data was erased by another device. It could not determine this inserted 8GB micro-SD at all, and did not ask to even reformat it! Had to do a complete formatting of the micro-SD card using FAT32 on my PC before it could recognize this external memory card inserted. Still a bit of a problem with this tablet if you should drain the battery of this tablet completely - plugging in the charger and rebooting the tablet will once again fail to recognize the inserted micro-SD. You will have to physically re-insert the m-SD card after the amazingly slow boot for the tablet to recognize it. Kind of a stupid exercise and certainly a unnecessary bug.", "Date": "April 2, 2014"}, {"Title": "Latte 7\" XHD IPS Screen", "Author": "joey eisma", "ReviewID": "R23KOCWICBQM6Q", "Overall": "3.0", "Content": "I recently purchase this item. It was packaged with leather case. The leather case is not perfect fit.The back camera, the speakers, the screen itself is partially covered.  Now those are the minor problem.Because the clearance space between the case and the screen is too small. It's an effort to swipe at the edges of the screen.The camera is really bad, so if you intend to use this for video chatting, this ain't for you. The speaker volume is too low, even at max, it's half the sound from a galaxy tab. also looks like somebody called their 5 year old kid and asked to stick the screen protector on it. it's ugly how they installed it. i had to buy one and install it myself.before i made the purchase, the vendor communicates promptly. after i paid. they don't respond to me anymore.graphics indeed are gorgeous. the metallic body gives it a sense of luxury.will i recommend this item? no. you're better off buying the mainstream brands. you can get the accessories you want.", "Date": "January 29, 2014"}, {"Title": "Maybe I expected too much", "Author": "tsl789yk4", "ReviewID": "R2GDOWDSJVEUYA", "Overall": "3.0", "Content": "These had good reviews. I bought 3 for Christmas presents (12 yr old, 10 yr old, and wife) instead of Kindles because they had cameras and boasted good screen resolution. The resolution is good. Unfortunately the cameras are terrible and all three are prone to glitches. They are usable so I'll give 3 stars but I'll stick with the sure thing next time.", "Date": "January 28, 2014"}, {"Title": "Great Designed Android Tablet finally here.", "Author": "GREAT MOM \"SOFI Y\"", "ReviewID": "R10H8106F2OTQZ", "Overall": "5.0", "Content": "Just received this beautiful tablet. Bought 1 white and 1 black tablets and they just look beautiful. Have been playing with it for 2 hours and so far, no complaints. Will update more within a few days.", "Date": "December 4, 2013"}, {"Title": "Terribly Disappointing", "Author": "WateR~HunteR", "ReviewID": "R3D7RS7UZ3Z68T", "Overall": "1.0", "Content": "I had originally bought the 10.1 Samsung Tab 3. When I saw the specifications of the Latte IMUZ Q9, I exchanged the Samsung one for this one.Honestly, I don't know how this tablet is so bad with such good specs. I feel like I've been lied to, tricked into buying it.First,  to scroll,  you have to do it in a quick back-front manner,  or else it'll send you in the wrong direction. It also doesn't have infinity scrolling. If you don't do purposeful, calculated scrolling, it sends you back to the top or side.When I click something, I have to do it a 2nd time 75% of the time because the screen doesn't respond well even on the most sensitive setting.Also,  it's not holding charge anymore. I disconnected it 30 minutes ago and it already went from 85% to 30%.You have to type very carefully, too,  because the screen isn't very responsible,  especially on the right side of the keyboard.The 5 megapixel camera takes much less impressive pictures than the 3 megapixel camera on the Samsung tablet.Last thing from the top of my head is the display brightness. Even at its brigtest, this tablet is not at all bright.I feel so bad about getting this thing. From the very beginning, not one thing has impressed me and countless things have disappointed me. I wish I'd never switched.", "Date": "December 15, 2013"}, {"Title": "i am just ok with it", "Author": "nikeea79", "ReviewID": "R32H30NWS1HP0C", "Overall": "3.0", "Content": "I'm ok with it I wanted to send it back because the speaker is trash u can barely hear anything thankful to have bought a speaker prepared for this but I'm sure it could have been better even for the price. When I say barely I mean that literally and the video recorder records but playback is in fast speed like fast forward speed playback idk what's up with that and don't know how to fix or change it to make it playback regular speed??? Smh my 8 year old of course wanted to keep it because everything else works fine  I guess and she didn't want to wait the time to send it back wait to get the refund from insurance then wait on the new product AND there's ports on the tablet that didn't come with a plug for them! Should came come with all the cables!!!", "Date": "April 2, 2014"}, {"Title": "Latte ICE tab2 \" real nice", "Author": "Kimberly Boucher", "ReviewID": "R3LDWEFYZ5FZB8", "Overall": "5.0", "Content": "I purchased this for my 22 yr old son, it does everything he needs it to do, email, downloads,docs, photos. social networking. he is musically talented so he has all his downloads and tabs along with it.  and the case I purchased had a keyboard and is leather this little tablet is truly the answer for a take along w/ hdmi and much more  he is very happy with it, and that Makes MOM happyThis also has an expandable memory slot using an SD card.", "Date": "January 16, 2014"}, {"Title": "Latte ICE Tab2 Android 4.2 7\" is an outstanding buy.", "Author": "Richard J. Bunning", "ReviewID": "R3PJ3Z65V7UUNH", "Overall": "5.0", "Content": "The resolution (1280 x 800) is superior to most other tablets out there. Unit is very thin but very well built, using a machined metal back plate. Comes with 2 smudge resistant screen protectors that work extremely well also. Was a slow process getting the little air bubbles out but with some patience and credit card all worked out perfectly. Very impressed with the speed of this unit. I think it is quicker than my Asus Netbook computer. Any and all apps I have loaded from the included Google Play Store have worked flawlessly. All in all I am very impressed with this unit at this price range.", "Date": "December 31, 2013"}, {"Title": "HORRIBLE, INACCURATE SPECS - PLEASE FIX THIS AMAZON!!", "Author": "Paul McDonald", "ReviewID": "R3UBAHTLC2NZI8", "Overall": "1.0", "Content": "A-Series Quad-Core A10-4655M 1.6 GHz? Really? For one thing, this is a LAPTOP CPU, NOT a tablet CPU! For another thing, the 4655M is 2.0 GHz and 2.8 GHz turbo. Cortex A9, like it says at the top of the page? Yeah, probably. AMD A-Series? Absolutely NOT. Please fix your specifications! Thank you.", "Date": "February 7, 2014"}, {"Title": "Do Not Buy Any i-Muz Products", "Author": "Buyer", "ReviewID": "R30N8CNE52QZLM", "Overall": "1.0", "Content": "Never buy any i-Muz products, very unstable, very high defective rate(+10%). Poorly manufactured and assembled. Purchased and tested over 600units and they are garbage, very poor warranty service.", "Date": "January 17, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00FNPEF6W"}}