{"Reviews": [{"Title": "Excellent Android tablet", "Author": "cmolle97", "ReviewID": "RFGPIIF8UVSWC", "Overall": "5.0", "Content": "I was looking for a tablet but I have no experience with Android at all.  I don't like Apple (too expensive) and I like Windows (but too expensive as well).Comparing the specs of this unit (EGQ307) with other Android tablets, this unit is, by far, the best device you can buy.  The price is very good and the quad processors can handle any app you can install.  I use this as my new GPS (I connect it to a wireless hotspot that I already have) and it works great!The touch screen is fast to respond and installing apps is very easy.With zero tablet experience, I was up and running on this tablet in less than 10 minutes.  The design is great and intuitive.If you are looking for a tablet, look no further.  I highly recommend Ematic.", "Date": "December 31, 2013"}, {"Title": "awesome tablet", "Author": "HAL", "ReviewID": "R3RYDG3EJA3X8R", "Overall": "5.0", "Content": "I purchased one of these tablets.  For the price it performs better than I had expected it too!  I have no complaints with it!  It comes with the Google Play Store so apps are easy to load.  I can't say enough about it.  Just simply awesome!  I am definitely recommending it to everyone I know looking for a good tablet!", "Date": "December 17, 2013"}, {"Title": "Great tablet at a great bargain!", "Author": "Jocelyn Boykin", "ReviewID": "R3E6S4P34TEX0L", "Overall": "5.0", "Content": "I'm reviewing from this tablet and I'm impressed, for the price I paid ! I purchased two for my husband and daughter and they were happy. The speed is amazing with the quad core engine, better than my Samsung galaxy tab  and I'm serious!", "Date": "December 31, 2013"}, {"Title": "Great Tablet for the Price", "Author": "Kaleb", "ReviewID": "RL72N7JZL878P", "Overall": "4.0", "Content": "This is a very good tablet for surfing the internet and using apps. It processes quickly, is very responsive, has a bright screen, and good battery life. It doesn't come with a huge amount of storage, but is expandable. I would have given it a 5 star, but the speakers are not the best. They work plenty fine for my needs though, and are as good as most tablets, so I'm happy with them. This tablet is a very good value.", "Date": "May 31, 2014"}, {"Title": "For what it loses in price it makes up with problems.", "Author": "tweentechreviews \"Hippyboy\"", "ReviewID": "R1C68JUL1GU9M4", "Overall": "2.0", "Content": "I, being a 12 year old kid, enjoyed this tablet at first, running Hill Climb, Minecraft PE, and other basic games and apps like Netflix with minimal lag or no lag at all.The battery life was OK, running about half the day.  The problems started one day, when the wi-fi refused to start, and stayed that way until i reset the tablet, 2 months later. Soon after that, i started having to bend the charger cable in certain ways to get it to charge. Then one night, it would not charge at all. I bent it every way i could, then the charger port broke off. Just great, right?I just sent in for a support conversation, because there is no phone line. I don't know how expensive it will be, hopefully less than the tablet itself. Hope to fix it. The Conclusion is that it is a good tablet, until the charger breaks off.Once they get back to me i will update this review.", "Date": "May 23, 2014"}, {"Title": "Tricks to extend battery life (root access)", "Author": "S. Ahola", "ReviewID": "R1OJ9SZ5YCFNX0", "Overall": "4.0", "Content": "The best battery management apps use root access to do their tricks. Apps like SetCPU can slow down the CPU with alternate governors when appropriate while other apps like Greenify can \"hibernate\" programs that like to run in the background. However adding root access to many Android tablets can be very tricky and if done wrong can \"brick\" your device. :-(Googling \"RootFromOTA.zip\" will bring up links for the file which will root the EGQ307 along with instructions on how to do that. (Note: I had to copy the RootFromOTA.zip file to internal memory because the external drive was not recognized during recovery. With no volume keys on the EGQ307 you need to scroll up and down with your finger to highlight your selection and then press the \"Power\" button to confirm your choice. If you hit the \"Back\" button or click on the selection it will reboot the tablet so you need to start over.)Because the process went so smoothly  I suspect that the file is not a user hack but was produced by the mfg (not Ematic but the company that makes the tablets for them.)  Once rooted you need to download a super user app from Google Play or other sources. I installed Superuser from ClockworkMod because I have used their recovery with CyanogenMod. Speaking of which, at this time there are apparently no custom ROMs like CM10 for the EGQ307 and unless there is sufficient demand there never will be. However it has Android 4.2.2 and Google Play so I can live without the tweaks of CyanogenMod. In any case my main goal in rooting a tablet is to extend the battery life and to better manage the CPU and the RAM.One complaint about the tablet- there were sharp edges on the plastic over the display. I used an emery board to take off the sharp edge so it is now as smooth as $400 tablet.As of May 1, 2014 the seller of these tabs (Action Gear) has only 5 left. With both Walmart and BestBuy having discontinued them I suspect that there is only a limited supply of them remaining. At $80 or $90 I think it is an outstanding price for a quad core tablet. However at $100 to $120 you might want to check elsewhere.", "Date": "May 1, 2014"}, {"Title": "Great product, lousing instruction manual", "Author": "bob-45", "ReviewID": "R3ULERH92WB01D", "Overall": "4.0", "Content": "I am not all that familiar with the android operating and it took me LOT of timejust to figure out how to get to the desktop.  Then, I found the videos I hadloaded from my computer had to be accessed from the picture gallery.I HATE learning curves, especially when an extra page in the manual wouldhave made things so much simpler.  Also, while I understand the sound ispretty weak on all tablets, the headphone driver barely makes a dent in abattery powered headphone speaker.  Nonetheless, I am certain mostpeople are not using using a 7\" tablet for the purposes I intended  andthe screen has better resolution and contrast than my 19\" computermonitor.  So, for the price, I definitely recommend this product.", "Date": "April 18, 2014"}, {"Title": "Budget Tablet", "Author": "Amazon Customer", "ReviewID": "R3S7DRE82YLAAM", "Overall": "2.0", "Content": "It's fast enough for me, even though tests have shown that it doesn't reach the advertised 1.5GHz and that the Quad Core has little to no advantage over a lot of the Dual Cores in the price range.My major complaint is the battery life and that the tablet does seem to have any type of power management feature. Even using it as an e-reader a charge doesn't last over 3-4 hours. Even hooking it up to a USB port does very little to slow the depletion.I would advise to buy something else.", "Date": "April 9, 2014"}, {"Title": "kids tablet", "Author": "Adam A. Dailide \"www.studio-render.com\"", "ReviewID": "R1XOTI9PBNWPTT", "Overall": "4.0", "Content": "Got one for each of our 3 kids, one has the glass cracked but otherwise a good tablet for fun time", "Date": "April 9, 2014"}, {"Title": "Excellent for the kids", "Author": "Ulises Boom", "ReviewID": "RVU7CJ5TXGOFT", "Overall": "4.0", "Content": "It's not substitute for an iOS device, but for the kids it makes a very good gift that they will love.", "Date": "February 27, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00FRX2CGU"}}