{"Reviews": [{"Title": "Surprisingly excellent tablet", "Author": "JL", "ReviewID": "R1FD22MXGZ6PRD", "Overall": "5.0", "Content": "I heard a lot of lackluster reviews about the original Surface tablet but I heard that Microsoft fixed a lot of issues in the Surface 2 so I checked it out. I liked what I saw in the store demo so I bought it. After using it for 2 days solid, I can say that this is an excellent tablet and entirely underrated. I give it 4 1/2 stars overall.The good:1) Excellent look and feel. The frame is made of a beautiful alloy and it feels both strong and light. Unlike all the other tablets I've seen, this one is widescreen. This is great for media viewing, and provides a substantial and useful difference in viewing between portrait and landscape mode. The screen is full 1080p and everything looks super clear. Comparing it with the ipad, the ipad is sharper but not quite as clear. It kind of feels like with the ipad you are looking through thicker glass so it seems \"cloudier\" than the Surface 2, even though the iPad has higher resolution.2) Microsoft Office comes bundled FOR FREE. This is awesome. No other tablet has anything comparable. Fully functional versions of Excel, Word, Outlook, Powerpoint, and Onenote.3) A micro SD slot for expansion of primary storage. Up to 64gb additional storage. Ipads don't have this, and with androids some do and some don't. Very useful and welcome.4) A mini HD port, so you can output the display directly to a tv or monitor. You might need a mini HD to HDMI adapter, depending what you have on your bigger screen. This is awesome because you can play movies, show photos, etc directly to your tv from the tablet. Apple has airplay, which only works over wireless IF you have a $100 apple tv box, but the direct cable is better in my opinion because you never have network lag or loading issues, which I sometimes get on my apple tv. I think this also can do wireless streaming to a tv via an xbox but I don't have an xbox.This is also great because you can attach a type cover or keyboard and mouse, and connect this to a monitor, and use it like a full pc dual monitor system.5) Bluetooth support for keyboards and mice and other devices.6) The Surface has a built-in kickstand with 2 angles that makes viewing and using very convenient, especially when used with the touch or type covers or a usb keyboard.7) A fully functional USB 3.0 port. This is another HUGE advantage. If you need more storage you can connect a full hard drive and have all the storage you want (I connected a 1.5 Terabayte media drive to mine and transferred files using windows explorer). Also this makes it easy to transfer files to and from the device. I was always emailing or texting stuff to myself on my ipad because the ipad doesn't have a better way to do this.8) You can have 2 apps open on the screen at the same time, split with a vertical bar between them. You can change the size of the split to anywhere you want by dragging the divider left and right for 50/50, 80/20, 29/71, whatever breakdown you want.9) There are front and rear cameras. I think the front is 3.5 megapixels and the rear is 5.0. You can record video as well.10) Live tiles. This means that tiles are large enough to show useful information without opening the app. The weather app shows the current weather, the email app shows the latest email subject, the NFL app shows recent scores. These update in the background automatically.11) Gestures. Open by tapping, close by swiping down, go back to the main page by swiping in from the right, switch between open apps by swiping in from the left, and open split screen by swiping down and then to either side. I find them second nature after a couple hours.12) Battery life is fine. Over two days I used it about 10 hours before charging it at 12%, including about 4 hours of video streamed to the device. The charger is a cool magnetic clip.13) Handwriting recognition. This works with a stylus or your finger, and reads both block and cursive. I love this because I like to write out my onenote notes. Some people may not care about this but this is one of the Galaxy Note's key points and the Surface 2 can also do it.14) There is a desktop app that looks like the windows 7 desktop with a few basic things like control panel, windows explorer, ms office, etc.15) The type and touch covers are awesome, they are like 3mm thick and provide both a protective cover and a full keyboard and mousepad. The connector is a cool magnetic thing that can be pulled right off.Now for the not so good:1) This is not a full version of windows 8, so you can't install standard windows software on it. To do that, you need a Surface Pro. A lot of reviewers in the media made a big deal out of this, but it's not like you can install Photoshop on an ipad, or any other mac os software on the ipad. Android doesn't even have a desktop OS that I know of. So this to me isn't a big deal but be warned that you need to have Surface Pro to install standard windows software, and the pro costs about twice as much.2) The app selection is fairly limited. It's much better than it was 6 months ago when I first looked at the older surface but it still is noticeably behind Android and IOS. The difference is enough that it may be a dealbreaker for some people. I found most of the major apps I cared about but I don't use a whole lot of apps in general. Check out the app store online to see if you will be missing anything you use a lot, because that is super important. This alone may outweigh everything else if your favorite apps are missing.3) The type covers ($120), micro SD cards (up to $50 for 64gb), hdmi adapter ($10), stylus, and other add-ons are not free.4) If you hold the surface in portrait mode, it is possible to have your thumb bump the start button, which returns you to the tiles screen. After this happened twice, I got around the issue by rotating it 180degrees so the button was on the opposite side of my hand.5) The version with LTE connectivity (i.e. cell phone data) is slated to be available in Spring 2014. This doesn't bother me because that's not how I use this, but if you need a data connection everywhere, you might want to wait for the LTE version.EDIT:6) The operating system takes up more space than I originally realized, so you don't get the full 32 GB of built in storage. It's more like 20 GB. I looked up the iPad and IOS uses about 2.5 GB of space. I take off half a star, but a) you still get more than 16 on the base model and B) the micro SD slot mitigates this somewhat. Still, it feels a little deceptive since the OS is big.Check if the apps you want are available or coming soon, and if you need cell data wait for the LTE version, but in every other way this is an excellent tablet with a lot of advantages.", "Date": "October 26, 2013"}, {"Title": "Why I love my Surface 2", "Author": "Sean Ong \"Sean\"", "ReviewID": "R1DGB4QQUN03Z", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1W7KA46Z4IDH5embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1W7KA46Z4IDH5refresh_preplay() {\n\ndocument.getElementById(\"cv_mo1W7KA46Z4IDH5chiDiv\").innerHTML = document.getElementById(\"cv_mo1W7KA46Z4IDH5hiddenPre\").innerHTML;\n};\ncv_mo1W7KA46Z4IDH5refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1W7KA46Z4IDH5so;\t   \n\n\nfunction cv_mo1W7KA46Z4IDH5loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1W7KA46Z4IDH5so = new SWFObject(swfLocation, \"cv_mo1W7KA46Z4IDH5AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1W7KA46Z4IDH5so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1W7KA46Z4IDH5so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1W7KA46Z4IDH5so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1W7KA46Z4IDH5so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1W7KA46Z4IDH5so.setAttribute(\"height\", swfHeight);\n          cv_mo1W7KA46Z4IDH5so.setAttribute(\"width\", swfWidth);\n          cv_mo1W7KA46Z4IDH5so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1W7KA46Z4IDH5so.write(\"cv_mo1W7KA46Z4IDH5flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1W7KA46Z4IDH5', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1W7KA46Z4IDH5';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1W7KA46Z4IDH5', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1W7KA46Z4IDH5loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1W7KA46Z4IDH5\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"181-9697923-4189727\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3KRX2AE9UQ52J\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3KRX2AE9UQ52J\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1DGB4QQUN03Z\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3KRX2AE9UQ52J/181-9697923-4189727\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/181-9697923-4189727\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1W7KA46Z4IDH5duration')) {\n      document.getElementById('cv_mo1W7KA46Z4IDH5duration').style.display='none';\n    }\n    cv_mo1W7KA46Z4IDH5loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1W7KA46Z4IDH5loadSwf(movieID, playerVersion) {\n   return _cv_mo1W7KA46Z4IDH5loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1W7KA46Z4IDH5newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1W7KA46Z4IDH5', 0, h);\n}\n\nfunction cv_mo1W7KA46Z4IDH5resetPlayer(w,h,bw,cc) {\n  cv_mo1W7KA46Z4IDH5newHeight(h);\n\n  cv_mo1W7KA46Z4IDH5so.addVariable(\"resetBandwidth\", bw);\n  cv_mo1W7KA46Z4IDH5so.addVariable(\"cacheCode\", cc);\n  cv_mo1W7KA46Z4IDH5so.setAttribute(\"height\", h);\n  cv_mo1W7KA46Z4IDH5so.setAttribute(\"width\", w);\n  cv_mo1W7KA46Z4IDH5so.write(\"cv_mo1W7KA46Z4IDH5flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1W7KA46Z4IDH5RollOverImg = new Image();\ncv_mo1W7KA46Z4IDH5RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81HLEkshpfS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1W7KA46Z4IDH5preplay = document.getElementById('cv_mo1W7KA46Z4IDH5preplayImageId');\nif (cv_mo1W7KA46Z4IDH5preplay) {\n  cv_mo1W7KA46Z4IDH5preplay.onmouseover = function() {\n    cv_mo1W7KA46Z4IDH5preplay.src = \"http://ecx.images-amazon.com/images/I/81HLEkshpfS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1W7KA46Z4IDH5preplay.onmouseout = function() {\n    cv_mo1W7KA46Z4IDH5preplay.src = \"http://ecx.images-amazon.com/images/I/81HLEkshpfS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1W7KA46Z4IDH5preplay.parentNode;\n\n  var cv_mo1W7KA46Z4IDH5currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_mo1W7KA46Z4IDH5/181-9697923-4189727?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1W7KA46Z4IDH5currentClick) {\n      return cv_mo1W7KA46Z4IDH5currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:53 MinsIn this video, I show off some of my favorite features of the Surface 2! Enjoy.Note: my voice is a little high pitched because I needed to compress the video to get it to fit in Amazon's 10 minute limit!", "Date": "November 3, 2013"}, {"Title": "A formidable tablet and a major improvement", "Author": "Thomas B. Talbot", "ReviewID": "RBO71HJNXDCMA", "Overall": "5.0", "Content": "I've just upgraded from the Surface RT to the Surface 2 and it was well worth it for me.  Previously I upgraded to the Surface from an iPad2.  So here is what I've found:The Surface 2 has been an excellent performer.  Besides common tablet tasks like Skype, web browsing, email, kindle books, ebay and a few other things, I've got a complete Microsoft office system that lets me do serious work - not just viewing files but actually creating content and editing documents.  The thing runs all day on battery and I'm finding that I can get away from using a computer on trips and go for a full week with my surface 2 without carrying my laptop.General:  Great battery life, its snappy and has a nice screen.  I use the original type cover from my old surface which works great and use a Bluetooth mouse when doing a lot of production work.  The touch gestures are awesome as is the multitasking where I can have a couple tablet apps up at the same time.  A negative thing is that some apps are lacking, but this is compensated by the fact that you can do the full website version of just about everything.Improvements over iPad:  My iPad was a good consumption device for web and apps, but it was really bad at several things like writing anything, office type apps, email (doesn't hook up to exchange), getting files on or off it without going through iTunes, playing non-apple video files, expanding storage, connecting with USB peripherals, etc.  The surface 2 is quick, it lets me do office, I can sync all my documents with skydrive and selectively choose what stays on the machine, I can play all kinds of videos (but not some MKVs - awaiting VLC player), etc.  I can copy files on it at will, print to printers, connect thumb drives and other peripherals, etc.  It lets me do things so I can get things done.  I also like that the included email program (much improved) hooks up with business exchange accounts.  I don't really use the outlook app, now included, though. The SD slot is really nice and I keep a 32GB card full of videos and music for flights.  Although I was worried about not being able to install legacy X86 windows programs, I feel so much freer than I did with iPad because the iPad felt like a prison to me.  I do prefer the iPad 4:3 screen to the more awkward 16:9 on surface.  (I don't hate iPads and my wife/kids love theirs).Improvements over Surface RT:  Higher screen resolution and much faster speed.  The old surface actually wasn't too bad at running office and tablet apps, but the web browser was sometimes much too slow on complicated pages.  I like that the surface 2 is much snappier and the Windows 8.1 improvements are significant as well, especially the improved skydrive (it is enough better to finally get me to switch from dropbox - by the way the RT dropbox for surface RT and surface 2 is pretty bad - the web browser version is even better because you can drag and drop with it).Overall, if you want a tablet that can do productive things and isn't locked down as far as files/expandability, I think it is worth trying out for a few days.  I'm very happy with mine.", "Date": "October 29, 2013"}, {"Title": "Surface 2 is truly something else", "Author": "Jung Park", "ReviewID": "RGR5PCNI1STPP", "Overall": "5.0", "Content": "I was struggling between Surface 2 and Surface Pro 2 and finally pulled the trigger on Surface 2. My initial reason for choosing the Surface 2 was price. I knew I wanted a Windows device but paying north of $1,200 for Surface 2 Pro with 128GB and keyboard was too risky. What if didn't like it? What if it ended up collecting dust?For my needs, Surface 2 is perfect. This device comes preinstalled with a \"touch enabled\" Microsoft Office which includes Outlook. Basically, all I was looking for was a tablet to check my email, do some word processing, edit spreadsheets, browse the web, and pay bills online.I've been using Kingsoft Office on my Nexus 7 and Galaxy Note 8.0 but the experience is nothing to write home about. With the Surface 2, I can now get some serious work done.Referring back to the title of this review, the reasons why Surface 2 is \"truly something else\" are as follows:1. The 10.6 inch screen is gorgeous. Also, one finger typing, with the onscreen keyboard in portrait mode, is rather good. This is a good thing because browsing the web just works better in portrait mode.2. Battery life is amazing. The Surface 2 out lasts my Nexus 7 (2012) with room to spare. I guess the whole point of putting Windows on an ARM device was power consumption. Intel is closing the gap but Surface Pro 2 is not going to give you 10 hours.3. Everyone knows Surface 2 comes with Windows RT. If you absolutely need to run x86 apps or have extra cash, you should buy the Pro. I just wanted to mention the positive for running Windows RT. You don't need to install antivirus software. The way I understand it, Windows RT works like iOS.4. Surface 2 is not a tablet. That is to say Surface 2 is not a toy. Maybe I'm too harsh in calling tablets mere toys. But the Surface 2 just feels different from all my android devices, my desktop and laptop computers. Let's just say I have the Surface 2 right by my side while working on my HP desktop or Dell laptop.Choosing a tablet is very much a personal taste. My wife would never buy a Surface 2 unless it has angry bird or candy crunch. I just had to write this review about the best thing since slice bread (at least for me).", "Date": "October 29, 2013"}, {"Title": "Finally a tablet for entertainment and work.", "Author": "Bubba", "ReviewID": "R1WKBOYAJUMZ2M", "Overall": "4.0", "Content": "I won't get into the technical stuff here. I will just point out some things that a normal person can relate to when comparing a tablet. If your a tech. buff, then read the other reviews.I wanted something portable so my wife can produce Word documents and Excel spread sheets and for my kids to create Power Point presentations for school. I wanted to get the Pro 2, but it was more than I wanted to spend and the Surface 2 had all the Office software that we needed and I had a Netbook that has the full Windows 7 installed that is still portable enough that one can still take with them if they needed a full computer. I figure for the price difference between the Surface 2 and Pro 2, I can use that towards another newer portable Netbook. Still got to have a full featured computer. A two for one if you will. In case you didn't know. You cannot install software on the Surface 2. The Pro 2 you can if you want  a computer replacement.  Although the Surface 2 should have the software that most average people would need. But a good old fashioned computer is still better than any tablet for major work because they are still more powerful and a lot of ports for different plug ins. Get a fully loaded 11 inch laptop if you want portability. So know what you are looking for.Don't believe all the reviews out there saying the ipad Air is the better tablet. Those reviews are biased and only bring up the minor upgrades from the old ipad and base the comparisons off of those few things. And the only two really bad things they had to say about the ipad Air was that it didn't have a fingerprint scanner and it didn't come in gold. The 80's called and they want their gaudy flashy gold bling back.Most of these reviews will only focus on those points and will not mention all the other advantages the Surface 2 has. And for the few reviews that do mention the other features the Surface 2 has, they still favor the ipad because the camera was nicer or more apps. Really?I am using the ipad Air as comparison as it seems to be the standard.What the reviews usually leave out or down play.Surface 21.  Full office software. Word, Excel, PowerPoint, OneNote.2.  Wide screen optimized for wide screen movies. When held in portrait when you are surfing the web for example, you get a  a longer list so you don't scroll as much.3.  Micro Sd slot. Easy to download or upload data on the fly.4.  3.0 USB so you can easily backup files to a hard drive and not have all your eggs in one basket. Or transfer files with anything that has a USB plug and also charge your phone. Ipad? No, unless you have the adapter and you can't charge your phone.5.  Can print to almost every printer.6.  Hdmi port7.  Flash support so you are not limited browsing the web.8.  Built in two position kickstand.9.  Thin keyboards that double as covers. Can get them background lit, flat, with real keys, and a new one coming out with  built in battery to recharge your Surface at the same time on a charge. Battery in tablet is good already though. Some say that you need to buy a keyboard to make full use of the Surface and adds to the cost. Ridiculous.  You do not. It will make life more easier though if you are working on a spreadsheet or word document. With an ipad you don't need one because what use would it be for? Sure there are apps. but they are limited to what you can create or edit. You have to do major creating and editing on a computer first and then hook up the ipad and transfer it.10. Hook up to your t.v. or another monitor and drag an open window to the second screen.11. Do a split screen on the tablet.12. Run multiple tasks at the same time in the background like listening to music, watching a video and doing something  else like typing an email or working on an a office document in split screen mode.13. Wirelessly sync with your xbox and play games on your t.v, stream videos, pictures, etc.14. Drag and drop files.15. Can set up individual separate users  on the tablet and have parental monitoring updates and deciding what child can do on the tablet. Unlike the iPad I can be in the middle of something and then let others use the Surface with their own logins and not interrupt my session when I come back to it later. Everyone can be working on their own word document for example and don't have to have the other person log out of an app so someone else can use it. And each person has their own private log in to protect their work.Now these are not all the Surface 2 offers. I am finding new things still.The ipad Air is basically the same ipad as before with minor tweaks. It's faster and lighter. Still does the same thing as before, nothing new.ipad Air1. Powerful processor. For doing nothing new. Future fingerprint scanner? Tablet will still only run apps. as before.2. Lighter and thinner is negated by the cases to protect the ipad and without a keyboard.3. Upgraded camera. Put it down, your annoying the people behind your trying to see the wedding or play. Use a real camera.4. No USB or sd slot. Need adapters for just about everything. And with the Surface 2 you can plug the unit in when it is dead and keep on using it and still do things via the sd card or usb cables. On an ipad you can't do both. You either charge it or plug in an adapter to the only port the ipad has do to something. And if it is dead, you have to wait until you charge it first. Also you need to bring all the adapters and keyboard with you vs the Surface 2 of which all you need is the power cable. And the cover/keyboard is so thin it is negligible in bulk and weight. And justifying that the ipad has third party keyboards is not valid. It is a separate bulky keyboard and the ipad does not support mouse functions. You are stuck with third party hardware that is Apple specific whereas with the Surface you can use anything that supports micro SD or USB. And having to buy all these accessories tofor the ipad.will not be cheap. People gripe about the Suface cover/keyboard costs too much. Well to buy a seperate cover for an ipad will cost $40.00 and it will flop around and  a non intergrated keypad  will cost $100.00 that you have to carry seperatley.5. Having to convert simple files with Apple software a hassle.5. Tons of apps. Android not far behind. And Microsoft growing. How much apps. does one need?6. What good is the Reina display if it isn't widescreen? Picture is actually smaller than 9.7 with the black bars.7. Only compatible with Apple products i.e. cant print unless it is an AirPrint printer or stream to t.v. unless Apple t.v.8. Slightly upgraded camera. Put it away! Your blocking my view! And people with a 4.8 inch phone look ridiculous? At least they are not carrying around the perfect sized iphone for one handed operation along with a 9.6 tablet that takes two hands. Kind of contradicting.The ipad Air has more negatives than positives, so how can it be better? Android tablets have more features even than the ipads. I guess if you want one just for games and apps, then an ipad or a higher end Android tablet might suit your needs. People are not weighing in that the Surface 2 can do more than just play games.Now back to the Surface 2. There was a slight learning curve to understand what all the gestures do. It didn't take long though. Look it up on youtube and you will pick it up real quick along with a lot of tips and tricks of what it is capable of. There different ways to open, close, move, split screen, multitask, etc.The tablet feels a little heavy in the hand if you had to hold it I admit. But the two position kickstand works pretty good on the lap as I didn't think it would. I don't have to have a cover to add to the bulk to double as a kickstand also. And even if I put on one of the super thin keyboards they would add very little weight or bulk and they snap on and off without any hassle. Also keep in mind which keyboard would work better for you. The keyboard without the real keys requires a little harder tap on them than with the one with real keys. So if you do a lot of typing or use it on your lap, you may want the one with real keys.The boot up time takes a little while when completely off, but remember it is opening real office programs. When in sleep mode it opens up quickly.I went several days at a time of casual use and in sleep mode without charging and it still had a charge.The tiles are nice because it is real time data so I can glance at them without opening up an app. for email, weather, etc. On Apple you have a bunch of icons and you have open it up, Android you can use widgets.With a real browser and Flash I can use full websites rather than a mobile version. And also it is a lot easier to open multiple tabs when surfing the internet unlike some tablets where it is a pain to pop back and forth between tabs.As I mentioned above it is nice to have the split screen because my kids can research on the web on one side and write their paper on the other side while listening to music of which they shouldn't be.Three cons I find on the Surface 2 so far is that the power cord is only about 58 inches long. You have to be really close to an outlet of some sort. The second con was that the software and backup takes up about 16 gigs so you don't have the full gigs of memory stated. So might have to get an sd card. Yes other tablets you only lose about 2 gigs, but remember they are pretty much entertainment tablets only and can't do what the Surface 2 can do. And the third con was it gets hung up once in a while surfing the web. The last two cons are why I deducted a star.If you are waiting for a ipad Air Pro to come out. Don't be surprised if it doesn't come with a Retina display, finger print scanner, nice camera, etc. You will have to wait for the Pro S, Pro S1, etc. to get one feature at a time and not several at once. I mean come on, cant even throw in a simple  camera flash. The ipads shouldn't even be placed in the categories of tablets that can run Office software. There should be a category for Dumb Tablets that only run apps, a category for Smart Tablets for those that can run fully functioning office software and not just limited mobile versions, and Extreme Tablets for ones that can run full blown Office suites.", "Date": "October 31, 2013"}, {"Title": "Great tablet all around!", "Author": "BlackManKAS", "ReviewID": "R1RTI6XOISEOF5", "Overall": "4.0", "Content": "After having owned all versions of the iPad (except, obviously the iPad Air which is about to come out, and the original Surface, I have to say that the Surface 2 is probably the best tablet I've owned.First off, I had the iPad 3, and then the Surface RT came out. I bought the RT and wanted to love it so much, but it had a few too many things against it. Windows RT was new and fresh at that point, so the app selection was still pretty bare and some of the core apps didn't have the refinements they needed to be as functionally useful as they needed to be (Xbox Music, for instance). I loved the feel and look of the device and it was quite durable, but one big issue that I found was that the speakers were simply too quiet. They had been subsequently enhanced through updates, but I'm speaking from owning the device for the first 2-3 months of it's life. And the biggest problem of them all was that it was simply too slow. The Tegra 3 made running some of the Windows RT apps simply not enjoyable and it took a bit too long to do simple things like opening up the apps, navigating through them, and even composing word documents and such on the desktop side of things.Well, a year later and the Surface 2 addresses all of this.It comes with a 2-stage kickstand that definitely helps with it's stability in resting in your lap, or visibility when looking at the device form different viewing angles. The device now has a Tegra 4, which Windows RT just flies on. I've seen some intensive apps such as Six Guns (a game) have a little sluggishness to them, but for the most part, any app that you run will run and run well. It nows runs Windows 8.1 RT which has a number of enhancements over the previous version that make it much more feature complete and usable. The device itself, is lighter and slimmer and although I thought I wouldn't particularly care for the change from the black finish to the silver finish on the back of the device, it looks good (especially with the cyan type cover).The screen is better on the device and is now the same as the Surface Pro (2), which makes reading and watching media as crisp and clear as ever. It really is fantastic quality.The new touch and type covers have been improved in many ways over their original incarnations, with the most noticeable of them being that both the new keyboards are now backlit. It's a great addition, although if you have either of the original covers, they will work just fine with the device. Personally, I went with a Type Cover 2 as it has the tactile feedback from the keys that I need to really be effective at typing. The touch cover didn't really give me that, but they have increased the number of sensors on the touch cover, so I'd advice going to a Microsoft Store or getting your hands on one through other means to try them both and see what suits you best.The few issues that I have with the device revolve around the fact that I still believe that the speakers could have a bit more volume and a bit more bass, but they do seem to be a tad louder than what I remember the Surface RT (or Surface 1, as they now call it) to be. The app selection has gotten a whole lot better, but there are still a few that I'd like to have that aren't available, and I wish there were more big name game developers that would port their apps over to the Windows Store (I'm specifically thinking about developers such as Telltale, who made the Walking Dead Game).When it comes down to it, why do I believe that its better than an iPad? Well, Internet Explorer is great and it is flash compatible, which helps on some websites that I need to be able to access and use (for instance, when using Wolfram applications on the web to do my homework). It is compact and the keyboard covers are great at being able to get light work done whether in Word, Powerpoint, or Excel. But by far, the ability to \"snap\" two apps to your screen (have two apps running at once, while being able to adjust how much of the screen they take up if one is more necessary than another) is the greatest advantage of them all. While you can have apps running in the background on your iPad, which is fine, the ability to use two apps at once, to have two webpages going at once, to be growing the web on one side of things, but on the other side have another app running, such as a video player, the music app, or anything else you want, is simply efficient and immensely useful in getting stuff done.The iPad to me is a great consumption device, but an okay productivity device. I will give it that app makers have built around it's deficiencies to make it a lot more productive than it inherently is by just having a screen. With a Surface 2 and either one of the keyboards, which simply cannot exist without one another (figuratively speaking), though, it cannot be understated that the widescreen display, though it can be an adjustment to make if you've had an iPad, makes it great for viewing media, and the keyboard/ability to use two apps at once on the screen make productivity much more inherent to the device.If you're able to see the device for what it is, which is a great tablet with the potential for great productivity, and believe in the ability for the Windows Store's app selection to grow, though it's pretty decent now, then this is definitely the device for you. If you need to be on the cutting edge of getting all the latest and greatest apps out right now, then although I'd like to say you should still get a Surface, the iPad simply can't be beat in terms of developer support right now.", "Date": "October 28, 2013"}, {"Title": "Completely surprised by How COOL this is", "Author": "A. Goodsell \"educated consumer\"", "ReviewID": "R3K9K41TZOOHFZ", "Overall": "5.0", "Content": "OK.I purchased a surface 1. When it first came out. I tried to like it. I returned it and bought a nexus 7. Glad I did too, because I love my nexus.At work I use powerpoint. ALOT. Re-thought this Surface thing. I just bought the Surface 2 again and WHOA, it is a pleasure to use.PLAY- the surface2 is hands down WAAYYY better than the Surface1. The screen is gorgeoous. The OS is soooo cool. Multitasking and snapping windows is just amazing. This is not a phone OS. Netflix and videos play soo smoothly and look great. This is a media monster.Skype and all that jazz bundled, although my favorite means of videochat- Google Hangouts- is not supported. meh. I suppose more people Skype, anyway.WORK- Office on a 10\" screen is surprisingly easy to use-- no, easier to use-- than mousing around. Especially when resizing pictures in PPT. I actually had fun using powerpoint! Skydrive integration is icing on the cake.Google apps are not native, but the screen is so nice and responsive, opening your Gmail or drive in the browser is no problem at all. Its what you do on your PC athome right? Right.I'm super impressed so far and will be dropping jaws at work tomorrow with this thing. I'll update as the next few days go by.", "Date": "November 5, 2013"}, {"Title": "Great Product but Amazon's Price is Crazy Expensive", "Author": "Columba", "ReviewID": "R3EUK2NYZJ93F", "Overall": "5.0", "Content": "First off, what is Amazon thinking? This is $300 more than Best Buy or Windows Store. Just crazy. Is it to keep Kindle sales up? Weird. Don't buy through Amazon unless price point drops well below $600.Now for product review. Excellent, well made device that shows marked improvement in speed and video/audio quality versus 1st generation Surface. The stereo sound is excellent. Keyboard is a must (integrates with nearly any keyboard but Surface Keyboard is amazing). I love that it already has drivers for wireless printing and every other device I own. Usb 3 is lightning fast and hdmi works wonders with tv and projectors. Also a piece of cake to plug into monitor. I can't help but think that if this had an Apple logo it would be hailed as one of the best innovative machines. I also looked seriously at purchasing the pro 2, but found this device really has all I need. Microsoft office is perfect on device. Being able to video a presentation in one pane while typing notes in another is slick and has no lag. Multiple panes for working with Powerpoint or Word and excel is also a huge plus. This thing is also an incredibly durable device. It has survived multiple drops without a scratch.", "Date": "December 16, 2013"}, {"Title": "Do your homework", "Author": "Amazon Customer", "ReviewID": "R21HHS0G8L2M0U", "Overall": "3.0", "Content": "If having Microsoft Office included with the Surface 2 is one of the factors you are considering in deciding to buy a Surface 2 then do your homework. This is not a full version of Microsoft Office. The version of Excel (RT) that come with the Surface tablet does not support macros. This truncated version of Microsoft Office is missing a lot of key features from the regular office suite.Also if you go to a store and ask customer service people you will find that most of them believe there is no difference between the regular office suite and Office RT that comes with the Surface 2 tablet.Also note that none of this is mentioned in any of Microsoft's advertising for this product. You can learn more about this on the internet. However it is much like the legalese fine print on some products.I like the Surface 2 and do recommend it to people who are not intermediate or advance Microsoft Office product users.", "Date": "November 3, 2013"}, {"Title": "**Update** A Step Up From Previous Generation, But Jury Still Out on RT", "Author": "The Pes \"Deerhoads\"", "ReviewID": "R1UNFUWQDV1ZF", "Overall": "4.0", "Content": "With the introduction of Microsoft's Surface 2, Microsoft set out to reinvigorate their own attempt at the premium hardware space in the tablet market.  The first Surface RT was a disaster, at least initially.  From hearsay, the latest updates and the introduction of Windows 8.1 have really addressed some of the lag issues and shortcomings of the user experience.Be that as it may, Microsoft would like you to try Windows RT and like it.  With the exodus of other hardware OEMs scrapping and abandoning their own Windows RT tablets, it left Microsoft as the sole provider of an RT experience.  With their new Surface 2 tablet, they're trying to make RT sexy...if that's even possible.I felt that Windows RT was a compromise, and that it shouldn't exist.  It makes some concessions in an effort to extend battery life, and it does so by using ARM as it's processor muscle.  That means no legacy x86 apps like the full Adobe Creative Suite (Photoshop, Dreamweaver, etc)and all the other professional grade programs that you come to expect on a Windows machine.  As a graphic designer and amateur photographer, having a limited tablet with no support for Photoshop was a deal breaker.Having said that, I have to say that I \"get\" what Windows RT, and to that extent, Surface 2 is about.  Let's face it, the problem with Windows RT isn't an operating system problem, but rather a marketing one.  Simply put, Microsoft is just terrible at explaining things.  It doesn't know how to describe the key benefits of an RT tablet to a particular consumer.Now, to be honest, Windows RT is not going to fill everyone's needs.  In fact, I feel this product is better suited to students as a replacement for aging laptops, and for professionals (like me) that need a companion device to service their mundane tasks like web searches, portfolio displays and light Office tasks like word documents and Powerpoint presentations.The way I've worked the Surface 2 into my work flow is by using it as a portable device that allows me to check images on the field to make sure I captured everything perfectly.  Surface 2 allows me to hook up my DSLR and see my RAW files through Skydrive on that beautiful 1080p screen.  As a display for my portfolio, I can let potential clients check out previous work in the form of a slideshow (again through Skydrive) and have a compact and light device that allows me to check the internet when I need some assistance finding a particular location.  For simple tasks of that nature, Surface 2 really addresses those needs.It's not just that since I would also be hesitant to bring along my full work laptop around.  The size and form factor of my laptop just doesn't help when I'm on the field as it's too cumbersome to carry around.  Plus it helps that I'm not carrying around the source of my livelihood around with the potential of theft or damage.  The Surface 2 can be stolen (knock on wood) and I wouldn't be left out in the cold and without a way to get critical work done.That brings me to the hardware itself.  This tablet is discreet enough and slim enough that I can lug it into my backpack without a noticeable bulge.  The fit and finish is incredible, and it feels great in the hands.  The silver tone VaporMG is a step up from the black casing the first gen Surface has, and the screen is brilliant and displays pictures with such vibrancy that it adds a new layer of pop that my laptop lacks.  I can't stress enough how good the screen is on this thing.  The two-stage kickstand is functional and I can't see myself not having it on my tablets ever again.  It's a joy to not have to fiddle with a tablet because the angle of the kickstand just sits well when laying down in bed, in a chair or at the table.  Microsoft really nailed this one.The other accessories like the Touch Cover, which I have a first gen one, really extend the functionality of the Surface 2.  The audible \"snap\" of the magnet-adorned keyboard when it latches on to the Surface is satisfying.  When using the Surface 2 for Office purposes, the keyboard and tablet combination is almost perfect.  While the Touch Cover is serviceable, it does take some getting used to.  I'm using it to write this review and I can type at a good clip.  There are times when I lose my way since there is very little tactile response from the keyboard due to its flatness.  However, once I'm locked onto the proper F-J position to type, I can fly without a problem.  The way to go if you're going to use Surface 2 primarily for typing is the Type Cover 2.  With backlit and full functional keys the Type Cover 2 is much more comfortable to type on, but if you're seldom going to type essays the Touch Cover will do.  Spring for the Cyan version if you can, the Silver-Cyan combo is eye catching.There are some negatives of course, and some things that cancel themselves out.  The most obvious complaint when it comes to Windows RT is, of course, the lack of app support.  Yes, people will want Instagram and whatever else the \"it\" app of the moment is on tablets, the stuff you can find os iOS or the Android marketplace.  However, for most stuff, if you can't find the official app, most likely you wont miss much since Surface 2 has a great running Internet Explorer app with full Flash support.  This makes the whole \"no support\" of such apps moot, since you can still get to use the app through its website equivalent.  Don't get me wrong, some apps just don't have a website equivalent, and thus you won't get to play with it.  Period.  But for the most part, the major things you want can be access through IE.  On the flip side, you do have some things that other platforms don't have, such as Halo: Spartan Assault, the aforementioned Office suite, and some killer tools like great integration of Xbox 360 and Skydrive services. Still, Microsoft has to do better at supporting its tablet with rich game content, which should be a no brainer, but at least things are improving as we speak.The last bit I want to talk about before finishing off is this: is this tablet for you?  In some cases yes, and in some no.  If you need to get work done and are just fine with web searches and using websites instead of apps for music streaming, photo viewing and commenting on social networks, then Surface 2 is more than enough.  I've found a way to work it into my work flow and it does work well even after I was highly skeptical of the Windows RT platform.  Can it stand to use some minor improvements, sure, but that's with any tablet out there.The real test is not the tablet itself, as hardware, it's rock solid and impressive.  Rather, the investment is solely dependent on the success of Windows RT.  If Surface 2, and to a greater extent Nokia's 2520 model, succeed then yes, Windows RT has a future and Microsoft will support it until it becomes a viable ecosystem on its own.  But, if Surface 2 follows the same path as its first gen big brother, then investing on Surface 2 as a platform wouldn't be wise.  I can't tell how well it will do, although Microsoft is betting big bucks into it by infusing $406 million dollars of marketing muscle behind it.  I suspect it will do alright, squeak in enough interest for consumers to keep it alive for at least one more life cycle into 2015.  The app situation should improve dramatically in the next couple of months as adoption ramps up, and with a few improvements to Windows 8.1, RT could be a really good operating system.What it comes down to is your own work flow and how a tablet like this might fit in it.  For me, I understand its limitations, but also appreciate what it does in other spaces in my daily usage.  I think as a tablet it rocks and makes life easier and enjoyable when dealing with the internet of things.  If you give it a try, I think you would too.**Update**  A Month With The Surface**So I've had the privilege of using the Surface for a solid month after purchase. With plenty of reviews by tech journalists and different individual consumers I have to say that most of the tech journalist are full of bunk.  Lets be fair here, most of those reporters have a carousel of devices coming in and out of their mitts on a given basis.  To really give a product its fair shake, one must live and breathe with the product for a solid month at least.  To see its idiosyncrasies, be it detrimental or encouraging, you really have to put a product through the daily paces of one's life.  After a solid month, I have to say that Surface 2 is a great product.First, the device works wonderfully as a laptop replacement for those mundane tasks like web surfing and Office work.  It's incredible how much I've reduced my usage of my work laptop.  I've barely touched the thing due to the fact that the Surface is incredible for its portability and battery life.  Sure, PhotoShop is still something I need for my work life, but the fact that I can stream all my media (Netflix, Hulu, YouTube) through IE11 (never mind the apps available for such services) through this machine has almost made my Samsung laptop obsolete.  If the full Adobe Creative Suit came to the Surface 2 (I'm dreaming, but you can always dream, right) I'm sure I'd forgo the laptop all together.The app marketplace has improved somewhat with the inclusion of Flipboard, which looks amazing, and other apps, but in reality it's still the same as it was a month ago.  I don't see much movement in that area.  It could be a deal breaker for some interested in apps like Pinterest and Instagram, but, again, IE11 can take care of most circumstances that arise when an app is missing.  Gaming is much the same, which is that it's still missing some killer apps.  Halo: Spartan Assault is really good graphically and the new Asphalt 8: Airborne is bananas, but other than that it's pretty bare bones.  This is something Microsoft has to address and take advantage of, specially with the launch of the Xbox One console.  Games has to be a priority to make Surface 2 a true consumption device.Lastly, the support Microsoft gives the tablet in the way of updates is incredible.  There are constant updates to improve battery life and other problems.  I've only encountered two instances of bugs, but other than that, the foundation is rock solid.  Some might complain about the number of updates that come about, but I see it as Microsoft backing up its product.  They aren't intrusive and they are mostly done in a couple of minutes.Overall, I'm satisfied with the Surface 2.  I still feel it needs a few more months of maturation, specially in the gaming department, but most people will love the device and should give it a fair trial to see how well the device can perform for 99% of the people out there.  If you're on the fence about it, don't be.  Surface 2 is a special device worth considering as a bridge/laptop replacement device.", "Date": "November 4, 2013"}, {"Title": "Almost perfect!", "Author": "SurfJake", "ReviewID": "RQSMZBYNL4GDC", "Overall": "4.0", "Content": "I've been looking for a tablet that I can also use for productivity - such as word / excel. I have an ipad and although it is great, it's hard to use it for productivity. I bought the Surface 2 hoping it would solve my problem and it pretty much did.The windows titles are a nice change to iOS icons and I like how they update with new text/photos for top stories etc. I also like that the apps take advantage of the full size screen. A criticism of mine toward iOS and android apps is that they are heavily text based (built with cell phones in mind) and do not take advantage of large tablet screens. This is not the case here.I also purchased the Kindle Fire HDX and although the build is fantastic, the colors are amazing, unfortunately the apps are lacking and productivity is out of the question. If you want to use it for media consumption only, it would be my first choice.The disadvantage of the surface is that there aren't a lot of apps available. Also, there are not many cases to choose from. The screen is pretty impressive but the contrast and color richness is not as a good as the HDX or retina screens. Also, the keyboards aren't cheap and when added to the price, it gets close to the ipad in terms of cost. However, the surface keyboards are more comfortable for those with large hands as they take advantage of the the screen's additional width that is absent on the HDX / ipad.As a plus, this came with 200gb for 2 years of skydrive (saving me $240 on my dropbox subscription), a $25 app store gift card, and a years worth of free skype calling.", "Date": "December 26, 2013"}, {"Title": "I love all technology and this machine suits my needs.", "Author": "Amazon Customer", "ReviewID": "R3V0LUU7H67YKY", "Overall": "5.0", "Content": "I had bought the Surface Pro and returned it not because I didn't like it but if Microsoft had updated the camera and included the new office software I would have kept it. I returned it for the Surface 2 because of the price, the new updates to the camera and the added Office software.  I also bought the keyboard which I am typing with right now. I have the 16 gig surface and I added a micro SD card. My Surface 2 is very lightweight to carry and I take it to work with me everyday. I love the camera and video which is hybrid; you can take stills while video taping. The Panorama camera is great. This is a great buy and it works very fast just like my computer.", "Date": "December 7, 2013"}, {"Title": "an excellent little machine", "Author": "Crystal Eitle", "ReviewID": "R1WTF6M1GFMEX0", "Overall": "5.0", "Content": "I received a Surface 2 tablet from my job. (I work in IT support and these are being handed out to one of the user groups at my company).  It has quickly become my favorite computer/tablet/all-purpose-device.  The Surface 2 hits the sweet spot between portability and usability.One thing to be aware of is that to get the most out of this device, you really also need the Type Cover 2 (NOT the Touch Cover, which I've heard is basically a useless piece of garbage).  The reason for this is twofold:1) The Type Cover 2 is a great, useable keyboard.  I'm a fast typist, and I have had no problems touch-typing on the Type Cover keyboard.  It's a little smaller than a standard keyboard, but is very well-designed as far as tactile feedback and the size of the keys.  It's really fun to be able to type a lengthy comment, or review, or email, and then go back to using the touchscreen.  After years of carrying around devices with a touch-only interface, it is so great to have a keyboard back!2) The Type Cover 2 functions as a backup battery for the tablet.  Basically you have two batteries, one in the tablet and one in the keyboard.  (The tablet connects to the keyboard via a magnetic connector that makes a satisfying click as you snap them together.  Sexy!)  When the tablet is connected to the keyboard, it uses up the keyboard battery first, then the tablet's internal battery.  Likewise when you charge, it charges the tablet first, then the keyboard.  In theory, you have up to 20 hours of battery life with the Type Cover 2 attached.  I don't know about that, but I do know I've been able to use the device pretty much all day without running out of battery life.(One drawback is that there is no way to charge the keyboard separately while carrying the tablet around.  The keyboard has to be attached to the tablet in order to charge.)Included with the tablet is a full version of Office 2013 including Word, Excel, PowerPoint, Outlook, and OneNote.  This allows you to do \"real work\" if your work involves using any of these applications. You can use these applications on the \"desktop\" side or the \"tablet\" side.  Basically you have two different home screens you can look at: the mobile screen with the tiles (this is the one I use the most), or an interface that looks more like a traditional Windows desktop.  There are actually separate versions of the Office applications depending on which interface you're using; the ones on the desktop side are more full-featured, but I find myself using the tablet interface for most things.Unfortunately, there is no way to install other Windows desktop programs (you would need a Surface Pro for that), but you can install apps on the \"tablet side\" via the Store.Have I mentioned how awesome it is to have both a touchscreen and a keyboard? Web browsing becomes much more intuitive and fun.  (The downside is that now I keep trying to touch the screen of my Windows 7 laptop, which of course doesn't do anything).The form factor of this device is ideal.  The screen is large enough for comfortable reading and viewing, but the whole thing is so small and light -- even with the Type Cover attached -- that I can easily slip it into my bag for the day.  As a result, I have the device with me all the time.  It's the device I go to first now for most uses.This is also the device that got me using OneNote.  Learn to use OneNote!  It's practical and surprisingly fun.Pros: - Excellent form factor - Good battery life - Office 2013 - AffordableCons: - Type Cover 2 keyboard must be purchased separately - No app to watch Amazon Prime video - Can't install Windows desktop applications.", "Date": "May 24, 2014"}, {"Title": "Makes workers happy", "Author": "bennett myers", "ReviewID": "R2Z4BZ2IDZP320", "Overall": "5.0", "Content": "It's been said in virtually every positive review of the Surface 2 - this is not a toy.  Which has two sides to it: don't judge the S2 for its paltry game selection or the limited number of other apps, but for what Surface alone can do among mobile devices - work seamlessly and powerful on the Office apps that you run every day.  This is almost cliche by now - but it's true.  Many reviewers have compared it unfavorably to smartphones for smartphone-like functions, and AND unfavorably to laptops for Windows-type functions, and given insufficient credit for the great value of straddling all of those functions and performing all of the essential tasks of both, in form factor that looks and feels great to use and is impressively svelte.  In my opinion, most tech reviewers are behind the curve when it comes to new device genres, and the Surface/Windows RT is just such a device.Office runs great, and most of the saving/file management behavior is just like Windows.  This is a device you can take home or on the road every day while leaving your laptop at home.Where it's not like full Windows 8 office: Excel macros.  Yes, that's about it, and I feel the inconvenience of this myself, sometimes.  But other than that, the only other things missing that I know of are true power-user capabilities like running third-party extensions for Office.  This is not totally insignificant, and will be important for some users, but understand that all of the other normal functions are as they are in full Office.  There are also good security rationales for these limitations in the lighter, lower-power RT environment that don't have loads of security software and other processes running in the background.If you are used to Android or iOS apps, you have to adjust to doing more from your browser, but you realize that's as much because of the form-factor - this is more like a laptop than a regular tablet, and Internet Explorer runs everything web-based, unlike iPads or cell phones.  I run a solo-practice law office, and the #1 use for my Surface is timekeeping on my web-based practice management software, essentially a sophisticated website - and it works great.I have also set up a VPN for my Surface to port into my disk server at work.  This (as with any device) might take a little tinkering and be fairly basic in terms of functionality/options, but it functions well.  Any web-based portals you have to disk servers as well seem to work fine despite the lack of Java.  It also connects with servers and other computers via local networks including homegroups, with no problems that I have noticed.The other big payoff for this device is the beautiful, businesslike design.  I recommend the magnesium color, which might pick up a scuff or two down the road, but it really stands apart and shows off the matte metal finish and the unique form factor.  The kickstand perfectly complements its more-laptop-than tablet use cases and makes this an attractive and useful fixture on your desk - whether that's your workplace office, an out-of-town meeting, or the breakfast table.", "Date": "March 20, 2014"}, {"Title": "Upgraded from an iPad and never looked back!", "Author": "Gerhard Roux", "ReviewID": "ROQ60ASPL2Q1", "Overall": "5.0", "Content": "I use this Surface 2 on an overhead projector for my university classes. It is infinitively more useful as a classroom tool than an iPad. Really glad I made the change.", "Date": "March 17, 2014"}, {"Title": "It''s good", "Author": "Jon H.", "ReviewID": "RXI1FZZXS16IO", "Overall": "3.0", "Content": "After several weeks of usagePros:Very lightSleek, smooth, comfortable feeling.Dual position kickstand is something that you'll see nowhere else in the tablet worldBattery Life is stupidly long, you could go a couple daysCopy of 2013 office included, 200 GB cloud storage and Skype unlimitedOn screen keyboard is very nice to use, even has a hand writing mode built inBeautiful display, I haven't seen anything like itBluetooth capabilitiesCtrl button on the keyboard, every possible ctrl + key option availableSD and USB 3.0 ports, I haven't heard of another tablet with a USB port.Cons:Advertised at 32 GB, they do state it's actual usable memory at 22 GB but it's about 20 after updates.If there's a game or program you want that's not in the app store or already included, you're screwed.Keyboards from Microsoft are absurdly price, buy one from another company. Moko is nice.Microsoft decided to design this tablet with the stupidest charger they could, the most unavailable charge there is.UPDATE: I lowered my rating because of the ridiculous charger.Overall, I would definitely recommend this, but if you can, 64 GB or the pro version", "Date": "February 18, 2014"}, {"Title": "LOVE", "Author": "Alison R.", "ReviewID": "R1UJYEJ595WFBA", "Overall": "5.0", "Content": "I love my Window's Surface 2. I bought this to use instead of a larger, heavier laptop because being a teacher, I have enough to carry all the time. The Surface was the perfect substitute. It does everything a laptop does, just on a smaller scale. Sometimes it's a little difficult to create powerpoints and documents because it is smaller, but I've never run into major issues. It produces great sound, I love how the apps work on the tablet, I love the keyboard hook up I purchased along with the Surface so I can type using a keyboard instead, the keyboard on the Surface itself is also very effective and accurate. I love it all around. Such an awesome device and people are always asking me what I have. Again, I'm very satisfied with this purchase", "Date": "February 16, 2014"}, {"Title": "love the surface- a review from a student", "Author": "MKap", "ReviewID": "R1WYVMHHTDG8A7", "Overall": "4.0", "Content": "I love my surface. I don't know where to begin. The beautiful hi-def screen , the highly responsive touch feature, the fluent windows 8 with it's many tiles. Microsoft has made computing fun and personal again. The applications are great and with windows cloud I will never have to fear losing important documents. OneNote is one of my favorite applications! And with this tablet I am able to split the screen so I can take notes on one side and read my textbook on the other side of the screen. One note allows you either draw or type what you want to record as notes. Office is good but it seems to me that office is more of a desktop application as it is incredible difficult to write term papers with the attachable keyboard. The keyboard is so sensitive that you will often find yourself fat fingering words. But office does levitate some of this problem with auto correct. Another problem is that my surface shut off in the second week and when I powered it on, it gave me s \"bitlocker\" code to enter. I have no idea what this, and Microsoft tech support is a nuance. Microsoft will have you log into your \"account\" rather then just hand you a phone number to get it fix. No easy solutions from Microsoft.I finally did get this fix , but only thanks to searching online for answers not because of Microsoft supportIn short, a great tablet but be scared if it breaks and you have to contact Microsoft support, (outsourced to India) be very afraid", "Date": "January 13, 2014"}, {"Title": "Beautiful, Solid Performing Tablet", "Author": "PurpleMonkeyDishwasher", "ReviewID": "RLNRFX2FPE96A", "Overall": "5.0", "Content": "I bought a Surface 2 from my local Microsoft Store, and absolutely love it. I had the previous generation and this is an amazing improvement.The kickstand has two angles now, and the second angle makes it MUCH easier to use in your lap. The Surface 2 is also only made with two pieces versus three since the last generation; resulting in a more solid-feeling device.The silver Magnesium is so good looking, and so is the screen. Full 1080p resolution, resulting in more crisp pictures and breathtaking movie visuals. The sound is good, not the best; but much better than the first generation.The cameras on the Surface 2 are vastly improved since the last generation. So, if you're one that's particular on a tablet with a good camera; Surface 2 will be able to fulfill that.The Surface 2 comes with Windows 8.1 which is also an improvement in itself. Of course, it comes with Microsoft Office 2013 RT which includes: Outlook, OneNote, Word, PowerPoint and Excel.Also, I'm not sure if it's because I bought my Surface 2 from a Microsoft Store, but it came with codes for 200GB of free SkyDrive storage for 2 years and 1 year of unlimited Skype minutes and WIFI. Which, in my opinion, is SUCH a great value, especially since the SkyDrive storage that can be used across all your Windows devices associated with your Microsoft account.In conclusion, if you're looking for a tablet that can not only meet your productivity needs (Office) and has great battery life for consumption; look no further than the Surface 2.", "Date": "November 2, 2013"}, {"Title": "Very Impressed. Better than I thought it would be", "Author": "Eric Barton", "ReviewID": "R3JMOEIJF38ILO", "Overall": "5.0", "Content": "Before buying this tablet, I read a lot of other user reviews. I consistently saw the same thing here as well as other websites: the pro's knocked it but the users liked it more. I decided to take the plunge. Full disclosure, I have an IPad 3rd generation Retina and a Nexus 7.Overall fit and finish of this thing is up there with the IPad. Very well put together. The functionality of this is way better than either of my previous two tablets. The IPad is great but it lacked office. I, like most professionals, need Microsoft office. Unfortunately that is something outside of my control. My work basically forces that on me and I have to use a PC at work. While the iPad has made strides there's still a gap there. I wanted something that is seamless and I didn't have to worry about compatibility.This thing has way more usability than the Nexus. Honestly it was nice, light, had a great screen, decadent selection of apps, but at the end of the day I didn't use it much. I was always intrigued by the Surface.I was looking between the Surface 2 and the Surface pro. If you're looking to replace your laptop, get the pro. If you want something to do work on and have the lighter weight, smaller price, Get the surface 2. I love this thing.The type cover is a must.Office is seamless on this. I love the fact I can edit spread sheets, power point, and type as fast as I do on a laptop. I gained a lot of respect for MS.ConsPrice. This thing wasn't cheap. I think if they had it at $300-$350 for the Surface 2, that'd be a great price. But at $450 plus the price of the type cover, $149. You're looking at a pretty hefty price.The only other thing I didn't like is the fact that it's weird when you hold it in portrait mode. It's not a deal breaker, but it takes some getting used to.Lack of apps. Look this is something everyone brings up when comparing between MS, Android, and Apple. I read something somewhere that its not of a big of a deal if you just go to the website. For example Yelp. There's no yelp app, but I just went to yelp.Com and problem solved. Same thing with Spotify. Works fine on explorer. At the end of the day it wasn't as bad as I thought it would be. Explorer works great. You just don't see 'custom' designed things for the Surface. I hope they get there, bc that would be pretty cool and I think something like this deserves the same treatment from developers bc it's a great piece of machinery.If you're considering the surface, I'd say take the plunge. I am glad I did and haven't regretted it once. Well done MS. I actually DO more things with this tablet than I ever did with the IPad and the Nexus.", "Date": "February 16, 2014"}, {"Title": "Its an OK product, but Microsoft customer service is deplorable", "Author": "Paul Vines", "ReviewID": "R3BRKJ4OBNVWOP", "Overall": "3.0", "Content": "I did my research before I bought it, so I knew what I was getting into. To be fair, I really do like the hardware; and the OS is decent enough once you get used to it.That being said: be prepared to be disappointed in the applications available for the Surface 2. They are horribly designed - particularly if you have ever used the iTunes equivalent application. Example: eBay app for Apple allows you to track shipping of purchases. Not so for the Windows app. In fact, for several of these apps, it just opens an explorer window and takes you to the website with a split screen when you try to utilize a function. Gee, thanks for nothing. I could do that on my own without wasting drive space with a useless app.However, to be fair, I wanted a very portable tablet (my PC laptop is 17\") that came with the Office suite, so a lack of quality support apps didn't really turn me off to it. I still liked my Surface 2 a lot.For three whole weeks. Then it died. I returned it through FedEx as they instructed so I could get my replacement. After a few days, I chatted with their tech support to receive an ETA for my replacement. They gave me an ETA and told me they would send me tracking information when it shipped. The ETA came and went. No tracking information. I contacted them again and was told that the replacement surface was definitely in the mail. I asked for tracking information. They said they couldn't give it because  the storms were delaying shipments. I pointed out that the storms would not have effected FedEx giving them a tracking number; it would only effect the speed of the delivery itself. It took 2 hours of tech support chat to get them to confess that they had no idea if it had shipped or not; they were just assuming it had. So. Here I sit. No Surface 2, no tracking information.I can but assume I will eventually get my replacement Surface 2; however, I just want to warn other potential customers. Many people have had their Surface 2s mysteriously stop working. If and when that happens you will have to deal with their customer service. This is what you can expect.Still, I must admit, I really did like my Surface 2. Sigh.", "Date": "January 30, 2014"}, {"Title": "Good tablet", "Author": "Stephen M. Lerch", "ReviewID": "R1ZGGPAH1F9Y18", "Overall": "5.0", "Content": "With the Surface 2, you kind of need to know what you are getting into. Surface 2 doesn't use the normal version of Windows 8.1, it uses Windows 8.1 RT. This is a watered down version of the full blown OS that will only run on ARM and similar based processors, NOT the standard Intel processors in the Surface Pro (and Pro 2). This means you CAN NOT run standard Windows software on the Surface or Surface 2. This can only be done on the Surface Pro or Pro 2.So then what are you buying? You are buying a tablet that can only run software from the Windows Store. This means that none of the standard Windows programs will work, and you had better make sure the apps you are looking for are available prior to buying the Surface 2. I recommend going through and listing all the things you want to be able to do, then check the  Apps for Windows website to ensure you can do what you want.The Surface 2 comes with the ability to run Internet Explorer 11 and send/ receive email with the built in Mail app. That's 2 of the things most people want from a tablet right there.And there is something new to Windows RT 8.1, you now get Outlook, the full featured version not just the Mail app, included for \"free.\" This is a bonus as not all business based email systems wanted to work well with the Mail App.Something else that is included, so in theory a $220 value added to the Surface, is Office 2013 Home and Business. This means that you get Word, Excel, Power Point and the above mentioned Outlook pre-installed and \"free.\" If you want to use this device for business, and need full Office capability, functionality and compatibility, this is probably one of the best ways to get it in a tablet form. It's important to note that Office programs still aren't \"touch first\" programs, so you probably want to invest in a type cover for the Surface, though in a pinch the touch keyboard and any of the Office apps run really well on this device.I really love the Surface 2. I actually think that Windows RT 8.1, when you know what you are getting into, can be a viable alternative to an iPad. Sort of, right? There are still some native apps you would expect to find in the Windows App Store that just don't exist, but since you can use the web browser and it is fully functional, this isn't a massive issue. Pinning a website to the Start screen (where all the tiles are) is pretty simple, so you can make your own apps ghetto style with the pin capability. And everything I've done this way, including Instagram, works quite well.In terms of performance, the Office programs are probably the most demanding pieces of software on the Surface 2, and they all open fairly quickly and input is quick and responsive. I also played the Halo Spartan Assault game and that runs well also. Not quite as fluid and flawless as my Surface Pro, but it works really well regardless.The screen is bright, crisp and clean. It's a 1080p screen, so it's 1920x1080 resolution. I would have rather seen 1920x1200, as this makes Excel files easier to use and is more the \"business\" 16x10 aspect ratio, but regardless, even in 16x9, everything just looks fantastic and is easy to read.Battery life is very good. I can squeeze out about 9.5 hours if I'm just browsing the Internet and messing in Office. The least I've gotten is about 7.5 hours and the most was around 10.5 hours.Overall:If you are on the market for a tablet, and it doesn't need to be an iOS based tablet, I recommend giving the Surface 2 a serious look. Just remember you can't run standard Windows programs (no different than an iPad or Android tablet) and you will do well.If you want full Windows capability, the Surface Pro and Pro 2 are great devices, you just pay quite a bit more for that capability with less battery life.", "Date": "November 18, 2013"}, {"Title": "Wanted to like it", "Author": "Amazon Customer", "ReviewID": "R26IZAM9YB3C14", "Overall": "3.0", "Content": "Purchased the Surface to use around the house as a web browser and media streaming device and wanted long battery life.  Having MS Office was an added bonus, but wasn't planning on using it to write or edit documents. For the most part the Surface met my expectations except for streaming video.  Had problems using IE11 with flash support.  Video using the Netflix app was fine, but when using IE to stream Amazon or HBO GO, the video and audio had noticeable stutter and eventually would stop after several minutes. Applied all updates with no improvement.  Other devices on the same network didn't have the problem. Interestingly, MS doesn't have a version of Silverlight for RT (recommended playback option for Amazon rather than flash) so there wasn't any other option to try for streaming. No other browsers can be installed either.  No app for Amazon or HBO GO.  Decided to return the tablet rather than help MS debug it.  Maybe the Surface 3 will have basic video streaming worked out.Beyond the streaming problems, the tablet is responsive and works quite well. The metro version of IE is a bit cumbersome and sluggish, but serviceable. The desktop version is better. MS Office seems to work well. Application launching and switching works great. Kickstand is very useful when sitting at a table but not on the lap. Natural landscape orientation really requires two hands which can be a bit awkward. Screen is bright and clear. On-screen keyboard works well (didn't purchase the type or touch cover).", "Date": "May 18, 2014"}, {"Title": "Handy", "Author": "Amazon Customer", "ReviewID": "R28C4K90TERA44", "Overall": "5.0", "Content": "Can set it up as tablet, has built in stand, connect a thin lite keyboard, use as a notebook and connect to full kb and mouse and monitor. And, if you haven't Windows 8.1 desktop, easy to keep synched together. OneDrive makes a nice addition for sharing files and open anywhere.I wish without getting Surface Pro that it hadtt at least 4GB RAM instead, constantly using an extra 2GB pagefile (4GB in use) 2 jst ant enough, and seeing how programs are rarely closed and even rarer to reboot, Wold go along way for small imovement.Week area: programs, Store, quality. Just really lackluster Q&A; and of what is there, lack of featureseven in popular, standard social media apps.I wanted to use a LAN had for music nd photo collection, but Libraries cannot be assigned to externally attached, even when directly attached to the USB3 port.Chose this over Surface Pro or MacBook Air, cost of the Pro was only reason I skipped, and don't care for Apple ecosystem, would have used Air as Windows only which has some issues. Next time, Pro or Galaxy 12 inch, the 2 extra inches would be helpful, and more nd better choices in apps, plus 3GB RAM.", "Date": "May 4, 2014"}, {"Title": "The Surface 2 is great for anyone who has a lot of work to do, but is also looking for a tablet to have fun with.", "Author": "Megan", "ReviewID": "R33S1HRFULKZF6", "Overall": "5.0", "Content": "I really love this tablet. Here are some pros and cons I have found (I have had the Surface 2 for about a month):1. The touch screen is very responsive; better than some I have used.2. Windows 8.1 RT is easy to use and easy to personalize. I really like having the metro/tiles start screen as well as a traditional desktop (though I don’t use the traditional desktop much).3. Great for web surfing. If there isn’t an app for what I want to do, I just use the browser.4. Free Microsoft Office- the full version, no trial!5. Good hardware: lightweight, full USB port, rocker volume button and power button. The kickstand with two positions makes it comfortable to use while at a desk, on the lap, laying down, etc.6. The speakers and video quality are good. This would be good for games and movies, though I have really only used it with YouTube and some free games from the app store.7. I have a Canon printer and had no problems printing using the USB port. Wifi printing should also work fine.8. The battery is better than a traditional laptop. I can get easily 6 to 8 hours of use depending on screen brightness. Using it nonstop versus turning it on and off actually seems to prolong battery life, and it charges quickly.Cons:1. The on screen keyboard takes up a lot of the screen, but it is still usable. An external keyboard is great when typing long emails, papers, documents, etc.2. The charge cord is rather short, and the light doesn’t change between charging and fully charged, so I don’t know when it is done without turning on the tablet to check the battery level.3. The tablet is very rectangular. I don’t mind, but iPad users may have a problem with this. It looks great as a laptop with an external keyboard, though.Overall, my complaints are minor. I am a teacher and I LOVE this tablet for work but also for play. It does pretty much anything a laptop can do. I purchased the Type Cover 2 to go with this, and it is great. It has moving keys like a regular keyboard, the keys light up, plus it closes to protect your tablet screen. It makes this functional tablet that much more functional.", "Date": "March 10, 2014"}, {"Title": "Better than the iPad for many tasks.", "Author": "pbtx", "ReviewID": "R3MP9CG9N0UF6Y", "Overall": "5.0", "Content": "First off, buy a full Windows 8 tablet if you need a computer.  Buy the Surface 2 if you need a tablet. I have owned 2 iPads, and what I liked about them was they were less than a computer, meaning low maintenance.  Because Safari was getting a bit slow, I was considering moving from the iPad 3 to the latest generation.  But after playing around with a Dell Venue 8 a bit, I was very impressed with the Win8 version of internet explorer.  And what I wanted was a larger tablet mainly for reading newspapers, surfing the web, and limited productivity tasks.  I took the plunge and went with the Surface 2.  I am very happy with that call.  Some thoughts  that made the decision:1)  Obviously, the iPad has more app selections.  I own more iOS apps than I care to count.  I realized I use about 4 regularly.  The windows store is picking up quickly, and a couple key apps I needed .. namely ewallett, taskangel, and Trello are there and work well.  A lot of total junk there too, but I suppose that is true of the Apple store as well... the ratio of good/bad is just higher there.2)  I don't mind iTunes too much, until it is time to migrate to a new computer.  Every time that joy comes around, I realize Apple must still hate the PC.  That memory is fresh now.. and so I am ready to start moving... if slowly.... out of the apple world again.3) It has Outlook.  I manage 3 email accounts, POP and iMAP, and need something more complete than what you can get in Android or iOS.  Especially rules.  Using the Surface 2, I can get through my emails in the AM and in the PM much more quickly than with the iPad, and more pleasantly than having to sit down with a computer.  Outlook is still not as integrated with the Windows 8 apps as it should be (contacts for example), but as an email application nothing I have found beats it if you have to filter through a lot of chaff to get at the meat.4)  It's not a PC.  It has some limitations.  Excel does not do macros, for example.  This is a good thing.  Security is better.  I have to be paranoid about my laptop and desktop.  Less so here.  Also, Apple's little SSL issue reminded me that whatever we may say about our friends in Redmond, they have a lot of horsepower focused on security.5) The Surface 2 really wants to be used in landscape mode.  An iPad is a bit more handy in that sense, as it works well in portrait or landscape.  But you also get less screen real estate.  For my purposes, I prefer the Surface.  (If MS comes out with a smaller one,  I would probably get one of those as well).  Read alot in bed, the iPad is better.  Sit in a chair, or at a table, the surface wins.6) Oddly enough, I actually like the Win8 interface better than the iOS one, especially since everything went low contrast with iOS7.  Live tiles are great.  I wish you had more control on the \"non tiled\" application list organization (easy in Win8, have not figured it out in RT yet)7) As I am old enough to know what a VAX is, and am an engineer, I am also thus obviously not the best target demographic for my friends at MS.  Still, so far, I think this tablet is not out of place for the computationally challenged.  But it is not quite at the iOS level yet either.  I have hopes the volumes will pick up, and MS will not abandon this effort.  But for now, enjoy the fact that there are not enough of them out there to make them a very attractive target for cybercrime.", "Date": "March 4, 2014"}, {"Title": "So far so good", "Author": "sherrie hutchinson", "ReviewID": "R1A1DLQFNLNCYB", "Overall": "4.0", "Content": "After much research and comparisons to many other tablets I think I made a decent choice. The windows 8 RT is taking some getting used to. It looks nice and the display is good. The kickstand is helpful with two positions and you can use it on your lap.I did not buy the keyboard, but the on screen keyboard is responsive and not at all crowded. I may eventually invest in a back lit keyboard but for now I don't really need it. The weight is fairly light and the size is great for surfaing, word processing etc ( and my sight is not the best). The limited amount of apps free or pay is a little bit of a bummer for me but I was aware of that. One app I find sorely missing is a good Driving navigator. There are no free apps for driving navigation and few more than one that actually uses verbal prompts, and I want to say that the cost is 2.50...(a Year?)The software that is included is fantastic and makes the Surface a good value. The camera is not the best but I use my phone for pics. I got a 64 GB model, which in all actuality only gives you 47 GB after the OS takes up its portion. The battery life seems good as well as it charges quickly. The charging cord is rather short.The speed of downloads is also pretty good. All in all for the price paid on Amazon I feel the MS Surface 2 is a good choice!", "Date": "February 25, 2014"}, {"Title": "Pros and Cons", "Author": "Janette H.", "ReviewID": "RDUHX37GOK9E4", "Overall": "4.0", "Content": "It's a great tablet, the battery life is amazing, and it's very easy to use. As a college student dealing with a lot of business, writing, and law classes here are my major pro's and consPros- Word/Excel/One Note work seamlessly- SkyDrive cloud storage makes it impossible to lose important notes or project info- Ereader app in windows store works perfect with .epub .mobi and .pdf so textbooks work fine- speakers give a nice clear sound for background music/netflix while relaxingCons- windows 8 RT keeps you from downloading apps/programs not from windows store, you have to use Internet Explorer which isn't compatible with my University's online system meaning I can't take quizzes or studied online powerpoints with my surface, also doesn't work with McGrawHill Connect so online homework has to be done on my laptopoverall, it was well worth the money. just make sure you research what you really want to use the surface for and consider getting the surface pro if you want a more notebook like tablet", "Date": "February 23, 2014"}, {"Title": "Surface 2 - Great Product, Amazing with small limitations for now", "Author": "AV Man", "ReviewID": "R1W8VBG0N1QVVJ", "Overall": "5.0", "Content": "The surface 2 is an amazing device. Currently I own a Lenovo yoga laptop and ipad mini so I have experience now with both windows 8 and windows 8 rt which are 2 different but similar operating systems.If you are considering surface, then the first question you must ask is how are you going to use it. If you want a laptop replacement that can run all programs that you are used to in windows then you should get the surface pro or pro 2. I will tell you below what you can and can't do on the surface 2.The benefit to this device for me, is that I can take the Surface 2 on trips and leave my laptop and ipad at home since this device does everything I need on trips. The battery life is all day and usually lasts for about 10-12 hours depending on what I do with the device.Can do's:1. Use a USB port which can use most devices that can plug into the port. This is one big advantage over the ipad.2. Use a micro SD card to expand memory up to 64 gb3. Boot in about 10 seconds4. Use regular internet explorer (although some add on's are disabled5. Use Microsoft office (comes on device - powerpoint, word, one note, excel, and outlook)6. Use skydrive for extra storage in the cloud7. Access to store for apps8. Connect to a monitor or TV using a micro hdmi to hdmi cable9. Connect a Bluetooth mouse10. Use a magnetically connected keyboard - using to type this review11. Use Miracast to wirelessly connect to a TV12. Multitask and easily change between apps quickly13. Use a windows file system14. Connect Bluetooth devices such as a mouse15. Take pictures or video16. Great Wifi range17. Play games using a Xbox controller (I use wireless USB adapter)Can't do's (limitations):1. Use legacy windows programs (limited to the app store)2. Small amount of apps that I find useful3. Most apps available for ios or android are not available in the windows store4. No iTunes app5. No touch keyboard that pops up automatically in desktop5. Difficulty syncing with skydrive - must restart device to resync and update listListed below are the accessories that I have found useful:1. Micro HDMI to HDMI adapter (I use the mediabridge)2. Microsoft arc mouse surface edition3. Type 2 keyboard4. Nixon case5. wireless Xbox 360 controller for windows with adapter6. Micro SD cardOverall, this an ultraportable device that continues to get better and better with each windows rt update and hopefully the store will begin to catch up with ios and android.The 32 GB is somewhat limited and if you are truly going to use this as a replacement for your laptop then I recommend getting the 64 GB version.", "Date": "February 13, 2014"}, {"Title": "Great tablet if you get one that works", "Author": "GM", "ReviewID": "R1D9MWD2LWP09X", "Overall": "4.0", "Content": "I have had my surface 2 for about a month now because I had to send the first one back to Microsoft because it was defective. Other than that, it is the best tablet i have used. Very versatile, intuitive, well made, but not the best quality control at Microsoft.", "Date": "January 20, 2014"}, {"Title": "Surface 2 Review", "Author": "Dave", "ReviewID": "R1X0BSA0Y4EYCU", "Overall": "5.0", "Content": "I use the tablet as a pseudo laptop replacement despite not being able to run legacy apps.  It's quick and responsive, and frankly, I don't open my laptop any longer unless I have to.  My wife and I have two separate accounts on the same device.  Hence, we can share the tablet and keep our emails and apps separate.  The app selection is not as plentiful as you will find in the iTunes or the Playstore, but I haven't found anything that I absolutely needed or missed.  That being said, the Windows Store is actually getting better by the day and the tablet comes with some nice built-in apps (most of all, Office).  Anything in between can be replaced by IE 11, which is actually a flash enabled browser.Office works great and only lacks macro support.  If don't know what macros are, you more than likely never use them.The OS itself is fairly easy to learn but may take a day if the user is coming from iOS and has no familiarity with Windows 8.  Once learned, you will realize it's probably the most versatile and best tablet OS on the market.  Having the ability to have two apps side-by-side is easy to dismiss unless you actually start using it on a regular basis on a tablet.I don't have much more to add on top of the already glowing reviews from many of the users.  Since most of what I do is centered around the Internet and some Office, I don't find myself missing legacy apps as much as I thought I would.  Given that, I have taken my Surface 2 as my sole device on my last two trips.There are really only two criticisms that I have of the tablet.  First, 32GB doesn't really go as far as you think it would (even on a tablet).  However, you can clear maybe an extra 3GB by creating a recovery drive on a USB stick, and you can also add up to an additional 64GB via a micro SD card.  Second, the type cover (which is an absolute must-have accessory) is overpriced.Otherwise, I am extremely happy, and the Surface 2 has actually exceeded my expectations.", "Date": "November 20, 2013"}, {"Title": "Too Much Money!", "Author": "Greg \"smitz0327\"", "ReviewID": "R1U3LX9LT4ZCHU", "Overall": "4.0", "Content": "First off, my wife and I were surprised of how small this tablet is. It is not really a big tablet so I would recommend checking it out first at a store. After about a week, my wife started to really like it because of its size where you can bring it much anywhere. It does come with office excel and word which is all you really need if you are using it for personal or school use. Remember this does not come with a keyboard so be prepared to spend another 100 dollars for that.One thing I wish I would of done was do more research because the tablet is expensive especially with the keyboard. I did find an ASUS along with other Windows 8 tablets with keyboards and they were cheaper by a long shot. Also HP is coming out with a new Windows 8 tablet soon and I have always been a fan of HP.Nothing I can say about Windows 8 besides it is excellent. I have used iPads and apple products and I have to say soon, Microsoft will be taking a bigger chunk out of the market because this is much better than what Apple has to offer.I would of given it a 5 but the price is way to much for what you get in terms of memory and hard drive space. I really cannot mention hard drive because if you have a Windows email account, Sky drive is free and it stores everything off sight and is always available even if you don't have your computer. One final note, the web cam is very good and takes great video and photos.", "Date": "November 19, 2013"}, {"Title": "Great Tablet, needs more apps", "Author": "Blesson George", "ReviewID": "R12ODMTYWVAO1G", "Overall": "5.0", "Content": "It's a great tablet. The downside is that it doesn't have most of the popular apps. It still doesn't have instagram. But the tablet is fast and doesn't have any problems. I like that we can play vba games on it.", "Date": "November 13, 2013"}, {"Title": "no regrets", "Author": "Michael_writes_mails \"Michael L\"", "ReviewID": "R76ZLI9L8BDVD", "Overall": "5.0", "Content": "no regrets. have ipads at home but  the surface 2 does not need to hide.  clean interface, not cluttered like android devices and very easy to use. like the expansion via micro sd card and the usb 3 port, a very high quality tablet.", "Date": "March 21, 2014"}, {"Title": "Really great, but not quite perfect.", "Author": "Nick Glover", "ReviewID": "R1W49TGZ2QQBIG", "Overall": "4.0", "Content": "It isn't perfect, but it suits my needs really well and, overall, I think it's one of the best tablets out there. Definitely recommended. I don't own a laptop and now I really don't need one. This thing is great. Having said that...Pros:-Office. FULL Office. I commute to school and I don't have a laptop, so in the 4 hours between classes, I can do my homework. No other tablet has this feature.-Keyboard covers. Even the Touch Cover works pretty well. I often forget this is a tablet and tend to use it like a laptop...-Actual stereo speakers. The sound is loud (enough) and it's nice to actually get stereo separation.-The screen is really nice, even if it's \"only\" 1080p.-Battery life is pretty good. I can browse the web all day, watch a couple TV shows on Hulu, and still have juice left over for the next day.-It syncs my settings from my desktop, so everything I'm used to is already there. Plus it's Windows, so I don't feel like I am using a limited tablet.Cons:-Limited app selection, but honestly, I don't even notice. You can access everything through the web sites anyway, so the only really notable exceptions are games, which I don't really play on a tablet anyway.-Still some bugs to work out. I, and many other users, have had to refresh the OS to be able to turn off the typing sounds when using the Touch Cover 2. Really shouldn't have to do that. Also, it sometimes won't wake up from sleep and has to be manually shut down and booted back up. Not the worst thing in the world, but it just isn't quite there yet.-Since it is Windows RT, you can't install regular Windows programs. Not the end of the world, but it would be fun to have, say, Minecraft. They do give us Office, though, Hopefully more developers will program for RT.", "Date": "December 6, 2013"}, {"Title": "Identity Crisis Tablet/Laptop with Restrictions BUT...", "Author": "Walt", "ReviewID": "R1KRWBDKWNGBUU", "Overall": "5.0", "Content": "Let me get this out of the way, having owned the Surface RT and now the Surface 2, I want to start off with the Surface 2 is way underrated and definitely better than the generation 1 Surface RT.  Yes, they are technically the same concept but you have to compare it with the analogy as if they were both cars, one is the Delorian and one is a Mercedes/BMW.  The hardware on the Surface 2 is far superior than that of the Surface RT but the concept is still the same.Why did I say that this device has an identity crisis?  Simply this.  When we use a tablet, it's mainly a rectangle where we can carry with us, hold on our beds to play minigames, read books, watch movies/tv, and use apps.  The Surface 2 can do that, but it has problems doing so (in my opinion)-Let's start with reading.  When we read books/magazines/websites, normally we read in portrait mode.  Reading the Surface 2 in portrait mode is awkward and hard to hold long without feeling uncomfortable. For reading books or magazines etc., get a 7 or 8 inch tablet.-Watching TV/Movies with Netflix, Amazon Prime, YouTube, etc. don't need an app.  You can run them natively on the IE browser.  The apps (save Netflix) are either nonexistent or just plain suck.  But because you can just use the browser, it's like a laptop rather than a tablet.-And finally, the apps.  What can I say about the apps except that it does have Evernote, but made poorly-the browser login to Evernote is better than the app itself.  You'll find this in a lot of cases, either because you are just used to using the browser or you are used to the Android or Apple version.-Can't install software outside of the app store.  This statement alone makes the Surface 2 a tablet.The best way to say is that this is a tablet that tries to be a laptop and a tablet but fails at both because it's not one or the other per se.  It's not the best tablet; nor is it a good laptop since you can't install whatever software you want.  However, it does the job of an \"extension of your PC\" if you will, VERY WELL.  Microsoft Office is pretty much the same across the board except you can't add any addons (such as Khalix etc.).Once the Microsoft App Store is at the same level of Android and Apple however, Microsoft has the potential to beat them both.  However, getting there seems to be a huge problem.  Until then though, I love using this as an \"extension of my PC.\"", "Date": "November 13, 2013"}, {"Title": "Great for a College Student!", "Author": "V. Berk", "ReviewID": "RWP1RS419A2SH", "Overall": "5.0", "Content": "I've always been interested in Microsoft's Surface line, but decided to hold off on the device's first generation.  With the inclusion of Microsoft Office, two years worth of 200 GB Skydrive Cloud Storage, I decided to go with the Surface 2 tablet (along with a purple Type Cover 2).  I'm not qualified to compare specs, and hardware to other tablets, but I can describe my favorite features.1. The Surface is a great looking tablet.  Surface's design is what attracted me to it in the first place.  In an age where their are countless iPad clones, and indistinguishable flood of Android tablets on the market the Surface immediately sets itself apart.  More importantly: Surface has a practical design!  The Surface 2's improved kickstand that now comes with two fixed positions can fit just about any situation (lap, desk, bed, etc.).  Microsoft designed this product to go hand-in-hand with their Touch and Type covers, and you really aren't fully experiencing Surface without one (although it works fine as a standalone tablet since Microsoft's touch keyboard is pretty good).  I can say that the Type Cover 2 (now with back lit keys) is a worthwhile accessory to invest in (it now comes in multiple colors!).  I also hear the Touch Cover 2 is a significant improvement over the first generation!2. Those free 200 GBs worth of cloud storage and the device's integration with Skydrive cannot be overstated.  Already I find myself keeping as much of my work in the cloud as possible, and if I'm worried about connection the USB 3.0 port allows for easy, hands-on data transportation on flash drives and even full-sized external hard drives!  .  This device makes working on the go, or across multiple work stations a breeze!  This coupled with the expandable memory through Micro SD makes me question why anyone would ever need more internal storage for the Surface 2.  If flexibility, and mobile work is something you care about the Surface 2 is an outstanding choice of tablet.3. Surface 2's battery life allows me to use it all day.  I can take notes during lectures, work on a paper, listen to music, stream moves all over the course of a day and still have a sufficient charge.  I then make it back, charge it over night, and I'm good to go another day (and often times I don't use it THAT much, so doing all those things was me testing the battery life.  Typically I only use up 10-15% of the charge on a regular day).4.  Xbox integration.  It is awesome earning Xbox Achievements on the go with mobile games!  You also have access to Xbox Video and Xbox Music (I had a brief problem connected to my Xbox Video account the first week, and I don't know if it was an update or what but now I can stream my Xbox Video movies and TV shows with ease).This is a great product, pure and simple.  Ever since I got my Surface 2 I've found that I only need my laptop when I'm working on more demanding tasks such as gaming, Photoshop, and video editing.  I don't think the Surface 2 (running Windows RT) is by any means a laptop replacement, but it is an outstanding tablet for work and media consumption.  If you're looking for a portable device that works within the Microsoft ecosystem, runs Office, is integrated with the cloud, and is just practical for quick and easy on-the-go work the Surface 2 is an outstanding choice.Notes (will update with time):* Keep at least 3GBs free on your Surface 2's internal storage.  Your local drive needs to have at least 3GBs free to access, and make use of Skydrive.  Trust me, those 200GBs of free cloud storage are worth it!* Freeze Ups Sometimes if you're running too many apps for too long on Surface 2 it can freeze up.  This isn't a major problem, and doesn't happen often enough for me to change my rating.  If you need to restart the device hold down the Home button at the bottom of the tablet and the power button until it vibrates.  This will get you up and running in no time.", "Date": "November 1, 2013"}, {"Title": "screen and phantom touching issue", "Author": "Shane Gruninger", "ReviewID": "R3GIKIY5MMGSQP", "Overall": "1.0", "Content": "I was given this product as a gift for Christmas and was overly excited. When I started using the tablet, everything was fine until I charged the tablet all the way and removed the power cord. This caused phantom touching on the screen and was unusable unless the power cord was attached. I then returned this tablet and got a different one that has the same issue, in addition to this issue, the screen now also flickers and freezes the whole system. I am returning the tablet tomorrow and am looking into something more reliable.", "Date": "December 27, 2013"}, {"Title": "Good except.......", "Author": "Steve Sigal", "ReviewID": "R1W97F0IN5OSDZ", "Overall": "3.0", "Content": "Bought last month. Learned Windows RT and how to use this thing. Having Office on it is good for me as I have Office 365 on my desktop. However, do not buy this if you expect to integrate your calendar and contacts with your desktop version of Office. The Surface has its own 'calendar' and 'contacts' which are nice but do not sync with Office. The Surface does have an Office Desktop BUT you can only sync if you have an exchange server or your email is not a pop server based. Microsoft support is no help as the look it up and indeed it will not sync or automatically update. So if one of your uses is to enter calendar and contacts on both your Surface 2 and desktop version of Office, do not buy this.", "Date": "March 28, 2014"}, {"Title": "AWESOME!", "Author": "Kasey Chelemedos", "ReviewID": "RHXO4U22CPUVP", "Overall": "5.0", "Content": "Best tablet I've used! The programs run great and is easy to use! Having the option between a typical Microsoft desktop interface or the new windows is awesome, you can even use both side by side! I use that feature often! I definitely recommend the surface 2 keyboard! The keys feel like real buttons without the bulk! I couldn't imagine not having my surface 2!The only negative is you can't use the surface pro pen, only a stylus design.", "Date": "January 15, 2014"}, {"Title": "very happy", "Author": "marilyn", "ReviewID": "RDIPCP6DO774W", "Overall": "5.0", "Content": "my son is in 8 th grade and he loves it for school. it is easy to carry around in his backpack.", "Date": "January 22, 2014"}, {"Title": "Better than the iPad", "Author": "Trini", "ReviewID": "R3I81P68OHGKMG", "Overall": "5.0", "Content": "I think it is better than the (dare I say) the iPad.  Just as fun, all the connectivity that you require and definitely more productive", "Date": "December 26, 2013"}, {"Title": "Surface pretends to be a tablet and a PC, but is really neither...stay very far away!", "Author": "Miss Kate Beckett Parker \"RitaLee\"", "ReviewID": "R1ALCJYCXVBT54", "Overall": "2.0", "Content": "Unless just want to enjoy your music and read documents (not all Kindle books!) and watch video files, do not purchase this! Unless you plan to just try it out and then return it for a full refund...right now the best thing about the Surface 2 that I have is that it has a nice large screen for reading articles and watching videos.Pros:Came installed with Office...and this appears to work as expectedNice large screenUSB input allows you to easily access stored files(Note that none of these above \"pros\" are UNavailable in other tablets...in other words, there's nothing unique here yet)Power seems to last well...but it could be because I do not use it very often.The Cons:Kindle for Windows 8 does not allow you to send personal documents  - if someone has found a way to do this, I would give this review another star.Kindle for Windows 8 does not open all books....what? (If you're expected to replace your tablet with a Surface, what happens to the books you suddenly cannot open...are you expected to just read them on a PC? How is that innovative? C'mon Microsoft....I am one of your biggest flagwavers...I hate Apple for their DRM...but you keep regressing with every other OS....!)Cannot install most software that can be downloaded and run on a PC...(not even a Windows 8 PC) so,,,why is Microsoft calling this a PC? (Again if someone has a way to do this, I will most definitely add a star!)There is no way to kill an app that appears to be stuck....this is an important feature that can be available in most Android tablets  (either with a built-in feature or from a free app in the Play store), so you are forced to shutdown and then restart....notice i said \"shut down\" first...there is no option to reboot...which all PCs have...so I ask again....why is Microsoft calling this a PC?Bing (sorry...but even Google tablets don't flaunt Google so much....this does not endear me to Bing....just makes me loathe it more) ...and I know it's not a real con...not til you try the maps anyway...which makes you long for Google maps...Compels you to sync your Skype account with a Microsoft account....what is that about? I do not like coercion in any way shape or form....do NOT try to tell me this is good for me...I was doing just fine logging into Skype the old-fashioned way.There is no \"one step back\" [button] if it's not available in the app, you have only the option to go to \"Home\" ...again...this is a feature most Android tablets have...Apparently you can install updates for only the app you want to install updates for, but you have to click to update all then select the ones you don't want to update (because it will take that much longer to get the one you really want updated) and click \"cancel update\" on those...I can probably find more cons...but mostly I have a general dislike for Microsoft building this thing and calling it a PC and a tablet, when every time I try to do something that was previously easy on a PC or a tablet I find some new thing to dislike....so...great job Microsoft...if you were trying to alienate your fans in a new way and chase them over to Apple or Android...", "Date": "May 31, 2014"}, {"Title": "Don't buy a Surface 2!", "Author": "Judy Rubin", "ReviewID": "RIY6S40CRU8PJ", "Overall": "1.0", "Content": "In the six months I have owned this tablet I've had a total of 40 minutes' use of it. I bought it to use while travelling on business so I wouldn't have to lug my laptop around with me. It has never worked for what I needed it for. The first time I tried to turn it on after bringing it home, it wouldn't go on. I brought it back, and the store gave me a new one. A week later, again it wouldn't go on; I brought it in again, and this time the sales person was able to get it working, but while I was waiting someone else came in with the same problem. The first time I took it on a business trip, I tried to turn it on and I got an error message saying it needed a recovery code. A couple of times I've used it for 20 minutes, but was unable to open attachments in either Word or Excel, though the tablet is supposed to have the complete programs for both. All told, I've spent four hours getting help at the store and five hours on the phone with Microsoft technical support, and they've never solved my connectivity problem or my attachments problem. The people at the store where I bought it said I have to download a whole new operating system as well as 17 other upgrades. Only problem is, my machine can't find the upgrades in my house, because it can't connect to my network (even though it's in the same room with my computer, which connects just fine). I'd like to trash the machine, but it cost too much and they won't give me my money back, even though I have an extended warranty--they'll just give me another one, and I don't want the headache. It's already drained 15 hours of my time that I'd much rather have spent on other things. It's full of great ideas, and the graphics are beautiful, but in its current incarnation it just doesn't work.", "Date": "May 18, 2014"}, {"Title": "disappointed", "Author": "MaryAnn Sieber", "ReviewID": "R3S09GRNJD1S8D", "Overall": "2.0", "Content": "App selection poor, both in choises and quality. Video/ pic unable to zoom in or out, picture quality also poor.", "Date": "May 1, 2014"}, {"Title": "It has potential", "Author": "Robert J. Mansfield", "ReviewID": "RWPMPIR9JB5UI", "Overall": "3.0", "Content": "It is difficult to learn how to use. It has a lot of good features but will take some getting use to. Plus it will only interface with 8.1 operating systems.", "Date": "February 23, 2014"}, {"Title": "good machine...wrong operating system", "Author": "jwroc", "ReviewID": "R2N3OGEJXMW02D", "Overall": "2.0", "Content": "windows 8.1 r....doesn't run other programs already on desktop pc...lousy apps for the tablet (chess/bridge/Sudoku very poor vs ipad..sent it back", "Date": "January 26, 2014"}, {"Title": "The Best Tablet Period", "Author": "Amazon Customer", "ReviewID": "R1FN17R5Y7PEJP", "Overall": "5.0", "Content": "This is a great tablet. The feel is great and the keyboard is the best. Very happy with the build quality.", "Date": "October 25, 2013"}, {"Title": "Not for the un.....", "Author": "robert lee", "ReviewID": "R3B3VU51J82HDJ", "Overall": "3.0", "Content": "Microsoft  innovates and improve not for the general un.......I found the old windows 6 or 7 better than this.", "Date": "January 28, 2014"}, {"Title": "The hardware is decent but Windows RT is terrible product", "Author": "Nick Carrigan", "ReviewID": "R5N0KLIUNGECC", "Overall": "1.0", "Content": "Won't go into specifics as there are plenty of \"honest\" reviews of Windows RT but in my opinion it's a terrible product with too many limitations.  It looks like Microsoft is giving up on RT as well.  Don't waste your time or money.", "Date": "May 21, 2014"}, {"Title": "i was disappointed", "Author": "Amazon Customer", "ReviewID": "RBR3WU9LEFBG5", "Overall": "4.0", "Content": "good device, but I was disappointed because I could not download and use AutoCAD, Adobe Creative Cloud, and other programs. It is a nice internet device for someone consuming content, but some people like to use there computers to create content and other creative stuff. I like the size but if I cannot use the computer how I want to use a computer... I can do more on my 300 dollar laptop running windows 7 then on the Surface 2.", "Date": "March 26, 2014"}, {"Title": "Not ready for market", "Author": "James W. Eggert", "ReviewID": "R19MVZQUNFQCEX", "Overall": "1.0", "Content": "This was my second unit in less than one month. Microsoft has Major update and power on problems with the surface 2. There are work wronged for some the problems but not all. It has some nice features and size but not ready for prime time. Support on this product very poor. Stay away.", "Date": "February 13, 2014"}, {"Title": "Only good for Internet Surfing", "Author": "visayan1", "ReviewID": "R7PGKJ9BJ378C", "Overall": "2.0", "Content": "But unable to load Firefox and other programs because it does not have an app for it. Tried looking for the app in the Microsoft App Store, but it was non-existent. Had to return it.", "Date": "March 14, 2014"}, {"Title": "Surface 2", "Author": "danny y", "ReviewID": "RU874LJWSSCFX", "Overall": "4.0", "Content": "I own the surface 2 and the Ipad retina. Both have same but different uses. I use my surface as a desktop more than a tablet. Using it as a desktop i bought the wireless mouse, HDMI adapter for my monitor and the 5 to 1 adapter . The adapter allows you more options such as an additional much needed USB port. I like the abilty to use Microsoft Office making the tablet a good choice. If MS office was out of the question the ipad is probably a better choice", "Date": "December 23, 2013"}, {"Title": "Bought one because I had to", "Author": "Neil D. Mclaughlin", "ReviewID": "R137KCTQ7L5TBO", "Overall": "3.0", "Content": "It's like a giant smart phone that can't make calls. I like that the hardware meets the laptop and cell phone half way. I don't like that the software meets Windows 7 and DOS half way. It's like Windows '94.", "Date": "February 1, 2014"}, {"Title": "Great if you like an ONLY Microsoft solution", "Author": "Roy Lamberton", "ReviewID": "R1QQ2EWIZLEXVZ", "Overall": "2.0", "Content": "but since the OS didn't run any 3rd party software for web browser or e-mail, it got cleaned and returned within 24 hours.The product description should have pointed out the limitations of RT, I thought I was buying a tablet with 8.1 but this wouldn't even let me install many of the 3rd party apps that I must have on a tablet if it is to replace my laptop.It has severe limits on e-mail, essentially it only works with Microsoft Exchange - something that I avoid like the Plague.Sorry Microsoft - this one is a turkey.", "Date": "April 8, 2014"}, {"Title": "Disappointed", "Author": "J. Cavin", "ReviewID": "RBBOZN6MNMO2P", "Overall": "2.0", "Content": "I have had some serious issues with my Surface 2. I was so pumped when it came out and bought one immediately to use for school work and writing papers. The Microsoft Office programs are perfect and make doing homework on the go a breeze. My biggest problem is that my Surface 2 will not hold a charge. I will charge it over night, unplug it the next morning and by the time I need to use it in the afternoon it is already dead. It is only left on standby during that period of time, so I cannot understand what is draining the battery. I've also had issues with it just crashing. There have been several times that I have gone to turn it on and it won't. It doesn't even give me the warning for the low battery. I get nothing, a dead black screen. The first couple of times it did this, I would hold the power button and the volume button and it would eventually reboot and power back on. However, this time it won't even do that. Now I've shelled out over $500 for a tablet that won't even power on. There are also very few apps that can be downloaded for this tablet. The Kindle app was okay, but lacking. I'm also not able to watch my videos on it from my Amazon cloud. The backing on the Surface is also very delicate. I carried it in my purse for the first week that I had it and my wallet  ended up scratching the heck out of the back of my Surface. I'm very disappointed with this tablet and will be returning it today, possible for the new Samsung 10.1 2014 edition or maybe even the iPad Air.", "Date": "November 15, 2013"}, {"Title": "It went downhill...", "Author": "Dacazymon", "ReviewID": "R2W5QFQXYRYHRF", "Overall": "2.0", "Content": "I got my Surface $100 over the original price, easing my hopes even more from being a Windows guy. I open the box, pretty much no instructions. I'll give it to Microsoft, the Surface did look very cool, and I loved the stand. I held down the power key, and I went through the basic \"getting ready\" of the system. I restarted it, and it has a very fast startup! I was already pleased. I plugged it in the charge for a few hours, and as soon as I unplugged it, the touch screen was making its own responses on the screen. It was like swiping up and down the screen really fast. I locked it, opened it up again, and to get it out of the way, that glitch happened a lot. I was in my office building, and I was using the Surface (with the type keyboard), to type a few things for work. The thing cuts it's power at 80% battery. I turn it on again (with the screen glitch), and now my volume rocker is unresponsive. My type keyboard isn't recognized. It's stuck with doing the screen glitch! I had it shipped back to Microsoft within days of purchase, and this thing wasn't even as useful as a Palm Pre. I went to a Best Buy, and one of their staff this this; \"I know Windows 8 has touchscreen specialized, but it just wasn't ready for a Tablet.\" From the same store, I got the \"flagship\" Android Tablet: Samsung Galaxy Note 10.1 2014 Edition (what a mouthful!), and it is amazing. I love the pen, S Note, Battery Life, Speed (1.9 GHZ Quad Core CPU), and the OS. In summary, my Surface was defective, I see a lot of negative reviews, and this should not ow existed.", "Date": "January 2, 2014"}, {"Title": "Surface 2", "Author": "Amazon Customer \"Wendtaway\"", "ReviewID": "R1B5SLS5P8R7DP", "Overall": "2.0", "Content": "It is not as easy to use as advertised.  Many apps that I had on Ipad were not compatible with this.  Found the entire experience confusing and frustrating.", "Date": "March 31, 2014"}, {"Title": "not happy at all", "Author": "TPG", "ReviewID": "R24C42KNU104O2", "Overall": "1.0", "Content": "The Surface 2 we purchased has crashed two times in less than a month.  I am returning it.  Unsatisfactory product for a latge amount of $$$$", "Date": "January 15, 2014"}, {"Title": "Not impressed with Microsoft's Surface 2", "Author": "Eric Martin", "ReviewID": "R2VFSS3PQCNZSK", "Overall": "1.0", "Content": "#1- 32g hd space is a lie. It says 25.3 upon install, then after all the updates, it starts at 18.5g: That's 14g gone just by turning it on and updating!#2- you can't turn off the updates! So everything keeps changing, and you cant stop it, ever! So it will eventually fill up even more space and force you to accept 'their' changes to apps.#3- you can't use more than one Bluetooth device without lagging issues: Why sell a wireless keyboard and a wireless mouse, and a wireless speaker if you can't use them together!#4- you can only download new apps from their 'store':  if it's not there, too bad!#5- the web support lasted for 3 whole months, and all they tell you to do is:  \"reboot and reinstall everything from scratch.\"#6- geez, 5 is enough.", "Date": "February 18, 2014"}, {"Title": "Don't buy it.", "Author": "G. Engel", "ReviewID": "RHPIR3ETP3LGI", "Overall": "1.0", "Content": "I bought the Surface 2 to do course work on line.  There is no written documentation that accompanies it so it's hard to get started because nothing about it's operating system is intuitive.  I managed to watch a couple of online videos to get started (on my Mac).  I found it difficult to navigate around the desktop none the less.  Yesterday, during an automatic update, one of many, the Surface crashed.  It gave me some kind of Internal Power Error message. It's completely frozen. I have been unable to figure out how to repair it.  So for now, it's a piece of electronic junk, expensive junk.  I'm going to have to take it to a Microsoft store to get it unstuck.  Talk about a big pain you know where!  Don't buy it.", "Date": "December 25, 2013"}, {"Title": "What a bummer! Experience with Touch has been a huge disappointment! Charging issues....can't use if it won't charge...right?", "Author": "lala", "ReviewID": "R1FZS638GK2F8L", "Overall": "5.0", "Content": "The reason I am giving this device such a low score in this review, is based off one of the most simple concepts that I would think a reputable company would have mastered by now!!!The CHARGING mechanism/cord/plug does not work after 3 short weeks of ownership! the light does not come on to indicate charger is plugged in nor does it charge the device.  What is the use of having a useful tablet on hand at all time, anywhere........if it will never, ever charge?  Microsoft is doing something about it, but boy was it hard thing to get to get a new charger?! What if that isn't the prob?then what? Aghhhh!The screen has also become non responsive to TOUCH at times? Weird, huh? This is not what I imagined buying a Microsoft product. (current iPad owner, that charges, all the time, 3 years later)Plain disappointment. Sad face.*******UPDATE: MICROSOFT HAS SENT A NEW CHARGING MECHANISM/CORD. TABLET IS WORKING PERFECTLY, CHARGING PERFECTLY. Yes! So happy now!SO AS MY REVIEW FOR ACTUAL PRODUCT IS 5 STARS, THE COMPANY I PURCHASED IT FROM WAS NOT AS HIGH SCORING.  YES, THEY WERE GOING TO ACCEPT IT BACK, BUT I HAD TO PAY.? For a damaged product, and never did that company suggest anything like the tech support of Microsoft.Sooooooooo.......In conclusion, BUY THIS PRODUCT DIRECTLY THRU MICROSOFT, UNLESS YOU DONT MIND JUMPING THRU HOOPS FOR A \"cheaper\" priced item!", "Date": "January 17, 2014"}, {"Title": "DECEPTIVE SELLER", "Author": "Chris V", "ReviewID": "R3DGFTFS4XV472", "Overall": "1.0", "Content": "The keyboard in not included in the sale. You have to enlarge the picture that shows the keyboard to see that it is not included.I hate returning items, but this kicked my hat. I will get the Lenovo Yoga 2 instead. Microsoft has some guilt in this by making the keyboard an accessory and selling it as a cover. Maybe techies out there have no issues with this. I do. I absolutely do not tolerate deceptive selling techniques. There is way too much deception in sales. [PS - I have a major in Sales and Sales management]", "Date": "March 27, 2014"}, {"Title": "BUYER BEWARE - NO MACROS (VBA)", "Author": "ATBOD", "ReviewID": "RYJVFXCIZG00M", "Overall": "1.0", "Content": "If you are thinking how great it is that this tablet is loaded with Office, think again. It's loaded with a beginner's version of Office. A stripped-down version that is meant for novice work only.Excel on this tablet has NO macro support.You can't open a macro, you can't run and macro, and you can't write a macro.Here is what Microsoft hides in it's FAQ (which requires digging to find - and which I only found after having wasted money believing that this thing came loaded with Excel - AS ADVERTISED).From the FAQ:Does Office 2013 RT include the same features as Office Home & Student 2013 and Outlook 2013 on my Windows 7 or Windows 8 PC?Almost - The Office 2013 RT version of Word, Excel, PowerPoint, OneNote, and Outlook applications include the vast majority of Office Home & Student 2013 and Outlook 2013 features available on PCs, and nearly all the features most customers use. But because tablets have special needs for security and mobility, a few features are unavailable in Office 2013 RT applications, including macros, add-ins, and other custom programs written by users or developed by third parties.Thanks Microsoft. You couldn't state that up front? You had to bury that off in an area that requires searching?\"Almost\".Yeah, almost Excel. But they call it Excel, not \"Almost Excel\" when they advertise it.So no, this is NOT a \"productivity\" tablet. It's an \"almost productivity\" tablet. Therefore it's \"almost a real tablet\", and \"almost an actual productivity tablet\".So save your money and buy a REAL tablet.This tablet is a poser when it comes to real tablets, and falsely advertised as a productivity tablet.WASTE OF MONEY!!!!!!", "Date": "November 12, 2013"}, {"Title": "Way to hard to use", "Author": "Grant Lankard", "ReviewID": "R306LZKSVM8LBL", "Overall": "1.0", "Content": "Way too difficult to use. Even simple tasks take 4 or 5 steps. Almost everyday I find something that I wish it did that it does not.Super frustrating.", "Date": "February 10, 2014"}, {"Title": "Microsoft Will NOT Support Their Products", "Author": "Matthew D. Weidner \"weidnerlaw\"", "ReviewID": "R3DSIRYF8K12ZP", "Overall": "1.0", "Content": "I bought a Surface, dropped it from a very low height and it completely cracked....so first up, the product is very flimsily created...read all the other reviews on this subject area.  If you are not planning on sitting on a couch with this device or having it encased in a bulky protector....go with a more solidly created product. Next...ever since i cracked it days ago, I've been trying to speak with any person from Microsoft who could even tell me if it's possible to get it fixed.....It's been days and days and days and I cannot even get close to any communication from a human.  No phone. No email. No text.  The only support options are logging onto their website, but if you don't have account info, they will not let you through to get customer support.  And guess where my account info is?  IN THE DEVICE THAT IS BROKEN.  And so because my device is broken, i cannot get support to fix it.  See how that works?  So the product might be fine as long as it's not broken, but if it's broken, you get no service.  I've been on the phone for 40 minutes now...nothing.  I give companies like ASUS a lot of credit...they have live operators that immediately pick up the phone and help....not at all so with Microsoft...here i sit...on the phone...it will probably be days before the finally tell me, \"we're sorry sir, your device is broken and because it's broken, we cannot help you.\" Oh wait....here someone finally picked up....42 minutes later...", "Date": "February 21, 2014"}, {"Title": "Advertised price is a crock", "Author": "Kindle \"As you may be able to tell from the f...", "ReviewID": "R2ICCW3F04TK5T", "Overall": "1.0", "Content": "Sorry, this is not an actual review of the Surface 2.  I have not purchased this device.  This is a review of this web page.  Microsoft's full retail price for this device is $449.  Amazon seems to be offering it for $488 - with an entirely fictional retail price of $800.  You get to save a fictional $312 by purchasing it from them.  That's a crock of stuff.  Amazon needs to correct this page.", "Date": "January 31, 2014"}, {"Title": "Device did not last that long.  After 2 weeks battery would not take a charges.", "Author": "Fred Desiderio", "ReviewID": "R34H9XTM4G3JCQ", "Overall": "1.0", "Content": "Device did not last that long.  After 2 weeks battery would not take a charge.Returned item for refund.  Going to buy a Mac.", "Date": "January 19, 2014"}, {"Title": "cannot run even the most basic programs", "Author": "Patrick", "ReviewID": "R1H1LJX4YA96O1", "Overall": "1.0", "Content": "When I first saw this tablet I thought It was really cool, and even better that I could get one in the cheaper price range.  However, now that I have I've found that I can't run even the most basic of programs.  Windows Movie maker I was the most surprised about because it was their own program.  But I would not suggest buying this tablet.  Other programs it cannot run, Google chrome, Java, adobe flashware, it can't even run pivot.  And now after only owning it for a month and a half the screen is starting to have an issue. A bar of black and white flashes on the screen.", "Date": "November 28, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00FF6J532"}}