{"Reviews": [{"Author": "Maverick Vailladin \"Vail\"", "ReviewID": "R35DUJN7YGCJ21", "Overall": "4.0", "Content": "The reason I bought a surface pro 2I have been looking for a way to eliminate the need for my iPad and my bulky work laptop and still be able to perform any and all work related or personal tasks at the drop of a hat.  I tried to add apps to the iPad like quick office and others to help in editing and doing simple xls functions, but I found it was not enough.  I looked at ultra books and 2 in 1's and convertibles.  None of those options gave me the true flexibility and performance that I was looking for.What I wanted was, the ability to do complex excel tasks (pivot tables and more), manage my email in a familiar and productive way, keep up on my news and social networks without having to go to each web site individually, edit photos, presentations and even create marketing materials, and most of all I wanted to use this as a tablet and still retain all the functionality of a \"PC\"The greatSpeed and Power: The Surface Pro 2 is FAST, I have tested it running most programs and games that I reserve for my gaming/PS PC and it handled them with ease.  NOTE: if you are a gamer, you will be able to run most newer games on this, BUT at med to low graphics at best,  it's a good way to quench your jitters while on the road or away from your gaming rig but in no way a replacement for a gaming PC.  Photoshop and other intensive programs it is more than capable off (add in the stylus and PS becomes so much better!)Full Office:  Selling point for me, I can install most any program that runs on my regular PC and it adds in stylus/touch controls.  See my notes about Office 2013/365 in the \"not so good\" section below as I am running office 2007.Type Pad 2:  This is a great accessory, I could add it into the bad section because you have to pay for it, but it is well worth the extra cash, backlit and very easy typing compared to full-size.Stylus:  I bought about 10 different stylus for the iPad for drawing and editing photos, the active stylus on the surface blows them all away.  If you like to take notes with pen and paper, you will not notice a difference when using this stylus/tablet combo.Size:  Compact, easy to open and start working, and a good form.  At 2 pounds, some people might pass on this, but keep in mind you have a full windows 8 operating system on board and an i5 processor.  The weight compared to what's under the hood is completely acceptable for me.Battery Life: rated at 7 hours doing regular activities is much less than the \"competition\" but again, for what you get in comparison to an ultra book or 2 in 1 this thing rocks!  I can get thru a full work day without having to charge and it does charge to full in a couple of hours.Windows 8.1:  I put this in the middle of the road; this OS is defiantly coming along, but will take some getting used to be patient with it, it is a lot easier to navigate and manage with a touch screen.The not so greatThe windows app store: Is not there yet, some of the apps are great, but you will find they are higher priced than you are used to paying in the google play or App store.  As more people get into windows 8 we will see more, quality apps coming thru the store.  You will sacrifice some of the cool/fun apps you get on your iPad, but you will quickly find ways to replace them.Glare: You will get a good amount of glair in some situations, you can turn the brightness up to counter this, but then you are sacrificing some battery life.Wifi:  The built in Wifi card is terrible, sitting next to my AP I could get 3MBPS Down and 10 UP (I have 50/25 service) I connected a USB wifi dongle that I have and got 50down/25up immediately.  I am not sure if this can be fixed with firmware updates or not, but it is defiantly a major issue for me.  Doing the basics it isn't overly noticeable, but when I want to download a large file I connect the external USB adapter to shave days off of a download.Office 2013/365:  If you use google sync or other mail services with outlook, do not download the free trial of office on this, it is highly unstable and in compatible, save yourself the time and install office 2007 or 2010.Initial set up:  It took me about 6 hours to get this set up the way I wanted it, between installing all my programs and playing with the live tiles and setting up syncing with all of my other cloud services.  It took longer than I wanted it to, I hesitate to say this is a negative, its more of a warning to be prepared, you are not going to turn this on and DL some apps and get to work, it's a full blown PC and you will need to take some time to get it how you like it.Some of the things I have listed as positive things can be taken as negatives depending on what you are looking for out of the surface pro 2.  This product is not for everyone if you are just looking to be entertained, go get an iPad or Android tablet.  If you are looking to be multifunctional and completely capable of anything at the drop of a hat, then this is the device for you.  I recommend this for road warriors and workaholics alike, it can replace all other devices.  Casual/social media hounds will find this heavy and clunky and are better off with an iPad.I am only giving 4 stars because the Wifi issue really bothers me, it's like buying a high end sports car and putting 87 octane gas in it.", "Title": "If you were looking for more from a tablet, you found it", "Date": "November 3, 2013"}, {"Author": "Mike Twain \"Mike\"", "ReviewID": "ROMYC8ZVHDBTF", "Overall": "5.0", "Content": "I purchased the original Surface RT tablet. Mostly out of curiosity. It was \"interesting\" I bought the \"Touch\" keyboard with it. The touch keyboard really does a disservice  to Microsoft and to the device. It DOES work, but not well enough. It was definitely a first cut at it.Several months later my wife wanted a new PC. She was dumping her Mac because it didn't support the apps she used at school (she's a teacher). So when I looked around, I considered the Surface 2 Pro.First Impressions-----------------------The Surface Pro 2 is a very handsome piece of hardware --but moreover, it's different. Microsoft really has created a new category here. This is a tablet, but definitely not an iPad --it's a lot more. It's not a laptop in the traditional sense --but it does what your laptop used to do in a slick form factor. The materials are quality through out. The color keyboard (I chose the Magenta Type 2) looks and feels impressive. When the wallpaper is matched to the keyboard color it really looks unique. To borrow a word that Apple \"owns\" the coordinated keyboard and wallpaper colors --they really are \"beautiful.\"The screen is excellent quality. It definitely made me want to look at it. The touch screen works well. It did make me want to touch and play with it a bit.The keyboard is great. It's a smaller than the MacBook Air I use, but it is great to type on. Actually I'm finding typing on the MacBook a little slower now, as it feels like the keys are a bit far apart now. That's just habit from using her Surface --but indicative of the device I now pickup when I go to check the news or do a quick search.You can't adequately see or feel the first impression this tablet makes online. It's very good. Overall, my wife was very happy when she first saw it --and she's doesn't like change, didn't know exactly what it was (\"well is it a tablet or a laptop?\" she asked). She was all smiles. Home run first impression.Experience with The Device--------------------------------------The kickstand is a truly defining feature of this product. The Surface Pro 2 introduced a two position kickstand so you could adjust the position of the screen depending on the way your sitting. It's very helpful if laying on the couch and working.The battery has been fine. No complaints. We generally do keep it charged, and let it run down periodically, though we're not as good about either as may be ideal. It just works, and that's good enough for us. There was one time we let it run down to \"beyond zero\" --and the device wouldn't start. When we plugged it in, it still didn't start and we panicked a bit that it had for some reason become a \"brick\" --on another machine I went to the Surface online help --which is overall much better than any online help experience I have had with Windows. It's another big change for Microsoft products. It made another positive impression. While going through the online help we were able to restart it, there may be some reserve space in the battery that charges for a good reason before it starts up --perhaps to ensure there's enough battery left to ensure an orderly shutdown when the battery is about done and your not near a charger, or forgot about it like we did.The feel of the interface is generally good. Swiping is nice. I installed Chrome since that's what we were using on other devices, but it really didn't work as well on Windows 81. as it does on Mac or Windows 7. My feeling is Google is not wholeheartedly supporting Windows 8.1 --no point in helping Microsoft get a tablet adopted among Google's browser users. Internet Explorer is fine however, it's a fast browser and pretty snappy experience to use. It does take some getting used to, instead of ever-present tabs, it's full screen web browsing and you access open \"tabs\" with a flick up from the bottom of the screen. Full screen browsing by default is interesting. Again if you're only using this device, you'll likely expect that, my feeling is it's a good experience on a touch based device like this.Office came preinstalled, as a trial. Office is now downloaded only I believe --good as their is no optical drive on the device, and you really don't need it anymore. Broadband has effectively killed external media at large. Office is good. A bit different in the all touch interface. I used an early version of the Cloud based Microsoft Project and it was pretty bad --they released it way too early. The core Office product at this point is pretty good. I'm guessing they are going to keep refining it as they get more and more Surface users. Supposedly they sold almost a billion dollars of Surfaces in 2013 so that trend may accelerate.The number one reason I bought my wife a Surface was she had an app that she needed for school that she couldn't run on her MacBook Air (which I got her the prior year for Christmas). She installed it on Windows 8.1 rather quickly. While the vendor did not have a Windows 8.1 or touch specific version yet --they showed clearly on their website they were supporting Windows 8.1 --which is another way of saying that your \"old\" Windows 7 apps work on the Surface and with 8.1.The Surface runs updates frequently and keeps itself current. I believe we set it to do that automatically, which in general is a good idea. This Surface came with 8.1 installed which was a substantial improvement over Windows 8. The rumors that Windows 8 shipped incomplete are probably true. This device like took a hit in the court of public opinion --which was also probably muted due to low sales of the device on the first release. I almost never use my Surface RT version 1 anymore after using the Surface Pro 2 --it's a huge leap forward --and granted it's a lot more money.The Stylus--------------Our first reaction was to ignore the Stylus. I've had phones that have them and found them all to be a waste. My current Galaxy Note 2 has one and software to go with it and I don't. No utility at all.The Surface Pro 2 Stylus and character recognition software however simply works. I was surprised to see how well. My handwriting is pretty bad after so many years of touch typing and a very digital career, but the stylus is a 10. If or when I get a Surface tablet (Surface 3?) for work --and It looks like I would-- I can see myself using it to take notes in meetings. Right now for me personally, I don't use it much because I don't need to --I type relatively well.The Stylus attaches magnetically to the power port on the device. This isn't brilliant per se. When you leave the device there is no way to keep the Stylus with it when it's charging --since the power cord is attached.The Power Cord----------------------The power cord even looks cool and is made of a very flexible rubbery material. More like a mac, but I think better. The cord is a soft matte black. It looks good and matches the device aesthetically very nicely. The magnetic connector is great --a nod to Apple's Mag Safe connector. It has a little light integrated into the tip that shows it's charging. To attach the  cord you only have to touch it to it. It snaps in magnetically pretty reliably. My Surface RT didn't do that so nicely at all --but they got it right on this version.App Store, Music-----------------------There aren't as many apps on the Microsoft App store, but they have all the big ones that \"everyone\" uses: Facebook, Twitter, etc. There are some really good games. I'm not much of a gamer per se, but our kids love them. There is a race car game that really shows the speed, screen quality and power of the device. The call it Xbox Games as there is apparently some connection between the Surface and the Xbox is you have one. I'd have to guess they are going to continue to drive hard at making those connections more valuable over time --though we don't have an Xbox today.Xbox Music is neat --free streaming music and you can pick songs. The interface is really attractive. They are clearly motivated by iTunes dominance to make it work well, and it does. You can import your music from the device into the Xbox Music cloud.Ports-------Having a USB port is very big deal for a laptop type device. My wife plugged in her inkjet printer and it just worked. That was very important for her as a teacher. She also has a wireless USB mouse she liked more than the Magic Mouse with her Mac, and plugged that in, also worked effortlessly. A \"tablet\" with a mouse is nicer than you might think. I like using the mouse with it, though I notice certain things I \"naturally\" reach up and use the touch screen. The work together well on the device --which was unexpected as well, and probably a consideration.My wife is one to get bored with devices (laptops, tablets) but she seems to always be on her Surface Pro 2. Microsoft produced a device you can buy and appreciate here after stumbling badly with the original RT device I bought.I would highly recommend it to anyone considering a new laptop, or a new tablet. If you use Office heavily, it's a no brainer --but interestingly enough, if you aren't a heavy office user it's still pretty great. If you like to use a tablet more recreationally, as we do, it's at least as engaging and useful as the iPad --the proof is we have 2 iPads, and virtually never use them anymore. I think that could be a big statement in itself it does render the iPad a little \"obsolete\" in our household we gave them to our young kids.5 stars for the Microsoft Surface Pro 2 and Type 2 Keyboard.", "Title": "Surface Pro 2 - The Most Evolved Tablet Ever... Really.", "Date": "February 1, 2014"}, {"Author": "Frank R. Anderson \"Sluffmo\"", "ReviewID": "RA3P4BRYJ5R5", "Overall": "4.0", "Content": "I have owned the Surface Pro 2 for about a week now, and so far I am generally happy with the tablet itself. Unfortunately, this is hurt by general accessory and support issues.SUMMARYThe tablet portion itself works great in pretty much every regard, has decent battery life, and is well designed (Outside of the pen dock being the power connection as well).The accessories are less spectacular though. The keys get stuck on the type keyboard, and the mouse is uncomfortable to use for long periods (Just plan to get a bluetooth mouse). The docking station is hard to find. Customer service from the Microsoft store is less than stellar at times as well.PROS* It runs very smoothly even when doing more complicated things like excel spreadsheets with heavy duty calculations.* The screen looks great and doesn't have any crazy discoloration issues like the Yoga 2 and Samsung ultrabooks. The 1080p screen is just fine for the size as well.* Windows 8.1 is significantly better than 8.0. Changing device settings is noticeably easier, the included mail/calendar type apps are much better now, and the general flow of its usage feels good to me. Although, I'm sure this is a matter of taste.* The pen works really well for the most part. My wife owns a galaxy note 8\" as well, and the Surface's pen feels better in your hands and has a built in eraser. There are some issues, but I'll talk about them in the cons. Touch input is smooth as well.* It's really well made. I've used a ton of laptops and none of them have felt this sturdy. Sure, some of the talk about how everything sounds like a luxury car is fairly ridiculous, but not a single thing feels flimsy or easily breakable like the 8\" note or something.* I know that others have commented on the weight, but this is really a matter of interpretation. I still use my ipad if I need to travel really light and need a longer battery life, but if I need something for any sort of productivity work then the Surface has definitely become my go to system. In this sense I expect it to be a bit heftier because it does so much more. I found that flipping out the stand while you hold it makes it much easier to hold as well.* You aren't going to get 12 hours of battery life out of this, but you will get 6-7 if you use it like I do. I'm very happy with that.CONS* The keyboard is terrible. After only a week the keys have started sticking on me, and more than a few times I have found myself hitting multiple keys to figure out which it is. Even stranger is that sometimes it will just stop responding at all until you find the stuck key.Also, the touch mouse is just a pain to use. It will randomly stop doing two finger scrolling, but if you barely touch the thing it will start randomly clicking things. This gets annoying when you are using the pen or something and suddenly it jumps to another program. If I use it a lot it rubs my finger raw as well since it isn't smooth. I ended up buying an arc mouse.The worst is that there is no keyboard support at all when trying to get into safe mode. A work program I installed crashed Windows, and when I got to the screen where you choose what type of safe mode you wanted to enter I couldn't choose a number. That was with a usb keyboard and the surface one.* The pen should have it's own dock. End of story. It is ridiculous that it uses the same spot as the power cord connector. So, anytime your computer is plugged in you need to find a place to store the pen if you aren't using it. It doesn't take a rocket scientist to realize that this results in losing/misplacing the pen eventually.Also, it doesn't always do a good job of turning off touch input when you use the pen. This get's pretty annoying at times when you are writing something and suddenly the pen stops working. Then when you lift your hand your palm drew something.* I want the docking station for work, but it is impossible to find unless you want to spend $300+ on ebay. I would be okay with waiting, but Microsoft's policy on the dock is ridiculous. I called my local store to ask if they had any, and they will not tell you if they have them in stock or not. You have to drive to the store to find out if they have them at all. I was told that they do this because they cannot guarantee that it will be there because it sells out so quickly, but if your system says you have zero docks then there is absolutely no reason to make me waste my time driving there. I drove to the store and found out that they hadn't had them for over a week. Terrible customer service.HOW I USE* Significant MS Office usage including VB excel development.* Web design (Coding using Sublime Text mostly. I haven't tried photoshop or anything on it.)* Remote server administration (Putty, mySQL tools, etc.)* General computer use (Web, e-mail, twitter, etc.)* Taking notes for my night class (Onenote is amazing on windows with pen input and a rear camera. The surface does not disappoint).", "Title": "Great tablet with substandard accessory issues and support.", "Date": "November 8, 2013"}, {"Author": "MyTwoCents", "ReviewID": "RHU6N7S3AQE59", "Overall": "5.0", "Content": "Pros:- Full desktop version of Windows 8 (if you don't like the whole Metro thing, starting to the Desktop should keep you happy)- Responsive and solid digitizer pen support- Good battery life (for its level of power)- Beautiful display- Able to run programs off of microSD- USB 3.0 supportCons:- Expensive- Somewhat heavy for size- Only one size available (small-ish screen)I've had the Surface Pro 2 (128GB version) for a little while now, and I can tell you right away what it's not—your standard tablet for playing around and checking your email. Yes, you can do those things on the surface pro, but if that's all you're looking for, there are plenty of other options that will be better suited to your needs and cost you less. What the Surface Pro 2 *is* good for, however, is providing an all-in-one experience that has the ability to take the place of your tablet, digitizer, notebook, and in some cases, even your desktop.I no longer need my Galaxy Note 8.0 for taking notes at work, my iPad for lounging around checking emails and browsing the web, my Wacom drawing tablet for illustrations, or my Mac Book Pro when I need a bit more power. Don't get me wrong, I love[d] those devices, but the Surface Pro 2 has taken the place of all of them. I have done everything on my Surface Pro 2 from playing around with apps and responding to emails, to sketching out illustrations in Photoshop and playing Skyrim on my Steam account. Heck, the only thing it hasn't replaced is my desktop which I'll need to keep around because I am a heavy gamer and also do intensive video editing. If it weren't for that, the Surface Pro 2 would be the only device I'd keep around aside from my phone and Playstation.While I initially found the Surface Pro 2 a bit too expensive when I was first looking to purchase it, considering everything it has been able to replace, it has literally been able to pay for itself. For my unique set of needs (mainly unique due to needing a high-end digitizer and Adobe Creative Cloud support) this is the best device I was able to find, and it is completely worth the price. I can only hope that technology will continue to advance to the point where I will be able to replace my desktop as well.Your mileage may vary based upon your needs, but I, personally, am extremely satisfied and a bit pleasantly surprised as well.2¢", "Title": "Not the best option for everyone, but the perfect option for some.", "Date": "December 6, 2013"}, {"Author": "A. Antonio \"CMDTA\"", "ReviewID": "RZZUQ86N5ZD57", "Overall": "4.0", "Content": "Once again Microsoft shot itself in the foot.  They made an amazing tablet and then tanked it with poor decisions.The Surface Pro 2 is a blazingly fast Windows 8.1 tablet / laptop hybrid. This is basically a laptop without a keyboard. It comes with a decent amount of storage compared to some of the other high end tablets which is a nice plus and it's somewhat expandable via a usb hard drive or even an optical drive.The battery life isn't the best but considering the power packed under the hood that's an acceptable compromise.The ports are a very nice plus.  I know you can technically do almost anything without the ports but I'm lazy.  I don't want to use software to try and pass files around and hope everything is synced up.  I want to just shove a cable in and go.With the ports included you could turn the Pro 2 into a full blow desktop PC with minimal effort. This gives the product great flexibility that some other tablets just cannot offer.Now for the bad.This is an awkward tablet.  It weights a little too much and is a little too thick. I wish they had found a way to trim it down.  That issue though would not prevent this from being a five star product.What prevents it from being a five star product?  The value. The problem is this product breaks even on value.  At it's price point a lot of people are going to walk away because they do not see the value.  They will either go with a more traditional tablet, a much cheaper hybrid, or if they need the power a small high end laptop from Samsung, Sony, or Apple.Microsoft could have crushed the market by adding just two things.1. Include Office.  Microsoft owns the software so it would not cost them much to add office but it would put the value over the top.2. Include the keyboard.  Most people will end up paying around 1150 for this tablet because it does not include a keyboard.  With the keyboard included this is a MUCH better value.Overall this is a powerful tablet / hybrid that is going to find a very niche audience.  Most people are going to skip it because they can even get the high end iPad for less or go with a fully functional Kindle Fire HD / Android tablet.", "Title": "Could Have Been 5 Stars", "Date": "October 30, 2013"}, {"Author": "Rebecca Bowen \"Rebecca\"", "ReviewID": "R2A0SO1SDDIAO1", "Overall": "3.0", "Content": "Liking the Surface Pro 2 (or the Surface Pro) tends to be dependent on several things, most importantly do you need a full Windows operating system for how you work or play on your computer?  As a tablet, the Pro is bulky and not easy to handle, and unlike the Kindle HDX,  iPad, Galaxy Note, and Asus or Nexus tablets, you really have to use it in landscape for it to feel comfortable in the hands.  IMO, it's unweldy as a tablet in portrait mode. Further, the stylus and handwriting recognition are good, but if your main reason for purchasing a Pro is for drawing or tablet writing, the Samsung Note series does a far better job with this capability seamlessly than Microsoft does. I've also found that reading on the Pro or Pro 2 is ok but not terrific - even with Clear Type enabled, text clarity on the Pro 2 is not close to the fine grain constancy of tablets I mentioned previously.Combined with the lit Type 2 keyboard, the Surface Pro 2 is best viable as an ultralight laptop replacement in mobile work environments. Games, even graphic intense ones, run flawlessly on this unit.  It you're using it for work with a enterprise Citrix environment, it's terrific especially paired with a Microsoft Wedge or Arc Mouse and the keyboard. If you're hedging about getting the original Pro or the Pro 2, get the Pro 2 if for nothing more than battery life, which I've gotten 8 hours out of with continual use.In a nutshell, I'd recommend the Pro 2 with the Type 2 lit keyboard and a mouse for those folks who need a full Windows operating system and want handwriting recognition - otherwise the Surface 2 (with Windows RT) might be a cheaper, thinner, lighter alternative.  For those who only need or want tablet only capability,  the world is your oyster as far as tablets are concerned, many of which are substantially better than the Surface Pro, Pro2 or Surface 2 as a tablet experience.", "Title": "How You Like It Depends On What You Do With It", "Date": "November 10, 2013"}, {"Author": "C. Wilsted \"Amarron\"", "ReviewID": "RLNXS98U2AWAF", "Overall": "5.0", "Content": "This is everything i thought my iPad was going to be a few years ago. By saying that please do not misunderstand. I do not believe this is in the same market as people looking for an iPad or samsung ect.When I bought my first tablet, i thought it would be a laptop replacement. Instead what i got was an oversized iPhone. great for facebook and angrybirds, but not for school and definiatly not for work.Standard tablets are media consumption devices. by definition they are primarily for entertainment purposes. talented programmers have managed to create some ok apps but nothing that really allows me to leave my laptop at home.The Surface Pro 2 allows me to ditch my old laptop all together. It is a bit pricey but i have paid more for far less convinient items. Some complaine about the weight. Havent seen had any problems with that myself an my 5'0\" wife thinks the weight is fine as well, saying she likes how sturdy it feels.I agree with the other reviewer who said this could be imporved by including Office for free. I wish they had for the sake of future sales as I would like this form of hybrid tablets to become the new standard. The inclusion of the keyboard in the package would have been a great addition too but I'll survice. my only real complaint is they include a very handy and very responsive digitizer pen, but nowhere really to put it that is truly secure.Based solely on the product itself I believe it is the first truly 5 star tablet.", "Title": "Fantastic but not yet perfect", "Date": "November 1, 2013"}, {"Author": "Chaz Ashley", "ReviewID": "R1D0ZC2FJVVUYF", "Overall": "5.0", "Content": "I'm an artist who for years worked on a wacom cintiq 12wx, a really nice device with some issues; it has a breakout box and power brick really tethering you to your PC and the screen isn't very accurate with colors, I really had to triple check colors as my yellows would appear green on everyone else's screen and my 2nd monitor.I've been dying to get off my PC lately as I am tied to it for entertainment, work and communication, no tablet provided what I wanted though, I wanted to do art, and for that I want the software to back it up and no android or ios tablet can do photoshop.The Surface Pro 2 has full windows 8.1, has a wacom tech and capacitive interface with an i5 processor in it, it's literally a portable cintiq. How portable? 8x11in 300dpi photoshop file+other misc sized docs+firefox+winamp on balanced battery with no lag in PS got me 6+ hours of work time. Mind, freaking, blown. The pen is accurate, colors are more so than my cintiq and this just has a tiny little power brick. I DO recommend anyone getting this for any reason to get the type cover 2 as it adds in a lot of functionality plus acts as a screen protector. It's a fantastic keyboard and does it's job well ...as I'm typing this review on it in the comfort of my living room.Again, you can install any art software you want as it's full windows, even Zbrush works well on this if youtube vids are to be believed.It's also a gaming monster, I've played Borderlands 2, Orcs Must Die 2, Torchlight 2, Skyrim, Mass Effect 1 & 2, Rayman Origins, Saints Row 3, Serious Sam 3 and they all work on mostly high settings 40-60fps. This is on a TABLET SIZED DEVICE, it's absolutely mental, tiny screen bothersome? Get a 10 dollar minidisplay to HDMI converter and play on your TV or monitor and you can use  a 360 controller because it has a USB 3.0 port.So anyone knocking this for not having as many apps as the ipad isn't very bright, Surface can do real professional art, music  programs, you can play full PC games on it, you can  play old DOS games on it, you can do anything a PC can do, use a second monitor with it, expand it's memory with a microSD card or USB3 device. This device outperforms the iPad and has more programs than the ipad has apps.I do not think this device is for everyone however, as I do art and want to work on the screen with a pen it's a no-brainer:Cintiq 13wx is 1k, Surface Pro 2 is 1k and it's portable and doesn't require a PC. So call it expensive, it's still easier to swallow when you look at it like that. But if you're just looking to screw around on websites or play really simple games? Maybe an android tablet, iOS or Surface 2 would be better as they are, far far cheaper.But if you want a tablet, that will do PC tasks on? This is your tablet. Get the 128GB or higher, windows eats about 30GB itself leaving you with 90GB of SSD storage. You CAN expand it with a microSD card (I did, and run games off it too) or a USB3 device.", "Title": "An artists perspective.", "Date": "February 10, 2014"}, {"Author": "Jeremy", "ReviewID": "R1UPD9Y8KEKXTX", "Overall": "5.0", "Content": "Background:I work from home, and spend an obscene amount of time on a PC everyday. I have used some variation of the netbook for the past 4 years. I bought an ASUS Q200 last November because it incorporated a nice touch screen into the netbook. While the touchscreen forever changed my thought process on how laptops should be made (always trying to touch the screen on other, non-touch laptops), it was more of a novelty because the keyboard stood in the way. So, for the past 4-5 months, I've been looking for a full-fledged Windows PC, but either in tablet form, or with a removable keyboard. Although I wanted a highly portable machine, I generally have my PC docked to an external monitor about 75% of the time.Why I chose the Surface Pro 2 vs. Surface Pro vs. Dell Venue 8:I know, I know, the Venue 8 really isn't in the same class as either SP, but it was a worthy contender and I nearly purchased it the day I bought my SP2 (a few days before Black Friday). However, I wanted a PC with better specs than what I had, and while the Venue 8 is quite powerful for its size, it wasn't the best option for me. Add to the fact that there are almost 0 ports, it was clear that I would be better off with a Surface Pro, despite the massive price difference.Although I love new technology, and used to follow its progression every week by viewing Best Buy ads, I've found that I am unable to keep up with all the new advances. Therefore, I didn't even know the SP existed until a few months ago, and by that time the SP2 was announced. Once I heard about the SP, I read EVERYTHING I could about it, and absolutely fell in love with it. I made numerous trips to a local PC store just so I could play around on it. That said, I was anticipating the SP2 even more, only because of the presumed price drop on the original SP. Sadly, the real price drops were on the Surface RT, and the $100 price cut in the original SP wasn't enough to make me bite.Since the price of the original wasn't too far off from the newer model, I decided it was best to \"future-proof\" my decision, so I stepped up to the SP2. First, I'm 100% happy I spent the extra money. Although the change in the kickstand may seem somewhat trivial, I can't imagine having only one option, and while I never used an original SP without a charger, the battery life on the SP2 is phenomenal, totally blows away my Asus Q200 (again).Quick list of Pros and Cons:I've only had the PC a week, and I haven't run benchmark tests or anything like that (you can find this info elsewhere) but I can provide some of the experiences I've had so far. First, the cons:1). The headphone jack wasn't working out of the box, I plugged external speakers in and it updated a driver for the mic, but it never put sound out. I had to downgrade the audio jack driver and it seems to work fine now.2.) I've had a few instances where the touchscreen/stylus stopped responding, but I've found that if I reconnect the keyboard, it will register touch again. There are also times where I can't get the pen to work on webpage links, but I think it's because I'm using Firefox.3.) Maybe this is too much information for the review, but my hands sweat ( A LOT ) so the cloth material that the type cover is made out of will undoubtedly get nasty over time.4.) This is more of a Windows 8 issue but the App store selection is borderline non-existent, even for basic programs/websites. I'm not a huge app fanatic but I do like how well they work, when they're available.Now, if you're still with me, it's time for the pros!1.) Speedy, beautifully made computer. I've used as a tablet, laptop, work machine connected to my monitor, pleasure machine connected to my projector, and have loved EVERY SINGLE MINUTE of it. I've never owned a PC that could play resource-intensive games, but I had the SP2 running Dark Souls (after running some patches) and it looks amazing, better than my PS3, and it runs just as smooth. When you add in the fact that I generally have a dozen or more webpages open, plus a few large spreadsheets and who knows what else, while running on battery power, it's simply amazing.2.) The included stylus is amazing, it's so much better than using a mouse (in most instances). The handwriting recognition and palm-blocking technology are brilliant....I only wish I had more of a use for them, perhaps I should try out grad school! It's also a lot of fun using in the Fresh Paint app, who would've thought I could be so artistic.3.) The design is wonderful. I've always rolled my eyes at my Apple-loving buddies because they held their devices in such high regard, where I would only see my PC's as a useful tool. However, I see the SP2 as much more than a tool and I'm hoping it revolutionizes the mobile PC world.4.) While I expressed dissatisfaction with the lack of Apps, I really, *REALLY* love Windows 8.1. I've run into some compatibility issue with games, but I'm sure someone will figure out how to patch the issues eventually.Conclusion:Definitely the best upgrade in technology I've ever purchased. Almost as revolutionary for me as my upgrade from an old cellphone to an iPhone 4. Fairly expensive, part of me was yelling \"wait until the next new thing comes out\", but I just couldn't wait that long. I'm sure this time next year the market will be flooded with similar devices, hopefully much cheaper, but for now I couldn't be happier.", "Title": "Loving my new Surface Pro 2", "Date": "December 4, 2013"}, {"Author": "WiseShopper", "ReviewID": "R2WWOD6O2WLE5L", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo26W3IQYOVIQCUembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo26W3IQYOVIQCUrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo26W3IQYOVIQCUchiDiv\").innerHTML = document.getElementById(\"cv_mo26W3IQYOVIQCUhiddenPre\").innerHTML;\n};\ncv_mo26W3IQYOVIQCUrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo26W3IQYOVIQCUso;\t   \n\n\nfunction cv_mo26W3IQYOVIQCUloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo26W3IQYOVIQCUso = new SWFObject(swfLocation, \"cv_mo26W3IQYOVIQCUAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo26W3IQYOVIQCUso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo26W3IQYOVIQCUso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo26W3IQYOVIQCUso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo26W3IQYOVIQCUso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo26W3IQYOVIQCUso.setAttribute(\"height\", swfHeight);\n          cv_mo26W3IQYOVIQCUso.setAttribute(\"width\", swfWidth);\n          cv_mo26W3IQYOVIQCUso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo26W3IQYOVIQCUso.write(\"cv_mo26W3IQYOVIQCUflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo26W3IQYOVIQCU', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo26W3IQYOVIQCU';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo26W3IQYOVIQCU', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo26W3IQYOVIQCUloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo26W3IQYOVIQCU\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1PYXFEYRKRNMS\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1PYXFEYRKRNMS\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2WWOD6O2WLE5L\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1PYXFEYRKRNMS/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo26W3IQYOVIQCUduration')) {\n      document.getElementById('cv_mo26W3IQYOVIQCUduration').style.display='none';\n    }\n    cv_mo26W3IQYOVIQCUloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo26W3IQYOVIQCUloadSwf(movieID, playerVersion) {\n   return _cv_mo26W3IQYOVIQCUloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo26W3IQYOVIQCUnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo26W3IQYOVIQCU', 0, h);\n}\n\nfunction cv_mo26W3IQYOVIQCUresetPlayer(w,h,bw,cc) {\n  cv_mo26W3IQYOVIQCUnewHeight(h);\n\n  cv_mo26W3IQYOVIQCUso.addVariable(\"resetBandwidth\", bw);\n  cv_mo26W3IQYOVIQCUso.addVariable(\"cacheCode\", cc);\n  cv_mo26W3IQYOVIQCUso.setAttribute(\"height\", h);\n  cv_mo26W3IQYOVIQCUso.setAttribute(\"width\", w);\n  cv_mo26W3IQYOVIQCUso.write(\"cv_mo26W3IQYOVIQCUflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo26W3IQYOVIQCURollOverImg = new Image();\ncv_mo26W3IQYOVIQCURollOverImg.src = \"http://ecx.images-amazon.com/images/I/71OnCA45rCS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo26W3IQYOVIQCUpreplay = document.getElementById('cv_mo26W3IQYOVIQCUpreplayImageId');\nif (cv_mo26W3IQYOVIQCUpreplay) {\n  cv_mo26W3IQYOVIQCUpreplay.onmouseover = function() {\n    cv_mo26W3IQYOVIQCUpreplay.src = \"http://ecx.images-amazon.com/images/I/71OnCA45rCS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo26W3IQYOVIQCUpreplay.onmouseout = function() {\n    cv_mo26W3IQYOVIQCUpreplay.src = \"http://ecx.images-amazon.com/images/I/71OnCA45rCS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo26W3IQYOVIQCUpreplay.parentNode;\n\n  var cv_mo26W3IQYOVIQCUcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo26W3IQYOVIQCUcurrentClick) {\n      return cv_mo26W3IQYOVIQCUcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 7:50 MinsI bought this from MicrosoftStore.com with a 10% student discount.I am a 22 year old college student who loves pen enabled tablets and I have been using these types of tablets for the past 6 years. I hope this honest and extensive reviews helps you decide if this tablet is right for you. This expensive tablet/laptop is meant to replace your current laptop. Don't buy this if you just want a simple convenient tablet for occasional use; buy an android tablet for around $300.  There is no point in getting a windows tablet. Almost all electronics, mainly computers have some flaws and the Surface Pro 2 is no expectation. If you are willing to spend over a $1,100 on a computer I think you should at least read this LONG review. This review is for only the device, not Windows 8 and its limited apps selection. You can't compare any android tablets to this because this is a FULL computer. It runs all software like Microsoft Office without any limitation. It runs all desktop and mobile version software.PEN ENABLED - A tablet that has a PRESSURE sensitive screen and that accepts input from a fine point digitizer pen. Finger touch is great but it's hard to touch things on a screen smaller than 15 inches. The pen is the perfect solution and it is very precise.If you want to protect your Surface Pro and Pro 2 and have a nice looking and useful case, read and watch my video review on the Manvex case.In my opinion ONCE YOU USE A PEN ENABLED TABLET, IT IS IMPOSSIBLE TO GO BACK TO ANY OTHER TYPES OF COMPUTERS, you won't know how awesome it is until you use oneYOU CAN SKIP THE NEXT PARAGRAPH BUT I THINK A LITTLE BACKGROUND IS USEFUL INFORMATION TO SEE HOW GOOD THIS TABLET REALLY IS.Tablets are not new technology, although it has taken off in the past several years. I bought my first pen tablet (no finger touch) in 2007. It was the Lenovo X61 and I bought it for $1,500. And I have purchased the X201 and X220 tablets. They were around the same price when released. The X201 and the X220 both had finger touch along with pen touch. As you can see, pen enabled tablets are expensive. So the price for the Surface Pro 2 makes sense to me. I was wondering for years, why no other companies were not making a decent pen tablets besides Lenovo. Although I liked the performance, usability, and reliability of the Lenovo tablets, I was getting tired of paying so much for a tablet whose design never changed. You could not differeciate the 2011 model from the 2007 model and the design was pretty ugly. Finally the Lenovo Helix came out with a much better design but I decided not to buy it after reading all the problems it had. I liked the Surface Pro but I didn't like the battery life and I wanted to wait for the next model because this is the first tablet Microsoft made and I didn't' want to take a chance. Also I still liked my X220 tablet. Meanwhile other companies made pen tablets but nothing came close to the Lenovo.IS THIS RIGHT FOR YOU?I think all the bad reviews you will read for the Surface Pro 2 will be mainly because the tablet is not right for that person. Being said that, this should not get a rating below 4 stars if the right person is using it. Below I will list who it is best for ranking from highest to lowest suitability.Who is it for?***College/School Students - This is a must have for a person who is in school and has to take notes. This replaced 3 or 4 notebooks that I had to carry to my classes. Microsoft OneNote is a must have software for this tablet. Please watch some videos on OneNote and give it a try. I have virtual notebooks and I use write on the screen just like I would write on paper, except you never run out of paper. Imagine using 100 different highlighters and colors without actually having 100 different color highlighters and pens. After a few weeks, you will wonder why you ever wrote on paper. All your notebooks are in one place. Not to mentions how light it is. YOU WILL LOVE OneNote after you learn to use it. My grades improved after I used this approach to take notes because it was easy to study for exams because everything is in one organized place.***Business professionals - If you attend many meetings at work and have to take notes, this is a must have. Same concept applies as for college students. OneNote is a must have software.***Artists - If you draw, then pen enabled tablets are a no brainer. You have all the colors of the rainbow in your disposal for FREE. Obviously nothing compares to actual pen/pencils when it comes to drawing shades and shadows but this types of tablets is the next best thing. You can create amazing artwork by using some of the software that are available and most of them provide shadow and shades capabilities.Who should buy something else?***People who think 15 inch is the perfect size - If you are using a 15 inch laptop and you think 12 inch is almost too small to consider, then you will hate the surface pro 2. I am used to using the 12 inch Lenovo tablets and at first I had hard time adjusting to it but I love it now because of the high definition screen.***People who love big screens - If you like using 17 inch laptops, don't even think about buying this. You are wasting your money on this. Buy the regular surface or a normal tablet that costs around $300 for convenient and occasional usage.***Desktop users - If you currently use a desktop and want a tablet for occasional and convenient usage, then buy a much cheaper tablet. This tablet does too much and that's why it costs so much.Sorry for all that information LET'S GET TO WHAT MATTERS:Pros:-Design - I love the design, it is well constructed, and decent weight for a powerful machine. It is very stylish-Display - The display is very sharp and high quality. 1080p is all you need to know.- Performance - For the price and compared to other tablets, this is the fastest one available. I had no delay doing any work.- Audio - Surprisingly it sounds very loud and clear, if you want more sound, get a wireless mini speaker.- Battery life - I am easily able to get 7 hours with normal usage. I don't expect much more from a powerful and small machine like this.- Touch/Pen - The touch with finger and pen works perfectly.-Weight - For the power that it has and the batter life it provides, I think the weight is a plus. Most people say it's too heavy, but what they forget is that this is replacing a laptop. All the reviews says, \"Heavy and thick for a tablet\", once again, this is not just a tablet.-Keyboard - The keyboard is awesome, I love how strong the connection between the keyboard and the tablet is. I am not a big fan of the touch keyboard; it is sitting in my table. The type cover 2 keyboard is awesome. Light, thin, and backlight.-Kickstand - The kick stand is perfect, it has two angles to suit your need. Very stable and well-constructed; I have no problems using it on my lap or on a table.Cons:-Touchpad - Like most people says the touchpad is not that great. It is not very responsive and sometimes does things by itself. But I rarely use the touchpad, the pen is way too convenient and I use that 90% of the time.-USB Port - I wish it had one more USB port, but I guess I'll have to buy a usb hub.-Memory Card Slot/ Given the size, they should had included a full SD Card slot, micro SD only supports maximum 64gb for now.-Charging port - The charger magnet is not as strong as the keyboard magnet. While it is not flimsy but it falls of if with slight pull.-No Pen Holder - The pen attaches to the charging port, which is not strong enough to hold the pen securely. Buy the Manvex case and that will solve the issue.The cons are small things that could be better but nothing major that makes the tablet a bad choice.You might wonder if there is a thinner and lighter tablet that is almost as powerful. Yes but the thin and light comes at a price. The Sony Tap 11 is the only tablet that I think comes close to competing. But Surface Pro 2 is a clear winner. The Surface has better build quality and better battery life. Also the keyboard for the Tap 11 is dumb. You can't use it on your lap because the keyboard is wireless and you can't attach it like the surface. There are some other drawbacks but you can read the review on TheVerge.com.", "Title": "Best of its kind that's available now; it does replace a laptop for most people...", "Date": "November 29, 2013"}, {"Author": "Christopher Boitz", "ReviewID": "RHYXFIPMIZKN8", "Overall": "5.0", "Content": "I originally started looking for something different than the iPad after I had experienced life outside of the iPhone when I purchased a Galaxy S4. It peaked my interest with all the abilities I could perform outside of the apple OS.At first, I wasn't too excited about the Surface, and I tried to spend some time with it in the store to see how it felt but just couldn't get a feel for it because the one I tried was in a Demo Mode. I did a lot of research and read a lot of reviews and discovered the Surface could do much more than any other tablet on the market. I really was interested in the Surface 2, but decided to go with the Pro 2 (128gb) and have no regrets with this machine.. or beast as I now refer to it. Let me digress, and fill you in about what makes this tablet/laptop an awesome experience.*Multitasking - Wow... I had seen reviews that show the multitask function, but it's more than what they show. While I was trying to log in to Skype, I received a Facebook notification and when I touched it..Bamm, went right in to multitasking and best of all, I didn't have to do it myself. This is really cool, and the Surface really does this better than anything else I've experienced.*Screen - The screen is crisp and looks fantastic. I typically run it at 50% brightness and it's more than enough to make the battery life extend further while keeping a nice lit screen.*Flash Browser - I really couldn't believe how much of a difference this makes. It makes a great experience and Internet Explorer really looks great in the Metro. Performs very well in the Desktop mode as well.*Battery Life - I've only had it for a few days, and aside from having to put it down for a few things that life throws at me, the battery life has been exceptional. Kudos to Microsoft for fixing this issue.*Desktop mode - I really don't have to explain how cool it is be able to have the functionality of a PC on a tablet, but for those of you who are curious, it really works well and you can do exactly what you want to. Makes the experience of the Surface more enjoyable.*Type Cover 2 - While I think it should come included with the purchase like everyone else, this accessory is a must to own. Furthermore, the backlighting feature works great and the keys perform very well. I have no issue typing on this keyboard whatsoever.*Free Cloud and Skype Services - 200gb of free SkyDrive and Skype calling is an awesome throw in.*USB 3 and SDHC - Please, show me on the iPad where you can get this. What a great option!*Kickstand - Having two options for the kickstand is great, and I find I use both frequently. They are positioned nicely and it is very sturdy.*Stylus - The stylus is really a nice addition to the Surface Pro 2. I use it a lot and find it helpful doing most tasks. Functionality makes it a perfect companion with this **Beast**.What's Just Ok*The App Store - It's there, but could use more common apps that the other stores offer. However, there are plenty of apps available, and one must ask themselves, just how many apps does one really need?*Camera - The Surface 2 got upgrades, but this did not. Would have liked to have seen the upgrade on here for the price.What's Not Good*Price - I wasn't thrilled about shelling out nearly 1K on this. However, I don't have buyers remorse and I really think it's going to revolutionize the way I can do work and play. Just would have liked to have seen a lower price point. (or an added keyboard)Bottom line... Spend the time doing research, look at the abilities and capabilities. See not just with your eyes, but with your hands. Listen to the big name reviewers, but listen to the people who own them. More often than not, the big guys will beat this thing up along with the Surface 2 which is just beyond crazy. This thing rocks!", "Title": "Microsoft Makes The Competion Look Sad", "Date": "November 16, 2013"}, {"Author": "Neil E Howell \"Howeln\"", "ReviewID": "R1Y6BKDMS5RZHU", "Overall": "5.0", "Content": "For what it is, i think this is a perfect device.  This might be a little long, so I will discuss why we decided between laptop, tablet and finally the SP2, the good and the....bad/different.....  We recently purchased light'ish laptops (HP), and my wife has a tablet from work (iPad), and none of these fit the need.For me and my wife, we needed compact portability, but we also needed power.  And the ability to run like a regular computer.  Tablets don't do that, they really don't come close.  They are a device that fills a specific ability....as a computer, that's not it.  Sure, they can do some pretty nice things, but at a significant limit to features.  For me, a tablet is just a bigger phone that doesn't make phone calls.  This is why a tablet really wasn't for this need, and we also needed connections to the outside world...USB, bluetooth, etc.On with the SP2.  given all that above, this is the main reasons why we chose to go with the SP2.  Full OS, with more RAM and memory.  Though it does come at a cost/price, and not something to dismiss lightly, and really the biggest con.  My wife is working on her masters, so portability with ability is key, and the SP2 serves this up quite nicely.Compared to a laptop, the SP2 is more compact and lighter.  Having the ability to detach and wirelessly use the keyboard (through a accessory with a shortish battery life), really helps in the classroom.  Display on desk, keyboard in lap.  Desk edge does not cut into arms, and leaves space for book, notes, etc, without being in the way.We have not seen any lag or delay from our laptops, which have a bit of punch to them.  The main role is to run office for classwork and notes, but recently my wife is also using it to check her work eMail while in the car (we carpool).  Using our phones data plans for a mobile hotspot.  I have installed a game on it, just to see, and it actually ran pretty good.  Looking at reviews about this, which does push the power of the machine, it actually handles games pretty good....but by all means, it's not a gaming machine, but then it does point to capability.The SP2 integrated stand it great, and has two positions.  One better for a desk, the other for the lap.  Solid, good angles, and can't imagine not having it.We recently added a screen film/protector, just to be safe.  The screen display is very good.  very good.  Bright, good color, good resolution.  I also think for what it is, the size is good as well, which has as much to do with resolution and color.I found this out later, but the SP2 has tons of cooling, and I actually heard it turn on when running a game.  From reviews, most people don't ever have it come on.  Very quiet, but if you are in a quite environment, you will hear something....though not much.  From reviews, I hear it will get warm, but not hot.The click keyboard is great and backlit.  I asked around, and it's supposed to be much better than the touch.USB 3.0, bluetooth 4.0, pen, etc, it has all the features.With the bluetooth, we have a mouse that works well (not the MS one for SP), my wife doesn't use it, but I have a hybrid style of touch and mouse work to operate my laptop and the SP2.Cons:  Assuming one can get past the fact that it's too small for a laptop, and to heavy for a tablet, the only real issue is price.  Everything is an accessory, and of course more money.  For presentations, we had to get the adapters to connect to VGA and HDMI, the wireless keyboard adapter, and a bluetooth mouse. Not inexpensive by any means, but it is a great device.Conclusion, if you can afford it, and you need something more compact than the light laptops, and more power than a tablet, this is a great device.Note: we have had this device for about a month now, so time will tell how we feel in a couple more months, but I don't think this will change.", "Title": "SP2 is a great device to fill that gap where the laptop is too big, and the tablet just doesn't cut it.", "Date": "November 21, 2013"}, {"Author": "Amazon Buyer", "ReviewID": "R38LJXG20941BK", "Overall": "5.0", "Content": "This Microsoft Surface Pro 2 is a winner for me – I have the 512gb version.  The screen resolution and clarity is superb and makes productive work possible in this small format.  It is fast.  The hardware format totally works for my work environment. I pick up the tablet with documents preloaded – I handwrite notes into them.  I come back to my desk – dock the tablet and complete the editing.It does my multi spreadsheets, Photoshop, shoots music to my DAC stereo setup, holds journal articles for me to read, goes on the road with me, monitors security at my house – all in a compact package and with NO fuss or effort on my part.  There is NO makeshift/makedo/underpowered nonsense.  I went through the Win 8 offerings of Dell, Toshiba and Lenovo – none of them “get it” - iPad is useless for me, I run Windows software – I needed a fully functional, well thought out Windows tablet – this tablet is the ticket.It has excellent WiFi connection ability – it showed  40+ different network connections available in my condo living room last night – I am picking up 12 different networks now at work.  My home computer and work laptop pickup less than half that many networks.  I have had no problems with dropped connections.I own six other computers – the portability and robust features of this tablet are making me rethink my computer configurations – I will be selling at least two of them.  I hope Microsoft will lead the way with more forward thinking configurations – HP, Toshiba, Lenovo etc., etc. please wakeup – I would like more choices – why is a software company doing your job?Also – Windows 8.1 rocks – I don't understand the criticism and complaining about it that I have seen in many reviews.  It is logical, fast and it works – the comparisons to Apple and iPads are silly – I have tried a series of Apple products over the years – they are fine for light entertainment but they are useless for work.", "Title": "WOW", "Date": "December 31, 2013"}, {"Author": "DP21", "ReviewID": "R15C1Y9FVBWIMZ", "Overall": "5.0", "Content": "Pros1. Very, Very fast. Fastest possible tablet on the market.2. Very light and easy to transfer for a laptop3. Solid built.4. The battery life is more than adequate for a laptop.5. The pen is fantastic for note taking. Perfect for college students.6. You can attach a micro SD like the ones used on cell phones and tablet to add storage.Cons1. Expensive. At $899 for 64 GB it should have at least included the keyboard.2. The screen size is considerably smaller than the average laptop.3. The windows app store is very limited.4. Can get pretty hot if using heavy programs.5. There is no safe place to secure the pen.6. Only has a single USB port.I am writing this review to give an objective look at what has turned out to be a very polarizing product. Don't let the long list of cons at the top fool you into thinking I don't like the laptop. I like it, I like it a lot. I have been using this laptop for a few weeks now and I am still impressed at how useful and powerful it is. I will be discussing each of my pros and cons with more details below.Pros (Continuation)1. When I first laid hands on the laptop I did not have the type cover keyboard that I use now. Instead I had to rely on using it solely as a tablet for the first couple of weeks. If you have ever used an Ipad or an Android tablet this computer will blow all of them out of the water when it comes to performance. It is much faster than any tablet that I used before. It doesn't lag like Android tablets and it is much more versatile than an Ipad. I have the 64 GB model that comes with 4 GB of built in memory. As of right now this has been more than enough for me. At times I had between 6-8 programs running in the background with a dozen tabs opened on Internet Explorer. The computer has not flinched once. It is very smooth. I have absolutely no complaints when it comes to performance. I have been using it in \"balanced mode\" and not on \"high performance\" because I rather conserve battery life when I am using it. It has not mattered, this thing is a workhorse.2. The second biggest advantage this laptop has is how light and pocket able it is. This laptop weights about 2 pounds without the keyboard. The keyboard weight maybe about another half pound. At 2 and a half pounds (roughly) this is one of the lightest laptops you can find on the market right now. When you stop using the laptop the keyboard can be folded up like a book or it can be simply taken away completely. Being able to take away the keyboard at any time is one of the biggest advantages that this laptop has over the other 2 in 1 laptops I seen on the market. Most of the other ones you can rotate the screen 360 degrees and fold the screen over the keyboard and it acts like a tablet. The problem with that is that you are still carrying the entire weight and the bulk of the keyboard with you everywhere. That is very uncomfortable when you are trying to use it as a tablet. The Microsoft Surface on the other hand is only about three quarters of an inch thick without the keyboard and about an inch thick with the keyboard. Like I said before, very pocket able.3. The construction of the tablet is made out of metal, not plastic. It feels pretty tough and solid on the hands. Probably the biggest weakness is the actual screen itself which at the end of the day is made out of glass. I have seen videos where it can easily withstand drops on its sides and on its back with very minimal damage on the tablet. When it is dropped face down however, it has cracked just like a cell phone screen would crack.4. When it comes to battery life Microsoft did a pretty good job improving from the first generation Surface laptop. On a regular day the laptop lasts about 6 hours. I mainly use it indoors with the screen on at a quarter brightness. It is definitely comfortable to see indoors and it makes for a good balance between battery life and visibility. If you use the laptop for games or heavy programs like Photoshop then the battery life is going to go down considerably however. What happens is that a few minutes after you start playing a graphic intensive game the fan on the inside turns on and that uses quite a bit of battery. But if you are looking to browse the web or programs like Microsoft Office then I don't think you will have any problems getting at least 6 hours on it. I have seen reviews where they claim they have gotten 7 hours but I think that they are pushing it.5. I am currently in college. I use the pen that comes with the Surface every single day. It is an excellent tool for note taking. I carry all of my notes for all my classes on the computer. All of my notes are hand written because I love making sketches and annotation when I am taking notes. I also have all my books in pdf documents and I love being able to make annotation on them. The program used to make take notes is called One Note and comes with Microsoft Office. One Note has a slightly higher learning curve that the S-Note applications found on the Samsung Note series. But it is nothing major, it is worth it to take the time to learn how to use it. It is an excellent program and it is essential if you want to make the most of the pen that comes bundled with the Surface.6. The $899 model of the laptop only comes with 64 GB SDD for storage. Only 36 GB of those are usable right out of the box. The rest is taken up by the Operating System. Thankfully, Microsoft decided to include a Micro SD slot on the side of the laptop that allows you to insert a Micro SD Card just like the ones found on cell phones and other tablets. You can buy a 32 GB card for about $20 dollars.Cons (Continuation)1. The single biggest problem I had with this tablet when I was deciding on buying it was the price. At $899 for only 64 GB of hard drive it is very expensive. Keep in mind that the keyboard is not included. The keyboard will set you back another $130 dollars. It is beyond me why Microsoft does not include the keyboard with the laptop. They call the keyboard an accessory but honestly it is a necessity. You can't really do any real work on the laptop without the physical keyboard. The on screen keyboard that appears when you don't have the physical keyboard attached makes it very painful to use when you are trying to use the laptop on desktop mode. Anyways, if you are looking at the Surface simply as a laptop and not as a combination of a laptop and tablet then keep in mind you can probably get a better deal buying a regular laptop. You can get an i5 processor laptop with 4GB of ram and about 300 GB HDD for around $500 dollars. The Surface makes more financial sense for those people that plan to use the computer both as a laptop and a tablet. Why spend $500 dollars on a tablet and another $500 dollars on a laptop when you can have both in one product that you can carry around at all times?2. The drawback of making such a light and portable laptop is that the screen size is considerably smaller than the average laptop. The screen size is 10.6 inches diagonally which is closer to a tablet than a laptop. I personally do not have a problem with that but I know a lot of other people do. Many people are used to working with 15-17 inch laptops. When they see the size of the Surface they simply can't handle it. I have not encountered any problems with the size when working with it myself but I can see how this small size might not be ideal for somebody who is working on graphic design or AutoCad. Sometimes you just need more real estate to work with.3. The Windows app store is still severely inferior to the Android and IOS App store. There are many apps that I have found on the Android Play Store that are missing on the Windows Store. However, this is not nearly as big of a problem in the Surface Pro 2 because you still can install all the regular programs that a normal laptop can install. The Windows app store is constantly improving but they still have work to do when it comes to creating apps that will work well with a device that has such a small screen.4. Due to the limited size of the laptop it tends to get hot when under a lot of stress. This laptop will get quite warm when you are using heavy games and graphic intensive programs. It is not that big deal of a deal if you are using it in your lap or on table. I purchased a cover for the computer that protected the outer covering of the laptop but it was badly designed. I saw that it covered a large portion of the of the air vent that keeps the computer cool. The computer CPU got quite hot after using it only for a few minutes. Be careful, what kind of cover you buy for this laptop.5. It is a shame that Microsoft did not include a safe way to store the pen. They have it so you can attach the pen to the side of the laptop. But the magnet is not very strong and it is very easily to drop the pen by mistake. I always have to carry the pen on a side compartment of my book bag. They should have done what Samsung did with the Note series where you can store the pen inside the device itself. I was disappointed. I know myself, I know at some point I am going to lose the pen and end up paying $30 dollars for a replacement.6. Another limitation that the laptop has is the fact that it only has one USB slot. That can be a problem if you are planning to use more than one USB accessory. I don't like to use the trackpad on the type cover keyboard as a mouse. While I am at home I always use a Bluetooth mouse. I had to buy it separately because I did not want my other regular wireless mouse to occupy my only USB port with the receiver. Keep in mind that the charger that comes with the computer also comes with a USB port that can be used to charge your cell phone if you desire. That one can only be used for charging purposes though.In conclusion, I want to say I highly recommend this laptop/tablet if you are a student or are looking to give a gift to a college bound student. It is much better decision than buying an Ipad if you are looking to get real work done. Just know that there are going to be limitations such as screen size and price. I love my laptop and I really hope that this review has helped you decide whether it is right for you or not. Good luck with your decision.", "Title": "An excellent Laptop/Tablet combination", "Date": "January 9, 2014"}, {"Author": "Ramon F. Sola \"solar513\"", "ReviewID": "R2UG5W31R2M41U", "Overall": "4.0", "Content": "I wound up with the Surface Pro 2 after my Samsung Ativ 700 died on me.  The clerk at the Microsoft store swapped it out for this model and I've been pleasantly pleased with the results.  I will be going back for the type cover in a week or so but wanted to see what the tablet offered first.I primarily plan on using it for art, Corel Painter X3 for digital painting.Pros:Solid - This thing feels 'expensive' and sturdy.  The kickstand feels sturdy and rigid and the two positions it can be moved to are very helpful, even on your lap.  The one annoying thing about the kickstand is that you can really only orient it landscape style.Pen - I love this pen.  It has a good grip to it, though I wish it had 2 buttons for your thumb.Pressure Sensitivity - Be sure to download the newest drivers from Wacom.  This feels like a dream when you get into the zone of drawing with Corel Painter.Battery Life - The Surface Pro 2 has decent battery life (certainly far better than the original Surface Pro).  Do not be fooled by what the clerks say about it's insane battery life, however, if you are planning on doing anything intensive like drawing programs or games your battery will drain fast.  Just like any machine.Snappy - The Surface Pro 2 is fast.  All of the apps I've downloaded seem to load and run without any hiccups and even Steam seems to be great for gaming.Form Factor - This is a comfortably small tablet pc.  Even though it is small I can easily read everything on the screen without any issues.Charger: The Charger is magnetic and has decent strength to keep itself attached.  The block, while clunky, has a USB port so you can charge your phone without having to connect it to the Pro 2.Wrist Detection - This is great when you're drawing and you don't want your lines to go spastic.Speakers - I was pleasantly surprised by how good (and loud) the speakers were.Cons:Heavy - This thing feels like it shouldn't weigh as much as it does.  At almost 2 lbs. it feels like a brick in your hands.  I wouldn't suggest carrying it in your hands for very long as it feels like a lodestone.On Screen Keyboard - This feels responsive but because it takes up most of the screen it takes a while to type out a message.  It also doesn't always automatically pop up when there are typable fields selected.Windows 8 - Not a fan, and I remain not a fan of the metro bars.Glossy Screen - Ordinarily I wouldn't be irked by this and realize that for watching movies this is great, but for drawing, it feels like you're drawing on glass which has a weird disconnect for me.  Even if you got the screen protector it is another glossy texture.  You'll get use to it, but it isn't the same as working on a Wacom Intuos.1 USB port - This really isn't enough ports, even if it is USB 3.0.Auto-brightness - Is weird and unreliable.  Sometimes the screen gets darker and stays dark and other times it waffles between dark and bright.  I had this experience with the ATIV so this may be a Windows thing, not a Surface Pro 2 thing.Chrome (web) - Is different from Chrome (app).  The web version was surprisingly blurry while the app wasn't.  The app was nice but I had issues watching Youtube videos at full-screen (it would black out).Search - The newest 8.1 version of Windows makes the search default to 'everywhere' which is annoying when you're searching for settings for your pro 2.Experiences with Corel Painter X3 on the Surface Pro 2:This has been a dream to work with on the Pro 2.  The paint mixer has been very responsive (not so much with the Ativ) and has not hiccuped once.  While drawing on the tablet feels like you're drawing on glass, I will probably get use to it and become enamored soon enough.  This is the full Corel Painter which is a resource hog but I prefer this over Photoshop because it allows you to use your fingers to pinch-to-zoom and rotate where Photoshop does NOT which means you will need to use the keyboard for hotkeys more often.  One thing I wish the pro had that the Ativ had was a special app (I guess?) that had hotkeys programmed into it (and programmable ones as well) allowing you to put the on screen buttons somewhere on the screen for you to use instead of having to a) use the keyboard and b) use the onscreen menus.Gaming:I was curious about how well the Pro 2 would run games, so I downloaded the Steam client and then Tombraider (2013).  The game runs (surprisingly) well for such a new game and for such a small machine.  I used the one USB port to hook up an Xbox 360 controller and it worked well with the game.  I wouldn't suggest buying the Surface Pro 2 as a substitute gaming machine but it can offer some decent light gaming-on-the-go.  I will download World of Warcraft sometime this week to see how it runs.The Bottom Line:The Surface Pro 2 is a handsome machine but not without flaws.  The biggest flaw in my opinion is its inflated pricetag (as mine was swapped for a machine on warranty I won't complain too much).  This pricetag does not include a keyboard/type or touch covers), which makes it beyond steep.  The facelift to the processor allows it to run more intensive programs for longer which is an added bonus.  Depending on your usage, you should be able to get through the day on a single charge.  While I applaud Microsoft's attempt to cramming in a ton of 'stuff' into a small device, I'm left wondering if it truly excels at any of those things.", "Title": "So far so good (initial thoughts)", "Date": "December 4, 2013"}, {"Author": "Scrantonicity", "ReviewID": "RNAK20OGGCZLX", "Overall": "4.0", "Content": "A few months back I was trying to decide whether or not to but the SP2 or a laptop.  Although they are completely different machines, I think most people will be making the comparison.  I ended up with the SP2 and have been very happy.What's great:The Start Screen - I love that I have the option to run the machine from traditional windows when I need a laptop but I spend most of my time operating from the start screen.  The ability to pin your apps and programs here, customize the size and arrange them in whatever manner is most useful to you makes it personal and more organized.  Not only that but you can pin so much more than apps.  I have many of my favorite websites pinned to the start screen and you even have the option to select which picture you want from the website to be the tile image.  Being able to change color schemes and backgrounds all adds to making it your own.Charms and Swipes - The functionality of a windows tablet is wonderful.  Having every setting you need by just swiping from the right side of the screen inwards is a huge bonus.  If I want to adjust screen brightness as I switch from a video to an ebook, or if I want to change wireless settings or any other setting related to the app all I need to do is swipe to the left from the right side of the screen and it's all there.  No need to exit and find the settings app.  Similarly if I want to go back to an app, or switch back an forth, I only need to swipe in from the left.  I can either cycle through all my open apps or view all apps that are open and easily move back and forth between programs or close them.Multi-tasking  - I was recently preparing a lecture and being able to have Evernote open on one side of the screen with Chrome open on the other makes multi-tasking a huge bonus for a tablet.  You can snap any two or even three programs on your screen eliminating the headache of having to exit apps to go into other ones.Laptop - And of course it wouldn't be a SP2 if you couldn't also run it as a laptop.  Personally, I find pulling my SP2 and using it on the go is much easier than trying to work with a 17 inch laptop on my lap.  I can watch movies easily in bed in tablet mode then flip the keyboard down and work in MS word, or use it as a traditional laptop.What you sacrifice - Because it's a 2 in 1 you get the benefits of a laptop and a tablet, but you also loose some of the benefits.  As a laptop you will find a shorter battery life.  I get around 8 hours and can even go a few days without charging it if not under strenuous use but the battery is shorter than a laptop.  You'll also get a 10 inch screen as opposed to 15 or 17 inches.  I wear contacts and glasses and it doesn't affect me but it may be a beef for others.As a tablet - this things has some great guts, more than a traditional tablet, so this means it's thicker and heavier and a little more cumbersome.  the battery is also very short compared to other tablets.General Pros:I love love love that it has a Micro SD slot and a USB port.  I have more memory than I need and have the option to hook it up to a wireless keyboard, printer or external HDD.Not technically mobile - it's mobile but not a mobile device.  That means I don't need to pay premium prices for apps that charge to be used on mobile devices.  I just use the apps in desktop mode.The kickstand - 2 stage kickstand makes the SP2 more useful in non-tablet scenarios and I have no problem standing on my lapGeneral Cons:BUGS!!!!!  being an early adopter (especially of an MS product) means bugs.  I haven't experienced anything that has caused any real problems but little things like when I hit the power button to bring it out of standby, it shuts down instead.Who is it for:  The only person I would say it is not for categorically is people looking for a gaming machine that can handle anything you through at it.  I use the machine for everyday computing, reading books, comics, movies and TV and games but it won't run the high end games very well.So there it is.  I think it's obvious I love the machine.  If you have any questions I'd be happy to answer them in the comments.", "Title": "Laptop or Surface Pro?  Its amazing but there be bugs here", "Date": "January 14, 2014"}, {"Author": "Sayerone.2012", "ReviewID": "RUMLCRQUY703C", "Overall": "5.0", "Content": "I purchased the Surface II tablet because of the reviews it had and I really wanted to see how easy it was to use for myself. The reviews were right, it is easy to set up and use anywhere. I already had a great laptop but it is a bit bulky, heavy, and hard to use on your lap and the Surface is so easy to use on your lap and lightweight it is beyond just being a comfort to have, this tablet is powerful as well. I wish I would have had this one in college. I would recommend this one to anyone who is looking to upgrade to easy.", "Title": "A great Christmas Gift", "Date": "December 29, 2013"}, {"Author": "Leo Cyrule", "ReviewID": "RGYSYJB173CIT", "Overall": "4.0", "Content": "This is by far the best mobile computer I have ever used. This thing works like a charm and has a stupidly long batter life. I am a college student and my old laptop was dying out. It will receive a viking funeral when it finally bites the dust. Now there are a few things that I will nit pick on, and some things that I am a little biased for, but shouldn't really take away points. ONTO THE PROS AND CONSPros:1. The computer is extremely fast. The memory management system on the device is stellar, and the power of an SSD and the i5 (I would honestly prefer an AMD APU chip however for the GPU) gives you the power and speed you need to stay professional. And in my case, turn on programs in just two seconds to take notes or draw while your professor gives out lectures.2. The battery life on the Surface Pro 2 is also a plus. Most people will tell you that the battery will last for 8hrs. I have actually managed to get the battery to last me for nearly ten hours. You will need to lower the brightness on the screen, and turn off the bluetooth adapter when not in use. You must also remember to close apps fully - in the cons.3. The two years of 200GB of storage space on SkyDrive is also a nice bonus. Given that the device it's self is low on storage space. This is a major consideration. Though I am sure many like I would want that to be a permanent addition.4. Pressure sensitivity. I find the pressure sensitivity to be quite a nice bonus as I am also an art hobbyist. After installing the WacomFeel driver from Wacom, the pressure sensitivity will work in all applications. It may also fix some miss alignment problems on the tabs as well.5. Weight. I don't know why people find two pounds weigh so much. They just may be out of shape or something. My old laptop weighed 5 lbs and was much larger, which made it cumbersome in one hand. With this device being more compact, it's almost like holding a fighting knife and a sheet of paper.6. The Skype wifi. I have no freakin clue what this is. But it's free for a year.7. Some of the apps on the device are nice. However, there are a handful I find worthless, and were promptly destroyed. This being everything Xbox ( I will never own one after what happened long ago). The finance software. And the News software.----------Cons:1. This thing has some bugs with it. But no device is perfect.- The first bug I found was the most aggravating, and it took me forever to figure out just what was going on. On the desktop app, you can select the icon that gives you power options. On that it has balanced and power saver. Well I thought this would be great if this can last even longer. So I placed it on Power Saver. And I saw nothing happened. Well... a few seconds later, the device became unbelievably unresponsive. The software hangs on the lock screen if you let it go to sleep. Touch becomes worthless. It will freeze every so often. And I would not get an error message. So... I thought something corrupted the device. And refreshed windows. The problem persisted. So I went ahead and reset back to factory defaults. This seemed to fix it. Which made me happy. I then put it back onto power saver, and this time I noticed windows hanging almost immediately on the action. So I tested this. I left it like so and continued to try and operate the device like so. Same problems before reset. When I changed back to balance, the problem went away. DO NOT CHANGE TO POWER SAVER. This will keep stability. Besides, balance will allow you to last for more than 8 hrs as long as your bluetooth is off, and power hungry apps aren't open.- Windows Reader will have some issues. It won't always install correctly. But it's not necessary. It's provided by default on the device, and I honestly enjoy the app.2. This is a problem common with all digitizes. But more apparent in wacom. Should the stylus draw close to the corner, you will notice the mouse suddenly hop out of alignment. If you attempt to Calibrate, DO NOT keep the results unless they are absolutely perfect. This will cause the problem to become much much worse. If you can't manage it. Just leave it be. The likely hood of you using said corners is low. There is a work around however.-Step one. Install the Wacom Feel driver. Wacom has actually managed to compensate decently for it, and it's less apparent now. This also makes the pen it's self more accurate in the middle, and will be very unlikely to hop out of alignment.-Step Two (optional): Calibrate. You can calibrate, and some people managed to get perfect results by making adjustments near the corner. But if you can't produce a good result, do not keep the settings. Reseting calibrations will cause it to go to the default windows settings. Not Wacom's.-Step Three: If you need to use the corners, hold the pen up 90 degrees relative to the screen. If you look to the side, it should look like a perfect interception. The cross-hair will be directly underneath the pen, even near the corners.3. The included pen. The included pen is nice and all. But for some reason, the cross-hair is no where near the tip of the pen. Instead, it hides slightly behind the nib. This isn't much of a problem, it's a design flaw however. Plus Microsoft does not sell replacement nibs. I suggest using a Bamboo Feel pen if this matters to you.4. Microsoft Office. Microsoft office is installed on the system. But it's a trial only. And it's also a version that requires a subscription. This is something that is important to me in college. But this version is a double edge sword. I have yet to activate it, but it seems to hold a very small file space on the tablet. It's about 256MB. And I am sure this is the version that requires a monthly subscription. It's not that bad given it cost almost ten dollars a month, and you do get 20gbs of skydrive with it. It is a little offensive, though, that a professional device does not give you professional software for free.But that is just a little unfair of me. They do give you OneNote as a light weight App for free. Preinstalled of course.EDITS: \\====================================FIXES============================================I have found a fix for the corner issues on the tablet. I have to thank google search and a lucky forum board that had managed to find the answer. This fix allows you to keep your accuracy near the corners of the device without having it shoot all over the place. NOTE. The following fix does require a registry edit for it to work with the wacom drivers. This goes to show that it is not a hardware problem, but just a method that wacom for what ever reason decided to approach it. So the problem with it, looks to be the use of low sample data when you are trying to calibrate. Microsoft defaults to 16 points around the corners to use. Wacom defaults to four. And Wacom will overwrite the calibration of Windows, and Wacom is the one that seems to be terrible. Solution for it is a little extreme. 273 points for calibration. And then an extra 4 from Wacoms drivers as a second test.[...]Page 1 post one contains the basic instructions. To get the fix to work with Wacom driver's please follow the instructions on page 4. Have a grand day folks!", "Title": "Almost Perfect!", "Date": "January 16, 2014"}, {"Author": "Dr John Monroe", "ReviewID": "RN9NEF256GXM5", "Overall": "5.0", "Content": "I just got the surface pro 2 after owning all iPads versions except the air and I must say: I love it! It is a bit heavier than iPad, however it does so much more! The screen is fantastic, it is blazing fast, it has usb3 , micro SD and all other extensions and it is a real windows laptop inside a little tablet cover. I used to carry everywhere an ultrabook laptop and the iPad - not anymore, I gave away my iPad already after playing with my surface for few hours. I of course still need to become used to windows 8, but I was always sick of the closed world of Apple - now I am free again! you can do everything you do with an iPad and plus a full PC at the same time , in a 900g package. My iPad with the cover was weighting 950g - so even from this point of view there is no big difference in the real world.", "Title": "100% better than the ipad", "Date": "December 1, 2013"}, {"Author": "Kenny Murawski", "ReviewID": "R25WZFBH5SKVQ9", "Overall": "4.0", "Content": "I have a laptop for the last 15 years in my traveling sales job.  I have tried the IPad and Surface Pro II.  The Surface Pro II combines the ease of a tablet with the functionality of a laptop.  I have yet to find a task that can was available with the laptop that can not be done with the Surface Pro IIOne negative: periodically have to hard reboot because tablet freezes.", "Title": "Great laptop/tablet", "Date": "April 27, 2014"}, {"Author": "Lawrence Delasotta", "ReviewID": "RNM201HNDXXNV", "Overall": "5.0", "Content": "My Surface Pro 2 runs so smoothly! Applications were designed for this interface. Movies, music, editing etc. are all easily used making an incredibly useful productivity/fun tablet.", "Title": "YES!", "Date": "February 9, 2014"}, {"Author": "Tech Weenie \"T. Weenie\"", "ReviewID": "R38YZAVQ13IEJ8", "Overall": "5.0", "Content": "I bought this unit at Best Buy, not Amazon and it works perfectly for everything that I have attempted do with it. It has a fully functional Windows 8.1 operating system and can do anything my big HP desktop can do. It's only limitations are the smaller display when working with some image editing programs like Photoshop and it's rather poor cameras (my iPhone 5 can blow them away!). I'm currently running Photoshop, iTunes, Eye-Fi and other programs. It's processor is lightning fast and outperforms most all laptops on the market. I have been totally impressed and blown away by this little jewel!", "Title": "Incredible Device... Unbelievable Capabilities!", "Date": "February 7, 2014"}, {"Author": "Juan Carlos Lopez P. \"Juan Carlos\"", "ReviewID": "R2DEFCNTKKF11N", "Overall": "5.0", "Content": "A little background. I used tablet-PCs since 2000 (hybrids and tablets). It was a long path, I went through different touch interfaces from WindowsXP, Vista, 7, iOS, Android, WebOS, and finally Widnows 8.I've been with the surface Pro 2 almost 4 weeks. At the beginning it was difficult to get used to Windows 8, but now I can say it fits perfectly in my lifestyle, and balance my professional, personal and entertainment needs.------------Likes:- Full Windows experience- Full compatibility with legacy apps- Great size for mobility (of course it could improve the weight, but it is understandable considering the horse power  the Intel i5)- Great touch experience with Windows 8 (I will never think to install Windows 8 in a non-touch computer)- When at home I can plug it in to my 32\" screen and wireless keyboard and mouse, amazing desktop experience- At the couch or at bed I can easily have it as a tablet and read my news- The capacitive screen with wacom digitizer is an awesome plus, compared to the Asus' pasive screen, it is worth to pay extra. It works great with the pen for signing documents and taking notes. I'm not an artist, but I'm sure it could be an awesome tool for artist and people who love to sketch pictures and drawings.- Considering size, resolution screen, battery life is reasonable, solid 5 hours.------------Dislikes:- Only MicroSD expansion slot (limited to 64GB expansion), a regular SD is not too much bigger then teh microSD and MIcrosoft can manage to put a regular SD slot, so we can increase to 256GB SDXC- The 3.5 combo (mic&headphone;) for some reason doesn't accept my iphone handsfree piece. Do I need to buy a specific handsfree?- Cameras are good, but could be improved. The Surface 2, has better specs, why the Pro 2 doesn't have the same cameras?------------Lots of things to improve:- Battery life, 8 hours have to be the minimal REAL spec- SDXC slot, NO microSD- Lighter weight, this will come with time. In the mean time this is a my perfect 2-in-1 device- Windows Store needs to increase the number of apps and developers need to be foster in this environment (also another thing that will come with time)Conclusion:Personally I'm very happy user with this device. I highly recommend it for professional users who are willing to pay the premium.Right now Surface Pro 2 is heavy for what other people understand for Tablet form factor. However they have to consider that the Surface Pro 2 is a FULL PC not a limited device.I saw a lot of comparisons between Surface pro 2 vs. iPad or Android tablets, please understand they are not comparable at all. They are in different segments, for different audiences, for different needs.For the ones that are looking for a device to read, play, check email and surf the web, under 1 pound, stay away from Surface and get an iPad or an android device.In the mean time I'm selling my iPad 3, and I will keep the Surface Pro 2.", "Title": "finally the 2-in-1 device (almost perfect)", "Date": "January 16, 2014"}, {"Author": "Jonex06", "ReviewID": "R39S2P89BW164L", "Overall": "4.0", "Content": "***UPDATE***The upfront cost to make this an obscenely expensive start (keyboard due to typing issues, case due to bad angles on the kickstand, and SD card due to limitations in memory) to a great device.  It is not bad but be prepared to purchase these things (at least $170) to compensate for where it lacks.Two things you need to know about me:I owned a macbook pro - great device but I needed a windows machine to take full advantage of teleworking from my jobI was in the market for a tabletThe surface pro 2 is not a laptop or a tablet; rather, it is a device that can do both pretty well and could be beneficial to college students.***The Good***Touch Screen - Extremely responsive and a lot of fun to play with especially with smart glass (Xbox app)Speed - Do not let the size fool you, this has some power under the hoodFull Windows Desktop - I cannot say enough about how useful this has been so far considering the lack of apps in the windows app store (not for long I hope!)***The Bad***Navigating the UI can be slightly cumbersome at first (especially for a mac owner)The App Store - It has a few good apps but the overall store is light on good content (Let me know of any good Windows Apps)The Keyboard - This is not a complaint on the keyboard but a general grip that it is not included and at a premium.***Overall***The Surface Pro 2 is totally worth it if you are looking for something that is not quite a tablet, but not quite a laptop.  It is not very heavy but the awkward stand may be a problem for seating position for those who may have neck or back issues.  Also, buy this if you are willing to part with a considerable amount of money upfront.", "Title": "Worth considering if you want a tablet and a laptop but have neither...", "Date": "December 5, 2013"}, {"Author": "R. Raghavan", "ReviewID": "R1A7E0GSXY7HWU", "Overall": "5.0", "Content": "I'm an MBA student. I need my computer to run MS Office as well as a bunch of other business software. I need my computer to have a proper keyboard for typing. Since I walk everywhere I also need something that is light and small to carry around. All of which means that iPad and Android tablets won't get the job done; and regular full-size laptops won't be very convenient. And why have to deal with two separate devices if one could do both?Hence my Surface Pro 2.This machine has changed the way I use my computer. It has made my old laptop completely redundant, and opened up new ways in which I work, play, browse.Pros:- It actually works. Works as a powerhouse PC to get the work done. Works as a user friendly tablet for leisure time- The build quality is solid. The look and feel, the placement of the camera, ports and volume buttons, everything shows superior design- It's a full fledged PC, which means you can install all your favorite legacy software. Of course you have the rapidly-growing Windows app store as well- In terms of processing power, this thing is a beast. I run high-graphics games like Asphalt and Rome Total War 2, and it doesn't even flinch- The keyboard (Type Cover, backlit) works splendidly for full speed typing. The trackpad seems dicey initially, but once you learn how to use it, it's quite good. The two finger tap is an innovative approach, and the sideways scroll is really cool- The kick stand is not only solid, but also rests at the perfect angle for both desk and lap use. I use the 22 degree position for regular desk-based work; the 55 degree position for resting it on my lap when I'm on the couch at Starbucks; and use the 55 degree position and fold back the keyboard for watching Netflix in bed- The pen is awesome! It feels like a real pen and writes like a real pen. The eraser on the back is incredibly cool. I use the pen with OneNote for taking notes in class, and also for annotating Word/PDF documents- Battery life is really good. On normal use, I routinely get 6-7 hours, sometimes 9-10 hours even! Makes the charger more or less irrelevant; I only charge it when I'm sleeping at night- Boot up time is amazing - less than 5 seconds!- The hardware makes the software come alive. As a machine, the whole thing is clean, powerful, smooth, easy to use, and incredibly intuitiveCons:- It's a little too heavy to use as a tablet when you're standing (esp. with the keyboard attached)- It's expensive- It doesn't have that Apple logo on the back that everyone seems to be fanatical aboutAs a cash-strapped student I really thought hard about spending so much money on a computer. All my friends discouraged me from buying this thing. But I'm glad I bought it. This has been my best purchase ever.", "Title": "Best purchase ever", "Date": "January 26, 2014"}, {"Author": "Paul M. Vanderveen", "ReviewID": "RHI26OTX2XESB", "Overall": "4.0", "Content": "I would sum the Surface Pro up as a very powerful compact laptop with great battery life.  Oh, and if you need a tablet it can do that too.  I am a software developer and 90% of my time with it is spent hooked up to a keyboard and a 24\" monitor.  It is definitely a real computer. I was a little afraid of the 4GB memory limit, but  It is fast -- I can load up multiple VM's on it and it doesn't hiccup.  Then I can pack it up and head to a meeting or throw it in my backpack for the bike trip home.  The only downside to it is that the placement of the mini-DP and charger port get in the way of each other, and I find the charger port difficult to align.  They also didn't provide a dedicated spot for the stylus, so the stylus is almost useless to me since I never have it when i need it", "Title": "Great Laptop that sidelines as a tablet", "Date": "March 28, 2014"}, {"Author": "Steve", "ReviewID": "R37HNOU3QH21AK", "Overall": "5.0", "Content": "The surface is an amazing tool.  My personal productivity has seen a significant increase since incorporating it into my life. Onenote is the best thing that has ever existed for taking notes. Write, erase, select, resize, move, etc. Perfect.  I take notes all the time now. Hand written.  It has helped my professional and my every day life, and I am grateful for it. Also, drawing in sketchbook express, the free metro app, is wonderful as an artist. Especially considering the wacom digitizer for pressure sensitivity the SP2 has built in. And the metro app for netflix is excellent. Much better than the web browser version.I opted against the keyboard cover and bought a Bluetooth keyboard and laptop mouse instead. And a small CaseCrown messenger bag in which it all snugly fits.  When I need a tablet, I use a tablet. And when I need a desktop I have a wireless keyboard(logitech k810) and mouse(microsoft 4000) which are desktop quality or better. Truly it is a comfortable setup, and the surface brings the raw power.  What is also important to me is that my mouse and keyboard will remain useful for future devices as long as Bluetooth and USB are still being used. My last wireless mouse has lasted 13 years and I still use it, too.But what is really cool is that my surface lets me use my PC software to the fullest and it also acts as a tablet when I just want a tablet.  It is an absolute game changer for me in my life.  The only 'every-day' things that my PC does better than my surface is gaming with new games, and very large art projects. And my PC is very nice, I assure you. I now use the surface for everything else, wherever I want, whenever I want, and with a really nice wireless, backlit keyboard. And the keys are spaced as a full size keyboard. I actually bought a Bluetooth dongle for my PC so I could use my logitech k810 wireless keyboard on it as well. It's totally sweet.The surface is something beyond a tablet. It is a full, portable computer which can attach to keyboards and mice and whatever else through USB, Bluetooth, Wifi, MiniDisplayport, and Wireless Display. Probably more, too.  Depending on how you want to use it.  In a sense, it is the most elemental PC that has ever existed. And as a PC user, I say thanks.", "Title": "Amazing tool", "Date": "January 28, 2014"}, {"Author": "Splash52", "ReviewID": "R1733IYQ6G11AD", "Overall": "5.0", "Content": "I am a computer science student and I put netbeans, Eclipse, Unity and all other sorts of software that I need for school and this thing never misses a step.  I put some steam games which it runs easily.  This has replaced my laptop and my tablet completely that I just sold them.The diditizer paired with one note is a life enhancer.  I have never been so organized I can keep track of everything I keep notes that matter as in notes I will find useful for tests.The only con is the price however that is true for most things in life, who wants to pay for anything.  I happily shelled out the cash its just that good of a device.Also windows 8 is horrible if your on a regular laptop, but with this it just makes sense and works wonderfully.  My favorite operating system.", "Title": "Organization and Productivity King", "Date": "February 14, 2014"}, {"Author": "BinCho", "ReviewID": "R1KMG0MAF31QGJ", "Overall": "3.0", "Content": "The concept of this product is good. There can be different opinions on the Surface Pro 2 (SP2), but one thing I can say for sure is it's a great device for the use it's designed for.Ok, let's go straight to the point.It's great as long as it works. When it's not, and when you need a service for your product, be prepared to experience one of the worst customer support.I purchased SP2 128g from MS store. When I got mine, I found it's defective. The cursor is off from the pen tip at certain areas of screen. Calibration, new driver, or reset/refresh all didn't work. I checked other devices didn't have the problem.So I contacted the customer support, and they processed and shipped a replacement.As you might know, MS updated SP2's CPU from i5-4200 (1.6 ghz) to i5-4300 (1.9 ghz). Mine had 4300. However, the replacement I received had 4200.*** Here's the first thing you need to know. MS doesn't exchange your device with a new one. They just ship refurbished and it explains why I received one with 4200 CPU which is supposed to installed in older production. Bottom line is that I purchased a NEW unit, but they replaced it with a SECOND HAND unit.Even worse, they held a charge of the FULL NEW PRICE on my credit card for the replacement, which is supposed to be lifted after I send the original back.I contacted and sent back the replacement with 4200 CPU. At that point, they lifted the hold in my credit card.They said they are going to send another replacement with a correct CPU but don't know when it's going to be. What I was told was that it CAN Be in a month, but that's a rough guess and they don't know the replacement is going to be available even AFTER A MONTH due to low inventory.*** So, here's another thing you need to know. If you buy an SP2 now, there's some chance you're going to get an older version with 4200 CPU. If you are waiting for an replacement, it is very likely that you're going to get one with 4200 CPU. They seem to try to reduce their older inventory. Be sure to check if your SP2 has 4300 CPU when you buy one.Now, MS took my money, and I have nothing. All I have is a defective unit that is not functioning properly. Did I say MS customer support still doesn't have an expected delivery date of my replacement? They even refused a return/refund. Three weeks after I filed a replacement, I have nothing, and they still have my money.*** Last word: if you are decided to buy SP2, wish you won't have to deal with MS's customer support. It's bad as H*LL.p.s.1. The package that the replacement was delivered with was one of worst I've ever seen. It was delivered in a box with some foam in it to protect the SP2. One side of the box was completely torn and was partly covered by wrapping tape. In the box, the device was covered by an envelope which was not properly sealed. In other words, the device was literally exposed to outside environment during shipping. Yes, we are talking about $900-1700 electronic device.2. You can check if you have the same problem I had (cursor off from the pen tip), try to draw straight lines across the screen using a ruler. If you can't draw straight lines at any area of your screen, your SP2 is defective. That's a hardware problem and cannot be fixed by firmware. If you plan to mostly use mouse and touch, this might not be a problem to you, but, if you plan to use SP2 for drawing and note taking, this problem cannot be ignored. Also, remember you pay extra for SP2's Wacom digitizer.I'll update how my replacement progresses. I browsed MS community and found even worse cases.Update 4/23/201412 days passed since I posted this. I kept asking when I can get my SP2 to Microsoft's customer support. At some point, they stopped answering my email, and I still don't have even an expected delivery date. My money stolen by Microsoft hasn't returned either.", "Title": "What you need to know before buying it", "Date": "April 11, 2014"}, {"Author": "Irving \"N\"", "ReviewID": "R2BXEJZH814KXO", "Overall": "5.0", "Content": "This little machine is a powerhouse!  You can multitask like I have never seen a small machine this size do!  First, you can add an external display (such as your television through HDMI) and this thing can act as a second screen (Dual Screens!).  Second, (and I don't know why anyone would) you are able to play some of the top games that are out today on this thing!  CoD, Team Fortress 2, Warframe, etc... (haven't tried Battlefield 4 yet). You can use this thing to control your xbox one and you can even use it with the PS4!  The pen that it comes with WORKS PHENOMENAL!!! its like writing with actual pen and paper (YES IT IS THAT FAST!!!).  Oh, lets not forget the viewing of movies on this thing...MAN! a media power house I tell you!!!  It doesn't get hot, charges fast, the battery lasted me roughly 10 hrs.  Microsoft is on to something here!  I won't say they hit the jackpot (I will explain in a minute).  You can connect a USB hub to this thing and use a mouse and keyboard if you'd like. I am using an small ANKER keyboard and mouse (I haven't purchased the keyboard that was made for the Surface Pro 2 just yet).  Works with an external DVD player, Xbox 360 Controller.  The screen and resolution are perfect!!!  Adobe pro works great, photoshop is outstanding.  I am writing this review using my new Surface Pro 2...Now the reason why I said Microsoft hasn't hit the jackpot (pretty close too it!) is I believe they are holding out for the next edition of the Surface PC (that's right, it is a full-blown PC with all the great features of a tablet (or perhaps the other way around; however you want to look at it).  I can see them (Microsoft) developing the third edition and calling it \"Surface Ultimate\".  This ideal \"Ultimate\" would come in a Core i7 format, a 1TB Micro Solid State Drive, at least 2 USB 3.0 ports, 8GB of RAM, the new Intel IRIS (Intel has something up their sleeve) compatible with Core i7 (would contain Graphics 5000 integrated) and color options.  THAT WOULD BE A GRAND SLAM and probably take a huge bite out of Apple (and I enjoy my apple products).  Anyway, if you are looking for a tablet that is essentially a PC (ALL IN ONE MEDIA, ENTERTAINMENT, BUSINESS, PROGRAMING, IT, ETC..)  THIS TABLE scratch that.. THIS PC IS PERFECT!!!!", "Title": "WOW!!!!!! WOULD GIVE IT 10 STARS!!!", "Date": "April 26, 2014"}, {"Author": "Jeffrey K. Ross", "ReviewID": "RJWNSLMZ40M0O", "Overall": "5.0", "Content": "It has all I expected and wanted and is an amazing device. I'm very pleased and expect to use it as my primary personal device for several years.", "Title": "an amazing device", "Date": "March 24, 2014"}, {"Author": "Philip Hoskins", "ReviewID": "R3AUHKGIGYT416", "Overall": "5.0", "Content": "This for me is the perfect laptop replacement. It allows me to carry my office everywhere, get work done anywhere and is well designed, well executed, sturdy and I for one love Windows 8 on the Surface", "Title": "Well designed, love it", "Date": "February 5, 2014"}, {"Author": "E. Nathan \"Zen Knitter\"", "ReviewID": "RD6ZHVVHPKARL", "Overall": "4.0", "Content": "I have an iPad, Xoom (Android Tablet), and now this.  I have to say this is the most useful tablet I have ever had.  While it is pricey, it is so much more than just a tablet.  I considered this because Google took Java out of the Android system so now web browsing is a pain when sites have java embedded apps...A few things....1.GET THE SURFACE 2 Cover (keyboard)...  Seriously, it costs slightly more but it is worth it!!!  The backlit function alone makes it worth the money.2. If you are expecting tons of terrific apps, you will be disappointed.  I bought my Android tablet before there were apps for it in abundance, so I am familiar with the feeling.  That said, for this tablet it is no big deal... it is also a PC so apps are unnecessary.  Also you can download BlueStacks software and use any android app on this tablet, so all in all not such a big problem.3. Smooth, and Fast!!  boots up quickly, its only about 2.5 pounds with keyboard and my cover, much lighter than a laptop which makes traveling better.4. The charger is propitiatory, so be sure to buy a second for back up.5. The screen is amazing and clear6. If you like to watch videos get additional software, especially if you use your phone for movies.  Android phones movie files are 3Gp, not a supported format for any software on this thing.  Very frustrating.  I plan to install software (Adobe Photoshop/Premiere Elements) so it should be better after that.Other than that it has been a good experience with the tablet.  I would give it an A+, and worth buying.", "Title": "An Amazing Tablet and Computer!", "Date": "December 30, 2013"}, {"Author": "AnB \"AnB\"", "ReviewID": "R2HQOOHF89HS1C", "Overall": "5.0", "Content": "If you are a person that needs both mobility and ability to do work that requires creation, in other words input from a keyboard and mouse where a tablet just doesn't cut it - as in you create graphics or you code on the go or you do a lot of email or office on the go and you care more about performance and speed than  price this is the best solution out there. Am usually in the desktop mode although the touch screen is nice.", "Title": "Need to create or do work when mobile? Best performing solution.", "Date": "November 28, 2013"}, {"Author": "Ron Baakkonen", "ReviewID": "R2GM5Y0BCHKJR5", "Overall": "5.0", "Content": "The Surface Pro 2 brings the \"laplet\" form factor to the threshold of everyday, all-day utility. For the tablet user, it's just light and convenient enough to bring with you just about anywhere. For the laptop user, it's a full powered laptop beast - entirely credible as a laptop replacement for even the most demanding Windows 8.1 user. All of a sudden, there's a device that you can bring with you anywhere, but has the full power of Windows. You are not only consuming content, you can generate it as well.Need to review and sign off on a contract revision while you're at your son's track meet? No problem, fire up Word and use the stylus to add an actual signature to the document. Emergency code fix required while you're running between airplanes? Visual Studio is just a click away. Change a line, click compile, push the code and your manufacturing line is back in business. Try that with an iPad.However, this is more than just a great combined laptop/tablet combination. First, the attached keyboard cover and the stylus dramatically improve the experience. The stylus is an integral part of the design since the mouse track pad doesn't provide the necessary fine control of the cursor required for the sub 11\" screen. The stylus also provides a great \"pen\" experience that hasn't been available on previous tablets. For instance, you can create, sign and email a cover letter without leaving the Surface Pro, an experience that isn't so easily accomplished on other platforms. Second, the entire Windows Metro \"ecosystem\" is starting to wrest the \"cool\" mantle from the aging iOS experience. Case in point, the included Xbox Music service offers a streaming music service that is simply better than the competition - so good in fact, that I canceled my beloved Pandora subscription. Wasn't iTunes supposed to take over the streaming world? Watching videos on the Surface Pro's screen is a beautiful experience. Yes, the Microsoft Store still lacks the breadth and completeness of the Apple and Google offerings. However, that is more than made up for by the ability to run any Windows app, of which there are millions.Overall, Microsoft is showing itself as playing the long game. They are clearly hoping to leverage the power of a single user experience across all platforms - desktop, phone & laptop/tablet. There's a long way to go, but I see them closing whatever gaps remain faster that we'll see the re-engineering required to both iOS and Android to offer similar capabilities.", "Title": "Rock solid powerhouse - expensive, but a credible laptop/tablet combo", "Date": "May 19, 2014"}, {"Author": "Sourz", "ReviewID": "R1ZXR6PWWV0XLF", "Overall": "5.0", "Content": "awesome for taking notes,its likea tablet that runs every app. love the fact that i no longer have to carry around a laptop for my heavier software like excel, quickbooks, photoshop, etc. all in one and light weight!", "Title": "awesome", "Date": "May 13, 2014"}, {"Author": "Valor39", "ReviewID": "R1XSRTCW3BTJ57", "Overall": "5.0", "Content": "Being a long time user of Windows 7 and really liking it I was skeptical about Windows 8.  My first experience with Windows 8 was on a non-touch screen laptop running Windows 8.0.  It was clunky and difficult to use so I stayed away from Windows 8 for a long while.  Recently my work had me pick up a Surface 2 Pro and my experience has been altogether different.  Windows 8.1 makes things more usable and friendly and the surface it very nice.  I really like the screen look and feel.  The best part is that you can add the Surface Pro 2 to the domain and have access to domain resources.  It is expensive, but it's Microsoft so that comes with the territory.", "Title": "Surface Pro 2 with 8.1", "Date": "April 25, 2014"}, {"Author": "W. Gruening", "ReviewID": "R3QJOU1DYZQ80D", "Overall": "5.0", "Content": "This really is the best tablet out there hands down.  If only Microsoft had all the apps to go with it .....but eventually they will come.  On the flip side, this tablet works much better with my Windows Phone and is totally in sync with all my docs from MS Word, Excel, and OneNote.  It really is more than just a tablet.I own an iPad also and will continue to use it for some of the apps like Tivo Remote, Words with Friends, Flipboard, and others that just have not yet shown up in Windows 8 yet.As other reviewers have noted, the decision to buy this (and whether you rate it 3 stars, 4 stars, or 5 stars will depend on how you use it.  If you use a fair amount of productivity apps like Word, Excel, or PowerPoint and want to experiment with different Windows apps out there, this tablet is the cat's meow.  If you primarily read and send email, surf the web, and play games like WWF and Sudoku, then you should probably save your money and buy a conventional tablet from another manufacturer.The Surface is really a well built machine packed with tremendous power and visually is a sight to behold.  When you mate it with the Type Cover you have a full blown laptop that can match most desktop computers.  I bought the 128GB  Surface Pro 2 model with the Type Cover and a MS Wedge Mouse.  I also signed up for the MS Office 365 so all my devices (including my iPad) can share documents seamlessly in the cloud.  All have performed beautifully.  Just downloaded the new Windows 8.1 Update and now see even more improvements.  Microsoft is really working to make this the leader in its class and I think they have succeeded.", "Title": "Why did I wait.....", "Date": "April 19, 2014"}, {"Author": "Khagan", "ReviewID": "R40FYULGFETD9", "Overall": "5.0", "Content": "i spent about 6 month to learn the market of similar products before purchasing this surface pro in March, and what i have finely got on my hands and i'm already using it about 3 weeks it is exactly what i expected. great job microsoft!", "Title": "Definitly meets all my needs", "Date": "April 18, 2014"}, {"Author": "VanHow10", "ReviewID": "RS997TG4T6VVC", "Overall": "4.0", "Content": "I got this computer though my work, It is my main workstation, I also am going through college and thought it would be nice to have for it.  I was hesitant at first but after reviews and such I thought I would give it a try.The screen is the biggest downfall, although the resolution is better then monitors.  The resolution is almost to good for how small the screen is.  You have to find the right distance for the monitor for you to be able to view it.I have had zero issues with the speed of it, everything is real snappy.  It loads within seconds, which is useful when you are on the go. 4gb of RAM is good for what i need it for. and the I5 is still a good CPU.The battery life is incredible.  I can get 7-10 hours before a charge is needed without the \"power keyboard\"The only complaint that I have is that it gets scratched really easily.  Not the screen but the back paint will scratch off.  It would also be nice if it came with the keyboard.At my workstation I use duel monitors which is needed for this computer.  That works pretty good, not flawless though.  Sometimes the computer gets confused between the two different resolutions.Overall a good computer though.", "Title": "Great little computer", "Date": "April 11, 2014"}, {"Author": "Ivan F. Vargas Gomez", "ReviewID": "RTH3LCX3MD5YQ", "Overall": "5.0", "Content": "For me this one is the very first functional Tablet, it is great also for work tan for fun. I replaced my laptop with my Surface, thii one is the 3th I bought,, first I got a RT and my father took it for him, then I bougth a Surface pro, that one my wife took it, so now I bought this one I hope finally for me.", "Title": "the best tablet", "Date": "April 2, 2014"}, {"Author": "Judy Ann", "ReviewID": "R7AXI3157WNOF", "Overall": "5.0", "Content": "This is a great tablet/laptop unit.  So far, I have been getting familiar with the bells and whistles. But, I expect the tablet will replace my laptop almost completely. I still have a lot of exploring to do before I can comment any further.  But, so far, I love it.", "Title": "Surface Pro 2", "Date": "April 1, 2014"}, {"Author": "CML", "ReviewID": "R2Q8M40C8W7YG4", "Overall": "4.0", "Content": "The only reason I haven't given this 5*'s is because I've only owned it for a few days and still have a learning curve ahead.  However I thought that commenting might be helpful to other artist/photographers. While I am not a pro photographer, the camera is one very important tool in my art making practice.  I also write.  I have two high end Nikon DSLR cameras and wanted the ability to download images when the memory cards get full.  I did probably 60-80 hours research.  What I really wanted at the beginning was a tablet.  Not being a techie, I usually just explain what it is I want to accomplish and someone steers me in the right direction.  This time I had to do my own research. In the end I purchased a Surface Pro 2 which runs on a windows platform.  It's pretty pricey and I'm sure the regular Surface would also work for the downloading of images. For writing, the ability of loading full programs onto the Pro2 and becoming super portable at low weight and size was too much to resist.  I tested the Surface Pro 2 last evening and it is amazing as a tablet/laptop hybrid kind of thing and works brilliantly with both of my cameras (usb port for camera cable) and the added bonus...I can load Photoshop onto it too.  No special OTG cables  or conversion cards needed as would be the case with an Apple product or and Android platform....straight in.  Hope this helps other creative types. I cannot be the only one who needs these abilities.", "Title": "Surface Pro 2 for artists", "Date": "April 1, 2014"}, {"Author": "ZhengZH", "ReviewID": "R2P1AMOJ5CUVRE", "Overall": "5.0", "Content": "It's a powerful Windows pad. Light & convenient to carry & use. battery life longer than previous versions. The price still in high , but seller offer a reasonable price.", "Title": "Powerful, but light & easy to carry.", "Date": "March 23, 2014"}, {"Author": "Ernest L Hedrick", "ReviewID": "R3TA0B3WDEV5C6", "Overall": "5.0", "Content": "This thing rocks !!!!!!! Very fast, very smooth, good battery life. It would have been nice if it had come with office installed.", "Title": "Awsome", "Date": "February 5, 2014"}, {"Author": "Mbess", "ReviewID": "R3EF5Q1NURGEZ", "Overall": "5.0", "Content": "I own the 128 GB version of the Surface Pro 2 (the hard drive size can also be extended using a memory card)Pros:- Very good workmanship- Digitizer : This means that you can write with the stylus as you write on paper. Sure - you can buy pencils also for other tablets. But they doesnt look like normal pencils and everything you write looks like the writing of a 3-year-old child. Even numbers can be written in small fields. (Digitizer works great with program \" PDF Annotator \").Unfortunately, the pen is only available in black. A cyan colored pen ( color of my Type Covers ) would be more noticeable and you would take less risk of losing it.- Full Windows! Now I realize the benefits of ModernUI interface , which I havent used in non-touch notebooks.It's really a notebook replacement now, not like Android and IOs .- Opening multiple applications SIDE BY SIDE ( Multiple ModernUi applications or ModernUi and a desktop application ) .- Has a USB port , and another USB port on the charger cable for charging of cellphones- external keyboard allows fast typing ( - I recommend Cover Type 2)- The battery lasts forever . Wow! Most tests were made ​​even before the firmware update and therefore give a too low Run time. It lasts up to 11 hours (when I just work with it).Neutral :- The charging cable and the pin holding quite well on the device , but could hold up better .negative:- Cloud storage included and its a must to have a Liveid. I should be the only one who can see my files: Not the government.ps. If privacy is important for you, dont use the express settings during the first use.- Battery not replaceable / removable on your ownConclusion:The Pro version of Surface is a notebook / ultrabook / / folder full of handwritten papers / tablet in one device , so that the price is definitely very good.I am very impressed of this tablet!!!", "Title": "Alternative Notebook", "Date": "March 29, 2014"}, {"Author": "Robert I Scheinman", "ReviewID": "R17CWMNCP97ORQ", "Overall": "5.0", "Content": "I work in a medical research field and am constantly attending meetings or research seminars for which I need to take notes. I purchased a Surface Pro 2 with a 256G drive and I couldn't be happier. The pen writes smoothly and OneNote recognizes my writing without any additional training. I am left handed and the Surface suppresses the potential signal that my hand imparts to the screen while writing. I purchased the backlit keyboard and I found it to work reasonably well. The magnetic connection snaps the keyboard to the tablet easily without any fiddling. The keys are reasonably responsive (not as good as my desktop keyboard - but good enough to get plenty of work done). The battery life is good. I can use it all day without charging if I run in powersaver mode. Email tends to suck power when you are not using it. Turning it off when not in use really helps. Perhaps the best thing about this machine is that it is close to instant on. I wait all of 10 sec (approx) before I get the log-in screen. I have owned the machine for about 2 months and so far everything has worked. One useful tip is to never use the power button to turn the machine off. This tends to cause it to hang in some sort of sleep mode. I was hesitant about moving to Windows 8 (8.1 on my machine) but I found after a lesson that it is well designed and even intuitive. I have not used it to process large images or any other computationally intensive tasks so I cannot say just how powerful it might be however for all of my daily use: Microsoft Office applications, web searches, etc it has been great. I recently purchased the dock and am now using it as my home desktop computer. I love being able to use touch with one hand and the mouse with the other. All-in-all an expensive but great machine.", "Title": "Powerful device with fantastic writing recognition", "Date": "January 12, 2014"}, {"Author": "Kyle \"cylem\"", "ReviewID": "RX0B4PCQTVVM4", "Overall": "4.0", "Content": "So I the Surface Pro 2 was announced, it had finally got my attention. Really it was a great idea that just needed a bit of refinement and better battery life of course. Microsoft I think saw it had a good product, it just needed a bit more to entice people, and while I think they could have done a little bit more they got my attention with the Haswell addition. I have been using atom and core i based tablets since windows based tablets have come out and I fell in love with the idea, dropping my android tablet and any thoughts I might have to go back to IOS.Design: So looking at the Surface pro 2, I'm glad firstly that Microsoft didn't go with a standard size of 11.6 inches that the higher end tablets are using, instead they tried some other sizes and came to the 10.6 inch conclusion which keeps things a bit smaller and easier to use in tablet mode. It is slightly to thick in my opinion but I wouldn't say it's unbearable or anything. In the hands it doesn't feel to heavy either, I could hold it for a long period without much strain. One thing I'm not sure I like it on the right the included pen magnetizes on the charge port. Now I would rather have this that no storage but it's kind of annoying when you need to charge it. The kickstand on the back just makes me wonder \"why doesn't everyone do this? flat out it is genius.As far as ports, I am slightly disappointed about this also, it only has one usb port (and no way to add them without a dock) There really should at least be an added micro usb or something. Then they used a displayport instead of hdmi, which I understand that technically it is more capable but it is so much rarer that it sort of defeats the point in my opinion. I just bought a displayport to hdmi adapter for it. Also another annoyance is the charger for some reason I find frustrating to get attached right, sometimes I think I've got it and I really am just slightly off.Display: Pretty gorgeous, colors, viewing angle and all that are spot on, no complaints here.Battery life: Battery especially for this class of device is fairly top notch. Other devices with similar components and batteries don't seem to fare as well as the surface pro 2. On my Netflix test I was trending towards 8.3 hours which is fantastic. General use I could probably get around 8 or so hours out of it from my observations. Typing this I'm at 85% and it shows estimated 7hr 35min remaining.Performance: Microsoft really shows some strides in this department. From my testing they have one of the fastest windows devices with this hardware, especially since they don't seem to be throttling it at all.My benchmarks have been as followsCinebench: Cpu: 2.31 Opengl: 18.4fps3dmark ice storm: 397003dmark 06: 5826Skyrim lowest: 40fpsLeague of legends lowest: 80-130 fpsCrisis lowest: 35-50fpsThe performance in general use gives me no slowdown at all. I have had absolutely silky smooth metro and desktop performance. The surface is also the only windows tablet I've tried that actually will pop up with a virtual keyboard in desktop mode when i click on a dialog box. Pen performance, is as expected, if you have used a Wacom digitizer before you will be happy, haven't had any trouble what so ever with it and it feels like a real pen.Accessories: I bought myself a type cover too, I've heard some bad things about the touch cover so I figured the extra money would be worth it. So far it has been extremely good, it's thin and easy to use. I would say I might lose 15% of my typing speed which is acceptable. Usage is fairly easy on my lap with the kickstand and it attaches really easily, staying put without any worry. The only problem I have is the suede seems like it could get dirty easily, and I wish they would have integrated a usb port into it somehow. The track pad on it is fairly hard to use also, it doesn't really click and is really tiny, but still usable. I think i wish they would have made it from a smoother material, not just the suede that the rest of the keyboard is made of.Conclusion: So in the end I really love my surface pro 2, it gets the job done well for school, is fast, battery efficient and has great Wacom support. I do wish the design would include more than one usb port, and have hdmi, as well as a couple minor changes to make things like charging easier. I think as far as value it should have maybe came with a touch cover, leaving the type cover as optional if they wanted you to still buy accessories. I don't think I ever want to go back from the kickstand and type cover support, Microsoft has really sold me that they are the best windows tablet maker so far with this new try, keep it up.", "Title": "Microsoft has shown they can make amazing windows hardware, just need a few tweaks.", "Date": "January 11, 2014"}, {"Author": "esanta \"esanta\"", "ReviewID": "R3260WT6Y7G22B", "Overall": "4.0", "Content": "I must preface this review by saying that most people would consider me an Apple \"fanboi\" and pretty much a Microsoft hater. I avoid Microsoft products wherever I can, but I needed a compact and powerful portable computer for work, so the Surface Pro 2 seemed to be a good fit and we decided to give it a try.I have been using Windows at work in its many incarnations over the years, but this was my first close encounter with Windows 8, and I can only say... What on earth were they thinking? This thing is a complete usability train wreck, mostly because even as of Windows 8.1, the \"layer that used to be called Metro\" is incomplete. Thankfully, a little freeware allows you to customize the user interface to get rid of all the novelty Windows-8 stuff you don't like. Within minutes, my little Surface Pro 2 turned into a Windows 7-like computer, and what an improvement! Of course, the drawback is that now I have a computer that is not really very touch- or even pen-friendly; but at least I have a usable computer instead of a schizophrenic iPad wannabe.And what a computer! An i5 with 4GB of RAM, WiFi, Bluetooth, USB3, in a very, very small package.The HD screen is absolutely gorgeous, with bright, saturated, accurate color. The front and rear cameras are surprisingly good and provide good low light performance. The gimmicky stand does come in handy, and the speakers deliver just about as good a stereo sound as you could possibly expect out of a tablet.I also purchased the power keyboard cover, which increases the already good running time by 70% (expect a conservative 7 hours of video playing out of the miserly Haswell processor, quite a feat when you consider the CPU class, screen resolution and size)If you need a tablet for media viewing (books, music, videos) the Surface Pro 2 falls short: it's heavy, cumbersome to hold, and the selections on its app store are very limited. However, it is a very capable desktop replacement, perfect for a student.PROS---------- Fast CPU- Superb battery life- Gorgeous 1080p screen- Small form factor- Good cameras- Quality construction- It's a full-fledged, no-compromise PC- SSD storage- miniDisplayPort connector for external monitor- microSD connector- Great choice of optional accessoriesCONS---------- No user-upgradeable parts (RAM and SSD can't be upgraded, so choose your model carefully)- only one USB port (but it's USB 3.0)- microSD connector (a full SD card connector would have allowed the use of higher capacity cards at a lower cost)- Windows 8 is mind numbingly awful (my opinion, but I seem to be hearing that a lot -- however its \"improvements\" can be disabled)- HiDPI can cause programs to behave in an undesirable manner- In classic mode most programs can't really be used adequately with touch-screen or pen and require a mouse- can't be powered by USB or car 12V- the pen is easy to lose (it attaches magnetically to the side, but it sticks out and can fall off if it catches on something, or inside a bag)- expensive (although considering all you're getting I think it's very reasonably priced, and you can get the first generation Surface Pro for peanuts on discount sites if you're willing to put up with the much shorter battery life)So, is the Surface Pro 2 a good laptop replacement? Absolutely. A good iPad replacement? Functionally, yes, but its weight and thickness make it much less pleasant to use as a tablet, and the Windows OS (with or without Metro) is nowhere near as simple and easy to use -- but if you know your way around Windows, you'll get there. If you want a tablet for web surfing, email and playing videos, get an iPad. But if you need a full fledged computer and don't want to carry a brick around, the Surface Pro 2 is absolutely fantastic and I recommend it highly. Since the SSD and RAM are not upgradeable, I highly recommend you get the largest capacity you can afford (the 256 and 512 models do reach stratospheric prices, but much of the available space on the 64 is used up by Windows)If you like the Surface Pro 2 but can't afford the high price, you should consider the first generation Surface Pro. It's very similar in quality and performance, at about half the price (check the deal sites, the 64 model refurb has been going for about four hundred as of march 2014). Pretty much the only trade-off you're making is the battery life, which is about four hours on the first generation model. The Haswell processor on the Surface Pro 2 almost doubles that. If you don't mind the shorter battery life, it's a real bargain.I found out that a case I purchased a few months ago for my iPad happens to be a perfect fit for it: the STM Micro Shoulder Bag holds and protects the Surface Pro 2 with power keyboard in the main compartment, and has room for the charger in the front pocket.", "Title": "Somwehere between brilliance and insanity", "Date": "March 22, 2014"}, {"Author": "Jason F.", "ReviewID": "R3IOTG6NSCF2JM", "Overall": "5.0", "Content": "Wonderful product. The app store is lacking but has the basic apps. Using it as a computer replacement is working really well. All my favorite programs work well.  The pen is really responsive.  Buy from Microsoft, Best Buy, or Staples and don't pay the inflated prices on AMazon", "Title": "Good Product. Overpriced on Amazon", "Date": "December 3, 2013"}, {"Author": "C. Nguyen", "ReviewID": "R2RRXLO5RYFNC3", "Overall": "5.0", "Content": "I had an iPad, MacBook retina 13 before.  After owning the surface I sold my MacBook and the iPad.  I only carry one device now.  The surface pro 2 is very fast.  And it can do everything.  If you are an advance user, go ahead and buy the surface.Pros:Extremely fastExcellent battery life1080P Full HD screen that has very little screen reflectionsOn screen keyboard is excellentPerfectly built hardwareBuilt in Kickstand for lap or table useWindows 8.1 is great.Cons:1 USB portLacks mobile appsHeavy weight if you hold it in your hands. I only use it only my laps or table so the weight is fine with me.", "Title": "Best tablet for power user.", "Date": "April 15, 2014"}, {"Author": "Rob H.", "ReviewID": "RV0WV5MUHLP9L", "Overall": "4.0", "Content": "For the money it should have came with quick reference cards.  I don't like trying to find the information on line because you can get lost in it all as you try to flip back and forth from it instructions to the action your trying to learn.  Having a quick reference card is nice because you can read what the steps are while your doing them without losing your place.  would have given it 5 stars but I think it's way over priced but because I'm spoiled, I had to have it.  It is fast, compact, and very handy to have.", "Title": "Love it!", "Date": "February 23, 2014"}, {"Author": "Zach W.", "ReviewID": "R1LBUGTKMIZT8H", "Overall": "5.0", "Content": "This device is wonderful.  I originally got it as a replacement for my Macbook, which always seemed just a little from the moment I took it out of the box (yes, fanboys, I know I should've gotten the crazy expensive Macbook Pro).  I was expecting a laptop like I have a work, decent speed but nothing amazing.  Boy was I blown away--this puppy can cook.  I have never had performance issues, even when playing intensive games like MMOs.I also found myself using it much like a tablet, which was rather unexpected.  Windows 8 is actually a brilliant software when you use it on this device (I've never used it on a desktop with mouse, so I can't comment on that).  It's touch-intuitive and the movements just *make sense* rather than being based around someone thinking they need to throw in touch because it's the newest cool thing.The touch responsiveness is great, and I really, really, REALLY like the stylus to take notes and draw using Illustrator (well, my free version of it: Inkscape).  I feel like I'm writing on paper, but paper that can magically re-write my handwriting as typed text (note: you will need a paid version of OneNote for that feature).I haven't had any battery life issues or sleeps of death that I've seen other people talk about.  I guess I'm lucky.  When I play my games, it does need to be plugged in, but otherwise I can get upwards of 8 hours of use out of it.Overall, I would heartily recommend this device for anyone looking to get rid of a laptop and maybe downsize. It's just amazing.", "Title": "I love everything about it and will not go back", "Date": "January 15, 2014"}, {"Author": "Eddie \"Eddie\"", "ReviewID": "R344DE8QV3ASCW", "Overall": "5.0", "Content": "This is one of the best purchases I've made in a long time. I bought this because I do a lot of writing and I need a mobile computer. The iPad apps were too limited, and I couldn't find something that was fully compatible with Word. I thought the screen would be too small, but I've really liked my computer experience. I am able to design book covers with Photoshop, create videos and edit, and write and format in Office. There isn't anything I do that this laptop has had trouble with. I'm not sure it would be a good gaming device, but for productivity it's a winner. I can't recommend this highly enough - it's a must have tablet.", "Title": "I gave my iPad to my kids", "Date": "January 14, 2014"}, {"Author": "Bob Cadd", "ReviewID": "R3HYRJ6MO1ZWS7", "Overall": "5.0", "Content": "This is one flexible device.  Tons of memory and space, great screen.  I need to play around with the settings more but out of the box, doing fine work needs the stylus.  The stylus also is easy to knock off the Surface, so keep that in mind.  The charging clicks on well, but it is going to take some getting used to, too.", "Title": "iPad Killer", "Date": "January 12, 2014"}, {"Author": "R. Alembik \"Baudelaire\"", "ReviewID": "R2W947IIPA702D", "Overall": "5.0", "Content": "This machine combines all of the benefits of a topnotch notebook computer and an almost-as-good-as-an-iPad tablet in one machine. I'm no longer having to carry a net/notebook and an iPad all the time. It runs all of my standard windows-based applications without a hitch. it's not going to replace my iPad for quite a few things. But if I could only have one device this would be it.", "Title": "The tablet/notebook I've been waiting for all my life.", "Date": "January 8, 2014"}, {"Author": "Bennet Watson", "ReviewID": "R2FGBAWPSFSOQ4", "Overall": "5.0", "Content": "I was never a fan of tablets before I got my surface. Truly am awesome device that does all I need out of this form factor. Already looking forward to the new pro 3!", "Title": "awesome machine", "Date": "May 30, 2014"}, {"Author": "carlos", "ReviewID": "RVQV1MX12XVW2", "Overall": "5.0", "Content": "I love the way it works, honestly I am not a Microsoft fan, always been Mac lover, but this device really makes a difference, the only thing I did not like is that you cannot add a 4G wireless SIM card to it,", "Title": "Nice, Nice Nice. I love my Surface Pro", "Date": "May 21, 2014"}, {"Author": "Brian Sheehan", "ReviewID": "R9EPN5M4NYYS0", "Overall": "5.0", "Content": "Had a bad experience with a seller here and had to return it, but was able to get another one. Nice and fast with plenty of space and the 200gb of One Drive space and the Skype World give it more value than it would have against the competition. Bought it with the Type cover 2 in black and the combo works great.", "Title": "Great little computer that thinks its a tablet", "Date": "May 20, 2014"}, {"Author": "Paul Atreides III", "ReviewID": "R2KNWLYHWR0A4D", "Overall": "5.0", "Content": "It's fast, well made, and has an amazing screen. The Hasewell based i5 gives this a VERY usable battery life. I'm getting around 9 hours with a full charge with browsing and light gaming. Movie watching will bring that down to 6.", "Title": "This is Amazing!", "Date": "May 18, 2014"}, {"Author": "Bo7asoon", "ReviewID": "R1MBF9GGJQPCJN", "Overall": "5.0", "Content": "The tablet I recieved came with no keyboard .But they gladly sent me a keyboard when I complained about it", "Title": "glade doing business with you", "Date": "May 12, 2014"}, {"Author": "AK", "ReviewID": "R1H7WQJZVUOSP1", "Overall": "5.0", "Content": "this is the second one I bought..first one for me this for my son..we both love it..and a very good seller..very attentive I'd recomment the product and the seller too :)", "Title": "really good", "Date": "April 23, 2014"}, {"Author": "Robert Valentine", "ReviewID": "RWTX4JN3ZYLPS", "Overall": "5.0", "Content": "Very impressed with the product. The best tablet I have used with the convenience of a laptop. Incredible display. Very responsive. Acceptable battery life. A little heavy, but for what it does it is worth the extra weight.", "Title": "The Best", "Date": "April 23, 2014"}, {"Author": "DJ", "ReviewID": "R2U0A1RNL4L5CU", "Overall": "4.0", "Content": "We love the new surface pro 2.  It was everything we were looking for in a laptop tablet hybrid.  Great job!!!", "Title": "love it!!!", "Date": "April 20, 2014"}, {"Author": "Daniel Belut", "ReviewID": "R1F9N6FI1ME1X7", "Overall": "4.0", "Content": "The Surface Pro 2 is a Computer/Tablet for who needs to have a fast, soft and handy computer.It works perfectly with a lot of apps and programs and you can easily do with the Surface Pro 2 whatever a computer does.I already had bought an iPad and The Surface Pro 2 does whatever an iPad does and more (it runs with an Windows platform)For more information you can acces the microsoft surface website and also in youtube you can find out several comparisons between surface pro 2 and other tablets/computers/iPadsThe neggative point: It  came with a stuck pixel", "Title": "Surface Pro 2 Rocks!", "Date": "April 16, 2014"}, {"Author": "jassim alshamali", "ReviewID": "R3ODBF5BCEP95Q", "Overall": "5.0", "Content": "been using other tablets but this one is perfect for me for work..light and has usb port and Microsoft office, what more do i need!! thanks Microsoft", "Title": "where have u been all my life", "Date": "March 15, 2014"}, {"Author": "Joan T", "ReviewID": "R3KHUY40TWC141", "Overall": "5.0", "Content": "I love this surface tablet, I use it very day, I'm still getting used to the windows 8 setup but the tablet works great, I would highly recommend this tablet", "Title": "surface Pro 2", "Date": "March 12, 2014"}, {"Author": "Mike Brooks \"Tech & Media Enthusiast\"", "ReviewID": "R1234G7RJBCVUP", "Overall": "5.0", "Content": "This is an excellent tablet. Because this is tablet, people like to compare it to the iPad or Android tablets. It is not either. This is a tablet to replace your laptop (as long as you don't do high end gaming or design). There are only three things the iPad has on this device: weight, battery life, and smoothness of screen rotation. In performance, versatility, and integration into the corporate world, this is your device.I like the ipad. however, for all general purposes, it is a consumption device. With this machine you can actually create stuff and do real work.", "Title": "I've bought and deployed half a dozen of these", "Date": "January 16, 2014"}, {"Author": "Maria C.", "ReviewID": "RZNJFAQ4U01PM", "Overall": "1.0", "Content": "I was one of the lucky ones to receive a defective surface where the battery drains unexpectedly. I couldn't return it to best buy by the time Microsoft support told me I had a defective product (after several hours of pointless troubleshooting spanned across days). They promised me a \"new\" surface just mail it back and they will replace it. So I get my \"new\" surface. Scratches on the device and finger prints on the camera. Called Microsoft and they said oh this is a \"like new\" I got a refurbished one. If I wanted a refurbished device, I would have bought one and paid less. Microsoft's customer service policies are horrible.  Very dissatisfied with their service though the people are nice and courteous. Steer clear  until they can resolve issues permanently.", "Title": "Surface pro 2 issues continue", "Date": "February 21, 2014"}, {"Author": "Landis Fields", "ReviewID": "RQNHX65TOFZ9H", "Overall": "5.0", "Content": "First off Im a professional artist so i got relatively high expectations when it comes to my art tech. Ive owned a tablet pc in the past that i altered to fit my needs for art. I basically cut a usb key strip (called xkeys) the exact link I needed. It was pretty rad looking and was super useful but then again I like customizing my tools for art...I treat this stuff as digital art gear rather than pretty computer tech. Anyways, one of the things I liked when testing the cintique companion was that it had dedicate buttons on the bezel (more on that below). That said I opted for the surface pro 2 in the end and honestly she works like a champ. I couldnt be happier.The haswell i5 is actually a good thing...a banging i7 might seem tempting but honestly I cant tell you how nice it is to have loads of battery life when on the go. My last tablet was great, had a discrete (dedicated) graphics card but that and the 13 inch screen made it a bit of a beast for a sketch/sculpt book that I was after.  It also always had to be plugged in and honestly that sucks. I love taking this little fella to work without the charger, sculpting outside at lunch, sketching in meetings, and coming home at the end of the day with 70-80%  battery life. Im rarely this happy with my purchase so I just thought I would hare my experience.Oh before I forget, its kinda sacrilegious for me not to pimp out my tech in teems of specs but I think its important/impressive to mention that Im *only* rolling with the 4 gig model. It can handle quite a bit polys which I didnt expect. I usually just block in my forms and finish em off on my beast of a desktop but now im finding myself taking my designs further on the tablet alone. I love working on the couch, i hate setting at my desk the older I get. Anyways I wanted to try out the cheapest one they had (you can try out any model and return it without a restocking fee if it doesnt push the software and you decide you need more) but they were sold out of the cheapest model so they bumped me up to the 128 gig SSD for free (still with just 4 gig of ram). I was surprised to hear these have been flying off the shelves to be honest but now that I own one I get it. Its insane how small it is considering its a full up machine with a 64 bit os and for what I wanted (a truly portable sketch book) the screen is perrrrfect. Ive had bigger screens in the past and as nice as they seem it adds allot of bulk that Im trying to move away from. I work on a 30 inch all day so Im a real estate nut but this thing is exactly what I wanted. Anything bigger andit would sit and collect dust. I dont need another laptop and everyone here knows that the ipad is fun and games so for me it was between the Surface Pro 2 and the Cintique companion. I use this as a digital sketch book and sculpting on the go and this is exactly what i was looking for.Oh one last thing, I use the modbook wacom tablet pc pen since its got better ergo and 2 buttons.,The pen that comes with it looks pretty but Im used to intuos type pens. Also, I use the art dock which is an onscreen virtual hotkey tool specifically for professional artists (Maya, zbrush, photpshop, etc.). It works great...but...its lethal with the steel series touch control sticky screen buttons. Those are my new little best friends with the art dock. Im gonna try and paste this post/experience in other forums too since I had a hard time finding any serious art reviews on the surface (aside from penny arcade). Its a really sharp piece of hardware that is powerful and has banging battery life at a fraction of what it should/could cost.Hope this helps!", "Title": "Killer Digital Art Sketchbook!!", "Date": "December 21, 2013"}, {"Author": "Kent Zacherl", "ReviewID": "R18V0LNS35YGFD", "Overall": "5.0", "Content": "First off, Microsoft has shown what they can do when left to their own devices.The Surface Pro 2 a great tablet. Or laptop. Whatever you want to call it. The Accessories are amazing and make great companions (I'll review them separately.) The weight is a little tough to get used to but once you do, the portability and versatility of this device is astounding. Works exactly as expected and has exceeded my expectations. Any questions?", "Title": "Little trouble at first, seamless now", "Date": "January 11, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RKK0HKMHLSR0S", "Overall": "4.0", "Content": "The tablet PC fulfilled my expectations, which received such as this the product description at the right time to start using it.", "Title": "Good tablet pc", "Date": "March 16, 2014"}, {"Author": "FRANK VITAMANTE", "ReviewID": "R3DZY854O9C2V4", "Overall": "5.0", "Content": "If I could give the seller( My Wish-List)10 stars I would. The price dropped, from a different seller, 24 hrs. after I ordered it & after a few emails he gave me a credit which really surprised me.As for the surface, it's a blast. Win 8.1 definitely has a learning curve but once you get configured (I’m still running XP on a new Intel extreme comp - all parts from Amazon) it runs very well. Can run as desktop or tablet & either way it's a screamer. It's accepted, so far, all my old 32 bit software including Office 2003 with no problems.If your going to tie it to a monitor (I do sometimes) get the docking port it makes all the hookups (mouse, monitor & multi usb 2&3 ports - no hub needed) much easier.Many kudos to Amazon & its suppliers. It's a great company with terrific service & I've never been disappointed.", "Title": "AMAZING COMPUTER", "Date": "March 9, 2014"}, {"Author": "Ammar Alshamma", "ReviewID": "R1AKW49CU7GOSB", "Overall": "5.0", "Content": "So far, perfect in every sense.Thank you Microsoft, great product.Keep up the good work and I will continue to buy your products.", "Title": "Love it", "Date": "February 7, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R39TIZ7Q35LI9S", "Overall": "5.0", "Content": "*FYI - I did NOT purchase this on Amazon.  I purchased it at my local Microsoft store.I would like to start off by saying this is one of the most impressive devices I have ever used.  I purchased the docking station so now I basically have a desktop / laptop / tablet all in one.The speed of this machine blows my mind.  It boots up in 10 seconds.  For those who don't know how they feel about windows 8 - I really like it, but if it's not your thing, check on Google how to get it to boot straight to your desktop, and for the most part you will never have to worry about the windows 8 experience).The keyboard is great.  I can type fast and I can detach it very easily when I wish to carry it around while walking.The device is not necessarily heavy for what it is, but holding it with one hand for an extended period of time is probably out of the question.I am a student and I use the digitizing pen all of the time (it is comparable with ALL Microsoft office products and many others as well).  I can write just as neat as I can on pen and paper - it is an incredible experience for marking up PDFs, power points, or anything else like that.The battery life is incredible (7-10 hours) and the display is beautiful.If you are in the market for a powerful machine, there is absolutely no reason why you should not purchase this computer.  It is the best electronic device I have ever purchased...and I would consider myself an early adapter, so I have tried almost everything out there.You won't be disappointed with this device.  This was a huge win for Microsoft.", "Title": "Best Computer I have ever used - Ever", "Date": "January 24, 2014"}, {"Author": "Megan Paro", "ReviewID": "R10AW9GXMZCD8F", "Overall": "5.0", "Content": "this is bar the best tablet you can buy. you can pretty much do anything a pc can do. memory is never a problem because u can connect external memory via the usb port ... eat that ipad, oh yea, I use to have an ipad 2. are you a pc gamer? well this can play, you can connect you xbox controller to the usb port and play away. I am in the navy so the versatility of this tablet makes being away from the family a little easier and makes the down time go by faster. Thank you Microsoft for giving the consumers what they asked for. GREAT PRODUCT!!", "Title": "owned it for the past coupe months", "Date": "January 5, 2014"}, {"Author": "TJ  Cia", "ReviewID": "R3DSPC5P81ACEH", "Overall": "5.0", "Content": "I am so happy I waited to buy a tablet. This is exactly what I have been in visualizing for myself. 1 am Slow to new tech This was easy to use from the minutet opened the box. I have a Kindle fire that will now get some rest. We also just bought a new desktop I am afraid is going to gather dust. This is my new \"everything\" for 2014.Ican Keep everything on one tablet and I am an old fashioned yellow tablet user!", "Title": "Have waited for this product", "Date": "January 4, 2014"}, {"Author": "anthony newman sr", "ReviewID": "R1PISU8PFPTNRR", "Overall": "4.0", "Content": "This tablet meets all my expectations except for my misunderstanding. I thought it came with the Microsoft Office suite but that is the surface two which is what I should have gotten now I have to buy it.", "Title": "Well built tablet", "Date": "December 15, 2013"}, {"Author": "Sayigh Hassan Ali", "ReviewID": "R369YPH0L0XLXS", "Overall": "5.0", "Content": "I have the surface pro and its incredible  awesome its  power ,portability and functionality all combined in one stylish device  I bought this for my friend and I expect nothing less than the first pro", "Title": "thats what i call a taplet", "Date": "February 8, 2014"}, {"Author": "E. Duncan", "ReviewID": "R19GU66XEYHOWU", "Overall": "5.0", "Content": "I have one of these for work and I love it. I was resistant to 8 at first but began to love it It stable, fast and run on almost any machine. Naysayers of 8 haven't sit and used it. The Surface is a little heavy but lighter than a standard laptop. The stylus is a must for the Pro version, great for taking notes with One Note. I thought the 4GB of Ram and 128GB drive would not be enough but I have had no problems running what I need. I would recommend this to anyone for home or business. I would spend more to have this over a traditional laptop. The only suggestions I would have for Microsoft is to add an extra USB port and a place to attach the stylus.", "Title": "Have to say I love it.", "Date": "January 21, 2014"}, {"Author": "Bill", "ReviewID": "R1G5HZD6TTT1KF", "Overall": "5.0", "Content": "Pros: Runs full programs. I have Matlab, Visual Studio, MS Office, LT Spice and many more programs. I have minimal issues with it. Extremely portable. I has been a fairly viable replacement for my laptop. With the stylus it replaces the need to carry a notebook, paper or pens and pencils. The notes come out really clean and easily printable. This is a major bonus if your are a college student (such as myself). Works well with iTunes.Cons:Blue Tooth (But I think this is a windows issue)It seams to not like to sink with my iPhone via blue tooth very well but in all fairness I think that is a window 8 issue because my laptop didn't like to either. In order to get my blue tooth mouse to work, I have to shut the blue tooth off.Screen gets warm so writing can be uncomfortable for long periods of time. If you turn the brightness way down, it doesn't seam to be too bad.The kindle app is terrible for windows 8. Most of my books wont work, plus its awkward in the vertical potion. You can download the windows 7 version and it works, but it is designed for a mouse and a keyboard so if you expand the book, you need to be able to hit the escape but to get out of it. This kindle app issue is my only major grip with the entire unit.Type key cover: This touch mouse is terrible and boarders on totally unusable. I use an external blue tooth mouse or the touch screen.It needs a little work, but so far there is nobody else the has even come close to consolidating a laptop and a tablet, and its a fairly stable machine. I would not trade this device for anything other then a surface pro 3.", "Title": "Best device I have had yet.", "Date": "May 29, 2014"}, {"Author": "motomanmel", "ReviewID": "RVQ6DXM5WYC4Z", "Overall": "5.0", "Content": "This little compact computer is way more powerful and way faster than my desk top.I use it for 3D modeling and tool path its perfect for out in the field.", "Title": "Almost the perfect computer.", "Date": "March 13, 2014"}, {"Author": "Pat W Machen", "ReviewID": "R2K7VJA6NMPQQ5", "Overall": "5.0", "Content": "I have two \"work\" computers...this is my \"art\" computer. I am really enjoying the touch screen and portability of this Surface. Windows 8 had a learning curve to it, but it's okay...I prefer Windows 7. :)", "Title": "Am enjoying this...", "Date": "March 8, 2014"}, {"Author": "Thomas P. Meyjes", "ReviewID": "R9LP9PBFHIMN6", "Overall": "5.0", "Content": "It combines the pleasures of a tablet, but you can still use it as a laptop.For me the biggest problem is to get used to windows 8... I cannot discover the advantages over 7. I love working with this machine, it has only one drawback however: it scratches too easliy. I am treating it like nitroglycerine, but still managed to get a nasty scratch on the back... what a shame!", "Title": "The machine is great", "Date": "December 30, 2013"}, {"Author": "mohamed", "ReviewID": "R1KOJPFR3NN440", "Overall": "5.0", "Content": "Its been a great experience.Great performanceStylus is fabulous.I am using it all the time as business and personnel", "Title": "great experince", "Date": "December 22, 2013"}, {"Author": "GARY FEYERISEN", "ReviewID": "R2OUM2CVJGYA99", "Overall": "4.0", "Content": "The touch screen is not nearly as workable as an Ipad.  Sometimes you have to touch 5 times before it responds as it should. Needs more applications, haven't found too many I can use just yet.  And they aren't nearly as friendly as other tablet apps.  But it does play AVI files and you can load all your pc applications, and they work!  It also has a usb and a micro SD Slot that Ipad does not.", "Title": "Surface Pro 2", "Date": "January 7, 2014"}, {"Author": "Edgar H. Tan, MD \"The Healer\"", "ReviewID": "R1ABWAGJ7BXZPI", "Overall": "5.0", "Content": "On the first day that I used it, I was quite ambivalent whether to love it or hate it..... but on the second day, as I discovered how to use the unit I begin to realize how useful it is. I think it was a stroke of genius that Microsoft allows customers to use it for a month to decide whether they would want it keep it or not. This is a keeper and I am loving it even on day 2......The feature that I love the most is the kickstand.....this is the deal breaker compared to the other windows 8.1 tablet out there. I was deciding whether to get the dell venue 8 pro, Toshiba encore or the Asus Transformer T100. I had to visit B&H; and make sure I get to touch them before commiting. In the end I have decided that the surface pro is for me.... regardless of price difference and the need to purchase Microsoft office I am not having any single regret at this time.", "Title": "LOVING IT!", "Date": "December 17, 2013"}, {"Author": "eri", "ReviewID": "R98O7LTXWJSCG", "Overall": "2.0", "Content": "I bought my first surface pro 2 in December in hopes that it could serve as my work travel laptop. Setting it up went easy and it ran windows, BUT office is a separate purchase. So since I need word, excel and powerpoint for work I had to buy it. This was disappointing but not a deal breaker. It's a work purchase so the extra $$$ cost isn't that big a deal since I can expense it.2 weeks later my surface signals that it needs to be charged which in itself was no big deal, I plug it in leave it for the afternoon and at night I pick it up to use it and it hasn't charged at all. I plug it in again and it shows that it's \"plugged in but not charging\". I couldn't fix this problem and ended up returning it because I didn't want a tiny cool looking desktop.So I get another new Surface in exchange and the set up was awesome since microsoft saves your settings (email accounts etc...) associated with your microsoft ID. But then 2 days later the surface won't turn on. I plug it in and it tried again, no luck. I left it plugged in for an hour or so and tried again and it wouldn't turn on normally. I went online on my 5 year old dell laptop and found some people tried different button combinations (like volume + power), Tried it a bunch of times and got it to work finally. But with the two units I got I didn't feel like what I received was reliable. It's fine if I'm here at home and can return things or go get things fixed but if I'm overseas for work I'm SOL.My cousin has a Surface Rt and loves it. I wanted this to work so badly but I guess I'll have to look for another windows tablet, maybe by a company that has more experience with hardware.", "Title": "Wanted it to work so badly, but didn't...", "Date": "January 7, 2014"}, {"Author": "Gma", "ReviewID": "R1Y6N8LTN5IHHE", "Overall": "5.0", "Content": "Arrived on time! I was worried about moving to Windows 8, but I've found it to be great so far.", "Title": "Just as promissed", "Date": "May 6, 2014"}, {"Author": "Paul Evans", "ReviewID": "RINU8DY4GY673", "Overall": "2.0", "Content": "Have had my Surface Pro 2 for about 2 months.  By way of background, I'm a longtime software developer (using Microsoft development tools) and Windows user.  Got the Surface to replace (1) an old Windows laptop that was used mostly for client demos and (2) an iPad that was used for web browsing, video consumption (mostly Netflix and Slingbox) and a few games.  [Why not keep the iPad?  It was given to a relative with mobility issues.]  In addition, I wanted a device that I could use to take handwritten notes in meetings or on the phone ... and turn them into text.Closely evaluated the new iPad and the Galaxy tabs.  Ruled out the iPad because it doesn't do handwriting.  Actually bought a Galaxy, but returned it after 2 days (that's another story).Was a little concerned about the weight of the Surface, but it had everything else on the checklist.Here are some observations about living with the Surface: - Works reasonably well with Windows 8 apps, but ... there are relatively few apps that were of interest and the ones that I got were far lower quality than the iPad equivalents.Internet Explorer is decent, but ... the translation from landscape to portrait turns the text from too big to too small ... tried several settings ... hard to find a happy medium.  Also, it's 2 clicks to get to a favorite.  And you sometimes get quirky behavior ... e.g. trying to scroll by swiping zooms the text instead.The Kindle app for Windows 8 does not seem to sync properly with other devices ... the iPad, Kindle and Android apps would all sync perfectly and know the last-read page.  The Win 8 app syncs properly 1 time in 5.There is no Slingbox app.  Need to use the browser plugin.  This only works in Desktop mode.  It's not nearly as convenient as the iPad version.The Netflix app works very well ... and the display quality is very good.Working in Desktop mode is only practical with the keyboard/touchpad or stylus.  Fingers are way too imprecise ... gets burdensome quickly.  Speaking of keyboards ... why did they make the numeric keypad the opposite of what everyone else does??  The 1 2 3 are at the top instead of the bottom.  And the stylus ... the alignment varies from close to perfect to being off by 1/8 to 3/16 inch ... enough so you're hitting the wrong button or link.Waking up by opening the cover behaves inconsistently.  Some of this is due to whether it's sleeping or hibernating ... and whether a Windows update has happened since you used it last.  But you never know whether it will just open quickly to the welcome screen ... or you'll get the Surface logo and it will take some time to start up or you'll go to the login screen.Then there's the dual nature of Windows 8.  Where this gets confusing is with settings.  There are Windows 8 settings and then the old Control Panel.  Some of these overlap.  And it can be hard to remember where to go to set what.Did not do formal testing, but the battery life leaves something to be desired.  And it seems that a recent automatic update made it much worse.  A few days ago, noticed that even after being plugged in overnight, was getting low battery warnings after very little use.  Went hunting through the power settings and did not find anything amiss.  Thought that maybe the power cord was not connected properly but that wasn't the problem.Googled the symptoms and found the forums buzzing about a firmware update released on 12/10 that was causing all sorts of power issues.  Supposedly won't be fixed until January.  That may have been the last straw.  Too late to return it, but was thinking about putting it up on eBay.All in all, I'd say that the Surface might make sense as a laptop replacement with limited use as a tablet.  But for daily use as a tablet for browsing and video, it's way too cumbersome.  And while OneNote is great for handwriting and the stylus and writing surface are smooth and work well, the device is just too cumbersome to be practical for note taking while holding it or leaning it on the edge of a desk ... you need a large, clear area to put it on.Combining Windows and tablet functions seems like a good idea, which is why I bought it.  But this device come up way short on usability as a tablet.", "Title": "Usability As A Tablet is Poor", "Date": "December 20, 2013"}, {"Author": "Ty", "ReviewID": "RBEOCC60A73ED", "Overall": "2.0", "Content": "I was very excited to get my SurfacePro and start using it for Graphic Design, showing how Microsoft Surface could be a premier device for designers.That said, there is an element missing from the all Windows Tablets that have a HiDPI Display (Like the SurfacePro, and other high-end models)As a graphic designer, I was drawn to the Surface Pro tablet as it supported a pen input. The allure of drawing directly in Photoshop on a robust tablet was a key selling point for me.Upon purchasing a SurfacePro and installing the Adobe Creative Cloud I was dismayed to find the application very difficult to use, due to the user interface scaling. I've found that there is a long-term known issue with Windows 8 on HiDPI Displays when running Adobe Creative Suite or Creative Cloud software.The Adobe Creative Cloud Applications do install and run on the SurfacePro tablet running 64 bit Windows 8.1; HOWEVER, the program Menu options and tools are far too small to see easily and use with a touch interface. Essentially, any command you can't complete with a keyboard shortcut are extremely difficult to complete. Even using an external mouse to click on menu options is extraordinarily difficult as just seeing the menu options and tools requires looking very closely at the tablet and/or using a magnifier.Most of the other applications I use on the device respond to Windows Text Sizing settings in the Display control panel, including all other productivity suites I've paid for like the Microsoft Office Suite and use thus this issue seems to directly associated to Adobe's friction with Microsoft.After research, I've found this issue is related to Adobe overriding the Windows PPI scaling. Adobe has known about the problem for over a year and has made no discernible progress on fixing the issue while still increasing subscription costs for their large/expensive software suite. An Adobe Representative (Chris Cox) has been documented repeatedly stating the issue is wholly Microsoft's Problem in the following posts in reply to many requests to make progress on the issue.\"Windows had an attempt at High DPI support, that didn't work correctly, and was missing many necessary bits.  This is simply an issue where Apple was first to the ballgame with the hardware and APIs that worked.\"*\"Again, we are working WITH Microsoft on this issue.\"*\"We are dealing with it as fast as we and Microsoft can move.\"*\"Again, this is not a simple issue, and made more difficult by some problems with Microsoft's APIs. But we are continuing to work with Microsoft to get this solved. Again, Microsoft is aware of the issues, and we are continuing to work with Microsoft to get the issues resolved\"*\"...there are problems with the Windows scaling APIs, and we have been working with Microsoft to get that resolved. We are moving as quickly as we can on this - but sometimes we have to wait for the OS vendors to get things right...\"** = Chris Cox (Adobe Staff, source:[...]Other than those issues, which have highly disappointed me, I'd say that the Microsoft SurfacePro has been a good device. If I the above issues get fixed, it will turn a 2-star rating into a 5-star rating.I don't know where the root issue is with Microsoft or Adobe, but considering both companies make millions/billions in revenue and are considered software giants in the industry I find their lack of ability to address the issue proactively extraordinarily disappointing. Companies of their size should be able to test user interface issues well before products go to market, and if they miss something as glaring as not being able to functional use a $3,000 software suite on a $1,000 piece of hardware, then they should attempt to move quickly to correct the issues and they clearly haven't. -All the while, both products are clearly advertised as being compatible with one another. Compatibility in this case just means the software will install and technically function even though it is extraordinarily difficult to use.", "Title": "Great Hardware, but lacks expected Usablability with Software", "Date": "February 23, 2014"}, {"Author": "Midwestern Mad Man", "ReviewID": "R1UBEI5NO8Y51L", "Overall": "4.0", "Content": "I own this product and had difficulties at first, especially with Customer service for my inquires. The Microsoft Community more than likely will be able to help anyone solve their issues, but it takes patience. For the most part I am pleased with this tablet PC. It is the first one I have owned because the platforms just never seemed to be robust enough until now. I require additional software to conduct my business and work in remote parts of the world that do not have WIFI or internet access.If you don't have regular access to the net, like myself, then ensure not to purchase a cloud based software that you need everyday. I have a lot to learn with Windows 8.1 and have been using Windows 7 for quite some time. Change doesn't come without a certain level of anxiety or aggrevation.There is plenty to do with this tablet, Know that it's not as light as some of the competition, but is a solid piece of equipment. A PC in a small package. I can create a Hot Spot on my Android phone and wirelessly teather it to my Surface, which is very handy when I need to send or receive. I really wish that there were more options for entertaining Apps, but that's not why I purchased this PC. This is a working Tablet for the most part.", "Title": "I Thought I loved My First Tablet, But now I just like it. Maybe after more experience with it I'll love it again.", "Date": "February 5, 2014"}, {"Author": "Sniper3H12 \"H12\"", "ReviewID": "R2DMPWYQIVI0IK", "Overall": "5.0", "Content": "It is good and very usfull device I mean its a tablet an pc at once with high performance.  Go a head microsoft light us with more new technologies,  well done.", "Title": "well done Microsoft", "Date": "December 23, 2013"}, {"Author": "Jiang Wu", "ReviewID": "R1GV4OXR40VHOR", "Overall": "1.0", "Content": "I bought surface pro 2 two month ago. After playing with it for a while, I must say it is not a very stable machine. Anyone who wants to buy it should first go to Microsoft community for surface pro and see how many problems might occur. This can be as simple as connecting to store, attaching type cover to work. The recommendation is to refresh or reset your machine. Then you have to to reinstall all software. You should be careful about updates as well. The email system does not show attachment files in search results. The first few days the system was ok. But suddenly the store can not be accessed but the internet connection is ok. I have to reset the whole system. The store works ok but the type cover does not work. You can't type anything. I have to refresh. again. The type cover worked but the store can not be accessed and the updates can not be loaded. I checked the Microsoft community and there is full of reports of all kinds of weird problems. There are updates almost everyday and some updates cause problem. I really don't recommend it to average user.", "Title": "a candid report", "Date": "February 14, 2014"}, {"Author": "MD Sam", "ReviewID": "R17Q5XHX80DWXD", "Overall": "2.0", "Content": "How I wanted to like the surface pro 2 when I bought it at the beginning of January!I was the perfect customer:- travel 75% of the time and wanted the best webcam for skype possible. Corporate VP of MS Surface, Panos Panay, boasted that it this was it at the product launch.- have carpel tunnel syndrome and desperately needed the ability to use the pen input at times- require full microsoft office integration for businessIt fell short in every way possible:- the front facing web cam is TERRIBLE. Even though it is advertised as the best for Skype, I barely look anything more than a silhouette.- the pen stops being recognized at random times, and I have to re-start to fix it. Other times, it will be recognized a couple inches below where the pen is touching the screen.- the keyboard will stop being recognized at random times. Sometimes I just have to pull it apart and click it back. Other times, I will have to switch to the on-screen keyboard until I have a opportunity to restart.- the touch screen will stop working or freeze at random times- the promo with 1 year free of skype wifi is useless, since it will only be free if you use the metro app and the metro app does not seem to work.. even though sykpe wifi will connect with the 'Skype for desktop' installed on my SP2 or on my other computer in the same situation, I am charged in those instances.- the other metro apps I use (kindle, audible, etc)  perform very poorly. For example, every time start the audible app, it will start on the first book I listened to, not the one I am currently listening to. This is not something microsoft can fix really, but it definitely is a worse user experience than Android.- In the same vein, anybody who uses gmail will find integration impossible or a pain in the butt. Not sure which company is to blame. I just wish I knew that before buying.Finally, perhaps the most frustrating thing is the tech support experience. I have called in multiple times and had to wait 30-45 minutes on hold, followed by an hour of fruitless trouble shooting. AFTER 10+ HOURS OF \"ASSISTANCE\", NOT A SINGLE PROBLEM MENTIONED ABOVE HAS BEEN FIXED. Instead I am required to perform non-specific steps like a system refresh that destroys the tens of hours of work I've done setting up the my system and has no effect on the problems anyway.What is worse, since I am traveling and not back in the US for 3 months, I cannot exchange this thing. In spite of being one of the most international companies in the world, they are not set up to do repairs or exchanges in Europe for products purchased in the US. HP and Dell are able to do this. I really regret buying the extended warranty and would not have if I had known this limitation on it.Overall, it leaves me with the impression that even though Microsoft has been selling hardware for years, they are not ready for the big leagues. I would not recommend anyone waste their money on Microsoft hardware, lest they also end up wasting countless hours of lost productivity and frustration like me. The product and after sales service is a joke.", "Title": "Disappointing", "Date": "February 2, 2014"}, {"Author": "Geoff Ables", "ReviewID": "R2YJYOIK8P04ED", "Overall": "3.0", "Content": "We purchased 20 Surface tablets for our company.  So we have a diverse range of feedback and user experience to base this opinion on.  The bottom line is that these are highly functional devices that we like ... when they work.  But 6 out of the 20 (over 25%) required repairs that took a trained technician over a day to fix; and two of them (10%) had to go back to Microsoft.  We want to like our Surface tablets, but we wouldn't recommend the purchase one until the quality improves.Although this review is posted under the Surface Pro 2, our purchase was limited to Surface Pro units. With that said, we are a technology shop and are aware that the architecture between the Pro and Pro 2 is similar - users of the Pro 2 will see most of the same pros and cons that we did (and I have noted those areas where the Pro 2 offers a benefit). I am posting this here because few other reviewers will have the experience with a large number of these units as we did.PROSIn general, these are extremely functional devices and I've found that I have been able to replace my complete laptop PC and my iPad tablet with this device.  Our team consists of developers (using development tools like .NET Studio), consultants (mostly using Word and PowerPoint, plus various tablet apps) and administrative personnel.  Everyone reports that they have been able to completely replace their desktop or laptop machines with these devices.  For the consultants in our group, the ability to take notes using a stylus in OneNote is outstanding.  These are powerful machines that you can use as a laptop or as a tablet.  They are a bit clunky to use as a complete tablet replacement (I purchased a Kindle reader for reading in bed - the Surface is just too bulky for this) but that's the trade off for having full laptop capabilities.CONSOut of the 20 of these devices that we purchased, 6 of them have had significant issues that have required at least one full day to resolve.  That's over 25% with problems!  And, of those, two of them had to go back to Microsoft for a replacement (that's 10% of these devices that required a replacement)!  That is an extremely poor track record and, for that reason alone, I can't recommend these and wouldn't purchase a Surface of any type again until we are certain that quality standards have improved.As noted by others, the add-ons for these devices are very poor.  They keyboards (the track pad in particular) leave a lot to be desired - they fall far short of the excellent quality available in Apple products.  The add-ons are also significantly overpriced.The Surface Pro 2 has address some of the other issues that we ran into (battery life, dual angle kickstand).  Other than that, the pros/cons list between the two units is the same.If Microsoft could address the quality issues that lead to such a high rate of failure, it would get 5 stars in spite of some of the other shortcomings.  In general, this is an impressive machine and I really want to like it - but the quality problems cause too much loss in productivity to make it a viable solution in the future.OTHER OPTIONSI am a big fan of the Windows 8 OS, as are most of my colleagues.  There are other laptop and tablet options available and, at this point, I would recommend considering one of those over a device manufactured by Microsoft - they just don't seem to have it right yet.  When I get an opportunity to work with another tablet running Win 8.x, I will update this review with a recommendation for/against the competing device.", "Title": "Amazingly Functional - Very Poor Quality Record (6 out of 20 of ours required service)", "Date": "November 9, 2013"}, {"Author": "Steven Excell", "ReviewID": "R34H7VKB2HW582", "Overall": "2.0", "Content": "Try taking minutes at a meeting in a room with no WiFi.  You can't. The Microsoft Surface Pro 2 requires constant WiFi to access the cloud-based apps.  Want to take it bird watching in the boondocks to record your sightings? Forget it.  If you hang around a WiFi coffee shop 24x7, then this would work for you.", "Title": "Cannot use appication if you do not have access to WiFi", "Date": "March 30, 2014"}, {"Author": "Barbara Mcauliffe", "ReviewID": "R2VGJNXRAO253H", "Overall": "1.0", "Content": "I’ve had this device for over two months now.  Up until last week I loved it for surfing the net. Well, that’s changed now.  There was an update last week that somehow made the back button disappear, the place where you type in a search term went away and so did favorites.  It did allow you to go to your frequently used sites. Only because I like to check out the Bing pictures every day did I have a search engine. It was fixed within hours but…I don’t do gaming like some people.  I’m happy with MS solitaire and mahjong and these are all right on the SP2, but sometimes you go to the game and it starts up and reverts to the main menu.  I read that this is known to MS and a fix is in the works, but…I find the battery life to be good, about 6 hours using the video recorder and One Note on the split screen.  It is heavy, but the day a bunch of turkeys came into my yard (birds not neighbors) it was light enough to grab and run around after them taking pics.  Honestly, I don’t really imagine myself holding this up in the air for any amount of time.The screen kind of fades and brightens a lot.  Again this is supposed to be on MS fix list, but it persists.But the thing that gives me a constant headache is using this dog for anything other than entertainment. I bought this to use in a class.  The purpose of buying this device and Office 365 was the promise that all would work seamlessly.  You can get video to copy to One Note (not the free One Note which does not accept video according to MS, I’m talking about the One Note in office 365) but you have to change the file type.  This isn’t that big a deal, but really??? Its MS’s big time machine and One Note is a huge thing for MS, why doesn’t the video record in the right file type?  Of course One Note (in Office 365) actually has a video record button itself.  But that only records the camera facing me.  Honestly, I’d rather record the professor.Nothing will save to One Note.  Rather, noting will save to the One Note in Office 365. You can save links to the free One Note and only links, not the content.  To get anything to save in One Note you have to save it to the computer then print to One Note. Is this what they call seamless? I need web pages and emails stored in class notes, (and not links because this is a horticulture class, we are not always in range of wireless) this is so clunky I want to scream. The One Note/Surface combo is something MS is supposed to be so proud of.  It is a failure.  Period.E-mail!!! When the machine was new and I turned it on it said something like…we know you don’t want any social updates so we aren’t sending them to you.  If you decide you want them do something or another.  In my excitement to see what was on the machine, I just went ahead.  It had to be obvious how to get my emails back, right? Hah.  It took days to get what MS was calling sort of but not quite  junk and what I call my calendar for the following week,  back in my mailbox.Even worse is some days I get a “We can’t contact Hotmail right now” message when I try to check email.  My phone can get my email, why can’t my Surface?  It’s not the wireless, I’m not in the field.  If I can’t be sure of getting my email what use is this thing?Another problem is the crappy help system MS has devised for this thing.  Each screen has its own help.  If you think the help should be on screen one but MS has decided it makes sense for help to be on screen 8 you are screwed. Why don’t they have one central help? And while we’re at it, why don’t they have an index so if you thing something is called “A” you can still find it even though MS calls it “R” The way it works now is inane. There is a main page help, but really it’s just a brag page, like Wow we can do this.  Well, I already got the darn thing; you don’t have to sell me on it. Tell me in detail how to use it.  I haven’t been so frustrated by a computer since the DOS days.The type cover is fine but the mouse pad thing on it simply doesn’t work.  You know all those ads with people snapping down the key board and starting to work.  Hah!!! How do you think they would look if you were told the truth.  Snap down the keyboard, attach the mouse then start to work This is a huge failThe pen works fine, the holder is a joke.  The slightest touch will disconnect it. Another failI so looked forward to getting this.  I love my Windows Lumina 925 and thought this would be even better. But, I can’t recommend this to anyone.  Maybe in a few years this will work, but it doesn’t now.  I’ve read on this site among others that it’s hard to make a hybrid.  Well, I’ll go along with weight part of that, but the rest, no.  They have all the programs on this but it’s as though no one thought to actually try them out on the device.  There are probably other students who need a computer for classes and can use their phones for real light weight things, this would be perfect if it worked.  It doesn’t work.", "Title": "I've had this for two months now and it give me such a headache", "Date": "January 10, 2014"}, {"Author": "worknstiff", "ReviewID": "RNFUDZUHA5JPR", "Overall": "3.0", "Content": "Did not buy from Amazon --Microsoft Store refused to publish my REVIEW, wonder why?I just bought a Surface 2 Pro and had it a week before I returned it. From all the reviews and all the specs, I couldn't wait for it to finally arrive. Oct 22'nd finally gets here and that morning I was waiting for the BestBuy to open. YES!, I am admittedly a MS fan-boy, and LOVE the windows PC experience, at least until Win8. I was kind of  surprised that they didn't do a midnight launch like for a PS3 or an X-Box, lol. I rushed home to play with it and loved the responsiveness and the gorgeous 1080p screen. Then you get to the desktop and WOAH, look at the tiny little task bar and the tiny icons. Microsoft's fix was by default to use 150% magnification and it still wasn't enough and I had to do 200%. I was pleased with this until I tried to open up programs on the desktop and they were zoomed off the screen. WHAT! Microsoft never tried to open any programs from the desktop and noticed the scaling problems? Then I tried to watch some 1080p video mkv's with the Start-Menu X-Box video player app that can't even see them let alone open them, it's just for mp4's, and wmp's. WTF!, Microsoft's developers don't even give you a native mkv video player built-in, this on a 1000 dollar tablet hybrid. Ok, lets go to the Microsoft App Store, surely after Win8 has been out for a whole year there must be ton's of excellent video player app's that are touch optimized just for Win8 tablets. None of the dozen, paid or free that I tried were acceptable, either they couldn't handle the mkv playback or didn't have touch capability. Next I installed TMT6 from the desktop and it did play just beautiful BUT, the touch interface had problems unless you used the mouse and the image brightness and contrast controls were greyed out. Did Microsoft not think that anyone would ever want to play HD 1080p mkv's on this tablet? Say you were staying at a hotel and wanted to use it to watch a movie, sure you could hook it up to the HDMI and get a great picture. That is if you have a micro-display port to HDMI cable that Microsoft doesn't include, and then if you want to pause or fast forward you have to get up and go across the room to pickup the surface and tap on it. What about including a cable and a credit card sized remote control like my 150 dollar Sony watchman had, or at least a smart-phone app with blue-tooth controls. No!, Microsoft could not think outside the closed box and really make a killer video tablet appliance, no lets just make a plain old boring desktop with a keyboard. Next I tried to open a pretty standard e-pub or mobi file with the provided Reader, WTF! It won't even recognize those file types. I go and download the Adobe Reader which does open PDF's, but nothing else. Next I go and download Adobe Digital Editions and get it installed, but WAIT, it doesn't have a Start Menu app and has to be run from the desktop, but WAIT, it also doesn't do SWIPE with your finger to change pages. OK, I get it. Microsoft doesn't care that you bought a 1000 dollar PC & Tablet device with the latest Win8.1 on it and it's not user friendly after being marketed as the best touch OS EVER!. They have all these highly paid engineer's and developers on the payroll who I guess go home at night and use iPad's and android tablets to watch their HD videos on tablets using the great (even the free version) MX-Player that I use on my Galaxy Tab 7, and using FB-Reader I use on my EVO4G to read e-pubs. No wonder Microsoft is going down the tubes, or at least I hope they will because they treat their customers like idiots. I should not have to wait until VLC makes a Start Menu MKV player, if Microsoft is SERIOUS about wanting to become a real player in the mobile marketplace then MAKE SOME USEFULL START MENU APPS! I should not have to crawl around the internet finding, downloading and installing crappy app software when last time I checked Microsoft was in the SOFTWARE BUSINESS.", "Title": "Microsoft Store won't publish this Review", "Date": "November 2, 2013"}, {"Author": "SBK479", "ReviewID": "RX54JPIGBFN8", "Overall": "1.0", "Content": "(Update 3/9/14: Wow, the Microsoft fanboys (or maybe employees) are really proving my point with the downvotes. You'd think if they just made a product that, you know, didn't crap out after three days, they wouldn't need a PR-downvote squadron. PS, can I maybe get part-time work as a professional downvoter? Maybe it would help pay for school.)I'm writing this review on the laptop I got in exchange for the Microsoft Surface Pro 2 that I bought three days ago. It decided that it didn't feel like working anymore, so the touch interface and keyboard just stopped responding in any time shorter than 45 seconds. I couldn't even kill the process through the task manager because that froze too; nor could I even reboot it. Instead I got a laptop made by a company that believes in making products that work. FYI - Best Buy made the exchange process very easy.I needed a Windows machine for a grad class, and I had heard good things about this one. Frankly, I'm insulted that something this blatantly broken and unfinished was released with a $1000 price point.You'd think after 30 years of stealing other people's ideas and putting out one substandard product after another, Microsoft would understand that consumers will only take buying crap for so long. It's not good business sense to continue to market this trash and just assume consumers will buy it because they have no other choice. Market dominance is not an excuse to treat customers like this, nor is it something that lasts forever.(PS - for those who would downvote this review because they love MS products, spend your money however you wish and may God bless you. Bill Gates does not need you to stick up for him.)", "Title": "Task Manager (not responding)", "Date": "March 5, 2014"}, {"Author": "Beth Hubbard", "ReviewID": "R30V2HMDJR6YZO", "Overall": "2.0", "Content": "Surface 2 is great looking but I am dissappointed that it is a little hard for me to see normal type size!", "Title": "Small font size", "Date": "January 1, 2014"}, {"Author": "Mary Ann", "ReviewID": "RHJQ97DA8DB1Y", "Overall": "1.0", "Content": "It is a mistake to by Microsoft Product these days.  Let me share my story.Recently I made the decision to update my technology, and after lots of research came to the conclusion that the best thing for my needs was to buy a Surface Pro 2.  The thought was I could buy a system that would act like a tablet (a large and heavy one, but still a tablet), laptop, and desktop computer depending on my varied needs.  I thought I could use the docking station (with my wireless keyboard and large monitor) when at home to use full applications (like Office, Adobe ect.), attach type cover 2 when I needed laptop functions, and use the tablet to surf on the couch or read articles leisurely on the web.  I could even use the tablet to watch movies on a plane or when working out.  Sounded like a real good solution to me.  Frankly I didn't mind the fact it cost significantly more than other products as long as it could take care of all of my needs.As an aside, I have a long history of using Microsoft products all the way back to DOS.  I have invested many hours becoming an expert at PowerPoint, Word, Excel, and have lived through the many iterations of Windows.  In fact I have been a long term shareholder of Microsoft and thought they may have found their way back.  The Surface Pro 2 would help them use the legacy advantages they have established over a long period of time. In short I was rooting for Microsoft.Now to my experience.  I ordered a Surface Pro 2, Type Cover 2, Office 365, Docking Station, and VGA Adopter (for use when giving presentations on the road).  Spent a good deal of time researching just what I needed.  8 gigs of Ram, 256 gigs on the hard drive, and a bonus of 200 gigs of storage on Microsoft’s cloud.  Hell, if I got a Windows phone everything would sync without me having to do much of anything.  I could access all my files wherever I was and on whatever device I was using.  Finally someone gets it!  It cost me almost $2000 for this outfit, but it would be worth it if it worked as advertised.  I would be able to use my legacy knowledge, all my files, and it would tie me in to Microsoft for a long time to come.Boy was I wrong!  When everything was delivered I was excited about spending the time to get everything set up just right.  I started moving my files to “SkyDrive”, started to configure Windows 8.1 just like I wanted and it seemed like I finally found what I was looking for.  I was ok with the fact that the Windows App store was a little light on usable applications and was sure they would catch up with Apple, Google, and Amazon in the near future.  First issue was that my Surface would not fit flush in to the Docking Station.  The Video prong on the right side of the Docking Station would not fit into the Surface Pro 2.  Thus the 5 power tines just above it would not line up and it would not be able charge. I immediately called Microsoft support and explained the issue to the technician (Kaleb with a “K”).  After I spent all kinds of time defending the fact I was not an idiot and was fully capable of placing the Surface correctly in to the Docking Station, he said he wasn’t sure if it was a defective Surface, or a defective Docking Station.  He told me he would set up an appointment at the closest Microsoft store and assured me he would get me up and running ASAP.  He kept me on the telephone while he made an appointment for me the next day at the store at 11 am.  I did tell him I had been to the store previously when researching and had not found them particularly helpful.  The store was at Washington Square Mall in Beaverton Oregon, right in the backyard of Microsoft.  In my previous visit they told me all their products were “sold out” and that in fact the Docking Station was not even released yet.  Funny thing was that when I researched the Docking Stations, they were all over the internet and I ended up purchasing one at “Best Buy” online.Kaleb assured me I would be taken care of and not to worry because he had spoken to the store reps on the phone and had everything set up.  He gave me the case number to reference and told me he would follow up with me the next day.  I showed up at the store 10 minutes early and saw the 4 reps working there standing around with only one customer there. I stood there for a few minutes before one of them finally came over to me and asked me if I needed help.  I explained why I was here and told him I had an appointment at 11am as referenced by Kaleb’s call to them the previous day.  The rep immediately told me there were no technicians there and I should come back at another time.  I told him I had an appointment and referenced Kaleb’s call and the case number.  He told me I must be mistaken and that he (Kaleb) probably made the appointment at the Pioneer Square store in downtown Portland. I responded that I was sure he made it at the Washington Square store.  I told him that my Surface Pro 2 did not fit in to the Docking Station.  He told me that the Docking Station was not released yet and he could not help me.  Funny thing is that I had the Docking Station with me.  In addition the VGA Adopter only works with the Surface RT and does not work with the Surface Pro 2.  He told me there was nothing he could do to help me.Walking back through the mall I passed by the Apple Store and saw it filled with engaged customers and service reps.  They all seem to be pretty happy.  When I purchased my wife’s IPAD mini for Christmas the reps could not have been more helpful.I have sent my Surface Pro 2, Docking Station, Type 2 cover, Office 365, and the VGA Adopter all back to Microsoft.  I can’t invest any more time in a platform and company that doesn't’t care about its customers.  Great companies start with their “customers” and work backwards.  It doesn't matter what your strategy is, if you don’t take care of and listen to your customers, you are bound to fail.  I am sure my experience is not unique.I will be selling my shares and am sure Microsoft is going to become irrelevant in the future!", "Title": "Microsoft Just Doesn't Get it!", "Date": "January 9, 2014"}, {"Author": "debbie", "ReviewID": "R395OR1UW0W0I6", "Overall": "3.0", "Content": "No instruction book. I assumed that Microsoft was installed for the price. Now, I have to download for 99.00 ,and this is a Microsoft Tablet. Very misleading to the customer.", "Title": "rating", "Date": "February 13, 2014"}, {"Author": "MD", "ReviewID": "RXB3MGCR368RQ", "Overall": "1.0", "Content": "I've had the surface pro 2 for several months now. Get any other laptop, please, as this is garbage.The keys on the type pad stick, so in effect, every few sentences I type, the screens wildly switch because the computer thinks that alt or ctrl is being held down. There is no fix from Microsoft for this. Half the time when I click on the X on the top right corner to close something, it completely doesn't respond, either from the touchpad or directly on the screen. The pen is useless - it connects to the same port as the power charger, so you can't keep the stylus around at the same time that you're charging the tablet.Everything is subpar - even windows 8, which was made for the surface. It feels like Microsoft added layers in to frustrate users. Many things are less intuitive, and to do basic functions requires more steps, because Microsoft wants you to work on windows 8 their way, passing by the app store and their stupid start panel every time. It's horrible - simple actions now take far more clicks, on the totally unreliable keypad or with the stylus.There is only 1 USB port, meaning only 1 peripheral - if you want to use a separate mouse, no speaker or keyboard, or external harddrive, ect. Good luck getting any real work done without a mouse, as the trackpad jumps every time you lift your finger and the screen touching is totally inaccurate.I really wish I had bought anything else.", "Title": "So much promise, total junk", "Date": "May 3, 2014"}, {"Author": "J. K. Yuhas", "ReviewID": "R2MO58LLIERMO1", "Overall": "3.0", "Content": "I have not had it very long but it is not as easy to use as my iPad.  It seems a bit heavy and large.  But I was able to load last years Turbo tax and also 2013 version so I will be able to prepare my taxes while snow birding in Palm Springs.  That is the main reason I purchased the Surface but I had hoped to also use it to upgrade from my iPad that keeps crashing.", "Title": "Not like an iPad", "Date": "December 30, 2013"}, {"Author": "Jay R. Blanchard", "ReviewID": "RP0GBJ3SASJ1S", "Overall": "1.0", "Content": "I needed something that was basically a laptop and a tablet.  Also wanted to be able to use usb and monitor.  So they pretty much funnel you to this.I loaded a few things (i.e. adobe) and the new updates.  And now can't do a thing with it. Commands take 5 minutes or more.So frustrated.", "Title": "Typical MS New Product Issues - PITA", "Date": "January 26, 2014"}, {"Author": "VeritasluxMea \"Neoplatonic Platonist\"", "ReviewID": "R1KOE9FQA1LJ1R", "Overall": "1.0", "Content": "Unlike other people that leave bad reviews WITHOUT actually having owned and used an item, I had a one month go as a borrow of the Surface 2.  Yes, Im an Apple fan, but also have 4 Windows machines, I can approach anything realistically and judge it on its merits without being a fanboy or fangirl.Outside of the counter-intuitive OS which was utterly horrendous, I experienced user difficulties galore, it was a pain, and typing induced self-destructive feelings of hopelessness, it was just misery, and sandpaper against my desire for productivity.At the same price as a Macbook Air which can do 1000X more AND run Windows (if you want), this was a pathetic device I was glad to borrow and HAPPY not to have purchased or owned.For $500 it would be a stretch, but at the price of a FINE ultrabook, this device give pathetic a whole new definition.", "Title": "Same price as a Macbook Air, yet doesnt do 1/1000th as much. Insane", "Date": "May 10, 2014"}, {"Author": "a10fjet", "ReviewID": "RJN9QF2R5YGVS", "Overall": "4.0", "Content": "...at the ASUS NV550 touchscreen version ASUS N550JV-DB72T 15.6-Inch Touchscreen Laptop before you buy this Surface.If the fact that the \"touch cover\" detaches doesn't matter that much to you, then the ASUS is going to be much much better for you for the same cost or cheaper.It has-* 15 inch screen* 1TB HDD* Instant on sleep state, just like your phone* twice the RAM* dedicated NVIDIA graphics processor with 2GB GDDR3* i7 processor* DVD multi bay which you can swap out for SSD (this way you can boot apps from the SSD and store files on the included 1TB HDD)* more ports:# multicard reader# VGA port# 3 USB 3.0 ports (seriously what is the point of ONE USB 3.0 port and two USB 2.0 ports? Transfers between drives are still going to be limited to USB 2.0 speeds. who's idea was it to only include one new one and two old ones?)* the ability to stand up without a kickstandBoth have* 10 point multi-touch screen with 1080HD resolution (touch is optional on the ASUS but i'm comparing to a tablet, so...)* backlit keyboards (one of them is not included)* HDMI out,* the same programs and OS.* comparable battery life (5.5 ASUS :: 6 Surface and these numbers are very conditional)* ultra portabilitySo far all i can find that leans toward the surface is its reduced weight, rickety pen thing, rear web cam (how often are you going to use that? just turn the camera around) and inclusion of Windows 8 PRO instead of regular.The ASUS can be had for hundreds less (that's not including the additional cost of the touch cover)So far it's hard for me to tell what this surface is meant for because it's occupying some weird nebulous no man's land between work and play. It's not exactly strong enough or \"practical\" enough for serious tasks, but packs too much for casual endeavors. They are marketing the crap out of it but still making stupid decisions like leaving out the keyboard and not including Office... And to me the separate keyboard isn't even a benefit, and if it were, it certainly wouldn't outweigh the upgrades the competition has to offer. I think when they tweak it some more it will start to take off.No i don't own this thing, I'm trying to give some other options for people considering it because I was about to buy it until i found other better things.", "Title": "You might want to look...", "Date": "November 13, 2013"}, {"Author": "chad snow", "ReviewID": "R3S3S06GUMOE9W", "Overall": "1.0", "Content": "Although it does the job it has MAJOR flaws and not as nice as my $150 Nook HD+.  For one, Windows 8.1 is just the \"worst of both worlds\" for lack a better description.  If you use it as a tablet \"Windows Metro\" has VERY LIMITED app selection, while Android and Apple IOS has thousands of apps.  I have to use Google Chrome because of IE (Internet Explorer) security risks/flaws, which means I have to use traditional windows because its NOT available for Metro tablet environment.  Using traditional windows on a tablet is a horrible experience.  I would feel the same trying to use Apples desktop OS-X on an ipad, rather than tablet optimized IOS.Other issues:The thing is heavier than the first generation Ipad, which is surprising because that is what Steve Balmer (CEO of Microsoft) complained about when he first held an ipad saying \"it was heavier than his laptop.\"Also the camera quality is not good, considering this thing is over $1000 (most expensive tablet you can buy) is should have the best camera available.Also it gets very hot in the upper left corner so be careful where you touch it.In my opinion you have to be crazy nuts spend big money on this.  Google Docs is nicer than Office so Microsoft's ad to \"get real work done\" is a joke.  I can get more work done using Android or IOS.  Since I started using Google Docs spreadsheet work is much easier, and I have not ever lost a document like I would every time office crashed on me.In my opinion the Surface Pro 2 worth about half that of an Ipad.  I advise to stick with a main stream Ipad or Android.  I have recently read that many developers are not making Metro apps because they see it as a dead product.  Resale value on this cannot be good either.  For every one of these sold I think Microsoft put twice that in advertising.It boils down to standard windows is horrible experience on tablet.  The Metro tablet interface part of this sorry (even though I thought it looked cool at first) and has very few apps (less than the Blackberry Playbook).  Call me a weak old man but its too heavy to hold in your hand.The people giving this high reviews are just trying to get other people to buy into it especially after they are $1000+ into it.", "Title": "I was forced to use this for my work.", "Date": "December 26, 2013"}], "ProductInfo": {"Price": "$1,302.00", "ProductID": "B00FG7MVJU", "Features": "Intel® 4th Generation CoreTM i5\n10.6\" High-definition widescreen 10-point multitouch screen with ClearType technology (1920 x 1080)\n128GB Storage Capacity, 4GB Memory\n1 x USB 3.0, Mini Display Port Output, Touchscreen, Headphone Jack, MicroSDXC card reader, Windows 8.1 Pro\n1 Year Limited Warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/5125wbemVaL._SX300_.jpg", "Name": "Microsoft - Surface Pro 2 with 128GB - Dark Titanium"}}