{"Reviews": [{"Title": "Great tablet for a great price!", "Author": "Lisalee372", "ReviewID": "R2JM4XRVIIK4BS", "Overall": "5.0", "Content": "This is a pretty awesome tablet. The video quality and sound are excellent. I had no problem downloading or installing apps from the market and being able to write documents and take photos is definitely a plus. Great first tablet for my 11 year old son!", "Date": "October 2, 2013"}, {"Title": "Wolvol Latest Touch Screen 7\" 16 GB Android 4.2 Internet Tablet WIFI, supports Netflix, Dual Camera, Dual Core, 1 GB RAM) - BLUE", "Author": "satisfied", "ReviewID": "R2IQW7MCPRWKM4", "Overall": "5.0", "Content": "We have one of these tablets as well as one in black and one in white.  We have been happy with these tablets for our kids. Wolvol  Customer service is AWESOME !!  If you are looking for a case/cover the following item fits these wolvol tablets well.ProntoTec Ultra Slim Lightweight Smart-shell Stand Leather Case Cover for 7 Inch ProntoTec A20 Android Tablet(comes in purple, pink, brown, and black", "Date": "March 17, 2014"}, {"Title": "First Tablet for nine year old...", "Author": "Kate Bond", "ReviewID": "R363M4HJACD00H", "Overall": "4.0", "Content": "I was hesitant to purchase this as I've never heard of the company and there wasn't any information beyond what was on their website. I also was unsure of what happens when you need tech support: who do you go to? I have an iphone so for troubleshooting we go to the Apple Store.However, after continuously coming back to this product after doing tons of research I took the plunge. My daughter loves her WOLVOL tablet. It's inexpensive and worked for our budget. I've downloaded several things for her. She still uses our phones, on occasion when the tablet is out of WIFI range when we are on the road, but she's able to use it when we arrive at our destination. I also like how many apps it came pre-loaded with plus it has a usb port and charger. The internal storage is great so we already have tons of stuff on her tablet. My daughter was so excited to get this tablet and has been enjoying it very much.2-2-14: UPDATE: We discovered an internal crack that caused the tablet to stop working.  We had only had it a short time.  I emailed WOLVOL and they responded quickly with complete instructions on how to ship it to them with a time frame so they could fix it.  They were great. My daughter keeps asking when is her tablet coming back......", "Date": "January 14, 2014"}, {"Title": "WOLVOL TOUCH SCREEN TABLET", "Author": "Joanne N.", "ReviewID": "R3TNC3GKGKAT4I", "Overall": "5.0", "Content": "Excellent product and a great value. Clear video and good sound quality.If you have any questions or problems email the seller and they will respond promptly.You will be surprised at how well this is product is made at such a low price. I recommendthis product, it comes with a soft case as well as charger  and USB.", "Date": "December 7, 2013"}, {"Title": "Excellent", "Author": "Paola Vanderhorst", "ReviewID": "R32CBWA73PW4KI", "Overall": "5.0", "Content": "This is a good tablet, excellent for the price, it's very fast, good quality , i ordered from DR, the shipping was fast and there's nothing bad to say about the Tablet", "Date": "March 19, 2014"}, {"Title": "Don't Buy this Product", "Author": "Tom Porter", "ReviewID": "R1S8XQ9ZMARAUH", "Overall": "1.0", "Content": "I ordered 5 units for Christmas presents for our grandchildren.  Two (2) of the units quit working within a week.  The other three (3) quit working properly after a month.  A single unit not lasting would be understandable but not all 5.  They agreed to accept 2 unit back for a refund.  When I made a request in February for authorization to return the other 3 units for a refund I received only a run around.  Not happy with the response from the company about the product.  It appears that you get what you paid for not matter what the review indicated.", "Date": "March 12, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F4N1BDS"}}