{"Reviews": [{"Author": "Kevin C", "ReviewID": "R2C38V3GA8IUXR", "Overall": "5.0", "Content": "Initial review, I just got it and by playing around and getting familiar with it for 24 hours. The Galaxy Note 10.1 2014 edition, (GN10.1_2014) is absolutely amazing. I was worried about the sound quality with the speakers on the side, a big change from the previous model, however I will say that the quality far surpasses that of most laptops. The picture quality of the screen is so eye popping. The build quality is great, it feels solid and has some good weight to it. I have not noticed any flexing, and the metal ring around the perimeter, along with the textured backing, adds to the feel of a high quality tablet. I have noticed a few changes in the newly updated OS. One thing that I have yet to find, which I have on my Note 2 phone, is the math helper, located in the S-pen note window, (for those of you familiar with what I am talking about the f(x) function), I have gone into the samsung experience store, and have asked the personnel about it, but with the tablet being so new they have yet to play with it either, so I did not get my answer yet on that feature. I will further update this the more playtime I have with it.", "Title": "WOW!!!", "Date": "October 12, 2013"}, {"Author": "LuvAChi \"Alice S\"", "ReviewID": "R340WG8RU58WTO", "Overall": "5.0", "Content": "I still use a landline phone and recently upgraded from a wired router to a wireless (no techno-geek here).  My computer repair guy said laptops are on the way out.  After reading the 56 reviews on Amazon (...check out JoeC(NY)'s review - great tips) and watching a few well-made tutorials on YouTube, I decided to dive into the tablet world with a Samsung Galaxy 10.1 2014 white 32GB.  I noticed most of the negative reviews were from people who needed help navigating the ocean of possibilities this tablet offers.  It can be overwhelming.I've only had it a few days and the first thing I did was download Nova Launcher, program it to \"remote\" my TV and to prevent possible lag went into \"Settings\", \"General\", \"About Device\", tapped \"Build Number\" 7 x's.  This opens the \"Developer Options\" tab, then under \"Drawing\" turned OFF \"Transition Animation Scale\".  You can go to YouTube and watch this tutorial presented by TheDigitalDigest.  Great series of helpful tutorials for tablet neophytes.Not sorry I started with a high-powered tablet that raises the bar for all the rest.  While I have nothing to compare this tablet to, it's clear this is amazing technology and there's lots to learn..", "Title": "Tablet Neophyte", "Date": "November 9, 2013"}, {"Author": "Jesse Lax \"Art. Harmony. Imagination. Life.\"", "ReviewID": "R1OL5HSJB8J8QV", "Overall": "5.0", "Content": "I purchased two of the Galaxy Note 10.1 2014 Edition (Wi-Fi only version) on November 27, 2013. One was for myself and one was for my fiancee. We're both digital artists, avid readers, lovers of technology, and were in need of a portable device with a screen larger than 5\".Having compared several tablets, I was intrigued by this version of Samsung's tablets based on a number of things - most notably: familiarity with Samsung products (we both use Galaxy S4 phones), the awesome specs and wacom-powered S-Pen capabilities. Major website reviewers at the time were saying that based on price, this tablet was gimmicky and an unnecessary purchase for those not in need of a stylus. Seeing the powerhouse specs of this device, consistent performance in reviews, and knowing the stylus was exactly what I wanted - I chose this one. I'm glad I did.Having read and watched several reviews online, I knew what to expect with some of the odd physical design choices. I've had several month to adapt to this tablet and by now I feel like it's absolutely worth putting that kind of time into adjusting to it's quirks. I'll first run through the negative aspects, the positive aspects, and how we adjusted to said quirks.THE QUIRKS====================1) HOME KEYNEGATIVE: The tablet seems to expect you to hold it in landscape mode (horizontally), as the physical Home button is located bottom center. Which of course means that if you change the orientation to portrait mode (vertical) the button is generally right where your thumbs is going to land on either side. This is further compounded by the fact that the Settings and Back (capacitive) buttons are to the left and right of the Home button.At first I found this to be very very awkward. I've read other reviewers who were so frustrated they returned theirs because they couldn't stand it. Indeed my fiancee went through the very same feelings, as did I. However, I gave it some time and after a couple weeks of constant use I became quite comfortable with holding the unit and it's not even close to a problem. I think of it now as a learning curve. My fiancee solved her issues with the button by investing in a tablet cover that acts as a stand, but also has a hand-strap at the back... which helps her not to have to hold the unit by the sides.POSITIVE: Now that I'm accustomed to holding this tablet with the Home Key placement. I use the tablet as effectively as any other device I own. I rarely run into any \"accidentals\". My fiancee doesn't use her tablet as often as I do, and thus isn't as studious about holding hers a certain way. Thus she does get some \"accidentals\", but she's getting used to it as the days go on.2) SCREEN GLARENEGATIVE: There's a lot of it. This is a high-gloss, premium glass screen. If you expect to have heavy lighting overhead (especially fluorescent ) you're going to spend a lot of time seeing the lights above you or looking at your own reflection at certain viewing angles. The screen's brightness however is fantastic, so moving it up to full will help some. The best answer however is to just slightly change your viewing angle. You can do this as your holding it, or invest in a tablet cover that has a multiple angle stand. Once I was aware of the glare I worked around it and like, the last issue was a minor learning curve.POSITIVE: The glare may be a bit rough, but the quality of the picture on the screen is beautiful. Online reviews say comparatively the screen is more washed out, but I've not noticed. Watching movies, gaming, drawing, using apps, browsing the web... all of it looks incredible. Because of this it really makes you want to adapt your usage to account for the screen glare just because the payoff is the gorgeous quality of the 10.1 realestate.3) CHARGING SLOTNEGATIVE: The Micro USB charging slot is perhaps the most goofy, senseless design element of all (and one I still find myself wishing was different). It's directly under the physical Home key, on the bottom edge of the device. Holding this while charging becomes an interesting juggle with that cord jutting out. Terribly uncomfortable experience while laying on your back in bed while charging, or even while sitting up to play a game. Add to this the fact that some games force horizontal orientation, and you're going to expect to be irritated when your battery needs a charge. While I haven't found any great solutions to this, it isn't so bad if you're holding it in portrait mode. As an aside, if you're not paying attention in dim lighting it's easy to try to shove your charging cord into the IR Blaster on the exact opposite end. The blasters even in the same shape as the charging slot... but thankfully it does no harm apart from making you feel like an idiot that you weren't paying attention.POSITVE: There isn't anything positive to say about the design placement, sadly. But the slot works well, the tablet charges (albeit slowly) up just like any device. The charger is the same as any other early 2014 Samsung device, so you can use your S4 charger to charge the tablet. and lastly: my fiancee (who is not a power-user) hasn't mentioned this as an issue at all.====================Those quirks sound intense, but remember I'm giving you a very detailed account of my personal thoughts and experiences, and there are a lot of reasons to look past them. We're going to get to those now. I'll take the same format as the above where applicable for the good things, though I'll begin each with a short description on why I like these features.1) S-PEN / STYLUSI use Wacom technology every day to create art for both business and personal art. Wacom is my go-to for all things stylus, and that they paired with Samsung to give you an authentic, high-quality stylus experience is just phenomenal. I both need to take notes and be able to draw on the fly, so this is my second main reason for purchasing this device.NEGATIVE: The stylus is rather short and very, very light. As a man with large hands it's kind of strange to hold something so dainty. The button on the stylus to call up the Air-View features is all-too-easy to press while using it, however this is also a problem with full-size Wacom tablets. Where the Samsung S-Pen fails is that this stylus is rectangular, so there's no option to simply roll the buttons away from your fingers as you can with a normal Wacom art stylus.Suggestions: I've read you can simply get a metal pencil holder to extend the length of the stylus - though I haven't tried this yet. I've also read that the new Note Pro 12.2 has a redesigned stylus - though I haven't looked into compatibility and shape yet.POSTIVE: The stylus works great! There's no leading or drag, it glides smoothly over the screen. The cursor on screen (which can be toggled off an on) is pin-point accurate at virtually every angle and regardless of the above, it gets the job done with seemingly no effort. That the stylus is conveniently stored in the upper right corner (landscape) of the device is awesome. It's easy to access and easy to put away. It snaps in firmly and I never worry about it falling out. The Air-View features are mostly very useful and worth leaving on. See a different review for more on Air-View.PERFORMANCEThis is the first deciding factor for me. I needed a tablet that was going to perform lag-free... partially for preference but also for performing art. You can't draw effectively if your machine is lagging, and I wouldn't have the patience for it. But on paper at least, it looks fantastic.NEGATIVE: None.POSITIVE: The paper was right. I glow with confidence everytime I pick this tablet up because I know it's going to be a champ. I've never once encountered stuttering or lag of any kind no matter how much I run on this thing. I've pushed it with multi-window, overblowing apps in the background while running a heavy one in the foreground, and I've gamed to death with high-resource graphics-intensive games. It's been 5months with this tablet by now... and no issues whatsoever. It's always buttery smooth. Any issues I've run into have been poor internet connection on my end, or software glitches in the app I was using. I do give my tablet an intentional restart every couple of weeks. I don't know that I need to, but it hasn't hurt.SCREEN SIZEHaving never owned a tablet before, I wasn't sure if 10 inches of screen would be too large or too small. I took the gamble if only based on all the other items on my list of \"must haves\".NEGATIVE: It takes getting used to if you've never held something this large before. This was a double issue for my fiancee who has smaller hands. For her, she finds she loves the screen size for some things (reading and shopping especially) but prefers the smaller screen of her phone for others. Much of this has to do with typing - which I might add I agree with her. Coupled with adjusting to holding it, typing is rather laborious. You end up moving your whole hand rather than just your fingers. However, the default Samsung keyboard and Swype both have options to shrink the keyboard (more phone sized), and split the keyboard (to type thumbs only). For me, these actually give quite a bit of typing relief.Alternately you could invest in a compatible Bluetooth keyboard. I purchased a tablet cover which came with one and it was easy to set up, easy to reconnect, and felt very close to a laptop typing experience.POSITIVE: 10 inches of screens has turned out to be the perfect number for me. It's generous for web browsing, a huge blessing for games, excellent for business and personal notes and office documents, and spot on for drawing. It was only just big enough to enjoy watching tv shows, but due to my want for a full cinema experience I would probably not watch a movie on this. For those who enjoy watching movies on their mobile device - you'll love it. If my picky attitude can enjoy a TV show on here you'll probably scoff at me and revel.On art: For my first art experiences with this tablet, I took it with me on a week long cruise and was happy I did. I didn't have to bring the entire backpack of my art supplies I was accustomed - just this one lone very convenient tablet. I completed four impressive works and, short of a Wacom/Windows hybrid tablet, it proved to be nearly everything I need for mobile art needs. Lack of needed software prevents me from performing my business art on this device, but for conceptual work and personal art this is a killer device.For business: As I understand it, this device can be hooked up to projectors old and new and used functionally for lectures and the like. While I haven't personally tested this, I've read a great many reviews from business people explaining how they have and that it was great for it.FEATURESThis tablet actually has a crap-load of features. Not many of them feel like bloat, either. Your usual Samsung line, of course, but also Autodesk Sketchbook, EverNote, and Action Memo to name a few. The Air-View features are also 98% useful for screenshot note taking and editing. I'm going to skip the positive/negative on this one, because there's still several features I haven't used, such as handwriting-to-text translation. However my overall experience with every feature and setting in this app has been wonderful.Your normal slew of Samsung's latest line of misc. features is here. Air-gesture, Smart Stay, Smart Pause, Smart-Scroll, Multi-Window, Screen Mirroring, Power Saving Mode, etc, etc! So many in fact that it may take awhile to remember all of your settings. I'm 5 months in and I'm still finding new things about optimizing my experience.Although it won't ever replace my tried and true TV remote - the IR blaster is cool, and screen sharing with my smart TV makes for a fun experience.This is an optimum device for Chromecasting, thanks to the screensize making the UI so easy to access. I much prefer it for this than my phone.TIP: Make sure you Software Update your tablet as soon as you get it. I did right out of the box and I had nearly 5 updates waiting for me. It's now on auto-update for those and I'm anxiously anticipating Kit-Kat to give even better performance.SOUND QUALITYOVERALL: With the external speakers It's just okay. Speakers are in the back and often get covered up. When using a cover I often have to move the flipped cover away from the back to better hear audio. This is improved when the covers is used as a stand as the sound bounces back... but like any mobile device the speakers aren't as ace as just using headphones.Headphone experience is killer. Samsung's integrated software for improving headphone sound is magnificent. Music and other media sounds superior even with just your included Samsung ear-buds. I highly recommend getting your audio this way - however it's not a complete fail on using the external speakers.BATTERY LIFEOVERALL: Battery life is one of those things every mobile device struggles with. I'm a pretty heavy tablet user, and in just a few hours of drawing, gaming, and movie watching, I'll have the battery down to about 30%. I can assume about and extra hour or so past that depending on what I'm using. But it's just as easy to plug it in and power use, which has become my usage habit when home.My fiancee, who I'd deem a moderate tablet user, gleans a full-day+ out of hers before deciding it needs a charge. On standby alone it will last around a day and half. Considering the size and quality of this screen, and that it's fairly light for it's size, I really think this is good battery life. Power users like myself may want to look into an external battery extender... as this battery cannot be removed.DURABILITYOVERALL: With its size, weight, squarish shape, and glass screen... this is an accident waiting to happen. Don't misunderstand, it feels very durable to hold, but like all mobile devices these days the ever present fear of dropping is most certainly here in this tablet. I definitely recommend a case for drop protection - even at home. Keep in mind that the front is all glass, and while the back does offer some grip for your hands, its back will slide across a tablet or nightstand faster than a hockey puck give the opportunity.There are a lot of great cases out there for this device. My fiancee and I both prefer different cases for different reasons. I'm using the official Samsung Book Cover, because it's slim, protects the corners, offers multiple angle stand, and is very light. She prefers a case with a hand-strap on the back to assist in holding, with a multiple angle stand-cover, and business card/pen holder. We both also have alternate cases with Bluetooth keyboards for travel - though we rarely use them.Have questions? Don't be bashful to ask.", "Title": "Powerhouse Tablet that Fits All My Needs", "Date": "April 13, 2014"}, {"Author": "A. Garcia", "ReviewID": "RU3IMGOZFOW2G", "Overall": "5.0", "Content": "I am just glad I waited for this tablet and decided to buy it despite the price. I am a graduate student and  I believe the tablet fits my work needs like a glove. I have a good Bluetooth keyboard, but I rarely use it. I take all my notes by hand. You can write in many languages and the handwriting recognition is really impressive, no matter the language.  The split screen is also terribly useful. You can take notes and read a PDF or watch a movie at the same time. The tablet has also other helpful functions, like the search function that recognize even handwriting notes, the action note to make occasional memos, or the possibility of using the S-pen to draw a square and open some useful programs (the calculator among them), so they can stay on top while you are working in Polaris Office. All this makes me think that, right now, this is maybe the best option in the market for an university student, or any person who needs to do some real work with a tablet, specially if they need to take notes on the move, in conferences, meetings or classes.Just some warnings that I believe could be useful. This is an advanced device and the learning curve is much larger than with other tablets. After one month, I am just learning to use many of its functions and possibilities. You need to spend many hours if you want to learn how to optimally use the tablet and, strangely enough, I do not think that the default configuration is the best to work with the S-pen (you have to change some options, specially if you have large hands and you plan to use a S-pen holder).Besides, to obtain the best results with the handwriting recognition you have to use it a lot. In a way, you have to learn to write on the screen because it is not exactly as writing on paper, particularly regarding the \"handwriting rhythm\" (and right out-of-the-box it can be frustrating, specially if you have not practiced your handwriting regularly for a long time), but after a while you probably won't need a keyboard anymore and you will obtain remarkable results.  My backbone is certainly grateful for buying this tablet, since I do not have to carry my laptop anymore.A final warning, DO NOT BUY COVERS WITH MAGNETS. Most covers that are supposedly designed for this device use magnets and they heavily interfere with the S-pen. Many persons are having problems with this and many of them believe they have a defective tablet, when in fact the reason behind the malfunction of the S-pen is just a magnet too close (the S-pen works interacting with an electromagnetic field generated behind the screen, which is the reason why you do not need to charge it). I had to return a cover with a detachable keyboard. Once I replaced it with a neoprene glove, I stopped having issues with the S-pen.So, if you want a productivity tablet and you like to take notes and need to use several apps at the same time, I think this is the best option right now. If you want a media consuming or a gaming device, this tablet could do the job, since it has lots of power and a gorgeous screen, but I believe there are options out there for a better price.If you want to compare justly the Galaxy you have to do it with other productivity focused devices. I think in the Samsung Galaxy Note 10.1 2014 edition as an Android equivalent of the Windows 8.1 Surface Pro 2. Both tablets have advantages and disadvantages regarding the other, but both are productivity focused devices. The Surface is designed expressly to be a laptop replacement and there are certainly many advantages in using a Windows 8.1 product (the top being Windows Office compatibility), but with the Galaxy you will have better battery performance, less weight and a handwriting focused device (which I find more comfortable for the size of a tablet) for half the price. To make a good deal even better, if you register it before March 31 you will get also generous perks from Samsung. At the end, I am really happy with my tablet, so happy I decided to write this review. Even when it was beyond my budget to say it frankly, I am working more efficiently now, so I take the tablet purchase as an investment. An excellent investment so far.", "Title": "An excellent productivity tablet", "Date": "February 24, 2014"}, {"Author": "Banquero", "ReviewID": "REFIOMYW2YIB2", "Overall": "5.0", "Content": "I have this tablet for a few days now and I love it. I have always been a fan of Samsung products (I have a Samsung Plasma TV and a Samsung Galaxy S4) and this one hasn't disappointed. My previous tablet was an HP Touchpad with android honeycomb and my girlfriends iPad2. This tablet blows away the other 2! Its very lightweight and the texture of the back (leather like) makes it feel good in your hands. Materials feel more quality and sturdy compared to the plasticky feel of some other tablets like the HP Touchpad. The 2014 version of the Note 10.1 also has a higher resolution than the original version. Also pressing the button on the S-Pen brings up a quick options menu, this is a new feature to the 2014 edition that is not found in the original Note 10.1. Many of the apps and features are the same as the S4 (split screen, eye tracking, watchOn, etc). The camera is only 8MP but it includes all the photo features that the S4 has like taking pics with front and back cameras at the same time.I chose to buy the 16GB version (black) instead of getting the 32GB version. I figured I can just use a 64GB micro SD card if I need more space. That way I saved some money (I have plenty of micro SD cards already from old phones and digital cameras).As an artist I love using the S-pen stylus to draw and this was the main reason I bought this tablet over the Surface, Asus or Nexus (never even considered the iPad, the features on the iPad seem to be slow to catch up to the windows and android tablets). The stylus fits neatly in the side of the tablet and it doesn't feel like it will slide out on its own, which is great since if you lose it you'll have to pay $40 if you want to replace it. For daily use I still use my finger, but when I take notes or draw I use the pen. The tablet is lightweight and is perfect for digital sketches on the go.Speaking of drawing, the tablet comes with Sketchbook Galaxy which is a Samsung branded version of Autodesk's Sketchbook Mobile. I purchased sketchbook mobile a few years ago for my android phone and subsequently downloaded it on my HP Touchpad. Since all the apps on touchpad were automatically ported over to the Note when I logged into Google I now have both Sketchbook Mobile AND Sketchbook Galaxy! The Sketchbook Galaxy version is a bit scaled down from the full paid version but it is still a pretty powerful art app. The pen can recognize degrees of sensitivity, so a light stroke shows up as a faint pencil line while a dark stroke shows as a dark line. The app utilizes layers (just like in adobe photoshop) and there are a bunch of brushes to choose from. When using the pen you can set it up so that the screen doesn't sense your palm. You can read my sketchbook mobile review for more info on that app.For those who choose to buy this tablet be sure to go to Samsung's website to register the device. If you do they give you $50 credit for Samsung Hub app store, $25 Google Play credit, 3 free audible books (Audible is Amazon's audiobook company), a 3 month Hulu-plus trial, 3 free months of sirius internet radio, 50Gb of cloud space from dropbox, and a free year of Boingo wifi access. Thats alot of free stuff just for registering your device!", "Title": "Really good tablet for everyone, really great tablet for artists", "Date": "December 11, 2013"}, {"Author": "John P Hazen", "ReviewID": "R3RG71S9K4EZUV", "Overall": "5.0", "Content": "I was looking for a tablet to produce digital sketches on but needed something with more functionality and freedom then a standard graphics tablet. The note 10.1 (2014 edition) meets all of those requirements and more. And to have the screen tech designed by Wacom just sweetened the deal.", "Title": "Great price, great functionality and a great price equals unable to pass it up.", "Date": "October 26, 2013"}, {"Author": "Mark D", "ReviewID": "R232UMLKOECUPC", "Overall": "4.0", "Content": "This 2014 Edition replaced my Note 10.1 2013 edition.Pros:The screen is amazing. There is no comparison to the old screen. Easier to read at lower light levels too- save that battery. I have not used it outside yet, but I will update when I do.Battery. The first charge only lasted 6hrs of heavy use and set-up before going yellow. After the 2nd and 3rd charges[and adjustments] I am easily getting 10-12 hours of screen time. Watching downloaded movies, youtube and web browsing. Screen brightness set about 10%. I will continue to monitor this and will update as I see changes.Size smaller dimensions, narrower bezels- and with off screen buttons more viewable area.After updates smooth as butter. Wifi is very fast. Get an AC router[asus makes a pretty good one]Came with $25 playstore credit and $50 samsung credit. I bought Photoshop and a couple movies from the playstore, and several movies and a few font packages from samsung. I didn't know you could change the system fonts without rooting.There are also credits for hulu and others- I haven't messed with them yet.Very thin, very light. The difference between the 2014 and 2013 is more noticeable than I would have thought.Speakers seem to be as good or better than the ones on my 2013 version. I was surprised since they are on the sides and not facing you.Split screen works well and floating apps don't seem to slow it down.Cons:Offscreen buttons. It will take some adjustment for me. I generally hold the tablet in portrait mode to browse the web, read, check email. I usually use my right hand to hold the tablet- so it hasn't been a huge deal. But- when you are filling out forms online entering text and scrolling-be very aware of where you hold the tablet or you can easily hit the back button!The 2013 version- you could download the flashplayer directly from adobe's archives and it worked in the stock browser[not chrome]. This does not work on the 2014 version. You have to use a different browser if you want flash. So if you want to watch prime on the tablet be aware.My magazine app. It is non-removable, and you can't disable it. Hit the home button twice by accident, or scroll up from the home screen and it opens. Is it the end of the world?No. Just aggravating.Camera is ok. Not fantastic, but if it's all you got it will do in a pinch.Speakers- I miss them on the front. If you are sitting up, with the tablet resting on your ample belly in portrait- 1 speaker is clear the other is muffled. But the speakers are good- for a tablet.A little pricey. I bought a 32gb wifi for $549.00 with the aforementioned gift cards.Overall:If you have a 2013 version you may wait for a quantum leap model in 2015.[Although the screen is so much easier on my eyes]If you are about to jump in to tablets this one should be good for a few years- plenty of processing power and ram.", "Title": "Very Good Tablet", "Date": "December 2, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2W8K8XQSDQQ2L", "Overall": "5.0", "Content": "I am not usually into purchasing the latest electronics as they come to the market.  This tablet I bought for a particular purpose , to work with a large volume of PDF files on the go, with the ability to mark the files with handwritten notes in different colors. I also needed the scrapbooking function for my current work, specifically to store results of my research in one place in a convenient way. The large screen helps since I am near-sighted. I am also bilingual and needed to make my notes in two languages and two alphabets, English and Russian. So far, the tablet has met all of my expectations. I find the stylus very convenient, recognition of my far-from-perfect handwriting in both English and Russian is very good, the added convenience is to use the split screen, so that I can simultaneously work in two windows.I must say that I do not care how my device performs for gaming or watching movies, I do not have time for that. Yet, Skype works well on the device. The front and back cameras are ok, and the software Paper Artist for the Note allows to make nice homemade \"works of art\" out of everyday photos.Overall, the product is functional, perfectly suits my needs and appears to be nice to look at and easy to use. Nice job, Samsung.This review was hand-written on the device.", "Title": "EXCELLENT", "Date": "October 26, 2013"}, {"Author": "Robert C.", "ReviewID": "R1Y2L2YEXCJDNP", "Overall": "4.0", "Content": "This is an all-around excellent Android tablet.  Let me start off with a brief review of the tablet's physical attributes.The first thing you'll want to know about is the display.  It is very, very good.  It is very high resolution by today's standards at 2560x1600 boasting 299 pixels-per-inch (think about how laser printers were once the same at 300 dots-per-inch).  It is also very bright with great color reproduction and good contrast.  The screen uses IPS technology and it has excellent viewing angles - so you don't have to worry about being perfectly aligned with the screen in order to see it clearly and the contrast stays good even at steep angles.  The screen has an aspect ratio of 16:10, so the Note is ideal for internet browsing, gaming or viewing HD video.  The Note also has very good stereo speakers located along the upper right and left edge (when the tablet held in its native landscape mode) - they produce loud and clear audio and the speaker placement doesn't interfere with your hand placement.  Of course there isn't any bass to speak of, but one cannot expect any bass from speakers of this size.  Still, the audio sounds good when playing games or watching internet videos.  As I previously mentioned, the Note is meant to be held in landscape mode, with the hardware home button closest to you.  Of course, the screen content can rotate to portrait, depending on the program.  Most of what I use it for works in landscape, which is good because I prefer it that way.  Unfortunately, the USB 2.0/power port is located in the center of the bottom edge right under the hardware home button.  This can present an issue if you want to charge the battery when using the tablet at an angle on a stand in landscape mode as a USB plug can interfere with the bottom edge.  I think it would have made much more sense to have the USB 2.0/power port located on either the top or right edge of the tablet.  Located just to the left of the USB/power port on the bottom edge is a microphone.  There is a Micro SDXC slot under a cover along the right edge which can currently accept up to a 64GB Micro SDXC card.  This is useful for storing large amounts of media such as music, photos and video files, which can be quite large.  I highly recommend the Samsung 64GB Pro microSDXC card as it currently the fastest and most reliable 64GB Micro SDXC card available.  Moving on, there is an 8MP rear facing camera with LED flash and a 2MP front facing camera.  I haven't used the cameras very much at all, so I can't really comment on them.  There is an infrared port along the top edge which facilitates the use of the tablet as a smart universal remote control with an integrated program guide (for which the software is included).  I know it works because I tried it with my TiVo HD, but I didn't find it very useful for me so I haven't used it since.  Depending on your home A/V setup, it may be very useful for you.  The power and volume control buttons are located along the top edge on the far left.  I feel that those buttons are too difficult to navigate as they are small with very little feel or button travel.  As a result, I installed a software volume control which resides in the Android notification shade that I like a lot better.  The earphone jack is located on the top left edge.  On the top right edge is the slot for storing the S-Pen (along with the actual S-Pen).  The S-Pen, which is one of the main features of this tablet, allows you to draw and write directly on the screen.  I have used it at times for text input and the tablet will recognize your handwriting (either in block or script!) and translate it into editable text, which is really cool.  The tablet feels really good in the hand.  For me, it's not heavy at all and I can easily hold it with one hand.  The back of the tablet has a grippy, faux leather like finish, which I like, but my tablet lives in an excellent Poetic Slimline case, so I don't get to feel that very often.Although the 2014 Note 10.1 can be used for a wide range of things, what I got this tablet for is gaming!  And boy does this tablet deliver.  With it's 3GB of RAM, the latest generation Samsung Exynos 5420 octa-core processor (which is really a dual quad-core) and a Mali-T628 graphics processor, I get excellent gaming performance!  I regularly play Asphalt 8, which looks amazing on this tablet with it's real time reflections, motion blur, advanced lighting and particle effects.  It looks and plays great!  Since I'm a sucker for good racing games, and racing games are a natural fit on tablets since you can usually steer by rotating/tilting the tablet, I also play GT Racing 2, which again, looks amazing playing in the full 2560x1600 resolution of the tablet.  I also play Armored Aces, which is a great, WWII 3D multiplayer tank game, Heroes of Destiny, which is a great 3D dungeon battle game, and Dead Trigger 2, which is an super fun 3D first-person-shooter which pits you against hordes and hordes of very unreasonable zombies in locations around the world.  These are among the latest and greatest 3D games available and they look and play incredibly well on the 2014 Galaxy Note 10.1.  Not surprisingly, 2D games like Clash of Clans also look amazing and play extremely well on the Note.  It also plays video very well both from the internet and local files you store on the SD card.  This device is a great companion for a trip or flight.  Battery life is stellar for me.  I get over six hours of screen time when 3D gaming the whole time (yes, I really need to get a life).  If I were to use it like a normal person, I could easily see getting over eight hours of screen time on a charge.  One minor issue is that I don't feel that the charger is strong enough as it really doesn't charge the battery very much at all when charging while the tablet is in use.  It will charge a few percent, but it doesn't really charge well at all as long as the screen is on.There is one fairly important issue though which I would like to touch on and that is the some buggy behavior with the touchscreen itself.  At the moment, there is an issue where if you touch and hold any area of the screen for 24 seconds, your touch will be reset and it will not work well again for about five seconds.  Why is this a problem, you ask?  Well, say you're playing a racing game that requires you to push an on-screen gas pedal.  After 24 seconds, you won't be pressing it anymore, even if you are in fact, still pressing it.  If you try to immediately press it again, it will immediately disengage again for about five seconds until it acts normal again for the next 24 seconds, and so on.  That is but one example of the issue, but it could happen with controls for direction in a first-person-shooter or some other type of game.  But really no matter what you're doing, or what software you're running, whether it is a game, productivity software, music, or whatever, if you touch the screen in one area for 24 seconds straight, it will reset your touch and not work well again for about five seconds.  It's a problem.  Through the XDA Developers forum, I verified that this problem likely exists on all of the 2014 Note 10.1 devices (model SM-P600) with firmware MK1.  I believe it is a driver issue.  From what I understand, so far Samsung has not acknowledged the problem.  Hopefully, they will discover and fix this with the next firmware release as it can be a really a major issue depending on what you're doing.  Luckily most of the racing games I play have the option for automatic throttle, but I wish I could use a manual throttle control.  It does affect my Armored Aces gameplay as I have to remember to quickly get off and then back on the throttle prior to 24 seconds in order to avoid a bad situation.  *(4/27/2014: The 24-second-timeout issue with the touchscreen was fixed with new ND2 firmware!)*Overall, it's a great, versatile tablet.  I love it.  In fact, I own two of them and I gave a third to my girlfriend who also loves it.  If it wasn't for the issues with the weak charger and especially the touchscreen, I would give it five stars.***04/27/2014 UPDATE:***Lets say four and a half stars!  In the past week, Samsung released its Android KitKit 4.4.2 firmware update for the US version of the 2014 Note 10.1 (firmware ND2).  I applied it a few days ago and I can tell you along with the update from Jellybean to KitKat, it also fixes the 24-second-timeout issue with the touchscreen.  The KitKat update has made the overall tablet experience faster and smoother.  Samsung made some nice changes to Touchwiz including a better notification shade and a better task manager to name a few.  Unfortunately, the KitKat update also introduces the Google-mandated restriction on which apps can write to the external SD card.  Even though I'm not a fan of this restriction, it doesn't really affect me (yet) and I don't think it will affect most users.  The restriction can be eliminated if you root the tablet.  Overall, I'm very happy with the update so far, and I will report back if I find any issues!***05/17/2014 UPDATE:***One thing I've seen some people complain about is that the speaker grilles either are or get loose and then have a bit of play in them.  Mine were a bit loose from the start, but it wasn't an issue until today.  Today I noticed that the right speaker grille is very loose.  It's not falling out and it doesn't come out, but the top edge of the right grille is literally hanging out.  Just to make sure it couldn't fall out, I tried pulling it off using some masking tape, but it held in place.  The left grille has some play in it but its not nearly as loose as the right grille (yet?).  Since it doesn't snap back into place and the grille is so small and fine, I haven't figured out a way to fix this.  I'm not sure I want to use glue as glue could damage the finish and it may make it difficult to disassemble the tablet, if that is ever necessary.  I'll update if I fix this or if it gets worse.  While this is something to look out for, this is an excellent tablet, and this is not something that should keep you from considering one.", "Title": "Excellent Android tablet, great for gaming - *04/27/2014 UPDATE: Recent KitKat update fixed most issues!*", "Date": "February 19, 2014"}, {"Author": "leftcoastwolf", "ReviewID": "R31V1M1V98BI77", "Overall": "5.0", "Content": "I've owned many tablets over the years including the iPad 2, Nexus 7, Amazon Fire HDX 8.9, and now the Samsung Note 10.1 (2014).  For a general tablet that can become an excellent productivity tool, the Samsung can't be beat.  The processor is amazingly fast and the display is top notch.  I noticed overall screen uniformity with rich colors and minimal light bleed.  Upon opening, I installed the Nova Launcher and disabled most of the Samsung built-in apps.  The tabled runs quite smooth with no noticalbe lags or stutters.  I added 64 GB of memory bringing the total to 80 GB.  For me, that's plenty and $150.00 less that an iPad Air.  Samsung has provided support for putting programs on the SD card thus freeing up internal memory.  Because tablet screens are prone to accidental scratches, I installed a screen protector and also have a case for it.A great thing about an Android tablet is that you aren't stuck in a particular ecosystem.  iTunes is great but as in Android there are useless apps.  Sure, the iTunes store and Google Play have over 1,000,000 apps you can download but what good are those apps if they are for show and don't improve your overall experience (I'm thinking of the tipping beer mug in the iTunes store).  And the Amazon Fire?  Well, it's basically all about entertainment and reading.  If that's all you need, great.  In using both iTunes and Android, I feel the Google Play store offers more useful apps and is easier to navigate.A 10\" display is ideal for me.  Not too big and not too small (I'm thinking of the Nexus 7).  My phone has a 5\" display and frankly the move to a 7\" display is meaningless.  The Android system is easy to manipulate and customize to meet your needs.  With the 1.9 GHZ quad-core processor in the Samsung, and 3 GB RAM this tablet can hold it's own against any competitor including the iPad Air.  Sure, it's made of plastic and iPad is made of aluminum.  I really don't care how a tablet looks, it's more about function and user friendly experience.In reading reviews posted by others who've purchased and use(d) the Note 10.1 (2014) I notice that there are virtually no \"in the middle\" scores.  People seem to either really love it or really hate it.  Most of those who dislike this device seem to have received a defective device or one that was damaged in shipping or mis-handling.  Those who fondly recommend the iPad Air note the aluminum construction as the best feature.As always, Amazon takes pride in packaging products in boxes that provide ample protection.  My Samsung arrived without damage and worked when I plugged it in.Likes:Excellent Screen QualitySpeedy ProcessorExpandable RAMFlexibilityComfortable to hold and useAvailability of AccessoriesActually useful for work and pleasure (due in-part to Google Play)Solid buildDislikes:Useless owners manual included with the unit (mostly business size cards arranged in a booklet) but a complete PDF manual is available for download.Samsung \"extras\" programs and servicesI recommend the Samsung Galaxy Note 10.1 (2014) without reservation.", "Title": "Solid Piece of Hardware", "Date": "January 17, 2014"}, {"Author": "Chris Collins", "ReviewID": "RTFKYQS3G99TF", "Overall": "5.0", "Content": "This tablet is great. The S pen feature really helped when I was in school. It allowed me to take notes and the later convert them to text. The tablet also has a crystal clear display that is great for watching videos. This is the best tablet I have ever owned.", "Title": "Thumbs up!!!!", "Date": "May 30, 2014"}, {"Author": "Toineg1", "ReviewID": "RZXASP3SVLUT5", "Overall": "4.0", "Content": "Deals top delivered ahead of time and the device looked brand new though refurbished.  I give them 5 out of 5 stars for their expeditious service.  The Note 10.1 2014 however,  did not meet some of my expectations.  Ergo the 4 stars. No fault of Dealstop.  The device gets hotter than any tablet I have ever owned.  The battery life doesn't even match my old 1st generation iPad! Which I have had for at least 4 years.  After 2 movies you will be looking for a power cord.  Unacceptable for a \"Top of the line\" tablet.  I have had the tab 2 10.1, I still own the tab 7.7 , arguably the best tab Samsung has ever made and the Note 8.0 which as I have compared, has better clarity and richer brighter colors, with get this, more detail than my 10.1 2014 when watching movies!  The note 8 has comparable battery life too. In other areas the newer note beats out all of my tablets for performance and features.  It's the features that give me mixed feelings about this device.  They are no less than remarkable.  I was strongly considering an iPad air but after using this puppy,  the only reasons I had were longer battery life and some apps with a richer tablet experience with those specific apps. The so called better build quality is overrated since anyone owning a tablet will not use it without a case for long unless they plan on keeping at home never to grace the out doors.  Once in a case its about the use in my book.  However, the ability to multi task, use of the spen, and my long time investment of apps that are comparable to iPad, and the ability to customize my environment at will to how I work and play,  convinced me otherwise. Once you get use to the many dimensions of this tablet other devices become boring to use.  I buy my tablets for productivity and entertainment and this meets my expectations despite the battery life and Hotspot issue which doesn't seem to have any effect on performance.", "Title": "the Note You want to love but....", "Date": "May 26, 2014"}, {"Author": "Justin Brockman", "ReviewID": "R3VL1LUXMD3SBA", "Overall": "4.0", "Content": "I like using my Galaxy Note but I got it mostly for the Spen, writing to text, writing to equations, and things related to the functions I could use for school.  Every time I have used it for school work, it has wildly disappointed.  I've tried really hard to get use to it thinking it was just user error at first but it is clunky and slow if you misspell a word, do any weird capitalization, or do not have excellent penmanship.  I have received compliments for my handwriting and how neatly I write but I still have many issues with writing on it.  When using the equation function, I have to fight with it.  I have almost completely given up on it.  Turns Y's to 4's, X's to any random number, and if you try to write any symbol for multiplication for division you will not end up with a good result.  Additionally, I liked I could upload PowerPoint, Word, or excel onto the tablet and use a dumbed down program to edit these programs!  This did not work at all, it always uploaded it as a PDF.  The screen is a good size but I also found if I try to have two screens up at once, it is almost impossible to use both at the same time.  I find myself having to make one bigger than smaller, then open the other window and do the same,  It becomes a hassle.Not all is lost with the tablet though.  It is fast and has an amazingly clear display.  I upload my photos to it and love to use this as a traveling portfolio!  I have not had any issues with apps except once or twice in which case it was an issue with the app.  It in lightweight and I find it fits perfectly in my hands and lap.  I often times will have the tablet up and running something while I am doing something on the computer or watching TV and it is extremely convenient.  Despite the lacking abilities of the practical use of this when dealing with school or work related things, it is an excellent tablet and I would recommend this tablet!", "Title": "It's Not Exactly What I Expected", "Date": "May 13, 2014"}, {"Author": "kadydid", "ReviewID": "R2W6GTX3T778CW", "Overall": "5.0", "Content": "All my friends and family have tablets and they range from iPad to Android to Surface, and I spent about 3 weeks researching and playing with everything I could find.  I had a spreadsheet with every possible advantage and disadvantage I could come up with.  In the end I went back and forth a dozen times between iPad and Galaxy Note, and finally picked the Galaxy Note 2014 based on feature/price comparisons.  It's my first tablet, so I can't compare to my experiences with other tablets, but it does everything I could hope for it to do, and it does it well.  Absolutely no complaints.  Highly recommended.", "Title": "My first tablet, and I love it", "Date": "May 7, 2014"}, {"Author": "Ash", "ReviewID": "RTBMB23TPD12G", "Overall": "5.0", "Content": "I can't say enough things about it! It runs fast and smoothly.  The s - pen function is great!  I was hesitant because I've always used mac products, but I love this more than any ipad I've had cause to use.", "Title": "fantastic tablet!", "Date": "May 3, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R27ARDM07SSJCV", "Overall": "2.0", "Content": "I want to love this tablet.  I really do.  But it's plagued by Bluetooth connectivity issues.  Mine WILL NOT WORK with any of my bluetooth keyboards or mice (all of which are confirmed to work fine with 2 other Samsung Galaxy devices).  It pairs fine, disconnects, reconnects, disconnects, reconnects... every 5-10 seconds.Google it, and you'll find many, many people with the same complaint about this specific tablet.Samsung's policy is to claim that they can't guarantee compatibility, and then the recommend you buy the $80 Samsung keyboard to guarantee that it will work.  They claim that IT IS NOT A PROBLEM.You wouldn't accept a USB port that only worked with Samsung devices.  It's unacceptable with Bluetooth as well.Otherwise the tablet is great, but if you plan to use Bluetooth accessories you should stay far away.Edit: after spending hours battling it out with several different Samsung service reps over the course of a week, I was finally able to find someone who agreed this was a problem and set up a service for it.  I'll update the review when I get the tablet back from them.", "Title": "Great tablet, horrible Bluetooth", "Date": "April 27, 2014"}, {"Author": "Karl H. Botterbrodt \"KHunterB\"", "ReviewID": "RA0I00T7JXX57", "Overall": "5.0", "Content": "This tablet is just plain WOW.Comparing it to the latest iPad, this tablet is the real deal. It practically doesn't even give iPad or iOS a fighting chance. The pixel density makes for an amazing disply, and the construction is very high end. There is NOTHING cheap about this tablet. The S-Pen is the most useful tool on this tablet, and the main reason I picked this one up, opposed to the Tab 3. The handwriting recognition is spot on, and the usefulness of the different tools accessible by the S-Pen are amazing! Seriously, no other tablet I've used can compare.Another fantastic feature, is the expandable memory, 32gb is great, but adding an additional 64gb is just fantastic.Promise, you won't be disappointed by the snappy response, versatility, and screen clarity that you get with this product.", "Title": "Best in Competition", "Date": "April 24, 2014"}, {"Author": "James Dyer", "ReviewID": "R2X4UAHJLBPU9T", "Overall": "5.0", "Content": "I purchased this unit so that I could take live notes during meetings for business purposes. Although the Note and I are still teaching each other our handwriting skills, it is working better than my expectations. It is saving me hours by not having to transcribe my meeting notes over to my PC in order to send out meeting notes, follow-up e-mails, etc.I am an engineer and usually very critical so here is the very forgivable downside. It is taking a while for the unit to learn technical terms. During the training time it continuously tries to auto-correct to the terms and words it already knows. This too shall pass. :)The S-Pen makes the Note a very different animal is is well worth the learning curve.", "Title": "Write On!", "Date": "April 22, 2014"}, {"Author": "Spriggin", "ReviewID": "R1XMJ40NYVRW5D", "Overall": "5.0", "Content": "With the exception of the bloatware (which is surprisingly minimal) and some issues with the handwriting recognition, I really like this tablet. It's simple and easy to use, and isn't too bulky despite it's screen size. It could possibly use more options for certain settings (such as concerning keyboard controls) and doesn't shut down programs when you close them out, but this is a problem in all tablets. I needed something for travel, and this has worked out so nicely that I am now carrying it to work instead of my laptop. The pen is probably the best and worst part of this tablet. The pen's default settings can be troublesome, but are customizable. It's a good size, thin nib with sensitivity, draws nicely, and makes using the tablet much easier. It definitely won't replace my laptop entirely, but it's worth every penny.", "Title": "Easy and Simple", "Date": "March 31, 2014"}, {"Author": "Gamul \"Gamul1\"", "ReviewID": "R21HI536Z7YMR0", "Overall": "2.0", "Content": "Part of me wanted to give this 1 star but that would not be right either.  When this unit is functioning the device is awesome. Crystal clear screen.  Fast graphics. Ease of use. Great features.  Its everything I wanted in a tablet.  UPDATE 3/28/2014. Lowered stars from 3 to 2 due to yet another failure (see below). I am still keeping 2 stars because as I say below - when these are working they are awesome.My issue is durability.  I own two of these 2014 Edition models and both have had the same issue. Unit 1 has had the screen die twice and had to go back for repair both times.  Samsung service has been outstanding both times and have repaired the devices quickly. Samsung gets 5 stars from me.  Now my 2nd unit has had the screen die and I am in the process of sending it back.  These devices are only 4 months old and do not get abused. So whats up with the durability on these? What happens once the warranty expires and the screens die again?UPDATE 3/28/2014: The screen on Unit #1 died again, for the 3rd time, less than 1 week after it was replaced.  The fact that it was replaced sort of makes it 3 devices that have now died.  This is a very bad trend and I have lost faith that these devices can withstand the test of time.As I said, when the devices are working they are awesome. But for them to die multiple times with adults using them for web browsing, emails and simple games - seems a bit worrisome.On the first unit, the 2nd time it went back they seemed to have replaced it. I am hopeful that will now last for a long time.  Hopefully, they have learned something and my other unit will be fixed permanently too.Its funny - I bought these to replace a 2.5 year old Xoom that has gotten slow.  Still slow but it still works fine and for the moment is being used again.5 stars for Samsung Support and for the device when it is working (95% of the time).  1 star for the fact that it has failed so much.UPDATE 3/28/2014: The process of sending these back is fairly simple and Samsung Support is great.  But each time is a nearly 3 week process of sending it back and waiting until it comes back.Update 4/2/2014: Unit two is on its way back to me, should be here in a couple days. Nice fast turn around from Samsung support again. Spoke on the phone with Samsung about Unit one, the one that died for a 3rd time. With a mature and constructive conversation they have agreed to refund me the purchase price (minus sales tax though). They did not want to refund me on the 2nd unit because it was a first time failure and they have not even had a chance to repair it yet. Fair enough. I am not too concerned about the future at this point because I really have to say - Samsung support has been outstanding to work with. I have zero complaints about their professionalism, promptness and general ease to work with. Top notch professionals.  I am now hoping that unit two comes back and no longer fails because as I have said, when these have been working they are awesome. There is currently nothing better out there. To replace the first unit we  are looking at the upcoming Sony Xperia Z2, which still does not have the specs that the Samsung does but it looks close.  I will continue to update this thread about unit two as I have more info.", "Title": "Amazing! When it works", "Date": "March 26, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3TIDTTAQ3NGDX", "Overall": "4.0", "Content": "But Samsung's multiple websites that they make you sign up for is ridiculous.  You have to register your purchase (I get this) then you have to sign up for a Samsung account, then register other Samsung sites just to be able to take advantage of the perks.  Then they don't send you an email with the registration codes.  If you don't print them out or take a screen capture there is no way to recover them.  I submitted an email request for their support to recover some of the redemption codes and have not received a reply in over a week.I love the tablet, one annoying thing about it is the S pen.  The S pen is stowed away in the upper right side corner.  I put the S pen away and pick up the tablet and the S pen seems to move just enough to turn on the device and make a sound.  This happens even if I seat the S pen fully.  I can live with this though.This tablet is fast and has lots of storage for apps.You wont be disappointed if you buy this tablet.", "Title": "Love the tablet", "Date": "January 6, 2014"}, {"Author": "Dilon K. Mason", "ReviewID": "R1ZX11V53CV55Z", "Overall": "5.0", "Content": "This tablet blows it's competition out of the water.  I got it for my wife and even though i have my own competitive tablet, i prefer this one in a big way.  Don't waste your time with any other tablet this year.", "Title": "The tablet to have in 2014", "Date": "February 1, 2014"}, {"Author": "Stevin Ally", "ReviewID": "R1B3OTHLK9U37T", "Overall": "5.0", "Content": "Upgraded from the 2012 version was much needed. The app all work...no lag like the previous version. The full screen approach for the s note is much needed with the zoom aspect.", "Title": "Amazing", "Date": "January 28, 2014"}, {"Author": "Roberto E. Severino", "ReviewID": "RP9QIFV1EWQ7F", "Overall": "5.0", "Content": "It's only been a day since I've used my new Galaxy tablet but I'm amazed at how fast it is and how even YouTube runs pretty well on it. Plus I also love how I'm able to access my Kindle books via this tablet too and that I'm now able to deposit checks digitally with certain Android apps.", "Title": "Very Satisfied", "Date": "January 25, 2014"}, {"Author": "Anthony", "ReviewID": "R18YGQ3BMAU2T0", "Overall": "5.0", "Content": "I started with the original G-note 10.1 2012 ed. and i loved it. I am a full time student, pre med, so I've taken extensive notes with it. It's inclusion of the s-pen, along with touch-wiz made for an experience you are not going to find with any other tablet ; yes other tablets can use a stylus, but those stylus' s do not have built in functionality.  The only problem with the old one was it was kind of laggy (fixed with overdrive rom) and battery life wasn't the greatest.Fast forward to the Galaxy Note 10. 2014 ed. It seems everything just got 10 times better. First the quad core processor was bumped up to a dual-quad core, 1.9 ghz,  and 1.3 ghz . The lower spec ones are basically to handle the smaller task, increase battery life, thereby making an overall greater, smoother user experience.  The picture quality unmatched. That combined with the features added to an already exceptional features for the S-note  make this tablet so appealing,  especially for students, doctors, or business people.  I highly recommended this for everyone.", "Title": "A very good upgrade", "Date": "January 25, 2014"}, {"Author": "Rachael Basden", "ReviewID": "R1DJ1BJPNN7YJ6", "Overall": "5.0", "Content": "After much research and reading many reviews on the various tablets out right now, I decided to go with the Galaxy Note 10.1 2014 Edition and I have not regretted it. The screen is crystal clear, it's fast and out performs my friends' tablets in every category. I love having the convenience of the S Pen as well. All the free stuff that came from registering it with Samsung was an unexpected bonus!", "Title": "Well Worth the Money", "Date": "January 24, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00F3SOJ88", "Features": null, "ImgURL": null, "Name": null}}