{"Reviews": [{"Author": "candice sharpe", "ReviewID": "R1SSC2HN2B1BG1", "Overall": "5.0", "Content": "I purchased this product for my 8 year old son and my 7 year old daughter.  It works perfectly and my husband and I even use it for many different things.", "Title": "excellent", "Date": "January 16, 2014"}, {"Author": "Ekrem OZLU", "ReviewID": "R1KBG294VL1689", "Overall": "1.0", "Content": "it is very slow. sometimes it is not working , and it can not open any wideo, also it can not open youtube wideo. it is very bad.that was my first order but i dont want to give another order.", "Title": "very bad", "Date": "January 15, 2014"}, {"Author": "daniel", "ReviewID": "R6D0KIL2FX5W8", "Overall": "5.0", "Content": "shipping was good. im very pleased with the product it runs a little bit clunky but for the price you cant find a better tablet", "Title": "great", "Date": "January 14, 2014"}, {"Author": "John Hardman", "ReviewID": "R2Q9SR3UV67X8J", "Overall": "1.0", "Content": "I bought three and two of them the chargers fell apart within a week, one tablet flickers and does not come on right away and all 3 are very slow.", "Title": "Sucks bad", "Date": "January 14, 2014"}, {"Author": "Nicole", "ReviewID": "R1K62SDCMYQWWR", "Overall": "5.0", "Content": "It's fast it's easy it's durable I live it an it's perfect for a gift for a child for all the games and things try want on it!!! It's great!!!", "Title": "Nicole", "Date": "January 12, 2014"}, {"Author": "ALBERT B.YRIE", "ReviewID": "R3RYUL7V1G9TSA", "Overall": "4.0", "Content": "Nice cheap tablet.not bad for kids.I love the interface.my son like to play with just the aquarium and watch the fish swim by.", "Title": "Good item for kids and grown-ups .", "Date": "January 11, 2014"}, {"Author": "Christopher Stapleton", "ReviewID": "R3P6BVDAG0XY03", "Overall": "4.0", "Content": "This tablet was extremely inexpensive,  The quality seems to be far beyond another budget tablet I own.  The tablet preforms everything acceptably well.  I am satisfied with it so far.  As long as you understand you are not going to get iPad speed and performance for the price, you will be happy with this purchase.", "Title": "Good so far for price", "Date": "January 10, 2014"}, {"Author": "stephanie", "ReviewID": "R26QRHL9C6JIYO", "Overall": "1.0", "Content": "I ordered this for my daughter's birthday and have had nothing but issues since I got it. Two weeks after receiving it the charging dock came loose and wouldn't charge anymore. Then I sent it back for a replacement, FINALLY got a new one almost a month later and after being on it for 20 minutes it shut itself down and won't reboot. They won't give me my money back because it's been more than 30 days-they want me to send it back for repair. Ridiculous. I will never buy anything from this company again.", "Title": "Negative stars weren't an option but one star is too generous of a rating", "Date": "January 10, 2014"}, {"Author": "Tuesday Aziz", "ReviewID": "R2D1ME6WGL2IZ3", "Overall": "4.0", "Content": "I purchased these for my nieces and nephews. They were really easy to set up. The only thing that I was disappointed about was the front facing camera. People love taking pictures, why would you not put a rear facing camera on a tablet!", "Title": "Great Christmas gifts!", "Date": "January 7, 2014"}, {"Author": "Carla", "ReviewID": "R2HVM4A7LH3JT9", "Overall": "5.0", "Content": "Excelent tablet for my kid!!! My kid Like this tablet.... Amazing!!! Súper!!! Educational applications. Excelent. Súper. Extraordinary. Espectacular. Súper súper", "Title": "Súper!!!", "Date": "January 3, 2014"}, {"Author": "Debra", "ReviewID": "R15O7TTZPQMASG", "Overall": "5.0", "Content": "My father in law loved it. He takes it every where and uses it from home to the hospital and then some.", "Title": "Tablet", "Date": "December 31, 2013"}, {"Author": "mercedes loveyooeyes", "ReviewID": "R2O6X8TMIVJM2K", "Overall": "1.0", "Content": "I am not pleased. This is a total inconvenience. I would the tablets which I purchased. I would not recommend anyone to deal with this seller.", "Title": "After paying for two tablets the sellers sent me 2 wireless chargers.", "Date": "January 6, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R5XHIV5213UV0", "Overall": "4.0", "Content": "Ordered this for my daughter for Christmas. Didn't expect this to be shipped so quick. So far so good I like it. Was charged when I got it. Haven't been on it yet but have turned it on pushing buttons just to make sure it works properly satisfies so far.", "Title": "Will order another one soon", "Date": "December 19, 2013"}, {"Author": "Erica Lassie", "ReviewID": "R7CCH96G4OSZ5", "Overall": "1.0", "Content": "Said it would be here by Christmas but did not. What a waist of money. Now got to go find some somewhere else on a Christmas Eve at 9pm. Good Luck to me!!!!!!!!!!", "Title": "DIDN'T GET ON TIME IMPORTANT CHRISTMAS PRESENT!!!!!!", "Date": "December 24, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00FRVJQ3O", "Features": null, "ImgURL": null, "Name": null}}