{"Reviews": [{"Author": "K. Geddings", "ReviewID": "R11INY5QTOZZWO", "Overall": "5.0", "Content": "I got this myself for christmas but after reading some of the reviews and issues with problems with it i decided to take it out of the box and try it out for an hour or so tonight just to make sure none of the \"out of the box issues\" that a few people were having did not happen, after all it would be terrible if i opened it up christmas and it had major issues, as my family will be there and more family coming in that weekend.  It seems the vast majority of issues with the Nexus 7 has been out of the box.So i opened it up tonight, charged it up. took about only 2 hours to charge it to 99 percent which was pretty nice.  I updated to the latest android version right away (4.4.2 which just came out last night) and then installed two of the test apps that people have been using the GPS test and a multi-touch test app. (as that app is able to directly see any phantom touches or incorrect touch issues) i ran the touch app for a bit, no issues,  it picked up on my touch with many fingers, no extra taps were shown at all.  I then used the GPS test app , (after i disabled wifi so that it would only pick up my location through the GPS) while in my house it took a few seconds longer then in some videos to pull up the GPS and it had a not so great accuracy but that was inside the house.....so good enough. when i went outside with it and took a walk from my house to my church (which is a few blocks and under a pretty tree filled path)  it did fine with no drops and around 10-15 feet accuracy on average (walking not in car)Some people have said the brightness of the nexus 7 is too bright in low light. i turned it all the way down (as it was very dark outside) and i did not feel it was overly bright at all, felt just right.  I ran a little risk taking it outside without a case (as i would get the case before christmas) but i had no trouble holding it and it did not feel like it wanted to come out my hands at all as long as i was careful.I ran the GPS app for about 30 mins total without any drops.I am into photography not as a pro but just as a way to express myself and connect with others. I had a Canon DSLR but downgraded to a powershot 110 HS as i wanted something smaller and that camera does very well for the price.  Some have said that the camera in the nexus 7 wasnt all that great.  i took a few test shots ( even a few in low light outside) and i think the quality is very good.  In some cases it may overexpose things but overall it was able to produce realitively sharp and clear images that would be just fine on the 7 inch screen and look pretty good on a larger monitor.Video quality was good too but..it may have been the low lighting in my room or something but i found the video clips i took were a bit laggy for some reason.  the nexus 7 itself did not feel laggy otherwise, maybe it was just being not the best light or something. but i assume it would do good in better light during the day.  But that is something to note. Picture quality is good but video quality may be hit or miss inside in lowish light.  But for me thats not a big problem.  I just wanted a small tablet that could take decent pictures and on that this wins,  I think unlless you are a pro photographer or have a high end camera phone and just love it.  For average pictures while you are out and about..say you just want to have \"one\" device that you can use without having to fiddle with another camera or cell phone camera  this would do you fine.The only thing i do not like is the camera app.  it is simple enough unless you need to get into the settings with uses a weird circleish menu.......but no fear. there are a few good quality photo apps you can use with Android that replace the slandered camera app and if you are into pictures i would HIGHLY RECOMMEND you do that.  I also liked that you could change the aspect ratio.  i used 16:9 which does shrink the megapixels down a bit but looks much better when viewed back on the 16:10 nexus 7 screen and looks just fine on a 16:9 monitor.there were a few shots i took that i thought were pretty impressive even without editing.The screen is very nice its very easy to read text, i pulled up a free google book and had no trouble with that,  pictures look very good on it and overall it just feels like a quality product.I did not try any games on it just yet (saving that for christmas) but google maps and google earth seem to run fast and good on it.I also did not have any restart or freezing issues in the hour or so i have used it.  It turned off a few times but that was when i found out it was set to go to sleep in 2 minutes and some apps (Like the gps test app) will still cause it to sleep when used.  So i recommend go into the settings and change the sleep mode to 30 minutes. and i think there are apps /settings that can tooggle which apps can and cant cause sleep mode to happen.Battery usage seemed pretty good I used the nexus on about 1 hour and a half ish on just battery alone after charging to 99 percent and i took  a few pictures some video clips and used the gps test app for about 30 minutes and came back after using itotal for about an hour and a half to 92 percent charge leftto me that is very good and if you dont use the gps and do other things i am sure it will last longer too.I love the size and feel of the nexus 7 it just is small enough. its not too small and its not too big.  My last tablet was the ipad 1 so this is a pretty good upgrade for me.  I felt the ipad 1 for its time was a good tablet but its larger size and weight made it not so easy to carry around while walking to the church and showing things to people on foot with one hand and all. plus the ipad 1 has no cameras.Holding it while out tonight just felt nice. but i would recommend getting a case for sure as it feels just a tad fragile carrying around without a case.  but has a solid build and does not feel cheap at allOh and i forgot to say but the front facing camera is good enough.  it took decent pictures of me in average indoor light in my room at night.  so good enough in my opinion though the camera placement on the front is a bit odd but no problem.I haven't even used half of the features of the nexus 7 yet.  but i am very impressed and glad to see that it  will work fine Christmas when i re-open it.  I have not tested out the LTE yet (but that was not really something people have complained about)I will update this later for more infomation when christmas comes around i just wanted to make sure there was no issues and problems out of the box.  Oh and i had no problem with it finding my wifi connection, i know some people have said they had issues with wifi connection as well. felt solid and fast to me!All and All this is one of the best tablets for the price i am sorry for those who had hardware issues but i got mine this past week from Google so maybe some of the newer batches directly from them have fixed some of those issues.  I would say give it a chance it seems 9 times out of 10 this will be a flawless product!I am glad i took the dive and know come christmas i will have a lot of fun and get a lot of use out of it!So dont be afraid of the bad reviews some have posted on here, i say give it a chance and hopefully you will not be let down!", "Title": "Nexus 7 Is one of the best as long as it works!", "Date": "December 10, 2013"}, {"Author": "Z Habib", "ReviewID": "R1YFHSNRN4D4JC", "Overall": "5.0", "Content": "Bought this item from Google Store so technically I'm only writing a review here because there isn't one of this product on Amazon.So mine arrived back in October with T-Mobile sim card which I dont use. I wanted this device because I wanted to run Whatsapp on it hence I needed a SIM card tablet device and this one fit the bill perfectly. Plus I wanted a Google android, I knew KitKat was on its way, ASUS is a great brand and owning a Nexus is my dream.The device is great. It runs smoothly, is very quick in performance. No lag time at all. There was no krap installed from before. I love the swype gesture and ofcourse KitKat 4.4 is already on my device since well over 2 weeks now.The screen is amazing. The clarity, ufff! If the screen gets puggy i just wipe it off with my shirt and thats it! good as new! The back side can be cleaned off easily but since I purchase 2 rooCases (slimshell) along with this device, I dont really need to clean the back side.This device also has a notification light which is uber awesome :)If any of you folks need to know more, ask away. I may not be a verified amazon purchaser but i did buy the device from Google Store and love it to the very core.... hmm that actually rhymed ;)", "Title": "Best of the Best", "Date": "December 10, 2013"}, {"Author": "topaz_john", "ReviewID": "R384Q67CMLFMYP", "Overall": "4.0", "Content": "This is a great tablet, perfect in every way except that Verizon, the only carrier in my area, will not support it for LTE. Others have activated an older tablet and transferred the sim card to their Google Asus Nexus 7 which seems to work just fine. I paid extra for this tablet so I could access the stock market, weather etc. in remote locations without wifi but I'm the victim of some sort of competitive Google/Verizon turf battle. I'd recommend this very nice, well sized, and wonderfully detailed screen tablet with 5 stars if you can use ATT or Tmobile who will activate and support this newest generation of Google Nexus 7.Feb 17, 2014..update..Verizon has apparently resolved any issues it had with my Google Asus 7 Tablet and I was able to activate it at the Verizon Store. This is an amazing tablet, just what I wanted and very versatile. 5 stars", "Title": "Verizon won't activate", "Date": "December 15, 2013"}, {"Author": "Terry \"twoof\"", "ReviewID": "RKT1PXVICQEC4", "Overall": "5.0", "Content": "After much searching review reading and procrastination I picked this over all other and many options.I am not sorry. The best decision was to choose the LTE version with SIM Card slot for mobility data. (But back to that in a minute).The review after a couple months of hard use is as follows:Immediately went to Verizon store and added a data plan as a separate account. Sim card install for $35 and monthly plan with 2 gB data only $30/month. Now I am completely mobile free of wifi if need be.Left for Tuscany Italy and went to the TIM Italian phone store and purchased a SIM card and data plan monthly for 17 Euros first month and extra data. (Did the same thing for my HTC Droid DNA.) Using MagicJack I could make free calls to all my MJ people and very low cost/Minute to everyone else.As long as I had TIM coverage (3G and 2G) I was good to go.Nexus 7 2nd genPROSVery  good battery life and good support with Google and Apps (although I did not buy from google but Amazon). I purchased Square Trade Warranty and would strong recommend that you do also.Great screen, super fast response, tons of apps, reasonably good speaker, fast download, nice feel, Bluetooth works well (I purchased a Bear Motion ® Premium Folio Case with Detachable Bluetooth Keyboard for Google Nexus 7 II 2013 Version for $30 and it works well on Bluetooth ....has its own rechargeable battery). Gives protection and a good keyboard.Installed Chrome, Outlook, and it picked up all my apps from my desktop and HTC Smart Phone. Almost to easy.Worked all over Italy, and saved me a few times with Google Maps, Yelp, Trip Advisor, got mail and plotted trips.Returned to USA, swapped out the SIM and was back on Verizon in ten minutes.It downloaded KitKat upgrade within days of purchase. The day I went into Verizon they had just agreed to support this model tablet.ConsI had trouble with the audio jack to the point that it was dead. Called Asus and got service. They were prepared to take it back (to Texas) for repair or replace but I was leaving for Italy so I got a case number and postponed return. During the trip I got the Audio jack to work although it is touchy.Sound could be a little louder but not so bad.Bottom line is that I am recommending to all who ask.", "Title": "haven't touched my big laptop with this phone that is not a phone!", "Date": "April 24, 2014"}, {"Author": "John W Thomas", "ReviewID": "R1KMWRZ788SJVK", "Overall": "1.0", "Content": "KitKat 4.4.2 disables SMS messaging on this device. I will be returning it. I have a Nexus 5, love it,....SMS is done via Hangout and i expected the same on the 7. This is shocking.", "Title": "NO Text Messaging allowed - WARNING", "Date": "May 28, 2014"}, {"Author": "giriworld", "ReviewID": "RGO06RZ9F8RQI", "Overall": "5.0", "Content": "Very light weight, easy to carry. More useful for frequent travelers. Use slimport and enjoy on your HD TV. Excellent tablet very vivid picture quality and good sound.", "Title": "Excellent tablet", "Date": "April 8, 2014"}, {"Author": "JamRock", "ReviewID": "RQ03LKV07GBRE", "Overall": "1.0", "Content": "I purchased this in store on April 7 2014, few weeks go by and I am loving this device. Than on April 26 I plug it in to charge and go to use it a few hours later and the screen will not turn on. The device still works as I can hear it unlock using facial recognition. I can also guess where the numbers are and unlock the device that way too. I can make it ring using find my android. I can also plug it in to a PC and browse the files. Just what appears to be a randomly broken screen. No damage to the device at all and it has never been dropped. I babied the device.After calling best buy and learning their return and exchange policy is ONLY 15 days and that they would not take it back, I called google. Google was no help and told me to call Asus. Asus gave me an RMA number and I have to return it at my own expense for warranty repair. Btw, they say they may send you a re-manufactured or re-certified device in its place.....I have a screen protector on the device which will ruin the protector if I remove it, so I guess that is also more money down the drain. To make it worse I will have to pay for data while my device is away getting repaired or replaced.If you google nexus 7 screen problems or nexus 7 power problems. It's scary the amount of people with similar problems. There are all sorts of different power on/off sequences with power on and volume buttons to try and fix but none of them actually do.Will report back with what my experience with Asus is like. Very disappointed in best buy. If they can't guarantee a product for at least 30 days then they do not deserve my future business. Lots of other retailers both on and offline which still do 30 day.update: May 7 2014,Asus has had the device for 1 full week now, they have not been able to provide me a status online or through their support team. I am beginning to fear the worst. Their online status webpage says it take 1 business day after receiving item to update status. Asus support says devices are typically turned around in 5 to 7 days. Both statements have come to be false!", "Title": "Great until it stopped working!", "Date": "May 4, 2014"}, {"Author": "Turbojacket", "ReviewID": "R20TRF4EVX9KZ4", "Overall": "4.0", "Content": "SizeI really love the size of this tablet. It fits right in the back pocket of a pair of jeans. You can very easily hold it with one hand. The 1920x1600 screen is gorgeous and when playing high definition movies, there's very little letterboxing. This is great as I really can't stand the letterboxing on my iPad Air. Compared to the letterboxed iPad mini, the actual video size is roughly identical. So if you just want a tablet to watch movies on, save your green backs and just grab a Nexus 7.DesignThe finish of the back is nice. The rubberized coating makes it easy to hold, unlike alumninum finishes. One gripe would be that the only way to wake it up is from the side button. I very much prefer the home button design on other tablets. The face is all black, the sides are all black and usually I am using it in bed at night in a dark room SO I find it difficult to know what orientation the device is in therefore making it very hard to find the side buttons if it goes to sleep. I changed the screen to shut off after 5 minutes instead of 30 seconds. This has resolved a lot of the issue for me. However, overall the design is quite nice not as finally crafted as and iPad but it will not disappoint most people. There is one spot on the bezel that squeaks if you press on it. Not that big of an issue, but you can definitely tell it's plastic. My iPad never squeaks and feels very much like it is one solid piece. I don't care that much but if you're looking for that iPad fit and finish, this ain't it. But it comes pretty darn close.SoftwareThis tablet is chock full of very good features. The voice recognition has come a very long way. it is not as accurate as Siri however it does allow for a little more versatility as it displays what you say as you say it. I am using it to conduct this review. It also doesn't seem to need to hit a server to dish out the words. If it does, it's really fast. I hate that Siri needs an internet connection to work, but I get why it was done that way. It can always be improved on a server vs the device where you have to rely on people to update. I also very much like other features for instance the integration of all the Google Apps. Also adding movies doesn't involve iTunes (THANK GOD). If you are on a Windows machine, you just drag the videos to the device as if it is just another folder. With a Mac, like myself, you download the Android file browser App and it is essentially the same thing. It even pops up when you plug your device in. The Google Play store pales into comparison to the App Store on an iPad. Key Apps like Pro Create (an incredible drawing app for iPad) just do not exist. But your onslaught of Plants vs Zombies and Angry Birds are plentiful. I played a Tetris game for hours once on the Nexus. The tall screen orientation really suited that game.Compared go the iPadIf you have grown up with Apple products like the iPhone and iPad you will probably want to spend the extra money on an iPad Mini. It's larger, and in its naked form does squeeze into a set of jeans but quite awkwardly. As an iPad Air user I just wanted something more \"pocketable\" but, if I had to pick which tablet to keep it would be my iPad. Considering the price of the Nexus 7 it is very difficult to argue the need 4 the more expensive tablet. Do you think a $500 tablet with is only 16 gigabytes is a little steep. The Nexus 7 definitely is a bit of a compromise between fit and finish, size, and app library but depending on what you are using a tablet for you shouldn't be disappointed. It is more portable than even the iPad mini and with 32 gigabytes and LTE it really is a very solid purchase for 90 percent of tablet users.ConnectionsNo SD slot, which is a bummer, but 32 GB is plenty so far. Wifi is very fast, LTE is blazing. A few spots in my house that my iPad has trouble connecting to, this Nexus has no trouble. Aluminum interferes a lot with the signal into and out of the iPad. Since the Nexus is plastic, I am thinking that must be the reason.Speed/StabilityI'm very happy with it's speed. Nothing has made it stutter. I haven't put it through a really tough game yet, but for day to day, it's perfectly fine. No issues at all. No crashes in the week I've had it. I'm very happy with it.I'd give it an 88/100, but only because of the no true home button, and the mildly squeaky plastic seams around the device. As far as performance goes, it's a must have for a true Android experience.", "Title": "Not an iPad but definitely a wonderful tablet for the price", "Date": "March 20, 2014"}, {"Author": "Ravi", "ReviewID": "R7XVJH6094J2S", "Overall": "4.0", "Content": "Really good and sleek and working with good condition. Usage is very ease with good User experience. Will recommend the product", "Title": "Really good and sleek", "Date": "April 25, 2014"}, {"Author": "mido", "ReviewID": "R2DPWJEWW1BLVK", "Overall": "5.0", "Content": "Google made a piece of art in cooperation with ASUS. It's really magnificent. For me it is better than ipad.", "Title": "EXCELLENT TABLET", "Date": "April 3, 2014"}], "ProductInfo": {"Price": "$349.00", "ProductID": "B00FJDVSTA", "Features": "7 inch Display\nQualcomm Snapdragon S4 Pro 1.5 GHz\n32 GB Flash Memory (actual formatted capacity will be less), 2 GB RAM Memory\n10-hour battery life\nPhotos and video with dual HD cameras: 1.2MP front and 5MP rear", "ImgURL": "http://ecx.images-amazon.com/images/I/418KVzHTenL._SY300_.jpg", "Name": "Nexus 7 from Google LTE Version (7-Inch, 32 GB, Black, LTE) by ASUS (2013) Tablet"}}