{"Reviews": [{"Author": "chaim1845", "ReviewID": "R1483J6LTAYWJ7", "Overall": "5.0", "Content": "I'm a big fan of all the Wolvol products and just got the tablet and its really useful and enjoyable and over all its not expensive", "Title": "love the tablet", "Date": "November 30, 2013"}, {"Author": "DC", "ReviewID": "REFLZIJ36YZ2I", "Overall": "5.0", "Content": "Recieved the product on time and in good condition. It was purchased as a gift for a child. The child loves the tablet", "Title": "Excellent Service", "Date": "October 25, 2013"}, {"Author": "1consumer", "ReviewID": "R1M1UZ89WRME8", "Overall": "5.0", "Content": "The unit is the best I've seen for the price. It's pink and every little girl could use this.  The protective plastic on the screen was the absolute worse I've seen.  I usually keep the screen protector on for a while.  I had to remove this wrinkled up, barely sticking plastic immediately. Anyway, the unit is definately 5 stars!", "Title": "Love it", "Date": "October 3, 2013"}, {"Author": "Lauren Spencer", "ReviewID": "R1S4OSKS4C7OW6", "Overall": "1.0", "Content": "I bought this in January and it stopped working already. Both of them! My kids are so upset. Can't give more than one star", "Title": "Bought two both don't work after one month", "Date": "February 21, 2014"}, {"Author": "Squeakss", "ReviewID": "R35N9I1HU5SL8H", "Overall": "2.0", "Content": "I bought this because of the cost and the fact that it has the unique full sized USB port, which I really do like. However, the flaws in this product outweight that one perk. For one, battery life is horrible as it only lasts about an hour before it dies. I have 3 apps on it that I loaded--so it is not an app overload causing battery drain--and I am not able to load any more. The description boasts that it supports flash, which was another thing that appealed to me. However, BUYER BEWARE. This does not mean it supports flash games like on facebook, which is what I was hoping to do. I would have checked other sites, but to be honest, I would be 30 years older by the time a page loaded. Netflix does play on it, which is about all I use this for now. However, if you get this, give netflix about 5 minutes until the picture smooths itself out so you're able to see something more than moving blobs on the screen. Other than all that, it's um...well. It's pink. And it makes quite a pretty paper weight. I do have to say the seller does reply fast, at least.", "Title": "Well, it is pretty", "Date": "February 5, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00F4N27EA", "Features": null, "ImgURL": null, "Name": null}}