{"Reviews": [{"Author": "shaunice", "ReviewID": "R3KAEPL971TCML", "Overall": "1.0", "Content": "My screen was cracked when I opened it up for my daughter as a gift everything else seemed fine to me", "Title": "My screen was cracked", "Date": "April 7, 2014"}, {"Author": "Danyel S", "ReviewID": "R3QB25PONP8G21", "Overall": "1.0", "Content": "This tablet broke after three weeks! I cant return it because I have had it. Just a waste of money....", "Title": "broke", "Date": "April 2, 2014"}, {"Author": "Tony", "ReviewID": "R1GBS0CDEXQJ3F", "Overall": "4.0", "Content": "I knew what I was getting into when I got this, and wasn't expecting much. However, aside from the display being a bit dull, and lacking some saturation, the hardware is pretty solid. I got two tablets, all the games I put on for my children seem to run smooth, some won't work but a majority of them will. A big plus is this thing already has the Play Store on it, a lot of budget tablets don't. The cameras are pretty crappy, but for a 3 and a 4 year old I think it's fine.", "Title": "So far so good", "Date": "March 30, 2014"}, {"Author": "saphira", "ReviewID": "R2VXQK2IMJI3CF", "Overall": "1.0", "Content": "The shipment was way too late for what I expected!!! I placed an order for two but only received 1. I waited a month for them.. called them and told them I only received 1 of my orders and they got my info and everything, and I received it the next day.. Wow... why didn't they do it like that for the holidays.", "Title": "poor productivity and customer service.", "Date": "March 22, 2014"}, {"Author": "Ann & David", "ReviewID": "RUB248AEQCS05", "Overall": "5.0", "Content": "I searched amazon for a good but cheap tablet just for my kids. This is perfect for them. I was able to put their games on there no problem. One con was that I needed to buy a micro sd card as it does not have a lot of space even for just kids games. Glad I bought these for my kids.", "Title": "Great for kids", "Date": "March 13, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1NEIT6DH2H4ZI", "Overall": "1.0", "Content": "I had to return 2 that I purchased.  Neither one could connect to my wifi sitting only 10 feet away from me.  I'm disappointed.", "Title": "weak wifi", "Date": "March 13, 2014"}, {"Author": "Lashada", "ReviewID": "RJ4R2OCTNWCDN", "Overall": "3.0", "Content": "Cool little tablet.....however you can't change the default Asian search home page!!! I purchased this for my toddler so I guess it will do. -_-", "Title": "It's decent....could be great!!", "Date": "March 12, 2014"}, {"Author": "amanda", "ReviewID": "R1U334924LJBK0", "Overall": "2.0", "Content": "I like it but I dont have internet yet . Looking forward to using it.then I will rate it again.", "Title": "nice", "Date": "March 9, 2014"}, {"Author": "Samwise0311", "ReviewID": "R1JOF63A1OP81T", "Overall": "5.0", "Content": "I ordered two of these tablets last month, one for my 3 and a half year old daughter, and one for myself. I needed something to entertain my daughter that was her own, rather than having her steal my phone all the time. They did take a long time to come, so long that I almost asked for a refund, but I wrote to the seller to find out what was going on and they informed me that their shipments were delayed thanks to all of the winter storms we had here in the Northeast, which I understood. Plus, they got back to me promptly, which I appreciated. The tablets have had no issues so far. Another great thing is that I was able to add the mobile hot spot feature to my cell phone for an extra five bucks a month, so now my daughter can use her tablet to watch shows on netflix or hulu plus regardless of where we are, which has been quite helpful now during a couple of doctor appointments and while traveling. A three hour drive in the car is no longer a battle! I also was able to get some apps on her tablet that she really loves, and she has been very good about taking good care of her tablet and being careful about where she puts it down when she is done with it. Overall, if you are looking for a good tablet for yourself and for your child, this is a great option, if you don't want to spend a ton of money, which is obvious if you are buying for a child. My daughter has both an innotab and leapster, and while those are both great, she got bored easily b/c I don't have 30 bucks to drop every time she wants a new game. This makes a lot more sense, because I don't pay a small fortune every time she gets bored with the games she has, plus she can watch shows as well. I got a her a great app called Starfall Learn to Read, and my 3 year old is actually learning how to read! I'm very impressed with these tablets and will recommend them to anyone who asks!", "Title": "Love this tablet!", "Date": "March 8, 2014"}, {"Author": "Mona James", "ReviewID": "R98MBR1S967A6", "Overall": "5.0", "Content": "it is working super good and meeting  my need. continue to make customers satisfied I received it on time and well package", "Title": "good product", "Date": "March 8, 2014"}, {"Author": "Jennifer J.", "ReviewID": "R3JXKN30G28WX4", "Overall": "1.0", "Content": "It has a problem with it.  The wifi will not work.  I'm trying to find out how I can exchange it or return it.  There really is no way to find any information to do that.  Now my daughter is suffering without a tablet and everyone else has one!", "Title": "Contact information for product stinks!", "Date": "February 25, 2014"}, {"Author": "Iqra Shamas", "ReviewID": "R28C7N9CW7HTSE", "Overall": "1.0", "Content": "It didnt really meet my expectations. It works too slow even where the wifi is. Have to keep tapping the screen for an app to open", "Title": "Disappointment", "Date": "February 15, 2014"}, {"Author": "icerone", "ReviewID": "R2H5DPHOQ9WYUO", "Overall": "5.0", "Content": "this gave me the ablity to give my lil one a tablet of her own and it works just fine no problems", "Title": "just rite for kids", "Date": "January 22, 2014"}, {"Author": "Mario Lopez \"hp fan\"", "ReviewID": "R877M9IUHXPQV", "Overall": "5.0", "Content": "Excellent product for such bargain $60! Obviusly this is not an ipad, touch screen is not fast or as sensitive yet it does what is supposed to.", "Title": "Great for kids and non demanding users", "Date": "January 16, 2014"}, {"Author": "Amyle Hoglin", "ReviewID": "RZVQL40PZZW8Z", "Overall": "1.0", "Content": "First, support for this tablet does not exist.  There is no ProntoTec website and finding any support is laughable.Second, the \"Update\" button, does not work.  Not sure if that is a defect or normal, but there it is.Third, because the update would not work, several programs and apps, including Netflix, were screwed.This tablet does look nice and is light weight, but for close to the same price, the RCA 7 inch tablet with 8GB memory from Walmart, is a MUCH better buy.This is being sent back for a refund.", "Title": "Netflix? Not so much", "Date": "December 31, 2013"}, {"Author": "Pleshette Cunningham", "ReviewID": "R36SX4700OH8FV", "Overall": "4.0", "Content": "I love this tablet. It does everything I wanted it for. The only thing that would make it better is if the cases were found easier for it.", "Title": "love this tablet", "Date": "January 31, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1SHL9YRWT3Y09", "Overall": "1.0", "Content": "I bought this for my 8 year old. I knew I wasn't getting an iPad and I didn't expect that I was but, I surely thought it would last more than 2 weeks. At first my daughter loved it, she downloaded all her favorite games and played them with ease. That is until one evening it froze up on her and wouldn't do anything. I read the instruction manual and it encouraged me to use the reset button on the back of the device. I did, I reset it but then it wouldn't connect to the wifi, wouldn't even pick up the signal from either router I have in my house (and I know the routers were functioning, I have my iPad and my other 3 kids all have their tablets and phones connected to them) After taking with technical support (via the manufacturer) they said I had to do a complete system restore, so I did that too! Still not working! I definitely would NOT recommend this tablet to anyone!!!! It is horrible!!!", "Title": "One of the worst tablets I have ever purchased", "Date": "January 22, 2014"}, {"Author": "MARK", "ReviewID": "RLGJ40LUY4LQR", "Overall": "1.0", "Content": "Too bad there's no ZERO to rate this piece of junk, I don't understand how the seller can pass these off as tablets, noting works; connectivity sucks, downloading sucks, web browsing sucks, it's unresponsive to simple commands, I touch a certain app and something else opens, I bet the person who has written good reviews must be an employee of the seller, or it's the seller trying to do damage control. These tablets come from somewhere in Asia where quality-control isn't important, I'm guessing the seller gets these tablets at a very low cost in Asia and sells them here in the United States for $70 dollars a pop which is a good scam.", "Title": "Warning don't buy", "Date": "January 14, 2014"}, {"Author": "Lynn C", "ReviewID": "R2M99CEWWVO469", "Overall": "2.0", "Content": "The custom (and locked) ROM that comes with this tablet is rather cobbled-together and that sort of ruins the experience.  The hardware is decently fast - definitely considering the cost - and the battery life is better than the other 7\" tablets I bought for Christmas 2013.  The Google Play Store is pre-installed, as are a few apps, but you cannot customize this tablet as well as others.  The ROM these guys have installed is clunky - it's clearly lifted from a mobile handset and not properly customized (the tablet \"thinks\" it's a mobile phone).  I cannot get some apps off the home screen, for example, nor can I un-install some of them.  Also, the OEM web browser will not allow me to change the home page and it insists on going to some foreign-language home page every time I want to use the Internet.  Also, the Wi-Fi radio in this piece is very poor - perhaps also because of the software.  So, Wi-Fi range is very limited.  If I'm not within 20 feet of my hot spot I don't have enough signal to download apps or load web pages.  When in range, the tablet will stream video very well and the picture / sound quality is actually pretty okay.  The rear camera takes okay photos and it even has a flash.  Overall, I think there are better choices for just a little more money.  This tablet would probably be just fine if the developer would have taken a little more time to sort out the ROM.  As it is, it's mediocre at best. I'm not going to return it, as it would cost more than my trouble is worth.  I'm going to play with it and see if I can find a better ROM to load at some point.  I'd recommend looking elsewhere if you're not inclined to rooting / hacking.", "Title": "It would be a LOT better without the custom ROM", "Date": "January 10, 2014"}, {"Author": "heather pugno", "ReviewID": "R2T6A1PD2W82PX", "Overall": "1.0", "Content": "ORDERED ITEM FOR MY CHILD'S BIRTHDAY AND THE SCREEN WAS BROKEN RIGHT WHEN SHE OPENED IT!!! SHE WAS HEARTBROKEN WHEN SHE SEEN IT...", "Title": "Very Upset with purchase...", "Date": "February 17, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00FGNAP2E", "Features": null, "ImgURL": null, "Name": null}}