{"Reviews": [{"Author": "Congzilla \"Congzilla\"", "ReviewID": "R22BV5W6TWXM4F", "Overall": "5.0", "Content": "First off Tabeo is a Toys R Us name brand so you can get it cheaper directly from them, $129 yesterday.  At that price this tablet has a lot of power and a lot of apps for the price.  The wifi and parental controls setup was very simple and I was able to have my child up and playing in about 30 minutes.  It took about 30 minutes because all of the included apps have to be installed.  Once it was going my child spent the rest of the day using it to take pictures, listening to audio books and playing educational games.Christmas came early and my son loves it.", "Title": "Great Starter Tablet", "Date": "November 18, 2013"}, {"Author": "Melissa J. Newman \"msolomon25\"", "ReviewID": "R201RV22B84KYS", "Overall": "4.0", "Content": "I bought this for my kids 8, 10, and 1 year old.  In terms of hardware, it had the largest screen in the \"kids\" category -- 8\" instead of the standard 7\".  All of the other specs were the same as the other tablets in this category we were looking at: 2mp camera, 8GB internal memory (expandable with SD card), Android 4.2 Jelly Bean.In terms of installation, the check boxes on the installation website are a pain to click.  They are too small even for my petite fingers.  Although, I had the screen in the portrait position, so it might be different in landscape.  Once you create an account through the tablet, you can just log in through a regular computer to change the settings in the future.  So that is annoying (not a deal breaker, although it felt like it during the installation).There is one setting during setup that allows all searches to return Wikipedia as a \"child safety feature\".  Basically, the tabeo is prepending \"site:wikipedia.org\" in front of all searches -- standard Google feature.  The concept I agree with, but I would never put Wikipedia and Child safety into the same category.  Tabeo should allow a user to set the \"default\" website.  For example, I personally would pay the subscription for World Book or Brittanica and use that feature for one of those sites, because those sites have editorial staff and \"questionable\" topics return what one would expect from a middle school textbook.  Wikipedia shows actual photographs, which I would not consider acceptable for children.  But that is a software issue, not a hardware issue.I have not fully tested the internet filtering.  We setup \"opendns\", so we have basic protections throughout our whole Wifi at home.The default \"bookmarks\" for chrome (the browser pre-installed) are all grown up bookmarks (MSNBC and other similar websites).  I would have expected to see sites like Disney, PBSKIDS, etc.  But again, that is an annoying software issue, not a hardware issue.I agree with the others.  Install \"Amazon App\" (from a standard download from Amazon) which will allow the downloading of more apps.  Once that is installed, you can install the Netflix App (http://www.amazon.com/gp/mas/get/android)This tablet is a toys-r-us product.  The toys-r-us sales people are given a \"test\" about this device, so they can answer customer questions, but I don't think they were ever given a tabeo to play with.  The sales person did not know anything about installing Amazon Apps.  He thought it was not possible, but if a parent allows downloads and installs the Amazon download app, it is possible. Also, the covers that toys-r-us sells are marked as being for a Tabeo e2, but they only fit the 7\" Tabeo.  I ended up buying a cover from Walmart that is marked as being for a 9\"-10\".", "Title": "Good device when compared to similar devices", "Date": "December 8, 2013"}, {"Author": "Rebecca Gibson \"Becky!\"", "ReviewID": "R2E4AJHAK95ZO9", "Overall": "4.0", "Content": "I bought this for my son for his 6th birthday. I was also looking at the nabi 2. I kept debating between the two. I finally decided on the tabeo. I based my decision on the price factor since they were basically the same in technology (well i'm not a techy, so don't base your opinion on mine) I wanted the buyer protection plan so it would have been $200 for the nabi v.s. $170 for the tabeo. My nephews have the nabi so I could compare more now then before I bought the Tabeo.Tabeo:Pros:1. I like the setup of the apps. Makes it look like a adult tablet.2. Good graphics and speed for a child's tablet.3. My son seems very happy with the ability to find his way around it easy.4. Parental controls.5. lightweight design.6. Durability*I will add more if I find more I like about it. I hardly play on the tablet myself.Cons:1. Camera is awful. The nabi has a way better camera.2. Freezing on some apps.3. The tabeo store is limited. (I also downloaded the Amazon market)4. I have had a few small issues with installing and some apps not working correctly. I reset the tablet and reinstalled. I haven't had the problem again so far.5. When my child pulled off the protective case himself it made the tablet come apart. It was fixable, I'm sure its the way the get in to fix the tablet.I think that's about it. We really do like the tablet. If I become dissatisfied I will post about it.", "Title": "Good Tablet for 5 and up...", "Date": "December 14, 2013"}, {"Author": "Tamara G. Mutchler-walsh", "ReviewID": "R26UMKLID1I0TS", "Overall": "1.0", "Content": "I shouldn't have to go to fixya.com to figure out how to get the passed setting up parental controls. the manual that comes with the device makes huge leaps in the process and assumes you will be able to figure them out. The support number is out of service. These things are 150 dollar paperweights currently. I will hold on to it long enough to TRY and get some customer support, but I'm REALLY considering getting my money back. Not worth the frustration. I'd rather risk my kids encountering porn than have to jump through flaming hoops with bad directions. Words cannot convey how upset I am with this piece of crud.", "Title": "what support? draconian process...", "Date": "December 25, 2013"}, {"Author": "Tim Mardis", "ReviewID": "R89LNGIY3FNBX", "Overall": "1.0", "Content": "I did my research for the best kids friendly tablet, and Tabeo was at the top of my list.  On Christmas morning my boys opened their tablets and wanted to play with them, but I was made to register the parental control first before they could play.I took the tablets into a quite place while they continued to play in an effort to register them without notice.  While the registration process seemed easy enough this is were the drama began!On both tablets simultaneously, I got to stage one of the process, and then to stage two, but I was unable to check the box on either tablet.  So I shut the system down and tried again... but no luck. So I attempted this process four more times before attempting to contact Tabeo tech support.  Guess what?  Their 24/7 tech support line was busy, and busy and busy; why couldn't they at least leave a message stating the obvious --- we're experiencing server issues and we're working diligently to resolve the problem or something like that, but not just a busy signal (I am still receiving a busy signal the day after Christmas).  So I tried their Chat Support, but no one would pick up and therefore I kept receiving a dialog box in which to leave message.  I then emailed them and 24 hours later I've yet to receive a reply.  And I am not at all sure why there are Chat Support Apps on the tablet when you can't chat until your Parental Control has been set up.I tried for hours, 13 hours to be exact to register these tablets.  And perhaps the most frustrating part was whenever I would get to step three and/or step four, I would be sent back to step one (very frustrating).I am not sure who wrote the program for this worthless device, but if they should be FIRED immediately if not sooner.  Imagine all of the children who received this for Christmas and were disappointed that Santa would bring them something that didn't work.Here's an idea for the geniuses at Tabeo/Toys R Us, rewrite the program and allow the children to play with some of the Apps that are rated kid friendly so that they could at least have access to their Christmas present and then have the parents register the tablet when the child needed access to the Internet.  Simple enough!!!!", "Title": "Would have left \"ZERO\" if allowed!", "Date": "December 26, 2013"}, {"Author": "Lisa", "ReviewID": "R19OIM32OEJXYA", "Overall": "2.0", "Content": "My child received this tablet as a gift.  It took a week to finally get the parental filters set up so it could actually be used.Then the apps that were preloaded disappeared.  I have followed explicit instructions to try to reinstall them, but it has notworked.  I would spend a little extra to buy something that actually functions seamlessly rather than spending hours trying to set upthis supposedly \"kid friendly\" tablet.  Initially I liked that fact that it had parental controls, but it turns out it is really annoying and time consuming for the parent.  I think efficient enough controls can be set up on real tablet to prevent viewing of inappropriate sites by younger kids.", "Title": "Save your money", "Date": "January 1, 2014"}, {"Author": "Joshua montella", "ReviewID": "R2MHY2109X2K7C", "Overall": "1.0", "Content": "how do i start the customer service is nothing shy of miserable terribly unpleasant and seems like nobody has a clue about the system they are working with....im a tech junkie and have it all including ipads and i wish that i would have spent the extra hundred dollars on a previous version i pad for my son for Christmas he tends to through mine when he gets mad there for is the only reason i bought this junk... took two days to get this thing registered there in such an upheaval after Christmas with there under staffed sub par customer service all you get is a busy line haha! no message no call back service just as bad as it gets! finally registered the product and now with the email and password i registered the device with minutes before after a day and a half of trying! so now there are parental settings to control what your child can play with as far as apps go ....all apps pre loaded are locked they open and right before the screen loads to play poof the app closes parental guidance lock out! haha please people god please stay away from this hunk of junk go get a regular android tablet or an ipad... im off to return this thing thank god my lady stopped me from hurling it out my attic window yesterday! it gets 0 stars from me and as you can see its a two star average pure misery!", "Title": "absolutely horrendous!", "Date": "December 28, 2013"}, {"Author": "DJ Danny D", "ReviewID": "R8WMG1ZT8S4LN", "Overall": "1.0", "Content": "Nothing works except a couple kids apps. Parental control is HORRIBLE! Everything about this tablet is time consuming, a road to nowhere, & frustrating. You'll be better off just buying a regular tablet that allows everything from the start, I'm returning this IMMEDIATELY!!!", "Title": "GARBAGE!!!", "Date": "February 17, 2014"}, {"Author": "Matt M", "ReviewID": "R4E9S6UPXOXU", "Overall": "1.0", "Content": "We bought a pair of tabeo 2s for our sons, and gifted them as Christmas presents. They lasted 19 days. Instead of drawing power via The USB mini port, they come with tiny plugs (smaller than,  though similar to headphone jacks, and located on the same side for extra confusion) that very quickly failed on the tablet side. It would legitimately take 5 minutes of tinkering to find a way for the table to lay where it would charge.  The screens would pop out, and after that they would quit working periodically until the tablet was restarted. Were they dropped? Yes. But they came in a rubber, ruggedized case and were marketed for kids, so.....As for the parental controls, ehhh. It's easy to set up hours for Internet access. You can disable the Internet for a given hour block everyday, or a given day of the week, or an hour on certain days, etc without too much difficulty. Apps, however, require you to individually disable the app completely, then enable it for certain hour blocks. The rub is that every change requires a screen refresh.  So for me, for example, I wanted the tablets to have no Internet or functional apps after 8pm (bed time) until 6am (when they would normally be up for school). That meant getting to the screen for controlling Internet access, then 14 screen refreshes at several seconds apiece. Then navigating to the apps control page, then a similar 14 screen refreshes per app after one to disable it and another to pull up the list to disable by hour blocks. After all that, one app was set up the way I wanted it. The tablet comes stock with 29 apps. So 14 screen refreshes per app times 29 apps, times two tablets for me. You'll understand that I was a little irritated because that is the type of tedious, repetitive work computers were. INVENTED to end.All in all, the tech support promised to update the settings matrix on the parental controls sometime in February of 2014, and they were pretty prompt about getting back and helpful. As far as how it ran, the tablet itself performed okay, I think. It wasn't blazing fast, but I didn't spend a blazing fast amount of money.The real problem is that the tablet that was supposed to be rugged enough for kids had flimsy construction and a frail plug in for the charger.", "Title": "Garbage", "Date": "January 12, 2014"}, {"Author": "Paul Mazurkiewicz", "ReviewID": "R1PSX5L0AQWKY5", "Overall": "5.0", "Content": "Got this for my girlfriend's 5 yo grandson for xmas. It is permanently attached to him and he has mastered using it and it's very educational too.  5 stars!", "Title": "Grandson loves it!", "Date": "January 7, 2014"}, {"Author": "D. Landress", "ReviewID": "R2ASQGFMKVVUG5", "Overall": "1.0", "Content": "NOTHING ELSE MATTERS IF YOU CAN'T CHARGE IT !!!The tablet will work long enough for your kids to get totally addicted to having their own iPad type device. And you'll be totally addicted to getting to use your own iPad again. BUT THEN the charging plug will start to wiggle. And eventually you won't be able to charge the device. AND THEN your kids will be heartbroken.IF YOU OWN A TABEO E2 ALREADY- Return it while you can.IF YOU STILL WANT A TABEO E2 - Save your dollars a little longer and buy an Amazon Kindle HD with Parental Controls.", "Title": "BUYER BEWARE - The Tablet that Could Not", "Date": "January 19, 2014"}, {"Author": "Gearetta R. Brown", "ReviewID": "R2KFS0N0GYB554", "Overall": "1.0", "Content": "Totally disappointed with this product.  I bought two for my grandchildren and have been trying to register them since Christmas day.  I feel so bad that I purchased these for them and they don't even work.  The technical support website keeps promising the problems will be resolved, but no evidence of that.  Been on hold for more than an hour.I would not advise anyone to buy this product!!!!!  And Toys R Us will not refund my money.", "Title": "Ripoff", "Date": "December 28, 2013"}], "ProductInfo": {"Price": "$189.99", "ProductID": "B00FAZ2GWK", "Features": "Operating system: Android Jelly Bean 4.2\n8\" capacitive, multi-touch screen with a 1024 x 768 pixel resolution displays more than 16 million colors\nDual-core 1.0 GHz processor and a quad-core GPU offer quick and easy browsing, viewing and gaming\nCustomizable parental controls let you limit the content your child views and the amount of time he or she spends using certain apps\nPreloaded with 30 apps, including learning apps like Operation Math, games such as Bejeweled 2 and Fruit Ninja, and more", "ImgURL": "http://ecx.images-amazon.com/images/I/41krA8WqTFL._SY300_.jpg", "Name": "Tabeo E2 8 Inch Kids Tablet - Blue"}}