{"Reviews": [{"Title": "Great First Tablet (not exactly an iPad, Tab, or Note)", "Author": "Blaine Riewaldt", "ReviewID": "R27N6FWR83OLXE", "Overall": "4.0", "Content": "I was given this tablet as a present. It can be purchased for $100.00 at H.H. Gregg. I had sold for practically free my Nook Simple Glow to an elderly lady who loves Danielle Steel novels.Despite what I've read on the internet the Wi-Fi works great. I have a 802.11 b/g/n router at home, and when away from home I use my Samsung Skyrocket as a WiFi hotspot. Fantastic reception on both with no problems whatsoever.It is hard to find a protective cover for this tablet. I had to order one from Amazon.com. The audio speaker for the tablet is in back, which makes it hard to hear the streamed music when the cover is on.B004V93166This tablet has no Bluetooth or GPS.The pre-installed YouTube app is incredibly choppy. Download \"Video Tube\" by Xellent from the Play Store because it works flawlessly.This tablet doesn't use the USB port to recharge though it does have a USB port. It uses a crappy proprietary charger.And lastly, for the bad, the tablet has a metal back and a glass front which makes it -I'm going to sound like a wuss here- HEAVY.Now for the good:Samsung uses Touchwiz, HTC uses Sense. Want this tablet to work faster and very well? Download a launcher from the Google Play Store. I tried to get Apex launcher because I liked the way the trial version worked but the Play Store actually wouldn't even allow me to purchase the app. I went with Smart Launcher Pro instead. Screens slide smooth as silk.The Google Chrome browser that comes pre-installed sucks in a seriously non-enjoyable fashion. The built-in native browser works great. If you want an even better browsing experience, download FlashFox, use the \"add-ons\" option to add \"Phony.\" Phony is an add-on that makes the websites that you visit think that you are using an iPad, or desktop computer' or Android phone' or an iPhone. It works best on the \"iPad\" setting for some odd reason.The tablet comes pre loaded with driver software for the Windows operating system (I don't know about Mac OS) so it's plug and play with desktops and laptops.Barnes and Noble Nook (as well as Kindle) apps are free in the Google Play store. This tablet is better than the Kindle and Nook ereaders but the Kindle and Nook tablets blow this one away.This tablet comes with an HDMI port to watch the movies or see the pictures from your tablet on a monitor or television (though I can't understand why.)The most bizarre thing on the tablet aside from the less-than-one-megapixel camera is the button over the volume button that you'd think would be a camera button but is a browser \"back\" button. Yep, the tablet has a physical browser \"back\" button.All of that said, I highly recommend this tablet to the person who wants to move on from an ereader but doesn't really want a tablet.", "Date": "October 1, 2013"}, {"Title": "This is a great tablet!", "Author": "L. Tucci \"letucci\"", "ReviewID": "R2KIDQDS74ZB9C", "Overall": "5.0", "Content": "I've only had it for a month but I must say for $79 w/case and keyboard sold at Big Lots, it  is a good buy!  At first I had a little trouble with the external keyboard, but it seems that once the tablet recognized the new device, it worked very well.  The graphics and sound are good, no trouble with games and movies and the print is very clear for reading ebooks.  I'm really enjoying this tablet and hoping it will stay working this well.  If not, I'll update this review.", "Date": "January 1, 2014"}, {"Title": "Excellent First Tablet", "Author": "Barbara", "ReviewID": "RAWCMKRVA9TWO", "Overall": "4.0", "Content": "I have the 8\" tablet, which I've had for about a month and a half.  I've used a smart phone for years and love my laptop.  This Proscan tablet, while inexpensive, has taught me that I definitely love tablets.  I'll probably get a higher end one, sometime, but for now, this little thing is just great.  Don't fill it with too many apps and add an sd card for movies, photos, files, music, etc.", "Date": "January 20, 2014"}, {"Title": "Works Great But........", "Author": "Donna Kuhl", "ReviewID": "R1VM6W2XJP68DN", "Overall": "3.0", "Content": "I purchased 3 for my children. They were a gift so did not get opened for 2 weeks. I purchased them at Big Lots. One of the tablets came with a cracked screen. The other two were fine and work great. The other one works but have not been able to get a replacement screen. Does anyone know where I could get a replacement screen? I have had no luck with Manufacturer!", "Date": "November 16, 2013"}, {"Title": "Would not recommend!", "Author": "Rita MacQuarrie", "ReviewID": "R14Y2ZHSUB8EDC", "Overall": "2.0", "Content": "Worked okay for about two weeks then froze.Could not reset. Spent two days on the phone with customer support. Poor support line -hard to understand them, they did not seem to understand the problem and asked meto do the same things three or four times.  I finally got totally frustrated and just returnedthe tablet.A week later a friend who also bought one had the same problem and had the sameexperience.Proscan needs to correct these problems if they want to compete in this market!!", "Date": "February 19, 2014"}], "ProductInfo": {"Price": "$129.00", "Features": "8 Inch Android 4.1 Wifi 4Gb Tablet.", "Name": "Proscan 8\" 4GB Android 4.1 Jelly Bean Touchscreen Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/51pgV6OCi5L._SX300_.jpg", "ProductID": "B00F689T26"}}