{"Reviews": [{"Title": "The iMuz Q9 is a great tablet", "Author": "Peter Wayne", "ReviewID": "R2RQM5NYYC6SJY", "Overall": "4.0", "Content": "This product is light and easy to use with excellent battery life, the screen is bright and comfortable for reading and playing games.", "Date": "January 9, 2014"}, {"Title": "The Latte ICE Tab2 is Excellent for the most.", "Author": "G. Perry \"Maine Techie\"", "ReviewID": "R2PS9HZIQJNMSX", "Overall": "4.0", "Content": "Here is my review.Pros:• Very fast and lag-free on pretty power hungry apps.• It is a PowerHouse from the 1.8ghz Quad-Core Processor and does not dissappoint.• It has a RockChip Update System, which I welcome due to available patches/firmware updates.• The ram is around 1GB and does work properly, the cache system which some people don't know is a Major factor.• The body is sturdy, it also has a nice metal finish• WiFi and Bluetooth works Flawless, no Hardware/Software issues foundCons:• Headphones in the headphone jack give of a weird static like noise like a car radio that intercepts a cell signal, when I navigate.• Device does not charge through the USB port (Data transfer works fine, may explain the alternative charger port)• The device suddenly stopped charging completely (I will explain)Overall:The Latte ICE Tab2 is a great tablet,The specs do not dissappoint, nor does the software.Customer Support was prompt with responding to my issue with the charging issue that currently plagues my tablet. They sent a new charger in good time, and kept their ears open for a result. The unfortunate problem is that the new charger did not fix the problem, however I am confident their Customer Support will fix the issue. It seems more people are popping up with a similar issue with charging, so I may assume the battery board is indeed the culprit.For now I will give four stars.", "Date": "January 6, 2014"}, {"Title": "Turns off  while playing games like angry birds.", "Author": "M. Nosir \"Ms. N\"", "ReviewID": "R6J3DB7TF9HDB", "Overall": "1.0", "Content": "The specs sounded great and so I bought it.  It even looks like a good tablet with the nice metal casing.  However, it turns off randomly and will not restart even if the reset button is pushed.  The only way to get it to turn back on is to plug it in to the charger even though the battery has plenty of charge left and may even be full when this occurs.  I called  Latte tech support and I am still waiting for them to call me back.  I am very disappointed and will be sending this back.  I may get an Ipad mini next time because I don't know if I  can trust another Android tablet.  I don't know what is a good brand to get to avoid the hassle.", "Date": "December 26, 2013"}, {"Title": "Nice design of Latte tablet", "Author": "Steve Choi", "ReviewID": "RB3TOF7XWGOEK", "Overall": "5.0", "Content": "It was very nice and sleek design tablet. The tablet is very user friendly and easy to handle it.i will buy few more Latte tablets, because i like to use gifts for my family and price is very afforable compare to i pad or Galaxy tab.Love it!!", "Date": "November 21, 2013"}, {"Title": "GREAT SMOOTH TABLET !!", "Author": "Marven", "ReviewID": "REKJV0C66ISEG", "Overall": "5.0", "Content": "After several months in researching ,,and delay ,,I finally went ahead and bought this ,,,fast shipping ,,nicely packed,,,screen resolutions is very nice and bright !! easy to used ,,with mico sd card was the plus ,,had to problem breezing through the wifi internet ,,was very surprise how great this tablet was ,,I can say its as good asAsus transfomer 700 ,,after sitting here with my friend who has an asus transfomer 700 ,,he was shocked how bright and fast this was ,,blue tooth was a plus ,,if your looking for a reasonable price tablet ,,I must say this is the ONE !!love it !! Now im just waitin on a case to make it even better !!tkns ALOT !!", "Date": "December 18, 2013"}, {"Title": "Nice looking screen, but bluetooth doesn't work & no support from Lattezone.", "Author": "Positronic", "ReviewID": "R1Y0T4UI5NV8EU", "Overall": "1.0", "Content": "Review is for the 7\" version that I purchased with a couple other 7\" tablets to test out.  I've now bought 3 of the 7\" Latte Ice tablets and paid anywhere from $123 to $135.  Basically the white version looks like an Apple 7\" clone sort of though is inferior to the Apple Mini in hardware specs..  The IPS screen looks great, like a higher end cell phone.  It has all the standard stuff though does lack an HDMI slot.  I compared it to a 7\" Dragon Touch tablet and both brought up and played youtube video's at about the same time though with the IPS screen the video was much sharper and colors more accurate.  The front speaker provides decent sound though none of the tablets have that great of sound that I've heard.Note - I ordered a couple more of the 7\" version since my initial review and the last one I received came with two plastic screen covers and a nice case that doubled as a stand for displaying the tablet on a flat surface.  It must of been a Christmas special cause I didn't specifically order these items but was happy to receive them.  Or maybe they just were rewarding my repeat business :)1/23/14 - I'm unable to get any of 3 different bluetooth mice to connect and work reliably on two different tablets.  Revising to three stars until this is resolved.3/7/14 - Revising to ONE STAR as there is 0 product support.  I requested help with the Bluetooth issue twice through Lattezone and once through here regarding the Bluetooth problem and did not receive so much as an email except the automated email right after I generated a support ticket.  If you buy and have a problem there is no help, do not recommend purchasing from Lattezone.", "Date": "December 8, 2013"}, {"Title": "Very satisfied", "Author": "Mike Park", "ReviewID": "R1K9VOIVFONHNM", "Overall": "5.0", "Content": "Look.  I read some of the bad reviews but decided to still try due to the low price.  I can honestly say this tablet has exceeded my expectations.  I own quite a few china tablets (ramos w30, hyundai T7, etc).  Performance is very snappy and the screen is quite lovely.  The battery life is very impressive (over 8 hours of HD movies) on a single charge.  Some people (reviewers) just ask for too much.  A great tablet for a little over 100 bucks.  I am impressed.  This has become my main tablet now.M", "Date": "April 4, 2014"}, {"Title": "Super-good tablet, but not quite great", "Author": "Jackie L.", "ReviewID": "RTL6HMVUY5MBD", "Overall": "4.0", "Content": "The I-muz Q9 is my first tablet. I've had mine since 01/2014. Comparing \"apples to I-muz,\" this android rocks. Great antutu score, and beautiful display. Some orientation bugs, but this can be somewhat corrected in settings>>accessibility and remove the check mark next to auto-rotate screen. Not a perfect fix, but it helps. You can change it back at any time you wish. I have rooted mine and I love the freedom to change and tweak settings. Something that is hard to accomplish on a \"branded\" tablet. It appears that www.lattezone.com has all but abandoned its customers, which is really disappointing. Some information can be gleaned from www.i-muz.com and www.rock-chips.com. With a minimal amount of effort, you can turn this tablet into a customized fun machine. The physical build seems well thought out. I like the covered ports, although the ports themselves, are a bit flimsy. If you handle them with a modest amount of care, they should last throughout the tablet's useful life. The case and buttons seems sturdy enough. The cameras are not the best in the world, but they suffice. One thing I would like to see more of are accessories for the Q9. For the money, I believe this is a great starter tablet, as well as a good daily user. I hope this helps to ease the minds of those who may be, \"on the fence\" about buying this tablet.", "Date": "March 28, 2014"}, {"Title": "IMuz Q8 : : Beware!!! LatteZone folks DO NOT provide Service or Support!", "Author": "Lastredwitch", "ReviewID": "R14WTUBSGXNYZ1", "Overall": "1.0", "Content": ":: Beware!!! LatteZone folks DO NOT Answer their support phone number! DO NOT follow up or answer their own service 'Ticket System'! DO NOT follow up on their own email! DO NOT have standard or complete Android Builds on their tablet so you cannot use several features or even properly \"Self' support!I spent almost an hour on robo-hold; they never did pickup! I opened 2 \"tickets\" on Latte Support, opened 2 contact emails at iMUZ's web site, even tried calling iMUZ Korea (robo-hold in Korean), sent a email to Latte's @support... Finally an email response from Latte saying they'd dropbox my fix and get back to me. That was three WEEKS ago... STILL NO RESPONSE OR FIX!! -Sent another today -These options are actually DISABLED in build property and jar manifest files; which you can read but not change!. ... also Owners manual shows all the following but they are missing on the tablet!  Display: Missing wireless display controls  Missing HDMI enable, zoom, timeout  Developer options Missing Completely in menus and recovery!  No usb debug, no way to access app data on system partition - So NO WAY TO FULLY BACK UP TABLET IN ANY WAY!USB - PC hardware driver device id damaged corrupt?- No drivers available anywhere for PC PhoenixSuit or other usb ADB  access.- Missing system info:  No serial number, no product name for Google Market update of System apks- No way to mount extSD as directory of built in SDcard because permissions and setups are wrong on built-in SDcard configurationsI've also searched many of the forums for a stock build for this tablet No Luck! I've found several 'close' builds but I'm unwilling to try. I purchased this tablet in good faith - I expect same from Latte!UPDATE: A FEW MINUTES AFTER POSTING THIS REVIEW:  I noticed I received a reply my email sent a few hours ago...Here's the NEW email from Latte:{partial headers}  Date: Thu, 27 Feb 2014 15:15:32 -0600 (CST)  From: Latte Support <support@latteglobal.com>  Reply-To: Latte Support <support@latteglobal.com>  Subject: Re: HELP! Q8 Problems Please Respond!Hello Lxxxxx,We apologize for inconvenience.Here's the link for Q8 Stock ROMdropbox.com/s/hr1lczuvpaxooo7/Q8_US_130923.zip------Best RegardsLatte Communications Inc.Website:  [...]Facebook: [...]+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++I'll update again after I check this out...UPDATE: Latte loaded the .img file in zip!  Problem is they failed to provide a working PhoenixSuit to load it to the tablet! I sent them email requesting the ota version!", "Date": "February 27, 2014"}, {"Title": "HUGE!", "Author": "Troy Kivi", "ReviewID": "R2KCIZ50P7FJF5", "Overall": "5.0", "Content": "Got this as a Christmas present for my mom. She just loves it. Great deal for the price of $199!  Id choose this over then outrageous expensive ipad crap. only problem is they dont have a case for it yet thats under $30. need more options for that.", "Date": "January 11, 2014"}, {"Title": "Best for value", "Author": "Juan Francisco Casal", "ReviewID": "RN7571EQXMAMR", "Overall": "5.0", "Content": "Best tablet for value. Need, as other android, to be tuned for your needs.Had some problems with my email until downloaded outlook and is wrking perfect, syncronized, all good.", "Date": "December 31, 2013"}, {"Title": "Had high hopes but...", "Author": "Amanda N. Grell", "ReviewID": "RCIJOY59VK8NP", "Overall": "1.0", "Content": "We purchased this tablet as an Xmas gift for our 9 year old daughter and had high hopes based on the specs. Initially we were pleased with the screen res, color and overall feel. However, we started having issues right away with certain areas on the screen not responding to touch. It seemed to be the upper right-hand corner that wasn't responsive. Additionally, my daughter opened it and we set it up on Christmas Day. She played with it sporadically for less than a week (leaving it in a newly purchased case) and it stopped working all together. It was fully charged but wouldn't turn on or do anything. Tried hard reset. Tried charging using the USB and wall charger. Nothing worked. Returned to Amazon. Wish this tablet would have worked, because it looked like a great deal.", "Date": "January 7, 2014"}, {"Title": "Tablet", "Author": "Bms", "ReviewID": "R1F6K0BB1DSDTC", "Overall": "5.0", "Content": "So far tablet is working great, I'm waiting for my 32gb san disk memory cardto arrive to make my tablet even better.", "Date": "January 1, 2014"}, {"Title": "Best design and well performed tablet!", "Author": "Sang Bok Lee", "ReviewID": "R30THHH50CM1EN", "Overall": "5.0", "Content": "I choose this tablet based on hardware specs and OS with price. So far this tablet has been showing with good performance on most of apps and task.It has 1GB RAM to perform better than other cheap quad core tablets(most of them had 512MB RAM) also dual cameras is very useful if you compare with others did not have dual cameras.7\" HD screen is good with resolution of 1280x800 and other tablets had a only 1024x768 or 800x600 which makes this tablet perform better than other 7\" quad core tablets.Built-in front speaker makes Big difference, most of tablets has speaker on the back which it is hard to hear on outside but this tablet has front speaker and it is loud and clear.It supports memory expansion with built-in micro SD slot and i am using 32GB mirco sd card without any problems.It can run most of games without any issues and web browsing is fast!I would recommend this tablet to others!", "Date": "December 24, 2013"}, {"Title": "Price Dropped Drastically After New Year", "Author": "Phebe Chew", "ReviewID": "R3LCSBZW3W81X3", "Overall": "2.0", "Content": "Bought this at $259.99 as a Christmas gift for my mother-in-law who was leaving just before Christmas 2013. Come the New Year in 2014, I was surprised that the price dropped significantly to $199.99. Wrote in to ask about this in hope of some kind of courtesy refund but got no response. Highly disappointed that they do not price guarantee even for less than a month!The unit have a trouble recognizing the inserted micro-SD card even when all data was erased by another device. It could not determine this inserted 8GB micro-SD at all, and did not ask to even reformat it! Had to do a complete formatting of the micro-SD card using FAT32 on my PC before it could recognize this external memory card inserted. Still a bit of a problem with this tablet if you should drain the battery of this tablet completely - plugging in the charger and rebooting the tablet will once again fail to recognize the inserted micro-SD. You will have to physically re-insert the m-SD card after the amazingly slow boot for the tablet to recognize it. Kind of a stupid exercise and certainly a unnecessary bug.", "Date": "April 2, 2014"}, {"Title": "Latte 7\" XHD IPS Screen", "Author": "joey eisma", "ReviewID": "R23KOCWICBQM6Q", "Overall": "3.0", "Content": "I recently purchase this item. It was packaged with leather case. The leather case is not perfect fit.The back camera, the speakers, the screen itself is partially covered.  Now those are the minor problem.Because the clearance space between the case and the screen is too small. It's an effort to swipe at the edges of the screen.The camera is really bad, so if you intend to use this for video chatting, this ain't for you. The speaker volume is too low, even at max, it's half the sound from a galaxy tab. also looks like somebody called their 5 year old kid and asked to stick the screen protector on it. it's ugly how they installed it. i had to buy one and install it myself.before i made the purchase, the vendor communicates promptly. after i paid. they don't respond to me anymore.graphics indeed are gorgeous. the metallic body gives it a sense of luxury.will i recommend this item? no. you're better off buying the mainstream brands. you can get the accessories you want.", "Date": "January 29, 2014"}, {"Title": "Maybe I expected too much", "Author": "tsl789yk4", "ReviewID": "R2GDOWDSJVEUYA", "Overall": "3.0", "Content": "These had good reviews. I bought 3 for Christmas presents (12 yr old, 10 yr old, and wife) instead of Kindles because they had cameras and boasted good screen resolution. The resolution is good. Unfortunately the cameras are terrible and all three are prone to glitches. They are usable so I'll give 3 stars but I'll stick with the sure thing next time.", "Date": "January 28, 2014"}, {"Title": "Great Designed Android Tablet finally here.", "Author": "GREAT MOM \"SOFI Y\"", "ReviewID": "R10H8106F2OTQZ", "Overall": "5.0", "Content": "Just received this beautiful tablet. Bought 1 white and 1 black tablets and they just look beautiful. Have been playing with it for 2 hours and so far, no complaints. Will update more within a few days.", "Date": "December 4, 2013"}, {"Title": "Terribly Disappointing", "Author": "WateR~HunteR", "ReviewID": "R3D7RS7UZ3Z68T", "Overall": "1.0", "Content": "I had originally bought the 10.1 Samsung Tab 3. When I saw the specifications of the Latte IMUZ Q9, I exchanged the Samsung one for this one.Honestly, I don't know how this tablet is so bad with such good specs. I feel like I've been lied to, tricked into buying it.First,  to scroll,  you have to do it in a quick back-front manner,  or else it'll send you in the wrong direction. It also doesn't have infinity scrolling. If you don't do purposeful, calculated scrolling, it sends you back to the top or side.When I click something, I have to do it a 2nd time 75% of the time because the screen doesn't respond well even on the most sensitive setting.Also,  it's not holding charge anymore. I disconnected it 30 minutes ago and it already went from 85% to 30%.You have to type very carefully, too,  because the screen isn't very responsible,  especially on the right side of the keyboard.The 5 megapixel camera takes much less impressive pictures than the 3 megapixel camera on the Samsung tablet.Last thing from the top of my head is the display brightness. Even at its brigtest, this tablet is not at all bright.I feel so bad about getting this thing. From the very beginning, not one thing has impressed me and countless things have disappointed me. I wish I'd never switched.", "Date": "December 15, 2013"}, {"Title": "i am just ok with it", "Author": "nikeea79", "ReviewID": "R32H30NWS1HP0C", "Overall": "3.0", "Content": "I'm ok with it I wanted to send it back because the speaker is trash u can barely hear anything thankful to have bought a speaker prepared for this but I'm sure it could have been better even for the price. When I say barely I mean that literally and the video recorder records but playback is in fast speed like fast forward speed playback idk what's up with that and don't know how to fix or change it to make it playback regular speed??? Smh my 8 year old of course wanted to keep it because everything else works fine  I guess and she didn't want to wait the time to send it back wait to get the refund from insurance then wait on the new product AND there's ports on the tablet that didn't come with a plug for them! Should came come with all the cables!!!", "Date": "April 2, 2014"}, {"Title": "Latte ICE tab2 \" real nice", "Author": "Kimberly Boucher", "ReviewID": "R3LDWEFYZ5FZB8", "Overall": "5.0", "Content": "I purchased this for my 22 yr old son, it does everything he needs it to do, email, downloads,docs, photos. social networking. he is musically talented so he has all his downloads and tabs along with it.  and the case I purchased had a keyboard and is leather this little tablet is truly the answer for a take along w/ hdmi and much more  he is very happy with it, and that Makes MOM happyThis also has an expandable memory slot using an SD card.", "Date": "January 16, 2014"}, {"Title": "Latte ICE Tab2 Android 4.2 7\" is an outstanding buy.", "Author": "Richard J. Bunning", "ReviewID": "R3PJ3Z65V7UUNH", "Overall": "5.0", "Content": "The resolution (1280 x 800) is superior to most other tablets out there. Unit is very thin but very well built, using a machined metal back plate. Comes with 2 smudge resistant screen protectors that work extremely well also. Was a slow process getting the little air bubbles out but with some patience and credit card all worked out perfectly. Very impressed with the speed of this unit. I think it is quicker than my Asus Netbook computer. Any and all apps I have loaded from the included Google Play Store have worked flawlessly. All in all I am very impressed with this unit at this price range.", "Date": "December 31, 2013"}, {"Title": "HORRIBLE, INACCURATE SPECS - PLEASE FIX THIS AMAZON!!", "Author": "Paul McDonald", "ReviewID": "R3UBAHTLC2NZI8", "Overall": "1.0", "Content": "A-Series Quad-Core A10-4655M 1.6 GHz? Really? For one thing, this is a LAPTOP CPU, NOT a tablet CPU! For another thing, the 4655M is 2.0 GHz and 2.8 GHz turbo. Cortex A9, like it says at the top of the page? Yeah, probably. AMD A-Series? Absolutely NOT. Please fix your specifications! Thank you.", "Date": "February 7, 2014"}, {"Title": "Do Not Buy Any i-Muz Products", "Author": "Buyer", "ReviewID": "R30N8CNE52QZLM", "Overall": "1.0", "Content": "Never buy any i-Muz products, very unstable, very high defective rate(+10%). Poorly manufactured and assembled. Purchased and tested over 600units and they are garbage, very poor warranty service.", "Date": "January 17, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00FNPEH9M"}}