{"Reviews": [{"Title": "My first Android tablet and I love it", "Author": "ZS38", "ReviewID": "R16M7G7M9T03DL", "Overall": "5.0", "Content": "Gee, I wish I could copy and paste the review I just completed for the vtalASC 10 inch tablet I bought for my wife about a week ago.I just don't feel like typing that review all over again. To make this short all I can say is this was my first tablet bought mainly to see what the fuss was about Android and I wanted two cameras with a sharp display that could read Kindle books and cost less than $150. I have been using it for a few months now and am very pleased with all aspects of it. Bright sharp display, fast respnse , 2 cameras and great technical support with NO waiting and people you can understand. This tablet met everything I wanted, has been a pleasure to use and made my 13 year old granddaughter feel like a genius when I asked her to show me how a tablet worked. To me for the price I paid it is every bit as good as those costing twice as much. I certainly recommend it and it comes with a leather case. I also aquired the vitalASC bluetooth tablet keyboard. It is lightweight,very slim, solid feel to the keys when pressed and connected immediately with the 10 inch tablet built in bluetooth function. In my opinion it is another 5 star item.", "Date": "February 28, 2014"}, {"Title": "great tablet", "Author": "Karen H.", "ReviewID": "R221B80M8HFRJ0", "Overall": "5.0", "Content": "Grandson (age 13) went through two other tablets, different brands, and had nothing but trouble with them, replaced them both while still on warranty.  Decided to try this one, for his third try, both because of its 5 star rating, and its price.  Has had it for over a month now and NO PROBLEMS!!!! Uses it to play games and watch videos, both work well.", "Date": "May 20, 2014"}, {"Title": "I really like it", "Author": "penny dollar", "ReviewID": "RIJU79791AM5P", "Overall": "5.0", "Content": "I was hesitant about the CPU performance, but I took the chance and purchased it and a 10' quad core @ 1.2 GHz tablet from a different seller and believe me this one was far better. I played a somewhat graphically demanding game for two hours, along with  looking at some videos and the battery was still over 80%.I charged this tablet and left it for the entire day and then disconnected the power and it was still fully charged the next day. The quad core died the same day despite a full charge and not using it.There is no glitch, freeze or anything when watching videos, handling 'word' or anything, it just works. I wasn't looking for anything great, just something that delivers and this does it.I will say that the cameras aren't impressive as it isn't smooth nor clear, but for the price I am o.k with it.It also stays cool after hours of operation. I will say that if you plan on playing graphically intensive games (which usually are large), improving the size of the memory is necessary for me.I like it.", "Date": "May 31, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00FMBYMUQ"}}