{"Reviews": [{"Author": "roosteraxe", "ReviewID": "R2EBK1FNJDZ3Z0", "Overall": "2.0", "Content": "This a budget tablet in every sense of the word. The 16 GB internal memory is kind of a lie. Due to very poor programming, that 16 GB is actually partitioned, so the way they set it up, you have 2GB internal memory and 14GB SD memory. This defeats the purpose of having an external card slot for many things. You can't transfer apps to the external card for example. You can download game ROMs, movies, music or any other programs that you can manually access, but you can't set a default path without rooting the tablet. The beefy quad core processor is kind of a joke as well. Whoever programmed and optimized the firmware clearly has no idea what they're doing. I can't run a low powered app while a single update downloads without the system crashing. With that much power under the hood, especially with the 2GB RAM on top of it, there should be no reason I can't download three apps, some songs and a movie while playing my favorite game with no troubles. Instead, I can't do two things at once with a quad-core processor. That means this tablet can't even manage half of what it's supposed to be capable of. Very, very poor optimization. Having a powerful processor and lots of RAM is meaningless if you don't program your machine to use it properly. The main desktop interface is ungodly sluggish, the sytem takes around 5 minutes to boot up all the way, the tablet frequently crashes while performing basic tasks and you can tell everything is in dire need of a massive OS and firmware upgrade.With all that being said, for less than $200 this is a decent tablet if you have the patience to deal with it's many faults. It does run apps very well as long as there's not another active app taking up memory, the battery isn't great, but it does last for 4-8 hours depending what you're doing (longer when not in use),  the wifi isn't amazing, but it gets the job done and the unit is well built and durable. Honestly, if all you can afford is a $200 tablet, this isn't a bad purchase. There's probably better cheap tablets in this price range with weaker processors and less RAM that run better, but if Latte gets off their butts and does an update to optimize and better utilize the hardware, this will be an great machine for the $. As it stands right now, if you have the extra money to spend on a better tablet, I'd say it's worth it. With no word on whether an update will be happening, the potential this tablet has is buried in shoddy, lazy programming.", "Title": "You Get What you Pay for", "Date": "April 23, 2014"}, {"Author": "Ann Berryann", "ReviewID": "R3UZ6GORW6KIXK", "Overall": "5.0", "Content": "I purchased 2 of these tablets for my children who are 9 & 11. They have had 2 other android tablets before these and by far these are the best of all three. The battery life lasts about 4-5 hours while playing games like Minecraft and that's a big deal as far a the boys are concerned. The graphic are amazing for a $100 tablet and the processing is pretty quick too. These are a good alternative to spending the kind of money needed to buy the name brand tablets. These are definitely comparable to the Galaxy tab3's that sell for about $40-50 more. If I had to say one bad thing about these tablets, it would be that we had them a week and the power button on one of them broke.  I contacted amazon and they immediately authorized my return. So, I'm just waiting to get my refund of the purchase price so I can order the same tablet again as a replacement, because I am pretty sure it was a fluke that can happen to any purchase. If I find that it wasn't a fluke I will update my review to let people know.", "Title": "Pretty awesome tablet for the price", "Date": "April 23, 2014"}, {"Author": "Worf", "ReviewID": "RSL1DWYR5OYYV", "Overall": "4.0", "Content": "I am a geek. As in, I make my living that way. I like faster, more powerful, with all the features. This table would not make me very excited.But, I didn't buy it for me. I bought it because my mother-in-law specifically wanted a 7\" tablet with a camera on the back as well as the front. I did take it out of the box and charged it when it arrived, so I did look at some of the basic build, and it seemed fine. I never logged into it, so I can't really speak about the OS, responsiveness, etc.However, my mother-in-law has been using it for about 4 months, and she is still happy with it.I've had a couple of cheap chinese tablets, and been appropriately disappointed. This tablet, while costing a little more, seems to be built much better than what I really expected from it. And since Mom is happy, I'm happy.", "Title": "Not for me, but my mother-in-law likes it - a lot", "Date": "April 21, 2014"}, {"Author": "Gary A. Fechter \"gfechter\"", "ReviewID": "R33VIF1D1SFQUN", "Overall": "5.0", "Content": "The Latte iMuz Q9 Android 4.2 9.7\" XHD IPS screen quad core tablet is the most outstanding tablet I have run across since my Ipad.  It has better resolution than my Ipad Retina display and the processor is much faster.  I put them side to side and my Latte iMuz made 6 Ipad users become surprised believers in all aspects of my iMuz showing up the 6 Ipads that were competing.  This is an incredible tablet with the same display size as the larger Ipad.  I highly recommend the Latte iMuz Q9 Android 4.2 9.7\" XHD IPS screen quad core tablet!!!", "Title": "Latte iMuz Q9 Android", "Date": "April 14, 2014"}, {"Author": "Mark Binkerd", "ReviewID": "R1GWS0V5U8Y89E", "Overall": "5.0", "Content": "Works as expected.  Comes with root access.  The only complaint I have is that the unit does not use the microusb jack for charging.", "Title": "Excellent Value", "Date": "April 10, 2014"}, {"Author": "YBear", "ReviewID": "R3IRHZV2IHUTEL", "Overall": "5.0", "Content": "Arrived fast! Works great! Can't beat this deal for the specs and the price! I've had it for 3 months now never had any issues. Definitely buy this if you want to save some money and not buy the expensive ipad versions. You can buy any cover for this that fits the 10inch iPads. See reviews from PickAFlower to buy covers.", "Title": "Latte iMuz Q9 Android 4.2 9.7\" XHD IPS screen quad core tablet. Dual Cameras, 2GB RAM, Wifi - 16GB, White/Silver", "Date": "March 28, 2014"}, {"Author": "baron fliegen", "ReviewID": "RZ7O02PXZGA5C", "Overall": "5.0", "Content": "Probably the best buy in tablets. Why get an expensive tablet when this is amazing(games,internet,movies) yet so inexpensive. No problems.", "Title": "You'll Warm Up To This ICE", "Date": "February 10, 2014"}, {"Author": "RICKY", "ReviewID": "R19TTRJO6ZR4BW", "Overall": "5.0", "Content": "I love it its great  thank you it works very good I'm thinking of getting another one for my other daughter .Thank you so much", "Title": "Latte iMuz Q9", "Date": "January 16, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00FNPME0Q", "Features": null, "ImgURL": null, "Name": null}}