{"Reviews": [{"Title": "would definitely recommend!!", "Author": "Kari", "ReviewID": "R1F6IER2H44MCJ", "Overall": "5.0", "Content": "Amazing customer service through this company. You would not regret purchasing this great device for your kids. This company strives for customer happiness even months after the sale is final. I would most definitely recommend this device to anyone that is looking for a great deal, followed by a customer service team that actually cares about their products :)", "Date": "December 3, 2013"}, {"Title": "Kid Tablet", "Author": "J.M. Coggins", "ReviewID": "R3UW5O9H18LOVP", "Overall": "5.0", "Content": "This is a great tablet for kids.  My daughter opened it for Christmas and it was ready to go.  It is easy to use and I don't have to worry about pop ups and inappropriate ads popping up.  This is an excellent gift for a child.  She has lots of fun and safe.", "Date": "December 28, 2013"}, {"Title": "Granddaughter's gift", "Author": "Robert Myers", "ReviewID": "R1551WMPBQDDEJ", "Overall": "5.0", "Content": "Purchased with granddaughter in mind.  It was a snap to setup and wifi range is excellent.  The cover color was a fit for a 5 year old girl.  Preloaded apps were adequate", "Date": "January 7, 2014"}, {"Title": "Excellent Customer Service", "Author": "April Jones", "ReviewID": "RII7QCQAQDVMS", "Overall": "5.0", "Content": "I would like to say this tablet is great!!! It has many wonderful features and my 4 year old niece loves this. This tablet is even suitable for an adult. The customer service of the co. is great. They are prompt and courteous.", "Date": "February 11, 2014"}, {"Title": "Very good!", "Author": "V. Myers", "ReviewID": "RTLI5QJZG9QL", "Overall": "5.0", "Content": "Wonderful customer service, quick shipping, quick to answer my concerns. This tablet works very well and is perfect for my 4 year old daughter.", "Date": "January 20, 2014"}, {"Title": "cute", "Author": "jenelle dickerson", "ReviewID": "R30QVV7N5CCJGT", "Overall": "3.0", "Content": "this tablet is very cute and my niece love it, she wont put it down. however, i thought it would have had way more educational games installed but was just d usual angry birds, etc that can be downloaded.", "Date": "January 17, 2014"}, {"Title": "Love it#!", "Author": "Brandi price", "ReviewID": "R3AKXLRRGMFZID", "Overall": "4.0", "Content": "My daughter loves this tablet! She plays with it day amd nignt! I can not get her off of it!", "Date": "January 17, 2014"}, {"Title": "love it", "Author": "rosemarie", "ReviewID": "R2E5TCDWL97A4P", "Overall": "4.0", "Content": "I wish I could get a case for it, I buy a case from amazon but it was the wrong case they send me, I hope I will able to get one soonbecause I'm looking to buy one for my son too", "Date": "January 17, 2014"}, {"Title": "Wolvol tablet", "Author": "vicki johnson", "ReviewID": "R3HRRBEV71OHMJ", "Overall": "5.0", "Content": "Great gift for my granddaughter . She loves it? She has wanted a tablet, this one the perfect gift for a 6 year old", "Date": "January 11, 2014"}, {"Title": "Don't buy", "Author": "James morris", "ReviewID": "R84FI7OLDAC8P", "Overall": "1.0", "Content": "Very slow, and graphics suck. I got this for my 3 year old daughter. She is always play with my wife's, or my phone. Games took forever to load because of being so slow... Once loaded to graphics are so bad you must hold looking strait at your face if not you can see what's on screen.", "Date": "December 23, 2013"}, {"Title": "Not as i expected", "Author": "FRED DAW", "ReviewID": "R1M50JHH0TCQ6T", "Overall": "1.0", "Content": "This table is not as I expected, is very weak, very slow, the first fall broke the screen and had to change even if it is suitable for children and should be stronger. Not recommend it in any sense.", "Date": "June 9, 2014"}, {"Title": "broke too easy", "Author": "Alecia", "ReviewID": "R1S1CR5WTH2M04", "Overall": "1.0", "Content": "My 5 year old broke this and now I can't replace or return it I misplaced the box and info it came with and do not know the model or serial number so the square trade protection I bought for this is useless not happy don't buy this tablet also has no storage my 5 year old couldn't even hold all the apps she wanted don't waste your money!", "Date": "April 22, 2014"}, {"Title": "EXCELLENT tablet for children!!", "Author": "Gus E. Padres \"Computer Extrodinaire\"", "ReviewID": "R1TVI2WK9E3UY7", "Overall": "5.0", "Content": "I purchased this for my 2 1/2 year old niece.  She LOVES it!!  Her Mommy loves it too as she no longer bothers her for her iPad/iPhone.  The WolVol is sturdy and designed to withstand the drops, bangs and tantrums of a kid.The applications are great for young children.  I also love that it can take pictures, which is her favorite thing to do.  I highly recommend this product for younger kids (2 to 6)", "Date": "February 26, 2014"}, {"Title": "Wasted money", "Author": "Nisha Hycie Pixton", "ReviewID": "RC9JU87NGZ30V", "Overall": "1.0", "Content": "We had this for one week before we had to use our warranty to get our money back.  One small drop and the screen cracked and the outside protection came apart.  This is marketed as a child's tablet, but is not very sturdy.  The image is also very poor.  I have seen similarly priced children's tablets with much better quality images and that are better suited for children.", "Date": "January 7, 2014"}, {"Title": "Broken and it was RETURNED", "Author": "Mscandy", "ReviewID": "R1GSO429Y2L7T4", "Overall": "1.0", "Content": "This product came to me looking used and it was static like a tv on a no channel station, it was obviously broken , so I returned it", "Date": "January 7, 2014"}, {"Title": "Product good but screen broke", "Author": "Fadekemi Akinfaderin", "ReviewID": "R27G7VODDXBD6Z", "Overall": "3.0", "Content": "The product was good, my daughter loved it, but the screen has broken just after having it for a week.  This really sucked.  Need to contact the seller to see if there is a warranty.", "Date": "January 3, 2014"}], "ProductInfo": {"Price": "$149.94", "Features": "Android 4.1 Jelly Bean, 7 inch Display, Front and Rear Cameras.\n512mb RAM, 4gb HD, Micro SD Card Slot (up to 32 GB)\nPre-Loaded with kids safety fun games, apps and videos\nPink rubber protection case. Also includes additional pink pouch case\nDownload/View Thousands of Free Exciting Videos, Games and Apps", "Name": "WolVol (Pink) Kids Tablet 7 inch touch screen Android 4.1 with WIFI, Front & Back Camera (Children Special Edition)", "ImgURL": "http://ecx.images-amazon.com/images/I/51MKtp9TKXL._SY300_.jpg", "ProductID": "B00FM8FIYS"}}