{"Reviews": [{"Author": "BigGaryAlan", "ReviewID": "R1N0MK0L4T7Y43", "Overall": "3.0", "Content": "Updated to 8tgb of ram and 256gb of rom sated drive and downloading takes forever and streaming video is very slow even with 8 GB of ram. I don' t recommend.", "Title": "Very slow.....Don't recommend", "Date": "April 11, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2Q1HMLMNDF9VZ", "Overall": "5.0", "Content": "For a long time, I was looking for this ultimate device. I had already tried android tablets, and I was ready to buy the new Nexus 7. However, in my subconsciousness I thought them too limited. I like very much my Android Smartphone (a galaxy S3). It can do many things, quickly, but it's not exactly what I want for a tablet...Meanwhile, I tried Windows 8 pro on my home computer and now I consider this new system as a good transition between the \"tablet system\" and the power of  Windows.As I did not find any Windows 8 pro tablet at a good price, I decided to find a Windows 7 tablet and install Windows 8 pro.To optimize my windpad 110w, I bought some upgrades :Corsair XMS3 8GB (1x8GB) DDR3 1333 MHz (PC3 10666) Laptop Memory (CMSO8GX3M1A1333C9)Crucial m4 256GB mSATA Solid State Drive CT256M4SSD3Windows 8 pro upgradeCompared to other tablets, it's quite easy to upgrade it and install Windows 8 pro, but you have to be meticulous and precise.You will find many information to do these operations in the forum of \"tabletpc review\"You have all the Windows 8 drivers on MSI website.The METRO part of the system is very easy to use. As friendly user as Android. You access to the desktop part through a \"win app\". And then it's the Windows world. You can install all the window softwares you want. I will focus only on Lightroom but I have also installed Office 2010, Adobe acrobat pro 11, photoshop CS6 and even steam for the games.The processor is enough to use Lightroom 5 in good conditions.The windpad needs 20 seconds to start Lightroom and load my library (41110 photos). And then, due to the 256 gb SSD and the 8 mb DDR3, the system is very fluent. I can import my SD Card in Lightroom.It takes 1 minute to import 60 photos (12 megapixels NEF format) and 30 minutes to create the 1:1 previews.It's also possible to sort out and begin the development of the photos. But for that, it's better to have a mouse-pad or a trackball.I really like some functionalities like rotating the tablet. When you have a photo in portrait mode, you can rotate your tablet in order to have a better view.", "Title": "The ultimate device for a photographer", "Date": "February 28, 2014"}], "ProductInfo": {"Price": "$429.99", "ProductID": "B00FZ3FSOA", "Features": "Windows 7 Home Premium 32-bit, 10.0 inches Display\nAMD Z-series Dual-Core Z-01 1.0 GHz\n64 GB Flash Memory, 4 GB RAM Memory\n1.87 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41DtwrnYJcL._SX300_.jpg", "Name": "MSI Computer Corp. WindPad 110W-224US 10.0-Inch 64 GB Tablet"}}