{"Reviews": [{"Author": "DC", "ReviewID": "R3JHIMAFKIBU7H", "Overall": "1.0", "Content": "Ok so I so wanted to love this tablet.  I got a great deal on black Friday after reading so many good reviews and either I got a bad tablet or everyone else has never had a tablet or phone that was somewhat fast.  I really use a tablet for web, email, videos and reading magazines and while this does have a good screen the responsiveness is horrible.  Its a quad core tablet and honestly my original kindle fire that I rooted is more responsive.  I have magazines that are saved on the tablet and every couple pages it has to load and waiting 10 seconds to flip to a new page is ridiculous.  My fire flips though no problem.  It does freeze up at times and then loads again but that is crazy.  The lag it has when touching an app icon is bad.  Web page loading is slightly slower than my s3 which I can live with but the I just cant live with how slow this thing is.  I know I did not get an expensive tablet but a quad core A9 should run faster than my rooted original kindle fire", "Title": "It's slow", "Date": "December 10, 2013"}, {"Author": "matthew mona", "ReviewID": "R2Z4DATC9B8WVV", "Overall": "4.0", "Content": "the thing worked great but it has one flaw that is worth mentioning the charger can be accidently plugged into the ear bud/ headphone port thus frying the charger or the tablet.", "Title": "be careful", "Date": "January 24, 2014"}, {"Author": "Vincenzo Fantino", "ReviewID": "R2YM8EYJP7EQ0G", "Overall": "1.0", "Content": "This tablet was working fine,  but after 2 weeks it doesn't turn on anymore.I am trying to contact tech support with no luck.", "Title": "It doesn't turn on anymore", "Date": "January 4, 2014"}, {"Author": "Justin", "ReviewID": "R1BR9QK6XVD70K", "Overall": "1.0", "Content": "I stayed up all night the night before cyber monday just to get a good deal on this product. My first issue is with the Camera. You literally have to be outside in order for the picture to be good quality... I mean horrible quality. The screen Resolution doesn't seem to be as good as they said in product description. In addition this Tablet has the slowest response time out of any electronic device i used. My first generation smart phone work way faster than this tablet and the tablet is suppose to be a quad core. It loads webpages slow. My Chrome and other apps are not responding and are constantly shutting down.My six-core computer makes this look like a joke. I am very displeased and will be returning it within the next few days most likely. I got one for me and my mother for Christmas and even she doesn't like it..", "Title": "Disappointment", "Date": "December 27, 2013"}, {"Author": "A. Phegley", "ReviewID": "R1MFH3313XUPAG", "Overall": "1.0", "Content": "did not play video well, not what i expected at all. guess thats why is cheap. really a bummer. good luck", "Title": "slow", "Date": "March 14, 2014"}, {"Author": "mike", "ReviewID": "R1O4IPE4UHNCJR", "Overall": "1.0", "Content": "very slow tablet wouldn't buy this tablet for any one had too restart often and it frezzes all the time", "Title": "dont buy this tablet", "Date": "March 5, 2014"}, {"Author": "Andrew Myers", "ReviewID": "R3FN6J1QE5LI0H", "Overall": "1.0", "Content": "Do not buy this, I beg you. It locked up while I was trying to write this review. I would get quicker response using snail mail, and good luck checking your email. I had an awesome tablet but got laid off so when it bricked I had a limited budget, so this looked like a good replacement until I could purchase something of equality. Spend the extra money! You get what you pay for!", "Title": "A piece of crap!", "Date": "March 2, 2014"}, {"Author": "Ely", "ReviewID": "R1NOZ0IN0S5EKC", "Overall": "1.0", "Content": "Bought this on December as a christmas gift. Worked ok i guess, but for a quad core i was expecting a little bit more. It was slow, constant freezes, unresponsive.... Then last night my nephew turn his tablet off, and today the damn thing won't come back. Can't do anything. Won't charge, can't do a hard reset, nothing. I wish i could give this product 0 stars, because 1 star is being too generous.", "Title": "Don't let the specs fool you!! Buy a reputable brand instead.", "Date": "February 20, 2014"}, {"Author": "Danielle Rivera", "ReviewID": "R1KUJ1YBCQPGJ", "Overall": "1.0", "Content": "I really want a refund it's so slow my cell phone is faster than the tablet it freezes all the time it's quite a disappointment", "Title": "so disappointing", "Date": "February 19, 2014"}, {"Author": "christopher lam", "ReviewID": "RH3K0INGJJM7R", "Overall": "5.0", "Content": "I bought 5 of these so far to my store to display the food item menu.  I can't find a better deal than this!", "Title": "Great buy for this decent tablet!", "Date": "November 27, 2013"}, {"Author": "Rony", "ReviewID": "R22F5EKI7DDERN", "Overall": "5.0", "Content": "This tablet is \"fantastic\" is how my daughter described this tablet. It was her Xmas gift. I purchased this tablet for my wife and a black one (my daughters $20 less) because of its specs: quad core, 16GB, 10.1\" and the great price. I also read reviews! We have been using them both since Xmas day and the tablets are \"FANTASTIC\" I'm  glad I bought 2. Great for surfing the web, video, Netflix, email etc... The screen is nice as well as the sound. For the price of an iPad or Samsung tablet I was able to get 2 of these and I'm glad I did. 5 stars for performance at a great price! I recommend this tablet.", "Title": "Hannspree 10.1\"", "Date": "December 28, 2013"}, {"Author": "Carlos E. Rubio", "ReviewID": "R3V27AM6TD4PR", "Overall": "4.0", "Content": "The Hannspree 10.1 table is a good, basic tablet which can be bought at a reasonable price. It comes originally with Jellybean 4.1 installed. I purchased one of these tablets in December of 2013; I was happy with the features and performance until I received the notification that an update to Jellybean 4.2.2 was available. I did the upgrade and at first did not notice any problems, but the following day my auto-rotate and my cameras stopped working. I called customer support and they suggested a reset, but this did not help.Since the tablet was under warranty, I returned it to Hannspree, in California. They sent me a brand new tablet, with 4.2.2 installed. This one had the same issues, so I sent that one back as well. I received another BRAND NEW TABLET with the latest software updates. Six weeks later, the same issues popped up. This latest tabled is now on its way back to Hannspree.After doing research online, the common thread seems to be the 4.2.,2 update. Not only does it affect Hannspree products, but others using the android operating system as well. So, save yourself some headaches. Use and enjoy the tablet, but DO NOT UPGRADE to Jellybean 4.2.2", "Title": "PLEASE READ BEFORE UPDATING TO 4.2.2", "Date": "May 13, 2014"}, {"Author": "Donna Creviston", "ReviewID": "R27F4WC5H4KTBK", "Overall": "1.0", "Content": "I ordered this as a gift for my boyfriend for Christmas. I was so disappointed he opened it & it didn't work. Amazon gave no problem in sending it back but still it put a damper on Christmas.", "Title": "Sucked", "Date": "February 7, 2014"}, {"Author": "Michael", "ReviewID": "R1MTA2C00H664N", "Overall": "1.0", "Content": "Put this money toward another tablet: Apple, Google, Samsung, kindle. Anything but this. Got it as a gift and feel terrible. It's slow, doesn't respond well to touch, shuts off, doesn't turn on. Don't be fooled by the price. By a different tablet for 50-100 dollars more. It will be totally worth it.", "Title": "Don't waste your money.", "Date": "January 26, 2014"}, {"Author": "Roger Bonga", "ReviewID": "RBMIQ3WJCGJRF", "Overall": "4.0", "Content": "Usually I skip over rating products but I wanted to help out on this one.  So far after a month its been working pretty good.  Now I have to say this is my first tablet so only thing I can compare it to is my htc phone.  Only issue so far, and I'm not sure if its the tablet yet, is that the micro sd card I put in it seems to damage.  Not to big to me since it has enough space really so its not needed.", "Title": "Great!", "Date": "January 3, 2014"}, {"Author": "EnjoyLife", "ReviewID": "R2SI84R03JYBP9", "Overall": "5.0", "Content": "Works very well and fits all the needs (check email, surf web, watch video).Great screen size.The white housing looks quite decent along with the metal back cover. Really like it!!", "Title": "Great tablet at good price!", "Date": "December 3, 2013"}, {"Author": "Port", "ReviewID": "R1KT28BDG82JYZ", "Overall": "3.0", "Content": "Start right off with the bad things. Camera not great. (I don't use it for that). The processor is slow but once it is up and running every thing is good.Now for the good.Play games, on the internet, plays netflix great, hooks up to TV, movies and picture quality is good and Blue Tooth works great.If your looking for a cheap tablet this is for you. Now if you want to do office work this is not a tablet for you. I'm sure people that need a tablet for office work aren't trying to compare this tablet to them.I gave this 3 stars because of the slow processor and battery life is just ok about 3 1/2 to 4 hrs watching movies", "Title": "Good for the price", "Date": "January 23, 2014"}, {"Author": "Michael A. Davis", "ReviewID": "R14RNY5MVBOK5C", "Overall": "1.0", "Content": "Seemed a little clumsy, but I'm new to Tablets, so I'll call that a wash. The price was really Right and it seemed to have all the Bells & Whistles. Unfortunately, with very little usage over a 2 week period, (I believe I only charged it 3 times) I layed it down for about a half hour which sent it into a sleep mode it couldn't come back from. Must have been the equivalent of an electronic nightmare. Lol Sent it back. I may have just gotten a bad one as the Haanspree Rep. said, but I wasn't willing to take that chance and have a replacement or a repaired unit go out on me next time outside of the Warranty window. They wanted to keep it for up to 6 weeks and repair it. I opted to send it back. I also own the Haanspree 13.3 which I have had no problems with yet, but I've only used it through 1 charging in 3 weeks. It seems I'm really only on my laptop or smartphone and haven't really found the Tablets niche place in my life. There are some Good reviews for this 10.1, but it just didn't perform for me.", "Title": "Undependable:-(", "Date": "December 30, 2013"}, {"Author": "donnie jim", "ReviewID": "R1YFE092S59CKG", "Overall": "4.0", "Content": "Excellent product. Streams Video nicely at least from Crackle. Works as advertised. Would recommend to anyone. Battery seems to last 5-6 hours.", "Title": "Great price for this quality!", "Date": "December 9, 2013"}, {"Author": "R. dixon", "ReviewID": "RSXMQECA0UOB4", "Overall": "1.0", "Content": "I got this for Christmas and it work fine for 2 weeks then started to get slow and then it started not to even hold a Charge so I am glad I got the Square Trade Fix or Refund $$ back I had it with this tablet for just $80.00 more I can get a Samsung Galaxy 2 .Don't Buy Toll Free Tect Support is a joke.", "Title": "This Tablet Is a Joke", "Date": "May 11, 2014"}, {"Author": "Mark", "ReviewID": "R2N9NHN4RLYO8S", "Overall": "1.0", "Content": "Had to return the tablet. The screen only will light up... it was fried when i received it out the box. Don't buy this tablet", "Title": "Save your time and money.. garbage", "Date": "May 30, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R2ZJUC5TT79K0Z", "Overall": "1.0", "Content": "This is the worst tablet I have ever bought. It shuts down and takes forever to load a website. This tablet has very little memory on it so whatever you are doing may not save. This tablet is junk! I have learned the hard way buying a tablet for only 159.00", "Title": "tablet", "Date": "May 19, 2014"}, {"Author": "chrisp", "ReviewID": "R29DW3NCVANC6E", "Overall": "1.0", "Content": "the device is very difficult and very unimaginative, hard to use and almost opaque.  I would not recomend to anyone other than someone who has got a lot of time and patience.", "Title": "very hard to use", "Date": "May 9, 2014"}, {"Author": "Cindy", "ReviewID": "RGEVJOG6PF28H", "Overall": "2.0", "Content": "I bought the tablet in December to help me study for finals and I loved having such a big screen to work with. Netflix and Hulu played decently but not as well as my S4. Three months later I went to charge it and it didn't want to charge at all with the main charger. Plugging in a micro usb charged it but very slowly. Was great while it lasted but not worth it at all. Invest your money somewhere else.", "Title": "Broke in three months", "Date": "May 7, 2014"}, {"Author": "Toni", "ReviewID": "R22L2MK4Q9I6ER", "Overall": "3.0", "Content": "I bought this thinking I got a great deal,the camera and visual quality is good, so is the battery life. HOWEVER the Wifi drops the signal and has pooor range reception.At home it has to be in the same room as the modem to pick up the wifi signal, please note my laptop and phone picks up the signal anywhere in the house as well as outside. And its gonna take approx. 2 wks at least, to get it fixed....if it can be.....go figure?? Frustrating....everything internet based is affected.", "Title": "Tries your Patience", "Date": "May 7, 2014"}, {"Author": "stretch1a", "ReviewID": "R3FNTMAZ2YDVP8", "Overall": "5.0", "Content": "Hannspree tablet has one drawback, it does not handle multi task very well. Be careful what you download to it. Some apps will kill its response time and ability to \"run\". I had to do a complete refresh after I put swift key on mine, it just about put it into stone tablet mode. I must say, be careful this is an open source os, that means anyone can \"write\" a program for it. There is a lot of junk out there, any many of the sites(Google) do not \"test\" what they have. I do not think you really should expect that anyway. As with anything, just because it worked on tablet A, does not mean it will work on tablet b or c. Every system board has a lot of different chip sets, thus, you never know, unless it has been tested and certified, it may kill your tablet, or os.", "Title": "not bad for the price", "Date": "May 6, 2014"}, {"Author": "Angela Hutson", "ReviewID": "RPDCF2MGHC2E2", "Overall": "1.0", "Content": "When you are playing a game or really anything it takes forever trying to keep up with what you are doing! There is just nothing good I can say about. i bought it to help me out and it has become more of a headache... Wasted money!", "Title": "Ugh! I am really not happy with this tablet!!", "Date": "April 23, 2014"}, {"Author": "hopper", "ReviewID": "RTAMD1R1ZHER7", "Overall": "1.0", "Content": "I have this tablet,stopped working two months after I purchased it.I was very excited to get it, with great hopes.It shut down and will not boot up.I ended up having to buy the kindle fire since this tablet failed me, so save your money and buy a kindle", "Title": "save your money", "Date": "April 22, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R31TU6JI2UWDK2", "Overall": "1.0", "Content": "It is very very slow , took 15 minutes to bring up the kindle app . I got it for my wife as a gift . Ready to dump it and buy she something else", "Title": "Bis mistake went I brought tabled", "Date": "April 18, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3L21D5YE4RLKC", "Overall": "2.0", "Content": "The tablet works reasonably well. It looks great and does everything you are likely to need. However, it is very slow. And, it often freezes for several minutes and then will start working. If you do not mind the slow speed, it works \"OK\".", "Title": "Slow and Freezes Often", "Date": "April 17, 2014"}, {"Author": "My 2 Cents", "ReviewID": "R33L0IEK49TOC4", "Overall": "4.0", "Content": "I go this tablet for Christmas from my husband. It has a very nice solid high quality feel to it. It's a great size. I really do not use it very often for anything serious, just for listening to music or looking up quick recipes while I'm cooking, and sometimes I play some car racing games on it. I think the speakers sound great. For me, it has done a great job at these things. It has a video recorder and it takes nice videos. My only issue with it is that it is a bit slow. I won't watch movies or netflix on it because it just can't keep up well. If you are looking for a nice sized tablet that is mostly just for goofing around with I think this is a very nice tablet. I have never has a tablet before this one, so I can't compare it to anything, but overall I am happy with it.", "Title": "Hannspree Tablet", "Date": "April 16, 2014"}, {"Author": "Norberto", "ReviewID": "R2R8U8H4G4KX1R", "Overall": "4.0", "Content": "Nice tablet...the color that I was looking to get ..I had to get something to look as close to Samsung Galaxy for my youngest dauther and this fulfill my expectations", "Title": "Good!!!", "Date": "April 7, 2014"}, {"Author": "Donna Kelley", "ReviewID": "R1OY0LERY9SSNF", "Overall": "1.0", "Content": "I am so disappointed. This thing is literally on my shelf. It's so slow that it's useless. It's also heavier than I anticipated.", "Title": "Unusably slow", "Date": "April 4, 2014"}, {"Author": "angie", "ReviewID": "R747U945WC4BO", "Overall": "5.0", "Content": "Great tablet for the money.Dose what it states. If you want better, pay more for a $300 to $600 tablet.", "Title": "GREAT BUY", "Date": "April 1, 2014"}, {"Author": "Robert", "ReviewID": "R1YAWEZNTTFR67", "Overall": "2.0", "Content": "It is very slow for a Quad Core! My Samsung Galaxy cell phone is faster. I have tried turning things off and dimmed the screen. No luck.", "Title": "Disappointed!", "Date": "March 30, 2014"}, {"Author": "Norma Jean De Santi", "ReviewID": "R3TLAF4OQYXPCE", "Overall": "2.0", "Content": "The more I use this tablet, the more I become disenchanted with it.  Touch response on icons, web select buttons and other screen entities is logy.  A graphical game I run on my HTC 1 M7 with no problem is jittery and jerky on the tablet.  I'm not seeing performance on par with even a single-core iPad 1.  I've already removed most apps from it that I don't use or can't use due to the poor responsiveness.  Pandora took 3 minutes to just load to the menu screen.  Hannspree makes a decent display....but I'm not seeing similar capability in this tablet.", "Title": "Not a mature product", "Date": "March 27, 2014"}, {"Author": "Konstantyn", "ReviewID": "R3ESLIWJD1WMQ6", "Overall": "1.0", "Content": "I bought the tablet in Wallmart. After 3 months both cameras not working, autorotation not working, customer support not answering. Think raise before buying this \" product\".", "Title": "bad experience", "Date": "March 24, 2014"}, {"Author": "Sebastian Alvarez", "ReviewID": "R1C6O6L5BEEJJX", "Overall": "1.0", "Content": "Im very dissapointed, this was my first tablet and it runs slower than my old samsun galaxy ace (single core). Everything lags on it!!  And heat lots. The battery used to run like half an hour (on games/facebook).After a week, I didnt used it for 2 days, then the battery was completely death, it didnt charge again and also couldnt be turned on at all.", "Title": "Very slow and bad battery", "Date": "March 23, 2014"}, {"Author": "Valerie217", "ReviewID": "R21RYZFE0O6UMS", "Overall": "4.0", "Content": "This is okay.It doesn't have that much memory.  The speed is okay.  I use it to play games on Facebook.  The screen size is great.", "Title": "Okay", "Date": "March 20, 2014"}, {"Author": "travis", "ReviewID": "RH1ZZWCTLV3VM", "Overall": "3.0", "Content": "Good cheaper tablet for kids to start to see if like. The buttons are easy to break and the batteries won't hold charge.", "Title": "Decent for kids", "Date": "March 19, 2014"}, {"Author": "J. Brand", "ReviewID": "R1GYMTZ6MQWNUG", "Overall": "1.0", "Content": "This thing is well build, solid, and with good features - BUT - THIS IS THE SLOWEST TABLET I HAVE EVER USED.It constantly freezes while waiting for apps to load, you press an app and 10 seconds later it opens. Even swiping between home screens is stutters. And don't even think of multi-tasking with this thing. I have a $49 tablet that runs better that this paperweight. Run away from this tablet as fast as you can.", "Title": "DO NOT BUY", "Date": "March 18, 2014"}, {"Author": "F150", "ReviewID": "R2NDUOK1812CQA", "Overall": "1.0", "Content": "Its slow, constantly freezing up, I don't know if I have a defective one but its not running correctly.It does have very nice loud speakers on it.", "Title": "Buggy", "Date": "March 18, 2014"}, {"Author": "Matthew", "ReviewID": "R1S6Z8CF7PN79M", "Overall": "1.0", "Content": "This tablet seems like an exceptional deal and at first I thought it was after I received it.  But I've had it for 3 months and can say with 100% certainty, you will wish you never bought it after a few weeks.  Performs EXTREMELY slow for it's processor specifications!  Supposedly it is a Quad Core, ARM Cortex-A9, 1.2 GHz processor...Impossible!  My 1st generation Kindle Fire does circles around it and MUCH more reliable too!Usable internal memory space is 1 GB.  Even though there is a micro SD card slot available (which I use a SanDisk Ultra 32GB micro SDHC card with transfer speeds up to 30MB/s in it) I find it runs at only somewhat normal speed 25% of the time IF I keep internal memory consumption under 500 MB of 1 GB total.  The other 75% of the time it's hung up doing who knows what!  500MB worth of apps does not get you very much, even if you put what you can onto the micro SD card.Like I said, you get what you pay for.  Your better off spending a little more for a 7\" screen tablet from Samsung or some other reliable brand.  Learn from my mistake please!", "Title": "Not recommended.  You get what you pay for.", "Date": "March 16, 2014"}, {"Author": "Miguel Perez", "ReviewID": "R3MGEK3IIXU7MB", "Overall": "5.0", "Content": "Excellent product, fast, easy to use, auto firmware update is a great feature and it works, all google play apss download and function.", "Title": "Great product", "Date": "March 14, 2014"}, {"Author": "Glenn Jeffers", "ReviewID": "R17OH9XI7U25YI", "Overall": "4.0", "Content": "Bought for my elderly mom.  Having never had a tablet, it was easy for her to use.  She loves it.My only con on this would be the power and earphone plugs are very close together and same size.  I had to recharge it for her twice because she had been plugging the power into the earphone port.  No damage was done but color coded it with a marker so she could easily identify the charging port.", "Title": "Great for the novice", "Date": "March 14, 2014"}, {"Author": "Kathryn Pendleton", "ReviewID": "R2O1EWGJ4UJ083", "Overall": "4.0", "Content": "Nice size, great price, seems to do everything we wanted it to do for such a great price....down loads work great", "Title": "Nice size", "Date": "March 7, 2014"}, {"Author": "Dustyace", "ReviewID": "R2OTLAWI044H3", "Overall": "5.0", "Content": "Love the size of the screen and it is fast. I have had no problems with it and do everything on it. It is as it was discribed and I would recommed it to anyone wanting a tablet at low cost.", "Title": "Great speed and size", "Date": "March 6, 2014"}, {"Author": "Scott Teague", "ReviewID": "RGLJ9WJZL0RT7", "Overall": "1.0", "Content": "Great price. Quad core processor. Sturdily built. Sounds good doesn't it? I didn't know if bought a bad one, but after reading the reviews, don't do it!  Locks up all the time. Apps are jerky. Especially games. I reset to factory thinking the apps were slowing it down. Still slow.  Bottom line...It's an impressive build, but doesn't hold up to the advertising. It's too bad, it could have been a contender to the IPad.", "Title": "Not worth it", "Date": "March 5, 2014"}, {"Author": "afgunny", "ReviewID": "R21EDAMO60QH6K", "Overall": "5.0", "Content": "I use this tablet for programming when I'm on the go and it works great. I mated it with a blue tooth keyboard with no problem and it syncs with wi-fi flawlessly.", "Title": "Great Tablet", "Date": "March 3, 2014"}, {"Author": "Barry O. Peterson", "ReviewID": "R4XDWGBTUQMYF", "Overall": "5.0", "Content": "The grandchild this item is for is enjoying playing but uses it for homework. This makes him and his parents happy.", "Title": "Pleasing a grandchild", "Date": "March 1, 2014"}, {"Author": "Marvona \"Marvona\"", "ReviewID": "R3QIFBDCKELIVT", "Overall": "5.0", "Content": "This is my first tablet and I love it. It works great and have even bought my son one.  He is ten and has a kindle fire but he wanted one of these tablets so with the low price why not? I still have my laptop but with this tablet I hardly ever use it. Can't go wrong with The Hanspree 10.1 Quad Core Tablet!!!!", "Title": "Can't beat it!", "Date": "January 25, 2014"}, {"Author": "oso", "ReviewID": "R2CISVG545AXTF", "Overall": "5.0", "Content": "I would recommended to anyone that is looking for  a tablet its official and is as compitable to apple ipad. Works great...", "Title": "awsome", "Date": "January 22, 2014"}, {"Author": "Nancy", "ReviewID": "R271G4H3OHPFY2", "Overall": "4.0", "Content": "I bought myself one for Christmas and so far it works very well...Does not seem to be too slow and the games and facebook load in no time...I'm thinking of updating my 3 grandchildrens with these..", "Title": "Nancy", "Date": "January 20, 2014"}, {"Author": "cindy hall", "ReviewID": "R2TSJ5XKWB4W3B", "Overall": "5.0", "Content": "I am completely happy with this tablet. For the money, great tablet! this is my first tablet, so I have nothing to compare it with. I mostly wanted it for internet access from my couch or backyard & have it!  Easy to set up, this is also my first android product & having no trouble using that either. I DO recommend this tablet to others. Buying from Amazon: Excellent experience!!!!!  Happy Happy Happy", "Title": "completely happy with this tablet", "Date": "January 20, 2014"}, {"Author": "Diana Everett", "ReviewID": "R38NZRT4ONL9GG", "Overall": "1.0", "Content": "I bought this for a Christmas and he used it a couple of days, he turned it off one night and now it won't come back on. I emailed the company and have not heard from them. I will never bay anything else that has Hannspree name to it!", "Title": "Hannspree", "Date": "January 19, 2014"}, {"Author": "Tampa Reviewer", "ReviewID": "RD2XNNVGA841Z", "Overall": "3.0", "Content": "Everything about this product looks and feels good.It is very slow to load things and the battery life is not great.It was bought to provide a tool to look up questions while watching TV and it is a passable inexpensive tablet.", "Title": "Slow Tablet", "Date": "January 19, 2014"}, {"Author": "Hiker 75", "ReviewID": "R35X21MNPVN507", "Overall": "2.0", "Content": "Bought this on Black Monday from Walmart. Also bought Walmarts 2 year breakage and spill coverage. After a month unit would not turn on. Called the Hannspree warranty number and after a long wait time talked to a tech who knew virtually nothing. He said they would send me an email to put in a service claim. After completing a long form and sending the email back it kept coming back stating address does not exist.  I called again and after a long wait got another rep who said he couldn't help me. When I asked for a supervisor he hung up. Luckily, I called Walmart service who were very good and refunded my money. Don't buy this product.", "Title": "Poor Performance and Awful Service from Hanspree", "Date": "January 18, 2014"}, {"Author": "Julie", "ReviewID": "R1Y6CI41DJ8NBW", "Overall": "2.0", "Content": "I ordered this item for my Grandchildren, but found that it was hard to turn on and was extremely slow and the battery did not last overnight, even with the tablet off.  I tried to download several of the free games, but it was just too slow.  I don't remember the name of the game, but it continually froze and I would have to restart the tablet.  I purchased the Kindle Fire HD instead and it has been so much better.", "Title": "Too Slow", "Date": "January 18, 2014"}, {"Author": "Bill Bradley", "ReviewID": "R3GMTD35WY9E2M", "Overall": "1.0", "Content": "I bought this as a gift.  The tablet worked for less than a month.  After several calls to support, and jumping through all the hoops, I was given a reference number and told I would get an email in 48 hours with instructions for returning for repair or replacement.  Five days later and no email.  Customer support number is now ringing to on hold music and after several minutes disconnecting.  I'm returning via Amazon and replacing it with a brand name tablet.  Save yourself the trouble and don't go cheap.  A Samsung may be double the price, but worth it in the long run.", "Title": "Poor product.  Worse Support", "Date": "January 16, 2014"}, {"Author": "Steve in West Seattle", "ReviewID": "R1H5RZPV6XO2A6", "Overall": "1.0", "Content": "I got this for my wife for Christmas after reading some of the reviews up to that point.  It lasted exactly 2 weeks, then totally died.  Nothing.  Dim gray light when plugged into the charger but otherwise gone.  Luckily I was able to get my money back, but here's my thoughts on it.Basically this is a first-year model for Hannspree.  When it worked, it was great!  Just like a first-year model of a car, you usually wait for all the bugs to be shaken out.  The same is true for this tablet.  I would consider purchasing it again in about 8-12 months, assuming Hannspree gets it fixed.For now, avoid this model or make sure you have a good return policy in place!", "Title": "Totally dead after two weeks", "Date": "January 16, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3JK2IGZ0VV9Z3", "Overall": "3.0", "Content": "I read all the reviews prior to purchasing this tablet so I knew what I was getting in to. It is slow and has some issues freezing up.  There are also some display issues that are strange, some text and graphics won't display on apps. It's want you would expect for $130 tablet. My wife's Kindle Fire HD out-performs it hands down.It takes forever to charge and the battery only lasts about 12 hours even if it's in standby / sleep mode. I will leave it fully charged with the display off at 8am and by 6pm it's almost dead.  The display wasn't on at all during that time and I have it set to disconnect the wireless connection so it isn't receiving data during that time.I bought this as a starter tablet and it serves that purpose, not much more. I will be upgrading to a name brand tablet soon.Another thing to consider is it's almost impossible to find accessories that work for this tablet.  I'm on my 4th case this month. If I had it to do over again I would spend the extra $100+ and buy the ASUS MeMO Pad FHD 10 ME302C-A1-BL 10.1-Inch 16GB Tablet.  That's what I plan on upgrading to.", "Title": "You get what you pay for, not a lot", "Date": "January 14, 2014"}, {"Author": "Rob Mordah", "ReviewID": "REDVB1DUP8T9Y", "Overall": "1.0", "Content": "Worked great for about a week, then tried using it and it would not come on. Seemed like a very nice tablet while it did work.", "Title": "Lemon", "Date": "January 13, 2014"}, {"Author": "D. M. Porchiran \"zsfav\"", "ReviewID": "R2WJPGY6VQS2RT", "Overall": "3.0", "Content": "This unit cannot run multiple applications well and is not a good choice for streaming video.  This unit is being used for one function only and it perfectly suited for it.  If you are looking for a multi-purpose tablet, I would not consider this, but if only using for a reading device, it works just fine.", "Title": "Works as ordered", "Date": "January 13, 2014"}, {"Author": "george brandt", "ReviewID": "R1GAI6CURNZA08", "Overall": "4.0", "Content": "Bought this for the kids to play with, loads pretty fast and works much better than their previous tablets. Nice tablet for the price.", "Title": "Works great for the price!", "Date": "January 11, 2014"}, {"Author": "Five", "ReviewID": "R10O094Y6R4GFX", "Overall": "3.0", "Content": "I bought 2 of these. 1 for my wife's parents who are close to 80 and they love it. Playing the little games and what so. Bought the second 1 for my 9 year old who can get frustrated with it at times. Sometimes when you click on an app it will try to load and load and nothing happens. The fix turn the tablet off then back on and it works fine. Screen is a little bit laggy not to bad. This tablet is not for the tech savvy. You will be unhappy after a few weeks. Great for beginners. If this is what you can afford be patient with it and all will be fine. Good for a first time tablet.", "Title": "It's soso", "Date": "January 9, 2014"}, {"Author": "kf_93", "ReviewID": "R1L656E4YE18H", "Overall": "5.0", "Content": "It has met and exceeded my expectations. My son has not put it down since Christmas bandit has not had any problems.", "Title": "Awesome Tablet for the money.", "Date": "January 8, 2014"}, {"Author": "Marsha", "ReviewID": "RZTWVYBGSBU7P", "Overall": "3.0", "Content": "I got two one worked and the other one will not turn on after a few uses.  The one that workes I love.  It is fast and does everything I want it to do and more", "Title": "I love the one that worked", "Date": "January 5, 2014"}, {"Author": "Ricksta", "ReviewID": "R2XFSRF53SAQEP", "Overall": "3.0", "Content": "This was really nice and my wife loved it, but it soon died.  Not sure what may have been running in the background or what exactly killed the tablet, but after trying to charge it and restart the tablet we got no response.  Called Hannspree and they said to send it back to Amazon.  Waiting on UPS to pick up the tablet now.  I would really like to know what happened to the tablet and why it died.", "Title": "Worked, but...", "Date": "January 5, 2014"}, {"Author": "buyboy", "ReviewID": "R24L71XKIU2P3", "Overall": "2.0", "Content": "Needs a lot of work bootloop after 2 days. Lag and a lot of lock ups. would have been nice if it functioned.", "Title": "Hannspree 10.1-Inch Quad Core Tablet Pc", "Date": "January 4, 2014"}, {"Author": "Mr. Mustang", "ReviewID": "R16JXBDZ1DCIHQ", "Overall": "1.0", "Content": "I enjoyed this tablet until it did not work.  After about 3 weeks it started freezing and then about 4 weeks in it died...........  If you are lucky enough to get a unit that doesn't start giving problems you would probably really enjoy it.  Amazon refunded my money and I will be purchasing an established name brand product.  I really appreciate Amazon!!!", "Title": "GREAT Concept", "Date": "January 4, 2014"}, {"Author": "Brandon Kanowitz", "ReviewID": "R30K6T91MS9YMH", "Overall": "1.0", "Content": "This is probably one of the worst electronic products that I have ever come across. I went by other reviews on this website and that's why I purchased this item.  It is one of the slowest tablets that I have ever used.  It freezes up constantly, if you look at the screen at a certain item you can see a the touch screen grid which makes the product look cheap.  The power buttons and volume buttons feel cheap, the screen resolution looks a lot worse than it is actually rated for.  Overall, this product is horrible!!.  Stay away and do not by.  You all have been warned.  I will be returning this product to amazon since it does not me my needs.  If you want a tablet that takes 5 minutes to load a website, than this tablet is for you.  If you want a tablet that takes 10 minutes to switch between apps, than this tablet is definitely for you.  Hanspree needs to rethink how they manufacture products because they will not survive making terrible products.", "Title": "One of the worst tablet ever!", "Date": "December 8, 2013"}, {"Author": "Lourdes I. Vargas", "ReviewID": "R11MTYMAL39IZP", "Overall": "4.0", "Content": "I bought this table for my mom, a lovely lady that has no clue of what a table was or had very little knowledge about new technology. I spent a few days with the tablet to make sure I had made the right purchase.  The tablet has a very slim look and very easy to use for first time users, easy access to applications, and expandable memory with an sd card.  This off brand table turned out to be a great purchase, the only complaint I will have only because I love taking photos.  The camera/video, the quality of the photos its poor, there is no flash on the camera (it does have dual camera which is a plus - )  you can actually use Skype to have a video call.  However the video its a bit slow.Other than that, the tablet serve its purpose and I'm very happy with the product.", "Title": "Good Procduct", "Date": "December 9, 2013"}, {"Author": "D. J. WOOD", "ReviewID": "R1U2ZX0H6IBMY3", "Overall": "5.0", "Content": "Very affordable and works great. I higly recommend this item. Order a Mini-hdmi cable to connect this tablet to your flat screen tv.", "Title": "great for the Price", "Date": "January 29, 2014"}, {"Author": "J. Elizabeth Casey", "ReviewID": "R2PRR4GHRSEW92", "Overall": "5.0", "Content": "These tablets are great. My teenage daughters were impressed. Great buy for the price as compared to others that are smaller.", "Title": "Excellent", "Date": "January 21, 2014"}, {"Author": "PittsburghBookReader \"PittsburghBookReader\"", "ReviewID": "R3HFABO72ZC3NZ", "Overall": "4.0", "Content": "On the plus side, very clear graphics. Purchased for my 84 year old mom who has visual issues.  Now, I have the text too large and can't get it smaller.  Lots of glare as well and it seems to time out.  I'm not savvy enough to figure this out, and wish I had access to technical support.  If I were to do it again, I would go with the B & N Nook, and she could consult them in person with issues.  So, not sure.  For the money if it was for me, I'd be very happy with it.  For myself, I prefer smaller tablets, although I just use my PC and like that best.  Sorry I can't give you a better review.", "Title": "Not Sure", "Date": "January 5, 2014"}, {"Author": "jordan p", "ReviewID": "RY74Q0XM84LQM", "Overall": "3.0", "Content": "I ordered it about a month ago and I like the memory space and the speed, but my only problem is the tilt sensor is slow and it doesn't work good so some games are hard to play. I might have to return it but it may have just been a defect but otherwise the product is good. I had gotten it when it was 129.99 so I'd wait till the price goes back down.", "Title": "Decent tablet for the price", "Date": "January 3, 2014"}, {"Author": "J. Black", "ReviewID": "R1Y30ZI718SM4M", "Overall": "5.0", "Content": "This device has nice dimensions and weight. The case and buttons have a solid feel. The display is great. The processor is quick, allowing many apps to open and remain open from one session to the next without issue. Blue tooth and cameras on front and back are important features, very welcome at this price point. forget the sub $100, 7 inch tabs. This is the best entry level you can get that will do everything you want! The features and construction give the $300+ models a run for the money. You won't regret this purchase.", "Title": "Seems solid so far.", "Date": "January 3, 2014"}, {"Author": "F. Owings", "ReviewID": "R1229Q4YAPPRJJ", "Overall": "4.0", "Content": "Hi, this is my first tablet and it meets my video needs thumbs up.Bluetooth pairing flawless(great sound) with out speakers fair sound loud.Screen viewing better then all my laptops(great pic even without hd you need 20mbps I have 13 ) HDMI you have to hook your cable when in off position.Customer service fast called to download a manual answer in about 5 mins..Google talk to find works great just have to use instead of typing.Quality built metal back usb charges with 2 amp battery bank(18650) so far so good brought squaretrade warranty for 3 year just in case.Hats off to Hannspree for great engineering for a low price and amazon for selling it to us costumers.I gave 4 stars because no product is perfect.", "Title": "Great tablet ! great price!", "Date": "December 28, 2013"}, {"Author": "Ronald L. Pinkham", "ReviewID": "R2OZNOIH6S7D5X", "Overall": "5.0", "Content": "Screen looks great. Loads fast. Easy to setup and use. Great tablet for the price. You can get thousands of apps. Sounds good to. Has HDMI so you can hook it up to your TV.", "Title": "Great so far does what I need it to.", "Date": "December 11, 2013"}, {"Author": "Jeremy", "ReviewID": "R9VFSFIEYD8LI", "Overall": "2.0", "Content": "I bought this tablet from Walmart and am not at all satisfied with it. Even for the cheap price it's not worth it. First the screen clarity is not good. Viewing angles are not what you would expect from IPS technology. Also the performance is very slow for quad core. Response times are laggy. I also have a Galaxy Tab 3 and a G-Tab Quantum. Both the Galaxy Tab and Quantum have MUCH better screen than this one and blow this thing away in perforamance. I recommend spending just a little more for the G-Tab or if you have deep wallets you can go for the Galaxy Tab, but between those two there's not much difference. This is definitely a budget tablet and only recommended for people who just can't afford anything better.", "Title": "Cheaply built and doesnt live up to its specs", "Date": "December 6, 2013"}, {"Author": "spoke69", "ReviewID": "R1UJ2GIV70V2OC", "Overall": "1.0", "Content": "Had it for three weeks , an I thought it was great ! Boy was I wrong ! Cust. Service STINKS ! Your lucky if you get someone you can understand , had to send it back would not power up !", "Title": "Don't Do It !", "Date": "December 31, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R780DUWOUJ1PG", "Overall": "5.0", "Content": "Great tablet, the perforcemance is very good. I am very satisfy, it works just like my nexus 7. The screen clarity is very good. Great tablet for a Christmas gift. I like it.", "Title": "I like it", "Date": "December 8, 2013"}, {"Author": "Gary A Smith", "ReviewID": "R1972Z54FL09O2", "Overall": "3.0", "Content": "ok, this unit can handle Netflix very good. Only problem I get is this unit can't handle multi-tasking. Updates will slow you down abit.  Regarding the power supply I have learned to use one with a micro-usb connector. Its much durable. For the money this unit is good. Wishes hanspree would have included a printed instruction manual.", "Title": "Good tablet for the money", "Date": "April 18, 2014"}, {"Author": "kris. ess", "ReviewID": "RGJ1FKOAXCKBN", "Overall": "5.0", "Content": "Gr8 product. European. Not cheap Chinese junk. The reviews I read b4 i decided to purchase were approx 50/50. Good enough 4 me. Most ppl who purchase something for the first time are totally clueless about it.At this price, this device outperforms every comparable android. It is solid, strong and loaded with features. They must have cut corners somewhere but I haven't found anything yet. I would recommend it to anyone working on a budget.", "Title": "wish it came in black or gray.", "Date": "February 17, 2014"}, {"Author": "brian boland", "ReviewID": "R3NSM2QW6GBRRB", "Overall": "5.0", "Content": "Great product!!!reAwesome product. Works better than expected and has the highest quality. Bet quality and product features money can buy.", "Title": "Great product!!!re  Awesome product. Works better than expected and has the highest quality. Bet quality and product features", "Date": "February 7, 2014"}, {"Author": "Christopher", "ReviewID": "R2VMVZ209RRHIC", "Overall": "5.0", "Content": "I bought this tablet as a Christmas gift for my mother and it has worked out wonderfully! The screen is great...the connectivity is top-of-the-line....and it's a great bargain for what you pay...If you need something for basic stuff, this is what you should purchase!", "Title": "Well worth the money....", "Date": "February 6, 2014"}, {"Author": "Thomas Lowe", "ReviewID": "RHRMNC0TQUQTY", "Overall": "5.0", "Content": "Both kids use these all the time and we have not had any problems. You will not find a better tablet for this price any where trust me... we have went through our fair share of tablets.", "Title": "Bought two", "Date": "February 5, 2014"}, {"Author": "Larry A. Magnello \"larry\"", "ReviewID": "RYLYERRJAFZ95", "Overall": "5.0", "Content": "this is a great product, but you can't load as many apps as with other tablets, that is the problem and no workaroundfor quad core, it runs very slow, but you can watch movies on it.the  DURAGADGET Black Leather Look Case will work perfect with it.The NOOK HD+ with the N2A sdram chip with its own android system on it will boot up on the HD NOOK + and run over7 apps on it, because I am doing it. and it is faster than the Hannspree tablet", "Title": "Hannspree 10.1-Inch Quad Core Tablet Pc T7 Series With Ips 1280X800", "Date": "February 4, 2014"}, {"Author": "Lisa Mendoza", "ReviewID": "R3PTZ8SQNRIG42", "Overall": "5.0", "Content": "Thrilled with my purchase! Love the product! It is a super packed mini comp for social internetting and networking. It does stop responding once in a while, but is usually because I was not patient. It may not be equal to a desktop but is definatley worth the money.", "Title": "Very Satisfied!", "Date": "January 3, 2014"}, {"Author": "Paul Worgan", "ReviewID": "RCK9QGA5YBAF1", "Overall": "5.0", "Content": "I had read the reviews before purchasing this product and read some negative feedback. (Not many but some) I have used mine for over a month now and it functions perfectly as expected. Can’t speak for the others or the few that had problems but I would recommend this product to any of my friends. I am very happy with it. :)", "Title": "Great product for the price.", "Date": "January 3, 2014"}, {"Author": "Rusty the dog", "ReviewID": "R3D3KT62EP68WI", "Overall": "5.0", "Content": "Move over Apple and Microsoft, because the Android is almost perfected. Great tablet for research. I use King soft spreadsheets, so this tablet is great for its price. The problem with the Android tablets before is they pout the system on a bad or broken hardware, but Hannspree is a good solid reliable and fast quality.", "Title": "Great tablet", "Date": "December 14, 2013"}, {"Author": "Steve", "ReviewID": "R1IYITOSJ6YFYG", "Overall": "4.0", "Content": "It's a great tablet for the money, I like it. I would have given it a 5 star but it's not perfect there's still somethings the company could work out but overall it's a great tablet for the price....", "Title": "Good for the money....", "Date": "December 31, 2013"}, {"Author": "Humberto", "ReviewID": "R36ON7ZVIR6008", "Overall": "4.0", "Content": "Amazing Price and a great product.  so far i am very happy with the speed and versitilaty of the product", "Title": "Great Tablet", "Date": "January 3, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00FE5VDSO", "Features": null, "ImgURL": null, "Name": null}}