{"Reviews": [{"Author": "Andrea Hill", "ReviewID": "RWF04KY0F3A7D", "Overall": "5.0", "Content": "I am very impressed with this tablet. I was actually surprised by it's size as I wasn't expecting it to be as big as it is. The graphics are awesome, video playback is incredible, the sound is good enough, and battery life is impressive. I have installed several apps from the play store and as of yet have no experienced any lag on the device. Quite an awesome tablet for an awesome price of $99!!!", "Title": "Awesome so far!", "Date": "November 4, 2013"}, {"Author": "TomO.", "ReviewID": "R790WPYDUM779", "Overall": "3.0", "Content": "This was intended as a gift for a fairly tech savvy person, for personal and business use. The more I read of the specs and reviews, I came to realize this version of the A1000 is behind the curve. I wound up returning it even at AMAZON's lowest pre-Christmas price.First, the AMAZON writeup states no less than 3 times this tablet has a 1.2GHz dual core chip. Other reviews and the box itself state that a slower 1GHz chip is used. Benchmark tests indicate it clocks in at an even slower 800mHz. By comparison, that's about what older Android phones can do.Next, .5GB of RAM is 2012 technology and its not even the faster DDR3 standard. Many under-$100 tablets have 1GB RAM.I've seen the A1000L and these specs contribute to some of the slower response and video issues it has.Also, this A1000L version lacks:-Bluetooth- useable camera- GPS- Dolby speakers like the A1000 (only thru headphones)- HDMIAre there nice features for the price? Yes, namely- Lenovo name, support, forums- long battery life and reliable charging- good sound- little bloatware loaded with Jelly Bean- expansion card slotFor kids and older children, those newer to Android tablets, a solid choice that should be current enough for a year or two. The redesigned A1000 with 1 GB RAM, 1.2GHz chip and 16GB (not offered here) would be better for business and heavier duty personal use, but still falls short of tech specs for Samsung, Hisense, ASUS, Acer, Nexus coming in at $130-170. And the CES is just around the corner...", "Title": "Lenovo Tablet with Limited A1000 Features", "Date": "January 2, 2014"}, {"Author": "Katy Horgan", "ReviewID": "R3P0F0Q3UXXZP", "Overall": "5.0", "Content": "I have wanted a tablet for quite some time. Decided to start with this one because the price is so reasonable and I wanted to get used to tablets. It has been perfect for my needs. Very easy to navigate and the picture quality is great!!For simple searches and apps, you can't go wrong with this little tablet!!!", "Title": "Great Tablet", "Date": "November 18, 2013"}, {"Author": "Zachary Baer", "ReviewID": "R26WAKESMXIDFE", "Overall": "5.0", "Content": "Technically 4 Stars because 5 Stars would be an IPad. But for what it is, its 5 stars.I had been looking everywhere for a budget tablet without much success. Since most tablets under 100 are made by no name companies, I was really surprised to see one made by Lenovo. For this reason, I bought it.Boxing = greatSize= Just rightGraphics= No retina display, but definitely not inadequate. Pretty solidSpeed= So far, so goodAppearance= very sleek, well designed tabletSoftware=Well put together, well programmed. Its nice its connected to Google, as most budget tablets aren'tIf you are expecting an Ipad, it isnt. But if you are expecting to get a solid tablet that will last you a few years, this is the best youll get for the money. Anyone looking to get a nice gift for a person of any age would do well to get this tablet.", "Title": "Perfect for what it is", "Date": "December 9, 2013"}, {"Author": "Mr. KIKIN", "ReviewID": "RX5XVXZWW51QE", "Overall": "5.0", "Content": "This is a great Little device. I purchased this tablet for work purposes. It is a simple tablet, nothing fancy, but it works great. I use this tablet at work for schematics and operations manuals on the go. I am an industrial electronics technician and I carry this everywhere I go. I pull up all my PDF files in seconds with the office pro app. It has an excellent battery life and a excellent screen that can be viewed nicely in any angle without the image fading. I don't really use it at home but I did test its video capabilities and it does an excellent job. I did have a Lil choppiness when viewing HD movies on it. I would recommend the Lenovo A1000 instead if someone plans on using it for streaming since it has 1 gig of ram for 20 bucks more. I would highly recommend this tablet, It gives you what you pay for and more. Keep in mind that this does not have a rear camera, the front camera is terrible, and it does not have Bluetooth. I have seen some bad reviews because of these 3 flaws I noted, but come on it's a 100 dollar tablet. From a reliable company. I hope my review was useful, and yes it has google play.", "Title": "Excellent Tablet", "Date": "February 14, 2014"}, {"Author": "sydney hanks", "ReviewID": "R3D4DRYF83HHE", "Overall": "5.0", "Content": "I love it so much. I'm a little sad that it doesn't have a back camera but other than that it works amazingly. It runs really fast. Such a good price for it.", "Title": "amazing", "Date": "November 16, 2013"}, {"Author": "laurie Mathurin", "ReviewID": "RKUZTBZ4D4LR9", "Overall": "5.0", "Content": "At first I ordered the Asus memo pad tablet..... Let's just say that was a complete fail, it felt cheap and the battery burned out a day later, it was slow really slow and I just knew it was going to be a problem so I returned it .now this tablet on the other hand I like it feels really sturdy, it's pretty fast, although the front facing camera isn't the best it is a tablet I would it recommend someone who wants something simple and will work great.... Good job lenovo", "Title": "For a starter tablet this is great", "Date": "November 29, 2013"}, {"Author": "LonelyPoet \"The Signature Of A True Human Is ...", "ReviewID": "R13QCD64LHI4HT", "Overall": "5.0", "Content": "The product is as advertised. I bought two one for my mother and another for my sister both are computer illitrates so I wanted to load Magic Jack in this so that withoug much hazzle they can call my phone numbers. Unfortunately Magic Jack app don't work on this at all. When they call it rings but when I answer we both cannot hear each other at all. Other than that this is an incrible tablet worth more than the price.I may buy another one.", "Title": "Incredible Tablet Worth More Than The Price", "Date": "November 22, 2013"}, {"Author": "DONT BUY THIS", "ReviewID": "R1XW8ZHXAVBWMV", "Overall": "1.0", "Content": "I have taken good care of this tablet. Bought a protective case for it, screen guard, and only use it at home. It has never been dropped or anything like that yet it just stopped working flat out. Wont even turn on.", "Title": "Stopped working after only one month, wont even turn on.", "Date": "February 2, 2014"}, {"Author": "Renee S.", "ReviewID": "R2Q6SG8T7N6TS1", "Overall": "1.0", "Content": "Purchased this tablet for my son for Christmas. Within a month the screen froze, went black and would not turn back on. I returned the tablet and received a replacement. Within a month the replacement tablet had the same problem as the first tablet. Amazon was very good about sending me a replacement the first time and refunding my money the second time. I will purchase a better tablet this time.", "Title": "Don't waste your money", "Date": "February 27, 2014"}, {"Author": "Larissa", "ReviewID": "R1DY166D21REJD", "Overall": "4.0", "Content": "This tablet is great for simple web surfing email and watching Netflix. It can also hook up to a USB keyboard case or pair with a Bluetooth keyboard. Sound is nice and loud.  Screen resolution is not the best, but neither is it the worst. If you want a lot of bells and whistles then this is not the right tablet for you.  But it is great for older kids or as a backup tablet. I have a name brand tablet and this works almost as well. For the price you get a pretty nice machine.", "Title": "Great beginner tablet", "Date": "November 28, 2013"}, {"Author": "DAVID", "ReviewID": "R32U64TOK00Q2C", "Overall": "1.0", "Content": "Product work really well, Fast, smooth, Clear but charging port is defective! I went through Two of them, both failed in the same manner > charging port would no longer make contact.", "Title": "Junk", "Date": "February 21, 2014"}, {"Author": "Perry & Shirley", "ReviewID": "R2Q2DO2MC61T66", "Overall": "5.0", "Content": "This tablet fits my need/desire perfectly. Light, easy to handle, and functionality is great. Having a smartphone with Android prepared me for understanding this tablet. Yes other higher end may have more functions for other users this is perfect for me.", "Title": "Excellent", "Date": "January 15, 2014"}, {"Author": "tyler", "ReviewID": "R3FZSJYSUVQMP8", "Overall": "1.0", "Content": "Was working fine first day and on the second day of use after I plugged it in the screen went black. It was never dropped or spilled on.", "Title": "broke in 2 days", "Date": "February 10, 2014"}, {"Author": "Virginia M. Wilday", "ReviewID": "R3RRB64D5HP7EG", "Overall": "1.0", "Content": "I really liked this while it worked.  I used it for taking notes in class, and I used apps that were required for class.  I never allowed the battery to be fully discharged before recharging because I know that can cause issues.  I had been studying with it, plugged it in at 14% power left, and went to bed for the night. It had been working up to that point with no issues.  In the morning, I tucked it in my backpack and headed to class.  When I went to turn it on, nothing.  It would not turn on. I plugged it back in and charged it for another 24 hours, still nothing; it wouldn't even turn on. It's a good thing I always have \"emergency\" pen and paper, and send all my notes as an email to myself to be sure I can access them from more than one location.I am replacing this with a Nexus that hopefully does a better job of working.", "Title": "Worked great at first, then quit entirely in less than 3 weeks", "Date": "April 8, 2014"}, {"Author": "Glover Glenn", "ReviewID": "R15ML2N07JPC2R", "Overall": "2.0", "Content": "It wasn't clear before purchase that this tablet had only a front camera.  And a lousy one too.  It is very hard to turn on, depressing the power button requires more than standard pressure.  and there is no hard key to awaken it when it falls asleep, the power button needs to be pressed again.On the positive side, it is Android, and its haptic feedback is good, processor speed not bad either.  The case seems sturdy and decent (not the very cheep look) but not particularly attractive.Overall, I expected a better quality product from Lenovo...", "Title": "Disappointed", "Date": "February 18, 2014"}, {"Author": "Alma", "ReviewID": "R2INT3HS29IE02", "Overall": "5.0", "Content": "Bought two of these for my kids for Christmas. they love it! Its very inexpensive compared to other tablets. The graphics could be better, on some apps the graphics tend to get choppy but for the price i find it a great value!", "Title": "worth your money!", "Date": "January 13, 2014"}, {"Author": "a lunsford", "ReviewID": "RFK430A28G4UJ", "Overall": "5.0", "Content": "i wasn't familiar with this type of tablet but i purchased it for my boyfriend and he loves it and is pleased with the tablets performance.", "Title": "impressed by this tab!", "Date": "January 9, 2014"}, {"Author": "HJM", "ReviewID": "R3EVO3VB7EACSU", "Overall": "5.0", "Content": "Needed a small tablet for simple things.  This is perfect.  Terrific Product.  Graphics are good; could be better on videos but good enough for what I need.", "Title": "Perfect for me", "Date": "December 20, 2013"}, {"Author": "ljdhlawjd", "ReviewID": "R1NKHDR6OR2HNI", "Overall": "4.0", "Content": "This tablet is good for what I need which is for using apps and internet browsing.The battery lasts very long in my opinion. My only issue is that the processor is slow so when you click too fast it just closes what you're using and has a little thing pop up that says low memory. Not a gigantic issue for me since I'm sure I can fix it with some research on Google by the tech exerts. However, the closing down of apps can get annoying.", "Title": "good tablet for the price", "Date": "May 12, 2014"}, {"Author": "Badboyzkg", "ReviewID": "R35A2TJF9SRDHD", "Overall": "5.0", "Content": "My son purchased a generic tablet for me as a gift last summer. It was an inexpensive tablet. This is no slight against my son but the tablet was a nightmare from the beginning. It took forever to go online, apps crashed all the time, and soon I wasn't able to install or update apps. i mentioned that to say this, I recently purchased the lenovo Idea tab and it's day and night from my old tab.It's super fast, sleek, apps never crash and it goes online with lightning speed. If you don't want to spend money on an ipad or very expensive tablets, this is the way to go. It's a brand name tablet at a very affordable price. I feel this is my \"first\" tablet.", "Title": "Amazing Tablet", "Date": "February 6, 2014"}, {"Author": "Nala", "ReviewID": "R38V1NPZMACOOX", "Overall": "5.0", "Content": "So far I love it Works great Lots of appsfor the price hard to beathighly recommended for 1st tabletno complaints so far", "Title": "Great For everyday Surfing", "Date": "February 6, 2014"}, {"Author": "Steve Woodell", "ReviewID": "R35RA8I8GMNAW1", "Overall": "2.0", "Content": "The tablet I received simply would not accept commands without multiple, and I mean multiple, attempts (with ample waiting time between attempts), particularly when it came to e-mails (logging out was almost impossible) or web browsing. (I had no problem accessing YouTube.) I ended up returning it.", "Title": "Returned Product", "Date": "February 2, 2014"}, {"Author": "jent", "ReviewID": "R1TH4B37BIHKK4", "Overall": "3.0", "Content": "I bought 2 of these for my kids and they love them(ages 2 and 3).  They previously had the Samsung galaxy tab which they loved, but screen got cracked.  This tablet does not have the same feeling. It is thicker, the picture is not as clear, the memory is slower, but for the price and the age my kids are at they were not very picky. If you are looking for someshing for youngsters, this is perfect.", "Title": "tablet for a young gamer", "Date": "January 7, 2014"}, {"Author": "Elizabeth", "ReviewID": "R1OR0DD05KNM8T", "Overall": "5.0", "Content": "I bought this as a gift for my step-father, who has very, very little computer experience but who had recently started occasionally looking things up online, and he loves it. I don't know if this tablet would be good for business or for gaming, but it's mainly being used for Google, IMDB, Wiki, etc., and it's user-friendly for a non-technical person. For the price, it was a great purchase.", "Title": "Worked perfectly as a gift", "Date": "January 7, 2014"}, {"Author": "Reddcmw", "ReviewID": "R2VL8NLFAKPC91", "Overall": "5.0", "Content": "Purchased 5 of these for grandkids and they absolutely love them.  Easy to use and has everything they need.  Nothing fancy but good for their ages.", "Title": "Great for grandkids", "Date": "January 3, 2014"}, {"Author": "michele snellgrose", "ReviewID": "R3HC8XZCJ0P4KI", "Overall": "5.0", "Content": "Exactly what I was wanting for my son in the Navy. Able to go anywhere needed. I fully recommend this.", "Title": "perfect gift", "Date": "December 17, 2013"}, {"Author": "whiskeyradio", "ReviewID": "R2JCL8VWS6LNO5", "Overall": "1.0", "Content": "Product freezes a lot. And now it won't even charge. Expensive paper weight. I would of been better off spending more", "Title": "is a big waste of my money", "Date": "February 7, 2014"}, {"Author": "Hain Htet", "ReviewID": "R15GWJ65W9GTK0", "Overall": "1.0", "Content": "Hi,I have bought this lenovo, last month ago.  It is good and OK.Now today, when I playing music , the screen went black and power off. Although i charge again cannot turn on.So, how to change warranty? How can I do?ThanksHain", "Title": "lenovo ideatab a1000l 7-inch 8 gb tablet warranty", "Date": "January 28, 2014"}, {"Author": "HEBERTO DELGADO", "ReviewID": "R23WH60EVSUATO", "Overall": "5.0", "Content": "Very good quality, purchased it for a 9 yo. Whi seems to enjoy it. Spends countless hours on it watching videos stored in our personal cloud.Plays streamed video content seamlessly.Thumbs up!", "Title": "Good purchase", "Date": "January 14, 2014"}, {"Author": "FAVIOC", "ReviewID": "RN9OXE2O5CUVC", "Overall": "5.0", "Content": "excellent product I recommend it 100%. to have such a low price is very good. the internet connection is very smooth", "Title": "is the better tablet, for this price", "Date": "December 24, 2013"}, {"Author": "Richard Stanley", "ReviewID": "R27VIC52FP95RQ", "Overall": "5.0", "Content": "Have not had any issues since I have owned it. Works great. Would recommend this or any other Lenovo tablet.", "Title": "Works great", "Date": "June 9, 2014"}, {"Author": "lewisjm", "ReviewID": "R36N6LLZLQF4R9", "Overall": "3.0", "Content": "As a bargain priced small tablet you get what you pay for. The Android operating system isn't as good as IOS7 and the lack of blue tooth means no external key board or speakers.  On line instruction manual is poorly written.  But, web connections were easy to make and solid.  Basic services such as E Mail and web browsing worked well.  Recommend getting a stylus to use with it because the 7 inch screen makes for small touch zones and the virtual keyboard has very small keys.  The lack of a rear facing camera is unfathomable.", "Title": "Lenovo ideal tab A1000L tablet", "Date": "May 20, 2014"}, {"Author": "Alana Goodall", "ReviewID": "R1UO2XICP15AL5", "Overall": "4.0", "Content": "We bought this in November of 2013 as a Christmas gift for a younger teenaged son.  He's enjoyed it and used it daily since Christmas.  It quit charging in April, and we sent it back to Lenovo for repairs.  The worst part of that process was trying to get to the right department at Lenovo.  The repair and return were super fast, and he has his tablet back now.  Can't complain much for a sub-$90 tablet.", "Title": "Pretty decent price for what it is and does.", "Date": "May 6, 2014"}, {"Author": "deisy fuentes", "ReviewID": "R29QCJH0YS1IG7", "Overall": "4.0", "Content": "Very good tablet and nice transaction. The only bad thing is that the photos are too dark, does not have much resolution camera. But everything else EXCELLENT!!", "Title": "Good", "Date": "May 2, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RE3U370J720JO", "Overall": "5.0", "Content": "I wasn't sure why I needed a tablet, so I got a cheap tablet.  It has a good display and functions as intended.  it's pretty good for being cheap.", "Title": "Good tablet", "Date": "May 2, 2014"}, {"Author": "Deborah Alleyne", "ReviewID": "R1TD01619W72R", "Overall": "1.0", "Content": "I am very disappointed with the table...I bought it in March and within the following three weeks it would not charge up...I tried different chargers but none could charge it up...I need now to return it for servicing. ..I'm extremely disappointed. ..", "Title": "Disappointed with tablet..stopped working charging within 3 weeks", "Date": "April 30, 2014"}, {"Author": "Janet Goodenbery", "ReviewID": "R21Z4IJ2KNUAQY", "Overall": "1.0", "Content": "I wanted the Lenovo tablet to take pictures and video and because it was lighter than my Kindle. The camera is very hard to use as you can't see what you're photographing  as you press the button. It would be good for selfies, not my thing. I saw a deal on TV and the actual price was not as advertised, and I did not get free shipping as promised. Buyer beware I guess.", "Title": "disappointing", "Date": "April 29, 2014"}, {"Author": "JJP", "ReviewID": "R2N5R6H0M7SMDS", "Overall": "1.0", "Content": "I have a Lenovo Ultra Book and love it, but this Tablet has been nothing but a pain. Almost every time there's an update or download an App it freezes up and the only way we know how to fix it is to allow the battery to die and recharge it, but it never resets itself nad have to go through the same process. Why would IBM release something as this and diminish their name! I purchase this early as a gift... so I'm glad I bought an extended warranty which I am filing now.", "Title": "DON'T WAISTE YOU MONEY OR TIME", "Date": "April 25, 2014"}, {"Author": "gail thompson", "ReviewID": "R3D1HPJ7Z9M2RY", "Overall": "1.0", "Content": "I purchased this item for my grandson in early March. It sat unopened until his birthday on March 30th. The thing broke on April 10th. I see that it was only covered (conveniently by Amazon until the 5th). I purchased a warranty who said I must claim a replacement with Lenovo. I called Lenovo, they said I have to get a replacement from Amazon. Amazon tells me I have no replacement options. What the Hell. The kid had this thing less than two weeks. The on/off button was sticking and now can't be used. The screen froze and went blank and there is no way to check the thing out since the on button doesn't work.You can imagine I am angry and disappointed for my grandson. I'm sick of all this runaround and no one wants to live up to their responsibility. Buy extra insurance at your peril because they'll find a way not to pay up.", "Title": "The return process is a pain in the A&&", "Date": "April 23, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00F2ENYPC", "Features": null, "ImgURL": null, "Name": null}}