{"Reviews": [{"Title": "An exceptionally well done rugged 10-inch Android tablet for when a consumer product just won't do", "Author": "conradb212", "ReviewID": "R3EFF7XG4BIEGZ", "Overall": "5.0", "Content": "Interesting to find Xplore on Amazon. Xplore Technology is a company that has been making ultra-rugged tablet computers for a good decade and a half. They definitely know what they're doing with tablets. Until now, all of their tablet products were heaviest-duty ultra-rugged products. The much lighter Android-based RangerX addresses a broader part of the booming tablet market, as a device that looks like a consumer tablet, but is much tougher.The 10.1-inch RangerX has roughly the same footprint as the company's big iX104 Windows tablets, but is only half as thick and weighs less than half as much (about 2.2 pounds). It costs much less, too, and it uses the same projected capacitive multi-touch interface as consumer tablets and smartphones. There's no active pen (not needed for Android anyway), but it comes with a capacitive pen, the kind with the large, soft rubbery nub. Rather than a junior addition to the existing iX104, the RangerX is a ruggedized implementation of a consumer tablet. It's clearly configured for industrial markets and the type of work encountered in the field, warehouse, truck or anywhere else.The RangerX is still a bit larger and quite a bit thicker than consumer media tablets in this class, but it's much handier than traditional Windows-based rugged tablets. The outside is plastic with elastomer edge and corner protection, inside there's a hefty magnesium alloy frame. Unlike the hyper-thin consumer tablets, the RangerX doesn't feel fragile at all.The display has 1366 x 768 pixel resolution and a very bright 500 nit backlight. It's an IPS LCD, which means it has perfect viewing angles from all sides. Since the tablet will be used outdoors, its display uses technologies such as direct-bonding and special optical coatings to minimize reflectivity, making the screen much more readable and useful outdoors and in sunlight.Like most Android devices, the RangerX uses the projected capacitive multi-touch that everyone knows and loves. But procap doesn't work with gloves on or in the rain. So that's an issue with the original RangerX (but millions of smartphone and iPad customers use their procap devices outdoors every day anyway). Note that Xplore also introduced a Pro version of the RangerX with a more evolved version of procap that works with gloves.The RangerX runs on a dual-core 1.5GHz Texas Instruments OMAP 4470 processor, the same processor as used in some Kindles and Nooks, etc. It's not a total state-of-the-art chip, but our RangerX feels quick and responsive. Ours has 32GB of storage, and there's an externally accessible micro-SD card slot, and you can also add up to 128GB micro SD in an internal slot. The 35.5 watt-hour battery is user-replaceable and we've seen up to ten hours of operation.The RangerX has more onboard connectivity than most consumer Android tablets: full USB 2.0, micro USB 2.0, audio, and micro HDMI-out, with an HDMI-in and RJ45 LAN jack option. It has dual band 802.11a/b/g/n WiFi, Bluetooth 4.0, integrated GPS, and optional 4G LTE mobile broadband. The I/O ports have protective doors that are fingernail busters to openLike most consumer tablets, the RangerX has ambient light and G sensors, a user-facing HD webcam, and a 5-megapixel rear-facing autofocus camera with LED illuminator and 1080p HD video support. The cameras are decent, and good and fast enough for actual work.Unlike consumer tablets, tough stuff like the RangerX must pass some military standard testing. The RangerX can be dropped from four feet. It's also fully dust-proof and even the worst rain won't damage it (as long as the protective port covers are closed!). It's also built to operate in -4 to 140 degrees F; consumer tablets usually can't do that.Our RangerX came with \"Ice Cream Sandwich\" Android 4.0.4, and did not have Google Play (it did come with Maps, Chrome, GMail, and also provided access to the Amazon Android app store). The new RangerX Pro version has Android 4.2.2 and full Google GMS certification, so it has access to the Google Play store.Anyone who needs a light and handy modern tablet, but needs one that won't break as easily as a consumer tablet, should consider the RangerX. It costs significantly more than an iPad or consumer Android tablet, but the extra cost is justified if it's viewed as a tool for one's job.", "Date": "January 24, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F2K9ZUY"}}