{"Reviews": [{"Title": "Dell Venue 8 Pro vs Lenovo Miix 8", "Author": "Amazon Lover", "ReviewID": "R1TDSDFEZE6RS6", "Overall": "5.0", "Content": "I'm going to post this review under both the Dell Venue 8 Pro and the Lenovo Miix 8 as I believe some people may find the comparison helpful.I will cut to the chase and say that I have decided to keep the Venue 8 Pro and return the Lenovo Miix 8. I rated both of the devices a 5 because they are both very similar and I didn't feel it was fair to dock the Lenovo just because I preferred the Dell. If I could have rated the Lenovo 4.75, I would have.Here is what I like and dislike about both devices:1. Screen on the Dell is better than the Lenovo in my opinion. For example, in the Kindle App for Windows 8, after changing the settings to white text on black background, you get a truly \"black\" background on the Dell whereas it is more of a gray on the Lenovo. Also, the colors just seem to be more accurate on the Dell. The Lenovo offers a brighter screen but the Dell is plenty bright for me. I was also able to dim the backlight on the Dell more than the Lenovo which was helpful to me for nighttime reading. These are not major issues but it was something I noticed after comparing side by side.2. I have grown to prefer the build materials and quality of the Dell more than the Lenovo. The Lenovo is thinner and lighter which I thought was something that was important to me, but the Dell is much more comfortable to hold. This is mainly because the Dell is made from some sort of rubberized plastic material that is very \"grippy\". It just feels comfortable to hold. The Lenovo on the other hand is made from some sort of slick plastic and it always felt like I was going to drop it. Also, the Lenovo made a faint \"creaking\" and \"crackling\" sound whenever I held it.3. I originally didn't like Dell's placement of the start button on top of the device, and this was one of the reasons that I purchased the Lenovo. After using them both, I have grown to prefer Dell's implementation since I don't ever power off the device. The Start button acts as my \"on\" button and I have grown accustomed to the placement. I thought I would prefer the Lenovo with its capacitive button, but I find myself having to hit the button at least twice to activate it which is very frustrating. I realize it must be very difficult to design a capacitive button with just the right level of sensitivity, but if Surface and many Android tablets can pull it off, so should Lenovo. Hopefully both companies will figure out a way to engineer a hard button on the front like on the iPad.4. I thought I would prefer having the GPS that the Lenovo offers, but since there aren't currently any good GPS apps for Windows 8 touch devices, I didn't find much use for it. I tried it with Streets and Trips and the program would not recognize the GPS sensor.5. I get slightly better sound quality from the headphone jack of the Dell than I do with the Lenovo. It's just a minor difference and probably just a matter of personal preference, but it is something that is important to me.6. Actual user performance on both devices was about equal for me, even though the Lenovo apparently offers a slightly better processor.7. The Lenovo offers a cheaper case and stylus than the Dell. I have found the Lenovo case and stylus for as low as twenty dollars here on Amazon.8. I was able to pick up the Dell unit for twenty five dollars less than the Lenovo and see a lot of deals on the 32 gb version of the Dell. Something to consider.9. Battery life seems to be similar on both but I can't say I have performed any scientific tests to verify.Here is a list of tablets that I currently own and used as reference points in deciding whether or not to keep the Dell:1. iPad 2. I no longer have any need for this device and find it to be too limited for its size and weight. I have handed this down to my wife and kids. The kids get a LOT of mileage out of it playing various learning and leisure games. My wife mainly reads books and plays candy crush on it.2. Kindle Fire HD 8.9. I ONLY use this device because of the text to speech feature and only when I need to read something technical and/or boring for work. I tried to \"upgrade\" to the Kindle Fire HDX 7\" and later learned that Amazon crippled this amazing feature (you have to buy the audio book now) so I ended up returning the HDX. I may upgrade again if Amazon ever brings this functionality back.3. ThinkPad Tablet 2. This is my go to device for customer meetings as it is very convenient for taking notes with the screen size and dock-able stylus. That said, the device is a little slow for my taste so I'm really looking forward to the new version early next year.4. Nexus 7 (1st gen). Too slow and battery life sucks. Pretty much collects dust now but I do use it occasionally as a controller for my Sonos system.5. Surface 2. Love this device with the Type Cover 2 and use it as a bridge between my home pc (Samsung Series 7 Slate) and work pc.6. Kindle Paperwhite. Love this device for long reading sessions as I don't get any eye strain like I do on my LCD devices.7. iPad Mini (1st gen) Great for what it is, but very limited in what I can do with it. I use it mainly as a quick consumption device and ebook reader. I might end up getting rid of it now that I have decided to keep the Dell Venue 8 pro.Well, I think that is everything I wanted to share. I do want to make it clear that I like both the Dell and Lenovo very much, and would have kept the Lenovo if the Dell wasn't a choice. Thankfully, I have a choice and will stick with the Dell.", "Date": "November 29, 2013"}, {"Title": "Internal GPS, and brightest screen of all current Win 8 tablets", "Author": "Rick S", "ReviewID": "R1HN7SIBQPEJQV", "Overall": "5.0", "Content": "I've had the Miix 2 8\" for two weeks, and it's definitely a keeper for me. I plan to use this for a different purpose than many of you. I need to mount this in my sailboat for use as a navigation tool (chartplotter) by the steering wheel. I've interfaced it to my boat's instruments using Bluetooth, and all the marine software that I use is written for Windows. So I have a special requirement for a Windows tablet (not Android or iOS) with an extremely bright display for daylight viewability, which this tablet excels at better than all the Windows 8 competitors out there right now. Also, this tablet has a built-in GPS, which makes it perfect for navigation. Most Windows tablets out there right now do not have GPS (though I'm sure they'll become more common over time). A quick note of warning - Windows 8.1 supports tablets with internal GPS chips in a way that only works with Metro apps, not with legacy desktop programs that expect to see the GPS on a COM port or TCP port. But there are free and low-cost programs available that will take the internal Metro GPS and emulate a COM port and/or TCP port, so you can use your old programs with it.For me, the screen brightness and GPS are the two features that make the Miix2 8\" stand out over the other 8\" tablets from Dell, Asus, and the others. Those features may not be that important to you, but if they are, this tablet deserves a long, hard look.The only significant weakness is the low audio volume, but that can be addressed with headphones or external speakers. I plan to get some Bluetooth speakers for use on my boat. The other weakness for some is the bright display. Some have complained that its minimum setting is too high to use in a dark room. Not a problem for me, but maybe it is for you.Let me also dispel a few myths that are out there:Myth 1: The Miix2 does not have a GPS. NOT TRUE. It definitely has one. It shows up in Device Manager, works with Metro apps, and works with my legacy PC software when running \"Geolocation TCP\" freeware. (Google it.)Myth 2: Because there is only one microUSB port, \"it is impossible\" charge the Miix while it's connected to an external device. (Stated in several magazine reviews.) NOT TRUE. You just need a little creativity and a few adapter cables. You need a USB Y-adapter (two Type A plugs at one end, one Mini B plug at the other end) like those used for many portable hard drives, and also a USB adapter with micro B plug on one end and Type A female receptacle at the other end. Plug the power-only USB plug (often colored red or marked \"Power only\") into the Miix's power cube (or similar 2-amp USB power supply). Plug the other type A plug into the Miix using the micro adapter. Now plug the Mini B plug into a USB 2.0 hub and you have multiple USB ports while the Miix charges that you can plug in mice, keyboards, thumb drives, or another SD card reader. All the required parts are available at Amazon or DX for a few dollars each. I had them all lying around from other old computers.Myth 3: 32 GB is not enough space. NOT TRUE (maybe). Everyone's need are different, but the first thing I did was put in a 32GB microSD card. I keep it in the microSD slot all the time, and I put everything I can on it, leaving the internal memory free for stuff that can only be installed there. It is true that there is only about 10 GB of available space on the 32 GB tablet, but 7 GB of that is contained on two recovery partitions that can be moved to an external drive, so you can get some of it back. If you need more, spend the extra $$ for the 64 GB version. But I got the 32GB because it was on sale for $100 less than the 64 GB version.Myth 4: Windows 8.1 sucks because there is no start menu. NOT TRUE. Just install Classic Shell and be done with it. With Classic Shell, it can works just like Windows 7 for PC apps, and you can always switch over to Metro apps for things that a tablet does best.The Miix2 is not meant to be your primary PC, but if you need a portable 8\" Windows tablet for under $300, this is a great one to consider.Addendum 2/9/2014:I did have some difficulty connecting a portable hard drive to the Miix through my USB hub. It worked fine if I directly connected to the microUSB port on the Miix, but would not come up when connected through the hub. The problem is probably the $5 hub and not the Miix - I recall having similar problems connecting hard drives to other computers through a hub.Mice, keyboards, thumb drives, and even additional card readers connected through the hub just fine. And when you use the Y-cable adapter mentioned in my review, you can charge the Miix at the same time you're using the external devices.", "Date": "January 25, 2014"}, {"Title": "Solid Performer vs. Dell Venue 8 Pro", "Author": "Paul A. Bigelow", "ReviewID": "R2255YSEL2RLNL", "Overall": "4.0", "Content": "The Lenovo is a good tablet and should suffice for users of previous Windows tablets and those familiar with Windows 8.1Brief review and comparison vs. the Dell Venue 8 pro:Processor/Memory:The Dell has the 3740D and utilizes single channel memory -- 2GB maxThe Lenovo has the 3740 and utilizes dual channel memory -- 4GB max (but the Lenovo does not allow for a memory upgrade)A look at the System Performance file shows a 6.4 memory for the Dell and 7.1 for the Lenovo.The other performance scores are virtually identical.So theoretically, the Lenovo should be a bit more snappy but I haven't really noticed it yet in \"real world\" use.Physical:Under similar loads the Dell's back gets a bit warmer than the Lenovo's.  The Lenovo has never become *hot*, so far.The Dell *feels* nicer and more solid, the Lenovo makes a few creaking noises if flexed even a little.The Dell's buttons certainly feel better with a good tactile response, the Lenovo's feel \"mushy\".Screen:The Lenovo screen can be made the brightest, but the Dell screen can be made the darkest and looks better in a low light environment. The Dell seems to reproduce colors better at the widest angles while the Lenovo washes out (both are still, IPS though). The Dell has warmer screen temperature, the Lenovo is a bit on the cool side (partially explains the perception of brighter but the backlight is a contributor also).Sound:I'm still evaluating the sound, Dell has released an update for both firmware and screen.Misc:Haven't tried the Dell active pen, no one locally has it. A Targus aluminum barreled capacitive stylus works pretty good.  Both have good handwriting recognition.The Dell has the more feature-ladden BIOS while the Lenovo's is fairly simple. The Dell also has a nice hardware diagnostic menu/program as well.The Lenovo camera allows for panoramic shots the Dell does not (same Windows app version)The Lenovo has GPS the Dell does not.I had to return my first Lenovo as the SD card slot was broken and wouldn't hold the sdcard. The second Lenovo was fine.Impression:The Lenovo is a fine, if not extraordinarily well-built tablet.  Snappy performance.", "Date": "December 8, 2013"}, {"Title": "Dell venue 8 pro is better despite being barely heavier", "Author": "Mike", "ReviewID": "R1GXKANE2WW5M1", "Overall": "3.0", "Content": "I bought this as well as the dell venue 8 pro and the dell one is better for a few reasons. The display is more color accurate, touch screen taps are more accurate, the WiFi speed and signal strength are better when placed in the exact same location and connected to the exact same AP, the build quality is more durable, and the speaker volume goes around twice as loud. No joke.I have to admit that the mix had a slightly better camera and was lighter, but the above features were more important to me.", "Date": "November 15, 2013"}, {"Title": "excellent hybrid tablet for work/play", "Author": "Wirt W. Cross Jr.", "ReviewID": "R1BPK7YLLDQLTN", "Overall": "5.0", "Content": "At work I use word and power point quite frequently.  I am also more comfortable with windows vs. mac.  I bought an ipad 2 back in the day, and just never used it that much.  Oh, it was fun for the first week or 2, but after that I realized I'd surf the net occasionally or play a game or 2 on it but that was it.  Once the windows tablets started coming out I was interested in seeing how they worked.  the surface was not for me because I don't like the idea of a windows lite.  I'd rather have a full version, but the fact they had power point and word seemed pretty nice.  I needed something the was portable and able to be comfortably held in one hand so I continued to wait.  I almost got an ipad mini but held out, and I am definitely glad I did.  I started looking into the miix2 when my wife got the miix 10.  It seemed pretty nice but too big.  I saw a review about a pending offer from lenovo the miix 2  I happened to check amazon and lo and behold the had it in stock.  i ordered it immediately and it arrived 2 days later.External appearance: Opening the box I was very pleased with it's initial looks.  It seems very sturdy, maybe aluminum or something but there was certainly no flimsiness that i noted.  I didn't like all the stickers on the back but they peeled off very easily and you can't tell they were ever there.  It has a micro usb an SC card slot and a headphone jack.  Speakers on the back one on top of each other and front and rear facing cameras.  Windows button in good position bottom center.  Plugged it in and after a few hours charge booted it up.First use: Set up went just fine without a glitch.  Mine didn't have the facial recognition software which I would have removed anyways.  The apps preset were fairly minimal in keeping with lenovo's other offerings. I also removed mcaffee and several other non-essential aps without difficulty.  The uninstall is extremely easy.  Windows 8 is a great OS.  I use 7 on my other computers but I really like 8 so far.  The really nice thing is word, power point, excel, and one note are all there to be installed using the key provided in the packaging.  Also while trying to get used to the new start screen, the desktop was literally a touch away.  I installed itunes just to see if I could and that brings up another plus. This is full windows.  If there isn't an app for something you need you can just install the program (size pending obviously).  I don't need a citrix receiver app, I just install the client and it boots up.  I can also port into my home or work cpu without difficulty.  I have used this almost exclusively for the past 2 weeks and still love it.  Although the ipad was never a laptop replacement I can see this tablet being close.  I have a bluetooth keyboard and power point and word are with me wherever.Screen: Very nice very bright.  people have complained that the black isn't black but I found that by fiddling with the adjustments it a pretty good pure black to me.  the contrast is very nice and the high def is great for me. Although like any other tablet it collects smudges, they don't seem to interfere with visibility that much.Sound: Speakers are fine, nothing great but adequate.  Certainly not busy airport loud, but I use headphones mostly.Speed: I am very happy with the speed of internet connection as well as processing.  Another plus is that I can run 2 apps/programs simultaneously without losing noticeable speed.  I'm working on a powerpoint and need info I bring up chrome to one side and get the info.  This is extremely useful.Storage size:  I have the 32 GB, and can see needing more space but with the SD slot you can just add a card and viola you have it.  There is also a 128 GB coming out that should be great.Battery life:I haven't tested it extensively, but I typically plug it in at night and haven't lost power during the day yet.  I use it modestly though.  Not sure how far it'd last if you were on it literally all day.Work use:  I already alluded to this but i am able to do pretty much everything I need to for my business on this it really is very close to being a laptop replacement. (If you have vision impairments (wear glasses, etc) the small screen may be an issue plus it you need a larger display this won't work as well but for me it's great.Apps:  the windows App store is still a bit light although getting better per report.  There's also a lenovo app store which seems a waste of time but there are some exclusive apps there. If all you want is games, the ipad of android may be better, although xbox is getting a larger presence on the windows platforms and I can see them starting to push exclusive content. Just something to think about.Overall durability:  I have been using think pads for almost a decade now from back when IBM still made them and am definitely slightly biased as I think they are hands down the best laptops.  The Miix 2 is definitely in keeping with their reputation for sturdiness.  Now bear in mind its a tablet and I'm not going to go around dropping it just to see, but it certainly feels sturdy and the screen seems tough.Overall: Great tablet I'm recommending to everyone I work with and anyone who reads the reviews on amazon.  I bought a screen cover which I'd recommend anyone buying this to do ( they literally cost only a few bucks) and a evercase thin case for it both of which are great additions to make this a perfect tablet for me.  The case was under $10 when I bought it and is very nice.  Great value for the cost.", "Date": "December 25, 2013"}, {"Title": "Nice Tablet (better than Venue 8 Pro, IMO)", "Author": "B. Harris", "ReviewID": "R9REB02F1M2Y9", "Overall": "5.0", "Content": "Ordered the Miix 2 8 after giving up on the Dell Venue 8 Pro.  Both Dell models I tried suffered from touch issues causing keys to repeat when typing and gestures and taps to be misinterpreted.  Just search online for \"dell venue 8 pro sensitivity\" and you'll find a thread on Dell's forums (but ignored by Dell) about the issue.  It was even worse when trying to use any kind of screen protector.I've only had the Miix 2 8 briefly, but so far I am impressed.  Will update my review and rating accordingly.Won't rehash what others have said better than I can, but I did want to address a few topics that haven't already been covered or with which I differ/disagree.Wifi Speed: I've seen several people mention wifi speed as an advantage of the Venue over the Miix 2.  I believe the problem is that, by default, the Miix 2 wifi isn't taking full advantage of it's hardware. If you go to the Advanced properties of the Broadcom wireless adapter, there is an option to choose \"Bandwidth Capability\".  By default, it is set to only use both the 20Mhz and 40Mhz bands on 11a networks.  This limits the maximum connection speed on 11n networks to 150Mbs.  If you change the setting to \"11a/b/g:20/40Mhz\", this will allow it to connect at the full capability of 300Mbs.  I had a Dell laptop with the same default limitation.Speaker: For me, the speaker volume which others have discussed isn't a huge issue.  The Dell was definitely louder and fuller, but the Miix 2 isn't terrible.Display: I personally prefer the display on the Miix 2 over the Venue.  Both are very nice, but the Miix 2 is clearly brighter.  I also feel that text appears sharper on the Miix 2.  I used my Datacolor Sypder colorimeter on both devices to calibrate the displays.  The Dell was more accurately calibrated from the factory, but the Miix 2 looks better after calibration and has better color reproduction/gamut - ~75% sRGB for the Miix 2 vs only ~65% sRGB for the Dell.USB: Using an OtG adapter, the Venue could only access low-power USB devices like flash drives.  Portable 2.5\" drives or DVD drives simply wouldn't work.  These higher-power devices do work on the Miix 2 without needing separate/supplemental power.Charging: The Venue can only be charged with it's own charging block.  The Miix 2 can be charged from other USB power sources/chargers.Resolution: In researching the available 8\" Windows 8 tablets, I've seen many individuals and reviewers knock them because of the relatively low 1280x800 resolution.  Many people said that the upcoming Thinkpad 8 (with a resolution of 1920x1200) was the one to wait for.  As much as I wanted the higher build quality and specs of the Thinkpad 8, the higher resolution was actually the reason I did NOT want it.  Unfortunately, the Retina world of iOS is a very different environment than Windows 8.  High resolution displays simply aren't handled well in Windows or with Windows applications - specifically classic desktop applications.  One option is to use 100% - in which case UI elements will be so ridiculously tiny on a high PPI screen that they can't be seen on the 8\" display.  The second option is to use Windows' DPI scaling to increase icon and text size, but then the problem is that many applications (and even some aspects of Windows) don't properly support/implement scaling (or don't do it at all) resulting in content that doesn't display properly or is actually less legible/sharp than 100% at 1280x800.  The third option is to run the 1920x1200 panel at a reduced resolution (i.e. 1680x1050) to make elements slightly larger, but running an LCD panel at a non-native resolution will always result in blurry text and is defeating the purpose of having a higher resolution LCD.  Another thing to keep in mind is that if you plan to establish any RDP connections to any other systems from an 8\" Windows tablet, it's not possible to use DPI scaling on remote sessions.I have seen comments elsewhere saying that using a cheap OtG plus power adapter for devices like the Nexus 7 and Galaxy S3 will allow simultaneous charging and use of the USB port.  I'll have to give this a try and see.  This definitely won't work with the Venue.I've also seen comments saying that cheap MHL USB/microHDMI adapters allow HDMI out directly from the USB port without additional hardware.  I will likely experiment with this, too.  Have seen that this option also does not work on the Venue.", "Date": "February 10, 2014"}, {"Title": "A tablet that can work seamlessly with desktop", "Author": "C. Lau", "ReviewID": "RV78XT059BL4R", "Overall": "5.0", "Content": "Got this today.  Just inputted my Microsoft account and all my settings were set up in 5 minutes in the exact way of my desktop settings.  Skydrive, Skype, email settings are all there and sync seamlessly.  Saving a lot of time.  The screen is very good; resolution is fine at this size, no need to spend more money for higher res.  Viewing angle and contrast is superb. Unlike iPAD, this tablet can be used effectively in portrait and landscape orientation. The new atom CPU is super fast.  The touch response is so good.  If you think to get an IPAD mini retina, try this one first or you will be regretted.  At the price of $299, with a full version of Office 2013, and now with real time authoring in Office web apps launched directly from Skydrive, there is no reason to use Google Docs or Apple iWork.Con :  no HDMI output.  Toshiba Encore has HDMI output but it is a bit heavier and more expensive.", "Date": "November 9, 2013"}, {"Title": "Great Choice", "Author": "ANDREW KEITH BISHOP \"Andrew Bishop\"", "ReviewID": "RUFG5IWKWEAW7", "Overall": "5.0", "Content": "This is a really great product. A perfect size for reading books, browsing the web and reading emails, plus it's a full PC. Battery life is about 7 hours and the performance is great. The screen is fantastic and the miix 2's weight is fine for holding in 1 hand for long periods.", "Date": "December 8, 2013"}, {"Title": "This is the one!  Get this Lenovo and stay out of Dell Venue 8 Pro!", "Author": "K. Li", "ReviewID": "R1NYD5RY0S8U6Y", "Overall": "5.0", "Content": "UPDATE:  i bought Dell Venue 8 Pro for 199$ on Microsoft store sale.  The Dell will not charge on home charger less than 2A, miix2 does!  charge using PC usb port?  dell No, miix2 yes!  The Dell just wont charge in the car!  i tried two different 2A car charger, it still wont charge!  miix2 does!Now back to Lenovo miix2 tablet.  This tablet is the thinnest and lightest on the market in 2013 (dont know what 2014 will bring).  The screen is 1280x800. The screen is sensitive, you only need to touch it lightly for it to register, just like your Samsung galaxy. Go take a look at your or friend Samsung Note3, that' how thin this tablet is!  Just like a girl, thin is sexy! haha.  This tablet also very light!  When i hold it on my hand, it doesnt feel heavy at all!  The included usb charger output is 5.2V==2.0A, it' the same output as my galaxy note3 charger!  So you can use your cellphone charger to charge this tablet (Do this at  your own risk! i'm not responsible for damage to the tablet if any)! I tried to use my Samsung Note3 stylus on it, it does NOT work.  So you need to buy Lenovo miix2 stylus.  This tablet has microSD slot and micro usb port (for charging). With microUsb to USB adaptor, you can hook up flash drive, keyboard, mouse, Ethernet connection on it!  There is no HDMI or micro/mini HDMI port.  The CPU speed on amazon showing 1.8Gzh is incorrect! When i go to system info, it said Intel Atom cpu Z3740 @1.33Gzh.  System type:  32-bit operating system, x64 based processor.", "Date": "November 7, 2013"}, {"Title": "A great little tablet", "Author": "barlourd", "ReviewID": "R1DHQMY932FUYK", "Overall": "5.0", "Content": "I have been using this tablet since the first day it came out. I originally purchased it to serve as an eBook reader and for light entertainment on trips, but have found myself using it more than my iPad. Having a full version of Windows in my pocket is amazing and having a the real Office pre-installed is a great bonus. I have been using it mainly for writing reports and performing off-site computer support. On a side note, if you are going to use it for office applications, a bluetooth keyboard is a must. The screen is simply too small to touch type either in landscape or portrait mode.On the performance side, it is nice and zippy, not what you would expect from an Atom processor. I would not suggest using it for gaming or 3d graphics manipulation, but as an everyday computer.I have seen some complaints about the screen and it having lower resolution than a certain competitor's tablet. This is true, though I have not seen any issues. As for color accuracy, I have yet to see an issue with this.", "Date": "November 25, 2013"}, {"Title": "Good tablet as my expectation", "Author": "Ng Ping Keon", "ReviewID": "R19FUXJRAQXO4I", "Overall": "3.0", "Content": "Good appearance and solid. Performance is medium but meet all my requirements especially for Flash compatibility. Its backlight is too bright in the minimum level. The volume is not loud enough in the maximum level. The battery life is acceptable. Overall is good.", "Date": "April 4, 2014"}, {"Title": "4 stars as it is a nice rig, while I had issues", "Author": "Amazon Customer", "ReviewID": "RDD50QKE252LL", "Overall": "4.0", "Content": "I hate to rate something low because I have issues, on the chance it's just my specific one that had problems, when overall it was a nice little unit so rating a 4.  If I didn't have the issues I would have rated it a 5The screen is bright and vivid, sharper then the ASUS Vivo Tab Note 8 which I replace this with. (Other then that, I preferred the Asus, for subjective reasons I won't go into as it is things you can compare.)Issues were the Windows button was problematic, and the unit froze completely a number of times. (Had to hold the power button for some time to force shutdown/power-off).", "Date": "March 31, 2014"}, {"Title": "Don't buy it", "Author": "Deborah Battreall", "ReviewID": "R4U6J27SM0SZO", "Overall": "1.0", "Content": "We have had 2 defective tablets.  The first one had a loose power cord connection and did not charge properly.  The replacement unit that we got has an off/off switch that is \"frozen\" , and we cannot turn on the tablet.", "Date": "March 26, 2014"}, {"Title": "Good, but fragile", "Author": "M. Alberts", "ReviewID": "R710IYWCYZDAM", "Overall": "3.0", "Content": "I won a Miix2 8 at a company event, and bought a second one for myself.  Both managed, within a few days of each other, to fall from about 2.5; off of a desk.  In both cases, the bezel separated from the back (it was in a protective case, and this still occurred).  Now that's bad enough, but to make matters worse the way the power button is situated, separating the bezel from the back causes it to pull out of the hinge, making it impossible to turn on or off if you reconnect the bezel right away.  If this happens to you, it's fixable but you have to be careful.  Take a butter knife and remove the back carefully.  Go to the power button and you'll see that any little bezel separation will cause the button to come out of its little hinge.  Replace the button into the hinge and replace the back.  This isn't a big deal if you have a lot of experience fixing computers or other gadgets, but it's sort of ridiculous that an 8\" tablet has a build quality like this.  If I need to buy another one, I think I'd look at the Dell or the Thinkpad 8 instead as the build quality seems better on both of those.  And even though you can fix this issue, the power button is sort of ridiculously small and difficult to turn on or off while in the case compared to a Surface RT or the Dell.Beyond the build quality, the machine works as advertised--fairly snappy, the screen is bright and clear, and Windows 8.1 seems practically made for this device size.  I've really enjoyed using it so far, if the build quality is excluded.", "Date": "March 25, 2014"}, {"Title": "Just wonderful. I strongly recommend it (even over the Dell Venue 8 Pro).", "Author": "A. Lebov", "ReviewID": "RUET81ZCYRISR", "Overall": "5.0", "Content": "I've read the other reviews (including the very negative ones) and I'm not sure if I just got a \"good\" unit but I've not had a single issue with this tablet.It boots very fast when shut off, and wakes instantaneously when sleeping. Speedy processor and strong and stable WiFi (benchmarked faster than my Lenovo B570 laptop!). GPS works perfectly (not sure if it has an onboard compass though). Very responsive touchscreen and although at first I admittedly didn't like windows 8, after a month of learning how to use it I honestly think it's the best system for touchscreen computers available. Runs legacy Windows programs like a champ as well.As for the Dell Venue; Although much ado has been made about the Miix2 speaker volume vs the Dell Venue 8 Pro, I had both units and although the Dell speaker is louder it exhibits a great deal of harmonic distortion. On the other hand the Lenovo has a very clean sound. Seems plenty loud to me and I'm a musician by trade. The Dell also claims to have a longer battery life, but they play a trick by testing the battery charge with the screen greatly dimmed down. Lenovo tested their battery life with the screen at normal brightness and contrast. The colors were also rather \"odd\" on the Dell and the whites on the screen weren't quite white. The Venue is also considerably heavier than the Miix2 which can become an issue if you often use it as a handheld reader. But the worst issue is the terrible placement of the Windows button on the Venue. You search for it constantly.I wouldn't hesitate to buy this tablet again.  I've watched movies on it in several formats that neither the iPad nor Android will play, surfed many flash websites, played games, downloaded the Kindle app and used it as a reader. It's really a joy to use.", "Date": "January 13, 2014"}, {"Title": "Awesome tablet", "Author": "Alejandra", "ReviewID": "R2NEZ4ZIRMI9I8", "Overall": "5.0", "Content": "Great tablet,  with win 8 it feels like you are freely working on a laptop. Really fast and light weight.", "Date": "January 2, 2014"}, {"Title": "Great Tablet!!", "Author": "Bruno", "ReviewID": "R2MEEOVH6HUNAN", "Overall": "5.0", "Content": "Tablet works great!! Very fast! I was debating between the Lenovo or the dell and I glad I chose the Lenovo! I'm new to windows 8 so it took some time to get used to it but its not as bad as other reviews say it is. I definitely recommend this tablet!", "Date": "December 23, 2013"}, {"Title": "Decent tablet PC, but it has its caveats.", "Author": "Kevin Kwan", "ReviewID": "R1Q1ZS564LF69", "Overall": "4.0", "Content": "Just a few words that can help potential Miix 2 8 buyers, since it looks like most of the attention are diverted towards the Dell Venue 8 Pro - keep in mind that I am looking at it from the prospective of a seasoned IT guy who knows his way around quite a number of systems.  I personally like mine, but then I also like and enjoy my iPad (First Gen 3G), and plan to buy an iPad Air to replace that iPad later in 2015.  This tablet is more of a splurge/impulse buy from Best Buy (they had it for $200 on the weekend of 3/8).  It's supposed to be a toy and a hands-on for Windows 8.1Pro -- The machine has surprisingly decent firepower for multi-threaded tasks - it feels like a similarly clocked notebook PC from 2009.  If you bought a CULV machine from back then, well, it's about that fast.  To translate from non-geek, it's about as fast as the first 3 generations of the 11 Inch MacBook Air.- VMX mode (virtualization) is enabled by default, so it is possible, in theory, to run something else alongside.- Graphics performance is decent enough for games made before, say, 2006 - Half-life 2 should run \"okay\" on it with native resolution - it does have a cut-down version of Intel's Ivy Bridge GPU (think of it as like the Intel HD2200, the 4EU version of the 6EU HD2500).  Stuff like Nintendo 64 and/or Sony PSX emulation is do-able, if not entirely friendly to your battery.- Comes with Quicksync, so video transcoding on the tablet is possible.  Just grab the right version of Handbrake Nightly with QS support, and use it to convert some downloaded videos to your smartphone.  Yeah, use your tablet to make videos for your Android or Blackberry 10 phone (or if you really like to mess your tablet up, run iTunes on it so you can synch it with your iOS devices...and shoot yourself in the foot while at it).  That's so wrong but it feels so right.- Comes with a full version of Microsoft Office 2013 Personal and Students edition for free (not the Office 365 demo, the actual Office 2013 suite).  You could conceivably do some work on it.- Dualband, dual antenna wireless capable (decent wireless network speeds if you have a recent wireless access point)- Decent camera quality (and the panoramic picture mode is nice to play with)- Broadcom GNSS GPS receiver. it's GPS but not standard full NMEA stanza GPS.  If you plan to use it to replace your Garmin....eh, buy Centrafuse Localizer ($5) so it can translate the GNSS data into something-kinda-NMEA for compatibility purposes.- Bluetooth 4.0 Low energy capable- Ability to read from external hard drives, USB sticks and most other USB accessories.  I actually use it to connect the machine to my office internal network via ethernet.  Just buy a Micro USB OTG adapter if you wish to do that, and look for one that can do power injections (it's a Y-cable) if you want to run devices while keeping your battery charged.- If you really need to do so, the USB OTG can be combined with the freely available Asus AiPower utility to act as an emergency phone charger.Yeah, I'm not kidding about this one.  You can use your tablet to charge your phone if you have the right cable and the right sofware utility to do so.  It's just not very fast nor very efficient to do so.Con -- 32 bit OS - Seriously guys, selling a 32 bit OS with 64 Bit hardware in 2014?!  The iPad Air has a 64 Bit ARM chip and half the RAM, and it comes with an iOS 7 64 bit build.  This is probably due to the 64 Bit Connected Standby not-ready problem hitting all the Bay Trail Atom Tablets.  Lenovo MIGHT roll a 64 Bit clean variant later on as an upgrade, but I strongly doubt it.- It only has 2GB of RAM, and Windows 8 occupies about 1GB.  You also do not have the ability to upgrade.  So running more than a few apps at a time is straight out- No separate power port, everything goes through that one Micro USB port.  If it fails you are up the creek.- No video out - no HDMI, no MicroHDMI, and no MHL.  So unless you grab a Displaylink or Miracast adapter, what you see is the only thing you'll get.- Comes with a TPM chip...of questionable utility.- 32 Bit Connected Standby Mode - the thing that helps the Atom get the great battery life, but also really held the tablet to 32 Bit Windows.  Also messes with the clockspeed of the tablet and make it laggy in the high draw titles...like the N64 emulators.- Doesn't have a conventional BIOS, so you cannot boot into an alternative OS easily - no 64 Bit Linux for you, and Linux that boots off 32 Bit UEFI is rare.- Windows 8.1 is still a headache - not really feasible as a mobile OS, really - think of it as like the 2013 equivalent of a touch friendly netbook (or better yet, the good old UMPC).  When you have to navigate 4 menus to turn bluetooth on and off one just has to wonder who fell asleep in their UI design department.- Really needs better casing options.  The Lenovo case is really a smart cover.", "Date": "March 12, 2014"}, {"Title": "Love ^o^ The BEST 8\" tablet at a Great price! Beats just about everything else at the price point =)", "Author": "D. Chien", "ReviewID": "R30C7E32F3N6C1", "Overall": "5.0", "Content": "Notes from a week of use (IT power user, used everything since the TRS-80 days):+ Light enough of a tablet to be used one-handed for an hour or so of ebook reading. Not immediately 'heavy' like the Nook HD+, which really begs two-handed or lap use from the start. Well-balanced in portrait or landscape.+ Nice curves! Rounded, smooth, nothing that'll catch on your fingers or hands as you hold it and rotate it about. Like holding a polished skipping stone.+ Decently bright screen. Easy meets and slightly exceeds the brightness of a Nook HD+, though still not as bright as the Nokia 603 at 800 nits. Notebookcheck's site has their brightness tests of the three major 8\" tablets out right now (Miix 2, Excite, Venue).  Brightness indoors easily goes from borderline too bright at the lowest setting in a dark bedroom at night to bright enough to read with the sunlight coming through a silk curtained window in daytime with the highest brightness setting.  Really no complaints of note here.+ Color temp is a nice white, not a touch yellow like the Nook HD+. Colors on the Photodisc test target look IPS great (esp. skin tones)! Images pop. Really happy with this display.+ No visible touch-screen lines unlike the Toshiba Excite, which is mared by this problem. 'Soft' feel to the surface, slick, nice and very responsive =) Never a touch-issue.+ Never runs HOT like the Dell Venue, which gets far too hot at one point on the back. See notebookcheck reviews and you'll see why the Venue becomes too hot to comfortably hold at times, the Miix 2 is always just a touch warm and okay to hold.+ Charges far faster than the hours and hours Nook HD+. Like a cellphone for charge speeds, can go from 25-50% in less than an hour plugged in.+ Baby pocket rocket tablet! No significant lag on most common uses (word, web, MP4 playback, etc). Runs everything just like a desktop, which means Miix 2 = Apple and Android tablet KILLER!! =D  Seriously!!  Have had and tried everything from iPads to Nooks and short of the Lenovo Yoga, this baby kills non-Windows tablets.  Web browsing? No problems at all - full site access with full Flash, Adobe, etc. plugins. Easy tube downloading through Firefox with Download Helper. Full torrent, Netflix, Hulu, etc. capabilities, etc.  Office, remote desktop, etc.  (Okay, a few things it can't do due to 32-bit OS...)+ Finally, the ONLY platform that let's you run both desktop EPWING dictionaries through EBPocket and view eBooks at the same time in two side-by-side windows Win8-style for studying foreign languages. And full foreign language input capabilities, with pen/handwritten input, for easy input of even the most complex Chinese characters.  Android, eg. using Nook HD+, was the closest with 3rd party handwritten keyboard, but no dual-apps running simultaneously on-screen meant lots of needless app switching.+ No issues with MKVs, 1080p MP4s, MPGs, DVD rips, subs, etc. playback, naturally. MPHC, VLC, WinAmp, etc. all run just like any other PC =D No need to worry about conversion, bitrates too high, funky sub formats, etc. EVERYTHING plays fine. (Unlike Android where even all the media players couldn't handle EVERYTHING I tossed at them.)+ MicroSD port. Push in slightly to eject. No audible sound. Cover is a plastic flap. Works fine with 32MB class 10 MicroSD cards. Haven't tested anything bigger yet.+ Regular USB to MicroUSB (OTG) cable works fine for connecting to printers, etc. Nice. Plugged in my all-in-one Epson and could scan and print in under a minute after driver install.+ Sony Vegas Video 11 runs fine on this. Can do basics like fading between two 1080p clips on the timeline without much fuss. Generally on the more responsive side, so useable as a mobile editing platform.+ Built-in cameras that can take 1920x1080 ~20Mbps, 29.97fps progressive, AAC 192 48khz MP4 video from the back.  Nice in daylight, decent resolution and detail, okay in low-light, but not 'horrible' or 'unusable'.+ Runs all 32-bit programs like VLC, Media Player Home Classic, WinRAR, Adobe Acrobat Reader, Office 2013, etc.+ Can run Nokia HERE MAPS and download offline maps for use with the built-in GPS....except, Nokia still hasn't gotten the license to include maps for JAPAN yet after all these years! >.< Certainly is handy to have maps of all other major countries offlined on this tablet - far easier to download than all other mapping programs since each region/area is one download file rather than thousands of 'tiles' ala OpenStreetMaps/Google/MapQuest/etc. screen scraping map offloading programs.  (Haven't tested the GPS unit yet...)+ LOUD speakers.  Have absolutely no idea what others are saying, but I can have this in a noisy buffet restaurant packed with a hundred people yapping away and at full volume, can easily listen to music videos, etc.  Easily exceeds the volume I regularly set my car audio deck at 45MPH on about 3/4 volume when used in my car.  Think 'cellphone-like' speaker and you'll be fine (Pocket AM/FM radio sound for you analog types.)+ Bluetooth tethering to Nokia 603 works fine (...but see below, no adhoc)+ Power on/off/volume buttons require enough pressure not to be accidentally pressed in most cases.+ Can't beat the two Franklin price point! Nukes every other tablet in the range out of the market. Nooks from one hundred to the Tabs and minis at three. And once you're up beyond three, it's time to look at the superior Yoga series, which honestly kills everything out there for most uses short of a high-end, i7 1080+ IPS panel, fast gaming GPU notebook.+ Runs Office. Full Office. Complete Desktop Office 2013 =D  No issues now opening, editing, creating any Office document for work, school, etc. This alone kicks the other OS tablets to the curb IMO.+ Easily pushes 5+ hours of mixed surfing and downloading without running out of battery. One of those tablets where you can run through a 8-hour work/school day without worrying about bringing the AC charger. (Naturally, turn brightness down, Airplane mode whenever you're not online.)- 32-bit Windows! And only 2GB RAM.CPU can run 64-bit OSs and 4GB, so sad you can't install and run memory-intensive, 64-bit apps. Lenovo also doesn't have 64-bit drivers for upgrading yourself. No Premiere CC >.< No Visual Studio 2013 >.< Virtualize and run portable apps to get around this, offloading things like Photoshop to the MicroSD card.- A touch slow at picking up rotation. Not sure yet if it's OS (likely) or by design. Just a half second or so, but sometimes, you have to bump it on the edge to rotate.- Speaker is on the back. >.< Sigh... When will cellphone and tablet designers wake up and stop doing stupid things like placing speakers on the opposite side of the human?!? Should be on the front, so you'll have to cup the speaker with your hand or use a waveguide to direct all of the sound to the front where you are.- Too bad it doesn't have a regular USB sized port built-in. They could have made a baby bump on one edge and used that to include HDMI, too, which isn't included.- Only one USB port that can be used to charge, or for connecting to devices. Thus, external HUB is required. Wished they had two or more ports.- Windows 8.1 issue - NO ADHOC connection to cellphones (eg. Joikuspot on Nokia)!!!! Very, very annoying, Microsoft >.< - It is slick like a polished stone. Too bad no hand strap port for use with a hand-strap. It can slip out of the hands - put a strip of textured cloth or rubber tape on the back to fix this. But still better than the ugly Venue rubber back.- Only 32GB. Office + Win8.1 + a handful of simple apps results in about 5GB free.- WiFi antenna/module isn't as good as on a laptop/desktop with multi-antennas/etc. 3 bars Miix 2 vs 5 bars Z580 at one location with a distant router (showing about -85dB in Inssider). But at least it's a/b/g/n, so it'll connect to about everything short of ac.- Too bad no built-in FM radio. Heck, even my Nokia 603 has a built-in FM radio. Modules can't be that expensive.- No power option besides a basic BALANCED. Can't control CPU speed using default OS shipped. (Maybe there's a 3rd party?)- Typical Win-Classic side adjusting of fonts and display settings to get things big enough to read comfortably. Win 8 side is generally fine.- 9\" Nook HD+ Screen is about the right size for full page comic book reading in portrait mode, so this 8\" Miix 2 begs to be turned landscape and scrolled. Thus, you'll have to decide whether you want a one-page, scroll-free view of your comics, etc. or not before buying a tablet of this size. Very responsive with 4-cores, so it's not been an issue here reading ebooks.", "Date": "March 8, 2014"}, {"Title": "I never thought I'd like a tablet - until now", "Author": "Val Gameiro", "ReviewID": "R35UONVSA58SPM", "Overall": "4.0", "Content": "I got my first Lenovo Miix 2 8\" tablet for Xmas 2013. I had been resisting getting a tablet, even though my wife had owned her iPad for years, and loved it. I'm a writer and a filmmaker (in my spare time) so I thought I would always want/need a physical keyboard. For that reason, I bought a Lenovo S10 Netbook, and loved it. Last Xmas my wife persuaded me to buy a tablet, and I finally gave in, but misunderstood the sales rep and didn't buy the accidental damage plan -- BIG MISTAKE! If you buy a tablet, make sure you get at least their 1-year accidental damage protection. I ended up buying mine at Best Buy, but Office Depot's accidental damage plan prices are about half.At any rate, I knew I needed/wanted a Windows 8 tablet instead of Android or iPad, because I already have a lot of software I use on my Netbook. If I want a regular keyboard, I can use that to write, but if I want to be mobile (surfing the net while in bed, or watch some Hulu or Netflix) I use my tablet. It's great for traveling, much easier to handle and put away, and because it is not a \"larger electronic device\" I can keep it on the whole time on the plane.I like the size at 8\" -- the 7\" was too small, and the 10\" too big (I know because I tried a Microsoft Surface 1st gen and it was too heavy and bulky to handhold on a plane).I also like that you don't have to join the Microsoft collective to use the tablet -- I have my own cloud storage set up so I'm using a local account instead of a Microsoft account -- VERY happy about that. I use OwnCloud for this.Pros:Light, boots up fast, runs most Windows programs I need (within the 2GB RAM limit). You can plug it in to your laptop or computer and it will charge. You can also use a regular USB to Micro USB adapter to connect external drives. You do not need a USB OTG (on the go) adapter for this tablet. You can plug in a USB hub and connect multiple USB peripherals at the same time. Good finger friendly interface. Able to run Modern Apps and Desktop Apps. The Metro/Modern interface is pretty good on a tablet (I don't like it on a desktop or a phone, though).Cons:Only has 2GB of RAM, and you can't expand it. These are fragile, and if you drop it, it will more than likely break - at least the glass screen. When I broke mine and called Lenovo, because I didn't have a protection plan, the replacement glass alone was $200, and I only paid $300 for it... hardly worth it. You can pretty much only use self-powered hard drives with this thing. This isn't as popular as the iPad so there aren't quite as many accessories available. Had a hard time finding a good case that wasn't pink or purple :(  The Windows Store is a lot sparser than the Android store, or the Apple store... but there are quite a few apps there, and Microsoft has released a free tool (Project Siena) to allow people to create apps easily.Bottom Line:When my original one broke... I saved up to get a second one... with accidental damage plan. I tried a Dell Venue Pro 8, and I wasn't happy with it. This is definitely my favorite tablet. Get it if you want/need Windows apps and you want portability. Definitely get a decent case to protect it, along with an accidental damage protection plan.", "Date": "February 12, 2014"}, {"Title": "Terrible", "Author": "Lucy", "ReviewID": "R2QKJA9LMGO7U1", "Overall": "1.0", "Content": "So frustrated with this due to a bunch of bugs. It froze a few times while I was doing something so I had to do a hard shutdown but 3 freezes in 14 days was forgivable. What is not forgivable is that EVERY day when putting it to sleep or shutting it down it would freeze. Putting it to sleep makes no sense because it would drain about 10% battery per hour...sometimes it would wake up from sleep without needing to do a hard shutdown but is not worth using unless I was coming back to it in 30 minutes to an hour. Shutting down would not drain the battery IF it shut down correctly. When it shut down correctly it would take about 5 seconds to restart which was great. Half the time you would think it was shut down though but it wasn't and it would drain the battery at an alarming rate. Last night I shut it down at 95% battery and when I woke up it was totally dead. I had to plug it in to start it and the battery was 1%. I've googled this and many others have had the same issues. I tried some supposed fixes by changing the Wi-Fi settings but it did not work. I wanted so much for this to work out. It is pretty nice and if not for these simple issues it would be a keeper. Would be four stars if not for these ridiculous issues. I could just do a hard shut down for the life of the tablet by holding the power button down for 10 seconds but no. The windows sleep and shutdown options should work.", "Date": "March 30, 2014"}, {"Title": "Needs to buy the 64GB version", "Author": "Supertronic \"Sotti\"", "ReviewID": "R3USQ5E94H7AN4", "Overall": "3.0", "Content": "After updates it has 5GB of space left.  4 stars if the partition didn't show up as 23GB with 18GB used by the system after updates.  Everything else is pretty slick about this tablet, especially for the price.  Touch is fluid.  Does not feel slow or laggy.Other than the space, the other drawback is the build quality/feel.  Obviously it is a slab of glass on the front, and while the miix 2 8 does not feel cheap, I prefer the fit/finish of something like the Nexus 7.  The mix of materials on the miix is a little odd.  The lenovo logo on the back raised and is kind of abbrasive on your finger tips.  I instantly wanted a case on the thing.But again, for the price it is pretty cool.", "Date": "March 29, 2014"}, {"Title": "Love it!", "Author": "Ted \"tsfine\"", "ReviewID": "R2ZIS68L7LRZT3", "Overall": "5.0", "Content": "FINALLY!!! A pad worthy of displacing anything else on the market. I have both this pad and the yoga 13 and am becoming a real fan of Lenovo products.", "Date": "February 17, 2014"}, {"Title": "Great little tablet", "Author": "The Devil's Advocate", "ReviewID": "R3MY7LCQF1ICGG", "Overall": "5.0", "Content": "I have an Android phone and a tablet but this thing was priced so good I just had to try the latest Windows and I'm glad I did. Battery life is about as good as an Android tablet but this does so much more. I am able to connect to my company's VPN and use internal Web sites and apps, can't do that with Android. It's so slim and light, on the order of an iPad Air, you can pretty much carry it everywhere. Screen is very nice although sometimes doesn't respond to touches. Apps are good and getting better, plus you can use all your desktop applications, no need to compromise. If I had to do it all over again, I'd still buy it.", "Date": "February 3, 2014"}, {"Title": "Great Tablet for Productivity and Internet", "Author": "Dbur1000", "ReviewID": "R3LR8VZNAZBLKK", "Overall": "5.0", "Content": "Well built windows tablet option. Windows 8.1 requires a learning curve, but highly functional after learning the tricks. The bay trials Intel chip is amazing. Screen also good. Great tablet as long as you aren't looking to play silly phone style games from app store.", "Date": "February 2, 2014"}, {"Title": "Love at first sight", "Author": "Amazon Customer \"John\"", "ReviewID": "R2GS0P74FFZUHL", "Overall": "5.0", "Content": "I hesitated switching to Windows 8.1 but when I got my new laptop, I realized I was wrong. Then I found out that the tablet runs full windows 8.1 with Microsoft Office and all the apps and settings I know so well. When I received this tablet, I was thrilled with the look and feel of it. This hard core Android user has now become a Windows fan. I'm even going to order a Windows phone now - I want all my tech to match and Windows is it for me. This Lenovo tablet is first rate - you won't be sorry.", "Date": "January 21, 2014"}, {"Title": "A tiny powerhouse that rivals the utility of a netbook or lower end laptop", "Author": "Amazon Customer \"Ann Jacobs\"", "ReviewID": "R128OQQDOM4QMM", "Overall": "5.0", "Content": "Lenovo Miix2 8 is a powerful little computer, with more features than my Netbook, as many as my older laptop and enough juice to do things I routinely do on my big Windows 7 desktop system.It’s very lightweight and works well either a fingertip or a capacitive stylus, which did not come with it as I passed on the case/stylus combo. I am now using it with a Zagg universal Bluetooth keyboard—no difficulty at all in pairing devices.As for the screen, I find it clear and bright—comparable with my Sony smartphone and better than any I’ve seen on an Android tablet of any size.In the few days since it arrived, I have had time only to check out basics—no photos or video taking yet, but I usually use the Smartphone for that anyway since it has higher resolution. I haven’t inserted a micro-SD card into it either but can’t imagine that will pose any problems since everything else works as advertised.I highly recommend the Miix2 8 for anybody who wants to surf the net on WiFI, do light work on documents without being tethered to a large desktop system and handle email conveniently.One last thing: this little powerhouse comes with Office 365 preloaded and licensed—a significant bonus when you think about the cost of buying or renting this software separately!", "Date": "January 18, 2014"}, {"Title": "very good!!!", "Author": "JeongHa Lee", "ReviewID": "R34B49SWS86KKI", "Overall": "4.0", "Content": "It is very good. It is easy to operate and very fashionable shape.  The size is also reasonable.I am very happy to use it.", "Date": "January 13, 2014"}, {"Title": "Bad Customer Service", "Author": "Robert Burghart", "ReviewID": "R2VN2J2RKPQN5K", "Overall": "2.0", "Content": "I bought the Miix 2 8 when Best Buy had it on sale. I received it last week. I was able to get it started up, create accounts and update software via wifi. When I plugged it in to my work PC the work computer did not recognize it, neither did my home computer. I called Lenovo. They had me check the obvious stuff, like changing cables, trying different computers, etc. That was it.I also did a factory reset in case something was set up wrong in the initial startup. They didn't even suggest trying that.  After that they said in order to receive support I had to pay $60. The computer was less than a week old they shouldn't be trying to charge me for service already. I took it back. They offered a replacement, but I'm not going to buy anything from Lenovo anymore.", "Date": "March 17, 2014"}, {"Title": "Awesome Tablet", "Author": "PatrickG", "ReviewID": "RZGG6GYY1T0H7", "Overall": "4.0", "Content": "Performance improved when I uninstalled the McAfee AV and updated drivers.  I love having a PC in a tablet platform Windows 8.1 is a good operating system on a touch screen.  Don't make the mistake of complaining about Windows 8.1 without taking the time to learn how to use it.  Rated it 4 stars because it does not have HDMI out port.", "Date": "February 28, 2014"}, {"Title": "Amazing... for one month", "Author": "Gustavo A. Silva \"Gustavo Almeida\"", "ReviewID": "RCEVZJH4P6IXA", "Overall": "1.0", "Content": "The little tablet is amazing in general. Powerful, quick, light, the cover fits pretty nice.However after one month the touchscreen started presenting failures; it simply turns off and I need a mouse to use it. It becomes useless for me. I tried restoring back to factory settings, a hard reset a few times, and problem always comes back. Sometimes it starts working again when I connect the mouse, sometimes I just need to remove the HID devices from Device Manager and scan for hardware changes to have it working again.All these actions need a mouse so if I have the tablet with me in a meeting the only solution is to force turn off and turn on again until it works. This makes the tablet useless for me when I really need it. Since I brought it to Brazil it's harder to send for service, however if I decide to do I need to CALL Lenovo because I couldn't find any web or email support. Even my Sphero I managed to get in contact through email but Lenovo does not seem to offer this type of support...", "Date": "February 2, 2014"}, {"Title": "Perfect device for me to read songs' lyrics while on stage", "Author": "LONG T NGUYEN", "ReviewID": "R2D3C5ECQAPJQ7", "Overall": "4.0", "Content": "Speedy delivery from Amazon.  Lenevo tablet is good, it's fast, easy to use, easy to connect to my wireless router, easy to share files with my other computers.  Shutdown and boot up very fast and short.", "Date": "December 20, 2013"}, {"Title": "Great as a back up computer", "Author": "Laura H", "ReviewID": "R2SQ3WQESDNBB6", "Overall": "5.0", "Content": "I use this tablet instead of carrying my laptop around.  It fits perfectly in my purse.  I'm so glad I finally purchased one, and this one was the best product for the money.", "Date": "June 2, 2014"}, {"Title": "Lenovo Miix 2 8-inch Quick Start Tablet w/IBM assured quality still in play.", "Author": "Oscar", "ReviewID": "RF3U79EKR588J", "Overall": "5.0", "Content": "I love it! I've been waiting so long for a Windows 8.1 full featured (for me at least) moderate sized tablet in the $300 price range. I can now use the full featured desktop version of Think or Swim (TOS). I recommend a stylus for those with \"thick fingers\" like me (keeps the screen clean, too) - especially if you use TOS.It's the best of both worlds with the desktop for apps like TOS, my old MS Office 2007 and the \"Metro\" tiles that have exposed me to so many informative news, free TV, and Xbox games.I'm a Lenovo fan since, to me, it's still IBM quality. I can't believe how Lenovo has solved the slow start-up - I barely have time to face the camera for the facial recognition log on. Even the power cord is thicker than that of my Android tablet - another carryover of IBM assured quality.", "Date": "May 28, 2014"}, {"Title": "Great hardware, great price.", "Author": "Paul", "ReviewID": "R1B65EGDPYDMHR", "Overall": "5.0", "Content": "I was mildly apprehensive on this purchase but was pleasantly surprised.  This replaced my ipad mini.  My only complaints are that the power-switch is too sensitive and I have to be careful not to put it in my back-pocket the wrong way or the device will shut down.  I also can't install Visual Studio Premium on it because the primary drive is just too small for that application.  Another 20G and the device would have been a perfect PC replacement.", "Date": "May 26, 2014"}, {"Title": "Good but...", "Author": "KAKI", "ReviewID": "R3I5NPD8VSD4Y5", "Overall": "3.0", "Content": "The device is pretty but it crashes continuously, the WiFi signal is really bad compared with phones and other tablets", "Date": "May 25, 2014"}, {"Title": "Don't bother with the 32GB version", "Author": "instantfob", "ReviewID": "R12R233O3ZVSZH", "Overall": "2.0", "Content": "Everything is great with this tablet if you can run everything over Citrix or Chrome.Once you catch up with the windows/office updates you will find your tablet left with less than 3GB of free space.  I even have to install office on the microSD to keep this tablet usable.", "Date": "May 21, 2014"}, {"Title": "pretty decent", "Author": "Charleston", "ReviewID": "RCH4N49XYWTLW", "Overall": "5.0", "Content": "Pros: *FULL DESKTOP OS experience  *Battery life lasts an entire day on basic browsing, typing documents, some youtube videos  *Free Microsoft Office product key  *SSD 64 gb flash drive is very quick and boots up less than 10 seconds.  *Not bad Intel core processor, i was able to do open multiple internet explorer windows on desktop mode and a few apps openCons: *64 gb SSD is too small, i only had 48 gb due to lenovos built in apps and the window OS itself takes up space in the backround. I have 29 gb left after installing some of my basic programs like firefox,microsoft office,etc. ( DO NOT GET THE 32 gb version, ON ALL TABLETS, ULL REGRET IT)  *No Hdmi or USB port, (it only has a micro USB port so ull have to spend more for a adapter or a flash drive that has micro usb)Otherwise i think its a good for someone who's looking for their first tablet, and IT COMES WITH A FREE MICROSOFT OFFICE KEY!!!... I do not like windows 8.1 which comes with this device, but it is not that bad OS for a tablet like this. (this shouldnt be your main computer, more like a side computer u can take to work/class.", "Date": "May 18, 2014"}, {"Title": "Why I like this tablet", "Author": "Samuel Warren", "ReviewID": "R1SCGKZTB53668", "Overall": "5.0", "Content": "Let's see. $225 dollars for a fast fully working tablet computer. Running Windows 8.1 with a full desktop. Sold.Lenovo's build quality is great on this machine. It fits comfortably in your hand, and works well. 8 inches is a bit small for desktop mode, but in a pinch it's available which is nice. A usb mouse helps a lot!This brings me to my biggest reason why I chose this. I would like to be able to use USB while charging. From everything I read on the Dell Venue Pro, there's a special adapter box with a switch on it that you can get for $40. Lenovo just makes this work. I purchased a cheap cable (this one actually) http://www.amazon.com/gp/product/B009YPYORM/ref=oh_details_o00_s00_i01?ie=UTF8&psc;=1 and it worked like a charm. this is the kind of build quality you get with Lenovo.", "Date": "May 14, 2014"}, {"Title": "So far so good", "Author": "Richard", "ReviewID": "R10FSNGH3BRFS9", "Overall": "5.0", "Content": "Used for more than two weeks, everything is fine, no lag and the battery is durable. The only complaint is toooooo few apps available on Microsoft Market", "Date": "May 11, 2014"}, {"Title": "best ever", "Author": "Mary Schnoor \"ducky\"", "ReviewID": "R3J7ER8B31WUZ9", "Overall": "5.0", "Content": "This is the best laptop/tablet they could have ever made.  I will probably get one for myself soon since this one is my daughters.", "Date": "January 30, 2014"}, {"Title": "Perfect little tablet", "Author": "Kim Duncan", "ReviewID": "RYCFFTYLGOX77", "Overall": "5.0", "Content": "Perfect little tablet so fast and good for the train ride to and from work.Much better than the ideapad 10\" with the atom z2740 CPU.", "Date": "January 27, 2014"}, {"Title": "A good introduction for Win8 touch, but...", "Author": "greatlegs", "ReviewID": "RS5FB8X10ZT03", "Overall": "3.0", "Content": "I was an early adopter of this, and I've been using it now for 2 months (since mid-Nov 2013).  Here are some comments:1.  This is my first use of Win8 (actually, Win8.1) with a touchscreen.  I can see the usefulness of using Win8 this way.  On a laptop or desktop, I find it much easier to use Win7.2.  I am disappointed so far in Lenovo's support of this tablet.  If you go to their website and look up \"parts\" or other service info for the Mixx2 8, you will find VERY little information.  I am trying to work thru a problem with WiFi on my unit.  Device Manager says that the WiFi system is by Broadcom, and the driver that is installed is from Broadcom.  But the Lenovo website says that the WiFi system is by \"Hiking\" and they provide a driver for it.  I'm very confused and don't know what to do. But, if you've ever owned any \"Think\" product, you'll know and appreciate that IBM/Lenovo has always made it very easy to find and install updates and firmware for your device, using System Update.  At least so far, there is no similar service for this tablet, and so it is very difficult to find an install updates.3.  Along the lines of #2, above - there is no forum that I've found to communicate with the company or other owners about this issue.  And Lenovo has on their website addresses or numbers to deal with questions about \"Think\" or \"Idea\" branded products, but there is nothing to indicate where the Mixx fits in.  Frustrating.4.  Using an 8\" tablet to work with Windows programs is difficult.  I use a program called Multiplay, in which you have to use the program's icons.  To touch an icon on an 8\" screen is very difficult.  I use the stylus that came with my flip cover, but it's not as good as using the touchpad on a laptop.5.  Typing on the screen is much better than I thought it would be.  Navigation is good.  The system is very responsive.6.  WiFi so far is not very reliable.  On networks at work or my home network, sometimes I'm able to connect with no problems and other times I'm not able to connect at all.  I find that changing the WiFi driver from \"Broadcom\" to the \"Microsoft\" helps.  Why it keeps changing back to \"Broadcom\" is a mystery.  Again, I wish I could discuss this on a forum, but I can't find one.7.  I feel VERY limited by not having a SIM card for this unit.  For this tablet, which I got when it was first released, there was no SIM option available - only WiFi.  If I had the choice, I would DEFINITELY get the SIM option.  I don't know if newer Miix tablets are offered with SIM, but if they are, I would recommend that.  I'm GUESSING that the Thinkpad version of this tablet (which I read about in one of these reviews/comments) will offer that option, and I'd think I would be happier with that one.8.  In conclusion, I think that this tablet is good as to see what Win8 in a touch environment can do.  But I'm not able to reliably get any real work done with it, I'm disappointed in Lenovo's website support (so far), and I think the \"Thinkpad version\" of this tablet would make a better choice for anything more than media consumption (reading or videos or games).  For now, I'm still happiest with my X220 Thinkpad, after using an iPad with ClamCase Pro and a Galaxy Note 2 and the Miix2 8\".", "Date": "January 23, 2014"}, {"Title": "Already obsolete - await ThinkPad 8 - end of January 2014", "Author": "anonymous", "ReviewID": "R15SVZYQS5Z63C", "Overall": "3.0", "Content": "As with any technology as soon as you receive something it is already obsolete - particularly true in this case as Lenovo is slated to start shipping the ThinkPad 8 with an 8.3 screen, a faster processor, optional keyboard/case and most importantly a micro-HDMI port at the end of January 2014.Attention: GPS on the ThinkPad 8 will only come with the 3g/4g/LTE models due out later.Someone has written that both the Lenovo Miix 2 8 and the Dell Venue Pro 8 are just toys without HDMI output. I agree. Whilst you can purchase honest third party solutions Plugable UGA-2K-A USB 2.0 to VGA/DVI/HDMI Adapter for Windows, Multiple Monitors up to 2048x1152 / 1920x1080 Each (DisplayLink DL-195 Chipset)to connect to external monitors for less rigorous application use: Excel, Word -  you cannot just arrive at the clients to do a PowerPoint presentation, a short video and plug in and go. No way of hooking up without the extra device and that has limited throughput. You then arrive home and wish to dock into your monitor to watch youtube, 007 or what-have-you - no go.Minuses:lack of HDMI port - Miricast solution not widely produced, not reliable and so not ready for prime-timeindustry-wide failure to communicate and develop around the new Microsoft Location Platform necessitating an inexpensive third party solution [centrafuse localizer] which despite the genius behind the development cannot fix MS Tripsonly one USB port: use it for charging or a USB key but not both at the same timethe USB port does not power my little portable Samsung 1 TB drive (USB3)even for a quick file transferlack of quality keyboard/case which works as a unitno Wacom input (yes, at this price?)Pluses:Full Windows 8 is very fast even on lesser processors. On this one it screams. It also runs everything.Full version of MS Office Home and Student includedIN summary the proof of concept is there. Once the solution comes fully together there is no stopping it from dominating the market. Yo! Lenovo, Dell, Samsung and others! Think: \"4 or 5 inch telephone with the ThinkPad 8 specs! Full Windows 8 not RT.\"", "Date": "January 22, 2014"}, {"Title": "amazing product but......", "Author": "mark reese", "ReviewID": "R2M5UKR6A6K9U0", "Overall": "4.0", "Content": "I love love love love this tablet aka personal computer! I love that it has full windows which means I can install apps A.K.A software like iTunes on tablet. But I have to give this 4 stars only because there is only about 10 GB left for apps and other things like music and video, which is a very small amount of room especially for full windows software. I am going to send this tablet back and look for a 64gb tablet. If you are even considering installing iTunes you should consider getting a windows 8.1 tablet with more room. Again this is an awesome tablet. It is in my opinion much better than dell venue pro, only because of the windows button on the front instead of side and longer battery life. The one thing that is worse on this tablet is the speakers and the screen is slight worse on this but barely noticeable side by side. Again just for the windows button on the front this is the best buy for a windows user on a budget.", "Date": "January 19, 2014"}, {"Title": "Faulty Product", "Author": "Roger E Smay", "ReviewID": "R1ZB9JDUKWZPLR", "Overall": "2.0", "Content": "The tablet shuts itself down and won't restart easily.....lack of instructions come with product...wouldn't buy this brand again...very disappointed with overall package", "Date": "January 13, 2014"}, {"Title": "Nice and easy", "Author": "Terry Miguel Mendez", "ReviewID": "RL9FNEZOM7H7", "Overall": "5.0", "Content": "Good product, easy to handle and take anywhere you go. Windows system makes it easy to operate. Just one hitch, needed to contact Microsoft in order to activate Office.", "Date": "January 13, 2014"}, {"Title": "Good tablet, barely adequate camera", "Author": "Pocktpoker", "ReviewID": "R3CIRD0P5IYLU5", "Overall": "4.0", "Content": "I've had this tablet nearly a month and like it quite well.As far as the physical object, I feel like the volume buttons should be reversed, and I don't particularly care for the camera's more portrait friendly position.  The vibration of the windows button had me worried for a bit, but, from reading other websites, I learned that it was normal.  My biggest pet peeve is in the bottom paragraph.Software-wise there didn't seem to be much in the way of crapware.  There is a Lenovo app store and a user manual, but that is about all that I saw.  I saw in the faq that this tablet comes with an activation code for office.  I didn't install office right away, so if I have the card, I forgot that I had it when I went to install it (luckily I'm at school so they were able to give me a version).My biggest pet peeve is the camera.  I bought my mother a Blackberry Playbook, and was sorely disappointed to find out that my supposed 8mp  (which the Lenovo site says is actually a 5mp) camera takes lower quality photos than the playbook's 5mp camera.  One of the greatest selling points for me in choosing this tablet over the Dell was the higher quality camera.  Since my disappointment, I have learned that megapixels do not matter as much as aperture (which conveniently isn't included in most specs listings).  Aperture is not something that can be adjusted on tablets and smart phones.", "Date": "January 10, 2014"}, {"Title": "Finally real competition for my iPad", "Author": "C. Jones", "ReviewID": "R2CV4TV4OM51I3", "Overall": "4.0", "Content": "First windows tablet I've tried with a comparable user experience to an iPad. Windows 8.1 is a real step up once you realize the tiles are a graphical version of your start menu. I find myself going to the desktop less and less. I like the ability to resize the tiles to utilize the screen space more effectively. Battery life is less than I was expecting and there is a glitch every once in a while when it goes into sleep mode. Looking forward to some accessories like covers, keyboards, and a USB port adapter that doesn't stress the case.", "Date": "January 10, 2014"}, {"Title": "very good Lenovo Tablet.", "Author": "MuayThaiGermanFighter \"MuayThaiGermanFighter\"", "ReviewID": "RZVTOHFCZ3CL1", "Overall": "4.0", "Content": "i had bought it from Bestbuy for 299.99.i think this tablet has alot to offer.i only bought it for work.but as well  i do surveys and foucsgroups online daily for my second job.i only had it for few days so i cant go into full details.let me tell you what i like about it1.it is fast,once i hit on anything it respond right away.(i guess it will depend on how fast ur internet is)2.the battery life is better than the dell tablet and others tablets that i had owned.my last about 7-9 hours (depends on the brightness and how many apps are running)3.the way it look.it very nice little better the dell i think.it very slim and smooth.it is well made and build,of course it is not perfect but what is perfect?what i dont like about it1.there is no keyboard for this tablet,i looked online and in every store about.2.some words are small and that bug me alot but you can always make it bigger if you wish when u double tap it.even you do that it still be small at times.what i had done instead of a keyboardfor work on the tabet i had to do things as move things into a box or put words into a box.but it wont let me do it at all with a tablet pen nor a the fingerafter looking for days for a keyboard i had bought a bluetooth mouse and it work perfect now i can place things anywhere i want on this tablet. i had bought  the (Surface wedge touch mouse)in bestbuy they wanted $70.i check amazon and it was $34 so bestbuy match the price for $34....be sure to tell and show them what u saw on amazon and they will match the same price.", "Date": "December 29, 2013"}, {"Title": "Full Windows", "Author": "Peter De Wilde", "ReviewID": "R3DVTDFGZSBDX1", "Overall": "5.0", "Content": "Fully functional Windows tablet at a sharp price !The possiblility to run all applications in the kind of device is game changing.", "Date": "December 29, 2013"}, {"Title": "Great Windows 8.1 Device", "Author": "David M Carroll", "ReviewID": "R2JH2OF9JA1YDS", "Overall": "5.0", "Content": "I had been waiting for the Lenovo for a while. I've had good luck with the company since they bought the devices division from IBM.The Miix2 is a great, lightweight device that does all I need. While I wish it had LTE for portability, the WiFi works well in most environments. It supports 5Ghz so it will connect to many modern access points.I can do quite a bit on it. I use it as my backup device when I visit customers for work because of the size of the tablet. Being a full 8.1 device, it runs all our core applications without issues. I can plug it into a USB port replicator and power multiple monitors. It runs a full version of Windows which means Office 365 with a full Outlook client if I want.  OneNote synched to Skydrive Pro and Skydrive help me keep work and school synchronized while on the go. I watched TRON:Legacy on Amazon Prime last night through the browser with no issues.For $299, with a Quad-Core Bay Trail CPU it's all I could ask for from a tablet.  As an owner of a Nokia Lumia 920, this device and my Lumia allow me to stay connected and productive no matter where I am.", "Date": "December 20, 2013"}, {"Title": "Lenovo has the worst service I have ever encountered!", "Author": "Lyn Wall", "ReviewID": "R1K2Z0SGZZK3B9", "Overall": "1.0", "Content": "I dropped my Miix and cracked the screen. I spent $80 to send it in for repairs. It took them 5 days and hours on the phone to get them to acknowledge receipt of the unit once UPS verified delivery. When they finally did, the wanted to charge me $305 to replace the screen. I will never buy another Lenovo product.", "Date": "March 19, 2014"}, {"Title": "Lenovo IdeaTab Miix2 8-Inch 32 GB Tablet", "Author": "William Busto", "ReviewID": "R3NHNPF10GE9JT", "Overall": "5.0", "Content": "The tablet works just like my full size Windows PC. It's great to take on a trip. I attached a USB mouse and USB keyboard to a powered USB Hub (Gear Head UH5500ESP USB 2.0 Hub, 4 Ports, AC Power Adapter included.) available here at Amazon. It's important to get a powered USB Hub because the tablet's Micro USB port doesn't have power. I also needed from Amazon: a USB Micro B (Male) to USB A (Female) Adapter to connect the USB Hub to the tablet. With this setup, the tablet is being charged while I work with the mouse and keyboard. I can also plug in a memory stick. MS Office is up and running on the tablet, which I need when I go on the road. This Lenovo tablet has met all my expectations.", "Date": "May 13, 2014"}, {"Title": "Fantastic tablet for the money", "Author": "brandon schlichter", "ReviewID": "R2HEKA8LFZ5QN3", "Overall": "5.0", "Content": "This is the 4th or 5th tablet I've had, and the first one that runs Windows.Up until this point the past tablets have been either Apple or Android. While both were 'good' , they never could replace the laptop I have because the software I could find for IOS and Android were never really that productive. With this tablet, I can get all my normal workload done while being completely mobile. Add in the fact that the tablet is the same price as comparable Android offerings and well under Ipads, it makes this an absolute no-brainer.The tablet comes pre-loaded with Office which is $139 by itself, and is the big reason I went with this over the Dell Venue. Both spec-wise are similar with the Venue edging out this one in specs, but for me the $139 savings on office was more than worth picking this over the Dell. It's light, the battery lasts over 8hrs on a charge (I have my brightness down halfway) , and you use REAL COMPUTER PROGRAMS ON IT. Not the 'light' crap they're offering on android/ios, but stuff you'll actually use. The lack of a GPS sucks, but since it's REAL COMPUTER finding a USB GPS device and getting the driver will be pretty easy.So, pros -Real computerGood battery lifeLightweightHas officeCheap for what you getConsNo GPSSo, definitely 5 out of 5 stars for me.", "Date": "March 14, 2014"}, {"Title": "Favorite tablet", "Author": "Constantin Munteanu", "ReviewID": "R2ZS8JWRQWTO5O", "Overall": "5.0", "Content": "After debating between dell venue 8 pro and miix 2 for a while i went with miix 2. I found a brand new one on ebay for $210.The major point for deciding was that dell didn't support external hard drives, otherwise both are pretty similar.  I previously had a android sony z tablet which didn't do multitasking well. I will probably never going to buy android tablets again, they are nice but have limited functionality and most of their apps are a child's play compared to windows software.The new quad-core atom processor in both dell and lenovo tablets provides for the first time decent performance and low power consumption: 2w versus 17w (i5,i7 processor tablets).Pros:more than enough performanceBright Screenbattery 8 hours testedslim designFree desktop like microsoft officewindows 8.1miracastmultitaskingCons:You may need a stylus pen for internet explorer if you got big fingersno hdmino micro usb to usb adapter includedsound is weak", "Date": "February 13, 2014"}, {"Title": "good thing", "Author": "Aldo", "ReviewID": "R36RWE7GQTVA19", "Overall": "4.0", "Content": "It is, has multiples functions right size and excellent resolution, in pictures and videos; it has all an android staffs. I recommend this device.", "Date": "December 31, 2013"}, {"Title": "Great Tablet _ worth the price$$_Dell not so worth it", "Author": "Tech Man", "ReviewID": "RPD6KIRGW5LQF", "Overall": "4.0", "Content": "I have seen reviews on this tablet that compare it with the Dell Venue 8 and I say there is no comparison when it comes to which is better. Come on the Dell 8 has no home button to start its misplaced if you ask me the Lenovo Mix 8 has the right approach in design in regards to placement. THE comments on speaker sound who cares? This tablet in this form factor was never intended to be high fidelity device, for me the sound is adequate and does the job for the size.  The screen in terms of brightness blows the dell away, I was able to compare them at my local Frys electronic store.  I was actually looking to purchase the Dell 8 but when I saw the Lenovo was available and had the same specs and price I went with the Lenovo.  The design is much more sleek I like the silver back which to me has more of a professional appeal.As for performance no issues the new bay trail processor does well for Office (Word, Excel, PP...etc).  I even run iTunes and it performs just as well as my 4th Gen iPad.I haven't tested battery life yet but I assume it will go as long as the reviews that are out there.(7hrs). Not bad... remember this little guy runs full Windows8 that's awesome if you ask me. It does the productivity work I need it do and its geea", "Date": "December 20, 2013"}, {"Title": "Ambivalent", "Author": "Robert Hupp", "ReviewID": "R7QA4GGJO07XD", "Overall": "3.0", "Content": "I bought this tablet to have something to play with Windows 8 on.  I do IT support for a living and eventually I'm going to have to deal with Windows 8 so I needed an inexpensive device to learn it on.  I've been using the iPad since they first came out and my go-to tablet is currently an iPad mini.  That is inevitably going to color my opinion of this device.  I'm going to limit my comments here to the tablet itself not windows 8 as I am new to the OS and am having the expected learning curve.Build Quality:  Nowhere near iPad quality.  The back is covered with stickers.  The most important of them is the one containing the Lenovo product information and serial number.  Guess which one is starting to peel off after less than a week.  Right! The Lenovo sticker.  There is a bit of give on the left side of the tablet about 1/3 of the way up from the bottom where it feels as though the back has warped a bit and isn't quite seated against either the display or the other components.  It cheapens the feel of the tablet but doesn't affect anything else.  The microSD card slot doesn't seem to latch to the SD card properly and the card will randomly disconnect from the computer. Reseating the SD card fixes the problem until next time.  The buttons on the right side are easily found and have sufficient feel that you know that they have been pressed without requiring enough force to be irritating.  The capacitive windows button on the lower front engages positively.  I haven't had very many accidental presses of it which is better than I expected.  The sound is terrible without headphones and fine with them.  This isn't a major issue for me; if you need great speakers, look elsewhere.Performance:  I'm actually quite pleased.  I was expecting rather sluggish performance and the tablet surprises me.  It does what I typically use a tablet for only slightly slower than my iPad mini (old version) and hasn't been an issue with anything I typically use a tablet for.Issues:  The biggest issue I've run into is the failure to wake-up from the sleep state.  When I'm using a tablet for something I need to grab it and use it.  On both my iPad and the Android tablets I've used, this isn't a problem.  Press a button, swipe, enter your PIN or whatever your are using to lock the tablet and go.  The same is true here if the tablet hasn't been asleep for a couple of hours at a time.  Then, it is a case of grab the tablet, press the windows key (nothing); try again (nothing); hold power button down for 10 seconds to power the tablet off. (Note that there is no feedback to indicate the tablet is off or still asleep.)  Release the power button.  Press the power button for a second or two until the Lenovo logo comes up and the tablet boots.  The boot is quite fast but by the time I've gone through this I could have done what I needed on any Android tablet or iPad and gone on to something else.  This is a MAJOR issue for me.  On the iPad, the only time I ever power it off is during an IOS update.  On the Lenovo, I've had to forcibly shut down two and three times a day either to recover from a no-wake-up condition or a random freeze.Apps:  I'm not going to dwell on this as it isn't a Lenovo issue; it's generic to Windows 8.  I have been able to find all the apps that I needed although they seem to be less well thought out than either the Android or IOS versions.  There are some glaring exceptions; Amazon instant video for example; but, for the most part I can do with this tablet the same things I frequently use on my iPad.As I said at the beginning, I bought this as a learning tool and it is useful for that.  If I had to use this as my only tablet in a production environment, I'm not sure that I could.", "Date": "December 10, 2013"}, {"Title": "Both Lenovo and Dell have Bluetooth Audio issues and Lenovo inferior WiFi", "Author": "Samuel J \"iNetSynch\"", "ReviewID": "R3OSTJQOVBVI9B", "Overall": "2.0", "Content": "I had previously tried the Dell Venue Pro 8 and returned it after Bluetooth audio stopped working correctly and the screen continued to occasionally boot to black after signing in. The Lenovo Miix not only had issues with all three of my Bluetooth audio headsets it did not show all supported Bluetooth services in the audio options window.When I first paired with our LG700 and LG730 Bluetooth headsets, Xbox music seemed to stream fine using the Stereo Headset service. After another hand full of updates the Stereo option was replaced with a generic Bluetooth headphone audio option that would frequently pause as audio was streamed. Occasionally, the audio option would reset to Bluetooth hands free headset service known for its horrid audio quality when listening to music. I was forced to manually reset to the generic Bluetooth headphone service to get decent stereo audio. All of our Bluetooth devices work as expected with the Asus RT and Acer W500 tablets.I noticed I was only getting one to two bars while in my bedroom which is the room most distant from the router. Down load and upload speeds were 1/3 to 2/3 respectively of that seen on my Asus RT and Acer W500 tablets. The Acer is running Windows 8.1 and the Asus RT 8.0.I do not understand what is happening with Bluetooth audio and the newer Windows devices. Certainly, I cannot be the only customer using quality Bluetooth headsets to listen to music on Windows 8 and RT machines.The Dell is resetting as I type so it can be returned. If the Wi-Fi had not been so poor, I might have spent time trying to ferret out the Bluetooth audio issues.The Lenovo is lighter than the Dell but the raised logo on the back can be felt while holding the Lenovo and is a distraction. The Dell had a better overall feel while holding.Lenovo ships with more crapware apps. Speaking of ... it also ships with a trial version of MacAfee. As usual, I was not sure it had been totally removed when \"uninstalled.\" Come on vendors the days of shipping with Norton or MacAfee should be over!Dell audio is louder and better when used without a headset.Be prepared for update hell after unboxing the Lenovo. As a seasoned Windows user, I expect updates but the Lenovo ships with a few of its own that are a pain to install.The Dell built-in microphone was better for untrained Speech to Text control and dictation. I had to train the Lenovo before I could use Speech to control the device and accurately dictate. The Dell responded well without training.Rear camera for both Dell and Lenovo were poor. In contrast the Asus rear camera is good and has an LED flash (unless you disable it updating to Windows 8.1)As someone using both Windows 8.1 pro and Windows RT 8.0 tablets, I prefer the Windows RT experience. Windows 8.1 pro on my desktops yes but Windows RT offers a better tablet experience for me. Windows RT means fewer updates, fewer worries about manufacturer delivery of driver updates, and far fewer worries about catching a nasty Virus. I know I may be in the minority re. my fondness for Windows RT on tablets but do not need full Windows when using a tablet. Give me a few Metro apps (like Music, News and Slapdash), Office, good built-in mic, Microsoft Speech to Text and I'm good to go.", "Date": "December 4, 2013"}, {"Title": "Windows 8 Sucks! Froze 3 times in one day", "Author": "The Fifth Ocean", "ReviewID": "R30MQ9QCGOQ3YB", "Overall": "1.0", "Content": "It froze three times within the first day doing some tasks that supposed to be a breeze on the iPad. It was very hot when I left it frozen because it was not working.", "Date": "May 5, 2014"}, {"Title": "Defective product", "Author": "Giselle De Beche", "ReviewID": "R1A0EO97OYTGEM", "Overall": "2.0", "Content": "I received a defective product from this seller.  The wifi on my device barely worked.  I would have to be less than 10 feet away from the router to receive a decent signal.  The exact same devices at best buy were able to connect but mine wasn't.  Everything my tech savvy friend tried to find the problem seemed to point to a hardware issue.  I assume my tablet must have gotten bumped around on the way over to me.If my tablet could have been able to connect to the wifi I would say that I loved this tablet (which is the only reason this seller is not receiving a 1 from me), but it's pretty hard to ignore the wifi issue.This is the first and last time I buy electronics online...", "Date": "April 29, 2014"}, {"Title": "Information", "Author": "Esteban Jimenez B", "ReviewID": "R1273MY9V7GR2X", "Overall": "5.0", "Content": "good afternoon you can do to sending me a box to miami much interested in this tablet.to costa ricathanks", "Date": "April 12, 2014"}, {"Title": "It would be great if the wifi and bluetooth connectivity actually worked", "Author": "Alisa L.", "ReviewID": "R1219D5KJBF1NL", "Overall": "1.0", "Content": "I really want to love this device. I researched long and hard for a lightweight, portable full windows device that runs Microsoft Office and doesn't break the bank. I mostly need it for internet access (who doesn't these days???), especially to access Google Drive for work. Unfortunately, that exactly the bit that doesn't work. It took me a full three days to finally successfully connect the device to the internet, only to have it disconnect again on sleep. I've tried everything (updated/uninstalled/reinstalled drivers, run through the whole troubleshooting menu, turn it off and on, etc.) and nothing works. In fact, when I turn on the wireless network connection, it just turns itself back off again for no reason. Also, bluetooth won't detect my bluetooth keyboard anymore. I don't have hours to waste looking up help forums and fiddling with this machine to get it to do the basic task of connecting to a wireless signal that works with every other device in my house. I would have liked this tablet otherwise, but what's the point of having a tablet if you can't even get online? It's going to be a pain in the behind since I am currently abroad, but I'm going to have to return this to Amazon. Very disappointed.", "Date": "March 12, 2014"}, {"Title": "Review", "Author": "Michelle R. Calvert", "ReviewID": "R3PWOG6RSX5HQ4", "Overall": "5.0", "Content": "Gift for my husband and he loves it.  It does everything he wanted it to do so thank you again.", "Date": "January 21, 2014"}, {"Title": "Unbelievable dead pixel and defective product!", "Author": "sung", "ReviewID": "R2AVWRYU7S8Z99", "Overall": "1.0", "Content": "I just received this tablet 2 hours ago and am now quite disappointed: there is a very sharp dead pixel right in the middle of the screen. Now Amazon's system hints the product cannot be replaced. I am wondering why!Adding on March 7:Amazon customer service has now agreed to exchange my purchase, so I am waiting for delivery of the replacement, and may probably modify this review after I get the delivery.", "Date": "March 6, 2014"}, {"Title": "Slow emmc storage - Check, Non working GPS/GNSS Check, Slow Wireless Connectivity Check?", "Author": "IloveshoppingatAmazon", "ReviewID": "R6CBBOXT2AYRT", "Overall": "1.0", "Content": "Where to start? I don't usually write review but I was so excited reading everyone's positive reviews, and I was so eager to receive this tablet and put it in service. Finally a good x86/x64 tablet you can actually use for work and play!Let's see -- I was going to use this tablet to access my car's ECU and use it as a vehicle diagnostic dashboard, and performance logging device. It comes with built in GPS/GNSS!!! That meant I will be able to log my fuel injection statistics and how it affects the speed of the vehicle in relationship to the fuel adjustments I make.. How awesome?In the spare time, this was going to be my couch toy.Boy was I disappointed when I found out the GPS/GNSS sensor does not work with your legacy apps that require communication over NMEA 0183 / COM port. The sensor can only be accessed by Windows 8 and Windows 8.1 applications written in Visual Studio using Windows' propitiatory API. If you are buying this to because it has GPS/GNSS sensor... Then look some where else.There is one company that makes conversion software \"centrafuse localizer\". It will make your legacy applications work with this GPS/GNSS however, the resolution is awful and slow...This sensor was only meant to be used as a location beacon so websites could provide you with targeted advertising....The wireless is slow. Even at 802.11g speeds, with device next to the wireless router, I was getting 1Mbps with serious packet loss. I'm a network engineer and this reminds me of 802.11b communicating at long distance behind a concrete wall...The eMMc storage chip is very slow. The device will boot fast, but some apps that require a lot of disk reads will be very slow to load. Other apps like \"calc\" and \"paint\" start instantly...  Opening word files takes a bit....RAM is slow too.The device ships with Windows 8.1 32bit, however the CPU is 64bit. You will not be able to change the OS because of the 32bit UEFI bios. No where is this mentioned on Lenovo's site... Really Lenovo? I am disappointing.  You will not be able to run 64bit Windows applications.Battery life is great... No complaints there.It's still a great device, and things have come a long way ahead. The intended target audience for this device is non-technical hipsters that need to run Microsoft Office, and Powerpoint, and don't want to lug a laptop with them.I'm sending mine back for a refund. It would have made a great tablet, instead its a flop.", "Date": "December 7, 2013"}, {"Title": "Screen too bright for me, and too small for desktop mode", "Author": "Daniel Wong", "ReviewID": "R175D4C32D8XAM", "Overall": "3.0", "Content": "Sorry, I got this outside Amazon... as it was out of stock during Thanksgiving week.  But I don't mind sharing my comments here.In my opinion, Windows 8.1 is sill a pain to use.  I tried, and concluded that 8\" screen is too small for desktop.  I connected a bluetooth keyboard designed for iPad, and found out that only numbers were accepted.  In my case, characters were not be recognized by Windows.  But another bluetooth keyboard designed for Windows works just fine.My biggest problem with the Miix2 is the brightness of the display.  It hurts my eyes even at the lowest brightness that the device allows me to tune to.  As such, I can use the tablet only for casual web browsing.  I cannot use the tablet for productivity work.  I cannot use the tablet as an eReader.  I cannot use the tablet to watch a movie.  I cannot use the tablet for serious web-based research.", "Date": "January 6, 2014"}, {"Title": "Not what I was expecting", "Author": "Diana", "ReviewID": "R2JE9I9I84K184", "Overall": "2.0", "Content": "I bought this device based on the reviews I read, and the unboxing videos I viewed. If you want this tablet, I suggest the 64GB rather than the 32GB. This device only had 10GB of free space out-the-box. Windows OSs are space hogs by definition. Windows Updates could eat through that 10GB alone. Next, this was advertised as having Microsoft Office Home & Student Edition 2013 preloaded. I found that this was not the case. I could download the trial version (that would've eaten up about 5GB), but I had to purchase a key code if I wanted full access to MS Office. Also, it took forever for me to get to the appropriate support area from Lenovo. (I called because I was under the impression that I would be receiving full MS Office.) And they didn't transfer me around a phone tree. They gave me the phone number, kindly said goodbye, and hung up on me. (Auto System) Other than that, yes I'll agree that it's a nifty little device. However, if you looking for a tablet, then buy an Android tablet. If you are looking for a laptop, then buy a laptop. I thought this would've been a happy medium between the two. I was wrong. Just saying...", "Date": "January 19, 2014"}, {"Title": "Needs a Stylus, but Lenovo's stylus is terrible to the point of uselessness.", "Author": "Amazon Customer", "ReviewID": "R3F3BR2O24SRQF", "Overall": "1.0", "Content": "A tablet with Windows, OneNote, and a working stylus to draw and free form write in OneNote would be a killer combination. Enough so to overcome the fact that Windows 8 doesn't really belong on a tablet. However Lenovo's optional stylus is terrible - it's impossible to draw a continuous line without skipping, which also makes handwriting recognition useless.  I can't believe that Lenovo actually let this ship.Recommendation. Skip this tablet, get an 8\" Samsung Galaxy Note Tablet and use Evernote.", "Date": "March 6, 2014"}, {"Title": "IS FAR FROM MY ESPECTATIONS", "Author": "Amazon Customer", "ReviewID": "R25OOGTCUJQ0TD", "Overall": "2.0", "Content": "You need magnifying glass for use it, it is very far from the android system. Windows is not yet a system for tablets.", "Date": "December 20, 2013"}, {"Title": "wish it would reliably turn on", "Author": "nagendra Mishr", "ReviewID": "RQ1G8T1LSBYEX", "Overall": "1.0", "Content": "worthless piece... works ok when it turns on / if it turns on... compare to the Dell Venue Pro 8\"... that is real the star winner.", "Date": "December 9, 2013"}, {"Title": "DONT BUY THIS--PIECE OF CRAP", "Author": "ALOMGIR ABDUL MANNAN MIAH", "ReviewID": "R3AK7ESEHR2ZA5", "Overall": "1.0", "Content": "DONT BUY THIS--PIECE OF CRAP. DOES NOT WORK AS EXPECTED. SOPMETIMES RESTARTS. AUTO WAKE UP NEVER WORKS. PIECE OF JUNK. I WASTED MY $300 ON THIS CRAP. DONT BUY THIS.", "Date": "February 12, 2014"}, {"Title": "A protoype at best", "Author": "Carissa R.", "ReviewID": "RT6AORR9072ND", "Overall": "1.0", "Content": "I won't waste even more time on this product by writing a big review- simply put it is a glimpse into the future, a prototype at best to be used to show that we can \"imagine\" (and it will take some imagination) how it will be to run a fully functioning operating system on a tablet.  Windows 8.1 (Microsoft) can take the full blame for the failure of this product; the operating system (Win 8.1) is slow, sluggish and demanding on the processor and memory that it resembles a computer today running XP.  This does not function like a tablet should for 2013, the first iPhone was better put together, heck, LG probably makes a smartphone more usable than this.I don't recommend this, but I VERY MUCH look forward to SSD tablets that functionally run full operating systems with great components and plenty of drive space!  On that note, we should be demanding that companies like Microsoft, Apple and Samsung release excellent top technological devices with components that rival any laptop because the technology is here and it's cheap!  They're milking us and slowing their own evolution.Much love", "Date": "December 4, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F2ENU7Y"}}