{"Reviews": [{"Title": "Excellent Value for the money", "Author": "Meenal Garg", "ReviewID": "R39PC557819VPL", "Overall": "5.0", "Content": "I have been buying inexpensive tablets this year for gifts and I must say I am very pleased with my decision...I have bought couple of Simbans tablets and few other brand.This particular model looks better than the other brands I bought.These tablets are very inexpensive compared to the value they provide. Fast enough for kids to play the games and web surfing.Skype works just fine..I have not tried netflix but I think giftees are using it.One suggestion I do want to give to all is that you should check the tablets and make sure it has no issue before you give it to someone. one of my tablets did not work when I received it. Good thing about buying from Amazon is that returns are very easy and fully pre-paid and you get full refund. GO AMAZON!!", "Date": "October 23, 2013"}, {"Title": "Slow and weak but affordable", "Author": "A. Dent \"Aragorn\"", "ReviewID": "RBG0JG4IPHWCP", "Overall": "3.0", "Content": "You can get the Simbans little honest-to-goodness 7\" Android tablet for about the price of a PS3 or Xbox video game but... is it worth that much when a vastly superior, last year's vintage Kindle Fire HD (yes, not 'pure' Android) or a Nexus 7 could be had for the price of 2-3 video games? The makers of Simbans believe it is so and, to prove it, they provided me with a 'for review' unit so that I can see it for myself and write about it. I am not fully convinced.To start with the 'goods', yes, this Android 4.2 tablet does handle games and the various Google apps without crashing. I was able to play Temple Run, for example and I was able to survive for the first few hundred meters even though the frame rate was not the smoothest. Netflix... barely, It showed me the first 5 minutes or so of a movie, then went into 'buffering' mode and stayed there until the battery ran out. The camera does take pictures and it even supports Android's 360-degree camera mode but the resolution is low and the response to touch could be better.But I'm getting a little ahead of myself because I'm talking about the good features right now so, before I lose focus, let me make a case of why anyone would want to consider purchasing this product.- Inexpensive: I may be wrong but I don't believe that you can get a tablet (not a joke) that actually works for this little money.- Pure Android: unlike the Kindle Fire so, if you know and love your Android Simbans' tablet interface should feel familiar. With Android comes Google's store and everything in it can be downloaded and installed. The low price and its 'pure Android' makeup  contribute to most of the three stars because it's mostly downhill from here.- MicroSD storage expansion port. It's worth mentioning because most 'mainstream' 7\" tablets do not have it.- Screen protector: it ships with a screen protector attached so if you see air bubbles on the front, don't be afraid or concerned, it's not a defect and feel free to remove it if you don't want it.And here is what anyone should be aware of (not so good qualities and features) before buying it.- Low specs: the sellers are quite honest so simply see them all listed at products's page. 4GB of onboard storage, low screen resolution, slow CPU all contribute to a low performance tablet but... remember, it's sells for half the price of last year's gorgeous Kindle Fire HD.- Non-standard charger: I expect to be able to charge a tablet through a Micro USB port so that I don't go into panic mode when the supplied non-standard charger stops working or is lost or left behind. I tend not to buy any gadget that doesn't support standard USB chargers because I simply don't need the trouble.- Narrow viewing angle: whether up/down or left/right you better be staying right in front of your little tablet, adjust it for optimal viewing and then don't move much because the moment you move... you'll have to readjust the tablet. To estimate the optimal viewing angle at 30-degrees before colors begin morphing may be a little too generous.- No Bluetooth: this is quite a disappointment because the built-in tiny speakers aren't sufficient. Yes, it's probably possible to plug 'something' through the headphones port but Bluetooth is the convenient way and it's not supported.There are a few more reasons to think twice before going with this tablet and they include some rather unimpressive battery life of maybe a couple of hours on a full charge, no GPS, a Chinese-only manual (seller stated in an email that buyers should get an English manual and I was given the Chinese version by mistake).The vendor believes that this tablet should be given to children because it doesn't cost too much. My personal view tends to be the opposite. Children tend to be less patient and more demanding  of their toys and gadgets than adults and I am afraid that they are not going to tolerate well a tablet that comes with a below average display, slow response to touch controls and is slow overall. But that is only my opinion. I am currently trying to set it up as an interface for a Harmony remote control and an Onkyo receiver which both come with their Android control apps. Not done yet but I will come back to this review and report once I have something to share.The three stars \"It's Okay\" are granted from the point of view of someone who makes an informed decision - see all of the above. Nobody should expect a top-of-the-line gadget at that price so, yes, it's slow and weak but it's also cheap.____________________________________________________NOTES:- My price-related comments were made when the tablet was on sale for $69. Obviously, prices can and do change and if the main reason for a positive review is 'price' then that goes away or diminishes when the prices goes up.- This is almost entirely my fault but I managed to fry the tablet. I was complaining about the non-standard charger above - I always prefer USB because they are so common and easy to share. Well... by mistake, I plugged my Samsung's Chromebook proprietary charger into the tablet's charging port and it happened to fit. It also destroyed the tablet. So... it's goodbye.", "Date": "October 13, 2013"}, {"Title": "Best value for the money and great features", "Author": "Divy Agrawal", "ReviewID": "RU8DU33677VMN", "Overall": "5.0", "Content": "I was not too sure when I bought this tablet as I was not expecting much from a $70 tablet but I must say that I was very surprised when I received this tablet. The things I liked about this tablet are:1. It is fast.2. Supports Google Play so that I can download any application from the android market.3. Its nicely built and doesn't look cheap.4. Supports HDMI.", "Date": "September 1, 2013"}, {"Title": "You get what you pay for", "Author": "Nikole", "ReviewID": "R149E0O1O4T8EH", "Overall": "4.0", "Content": "If you only want to pay less than 100.00 for a tablet then expect something worth less than 100.00. I bought this tablet for my 5 year old son and he seems to like it just fine. I would never use this tablet for myself but he enjoys it just the way it is. It tends to freeze up and can be slow at times but he was able to download many games on it and that's all he wanted it for...so he is very happy with it.", "Date": "September 4, 2013"}, {"Title": "ok", "Author": "HAPPY!", "ReviewID": "R91UQ2T66PCI1", "Overall": "5.0", "Content": "Works for my son. Battery life kinda low if you play a lot of games. But wi fi is pretty fast.", "Date": "August 21, 2013"}, {"Title": "Very nice looking tablet for the price", "Author": "Meenal Garg", "ReviewID": "RE5293FKTNASE", "Overall": "5.0", "Content": "I bought this tablet after seeing couple of other 7 inch ones. I would say I am very happy with my decision to go with this one.Pros:- The look and feel of this tablet is much better than the others in the market (I have seen 2 - 3 other brands so far)- Dual Camera- Performance is at par or little better than other 7 inch tabletsCons:- I wish it had HDMI port but for the price I paid I cannot compalin- Nothing else at this point, I may update my review later on.", "Date": "July 21, 2013"}, {"Title": "Not to bad", "Author": "annemarie", "ReviewID": "RKCW36FHC793D", "Overall": "3.0", "Content": "It nice but not strong,I brought it for my daughter it fell down one time and that was end of it.", "Date": "September 14, 2013"}, {"Title": "Reviewl on Simbans Tablet and  Case", "Author": "marcia grey", "ReviewID": "RARPGX14EHTXA", "Overall": "5.0", "Content": "This product is superb it functions well doing all the things Ireally needed it for .The case is just nice and it fits into my bags nicely .", "Date": "September 11, 2013"}, {"Title": "its okay", "Author": "Lee \"Grimnr\"", "ReviewID": "R3CO8GJ81YZSC3", "Overall": "3.0", "Content": "This device is OK depending on what you're using it for, we got it for the specific reason to run two maybe three apps on that's it. For the price and what we purposely bought it for it's OK. Now don't expect a full blown tablet when you get this: it's slow, it takes fore ver to connect to the internet it's a cheap tablet.", "Date": "June 5, 2013"}, {"Title": "androit", "Author": "3FISHERS", "ReviewID": "R2OFS4S37HXN1W", "Overall": "4.0", "Content": "I got this as a gift for my f year old and he Loves it!!! He wanted an I-pad, but this has worked out great & cost a lot less;)", "Date": "April 5, 2013"}, {"Title": "Love My Simban", "Author": "Amazon Customer", "ReviewID": "RYV5SQBHN0RTY", "Overall": "4.0", "Content": "I have had my tablet for about two weeks and so far it is working great.Must admit it is a little slow so what! I bought it so I can enjoy my books and games.I can even take notes during meeting with it and watt pad works great.There is a slight problem with my IReader but I believe I did something wrong and turn it offand just can't remember how to put it back on.If anyone can advised I would appreciate it.Thank Kimmy", "Date": "September 3, 2013"}, {"Title": "Some initial problems", "Author": "Wordsmyth", "ReviewID": "R11OKYKRGMCMO9", "Overall": "3.0", "Content": "The product is a German import, it comes with a charger but you must wait for the US adapter to be sent (seperately). Once I received the adapter, I could not get it to work with the charger. Customer support suggested I stick toothpicks in it to get it to fit more snuggly, but this did not work. Ended up having to buy a European Adapter set (for 20 bucks at Radio Shack), and was FINALLY able to charge the device and start using it. This does NOT charge via computer USB, it even says this in the user manual (available on the device), though support seems to think it does.Once I got it charged and working, I must say I was pleasently surprised at the reliability of this tablet. I've been using it for a week and have had very few lockups. Memory is adequate and it lasts quite a while on a full charge. Wifi works well, but haven't had the chance to check out 3G functions.Games are smooth and video and sound quality are all good. Not very bad for the price at all... but I did have to spend a bit more, and I think they would do well to ship this product with the appropriate charger so that we US users can actually use the pad when it arrive.", "Date": "February 27, 2013"}, {"Title": "Inexpensive but solid", "Author": "Amazon Customer", "ReviewID": "R28Z3SK60DCTPX", "Overall": "5.0", "Content": "I didn't expect to much from this tablet but must admit that it has greatly exceeded my expectations.  My wife uses it for games and email and is completely satisfied with performance.", "Date": "February 18, 2014"}, {"Title": "excellent  product", "Author": "JOSE  FRANCO", "ReviewID": "R3U6XZ0DWNSTIB", "Overall": "5.0", "Content": "my daugther  she  love  it ,she  it  very happy with  them  an d  also  their  friend  like  too.  thanks  .", "Date": "January 29, 2014"}, {"Title": "eh its ok", "Author": "imakitty", "ReviewID": "R1JW8WVCO8N4LI", "Overall": "3.0", "Content": "It's an okay tablet takes a while to load up and to do anything and the battery life isn't very long and the instructions came in Chinese but it's okay if all ur doing is watching stuff in netflix", "Date": "January 15, 2014"}, {"Title": "Works great", "Author": "Brandon Young", "ReviewID": "R2UAETFOV02LWM", "Overall": "5.0", "Content": "never had one of these and it works great. it was exactly what was described and there is no issues thanks", "Date": "July 22, 2013"}, {"Title": "So so android tablet", "Author": "Jo@", "ReviewID": "R3848D1WCA7OPR", "Overall": "4.0", "Content": "This tablet is not the fastest, but the best for that price, good capacitive touch screen, nice version of android, decent wifi.", "Date": "June 7, 2013"}, {"Title": "excellant", "Author": "Frank J Murrell", "ReviewID": "R2GZ1VRUY4PS1R", "Overall": "5.0", "Content": "excellent price and quality this is a hard price to beat anywhere. It compares to so many of the top contenders", "Date": "October 14, 2013"}, {"Title": "arrived damaged", "Author": "Amazon Customer", "ReviewID": "R1O5QJ4ITIF85K", "Overall": "3.0", "Content": "screen glass was cracked on arrival.  the seller probably didnt know.  no damaged to product box or amazon box so it likely cracked in transit to the warehouse.  its already in the mail to go back.the unit is cheap but seemed to work.  the glass is obviously too thin.  if you get a unit that isnt cracked on arrival it should be ok for simple tasks or for kids.", "Date": "March 9, 2013"}, {"Title": "My 8-yr old nephew loves it!!", "Author": "Shannon Waiters", "ReviewID": "R106XNIX1G5NOU", "Overall": "5.0", "Content": "I purchased this for my nephew as an alternative to the Nabi tablet he requested and I am so pleasantly surprised at how well it performs. I purchased a cover to protect it from all potential child accidents and have no complaints.", "Date": "June 5, 2014"}, {"Title": "it performs as described but not at the best performance", "Author": "41reviews", "ReviewID": "R29M3JE6MMJOFZ", "Overall": "3.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1UFLM4SRH458PembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1UFLM4SRH458Prefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1UFLM4SRH458PchiDiv\").innerHTML = document.getElementById(\"cv_mo1UFLM4SRH458PhiddenPre\").innerHTML;\n};\ncv_mo1UFLM4SRH458Prefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1UFLM4SRH458Pso;\t   \n\n\nfunction cv_mo1UFLM4SRH458PloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1UFLM4SRH458Pso = new SWFObject(swfLocation, \"cv_mo1UFLM4SRH458PAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1UFLM4SRH458Pso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1UFLM4SRH458Pso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1UFLM4SRH458Pso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1UFLM4SRH458Pso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1UFLM4SRH458Pso.setAttribute(\"height\", swfHeight);\n          cv_mo1UFLM4SRH458Pso.setAttribute(\"width\", swfWidth);\n          cv_mo1UFLM4SRH458Pso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1UFLM4SRH458Pso.write(\"cv_mo1UFLM4SRH458Pflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1UFLM4SRH458P', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1UFLM4SRH458P';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1UFLM4SRH458P', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1UFLM4SRH458PloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1UFLM4SRH458P\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m7YJ46XQYRAUI\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m7YJ46XQYRAUI\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R29M3JE6MMJOFZ\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m7YJ46XQYRAUI/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1UFLM4SRH458Pduration')) {\n      document.getElementById('cv_mo1UFLM4SRH458Pduration').style.display='none';\n    }\n    cv_mo1UFLM4SRH458PloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1UFLM4SRH458PloadSwf(movieID, playerVersion) {\n   return _cv_mo1UFLM4SRH458PloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1UFLM4SRH458PnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1UFLM4SRH458P', 0, h);\n}\n\nfunction cv_mo1UFLM4SRH458PresetPlayer(w,h,bw,cc) {\n  cv_mo1UFLM4SRH458PnewHeight(h);\n\n  cv_mo1UFLM4SRH458Pso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1UFLM4SRH458Pso.addVariable(\"cacheCode\", cc);\n  cv_mo1UFLM4SRH458Pso.setAttribute(\"height\", h);\n  cv_mo1UFLM4SRH458Pso.setAttribute(\"width\", w);\n  cv_mo1UFLM4SRH458Pso.write(\"cv_mo1UFLM4SRH458Pflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1UFLM4SRH458PRollOverImg = new Image();\ncv_mo1UFLM4SRH458PRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81Off7MiENS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1UFLM4SRH458Ppreplay = document.getElementById('cv_mo1UFLM4SRH458PpreplayImageId');\nif (cv_mo1UFLM4SRH458Ppreplay) {\n  cv_mo1UFLM4SRH458Ppreplay.onmouseover = function() {\n    cv_mo1UFLM4SRH458Ppreplay.src = \"http://ecx.images-amazon.com/images/I/81Off7MiENS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1UFLM4SRH458Ppreplay.onmouseout = function() {\n    cv_mo1UFLM4SRH458Ppreplay.src = \"http://ecx.images-amazon.com/images/I/81Off7MiENS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1UFLM4SRH458Ppreplay.parentNode;\n\n  var cv_mo1UFLM4SRH458PcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1UFLM4SRH458PcurrentClick) {\n      return cv_mo1UFLM4SRH458PcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 6:21 MinsThis is ok. Overall I found that it is really just for a basic user wanting to surf the Web or for your kids or something. I wouldn't take this tablet on a road trip because you would be needing to charge it every hour if you use it continously.I do find that it can do what it's suppose to do. The quality of the camera was low - I wouldn't send these pictures to print be any means. But it definitely can preform the basic functions and even the ones I threw at it.  I just really didn't like the battery life of it.  I felt like I had to charge it every other hour. I received this item for a honest review.", "Date": "March 5, 2014"}, {"Title": "Works well and at a budget price", "Author": "Angela Streiff", "ReviewID": "R1EX4L4X5YO4MP", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moS1YX11ROSSX7embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moS1YX11ROSSX7refresh_preplay() {\n\ndocument.getElementById(\"cv_moS1YX11ROSSX7chiDiv\").innerHTML = document.getElementById(\"cv_moS1YX11ROSSX7hiddenPre\").innerHTML;\n};\ncv_moS1YX11ROSSX7refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moS1YX11ROSSX7so;\t   \n\n\nfunction cv_moS1YX11ROSSX7loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moS1YX11ROSSX7so = new SWFObject(swfLocation, \"cv_moS1YX11ROSSX7AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moS1YX11ROSSX7so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moS1YX11ROSSX7so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moS1YX11ROSSX7so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moS1YX11ROSSX7so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moS1YX11ROSSX7so.setAttribute(\"height\", swfHeight);\n          cv_moS1YX11ROSSX7so.setAttribute(\"width\", swfWidth);\n          cv_moS1YX11ROSSX7so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moS1YX11ROSSX7so.write(\"cv_moS1YX11ROSSX7flashcontent\")) {\n          fp_resizePlayerSpace('cv_moS1YX11ROSSX7', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moS1YX11ROSSX7';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moS1YX11ROSSX7', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moS1YX11ROSSX7loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moS1YX11ROSSX7\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m4OVTMPZRJFAA\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m4OVTMPZRJFAA\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1EX4L4X5YO4MP\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m4OVTMPZRJFAA/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moS1YX11ROSSX7duration')) {\n      document.getElementById('cv_moS1YX11ROSSX7duration').style.display='none';\n    }\n    cv_moS1YX11ROSSX7loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moS1YX11ROSSX7loadSwf(movieID, playerVersion) {\n   return _cv_moS1YX11ROSSX7loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moS1YX11ROSSX7newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moS1YX11ROSSX7', 0, h);\n}\n\nfunction cv_moS1YX11ROSSX7resetPlayer(w,h,bw,cc) {\n  cv_moS1YX11ROSSX7newHeight(h);\n\n  cv_moS1YX11ROSSX7so.addVariable(\"resetBandwidth\", bw);\n  cv_moS1YX11ROSSX7so.addVariable(\"cacheCode\", cc);\n  cv_moS1YX11ROSSX7so.setAttribute(\"height\", h);\n  cv_moS1YX11ROSSX7so.setAttribute(\"width\", w);\n  cv_moS1YX11ROSSX7so.write(\"cv_moS1YX11ROSSX7flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moS1YX11ROSSX7RollOverImg = new Image();\ncv_moS1YX11ROSSX7RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81FSBS3J1cS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moS1YX11ROSSX7preplay = document.getElementById('cv_moS1YX11ROSSX7preplayImageId');\nif (cv_moS1YX11ROSSX7preplay) {\n  cv_moS1YX11ROSSX7preplay.onmouseover = function() {\n    cv_moS1YX11ROSSX7preplay.src = \"http://ecx.images-amazon.com/images/I/81FSBS3J1cS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moS1YX11ROSSX7preplay.onmouseout = function() {\n    cv_moS1YX11ROSSX7preplay.src = \"http://ecx.images-amazon.com/images/I/81FSBS3J1cS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moS1YX11ROSSX7preplay.parentNode;\n\n  var cv_moS1YX11ROSSX7currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moS1YX11ROSSX7currentClick) {\n      return cv_moS1YX11ROSSX7currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 4:05 MinsMy Simbans tablet is working quite well, and I've not yet had any of the less than positive experiences some of the other reviews have mentioned. I've had really bad tablets before, and this is not one of them. Please note that in my attached video, the lines on the screen are the effect of my camera trying to film a screen. They are not lines on the tablet's screen. The screen on the tablet is clear and colorful.Pros:- Touch screen works REALLY well. Very responsive.- Screen is bright and clear.- Sounds is adequate. Very clear, not muddy. But don't expect a lot of base.- Buttons are all easy to access and push. Volume rocker built in, so no need to rely only on the on-screen functions.- Charges really fast (however this is because of a smaller battery, so it also discharges fast)- Built in camera- Wifi works well- Apps work fine. I haven't run into any crashes yet. Small/simple game apps run okay. But don't try and play anything apps that require a super powerful processor. You'll get some lag. Angry Birds type app games are fine. But racing simulator games and such are probably too much for it.- It works! I'm amazed they can make a tablet that works this well for this price.Cons:- Screen is not glass and if you press too hard, you can damage it. Fortunately the tablet has such high touch screen sensitivity, I haven't need to press hard on it.- As mentioned before, it has small battery. So while it does charge up quickly, is also discharges quickly.Other notes:Keep in mind this is not a $300+ tablet, and doesn't have the same kinds of hardware inside. So browsing the internet and launching application is a bit slower. You have to wait a few seconds for each action.I did not run into the problem of the charger breaking. I've plugged mine in and out of the wall and tablet several times and it's still in one piece. It looks and feels just like any other power adapter and seems to work in the same way.The red color of this tablet has orange undertones to it. So if you have your heart set on an exact cherry red color, this isn't that. Personally I like the reddish-orange color even better.Conclusion:This tablet is good for someone who needs something very basic. You're not going to replace your computer with this. It's a good little device for reading emails, playing Angry Birds or doing crossword puzzles, using as an eReader or doing some browsing online. I wouldn't suggest it for some one looking for a tablet just to watch Netflix, because of the short battery life. You won't make it though a whole movie.Because of it's price point, it does make a good tablet for kids (who can play without damaging the screen), adults who need something for basic uses and even grandma and grandpa who just want something to read emails on and play some Sudoku. It's a good little device, just keep in mind the short battery life.Sample provided for review", "Date": "February 20, 2014"}, {"Title": "Buy it For the Right Reasons", "Author": "K. Groh", "ReviewID": "R2QROU1ISR0PQA", "Overall": "4.0", "Content": "I have a Kindle as well as a Samsung Galaxy Note 10.1 tablet. There is not a lot of comparison but there is also not the same price tag. But I mention it because this tablet lacks in some areas but definitely comes through in others.This is a $60 tablet so you should not expect it to function the same as a $300 one.After using this for a few weeks, here are my thoughts:* The tablet burns through battery usage when connected to the internet. If you want to have it last while you are using apps, turn off wi-fi* Wi-fi works fine for me. I had no trouble connecting and reconnecting.* While you can use it plugged in and charging, it does do some funny things at times especially with the onscreen keypad.* I was able to download apps from Google and Amazon Appstore. But it does have memory limits so you will not be playing it for big games or using it with complex apps.* The screen is adequate. The colors are off - a little big of a blue tint but again, clear enough for basic use and after awhile, you don't notice it.* Battery life is adequate. It does wear down quicker than my other tablets but it certainly lasts enough for a couple of hours before recharging.* It comes with a few widgets and basic apps and if you are used to an android system, it will look familiar. You can easily download some additional free apps.* It does have a camera which takes adequate pictures. Again, nothing like a high end camera or more expensive tablet.* The power button is in an awkward position so it is easy to tap it off while using the tablet. After awhile, you get used to its position and try to adapt how you hold it.* It is a basic 7\" tablet so it will fit into most tablet cases that have elastic grips.* My 9 year-old daughter has been using it a lot and is having a great time. Recommended for a responsible child as a first tablet.The bottom line: if you can only afford an inexpensive tablet, if you have a child that is always taking yours, if you just need a real basic model and don't want to invest a lot, then this is a good solution. If you are expecting the same quality and functionality of an iPad or Samsung, save up your money for when you can afford that price tag.I was provided a unit for evaluation and review.", "Date": "February 20, 2014"}, {"Title": "all 4 stopped working, wont load past android logo.", "Author": "sylvia", "ReviewID": "R3RQGWTOA4YQHE", "Overall": "1.0", "Content": "I bought 4 and all 4 stopped working, wont load past android logo. 3 stays on android logo and 1 shuts off after logo. has any1 else had this problem.", "Date": "February 15, 2014"}, {"Title": "Good tablet", "Author": "li-kaenemman", "ReviewID": "R1D2M3I6UVDTAZ", "Overall": "4.0", "Content": "Great buy for the cost but the only problem is the battery after fully charged will only last for half an hour.", "Date": "November 21, 2013"}, {"Title": "gift for mom", "Author": "K. Gonsior \"Clearence Queen\"", "ReviewID": "R1JV136R01WOS9", "Overall": "5.0", "Content": "Lots of features for reasonable price, didnt want to spend a lot if mom couldnt use, she seems to be taking to it.", "Date": "October 28, 2013"}, {"Title": "A Terrible Inconvenience!", "Author": "Shaunese Rowland", "ReviewID": "R8IMIBMZSUR31", "Overall": "1.0", "Content": "I was so disappointed with this product I could have screamed! Poor quality Tablet,  ridiculously slow, it would sometimes display my icons and status bar upside down,  it wouldn't reboot though I tried about 12 times, it didn't hold a charge and there were no damn instructions or contact information. I spent hours trying to update things and download out of Google Play. Today I'm ready to break it in half!! I just want all my money back!!!", "Date": "October 6, 2013"}, {"Title": "not as described", "Author": "jojack", "ReviewID": "RCMB62MW6GA7T", "Overall": "1.0", "Content": "This tablet SUCKS. Charger broke within and week and then charging port broke contactected seller with nothing done to fix or replace the tablet seller does not contact back refuses to do anything DO NOT BUY FROM THIS SELLER!!!!!!!!!!!!!!!!! description says 4Gigs of hard drive but when i got it it had less than 1. Also it has. horrible battery life. doesn't even stay charged an hour. also when plugged up i can't use it because i will press in one part of the screen and it will register a touch somewhere completely different. not impressed with either of the 2 tablets i have bought on amazon", "Date": "June 3, 2013"}, {"Title": "GREAT LITTLE TABLET", "Author": "MomOf3", "ReviewID": "R37S9WIV4FC80F", "Overall": "4.0", "Content": "Very comparable price for what you get.* Have not had over heating issues - as noted in others' reviews* Have not had volume issues - as noted in others' reviewsPros:* Charge lasts quite a long time* Takes the same charger as Samsung cell phones (which we also have) so, only have to have one charging unit plugged in for everything.* Clear screen* Good amount of space* Very easy set up* LightweightCons:* Very sensitive to touch with both fingers and stylus* When you have a lot going on - has a slight chance of buffering during Netflix* Quite a few games my boyfriend plays have not been supported on tablets yet... - he thinks this is a boo hoo item.Bought also:Basic 7\" tablet stand with usb keyboardUniversal 7\" touch screen protector table screen protectors (came as a packet of 5)2-yr SquareTrade Tablet protection - based off of the reviews I had read on this productNo issues so far - have been using it since August 2013 and will update if anything goes awry.", "Date": "October 17, 2013"}, {"Title": "THIS IS AN AMAZINGY $69.93(Total cost) DEAL ! !", "Author": "USA gentleman", "ReviewID": "R2JVAHGPPBLRPQ", "Overall": "5.0", "Content": "I am blown away by this SIMBANS Tablet PC with dual cam. It is amazingly fast, and, so easy to use that, I am buying another. In my humble opinion, you get more than you pay for on this deal! It isn't an IPAD, but it is amazing how well it works and performs for under $70. WOW ! Here are the minor issues...The speaker is not loud enough to hear, but it sure drives a boom cube with amazing \"room sound\". The first few times I Skyped on it, the internal mic produced a clicking noise, but that seems to have resolved itself. There is no external mic plug, and I have not yet tried to get the app for bluetooth. So, I don't know if an external mic is possible that way, or maybe through the mini usb? Cam quality is acceptable on front and rear cams.I use this device to Skype, Email, Research, Listen to Music, Watch Movies and more. It performs with reliable consistency !! THANKS SIMBANS !THANKS AMAZON !", "Date": "August 14, 2013"}, {"Title": "Very well priced, Good buy.", "Author": "William F Sum", "ReviewID": "R35QGK85O7RZLF", "Overall": "4.0", "Content": "Shipping was super fast! (Got it 3 days early!) Performs in every way that was explained, Software is a tad bit slow at times / Easily gets bogged down. The battery life is also not astounding. (Typically, 2-3 Hours of constant use over Wifi drops it dead.) Other than that it is a wonderful purchase that will do anything you need it to. Lightweight, Cheap, and Clear Picture. 5/5 would purchase again.", "Date": "September 29, 2013"}, {"Title": "don't buy it.", "Author": "beth monk", "ReviewID": "R2MNMAVSQUYGZY", "Overall": "1.0", "Content": "This was such a waste of money, was like trying to search the web on a large android phone, wasnt very user friendly or very fast.", "Date": "August 18, 2013"}, {"Title": "not worth it", "Author": "Stacie Frey", "ReviewID": "R3N046UJ3QICWK", "Overall": "1.0", "Content": "Pos.only have had it since December Charges but won't start up.  Holds a full charge for less than20 minutes. Bought it for my 100 year old. Super disappointed recommend not purchasing this tablet", "Date": "February 17, 2014"}, {"Title": "the female part of the plug broke", "Author": "ricky", "ReviewID": "R2O1S906FOZDDB", "Overall": "1.0", "Content": "the female part of the plug broke , it was slow, and it froze a lot and in all not happy", "Date": "September 11, 2013"}, {"Title": "Nice tablet", "Author": "familyinbham", "ReviewID": "R1KM4YPPSXO8SI", "Overall": "5.0", "Content": "I love the tablet. One negative I must mention, the power adapter is cheap and broke. It left a prong inside my socket and I had to contact the power company to have them remove the prong.", "Date": "June 25, 2013"}, {"Title": "Five stars for the price", "Author": "Jane N", "ReviewID": "R3MHD729X1E8OH", "Overall": "5.0", "Content": "Pros- very nice high resolution (1024x600) display- responsive touch screen- microSD card slot- responsive to web browsing and games- has manual buttons for volume on the side, and 4 hardware buttons in front- USB connector for keyboard/mouse (though Android 2 doesn't show the mouse cursor like Android 4 does)- really long battery life--says 10 hours, have used it for 5 and it still seems half fullCons- fairly heavy--a bit heavier than a kindle Fire, haven't weighed it exactly- old version of Android (v2), so a lot of newer apps won't run- seems to not be able to connect to a password protected wifi, but connects to wifi's without passwords", "Date": "April 23, 2013"}, {"Title": "Nice little tablet but it can't hold any carge", "Author": "Melinda", "ReviewID": "R3KBHVLW11MM23", "Overall": "1.0", "Content": "It took forever for it to charge, and then when it did, it only lasted less than it takes me to undress. DISAPPOINTED!", "Date": "May 16, 2014"}, {"Title": "This tablet sucks. Big time.", "Author": "Pochocla \"Suicide Pochoclo\"", "ReviewID": "R3ORWCFGIE5PHD", "Overall": "1.0", "Content": "This ws a very dissapointing purchase. It is slow, the battery runs out too fast, it is not so intuitive as it could be, and it just sucks. I really recommend to expend a little bit more and get a good one. I bought this for my 3 year old and I don't even want him to use it because it's a shame really... I am sad and frustrated!", "Date": "May 15, 2014"}, {"Title": "memory/slow moving", "Author": "Rackley Thomas", "ReviewID": "R8CJM3A9MJXUU", "Overall": "2.0", "Content": "Need more memory and the touch screen is a bit stiff.maybe in the future it can be a bit faster if there are built with 1gb memory", "Date": "May 12, 2014"}, {"Title": "not 4 mee", "Author": "Viper", "ReviewID": "R1IQA4XQ8W80SP", "Overall": "1.0", "Content": "batter life is like 15 to 20, min. ugh not long could be longer or it could be a good 1 love the tab.", "Date": "May 9, 2014"}, {"Title": "Glitchy", "Author": "AMY", "ReviewID": "R16XS012Q4MZ4P", "Overall": "3.0", "Content": "Sub-standard tablet. You get what you pay for.Continuously freezes.The best you can do is web surf and check emails.Can't handle games, high performance tasks, multiple applications running at once.", "Date": "March 25, 2014"}, {"Title": "all 4 stopped working, wont load past android logo.", "Author": "sylvia", "ReviewID": "R3RQGWTOA4YQHE", "Overall": "1.0", "Content": "I bought 4 and all 4 stopped working, wont load past android logo. 3 stays on android logo and 1 shuts off after logo. has any1 else had this problem.", "Date": "February 15, 2014"}, {"Title": "cheap!", "Author": "Tarra G.", "ReviewID": "R79TCCK2XFCVT", "Overall": "3.0", "Content": "Mediocre tablet. Very cheap but I guess you get what you pay for. I suggest getting the warranty just in case.", "Date": "December 31, 2013"}, {"Title": "Worthless After Three Months", "Author": "Lena Marie", "ReviewID": "R2KWQDR4YHVKO4", "Overall": "1.0", "Content": "This item is crap. I took grest care of this item and it still has problems. Frezzes, Shuts down in middle of game, Wont hold a charge, charger port comes out and wont hold a charge, cant hold a charge to get through one movie on netflix. DONT BUY! Seller doesnt even contact you back about the issues with the product. Been trying to return or replace for 2 months now!!!!!!!!!!!!!!!!!", "Date": "December 29, 2013"}, {"Title": "Ok for kids", "Author": "Molly Olson", "ReviewID": "R2W5JMP6A8K12D", "Overall": "3.0", "Content": "WiFi is a little slow and the clarity is not what I expected either. I am just glad it is for a child.", "Date": "December 6, 2013"}, {"Title": "battery dies fast", "Author": "Lucky Lou", "ReviewID": "R1YE8EBA1ZHBCL", "Overall": "2.0", "Content": "The tablet looks good and seems to work fine. A little slow using the browser and downloading takes more than one try to get it to complete. The bad part is the battery only lasts about 30 minutes. I have to use it plugged in to get anything done. I guess you get what you pay for. My old pandigital had less features but the battery lasted almost 2 hours before I had to plug it in.", "Date": "October 1, 2013"}, {"Title": "Ok for the price.", "Author": "Bethrifty", "ReviewID": "R1ICBQMJPPMWSM", "Overall": "3.0", "Content": "Bought this for my 6 yr old. He likes it well enough. Some of the games we download do not work properly but other work fine. He can watch cartoons on it but the movies we downloaded are slow and skippy.", "Date": "May 29, 2013"}, {"Title": "Mypad 7 Inch Android Tablet PC 8GB, 1Ghtz, 1024 x 600 pixels,", "Author": "Laquita Steward Smith", "ReviewID": "R21KK26TWR5ZQT", "Overall": "2.0", "Content": "Mypad 7 Inch Android Tablet PC 8GB, 1Ghtz, 1024 x 600 pixels, Multi Touch Capacitive Screen, WiFi, Front Camera, G Sensor- WHITEWell you get what you pay for.......This does NOT charge via computer USB, it even says this in the user manual (available on the device), though support seems to think it does it is only 6gb of usable space none of the apps on the box were on the tablet and I can not find any SD cards to fit it. I contacted the seller the say that SD cards are not included and that I could pay extra for one I so I gave up and gave it to my kids and bought another Tablet that I can use that was not from Europe.", "Date": "May 13, 2013"}, {"Title": "Bad", "Author": "Dawn Finsrud", "ReviewID": "RK0WXYJWZAKVR", "Overall": "1.0", "Content": "This product sucks. I highly suggest you read reviews before buying. Unfortunately I did not. Good thing it is returnable.", "Date": "February 23, 2014"}, {"Title": "not worth it", "Author": "Stacie Frey", "ReviewID": "R3N046UJ3QICWK", "Overall": "1.0", "Content": "Pos.only have had it since December Charges but won't start up.  Holds a full charge for less than20 minutes. Bought it for my 100 year old. Super disappointed recommend not purchasing this tablet", "Date": "February 17, 2014"}, {"Title": "Bad", "Author": "Dawn Finsrud", "ReviewID": "RK0WXYJWZAKVR", "Overall": "1.0", "Content": "This product sucks. I highly suggest you read reviews before buying. Unfortunately I did not. Good thing it is returnable.", "Date": "February 23, 2014"}, {"Title": "instructions too small and won't connect to my wifi-but 2 other computers working", "Author": "Rush Fan \"ThisChickLuvzRush\"", "ReviewID": "R1APGVERQNUQ4J", "Overall": "1.0", "Content": "SOOO disappointed with this. it refuses to connect to the IP but my computer from which I am writing this is perfectly connected. The instructions are so damned small, you can't see a thing. Need a microfiche machine to read it. so pissed-should have spent a bit more to get something that works.", "Date": "December 21, 2013"}, {"Title": "Poor quality", "Author": "Jud", "ReviewID": "RVBR1QE1QOJVU", "Overall": "1.0", "Content": "It was not what I was expected, there are other brands that is a better quality in overall. The battery life only 2 hours the most. Quality of the screen is very poor. My daughter love my Kindle that's the reason I decided to purchased something she can play her games. She does not like it at all. I wasted my money!", "Date": "December 13, 2013"}, {"Title": "Battery life is terrible", "Author": "robert", "ReviewID": "R3UPI1F4C4RXL5", "Overall": "2.0", "Content": "I thought this would be an okay tablet to buy seeing as how I wouldn't be using it heavily. I was wrong. I wasn't disappointed until I realized that my battery charge only lasted thirty minutes. And for some reason some of the setup information that I want changed is never saved when I turn it back on. If I could go back and do it over again I would have spent a little more money on something nicer.", "Date": "December 12, 2013"}, {"Title": "Horrible quality control", "Author": "Spawn082", "ReviewID": "R24SW7APVWT3UA", "Overall": "1.0", "Content": "Was DOA never charged failed out of the box. Stinks because it was a test for several other gifts instead had to purchase from CDW to make my deadline.", "Date": "December 12, 2013"}, {"Title": "Don't waste your money on this product! You get what you pay for.", "Author": "Happy Husband", "ReviewID": "R3W09XPSPKH981", "Overall": "1.0", "Content": "Don't waste your money on this product! It's a waste. Poor quality. The charger doesn't connect well...no contact. Full battery lasted only 30 mins and after we had it for 1 month, it wouldn't even charge.", "Date": "November 26, 2013"}, {"Title": "BOGUS", "Author": "Shakisha Mccarter", "ReviewID": "R36O5ELMHQ4TRI", "Overall": "1.0", "Content": "The tablet don't even look, how it looks on amazon, the battery dies too quick and certain things want download. No I wouldn't recommend this to anybody. I choose I hate it cause it do.", "Date": "September 9, 2013"}, {"Title": "tablet", "Author": "jww", "ReviewID": "R34PIUMKNYTWTS", "Overall": "2.0", "Content": "seemed to work ok, but prong pulled out of charger first time it was charged up put it  back in and it worked a couple times then quit charging I have a new charger ordered at my expense, battery did not stay up long, very short cord on charger", "Date": "June 22, 2013"}, {"Title": "Another chinese brand-less tablet", "Author": "tastygrapes", "ReviewID": "R47OUZVBZITU4", "Overall": "2.0", "Content": "These devices are made in mass quantity at rock bottom cost in China and then resold under a variety of meaningless names, there is no such thing as a legit or counterfeit Simbans tablet as they all come from the same place in China regardless what reselling brand is slapped on them. In this case, no branding is present at all lol. Check out this hardware dump from the one I purchased here. [...]Just about all information provided in the item listing is current inaccurate, I've submitted most of the changes to Amazon so hopefully they update that. Some key differences to note.*Internal storage is not 4GB, its confusing but its much lower.*Android version is a very buggy re-imagination of 4.1.1*Can take a SDHC card upto 32GB, SDCX upto 64GB*CPU is not the A13, while the clock speed is similar its not nearly as powerful, this device has a ARMv7 based CPU comparable to the iPhone 3GS if that helps you understand*The keyboard is very unresponsive and buggy, typing a simple letter is a real chore, you can trigger keys that are no where near the key you are actually pressing. Voice typing didn't seem to work at all for me.*Battery life is pretty terrible, I didn't break it open to check the mAh but it would be totally depleted in about an hour of actual use, say watching a movie or browsing the web. Standby is about double that, It went from 90% to 12% in about 90 minutes of sitting beside me with wifi enabled. Mind you this device doesn't support cellular or GPS or Bluetooth so the run-time is really pitiful.*Wireless is a bit annoying, it for some reason can not see a hidden network, if you don't broadcast the SSID you will not be able to connect. For me this is no good, I prefer the hidden networks with MAC address filtering.*Video was very choppy playing back 480p but its suppose to handle 1080p just fine, I guess playback is relative, it was playing but very very poorly.Overall, the price is not terrible for what you are getting, which is really not much at all. I'm sending it back because the entire list of features is inaccurate and for my needs it just won't cut it. Maybe get a Google Nexus 7 or something, it might cost you $199 but you will get the processing power of 10 of these tablets that choke during just about everything.", "Date": "June 1, 2013"}, {"Title": "Four stars because of the super-low price", "Author": "R. Rusu", "ReviewID": "R2I5233KTPOWQL", "Overall": "4.0", "Content": "Just received one.  I give it four stars because of the super-low price.  May update the review after more use.Pros - higher than normal resolution (1024x600) compared to any other cheap tablets - * GPS, Bluetooth, and SIM slot (haven't tested yet, bit if they all work that's great) - bright and responsive touch screen - microSD card slot - pretty responsive web browsing (so far) - has manual buttons for volume on the side, and 4 hardware buttons in front - USB connector for keyboard/mouse (if desired)Cons - heavy--a bit heavier than a kindle Fire, haven't weighed it exactly - old version of Android, so a lot of newer apps won't run - don't see any micro-HDMI or equivalent for video output - though the charger looks like a standard USB charger, it doesn't seem to charge for other chargers (or from a laptop computer) - seems to not be able to connect to WPA2-Personal AES wifi, but connects to others, so I will just live with this", "Date": "April 22, 2013"}, {"Title": "not good", "Author": "angela", "ReviewID": "RD2OVTU7AJNUA", "Overall": "1.0", "Content": "Not what advertised it would be can not download most of apps needed kept saying app not available for download", "Date": "March 8, 2013"}, {"Title": "Not really worth it.", "Author": "Kat", "ReviewID": "R2IXVHJ3GWG1LF", "Overall": "1.0", "Content": "Okay this tablet was bought as a Christmas present for my daughter. It's now March 19th-and I'm about ready to throw the damn thing in the trash!!!I don't appreciate having to spend HOURS charging this just for a few minutes of playtime....my daughter easily got frustrated with it and no longer plays it.For the last 2 weeks it's been in the original box packed away.It won't charge anymore-it won't even turn on. The screen flashes off and on and that's it.Very disappointing because when she could use it-my daughter loved playing on it.", "Date": "March 19, 2014"}, {"Title": "no good", "Author": "Stormie ward", "ReviewID": "RJTWZCOVHF5WP", "Overall": "1.0", "Content": "Its not calibrated right freezes and wont conect to the game store wont ever buy another one. Would recommend paying more money for a better one", "Date": "March 18, 2014"}, {"Title": "it sucks", "Author": "SIDNEY", "ReviewID": "R24L8K466KAD1", "Overall": "1.0", "Content": "its not much considering the price but the worst thing is you cant use it unless its connected to a power outlet. a tablet should be able to go a few hours at least without it needing to be charged!", "Date": "March 4, 2014"}, {"Title": "poor quality", "Author": "aquarian", "ReviewID": "RG8KIEQ8DQEHS", "Overall": "1.0", "Content": "Could not get past opening screen.  Pamphlet was a photocopy of original and symbols were impossible to make out.  Text written in broken English so no help.  Returned item and replaced with much better product.", "Date": "January 18, 2014"}, {"Title": "Poor quality", "Author": "jessyca tucker", "ReviewID": "R2A6EVDPX433", "Overall": "1.0", "Content": "This would not let me open aps. I guess I get what I pay for. I had to return it and buy different one.", "Date": "January 13, 2014"}, {"Title": "Poor Battery", "Author": "D. Black", "ReviewID": "R3LYM3MCYQMB0F", "Overall": "1.0", "Content": "This tablets battery will not hold a charge. It can take as long as 24 hours to get a full charge and then only last 15 minutes.", "Date": "January 12, 2014"}, {"Title": "Not impressed", "Author": "D. Black", "ReviewID": "R2VBYUNP0ZP3FO", "Overall": "1.0", "Content": "I bought 4 of these tablets and everyone of them has a battery life of 15 minutes. I was very embarrassed giving gifts this poorly made.", "Date": "January 12, 2014"}, {"Title": "Just trying to save a little money", "Author": "Terri Williams", "ReviewID": "RNW598GQOWVUB", "Overall": "1.0", "Content": "Tablet won't charge.  Then when it finally does, it loses it very quickly.  I guess I paid for what I got.", "Date": "December 26, 2013"}, {"Title": "jelly bean", "Author": "Dorothy Wilson", "ReviewID": "RLE74I0TBFYL8", "Overall": "1.0", "Content": "It's very slow and it doesn't like to stay on what you are looking at. I would not recommend purchasing it", "Date": "December 25, 2013"}, {"Title": "Broke within a month", "Author": "Andrea S.", "ReviewID": "RUC9MMGDQ9VLL", "Overall": "2.0", "Content": "I bought this for my son's birthday last May. He loved it but it broke within a month. It would not power on. I emailed Amazon to get a replacement since it is supposed to come with a warranty. They gave me a refund and I had to just return it because Amazon said they did not sell the product so they could not give me a replacement. Ended up just buying my son a Nook. Don't waste your money on this.", "Date": "December 20, 2013"}, {"Title": "terrible knock off never buying a knockoff again", "Author": "Lacrystal", "ReviewID": "R3B0D6ZZR8UEQK", "Overall": "1.0", "Content": "U can tell its a knock off. First day it worked fine then second day it froze up. Front camera didnt work at all. You cannot i repeat cannot video chat. Waste of money. Still waiting for my refund.", "Date": "September 1, 2013"}, {"Title": "Non-functional", "Author": "Ms. No \"avid booker\"", "ReviewID": "R3KY02XCIT1E4Q", "Overall": "2.0", "Content": "This tablet came and stated that the SD card was damaged then it just burnt out on me was only able to charge it and setup the email address.  Had to send it back, was unable to turn it back on in order to clear off the email account I had set up. I then contacted Amazon for a refund to purchase another tablet.  Only had it for 6 hours before it was over.", "Date": "August 16, 2013"}, {"Title": "disappointed", "Author": "c", "ReviewID": "R16FUJ237J3HZ", "Overall": "2.0", "Content": "side charger ports broke within 2 weeks  of purchasing, can no longer use the tablet don't know what to do.", "Date": "September 6, 2013"}, {"Title": "Title says Jelly Bean 4.1 OS but product description says 4.0 Ice Cream Sandwich.", "Author": "kandiamo", "ReviewID": "R3UU86LMFU3KTM", "Overall": "3.0", "Content": "Title and product description says Jelly Bean 4.1 OS but product technical detail says 4.0 Ice Cream Sandwich, which is the previous operating system.Buyers might want to get the true OS in writing from the seller.  The OS may be ICS4.0 with a JB4.1 interface upgrade.  The difference is performance.", "Date": "May 28, 2013"}, {"Title": "not worth the hassle", "Author": "klikmaus", "ReviewID": "R2BYC5T7L9AEXE", "Overall": "1.0", "Content": "When you get a cheapo tablet, you expect low quality. Low res screen, laggy touch response, poor compatibility. This tablet, however, is beyonld bad. While it came with google play preinstalled, it WOULD NOT sync with my existing account nor would it set up a new google account. Additionally it would not even stay connected to my wifi access point for more than five minutes at a time without disconnecting its self from my connection. If I could give it negative stars, I would. RETURNED.", "Date": "May 22, 2013"}, {"Title": "Worst item I ever bought in my entire life!", "Author": "Deslyn", "ReviewID": "R3BTSOD2TZ4W7X", "Overall": "1.0", "Content": "I bought this for my niece because of the price. I was hoping it would be a nice little fun gadget that she can play with. The battery life is horrible, 30mins for the most. The screen freezes, and the device now operates very slow. I would return it if the return period didn't expired. Horrible! Hey I guess the price says it all huh!", "Date": "November 20, 2013"}, {"Title": "Simbans 7\" Android Tablet", "Author": "Nancy Raymick", "ReviewID": "REKCCGHVEJ38D", "Overall": "3.0", "Content": "I am not very please with this. It will not take very many apps.hard to find apps. that it will take. otherwise it is okay", "Date": "October 4, 2013"}, {"Title": "Horrible", "Author": "Julia", "ReviewID": "RBE1LIZ3DXMCO", "Overall": "1.0", "Content": "I purchased this product for my 12 year old nephew, we haven't even had the product for 24 hours and the tablet completely melted, I will be returning the product and do not recommend it at all!", "Date": "August 12, 2013"}, {"Title": "I mrs Josephine Collins", "Author": "josephine collins", "ReviewID": "R2DE741Z9FPVC2", "Overall": "2.0", "Content": "I am very displease with this device,I have no way to plug it up there's no instruction in the packaging and two of the same cards and I just receive it and will be returning it as soon as possible it want power on and I can't get it to charge wIthout a charger", "Date": "February 13, 2013"}, {"Title": "n lov", "Author": "dede", "ReviewID": "R2MR1245CG3PZ3", "Overall": "5.0", "Content": "im so n lov wit my tablet...thank so much it said it would b here n five days but I got it n 2 days n I love", "Date": "May 24, 2013"}, {"Title": "Do not waste your money", "Author": "Beulah D Watrous", "ReviewID": "R2B7G1Z4ZH3EZC", "Overall": "1.0", "Content": "I don't know whether or not I just got a bad tablet, but this is table was taken out of the box, had a full charge, set up the wifi and it shut down, I charged it, it would not turn on unless it was plugged in and even then it kept turning off. I returned it.I have four other tablets, a motorola xoom 2, a Samsung Galaxy tab 2, and two Asus Transformer pad Infinity, I have never had an issue with any of them, I bought this one for children that are in my daycare, I learned my lesson, will be ordering a new galaxy tab 2 with a gumdrop case.", "Date": "October 18, 2013"}, {"Title": "NOT HAPPY", "Author": "MARIALUISA", "ReviewID": "RASS1WY3LE2F5", "Overall": "2.0", "Content": "THE ITEM ARRIVED ON TIME HOW EVER THIS PRODUCT IS A CHEAP RUSSIAN TABLET AND IS NOT AN OFFICIAL GOOGLE TABLET", "Date": "February 9, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Better looks and build. Twice as fast as other tablets in the market.\nAt a fraction of the cost of an ipad or other tablets, it gives best value for money.\nBrowse internet via WiFi without paying any 3G charges\nA large number of FREE games can be downloaded from Google Play\nEnjoy movies on YouTube and it also supports streaming via NetFlix", "Name": "Simbans (TM) S72B 7 Inch Android Tablet PC - NEW MODEL Dual Camera, Android 4.1 Jelly Bean A13 1.2Ghtz, Touch Screen, WiFi, YouTube, Skype, Games - BLACK", "ImgURL": "http://ecx.images-amazon.com/images/I/41621gXGWOL._SX300_.jpg", "ProductID": "B00F1DB7X0"}}