{"Reviews": [{"Title": "SD Slot, Dual camera", "Author": "BRIAN A ROYAL", "ReviewID": "R32DL94WKULUZO", "Overall": "4.0", "Content": "It's got everything you'd expect of a non-cellular tablet. It performs well and the camera, microphone, WiFi and GPS have all worked flawlessly so far.Battery life is about 5 hours of continuous games (Plague, Inc. in this instance) or an entire day of casual web browsing while doing other things around the house.The only complaints I have are:*No HDMI (forgivable. The screen has a very wide viewing angle and clear, sharp picture).*Tinny sound (as with every device I've ever seen with small speakers).*Comes with Norton's promo garbage pre-installed, and you have to root the thing if you want to remove it (which I did, easily).*Their launcher, \"ideadesk\", will not let you delete home screens. You are locked into their default of five home screens if you don't root it and replace the launcher (go Apex!).Last note - Out of the box, there's an update to 4.2.2 (iirc) waiting for you on the net. The update does not prevent you from taking root. so no worries.All in all, for the price, it's fantastic. If the nexus had an SD slot I might never have discovered this great little tablet.", "Date": "October 21, 2013"}, {"Title": "Very nice!!!", "Author": "Marika E. Buchberger \"Shutter Bug\"", "ReviewID": "R35N0F8Q6J5YGS", "Overall": "5.0", "Content": "I bought this tablet to replace a Coby Kyros 7042 which fell off my desk and broke wide open, the screen cracking in half in the process.  Since Coby Electronics is now out of business I had to replace the one I liked but unfortunately broke.It comes nicely packaged including a quick start guide, a booklet of notices written by lawyers, the tablet, a DC wall adapter and a micro USB cable that plugs into the wall adapter or your computer.  Unless you have wall outlets that are pretty high up on your wall, you will discover that the USB cable is too short.  When you plug the cable into the wall adapter and then connect the tablet, you will find your tablet sitting at the edge of a desk or you may end up leaving the tablet to charge while it's sitting on the floor.  Buy yourself a longer USB cable to avoid problems.  The fastest way to charge the tablet is by using the wall adapter and I recommend you charge the tablet before you turn it on for the first time.Once the battery is fully charged, which takes a few hours, start the tablet and answer the default questions.  Then, it's very important that you find your way through the menu of the system settings because Lenovo has an UPDATE for the tablet which resets your tablet to \"out of the box\" condition.  Do your customizations AFTER you update the tablet.The tablet does NOT accept SIM cards, not the version of tablet that is sold in the USA.  While the quick start guide refers to the tablet being able to accept SIM cards, it does NOT accept SIM cards, there are no sockets for SIM cards.  There is one socket for a micro SD card.  Use it.The screen has beautiful color and images and text are sharp and clear.  It's about as heavy as other seven inch tablets.  The back cover of the tablet easily removes so you can see the slot for the SD card but nothing else is visible. The tablet easily connects to a wireless network and the antenna seems very potent and is able to quickly connect to wi-fi networks, even those with weak signals.It comes with a lot of apps pre-installed including Google Play Store.  Skype runs very well including the video chat.  The microphone is sensitive, you don't have to scream to be heard.  The tablet is not \"rooted\", if you want to root the tablet I'm sure there are methods available on the net.  You know where to look ;)It's very well made, feels solid, not flimsy at all.  A good selection of wallpaper including live wallpaper and you CAN add your own.  16 gigs of memory and a quad-core processor makes this tablet an able-bodied winner.  Movies stream effortlessly from Netflix and other sources.  The speakers are a bit tin-like but they are LOUD.  The built in music player has an equalizer so you can adjust music to your taste.  Wear earphones for the best possible sound experience and to not annoy those around you.For the price you can't go wrong.", "Date": "December 28, 2013"}, {"Title": "Nice little tablet", "Author": "SUDS \"SS\"", "ReviewID": "R26KWJKOQDTWX7", "Overall": "4.0", "Content": "I own a lot of different tablets (Samsung Galaxy Tab 7.0, iPad 2nd Gen, Samsung Note 8.0 and multiple iPod touches). For a long time I was an Apple fan, but last year I bought my son an iPod touch and less than a year later they stopped upgrading it with the rest of their products. Also, I tried a few Samsung Android tablets and I really liked them. I especially liked the fact that I could add memory to them. So how did I end up with this tablet? Well, my kids were fighting over the Samsung Tab 7.0 and my older son was not at all interested in his iPod touch unless we were on a trip and each kid had their own device. So, I started looking for a replacement for his iPod. I was able to trade in 3 old iPod touches (two were a generation older than my son's iPod touch and then his) I put the money from the iPods toward this device (I got a deal from the manufacturer and my employer) and I bought this device. I picked this over the Kindle and the Google device because you could add memory. I picked this over the Samsung Tab 3 and Samsung Tab 3 Kid because I was able to get a good deal on this one and because Lenovo makes the computers that i use at work and they are nice computers.The first app that I put on this was a sandbox type app that can lock the device down for kids to use it. I have the app on both the Samsung Tab 7.0 and this device. I bought the app a long time ago, but it makes the device kid friendly without having to buy a kid device. I tried to compare this device to the Samsung Tab 3.0 Kids, but when I went to best buy to check the kids device out I could not get it to turn on. I think it was broken.Overall for this device, the image on the screen is very nice, the sound seems nice, but my son uses headphones a lot so i generally don't hear it. All but three of the games that my other son has on the old Tab 7.0 worked on this. Oddly enough I think they may not have worked because this is a higher level device than the old Tab 7.0 (I think it was one of the first Samsung tablets). The battery life seems to be just ok. Nothing special, but there are probably things i could do to improve battery life, but I have not done so yet.This device is not as powerful as my Note 8, but it was much less expensive so I am fine with that. In searching the web and the play store the Lenovo seems to work well. Videos look nice and sharp. My Samsung Note 8.0 can also get a higher/faster level internet speed that this device and other older devices cannot get (the computer that I am using to type this also does not get the faster internet). I have not noticed any problems on the Lenovo a3000 in not having the higher internet option.The device uses a generic micro usb charger which is nice and is the same as my Note 8.0. The benefit of this over the iPad would be the price and the fact that you can add extra memory. There are some games that you can get on the iPad that you cannot get on this device, but over the past year I have noticed that the kids games in Android are improving.The one important thing to note in an Amazon review is that you cannot watch Amazon Videos on this or most other Android devices (there is a way on the Samsung Note 8.0, but the same steps did not work on this device). In doing some research it seems like this is Amazon's choice and not a limitation of the technology in most Android devices. It would be nice if Amazon would release the Amazon Video app for all Androids as they released one for Apple devices.The Kindle app does work and my son was excited to read books on this device versus his old iPod touch which was very small.Overall, I would say that this is a great device for the price. I gave it four stars only because i could not do 4.5. It is not the best device out there, but for the price is it is very nice! My son is pumped to have this instead of the iPod touch!One last thing, it is kind of hard to find a kid friendly rubber type case for this tablet. I was able to find one on eBay, but Amazon did not have a rubber case that would fit this tablet.***Update***For some reason this tablet tends to ding when in the car. It seems like it is linking onto wifi signal and dings when it loses access. I am not sure why it dings and I cannot figure out how to turn it off. My son calls it his vio-link every time it dings and at this point it is kind of funny, but if you carried it around with you a lot this might get irritating. It was worst at the mall one time.Since writing this review I have purchased the equivalent Dell tablet for my other son. The two tablets are very similar (the Dell does not ding/have a vio-link). Here is a link to my review of the Dell tablet. http://www.amazon.com/review/R2N30IO1CF55KI/ref=cm_srch_res_rtr_alt_7", "Date": "January 19, 2014"}, {"Title": "love it", "Author": "kelly kelley", "ReviewID": "R1ZFE9X3NONOYZ", "Overall": "4.0", "Content": "My daughter loves this tablet so much and itvruns apps just as good as a smartphone I recommend this to someone who wants a good tablet.", "Date": "January 31, 2014"}, {"Title": "great tech item", "Author": "Arthur Moss", "ReviewID": "R3MWIJKBG50FCG", "Overall": "5.0", "Content": "Bought this for the kids to use at home and we just love it.  We installed a wireless router for Christmas and now we have multiple ways to access the web.  My daughter is becoming the guru for the tablet and she loves the free apps from the Google store.  The only drawback I have is that I should have gotten a 10 inch screen, but that's because I use reading glasses and sometimes can't find them when I'm on the tablet.  I do recommend this.", "Date": "January 9, 2014"}, {"Title": "A bit dissapointed", "Author": "dragosh", "ReviewID": "R2GAVANH43AQRW", "Overall": "2.0", "Content": "Hello. I have recently purchased this tablet, and it is working as it should be.My main problem with it is that after just 4 days one pixel died (it is permanently white). Probably I am unlucky, i guess.If I was living in the US I would have surely returned it, but now I would have to spend lots of transport money for this, and it is not cost effective.", "Date": "December 17, 2013"}, {"Title": "good", "Author": "Shawna", "ReviewID": "RFFLC4SO60WKX", "Overall": "4.0", "Content": "Its a good tablet. At first it was a pain in the butt but there was an update. It took a while to do so but now it works fine. There is only 16 GB to use but the expandible is use for pictures and music. Not for games or other things on the tablet.... It sucks but with the update u have the full 16 GB instead of 1 GB internal drive. Overall I like it. It was a bit to get adjusted to the bigger screen size from My 4.3\" trio tablet", "Date": "March 10, 2014"}, {"Title": "Very Good", "Author": "Martin Leonardi", "ReviewID": "R2AQPF2JL5TPHC", "Overall": "5.0", "Content": "The product it's awesome and perfect if you are looking for reading books or do simply office work.  I recommend it!", "Date": "February 21, 2014"}, {"Title": "Marvelous!", "Author": "xm8k36d", "ReviewID": "R3HF9S99L19C35", "Overall": "5.0", "Content": "Love this! Arrived in time in good condition, price is great, processor is quick, could play games and watch video and surf internet with it at high speed.Only complaint: you have to remove the back plate to insert the MICRO SD card. A bit unnecessary.", "Date": "February 18, 2014"}, {"Title": "Great quality for the price", "Author": "Jeff Seyler", "ReviewID": "R1TNDHJJSB4Q1C", "Overall": "4.0", "Content": "Liked it b/c it has two cameras, most tablets at this price didn't when I researched them. Has been great. Bought two for kids aged 9 and 10. They love them.", "Date": "January 26, 2014"}, {"Title": "Great First Tablet", "Author": "kaysha", "ReviewID": "R61SVAF8C33RI", "Overall": "4.0", "Content": "Very fast, but the available space is lacking a little. I really like that its flash enabled though. And I supposed I could just put a SD card in it, their is a spot for it in the back. I would recommend this to anyone that is looking for their first tablet.", "Date": "January 25, 2014"}, {"Title": "Great little tablet for the kids", "Author": "graham vaughan", "ReviewID": "R1LPEMQZGBDKBU", "Overall": "5.0", "Content": "I bought two of these sight unseen for the kids for Christmas.  It has really been a terrific device for them.  Easy to use and understand.... even for us adults.  I might give up my Ipad for this.", "Date": "January 20, 2014"}, {"Title": "LOVE THIS", "Author": "Marko Realmonte", "ReviewID": "R2YV1OQS09A8SD", "Overall": "5.0", "Content": "I had an Ipad that shattered, try to fix it to no avail.  This is better.  Does what the Ipad could and more.  I especially like that you can add micro sd memory to the pad.  I use a separate keyboard (android obviously) so that I can write my daily Evernotes.  Movies and videos are also really nice on this.  Good battery life too.  I just bought a cover for it, so I'm hoping it will last a long, long time.", "Date": "January 15, 2014"}, {"Title": "lenovo idea tab A3000 7-inch 16 gb Tablet", "Author": "john a. pilgrim", "ReviewID": "R3FUSZ3FZ5E8EX", "Overall": "4.0", "Content": "Have trouble with Maps unable to use the tablet off line for this application.Instruction are not very clear but as I use this I will learn.", "Date": "January 7, 2014"}, {"Title": "Best gift ever.", "Author": "jacobmunger", "ReviewID": "R31T5N3XDPER6G", "Overall": "5.0", "Content": "I received this tablet as a Christmas present from my awesome parents. I love this tablet and I like the large memory it contains. 2 days and 30 apps downloaded and not even a third of the memory used. It makes a great first tablet. Definitely worth any cost.", "Date": "December 27, 2013"}, {"Title": "Lenovo IdeaTab A3000", "Author": "Krys", "ReviewID": "R6BQ5BUME4L1M", "Overall": "3.0", "Content": "Thought I was buying a dual sim tab based on pictures and some reviews (my bad) however this was not so. That being said the tab as it stands is ok.", "Date": "January 2, 2014"}, {"Title": "Good android 4.2 tablet.", "Author": "Fred L. Jones", "ReviewID": "RP2ZQUAKAKINW", "Overall": "4.0", "Content": "With it's dual core processor, the A3000 is a good android 4.2 tablet. It is fast and runs droid apps well. It looks to be well built, and I have always experienced good and reliable products from IBM/Lenovo over the last 30 years. So I continue to buy from them.", "Date": "December 24, 2013"}, {"Title": "excellet", "Author": "carlosperezpulido", "ReviewID": "R2BA77DI8HMCXF", "Overall": "5.0", "Content": "better than sansung, good size, good color, open very quick, easy to work, but dont alaud wassapp mesenger its requier dowload other sofware", "Date": "June 5, 2014"}, {"Title": "Great buy", "Author": "M. Hannah", "ReviewID": "R1I26Q4PJFD81G", "Overall": "5.0", "Content": "This is my 2nd Lenovo. The 1st one I dropped and broke and after looking at tablets in this price range decided to get another Lenovo with the 16 GB. It is even better than the 1st one. I love the duel camera. I have no complaints about the tablets for the money and would buy again. Even thought about buying an extra for back up", "Date": "May 21, 2014"}, {"Title": "Good.", "Author": "NBP", "ReviewID": "RZ39DHT76MJ8Y", "Overall": "5.0", "Content": "The build is good and smooth. This is a gift to my brother who is new to Android tablet. He's very happy of the performance and the price is right.", "Date": "April 29, 2014"}, {"Title": "lenovo", "Author": "Amazon Customer", "ReviewID": "R1QG9V2OFB4BNQ", "Overall": "4.0", "Content": "Adequate for the price. OK performance does the job for which I bought it for. Good product  for the price.", "Date": "March 17, 2014"}, {"Title": "Lovin' This Tablet!", "Author": "nicki creel", "ReviewID": "R3URHVWXYJFM2A", "Overall": "5.0", "Content": "Loving everything about this tablet! Got it as a gift for my husband for Christmas and we use it for note taking, web browsing, social media, and movies.  Everything runs quickly and the pictures are clear. We have several Lenovo products and they all run exceptionally well!", "Date": "March 16, 2014"}, {"Title": "I have a problem with the tablet", "Author": "Juan Carlos Bravo", "ReviewID": "R26UTXB5XQPH7A", "Overall": "1.0", "Content": "Good morning.I have a problem with the tablet, I received it ok, but a month later, it started to present troubles, and it's not working any more. I think is a battery problem, because it's not charging. I would like to know what can I do to solve this problem. I also want to know if there is any guarantee that I can use or anything else.Thank you very much", "Date": "February 28, 2014"}, {"Title": "This is a great low budget tablet.", "Author": "Telford W.", "ReviewID": "R1PIPOKZK26SR9", "Overall": "4.0", "Content": "I got this for my daughter for Christmas.  It's relativity sturdy.  The display is bright and the screen is responsive.  What I like mostly is that I can install apps from the play store onto the external SD card. The speaker has decent quality and the rear facing camera is good but not great in low light.  The from facing camera is very good for skype or Google hangout.  The one draw back is the 1280x800 display.  Due to some application don't scale. Other than that, i give it a 7 out of 10.", "Date": "January 17, 2014"}, {"Title": "Excelent tablet", "Author": "Miguel Angel Rodriguez Marin", "ReviewID": "R3G66SROFP0FL", "Overall": "5.0", "Content": "Very happy with my purchase and i enjoy this product in my work and my home. I cun with them", "Date": "December 28, 2013"}, {"Title": "Great little tablet", "Author": "David F.", "ReviewID": "R2Y5MNO3KNSIPQ", "Overall": "5.0", "Content": "We just bought this tablet on Cyber Monday for quite cheap. Finally received it in the mail yesterday (did not order from Amazon) and so far its great! For the price of $120 we really could expect more. The speakers are slightly tinny but other that that its great! Its a tough little thing so far too, survived a tough fall already just fine. Over all I would order it again.", "Date": "December 24, 2013"}, {"Title": "crap quality", "Author": "amber lovelady", "ReviewID": "RPXSO4JSS50JX", "Overall": "1.0", "Content": "bought in january  stopped charging  sent back they sent me new one around same length of time had the first one  the second one stopped charging but now the 30 warranty has expired this product is a ripe makes u have to keep buying great running  system but kinda need to be able to charge it to use it", "Date": "March 25, 2014"}, {"Title": "Excellent deal", "Author": "Vance Freeman", "ReviewID": "R94DU2FJWU2WD", "Overall": "5.0", "Content": "This tablet is the perfect size for my needs and its super fast.  My neighbor has the kindle hdx and wishes that he had bought this tablet instead for over 100 bucks less.", "Date": "March 10, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F2ENU2O"}}