{"Reviews": [{"Author": "Paul D. Bancroft", "ReviewID": "R2IC1KQ640O8H6", "Overall": "4.0", "Content": "I bought 2 of these (32 GB) about 10 days ago - one for me, one for my wife.  Got mine as an addition to my 2012 Nexus 7 because I wanted a larger screen.  This tablet compares pretty well to the first generation Nexus.  Speed and screen resolution are about the same and the larger screen on the Dell is easier on the eyes.  Many of the criticisms you read on other reviews are accurate: touchscreen sensitivity, headphone volume, battery life, etc.  It's not perfect.  But, the issues are relatively minor, especially since the price is so low (got mine on sale after Christmas).  I did get the update to 4.3, but there are a couple of video apps that still won't work: HBOGo and CNN.  Even so, this tablet has become my daily driver and I think it's an excellent value for the money I paid.  I really like having the microSD card slot, too.The tablet I got for my wife is her first Android device.  Until now, she was strictly a \"fruit\" tablet/phone user.  She uses her Dell every day now.  She does miss the screen resolution of her iPad, but she likes the size of the Dell and has no other complaints about this tablet.  I see her using it more than her iPad around the house now.Pros: price, 8\" screen, microSD slot, speed, bright screen, 4.3 updateCons: mediocre battery, occasional touchscreen issues, headphone volume could be higher", "Title": "Excellent value", "Date": "January 13, 2014"}, {"Author": "Danny V", "ReviewID": "R4VTW22G6RRE3", "Overall": "5.0", "Content": "Wow I have had my Venue for  few weeks now and I love it. I am replacing a first generation iPad that slowed down to a crawl. In the first few days of owning this,my first Android device, all of my iTunes music was transfered to Google Play and I found every app that I needed for productivity. S a good size and much lighter than my old tablet. I like it that I can buy a 32G micro SD card to put all my movies on while my tablet is free to use its onboard memory to run apps. The CPU is rated faster than the Samsung Galaxy. At the low price I bought two of these for my household. This is the best deal of the season.", "Title": "This is a must have tablet", "Date": "January 17, 2014"}, {"Author": "Marc C", "ReviewID": "R48O675N6VKB3", "Overall": "5.0", "Content": "It is my first tablet - I have used laptops for the past X years - and I have really taken to it.My only complaint would be the difficulty in removing an additional Micro SD card but it will eject with sharp fingernails.", "Title": "Excellent Tablet", "Date": "January 11, 2014"}, {"Author": "Happy Amazon Customer", "ReviewID": "R31ODST4SEWT87", "Overall": "5.0", "Content": "My tech savvy kids did not ask for this for Christmas. But, it turns out these were their favorite gift. They take them everywhere. They are the android versions. Great speed impressed them. No hick-ups in functionality.", "Title": "Great gift.", "Date": "January 9, 2014"}, {"Author": "Madan", "ReviewID": "R2742DWSBNCIY", "Overall": "5.0", "Content": "excellent for 130$ tablet!!! Superb Tablet... only worry is battery life.. I dont mind it for such a cheap and an excellent TAB!!!", "Title": "simply the best for this budget!!!!", "Date": "December 31, 2013"}, {"Author": "Cesar Little", "ReviewID": "R605OA4RHAIA6", "Overall": "5.0", "Content": "I bought this for my girlfriend. She is been using it for a few days now, she is very happy with it, everything works and you get a good tablet, pretty fast, she reads, takes photos, listens to music. Is a good affordable product and honestly runs as good as my ipad mini which was more expensive. Im not a tech genius, probably when it comes to that, there are better products, but as a general customer Im satisfied and so is my girlfriend.", "Title": "Great", "Date": "December 13, 2013"}, {"Author": "JASON A GRETZ", "ReviewID": "R1OO1ZJAQR3JLN", "Overall": "4.0", "Content": "Pros: A lot more high-powered then other tablets around this price range.Cons: The battery is not as good as the description says, even for reading. I am going to look for an app that turns everything off but the reader while in reading mode.", "Title": "Great tablet - not as great a battery as description states", "Date": "December 9, 2013"}, {"Author": "tao45", "ReviewID": "RTBSFSXI0OY3A", "Overall": "4.0", "Content": "Update:  4.3 update release 12/19/13 adds back multi-user profiles.Update 2:  Seems not everybody has received this update yet.  Still waiting for wide release of 4.3.  Hopefully it will come soon to all.I'm very pleased with my purchase of the venue.  For it's primary purpose running apps and doing it smoothly it's terrific.  The build quality feels great and the apps run smoother than my high end smart phones.  So even at the full retail price i think the Venue 8 is a solid buy.  However, there are some downsides to it and you need to decide if they matter to you or not.Cons:* USB charging port is in a spot that makes it difficult to charge if you are using a cover.* Dell disabled multiple user profiles* Battery life is sub-par - but still acceptable and not worthy of complaint unless you're a very heavy user* Internal speaker could not handle highest volume without serious distortion.The decision on if this is the right tablet for you is really based on what you need it for.  I primarily user it for a couple hours in the evening to read, research, shop, or play a simple game.  So the cons listed above are not deal breakers for me.  Decide for yourself what is important....if the negatives are acceptable this is a solid buy.", "Title": "Solid tablet if you can live with a few issues", "Date": "December 6, 2013"}, {"Author": "Jeremiah S.", "ReviewID": "R2PGWC1Z2ZL6TR", "Overall": "5.0", "Content": "I just purchased this from dell as well and its is beautiful. Works like a charm. the graphics are extra ordinary. Slim and easy to hold. Only thing im having problem Im having is getting flash to properly download. But thats just because of my network the device is 6 stars out of 5. thats how good it is. Best tablet", "Title": "The Best Low priced Tablet.", "Date": "November 24, 2013"}, {"Author": "W. Henry", "ReviewID": "R3MOVS4BK9L21W", "Overall": "5.0", "Content": "Pros:8\" is perfect sizeThin and lightgood lookingeasy to hold with one hand, rubberized backFast, 2GB RAMPure Android OSIPS screen offers good viewing anglesspeaker has good volumeSD card expansion slotLow price vs its competitorsCons:resolution could be better, but not a problem at this screen sizebattery life is good (8 hours screen time), but less than competition (10+ hours)I've had this tablet for 5 months and you can't get better bang for your buck. I also have a Nexus 7, which is simply too small and doesn't have SD card expansion. Both run pure Android, so I would recommend the cheaper Venue 8 over the Nexus 7 any day.Regarding battery life: the battery will last a week if not used, so the battery life can be good. 1st make sure GPS and Bluetooth are off. 2nd, go into wifi advanced settings and set \"keep wifi on during sleep\" to \"never\" and check the box for \"wifi optimization-minimize battery usage while wifi is on\".", "Title": "Unbeatable for the price", "Date": "May 3, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3NFW8A3KLOBFA", "Overall": "4.0", "Content": "I got this to replace my original Nexus 7, which was feeling a bit small. I find 8 inches to be the perfect size. I will compare it to the original Nexus 7. It's basically the same, just as good as, the Nexus. However, internet is a bit faster - did my own side by side comparison. It has a camera, and although not a great camera, it's fine for taking pics of docs with camscanner, which is what I needed. It is just as responsive, maybe more so, then the Nexus.A couple of things to help older people due to the size. Go to settings, open accessibility, and change text to huge. Then open chrome and go to settings. Open advanced settings and play with text size. I mainly use my tablets for reading news, so the above was crucial for making reading pleasant.There are other tablets in this size that are better, but more expensive. I really wanted to buy from a US owned company, so this was it for under 200 bucks.I also have a second gen iPad, and reading on this is just as easy. We also bought a cheapie 99 dollar tablet from Walmart called a Nextbook, which is actually quite zippy, but not so great resolution, so this is way better than that.All in all, while it doesn't blow me away, I am happy with it. Perfect size for travel and reading the news. I watched some videos and it didn't stall or anything, but I don't use  tablets to watch movies so can't compare. It worked fine.I've not had screen freeze as I've heard others report.", "Title": "It's pretty good", "Date": "April 17, 2014"}, {"Author": "chris McArthur", "ReviewID": "R3Q1QDFV9B4PSF", "Overall": "5.0", "Content": "I was not willing to pay Samsung's extreme prices. The venue has serious power and does not lag. The camera is really good in the right lighting. The Intel processor is really the reason I love this thing its so smooth. Running the latest in android. Running better than any touchscreen device I ever owned. I have had this product for 1 month but it seems like a very well built piece of hardware. No issues at all. I really can't see how Samsung can charge so much. Dell kills them with This tablet. Giving you a speedy device with a very bright and clear screen. The resolution is well more than adequate. Apple also is a crock charging as much as they do....but I won't get into that. I have used the Samsung galaxy tabs. Sorry not worth the over pricing.Overall, if you my friend are looking for a tablet.....here is your answer. I may buy the next generation of this when it comes out. It does mostly everything you need, and I expanded with a 16 gig micro SD. I use nothing else to web browse very smooth. For me opening apps is flawless. Using Intel may put this thing over the top. So fast. The WiFi works perfectly. Intel atom 2.0 GHz. Its just the fasted loading tablet ever. It pops on so fast. Holds a charge forever. This thing is as close to perfect as it gets without a super amold screen(whatever).Dell made a great tablet.", "Title": "NICE!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "March 7, 2014"}, {"Author": "Kelsey", "ReviewID": "R3V8HXMA9OKIGJ", "Overall": "5.0", "Content": "So I had some Christmas money left over and really wanted a new tablet after being completely fed up with my Kindle Fire HD. I really wanted an iPad mini, but didn't have that amount of money sitting around and really couldn't wait to save up another $200. So I originally was going to purchase a Samsung Galaxy Tab 7.0 because of the excellent price point, but decided against it after reading multiple bad reviews. I thought I was going to be stuck with nothing more than my iPod touch 5th gen for apps until I found this in my list of suggested items. I really couldn't be more pleased with this tablet. First of all, amazon has amazingly fast shipping, because this arrived 2 days early!! Upon opening the box, I noticed that this tablet has a really, really sharp design. The front looks like an iPad mini without the home button. The back has a nice finish that is soft to the touch. Kind of attracts finger prints, but that isn't a problem if you pair it up with a case like I did (I recommend Poetic's black leather folding case, really sharp and fits like a glove). The battery life is okay, but you definitely won't get 10 hours out of it like you would an iPad. But let's be honest, you are spending less than $200 on a tablet. Should you expect to get 10 hours of continuous use out of it? No way. I'm really liking the screen size too. Not too big, but not too little either. The 8 inch is definitely the way to go as far as I'm concerned. The screen is sharp and very easy to read on. I've had this for about a week now, and couldn't be happier with it. Dell has hit an absolute home run with the Venue 8.", "Title": "For this price? Can't be beat!!", "Date": "February 3, 2014"}, {"Author": "William Mackenzie", "ReviewID": "RSKQI90B9IPLJ", "Overall": "5.0", "Content": "This tablet is fast, easy to use, logically configured.  The screen is a bit small as I am used to using an iPAD, but this is more mobile and lighter for trips.  It is easy to pack and go.", "Title": "great screen", "Date": "January 28, 2014"}, {"Author": "Shawn", "ReviewID": "R25XSH6QM41ZUJ", "Overall": "5.0", "Content": "I've spent too much time working and playing with tablets of all brands. I bought this on sale after taking just half a glance at the specs. The processing power is excellent. Sketchbook, photoshop, NFS games.. You name it, it will run it without stuttering or lagging. I'm very impressed! The screen is nice and bright. Quite usable in daylight, and to the point of blinding when it's in a dark environment. The rubberized coating also has a premium product feel to it.I'd like to note that being 8 inches is probably the best thing about the device. It's perfectly small, perfectly large. You can put it in your pocket (I carry mine in my inside jacket pocket). You don't have that feeling like the screen is too small, like on a 7 inch. \"One inch makes a huge difference.\" - She", "Title": "Amazeballs Fast!", "Date": "January 14, 2014"}, {"Author": "Perceptive Reviewer", "ReviewID": "R21C7272HAPJ0I", "Overall": "5.0", "Content": "This is a great little tablet.  The build quality is AWSOME.  I would expect nothing less from Dell (which is why I bought the brand).The battery has been lasting anywhere from 6.5 to 7.5 hours on a single charge (largely determined by how much surfing you do).  The touch screen is responsive and easy to use.  The processor is snappy and quick.I would highly recommend this device to anyone.", "Title": "Well Made And a TERRIFIC VALUE!!!", "Date": "January 12, 2014"}, {"Author": "Julaine M Roth", "ReviewID": "R3H3FJ4E3FD4AC", "Overall": "4.0", "Content": "What a great alternative to a lap top.  Still like having a real keyboard but that is why I still have a desktop and a laptop.  Only thing was the adobe flashplayer for my games.  Managed to work around it and got it loaded with a jump drive.", "Title": "Great tablet", "Date": "January 11, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1SWRC2CP0AQNU", "Overall": "5.0", "Content": "I have had several Dell computers in the past sooo  I am extreme satisfied. the tab. performs in all areas WOW it is GREAT!!!!!", "Title": "Dell satisfied return customer", "Date": "January 10, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2K4GMDWPRSYA2", "Overall": "5.0", "Content": "Purchased this tablet to augment my PC.  It has been great!! We use it for social networking, email,  watching movies and TV.  Battery life is sufficient for us.  I may have to buy a second one because my family likes it so much.", "Title": "Perfect for my needs", "Date": "January 10, 2014"}, {"Author": "Mario", "ReviewID": "RZWLG78DWOH9R", "Overall": "4.0", "Content": "Purchased 3 of these for holiday gifts.  The performance (video, app-to-app navigation, browsing, etc.) is excellent; better than I expected considering the reviews comparing this item to pricier tablets.  YouTube videos look crisp and color is rich.  $ for $, this is possibly the best value out there for a tablet.Maxed them out with an additional 32gb of sd card memory and my tech savvy kids LOVE, LOVE, LOVE their tablets.  Couldn't tear it away from them if I tried.Possible improvements for the next generation:1. Up camera resolution and add flash.2. HDMI output.Those two things would earn it 5 stars. Other than that, this tablet is a winner!", "Title": "Very Good Value...Performance better than expected", "Date": "December 25, 2013"}, {"Author": "Josh", "ReviewID": "R2ZNA63UDNU5XX", "Overall": "4.0", "Content": "I have had this tablet for two weeks and writing this review on it. I mainly use this for Netflix, Hulu Plus and basic games like Candy Crush Saga and Angry Birds. I have not had any problems running them. I am not really interested in the high end games for tablets, but did download one to see how it would run. If you are looking to play high end games,  I suggest paying the extra for the latest Google Nexus 7.Here is a list of things I like about this. I like having the extra inch for the screen. The tablet fits comfortably in my hands. While not as vibrant as the newer tablets, the HD screen is still nice looking. I can run multiple apps at once with no problems thanks to the 2GB of RAM. The micro sdhc slot lets you store files so you are not bogging down the tablet's on board memory.To drop the price, Dell had to cut some corners. The cameras are of poor quality. While certainty functional, the OS is a couple of generations behind. The one speaker is okay at best, but you could always use headphones or bluetooth speakers. The battery is a disappointment. I can get about four hours of life while streaming, or playing games.I am actually returning this tablet because of a defect in the micro USB port. The housing for it is loose, the plug for the cord fits loosely, and often, it will not charge the battery because of this. I did not factor this in to my rating as this could be a one time problem. I will update this once I receive the new one and am able to test it.", "Title": "Does all that I need it to", "Date": "December 18, 2013"}, {"Author": "M. Bell", "ReviewID": "R11KUN0NGV6HDK", "Overall": "5.0", "Content": "Got this for $139 on Green Monday. It's now my \"Go To\" device for email, web surfing, online gaming and streaming entertainment. Smooth as silk Netflix, Pandora, etc. Who needs a bulky laptop? Not me, because this tablet rocks.", "Title": "Green Monday Deal", "Date": "December 16, 2013"}, {"Author": "Karine", "ReviewID": "R2TB03O7P9AAHM", "Overall": "5.0", "Content": "Overall fast tablet. The screen resolution isn't amazing but its not horrible. The screen is very responsive. Both cameras suck, basically, too grainy. I couldn't get flash to work. I had to return one for a screen defect, 2 pixel line that runs parallel to the bottom and shows the inverse of the color displayed only in landscape mode (turns out its like this on all of them!). The tablet comes with a standard version of android. Its just a very good tablet for the price. I would even say its better than the iPad mini in terms of specs and performance. The inverse lines don't bother me as they're not big and very unoticible.", "Title": "Better than I expected.", "Date": "December 12, 2013"}, {"Author": "Tracy Kaufman", "ReviewID": "RV6DCTBG4Y9S0", "Overall": "5.0", "Content": "I did a lot of tablet research before settling on the Dell for my son's 13th birthday, and it definitely paid off. He loves it! He mostly just plays games (LOTS of games) and surfs the web, and he hasn't been disappointed in its performance once.", "Title": "Best value I found", "Date": "March 25, 2014"}, {"Author": "TrickT", "ReviewID": "RWI9M3E9VKZG9", "Overall": "5.0", "Content": "I use this unit for work and home.  Wanted a device, non-Apple, that I could write notes, take images and keep logbook type entries at work and home. It has done all that I have asked and more.Processor - zippy and responsive.Handwriting, tapping etc - excellent, keeps my notes the way I write themBattery Life - can go for days without plugging in, if I turn off GPS and WiFi, otherwise, need to plug in and charge every 2-3 days of 3-4 hours use per day.Screen - excellent, could be a bit brighter in daylight, but is awesome indoors and at night (maybe LED display comming?)Sound - adequateOverall, I purchased this product from Dell because of the the Dell reputation. The battery life, without wifi and gps on, is excellent, can run for over a week of 1-3 hours use per day.  ( I use standby a lot.)For notes, I have been using Handrite, but there are others out there.Would recommend for work or home if want reliable, quick Android tablet.", "Title": "Well Worth the Price - Keep Charger Available", "Date": "February 28, 2014"}, {"Author": "yeeware \"syee\"", "ReviewID": "R27K9N25ECNNBH", "Overall": "5.0", "Content": "Finally took the plunge and got the 32 GB version after months of deliberation and research.I was very concerned about battery life, but someone here on Amazon advised turning off the GPS and Wireless connection when not in use, and some other apps that do automatic updates, etc. This helped tremendously to save power. I don't use this device a lot since I have HTC EVO LTE phone and various laptops at home that I do actual work on. I do use it while co-piloting in the car. GPS works great, and OK without the wireless access. I actually wifi-tether and that works fine. Connects to home network fine.Love the 8\" vs. 7\" screen which was a main decision factor. It's just that much better for web browsing,reading, etc.2 CONS to note:Can't stream video from Amazon, Adobe FLASH required. I believe there's a workaround that I need to investigate.No HDMI jack to connect to my tv.Overall pretty fast.Overall VERY Happy.", "Title": "Great! Fast, does ALL I need.", "Date": "February 16, 2014"}, {"Author": "Marshall A. Jacobson", "ReviewID": "R1K4GKS32D1WZT", "Overall": "5.0", "Content": "Everyone should have one of these.  I never have had anything that used apps before and I never knew there were so many apps to use and enjoy.  The Dell tablet is so fast and easy to use.  I can do everything that I normally do on a desktop computer on the Dell Venue tablet.", "Title": "Dell Venue 8 32 GB Tablet (Android)", "Date": "February 15, 2014"}, {"Author": "Scott Wilson", "ReviewID": "R2O5JRT5GPIMQX", "Overall": "5.0", "Content": "I have had the Dell Venue 8 Android  for a couple weeks and am extremely happy with it. Fast processor and plenty of memory make it a pleasure to use. Has a clean Android installation without all the normal bloatware you get with most other tablets and phones. And  great price point of under $200 for an 8 inch screen.", "Title": "greta bargain", "Date": "February 7, 2014"}, {"Author": "tyler", "ReviewID": "RN2SJSETA7NRF", "Overall": "4.0", "Content": "i ordered it for girlfriend she seems to enjoy it. I personally like it but video quality has dem lighting.", "Title": "worth the price", "Date": "February 4, 2014"}, {"Author": "Gary", "ReviewID": "R1TKW9ADPUX6LE", "Overall": "4.0", "Content": "I am very satisfied so far, I like the speed and clarity The wifi range is much better than my wife's ipad..", "Title": "Satisfied so far.", "Date": "January 30, 2014"}, {"Author": "Zee", "ReviewID": "R33M1AC9QQ3DJO", "Overall": "5.0", "Content": "I use this tablet for pdf file mostly on ebooks. adobe reader works very smooth on this regardless how big the pdf file is. It handles my 150mb pdf file smoothly. Fast scrolling and never stuck while it scrolls until it stops by itself. Very smooth. I love it. I had galaxy tab 2 by samsung for this purpose before, and I made a bad decision for getting it.Dell Venue 8 system uses less than a quarter of its 2gb RAM to run. So you will have at least 1.4gb available for use. Multitasking isn't a problem at all. I have never exceed 1gb ram of use so far. On comparison, Samsung Galaxy tab 2 10.1 have only has 1gb ram, but only the system itself occupies more than half of that. So most of the time, I have choppy screens and lag. Not smooth at all. It's annoying. That's why I decided to get another tablet after using it for some time. I can't bare with that.I also use Dell Venue 8 for gaming purposes. I play Heroes of Orders and Chaos MOBA (1.0++gb size) on this and it runs perfectly. So smooth and no lag. PvP matches has never been better. Lag only happens when the game server has a bad connection or slow internet connection. Plus, it has good graphic rendering too. Another reason why this game doesn't lag is due to the ram. Since this game uses a huge amount of ram, you will need those extra spaces to run it.It upgrades to the newest android version by itself. So currently, I have the 4.4.2 KitKat version. It had a camera video playback issue at the beginning, but I guess they fixed it in the latest android update. It works fine now.", "Title": "super fast and no lag", "Date": "May 22, 2014"}, {"Author": "Brian C.", "ReviewID": "R1BY5HP6ZLRS6J", "Overall": "3.0", "Content": "I'm pretty happy with this device.the speakers could use a little help. Overall if you're looking for a decent tablet and don't want to spend a heck of a lot of money this is a great tablet for you", "Title": "good tablet for the money", "Date": "May 20, 2014"}, {"Author": "Linda Jorgenson", "ReviewID": "RQ9D196HKMWVV", "Overall": "4.0", "Content": "I love this tablet, great for easy to use and is lighter then my Laptop...makes working on it fun! The battery life in it is not so great but I only knocked off one star for it. Really fun to use and enjoyable.", "Title": "Del Venue 8 32 GB Tablet (Android)", "Date": "May 19, 2014"}, {"Author": "T. Johns", "ReviewID": "R1C3A3Z8282FXQ", "Overall": "5.0", "Content": "The tablet is just what I needed.  its pretty speedy pulling up web pages and checking emails and social sites.  The only downside is there is no flash player and you can not add.", "Title": "No complaints", "Date": "May 19, 2014"}, {"Author": "Chessman \"Sargon\"", "ReviewID": "R73VRKCLXZQ9Y", "Overall": "4.0", "Content": "Compare the specs with any other tablet then look at the price. The DV8 is the best value for the money. I did have problems with the touchscreen but after doing a factory data reset, The screen problem was fixed. I just upgraded to android 4.4.2. The main selling points are Intel Processor that acts like quad core, 2gb ram, 32gb hard drive, micor sd card slot up to 32gb, and 8 inch display which I think is the best size. Other companies only give u 1gb ram,16gb hard drive, 7 inch display, and some do not have a micro sd card slot. I would give it 5 stars if not for the initial screen problems. I am happy that I stuck with this tablet. Thanks Dell!", "Title": "Very Good but not Great.", "Date": "May 16, 2014"}, {"Author": "Taras", "ReviewID": "RPFG6VZHRKGCK", "Overall": "4.0", "Content": "The tablet is fast, works well, but the only thing I'm not satisfied sometimes the screen freezes and doesn't respond. The only thing that helps is to sleep the tablet and then awake. But that issue is not crucial for me, so I'm not going to change my tablet to another one.", "Title": "decent tablet", "Date": "May 15, 2014"}, {"Author": "The Penguin \"Techno Geek\"", "ReviewID": "R183OJ955P4E1W", "Overall": "4.0", "Content": "Nice 8 inch screen for half the price of an iPad Mini.  It's faster than my other cheepo 1.0ghz single core and 1.4ghz quad core 7in tablets.  Loads Candy Crush in 6 seconds.  More memory and storage too!  Some reviews knock it, but for $150 it's a pretty good deal.  Battery life seems to be at least 5 hours, which is more than I expected.  I only have 2 complaints.  First, the speaker is Mono instead of Stereo.  Second, there aren't many protective cases available.  I took away 1 star for those reasons.  Other than that, it's a pretty darn good tablet.", "Title": "Great budget tablet", "Date": "May 12, 2014"}, {"Author": "Karen R. Waydo", "ReviewID": "R1JTDRM60SDRCH", "Overall": "5.0", "Content": "I am very happy with this tablet.  It has been great, has a lot of memory and I can add more when I need to.  Highly recommend!", "Title": "Dell Venue 8 32GB Tablet", "Date": "May 12, 2014"}, {"Author": "Michael Saquilayan", "ReviewID": "R36MFAW20SC0ZM", "Overall": "4.0", "Content": "Purchased this as gift. The packaging was great. The screen was smooth. The response was fluid. Better than 7 inch tablet.", "Title": "Fluid response", "Date": "May 12, 2014"}, {"Author": "WALTER E MEDINA", "ReviewID": "RW8S93EEDN1G", "Overall": "5.0", "Content": "Awesome machine! Super fast.  No problems whatsoever. Pure 100% android.  This is what a tablet should be.  Unaltered android so you get the real thing.  Why get the 16 when you can get the 32 and you put a 32 card for a total of 64.  Awesome", "Title": "awesome machine", "Date": "May 11, 2014"}, {"Author": "hm", "ReviewID": "R9P3FXDA5LBF0", "Overall": "5.0", "Content": "Disappointed at first, but I have grown to really like it. Having use iGadgets, I decided to try this over Windows/iOS. I wanted something I could journal (in cursive), sketck, brainstorm, run Office apps, Skype, Tweet, Square point if sale, etc. Size and weight are important factors; the cameras, not so much (look like a dork taking pics with a tablet, lol).All works great ...but... the stylus. The 4.3 Android upgrade seems to help; but after doing some research, it turns out to be the stylus. The device uses the body's electric current to draw; rubber tips (duh) insulate and drag as you slide them across the screen? So I tried a moist q-tip with my finger touching the cotton wool, pretty darn smooth and precise. Next I tried an old nylon #1 (small tip) paint brush holding on to the nickel ferrel -- amazing!! So in my opinion, the problem is the stylus.I've ordered a Pineapple fiber-tip stylus; if that doesn't work, I'll figure out how to fabricate one and start selling them on Amazon.Back to the tablet. I think it is great value for the money. I bought the 32g version and installed a 32g memory card, and a case (get the one made for this tablet). It charges in a reasonable amount of time and lasts 6 hrs +/- I keep the charger handy and plug it in when in standby; I power it down when not in use.I haven't tried the voice commands or dictation; I'll probably not use that feature, just feels weird talking to a computer.So there you have it; I'd highly recommend it (5 stars).", "Title": "Great value and impressive little gadget", "Date": "May 10, 2014"}, {"Author": "jamie oxenreider", "ReviewID": "R2R5QU9HQ45TRN", "Overall": "5.0", "Content": "A little bigger a little faster and good build quality, very good for the money. I have 5 tablets and they are all the same, some a little better at this or that, I am talking about name brand tablets, knock offs are junk. This is a name brand at a good price and is really a little better than manybe the galaxie tab 3 at half the price.", "Title": "Very good for the money", "Date": "May 10, 2014"}, {"Author": "D. Afarian \"Siteman\"", "ReviewID": "R2AHOPYFEY7IEG", "Overall": "5.0", "Content": "This is a great tablet. It's the right size, better than the 7\" and very responsive. The touch sensitivity is very maybe hyper sensitive, so once you get used to it it's great. But it's very reliable and stable and I got it for a great price during black Friday 170 bucks for the 32gb model and it has an SD port to add another 64One thing that is sub par, the battery doesn't last as long as I thought it would, it only lasts about 5hrs continuous. The 10\" Samsung lasts twice as much (of course battery is larger)", "Title": "Awesome tablet great size", "Date": "May 9, 2014"}, {"Author": "Roberto Ramírez", "ReviewID": "R2ZDBZY7N0X3R7", "Overall": "5.0", "Content": "Its perfect for me, especially becouse is very fast!!the only thing is that there are no video output.I really like the performance.", "Title": "absolutlly ok", "Date": "May 9, 2014"}, {"Author": "N. Felton", "ReviewID": "R1NJUTPROVGVPR", "Overall": "5.0", "Content": "it is working great. We had a couple bad experiences with off brand tablets and this one is a great compromise between price and performance. It cost more than a cheap tablet but it works very well without being as expensive as many others", "Title": "great tablet", "Date": "May 9, 2014"}, {"Author": "u e chapa", "ReviewID": "R3B3V7FG680IOB", "Overall": "5.0", "Content": "i enjoy my tablet immensely.  i use it for traveling to stay in touch via the internet, plus for downloading and reviewing my pix.  at home i use it for shopping with various lists for all my errands so i don't forget items.  it upgraded to android v4.3 without a snag and it works great, as expected from a dell product.  the amazon pricing was great too.", "Title": "one more great dell gadget...", "Date": "May 8, 2014"}, {"Author": "Miguel Perez", "ReviewID": "R2Z405KXAEPS3W", "Overall": "5.0", "Content": "Love ii!!!", "Title": "amazing tablet!!! the screem is the perfect size and works really fast..", "Date": "May 6, 2014"}, {"Author": "Robert Komis", "ReviewID": "R3H4ZJ70IZTW1V", "Overall": "4.0", "Content": "It is a fast tablet and good for school work.Downside is that there is no IR beam and that the screen is small so its hard to take notes on  without constantly having to scroll the page", "Title": "Pretty Good", "Date": "April 30, 2014"}, {"Author": "Mark J McGlothlan", "ReviewID": "RE5KD17D8BHQM", "Overall": "5.0", "Content": "My kids love our \"red tablet\", whether watching their favorite cartoons or playing their favorite apps. They out it through its paces every day and it definitely keeps up with them!", "Title": "Great tablet", "Date": "April 29, 2014"}, {"Author": "marcelo rojas", "ReviewID": "R2MKTW0YO8ADQG", "Overall": "5.0", "Content": "it is very fast opening the application,so it prime is cheaper than other similar tablets. I am very comfortable with it.", "Title": "I am comfortable with the performanse", "Date": "April 27, 2014"}, {"Author": "Andrea N.", "ReviewID": "R3KR6Z30SP7DM1", "Overall": "4.0", "Content": "I had really enjoyed this tablet, and this been my first I am pleased with it. Although not very impressed with the front camera quality and the reached for the wifi is not too far, however the rest works perfectly", "Title": "Great item at a great value", "Date": "April 16, 2014"}, {"Author": "ANGELA M COBBS", "ReviewID": "RSVGYVCH42GTM", "Overall": "5.0", "Content": "ABSOLUTELY LOVE IT ~  EASY TO SET UP ~ WONDERFUL PRODUCT ~THIS IS HER FIRST ELECTRONIC DEVICE :)  SHE'S 82 !!!", "Title": "A GIFT FOR MY MOM", "Date": "April 16, 2014"}, {"Author": "S. Gibs \"S. Gibs\"", "ReviewID": "R2YNMA71YNVFAN", "Overall": "4.0", "Content": "This was a gift for the kids I guess it s OK for the use, the only problem is  the battery life.  But is not heavy and they like it.", "Title": "Dell Venue 8", "Date": "April 16, 2014"}, {"Author": "Thomas Jefferson \"Independence Forever\"", "ReviewID": "R1W1F0IGVIRK4J", "Overall": "5.0", "Content": "This is an excellent tablet and I have been extremely happy with all of its aspects. First off this tablet is fast. It also is capable of performing well even when you have numerous apps running at the same time. It is a very slim tablet with a large 8\" screen. The border is very small which gives you even more viewing area. It seem much larger than my older 7\" tablet. The screen resolution is decent for a tablet that costs less than $200. The Dell Venue has large internal storage capabilities. It sports 32 GB of on board storage which allows you to download many apps to your device. There is no need to worry about running out of space. I found that if you put too many apps on a device with lower storage capabilities it tends to run very slow and sluggish. This tablet does have an external SD storage slot. This helps to eliminates having to store music, videos and pictures on the device itself. One area that could be improved on this tablet are the speakers. This is not the best tablet to buy if you plan on listening to a lot of loud music without headphones or external powered speakers. The speakers are a little weak. The only other area I would improve on is adding a HDMI port so you could hook it up to a TV and be able watch your videos and movie. I solved this problem by adding an app that just throws the video to the TV with no wires. I have tried many tablets under $200 and found this tablet to have the best features for the money. I would not think twice about buying or recommending this tablet. Look for specials and you can find this Dell for a lot less than $200. I choose this over the Dell Venue Pro because I already have a laptop that runs Windows and I wanted to run on Android. This tablet runs on Android 4.3 so it is still very current. Buying Android allows you to pick apps from the Google Play Store. The Google Play Store has so many great apps to pick from that you need an app just show you which apps are the best. Which I have. (Ha!!!)", "Title": "Great Tablet", "Date": "April 15, 2014"}, {"Author": "Tatiana Lamm", "ReviewID": "RI380AX7IAS69", "Overall": "5.0", "Content": "This is the first time I buy a Tablet in amazon.com, the choice was very good, it is a very good product.", "Title": "Very nice tablet", "Date": "April 15, 2014"}, {"Author": "Bridgett Schwing", "ReviewID": "R382WUHF8PHBIN", "Overall": "5.0", "Content": "I love this tablet. The camera worked better than I thought and the pictures were very clear. The speakers work amazing and loud. I haven't experienced it taking a long time to charge. It is fast. All good things can be said. Great tablet, amazing price. Only one complaint was no adobe flash player. I downloaded a different flash player.", "Title": "love it", "Date": "April 14, 2014"}, {"Author": "Syneathia", "ReviewID": "R3EKYGG5LYBH1N", "Overall": "5.0", "Content": "Great product I love it. I used to always use my husband's IPad but not anymore. This tablet is fast and a great price.", "Title": "Great value!", "Date": "April 14, 2014"}, {"Author": "Stephen Butler", "ReviewID": "R3BUWY745K0DXD", "Overall": "5.0", "Content": "For a value priced tablet, this can't be beat. It is smoking fast. Zero problems multitasking. Gorgeous display. Very responsive.I don't even use my laptop much anymore. If you want a great tablet at a great price, and you like Android, you will not go wrong here. Much better than I expected.", "Title": "This thing is a beast!", "Date": "April 12, 2014"}, {"Author": "Rajbabu", "ReviewID": "R3QRF9KSBI5WKV", "Overall": "4.0", "Content": "This 8\" tablet respond speed is fastNo 3G slot as advistised by Amazon, diappointed, unable to use packet data.But, Dell advertised with 3G slot.This is a good tablet to use.", "Title": "Rajbabu bought Dell Venue 8", "Date": "April 12, 2014"}, {"Author": "WINDESSON S ALMEIDA", "ReviewID": "R3V9F4MDYSY95D", "Overall": "3.0", "Content": "Nice dell tablet, I was worry it was damaged because the touchscreen would not work at first, but then it did, might have taken about 5 minutes which is too long to adjust the touchscreen.", "Title": "Touchscreen didn't work at first.", "Date": "April 8, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2SWW1JSLBYBLN", "Overall": "1.0", "Content": "I should start off by admitting I know nothing when it comes to the operating system of various mobile devices. That said, I have a Dell Venue 8 (not the pro version) which worked fine for months until the recent KitKat update. The device is now buggy, freezes often, and requires me to restart. This occurs both when using a downloaded app and when I'm not.. It is embarrassing because I had just recommended the tablet to two family members particularly because of the speed and reliability for the price. There was plenty of space to work with though I did warn them about the 4 or 5 hours of battery life (I just keep the charger handy and it recharges fairly quickly, say, while I'm making dinner). If you're looking to purchase this tablet it was worth the money, the weight is decent for reading, keep in mind there is only one cover available anywhere which isn't the sturdiest but not altogether worthless, and keep an eye out for the KitKat adjustments to work themselves out.  Android version 4.4.2 software version Venue 8 3830_KK4.4_V1.26_140430-No Modem.", "Title": "May 2014 KitKat update negatively affected performance", "Date": "May 28, 2014"}, {"Author": "Mamman", "ReviewID": "R3FL4YJM9SLVSG", "Overall": "1.0", "Content": "I bought this approx. 6 weeks ago. It worked perfectly and was very happy with it. It's a secondary tablet, I got a good deal on it so I couldn't resist. Because it isn't my main tablet it went a few weeks without being used. I was surprised to find the battery dead when I picked it up to use it today. I put it on the charger and the screen read \"plugged in, but not charging\" I tried different outlets and different chargers and none of them worked. Now I'm having to go through the hassle of contacting Dell about getting this thing returned. Not happy....", "Title": "Won't charge after only using it a handful of times.", "Date": "May 5, 2014"}, {"Author": "John", "ReviewID": "RWYOEN2OUXK74", "Overall": "1.0", "Content": "The home icons freezes up about every 5 minutes. I called up Dell and voiced my pain and my problem with them about this glaring  issue I had with the tablet. They told me to format the tablet but, it did not work. I sent the tablet back for a full refund.WARRING: Buyer beware when buying this tablet. Heard my warring.", "Title": "Freezes buttons/icons", "Date": "April 17, 2014"}, {"Author": "Matt", "ReviewID": "R3G6Y4XPLIWKZA", "Overall": "5.0", "Content": "I am giving this 5 stars.  Own the ipad mini and in a side by side comparison the apple edges this out for a couple of reasons. The apple is a slightly better build quality and thinner. But when you consider the cost of the venue 8 it is worth the 5 stars. I bought mine new direct on a presidents sale for $129 so I am especially happy!!!", "Title": "Dell Venue 8 android worth the $$$!", "Date": "March 1, 2014"}, {"Author": "Richie", "ReviewID": "R361TRAI2VF5ZP", "Overall": "5.0", "Content": "Just simple. Nice easy to use tablet. Wanted to give dell a chance. Fast, rarely freezes. I try to freeze it by clicking every bottom possible and it won't freeze. When I had like 10 racing games that were like 2gb each it froze.", "Title": "Worth the price", "Date": "February 24, 2014"}, {"Author": "Damaris Muniz", "ReviewID": "R2GZA8VFMZ60PG", "Overall": "5.0", "Content": "I will definitely recommend  the Dell Venue 8 16 GB... runs pretty fast and reliable! Using several tablets before this one is the fastestI have had.This is a awesome Tablet. I can actually open up the web and mail... and play music all at once, with no delay! Easy to navigate.Not bad at all for the price!!!!  This is a Winner!", "Title": "very excellent product", "Date": "January 17, 2014"}, {"Author": "C. To \"Sinderella\"", "ReviewID": "R266LIIFCV67KJ", "Overall": "5.0", "Content": "Our family has several tablets, a Nexus 7, Asus tf700, Transformer Prime, and even a cheap chinesse brand. The Dell Venue 8 is the best of the bunch. The screenplay is very responsive, the size is just right, the wifi signal is strong, and the audio without headphones is clear. There is an occasional audio or video codec it may not play natively but the processor is more than adequate to use software decoding. The button locations take a little getting use to as well. For the price though  I still cannot believe how good this tablet is.", "Title": "Great Tablet", "Date": "January 16, 2014"}, {"Author": "Beverly Frady", "ReviewID": "R1YNH6ALFA5CDK", "Overall": "5.0", "Content": "Great tablet for someone wanting to pay less than the cost of the IPAD.  A great quality product with beautiful display.", "Title": "Less money than the ipad and just as good", "Date": "January 15, 2014"}, {"Author": "Cathy O", "ReviewID": "RSNE2R1ECWLSN", "Overall": "4.0", "Content": "I am really enjoying this tablet.  My only \"issue\" is I have not been able to download Adobe Flash Player.  Need to take the time and figure it out.  All in all, very happy with this purchase.", "Title": "Wonderful", "Date": "January 15, 2014"}, {"Author": "LOU \"Jayce's grandma\"", "ReviewID": "R2V37ZUX0GDGYL", "Overall": "4.0", "Content": "bought this for my grandson.....everything seems to be just fine with no complaints which can only mean it was a successful purchase!!", "Title": "good little keyboard", "Date": "January 7, 2014"}, {"Author": "Faisal Hussein", "ReviewID": "R3PXSELT3G2Y8L", "Overall": "4.0", "Content": "On the whole, I am very happy with this tablet which is really cheap and which I bought for my daughter who is 7 years old. I have just downloaded a few games and simple applications like skype. The only negative point is the battery life which has an average capacity of about 4 hours... possibly a little less... Really disappointing! Well if you want a cheap tablet (I got it something like 159.99$ with 32 GB on a Black Friday sale) with a good internal memory and processor speed, and if you don't need USB or any other connections, and if you don't mind the battery which is a disgrace, well this is good.", "Title": "cheap tablet, but ok!", "Date": "December 31, 2013"}, {"Author": "jie tao", "ReviewID": "RSCT0OGEO40FU", "Overall": "1.0", "Content": "I really wanted to keep the tablet and I even bough the case when I ordered. But after I received it, I powered it up and started playing with it, then it will freeze up every few minutes and very unpleasant.", "Title": "it keeps freezing up.", "Date": "March 22, 2014"}, {"Author": "jonathan brandwine", "ReviewID": "RVMVMD8TOZCZ0", "Overall": "5.0", "Content": "This lightweight new android tablet features a beautiful 8″ HD touch screen. Unleash your creativity with two cameras and storage to spare Dell Venue 8 Tablet with 8-inch HD Screen: The Crowd Pleaser This lightweight android tablet features a beautiful 8″ HD touch screen. Unleash your creativity with two cameras and storage to spare. Processor:", "Title": "Dell Venue 8 32 GB Tablet (Android)", "Date": "February 1, 2014"}, {"Author": "Sandra D. Kennedy", "ReviewID": "RO6QCEHQ8B6OF", "Overall": "4.0", "Content": "After it has been on awhile, your touch on the screen has to be harder!  Sometimes it freezes and you have to shut it off.", "Title": "Touch Screen not consistent", "Date": "January 3, 2014"}, {"Author": "Kenneth Ellis Jr. \"handleman\"", "ReviewID": "RN6QVUAD71FB5", "Overall": "2.0", "Content": "Recently, purchased a Dell Venue * tablet as a Christmas gift and have had nothing but problems with the screen freezing constantly. Going to contact Dell to see if there are any fixes to this problem or if they are even aware of it.", "Title": "Problems with Dell Venue 8", "Date": "December 29, 2013"}, {"Author": "Dianne Bentley", "ReviewID": "R21V2WJLZCOLQF", "Overall": "3.0", "Content": "Expected more from Dell but for under $200.00, I'm okay with it. My phone camera takes better pictures and the battery life is four hours on a good day.", "Title": "Average", "Date": "December 31, 2013"}, {"Author": "maria", "ReviewID": "R2KCKQSZ6KGH5M", "Overall": "1.0", "Content": "I claim I know what happened to my tablet has not yet reached me I have two months waiting'm upset", "Title": "claim", "Date": "June 4, 2014"}, {"Author": "Regina M. Cote \"Gina\"", "ReviewID": "R3IT0GTGI4APXM", "Overall": "2.0", "Content": "It apparently had some type of malfunction as I was unable to load the programs.  I returned it and ordered one directly from Dell.  I do love the tablet, it just didn't work out from Amazon.", "Title": "Had to return it.", "Date": "May 4, 2014"}, {"Author": "Dave Larkin", "ReviewID": "R1LTE0Q22JQYFN", "Overall": "3.0", "Content": "This might ready like a confused review, just like my experiences with this tablet. It has lots of pros but it's also got a significant con.The screen is top quality, the built in speaker sound is great (thin, but detailed), the installed OS and software is very light (almost no bloatware) and it runs every app perfectly from demanding games to handling tons of apps concurrently. There's no hint of any issue being an Intel instead of ARM processor. It would be a dream tablet, and a great value buy, except for...Battery Life:Battery life is not so good. I see 2 and half days from a full charge with very light usage, and 1 and a half days from moderate usage (browsing/e-mail). It's not awful, but it is the lowest of all the tablets I've used before.Firstly:Woah, this is one heavy tablet... with case it weighs over a pound. Did they use cast iron instead of aluminum inside? It's not too comfortable to use in-hand. It needs a surface for extended use.Secondly:As other reviews have pointed out, there are issues with the touch/sensitivity. The touch is a mess, or botched by the manufacturer. I've used Archos and Samsung tablets for years and, compared to those, the touch on this tablet is less responsive and less accurate. Random zooms, reacting incorrectly for short or long touch, not registering touches at all. I spend a lot of time clicking repeatedly , re-clicking, un-zooming, and having to remember how to hold your finger at just right and angle, and use just the right amount of force and hold for so long is pain. If I though this an issue with me I'd say so, but it's seems a widespread issue for users in reviews.UPDATE. I've been working on the touch response problem for a few days and can report some success. Using a diagnostic app I could see the false touch registering. Making the touch less sensitive seems to have been the fix by the manufacturer. The tablet needs fat & flat (more than I'm used to) touch from users to compensate, but this makes aiming trickier. Increasing the sensitivity by removing my screen protector made a notable improvement... your mileage will vary depending on protector. Taken out of a case, the responsive improvement was slight. As Dell suggests, a reset helps to resolve touch issues, but doesn't fix them completely. I suggest buyers do that first thing after the out-of-box update, and hunt down and disable any unused custom gestures in apps.Despite the great value, solid build quality, the internal hardware and software performance, the touch is still the worst I've ever used, but its workable. If you have the extra money, get a Samsung. If not, you can do far worse than the Venue.", "Title": "What value... but not perfect.", "Date": "April 28, 2014"}, {"Author": "Kamalaksha Das", "ReviewID": "R25ZAWADN85R19", "Overall": "2.0", "Content": "i just wonder that some cheaper non brand tabs offer to connect to 3g dongle but not dell venue 8! i liked the product at first glance including look and feel, performance. only big lacking is No SUpport for 3g. am not asking the inbuilt one but it should have support to connect through a USB 3G dongle. without having this how can you connect to network when you are not within a wi-fi range? highly disappointing!", "Title": "No mobile network", "Date": "April 24, 2014"}, {"Author": "BryanJames", "ReviewID": "REWEEZ79PJE5G", "Overall": "2.0", "Content": "I truly wanted to like this device.  I purchased the Dell Venue because Amazon and other reviews, and that it was not full of bloatware.  The bloatware part is true.  It's close to pure Android.  Some of the reviews said the screen was sometimes unresponsive, but I had no idea what that meant.Touchscreen Issue:  Was surprised to learn how unresponsive the screen could be.  Not most, but many times it requires two, sometimes three taps/presses/clicks to get it to recognize input.  That gets old fast.Microphone Issue: The Android voice app kept saying \"Didn't catch that.  Try speaking again.\"  At first I thought the voice app was having issues.  So I downloaded several (9) different \"microphone\" apps to capture voice, etc..  The microphone turns out to be very poor.  Tried every setting on the device and many of the settings (like gain) on the voice capture apps.  Nothing worked.  The microphone just doesn't work well (lots of noise in the background, and the voice level is very low, even 1 inch from the microphone).It is on it's way back to Amazon.  It's too bad that Amazon has to eat the cost of shipping for a poor product.", "Title": "Touchscreen weak response, and the microphone...very poor.", "Date": "February 13, 2014"}, {"Author": "Lologuy \"cracked PDA\"", "ReviewID": "R2TVNQ7H63WADW", "Overall": "2.0", "Content": "This unit is being returned. Hardware-wise, it's hard to beat for the price (especially the low price I got it for on Cyber Friday). When working, the unit is fairly zippy and responsive with minimal lag. The screen is ok, not the brightest nor clearest compared to higher priced units but certainly useable. The camera is only fair at best. However, there is a crippling fault with the unit I received, which I believe is a software/firmware issue. The unit just hangs up on numerous occasions with the screen unresponsive to any touch and no way to exit out EXCEPT to press the power button quickly and than to repress. This brings you back to the start screen and than the unit functions as if nothing happened. I've had this problem randomly while using different programs - internet, camera, etc. I contacted Dell support and went through their chat service - advice I got was to reset the unit to factory default and the rep promised this would solve the issue - it DIDN'T (it appears others are encountering the same problem which cannot just be dismissed as a rare defective unit issue. No matter how nice the hardware is, it's pretty useless if the functionality is lacking and it is really lacking in this unit. The problem appears to be linked to power management - it seems the unit goes into standby mode randomly as the programs are still running in the background but the screen is non-responsive. I've used many Android tablets and this is the first one with this persistent problem (and not the only one either). Don't need the hassle - when there are so many choices out there, why put up with it?", "Title": "Good hardware but with problematic issue that makes it a non contender in a crowded tablet market", "Date": "December 15, 2013"}, {"Author": "Robert W Wendling", "ReviewID": "R2P8075Q5H5UKA", "Overall": "1.0", "Content": "Bought this tablet because of price, and has several nice features but...when viewing video, movies the picture is fuzzy, not sharp like any nice display will be. Even the photos taken by the cameras were fuzzy, not sharp. Maybe I got a lemon...", "Title": "Display not sharp...", "Date": "January 20, 2014"}, {"Author": "JUAN CHAVEZ", "ReviewID": "RUYGT1ZT7EYB6", "Overall": "1.0", "Content": "I order this tablet for my mom as a birthday present. received it on Saturday 3/22/2014 and gave it to her on Sunday. Helped her set it up last night and to our surprise she comes from work and the screen is unresponsive tries touching the screen a few times no response turns off the tablet and now it won't even boot. DISAPPOINTED.", "Title": "Not working!!", "Date": "March 24, 2014"}, {"Author": "arbepa", "ReviewID": "R4ABT5FLNI7JM", "Overall": "1.0", "Content": "The screen freezes and I have to turn it off and then on again for unlock it. I contacted Dell support service and his response was deplorable. The only way is to refund it, but now I am outside the U.S. and it is complicated too. I have Kindle and Asus tablets that never gave me any problems. So I really DO NOT RECOMMEND anyone to buy this rubbish.", "Title": "Very dissapointed", "Date": "March 23, 2014"}, {"Author": "Kenny G \"Kenny\"", "ReviewID": "R3KQGV8G23XG25", "Overall": "2.0", "Content": "Purchased a black Dell Venue 8 from Amazon and red one from Dell as Christmas presents for my kids. Worked great to begin with, but two weeks latter neither would not accept a charge. Display indicates charging. One was only up to 20% after 24 hours on charge but eventually dropped to 0%. The other went to 30% after 8 hours, however by morning it had dropped to 0%. Both indicated they were still charging. Tried a variety of things over the next few days and determined the chargers are OK since they would charge cell phones just fine.These were in my possession for about 6 weeks. Purchased for Christmas about a month earlier. Amazon's holiday return policy allowed me to return for refund until Jan 31. Returned the black one for full refund. I love buying from Amazon and have always experienced good customer service!Dell is not so good. I am stuck with the other one since I have had it for 6 weeks. Dell currently has it and is attempting a repair. I expect I will have to return repeatedly because when I goggled this problem, found it to be common on the Pro version. The Android version was not even released when I placed the order, so there were no reviews to go by.Bottom line: The Venue 8 is a fast, non lagging and stable system but if the battery will not recharge, it's only use is as an expensive paper weight.", "Title": "Purchased two Dell Venue 8, two weeks latter neither will accept a charge.", "Date": "January 18, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1URNE2RSWQNIN", "Overall": "2.0", "Content": "I had been researching and researching a tablet to purchase.  I had been an early adopter of iPads (1, 2 & the mini), but I am a dedicated Android user - I absolutely love my Galaxy Note 2 phone.  I read many reviews for the Dell Venue 8 Pro and was quite stunned that there was little to no buzz about the Dell Venue 8 Android Tablet.  In fact, it's difficult to find a video review of the tablet on YouTube, but it seems that people were practically tripping over themselves to review the Windows version.  My needs are simple - I wanted a tablet I could use to search the Web, read & respond as needed to e-mails, and stream videos, so I did not need or expect a laptop/desktop replacement. I tried a Samsung Galaxy Tab 3 8.0, but experienced endless buffering of video content -- although that may have been the wifi in my home.  Anyway, I was thrilled when my Dell Venue 8 Android arrived.  An 8 inch tablet is the right fit for me.  I loved the feel of the tablet; the build quality seemed strong, and I did not experience any issues with screen resolution.  Web pages were quick to load and the tablet was easy to set up, so I thought \"Bingo\" I finally found my tablet!  However, overnight, with all possible apps disabled and screen display set at low, the tablet loss 20% battery power.  As I used it sparingly the next day, the battery power continued to decrease..  I just could not foresee a positive future with this tablet and ended up sending it back.  Sadly, after much searching I'm still searching.", "Title": "I Really Wanted to Give This Item A Chance", "Date": "January 13, 2014"}, {"Author": "iumer", "ReviewID": "RGFZJJ8SNTI2I", "Overall": "2.0", "Content": "Good furnished. Light weight. Excellent.  It takes difficult to keep the tablet with case folded. It loses balance and does not hold tablet to watch videos.", "Title": "So So!!!", "Date": "January 2, 2014"}, {"Author": "dove song", "ReviewID": "R38YS976BB02R", "Overall": "1.0", "Content": "In short, I hate it.  Every time I turn it on the battery is dead.  I thought I'd try turning it off completely, rather than let it go into sleep mode.  I just turned it on and the battery is drained.  It seems all I can do is charge it and it takes a long time to charge, compared to my other android devices.  I called Dell support and was more or less told the battery behavior I was experiencing was normal.  I have an older Asus that at least works all the time.  The battery lasts for days and it recharges quickly.  I've hardly even used the Dell because I can't use it when there is no juice in the battery.  I consider it a total waste of money.Edit: I have the 32gb version.", "Title": "Short battery life", "Date": "January 24, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2196IZQP8DRD1", "Overall": "1.0", "Content": "This is tablet is specd with an optional \"active pen.\"  It's too bad Dell wasn't honest enough to admit that the pens don't work.  Instead they have pulled access to online support for this tablet and have never admitted that they have had problems with the pen.  Without the active pen this tablet is not worth even the relatively cheap price.  If you buy one don't count on customer service from Dell.  They seem to be in denial about the stylus problem and aren't about to give you a straight answer about it.", "Title": "Don't count on a stylus or Dell to help", "Date": "February 10, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00FFVYSKW", "Features": null, "ImgURL": null, "Name": null}}