{"Reviews": [{"Author": "RedspawnSilver", "ReviewID": "R3BCUNPN4XA57E", "Overall": "4.0", "Content": "I'm a techie, so it came as a surprise to me this is decent for kids... It has great parental controls that I can access anywhere via a website, sends me emails when they download some app, go to a forbidden website, etc. (which can get annoying at times, especially when downloading new apps when seeing up the tablet) ... Functional use of this tablet is nice, I just downloaded the Amazon appstore to get better apps than the tabeo app store was offering, that made it sooo much better! Base tabeo app store is lacking.  Downloading new apps and installing them takes patience as it is not that fast, partly because I think it is adding the apps to the online database so you can approve them on the parental website, the other half is the tablets limited technology, so you have to wait for each app to finish downloading, then installing before you can move to the next app .  Some of the preloaded apps are annoying because of registrations, but after that, they don't have a lot of spying technology that normal apps do, so that is the upside to the painful registration process.I didn't have a lot of issues with the tablet app restarting EXCEPT for some of the installed apps, which was quickly resolved by downloading different apps of the same genre from the Amazon app store .  I even downloaded netflix and hulu so she could watch movies :-) Pictures that are taken by the tablet are of course lacking, but it's a kid's tablet.  Controls are decent once you get the hang of it, I actually like the split pulldown menu as it doesn't take up the whole screen like normal android pulldown menus do.  Touch controls at the bottom are nice and frustrating, all at the same time for younger kids (under 3), but it takes patience and training.  Overall I gave it a 4 because of the parental features, plus once I got the Amazon app store, that helped... It's decent for younger kids (7 -8 or younger), apps run well after installed.  If you know how to navigate around, this surprisingly isn't to shabby.  Again, I have had NO issues with apps after I got away from preloaded apps, if I do have issues, I  will come back here to tell everyone :-) Overall, I purchased mine for $125 on sale and I think it is worth this price, but I DO NOT RECOMMEND PAYING MUCH MORE FOR THIS UNIT.", "Title": "Actually good", "Date": "December 3, 2013"}, {"Author": "Rachel Frank", "ReviewID": "R44BNSTK8LR3W", "Overall": "1.0", "Content": "Total junk. Toys r us website only posts positive feedback which mislead me into buying it. It crashes every few minutes and is slow.", "Title": "Avoid this product", "Date": "November 23, 2013"}, {"Author": "Jennifer Eldred \"Jen-H\"", "ReviewID": "R29ANEQNT6DVVA", "Overall": "1.0", "Content": "I would warn you to not waste your money on this thing.  If I had the ability to give this product negative stars I would.  The tablet i VERY slow, the way it is set up uses so much of the memory that it just drags and drags when trying to load games.  I think that having only a 1.0 ghz processor has something to do with that.  I am also not a fan of the parental control which is set up online through an application which is essentially held in the \"cloud\".  Lesson learned....I will never do this again.Our main reason for purchasing this tablet prior to Christmas was so that our daughter could use it for a vacation we were going on.  However, low-and-behold it was practically useless due to some error which occurred in the parental control application.  By the time we realized it, we were in no way able to fix the problem.  We were on a cruise, so getting WiFi without having to pay an arm and a leg was impossible.  So, we suffered through not being able to play any games and only using it to play a movie that we loaded onto the tablet prior to leaving for vacation.Even now that we are home, my daughter hardly uses the thing.  That, and alot of the free aps are just garbage!  There are advertisements on alot of them, which gets screwy with the parental controls as well.The only thing that was positive about this entire experience was the fact that we have 45 days to return the item in its original box with the shipping receipt.  Thank goodness!!!Spend the extra money and just get a real tablet or a Kindle Fire HDX!", "Title": "Better Luck with Another Tablet", "Date": "December 9, 2013"}, {"Author": "Scott DeWit", "ReviewID": "RP8KFE952CB6G", "Overall": "1.0", "Content": "This product really is a piece of junk. It is marketed as “high impact” yet my daughter dropped hers from about only a foot up by accident about 10 minutes in and the LCD screen is completely shot. Tabeo/Toys’r'Us support said there is a limited warranty that only covers “manufacturer’s defects” (of course). So now I have a really upset 7 year old and am out 150 bucks.The tabeo website and the profil websites are also a piece of junk. I have been in IT for 16 years. Clearly they didn’t load test these sites in anticipation of the numbers of concurrent users they would have on Christmas. Sounds a lot like another site that had this problem recently (healthcare.gov). Did CGI build this one too? No one could get in, people (including me) were double/triple charged for the MPF profil account, and the support chat did not work.All around, please do not invest in this tablet. You may as well just buy your kids a decent low-priced android based tablet and use free open software to monitor and provide parental controls. Certainly I should have. I got sucked in and my family has paid for it.Merry Christmas Toys’r'us!!!", "Title": "Do not purchase this tablet", "Date": "December 27, 2013"}, {"Author": "Amanda L Cravy", "ReviewID": "R110U4SIXFJFN6", "Overall": "1.0", "Content": "I bought 2 Tabeo E2's also. Both disasters. Finally got parental controls set on one after trying repeatedly for 8 hours. Now the parental controls are messed up and have all the apps blocked. Spent 12 hours trying to get parental controls registered on the other one and kept getting error messages. I have 2 Samsung Galaxy tabs that work great with no issues. I got a refund on my Tabeo's and ordered the Samsung Galaxy kids tabs from Amazon. Surely they will work much better!", "Title": "complete junk!!", "Date": "December 26, 2013"}, {"Author": "dnfz786", "ReviewID": "R2YQIVAAH4WOI7", "Overall": "4.0", "Content": "keeps crashing but i can't afford ipad mini for kids so this will have to do. will have to put up with the screen going blank and freezing while in middle of a game only to press and hold start button to reboot for another few minutes. junk but am considering it a toy so whatever..if you can afford it, buy straight android based tablets or better. parental control is not all that fancy on it..regretting the purchaase bc toys r us said once opened, don't come backUpdating: not too shabby of a tablet. would like a little bit more apps than currently avail. VERY LIMITED..in apps market..VERY..but my kids play some games and what not on it. It kept crashing the apps bc of the parental control which was by default blocking all freaking games for some reason. very retarded to have had those settings as defaults. Idk.. but afterall changed all the settings, and it works fine.", "Title": "not so much of a junk afterall", "Date": "November 17, 2013"}, {"Author": "Gearetta R. Brown", "ReviewID": "R35CZGT4D8AR0F", "Overall": "1.0", "Content": "I decided to come to Amazon to post my review, because I can't seem to find the appropriate place on the Toys R Us website to post it.  I regrettable purchased two for my grandchildren for Christmas and still cannot register them due to the non functional website.  This is a travesty and ToysRUs will not refund my money.  What kind of ripoff is this?????I have been in a queue for almost an hour and they keep saying that they hope to get the website service working within 24 hours, but since I have been trying to get these up and running for my grandkids since Christmas, I have very little faith in that.  My advice is to save yourself some money and frustration and buy a tablet that has a proven track record.Not only am I disappointed but I wish I could have given them a more reliable tablet that they could have been enjoying since Christmas.  My initial thought was the Leapfrog Ultra.  Wish I had followed my instinct.G. Renee’ BrownExtremely Frustrated, Disappointed, Angry Grandmother!!!", "Title": "I regret the purchase of these tablets.", "Date": "December 28, 2013"}, {"Author": "German Dominguez", "ReviewID": "R2BLTHBE7GWOUY", "Overall": "1.0", "Content": "This table is very slow and the Internet browser is even slower. The tablet locks and crashes very often that is even impractical to use it. Trying to set up the Parental Control is extremely difficult. This is the worst electronics product I have ever bought in my life.", "Title": "Complete Waste of Money", "Date": "December 25, 2013"}, {"Author": "bibishereen", "ReviewID": "R1Q1ZPLZOIQE0B", "Overall": "2.0", "Content": "Pros. Good parental control. Durable ( My son dropped it many many times and it's still working. Cons. It' doesn't support flash player. Crashes mostly. Very few educational games. Very low quality games. Can't get abc mouse to run on this which is my major issue. Overall my son uses it an hour or two a day but only thig that work on it is angry birds ... disappointed", "Title": "Not recommend", "Date": "April 30, 2014"}, {"Author": "Crystal", "ReviewID": "R2UXWL4FQ7J50C", "Overall": "1.0", "Content": "This product is the worst tablet I've ever bought! We bought this for my son for xmas BIG MISTAKE! We bought it in Dec and we got it home and wanted to charge it up for my son so he could play on xmas. Realized the cable would not charge it. Toys r us says absolutely no returns it’s out of their hands. Called tabeo and they sent out another cable. Took over two weeks for that. Get the cable and realize that if you just slightly move it, it stops charging meaning the defect is internal. Once again we are left with a paper weight and a wasted xmas present. Tabeo says ok send it back and we will replace it. We have to pay for shipping to ship it back and they received it jan 24th, but did not even put it in their system until a week later. was told it would be 10-15 business days from the date they had in their system. well 15 days went by and nothing. we called to see what was going on and was told the product was on back order and would be shipped as soon as they got some in and that it should only be a couple more days. very frustrated we again contacted toys r us with no help. two weeks go by again and call tabeo back and again told that they were still on back order and told again that it should only be a couple more days and then they would ship it out. at this point it was almost three months after xmas and my son got to play with his present maybe a total of two hours. and tabeo had our tablet for over a month of that. it is the beginning of march and we are STILL awaiting a replacement. was told by tabeo that our only option at this point is that they can send us our broken one back, or wait for the replacement. refused to let us go get a replacement from the store ( because you know toys r us are stocked with them but yet they are on backorder?) or a refund. and when asked why we couldn’t get a refund they said because we did not buy from them directly, and when asked how do you buy from them directly they responded by \"you cant\". we have now went to corporate with toys r us and we will see if that gets us any closer. hard to explain to a 6 year old why his xmas present basically got taken away from him.Bottom Line: Tabeo has the worst customer service ever!!! They do not want to stand behind their product and Toys R Us states their hands are tied. So basically you are left with absolutely no support from either end.SAVE YOUR MONEY AND BUY A KINDLE OR ANOTHER TABLET!!!!!!!!", "Title": "dont waste your time or money!", "Date": "March 12, 2014"}, {"Author": "jondra", "ReviewID": "R1Y65RLZR5P5IE", "Overall": "4.0", "Content": "There are no major complaints, product is decent. I guess we just expected a little more for the price. The device does not have a flash player compatible so we are unable to access some websites and play some games or watch shows- such as nick jr. Also, the apps library is difficult to work and downloads are slow.", "Title": "Okay product", "Date": "March 4, 2014"}, {"Author": "Danielle", "ReviewID": "R247S2BIP6XBV6", "Overall": "5.0", "Content": "My 7-year old daughter loves it!  She hasn't had to download an app on it yet since she's been so busy with the preloaded apps.  It works perfectly with her Furby Boom.I love it because of the ease of use and the parental controls on it.", "Title": "Perfect!", "Date": "February 19, 2014"}, {"Author": "S. Brown \"Sharee Picks\"", "ReviewID": "R3GZKNUMJ1UUX3", "Overall": "1.0", "Content": "Purchase 2 Tabeo E2 & the screens died in lest than a month. One stop working after 8 days of use. I can't believe how bad these tablets are & why Toyrus continues to sell them at all.", "Title": "Tabeo E2 Worst Tablet Ever!!", "Date": "January 22, 2014"}, {"Author": "D. Landress", "ReviewID": "R1ZTDKI10A40T4", "Overall": "1.0", "Content": "NOTHING ELSE MATTERS IF YOU CAN'T CHARGE IT !!!The tablet will work long enough for your kids to get totally addicted to having their own iPad type device. And you'll be totally addicted to getting to use your own iPad again. BUT THEN the charging plug will start to wiggle. And eventually you won't be able to charge the device. AND THEN your kids will be heartbroken.IF YOU OWN A TABEO E2 ALREADY- Return it while you can.IF YOU STILL WANT A TABEO E2 - Save your dollars a little longer and buy an Amazon Kindle HD with Parental Controls.", "Title": "BUYER BEWARE - The Tablet That Could Not", "Date": "January 19, 2014"}, {"Author": "D. Porter", "ReviewID": "R1MWQMSQUTT3CF", "Overall": "1.0", "Content": "Do not purchase this product, just spend the extra money and get a Nexus.  I thought I would save a little and get a \"kids\" tablet since it was only going to be used by my 4 year old, but that turned out to be the wrong choice.  The Tabeo e2 is heavy, cumbersome, glitchy, slow, freezes often, can't access Google Play or any other outside app store, and worst of all the display is truly awful.  You can only see it when looking straight on and even then it's very poor.The parental controls are annoying, the available app store is limited and filled with mediocre apps, the battery only lasts a couple of hours, and the touch screen/interface/OS is slow and not smooth.Poor execution overall and very frustrating.  Like I said, save yourself the trouble and get a Nexus.", "Title": "Not recommended", "Date": "January 19, 2014"}, {"Author": "B. Fulson", "ReviewID": "RXUJ6VBBWN75J", "Overall": "1.0", "Content": "First off I have to say that the Tabeo E2 looks really nice and is packaged very well.  I bought two Tabeo E2 tablets, a blue one for my son and a pink one for my daughter for Christmas at my local Toys R Us Store.  Unlike other reviewers that state that they cannot set up their parental controls I was able to setup the parental controls without difficulty.  However that is when the problems started.  The parental control blocked EVERYTHING (even the pre-loaded apps) on the Blue Tabeo.  I made some adjustments to the filter by allowing everything except for porn and violence and tried playing the games again with no luck.  I got frustrated and tried to set up the parental controls on the Pink Tabeo.  I was able to set up parental controls but as soon as I opened certain apps like My Little Pony that came pre-loaded it would crash and the tablet would restart (it seems to take forever for these tablets to load after being turned on or restarting).  I tried contacting customer support on the tablet and the Mobile Parental Filter took me to the home screen with a message that said APP BLOCKED: check parental filters on Mobile Parental Filter on left corner of the screen.  I tried to tap the mobile parental filter on the screen as it said to do and nothing ever happened.  I used the Blue Tabeo to try to contact customer support and I got through and typed my message in.  No joke I waited for 52 minutes for someone to respond telling me that the network is down and try to be patient.  While I was waiting all that time for that very helpful response I used the Pink Tabeo to go back to the Parental Control site online and unchecked EVERYTHING.  I took off all filters just to see if the tablet would respond better to the apps without the parental filter on.  I had no such luck.Their App store was pretty disappointing as well.  I was able to install some games from the app store and they would work on the Pink Tabeo sometimes.  Another issue with the app store that I had is the fact that the games available are not very popular and most of the apps that have reviews are very low but no comments are available to read.  I was never able to download the Amazon App store like the Toys R Us Tabeo E2 Q&A; section says that I should have been able to. The parental filter blocked me from downloading it.  I spent about 3 hours Christmas Eve trying to set these tablets up and they were a MAJOR DISAPPOINTMENT.  When I took them back to the store the lady behind the counter actually told me she is tired of the Tabeo E2 because LOTS of people were returning them.  When I looked behind her on the shelves beneath the counter there were about 20 Tabeos that had been returned just that morning.  Like I said in the beginning, they are really nice visually to look at, but when you go to actually use them they are a junk.", "Title": "Buyer Beware", "Date": "January 7, 2014"}, {"Author": "JPP", "ReviewID": "RSFXBK3BGNIR8", "Overall": "1.0", "Content": "We bought this for our daughter for Christmas because she loves playing on my iPod. Figured it would be great due to the parental controls. I was wrong. First, it took over 24 hours for me to even activate the thing. Then after activation, all of the pre-installed 3rd party tablets were erased. After 2 hours of downloading the file to reinstall them, and following the steps to a T that were on the website, it never even worked. We will be returning the product to Toys R Us and getting a much better product without parental controls, and I will just install my own.The only GOOD review I have is IF you can get a hold of someone in support, they are very friendly!!", "Title": "Crap", "Date": "December 28, 2013"}, {"Author": "Joel", "ReviewID": "R260F0PZM04M7Z", "Overall": "1.0", "Content": "The product did not work. There was no way to set it up. There were no directions on how to use it. I was never able to register it or even get online. There is no tech support for the product. I found many, many people online who were trying to get this thing to work without success. It was a gift so I can't return it. I use it as a paperweight. It sits there and glows if I push the on button.", "Title": "Do Not Buy", "Date": "December 27, 2013"}, {"Author": "Tim Mardis", "ReviewID": "RJDMAN6C9AY50", "Overall": "1.0", "Content": "I did my research for the best kids friendly tablet, and Tabeo was at the top of my list.  On Christmas morning my boys opened their tablets and wanted to play with them, but I was made to register the parental control first before they could play.I took the tablets into a quite place while they continued to play in an effort to register them without notice.  While the registration process seemed easy enough this is were the drama began!On both tablets simultaneously, I got to stage one of the process, and then to stage two, but I was unable to check the box on either tablet.  So I shut the system down and tried again... but no luck. So I attempted this process four more times before attempting to contact Tabeo tech support.  Guess what?  Their 24/7 tech support line was busy, and busy and busy; why couldn't they at least leave a message stating the obvious --- we're experiencing server issues and we're working diligently to resolve the problem or something like that, but not just a busy signal (I am still receiving a busy signal the day after Christmas).  So I tried their Chat Support, but no one would pick up and therefore I kept receiving a dialog box in which to leave message.  I then emailed them and 24 hours later I've yet to receive a reply.  And I am not at all sure why there are Chat Support Apps on the tablet when you can't chat until your Parental Control has been set up.I tried for hours, 13 hours to be exact to register these tablets.  And perhaps the most frustrating part was whenever I would get to step three and/or step four, I would be sent back to step one (very frustrating).I am not sure who wrote the program for this worthless device, but if they should be FIRED immediately if not sooner.  Imagine all of the children who received this for Christmas and were disappointed that Santa would bring them something that didn't work.Here's an idea for the geniuses at Tabeo/Toys R Us, rewrite the program and allow the children to play with some of the Apps that are rated kid friendly so that they could at least have access to their Christmas present and then have the parents register the tablet when the child needed access to the Internet.  Simple enough!!!!", "Title": "ZERO STARS IS ORE LIKE IT", "Date": "December 26, 2013"}, {"Author": "Boatk01", "ReviewID": "R26CP1I1WKHBR3", "Overall": "4.0", "Content": "I bought 2 of these tablets for my girls (4 and 5) for christmas. I knew they were going to want to play with it right away so I took the time out before wrapping them to get them all set up. The parental controls are awesome!! At first with one of the tablets I had trouble getting anything to download. I went ahead and factory reset the tablet then followed the support page directions to recover the preloaded apps ( keep in mind when factory resetting it gets rid of all apps so you have to recover the preloaded apps) Like others have said I got rid of some of the mindless games and downloaded the amazon app store then put netflix and some educational games on them. My girls love it and have had no problems with it crashing.", "Title": "Kids love it.", "Date": "December 27, 2013"}, {"Author": "The Wise Old Owl", "ReviewID": "R33FBN839NVS7K", "Overall": "4.0", "Content": "The unit works fine.  Also another \"techie\" stated it is good as well.  I wanted to get rid of the mindless apps and install some educational ones exclusively and this is working perfectly.  May need a bit more patient and technical parent to set this up appropriately.....so set aside a couple hours to get to know the unit and you'll be satisfied.", "Title": "Works Fine", "Date": "December 26, 2013"}], "ProductInfo": {"Price": "$268.88", "ProductID": "B00FAZ1Z4U", "Features": "Operating system: Android Jelly Bean 4.2\n8\" capacitive, multi-touch screen with a 1024 x 768 pixel resolution displays more than 16 million colors\nDual-core 1.0 GHz processor and a quad-core GPU offer quick and easy browsing, viewing and gaming\nCustomizable parental controls let you limit the content your child views and the amount of time he or she spends using certain apps\nPreloaded with 30 apps, including learning apps like Operation Math, games such as Bejeweled 2 and Fruit Ninja, and more", "ImgURL": "http://ecx.images-amazon.com/images/I/41dh71i-UmL._SY300_.jpg", "Name": "Tabeo E2 8 Inch Kids Tablet - Pink"}}