{"Reviews": [{"Title": "Initial test drive for this tablet is good so far", "Author": "Play It Again Audio", "ReviewID": "R32W7CWCO2OMWE", "Overall": "4.0", "Content": "I am test driving this tabletI have mine for only four days. Since that time my brother-in-law has bought one and I bought a second one for my Grandson..  So far it is working very well.  I compared the features of this tablet against the major brands, and this one has more features than the pricey name brand tablets.  I will write another review has I use the tablert more.  They are on sale at Sam's club for $99.00", "Date": "November 30, 2013"}, {"Title": "TMAX 9\" HD Model rated a good buy TM95775", "Author": "vnzjunk \"vnzjunk\"", "ReviewID": "R1IR3QUT7YQ2YS", "Overall": "4.0", "Content": "I picked one of these up online from SAMS yesterday on its cyber week sale. I was surprised at how quick the pages were rendering out of the box. I checked other tablets out online and although there were a couple of 9\" units at slightly less cost than the Sams sale, none of them had front and rear cameras or the HD video and HDMI output seemed to be a hit or miss option. So this one for a low end tablet seems to be loaded with the available options. I was impressed enough that I immediately purchased 2 more for xmas gifts. I have had no issues as of yet with the unit. The connectors have a solid feel as does the entire tablet. Any hiccups I have had are from my being rather new to Android. As I get more familiar with this OS I am sure the number of mis steps and trying to find this or that will be minimal and the usage quicker between me and the tablet.For $100 I don't see how you can go wrong. I rate it 4 stars because it is almost impossible to think that a $100 unit would rate as highly as units costing over $300......but in its price class it is most likely a 5 star. Time will tell and the thousands of units which have been or will be bought during the holiday season and put into daily use and the reports start to come in. Stay tuned...........P.S. I have one of the GoogleCast sticks and with the app downloaded to the tablet they work and stream fine. That is within the present limitations of the stick (info available elsewhere on the stick). Netflix and the other included and supported apps for the stick work beautifully.", "Date": "December 3, 2013"}, {"Title": "Great for the money, but be careful!", "Author": "David Willier", "ReviewID": "RTDFA5RF9MBD3", "Overall": "4.0", "Content": "I have 11 children, ranging in ages from 21 to 10. At such a good price, I bought each one of these tablets for an early Christmas present.Pro's: They actually work like they're supposed to! Both cameras work fine, plays games, gets online without problems. The best aspect is they seem to have good response time between apps/ web browsing. Their touch screens are likewise very responsive with both finger & stylus. They're actually phenomenal overall for a cheap tablet.Con's: Everything is just a tad cheaper than you will want if quality is what you're after. The screen resolution barely qualifies as HD (but *technically* it is HD.) The color saturation and brightness aren't very good, either (a huge drawback in my opinion.) The back feels as it's encased in a hollow cheap plastic shell that may fall off -but doesn't. The cameras are present and function, but they're low quality. And my biggest \"gripe\" is the charger is proprietary and looks very fragile, I'm sure it can be easily broken. It's just a tiny stick that plugs into a proprietary port. And it does take a while to recharge and the battery life isn't stellar.But hey, only $100 for a 9\" functional tablet that does everything the expensive ones do (and I have 3 Kindles and an IPad) -much higher quality devices but in some ways the Kindles are more limited in application.For kids & travel this really can't be beat. If I were traveling or on the go I'd have no qualms using it, or going to the beach (although it'd be difficult to see in sunlight.) Still, I'd be afraid to take my $400 IPad to the beach!Now it's nothing you're going to write home about, but at half the cost (the low end cost) of high quality tablets this is really a phenomenal buy for the price. That's why I rated it 4 stars.", "Date": "December 16, 2013"}, {"Title": "You get what you pay for.", "Author": "Michael S.", "ReviewID": "R1EUAXL7YWCZK7", "Overall": "3.0", "Content": "In short, you get what you pay for. This tablet, only being $99 at the time of purchase, is much more affordable than the competitors. That being said, you are obviously going to get a subpar product. The software is a tad slow and the casing feels slightly fragile. While those factors aren't desirable, it's still a sound product.I've had mine for about 2 months now and the only issue is that the charging cable has stopped working, which is upsetting but not the end of the world. Luckily I had an extra micro-USB cable around.Overall I rate this product a 3/5 because while it may not be the fastest or most we built tablet, it is very affordable and does basic functions. It's great for young kids who may not be responsible or someone who wants something to keep their hands busy.", "Date": "January 21, 2014"}, {"Title": "Beware. It works for a month or two...", "Author": "CharLife", "ReviewID": "R1DMEYFMDIIGOL", "Overall": "1.0", "Content": "After having this product for about just over a month, tthe tablet froze up and I had to contact customer service. When I called them, all they could do was walk me through the factory reset process. As a result, all my data that I had stored on a tablet was gone; no way to recover.well after having the tablet for 3 months now it seems that this is a consistent issue. I've had to reset it now 2 times. I called customer service and said I wanted to return it and get a replacement but they said \"No, We don't do that\". I asked \"What good is the warranty if I can't return this product which appears to be defective?\"They said I could return it if I wanted to pay the shipping but all they were going to do was the same thing I did - reset it. I had initially brought the three year warranty extension from Sam's. that was a waste of money and so was the tablet. I guess you get what you pay for. I would not buy another Tmaxx tablet and I warn others to do the same.", "Date": "March 25, 2014"}, {"Title": "Does all I need it to do, with a charger from amazon", "Author": "Eroil", "ReviewID": "R3LGIA6QAYZAD9", "Overall": "5.0", "Content": "I've had this almost 2 months from Sam's club.  I'm not a big gamer so I can't speak to that but...The good/ great stuff...Amazing for kindle appHDMI output works greatInternet surfing works perfectly without any noticeable screen lags (I'm writing this review with the tablet)Easy to use for an android newbie (I'm all i otherwise)Right price for a tablet I can carry around and not worry about damaging an expensive iPad. Or hand to a 6 year old with no fear.All apps I've used, like this amazon app, work well consistentlyThe bad stuff... the included charger. I ordered a generic universal charger off amazon and that works 1000x better than the included charger. I've had to hit the recessed reset button a few times to get the tablet to charge but only when I've left more than 5 apps running and allowed the battery to fully discharge by leaving in sleep mode and not powering down. Every time that button has allowed me to recharge with my generic charger. The included charger has a cord that's too thin and will only work if held at a certain angle. The generic charger works always if I set down the tablet and plug it in.Buy it now if you need a tablet for the basics and reliability. Even with an additional $10 for a better charger, its still a great price and a great laptop replacement when you need to be portable.Also, most of these users reviewing don't mention if they downloaded AVG or similar software to protect their OS. I did and haven't had issues. Some issues mentioned sound virus or charging related.", "Date": "January 12, 2014"}, {"Title": "Love It for the price and better than expected", "Author": "Amazon Customer \"spirit3soul\"", "ReviewID": "R1RP4QCMX379EJ", "Overall": "5.0", "Content": "Didn't really know what I was going to get, but after drooling over tablets for quite a while, I bit the dust and bought this. I was surprised as it does everything I need (had about a month now).  Easy reading with Kindle for tablets, good for surfing, has an office program and more! Bought a keyboard case to go with it, which I love and a 32GB micro SD card that holds all my music, docs, etc. I feel like I've just been free'd from my desk computer.  The pixels are fine for most anyone doing anything and higher ratio than some more expensive tablets I've seen.  The only con's (which don't affect me) is no bluetooth and the sound comes out the back which seems to be prevalent among tablets.  Yet, audio through earphone is awesome and brightness for reading is great.", "Date": "January 3, 2014"}, {"Title": "Great at this price.", "Author": "Tinkerman", "ReviewID": "RCG62T40R3ZS0", "Overall": "4.0", "Content": "Bought thus at Sams for a early Christmas gift,  what a hit.  The person I got it for never used an Android tablet.  Yet when she fired it up it walked her right through the set up and even while using it there are reminders of features and introductions to new ones.Personally I have a Nexus 7 and I don't fully use the features of it, and that's why I went with this tablet,  great for watching videos on the net, checking e mail and social media, the most of what we do!  The real bonus of this gem is the micro SD card slot! Beats the nexus there! She can load up different music,videos and pictures on different cards and play what she's wants in a second!  They only things I don't like is that the display is not as sharp as the nexus and this model has a specific charger instead of a micro USB you would expect.  Can't beat it at $99", "Date": "December 15, 2013"}, {"Title": "Defective Junk", "Author": "Carole", "ReviewID": "RIT9LW64P2IQS", "Overall": "1.0", "Content": "I bought this as a Christmas gift for my son age 22. He had it for a bout 3 weeks and it was not charging for some reason. I looked at the device and notice that the screen is not completely seated all the way, so the charger was not going in all the way. i gently pushed the corner and it popped into place. We plugged it in and it was charging. Awesome right! Not so much, We then turn it on and notice a crack in the screen from putting it into place. i called the customer service department located overseas and explained what had happened. They advise they  will not cover the screen, only the charging issue. I explained it would not charge due to the separation in the screen and casing and that it should never do that when its been handled with care the entire 3 weeks it was used. Finally they advise me to take a pic of the screen and send it to a customer service email. They refused to fix it without charging as well. I would not advise anyone to buy this product since it apparently does not go through any sort of quality check. Very very disappointed.", "Date": "May 12, 2014"}, {"Title": "TMAX 9\" HD Android Tablet", "Author": "James R. Espinoza Sr.", "ReviewID": "RU4X8ST55IQ6O", "Overall": "4.0", "Content": "Excellent buy for the price when compared to the other Name Brand Android Tablets.  If this unit is well taken care of it will last as long as it's competitors.  Some apps won't download with this unit.", "Date": "April 28, 2014"}, {"Title": "Stay away from TMAX tablets.  Awful cust. service when the product quickly fails.", "Author": "John W", "ReviewID": "R1RWGJU5B2116I", "Overall": "1.0", "Content": "Even after registering the tablet at the TMAX website.  Customer service is a joke and wants you to pay for returning it for service and then wants a copy of the receipt after you registered it.Cruddy product and even worse company.  Stick with Samsung.  TMAX is garbage.", "Date": "April 26, 2014"}, {"Title": "Total Junk", "Author": "kat", "ReviewID": "R2919U0N2HU2S3", "Overall": "1.0", "Content": "I bought this at Sam's Club for 99 bucks. I thought it was a great deal...NOT. Just a waste of money and aggravation. This froze at the 3 month point. The screen is stuck on \"GO\". I have tried to reset, wipe out data and reboot at least a hundred times. Looks like I bought a door stop. Oh wait, it is too thin to stop a door. Save your sanity and buy from a reputable company. I guess I am saving up for a Samsung Galaxy. Sam's Club should pull this from their store.", "Date": "April 3, 2014"}, {"Title": "Everything is Great...Except for the Camera...", "Author": "Veronica Williams \"Shy Gal\"", "ReviewID": "R2DHCVB0KCCKPG", "Overall": "3.0", "Content": "This isn't a name-brand tablet like a Kindle or Apple, but it pretty much does everything I want, has the games I want, and is all around nifty. My only issue--the camera. I just don't like the low-res, grainy-ness of the camera. The front one AND the back one. I just...can't bring myself to like it.Edit:Allow me to expand on my feelings of this product, since 0/2 two people don't find this to be up to par.~This is a tablet that could easily contend with greater known brands because it pretty much has all the popular apps available for download. Since this runs on Android, perhaps some people might think they'd be missing out. You're still able to download apps like Kindle, Candy Crush, Tumblr, and Facebook. It comes with Chrome and GMail already.~Crashes are rare.~Music clips can't be played on Tumblr via this app, which is unfortunate. However, most videos will play. Sometimes a notice about something being unable to play because of a bug will show up.~Battery life is somewhat iffy. When locked, there is no constant guarantee that the battery will still be above 60. However, while in use, it does not completely drain itself if you're a fan of gaming or long Kindle sessions.~Tends to overheat a little bit.~Again-- my problem is the camera. I stand behind that. It does not do well in dimly lit rooms, as opposed to brands that would auto-adjust without thick grain and sub-par presentation. I've come to find that this camera looks and works much better at night. Daylight and cloudy days simply do not mix. The lighting has to be perfect.This is my opinion, and the camera was my only problem with the tablet itself. It is reasonably priced and a good idea for someone who is a first timer with tablets. It's also great for people who do not want to spent over 400 dollars just to entertain themselves.", "Date": "December 30, 2013"}, {"Title": "One of the cheapest Tablets...you get what you pay for.", "Author": "Da Jester", "ReviewID": "R284RL52HDTYCO", "Overall": "2.0", "Content": "I picked one of these up from Sam's club because I was going on a VERY long train ride. I knew what I was getting myself into, but I needed a tablet to do a few basic things.The only stars I can award this for the review are the following:1. The screen size is nice for the price. When using this as a kindle reader, it got the job done2. Has plenty of assesibility be it HDMI attachments, two ways to charge the device, Micro SD card holder (I think, TF holder?). I was able to load from my computer to the tablet just fine.So what's wrong?1. It's a very VERY flimsy tablet. The case is literally plastic. If you drop it, you could damage it immediately. I've dropped it twice now and I think one my corners, it \"pops\" like an area was loose. The Tablet still works though. The touch screen is very sub par here. for Kindle reading, it works \"okay,\" but trying to read through a comics viewer or veiwing on an internet browser, yeah it feels flakey and sometimes un responsive.2. The screen display is pretty bad. I had to hold it a certain way to get what I thought was accurate lighting when watching something from netflix or youtube. If you are picky on colors when viewing digital periodicals, you may not get the most accurate color scheme.3. The battery is atrociously bad. Like I said, if you use it for normal reading or basic tablet use, you'll probably get your optimal use out of it. But anything else, don't count on it being a work tablet. It will fail you when it unexpectaly shuts off at 14% battery life. Also, when setting up the tablet, the user may have to disable all of the gimicky features it provides or any apps they download. Everytime I turned on the tablet and it reached a internet connection, facebook notifications are everywhere.Graphical power, I can't really say what it's capable of doing truly. I did a test with the Dragon Age game app and even ShadowRun Returns app. Both did work, possibly sluggish. However, you will notice your tablet heating up. As I mentioned number 1 for the bads, it's flimsy. The tablet is \"worth the price,\" especially  if you wanted to gift this to somebody as thier first or trial tablet.", "Date": "May 28, 2014"}, {"Title": "purchased for a coworker", "Author": "sabrina street", "ReviewID": "R3DRU7MPVIK0IS", "Overall": "5.0", "Content": "She loves it. I sat on her other one and broke it, so this was a replacement product. She has not had complained ;)", "Date": "May 5, 2014"}, {"Title": "Would not recommend.", "Author": "James L. Pittman \"livefree75\"", "ReviewID": "R22C41MV8CPSZE", "Overall": "1.0", "Content": "My 13-year-old son purchased this tablet at Sam's Club.  While it worked fine at first, eventually it started having several issues:1. My son is very careful with his stuff.  Despite this, the proprietary charger's plug quickly broke, and you can't purchase a replacement.  So now the only way to charge it is via Micro USB, which works well enough. However, as with all micro-usb devices, you have to be careful where you buy the chargers.  If you get the cheap ones at the grocery store or Amazon etc., they can quickly break.2. The internal clock started to lose time.  My son would set the clock before he went to bed, and then by morning it would be a half-hour off.  Incredible for an electronic device.  It took a factory reset to fix it.3. Currently, it will randomly refuse to power on.  He's had to perform soft resets numerous times to get it to work.I would recommend this product only to those who are masochistic and enjoy being frustrated by sub-par products.Save your money and get a Kindle Fire HDX.  I wish my son had.", "Date": "April 21, 2014"}, {"Title": "If I could give it a zero I would.  x", "Author": "Marian Dale Embry", "ReviewID": "RVOBSGRTK217O", "Overall": "1.0", "Content": "Didn't last two months and could not be charged using any cords.  Tablet got very hot also. Called and wrote customer service and they believed it was a bad tablet.  Since it was a gift and I had no receipt I would have to pay to ship it to them and then for it to be fixed.  Would cost more to fix than it cost to buy.  It was registered for warranty but you have to have that receipt.  Very poor customer service.  If you buy one make sure to keep everything that comes with it or you get no service from them.  Reading reviews here and on other sites seems they make their money from charges to fix the tablet and that's why it sells so cheaply.", "Date": "April 12, 2014"}, {"Title": "BEST BANG FOR THE BUCK WE'VE FOUND. VERY HAPPY.", "Author": "Donald W. Skaggs \"Donald\"", "ReviewID": "R1VIFSCEX16JUM", "Overall": "5.0", "Content": "Best bang for the buck we've found. Very Happy. Tons of ports. Tons of apps. Easy to use. Love it.", "Date": "April 10, 2014"}, {"Title": "Don't waste your money", "Author": "Lisa Dahmer", "ReviewID": "R27KYMX267K2PY", "Overall": "1.0", "Content": "I bought 2 worked great for about a month then froze . Can't get it to start back up. My sister bought one too and had to return it because it kept shutting off. Save you money they're not a good tablet", "Date": "March 29, 2014"}, {"Title": "$99 tablet that works fairly well !!!", "Author": "Omar C.", "ReviewID": "R1IDH9B2TYBH4L", "Overall": "4.0", "Content": "I also bought this tablet at Sams for $99, but what I see is that it provides a lot more than just basic functions. My son develops special software which must work on all computers as well as all tablets, gave me a \"it's OK\" approval. I have challenged many people to show me one thing that their tablets do than mine cannot do. I am still waiting.Yes, it is slow, sometimes very slow, but not slower than many. Searching the internet is very slow, but most apps run at an acceptable speed.It looks fragile, but I solved the problerm by buying a custom case and a screen protector from Amazon.I did not buy a service agreement, but after reading so many problems reported by others, I recommend others to buy it.One problem that I found, and maybe what others have encountered, is that it freezes a lot. But it does that when I let it run low on battery. To solve it, I have to plug it for a few minutes, then unplug it and finally press the reset tab (located on the back) with a needle. Wait a few seconds for the tablet to start up. Plug it again for a full charge.For those who complain about the camera I remind that no tablet or phone can be compared to a decent camera. How can you expect that a miniature plastic lens is going to compare to a 1000's of times larger glass lens?-----follow up----- May 31, 2014WARNING: Do not let the tablet totally run out of juice. It will freeze and will not recover. Called customer service and they walked me through a factory reset. They warned me that I would loose all of my data. Dumb me, it happened again and again. The third time would NOT reset.GOOD NEWS. I called customer service and they asked me to return it (I paid $5 for the return). I was told that it would be 4 weeks but to my surprise I received back within a week. I Know that they received this past Tuesday (May 27) and was in my hands on Saturday (May 31). They returned it FedEx. My son asked me how much I paid for the tablet? $ 99 to which he replied: \"How can they make any money returning it FedEx\"so my conclusion is that Customer Service is Great, but the product just works if you are careful. I can say this because I use it every day.I am going to install a SD card to backup my data. That way I hope that if I have to factory reset again, I can recover my stuff.", "Date": "February 19, 2014"}, {"Title": "replacement policy questionable", "Author": "Scott Wells", "ReviewID": "R1UMAGS2MQ2Z3R", "Overall": "1.0", "Content": "Purchased this for my son for Christmas.  He cracked the screen on it.  I didn't expect this to be a warranty issue and was willing to pay for it to be fixed if it was reasonable.  The company's policy is that you must pay $75 (the cost of the item was $99).  The bigger problem is you must pay the $75 on the phone before you ship it to the company to be fixed.  The only guarantee that you will get it back in working condition is the customer service techs promise, which I was unwilling to trust.  Hmmmm.", "Date": "January 9, 2014"}, {"Title": "TMAX 9\" HD Tablet", "Author": "Mrk2474", "ReviewID": "R1F748486YC3U5", "Overall": "1.0", "Content": "Bought this tablet at Sams Club. Froze up after 2 months. Called TMAX Digital and they walked me throught reset options. None worked. Word to the wise keep the box it came in. The serial number is on the box. No serial number on the unit. Without it you cannot return it even with a reciept.", "Date": "January 4, 2014"}, {"Title": "Dont Buy", "Author": "Domingo", "ReviewID": "R1ALRZBT651U7B", "Overall": "2.0", "Content": "Work for one month and started to freeze. and when I try to make a recovery to the factory setting nothing happens. I call support a lot of times and the support is really bat I try the found support in other language and is the same history and now I put that tablet in the box and try forget the bad buy in my life .", "Date": "January 17, 2014"}, {"Title": "Seems like a good deal..........but", "Author": "Eileen Anderson", "ReviewID": "R1KX2EOYWH1PI4", "Overall": "1.0", "Content": "I too bought this at Sam's Club for my 11 year old son for Christmas.  It worked great at first, but it's been two weeks and it already froze up.  Nothing works - can't reset. Will be returning it. My son is distraught.  Can't afford an Ipad, but this was a waste of time.", "Date": "January 9, 2014"}, {"Title": "tmax 9 inch", "Author": "crystal PA", "ReviewID": "R1ZJTWLX1IYK0Y", "Overall": "1.0", "Content": "Bought 2 of these. Low quality. One wouldnt even turn on and we used it less than a week. Returned for another one.  SaME ThING hAPPENed.!!!  Will be returning this time for money back.  Camera is LOW quality. Big and bulky..not good for little hands.  Bigged isnt ALWAYS  better. Disappointed", "Date": "January 10, 2014"}, {"Title": "Do not buy Defective product Tmax won't acknowledge defect", "Author": "Sabriya Joyce", "ReviewID": "RSM8LDE1NKUYV", "Overall": "1.0", "Content": "I purchased this tablet on Nov 8 2013 it is a waste of money, customer service is a joke.  My tablet has a large crack on the LCD screen and Tmax won't repair it. The tablet was never dropped and now it won't turn on.  The company says they don't cover physical damage which I understand but there is no physical damage, you can see that the screen on top is intact its the screen underneath that's cracked. So basically im out of $100. I do not recommend this product, I've had had for about two months.", "Date": "December 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00GNI3VOK"}}