{"Reviews": [{"Title": "Great Quality", "Author": "ngye", "ReviewID": "R3RUP25KQ7WEBZ", "Overall": "4.0", "Content": "Just what you expect for the price i order this because we are starting to homeschool and we wanted tablets for our 4 children. We ordered this one for our 2 year old son and he loves it the only thing is that if the Wi-fi is turned on the battery drains but as long as the apps that you download can work properly with the Wi-fi off its great or if you do not mind charging it everyday. Other than that we love them", "Date": "May 15, 2014"}, {"Title": "Kids Disappointed", "Author": "Billetta", "ReviewID": "R13O2M1F4TY2XR", "Overall": "1.0", "Content": "I purchased two of these tablets for my great niece and nephew for christmas.  NEITHER OF THEM WORKED! They wouldn't even take a charge.  Sooooooooooooo disappointing for the kids.  Now I am waiting for their Mom to return them to me so that I may return them back.  Not sure if I will ever take a chance on any other electric from other vendors on Amazon.", "Date": "January 10, 2014"}, {"Title": "The AGPtek kids tablet is not a high rating kids tablet please dont buy this item", "Author": "Stephan J.", "ReviewID": "R68Z104C8C52W", "Overall": "1.0", "Content": "I bought this tablet for not more than one week it stopped working first the touch screen stopped working then it just showed a white screen with lines on it, it just came off and wouldn't come back on.This kids tablet just isn't good at all i heard from a few people that they bought this same tablet and the very said thing happened to theirs had i heard this before i would have never bought it,i wouldn't recommend anybody to buy it......i would really like to get a refund PLEASE asap..remember ppl DONT BUY!!", "Date": "January 7, 2014"}, {"Title": "kids tablets", "Author": "ashley m collins", "ReviewID": "R33V2M2RUHW46D", "Overall": "4.0", "Content": "I bought this for my 5 year old son and he loves it. Decent game speed, but slow download speed. For the price it is a good deal and good for kids!", "Date": "January 3, 2014"}], "ProductInfo": {"Price": "$199.99", "Features": "One-Click play! Simplified UI: Easy to find any app you wanted. My mom and I no longer have to learn how to use the tablet.\nEducation for fun. Pre-install educational apps for child to learn letter, words, number, sharps¡­in a fun way!\nSmooth with Games. Enable to run high requirement 3D games such as Need for Speed Hot Pursuit.\nProtection. With bumper,the device is safe for dropping.Audio & eBook reader. Support eBooks and audio books. Pre-loaded kindle and iStorybook.\nWorry-freeParental Control Setting time limit or managing content and apps to ensure your children have a safe, healthy and fun journal with AGPTekAbot tablet.", "Name": "AGPtek® Kids Abot Tablet 7-inch Touch Screen Android 4.1 Wifi Camera Tablet PC with 32 GB TF Memory Card", "ImgURL": "http://ecx.images-amazon.com/images/I/51r0iVvQzaL._SY300_.jpg", "ProductID": "B00GOK2TEK"}}