{"Reviews": [{"Author": "RPozzolano", "ReviewID": "R1UFZ8S87R4MDD", "Overall": "5.0", "Content": "Had my first iPad 16gb since it was first released and just ran out of space.  I never had a problem with it.  Love the updated iPad and retina display.  Would definitely recommend it.", "Title": "iPad Air - My Second iPad", "Date": "January 10, 2014"}, {"Author": "Chad K", "ReviewID": "R11Y9BKHIIZ2BD", "Overall": "5.0", "Content": "After finally getting the 3rd generation iPad as my first iPad because of the retina display, I felt the this 5th generation was the time to upgrade.  I am not disappointed in the slightest.  Compared to the older generations the iPad air is amazingly light.  Half a pound doesn't sound like much until you hold it for a long time and realize how much it can weigh on you.  If you're a lifelong apple fan or still skeptical about their products, the iPad air will give you the best apple currently has to offer.  While it's more evolutionary than revolutionary, there is no need to overhaul the iPad.  It is the premier product of the day.", "Title": "By far the best generation yet", "Date": "January 9, 2014"}, {"Author": "GlevumGuy.", "ReviewID": "R2RROLA7BQ2I0M", "Overall": "5.0", "Content": "It's a marvelous device as other reviewers have noted though i would like to caution about storage capacity. Having read several on-line articles on 'what amount of storage' we opted for the 64 gb version but, after adding 10 apps such as weather, amazon, world clock, kindle, etc. no games, and about an hour of home movies this is already below 48. if we had purchased the 16gb version the storage would have been maxed out in less than two weeks. so given this experience, unless you are very diligent with downloading i would suggest purchasing double whatever storage capacity you have in mind (64 and below) as you may be using this iPad for years and an extra $100 spent now will amortize out to almost nothing.", "Title": "...thoughts on storage capacity", "Date": "January 9, 2014"}, {"Author": "MJH", "ReviewID": "R1SKJF51FR5WH0", "Overall": "5.0", "Content": "Our household is predominantly oriented towards \"pc\" computing.  However, I was compelled to purchase an Apple iPad Air for my daughter because of her academic needs at a major university.  Apple talk and the Business School has developed specialized work groups on campus with cloud-based content such as lecture notes, study guides and specialized apps.  Of course, the device also has many features to also keep a busy student entertained.  Battery life is amazing, and the device is small enough to be hauled almost everywhere.  Apple products are spendy, but the technology really is fairly impressive.  As usual, Amazon is the place to purchase with competitive pricing and quick shipping -- even during the holiday season.", "Title": "Apple iPad Air ideal gift for college business major", "Date": "January 7, 2014"}, {"Author": "Erica Mazzarella \"Mom of two\"", "ReviewID": "RE1KMKSHLPQNJ", "Overall": "5.0", "Content": "Very easy to interchange all my pics, contacts, etc from iPhone and easy to hotspot off iPhone so I can use it anywhere. Love how light it is and easy to read on.", "Title": "Love it!", "Date": "January 3, 2014"}, {"Author": "Lorranne M. Wheeler \"JustBeYou\"", "ReviewID": "RYLWRLJ6NIMMH", "Overall": "5.0", "Content": "It's an iPad! Came quick (amazon Prime is soo awesome) Exactly as expected. Recommend to use with Devicewear Ridge Slim Black Vegan Leather Case for the New iPad Air, Six Position Flip Stand and On/Off Switch", "Title": "Just as expected", "Date": "January 3, 2014"}, {"Author": "Jayson Pare", "ReviewID": "R1OP1KRVD9GZOE", "Overall": "5.0", "Content": "I bought this for my wife and she loves it. Easy to use for streaming music from our cloud network, surfing the net, & taking pictures. Our 5 & 8 year old kids use it over their nook and ipods to play games or watch Netflix.  It is great for the whole family.", "Title": "great product.", "Date": "January 3, 2014"}, {"Author": "Hardware4you", "ReviewID": "R37ZOXQ8H3ZKAA", "Overall": "5.0", "Content": "This Holiday season has been very frustrating for me.  I had to return a defective Kindle that I really wanted.  My wife has one and she loves it.  My kindle Fire HDX 8.9 inch had to be reset every day, got blank screens when playing games and I knew my download apps better than the cloud did!!!!Along came the Apple Air.  What a breath of fresh air.  So thin, so light.  The screen color is fantastic.  The movie quality is fantastic.  The large variety of Apple games, fantastic.  The battery life is much longer than most.  Just a top quality instrument.  If amazons customer service representative could have been a little nicer, I would have gotten another Kindle.The only con of the Apple is the price.  Apple Air 128 GB out of box is $799.00.  Almost two Kindles. Kindle had only a 64 GB.Is it worth it....you be the judge.  For me, I am keeping it.", "Title": "Apple Masterpiece", "Date": "January 3, 2014"}, {"Author": "Daniel", "ReviewID": "RBOVQXJI08P6V", "Overall": "5.0", "Content": "I bought this for my wife she loves the apple air it goes with her apple 5s and she still loves her kindle fire hd but she can do more with the apple, anyway she loves it and that makes me happy 5 Stars.", "Title": "Apple iPad Air MD786LL/A", "Date": "January 2, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00G4G22RI", "Features": null, "ImgURL": null, "Name": null}}