{"Reviews": [{"Author": "C. Martin", "ReviewID": "R1SBOD7NFSSLB0", "Overall": "5.0", "Content": "In some cases, professional reviews are on target.  However, the reviews on this tablet are way off.  The guy from the Verge must not have been testing the same tablet.  This is a great tablet.  The performance is great for anything I have thrown at it.  Forget the benchmarks - this tablet is fast!  It is honestly almost as fast as the Nexus 7 I just sold.  The 8\" form factor is so much better than the 7\".  The 1280 X 800 screen is the best 720P screen I have seen anywhere on any device.  The colors are great.  Plus 720P is perfect on an 8\" screen.  The only device with better sound that I have heard is the Nvidia Shield.  The sound coming out of the 2 speakers on the front is loud and clear.  My favorite feature though has to be the battery life.  It lasts and lasts and lasts.  I had a Dell Venue 8 and sold it due to the battery life.  It was awful.This tablet also has a micro sd card that can be used for storage as well as some apps.One tip - get rid of the stock launcher and use a different launcher like Nova or Apex.  It makes a HUGE difference in performance as well as battery life.  Did the reviewers even try this?  Probably not in most cases - even though it only takes installing an app and enabling it.  Disable some of the bloat too.I highly recommend trying this tablet out for yourself instead of listening to all the negative press.  You might end being surprised like I was.", "Title": "The Reviews Are Wrong About This Tablet!", "Date": "January 3, 2014"}, {"Author": "lance", "ReviewID": "R1SI8AISUI6SC2", "Overall": "5.0", "Content": "I have had a lot of different tablets. IPad, Samsung you name it. They were nice but i am in love with this tablet. Love the built in kickstand and this thing is built like a rock and works fast and flawlessly. If your on the fence give it a try I'm sure you will love it", "Title": "Perfect!!", "Date": "December 19, 2013"}, {"Author": "Shankar Raj", "ReviewID": "R1PXF6BNCCWMOC", "Overall": "5.0", "Content": "While I looked to buy a less pricy tablet for my relatives, I bought this tablet.While buying I considered the Nexus II 7\", the Galaxy Tab 3 8\" and the Galaxy Note 3 8\".  While I liked the Nexus for sheer screen and Google, my wife wished to check a tablet with external storage. Galaxy Tab 3 had external storage but somehow did not feel premium, be it the icons, the chome tipped bezels or the back. The Note had the pen and quad core still did not make an compelling option.Nexus II 7\" had a feel of being large though it was 7\" the form was solid and that's when I started to fall for the Yoga. The cylindrical 18Hour battery, much similar power button as Apple wireless trackpad's and Apple wireless keyboards, solid aluminium build, thin frame, sharp camera, option of micro SD card - with no rubber flaps, head phone jack on other side of the power button, nice volume rocker, dolby speakers and kickin stand made it a stunning unique feel.Jelly Bean 4.2.2 was great infact I did upgrade to B6000_A422_000_059_131219_WW_WIFI ver S100 and it is more than enough.I installed Puffin for flash, facebook, Dropbox & Angry birds.The 720P was sharp for viewing Netflix in full screen. Images I downloaded from Dropbox displayed crisp. Darker details on images as good as non retina ios devices. I felt that this device needs promotion so I write this. Worth for the money and I can safely gift a couple of these to my close relatives, while I would retain one for my son.", "Title": "One among premium choices outside of the Apple lineup.", "Date": "January 13, 2014"}, {"Author": "djk1940 \"Don\"", "ReviewID": "R3HW6LUIWTGFH8", "Overall": "5.0", "Content": "I purchase this 8\" Yoga tablet (it is actually about 7-3/4\") from Best Buy because it was on sale and was in stock.  I was hoping it would be easier to use than my Android phone....and I was not disappointed!  The built-in kickstand turns out to make typing using the virtual keyboard more natural, watching video more comfortable, and handling the tablet less fearful of accidentally dropping it or touching the screen.  The speakers are good enough that attaching external speaker is unnecessary, and the 18 hour battery provides maximum freedom to travel without a charger.  I agree with those reviewers that recommended downloading the Nova Launch app...it makes the tablet more user friendly than my Atrix 4G phone.  The table boots up 4 times faster then the Atrix  (each having the same apps) and is very responsive and fast.  Netflix and other video have a perfectly good picture and better sound than you would expect from a tablet....those who say \"it is not HD\" are simply wrong.  HD starts with a vertical resolution of 720 lines....this table has 800 lines.  On an 8\" or 10\" screen, one needs a magnifying glass so see the pixels at this pixel density.  My only appointment was that the table does not come with a flash for the camera. But with this kickstand, you have a way of positioning the camera and setting a timer so that you can be in the picture.  I found plenty of set-up information and a user manual on the Lenovo website, so I disagree with those who complained about a lack of information.I've been so satisfied with this table that I quickly realized that the 10\" model could easily replace my 10\" netbook....it has half the weight, twice the battery life, and the same size screen, but is much faster, can do everything I need when I travel....and more.  My wife also likes the 8\" model so I've configured it so that either of us can easily use it, with separated apps for our emails (the K-9 app I added seems to be a little better than the Email app that came with the phone, although both are good and offer a combined email listing for anyone with one or more email accounts).  The table already has a calendar that can be configured for either, or both of us; we can always quickly add files to the tablet with a flash drive through the micro USB using an adapter like this IVSO® Nexus 7 Tablet Micro USB Host OTG Cable - Micro USB B/Male to USB2.0 A/Female OTG Host Cable for Nexus 7 (Black). Having a 10\" model would also give both of us the option of using either of the two sizes, depending on our needs at the time.  So, I've also purchased the 10\" Yoga....but this time directly from Lenovo because they also offer a 32GB built-in memory model for only a few dollars more, which would make a better laptop replacement. But Lenovo's business practices could be improved... it took them nearly a week to realize an unexplained payment problem between Amazon and Lenovo, making it necessary for me to reorder the tablet.  But this model of Yoga tablet is tops...I don't think you would be disappointed with either the 8\" or 10\" models....their specs are identical except for the screen size and weight.Update: I had to return the 8\" Yoga to Best Buy...the battery would drain over night even when turned off; however, since Best Buy was out of stock, I ended up replacing it with a direct purchase from Lenovo; this time, the experience with Lenovo was excellent and a new tablet was quickly shipped.  My wife now prefers the Lenovo 8\" over her year-old 6\" Kindle, and I'm increasingly using the 10\" in ways I might have used a laptop...if I'd wanted to wait for the laptop to fully boot up then download a bunch of updates...", "Title": "A kickstand, 18 hour battery, and dolby speakers...unique features and my new standard for a tablet", "Date": "January 17, 2014"}, {"Author": "Honest Reviews From DIY man \"gadget man\"", "ReviewID": "R3ERS7ESHZ9P6N", "Overall": "4.0", "Content": "I bought this yoga 8\" tablet while on vacation in the Philippines (i'm not sure if the one I bought is available in the US, with \"voice\") , this tablet comes in three versions, the one I have is the quadcore \"voice\". I got home in california and took the sim card out of my samsung note II and cut the sim card to a micro sim card and stuck it in and it worked fine (I have ATT&T;).At first people laught and thought I was silly to have an 8\" tablet as a cell phone and I was feeling bad. But its been almost a month now and I love it.I no longer have to find my tablet & a cell phone. I also bought a Rapoo little blue tooth keyboard to go with it and the combo is great! I can talk on the phone while replying to an email and then pull up my email or calender and be taking notes and making appointments way better than trying to do it on a smart phone.My laptop has pretty much replaced my desktop, and this little gadget with MS Office and cloud computing is very quckly replacing my laptop computer, I only take my laptop with me on about half my trips since I can do almost all of my work on this little tablet.  It was very convinet on the plane too, my laptop was too big to open on the plane, but since I usually don't fly coach, I don't see that problem happening again.The built in stand is fantastic too, it was hard to find a case for it, but i eventually did. If you text and email 90% of the time, then this gadget is for you, I only talk on the phone 10% of the time, so making a phone call on speaker phone isn't really bad. I would not have bought this product had I known it was a Chinese company, since I do not support communists, but it has been a great product.The only reason I didn't give it five stars is because I'm still earning how to use it and samsung did have more user friendly ways of writing quick memos, but overall I love this thing. I has a long battery life too.", "Title": "Get the one you can use as a phone", "Date": "April 14, 2014"}, {"Author": "Paul A. Schmidt \"Paul\"", "ReviewID": "R22UK484IIYIOX", "Overall": "5.0", "Content": "I agree with what the other reviewers are saying about this tablet.  The main reasons I decided on it were the battery life, the stand and the quality of the build.  This is the best feeling most solid tablet I have ever had the pleasure of holding.  It really has some heft to it.  As others have said the on/off button is really nice.  The salesman tried to steer me to a more recently released Dell Venue 8 since it had better specs but I couldn't notice any difference when playing with the two.  I think specs are for the most part are overrated but that seems to be the only thing salespeople focus on when asking for their recommendation.  Are most of us really going to notice the difference between a 1.2 or 1.5 ghz processor?  No, but we will notice and appreciate the battery life and quality of build.  Anyway, if this tablet said Samsung or Asus on it, it probably would be dominating the market.  Really glad I read the reviews and decided on it.", "Title": "Great Little Tablet", "Date": "January 28, 2014"}, {"Author": "Mr. V", "ReviewID": "R3FTGJTGO4E12B", "Overall": "4.0", "Content": "First up, the good: I bought this because of the size and the way it feels in my hands -- the Yoga 8's battery bar (not sure what they would call it) is perfect for holding the tablet for reading, browsing the kinds of web sites I frequent, and e-mail. The thick edge balances the thin screen perfectly, and the battery it accommodates lasts for a good long time -- longer than I care to test it. If I were inclined to watch movies on this tablet (I prefer my large screen TV or 23-inch computer monitor), the kickstand would be a nice feature.I found it at the right price, which was a bonus. I think I might have purchased a different tablet if not for that.The bad: Lenovo takes Android 4.2.2 and puts their own mask over the OS. I knew this going in, and don't mind the uglification that typically goes with this kind of treatment. What I DO mind is that they crippled one of the most-useful core features of Jelly Bean, the ability to accommodate multiple users. This is aggravating, and Lenovo has yet to address multiple user complaints on this issue. Reports on their user forums suggest my experience of not receiving a response to a support query is the norm. If you think you will need customer service, you may want to do some more searching.All-in-all, there is great potential here. I'm tempted to go to three stars, but I'll bump it up for the potential.", "Title": "Lenovo got aesthetics and battery life right, but there are issues", "Date": "February 10, 2014"}, {"Author": "J. Busa", "ReviewID": "RDAUUCDWERVOQ", "Overall": "2.0", "Content": "This is my first tablet. I didn't want to spend too much because I didn't know if I'd like it and I'd know what I wanted when I bought my next one. Still, I expected more from this tablet. It doesn't have a HELP function. You can download the User Guide, but I expected a HELP function that would be quick and easy to access. I don't like to learn everything by trial and error. It is also hard to type in more than a few letters. The keyboard display is VERY sensitive and usually wipes out your message after you've typed half of it. So, I read emails but I never try to respond to them using this tablet. I can watch HBO GO and SHOWTIME ANYTIME, but MAX GO and FOX say that they won't work with this tablet. I wish they told me why. I'd like to know before I buy another tablet. I really like the sleeve that they sell with this tablet. It fits the machine very well. The tablet slips in and out easily and has a magnetic closure that works well. I also like the cylindrical edge that has the little stand. It makes the machine easier to hold. So, this was OK as a starter machine but I'm shopping for its replacement now.", "Title": "I've only had this tablet for a couple of months and I'm already shopping for a better one.", "Date": "January 16, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00G7GW2QG", "Features": null, "ImgURL": null, "Name": null}}