{"Reviews": [{"Author": "Scrampbelled", "ReviewID": "R1Q19YQE0EX9DQ", "Overall": "5.0", "Content": "I originally thought that the mini was a pointless compromise between the iPod and the iPad.  However, I bought one for my wife and have now found my own iPad to be over-sized and bulky.  The iPad mini's screen is only a little too small, but the sound is better than my iPad's and the keyboard is so much easier to use.", "Title": "Superior picture, sound and performance.", "Date": "January 27, 2014"}, {"Author": "David", "ReviewID": "RMVY7E9VOKHW0", "Overall": "5.0", "Content": "Great product, now even better, finally the mini is perfected with a retina display. A7 processor is very fast, same speed as iPhone 5s", "Title": "Finally the mini is perfected", "Date": "November 12, 2013"}, {"Author": "aeljas", "ReviewID": "R15T9GE4HOIILW", "Overall": "5.0", "Content": "I had my iPad 2 for several years before switching to the new iPad mini with retina display.  The retina is pretty but to me its unnecessary; i thought the resolution on my iPad 2 looked just fine.  The newer processer in the mini with retina is what really impresses me.  I didn't realize that i had gotten accustomed to waiting a few seconds for apps to open and again while switching between them.  This new iPad mini doesn't have any of that \"lag\" i experienced with the iPad 2.  It switches between apps seamlessly and quickly.  It also has impressive battery life, i can start the week with it fully charged, watch netflix on my breaks and lunches at work and i will usually run out of juice about the end of the day thursday.  And i use it throughout the day to check emails, online banking, send iMessages etc.  Also, despite some reservations i had at first about the smaller screen size, the clarity more than makes up for it and it is the perfect size for holding in one hand.  I'll never go back to a full sized iPad.", "Title": "So much better than my iPad 2", "Date": "May 5, 2014"}, {"Author": "KK", "ReviewID": "R25MR8SJY5T78", "Overall": "5.0", "Content": "resolution is great, compact.  Use for medical school when in patients rooms to take notes and also look up meds.", "Title": "great", "Date": "March 18, 2014"}, {"Author": "James", "ReviewID": "R3PWGWKUOKWDUK", "Overall": "5.0", "Content": "I loved my iPad 3, I used it for everything: music recording, as a teleprompter, word processor etc. I am obsessed with portability and design so I wanted the iPad mini but waited on purchasing because it didn't have a retina display in the first installment. So when the second version came out with a crisp screen I jumped at the chance and there are no regrets.The form factor is perfect on this version, it fits great in your hand, it weighs much less than the iPad (I can't speak for the iPad Air since I have never owned one), and it has the same great screen. Yeah I know its not as sharp or colorful as the Kindle and some other tablets, but the difference is slight and nothing beats the feel and functionality of an apple.I'm really enjoying it.", "Title": "Everything I loved about my iPad 3 in a smaller package", "Date": "January 18, 2014"}, {"Author": "Cynthia", "ReviewID": "R26PNUWPQQDPN8", "Overall": "5.0", "Content": "I just love it. This is exactly what I was looking for., easy to use, small, I can carry it with me at all times.Thanks", "Title": "Best ipad ever", "Date": "May 7, 2014"}, {"Author": "Amy Salas \"Amy\"", "ReviewID": "R28BN6KBI26F4C", "Overall": "5.0", "Content": "I love my iPad mini. It is just the right size and is very light. The retina display is amazing with the colors being so bright, bold and true to life. It is beautiful and amazing for gaming. I am extremely happy with the purchase and the ease of purchasing with Amazon and it's suppliers. I am disabled and do not drive so when I want to buy something I go to Amazon!!!", "Title": "Loving my iPad!!!", "Date": "May 7, 2014"}, {"Author": "Clay Alvord", "ReviewID": "RNUU3WC3Y2BPY", "Overall": "5.0", "Content": "I've been using the iPad 1 almost from the day it came out, and its been fine. I knew it was decent hardware but I never felt like it could be a major part of my life. Enter the mini with retina. This this is amazing. CRAZY fast performance and the perfect size to carry with me at all times. It's everything I know the iPad line had the ability to live up to. I'm super happy with this purchase.", "Title": "Everything I knew the iPad line could be", "Date": "March 20, 2014"}, {"Author": "Hulk", "ReviewID": "RTPQGDTSERAKY", "Overall": "5.0", "Content": "This tablet is book sized.  Very handy for reading - not too big, not too small.  It pretty much fits in your hand.  I use it off and on throughout the day and have been unable to drain the battery past 60% in a single 24 hour period.  I was able to compare the Apple Mini side by side with other tablets at one of the big box stores and preferred the Apple hands down.  Price was better at Amazon so I bought it here.", "Title": "Handy Tablet", "Date": "March 7, 2014"}, {"Author": "lance domhoff", "ReviewID": "R2E29L75BUAA5R", "Overall": "5.0", "Content": "This is the best tablet on the market today. It has top notch build quality and a very nice display. I had the fist generation and wasn't happy with the two things this one has over the first generation, Retina display and better CPU the A7 not that the A5 was bad but the much higher CPU is a better choice. Doubles the ram too but only noticeable with web pages. Over all a very good tablet that won't let you down and the build quality is top notch just like any other Apple product over the years. All I have to say it if you are in the market for a tablet the IPad Mini is an excellent choice. Get yours today.", "Title": "top notch", "Date": "April 4, 2014"}, {"Author": "Puja Sharma", "ReviewID": "R1KA1DJ5DNM44C", "Overall": "5.0", "Content": "The service was great...it was slightly cheaper then buying it directly from Apple...I would recommend this to others... its an awesome tool to have...im loving it!", "Title": "Love it", "Date": "May 27, 2014"}, {"Author": "Mary Kate \"Nature Lover\"", "ReviewID": "R3KFQTYZZRGKN9", "Overall": "5.0", "Content": "I ventured outside the Apple ecosphere with an Android tablet but am now back to the mothership. Nothing as elegant as the Apple tablet.", "Title": "Return to Home", "Date": "May 23, 2014"}, {"Author": "Kevin Gauthier", "ReviewID": "R8HUJZCNDKDY", "Overall": "5.0", "Content": "By now, you probably already know that this is a great product. Performance is smooth, pictures are crisp, and the battery lasts longer than almost any other tablet you can buy. What makes this product even better is that it's backed by Apple. Apple is one of the easiest companies to work with, and if something goes wrong with your device, they will usually spend no time in helping you get a replacement. I dropped mine a few weeks after I bought it, and I called Apple, and they gave me a new one under the warranty no questions asked.Overall great experience.", "Title": "Amazing", "Date": "May 22, 2014"}, {"Author": "Tiny", "ReviewID": "R1O5WL3JU49FKH", "Overall": "5.0", "Content": "Takes great pictures and Videos. Its apple product so i expect nothing less. Buy the retina so much better than other.", "Title": "great product", "Date": "May 22, 2014"}, {"Author": "Grump", "ReviewID": "R2ZG7QVFBJJAYC", "Overall": "5.0", "Content": "More portable than its big cousin, this little guy is everything you could want in a tablet.  Resolution is so good you'll not miss the larger size.", "Title": "Beautiful resolution", "Date": "May 16, 2014"}, {"Author": "kira", "ReviewID": "RKGU2SCJ0S4JI", "Overall": "5.0", "Content": "exceeds my expectations. Tool and toy. Use it all the time rakes place of computer many tasks. Mobile. Fun. Recommend it.", "Title": "love it", "Date": "May 14, 2014"}, {"Author": "Reshma", "ReviewID": "R2TZRVQKPEWPTD", "Overall": "5.0", "Content": "Its really awesome to have Apple devices. I have iPhone and Mac and I purchased this recently. I love to use apple devices.", "Title": "Love this device", "Date": "May 14, 2014"}, {"Author": "perry", "ReviewID": "R1EK1KTWIGWHVD", "Overall": "5.0", "Content": "Fast ,easy to use, and extremely portable was a gift for my daughter she just loves it. Arrived when promised in perfect condition, couldn't be more pleased", "Title": "It's an awesome device", "Date": "May 5, 2014"}, {"Author": "Shimmy", "ReviewID": "RECB24D8GHA4A", "Overall": "5.0", "Content": "What more can I say? It's an Apple. It runs great! I love everything about the tablet, Netflixs, HBO Go, and YouTube.", "Title": "It's an Apple", "Date": "April 2, 2014"}, {"Author": "Lester S...", "ReviewID": "RJOMA9219JMQI", "Overall": "5.0", "Content": "Perfect my wife loves it and that's that, fast delivery and nicely pack happy wife happy home, she can't put it down.", "Title": "Just the perfect gift", "Date": "March 6, 2014"}, {"Author": "Johnny", "ReviewID": "R1MI4DCIDCAJQR", "Overall": "5.0", "Content": "Last week I tripped over my iPad 2 charging cable (30 pin) as it was charging my pad and it ripped half the port's guts out of it. I love when I do stupid things like that! Give me an excuse to buy another one!  I was shopping around and was looking between this and the air and ultimately decided to go with the mini with retina.My wife has the 1st gen iPad mini and I regularly found myself using hers over my 2 due to the weight of her device.I highly recommend checking it out before you buy the air. Best Buy displays them both side by side.", "Title": "Upgrade from IPad 2", "Date": "February 26, 2014"}, {"Author": "Dimitar Bairev", "ReviewID": "R6PWLESX4MDGZ", "Overall": "5.0", "Content": "The iPad delivers excellent quality (thin metal body, good design), excellent screen resotion and very fast response.I really like the speed and ease of use, was very easy to activate straight out of the box.A small disadvantage is that with extensive use you have traces from your fingertips on the screen, but they are easily removed with s softcloth.I can strongly recommend it to people who need full functionality on the move and don't want to carry the bigger iPad air around.", "Title": "Excellent", "Date": "March 17, 2014"}, {"Author": "Bob", "ReviewID": "R1T9AHN334P4NU", "Overall": "5.0", "Content": "I moved from the iPad 4 to the Mini with retina display cause I was looking for something lighter & more portable.  I was worried that it might be to small but took a chance.  I am happy I did.  While the Mini is smaller it is still of enough size to see full web pages and most everything else I did on the bigger one.  The light weight and ability to easily hold in my one hand has been the best part.  I just turned my other ipad over to the wife so she got an upgrade too from her ipad 2.  Anyway, I'm happy I \"downsized\"", "Title": "Moved from iPad 4", "Date": "March 14, 2014"}, {"Author": "Weikuang Wong", "ReviewID": "R3DGYQWNXZK1AN", "Overall": "5.0", "Content": "There are a lot of good things to say about the iPad mini with retina display. I'm not going to list them all because other reviewers have listed most of them already. I do have to say if you are looking for a tablet because you are planning on buying and reading books, I would highly recommend this. In my opinion the kindle app on this tablet is perfect for reading books. For me, reading on this really feels like reading a book and doesn't feel like reading on a tablet. When I set the color to sepia and turn the brightness low, the screen does not burn my eyes at all.Most people might already know this but I wanted to mention that the kindle app is slightly different on other tablets. I don't know why but the kindle app for the ipad mini gives you more options than the Samsung galaxy tablets. Apple's kindle app lets you change the font and lets you highlight text in 4 colors. You can't change the font with Samsung's kindle app and you can only highlight with 1 color instead of 4. I also want to mention the color sepia is also different in other devices. I personally prefer apples version of the color sepia because it doesn't burn my eyes when I'm reading books.If you are planning on buying this to play games, I would highly recommend getting 32gb or more. 16gb is really not a lot of space if you are downloading a lot of games. Apple actually has a lot of great games so trust me will download more games than you expected...The only thing I don't like about the iPad Mini with retina display is that a lot of the free games have way too much adds and commercials. Other than that I can't think of anything else I don't like about this device. I would definitely recommend this product to anyone reading this review.", "Title": "Great For Reading Books With Kindle App !!!", "Date": "March 6, 2014"}, {"Author": "For Real \"HAND\"", "ReviewID": "R1LUE1WDE8MNOK", "Overall": "5.0", "Content": "Android, Nook, Kindle, Surface, Asus...  My husband likes buying gadgets and in the last 18 months we went through as many tablets, but we liked none of them. Finally, he gave up and bought me an iPad mini 2, and we both LOVE LOVE LOVE it! Only regret is we should have bought a 32GB or 64GB model, maybe with cellular, but we only had limited funds. Will be saving up for a higher model and let the kids have this one. The iPad mini is just so much better than everything else. Sorry, Amazon! I love Amazon but even the latest Kindle fire is UGLY and very difficult to use. All Android tablets are boring and susceptible to viruses.  The iPad mini gives a consistent experience. I just wish the App Store had a grid listing view like on Windows 8. Other than that my iPad mini connects to WiFi every time and maximizes the speed, unlike the other tablets. The screen is totally the best! I play Amazon videos and they've never looked better. The kids love it, too, and wonder why we waited so long to get a \"real tablet\" in their words as opposed to those low-quality imitators.", "Title": "Nothing beats the real thing", "Date": "February 9, 2014"}, {"Author": "D. F. Van Slooten \"always look on the bright ...", "ReviewID": "R134BLP56363TW", "Overall": "5.0", "Content": "Already owned an iPad 1 and 3, now decided to buy the iPad mini with Retina display. Beautiful screen with the well known Apple quality.", "Title": "Just a little brilliant tablet", "Date": "January 27, 2014"}, {"Author": "Ronaldo Gomes Mariano Junior", "ReviewID": "RALIOL759BV84", "Overall": "5.0", "Content": "Much better than iPad 4 and now with retina display. I just think that 16 GB are not enough because the new apps are bigger than before.", "Title": "Excellent.", "Date": "January 7, 2014"}, {"Author": "Joe", "ReviewID": "R4LLPD2IPBVAJ", "Overall": "3.0", "Content": "First off this is my very first Apple product, except a first gen iPod nano. I got the iPad mini because I needed a device to be used for school work. I needed something portable, great battery life, and functional. I was going to get another laptop after mine took a coffee bath but decided to go with the iPad mini because I was able to get it through AT&T; for only $20 a month so I didn't have to shell out a huge chunk of change. And I get have internet pretty much everywhere I go and don't have to worry about connecting to wifi just to do some web browsing.The iPad mini works great for me because I have a lot of down time between shifts at work. My shifts are only about two hours, but I'll have 3 or 4 shifts a day and sometimes 30 minutes to an hour downtime between each so I get to cram in school work between. It's super portable, I just throw it in my backpack and because of the battery life I just leave the charge cable at home. No ned to lug around a clunky laptop.With a keyboard this really has replaced my laptop, there is some trade offs. I don't have a mouse and getting used to apple software and its limitations. But for youtubing, writing and web browsing it is great.I don't like the App Store, I feel the apps on there are trying to nickel and dime you for every last penny. You really need to watch what you buy and make sure it is what you are paying for. The first night I had it I paid 5 bucks for a word processor (silly me) that I thought was Microsoft word it turned out to be just a bunch of tutorial videos. The games are even worse, the free to play games want you to pay for everything. There are good games and apps but its hard to find them because of all the crap in the App Store. There are thousands of bad apps for every good one.  I would give this a 5 star if the App Store wasn't so crappy, apple needs better content curation.Despite the App Store and the software limitations I was able to accept a few trade offs for the great battery life and portability.", "Title": "Great for me but not for all.", "Date": "January 26, 2014"}, {"Author": "p joel nishanth", "ReviewID": "R3HXN2P84PNCGS", "Overall": "5.0", "Content": "I ordered this through Adasbooks1 seller. I paid for regular shipping which is 5$ but I received it in priority mail. So I had received it pretty fast. And the cost I got it for was 295$ . The product is really amazing and would recommend this to everyone. This product is very handy and very fast!", "Title": "Smart and light weight", "Date": "June 2, 2014"}, {"Author": "Mom2Two0811", "ReviewID": "R8LAJGR06R23E", "Overall": "5.0", "Content": "I have been sitting around for years debating whether or not I should purchase an iPad. I kept putting it off because I own an iPhone and have for about five years now. I don't know why I waited so long. I opted to purchase through Amazon since I have yet to have a bad experience and I have to say this is no exception. It arrived sealed in its box and as soon as I took it out I instantly fell in love with it. I own a Kindle (with special offers) but downloaded the Kindle app and ended up using this thing non-stop to study for my NREMT exam. My guilty pleasure is watching Netflix on my computer at night as I fall asleep but now that I have an iPad (and a Lifeproof case I purchased at the same time) it has been a lot easier on both myself and the machine, haha. If you've been putting it off you won't regret purchasing it. I am just sorry I didn't dive in sooner.", "Title": "Amazing.", "Date": "June 1, 2014"}, {"Author": "MekoRush", "ReviewID": "R269RMHSWFB97F", "Overall": "5.0", "Content": "Good: I use this thing like every day because it's so flat and the battery seems to last forever lol. Ok with heavy use the battery last 3 days for me. the speed is awsome, it has all the latest apps, can play iphone apps too. i would pick this up over a small chromebook or a small 10 inch screen laptop.bad: other than retina display it wasn't a big difference from the other year model. eh", "Title": "the best mini pad out right now", "Date": "June 1, 2014"}, {"Author": "Juan Ignacio Merino Diaz", "ReviewID": "R1KSUW9HEM09VS", "Overall": "5.0", "Content": "I bought the Ipad ,mini with retina display some months ago and its great, the graphics are amazing. . .", "Title": "sIMPLY gREAT", "Date": "May 8, 2014"}, {"Author": "Lian Gao", "ReviewID": "R1S1ZG5CB287PB", "Overall": "4.0", "Content": "My wife likes it. The size works perfect for her. The ipad air might be a little bit too big when holding with one hand.", "Title": "Very nice product!", "Date": "May 2, 2014"}, {"Author": "Carrie Emrikson \"Carrie\"", "ReviewID": "R1MBMQM1EEYXIV", "Overall": "4.0", "Content": "I have had this for about a month.  I haven't filled it up with apps yet but I've used it a fair amount already.  It works quickly - takes nice pictures (love the photobooth app that comes with for taking goofy pics with special effects.)  I am not super proficient with Mac products - I'm really an Android girl....  but... I am kind of annoyed at having to use the central button to close things and its a little clunky to switch between applications.  I bought it to use both for entertainment as well as for work.  I'm planning on using it for taking classroom observation data, notes etc.  The display is beautiful, it is very lightweight and the battery (with light to moderate use) lasts for several days.  I've really only had to charge it twice BUT I haven't used it to watch videos or download TV shows yet....  I like the smaller size, it is easier to carry - just a little larger than my Kindle Paper.  I foresee using it much more in the future as I find more productivity apps and possibly some magazine subscriptions.", "Title": "great little gadget!", "Date": "April 21, 2014"}, {"Author": "Lyle Goulbourne", "ReviewID": "R3E8TWQKSYAZ7B", "Overall": "5.0", "Content": "The iPad mini came without any marks or blemishes. It came on time and the box tracking worked nicely. I recommend buying the iPad. The big screen is very nice, but it's also very portable.", "Title": "Perfect condition", "Date": "March 8, 2014"}, {"Author": "Dorothy E. Nestel \"Dee\"", "ReviewID": "R2LXQB5Z2UWJZ7", "Overall": "5.0", "Content": "She says this has made her classes so much easier., and has helped make a good student even better than imagined possible", "Title": "Gift for grand daughter", "Date": "May 25, 2014"}, {"Author": "Noah A. Lefevre \"akb723\"", "ReviewID": "RZ8TRRNLL3G49", "Overall": "5.0", "Content": "I love Apple products, and and mini i Pad is without a doubt a classic. I bought it as a gift which I generally do because people always like it. This is also with Retina Display.", "Title": "Excellent!", "Date": "May 25, 2014"}, {"Author": "Eduardo V.", "ReviewID": "R2ZO4BN2GJIBP9", "Overall": "5.0", "Content": "Awsome tablet, a bit pricey but great. I changed my galaxy tab 3 8 inch for this one, and will not say the tab 3 is a bad choice but the ipad mini retina is a superior tablet, the build quality is amazing! The look and design are flawless, The speed is also excellent and of course the screen resolution is where the money is. The rear camera takes excellent  pictures just as good as the iphone 5 i belive, and the front facing camera also has good resolution. In terms of Apps, i believe the Apple apps seem to be a bit better designed than android's, but android does have its perks. For example i miss the utorrent app!, also android's openness and the huge customization options it offers. But again i tell you this ipad mini with retina display is an incredible device, and i guaranteed you will not be disapointed with it. I watch movies in it mostly on netflix, they look great, i also do all of my social media, web surfing  and emailing with no trouble. One of the things that got me to buy this ipad, where the excellent free apps tha come with it, it comes with: imovie, iphoto, garageband, keynote, numbers, and pages and they are all amazing apps, and i believe they are all worth about 45$, so it's a great value, specially if you are like me, who makes music all the time and edit videos also from time to time. So if you can afford it, you won't regret buying this ipad, it's almost perfect. If not the galaxy tab 3 (but the 8 inch version) is a great choice for the money and the galaxy note i believe is also great.", "Title": "Great ipad, superb display flawless design, perfect size for me.", "Date": "March 3, 2014"}, {"Author": "JoeNolan26", "ReviewID": "RK04J62M7CSEO", "Overall": "5.0", "Content": "I love the size, and the new operating system. I had bought a Kindle fire, and the apple is much easier to use for web applicatons, both are great readers, the Ipad is lighter and seems to have a better feel. Very happy with my purchase.", "Title": "This replaces a Ipad 1", "Date": "February 28, 2014"}, {"Author": "Waterman Video Prod \"David Waterman\"", "ReviewID": "R2J56CS8IWR3X0", "Overall": "5.0", "Content": "This ipad is one of the best purchases I've ever made. I bought it with a Fintie Case. The case was just $9.00 and it's holding up perfectly. The ipad is very fast. Has great camera quality. Although I am discouraged it doesn't have slo-motion like the iphone. It's exactly the same as the ipad air, just smaller. You won't be dispointed. I'd give more stars if there were. AWESOME PRODUCT!!!", "Title": "Best iPad EVER!!!", "Date": "May 2, 2014"}, {"Author": "RAUL SOSSA SOSSA", "ReviewID": "R2OS0R07GIRMSA", "Overall": "5.0", "Content": "Thank you so much! Amazon has never failed to me. This time I bought more than 1,000 dollars in electronic products and every on them got my home safe and working. No issues. All Good!", "Title": "Great Apple Product!", "Date": "May 1, 2014"}, {"Author": "Time Lord", "ReviewID": "R8BHNR9U62LW0", "Overall": "5.0", "Content": "I bought this white iPad mini retina from Target and they gave me a $25 target gift card, what a deal for $399.First of all, this ipad is the perfect size. It's not too big like regular iPad Air and it has very similar performance. You cannot even see the technical difference, unless if you purposely try to benchmark and compare between the two. The graphic quality is a slight improvement from previous ipad mini, but not so noticeable like the new iPad Air. Meh... it's still not really a big deal to me. Apple has been always expensive from the beginning of time, but the quality and apps compatibility is no match against other competitor. So, yeah it's worth it.Pros:- Light and thin size.- A7 core processor. Faster processor compare to previous iPad mini.- 16 GB hard drive. Big enough to put 3 full length DVD format movies onto it.- Better camera resolution front and back.- I love Facetime better than Skype and you can use either one with this iPad mini.- More cover and bluetooth keyboard now available. Check out Anker products on Amazon or ianker.com- iMessage can send text, picture and video message to all iOS owner such as another iPad or iPhone.Cons:- Costly for 16 GB.- Screen resolution is not as good as the older brother, iPad Air. Although it is better than previous generation of iPad Mini.", "Title": "Good only for light use", "Date": "April 24, 2014"}, {"Author": "Hopeful", "ReviewID": "R1VEV9HF4VTY8H", "Overall": "5.0", "Content": "Just one of millions who LOVE this tablet. Just the right size, not too small (although I do also own an iPod and iPhone) and not too large, but just right. I had first bought a Nexus tablet thinking I'll save a little $, but now that I have this iPad mini, I can say that was the wrong strategy because the Apple is sooooo much better that the Gooooogle.", "Title": "Just 1 of millions", "Date": "April 6, 2014"}, {"Author": "ALLAN", "ReviewID": "R105H618EKYZU6", "Overall": "5.0", "Content": "THE UNIT IS GREAT AND I HAVE NO PROBLEMS. THE ONLY PROBLEM IS THAT I ALSO HAVE THE IPHONE 4 AND SOME ON THE APPS, CAN'T BE INSTALLED ON THE IPAD.  THAT IT.", "Title": "I LOVE IT.  JUST LIKE MY WIFE. LOL", "Date": "March 11, 2014"}, {"Author": "FerFona", "ReviewID": "R1JPZ5UQH7FHCJ", "Overall": "4.0", "Content": "Nice and best tablet on market !. But i found cons. Like- no fingerprint-no panoramic photos- no slow motion vídeosIs very fast! Sharp !. And easy to use!.", "Title": "Good deal", "Date": "March 10, 2014"}, {"Author": "munchie", "ReviewID": "R34OY8BESAMAWV", "Overall": "5.0", "Content": "It's fun to use + it's fast.  I'm very satisfied .... Even the box it comes in is impressive .. lol", "Title": "It's great", "Date": "March 3, 2014"}, {"Author": "Mrs. Caroline M. Anderson", "ReviewID": "RNFIFST1G98ZR", "Overall": "5.0", "Content": "This was a great choice for me cause. Can put in my purse and read my books when ever I want.  The small size is big enough for comfort and easy to read keys", "Title": "Awedome", "Date": "February 21, 2014"}, {"Author": "Dmitry Shishkin", "ReviewID": "RTC80LXEYNX8Q", "Overall": "4.0", "Content": "Actually, I liked this tablet better than I thought I would. However, as you will see below I have some major gripes with the price/features combination for this model. Lately I have been seriously thinking about upgrading my iPad 3. Tried the new Samsung Tab 10.1 (2014), iPad Air, and this Mini. Neither one of those larger tables really tempted me to give up on my iPad 3. Yes, they were a bit better in this and in that, but eventually neither one felt twice as good as my iPad 3 to justify their price (I figured that I would have to double the $280 or so that would get after selling my iPad 3).iPad Mini retina did feel like a major upgrade in terms of size and weight. In fact, it is a better value in terms of size/weight vs screen size against iPad 3: you are dropping 50% of the weight and only losing 33% of the screen real estate (and nothing in resolution, of course). Surprisingly, most of the time I did not even feel any limitations of the smaller screen. I think part of the reason that made me like the new iPad Mini was that lately I have got a MBPr and the need for a larger retina screen now is satisfied by the laptop while the compactness of the tablet becomes more important.However, there are two main problems that I have with the new Mini. One, is the limited gamut of the screen. I might be picky, but I do see the difference and not only side by side, but also when moving from one device to another. The larger iPad's home screen looks simply gorgeous in comparison to the Mini's home screen. (Probably, part of the reason is that I kept iOS 6 on my iPad 3 and it's color scheme is less \"whitish.\")Another problem is pricing. How come after all these years of upgrading its larger tablets without increasing the price Apple decided to do it differently with the iPad Mini? The \"original\" iPad Mini was $330 and the iPad Mini retina is $400? Yes, the Mini got better, but the Air got better too with no price increase, same thing with iPad 4, iPad 3, and iPad 2. If they kept the price at $330 I would overlook the bleaker screen and go for it. Or if the screen had 100% gamut I would pay $400. But not both. I can not justify paying that much money while not feeling that I am getting a premium product. There are way cheaper tablets out there with 100% gamut and I do not want to pay $400 for a tablet and feel that it is inferior to a $220 tablet when it comes to such an important parameter as its screen.You can see how much fewer reviews of this tablet are out there on amazon compared to the iPad Air. Seems like people are just not buying this model as much. I am returning the Mini and waiting until Apple comes up with an upgraded model that has 100% gamut screen. And they better not add another $70-$100 chunk on the top of the price when it happens!", "Title": "Nice tablet, but a bit of a rip off..", "Date": "January 17, 2014"}, {"Author": "Grace Rojas", "ReviewID": "R1PH74FO1X5BCY", "Overall": "3.0", "Content": "The product is fine, was new and in good conditions... My complain is with the shipping!  I payed on Monday for one day shipping and this item arrived on Thursday! I waist my time waiting for it all Wednesday and part of Thursday! And it didn't arrived until Thursday afternoon! I should get my money back on that!!", "Title": "One day shipping? Yeah right!", "Date": "May 30, 2014"}, {"Author": "imperio", "ReviewID": "R21F0BRC3ZEH3C", "Overall": "5.0", "Content": "Bought it as a gift for my sister and brother in law as a anniversary gift and they love it... about me i just love to sneak it and use... i just love the grt look and performance of the ipad mini... and its like ipad air for less price but in small screen size....", "Title": "Love it", "Date": "May 1, 2014"}, {"Author": "Fengbian", "ReviewID": "RFP7U5UA1TE1A", "Overall": "5.0", "Content": "Prefect. cheaper than the normal price. It is not used one. they are not cheating. It is the gift for gf. thanks", "Title": "good", "Date": "February 8, 2014"}, {"Author": "Marjorie Matusalem", "ReviewID": "R2L5WGOYRPA8FK", "Overall": "4.0", "Content": "I love the iPad mini! It's the perfect size for me since I have pretty small hands. I can type with my thumbs as if texting on a smartphone. The screen I clear and has great graphics. One thing I dislike about the iPad mini is the battery life. Then again, I am constantly using it since my MacBook isn't working. All-in-all, it's a great alternative to a MacBook. Just minus the memory space. And I did receive the 16GB one as a gift, so no complaints.", "Title": "Perfect size", "Date": "December 29, 2013"}, {"Author": "Tim Mahoney", "ReviewID": "R11C04DT515LKS", "Overall": "5.0", "Content": "Just what I wanted!", "Title": "Yep,", "Date": "April 22, 2014"}, {"Author": "Roberto", "ReviewID": "R39MYK4BX3WMED", "Overall": "5.0", "Content": "I choosed this stars because this gadget is so great, is truth, I like it, I can do anything... it's one very very very good product!!!", "Title": "it's Awesome", "Date": "February 17, 2014"}, {"Author": "Ronald Guillory", "ReviewID": "RYRTZTLCWMAO2", "Overall": "4.0", "Content": "The unit meets all expectations as all apple products are as put on the market as the founder would have required RMG.", "Title": "A winner", "Date": "February 9, 2014"}, {"Author": "david hailey", "ReviewID": "R3CG1FDJ3RDI4A", "Overall": "5.0", "Content": "it's an iPod we like it we share it we love it it's great it's smaller and its faster,don't leave home without it", "Title": "it's an iPod", "Date": "January 12, 2014"}, {"Author": "justin nielson", "ReviewID": "RRYKRH5Z0XTVG", "Overall": "1.0", "Content": "Don't be fooled like me. I purchased this thinking it was the new iPad Mini with the Retina Display. I double checked the model # on the back of the box and was sent the old iPad Mini model MD531LL/A that retails at Apple store for $299. Suffice to say I'm filing a claim to get my money back plus shipping.", "Title": "Sent old iPad Mini", "Date": "December 30, 2013"}, {"Author": "joferna", "ReviewID": "R1BM5JT1XYQQJR", "Overall": "3.0", "Content": "Looks like a good team, but you need to use additional applications for some programs, for example, bluetooth.Typical of Apple, complicated,  I did't like ... I prefer Android", "Title": "Apple Ipad mini retina", "Date": "January 3, 2014"}, {"Author": "Zi Cai", "ReviewID": "RYH78NX8YX83V", "Overall": "4.0", "Content": "I just order same iPad mini yes today, the price is $424, but today is $412, , what happen, can I get refund?", "Title": "Different Price", "Date": "January 23, 2014"}], "ProductInfo": {"Price": "$399.00", "ProductID": "B00GQDBS7O", "Features": "Apple iOS 7; 7.9 Retina display; 2048 x 1536 resolution\nA7 chip with 64-bit architecture and M7 motion coprocessor\nWi-Fi (802.11a/b/g/n) with MIMO; 16 GB capacity\n5 MP iSight camera; 1080p HD video recording\nUp to 10 hours of battery life; 0.73 lbs", "ImgURL": "http://ecx.images-amazon.com/images/I/41xjIRGO%2BLL._SY300_.jpg", "Name": "Apple iPad mini with Retina Display (16GB, Wi-Fi, Silver) NEWEST VERSION"}}