{"Reviews": [{"Title": "best tablet for emulation", "Author": "knasty", "ReviewID": "R3BT2KEVTJY5E4", "Overall": "5.0", "Content": "This jxd product is superior to its older version my old 7300 gave out on me so I got this. I suggest getting go launcher right away. And a soft case to store the tablet in. This product appears to be strong but water damage could easily happen. I dropped the tablet out of my big rig today it fell 6 ft onto concrete not a scratch. Get a case. I wish I could make calls on it. This tablet will play all the good games like n.o.v.a 3 and dead trigger. Easily. The thumb sticks are awesome and compared to my PS vita there a tie. This tablet it worth it so stfu and buy it. Oh and a 64 GB micro SD.", "Date": "April 5, 2014"}, {"Title": "Fast ship and perfect device", "Author": "M. Stone \"Frater Iustitia Omnibus\"", "ReviewID": "R2PF39PO9WT6ZD", "Overall": "5.0", "Content": "I ordered this thing like Monday and it's here by Wednesday from Hong Kong. Crazy fast. I realize that customs can hold things up so your mileage may vary.Exactly what I was looking for in a game device. I wish the manual was more robust, but that's what community forums are for. This thing is a beast of a handheld compared to other open game systems I have tried. It's a keeper.", "Date": "March 5, 2014"}, {"Title": "Marcelo", "Author": "Marcelo S. \"marcelojassos\"", "ReviewID": "R127C5AIOZX2OZ", "Overall": "5.0", "Content": "The best hand hel ever made if you looking for MAME and other emulators this is it. I purchased one and I like it a lot. With suspended mode perfect for marathons.", "Date": "January 22, 2014"}, {"Title": "Simply amazing for the price!!", "Author": "Jonathan Dagnillo \"The D\"", "ReviewID": "R27DVN4NFT8NMV", "Overall": "5.0", "Content": "This thing is simply amazing.  I previously have owned a JXD-S5110 handheld device, and while it was half the price, the 7800b is ten times the machine.The hardware is surprisingly high quality for a Chinese import.  Overall it has a solid feel with decent weight.  The buttons all work well, especially the D-pad and analog (yes, true analog) sticks.  The only exceptions are the shoulder buttons, which are wobbly when not being used and are a bit awkward, and the secondary (back, menu, start/select etc.) buttons which are very clicky.  Neither of these is a deal breaker though.  The screen is very bright and vibrant, with a decent viewing angle thanks to it being IPS.  While this doesn't have a true HD resolution, the pixel density is more than adequate.  The speakers are quite loud too with little to no distortion.  I have read complaints about wifi strength being an issue, but in my unit it was mire than adequate.  Battery life is good with a minimum of two hours and more depending on what games/apps you are running.The built-in software is so-so.  It has some odd restrictions such as shortcuts that won't permanently go away from your home screen, and some other random oddities.  I immediately loaded the Supercharged rom which can be found online, and cleans up the system considerably and provides much more flexibility.  While this system may not rival the newest hardware out there, it is more than adequate for emulation and most Android games.  I tried all of the following emulators and games with no slowdown at all:SNESNESGBAGenesisNeo GeoN64PSOnePC-EngineMSXMAMEGameboyAtari 2600Quake 1, 2, 3DoomSonic gamesBeach Buggy Blitz...moreHere are the negative points:-No bluetooth.-There is no charging indicator light.  Not a big deal, but it is a bit odd.-This will not charge through USB, only through the provided cable.-The trigger buttons are a bit wobbly and the secondary triggers are awkward to reach.-There is not much onboard storage, even with the supercharged ROM (which re-allocates the storage).  You will want a decent memory card to go with this.-The android battery indicator in the notification bar is really wonky.  I don't know if it's my unit, or the supercharged ROM, but it will drain like crazy for the first 20%, then slow to a crawl, then alternate between fast and slow draining.  This makes it very hard to estimate the actual amount of battery left, but be assured that it still gets a decent amount of life.I absolutely love this system.  It does everything I wanted and more.  While there are shortcomings, they are worth it for the price.", "Date": "March 1, 2014"}, {"Title": "Question before buying", "Author": "monolex83", "ReviewID": "R3HIBIBV3K1TSB", "Overall": "5.0", "Content": "Hi, I'm from Guatemala City, i have a question, this game pad works in my country?I saw the video in the internet and saw that you can update the emulators with the game center X this only works in China or Asian countries or is available too in Guatemala.", "Date": "February 3, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00GBM937M"}}