{"Reviews": [{"Title": "Meets expectations; used daily.", "Author": "Britton", "ReviewID": "R1VJ8XGNNQYFPD", "Overall": "5.0", "Content": "Received as a birthday gift around the holidays and I have used it every day ever since.I am a bit of a techno-phile.  I've been using computers since the days of parachute pants and the mullet.  I have both Windows and Linux computers and have fully embraced the Android OS.  I still cannot bring myself to spend the money required to own Apple products, so I cannot and will not compare this to an iPad.What a handy device it really is!  It's wifi ready, has a headphone jack, a mini-HDMI output, and it can be charged with either a supplied A/C charger or a micro-USB charger.  Its 7” screen size keeps the whole thing manageable but much bigger than a phone screen.  I think it’s an excellent balance of size and convenience.  My wife can keep it in her pocketbook without feeling weighted down or feeling like it has taken over her bag.  If I had to, I could keep it in the front pocket of a pair of slacks (not jeans, though).Even a newbie Android user should be able to figure out how to use this tablet.  Follow the instructions to fully charge the batteries before using without the plug.  But I started working on it right away with the device plugged in.  The Settings screen is accessible through the bottom of the screen and the apps list button on the home screen.  Through Settings you can get to the wifi settings where you log in to your local network.  I was on the internet in less than a couple of minutes.  After a quick download through the Play store, all my favorite apps including IMDB, Accuweather, Firefox and more were immediately available.  It also loaded my favorite games including 7 Little Words, Angry Birds and Texas Hold’em.  To add a recent picture I took as my wallpaper, I loaded QuickPic to organize my pictures and Tonido to access all my favorite files from my home computer.I asked for this tablet as a gift to provide two tasks, both of which it handles very well.The first is to give me internet access - mostly IMDB - while I'm watching TV with the Queen.  The wife and I love to watch TV and movies and we are always wondering where we've seen that actor/actress before.  It works very well for just about any online access you will need.  I’ve even used it in the kitchen to try a new recipe for banana bread.The other task was to have an easily portable tablet available for when the Queen and I are running errands or on a road trip.  I've installed the 'hot-spot' option on my cell phone so when we're out and about, we can easily log into the internet via wifi while driving or shopping.  Our previous tools for that were either our cell phones (not as easy to see) or our laptops (too big and clunky for the car).  This tablet provides the perfect balance.Some downsides to the Y88 are the battery life and the availability of apps.  My favorite weather app is WeatherBug which is not available for this tablet.  Not sure if it’s the tablet or WeatherBug that’s at fault here, but I found a reasonable solution with Accuweather.  There were a few other apps that I looked into loading and they were not available, but I’ve also found viable workarounds.  The battery issue is not unusual for tablets, so no major complaint here.  I’ve dug up some eBay sourced micro-USB chargers from around the house and have plugged them in where I sit with my tablet around the house and just operate ‘wired’ as necessary.  Not that big a deal.  We do the same in the car until we need to go wireless.  Simple.Overall, this tablet met all my expectations.  Hope it does the same for you!", "Date": "January 27, 2014"}, {"Title": "Absolute Junk", "Author": "Crunk Panda \"Crunk Panda™\"", "ReviewID": "R3GUYUPHVQD7K0", "Overall": "1.0", "Content": "My kids each received one for Christmas from their grandparents. Complete and total ripoff. The screens are awful. Once you get past looking at something that looks like a bad 3D view, you are welcomed to your own personal hell by network issues. It connected to my network no problem, but, only in appearance. It took 20 minutes to load cnn.com, and poorly at that. It constantly dropped connectivity and showed network \"out of range\" even when feet from the router. As a very tech savvy person I tried everything. Reset routers and modems, forgot connections and reset, even full factory reset. Same story each time on both tablets. Their customer service basically does not exist and I am returning. DO NOT BUY THIS TABLET UNLESS IT IS FOR YOUR WORST ENEMY...even then it's a pretty cruel thing to do. I can't get back the 10 hours I dedicated to this piece of junk, let this be a cautionary tale.", "Date": "December 26, 2013"}, {"Title": "Horrible Customer Service", "Author": "ROBERT", "ReviewID": "R1Z6B075S4TKTB", "Overall": "1.0", "Content": "Product had a very small blemish on the screen which turned into a completely cracked display.  Have been fighting with TabletExpress on getting the product warrantied and I cannot even get through the process of where to send the tablet!  The customer service reps do not speak clear english.  You have to repeat everything to them several times and they just read a script to you which goes in circles and never can get them to tell you where to mail the product back to warranty it.This product is 2 months old... Will never buy from TabletExpress again.  At this point it is still unresolved as of the date of this rating.  I am currently sending emails and have yet to get a response from their customer service department.", "Date": "February 3, 2014"}, {"Title": "Total Christmas killer", "Author": "Ron Coleman", "ReviewID": "R3G7ODW1UFZ4X5", "Overall": "1.0", "Content": "Oh my...can't believe items of this low quality are allowed on Amazon. Purchased for grand sons and watched as my son spent hour upon hour trying to get it to work properly. Not just one tablet, but 2 tablets for 2 grand children. Both just total junk. Sad, just sad... DO NOT BUY", "Date": "December 27, 2013"}, {"Title": "Good tablet with bad speakers", "Author": "Cheryl Lovell", "ReviewID": "RMOBWPQHPD46O", "Overall": "4.0", "Content": "I really like this tablet.  I didn't give it 5 stars because the speaker is not loud enough.  You have to use earphones with it if you want to use it. I don't listen to music on it, so its not a big deal for me.  Its a good tablet for a good price.", "Date": "December 15, 2013"}, {"Title": "Defected Tablet", "Author": "Lammone Bouahom", "ReviewID": "R25YOH161670I7", "Overall": "1.0", "Content": "The second day i had it the screen just went blank on me. Like clear white i could hear stuff but it just went blank. so now i'm trying to figure out how to fix it our get it replaced i'm so MAD.", "Date": "December 12, 2013"}, {"Title": "No braggin' about the Dragon", "Author": "G. Blake", "ReviewID": "RYE8AMP0J49OJ", "Overall": "5.0", "Content": "Love the tablet so much I got one for my wife. It's better than the first one I got for her. It was a Visual Land. That one punked out within a month and after sending it back to manufacturer for repair or replacement it went out again. Dragon Touch is a good buy and a good tablet. Very happy with my purchase.", "Date": "April 29, 2014"}, {"Title": "Works Well", "Author": "Deb Dickinson", "ReviewID": "RE8UAURAGGAIN", "Overall": "4.0", "Content": "Xmas present for Son. 1st one just wouldn't work with our router. So I sent it back, and they said the Wi-Fi was working but when I insisted it wasn't they kindly sent another. Same problem with the 2nd, except I then realized it worked fine with my neighbors Wi-Fi & then the coffee shop's too! So I changed the frequency channel on my router & low & behold, the tablet picked it up just fine! So I think the problem was my router the whole time.Anyway, it works great (as you can expect for a $100 tablet). And Kudos to TabletExpress for their prompt customer service, & no argument return, even though the 1st tablet was fine!", "Date": "February 21, 2014"}, {"Title": "Works Great For RVing", "Author": "steve warford", "ReviewID": "R18Y6FVYEVLSMV", "Overall": "5.0", "Content": "I'am retired and do a lot of camping mainly in the national forest campgrounds so i don't have wifi ,I have to go to restaurants where there is free wifi and it's so much easier to carry this tablet then a big cumbersome laptop  It's also the first android system I've had  and I really like it .", "Date": "January 8, 2014"}, {"Title": "Awesome!!", "Author": "Kendall Adams \"kendall adams\"", "ReviewID": "R2DT0ZSQZ7UKKE", "Overall": "5.0", "Content": "I'm using it right now :)  I would recommend this for a gift or for yourself, I bought the purple one for myself and I haven't put it down for hours. Its great you can download so much stuff on it. You'll never get bored with this. I only with the camera was better but other than that its awesome and came before expected! I love this tablet and good for the price.", "Date": "November 1, 2013"}, {"Title": "cheap /not worth it", "Author": "John Weeks", "ReviewID": "R3GG6IVAC7U1ZZ", "Overall": "1.0", "Content": "I'm actually writing this review on the tablet and it is barley working.. save  your money. You get what you pay for I guess. Nothing works rightg", "Date": "February 1, 2014"}, {"Title": "nice, but crap", "Author": "billy shedd", "ReviewID": "R2EUR2N6MEZLE7", "Overall": "1.0", "Content": "Was nice at first.  But now won't power on anymore. Dose not help that getting a hold of the manufacturer is a pain as well I would spend a little more for something better", "Date": "April 10, 2014"}, {"Title": "Clunky and cheap", "Author": "Laura I.", "ReviewID": "RJG4USA4HKOAC", "Overall": "1.0", "Content": "The first time we fired this up (after the 10 hours it needed to charge) there were white lines and \"static\" all over the screen.  The auto rotate on the screen is extremely sensitive and flips 20 times when just trying to get to one application.  Very inconsistent screen touch response, sent it back ASAP.", "Date": "February 27, 2014"}, {"Title": "Horrible", "Author": "Tiffany", "ReviewID": "R1P20DOV70EAZF", "Overall": "1.0", "Content": "It shuts off all the time and wont turn back on. It dies with in minutes. I ordered two at the same time and the other one is just fine.", "Date": "February 2, 2014"}, {"Title": "Great product for", "Author": "N. Walker \"N. Walker\"", "ReviewID": "R21EY7DK4H0BFG", "Overall": "5.0", "Content": "For the price it's a great starter tablet forMy 10 year old son. He loves it and it works great!! The sound is awesome!", "Date": "February 1, 2014"}, {"Title": "Not working", "Author": "Veronica West", "ReviewID": "R35E9VK3TVZMJ4", "Overall": "2.0", "Content": "Haven't been able to use it. Called on it quite a few times. Won't connect to wifi on the computer. Really disappointed.", "Date": "January 16, 2014"}, {"Title": "tablet", "Author": "Jane Slater", "ReviewID": "R2C936BK486PGE", "Overall": "5.0", "Content": "it was what I wanted it was for christmas it will be enjoyed for what the boys wanted very pleased", "Date": "December 14, 2013"}, {"Title": "Poorly Designed", "Author": "Amazon Customer", "ReviewID": "RPD81RJSW1OYM", "Overall": "1.0", "Content": "Both of my children received this tablet as a gift for Christmas this year.  We immediately had problems with connecting to our network (one would, the other wouldn't, AND THEN visa versa).  When we could get one to connect to our network it took HOURS to download the educational apps that we wanted.  The last straw was when one of the power buttons got stuck pushed in.  My husband had to take it apart only to have the button fall apart completely.  I would not recommend this tablet to anyone.  Cheaply made, poorly designed.", "Date": "January 9, 2014"}, {"Title": "Two tablets, one upset child.", "Author": "Ken kimmerly", "ReviewID": "R2BD3G4S824XM5", "Overall": "1.0", "Content": "I bought two tablets. One for my son and one for my daughter.  They opened then Christmas Day, we left for a two week vacation on the 26th out of country, returning today.  Only one tablet will work. I have yet to contact anyone, however I am assuming it will be far from a cake walk. I'm livid.  Seriously, I realize they are cheap. We have high end products for our personal use, but think they are a bit much for a 10 and 9 year old....but really two weeks? That's ridiculous. Did they send out a bad batch? Because when I originally bought them the rating sing and comments were not nearly as bad as they have been after Christmas!", "Date": "January 8, 2014"}, {"Title": "Don't waste your money", "Author": "Lori Rivera", "ReviewID": "R1K5BGKRBK3P3W", "Overall": "1.0", "Content": "I bought three of these tablets for my children. As soon as they began downloading games and music, the screen went dark and error messages popped up. The operating system would not even launch. Two of the three are in this error mode. All three are being returned.", "Date": "December 10, 2013"}, {"Title": "Very Disappointed.", "Author": "Kim J Bucher-Tyo", "ReviewID": "R3RX68OEZSDUJ7", "Overall": "1.0", "Content": "Bought three of them for our Grandchildren for Christmas.  I charged all of them for the full 10 hours that was recommended before I gave them to them.  One would not turn on at all.  The second would not turn on after the first week of use.  The third is still working, but who knows for how long.  Not overly optimistic.  I loved the color choices", "Date": "January 10, 2014"}, {"Title": "Dragon touch 7 in tablet", "Author": "phoenixblu69", "ReviewID": "R3MM0P2PTCSOU5", "Overall": "3.0", "Content": "I like it but it freezes up often. It sometimes has to be restarted. I haven't found any other issues.", "Date": "December 6, 2013"}, {"Title": "Dragon Touch® 7'' Blue Dual Core Y88 Google Android 4.1 Tablet PC, Dual Camera, HD 1024x600, Google Play Pre-load, HDMI, 4GB 3D", "Author": "Francesco", "ReviewID": "R1DMQSSH770U8M", "Overall": "5.0", "Content": "When I first received my package there was a lot of movement inside the box so when I received it it was damaged and my sound of the tablet it went bad.  But that's not only thing that I'm not upset with the tablet works just fine like I said before the sound just started to go bad there was no damage on the screen or anywhere on the tablet but I still give five stars for this item.  But I will show you how the sound on this time and I will do it later on for right now I am trying to figure out how to make a video to show you what I am referring to and also the tablet works very fast which I am very happy with.  I was talking to Amazon.com they were very nice to help me to figure out what the problem is I explained to them what the problem is and they already tell me what to do to send it back to give me a replacement and they were very understandable people her name was \"Jessica \"and I'm very happy with the she saw the problem right away.  Like I said before I will give it five stars but if there was more stars I would give it at least 10 stars for this item and also I have three of them and that's why I would like to know how to fix this problem and they did it right there in the spot was talking to her and she solved it right away to make me happy.", "Date": "May 31, 2014"}, {"Title": "Dragon Touch 7\" Tablet", "Author": "Jb1055", "ReviewID": "R3Q8IP6CMCULKO", "Overall": "5.0", "Content": "It works great. I compared this product with other brands and I feel I got the best deal for the money. I wouldseriously recommend this to my friends.", "Date": "April 29, 2014"}, {"Title": "Don't buy", "Author": "Thomas", "ReviewID": "R3NVZ16P6TQ25T", "Overall": "2.0", "Content": "Not a good product read the reviews an it was positive reviews so I thought I would by one. The thing crashes. Can't play clash of clans. All its really good for is youtube but even then the speaker is low quality.", "Date": "April 11, 2014"}, {"Title": "unbelievably poor product, appalling customer support", "Author": "stephanie", "ReviewID": "R1NRHS4VXC1QBA", "Overall": "1.0", "Content": "I ordered this tablet in December as a Christmas gift for my daughter. Upon arrival, the tablet charged and powered on. However, after the initial charge wore down, we were unable to charge it again. After several attempts at contacting the seller, I escalated to the amazon a to z guarantee. The seller then informed me that they would send me a return shipping label to return the defective tablet and receive a replacement. I never received the label, or even an address. I again contacted amazon, who then informed me that the seller wouldn't replace the item because the defective product hadn't been returned (this is despite the fact that I had no address to return it to, even at my own expense). I have since replaced the item with an XO tablet (which I would recommend to anyone looking for a tablet for their child). DO NOT PURCHASE THIS ITEM.", "Date": "March 25, 2014"}, {"Title": "It quit working after 1 day of use", "Author": "Enligh10dwon", "ReviewID": "RSIW482XHP74K", "Overall": "1.0", "Content": "The screen became unresponsive after 1 day of use. I cannot unlock it at all...Returning for a refund and will purchase from a more reliable brand.", "Date": "March 13, 2014"}, {"Title": "Don't buy!!!!", "Author": "Tephenie Harp", "ReviewID": "R2OLOJQ8H1M64V", "Overall": "1.0", "Content": "I will never buy from them again! I only had it a week and the screen cracked and the touch won't work. Nothing at all happened to it either. I tried to message the company and they will not respond back!", "Date": "March 11, 2014"}, {"Title": "If I could give this a ZERO, I would", "Author": "Me \"babybella\"", "ReviewID": "R2JBD8V0Q93DH2", "Overall": "1.0", "Content": "I bought three of these tablets (pink, purple and blue) for my kids for Christmas. My son's screen broke within 3 days. Granted, he probably threw it or something, but he's played with my Kindle Fire for over a year without damaging it in any way. Within another couple of weeks, the power button on the pink one got stuck and the tablet cannot be turned on at all. We thought maybe she had done something wrong because she is young. But like my son, she has played with my Kindle for some time without ever causing any damage. Within a month after that, the purple one did the same thing. This happening made it clear to me that the product is the problem. My oldest child is 8 and knows how to handle and take care of tablets. She has been playing with my Kindle since I bought it 2 or 3 years ago. So now I have three useless tablets that I paid almost $80 a piece for. I am also giving 1 star for customer service. We contacted Amazon about returning the tablets (pink and purple only because we aren't 100% sure that our son didn't do the damage). They authorized a return for one, but not the other claiming it was out of the 30 day return period. Well, duh. Of course it is. We bought these for Christmas presents and did not wait until the last minute to buy so 30 days pretty much passed before my kids laid hands on the things. Frankly, if you're going to sell crap, you should be prepared to refund money for crap. I don't want to replace crap with more crap. I want my money back so I can buy something worth my money. I will never buy from this seller again. I do not recommend purchasing this tablet or anything else from Tablet Express.", "Date": "March 11, 2014"}, {"Title": "disappointed", "Author": "Jennifer Bliss", "ReviewID": "R33RXBTF9PE9QG", "Overall": "2.0", "Content": "i got the dragon touch green for a gift i liked it but the sound is way to low the camera takes fuzzy pictures and after a couple of weeks the screen cracked it got hot fast alot now i cant use it i had it in a case to protect it . i dont have the money to get another one .", "Date": "March 9, 2014"}, {"Title": "Defective product.", "Author": "Nana619", "ReviewID": "R49QEKFAGCXFR", "Overall": "1.0", "Content": "The tablet continually overheats and shuts down. Also would not accept a sd card to allow for more memory to try to solve problem.", "Date": "January 1, 2014"}, {"Title": "Disapppointing", "Author": "Darlene Knowles", "ReviewID": "R3U51VM16EY71L", "Overall": "1.0", "Content": "I bought this for a Christmas present. The tablet barely made it through setting it up before it quit working. Very disappointing.I would not recomend this product", "Date": "January 1, 2014"}, {"Title": "good tablet", "Author": "Carlotta Mitchell", "ReviewID": "R1ADS9ZDIJVT6B", "Overall": "4.0", "Content": "i like this tablet and so far it works good...still learning everything....i am having a little trouble trying to uninstall a game but that is no biggie", "Date": "December 28, 2013"}, {"Title": "given as gift", "Author": "Melanie", "ReviewID": "R33B0HOFJQHNHA", "Overall": "5.0", "Content": "Exceeded my expectations. My grandson is loving it . I would recommend this device to anyone looking for a functional tablet.", "Date": "December 28, 2013"}, {"Title": "Good so far/", "Author": "Ronald Coleman", "ReviewID": "R2WS1YTK2TSI94", "Overall": "3.0", "Content": "No problems to report yet.Only had it since Christmas Day but will let you know again in about two months", "Date": "December 28, 2013"}, {"Title": "Horrible experience.", "Author": "Tara Greenough", "ReviewID": "R1YQ4X6H3JPMC", "Overall": "1.0", "Content": "I had bought this tablet for Christmas for my daughter, when I received the tablet the screen was scratched all over and the camera was cracked.  Had to send it back and make a dash to the store to buy her a new one, very disappointed that they do not check there products before shipping.  I am sending it back for a full refund.", "Date": "December 27, 2013"}, {"Title": "something wrong with the power button or charger connector.", "Author": "Stone", "ReviewID": "R2H8H9UI2MWW7I", "Overall": "2.0", "Content": "Doesn't turn on easily. to turn on, i have to spend about 5 minutes mashing the button, or plugging in the charger and headphones, then hold power for 20 seconds, then wait, then hold power for 5 seconds. or .....", "Date": "December 27, 2013"}, {"Title": "Great for kids", "Author": "Toni-Ann Clarke", "ReviewID": "R3PM9T5YTRS3E6", "Overall": "4.0", "Content": "For the price its nice. The volume button got stuck which is irritating ofcourse but the tablet on its own is perfect for my 13 year old little brother.", "Date": "December 26, 2013"}, {"Title": "Cheap", "Author": "Lawrence Evans", "ReviewID": "R28GY2HPWF7937", "Overall": "1.0", "Content": "Bought two of them for my granddaughter for Christmas….Returned them on the 26th.  Both item had serious screen problems (bubbles, lines) and slow.", "Date": "December 26, 2013"}, {"Title": "Pros and Cons", "Author": "jeremy", "ReviewID": "R3BT7MV1R86786", "Overall": "3.0", "Content": "ProThe internet surfing speed and response is good.  Doesn't seem to have any problems loading apps or playing applications.  HD display during movies, so far, that i can see.  Charges quickly and seems to hold good so far but may be because the screen is so poorly lit.  Good tablet for children as it is inexpensive if it gets broken.  Front and Rear cameras are an expensive addition in name brand tablets and included in this tabletConsI will compare this tablet to the kindle fire hd.  When I purchased it i looked for similar characteristics.  The 1280x600 hd display is what sold me and was expecting similar quality screen to kindle.  This tablets screen, i would be surprised if it was truly 1280x600 hd from a quality control stand point.  In the same note, the front/back cameras seem to take equal quality pictures, yet the back camera is rated at 4 times the picture quality.  The picture is maybe half the quality as a kindle fire hd.  This tablets picture seems to be recessed into the tablet so the pictures cannot be seen clearly except for straight on and is very low lit.  Frustrating for anyone who has used a kindle as there screen seems to display right at the surface and withvery viberant.  You will need to buy speakers of some kind for this tablet.  This tablet 85 compared to kindle fire hd with camera at 140 used or 200-225 new.  Save for the kindle unless youre like me and buying several for kids as that can get expensive. Dolby surround and precise picture at all angles is worth the extra 75 bucks and you will have to buy 20 bucks worth of speakers anyway.  Don't buy this if you are an adult.  You will not be satisfied.", "Date": "December 25, 2013"}, {"Title": "Doesn't charge right and screen is broke!", "Author": "Miriah Clark", "ReviewID": "R4C1312819OCM", "Overall": "1.0", "Content": "We just opened this tablet for our daughter and tried charging it to have it ready for her on Christmas morning.  The tablet does not want to charge or even show that is on a charger, plus there are lines running down the screen and everything is blurry.  Should not have bought this tablet!!", "Date": "December 24, 2013"}, {"Title": "Cheap device, came defective upon delivery.", "Author": "Michael Ocasio", "ReviewID": "R2DAHZNC3I2POD", "Overall": "1.0", "Content": "My girlfriend and I were looking up a decent starter tablet device for our daughter for some educational usage, child games and video usage for low cost. I've read mixed reviews on this and was very concerned about a lot of the negative reviews but decided to give the product a chance.As always Amazon has amazing fast delivery, product came within 2 days.When opening the packaging the first thing I noticed were a few scratches on the cameras. It appears as if this may have been either poorly put together or simply refurbished and sold as new. Knowing that this device wasn't the top of the line android I fully expected the performance to not be amazing. The casing seems to be very cheap plastic and the screen is flimsy and weak feeling. The size of the device was perfect and the carrying case that we purchased with it looked great initially. After charging the device for a full 10 hours the battery life seemed to die pretty quickly with no apps running while navigating through the menus. During usage I began to smell burning plastic possibly internally of the device. After powering off the device because of this, the device turned on its own with no user interaction, possibly a bad chip set or power button? After shutting it down again and letting it cool off I turned it back on and tried to connect to my wireless network. This device was unable to connect to my home WIFI and my Galaxy S4 in tethering mode. I tried to connect also to an open network in my neighborhood but the device was unable to pull an IP address. To me that immediately indicated this device has a faulty wireless chip. I decided to turn to the web to see others reviews on this product which were also very similar in negative feedback. One major red flag I saw after looking through the included documentation it states on a few small cut sheets of paper. \"Please follow the steps if you have any difficulty of powering on your tablet for the first time\" and has instructions on how to perform this. On a yellow sheet of paper with big bold red letters \"CALL US BEFORE YOU CONSIDER RETURNING THIS PRODUCT\", that pretty much tells me they've had issues with their devices and have included this in the documents. Not a good sign for a consumer on unboxing. The last piece of instructions \" How to make tablet run faster and last longer?\", instructs the user to search app killer in the play store to save on battery life and cpu usage, almost as if they advertise a fast processor but have doubts on its performance.Overall I understand that this was a cheap product, you basically get what you pay for but I at least hoped it would work out of the box from the start. I'll probably never buy a product from this company again. Amazon did fulfill our return immediately, off to get the Galaxy Kids edition tablet now.", "Date": "December 24, 2013"}, {"Title": "I got the tablet the morning and by two hours time the screen stopped work and there were silver lines jumping all over the scre", "Author": "Dominique Seetal", "ReviewID": "R1O1QXGVEA2MWC", "Overall": "1.0", "Content": "they are colourful and look very nice but they donot work or last long,i'm really disappointed because now I have to find my son a new christmas gift", "Date": "December 24, 2013"}, {"Title": "Good return policy.", "Author": "weston benton", "ReviewID": "RN30XG48L519E", "Overall": "1.0", "Content": "I ordered two of these tablets and I charged them for 18 hours as the instructions indicate. One of them never would turn on and I thought I may have just got a defective unit. The second unit turned on once and was used for a couple hours until the battery was low then charged overnight. The next day after work I tried to use the second tablet and it would not turn on. After trying for several days to get it to work I sent both back for a refund.", "Date": "December 24, 2013"}, {"Title": "very unsatisfied", "Author": "rhea windhorst", "ReviewID": "R3MXNBI2KN3CHH", "Overall": "1.0", "Content": "It doesnt workCant play games on it..screen went white with lines through it.returning very unsatisfied not happy with it at all.", "Date": "December 23, 2013"}, {"Title": "Seem good", "Author": "Jessie", "ReviewID": "R1IEXNICO63R7U", "Overall": "3.0", "Content": "Due to not being able to contact seller about the accessories not being with it, I will be returning it. My son got to play on it for awhile then we noticed the charger missing, and it does not charge with the normal usb cords. The only  thing that was in the box was the tablet. I was hoping just to be able to contact them so they could send a new charger bc my son seemed to enjoy the tablet. Hes six and this was an early christmas gift.We also have samsung tab 3, this does not go as fast but good for a six year old.", "Date": "December 19, 2013"}, {"Title": "Dragon Touch Y88", "Author": "William B.", "ReviewID": "R3AAIXGHGX6UYC", "Overall": "4.0", "Content": "Decent tablet for the price, had to return first one due to battery issue, but the replacement ran 3 hours downloading and web surfing before it reached 30% low battery level...As the documentation states you need to install a app killer and it makes all the difference it battery length......I like it.....", "Date": "December 19, 2013"}, {"Title": "android tablet", "Author": "Gwen", "ReviewID": "RD6V2RIRCMWUH", "Overall": "5.0", "Content": "I finally received my tablet and I love it. It goes just about everywhere I go. I will be getting one for my neice in the near future.", "Date": "December 16, 2013"}, {"Title": "I think they will love them", "Author": "Denise Betanzos", "ReviewID": "R3UY5QORBKNILC", "Overall": "5.0", "Content": "The delivery was made before the time stated, this was bought for all the grandkids and for the age group it is perfect, I am very pleased with all of them. I ordered 6 in total.", "Date": "December 10, 2013"}, {"Title": "Good product", "Author": "Zulema", "ReviewID": "RHLD7H3K5HI6I", "Overall": "4.0", "Content": "I was for my six year old son, I thought I was stronger tablet, but good product, fulfilled my expectations.", "Date": "December 9, 2013"}, {"Title": "One cracked a tiny bit and stopped working.", "Author": "Jessica", "ReviewID": "R2WTDM8BAZBQWM", "Overall": "3.0", "Content": "I bought three of these for my children. In all, they were great, but I had set one tablet on the couch, and in fell on my hardwood floors, it had one tiny crack on the bottom right and it stopped working. In all it's a great buy but make sure you have a tablet cover for it because one drop and it's gone. They came on time and the packaging was great... I will be buying again from this company.", "Date": "June 6, 2014"}, {"Title": "Don't bother even buying", "Author": "AccdntL1.Einstein", "ReviewID": "R3VZ7DTB55T54R", "Overall": "1.0", "Content": "this thing isn't even worth the cheap plastic that it's made out of and runs just as horrible to. Definitely not worth the money I wasted on it", "Date": "June 6, 2014"}, {"Title": "Sad", "Author": "Djbob", "ReviewID": "RMD65LVGXFY8", "Overall": "1.0", "Content": "Right after the deadline they both went kerplunck I'm am out of almost 250.00 my daughters are upset as I brought these for gifts, usually you have at least 90 days to return.", "Date": "June 5, 2014"}, {"Title": "Wish I hadn't bought it!", "Author": "Patty", "ReviewID": "RUNHR0249AO0J", "Overall": "1.0", "Content": "I'm sorry I ever bought this tablet. I can't get the camera to connect and it won't charge properly. I will never buy another one of these tablets.", "Date": "June 4, 2014"}, {"Title": "Worth it!", "Author": "Dizzy", "ReviewID": "R3OQEDGF85B2SP", "Overall": "4.0", "Content": "I purchased this in pink at christmas time for my daughter.  It's too slow for my regular internet use but it's perfect for a kid who's just going to play games and watch videos.It's lightweight, runs fine, and is perfect for long car rides.My only real complaint (and it's not much of a complaint because of the price) is the battery life.  I wish it would hold a charge longer when in use but it does last for a good 4 hours in that situation.The reason I ended up purchasing this one is because my friend bought her son a Nabi for $200 and it was all kinds of problems and they returned it.  So she had me order this.-Definitely get a micro SD as this doesn't have a large memory.-a case, is a really good idea because the back of this is thin plastic.-keep a charger aroundbut for the price it cant be beat.", "Date": "June 3, 2014"}, {"Title": "Good product", "Author": "Janeen Herren", "ReviewID": "R3VB4YZQBP8PGB", "Overall": "4.0", "Content": "I love my tablet. My chord is sparking and not sure why that is doing it for some reason, however, it is still a great tablet.", "Date": "June 1, 2014"}, {"Title": "awesome!", "Author": "Rene Maxfield", "ReviewID": "R3SUD3PU63W4AM", "Overall": "5.0", "Content": "Very good value. like the dual cameras and the hookup to my 32in. hidef tv.and the direct download of my music files.", "Date": "June 1, 2014"}, {"Title": "Don't buy this product.", "Author": "Johnny", "ReviewID": "R2P41KMAEQLYHO", "Overall": "1.0", "Content": "I ordered this item and got it a few days later. It was supposed to be brand new but it was everything other than that. The screen was slightly blurry and it was really slow. I went to use it 13 hours later after charging it and it wouldn't start up. You get less than you pay for. I went to walmart and bought a netbook for 30 dollars and haven't had a problem yet. Clear screen and faster.", "Date": "May 31, 2014"}, {"Title": "a good andrion the dragon touch !", "Author": "Rosalina C Jones", "ReviewID": "R23A40N758VFY0", "Overall": "5.0", "Content": "i in joy playing my game on it but same time i have trouble loading a game,but other then that it work great .i would tell any person that would asks me about dragon i would tell them where i got from and for the price it works petty good.", "Date": "May 30, 2014"}, {"Title": "HORRIBLE!!!", "Author": "Nora Hicks", "ReviewID": "R2GNDI0HQVNJDG", "Overall": "1.0", "Content": "I do not recommend this tablet AT ALL!!! There is NO customer support for them. I bought two (one for each of my daughters), one broke (which was an accident) and the other locked itself. I have been all over the net looking for a way to reset it with no luck... Perhaps if there were support for them I would have given it a higher rating, sadly that is not the case.", "Date": "May 29, 2014"}, {"Title": "THE WORST!!!", "Author": "Nora Hicks", "ReviewID": "R3GB3GJOOHDV2L", "Overall": "1.0", "Content": "I do not recommend this tablet AT ALL!!! There is NO customer support for them. I bought two (one for each of my daughters), one broke (which was an accident) and the other locked itself. I have been all over the net looking for a way to reset it with no luck... Perhaps if there were support for them I would have given it a higher rating, sadly that is not the case.", "Date": "May 29, 2014"}, {"Title": "Not good", "Author": "TaBetha Smith", "ReviewID": "R3HDKVFYZUMJ8I", "Overall": "1.0", "Content": "We bought this for our daughter to have so she can do her home work on. Not a good product. Camera will not work, won't hold a charge, and gets to hot when charging. We are going to find her a different tablet and let her smash this one in the road.", "Date": "May 28, 2014"}, {"Title": "For the kids", "Author": "George Liermann", "ReviewID": "R3JWBFI0ZTZ8D6", "Overall": "4.0", "Content": "for the Price they work great.  13 year old son loves it.  I would suggest an SD card to increase the memory and screen protectors as the screen gets scratched up.  But it keeps the son busy and he was even doing some homework on it.", "Date": "May 28, 2014"}, {"Title": "good for kids", "Author": "ashley grove", "ReviewID": "RFEE6Y27MDKKC", "Overall": "4.0", "Content": "Excellant kids tablet my son loves it. Dont really like that there isnt much storage and cant figure out how to move things to the sd card", "Date": "May 27, 2014"}, {"Title": "Dragon Touch", "Author": "Zettie", "ReviewID": "R1BRACNOY1UZL8", "Overall": "5.0", "Content": "I purchased this Android tablet for my grandson he seems to like it very much I have heard no regrets and it has GOOGLE PLAY.", "Date": "May 22, 2014"}, {"Title": "Excellent tablet for the price!", "Author": "Matthew Shea", "ReviewID": "R34CU9OAEG3MR2", "Overall": "4.0", "Content": "I purchased this for my 13 month old son. I can't keep him away from me when I'm trying to work on my laptop or tablet so this a nice alternative rather then constantly telling him \"no\". I has decent battery life around 4 hours if he watches back to back movies. Its durable enough so far that he hasn't broken it and he rough on it because he is only 13 months old. We've had the tablet for about 2 months and it serves well for him. He still likes my iPad and laptop because the screens are so much brighter but this has made car rides and many other situations so much easier. It's a great low cost piece of technology and I do recommend the case even though I only gave it two stars. This would have been broke with the case. It is made of thin plastic and low end glass on the display.", "Date": "May 19, 2014"}, {"Title": "dont do it", "Author": "Mommy of Two \"Mommy of two\"", "ReviewID": "R260N0E8I8YRPL", "Overall": "1.0", "Content": "horrible. touch screen freezes . inherant problem with device and company refuses to fix it replace. never again  only offered for me to prochase new screen... really you sell me crap and then demand i pay to fix it????", "Date": "May 19, 2014"}, {"Title": "Tablet", "Author": "Miguel Fajardo", "ReviewID": "RT2OTAS1IVVX8", "Overall": "5.0", "Content": "Very good seller good product and I recommend it 100% to the community, an excellent tablet for easy handling and gameplay. regards", "Date": "May 19, 2014"}, {"Title": "Dragon Touch 7\"", "Author": "tamu", "ReviewID": "RVHIN7D9DNRVF", "Overall": "3.0", "Content": "Was given one a year ago.  Worked for a while then  went blank. Haven't use this one yet.  Its for one of my grandchildren who will use it this summer.", "Date": "May 18, 2014"}, {"Title": "Dragon Touch 7\" Tablet", "Author": "John C. Chirila", "ReviewID": "RWDMK62T3WCI2", "Overall": "5.0", "Content": "The Dragon Touch 7\" Google Android Tablet works great. Color display is good and the tablet is easy to use. Plenty of 3D color games preloade.", "Date": "May 17, 2014"}, {"Title": "works great", "Author": "Cathy lemen", "ReviewID": "RGJ3RYQXISURK", "Overall": "5.0", "Content": "I bought this for my daughter when she got her tax return & so far she loves it. Works well & is portable.", "Date": "April 24, 2014"}, {"Title": "I like it", "Author": "ramon gonzalez", "ReviewID": "RS7EAVR9YRDIK", "Overall": "4.0", "Content": "very good product", "Date": "April 23, 2014"}, {"Title": "PIECE OF CRAP", "Author": "Kim Elaine Gorak", "ReviewID": "RDI1XWSMDU73K", "Overall": "1.0", "Content": "It really is a piece of crap. I got this for a 9 year old. This is her third... The first two were problem zeepads so i thought I would try this one. BOY IS THIS A PIECE OF CRAP. It constantly restarts its self. It goes to black screen. WE have restored it at least 50 times thinking it would help whatever problem was wrong with it. NO LUCK. The whole thing is terrible. I would not waste a dime on it.", "Date": "April 23, 2014"}, {"Title": "JUNK", "Author": "Brian Kindzierski", "ReviewID": "R3CAT3L3MHEKKV", "Overall": "1.0", "Content": "This tablet took forever to do any simple iOS operation. ANY click took well into 3-5 seconds, which in computer land is an eternity. Kids games took ALL of the memory and had to be cleared to re-load app games. the machine was lethargic and unresponsive no matter what action you wanted to. DO NOT BUY.", "Date": "April 23, 2014"}, {"Title": "I love it. It's my first tablet", "Author": "A. Parson \"Blipsgirl\"", "ReviewID": "R1SDG4VF9ECIM2", "Overall": "4.0", "Content": "It fits in my pocket. The picture resolution has room for improvement. But overall, I love it. It's my first tablet.", "Date": "April 18, 2014"}, {"Title": "Good if you don't have sensitive eyes", "Author": "Sarah Timmons", "ReviewID": "R2ADKB40785GVD", "Overall": "2.0", "Content": "the resolution on the screen is poor which causes headaches for me, I could only look at the screen for maybe 5 minutes before getting a headache.", "Date": "April 17, 2014"}, {"Title": "Dragon touch", "Author": "Rebecca Acuna", "ReviewID": "R1HVU6HCMVOZGW", "Overall": "1.0", "Content": "I really don't like this tablet at all. I bought it for my son. He has had it for 4 months and has not been able to use it. It turns off every time he tries to use it. It's been nothing but trouble since we got it. I guess it's true you get what you pay for.", "Date": "April 12, 2014"}, {"Title": "Okay for kids...", "Author": "Anastasia", "ReviewID": "RCHJT4VQY4KYL", "Overall": "3.0", "Content": "I bought this and a pink one for my daughter for Christmas. The chargers dont fit well, the battery life is inaccurately represented and the graphics are not as nice as shown in the pictures. I am just glad they were for my children to play around on and not myself. Not worth the price.", "Date": "April 11, 2014"}, {"Title": "you really get what you pay for :(", "Author": "Heather Stout", "ReviewID": "R3EVQSB9WG21ZE", "Overall": "1.0", "Content": "I purchased a few of these for my kids. They shut off during play, it wont recognize passwords, the on/off button dont work", "Date": "April 11, 2014"}, {"Title": "Is a product requerid very fine its a good very very fine i like to much", "Author": "Henry Landino", "ReviewID": "R116SG81L83V0H", "Overall": "3.0", "Content": "Is a product requerid very fine its a good very very fine i like to muchIs a product requerid very fine its a good very very fine i like to much", "Date": "April 8, 2014"}, {"Title": "the tablet", "Author": "Maglis Romero", "ReviewID": "R1OJ0SRPX156RX", "Overall": "5.0", "Content": "My child enjoys the tablet. It is friendly. The delivery was in time and all was ok.We recommend this product", "Date": "April 7, 2014"}, {"Title": "1 Month Later - It's already broke", "Author": "cherilyn", "ReviewID": "R3VR6XFX8TZVJY", "Overall": "2.0", "Content": "It won't turn on anymore.  Waste of my money.  Keep your money and save for something else that will work longer than a month.", "Date": "April 7, 2014"}, {"Title": "this is best place to buy online", "Author": "Daisy m wadehilario", "ReviewID": "R1ZKT76MD4EQMN", "Overall": "5.0", "Content": "I like the dragon touch. Use it all the time. My kids play game's on it on the go . And I chat with family friends with it.", "Date": "April 5, 2014"}, {"Title": "Fine for kids", "Author": "Melissa Koetke", "ReviewID": "R60D3M88YZPH3", "Overall": "3.0", "Content": "We've had this tablet for 3 months and my 8 yr old uses it a lot for watching shows on Netflix and playing games.  The camera is worthless, the resolution is horrible.  The touch screen isn't very sensitive but gets the job done and picture is so so.  My one major complaint is it just doesn't charge very well.  The pin from the charger it came with doesn't go all the way into the tablet and has to be jiggled around to just the right spot.  Same if charging using a USB cable.  Sometimes it doesn't turn on and you just have to keep trying.  It's serving it's purpose and was cheap enough that if something happens to it, I'm not out $200 but don't expect anything like you'd want as an adult user. Tempted to buy another Kindle Fire HDX since I feel I definitely got my money's worth and the kids always want to use mine anyway.", "Date": "April 4, 2014"}, {"Title": "hmmm", "Author": "Elle", "ReviewID": "R1OQ3PSR7AJ3", "Overall": "3.0", "Content": "great system but i did not get purple like i asked i got black instead. little disappointed about that. they did get it to me in time though.", "Date": "April 3, 2014"}, {"Title": "touch screen not easy", "Author": "kindle reader 2013", "ReviewID": "R1LMHTLEZ2IM39", "Overall": "3.0", "Content": "Sometimes its hard to tap the screen, it either doesn't sense your touch or you have to have a certain angles", "Date": "March 31, 2014"}, {"Title": "Very Disappointed!", "Author": "Amazon Customer", "ReviewID": "R3B4SKUPBAXEKU", "Overall": "1.0", "Content": "Item worked great the first few times my daughter used it, now the power button no longer works. Tablet is useless if it will not power up, this was her birthday present and she is pretty upset with it/me.", "Date": "March 30, 2014"}, {"Title": "Cheaply built", "Author": "Cnhaynes", "ReviewID": "R35M6HHUSPODI0", "Overall": "1.0", "Content": "This item lasted about 4 days before being destroyed by my 9 year old son. He fell asleep playing it and we guess he rolled around on top of it. The next morn my wife found it on his bed with a busted screen", "Date": "March 28, 2014"}, {"Title": "quality device", "Author": "M Murphy", "ReviewID": "R3CSFN1AXNG1ET", "Overall": "4.0", "Content": "We bought this for our twin 8 year olds to play games on.  They love it!  The Dragon touch works great and is just their size.", "Date": "March 28, 2014"}, {"Title": "Great Tablet!", "Author": "Robotica Industries", "ReviewID": "R3GXQQPC1UMLTH", "Overall": "5.0", "Content": "Works great for the price. I got this for my 15 year old daughter and she loves it. Perfect for the high school student because if they lose it your not out too much and it works just like the tab series.", "Date": "March 25, 2014"}, {"Title": "kinda lousy", "Author": "Amazon Customer", "ReviewID": "RAEO3AIBVA53F", "Overall": "3.0", "Content": "bought it for my niece. She doesn't like it. She gave it to her 2 year old daughter. Not a great buy", "Date": "March 24, 2014"}, {"Title": "still working", "Author": "paula", "ReviewID": "R3BXPVGCXZQVFC", "Overall": "4.0", "Content": "still working Great! Had since Christmas and its still going strong it was the 3rd one we bought, one from nomorerack that was a piece of poop, and another from Radio shack and that one was awful too and we paid too much money there. This one works great and for the price and year protection can't beat it.", "Date": "March 24, 2014"}, {"Title": "hard to get tablet to turn on", "Author": "William J Pfannenstiel", "ReviewID": "R3B0LWOY8LCDAZ", "Overall": "1.0", "Content": "I couldn't get the tablet to start the first time I tried to turn it on, so I plugged in overnight and then tried again.  Still wouldn't turn on so I put it aside plugged into power.  Went back to it later and it was on.  It was working normally except it was always tricky to turn on.  Every time I wanted to use it I seemed  to have trouble getting it started. I contacted Tablet Express by email and they had developed a fix for the operating system.  I had to buy a micro SD card to download the file too, and then insert into the tablet and restart tablet.Well guess what. I couldn't get the tablet to start up.  So I got back in touch with the Tablet Express person and was given a different file. I could now start the tablet but it wouldn't update itself.  So I was told to ship the tablet back and they would fix it.  I wrapped it in bubble wrap and shipped it in. I received an email back saying the tablet screen was broken and that it wouldn't be warranty.  They asked me how it had gotten broke. Well during the time I was emailing back and forth I was sending them pictures of the screen that I was seeing. There was no breaks in the screen.  So I feel like I got nothing for my first foray into the tablet world.Thanks Tablet Express for nothing! You got my money and I got your junk.", "Date": "March 23, 2014"}, {"Title": "not impressed....", "Author": "aubrinam", "ReviewID": "R1R0CI46V7T1E1", "Overall": "1.0", "Content": "I ordered this for my autistic daughter as advised by her doctor (to get a hand held device such as a tablet or iPad for the apps) And I pull the tablet out of the box to discover it will not even turn on! I figured it may need charging but after 16 hours of being on the charger it still would not turn on! All that happened was the charger got very hot and so did the tablet! I'm not happy to say the least!", "Date": "March 23, 2014"}, {"Title": "My son says it is just swell.", "Author": "Robert Scott \"Robert Scott\"", "ReviewID": "RHXJT1QIZAX4A", "Overall": "4.0", "Content": "I bought him this as a present after I was extremely unhappy with the \"Fast Touch\" I bought previously on Amazon for myself,  he reports that it does everything he wants with no problems.", "Date": "March 22, 2014"}, {"Title": "dont buy", "Author": "Arma", "ReviewID": "R35NS0XT2WEOZG", "Overall": "1.0", "Content": "I bought this tablet. the same day it drop & cracked the screen. now it wont charge. I would like a number so can call", "Date": "March 21, 2014"}, {"Title": "She likes it.", "Author": "Donnie Darko", "ReviewID": "R3DY9M6AH4X7DQ", "Overall": "5.0", "Content": "Was a gift for mom for Christmas. Can't afford an iPad for myself let alone to give to someone but Android is a great OS too. She uses it for facebook games and browsing simple sites so she didn't need a powerful tablet.", "Date": "March 21, 2014"}, {"Title": "I bought this for my daughter", "Author": "kristy norwood", "ReviewID": "R3DLI5M270K5P8", "Overall": "3.0", "Content": "it works pretty good my daughter loves it but the down side the battery dosnt last long and the picture quality sucks but it is great for a 12 yr old", "Date": "March 21, 2014"}, {"Title": "7\" Dragon Touch Tablet, also bought case cover with keyboard. It works Great, look forward to getting another.!!~~~~~", "Author": "Gary F Leon", "ReviewID": "R2TU0UYLQQL3BY", "Overall": "5.0", "Content": "Ordered this when my laptop crapped out... Everything they stated it would be, surprisingly works welll enough to order another for my Wife....  :)", "Date": "March 20, 2014"}, {"Title": "3 tablets, all had problems", "Author": "Amazon Customer", "ReviewID": "R2FULD8SNVRKTE", "Overall": "1.0", "Content": "One wouldn't accept an SD card...at all. All had areas of the screen that didn't respond well to touch. The volume was practically non-existent on all of them. Two of them we had used for 2 months and couldn't be returned. Luckily they ended up being dropped by kids and got cracked screens so they were covered under our square trade warranty. The third had the power button stop working just days before the end of the 30 days so we got a refund on that too.", "Date": "March 20, 2014"}, {"Title": "Get what you pay for", "Author": "Angie Gilmore", "ReviewID": "R3GYMNWYMJXBVQ", "Overall": "3.0", "Content": "Meh.I wanted a \"starter\" tablet for the kiddos. First one I received, the speakers didn't work straight out of the box. We did get a replacement that seems to be working so far. We have now had it for 3 months. Picture quality is poor. Battery drains fast. My daughters are lucky to get an hour of play at a time. The sound is also muffled and poor. I am still giving it three stars though as I knew when I bought it that I was buying a lower quality tablet. If your kids are begging for a tablet and you aren't sure if they are responsible enough to have one, this one is the perfect one to be able to find out. I do not recommend it for anybody high school aged or up though as the poor quality can be frustrating.", "Date": "March 13, 2014"}, {"Title": "nondurable", "Author": "Krystal Graham", "ReviewID": "R3H4RX7RVA4JHK", "Overall": "1.0", "Content": "Nondurable! I got these for my kids and as soon as they bump them the screens broke on them ! They aren't built to last at all!", "Date": "March 13, 2014"}, {"Title": "Disappointing purchases", "Author": "Noreen Glenn", "ReviewID": "RWSK11TO8DPJV", "Overall": "1.0", "Content": "Niether tablet isnt working properly and one isnt working at all poor choice on my behalf. Didnt recieve the earrings", "Date": "March 13, 2014"}, {"Title": "disappointed", "Author": "Brian Reames", "ReviewID": "R3G0LVNQK768Z9", "Overall": "1.0", "Content": "I am disappointed in this product it is clumsy and now it will not turn on at all. I would like to return it. B", "Date": "March 12, 2014"}, {"Title": "do not buy", "Author": "Dalia Rodriguez", "ReviewID": "R3P1GNU93PTR0U", "Overall": "1.0", "Content": "horrible. power button broke returned it and got another one and stopped working 3 days later. Had bought 2 for Christmas and both of them stopped working. Returned both! manufacture service reps are horrible no knowledge of anything and hard to understand their English.", "Date": "March 12, 2014"}, {"Title": "Tablet won't turn on at all", "Author": "Shakita M Vaughan", "ReviewID": "R6PXB1VVM0JHK", "Overall": "1.0", "Content": "Because now the tablet won't work. I can't even get it to turn on. I've only used it a handful of times prior to it not working.", "Date": "March 12, 2014"}, {"Title": "this company is disgusting", "Author": "JOYCELYN", "ReviewID": "R3B0KYVMG8WST9", "Overall": "2.0", "Content": "I bought this item for my Grandaughter and I sent to Toronto, Canada and up to date we cannot get it hook up, communication with these people,you all sucks.", "Date": "March 11, 2014"}, {"Title": "Not satisfied.", "Author": "Jason93535", "ReviewID": "RBSBYPWIUAFK9", "Overall": "1.0", "Content": "I bought this tablet for my brother this past christmas. No more than 30 days after i purchase it, it randomly shut off and never turned on again. NOT SATISFIED.", "Date": "March 10, 2014"}, {"Title": "good for kids", "Author": "Jason", "ReviewID": "R24DBUCMCE2U2M", "Overall": "3.0", "Content": "very nice and simple and works well for kids but i recommend that you get a protection plan. good luck", "Date": "March 9, 2014"}, {"Title": "Nice tablet for the price.", "Author": "Chris Craig", "ReviewID": "RAVMXWDQN3IG1", "Overall": "5.0", "Content": "I bought this tablet as a Christmas gift for my girlfriend niece she loved it. She's had it for three months now and hasn't had any issues with it.", "Date": "March 8, 2014"}, {"Title": "pretty good", "Author": "fernando macias", "ReviewID": "R1II3PE7WEV6Q3", "Overall": "4.0", "Content": "It is good just some freezing and bad batteryI've had it for about 8 weeks now and that's all", "Date": "March 6, 2014"}, {"Title": "mad", "Author": "Mrs.Toya", "ReviewID": "R2XIHZI285I6YD", "Overall": "1.0", "Content": "I chose a 1 rating because that's What it deserves. A waste of my money.  It's slow, I could be in front of the Wi-Fi and it would say \" no Wi-Fi connection\" like seriously this is a waste of money", "Date": "March 6, 2014"}, {"Title": "I highly recommend these tablets.", "Author": "katie jo Williams", "ReviewID": "R10E7QVJMV4L2F", "Overall": "5.0", "Content": "i have purchased a few of these tablets from this seller.  They are wonderful tablets and great for children.  They are fast and reliable, They are the very best tablets in their price range. The only issue that i have experienced is that the screens are thin, and crack easily, so make sure to purchase the protection plan.", "Date": "March 4, 2014"}, {"Title": "IT WAS A GIFT FOR MY GRANDSON", "Author": "Barbara Kodash", "ReviewID": "R16REXU0C9E74K", "Overall": "5.0", "Content": "My grandson loves it and plays with it all the time.  It was easy to learn to use.  Well worth it.", "Date": "March 4, 2014"}, {"Title": "ok", "Author": "erica womack", "ReviewID": "R1A6AQB5XJEI0E", "Overall": "3.0", "Content": "Its works ok but its slow and picture isnt very good downloading games takes forever and it freezes sonetimes .", "Date": "March 3, 2014"}, {"Title": "Decent for the kids", "Author": "Slowleadmccey", "ReviewID": "R24HZ0BLTGPJP7", "Overall": "3.0", "Content": "We ordered these for our kids (10 and 6) so they would have something to use to play games on instead of  our iPads.  It turns out, they're not bad.  This is the second one we've given our son as the first one was damaged by his sister (4 at the time).  These do have a HD screen but the camera is pretty lame, so picures taken in bright sunshine are the only ones that look any good.  The ones we got say 4GB on the back of them but when you look in the system settings, it says 2.8GB.  I'd say that's pretty far off the mark for the storage rating.  As it turns out they are pretty durable as our daugher has dropped hers several times, and it still works well.  I guess that's one advantage of not having a glass front.  Loading apps is easy enough, we've even gotten a few educational games in under the radar.  All in all, it's a good tablet for kids.  I'd spend a little more if you're looking for something that doesn't feel like a toy.", "Date": "March 3, 2014"}, {"Title": "GRANDSON LOVES THIS TABLET !!!!!!!!!!!", "Author": "Linda Z.", "ReviewID": "R3PHFNSKLQ0XZV", "Overall": "5.0", "Content": "IT IS A GREAT TABLET. WE HAVE HAD NO PROBLEMS WHATSOEVER. EASY TO USE, BIG SCREEN. GAMES LOAD FAST. WE DID THE \"APP KILLER \" RIGHT AWAY LIKE THEY ADVISED. WELL WORTH THE MONEY. WHY PAY MORE WHEN THIS TABLET DOES AS GOOD OF A JOB AS THE $300.00 ONES", "Date": "March 2, 2014"}, {"Title": "Perfect", "Author": "Jeanette Solomon", "ReviewID": "R193TYYL6B8NJC", "Overall": "5.0", "Content": "This is the perfect gift for my son.  He was able to download his games and movies without problems.  It turned out to ne a great buy.  Unfortunately he dropped it and cracked the screen and I can't find a replacement screen.", "Date": "March 2, 2014"}, {"Title": "Great Deal My Grand Kids Love It.", "Author": "Frank Spignardo", "ReviewID": "R3NC7QXPLOKC9D", "Overall": "5.0", "Content": "My Grandkids Love It.Great Deal It Is All They Said It Was And Then Some Will Deal With Them Again.", "Date": "March 2, 2014"}, {"Title": "Good Tablet", "Author": "Debi Griffin", "ReviewID": "R1BOQVJCDUFOVU", "Overall": "4.0", "Content": "This is really not a bad tablet, but I would not recommend it to anyone who may be rough on things, such as younger children.  My 14 year old received this for Christmas, and after just 2 months, the on/off button is worn out, and does not always work well.  If you buy this, be sure to spend the little extra to buy the 2 year Square Trade plan.  I did, and am making a claim now.", "Date": "March 1, 2014"}, {"Title": "Broke immediately", "Author": "CrazyDaizy99", "ReviewID": "RLGP3LNBFDWAW", "Overall": "1.0", "Content": "A fun little android tablet when I bought it for my daughter. But it failed within two weeks after she got it for Christmas and is now useless... very disappointed after the positive reviews I read.", "Date": "February 24, 2014"}, {"Title": "Not impressed.", "Author": "Sara Wheeler", "ReviewID": "R2PTLV5B5FBA5U", "Overall": "2.0", "Content": "I think my Android phone has more \"oomph\" than this product.  It is slow, not user-friendly and has terrible battery life.  I wish I would have kept the box and returned it.", "Date": "February 24, 2014"}, {"Title": "Meh...", "Author": "Amazon Customer", "ReviewID": "R10KM4G8MQO0D", "Overall": "3.0", "Content": "It's an okay tablet, especially for the price you are paying.  Don't expect too much in the way of graphics, and you can only really see the screen straight on (gets really blurry at an angle).  The battery sucks, drains very quickly and takes forever to charge.  Save a little more money and buy a Nook or a Kindle.  That's what we had to do for my son, after spending the money on this one...", "Date": "February 23, 2014"}, {"Title": "Good tablet", "Author": "My 2 monkeez", "ReviewID": "R3HKZSTD1AZSFE", "Overall": "4.0", "Content": "Great item for kids, the only thing is charging cable is not very sturdy ( at least for kids) .", "Date": "February 23, 2014"}, {"Title": "Dragon Touch", "Author": "Patti Barnes", "ReviewID": "R2K7FV7N92E16H", "Overall": "1.0", "Content": "Ordered same tablet twice.  Both had to be returned due to very short playing time (less than two hours after charging), both completely died after a few days and the second one got very hot.", "Date": "February 21, 2014"}, {"Title": "Very disappointed.", "Author": "Linda Baragona", "ReviewID": "R1SR512SPJU3GA", "Overall": "1.0", "Content": "Broke in the first day. Bought 4 of them. Others screen cracked and when they would run took hours to download one game. Very disappointed.", "Date": "February 21, 2014"}, {"Title": "Decent (wanting instagram?)", "Author": "JENNIFER", "ReviewID": "R3474BIZQTERPF", "Overall": "4.0", "Content": "I got this for my preteen daughter so she would stay off the IPAD.  So far it is pretty decent, she is using it for KIK messenger, Netflix, and Instagram.  We downloaded kik and Netflix by going to google play but had to use back doors for instagram because the device did not support instagram.  I think it just wont support the newest version but we went to the next version down and it was fine.  I am pretty sure this is not the best thing to do because I got a \"enter at your own risk\" warning from the tablet by going to android drawer to download but it worked fine for us.  We then tried to add a game but it said we were short memory, to be fair it was a large game.  I instantly went back on amazon to find an SD card for it but I didn't really find anything that said \"YO this is for the Dragon Touch\" so I am leery to buy one.  It is probably a generic SD card but I would like more direction to accessories for this tablet, they only have a million for the covers, screen covers, cases, and foilos, but no SD card, geesh.  Overall it is not bad for the price and I am getting another one for my other daughter.FYI ****Want Instagram[...]", "Date": "February 20, 2014"}, {"Title": "dont buy this tablet", "Author": "manny", "ReviewID": "RXIPC6NWCKJ4U", "Overall": "3.0", "Content": "The tablet keeps disconnecting from the WiFi the camera is horrible both front and back u cant download certain games it has a delay when unlocking it", "Date": "February 20, 2014"}, {"Title": "NO GOOD", "Author": "Zelyntor", "ReviewID": "RCPQ90WVXTBY6", "Overall": "1.0", "Content": "I thought this might be a nice tablet to get my wife to use one, but because it barely works she gave up on it.  I would not recommend it to anyone - pay a bit more and get a Kindle.", "Date": "February 20, 2014"}, {"Title": "Didn't work for us", "Author": "Kelly Reagor", "ReviewID": "R2NTMREABXULG8", "Overall": "1.0", "Content": "This item just didn't meet the needs of my 12 yr old ,  it was cute that's about it ,", "Date": "February 20, 2014"}, {"Title": "excellent and reliable product", "Author": "moreno_716", "ReviewID": "R3RAS698ISG2LU", "Overall": "4.0", "Content": "despite being an economic team that meets the system requirements that are needed and reliability of these devices and that's why we chose", "Date": "February 20, 2014"}, {"Title": "I loved it while i was able to use it", "Author": "J.J.", "ReviewID": "R6NWW7H1G8GBT", "Overall": "5.0", "Content": "I loved this tablet even though I only was able to use it for a week due to the screen shattering.  That was the only downside.  I set it on the charger over night and when I woke up the screen had spider web cracks all over.  My wife has the pink one and she loves it.  Not a bad purchase for $79.99", "Date": "February 19, 2014"}, {"Title": "Overall happy with the purchase", "Author": "Virginia manriquez", "ReviewID": "R5T5QQE4CAVJJ", "Overall": "4.0", "Content": "The tablet works great I bougth it for my daughter she is 5 ... There is two things that I dont like the screen is too bright it almost looks like it has 2D or 3D you have to tilt it to the side a little to be able to see, I dont seem to find a setting to control that brightens. The audio is kind of low my daugther is hard of hearing and it doens't seem to boder her but with background noise I even have a hard time hearing.", "Date": "February 19, 2014"}, {"Title": "great for  kids and teens", "Author": "Jean", "ReviewID": "RBL36D4EELVK4", "Overall": "4.0", "Content": "Great item for the price, I got this for my 12 yr old son, he absolutely loves it. it never leaves his hands. the videos and games are crystal clear.", "Date": "February 18, 2014"}, {"Title": "good product for the price", "Author": "Jean", "ReviewID": "R12SQB3U3R1Y47", "Overall": "5.0", "Content": "Turned out to be a nice present for the price. My 14yr old loves it and has not reported any problems with it what so ever.", "Date": "February 18, 2014"}, {"Title": "Died after 6 days.", "Author": "Lisa Coleman", "ReviewID": "R1X9Z90LF63M9I", "Overall": "1.0", "Content": "I bought this tablet after my nephew said it was awesome and when you plug it in to charge, nothing and it won't turn on?  Then it happened to my son's that I bought him too?  They ought to stop selling them", "Date": "February 18, 2014"}, {"Title": "Not a happy customer- Power button not working after 2 days", "Author": "Blake Martin", "ReviewID": "R1HTYKWL4BHQWE", "Overall": "1.0", "Content": "I ordered 2 of these right before Christmas as gifts for my children. I also got the Square trade Warranty for an additional $10 on each tablets. The Square Trade Warranty is awesome. However the tablet is not. Soon after Christmas, the tablet was accidentally dropped and I called SquareTrade and within 2 days I had the purchase amount back in my paypal so I could buy another tablet to replace this one. Here is where the problem started. I purchased the tablet and  not even 2 days after receiving it, the power button sunk down in the casing of the tablet and it will not power on or off. I returned it(Amazon Prime  return was painless) and purchesd another one. within 24hrs of receiving it, the power button done the same thing. Not sure what is causing it to sink down in the casing of the tablet and not work. The two new tablets have not been dropped or mistreated. The other tablet I purchased at Christmas has just now stopped charging as well. I have ruled out the charger because I have a working charger for the other one that is identical. I guess you get what you pay for with these tablets.", "Date": "February 18, 2014"}, {"Title": "It worked awesome . . . for about 2 months", "Author": "Amazon Customer", "ReviewID": "R2365DZBCVVED3", "Overall": "3.0", "Content": "It worked awesome for about 2 months and then bam it never came on again.  No warning, no error message nothng.  Doesn't seem to be anyway to even get to the battery to see if that's the problem.  It looks like I'd have to break the case to get to the battery.", "Date": "February 18, 2014"}, {"Title": "not good for me", "Author": "Tiffannie R.", "ReviewID": "R1GU4VNRQCPLTF", "Overall": "1.0", "Content": "Product overheats & shuts off with use. Then it turned off & never allowed me to use it again. This product wasn't for me", "Date": "February 18, 2014"}, {"Title": "Nice", "Author": "M. Crosson", "ReviewID": "R2R822T47VJZ0Q", "Overall": "5.0", "Content": "I got this for my 10 year old. He loves it. It's inexpensive and works very well. I suggest a good case though.", "Date": "February 17, 2014"}, {"Title": "Not as good as advertised", "Author": "Mitchm26", "ReviewID": "R2Q4G9UT021V62", "Overall": "3.0", "Content": "It only comes with 4 GB of memory,and after you install the apps you want, it is barely enough to put any music or videos on it. An SD card is a MUST BUY if you are purchasing this. Also, it says it has duel core processors. Well that isn't enough, because most of the apps I launch eventually end up crashing. Honestly, just pay a little extra for a better brand.", "Date": "February 17, 2014"}, {"Title": "Dragon Touch Tablet Review!!", "Author": "Ashley", "ReviewID": "R1CZYVNHWU5LZF", "Overall": "4.0", "Content": "This tablet is really good but there are a few problems. The camera kind of sucks , but if you don't want it because of the camera its great for you. It works soooo much better with WiFi or internet. So far from my experience no matter how slow the WiFi you're using is it still moves fast. Just the whole thing moves fast. Its light weight and easy to move around. You should definitely buy it! Plus its cheap!", "Date": "February 17, 2014"}, {"Title": "mad", "Author": "megan", "ReviewID": "R3NYCD7TUQIJUE", "Overall": "1.0", "Content": "The \" 3d\" causes a blur that is a major inconviene o and might i say the charger SUCKS OUT OF THIS WORLD LET ME START WITH ITS ONE IVE NEVER SEEN ITS NOT EVEN THE RIGHT ONE FOR THE TABLET YOU HAVE TO LATERALLY SIT THERE AND HOLD IT IN MIND YOU HAVE TO CHARGE FOR 10 hours when you first get it ha..... On the flip side i was able to download games for my son and its his new toy fyi way better one on nomoreracks for 60$", "Date": "February 16, 2014"}, {"Title": "CHEAP Tablet - Issues After 2 months", "Author": "johnny1996xa", "ReviewID": "R23IQJL61MAZQJ", "Overall": "1.0", "Content": "I ordered this tablet as a Christmas Present for my 4 year old.2 months after,the tablet has been having several issues. The battery doesn't last for more than 30 minutes. I've left it charging overnight and the next time the battery would tell me it's running low. The software seems to freeze up every now and then too. The wifi connection strength is very weak. You have to be close to the wifi signal to get a decent connection. My laptop can reach from far away.I regret making the decision of purchasing this tablet.If you want to get your kid a decent tablet, DON'T CHOOSE THIS ONE.My kid had a Nabi 2 tablet before this and it surely worked 10x better than this one and felt better made.", "Date": "February 16, 2014"}, {"Title": "screen problems", "Author": "Lorissa", "ReviewID": "R3TZC36XYO50GN", "Overall": "1.0", "Content": "My daughter bought this with her own birthday money and has had problems with the screen almost immediately. I am trying to exchange it now. Not sure if its just a deffective one or not.", "Date": "February 16, 2014"}, {"Title": "Not my number 1 choice.", "Author": "Jaime", "ReviewID": "R2HWLZDA28IDSW", "Overall": "2.0", "Content": "Charge only holds for about an hour and a half - two hours.  Screen is too reflective.  Although it does have good processing speed for a tablet.", "Date": "February 16, 2014"}, {"Title": "thanks", "Author": "jessie", "ReviewID": "R2W5ATND572DH7", "Overall": "5.0", "Content": "My mother was over joyed when she recieved this for her christmas/birthday gift. It was the best gift i could have gotten her. Thanks guys!", "Date": "February 15, 2014"}, {"Title": "great tablet for the price", "Author": "monica", "ReviewID": "R2O03V51F97T9F", "Overall": "3.0", "Content": "i love the product i gave it 3 out of 5 stars because i am super fast when it comes to technology and i want products that can keep up with my pace. this tablet does its best. i love the size of it, it fits in my hands nicely and i dont have to stain my hands to use it. i can download alot of apps all in all for the price its a great buy", "Date": "February 14, 2014"}, {"Title": "It's ok", "Author": "Tina", "ReviewID": "RAMOQK170A2ID", "Overall": "2.0", "Content": "I was very excited to receive this product, but I believe it is not the best for smaller children or adults for that matter.  My main complaint is in regard to apps.  Not all apps that I have purchased work on this tablet.  I purchased some learning games from the Amazon app store and they do not load.  I knew this product would not perform as my personal android phone, but I expected that there would be more ease of use.  Another issue is in respect to Wi-Fi and the fact the games will just stop working.  I am pretty good at clearing data and ensuring the memory is maintained, and I reset my router regularly.  I have performed a factory reset of this product and that seemed to help but honestly I am not happy with this purchase. I left this review for the tablet covers as well.  These tablets get very warm and with the cover it is absurd.  My daughter has complained about the heat, and my son will not touch the tablet when it heats up.", "Date": "February 14, 2014"}, {"Title": "not as i thought it was", "Author": "joy cardinal", "ReviewID": "R2EFJV69KWM868", "Overall": "2.0", "Content": "I saw reviews on how this worked , I shoulda known better, the pictures aren't as id like them to look ,sending videos on to others aswell is most difficult if your new to the touching and tapping in places traveled , that back up button is most handy, hate how google always comes up  the sound sucks do not use this for music , it is not true nor the video it takes , and it gets hottttt too the point of not being able to handle it , most definitely need a case to hold on to it when it gets hotttttttt to the touch and the battery life is and hour maybe, if your lucky, after being fully charged after the full charge they ask you to do the 1st time", "Date": "February 14, 2014"}, {"Title": "Meh. Double meh.", "Author": "Kate F. \"rocketgrrl\"", "ReviewID": "RL0C0Z3KMG2QC", "Overall": "2.0", "Content": "- Heats up something fierce while using- Very slow when using apps- Would not connect to my computer to transfer files via USB; computer could not recognize itI cannot recommend this.", "Date": "February 14, 2014"}, {"Title": "Tricky", "Author": "Sassy & Seventy", "ReviewID": "R2FIJFHY3I7AL3", "Overall": "2.0", "Content": "Most of the time, the table will not open up---that is, come \"on\".  I am chalking this up as a \"learning experience\"; you get what you pay for.  This was a \"cheap\" item, should have known better----don't waste your money or time with this product---buy the more dependable expensive tablet!", "Date": "February 14, 2014"}, {"Title": "good for a child who is learn to use a tablet", "Author": "Africana", "ReviewID": "R23Y0L1VJHP3LT", "Overall": "1.0", "Content": "It takes ten hours to charge. It can't charge with the charger I receive n it can't charge n use at the same time. Its just a waste of time the battery only last 30 minutes or less. Nonetheless my son still love it", "Date": "February 12, 2014"}, {"Title": "Product isn't worth the monehy", "Author": "Lorraine Washington", "ReviewID": "R28KBJPIYMJWWU", "Overall": "1.0", "Content": "First tablet would not turn on after being fully charged. Second tabled worked for 3 months and again would not turn on after being fully charged. Product is defective. Would not recommend this product. If you decide to purchase this product, please get warranty to be safe.", "Date": "February 12, 2014"}, {"Title": "Only works when it wants to.", "Author": "Rachel217", "ReviewID": "R16KXMKX58E1MG", "Overall": "2.0", "Content": "Everyone told me not to go cheap on electronics-and I should have listened!  The screen blanks out frequently and I have to turn if off and back on again to resolve the problem.  The resolution is extremely poor making.  The battery life is quite low.  It's just not as I thought it would be.  Needless to say, I am now stuck with having paid for this hunk of junk, and now having to purchase one of higher quality.", "Date": "February 12, 2014"}, {"Title": "Tech support is poor", "Author": "Mark L.", "ReviewID": "R24ZS2FCJS92OF", "Overall": "4.0", "Content": "Needs a better manual, Okay for the price.  Shop around and see where a toll free tech support option is available.", "Date": "February 12, 2014"}, {"Title": "dragon touch lightly", "Author": "julie spears", "ReviewID": "R2NSGEUBWFSGUL", "Overall": "2.0", "Content": "Screen broke rather easy. Bought two at same time both broke within a cpl weeks so touch lightly or it may just shatter", "Date": "February 12, 2014"}, {"Title": "Worth the money", "Author": "Tonya Steinkruger", "ReviewID": "R1TC8115AL4PT", "Overall": "5.0", "Content": "I purchased this for my 11 year old Grandson for Christmas. I also bought a leather cover for protection which he never used. He dropped it and the power button is very sensitive. Please purchase extra protection and memory card.Michael loves this Dragon and it helps him scholastically and allows him fun with games. He has learned how to e-mail and send photo's. I hope in time he will learn how to go to his Schools website, click on the links to join in on extra English work.The Dragon is pretty clear to watch video's, play games and access the super information highway faster than my phone.", "Date": "February 12, 2014"}, {"Title": "Low quality", "Author": "Dana", "ReviewID": "R2GRDB8VX6GIAU", "Overall": "1.0", "Content": "This tablet is slow. I bought it ahdmhadnproblems with it from day 1 till it broke. Waste of money and time.", "Date": "February 12, 2014"}, {"Title": "works ok. gets hot.", "Author": "stephanie copley", "ReviewID": "R252KNJ7FKVCTW", "Overall": "2.0", "Content": "i bought it for a certain game. wont download the game. battery life is extremely short. always be close to a plug in. gets hot easily. and if u turn it off. it struggles to come back on. i would not buy this. if i had it to do over. i would have saved for a kindle.", "Date": "February 11, 2014"}, {"Title": "pretty good", "Author": "Kari Branham", "ReviewID": "R1EQMZM9I2KA3Q", "Overall": "4.0", "Content": "This tablet is very easy to use the only reason I gave it 4 not 5 stars is because it is very easily broken the plastic case is very cheaply made but what do you expect for the price but other than that the functionality is awesome it doesnt freeze up and is easy for my 6 yr old to use and understand.", "Date": "February 5, 2014"}, {"Title": "Not Happy!!!!", "Author": "Tyra West", "ReviewID": "R1K59JY8JBGCTZ", "Overall": "1.0", "Content": "This product did not charge. I only had it for a few days.3 days to be exact. Will not purchase another.", "Date": "February 5, 2014"}, {"Title": "You get what you pay for", "Author": "sissy", "ReviewID": "R3WFJLW2GLV6T", "Overall": "3.0", "Content": "Camera stinks and volume control on one is stuck. They are very light weight which is nice. Don't expect Kindle or iPad quality with this tablet.", "Date": "February 3, 2014"}, {"Title": "DragonTouch", "Author": "Shelia D. Perry", "ReviewID": "ROQUSR5T0792H", "Overall": "4.0", "Content": "Everything about the Dragon Touch is clear, there were noproblems with downloads- you can barely touch the screenand no problems at all.  I would recommend this to all ofmy friends.  I am 60 years old", "Date": "February 3, 2014"}, {"Title": "my tablet is ok....", "Author": "Charkia Hunt", "ReviewID": "R159AF3SLI8YVZ", "Overall": "3.0", "Content": "It was fun when I fist got it because the price was perfect but I just wish I can download some app I use a lot like Instagram and vine and IHeartRadio...and sometimes it moves slow or freezes and I have to reset it...its a good tablet for people who don't do much...but me I didn't realize till after a week I got it I have to get a sim car....not cool...", "Date": "February 3, 2014"}, {"Title": "review", "Author": "Donna Nimmo", "ReviewID": "R3GZ3JWNMWI7D2", "Overall": "5.0", "Content": "I am very happy with my drgon touch. I just wanted to play games on I could carry around with me and I'm 62 years old and love it. A good price and perfomance without the price of an ipad.", "Date": "February 2, 2014"}, {"Title": "Great for the price.", "Author": "Jaemiah", "ReviewID": "R3RAIHC3JSB6GP", "Overall": "3.0", "Content": "definitely would recommend it. Im happy overrall.Would have given itt 4 stars but they sent me the wrong color and I didn't feel like going thru the exchange process.Would deserve a 5 star if the battery life was longer.Visual is great sound was surprisingly good.I don't regret the purchase at all, just wish I got the color I wanted.", "Date": "January 27, 2014"}, {"Title": "Keep looking", "Author": "Christal Burston", "ReviewID": "R3B5EM06DQ7MQE", "Overall": "1.0", "Content": "Don't buy it ! I bought 2 for my children for Christmas. One works just fine although within a few weeks of playing it the tablet literally fell apart. Buttons came out etc.  The other tablet even though I have called the company several times has a hard time coming on and when it does all memory is lost. It won't hold the correct time and date or even a wifi signal.", "Date": "January 27, 2014"}, {"Title": "Dragon Touch", "Author": "baker", "ReviewID": "R1RCAB2F1WG3QS", "Overall": "2.0", "Content": "I was excited to order this for my 11 yr old son for christmas. When It arrived I had to charge it for a full 8 hours before its first use and again once more another 8. I was disappointed the case seemed very cheap quality as well as the screen. This tablet lasted 2 weeks and it dropped once and the screen was gone and would't even power up all the way. I have a Kindle and have dropped it 100 times and it still works with no problem! Glad I bought the square trade agreement!", "Date": "January 26, 2014"}, {"Title": "perfect color - perfect fit", "Author": "Douglas W. Daniels", "ReviewID": "R3RYWU7WVYFFWZ", "Overall": "4.0", "Content": "I am very pleased with this product. My wife loves it constantly braggs on how her co workers like it. They think she is spoiled", "Date": "January 25, 2014"}, {"Title": "the children love it", "Author": "Southern Bell Lady", "ReviewID": "R1LPUKRSQSFMC2", "Overall": "4.0", "Content": "I purchased the tablet for my daughter's. It was more economical than some of the popular tablets and the children's them. Especially when we travel", "Date": "January 25, 2014"}, {"Title": "Gemini not satisfied", "Author": "queen goddess", "ReviewID": "R1VQDYINRPTKR3", "Overall": "1.0", "Content": "this is the worse tablet I've ever brought it was messed up from the time I got it the buttons were stuck the tablet wouldn't charge. I just wish my grandson would have gotten to use it first cause maybe i could have rated it a little better but right now I can't say anything positive about this item.", "Date": "January 23, 2014"}, {"Title": "horrible tablet", "Author": "lakisha love", "ReviewID": "R2O00OOHEQUGJL", "Overall": "1.0", "Content": "Volume is really low. It takes to long to charge.  Camera is horrible.  Worst thing I ever purchased. Both my kids were disappointed for Christmas.", "Date": "January 22, 2014"}, {"Title": "...", "Author": "Alexander Martinez", "ReviewID": "R24OTWGTSJF3H3", "Overall": "1.0", "Content": "Not pleased with it at all. Very bad image display with camera already experiencing problems with freezing very bad sound quality", "Date": "January 22, 2014"}, {"Title": "Not enough user guide", "Author": "Linda", "ReviewID": "R1FQ0KWO1HVF7X", "Overall": "3.0", "Content": "I love the tablet size.  It came as promised, but I am not savvy enough to figure out its use.  I wish it had more of a user guide.  I would buy one if they had it.", "Date": "January 21, 2014"}, {"Title": "dont waste your money", "Author": "deanna r hickman", "ReviewID": "R2L863QVU1LS41", "Overall": "2.0", "Content": "i gave this tablet two stars because, i feel like i basically wasted my money. i bought it for my 8 yr old son and he barely on it. the tablet wont turn on most of the time and when it does it takes forever to turn on. also, we have wifi and he has never been able to get on the google store. its an ok tablet when surfing the web but i feel it was a wqste of money.. should have lnown what i was getting myself into with with a cheap tablet.", "Date": "January 20, 2014"}, {"Title": "Piece Of Garbage", "Author": "ceean faucette", "ReviewID": "R3FP37H3ZGIXZR", "Overall": "1.0", "Content": "This tablet is very very fragile. I brought this tablet for my daughter's in pink and purple. My oldest daughter's power button got stuck inside when she turned it on. My younger daughter's screen was cracked upon arrival. Christmas morning was kind of a disaster. The thing they really wanted was unusable.", "Date": "January 20, 2014"}, {"Title": "No memory space", "Author": "Amazon Customer", "ReviewID": "R1GMYAGUMMN4IW", "Overall": "2.0", "Content": "Yes I know that it says 4gb but it takes only 3 apps to fill it. And I mean games that are not even that big. I bought this tablet for my daughters they're 7 and 9 and they like it but don't love it. It has an option to move apps to an sd card which i bought, but you have to uninstall the apps before moving them to the card so what's the point to move them to the sd card. And when you are going to move them back to the tablet they don't work, you have to delete them completely and then download it again. The only reason I rated it a 2 it's because like I said before my girls liked it, if it was for me ill rate it a zero. Oh and another thing is a very cheap material my daughter drop it from the couch and it split open like a plastic Easter egg.", "Date": "January 20, 2014"}, {"Title": "raited and why", "Author": "Faith Davis", "ReviewID": "RMAAIN2O6QFZY", "Overall": "2.0", "Content": "It over heats! And I had to buy a memory card to get it to work for more than one thing. Getting a hold of customer service is a pain also. I need it fixed and 3 weeks later I still can't get a hold of anyone! Should of bought an I pad.", "Date": "January 20, 2014"}, {"Title": "this tablet sucks", "Author": "Rico Paredes", "ReviewID": "R1CJ03309PH2OS", "Overall": "1.0", "Content": "Its a dud..I will be returning it..overheats.and sometimes it doesnt even turn on. Defective Isnt even the word for it.", "Date": "January 19, 2014"}, {"Title": "doesn't work properly.", "Author": "pat lee", "ReviewID": "R2JXTQZ5SIB6H2", "Overall": "1.0", "Content": "It gets hot and goes off. It won't hold a charge but for 2 hours. The other 2 work work just fine. I need to send it back. Could you tell me where to send it?in", "Date": "January 15, 2014"}, {"Title": "They would not even charge well", "Author": "pat 69", "ReviewID": "R3JOFKYPN0DAP5", "Overall": "2.0", "Content": "When I saw this tablet of amazon I thought it would be the perfect Christmas gift for my girls. then after talking to my friends about it , they asked to buy some for their kids as well so I bought 7 of them. It was hard to get them to charge the first time after that they seemed to be ok but they kept turning off over and over again while they were playing.  One of my friends could never get it to charge at all even after I lent her my charger hoping that it was the only problem. we only had them for 10 days and it was more of a battle every day so all of us decided to returned them and we did not get all of the money back even though it was not our fault that we had to return them. We are very disappointed!!", "Date": "January 15, 2014"}, {"Title": "Worst Tablet Ever!!", "Author": "AlexusJoullanar", "ReviewID": "RIU0DG0U4CJC1", "Overall": "1.0", "Content": "It didn't charge well at all & it froze a lot & was very slow. It also felt very cheap like a piece of plastic.", "Date": "January 15, 2014"}, {"Title": "You get what you pay for", "Author": "Busy mom", "ReviewID": "R2TZPG5SSBZGTE", "Overall": "3.0", "Content": "I ordered two, one for each of my kids. One of them worked (and still works) as advertised. The others charging port didn't work from the start, and usb charging is certainly not sufficient. I returned the defective one and got a refund.The operation of the tablet is as expected. It's fast enough. The battery life isn't that long, but long enough to keep the kids occupied for a road trip.", "Date": "January 15, 2014"}, {"Title": "dragon touch", "Author": "jacob Doan", "ReviewID": "RRXAR1COPGX3M", "Overall": "5.0", "Content": "Tablets are awesome battery life isn't great but they stream Netflix and hulu perfect no lagging games run smooth its an awesome device for an awesome price.", "Date": "January 15, 2014"}, {"Title": "Waste of money", "Author": "momof3s", "ReviewID": "R2B8MZDP1KL658", "Overall": "1.0", "Content": "Bought tablet for my sons Christmas and display died in less than 4 weeks. Refused to buy another one. Cheap is not always good.", "Date": "January 14, 2014"}, {"Title": "waste of money", "Author": "anne shirley", "ReviewID": "R18O0GBLYP64D4", "Overall": "1.0", "Content": "From day one the dragon tablet would not let me do anything, and by day three would t keep a charge.", "Date": "January 14, 2014"}, {"Title": "Good stuff", "Author": "William McDonald", "ReviewID": "RUUNZ4J2PD90L", "Overall": "4.0", "Content": "Bought it for a 3yo and he loves it easy to navigate and hold for him good stuff here thanx", "Date": "January 14, 2014"}, {"Title": "Awsome For Its Price", "Author": "Jennifer", "ReviewID": "R2S8I0INJ5CLR", "Overall": "4.0", "Content": "Awsome tablet for a reasonable price. Fast and does everything I want it to do and more. Highly recommended for kids and adults.", "Date": "January 14, 2014"}, {"Title": "Ok", "Author": "leslie", "ReviewID": "R1SID5OVUZ4XDG", "Overall": "1.0", "Content": "The sound button isn't working properly had to return it ... And got my daughter one and when I got it the wifi wouldn't connect", "Date": "January 13, 2014"}, {"Title": "Just plane junk!!!", "Author": "chad", "ReviewID": "R3637ALKG3KAI5", "Overall": "1.0", "Content": "Wow I seen some bad screens in my life with all the tech I buy and own but thing is so bad that it is hard to do anything on it at all.When I bought this thing I call it that because its not up to par to be a tablet I knew it wouldn't be the best for 100$ but I did expect it to work half right this thing is a joke its so slow I have an old HTC wildfire sitting around and it is faster then this tablet. Don't waste your money it is built so cheep a day after I had it the screen went black I pulled the back off and all the ribbon cables came out of the sockets junk do your self a favor and don't even give this thing a second thought.", "Date": "January 13, 2014"}, {"Title": "Nice for the price", "Author": "Carol Miller", "ReviewID": "RPE9Q6W3COKCQ", "Overall": "4.0", "Content": "Nice little tablet.  It's great for the kids.  A little slow to start up but we can live with that.", "Date": "January 13, 2014"}, {"Title": "broke", "Author": "Monica Jansen", "ReviewID": "R2IEKOV9H64AFP", "Overall": "1.0", "Content": "It broke the first day by setting it up the screen cracked and No good won't work. It seams very cheaply made.", "Date": "January 13, 2014"}, {"Title": "great gift", "Author": "Helen", "ReviewID": "R1ZN50D4H3TQ4J", "Overall": "5.0", "Content": "This was purchased for a 13-year old and he absolutely loved it.  The speed of operation was good and the ability to add extra memory was awesome. Unfortunately it met with an accident but is being replaced with the same tablet.", "Date": "January 13, 2014"}, {"Title": "Was somewhat dissapointed", "Author": "Marissa Wilmot", "ReviewID": "R2BYEU69OGKMWS", "Overall": "3.0", "Content": "Loved how user friendly it is, however it was dropped a very short distance and the screen broke, so not very resiliant.", "Date": "January 13, 2014"}, {"Title": "Very good Purchase", "Author": "John George", "ReviewID": "R1X8N4UA6GTL4F", "Overall": "5.0", "Content": "This item was at a great price and made good for a Christmas present. Was very satisfied with this purchase.", "Date": "January 13, 2014"}, {"Title": "short battery", "Author": "Amazon Customer", "ReviewID": "R2YMQ8IJ9EGULW", "Overall": "2.0", "Content": "I got this for my son because it was a low cost and it wouldn't b a huge deal if something happened to It however after 10 minutes of him playing a game it goes dead.", "Date": "January 12, 2014"}, {"Title": "Waste of money!!", "Author": "Danielle Montes", "ReviewID": "R1ETOYG06WOPHK", "Overall": "1.0", "Content": "I would rather rate a zero!! We ordered 2 of these for my daughters. One seemed like it was going to work ok and one would not turn on after a full 10 hour charge as directed! The one that did turn on would not connect to our wifi, it would just keep trying while the battery ran down and would finally time out. We have several other wireless devices in our house that connect to our wifi instantly. My daughter did enjoy playing with the very poor quality camera, but that did not make it worth keeping!! We are sending both back!!", "Date": "January 11, 2014"}, {"Title": "Gragon Touch 7\" tablet", "Author": "Jo Jackson", "ReviewID": "RCU4FO1EIU1V2", "Overall": "4.0", "Content": "Item was purchased for Christmas present and returned to Amazon.  Reason:  bought for my granddaughter, she received two tablets so I returned the one I purchased.", "Date": "January 11, 2014"}, {"Title": "My son", "Author": "francisco molina", "ReviewID": "RSQSZKKPRZORZ", "Overall": "4.0", "Content": "He is so happy with that tablet.  No more problem anywhere because he pay more attention to the tablet.  Thanks", "Date": "January 11, 2014"}, {"Title": "Review", "Author": "adrian kerr", "ReviewID": "R3NAZFTD7OZTF6", "Overall": "3.0", "Content": "This tablet is really good the only draw back is the picture quality. It is perfect for children but not for adults\\ young ppl who are into taking a lot of pics.", "Date": "January 11, 2014"}, {"Title": "Happy with one unit, but not the second", "Author": "Papa Paul", "ReviewID": "R27NJ8XV1M9BHJ", "Overall": "1.0", "Content": "I bought two units for my grandchildren. One was new in the box. This one is working perfectly. The other unit came wrapped in extra clear wrap with words something to the effect...ready for sale. I suspected that this unit had been previously returned, reworked and resold. This unit is very poor. The screen flickers and the color is washed out. My granddaughter has the original box, but not the original packing material. I am returning this unit for exchange. Hopefully, Amazon will honor their responsibility and do a simple exchange.", "Date": "January 11, 2014"}, {"Title": "Jason", "Author": "Jason Cottrell", "ReviewID": "R1FD8Y4PZXH9NE", "Overall": "1.0", "Content": "Not  durable at Alll ! Poor functionality with very thin plastic shell. I had to return both of mine. Junk.", "Date": "January 11, 2014"}, {"Title": "disappointed", "Author": "Mary Bell Salazar", "ReviewID": "RPVAWGFN6MT4", "Overall": "1.0", "Content": "Not even a week and its not working anymore. My son is very disappointed I got it for Christmas now he can't even use it.", "Date": "January 10, 2014"}, {"Title": "Perfect for kids", "Author": "Franz  Wachtler", "ReviewID": "R286OG4A74NUU7", "Overall": "5.0", "Content": "Its not a ipad! However for the price its a excellent value for a 9 and 10 yr old kids. After almost a month no problems works well and easy to use google play!", "Date": "January 10, 2014"}, {"Title": "Great price", "Author": "Domonique A Bailey", "ReviewID": "R33KG1FOUP02TB", "Overall": "4.0", "Content": "Great price and shipped fast for Christmas. Wish picture was more sharp like my Samsung 3 but this is a great tablet for the price.", "Date": "January 10, 2014"}, {"Title": "Good product for the Money", "Author": "Westshore Appraisal", "ReviewID": "R29FQ9T9WR38UW", "Overall": "3.0", "Content": "Very limited accessories ie case holders for this item-my daughter is 7 and moving from Ipod 4 that broke.  The quality is ok, but great for the price. Company, service and delivery are exceptional.", "Date": "January 10, 2014"}, {"Title": "Just did not work", "Author": "Pauline F. Thompson \"PALOPUMPKIN\"", "ReviewID": "R28UUW53QBYJ4K", "Overall": "1.0", "Content": "The battery  did not hold a charge at all.  I did not like this it was difficult to operate, I guess I get what I paid for.", "Date": "January 10, 2014"}, {"Title": "Dragon Touch", "Author": "Krysta Broderick", "ReviewID": "R2EEF9JDKU0WR", "Overall": "3.0", "Content": "I purchased 5 tablets for my children for Christmas,  was a hit with all of them.  However one of the five started over heating and shutting down within minutes of turning it on.  I will be returning it and purchasing a new one.  The other 4 are working perfectly and the kids are enjoying it.", "Date": "January 10, 2014"}, {"Title": "Dragon Touch Tablet", "Author": "Frances P Davis", "ReviewID": "R16QYSVY6N279Z", "Overall": "5.0", "Content": "Great gift for the grandkids.  They don't need all the bells and whistles so it suits their needs for music and videos.", "Date": "January 9, 2014"}, {"Title": "A great deal in a colorful package", "Author": "teresa codispoti", "ReviewID": "R3RW7KFLEXY5F", "Overall": "5.0", "Content": "Easy to use quick and my granddaughter loves the color an awesome tablet for the price I would recommend it", "Date": "January 5, 2014"}, {"Title": "my 12 year granddaughter is very happy with it", "Author": "Roland Brisson", "ReviewID": "R2H9IAFF8UB69B", "Overall": "5.0", "Content": "my granddaughter loves it. With so many choices it was hard to know which tablet to choose. I guess I chose well.", "Date": "January 4, 2014"}, {"Title": "thanks mom!", "Author": "Ashley Greer", "ReviewID": "R17MMJCXINNMMQ", "Overall": "5.0", "Content": "My mom bought this for me as a gift.. its cute! I got the blue one. Its perfect size ( small ). I haven't got it connected yet so I will have to update!", "Date": "January 4, 2014"}, {"Title": "never worked", "Author": "Jason", "ReviewID": "RZL452JXI03EK", "Overall": "1.0", "Content": "got this for my son for Christmas. it worked for half an hour tops then shut down to never start up again. while it did work it took 5-6 min to connect to the internet and 90% of the time the page would time out once you got the internet browser up and tried to search something.", "Date": "January 3, 2014"}, {"Title": "Customer Service is HORRIBLE", "Author": "workathome", "ReviewID": "RC9J1T58C8YEF", "Overall": "1.0", "Content": "I purchased this item as a Christmas present 3 weeks before Christmas.  A week after Christmas the charger was no longer working.  I called the number and was told they only have a 30 day warranty on this product.  They would not recognize that it was only out of the box for a week.  Amazon did issue me a credit, but buyer beware on this product.  I would recommend the extra insurance on this item because I don't expect them to last.  Better yet spend the extra on a reputable company tablet.", "Date": "January 3, 2014"}, {"Title": "give it a miss", "Author": "Gary Whalen", "ReviewID": "R3SCJDTYSTZ6XI", "Overall": "2.0", "Content": "1 week after using it, refuses to charge or switch off. Back of case gets really hot and, charge didn't last that long. Wouldn't buy another one.", "Date": "January 3, 2014"}, {"Title": "As it should be", "Author": "Amazon Customer", "ReviewID": "RQPRR1RLT1XU2", "Overall": "4.0", "Content": "I bought this product as a gift to someone else. Before giving it to them, I did take it out and charge it a little just to make sure everything worked. I didn't get too specific. But everything I checked was great.The product arrived on time and was in excellent condition. I was pleased. The final review will have to come from the person who receives it.", "Date": "January 3, 2014"}, {"Title": "Not a bad product for kids if it works", "Author": "Heather Stewart", "ReviewID": "R3L8P4ONTWBLSI", "Overall": "3.0", "Content": "I purchased 3 tablets for my kids for Christmas. i have had problems with the one tablet but the other two are working well. The one thing that is a bit annoying is the fact that the tablet does not seem to save the WIFI password so it needs to be retyped each time the unit is turned on. Otherwise it was easy to download from Google Play and I was even able to load some movies with digital downloads. No instructions -so it's learn as you go.Tablet express has been responding to my customer service emails re: the one tablet so i hope to be able to exchange it with no problems.", "Date": "January 3, 2014"}, {"Title": "Great Tablet For Kids", "Author": "Morris Tate", "ReviewID": "R348PN5Z7BLGJ0", "Overall": "5.0", "Content": "Great tablet for kids. I got 3 different colors for my 3 kids, and they love it. Had to send 1 back the day after Christmas because it didn't work. But they exchanged it with free 2 day delivery.", "Date": "January 3, 2014"}, {"Title": "Didn't work", "Author": "Becky White", "ReviewID": "R39NJ2I99AY6V3", "Overall": "1.0", "Content": "My 7\" Dragon Touch wouldn't turn on. Called the company and they tried to help but it wouldn't turn on. Had to return it to that company and then I just upgraded to a Dragon Touch 9\".", "Date": "January 3, 2014"}, {"Title": "Purchased two, both were dead on arrival", "Author": "Mary Shawhan", "ReviewID": "R2Y7OHMB8ZTSV3", "Overall": "1.0", "Content": "I purchased two of these to give to my grandkids for Christmas.  I could not get either of them to power on initially.  After fiddling around with them for a couple of days, I finally got one of them to power on, but then I could not get it to connect to WIFI.  The other one finally powered up only to power back down and I have not gotten it to come back up.  One bad tablet might just be bad luck.  But two failing in more or less the same way screams QA issues.  I am returning both of these tablets and will not order another Dragon Touch.", "Date": "January 2, 2014"}, {"Title": "My father bought 6 of these for his grandchildren and ll of them were returned", "Author": "seth engelbrecht", "ReviewID": "R239RIQKUNS6WU", "Overall": "1.0", "Content": "5 of them quit working within 2 days and the 6th the sound was off as soon as it came out of the box. There is a reason they are so cheap", "Date": "January 2, 2014"}, {"Title": "do not reccomend", "Author": "April Tyler", "ReviewID": "R3GRP77KRB556H", "Overall": "1.0", "Content": "Did not meet expectations.  Slow did not work well with wi-fi at all. Slow downloads, games, apps....was returned day after Christmas:(", "Date": "January 2, 2014"}, {"Title": "first amazon purchase", "Author": "e pedro", "ReviewID": "R281YXK24J3EJI", "Overall": "1.0", "Content": "this was my first amazon purchace that did not get past 1 its was not working it was a presant for a 7 year old that was not happy to recive a damaged tablet thats what i get going with anything less then a kindle  not happy at all i have never had this happen on amazon since my first purchace in 98", "Date": "January 2, 2014"}, {"Title": "7' tablet", "Author": "L. Hunt", "ReviewID": "R2UWVBQXLUYZPN", "Overall": "5.0", "Content": "Great little tablet, easy to care, lightweight. Has made my granddaughter very happy not to mention the hours she spends on games.", "Date": "January 2, 2014"}, {"Title": "Very excellent tablet for a low budget", "Author": "Jack Dalton", "ReviewID": "R3A60NKNFMBYY0", "Overall": "5.0", "Content": "Overall I was very impressed by this tablet. It performs very well, and runs smoothly. My only complaint is of the button arrangement, but that is not a problem. I would recommend this tablet to anybody wanting a tablet to fool around with, but not for work purposes. The tablet only has 4GB hard drive space (The model I bought anyways...), but this can be easily solved by purchasing a TF (microSD) card. I really enjoy this product, and I think you would too.", "Date": "January 1, 2014"}, {"Title": "Good value", "Author": "Amazon Customer", "ReviewID": "RYTDVKJTFMVVM", "Overall": "4.0", "Content": "Great shipping! Tablet is great value! Don't expect a top of the line machine at this price point, but if you need an inexpensive tablet for a child/gift/whatever this is a good choice.", "Date": "January 1, 2014"}, {"Title": "very good", "Author": "vickie bertrand", "ReviewID": "R39TLUXHLKEXIU", "Overall": "4.0", "Content": "I bought for my grandson and he loves it. It crashed on us Xmas day but after that it's been fine", "Date": "January 1, 2014"}, {"Title": "Ordered 2 Had to Return 1", "Author": "Melissa Kluczynski", "ReviewID": "R3RM6G6CGNPEAJ", "Overall": "3.0", "Content": "When the product works it works well. Stays connected to the internet and does what it is supposed to do, however we are 50/50 with this product. 1 would not stay connected to the internet, then wouldn't charge just died and that was it. Called the manufacture they helped us reset the system and the tablet then charged, but still would not hold an internet connection. If you can get it to work properly it really is a good tablet for the money.", "Date": "January 1, 2014"}, {"Title": "waiting", "Author": "Elizabeth Blais", "ReviewID": "R1IJANV41ZDY8H", "Overall": "1.0", "Content": "Please note not worth it unless you want a short period of time out of it. I purchased one of these tablets. Do not waste your money. I also wrote someone 4 days ago and still nothing. Like someone said in a review you have to tap not touch and my sons screen cracked. 3 days after christmas and lost 2 gifts because of this.(electronis that were powered with tablet) Battery life sucks. I did the charging thats recommended too. I wish the reviews were not all postivie that were put up when I purchased this back in November or I wouldnt have bought this product.", "Date": "January 1, 2014"}, {"Title": "wonderful for the price", "Author": "Skye Walker", "ReviewID": "R2835A10UNQYPB", "Overall": "5.0", "Content": "For the price and reason of getting it, works well. Runs decently smooth, if no sd card inserted, it does start to run slower when you download a bunch, but thats expected. I bought it for my 4 year old and he loves it!", "Date": "December 31, 2013"}, {"Title": "great tablet", "Author": "derick forde", "ReviewID": "R1CMS7MZNIEYII", "Overall": "4.0", "Content": "nice tablet got it for my kid she is loving it and im loving it more  sad she is telling me its mine not yours", "Date": "December 31, 2013"}, {"Title": "extremely poor quality", "Author": "roger", "ReviewID": "R3D5D7MGM3EQ2W", "Overall": "1.0", "Content": "purchased four of these. 3 of them messed up or started comin apart in some way after just 2 days. Im no expert on pixels or screen quality but ive seen tablets and phones with much less pixel resolution advertised that looks exactly the same as these. (640x480). i wasnt expecting no super HD screen but expected much better than what i got. turn the screen just a little and everything gets dark if not disapears. buttons on side and top are very flimsy and will stop working before anything else. seller shipped very quick.....thats about the only good thing i can say", "Date": "December 31, 2013"}, {"Title": "Dragon Touch® 7'' Blue  and Green models received...", "Author": "Tomas Medina Martinez \"Xitmedina\"", "ReviewID": "R1S1HPS123CS7V", "Overall": "1.0", "Content": "I recently received both tablets, and the same no power on... Not like it... and the other (Green color) come screen scratched", "Date": "December 31, 2013"}, {"Title": "Tablet", "Author": "Debra Swindall", "ReviewID": "R21VZCDY9E0ZNV", "Overall": "5.0", "Content": "My grand-daughter received 2 tablets, both from Nana's, the other one was smaller and is keeping both of them. She loves the purple one I bought. It comes with 2 games and absolutely love it.", "Date": "December 31, 2013"}, {"Title": "It's worth it to pay more for a better item", "Author": "TM_25", "ReviewID": "R3ELAPS1C6YB5R", "Overall": "2.0", "Content": "I had high hopes for the tablet as a family device.  When I first received it, the sound didn't work and I had to call tablet express for help.  I was hung up on twice by a person with poor phone reception.  The 2nd person and 3rd call was helpful and aided me in resetting the tablet.  It worked fairly well at first, the games looked great, internet functions were great.  Camera and video capabilities were horrible, about the quality of an old flip phone.  I may have over looked that, but the system kept getting stuck and often times when it goes off it takes several tries to go back on.  It went off on a Saturday night and I have been unable to get it to power up.  I have charged it over night and still not working.  It is now a Tuesday.  I will be returning it.", "Date": "December 31, 2013"}, {"Title": "Don't waste your money", "Author": "Nathan Vetter", "ReviewID": "RBTFF0KCHYWHN", "Overall": "1.0", "Content": "Only charges or turns on half the time.  Screen bubbles and cracks. Very very little use and this has happened.", "Date": "December 31, 2013"}, {"Title": "good kids tablet", "Author": "HarryMtrains04", "ReviewID": "RXPRGOFZT2J25", "Overall": "5.0", "Content": "I got these for my kids for Christmas and they are a great tablet for the price. Pretty fast and have a good battery life.", "Date": "December 31, 2013"}, {"Title": "Would not turn on", "Author": "CINDY TAMBERT", "ReviewID": "R35M3AAUUNEGHB", "Overall": "2.0", "Content": "I bought 3 of these tablets for my grandchildren and none of them work. trying to send them back is a project.", "Date": "December 31, 2013"}, {"Title": "it was ok. just that.", "Author": "doni vlade", "ReviewID": "R2UZHUS7KNSJJ2", "Overall": "2.0", "Content": "it was ok, not really what i want. to slow and some app won't install...update the market please and thank you...", "Date": "December 31, 2013"}, {"Title": "Sent it Back.", "Author": "Todd Butler", "ReviewID": "R3K5C3RLU8JLK9", "Overall": "1.0", "Content": "Bought this for my grandson for Christmas.  I checked it out when package arrived.  It worked i guess.  Find out after went dead that the charger doesnt fit nor does an conventional android style charger.  So it remained dead.  Returned immediately.  Waist of time.", "Date": "December 29, 2013"}, {"Title": "it will do for now", "Author": "deedee", "ReviewID": "RGFTAL04ZPX18", "Overall": "3.0", "Content": "its not what i wanted but it will do it was for my kid an it dont get somethings that she need it to get", "Date": "December 29, 2013"}, {"Title": "Starter tablet", "Author": "Dana Bolden", "ReviewID": "R1REDO5WKOZCQV", "Overall": "3.0", "Content": "This was a Christmas gift for my 8 1/2 yr. Old son who's never owned his own tablet. Overall it's a good starter tablet not the fastest but for the price fair. It's not running the latest software version so some apps aren't able to be installed ie; Instagram. However I believe once I add an sd card I can update it. Also the sound is extremely low unless you have headphones on. Going to go out an purchase some wireless bluetooth speakers .", "Date": "December 29, 2013"}, {"Title": "Good tablet..", "Author": "elizabeth schuhs", "ReviewID": "R7ULCZHZ3IZ22", "Overall": "4.0", "Content": "I got this tablet for Christmas.  So far i've had no issues.  You do have to keep the screen at a certain angle to see it.  Also, the speakers are so so but for the cost of the tablet, its what is expected.  I have mine hooked up to wifi and it works great.  I bought the 1 year replacement plan sice it was only $10.  I really like it.  I still  use my smart phone and laptop a lot so I couldnt see spending a ton of $$ on a tablet.", "Date": "December 27, 2013"}, {"Title": "My honest opinion? Not that good of a tablet...", "Author": "TigerBite", "ReviewID": "R25PX65U2XC7TL", "Overall": "2.0", "Content": "I bought this for my brother as a Christmas present because it was an inexpensive tablet that wouldn't break my bank. It came in and after about three hours using it, my brother gave it back and said he didn't like it (what an a-hole, he could've been done it a nicer way). Yeah so I'm stuck with this tablet because I ordered it awhile back and it's passed the 30 day return period. From first glance it looks nice but when you get into playing around with it that you'll find that it is limited and cannot do as much as you'd hope. First off the display is is pretty clear and is HD but not as good as an iPad or the Surface (I have neither but my friends have them and they are really nice.) Video quality from Youtube on this thing is garbage, the sound isn't that loud even on max, the charger it comes with doesn't work. Even though it's a standard Android charger, my phone charger can't get it to charge. The screen has a negative type effect to it if tilt it so you'll get distorted colors. I can say more but I won't. If you're thinking of getting this, don't. Save your money and spend a little more to get a Nexus or Galaxy Tab.*Update* (1/11/14)I found out last week that quality from the Youtube app is better. I was using the browser for Youtbe so that's why the quality wasn't that good. Soooo... today I accidentally dropped the tablet (yes, my fault) and the back piece came off and the wire got disconnected. Since I'm not a techie I didn't know if you could've just re-wired it or something but now my tablet is broken. The inside looked cheaply assemble because the wires and some parts were held down by some electrical tape. Oh well...", "Date": "December 27, 2013"}, {"Title": "Great Little Tablet", "Author": "Sharon A", "ReviewID": "R2D5SAI78P7CUD", "Overall": "5.0", "Content": "I got this little tablet for those awful waiting times, you know, like waiting in line, the doctors office, and other boring waiting places.Its just great. Fits my in my jacket pocket, goes anywhere. I can read free books, play free games. And I like to read in bed. This is great because when I get sleepy there is no light to turn out, just shut off the tablet and roll over, lol.  Wow, and on top of that Tablet Express shipped it in just a few days. Just can't get any faster than that. Oh, and here's something else I've noticed. You might not think it's much,but, the charger conection to the tablet is much more secure than other tablets I've owned. Much easier and more secure when recharging. Little things that mean a lot. Thanks a lot and keep up the good work.", "Date": "December 27, 2013"}, {"Title": "Don't buy this tablet!!!", "Author": "Amanda Martin", "ReviewID": "R2D8U0R32F0G1P", "Overall": "2.0", "Content": "I bought this tablet as a christmas present for my 7 year old daughter. We downloaded four games on it and when she tries to play one, it won't let her. It forces the apps to close. Don't waste your money on this tablet, spend a little more for better operational system and performance.", "Date": "December 27, 2013"}, {"Title": "Price is right fpr 1st tablet.", "Author": "Cristy L Dockery", "ReviewID": "R1GC55429WA5LB", "Overall": "3.0", "Content": "Great for a kid not recommended for an adult, poor picture quality. As parents we liked the price fit into our Christmas budget.", "Date": "December 27, 2013"}, {"Title": "hard to get signal for wifi", "Author": "Tammy J Williams", "ReviewID": "R1073JKAS25AFB", "Overall": "2.0", "Content": "keeps losing wifi signal. I have other tablets that work fine. I bought 2 both the same! and with wifi useless, camera stinks to not clear pic,", "Date": "December 26, 2013"}, {"Title": "Good", "Author": "Florentino C.", "ReviewID": "R2A2YFX3TP3NPX", "Overall": "4.0", "Content": "Good for the price, might give it away to a friend as a gift.  The wireless does not have a long range so limited to a confined area.", "Date": "December 26, 2013"}, {"Title": "Decent tablet for the price", "Author": "Amazon Customer", "ReviewID": "R24BP40QKIJQ4W", "Overall": "4.0", "Content": "I bought 2 of these tablets, one for myself, and one for my 8 year old daughter.  It was perfect for my daughter, however, I would have liked something of a little better quality.  There were a couple of times that my daughter had a hard time getting her tablet to turn on.  The screen just kept going black, but we just kept trying to turn it back off, to start it over.  This is a decent tablet for the price that we spent on it.", "Date": "December 26, 2013"}, {"Title": "Happy. Battery not so much.", "Author": "Jessica Westerfield", "ReviewID": "RHZW0XSJKCW7Q", "Overall": "4.0", "Content": "Easy to use. 8 Year olds happy. Battery life isnt great. Kids keep it plugged in to keep up with their games.", "Date": "December 24, 2013"}, {"Title": "wonderful and great", "Author": "sandra bibb", "ReviewID": "R2WVI83N90O6PL", "Overall": "5.0", "Content": "This product is wonderful.  It yas great features. Easy to use. Light weight. Can carry any where in my purse or bookbag", "Date": "December 10, 2013"}, {"Title": "Great deal!!", "Author": "Vanessa Bisonette", "ReviewID": "R3C76P212ALGDU", "Overall": "4.0", "Content": "Bought these tablets for my boys for xmas. I preloaded some apps onto them and it was very easy and fast. For the price I really got a great deal! They're going to love them", "Date": "December 5, 2013"}, {"Title": "DID NOT GET WHAT I EXPECTED", "Author": "Linda Russell", "ReviewID": "RROXOW3E9UL3Q", "Overall": "1.0", "Content": "Got the product. Tried to charge it and it would not work. Waited the 10 HOURS IT RECOMENDED AND STILL DIDNT WORK RETURNED NEXT DAY AND WAITING ON REFUND.", "Date": "December 1, 2013"}, {"Title": "Worth the price tag", "Author": "Amber Haas", "ReviewID": "ROQIHOD4WGX9S", "Overall": "4.0", "Content": "This was what I was looking for, and all the faults are all expected with the price tag. I highly recommend a memory card to increase the memory and a screen cover. The sound from the speaker is okay at best and I've encounter some failure to open some applications on occasion, but overall I expected some problems and it does what I need it to.", "Date": "November 29, 2013"}, {"Title": "Well Built and User Friendly", "Author": "M.Chambless-Tx", "ReviewID": "R27WIDFRUWLBF3", "Overall": "4.0", "Content": "Execellent Product, user friendly and well built. It works well with my Google Chrome Book.  The graphics are excellent and the colors are vivid.", "Date": "November 26, 2013"}, {"Title": "Thinking of getting this for Christmas? Think twice . . .", "Author": "Angelina Brenner", "ReviewID": "R33NXJB0A5J8SP", "Overall": "1.0", "Content": "I bought this product for my 10 year old son for Christmas. I know that you get what you pay for and the pricing on this item seemed almost too good to be true . . . and that's because it was. My child is too young, in my opinion, for an iPad or some other such pricey brand name item but I thought this would be perfect for him. When it arrived, I was able to get it to turn on but that was where the good ended. I couldn't get it to connect to any Wi-Fi and therefore was unable to download anything onto it. My husband and I tried everything with no results. When we tried to contact the seller for technical support (as a number is provided for on their website) there was no response though we tried to call for several days in a row. DO NOT BUY THIS. Since I don't need a paperweight, I will be returning this item and getting something that actually works.", "Date": "December 2, 2013"}, {"Title": "Very disappointed", "Author": "LaTanya Holmes", "ReviewID": "RG0I03UKXCND1", "Overall": "2.0", "Content": "I went round and round on getting my girls a tablet or a nook color. When I saw the price of this tablet and all it had to offer it was hands down the best idea. I just knew my daughters would love having their own tablet with camera. This way they could Skype their grandmother, take pictures, and still have the reading capability of a nook.They have had the tablets for 3 months now and we had to return them due to freezing, low battery life, broken charger, inability to read the SD card, etc. Now that we have received the new one and still having some of the same problems.  Now I can't get in touch with the manufacturer to request assistance, not by phone or e-mail. Lesson learned, stick with my first idea or with a name I trust.", "Date": "April 7, 2014"}, {"Title": "DAY 10 AND IT WILL NOT HOLD A CHARGE!!", "Author": "Kacey Ellis", "ReviewID": "R1432BN75N8U7F", "Overall": "2.0", "Content": "I received this as a gift. I've only had it since Valentines day and I am already having problems with it. Upon receiving it I was so excited, and couldn't wait to turn it on the play on it, but was a good girl and followed the instructions to let it completely charge. I noticed about 15 mins of playing time, the back started to get really HOT! So hot it was stinging my hand. I thought that I will just let it rest and come back to it. Same thing the next day and every time I turned it on. First of all, if it is getting that hot it obviously needs a vent to allow air to get to it. I understand it is no PC or laptop. However, the heat is ridiculous. Today 2/24/2014 (10 days after I received it) It will only work while it is on the charger!! As soon as you disconnect it, the device turns off. While it is on it states it is 99% full on the battery. However, when you disconnect the charger and try to turn it on, it shows a red fully drained battery!! *******************I HAVE ONLY HAD THIS TABLET 10 DAYS!!!!!!!!!!!!!!!!!!!!!!!!!! I am completely DISAPPOINTED with this tablet. At least it still turns on but how much longer will I have that??", "Date": "February 24, 2014"}, {"Title": "POS", "Author": "Ryan Watson", "ReviewID": "R159KW8SVRZKBE", "Overall": "1.0", "Content": "Cheap material looked better in the picture. After I bought it the button that turned it on came off. What a piece of work, I would returned it if i did not lose my box.", "Date": "March 6, 2014"}, {"Title": "great paper weight", "Author": "Jessica", "ReviewID": "R19A29PSG7KI7O", "Overall": "1.0", "Content": "Had it for two weeks, it started shutting off with full charge. Then it became unusable when the power button broke internally.", "Date": "February 13, 2014"}, {"Title": "Dragon touch 7\"", "Author": "Generic unlocked Quadband 2", "ReviewID": "R2NNW4DMCYXDBH", "Overall": "3.0", "Content": "I got it a little late but I received it,maybe is because of the weather I don't know but at least I got it.", "Date": "January 29, 2014"}, {"Title": "Hard to handle", "Author": "Heather Warneke", "ReviewID": "R9P8QOTH243TT", "Overall": "2.0", "Content": "It is a lot more confusing to use than other tablets and the wifi is not all that great. Not a good buy.", "Date": "January 23, 2014"}, {"Title": "It sucks!", "Author": "Christine", "ReviewID": "R1CSKUJ3AKFZEY", "Overall": "1.0", "Content": "Does not power on! Not enough space to store games! Battery life sucks! I hate it!!!! Regret buying this tablet!! Wasted my money!!!", "Date": "January 22, 2014"}, {"Title": "No Space", "Author": "Samantha Escobar", "ReviewID": "R2E75DT6NPT2TJ", "Overall": "1.0", "Content": "If your looking for a tablet to add apps to, this is NOT the tablet for that! You can't download more than 2 apps/games/anything, at a time. It runs out of space, the memory card is a great option but nothing saves to it, including the pictures, you have to manually move each picture to the SD card. This definitely isn't made for a preteen to use, there's no space.", "Date": "January 13, 2014"}, {"Title": "Dragon Touch", "Author": "robert plath", "ReviewID": "R2UR0ULLZXJJ4Z", "Overall": "5.0", "Content": "Far exceeded my expectations. Very fast and easy to use. My personal opinion is that for the price, it is comparable to the Google tablet without the higher price. Boot-up time is comparable to the Chromebook! Very pleased with purchase.", "Date": "January 9, 2014"}, {"Title": "Awful expirience", "Author": "chasity", "ReviewID": "R1AQS2FJ9PSPFF", "Overall": "1.0", "Content": "Bought this for my daughter for Christmas , and it worked for three days , then the screen went black. Now it wont turn on at all. Very frustrating and my daughter is really let down. Awful expirience.", "Date": "January 5, 2014"}, {"Title": "Got this after Christmas. Great!", "Author": "Amazon Customer \"newsong\"", "ReviewID": "R34FPQ7K7UH73E", "Overall": "5.0", "Content": "This tablet was great. It has an outstanding battery life if you turn it on ounce it's out of the package and tells you to charge it. I have no problem with the keyboard cause I got a keyboard/case for it. But other than that great tablet and would recommend it to anybody who is thinking of getting one!", "Date": "January 5, 2014"}, {"Title": "Nice tablet", "Author": "Amazon Customer", "ReviewID": "R286B5RD2X29BM", "Overall": "4.0", "Content": "Great tablet for adults. No parental controls for kids. Contacted manufacturer and they recommended an app. The app they recommended did not work well. Downloaded a different app, works great, however, netflix won't play with the parental control app. Have only had for two days, will try another app. Other than that the tablet itself is nice. Nice camera.", "Date": "December 28, 2013"}, {"Title": "Cool", "Author": "Lior", "ReviewID": "R2NZTU1O560HKH", "Overall": "5.0", "Content": "I love this little tablet, but i just dont like the screen very much. Its not expensive and i like the design.", "Date": "December 23, 2013"}, {"Title": "Thank you for your prompt response!", "Author": "Shavonn Pruitt", "ReviewID": "R36QLYSO7M0LQ3", "Overall": "4.0", "Content": "Thank you for your prompt response! I have not used the product yet because it is a Christmas gift for my nine year old daughter but I am sure it will be great for her!", "Date": "December 22, 2013"}, {"Title": "Great Gift", "Author": "Amazon Customer", "ReviewID": "R8O52QA9CPO5F", "Overall": "5.0", "Content": "I asked my mom what she wanted for Christmas and she told me a simple tablet.  All she wants to do is play Candy Crush.  She is not that technology savvy, but she will definitely be able to navigate this!!!!", "Date": "December 10, 2013"}, {"Title": "love it", "Author": "Lora", "ReviewID": "R1NA0Z1EVBILWE", "Overall": "5.0", "Content": "great value for the money. will make perfect Christmas present.  my son will love it.  will probably buy more products for Amazon", "Date": "December 8, 2013"}, {"Title": "Good for the cost", "Author": "Amazon Customer", "ReviewID": "R25NZB5WY323Q3", "Overall": "4.0", "Content": "I just got it in today n the only complaints are the touch sometimes takes a couple taps, also the charger looks like it's half hanging out.. But honestly it works really well so far. I would def buy this for someone is a great buy for the price!!!!!", "Date": "December 5, 2013"}, {"Title": "Wasn't worth it.", "Author": "Amazon Customer", "ReviewID": "R3J6NH3P4VD51M", "Overall": "1.0", "Content": "Bought this for my granddaughter for Xmas and I am not impressed. Poor battery life. Turning it on is difficult or it doesn't turn on at all. I have to plug it into charger when it doesn't turn on. No user manual to be found anywhere. I won't be buying another one. The only way to return it is if it's dead on arrival or box unopened, so I'm stuck with it.", "Date": "December 14, 2013"}, {"Title": "Wost Tablet Ever", "Author": "Adam Welin", "ReviewID": "R2YB4F5RD5EE8", "Overall": "1.0", "Content": "I read and did the app killer suggestion and it did not help out what so ever. And the internet sucked and lagged big time and it kept losing its connection with the wireless modem. and the screen resolution was very fuzzy and didn't look clear at all. and  I would like a refund if you could and I don't want to return it because I will have to pay for shipping and I don't want to. And I'm not joking around I am telling the truth. So if you could do that it would be very helpfulThank youAdam Welin", "Date": "December 13, 2013"}, {"Title": "Dragon Touch® 7'' Purple Dual Core Y88 Google Android 4.1 Tablet PC, Dual...", "Author": "marla", "ReviewID": "RIXCUPGS3OSJT", "Overall": "2.0", "Content": "Out of the four tablets that I have purchased in recent weeks, this one would connect to the wifi. Thanks", "Date": "November 20, 2013"}, {"Title": "Wow,what", "Author": "James Redinger", "ReviewID": "R162QW3QB1XND2", "Overall": "5.0", "Content": "U u j.  J h h h h.  Hi  hubby  h  minecraft xbox one shoot for the Dumbledore HEX to this entry through the Dumbledore to get out and time again in a car crash in this entry trackbac to this post is my last post a lot of duty I your Uruguay keflings in outer space and reply to this comment by the monster minecraft jetpack joyride for a lot of keflings in outer space and time to get a lot of duty", "Date": "April 14, 2014"}, {"Title": "sucks!!!!!!!!!!!!!!!!!!!!!!", "Author": "eldanador", "ReviewID": "R2JB9XKO5WFYHC", "Overall": "1.0", "Content": "Bad quality and resolution!! freezes to much.Color doesnt look good. Tt's ratchet, and the price is cheap but I dont recommend it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!The peoples think that's  tablet is good are Ron that garbage when you see nice tablet you know this is bad deal because is a little cheaper no way no buy that garbage tablet never en you live. Trust me  is more better u see your kids happy  do u feel nice,but buy this tablet  loose money  y u kids aren't happy. I want to return and said you need to way for the saler a probe this and never a probe for return that item and  my daughter tell me she want  u tablet but not that. So I lose money in this nasty tablet for cheaper and now I needed buy a nice table for my daughter. So my recommendation is no buy that sh.... and paid a little more money and your kids makes happy, very happy  I buy the kindle tablet for her.now is so happy nice resolution, more faster the Internet no frozen. And everything you see in this tablet is true Kindle and nice, the dragon tablet is a robed. Make your kids happy  no buy that bulshiet.....", "Date": "October 30, 2013"}], "ProductInfo": {"Price": "$99.99", "Features": "The DT Y88 featuring the newest powerful and robust Dual Core CPU with DDR3 ram, makes everything run faster than ever. Plus, high-performance Quad Core Mali-400 GPU ensures smooth and dynamic 3D graphics.\nGoogle Android 4.1 (Jelly Bean) OS reveals tons of new adventures to your Dragon Touch tablet. Get access to thousands of useful apps and fun games to download and install on you tablet with Google Play Store pre-installed. Micro SD card slot allows you to add up to 32GB extra space to store songs, videos, photos and other files.\nComparing with A13 Q88 model, Y88 has higher resolution Multi-Touch HD Screen with 1024x600 which makes ebook, photo, video look great.\nWi-Fi (802.11a/b/g/n) keeps you connected on the go. Front-facing camera makes it easy to chat with friends and family, while rear-facing camera allows you to capture the special moments and upload them to facebook and twitter.\nLive customer service and tech support from TabletExpress. Robust warranty, on-time customer service/tech support, frequently updated firmware guarantees customer satisfactory. Feel free to contact us whenever a question pops up in your head, we are always here to help.", "Name": "Dragon Touch® 7'' Green Dual Core Y88 Google Android 4.1 Tablet PC, Dual Camera, HD 1024x600, Google Play Pre-load, HDMI [By TabletExpress] (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/51Jdg-v9c%2BL._SY300_.jpg", "ProductID": "B00G3Q4FSI"}}