{"Reviews": [{"Title": "Good tablet for $100 or less!", "Author": "Scott351", "ReviewID": "R2KXG63T00UTS2", "Overall": "4.0", "Content": "I have limited experience with tablets (Ipad, Samsung, 'off-brands'), but I really like thisHP 7 1800 tablet so far.  As others have mentioned, the camera is terrible.  I don't use atablet for pictures, video, or skyping so it has no bearing on my rating...If taking pics/vidsare your 'thing', don't buy this tablet.  The battery life seems OK but I wish companieswould make these gadgets larger and install a huge battery!!* I like the charge jack being at the top so I don't damage the port while using and  charging at the same time.* Wish the earphone jack was on the side instead of top because wires always dangle  onto screen.* instruction manual is very \"WEAK\".  Beginners might have some trouble figuring out  how to operate the tablet w/o some guidance or internet research* tablet does not include earphones/buds but uses the standard 3.5mm plug", "Date": "December 16, 2013"}, {"Title": "Hangs with ipad mini..", "Author": "jamie turner", "ReviewID": "R2WO1WESWJSJLA", "Overall": "3.0", "Content": "Pretty damn good tablet. My wife has an iPad mini and  I have torture tested both-music, games, apps, and everyday tasks.The hp 1800 is still going strong since its Christmas arrival 2013. As for its features, the good things are its speed and connection.  The tablet is heavy and bulky, however can take being dropped.  The battery  lasts 5-6 hours max, and the camera sucks. It will make a good tablet for young children and older adults because of its ease and durability.", "Date": "March 24, 2014"}, {"Title": "Good tablet and can't beat the price.", "Author": "Denise", "ReviewID": "R2L4RTNC8D6ANV", "Overall": "5.0", "Content": "I've had one of these for a couple months now and really enjoy it. It hasn't given me any grief at all. The first day it wouldn't turn on but I let it charge overnight and it's worked perfectly ever since. I replaced an older nook with it and downloaded the nook app for android so I still get my newspaper every day and have access to all my B&N; purchases. I use it all the time with Hulu & Netflix with no problem. I enjoy Sudoku, scrabble, Backgammon, Gin, Spades, Hearts and that type of game and have basically everything from Concrete and AI Factory, and they all work perfectly. I do have a couple action games that play well on the tablet, but I really don't play them that often. Skype works fine. Overall I don't have any complaints and actually intend to buy another one for my son to have at school.By the way, you can get a case at Big Lots for $5. they will let you take your tablet into the store to try the cases for fit. Just make sure to let them know you're doing it.", "Date": "February 26, 2014"}, {"Title": "hp 7 1800 tablet", "Author": "Justin Bounphalaksa", "ReviewID": "RH7J5ZBJ7E8GH", "Overall": "4.0", "Content": "I have this product and I love it... The down side is that I can't find a case orscreen protector for it... Its also not compatible with the amazon app... It does everything you want it for good price just sucks how HP made a product and can't have a case....", "Date": "December 1, 2013"}, {"Title": "Love it...", "Author": "Jo", "ReviewID": "R1S95GTP92TGQM", "Overall": "5.0", "Content": "This little tablet does everything I need....  I can read my nook novels... check my email... search the web.. play games.  This is a perfect tablet for the price!  I am completely satisfied..no issues or problems.", "Date": "February 18, 2014"}, {"Title": "My Favorite Gadget!", "Author": "Prtsparta", "ReviewID": "R19TRCU6GS8CGS", "Overall": "4.0", "Content": "I got this at walmart as a black Friday deal around 50 dollars. It seemed like it would perform decent and the price can't be beat. I had it for several months now and love using it. It has only froze on me 2 or 3 times and that is when I would use it for hours and hours playing heavy games. It's huge selling point to me is the Intel Atom processor inside. It may only be 1.6 ghz, but my old computer that has an Atom processor is 10 years old and still works. And this one performs better!Pros:Light weight, more convenient then my laptopDoes everything my laptop can, and if I need to use a program on my laptop, I just use Team-viewer to remote control my laptop.Micro SD card slotBattery lasts hours playing games and watching moviesCons:Only 6 gigabytes of actual storage, and you can't put games on the micro SD card unless you root itSome high end games lag and are hard to play, not sure if it is my device, or the game itselfOverall I use this thing almost every day. It is fun to use and alot easier to use instead of lugging around my 6 pound laptop.", "Date": "February 15, 2014"}, {"Title": "Good tablet for", "Author": "Jason", "ReviewID": "R2UDN68A0MRJ92", "Overall": "5.0", "Content": "Bought this from Wally World around thanksgiving for my 5 year old. I wanted him to be able to listen to music, play games and watch netflix on it so I could get back my iPad. Works outstanding for this purpose. I sometimes wish I bought two since I am always wanting a small android device to connect to bluetooth obd2 car adaptor. It has downloaded and run every game so far. Works just as good as iPad with apps I purchased it for. Only drawback is no case available. At 89.00 purchase price, I am not too worried since I intended this to be a starter tablet for my son.", "Date": "January 5, 2014"}, {"Title": "$100 gateway", "Author": "jhuang11", "ReviewID": "R2M5IP9LR56VER", "Overall": "4.0", "Content": "I did not purchase this off amazon and instead bought it elsewhere as I also received a promotional $20 giftcard to that store. For $100, you get all the basic needs in a tablet, a device that will browse the web, check emails, android apps, and a front/rear facing camera should you really need to take a picture or skype with someone. Average battery life after a few weeks of usage is around 4 to 5 hours, more if you're not constantly running games on it. 8 gb storage is definitely small by today's standards, but that is easily remedied by a sd card . My main concern for this tablet is I wish it (will/might\") receive android updates as 4.1 is rather stale once you've experienced 4.4.2. Another minor nitpick is that the screen resolution is rather awkward at 1024x600, but I can understand the lower resolution due to the lower price. I am still mainly a desktop, ultrabook, and cell phone user at my core, but I can see this product being great for children. For $100 you get durability as it is rather sturdy so it should survive a drop or two from children should the events arise, all the basic needs of a computer in a small form factor. But we should all remember that this is by no means a premium top of the line product and shouldn't be judged as such. It is priced and positioned as a low cost entry tablet. For those looking to venture into the tablet world, this would be a great value deal if you don't want to commit too much into a tablet, but just want a taste of what a tablet can do and feel like or if you just want a taste of the android experience.", "Date": "February 26, 2014"}, {"Title": "love it", "Author": "blondb", "ReviewID": "R1DOGPMWJFXBZS", "Overall": "5.0", "Content": "I love this tablet and I have alot of experience with high and low end tablets becuase im always buying them to see what I like and don't like. Well this tablet is very responsive its even faster than my samsung tab 2 10.1 and I paid over 350 for that tablet and it freezes on me but this tablet has never froze on me as of yet iv had it since dec 2013 the camera sucks but it sucks on most tablets high or low end the battery life runs about 5 hours heavy use. Its compatible with most apps like netflix temple run etc... its light weight It doesn't have many features as the high end tablets but for 89 dollors trust me when I say you will be happy with this tablet for sure", "Date": "February 5, 2014"}, {"Title": "For the price you can't go wrong!", "Author": "Nate Hales", "ReviewID": "R2CY8QP1UDOLWQ", "Overall": "5.0", "Content": "This is a good price point tablet. Something that the kids can play with and you aren't always worried about them breaking it.", "Date": "December 17, 2013"}], "ProductInfo": {"Price": "$149.00", "Features": "Expandable up to 32 GB\n7-Inch 1024x600 TN LCD Touchscreen", "Name": "HP 7 1800 7-Inch, 8 GB Tablet, Expandable to 32 GB (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41J4YzgdhVL._SX300_.jpg", "ProductID": "B00GZVE76G"}}