{"Reviews": [{"Title": "Was wary at first", "Author": "spin", "ReviewID": "R35CINJLDJS8ZV", "Overall": "5.0", "Content": "I don't usually treat myself but I have been interested in the iPad mini for a while. My sister and her husband both have had theirs since early last year and have had nothing but great things to say. After seeing the high quality pictures taken by their minis on my graduation day, I knew I had to get one. Question was: should I buy the more expensive new retina model or the one that was closer to my budget? I read some discouraging reviews about the clarity of this screen but, being a newly graduated broke student, I decided to \"settle\". I am glad I did! The screen is excellent , I find the games to have wonderful clarity and my videos and websites load quickly and efficiently. I think the reviews are simply a case of \"the new screen is better so now mine seems poor in comparison\" I have had it for two weeks no and am enjoying every second of it! I also bought the square trade warranty, as I have heard the glass screens of apple products are prone to breaking when in the hands of a clumsy  person like me!", "Date": "January 10, 2014"}, {"Title": "Love this", "Author": "jennifer", "ReviewID": "RRAVYRDRVYK4F", "Overall": "5.0", "Content": "As always Apple has a great product. Last year I debated buying an iPad or a kindle fire I bought a Kindle Fire and after about 6 -7months of use the kindle started having problems and here I am reviewing an iPad mini. I am not tech savvy but I can say this is definitely very user friendly . It is light weight and very portable and I can easily take it anywhere I need to go.", "Date": "December 18, 2013"}, {"Title": "Awesome!", "Author": "DoxieMom", "ReviewID": "R1TKNA73DWJ12G", "Overall": "5.0", "Content": "Great product, great price, great shipping. It  has no problems and is used daily. I recommend it for anyone who is a student or who travels. Nice and compact.", "Date": "March 3, 2014"}, {"Title": "Cheap price for real iPad", "Author": "Miss Mika", "ReviewID": "R2VPTITQ9MH784", "Overall": "5.0", "Content": "Nothing necessary to write other than this is an Apple iPad. No knock off product. Shipping was fast. Box was sealed with all accessories inside. Great.", "Date": "March 7, 2014"}, {"Title": "Tried an Andriod but I love my new ipad mini!", "Author": "Kathleen M. Kinyon \"book lover\"", "ReviewID": "R35LNOYPAHMP2M", "Overall": "5.0", "Content": "Tried an Andriod but I love my new iPad mini!  I travel often so this is turning out to be great for reading, playing games, email, paying bills when on the road.  Fits in my purse and holds a charge longer than device I have had.", "Date": "March 1, 2014"}, {"Title": "Best for work and Play", "Author": "BioHazard", "ReviewID": "R3E1B7SO06GXNB", "Overall": "5.0", "Content": "Love the IPad mini. i travel a lot and this is easy to grab and go. This has everything I need from both work and personal use. I never thought I would get something that is so small but one of the most productive item I own. Also my kids love play the free games that they download for the ITune Store. If you don't own one you are missing out.", "Date": "December 24, 2013"}, {"Title": "Mini iPad", "Author": "Sharee", "ReviewID": "R2PUK2XZKAW1VM", "Overall": "5.0", "Content": "My girls got these for Christmas and they were a big hit! We also liked the idea of them having something with a bigger screen than the iPod. Looking a the cost of an iPod verses iPad there's only a thirty to fourty dollar difference so to us it made more sense to get the iPad mini.", "Date": "January 3, 2014"}, {"Title": "Ipad Mini", "Author": "Kellie", "ReviewID": "R2FXSTL8PI21ZK", "Overall": "5.0", "Content": "Love my ipad mini. Never thought I would use a tablet or ipad but now I never even use my laptop or desktop anymore", "Date": "January 14, 2014"}, {"Title": "iPad mini", "Author": "stonehenge", "ReviewID": "R2MW6CLFTCD1AV", "Overall": "5.0", "Content": "I bought this for my husband as I have a full sized iPad that he kept stealing. Chose the mini as he travels a lot. He was thrilled with it. Great size.", "Date": "April 18, 2014"}, {"Title": "I'll never look back!", "Author": "Whistler's wife \"whistler's wife\"", "ReviewID": "R127EUWH9629HP", "Overall": "5.0", "Content": "I purchased a Kindle HDX last fall mostly because of its price. I was wanting an alternative to a laptop that was portable and that I would use primarily to do FaceBook, Pinterest, email, some general web surfing and to shop. (I'm value conscious, plus I'm someone who generally resists jumping on the latest bandwagon with the masses, which is sort of how I viewed the ipad and overall Apple craze.) I am not particularly high tech, as I come to the tech world late, having done less than the average amount of work with computers in my work life. But I thought I was getting along all right with utilizing its functions. Then a fortuitous thing happened: I dropped my Kindle and the screen shattered irreparably. It had begun to feel like a \"necessity\" so I was keen to replace it. The ipad mini had gotten my attention - and the price was better than I'd expected, so I took the plunge and got it. Wow - what a difference! Interfacing with the ipad technology is intuitive and IT JUST WORKS BETTER! The Kindle was cumbersome in some intangible way that was not readily apparent until I used the ipad. Now I'm thinking my next PC will be Apple. I LOVE my ipad!!!", "Date": "April 8, 2014"}, {"Title": "Cute", "Author": "R. Serey", "ReviewID": "R2NFMQ2OMG9WEY", "Overall": "5.0", "Content": "I know this isn't the latest and most expensive iPad but it does the job! I am very money conscience and wanted an iPad for awhile and finally splurged on this one! I am very satisfied. Although the packaging it came in had me really confused due to the iPad box being dusty and the protector screen being really \"bubbly\" in appearance made me think that I may have boughten a refurbished one? I hope not!", "Date": "April 14, 2014"}, {"Title": "Nice tablet", "Author": "Hazel", "ReviewID": "R3JGOVWYZO8R4I", "Overall": "4.0", "Content": "As with all Apple products, the mini is designed well and easy to use.  Fits my needs well. I had an iPad first version, and I do miss the larger screen, but the mini can take excellent photos and is better for reading.  I do like the Kindle app and accessing my library via the iCloud.", "Date": "April 13, 2014"}, {"Title": "Terrible packaging", "Author": "Robert L. Tuftee \"Controlling Rage\"", "ReviewID": "RKI938PO62JB8", "Overall": "3.0", "Content": "I love the iPad but , I was extremely unhappy with the package my iPad came in it was just a piece of folded cardboard! No bubble wrap or anything", "Date": "April 11, 2014"}, {"Title": "Love the iPad mini", "Author": "C. Ratcliff", "ReviewID": "R3HI5FCCB4O9ME", "Overall": "5.0", "Content": "I live out of the iPad mini with the Logitech keyboard...all other keyboards I tried (3 total) failed...the Logitech really works. The screen is really large enough for research, movies, email, typing most anything...and lots of apps...", "Date": "April 10, 2014"}, {"Title": "Three cheers for the mini", "Author": "Stephen G. Baime", "ReviewID": "RCUXV6XDS2AKY", "Overall": "5.0", "Content": "The iPad mini is the perfect size. Big enough to read emails, etc., easily but small enough to handle  and transport easily. My wife has the regular iPad, and I find it cumbersome to hold and type on.", "Date": "April 1, 2014"}, {"Title": "Best by a mile", "Author": "larry vanderpool", "ReviewID": "R4GPQ20UUILF5", "Overall": "5.0", "Content": "I have had two android tablets, neither we're close to this iPad.  It is better in every way.  I see the androids only as cheap imitations.", "Date": "March 25, 2014"}, {"Title": "Perfect Gift", "Author": "livskeet", "ReviewID": "RZU99MJNNNOIU", "Overall": "5.0", "Content": "I bought this gift as a late christmas present for my girlfriend and she loves it! She takes it to class with her everyday and doesn't go anywhere without it! It came as scheduled and exactly as described. The mini is perfect size and does exactly what i need it to!", "Date": "March 11, 2014"}, {"Title": "Thumbs up", "Author": "PRD", "ReviewID": "R1TTIHOP9MK8AW", "Overall": "5.0", "Content": "Rushed and bought this for my mom for her birthday at the last minute. Arrived on time and she loves it. Great choice.", "Date": "February 13, 2014"}, {"Title": "I love it !", "Author": "Donna J. Hallock", "ReviewID": "R2Y0TPS4K27NSG", "Overall": "5.0", "Content": "Never had an Apple product before, but I just love my iPad mini. It is convenient to carry in your purse.", "Date": "January 23, 2014"}, {"Title": "Loving it", "Author": "Alice Wildermuth \"erie09\"", "ReviewID": "RCGCC03TLTY3W", "Overall": "5.0", "Content": "The ipad mini has been everything I've hoped it would be. My only complaint would be that it doesn't come with a manual although, yes, I know I can download one.", "Date": "January 31, 2014"}, {"Title": "excellent item", "Author": "stephanie", "ReviewID": "R3PWB4B6CE3RSP", "Overall": "5.0", "Content": "I just love it. The I-Pad is very easy to handle. The battery life is high. The touch screen is really quick.", "Date": "January 27, 2014"}, {"Title": "Disapointed", "Author": "A. D. Gorman \"Hooligan\"", "ReviewID": "R1YOBGE8U3XIAZ", "Overall": "1.0", "Content": "I ordered this via Prime. Was super happy as it was a gift for someone. No notification on the shipping until I got an email stating this is no longer available. Nothing shipped. Took three plus days rather than any immediate notification. No idea why this would still be posted as there are none left according to amazon. Very disappointed with this as a Prime member as everything else I order on Amazon, was updated and shipped. Not sure if this was the company itself or amazon but be wary as you can be waiting for your purchase and plan on it, to not have it show at all let alone be purchasable.", "Date": "May 13, 2014"}, {"Title": "Love it", "Author": "Brandon Deleon", "ReviewID": "R24MWV6KHAJTUD", "Overall": "4.0", "Content": "It was everything I expected it to be easy to work I would recommend it to anyone love it love it", "Date": "January 27, 2014"}, {"Title": "Perfect size", "Author": "kyle landcastle", "ReviewID": "RCK9MRB2QMNAX", "Overall": "5.0", "Content": "I got this iPad as an upgrade from my iPad gen 1. I absolutely love it. It's not big and bulkey like other iPads.  It fits perfectly in your hand and the operation system works flawlessly.", "Date": "June 9, 2014"}, {"Title": "Love it!", "Author": "grammac", "ReviewID": "RUYHMFM1WCMZ0", "Overall": "5.0", "Content": "I use it everyday...I have downloaded the Kindle app. so I can read, access my email, facebook etc. and it is so small it fits in my purse.", "Date": "June 6, 2014"}, {"Title": "All functioning well -- serving our purposes", "Author": "David Jackemeyer", "ReviewID": "R2KJBS6MGKS3CX", "Overall": "5.0", "Content": "We are conducting a scientific inquiry into the impact of MyFitnessPal, Striiv Play, and the Breezing Tracker (all Paired or App-enabled via these iPad Mini's).These Mini's are 1st generation Mini, non-Retina screen.For under $300 shipped, you get a fairly snappy tablet shipped with iOS 6+.(I prefer iOS 6+ even after extensive use on 7+) Once you update, there's no going back! ;)Great battery life.Decreasingly intuitive as Apple clearly tries to compete with the Android drive to encourage OPtions OPTions OPTIons.Beware, FOMO may continue to factor into your lifestyle...", "Date": "June 4, 2014"}, {"Title": "This is awesome", "Author": "J. B.", "ReviewID": "R3FI8T31QS0FCP", "Overall": "5.0", "Content": "I got this to be able to work on music on the go and just stay in touch with the family around the world.it serves my needs and whenever I want I can set it up to play games , watch movies or work on my music .it is fast enough for my usage and light so I love carrying it around when I have gigs now I don't need to have all the music sheets on stand , I just use the iPad .Not all the apps I use work flawlessly but it is all manageable. It is a blessing to have all those things at my finger tips .", "Date": "June 3, 2014"}, {"Title": "i am a happy costumar", "Author": "anthony swope", "ReviewID": "RB6CTJ1JPOSVX", "Overall": "5.0", "Content": "I love my apply iPad mini still working I love it... Thank u amazon for having the apply mini iPad for a good price thank you", "Date": "June 3, 2014"}, {"Title": "How these became the Apple of the user's eye...", "Author": "S. Hammill \"shammill\"", "ReviewID": "R1XP8XJP8523UK", "Overall": "3.0", "Content": "How these became the Apple of the user's eye I'll never know! It is a well-made device, but IMO, it is no better than other tablets.", "Date": "June 3, 2014"}, {"Title": "It's no Mini!", "Author": "cyclops", "ReviewID": "R1AMER0RPTSFBV", "Overall": "5.0", "Content": "nice substitute for laptop and home pc.  Operating system and all apps  work great!  very much pleased with  unit, would recommend to friends and family.", "Date": "May 28, 2014"}, {"Title": "Wow...", "Author": "Danielle", "ReviewID": "R2B5DF6OMX0EAS", "Overall": "5.0", "Content": "I couldn't be happier with the ipad mini.  It's faster than both my first generation ipad and my iphone 5s.  Happily surprised.  I'm also a student who has to carry a lot of things with her so I'm loving that it's also lightweight and small.", "Date": "January 18, 2014"}, {"Title": "Excellent Device", "Author": "Cheryl C. Malandrinos \"johnnycat15\"", "ReviewID": "R24QB3X8WA2XKG", "Overall": "5.0", "Content": "Our daughter is thrilled with the iPad Mini. More cost-effective than the larger units, it provides her access to all the Apps she enjoys and a larger viewing screen than her iPod. That you can sync both devices is a big plus.", "Date": "January 17, 2014"}, {"Title": "New and Awesome, but it came Black", "Author": "V", "ReviewID": "R23WSATY9KZSRF", "Overall": "4.0", "Content": "This is the real deal. It comes brand new and with the 1 year Apple warranty. Only thing is it wasn't Space Grey, it was Black...The box was a little beat up.If this is what you want, I would recommend to get it before it is gone. It's an awesome product and there are apps that will run JavaScript that are free and it's good for school and work.", "Date": "January 22, 2014"}, {"Title": "Had to take to Apple store", "Author": "Bernice Wilson-Newman", "ReviewID": "R2TUWMCUK7WYFQ", "Overall": "3.0", "Content": "At first it worked good, however after 2 weeks I had to take to the Apple store for a replacement. There was something wrong with the touchscreen", "Date": "April 15, 2014"}, {"Title": "GOOD", "Author": "Debbie Patterson", "ReviewID": "R2BPKFD2NQKLNU", "Overall": "4.0", "Content": "THIS WAS A GIFT  HER REALLY LOVES IT  I THINK APPLE IS A LOT PRICEY THE SHIPPER IS GOOD THOUGH APPLE IS RIPPING ALL OF US OFF", "Date": "April 14, 2014"}, {"Title": "our son loves this", "Author": "Megs \"Megs\"", "ReviewID": "R2C9ONIW6Q4IFJ", "Overall": "5.0", "Content": "we bought our son this mini because his ipad 2 was not working...he loves it, we love it...great picture and it if very easy to carry around.  love this!!", "Date": "March 12, 2014"}, {"Title": "Beautiful electronic!", "Author": "T. Green \"trjgreen\"", "ReviewID": "R3SHDVYQH0QXXF", "Overall": "5.0", "Content": "I really liked the look of this ipad mini.  It was a replacement for my granddaughter.  This was a very good price and arrived in perfect condition.  I would recommend this item to anyone looking into investing in an ipad.", "Date": "March 8, 2014"}, {"Title": "I love it.... Worth the price", "Author": "Samuel Alice", "ReviewID": "R35ZDXTAN8LYQM", "Overall": "5.0", "Content": "It's everything it looks like and exactly what you would want.... I definitely tell my friends to get an iPad", "Date": "March 8, 2014"}, {"Title": "Just as ordered", "Author": "Marlene", "ReviewID": "R2XLH0WMVNKUAR", "Overall": "5.0", "Content": "This was a great purchase.  Exactly what I was expecting.  No complaints here.  You'll enjoy this product. Clear screen and packaged well.", "Date": "February 26, 2014"}, {"Title": "LOVE IT!!,", "Author": "R. L. Gauthier", "ReviewID": "RRGW9TJRTOVKL", "Overall": "5.0", "Content": "This device does everything that I needed and more. I have come to rely on it daily. The size is much better than a small phone to work with, but handy enough to fit in my purse or even a large, interior pocket in a coat.Highly recommend the iPad mini.", "Date": "February 21, 2014"}, {"Title": "Apple iPad Mini", "Author": "Susan Faeth \"NYC Girl\"", "ReviewID": "R1ZXVZPSSNUP5C", "Overall": "5.0", "Content": "I bought this for my son for Christmas because he continually used mine!  Great tablet.  Easy to use and great for travel and reading books.", "Date": "February 20, 2014"}, {"Title": "Like it!", "Author": "EL", "ReviewID": "R1EHDXQ2AQ7TLW", "Overall": "4.0", "Content": "My husband buy this to replace his stolen Ipad, he like it very much! except no net work data for this one.", "Date": "January 22, 2014"}, {"Title": "SPACE GRAY!!!!! Wow", "Author": "cindy nguyen", "ReviewID": "R3M7HXDDE5E4FU", "Overall": "4.0", "Content": "I look this up and there is no such thing as space gray ipad mini there is only black and slate or white and silver so yeah.", "Date": "February 28, 2014"}, {"Title": "Perfect transaction", "Author": "Elizabeth W. Case \"lilmalice\"", "ReviewID": "R2JZBS7LOCHR6K", "Overall": "4.0", "Content": "Perfect transaction! The product exceeded my expectations and arrived quickly. I even sold my Kindle after using my new iPad mini for just 2 days!", "Date": "February 17, 2014"}, {"Title": "Birthday gift win!", "Author": "Kimberley", "ReviewID": "R2ISMSCW4OK9GB", "Overall": "5.0", "Content": "I succeeded at surprising my husband with an A+ birthday gift for once,  and with speedy shipping and the great price! I was thrilled!", "Date": "March 9, 2014"}, {"Title": "Great for our small business", "Author": "MashED tomATO", "ReviewID": "RNV7R3NWIBQTL", "Overall": "4.0", "Content": "We got this iPad Mini to use for our business since most apps run on Apple devices.  It has worked well for this purpose.  It sometimes lags and reboots a program quickly, but no issues other than that.", "Date": "February 26, 2014"}, {"Title": "Love", "Author": "Angels \"Ava's Mom\"", "ReviewID": "R3GVT9107E7PMU", "Overall": "5.0", "Content": "I love it. It's slower than my I iPad 2 but I like this size much better! It has less ram, it's to be expected.What more can I say? It's an iPad. Aside from the fact that it's not compatible with the good plug ins like flash player, and that Apple refuses to collaborate- it's the perfect tablet.Man I wish it was Word compatible. It's the only leverage that the Surface has....And I seriously considered the Surface and the Vivobook as a student. But in the end, Apple won- again.I ended up buying a new laptop just so I didn't have to replace my iPads with a competitor!", "Date": "December 27, 2013"}, {"Title": "Great product, poorly packaged", "Author": "Jules a quinn", "ReviewID": "R2FA5RBSPJWK5Y", "Overall": "3.0", "Content": "Came brand new just as described.  Was just tossed in a large box with not padding or stuffing. If I did not live so close to the seller there would have been a very big possibility that this would have become damaged during shipment", "Date": "January 30, 2014"}, {"Title": "apple i pad", "Author": "Susan Wallace", "ReviewID": "R1WJGWTBA3I6LA", "Overall": "3.0", "Content": "I like it but it doesn't have a place to put a sims card so it can be put on my cell plan, had I known this I would have bought a different one. I can only connect with a wifi.", "Date": "May 4, 2014"}], "ProductInfo": {"Price": "$299.00", "Features": "7.9-inch LED-backlit Multi-Touch Display; 1024-by-768 Resolution\nApple iOS 6; Dual-Core A5 Chip\n5 MP iSight Camera; 1080p HD Video Recording\nWi-Fi (802.11a/b/g/n); 16 GB Capacity\nUp to 10 Hours of Battery Life; 0.68 lbs", "Name": "Apple iPad Mini MF432LL/A (16GB, Wi-Fi, Space Gray )", "ImgURL": "http://ecx.images-amazon.com/images/I/41cj7JJgQEL._SX300_.jpg", "ProductID": "B00GRACUXM"}}