{"Reviews": [{"Title": "A review based on what I've seen", "Author": "Anastasios Mironidis", "ReviewID": "R4S51P1DS8CFI", "Overall": "2.0", "Content": "I (son of the owner of this account) babysit these 3 kids who got these tablets, each their own. One already would not charge so they had to get it fixed. Performance wise, this thing freezes and stutters while playing simple games like temple run. It is very slow and I can easily see this getting even slower in the near future, possibly even dying. Asthetically, however, it is actually quite nice, with this soft back that feels much nicer and higher quality than even a samsung tablet's back cover. Another good thing is that it keeps the kids very satisfied with playing it. They don't mind the freezes, and they seem to have a lot of fun using them.In summary, it's pretty bad and I'd only recommend it for a kid.", "Date": "January 5, 2014"}, {"Title": "Horrible Tablet", "Author": "Amazon Customer", "ReviewID": "R17DAWCZS5T4RI", "Overall": "1.0", "Content": "I bought two of these solely for the purpose of my kids playing games on them.  One of them had a charger that didn't work right out of the box.  It took hours to load a few games because it was so slow.  I added additional sd cards for storage but nothing could be moved to it.  Most apps either couldn't be loaded or once loaded, wouldn't play at all because of the storage issue.  I contacted customer service but you must have a pc (I only have a mac) and you have to wipe the tablet and reload everything back on it, including built in apps, to get the storage issues worked out.  Since I couldn't do that, I just returned the 2 and purchased one good tablet.  Even on sale for half off, this tablet wasn't worth it.", "Date": "January 23, 2014"}, {"Title": "Good for its price", "Author": "Maria Gamarro-Lopez", "ReviewID": "R12UVBTQ5Y6IEN", "Overall": "3.0", "Content": "Not very good picture but it gets the job done. For its price overall good. Get a memory card for added storage", "Date": "February 10, 2014"}, {"Title": "Yes, I Really Do Hate It", "Author": "FBledsoe \"Silver Smith\"", "ReviewID": "R3APK69HS7FON1", "Overall": "1.0", "Content": "These come loaded with apps you'll use, but the price you pay for that is it is also loaded with bloatware (apps you will never use), kids books, a movie, some lousy wallpaper designs. All of this takes up space you need for your own apps and files. Too bad, you cannot remove it. When you have a question you can find answers on the web and they are better and more plentiful than the FAQs on Digital D2's website. There are no screen protectors of the correct size made for the tablet, and only one very loose fitting case that lets the tablet slip around, hiding the camera lens and power button.A lot of apps won't run on the tablet (too numerous to mention). For example, while the tablet specs meet the requirements for Skype video calling, the tablet will not do video calls. It only supports voice calls and IMs IF you buy Skype credits. I NEED Skype video calling, period.The power adapter is a wall unit without a USB data/power cable. The charger has wall plug on one end and round power plug on the other. The USB data cable is separate (it is included). This makes the odds of losing your data cable much higher.The one I received had other technical problems, too annoying and numerous to mention.CUSTOMER SERVICE from the Digital D2 company's tech support line IS TERRIBLE. Reference the Skype issue above. I called the support number, waited on hold for over fifteen minutes and when my turn came, I explained the problem to the tech support rep. She said she would have to have her manager call me back as she didn't know anything about this issue. I got my callback a couple of hours later from her manager and explained the problem a second time. He told me, \"You should call Skype about the problem because this is a software issue and we only make the tablets.\" NONSENSE. NONSENSE. NONSENSE.If you're considering this tablet, don't. What you should do is take a hammer and strike your forehead repeatedly until you come to your senses.", "Date": "October 10, 2013"}, {"Title": "The Best 7 inch tablet out there!", "Author": "Joseph Joa", "ReviewID": "R1EPSATTZOYDV4", "Overall": "5.0", "Content": "Great little tablet! I had an ASUS Transformer Infinity, which was also great, but too large to be very portable. This Digital2 Tablet is just the right size! The only thing that I suggest is: Don't buy this tablet if you want it for a camera, the camera setup is horrible with low quality. However taking photos with ANY tablet is kind of lame looking....use your cell or better yet buy a real camera. Amazon is the place to buy it also!!", "Date": "December 31, 2013"}, {"Title": "very thin glass window", "Author": "Deb", "ReviewID": "R1TVAK6S9FB9O2", "Overall": "1.0", "Content": "I bought this for my 6 year old grandson. He was playing a game that required him to use the device as a steering wheel and his thumb as the excelerator.  His thumb CRACKED the glass. Had I not been sitting next to him, I wouldn't have believed he didn't step on it.the 'shatter shape' is not a foot. I don't recommend this for kids no matter HOW well they take care of their things or how smart they are. The glass is thin.", "Date": "April 26, 2014"}, {"Title": "Digital 2 D2-927G PK 9 Inch Tablet-Super great little tablet Highly recommend 9 inch size", "Author": "Jeri J Agee", "ReviewID": "RHWVCWWRY1PM5", "Overall": "5.0", "Content": "This is a great little tablet! Bought for my daughter at Christmas and now here it is April and it was working great until I neglectfully left it on the floor and stepped on it cracking the screen.  This tablet worked great, The only time it was ever slow is when we tried to use the Mee Genius and educational apps that came preloaded.  I have WiFi at my house, it is a hotspot we have frontier and it worked perfectly when surfing the internet or playing games from google apps or watching netflix and had no problems with it at all.  It was not at all slow. You have to plug it in and charge it overnight when you first get it before you use it or else you wouldn't get maximum life out of the battery.  But we did that and the battery continued to charge and hold a charge beautifully for the 4 months before I carelessly stepped on it. I am going to try a different tablet but if it doesn't work perfectly I will just buy another one of these because it was an awesome little tablet.", "Date": "April 22, 2014"}, {"Title": "It's okay", "Author": "Corey", "ReviewID": "R2HZI5X21WFG0X", "Overall": "3.0", "Content": "It is okay just not what I really thought it was. Bought two and one of them hangs up alot.", "Date": "February 23, 2014"}], "ProductInfo": {"Price": "$79.99", "Features": "Android 4.1 Jelly Bean, 7 inches Display\nAll winner A4 1 GHz\n1 GB Flash Memory, 512 GB RAM Memory\n0.66 pounds", "Name": "Digital2 Deluxe 4GB Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/41K4LjPFd-L._SY300_.jpg", "ProductID": "B00GGAGQT2"}}