{"Reviews": [{"Author": "Kyle \"cylem\"", "ReviewID": "R199EZLBTC7250", "Overall": "5.0", "Content": "Well the Acer W3 came out and it looked really awesome! I mean windows on a little 8 inch slate, with a zippy atom, and a great price tag. Well unfortunately after trying it for some reason Acer had gone with the shoddiest screen known to man, with 0 viewing angle. Beyond that, for some reason they chose to have a proprietary charger unique to the device instead of using micro usb port (to some this is good, as it leaves the usb port taken but i and many others prefer usb charging). Acer is trying to bring back the series and redeem itself, so lets find out if they have.Design: I would say out of the recent 8 inch windows tablets, Acer has the most different looking. Most of tablets are very symmetrical but the acer has a grey lip coming out of the bottom with a physical windows button. This is better than having either a capacitive button, or a button on the side of this device, i prefer Acers design on that front. No buttons on the left, bottom has micro usb (for peripherals, and for charging this time around), and a headphone jack. The right has, volume rocker, micro hdmi, and a micro sd slot, top only has a power button. This design is good however the only bad thing i can say is compared to the other slates, the w4 is a little chunky. It has a lot of bezel on the top and bottom which i could live without. It weighs under a pound and isn't quite as thin as an ipad but it's probably not much more thick than your phone.Display: The display is really great, they added an IPS screen in this time. Viewing angles are great, the colors look fantastic to me, and i don't notice much bleed at all. The screen is extremely bright as well, right now using it in my decently lit house i have it at the lowest it can be and i have no strain at all.Storage: This it seems like acer did better with as well. I did a crystal mark on it and for instance my sequential and 512k were177 Read/ 145 Read and 58 Write/ 43 Write. Compared to the Toshiba encore (and most other atom tablets from my research) the Toshiba scored 93 Read/ 85 Read and 44 Write/ 39 Write. So they seem to have put in a decently speedier Emmc memory chip in giving around double read speed, and a decently faster write speed.Battery life: The battery has been better than expected as well. I ran a netflix battery rundown test and got about 9 hours of battery life. During normal use, installing applications, web surging, email, light gaming I saw around 9-10 hours of usage from my estimates, which is better than acers claim! I monitored the standby overnight and it lost like 3 or 4 percent which isn't bad at all either.Software: Acer loaded a few bloatware programs, but nothing really to bad. It had some things i wanted loaded as well like hulu and netflix apps. But I would give them probably a 7 out of 10 on the bloatware scale, 1 being the worst and 10 being the best.Performance: Bay trail has done wonders for the tablet market. The predecessor Clover Trail was good on metro applications but if did desktop work you saw the performance decline a lot. However with this Z3740 i have almost no lag, day to day things i barely notice a difference from my desktop . While larger applications for photo editing, video editing, gaming would obviously show the speed differences this is great for a .9 lb , fanless, 10 hr batter,  8 inch tablet.I did a little benchmarking, and game testing.Cinebench 11.5: Cpu: 1.18  GPU: 6.4 fps3dmark Ice Storm: 14kPeacekeeper browser test: 1137Games:League of legends: 30-60 fps lowest settings, runs very playable, very few slowdowns.Walking Dead Season 1: Ran 40-60 fps on low , no issues would definitley be able to play without issues.Titan Quest: Ran around 30-40 fps seemed pretty playable easily.Mass Effect 2: low settings and fps this seems like it could be playable, around 30fps.The first laptop i ever bought right out of highschool around 8 years ago was an acer. They weren't as well known then, but i really liked their quality ever since (even if they have a few bumps *cough* *cough* W3). I put my faith in them again and was not dissapointed in my choice. The W3 does a decent bit to stand out from the crowd giving a bit of reason to spend some more on it over something like the dell venue 8. It has a leading battery life, HDMI, faster storage speed, and probably the brightest display. Hopefully acer keeps the quality up, the W4 gets 2 giant thumbs up from this guy.EDIT: I just bought the keyboard made for the acer w3 and it indeed works great for the W4, it docks in at the top fine and it slots into the back of the keyboard just like the w3 did.", "Title": "Really great job renewing my faith in Acer after the W3", "Date": "January 3, 2014"}, {"Author": "Allen", "ReviewID": "R10PV6ZIS0LANS", "Overall": "4.0", "Content": "I use this more like a netbook. But if you did want to do work you but would probably want to hook to TV. Win 8 has taken very little to get used to. Listening to all the complaints I thought it would be very hard but all it is win 7 with a tablet friendly metro on other side. I see the complaints coming from desktop users. Back to w4. Very good build. Hdmi is a must on one of these 8 inch tablets. Runs fast enough for me, mostly web, music and video. App store needs help. Games.... well that's what my nexus 10 is for. Screen gets very bright. Worth 300.00 dollars? Hell yes!", "Title": "Nice", "Date": "March 14, 2014"}, {"Author": "db258", "ReviewID": "RZQG4ZFZ4U5O5", "Overall": "1.0", "Content": "I sold my Iconia W3 a month ago and have been waiting for the W4 to be released.I just received my W4 today. I debated if I would buy the Dell Venue as it is cheaper. The difference between the W4 and the Dell is, the Dell Processor runs a Atom Z3740D while The Acer W4 has the Atom Z3740. The difference is the Dell doesn't support dual channel memory and the acer does.  The Acer W4 has a Hdmi port as the Dell has no such port.The screen size of the W3 is 8.1 vs the W4 8 in screen. There is no noticeable difference losing .1 inches. The processor is quick compared to the slow dual core of the W3. I ran 3dmark03 on both tablets. The W3 scored 1999 while the W4 scored 4871. The hard drive on the W3 benchmarked around 50 read and 50 write while the W4 wrote at 70 and read at 178. The viewing angels were much better and I would say flawless on the W4. I did insert a micro 64 gb sd card and it works find.The reason I only gave it 4 stars is that there is no separate charging port. If you want to use the usb port, you have to run on battery power. The Iconia w3 has its own power port in addition to a usb. The Dell Venue and W4 are alike on this. The usb will power an external usb hard drive. You cant find a case or keyboard at the time of this review. Im forced to prop the tablet in the box it came with. I suppose a W3 keyboard would work for it.If dual channel memory support and a HDMI port is worth the extra $65 then you should buy the W4 of not, the Dell may be a better buy.UPDATE: Ive had this tablet for a week now. I have had to reset back to factory settings 6 times. I will get the blue screen of death 5-6 times a day. As you know the blue screen of death is caused by faulty hardware. Its not the same error. Im getting up to 10 different errors. The bluetooth will not keep the mouse active no matter what settings I set it to. You cant shut the screen off without setting this to standby. I know amazon will charge me a 15% restocking fee to take this back but this is as bad as my e-machine I bought in 1999. Im starting to regret selling my Iconia W3. It didnt have any of these problems. Sure the screen was not so good, and a little slow, but I never got an error.Update #2. Acer released their 3rd bois as well as their 3rd driver pack since releasing it a month ago. Still the Bluetooth lag is worse than ever. Many people on the net suggest fixes but none work. The screen orientation is till wrong for some apps and programs. You still cant turn off the black light on the tablet without sending the tablet to sleep. My hopes is that one day Acer will fix this, until then, I suggest you hold off purchasing it.", "Title": "Better than the Iconia W3/ Updated", "Date": "January 2, 2014"}, {"Author": "Anon \"Chimbazwe\"", "ReviewID": "R3VB3JU3PRHUNC", "Overall": "4.0", "Content": "I had an ACER A500 10\" tablet which I was very satisfied with. It was stolen when my house was burglarized. So after much dithering about what to replace it with I decided to try the 8\" Windows configuration. I liked the 10\" A500 just fine. However if you want something a little easier to put in a large pocket, that larger format tablet is not preferred. I always felt the 7\" tablets were too small. Serviceable, but not really desirable. The 8\" is OK. I did get a cheap stylus off Ebay which does seem to help especially when using a web browser off the desktop. That sort of use isn't really finger touch friendly because the control buttons are smaller than \"tablet apps\". A stylus probably is nice to use in cold weather too. Some of the Windows apps I don't like. They push you into certain directories or try too hard to anticipate or steer you into a path of use that often annoys me. I run the computer, not the other way around!I had tried a Toshiba like this which died within 24 hours of receiving it. This ACER is holding up after two weeks. It has a plastic screen, so I did get a three pack of screen protector sheets out of caution. They were for the Toshiba, but fit exactly the same 8\" screen except for needing to punch a new hole for the differently placed camera lens. Easily done. One thing that is annoying is when the screen brightness is way down, it will flicker brighter occasionally which is slightly annoying. Also the Windows button is easy to press by accident which is also a small bother. Who needs it.I don't like that the speakers are on a short side of the tablet. Unfortunately that seems to be par for the course with these 8\" windows tabs. If you are watching videos without headphones, you want the speakers on a long side of the unit. They sound OK, and the volume is acceptable. The volume rocker switch is backwards, left for volume up, and right for down if you hold it in landscape. If you hold it in portrait it's up for more sound and down for less. But why would you need sound if you're holding the thing like a book? Better sound from headphones, but convenience with the speakers.I was able to load both of my printers one of which is a scanner with no problem.It plays ripped DVD video just fine. I don't have any blue ray media to play.From Ebay I ordered an adapter for USB mini to USB female full size so I can plug in a jump drive if needed.So far I'm satisfied. I recently read a review of this (reflecting ACER products) where it was stated that it isn't the greatest thing going, but it's a competent unit with many features. My recommendation is if the specifications meet your needs you should feel confident in purchasing it.", "Title": "testing the waters of windows 8.1 on a tablet", "Date": "May 27, 2014"}, {"Author": "Acer Lover", "ReviewID": "RZPZ7R5W41PVZ", "Overall": "5.0", "Content": "I previously had purchased the Iconia W3 and found it to be mediocre as most of the reviews have pointed out.  Lackluster CPU and screen quality were issues for me, although the unit worked fine. The W4 is a terrific device!  I use it both as an electronic flight bag in my airplane as well as a \"laptop\" when I'm on the road.  As a laptop, I'm using the Bluetooth keyboard I purchased with my W3 and a Bluetooth Adesso micro Bluetooth mouse.  I have added an HDMI to VGA adapter which allows me to use the W4 for Powerpoint Presentations and online software demos.  Having had the W4 almost as soon as it was released, I've had none of the issues other contributors have mentioned.  Maybe I'm just lucky.  In the airplane, I have an XM weather receiver connected via Bluetooth that integrates with a GPS moving map to give me complete situational awareness without having to invest in a unit that would cost close to $15,000 if permanently installed in the aircraft.  I also run a complete Office 2013 suite, including Outlook without difficulty.  I wish I had spent the additional $50 for the 64gb unit, but I still have almost 3gb left on this one.  I believe that Acer go it right this time.", "Title": "Fantastic deal for $210!", "Date": "May 23, 2014"}, {"Author": "PromoPower Consignment", "ReviewID": "R2M52VPB78C76I", "Overall": "5.0", "Content": "This is just what I needed for travel. The limitation on most tablets was the ability to do Powerpoint presentations. This has the software, the power, storage capacity and the ports to do exactly what I need.", "Title": "Perfect Travel Solution", "Date": "January 31, 2014"}, {"Author": "David", "ReviewID": "R3D5LOQYLF234X", "Overall": "5.0", "Content": "Best full windows tablet for the price. If you dont have a lot of money to spend and want full windows 8, this is the one to get. Another plus is the inclusion of microsoft office home & student for free.", "Title": "Excellent Tablet", "Date": "May 30, 2014"}, {"Author": "Brady M.", "ReviewID": "R1PJFZ40204L2K", "Overall": "4.0", "Content": "I really don't have pros to add to what you can read elsewhere. It does everything I expect of it perfectly well. I even use it with a monitor, keyboard, and mouse as a desktop replacement. It'll only go for eight hours at a time that way (without charging it), but that really isn't usually a problem. I would have definitely given it five stars, but...The headphone jack stinks. At first I thought it was a manufacturing defect, but I got two replacement units from Amazon and both had the same problem. It pops crackles and buzzes frequently.If you don't intend to use the headphone jack at all, this is a five star tablet. I ended up keeping mine because I love the HDMI out, which the Dell doesn't have.", "Title": "Great Tablet! (with bad headphone jack)", "Date": "April 19, 2014"}, {"Author": "Jan Broucinek \"Tinybeetle\"", "ReviewID": "R1WK7Z6USA4SUT", "Overall": "4.0", "Content": "Nice tablet, great screen. It does NOT have the ability to charge AND have something else USB plugged in at the same time. Pity. It could have served as a desktop replacement by using a docking station/port replicator. Perhaps someone will come up with a way to overcome this limitation. It does work with a dock/port replicator. Battery life is quite good, it last for about 8 hours of normal use.", "Title": "Nice tablet", "Date": "March 19, 2014"}, {"Author": "Cleve kitchens", "ReviewID": "R3IZW1WN8B7KZP", "Overall": "5.0", "Content": "works great I have had it for just over a month and use it every day battery life seems pretty good would recommend it to a friend", "Title": "works great", "Date": "February 4, 2014"}, {"Author": "123", "ReviewID": "R2BODV3297IXCT", "Overall": "5.0", "Content": "So far, so good. We have had it for a month. It comes in handy to keep others off of my computers. Let them fill this up with the strange downloads that come with all those online games. I will come back and update this review if they manage to crash it or bog it down. As I said, nice tablet - I am a hint envious and if this continues to work out well - I may come out of the dark ages and get one of these for myself :-)", "Title": "nice tablet", "Date": "March 30, 2014"}, {"Author": "zhancih", "ReviewID": "R31Z53ESZPX528", "Overall": "4.0", "Content": "Not used，The memory of some small，but it looks so good.To give praise。Acer Iconia W4-820-2894 8-Inch 32 GB Windows Tablet (Smokey Gray),", "Title": "To give praise", "Date": "May 10, 2014"}, {"Author": "Richard cousins", "ReviewID": "R3GVANXKLGOSDR", "Overall": "1.0", "Content": "i use g mail and the tablet does not work right with it paying what i did for that i expected better quailty not very happy with it", "Title": "touch pad does not respond well", "Date": "April 18, 2014"}, {"Author": "Ning X.", "ReviewID": "R268XHG4PAENVB", "Overall": "2.0", "Content": "quality of the tablet is under average level.1. there is a bubble on the back of tablet, under the skin.2. the screen flickers two or three times  irregularly.too lazy to exchange for a new one.", "Title": "Acer disappointed me", "Date": "May 2, 2014"}, {"Author": "David", "ReviewID": "R23QVY7XDK860B", "Overall": "3.0", "Content": "I can download iTunes on the W4 and does it have most of the Apple Games on it too and Does it Works exactly like computer does? Thanks", "Title": "Question", "Date": "January 28, 2014"}, {"Author": "floder7", "ReviewID": "R1DVMP51IBXRT6", "Overall": "4.0", "Content": "I have looked at both of these tablets and they seem just about the same...can anyone tell the differenceI do know that the Dell is selling for $65.00 less...............($313) vs ($379)Intel Atom Z3740D Processor (2MB Cache, up to 1.8GHz Quad-Core)Windows 8.164 GB Flash Memory, 2 GB RAM Memory", "Title": "Acer or dell", "Date": "December 28, 2013"}], "ProductInfo": {"Price": "$299.99", "ProductID": "B00G1YJ5B4", "Features": "Windows 8.1, 8-Inch Display\nIntel Atom Quad-Core Z3740 1.33 GHz Processor\n32 GB Flash Memory, 2 GB RAM Memory\n8-hour battery life, .91 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41YJHU6WW9L._SY300_.jpg", "Name": "Acer Iconia W4-820-2894 8-Inch 32 GB Windows Tablet (Smokey Gray)"}}