{"Reviews": [{"Author": "LaCretia Gelley", "ReviewID": "R1FX1O1JHRS33H", "Overall": "3.0", "Content": "I love the iPad. The issue is that I am unable to get AppleCare on this because the seller purchased longer than 30 days ago. Apple will only allow you up to 30 days after purchase to add AppleCare. Now I'm screwed as far as that goes.", "Title": "This is more a review of the seller than the product", "Date": "May 20, 2014"}, {"Author": "Jenny Delamotte", "ReviewID": "RRR8L2C59ZFD1", "Overall": "5.0", "Content": "Do you remember being in grade school and having the kid you were in love with pick on you or make fun of you on the playground?  Remember what your mom and dad explained to you was the reason for that public humiliation?  Because they liked you too!  The same principle applies to all the competitors that say bad things about the iPad.  It's because secretly, they want to BE the iiPad.You can buy a competitor's product, but any way you slice it, it won't even begin to measure up. Just remember, every time they say something negative, they are really saying how much they love the iPad.  Nothing else compares to the bright screen on the iPad Air, or the way that it feel resting ever so lightly in your hands.  It just feels right.And that is what Apple has done so right.  It never wavered or varied based on the negative opinions of other companies.  It never even responded to them.  On the playground Apple walks away without a scratch, without trying, and without lifting a finger to respond to any other tablet's challenge.  It doesn't have to.  And everybody loves it.  See, mom really does know best.", "Title": "Simply the best", "Date": "May 14, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2H7KKH50LJGSR", "Overall": "3.0", "Content": "Had to give this three stars because even though I loved the product I had problems with it. First off, the iPad arrived slightly scratched from shipping. I contacted amazon and decided to settle on getting a partial refund as I didn't want to go through the hassle (international customer) and also the item was working well and the scratch marks were on the back which I decided would be covered by a case anyway. However, after a couple weeks of (light) use it developed a blue line across the screen. I am sending it back. I wont buy another iPad from amazon though because what I have come to realize is that the warranty starts from the date the seller purchased the product meaning that I only have a few months left on this warranty. I'm just glad I figured this out sooner rather than later. Excellent product overall and great customer service from amazon in sorting out the issue.-Update- I have since received my refund and purchased a new iPad from Apple. What I realized immediately was how differently this one was packaged. The one I ordered on amazon did not come sealed and did not have plastic on either the screen or the back. Plus I had mentioned before that there were scruff marks on it. I strongly suspect that the original iPad I purchased here was not new as advertised. Buyers beware.", "Title": "Great product but must return it due to multiple issues", "Date": "May 13, 2014"}, {"Author": "Pam A.", "ReviewID": "R3D1D23NZL600F", "Overall": "4.0", "Content": "You may be thinking to yourself right now that 16 GB is right for you. And if you are using this for the sole purpose of creating, sharing, and presenting documents, maintaining your schedule, and taking a few photos. That's great. However, I  tend to watch a few movies, but considering that I only actually have 12 GB of memory after software, large apps like pages and keynote, books, and few photos (less than 100) are taken into account, I can only put one on at a time, which gets a little old after awhile. The fact that apply doesn't allow expanded memory like memory cards still frustrates me to this day because you never know what you may want to put on your tablet in the future, and this leaves you no room to breathe. I hate the restrictions and the only real reason why I decided to get the IPad over the Samsung Note series is because the app store is incredible and much more versatile. I will certainly NEVER get another IPhone after having a Samsung galaxy unless Apple introduces the expanded memory.Anyway, moral of the story: Ipad Air is sleek, light, fast, functions well, has a great display and app store (that just being Apple in general). And if you REALLY have your heart set on this, I would genuinely think twice about the memory you choose. I don't regret buying this, it has served me in more ways than one. I just wish I had bounced for the 32 GB.", "Title": "Great piece of machinery, amazing app store, sucky memory.", "Date": "April 22, 2014"}, {"Author": "Jojo", "ReviewID": "R1UME8OXVJTF7V", "Overall": "4.0", "Content": "I need to start by saying that I am an Apple fan.  I have tried to use Android and Windows, but I keep coming back to the Apple world.  I just like Apple's products.  I got an iPad Mini for Christmas, but decided to trade up to the Air because I wanted a larger screen.  I use my Air mostly for internet use.  I am doing online college courses, and find that I can access my coursework easily using the Air.  I also love how I can load the Amazon Video app and watch Prime on my iPad or Airplay to my Apple TV.  I love that I can sync my iPad to my computer for backups and to organize music and videos.  Now for the caveat.  Apple needs to increase the basic memory for these.  I could not afford to pay another $100 for the 32 gb Air.  16 gb does not last very long!  I want more memory!!  The available memory is more like 11-12 gb because the OS takes up the rest of the space.  Apple may never put a memory card slot in the iPads - they should, they could make it proprietary and sell them for a good markup, (not $100!) then they would make more money on volume sales!  At the least, they should start iPads with 32 gb.", "Title": "Super tablet with one caveat", "Date": "April 13, 2014"}, {"Author": "Jerry Palmer", "ReviewID": "RIYHW5RDGX42W", "Overall": "5.0", "Content": "I own or have owned several different tablets... IOS, Android, Windows... and I like them all.  I am not in one camp or the other as I believe device ownership is a matter of personal preference, need and usability for varied needs. That being said, I really to like the iPad Air.  It is light, fast and just plain reliable.  While IOS may be a bit closed when compared to other operating systems, I find myself using the Air a bit more then other devices for general use.  The display is great for consuming content and this iPad does so with nary a hiccup. The difference in size and weight from previous iPads truly makes a difference if you tend to be very mobile.  In addition, if you are turned off by the smaller size of the iPad Mini this is great alternative as it is so thin and light in comparison to previous models.  I came to this one from a 1st gen Mini.  I was very happy with the size of the Mini and (having owned a 1st gen iPad) was a bit concerned that the I would no longer be comfortable with a full size iPad but that has not been the case with the Air.If you are a storage hoarder and need  to carry all of your content with you, the 128GB device is the way to go. It is quite pricey but if you are willing to pay the price you will not have to worry about making room for new content.Overall very satisfied with this device.", "Title": "Reliable and fast...", "Date": "April 9, 2014"}, {"Author": "Frances Murray", "ReviewID": "R2OCMA2C72ZTPG", "Overall": "5.0", "Content": "I Love it ,works juust as I new it would ,Pictures come out so clear and watchng netflix on it is like having a TV with you", "Title": "Apple ipad air 64 gb", "Date": "April 1, 2014"}, {"Author": "R. S.", "ReviewID": "R33TYA6D26XQ6C", "Overall": "5.0", "Content": "I am very happy with the IPad Air.  I had an iPad mini but decided to upgrade.  I like that it is so light weight and the retina display is wonderful.", "Title": "Great Product.", "Date": "March 29, 2014"}, {"Author": "Jason S.", "ReviewID": "R1UY6BT8EF4HY1", "Overall": "5.0", "Content": "Ipad came as described, new and in perfect condition.. thanks for the good price! No hitches, bought applecare at apple with no problems!", "Title": "Great Deal", "Date": "March 29, 2014"}, {"Author": "Malek Muraywed", "ReviewID": "RBE04CD5TT5DT", "Overall": "5.0", "Content": "I am finding why the apple products are popular in the user community. I like the product in all aspects of its design. I tried the android products in the past (just because I did not want to do apple products) and that prove to have been a big mistake. Never looked for simplicity but functionality - the iPad for sure seems to have a better handle on functionality than any other tablet on the market to date.", "Title": "not an iFan but starting to love it", "Date": "March 28, 2014"}, {"Author": "Robert J Hawk", "ReviewID": "R3FYV6SXBL7RQL", "Overall": "5.0", "Content": "It is far lighter than my wife's iPad with retina display. This makes it far less fatiguing to hold and carry. The new iOS 7 is also very cool.", "Title": "Great product", "Date": "January 20, 2014"}, {"Author": "Prasuti", "ReviewID": "RANZ97R2E549T", "Overall": "5.0", "Content": "The Apple ipad air is the best tablet made, period! It's light, fast and really easy to use. If you've got an iphone, you'llbe disappointed if you don't get an ipad instead of another brand.", "Title": "Awesome.", "Date": "January 19, 2014"}, {"Author": "JoeBotts \"bottieri\"", "ReviewID": "RX1U3A3YCPAI6", "Overall": "5.0", "Content": "This was a Christmas gift and she loves it.  We took it on out RV trip over the holidays and it worked out perfectly.  No more cumbersome laptop.", "Title": "She loves it!", "Date": "January 19, 2014"}, {"Author": "disks did,e", "ReviewID": "RGY5QBTRH4FJH", "Overall": "5.0", "Content": "I have owned the ipad air, 16gb, for a little over a month now, and it is perfect for my everyday busy life. It is slim, lightweight, and fast! It has the biggest AppStore out there, which is good for my kids. My teenage son loves it because he can do school research on it! No more using an old desktop. This tablet also has  the new a7 chip which makes faster. Even though I did not buy it from amazon, I bought it from AT&T;, you should consider buying it from here too,.", "Title": "Still the best!", "Date": "January 18, 2014"}, {"Author": "Dale Carrison", "ReviewID": "R1OO2UZAD55II4", "Overall": "5.0", "Content": "use it every day  have kids, grandkids, and great  grandkids entertaining us in picture, video, and sound  what could be better", "Title": "posted earlier", "Date": "January 18, 2014"}, {"Author": "gary doyle", "ReviewID": "R1XOLSK5LU10NF", "Overall": "5.0", "Content": "Gave it to my wife for christmas. She is doing dishes . I asked her how she likes it . Loves it 5 stars", "Title": "Great", "Date": "January 18, 2014"}, {"Author": "Junevreyes \"Jun\"", "ReviewID": "RRHQC8ICQR1VV", "Overall": "5.0", "Content": "I've been longing to buy an iPad air since it came out. Since this deal came, I took as an opportunity to have one. It's a great deal and I really liked my new iPad air! Thanks*****", "Title": "Nice iPad air and a great deal!", "Date": "January 3, 2014"}, {"Author": "Janice \"Janice\"", "ReviewID": "R2FOX3W8I5LSY6", "Overall": "5.0", "Content": "This is my second ipad, when I saw the ipad air I definitely wanted to upgrade.  It arrived quickly and was packaged well.  This vendor is very good.  The ipad air itself is everything you expect from Apple and everything I wanted.  Very, very happy and highly recommend the product and the vendor.", "Title": "Very happy customer", "Date": "January 2, 2014"}, {"Author": "BioHazard", "ReviewID": "R1N91OA7RXUSVM", "Overall": "5.0", "Content": "I love the new IPad Air. I got it the day it came out in stores. It starts with the ultra-sharp exterior. If you loved last year's iPad Mini, you'll feel right at home with the Air. Apple essentially built a larger version of the Mini with the Air, by slimming the beveling of previous iPads to achieve a sleeker framework.The lack of heft makes the Air just a little more comfortable: An LTE-equipped Air weighs all of 1.05 pounds. Wrapped in a comfy and protective Apple Smart Case, the Air weighs 1.368 pounds, still lighter than a third-generation iPad by itself. Despite the lack of size, the Air is no less tough. It's sturdy and not at all easy to bend.The Air feels that much more like an electronic magazine. The Retina display, once the standard for all screens but also facing more competition this year, helps that; reading text and viewing web pages on that crystal-clear, pixel-dense screen is the same joy it was when Apple first built Retina screens into its tablets early last year.If this is all Apple did, it would likely still be enough to keep it on top. But the iPad Air does far more, starting with the new processor powering the entire experience, the A7. The same dual-core, 64-bit A7 chip that debuted in the iPhone 5S is in the iPad Air; and initially, this seems like a disappointment. In theory, you expect something more in Apple's flagship tablet, something a bit more powerful, with perhaps more graphical horsepower.In practice, you won't notice a thing. Web browsing and apps still handle as snappily as ever, even if you have a gaggle of things running in the background. Top-tier games such as Infinity Blade 3 continue to deliver. A pleasant surprise is also how quickly some of the beefier games, such as Anomaly 2, loaded, compared to previous iPads. You'll move into and out of levels just a little bit more swiftly, and that helps make the entire gaming experience more friendly and natural. It's hard to know what this really means for Apple gaming, but don't rule out the possibility of more console titles being ported to the iPad.Apple realizes the limitations of the 64 GB storage too, offering a new 128-gig model. You'll pay a more-than-average-laptop premium here ($799 for the WiFi-only model and $929 for an LTE version), but the improved storage is intriguing, especially for those planning for a game-heavy future. I can now easily and comfortably load all the music and movies onto the iPad Air that I want and still have plenty of room left over for games such as XCOM: Enemy Unknown and Civilization: Revolutions.Battery life is steady, even if it's not mind-blowing. Apple claims the iPad Air can get you 10 hours on a charge, and that's definitely true. Even when using Apple's navigation for a long trip to Washington, I easily got through a day without needing to charge; and more casual usage, such as Web browsing and email checks, is no problem.The Air's lone shortcoming is that it lacks the fingerprint identification technology that debuted on the iPhone 5S. But I'd be hard-pressed to claim that this was some glaring omission; every other tablet you're going to use this year lacks such tech, and I've never seen that tech as an absolute must-have.The resulting tablet is as pleasant to use as they come, and it's backed by some consistently solid software. Android has made a tremendous run over the past few years, and a plethora of both Android and Windows Mobile devices are truly intriguing this holiday season. But if there's one consistent shortcoming on those devices, it's the up-and-down support of operating systems.It's hard to know whether this Android tab or that will support Google's latest OS, but that's almost never a problem with iPads. iOS releases are generally consistent and stable, the lone knock on Apple being its lack of Android-like customization.And while the Apps Store and iTunes are also battling competition from Microsoft's stores and Google's Marketplace, Apple's setup continues to set the bar, managing to be intuitive and easy to use and enjoying more and more high-profile digital releases.", "Title": "Apple is the Best!!!!", "Date": "January 2, 2014"}, {"Author": "Amy Leftis", "ReviewID": "R9JQAS7K7K0PK", "Overall": "5.0", "Content": "Much faster than the original ipad. A little smaller and lighter in weight. Easy to use and carry with you.", "Title": "Love It!", "Date": "January 2, 2014"}, {"Author": "R.M", "ReviewID": "R3MNNCN9SI93YO", "Overall": "5.0", "Content": "I love the IPad Air, it frees me from my desktop so I can work from anywhere! I haven't even begun to look at all the apps!", "Title": "another great Apple product", "Date": "June 2, 2014"}, {"Author": "Kyuzosan", "ReviewID": "RG3UUEOVR7FY", "Overall": "5.0", "Content": "Please note that when it comes to this market, I prefer Samsung based Android devices. Without any bias, this is a solid tablet computer. The touch screen is responsive, has great performance (iOS 7), and has outstanding battery life. Everyone in the family has a use for it, and with the right amount of storage and price point, is a valuable device. The merchant at which I purchased it from had it priced $100 below retail MSRP during its 1st half year on the market (March 2014). A great recommendation as a gift.", "Title": "A truly wonderful piece of hardware.", "Date": "May 26, 2014"}, {"Author": "Bruce Holms", "ReviewID": "R3NHSO4M0POTRS", "Overall": "5.0", "Content": "I had the original iPad that I received as a gift back in April of 2010. At that point (a long time ago in the tech world) very few people took it seriously. My only concern at the time was the lack of a \"USB' port and camera. However, I was very eager to use it and I did. By the end of the year, I had accumulated 25 apps and was already \"sold\" on its usefulness.By 2012, it became obvious that with the release of video cameras and newer OSs, I was being left in the back - so I began to wish for a newer version. Recently I saved up enough money (about $800 total when you add in insurance) to purchase the latest iPad which I am reviewing now. I still always buy the 64GB version because I always need more space.What I like most about the the new iPad is that it is much faster and a lot lighter. What I don't like is the lack of a \"USB\" - but I guess you can't have everything.", "Title": "iPad is the best !", "Date": "May 26, 2014"}, {"Author": "S. Krason", "ReviewID": "R3J5RGZU0OFLFM", "Overall": "5.0", "Content": "Apple attracts haters these days because they're now considered the overpriced behemoth when they used to be the little engine that could. Whatever. This is the best-built, fastest tablet you can buy.Pick up any other tablet and twist it. It moves. It creaks. It's made of plastic and feels cheap. The iPad Air doesn't budge or make a peep. It's solid as a rock. It's gorgeous to look at, a pleasure to use and I adore it.", "Title": "Gorgeous. Solid as a rock. Fast as hell. Just about perfect.", "Date": "May 24, 2014"}, {"Author": "olrick", "ReviewID": "RYFZKO8HR9DR4", "Overall": "4.0", "Content": "My first Apple product, my first swipe screen---and it comes in slick package with a postage stamp of \"instructions\"......You want to read about how to use your new iPad Air ?  Be prepared to BUY  your operator's manual on line from Apple--ifof course you can navigate through the App store!.It may be greater'n'grits,  but I am struggling with basic functions  and a little bummed out that \"everyone\"  thinks these things are intuitive.  Shucks, I almost sent it back, because the harder I 'touched' the less often it worked !  It took a young relative to explain soft swipe and soft touch...", "Title": "Over $450 and another $9 for a user manual ??", "Date": "May 21, 2014"}, {"Author": "Nick", "ReviewID": "R3Q1K3UCP1BXS2", "Overall": "5.0", "Content": "Difference from ipad 2 is night and day. Retina display looks unbelievable. The speed difference is extremely noticeable. If you have an ipad 2 and you are considering upgrading to ipad air, they are in different leagues. Would HIGHLY recommend to the ipad/apple enthusiast.", "Title": "Difference from iPad 2 to iPad Air is leaps and bounds.", "Date": "May 14, 2014"}, {"Author": "TROY MILLS", "ReviewID": "R3EWY3Z2G1RY2", "Overall": "5.0", "Content": "Really love the Air, still have the iPad 3 which my wife now uses, she loves it, i can see a little better graphics on the Air, great product", "Title": "love it", "Date": "May 13, 2014"}, {"Author": "Jacx \"J.C.\"", "ReviewID": "R3OLYYBSUX1RHR", "Overall": "5.0", "Content": "I was needing a new iPad  and bought a kindle since they were on sale one day, the kindle is good for reading, watching netflix , holding my audio books and other things I have purchased through amazon but had some issues with app compatibility , apps not working well and writing programs just too different from what I was use to, not to mention only a front facing camera. Also the screen was tiny for web browsing.So I went ahead and bought the iPad Air and I am so glad I did, it's fast , has all my apps and rear camera although low light photographs are not the best and the speaker system in iPad Air is not up to the quality of the original iPad, which I still own and use but they no longer support or update. The iPad Air responds quickly and I am happy with it.  Was so impressed my mom updated her iPad a few days later getting the same one. I do like the white, had black before, slightly brighter when naked but mine now has a silicon case around it covering edge anyway.", "Title": "Nice upgrade", "Date": "May 10, 2014"}, {"Author": "Bea Perez \"Beatrice Perez\"", "ReviewID": "R1L0O3DF34YA0A", "Overall": "5.0", "Content": "The I Pad Air is so light that it feels like I'm not holding anything. It works great & the pictures are beautiful I love it.", "Title": "I Pad Air", "Date": "March 21, 2014"}, {"Author": "Rick Currie", "ReviewID": "R1QB6GD9KMV8NE", "Overall": "5.0", "Content": "Takes a few days for it to arrive but there was no rush for me.  Will certainly enjoy using it.", "Title": "Great buy!", "Date": "March 21, 2014"}, {"Author": "Chastity", "ReviewID": "R2JDAE53SM5F76", "Overall": "5.0", "Content": "I have used a generation 1 ipad for a year now and, I was excited when I first started using it. Even though it didn't have a front or back camera. I didn't mind.It's pretty heavy so, i just layed it down on a tablemost of the time. It was all fun and games, until the ios7 update came out a few months ago. After the new update,I could barely do anything on it. All of my favorite apps were no longer useable and, I had to delete them all because theyrequired the new update. After ios7, the first gen ipad suddenly became useless and, I felt cheated out on the amount ofmoney that was spent on that ipad. I'm very surprised that the ipad 1 only costs 200 hundred dollars less than the new one.Even though generation one is a discontinued model. In my opinion, it should be off the market completely. Why bothergetting this outdated device, when you can buy the newest one for $200 more? The ipad air has a completely different feel to it. It's a hundred times lighter.The iPad air has so much new things like Siri. Some people may think asking a electronic device to do something for you might be a bit lazy but, you can make a reminder within 5 seconds without leaving your current app. Siri has better results when searching for something specific. It's also helpful if you're slow at texting or, if your hands are full. Browsing the web is a lot faster but, downloading an app may take a while depending on your Internet connection. Since ios7 is an high definition upgrade.", "Title": "A huge step when comparing a generation 1 ipad and the iPad air", "Date": "March 19, 2014"}, {"Author": "C. Donnelly", "ReviewID": "R3OTZBD2FA1I3C", "Overall": "5.0", "Content": "I'm not trying to gush, but wanted to say that I waited and bided my time before breaking down and buying a tablet, and I'm really glad that this was the one that got my feet wet!  My main reason for getting one was that I was tired of dragging a cumbersome laptop (ha! laptops are now cumbersome!) when I traveled and needed to work.  This is lighweight, efficient, and has changed the way I can work while away from the office.  And while the cellular service added greatly to the purchase price, I prefer not having to rely solely on Wifi should it not be available.", "Title": "First choice for a tablet a real winner", "Date": "March 19, 2014"}, {"Author": "Wub", "ReviewID": "RUTNY1Y1WT55D", "Overall": "5.0", "Content": "I thought I could live without an iPad, but it is so light and convenient.  It does everything!  I have to hide it from my grandkids.", "Title": "Love my iPad", "Date": "March 18, 2014"}, {"Author": "Chris Foste", "ReviewID": "R2AZ3JM64JGAYM", "Overall": "5.0", "Content": "I bought the iPad for traveling purposes and haven't regretted it.  Does everything a computer would do and then some.  Definitely worth the money.", "Title": "Awesome iPad", "Date": "March 18, 2014"}, {"Author": "bigbeezy209", "ReviewID": "R2E69RJV1RXYHP", "Overall": "5.0", "Content": "Love this iPad air.. It's so light & sleek that it's not a burden to carry around everywhere you want to go... Screen looks beautiful and build quality is just like every apple product.. A+", "Title": "Great iPad.. Step up from other older versions", "Date": "March 18, 2014"}, {"Author": "arthur", "ReviewID": "RRTKCTTR95PTK", "Overall": "2.0", "Content": "i like it and hope word could be used when I open the apple ipad air.in fact ,I can not find the difference between ipad 4 and ipad air", "Title": "excellent", "Date": "March 18, 2014"}, {"Author": "robert bennett", "ReviewID": "RBLALTKNUFLOU", "Overall": "4.0", "Content": "Ipad is great! Charger was not. Would've given 5 stars but charger had short in it had to buy new charger.", "Title": "had to buy charger", "Date": "March 17, 2014"}, {"Author": "Rita Runyon", "ReviewID": "R2OZSMS2AY9QU9", "Overall": "5.0", "Content": "I love it… I just haven't figured out how to use it… I can't get to the Apple store at the mall, for help, they do not have electric carts and I can't get inside without assistance. I have been using it to do some reading online and it's great! I sold a cherished antique to buy this and I'm so glad I did! I'll get this figured out.", "Title": "ipad mypad!", "Date": "March 8, 2014"}, {"Author": "Ben A. Holliday \"Ben\"", "ReviewID": "R2IHKIXHY3VJG7", "Overall": "5.0", "Content": "It was a gift to my wife and she loves it, so that makes it worth it. As much as she uses the iphone now she at it with the ipad. Shewatches TV and a movie on the iPad at the same time.", "Title": "Happy", "Date": "January 15, 2014"}, {"Author": "Ramon S. Reyes", "ReviewID": "R8GCU6Z8NYVVA", "Overall": "5.0", "Content": "This iPad Air was a gift for my wife and she continues to enjoy it immensely.  The unit is much lighter than her first generation iPad and the graphics are definitely better.  She can now use Facetime since this new unit has a camera, one that did not come with her original iPad.", "Title": "Loved It!", "Date": "January 15, 2014"}, {"Author": "Ana Sofia De Agrela", "ReviewID": "R1FGBOLGM6Y46Q", "Overall": "5.0", "Content": "The iPad air is the best iPad yet! If you buy it you won't regret it! Really love my new iPad :)", "Title": "I love it", "Date": "January 15, 2014"}, {"Author": "Karen A. Stoner", "ReviewID": "R36A8QXU63KP5F", "Overall": "5.0", "Content": "So far can find NOTHING wrong (CON) about my new ipad Air!!! (PROS- It is smaller & definitely lighter and has some new features!I had previously purchased the Ipad 2nd Generation and was VERY \"happy\" with it! BUT in my very rushed world, I dropped and cracked the front screen...:-( Not knowing what to do, BUT knew I didn't want to be WITHOUT my ipad. (I take it almost everywhere I go.) So when someone asked what I wanted for Christmas, I told them! So now I have my travel ipad and my stay-at-home (Ipad Air).So now, I won't be without my Ipad...:-) I will update my review if the need arises.", "Title": "Ipad Air", "Date": "January 15, 2014"}, {"Author": "Pinkbubblegum4me", "ReviewID": "R1G6Y6OI019WZN", "Overall": "5.0", "Content": "Hubby, who is somewhat tech challenged, loves this! So easy to use and READ! Now I can use the desktop computer again!", "Title": "Hubby Loves IPAD!", "Date": "January 14, 2014"}, {"Author": "Aaron Smith", "ReviewID": "R3LQ2RMXC00BYM", "Overall": "4.0", "Content": "I have really big hands and I can palm this thing.  I truly like the smaller bezel around the edge.  That has always been wasted space in my mind.  I came off an iPad 2 and this one is significantly faster.  Text is significantly clearer on the retina type display.  A great design and works like a charm.", "Title": "Smaller in a good way", "Date": "January 14, 2014"}, {"Author": "bonniejean815", "ReviewID": "R1R2UWWI65O2LG", "Overall": "5.0", "Content": "Awesome iPad. Best ever yet. Fast. Beautiful display light and thin  Best ever  worth every penny. Battery lasts longer. Than earlier models", "Title": "Buy one", "Date": "January 14, 2014"}, {"Author": "Joe", "ReviewID": "R2NUVMMUSXTU0L", "Overall": "5.0", "Content": "Headline says it all. So ridiculously light and sleek. If you're trying to save a few pennies, maybe look at the Nexus 7 or Kindle HDX, but if you want the best, this is it.", "Title": "Didn't think I needed one....till it was in my hand.", "Date": "January 14, 2014"}, {"Author": "Mr. T. Echeumuna", "ReviewID": "R3HUSUASDGJIQY", "Overall": "5.0", "Content": "I am so pleased with my iPad Air. It is unbelievably light for an item this size. You will not believe it. If you have had ones of the earlier iterations, then you will know what I am on about. But if not and you are looking for a tablet - money no object - then get this iPad, and  you won't regret it.Enough said!", "Title": "GET ONE, IF YOU HAVEN'T ALREADY", "Date": "January 13, 2014"}, {"Author": "Mme Mildred Elliott \"Tony E\"", "ReviewID": "R2Y0BQ2MSAUH2Q", "Overall": "5.0", "Content": "I use the iPad for personal and business purposes. Whilst I am still learning just to operate this wonderful piece of equipment, I have already found many applications that will assist me  and shorten my completion of  my tasks.", "Title": "Wonderful,", "Date": "January 11, 2014"}, {"Author": "SHEY", "ReviewID": "R20810V6O92N25", "Overall": "5.0", "Content": "I absolutely love my new iPad. It's amazing! It was a present for me and I can't get enough of it. My entire family loves it. Would definitely recommend.", "Title": "Great device.", "Date": "December 26, 2013"}, {"Author": "Georgeen Carden", "ReviewID": "RTB7ALFQTYSAL", "Overall": "5.0", "Content": "Gave it to my husband for Christmas and he loved it. The only complaint is the start-up process was difficult to understand and required tech assistance (available Christmas Day!!!). Apple continues to do it right in electronics.", "Title": "A great gift", "Date": "December 25, 2013"}, {"Author": "diane trekell", "ReviewID": "RVY15CBP64UVT", "Overall": "5.0", "Content": "fast shipping, well packed, best Christmas Gift ever. looking forward to using it for work fun and playing games, pictures", "Title": "best gift", "Date": "December 25, 2013"}, {"Author": "Janice Hemsley", "ReviewID": "R17SK6Y25Z4K56", "Overall": "3.0", "Content": "The Apple IPad Air is a great device.  It feels comfortable to hold in your hands.  The only dislike I have is that it don't support Adobe Flash Player.  I like to play certain games on my computer, but when I pulled them up the the Apple Air, I'm not able to download.  After reading more about why Apple doesn't support Adobe on none of their devices, I was kind of upset.  I wish I would had looked more into this before I purchase this ipad.  I've only had it for a week and now I'm trying to sell it.", "Title": "Great devices to have.", "Date": "March 24, 2014"}, {"Author": "Alistair", "ReviewID": "R33VY9LYY4KHUL", "Overall": "5.0", "Content": "I recently switched from the kindle fire HD to the iPad air. I like the larger screen, stunning resolution and general,ease of use. Ok so it is more expensive but I believe you get what you pay for.", "Title": "iPad air......", "Date": "February 3, 2014"}, {"Author": "Dmitry Shishkin", "ReviewID": "RCWBUBL868JAX", "Overall": "5.0", "Content": "To make it short: no, it is not worth upgrading from iPad 3 based on my experience...After reading all these excited reviews I finally gave in to the temptation to get one from the store, thinking that may be if I play with it more I would see how awesome it is (trying it in the store did not impress me that much). After a few days of using the iPad Air and iPad 3 I can tell that an upgrade would not be worth the hassle of putting my older iPad on ebay and making up the difference which would be around $300 I guess (I have the 16 GB version) . Actually, a lot of professional reviewers online recommend exactly this: don't upgrade if you already have either an iPad 3 or iPad 4.The difference in size and weight is (slightly) noticeable when you are picking the device or holding it in your hands. The thing is that I never just hold my iPad in my hands when using it (and I do use it a lot!). Most of its weight goes either to the desk when I am at my desk, or to my lap if I am in my chair, or to my chest if I am on my couch. Which means I am basically using my hand(s) to balance the iPad not to support it. In such situations extra 7 ounces is not a big deal at all.If you are using your iPad differently (for example, playing games a lot) then you might appreciate the iPad Air better. Also, if you just want to have the latest and the coolest iPad then of course that would be worth it too :)Seems like Apple is following the same pattern with both the iPad 2 and the iPad Air, mostly squeezing the same device in a smaller package. This is not good enough for me. I waited until the iPad 3 came out to upgrade my iPad 1 (yes, Retina display was totally worth it!) and I hope that the iPad 6 will be worth an upgrade. But I am not getting into the hassle of replacing my iPad just to get a little bit thinner/narrower and lighter.Making the decision to return the iPad Air got even easier when I realized that its screen has a noticeable yellow tint which makes my iPad 3 look a bit bluish which I like better.Good bye, iPad Air, and lets hope that Apple will be able to impress even the most conservative of us with the iPad 6 in October 2014! (Speaking of being conservative, I am still using IOS 6 on my iPad - it is better to be safe than sorry! :)", "Title": "For those who are still thinking about upgrading from the iPad 3", "Date": "January 5, 2014"}, {"Author": "Harold D. Smith", "ReviewID": "R2HU06LY78E5EE", "Overall": "4.0", "Content": "This was purchased as a gift and seems to be well received.  My only problem with this purchase, I seem to have paid about $150. more than everyone else I know that also received the same unit,  Obviously I'm not happy about that.", "Title": "IPad Air", "Date": "December 31, 2013"}, {"Author": "AK529", "ReviewID": "R2PQUNPSZ9SQUD", "Overall": "4.0", "Content": "The ipad air is what the ipad 4 should have been. It is lighter, thinner, narrower, faster and has stereo speakers. Its almost half a pound lighter which really makes a difference when holding the ipad in your hands for long periods of time. I no longer need to use my ipad stand. Typing and holding it in portrait mode are much easier. People with larger hands will be able to hold the ipad with one hand very easily. Performance is also much improved with new A7 processor. Apps open, close and switch faster than on the ipad 4. Wifi is now double the speed with the double mimo antenna. For those who have supporting routers loading web pages, downloading apps, books, videos, music is much faster. The new stereo speakers are much loader and have more bass than on the previous ipad. The stereo affect will only be noticed when holding the iPad in portrait mode. This is a shame since you wont enjoy the stereo affect when watching a video or playing a game in landscape mode. Also the speakers are very easy to muffle if you cover one or both of them on the right side in landscape mode. The main flaw of the ipad air is its lack of 2GB of ram. When browsing and having more than a few tabs open this is very noticeable. The tabs have to reload when switching back and forth. This also becomes an issue when switching between apps that are open. Both the ipad 3 and 4 had 2GB of RAM. The only reason I can think of why apple decided not the upgrade the RAM is to make customers upgrade to the next ipad. The other downside to the ipad air is the fact that its running ios 7. ios 7 for the most part is in improvement over ios 6. It is faster and has more features, but, it also has many bugs that still need to be fixed. Even with 7.04 installed I still experience rotation issues. The ipad doesnt auto rotate when switching between portarit and landscape mode. This issue occurs atleast once a day. Mainly when the multitasking gestures is enabled and auto rotation. There are many threads on apple discussions forums about this issue. I thought at first my ipad was deffective even made an appointment to see a genius. I was told there was no way to test the hardware but was offered a warranty replacment. I decided instead to exchange the ipad and the replacement also had the same issue. I have to add also my ipad 4 had the same issue also when I updated it to ios 7. I hope apple fixes this issue in 7.1. This is very annoying and not something I expected from apple. The ipad air also doesnot have the ability to run 2 or more apps at one time which both the new samsung note 10.1 2014 and Microsoft surface tablet can do. I did try the samsung tablet briefly and found the screen and speakers much better than the ipad air's. The ipad still is the best larger tablet on the market because it has a huge selection of tablet apps and it gets the apps first before any other platform. I also love the battery life on my ipad air. I was getting about 15 hours of usage on my ipad 4 with the brightness at 35% and about 5 notifications with browsing and email. Now with the ipad air I am gettting more than 15 hours. Anywhere from 16-18 hours of battery life depending on my usage. The new ipad air is must have for gamers, power users and people who take the ipad on the go. If you can wait the next ipad will defeintly have 2GB of RAM and wont have as many bugs. There is also a good chance a new ipad will be released in the next 1-2 years which will be larger in screen size and more powerful named the ipad pro.Update after owning for more than 4 months: Apple just released the 7.1 update. My iPad Air is finally stable, this is what ios 7 should have been from the start. There are no more crashes, reboots and the auto rotation issue is fixed. I am still giving this ipad 4 stars since it took apple more than 4 months to fix these issues. Also the ipad lacks 2gb of ram, there are no widgets, thrid party keyboards, expandable storage or way to run 2 apps at once side by side. The iPad Air is till the best 10 inch tablet on the market. It beats any android or microsoft tabelt currently on the market in the 10 inch category. Also it has the most tablet apps.", "Title": "Almost perfect besides the lack of RAM and some iOS 7 bugs", "Date": "December 30, 2013"}, {"Author": "Diane Allen", "ReviewID": "R95SPR015HRY8", "Overall": "5.0", "Content": "What an amazing ipad! The ipad air is wonderful! Light, fast, all the computer you need! Apple products are hard to beat!", "Title": "WOW", "Date": "December 28, 2013"}, {"Author": "Janelle Nordine", "ReviewID": "R2S0CEXWVV6B1K", "Overall": "5.0", "Content": "I simply cannot believe all the things I can do on the IPad!  I've even created spreadsheets!  I am a true fan of Apple products.  My four granddaughters (the oldest is seven) play it every time they come.", "Title": "IPad is GREAT!!", "Date": "December 10, 2013"}, {"Author": "Luciano", "ReviewID": "RLD51TQQUJK68", "Overall": "5.0", "Content": "Amazing, it's my first i-x and I really like it. Strongly recomended for people that need just a tablet at home...", "Title": "Great tablet", "Date": "December 9, 2013"}, {"Author": "Bastijn McFerrell", "ReviewID": "R1IB47C2DCYUGY", "Overall": "5.0", "Content": "I owned a second generation iPad before needing to sell it for personal reasons. In hindsight, I’m glad I did otherwise I wouldn’t have bought this tablet.Before deciding on the iPad Air I considered the Kindle Fire and Nexus 7. The Microsoft Surface wasn’t an option since I really don’t like the operating system or customer service and I wanted my tablet to last longer than a year. Samsung wasn’t an option after the torture my Galaxy S3 put me through, which also ruled out Android, which then ruled out the Nexus 7. Some people are a fan of Android but I find it to be slow, unreliable and choppy. The aesthetic design isn’t my favorite either. But these are all a matter of personal opinion and experience. :)The Kindle Fire HDX looked great at first, but in the end I decided it wasn’t for me. I’m a writer and a student so being able to edit documents on the go is my main concern. I have an iMac so this unfortunately made using the Kindle for these purposes a little more difficult for me. While I can edit and share most documents on my iMac, including Microsoft Office, I primarily use Pages which isn’t available on the Kindle. I just don’t care for either Microsoft Word or Google Docs enough to use them all the time. Also, I never use the Amazon store to watch movies or shows or download music so that feature wasn’t appealing to me. I took a trip to Best Buy to try it out just in case that made me change my mind. This actually solidified my decision against it. While the Kindle Fire did feel surprisingly solid, I didn’t like the position of the buttons, smaller screen size (although the screen quality was pretty awesome) or the thick boarders around the screen. Again, all of these are a matter of preference.When I went to try out the iPad Air I was surprised by how much lighter it felt than the previous model iPad. I also liked the flat back and thinner edges on the side. It made using it easier for small handed people like me. The larger screen size made typing on the tablet much easier in those rare instances I might not have my keyboard. Keeping my documents in one place is amazingly simple and I like the applications I use for writing and classes. Also, iTunes U is just awesome!The only drawback for me is the price: I paid $300 more than I would have with the Kindle Fire HDX. I don’t think this is outrageously expensive, considering the larger screen, better hardware, operating system and customer service-- not to mention iTunes U-- but I do think the price could be lower.While there are other great tablets out there, I really enjoy my iPad Air. Electronics are all a matter of personal preference anymore anyway. If you don’t like a device, don’t buy it. It’s that simple. :)", "Title": "I’m glad I did otherwise I wouldn’t have bought this tablet", "Date": "December 12, 2013"}, {"Author": "Nik", "ReviewID": "RUSB2R1PF1O2T", "Overall": "1.0", "Content": "Purchased this brand new iPad Air 64 GB from TechGiant(Amazon). Was with broken volume button!Was going to return it, but thanks to the Apple Store in Cherry Creek to exchange it for another one.", "Title": "Defective Item", "Date": "April 27, 2014"}, {"Author": "JustAGuy", "ReviewID": "R13PZL77MK3WNV", "Overall": "3.0", "Content": "I upgraded from the ipad 1 to the ipad air mainly because of constant crashes with the ipad 1.The Air still crashes. From what I've read most people think it's a software issue, if that's the case then this is a 4 star product.What keeps it from a 5th star the the feel of the screen. The ipad 1 felt solid, like glass. This has a hollow plastic feel to it. Feels like if you type too hard it'll snap.I own almost every product Apple makes, this feels like I'm holding the decline of Apple in my hand.", "Title": "Heavy Apple user, this not up to snuff", "Date": "February 5, 2014"}, {"Author": "chuck", "ReviewID": "R1XOTGWQZRZHZ3", "Overall": "5.0", "Content": "I hardly use my lap top now, iPad Air is just that good. Charges fast and then it just runs all day. so easy to learn and use", "Title": "Great. Tablet", "Date": "June 6, 2014"}, {"Author": "Sara J Ellis", "ReviewID": "R2RREOGXYQEBGG", "Overall": "5.0", "Content": "I absolutely love my iPad. For years I was annoyed by the hype of it all, but finally decided to get one. WOW, is it everything and more!  I'm even not a mac person, but Apple certainly knows what they're doing. I use this for work and fun. It has movies, music, games, as well as Microsoft Office, DropBox, and my multiple email accounts. I think it is IMPORTANT to note that I am returning the one I just purchased, but only because 32 GB was NOT BIG ENOUGH. If you are a casual user, 32 GB is fine. I use it for work and family, though, and within 5 days (after downloading all my necessary work-related apps and then a few games) that I was 10GB down out of 32 (which is actually only 27 because the operating system uses the first 5GB). If you want this for entertainment or actual work, get the 64!", "Title": "Hands down one of the greatest devices I have ever owned/used", "Date": "June 6, 2014"}, {"Author": "GFxRocket", "ReviewID": "R1GPOFPMKIGHG6", "Overall": "5.0", "Content": "This product met all my needsMy wife wanted itI gave it to herShe now doesn't irritate me about itProblem solvedIf you find yourself in the same situation, believe me...  You NEED to do it for your own peace of mind", "Title": "Apple iPad Air MD785LL/A (16GB, Wi-Fi, Black with Space Gray) NEWEST...", "Date": "June 5, 2014"}, {"Author": "Mr. Edward T. Asato", "ReviewID": "R1JANDHJ506A7F", "Overall": "5.0", "Content": "I bought The IPad Air with 16 GB. I am Happy to say she has learn to use this  IPad on her own. The 16GB has been adequate for her application.etak.", "Title": "My Wife Love This IPad Air!!", "Date": "June 5, 2014"}, {"Author": "Dan Zhang", "ReviewID": "R1GHRBGKAGRVWZ", "Overall": "5.0", "Content": "Very nice ipad like my other ipad air, so far it working well and I hope it can keep going. Thanks the seller.", "Title": "ipad air", "Date": "June 4, 2014"}, {"Author": "Carolyn Stewart", "ReviewID": "R2D9KE8TBV3M52", "Overall": "4.0", "Content": "This is my first purchase of a tablet and and am very happy with it.  Several people recommended this iPad so that's why I chose it.", "Title": "First tablet and love it", "Date": "June 4, 2014"}, {"Author": "paramvir", "ReviewID": "R3JZ2TBD5K3C9O", "Overall": "5.0", "Content": "best tablet in the market. good interface and light  weight and long battery life. good work apple keep it up", "Title": "5 stars", "Date": "June 4, 2014"}, {"Author": "John", "ReviewID": "R3HQ0V6NA4N2D8", "Overall": "5.0", "Content": "I have both an ipad and a mini and bought the Air for my wife.  It's slim, light and the clarity is excellent.  Very happy with the unit so far.", "Title": "Very Nice", "Date": "June 3, 2014"}, {"Author": "D. Holland \"artist\"", "ReviewID": "RRSPFDYYTIGI2", "Overall": "5.0", "Content": "I've had my new iPad for two days; and so far I love it. I am having to learn some features that I'm not used to as I have always used Windows; but in general, this device is easy to use. All in all, it's an amazing step up in it's technology. I'm now an Apple fan after many years of resistance.", "Title": "Happy Customer", "Date": "June 3, 2014"}, {"Author": "Silvia", "ReviewID": "R1YCWG6FVI6KZK", "Overall": "4.0", "Content": "The exceptional engineering continues by Apple. The new iPad is so light and fast with brilliant picture quality that I watched most of the March Madness on it when I wasn't near a good sports bar. Very fast, love the apple apps", "Title": "Apple", "Date": "June 3, 2014"}, {"Author": "Gustavo F Smorigo", "ReviewID": "R22WEJ4A05VNV5", "Overall": "5.0", "Content": "The new Ipad is very light and thin. The screen is magnifc and very quick. I have a Ipad3 and the new ipad performance is amazing.", "Title": "Exact as I expect", "Date": "May 26, 2014"}, {"Author": "Phil C, Boston", "ReviewID": "RL8GWTC6G1B9F", "Overall": "5.0", "Content": "I've had an iPad v1 for the longest time and now that Apple doesn't support it and that the last version of most apps would crash mid-use, I decided I'd either have to get the latest or abandon the i-Line of products (something I thought about when I first learned about stopping iPad v1 support).Anyway, it's lighter, has a camera, etc.  And for the price and the number of years I had the iPad 1, it comes to ~$100/year before it isn't supported.  And chances are this one will have at least a couple more years of life.The upgraded screen is very nice and I'm please with the response times/loading speeds vs. the iPad 1 (but that's to be expected).", "Title": "It's great!", "Date": "May 26, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R11D8JB2I8EI7K", "Overall": "5.0", "Content": "This is by far the nicest tablet I have found.  It is expensive, but it is worth it.  Very bright and very responsive.  And, of course thousands of apps for it.", "Title": "Love the iPad Air", "Date": "May 25, 2014"}, {"Author": "J. Fishinger", "ReviewID": "R2UM3FZXS3HZKG", "Overall": "5.0", "Content": "I am very pleased with the IPad  air. Works smoothly and is allI expected from the device. I have a 7\" Nexus tablet, which was a good device as well, buy the extra size is great. I am doing this review on the IPad.  The battery life is superior on the iPad and a bit more available for apps although I had  no issue with the Android device. I briefly had the 16 GB version and exchanged for the 32 as I saw how quickly the 16 would fill up.", "Title": "Great Tool", "Date": "May 25, 2014"}, {"Author": "F. Twyning", "ReviewID": "ROUEJ1IOGPJ3M", "Overall": "5.0", "Content": "I wondered if upgrading from my trusty iPad 2 was going to be justified - no longer. It seems a bit better at a everything. Screen, sound, wi fi reception, weight, battery, speed, etc. Really pleased.", "Title": "Justified my upgrade", "Date": "May 24, 2014"}, {"Author": "william f yarosh", "ReviewID": "R19CI8ZZGC6MHA", "Overall": "5.0", "Content": "Going from micosoft to apple was a litte confusing, but worth it.  The apps are nice, but a little expensive", "Title": "better than my computer", "Date": "May 24, 2014"}, {"Author": "NWP", "ReviewID": "R3FBJGDWM3YU7M", "Overall": "5.0", "Content": "I'm old school so I'm amazed at what this thing can do ! I'm learning new things every day and it just keeps getting better . I really like the music apps -Pandora - you can pick all of the types of music that you like to hear and it's free ! ! . I bought the Motown' s no.1's - it's great - only about 50 cents a song - cheap enough ! !  . I'm probably going to have to buy my wife  one now .", "Title": "I'm loving this thing !", "Date": "May 13, 2014"}, {"Author": "Sebastian Häuser", "ReviewID": "R31SBWDGIQ9KBA", "Overall": "5.0", "Content": "fast delivery no worries and in total it is an awesome product. handling is easy and looking forward to the next generation of ipads", "Title": "top", "Date": "May 4, 2014"}, {"Author": "Nathan", "ReviewID": "R3AGVWFT9LP3JM", "Overall": "5.0", "Content": "I've had my ipad for two months now and I am obsessed! It's so easy to use and I take it with me everywhere for work. I have two small complaints:1. The camera has no flash.2.  Tha calculator is not located in the same menu as for an iPhone (the one when you swipe up from the bottom of the screen - I don't remember what it's called). This makes accessing the calculator, which I use a lot for work, very inconvenient.3. Many apps for the iPhone (Instagram, snapchat) have not been adapted for use on the ipad. This isn't necessarily an ipad issue, but definitely something to consider.Overall, it's a great product! I firmly believe that you get what you pay for. Apple is pricey, but it's worth it and they have wonderful customer service. Highly recommend.", "Title": "Wonderful product, just a few minor complaints.", "Date": "May 4, 2014"}, {"Author": "prairiedog", "ReviewID": "R2I3TML994UDZZ", "Overall": "5.0", "Content": "The new I Pad arrived on time and in great condition. Very happy with the unit and the condition of the parcel.", "Title": "Apple Ipad", "Date": "May 4, 2014"}, {"Author": "SuzieT", "ReviewID": "R30AY1YLWH68Y1", "Overall": "5.0", "Content": "I got it as a gift..they loved it. Good piece of technology for adolescent age and more seasoned users. Easy to navigate, bright colors, apps and setting options galore.", "Title": "Good purchase", "Date": "May 3, 2014"}, {"Author": "Joanne", "ReviewID": "R2MA3F1J8UOF1K", "Overall": "5.0", "Content": "I love the iPad Air. It is so much lighter than the regular iPad. I had the iPad mini which I loved, but I wanted just a little bigger screen so I can use it without my glasses.", "Title": "Great iPad Air", "Date": "April 10, 2014"}, {"Author": "ladishow", "ReviewID": "R20OKEB5G3NRD1", "Overall": "5.0", "Content": "Very good device. Vintage apple. I had the iPad 2nd generation, but upgraded to the iPad air and I particularly like its slim shape and light weight.", "Title": "vintage appke", "Date": "April 10, 2014"}, {"Author": "Grace Favela", "ReviewID": "RUNOW2G2V0H7I", "Overall": "5.0", "Content": "Package arrived quickly and  the iPad looks very nice. It's light weight and very easy to set up. The graphics are amazing!", "Title": "Works great!", "Date": "April 9, 2014"}, {"Author": "Eser Yelkenci", "ReviewID": "R15JBXYVPG52QT", "Overall": "5.0", "Content": "I don't know what I have to say. It's the leader of tablet. I strongly recommend it. Apple is N1.", "Title": "the leader of type.", "Date": "April 8, 2014"}, {"Author": "sea629", "ReviewID": "RTU5UQFCLOE5N", "Overall": "5.0", "Content": "I brought this to replace my iPad2, that day I saw here sold that, I compare the more then 5 sellers, then I decide to purchase this at here, because it was cheaper, and it is with verizon network. from I have purchased to when I recevied the device, it take long time, but it is ture as seller's description.", "Title": "It was a great buying on the amazon", "Date": "April 8, 2014"}, {"Author": "Trevor Rentschler", "ReviewID": "R2HVZVWERLIK8G", "Overall": "5.0", "Content": "You will be very hard pressed to fing anything that operates better the this amazing piece of perfect engineering. Get this and you will not be disappointed", "Title": "Best *tablet* available", "Date": "April 7, 2014"}, {"Author": "Barbara J. Post", "ReviewID": "RKD9NLKBBS7UP", "Overall": "5.0", "Content": "Love the sleek lightweight pad.  Clear screen and nice arrangement of icons.  Still need time to go through everything so can't comment on anything else.", "Title": "Apple iPad air", "Date": "April 7, 2014"}, {"Author": "Noel McGuire", "ReviewID": "R1DYEFJG2STFZK", "Overall": "5.0", "Content": "Never had a tablet before, always used a laptop or a desk top to accesss the interent, play games or draw. Been slowly getting into this Ipad Air thingy and i think its going to come in handy for sketching and art. Apple does seem to have the best apps for creative people, so i'll see what i can find. Overall its a good device and i think its going to be a great day.", "Title": "Great Day", "Date": "April 7, 2014"}, {"Author": "Angela Gibson", "ReviewID": "R10C4Z6WAJYHLY", "Overall": "4.0", "Content": "The shipping took forever but it's doing what needed it for so it's all good! Wish it came in pink! : P", "Title": "It does what I need it to", "Date": "April 6, 2014"}, {"Author": "s198 \"s198\"", "ReviewID": "RS96ZBQP4JQB2", "Overall": "5.0", "Content": "I haven't owned an Apple product since the iphone4.  I have been an Android man the past several years.  Let me say that this iPad Air is the perfect device.  Rock solid and the apps are SOLID. I am a Cybersecurity manager and have seen one too many malware infested Android apps lately.  Enough to scare me away.  Buy this, you won't regret it", "Title": "Simply the best", "Date": "March 15, 2014"}, {"Author": "abhishek", "ReviewID": "R3Q4KB7YSU381L", "Overall": "5.0", "Content": "I bought windows rt and dell venue before I finally settled on this one.all others are either very slow or too small.the iPad is a little expensive but its very classy and technologically way ahead of all the others.I would suggest everyone to just go with the iPad and never look back.", "Title": "iPad is the top of the league.", "Date": "March 15, 2014"}, {"Author": "roxanne", "ReviewID": "R1ATOPMPY6LHFM", "Overall": "5.0", "Content": "I bought this after hemming and hawing over all the different options for tablets. I'm a PC user primarily and Apple products are usually more expensive than I'm comfortable with. I eventually chose the iPad Air because Apple has long lasting, durable products and their customer service is usually top notch.The iPad came quickly and so far I love it!! It's incredibly light and has a lot of useful apps for school (which is why I wanted a tablet). It beats dragging a heavy computer around campus, that's for sure! The sound quality of the speakers are really nice and the screen's resolution makes pictures beautiful.I only just received the product so the battery is quite new, but it has a very long life; even when you're constantly using wi-fi or bluetooth it will last you all day.If you're looking for a tablet, you should go with whatever makes you comfortable and consider what you want to use the tablet for.  That being said, even though I'm more comfortable on PCs this is a handy device and so far I'm happy with my purchase.", "Title": "So far I'm loving it!!", "Date": "March 14, 2014"}, {"Author": "Todd Machuca", "ReviewID": "R1ZODCTHMQPQ5", "Overall": "5.0", "Content": "Excellent machine. Far surpasses what I expected. Light weight bigger screen and much faster then the last version. Love it.", "Title": "Great", "Date": "March 14, 2014"}, {"Author": "alice lynch", "ReviewID": "R14P29E7WT9MF0", "Overall": "5.0", "Content": "Love my iPad air. It is so light and easy to use. I received it on the date that I was suppose to and have been having fun with it every day. Really like reading books on it so easy to read. Handy to use.", "Title": "iPad air", "Date": "March 8, 2014"}, {"Author": "Richard V.", "ReviewID": "R1KV98BFYI1VQ1", "Overall": "5.0", "Content": "This is a great tool! It's instantly on when I want to use it. I can take it anywhere and it's already to give me any information I need. I should have made this purchase a long time ago..", "Title": "Love this iPad", "Date": "March 8, 2014"}, {"Author": "Susan Macosko", "ReviewID": "R17IL5Q5NJ1QTD", "Overall": "4.0", "Content": "Having this kind of technology is a learning experience for me.  I am enjoying using \"facetime\" with my family.  It is much better than \"Skype\".", "Title": "Welcome to the age of technology", "Date": "March 7, 2014"}, {"Author": "Andrew Viernes", "ReviewID": "R3VTONI22U4AO6", "Overall": "5.0", "Content": "Have had every upgraded iPad since it's inception and this is the pinnacle of iPad design, functionality and style. Great battery life, screen resolution and weight.", "Title": "Awesome new ipad Air", "Date": "March 7, 2014"}, {"Author": "cset", "ReviewID": "R2N3F59CO5YKWX", "Overall": "5.0", "Content": "iPads are still the easiest to use, most versatile and best quality tablets on the market.  Samsung has some nice Android OS ones, but they are just as expensive and with Android you have so many different brands and versions of OS that it is impossible to standardize as a program/App may work on one but not on another brand or model etc. Apple just makes user support a non-issue. Power on and go.", "Title": "unbeatable", "Date": "March 7, 2014"}, {"Author": "V. Chevalier", "ReviewID": "R3RQFBRHRN1PCA", "Overall": "5.0", "Content": "When I'm home in my comfy chair, I still prefer using my laptop with the old keyboard and mouse; however, when I'm anywhere else, this iPad is wonderful!  It's fast, convenient and the battery lasts so much longer then my laptop battery.I'm not tech savvy and I have yet to learn a lot (like using word or numbers programs) but so far the old gal is thrilled with it.", "Title": "New tricks for an old dog?", "Date": "March 7, 2014"}, {"Author": "Luiz Ferreira", "ReviewID": "ROB775JLKVC9A", "Overall": "5.0", "Content": "I choose this raiting because I didn' nothing wrong. Absolutely  PERFECT.That's all I want. Beatiful. Light. Fast. Fast. Faster. Recomend to all my friends.", "Title": "Perfect!", "Date": "March 7, 2014"}, {"Author": "avidreaders", "ReviewID": "R1D53BTB8VHP81", "Overall": "5.0", "Content": "I should have purchased this much sooner much easier than carrying around my laptop.  Nice to share with my iPhone.", "Title": "Love it!", "Date": "March 6, 2014"}, {"Author": "Daniel", "ReviewID": "R1X23X4070M8NU", "Overall": "5.0", "Content": "This is a very nice and fast Ipad, quite light when you hold it in your hand. I warmly recomebd it.", "Title": "Best buy", "Date": "March 6, 2014"}, {"Author": "Devon white", "ReviewID": "RVSSHLI3AD0RR", "Overall": "5.0", "Content": "So just to let you know of my experience with IPad's I have owned the first generation the ipad 2 and know the ipad air and I can honestly say this is the best ipad yet. I loved my ipad 2 had it for 2 years it never skipped a beat. But know that I have the ipad air it's in a whole new ball park I wouldn't even say that the ipad 2 is even close to the ipad air. Performance wise I do a lot of multi tasking and it doesn't even break a sweat. The picture is brilliant very clear and crisp. The size and structure are amazing light and beautiful very sharp. It fits in your hands like a glove. It has a great camera for a tablet you wouldn't believe the pictures I have taken with this thing I get a lot if compliments all the time. As for its competitors the samsung note 10.1 2014 edition, the structure of this ipad blows it away. Know Samsung has its own perks that Apple doesn't offer but I would still say its a fair superior product then the note. That being said I do own a galaxy s4 smart phone and I absolutely love it I just prefer my phone to have a bigger screen,and it has it's other perks as well. mainly the galaxy gear watch sealed the deal for me. Hope this helped you into buying a IPAD AIR", "Title": "Best ipad I have owned", "Date": "March 5, 2014"}, {"Author": "Tina Mastrangelo", "ReviewID": "R11OZ51LS2CQ3L", "Overall": "5.0", "Content": "I received this promptly and love it!!Very easy to set up and sync with iPhone!Since I have ordered a cover and stylus", "Title": "iPad love it", "Date": "March 5, 2014"}, {"Author": "K. G.", "ReviewID": "R2KK7FNSNSUDXF", "Overall": "5.0", "Content": "It was exactly what I was expecting...love it!!  Also got a keypad to go with it and it is awesome!", "Title": "Exactly what I was expecting", "Date": "March 5, 2014"}, {"Author": "Jerry Kristan", "ReviewID": "R2S1U93978ZXLN", "Overall": "5.0", "Content": "Very handy to have on the end table as it acts as our TV guide. It is user friendly just like the i phone, we use it for looking items up on the web as well as paying bills on line and banking. The battery lasts us a week before needing a charge.", "Title": "Handy", "Date": "March 5, 2014"}, {"Author": "Sylvester A. Alfonso", "ReviewID": "R39N60J9TEQJ80", "Overall": "5.0", "Content": "Needed a replacement for my other iPad. Decided to get the upgrade and found this cheaper here than on apples web site.", "Title": "Everything is great,", "Date": "March 5, 2014"}, {"Author": "Mengmi Zhang", "ReviewID": "R1N2ESZ8FVNIP9", "Overall": "5.0", "Content": "Really great quality and like it alot. Cheaper than app store and still great quality. Save extra bucks to buy smart case and screen protectors lol. Well done", "Title": "love it", "Date": "March 4, 2014"}, {"Author": "Li Xuanran", "ReviewID": "R1691JHU19U5X5", "Overall": "5.0", "Content": "its a good good good good good product,sometimes little bit stuck，all in all it's a good good product any more", "Title": "Great", "Date": "March 4, 2014"}, {"Author": "Steven I. Arroyo", "ReviewID": "RR4FLZTBGGU93", "Overall": "5.0", "Content": "Great purchasing through Amazon, the iPad arrived quickly and works perfectly, no issues great upgrade from the 3 Gen. iPad I was using, a lot lighter, easier to hold", "Title": "Arrived quickly", "Date": "March 4, 2014"}, {"Author": "Wenhui Hu", "ReviewID": "RQW8QVW68OC8T", "Overall": "4.0", "Content": "love it, as it is new as what has been described. while sometimes the product reflects a little slow when you have been using it for a very long time. That's may need some development~", "Title": "good~", "Date": "March 4, 2014"}, {"Author": "Amy R.", "ReviewID": "RUX05YBNWU5NV", "Overall": "5.0", "Content": "What can i say....it has met and exceeded my expectations.  I wish i had purchase this thing earlier.  I love the way my iphone apps are automatically loaded over onto the ipad.  Some of the views on an ipad are different than the phone (like gmail, other apps I use often), some of them I prefer on the ipad, some i still prefer on the phone.", "Title": "Love my ipad", "Date": "March 4, 2014"}, {"Author": "Nicole carlson", "ReviewID": "R1X68FTIN2P9GI", "Overall": "5.0", "Content": "I choose this raining  because it was delivered right on time and with no issuesIt  was so good to just open the box and start working on the I padI wold recommend it to any one", "Title": "It is great and had no problems with delivery", "Date": "February 26, 2014"}, {"Author": "Shahab Pourtalebi", "ReviewID": "REDJRNH7GAWLQ", "Overall": "5.0", "Content": "I had an ipad 2 64GB 3G. It was a good tabled, but I never used more than half of the storage space. Now I spent less money and I have more facilities.", "Title": "Best tablet", "Date": "February 26, 2014"}, {"Author": "Randy B", "ReviewID": "R1YU4F51PTUQ45", "Overall": "5.0", "Content": "We have had iPad 2 for quite some time. They have been great but we bit the bullet and upgraded to these. So much faster, a bit smaller and with better graphics. A bit of a hassle getting all the apps loaded on but I am not sure if it was me or iTunes but it all worked out and everything is running nicely. The extra 16 GB of memory was well worth the extra cost.", "Title": "Terriffic upgrade to our new iPads", "Date": "February 25, 2014"}, {"Author": "KENNETH P.", "ReviewID": "R3JGQ1MGHSVE1R", "Overall": "5.0", "Content": "Apple is by far the best computer out there, i 've used other computers in the pass and i thought to myself that i would try apple to see what all the fuss was about apple, when i started using it the quality was so outstanding and the HD quality was magnificent, everything about Apple was excellent, i just feel in love with Apple and i hope to buy some more apple products in the future................", "Title": "Apple is by far the best computer out there.", "Date": "February 25, 2014"}, {"Author": "chris", "ReviewID": "R19ENXPB2BRNU8", "Overall": "5.0", "Content": "Pros: almost everythingCons: Movies look great I just with the iPad was 16:9 so the movies would fill more of the screen. I had the Sony table and the not 10.1 2014 and this by far is way better. I feel myself not using my phone as much.", "Title": "Easy to use great screen.", "Date": "February 25, 2014"}, {"Author": "D. Utterback", "ReviewID": "R2OM4RTB2ATHD7", "Overall": "5.0", "Content": "I haven't used it tons but I have read several books on it and am also using it for checking email and messages some. Also handy for the eBay app. Nicely made and sure looks like a great product! I've had an iPhone 5 for a couple of years so it was an easy step into using this since the operating system is the same.", "Title": "Very nice!", "Date": "February 24, 2014"}, {"Author": "Always Satisfied", "ReviewID": "R2FQJ90F66FJQX", "Overall": "5.0", "Content": "I like that I was able to beat the sales tax on this item - there are few other places where sale tax is not collected at source.Have not been able to use the item since it is a gift for someone else.", "Title": "Arrived on time and in great condition", "Date": "February 24, 2014"}, {"Author": "yolanda lewis", "ReviewID": "R3VLXFLFGPXKQW", "Overall": "5.0", "Content": "I love my iPad! It's great! I use it more than my laptop. It's light as a feather and so easy  manipulate.", "Title": "iPad", "Date": "February 24, 2014"}, {"Author": "KJoegg", "ReviewID": "R3BYVZCBK3EMC4", "Overall": "5.0", "Content": "I really like the lighter weight and slightly smaller dimensions of the iPad Air. Holding the iPad with one hand for extended periods just got a lot less tiresome. It's surprising how much difference it makes. Performance seems about the same to me. I recommend the iPad Air to anyone who spends a lot of time on the move and holding it to read or work versus sitting it in a stand.", "Title": "Light weight, great performance", "Date": "February 24, 2014"}, {"Author": "Jane C. Scott", "ReviewID": "R3UX9BK1SZ6HWL", "Overall": "5.0", "Content": "I love it.  I learn a new way to utilize it everyday. I do private tutoring and I am able to carry use it easily.... plus I have my own entertainment when traveling or waiting or whatever.", "Title": "Love it", "Date": "February 24, 2014"}, {"Author": "John Ryan", "ReviewID": "R99F4BEOZO0JF", "Overall": "5.0", "Content": "The new iPad Air is Apple's latest, slimmest, lightest release of their hand-held computer. Oddly enough, it's so beautifully easy to use (my one year old daughter loves playing with it), it's almost doesn't feel like a computer at all.A word of warning - this review is written for people who've never owned an iPad before - and are wondering what all the fuss is about. If you're thinking of upgrading skip down to the \"What's great about the Air\" section below, or just buy it - it's amazing.Just what's all the fuss about?--------------------------------------I used to own a laptop for work, and (very occasionally), it'd sit on my lap on the sofa, and I'd use it for pleasure (eMail, watching films or playing the odd game). Then I bought my first iPad, and the laptop became redundant, a boring \"work device\". Hard to explain, but the fact the iPad is so small and light, and you navigate around with your finger by pointing and gently swiping the screen makes the whole experience a lot easier - a lot more fun.Even my most \"luddite\" of friends have been won over.It's incredibly simple and easy to use (it only has one main button), and everyone from my one year old daughter to my 85 year old dad have taken to without problems. It's size and shape also support using it like a book (literally to read a book or web page), but you can also watch TV and films.Personally I'm also paranoid about my password getting \"hacked\", and someone running up a huge Amazon bill or buying stuff with my credit card on eBay. Well one of the benefits of the iPad (and iPhone) is it's \"almost impossible\" to get a virus - one of the most common ways to get hacked. This doesn't mean you shouldn't use strong passwords, (both Sony and Adobe got hacked), but it's reassuring to leave the Windows world behind.Finally, I love the way these devices (iPad, iPhone, Apple TV, Apple Mac), increasingly work together. The fact you can start a Pages document on your Mac and edit it on your iPad, or take photos on the iPhone, and in seconds see them on the iPad or Mac and display them on the Apple TV.The thing is, \"it just works\".What would you use if for?----------------------------------* Shopping online. Obviously - you could be reading a review on Amazon about the iPad Air!* Reading web pages. As you can hold it like a book it's great to read the news online (my wife loves the Daily Mail Online).* Reading Books. It's great for reading books from Amazon Kindle or Apple Books with the benefit of 1,000s of online book reviews* Navigating web pages. Instead of clicking with a mouse, you gently swipe your fingers on screen to scroll around* Watching Films. I use it to watch Netflix online videos (with an Apple TV you can send stuff to the telly)* Watching TV. With the free BBC iPlayer app you can catch up or download BBC programs* Reading and replying to mail. I use \"mailbox\" a great free app to read and reply to mails, but there's a free one included* Showing and organising photos. Any photos on an iPhone are automatically available within minutes in \"the cloud\"* Playing games. From fun puzzle games like \"Cut the Rope\" to fully fledged first person shooters.* Listening to the Radio. With \"Tune in Radio\" you can listen to thousands of radio stations world-wide.* Listening to music. I stream mine to an Apple TV, but you can also buy portable speakers or just plug into the AUX socket* Editing Word, Excel and Powerpoint documents using FREE App \"QuickOffice\" (owned and supported by Google).* Editing Pages, Numbers and Keynote documents (Office for the Apple) on the FREE Apple apps.* The list goes on and on.Update: You can edit Word, Excel and Powerpoint documents (plus Pages, Numbers and Keynote) on the iPad (although I'd recommend an external keyboard - see below). It's definately powerful enough, although I'd not expect these apps to cope with REALLY complex document layouts. Great for general letter and document writing though.Which model should I buy?----------------------------------I can't comment about Android tablets (apart from the Google Nexus 7 which is well regarded), but in terms of the Apple tablet line-up in order of cost:-1. Avoid the Apple iPad 2, it's a relatively old model, under-powered and with a lower resolution screen. If you really want an Apple but don't want to spend the cash, buy a 16g WIFI 3rd or 4th generation iPad from eBay. Avoid this one.2. iPad mini is a lovely tablet. A 7.9 inch screen and astonishingly light and remarkably thin - it feels like a light-weight book.3. iPad mini with retina screen. Again 7.9 inch screen, but with the blazingly fast A7 chip and a \"retina\" (high definition) screen. Worth the upgrade if you can afford it.4. iPad Air. Much larger screen size (9.7 inches - doesn't sound much but it makes a huge difference). Same fast (A7) chip as the Mini with Retina - the latest and fastest iPad available.Clearly (from my viewpoint) there's only really three options. The iPad Mini, the Mini with retina screen and Air.What are the Optional add-ons?-----------------------------------------Well, assuming you've dropped by the Apple Store or John Lewis (which I would highly recommend), and handled the iPad Mini (with/without retina screen), and iPad Air then your options are around memory size and cellular option.Memory: Once bought, you can't add memory (space for apps, films, books etc). However, the basic price goes up a huge amount (+£80 for the 16g to 32g iPad Air). But, having owned a 16g and then a 32g iPad - I can safely recommend the 16g unless you really want to store a huge amount of videos and downloads. Only you can decide, and if you're lucky enough that money is no object then splash out. Otherwise, 16g should be fine for most people.Celular: Allows you to connect to the internet while you're out and about. This will add an additional +£100 to the price and means you can slip in a mobile phone SIM card. This means (for an additional £7-15 a month extra), you can access the internet on the move. Alternatively, you can opt for the WIFI option, and use it at home or at at \"hot spot\" (eg. Starbucks, most rail stations and hotels etc).Personally I'd buy (and indeed did), the 16Gb iPad Air WIFI.Do I need anything else?-------------------------------Most people (me included) buy a cover. Apple (and now several copy-cats) make a \"smart-cover\" which automatically shuts down the iPad when you close it, and switches it on when you open it. There's versions which cover the back, or just the screen. Apple charge from £35 to £65 for their (admittedly) high quality fabric or leather covers, but there's many available from £10. Be aware, you do get what you pay for.Personally,I think it's a pity to cover the beautiful aluminium industrial design of the iPad with a cover - but if you've spent hundreds of pounds you'll want to protect it from scrapes and bangs.I also invested in a keyboard (£25-80), as I tend to write a lot of mails and documents (remember it comes with a word processor). I'd recommend the Logitech Ultra Thin iPad Air Case with Keyboard - Space Greyand the ZAGG Keys iPad Air Case Folio with Backlit Keyboard - Black although these are strictly optional unless you want to use your iPad as a proper laptop.Finally, if you have another Apple device (eg. an iPhone, Apple TV or Mac) you'll find these work together beautifully. For example, you can create a reminder on your iPad and it appears on your iPhone. Equally, photos taken on your iPhone appear on your iPad, and you can stream music or videos from iPad, iPhone or Mac to an Apple TV.Some people think this \"locks you in\" - but it's your choice.What's great about the Air?-----------------------------------* Lighter (30%) and thinner than the previous version (469g from 650g)* Even faster A7 chip. Blazingly fast!* Improved sound (compared to the iPad 4)* Software including+ iMovie - edit and publish home made movies+ Numbers - Fully functional Excel for the iPad+ Pages - Word processor+ GarageBand - Play a piano or a drum kit+ iPhoto - Edit and organise your photosWhat's not so great?--------------------------* The change in physical size means you'll need a new keyboard or replacement cover if you're upgrading* Pity Apple didn't include the \"touch ID\" to secure your passwordsOverall Opinion---------------------It's hard to believe the iPad version 1 was released just four years ago, and there's a huge raft of \"me too\" tablet computers to choose from, but the Apple iPad Air is still the one to beat. As \"Which?\" magazine (in the UK) put it - \"...the best tablet we've ever tested. Apple packs a beautiful screen and lightning fast processor into a slimmer-than-ever shell, and battery life is very impressive\".Yes, there are cheaper Android based alternatives, but the quality, design and beauty of this tablet just sets it apart. If it were a car it'd be a top of the range Mercedes or a BMW.Highly Recommended.", "Title": "Incredibly light, fast and beautiful. Is it the best tablet for you?", "Date": "February 23, 2014"}, {"Author": "Robert Garner", "ReviewID": "R2A8NVDAH0DGG5", "Overall": "5.0", "Content": "This is not my first iPad. The iPad Air exceeded my expectations. The speed is the greatest improvement and the feel (weight) is amazing.", "Title": "Apple does it again", "Date": "February 23, 2014"}, {"Author": "Dena Kimberlin", "ReviewID": "R2LHEMWU8IBPC7", "Overall": "5.0", "Content": "This amazing iPad is  sleek and very easy to manage.  It is easy to carry and so lightweight you do not really know you are holding an iPad", "Title": "iPad Air", "Date": "February 21, 2014"}, {"Author": "linda hughes", "ReviewID": "RGWALXES2Z8RS", "Overall": "5.0", "Content": "was gift for grand daughter.she is very happy with it she loves it .lightweight and does everything it says.no negative comments.", "Title": "i-pad air", "Date": "February 21, 2014"}, {"Author": "Cindi Hansen", "ReviewID": "R3GFV6XCW7ACOC", "Overall": "5.0", "Content": "This product is awesome! So fast and everything I would need in a tablet. Clear screen display as well. Perfect", "Title": "Great buy", "Date": "February 21, 2014"}, {"Author": "michael", "ReviewID": "R1A1BVYAMHU95R", "Overall": "4.0", "Content": "I love the graphics on hd photos like Facebook. A lot of apps and tons of music. A must have.", "Title": "Fast", "Date": "February 21, 2014"}, {"Author": "chris", "ReviewID": "R3UWYQEK4KVF6U", "Overall": "5.0", "Content": "Apple has earned the top spot for a reason and this is no exception. The new iPad air does all you can think of doing and more. I am extremely pleased with the purchase and wouldn't hesitate to buy another if the need arises.", "Title": "Totally wicked awesome!!!", "Date": "February 20, 2014"}, {"Author": "Xin Liang", "ReviewID": "R1T6KF4GPEJ5B5", "Overall": "5.0", "Content": "The delivery was so fast. It turned out iPad is still the world's best tablet and if you don't have an iPad, I totally recommend this iPad Air to you.", "Title": "PERFECT ITEM", "Date": "February 20, 2014"}, {"Author": "Michele L. Boyd", "ReviewID": "RYLVR0RLBIBW1", "Overall": "5.0", "Content": "The iPad is so easy to use that I don't turn on my other computer any more.  Wish I had it sooner.", "Title": "Love it", "Date": "February 20, 2014"}, {"Author": "Ramtech72", "ReviewID": "R2CYRQ4CLFH6EG", "Overall": "5.0", "Content": "I love it. I had before the iPad 3 and this is just great. Its size and weight are excellent, and the best price we could get. Your shipping was very fast.", "Title": "GREAT!!!", "Date": "February 20, 2014"}, {"Author": "The Guardian", "ReviewID": "RCZI8SDOCSF1B", "Overall": "4.0", "Content": "The iPad has established itself in four short years as the 'tablet of choice' to which all others are compared, and the Air is the newest and coolest in the family.First of all, the good news. At 467g the Air redefines computer portability and is so lightweight it's hard to tell whether you're carrying it in your bag or have in fact forgotten it, without looking to check. The Air has a fast A7 chip and the screen is a useful 9.7 inches; it's a breeze to use. The design of the graphics is so intuitive that any child or technophobe can master it and feel at home in a few minutes, which makes it the perfect entry-point into IT for someone who has so far avoided computers.One of the clever things Apple have done is the creation of the individual `Apple ID' which means once you enter your ID & password your iPad, iPhone, iPod and Mac immediately share all their files, and everything you created or stored on one device becomes available on them all: photos, music, reminders, address book, documents are all shared. This is probably the most brilliant idea ever in the IT mass market to create brand loyalty among consumers and `locks you in to the corporation for the duration'.Now, the bad news: the software crashes from time to time necessitating a reboot, which is annoying and inconvenient. This fault is acknowledged by Apple, as the software has a few bugs. Also the wireless reception is not all it might be, as it sometimes (mysteriously) fails to connect to even a moderately strong signal.Apple's pricing structure does not reflect the cost of manufacture but is driven by a market segmentation strategy, so the price really cranks up if you want an iPad with more memory or which can use the GSM phone network. The best value is the 16G Air without Cellular, which only connects to the internet via WiFi. 16G is a lot of memory by the historic standards of portable computers and you'll only find it insufficient if you want to store a lot of big files like films or powerpoint presentations.You'll need a carrying case to protect it (scores of different designs are available) and maybe a keyboard, which if you're doing a lot of writing and document creation rather than just surfing the internet is the one essential accessory, as without a separate keyboard the usable screen area is reduced in size. Around one million downloadable apps for Apple devices means you can personalize your iPad and make it into more or less whatever you want. The Air design is aesthetically a work of beauty in its simplicity, cleanness of lines and proportion, and despite some irritating niggles is a pleasure to own and use.", "Title": "The future is a breeze", "Date": "January 22, 2014"}, {"Author": "joedc831", "ReviewID": "RAIJ37X44JFHX", "Overall": "1.0", "Content": "They have a 10-15% restocking fee for returns that is not easily found on Amazon's website. Upon returning the unopened iPad Air to them, they charged me a $51.70 restocking fee.  Avoid Worldwide Distributors.", "Title": "Don't buy from Worldwide Distributors!!!  Restocking Fee for Returns!", "Date": "January 15, 2014"}, {"Author": "MORE THAN UNHAPPY!", "ReviewID": "R109F1FVFO7ZBB", "Overall": "1.0", "Content": "The iPads I purchased from TechGiant were not as they were described! When I took them to T-mobile to activate these \"brand new ipads\", I was told that they could not activate 4G on any of the 8 ipads I purchased! This was because all 8 were previously owned and blocked for FRAUD! TechGiant is selling previously owned items!  TechGIANT I would appreciate it if you contacted me directly to resolve this asap!", "Title": "BEWARE of unusable iPad Air!", "Date": "June 4, 2014"}, {"Author": "Elizabeth", "ReviewID": "RXW5V6IUCQIZW", "Overall": "5.0", "Content": "I bought this wonderful table for my birthday this month so far I have no problems with it it does everything and more .I would recommend it to anyone this tablet rocks I am a satisfied customer.", "Title": "I pad rocks", "Date": "March 26, 2014"}, {"Author": "Signalshifter", "ReviewID": "R1PG0RSEDGFJ0B", "Overall": "5.0", "Content": "I have had several iPod Touches over the years and I have always wanted an iPad. Well the iPad Air had all of the power, features, and storage space I was looking for.  I was looking forward to it's arrival and when I first started to you use it, it was somewhat of a wa-de-doo-da experience not disappointment but total familiarity because of all of the iPod Touch's I have. Then it started to grow on me, watching Crunchyroll anime, Amazon Prime movies, and it's prefect integration with my Apple TV all of this while being decadent in bed with my Irish Terriers snuggled up around me, total domestic bliss. It is a howler when you accidentally activate Siri while asleep my snoring it gives Siri fits.  I purchase the small Apple keyboard for it and this just enhanced the iPad more, now I have a really nifty alternative to a small notebook computer.  I have not commented of the functionality I suspect most of you out there are like me coming from another iOS device. I do notice some un Apple like bugs in iOS 7.01.and somewhat less in 7.1 but have a PC with Windows 8.1 installed so any minor bugs in iOS-7.1 are nothing compared with this disaster from M$.", "Title": "I love this thing.", "Date": "March 22, 2014"}, {"Author": "Carol L", "ReviewID": "RV8GCGFKFRA88", "Overall": "5.0", "Content": "Large , clear, easy to see. My husband does not like electronics, but he loves his I-pad. Shares what he likes with everyone who will listen.", "Title": "Just what we needed", "Date": "March 21, 2014"}, {"Author": "mindy rosenbloom", "ReviewID": "R3637KAZKBDYO1", "Overall": "5.0", "Content": "love the size portability battery life looks seek like having appshave the desktop mac air iphone this is the best", "Title": "best mac product", "Date": "March 21, 2014"}, {"Author": "Adam R.", "ReviewID": "R26IVP3W64PC4J", "Overall": "5.0", "Content": "This is a great device.  I am able to be very productive on it.  I pair it with my New Trent Airbender case, and it is almost like having a light laptop.", "Title": "Great Device", "Date": "March 6, 2014"}, {"Author": "J. Zajaczkowski", "ReviewID": "R33HKDXO136BFX", "Overall": "5.0", "Content": "I recently got the iPad Air 128GB from TechGiant and immediately after getting it I took it to my local Apple store to get AppleCare+ for it. After talking to 3 different reps and finally a manager it turns out that the model I actually received was the ME898E/A and not the invoiced, and what was on the package, ME898LL/A. After doing some research the manager determined that they could not sell me AppleCare because the model wasn't sold in the US, but instead in Mexico. The Apple store manager then advised me to return the iPad because not only did I not receive the model invoiced but also that if I had any problems with it I would not get any warranty service because warranties are not offered for Mexican sold Apple products.Otherwise, this is the best tablet I have ever used. Like any other mobile device or computer, it does have problems if you open every app without closing them. To close apps on your iOS 7 iPad, simply double click the home button and swipe upwards the apps you aren't working with. This way you can enjoy the cutting edge speed this thing is capable of.", "Title": "great device, but beware of third party sellers", "Date": "March 6, 2014"}, {"Author": "beatrice j seegers", "ReviewID": "R1SUXXIMMTN7O7", "Overall": "2.0", "Content": "I've tried hard to learn how to use my pad, but still finding it hard to use.I suspect this could be me...but it \"freezes\" up and I do turn it off and start over but some times it does not work.I'm thinking of giving it to my son and getting a laptop.I like the pad and the ease of using the keyboard.The size is perfect and it is not too heavy", "Title": "I find it difficult to get used to", "Date": "March 4, 2014"}, {"Author": "Amazon Review Dude", "ReviewID": "R2QU4ZAJZXRQ92", "Overall": "5.0", "Content": "This is definitely the best iPad I have owned.  I am upgrading from a 3rd gen retina iPad, but I've also owned an iPad 2 as well.  The weight of this thing is definitely one of the biggest draws.  The screen obviously looks just as good as the prior retina models, but the decreased bezel on the side is really nice.  I can almost palm the device and still have a full iPad screen.  I use it as my daily couch device every single day.  I think the iPad has gotten to a point where it can replace the need for a laptop for most folks.  While I still need a high performance desktop for various reasons, the iPad really gets what I need done when I am lounging around.", "Title": "Best iPad yet", "Date": "February 16, 2014"}, {"Author": "12Junes", "ReviewID": "R131F02L9OA31P", "Overall": "4.0", "Content": "After coming from the 1st gen iPad, this took some getting used to. There are things that I like and things that I don't, but I think it's just personal preference. I do think that my 80 year old parents would have had a more difficult time getting used to this one.", "Title": "Great Product", "Date": "December 12, 2013"}, {"Author": "Curt", "ReviewID": "RJ5E3PPGZEGQI", "Overall": "5.0", "Content": "I replaced a Samsung Galaxy tablet I bought just for fun.  It was ok, but was difficult to use, had limited apps, and seemed slow compared to my iPhone.  So I decided to try the iPad even though it was twice as much.I love this thing!  It's fast, intuitive, more apps, and just plain works better.  This tablet does so much more, works so well, I'm seriously considering going Apple instead of PC.  Don't think you can go wrong with an iPad, or iPhone either.", "Title": "Love it", "Date": "June 8, 2014"}, {"Author": "Sioux Hockey Fan", "ReviewID": "RNQY68DP984SQ", "Overall": "5.0", "Content": "I received this gift for Christmas this year after having waited over two years to finally make the jump into the tablet market. I can honestly say that I am happy with my choice.I personally found that the iPad Air has the perfect balance of portability, durability, productivity, app selection, and screen size for my needs. For me, it beats the rest of the tablet market right now.I got the 64GB Wi-Fi version, but found that I would have been more than happy with the 32GB version and a little bit of selective storage.iOS 7 is still not perfect for iPad yet, but honestly most Android skins aren't perfect either. Additionally, the app selection from the App Store specifically designed for tablets is just amazing.", "Title": "The best full size iPad yet", "Date": "January 20, 2014"}, {"Author": "Joe R. Sayers", "ReviewID": "R3JOM3CM6UT5OR", "Overall": "5.0", "Content": "I have bought an iPad in the past, the 2nd generation.  After having it for a few weeks, it was nice, but to me was just heavy, the dimensions (not including the screen) just seemed so big and it wasn't comfortable to hold.  I sold that one off, but recently decided to give the iPad Air a try, and I must say I am extremely impressed.  I know it takes a while for technology to sometimes get up to speed with what our expectation of it should be, and the iPad Air has definitely done that.The dimensions are great, it is SO light, SO thin, and it is not as wide or tall as the previous models, which make it much more comfortable to hold and use.The processor is so fast, and I can't help but continue to be impressed by all that comes along with that in use of apps, daily routines of email, facebook, games, learning apps, etc..  The hardware is also just absolutely beautiful.  Sure you can get other tablets at a lower price, but I don't think that the build quality, processor speed, or overall user experience can be matched.I love my iPad!", "Title": "I love the Air", "Date": "January 16, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1MDO7NKR4G044", "Overall": "5.0", "Content": "My IPad was received with a dent on the side where the box had also been dented. I was able to replace it at my local Apple Store.  I am not sure when this dent occurred but it took awhile before I wanted to go to the Mall and exchange it.With the holidays,  haven't had a lot of time to get to know my new IPad.  This week.", "Title": "My First IPad", "Date": "December 30, 2013"}, {"Author": "Tyketimer", "ReviewID": "R137ZBRF21H37E", "Overall": "5.0", "Content": "The iPad Air is an amazing device. I am impressed with the clarity & sharpness of the display and the thinness & decreased weight over the original iPad I have been using for several years. I would recommend the iPad Air to everyone who wants the very best in there tablet. You will NOT go wrong picking the iPad Air.", "Title": "Apple iPad Air 32GB Wi-Fi", "Date": "December 29, 2013"}, {"Author": "D2-X \"D2-X\"", "ReviewID": "R3R2AZ5Y76P81L", "Overall": "5.0", "Content": "I have years using iPad and this iPad Air truly is the best. It's super thin and lightweight makes it easy to use for play, work and even take pictures. Love it!", "Title": "Apple rules", "Date": "December 29, 2013"}, {"Author": "@akmclemore", "ReviewID": "R3P8C6WC66CV4P", "Overall": "5.0", "Content": "You really do have to experience this iPad to believe the amazement about it. Not only is it lighter, it is faster. much faster. Let's compare it with the iPhone 4 for instance. The iPad air is 3x as fast as that, making web-browsing and app downloading much easier.  I am really satisfied with this improvement.  Cons I noticed were the lack of an camera flash and fingerprint Id scanner.  I am using the iPad air right this minute to right this review and it has caught me surprise even though u did my research on the table before purchasing it two weeks before.", "Title": "Exactly what an iPad should be, and more!", "Date": "December 29, 2013"}, {"Author": "C. A. Arnold \"lazy reader\"", "ReviewID": "R1WDK2DKMEK91P", "Overall": "5.0", "Content": "Great price, great item.  Hate this rating system...Son loved it as it is his Christmas present, and he now takes it everywhere.  MUCH lighter than the normal iPad, which makes it perfect for a purse", "Title": "Perfect", "Date": "December 29, 2013"}, {"Author": "just me", "ReviewID": "R2X18GAYX9HWQW", "Overall": "5.0", "Content": "It's GREAT but I had to have a few people HELP me getting it started, as this is my 1st one and and they don't send you a user paper to tell you anything.... and old folks need a little something to follow along with, if i had a smart phone, they said it's about like that to set up....", "Title": "o.k.", "Date": "December 26, 2013"}, {"Author": "kim joseph", "ReviewID": "R3KZDREU91KCPH", "Overall": "5.0", "Content": "Love it!  It is faster and lighter, then the IPAD. I like it so much, especially for reading and for studying my music.", "Title": "Versatile, fast and intuitive!", "Date": "December 23, 2013"}, {"Author": "David W.", "ReviewID": "R22OGLEW2J897D", "Overall": "5.0", "Content": "My wife and I are both familiar with Apple products, but this is the first iPad we've ever owned. Because I'm not a tablet guru or anything (nor was I particularly concerned with the improvements between revisions), I can really only review the product from the simplest perspective: does the product meet my particular needs?My answer is definitely yes. As our first tablet, we were mainly looking for a mobile media hub that also can perform various utilities that we find important (finances, travel guides, recipes in the kitchen, ebook reading). The iPad covers all of those bases nicely, and it's all packaged in a very sleek, attractive design.My primary reason for purchasing this particular model is that I plan on this lasting as long as possible, and I was concerned that an older model would become functionally obsolete faster than a newer model.", "Title": "Looks great; met all our expectations.", "Date": "December 12, 2013"}, {"Author": "Joe Consumer", "ReviewID": "R25QATJS0DQ09G", "Overall": "5.0", "Content": "Lighter by far.  I love the large screen, but till now would find myself using the iPad Mini most of the time.  The iPad Air is light and comfortable to hold. The Mini is now the backup as I love the Air.  Speed increase, overall case size reduction, and weight reduction are all solid reasons for the upgrade.", "Title": "Padman", "Date": "November 12, 2013"}, {"Author": "Art Lover \"Art Lover\"", "ReviewID": "R18PG2QYWEFW0V", "Overall": "5.0", "Content": "As expected, an excellent product. Great battery life and graphics as well as availability and variety of apps.I am very satisfied with my purchase.", "Title": "Great Purchase", "Date": "May 23, 2014"}, {"Author": "Ken J. Erskine \"KJE\"", "ReviewID": "R1BVVV3GVE27QB", "Overall": "5.0", "Content": "I have a kindle fire, great for books but downloading videos is hit or miss and it would not connect to plane wifi.Have not had any of those problems with the iPad.Will probably go against the grain with this comment, also have an older iPad and I don't see a difference in download speed or picture quality--- not sure the $200.00 difference is worth it for the lighter weight, but no complaints regarding it quality or performance", "Title": "Great tablet", "Date": "May 14, 2014"}, {"Author": "jon mceachron \"(JDMc)\"", "ReviewID": "R3AJAQ0ZFLO5OJ", "Overall": "5.0", "Content": "(Disclaimer - I am a tech researcher during my day job...)So I get to work with a lot of different tools/technologies/devices.The Apple iOS devices were a hit from day #1.  Our household acquired one of the original iPods, followed by phones, tablets, and the Apple TV.  They reproduce like bunnies!Still a little pricey - all Apple Stuff is - but cheaper through Amazon than at my local Apple store.  (And I don't have to elbow my way through the mall...)JDMc", "Title": "Yup.  The Apple devicecount just keeps growing and growing...", "Date": "May 10, 2014"}, {"Author": "lishousong", "ReviewID": "R1UROO8VBZGJYC", "Overall": "5.0", "Content": "I like the item very much! I think I will buy it again and tell my friend who want to buy it.", "Title": "Very good", "Date": "May 10, 2014"}, {"Author": "Michael Hooker", "ReviewID": "R234KC8JAK7HC8", "Overall": "3.0", "Content": "1st iPad. I own a Kimdle HD. The Kindle is easier to manage files. Kindle has a free App of the day, nice little perk. Apple is faster. But, all the proprietary issues, operating system, cables, and iTunes, detracts from the tablet experience.", "Title": "Just too difficult to manage", "Date": "May 9, 2014"}, {"Author": "David McDonald", "ReviewID": "R32NW95IXJZNCS", "Overall": "5.0", "Content": "Good product at a price that is lower than Apple.com because you don't pay sales tax (except California I think).", "Title": "Great deal", "Date": "May 7, 2014"}, {"Author": "bhscr", "ReviewID": "R3EQ6K6G8O6HO7", "Overall": "3.0", "Content": "i bought get the ipad air at 4/2/2014. but after i check the imei on the new. the ipad already being active at 1/26/2014.", "Title": "NOT BRANDNEW", "Date": "April 6, 2014"}, {"Author": "Cyndy", "ReviewID": "R36V3S5DBBKBIM", "Overall": "4.0", "Content": "I have loved my ipad however I bought a cover for it and it fell out the door of the truck and the front shattered even with the cover on it.", "Title": "Ipad", "Date": "April 1, 2014"}, {"Author": "Karen Ballard", "ReviewID": "R2I4I2RC7AFJOH", "Overall": "3.0", "Content": "Nice looking, well laid out system, but the wifi is very slow to load.  Would have liked a system preference pane where everything is easy to find and pull up.  I think it is overpriced.", "Title": "Too pricey for the unit", "Date": "April 1, 2014"}, {"Author": "Deepam Panchal", "ReviewID": "R2GQ90JRKA0YAK", "Overall": "5.0", "Content": "It is perfect!!!!!Light weight and powerfulI use it for work, jotting down ideas and watch movies on Netflix.", "Title": "Perfect tablet for my use.", "Date": "February 6, 2014"}, {"Author": "Marsha F.", "ReviewID": "R3PQWMS937GG8Q", "Overall": "5.0", "Content": "Bought this for my husband for Christmas. He loves it. Takes it everywhere. No crashing issues with the OS like on his Iphone. Screen is amazing. Pictures and video come out great. Would highly recommend.", "Title": "Love!", "Date": "February 1, 2014"}, {"Author": "Thomas G. Field, Jr.", "ReviewID": "R3O5X6J8W8BDR7", "Overall": "4.0", "Content": "After a couple of weeks, I stumbled onto the manual (using my macbook). After a few hours, I figured out how to locate it and  load it on the iPad. Now, I'm trying to figure out why it wasn't pre-loaded. I'm sure there's a good reason that will come to me shortly.", "Title": "User manual is not preloaded", "Date": "February 1, 2014"}, {"Author": "Ed Shuey", "ReviewID": "R21NZ3JDKOOJDZ", "Overall": "5.0", "Content": "Waited years before purchasing, read dozens of reviews, tried other manufacturers' products, and listened to others' opinions.Apple is at, or near, the top of their game obviously.Design, tooling, functionality, aesthetics, all of it really, are on the mark. Throw in the \"it\" factor and this is what you get.", "Title": "More Than Satisfied", "Date": "February 1, 2014"}, {"Author": "jerome hammond", "ReviewID": "R3RO0MZNFFJVAY", "Overall": "5.0", "Content": "This was an upgrade from the original iPad, which was still in top working condition and being used daily. The product arrived earlier than expected in perfect condition. I've been using it now for 24 hours and my assessment is that it's exactly what we've come to expect from Apple - a product that feels great in the hand, looks great to the eye, and operates exactly as the mind would have created it. I look forward to 3 more years of trouble-free use from this outstanding Apple product.", "Title": "What you've come to expect from Apple", "Date": "February 1, 2014"}, {"Author": "Scott Crabtree", "ReviewID": "R3MRVFN9AKYGGG", "Overall": "5.0", "Content": "This is one of the pricier tablets, but I never have any problems with it.  The picture is great on it, and there's a ton of apps.  One gripe is having to download a browser that can handle flash.  That is just nitpicking at this point.  I mostly use it for netflix, hulu, xfinity streaming, and surfing the internet.  It is everything I thought it would be.", "Title": "They were who we though they were", "Date": "January 31, 2014"}, {"Author": "Mike Lockridge", "ReviewID": "R39TI6FZE4GSZ8", "Overall": "5.0", "Content": "My wife is really enjoying her Ipad Air.  She likes the size to watch her videos.  She enjoys playing her games on it anywhere she goes.  Also the picture is the best we have ever seen and we have seen quite a few desktop monitors, laptops, phones and tablets.", "Title": "Gift for my wife", "Date": "January 30, 2014"}, {"Author": "Sarajo Esch", "ReviewID": "R2JB2RHZAK4TUP", "Overall": "5.0", "Content": "Still learning to access all the great features. We are really enjoying the many features on this ipad. Delivery was very prompt.", "Title": "Great Christmas present!", "Date": "January 7, 2014"}, {"Author": "David Kent", "ReviewID": "RNEN846FHORIX", "Overall": "5.0", "Content": "This is our first \"pad\" so we have nothing to compare this product to but so far we love it.  It does everything that we wanted.", "Title": "Very nice", "Date": "January 7, 2014"}, {"Author": "ONLY2222", "ReviewID": "R1Y37C3PEEEZIP", "Overall": "5.0", "Content": "EVERYTHING ARRIVED PROMPTLY WITH ALL COMPONENTS AND ALL OPERATED.  PRICE WAS IN LINE WITH APPLE STORE.  EASY SET UP AND INSTALATION OF MY IPHONE APPS.", "Title": "IPAD AIR", "Date": "January 7, 2014"}, {"Author": "Sailor", "ReviewID": "R3TNSP6G5B6HSK", "Overall": "5.0", "Content": "Oh my goodness, this is the best thing since popcorn! Haven't owned an iPad before but I can't imagine not owning one now. Retina display is awesome, can't find a single thing that is not simply awesome, was so easy to set up.", "Title": "iPad air", "Date": "January 7, 2014"}, {"Author": "Chris Rucker", "ReviewID": "R3U86ROZMV60HO", "Overall": "5.0", "Content": "It was just as described . A brand new unopened ipad air 32gb space grey product. The product has served me well and havnt had a problem out of it Will do business again .", "Title": "Ipad air 32 gb space grey", "Date": "January 7, 2014"}, {"Author": "skipreed", "ReviewID": "RJ1KH2YAWVOTQ", "Overall": "5.0", "Content": "The Apple iPad Air, with 128 GBT, looks great and functions very well.  I bought it as a Christmas present for my wife and she really likes it.", "Title": "Great Product", "Date": "January 7, 2014"}, {"Author": "Richard Philips \"foot doc\"", "ReviewID": "RIM9SU6MXTRWE", "Overall": "5.0", "Content": "The speed of the ipad is great and many apps available for the ipad. This is my second ipad and they have only made it better.", "Title": "The Best.", "Date": "January 7, 2014"}, {"Author": "DONALD MIDGETTE", "ReviewID": "R2JEKEVW0808LS", "Overall": "5.0", "Content": "THE IPAD TURNED OUT TO BE ONE OF THE BEST GIFTS. I RECOMMEND TO ANYBODY WANTING A MANAGEABLE DEVICE. GO APPLE", "Title": "GREAT IPAD", "Date": "January 6, 2014"}, {"Author": "Rustam", "ReviewID": "R31WY8ERT5JDDS", "Overall": "5.0", "Content": "I like these guys, they have fulfilled all my needs. I have order like new (open box) item, but received a brand new never opened one. I love it", "Title": "Great", "Date": "January 3, 2014"}, {"Author": "RRA", "ReviewID": "R1J2LFKGFYTUWO", "Overall": "4.0", "Content": "This item was the correct size, easy to carry and gives me what I need to use my iPad air.", "Title": "Perfect for my iPad air.", "Date": "December 31, 2013"}, {"Author": "Davey Williams \"davey williams\"", "ReviewID": "R3BD3NRCM6XUU6", "Overall": "5.0", "Content": "Apple does it again.The iPad Air is indeed revolutionary, building on everything the existing iPad generations have accomplished and offering a little more. Apple has continued improving and offering what they deem most important about these devices - usability, great display, wide range of inexpensive apps, durability, quality and lightness. They have not added features that some other tablets offer, but which may not be needed by everyone.ProsThe thing is zippy, looks great and works out of the box. Any questions I have or problems are quickly addressed by the Apple support community or the Genius Bar. There are a ton of apps, many free. IWorks and iLife are free, so I was up and running on Pages and iMovie in ten minutes at no cost. And it's LIGHT. I didn't think 0.4 lbs would be abig deal, but it is. For me, it crosses the threshold where sometimes I freak I left it behind because I can't feel it in my bag, and it's comfortable to hold continually.ConsApple didn't include a slipcover keyboard, but you can buy one in the Apple Store. It's a bit more expensive, but it's more durable, of higher quality, and retains more resell value than competitors. It doesn't have all those add-ons that one in one hundred users would use, which would make it weight as much as the surface or a garden brick.It's a five star device. The Surface may be too, I'm not sure, I don't own one. Go use both in the store, and get the tablet that works for you.", "Title": "Apple does it again. Great device.", "Date": "November 26, 2013"}, {"Author": "JcTenn", "ReviewID": "R2RLLJ5CJOK5MI", "Overall": "3.0", "Content": "I had to take it to the Apple store where they replaced it, but told me that the warranty began upon original purchase.  The iPad was new,but had been purchased by the person who sold it to me.  It all worked out, but be aware and ask about warranty info before purchasing to make sure you're covered. I don't think it was due to any wrongdoing or misrepresentation of the seller, just some due diligence.", "Title": "The iPad didn't work properly", "Date": "May 11, 2014"}, {"Author": "jahnny", "ReviewID": "R2AEFTL0X558WC", "Overall": "5.0", "Content": "It does every thing my laptop can do and I can use it anywhere I use it for mostly school", "Title": "Love it", "Date": "January 29, 2014"}, {"Author": "Patrick J. Webb", "ReviewID": "R1BT7HMPD3DJ33", "Overall": "5.0", "Content": "Other than not being able to use Flash Player this is an excellent product. 9 out of 10 for no Flash.", "Title": "Excellent", "Date": "January 28, 2014"}, {"Author": "J. Powell", "ReviewID": "R205T84XGYQMQ1", "Overall": "5.0", "Content": "What can I say. It is made by Apple, it works every time. Retina display is beautiful and makes picture taking a whole new experience...", "Title": "Nice.", "Date": "January 28, 2014"}, {"Author": "Khalid aljamei", "ReviewID": "R2DZ0KCOMYT4VD", "Overall": "5.0", "Content": "its really nice, useful, and will change your whole experience, its nice to have, don`t miss it.really something new", "Title": "perfect", "Date": "January 28, 2014"}, {"Author": "James Lawrence", "ReviewID": "R2X2LXS8Z8VZ9V", "Overall": "5.0", "Content": "The ipad is great. The problem is my wife wanted a white one and as you can see that is what I ordered, but what I got was an all black one. Not  pleased with that at all.", "Title": "Service not good", "Date": "January 17, 2014"}, {"Author": "Frank D Kot", "ReviewID": "R3HK0DQL92JECY", "Overall": "4.0", "Content": "Product was a gift for my grand-daughter. - She will be using it in Middle School where everyone uses tablets.", "Title": "Product meets need of student", "Date": "January 12, 2014"}, {"Author": "RICHARD DANDRADE", "ReviewID": "RPLGS6V47S6DK", "Overall": "5.0", "Content": "Because it was worth the money and i couldn't beat the price anywhere else.The shipping was a bit slow but i got it before christmas and that's what was inmportant. Brand new, never opened.", "Title": "Great buy at a very competitive price.", "Date": "January 11, 2014"}, {"Author": "Edward L. Byars", "ReviewID": "R2F88WDUKFW79P", "Overall": "5.0", "Content": "Everything was as expected and as advertised.Great value for the price.New in box with charger.Met my expectations.Super fast shipping.", "Title": "Excellent product", "Date": "January 10, 2014"}, {"Author": "donyelle", "ReviewID": "R2U7X0HX11T8NU", "Overall": "5.0", "Content": "It's worth the investment. Portable light weight and everything you need to work smarter not harder. Came brand new in box", "Title": "No problems to date", "Date": "January 7, 2014"}, {"Author": "Wendy", "ReviewID": "R18SZF7JD9MMV2", "Overall": "5.0", "Content": "In good working order and no issues with product so far.  It was recevied a little late but still before Christmas.", "Title": "As Expected", "Date": "January 6, 2014"}, {"Author": "Shev", "ReviewID": "R3VG29B3881N4M", "Overall": "5.0", "Content": "Everything was as expected. Happy to purchase this product. I ordered this as a gift for someone for Christmas and they loved it.", "Title": "Excited", "Date": "January 6, 2014"}, {"Author": "Alex Dailey", "ReviewID": "R30YI2AGYLKYTW", "Overall": "5.0", "Content": "Nothing bad to ever say about an Apple product. It's new design is extremely worth the purchase. I would always recommend it over the rest.", "Title": "As always Apple does it right!", "Date": "January 6, 2014"}, {"Author": "Doug White", "ReviewID": "R3ML66NJ0D56NZ", "Overall": "5.0", "Content": "Really nice the best I have ever owned really nice to play games on it was the best ever present", "Title": "Great", "Date": "January 5, 2014"}, {"Author": "SMT", "ReviewID": "RQPOJWQNQFZK1", "Overall": "5.0", "Content": "This is my second iPad, I love it, what can I say? they know how it is done. My fourth apple device. love them", "Title": "Totally incredible", "Date": "January 5, 2014"}, {"Author": "Ashley Richardson", "ReviewID": "RF6AWHG1XOWJ8", "Overall": "5.0", "Content": "Everything I had expected. I upgraded from an iPad2, this is a great device. I would recommend this product! I received my shipment fast and the iPad air was a great price.", "Title": "Loved it!", "Date": "January 3, 2014"}, {"Author": "Phill \"PhillFlash\"", "ReviewID": "R2LF8ZNUI25SUX", "Overall": "5.0", "Content": "I'm glad that I opted for this model.  Everything functions as it should.  Very easy to configure right out of the box.  Very little setup time.", "Title": "Fantastic Item", "Date": "January 3, 2014"}, {"Author": "Norrlater", "ReviewID": "R32T2ZNF14R9F6", "Overall": "2.0", "Content": "The Ad says \"Ipad Air with plastic,no box'' Here's what you will get: It comes in a 9 inch cubical cardboard box-The Ipad still has the sealed cloth bag around it and is wrapped in bubble wrap. There are 3 little air pillows around it. That is ALL YOU GET, period. I never even opened up the cloth bag to look at the actual Ipad so I will assume that the \"with plastic\" means there is the thin plastic screen protector, in place. I will never know because I didn't open the cloth bag. Its true that there is ''no box'' but there will also be no instruction booklet, no USB cable, and no charger. (seller later told me he would send these accessories, which normally come with a \"New\" Ipad air-.One can merely speculate what happened to the originals. I had  assumed from the original Ad that the only thing that would be missing was the original box. Also, I was a little surprised when an email from the seller said \"iPad its brand New, it cover under apple's limited warranty.Model Verizon - put a sim card and use anywhere\"---thats a cut and paste.......The surprises just kept on coming. It went back in the original box, back to Amazon and out of my life.", "Title": "Beware of what Ipad you are really getting", "Date": "February 10, 2014"}, {"Author": "Jimmy Crites", "ReviewID": "RB0CYABU3MR9O", "Overall": "4.0", "Content": "I hate the new charger/USB cord, all my iPhones and old iPad chargers won't work, and I have them all over the house, truck and work. But as far as the iPad goes, it works well.", "Title": "Good iPad", "Date": "January 30, 2014"}, {"Author": "bajangna \"bajangna\"", "ReviewID": "R1RSUPL9K57KEB", "Overall": "2.0", "Content": "This Ipad air is not for who love surfing internet, it crashed all the time. Very annoying. Apps mostly good. Design is great. But It's not worth even I got 32GB model for 515 included tax. Buy it for my girl. Wish it will be the best gift. No it's not.", "Title": "Not what I expected.", "Date": "December 26, 2013"}, {"Author": "SpaceCat", "ReviewID": "R2P1VQC10SKXPX", "Overall": "2.0", "Content": "I bought this product primarily to stream movies and videos.  Although the screen is fantastic, and obviously built for HD, Netflix appears in a quality even lower than standard definition.  I have done a lot of research, and discovered a lot of folks are having this issue with the iPad Air.  After troubleshooting and trying all the fixes I could find, this is a dealbreaker for me, and it is getting returned. If you don't have Netflix, you might not notice this flaw.  Other streaming services seem to work okay.  Netflix told me it was an Apple issue.Although not a dealbreaker, I was also surprised how fast the battery drained on this device after hearing it praised in reviews.", "Title": "Does not stream Netflix in hd", "Date": "December 1, 2013"}, {"Author": "Charlie P.", "ReviewID": "R9CGKSVPE7QDE", "Overall": "4.0", "Content": "I have the newest ipad but would like to purchase the ipd air 128GBI would like to use it for work docs to work at homeI would like to copy docs from work on a stick and download to my ipad airTell me is this possible. Is there a USB port on an ipad air", "Title": "I need a USB port ???", "Date": "January 4, 2014"}, {"Author": "Ken H.", "ReviewID": "R3NT1XHW2KQFGE", "Overall": "2.0", "Content": "Upgrading from an iPad one I have to say that overall this is a very good machine. My main disappointment is that Apple did not add more RAM. While the machine does not crash as much as my iPad one did, Safari crashes on me at least 2-3 times a day. At a cost of about a dollar Apple could add an extra gigabyte of RAM to this device and make it much more valuable to the consumer.", "Title": "Big improvement in design, little improvement in Safari crashes.", "Date": "November 21, 2013"}, {"Author": "Drew Bandas", "ReviewID": "R2QMQMLEXKFPCB", "Overall": "5.0", "Content": "I have never owned this product, nevertheless it's a fantastic product. It is very expspensive but worth it! My sister is shopping for an IPad and this would be perfect it even has a touch screen! Wow! I'm sure if I owned this I would use it for various activities, such as ordering Chinese food or watching Garfield 2. What a great  movie, I can't believe a movie about a cat that like lasagna could be such a cinematic masterpiece. Back to main idea here, this is supposedly a great product, and I say wow!", "Title": "Wow so many gigabytes!", "Date": "March 15, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RCLGKZX3C2LD9", "Overall": "1.0", "Content": "I don't understand ， i need a black one 。 why i got a white one ？ don't you have a good sense of colours ??", "Title": "totally wrong colour", "Date": "May 16, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R1AVQNOU7NSTV7", "Overall": "2.0", "Content": "Purchased the iPad Air for my son who plays with it all of the time.  We had to reformat or reboot it last week already because it was frozen and would not turn on at all.  After the reboot or reformat it has worked fine ever since.  (Pushed the circular button on the bottom and the main startup button on the top right corner at the same time and held until unit started up again)", "Title": "Not Overjoyed", "Date": "January 2, 2014"}, {"Author": "Sean Slawik", "ReviewID": "R1CRLDM6WXA8P4", "Overall": "5.0", "Content": "Product came in an orderly fashion. Didn't get to use it because it is a Christmas present, so I will update this review once it is opened and being used", "Title": "Great!!!!", "Date": "December 10, 2013"}, {"Author": "Petra E. Pershall", "ReviewID": "RH0NQSVS250M4", "Overall": "2.0", "Content": "I just purchased the iPad Air as a Christmas present for my grandson and so far I have had several problems with it.  I cannot get it to connect to my home Wi-Fi and had to have my business tech person work on it.  It was plugged to charge since before noon yesterday and as of 6 a.m. today, it had only charged 99%.  I have a iPad 2 and an iPad 4.  I wish that I had purchased one of those instead of the Air.  Hopefully, it won't crash on Christmas Day b/c my grandson is only 5 and won't understand why it doesn't work.  He uses my other iPads with no problems.", "Title": "iPad Air", "Date": "December 23, 2013"}, {"Author": "Carter \"O.C.\"", "ReviewID": "R3L8JINUOZZDB5", "Overall": "3.0", "Content": "It's not a bad tablet by any means... one of the best BUT i'm slightly annoyed that it doesn't have the features i'm so use to using. My friend got me this as a gift to try to win me over to apple products... I gave it a go but It's just not for me. I decided to stick with my Samsung Galaxy Note 10.1 2014... I love using two screens at once.Pros: Really just the new design although I tend to have issues with the new bezel when holding it, you have no choice but to have one finger on the screen which sometimes causes issues with apps. and its smooth which is greatCons: Not enough features,  and boring. This was cool years ago but with tablets out there that allow multi screen and other amazing stuff...I gave it a go guys, and I really wanted to not be bias in my review. Hopefully you were able to see that. I think if you like the other Ipad's you will be happy with this for sure. If you want a much more amazing experience then i'd say go with the Samsung Galaxy Note 10.1 2014 or even a surface tablet.", "Title": "I tried but wasn't for me", "Date": "November 3, 2013"}, {"Author": "Kimmy", "ReviewID": "R3RZZIP3RS6P5N", "Overall": "3.0", "Content": "Given the competition from Samsung Apple scores low. I own both a Samsung Note 10.1 and the wife owns the Ipad air. She is returning the Ipad be cause it is not as great as my Note 10.1. If I had bought this 2 years ago the competition to the ipad was barely there. Now Appke has to tey a little harder to catch up again.", "Title": "Just ok", "Date": "December 2, 2013"}, {"Author": "adsum \"dilligad@peoplepc.com\"", "ReviewID": "R1ZFI7JVOYW7TM", "Overall": "5.0", "Content": "Apple is like a Lexus/BMW/Infinity versus the others being a VW/Fiat/Kia. Sorry if this hurts someone's feelings- that is my EXPERIENCE.", "Title": "You get what you pay for", "Date": "December 7, 2013"}, {"Author": "juan b matos", "ReviewID": "RTRDLBCN76A58", "Overall": "5.0", "Content": "was a plassent buy  i very hapy for the item i buy fron the seler trait you goin to like this is the best ipad they make very light and i have what i want", "Title": "was a plassent buy  i very hapy for the item i buy fron the seler trait you goin to like", "Date": "December 6, 2013"}, {"Author": "asul", "ReviewID": "R2S0IRXD2WN9EL", "Overall": "2.0", "Content": "I got this last month and it became unusable to me. I got 4 replacements from Apple and they all kept on crashing.  Check out my review here [...]", "Title": "Not good", "Date": "December 13, 2013"}, {"Author": "Capt. McPl0x", "ReviewID": "R2YLISQO65IBEL", "Overall": "3.0", "Content": "There is NO reason for you to go out and buy this product is you already own the last generation version.  The differences are negligible.Apple should stop flooding the market with JND products ( just-noticeable difference) to rake in billions of more dollars.They should focus on making something that is truly new - not just a 5% upgrade of a previous product.", "Title": "Same ol' same ol'", "Date": "November 11, 2013"}, {"Author": "Carter \"O.C.\"", "ReviewID": "R1PM9J9SMY6EOP", "Overall": "3.0", "Content": "It's not a bad tablet by any means... one of the best BUT i'm slightly annoyed that it doesn't have the features i'm so use to using. My friend got me this as a gift to try to win me over to apple products... I gave it a go but It's just not for me. I decided to stick with my Samsung Galaxy Note 10.1 2014... I love using two screens at once.Pros: Really just the new design although I tend to have issues with the new bezel when holding it, you have no choice but to have one finger on the screen which sometimes causes issues with apps. and its smooth which is greatCons: Not enough features, and boring. This was cool years ago but with tablets out there that allow multi screen and other amazing stuff...I gave it a go guys, and I really wanted to not be bias in my review. Hopefully you were able to see that. I think if you like the other Ipad's you will be happy with this for sure. If you want a much more amazing experience then i'd say go with the Samsung Galaxy Note 10.1 2014 or even a surface tablet.", "Title": "It's nice looking but not for me", "Date": "November 9, 2013"}, {"Author": "Macuser", "ReviewID": "R1HPDY2MUUX9BD", "Overall": "2.0", "Content": "ipad has been nothing but fustration. There is no menu bar....no File, Edit, View, etc. So you cannot command the ipad to copy, paste, save, find file, etc. You cannot create folders.  So even if you could figure out have to save a document, you could not put it a folder.  There is not even a desktop like on a Mac!  So you cannot save things to the desktop where they are easily seen and manipulated.  With regard to email, the email programs on a iPad are very abbreviated versions of regular Macintosh mail programs.  So it's very hard to figure out how to compose, edit, quote, etc. because they are wildly different programs than what's on a Mac.  The highly touted \"fast Wi-Fi\" of the iPad Air turned out to be a cruel joke. At restaurant Wi-Fi hotspots the iPad browsed the internet slowly and it took many minutes for the email to load.  I will be returning this iPad because I cannot accomplish anything with it.  It's attractive looking and the retina display is very nice, but I can't get any functionality out of it. I need a real computer that's easy to use - a Macbook Pro laptop with retina.", "Title": "Not User Friendly Like Mac Desktops and Laptops", "Date": "December 11, 2013"}, {"Author": "RICHARD A CRABBE", "ReviewID": "R3K84MX7596GJT", "Overall": "1.0", "Content": "The ipad-air  has been out for some time and it is obvious the battery lets it down. There is no point in having a gadget if its battery cannot be charged. What is interesting is that Apple does not seem to care. As it stands, I will not recommend it to anyone.", "Title": "iPad-Air Battery", "Date": "January 11, 2014"}, {"Author": "Dwight", "ReviewID": "R2OCSO7W1RW8R3", "Overall": "5.0", "Content": "Do not overcharge the nonremovable battery and prolong the longevity of this device with its huge sunk cost.Retina Display from what I can tell is wherever you have your ipad - be it six feet higher than your head or far off in the corner of the room, you can see the display.  It's tv quality display unlike the laptop or regular computer screen that is not visible if you are standing off to the side or too far away.I still hate touch screen tablets preferring the keyboard control of laptops but I have no regrets about this family purchase.  It does load internet pages faster and it does have the best display I have ever seen (but we are not a high tech wares household).  You can see the images from different angles from distances unlike how you need to position yourself to view a laptop screen.  So basically the high price can be somewhat justified in that for the price of a really good laptop - you can get a tv quality screen.  If the iphone had come out with a bigger screen like the Samsung Galaxy Note 3, I wouldn't have supported the purchase of this device and I would have been wrong about that but my brother has been sick and this makes him happy every day when he holds it - he smiles to himself.  After a few weeks of holding it carefully in a plastic bag!, we finally got the nearest perfect case for it: the i-Blason Apple iPad Air / iPad 5 ArmorBox Kido Series Light Weight Super Protection Convertable Stand Cover Case (Black).  I wanted the Speck handyshell of the Tylt stand but I as wrong.  The iblason folds under making it sturdier and better especially on a bed.We have screen protectors on front and back because this looks like the iphone 5s in that it is prone to scratches.We went with 64 gb after deciding on the 32 gb because nevermind Apple's profit margins, it was worth a hundred dollars more to prolong the life of this device.  Hopefully, this will be the only ipad we ever own.  We know people who still have their one and only ipad 2.This is another nonremovable battery so don't overcharge it.  You need to break out the included adapter because it's designed to be powerful enough to charge this ipad.  Iphone adapters will probably give you the message that the device is \"not charging\" after lighting up for a few seconds with the charging symbol when you first plug it in.It is thin but it is like a hard wafer - so it still FEELS thick in some ways - but it turns out one pound FEELS heavy to us so we didn't mind putting a fat case on it and ruin the thinness of it.  For the first few weeks without a cover, it didn't feel like that comfortable in the hand but then neither did the iphone 5s without a case.Holding something thin like the Air or the 5S does not make the device feel grounded but I definitely do not prefer the ungrabbability of the laptop - it is always a chore to haul a laptop.I don't doubt after living with the Air that Apple will be putting out much bigger Ipads in the future - it's the grab and go quality that is the selling point and we need bigger screens - this will then cut into Roku's competitiveness because Apple WILL put out an Ipad that is just large enough to make owning a tv set nonessential - it just needs to be bigger enough to be a few feet from the eyes.  Apple TV has real competition in the Roku but a bigger Ipad would not only be a laptop killer but it could make flat screen tvs less important.***********you can stop reading if you just need to decide if this is a good device - it is.  It also happens to be exponentially more expensive than Android and Windows tablets.The Apple walled garden feels BIG - it doesn't feel like the Android one which makes you feel like you went the a la carte route - you got a removable battery and removable memory with your device and you're feeling clever about saving money but the trade off is that you always have to scramble and you are NEVER SURE that you got everything covered (think of Apple as frustrating and expensive American citizenship as opposed to being a citizen of the European Union - Apple SUX!)  Android is missing apps and you notice when shopping at apps that it doesn't feel like the Apple App Store on the device - it doesn't feel like you have almost internet-size reach within the Apple universe.  It doesn't give you the feeling that you are receiving the goods first.  Android updates can be wonky and there is no accountability there - Samsung just apologizes if bad code screws up their phones that you now own and those updates with the unappetizing names that only sound good in theory but are all frankly, DREADFUL foods are never guaranteed for your particular device.  It feels like there is no recourse, no genius bar, nothing if there is malware or some other software problem.I'm not happy at all with Apple because of the nonremovable battery and the tough luck attitude if you plunk down way too much money BUT I can't trust the Android products at all BY THEIR VERY NATURE.  Google themselves won't refund their own branded devices after 14 days.  Am I supposed to head out to their California headquarters and beg for some customer service?  It doesn't matter if Apple stores don't make the majority of the sales  - they indicate a commitment to the customer.I'm always afraid Samsung is going to fold when it is no longer profitable for them - chaebols do do that.  I honestly don't think Google and Motorola are seriously interested in taking away from the Appleverse.  The Appleverse is the alternative, the break time from working on Microsoft computers.I would think the Android devices after they stopped getting updates would be as useful as the gameboy or nintendo ds toys in the back of the drawer somewhere.I'm not an Apple fan but I don't think Android has a shot despite offering removable batteries and memory sometimes which are extremely important especially for work-related data.*****************************The Apple Store lets you buy gift cards or coinstar receipts to pay.  Sony wants your credit card information even after they \"got\" hacked and released all the credit card information of its accounts.  Microsoft is only slightly better.  It's arrogant to force us to lose our financial privacy and security to access a device that we paid for.****************Who do you want to have access to too much of your personal information?I don't want ANY Of my stuff on ANY cloud especially if it is work related.  The internet-enabled devices are getting way more myserious, inaccessible and way slicker in the way they are not providing a description of what they do, how they do it, what is entailed, etc.  It's all ... hazy like a CLOUD.The internet access and the access of the apps to the owner's information makes me very uncomfortable which is why I see this as an entertainment device and not a work one  - it is impossible to look under the hood and control this thing - it takes the user for the ride - we are NOT in the driver's seat with these devices but that is also another reason to go American (that means Windows, Android Motorola/Google or Apple) and Apple and Windows are the ones with more closed systems but they're not perfectly secure.I think Siri indicates that not only are they recording our voices but they digitized them and broke down our voices into code not for recognizing our COMMANDS - but that means Siri could probably say something you never uttered in your voice.  The touchscreen could have been a fingerprint collector all along and the camera - well, I'm sure it is always on.**************Apple's litigation against Samsung is big news this week and if Samsung has been allowed to make money (it may be the only competitor who has something to show for its efforts) then it may have been in on it which means it can shut off the lights on their android devices and just sell big appliances because Apple's legal wins have huge implications.  It let competitors (usually foreign) copy (mostly for android - the name \"android\" doesn't really invite confidence thanks to Blade Runner and I, Robot) and if Apple is now suing Samsung successfully for copying - that means Apple didn't strike until there was something they could get back financially and it also means that Apple can damage you enough so that all your years of efforts will be for naught.  Those sunk costs - that's the poison.So I wonder - what if Apple sues in the home countries - the ban is for Samsung sold in the US.  What would Korean courts do about a lawsuit by Apple in Korea?  Does that make Sony Experias vulnerable in Japan?  What about Nokia now owned by Microsoft in Finland and in Italy one of Nokia's strongest markets?  What about the touchpad controller on the Playstation 4?Three days from the anniversary of the Pearl Harbor Attack, Comedy Central is reairing South Park episodes on 12/4/13 in this order:HumancentiPad - not only about the actual war crimes committed upon civilians and POWs by Mengele and Unit 731 but also about Apple's originality AND their dominant attitude towards their rightsfollowed byA Song of Ass and Fire which reiterates the claim made in Black Friday that the selling point of the Playstation 4 is the touchpad interface.Apple can pull the litigation trigger at ANY TIME and because they already won with Samsung, Sony's attorneys are not going to be able to drag out much of the issues of the lawsuit so that the Playstation 4 can sell for as many years as its predecessors.Holy Moses.", "Title": "fast, great display, expensive - the professional reviews aren't wrong - especially about how there is not much new to say", "Date": "November 20, 2013"}, {"Author": "Timothy M. Meadows", "ReviewID": "R2F4TBJC2715OP", "Overall": "1.0", "Content": "Get the older versions.. This one although light.. has a cheap feeling plastiky screen that feels like you are going to poke your finger through and sounds hollow as you do it. Buy A Microsoft Surface 2 or Pro and dont look back.. Much more productive device and more capable.  Research research research!", "Title": "Expensive but built cheap.", "Date": "January 5, 2014"}, {"Author": "Jeffrey Funk", "ReviewID": "RXKVUH328JER7", "Overall": "1.0", "Content": "I was stupid and sent this as a gift to a woman that didn't work out ,but am sure she is enjoying it on my dime.", "Title": "Bad taste", "Date": "March 17, 2014"}, {"Author": "iPad Air Expert", "ReviewID": "R299FHI9ANQC7R", "Overall": "1.0", "Content": "It won't even turn on. Why is that!  :( ahhhhhhhhh what is going on. And it also didn't come with a charger!", "Title": "Crap!", "Date": "November 6, 2013"}, {"Author": "Deimos \".\"", "ReviewID": "R2JBOFZJ3AG6LC", "Overall": "1.0", "Content": "So you get the same OS, the same capabilities as every other Ipad or slightly \"faster\" and .4 of a pound lighter?  Who the hell in their right mind would buy this pointless device.  If you have any other more capable tablet or any other version of the apple store shackled limited Ipad you do not need this peiece of junk.  If I held this up facing toward you with a first gen Ipad, and an Ipad 2, you would not be able to tell the difference, you know why that is....becasue there is none. Ohhh the new version of IOS has slightly different looking icons....it's still the same locked, limited, crippled Iphone OS on a larger screen.  It's a giant, thinner iphone. A total waste of money, espessially when there are vastly better options available from Microsoft and Android that can outperform this toy any day of the week in features and power.", "Title": ".4 lbs lighter WOW what a pointless device!", "Date": "December 9, 2013"}, {"Author": "Max \"Boston\"", "ReviewID": "R28WHNGRGRKWRU", "Overall": "1.0", "Content": "People are going crazy for an ipad coming out a tiny bit thinner, and a little bit more powerful (because we know that app really requires the mega power). Meanwhile a revolutionary, world changing product like Google Glass is getting very little buzz. Appletards really have their priorities straight, huh?", "Title": "Lol.", "Date": "November 4, 2013"}], "ProductInfo": {"Price": "$599.00", "ProductID": "B00G2Y5YIG", "Features": "Runs Apple iOS 7 operating system using the A7 processor chip, 64-bit architecture and M7 motion coprocessor.\nWi-Fi (802.11a/b/g/n) with MIMO;\n9.7 Retina display, 2048 x 1536 resolution and 5 MP iSight camera; supports 1080p HD video recording\nUp to 10 hours of battery life,has 32 GB storage capacity", "ImgURL": "http://ecx.images-amazon.com/images/I/51tiL831AuL._SY300_.jpg", "Name": "Apple iPad Air MD789LL/A (32 GB, Wi-Fi, White with Silver)"}}