{"Reviews": [{"Author": "James62", "ReviewID": "R84PZPM2Y43GI", "Overall": "5.0", "Content": "I found this and purchased it because it say free game and office app bundle included. And yes the apps are amazing.First of all, this tablet runs smoothly and surprised me because I did not expect such a good performance base on the price. I thought this would be a good play tool for my 5 year old son. It exceeds my expectation. I end up finding it to be a good little tablet that I can carry around dealing with emails, news, videos so I bought another one for myself. I think the dual core processor they call iMAPx15 must be doing its job well.The dual camera, on the other side, is not very impressive. However, I am not dumb to expect it to be perfect. I did some video chatting and this N7 is compatible with Skype. Since the image quality is usually not very sharp though Skype, I do think their camera resolution is good enough for this task, if you want to use it as a real camera and take vivid photos, go find something more expensive.Screen resolution is perfect for a 7”. HD screen and slim design makes this tablet my current portable video streaming buddy. Holding this table in my hand seems to be comfortable cause the light weight. Sure it is a cheap tablet and it doesn't feature splendid sharp colorful retina screen, but I can connect it to my flat TV through HDMI port and yes, it worked, with all the sharpness I need. Tips, you need a mini HDMI to normal HDMI cable if you want to do this, it costs like $20 on Amazon, also keep it charged if you use the HDMI port as it is kind of battery straining.Battery life is a so-so on this N7, be smart and prepare a portable battery if you need to play with it longer than 7 hours. I use it occasionally and put it away every day, it can charge through USB port so I do not need to bring the DC wall charger. I mean, even an iPhone5 cannot last for a whole day so you know what Im taking about.Now is the best thing I love for this tablet – the apps. Apps are not pre-installed, don’t know why, but you can go online and register on neutab’s website with your code that come in the box. They will give you a choice to download either of the two app packages. “Games bundle” or “Office bundle”, they claim it to be worthy. All I care is if I can get something useful and wow, those apps are fantastic. For my son, I really like the kids mode app. It has lots of fantastic functions and it is the best educational app I ever seen. There are games too if you like playing games. I took office bundle for my tablet, which really gives me everything I need. PDF reader, office documents editor, file manager, desktop remote control etc. I really think this is a good move because it saves money and time to look for the right app.So far this Neutab N7 has been a satisfying choice. Don’t know if it can last like this, I will keep updating my review. I recommend this tablet to those who doesn't need to have this tablet as a fantastic multi-tasker. Also, if you want a tablet for your kid, this is it.", "Title": "Worthy tablet with great quality and service", "Date": "January 15, 2014"}, {"Author": "Richard Fletcher", "ReviewID": "R9B2S63VN6KSS", "Overall": "5.0", "Content": "I got this for Christmas. My wife bought it on Dec 8th. The tablet is great for the price. Just don't expect GPS, a great camera,It worked great for about 20 days untill it just quit coming on. Of course I missed the 30 day return policy of Amazon. Now I can not get in touch with NeuTab.... before it quit I gave it 5 stars... now well what do you think.UPDATE  !!!  I WENT TO NEUTAB'S WEBSITE AND SENT A MESSAGE TO THEM. THEY QUICKY RESPONDED AND SAID THEY WOULD REPLACE MY TABLET. I SHIPPED OFF THE OLD ONE AND THE NEW ONE IS ON THE WAY. I TAKE BACK ALL THE BAD THINGS I SAID ABOUT NEUTAB.", "Title": "The Good, The bad, and the Ugly", "Date": "February 28, 2014"}, {"Author": "Jason L. Lundy", "ReviewID": "RLW5DCML7BP3N", "Overall": "5.0", "Content": "So far this Tablet has not given us any problems.  She loves the feel and look of the device.  I love it mainly because you can attach it to your LED TV and watch videos.  It was easy to get connected to the wireless at the house and other places as well.  The one thing we both do not like about this tablet is the camera.  It does not deal with motion very well.  If the object is still, the photos and video are great.  We were trying to take pictures and video at a basketball game, so you know being still does not happen there.  This device is overall great!  We are looking for another camera app to see if it will improve the camera any.", "Title": "I bought this for my wife and she loves it!", "Date": "February 8, 2014"}, {"Author": "Sue Modlin", "ReviewID": "R15JBBAVHDHIPZ", "Overall": "5.0", "Content": "Bought this for my kid's birthday.He loved it! Good Tablet. It is worth the price and we loved everything about it so far.", "Title": "Love this tablet", "Date": "April 3, 2014"}, {"Author": "JP \"Alynn Hoag\"", "ReviewID": "R3QJSXLLOCCDA7", "Overall": "5.0", "Content": "Great weight not like a toy. Have bought 4 this year and this one is far the best. Love this tablet it's fast great screen and starts up fast. Don't know how anyone can give this less then 5 Stars.", "Title": "Excellent!!!", "Date": "December 23, 2013"}, {"Author": "Patrick Asis", "ReviewID": "R3I73I1EMU92PA", "Overall": "5.0", "Content": "From the Performance/Price aspect, NeuTab 7 inch Dual Core tablet is a killer of the most tablets in the market. It has total 4 GB storage. After installing bunch of applications, I still had available 2 GB. This runs Android Jellybean. I did not face any issue at all out of the box and have been using for days with no issues. Obviously you should know the feature set and use within the limit. I will go into the specifications and review based on my user experience. I had no hardware or hang issues with this tablet.The iMAPx15 dual core CPU is very efficient and it has done a good job to extend the battery life. There is a built-in 2800 mAh Rechargeable Lithium Battery. Battery came for a good 6 hours with moderate usage. Battery usage really depends on how heavy you use the system. Overnight it drained very less. I usually turn WiFi off as I play games so save some power.Notice there is a layer of screen protector on the screen. Remove it before using so you won't see bubbles and experience touching sensitive problems. The capacitive touch screen was really good, some occasions I had to press little harder and at right locations, but pinch-zoom, highlight, Copy-Paste all worked very well.The screen is 1024 x 600 Pixels and it over-matches other similar tablets. Tablet has 2 cameras. The tablet has micro USB Port, 3.5-mm stereo Headphone Jack, built-in speaker, microphone, micro SD card slot and a DC Input Jack. Note that for powering through wall adapter you need to use the provided DC input jack. Speaker was loud enough for me. HDMI interface is also good for connecting to HDTVs.Android tablets are really customizable to your heart's content. It is here where NeuTab shines. Using a native Android Jellybean, they have achieved something at a low cost. This can have a very wide reaching audience. Affordability is key, a tablet like this with Wi-Fi is a big boon. Imagine having entire Wikipedia at your fingertips for a child. I tried few educational applications on this. I consider this as a big hit with educators than gamers.I tried Google Voice Search. I was asking about the scores of current playing games, weather and etc. The voice recognition part was great and it was able to recognize and dictate the answer. Apps like Calculator, Gmail performed flawlessly.The engineering for the price/value/budget that N7 delivers is perfect. NeuTab has pulled components and assembled at a terrific value. I was particularly interested how it performs to streaming video. I watched multiple videos and streamed online, none gives me any trouble. I recommend buying.", "Title": "absolutely love this tablet!!!", "Date": "April 8, 2014"}, {"Author": "M.B", "ReviewID": "RITABE94NTS5Y", "Overall": "3.0", "Content": "Don't expect to get much out of this tablet. If you have a child with no patience than I suggest spending a few more dollars on something better. It says Dual Core, but its about as fast as computer from the 1980's. Screen bends when you press lightly on the rear of the tablet, and tablet itself is made rather cheap. Sound like your walking across a spooky wood floor that creeks when you grip the tablet. Resolution is expected, and battery last a few hours of content playing by a child. Some apps tend to force close or freeze when starting due to the process not being able to handle them. Best thing to do before opening an app, is make sure everything is close out all the way (task manager) so there is only 1 running app at a time.Camera is as good as to be expected. Its good enough for a child to snap pictures here and there.Tiny charging port is something to look out for, one wrong bump from your child will certainly bend/damage the charger and/or charging port.Overall, you will get what you are paying for (okay for a child) but don't let the \"Dual Core\" fool you... It's anything but.If it breaks, I'll certainly buy something else.", "Title": "Don't Expect Much", "Date": "April 23, 2014"}, {"Author": "Jeffrey C Eidson", "ReviewID": "R15D4LEP0HLHY8", "Overall": "5.0", "Content": "My wife loves it. Sure it's not a top tier tablet but for $60 dollars it really does a phenomenal job. dual core processor makes it plenty quick. The picture is super sharp and clear with vibrant colors. The only downside is the camera is not all that great. but so what. Great buy.", "Title": "great deal", "Date": "May 15, 2014"}, {"Author": "teddiebear", "ReviewID": "R1LWRT9ZDLL0R6", "Overall": "3.0", "Content": "Bought this for my kids. It's fine but slow. After about an hour it needs charged. I've also noticed that it starts to loose power while plugged in. Save your money and buy a better brand", "Title": "good not great", "Date": "April 21, 2014"}, {"Author": "BrianL", "ReviewID": "R1MQOH7CY9S7V0", "Overall": "4.0", "Content": "I would buy again, don't compare it to an higher priced model...it won't compare.  But for the money, not a bad tablet.", "Title": "For the money, a good little tablet", "Date": "April 21, 2014"}, {"Author": "Hilary Rummel", "ReviewID": "R283AAJV5RO1BM", "Overall": "2.0", "Content": "Screen blacked out within a day. Never to come alive again...the item arrived timely enough but I am returning yet another tablet due to faulty craftmanship.", "Title": "Good luck", "Date": "April 1, 2014"}, {"Author": "Sammy richmen \"Sam .R\"", "ReviewID": "R201PELR5W76J2", "Overall": "1.0", "Content": "I my wife purchased one of these tablets and got it on Monday, May, 10 2014. I was using it and all of a sudden the tablet stop working: I turned it on and it continued loading yet nothing happen, check the web and found that there is an internal issue with it and the only way to fix it was to send it back to and get another one. Luckily Amazon refunded my money. Such a poor device and waste of money. Worst experience ever!", "Title": "Stop Working within couple days", "Date": "May 13, 2014"}, {"Author": "Joselina Morales", "ReviewID": "R3VENN3DJ0XGEX", "Overall": "5.0", "Content": "Got it for a Christmas gift to a 9 year old. Was great cause it had google play pre configured. Light weight and great packaging.", "Title": "Nice", "Date": "January 13, 2014"}, {"Author": "Jermaine Jordan", "ReviewID": "R3UOZRLUP1LSL4", "Overall": "5.0", "Content": "MORE THAN I EXPECTED AND EVERYTHING I HOPED IT WOULD BE ! VERY SATISFIED! JUST NEed To FIND A Game Controller COPATIBLE.", "Title": "LOVE THIS", "Date": "January 30, 2014"}, {"Author": "Jessica Sanders", "ReviewID": "R21QOHRQTTO0MZ", "Overall": "1.0", "Content": "I charged the tablet over 3 days. It turned on and worked for 40 minutes, then died. I had a go charge it again for like 3 days and now it won't turn on or boot up. It is useless and I spent a ton of money on this item, money I could have put towards a superior, more solid item. I purchased this by reviews of others, and wish I didn't.", "Title": "Very poor product", "Date": "May 14, 2014"}, {"Author": "Mary Bass", "ReviewID": "R1C426GAG6END", "Overall": "5.0", "Content": "I purchased this tablet for my son. He absolutely loves it. The price was great and it arrived in good time. It has everything he needs to use it, play games, etc. I will definitely order another in the future for gifts for people.", "Title": "Purchased for my son..he loves it", "Date": "April 25, 2014"}, {"Author": "M.B", "ReviewID": "R26X5J9QZCMCHP", "Overall": "3.0", "Content": "Don't expect to get much out of this tablet. If you have a child with no patience than I suggest spending a few more dollars on something better. It says Dual Core, but its about as fast as computer from the 1980's. Screen bends when you press lightly on the rear of the tablet, and tablet itself is made rather cheap. Sound like your walking across a spooky wood floor that creeks when you grip the tablet. Resolution is expected, and battery last a few hours of content playing by a child. Some apps tend to force close or freeze when starting due to the process not being able to handle them. Best thing to do before opening an app, is make sure everything is close out all the way (task manager) so there is only 1 running app at a time.Camera is as good as to be expected. Its good enough for a child to snap pictures here and there.Tiny charging port is something to look out for, one wrong bump from your child will certainly bend/damage the charger and/or charging port.Overall, you will get what you are paying for (okay for a child) but don't let the \"Dual Core\" fool you... It's anything but.", "Title": "Don't Expect Much", "Date": "April 23, 2014"}, {"Author": "Anissa", "ReviewID": "R2ME2MXREGROMQ", "Overall": "1.0", "Content": "It sucks !!! It gets super hot when you use it... The calibration sucks ... no matter how my times I recalibrate it it dose what it wants to I press one button it hits something else ... it keeps freezing and the picture is terrible", "Title": "It sucks don't waste your money", "Date": "June 9, 2014"}, {"Author": "Vikas Ranjan", "ReviewID": "R1COV0TGMNCBCG", "Overall": "1.0", "Content": "Having used iPAD and Nexus 10 earlier, I was not expecting that kind of performance but the performance of this tablet and overall experience didn't meet my expectations. The screen was low resolution, dull and it suffered greatly in multitasking.Not recommended for any serious buyer.", "Title": "Performance and Screen were not good", "Date": "June 9, 2014"}, {"Author": "Tamika Ernest", "ReviewID": "R1ILWHB4R8UWBR", "Overall": "3.0", "Content": "It is a nice tablet for the price I would recommend it to anyone.If you are looking for a standard tablet well thats the one", "Title": "NeuTral N7 Pink", "Date": "June 8, 2014"}, {"Author": "Darcy Hauslik", "ReviewID": "RDJWOJQCD9A56", "Overall": "4.0", "Content": "Does everything a tablet should do. With the right apps you can be severely productive with this thing. Very convenient.", "Title": "Fine tablet for the money", "Date": "June 2, 2014"}, {"Author": "Sean Noble", "ReviewID": "R2ZAYKU17GZK2K", "Overall": "1.0", "Content": "I got two of these for my kids, one black the other pink. The Pink NeuTab N7 lasted right past 30 day and now it done. Warning read all the comments and take chance if you dare. My money is gone and my daughter now has nothing to enjoy.", "Title": "30 days and its done", "Date": "June 2, 2014"}, {"Author": "Repulsivefrog", "ReviewID": "R2SNPW3Q11PGBZ", "Overall": "4.0", "Content": "i really love the dual camera, graphics are great and fast. overall it is a great product for the price.", "Title": "nice product", "Date": "June 2, 2014"}, {"Author": "maria felix", "ReviewID": "R2XIP2SW4HLVXA", "Overall": "4.0", "Content": "It was a gift for someone and loves it very fast and easier to use then most excellent picture and sound", "Title": "gift for a friend", "Date": "May 28, 2014"}, {"Author": "NM", "ReviewID": "RR34RFS6OOZL2", "Overall": "2.0", "Content": "On the very onset of receiving this tablet, it worked wonderfully.  However, after a few days it would freeze.  If you want to use it with a Chromecast device, it does the job from YouTube.  It does get rather hot.", "Title": "Unfortunately I had to return it", "Date": "May 28, 2014"}, {"Author": "Kim", "ReviewID": "R1LDIOMKMKYCB2", "Overall": "4.0", "Content": "This is a great economical tablet.  It is easy to use and because you use micro SD cards you can expand the memory to fit your needs.  The battery life could be better, but it works for me as I usually have access to an outlet if necessary.  I would definitely like to purchase more for the family.", "Title": "Economical and Easy to Use", "Date": "May 27, 2014"}, {"Author": "Shatell", "ReviewID": "RUL1I53EB7LL4", "Overall": "3.0", "Content": "I bought this tablet for my 3 year old niece, I found myself playing with it more. I feel my niece can use it really well cause it's small & the icon are reasonable size. it's good for what I pay for.  Only reason I give it a 3 is because sometimes the apps exit by themselves & can get little bit annoying & obv the camera quality isn't that good. But then again it's good for a inexpensive tablet. My niece is going to love it & it's pink.", "Title": "Good tablet for younger kids", "Date": "May 27, 2014"}, {"Author": "Rex Gray \"Rex\"", "ReviewID": "R2TA3MWQP7GPDR", "Overall": "4.0", "Content": "I bought this tablet for my grandson's birthday. Being familiar with the android tablet, I am impressed with the usability and response. It does feel a little warm at times, but overall I think it is a good buy for the money.", "Title": "Good buy for the money.", "Date": "May 26, 2014"}, {"Author": "james archer", "ReviewID": "R3HHS54DGQXKB7", "Overall": "5.0", "Content": "After looking through many of the other offerings, this little guy fit the bill for something to take with me on mybusiness outings. With google earth and google maps finding business locations was a snap. the only thing thoughwas controlling the battery consumption, android app killer and other power saving apps work well for this about twohours of youtube play or more without a glitch.all in all a fantastic buy for the price.Cons: the camera works fine but don't expect super pictures, if you want that, go buy a galaxy or a asus.Get yourself a stylus, believe it or not, it's the best way to navigate on this this little tablet and some headphonesfor private and inhenced listening.", "Title": "\"Great little tablet for work\"!", "Date": "May 25, 2014"}, {"Author": "Derrick", "ReviewID": "R1T1RGATDBFN3U", "Overall": "5.0", "Content": "The Neu Tab N7 is very easy to use and has very fast connection to the web. this tablet to me is the best buy for the price.", "Title": "Barber Dee", "Date": "May 25, 2014"}, {"Author": "agossou", "ReviewID": "R2WV12MUSKV2ID", "Overall": "5.0", "Content": "I ordered this tablet for my son. It is very lite and it has all the apps he needs for his age", "Title": "great for kids", "Date": "May 24, 2014"}, {"Author": "Eseosa omuemu", "ReviewID": "RJJ00NVMY7RS7", "Overall": "5.0", "Content": "its very nice its portable and light I love it. its like an android version of the ipad mini i love it", "Title": "very slime and portable", "Date": "May 22, 2014"}, {"Author": "Nichole Elkins \"NElkins\"", "ReviewID": "R36HH9MYX5OT4N", "Overall": "5.0", "Content": "The NeuTab is just perfect for my daughter has all the android phone  needs with out the phone bill. Im going to purchase one for all my kids! at that price i can afford it!", "Title": "The NeuTab is Great Perfect for my daughter", "Date": "May 19, 2014"}, {"Author": "Robert Tucker", "ReviewID": "R3I9XEPXQEPEWW", "Overall": "4.0", "Content": "Great product for the price works very well would greatly recommend it very well kept product go get you one", "Title": "Great android product", "Date": "May 19, 2014"}, {"Author": "dudman44", "ReviewID": "R38Q78LLJDK7QS", "Overall": "5.0", "Content": "This tablet does exactly what it says.  It is user friendly, easy to set up and the graphics are pretty good.  the camera is not the best resolution, but it wasn't bought for the camera.  My son loves it and I am VERY happy with my purchase.", "Title": "Great Tablet", "Date": "May 18, 2014"}, {"Author": "Julie Brandt", "ReviewID": "R201V1VG8OH88G", "Overall": "5.0", "Content": "My daughters (ages 8 and 6) are very happy with this tablet.Lots of fun choices of free games to download from playstore.The only thing that could be better would be the battery life;but great quality tablet for the price.", "Title": "Nice tablet for games", "Date": "May 16, 2014"}, {"Author": "Reno Preston", "ReviewID": "RYZOXZGRTHARW", "Overall": "3.0", "Content": "THE BAD:I bought this tablet mainly to play games on.  I was hoping I could play my android versions of Grand Theft Auto on it, and they take around 1+ GB of internal storage to play on a tablet.  I've played it on my phone with no problem but wanted a big picture for more accessibility.  Well, when Neutab said it had a 4GB hard drive, it was very misleading.  After all the preinstalled apps and whatnot is accounted for, only about a little less than 1 GB max was available to save game data to, so I was not able to play any of my Grand Theft Auto games because of lack of hard drive space.  Could not figure out how to get more space.  Some of my apps like SongPop and MoviePop will freeze during play and a message will pop up saying it has stopped responding and asking if I want to close.  The battery drains at what seems like 1% a minute when WiFi is connected.  The auto rotate messed up in the first 5 minutes and would not stay at regular landscape so I had to turn it off.THE GOOD:It switches decently enough from app to app, browses internet at decent speeds.  I'm able to play Crazy Taxi flawlessly on this tablet.  It has a good battery life and charges very quickly as long as you don't have WiFi on.  Plays my movies and music very well.I would recommend this tablet for anyone wanting to play some simple games or browse the internet for things like facebook or email, pretty much a beginner's tablet.  It is worth the money I paid for it, but my girlfriend wasn't satisfied with it and ordered the Samsung Galaxy Tab 3 instead so I will probably use that one for my advanced games that this tablet can't handle.", "Title": "Its okay for simple stuff", "Date": "May 16, 2014"}, {"Author": "James Doyle", "ReviewID": "R10WFLOL2BFYF5", "Overall": "5.0", "Content": "I ordered the tablet from amazon for $50.00 & for the priceYou won't find a nicer Tablet.The reason I ordered it was for the HDMI.You can hookit up to your T.V. and watch YouTube videos or movies.Has duel core which is great and duel camera.I have a HP tablet I purchased a year ago and paid$169.00 and the NeuTab is as good and has HDMIExcellent Tablet 5 stars", "Title": "Excellent", "Date": "May 15, 2014"}, {"Author": "LJB20214", "ReviewID": "RR2TXWDPGUM36", "Overall": "4.0", "Content": "Battery life is good and it functions as any other android device, but it can run slowly at times during heavy loads or multiple applications running. Perhaps a task killer can rectify that. The screen is not as responsive to dirty/oily fingers and it can be hard to type..... regardless it functions as described.", "Title": "You get what you pay for", "Date": "May 13, 2014"}, {"Author": "M Will", "ReviewID": "R2GLU6JP4CKWD6", "Overall": "4.0", "Content": "I like this tablet because of the low price. It seems to function well.  I've only had it a day, though.  Time will tell about this.", "Title": "Acceptable tablet for the low price.", "Date": "May 13, 2014"}, {"Author": "marissa", "ReviewID": "R2V5QUXROEZWCI", "Overall": "5.0", "Content": "Well so far it works great &does; everything its supposed to do but I just got it today, so I'm hoping it stays that way.. but I love it, works great!!", "Title": "good product", "Date": "April 29, 2014"}, {"Author": "Angela", "ReviewID": "R1A7WP3IVOR25D", "Overall": "4.0", "Content": "I got this for my 7 year old son he loves it and is very happy with it. He has 15 games downloaded at the current moment", "Title": "neutab 7 in", "Date": "April 28, 2014"}, {"Author": "James L. Rinehart \"zionian\"", "ReviewID": "R2R16AORLC3UG", "Overall": "5.0", "Content": "Love it for the price it does excellent, my back when I don't want to operate my computer, great fro traveling", "Title": "n7 &\"", "Date": "April 28, 2014"}, {"Author": "Gray Geek \"grayhair geek\"", "ReviewID": "R2LOCM17JG5EEC", "Overall": "4.0", "Content": "I bought another tablet a year ago with a .5 gig CPU and wanted a gift for my mom.  I bought the Neu Tab for the Dual Core processor; however, it does get hotter faster than a the .5 gig.  It cools after a few minutes.  It doesn't shut the unit down, or it hasn't yet.  I plan a break after 4 or 5 games of Scrabble or Free Cell.I'm amazed at the durability and the ease of unit.  My mother grabs the older unit and strts punching away.  I've dropped it 3 times and wanted to give her a new junit for Mother's Day.The Android system is perfect because unlike DOS and related MS products, it's easy to learn.  Like the first Apple.  What a relief after DOS 3.1 or whatever was out then.I've tested the WiFi range by taking the Neu Tab to retail establishments.  I'm having great-grandchildren pictures and videos sent to it.I'll just add earplugs and a new screen protector.At this price, people aren't scared to learn how to use.Years ago, my 80 some neighbor (Masters degree, college prof) was given a Windows ME computer.  She couldn't understand why the start button was used to shut-down the computer.  And I never had a good explanation.", "Title": "Good product", "Date": "April 27, 2014"}, {"Author": "Amber Nelson", "ReviewID": "RSPG473TJ0CLY", "Overall": "4.0", "Content": "This is a great little tablet for the amount of money spent. A little slow and smaller than I expected, but it's still a good value. I was disappointed at first, but after forcing myself to use it for an hour, I'm quite pleased with it.", "Title": "Great Value", "Date": "April 25, 2014"}, {"Author": "Tina Long", "ReviewID": "R3I0DSLSI8A652", "Overall": "5.0", "Content": "I bought this as an entry level tablet for my daughters birthday(16) and she loves it, it works really well and is just enough for what she likes to use it for. Not over the top, but very pleased with my purchase. I would recommend  this nice little tablet, AND the best part is I have my Nook HD back.", "Title": "my daughter loves it", "Date": "April 25, 2014"}, {"Author": "Evelyn", "ReviewID": "R3QJWUDFGIOPH7", "Overall": "4.0", "Content": "I bought this for my 10 year old daughters birthday and she loved it. The only thing I would say is maybe preload some games on it. Its easy for her to use. So far so good I will give in update soon.", "Title": "Birthday tablet", "Date": "April 25, 2014"}, {"Author": "Peter Saigh", "ReviewID": "R2CSK2KP6HY4DE", "Overall": "4.0", "Content": "While I'm not going to lie and tell you that this is the best or most technologically advanced I will say it is a great little tablet for the price. I actually bought two (unfortunately one arrived with the screen cracked and shell open)  They both work well. Like I stated one arrived broken but it was still useable. I bought these for inventory at some restaurants I manage with the expectation that they were just cheap crappy tablets but after setting them up for the last couple days they have changed my mind. Some key features are the HDMI out which works well and the fact that they can charge with a standard dc plug. Micro USB's are nice, but they are fragile and wear out but the dc plug is a reliable and proven. After putting in my return I Purchased 2 more because they surpassed my expectations.", "Title": "For the price its worth it.", "Date": "April 21, 2014"}, {"Author": "Nika Jackson", "ReviewID": "R3E68JJG5JG8Z7", "Overall": "2.0", "Content": "Purchased 2 for my daughters, 7 & 10. Speaker volume is really low. Screen & camera is dark. Both devices shuts off & will stay off for a couple days even when fully charged. One of the devices wouldnt download any apps at all. In the process of returning them. I gave it 2 stars because i guess theses devices are ok for the kiddos to just have something to do. Definitely not recommended for major tasks or work purposes....", "Title": "You get what you pay for...", "Date": "April 21, 2014"}, {"Author": "Patrick Grieshop", "ReviewID": "RZD9WM1G80LX4", "Overall": "5.0", "Content": "I bought this tablet to use as a development tool for creating apps. My computer will not recognize it and there are no driver downloads available. I have visited their website, but could not find any way to contact them. If this problem can be resolved i will change my review to 5 stars. No Customer support, and I will give it one star. If any one has their contact info, please share it with me.ThanksI found the contact information [...]. They responed quickly to my email. I give this a 5 star because it is inexpensive, light weight and fits just right in your hands. My son loves it because his smaller hands are able to manipulate it better. The only con is the graphic resolution could be a little better.", "Title": "Cant find contact information", "Date": "April 15, 2014"}, {"Author": "Beth Walsh \"cowgirl\"", "ReviewID": "R2MYSEWH099GUJ", "Overall": "5.0", "Content": "I was looking for something to take on vacation so I didn't have to drag the lap top with. this is filling the needs perfectly", "Title": "love it", "Date": "April 15, 2014"}, {"Author": "vence flores", "ReviewID": "R3LV7UBYZZ777D", "Overall": "4.0", "Content": "its a beautiful tables its realey fast ii can surf the web very easy what videos on you tube and chek e mails the only tingin i wold complain about is the roteed screen its slow to change eater than that the tablet does is  work", "Title": "its good i realy engoy it", "Date": "April 6, 2014"}, {"Author": "Jane", "ReviewID": "R22RZM8TXJEULU", "Overall": "5.0", "Content": "I got this to surf the web and listen to music/radio.Some gaming occasionally, everything works fine. This is a nice little tablet.", "Title": "Nice tablet", "Date": "March 13, 2014"}, {"Author": "Lin Lu", "ReviewID": "R293FIEM3JJDXV", "Overall": "5.0", "Content": "The NeuTab N7 7\" Tablet is a tablet with good specs and an even better price tag to match. I used it daily and it has well met all my needs. It is under manufacturer warranty for 12 month! Great tablet.", "Title": "Good tablet", "Date": "March 13, 2014"}, {"Author": "Dchomiez15", "ReviewID": "R3SJJIDWV2LSPH", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1WC8GVL8U4NWHembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1WC8GVL8U4NWHrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1WC8GVL8U4NWHchiDiv\").innerHTML = document.getElementById(\"cv_mo1WC8GVL8U4NWHhiddenPre\").innerHTML;\n};\ncv_mo1WC8GVL8U4NWHrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1WC8GVL8U4NWHso;\t   \n\n\nfunction cv_mo1WC8GVL8U4NWHloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1WC8GVL8U4NWHso = new SWFObject(swfLocation, \"cv_mo1WC8GVL8U4NWHAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1WC8GVL8U4NWHso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1WC8GVL8U4NWHso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1WC8GVL8U4NWHso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1WC8GVL8U4NWHso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1WC8GVL8U4NWHso.setAttribute(\"height\", swfHeight);\n          cv_mo1WC8GVL8U4NWHso.setAttribute(\"width\", swfWidth);\n          cv_mo1WC8GVL8U4NWHso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1WC8GVL8U4NWHso.write(\"cv_mo1WC8GVL8U4NWHflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1WC8GVL8U4NWH', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1WC8GVL8U4NWH';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1WC8GVL8U4NWH', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1WC8GVL8U4NWHloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1WC8GVL8U4NWH\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1UZP6TTDF1WV1\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1UZP6TTDF1WV1\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3SJJIDWV2LSPH\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1UZP6TTDF1WV1/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1WC8GVL8U4NWHduration')) {\n      document.getElementById('cv_mo1WC8GVL8U4NWHduration').style.display='none';\n    }\n    cv_mo1WC8GVL8U4NWHloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1WC8GVL8U4NWHloadSwf(movieID, playerVersion) {\n   return _cv_mo1WC8GVL8U4NWHloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1WC8GVL8U4NWHnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1WC8GVL8U4NWH', 0, h);\n}\n\nfunction cv_mo1WC8GVL8U4NWHresetPlayer(w,h,bw,cc) {\n  cv_mo1WC8GVL8U4NWHnewHeight(h);\n\n  cv_mo1WC8GVL8U4NWHso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1WC8GVL8U4NWHso.addVariable(\"cacheCode\", cc);\n  cv_mo1WC8GVL8U4NWHso.setAttribute(\"height\", h);\n  cv_mo1WC8GVL8U4NWHso.setAttribute(\"width\", w);\n  cv_mo1WC8GVL8U4NWHso.write(\"cv_mo1WC8GVL8U4NWHflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1WC8GVL8U4NWHRollOverImg = new Image();\ncv_mo1WC8GVL8U4NWHRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81BJgnOKn0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1WC8GVL8U4NWHpreplay = document.getElementById('cv_mo1WC8GVL8U4NWHpreplayImageId');\nif (cv_mo1WC8GVL8U4NWHpreplay) {\n  cv_mo1WC8GVL8U4NWHpreplay.onmouseover = function() {\n    cv_mo1WC8GVL8U4NWHpreplay.src = \"http://ecx.images-amazon.com/images/I/81BJgnOKn0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1WC8GVL8U4NWHpreplay.onmouseout = function() {\n    cv_mo1WC8GVL8U4NWHpreplay.src = \"http://ecx.images-amazon.com/images/I/81BJgnOKn0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1WC8GVL8U4NWHpreplay.parentNode;\n\n  var cv_mo1WC8GVL8U4NWHcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1WC8GVL8U4NWHcurrentClick) {\n      return cv_mo1WC8GVL8U4NWHcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 3:58 MinsThis is a low end tablet that will let you browse the web, watch youtube video, check email, and more.  This tablet is going to benefit  someone who isn't looking to spend a ton of money  on a tablet.  The tablet can handle playing games, watching movies, and using the web.  You get about 6 hours in a single charge, which isn't the best.  In order to get the best view on the tablet. You have to have the tablet facing you.  Having the tablet tilting in a different directions makes it the screen harder to see.  The speakers on this tablet aren't the best, so I recommend using headphones.  The camera quality on this tablet is very  low.  Using the web is great as well as watching youtube videos. Games load and play without having any problems. Over all this is a great tablet if you are looking for a low cost tablet.Pro:SmallLight weightEasy to usePriceCons:Screen resolution.CameraI was given this tablet as a gift", "Title": "Looking for a cheap tablet?", "Date": "March 13, 2014"}, {"Author": "Makayla", "ReviewID": "R11N80P6J0KCSR", "Overall": "1.0", "Content": "My boyfriend got me this as a gift because i love to read and i buy alot of kindle books form amazon and i got it went thru direction booklet charged it like it said and i turned it on it immidiatly shut off and would not turn back on so i think it was defecftive from the factory i wasw really looking forward to using it but no such luck so i dont know what to do with it its sittin back in its box i feel like it would have been beyond worth the money...... If it worked.... I am a little dissapointed as is my boyfriend because anything we have ever bought from amazon hasw been amazing and we have been ver impressed with and have loved this is the first time we have ever been dissapointed", "Title": "Gift from my boyfriend", "Date": "April 29, 2014"}, {"Author": "kim", "ReviewID": "R7JND3OSQ0FYS", "Overall": "1.0", "Content": "I excitedly purchased 2 of the same tablets for my kids, the price was awesome and the reviews were decent, screen resolution better than other at this price. After we got them I peeled off the protector for the screen on one of them, the screen already was bubbled and peeling away from the tablet.  I thought, no big deal cuz it was for my kids, they won't care. BUT after loading the games for my kids, both of them were very hot on the back, I thought well, maybe it was because I had them laying down on the couch while loading and the couldn't breathe... Then today we took a them with a fully charged battery for a 1.5hr ride. Both of the tablets were NOT in the cases that I had bought to store them, and still they got extremely hot and kept shutting off.  My daughters tablet shut off 7 times within the 1.5hrs.  We started our trip with fully charged batteries and both batteries didn't even last the whole 1.5hrs. the kids were only playing real basic games nothing graphically intense and never even had a movie on them.  I was very disappointed with these tablets after getting them and glad I didn't wait to give it to them for our vacation. I will be returning them immediately for a better tablet.", "Title": "Very disappointed.", "Date": "March 30, 2014"}, {"Author": "Lauren Van Ewyk", "ReviewID": "R35LB3YZ5K85NL", "Overall": "1.0", "Content": "Our son saved up his money to purchase this, and the battery never charged. They are selling broken junk. It turned on, but then shut down moments later with a dead battery", "Title": "NEVER WORKED!! Can't return it", "Date": "May 11, 2014"}, {"Author": "Jason Jeffries", "ReviewID": "RCJU6MQ92JQGD", "Overall": "4.0", "Content": "This is a great little tablet for the price.If you're primarily looking for a tool to browse the web or run apps, the NeuTab is proving a great pick. The battery life is surprisingly good and it charges quickly. I'm not used to the Android environment, but I found that getting where I needed to go was very intuitive. I got this for my wife, and the thing she likes the best is the size of the tablet makes it easy to hold it and type at the same time (and that it's pink).", "Title": "Nice tool for the price", "Date": "April 27, 2014"}, {"Author": "Gladys de Temperoni", "ReviewID": "R35LP8BSAXBJNT", "Overall": "5.0", "Content": "My niece is very pleased with it, bright colors, right size and good price!!!  Sorry, I can't say anymore because I don't speak english very well, I can't find words to congratulate you.  All my purchases are functioning very well!  Congratulations.", "Title": "Neu Tab N7 7\" Dual Core Google Android 4.1 Jelly Bean Tablet PC, 1024X600", "Date": "March 18, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2OFKFFY2M4D0", "Overall": "5.0", "Content": "I am very satisfied with the NeuTab Tablet for its price.  It serves the main purpose for which I bought an Android Tablet, to run Android Apps, surf the web, and send/receive email.  Its main weaknesses are the speaker doesn't provide much volume--but I don't use audio much anyway.  And the manual is poorly written with microscopic print.  You need a magnifying glass to read it.It comes with cables to attach a USB drive, and to connect to a standard PC as a media device to transfer files between the standard PC and the tablet PC.  This is a very nice Tablet PC for a low price.", "Title": "Very Satisifed with the NeuTab PC Tablet", "Date": "February 12, 2014"}, {"Author": "Victoria Semaan", "ReviewID": "R22K8SUYRZKIDV", "Overall": "5.0", "Content": "my 9 year old son is loving this tablet, we bought a 7\" case for the tablet but it keeps slipping out not sure why but other than that its being loved", "Title": "perfect christmas gift", "Date": "January 9, 2014"}, {"Author": "Devon Clemmer", "ReviewID": "RCUK8VE4JXMCX", "Overall": "1.0", "Content": "So I bought this for a birthday present for my girl friend and after about two weeks of use, it stopped charging.  Yes we tried multiple chargers and multiple outlets.  Also the video quality isn't that great and she informed me the device was pretty laggy.", "Title": "Be warned.", "Date": "May 29, 2014"}, {"Author": "kev", "ReviewID": "R3VD62ZIM4QBCK", "Overall": "4.0", "Content": "So far I am satisfied with this tablet especially for its price. It is a bit slow and there were minor scratches on the front. However so far it is working well I got it 4 days ago. This is good because a lot of other customers said theirs were breaking down so that had me worried. I still am concerned about it breaking down but the good thing is that neutab provides 1 year warranty but it sucks how they make u sign up for it which it should come automatically in my opinion. I'm using the tablet to write this and typing on here is not that convenient. Overall u get what u paid for a cheap tablet that's decent but according to some people might break down.", "Title": "good for the price", "Date": "May 26, 2014"}, {"Author": "robert mccracken", "ReviewID": "RBDYDJ77QEPNS", "Overall": "1.0", "Content": "it lasted a few days past the 30 days then died. up till that time i was pleased with it but you get what you pay for. i had hoped to get a least a year of service from it but i got a battery that only lasted 1.5 hrs with each charge and after being charged some 20+ times, it died. oh! the keyboard that was supposed to work on the tab had a 2.0 computer male plug which will not work with this tab.", "Title": "from a smile to a frown on this purchase", "Date": "May 26, 2014"}, {"Author": "Linda Macias", "ReviewID": "RS58N5HKFK6NW", "Overall": "1.0", "Content": "Really did not care for this.  Bought in for my granddaughter.  She hated it.  Said it was way too slow.", "Title": "Poor quality", "Date": "May 16, 2014"}, {"Author": "Christina Nann", "ReviewID": "RNP6J50M67IV2", "Overall": "4.0", "Content": "It's a good product for my mom. She's isn't tech-savy at all so she isn't picky. She loves the size cause she can carry it in her purse. It is although a bit slow for me, but like I said, my mom doesn't care. It's a good gift for someone who just wants to play games on it.", "Title": "My mom loves it!", "Date": "May 15, 2014"}, {"Author": "Shanice C.", "ReviewID": "R3KALVPBGY8YN8", "Overall": "4.0", "Content": "I like this tablet. The touch is nice the battery life is good. It has nice light weight  and works fast with apps I've downloaded. I rated it 4 stars before of one problem, it gets really hot when holding too long. Otherwise I would definitely recommend this tablet.", "Title": "very good", "Date": "May 9, 2014"}, {"Author": "Brenda", "ReviewID": "R3W0YJV1I77ESG", "Overall": "1.0", "Content": "I both this Tablet and it want do anything all I want to do is play a game and it want let me all I see is the little Android Man what can I do please help ?", "Title": "Neu Tab", "Date": "May 9, 2014"}, {"Author": "Josue M Rivera", "ReviewID": "R28G8B11PJGCGL", "Overall": "4.0", "Content": "Great for the price. Actually works. Most of the apps on the store work. Feels cheap, but hey look at the price. Good starter tablet for a kid. Screen resolution is crappy, but again look at the price. Everything functions well, just dont expect anywhere near top of the line tablet feel. Biggest cons are screen resolution, speakers are very weak, and 2 hour battery life. But still a good buy for the price. My 5 year old daughter loves it", "Title": "Not bad for the price", "Date": "April 23, 2014"}, {"Author": "Divine", "ReviewID": "R2K6NRKBC7X7UH", "Overall": "2.0", "Content": "I had this thing for months and only used it a handful of times. Its so freakn slow I can't stand it. Then half the time I gotta double, triple, quadruple tab the icon just for it to open. And the browser...don't get me started. It acts like it has its own poltergeist. I gave up and just threw it aside and paid full price for a Galaxy Tab 3 and it was so worth it!!", "Title": "Slowest Tablet EVER!!", "Date": "March 20, 2014"}, {"Author": "Lon M. Landry", "ReviewID": "RMF7FW2W9ZCES", "Overall": "2.0", "Content": "The screen is not bright (hard to read in room with 60 watt bulb).  the sound is almost nonexistent, earphones or external speakers are required to hear most applications.  If using wifi and video, battery life is around 1 hour.  The price was right, but quality lower than expected.", "Title": "It's Okay", "Date": "March 12, 2014"}, {"Author": "Wisconsin Bookworm", "ReviewID": "RVQW0BC617587", "Overall": "3.0", "Content": "I thought this would be a good tablet to use for Facebook games, etc..  Unfortunately the screen is hard to see if you are not looking at it straight on with the display at the highest light setting. If I want to show someone else something on the tablet I can't just turn it toward them.  I find it necessary to tilt it back and forth to find the clearest picture.  I wouldn't recommend this one.  It may be good for other applications such as movies or TV shows, but I doubt it.  I haven't found anything yet that looks good on the screen.", "Title": "Disapointed with the screen resolution.", "Date": "February 23, 2014"}, {"Author": "Lisa Bosten", "ReviewID": "RACZ6JNOYFRAP", "Overall": "1.0", "Content": "At first it was nice but one day I was playing a game I put it down for a minute came back to it and it would not turn back on. I think there may be a few bugs that the company has to work out.", "Title": "it was nice at first", "Date": "May 5, 2014"}, {"Author": "camille lokhan", "ReviewID": "R3I518SIBSD70Z", "Overall": "1.0", "Content": "This tablet didn't not meet my expectations the reviews made me buy this but in reality it's s***.. First of all it not HD it sticks when you playing games on it and over heats... Don't buy the display isn't how it looks in the picture.. Very disappointed", "Title": "Disappointed", "Date": "April 15, 2014"}, {"Author": "Indea", "ReviewID": "R1GHSDAY4Z22KD", "Overall": "1.0", "Content": "I was very pleased with the purchasing processes and the item arrived quickly. However, after only 3 uses, it stopped working, would not charge, and nothing would show on the screen at all.", "Title": "Dissapointed...", "Date": "February 19, 2014"}, {"Author": "Elizabeth B", "ReviewID": "R1O1YHO8LXABVY", "Overall": "1.0", "Content": "This is trash.  From day one, charger runs extremely hot and does not even go all the way in the hole.  It turns off if you walk away for literally 30 seconds. Battery says charged and then depletes within the hour (and yes, we did completely charge prior to first usage). As each day goes by, the battery appears to have more issues. Right now, it won't even let me charge it.....it shows a red battery and keeps cutting off.  Don't even have the heart to tell my friend. I am on-line right now ordering my son something of better quality.  Would not recommend this to anyone, for any reason.  I will say, when it was working, the tablet itself was decent/easy to use....it's completely a battery/charger issue, but it is enough of a problem that I say...DO NOT BUY", "Title": "Friend gifted to my 5 year-old on his Birthday 3/23", "Date": "April 19, 2014"}, {"Author": "MAGstar", "ReviewID": "R2IYTH64FB6HIR", "Overall": "1.0", "Content": "This is a very nice looking unit, unfortunately, its performance did not match its looks. Now, maybe my unit is not representative of this brand or model, however, in my experience, it will not stay connected to my 50Mbps WiFi. And, when it is connected, it's very slow and prone to drop out. Battery life? Not very long. It's listed as a dual core processor, but it isn't as fast as another tablet I bought at the same time, also a dual core. That unit, a Double Power, model EM63 has no problem connecting to my WiFi, and is faster, however, while it's performance is up to spec, it doesn't have a camera on the back side. With that said, I ordered another EM63 and I'll be sending the NeuTab back.", "Title": "A pain", "Date": "June 1, 2014"}, {"Author": "Toya Williams", "ReviewID": "RF6RKPYKJ6TIP", "Overall": "1.0", "Content": "I bought this tablet that came with a pink keyboard & case as a promotion by Amazon. When I received ilthe package,  the tablet wasn't even the right one, It was a Hawewi or whatever... tablet, and the case that came with It didnt even fit the tablet and the stylus that cane with the case didnt work on the tablet either. They couldnt have messed it up worse, Which meant amazon didnt even check or care they just said hey heres a tablet and heres a case lets sell it. I will never buy or recommend anything from Amazon ever.", "Title": "Sent me junk", "Date": "May 10, 2014"}, {"Author": "Shae Z. Godfrey", "ReviewID": "R2Q9KDIM4C3O3M", "Overall": "1.0", "Content": "and freezes all the time.  I sent it back.  yuck!  dont buy a cheap tablet, spend the money for a good one!", "Title": "slower than molasses", "Date": "May 9, 2014"}, {"Author": "Queen Dija", "ReviewID": "R1M3HECD7AIYZH", "Overall": "2.0", "Content": "Would not suggest buying this tablet, Moves very slow, graphics are not the greatest. Good for a child maybe, but as an adult I had higher expectations and was disappointed.", "Title": "Queen Dija", "Date": "March 21, 2014"}, {"Author": "kernel1635", "ReviewID": "R202XG1P9LS9N8", "Overall": "1.0", "Content": "the colors are not bright & vibrant but most of all the volume is terrible.  I have to hold it to my ear to hear anything", "Title": "Not too happy", "Date": "March 28, 2014"}, {"Author": "Jesus Amador", "ReviewID": "R2Q4TTZ8MNJV9Z", "Overall": "1.0", "Content": "I DID NOT LIKE IT AT ALL I GAVE IT TO MY DAUGHTER FOR HER BIRTHDAY . AND SHORTY AFTER IT DID NOT WORK WHEN SHE WOULD USE IT . IT WOULD TURN OFF WITH IN MINUTES OF USING IT . I HAVE RETURNED IT AND WILL NOT GET THIS KIND OF TABLET AGAIN IT WAS A BAD PURCHASE AND I'LL NEVER BUY IT AGAIN AT ANY COST ... J. AMADOR .. APPLE VALLEY / CA.", "Title": "4.1 Jelly Bean Tablet", "Date": "March 11, 2014"}, {"Author": "robert Todd Stoebener", "ReviewID": "R12Y7RFBHXS25B", "Overall": "1.0", "Content": "It arrived.  I charged it.  Used it sparingly for three days and then it would no longer power up.  Sent it back for a refund.  Seems like a product should last more than 3 days.", "Title": "Broke after three days", "Date": "March 3, 2014"}, {"Author": "ann busby", "ReviewID": "R3RL94GX60K7FE", "Overall": "2.0", "Content": "bought two for my grandkids for Christmas have already had to send one back would not charge. would not buy again.", "Title": "not a good item", "Date": "January 21, 2014"}, {"Author": "Christiane Harris", "ReviewID": "R3D3B8EQ3N2BZL", "Overall": "1.0", "Content": "The tablet wouldn't connect to internet. Tablet kept restarting by itself and going to home screen by itself. Never worked from moment it came out of the box.  Sent it back the very next day.", "Title": ":(", "Date": "March 12, 2014"}, {"Author": "kguns44dd", "ReviewID": "R3F477B26OBEAN", "Overall": "1.0", "Content": "The neutab tablet turned out to be a waste of money, I got it for my 13 year old son,after only 3 days it kept turning itself on and off constantly, now it won't turn on at all. It did not come with registration or warranty papers, so there isn't even a way to get my money back. I am very unhappy with this product. What a rip off.", "Title": "neutab tablet", "Date": "February 13, 2014"}, {"Author": "vanessa", "ReviewID": "RTFXHI8KA0H7W", "Overall": "1.0", "Content": "the neutab tablet was just a waste of money, it kept getting really and hot , and keeps on turning it off . next time i know  never to buy tablet from amazon, if i can i will get my money back.", "Title": "no GOOOOD!!!!!!!!!!!!", "Date": "February 4, 2014"}, {"Author": "Jacob Hasty", "ReviewID": "R357ASHCZEYZG", "Overall": "1.0", "Content": "I had to reset it as soon as I received it because it wouldn't turn on Wi-Fi, I can't download instagram and screen is like a mirror and is really hard to see.", "Title": "Junk", "Date": "December 5, 2013"}, {"Author": "gina", "ReviewID": "R1RG97BVILCDQ6", "Overall": "1.0", "Content": "The tablet screen cracked and won't work 3 days after I got it poor quality. The sad face i got from my boy was heartbreaking", "Title": "Bunk tablet!!!", "Date": "February 13, 2014"}, {"Author": "Rhian B.", "ReviewID": "REH1Z543JCMN9", "Overall": "1.0", "Content": "The home button isn't working and I would love to return it unless you have a solution of how to work it ?", "Title": "Home Button won't work.", "Date": "December 25, 2013"}], "ProductInfo": {"Price": "$129.99", "ProductID": "B00GX05NDU", "Features": "Powered by Google Android 4.1, the best performance version of world's most popular tablet OS\nInfoTMIC iMAPx15 Dual Core processor, stabler performance and longer battery life than before\nExperience movies, TV, and games, and more on a stunning 7 inch HD display (1024 x 600); 1080P HDMI output, play your tablet on a huge screen\nUltra-fast web browsing over built-in Wi-Fi (802.11b/g/n); Slim and light, approximately 0.3 IN and 9 OZ\nFull 1 year Limited defect warranty by registering on manufacturer website", "ImgURL": "http://ecx.images-amazon.com/images/I/51uuVPomtaL._SY300_.jpg", "Name": "NeuTab N7 7'' Dual Core Google Android 4.1 Jelly Bean Tablet PC, 1024X600 HD, Dual Camera, Google Play Pre-loaded, 3D-Game Supported"}}