{"Reviews": [{"Title": "Apple has done it again!", "Author": "JNH", "ReviewID": "R1S1FRBCJZZ97Z", "Overall": "5.0", "Content": "Design:This new iPad is so thin and light it’s amazing. It comes in weighing a little over 1lb.I upgraded from the iPad 3 and you can defiantly feel the difference. When reading with the iPad 3, after a few minutes my arms would be tired of holding the iPad up. With the new iPad Air, that is not the case anymore. I can read for much longer now and my arms don't feel tired. The unit is also easier to hold (much thinner than previous versions of the iPad)It’s built of high quality aluminum just like every other iPad is and constructed to last.PerformanceThe new iPad air is fast! It has an A7 processor in it which is defiantly an upgrade from the previous iPads. The Wi-Fi is even quicker to connect and I notice I can achieve more of my potential in bandwidth speed using this iPad. The new front facing camera makes video chatting much better and the M7 chip makes editing and slow motion shooting fun and a breeze.StorageI upgraded from a 16 GB iPad 3 to a 128 GB iPad Air. Why you ask? Well because I do a lot of traveling for work and Apple is notorious for sneaking in extra stuff on your hard drive that takes up space. My iPad 3 came with only 13.8 GB useable space and after a month I had 3 or 4 GB of “other” storage that no one could figure out how to remove or clear.I mentioned earlier I travel a lot for work so I enjoy watching movies on the plane rides. With my old iPad I never had room for all my movies I had to use a wireless hard drive  (Seagate Wireless Built In Streaming STCK1000100Just to watch my movies. Now with this new 128 GB hard drive I can fit tons of movies on it and I no longer need the old wireless hard drive. (One less thing to lose on travel)Final thought:For people who have an older iPad (like I did) then this is a no brainer buy this new iPad you won’t be disappointed! It is much lighter than previous versions. Wayyy faster! And still sleek and built to last as every other iPad is. The new storage options give you the ability to carry more pictures, movies, books , games with you and the battery life is superb coming in at 10+hours. Overall I am happy with my purchase. It might be a little expensive, but if you buy smart you'll have this tablet for a long time with no problems.", "Date": "December 27, 2013"}, {"Title": "Bad crashing problems, NOT ENOUGH MEMORY Major Fiasco", "Author": "P. Krumpter", "ReviewID": "R1KNHC7CNC2UP2", "Overall": "2.0", "Content": "I bought the ipad air when it first came out. I am a multitasker, and I open multiple tabs in my browser. The browser crashed every 5-10 minutes, losing log in status and work.The apps crashed constantly. The ipad air rebooted to the springboard constantly.I went to the Apple store and recreated the crashes and reboots on every ipad air in the store. This was after the Apple employees denied ever seeing a problem on the ipad air.It turns out that the ipad air has the same amount of memory as a 3 year old android phone- 1GB.All the quality tablets that came out in the last quarter have 2-3 GB RAM, except the ipad air.Somehow, it is being covered up. By Apple. If you go in their forums, there are plenty of (new users) people reporting crashing problems. Then you have the level 6 and up users denying there is a problem. Many posts are being censored and deleted by Apple.The 64 bit processor needs more memory than a 32 bit CPU - so in effect, the ipad air has LESS memory than the ipad 4.Do yourself a favor and dont buy the ipad air. It is already obsolete. If you must have an ipad, buy the 4th generation one, or wait until the next one comes out. You have been warned.", "Date": "February 4, 2014"}, {"Title": "Great if you have the money for it", "Author": "ReG Masse \"Love to Read\"", "ReviewID": "R344K1L81PTEM0", "Overall": "4.0", "Content": "Compared to the older models, it is  much lighter, so that means easier to use throughout the day. The specs are about the same as the New Ipad (iPad 3) and iPad 4. I would definitely get an iPad Air over an iPad Mini, even with the Retina Display, as what made the Mini desirable was the smaller weight and size. The Air is really light, more manageable for someone who uses it continuously.All in all, if you can afford it, it is a great gift, to yourself or seomone else (you really like :)).", "Date": "November 27, 2013"}, {"Title": "iPad Review from an Android user!", "Author": "Jason Wang", "ReviewID": "R3MRBK7OU4EGHS", "Overall": "4.0", "Content": "I purchased as a long time android user because I needed something for textbooks and the 4:3 aspect ratio works a lot better for text books than 16:9 (I tired the Nexus 10 for a week as well)..Here is my review after  a week:The first thing I noticed was how light and compact it was, coming from the Nexus 10 I was surprised how easy it was to hold with one hand (although you still wouldn't for long periods of time) and how compact it was for a 10in tablet. The tablet is as fast as anything out right now, to be honest I don't play games but in terms of everyday use everything was fine...but at the same time every iPad that I've used before felt fast as well, I have heard of some issues with tablet optimization for iOS7 but I haven't encountered any. The screen is bright and sharp, text is really easy to read vs a higher PPI tablet (nexus 10) I really couldnt tell a difference with the extra pixels. The color on the iPad is very good once again this is to be expected as Apple always makes high quality devices.The only Cons I can't think of is the speaker placement and feel of the glass (as mentioned in other reviews). The iPad has \"stereo speakers\" which are located on the bottom, I really wish they would have put one on each side instead of both on one side. Watching youtube or netflix in landscape is kind of weird since all the side comes from the right side, kind of defeats the purpose of stereo speakers imo since I never watch fullscreen videos in portrait mode. The nexus 7and 10  have  really good desigsn for speakers that I wish Apple would've adopted.The other con is the feel of the screen, to be honest it feels a bit cheap...compared to previous iPads and the nexus devices the feel of the screen on the iPad air is the worst. It feels like plastic and it just doesnt feel solid when you push down. I'm sure this is a sacrifice that Apple had to make in order to reduce the weight to me the benefits of having a lighter, smaller device outweigh the feel of the screen (something that I'll eventually get used to).Other notes: I haven't used the camera, sorry but I never use the camera on a tablet to take pictures but from what I hear from reviews it takes pretty much what you would expect from a camera on a tablet. I probably wouldn't upgrade if I had an iPad 3 or iPad 4 unless your someone who has to have the newest tech or is absolutely miserable with the weight.If you do want to purchase it you can get it for 479.99 + Tax, go to Walmart's website or you can have any other retailer price match it.All in all this is an excellent tablet besides the minor gripes...the only Android tablet I can see competing with the iPad is the Nexus 10 v2 if it ever comes out...and while I preferred the Nexus 10 for media viewing, real stereo speakers and OS, reading textbooks felt a little cramped and since I'm using this tablet primarily for \"school\" the 4:3 factor fit my needs better.So there it is proof that you can be a fan of both Android and iOS :)", "Date": "November 13, 2013"}, {"Title": "Great Experience", "Author": "Dragember", "ReviewID": "R3RZ0F8IARVY1A", "Overall": "5.0", "Content": "My first tablet was a Nexus 7, and while I enjoyed it immenseilly I was ultimately disappointed in how slow it eventually got (speedy at Christmas, snail slow come April despite factory reset and other attempts to speed it up. Bought my brother a new nexus 7 that summer only to discover its speed was on par with the Nexus I currently owned. Very bizarre). I was skeptical whether or not I would enjoy a tablet experience, so the Nexus 7 was none the less a great first tablet. It could do anything any other tablet could without putting a dent in your pocket.I decided to get the iPad Air this season, specifically the wifi 32gb space gray version.Never owned an iPad before, so I can't really tell you how the models compare,However some things I note, the screen is rather large (duh) which does make typing with the onscreen keyboard difficult. However the screen real estate and quality is stunning, and if typing is a huge issue for you there is the iPad mini and other tablets. That's the trade off, and this is always a choice you have to make between 10 inch vs. 7inch tablets, no matter what brand you're looking at.The glass does feel rather thin, and I am concerned about its durability. I have read that the screen is durable however, and this perception is due to the lightening of the device causing the screen to sound thinner. Supposedly I will be able to confirm this with a case, as the addition of the case will give the tapping of the screen a deeper sound. Apparently it all comes down to acoustics - though a specification on glass thickness versus previous models would be nice.The design of the tablet is exquisite, definitely some top of the line material choices. The tablet has a VERY sturdy feel.Lots of free apps come with this tablet, which all work excellently and efficiently. There is no hesitation between tasks, and the speed is phenomenal.Overall I noticed the quality of apps and how they work on the operating system is MUCH better with apple than it was with android. However, the apple App Store isn't very easy to navigate. Google store is much more user friendly.No widgets, makes customizabibility limited.Multitasking is an ease with this tablet due to gestures. I love how well the gestures work. You can swipe between apps.Battery lasts insanely long, mine averages 12 hours of use.Hasn't overheated (vague warmth can be felt), even with gameplay.Sound from speakers at bottom of iPad sound full. Other tablets I've played with have a tin-metal quality sound emit from them, as though the speakers strain to emit a hearable noise.All iPad Airs, according to Apple's website, come with a complimentary one year limited warranty.Cool front AND back microphones work together to cancel out noise when using skype and FaceTime. Sounds very clear and crisp, I recommend you check out some videos on it.Overall I would say an A+ tablet. I mainly listed some concerns and observations, but that aside this thing is amazing! I love and, it from what I've heard of previous models, I'll hopefully be using this tablet for years to come (number one selling point for me is that apple devices function excellently passed a year).Update December 3, 2013:I've noticed a bizarre memory leak that occurs whenever I watch videos using Apple's video app (love them digital copies). I was testing the video streaming and after I noticed entire GBs were gone! After shutting down the app and fiddling around I realized that the iPad stores memory it buffers and keeps it hostage. However, after going back to the app and quickly loading the same movie and exiting before it begins to buffer the memory reappears. That being said, I wouldn't be surprised that if you watched movies completely through your memory would be restored each time. Still this is a rather large flaw on Apple's part, and I'm not sure if it occurs with any of the other video streaming apps. I'll be sending them a message to see if they're working on a patch for it.", "Date": "December 1, 2013"}, {"Title": "The best tablet just got better", "Author": "G. Ware Cornell Jr. \"anotherlawyer\"", "ReviewID": "R1M0P0IQSS4RK5", "Overall": "5.0", "Content": "When the first iPad was released in the spring of 2010, it was accompanied by a cacophony of jokes about its name and its size. Three and a half years later, the release of the iPad Air, the fifth full-size tablet Apple has offer, has been much calmer. This is the fourth full-size iPad I have owned, beginning with the AT&T; 3G model which was released in May, 2010, about a month after the first WiFi only iPads arrived. Every one of my iPads has had an AT&T; cellular data.Until this model I have purchased the largest capacity solid state drive Apple has offered. This year there is a 128GB iPad, which costs about $100 more than my 64GB model. Here is the reason I did not select the higher capacity-iCloud. Data stored on iCloud is instantly available across multiple IOS and OSX devices. With all that storage (I buy 50GBs annually) why duplicate it on a hard disk?The iPad Air is incredibly light(about a pound) and has a slightly smaller external footprint than previous models. The retina display actually seems sharper, if such a thing is possible. It also holds a charge for even longer than before.Beyond the physical beauty of the iPad Air is its amazing utility. As a trial lawyer I can easily access the firm's network. This means that  every file and every document is instantly at my command. In just a few years time I have learned that I no longer need to drag loads of paper files and depositions with me to court.Over 400,000 apps are built exclusively for iPad, and well over a million iPhone apps run on my device as well. It is an incredibly powerful platform, well on its way to replacing laptops for all but the most labor intensive tasks. When I travel, I typically bring only my iPad-no laptop, no hard copy of a file.  I didn't really appreciate just how dependent I had become on the iPad until this June when a federal judge held that  I could bring  either a laptop or a tablet into the courthouse. I chose the iPad.My weapon of choice-the iPad. This is the one tablet to buy if you are serious about using a tablet. It's pricy, but it may well be, the perfect tablet.", "Date": "November 2, 2013"}, {"Title": "Best full-sized tablet on the market", "Author": "R L", "ReviewID": "R211Y1YLSW1J97", "Overall": "5.0", "Content": "I almost bought a smaller screen tablet, but when I held the iPad Air, I couldn't believe how impossibly thin and light it feels. Plus, the rounded edges on the back make this really comfortable to hold for long periods.I'm glad I went with Apple, because the quality is unbeatable. For something I use everyday, like a tablet, it really is worth the investment. As powerful as a computer, but an absolute dream to use. The iPad Air now comes with the feature-rich word processor and spreadsheets apps, called Pages and Numbers. With included cloud-based collaborative features that can even be accessed from a PC.While there may be cheaper tablets on the market, you certainly get what you pay for. For something that you'll use everyday, from the sofa to the bed, to the coffee shop and your next flight, I would choose a quality companion. You can't do any better than this.", "Date": "November 27, 2013"}, {"Title": "Great tablet (Fanboy/tech jargon-free, short review)", "Author": "J. Kraft", "ReviewID": "R2J5HWWAKE9XUD", "Overall": "5.0", "Content": "I gave this as a gift to my wife this Christmas and she absolutely loves it. I have a Samsung Galaxy Note Tab 2 and right away I noticed the weight of the iPad Air. It felt like a feather compared to my tablet. The display is crisp and VERY sharp, I was amazed by that. The only thing she had an issue with compared to my tablet, was that the speakers on the iPad are placed at the bottom and not on the front facing you, like it is on the Galaxy Tab. We turned it up all the way and it definitely gets loud, so it's not like the speakers aren't good. It's a minor gripe for an overall great tablet experience. I would buy with full confidence if you are in the market for a new tablet.", "Date": "December 26, 2013"}, {"Title": "Excellent, but could be unbeatable", "Author": "JE Craig", "ReviewID": "R34PGIBEBQG7TV", "Overall": "4.0", "Content": "First of all, I have never owned an ipad before but I have used other's ipads and was impressed with them.  I also have a motorola xoom and it doesn't even come close to the ease of use and just generally aesthetics of this ipad.  Its probably best that I break it down into pros and cons to give the most accurate picture I can of what I have found since I bought myself, my wife and my son all the new ipad Airs.--The Good--The business apps I use are all exactly what I hoped for.  I use Chrome for browser and it looks incredible.  When tablets came out, this is what I imagined browsing the internet should look like on a tablet.  The form factor is great, and the Air is as light as advertised.  Despite other's claims of durability issues, I have found it to be quite durable even with my minimal case.  Movies in correct format play flawlessy and my music sounds great.  Paired with some good headphones, long plane trips become tolerable in the worst of seats.  Facetiming with family is a breeze and the 'cool' factor is definitely still present.--The Bad--There are also some cons which I think takes the Air down a half star to a star.  First off the 16GB model which I purchased for my wife from a big box store after I purchased my 64GB from Amazon is simply not enough memory.  I know thats a choice etc but for those that are purchasing for the first time, do NOT buy the 16 GB model unless you plan on mostly using for browsing the internet.  Apps + music + movies will fill up your 16 (actually less after what IOS takes up) gigs very quickly.Second, they should have put a little more RAM in.  The browser occaisonally crashes and there is definitely some latency on scrolling for more content intensive pages.Lastly a few random complaints; the screen also seems dimmer than the ipad with retina (last generation), there is no additional storage, and there seems to be a growing number of junk apps/games.--The Ugly--I will preface this with this: only power users are likely to encounter the ugly.Synching with Apple TV is not as easy as advertised.  Sometimes the air icon shows up, sometimes it doesn't.You can play MKV files but it is painful.  You need a third party player, then you have to transfer movies via http (drag and drop doesn't work), and you will not see where that space went, should you forget about things you've transferred via that method.If you have a home media server and use a PC, itunes + network drives + adding files to the ipad reminds me of the days of the 2400 baud modem.  You wait, and you wait, and you wait.  Anything you really want to transfer, transfer it from your network drive to your pc, then add to library, then transfer to ipad.--Overall--I still prefer this to my android pad or any other tablets I have encountered. The pros outweigh the cons if you have the money to spend considering how much more these are than comperable android tablets.", "Date": "December 30, 2013"}, {"Title": "Wifes Toy", "Author": "victor a. quaranta jr", "ReviewID": "RMRD11B7V8WY8", "Overall": "5.0", "Content": "My wife is very thrifty and seldom ask for anything. She wanted a I Pad and i purchased her a kindle Fire, wound up sending it back she was unhappy. Picked her up the I Pad Air. She absolutely loves  this thing . Had to spend a little more but all the apps she wanted down load and its a lot more user friendly. T.Q........", "Date": "December 18, 2013"}, {"Title": "Very happy with the purchase", "Author": "Xiaodong Cheng", "ReviewID": "R39R44Y8UD95AG", "Overall": "5.0", "Content": "It is a beautiful unit, with solid construction, gorgeous display, and of course very light and thin compared with older models. It is running very smoothly  when running games. The battery life is really impressive considering its size. After 5 hours of non stopping video streaming, the battery dropped from 100% to 60%! I am very happy with my purchase and have nothing to complain!", "Date": "November 6, 2013"}, {"Title": "Good but should have included the fingerprint features", "Author": "redrover", "ReviewID": "R1RBYETUIF6IS9", "Overall": "3.0", "Content": "UPDATE 11182013:A number of comments seem to take issue with my statement of \"not feeling like glass\" but that is JUST MY PERSONAL FEELING. Others about the brightness...indeed I do have it cranked all the way up but the brightness is nowhere as bright as what is found on the Samsung Note 10.1 2014 edition, nor the iPad4 and my most recent purchase the Samsung Note 8. All 3 when cranked all the way up are much brighter than the iPad Air.I will be buying the new Google nexus 7(even with all the GPS and multi-touch issues) for the upcoming holidays but even in the store, that too seems much brighter...I am very dismayed at this lack of brightness from the Air but it is still more than adequate for indoors. I have not tried it outdoors nor will I as this is not my \"outdoor\" tablet...lol.I like Apple and the tight integration of their apps and the reason many including myself continue to buy their products. I do feel the price for this latest iteration is them trying to make money at our expense. WHO HERE DOES NOT KNOW IN THEIR HEART THAT APPLE IS TRYING TO GET IN ON THE CHRISTMAS RUSH AND PUT THE AIR AND THE NEW MINI WITHOUT THE FINGERPRINT FEATURES FOUND ON THE NEW IPHONE...COME MARCH MAYBE APRIL, APPLE WILL UPDATE THE IPAD AIR TO INCLUDE THAT FEATURE.I will continue to buy Apple mostly because their store has apps that are better, with more choices and work extremely well with their devices. I think this product is a 3 1/2 Stars at best and mostly for the size and weight reduction that is very significant. I feel the \"glass\" is too thin but seems to be durable as I have really been typing a lot on it as well as playing several games that require a lot of tapping. I am very happy with the size reduction but feel the brightness is not up to par with other new tablets or the iPad4.Recently the Safari browser has been \"crashing\" a lot over the past week in that when you tap on a hyperlink, the browser will basically disappear off the screen. None of the tabs close but it just disappears and returns you to the home screens. I also am finding the browser will get stuck/freeze for several minutes before resuming. I have several calls in with apple support and they are looking into the issues.Other issues is the VIDEO app, if you play a video via streaming not downloading and leave it somewhere like the middle or so on, it actually reduces your available memory by the amount you have watched from what I can glean. IT IS LIKE DOWNLOADING THE MOVIE TO THE POINT YOU HAVE WATCHED IT TO EVEN THOUGH YOU SELECTED THE STREAMING LINK. If you do this with several movies, you can basically wipe out your free memory. I find it difficult to clear the buffer and have basically learned to tell the app not to display any movies then to display movies then play the movie but move the slider to the beginning and press stop playing then done. Of these many steps I eventually clear the buffer but I am not sure which of all these steps actually is what does it if any!Oh lastly, the WI-fi is fantastic.FINAL RATING IS 3 1/2 STARS...MAYBE 4 IF NOT FOR THE BRIGHTNESS ISSUE.First I own iPad 2 and 4 and Samsung Note 10.1 2014 edition.I like...not love...the new iPad Air as it is faster both in operating the software apps and graphic intensive apps. The apps continue to be fantastic for all the pads not just the Air.Apple did a great job on the weight but FEEL STRONGLY THAT THE NEW SCREEN IS NOT NEARLY AS BRIGHT AS MY iPad 4 NOR DOES IT EVEN FEEL LIKE GLASS.As I type this review on the Air, the \"cheap tapping\" feel of this glass leaves me wondering how durable this glass is. It feels thin and makes a tapping sound not found on the more solid glass on my other two iPads.Oh I am keeping the Air for the faster processors but feel Apple has put out a product whose screen will not be as durable as prior pads.I can see it flex when I push down on it with minimal effort and have some light distortion when I press down like old type LED TVS.Apple over prices their products because they can and really did so on this iteration of their iPad. In my estimation the glass feels like plastic and the brightness is much diminished when compared to my iPad 4 and so must have a higher profit margin with all these cost cutting that resulted in a new iPad that for all practically purposes is just faster but not as solidly built as prior pads.Time will tell on the screen and maybe this is the way all tablets are headed to achieve the weight reduction and thinness. I love the ability to hold the Air in one hand comfortably for much longer than any of my current tablets. I am OK to sacrifice the glass quality as long as the touch screen does not suffer or long term screen reliability.I wish Apple would splurge and include a 6 foot charging cord...OMG $600 for 32GB and the cord is so short still after all this time...lol.", "Date": "November 18, 2013"}, {"Title": "Very nice hardware for the price! Lightweight, a joy to use", "Author": "Gearhead Mania", "ReviewID": "R3K3EAML83WH3K", "Overall": "5.0", "Content": "I've been using Android products mainly, but I first delved into touch devices with the first generation iPod Touch so I am familiar with iOS to an extent. For the past few years I've used Android FroYo, Gingerbread, Ice Cream Sandwich, and now Jelly Bean. I also have a Kindle Fire HD. The iPad Air is my first iPad, and I chose to go with the iPad Air because it has a much higher resolution than the best Android Tablets, with a really slick dual-core CPU and quad-core GPU. The Samsung Galaxy Note 10.1 is a close second but is more expensive than the iPad Air which was on sale during a Black Thursday promotion. The Galaxy Tab 3 just doesn't even come close with the screen resolution.The iOS 7 interface is OK. I prefer Jelly Bean's interface. Although clean and simple, the iOS interface isn't intuitive. There are too many sub-menus interwoven in odd areas. To change language, I have to go into no less than 2 sub-menu layers. Siri is fine, but Google Now/Google Search was far more intelligent and effective. Siri's default US female voice is much more realistic and smoother, but Google Now's other voices along with IVONA rectify that situation fairly well.The battery life on the iPad Air is very good. After an hour or so, I'm still above 90%. The WiFi is fast, and the overall UI is smooth. The movie/graphics playback is super fast. I can watch Flash based movies/video within the Safari browser without any hiccups.Compared to my 7 inch Kindle Fire HD, I felt that the 9.7 inch (Air's display size) or 10 inch screen size is just right, but only because the iPad Air is extremely thin and lightweight. The 7 inch KFHD is large enough to be usable for reading magazines, but it is not a good use of space. I have to flick through 2 or 3 screens while the iPad Air will show the entire page (in a very legible font size) in one screen. The KFHD is also heavy, so hopefully the new KFHDX is thinner and lighter.I used to make fun of Apple for going with the Lightning connector, but after using it up close, I can understand why it is innovative. It is made out of a solid chunk of metal with contacts on both sides. There's no \"right\" way of plugging it in, unlike USB where I constantly flip it around trying to figure out which side is up. But I still feel micro-USB is the right way to go, due to its universal acceptance with devices. The included 12W power adapter can actually charge the iPad Air at up to 14W of power based on what I saw with my Kill-A-Watt.With respect to the hardware and design, the iPad Air is outstanding at this price point. Aside from the hardware, the bulk of the iPad Air and Apple experience centers around iTunes, iCloud, and other Apple software. This is an area where I feel Google far surpasses Apple. The Apple ID system is cumbersome and annoying to use. I had to login probably a dozen times during the registration process, and buying/installing free apps required me to enter my password each time. It didn't seem like all of Apple's programs were tightly integrated because I had to use my Apple ID each time I fired up the apps for the first time. Once everything was setup and installed, it seemed fine. That said, installing and running Google's apps on the iPad was significantly less painful. The first time I used my Google account for an app (I believe it was YouTube), all of the other Google Apps recognized me and started syncing. Google Now/Google Search also puts Siri to shame, albeit Siri seems more \"human\" with basic functions. For instance, asking about the weather, Siri actually told me (In Chinese and English) that the weather wasn't very good at 27F. Doing basic searches, Siri and Google Now are about equal, but Google Now seems more intelligent with some of the intermediate activities like unit conversions or advanced searches.I never liked iTunes in the past, and my opinion has not changed with ITunes 11. It is overly complex to use. With Google/Android, I can access Play with a browser and have new apps sent to my devices with the greatest of ease. Syncing calendar events, email, contacts, etc... is also far easier with just using a browser versus the iTunes program on my PC. The good news is that iTunes isn't too bad to use on the iPad. Running Zinio, Conde Naste magazine apps, and other apps was smooth and problem-free.For those that like to use their tablet for browsing or reading magazines, or watching videos, I'd highly recommend a 10 inch display (the Air is 9.7\" but falls in the range). My 7 inch Kindle Fire is fine to use, but it is frustrating to use for magazines due to the amount of panning that is needed. After using the iPad Air, my Samsung Galaxy S3 feels claustrophobic with its 4.9\" display.Overall: 5/5 stars, the iPad Air is a well-designed device with great hardware especially with the Black Thursday/Friday promotions. However, Apple has a lot of catching up to do with respect to its software designs. I very much prefer Google's ecosystem as it is more \"cloud-based\" than what Apple is trying to do. Google's ecosystem feels almost seamlessly integrated while Apple's ecosystem felt more separated.", "Date": "November 29, 2013"}, {"Title": "Superb", "Author": "kalip", "ReviewID": "RQPH5B045CWYY", "Overall": "5.0", "Content": "This is my second iPad, I purchased an iPad 4 around a year ago.This iPad air is all I thought it would be and much more; it's muchthinner and the 64-bit A7 processor makes it faster it is also quite narrower although the screen sizeremains the same 9.7 inches.The retina display is  stunning and the battery life is great. You just can't beat Apple for quality.The first thing I noticed when picking it up is the difference in weight, this iPad air feels almost halfthe weight of my iPad 4. I can easily hold it in my hands for long periods.Like one reviewer alluded to earlier..... and judging from the comments of some, it seems thatthe major gripe most folks have about the iPad  Air is the price.I am almost sure if the price of the iPad was dropped close to that of those lower quality and lower pricedSamsung or Google Nexus; these same folks would be singing the iPad's praises.I have hesitation in recommending this product.", "Date": "December 6, 2013"}, {"Title": "Not disappointed", "Author": "Jadaros", "ReviewID": "RJNCYTJZMUC2R", "Overall": "5.0", "Content": "I bought this because I wanted to download epubs from the jw.org website and it works great for that.  The publications download easily, after you download the free ibooks app.  Once downloaded, the publications have all the scripture links embedded, pictures, etc.  This makes jumping from publication to Bible unnecessary at meetings because the scripture references are all right there in the publication.  The books are located in your library as books, too. The iPad Air is easy to set up, easy to use, lightweight and the battery lasts a long time.I have two older Kindle Fires and downloading non-Kindle books was a pain.  I had to get help from my geek speaking son to convert the files, the scripture links weren't always there, they didn't appear as books, but as downloads without a cover picture, and the pictures inside were messed up.  I love the Kindle for reading Kindle books and watching movies, but the iPad Air is better for downloading and reading non-Kindle books.", "Date": "March 29, 2014"}, {"Title": "I love it and it is light!", "Author": "Dr. Oceanfront \"Oceanfront\"", "ReviewID": "R20QAYXRGADNIY", "Overall": "5.0", "Content": "First my background...I am an Apple user with a lot of Apple gadgets. I need to be on the computer for 7-12 hours a day.I already own a MacAir, which I love, but as light as it is, it still weighs about 3 pounds ( still, I highly recommend and love my MacAir!).Anyway, I also have an ipad 3 and an Ipad mini, iphone etc., you get the idea. The reason I am mentioning this, is because I have a bad back and that is the only reason I have been updating devices. I am trying to find the \"perfect\" computer for my use. If I can help even one other person out there in my situation ( and save them a ton of money I had to spend <g>), I will be happy! :)First let me tell you a little about the Ipad Air...IT ROCKS!!Although the speed on the Air is much faster then my Ipad 3, whether syncing with iTunes, browsing the web or just getting emails, the speed was not the reason I upgraded. I am not a game player or a number cruncher so the speed of the ipad 3 was just fine for me.What did get my attention was the weight! I had already bought the new ipad mini, which is super cool and a lot of fun.I actually intend to keep it. However, as good as it's screen is, I cannot see me using it 10 hours a day. If I had 20 year old eyes, it might have beat out my Air! ;-)The a Ipad 3 was about 1.7 pounds. That may not seem like a lot, but for me it could not be a one handed device. I needed to put a case on it, making it 2 pound device. Compared to the Ipad Air, which is about 1 pound, that was almost a 50% reduction in weight! The reason the reduction is so much, is I do not feel I need a case with the Air. I have covered it with clear coat all over and that is it. I do not seeing it slipping out of my hands. However, when I travel, I will use a 5 oz cover or just a Smart Cover (3.5 oz).I know it can be dangerous, not using a case, but I am extremely careful and i bought the special Apple warranty. Besides, isn't the reason we spend so much on these because they weigh so little and are aesthetically pleasing?It is too beautiful to cover up. So far, no regrets at all, but I need to find something to lean the Air against while lying down.If my review helped you, please click \"helpful\" below. Thanks :)", "Date": "January 8, 2014"}, {"Title": "love it", "Author": "M. Feldman", "ReviewID": "R3RJBL6E94L09V", "Overall": "5.0", "Content": "yes I love it.  I've had an iphone for years as has the rest of my family.  I have to admit I read all about the new Kindle Fire HDX 8.9 and I bought it two weeks ago. the specs were awesome for the price. the only thing is a lot of the things I needed were not compatible with it. then my granddaughter tried to facetime with me and of course I couldn't because  Kindle doesn't have facetime. I told we would both have to download Skype to teleconference with eachother and she said forget it. too much trouble.  then I'd have to buy new extra chargers/cables etc. just too much incompatibility. so I returned it and bought this and I'm thrilled and happy with it. if I wasn't used to Apple products I would have kept the the Kindle. just being honest as I don't want anyone to think that the Kindle wasn't good", "Date": "November 21, 2013"}, {"Title": "Disappointed first time apple customer", "Author": "Ginfx", "ReviewID": "R3PXX0AJCUBKMP", "Overall": "3.0", "Content": "I was excited to purchase my first apple product. This unit was purchased from another retailer as part of a bundle and offered flexible payments. I was looking at the Air laptop, but then heard iPad air was coming out.  Sadly it will be going back.  iPad air is thin, lightweight, perfect size screen.The color is super sharp.  Super fast typing and going from app to app,, when it wanted to work. Which meant I really couldn't tell you if they worked well or not.  I'd only had it for a day and the screen froze.  Could only go back to the home screen, then loose any work one might have done. Couldn't turn it off. Then, when I was getting ready to put it back in the box, amazingly it decided to work. The set-up wizard was super fast helping this technically challenged person set up and link  all her accounts.  I REALLY liked that it was a tablet and a small laptop as it came with an awesome keypad. So then I started downloading music and wanted to hear the small ball speaker that came in the bundle. The female plug in the air was not quite the right size. I couldn't get a snug fit, also tried with the ear buds and another speaker. And as I fidgeted with the plugs to get a secure connection to receive a signal, the song would stop playing and the volume on the screen kept going up and down. Is this supposed to happen???? As for the sound, I wasn't expecting much from such a thin tablet. The speakers were on the back side but I'm not sure if speakers could be placed in the front. But since the speaker plugs won't fit, what's the point? You'd need to buy some blue-tooth speakers to really hear better soundIt would be hard for me to compare the ipad air to other tablets as this would have been my first touch-screen device other than my android smart phone.I'd have to agree with previous reviews. I also feel this device was rushed on the market before X-mas. With the screen freezing and the plug being poorly made, is a good indication of frantically putting something together and getting it on the market for the holidays. I really hope that the next generation iPad air will be greatly improved as I really like apple products,and software, and was hoping this would be the first.Apple, I am disappointed. You can do a lot better. Quit cutting corners and please remember you have a reputation to protect.", "Date": "December 5, 2013"}, {"Title": "Love It - Even If I Don't Like Admitting My Spouse Was Right ...", "Author": "delicateflower152", "ReviewID": "R1DLRVVT9CG06G", "Overall": "5.0", "Content": "Because I love my Kindle Keyboard, I was firm in my resolve to upgrade to the Kindle Fire HDX 8.9\".  The need for both color for children's books and my own need for a white background to provide contrast when reading were my primary motivators.  The price and versatility of the Kindle were better than other options available.  I do not use my device as a media player, but that seemed to be a nice option.  However, my spouse insisted I look at the \"Apple iPad Air\" before I made any purchase.After looking at the Kindle Fire HDX 8.9\" and the \"Apple iPad Air\" side-by-side in the big electronics retailer, I had to admit it, he was right!  Clarity on both devices was excellent, particularly as I intended to use the item primarily as an e-reader.  However, the Kindle Fire HDX 8.9\" kept freezing up; the blue shirted employees said that was a frequent occurrence.  The \"Apple iPad Air\" connected easily to WiFi and navigation was smooth and seamless.  The ability to use many of the same programs I have installed on my PC is a plus.  Downloading books is quick and the \"Apple iPad Air\" does not bog down so that it seems painfully slow when I try to change from a book to the main menu page.  Using the \"Apple iPad Air\" is intuitive, even for those individuals - like me -who are not especially tech-savvy.  Based on recommendations and the fact that I would use the tablet when traveling, I purchased the \"Apple iPad Air\" 16 GB with the ability to connect to AT&T.;The principle downside of purchasing the \"Apple iPad Air\" is its initial cost.  Individuals who are debating between purchasing a Kindle Fire HDX 8.9\" and an \"Apple iPad Air\" should look at the two side-by-side; consider their primary uses and personal preferences; and evaluate the price difference in light of those factors.  While I don't like having to admit my spouse was right, I do love my \"Apple iPad Air\".  If it fits your needs, you may find the \"Apple iPad Air\" is a tablet you will love, too.", "Date": "January 16, 2014"}, {"Title": "Perfect iPad", "Author": "Mak", "ReviewID": "R1N47LPBW4W011", "Overall": "5.0", "Content": "Excellent iPad, much better than predecessors. Everything you could want (thin, light, retina display, A7 processor, better battery life). Highly recommend this iPad if you are looking to upgrade or get your first one.", "Date": "December 6, 2013"}, {"Title": "Too good", "Author": "Pavan", "ReviewID": "R35NGXXYIHAFG8", "Overall": "5.0", "Content": "Start using it for the past 1 month and love it. This is my first tablet and cudnt any better.", "Date": "March 19, 2014"}, {"Title": "THE BEST", "Author": "yocheckitout", "ReviewID": "RP8KL77KD32MK", "Overall": "5.0", "Content": "The iPad Air is everything I wanted it to be. It is so much better than the older iPads. Its light and its easy to hold onto. If you're looking for a tablet, I'd definitely recommend the iPad air", "Date": "March 19, 2014"}, {"Title": "Gift for my Wife", "Author": "Doyen", "ReviewID": "R3IFOHTMHD4FI6", "Overall": "5.0", "Content": "My wife had the original iPad. This purchase was an upgrade for her. The original iPad was just too old to run some of the new apps.She loves her new lighter, clearer, faster Air. We had no trouble getting on the AT&T; network. One call and everything was up and running in minutes.Shipping was outstanding. Received the iPad in two days in perfect condition.", "Date": "March 7, 2014"}, {"Title": "Rarely needed, always pleasant", "Author": "Tyler Mumford", "ReviewID": "R3OXHCBW592RLO", "Overall": "5.0", "Content": "I use my iPad for things that I could do with a laptop or iPhone, but it truly is more convenient for many of those tasks. I read, watch shows, browse the net, manage email, and take notes, to name a few things.", "Date": "February 18, 2014"}, {"Title": "Fully meets expectations", "Author": "George F. Smith", "ReviewID": "RIBYND44K2AQV", "Overall": "5.0", "Content": "Bought this for my wife as a Christmas present, and she absolutely loves it.  She had been using an earlier iPad so was already familiar with tablet technology.  She uses it for reading, checking email, web browsing, and for taking videos of our grandson during his wrestling matches.  For some reason, iPads are popular among moms and grand moms for taking wrestling videos.  She then transfers the videos to her MacBook Pro, writes them to an optical disc and gives it to the coach for analysis.  Video transfers are achieved when she syncs the iPad Air with her MBP.  She keeps it protected in a pink Otterbox, which gives the iPad a completely different look and feel.iPad Air is thinner and lighter than previous iPads and comes with a sharp Retina display.  I don't know if it's the best tablet for your money.  I do know she keeps it close at all times, and though she doesn't qualify as a geek she's worked in software maintenance most of her professional life.  If she were unhappy with it she wouldn't use it.  From my perspective as her husband it's a winner.My one complaint about all digital gadgets is that they are not nearly as tough as the old HP calculators.  Out of the box the gadgets are beautiful but then you have to stick them in some kind of case if you want to protect them, and the cases are a different look altogether.", "Date": "February 18, 2014"}, {"Title": "Super", "Author": "tct2 \"tct2\"", "ReviewID": "R1SO6X4JJA8GA", "Overall": "5.0", "Content": "I traded in my iPad 2 for the iPad air and could not be happier the performance difference is amazing! And the fact that how much value these devices hold. I received $168 from Amazon for my v2 to put down on the the Air, no other device on the market has the same residual value. I plan on using the air for three years then trading up for the latest and greatest. Read the cnet reviews/comparisons (just search best tablets) on this tablet it is the the cream of the crop and if you keep it in good condition with packaging it will hold its value. Props to Apple and Amazon!", "Date": "February 16, 2014"}, {"Title": "Great Ipad AIr. We love it.", "Author": "Jian Du", "ReviewID": "R16X17BS20UUEB", "Overall": "5.0", "Content": "Thank you providing a great product for easier our life.This is a very attractive product, light & mint and highly effective for work & life usage.", "Date": "February 16, 2014"}, {"Title": "apple i pad air", "Author": "bob f.", "ReviewID": "R23137PS1UPC2A", "Overall": "5.0", "Content": "i considered the apple i pad air since i have used apple products i have often found them easy to use, and ithe  i pad fits right into my computer world.. while others make make great products; i consider apple to be at  the top of the list", "Date": "February 9, 2014"}, {"Title": "Best yet", "Author": "Afmarko99 \"Visit my stock trading site and jo...", "ReviewID": "RMOPK3O798IGH", "Overall": "5.0", "Content": "My wife was extremely excited when I gave this to her for Christmas.  She was an owner of the original iPad so this one was quite the upgrade.  It is super light and extremely fast.  Highly recommended.", "Date": "January 20, 2014"}, {"Title": "Great product", "Author": "Robert J Hawk", "ReviewID": "R3FYV6SXBL7RQL", "Overall": "5.0", "Content": "It is far lighter than my wife's iPad with retina display. This makes it far less fatiguing to hold and carry. The new iOS 7 is also very cool.", "Date": "January 20, 2014"}, {"Title": "Great", "Author": "Victoria Enger", "ReviewID": "RM6QGFKCMDQK", "Overall": "5.0", "Content": "Best iPad ever.  Love it.Beautiful pictures and great functions. Wouldn't have another and other kind of tablet.  Light and easy to take around", "Date": "January 1, 2014"}, {"Title": "I love it !", "Author": "Julie Ramson", "ReviewID": "R2XESEEA91TQ76", "Overall": "5.0", "Content": "I got this two weeks ago and love it!  It's all that I hoped it would be and more.  The product came in perfect condition, sooner than I had expected and the seller followed up to be sure I was satisfied.  I would definitely buy from them again.  They were great!", "Date": "December 31, 2013"}, {"Title": "The most well rounded tablet you can buy", "Author": "Nick", "ReviewID": "R1Q04HD4US4YZU", "Overall": "5.0", "Content": "After previously using the iPad 2 , this iPad is a whole new world. Apple constantly thrives to improve there products, and this one is no exception. The new IOS coupled with the blazing fast 64-bit a7 chip makes this one of the fastest tablets I have used! The ease and simplicity of this tablet makes everyday emails, messaging, projects,etc. no problem. This is the only tablet I have looked forward to using.Now for more serious activities like gaming and other intensive applications, the iPad has no problems what so ever. The graphics are very smooth, almost life-like.  From the outside, this is the most beautiful tablet hands down. From the chamfered edges to the sleek aluminum back, this is a high quality device. Most other tablets are made out of cheap plastics, not this one. Everything feels well made and solid. Even though apple chose to use metals and other high end materials, the iPad remains one of the lightest and thinnest full size tablets you can buy. Another high point for the iPad air its the battery. It seems to go on forever! After using it throughout the day, I end up with 70 to 80 percent battery! Its unbelievably how much juice this thing holds! Some miscellaneous things about the iPad that push it even further over the top are the decent cameras and the excellent microphones and speakers. The speakers have a good base tone and very clear high pitches. Overall I would recommend this tablet to anyone looking for a device that can do pretty much anything. I just don't see anyway the apple can improve on this iPad. I guess we will just have to wait and see.  Keep it up Apple.", "Date": "December 30, 2013"}, {"Title": "Brilliant", "Author": "rafagrullon", "ReviewID": "R2QTYOU02A2S8U", "Overall": "5.0", "Content": "Brilliantly light. Brilliant tablet. Brilliant quality. Apple had this right. Can't say anything negative about it. Would recomend without hesitating. PS.: It comes with a wall charger and USB lighting cable.", "Date": "December 28, 2013"}, {"Title": "Great Product", "Author": "babajou99", "ReviewID": "R2DI6I8ZC828U7", "Overall": "5.0", "Content": "Has all the features I am looking for IPAD with the new technology and features to work and to have.", "Date": "December 28, 2013"}, {"Title": "It's Grrrreeaaat!", "Author": "Billie too", "ReviewID": "R3IMOIYP5DQNTZ", "Overall": "5.0", "Content": "The color and picture are even better than my HD TV. Got this for my Husband for Christmas. He's hardly put it down since then. We have a Roku 2 but the picture quality on the iPad Air is far superior to the TV and he now prefers to watch movies on the tablet instead of the television. Luckily I can still use my iPad Mini when I want to watch on the bigger screen.", "Date": "December 28, 2013"}, {"Title": "iPad", "Author": "William Myers", "ReviewID": "R3QDLZ2AXX8OJQ", "Overall": "5.0", "Content": "First iPad that I owned and just love it. For the price is should include a pen. Otherwise I have no other negative feedback.", "Date": "December 27, 2013"}, {"Title": "Ultra fast processor performance.", "Author": "Jimmy Pong", "ReviewID": "R2KASXBUVQ618J", "Overall": "5.0", "Content": "60 fps performance on GT Racing 2.  The A7 processor is a beast.  I upgraded from the iPad 3 and the performance upgrade is phenomenal.", "Date": "December 26, 2013"}, {"Title": "Apple iPad Air", "Author": "Larretta G. Hay", "ReviewID": "R1CR17Q4Z3I190", "Overall": "5.0", "Content": "This is a wonderful gift to me from me!  I have been wanting and iPad for awhile and when the iPad air was introduced, I knew I had to have it!", "Date": "December 26, 2013"}, {"Title": "The best purshase that I did", "Author": "Jasmina G.Boycheva", "ReviewID": "RW7IQ5MPQTS5J", "Overall": "5.0", "Content": "I never had apple before an I decided to have one,I am very satisfying of this purshase.I forgotten my laptops my android phones....very positiveP", "Date": "December 26, 2013"}, {"Title": "I decided to upgrade.....", "Author": "Brian Upton", "ReviewID": "R3787J9NJCNBLJ", "Overall": "5.0", "Content": "I have a 1st generation iPad and decided to upgrade to the iPad Air as I found some of the newer apps on the market are not compatible with my older iPad. The first thing you notice is the increased speed of the processor and the iPad Air is so much lighter. The camera and video functions are nice additions even though I have not used them yet. The unit walks you through the set up process and linking up with your Wi-Fi very quickly and your good to go! Don't hesitate if your on the fence about upgrading from the first generation to the new iPad Air. You'll be glad you did.....", "Date": "June 4, 2014"}, {"Title": "A used peice with password protected...", "Author": "Deepak", "ReviewID": "R31T6VQE70T5CK", "Overall": "2.0", "Content": "It says that its a new piece but i got a used one, it says Moma's ipad when i connect to my laptop. It has a password lock too, i dont know what the password is...Please help me...", "Date": "June 3, 2014"}, {"Title": "another great Apple product", "Author": "R.M", "ReviewID": "R3MNNCN9SI93YO", "Overall": "5.0", "Content": "I love the IPad Air, it frees me from my desktop so I can work from anywhere! I haven't even begun to look at all the apps!", "Date": "June 2, 2014"}, {"Title": "A truly wonderful piece of hardware.", "Author": "Kyuzosan", "ReviewID": "RG3UUEOVR7FY", "Overall": "5.0", "Content": "Please note that when it comes to this market, I prefer Samsung based Android devices. Without any bias, this is a solid tablet computer. The touch screen is responsive, has great performance (iOS 7), and has outstanding battery life. Everyone in the family has a use for it, and with the right amount of storage and price point, is a valuable device. The merchant at which I purchased it from had it priced $100 below retail MSRP during its 1st half year on the market (March 2014). A great recommendation as a gift.", "Date": "May 26, 2014"}, {"Title": "iPad is the best !", "Author": "Bruce Holms", "ReviewID": "R3NHSO4M0POTRS", "Overall": "5.0", "Content": "I had the original iPad that I received as a gift back in April of 2010. At that point (a long time ago in the tech world) very few people took it seriously. My only concern at the time was the lack of a \"USB' port and camera. However, I was very eager to use it and I did. By the end of the year, I had accumulated 25 apps and was already \"sold\" on its usefulness.By 2012, it became obvious that with the release of video cameras and newer OSs, I was being left in the back - so I began to wish for a newer version. Recently I saved up enough money (about $800 total when you add in insurance) to purchase the latest iPad which I am reviewing now. I still always buy the 64GB version because I always need more space.What I like most about the the new iPad is that it is much faster and a lot lighter. What I don't like is the lack of a \"USB\" - but I guess you can't have everything.", "Date": "May 26, 2014"}, {"Title": "Gorgeous. Solid as a rock. Fast as hell. Just about perfect.", "Author": "S. Krason", "ReviewID": "R3J5RGZU0OFLFM", "Overall": "5.0", "Content": "Apple attracts haters these days because they're now considered the overpriced behemoth when they used to be the little engine that could. Whatever. This is the best-built, fastest tablet you can buy.Pick up any other tablet and twist it. It moves. It creaks. It's made of plastic and feels cheap. The iPad Air doesn't budge or make a peep. It's solid as a rock. It's gorgeous to look at, a pleasure to use and I adore it.", "Date": "May 24, 2014"}, {"Title": "Over $450 and another $9 for a user manual ??", "Author": "olrick", "ReviewID": "RYFZKO8HR9DR4", "Overall": "4.0", "Content": "My first Apple product, my first swipe screen---and it comes in slick package with a postage stamp of \"instructions\"......You want to read about how to use your new iPad Air ?  Be prepared to BUY  your operator's manual on line from Apple--ifof course you can navigate through the App store!.It may be greater'n'grits,  but I am struggling with basic functions  and a little bummed out that \"everyone\"  thinks these things are intuitive.  Shucks, I almost sent it back, because the harder I 'touched' the less often it worked !  It took a young relative to explain soft swipe and soft touch...", "Date": "May 21, 2014"}, {"Title": "Difference from iPad 2 to iPad Air is leaps and bounds.", "Author": "Nick", "ReviewID": "R3Q1K3UCP1BXS2", "Overall": "5.0", "Content": "Difference from ipad 2 is night and day. Retina display looks unbelievable. The speed difference is extremely noticeable. If you have an ipad 2 and you are considering upgrading to ipad air, they are in different leagues. Would HIGHLY recommend to the ipad/apple enthusiast.", "Date": "May 14, 2014"}, {"Title": "love it", "Author": "TROY MILLS", "ReviewID": "R3EWY3Z2G1RY2", "Overall": "5.0", "Content": "Really love the Air, still have the iPad 3 which my wife now uses, she loves it, i can see a little better graphics on the Air, great product", "Date": "May 13, 2014"}, {"Title": "If you already have the iPad 4; keep it!", "Author": "Wade A Carr", "ReviewID": "R1OFWPERK71Z05", "Overall": "3.0", "Content": "I replaced my iPad 4 w/ Retina Display for the iPad Air.  I should not have wasted my money.  It really isn't that much lighter.  The frame is smaller on the Air so to be prepared to purchase another case.  The cases available for the Air are not as nice as the Ipad 4 cases.  The only person that wins on this deal is my nephew--he gets a free iPad 4.", "Date": "May 11, 2014"}, {"Title": "Nice upgrade", "Author": "Jacx \"J.C.\"", "ReviewID": "R3OLYYBSUX1RHR", "Overall": "5.0", "Content": "I was needing a new iPad  and bought a kindle since they were on sale one day, the kindle is good for reading, watching netflix , holding my audio books and other things I have purchased through amazon but had some issues with app compatibility , apps not working well and writing programs just too different from what I was use to, not to mention only a front facing camera. Also the screen was tiny for web browsing.So I went ahead and bought the iPad Air and I am so glad I did, it's fast , has all my apps and rear camera although low light photographs are not the best and the speaker system in iPad Air is not up to the quality of the original iPad, which I still own and use but they no longer support or update. The iPad Air responds quickly and I am happy with it.  Was so impressed my mom updated her iPad a few days later getting the same one. I do like the white, had black before, slightly brighter when naked but mine now has a silicon case around it covering edge anyway.", "Date": "May 10, 2014"}, {"Title": "Yes lighter, yes faster, necessary to some.", "Author": "Christine A. Strand \"Chris\"", "ReviewID": "R2MOXWTQYUOCL7", "Overall": "4.0", "Content": "Yes new Apple items are awesome or amazing, I dislike the planned obsolescence, the waste left at each purchase and I am not speaking only about the garbage.  I would have happily used my iPad 2 for years and years if only the O S could support applications fundamental to my project. Cahoots I tell you!!", "Date": "May 3, 2014"}, {"Title": "great to use....and long lasting!!", "Author": "Swati Sundaram", "ReviewID": "R2E9XH8ZSG399E", "Overall": "5.0", "Content": "Just got an ipad air, its light in weight, has longer lasting battery life.  My kids use it more than i do, they do a lot of reading and games on the ipad.  It very easy to use, light in weight and has a lot of wonderful apps on it.  they absolutely love it.  Use it also to take pictures.  Just love it....wish i had brought it much earlier.....", "Date": "May 2, 2014"}, {"Title": "ipad air 32 gb", "Author": "Willie Fetchit", "ReviewID": "R32PLRW76F7PWU", "Overall": "5.0", "Content": "I was always warned to stay away from Apple products because they are proprietary. They told me they only run apple software. Guess what ? NOT TRUE. I love this product. I've had it two weeks now and it does everything my desktop quad core does, only faster. True, it took me a few minutes to find my way around the controls, but after that it was a breeze. My only regret is that I did not order it with AT&T.; Lightning took out our phones and internet for3 days and I went into withdrawal ! A great device. So light and powerful. Well worth the money !", "Date": "April 30, 2014"}, {"Title": "IPad Air", "Author": "Penny Schritz", "ReviewID": "R38VH6W5T1GY46", "Overall": "5.0", "Content": "Was a great birthday gift for my partner. Her I Pad was 3 years old, and giving her problems. Sound didn't work sometimes. This new I Pad Air was just great. I even had the time to update it from her old one, so when she opened it, it was set and ready to use.", "Date": "April 30, 2014"}, {"Title": "Love my apple Air", "Author": "ROBERT PINES", "ReviewID": "R2DOYC7HWAWPJE", "Overall": "5.0", "Content": "It is really a great tool.  I use it to surf and to read books and its just so convenient", "Date": "April 26, 2014"}, {"Title": "I love it.", "Author": "Amazon Customer", "ReviewID": "R2XF9TUJXKI20Z", "Overall": "5.0", "Content": "Works perfect. Very good for my sermon preparation. I will recommend it for all my friendsespecially my pastor friends", "Date": "April 22, 2014"}, {"Title": "Best there is! Lighter, faster, more powerful, more compact, and with a longer battery life to boot.", "Author": "Hugo D. Ley \"Looking for a Good Deal\"", "ReviewID": "RWJ6NQ3O04JGA", "Overall": "5.0", "Content": "And last but not least ...an amazing ecosystem.I've had the original iPad, and got the iPad mini because of the weight of the original. But the new Air gives me a great a large screen retina display with a vey manageable footprint and weight. Technology is all about usability, enjoyability, and productivity, and the iPad Air gets an A+++ in those accounts.", "Date": "April 22, 2014"}, {"Title": "Not enough memory", "Author": "Cindy Cove", "ReviewID": "R1V2JWJRHI0OHY", "Overall": "5.0", "Content": "I didn't realize how much \"stuff\" I had on my previous iPad.  So I had to return it and order a 32gb.  The return was extremely easy as well!", "Date": "April 17, 2014"}, {"Title": "Love this product.", "Author": "Kerstian", "ReviewID": "R3QR870ZW2KN74", "Overall": "5.0", "Content": "I received this product from Tech Giant.  The shipping was fast and the product came in the iPad box like if you buy it in the Apple Store.  I had originally had the iPad 2 and felt like I wanted to upgrade.  I use my iPad for social networking, games, and online.  For me it's a great iPad.  It's like(which I think is due to the screen, which feels more like plastic then glass).  All in all great iPad!", "Date": "April 16, 2014"}, {"Title": "Best purchase I've made here,", "Author": "CTV", "ReviewID": "R1WJLMDS1Q03I9", "Overall": "5.0", "Content": "The IPad is wonderful! I adore everything about it. The customer service and speed of delivery was exceptional. As a matter of fact, I love this little contraption so much I have already purchased two covers for it-and that's not like my \"usual self\" LOL. Yes I have a high speed high performance computer and an IPhone but this IPad Air still rocks,", "Date": "April 16, 2014"}, {"Title": "Much better than older iPad", "Author": "P. Sweeney", "ReviewID": "R3171COVKXJDXS", "Overall": "5.0", "Content": "I am very happy with this new version of iPad Air.  It is not too heavy to use in the living room.  The graphic or picture quality is excellent!", "Date": "April 15, 2014"}, {"Title": "I got this one very quickly and I'm very satisfying the product", "Author": "Yohan Chang", "ReviewID": "R1KJQPP1GLPHWJ", "Overall": "5.0", "Content": "I used to use iPad 2 (no retina display) for a long time.However, I moved to Galaxy Note 10.1 for writing in my class.(I had two notes 2013, 2014)Obviously, iPad writing function can not overcome Galaxy Note's; since they has Wacom sensor.I used Galaxy Note 10.1 2013 for a year. Exactly a year later, the machine had been broken.So, I had to decide between iPad Air and Galaxy Note 10.1 2014.....Because of my class, I had to but Samsung product again.However, as you guys already well know, there are not many apps on Adroid. Still iTunes has a huge of app store.iPad air is very light and clear.If you are student, I strongly recommend iPad air instead of Galaxy Note 10.1. Of course if your considering is not writing only.There are many apps even school such as library.", "Date": "April 14, 2014"}, {"Title": "ipad", "Author": "raymond dingler", "ReviewID": "R3CKFVGT1KHJZ3", "Overall": "5.0", "Content": "I bought it for my wife & she loves it.It came faster than she expected it.She gives it an A+ .", "Date": "April 14, 2014"}, {"Title": "Son loved this..", "Author": "Melinda Casado", "ReviewID": "R30Q0ZMV11VQXU", "Overall": "5.0", "Content": "It was a gift for our son, and it is his first iPad!  Myself and dad have older model iPads...after seeing and testing the iPad Air, I want one!  Will ask for it for my birthday, and will count myself fortunate if I get one!  It's so much lighter and easier to lug around than older version!", "Date": "April 14, 2014"}, {"Title": "My 1st Ipad !  Did not know what I was missing!", "Author": "GCP1022 \"GC Poli\"", "ReviewID": "R1G8BAVGZIZKCY", "Overall": "5.0", "Content": "I purchased my first Ipad ever and did not know what I was missing, my family and I love it. I read all the reviews on cnet and here!Glad I made the choice, next ipad I will get the 64 gb, due to the great deal on amazon, I could not resist in getting the 128 gb, a lot of apps have already been added and now pictures and movies will soon follow!", "Date": "April 13, 2014"}, {"Title": "My very first apple product... and i really like it alot.", "Author": "IMvVIP", "ReviewID": "RP3R40MNINAWR", "Overall": "5.0", "Content": "I use to have asus t300 android tablet for 2years.But important stuff is i am using android phone for long time.don't need to use tablet that much because my phone does all.however move to ipad.. wow new world.news, email, apps, games, movie, music and cloud storage.so far so good.i am so happy to having this apple ipad air.", "Date": "April 12, 2014"}, {"Title": "Love it!", "Author": "Whoever", "ReviewID": "R1RPV81O35A727", "Overall": "5.0", "Content": "I drug my feet about buying an iPad for a year. Well, I actually bought an iPad retina a year ago and took it back because I was disappointed in how heavy and clunky the unit was. The new changes to the iPad Air makes it soooo much better, and I love it. I checked out the 10\" Samsung and decided it just wasn't enough, and I actually bought the Samsung Tab 7\" last fall, but neither of them hold a candle to an iPad for speed and sharpness. There are a load of androids out there, nothing comes close to an iPad. The battery time on my Samsung Tab 7 is so short I didn't even reconsider the Samsung Tab 10 when I decided I had to have a bigger screen. Great battery time on an iPad.", "Date": "April 8, 2014"}, {"Title": "excelent product", "Author": "Yasmin Porteles Avila", "ReviewID": "R3KSM3CO13GYKO", "Overall": "5.0", "Content": "Excelent product. It arrive on time.  It was a gift to my husband and He really enjoy his ipad. I got to him another tablet before and he use once and never again. With this one he use all the time.", "Date": "April 8, 2014"}, {"Title": "prefer a laptop", "Author": "Suzanne", "ReviewID": "R3CCWOZ6TS37VP", "Overall": "3.0", "Content": "I purchased an iPad as my friend was constantly using hers on her recent visit.  I always heard Apple products were so easy to use.  Probably because I never used Apple before and was accustomed to using Android, I found it difficult to use.  After weeks of reading the manual and trying to play around on my iPad, I tend to still pick up my Android laptop to check emails and search online rather than the iPad.", "Date": "April 8, 2014"}, {"Title": "Just as I expected, Fantastic.", "Author": "WillieArthur", "ReviewID": "R3UQ0BMIYZVCBH", "Overall": "5.0", "Content": "The iPad arrived on schedule, which is always a big plus for me when buying Online. I love the quality of the iPad Air, its brilliant, but I would like to see some features similar to Samsung devices, such as widgets, dual screen, etc. That said the quality of the iPad is just brilliant. .", "Date": "March 31, 2014"}, {"Title": "Wicked-FAST and super slick!", "Author": "conis", "ReviewID": "R1QD1ES422MPAX", "Overall": "5.0", "Content": "(Update below)Upgraded from an iPad 1 (aka an iPadosaur) If you are used to an older iPad, do your homework. Navigation is way different.BTW. If you are running on battery only and don't need location services, shut it off. Its a huge battery sucker.BTW#2: I almost bought a longer charge cable for this (newer lightning connect style) since the one that comes with it 4' is too short for the real world. Instead I spent $3.00 for a 6' USB extension cord to extend between the charge module and lightning cord. It works fine and will keep the battery at 100%  while I am working. IF location service is not activated.One gripe about the AIR seems to be reduced battery life. Shut off the services and features you don't need on all the time.(UPDATE 5/5/14)Been using the #5 air for over a month now... I LOVE IT! Theres a little learning curve moving up from iOS 5 to 7+, not an issue. I had no problem moving my \"stuff\" including apps, to the new iPad.... The finti cover, is sweet, too! Recommended!Next on line is an iPad mini (soon) and I'll elaborate a bit....I use a verizon mifi modem with my pads when I travel. (converts cell-wireless to wifi) Internet/email anywhere. Works great. In doing this, I have scrapped my cell phone and installed skype phone on my iPads... Flawless voip service, full feature with dedicated phone #... All for $6.00 a month a $.o2 a minute pay as I go. Compare that to the cost of a smartphone with data package! So saying, a mini will fit in my pocket as a large smartphone and serve all my needs on the road... IN MY POCKET...iPads are truly \"swiss army knife\" devices if you get the apps and set them up right. Most don't understand all the things an iPad can do.", "Date": "March 29, 2014"}, {"Title": "Hat loves air.", "Author": "Hat", "ReviewID": "R130P27TKDBGUG", "Overall": "4.0", "Content": "GreatVery good product.I bought it for my wife and she is enjoying it very much. I would recommend it.", "Date": "March 28, 2014"}, {"Title": "GREAT", "Author": "Daniel M. Heneghan", "ReviewID": "R1SO9HS21FNIMY", "Overall": "4.0", "Content": "Everything so far is just peachy keen new at this high tech stuff would recommend product LEARNING MORE EVERY DAY", "Date": "March 28, 2014"}, {"Title": "OMG LOVE LOVE", "Author": "Danielle Parks", "ReviewID": "R2FCEVLGIQ6RDJ", "Overall": "5.0", "Content": "This thing is unreal! so slick and sparkly!!! lol I love my new ipad air! it even has siri!! so rad!! ships fast too!", "Date": "March 27, 2014"}, {"Title": "Amazing", "Author": "Rodney Castro", "ReviewID": "R2Q98RN0IA8JEA", "Overall": "5.0", "Content": "I have never owned an ipad before but I really did my research to make sure if I really wanted the latest opacity or would I do with a cheaper older ipad.  The truth is this device is amazing!  When multitasking between games and browser and music this thing flies and I don't even notice any lags! Also the screen is so clear and high def thanks to its retina screen I believe? The ipad air responds to my every touch and swipe with ease and I'm only beginning to learn its many uses!  As a first time buyer who is price conscious,  I will say. This was the best purchase decision I made because for the price I spent,  I got a high performance ipad that beats all others with ease and with all its new features and compatibility with new and upcoming tech, I'm somewhat ready for it too! Other than all that. The ipad air is worth its price even if you are worried about price I say save the extra hundred dollars for this guy", "Date": "March 27, 2014"}, {"Title": "It's nice", "Author": "De cheng", "ReviewID": "R1R1P3XZRQA3C5", "Overall": "4.0", "Content": "I buy it for my friend, and she said it was very beautiful and love it so much, but it a little expensive", "Date": "March 27, 2014"}, {"Title": "Convenient", "Author": "Rachel Griffin", "ReviewID": "R1CHTFJI2R4MXE", "Overall": "4.0", "Content": "I like my Apple iPad Air.  This is my first iPad.  I enjoy the light weight convenience of being able to have it handy when I want to see or show how to craft video to my Mom and friends in other areas of my house.", "Date": "March 27, 2014"}, {"Title": "IPad Air !!!!!", "Author": "Alex Godino", "ReviewID": "RSO45VOPMU3W4", "Overall": "5.0", "Content": "Best tablet on the market right now ! And Great battery life ! Since Started using this ipad I don't use my computer anymore . So impressed !", "Date": "March 27, 2014"}, {"Title": "Great Tablet!", "Author": "Kiki", "ReviewID": "R38GNXWQVXN30Z", "Overall": "5.0", "Content": "Admittedly this is my first tablet, but so far it works great. I couldn't even tell it had been previously used.", "Date": "March 27, 2014"}, {"Title": "Great iPad.. Step up from other older versions", "Author": "bigbeezy209", "ReviewID": "R2E69RJV1RXYHP", "Overall": "5.0", "Content": "Love this iPad air.. It's so light & sleek that it's not a burden to carry around everywhere you want to go... Screen looks beautiful and build quality is just like every apple product.. A+", "Date": "March 18, 2014"}, {"Title": "excellent", "Author": "arthur", "ReviewID": "RRTKCTTR95PTK", "Overall": "2.0", "Content": "i like it and hope word could be used when I open the apple ipad air.in fact ,I can not find the difference between ipad 4 and ipad air", "Date": "March 18, 2014"}, {"Title": "had to buy charger", "Author": "robert bennett", "ReviewID": "RBLALTKNUFLOU", "Overall": "4.0", "Content": "Ipad is great! Charger was not. Would've given 5 stars but charger had short in it had to buy new charger.", "Date": "March 17, 2014"}, {"Title": "ipad mypad!", "Author": "Rita Runyon", "ReviewID": "R2OZSMS2AY9QU9", "Overall": "5.0", "Content": "I love it… I just haven't figured out how to use it… I can't get to the Apple store at the mall, for help, they do not have electric carts and I can't get inside without assistance. I have been using it to do some reading online and it's great! I sold a cherished antique to buy this and I'm so glad I did! I'll get this figured out.", "Date": "March 8, 2014"}, {"Title": "First tablet...it is awesome", "Author": "Sonya B Dean \"webrose\"", "ReviewID": "R37EBVPXPZC5I1", "Overall": "5.0", "Content": "this is my first tablet so take that info into consideration...I have an iphone 4 so was able to sync all my apps and contacts and everything else including music very easily.", "Date": "March 8, 2014"}, {"Title": "Tablet decision", "Author": "Kathy Bridges", "ReviewID": "R10NM0VW1A1TF2", "Overall": "5.0", "Content": "I debated which tablet to get for over a year, sitting on the fence, afraid to make a move. Finally, I decided that since I had an I-phone, this was probably the easiest move for me. I am so pleased, was up and going in about 5 minutes. Donating my nook to the 2 year old granddaughter today.", "Date": "March 8, 2014"}, {"Title": "The  best on the market", "Author": "Kathleen D.", "ReviewID": "R1DR1EZ8NHQO2J", "Overall": "5.0", "Content": "I really like my I pad it takes beautiful pictures. Plus we took it to the ice rink where my 5 and 7 year old granddaughters takeskating lessons. we took video's of them and they loved watching them. over and over.", "Date": "March 6, 2014"}, {"Title": "IPAD AIR", "Author": "Bishnu D Piya", "ReviewID": "R3GVHH63R8Z7R4", "Overall": "4.0", "Content": "awesome device much lighter and smaller thann the regular ipad's.Easy to handle. Much faster in processing than the old ipad's", "Date": "March 6, 2014"}, {"Title": "I-pad air 32 GB", "Author": "J. morford", "ReviewID": "R28Y58SFLRMTQB", "Overall": "5.0", "Content": "I love my new I-pad air!!!  Faster, lighter and perfect in every way!!!  love it!I would highly recommend. It!!", "Date": "March 6, 2014"}, {"Title": "in love", "Author": "Justin & Sarah P. \"Creature... For a while.\"", "ReviewID": "R90TN1B948FSF", "Overall": "5.0", "Content": "of course I am in love!  Came a day earlier than expected...it was like Christmas morning for me!  iPad is the way to go!", "Date": "March 6, 2014"}, {"Title": "it was a hit", "Author": "william murray", "ReviewID": "R2JA44776GQE3R", "Overall": "4.0", "Content": "The family loves the christmas gift .It works great.Its attractive ,light weight.Have not had cause to use my protection plan.But i bought it on amazon so i am sure its ok", "Date": "January 27, 2014"}, {"Title": "Very good!", "Author": "Robert", "ReviewID": "R2WEFFHJO218O0", "Overall": "4.0", "Content": "Great overall, super light w/ awesome display! Although the battery could be just a bit better. Still a great buy!", "Date": "January 24, 2014"}, {"Title": "This thing is amazing", "Author": "Claytonss", "ReviewID": "R1V4EI0ADNYXD2", "Overall": "5.0", "Content": "I got the iPad air today and its amazing I had a kindle fire and the iPad air is 50 times better apple has done it again.", "Date": "January 22, 2014"}, {"Title": "Easy to use!", "Author": "Teresa", "ReviewID": "RWPH3WR5X641P", "Overall": "5.0", "Content": "I am not a very tech savvy person, but this ipad air came highly recommended by a person that is. I asked this person what they thought about other tablets, such as Surface, or Android, which were a little less expensive, but he said this would be the easiest for me to \"figure out\"---and it has been. I mostly use it to google things, any where from educational to gossip tv shows and can find everything easily. Not only does it have \"Siri\", you dont even have to type to enter a post on facebook. You just use the microphone thats easily seen, and speak what ever you would normally type. I no im only at the tip of the iceberg with what it can do, but i learn new things everytime i pick it up. Not being able to sit at a computer for very long, Im able to take the ipad to bed with me & look up things easily while resting in bed. I no several people that have them and they all LOVE them---i now see why.", "Date": "January 21, 2014"}, {"Title": "Amazing!", "Author": "killercolors", "ReviewID": "R28S5QDODBOAFL", "Overall": "5.0", "Content": "Let me start out by saying that I am an android user that only recently decided to give apple a try. The only iPad I owned was the 1st generation iPad. Now, that alone wasn't enough to make me change from my android devices, but recently I decided (after seeing how thin this new one was) that I'd give apple another go. -- HOLY COW!!! Where has this tablet been all my life?The Apple iPad air is amazingly light weight, thin, beautiful and crazy fast! This just left my samsung galaxy in the dust with little to no effort involved. Now while I did not get the iPad air from amazon I bought it on eBay, still sealed in the box, brand new, for only $475. That alone was a steal in comparison to buying it on here or anywhere else. I also purchased an iPad air case from walmart so I didn't end up spending over $14 for the case.With that said, if you have a 1st or 2nd gen or are even just now thinking of getting on the apple bandwagon as I have, this is the one to do it with!", "Date": "January 20, 2014"}, {"Title": "Quick & painless", "Author": "kathleen miley", "ReviewID": "R3LMDZ34HOX8XP", "Overall": "5.0", "Content": "Arrived quickly and is a great product! A gift for Christmas for my son,  It's definetly being enjoyed - may. Have to get another.", "Date": "January 20, 2014"}, {"Title": "super", "Author": "Frank Hendrikx", "ReviewID": "R3PRHYSPLT3ODL", "Overall": "4.0", "Content": "quick, smooth, simple really a fantastic machine. only the battery is quite quicke emtpy, thats a pitty. for the rest fantastic", "Date": "January 19, 2014"}, {"Title": "Just what it's supposed to be", "Author": "mikeyyyownz", "ReviewID": "R29YQ94YM16KPM", "Overall": "5.0", "Content": "I bought this for my wife for Christmas. We have Verizon and I wanted an Ipad for her that was 4g, as well as to upgrade her from the  Ipad 2 she already had. The price was more than going through Verizon, but I needed it quick for Christmas, and I had Amazon gift cards so it came out cheaper for me in my situation.Anyways, I'm not going to go into detail about the Ipad Air. There are countless reviews online. I'm just writing this in case anyone is hesitant to purchase from this specific seller. I got the item quickly and didn't have any problems. The wife was able to connect it to our Verizon account and she uses it all the time.", "Date": "January 19, 2014"}, {"Title": "Good product.", "Author": "Foothill Ranch 14", "ReviewID": "R14KHENAP2N3UU", "Overall": "4.0", "Content": "Good product but not as mobile as I thought. I prefer my kindle to read but this to watch prime or Netflix on. Sometimes I feel like I have to use it to get my money's worth. But it's good for my family and I.", "Date": "January 18, 2014"}, {"Title": "A great product", "Author": "John R. Sitzman", "ReviewID": "R3GFOB7XNDFQQ1", "Overall": "5.0", "Content": "Actually light as air and very functional. The first Apple product I have owned but I will definitely buy more in the future.", "Date": "January 18, 2014"}, {"Title": "Crazy thin and light plus beautiful screen", "Author": "sgun73 \"Steve\"", "ReviewID": "RYT21QYXB65Q9", "Overall": "5.0", "Content": "I've had every generation of ipad and both minis and several androids and this tablet right here and now is the best ever made and my clear favorite. The thinness and lightness almost doesn't make sense. I did find myself confused at first as to how such an amazing device could be made by humans. Maybe it wasn't. Could have come from space. Or maybe the Enterprise from the future brought it back to Apple and said here. Enjoy.But seriously, the build quality is wonderful. As light and thin as this tablet is it still feels solid and sturdy. The screen is beautiful and the colors are deep and rich. The colors are actually noticeably better than the first and second generation minis. I've held them side by side and there is a pretty wide gap between the two in terms of richness of color. The ipad air looks vibrant and robust with deep blacks and warm bold colors.Plus it's very fast. I loaded up GT Racing 2 last night and it ran flawlessly fast and looked absolutely gorgeous. I couldn't believe how sharp the cars looked and the backgrounds had such depth. I should stop writing and go play right now.Despite the other great tablets like the Nexus 7 and 10 or the Samsung Galaxies 8 and 10 the ipad air is in another realm. A realm all to itself. You'll never pick up another tablet and be shocked at the miracle of design you hold in your hands.", "Date": "January 16, 2014"}, {"Title": "Happy", "Author": "Ben A. Holliday \"Ben\"", "ReviewID": "R2IHKIXHY3VJG7", "Overall": "5.0", "Content": "It was a gift to my wife and she loves it, so that makes it worth it. As much as she uses the iphone now she at it with the ipad. Shewatches TV and a movie on the iPad at the same time.", "Date": "January 15, 2014"}, {"Title": "Loved It!", "Author": "Ramon S. Reyes", "ReviewID": "R8GCU6Z8NYVVA", "Overall": "5.0", "Content": "This iPad Air was a gift for my wife and she continues to enjoy it immensely.  The unit is much lighter than her first generation iPad and the graphics are definitely better.  She can now use Facetime since this new unit has a camera, one that did not come with her original iPad.", "Date": "January 15, 2014"}, {"Title": "I love it", "Author": "Ana Sofia De Agrela", "ReviewID": "R1FGBOLGM6Y46Q", "Overall": "5.0", "Content": "The iPad air is the best iPad yet! If you buy it you won't regret it! Really love my new iPad :)", "Date": "January 15, 2014"}, {"Title": "Ipad Air", "Author": "Karen A. Stoner", "ReviewID": "R36A8QXU63KP5F", "Overall": "5.0", "Content": "So far can find NOTHING wrong (CON) about my new ipad Air!!! (PROS- It is smaller & definitely lighter and has some new features!I had previously purchased the Ipad 2nd Generation and was VERY \"happy\" with it! BUT in my very rushed world, I dropped and cracked the front screen...:-( Not knowing what to do, BUT knew I didn't want to be WITHOUT my ipad. (I take it almost everywhere I go.) So when someone asked what I wanted for Christmas, I told them! So now I have my travel ipad and my stay-at-home (Ipad Air).So now, I won't be without my Ipad...:-) I will update my review if the need arises.", "Date": "January 15, 2014"}, {"Title": "Hubby Loves IPAD!", "Author": "Pinkbubblegum4me", "ReviewID": "R1G6Y6OI019WZN", "Overall": "5.0", "Content": "Hubby, who is somewhat tech challenged, loves this! So easy to use and READ! Now I can use the desktop computer again!", "Date": "January 14, 2014"}, {"Title": "Smaller in a good way", "Author": "Aaron Smith", "ReviewID": "R3LQ2RMXC00BYM", "Overall": "4.0", "Content": "I have really big hands and I can palm this thing.  I truly like the smaller bezel around the edge.  That has always been wasted space in my mind.  I came off an iPad 2 and this one is significantly faster.  Text is significantly clearer on the retina type display.  A great design and works like a charm.", "Date": "January 14, 2014"}, {"Title": "Buy one", "Author": "bonniejean815", "ReviewID": "R1R2UWWI65O2LG", "Overall": "5.0", "Content": "Awesome iPad. Best ever yet. Fast. Beautiful display light and thin  Best ever  worth every penny. Battery lasts longer. Than earlier models", "Date": "January 14, 2014"}, {"Title": "Didn't think I needed one....till it was in my hand.", "Author": "Joe", "ReviewID": "R2NUVMMUSXTU0L", "Overall": "5.0", "Content": "Headline says it all. So ridiculously light and sleek. If you're trying to save a few pennies, maybe look at the Nexus 7 or Kindle HDX, but if you want the best, this is it.", "Date": "January 14, 2014"}, {"Title": "GET ONE, IF YOU HAVEN'T ALREADY", "Author": "Mr. T. Echeumuna", "ReviewID": "R3HUSUASDGJIQY", "Overall": "5.0", "Content": "I am so pleased with my iPad Air. It is unbelievably light for an item this size. You will not believe it. If you have had ones of the earlier iterations, then you will know what I am on about. But if not and you are looking for a tablet - money no object - then get this iPad, and  you won't regret it.Enough said!", "Date": "January 13, 2014"}, {"Title": "Wonderful,", "Author": "Mme Mildred Elliott \"Tony E\"", "ReviewID": "R2Y0BQ2MSAUH2Q", "Overall": "5.0", "Content": "I use the iPad for personal and business purposes. Whilst I am still learning just to operate this wonderful piece of equipment, I have already found many applications that will assist me  and shorten my completion of  my tasks.", "Date": "January 11, 2014"}, {"Title": "iPad Air - My Second iPad", "Author": "RPozzolano", "ReviewID": "R1UFZ8S87R4MDD", "Overall": "5.0", "Content": "Had my first iPad 16gb since it was first released and just ran out of space.  I never had a problem with it.  Love the updated iPad and retina display.  Would definitely recommend it.", "Date": "January 10, 2014"}, {"Title": "By far the best generation yet", "Author": "Chad K", "ReviewID": "R11Y9BKHIIZ2BD", "Overall": "5.0", "Content": "After finally getting the 3rd generation iPad as my first iPad because of the retina display, I felt the this 5th generation was the time to upgrade.  I am not disappointed in the slightest.  Compared to the older generations the iPad air is amazingly light.  Half a pound doesn't sound like much until you hold it for a long time and realize how much it can weigh on you.  If you're a lifelong apple fan or still skeptical about their products, the iPad air will give you the best apple currently has to offer.  While it's more evolutionary than revolutionary, there is no need to overhaul the iPad.  It is the premier product of the day.", "Date": "January 9, 2014"}, {"Title": "...thoughts on storage capacity", "Author": "GlevumGuy.", "ReviewID": "R2RROLA7BQ2I0M", "Overall": "5.0", "Content": "It's a marvelous device as other reviewers have noted though i would like to caution about storage capacity. Having read several on-line articles on 'what amount of storage' we opted for the 64 gb version but, after adding 10 apps such as weather, amazon, world clock, kindle, etc. no games, and about an hour of home movies this is already below 48. if we had purchased the 16gb version the storage would have been maxed out in less than two weeks. so given this experience, unless you are very diligent with downloading i would suggest purchasing double whatever storage capacity you have in mind (64 and below) as you may be using this iPad for years and an extra $100 spent now will amortize out to almost nothing.", "Date": "January 9, 2014"}, {"Title": "Apple iPad Air ideal gift for college business major", "Author": "MJH", "ReviewID": "R1SKJF51FR5WH0", "Overall": "5.0", "Content": "Our household is predominantly oriented towards \"pc\" computing.  However, I was compelled to purchase an Apple iPad Air for my daughter because of her academic needs at a major university.  Apple talk and the Business School has developed specialized work groups on campus with cloud-based content such as lecture notes, study guides and specialized apps.  Of course, the device also has many features to also keep a busy student entertained.  Battery life is amazing, and the device is small enough to be hauled almost everywhere.  Apple products are spendy, but the technology really is fairly impressive.  As usual, Amazon is the place to purchase with competitive pricing and quick shipping -- even during the holiday season.", "Date": "January 7, 2014"}, {"Title": "Love it!", "Author": "Erica Mazzarella \"Mom of two\"", "ReviewID": "RE1KMKSHLPQNJ", "Overall": "5.0", "Content": "Very easy to interchange all my pics, contacts, etc from iPhone and easy to hotspot off iPhone so I can use it anywhere. Love how light it is and easy to read on.", "Date": "January 3, 2014"}, {"Title": "Just as expected", "Author": "Lorranne M. Wheeler \"JustBeYou\"", "ReviewID": "RYLWRLJ6NIMMH", "Overall": "5.0", "Content": "It's an iPad! Came quick (amazon Prime is soo awesome) Exactly as expected. Recommend to use with Devicewear Ridge Slim Black Vegan Leather Case for the New iPad Air, Six Position Flip Stand and On/Off Switch", "Date": "January 3, 2014"}, {"Title": "great product.", "Author": "Jayson Pare", "ReviewID": "R1OP1KRVD9GZOE", "Overall": "5.0", "Content": "I bought this for my wife and she loves it. Easy to use for streaming music from our cloud network, surfing the net, & taking pictures. Our 5 & 8 year old kids use it over their nook and ipods to play games or watch Netflix.  It is great for the whole family.", "Date": "January 3, 2014"}, {"Title": "Apple Masterpiece", "Author": "Hardware4you", "ReviewID": "R37ZOXQ8H3ZKAA", "Overall": "5.0", "Content": "This Holiday season has been very frustrating for me.  I had to return a defective Kindle that I really wanted.  My wife has one and she loves it.  My kindle Fire HDX 8.9 inch had to be reset every day, got blank screens when playing games and I knew my download apps better than the cloud did!!!!Along came the Apple Air.  What a breath of fresh air.  So thin, so light.  The screen color is fantastic.  The movie quality is fantastic.  The large variety of Apple games, fantastic.  The battery life is much longer than most.  Just a top quality instrument.  If amazons customer service representative could have been a little nicer, I would have gotten another Kindle.The only con of the Apple is the price.  Apple Air 128 GB out of box is $799.00.  Almost two Kindles. Kindle had only a 64 GB.Is it worth it....you be the judge.  For me, I am keeping it.", "Date": "January 3, 2014"}, {"Title": "Apple iPad Air MD786LL/A", "Author": "Daniel", "ReviewID": "RBOVQXJI08P6V", "Overall": "5.0", "Content": "I bought this for my wife she loves the apple air it goes with her apple 5s and she still loves her kindle fire hd but she can do more with the apple, anyway she loves it and that makes me happy 5 Stars.", "Date": "January 2, 2014"}, {"Title": "Not Worth the Money", "Author": "Galen V.", "ReviewID": "R3OIN717XK4VME", "Overall": "2.0", "Content": "Let's face it, Apple produces highly polished products with a rich app ecosystem.  Many apps are optimized with animation and are even better on a larger screen, but....This device is not worth $500, its not worth $400, it probably should retail between $300 and 350, and here's why:*Locked in system. You have very little customization options. Yes, you can change wallpaper and move icons around the homescreen, but that's about it. No making the device an extension of your personality like Android.*Speakers. For being the most popular gadget on earth, why are there not stereo speakers on this device (one on each end of the tablet)? This is a serious design flaw that makes watching videos a huge drag because sound is muffled especially if the device is leaning on your lap.*Multitasking is a joke. These devices can only perform one task at a time. Apples competitors such as Samsung and Microsoft have already addressed this in their tablets, why hasn't Apple?*Screen Casting. This is not equipped with Miracast or have an HDMI out port. This means if you want to show your devices screen on a TV, you can't without buying a bunch of overpriced adaptors and cords.*Maps. Everybody knows that Apples map product is inaccurate and not worth installing.*No official keyboard, no official stylus, no ports, no casting, no multitasking, poor audio... why is this $500 again?", "Date": "February 22, 2014"}, {"Title": "Sadly, disappointed", "Author": "Amazon Customer", "ReviewID": "R32Z7VIF4FHKPG", "Overall": "3.0", "Content": "I bought an Ipad Air (32GB/cellular) the same day they came out. Up until then, I had never owned an Apple product. I have always had Windows pc’s and I have an Android phone (Galaxy S4).I read that people just love the iPad’s and thought it would be time to try out an Apple product. I bought it from T-Mobile to get their free data promotion. Now that I’ve had one for about 3 months my overall opinion is “meh”. It’s ok.I don’t hate it. It’s light & portable. It’s great for watching movies and listening to music. However, there are limitations that make me wonder why the devices are so popular. For example, Swype doesn’t work on iPad’s and if you’ve ever used Swype on an Android device you know it’s a great feature but one I consider very basic. True multi-tasking doesn’t exist and you just don’t realize how much you’ll miss it until you don’t have it. You can’t print, for example, pages 1,3,&10 of a pdf. Instead, you can only choose a range, such as 1 thru 3. I still remember one of my first calls to Applecare+, where some young woman explained to me that you can’t do a search in a pdf. She actually suggested that I add hundreds of doctors that were in the pdf to my contact list so that I could then find individual doctors. I quickly ended that call. The Apple browser, Safari, is slow. Chrome, on the other hand, is fast. These are only small examples but in general, the iPad seems to be much less flexible than my Window’s computers or Android phone.As an aside, the support on Applecare+ varies widely. I have been connected to people that seem knowledgeable but have also had plenty of people that knew less about the iPad then I did, even after only 1 months use. Many of the young women referred to my iPad as an IPhone and didn’t have a clue how to help me.They are also expensive. I bought the 32GB version and thought it was a rip off to pay $100 for the extra 16GB.Now, my iPad Air is 3 months old and needs to be exchanged under warranty. After 10 minutes of use it can’t access the web anymore. Regardless of whether you use a browser or an app. They had me reset it back to the factory default but it didn’t fix the problem. It's stayed in a case and never left the house. It's been babied. I’ve never had any device fail after only 3 months use.I really wanted to love this device and thought I would based on other people’s feedback. It just hasn’t worked out for me though. It’s adequate, but not great, and hasn’t lived up to my expectations.", "Date": "February 8, 2014"}, {"Title": "Don't plan on enjoying you headphones..if you enjoy music.", "Author": "Gery", "ReviewID": "R124IJA0MRHZN6", "Overall": "2.0", "Content": "Air pad problems....I have 2 iPhones, iPad 3 gen, new air pad.  I have a big problem with the new air pad.  And I have been a big fan of apple products.  If your like me, in the evenings I sit and read and listen to music on my iPad. But,, If you want to listen using ear buds or any headphones, don't get this air pad.  You only hear sound thru the right ear only.  If you fiddle you can get it to work, for the moment, till you touch the plug it will go back to one ear.  I pd $79.00 to get apple care.  So I called, he sent me another Air Pad, it's doesn't work either.  So now, since I got two that don't work, I think they think I'm nuts.  I have apple ear buds, klipsch, Bowers Wilkins, ATH m50s headphones.  All of these work perfectly with my IPhone 4S.  I just can't figure it out, and I'm Very disappointed with the new Air Pad.", "Date": "March 5, 2014"}, {"Title": "Disappointing", "Author": "Girevik", "ReviewID": "R1ODVR2EOT8QQ1", "Overall": "2.0", "Content": "I guess I was just expecting something a little faster, more competent. Up swipes are confused as side swipes, sometimes you'll have to tap the same spot five or six times to get a response, even if the icon is highlighting every time you push, the function doesn't happen. You can't place your cursor into the middle of a paragraph you just wrote if you want to edit, this mostly occurs in aps but come on, I have to delete everything to where I want to edit. Often, the iPad will randomly open Facebook or Twitter, because it thinks I touched the tiny icon on the corner of a web page or ap, when my finger was on something an inch away. Just writing this review, it corrected finger to ginger and when I tried to move the cursor to the word to edit, it randomly pasted a website URL from my clipboard where I had touched. I then deleted the unwanted erroneous URL, tried again, and it pasted the URL a second time... Delete. Try again. Maybe this thing is good for games and kids, but don't try to do mobile business on it unless you have the patience of a monk.PeterIt's the little things that kill, two stars.", "Date": "May 26, 2014"}, {"Title": "Not worth the upgrade for me", "Author": "Jose J. De Cruz \"Joseph\"", "ReviewID": "R35O799HV2E0NL", "Overall": "3.0", "Content": "Three stars only because this iteration has a better volume and is slightly(almost unnoticeably)lighter. I think ipad 3 and 4 have a better quality built and their retina display is much brighter and colors are deeper than Ipad Air.", "Date": "March 21, 2014"}, {"Title": "Super Thin & Perfect for Me!", "Author": "J. Ferris \"tunawish\"", "ReviewID": "R21T328ZNCRSWK", "Overall": "5.0", "Content": "I made the switch from Windows to Mac about 2 years ago & loved the MacBook Pro while I only liked the older iPad mainly due to the fact it only had 16gb onboard & no memory card slot (it also slowed down noticeably with iOs 6.)I traded my MacBook Pro & old iPad for a new MacBook Air & a 64gb iPad Air & now I love my MacBook AND my iPad.Apple has now made iWorks (Pages, Numbers & Keynote) free with new devices & I've almost cut the Microsoft tether completely (hooray!)The iPad Air is lighter, faster & has a longer lasting battery & a bright, crisp display.All this in a sturdy yet stylish tablet (no cheap plastic here.)I don't know why anyone would want a Samsung or Microsoft tablet (unless they are forced to shop for a cheap alternative of course.)Call me a fanatic if you want but there is no substitute for the quality & ease of use of an Apple product...", "Date": "February 25, 2014"}, {"Title": "Color me impressed", "Author": "J.Page", "ReviewID": "RMP67WLYRCB8E", "Overall": "5.0", "Content": "I was going back and forth over which tablet to purchase for about 3.5 weeks.  I was a previous Iphone user that moved on to Android because I didnt like the size of the 5.  I have two kids so consumer level usability is high on my list especially with a son that has autism.My choice came down to a samsung or the ipad since the nexus 10 2 is still MIA. :)  The samsung had several things going for it.  MicroSD, customization and control, mutliple user profiles but to be honest their overlay is a huge turn off and the plether backing with fake stitching just looks horrid.  I would say that the plastics are fine but why bother with fake stitching? I spent time in a B&M; and the feel was good, but visually as a whole it felt less...high end even with the price being in the same range as the IPad.  With several cloud storage options and knowing that I would be using it for light work related items and sharing it with my kids to some extent the MicroSD while nice was not compelling.  I do wish apple would realize that multiple user accounts would be helpful because that is one of the things that almost moved me to the samsung.  Both screens of course are amazing and I have to give it to the samsung on using a better aspect ratio for media, but the samsung felt klugy when trying to use it in portrait.  So with all this being debated in my head for a few weeks back and forth I decided on the IPad.  As an aside, I love the build quality and would have seriously considers a Kindle Fire HDX but the lack of the google play store put it out of contention.  It is one thing to have a walled garden like apple where just about any app you can think of is available, but it is quite another to have a walled garden like Amazon where you either have to root or sideload to simply get some basic useful apps.  If the Kindle Fire HDX had google play store, this might have been an entirely different review. :)Two things have stood out as I have delved back into the walled garden that is Apple...One, It may be a walled garden, but it is a gorgeous garden.  The app quality and availability is outstanding. If they allowed Google Play Music I would not have any issues at all with the app store.  I think that the tighter development control that apple institutes on its apps is a double edged sword in some respects but I have not had anywhere near the amount of bugs that I find in the android store apps so in that respect I appreciate that 98.7% of the time when I download an app it just works.  I use it with several google services including chromecast and have been very happy with the results. On a side note, the hardware and build quality is meticulous and the IPad itself is even more impressive after prolonged use, but that has been discussed and beaten like the proverbial dead horse.Two, battery life.  Apple seems to know how to eek out the battery life with more finesse than some competitors.Overall I like the IPad Air much more than I thought I would.  I bought it knowing from a techie nerd stand point what I was giving up with the ecosystem and I have had no regrets at this point.  I can use it for work emails and presentations and come home to play netflix or games with the kids.  An outstanding product that I am sure I will use for the next year or two without issue.And my non-verbal autistic son can run this thing like a beast ;)", "Date": "February 15, 2014"}, {"Title": "Absolutely stunning", "Author": "grittynitty", "ReviewID": "R1KA2I41NUYYUG", "Overall": "5.0", "Content": "Finally got a good chunk of cash when my tax return came and decided to get my own iPad (family had an iPad 2 but surely couldn't call it my own). I couldn't be happier. This thing is so well made and noticeably lighter and sturdier than the iPad 2. Very easy to set up as well.I recommend spending a little extra to get more memory. App sizes are just going to get bigger as time goes on. It just didn't make sense to me to pay so much for only 16 GB; I got the 64 GB myself and feel this iPad should serve me well for at least the next three years.", "Date": "February 15, 2014"}, {"Title": "iPad Air..works great, fast, but expensive!", "Author": "Charlie W.", "ReviewID": "R5MQPTZF3DW6N", "Overall": "4.0", "Content": "he iPad Air is a LOT lighter than the iPad 4, much faster (mostly play games on mine) and is solidly built. It's just expensive. All the games that had framerate issues on the 4 play smooth as silk now. Sound has improved as well. Also, the camera has improved. I took some really great photos of a storm that passed through, as well as some video.", "Date": "February 1, 2014"}, {"Title": "Apple products are the best", "Author": "Linda Childs", "ReviewID": "R3FWKY8A5U2QXJ", "Overall": "5.0", "Content": "What I don't understand is, I'm working for the U.S. Navy in Yokosuka, Japan.  You sent this iPad to me at our P.O. Box here.  However, when I went back to Amazon and tried to order a case for it, I received a message that said you could not send computers overseas.  Really?  I just wanted to buy the case and you had already sent the iPad.  Kind of strange don't you think?", "Date": "January 31, 2014"}, {"Title": "Great. Tablet", "Author": "chuck", "ReviewID": "R1XOTGWQZRZHZ3", "Overall": "5.0", "Content": "I hardly use my lap top now, iPad Air is just that good. Charges fast and then it just runs all day. so easy to learn and use", "Date": "June 6, 2014"}, {"Title": "Hands down one of the greatest devices I have ever owned/used", "Author": "Sara J Ellis", "ReviewID": "R2RREOGXYQEBGG", "Overall": "5.0", "Content": "I absolutely love my iPad. For years I was annoyed by the hype of it all, but finally decided to get one. WOW, is it everything and more!  I'm even not a mac person, but Apple certainly knows what they're doing. I use this for work and fun. It has movies, music, games, as well as Microsoft Office, DropBox, and my multiple email accounts. I think it is IMPORTANT to note that I am returning the one I just purchased, but only because 32 GB was NOT BIG ENOUGH. If you are a casual user, 32 GB is fine. I use it for work and family, though, and within 5 days (after downloading all my necessary work-related apps and then a few games) that I was 10GB down out of 32 (which is actually only 27 because the operating system uses the first 5GB). If you want this for entertainment or actual work, get the 64!", "Date": "June 6, 2014"}, {"Title": "Apple iPad Air MD785LL/A (16GB, Wi-Fi, Black with Space Gray) NEWEST...", "Author": "GFxRocket", "ReviewID": "R1GPOFPMKIGHG6", "Overall": "5.0", "Content": "This product met all my needsMy wife wanted itI gave it to herShe now doesn't irritate me about itProblem solvedIf you find yourself in the same situation, believe me...  You NEED to do it for your own peace of mind", "Date": "June 5, 2014"}, {"Title": "My Wife Love This IPad Air!!", "Author": "Mr. Edward T. Asato", "ReviewID": "R1JANDHJ506A7F", "Overall": "5.0", "Content": "I bought The IPad Air with 16 GB. I am Happy to say she has learn to use this  IPad on her own. The 16GB has been adequate for her application.etak.", "Date": "June 5, 2014"}, {"Title": "ipad air", "Author": "Dan Zhang", "ReviewID": "R1GHRBGKAGRVWZ", "Overall": "5.0", "Content": "Very nice ipad like my other ipad air, so far it working well and I hope it can keep going. Thanks the seller.", "Date": "June 4, 2014"}, {"Title": "First tablet and love it", "Author": "Carolyn Stewart", "ReviewID": "R2D9KE8TBV3M52", "Overall": "4.0", "Content": "This is my first purchase of a tablet and and am very happy with it.  Several people recommended this iPad so that's why I chose it.", "Date": "June 4, 2014"}, {"Title": "5 stars", "Author": "paramvir", "ReviewID": "R3JZ2TBD5K3C9O", "Overall": "5.0", "Content": "best tablet in the market. good interface and light  weight and long battery life. good work apple keep it up", "Date": "June 4, 2014"}, {"Title": "Very Nice", "Author": "John", "ReviewID": "R3HQ0V6NA4N2D8", "Overall": "5.0", "Content": "I have both an ipad and a mini and bought the Air for my wife.  It's slim, light and the clarity is excellent.  Very happy with the unit so far.", "Date": "June 3, 2014"}, {"Title": "Happy Customer", "Author": "D. Holland \"artist\"", "ReviewID": "RRSPFDYYTIGI2", "Overall": "5.0", "Content": "I've had my new iPad for two days; and so far I love it. I am having to learn some features that I'm not used to as I have always used Windows; but in general, this device is easy to use. All in all, it's an amazing step up in it's technology. I'm now an Apple fan after many years of resistance.", "Date": "June 3, 2014"}, {"Title": "Apple", "Author": "Silvia", "ReviewID": "R1YCWG6FVI6KZK", "Overall": "4.0", "Content": "The exceptional engineering continues by Apple. The new iPad is so light and fast with brilliant picture quality that I watched most of the March Madness on it when I wasn't near a good sports bar. Very fast, love the apple apps", "Date": "June 3, 2014"}, {"Title": "Great Product", "Author": "Robert Dunn", "ReviewID": "R27G0OE8HG1XZU", "Overall": "5.0", "Content": "This is a very good product - very versatile and an excellent buy.I will purchase another in the near future", "Date": "May 20, 2014"}, {"Title": "Love it", "Author": "CB", "ReviewID": "R26XX0MX1GF0F7", "Overall": "5.0", "Content": "Love it,feels heaver then 1 lb with the otter box I put on it , so I can't hold it that long,but all in all best apple device I have ever owned.", "Date": "May 20, 2014"}, {"Title": "Gift for my daughter", "Author": "Liv Torkildsen", "ReviewID": "RBHOHOHI04B4H", "Overall": "5.0", "Content": "I am taking it with me to Europe, so she will set it up herself.  As far as I can hope it works fine", "Date": "May 20, 2014"}, {"Title": "Apple iPad Air consistent to reputation", "Author": "ronald williams", "ReviewID": "R3KCIF97J0WLU5", "Overall": "5.0", "Content": "This device meets the expectations of performance and easy functional use. As technology development continues, I see less and less nuecense of previous flaws", "Date": "May 19, 2014"}, {"Title": "it's Very nice, it's for musicians, it's Apple", "Author": "tomana", "ReviewID": "R134R9TEH73W0U", "Overall": "5.0", "Content": "if you are a musician and want a device like this for sheet music on stage, then this is the one for you. Buy this and also the AirTurn pedals (get the 4 pedal if you can afford it), download the Free app called OnSong and you're on your way to sheet music turning goodness {8^D", "Date": "May 19, 2014"}, {"Title": "Great Replacement for Laptop When Traveling", "Author": "David S. Thompson", "ReviewID": "R1RE2L6L3Q4B1M", "Overall": "5.0", "Content": "Bought the iPad Air to use when traveling.  It is just what I need.  It weighs about 1.75 lbs. with the case and battery charger.  The screen is wonderfully sharp.  I does all the things I needs and more and it is fast.  I find that I use it often browse the web and check emails at home.  So far I am very happy with it and would recommend it.", "Date": "May 18, 2014"}, {"Title": "Best tablet hands down", "Author": "amr88", "ReviewID": "RPB7NDR51QHAB", "Overall": "5.0", "Content": "Over the last few years I have used a variety of tablets from the Samsung Galaxy, Samsung Note, Kindle, Nexus 10, Nexus 7, and now the iPad Air. The iPad is my favorite by far.Great screen resolution. The battery life on par or better than other tablets but really excels in stand by time.There are so many great applications made specifically for the iPad. The other tablets just don't come close to this.Some enjoy on screen buttons buttons on Android tablets but I find myself accidentally hitting one of the buttons. The iPad has gestures to easily navigate the device.The best on screen keyboard of any tablet. Far more accurate.Endless selection of accessories.We'll worth the money.", "Date": "May 18, 2014"}, {"Title": "Ipad air", "Author": "mike teeple", "ReviewID": "R2EVLPIWLSGEUZ", "Overall": "5.0", "Content": "I ordered for my 10 yr old grandson for his birthday. It came exactly as promised, both on time and what we ordered. Thanks", "Date": "May 18, 2014"}, {"Title": "Love the smaller size", "Author": "ALICE P. SMALLEY", "ReviewID": "R2X2ADLWPKX7E1", "Overall": "5.0", "Content": "I have another ipad and wanted a smaller one.  I find this one easier to travel with.  It fits in my large tote bag that I use for travel.", "Date": "May 18, 2014"}, {"Title": "Sleek and fast.", "Author": "djbrian", "ReviewID": "R68ZW8BWYHDJR", "Overall": "5.0", "Content": "This is a great tablet. Very fast. I would encourage anyone considering a tablet to purchase this one. You won't be disappointed.", "Date": "May 18, 2014"}, {"Title": "Great device!", "Author": "Malgorzata", "ReviewID": "R7CNGQRFEIC1G", "Overall": "5.0", "Content": "Everythin's fine, great features. Works perfectly. I'm totally happy. Recommend to everyone, but next time I'd choose 32GB version. Thanks", "Date": "May 18, 2014"}, {"Title": "Beautiful Display:", "Author": "Nick Basile", "ReviewID": "RMKVQ5SQKLXUI", "Overall": "5.0", "Content": "I just bought this as a step up from the original iPad.  What an amazing difference in the display with the new retina display.  Also it is considerably faster and lighter.  Great product!", "Date": "May 18, 2014"}, {"Title": "IPAD AIR", "Author": "Starmacs", "ReviewID": "R3C9DJWI6XU8I2", "Overall": "5.0", "Content": "WHAT CAN I SAY,  THIS IS THE BEST PAD YET,,VERY LIGHT. I UNDERSTAND WHY THEY CALL IT AIR...FAST WITH THE I7 CHIP AND EASY TO USE..", "Date": "May 18, 2014"}, {"Title": "iPad Air - makes my iPhone 5S seem heavy", "Author": "Mark Hilliard", "ReviewID": "R3N4N2DBHQIO2P", "Overall": "5.0", "Content": "I had an iPad \"1\" and wow this is a serious improvement.  It is is light that it makes my iPhone 5S seem heavy.", "Date": "May 17, 2014"}, {"Title": "Fast delivery", "Author": "Trung Tran", "ReviewID": "ROHKW8REH0AFL", "Overall": "5.0", "Content": "Great product as expectedLike the white colorDon't mind the smaller capacityWifi works great for me and easy", "Date": "May 17, 2014"}, {"Title": "Very nice. No regret.", "Author": "Kuli", "ReviewID": "R1XWL8QT4LNDMJ", "Overall": "5.0", "Content": "This was a birthday present for my daughter.OMG this is very light. She uses it to taking a notebook at school. (i hope)She seems to enjoy a lot. So I have no regret to spend this.", "Date": "May 16, 2014"}, {"Title": "AMAZINGG!!!!!!!!", "Author": "Rosa Sanfilippo", "ReviewID": "R296C2DEWI3X43", "Overall": "5.0", "Content": "this is a wonderful product its like a having a mac book that you can carry around everywhere i recommend this product", "Date": "May 16, 2014"}, {"Title": "Light and Fast", "Author": "Ben", "ReviewID": "R30PJH465ED8YV", "Overall": "5.0", "Content": "I love my iPad. I fully acknowledge that I am a bit of an Apple loyalist at this point. Much of that is due to the quality of the products, but much of it is also tied to the way that all of the manufacturers force loyalty to a degree. All of my Apple products work seemlesly together. I might have went with a Samsung or Kindle for my tablet, but that would have meant not having access to apps and content that I had previously from my iPhone, etc. Oh well. It's been a great product, and I have no regrets. I was also able to use the Amazon Trade-in program to exchange some old tech items to help get some Amazon credit that I was able to apply towards the purchase. Every little bit helps.", "Date": "May 16, 2014"}, {"Title": "impressed", "Author": "Steven Fuchs \"steve fox\"", "ReviewID": "R1ISF3AN2LPPM8", "Overall": "5.0", "Content": "very impressed. Light and what I expected in size.  I use it for my small business needs but now I don't need a laptop, yes.", "Date": "May 15, 2014"}, {"Title": "I'm loving this thing !", "Author": "NWP", "ReviewID": "R3FBJGDWM3YU7M", "Overall": "5.0", "Content": "I'm old school so I'm amazed at what this thing can do ! I'm learning new things every day and it just keeps getting better . I really like the music apps -Pandora - you can pick all of the types of music that you like to hear and it's free ! ! . I bought the Motown' s no.1's - it's great - only about 50 cents a song - cheap enough ! !  . I'm probably going to have to buy my wife  one now .", "Date": "May 13, 2014"}, {"Title": "Enjoying", "Author": "fma", "ReviewID": "R2WMX3H84SOFF1", "Overall": "5.0", "Content": "Like it very muchHave not used my desk top since I got thisResearched it for a year then I decided to get this one without cellular dataI'm using it only where I get wifi and save some moneyGo with a bigger memoryThanks", "Date": "May 9, 2014"}, {"Title": "Just as I expected!", "Author": "LadyLaTweet", "ReviewID": "RNJS72OGAM6R4", "Overall": "5.0", "Content": "All I can say is FANTABULOUS!!! I thought my Kindle Fire was great - this is even better-faster, more options, just love it!", "Date": "May 9, 2014"}, {"Title": "Great Product", "Author": "Dave Calabro", "ReviewID": "R307HZW53QL9A3", "Overall": "5.0", "Content": "So far it has been great. The only thing I struggle with is the back button doesn't always take you back one screen.", "Date": "May 8, 2014"}, {"Title": "Amazing tablet, everything it does it does extremely well", "Author": "MuEl", "ReviewID": "R3MJX4RPF3EILS", "Overall": "5.0", "Content": "This tablet is extremely light from a very robust, and runs all my favorite games and apps really quickly. 128GB is exactly what I needed. The T-Mobile connection is awesome! Free 200MB FTW!", "Date": "May 7, 2014"}, {"Title": "Like this", "Author": "Marigold", "ReviewID": "R6I9T3FBY1PE", "Overall": "4.0", "Content": "It has great clarity in the screen.  Like all MAC products its easy to use and leads you through setting it up.", "Date": "May 7, 2014"}, {"Title": "Love the iPad air", "Author": "Nigel Ouk", "ReviewID": "R1L50IKLD7RDEK", "Overall": "5.0", "Content": "Love the new iPad air. It's light, love the feel of the aluminum back, awesome retina display and super thin. Everything about this is great and when you add the ecosystem of the app store, this is the best tablet out there.", "Date": "May 7, 2014"}, {"Title": "Enjoy this every day", "Author": "Pat Powers", "ReviewID": "R2PJO5NBIDMO87", "Overall": "5.0", "Content": "This is my fourth iPad, and my favorite. It is very light, fast and the picture is lovely. Great upgrade.", "Date": "May 7, 2014"}, {"Title": "I love it", "Author": "Susan McCollister", "ReviewID": "R1HOHFILV35JAK", "Overall": "5.0", "Content": "I love my new iPad!", "Date": "May 7, 2014"}, {"Title": "I'm not an i-guy, but my 10 yr old loves it...", "Author": "KT", "ReviewID": "RUD00NRQDZ284", "Overall": "5.0", "Content": "I am not an Apple loyalist, I much preferred Windows (before Windows 8 came out anyway), and droid over the i-phone.  Even now, I get annoyed at some Apple-isms, the way Apple does some things, and try to stay away from it for the most part.  But I do believe it's typically more stable than it's technological counterparts, and easier to use for newbies.  Which is why we bought an IPAD 2 for our 8 yr old a couple years ago.  He took to it right away, it's intuitive enough.  There have been some slight issues, but it's still going strong.  Now 10, we just bought him this IPAD AIR... his 2 yr old brother gets the \"old\" IPAD 2.  And yes, the IPAD is intuitive enough for even a 2 yr old!  The screen on the AIR is so much better, clearer, sharper, and not just because it's \"new\".  Its resolution is just that much better.  Bought a cheap full body case until I could find a better one... trying to decide between the Otterbox (love the protection, not so much the hard cover design and that it doubles as a stand)... the Griffin Survivor (flimsy stand, landscape mode only)... or the Pelican Vault (no integrated screen protector, but I can put a protector on, and it is rated against water splash)... Lifeproof too expensive for what it offers... The 16G in the IPAD 2 was ultimately not enough after a year or so of use... Even with no \"movies\" or \"music\", games are much larger now, a few big games, and there is little left in a 16G device.  Without removing games, we didn't have enough memory left to upgrade the OS... so we opted for 64G this time... Though not an Apple fan, my 2 sons love them, I seldom have to \"fix\" anything with them, and so I rate it 5-stars!", "Date": "May 7, 2014"}, {"Title": "very happy", "Author": "charles a. winthrop", "ReviewID": "R20V3OWBNO61S9", "Overall": "5.0", "Content": "my wife loves it she likes it more than her ipad one. She says it is clearer and lighter and easier to use.", "Date": "May 6, 2014"}, {"Title": "Love my Apple IPad Air", "Author": "Mark Pfotenhauer", "ReviewID": "RUHEXM56JNBBE", "Overall": "5.0", "Content": "Love it! Fits my needs perfectly! Highly recommended. Fast, graphics are really crisp. Light weight, fits in my hand nicely.", "Date": "May 2, 2014"}, {"Title": "Great iPad Air", "Author": "R. Kattman", "ReviewID": "R1M4IOOIIMCFF9", "Overall": "5.0", "Content": "I love my iPad Air.  It replaces my iPod 4.  It meets all of expectations.  Only sorry that I did not purchase it sooner.", "Date": "May 2, 2014"}, {"Title": "Shipping was fast and product is great.", "Author": "andrew", "ReviewID": "RMEVTIQRIBBSS", "Overall": "5.0", "Content": "Shipping was fast and product is great. My only complaint is that I wish I had access to a terminal so that I could hack together some python code in my spare time.", "Date": "May 2, 2014"}, {"Title": "Apple is slipping in the software department", "Author": "John S. Ruzicka \"John R\"", "ReviewID": "R3LUGV013TXIQ2", "Overall": "3.0", "Content": "I was excited to replace my old iPad with the newest version. The Air has some big improvements. It's smaller (with the same screen size) and faster and can run multiple apps at the same time.The bummer for me is that ios7 feels like it is unfinished and that it wasn't sufficiently tested. First off, Safari crashes ALL THE TIME. I've only had one or two crashes on my old iPad so this took some getting used to. Secondly, there is the \"white screen of death\" where the iPad will just reboot itself for no apparent reason. Again, Apple products just don't behave this way so this was a huge disappointment. Finally, it is long past time that iOS add a real file system for saving files and sharing them between apps. Yes, the cloud works OK and Dropbox has become the de-facto standard for those who don't want to use Apple Cloud but come on, it's way past time for a file system.", "Date": "May 2, 2014"}, {"Title": "Apple iPad", "Author": "Chari", "ReviewID": "RT1IGBIH3YBP3", "Overall": "5.0", "Content": "Received this item on time, boxed securely and works wonderful.  Set it up to match my iPhone accounts and is working great!  Just need a cover for it now.", "Date": "May 2, 2014"}, {"Title": "Worth the price", "Author": "Curt", "ReviewID": "R1N9CVZX6UAJ58", "Overall": "5.0", "Content": "This is my first Apple device and I have to say I'm loving it. I use it for a small business and it has all the apps I need. I love the size of the device - large screen yet the tablet is nice and thin and light. The case that I got for it adds a very minor amount of bulk. As a new Apple user I was impressed by how easy the interface is to use. Since I have to store a lot of photos for my business, I purchased the 32gb model and I'm glad I did. Even though I store most of my stuff on a cloud app, I'm glad I don't have to worry about filling up my tablet.PROS:GREAT battery life. I literally had this on for 3 days straight during a convention and it was used constantly - just barely made it down to 20% battery by the end of the 3 days. Charges back up fairly fast tooScreen size is big but not too big, tablet is lightweight and thinEverything runs fast and smoothCONS:Cord of the charger it came with is very short (just a minor gripe, but still!)Screen gets dirty easily and I haven't found a decent screen protector yet (another minor gripe)Safari, the default browser, sucks. Install something else! I recommend chrome or firefoxI know the ipad air is pricey, but I found this to be much better and easier to use than my laptop, which I have now given to my fiance for his use. Definitely recommend it!", "Date": "May 1, 2014"}, {"Title": "gift", "Author": "diane sharp", "ReviewID": "R2BA1OTCJJL3Q2", "Overall": "5.0", "Content": "I gave this to my sweetheart who is a computer engineer and not much for gadgets. However, he uses the pad downstairs in his home and for vacations. He has more mobility, gets to check mail and learned to write mail. The color resolution is great. His only complaint is that the apps are nothing like having a full on software program. Of course, any sensitive accounts are not on the pad. He thanks me all the time and thinks I should have one also.", "Date": "May 1, 2014"}, {"Title": "Solid", "Author": "paul cameron", "ReviewID": "R3Q3B0ZSR26ZK2", "Overall": "5.0", "Content": "Very fast and reliable.  Everything I wanted in a tablet device.  It serves me we'll for my work environment needs.", "Date": "April 30, 2014"}, {"Title": "Apple delivers !!", "Author": "Kate G", "ReviewID": "R2ZSJZQM86H3PK", "Overall": "5.0", "Content": "As expected in excellence and workmanship!  Apple always delivers a superior product!  It is amazing and the I would recommend!", "Date": "April 30, 2014"}, {"Title": "Top of the line tablet computer", "Author": "K. Parsley \"kindlekat\"", "ReviewID": "R3E2TUJTO4DL1B", "Overall": "5.0", "Content": "I just upgraded to the iPad Air from an iPad 2. Not only is it noticeably lighter, the display is super sharp with crisp, clear colors, and the processor is lightning fast. I couldn't be more pleased. If you are on the fence, just get it. You won't be sorry. Top of the line quality and excellence.", "Date": "April 29, 2014"}, {"Title": "Great", "Author": "Vernon \"Vernon\"", "ReviewID": "RUU0XD286OE0N", "Overall": "5.0", "Content": "Just what I needed. Upgrading from the first I Pad, so the difference in speed, picture quality and a camera is a big deal to me. I have big hands so I was kind of worried because the Air is lighter. But everything is as I expected...", "Date": "April 26, 2014"}, {"Title": "Great tablet for me for browsing and reading", "Author": "R. Murphy", "ReviewID": "R31ZCWHMB357TV", "Overall": "5.0", "Content": "I am enjoying the iPad immensely. Great for reading when chilling on the couch. Light weight and iBook has contrast options to make reading easy on the eyes. Love it. Can't wait to get me a MacBook Pro.", "Date": "April 26, 2014"}, {"Title": "Cewlll cewll cewlll", "Author": "Sabrina Powder Puff \"Sabrina\"", "ReviewID": "R3MQO7FS7RJG12", "Overall": "4.0", "Content": "I liked this very much, and I liked Siri a lot, she was sort of like my new, cool robot BFF. I miss you, bech! Anyway, I had to return it because I'm a musician and I actually needed an old-school mac with a CD drive for a lot of boring reasons involving the studio. Also, because of classic mac usage, and programming, blah blah blah I won't bore you. I needed an Old School Mac Daddy. However, I enjoyed my brief fling with this Hot New Number- but he wasn't the Stable and Dependable Old Skool Mac I needed. He wasn't Fully Loaded.This Mac is more if you're into a fun, wild, whoop-de-doo, fly by the seat of your pants kind of thing, and don't need all the bells and whistles.But I'm not that girl. I needed more.", "Date": "April 25, 2014"}, {"Title": "Very Good", "Author": "XM L", "ReviewID": "R2YBLBZUGGGSRZ", "Overall": "5.0", "Content": "good quality, cheap price and fast delivery!  Quite happy with this purchase. Use it everyday. It is light in hand and the battery lasts long", "Date": "April 25, 2014"}, {"Title": "Like it bunches!", "Author": "DILLY", "ReviewID": "RUWTRPEHXG7NO", "Overall": "5.0", "Content": "I don't know what to say except I wish I would have got it sooner! I really do like it and use it a lot.", "Date": "April 25, 2014"}, {"Title": "Great Buy!", "Author": "Ronald W. Boucher", "ReviewID": "R11E1B72894DRP", "Overall": "5.0", "Content": "the best tablet on the market.  Go AppleCannot say anything but I would buy another if I needed one.", "Date": "April 25, 2014"}, {"Title": "just to protect my new ipad", "Author": "rockalot \"Sabsanders\"", "ReviewID": "R3N02Q59ZO0BNX", "Overall": "5.0", "Content": "I have a puppy who loves to try to use my ipad, so I knew I needed protection.  This is  a great cover.", "Date": "April 24, 2014"}, {"Title": "The best!!!", "Author": "Mario A. Luna", "ReviewID": "R2BY780SDLXB6U", "Overall": "5.0", "Content": "I love my iPad Air! Very fast and easy to use. I definitely recommend it... I'm very happy with it :)", "Date": "April 24, 2014"}, {"Title": "The defected product", "Author": "Michael J. Lu", "ReviewID": "R3B8D42UVGMPRV", "Overall": "3.0", "Content": "The new IPad Air could not be charged and need to be repaired. It was  sent backAnd came very complicated processes after receiving repair ID # and talked with four senior adviser.", "Date": "April 24, 2014"}, {"Title": "awesome", "Author": "Megan Balongue \"Pixelluminati\"", "ReviewID": "R2UJ5KK87ERTAN", "Overall": "5.0", "Content": "I am new to Apple ownership and I cannot be more pleased.  It is so easy to use and just beautiful.  The air is worth the extra price in comparison to an IPad 4.  When typing in a web address the Air seems to be intuitive to the point where it has the page already loading before you have even typed 3 or 4 letters.  I love it!  It is just gorgeous  I was going to get the mini with retina display but after researching and comparing the two I learned that they are not identical in every way but size.  The mini is actually not showing the whole color spectrum like the Air and it is very obvious.  The mini looks like the brightness has been switched down considerably.  So if you are like me and are trying to decide, do your research and go somewhere where you can compare them side by side and the choice will be quite clear.  I will never go back to an android!", "Date": "April 22, 2014"}, {"Title": "Awesome", "Author": "Doug", "ReviewID": "R3W14MJFUO3P7Z", "Overall": "5.0", "Content": "I love the ipad air I bought this as a used item but I can't even tell it was used  and I got like a 70$ discount since I didn't buy it new!", "Date": "April 22, 2014"}, {"Title": "Awesome!", "Author": "jcw", "ReviewID": "RLRWRRJ1XGAWQ", "Overall": "5.0", "Content": "Bought this for my boyfriend's birthday who loves to play games.  He loves it and the screen is so clear.  I just wish I could afford to get another one for myself.", "Date": "April 22, 2014"}, {"Title": "great", "Author": "Danielle", "ReviewID": "R22MWVA8GQDE0D", "Overall": "5.0", "Content": "well its an iPad, everyone loves their iPad … got it for about 40$ less than i would from apple :) steal of a deal. perfect condition. brand new as in description. no complaints", "Date": "April 21, 2014"}, {"Title": "Fast and Sleek!", "Author": "Marcus", "ReviewID": "R2HU89LZB88I5F", "Overall": "5.0", "Content": "Just an upgrade but it works and plays like a champ! Amazing.  If you own one you know it is great.", "Date": "April 21, 2014"}, {"Title": "Outstanding Product", "Author": "Bengt Ekwall", "ReviewID": "R3SQUOKCOG3F9Z", "Overall": "5.0", "Content": "Does all that I need it to do. It is versatile and light enough to go where I go. Excellent.", "Date": "April 21, 2014"}, {"Title": "iPad airmd785ll/a", "Author": "Thelma A. Kennard", "ReviewID": "R1LFLC4BAE6ON2", "Overall": "5.0", "Content": "I really like it. It is very useful . I was going to get a laptop, but I don't need to now.", "Date": "April 20, 2014"}, {"Title": "Ipad air", "Author": "Ben Evenhuis", "ReviewID": "RA0WG10UH7A9R", "Overall": "5.0", "Content": "I was impressed with the light weight yet solid feel of this Ipad. It is by far the best model yet. It is the top tablet out there on the market. If you are looking for one that does it all and is easy to use buy this Ipad.", "Date": "April 20, 2014"}, {"Title": "nice piece of technology", "Author": "Linda RDH", "ReviewID": "R34UTCHSF9EVF7", "Overall": "5.0", "Content": "This is a great little, lightweight piece of technology to own.  It came on time. The only disappointment is that there are no obvious directions in the box to guide my set-up.  What can I say... I am old-school wanting written directions.  I am charging it now and will hopefully follow prompts after that!  Thank God for Google....", "Date": "April 20, 2014"}, {"Title": "Apple still costing too much", "Author": "Walter Pinkham", "ReviewID": "R3P9BVF1S7KDK2", "Overall": "5.0", "Content": "Been working great easy to learn had just a little help from daughter, only complaint is apple just charges too much. Using apples face time neat talking with anyone who has facetime via the internet.", "Date": "April 20, 2014"}, {"Title": "Upgrading from the original ipad", "Author": "Thomas B", "ReviewID": "R2LZ5W9LXQ8ATR", "Overall": "5.0", "Content": "I am glad I didn't upgrade until this version of the iPad.  It's a fantastic device.  It's fast and far more capable from the clunky original ipad.  It's battery life is baffling.  I literally plug it in at most once every two weeks.  It's around for quick web searches, some games and email.  I am sure I could drain the battery in a day, if I tried hard enough, but I'd probably lose my mind in the process.I own a lot of Android devices, as well.  They  don't deserved to be considered in the same breath.  Their engineering is all over the spectrum, but never reach the heights of Apple's flawless execution.  I attribute android's failure to it's architecture around Java and old school mentality of making a product that works, sells, but never excels.  There's literally no better alternative  than an apple device, and I am not a Steve Jobs fan.", "Date": "April 20, 2014"}, {"Title": "i like it very much", "Author": "dh johnson", "ReviewID": "R30YSLQMEFHJKQ", "Overall": "4.0", "Content": "nice machine.  the apple systems take some time to get used to if you have not used them before.  good colors,  good definition,  quick.", "Date": "April 17, 2014"}, {"Title": "Love it!", "Author": "Jesse R \"Jesse R\"", "ReviewID": "R3MBA3N0WV27SC", "Overall": "5.0", "Content": "I use it all the time, it's nice and fast. It's very light and easy to carry around. I would recommend anyone who likes iOS.", "Date": "April 16, 2014"}, {"Title": "Awesome!", "Author": "Megan Peacock", "ReviewID": "R1MI6A9XXEOO04", "Overall": "5.0", "Content": "Super light weight and very use friendly. I especially love the pages and keynote apps. I have always loved Apple products, but needed something to type documents on.... and now I have both!!", "Date": "April 13, 2014"}, {"Title": "iPad Air!", "Author": "Patricia M. Dobson", "ReviewID": "R5JWRLSYK4MPD", "Overall": "5.0", "Content": "Love the iPad!  There are many apps available and working with docs from the Cloud is very convenient.  Takes great pics and videos, too!", "Date": "April 13, 2014"}, {"Title": "I am so happy with this IPad Air!", "Author": "Marilyn J. Rowlands \"MJ\"", "ReviewID": "R2GRF5E687TIMB", "Overall": "5.0", "Content": "This is my first IPad and I am so happy with my purchase.  I have a desktop computer and always felt \"out of touch\" when I was away for a few days.  Now, I can easily keep in touch.  I also love being able to play the games that I enjoy.", "Date": "April 12, 2014"}, {"Title": "Excellent", "Author": "Andrew Mann", "ReviewID": "R1U1MSDGXFYDBJ", "Overall": "5.0", "Content": "I absolutely love my iPad Air. It was a gift for Valentines Day. Way better get jewelry. Although, I don't really wear jewelry.  I love all of the features that this product has. Yay! Thumbs up!", "Date": "April 11, 2014"}, {"Title": "Great machine", "Author": "LN \"LN\"", "ReviewID": "R33P9N4497BB8C", "Overall": "4.0", "Content": "I won't repeat what other reviewers have written, about it being a great product. I'll just mention two things that stand out for me, one positive and two negatives.First, the negatives: 1) The screen gets really dirty really easily. Apple says it's oleophobic, repels oils. I've found that to be untrue. My Kindle Fire HDX screen is MUCH better--it seems to be a harder, slicker surface, so fingerprints and such don't stick to the screen. Putting the Tech Armor screen protector on the iPad helps. 2) The app store is filled with a lot of junk, and there are so many apps there that it takes a lot of time to wade through to something that actually looks useful. Many of the apps are almost duplicates of each other. On the plus side, and the reason I got the iPad in the first place, there are some apps that are written only for the iPad.Second, the positive: this thing is a true battery miser. I can go a couple of days between charges, more if I'm not using it heavily. I haven't been able to test this, but I imagine it could play movies all through a long plane ride, whereas the Fire HDX would need an external battery for recharge.", "Date": "April 11, 2014"}, {"Title": "I-pad Air", "Author": "John Bohn", "ReviewID": "R1ECG8I901L13C", "Overall": "5.0", "Content": "I am a former Nook tablet user that converted to the Apple I-Pad.  The I-Pad is so much nicer that both my nooks are gathering dust.", "Date": "April 11, 2014"}, {"Title": "Is the best and smooth. I am loving it", "Author": "Sid F.", "ReviewID": "R1YPKS2XMJRGX7", "Overall": "5.0", "Content": "I am in love with you guys, because your product description was exactly when I receive it. Everything rock, I will definitely come back", "Date": "April 11, 2014"}, {"Title": "Great iPad Air", "Author": "Joanne", "ReviewID": "R2MA3F1J8UOF1K", "Overall": "5.0", "Content": "I love the iPad Air. It is so much lighter than the regular iPad. I had the iPad mini which I loved, but I wanted just a little bigger screen so I can use it without my glasses.", "Date": "April 10, 2014"}, {"Title": "iPad 64 Satisfied customer", "Author": "Fred Hogue \"fhogue\"", "ReviewID": "RMRZ3CUH1WOFG", "Overall": "5.0", "Content": "This IPad 64 is great for travel you can store movies, books, & music all without the need for a wireless connection!", "Date": "March 25, 2014"}, {"Title": "Worth the price.", "Author": "Donald Furgeson Sr", "ReviewID": "R3P7QY66VJ52HS", "Overall": "5.0", "Content": "Nice, very nice. I own a iPod and hate typing on it (fat fingers, small keyboard). One feature I love about this iPad air is the keyboard size.", "Date": "March 25, 2014"}, {"Title": "Love it !", "Author": "Mands \"Chips and Gravy\"", "ReviewID": "R3V0QAOAA6W7Q6", "Overall": "5.0", "Content": "Took a long time for me to get an iPad ,at last I got this iPad Air and I love it. The product was delivered on time and and exactly as stated.", "Date": "March 24, 2014"}, {"Title": "Use it for  reading and love it.", "Author": "Nida Elahi Khan", "ReviewID": "R3REX4K0LY3TK5", "Overall": "5.0", "Content": "Love to use it for reading and work etc. The new processor definitely beats the iPad 4. everything loads faster and feels smoother. And its more portable.", "Date": "March 24, 2014"}, {"Title": "WOW!", "Author": "Barbara Burchfield", "ReviewID": "R13DZNOBFAMOTM", "Overall": "5.0", "Content": "This little baby rocks!  I had the first generation for five years and she was still going strong, but decided to update and treat myself!  I am so amazed with this little jewel.  Fast, clear and light.  I am still discovering all of the tricks, but I am in love all over again!", "Date": "March 24, 2014"}, {"Title": "Apple ipad Air", "Author": "James McGill", "ReviewID": "R1Y9WHXRGZNVIZ", "Overall": "4.0", "Content": "I am still learning on this product but so far it has been fun and easy. Nice and light and save room in my luggage.", "Date": "March 24, 2014"}, {"Title": "No doubt a", "Author": "D. Troiano", "ReviewID": "R3KQCNOX3FW2PA", "Overall": "5.0", "Content": "Great device  for work or play. Worth the extra memory of you like to watch movies on your digital tablet", "Date": "March 23, 2014"}, {"Title": "Love it", "Author": "CINDY WILLOUGHBY", "ReviewID": "R3S2CW6GESD5C4", "Overall": "5.0", "Content": "Exactly what I was looking for and it works as expected. Arrived on time too. Love the apps and sync with my iphone", "Date": "March 22, 2014"}, {"Title": "The best.", "Author": "Barbara Lamar \"Book Maven\"", "ReviewID": "R117RTWWK0H3K0", "Overall": "5.0", "Content": "I hate writing 20 word reviews, because some products don't need 20 words.  This item speaks for itself. We had a Nook Color, was replaced three years in a row, finally the last one died that was a little over a year old. Was told it was terminal, but they would sell us a refurbished for $125.00.  No way, not worth it! This is a wonderful product.", "Date": "March 22, 2014"}, {"Title": "Ease! Fun!", "Author": "Bick", "ReviewID": "R12XU0GWM5CFXF", "Overall": "5.0", "Content": "Never been an Apple fan, however, after purchasing this IPad Air, we are so happy with every aspect of it's design, Just wish I didn't have to pay as much as I did compared to  tablets.", "Date": "March 17, 2014"}, {"Title": "This iPad is worth every penny!", "Author": "aonetruthr", "ReviewID": "R24MI0VFKCBEZJ", "Overall": "4.0", "Content": "I saw the iPad Air for $479 on Amazon and I had to get it!  I've had the 4th Gen iPad for 11 months and I wanted my mom to have her 1st tablet so I gave her the 4th Gen.  It's so light and fast, and it's a great tablet.  I'm worried to hear what will be on the next iPad but as far as I'm concerned, this one has everything I need.", "Date": "March 17, 2014"}, {"Title": "Beautiful tablet...", "Author": "lailari72", "ReviewID": "R2ZHA36CY94149", "Overall": "4.0", "Content": "Beautiful little machine, more evolved companion to my ipad 2 but with a few differences. I know the air has the much talked about retina, but to be honest with my eyes it's hard to tell the difference between the clarity between the #2 and the air. The camera on the air far surpasses the ipad 2, but it's the march of technology as such.Also the Air really seems to hate the chrome browser. I don't use safari as a rule, not even on my MBP, being more comfortable with chrome. I never noticed my ipad 2 having an issue with chrome, but the air does and crashes four to five times a week when chrome is being used. I know apple loathes google, but whatever their differences they should put it aside for their customers.", "Date": "March 16, 2014"}, {"Title": "BETTER THAN MY EXPECTATIONS", "Author": "William C. Fike, Jr", "ReviewID": "RIS53EE3YHVPP", "Overall": "5.0", "Content": "Highly recommend this product to anyone.  My wife and I really enjoy the excellent features and the ease of use.", "Date": "March 15, 2014"}, {"Title": "Finally one for ME", "Author": "Gram", "ReviewID": "R1XG8XMTSZJX7P", "Overall": "5.0", "Content": "The price was right, new in box, fast delivery - when I get \"border\" with it or upgarde to the generation after this I will hand it to my grandchildren.", "Date": "March 15, 2014"}, {"Title": "Very satisfied", "Author": "Dave", "ReviewID": "RJFHIUSAYE45U", "Overall": "5.0", "Content": "Scared to send something of this value and being electronic and -20 degrees below zero. I didn't know for sure how it would work out.  All was fine.  No issues.  Just the tax money saved was well worth shipping it through the mail verses the big box stores.", "Date": "March 15, 2014"}, {"Title": "Simply the best", "Author": "s198 \"s198\"", "ReviewID": "RS96ZBQP4JQB2", "Overall": "5.0", "Content": "I haven't owned an Apple product since the iphone4.  I have been an Android man the past several years.  Let me say that this iPad Air is the perfect device.  Rock solid and the apps are SOLID. I am a Cybersecurity manager and have seen one too many malware infested Android apps lately.  Enough to scare me away.  Buy this, you won't regret it", "Date": "March 15, 2014"}, {"Title": "iPad is the top of the league.", "Author": "abhishek", "ReviewID": "R3Q4KB7YSU381L", "Overall": "5.0", "Content": "I bought windows rt and dell venue before I finally settled on this one.all others are either very slow or too small.the iPad is a little expensive but its very classy and technologically way ahead of all the others.I would suggest everyone to just go with the iPad and never look back.", "Date": "March 15, 2014"}, {"Title": "So far I'm loving it!!", "Author": "roxanne", "ReviewID": "R1ATOPMPY6LHFM", "Overall": "5.0", "Content": "I bought this after hemming and hawing over all the different options for tablets. I'm a PC user primarily and Apple products are usually more expensive than I'm comfortable with. I eventually chose the iPad Air because Apple has long lasting, durable products and their customer service is usually top notch.The iPad came quickly and so far I love it!! It's incredibly light and has a lot of useful apps for school (which is why I wanted a tablet). It beats dragging a heavy computer around campus, that's for sure! The sound quality of the speakers are really nice and the screen's resolution makes pictures beautiful.I only just received the product so the battery is quite new, but it has a very long life; even when you're constantly using wi-fi or bluetooth it will last you all day.If you're looking for a tablet, you should go with whatever makes you comfortable and consider what you want to use the tablet for.  That being said, even though I'm more comfortable on PCs this is a handy device and so far I'm happy with my purchase.", "Date": "March 14, 2014"}, {"Title": "Great", "Author": "Todd Machuca", "ReviewID": "R1ZODCTHMQPQ5", "Overall": "5.0", "Content": "Excellent machine. Far surpasses what I expected. Light weight bigger screen and much faster then the last version. Love it.", "Date": "March 14, 2014"}, {"Title": "Loving it!!", "Author": "Kevin Page", "ReviewID": "R21IL8AS0SP1QL", "Overall": "5.0", "Content": "The new iPad Air works perfectly!!! I love the speed of this thing. Great product to supplement my macbook pro or when I'm looking to travel lightly.", "Date": "March 13, 2014"}, {"Title": "Very First iPad", "Author": "Spazpilot", "ReviewID": "R145P9PPHC47YY", "Overall": "5.0", "Content": "I've waited a long time to get one of these believing that it would never replace MacBook Pro, but it just about has. I now use it for iChat, Facetime, Netflix, eBay, Amazon, RiteAid... just about everything. The only thing missing (and only really important to my wife) would be OfficeMac so she could use excel, et. for work when we are away from home.", "Date": "March 11, 2014"}, {"Title": "Last stop!", "Author": "DAVID", "ReviewID": "R3107ZTRKM9312", "Overall": "5.0", "Content": "Don't waste your money on other pads start with this one. I went through three pads in less then two months so I spent a few more dollars and bought this one. There is no comparing the performance between pads! Bottom line, when it comes to this type of product you get what you pay for!", "Date": "March 10, 2014"}, {"Title": "Always top quality from Apple", "Author": "Ricardo E. Gayoso", "ReviewID": "R35GFUH1KNK4LE", "Overall": "5.0", "Content": "Apple always makes devices that are a couple or years ahead of all others. This is another example of that.", "Date": "March 10, 2014"}, {"Title": "Good product", "Author": "Todd", "ReviewID": "RSIVDVZ0E3CZB", "Overall": "5.0", "Content": "Seem to work just fine. Have had no issues so far. It is too expensive like all Apple products are.", "Date": "March 10, 2014"}, {"Title": "IPad Air", "Author": "Mike Hall", "ReviewID": "R3JV68I5X4EYK7", "Overall": "5.0", "Content": "Has really matured into a versatile and functional tablet.  Mine is used heavily for aviation applications, where it has excellent functionality.", "Date": "March 10, 2014"}, {"Title": "How did I ever live withou it?", "Author": "ClownboyAW", "ReviewID": "R1G34I3PVK2FXR", "Overall": "5.0", "Content": "Amazon is not going to like this review because I really favor the iPad over the kindle fire. Don't get me wrong, the kindle is a fantastic device but as for ability and apps - The Air is awesome! I use to lug a laptop around to work and play but the iPad Air does everything I want in a small, light package. I added the Pelican case to the Air and it's nearly industrcible. It's been dropped numerous times and faced two minor spills with no ill effects.As a note, I am writing this review with the iPad while sitting stationary in my car. It is a very versatile device with too many features to mention in a short review. I can not imagine not owning one now!", "Date": "March 10, 2014"}, {"Title": "extremely pleased easy to use", "Author": "Francine J Oliver", "ReviewID": "RXR9587XGF6S7", "Overall": "5.0", "Content": "I was very happy with this product. I have never used and apple product before and was apprehensive but it was very user friendly.", "Date": "March 9, 2014"}, {"Title": "Real nice", "Author": "John Wojtowicz", "ReviewID": "REOC67CBA3HI3", "Overall": "5.0", "Content": "This is the first tablet I've bought I have not even played around with one. I bought this after checking  out competitor prices and this was the best buy I could find.  I am extremely happy with it. It is much easier than any windows based item I have used.  I did one thing wrong and gave my laptop away. There are sites I'm unable to access some needed downloads to a tablet.", "Date": "March 9, 2014"}, {"Title": "Apple IPad Air", "Author": "Pat Bluth", "ReviewID": "R2ZTZNRGROPUC5", "Overall": "5.0", "Content": "This Apple Ipad Air was purchased as a Christmas gift.  The recipient of this gift was very surprised and happy to receive it.  She was taking a trip and found the Ipad easy to pack and did all she needed to do as if it were her computer.  Very pleased with the product.", "Date": "March 9, 2014"}, {"Title": "iPad air", "Author": "alice lynch", "ReviewID": "R14P29E7WT9MF0", "Overall": "5.0", "Content": "Love my iPad air. It is so light and easy to use. I received it on the date that I was suppose to and have been having fun with it every day. Really like reading books on it so easy to read. Handy to use.", "Date": "March 8, 2014"}, {"Title": "Love this iPad", "Author": "Richard V.", "ReviewID": "R1KV98BFYI1VQ1", "Overall": "5.0", "Content": "This is a great tool! It's instantly on when I want to use it. I can take it anywhere and it's already to give me any information I need. I should have made this purchase a long time ago..", "Date": "March 8, 2014"}, {"Title": "Welcome to the age of technology", "Author": "Susan Macosko", "ReviewID": "R17IL5Q5NJ1QTD", "Overall": "4.0", "Content": "Having this kind of technology is a learning experience for me.  I am enjoying using \"facetime\" with my family.  It is much better than \"Skype\".", "Date": "March 7, 2014"}, {"Title": "Awesome new ipad Air", "Author": "Andrew Viernes", "ReviewID": "R3VTONI22U4AO6", "Overall": "5.0", "Content": "Have had every upgraded iPad since it's inception and this is the pinnacle of iPad design, functionality and style. Great battery life, screen resolution and weight.", "Date": "March 7, 2014"}, {"Title": "unbeatable", "Author": "cset", "ReviewID": "R2N3F59CO5YKWX", "Overall": "5.0", "Content": "iPads are still the easiest to use, most versatile and best quality tablets on the market.  Samsung has some nice Android OS ones, but they are just as expensive and with Android you have so many different brands and versions of OS that it is impossible to standardize as a program/App may work on one but not on another brand or model etc. Apple just makes user support a non-issue. Power on and go.", "Date": "March 7, 2014"}, {"Title": "New tricks for an old dog?", "Author": "V. Chevalier", "ReviewID": "R3RQFBRHRN1PCA", "Overall": "5.0", "Content": "When I'm home in my comfy chair, I still prefer using my laptop with the old keyboard and mouse; however, when I'm anywhere else, this iPad is wonderful!  It's fast, convenient and the battery lasts so much longer then my laptop battery.I'm not tech savvy and I have yet to learn a lot (like using word or numbers programs) but so far the old gal is thrilled with it.", "Date": "March 7, 2014"}, {"Title": "Perfect!", "Author": "Luiz Ferreira", "ReviewID": "ROB775JLKVC9A", "Overall": "5.0", "Content": "I choose this raiting because I didn' nothing wrong. Absolutely  PERFECT.That's all I want. Beatiful. Light. Fast. Fast. Faster. Recomend to all my friends.", "Date": "March 7, 2014"}, {"Title": "Love it!", "Author": "avidreaders", "ReviewID": "R1D53BTB8VHP81", "Overall": "5.0", "Content": "I should have purchased this much sooner much easier than carrying around my laptop.  Nice to share with my iPhone.", "Date": "March 6, 2014"}, {"Title": "Best buy", "Author": "Daniel", "ReviewID": "R1X23X4070M8NU", "Overall": "5.0", "Content": "This is a very nice and fast Ipad, quite light when you hold it in your hand. I warmly recomebd it.", "Date": "March 6, 2014"}, {"Title": "Best ipad I have owned", "Author": "Devon white", "ReviewID": "RVSSHLI3AD0RR", "Overall": "5.0", "Content": "So just to let you know of my experience with IPad's I have owned the first generation the ipad 2 and know the ipad air and I can honestly say this is the best ipad yet. I loved my ipad 2 had it for 2 years it never skipped a beat. But know that I have the ipad air it's in a whole new ball park I wouldn't even say that the ipad 2 is even close to the ipad air. Performance wise I do a lot of multi tasking and it doesn't even break a sweat. The picture is brilliant very clear and crisp. The size and structure are amazing light and beautiful very sharp. It fits in your hands like a glove. It has a great camera for a tablet you wouldn't believe the pictures I have taken with this thing I get a lot if compliments all the time. As for its competitors the samsung note 10.1 2014 edition, the structure of this ipad blows it away. Know Samsung has its own perks that Apple doesn't offer but I would still say its a fair superior product then the note. That being said I do own a galaxy s4 smart phone and I absolutely love it I just prefer my phone to have a bigger screen,and it has it's other perks as well. mainly the galaxy gear watch sealed the deal for me. Hope this helped you into buying a IPAD AIR", "Date": "March 5, 2014"}, {"Title": "iPad love it", "Author": "Tina Mastrangelo", "ReviewID": "R11OZ51LS2CQ3L", "Overall": "5.0", "Content": "I received this promptly and love it!!Very easy to set up and sync with iPhone!Since I have ordered a cover and stylus", "Date": "March 5, 2014"}, {"Title": "loads of apps", "Author": "Debbie Banks", "ReviewID": "R2RLSZZ1LMBIXB", "Overall": "4.0", "Content": "Yes it's lighter and has tons of apps. Glad I bought it for my husband, he loves it! Speakers are very Good as well", "Date": "March 3, 2014"}, {"Title": "Love the convenience", "Author": "Paul C Carey", "ReviewID": "R3OPG3G6QJWQZL", "Overall": "5.0", "Content": "My wife and I love this ipod. Its easy to navigate and Convenient to use. We love being able to check emais and surf the web from the comfort of our couch!", "Date": "March 3, 2014"}, {"Title": "Love it", "Author": "Cathy", "ReviewID": "RFWN5UW26QKKK", "Overall": "5.0", "Content": "Nice love it would recommend to anyone who wants one. So if you want an iPad air get one you won't be disappointed .", "Date": "March 2, 2014"}, {"Title": "Ipad air", "Author": "Manuel", "ReviewID": "R2HUAJZQBULQ0E", "Overall": "5.0", "Content": "Basically changed my previous version to get a lighter ipad and this is perfectly achieved. So it is really light easy to carry, esasy to handle when reading kindle books. I really liked it a lot.", "Date": "March 2, 2014"}, {"Title": "Fantastic !", "Author": "Busgate", "ReviewID": "R35QIS2T3ATKJ9", "Overall": "5.0", "Content": "What can you say -- It's an iPad!  Beautiful display, very fast, very handy, One of the better buys in tablets.  Shopped around a half dozen tablets and this was, by far, the best unit we found.", "Date": "March 2, 2014"}, {"Title": "Best Tablet Yet!", "Author": "fredrick peterson", "ReviewID": "R3TJMX2D044FQZ", "Overall": "5.0", "Content": "Apple continues to come out with the best products on the markey and this ipad is no exception. The tablet was a crystal clear screen, super apps, and it functions perfectly. The retina display is awesome!", "Date": "March 1, 2014"}, {"Title": "Fast, sleek", "Author": "M. King", "ReviewID": "R2UWKW80GKICM6", "Overall": "5.0", "Content": "Great speed. Ultra slim and lightweight. Screen looks amazing. I notice the music or speakers sound alot better than earlier models. Has a sense of bass now. Jailbreak it and ur possibilities are endless", "Date": "March 1, 2014"}, {"Title": "New iPad", "Author": "Alice Reynolds", "ReviewID": "R33W6VR84VK2K2", "Overall": "5.0", "Content": "I'm new at this but learning fast, so far I am pleased with it,  and very amazed at all it can do.", "Date": "March 1, 2014"}, {"Title": "A wonderful product", "Author": "WhiteKnight", "ReviewID": "R2KXW6X1D9U1YQ", "Overall": "5.0", "Content": "This was a Gift to my Mother and she has raved about it ever since.It's easy to use and she enjoying it more each day.Thanks", "Date": "March 1, 2014"}, {"Title": "iPad Air", "Author": "Pamela L. Forrester", "ReviewID": "R2RTWJ4I8QZVV9", "Overall": "4.0", "Content": "My first tablet purchase. I bought one for my adult daughter also. We both find it extremely useful and rarely go into our laptops now. So light and easy for me to hold as an older person. It was more expensive than many tablets and doesn't combine with my laptop or printer as many other tablets do.", "Date": "March 1, 2014"}, {"Title": "It's great!", "Author": "Graham Smith", "ReviewID": "R1GRNP53LN5AMG", "Overall": "5.0", "Content": "It's great! Does everything I wanted and more. Facetime is a great way to keep in touch across the Atlantic and see the new grandchild.", "Date": "March 1, 2014"}, {"Title": "Love it!", "Author": "Bumbles \"flowing yogi\"", "ReviewID": "R3EAPTAQ1EXI9N", "Overall": "5.0", "Content": "Got the new iPad air (our first ever ipad/tablet). It's great and we were happy with the price and service of this seller. Thank you!", "Date": "February 28, 2014"}, {"Title": "Husband loves his gift!", "Author": "J. Blake", "ReviewID": "R1LZ5TDYSA77BT", "Overall": "5.0", "Content": "I purchased this for a birthday present for my husband.  He is enjoying it thoroughly.  I think the graphics are terrific!", "Date": "February 27, 2014"}, {"Title": "Definitely worth the upgrade from any prior iPad model", "Author": "The Badboy \"Badboy Studios Inc.\"", "ReviewID": "RMSPQMZ0RK6YV", "Overall": "5.0", "Content": "The iPad 3 was my first iPad and I've used it up to the point I bought this iPad Air. I had cracked my screen and it seemed as if it was slowing down over time, probably due to the updated operating systems putting more stress on the aging processor and memory.So, I saw a good deal on a used model appear on Amazon, and decided to go for it. For little over $500, after I traded in my older model, I had a brand-new, or close to it, iPad Air. The first thing you'll notice is the weight. It is at least half that of the previous models. The bezel thinner on the sides and the new thunderbolt port on the bottom. I also love the addition of stereo speakers, as I own one of the biggest recording studios on the East Coast and love to try out the music I produce on a multitude of sound systems. This allows me to hear what I've done in stereo, on a lower common denominator, so as to know what my music sounds like coming from the speakers of a system millions of people own.The next thing I noticed, is the screen seemed quite a bit brighter then my iPad 3. This could just be because of the aging screen tech under the glass, or some other factor. But it definitely helps for reading, even at half power, in darker and lighter situations that I have no control over. Next up, the speed at which everything operates. Not only loading software and apps, but in switching apps and multitasking. There is just a zip to everything now.The biggest thing I noticed, the Internet is 10 times as fast as it was in my prior model. I'm going to guess the MIMO has something to do with that, along with the two antennas. Giving a stronger signal, which in turn allows for the fastest Internet possible. I have 50 Mb Internet, and I now feel like I'm using every bit of it in doing something as simple as loading webpages or downloading videos, games and music. When I load a webpage, everything appears instantly, no more loading in of different aspects of that page, everything is just there. I think it is the first time, and Ive owned  hundreds of computers over the years, that I've noticed any webpage load so instantly.Games look every bit as good as they can, due to the increased processing power of the CPU and GPU. If Apple would only make a proprietary gamepad for the iPad, they would have a true contender for a great video game system on the market. Some of the games, especially those from Gameloft and EA, have every bit the quality that you see from any game on modern systems, bar a few effects here and there.Even music production can be done at high-quality, for the home or studio producer, with decent results. I've heard some songs recorded completely via the iPad, that you would've sworn were done in multi-million-dollar studios. They are that good. Which goes to show, great music is made by a great producer and not the equipment behind him.So, to sum things up:Positives:Great, bright, high resolution screenSmaller and lighterIncredible portable powerGreatly improved internet speedStereo speakers built inAwesome games and production softwareCheap accessories from third party vendorsNegative:Price, though I imagine we would sacrifice some quality at a lower price pointOverall, you will not find a better portable computer for the price. Anything Windows is going to have issues. Whether that be with drivers, malware, viruses or some or the other issue that goes along with owning a Windows machine. Sure, they are more powerful and will allow you a greater depth of software, but you make trade-offs with that power in size, weight and ease-of-use. So, if you have the means, definitely get the iPad Air. The upgrades are truly worth the extra cost over previous models. It's like having a super computer under your fingertips everywhere you go.", "Date": "February 27, 2014"}, {"Title": "Converted Fangirl", "Author": "HardatTwerk", "ReviewID": "R1C5M2NPBI3XR9", "Overall": "5.0", "Content": "So..for a long time..I hated apple. But I get it now..it just works. It simply works. Its beautiful..feels great in my hand. Turns heads and its very easy to type on. Its zippy, and has made my life so much easier. I am a graphic artist/ web designer. I draw on this and take notes and photos every now and then. I compared so many other products, and for being I hated apple..I love this thing more than anything in the world.", "Date": "February 26, 2014"}, {"Title": "Love my IPad Air", "Author": "Patricia", "ReviewID": "R2WZPM6BR84O3U", "Overall": "5.0", "Content": "I love my iPad air and I made sure I have lots of memory. I have not had any trouble and I use it every day since Christmas. Also I love all the accessories you can get for it.", "Date": "February 26, 2014"}, {"Title": "It is great and had no problems with delivery", "Author": "Nicole carlson", "ReviewID": "R1X68FTIN2P9GI", "Overall": "5.0", "Content": "I choose this raining  because it was delivered right on time and with no issuesIt  was so good to just open the box and start working on the I padI wold recommend it to any one", "Date": "February 26, 2014"}, {"Title": "Best tablet", "Author": "Shahab Pourtalebi", "ReviewID": "REDJRNH7GAWLQ", "Overall": "5.0", "Content": "I had an ipad 2 64GB 3G. It was a good tabled, but I never used more than half of the storage space. Now I spent less money and I have more facilities.", "Date": "February 26, 2014"}, {"Title": "Terriffic upgrade to our new iPads", "Author": "Randy B", "ReviewID": "R1YU4F51PTUQ45", "Overall": "5.0", "Content": "We have had iPad 2 for quite some time. They have been great but we bit the bullet and upgraded to these. So much faster, a bit smaller and with better graphics. A bit of a hassle getting all the apps loaded on but I am not sure if it was me or iTunes but it all worked out and everything is running nicely. The extra 16 GB of memory was well worth the extra cost.", "Date": "February 25, 2014"}, {"Title": "Apple is by far the best computer out there.", "Author": "KENNETH P.", "ReviewID": "R3JGQ1MGHSVE1R", "Overall": "5.0", "Content": "Apple is by far the best computer out there, i 've used other computers in the pass and i thought to myself that i would try apple to see what all the fuss was about apple, when i started using it the quality was so outstanding and the HD quality was magnificent, everything about Apple was excellent, i just feel in love with Apple and i hope to buy some more apple products in the future................", "Date": "February 25, 2014"}, {"Title": "New iPad Air", "Author": "Kissifur \"Kissifur\"", "ReviewID": "R3KRFSYZXO5LG6", "Overall": "5.0", "Content": "What is not to like about an iPad that is lighter, but still has the same large screen ....great product and super shipping and packaging.", "Date": "February 10, 2014"}, {"Title": "iPad air", "Author": "Nicole", "ReviewID": "R2X2NC92JEZIAR", "Overall": "5.0", "Content": "Great product and very lite and hd clear better than my ipad 2 on something's it's a all around good product.", "Date": "February 10, 2014"}, {"Title": "Valentines Gift", "Author": "David Ballerini", "ReviewID": "R2UFVHNH3KJY1C", "Overall": "5.0", "Content": "I bought this for my wife. Bottom line, she loves it. As I am tech challenged, my neighbor helped set the device up. Thank God for helpful neighbors!", "Date": "February 9, 2014"}, {"Title": "What can I say perfect product", "Author": "mona ghobrial", "ReviewID": "R1OLTIUVY1Y04B", "Overall": "5.0", "Content": "What not to like!Portability light weight and powerful and I am doing whatever I need to do without being tied to my desktop", "Date": "February 6, 2014"}, {"Title": "Pretty nifty!", "Author": "Jill B. Kettleson \"Sparky\"", "ReviewID": "R183OBAPWSNC4C", "Overall": "5.0", "Content": "This is ideal for just about anything... I have the iPhone 5s and this is a good compliment.  I highly recommend this.", "Date": "January 31, 2014"}, {"Title": "The future is a breeze", "Author": "The Guardian", "ReviewID": "RCZI8SDOCSF1B", "Overall": "4.0", "Content": "The iPad has established itself in four short years as the 'tablet of choice' to which all others are compared, and the Air is the newest and coolest in the family.First of all, the good news. At 467g the Air redefines computer portability and is so lightweight it's hard to tell whether you're carrying it in your bag or have in fact forgotten it, without looking to check. The Air has a fast A7 chip and the screen is a useful 9.7 inches; it's a breeze to use. The design of the graphics is so intuitive that any child or technophobe can master it and feel at home in a few minutes, which makes it the perfect entry-point into IT for someone who has so far avoided computers.One of the clever things Apple have done is the creation of the individual `Apple ID' which means once you enter your ID & password your iPad, iPhone, iPod and Mac immediately share all their files, and everything you created or stored on one device becomes available on them all: photos, music, reminders, address book, documents are all shared. This is probably the most brilliant idea ever in the IT mass market to create brand loyalty among consumers and `locks you in to the corporation for the duration'.Now, the bad news: the software crashes from time to time necessitating a reboot, which is annoying and inconvenient. This fault is acknowledged by Apple, as the software has a few bugs. Also the wireless reception is not all it might be, as it sometimes (mysteriously) fails to connect to even a moderately strong signal.Apple's pricing structure does not reflect the cost of manufacture but is driven by a market segmentation strategy, so the price really cranks up if you want an iPad with more memory or which can use the GSM phone network. The best value is the 16G Air without Cellular, which only connects to the internet via WiFi. 16G is a lot of memory by the historic standards of portable computers and you'll only find it insufficient if you want to store a lot of big files like films or powerpoint presentations.You'll need a carrying case to protect it (scores of different designs are available) and maybe a keyboard, which if you're doing a lot of writing and document creation rather than just surfing the internet is the one essential accessory, as without a separate keyboard the usable screen area is reduced in size. Around one million downloadable apps for Apple devices means you can personalize your iPad and make it into more or less whatever you want. The Air design is aesthetically a work of beauty in its simplicity, cleanness of lines and proportion, and despite some irritating niggles is a pleasure to own and use.", "Date": "January 22, 2014"}, {"Title": "Always love Apple", "Author": "Patricia Coykendall", "ReviewID": "R2Q8KB9C8ZHKQW", "Overall": "5.0", "Content": "All said it would be and more, had the I pad 2 and this is so much faster and lighter", "Date": "January 18, 2014"}, {"Title": "I love it, love it, LOVE IT!!!", "Author": "Maryanne", "ReviewID": "RX8WHXEP7PHLS", "Overall": "5.0", "Content": "I honestly love this tablet like crazy! It has great battery life, just like they claim. I had my younger cousins go on it and even though they were playing games and watching movies the whole time, the battery still lasted all day! The screen is also great, maybe it's not the best on the market but I can barely even tell the difference and it's still exquisite. The processing power is also outstanding and I couldn't need anything faster. Internet is very fast as well. All in all, I've always wanted an IPad and finally when I got it, I was not upset at all and it was actully a million times better than I expected.So, in my opinion, if you want it enough, and your willing to make a big splurge, get it. :D You won't regret it, it's da bomb. But if you really haven't wanted this much and your short on money, maybe you can give the other cheaper tablets a try. Such as the Nexus, Kindle, or even Nook!", "Date": "January 9, 2014"}, {"Title": "Love it, but had connection problem during set up", "Author": "Bookenz", "ReviewID": "R1Q22IXQKRHAIJ", "Overall": "4.0", "Content": "This is my favorite iPad so far, despite an initial wifi connection problem. I bought the original iPad, iPad 2, and iPad 3 (which I returned because of heating issues and thickness/weight and went back to the iPad 2).I was ready to buy a new iPad because my iPad 2 16gb was filled up.  So I decided on the iPad Air. The first thing I noticed when I took it out of the box was that it really is much lighter than even the iPad 2.  The screen is the same size, but the frame is narrower, so it's smaller overall.  I have the white 128gb wifi version.  Set up was problematic though, which is why I've taken away a star.  When asked to put in my home wifi password, I received a message that it was entered wrong. Repeatedly.  Well, it wasn't wrong because it's the same password as my other wireless devices.  Nothing I did would make it take the password, so I called Apple tech support. After being on the phone with the technician for at least 45 minutes, nothing worked. Turning my modem and router off and on did nothing. Changing some of the iPad's settings, again, nothing. I felt disappointed, frustrated, and let down by Apple. Finally, the tech set an appointment for me to take it into the Apple store and see if they could get it to connect to their wifi. Before we hung up, the tech suggested I connect the iPad to the iTunes on my computer and do a complete software restore and see if that would resolve the connection issue.  I did this, which took about an hour, and FINALLY was able to connect to my wifi. The connection has been stable so far.Other than the above initial connection problem, I am really loving the iPad Air. Sharp retina display, thinner and lighter, and faster connection (I use the Mercury Browser, not clunky Safari). The white frame with silver edges is really nice looking. I read a lot of ebooks, so the lighter weight is very much appreciated since it can be held comfortably with one hand. I also listen to audiobooks and this iPad has two speakers instead of one. They're located on the edge of the device, not the back, so you don't have to have the iPad back side up to get unmuffled sound. The sound quality of the iPad Air is superior to the iPad 2, and the volume can be turned up slightly louder. I've only played one game so far, Plants vs. Zombies 2, but it plays great. I don't use the camera and really wish Apple would make a version sans that option. It feels cool when holding--the iPad 3 I had got too warm on one side, which this one doesn't do. I haven't had any other problems and I think this is the best iPad yet. As far as the initial wifi connection issue I had, I'm going to assume this was a fluke with my device, and not something a lot of people are experiencing (although I have seen a few mentions of this on some of the Apple forums).", "Date": "January 8, 2014"}, {"Title": "Its perfect", "Author": "Benedito Eloi Maya \"Maya\"", "ReviewID": "R3PBL8USTW8GYJ", "Overall": "5.0", "Content": "This product is amazing. It's not perfect, but considering that I'll have it for at least 2 years and I've used it every day so far, It's very sturdy and I know it will hold up well, as my other Apple products have.", "Date": "December 30, 2013"}, {"Title": "Great Product", "Author": "12Junes", "ReviewID": "R131F02L9OA31P", "Overall": "4.0", "Content": "After coming from the 1st gen iPad, this took some getting used to. There are things that I like and things that I don't, but I think it's just personal preference. I do think that my 80 year old parents would have had a more difficult time getting used to this one.", "Date": "December 12, 2013"}, {"Title": "Love it", "Author": "Curt", "ReviewID": "RJ5E3PPGZEGQI", "Overall": "5.0", "Content": "I replaced a Samsung Galaxy tablet I bought just for fun.  It was ok, but was difficult to use, had limited apps, and seemed slow compared to my iPhone.  So I decided to try the iPad even though it was twice as much.I love this thing!  It's fast, intuitive, more apps, and just plain works better.  This tablet does so much more, works so well, I'm seriously considering going Apple instead of PC.  Don't think you can go wrong with an iPad, or iPhone either.", "Date": "June 8, 2014"}, {"Title": "BEWARE of unusable iPad Air!", "Author": "MORE THAN UNHAPPY!", "ReviewID": "R109F1FVFO7ZBB", "Overall": "1.0", "Content": "The iPads I purchased from TechGiant were not as they were described! When I took them to T-mobile to activate these \"brand new ipads\", I was told that they could not activate 4G on any of the 8 ipads I purchased! This was because all 8 were previously owned and blocked for FRAUD! TechGiant is selling previously owned items!  TechGIANT I would appreciate it if you contacted me directly to resolve this asap!", "Date": "June 4, 2014"}, {"Title": "I pad rocks", "Author": "Elizabeth", "ReviewID": "RXW5V6IUCQIZW", "Overall": "5.0", "Content": "I bought this wonderful table for my birthday this month so far I have no problems with it it does everything and more .I would recommend it to anyone this tablet rocks I am a satisfied customer.", "Date": "March 26, 2014"}, {"Title": "I love this thing.", "Author": "Signalshifter", "ReviewID": "R1PG0RSEDGFJ0B", "Overall": "5.0", "Content": "I have had several iPod Touches over the years and I have always wanted an iPad. Well the iPad Air had all of the power, features, and storage space I was looking for.  I was looking forward to it's arrival and when I first started to you use it, it was somewhat of a wa-de-doo-da experience not disappointment but total familiarity because of all of the iPod Touch's I have. Then it started to grow on me, watching Crunchyroll anime, Amazon Prime movies, and it's prefect integration with my Apple TV all of this while being decadent in bed with my Irish Terriers snuggled up around me, total domestic bliss. It is a howler when you accidentally activate Siri while asleep my snoring it gives Siri fits.  I purchase the small Apple keyboard for it and this just enhanced the iPad more, now I have a really nifty alternative to a small notebook computer.  I have not commented of the functionality I suspect most of you out there are like me coming from another iOS device. I do notice some un Apple like bugs in iOS 7.01.and somewhat less in 7.1 but have a PC with Windows 8.1 installed so any minor bugs in iOS-7.1 are nothing compared with this disaster from M$.", "Date": "March 22, 2014"}, {"Title": "Just what we needed", "Author": "Carol L", "ReviewID": "RV8GCGFKFRA88", "Overall": "5.0", "Content": "Large , clear, easy to see. My husband does not like electronics, but he loves his I-pad. Shares what he likes with everyone who will listen.", "Date": "March 21, 2014"}, {"Title": "best mac product", "Author": "mindy rosenbloom", "ReviewID": "R3637KAZKBDYO1", "Overall": "5.0", "Content": "love the size portability battery life looks seek like having appshave the desktop mac air iphone this is the best", "Date": "March 21, 2014"}, {"Title": "Great Device", "Author": "Adam R.", "ReviewID": "R26IVP3W64PC4J", "Overall": "5.0", "Content": "This is a great device.  I am able to be very productive on it.  I pair it with my New Trent Airbender case, and it is almost like having a light laptop.", "Date": "March 6, 2014"}, {"Title": "great device, but beware of third party sellers", "Author": "J. Zajaczkowski", "ReviewID": "R33HKDXO136BFX", "Overall": "5.0", "Content": "I recently got the iPad Air 128GB from TechGiant and immediately after getting it I took it to my local Apple store to get AppleCare+ for it. After talking to 3 different reps and finally a manager it turns out that the model I actually received was the ME898E/A and not the invoiced, and what was on the package, ME898LL/A. After doing some research the manager determined that they could not sell me AppleCare because the model wasn't sold in the US, but instead in Mexico. The Apple store manager then advised me to return the iPad because not only did I not receive the model invoiced but also that if I had any problems with it I would not get any warranty service because warranties are not offered for Mexican sold Apple products.Otherwise, this is the best tablet I have ever used. Like any other mobile device or computer, it does have problems if you open every app without closing them. To close apps on your iOS 7 iPad, simply double click the home button and swipe upwards the apps you aren't working with. This way you can enjoy the cutting edge speed this thing is capable of.", "Date": "March 6, 2014"}, {"Title": "I find it difficult to get used to", "Author": "beatrice j seegers", "ReviewID": "R1SUXXIMMTN7O7", "Overall": "2.0", "Content": "I've tried hard to learn how to use my pad, but still finding it hard to use.I suspect this could be me...but it \"freezes\" up and I do turn it off and start over but some times it does not work.I'm thinking of giving it to my son and getting a laptop.I like the pad and the ease of using the keyboard.The size is perfect and it is not too heavy", "Date": "March 4, 2014"}, {"Title": "iPad Air!!", "Author": "Jade", "ReviewID": "RK2DX2AY1IP6C", "Overall": "5.0", "Content": "This item meets the expectations and is quite beautiful/ The pixels makes each image sharper and more clear. The effect of the camera is like nothing I have seen! I would recommend this product and would purchase it again!!!!!!", "Date": "January 26, 2014"}, {"Title": "New traveling computer: weighs just a pound.", "Author": "Innocents Abroad \"Anglophile\"", "ReviewID": "R2Y2NSY3EUMX33", "Overall": "5.0", "Content": "Light weight, replacing laptop for travels.  Fits a travel case that also carries Kindles and cords.  Photos are easily taken and forwarded. Internet via hotel wifi very easy. Good battery life.  No surprises.", "Date": "January 26, 2014"}, {"Title": "Great!", "Author": "Amazon Customer", "ReviewID": "R3DBX9IECKRAUR", "Overall": "5.0", "Content": "I am a college student and I drag this with me everywhere!  I love it because it is compatible with office note so I can take my notes and they immediately sync so I can access them on my computer at home!  So convenient and light!", "Date": "January 24, 2014"}, {"Title": "Excellent", "Author": "Jayaram Narayanan", "ReviewID": "R2AYWTGM471DRI", "Overall": "5.0", "Content": "Do explain why you liked or disliked this product.Do compare to similar products and share how long you've used this product.Do identify specific attributes (e.g. comfort & fit of a shirt or the battery life of a camera) and whether they met your expectations.Don't describe your seller or shipping experience (you can do that at amazon.com/feedback).Don't include promotional content of any kind or reviews written in exchange for compensation", "Date": "January 24, 2014"}, {"Title": "Great gift for anyone but, especially, the tech-reluctant!", "Author": "Cathleen A. Ellers", "ReviewID": "R8MCIPYA3NZNT", "Overall": "5.0", "Content": "I bought this for my parents for Christmas.  My Dad loves it! When he’s not using it at home, he brings it with him to my Grandfather’s doctor appointments to pass the time. My Mom likes to read magazines or look up recipes and enlarge them on the screen to better view them. It works just like any other tablet or a smart phone, although I’m not sure why it’s called an iPad Air. I don’t think it is significantly lighter than the iPad2, especially, after you put a case on it. However, compared to the iPad2, it does have a bigger processor, significantly better camera and, on the downside, costs about $100 more.  I think this is a great product for those on the go, those who can’t see well and need a bigger font or for the tech-reluctant.  It was the perfect gift and worth the money!", "Date": "January 24, 2014"}, {"Title": "It's an iPad...", "Author": "Amazon Junkie \"Ricky\"", "ReviewID": "R20O8GF5CKTCGP", "Overall": "5.0", "Content": "Works as well as my full size and my wife's mini iPad .  I like the fact that it's lighter for when I'm laying on the sofa, but large enough to see without my glasses.", "Date": "January 24, 2014"}, {"Title": "Great product.", "Author": "shaikh mahiedin", "ReviewID": "R1BDTLS6ACKE0I", "Overall": "5.0", "Content": "Its great for serfing the web and family picture album. The display is awesome. Battery Life is great. Very well made.", "Date": "January 24, 2014"}, {"Title": "Great, High Quality Device", "Author": "JG", "ReviewID": "R32A722SY15A1R", "Overall": "5.0", "Content": "The iPad Air is a wonderful device. It does tasks such as web browsing, checking email, and watching movies with ease. It also has great battery life. Most of the one and two star reviews come from people who either had software problems or had problems because of user error. The software problems are not the fault of the iPad, Apple just needs to get around to updating iOS 7. I would highly recommend this device if you are searching for a tablet in the 10-inch range. The hardware is fantastic and the software can be updated.", "Date": "January 23, 2014"}, {"Title": "Great Item", "Author": "Amazon Customer", "ReviewID": "RSTC84C96OOAA", "Overall": "5.0", "Content": "I bought this for my wife. She had the original ipad and used it constantly. It was so heavy to lug around so I decided to upgrade her to the new iPad air. She absolutely loves it, the new retina display is beautiful and it weighs a full pound less. I would highly recommend this device to any one.", "Date": "January 23, 2014"}, {"Title": "IPad is IFun", "Author": "Richard Figueroa", "ReviewID": "R1UV339RXES6UL", "Overall": "5.0", "Content": "Never have been an Apple fan, but I have to admit the IPad is a fun little device. Curse you Candy Crush!", "Date": "January 23, 2014"}, {"Title": "Great Purchase", "Author": "Art Lover \"Art Lover\"", "ReviewID": "R18PG2QYWEFW0V", "Overall": "5.0", "Content": "As expected, an excellent product. Great battery life and graphics as well as availability and variety of apps.I am very satisfied with my purchase.", "Date": "May 23, 2014"}, {"Title": "Great tablet", "Author": "Ken J. Erskine \"KJE\"", "ReviewID": "R1BVVV3GVE27QB", "Overall": "5.0", "Content": "I have a kindle fire, great for books but downloading videos is hit or miss and it would not connect to plane wifi.Have not had any of those problems with the iPad.Will probably go against the grain with this comment, also have an older iPad and I don't see a difference in download speed or picture quality--- not sure the $200.00 difference is worth it for the lighter weight, but no complaints regarding it quality or performance", "Date": "May 14, 2014"}, {"Title": "Yup.  The Apple devicecount just keeps growing and growing...", "Author": "jon mceachron \"(JDMc)\"", "ReviewID": "R3AJAQ0ZFLO5OJ", "Overall": "5.0", "Content": "(Disclaimer - I am a tech researcher during my day job...)So I get to work with a lot of different tools/technologies/devices.The Apple iOS devices were a hit from day #1.  Our household acquired one of the original iPods, followed by phones, tablets, and the Apple TV.  They reproduce like bunnies!Still a little pricey - all Apple Stuff is - but cheaper through Amazon than at my local Apple store.  (And I don't have to elbow my way through the mall...)JDMc", "Date": "May 10, 2014"}, {"Title": "Very good", "Author": "lishousong", "ReviewID": "R1UROO8VBZGJYC", "Overall": "5.0", "Content": "I like the item very much! I think I will buy it again and tell my friend who want to buy it.", "Date": "May 10, 2014"}, {"Title": "Just too difficult to manage", "Author": "Michael Hooker", "ReviewID": "R234KC8JAK7HC8", "Overall": "3.0", "Content": "1st iPad. I own a Kimdle HD. The Kindle is easier to manage files. Kindle has a free App of the day, nice little perk. Apple is faster. But, all the proprietary issues, operating system, cables, and iTunes, detracts from the tablet experience.", "Date": "May 9, 2014"}, {"Title": "Great deal", "Author": "David McDonald", "ReviewID": "R32NW95IXJZNCS", "Overall": "5.0", "Content": "Good product at a price that is lower than Apple.com because you don't pay sales tax (except California I think).", "Date": "May 7, 2014"}, {"Title": "NOT BRANDNEW", "Author": "bhscr", "ReviewID": "R3EQ6K6G8O6HO7", "Overall": "3.0", "Content": "i bought get the ipad air at 4/2/2014. but after i check the imei on the new. the ipad already being active at 1/26/2014.", "Date": "April 6, 2014"}, {"Title": "Ipad", "Author": "Cyndy", "ReviewID": "R36V3S5DBBKBIM", "Overall": "4.0", "Content": "I have loved my ipad however I bought a cover for it and it fell out the door of the truck and the front shattered even with the cover on it.", "Date": "April 1, 2014"}, {"Title": "Too pricey for the unit", "Author": "Karen Ballard", "ReviewID": "R2I4I2RC7AFJOH", "Overall": "3.0", "Content": "Nice looking, well laid out system, but the wifi is very slow to load.  Would have liked a system preference pane where everything is easy to find and pull up.  I think it is overpriced.", "Date": "April 1, 2014"}, {"Title": "Love it", "Author": "James Patterson \"Helen\"", "ReviewID": "R2VDC9VL8MUQVK", "Overall": "5.0", "Content": "Brought this for my husband and he can't put it down - he loves his iPad !!!!! He had the previous iPad but loves this one so much better!", "Date": "February 22, 2014"}, {"Title": "like it", "Author": "Alexey", "ReviewID": "R26X5MINHL9AUO", "Overall": "5.0", "Content": "I don't really wanna to explain why I've chosen this item. Just like it. Very strange from my point of view to force to complete reviews...", "Date": "February 18, 2014"}, {"Title": "Excellent!", "Author": "Gustavo Achang \"Gussie\"", "ReviewID": "R1WXSQO86MO47B", "Overall": "5.0", "Content": "I'm an Apple addict and  I trust in each and every product that apple creates.  So... saying that I only can say that this new ipad air is just perfect, I bought it for my wife and she is so happy!! Thank you Apple and Amazon!", "Date": "February 16, 2014"}, {"Title": "Great Ipad update", "Author": "Mark Chicago", "ReviewID": "RZE8C16XRZVK0", "Overall": "5.0", "Content": "bought the ipad air to replace an ipad 1. much faster, weighs less and is slimmer, Meets my expectations in every way. Would recommend anyone in the market for a tablet to buy the Ipad Air.", "Date": "February 16, 2014"}, {"Title": "Great Product!", "Author": "Edgar Puga", "ReviewID": "R1C0GW6QGX6PDC", "Overall": "5.0", "Content": "I was given an iPad mini for a gift.  I fell in love with it so much that I decided to purchase a iPad Air.Its beautiful, and feels great in your hand, screen size makes a difference.I rather using it over my macbook pro.Looking forward to iPad Pro, Apple, you are turning me into  fan boy!", "Date": "February 15, 2014"}, {"Title": "Great Pad", "Author": "57moose", "ReviewID": "R1MJEMGCX8WAA6", "Overall": "5.0", "Content": "I look at all the pads and went with the IPad Air because of the many apps avaliable and I like my IPhone operating system and they are the same, it is easy to use and great for travelling", "Date": "February 15, 2014"}, {"Title": "Love it", "Author": "Steve B.", "ReviewID": "R3UGUJY2HCEN9D", "Overall": "5.0", "Content": "Had an iPad 2 and is was great but thought it was time for an upgrade.  The iPad air screen resolution is much better, battery life is much better, and processing speed to run multiple apps is improved.", "Date": "February 15, 2014"}, {"Title": "Its an iPad, what else is there to say?", "Author": "Innocent Bystander", "ReviewID": "R18GU634QWB9YM", "Overall": "5.0", "Content": "Upgraded from my ipad 2. You will definitely see the difference if you are wanting to upgrade. Don't know why apple calls it the air. Its lite but not to the point where you're like OMG. Guess they didn't want to call it 5.", "Date": "February 15, 2014"}, {"Title": "Awesome buy!!", "Author": "Chris Green", "ReviewID": "R2J203W8MFIJ6P", "Overall": "5.0", "Content": "This was a great buy. Was a little anxious about getting it from a seller on Amazon but it turned out better than I could imagine..  Knightrider was great!!  Good price, item was just what was advertised and it was sent so quickly!!!  I was able to take it on vacation with me right away.  Was worried I would have to wait until after my vacation to get it but Knightrider came through.  Thanks so much.  Would highly recommend for anyone and will definitely buy again from this source, thanks!!!", "Date": "February 12, 2014"}, {"Title": "Estatic Niece", "Author": "Sharon", "ReviewID": "R3F9FWP7R8O6Y9", "Overall": "5.0", "Content": "Bought this as a Christmas Gift for my niece and she is so excited and just loves it.  Great Job", "Date": "February 12, 2014"}, {"Title": "Great Tablet", "Author": "rogerbrad \"Tell us about yourself!\"", "ReviewID": "RIBISGH1MK23P", "Overall": "5.0", "Content": "I got exactly what I expected. A bigger than life iPhone that you can't make telephone calls on. :-) That's what I wanted as all the apps I had on my iPhone transferred seamlessly from the cloud to the new iPad.", "Date": "February 12, 2014"}, {"Title": "It is a great product!", "Author": "Jennifer Martinez", "ReviewID": "RGALICKAT2UTH", "Overall": "5.0", "Content": "Have used an Ipad 2 and this is so much nicer.  Better resolution, good screen size, but still nice and compact.", "Date": "January 9, 2014"}, {"Title": "Great", "Author": "LGH135", "ReviewID": "R2AWQSZTBNX3IV", "Overall": "5.0", "Content": "I love it - wasn't sure how i'd feel about this new version but it's perfect.  Much better than previous versions.", "Date": "January 9, 2014"}, {"Title": "Apple iPad Air", "Author": "Frances Tungate", "ReviewID": "R36ETWZHZ0X8B2", "Overall": "4.0", "Content": "I gave away a full size laptop, and got the Ipad Air.  I love it...It's easy to hold, and I can surf the web, play games, check e-mail, and write documents, and take pictures anywhere. I rarely used my laptop, but I use the iPad Air every day. I highly recommend this product.", "Date": "January 9, 2014"}, {"Title": "AWESOME", "Author": "yo", "ReviewID": "R2C6DMQ690WQ6Y", "Overall": "5.0", "Content": "My husband loves it.  I have an IPAD 2 and I am jealouse of him!!!  It is a great gift and worth the money but of course if they ever became cheaper I would buy another!", "Date": "January 9, 2014"}, {"Title": "wonderful", "Author": "Michiko W.W. Campbell", "ReviewID": "R240EMR4EULFL2", "Overall": "5.0", "Content": "never  had a doubt. This product is complete what i expected and i am glad i purchased. The color and size of the product is very durable as well. its fast and easy to work with best product ever", "Date": "January 9, 2014"}, {"Title": "Amazing!!!!", "Author": "cheryl miller", "ReviewID": "R2WQTF0KC36F96", "Overall": "5.0", "Content": "I'm on this daily! Love love love it!! So happy with this purchase!  I'm so glad I choose my iPad over all the other choices!", "Date": "January 8, 2014"}, {"Title": "Cool", "Author": "Dean G.", "ReviewID": "RJ3I2LSMP3FNA", "Overall": "5.0", "Content": "My first IPad and it's the air I love itLook forward to get iPhone 5sSoon happy new year", "Date": "January 8, 2014"}, {"Title": "It's and Ipad!", "Author": "Robert A Griner JR", "ReviewID": "R3QFTIMXP9EM7K", "Overall": "5.0", "Content": "What more can you say about an Ipad.  It is my wife's Christmas present.  She loves it.  She works at a large University and has long been involved with Apple.  This is her first personal tablet and she loves it.  It has met all of her expectations.", "Date": "January 8, 2014"}, {"Title": "If you want easy, this is it!", "Author": "Dolores P.", "ReviewID": "R26GB958NKUO7V", "Overall": "4.0", "Content": "I bought the iPad Air having never had a tablet previously. I had just recently bought the iPhone 5c and decided to try the all-Apple experience. So glad I did. The iPad is crazy easy to use, has a great screen, and syncs all my photos and apps seamlessly with the phone. I am no a technical guru, so I appreciate something that is simple to use and easy to transport.", "Date": "January 8, 2014"}, {"Title": "Great Christmas present!", "Author": "Sarajo Esch", "ReviewID": "R2JB2RHZAK4TUP", "Overall": "5.0", "Content": "Still learning to access all the great features. We are really enjoying the many features on this ipad. Delivery was very prompt.", "Date": "January 7, 2014"}, {"Title": "I upgraded from the iPad 3 and LOVE the Air!!!", "Author": "vp", "ReviewID": "R2PU7S0PQUD5R9", "Overall": "5.0", "Content": "I bought the original iPad on day one and can't imagine life without my pad.  I use it for work, for play and everything in between.  The form factor on this iPad is excellent and I wasn't expecting it to make such a difference - it DOES.  I love the feel of the mini, but I need my big screen (video editing for example).  This is the perfect size - it's really a 'bigger' mini, if that makes sense.  I can't say enough great things about it.  LOVE!!!!!!!", "Date": "December 24, 2013"}, {"Title": "Just Impresive!!", "Author": "Mitchell Castillo", "ReviewID": "RCADSPX1H4OJL", "Overall": "5.0", "Content": "Wow, it was just how i expected! definitely it's the best iPad!!!!! (tablet), the weight it's super! the design just marvellous. One of the best product that I ever had.", "Date": "December 19, 2013"}, {"Title": "Great product and service", "Author": "Israel Besser", "ReviewID": "RG5N00TRC4GKS", "Overall": "5.0", "Content": "Love it, was delivered on time and it met all expectations and more, am thrilled. Would recommend it to anyone I liked", "Date": "December 17, 2013"}, {"Title": "light, fast and easy to hold but...", "Author": "redrover", "ReviewID": "R2AMP35V25L8MI", "Overall": "3.0", "Content": "UPDATE 11182013:A number of comments seem to take issue with my statement of \"not feeling like glass\" but that is JUST MY PERSONAL FEELING. Others about the brightness...indeed I do have it cranked all the way up but the brightness is nowhere as bright as what is found on the Samsung Note 10.1 2014 edition, nor the iPad4 and my most recent purchase the Samsung Note 8. All 3 when cranked all the way up are much brighter than the iPad Air.I will be buying the new Google nexus 7(even with all the GPS and multi-touch issues) for the upcoming holidays but even in the store, that too seems much brighter...I am very dismayed at this lack of brightness from the Air but it is still more than adequate for indoors. I have not tried it outdoors nor will I as this is not my \"outdoor\" tablet...lol.I like Apple and the tight integration of their apps and the reason many including myself continue to buy their products. I do feel the price for this latest iteration is them trying to make money at our expense. WHO HERE DOES NOT KNOW IN THEIR HEART THAT APPLE IS TRYING TO GET IN ON THE CHRISTMAS RUSH AND PUT THE AIR AND THE NEW MINI WITHOUT THE FINGERPRINT FEATURES FOUND ON THE NEW IPHONE...COME MARCH MAYBE APRIL, APPLE WILL UPDATE THE IPAD AIR TO INCLUDE THAT FEATURE.I will continue to buy Apple mostly because their store has apps that are better, with more choices and work extremely well with their devices. I think this product is a 3 1/2 Stars at best and mostly for the size and weight reduction that is very significant. I feel the \"glass\" is too thin but seems to be durable as I have really been typing a lot on it as well as playing several games that require a lot of tapping. I am very happy with the size reduction but feel the brightness is not up to par with other new tablets or the iPad4.Recently the Safari browser has been \"crashing\" a lot over the past week in that when you tap on a hyperlink, the browser will basically disappear off the screen. None of the tabs close but it just disappears and returns you to the home screens. I also am finding the browser will get stuck/freeze for several minutes before resuming. I have several calls in with apple support and they are looking into the issues.Other issues is the VIDEO app, if you play a video via streaming not downloading and leave it somewhere like the middle or so on, it actually reduces your available memory by the amount you have watched from what I can glean. IT IS LIKE DOWNLOADING THE MOVIE TO THE POINT YOU HAVE WATCHED IT TO EVEN THOUGH YOU SELECTED THE STREAMING LINK. If you do this with several movies, you can basically wipe out your free memory. I find it difficult to clear the buffer and have basically learned to tell the app not to display any movies then to display movies then play the movie but move the slider to the beginning and press stop playing then done. Of these many steps I eventually clear the buffer but I am not sure which of all these steps actually is what does it if any!Oh lastly, the WI-fi is fantastic.FINAL RATING IS 3 1/2 STARS...MAYBE 4 IF NOT FOR THE BRIGHTNESS ISSUE.First I own iPad 2 and 4 and Samsung Note 10.1 2014 edition.I like...not love...the new iPad Air as it is faster both in operating the software apps and graphic intensive apps. The apps continue to be fantastic for all the pads not just the Air.Apple did a great job on the weight but FEEL STRONGLY THAT THE NEW SCREEN IS NOT NEARLY AS BRIGHT AS MY iPad 4 NOR DOES IT EVEN FEEL LIKE GLASS.As I type this review on the Air, the \"cheap tapping\" feel of this glass leaves me wondering how durable this glass is. It feels thin and makes a tapping sound not found on the more solid glass on my other two iPads.Oh I am keeping the Air for the faster processors but feel Apple has put out a product whose screen will not be as durable as prior pads.I can see it flex when I push down on it with minimal effort and have some light distortion when I press down like old type LED TVS.Apple over prices their products because they can and really did so on this iteration of their iPad. In my estimation the glass feels like plastic and the brightness is much diminished when compared to my iPad 4 and so must have a higher profit margin with all these cost cutting that resulted in a new iPad that for all practically purposes is just faster but not as solidly built as prior pads.Time will tell on the screen and maybe this is the way all tablets are headed to achieve the weight reduction and thinness. I love the ability to hold the Air in one hand comfortably for much longer than any of my current tablets. I am OK to sacrifice the glass quality as long as the touch screen does not suffer or long term screen reliability.I wish Apple would splurge and include a 6 foot charging cord...OMG $600 for 32GB and the cord is so short still after all this time...lol.", "Date": "November 8, 2013"}, {"Title": "They Sent me a used iPad......WTF????", "Author": "Marcus Scott-Morgan", "ReviewID": "RUZ0K3ME024YE", "Overall": "1.0", "Content": "I cant believe these guys had the nerve to send me an iPad air with no factory seal around the unit.I then proceeded to charge the iPad for the first time.  Reach in the box for the cable to find that the lightning cable had a tinge of smoker yellow to it with major kinks in it.I cannot believe that i was able to purchase this piece of junk form these crooks.  How can it be OK to treat a consumer like this who spends upwards of $500 on a product.Do not purchase from these guys.  I have reported this to Amazon, and have been refunded already.  YOU GUYS ARE REDICULOUS!!!", "Date": "June 4, 2014"}, {"Title": "Please describe the item clear", "Author": "Zhiyi Li", "ReviewID": "R2SP6AKRCXBNXT", "Overall": "3.0", "Content": "I got the item 8 days later after I ordered it, fair enough. However, it was describing as a new item but the box already being opened. Also the original screen protector is missing, which means somebody must used it somehow. But the most awful part of this IPAD is somebody set up a freaking code for lock of screen.", "Date": "January 17, 2014"}, {"Title": "Great toy/lousy writer-researcher tool", "Author": "Windsail", "ReviewID": "R2ZHK9VDIKO0B6", "Overall": "1.0", "Content": "I am a longtime MAC user and fan, but this expensive toy is a great disappointment. I was led to believe that document file transfers would be easy between my MacBook Pro and the iPad. Wrong. Wrong. Wrong. The two machines cannot be directly connected. To send a doc you have to do it via an e-mail attachment or iCloud. Use e-mail and formatting is lost unless you use  iWork, and that does not have many of the capabilities of Microsoft Word. You even loses page numbers when transferring Microsoft Office docs--a pretty basic function. The ironny is that MSOffice is designed for MAC! There are third party workarounds that are very cumbersome. So much for MACs elegant design brags.  The alternative is the Cloud which also only syncs docs made in iWork. As for photo transfers, unless you have the same bandwidth as NASA, forget it. Apple--wouldn't it just be simpler to create a USB connection? Not too much to ask for in an excessively expensive machine. If you want a lightweight machine to play a few games or read a newspaper this is the machine for you. For a professional writer, forget it. Apple--you've just lost a longtime fan--and I mean longtime…", "Date": "January 16, 2014"}, {"Title": "Good", "Author": "Carlos Ghersi De la Cruz Taquire", "ReviewID": "R3W2O5CE1OALDW", "Overall": "3.0", "Content": "Just came with charger that's all . No manual , don't have any needle for open the sim case. But work well", "Date": "February 10, 2014"}, {"Title": "Just Excellent Tablet", "Author": "Ali Al-Siraih", "ReviewID": "R1SMPMS80BDW0G", "Overall": "5.0", "Content": "I's just an Excellent Tablet and with a unique design.. and really like AirI recommend buying from this seller.", "Date": "February 4, 2014"}, {"Title": "Apple iPad Air", "Author": "Wayne Goeas", "ReviewID": "R92E3AY365PSO", "Overall": "5.0", "Content": "My wife loves it! Very light in comparison to the older generation and processor is very fast. Nice to have the extra storage (64 GB). Delivery was as stated....speedy delivery!", "Date": "February 2, 2014"}, {"Title": "The iPad didn't work properly", "Author": "JcTenn", "ReviewID": "R2RLLJ5CJOK5MI", "Overall": "3.0", "Content": "I had to take it to the Apple store where they replaced it, but told me that the warranty began upon original purchase.  The iPad was new,but had been purchased by the person who sold it to me.  It all worked out, but be aware and ask about warranty info before purchasing to make sure you're covered. I don't think it was due to any wrongdoing or misrepresentation of the seller, just some due diligence.", "Date": "May 11, 2014"}, {"Title": "It works", "Author": "Gordon Campbell", "ReviewID": "R1X9MFNRUPZ173", "Overall": "3.0", "Content": "Suits the purpose for what we bought it for. I think the prices are a bit exhorbitant, they could probably increase their market share if they lower the prices for the higher capacity versions.", "Date": "May 10, 2014"}, {"Title": "Apple IPadAir 16 GB Wi-Fi White Silver Newest Version", "Author": "nancy m schiffman", "ReviewID": "R1Y71SU7ZXTVHR", "Overall": "5.0", "Content": "I am writing to comment on how pleased I am with my new I-PadIt is easy to handle and navigate, making it lots of fun.", "Date": "May 10, 2014"}, {"Title": "it's ok", "Author": "Marbo", "ReviewID": "R2MITTZVT1SJTP", "Overall": "2.0", "Content": "It's sleek and nice looking but does not put the ipad to sleep every time.  i have to go back and check it.  So what's the point?", "Date": "April 29, 2014"}, {"Title": "I tried it because it's the newest version.", "Author": "Stavros \"Woma\"", "ReviewID": "R1FLSY7RAEYO6G", "Overall": "4.0", "Content": "It was a little too small for me, so I bought the iPad 4 and I could not be any happier. I guess it depends on what you're expecting and your personal tablet needs.  In addition, there are so many more products that are compatible with the iPad 4 and they seem to fit it much better.  On the good side, I recently became an Apple person after years of being an HP and other Android type computers.", "Date": "February 15, 2014"}, {"Title": "Great!", "Author": "GDA6186", "ReviewID": "R2902ILP6C105N", "Overall": "5.0", "Content": "Received the iPad just as expected. If there is any criticism I might have it would be that the product appeared to be packed very lightly. As in there was not very much padding for shipping. I received everything in perfect order, but the package appeared as though if it had been dropped or handled roughly there could have easily been damage to it. Nonetheless there was no damage, so I am completely satisfied.", "Date": "February 5, 2014"}, {"Title": "Love it", "Author": "Jan", "ReviewID": "R1GAW4N2PJ61ZB", "Overall": "5.0", "Content": "Received the very next day and can't seem to put it down.  Wish I had brought the 32GB I watch lots of movies and listen to lots of music.", "Date": "February 4, 2014"}, {"Title": "ipad helps me in my real estate business", "Author": "James J. Trapasso \"jmyjo\"", "ReviewID": "R3SHIC92KPS6HA", "Overall": "5.0", "Content": "I am very pleased with the ipad.  I use it for my real estate business.It  provides me with a great deal of information that I can easily share with my clients.", "Date": "February 4, 2014"}, {"Title": "good", "Author": "soso", "ReviewID": "R3NJCA5M7JPPSD", "Overall": "5.0", "Content": "great this is useful for me. because i need this thing long time, and it is great. really good thing", "Date": "February 4, 2014"}, {"Title": "good purchase", "Author": "Linh", "ReviewID": "RZWGSTJ3VP307", "Overall": "5.0", "Content": "So far so good! The ipad arrived earlier than I expected and up to now, it has been working just as efficiently as I expect it to be. Good purchase", "Date": "January 31, 2014"}, {"Title": "Breaks VERY EASILY. NOT EVEN A LITTLE DURABLE", "Author": "Theodore Harris", "ReviewID": "R2C6EO9UPPLCRU", "Overall": "1.0", "Content": "Dropped it 2 feet. Landed on the SIDE and it made a crack. NOT A HAIR LINE CRACK but a HUGE Crack on the screen. There is ZERO DURABILITY in this tablet. I also found out its HOLLOW in the areas where the camera is... Apple you suck!", "Date": "May 26, 2014"}, {"Title": "Great iPad", "Author": "jacksonw765", "ReviewID": "R3F9G5XEL7TEKT", "Overall": "5.0", "Content": "Great apple devise, I used it to write this review! Highly recommended. Very light and very powerful, but you want to get more than 16gb.", "Date": "November 17, 2013"}, {"Title": "Poor Product", "Author": "Alan Dale Daniel", "ReviewID": "R368KCEO7IGJGJ", "Overall": "2.0", "Content": "My thoughts on the latest ipad Air from Apple.  First, try to buy the product through Amazon.  If you get lucky you will avoid 38+ dollars in taxes.  In my state I get charged that anyway.  I bought mine a few weeks ago and I now regret my decision.The ipad Air, full size not the mini, is expensive for what you get.  The much talked about retina display really isn’t much better than Apple’s or Samsung’s normal display.  I take a lot of photos and even at full zoom I can’t make out much difference.  The Apple ipad Air does NOT come with an SD card slot, and if you want to upgrade from 16gb to 32gb you will be looking at over $100 additional dollars.  Many of Apple’s competitors have the SD slot and cost less.Apple sells an SD card “reader.”  You can download from the card to the ipad but NOT the other way.  And the ipad SD card reader will run you $30 plus dollars.  You must buy other $30+ dollar accessories if you want to use a USB memory stick for example.  I purchased a non- Apple SD card triple reader (USB and SD for example) for about $9 dollars.  The machine complains at me but it still works (but, once again, it only loads to the machine not from the ipad as a normal SD slot does).An SD card reader would have been easy to install as part of the iPad, and this gives their competitors an edge, especially when one is taking photographs and trying to download them immediately to examine on something other than a 2 inch screen.  As I shoot RAW (large files) photos with my Canon this inability to use an SD card is a real pain.Downloading music from Amazon to iTunes isn’t any picnic either.  My wife has an android device from Dell running Jellybean and she downloads everything with zero problems.  Plus, she has an SD card slot which really helps.  Her screen is as sharp as mine.Finally, the OS systems.  Jellybean has about a million apps written for it while I have about 200 - or that is how it seems to me.  Her system is faster than mine AND her system is intuitive and mine is not.  I’ve had to read over the Apple manual for ipad three times trying to get things done.  Maybe my largest gripe is I bought the Apple thinking several Apple machines could sync up and trade information easily including photographs and music and documents.  Wrong.  I’ve tried numerous syncing ideas and none of them work.  I started using Pages (an Apple word processing program) instead to Word to get it to transfer.  Finally, I saved it to the cloud and managed to get the document to the other machine.  Photographs that are in the photo stream do transfer; however, getting the photograph into the stream when it was not automatically placed there by the ipad doesn’t work.  And finding photos to look at in the ipad, when the ipad did not take the photo and the photo is on another machine (with the photo stream on and home sharing on) the photo still does not come up.  Very frustrating.After using the ipad and watching and using Jellybean and Android in action I think the Android devices are a much better deal.  Get one with an SD card slot.  I am certain Apple has designed their machine so the user cannot get extra storage on the machine (as an SD slot would allow) and must buy a more expensive machine if they handle large files.  If you like buying music at Amazon good luck getting it to iTunes onto your machine if it is an Apple (Yes, I have Amazon cloud player).  My wife got her music downloaded in about a minute.  It took me an hour to get one of Mozart’s songs I had purchased downloaded to my computer.In retrospect, since the programs do NOT sync up as advertised, the machine has little storage unless you pay an enormous additional price, the retina display is not revolutionary, and the number of programs are minimal compared to Android I wish I had purchased an Android.  Samsung seems to be on the cutting edge there, although my wife’s Dell is performing just fine.", "Date": "February 12, 2014"}, {"Title": "Apple iPad Air", "Author": "Oscar Crumby", "ReviewID": "R1LFVGKI48DRB6", "Overall": "5.0", "Content": "I would recommend this product to anyone that is looking for a tablet.  I have found it has met all my expectations.  The only problem I had with it is the necessity for a keyboard.", "Date": "January 25, 2014"}, {"Title": "Quickly", "Author": "YU Chen Yueh", "ReviewID": "R3C50D7ANEBMWR", "Overall": "4.0", "Content": "Good and quickly but the package in the left up cone has little crease. Hope next time to protect more good.", "Date": "January 7, 2014"}, {"Title": "Good", "Author": "Artem Lobovskiy", "ReviewID": "RJSHKSB0EGT2D", "Overall": "4.0", "Content": "This is a good tablet PC, display is the best! But iOS 7 make it not so fast as I expected.", "Date": "January 7, 2014"}, {"Title": "Enjoy iPad Air so far", "Author": "Brenda Williamson", "ReviewID": "RWPAMZPV65U5", "Overall": "4.0", "Content": "Bought as gift for my husband.  He likes it so far, said little heavier than he thought it would be. Still too new to really rate how it preforms for the long term.", "Date": "January 4, 2014"}, {"Title": "This is an iPad review", "Author": "hrhomer \"hrhomer\"", "ReviewID": "R2QICQPO763RU0", "Overall": "5.0", "Content": "I ordered an iPad Air, and got exactly what I wanted. An iPad Air. It works very well. eighteen nineteen twenty.", "Date": "December 21, 2013"}, {"Title": "unexpected.", "Author": "jay endiape", "ReviewID": "R2TJY0U0OC5ENC", "Overall": "3.0", "Content": "did'nt figure it out that this will be smaller than my previous Ipad2 and almost no difference for having a retina featrure. if there's an available Ipad2 i'm defenitely getting one again.", "Date": "January 18, 2014"}, {"Title": "Getting T-Mobile service activated is apparently IMPOSSIBLE", "Author": "Anthony Berno", "ReviewID": "R2CANZFJ2C72MG", "Overall": "2.0", "Content": "This has been a bit of a disappointment. I purchased the iPad Air with T-Mobile service directly from Apple, and when I try to set up my account, it informs me that \"my zip code is not valid\". (It's 95482, which is Ukiah, California, and from the connection indicator on the screen, we do seem to have 4G service here.) I spent 45 minutes on the phone with T-Mobile support to try to resolve this and was informed that I had to spend $10 on a new SIM card, which I did. On receiving the new card, the problem was not resolved. I called support again, and was shuttled from one line to another and finally disconnected. Nobody seemed to know what was going on or how to help me.This is really annoying. I'm a professional software engineer and have a lot of experience with mobile devices, and have never had to deal with this kind of runaround before.Add to that the fact that Safari crashes about once per hour, and I have to say this device is a big, expensive dud. Thin and light, yes, but in every way inferior to the iPad 3 I have already. Overall, a regrettable purchase.", "Date": "December 19, 2013"}, {"Title": "NO SIM CARD", "Author": "James P Solan", "ReviewID": "R28XWV64DOMIHO", "Overall": "1.0", "Content": "I recieved this product and it was missing the AT&T; SIM card I dont understand how you can not have the card in type of Apple product. Who is QA this when it leaves Apple?", "Date": "April 2, 2014"}, {"Title": "Not what I expected.", "Author": "bajangna \"bajangna\"", "ReviewID": "R1RSUPL9K57KEB", "Overall": "2.0", "Content": "This Ipad air is not for who love surfing internet, it crashed all the time. Very annoying. Apps mostly good. Design is great. But It's not worth even I got 32GB model for 515 included tax. Buy it for my girl. Wish it will be the best gift. No it's not.", "Date": "December 26, 2013"}, {"Title": "Does not stream Netflix in hd", "Author": "SpaceCat", "ReviewID": "R2P1VQC10SKXPX", "Overall": "2.0", "Content": "I bought this product primarily to stream movies and videos.  Although the screen is fantastic, and obviously built for HD, Netflix appears in a quality even lower than standard definition.  I have done a lot of research, and discovered a lot of folks are having this issue with the iPad Air.  After troubleshooting and trying all the fixes I could find, this is a dealbreaker for me, and it is getting returned. If you don't have Netflix, you might not notice this flaw.  Other streaming services seem to work okay.  Netflix told me it was an Apple issue.Although not a dealbreaker, I was also surprised how fast the battery drained on this device after hearing it praised in reviews.", "Date": "December 1, 2013"}, {"Title": "Apple Ipad air", "Author": "Luz Montoya", "ReviewID": "R1Q7KH84C44YNY", "Overall": "1.0", "Content": "I asked for an ipad air black with space gray. When we open the box: SURPRISE!!  They send me a white one! I didn't spent $10 dollars for this... They have to send what I asked for...", "Date": "May 31, 2014"}, {"Title": "I need a USB port ???", "Author": "Charlie P.", "ReviewID": "R9CGKSVPE7QDE", "Overall": "4.0", "Content": "I have the newest ipad but would like to purchase the ipd air 128GBI would like to use it for work docs to work at homeI would like to copy docs from work on a stick and download to my ipad airTell me is this possible. Is there a USB port on an ipad air", "Date": "January 4, 2014"}, {"Title": "Big improvement in design, little improvement in Safari crashes.", "Author": "Ken H.", "ReviewID": "R3NT1XHW2KQFGE", "Overall": "2.0", "Content": "Upgrading from an iPad one I have to say that overall this is a very good machine. My main disappointment is that Apple did not add more RAM. While the machine does not crash as much as my iPad one did, Safari crashes on me at least 2-3 times a day. At a cost of about a dollar Apple could add an extra gigabyte of RAM to this device and make it much more valuable to the consumer.", "Date": "November 21, 2013"}, {"Title": "Wow so many gigabytes!", "Author": "Drew Bandas", "ReviewID": "R2QMQMLEXKFPCB", "Overall": "5.0", "Content": "I have never owned this product, nevertheless it's a fantastic product. It is very expspensive but worth it! My sister is shopping for an IPad and this would be perfect it even has a touch screen! Wow! I'm sure if I owned this I would use it for various activities, such as ordering Chinese food or watching Garfield 2. What a great  movie, I can't believe a movie about a cat that like lasagna could be such a cinematic masterpiece. Back to main idea here, this is supposedly a great product, and I say wow!", "Date": "March 15, 2014"}, {"Title": "Not Overjoyed", "Author": "Amazon Customer", "ReviewID": "R1AVQNOU7NSTV7", "Overall": "2.0", "Content": "Purchased the iPad Air for my son who plays with it all of the time.  We had to reformat or reboot it last week already because it was frozen and would not turn on at all.  After the reboot or reformat it has worked fine ever since.  (Pushed the circular button on the bottom and the main startup button on the top right corner at the same time and held until unit started up again)", "Date": "January 2, 2014"}, {"Title": "Great!!!!", "Author": "Sean Slawik", "ReviewID": "R1CRLDM6WXA8P4", "Overall": "5.0", "Content": "Product came in an orderly fashion. Didn't get to use it because it is a Christmas present, so I will update this review once it is opened and being used", "Date": "December 10, 2013"}, {"Title": "iPad Air", "Author": "Petra E. Pershall", "ReviewID": "RH0NQSVS250M4", "Overall": "2.0", "Content": "I just purchased the iPad Air as a Christmas present for my grandson and so far I have had several problems with it.  I cannot get it to connect to my home Wi-Fi and had to have my business tech person work on it.  It was plugged to charge since before noon yesterday and as of 6 a.m. today, it had only charged 99%.  I have a iPad 2 and an iPad 4.  I wish that I had purchased one of those instead of the Air.  Hopefully, it won't crash on Christmas Day b/c my grandson is only 5 and won't understand why it doesn't work.  He uses my other iPads with no problems.", "Date": "December 23, 2013"}, {"Title": "I tried but wasn't for me", "Author": "Carter \"O.C.\"", "ReviewID": "R3L8JINUOZZDB5", "Overall": "3.0", "Content": "It's not a bad tablet by any means... one of the best BUT i'm slightly annoyed that it doesn't have the features i'm so use to using. My friend got me this as a gift to try to win me over to apple products... I gave it a go but It's just not for me. I decided to stick with my Samsung Galaxy Note 10.1 2014... I love using two screens at once.Pros: Really just the new design although I tend to have issues with the new bezel when holding it, you have no choice but to have one finger on the screen which sometimes causes issues with apps. and its smooth which is greatCons: Not enough features,  and boring. This was cool years ago but with tablets out there that allow multi screen and other amazing stuff...I gave it a go guys, and I really wanted to not be bias in my review. Hopefully you were able to see that. I think if you like the other Ipad's you will be happy with this for sure. If you want a much more amazing experience then i'd say go with the Samsung Galaxy Note 10.1 2014 or even a surface tablet.", "Date": "November 3, 2013"}, {"Title": "great product", "Author": "Antonio", "ReviewID": "RF16B60SXC48", "Overall": "4.0", "Content": "I love my new ipad, is just as advertised and it arrive very quick my only complain is that fedex leaved the package on my terrace when I wasn't home, wick really pieced me off", "Date": "December 22, 2013"}, {"Title": "totally wrong colour", "Author": "Amazon Customer", "ReviewID": "RCLGKZX3C2LD9", "Overall": "1.0", "Content": "I don't understand ， i need a black one 。 why i got a white one ？ don't you have a good sense of colours ??", "Date": "May 16, 2014"}, {"Title": "Amazon deleted my negative review", "Author": "Vertigo", "ReviewID": "R1UTMBI6P2JE9W", "Overall": "1.0", "Content": "Apparently, Amazon is sandbagging the reviews here.  My first review of the iPad Air was deleted.  Ergo, I'll repeat my original statement.Nice tablet with a fatally flawed web browser problem. My iPad Air started with Safari crashing right out of the box. I put up with it for a month and then had it replaced by Apple under warranty, however, the problem continued. The experts at the Genius Bar said the problem would be fixed in iOS 7.1. After upgrading to 7.1 today the issue persists. Puffin browser seems more stable but still crashes on occasion. Apple's failure to fix this is unacceptable.", "Date": "March 13, 2014"}, {"Title": "very frustrated that I cant get it to work.", "Author": "Jan", "ReviewID": "R24KH2CVR917CM", "Overall": "1.0", "Content": "I cant get it connected. The instructions don't help a non techie at all. Not an out of the box product.", "Date": "February 10, 2014"}, {"Title": "Stereo anyone?", "Author": "David R. Marcus \"dmarcus1260\"", "ReviewID": "RDUX5RQEHAHJ2", "Overall": "3.0", "Content": "I purchased my iPad Air directly from Apple and then returned it without ever using it.  I was very disappointed to say the least when I learned the stereo speakers were on the bottom of the device.  What was the design team thinking?!!?  Obviously the iPad Air is a rushed product.  My review is not to bash the device.  Heck I love Apple.  I have an iMac, MacBook Pro, Classic iPod, Apple TV, and have owned an iPhone 3, 4 and currently own the iPhone 5.  The thing is I can not justify spending hundreds of $$$ on a product that should have been designed better.  Hopefully in 2014 the next iPad Air model will put the S T E R E O speakers on the FRONT of the device.UPDATE 12/4/2013: I just came back from The Apple Store to make it \"official\" that I have used an iPad Air.  Yes the iPad Air is thinner than previous iPad models and it may be faster.  Honestly I didn't see much of a difference in speed between the iPad Air and the iPad 4 while surfing the web.  That said I still see no reason to get an iPad Air if you already own an iPad 4.", "Date": "November 28, 2013"}, {"Title": "I Really, Really Wanted To Like The iPad Air", "Author": "MARCIA", "ReviewID": "R2UL04RH6CL3X1", "Overall": "2.0", "Content": "I really, really wanted to like the iPad Air, but It just wasn't for me. I was looking for a replacement for my 2008 white Macbook, which I loved. The iPad Air is NOT, repeat not a laptop replacement. I don't have heavy computing requirements, but the brand new iPad couldn't do a number of BASIC things my 5 and a half year old Macbook does with ease.The most important is multitasking. The iPad can only do one thing at a time. Only one window or app can be open at a time. Seriously? iPad doesn't do flash player, so any number of things (like watching certain youtube videos,etc) can't be done.I found the touch screen to be inconsistent. I was constantly having to enlarge links to be able to click them properly. I was also disappointed with the small amount of included apps.Now the good: If you want a portable device to check email, browse the web, take pictures,etc and you tend to do one thing at a time, the iPad may work for you. The retina display and the fit and finish of the iPad are excellent. It is light, thin, fast, and beautiful. Siri is included and works well.I love Apple products, but I found the iPad to be underpowered and lacking versatility. If you're looking for a laptop replacement, I couldn't recommend it. I ended up returning it and got a Macbook Pro instead.", "Date": "December 3, 2013"}, {"Title": "I want to give zero if I could!", "Author": "Hao Wang", "ReviewID": "RC2HQ6Q43B1F4", "Overall": "1.0", "Content": "How can they get the permission of selling on Amazon?! Can the service be more worse than that? I ordered it a week before the Christmas day, while waiting for more than 2 week without any progress. I contacted the seller several times, but nobody gave any response. Don't order anything from them if you would not want to waste your money.", "Date": "May 28, 2014"}, {"Title": "I Love It!!!", "Author": "David Velte", "ReviewID": "R2350WQV4OCRDW", "Overall": "5.0", "Content": "I bought an Ipad 1 on release day. I loved everything about it except the weight. But. It was still my beast friend. I just purchased a brand new Ipad Air. All I can say is WOW! It is thin, light, beautiful and sexy! The screen is amazing! Apple has a huge success on it's hands. It is lightning fast. The battery life is great. I have had mine either on or on standby for three days now and I still have 25% battery life left. I would recommend this tablet to anyone looking to improve their business and pleasure experience! If I had to do it all over again, I would buy the Ipad Air.", "Date": "November 13, 2013"}, {"Title": "Just ok", "Author": "Kimmy", "ReviewID": "R3RZZIP3RS6P5N", "Overall": "3.0", "Content": "Given the competition from Samsung Apple scores low. I own both a Samsung Note 10.1 and the wife owns the Ipad air. She is returning the Ipad be cause it is not as great as my Note 10.1. If I had bought this 2 years ago the competition to the ipad was barely there. Now Appke has to tey a little harder to catch up again.", "Date": "December 2, 2013"}, {"Title": "I tried but wasn't for me", "Author": "Carter \"O.C.\"", "ReviewID": "R1DESD22LJW71S", "Overall": "3.0", "Content": "It's not a bad tablet by any means... one of the best BUT i'm slightly annoyed that it doesn't have the features i'm so use to using. My friend got me this as a gift to try to win me over to apple products... I gave it a go but It's just not for me. I decided to stick with my Samsung Galaxy Note 10.1 2014... I love using two screens at once.Pros: Really just the new design although I tend to have issues with the new bezel when holding it, you have no choice but to have one finger on the screen which sometimes causes issues with apps. and its smooth which is greatCons: Not enough features, and boring. This was cool years ago but with tablets out there that allow multi screen and other amazing stuff...I gave it a go guys, and I really wanted to not be bias in my review. Hopefully you were able to see that. I think if you like the other Ipad's you will be happy with this for sure. If you want a much more amazing experience then i'd say go with the Samsung Galaxy Note 10.1 2014 or even a surface tablet.", "Date": "November 5, 2013"}, {"Title": "Don't worth the money I pay for it", "Author": "Adriana Martinez Rodriguez", "ReviewID": "R36IG33P31B3UA", "Overall": "1.0", "Content": "Really disapointed with only wifi model... I gonna sell it to buy a 3G model. The size is not a big difference between old models", "Date": "May 2, 2014"}, {"Title": "I DID NOT RECEIVE THE IPAD  FROM THIS ORDER", "Author": "Cooks Saw Manufacturing LLC", "ReviewID": "R3NTH85DEDDSB9", "Overall": "1.0", "Content": "I WAITED FOR 4 WEEKS AND THEN , I HAD TO PURCHASE FROM ANOTHER SOURCE.  I was not happy with the way this order was handled.", "Date": "January 20, 2014"}, {"Title": "Product was stolen/fraudulent per tmobile", "Author": "skcrowe", "ReviewID": "R3CFI2FL2ZO85U", "Overall": "1.0", "Content": "I was unable to connect to cellular data after adding the iPad air to my plan.  When I called tmobile to find out why, they checked the iPad's IMEI number and told me that it was blocked due to fraud and I should send it back and get a refund as soon as possible!  I contacted amazon.com's fraud department when I hung up the phone!  I am not happy at all!", "Date": "January 2, 2014"}, {"Title": "So revolutionary they can't even throw in a camera flash.", "Author": "Bubba", "ReviewID": "R258CLLTLZRDAG", "Overall": "1.0", "Content": "Don't believe all the reviews out there saying the ipad Air is the better tablet. Those reviews are biased and only bring up the minor upgrades from the old ipad and base the comparisons off of those few things. And the only two really bad things they had to say about the ipad Air was that it didn't have a fingerprint scanner and it didn't come in gold. The 80's called and they want their gaudy flashy gold bling back.Most of these reviews will only focus on those points and will not mention all the other advantages the Surface 2 has. And for the few reviews that do mention the other features the Surface 2 has, they still favor the ipad because the camera was nicer or more apps. Really?I will use the Surface 2 as comparison because it will show how ridiculous the bias is regardless of capabilities.What the reviews usually leave out or down play.Surface 21. Full office software. Word, Excel, PowerPoint, OneNote.2. Wide screen optimized for wide screen movies. When held in portrait when you are surfing the web for example, you get a a longer list so you don't scroll as much.3. Sd slot. Easy to download or upload data on the fly.4. 3.0 USB so you can easily backup files to a hard drive and not have all your eggs in one basket. Or transfer files with anything that has a USB plug and also charge your phone. Ipad? No, unless you have the adapter and you can't charge your phone.5. Can print to almost every printer.6. Hdmi port7. Flash support so you are not limited browsing the web.8. Built in two position kickstand.9. Thin keyboards that double as covers. Can get them background lit, flat, with real keys, and a new one coming out with built in battery to recharge your Surface at the same time on a charge. Battery in tablet is good already though. Some say that you need to buy a keyboard to make full use of the Surface and adds to the cost. Ridiculous. You do not. It will make life more easier though if you are working on a spreadsheet or word document. With an ipad you don't need one because what use would it be for? Sure there are apps. but they are limited to what you can create or edit. You have to do major creating and editing on a computer first and then hook up the ipad and transfer it.10. Hook up to your t.v. or another monitor and drag an open window to the second screen.11. Do a split screen on the tablet.12. Run multiple tasks at the same time in the background like listening to music, watching a video and doing something else like typing an email or working on an a office document in split screen mode.13. Wirelessly sync with your xbox and play games on your t.v, stream videos, pictures, etc.14. Drag and drop files.15. Can set up individual separate accounts on the tablet and have parental monitoring updates and deciding what child can do on the tablet.Now these are not all the Surface 2 offers. I am finding new things still.The ipad Air is basically the same ipad as before with minor tweaks. It's faster and lighter. Still does the same thing as before, nothing new.ipad Air1. Powerful processor. For doing nothing new. Future fingerprint scanner? Tablet will still only run apps. as before.2. Lighter and thinner is negated by the cases to protect the ipad and without a keyboard.3. Upgraded camera. Put it down, your annoying the people behind your trying to see the wedding or play. Use a real camera.4. No USB or sd slot. Need adapters for just about everything. And with the Surface 2 you can plug the unit in when it is dead and keep on using it and still do things via the sd card or usb cables. On an ipad you can't do both. You either charge it or plug in an adapter to the only port the ipad has do to something. And if it is dead, you have to wait until you charge it first. Also you need to bring all the adapters and keyboard with you vs the Surface 2 of which all you need is the power cable. And the cover/keyboard is so thin it is negligible in bulk and weight. And justifying that the ipad has third party keyboards is not valid. It is a separate bulky keyboard and the ipad does not support mouse functions. You are stuck with third party hardware that is Apple specific whereas with the Surface you can use anything that supports micro SD or USB. And having to buy all these accessories tofor the ipad.will not be cheap. People gripe about the Suface cover/keyboard costs too much. Well to buy a seperate cover for an ipad will cost $40.00 and it will flop around and a non intergrated keypad will cost $100.00 that you have to carry seperatley.5. Having to convert simple files with Apple software a hassle.5. Tons of apps. Android not far behind. And Microsoft growing. How much apps. does one need?6. What good is the Reina display if it isn't widescreen? Picture is actually smaller than 9.7 with the black bars.7. Only compatible with Apple products i.e. cant print unless it is an AirPrint printer or stream to t.v. unless Apple t.v.8. Slightly upgraded camera. Put it away! Your blocking my view! And people with a 4.8 inch phone look ridiculous? At least they are not carrying around the perfect sized iphone for one handed operation along with a 9.6 tablet that takes two hands. Kind of contradicting.The ipad Air has more negatives than positives, so how can it be better? Android tablets have more features even than the ipads. I guess if you want one just for games and apps, then an ipad or a higher end Android tablet might suit your needs. People are not weighing in that the Surface 2 can do more than just play games.Now back to the Surface 2. There was a slight learning curve to understand what all the gestures do. It didn't take long though. Look it up on youtube and you will pick it up real quick along with a lot of tips and tricks of what it is capable of. There different ways to open, close, move, split screen, multitask, etc.The tablet feels a little heavy in the hand if you had to hold it I admit. But the two position kickstand works pretty good on the lap as I didn't think it would. I don't have to have a cover to add to the bulk to double as a kickstand also. And even if I put on one of the super thin keyboards they would add very little weight or bulk and they snap on and off without any hassle.The boot up time takes a little while when completely off, but remember it is opening real office programs. When in sleep mode it opens up quickly.I went several days at a time of casual use and in sleep mode without charging and it still had a charge.The tiles are nice because it is real time data so I can glance at them without opening up an app. for email, weather, etc. On Apple you have a bunch of icons and you have open it up, Android you can use widgets.With a real browser and Flash I can use full websites rather than a mobile version. And also it is a lot easier to open multiple tabs when surfing the internet unlike some tablets where it is a pain to pop back and forth between tabs.As I mentioned above it is nice to have the split screen because my kids can research on the web on one side and write their paper on the other side while listening to music of which they shouldn't be.The only two cons I find on the Surface 2 so far is that the power cord is only about 58 inches long. You have to be really close to an outlet of some sort.And the main con was that the software and backup takes up about 16 gigs so you don't have the full gigs of memory stated. So might have to get an sd card. Yes other tablets you only lose about 2 gigs, but remember they are pretty much entertainment tablets only and can't do what the Surface 2 can do.If you are waiting for a ipad Air Pro to come out. Don't be surprised if it doesn't come with a Retina display, finger print scanner, nice camera, etc. You will have to wait for the Pro S, Pro S1, etc. to get one feature at a time and not several at once. I mean come on, cant even throw in a simple camera flash. The ipads shouldn't even be placed in the categories of tablets that can run Office software. There should be a category for Dumb Tablets that only run apps, a category for Smart Tablets for those that can run fully functioning office software and not just limited mobile versions, and Extreme Tablets for ones that can run full blown Office suites.If your a die hard Apple fan, please back up your arguments with something valid other than ipad rocks or a childish angry comment. Because if you do, it will prove my point.", "Date": "November 5, 2013"}, {"Title": "Don't Waste Your Money!!!", "Author": "G. Johnson \"big hands\"", "ReviewID": "R2U0XPBM19XDPO", "Overall": "1.0", "Content": "I bought this for the cellular to use with Square credit card sales. First of all, it took over six hours just to set up the iPad Air, because it wouldn't receive the information that was being inputed. Very frustrating. After three calls to Apple tech support, we finally got the set up finished and were able to use the unit. Next, we were told that the SIM card from our cellular data provider would work with the iPad Air. It did not. So, my only option was to pay AT&T; or any of the other three providers $50 per month for cellular. That's a rip off. It's no coincidence that all four of the cellular providers available for the iPad Air charge virtually the same high price for coverage. So, the IPad Air is very pricey for a tablet, it's very time consuming to set up, the cellular coverage is very expensive. So, we returned it and got our money back. That was the best decision I made in regards to the Apple iPad Air.", "Date": "December 28, 2013"}, {"Title": "Ordered the wrong one", "Author": "Don from VA", "ReviewID": "R3UR5Z6N0MZDOZ", "Overall": "3.0", "Content": "I got this as a Christmas gift for my wife.  When she opened it and looked at the description she noticed it was a 16G model.  We need at least a 32G model.  I sent it back and will be looking for the 32G model to purchase.  I will review it later.  I rated this model 3-stars simply based on their past history with other iPads (we have an earlier version and we are extremely pleased with it).  If the iPad Air is anything like their other iPads it will be a hit with us and it get a higher rating than 3-stars.", "Date": "December 31, 2013"}, {"Title": "Don't assume you'll like an ipad", "Author": "Philip Walter Bonsell", "ReviewID": "RXBWTZZSD232R", "Overall": "1.0", "Content": "Hello.I just got one of these tablets from Apple. I assumed I'd like their products as I had a high opinion of them as a company. Most of these reviews are full of how great they are and tech data. I'm 52, I'm not dumb, I can work a PC, I've got a BMW, a Bang and Olufsen system, a couple of homes and the rest.Well it's an education; we're all used to be expected to work stuff right out of the box, but if you're an apple novice, if you don't have a smart 'phone (I know that's putting me in a minority but why would I need one when I've been out the workplace for ten years?), if you still use CD's for music and DVD's / blu ray for films, well take my advice and don't bother. A nightmare to set up, impossible to put right if you get it wrong; mines back in the box three hours after delivery and there it will stay. I'll put up with windows instead.For all you guys who want to do loads of stuff, well good luck to you. I just wanted Amazon, Google search and my mail live on a screen next to my seat in the living room and was prepared to spend $500 to have that in a nice package. It didn't deliver, and no I don't want to have to go around to my local Apple store and ask some guy pursuing an alterative lifestyle how to do it. Much easier to make do with the $150 Acer notebook, even if it does need to be on a mains lead most of the time.Farewell Apple; if it had worked I'd have bought a pricey Mac, but that ship's sailed and I'm $2000 ahead.Phil", "Date": "January 6, 2014"}, {"Title": "A joy to use!", "Author": "Sandra E. Pike", "ReviewID": "RYA52UOXQ2C0F", "Overall": "1.0", "Content": "I upgraded from the iPad 2 which was also a wonderful tablet.  The screen is outstanding.  I can hold it for long periods to use for reading as it truly is featherweight!", "Date": "January 18, 2014"}, {"Title": "I hate it.", "Author": "Reader6000", "ReviewID": "RVY0PMKQTVZC9", "Overall": "1.0", "Content": "This is the most over rated product on the market today. Nothing can be done without Itunes. They charge you at every turn. The picture is great but that is all it has going for it.", "Date": "December 20, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00G4G22RI"}}