{"Reviews": [{"Author": "vbug", "ReviewID": "R3KQQXFC4P2X5L", "Overall": "4.0", "Content": "Came ahead of time and I couldn't wait to give it to her before her birthday.  She loves it.  Does what she wants to do and it was not that expensive.  Bought two more like it for her brother(11) and sister(10) .  Very satisfied with the product sometimes my husband gets on them and plays their games.  Have had them now for two months and  still going strong.", "Title": "perfect gift for my 13 year old", "Date": "March 26, 2014"}, {"Author": "melissa", "ReviewID": "R36LVPSSQJK2JS", "Overall": "4.0", "Content": "He loves red, so this tablet caught my eye. I didn't want to spend a ton of money because, lets face it, he only 7, and he doesn't take care of his things very well yet. But he loves it when I let him play games on my Kindle. So we decided to get him this tablet. I opened it up to check it out and it was nicely packaged, except for a small tear in the box. The tablet runs pretty well. Battery life was decent, it charged pretty quickly. I downloaded a few games for him, the screen is decent. Not highest quality, but decent for the cost of this tablet. He'll be happy with it. I'll get him a case for it, and hopefully he can manage not to drop it too often. And I can have my Kindle back to myself :)", "Title": "For my 7 year old's birthday.", "Date": "April 12, 2014"}, {"Author": "Holly", "ReviewID": "R3OU46TCYPEFS0", "Overall": "5.0", "Content": "this was bought for my 6 year old son for his birthday! this is what he wanted so ofcourse this is what he got! he absolutly loves it and its really easy for him to use! which he is electronically smart anyways! so if your looking for something for your small child this is a great item to buy! it has all the normal up to date things you may need like playstore camera etc also has a game or 2 already on it! it also came in the mail when it said it would! very happy with my purchase and needless to say so is my son!:)", "Title": "SON LOVES IT!:)", "Date": "May 21, 2014"}, {"Author": "MrsTina", "ReviewID": "RUCQZVEUX8B9K", "Overall": "2.0", "Content": "Love the color and size but always loose wifi connection????great price too good charge arrived on time just really bad connection", "Title": "Won't stay connected to wifi", "Date": "May 10, 2014"}, {"Author": "Linda Jean Carlile", "ReviewID": "RDOYZRO9UV35C", "Overall": "5.0", "Content": "I Love it.....I.can do a lot on it....I have told everybody about it....one was my sisters and she really likes hers", "Title": "love it", "Date": "May 3, 2014"}, {"Author": "Amazon Customer \"Mrs. Linda Finn\"", "ReviewID": "R3KYZXRI75SDU8", "Overall": "5.0", "Content": "My daughter just loves this Tablet and he have had no issues with it at all.Works great for her she is 11 years old. We got apps on it that i use on myown kindle fire and it is not slow at all.combined with a case I bought with keyboard, its a great little pc tablet for kids.Linda", "Title": "Works Great !", "Date": "April 27, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00GJBMXOU", "Features": null, "ImgURL": null, "Name": null}}