{"Reviews": [{"Title": "Very Disappointed.", "Author": "Kim J Bucher-Tyo", "ReviewID": "R3RX68OEZSDUJ7", "Overall": "1.0", "Content": "Bought three of them for our Grandchildren for Christmas.  I charged all of them for the full 10 hours that was recommended before I gave them to them.  One would not turn on at all.  The second would not turn on after the first week of use.  The third is still working, but who knows for how long.  Not overly optimistic.  I loved the color choices", "Date": "January 10, 2014"}, {"Title": "Dragon touch 7 in tablet", "Author": "phoenixblu69", "ReviewID": "R3MM0P2PTCSOU5", "Overall": "3.0", "Content": "I like it but it freezes up often. It sometimes has to be restarted. I haven't found any other issues.", "Date": "December 6, 2013"}, {"Title": "Dragon Touch® 7'' Blue Dual Core Y88 Google Android 4.1 Tablet PC, Dual Camera, HD 1024x600, Google Play Pre-load, HDMI, 4GB 3D", "Author": "Francesco", "ReviewID": "R1DMQSSH770U8M", "Overall": "5.0", "Content": "When I first received my package there was a lot of movement inside the box so when I received it it was damaged and my sound of the tablet it went bad.  But that's not only thing that I'm not upset with the tablet works just fine like I said before the sound just started to go bad there was no damage on the screen or anywhere on the tablet but I still give five stars for this item.  But I will show you how the sound on this time and I will do it later on for right now I am trying to figure out how to make a video to show you what I am referring to and also the tablet works very fast which I am very happy with.  I was talking to Amazon.com they were very nice to help me to figure out what the problem is I explained to them what the problem is and they already tell me what to do to send it back to give me a replacement and they were very understandable people her name was \"Jessica \"and I'm very happy with the she saw the problem right away.  Like I said before I will give it five stars but if there was more stars I would give it at least 10 stars for this item and also I have three of them and that's why I would like to know how to fix this problem and they did it right there in the spot was talking to her and she solved it right away to make me happy.", "Date": "May 31, 2014"}, {"Title": "Dragon Touch 7\" Tablet", "Author": "Jb1055", "ReviewID": "R3Q8IP6CMCULKO", "Overall": "5.0", "Content": "It works great. I compared this product with other brands and I feel I got the best deal for the money. I wouldseriously recommend this to my friends.", "Date": "April 29, 2014"}, {"Title": "Don't buy", "Author": "Thomas", "ReviewID": "R3NVZ16P6TQ25T", "Overall": "2.0", "Content": "Not a good product read the reviews an it was positive reviews so I thought I would by one. The thing crashes. Can't play clash of clans. All its really good for is youtube but even then the speaker is low quality.", "Date": "April 11, 2014"}, {"Title": "unbelievably poor product, appalling customer support", "Author": "stephanie", "ReviewID": "R1NRHS4VXC1QBA", "Overall": "1.0", "Content": "I ordered this tablet in December as a Christmas gift for my daughter. Upon arrival, the tablet charged and powered on. However, after the initial charge wore down, we were unable to charge it again. After several attempts at contacting the seller, I escalated to the amazon a to z guarantee. The seller then informed me that they would send me a return shipping label to return the defective tablet and receive a replacement. I never received the label, or even an address. I again contacted amazon, who then informed me that the seller wouldn't replace the item because the defective product hadn't been returned (this is despite the fact that I had no address to return it to, even at my own expense). I have since replaced the item with an XO tablet (which I would recommend to anyone looking for a tablet for their child). DO NOT PURCHASE THIS ITEM.", "Date": "March 25, 2014"}, {"Title": "It quit working after 1 day of use", "Author": "Enligh10dwon", "ReviewID": "RSIW482XHP74K", "Overall": "1.0", "Content": "The screen became unresponsive after 1 day of use. I cannot unlock it at all...Returning for a refund and will purchase from a more reliable brand.", "Date": "March 13, 2014"}, {"Title": "Don't buy!!!!", "Author": "Tephenie Harp", "ReviewID": "R2OLOJQ8H1M64V", "Overall": "1.0", "Content": "I will never buy from them again! I only had it a week and the screen cracked and the touch won't work. Nothing at all happened to it either. I tried to message the company and they will not respond back!", "Date": "March 11, 2014"}, {"Title": "If I could give this a ZERO, I would", "Author": "Me \"babybella\"", "ReviewID": "R2JBD8V0Q93DH2", "Overall": "1.0", "Content": "I bought three of these tablets (pink, purple and blue) for my kids for Christmas. My son's screen broke within 3 days. Granted, he probably threw it or something, but he's played with my Kindle Fire for over a year without damaging it in any way. Within another couple of weeks, the power button on the pink one got stuck and the tablet cannot be turned on at all. We thought maybe she had done something wrong because she is young. But like my son, she has played with my Kindle for some time without ever causing any damage. Within a month after that, the purple one did the same thing. This happening made it clear to me that the product is the problem. My oldest child is 8 and knows how to handle and take care of tablets. She has been playing with my Kindle since I bought it 2 or 3 years ago. So now I have three useless tablets that I paid almost $80 a piece for. I am also giving 1 star for customer service. We contacted Amazon about returning the tablets (pink and purple only because we aren't 100% sure that our son didn't do the damage). They authorized a return for one, but not the other claiming it was out of the 30 day return period. Well, duh. Of course it is. We bought these for Christmas presents and did not wait until the last minute to buy so 30 days pretty much passed before my kids laid hands on the things. Frankly, if you're going to sell crap, you should be prepared to refund money for crap. I don't want to replace crap with more crap. I want my money back so I can buy something worth my money. I will never buy from this seller again. I do not recommend purchasing this tablet or anything else from Tablet Express.", "Date": "March 11, 2014"}, {"Title": "disappointed", "Author": "Jennifer Bliss", "ReviewID": "R33RXBTF9PE9QG", "Overall": "2.0", "Content": "i got the dragon touch green for a gift i liked it but the sound is way to low the camera takes fuzzy pictures and after a couple of weeks the screen cracked it got hot fast alot now i cant use it i had it in a case to protect it . i dont have the money to get another one .", "Date": "March 9, 2014"}, {"Title": "Doesn't charge right and screen is broke!", "Author": "Miriah Clark", "ReviewID": "R4C1312819OCM", "Overall": "1.0", "Content": "We just opened this tablet for our daughter and tried charging it to have it ready for her on Christmas morning.  The tablet does not want to charge or even show that is on a charger, plus there are lines running down the screen and everything is blurry.  Should not have bought this tablet!!", "Date": "December 24, 2013"}, {"Title": "Cheap device, came defective upon delivery.", "Author": "Michael Ocasio", "ReviewID": "R2DAHZNC3I2POD", "Overall": "1.0", "Content": "My girlfriend and I were looking up a decent starter tablet device for our daughter for some educational usage, child games and video usage for low cost. I've read mixed reviews on this and was very concerned about a lot of the negative reviews but decided to give the product a chance.As always Amazon has amazing fast delivery, product came within 2 days.When opening the packaging the first thing I noticed were a few scratches on the cameras. It appears as if this may have been either poorly put together or simply refurbished and sold as new. Knowing that this device wasn't the top of the line android I fully expected the performance to not be amazing. The casing seems to be very cheap plastic and the screen is flimsy and weak feeling. The size of the device was perfect and the carrying case that we purchased with it looked great initially. After charging the device for a full 10 hours the battery life seemed to die pretty quickly with no apps running while navigating through the menus. During usage I began to smell burning plastic possibly internally of the device. After powering off the device because of this, the device turned on its own with no user interaction, possibly a bad chip set or power button? After shutting it down again and letting it cool off I turned it back on and tried to connect to my wireless network. This device was unable to connect to my home WIFI and my Galaxy S4 in tethering mode. I tried to connect also to an open network in my neighborhood but the device was unable to pull an IP address. To me that immediately indicated this device has a faulty wireless chip. I decided to turn to the web to see others reviews on this product which were also very similar in negative feedback. One major red flag I saw after looking through the included documentation it states on a few small cut sheets of paper. \"Please follow the steps if you have any difficulty of powering on your tablet for the first time\" and has instructions on how to perform this. On a yellow sheet of paper with big bold red letters \"CALL US BEFORE YOU CONSIDER RETURNING THIS PRODUCT\", that pretty much tells me they've had issues with their devices and have included this in the documents. Not a good sign for a consumer on unboxing. The last piece of instructions \" How to make tablet run faster and last longer?\", instructs the user to search app killer in the play store to save on battery life and cpu usage, almost as if they advertise a fast processor but have doubts on its performance.Overall I understand that this was a cheap product, you basically get what you pay for but I at least hoped it would work out of the box from the start. I'll probably never buy a product from this company again. Amazon did fulfill our return immediately, off to get the Galaxy Kids edition tablet now.", "Date": "December 24, 2013"}, {"Title": "I got the tablet the morning and by two hours time the screen stopped work and there were silver lines jumping all over the scre", "Author": "Dominique Seetal", "ReviewID": "R1O1QXGVEA2MWC", "Overall": "1.0", "Content": "they are colourful and look very nice but they donot work or last long,i'm really disappointed because now I have to find my son a new christmas gift", "Date": "December 24, 2013"}, {"Title": "Good return policy.", "Author": "weston benton", "ReviewID": "RN30XG48L519E", "Overall": "1.0", "Content": "I ordered two of these tablets and I charged them for 18 hours as the instructions indicate. One of them never would turn on and I thought I may have just got a defective unit. The second unit turned on once and was used for a couple hours until the battery was low then charged overnight. The next day after work I tried to use the second tablet and it would not turn on. After trying for several days to get it to work I sent both back for a refund.", "Date": "December 24, 2013"}, {"Title": "very unsatisfied", "Author": "rhea windhorst", "ReviewID": "R3MXNBI2KN3CHH", "Overall": "1.0", "Content": "It doesnt workCant play games on it..screen went white with lines through it.returning very unsatisfied not happy with it at all.", "Date": "December 23, 2013"}, {"Title": "Seem good", "Author": "Jessie", "ReviewID": "R1IEXNICO63R7U", "Overall": "3.0", "Content": "Due to not being able to contact seller about the accessories not being with it, I will be returning it. My son got to play on it for awhile then we noticed the charger missing, and it does not charge with the normal usb cords. The only  thing that was in the box was the tablet. I was hoping just to be able to contact them so they could send a new charger bc my son seemed to enjoy the tablet. Hes six and this was an early christmas gift.We also have samsung tab 3, this does not go as fast but good for a six year old.", "Date": "December 19, 2013"}, {"Title": "Dragon Touch Y88", "Author": "William B.", "ReviewID": "R3AAIXGHGX6UYC", "Overall": "4.0", "Content": "Decent tablet for the price, had to return first one due to battery issue, but the replacement ran 3 hours downloading and web surfing before it reached 30% low battery level...As the documentation states you need to install a app killer and it makes all the difference it battery length......I like it.....", "Date": "December 19, 2013"}, {"Title": "android tablet", "Author": "Gwen", "ReviewID": "RD6V2RIRCMWUH", "Overall": "5.0", "Content": "I finally received my tablet and I love it. It goes just about everywhere I go. I will be getting one for my neice in the near future.", "Date": "December 16, 2013"}, {"Title": "I think they will love them", "Author": "Denise Betanzos", "ReviewID": "R3UY5QORBKNILC", "Overall": "5.0", "Content": "The delivery was made before the time stated, this was bought for all the grandkids and for the age group it is perfect, I am very pleased with all of them. I ordered 6 in total.", "Date": "December 10, 2013"}, {"Title": "Good product", "Author": "Zulema", "ReviewID": "RHLD7H3K5HI6I", "Overall": "4.0", "Content": "I was for my six year old son, I thought I was stronger tablet, but good product, fulfilled my expectations.", "Date": "December 9, 2013"}, {"Title": "Dragon Touch 7\" Tablet", "Author": "John C. Chirila", "ReviewID": "RWDMK62T3WCI2", "Overall": "5.0", "Content": "The Dragon Touch 7\" Google Android Tablet works great. Color display is good and the tablet is easy to use. Plenty of 3D color games preloade.", "Date": "May 17, 2014"}, {"Title": "Do Not Purchasr-", "Author": "maryann duran", "ReviewID": "R22ZAORVUCH71D", "Overall": "1.0", "Content": "I purchased this tablet and it currently runs real slow.  I have not dropped it gotten it wet or left it out in the sun.  The apps keep frezzing up especially yahoo mail.  Do not waste your money on this item which I got eariler this year.", "Date": "May 14, 2014"}, {"Title": "waste of money", "Author": "julissa barragan", "ReviewID": "R2LEI4DO9NZS0C", "Overall": "1.0", "Content": "this was the biggest waste of money, the screen is so bad its like watching a 3dfilm without the glasses, it takes forever to charge and only lasts an hour or two, the power button broke, i couldnt get in touch with tablet express, i left 3 voicemails and called a million times, they have terrible costumer support...on a lighter note, amazon was great and allowed me to return it...this tablet was 2 out of 2 that i bought (retuned both)", "Date": "May 12, 2014"}, {"Title": "Dragon Touch", "Author": "Crystal", "ReviewID": "R10ZOIV9HTI9OK", "Overall": "5.0", "Content": "Love, love, love it.  User friendly.  Great when I am too lazy to open up my laptop, and very portable, but make sure you are in a wi-fi friendly area to go online with it.", "Date": "May 12, 2014"}, {"Title": "Disappointed", "Author": "savanna powell", "ReviewID": "R1A5Y1CZW5JYNO", "Overall": "1.0", "Content": "I wish there was a thumbs down rating. I was so disappointed in these tablets. I have had them six hours and one will not turn on without being on charge and its fully charged. Then you can hardly down load anything. Waste of time, money and effort. Six hours and im already returning them. So disappointed.  Awful, awful!!!!", "Date": "May 12, 2014"}, {"Title": "Great little tablet", "Author": "Debby Ansbach", "ReviewID": "R2XL5HL6PDUTMC", "Overall": "5.0", "Content": "My daughter uses thispresent at college for her homework and reading assignments. Thank you for a great litle product. Would reccomend this device to other college students.", "Date": "May 8, 2014"}, {"Title": "Great little tablet", "Author": "Debby Ansbach", "ReviewID": "R1KPNPGM4CRCDS", "Overall": "4.0", "Content": "Easter present for my daughter and she loves it. SHe plays games and most important skype's her friends on it Thank you for a great product.", "Date": "May 8, 2014"}, {"Title": "junk", "Author": "king", "ReviewID": "R1HD9WMLD5YRI9", "Overall": "1.0", "Content": "I bought this to check my trail cameras mainly and it worked to transfer pics but u cant hardly see what the pics are ...it made me rate this one star but if it was up to me itd be more like -1 star...", "Date": "May 8, 2014"}, {"Title": "Didn't work", "Author": "Amie", "ReviewID": "RR2KYEAU2HCUK", "Overall": "1.0", "Content": "I bought one and had to send it back. It stopped working within a week. Ordered another one and it stopped working too. The only good thing about it was that they both stopped working before the 30 days was up so I didn't have to eat the cost.", "Date": "May 7, 2014"}, {"Title": "this is simply a do not buy", "Author": "stephen jordan", "ReviewID": "R2L6QYGYA7XZ7X", "Overall": "1.0", "Content": "okay well just to say I bought 2  around Christmas 2013  and now only one works at all and from the day one of opening had problems", "Date": "May 7, 2014"}, {"Title": "I love my tablet", "Author": "Dottie Benedetti", "ReviewID": "R29GMBD1MJIX5Z", "Overall": "5.0", "Content": "I had purchased a pink one for my granddaughter for Christmas but, unfortunately, it had some factory defects in it. At the same time, I bought this one for myself. I loved mine.  My granddaughter loved hers as well and had learned how to use hers even with the defects. She loved it so much, I notified Amazon about getting a new one for her and they advised they couldn't replace it but would send me a refund.  So my granddaughter wouldn't be disappointed, I gave her mine and took the refund and just ordered another one for myself.  She is still quite happy with the one I gave her.  She takes pictures, plays games and access the internet to use email, etc.  It still works perfectly and she loves everything about it.  I would definitely recommend this to anyone. It is inexpensive but is perfect for accessing the internet and playing games.  Pictures even come out good. I can't wait until I get my new one.", "Date": "May 6, 2014"}, {"Title": "Great tablet", "Author": "S. benns", "ReviewID": "R19B3D8NUZZ0EY", "Overall": "5.0", "Content": "Great tablet. Easy to set up and use. I bought it for my kid and she loves loves it and hasn't put it down since she received it.", "Date": "May 6, 2014"}, {"Title": "great tablet for an even greater price.", "Author": "Desire", "ReviewID": "R2YGM0XKNAU649", "Overall": "4.0", "Content": "Actually enjoy my tablet. .. would give it five  I'm still learning new things on it.  Like where is the flash! !!!!", "Date": "May 6, 2014"}, {"Title": "jush cheap, no bueno", "Author": "fabian", "ReviewID": "R2X3ABNWE0DRF0", "Overall": "2.0", "Content": "this thing was use had pictures from other user, they dint cleaned.. not cool, work find for the kids, but for adult don't use.", "Date": "May 3, 2014"}, {"Title": "I'm disappointed", "Author": "Miguel", "ReviewID": "R2TXP8PTYEIEEX", "Overall": "2.0", "Content": "I live in Venezuela, and now is when I received the product, that's why I've been slow to post my opinion.I'm disappointed, the product I received is NOT a tablet Touch Y88 Dragon ... is a tablet is a different model and brand!", "Date": "May 2, 2014"}, {"Title": "Good for pre-teens!", "Author": "K Brent", "ReviewID": "R2WP8LLJ4GQH5V", "Overall": "3.0", "Content": "I think this tablet is good for moderate use.  Its just not durable, nor does the battery last long max 3 hours.  The paint started to come off within the first month.  I also had to get it replaced because the display screen stopped working.  The best thing I can say is the price is good and the company did not give me a hard time with the replacement.  The replacement came very quick but they do not pay for return shipping cost.  These tables are equal to what you pay for them nothing more nothing less!  I purchased 3 of these and 2 of them have given me problems.  I would also suggest that you buy the protection plan as a backup.KBrent", "Date": "May 1, 2014"}, {"Title": "crappy and cheap", "Author": "devoted1", "ReviewID": "R1IUJC9HRONDM7", "Overall": "2.0", "Content": "i bought this for my son this past christmas.. it was working ok at first then i noticed that it started to overheat while charging then sometimes it wouldn't come on at all.. now when my son tries to play it the device just stopped working altogether...", "Date": "April 29, 2014"}, {"Title": "great when i purchased...but....", "Author": "lumia myst", "ReviewID": "R3DD8BSDG3ZTXS", "Overall": "4.0", "Content": "it worked fine for a while....now it wont charge and doesnt start up...didnt use it for more than games and checking email", "Date": "April 28, 2014"}, {"Title": "just not enough", "Author": "sara ingersoll", "ReviewID": "R2TFEH1PBOF3EX", "Overall": "3.0", "Content": "it has a very short battery life and shuts off on its own for no reason  and very short memory not enough storage space needs more", "Date": "April 28, 2014"}, {"Title": "Dragon Touch 7\" Green", "Author": "shelly", "ReviewID": "R365LOQORZLUCX", "Overall": "3.0", "Content": "it's okay, It gets very hot while you are using it, the good thing is that you can put it in the case and not get burned.  I like the color it is easy to find.", "Date": "April 28, 2014"}, {"Title": "well worth it.", "Author": "kim", "ReviewID": "R13H5CJY68BR43", "Overall": "4.0", "Content": "Works great. Just took a min to figure out. Would definitely purchase again also recommended this two others. You can't go wrong with the price. Went online and purchased Micro 2 female so I could  use my USB. I love it to just toss in bag. Not worried about it. Does every thing I need. Also hook it up to myexternal hard drive", "Date": "March 13, 2014"}, {"Title": "Get what you pay for", "Author": "Angie Gilmore", "ReviewID": "R3GYMNWYMJXBVQ", "Overall": "3.0", "Content": "Meh.I wanted a \"starter\" tablet for the kiddos. First one I received, the speakers didn't work straight out of the box. We did get a replacement that seems to be working so far. We have now had it for 3 months. Picture quality is poor. Battery drains fast. My daughters are lucky to get an hour of play at a time. The sound is also muffled and poor. I am still giving it three stars though as I knew when I bought it that I was buying a lower quality tablet. If your kids are begging for a tablet and you aren't sure if they are responsible enough to have one, this one is the perfect one to be able to find out. I do not recommend it for anybody high school aged or up though as the poor quality can be frustrating.", "Date": "March 13, 2014"}, {"Title": "nondurable", "Author": "Krystal Graham", "ReviewID": "R3H4RX7RVA4JHK", "Overall": "1.0", "Content": "Nondurable! I got these for my kids and as soon as they bump them the screens broke on them ! They aren't built to last at all!", "Date": "March 13, 2014"}, {"Title": "Disappointing purchases", "Author": "Noreen Glenn", "ReviewID": "RWSK11TO8DPJV", "Overall": "1.0", "Content": "Niether tablet isnt working properly and one isnt working at all poor choice on my behalf. Didnt recieve the earrings", "Date": "March 13, 2014"}, {"Title": "disappointed", "Author": "Brian Reames", "ReviewID": "R3G0LVNQK768Z9", "Overall": "1.0", "Content": "I am disappointed in this product it is clumsy and now it will not turn on at all. I would like to return it. B", "Date": "March 12, 2014"}, {"Title": "do not buy", "Author": "Dalia Rodriguez", "ReviewID": "R3P1GNU93PTR0U", "Overall": "1.0", "Content": "horrible. power button broke returned it and got another one and stopped working 3 days later. Had bought 2 for Christmas and both of them stopped working. Returned both! manufacture service reps are horrible no knowledge of anything and hard to understand their English.", "Date": "March 12, 2014"}, {"Title": "Tablet won't turn on at all", "Author": "Shakita M Vaughan", "ReviewID": "R6PXB1VVM0JHK", "Overall": "1.0", "Content": "Because now the tablet won't work. I can't even get it to turn on. I've only used it a handful of times prior to it not working.", "Date": "March 12, 2014"}, {"Title": "this company is disgusting", "Author": "JOYCELYN", "ReviewID": "R3B0KYVMG8WST9", "Overall": "2.0", "Content": "I bought this item for my Grandaughter and I sent to Toronto, Canada and up to date we cannot get it hook up, communication with these people,you all sucks.", "Date": "March 11, 2014"}, {"Title": "Not satisfied.", "Author": "Jason93535", "ReviewID": "RBSBYPWIUAFK9", "Overall": "1.0", "Content": "I bought this tablet for my brother this past christmas. No more than 30 days after i purchase it, it randomly shut off and never turned on again. NOT SATISFIED.", "Date": "March 10, 2014"}, {"Title": "good for kids", "Author": "Jason", "ReviewID": "R24DBUCMCE2U2M", "Overall": "3.0", "Content": "very nice and simple and works well for kids but i recommend that you get a protection plan. good luck", "Date": "March 9, 2014"}, {"Title": "Nice tablet for the price.", "Author": "Chris Craig", "ReviewID": "RAVMXWDQN3IG1", "Overall": "5.0", "Content": "I bought this tablet as a Christmas gift for my girlfriend niece she loved it. She's had it for three months now and hasn't had any issues with it.", "Date": "March 8, 2014"}, {"Title": "pretty good", "Author": "fernando macias", "ReviewID": "R1II3PE7WEV6Q3", "Overall": "4.0", "Content": "It is good just some freezing and bad batteryI've had it for about 8 weeks now and that's all", "Date": "March 6, 2014"}, {"Title": "mad", "Author": "Mrs.Toya", "ReviewID": "R2XIHZI285I6YD", "Overall": "1.0", "Content": "I chose a 1 rating because that's What it deserves. A waste of my money.  It's slow, I could be in front of the Wi-Fi and it would say \" no Wi-Fi connection\" like seriously this is a waste of money", "Date": "March 6, 2014"}, {"Title": "I highly recommend these tablets.", "Author": "katie jo Williams", "ReviewID": "R10E7QVJMV4L2F", "Overall": "5.0", "Content": "i have purchased a few of these tablets from this seller.  They are wonderful tablets and great for children.  They are fast and reliable, They are the very best tablets in their price range. The only issue that i have experienced is that the screens are thin, and crack easily, so make sure to purchase the protection plan.", "Date": "March 4, 2014"}, {"Title": "IT WAS A GIFT FOR MY GRANDSON", "Author": "Barbara Kodash", "ReviewID": "R16REXU0C9E74K", "Overall": "5.0", "Content": "My grandson loves it and plays with it all the time.  It was easy to learn to use.  Well worth it.", "Date": "March 4, 2014"}, {"Title": "ok", "Author": "erica womack", "ReviewID": "R1A6AQB5XJEI0E", "Overall": "3.0", "Content": "Its works ok but its slow and picture isnt very good downloading games takes forever and it freezes sonetimes .", "Date": "March 3, 2014"}, {"Title": "Decent for the kids", "Author": "Slowleadmccey", "ReviewID": "R24HZ0BLTGPJP7", "Overall": "3.0", "Content": "We ordered these for our kids (10 and 6) so they would have something to use to play games on instead of  our iPads.  It turns out, they're not bad.  This is the second one we've given our son as the first one was damaged by his sister (4 at the time).  These do have a HD screen but the camera is pretty lame, so picures taken in bright sunshine are the only ones that look any good.  The ones we got say 4GB on the back of them but when you look in the system settings, it says 2.8GB.  I'd say that's pretty far off the mark for the storage rating.  As it turns out they are pretty durable as our daugher has dropped hers several times, and it still works well.  I guess that's one advantage of not having a glass front.  Loading apps is easy enough, we've even gotten a few educational games in under the radar.  All in all, it's a good tablet for kids.  I'd spend a little more if you're looking for something that doesn't feel like a toy.", "Date": "March 3, 2014"}, {"Title": "GRANDSON LOVES THIS TABLET !!!!!!!!!!!", "Author": "Linda Z.", "ReviewID": "R3PHFNSKLQ0XZV", "Overall": "5.0", "Content": "IT IS A GREAT TABLET. WE HAVE HAD NO PROBLEMS WHATSOEVER. EASY TO USE, BIG SCREEN. GAMES LOAD FAST. WE DID THE \"APP KILLER \" RIGHT AWAY LIKE THEY ADVISED. WELL WORTH THE MONEY. WHY PAY MORE WHEN THIS TABLET DOES AS GOOD OF A JOB AS THE $300.00 ONES", "Date": "March 2, 2014"}, {"Title": "Perfect", "Author": "Jeanette Solomon", "ReviewID": "R193TYYL6B8NJC", "Overall": "5.0", "Content": "This is the perfect gift for my son.  He was able to download his games and movies without problems.  It turned out to ne a great buy.  Unfortunately he dropped it and cracked the screen and I can't find a replacement screen.", "Date": "March 2, 2014"}, {"Title": "Great Deal My Grand Kids Love It.", "Author": "Frank Spignardo", "ReviewID": "R3NC7QXPLOKC9D", "Overall": "5.0", "Content": "My Grandkids Love It.Great Deal It Is All They Said It Was And Then Some Will Deal With Them Again.", "Date": "March 2, 2014"}, {"Title": "bad", "Author": "Rick Clark Jr.", "ReviewID": "RE5T9PXW5KFZG", "Overall": "1.0", "Content": "Did not work! Appears to have been dropped or not inspected, any any rate my kid is very upset and so am I!", "Date": "February 24, 2014"}, {"Title": "Broke immediately", "Author": "CrazyDaizy99", "ReviewID": "RLGP3LNBFDWAW", "Overall": "1.0", "Content": "A fun little android tablet when I bought it for my daughter. But it failed within two weeks after she got it for Christmas and is now useless... very disappointed after the positive reviews I read.", "Date": "February 24, 2014"}, {"Title": "Not impressed.", "Author": "Sara Wheeler", "ReviewID": "R2PTLV5B5FBA5U", "Overall": "2.0", "Content": "I think my Android phone has more \"oomph\" than this product.  It is slow, not user-friendly and has terrible battery life.  I wish I would have kept the box and returned it.", "Date": "February 24, 2014"}, {"Title": "Meh...", "Author": "Amazon Customer", "ReviewID": "R10KM4G8MQO0D", "Overall": "3.0", "Content": "It's an okay tablet, especially for the price you are paying.  Don't expect too much in the way of graphics, and you can only really see the screen straight on (gets really blurry at an angle).  The battery sucks, drains very quickly and takes forever to charge.  Save a little more money and buy a Nook or a Kindle.  That's what we had to do for my son, after spending the money on this one...", "Date": "February 23, 2014"}, {"Title": "Good tablet", "Author": "My 2 monkeez", "ReviewID": "R3HKZSTD1AZSFE", "Overall": "4.0", "Content": "Great item for kids, the only thing is charging cable is not very sturdy ( at least for kids) .", "Date": "February 23, 2014"}, {"Title": "Dragon Touch", "Author": "Patti Barnes", "ReviewID": "R2K7FV7N92E16H", "Overall": "1.0", "Content": "Ordered same tablet twice.  Both had to be returned due to very short playing time (less than two hours after charging), both completely died after a few days and the second one got very hot.", "Date": "February 21, 2014"}, {"Title": "Very disappointed.", "Author": "Linda Baragona", "ReviewID": "R1SR512SPJU3GA", "Overall": "1.0", "Content": "Broke in the first day. Bought 4 of them. Others screen cracked and when they would run took hours to download one game. Very disappointed.", "Date": "February 21, 2014"}, {"Title": "Decent (wanting instagram?)", "Author": "JENNIFER", "ReviewID": "R3474BIZQTERPF", "Overall": "4.0", "Content": "I got this for my preteen daughter so she would stay off the IPAD.  So far it is pretty decent, she is using it for KIK messenger, Netflix, and Instagram.  We downloaded kik and Netflix by going to google play but had to use back doors for instagram because the device did not support instagram.  I think it just wont support the newest version but we went to the next version down and it was fine.  I am pretty sure this is not the best thing to do because I got a \"enter at your own risk\" warning from the tablet by going to android drawer to download but it worked fine for us.  We then tried to add a game but it said we were short memory, to be fair it was a large game.  I instantly went back on amazon to find an SD card for it but I didn't really find anything that said \"YO this is for the Dragon Touch\" so I am leery to buy one.  It is probably a generic SD card but I would like more direction to accessories for this tablet, they only have a million for the covers, screen covers, cases, and foilos, but no SD card, geesh.  Overall it is not bad for the price and I am getting another one for my other daughter.FYI ****Want Instagram[...]", "Date": "February 20, 2014"}, {"Title": "dont buy this tablet", "Author": "manny", "ReviewID": "RXIPC6NWCKJ4U", "Overall": "3.0", "Content": "The tablet keeps disconnecting from the WiFi the camera is horrible both front and back u cant download certain games it has a delay when unlocking it", "Date": "February 20, 2014"}, {"Title": "NO GOOD", "Author": "Zelyntor", "ReviewID": "RCPQ90WVXTBY6", "Overall": "1.0", "Content": "I thought this might be a nice tablet to get my wife to use one, but because it barely works she gave up on it.  I would not recommend it to anyone - pay a bit more and get a Kindle.", "Date": "February 20, 2014"}, {"Title": "Nice", "Author": "M. Crosson", "ReviewID": "R2R822T47VJZ0Q", "Overall": "5.0", "Content": "I got this for my 10 year old. He loves it. It's inexpensive and works very well. I suggest a good case though.", "Date": "February 17, 2014"}, {"Title": "Not as good as advertised", "Author": "Mitchm26", "ReviewID": "R2Q4G9UT021V62", "Overall": "3.0", "Content": "It only comes with 4 GB of memory,and after you install the apps you want, it is barely enough to put any music or videos on it. An SD card is a MUST BUY if you are purchasing this. Also, it says it has duel core processors. Well that isn't enough, because most of the apps I launch eventually end up crashing. Honestly, just pay a little extra for a better brand.", "Date": "February 17, 2014"}, {"Title": "Dragon Touch Tablet Review!!", "Author": "Ashley", "ReviewID": "R1CZYVNHWU5LZF", "Overall": "4.0", "Content": "This tablet is really good but there are a few problems. The camera kind of sucks , but if you don't want it because of the camera its great for you. It works soooo much better with WiFi or internet. So far from my experience no matter how slow the WiFi you're using is it still moves fast. Just the whole thing moves fast. Its light weight and easy to move around. You should definitely buy it! Plus its cheap!", "Date": "February 17, 2014"}, {"Title": "mad", "Author": "megan", "ReviewID": "R3NYCD7TUQIJUE", "Overall": "1.0", "Content": "The \" 3d\" causes a blur that is a major inconviene o and might i say the charger SUCKS OUT OF THIS WORLD LET ME START WITH ITS ONE IVE NEVER SEEN ITS NOT EVEN THE RIGHT ONE FOR THE TABLET YOU HAVE TO LATERALLY SIT THERE AND HOLD IT IN MIND YOU HAVE TO CHARGE FOR 10 hours when you first get it ha..... On the flip side i was able to download games for my son and its his new toy fyi way better one on nomoreracks for 60$", "Date": "February 16, 2014"}, {"Title": "CHEAP Tablet - Issues After 2 months", "Author": "johnny1996xa", "ReviewID": "R23IQJL61MAZQJ", "Overall": "1.0", "Content": "I ordered this tablet as a Christmas Present for my 4 year old.2 months after,the tablet has been having several issues. The battery doesn't last for more than 30 minutes. I've left it charging overnight and the next time the battery would tell me it's running low. The software seems to freeze up every now and then too. The wifi connection strength is very weak. You have to be close to the wifi signal to get a decent connection. My laptop can reach from far away.I regret making the decision of purchasing this tablet.If you want to get your kid a decent tablet, DON'T CHOOSE THIS ONE.My kid had a Nabi 2 tablet before this and it surely worked 10x better than this one and felt better made.", "Date": "February 16, 2014"}, {"Title": "screen problems", "Author": "Lorissa", "ReviewID": "R3TZC36XYO50GN", "Overall": "1.0", "Content": "My daughter bought this with her own birthday money and has had problems with the screen almost immediately. I am trying to exchange it now. Not sure if its just a deffective one or not.", "Date": "February 16, 2014"}, {"Title": "Not my number 1 choice.", "Author": "Jaime", "ReviewID": "R2HWLZDA28IDSW", "Overall": "2.0", "Content": "Charge only holds for about an hour and a half - two hours.  Screen is too reflective.  Although it does have good processing speed for a tablet.", "Date": "February 16, 2014"}, {"Title": "thanks", "Author": "jessie", "ReviewID": "R2W5ATND572DH7", "Overall": "5.0", "Content": "My mother was over joyed when she recieved this for her christmas/birthday gift. It was the best gift i could have gotten her. Thanks guys!", "Date": "February 15, 2014"}, {"Title": "great tablet for the price", "Author": "monica", "ReviewID": "R2O03V51F97T9F", "Overall": "3.0", "Content": "i love the product i gave it 3 out of 5 stars because i am super fast when it comes to technology and i want products that can keep up with my pace. this tablet does its best. i love the size of it, it fits in my hands nicely and i dont have to stain my hands to use it. i can download alot of apps all in all for the price its a great buy", "Date": "February 14, 2014"}, {"Title": "It's ok", "Author": "Tina", "ReviewID": "RAMOQK170A2ID", "Overall": "2.0", "Content": "I was very excited to receive this product, but I believe it is not the best for smaller children or adults for that matter.  My main complaint is in regard to apps.  Not all apps that I have purchased work on this tablet.  I purchased some learning games from the Amazon app store and they do not load.  I knew this product would not perform as my personal android phone, but I expected that there would be more ease of use.  Another issue is in respect to Wi-Fi and the fact the games will just stop working.  I am pretty good at clearing data and ensuring the memory is maintained, and I reset my router regularly.  I have performed a factory reset of this product and that seemed to help but honestly I am not happy with this purchase. I left this review for the tablet covers as well.  These tablets get very warm and with the cover it is absurd.  My daughter has complained about the heat, and my son will not touch the tablet when it heats up.", "Date": "February 14, 2014"}, {"Title": "not as i thought it was", "Author": "joy cardinal", "ReviewID": "R2EFJV69KWM868", "Overall": "2.0", "Content": "I saw reviews on how this worked , I shoulda known better, the pictures aren't as id like them to look ,sending videos on to others aswell is most difficult if your new to the touching and tapping in places traveled , that back up button is most handy, hate how google always comes up  the sound sucks do not use this for music , it is not true nor the video it takes , and it gets hottttt too the point of not being able to handle it , most definitely need a case to hold on to it when it gets hotttttttt to the touch and the battery life is and hour maybe, if your lucky, after being fully charged after the full charge they ask you to do the 1st time", "Date": "February 14, 2014"}, {"Title": "Meh. Double meh.", "Author": "Kate F. \"rocketgrrl\"", "ReviewID": "RL0C0Z3KMG2QC", "Overall": "2.0", "Content": "- Heats up something fierce while using- Very slow when using apps- Would not connect to my computer to transfer files via USB; computer could not recognize itI cannot recommend this.", "Date": "February 14, 2014"}, {"Title": "Tricky", "Author": "Sassy & Seventy", "ReviewID": "R2FIJFHY3I7AL3", "Overall": "2.0", "Content": "Most of the time, the table will not open up---that is, come \"on\".  I am chalking this up as a \"learning experience\"; you get what you pay for.  This was a \"cheap\" item, should have known better----don't waste your money or time with this product---buy the more dependable expensive tablet!", "Date": "February 14, 2014"}, {"Title": "good for a child who is learn to use a tablet", "Author": "Africana", "ReviewID": "R23Y0L1VJHP3LT", "Overall": "1.0", "Content": "It takes ten hours to charge. It can't charge with the charger I receive n it can't charge n use at the same time. Its just a waste of time the battery only last 30 minutes or less. Nonetheless my son still love it", "Date": "February 12, 2014"}, {"Title": "Product isn't worth the monehy", "Author": "Lorraine Washington", "ReviewID": "R28KBJPIYMJWWU", "Overall": "1.0", "Content": "First tablet would not turn on after being fully charged. Second tabled worked for 3 months and again would not turn on after being fully charged. Product is defective. Would not recommend this product. If you decide to purchase this product, please get warranty to be safe.", "Date": "February 12, 2014"}, {"Title": "Only works when it wants to.", "Author": "Rachel217", "ReviewID": "R16KXMKX58E1MG", "Overall": "2.0", "Content": "Everyone told me not to go cheap on electronics-and I should have listened!  The screen blanks out frequently and I have to turn if off and back on again to resolve the problem.  The resolution is extremely poor making.  The battery life is quite low.  It's just not as I thought it would be.  Needless to say, I am now stuck with having paid for this hunk of junk, and now having to purchase one of higher quality.", "Date": "February 12, 2014"}, {"Title": "Tech support is poor", "Author": "Mark L.", "ReviewID": "R24ZS2FCJS92OF", "Overall": "4.0", "Content": "Needs a better manual, Okay for the price.  Shop around and see where a toll free tech support option is available.", "Date": "February 12, 2014"}, {"Title": "dragon touch lightly", "Author": "julie spears", "ReviewID": "R2NSGEUBWFSGUL", "Overall": "2.0", "Content": "Screen broke rather easy. Bought two at same time both broke within a cpl weeks so touch lightly or it may just shatter", "Date": "February 12, 2014"}, {"Title": "Worth the money", "Author": "Tonya Steinkruger", "ReviewID": "R1TC8115AL4PT", "Overall": "5.0", "Content": "I purchased this for my 11 year old Grandson for Christmas. I also bought a leather cover for protection which he never used. He dropped it and the power button is very sensitive. Please purchase extra protection and memory card.Michael loves this Dragon and it helps him scholastically and allows him fun with games. He has learned how to e-mail and send photo's. I hope in time he will learn how to go to his Schools website, click on the links to join in on extra English work.The Dragon is pretty clear to watch video's, play games and access the super information highway faster than my phone.", "Date": "February 12, 2014"}, {"Title": "Low quality", "Author": "Dana", "ReviewID": "R2GRDB8VX6GIAU", "Overall": "1.0", "Content": "This tablet is slow. I bought it ahdmhadnproblems with it from day 1 till it broke. Waste of money and time.", "Date": "February 12, 2014"}, {"Title": "this tablet sucks", "Author": "Rico Paredes", "ReviewID": "R1CJ03309PH2OS", "Overall": "1.0", "Content": "Its a dud..I will be returning it..overheats.and sometimes it doesnt even turn on. Defective Isnt even the word for it.", "Date": "January 19, 2014"}, {"Title": "christmas gift for 2 1/2 yr old son", "Author": "Shannon M.", "ReviewID": "R142IWSAJGSMJ", "Overall": "2.0", "Content": "Tablet was first of three to come in the mail unbroken. haha. So it is the best of the cheap ones I bought, but the speakers are terrible. They sound scratchy. When my son tries to read the books I downloaded you can barely understand the narrator. Other than that and the slow loading it is a pretty good tablet. It does everything that I wanted it to do.", "Date": "January 18, 2014"}, {"Title": "Screen pops off, can't get any free apps!", "Author": "leah7195", "ReviewID": "R6WA20IIQCXLZ", "Overall": "1.0", "Content": "I bought this for my 18 yr old daughter for Christmas. Her and her boyfriend had it out of it's box for about 2 hours when the screen popped out of place...reallly! It's not like they are 10 and mishandling it! They also could not get but a few apps that they really wanted. The OS doesn't support very many of the popular apps.I had read the reviews on this product and some said the screen popped off but I ignored them thinking that an 18 yr old could take care of it. So I bought it anyway, thinking I would get a decent tablet for a bargain price. You really can't skimp if you want good quality. It even looks cheap.I returned it and ended up buying her another popular brand on sale for $60 more than what I paid for the Dragon, but it was worth it because she loves it!", "Date": "January 18, 2014"}, {"Title": "Good", "Author": "Ab", "ReviewID": "R2EQ46ANU47CDU", "Overall": "3.0", "Content": "Good it does everything we need nephew loves the free games husband likes the color and that is all I got", "Date": "January 18, 2014"}, {"Title": "Disappointed", "Author": "Patrick Tibble", "ReviewID": "R1UUUAYGSYDBQP", "Overall": "2.0", "Content": "I ordered 2 of these for my kids. One didn't work coming out of the box. I had to return it. The other does work, but isn't very good. There is very limited space for apps, music, etc. The display isn't very high quality, and needs to be viewed from a certain angle. This means that only the 1 landscape position works well, while the others cause the display to seem dimmed.I don't think I would recommend this tablet to anyone. If you want to buy a tablet for your kid, like I did, I recommend waiting a little longer and finding a better tablet.", "Date": "January 18, 2014"}, {"Title": "it works well", "Author": "Evilbunnyfufu", "ReviewID": "R96RA48YFH7AZ", "Overall": "2.0", "Content": "This tab works pretty well, as a cheap product it is built a bit on the cheap side. I did find a problem with the way the operating system is handling picture taking, it is putting the pictures on the internal memory that is nearly full. this is a bug with the configuration of the operating system. The camera on this thing also is very low grade, I did not buy it for the camera so not worried.The major draw back I found was/is the screen, you need to hold the tab a slight and angle to see the screen properly, if you try to hold it at a direct 90 so that you are looking straight on at it (and the camera can see you properly) the screen will be dark/discolored. we got this as a gift for our kid and for that it works out fine, but I would not get this for any important use or older kids.", "Date": "January 17, 2014"}, {"Title": "Another low review", "Author": "S.A.F.", "ReviewID": "R3N5U5QBK2WTZ", "Overall": "2.0", "Content": "I wanted to share my feelings of anger and frustration with those of you who have purchased this tablet and were not happy with the results.  Like many of you, I purchased this tablet as a Christmas gift for my son.  And also, like many of you, the price was so great that I was able to purchase another one for my daughter.  At first, both tablets were awesome and I was impressed by their speed.  While my daughter's continues to work well, my son's has become little more than an error message display board.  After a week or so his Google Play suddenly disappeared from his tablet, and some of the games he had already downloaded would no longer function.  An error message appeared: \"UID systems are inconsistent, etc.\"  every time he tried to click on something.  I looked this error message up online and saw that the basic answer was to do a factory reset of your tablet for the message to disappear.  I did so, and now a new error message appears whenever my son tries to use his camera: \"External Storage needed...\" although, as many of you have stated, there is no spot to add external storage on this device.I looked up this second error message online and there was no real solution to it either, though it stated that this is sometimes a side effect of a factory reset on your tablet.  So basically, remove one error for another one to pop up.  I received NO manufacturer information with my tablet, so I contacted the seller through Amazon for a hopeful QUICK replacement.  I did not receive any feedback from the seller, who obviously have no intentions of making my replacement fast and simple.  Had I received two tablets that work, I would be among those of you on here who are praising this tablet and feel it is such a great deal.  Unfortunately, I have one unhappy son and yet another low review to post about this tablet.  If you can afford to spend an extra 20 to 40 dollars for a better tablet, please do so and save yourself the stress!", "Date": "January 17, 2014"}, {"Title": "google apps only/bad camera", "Author": "robert tate adams", "ReviewID": "R3HA3U6GWOQ1E7", "Overall": "2.0", "Content": "Was not impressed.  Camera takes dark fuzzy pictures in a well lit room.  Can only upload google apps, which is very limited.  Did not have the apps for the games my daughter plays.  No Jump Start Educational apps.  Can't play Minecraft??? Really?  Is now a paper weight collecting dust.", "Date": "January 17, 2014"}, {"Title": "No Good!!!", "Author": "Amazon Customer", "ReviewID": "R1MP6Y5U60WDWG", "Overall": "1.0", "Content": "Did not work had to return it!!!!!!!!Can't say whether it was due to shipping or the tablet itself.  All I know that it was frying, changing colors and going off and on.", "Date": "January 17, 2014"}, {"Title": "Great Tablet", "Author": "KIMBERLY S.", "ReviewID": "R2OZYPYXAGM37M", "Overall": "5.0", "Content": "I chose this tablet for my 11 year old. He likes to play video games and also uses it to look up info for school projects.It's a great price for the tech. savy kids!The instructions are a little vague when explaining how to download certain apps..", "Date": "January 17, 2014"}, {"Title": "Didn't work", "Author": "Becky White", "ReviewID": "R39NJ2I99AY6V3", "Overall": "1.0", "Content": "My 7\" Dragon Touch wouldn't turn on. Called the company and they tried to help but it wouldn't turn on. Had to return it to that company and then I just upgraded to a Dragon Touch 9\".", "Date": "January 3, 2014"}, {"Title": "Purchased two, both were dead on arrival", "Author": "Mary Shawhan", "ReviewID": "R2Y7OHMB8ZTSV3", "Overall": "1.0", "Content": "I purchased two of these to give to my grandkids for Christmas.  I could not get either of them to power on initially.  After fiddling around with them for a couple of days, I finally got one of them to power on, but then I could not get it to connect to WIFI.  The other one finally powered up only to power back down and I have not gotten it to come back up.  One bad tablet might just be bad luck.  But two failing in more or less the same way screams QA issues.  I am returning both of these tablets and will not order another Dragon Touch.", "Date": "January 2, 2014"}, {"Title": "My father bought 6 of these for his grandchildren and ll of them were returned", "Author": "seth engelbrecht", "ReviewID": "R239RIQKUNS6WU", "Overall": "1.0", "Content": "5 of them quit working within 2 days and the 6th the sound was off as soon as it came out of the box. There is a reason they are so cheap", "Date": "January 2, 2014"}, {"Title": "do not reccomend", "Author": "April Tyler", "ReviewID": "R3GRP77KRB556H", "Overall": "1.0", "Content": "Did not meet expectations.  Slow did not work well with wi-fi at all. Slow downloads, games, apps....was returned day after Christmas:(", "Date": "January 2, 2014"}, {"Title": "first amazon purchase", "Author": "e pedro", "ReviewID": "R281YXK24J3EJI", "Overall": "1.0", "Content": "this was my first amazon purchace that did not get past 1 its was not working it was a presant for a 7 year old that was not happy to recive a damaged tablet thats what i get going with anything less then a kindle  not happy at all i have never had this happen on amazon since my first purchace in 98", "Date": "January 2, 2014"}, {"Title": "7' tablet", "Author": "L. Hunt", "ReviewID": "R2UWVBQXLUYZPN", "Overall": "5.0", "Content": "Great little tablet, easy to care, lightweight. Has made my granddaughter very happy not to mention the hours she spends on games.", "Date": "January 2, 2014"}, {"Title": "Very excellent tablet for a low budget", "Author": "Jack Dalton", "ReviewID": "R3A60NKNFMBYY0", "Overall": "5.0", "Content": "Overall I was very impressed by this tablet. It performs very well, and runs smoothly. My only complaint is of the button arrangement, but that is not a problem. I would recommend this tablet to anybody wanting a tablet to fool around with, but not for work purposes. The tablet only has 4GB hard drive space (The model I bought anyways...), but this can be easily solved by purchasing a TF (microSD) card. I really enjoy this product, and I think you would too.", "Date": "January 1, 2014"}, {"Title": "Good value", "Author": "Amazon Customer", "ReviewID": "RYTDVKJTFMVVM", "Overall": "4.0", "Content": "Great shipping! Tablet is great value! Don't expect a top of the line machine at this price point, but if you need an inexpensive tablet for a child/gift/whatever this is a good choice.", "Date": "January 1, 2014"}, {"Title": "very good", "Author": "vickie bertrand", "ReviewID": "R39TLUXHLKEXIU", "Overall": "4.0", "Content": "I bought for my grandson and he loves it. It crashed on us Xmas day but after that it's been fine", "Date": "January 1, 2014"}, {"Title": "Ordered 2 Had to Return 1", "Author": "Melissa Kluczynski", "ReviewID": "R3RM6G6CGNPEAJ", "Overall": "3.0", "Content": "When the product works it works well. Stays connected to the internet and does what it is supposed to do, however we are 50/50 with this product. 1 would not stay connected to the internet, then wouldn't charge just died and that was it. Called the manufacture they helped us reset the system and the tablet then charged, but still would not hold an internet connection. If you can get it to work properly it really is a good tablet for the money.", "Date": "January 1, 2014"}, {"Title": "it was ok. just that.", "Author": "doni vlade", "ReviewID": "R2UZHUS7KNSJJ2", "Overall": "2.0", "Content": "it was ok, not really what i want. to slow and some app won't install...update the market please and thank you...", "Date": "December 31, 2013"}, {"Title": "HAPPY GRANDSON", "Author": "Cheri Andres", "ReviewID": "R1G2SF4I14Z68", "Overall": "5.0", "Content": "MY NINE YEAR OLD GRANDSON WAS THRILLED WITH THE TABLET. HE HAS PLAYED ON IT SINCE UNWRAPPING THIS GIFT.  HE HAS EXPERIENCE WITH VARIOUS ELECTRONIC ITEMS AND HAD ONLY GOOD THINGS TO SAY ABOUT THIS ITEM.", "Date": "December 30, 2013"}, {"Title": "Wasn't a Complete waste but ill never get one again", "Author": "Shawn Grant", "ReviewID": "R2NXL9QCGPIWPS", "Overall": "2.0", "Content": "ITs a nice solid tablet for  the price its one of the strongest, however there's a few broken features and the HDD design is a complete train wreck it's labeled as a 2Gb tablet its actually 512Mb moving anything over to the \"tablet\" drive (the other 1.5Gbs) just creates same app on BOTH so now every app you try to move to the larger partition leaves a footprint that takes up roughly the same amount of HDD space as it did before. other than that and the god awful video mode  it switches to anytime there's a video on a page your viewing and most apps are not really supported on this (Netflix, most games, and any app not designed specifically for a tablet", "Date": "December 30, 2013"}, {"Title": "not worth it", "Author": "Beth Dunn", "ReviewID": "R2D042NI9HG38W", "Overall": "1.0", "Content": "great price. and when it would turn on, it was exactly what I wanted for you 5 year old. she loved it what little bit she could play with it. it would not stay on. we could only get it to come on every now and then. finally it wouldn't come on at all. we had it 48 hours.", "Date": "December 30, 2013"}, {"Title": "Your money's worth...", "Author": "K. Shane", "ReviewID": "R1RRC4NYAHT2K0", "Overall": "4.0", "Content": "I was quite impressed with the Dragon Touch tablet!  It performs welllbeyond what  I expected forthe price...  A great deal!  I bought  four andgave themout  for Christmas!", "Date": "December 30, 2013"}, {"Title": "not worth it", "Author": "Pen Name", "ReviewID": "R1T6KJC60PMT15", "Overall": "2.0", "Content": "The camera on it is horrible. The picture quality is junk. The battery doesn't last long and doesn't log on when usin wifi. Has been a nightmare. U get what u pay for I guess", "Date": "December 30, 2013"}, {"Title": "died out after 24 hrs!!!", "Author": "ADRIAN RENTERIA", "ReviewID": "R3CK715OTFO9CQ", "Overall": "1.0", "Content": "died out after 24 hrs!!! will not charge or come on. lasted more in gift wrap than it did once it was put to use.", "Date": "December 30, 2013"}, {"Title": "good purchase", "Author": "Kelly DeFrancesco", "ReviewID": "R1XV6PL0NWN6IV", "Overall": "4.0", "Content": "I purchased it for my children. It was easy for them to use. The quality of the picture and sound are both great", "Date": "December 30, 2013"}, {"Title": "Disappointed", "Author": "Veronica kay", "ReviewID": "RZXH5BVX0QWKA", "Overall": "2.0", "Content": "Both my kids got this tablet for Christmas and after two days my sons tablet won't even turn on or charge at all on the other had I have not had any problems with my little girls yet I have not really had the chance to mess with the camera yet or any apps but I hope I did not wast my money", "Date": "December 29, 2013"}, {"Title": "Terrible tablet", "Author": "Normii Late \"normii477\"", "ReviewID": "RS2TSEFOV0LO3", "Overall": "1.0", "Content": "Purchased this tablet as a Christmas gift for my 10yr old nephew. I needed a simple tablet for a young child. This tablet would load apps and crash over and over during game time.  I even added a sd card for more game play.  I tried to call company's help desk and no one answered my calls.Hope if you purchase this item, you have better luck than I did.", "Date": "December 29, 2013"}, {"Title": "DAY 10 AND IT WILL NOT HOLD A CHARGE!!", "Author": "Kacey Ellis", "ReviewID": "R1432BN75N8U7F", "Overall": "2.0", "Content": "I received this as a gift. I've only had it since Valentines day and I am already having problems with it. Upon receiving it I was so excited, and couldn't wait to turn it on the play on it, but was a good girl and followed the instructions to let it completely charge. I noticed about 15 mins of playing time, the back started to get really HOT! So hot it was stinging my hand. I thought that I will just let it rest and come back to it. Same thing the next day and every time I turned it on. First of all, if it is getting that hot it obviously needs a vent to allow air to get to it. I understand it is no PC or laptop. However, the heat is ridiculous. Today 2/24/2014 (10 days after I received it) It will only work while it is on the charger!! As soon as you disconnect it, the device turns off. While it is on it states it is 99% full on the battery. However, when you disconnect the charger and try to turn it on, it shows a red fully drained battery!! *******************I HAVE ONLY HAD THIS TABLET 10 DAYS!!!!!!!!!!!!!!!!!!!!!!!!!! I am completely DISAPPOINTED with this tablet. At least it still turns on but how much longer will I have that??", "Date": "February 24, 2014"}, {"Title": "happy", "Author": "xiomara mercado aguilar", "ReviewID": "RAEZNW5X99XER", "Overall": "5.0", "Content": "The table is great no problem with it . Its easy to use and I enjoy it .  Look far to buy this for my kids", "Date": "January 30, 2014"}, {"Title": "Kids love them", "Author": "Mary Berray", "ReviewID": "RRYPFIBGT1FIV", "Overall": "4.0", "Content": "I bought four of these for my grandchildren.  Three worked and one did not.Also I bought them for Christmas early and did not read the return policy.Please read everything and test all of the electronics right away so thatyou can return them within the given time frame.The grandchildren love them.", "Date": "January 29, 2014"}, {"Title": "Broke after one month", "Author": "Robyn Tollefsbol", "ReviewID": "R2HXXCPQ5IQOZZ", "Overall": "2.0", "Content": "I ordered this for my 5 year old son for Christmas.  It is January 23 and the screen has cracked.  He didn't drop it, he was playing Angry Birds, and tapping the screen and it cracked.  To replace the screen it's going to cost me about $40 - half the price I paid for the entire tablet.  The colors and background on the tablet were nice and easy to use, but the download capacity was poor.  Most of the games available for this device require wireless connection to play, causing me to have to tether my phone to the device and use up my data while we are anywhere but home (ie: in the car, etc.)  I struggled with purchasing this tablet because of the mixed reviews, but thought I would go ahead and take my chances.  I am sorry I did.  I wish I would have spent the extra money and gotten him a better tablet from the beginning, but you live and learn.  If you are on the fence about purchasing this device, don't be.  Save your money or invest in a better, upgraded version.", "Date": "January 23, 2014"}, {"Title": "I don't recommend it.", "Author": "Ludy", "ReviewID": "R1MCULINFJQ9RY", "Overall": "1.0", "Content": "I understand.. you get what you paid for but for an $84.00 item is not acceptable for it to be soo bad. it kept turning off by itself , and it didn't take the extra memory card .. so it also kept saying it was full after only downloading 1 game. I was really disappointed after all the research I did for this item.", "Date": "December 30, 2013"}, {"Title": "Piece of junk", "Author": "Nicole", "ReviewID": "R3NIZ9T4DEKQTE", "Overall": "1.0", "Content": "I ordered this for my son as a Christmas present.  Not worth the price.  It says to charge a full 10 hours before turning on..we charged a full 30 hours and it would not come on.  Finally when we got it to come on it was very slow to change from one screen to the next AND I ordered red, it was hot pink.  Go with another product.", "Date": "December 26, 2013"}, {"Title": "be ware", "Author": "Randi", "ReviewID": "R6LRAHIKIQ2HT", "Overall": "1.0", "Content": "Half of the 5 I bought wont turn on horrible tablet...do not buy cheap tablet..u get what u pay for", "Date": "December 25, 2013"}, {"Title": "Do not buy this tablet!", "Author": "Carol M. Bamford", "ReviewID": "RA6SRE786XFQQ", "Overall": "1.0", "Content": "I purchased this table for one of my grandsons for Christmas.  After charging it as the instructions indicated, I pre-loaded several games, activated the wireless and set up the tablet for him so that he could play with it right out of the box.  He opened it on Christmas Eve and played with it for about a half hour.  It then went dead.  It will not boot and will not charge, even after being charged over night.  There are many decent tablets in this price range that are suitable for a child, and I'm sorry I purchased this one.  He was very, very disappointed.  I am returning it.", "Date": "December 25, 2013"}, {"Title": "Turns off for no reason", "Author": "Megan", "ReviewID": "RNU39Z28KY6H3", "Overall": "1.0", "Content": "I bought this for my Boyfriend for Christmas and now he cant even play with it today. It worked for about 15 minutes and then just turned off. He turned it back on and it worked for about 5 minutes and the screen went blank again. I knew it wasnt going to be the best product based on the price but I didnt realize it would be this bad. Looks like I will have to send it back tomorrow :-(", "Date": "December 25, 2013"}, {"Title": "Don't waste your time.", "Author": "James Royce \"Jim\"", "ReviewID": "RRRC5O157PQE7", "Overall": "1.0", "Content": "After reading a good portion of the reviews on this tablet, (I'm sure some of the 5 star reviews are bogus,) I purchased this tablet. First of all, I was unable to connect to any wifi network anywhere, including my home network. And, to those who think this is a router problem, it is not. I work in IT and understand routers. Performing a system reset was a useless exercise.  Also, I'm sure not every router in my area is defective or locked up. That being said, the product description said that Google Play was pre-installed. It was not, But, I guess that didn't matter so much since I was unable to get online with the tablet anyway. My Visual Land Tablet performed better, was better constructed and it was cheaper.", "Date": "December 24, 2013"}, {"Title": "sucks!!!!!!!!!!!!!!!!!!!!!!", "Author": "eldanador", "ReviewID": "R2JB9XKO5WFYHC", "Overall": "1.0", "Content": "Bad quality and resolution!! freezes to much.Color doesnt look good. Tt's ratchet, and the price is cheap but I dont recommend it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!The peoples think that's  tablet is good are Ron that garbage when you see nice tablet you know this is bad deal because is a little cheaper no way no buy that garbage tablet never en you live. Trust me  is more better u see your kids happy  do u feel nice,but buy this tablet  loose money  y u kids aren't happy. I want to return and said you need to way for the saler a probe this and never a probe for return that item and  my daughter tell me she want  u tablet but not that. So I lose money in this nasty tablet for cheaper and now I needed buy a nice table for my daughter. So my recommendation is no buy that sh.... and paid a little more money and your kids makes happy, very happy  I buy the kindle tablet for her.now is so happy nice resolution, more faster the Internet no frozen. And everything you see in this tablet is true Kindle and nice, the dragon tablet is a robed. Make your kids happy  no buy that bulshiet.....", "Date": "October 30, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00G3Q4CMM"}}