{"Reviews": [{"Title": "Beautifully built, incredibly fast, the best tablet computer ever!", "Author": "John Ryan", "ReviewID": "R3CXMI18TV70OE", "Overall": "5.0", "Content": "The new iPad Air is Apple's latest, slimmest, lightest release of their hand-held computer.  Oddly enough, it's so beautifully easy to use (my one year old daughter loves playing with it), it's almost doesn't feel like a computer at all.A word of warning - this review is written for people who've never owned an iPad before - and are wondering what all the fuss is about.  If you're thinking of upgrading skip down to the \"What's great about the Air\" section below, or just buy it - it's amazing.Just what's all the fuss about?--------------------------------------I used to own a laptop for work, and (very occasionally), it'd sit on my lap on the sofa, and I'd use it for pleasure (eMail, watching films or playing the odd game).  Then I bought my first iPad, and the laptop became redundant, a boring \"work device\".  Hard to explain, but the fact the iPad is so small and light, and you navigate around with your finger by pointing and gently swiping the screen makes the whole experience a lot easier - a lot more fun.Even my most \"Luddite\" of friends have been won over.It's incredibly simple and easy to use (it only has one main button), and everyone from my one year old daughter to my 85 year old dad have taken to without problems.  It's size and shape also support using it like a book (literally to read a book or web page), but you can also watch TV and films.Personally I'm also paranoid about my password getting \"hacked\", and someone running up a huge Amazon bill or buying stuff with my credit card on eBay.  Well one of the benefits of the iPad (and iPhone) is it's \"almost impossible\" to get a virus - one of the most common ways to get hacked.  This doesn't mean you shouldn't use strong passwords, (both Sony and Adobe got hacked), but it's reassuring to leave the Windows world behind.Finally, I love the way these devices (iPad, iPhone, Apple TV, Apple Mac), increasingly work together.  The fact you can start a Pages document on your Mac and edit it on your iPad, or take photos on the iPhone, and in seconds see them on the iPad or Mac and display them on the Apple TV.The thing is, \"it just works\".What would you use if for?----------------------------------* Shopping online.  Obviously - you could be reading a review on Amazon about the iPad Air!* Reading News stories.  As you can hold it like a book it's great to read the news online (my wife loves the UK Daily Mail newspaper Online - personally I prefer a web digest from free app Zite).* Reading Books.  It's great for reading books from Amazon Kindle or Apple Books with the benefit of 1,000s of online book reviews* Navigating web pages.  Instead of clicking with a mouse, you gently swipe your fingers on screen to scroll around* Watching Films.  I use it to watch Netflix online videos (with an Apple TV you can send stuff to the telly)* Reading and replying to mail.  I use \"mailbox\" a great free app to read and reply to mails, but there's a free one included* Showing and organising photos.  Any photos on an iPhone are automatically available within minutes in \"the cloud\"* Playing games.  From fun puzzle games like \"Cut the Rope\" to fully fledged first person shooters.* Listening to the Radio.  With \"Tune in Radio\" you can listen to thousands of radio stations world-wide.  My personal favourite is London UK based XFM - alternative rock* Listening to music.  I stream mine to an Apple TV, but you can also buy portable speakers or just plug into the AUX socket* The list goes on and on.Which model should I buy?----------------------------------I can't comment about Android tablets (apart from the Google Nexus which is well regarded), but in terms of the Apple tablet line-up in order of cost:-1. Avoid the Apple iPad 2, it's a relatively old model, under-powered and with a lower resolution screen.  If you really want an Apple but don't want to spend the cash, buy a 16g WIFI 3rd or 4th generation iPad from eBay.  Avoid this one.2. iPad mini is a lovely tablet.  A 7.9 inch screen and astonishingly light and remarkably thin - it feels like a light-weight book.3. iPad mini with retina screen. Again 7.9 inch screen, but with the blazingly fast A7 chip and a \"retina\" (high definition) screen.  Worth the upgrade if you can afford it.4. iPad Air.  Much larger screen size (9.7 inches - doesn't sound much but it makes a huge difference).  Same fast (A7) chip as the Mini with Retina - the latest and fastest iPad available.Clearly (from my viewpoint) there's only really three options.  The iPad Mini, the Mini with retina screen and Air.What are the Optional add-ons?-----------------------------------------Well, assuming you've dropped by the Apple Store (which I would highly recommend - fantastic service), and handled the iPad Mini (with/without retina screen), and iPad Air then your options are around memory size and cellular option.Memory:  Once bought, you can't add memory (space for apps, films, books etc).  However, the basic price goes up a huge amount (+$100 for the 16g to 32g iPad Air).  But, having owned a 16g and then a 32g iPad - I can safely recommend the 16g unless you really want to store a huge amount of videos and downloads.  Only you can decide, and if you're lucky enough that money is no object then splash out.  Otherwise, 16g should be fine for most people.Celular:  Allows you to connect to the internet while you're out and about.  This will add an additional +$100 to the price and means you can slip in a mobile phone SIM card.  This means (for an additional $5-10 a month extra), you can access the internet on the move.  Alternatively, you can opt for the WIFI option, and use it at home or at at \"hot spot\" (eg. Starbucks, most rail stations and hotels etc).Personally I'd buy (and indeed did), the 16Gb iPad Air WIFI.Do I need anything else?-------------------------------Most people (me included) buy a cover.  Apple (and now several copy-cats) make a \"smart-cover\" which automatically shuts down the iPad when you close it, and switches it on when you open it.  There's versions which cover the back, or just the screen.  Apple charge from $35 to $65 for their (admittedly) high quality fabric or leather covers, but there's many available from $10.  Be aware, you do get what you pay for.Personally,I think it's a pity to cover the beautiful aluminium industrial design of the iPad with a cover - but if you've spent hundreds of pounds you'll want to protect it from scrapes and bangs.I also invested in a keyboard ($20-$70), as I tend to write a lot of mails and documents (remember it comes with a word processor).  I'd recommend the ogitech Ultra Thin iPad Air Case with Keyboard - Space Grey and the ZAGG Keys iPad Air Case Folio with Backlit Keyboard although these are strictly optional unless you want to use your iPad as a proper laptop.Finally, if you have another Apple device (eg. an iPhone, Apple TV or Mac) you'll find these work together beautifully.  For example, you can create a reminder on your iPad and it appears on your iPhone.  Equally, photos taken on your iPhone appear on your iPad, and you can stream music or videos from iPad, iPhone or Mac to an Apple TV.Some people think this \"locks you in\" - but it's your choice.How should I set it up?--------------------------Well, if you already own an iPad or iPhone it's incredibly easy.  Just log in with your existing iTunes and iCloud accounts, and select the option to either set this up as a new iPad or restore from backup.If you've never owned an iPad before - read on to hear about how to set up an iTunes and iCloud account - it certainly confused me the first time I used them.+ iTunes account - is how you buy your music, Apps or films from Apple.  You register your credit card with them, and protect the account with a secure password+ iCloud account - is used to identify you as an individual.  This gives you 5Gb of backup space (your iPad will be automatically backed up when you charge it), and also means your iPad will work together with your iPhone.How to set them  up:1) Create a SINGLE iTunes account for your immediate family and children.  Then when you buy an App, it's immediately available (for free) to all the family members.  Maybe once the children reach 15-16 they'll want their own account (as otherwise they'll end up spending your hard earned cash on your credit card to buy music you don't want).  Until then - it's a great way to share the Apps.2)  Create YOUR OWN INDIVIDUAL iCloud account for person.  That means if you buy an iPhone you can share data (eg. reminders, notes or calendar events) across both devices.  If you're partner (and maybe even children) have their own iCloud account they also have 5Gb of space, and can keep their own notes and documents private.Easy when you know how.What's great about the Air?-----------------------------------* Lighter (30%) and thinner than the previous version (469g from 650g)* Even faster A7 chip.  Blazingly fast!* Improved sound (compared to the iPad 4)* Software including  + iMovie - edit and publish home made movies  + Numbers - Fully functional Excel for the iPad  + Pages - Word processor  + GarageBand - Play a piano or a drum kit  + iPhoto - Edit and organise your photosWhat's not so great?--------------------------* The change in physical size means you'll need a new keyboard or replacement cover if you're upgrading* Pity Apple didn't include the \"touch ID\" to secure your passwordsOverall Opinion---------------------It's hard to believe the iPad version 1 was released just four years ago, and there's a huge raft of \"me too\" tablet computers to choose from, but the Apple iPad Air is still the one to beat.As the UK based consumer magazine \"Which?\" magazine put it - \"...the best tablet we've ever tested.  Apple packs a beautiful screen and lightning fast processor into a slimmer-than-ever shell, and battery life is very impressive\".Yes, there are cheaper Android based alternatives, but the quality, design and beauty of this tablet just sets it apart.  If it were a car it'd be a top of the range Mercedes or a BMW.Highly Recommended.", "Date": "January 4, 2014"}, {"Title": "Longer lasting power, faster, lighter, with free top quality apps to download!", "Author": "jjceo", "ReviewID": "R3ONM01PGHOTQB", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moEKZW1NZ68FJVembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moEKZW1NZ68FJVrefresh_preplay() {\n\ndocument.getElementById(\"cv_moEKZW1NZ68FJVchiDiv\").innerHTML = document.getElementById(\"cv_moEKZW1NZ68FJVhiddenPre\").innerHTML;\n};\ncv_moEKZW1NZ68FJVrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moEKZW1NZ68FJVso;\t   \n\n\nfunction cv_moEKZW1NZ68FJVloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moEKZW1NZ68FJVso = new SWFObject(swfLocation, \"cv_moEKZW1NZ68FJVAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moEKZW1NZ68FJVso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moEKZW1NZ68FJVso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moEKZW1NZ68FJVso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moEKZW1NZ68FJVso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moEKZW1NZ68FJVso.setAttribute(\"height\", swfHeight);\n          cv_moEKZW1NZ68FJVso.setAttribute(\"width\", swfWidth);\n          cv_moEKZW1NZ68FJVso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moEKZW1NZ68FJVso.write(\"cv_moEKZW1NZ68FJVflashcontent\")) {\n          fp_resizePlayerSpace('cv_moEKZW1NZ68FJV', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moEKZW1NZ68FJV';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moEKZW1NZ68FJV', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moEKZW1NZ68FJVloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moEKZW1NZ68FJV\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"190-8456599-0840360\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1Q9GR3DWN4C7M\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1Q9GR3DWN4C7M\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3ONM01PGHOTQB\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1Q9GR3DWN4C7M/190-8456599-0840360\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/190-8456599-0840360\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moEKZW1NZ68FJVduration')) {\n      document.getElementById('cv_moEKZW1NZ68FJVduration').style.display='none';\n    }\n    cv_moEKZW1NZ68FJVloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moEKZW1NZ68FJVloadSwf(movieID, playerVersion) {\n   return _cv_moEKZW1NZ68FJVloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moEKZW1NZ68FJVnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moEKZW1NZ68FJV', 0, h);\n}\n\nfunction cv_moEKZW1NZ68FJVresetPlayer(w,h,bw,cc) {\n  cv_moEKZW1NZ68FJVnewHeight(h);\n\n  cv_moEKZW1NZ68FJVso.addVariable(\"resetBandwidth\", bw);\n  cv_moEKZW1NZ68FJVso.addVariable(\"cacheCode\", cc);\n  cv_moEKZW1NZ68FJVso.setAttribute(\"height\", h);\n  cv_moEKZW1NZ68FJVso.setAttribute(\"width\", w);\n  cv_moEKZW1NZ68FJVso.write(\"cv_moEKZW1NZ68FJVflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moEKZW1NZ68FJVRollOverImg = new Image();\ncv_moEKZW1NZ68FJVRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81wRvQ9Mn0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moEKZW1NZ68FJVpreplay = document.getElementById('cv_moEKZW1NZ68FJVpreplayImageId');\nif (cv_moEKZW1NZ68FJVpreplay) {\n  cv_moEKZW1NZ68FJVpreplay.onmouseover = function() {\n    cv_moEKZW1NZ68FJVpreplay.src = \"http://ecx.images-amazon.com/images/I/81wRvQ9Mn0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moEKZW1NZ68FJVpreplay.onmouseout = function() {\n    cv_moEKZW1NZ68FJVpreplay.src = \"http://ecx.images-amazon.com/images/I/81wRvQ9Mn0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moEKZW1NZ68FJVpreplay.parentNode;\n\n  var cv_moEKZW1NZ68FJVcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_moEKZW1NZ68FJV/190-8456599-0840360?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moEKZW1NZ68FJVcurrentClick) {\n      return cv_moEKZW1NZ68FJVcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:12 MinsI use an Apple iPad about 6 to 8 hours a day.  I own an iPad 2 and 3 and now this new iPad Air version.  My main reasons for updating were that I literally fill up my 64 GIG iPad every day or two with videos and photos that I shoot.  Having this larger version at 128 GIG allows me to work longer and add more to my iPad.  In addition this new version is much lighter and easier to use all day long.  Even though the battery is smaller in capacity than my iPad 3 the battery life is longer and it is very noticeable. This is because the faster A7 CPU and the motion chip actually use less power.Please watch my video as I go into more details in it.I immediately noticed the increase in speed.  The unit connects to the WIFI faster, synchs with iTunes faster, downloads emails faster and speeds up your web browsing.  The differences are very noticeable and enjoyable as a user.  The dual speakers are a nice change but I also use a lot of Bluetooth speakers to enhance the sound of the iPad.In my video I do a size and weight comparison to an iPad 2, an iPad 3 and the iPad Air.  I also show how the basic set up takes place and for advanced users you can just speed through that portion of the video.  The iPad 2 weighs 1 pound 5 1/8 ounces, the iPad 3 weighs 1 pound 7 1/8 ounces, and the iPad Air weighs 1 pound and ¼ ounce.  The iPad Air is narrower but has the same screen size.  The left and right edges of the iPad are thinner on the sides of the useable screen and you can see that in the video.Here are the key improvements for me:* Much lighter in weight* Thinner, smaller design with the same screen size* Much faster when synching with iTunes* Much faster when browsing the web* Much faster when downloading emails* Stronger WIFI connection and faster WIFI synching* A more powerful AC wall adapter with 5.2 VDC and an output of 2.4 Amps.  It charges at 12 watts of power. It operates at 100 to 240 VAC and 50/60 Hz and it is UL approved.  It features folding AC wall plugs for easy packing when traveling.* Lower CPU and motion chip power consumption that makes the smaller/lighter internal battery last longer!  This is very noticeable!* As usual a beautiful high resolution retina screen with 2048 by 1536 resolution at 264 pixels per inch.  You can see the difference in the photos, videos and reading quality of the screen.* Dual speakers in the bottom* Free high quality Apps* iPhoto* iMovie* GarageBand* Pages* Keynote* Remember to download these from Apple!Overall this is a superior product that really outperforms the older iPads that I have.  I was disappointed that the new iPad Air did not have the home button with the fingerprint sensor built in.  Since I have used it with my iPhone 5S I have really become attached to it and it just seems like a way to cheapen the unit and be more competitive instead of showing and using the enhanced technology.  I would have paid a little more for the iPad Air with that sensor.This is still a 5 star product and I recommend it as a very good tablet.", "Date": "November 9, 2013"}, {"Title": "Excellent", "Author": "Daniel G. Lebryk", "ReviewID": "R2RCYFJ9NNSROC", "Overall": "5.0", "Content": "The iPad Air is everything I imagined it would be and a lot more. This latest generation iPad is so much lighter than previous versions; it is now approaching the weight of a Kindle - meaning it is easy to hold for a long time. The body is about two inches narrower, making it easier to hold. The retina display is so darn sharp and looks great.The iPad Air finally pushed me to upgrade my original, version 1 of the iPad. I bought that iPad on release day, seemingly millions of years ago. I loved that device, my one complaint was that the iPad was too heavy - everything else about it was great. Now that I've used the Air, I'll never go back. This was an upgrade well worth doing.November 2, 2013 Update: After using this for two days and thinking harder about the iPad, I figured you might want a few reasons why this might not be for you. Your iPad works just great and you don't do much more than read email, play angry birds, and look at websites all at home. In my case I went from a slow turtle first generation iPad to this lightning fast new version - I'm blown away. And if you have a latest previous version and get a great deal on recycling your current model (read at least $200) then it might make a lot of sense. This is an expensive device, and a MacBook Air is not all that far away from the iPad, after you add $60 for a case, $100 for two years of accidental breakage coverage, and maybe $60 for a keyboard. A MacBook Air at $1100 suddenly doesn't look all that expensive anymore, especially if you opt for the 128GB option of the iPad. Of course there is nothing like holding one of these new iPads and they are super sweet. If you are super logical and conservative, this is probably not the device for you.On the other hand, I decided to jump in both feet first.Setup was super fast and easy. There is a good step-by-step wizard to get the device running. Since I have an iCloud account, I was blown away with how fast this thing synced. That whole improved WiFi antenna is not hype - the device connected quickly with my network. Most devices take a while to connect to my network, this was painless and fast. Filling in the information for my mail account, it seemed like seconds and new email was downloaded - significantly faster than my other iPad.I had a choice during set up to restore from a backup or set up the unit as new. I chose new device, so none of my apps loaded right away. If I had chosen a backup, I could plug this into my computer and with iTunes could have grabbed my purchased apps. All incredibly seamless.Video is stunning. Amazon Prime Video took seconds to start (I've gotten used to 15-20 seconds). The video started in standard def, and within 15 seconds switched to high def. So much faster than happens even on my PS3. I have never seen buffering move this fast, scanning forward, there was a 5 second delay for buffering and the movie resumed. Sound is much better than the single speaker. It is still not great, just more passable. It is silly that they put two speakers on the bottom of the iPad. A speaker on top and bottom would give movies stereo. Music sounds better. Two speakers put out more sound, the stereo effect is minimal, the two speakers are one inch apart.This is an incredible display for films. The blacks are deep, rich, and have great tone range. Out of the box, this display looks fantastic.Everything moves so darn fast. Switching apps is a snap. New apps load with a blink of an eye.I'm glad I bought the full size iPad; Apple got this size and weight exactly right. I think this is well worth the extra $100 over the retina mini to be released the end of November. Apple has blurred the lines between these two devices. I guess they've done the same thing with iPods, so it makes sense they would do it with the iPad.If you've used iOS 7 on an iPhone, the iPad is essentially the same thing - you will feel right at home.", "Date": "November 1, 2013"}, {"Title": "Beautiful product, non-premium hardware.", "Author": "Avenging Taco", "ReviewID": "R52KR35VM0NQ3", "Overall": "3.0", "Content": "I have owned several Apple products, and the iPad is the most distinguished among Apple's line up relative to its competition.  The most compelling aspects of this tablet are the beautiful design, and the 10 hour battery life.  These are the two features that made me decide to purchase another Apple product irrespective of their business practices which try to squeeze money out of their customers by not supporting devices properly after they are released.After having used this product for over a month now, I can say it is an improvement over my iPad 1.  The browser now crashes on the original to the point of making it worthless.  My original iPad had 256 MB of RAM which is not enough to load a lot of modern web pages without the browser crashing.  That is why I had hoped the 1 GB of RAM in the iPad Air would be sufficient, and it has improved, yet I still find that the browser crashes on occasion.  The scroll latency is very subtle, but noticeable to me.  It doesn't really impact my usage, but it could create problems for people who game on their iPads.  Putting in 2 GB of RAM (which is what I have in my Nexus 4) does not cost that much, and would improve the performance greatly.  For a premium product, I expect the best, and Apple has consistently under-delivered on processing hardware which created the same problems all the way back to the iPhone 1 I purchased on launch day.I take 1 star off for business practices which burn through your pocket, and the second star is removed for needless low-RAM browser crashes that are still a problem on the latest iteration (which is likely planned to force relegation of old devices and compel new sales.)  Still, I can say that this is the best 10 inch tablet available, and android has no viable alternative worth purchasing.  If you can overlook the two biggest strikes I have against Apple, you should consider no other 10 inch tablet at this time.UPDATE 1/17/14Today I called into Apple support because my browser is crashing frequently.  I am now experiencing 5 - 10 browser crashes a day when it was only 2 - 3 times a week when I first purchased it.  Speaking with the Apple support technician, he said that they have not received many complaints about this issue yet, so I may be experiencing a rare software or hardware problem.  I looked through my crash log (which had over 100 crash reports in it since Nov. 11th) and the vast majority of them were low memory crashes.  However, the tablet did not operate this way when I initially purchased it, and it began to increase in frequency about 2 weeks ago.  Therefore I suspect that there is a software conflict (I still have 4 GBs of free flash hard drive space, so I doubt it is a conflict with virtual memory, although a RAM hardware problem is possible).  I went through some basic procedures the technician recommended, and I was advised to do a system wipe if the problems should persist.  I will test the tablet for a few days before wiping everything and starting over. I'll update this review once I am confident of what the issue was.", "Date": "December 8, 2013"}, {"Title": "Apple still rules the tablet world.", "Author": "Makavelli02", "ReviewID": "R3AWGSO5C50M8A", "Overall": "5.0", "Content": "First of let me tell you I am not an apple fanboy. I own and support samsung products. I carry a galaxy note 2 with me every day and would not consider an iPhone until the make some huge changes to it. Last year I bought a nexus 7 and loved it. Now that it's specs are getting a little dated I had to look for an upgrade. The new nexus 7 didn't impress me with it's dated CPU. So I looked to the note 2014 and the iPad air. I used both side by side and researched every detail. I sell these things for a living. The note is very impressive but, for all it's stats and hardware features it still struggles with simple movements. You can point out is 3 gigs of ram and the very good snapdragon 800 quad core CPU. Then you have apples 1 gig of ram with the measly dual core a7 CPU. ????? Now for the real world facts and it pains me to say this because I love android, but the fact is the a7 in the iPad air with it's upgraded clock speed at 1.39 gigs has yet to be matched in any bench mark from another mobile processor including the quad core s 800 by snapdragon. And with the future in mind the 64 bit tech is hard to beat. Them to the 1 gig of ram vs the 3 gigs in the note. If you can't use all that horsepower why put it in there. The air is twice as snappy as the note with no lag what so every. The note on the other hand lags even on swiping through home screens. It all comes down to the operating system apple remains king. Android may be pretty and customizable but that all comes at a cost. That cost is performance. You can take a car with 500 horsepower and put it on a curvy bending road. All that horsepower doesn't mean a thing. The car with 200 horsepower will still win by going straight.So I bought the air and love it. And must say I have missed iTunes and the more refined apps.", "Date": "November 24, 2013"}, {"Title": "The best iPad yet!", "Author": "Roxanne \"Photography, as a powerful medium of...", "ReviewID": "R3AA0IQZDZRGAN", "Overall": "5.0", "Content": "My first iPad was fun-I called it my toy. I also called it \"the brick\". I used & enjoyed it for certain things. Now several more iPad down the road I have the iPad Air & I am in love! I read a LOT & I went through various Kindle devices-from the original to the Paperwhite as well as the Fire HD & HDX. They all went back to the store after much disappointment & I would go back to reading on the Kindle App.The iPad Air has become my mini workstation, paired with an Apple wireless keyboard, my library, my entertainment zone where I watch movies, play games & listen to music. I can also shop, do research-the list is endless! The device is as light as air even with a leather cover. It stays cool-no overheating. It is fast & with 128g, there is room for what interests me. The Retina screen is gorgeous-which as a professional photographer who uses it as a portfolio to show my work is a must.Apple, you did a fabulous job!", "Date": "December 28, 2013"}, {"Title": "Light, Nice Design, and Does the Job", "Author": "Simon", "ReviewID": "R1PHLHVNLYURIX", "Overall": "4.0", "Content": "This is my 3rd iPad. I've had original iPad, iPad 3, and now the Air. Many people may say iPad is not worth the price for what it does, but in my case, it was worth every penny. I used iPad 3 and now the Air mostly for browsing the web, reading textbooks, and occasional gaming, and for these tasks iPad Air is perfect; not to mention, I've saved a couple of hundreds on textbooks already. Air is much lighter and faster than the other iPads I've had so far. Now, I can easily hold it longer while reading longer texts, and I can see the performance increase in web browsing and games.Mini vs. Air DilemmaI first got the new iPad Mini with Retina display, because the Apple sales person said it is identical to iPad Air in every aspect other than screen size. Of course it turned out to be wrong, since mini is a bit slower and has the display color accuracy issue. After a week, I went back and exchanged the mini for iPad Air. While mini is a wonderful tablet, I was keeping it much closer to my eyes that I liked to. Web browsing also suffered a lot on a smaller screen of the mini even with Retina. With iPad Air, everything is back to normal again, and I can browse the web more easily now.Wi-Fi vs. 4G CellularI have had the cellular version of iPad 3 and the original iPad. To be honest, I only enabled the service for a few months and disabled it afterwards. I find myself to be always near Wi-Fi networks, either at school or work, so I decided to get the Wi-Fi version this time. Another reason was that I can always turn on the Hot-Spot feature on my phone, and share the internet with iPad Air. Because of these points, it didn't make any sense to pay $130 more for the cellular version.Games and PerformanceI've tried a few games, including Dead Trigger 2, and the 3D performance is very good. The new A7 processor really shines here. I am sure new wave of 3D and 64-bits games will come to iPad pretty soon, and if you are into gaming, definitely go with larger than 16GB models. The web browsing performance has been increased as well, so you can browse the web more fluidly.ConclusionI am pretty happy with my purchase. The free iLife and iWork packages with the purchase of new iPad from Apple sealed the deal for me. It is much better than my previous iPad 3, and I definitely love the new reduced weight. The performance increase is also noticeable both in games and web browsing. If you are coming from older iPads, you will probably appreciate the new design and performance as well.", "Date": "December 8, 2013"}, {"Title": "About as useful as a peanut", "Author": "Joe C", "ReviewID": "R2SCYOVSAQ3G2Y", "Overall": "3.0", "Content": "I am a college student and got sick of lugging a laptop around with the risk of it getting stolen so I purchased an iPad. I am neither an apple/pc/android fanboy, I use the tool that gets the job done reliably. (Ever have a paper due and your computer breaks down?) I own a macbook, iphone, windows desktop, and had a Nexus 7 for a short time but wanted a tablet with a larger screen.So lets get down to it- initial impression was \"Wow!\" and I never realized how chunky or laggy the Nexus 7 was. The resolution, animations, user interface, and general build quality is superb in my opinion. It feels like a device \"that will get work done\". Unfortunately, the iPad out of the box feels like a digital storefront for the App store as opposed to something I can do school work on. Bluntly, the device is unnecessarily handicapped. For me to put my own videos on it, I have to use Handbrake and waste 3-4 hours to convert the movie to something the iPad can play. The Nexus 7 played almost any format out of the box. Using textbook PDFs is horrible, there are only a few quality apps that offer continuous scrolling. If your course requires mymathlabs, webassign, or one of those other edu-gimmicks to do homework, good luck, most of them require Flash which is unsupported. Then I went to use safari.. advertisements everywhere! Same with every free app, constant advertisements! Occasionally I have to download PDF to read for course work. Ain't happening in safari- there is no way to download and the page will refresh if you close the app. Good luck reading where there is no wifi.Then I jailbroke it, installed f.lux, adblockerNetworks, safari downloader, nitrous, retinapad, vplayer video player, and videopane. That took care of the blinding blue light at night time, killed off 90% of advertisements, I can download files now, iPhone only apps are now in HD, I can watch almost any format of video too. Now the device is useful!After that, I installed DocsToGo to read PDFs with continuous scrolling and to write papers. I also HIGHLY recommend Notes Plus if you intend on hand writing notes. Lastly, I would suggest getting the \"Papers\" app (no typo) to read PDFs with multiple columns.Overall, iPad has a lot of potential but is held back by Apples walled garden. After jailbreaking and eliminating the majority of the artificial handicaps, I feel OK with heading to school only with it and not worrying about it not being capable of doing something. Remember- iPad is not a device for creation, it is for consumption and is essentially just a storefront to iTunes. If you keep these limits in mind, you won't be as disappointed as I was.", "Date": "January 29, 2014"}, {"Title": "Warning!", "Author": "Owhillo", "ReviewID": "RQ1UDS9MXHJC2", "Overall": "1.0", "Content": "I wish I could say I love my iPad Air  because my kids bought it for me for Christmas.  Within a month, there was a crack across the screen.  I did NOT drop it.  It's in a ZaggFolio case with a keypad and it's a great case.  When I called Apple, they accused me of dropping it.  I can have the screen replaced for $300.  Hello?  Within the next couple of months, the web was full of people who had bought this Air and their screens were broken.  They get them replaced and they break again.  I am not able to post the link on here, but you can check out the Apple site for just a sampling of complaints and questions that you will note has not been addressed at all by Apple.There is a clearly a problem with the screen.  If you don't mind fractures across your iPad, this might be the one for you.  We are an Apple family.  Spent thousands on phones and computers for years.  So disappointed in this model.", "Date": "May 2, 2014"}, {"Title": "Longer lasting power, faster, lighter, better power charger and with free top quality apps to download!", "Author": "jjceo", "ReviewID": "R3DOT7M66G6ZAV", "Overall": "5.0", "Content": "I use an Apple iPad about 6 to 8 hours a day. I own an iPad 2 and 3 and now this new iPad Air version. My main reasons for updating were that I literally fill up my 64 GIG iPad every day or two with videos and photos that I shoot. Having this larger version at 128 GIG allows me to work longer and add more to my iPad. In addition this new version is much lighter and easier to use all day long. Even though the battery is smaller in capacity than my iPad 3 the battery life is longer and it is very noticeable. This is because the faster A7 CPU and the motion chip actually use less power.Please watch my video as I go into more details in it.I immediately noticed the increase in speed. The unit connects to the WIFI faster, synchs with iTunes faster, downloads emails faster and speeds up your web browsing. The differences are very noticeable and enjoyable as a user. The dual speakers are a nice change but I also use a lot of Bluetooth speakers to enhance the sound of the iPad.In my video I do a size and weight comparison to an iPad 2, an iPad 3 and the iPad Air. I also show how the basic set up takes place and for advanced users you can just speed through that portion of the video. The iPad 2 weighs 1 pound 5 1/8 ounces, the iPad 3 weighs 1 pound 7 1/8 ounces, and the iPad Air weighs 1 pound and ¼ ounce. The iPad Air is narrower but has the same screen size. The left and right edges of the iPad are thinner on the sides of the useable screen and you can see that in the video.Here are the key improvements for me:* Much lighter in weight* Thinner, smaller design with the same screen size* Much faster when synching with iTunes* Much faster when browsing the web* Much faster when downloading emails* Stronger WIFI connection and faster WIFI synching* A more powerful AC wall adapter with 5.2 VDC and an output of 2.4 Amps. It charges at 12 watts of power. It operates at 100 to 240 VAC and 50/60 Hz and it is UL approved. It features folding AC wall plugs for easy packing when traveling.* Lower CPU and motion chip power consumption that makes the smaller/lighter internal battery last longer! This is very noticeable!* As usual a beautiful high resolution retina screen with 2048 by 1536 resolution at 264 pixels per inch. You can see the difference in the photos, videos and reading quality of the screen.* Dual speakers in the bottom* Free high quality Apps* iPhoto* iMovie* GarageBand* Pages* Keynote* Remember to download these from Apple!Overall this is a superior product that really outperforms the older iPads that I have. I was disappointed that the new iPad Air did not have the home button with the fingerprint sensor built in. Since I have used it with my iPhone 5S I have really become attached to it and it just seems like a way to cheapen the unit and be more competitive instead of showing and using the enhanced technology. I would have paid a little more for the iPad Air with that sensor.This is still a 5 star product and I recommend it as a very good tablet.", "Date": "November 9, 2013"}, {"Title": "Apple has done it again!", "Author": "JNH", "ReviewID": "R1S1FRBCJZZ97Z", "Overall": "5.0", "Content": "Design:This new iPad is so thin and light it’s amazing. It comes in weighing a little over 1lb.I upgraded from the iPad 3 and you can defiantly feel the difference. When reading with the iPad 3, after a few minutes my arms would be tired of holding the iPad up. With the new iPad Air, that is not the case anymore. I can read for much longer now and my arms don't feel tired. The unit is also easier to hold (much thinner than previous versions of the iPad)It’s built of high quality aluminum just like every other iPad is and constructed to last.PerformanceThe new iPad air is fast! It has an A7 processor in it which is defiantly an upgrade from the previous iPads. The Wi-Fi is even quicker to connect and I notice I can achieve more of my potential in bandwidth speed using this iPad. The new front facing camera makes video chatting much better and the M7 chip makes editing and slow motion shooting fun and a breeze.StorageI upgraded from a 16 GB iPad 3 to a 128 GB iPad Air. Why you ask? Well because I do a lot of traveling for work and Apple is notorious for sneaking in extra stuff on your hard drive that takes up space. My iPad 3 came with only 13.8 GB useable space and after a month I had 3 or 4 GB of “other” storage that no one could figure out how to remove or clear.I mentioned earlier I travel a lot for work so I enjoy watching movies on the plane rides. With my old iPad I never had room for all my movies I had to use a wireless hard drive  (Seagate Wireless Built In Streaming STCK1000100Just to watch my movies. Now with this new 128 GB hard drive I can fit tons of movies on it and I no longer need the old wireless hard drive. (One less thing to lose on travel)Final thought:For people who have an older iPad (like I did) then this is a no brainer buy this new iPad you won’t be disappointed! It is much lighter than previous versions. Wayyy faster! And still sleek and built to last as every other iPad is. The new storage options give you the ability to carry more pictures, movies, books , games with you and the battery life is superb coming in at 10+hours. Overall I am happy with my purchase. It might be a little expensive, but if you buy smart you'll have this tablet for a long time with no problems.", "Date": "December 27, 2013"}, {"Title": "Bad crashing problems, NOT ENOUGH MEMORY Major Fiasco", "Author": "P. Krumpter", "ReviewID": "R1KNHC7CNC2UP2", "Overall": "2.0", "Content": "I bought the ipad air when it first came out. I am a multitasker, and I open multiple tabs in my browser. The browser crashed every 5-10 minutes, losing log in status and work.The apps crashed constantly. The ipad air rebooted to the springboard constantly.I went to the Apple store and recreated the crashes and reboots on every ipad air in the store. This was after the Apple employees denied ever seeing a problem on the ipad air.It turns out that the ipad air has the same amount of memory as a 3 year old android phone- 1GB.All the quality tablets that came out in the last quarter have 2-3 GB RAM, except the ipad air.Somehow, it is being covered up. By Apple. If you go in their forums, there are plenty of (new users) people reporting crashing problems. Then you have the level 6 and up users denying there is a problem. Many posts are being censored and deleted by Apple.The 64 bit processor needs more memory than a 32 bit CPU - so in effect, the ipad air has LESS memory than the ipad 4.Do yourself a favor and dont buy the ipad air. It is already obsolete. If you must have an ipad, buy the 4th generation one, or wait until the next one comes out. You have been warned.", "Date": "February 4, 2014"}, {"Title": "Great if you have the money for it", "Author": "ReG Masse \"Love to Read\"", "ReviewID": "R344K1L81PTEM0", "Overall": "4.0", "Content": "Compared to the older models, it is  much lighter, so that means easier to use throughout the day. The specs are about the same as the New Ipad (iPad 3) and iPad 4. I would definitely get an iPad Air over an iPad Mini, even with the Retina Display, as what made the Mini desirable was the smaller weight and size. The Air is really light, more manageable for someone who uses it continuously.All in all, if you can afford it, it is a great gift, to yourself or seomone else (you really like :)).", "Date": "November 27, 2013"}, {"Title": "iPad Review from an Android user!", "Author": "Jason Wang", "ReviewID": "R3MRBK7OU4EGHS", "Overall": "4.0", "Content": "I purchased as a long time android user because I needed something for textbooks and the 4:3 aspect ratio works a lot better for text books than 16:9 (I tired the Nexus 10 for a week as well)..Here is my review after  a week:The first thing I noticed was how light and compact it was, coming from the Nexus 10 I was surprised how easy it was to hold with one hand (although you still wouldn't for long periods of time) and how compact it was for a 10in tablet. The tablet is as fast as anything out right now, to be honest I don't play games but in terms of everyday use everything was fine...but at the same time every iPad that I've used before felt fast as well, I have heard of some issues with tablet optimization for iOS7 but I haven't encountered any. The screen is bright and sharp, text is really easy to read vs a higher PPI tablet (nexus 10) I really couldnt tell a difference with the extra pixels. The color on the iPad is very good once again this is to be expected as Apple always makes high quality devices.The only Cons I can't think of is the speaker placement and feel of the glass (as mentioned in other reviews). The iPad has \"stereo speakers\" which are located on the bottom, I really wish they would have put one on each side instead of both on one side. Watching youtube or netflix in landscape is kind of weird since all the side comes from the right side, kind of defeats the purpose of stereo speakers imo since I never watch fullscreen videos in portrait mode. The nexus 7and 10  have  really good desigsn for speakers that I wish Apple would've adopted.The other con is the feel of the screen, to be honest it feels a bit cheap...compared to previous iPads and the nexus devices the feel of the screen on the iPad air is the worst. It feels like plastic and it just doesnt feel solid when you push down. I'm sure this is a sacrifice that Apple had to make in order to reduce the weight to me the benefits of having a lighter, smaller device outweigh the feel of the screen (something that I'll eventually get used to).Other notes: I haven't used the camera, sorry but I never use the camera on a tablet to take pictures but from what I hear from reviews it takes pretty much what you would expect from a camera on a tablet. I probably wouldn't upgrade if I had an iPad 3 or iPad 4 unless your someone who has to have the newest tech or is absolutely miserable with the weight.If you do want to purchase it you can get it for 479.99 + Tax, go to Walmart's website or you can have any other retailer price match it.All in all this is an excellent tablet besides the minor gripes...the only Android tablet I can see competing with the iPad is the Nexus 10 v2 if it ever comes out...and while I preferred the Nexus 10 for media viewing, real stereo speakers and OS, reading textbooks felt a little cramped and since I'm using this tablet primarily for \"school\" the 4:3 factor fit my needs better.So there it is proof that you can be a fan of both Android and iOS :)", "Date": "November 13, 2013"}, {"Title": "Great Experience", "Author": "Dragember", "ReviewID": "R3RZ0F8IARVY1A", "Overall": "5.0", "Content": "My first tablet was a Nexus 7, and while I enjoyed it immenseilly I was ultimately disappointed in how slow it eventually got (speedy at Christmas, snail slow come April despite factory reset and other attempts to speed it up. Bought my brother a new nexus 7 that summer only to discover its speed was on par with the Nexus I currently owned. Very bizarre). I was skeptical whether or not I would enjoy a tablet experience, so the Nexus 7 was none the less a great first tablet. It could do anything any other tablet could without putting a dent in your pocket.I decided to get the iPad Air this season, specifically the wifi 32gb space gray version.Never owned an iPad before, so I can't really tell you how the models compare,However some things I note, the screen is rather large (duh) which does make typing with the onscreen keyboard difficult. However the screen real estate and quality is stunning, and if typing is a huge issue for you there is the iPad mini and other tablets. That's the trade off, and this is always a choice you have to make between 10 inch vs. 7inch tablets, no matter what brand you're looking at.The glass does feel rather thin, and I am concerned about its durability. I have read that the screen is durable however, and this perception is due to the lightening of the device causing the screen to sound thinner. Supposedly I will be able to confirm this with a case, as the addition of the case will give the tapping of the screen a deeper sound. Apparently it all comes down to acoustics - though a specification on glass thickness versus previous models would be nice.The design of the tablet is exquisite, definitely some top of the line material choices. The tablet has a VERY sturdy feel.Lots of free apps come with this tablet, which all work excellently and efficiently. There is no hesitation between tasks, and the speed is phenomenal.Overall I noticed the quality of apps and how they work on the operating system is MUCH better with apple than it was with android. However, the apple App Store isn't very easy to navigate. Google store is much more user friendly.No widgets, makes customizabibility limited.Multitasking is an ease with this tablet due to gestures. I love how well the gestures work. You can swipe between apps.Battery lasts insanely long, mine averages 12 hours of use.Hasn't overheated (vague warmth can be felt), even with gameplay.Sound from speakers at bottom of iPad sound full. Other tablets I've played with have a tin-metal quality sound emit from them, as though the speakers strain to emit a hearable noise.All iPad Airs, according to Apple's website, come with a complimentary one year limited warranty.Cool front AND back microphones work together to cancel out noise when using skype and FaceTime. Sounds very clear and crisp, I recommend you check out some videos on it.Overall I would say an A+ tablet. I mainly listed some concerns and observations, but that aside this thing is amazing! I love and, it from what I've heard of previous models, I'll hopefully be using this tablet for years to come (number one selling point for me is that apple devices function excellently passed a year).Update December 3, 2013:I've noticed a bizarre memory leak that occurs whenever I watch videos using Apple's video app (love them digital copies). I was testing the video streaming and after I noticed entire GBs were gone! After shutting down the app and fiddling around I realized that the iPad stores memory it buffers and keeps it hostage. However, after going back to the app and quickly loading the same movie and exiting before it begins to buffer the memory reappears. That being said, I wouldn't be surprised that if you watched movies completely through your memory would be restored each time. Still this is a rather large flaw on Apple's part, and I'm not sure if it occurs with any of the other video streaming apps. I'll be sending them a message to see if they're working on a patch for it.", "Date": "December 1, 2013"}, {"Title": "The best tablet just got better", "Author": "G. Ware Cornell Jr. \"anotherlawyer\"", "ReviewID": "R1M0P0IQSS4RK5", "Overall": "5.0", "Content": "When the first iPad was released in the spring of 2010, it was accompanied by a cacophony of jokes about its name and its size. Three and a half years later, the release of the iPad Air, the fifth full-size tablet Apple has offer, has been much calmer. This is the fourth full-size iPad I have owned, beginning with the AT&T; 3G model which was released in May, 2010, about a month after the first WiFi only iPads arrived. Every one of my iPads has had an AT&T; cellular data.Until this model I have purchased the largest capacity solid state drive Apple has offered. This year there is a 128GB iPad, which costs about $100 more than my 64GB model. Here is the reason I did not select the higher capacity-iCloud. Data stored on iCloud is instantly available across multiple IOS and OSX devices. With all that storage (I buy 50GBs annually) why duplicate it on a hard disk?The iPad Air is incredibly light(about a pound) and has a slightly smaller external footprint than previous models. The retina display actually seems sharper, if such a thing is possible. It also holds a charge for even longer than before.Beyond the physical beauty of the iPad Air is its amazing utility. As a trial lawyer I can easily access the firm's network. This means that  every file and every document is instantly at my command. In just a few years time I have learned that I no longer need to drag loads of paper files and depositions with me to court.Over 400,000 apps are built exclusively for iPad, and well over a million iPhone apps run on my device as well. It is an incredibly powerful platform, well on its way to replacing laptops for all but the most labor intensive tasks. When I travel, I typically bring only my iPad-no laptop, no hard copy of a file.  I didn't really appreciate just how dependent I had become on the iPad until this June when a federal judge held that  I could bring  either a laptop or a tablet into the courthouse. I chose the iPad.My weapon of choice-the iPad. This is the one tablet to buy if you are serious about using a tablet. It's pricy, but it may well be, the perfect tablet.", "Date": "November 2, 2013"}, {"Title": "Best full-sized tablet on the market", "Author": "R L", "ReviewID": "R211Y1YLSW1J97", "Overall": "5.0", "Content": "I almost bought a smaller screen tablet, but when I held the iPad Air, I couldn't believe how impossibly thin and light it feels. Plus, the rounded edges on the back make this really comfortable to hold for long periods.I'm glad I went with Apple, because the quality is unbeatable. For something I use everyday, like a tablet, it really is worth the investment. As powerful as a computer, but an absolute dream to use. The iPad Air now comes with the feature-rich word processor and spreadsheets apps, called Pages and Numbers. With included cloud-based collaborative features that can even be accessed from a PC.While there may be cheaper tablets on the market, you certainly get what you pay for. For something that you'll use everyday, from the sofa to the bed, to the coffee shop and your next flight, I would choose a quality companion. You can't do any better than this.", "Date": "November 27, 2013"}, {"Title": "Great tablet (Fanboy/tech jargon-free, short review)", "Author": "J. Kraft", "ReviewID": "R2J5HWWAKE9XUD", "Overall": "5.0", "Content": "I gave this as a gift to my wife this Christmas and she absolutely loves it. I have a Samsung Galaxy Note Tab 2 and right away I noticed the weight of the iPad Air. It felt like a feather compared to my tablet. The display is crisp and VERY sharp, I was amazed by that. The only thing she had an issue with compared to my tablet, was that the speakers on the iPad are placed at the bottom and not on the front facing you, like it is on the Galaxy Tab. We turned it up all the way and it definitely gets loud, so it's not like the speakers aren't good. It's a minor gripe for an overall great tablet experience. I would buy with full confidence if you are in the market for a new tablet.", "Date": "December 26, 2013"}, {"Title": "Excellent, but could be unbeatable", "Author": "JE Craig", "ReviewID": "R34PGIBEBQG7TV", "Overall": "4.0", "Content": "First of all, I have never owned an ipad before but I have used other's ipads and was impressed with them.  I also have a motorola xoom and it doesn't even come close to the ease of use and just generally aesthetics of this ipad.  Its probably best that I break it down into pros and cons to give the most accurate picture I can of what I have found since I bought myself, my wife and my son all the new ipad Airs.--The Good--The business apps I use are all exactly what I hoped for.  I use Chrome for browser and it looks incredible.  When tablets came out, this is what I imagined browsing the internet should look like on a tablet.  The form factor is great, and the Air is as light as advertised.  Despite other's claims of durability issues, I have found it to be quite durable even with my minimal case.  Movies in correct format play flawlessy and my music sounds great.  Paired with some good headphones, long plane trips become tolerable in the worst of seats.  Facetiming with family is a breeze and the 'cool' factor is definitely still present.--The Bad--There are also some cons which I think takes the Air down a half star to a star.  First off the 16GB model which I purchased for my wife from a big box store after I purchased my 64GB from Amazon is simply not enough memory.  I know thats a choice etc but for those that are purchasing for the first time, do NOT buy the 16 GB model unless you plan on mostly using for browsing the internet.  Apps + music + movies will fill up your 16 (actually less after what IOS takes up) gigs very quickly.Second, they should have put a little more RAM in.  The browser occaisonally crashes and there is definitely some latency on scrolling for more content intensive pages.Lastly a few random complaints; the screen also seems dimmer than the ipad with retina (last generation), there is no additional storage, and there seems to be a growing number of junk apps/games.--The Ugly--I will preface this with this: only power users are likely to encounter the ugly.Synching with Apple TV is not as easy as advertised.  Sometimes the air icon shows up, sometimes it doesn't.You can play MKV files but it is painful.  You need a third party player, then you have to transfer movies via http (drag and drop doesn't work), and you will not see where that space went, should you forget about things you've transferred via that method.If you have a home media server and use a PC, itunes + network drives + adding files to the ipad reminds me of the days of the 2400 baud modem.  You wait, and you wait, and you wait.  Anything you really want to transfer, transfer it from your network drive to your pc, then add to library, then transfer to ipad.--Overall--I still prefer this to my android pad or any other tablets I have encountered. The pros outweigh the cons if you have the money to spend considering how much more these are than comperable android tablets.", "Date": "December 30, 2013"}, {"Title": "Wifes Toy", "Author": "victor a. quaranta jr", "ReviewID": "RMRD11B7V8WY8", "Overall": "5.0", "Content": "My wife is very thrifty and seldom ask for anything. She wanted a I Pad and i purchased her a kindle Fire, wound up sending it back she was unhappy. Picked her up the I Pad Air. She absolutely loves  this thing . Had to spend a little more but all the apps she wanted down load and its a lot more user friendly. T.Q........", "Date": "December 18, 2013"}, {"Title": "Nice, but some issues.", "Author": "Bobby Anderson", "ReviewID": "R1CLBFHLSBQIWC", "Overall": "4.0", "Content": "Love it overall.  Amazing product.  I have an ipad 4 and this in my house now.  The size and weight of this is terrific, though the comments about the brightness being less and the screen feeling a little cheaper rang true to me as well.I am also having the memory loss issue on the ipad air some have mentioned.  First, there is an ipad 4 in my household and it is also 16gb and, having passed it down to a family member, was very happy with it.  That said, the 16gb Ipad 4 has about 13.5 gb of usable space prior to loading anything, while the air somehow has 12.8.  Not really a big deal.  However, I have noticed my usable memory dropping dramatically (500 mb) on the air when doing streaming or using facetime.  I don't recall that happening on the ipad 4.  The memory does not recover afterwards, even after days and seems to continue to drop 100mb every other day even when I'm not using it.  It is not the apps or newspapers loading, as I pulled a lot of stuff off to check it.  I'm a light user of apps and don't store content, so 16gb was enough in my prior ipads, but on this one I'm getting worried. I was able to free the memory back up, but only after doing a full restore of the ipad as new and letting my cloud stuff stream back.  I really don't want to have to do full restores every few months.  For those interested, when connecting to itunes, it is the \"other\" category of memory that keeps expanding.  Tried calling Apple several times, but all they could offer was to do the restore.", "Date": "November 18, 2013"}, {"Title": "Why did I wait so long", "Author": "RUSH46", "ReviewID": "R3TO3MYT3N3189", "Overall": "5.0", "Content": "Bought this specifically to download and use some speech therapy applications for my wife who had a stroke.  The delivery was timely.  The applications are loaded and have been very useful.  All the other things we can do are a bonus.  We use the games after therapy in the morning.  And we can even check our e-mail.  We are getting along in age and were hesitant to spend the money on something so modern, but it really is not that difficult to use after a few days.", "Date": "May 19, 2014"}, {"Title": "The best tablet on the market when you consider the ecosystem and support. But not without some downfalls due to recent changes.", "Author": "Sean Cushman", "ReviewID": "RNGUUYGUJBQ80", "Overall": "4.0", "Content": "Alright so I know if you are reading this then you already have your mind set on a new iPad and hey you know what? That's great. I'm a dual user. I love my PC products and Android and I love my mobile Apple products as well. I don't take sides or at least only when it concerns the best bang for the money at least. I've been using iPad's since I bought my mother her first one at release (she is disabled and iPad's (or tablets in general) are wonderful tools for those less than capable of using a keyboard and mouse. I also fell in love with it , the design was just amazing , the feel was great and the capability was very impressive when you consider at that time tablet's were barely around at the consumer level. Seeing the look on her face made it worth every single penny. Prior to getting the iPad she suffered a horrible infection and was hospitalized for 4 months fighting it , nearly losing her life in the process. She lost the capability to stand and only has use of her left hand now (with about 80 percent capability) and couple that with MS and you get someone who can't really use a mouse and keyboard setup easily.I wanted to state that before what I'm sure I will be accused of being a critical troll about the latest iPad version compared to a recent Android tablet I bought.Now onto the experience thus far with this new iPad , here is a list of what I like :1. LIGHT. Seriously , incredibly light. I can hold it in one hand very comfortably and its not meant to be held in such a way for the regular Joe ( I got big hamhocks for hands). I love it when technology trims up as it shows that its forward march is continuing without pause.2. FAST. Even over the iPad 4th generation this lean machine is even faster at multitasking which is good because it will help versus the recent Android tablet I bought which is a multitasking god.3. THIN BEZEL. If there is one complaint I have for the consumer electronics of the world in general its that we haven't done enough to remove overly large bezels from products. I hate them. I find they are a waste of real estate but I also realize that this is part of the technical limitation and the need for space for various reasons (board hardware , batteries and so on). The iPad Air's bezel is at least half of all previous iPad's. Very much appreciated Apple.Those are the biggest reasons to buy an iPad Air and they are really good ones in my mind. If you already own an iPad 4th gen though I don't think they are enough to justify the upgrade unless you really want the reduced weight (the iPad 4th gen is a pound and half while the iPad Air is only a pound flat).Now to the cons. And there are some that are very concerning and especially so if you tend to treat your products poorly (many people do..) :1. THIN PIECE OF GLASS. So while I realize that Gorilla Glass 3 is very impressive and amazing tough for its extremely thin profile .. I also feel its wildly out of place with a product like the iPad. People who buy iPad's and especially families tend to treat them pretty rough. I've seen children as young as 4 drop a 3rd gen iPad like a brick onto hardwood and it remained intact without a mark to bare. This new iPad Air has a very thin piece of GG3 that helps reduce the weight (and I would imagine the cost of manufacturing for Apple) but its recently been shown in several Youtube videos that when it comes to endurance its actually pretty fragile. Its very easy to crack it and especially so if it lands on its side. So while all the previous generation iPad's had a nice thick piece of glass to help protect the product this new one .. does not. It also sounds hollow when you tap it. And for some that drives them crazy. I don't mind this as I know its glass and not plastic like some \"claim\".2.COST. Since Apple did so much to slim down the cost of this new iPad and they used the EXACT same guts as the iPhone 5 (with a different layout and power profile) and yet they also trimmed down the battery size then how come this isn't any cheaper? The iPad mini is supposedly Apple's response to critics about the fact that its always the same price in each iteration. Apple , Android has fantastic alternatives now and the Google Play marketplace is becoming quite a fleshed out competitor , its time to start taking Android more seriously as a competitor and stop living inside your own eco bubble.3.SUB PAR HARDWARE VERSUS PRICE. Even with a new 64-bit chip (which isn't supported very well but that will change) the iPad is quite a puny product in terms of hardware specs. NOW BEFORE YOU FREAK OUT.. I know that Apple has optimized it heavily and that living in a very closed ecosystem (versus Android) gives it this advantage HOWEVER.. for what you are paying for you should be getting more. 1GB of RAM for instance? That's what I expect in a mid to low end smartphone these days. I can imagine those who complain (and have for a while now) about the random crashes because of running of memory would really love an extra 1GB of RAM for the iPad. I would also imagine it would do wonders for those who love to open programs by the truckload and not have to worry about random crashing errors due to running out of memory.Could you imagine a quad core A7 chip with 2 GB's of RAM? That beast would sing and you could do even more with an iPad that powerful. I would bet that when Apple moves towards 4k resolution that we will be getting those exact specs to run at that monster resolution but still I would have loved that right now.So my remarks about a recent Android tablet purchase.. I bought a Samsung Galaxy Note Pro 12.2 and I just have to say its a real beast and outshines Apple's best in many ways. The resolution is higher (2500x1600) and it comes with the S-Pen and S-Pen software plus an office suite of apps. Now the Note Pro 12.2 is made for business applications the price of it versus 64GB iPad is about a hundred more. But for that hundred more you get massive hardware support , with an OTG USB cable you can connect external hard drives to it , you can also add memory through SDXC cards (up to 128GB's) and Samsung's Touch Wiz is getting quite mature and really offers a very set of apps. Not to mention the screen size of 12.2 inches versus 9.7. However the iPad beats it in terms of weight , the Galaxy Note Pro 12.2 has a massive battery (but it lasts about 11 hours with heavy use) and the weight puts it into a class that speaks more towards laptop replacement that competitor to the iPad. However you can buy the non-pro versus for $100 less (you won't get the S-Pen) and still a get a monster solution.Android's tablet app market is getting better and better each week and there are plenty of apps that support landscape mode without issue. One thing I always thought Android did better was application scaling , something Apple could learn from frankly. The Galaxy Note 3 Pro in my mind is a Android finally getting its ducks in a row and Apple is going to have pick the pace to keep with Android's MASSIVE market share which is over double what Apple's is now.THAT BEING SAID.. I'm keeping the iPad Air. I love the Galaxy Note Pro 12.2 and its just a great tablet but I don't really have need of its business level features. But if I were going to recommend a tablet for a business minded individual I would recommend they go for it because it blows the iPad away for business use. The free office app it comes with is more fleshed out than MS Office for the iPad and the extra screen real estate is a big bonus for anyone attempting real work on it. But for a guy like me the iPad has an easier to consume profile and that's what I really love about it.If you intend to buy this product however (the iPad Air) I HIGHLY recommend you buy the Apple care warranty. You will be extremely glad you did with this powerful but more fragile new version of the iPad.", "Date": "April 20, 2014"}, {"Title": "As a Laptop Replacement, No Real Downsides So Far", "Author": "Marc Kennedy", "ReviewID": "R135BX9BW5FCYG", "Overall": "5.0", "Content": "I'm a grad student and when my laptop went on the fritz, this was my replacement.Pros - The Apple App Store is easier to navigate and more trustworthy in my opinion than the Android app store.- like my iPhone, the interface is clean and much less cluttered than my Samsung tablet- the onscreen keyboard is very useable- there are a lot of available accessories, as should be expected- this seemed like less of a toy to me than a Kindle Fire- free iWork apps- so lightweight- great battery life- the screen is beautiful- I can download all my docs from DropboxCons- the external button to put it to sleep is small- it may just be the screen protector I purchased (Tech Armor clear), but the distance between the home button and the edge of the bezel is small and the screen protector will not seal there- no fingerprint scanner like the iPhone 5s- there is currently not a flawless PDF app for iPad, so using Adobe reader on my laptop was a better experience", "Date": "March 23, 2014"}, {"Title": "Ipad Air", "Author": "Sallyann Wagoner", "ReviewID": "R2QCORPE8PPSFZ", "Overall": "5.0", "Content": "I absolutely love this!!  I use it to replace my computer when I am just doing web searches and reading magazines.  I love all the apps it has available and I have even gotten my husband to use it too.  This replaces my original Ipad which I received for Valentine's day the first year the Ipad came out.  It still works great, but is slow and has no camera.  Buy this now!!!Sallyann", "Date": "January 20, 2014"}, {"Title": "Fantastic iPad air", "Author": "Tiffney Brink", "ReviewID": "R14ZBL4XU2RQKJ", "Overall": "5.0", "Content": "It was brand new right out of the factory package. It has an amazing battery life and a beautiful display.", "Date": "January 20, 2014"}, {"Title": "Much better than my iPad 1.", "Author": "Herb Lippe \"Indi\"", "ReviewID": "R3KVEPIVAK1A9", "Overall": "4.0", "Content": "I bought this to replace my iPad Generation 1.  Much faster, clearer, LIGHTER, and more powerful.I think I made one mistake that has caused a minor problem with Safari. Instead of setting everything up from scratch, I downloaded everything from my the Cloud Storage for my iPhone 5S. The problem is I can get TABS in Safari.  I bypassed this by using the Mercury Browser and, as soon as the Christmas panic dies down, I'll bring it in to an Apple store and see what I did wrong.Definitely worth the upgrade.", "Date": "December 27, 2013"}, {"Title": "Lives up to the hype", "Author": "S. Harrison \"LovePinkCJ\"", "ReviewID": "R3OMLOHS67H7YF", "Overall": "5.0", "Content": "I've been true to Apple for many years but recently took the plunge and went to Samsung for my smartphone.  I almost got the Samsung tablet but just couldn't bring myself to it.  If you love Apple...  you'll love the newer, leaner, and cleaner design and OS. If you're technologically advanced...  I'm sure you'll find the flaws but you'll still enjoy the iPad Air.", "Date": "December 21, 2013"}, {"Title": "Awesome", "Author": "Helena R McMaster", "ReviewID": "R2QNSUH3ZH2LAQ", "Overall": "5.0", "Content": "This is my first iPad.  So I can't compare to any of the others.  It looks great feels great, and most importantly it works great and once you get the easy setup process done it operates great and very easy to use.  I did feel the need to purchase a case because it is very thin and light weight.  I purchased the survivor case.  Great for this case, makes the weight heavier but protects if dropped.", "Date": "December 14, 2013"}, {"Title": "iPad air crashes ! ! !", "Author": "Hank", "ReviewID": "RVAGWCG6KOG1P", "Overall": "3.0", "Content": "It's a nice tablet. Fairly fast. I got the AT&T; model and internet connections are fast. However, the darn thing crashes frequently !Very aggravating.", "Date": "February 17, 2014"}, {"Title": "NICE !!", "Author": "Swim Coach", "ReviewID": "R187JTPKIE0CPX", "Overall": "5.0", "Content": "I hesitated buying another iPad when my family already has 6 (different models and gens). These are great products and no wonder Apple is winning the tablet war. This is a testament to Apple's quality and attention to detail. However, the iPad Air exceeds all expectations. It is smaller, lightweight and long-lasting. The Retina screen was an improvement (aside from speed) during the iPad's evolution. The iPad Air is more revolutionary than evolutionary: highly recommended for those considering to replace their notebooks!!", "Date": "February 2, 2014"}, {"Title": "Lover the iPads", "Author": "marie \"teach\"", "ReviewID": "R1HUZW1RS647DS", "Overall": "5.0", "Content": "If you are on this site, you are trying to decide whether to buy the iPad or another tablet such as Samsung or other device. I mentioned Samsung because I love their phones, tv's, etc. However, when comparing the note to the iPad, I opted for the iPad. One very big reason is I love to buy, rent, download movies to watch. Having an iTunes account makes this so very simple. Also, I have a ton of iTunes credit (I always ask for iTune gift cards whenever the occassion arises). In addition to iTunes, I love Pages. When I got this app, it was free! However, if you do a lot of word processing, you might want to invest in this much needed addition. The great thing about Pages is you can send as a PDF or Word doc via email.Some are trying to decide if they should buy a 16, 32, 64, etc. Speaking from experience, a 16 will not be enough for must adults, but would be fine for a child. I know you can store in the \"cloud\". However, you have to have a wifi in order to retrieve from the \"cloud\" unless you have the iPad with a cellular service (which to me, is a waste). So, having your documents available whenever needed is a plus. Therefore, a minimum of 32 would be great.All said, I love gadgets and technology. I love having the latest, and that is why with each new model, I will upgrade. However, I think this iPad air will be mine for many years - of course I say that until the next iPad air comes out with the finger print scanner and I will tell myself, \"must have\".If you own one, enjoy! If you are contemplating purchasing, make the plunge (you can return it if not satisfied to most places including Amazon).", "Date": "January 30, 2014"}, {"Title": "Perfection", "Author": "C. Misra", "ReviewID": "R1XHINKVWKIHWD", "Overall": "5.0", "Content": "I had the retina mini which was great but too small for web browsing comfortably for extended periods.  I exchanged it for the Air.I'm much happier with the Air.  The extra screen space is more than worth it to me.  No more panning and scrolling and zooming endlessly with the mini, that is over with the Air.  The Air also plays video and music beautifully.  I actually felt the mini was absolutely perfect form factor for tv, movies, and e books.  The Air does all these things great too, but mini did them better, in my view.  Sigh.....so long, little dude.I had an ipad 4 from feb to yesterday.  Ten months.  It was great.  I sold it easily on Craig's list for $320.  I wish I priced it higher.  I could have likely gotten $350 for it.  In any event, I paid $180 to use it for ten months or eighteen dollars a month.  Fifty cents per day.  I can live with that.Love my new ipad Air.  It is sleek, light and attractive.  Easy to hold with one hand and I have small hands.  I have known girls shorter than me who had bigger hands than me.I recommend the Air.  A superb investment.  Whatever ur needs.  If you read. Or watch tv and movies, or need a great camera, organizer, music player.  It is a great product.  Just go get it.  Sell other stuff if u have to.  You will not regret.", "Date": "December 29, 2013"}, {"Title": "A little underwhelming", "Author": "Lucky Yona", "ReviewID": "R1HJY4K8FH1E26", "Overall": "3.0", "Content": "This will be relevant for heavy users. I gotta say I have a crash or frozen screen pretty much everyday. Battery life hardly reaches the 10 hour mark even when I'm conservative. I feel indifferent", "Date": "February 3, 2014"}, {"Title": "Not good enough!", "Author": "C. Nguyen", "ReviewID": "RLL1W7Q6ZFXZ1", "Overall": "3.0", "Content": "I love apple perfect hardware and design.  The new iPad air is not a good buy imo.  The bezel is too thin thats its so hard to hold without touching the screen and activate random things.  Apple didn't upgrade the memory in the iPad Air.  It is still 1GB.  I don't know why they do this but with only 1GB the iPad won't be good for more than 2 years.  Same thing happened to the iPad 1 and iPad 2 because of the limited memory that make everything much slower.  I think the 1GB memory is the very bad flaw on the new iPads.  Don't support apple because you own their product or you are their fanboy.  It is very stupid to do so.Although I love apple's hardware and software, I would not buy another iPad or other apple's products unless I see that they don't hold back on the upgrades.", "Date": "January 5, 2014"}, {"Title": "Just what I need!", "Author": "Awesome Possum", "ReviewID": "R2I6EP2UETQM8F", "Overall": "5.0", "Content": "The iPad Air is a fantastic tablet. Just what I need. Thinner and lighter than my sadly broken iPad 3, but now that I have had a chance to really use it, I think I probably would have upgraded even if I didn't break my last iPad. There are not too many changes (and there don't have too be) but the deal makers are the new and lighter design and the the 64-bit A7 chip that will pave the way for better applications and performance. No touch ID which is ok because I don't like having a pass code on my iPad anyways where on the 5S it is greatly appreciated. Same fantastic resolution as its past 2 models but now has better power to push them all. Gaming and productivity apps look and feel great and I can use them to do everything I need.", "Date": "December 1, 2013"}, {"Title": "Best tablet in the market that i could find for my wife THOUGH i am a Android fan!", "Author": "Moze", "ReviewID": "R2NB4JHKWOVJQT", "Overall": "5.0", "Content": "Though it was $15 more from Apple, I am okay with it. My wife loves it. The perfect user device no questions asked.", "Date": "November 26, 2013"}, {"Title": "Best large tablet on the market, but more choices than ever.", "Author": "Nick", "ReviewID": "R1DW9VYGONR4CK", "Overall": "5.0", "Content": "As a stand alone purchase, iPad's are still the best tablets on the market. As an upgrade from prior iPad's, the Air is going to be the biggest reason to upgrade in recent memory. Users from the 3rd Generation down will see substantial benefits to speed alone.What Works:It's substantially lighter. Easier to hold and use while watching movies or reading a book.It's substantially faster. The upgraded processor is so fast that most users will be future proofed for the next two years or more. 64 bit processing will give this tablet some legs.the battery charges substantially faster. This is a nicer reason to upgrade than most realize. The Air's battery is smaller, and holds it's charge very well compared to older models on iOS7. I had problems on my 3rd gen keeping it charged compared to the zippier charging Air.Lightning port is much more convenient, easier to plug in compared to 3rd generation and back.Speakers seem to pack more of a punch.What doesn't work:the screen has a slightly hollow and thin feel on the finger. As a consequence of a lighter tablet it's expected that the display lost some of it's heft.the volume buttons are spaced a little too far apart for me. Harder to press.volume speakers are annoyingly where you'd hold the tablet horizontally.-----That's my impressions with the tablet. My recommendation is if you have $500 or more to spend on a tablet, the iPad Air is going to be your first choice. Android hasn't been competitive in this section of the market. If you're looking for a less expensive, smaller tablet, then you're going to be looking at the Kindle devices or the Android devices.For Apple users, i'd recommend people on the 1st and 2nd gen devices take the plunge, the changes are enough to warrant the upgrade. 3rd Gen users are in the grey area. They are not going to see any difference in screen quality, and the speed of the Air may not be too large to matter for basic use. 4th Gen users are totally fine where they are.", "Date": "November 14, 2013"}, {"Title": "REPLACED MY IPAD 3, WAS IT A GOOD DECISION? LETS FIND OUT. IN DEPTH.", "Author": "Kanwar Anand", "ReviewID": "R104L6A6P3VSAW", "Overall": "5.0", "Content": "This is my third iPad. I decided on a 32GB because I wanted to load movies on it and a lot of music and not worry about space. I mean when they announce a new version of iOS the last thing I wanted to do was delete something dear to me. I was replacing my iPad 3 16GB with an iPad Air 32GB. There have been many changes. Are these changes enough to warrant the need for an upgrade? I am still not entirely certain but I am more happy than sad about doing that. I haven't been able to sell my iPad 3 but its still looking for a new home. So guys, here is what I like about the iPad Air, what I don't like much and what are some key features or new introductions to this device.The Positives of Upgrading to iPad Air -1) It is lighter, the surface area around the display has been reduced, the design is not revolutionary by any length of a realistic understanding of science but it still has the same battery life. It has lost that annoying 30 pin connector which seems so inconvenient to the new lightning port. I can use this one hand, I can expect the same battery life, the volume button on the iPad 3 seemed less delicate, the iPad Air definitely feels a lot more delicate than the iPad 3 which seems so robust now when I pick it up. But overall I would give them 4 stars for the design changes.  I wish it never heated up though but purely from the WEIGHT difference I think its good, the screen for some reason looks better, it must be the upgraded graphic chip.2) The Sound - This is the biggest winner for me. Imagine not having to turn the sound to 100% on your iPad air. It rivals my matchbook air in terms of how loud it is, yes it isn't as loud or roomy or filling but it is more than satisfying. They now have two speakers so its a stereo sound. It is louder than my iPhone 5 and certainly more clear, catchy, bass adoring than I would image from an iPad. This was the surprise winner for me. A bit of a let down in terms of design is that if you're lying and watching a film in portrait mood the speaker sound may be muffled by your stomach/body part in contact with the base of the iPad air. The solution is LANDSCAPE mode. The two speakers are now located on the left and right side of the charging port. No complaints on this. The iPad 3 is maybe 30% as loud as the iPad air.3) Battery Life/Faster Charging Speed - I don't know why but I feel the iPad 3 had a longer battery when it was new. A new apple iPad will last you so long, it will need for you to bore it to death to bring it from 100% to 64%. Yes, this is the case with the new iPad but it isn't as good but overall the fact that charging time seems to have reduced by half is a big big big big winner for me. So overall, no complaints. I don't get 13-14 hours like I used to with my iPad 3. I get 11 hours. Yes, I make the best use of the new sound feature. The fact that it charges faster means I don't need to pull it out before 100% and this is a good thing for the battery. With the iPad 3, I have to wait for it to be 100% charged and it can take unto 8 hours. This has been reduced by almost half and I feel 4-5 hours will give you a 100%.4) Processor - The iOS 7 clearly stalls a bit on the iPad 3. Did I notice this before buying the iPad Air? Yes cause my iPhone 5 was faster than the iPad 3. If you're playing quiz up, everything loads in seconds, if you are browsing, it goes boom boom boom like my macbook air. Well nothing quite compares to browsning on the AIR but this is very good. iPad Air is the best device for youtube because of the loud speaker, I can sit with it for hours and discover various things. The processor seems to heat a lot less. There  is never a lag on anything. It doesnt think so much.5) Camera - Camera has improved from the iPad 3. Both the front and the back is more defined. Do I use this? Why wouldn't i?COULD HAVE BEEN BETTERS' WITH THIS IPAD AIR -1) Headphone Jack Placement/Volume Output -  This isn't as loud when using with headphones as the iPad 3 used to be. It is a more customised sound. The headphone jack is located at the same place where it used to be but because the surface area is smaller, I have found that when I am lying down and using my iPad AIR, the wires often get a bit entangled.2) The iPad Air still heats up. I can't for the life of me figure out why I pay a company so much money when they make a product that heats up on full brightness. This is one hell of an annoying feature.3) The back on the iPad Air, the volume buttons, the power button, the menu button - they all seem a bit too delicate in comparison with the iPad 3. This is just an intuition or impression but I can't help but feel it needs to be treated gently.4) Safari has been needing an overhaul for the longest and I feel they need a better browser than the one they have right now. It often freezes on my iPad 3. It should be perfect like iMessage is perfect, like FaceTime is close to perfect, like email is perfect, it isn't quite up there. I would give it a 6/10 in terms of potential.5) iBooks - I read on my iPad more than anything else but the iBooks software also needs some more options of backgrounds and schemes. Apple plays safe for far too long but they need to give more options to make READERS WANT TO READ MORE.6) Syncing iTunes is a bit confusing. There should be more education given to all customers about preferred type of WIFI networks, sometimes applications don't update, I have no idea why they are doing this. I have to go to airplane mode and then go back up. The iCloud feature needs 10GB and Apple need to stop being a cheapskate.Conclusion  -Get the iPad Air if you are looking for something with good design quality, good battery, an extra lightning cable (half joke) , something faster, smoother...this is about a 31% improvement over the iPad 3. Thats a big deal.Of my iPhone, macbook Air, iPad Air - I have always liked the iPads the most. They have reliable battery and never ever ever die on you like the other two. Its that simple and that keen.If they take into account some of the things I didn't like about this product, Apple can be made better overall. Ha!Buy the BLACK one, a WHITE IPAD a strict no.", "Date": "June 2, 2014"}, {"Title": "This is more a review of the seller than the product", "Author": "LaCretia Gelley", "ReviewID": "R1FX1O1JHRS33H", "Overall": "3.0", "Content": "I love the iPad. The issue is that I am unable to get AppleCare on this because the seller purchased longer than 30 days ago. Apple will only allow you up to 30 days after purchase to add AppleCare. Now I'm screwed as far as that goes.", "Date": "May 20, 2014"}, {"Title": "Awesome.", "Author": "Prasuti", "ReviewID": "RANZ97R2E549T", "Overall": "5.0", "Content": "The Apple ipad air is the best tablet made, period! It's light, fast and really easy to use. If you've got an iphone, you'llbe disappointed if you don't get an ipad instead of another brand.", "Date": "January 19, 2014"}, {"Title": "She loves it!", "Author": "JoeBotts \"bottieri\"", "ReviewID": "RX1U3A3YCPAI6", "Overall": "5.0", "Content": "This was a Christmas gift and she loves it.  We took it on out RV trip over the holidays and it worked out perfectly.  No more cumbersome laptop.", "Date": "January 19, 2014"}, {"Title": "Still the best!", "Author": "disks did,e", "ReviewID": "RGY5QBTRH4FJH", "Overall": "5.0", "Content": "I have owned the ipad air, 16gb, for a little over a month now, and it is perfect for my everyday busy life. It is slim, lightweight, and fast! It has the biggest AppStore out there, which is good for my kids. My teenage son loves it because he can do school research on it! No more using an old desktop. This tablet also has  the new a7 chip which makes faster. Even though I did not buy it from amazon, I bought it from AT&T;, you should consider buying it from here too,.", "Date": "January 18, 2014"}, {"Title": "posted earlier", "Author": "Dale Carrison", "ReviewID": "R1OO2UZAD55II4", "Overall": "5.0", "Content": "use it every day  have kids, grandkids, and great  grandkids entertaining us in picture, video, and sound  what could be better", "Date": "January 18, 2014"}, {"Title": "Great", "Author": "gary doyle", "ReviewID": "R1XOLSK5LU10NF", "Overall": "5.0", "Content": "Gave it to my wife for christmas. She is doing dishes . I asked her how she likes it . Loves it 5 stars", "Date": "January 18, 2014"}, {"Title": "Nice iPad air and a great deal!", "Author": "Junevreyes \"Jun\"", "ReviewID": "RRHQC8ICQR1VV", "Overall": "5.0", "Content": "I've been longing to buy an iPad air since it came out. Since this deal came, I took as an opportunity to have one. It's a great deal and I really liked my new iPad air! Thanks*****", "Date": "January 3, 2014"}, {"Title": "Very happy customer", "Author": "Janice \"Janice\"", "ReviewID": "R2FOX3W8I5LSY6", "Overall": "5.0", "Content": "This is my second ipad, when I saw the ipad air I definitely wanted to upgrade.  It arrived quickly and was packaged well.  This vendor is very good.  The ipad air itself is everything you expect from Apple and everything I wanted.  Very, very happy and highly recommend the product and the vendor.", "Date": "January 2, 2014"}, {"Title": "Apple is the Best!!!!", "Author": "BioHazard", "ReviewID": "R1N91OA7RXUSVM", "Overall": "5.0", "Content": "I love the new IPad Air. I got it the day it came out in stores. It starts with the ultra-sharp exterior. If you loved last year's iPad Mini, you'll feel right at home with the Air. Apple essentially built a larger version of the Mini with the Air, by slimming the beveling of previous iPads to achieve a sleeker framework.The lack of heft makes the Air just a little more comfortable: An LTE-equipped Air weighs all of 1.05 pounds. Wrapped in a comfy and protective Apple Smart Case, the Air weighs 1.368 pounds, still lighter than a third-generation iPad by itself. Despite the lack of size, the Air is no less tough. It's sturdy and not at all easy to bend.The Air feels that much more like an electronic magazine. The Retina display, once the standard for all screens but also facing more competition this year, helps that; reading text and viewing web pages on that crystal-clear, pixel-dense screen is the same joy it was when Apple first built Retina screens into its tablets early last year.If this is all Apple did, it would likely still be enough to keep it on top. But the iPad Air does far more, starting with the new processor powering the entire experience, the A7. The same dual-core, 64-bit A7 chip that debuted in the iPhone 5S is in the iPad Air; and initially, this seems like a disappointment. In theory, you expect something more in Apple's flagship tablet, something a bit more powerful, with perhaps more graphical horsepower.In practice, you won't notice a thing. Web browsing and apps still handle as snappily as ever, even if you have a gaggle of things running in the background. Top-tier games such as Infinity Blade 3 continue to deliver. A pleasant surprise is also how quickly some of the beefier games, such as Anomaly 2, loaded, compared to previous iPads. You'll move into and out of levels just a little bit more swiftly, and that helps make the entire gaming experience more friendly and natural. It's hard to know what this really means for Apple gaming, but don't rule out the possibility of more console titles being ported to the iPad.Apple realizes the limitations of the 64 GB storage too, offering a new 128-gig model. You'll pay a more-than-average-laptop premium here ($799 for the WiFi-only model and $929 for an LTE version), but the improved storage is intriguing, especially for those planning for a game-heavy future. I can now easily and comfortably load all the music and movies onto the iPad Air that I want and still have plenty of room left over for games such as XCOM: Enemy Unknown and Civilization: Revolutions.Battery life is steady, even if it's not mind-blowing. Apple claims the iPad Air can get you 10 hours on a charge, and that's definitely true. Even when using Apple's navigation for a long trip to Washington, I easily got through a day without needing to charge; and more casual usage, such as Web browsing and email checks, is no problem.The Air's lone shortcoming is that it lacks the fingerprint identification technology that debuted on the iPhone 5S. But I'd be hard-pressed to claim that this was some glaring omission; every other tablet you're going to use this year lacks such tech, and I've never seen that tech as an absolute must-have.The resulting tablet is as pleasant to use as they come, and it's backed by some consistently solid software. Android has made a tremendous run over the past few years, and a plethora of both Android and Windows Mobile devices are truly intriguing this holiday season. But if there's one consistent shortcoming on those devices, it's the up-and-down support of operating systems.It's hard to know whether this Android tab or that will support Google's latest OS, but that's almost never a problem with iPads. iOS releases are generally consistent and stable, the lone knock on Apple being its lack of Android-like customization.And while the Apps Store and iTunes are also battling competition from Microsoft's stores and Google's Marketplace, Apple's setup continues to set the bar, managing to be intuitive and easy to use and enjoying more and more high-profile digital releases.", "Date": "January 2, 2014"}, {"Title": "Love It!", "Author": "Amy Leftis", "ReviewID": "R9JQAS7K7K0PK", "Overall": "5.0", "Content": "Much faster than the original ipad. A little smaller and lighter in weight. Easy to use and carry with you.", "Date": "January 2, 2014"}, {"Title": "Very Nice!!", "Author": "Cyndi", "ReviewID": "R3MYP9QATDQD5A", "Overall": "5.0", "Content": "I struggle with new technology so I'm still learning about my new iPad Air, but I really like it so far.", "Date": "January 1, 2014"}, {"Title": "I decided to upgrade.....", "Author": "Brian Upton", "ReviewID": "R3787J9NJCNBLJ", "Overall": "5.0", "Content": "I have a 1st generation iPad and decided to upgrade to the iPad Air as I found some of the newer apps on the market are not compatible with my older iPad. The first thing you notice is the increased speed of the processor and the iPad Air is so much lighter. The camera and video functions are nice additions even though I have not used them yet. The unit walks you through the set up process and linking up with your Wi-Fi very quickly and your good to go! Don't hesitate if your on the fence about upgrading from the first generation to the new iPad Air. You'll be glad you did.....", "Date": "June 4, 2014"}, {"Title": "A used peice with password protected...", "Author": "Deepak", "ReviewID": "R31T6VQE70T5CK", "Overall": "2.0", "Content": "It says that its a new piece but i got a used one, it says Moma's ipad when i connect to my laptop. It has a password lock too, i dont know what the password is...Please help me...", "Date": "June 3, 2014"}, {"Title": "another great Apple product", "Author": "R.M", "ReviewID": "R3MNNCN9SI93YO", "Overall": "5.0", "Content": "I love the IPad Air, it frees me from my desktop so I can work from anywhere! I haven't even begun to look at all the apps!", "Date": "June 2, 2014"}, {"Title": "A truly wonderful piece of hardware.", "Author": "Kyuzosan", "ReviewID": "RG3UUEOVR7FY", "Overall": "5.0", "Content": "Please note that when it comes to this market, I prefer Samsung based Android devices. Without any bias, this is a solid tablet computer. The touch screen is responsive, has great performance (iOS 7), and has outstanding battery life. Everyone in the family has a use for it, and with the right amount of storage and price point, is a valuable device. The merchant at which I purchased it from had it priced $100 below retail MSRP during its 1st half year on the market (March 2014). A great recommendation as a gift.", "Date": "May 26, 2014"}, {"Title": "iPad is the best !", "Author": "Bruce Holms", "ReviewID": "R3NHSO4M0POTRS", "Overall": "5.0", "Content": "I had the original iPad that I received as a gift back in April of 2010. At that point (a long time ago in the tech world) very few people took it seriously. My only concern at the time was the lack of a \"USB' port and camera. However, I was very eager to use it and I did. By the end of the year, I had accumulated 25 apps and was already \"sold\" on its usefulness.By 2012, it became obvious that with the release of video cameras and newer OSs, I was being left in the back - so I began to wish for a newer version. Recently I saved up enough money (about $800 total when you add in insurance) to purchase the latest iPad which I am reviewing now. I still always buy the 64GB version because I always need more space.What I like most about the the new iPad is that it is much faster and a lot lighter. What I don't like is the lack of a \"USB\" - but I guess you can't have everything.", "Date": "May 26, 2014"}, {"Title": "Gorgeous. Solid as a rock. Fast as hell. Just about perfect.", "Author": "S. Krason", "ReviewID": "R3J5RGZU0OFLFM", "Overall": "5.0", "Content": "Apple attracts haters these days because they're now considered the overpriced behemoth when they used to be the little engine that could. Whatever. This is the best-built, fastest tablet you can buy.Pick up any other tablet and twist it. It moves. It creaks. It's made of plastic and feels cheap. The iPad Air doesn't budge or make a peep. It's solid as a rock. It's gorgeous to look at, a pleasure to use and I adore it.", "Date": "May 24, 2014"}, {"Title": "Over $450 and another $9 for a user manual ??", "Author": "olrick", "ReviewID": "RYFZKO8HR9DR4", "Overall": "4.0", "Content": "My first Apple product, my first swipe screen---and it comes in slick package with a postage stamp of \"instructions\"......You want to read about how to use your new iPad Air ?  Be prepared to BUY  your operator's manual on line from Apple--ifof course you can navigate through the App store!.It may be greater'n'grits,  but I am struggling with basic functions  and a little bummed out that \"everyone\"  thinks these things are intuitive.  Shucks, I almost sent it back, because the harder I 'touched' the less often it worked !  It took a young relative to explain soft swipe and soft touch...", "Date": "May 21, 2014"}, {"Title": "Difference from iPad 2 to iPad Air is leaps and bounds.", "Author": "Nick", "ReviewID": "R3Q1K3UCP1BXS2", "Overall": "5.0", "Content": "Difference from ipad 2 is night and day. Retina display looks unbelievable. The speed difference is extremely noticeable. If you have an ipad 2 and you are considering upgrading to ipad air, they are in different leagues. Would HIGHLY recommend to the ipad/apple enthusiast.", "Date": "May 14, 2014"}, {"Title": "love it", "Author": "TROY MILLS", "ReviewID": "R3EWY3Z2G1RY2", "Overall": "5.0", "Content": "Really love the Air, still have the iPad 3 which my wife now uses, she loves it, i can see a little better graphics on the Air, great product", "Date": "May 13, 2014"}, {"Title": "If you already have the iPad 4; keep it!", "Author": "Wade A Carr", "ReviewID": "R1OFWPERK71Z05", "Overall": "3.0", "Content": "I replaced my iPad 4 w/ Retina Display for the iPad Air.  I should not have wasted my money.  It really isn't that much lighter.  The frame is smaller on the Air so to be prepared to purchase another case.  The cases available for the Air are not as nice as the Ipad 4 cases.  The only person that wins on this deal is my nephew--he gets a free iPad 4.", "Date": "May 11, 2014"}, {"Title": "Best purchase I've made here,", "Author": "CTV", "ReviewID": "R1WJLMDS1Q03I9", "Overall": "5.0", "Content": "The IPad is wonderful! I adore everything about it. The customer service and speed of delivery was exceptional. As a matter of fact, I love this little contraption so much I have already purchased two covers for it-and that's not like my \"usual self\" LOL. Yes I have a high speed high performance computer and an IPhone but this IPad Air still rocks,", "Date": "April 16, 2014"}, {"Title": "Much better than older iPad", "Author": "P. Sweeney", "ReviewID": "R3171COVKXJDXS", "Overall": "5.0", "Content": "I am very happy with this new version of iPad Air.  It is not too heavy to use in the living room.  The graphic or picture quality is excellent!", "Date": "April 15, 2014"}, {"Title": "I got this one very quickly and I'm very satisfying the product", "Author": "Yohan Chang", "ReviewID": "R1KJQPP1GLPHWJ", "Overall": "5.0", "Content": "I used to use iPad 2 (no retina display) for a long time.However, I moved to Galaxy Note 10.1 for writing in my class.(I had two notes 2013, 2014)Obviously, iPad writing function can not overcome Galaxy Note's; since they has Wacom sensor.I used Galaxy Note 10.1 2013 for a year. Exactly a year later, the machine had been broken.So, I had to decide between iPad Air and Galaxy Note 10.1 2014.....Because of my class, I had to but Samsung product again.However, as you guys already well know, there are not many apps on Adroid. Still iTunes has a huge of app store.iPad air is very light and clear.If you are student, I strongly recommend iPad air instead of Galaxy Note 10.1. Of course if your considering is not writing only.There are many apps even school such as library.", "Date": "April 14, 2014"}, {"Title": "ipad", "Author": "raymond dingler", "ReviewID": "R3CKFVGT1KHJZ3", "Overall": "5.0", "Content": "I bought it for my wife & she loves it.It came faster than she expected it.She gives it an A+ .", "Date": "April 14, 2014"}, {"Title": "Son loved this..", "Author": "Melinda Casado", "ReviewID": "R30Q0ZMV11VQXU", "Overall": "5.0", "Content": "It was a gift for our son, and it is his first iPad!  Myself and dad have older model iPads...after seeing and testing the iPad Air, I want one!  Will ask for it for my birthday, and will count myself fortunate if I get one!  It's so much lighter and easier to lug around than older version!", "Date": "April 14, 2014"}, {"Title": "My 1st Ipad !  Did not know what I was missing!", "Author": "GCP1022 \"GC Poli\"", "ReviewID": "R1G8BAVGZIZKCY", "Overall": "5.0", "Content": "I purchased my first Ipad ever and did not know what I was missing, my family and I love it. I read all the reviews on cnet and here!Glad I made the choice, next ipad I will get the 64 gb, due to the great deal on amazon, I could not resist in getting the 128 gb, a lot of apps have already been added and now pictures and movies will soon follow!", "Date": "April 13, 2014"}, {"Title": "My very first apple product... and i really like it alot.", "Author": "IMvVIP", "ReviewID": "RP3R40MNINAWR", "Overall": "5.0", "Content": "I use to have asus t300 android tablet for 2years.But important stuff is i am using android phone for long time.don't need to use tablet that much because my phone does all.however move to ipad.. wow new world.news, email, apps, games, movie, music and cloud storage.so far so good.i am so happy to having this apple ipad air.", "Date": "April 12, 2014"}, {"Title": "Love it!", "Author": "Whoever", "ReviewID": "R1RPV81O35A727", "Overall": "5.0", "Content": "I drug my feet about buying an iPad for a year. Well, I actually bought an iPad retina a year ago and took it back because I was disappointed in how heavy and clunky the unit was. The new changes to the iPad Air makes it soooo much better, and I love it. I checked out the 10\" Samsung and decided it just wasn't enough, and I actually bought the Samsung Tab 7\" last fall, but neither of them hold a candle to an iPad for speed and sharpness. There are a load of androids out there, nothing comes close to an iPad. The battery time on my Samsung Tab 7 is so short I didn't even reconsider the Samsung Tab 10 when I decided I had to have a bigger screen. Great battery time on an iPad.", "Date": "April 8, 2014"}, {"Title": "excelent product", "Author": "Yasmin Porteles Avila", "ReviewID": "R3KSM3CO13GYKO", "Overall": "5.0", "Content": "Excelent product. It arrive on time.  It was a gift to my husband and He really enjoy his ipad. I got to him another tablet before and he use once and never again. With this one he use all the time.", "Date": "April 8, 2014"}, {"Title": "prefer a laptop", "Author": "Suzanne", "ReviewID": "R3CCWOZ6TS37VP", "Overall": "3.0", "Content": "I purchased an iPad as my friend was constantly using hers on her recent visit.  I always heard Apple products were so easy to use.  Probably because I never used Apple before and was accustomed to using Android, I found it difficult to use.  After weeks of reading the manual and trying to play around on my iPad, I tend to still pick up my Android laptop to check emails and search online rather than the iPad.", "Date": "April 8, 2014"}, {"Title": "Just as I expected, Fantastic.", "Author": "WillieArthur", "ReviewID": "R3UQ0BMIYZVCBH", "Overall": "5.0", "Content": "The iPad arrived on schedule, which is always a big plus for me when buying Online. I love the quality of the iPad Air, its brilliant, but I would like to see some features similar to Samsung devices, such as widgets, dual screen, etc. That said the quality of the iPad is just brilliant. .", "Date": "March 31, 2014"}, {"Title": "Wicked-FAST and super slick!", "Author": "conis", "ReviewID": "R1QD1ES422MPAX", "Overall": "5.0", "Content": "(Update below)Upgraded from an iPad 1 (aka an iPadosaur) If you are used to an older iPad, do your homework. Navigation is way different.BTW. If you are running on battery only and don't need location services, shut it off. Its a huge battery sucker.BTW#2: I almost bought a longer charge cable for this (newer lightning connect style) since the one that comes with it 4' is too short for the real world. Instead I spent $3.00 for a 6' USB extension cord to extend between the charge module and lightning cord. It works fine and will keep the battery at 100%  while I am working. IF location service is not activated.One gripe about the AIR seems to be reduced battery life. Shut off the services and features you don't need on all the time.(UPDATE 5/5/14)Been using the #5 air for over a month now... I LOVE IT! Theres a little learning curve moving up from iOS 5 to 7+, not an issue. I had no problem moving my \"stuff\" including apps, to the new iPad.... The finti cover, is sweet, too! Recommended!Next on line is an iPad mini (soon) and I'll elaborate a bit....I use a verizon mifi modem with my pads when I travel. (converts cell-wireless to wifi) Internet/email anywhere. Works great. In doing this, I have scrapped my cell phone and installed skype phone on my iPads... Flawless voip service, full feature with dedicated phone #... All for $6.00 a month a $.o2 a minute pay as I go. Compare that to the cost of a smartphone with data package! So saying, a mini will fit in my pocket as a large smartphone and serve all my needs on the road... IN MY POCKET...iPads are truly \"swiss army knife\" devices if you get the apps and set them up right. Most don't understand all the things an iPad can do.", "Date": "March 29, 2014"}, {"Title": "Hat loves air.", "Author": "Hat", "ReviewID": "R130P27TKDBGUG", "Overall": "4.0", "Content": "GreatVery good product.I bought it for my wife and she is enjoying it very much. I would recommend it.", "Date": "March 28, 2014"}, {"Title": "GREAT", "Author": "Daniel M. Heneghan", "ReviewID": "R1SO9HS21FNIMY", "Overall": "4.0", "Content": "Everything so far is just peachy keen new at this high tech stuff would recommend product LEARNING MORE EVERY DAY", "Date": "March 28, 2014"}, {"Title": "OMG LOVE LOVE", "Author": "Danielle Parks", "ReviewID": "R2FCEVLGIQ6RDJ", "Overall": "5.0", "Content": "This thing is unreal! so slick and sparkly!!! lol I love my new ipad air! it even has siri!! so rad!! ships fast too!", "Date": "March 27, 2014"}, {"Title": "Amazing", "Author": "Rodney Castro", "ReviewID": "R2Q98RN0IA8JEA", "Overall": "5.0", "Content": "I have never owned an ipad before but I really did my research to make sure if I really wanted the latest opacity or would I do with a cheaper older ipad.  The truth is this device is amazing!  When multitasking between games and browser and music this thing flies and I don't even notice any lags! Also the screen is so clear and high def thanks to its retina screen I believe? The ipad air responds to my every touch and swipe with ease and I'm only beginning to learn its many uses!  As a first time buyer who is price conscious,  I will say. This was the best purchase decision I made because for the price I spent,  I got a high performance ipad that beats all others with ease and with all its new features and compatibility with new and upcoming tech, I'm somewhat ready for it too! Other than all that. The ipad air is worth its price even if you are worried about price I say save the extra hundred dollars for this guy", "Date": "March 27, 2014"}, {"Title": "It's nice", "Author": "De cheng", "ReviewID": "R1R1P3XZRQA3C5", "Overall": "4.0", "Content": "I buy it for my friend, and she said it was very beautiful and love it so much, but it a little expensive", "Date": "March 27, 2014"}, {"Title": "Convenient", "Author": "Rachel Griffin", "ReviewID": "R1CHTFJI2R4MXE", "Overall": "4.0", "Content": "I like my Apple iPad Air.  This is my first iPad.  I enjoy the light weight convenience of being able to have it handy when I want to see or show how to craft video to my Mom and friends in other areas of my house.", "Date": "March 27, 2014"}, {"Title": "IPad Air !!!!!", "Author": "Alex Godino", "ReviewID": "RSO45VOPMU3W4", "Overall": "5.0", "Content": "Best tablet on the market right now ! And Great battery life ! Since Started using this ipad I don't use my computer anymore . So impressed !", "Date": "March 27, 2014"}, {"Title": "Great Tablet!", "Author": "Kiki", "ReviewID": "R38GNXWQVXN30Z", "Overall": "5.0", "Content": "Admittedly this is my first tablet, but so far it works great. I couldn't even tell it had been previously used.", "Date": "March 27, 2014"}, {"Title": "Crazy thin and light plus beautiful screen", "Author": "sgun73 \"Steve\"", "ReviewID": "RYT21QYXB65Q9", "Overall": "5.0", "Content": "I've had every generation of ipad and both minis and several androids and this tablet right here and now is the best ever made and my clear favorite. The thinness and lightness almost doesn't make sense. I did find myself confused at first as to how such an amazing device could be made by humans. Maybe it wasn't. Could have come from space. Or maybe the Enterprise from the future brought it back to Apple and said here. Enjoy.But seriously, the build quality is wonderful. As light and thin as this tablet is it still feels solid and sturdy. The screen is beautiful and the colors are deep and rich. The colors are actually noticeably better than the first and second generation minis. I've held them side by side and there is a pretty wide gap between the two in terms of richness of color. The ipad air looks vibrant and robust with deep blacks and warm bold colors.Plus it's very fast. I loaded up GT Racing 2 last night and it ran flawlessly fast and looked absolutely gorgeous. I couldn't believe how sharp the cars looked and the backgrounds had such depth. I should stop writing and go play right now.Despite the other great tablets like the Nexus 7 and 10 or the Samsung Galaxies 8 and 10 the ipad air is in another realm. A realm all to itself. You'll never pick up another tablet and be shocked at the miracle of design you hold in your hands.", "Date": "January 16, 2014"}, {"Title": "Happy", "Author": "Ben A. Holliday \"Ben\"", "ReviewID": "R2IHKIXHY3VJG7", "Overall": "5.0", "Content": "It was a gift to my wife and she loves it, so that makes it worth it. As much as she uses the iphone now she at it with the ipad. Shewatches TV and a movie on the iPad at the same time.", "Date": "January 15, 2014"}, {"Title": "Loved It!", "Author": "Ramon S. Reyes", "ReviewID": "R8GCU6Z8NYVVA", "Overall": "5.0", "Content": "This iPad Air was a gift for my wife and she continues to enjoy it immensely.  The unit is much lighter than her first generation iPad and the graphics are definitely better.  She can now use Facetime since this new unit has a camera, one that did not come with her original iPad.", "Date": "January 15, 2014"}, {"Title": "I love it", "Author": "Ana Sofia De Agrela", "ReviewID": "R1FGBOLGM6Y46Q", "Overall": "5.0", "Content": "The iPad air is the best iPad yet! If you buy it you won't regret it! Really love my new iPad :)", "Date": "January 15, 2014"}, {"Title": "Ipad Air", "Author": "Karen A. Stoner", "ReviewID": "R36A8QXU63KP5F", "Overall": "5.0", "Content": "So far can find NOTHING wrong (CON) about my new ipad Air!!! (PROS- It is smaller & definitely lighter and has some new features!I had previously purchased the Ipad 2nd Generation and was VERY \"happy\" with it! BUT in my very rushed world, I dropped and cracked the front screen...:-( Not knowing what to do, BUT knew I didn't want to be WITHOUT my ipad. (I take it almost everywhere I go.) So when someone asked what I wanted for Christmas, I told them! So now I have my travel ipad and my stay-at-home (Ipad Air).So now, I won't be without my Ipad...:-) I will update my review if the need arises.", "Date": "January 15, 2014"}, {"Title": "Hubby Loves IPAD!", "Author": "Pinkbubblegum4me", "ReviewID": "R1G6Y6OI019WZN", "Overall": "5.0", "Content": "Hubby, who is somewhat tech challenged, loves this! So easy to use and READ! Now I can use the desktop computer again!", "Date": "January 14, 2014"}, {"Title": "Smaller in a good way", "Author": "Aaron Smith", "ReviewID": "R3LQ2RMXC00BYM", "Overall": "4.0", "Content": "I have really big hands and I can palm this thing.  I truly like the smaller bezel around the edge.  That has always been wasted space in my mind.  I came off an iPad 2 and this one is significantly faster.  Text is significantly clearer on the retina type display.  A great design and works like a charm.", "Date": "January 14, 2014"}, {"Title": "Buy one", "Author": "bonniejean815", "ReviewID": "R1R2UWWI65O2LG", "Overall": "5.0", "Content": "Awesome iPad. Best ever yet. Fast. Beautiful display light and thin  Best ever  worth every penny. Battery lasts longer. Than earlier models", "Date": "January 14, 2014"}, {"Title": "Didn't think I needed one....till it was in my hand.", "Author": "Joe", "ReviewID": "R2NUVMMUSXTU0L", "Overall": "5.0", "Content": "Headline says it all. So ridiculously light and sleek. If you're trying to save a few pennies, maybe look at the Nexus 7 or Kindle HDX, but if you want the best, this is it.", "Date": "January 14, 2014"}, {"Title": "GET ONE, IF YOU HAVEN'T ALREADY", "Author": "Mr. T. Echeumuna", "ReviewID": "R3HUSUASDGJIQY", "Overall": "5.0", "Content": "I am so pleased with my iPad Air. It is unbelievably light for an item this size. You will not believe it. If you have had ones of the earlier iterations, then you will know what I am on about. But if not and you are looking for a tablet - money no object - then get this iPad, and  you won't regret it.Enough said!", "Date": "January 13, 2014"}, {"Title": "Love it", "Author": "DRM", "ReviewID": "RY4A8OSBQ2FDY", "Overall": "5.0", "Content": "Great tablet and I have been slow to get on the Apple wagon.  Many apps even in my narrow field make this a better tablet for now than the alternatives.", "Date": "January 2, 2014"}, {"Title": "Great product! Fast light and powerful", "Author": "wunat", "ReviewID": "R3OG2ESQHZ0XWV", "Overall": "5.0", "Content": "Great product! Fast delivery. I use it pretty much for everything. Very good tablet. Fast light and powerful. Battery life is great.", "Date": "January 2, 2014"}, {"Title": "Home run !", "Author": "m y carr", "ReviewID": "R199CT1MQ3IMEM", "Overall": "5.0", "Content": "The light weight is great.The wide screen I love.The clear and sharp viewing is beautiful .The fast speed you just can't beat.", "Date": "January 1, 2014"}, {"Title": "Great device.", "Author": "SHEY", "ReviewID": "R20810V6O92N25", "Overall": "5.0", "Content": "I absolutely love my new iPad. It's amazing! It was a present for me and I can't get enough of it. My entire family loves it. Would definitely recommend.", "Date": "December 26, 2013"}, {"Title": "A great gift", "Author": "Georgeen Carden", "ReviewID": "RTB7ALFQTYSAL", "Overall": "5.0", "Content": "Gave it to my husband for Christmas and he loved it. The only complaint is the start-up process was difficult to understand and required tech assistance (available Christmas Day!!!). Apple continues to do it right in electronics.", "Date": "December 25, 2013"}, {"Title": "best gift", "Author": "diane trekell", "ReviewID": "RVY15CBP64UVT", "Overall": "5.0", "Content": "fast shipping, well packed, best Christmas Gift ever. looking forward to using it for work fun and playing games, pictures", "Date": "December 25, 2013"}, {"Title": "Not all that", "Author": "aldridge", "ReviewID": "R16OL0OX8OMGXD", "Overall": "2.0", "Content": "Everything is a la carte, so it becomes a drag to go to the Apple store and then discover it does not have as many apps as Android.You have to compartmentalize different programs and that slows down the interaction between the user and the technology. It is more secure, but it has a longer learning curve. Without Flash it limits where to go. Had 2, sold one and may want to sell the other Air to buy something more accessible. when it is side by side with other non-Apple tablets, it is an expensive16 gig, non-upgrading, email item.", "Date": "April 16, 2014"}, {"Title": "Great devices to have.", "Author": "Janice Hemsley", "ReviewID": "R17SK6Y25Z4K56", "Overall": "3.0", "Content": "The Apple IPad Air is a great device.  It feels comfortable to hold in your hands.  The only dislike I have is that it don't support Adobe Flash Player.  I like to play certain games on my computer, but when I pulled them up the the Apple Air, I'm not able to download.  After reading more about why Apple doesn't support Adobe on none of their devices, I was kind of upset.  I wish I would had looked more into this before I purchase this ipad.  I've only had it for a week and now I'm trying to sell it.", "Date": "March 24, 2014"}, {"Title": "iPad air......", "Author": "Alistair", "ReviewID": "R33VY9LYY4KHUL", "Overall": "5.0", "Content": "I recently switched from the kindle fire HD to the iPad air. I like the larger screen, stunning resolution and general,ease of use. Ok so it is more expensive but I believe you get what you pay for.", "Date": "February 3, 2014"}, {"Title": "For those who are still thinking about upgrading from the iPad 3", "Author": "Dmitry Shishkin", "ReviewID": "RCWBUBL868JAX", "Overall": "5.0", "Content": "To make it short: no, it is not worth upgrading from iPad 3 based on my experience...After reading all these excited reviews I finally gave in to the temptation to get one from the store, thinking that may be if I play with it more I would see how awesome it is (trying it in the store did not impress me that much). After a few days of using the iPad Air and iPad 3 I can tell that an upgrade would not be worth the hassle of putting my older iPad on ebay and making up the difference which would be around $300 I guess (I have the 16 GB version) . Actually, a lot of professional reviewers online recommend exactly this: don't upgrade if you already have either an iPad 3 or iPad 4.The difference in size and weight is (slightly) noticeable when you are picking the device or holding it in your hands. The thing is that I never just hold my iPad in my hands when using it (and I do use it a lot!). Most of its weight goes either to the desk when I am at my desk, or to my lap if I am in my chair, or to my chest if I am on my couch. Which means I am basically using my hand(s) to balance the iPad not to support it. In such situations extra 7 ounces is not a big deal at all.If you are using your iPad differently (for example, playing games a lot) then you might appreciate the iPad Air better. Also, if you just want to have the latest and the coolest iPad then of course that would be worth it too :)Seems like Apple is following the same pattern with both the iPad 2 and the iPad Air, mostly squeezing the same device in a smaller package. This is not good enough for me. I waited until the iPad 3 came out to upgrade my iPad 1 (yes, Retina display was totally worth it!) and I hope that the iPad 6 will be worth an upgrade. But I am not getting into the hassle of replacing my iPad just to get a little bit thinner/narrower and lighter.Making the decision to return the iPad Air got even easier when I realized that its screen has a noticeable yellow tint which makes my iPad 3 look a bit bluish which I like better.Good bye, iPad Air, and lets hope that Apple will be able to impress even the most conservative of us with the iPad 6 in October 2014! (Speaking of being conservative, I am still using IOS 6 on my iPad - it is better to be safe than sorry! :)", "Date": "January 5, 2014"}, {"Title": "IPad Air", "Author": "Harold D. Smith", "ReviewID": "R2HU06LY78E5EE", "Overall": "4.0", "Content": "This was purchased as a gift and seems to be well received.  My only problem with this purchase, I seem to have paid about $150. more than everyone else I know that also received the same unit,  Obviously I'm not happy about that.", "Date": "December 31, 2013"}, {"Title": "Almost perfect besides the lack of RAM and some iOS 7 bugs", "Author": "AK529", "ReviewID": "R2PQUNPSZ9SQUD", "Overall": "4.0", "Content": "The ipad air is what the ipad 4 should have been. It is lighter, thinner, narrower, faster and has stereo speakers. Its almost half a pound lighter which really makes a difference when holding the ipad in your hands for long periods of time. I no longer need to use my ipad stand. Typing and holding it in portrait mode are much easier. People with larger hands will be able to hold the ipad with one hand very easily. Performance is also much improved with new A7 processor. Apps open, close and switch faster than on the ipad 4. Wifi is now double the speed with the double mimo antenna. For those who have supporting routers loading web pages, downloading apps, books, videos, music is much faster. The new stereo speakers are much loader and have more bass than on the previous ipad. The stereo affect will only be noticed when holding the iPad in portrait mode. This is a shame since you wont enjoy the stereo affect when watching a video or playing a game in landscape mode. Also the speakers are very easy to muffle if you cover one or both of them on the right side in landscape mode. The main flaw of the ipad air is its lack of 2GB of ram. When browsing and having more than a few tabs open this is very noticeable. The tabs have to reload when switching back and forth. This also becomes an issue when switching between apps that are open. Both the ipad 3 and 4 had 2GB of RAM. The only reason I can think of why apple decided not the upgrade the RAM is to make customers upgrade to the next ipad. The other downside to the ipad air is the fact that its running ios 7. ios 7 for the most part is in improvement over ios 6. It is faster and has more features, but, it also has many bugs that still need to be fixed. Even with 7.04 installed I still experience rotation issues. The ipad doesnt auto rotate when switching between portarit and landscape mode. This issue occurs atleast once a day. Mainly when the multitasking gestures is enabled and auto rotation. There are many threads on apple discussions forums about this issue. I thought at first my ipad was deffective even made an appointment to see a genius. I was told there was no way to test the hardware but was offered a warranty replacment. I decided instead to exchange the ipad and the replacement also had the same issue. I have to add also my ipad 4 had the same issue also when I updated it to ios 7. I hope apple fixes this issue in 7.1. This is very annoying and not something I expected from apple. The ipad air also doesnot have the ability to run 2 or more apps at one time which both the new samsung note 10.1 2014 and Microsoft surface tablet can do. I did try the samsung tablet briefly and found the screen and speakers much better than the ipad air's. The ipad still is the best larger tablet on the market because it has a huge selection of tablet apps and it gets the apps first before any other platform. I also love the battery life on my ipad air. I was getting about 15 hours of usage on my ipad 4 with the brightness at 35% and about 5 notifications with browsing and email. Now with the ipad air I am gettting more than 15 hours. Anywhere from 16-18 hours of battery life depending on my usage. The new ipad air is must have for gamers, power users and people who take the ipad on the go. If you can wait the next ipad will defeintly have 2GB of RAM and wont have as many bugs. There is also a good chance a new ipad will be released in the next 1-2 years which will be larger in screen size and more powerful named the ipad pro.Update after owning for more than 4 months: Apple just released the 7.1 update. My iPad Air is finally stable, this is what ios 7 should have been from the start. There are no more crashes, reboots and the auto rotation issue is fixed. I am still giving this ipad 4 stars since it took apple more than 4 months to fix these issues. Also the ipad lacks 2gb of ram, there are no widgets, thrid party keyboards, expandable storage or way to run 2 apps at once side by side. The iPad Air is till the best 10 inch tablet on the market. It beats any android or microsoft tabelt currently on the market in the 10 inch category. Also it has the most tablet apps.", "Date": "December 30, 2013"}, {"Title": "WOW", "Author": "Diane Allen", "ReviewID": "R95SPR015HRY8", "Overall": "5.0", "Content": "What an amazing ipad! The ipad air is wonderful! Light, fast, all the computer you need! Apple products are hard to beat!", "Date": "December 28, 2013"}, {"Title": "IPad is GREAT!!", "Author": "Janelle Nordine", "ReviewID": "R2S0CEXWVV6B1K", "Overall": "5.0", "Content": "I simply cannot believe all the things I can do on the IPad!  I've even created spreadsheets!  I am a true fan of Apple products.  My four granddaughters (the oldest is seven) play it every time they come.", "Date": "December 10, 2013"}, {"Title": "Great tablet", "Author": "Luciano", "ReviewID": "RLD51TQQUJK68", "Overall": "5.0", "Content": "Amazing, it's my first i-x and I really like it. Strongly recomended for people that need just a tablet at home...", "Date": "December 9, 2013"}, {"Title": "I’m glad I did otherwise I wouldn’t have bought this tablet", "Author": "Bastijn McFerrell", "ReviewID": "R1IB47C2DCYUGY", "Overall": "5.0", "Content": "I owned a second generation iPad before needing to sell it for personal reasons. In hindsight, I’m glad I did otherwise I wouldn’t have bought this tablet.Before deciding on the iPad Air I considered the Kindle Fire and Nexus 7. The Microsoft Surface wasn’t an option since I really don’t like the operating system or customer service and I wanted my tablet to last longer than a year. Samsung wasn’t an option after the torture my Galaxy S3 put me through, which also ruled out Android, which then ruled out the Nexus 7. Some people are a fan of Android but I find it to be slow, unreliable and choppy. The aesthetic design isn’t my favorite either. But these are all a matter of personal opinion and experience. :)The Kindle Fire HDX looked great at first, but in the end I decided it wasn’t for me. I’m a writer and a student so being able to edit documents on the go is my main concern. I have an iMac so this unfortunately made using the Kindle for these purposes a little more difficult for me. While I can edit and share most documents on my iMac, including Microsoft Office, I primarily use Pages which isn’t available on the Kindle. I just don’t care for either Microsoft Word or Google Docs enough to use them all the time. Also, I never use the Amazon store to watch movies or shows or download music so that feature wasn’t appealing to me. I took a trip to Best Buy to try it out just in case that made me change my mind. This actually solidified my decision against it. While the Kindle Fire did feel surprisingly solid, I didn’t like the position of the buttons, smaller screen size (although the screen quality was pretty awesome) or the thick boarders around the screen. Again, all of these are a matter of preference.When I went to try out the iPad Air I was surprised by how much lighter it felt than the previous model iPad. I also liked the flat back and thinner edges on the side. It made using it easier for small handed people like me. The larger screen size made typing on the tablet much easier in those rare instances I might not have my keyboard. Keeping my documents in one place is amazingly simple and I like the applications I use for writing and classes. Also, iTunes U is just awesome!The only drawback for me is the price: I paid $300 more than I would have with the Kindle Fire HDX. I don’t think this is outrageously expensive, considering the larger screen, better hardware, operating system and customer service-- not to mention iTunes U-- but I do think the price could be lower.While there are other great tablets out there, I really enjoy my iPad Air. Electronics are all a matter of personal preference anymore anyway. If you don’t like a device, don’t buy it. It’s that simple. :)", "Date": "December 12, 2013"}, {"Title": "Heavy Apple user, this not up to snuff", "Author": "JustAGuy", "ReviewID": "R13PZL77MK3WNV", "Overall": "3.0", "Content": "I upgraded from the ipad 1 to the ipad air mainly because of constant crashes with the ipad 1.The Air still crashes. From what I've read most people think it's a software issue, if that's the case then this is a 4 star product.What keeps it from a 5th star the the feel of the screen. The ipad 1 felt solid, like glass. This has a hollow plastic feel to it. Feels like if you type too hard it'll snap.I own almost every product Apple makes, this feels like I'm holding the decline of Apple in my hand.", "Date": "February 5, 2014"}, {"Title": "Apple did a wonderful job on this.", "Author": "S. Carter \"carter the artist\"", "ReviewID": "R3RPB2B13I3LG8", "Overall": "5.0", "Content": "Granted I wanted the Space Gray and got stuck with a White, due to human error from the shipper. However, I think they did great on this iPad. I had an iPad 1 and it lasted for years (except for the fact that I couldn't update the iOS for the past year or so) and the difference in weight and speed is very noticeable.", "Date": "November 19, 2013"}, {"Title": "Buyer beware", "Author": "Vertigo", "ReviewID": "R6PRPBDA9FGFH", "Overall": "1.0", "Content": "Nice tablet with a fatally flawed web browser problem.  My iPad Air started with Safari crashing right out of the box.  I put up with it for a month and then had it replaced by Apple under warranty, however, the problem continued.  The experts at the Genius Bar said the problem would be fixed in iOS 7.1.  After upgrading to 7.1 today the issue persists.  Puffin browser seems more stable but still crashes on occasion.  Apple's failure to fix this is unacceptable.", "Date": "March 10, 2014"}, {"Title": "Wish It Just Worked (Without Crashing So Much) And A Comparison With Other Devices", "Author": "S. Jo", "ReviewID": "R14O4T9NDREA0U", "Overall": "2.0", "Content": "I'm not happy with this tablet but I got a good deal on it from one of the retail stores, $100 off, and it fits my needs best compared to what's currently being offered.The iPad Mini 2 is lighter but the screen is smaller and can't display as many colors, less gamut display. I've noticed this with my \"old\" Samsung Galaxy Tab 7 Plus, but this may not matter to some people.The Kindle HDX and Nexus 7 (2013) are, in that order, reported to have better screens- ppi and gamut display. However I'm not interested in buying too much into the Amazon App Store because I'm already in the plain Android ecosystem. The Samsung tablet line is not in consideration because I got burned by how the copy and paste function just stops working- a reset would fix it and soon after it would stop working. This issue first showed itself months after I got the device. I also wasn't interested in taking the time to jailbreak the Samsung tablet for that reason alone.I recently got a deal on the Nexus 7 (2013) and I'm getting it this week. I may keep it as a backup tablet and it's a plus that I'm already in the Android ecosystem. It has 2GB of RAM instead of Apple's current 1GB of RAM standard. It also comes with stock Android and the operating system can be easily upgraded without relying on mods. I'm hoping it will last 5 years but I've learned from the Amazon customer reviews that hardware quality control is an issue.Now back to the iPad Air. Aside from the screen I wanted the \"Apple Experience\" of \"It just works.\" I like using a tablet for browsing and reading books. I also liked the idea of having access to apps that are exclusive to Apple. I've had the iPad Air for a little over a week and I'm really enjoying the bigger screen. I'm not sure I can really switch back to a smaller screen. I've downloaded a few apps, cooking related, that are exclusive to iOS and they're nice to have. Multitouch gesture is ok but the Android way of switching between apps and viewing running apps are more elegant.Why I took off three stars is because the iPad Air crashes a lot. It got to the point that I'd add a tab on Safari and it would crash even though I only had two other tabs open. I installed Chrome and the crashes happened less but they did not disappear. Search for iOS 7 crashes and low memory and you'll see this is a problem with a lot of iOS devices since the iOS 7 was introduced. I noticed other apps doing the same thing but maybe because I use them less I don't see them crashing as often.I had set up a phone appointment with Apple Support on Sunday and was told that upgrading to iOS 7.0.4 via WiFi might have caused the iOS to not fully update. I couldn't stay on the phone for too long so yesterday I did reset my tablet and set the iPad as New. I didn't buy their reasoning but I did like the Customer Support experience- setting up an appointment online etc.I really like the bigger screen and it's probably better for my eyes so I'm keeping the device. I'm also counting on Apple to fix the issue sooner rather than later- in various forums you'll read about people resetting their iOS device and doing multiple exchanges with no relief from the crashing. I will sign up for Apple Care+ which includes 2 Years of Tech Support and Accidental Damage so I can exchange the device if needed.", "Date": "December 10, 2013"}, {"Title": "Apple Ipad Air 128 GB", "Author": "George Grammick", "ReviewID": "R2FN2773JBXU73", "Overall": "5.0", "Content": "Great product plenty of room for apps and photos and music. Needed extra room to up load photos while on vacation.", "Date": "June 8, 2014"}, {"Title": "Quick and easy", "Author": "Mike Talboy", "ReviewID": "R3FWHIADDHJAHW", "Overall": "5.0", "Content": "Perfect condition and very happy with the speed and updates on delivery. Highly recommend these folks for your electronic needs.", "Date": "June 7, 2014"}, {"Title": "iPad Air", "Author": "Bruce Berndt", "ReviewID": "R20R31T9RK1Q1B", "Overall": "5.0", "Content": "This is a great machine, much better than the old iPad (as  expected). Brighter, faster and lighter with many more features!", "Date": "June 7, 2014"}, {"Title": "IPad Air", "Author": "Nancy Zawisza", "ReviewID": "R2MG9RLEFGK3F8", "Overall": "2.0", "Content": "I am not sure why this happens but when I am on Facebook the IPad will go back to the desktop. This happens whether it is in the case or not. Also, I can rarely play a video clip without resetting and even after resetting the video sometimes does not play.This is an expensive computer and I am very disappointed. I like my other iPad better.", "Date": "June 7, 2014"}, {"Title": "I pad air", "Author": "Bruce", "ReviewID": "R2KEIU17XARH6S", "Overall": "5.0", "Content": "This was given to me as a Father's Day gift and I am very pleased with it. The colors are so vibrant compared to the ipad 4. I also like the upgraded features.", "Date": "June 7, 2014"}, {"Title": "As advertised. New,in the box and the most recent version.", "Author": "S. Rowe", "ReviewID": "R25I6IMIR7XIM8", "Overall": "5.0", "Content": "Much easier than driving out to the apple store. This product arrived 3 days after I order it just as promised. Set up was easy and the iPad is just as promised.", "Date": "June 7, 2014"}, {"Title": "Great product", "Author": "Nixon", "ReviewID": "R1KTA4F139C42Q", "Overall": "5.0", "Content": "Too bad it does not have a USB plugor direct wireless printing to an HP printer which isa major challengeotherwise it works well. Very fast.Have not used it to play music yet but very soon.", "Date": "June 6, 2014"}, {"Title": "Almost perfect", "Author": "Ed Figueroa", "ReviewID": "R34LEURRB2WPBZ", "Overall": "5.0", "Content": "Love this thing. It's super thin, the battery lasts forever, and the screen looks amazing. My only minor complaint is that the stereo speakers are both on the same side of the device. Hope a future iPad has Left and Right stereo speakers.", "Date": "June 6, 2014"}, {"Title": "Good experience", "Author": "William J. Austin", "ReviewID": "RO1SROCJ4RX1Z", "Overall": "4.0", "Content": "Delivey was prompt and the only problem was the white with silver was not available and I had to settle for black. However, that was communicated to me in a timely manner and I did agree to change rather than cxancel.", "Date": "June 6, 2014"}, {"Title": "Great. Tablet", "Author": "chuck", "ReviewID": "R1XOTGWQZRZHZ3", "Overall": "5.0", "Content": "I hardly use my lap top now, iPad Air is just that good. Charges fast and then it just runs all day. so easy to learn and use", "Date": "June 6, 2014"}, {"Title": "Hands down one of the greatest devices I have ever owned/used", "Author": "Sara J Ellis", "ReviewID": "R2RREOGXYQEBGG", "Overall": "5.0", "Content": "I absolutely love my iPad. For years I was annoyed by the hype of it all, but finally decided to get one. WOW, is it everything and more!  I'm even not a mac person, but Apple certainly knows what they're doing. I use this for work and fun. It has movies, music, games, as well as Microsoft Office, DropBox, and my multiple email accounts. I think it is IMPORTANT to note that I am returning the one I just purchased, but only because 32 GB was NOT BIG ENOUGH. If you are a casual user, 32 GB is fine. I use it for work and family, though, and within 5 days (after downloading all my necessary work-related apps and then a few games) that I was 10GB down out of 32 (which is actually only 27 because the operating system uses the first 5GB). If you want this for entertainment or actual work, get the 64!", "Date": "June 6, 2014"}, {"Title": "Apple iPad Air MD785LL/A (16GB, Wi-Fi, Black with Space Gray) NEWEST...", "Author": "GFxRocket", "ReviewID": "R1GPOFPMKIGHG6", "Overall": "5.0", "Content": "This product met all my needsMy wife wanted itI gave it to herShe now doesn't irritate me about itProblem solvedIf you find yourself in the same situation, believe me...  You NEED to do it for your own peace of mind", "Date": "June 5, 2014"}, {"Title": "My Wife Love This IPad Air!!", "Author": "Mr. Edward T. Asato", "ReviewID": "R1JANDHJ506A7F", "Overall": "5.0", "Content": "I bought The IPad Air with 16 GB. I am Happy to say she has learn to use this  IPad on her own. The 16GB has been adequate for her application.etak.", "Date": "June 5, 2014"}, {"Title": "ipad air", "Author": "Dan Zhang", "ReviewID": "R1GHRBGKAGRVWZ", "Overall": "5.0", "Content": "Very nice ipad like my other ipad air, so far it working well and I hope it can keep going. Thanks the seller.", "Date": "June 4, 2014"}, {"Title": "First tablet and love it", "Author": "Carolyn Stewart", "ReviewID": "R2D9KE8TBV3M52", "Overall": "4.0", "Content": "This is my first purchase of a tablet and and am very happy with it.  Several people recommended this iPad so that's why I chose it.", "Date": "June 4, 2014"}, {"Title": "5 stars", "Author": "paramvir", "ReviewID": "R3JZ2TBD5K3C9O", "Overall": "5.0", "Content": "best tablet in the market. good interface and light  weight and long battery life. good work apple keep it up", "Date": "June 4, 2014"}, {"Title": "Very Nice", "Author": "John", "ReviewID": "R3HQ0V6NA4N2D8", "Overall": "5.0", "Content": "I have both an ipad and a mini and bought the Air for my wife.  It's slim, light and the clarity is excellent.  Very happy with the unit so far.", "Date": "June 3, 2014"}, {"Title": "Happy Customer", "Author": "D. Holland \"artist\"", "ReviewID": "RRSPFDYYTIGI2", "Overall": "5.0", "Content": "I've had my new iPad for two days; and so far I love it. I am having to learn some features that I'm not used to as I have always used Windows; but in general, this device is easy to use. All in all, it's an amazing step up in it's technology. I'm now an Apple fan after many years of resistance.", "Date": "June 3, 2014"}, {"Title": "Apple", "Author": "Silvia", "ReviewID": "R1YCWG6FVI6KZK", "Overall": "4.0", "Content": "The exceptional engineering continues by Apple. The new iPad is so light and fast with brilliant picture quality that I watched most of the March Madness on it when I wasn't near a good sports bar. Very fast, love the apple apps", "Date": "June 3, 2014"}, {"Title": "Absolutely Love the iPad Air", "Author": "Ann de Vries", "ReviewID": "R3T5D991D644IF", "Overall": "5.0", "Content": "I bought my 128GB iPad Air with 3G  and had trouble using it because my husband couldn't keep his hands off it. He loved it so much that we got one for him. We bought the Apple cases for both of them and my husband bought the stylus, as well.We  are both very pleased with these tablets. My husband has a neurological condition and the accessibility features and stylus have been wonderful for him. He stopped using his laptop for portability, because the iPad Air does everything he wants. We were afraid it would be too heavy for him to hold, but he has found it to be lightweight and comfortable, and it does weigh less than earlier iPads. Anyone with vision and fine motor skills problems is almost certain to love the iPad Air, especially when combined with the stylus.I dropped my iPad twice when in parking lots, both times from low heights, but on hard surfaces. The case protected it and I have had no problems resulting from the drops.We use our iPad Airs primarily for reading Kindle books. Our joint account has a huge archive and our other devices were not handling it. The K4iPad app and this unit work beautifully together and we have had no problems accessing our books. This iPad is powerful.We were worried about how comfortable it would be to read for long periods because we kept hearing that tablet screens bothered one's eyes. We found it easy to use the settings to adjust the screen lighting, and found an adjustment that has caused no eye problems, even when reading for several hours. It has been very comfortable. We have also read in fairly bright sun with no problems. However, when the sun was actually hitting the screen, it was impossible to read on it.We do use the iPad Air for many other functions. Games, surfing the web, eMail, videos, music, photos, YouTube, social networking sites, and so on, work as well as on a computer. The battery lasts a long time and the 3G is a real bonus when wi-fi is not available.I have seen some negative reviews of the iPad Air, and I don't doubt that some people have had bad experiences. All I can say is that we have had good experiences with Apple. Our iMac was out of warranty and still working when Apple notified us they were replacing the hard drive on all iMacs like ours, because the hard drives had an unacceptable failure rate. When we took it in to the Apple store, I asked them to also check my iPod Touch, which was two years out of warranty and had become very temperamental and glitchy. They found a corrupted file on the iPod Touch and got it set up and working for me, and didn't charge anything.  We have had good experiences with the iPad Air and are extremely happy with both of ours.", "Date": "June 2, 2014"}, {"Title": "He loves it!", "Author": "Mezz", "ReviewID": "RZ8DIDHBLID23", "Overall": "5.0", "Content": "Cant believe I found it for this price! No joke, no gimmick. It's really an Apple newest generation iPad and with this price I saved to spring for a case.", "Date": "May 22, 2014"}, {"Title": "Why would you buy any other tablet.", "Author": "Smokey", "ReviewID": "R2C87HGKLPP1V8", "Overall": "5.0", "Content": "I just recently replaced my iPad 2 with this new iPad Air with Retina display.Awesome.The exceptional engineering continues by Apple. The new iPad is so light and fast with brilliant picture quality that I watched most of the March Madness on it when I wasn't near a good sports bar.I bought  the 128 GB model to put my iTunes library of over 10,000 songs on it and also to work on documents and spreadsheets using Numbers, Pages and Keynote that were free. Owning an iPad has become a necessity due to travel demands and enhanced by the Apple ecosystem tying into my other Mac hardware.I have bought one for every member of my family including parents due to the ease of use, carry ability and quality.", "Date": "May 22, 2014"}, {"Title": "Lightweight and FAST!", "Author": "Brittany", "ReviewID": "R169TVKTCS5RZ1", "Overall": "5.0", "Content": "I went from the 3rd gen to this, only because mine was slowing down and I needed more GB storage. It's a great upgrade. Very fast, love the apple apps, and it's much lighter than the older versions. Just wish it had the fingerprint sensor like my phone!", "Date": "May 21, 2014"}, {"Title": "The ULTIMATE grad gift!", "Author": "Doc W8 \"Librarian\"", "ReviewID": "RYJWOGJY615DE", "Overall": "5.0", "Content": "Four of us gave this to our nephew for graduation. He was thrilled, to say the least. it arrived on time, packed perfectly. We got the package deal, with the iPad, a case, and two screen protectors. He and his wife  ( our niece) had it set up and running almost immediately.", "Date": "May 21, 2014"}, {"Title": "great tablet", "Author": "Björn V.", "ReviewID": "R3PH3Q6LQJTPK1", "Overall": "4.0", "Content": "This is a great tablet. Very fast and intuitive with a great camera as well. Too bad you are locked into Apple and you are not able to add an extra SD card.", "Date": "May 21, 2014"}, {"Title": "Traded in my Dell", "Author": "Carll  K  Rich", "ReviewID": "R1KN8CQPXKYXAK", "Overall": "4.0", "Content": "I would never have believed it as I have always been a PC man for many years.  Had them all since my TRS-80 to include Gateway, Toshiba and several Dell's. Frustrated by Windows 8 I finally jumped ship to Apple and could not be more pleased.  Great machine, no complaints.", "Date": "May 21, 2014"}, {"Title": "The best Tablet out there", "Author": "Saikat", "ReviewID": "R2UEXJGUOIAWA5", "Overall": "5.0", "Content": "This is the ultimate Tablet...very simple to use. Sleek interface. It is like having a computer on the go without the bulk!", "Date": "May 21, 2014"}, {"Title": "android lover no more", "Author": "Wayne Stewart", "ReviewID": "R3O2SMBDZAYRI", "Overall": "5.0", "Content": "I finally gave in and bought the iPad. Android lover in the past but I am afraid that is no more. The lack of control and expandability I can deal with since we are all going cloud anyway. Great device with awesome graphics.", "Date": "May 21, 2014"}, {"Title": "Love it!", "Author": "Agnieszka", "ReviewID": "R1S0GSEL64UAAN", "Overall": "5.0", "Content": "I am just loving my new ipad! It was a great purchase! and I would definitely recommend it to everyone!", "Date": "May 20, 2014"}, {"Title": "Great Product", "Author": "Robert Dunn", "ReviewID": "R27G0OE8HG1XZU", "Overall": "5.0", "Content": "This is a very good product - very versatile and an excellent buy.I will purchase another in the near future", "Date": "May 20, 2014"}, {"Title": "Love it", "Author": "CB", "ReviewID": "R26XX0MX1GF0F7", "Overall": "5.0", "Content": "Love it,feels heaver then 1 lb with the otter box I put on it , so I can't hold it that long,but all in all best apple device I have ever owned.", "Date": "May 20, 2014"}, {"Title": "Gift for my daughter", "Author": "Liv Torkildsen", "ReviewID": "RBHOHOHI04B4H", "Overall": "5.0", "Content": "I am taking it with me to Europe, so she will set it up herself.  As far as I can hope it works fine", "Date": "May 20, 2014"}, {"Title": "Apple iPad Air consistent to reputation", "Author": "ronald williams", "ReviewID": "R3KCIF97J0WLU5", "Overall": "5.0", "Content": "This device meets the expectations of performance and easy functional use. As technology development continues, I see less and less nuecense of previous flaws", "Date": "May 19, 2014"}, {"Title": "it's Very nice, it's for musicians, it's Apple", "Author": "tomana", "ReviewID": "R134R9TEH73W0U", "Overall": "5.0", "Content": "if you are a musician and want a device like this for sheet music on stage, then this is the one for you. Buy this and also the AirTurn pedals (get the 4 pedal if you can afford it), download the Free app called OnSong and you're on your way to sheet music turning goodness {8^D", "Date": "May 19, 2014"}, {"Title": "Great Replacement for Laptop When Traveling", "Author": "David S. Thompson", "ReviewID": "R1RE2L6L3Q4B1M", "Overall": "5.0", "Content": "Bought the iPad Air to use when traveling.  It is just what I need.  It weighs about 1.75 lbs. with the case and battery charger.  The screen is wonderfully sharp.  I does all the things I needs and more and it is fast.  I find that I use it often browse the web and check emails at home.  So far I am very happy with it and would recommend it.", "Date": "May 18, 2014"}, {"Title": "Best tablet hands down", "Author": "amr88", "ReviewID": "RPB7NDR51QHAB", "Overall": "5.0", "Content": "Over the last few years I have used a variety of tablets from the Samsung Galaxy, Samsung Note, Kindle, Nexus 10, Nexus 7, and now the iPad Air. The iPad is my favorite by far.Great screen resolution. The battery life on par or better than other tablets but really excels in stand by time.There are so many great applications made specifically for the iPad. The other tablets just don't come close to this.Some enjoy on screen buttons buttons on Android tablets but I find myself accidentally hitting one of the buttons. The iPad has gestures to easily navigate the device.The best on screen keyboard of any tablet. Far more accurate.Endless selection of accessories.We'll worth the money.", "Date": "May 18, 2014"}, {"Title": "Ipad air", "Author": "mike teeple", "ReviewID": "R2EVLPIWLSGEUZ", "Overall": "5.0", "Content": "I ordered for my 10 yr old grandson for his birthday. It came exactly as promised, both on time and what we ordered. Thanks", "Date": "May 18, 2014"}, {"Title": "Love the smaller size", "Author": "ALICE P. SMALLEY", "ReviewID": "R2X2ADLWPKX7E1", "Overall": "5.0", "Content": "I have another ipad and wanted a smaller one.  I find this one easier to travel with.  It fits in my large tote bag that I use for travel.", "Date": "May 18, 2014"}, {"Title": "Sleek and fast.", "Author": "djbrian", "ReviewID": "R68ZW8BWYHDJR", "Overall": "5.0", "Content": "This is a great tablet. Very fast. I would encourage anyone considering a tablet to purchase this one. You won't be disappointed.", "Date": "May 18, 2014"}, {"Title": "Great device!", "Author": "Malgorzata", "ReviewID": "R7CNGQRFEIC1G", "Overall": "5.0", "Content": "Everythin's fine, great features. Works perfectly. I'm totally happy. Recommend to everyone, but next time I'd choose 32GB version. Thanks", "Date": "May 18, 2014"}, {"Title": "Love my iPad", "Author": "K. Long \"Datgrl\"", "ReviewID": "RJPEVTB8XN6EL", "Overall": "4.0", "Content": "I got this with the intent of having something I could take to the hospital to stay in touch and keep occupied.  I've downloaded a few games (Horn, Hearthstone) and I'm really enjoying the graphics quality.  I only wish that Apple offered an ap to manage multiple user accounts.", "Date": "May 13, 2014"}, {"Title": "Excelent", "Author": "Fernandez Anibal \"Anfer\"", "ReviewID": "R4ERLTPMNQ2X9", "Overall": "5.0", "Content": "Excelent tablet is the best without a doubt. Only Apple can achieve something like.El mejor equipo en su tipo", "Date": "May 12, 2014"}, {"Title": "LOVE IT!", "Author": "Mauricio Mejia", "ReviewID": "R3D5GRHBBNZ8TB", "Overall": "5.0", "Content": "First time I commit to buying a tablet. I am very happy with it. Haven't found anything I do not like, other than using itunes for everything.  But I already saw that coming. It even reads to me sounds sexy too hahaha", "Date": "May 12, 2014"}, {"Title": "Good job once again!", "Author": "Helen", "ReviewID": "R1V4VQ1TYI90XO", "Overall": "5.0", "Content": "I ordered this item for a college graduation gift and the service was excellent and I received my item exactly when they said I would.  This was important since it was a little more expensive and I didn't want it just sitting on my front porch!  I always go to Amazon first when I need something since I usually find a better price and the whole process is just hassle free!  Keep up the good work!", "Date": "May 12, 2014"}, {"Title": "Love it, love it, love it", "Author": "Amazon Customer", "ReviewID": "R3J096XRF8EK8J", "Overall": "5.0", "Content": "I'm loving my iPad Air...every single feature of it is beautiful, extremely fast, easy to use, beautiful case, Internet connectivity is lightning fast, this is my first iPad and I'm glad I got the most recent version. There is nothing I don't love about it.", "Date": "May 11, 2014"}, {"Title": "I love it !", "Author": "nandeesh", "ReviewID": "R3CWEUEKKTX3RA", "Overall": "5.0", "Content": "It's Apple Product ! The brand speaks for itself !It's the latest version.Excellent resolution.Very durable. Reliable.Goes well with devices ear.", "Date": "May 11, 2014"}, {"Title": "Finally i got my ipad", "Author": "Ruben Ruiz Velasquez", "ReviewID": "R12PR383GH6D40", "Overall": "5.0", "Content": "I was expecting a Ipad as light as the air and I found it. It's really fast, and the battery last for a long time. Love apple products", "Date": "May 11, 2014"}, {"Title": "Awesome", "Author": "Debbie Elm", "ReviewID": "R13P3A8O2UXRMC", "Overall": "5.0", "Content": "This Ipad is everything I expected and more. I have watched movies, TV shows, played games and searched the internet all with ease. It is so light!. I took it on a recent trip and it made a huge difference carrying it versus my laptop. I absolutely love it,", "Date": "May 10, 2014"}, {"Title": "What can you say it's an Apple", "Author": "Robert J. Curry \"Bob Curry\"", "ReviewID": "R26877TBATD66Q", "Overall": "5.0", "Content": "Have had my air for some time now and has worked flawlessly with no issues what so ever. It's an apple and some times you do get what you pay for.", "Date": "May 10, 2014"}, {"Title": "Enjoying", "Author": "fma", "ReviewID": "R2WMX3H84SOFF1", "Overall": "5.0", "Content": "Like it very muchHave not used my desk top since I got thisResearched it for a year then I decided to get this one without cellular dataI'm using it only where I get wifi and save some moneyGo with a bigger memoryThanks", "Date": "May 9, 2014"}, {"Title": "Very satisfactory", "Author": "Ana Maria S. Yambao", "ReviewID": "R20DPE2B2RD2BI", "Overall": "5.0", "Content": "I like this ipad because it is handy and useful...and i am very much impressed on its very good quality of sound when I play music.", "Date": "May 6, 2014"}, {"Title": "My 4th iPad - LOVE IT !!", "Author": "Linda Ransley", "ReviewID": "RL791XSR18CSD", "Overall": "5.0", "Content": "I got a fantastic deal from DEALIO. I think the description was a couple hair scratches but I never could see them. Arrived like brand new condition & I obtained $124 under retail. I have 3 other iPads and this 1 is thinner & lighter - a BIG deal when you are using for hours at a meeting with no table, which I do often.I would highly suggest pairing it with the fantastic Aerb Wireless Bluetooth Folio Laptop Style Keybook Removable Detachable Keyboard Case - I bought in gold & looks & feels like a VERY classy laptop.I loved the business program it came with, which has most of the features windows word has.I'm not going to get technical or add anymore as I see many others have already done that.  I'm just very happy with it - put in simple terms :-)", "Date": "May 5, 2014"}, {"Title": "Ipad air", "Author": "Katrinka Russell", "ReviewID": "R35FUFHDS8F92J", "Overall": "5.0", "Content": "apple products continue to exceed my expectations! I am never disappointed when I order something from them. It comes ready to turn on and go!", "Date": "May 5, 2014"}, {"Title": "Very pleased", "Author": "Joanne Mathews", "ReviewID": "R16ILZ49OF4JLT", "Overall": "5.0", "Content": "I received the iPad Air in good condition and it works wonderfully. This was to replace my original iPad version which had no camera and was slightly larger. I like some of the changes on this newer version and am enjoying the camera and all that offers.", "Date": "May 4, 2014"}, {"Title": "top", "Author": "Sebastian Häuser", "ReviewID": "R31SBWDGIQ9KBA", "Overall": "5.0", "Content": "fast delivery no worries and in total it is an awesome product. handling is easy and looking forward to the next generation of ipads", "Date": "May 4, 2014"}, {"Title": "Wonderful product, just a few minor complaints.", "Author": "Nathan", "ReviewID": "R3AGVWFT9LP3JM", "Overall": "5.0", "Content": "I've had my ipad for two months now and I am obsessed! It's so easy to use and I take it with me everywhere for work. I have two small complaints:1. The camera has no flash.2.  Tha calculator is not located in the same menu as for an iPhone (the one when you swipe up from the bottom of the screen - I don't remember what it's called). This makes accessing the calculator, which I use a lot for work, very inconvenient.3. Many apps for the iPhone (Instagram, snapchat) have not been adapted for use on the ipad. This isn't necessarily an ipad issue, but definitely something to consider.Overall, it's a great product! I firmly believe that you get what you pay for. Apple is pricey, but it's worth it and they have wonderful customer service. Highly recommend.", "Date": "May 4, 2014"}, {"Title": "Apple Ipad", "Author": "prairiedog", "ReviewID": "R2I3TML994UDZZ", "Overall": "5.0", "Content": "The new I Pad arrived on time and in great condition. Very happy with the unit and the condition of the parcel.", "Date": "May 4, 2014"}, {"Title": "Good purchase", "Author": "SuzieT", "ReviewID": "R30AY1YLWH68Y1", "Overall": "5.0", "Content": "I got it as a gift..they loved it. Good piece of technology for adolescent age and more seasoned users. Easy to navigate, bright colors, apps and setting options galore.", "Date": "May 3, 2014"}, {"Title": "Latest iPad Worth It", "Author": "jfhnhh \"jfhnhh\"", "ReviewID": "R3GXYGPG5UNOBK", "Overall": "5.0", "Content": "Apple got the right weight and size right on this one.  I have owned the original iPad, and an iPad 3 and this one by far is the best.  Coupled with iOS 7.1.1 it's hard to beat the performance and features of the iPad Air.", "Date": "May 3, 2014"}, {"Title": "Love my Apple IPad Air", "Author": "Mark Pfotenhauer", "ReviewID": "RUHEXM56JNBBE", "Overall": "5.0", "Content": "Love it! Fits my needs perfectly! Highly recommended. Fast, graphics are really crisp. Light weight, fits in my hand nicely.", "Date": "May 2, 2014"}, {"Title": "Great tablet for me for browsing and reading", "Author": "R. Murphy", "ReviewID": "R31ZCWHMB357TV", "Overall": "5.0", "Content": "I am enjoying the iPad immensely. Great for reading when chilling on the couch. Light weight and iBook has contrast options to make reading easy on the eyes. Love it. Can't wait to get me a MacBook Pro.", "Date": "April 26, 2014"}, {"Title": "Cewlll cewll cewlll", "Author": "Sabrina Powder Puff \"Sabrina\"", "ReviewID": "R3MQO7FS7RJG12", "Overall": "4.0", "Content": "I liked this very much, and I liked Siri a lot, she was sort of like my new, cool robot BFF. I miss you, bech! Anyway, I had to return it because I'm a musician and I actually needed an old-school mac with a CD drive for a lot of boring reasons involving the studio. Also, because of classic mac usage, and programming, blah blah blah I won't bore you. I needed an Old School Mac Daddy. However, I enjoyed my brief fling with this Hot New Number- but he wasn't the Stable and Dependable Old Skool Mac I needed. He wasn't Fully Loaded.This Mac is more if you're into a fun, wild, whoop-de-doo, fly by the seat of your pants kind of thing, and don't need all the bells and whistles.But I'm not that girl. I needed more.", "Date": "April 25, 2014"}, {"Title": "Very Good", "Author": "XM L", "ReviewID": "R2YBLBZUGGGSRZ", "Overall": "5.0", "Content": "good quality, cheap price and fast delivery!  Quite happy with this purchase. Use it everyday. It is light in hand and the battery lasts long", "Date": "April 25, 2014"}, {"Title": "Like it bunches!", "Author": "DILLY", "ReviewID": "RUWTRPEHXG7NO", "Overall": "5.0", "Content": "I don't know what to say except I wish I would have got it sooner! I really do like it and use it a lot.", "Date": "April 25, 2014"}, {"Title": "Great Buy!", "Author": "Ronald W. Boucher", "ReviewID": "R11E1B72894DRP", "Overall": "5.0", "Content": "the best tablet on the market.  Go AppleCannot say anything but I would buy another if I needed one.", "Date": "April 25, 2014"}, {"Title": "just to protect my new ipad", "Author": "rockalot \"Sabsanders\"", "ReviewID": "R3N02Q59ZO0BNX", "Overall": "5.0", "Content": "I have a puppy who loves to try to use my ipad, so I knew I needed protection.  This is  a great cover.", "Date": "April 24, 2014"}, {"Title": "The best!!!", "Author": "Mario A. Luna", "ReviewID": "R2BY780SDLXB6U", "Overall": "5.0", "Content": "I love my iPad Air! Very fast and easy to use. I definitely recommend it... I'm very happy with it :)", "Date": "April 24, 2014"}, {"Title": "The defected product", "Author": "Michael J. Lu", "ReviewID": "R3B8D42UVGMPRV", "Overall": "3.0", "Content": "The new IPad Air could not be charged and need to be repaired. It was  sent backAnd came very complicated processes after receiving repair ID # and talked with four senior adviser.", "Date": "April 24, 2014"}, {"Title": "awesome", "Author": "Megan Balongue \"Pixelluminati\"", "ReviewID": "R2UJ5KK87ERTAN", "Overall": "5.0", "Content": "I am new to Apple ownership and I cannot be more pleased.  It is so easy to use and just beautiful.  The air is worth the extra price in comparison to an IPad 4.  When typing in a web address the Air seems to be intuitive to the point where it has the page already loading before you have even typed 3 or 4 letters.  I love it!  It is just gorgeous  I was going to get the mini with retina display but after researching and comparing the two I learned that they are not identical in every way but size.  The mini is actually not showing the whole color spectrum like the Air and it is very obvious.  The mini looks like the brightness has been switched down considerably.  So if you are like me and are trying to decide, do your research and go somewhere where you can compare them side by side and the choice will be quite clear.  I will never go back to an android!", "Date": "April 22, 2014"}, {"Title": "Awesome", "Author": "Doug", "ReviewID": "R3W14MJFUO3P7Z", "Overall": "5.0", "Content": "I love the ipad air I bought this as a used item but I can't even tell it was used  and I got like a 70$ discount since I didn't buy it new!", "Date": "April 22, 2014"}, {"Title": "Awesome!", "Author": "jcw", "ReviewID": "RLRWRRJ1XGAWQ", "Overall": "5.0", "Content": "Bought this for my boyfriend's birthday who loves to play games.  He loves it and the screen is so clear.  I just wish I could afford to get another one for myself.", "Date": "April 22, 2014"}, {"Title": "great", "Author": "Danielle", "ReviewID": "R22MWVA8GQDE0D", "Overall": "5.0", "Content": "well its an iPad, everyone loves their iPad … got it for about 40$ less than i would from apple :) steal of a deal. perfect condition. brand new as in description. no complaints", "Date": "April 21, 2014"}, {"Title": "Fast and Sleek!", "Author": "Marcus", "ReviewID": "R2HU89LZB88I5F", "Overall": "5.0", "Content": "Just an upgrade but it works and plays like a champ! Amazing.  If you own one you know it is great.", "Date": "April 21, 2014"}, {"Title": "Outstanding Product", "Author": "Bengt Ekwall", "ReviewID": "R3SQUOKCOG3F9Z", "Overall": "5.0", "Content": "Does all that I need it to do. It is versatile and light enough to go where I go. Excellent.", "Date": "April 21, 2014"}, {"Title": "iPad airmd785ll/a", "Author": "Thelma A. Kennard", "ReviewID": "R1LFLC4BAE6ON2", "Overall": "5.0", "Content": "I really like it. It is very useful . I was going to get a laptop, but I don't need to now.", "Date": "April 20, 2014"}, {"Title": "Ipad air", "Author": "Ben Evenhuis", "ReviewID": "RA0WG10UH7A9R", "Overall": "5.0", "Content": "I was impressed with the light weight yet solid feel of this Ipad. It is by far the best model yet. It is the top tablet out there on the market. If you are looking for one that does it all and is easy to use buy this Ipad.", "Date": "April 20, 2014"}, {"Title": "nice piece of technology", "Author": "Linda RDH", "ReviewID": "R34UTCHSF9EVF7", "Overall": "5.0", "Content": "This is a great little, lightweight piece of technology to own.  It came on time. The only disappointment is that there are no obvious directions in the box to guide my set-up.  What can I say... I am old-school wanting written directions.  I am charging it now and will hopefully follow prompts after that!  Thank God for Google....", "Date": "April 20, 2014"}, {"Title": "Apple still costing too much", "Author": "Walter Pinkham", "ReviewID": "R3P9BVF1S7KDK2", "Overall": "5.0", "Content": "Been working great easy to learn had just a little help from daughter, only complaint is apple just charges too much. Using apples face time neat talking with anyone who has facetime via the internet.", "Date": "April 20, 2014"}, {"Title": "Upgrading from the original ipad", "Author": "Thomas B", "ReviewID": "R2LZ5W9LXQ8ATR", "Overall": "5.0", "Content": "I am glad I didn't upgrade until this version of the iPad.  It's a fantastic device.  It's fast and far more capable from the clunky original ipad.  It's battery life is baffling.  I literally plug it in at most once every two weeks.  It's around for quick web searches, some games and email.  I am sure I could drain the battery in a day, if I tried hard enough, but I'd probably lose my mind in the process.I own a lot of Android devices, as well.  They  don't deserved to be considered in the same breath.  Their engineering is all over the spectrum, but never reach the heights of Apple's flawless execution.  I attribute android's failure to it's architecture around Java and old school mentality of making a product that works, sells, but never excels.  There's literally no better alternative  than an apple device, and I am not a Steve Jobs fan.", "Date": "April 20, 2014"}, {"Title": "Birthday Gift", "Author": "mdgirl", "ReviewID": "RGASAFC0C4WP6", "Overall": "5.0", "Content": "The ipad air was a gift and person was delighted.  It is lighter and easier to handle. Makes an awesome gift.", "Date": "April 20, 2014"}, {"Title": "Love it!", "Author": "Jesse R \"Jesse R\"", "ReviewID": "R3MBA3N0WV27SC", "Overall": "5.0", "Content": "I use it all the time, it's nice and fast. It's very light and easy to carry around. I would recommend anyone who likes iOS.", "Date": "April 16, 2014"}, {"Title": "Awesome!", "Author": "Megan Peacock", "ReviewID": "R1MI6A9XXEOO04", "Overall": "5.0", "Content": "Super light weight and very use friendly. I especially love the pages and keynote apps. I have always loved Apple products, but needed something to type documents on.... and now I have both!!", "Date": "April 13, 2014"}, {"Title": "iPad Air!", "Author": "Patricia M. Dobson", "ReviewID": "R5JWRLSYK4MPD", "Overall": "5.0", "Content": "Love the iPad!  There are many apps available and working with docs from the Cloud is very convenient.  Takes great pics and videos, too!", "Date": "April 13, 2014"}, {"Title": "I am so happy with this IPad Air!", "Author": "Marilyn J. Rowlands \"MJ\"", "ReviewID": "R2GRF5E687TIMB", "Overall": "5.0", "Content": "This is my first IPad and I am so happy with my purchase.  I have a desktop computer and always felt \"out of touch\" when I was away for a few days.  Now, I can easily keep in touch.  I also love being able to play the games that I enjoy.", "Date": "April 12, 2014"}, {"Title": "Excellent", "Author": "Andrew Mann", "ReviewID": "R1U1MSDGXFYDBJ", "Overall": "5.0", "Content": "I absolutely love my iPad Air. It was a gift for Valentines Day. Way better get jewelry. Although, I don't really wear jewelry.  I love all of the features that this product has. Yay! Thumbs up!", "Date": "April 11, 2014"}, {"Title": "Great machine", "Author": "LN \"LN\"", "ReviewID": "R33P9N4497BB8C", "Overall": "4.0", "Content": "I won't repeat what other reviewers have written, about it being a great product. I'll just mention two things that stand out for me, one positive and two negatives.First, the negatives: 1) The screen gets really dirty really easily. Apple says it's oleophobic, repels oils. I've found that to be untrue. My Kindle Fire HDX screen is MUCH better--it seems to be a harder, slicker surface, so fingerprints and such don't stick to the screen. Putting the Tech Armor screen protector on the iPad helps. 2) The app store is filled with a lot of junk, and there are so many apps there that it takes a lot of time to wade through to something that actually looks useful. Many of the apps are almost duplicates of each other. On the plus side, and the reason I got the iPad in the first place, there are some apps that are written only for the iPad.Second, the positive: this thing is a true battery miser. I can go a couple of days between charges, more if I'm not using it heavily. I haven't been able to test this, but I imagine it could play movies all through a long plane ride, whereas the Fire HDX would need an external battery for recharge.", "Date": "April 11, 2014"}, {"Title": "I-pad Air", "Author": "John Bohn", "ReviewID": "R1ECG8I901L13C", "Overall": "5.0", "Content": "I am a former Nook tablet user that converted to the Apple I-Pad.  The I-Pad is so much nicer that both my nooks are gathering dust.", "Date": "April 11, 2014"}, {"Title": "Is the best and smooth. I am loving it", "Author": "Sid F.", "ReviewID": "R1YPKS2XMJRGX7", "Overall": "5.0", "Content": "I am in love with you guys, because your product description was exactly when I receive it. Everything rock, I will definitely come back", "Date": "April 11, 2014"}, {"Title": "Great iPad Air", "Author": "Joanne", "ReviewID": "R2MA3F1J8UOF1K", "Overall": "5.0", "Content": "I love the iPad Air. It is so much lighter than the regular iPad. I had the iPad mini which I loved, but I wanted just a little bigger screen so I can use it without my glasses.", "Date": "April 10, 2014"}, {"Title": "vintage appke", "Author": "ladishow", "ReviewID": "R20OKEB5G3NRD1", "Overall": "5.0", "Content": "Very good device. Vintage apple. I had the iPad 2nd generation, but upgraded to the iPad air and I particularly like its slim shape and light weight.", "Date": "April 10, 2014"}, {"Title": "Incredible!", "Author": "Eva Mendez", "ReviewID": "R3M8KZKNHQG0S6", "Overall": "5.0", "Content": "I haven't bought a smartcase for it yet, but this iPad has a certain weight for the shaky hands, making it less likely to drop it even for the clumsy souls like myself. I only use it for streaming music from Spotify, movies on Netflix, email, reading, schoolwork and messaging so I don't store anything here but PDFs. It's pricey, but worth it.", "Date": "April 3, 2014"}, {"Title": "A clear fav and supplement to my iPhone 5", "Author": "derek Merrin", "ReviewID": "R16AZT5QO4CL2Z", "Overall": "5.0", "Content": "IPad Air is a marvellous supplement to my iPhone 5. Yes, it is like a phone, but it is a size perfect for browsing, emails, news, and business. Great for a quick look-up. Lightweight and portable. I now read e-books too.", "Date": "April 3, 2014"}, {"Title": "Cant go wrong with iPad", "Author": "shealb", "ReviewID": "R221QY663794KP", "Overall": "5.0", "Content": "The new Air is great. It's a fabulous size and the colors are fantastic and it's so much more lightweight than the iPad Original.", "Date": "April 3, 2014"}, {"Title": "It is so good to me!", "Author": "shinhye chung", "ReviewID": "R4FPQFC6GRPFJ", "Overall": "5.0", "Content": "It is so good to me! It is not heavy and it is easy to handle. I can get some apps with free.", "Date": "April 3, 2014"}, {"Title": "Great Tool", "Author": "Barry", "ReviewID": "R272HM22IMGFJM", "Overall": "5.0", "Content": "I wanted this for choir practice. Tonight was the first time in use, and it was great. Very simple to use.", "Date": "April 2, 2014"}, {"Title": "Best tablet", "Author": "Bruce Beyer", "ReviewID": "R2RWS7KROLR02E", "Overall": "5.0", "Content": "Love best tablet by far I've used a lot there's nothing like it moves fast and smooth a must have", "Date": "March 26, 2014"}, {"Title": "Love it", "Author": "llw6684", "ReviewID": "R2GNQIPWYYYXC", "Overall": "5.0", "Content": "Love it. I am use to the iOS of iPhone so getting the iPad made sense to me. Love it", "Date": "March 25, 2014"}, {"Title": "PERFECT", "Author": "Edith Bearden", "ReviewID": "RL8EV1NBAW6RW", "Overall": "5.0", "Content": "I am loving my Ipad Air. Of course I am still learning, but so far each learning item has been very easy to understand. I needed something light weight & small, but easy to see because of health conditions.", "Date": "March 25, 2014"}, {"Title": "Good purchase", "Author": "A. H. Hammond", "ReviewID": "R27J1OHCDCL8VV", "Overall": "5.0", "Content": "This was purchased for my husband who is very impressed with it. He has a Mac Air lap top that he loves and this is a very nice addition to the lap top. Even though the lap top is smaller than the larger Macs, this iPad Air is easy to pack and take with us. Good purchase!", "Date": "March 25, 2014"}, {"Title": "iPad 64 Satisfied customer", "Author": "Fred Hogue \"fhogue\"", "ReviewID": "RMRZ3CUH1WOFG", "Overall": "5.0", "Content": "This IPad 64 is great for travel you can store movies, books, & music all without the need for a wireless connection!", "Date": "March 25, 2014"}, {"Title": "Worth the price.", "Author": "Donald Furgeson Sr", "ReviewID": "R3P7QY66VJ52HS", "Overall": "5.0", "Content": "Nice, very nice. I own a iPod and hate typing on it (fat fingers, small keyboard). One feature I love about this iPad air is the keyboard size.", "Date": "March 25, 2014"}, {"Title": "Love it !", "Author": "Mands \"Chips and Gravy\"", "ReviewID": "R3V0QAOAA6W7Q6", "Overall": "5.0", "Content": "Took a long time for me to get an iPad ,at last I got this iPad Air and I love it. The product was delivered on time and and exactly as stated.", "Date": "March 24, 2014"}, {"Title": "Use it for  reading and love it.", "Author": "Nida Elahi Khan", "ReviewID": "R3REX4K0LY3TK5", "Overall": "5.0", "Content": "Love to use it for reading and work etc. The new processor definitely beats the iPad 4. everything loads faster and feels smoother. And its more portable.", "Date": "March 24, 2014"}, {"Title": "WOW!", "Author": "Barbara Burchfield", "ReviewID": "R13DZNOBFAMOTM", "Overall": "5.0", "Content": "This little baby rocks!  I had the first generation for five years and she was still going strong, but decided to update and treat myself!  I am so amazed with this little jewel.  Fast, clear and light.  I am still discovering all of the tricks, but I am in love all over again!", "Date": "March 24, 2014"}, {"Title": "Apple ipad Air", "Author": "James McGill", "ReviewID": "R1Y9WHXRGZNVIZ", "Overall": "4.0", "Content": "I am still learning on this product but so far it has been fun and easy. Nice and light and save room in my luggage.", "Date": "March 24, 2014"}, {"Title": "No doubt a", "Author": "D. Troiano", "ReviewID": "R3KQCNOX3FW2PA", "Overall": "5.0", "Content": "Great device  for work or play. Worth the extra memory of you like to watch movies on your digital tablet", "Date": "March 23, 2014"}, {"Title": "Love it", "Author": "CINDY WILLOUGHBY", "ReviewID": "R3S2CW6GESD5C4", "Overall": "5.0", "Content": "Exactly what I was looking for and it works as expected. Arrived on time too. Love the apps and sync with my iphone", "Date": "March 22, 2014"}, {"Title": "The best.", "Author": "Barbara Lamar \"Book Maven\"", "ReviewID": "R117RTWWK0H3K0", "Overall": "5.0", "Content": "I hate writing 20 word reviews, because some products don't need 20 words.  This item speaks for itself. We had a Nook Color, was replaced three years in a row, finally the last one died that was a little over a year old. Was told it was terminal, but they would sell us a refurbished for $125.00.  No way, not worth it! This is a wonderful product.", "Date": "March 22, 2014"}, {"Title": "Ease! Fun!", "Author": "Bick", "ReviewID": "R12XU0GWM5CFXF", "Overall": "5.0", "Content": "Never been an Apple fan, however, after purchasing this IPad Air, we are so happy with every aspect of it's design, Just wish I didn't have to pay as much as I did compared to  tablets.", "Date": "March 17, 2014"}, {"Title": "This iPad is worth every penny!", "Author": "aonetruthr", "ReviewID": "R24MI0VFKCBEZJ", "Overall": "4.0", "Content": "I saw the iPad Air for $479 on Amazon and I had to get it!  I've had the 4th Gen iPad for 11 months and I wanted my mom to have her 1st tablet so I gave her the 4th Gen.  It's so light and fast, and it's a great tablet.  I'm worried to hear what will be on the next iPad but as far as I'm concerned, this one has everything I need.", "Date": "March 17, 2014"}, {"Title": "Welcome to the age of technology", "Author": "Susan Macosko", "ReviewID": "R17IL5Q5NJ1QTD", "Overall": "4.0", "Content": "Having this kind of technology is a learning experience for me.  I am enjoying using \"facetime\" with my family.  It is much better than \"Skype\".", "Date": "March 7, 2014"}, {"Title": "Awesome new ipad Air", "Author": "Andrew Viernes", "ReviewID": "R3VTONI22U4AO6", "Overall": "5.0", "Content": "Have had every upgraded iPad since it's inception and this is the pinnacle of iPad design, functionality and style. Great battery life, screen resolution and weight.", "Date": "March 7, 2014"}, {"Title": "unbeatable", "Author": "cset", "ReviewID": "R2N3F59CO5YKWX", "Overall": "5.0", "Content": "iPads are still the easiest to use, most versatile and best quality tablets on the market.  Samsung has some nice Android OS ones, but they are just as expensive and with Android you have so many different brands and versions of OS that it is impossible to standardize as a program/App may work on one but not on another brand or model etc. Apple just makes user support a non-issue. Power on and go.", "Date": "March 7, 2014"}, {"Title": "New tricks for an old dog?", "Author": "V. Chevalier", "ReviewID": "R3RQFBRHRN1PCA", "Overall": "5.0", "Content": "When I'm home in my comfy chair, I still prefer using my laptop with the old keyboard and mouse; however, when I'm anywhere else, this iPad is wonderful!  It's fast, convenient and the battery lasts so much longer then my laptop battery.I'm not tech savvy and I have yet to learn a lot (like using word or numbers programs) but so far the old gal is thrilled with it.", "Date": "March 7, 2014"}, {"Title": "Perfect!", "Author": "Luiz Ferreira", "ReviewID": "ROB775JLKVC9A", "Overall": "5.0", "Content": "I choose this raiting because I didn' nothing wrong. Absolutely  PERFECT.That's all I want. Beatiful. Light. Fast. Fast. Faster. Recomend to all my friends.", "Date": "March 7, 2014"}, {"Title": "Love it!", "Author": "avidreaders", "ReviewID": "R1D53BTB8VHP81", "Overall": "5.0", "Content": "I should have purchased this much sooner much easier than carrying around my laptop.  Nice to share with my iPhone.", "Date": "March 6, 2014"}, {"Title": "Best buy", "Author": "Daniel", "ReviewID": "R1X23X4070M8NU", "Overall": "5.0", "Content": "This is a very nice and fast Ipad, quite light when you hold it in your hand. I warmly recomebd it.", "Date": "March 6, 2014"}, {"Title": "Best ipad I have owned", "Author": "Devon white", "ReviewID": "RVSSHLI3AD0RR", "Overall": "5.0", "Content": "So just to let you know of my experience with IPad's I have owned the first generation the ipad 2 and know the ipad air and I can honestly say this is the best ipad yet. I loved my ipad 2 had it for 2 years it never skipped a beat. But know that I have the ipad air it's in a whole new ball park I wouldn't even say that the ipad 2 is even close to the ipad air. Performance wise I do a lot of multi tasking and it doesn't even break a sweat. The picture is brilliant very clear and crisp. The size and structure are amazing light and beautiful very sharp. It fits in your hands like a glove. It has a great camera for a tablet you wouldn't believe the pictures I have taken with this thing I get a lot if compliments all the time. As for its competitors the samsung note 10.1 2014 edition, the structure of this ipad blows it away. Know Samsung has its own perks that Apple doesn't offer but I would still say its a fair superior product then the note. That being said I do own a galaxy s4 smart phone and I absolutely love it I just prefer my phone to have a bigger screen,and it has it's other perks as well. mainly the galaxy gear watch sealed the deal for me. Hope this helped you into buying a IPAD AIR", "Date": "March 5, 2014"}, {"Title": "iPad love it", "Author": "Tina Mastrangelo", "ReviewID": "R11OZ51LS2CQ3L", "Overall": "5.0", "Content": "I received this promptly and love it!!Very easy to set up and sync with iPhone!Since I have ordered a cover and stylus", "Date": "March 5, 2014"}, {"Title": "Exactly what I was expecting", "Author": "K. G.", "ReviewID": "R2KK7FNSNSUDXF", "Overall": "5.0", "Content": "It was exactly what I was expecting...love it!!  Also got a keypad to go with it and it is awesome!", "Date": "March 5, 2014"}, {"Title": "Handy", "Author": "Jerry Kristan", "ReviewID": "R2S1U93978ZXLN", "Overall": "5.0", "Content": "Very handy to have on the end table as it acts as our TV guide. It is user friendly just like the i phone, we use it for looking items up on the web as well as paying bills on line and banking. The battery lasts us a week before needing a charge.", "Date": "March 5, 2014"}, {"Title": "Everything is great,", "Author": "Sylvester A. Alfonso", "ReviewID": "R39N60J9TEQJ80", "Overall": "5.0", "Content": "Needed a replacement for my other iPad. Decided to get the upgrade and found this cheaper here than on apples web site.", "Date": "March 5, 2014"}, {"Title": "love it", "Author": "Mengmi Zhang", "ReviewID": "R1N2ESZ8FVNIP9", "Overall": "5.0", "Content": "Really great quality and like it alot. Cheaper than app store and still great quality. Save extra bucks to buy smart case and screen protectors lol. Well done", "Date": "March 4, 2014"}, {"Title": "Great", "Author": "Li Xuanran", "ReviewID": "R1691JHU19U5X5", "Overall": "5.0", "Content": "its a good good good good good product,sometimes little bit stuck，all in all it's a good good product any more", "Date": "March 4, 2014"}, {"Title": "Arrived quickly", "Author": "Steven I. Arroyo", "ReviewID": "RR4FLZTBGGU93", "Overall": "5.0", "Content": "Great purchasing through Amazon, the iPad arrived quickly and works perfectly, no issues great upgrade from the 3 Gen. iPad I was using, a lot lighter, easier to hold", "Date": "March 4, 2014"}, {"Title": "good~", "Author": "Wenhui Hu", "ReviewID": "RQW8QVW68OC8T", "Overall": "4.0", "Content": "love it, as it is new as what has been described. while sometimes the product reflects a little slow when you have been using it for a very long time. That's may need some development~", "Date": "March 4, 2014"}, {"Title": "Love my ipad", "Author": "Amy R.", "ReviewID": "RUX05YBNWU5NV", "Overall": "5.0", "Content": "What can i say....it has met and exceeded my expectations.  I wish i had purchase this thing earlier.  I love the way my iphone apps are automatically loaded over onto the ipad.  Some of the views on an ipad are different than the phone (like gmail, other apps I use often), some of them I prefer on the ipad, some i still prefer on the phone.", "Date": "March 4, 2014"}, {"Title": "Love my new iPad!", "Author": "Rachel Shelton", "ReviewID": "R3OHGFRCF3SGY9", "Overall": "5.0", "Content": "I adore this new iPad. Shipping was very fast also - it got here in a couple days. I have an iPad 2 that the battery's starting to go out on - but I used it to the MAX for 2 years solid. I like the less weight of the iPad Air - it's awesome!", "Date": "March 3, 2014"}, {"Title": "Easy to setup and operate.", "Author": "Mayo Wetterberg", "ReviewID": "R3OQFXZL4UQDTZ", "Overall": "5.0", "Content": "Standard Apple logic on all icons/processes. Unless you need a mobile carrier like AT&T; to provide an internet connection, this is all you need. Mine is run through house router and internet modem.", "Date": "March 3, 2014"}, {"Title": "loads of apps", "Author": "Debbie Banks", "ReviewID": "R2RLSZZ1LMBIXB", "Overall": "4.0", "Content": "Yes it's lighter and has tons of apps. Glad I bought it for my husband, he loves it! Speakers are very Good as well", "Date": "March 3, 2014"}, {"Title": "Love the convenience", "Author": "Paul C Carey", "ReviewID": "R3OPG3G6QJWQZL", "Overall": "5.0", "Content": "My wife and I love this ipod. Its easy to navigate and Convenient to use. We love being able to check emais and surf the web from the comfort of our couch!", "Date": "March 3, 2014"}, {"Title": "Love it", "Author": "Cathy", "ReviewID": "RFWN5UW26QKKK", "Overall": "5.0", "Content": "Nice love it would recommend to anyone who wants one. So if you want an iPad air get one you won't be disappointed .", "Date": "March 2, 2014"}, {"Title": "Ipad air", "Author": "Manuel", "ReviewID": "R2HUAJZQBULQ0E", "Overall": "5.0", "Content": "Basically changed my previous version to get a lighter ipad and this is perfectly achieved. So it is really light easy to carry, esasy to handle when reading kindle books. I really liked it a lot.", "Date": "March 2, 2014"}, {"Title": "Fantastic !", "Author": "Busgate", "ReviewID": "R35QIS2T3ATKJ9", "Overall": "5.0", "Content": "What can you say -- It's an iPad!  Beautiful display, very fast, very handy, One of the better buys in tablets.  Shopped around a half dozen tablets and this was, by far, the best unit we found.", "Date": "March 2, 2014"}, {"Title": "Best Tablet Yet!", "Author": "fredrick peterson", "ReviewID": "R3TJMX2D044FQZ", "Overall": "5.0", "Content": "Apple continues to come out with the best products on the markey and this ipad is no exception. The tablet was a crystal clear screen, super apps, and it functions perfectly. The retina display is awesome!", "Date": "March 1, 2014"}, {"Title": "Fast, sleek", "Author": "M. King", "ReviewID": "R2UWKW80GKICM6", "Overall": "5.0", "Content": "Great speed. Ultra slim and lightweight. Screen looks amazing. I notice the music or speakers sound alot better than earlier models. Has a sense of bass now. Jailbreak it and ur possibilities are endless", "Date": "March 1, 2014"}, {"Title": "New iPad", "Author": "Alice Reynolds", "ReviewID": "R33W6VR84VK2K2", "Overall": "5.0", "Content": "I'm new at this but learning fast, so far I am pleased with it,  and very amazed at all it can do.", "Date": "March 1, 2014"}, {"Title": "A wonderful product", "Author": "WhiteKnight", "ReviewID": "R2KXW6X1D9U1YQ", "Overall": "5.0", "Content": "This was a Gift to my Mother and she has raved about it ever since.It's easy to use and she enjoying it more each day.Thanks", "Date": "March 1, 2014"}, {"Title": "iPad Air", "Author": "Pamela L. Forrester", "ReviewID": "R2RTWJ4I8QZVV9", "Overall": "4.0", "Content": "My first tablet purchase. I bought one for my adult daughter also. We both find it extremely useful and rarely go into our laptops now. So light and easy for me to hold as an older person. It was more expensive than many tablets and doesn't combine with my laptop or printer as many other tablets do.", "Date": "March 1, 2014"}, {"Title": "It's great!", "Author": "Graham Smith", "ReviewID": "R1GRNP53LN5AMG", "Overall": "5.0", "Content": "It's great! Does everything I wanted and more. Facetime is a great way to keep in touch across the Atlantic and see the new grandchild.", "Date": "March 1, 2014"}, {"Title": "Love it!", "Author": "Bumbles \"flowing yogi\"", "ReviewID": "R3EAPTAQ1EXI9N", "Overall": "5.0", "Content": "Got the new iPad air (our first ever ipad/tablet). It's great and we were happy with the price and service of this seller. Thank you!", "Date": "February 28, 2014"}, {"Title": "Husband loves his gift!", "Author": "J. Blake", "ReviewID": "R1LZ5TDYSA77BT", "Overall": "5.0", "Content": "I purchased this for a birthday present for my husband.  He is enjoying it thoroughly.  I think the graphics are terrific!", "Date": "February 27, 2014"}, {"Title": "Definitely worth the upgrade from any prior iPad model", "Author": "The Badboy \"Badboy Studios Inc.\"", "ReviewID": "RMSPQMZ0RK6YV", "Overall": "5.0", "Content": "The iPad 3 was my first iPad and I've used it up to the point I bought this iPad Air. I had cracked my screen and it seemed as if it was slowing down over time, probably due to the updated operating systems putting more stress on the aging processor and memory.So, I saw a good deal on a used model appear on Amazon, and decided to go for it. For little over $500, after I traded in my older model, I had a brand-new, or close to it, iPad Air. The first thing you'll notice is the weight. It is at least half that of the previous models. The bezel thinner on the sides and the new thunderbolt port on the bottom. I also love the addition of stereo speakers, as I own one of the biggest recording studios on the East Coast and love to try out the music I produce on a multitude of sound systems. This allows me to hear what I've done in stereo, on a lower common denominator, so as to know what my music sounds like coming from the speakers of a system millions of people own.The next thing I noticed, is the screen seemed quite a bit brighter then my iPad 3. This could just be because of the aging screen tech under the glass, or some other factor. But it definitely helps for reading, even at half power, in darker and lighter situations that I have no control over. Next up, the speed at which everything operates. Not only loading software and apps, but in switching apps and multitasking. There is just a zip to everything now.The biggest thing I noticed, the Internet is 10 times as fast as it was in my prior model. I'm going to guess the MIMO has something to do with that, along with the two antennas. Giving a stronger signal, which in turn allows for the fastest Internet possible. I have 50 Mb Internet, and I now feel like I'm using every bit of it in doing something as simple as loading webpages or downloading videos, games and music. When I load a webpage, everything appears instantly, no more loading in of different aspects of that page, everything is just there. I think it is the first time, and Ive owned  hundreds of computers over the years, that I've noticed any webpage load so instantly.Games look every bit as good as they can, due to the increased processing power of the CPU and GPU. If Apple would only make a proprietary gamepad for the iPad, they would have a true contender for a great video game system on the market. Some of the games, especially those from Gameloft and EA, have every bit the quality that you see from any game on modern systems, bar a few effects here and there.Even music production can be done at high-quality, for the home or studio producer, with decent results. I've heard some songs recorded completely via the iPad, that you would've sworn were done in multi-million-dollar studios. They are that good. Which goes to show, great music is made by a great producer and not the equipment behind him.So, to sum things up:Positives:Great, bright, high resolution screenSmaller and lighterIncredible portable powerGreatly improved internet speedStereo speakers built inAwesome games and production softwareCheap accessories from third party vendorsNegative:Price, though I imagine we would sacrifice some quality at a lower price pointOverall, you will not find a better portable computer for the price. Anything Windows is going to have issues. Whether that be with drivers, malware, viruses or some or the other issue that goes along with owning a Windows machine. Sure, they are more powerful and will allow you a greater depth of software, but you make trade-offs with that power in size, weight and ease-of-use. So, if you have the means, definitely get the iPad Air. The upgrades are truly worth the extra cost over previous models. It's like having a super computer under your fingertips everywhere you go.", "Date": "February 27, 2014"}, {"Title": "Converted Fangirl", "Author": "HardatTwerk", "ReviewID": "R1C5M2NPBI3XR9", "Overall": "5.0", "Content": "So..for a long time..I hated apple. But I get it now..it just works. It simply works. Its beautiful..feels great in my hand. Turns heads and its very easy to type on. Its zippy, and has made my life so much easier. I am a graphic artist/ web designer. I draw on this and take notes and photos every now and then. I compared so many other products, and for being I hated apple..I love this thing more than anything in the world.", "Date": "February 26, 2014"}, {"Title": "Love my IPad Air", "Author": "Patricia", "ReviewID": "R2WZPM6BR84O3U", "Overall": "5.0", "Content": "I love my iPad air and I made sure I have lots of memory. I have not had any trouble and I use it every day since Christmas. Also I love all the accessories you can get for it.", "Date": "February 26, 2014"}, {"Title": "It is great and had no problems with delivery", "Author": "Nicole carlson", "ReviewID": "R1X68FTIN2P9GI", "Overall": "5.0", "Content": "I choose this raining  because it was delivered right on time and with no issuesIt  was so good to just open the box and start working on the I padI wold recommend it to any one", "Date": "February 26, 2014"}, {"Title": "Best tablet", "Author": "Shahab Pourtalebi", "ReviewID": "REDJRNH7GAWLQ", "Overall": "5.0", "Content": "I had an ipad 2 64GB 3G. It was a good tabled, but I never used more than half of the storage space. Now I spent less money and I have more facilities.", "Date": "February 26, 2014"}, {"Title": "Terriffic upgrade to our new iPads", "Author": "Randy B", "ReviewID": "R1YU4F51PTUQ45", "Overall": "5.0", "Content": "We have had iPad 2 for quite some time. They have been great but we bit the bullet and upgraded to these. So much faster, a bit smaller and with better graphics. A bit of a hassle getting all the apps loaded on but I am not sure if it was me or iTunes but it all worked out and everything is running nicely. The extra 16 GB of memory was well worth the extra cost.", "Date": "February 25, 2014"}, {"Title": "Apple is by far the best computer out there.", "Author": "KENNETH P.", "ReviewID": "R3JGQ1MGHSVE1R", "Overall": "5.0", "Content": "Apple is by far the best computer out there, i 've used other computers in the pass and i thought to myself that i would try apple to see what all the fuss was about apple, when i started using it the quality was so outstanding and the HD quality was magnificent, everything about Apple was excellent, i just feel in love with Apple and i hope to buy some more apple products in the future................", "Date": "February 25, 2014"}, {"Title": "Easy to use great screen.", "Author": "chris", "ReviewID": "R19ENXPB2BRNU8", "Overall": "5.0", "Content": "Pros: almost everythingCons: Movies look great I just with the iPad was 16:9 so the movies would fill more of the screen. I had the Sony table and the not 10.1 2014 and this by far is way better. I feel myself not using my phone as much.", "Date": "February 25, 2014"}, {"Title": "Very nice!", "Author": "D. Utterback", "ReviewID": "R2OM4RTB2ATHD7", "Overall": "5.0", "Content": "I haven't used it tons but I have read several books on it and am also using it for checking email and messages some. Also handy for the eBay app. Nicely made and sure looks like a great product! I've had an iPhone 5 for a couple of years so it was an easy step into using this since the operating system is the same.", "Date": "February 24, 2014"}, {"Title": "Arrived on time and in great condition", "Author": "Always Satisfied", "ReviewID": "R2FQJ90F66FJQX", "Overall": "5.0", "Content": "I like that I was able to beat the sales tax on this item - there are few other places where sale tax is not collected at source.Have not been able to use the item since it is a gift for someone else.", "Date": "February 24, 2014"}, {"Title": "iPad", "Author": "yolanda lewis", "ReviewID": "R3VLXFLFGPXKQW", "Overall": "5.0", "Content": "I love my iPad! It's great! I use it more than my laptop. It's light as a feather and so easy  manipulate.", "Date": "February 24, 2014"}, {"Title": "Light weight, great performance", "Author": "KJoegg", "ReviewID": "R3BYVZCBK3EMC4", "Overall": "5.0", "Content": "I really like the lighter weight and slightly smaller dimensions of the iPad Air. Holding the iPad with one hand for extended periods just got a lot less tiresome. It's surprising how much difference it makes. Performance seems about the same to me. I recommend the iPad Air to anyone who spends a lot of time on the move and holding it to read or work versus sitting it in a stand.", "Date": "February 24, 2014"}, {"Title": "Love it", "Author": "Jane C. Scott", "ReviewID": "R3UX9BK1SZ6HWL", "Overall": "5.0", "Content": "I love it.  I learn a new way to utilize it everyday. I do private tutoring and I am able to carry use it easily.... plus I have my own entertainment when traveling or waiting or whatever.", "Date": "February 24, 2014"}, {"Title": "Incredibly light, fast and beautiful. Is it the best tablet for you?", "Author": "John Ryan", "ReviewID": "R99F4BEOZO0JF", "Overall": "5.0", "Content": "The new iPad Air is Apple's latest, slimmest, lightest release of their hand-held computer. Oddly enough, it's so beautifully easy to use (my one year old daughter loves playing with it), it's almost doesn't feel like a computer at all.A word of warning - this review is written for people who've never owned an iPad before - and are wondering what all the fuss is about. If you're thinking of upgrading skip down to the \"What's great about the Air\" section below, or just buy it - it's amazing.Just what's all the fuss about?--------------------------------------I used to own a laptop for work, and (very occasionally), it'd sit on my lap on the sofa, and I'd use it for pleasure (eMail, watching films or playing the odd game). Then I bought my first iPad, and the laptop became redundant, a boring \"work device\". Hard to explain, but the fact the iPad is so small and light, and you navigate around with your finger by pointing and gently swiping the screen makes the whole experience a lot easier - a lot more fun.Even my most \"luddite\" of friends have been won over.It's incredibly simple and easy to use (it only has one main button), and everyone from my one year old daughter to my 85 year old dad have taken to without problems. It's size and shape also support using it like a book (literally to read a book or web page), but you can also watch TV and films.Personally I'm also paranoid about my password getting \"hacked\", and someone running up a huge Amazon bill or buying stuff with my credit card on eBay. Well one of the benefits of the iPad (and iPhone) is it's \"almost impossible\" to get a virus - one of the most common ways to get hacked. This doesn't mean you shouldn't use strong passwords, (both Sony and Adobe got hacked), but it's reassuring to leave the Windows world behind.Finally, I love the way these devices (iPad, iPhone, Apple TV, Apple Mac), increasingly work together. The fact you can start a Pages document on your Mac and edit it on your iPad, or take photos on the iPhone, and in seconds see them on the iPad or Mac and display them on the Apple TV.The thing is, \"it just works\".What would you use if for?----------------------------------* Shopping online. Obviously - you could be reading a review on Amazon about the iPad Air!* Reading web pages. As you can hold it like a book it's great to read the news online (my wife loves the Daily Mail Online).* Reading Books. It's great for reading books from Amazon Kindle or Apple Books with the benefit of 1,000s of online book reviews* Navigating web pages. Instead of clicking with a mouse, you gently swipe your fingers on screen to scroll around* Watching Films. I use it to watch Netflix online videos (with an Apple TV you can send stuff to the telly)* Watching TV. With the free BBC iPlayer app you can catch up or download BBC programs* Reading and replying to mail. I use \"mailbox\" a great free app to read and reply to mails, but there's a free one included* Showing and organising photos. Any photos on an iPhone are automatically available within minutes in \"the cloud\"* Playing games. From fun puzzle games like \"Cut the Rope\" to fully fledged first person shooters.* Listening to the Radio. With \"Tune in Radio\" you can listen to thousands of radio stations world-wide.* Listening to music. I stream mine to an Apple TV, but you can also buy portable speakers or just plug into the AUX socket* Editing Word, Excel and Powerpoint documents using FREE App \"QuickOffice\" (owned and supported by Google).* Editing Pages, Numbers and Keynote documents (Office for the Apple) on the FREE Apple apps.* The list goes on and on.Update: You can edit Word, Excel and Powerpoint documents (plus Pages, Numbers and Keynote) on the iPad (although I'd recommend an external keyboard - see below). It's definately powerful enough, although I'd not expect these apps to cope with REALLY complex document layouts. Great for general letter and document writing though.Which model should I buy?----------------------------------I can't comment about Android tablets (apart from the Google Nexus 7 which is well regarded), but in terms of the Apple tablet line-up in order of cost:-1. Avoid the Apple iPad 2, it's a relatively old model, under-powered and with a lower resolution screen. If you really want an Apple but don't want to spend the cash, buy a 16g WIFI 3rd or 4th generation iPad from eBay. Avoid this one.2. iPad mini is a lovely tablet. A 7.9 inch screen and astonishingly light and remarkably thin - it feels like a light-weight book.3. iPad mini with retina screen. Again 7.9 inch screen, but with the blazingly fast A7 chip and a \"retina\" (high definition) screen. Worth the upgrade if you can afford it.4. iPad Air. Much larger screen size (9.7 inches - doesn't sound much but it makes a huge difference). Same fast (A7) chip as the Mini with Retina - the latest and fastest iPad available.Clearly (from my viewpoint) there's only really three options. The iPad Mini, the Mini with retina screen and Air.What are the Optional add-ons?-----------------------------------------Well, assuming you've dropped by the Apple Store or John Lewis (which I would highly recommend), and handled the iPad Mini (with/without retina screen), and iPad Air then your options are around memory size and cellular option.Memory: Once bought, you can't add memory (space for apps, films, books etc). However, the basic price goes up a huge amount (+£80 for the 16g to 32g iPad Air). But, having owned a 16g and then a 32g iPad - I can safely recommend the 16g unless you really want to store a huge amount of videos and downloads. Only you can decide, and if you're lucky enough that money is no object then splash out. Otherwise, 16g should be fine for most people.Celular: Allows you to connect to the internet while you're out and about. This will add an additional +£100 to the price and means you can slip in a mobile phone SIM card. This means (for an additional £7-15 a month extra), you can access the internet on the move. Alternatively, you can opt for the WIFI option, and use it at home or at at \"hot spot\" (eg. Starbucks, most rail stations and hotels etc).Personally I'd buy (and indeed did), the 16Gb iPad Air WIFI.Do I need anything else?-------------------------------Most people (me included) buy a cover. Apple (and now several copy-cats) make a \"smart-cover\" which automatically shuts down the iPad when you close it, and switches it on when you open it. There's versions which cover the back, or just the screen. Apple charge from £35 to £65 for their (admittedly) high quality fabric or leather covers, but there's many available from £10. Be aware, you do get what you pay for.Personally,I think it's a pity to cover the beautiful aluminium industrial design of the iPad with a cover - but if you've spent hundreds of pounds you'll want to protect it from scrapes and bangs.I also invested in a keyboard (£25-80), as I tend to write a lot of mails and documents (remember it comes with a word processor). I'd recommend the Logitech Ultra Thin iPad Air Case with Keyboard - Space Greyand the ZAGG Keys iPad Air Case Folio with Backlit Keyboard - Black although these are strictly optional unless you want to use your iPad as a proper laptop.Finally, if you have another Apple device (eg. an iPhone, Apple TV or Mac) you'll find these work together beautifully. For example, you can create a reminder on your iPad and it appears on your iPhone. Equally, photos taken on your iPhone appear on your iPad, and you can stream music or videos from iPad, iPhone or Mac to an Apple TV.Some people think this \"locks you in\" - but it's your choice.What's great about the Air?-----------------------------------* Lighter (30%) and thinner than the previous version (469g from 650g)* Even faster A7 chip. Blazingly fast!* Improved sound (compared to the iPad 4)* Software including+ iMovie - edit and publish home made movies+ Numbers - Fully functional Excel for the iPad+ Pages - Word processor+ GarageBand - Play a piano or a drum kit+ iPhoto - Edit and organise your photosWhat's not so great?--------------------------* The change in physical size means you'll need a new keyboard or replacement cover if you're upgrading* Pity Apple didn't include the \"touch ID\" to secure your passwordsOverall Opinion---------------------It's hard to believe the iPad version 1 was released just four years ago, and there's a huge raft of \"me too\" tablet computers to choose from, but the Apple iPad Air is still the one to beat. As \"Which?\" magazine (in the UK) put it - \"...the best tablet we've ever tested. Apple packs a beautiful screen and lightning fast processor into a slimmer-than-ever shell, and battery life is very impressive\".Yes, there are cheaper Android based alternatives, but the quality, design and beauty of this tablet just sets it apart. If it were a car it'd be a top of the range Mercedes or a BMW.Highly Recommended.", "Date": "February 23, 2014"}, {"Title": "Apple does it again", "Author": "Robert Garner", "ReviewID": "R2A8NVDAH0DGG5", "Overall": "5.0", "Content": "This is not my first iPad. The iPad Air exceeded my expectations. The speed is the greatest improvement and the feel (weight) is amazing.", "Date": "February 23, 2014"}, {"Title": "iPad Air", "Author": "Dena Kimberlin", "ReviewID": "R2LHEMWU8IBPC7", "Overall": "5.0", "Content": "This amazing iPad is  sleek and very easy to manage.  It is easy to carry and so lightweight you do not really know you are holding an iPad", "Date": "February 21, 2014"}, {"Title": "i-pad air", "Author": "linda hughes", "ReviewID": "RGWALXES2Z8RS", "Overall": "5.0", "Content": "was gift for grand daughter.she is very happy with it she loves it .lightweight and does everything it says.no negative comments.", "Date": "February 21, 2014"}, {"Title": "Great buy", "Author": "Cindi Hansen", "ReviewID": "R3GFV6XCW7ACOC", "Overall": "5.0", "Content": "This product is awesome! So fast and everything I would need in a tablet. Clear screen display as well. Perfect", "Date": "February 21, 2014"}, {"Title": "iPad air", "Author": "Nicole", "ReviewID": "R2X2NC92JEZIAR", "Overall": "5.0", "Content": "Great product and very lite and hd clear better than my ipad 2 on something's it's a all around good product.", "Date": "February 10, 2014"}, {"Title": "Valentines Gift", "Author": "David Ballerini", "ReviewID": "R2UFVHNH3KJY1C", "Overall": "5.0", "Content": "I bought this for my wife. Bottom line, she loves it. As I am tech challenged, my neighbor helped set the device up. Thank God for helpful neighbors!", "Date": "February 9, 2014"}, {"Title": "What can I say perfect product", "Author": "mona ghobrial", "ReviewID": "R1OLTIUVY1Y04B", "Overall": "5.0", "Content": "What not to like!Portability light weight and powerful and I am doing whatever I need to do without being tied to my desktop", "Date": "February 6, 2014"}, {"Title": "Pretty nifty!", "Author": "Jill B. Kettleson \"Sparky\"", "ReviewID": "R183OBAPWSNC4C", "Overall": "5.0", "Content": "This is ideal for just about anything... I have the iPhone 5s and this is a good compliment.  I highly recommend this.", "Date": "January 31, 2014"}, {"Title": "The future is a breeze", "Author": "The Guardian", "ReviewID": "RCZI8SDOCSF1B", "Overall": "4.0", "Content": "The iPad has established itself in four short years as the 'tablet of choice' to which all others are compared, and the Air is the newest and coolest in the family.First of all, the good news. At 467g the Air redefines computer portability and is so lightweight it's hard to tell whether you're carrying it in your bag or have in fact forgotten it, without looking to check. The Air has a fast A7 chip and the screen is a useful 9.7 inches; it's a breeze to use. The design of the graphics is so intuitive that any child or technophobe can master it and feel at home in a few minutes, which makes it the perfect entry-point into IT for someone who has so far avoided computers.One of the clever things Apple have done is the creation of the individual `Apple ID' which means once you enter your ID & password your iPad, iPhone, iPod and Mac immediately share all their files, and everything you created or stored on one device becomes available on them all: photos, music, reminders, address book, documents are all shared. This is probably the most brilliant idea ever in the IT mass market to create brand loyalty among consumers and `locks you in to the corporation for the duration'.Now, the bad news: the software crashes from time to time necessitating a reboot, which is annoying and inconvenient. This fault is acknowledged by Apple, as the software has a few bugs. Also the wireless reception is not all it might be, as it sometimes (mysteriously) fails to connect to even a moderately strong signal.Apple's pricing structure does not reflect the cost of manufacture but is driven by a market segmentation strategy, so the price really cranks up if you want an iPad with more memory or which can use the GSM phone network. The best value is the 16G Air without Cellular, which only connects to the internet via WiFi. 16G is a lot of memory by the historic standards of portable computers and you'll only find it insufficient if you want to store a lot of big files like films or powerpoint presentations.You'll need a carrying case to protect it (scores of different designs are available) and maybe a keyboard, which if you're doing a lot of writing and document creation rather than just surfing the internet is the one essential accessory, as without a separate keyboard the usable screen area is reduced in size. Around one million downloadable apps for Apple devices means you can personalize your iPad and make it into more or less whatever you want. The Air design is aesthetically a work of beauty in its simplicity, cleanness of lines and proportion, and despite some irritating niggles is a pleasure to own and use.", "Date": "January 22, 2014"}, {"Title": "Always love Apple", "Author": "Patricia Coykendall", "ReviewID": "R2Q8KB9C8ZHKQW", "Overall": "5.0", "Content": "All said it would be and more, had the I pad 2 and this is so much faster and lighter", "Date": "January 18, 2014"}, {"Title": "I love it, love it, LOVE IT!!!", "Author": "Maryanne", "ReviewID": "RX8WHXEP7PHLS", "Overall": "5.0", "Content": "I honestly love this tablet like crazy! It has great battery life, just like they claim. I had my younger cousins go on it and even though they were playing games and watching movies the whole time, the battery still lasted all day! The screen is also great, maybe it's not the best on the market but I can barely even tell the difference and it's still exquisite. The processing power is also outstanding and I couldn't need anything faster. Internet is very fast as well. All in all, I've always wanted an IPad and finally when I got it, I was not upset at all and it was actully a million times better than I expected.So, in my opinion, if you want it enough, and your willing to make a big splurge, get it. :D You won't regret it, it's da bomb. But if you really haven't wanted this much and your short on money, maybe you can give the other cheaper tablets a try. Such as the Nexus, Kindle, or even Nook!", "Date": "January 9, 2014"}, {"Title": "Love it, but had connection problem during set up", "Author": "Bookenz", "ReviewID": "R1Q22IXQKRHAIJ", "Overall": "4.0", "Content": "This is my favorite iPad so far, despite an initial wifi connection problem. I bought the original iPad, iPad 2, and iPad 3 (which I returned because of heating issues and thickness/weight and went back to the iPad 2).I was ready to buy a new iPad because my iPad 2 16gb was filled up.  So I decided on the iPad Air. The first thing I noticed when I took it out of the box was that it really is much lighter than even the iPad 2.  The screen is the same size, but the frame is narrower, so it's smaller overall.  I have the white 128gb wifi version.  Set up was problematic though, which is why I've taken away a star.  When asked to put in my home wifi password, I received a message that it was entered wrong. Repeatedly.  Well, it wasn't wrong because it's the same password as my other wireless devices.  Nothing I did would make it take the password, so I called Apple tech support. After being on the phone with the technician for at least 45 minutes, nothing worked. Turning my modem and router off and on did nothing. Changing some of the iPad's settings, again, nothing. I felt disappointed, frustrated, and let down by Apple. Finally, the tech set an appointment for me to take it into the Apple store and see if they could get it to connect to their wifi. Before we hung up, the tech suggested I connect the iPad to the iTunes on my computer and do a complete software restore and see if that would resolve the connection issue.  I did this, which took about an hour, and FINALLY was able to connect to my wifi. The connection has been stable so far.Other than the above initial connection problem, I am really loving the iPad Air. Sharp retina display, thinner and lighter, and faster connection (I use the Mercury Browser, not clunky Safari). The white frame with silver edges is really nice looking. I read a lot of ebooks, so the lighter weight is very much appreciated since it can be held comfortably with one hand. I also listen to audiobooks and this iPad has two speakers instead of one. They're located on the edge of the device, not the back, so you don't have to have the iPad back side up to get unmuffled sound. The sound quality of the iPad Air is superior to the iPad 2, and the volume can be turned up slightly louder. I've only played one game so far, Plants vs. Zombies 2, but it plays great. I don't use the camera and really wish Apple would make a version sans that option. It feels cool when holding--the iPad 3 I had got too warm on one side, which this one doesn't do. I haven't had any other problems and I think this is the best iPad yet. As far as the initial wifi connection issue I had, I'm going to assume this was a fluke with my device, and not something a lot of people are experiencing (although I have seen a few mentions of this on some of the Apple forums).", "Date": "January 8, 2014"}, {"Title": "Its perfect", "Author": "Benedito Eloi Maya \"Maya\"", "ReviewID": "R3PBL8USTW8GYJ", "Overall": "5.0", "Content": "This product is amazing. It's not perfect, but considering that I'll have it for at least 2 years and I've used it every day so far, It's very sturdy and I know it will hold up well, as my other Apple products have.", "Date": "December 30, 2013"}, {"Title": "Great Purchase!", "Author": "mgf", "ReviewID": "R3T4HQE7937J2J", "Overall": "5.0", "Content": "I love this iPad, is so light weight but with a big screen.  The picture quality is great too.  High quality like everything from apple.", "Date": "December 23, 2013"}, {"Title": "So very portable", "Author": "Nancy Bell", "ReviewID": "R1TAU6FYPB8B8N", "Overall": "5.0", "Content": "I have a laptop & a small size mini computer, both were obsolete, SLOW, etc. I was pretty much using my ipodTouch5 as my sole computer for everything, so this iPad was a natural progression from the Touch to a bigger screen.  The Air is all you need!!  I find even typing with no keyboard is not an issue.  I am not sure it is any better than an older iPad since it is my first, but if you want a tablet , this IS the one, just because of the lightness of the iPad!  It is easy to use & does it all with ease.  Flawless for me so far.  I am like a walking advertisement for iPad Air!!", "Date": "December 23, 2013"}, {"Title": "christmas present for my mom", "Author": "michael", "ReviewID": "R1YRRYGUE5W27N", "Overall": "5.0", "Content": "i myself love it.  got her this one cause her old 2nd gen is cracked and pretty much dead.  im sure she will love this one", "Date": "December 19, 2013"}, {"Title": "I'm in love with this thing", "Author": "Ashton P. Johnson \"Zepaw\"", "ReviewID": "RD013T1R9OA4A", "Overall": "5.0", "Content": "My title makes it pretty clear how I feel, but I'll try not to go over the top about how much I like it. The big thing is I've always liked the iPad as a concept but I've never fully fallen in love. I bought an original iPad, 2, and 3 but ended up selling them not long after because of a couple reasons. Mainly they just felt a bit like a luxury item I didn't have much use for and they weighed just enough to be uncomfortable to hold for a long period.The weight is now a complete non-issue. I fall back in love with it every time I pick it up because it just feels so perfectly designed for being held and interacted with. It also feels like much more than a luxury because of how much usability it now has. There are so dang many things I can do on my iPad, things I used to need my pc to complete. This is partly because of improvements by Apple but its also the simple benefit of web and app developers designing their services with mobile in mind.I can only imagine this comes off as a completely biased review but know I didn't get this device expecting to be so happy with it. I've been underwhelmed by Apple products before, but not this time. I highly recommend it.", "Date": "December 19, 2013"}, {"Title": "Apple Air Fun", "Author": "Albert C. Marth \"Albert c. Marth\"", "ReviewID": "R1F0R6VV0RKR7G", "Overall": "5.0", "Content": "This I-Pad is definitely a step up from last years model!  It's is lighter!  It is faster!  The picture is the best  I have seen.  The picture shows the pictures in a brilliant fashion!  The thinner all over design is really appealing!The seller and their service was exceptional!  You wont be disappointed", "Date": "December 5, 2013"}, {"Title": "Defective Item", "Author": "Nik", "ReviewID": "RUSB2R1PF1O2T", "Overall": "1.0", "Content": "Purchased this brand new iPad Air 64 GB from TechGiant(Amazon). Was with broken volume button!Was going to return it, but thanks to the Apple Store in Cherry Creek to exchange it for another one.", "Date": "April 27, 2014"}, {"Title": "IPAD AIR unusable, tech support is worthless.", "Author": "Dr. Sarah M. Young", "ReviewID": "R11CXF8RPTZQJW", "Overall": "1.0", "Content": "I purchased the IPAD air last week. When I tried to activate my accounts it would not allow it because apparently since I changed carriers I could not use my old Apple ID because it is tied to the old carrier. I can't establish a new Apple ID because I have an old one and if they delete the old one I lose all the apps I've paid for. I contacted Apple Technical where I was required to purchase tech support before they would do anything.  After doing this I went through multiple calls with multiple levels of support over three days so far with more to come. Seems that if the tech makes a mistake it stops the process and you have to wait 24 hours for them to be able to continue. They promise to call back and so far they have not so I called them to start the frustrating cycle all over again. I can't get the apps I want until this if fixed. I also can't connect to Facebook. For a machine this expensive plus having to pay for tech support for something that is Apple's fault I now believe Apple products aren't worth the gas to go buy one. I've been using Apples since the Apple Plus and I feel abused as a customer for the IPAD AIR. On top of all this they just had the gall to send me an email thanking me for contacting Apple Support. They have charged me for something a user should be able to do online with a new machine that is supposed to be the latest and greatest and it is just a paper weight right now. Can't return it because there is nothing wrong with it. Seems to me Apple is unethical and does not care about customers after a purchase. Dr. Sarah young", "Date": "January 26, 2014"}, {"Title": "Don't buy from Worldwide Distributors!!!  Restocking Fee for Returns!", "Author": "joedc831", "ReviewID": "RAIJ37X44JFHX", "Overall": "1.0", "Content": "They have a 10-15% restocking fee for returns that is not easily found on Amazon's website. Upon returning the unopened iPad Air to them, they charged me a $51.70 restocking fee.  Avoid Worldwide Distributors.", "Date": "January 15, 2014"}, {"Title": "The best generation!", "Author": "Above Skies", "ReviewID": "R12T2TOEDZIPBQ", "Overall": "5.0", "Content": "Absolute Top quality!It just feels great in your hands, and even though it is extremely light, it does not feel cheap or weak.I have had every single Ipad, and this is truly a real upgrade to past versions.For those wondering if this hardware update is worth it over past generations, it is.Everything is super fast! Highly recommend it!", "Date": "November 1, 2013"}, {"Title": "Good for its use cases.", "Author": "rpv", "ReviewID": "R3TMGE8ZF8MJZA", "Overall": "4.0", "Content": "I have been using Android tablets for past 3 years. I decided to take the plunge for iPAD AIR due to its weight and for sheer desire to see what is in place. I should admit I do love Android, and would like a Android OS on a iPAD like hardware. I miss the BACK  capacitive button the most.Broadly I see different categories of people in vertical basis- by size: phones (4-5\"), mini tablets 7-8\", tablets 9-10\"- by OS: Android, iOS, FireOS and maybe Windows 8- by cost: cost conscious and gadget freaks who have no care for the money and pile it on the plastic card- by disease: who have TACS [ Tablet Acquisition and Craving Syndrome ]SPEC COMPARISON:To begin, let me deep dive into specs of a broad range of top tablets as of now. --Kindle Fire HDX 8.9\"Samsung Galaxy Note 10.1\",iPAD Air 9.7\",Samsung Galaxy Tab 3 10.1\",Google Nexus 10\" andSamsung Galaxy Tab 3 8\"I am throwing in the Tab 8 as I feel there will be a segment of people who are inclined for it in favor or HDX. Reading the specs for WHAT matters to YOU most is critical. I know for some people, the weight matters, for some size. For some the SD card is a deal breaker. So read on..key_specs of leading tablets as of 2013: { model: resolution, ppi, CPU, RAM, Flash memory, SD_card, camera spec, weight, OS_type, size, charging/sync port type, GPS:y/n }Kindle Fire HDX 8.9\" model: 2560 x 1600, 339 ppi, Snapdragon 800 2.2 GHz quad-core, 2 GB RAM, 16/32/64 Flash Memory, No microSD card, 8MP rear-facing camera, front-facing 720p HD camera, 374 grams, FireOS 3.0, 9.1 x 6.2 x 0.31 inches, microUSB, GPS:no [cellular versions have GPS]Samsung Galaxy Note 10.1\" 2014 Edition: 2560x1600, 299 ppi, 1.9GHz Samsung Exynos 5420 Quad-Core Processor, 3GB RAM, 16/32 GB Flash Memory, microSD slot:yes(upto 64 GB), 8MP rear camera and 2 MP front-facing camera, 560 grams, Android 4.3 Jelly Bean OS, 9.57 x 6.75 x 0.31 inches, microUSB, GPS:yes. S-Pen (flagship),iPAD Air 9.7\" (2013): 2048 x 1536 resolution, 264 ppi, A7/M7/64 bit processor, Flash Memory: 16/32/64/128 GB, SD Card:no, 5 MP back, 1.2 MP front, 469 grams, iOS 7, 9.4 x 6.6 x 0.29 in, lightning port, GPS:no [cellular versions have GPS]Samsung Galaxy Tab 3 10.1\" model: 1280 x 800, 149 ppi, Intel Atom 1.6GHz Z2560 dual-core processor, 1GB RAM, Flash Memory: 16/32GB, microSD slot: yes upto 64 GB, 3.2MP rear-facing, 1.3MP front-facing, 510 grams, Android 4.2.2, 9.57 x 6.93 x 0.31 in, micoUSB port:yes, GPS:yesGoogle Nexus 10\" model: 2560 x 1600, 300 ppi, CPU: Dual-core A15, 2GB RAM, 16/32 GB, SD:no, rear:5 MP, front:1.9 MP, 603g, 10.4\" x 7\" x 0.35\", mcroUSB, GPS:yesSamsung Galaxy Tab 3 8\" model: 1280 x 800, 189 ppi, Exynos 1.5GHz dual-core processor, 1.5GB RAM, Flash memory: 16/32GB, microSD slot: yes upto 64 GB, 5MP rear-facing, 1.3MP front-facing, 309 grams, Android 4.2, 8.26 x 4.87 x 0.29 in, microUSB port:yes, GPS: yesYou should come up with three top three specs you want and should be able to nail it down with the above spec. If you have doubts shoot me a comment, I can help!Having used several tablets, I like the hardware weight and screen resolution of iPAD Air. It takes 3-4 years for a tablet maker to reach an acceptable level. All previous full size iPADs were heavy for me. I won't go into details of iOS7 itself. I am also disappointed Apple has GPS only on 4G models. The apps and security of iOS platform is generally good. What I don't like is the iTunes way of syncing up. Not a USB drap and drop. This is the primary reason for me giving a 4 stars. Android trumps in this regard.Overall being a geek, I like all makers. I don't bias and want Apple to succeed. Success of Apple will propel Google and other makers of tablets. My wishlist is to try a a Windows tablet once they get through a iteration cycle in late 2014.Overall iPAD is a delightful tablet as long as you accept its limitations. I use with the light Pink case which is bright and beautiful!", "Date": "December 25, 2013"}, {"Title": "Great Product", "Author": "12Junes", "ReviewID": "R131F02L9OA31P", "Overall": "4.0", "Content": "After coming from the 1st gen iPad, this took some getting used to. There are things that I like and things that I don't, but I think it's just personal preference. I do think that my 80 year old parents would have had a more difficult time getting used to this one.", "Date": "December 12, 2013"}, {"Title": "Love it", "Author": "Curt", "ReviewID": "RJ5E3PPGZEGQI", "Overall": "5.0", "Content": "I replaced a Samsung Galaxy tablet I bought just for fun.  It was ok, but was difficult to use, had limited apps, and seemed slow compared to my iPhone.  So I decided to try the iPad even though it was twice as much.I love this thing!  It's fast, intuitive, more apps, and just plain works better.  This tablet does so much more, works so well, I'm seriously considering going Apple instead of PC.  Don't think you can go wrong with an iPad, or iPhone either.", "Date": "June 8, 2014"}, {"Title": "BEWARE of unusable iPad Air!", "Author": "MORE THAN UNHAPPY!", "ReviewID": "R109F1FVFO7ZBB", "Overall": "1.0", "Content": "The iPads I purchased from TechGiant were not as they were described! When I took them to T-mobile to activate these \"brand new ipads\", I was told that they could not activate 4G on any of the 8 ipads I purchased! This was because all 8 were previously owned and blocked for FRAUD! TechGiant is selling previously owned items!  TechGIANT I would appreciate it if you contacted me directly to resolve this asap!", "Date": "June 4, 2014"}, {"Title": "I pad rocks", "Author": "Elizabeth", "ReviewID": "RXW5V6IUCQIZW", "Overall": "5.0", "Content": "I bought this wonderful table for my birthday this month so far I have no problems with it it does everything and more .I would recommend it to anyone this tablet rocks I am a satisfied customer.", "Date": "March 26, 2014"}, {"Title": "I love this thing.", "Author": "Signalshifter", "ReviewID": "R1PG0RSEDGFJ0B", "Overall": "5.0", "Content": "I have had several iPod Touches over the years and I have always wanted an iPad. Well the iPad Air had all of the power, features, and storage space I was looking for.  I was looking forward to it's arrival and when I first started to you use it, it was somewhat of a wa-de-doo-da experience not disappointment but total familiarity because of all of the iPod Touch's I have. Then it started to grow on me, watching Crunchyroll anime, Amazon Prime movies, and it's prefect integration with my Apple TV all of this while being decadent in bed with my Irish Terriers snuggled up around me, total domestic bliss. It is a howler when you accidentally activate Siri while asleep my snoring it gives Siri fits.  I purchase the small Apple keyboard for it and this just enhanced the iPad more, now I have a really nifty alternative to a small notebook computer.  I have not commented of the functionality I suspect most of you out there are like me coming from another iOS device. I do notice some un Apple like bugs in iOS 7.01.and somewhat less in 7.1 but have a PC with Windows 8.1 installed so any minor bugs in iOS-7.1 are nothing compared with this disaster from M$.", "Date": "March 22, 2014"}, {"Title": "Just what we needed", "Author": "Carol L", "ReviewID": "RV8GCGFKFRA88", "Overall": "5.0", "Content": "Large , clear, easy to see. My husband does not like electronics, but he loves his I-pad. Shares what he likes with everyone who will listen.", "Date": "March 21, 2014"}, {"Title": "best mac product", "Author": "mindy rosenbloom", "ReviewID": "R3637KAZKBDYO1", "Overall": "5.0", "Content": "love the size portability battery life looks seek like having appshave the desktop mac air iphone this is the best", "Date": "March 21, 2014"}, {"Title": "Great Device", "Author": "Adam R.", "ReviewID": "R26IVP3W64PC4J", "Overall": "5.0", "Content": "This is a great device.  I am able to be very productive on it.  I pair it with my New Trent Airbender case, and it is almost like having a light laptop.", "Date": "March 6, 2014"}, {"Title": "great device, but beware of third party sellers", "Author": "J. Zajaczkowski", "ReviewID": "R33HKDXO136BFX", "Overall": "5.0", "Content": "I recently got the iPad Air 128GB from TechGiant and immediately after getting it I took it to my local Apple store to get AppleCare+ for it. After talking to 3 different reps and finally a manager it turns out that the model I actually received was the ME898E/A and not the invoiced, and what was on the package, ME898LL/A. After doing some research the manager determined that they could not sell me AppleCare because the model wasn't sold in the US, but instead in Mexico. The Apple store manager then advised me to return the iPad because not only did I not receive the model invoiced but also that if I had any problems with it I would not get any warranty service because warranties are not offered for Mexican sold Apple products.Otherwise, this is the best tablet I have ever used. Like any other mobile device or computer, it does have problems if you open every app without closing them. To close apps on your iOS 7 iPad, simply double click the home button and swipe upwards the apps you aren't working with. This way you can enjoy the cutting edge speed this thing is capable of.", "Date": "March 6, 2014"}, {"Title": "I find it difficult to get used to", "Author": "beatrice j seegers", "ReviewID": "R1SUXXIMMTN7O7", "Overall": "2.0", "Content": "I've tried hard to learn how to use my pad, but still finding it hard to use.I suspect this could be me...but it \"freezes\" up and I do turn it off and start over but some times it does not work.I'm thinking of giving it to my son and getting a laptop.I like the pad and the ease of using the keyboard.The size is perfect and it is not too heavy", "Date": "March 4, 2014"}, {"Title": "Best iPad yet", "Author": "Amazon Review Dude", "ReviewID": "R2QU4ZAJZXRQ92", "Overall": "5.0", "Content": "This is definitely the best iPad I have owned.  I am upgrading from a 3rd gen retina iPad, but I've also owned an iPad 2 as well.  The weight of this thing is definitely one of the biggest draws.  The screen obviously looks just as good as the prior retina models, but the decreased bezel on the side is really nice.  I can almost palm the device and still have a full iPad screen.  I use it as my daily couch device every single day.  I think the iPad has gotten to a point where it can replace the need for a laptop for most folks.  While I still need a high performance desktop for various reasons, the iPad really gets what I need done when I am lounging around.", "Date": "February 16, 2014"}, {"Title": "It's fast.", "Author": "Stenar", "ReviewID": "R2THLW674YDVD", "Overall": "5.0", "Content": "The iPad Air is so much faster, thinner lighter than my old iPad.  I love every minute I am using it.", "Date": "February 16, 2014"}, {"Title": "Entertainment Paradise", "Author": "Jacob Weltchek \"NOTWS\"", "ReviewID": "R1D544EV1WPSS7", "Overall": "5.0", "Content": "Pros:- Battery life (10+ hours)- Thin, and light (about a pound)- Best app storeCons:- Expensive- Proprietary port- Fingerprint magnetSummary:If you want the Cadillac of tablets, then look no further!", "Date": "February 15, 2014"}, {"Title": "I did a lot of research prior to buying!", "Author": "Pamela Paulhamus", "ReviewID": "R3B1QR0WE8X63B", "Overall": "5.0", "Content": "I absolutely love my iPad Air!  I spent months doing product comparisons.  I spoke to many tech geeks at various stores in addition to reading hundreds of on-line reviews.  The one thing I wanted to know was if I could load photos from my camera's SD card into the iPad.  Everyone said no!  Even the people in the stores SELLING them!  They were wrong!  Apple has two items that allow for this.  I purchased the Lightning to SD Card Reader ($27) and it works beautifully.  I took the iPad with me on two recent trips.  It was great being able to transfer my photos daily into the iPad to view them as opposed to trying to look at them on my camera!  With the 128GB of storage, I can keep quite a few photos stored on the iPad.  There are many apps available for photo editing and sharing.  I love everything about the iPad!  It was also nice having it on the long flights....between looking at my photos and playing all the games I have loaded into it, the time just flew by!  Of course, there are many other reasons to love the iPad, but for me, being able to view and edit photos while away from home is priceless.  I wouldn't want to ever fly with my laptop because of the weight.  But the iPad Air...it's a real gem!  Weight-wise...it weighs less than most books I might have taken with me to read!  I highly recommend it!", "Date": "February 15, 2014"}, {"Title": "LOVE it", "Author": "Paige Clark", "ReviewID": "R29Q4FQWDF77IA", "Overall": "5.0", "Content": "I love my iPad! Long battery life, great screen quality, light & portable. You can hook it up to your phone through iCloud and share apps, photos and contacts. You can text (iMessage) anyone in with an apple device from your iPad too! It's great. I use it daily with little to no problems", "Date": "February 9, 2014"}, {"Title": "This is my first Apple product", "Author": "JoanB", "ReviewID": "R1WOGC3X69T2ZU", "Overall": "5.0", "Content": "The learning curve is steep for a previous non-Apple owner but well worth it.Overall I can't think of anything negative to say about the iPad Air.", "Date": "February 6, 2014"}, {"Title": "iPad Air", "Author": "Pat Hackler", "ReviewID": "R1KCPF2I9YOGA0", "Overall": "5.0", "Content": "I love my new iPad Air. It is fantastic! It can do all the things my old laptop could do and more.", "Date": "February 4, 2014"}, {"Title": "My wife loves it!", "Author": "K. Bushaw", "ReviewID": "R1LDL7GFV636V0", "Overall": "5.0", "Content": "I gave one of these to my wife in exchange for her iPad 2 that she also loved very much.So, I got the hand me down which is still in very good condition.The most noticeable improvements over the iPad 2 are the speed and cameras and, of course, it is significantly thinner and lighter.About the only significant downer to this device is common to ALL iOS devices...and that is that you cannot access FLASH-based web sites or information.  Steve Jobs adamantly refused to support it to his dying day and that 'legacy' continues.So, back to the PC when we need to do that.I was concerned about going to the lightning connector but it hasn't been too much of a problem.  She just can't use it with some of our devices that have the original 30-pin docking stations.It's really nice that, currently, T-Mobile will give you 200MB of cellular data per month FREE with this model whether or not you bought it from them or have any of their other wireless services.  I just subscribed this one for my wife a couple days ago.", "Date": "February 1, 2014"}, {"Title": "Ipad Air", "Author": "James R. Valley \"vermont lover\"", "ReviewID": "R1FSBZRO58T0P", "Overall": "5.0", "Content": "Bought it for my wife and she loves it a lot better than her old series 1 ipad can do so much more on it.", "Date": "January 28, 2014"}, {"Title": "Glad I Got It!", "Author": "Bonnie Dreyer", "ReviewID": "R3K1DF6U7VJ3M7", "Overall": "5.0", "Content": "I have an Iphone but wanted something bigger so I could read books and newspapers and just have a bigger screen.  It is perfect for me and I am glad I got it.", "Date": "January 27, 2014"}, {"Title": "iPad Air!!", "Author": "Jade", "ReviewID": "RK2DX2AY1IP6C", "Overall": "5.0", "Content": "This item meets the expectations and is quite beautiful/ The pixels makes each image sharper and more clear. The effect of the camera is like nothing I have seen! I would recommend this product and would purchase it again!!!!!!", "Date": "January 26, 2014"}, {"Title": "Love it!", "Author": "Ginger", "ReviewID": "R22G29I53DF5PN", "Overall": "5.0", "Content": "The iPad Air is as great and better than it looks on the Apple website or commercials.  I had the mini and traded up for the Air.  I made a great decision and no one can come close to competing with Apple.  (Just my opinion).  I love my MAC, iPhone and iPad Air.", "Date": "December 12, 2013"}, {"Title": "stopped working within 2 months of buying", "Author": "Sohaib Aleem", "ReviewID": "R257N3O7VADWE5", "Overall": "1.0", "Content": "for no obvious reason (no spills no voltage issues with other electronic appliances) stopped working. Headache not worth the investment and brand recognition", "Date": "May 7, 2014"}, {"Title": "Fragile", "Author": "Greg Brown", "ReviewID": "R27BMGL1WEQM", "Overall": "3.0", "Content": "Nice device, but very fragile. I've had mine for about 6 months and the screen cracked for no apparent reason. Apple won't fix it - they will only replace it for $300 (on top of the $700 I already spent on it). No thanks.", "Date": "March 17, 2014"}, {"Title": "Waited for 5 gens for this gem", "Author": "David Werble \"davidwerble\"", "ReviewID": "R2BVKVKG7W1YJ8", "Overall": "5.0", "Content": "Even with the case it is light. More importantly it is FAST. I didn't really need the AT&T; hook up (haven;t bought it yet) so unless you are a traveler finding no WiFi I'd go with WiFI only and save some $$$$.", "Date": "February 2, 2014"}, {"Title": "Good entertainment tablet", "Author": "A. Kim", "ReviewID": "R23977JLEDF4M8", "Overall": "4.0", "Content": "I have recently transitioned from PC/Android so I am still learning the rope but my overall experience have been very good.  Initial set up was breeze, Retina screen is pleasure to see, lighter weight means less stress on my wrist from extended use.However there was one issue where I thought people who are thinking of switching from Android tablet to iPad should consider carefully first.iPad has no file system like Android tablet so simple cut and paste file/folder transfer will not work.  Google it first with \"How do you transfer multiple folders to iPad?\" and read what others have said.  You can download third party software that will allow you transfer individual folder content at a time but that is tedious and time consuming if you one to transfer whole bunch of folders at once.If you can swallow the price and the above mentioned \"issue\", then I whole heartedly recommend iPad over Android tablet.", "Date": "January 28, 2014"}, {"Title": "Air or mini, cellular or wifi? The hardest choice.", "Author": "Mumbly Joe \"MumblyJoe\"", "ReviewID": "R1EP8MRB01CCTV", "Overall": "5.0", "Content": "A lot of people have already talked about the merits of this device and the pros and cons. For me the decision wasn't so much which to buy but rather which one I wanted. Originally I got the mini to replace my kindle touch because of the price and the pocketable size. Ultimately I ended up with the air. Here's why:Grip: despite the very comfortable dimensions for 1 handed holding of the mini the extra thin bezel proved problematic. The palm rejection tech is supposed to be quite good but I found it unreliable and for those times I wanted to gets.  Eventually I always wanted to get a hold of it with  the bezel between my thumb and forefinger but either ended up with a thumb right in the middle of whatever I was watching or a hand cramp.Real estate: getting smaller means text is smaller especially on we pages In portrait mode. You can set the text size up for dynamic type but it doesn't work everywhere and when if does work and you change to landscape, then the text is far too big for the screen. Furthermore, in games where part of the screen is used for the controls I ended up wishing for a larger screen.Keyboard: the keyboard ended up being the main reason I went for the Air. While it is surprisingly good on the mini (really it blew me away how good the keyboard was in the mini) typing at that size for any extended period is taxing and it just can't compete with the Air if you plan on writing any amount. Furthermore, using the GarageBand keyboards are fairly awkward on the smaller screen. Unlike the accessory keyboards for the full size iPads, I found the external keyboards for the mini were actually much much worse than the onscreen keyboard.Pocketability: the mini fit quite nicely into a jacket pocket, in the climate where I live jackets are only really feasible about 3 or 4 months out of the year. Other than that it needs bag of some sort, which is really the same situation I'd be in with an Air.Weight: this made the choice the hardest. Holding the iPad mini feels like hardly anything at all. The iPad air feels considerably heavier. That affects everything you do with the tablet and the entire interaction with it. Fortunately it's mostly a matter of perspective. Put down the mini for a day and all of a sudden the air seems  quite light.For me the decision was made for the larger version but what about options?Cellular of no cellular? The free 3G on my kindle touch has gotten me out of a scrape more than once and having access to a no-strings-attached internet connection is guaranteed to come in handy at least once during the lifetime of your tablet. $130 is a lot to spend though, especially if you have a smart phone and free tethering on your plan. Originally I went for the wifi version for precisely this reason. However, the ability to tether is dependent on the carrier you happen to be using. Should you switch phones, carriers or plans or simply lose the phone while traveling tethering May no longer be a option and it's never going to be as convenient as simply opening the settings on your iPad and activating a plan. In addition you also gain the ability to use gps with a cellular modem and gain the benefits of enhanced find my iPhone accuracy in the event that it's stolen and the thieves know enough to keep it off wifi. Finally though, the possibility of a free 200 mb per month with t-mobile and the ability to switch carriers at will ended up pushing me to get the cellular version.So, after having initially been interested by the mini, a lot  of research, even more indecision and having bought, lived with and sold multiple versions of this thing I can safely say that the iPad Air with cellular is the  version I'd pick. If you don't plan on typing a lot with it though or watching movies, go for the mini.", "Date": "January 9, 2014"}, {"Title": "First Ever Apple Product - First Ever iPad - LOVE IT", "Author": "JoHarley", "ReviewID": "R1X2GEOQACNWD2", "Overall": "5.0", "Content": "The has become a great tool for my photography needs. I got it around mid November so I haven’t had it that long. I've been tired of carrying a laptop when going on a trip which I used to download daily the photos taken that day. Thought I’d give the iPad a try.Pros:- It’s super light in weight which makes it ideal for carrying.- It’s fast. Apps run very nicely.- Great camera and photo tools.- Beautiful screen! Photos look super nice on display.Cons:- BIG, BIG CON! You can’t connect an external, off the shelf, drive to it for backing up my photos. Ended up spending twice the money for the Seagate Wireless Plus, 1 TB. It took a bit of setting up but it does do the job. BUT STILL! Why on earth can’t I simply connect a $70 one TB drive to the unit?? Seems a bit petty to me.- Connectors costs a bundle! I needed an SD card reader, an HDMI connector for streaming video to TVs in hotels, and a Micro SD connector  for my smart phone and other devices. The HDMI connector itself was $50.00. This thing probably cost $0.50 to make, but I WAS warned  about Apple’s marketing tactics…- The manual leaves a bit to be desired. I’ve learned more from friends then I have from their manual. Ended up with the book “My iPad” for Que. Good book…Still got some learning to do with this device but it has been fun to figure out. And for photography work, it’s going to be nice to have.", "Date": "January 4, 2014"}, {"Title": "Safari Crashes Constantly", "Author": "Philly Music", "ReviewID": "R228PDSRURQMT7", "Overall": "2.0", "Content": "As a MacBook Pro user and Apple supporter, I'm surprised and very disappointed that Safari on my brand-new iPad Air 16G crashes constantly.  It's obviously a known issue, as the discussion boards are filled with similar reports.  This could not have been missed during product testing. Inexcusable.", "Date": "December 13, 2013"}, {"Title": "Padman", "Author": "Joe Consumer", "ReviewID": "R25QATJS0DQ09G", "Overall": "5.0", "Content": "Lighter by far.  I love the large screen, but till now would find myself using the iPad Mini most of the time.  The iPad Air is light and comfortable to hold. The Mini is now the backup as I love the Air.  Speed increase, overall case size reduction, and weight reduction are all solid reasons for the upgrade.", "Date": "November 12, 2013"}, {"Title": "Great Purchase", "Author": "Art Lover \"Art Lover\"", "ReviewID": "R18PG2QYWEFW0V", "Overall": "5.0", "Content": "As expected, an excellent product. Great battery life and graphics as well as availability and variety of apps.I am very satisfied with my purchase.", "Date": "May 23, 2014"}, {"Title": "iPad Air", "Author": "Carol K.", "ReviewID": "R3EJL85ZMA4XUO", "Overall": "5.0", "Content": "I love my iPad Air!!  It is so light and a perfect size. I love face timing with it!! I have more to learn about it, but am having fun learning. I highly recommend it!Carol", "Date": "February 11, 2014"}, {"Title": "Bittersweet...", "Author": "William Hall", "ReviewID": "R3D0HWEYH53PPH", "Overall": "5.0", "Content": "Well, I bought it for my wife and she loves it.  She won't put it down.  Therein lies the problem.  I wish it would break, lol.Anyway, it seems to be a great product.  Apple stuff is user friendly as usual.One problem, and it's not the pad's fault - I went to Wal-Mart and got her an Otter Box for it.  It said right on the box \"fits the latest iPad\"  Well, apparently the \"latest iPad\" when those things were shelved was the iPad 4, because it did NOT fit.Otherwise, seems to be a great device.", "Date": "February 11, 2014"}, {"Title": "The best ever!!", "Author": "simplicity", "ReviewID": "R1PC1ZMF36ZAZ4", "Overall": "5.0", "Content": "Nothing has it beat, by far!!!! Made a mistake buying my husband a tablet that works off Android, it is now mine, and I'm still trying to learn how to use it!! Apple is just so user friendly, and when you have used the iPhone for so long, you turn on the tablet and can start using it immediately! The screen display is like no other I have ever seen, very sharp!!! Transferring songs, photos, videos, etc. is a no brainer when you have Apple products. SO glad I was able to get this tablet for my wonderful husband! :)", "Date": "February 11, 2014"}, {"Title": "Love it!", "Author": "J. Rillera \"Mateo's Mom\"", "ReviewID": "R2NQLGMIJ514IN", "Overall": "5.0", "Content": "I surprised my husband and bought it for him for Christmas.  He loves it!  Apple doesn't disappoint with the retina display and how light the iPad is.  Great stuff!!", "Date": "February 11, 2014"}, {"Title": "Easily the best tablet on the market, beware though...", "Author": "Daniel Roskeland", "ReviewID": "R2ZTBGIQ0IH1OQ", "Overall": "5.0", "Content": "My ipad has practically become part a of me, so I'm not even begin to go in depth as to how handy and awesome it is. I had the ipad 4 before this and traded it in to upgrade and when I received the new ipad air I was IMMENSELY excited!There is not much of a difference though! Nothing seems to go faster than before. Sure it's lighter and thinner.. But not much else has changed! If you have an ipad with retina.. There is no need to upgrade. The only thing you will feel has changed is the weight and the nice new back cover on it. It does look a lot more sleek and sexy now though.ALSO, since this is still a fairly new product.. You will more than likely receive an ipad air with scratches, dings, or smudges on the screen or on the back. Right out of the box my ipad had a scratch right above the volume rockers. I was soooo disappointed but I found out everyone has been having these problems.. and sending it back in for a replacement will more than likely just give you the same problem (if not worse). So just a heads up!Other than that, this is undoubtedly the best tablet ever created to date.", "Date": "February 11, 2014"}, {"Title": "worth the wait", "Author": "judith zimmerman", "ReviewID": "R3NJ2PXA45LG6F", "Overall": "5.0", "Content": "ease of use  even for this 75 year young grandmother  didn't even need much help from the grands or help site", "Date": "February 9, 2014"}, {"Title": "From Ipad2 to ipad air", "Author": "Savage", "ReviewID": "RUM9YWWS49Z63", "Overall": "5.0", "Content": "First thing i notice about this how light it is. The speed is a 2nd and loved it within the hour of using it. The A7 64-bit processor makes it even better but that type of power makes the  felling of batter life shorter. Other than that this Ipad is amazing of worth what i paid for.", "Date": "February 9, 2014"}, {"Title": "Excellent product", "Author": "Hugo", "ReviewID": "R2IJI5GZRTUNCV", "Overall": "5.0", "Content": "It is what Apple claims that it is. Superb in all aspects. Quicker connection to wifi networks, easy to use even for those who are used to android.  In fact is much easier for first timers than android.  Management of memory is also exceptional and video quality is amazing too.I would recommend very much this item.Seller accomplished everything he promised, very good one.", "Date": "February 8, 2014"}, {"Title": "Perfect tablet for my use.", "Author": "Deepam Panchal", "ReviewID": "R2GQ90JRKA0YAK", "Overall": "5.0", "Content": "It is perfect!!!!!Light weight and powerfulI use it for work, jotting down ideas and watch movies on Netflix.", "Date": "February 6, 2014"}, {"Title": "Love!", "Author": "Marsha F.", "ReviewID": "R3PQWMS937GG8Q", "Overall": "5.0", "Content": "Bought this for my husband for Christmas. He loves it. Takes it everywhere. No crashing issues with the OS like on his Iphone. Screen is amazing. Pictures and video come out great. Would highly recommend.", "Date": "February 1, 2014"}, {"Title": "Love it", "Author": "jahnny", "ReviewID": "R2AEFTL0X558WC", "Overall": "5.0", "Content": "It does every thing my laptop can do and I can use it anywhere I use it for mostly school", "Date": "January 29, 2014"}, {"Title": "Excellent", "Author": "Patrick J. Webb", "ReviewID": "R1BT7HMPD3DJ33", "Overall": "5.0", "Content": "Other than not being able to use Flash Player this is an excellent product. 9 out of 10 for no Flash.", "Date": "January 28, 2014"}, {"Title": "Nice.", "Author": "J. Powell", "ReviewID": "R205T84XGYQMQ1", "Overall": "5.0", "Content": "What can I say. It is made by Apple, it works every time. Retina display is beautiful and makes picture taking a whole new experience...", "Date": "January 28, 2014"}, {"Title": "perfect", "Author": "Khalid aljamei", "ReviewID": "R2DZ0KCOMYT4VD", "Overall": "5.0", "Content": "its really nice, useful, and will change your whole experience, its nice to have, don`t miss it.really something new", "Date": "January 28, 2014"}, {"Title": "Service not good", "Author": "James Lawrence", "ReviewID": "R2X2LXS8Z8VZ9V", "Overall": "5.0", "Content": "The ipad is great. The problem is my wife wanted a white one and as you can see that is what I ordered, but what I got was an all black one. Not  pleased with that at all.", "Date": "January 17, 2014"}, {"Title": "Product meets need of student", "Author": "Frank D Kot", "ReviewID": "R3HK0DQL92JECY", "Overall": "4.0", "Content": "Product was a gift for my grand-daughter. - She will be using it in Middle School where everyone uses tablets.", "Date": "January 12, 2014"}, {"Title": "Great buy at a very competitive price.", "Author": "RICHARD DANDRADE", "ReviewID": "RPLGS6V47S6DK", "Overall": "5.0", "Content": "Because it was worth the money and i couldn't beat the price anywhere else.The shipping was a bit slow but i got it before christmas and that's what was inmportant. Brand new, never opened.", "Date": "January 11, 2014"}, {"Title": "Excellent product", "Author": "Edward L. Byars", "ReviewID": "R2F88WDUKFW79P", "Overall": "5.0", "Content": "Everything was as expected and as advertised.Great value for the price.New in box with charger.Met my expectations.Super fast shipping.", "Date": "January 10, 2014"}, {"Title": "No problems to date", "Author": "donyelle", "ReviewID": "R2U7X0HX11T8NU", "Overall": "5.0", "Content": "It's worth the investment. Portable light weight and everything you need to work smarter not harder. Came brand new in box", "Date": "January 7, 2014"}, {"Title": "As Expected", "Author": "Wendy", "ReviewID": "R18SZF7JD9MMV2", "Overall": "5.0", "Content": "In good working order and no issues with product so far.  It was recevied a little late but still before Christmas.", "Date": "January 6, 2014"}, {"Title": "Great iPad", "Author": "jacksonw765", "ReviewID": "R3F9G5XEL7TEKT", "Overall": "5.0", "Content": "Great apple devise, I used it to write this review! Highly recommended. Very light and very powerful, but you want to get more than 16gb.", "Date": "November 17, 2013"}, {"Title": "Poor Product", "Author": "Alan Dale Daniel", "ReviewID": "R368KCEO7IGJGJ", "Overall": "2.0", "Content": "My thoughts on the latest ipad Air from Apple.  First, try to buy the product through Amazon.  If you get lucky you will avoid 38+ dollars in taxes.  In my state I get charged that anyway.  I bought mine a few weeks ago and I now regret my decision.The ipad Air, full size not the mini, is expensive for what you get.  The much talked about retina display really isn’t much better than Apple’s or Samsung’s normal display.  I take a lot of photos and even at full zoom I can’t make out much difference.  The Apple ipad Air does NOT come with an SD card slot, and if you want to upgrade from 16gb to 32gb you will be looking at over $100 additional dollars.  Many of Apple’s competitors have the SD slot and cost less.Apple sells an SD card “reader.”  You can download from the card to the ipad but NOT the other way.  And the ipad SD card reader will run you $30 plus dollars.  You must buy other $30+ dollar accessories if you want to use a USB memory stick for example.  I purchased a non- Apple SD card triple reader (USB and SD for example) for about $9 dollars.  The machine complains at me but it still works (but, once again, it only loads to the machine not from the ipad as a normal SD slot does).An SD card reader would have been easy to install as part of the iPad, and this gives their competitors an edge, especially when one is taking photographs and trying to download them immediately to examine on something other than a 2 inch screen.  As I shoot RAW (large files) photos with my Canon this inability to use an SD card is a real pain.Downloading music from Amazon to iTunes isn’t any picnic either.  My wife has an android device from Dell running Jellybean and she downloads everything with zero problems.  Plus, she has an SD card slot which really helps.  Her screen is as sharp as mine.Finally, the OS systems.  Jellybean has about a million apps written for it while I have about 200 - or that is how it seems to me.  Her system is faster than mine AND her system is intuitive and mine is not.  I’ve had to read over the Apple manual for ipad three times trying to get things done.  Maybe my largest gripe is I bought the Apple thinking several Apple machines could sync up and trade information easily including photographs and music and documents.  Wrong.  I’ve tried numerous syncing ideas and none of them work.  I started using Pages (an Apple word processing program) instead to Word to get it to transfer.  Finally, I saved it to the cloud and managed to get the document to the other machine.  Photographs that are in the photo stream do transfer; however, getting the photograph into the stream when it was not automatically placed there by the ipad doesn’t work.  And finding photos to look at in the ipad, when the ipad did not take the photo and the photo is on another machine (with the photo stream on and home sharing on) the photo still does not come up.  Very frustrating.After using the ipad and watching and using Jellybean and Android in action I think the Android devices are a much better deal.  Get one with an SD card slot.  I am certain Apple has designed their machine so the user cannot get extra storage on the machine (as an SD slot would allow) and must buy a more expensive machine if they handle large files.  If you like buying music at Amazon good luck getting it to iTunes onto your machine if it is an Apple (Yes, I have Amazon cloud player).  My wife got her music downloaded in about a minute.  It took me an hour to get one of Mozart’s songs I had purchased downloaded to my computer.In retrospect, since the programs do NOT sync up as advertised, the machine has little storage unless you pay an enormous additional price, the retina display is not revolutionary, and the number of programs are minimal compared to Android I wish I had purchased an Android.  Samsung seems to be on the cutting edge there, although my wife’s Dell is performing just fine.", "Date": "February 12, 2014"}, {"Title": "Apple iPad Air", "Author": "Oscar Crumby", "ReviewID": "R1LFVGKI48DRB6", "Overall": "5.0", "Content": "I would recommend this product to anyone that is looking for a tablet.  I have found it has met all my expectations.  The only problem I had with it is the necessity for a keyboard.", "Date": "January 25, 2014"}, {"Title": "Quickly", "Author": "YU Chen Yueh", "ReviewID": "R3C50D7ANEBMWR", "Overall": "4.0", "Content": "Good and quickly but the package in the left up cone has little crease. Hope next time to protect more good.", "Date": "January 7, 2014"}, {"Title": "Good", "Author": "Artem Lobovskiy", "ReviewID": "RJSHKSB0EGT2D", "Overall": "4.0", "Content": "This is a good tablet PC, display is the best! But iOS 7 make it not so fast as I expected.", "Date": "January 7, 2014"}, {"Title": "Enjoy iPad Air so far", "Author": "Brenda Williamson", "ReviewID": "RWPAMZPV65U5", "Overall": "4.0", "Content": "Bought as gift for my husband.  He likes it so far, said little heavier than he thought it would be. Still too new to really rate how it preforms for the long term.", "Date": "January 4, 2014"}, {"Title": "This is an iPad review", "Author": "hrhomer \"hrhomer\"", "ReviewID": "R2QICQPO763RU0", "Overall": "5.0", "Content": "I ordered an iPad Air, and got exactly what I wanted. An iPad Air. It works very well. eighteen nineteen twenty.", "Date": "December 21, 2013"}, {"Title": "unexpected.", "Author": "jay endiape", "ReviewID": "R2TJY0U0OC5ENC", "Overall": "3.0", "Content": "did'nt figure it out that this will be smaller than my previous Ipad2 and almost no difference for having a retina featrure. if there's an available Ipad2 i'm defenitely getting one again.", "Date": "January 18, 2014"}, {"Title": "Getting T-Mobile service activated is apparently IMPOSSIBLE", "Author": "Anthony Berno", "ReviewID": "R2CANZFJ2C72MG", "Overall": "2.0", "Content": "This has been a bit of a disappointment. I purchased the iPad Air with T-Mobile service directly from Apple, and when I try to set up my account, it informs me that \"my zip code is not valid\". (It's 95482, which is Ukiah, California, and from the connection indicator on the screen, we do seem to have 4G service here.) I spent 45 minutes on the phone with T-Mobile support to try to resolve this and was informed that I had to spend $10 on a new SIM card, which I did. On receiving the new card, the problem was not resolved. I called support again, and was shuttled from one line to another and finally disconnected. Nobody seemed to know what was going on or how to help me.This is really annoying. I'm a professional software engineer and have a lot of experience with mobile devices, and have never had to deal with this kind of runaround before.Add to that the fact that Safari crashes about once per hour, and I have to say this device is a big, expensive dud. Thin and light, yes, but in every way inferior to the iPad 3 I have already. Overall, a regrettable purchase.", "Date": "December 19, 2013"}, {"Title": "NO SIM CARD", "Author": "James P Solan", "ReviewID": "R28XWV64DOMIHO", "Overall": "1.0", "Content": "I recieved this product and it was missing the AT&T; SIM card I dont understand how you can not have the card in type of Apple product. Who is QA this when it leaves Apple?", "Date": "April 2, 2014"}, {"Title": "Not what I expected.", "Author": "bajangna \"bajangna\"", "ReviewID": "R1RSUPL9K57KEB", "Overall": "2.0", "Content": "This Ipad air is not for who love surfing internet, it crashed all the time. Very annoying. Apps mostly good. Design is great. But It's not worth even I got 32GB model for 515 included tax. Buy it for my girl. Wish it will be the best gift. No it's not.", "Date": "December 26, 2013"}, {"Title": "Does not stream Netflix in hd", "Author": "SpaceCat", "ReviewID": "R2P1VQC10SKXPX", "Overall": "2.0", "Content": "I bought this product primarily to stream movies and videos.  Although the screen is fantastic, and obviously built for HD, Netflix appears in a quality even lower than standard definition.  I have done a lot of research, and discovered a lot of folks are having this issue with the iPad Air.  After troubleshooting and trying all the fixes I could find, this is a dealbreaker for me, and it is getting returned. If you don't have Netflix, you might not notice this flaw.  Other streaming services seem to work okay.  Netflix told me it was an Apple issue.Although not a dealbreaker, I was also surprised how fast the battery drained on this device after hearing it praised in reviews.", "Date": "December 1, 2013"}, {"Title": "Apple Ipad air", "Author": "Luz Montoya", "ReviewID": "R1Q7KH84C44YNY", "Overall": "1.0", "Content": "I asked for an ipad air black with space gray. When we open the box: SURPRISE!!  They send me a white one! I didn't spent $10 dollars for this... They have to send what I asked for...", "Date": "May 31, 2014"}, {"Title": "I need a USB port ???", "Author": "Charlie P.", "ReviewID": "R9CGKSVPE7QDE", "Overall": "4.0", "Content": "I have the newest ipad but would like to purchase the ipd air 128GBI would like to use it for work docs to work at homeI would like to copy docs from work on a stick and download to my ipad airTell me is this possible. Is there a USB port on an ipad air", "Date": "January 4, 2014"}, {"Title": "Big improvement in design, little improvement in Safari crashes.", "Author": "Ken H.", "ReviewID": "R3NT1XHW2KQFGE", "Overall": "2.0", "Content": "Upgrading from an iPad one I have to say that overall this is a very good machine. My main disappointment is that Apple did not add more RAM. While the machine does not crash as much as my iPad one did, Safari crashes on me at least 2-3 times a day. At a cost of about a dollar Apple could add an extra gigabyte of RAM to this device and make it much more valuable to the consumer.", "Date": "November 21, 2013"}, {"Title": "Wow so many gigabytes!", "Author": "Drew Bandas", "ReviewID": "R2QMQMLEXKFPCB", "Overall": "5.0", "Content": "I have never owned this product, nevertheless it's a fantastic product. It is very expspensive but worth it! My sister is shopping for an IPad and this would be perfect it even has a touch screen! Wow! I'm sure if I owned this I would use it for various activities, such as ordering Chinese food or watching Garfield 2. What a great  movie, I can't believe a movie about a cat that like lasagna could be such a cinematic masterpiece. Back to main idea here, this is supposedly a great product, and I say wow!", "Date": "March 15, 2014"}, {"Title": "Not Overjoyed", "Author": "Amazon Customer", "ReviewID": "R1AVQNOU7NSTV7", "Overall": "2.0", "Content": "Purchased the iPad Air for my son who plays with it all of the time.  We had to reformat or reboot it last week already because it was frozen and would not turn on at all.  After the reboot or reformat it has worked fine ever since.  (Pushed the circular button on the bottom and the main startup button on the top right corner at the same time and held until unit started up again)", "Date": "January 2, 2014"}, {"Title": "Great!!!!", "Author": "Sean Slawik", "ReviewID": "R1CRLDM6WXA8P4", "Overall": "5.0", "Content": "Product came in an orderly fashion. Didn't get to use it because it is a Christmas present, so I will update this review once it is opened and being used", "Date": "December 10, 2013"}, {"Title": "iPad Air", "Author": "Petra E. Pershall", "ReviewID": "RH0NQSVS250M4", "Overall": "2.0", "Content": "I just purchased the iPad Air as a Christmas present for my grandson and so far I have had several problems with it.  I cannot get it to connect to my home Wi-Fi and had to have my business tech person work on it.  It was plugged to charge since before noon yesterday and as of 6 a.m. today, it had only charged 99%.  I have a iPad 2 and an iPad 4.  I wish that I had purchased one of those instead of the Air.  Hopefully, it won't crash on Christmas Day b/c my grandson is only 5 and won't understand why it doesn't work.  He uses my other iPads with no problems.", "Date": "December 23, 2013"}, {"Title": "I tried but wasn't for me", "Author": "Carter \"O.C.\"", "ReviewID": "R3L8JINUOZZDB5", "Overall": "3.0", "Content": "It's not a bad tablet by any means... one of the best BUT i'm slightly annoyed that it doesn't have the features i'm so use to using. My friend got me this as a gift to try to win me over to apple products... I gave it a go but It's just not for me. I decided to stick with my Samsung Galaxy Note 10.1 2014... I love using two screens at once.Pros: Really just the new design although I tend to have issues with the new bezel when holding it, you have no choice but to have one finger on the screen which sometimes causes issues with apps. and its smooth which is greatCons: Not enough features,  and boring. This was cool years ago but with tablets out there that allow multi screen and other amazing stuff...I gave it a go guys, and I really wanted to not be bias in my review. Hopefully you were able to see that. I think if you like the other Ipad's you will be happy with this for sure. If you want a much more amazing experience then i'd say go with the Samsung Galaxy Note 10.1 2014 or even a surface tablet.", "Date": "November 3, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00G30ONJK"}}