{"Reviews": [{"Author": "Sunny Salguero", "ReviewID": "R38FIWO7F9KRKQ", "Overall": "5.0", "Content": "Item is great for young kids who don't mind playing it on a wall charger, sadly it does not hold a long charge, but again overall for the price, it is a great item.", "Title": "Great Value Buy", "Date": "February 26, 2014"}, {"Author": "Porchea Davis", "ReviewID": "R39LIIU6GGPI93", "Overall": "1.0", "Content": "I would not recommend this item. It stopped working a week after having it. It Won't charge properly can't turn it on at all. I totally want a refund on this item. Completely disappointed.", "Title": "No good", "Date": "February 14, 2014"}, {"Author": "Kwame Fauntleroy", "ReviewID": "RZ84H3N75NAN6", "Overall": "5.0", "Content": "Brought this for as a Birthday gift for my 4 year old and he loves it. Has Google Play store and a good camera", "Title": "Great gift", "Date": "February 8, 2014"}, {"Author": "erika sanchez", "ReviewID": "R1R0WGGLIIKGR7", "Overall": "1.0", "Content": "I don't even use it,  when I opened & turn on the screen definition wasn't good at all. I just got a galaxy, the best.", "Title": "Not good enough.", "Date": "February 3, 2014"}, {"Author": "Rachael Ward", "ReviewID": "REXFK9M9N8VLQ", "Overall": "1.0", "Content": "When I received the tablet it did not work. I called tech support and all they did was send me an email of steps to try. Simple things like restarting it. I had 3 different error codes coming back so this did not help. I had a very heartbroken 8 year old on Christmas. Very disappointed on how the compamy handled this issue. Would not buy from them again.", "Title": "didn't work and not worth the hassle", "Date": "January 14, 2014"}, {"Author": "bevann", "ReviewID": "R2QXU4WFIHBL1J", "Overall": "5.0", "Content": "I purchased these for my older grandkids and they were very pleased. I have not heard any complaints from the and the age range is 8-18.", "Title": "very good product", "Date": "January 6, 2014"}, {"Author": "Ricklyn Beach", "ReviewID": "R1DLFAQJSWF1TK", "Overall": "5.0", "Content": "Purchased for my daughter and it is meeting all of her expectations. She is using it primarily for games at this point", "Title": "She loves it", "Date": "January 6, 2014"}, {"Author": "LaTiffany Bizzell", "ReviewID": "RTHGWJKQBV1IL", "Overall": "3.0", "Content": "My son really likes it. He is nine years old. But not what I excepted. But it's good. Thanks again", "Title": "Okay for the price", "Date": "January 6, 2014"}, {"Author": "Lisa Prichard", "ReviewID": "R3862X1W6UPCPY", "Overall": "1.0", "Content": "So far so good.  Purchased for my grandkids. They seem to enjoy them. Would recommend them to any one. Good picture, easy to learn.", "Title": "Lp1229", "Date": "January 4, 2014"}, {"Author": "Reading Teacher \"Reading Teacher\"", "ReviewID": "RDUYHIK9WCPM0", "Overall": "3.0", "Content": "This tablet is just ok. It doesn't have a lot of memory and the camera is not very good. I purchased for a child in lieu of a more expensive tablet, and so just for games it seems to be ok. Not sure that I shouldn't have just spent a few extra dollars and gotten a kindle fire...time will tell.", "Title": "Tablet", "Date": "January 3, 2014"}, {"Author": "Brenda McCorcle", "ReviewID": "R3OIXDU3AMVOF9", "Overall": "1.0", "Content": "At first I was excited but continued use with failure to hold a charge for 2hours or reloading a video every 5 minutes was frustrating while studying online. I feel that I should have bought a laptop instead.", "Title": "Meet the dragon that burned up my money.", "Date": "December 11, 2013"}, {"Author": "DENISE CYR", "ReviewID": "R36XGF9DL46NZJ", "Overall": "1.0", "Content": "This is not what I was expected because I have read the reviews, It won't let me download any games,  it shuts off for no reasons, and it is very very slow.  Save your money not worth it.", "Title": "Not worth the money", "Date": "December 14, 2013"}, {"Author": "Barnabas S", "ReviewID": "R3ED9D4QHV1EWK", "Overall": "1.0", "Content": "The screen's touch sensitivity is very low and the colors are quite dull. It also does not perform like I would expect a dual core processor tablet to. It's very laggy and that is how it acted right out of the box. Biggest issue is that the tablet will not turn on anymore. It doesn't react to the power cord being plugged in. Unfortunately for me, I delayed sending it back for too long and now it's past the return by date. So now I'm stuck with a $90 paperweight.", "Title": "Died after 1 hour of use.", "Date": "February 5, 2014"}, {"Author": "Tiffany Emery", "ReviewID": "R1ZN59ID79L0D1", "Overall": "1.0", "Content": "Because this product is junk. Screen goes haywire and the screen does not allow the pressure from finger all the time to select or thinks it is on the the next place down. Does not always turn on the first two times. Does not always let you shut it down. WiFi strength pick up is horrible.", "Title": "not worth the money", "Date": "January 3, 2014"}, {"Author": "Olivia", "ReviewID": "R12PSIK6KJKWCH", "Overall": "1.0", "Content": "I bought this product for a gift and it doesn't even turn on. The charger does not even fit in the port to even charge the tablet. Highly disappointed and would not recommend to trust this company!", "Title": "Refund", "Date": "December 25, 2013"}, {"Author": "Charisse Vega and Allende", "ReviewID": "R2OIG1EL3SU118", "Overall": "5.0", "Content": "Since the holidays are here my husband and I thought a tablet for our 14 year old son would be great. After shopping around at bestbuy and pc Richard we came across the dragon and right away we could not believe the price comparing it too other stores and their prices, we were sold. The tablet came yesterday I was happy when we open it and loved what we saw, yes we tested it it's light it has everything the camera is great wo sided. We liked it so much I bought two ore for myself and my husband and he told his coworkers back at work who have children grandchildren nieces nephew ect we are going too order 11 more yes you can't beat the price. I am very excited and pleased.", "Title": "Very surprised", "Date": "November 30, 2013"}, {"Author": "melysee", "ReviewID": "R19HUUOYN1T4LK", "Overall": "1.0", "Content": "I purchased this tablet for my dad back in December 2013. He doesn't use computer a lot so I thought this would be great for him as a way to introduce him to the internet and do his research and all. First few days it worked fine. And then back in February it stop working. It went completely dead would not even turn on. The charger is working fine. I'm always satisfied with the stuff I buy on amazon but this purchase was a big disappointment :( I do not recommend it", "Title": "Not great at all!!!!", "Date": "June 9, 2014"}, {"Author": "Charlanda Woodson", "ReviewID": "RG5I89SODUNN7", "Overall": "5.0", "Content": "I loved the color and so did my daughter and she also loved the two cameras. It is a great tablet at a great buy.", "Title": "Dragon tablet", "Date": "June 8, 2014"}, {"Author": "Michele Self", "ReviewID": "R130EVX4FSRVLJ", "Overall": "4.0", "Content": "We did actually get this one. We got in pink. Good product. But the leather cases are fragile. Thank you.", "Title": "Cases", "Date": "June 7, 2014"}, {"Author": "Dianne", "ReviewID": "RCNNG34QG81VE", "Overall": "1.0", "Content": "Cheaply constructed. Charger has already broken and it has not been six months since the purchase. First charger I ever seen break after trying to remove it from the device.", "Title": "Buyer beware", "Date": "June 6, 2014"}, {"Author": "carri smith", "ReviewID": "RU1M576YU8OQJ", "Overall": "2.0", "Content": "the tablet over heats and freezes. pic mode works great. but if i had a choice i wud return it and invest in another kindle fire.", "Title": "wish i cud return it", "Date": "April 27, 2014"}, {"Author": "Michaela", "ReviewID": "R1MILI2J6BRYGD", "Overall": "1.0", "Content": "This tablet worked fine and the internal system is still in good shape but the charging port will no longer accept charge.", "Title": "Broke after 1.5 months", "Date": "February 11, 2014"}, {"Author": "katie", "ReviewID": "R1OT3LO2JGDTL6", "Overall": "1.0", "Content": "The screen is difficult to see. The camera sucks and i barely can read what is on the screen. ugh", "Title": "dragon touch", "Date": "February 10, 2014"}, {"Author": "Dovie Sartino", "ReviewID": "R10P9QXPRRV60Z", "Overall": "4.0", "Content": "I would recomend this tablet to anyone. it is just the right size to put inmy purse . I'm very happy!!!", "Title": "like it alot but wish the camera took better pictures", "Date": "February 10, 2014"}, {"Author": "Michael", "ReviewID": "R3OM9G9C7HFL9G", "Overall": "1.0", "Content": "I got it and after a week the batery started to drain fast and it froze up a lot. After 3 weeks the battery won't hold a charge. Even if u give it a full charge as soon as the screen turnes off it won't turn back on. You can't download anything for it because it operating system does not support much of anything. Don't buy it's crap.", "Title": "Stops working and is out dated", "Date": "February 9, 2014"}, {"Author": "Sandra Greene", "ReviewID": "R49DA1E171B8E", "Overall": "3.0", "Content": "Cameras not real good. Battery life isn't long. Screen picture isn't so good. Return arrow in bad spot. Great for a small child.", "Title": "good tab for child", "Date": "February 8, 2014"}, {"Author": "Deborah J. Fenwick", "ReviewID": "R2T4CU5LAQDZV7", "Overall": "4.0", "Content": "needs written directions or a pamphet with it. Do like it but harder then I thought to navigate through this tablet.", "Title": "wish there written directions on this tablet.", "Date": "February 8, 2014"}, {"Author": "Nim Merchant", "ReviewID": "R1SXIDUAQHZY74", "Overall": "2.0", "Content": "The Dragon Touch tablet is slow and the sound is very poor,  you even can't hear from couple of feet.Nim Merchant", "Title": "Dragon Touch® 7'' Purple Dual Core Y88 512MB/4GB Google Android 4.1 Tablet", "Date": "February 7, 2014"}, {"Author": "Rebecca Morgan", "ReviewID": "R3IZ3ENA2SMJ48", "Overall": "1.0", "Content": "I originally purchased two of these as Christmas gifts. They arrived quickly and we charged them for a full 18 hours before first use.  One of them worked fine, but the other only had sound for about 5 minutes. Later that day, the one without sound began to crash to a white screen. The other one operated ok, but would lock up running only 1 app (Bad Piggies). I sent the soundless one in for return and bought another hoping it was an anomaly. The replacement worked for 1 week. It then began having a nervous breakdown, deciding randomly to shut down or refusing to power on. The remaining original tablet began having problems at this time, failing to charge or refusing to power on. I returned both tablets for a refund and will not be buying replacements.I don't expect a lot at this price point, but I do expect minimal functionality. The build quality on these units is very poor. The charging port is loose, the plastic molding has ridges and rough spots. The screen has inconsistent quality and very poor color rendering. The components should more than handle basic apps like Bad Piggies but because they basically threw them together nothing works well for long.", "Title": "3 bought, 3 returned not worth the time or trouble.", "Date": "February 7, 2014"}, {"Author": "Thomas Beeson", "ReviewID": "R3SBSP9IZCXUJV", "Overall": "1.0", "Content": "Purchased three tablets for grandchildren, out of the box one would not even turn on, the next two were out of service in about three weeks. The second stopped receiving wifii and the third, the screen went blank. AMAZON tried by getting one replaced but , the other two were broken by that time I got that one back, just gave up on getting anymore help with them. DON'T WASTE YOUR MONEY ON THESE TABLETS.", "Title": "Bad Investement", "Date": "February 7, 2014"}, {"Author": "Rebecca Thomas", "ReviewID": "RI9QQI9ZWG444", "Overall": "3.0", "Content": "The screen freezes up sometimes. Other wise. This is a good product for my grandson. He loves it. This product was great for the .price", "Title": "Good buy", "Date": "February 7, 2014"}, {"Author": "Gigi", "ReviewID": "RF19GEIVPUJLV", "Overall": "5.0", "Content": "Got this for my 4, 5 & 6 year old kids it works great for them also got it for my 18 year old brother they can go 3 hours straight before having to charge it is great for the price....also the color of the tablet is bright love that", "Title": "Dragon tablet", "Date": "January 17, 2014"}, {"Author": "Ernest James", "ReviewID": "R13VKCG5MCLMWL", "Overall": "5.0", "Content": "Good buy for Kids and Adults.  I would get the silicon slip cover, if buying for kids, product is fragile to say the least", "Title": "Awesome tablet for the Price!!!", "Date": "January 17, 2014"}, {"Author": "Alfonso", "ReviewID": "R1R7QFSQSL8A5P", "Overall": "3.0", "Content": "I bought it for my little girls it has been a great system. The have enjoyed it immensely. We are happy with it", "Title": "Good buy", "Date": "January 17, 2014"}, {"Author": "james", "ReviewID": "RC1S19OBSPK41", "Overall": "1.0", "Content": "Most apps i use wont work with this tablet. spend a few more and get a better tablet not what i expected", "Title": "disappointed", "Date": "January 17, 2014"}, {"Author": "Donald Suggs", "ReviewID": "R3FGPXYV1613VY", "Overall": "5.0", "Content": "Daughter ecstatic !!!! great picture quality and ease of use. she is pre-occupied with it for hours. she loves the purple color.", "Title": "gerat tablet", "Date": "January 16, 2014"}, {"Author": "Jason", "ReviewID": "R3MJVH74TAUT3U", "Overall": "4.0", "Content": "Overall these are some decent tablets. I bought 3 for my kids around Christmas time. The only problem I was concerned with was turning it on the first time. I saw where some had issues with it not turning on, after talking to a local tech in my area he said they sometimes can take a little longer than a few seconds to switch on the first time.SoI held the power down roughly 10 seconds or so and it fired right up. No issues and kids enjoy it for music and games.", "Title": "Good", "Date": "January 16, 2014"}, {"Author": "Jorge O. Espejo", "ReviewID": "R160ZTADQXWEUG", "Overall": "4.0", "Content": "The tablet comes preset with a certain storage allocation to operational memory and internal memory which limits what you can download depending on the demand of the specific App. The battery life is not very long, 2hrs - 2.5hrs maybe, and the unit seems to get hotter than normal when charging. Overall the tablet is not bad for the price, you just have to get a bit technical in reformatting it to your desired storage space allocation. It is a good startup choice in tablets when you have more than one child, ages ranging from 7 to 12 and you are trying to satisfy everyone with a tablet.", "Title": "Good Start up Tablet", "Date": "January 16, 2014"}, {"Author": "Jittuana Pfeifer", "ReviewID": "R13YJ8S9FH3P8Q", "Overall": "5.0", "Content": "Awesome,  just a little slow but great kids got them for Christmas and have played with them ever since then. Great price and look, I purchased 2.", "Title": "Great can't go wrong for your little one", "Date": "January 16, 2014"}, {"Author": "William l jones", "ReviewID": "R2UU2YG2O696AI", "Overall": "1.0", "Content": "didn't work most of the time. there were a few times that I couldn't get it to turn on for a few days. very unhappy with it.", "Title": "dragon touch", "Date": "January 15, 2014"}, {"Author": "Joseph Parsons", "ReviewID": "RVBAJCIDDSTH3", "Overall": "1.0", "Content": "the battery area get super hot after only 20 minutes of use. the tablet also keeps resetting it self back to the year 1970", "Title": "tablet safety", "Date": "January 15, 2014"}, {"Author": "louy pravong", "ReviewID": "R3BC8G7VCORZGP", "Overall": "1.0", "Content": "bought 3 for my kids. paid about 100 bucks each. within 2 weeks the power button broke on 2 of them. had to squeeze the surronding area for it to turn on. after the 3rd week, it wont even turn on. p.o.s product!", "Title": "not worth the money!!!", "Date": "January 8, 2014"}, {"Author": "Shanyka Jackson", "ReviewID": "R1WZTEH0P9LAS7", "Overall": "3.0", "Content": "Tablet quality/resolution is not the greatest. The power cord adapter does not fit all the way into the female portion of the tablet, leading one to believe that it is not charging when plugged up.", "Title": "Not 100% impressed", "Date": "January 8, 2014"}, {"Author": "Mommy", "ReviewID": "ROITYEYLZS13Y", "Overall": "4.0", "Content": "I bought this tablet for my 14 year old daughter and she looves it we love the color it is so pretty.  I was afraid it would look cheap but it is sleek. I took off one star bc the camera could be better. The android system is great!  So far so good!", "Title": "pretty price perfect!", "Date": "January 8, 2014"}, {"Author": "David DiCantio", "ReviewID": "RBE6ML7DRFPU6", "Overall": "4.0", "Content": "I gave this four stars because for the price it seems to be a very good unit. I bought two of them, one for each child, and they have been playing them A LOT since the holidays with no issues.", "Title": "Good for the price", "Date": "January 8, 2014"}, {"Author": "4x4chevy", "ReviewID": "R9OSYF0FX9AHP", "Overall": "3.0", "Content": "Its very nice as long as it turns on. Sometimes if it gets turned of or if it dies it won't start back up.", "Title": "as long as it turns on", "Date": "January 7, 2014"}, {"Author": "JennHay", "ReviewID": "R2DEOMXD5VFJ87", "Overall": "4.0", "Content": "This was a gift for my kids, they like them very much and the ability to choose a specific color for my Boy and Girl was the best. They are not very powerful pretty slow once you start downloading apps which is all my kids want to do so they have to wait for a bit to get the functions going but all in all a great purchase for the price.", "Title": "Nice starter tablet", "Date": "January 7, 2014"}, {"Author": "Missy K", "ReviewID": "RCW0GCCGYW9CT", "Overall": "5.0", "Content": "gave this as a christmas present to my daughter and she loves it! it runs fast, and it was her favorite color", "Title": "tablet", "Date": "January 7, 2014"}, {"Author": "kilaun thomas", "ReviewID": "RE6TFNSK1XC80", "Overall": "3.0", "Content": "It does what was expected. durable and love that i was able to choose his favorite color. he uses it to watch movies on the go but the volume on it is very low", "Title": "A Gift", "Date": "January 7, 2014"}, {"Author": "jamie johnson", "ReviewID": "R36WOB0R171LK3", "Overall": "1.0", "Content": "The tablet freezes all the time has to be reset and the plastic surrounding it always snaps off.  Honestly it's junk", "Title": "Not satisfied", "Date": "January 7, 2014"}, {"Author": "Ralph Conti", "ReviewID": "R2D1RSSRU04H7I", "Overall": "4.0", "Content": "Bought for my 8 year old and it works well enough for simple use.  Over all, a good buy for the price.", "Title": "Not bad", "Date": "January 7, 2014"}, {"Author": "Teresa Stucky", "ReviewID": "R9M9JJMWZ7RK2", "Overall": "3.0", "Content": "Bought this for my grandson. He was really excited but he was a little disappointed that he couldn't play games for a long period of time.  Wish we could buy a good quality product at a reasonable price,", "Title": "Dragon Touch Tablet", "Date": "December 8, 2013"}, {"Author": "Regina Horne", "ReviewID": "R3LWUGLOK3SNG5", "Overall": "1.0", "Content": "Dragon Touch 4.1 Tablet PCI purchase this tablet and once we received it, it did not and has not worked yet. First it would never power on after charging it for longer than 10 hours. I think I dislike it most because it was a Birthday present that I was not able to give.", "Title": "Dragon Touch 4.1 Tablet PC, Dual", "Date": "November 11, 2013"}, {"Author": "Johanna N.", "ReviewID": "R3KNN6SYBHCW6W", "Overall": "4.0", "Content": "Good Product for a very low price. I am very satisfied. Anyone on a tight budget can by this. Screen is crisp and clear. Dual cameras work really well.", "Title": "Good Product", "Date": "May 8, 2014"}, {"Author": "CA OZ", "ReviewID": "R3ECPDR8RIGZ1S", "Overall": "5.0", "Content": "my son loves it, he doesnt stop playing with it, and he likes all the games that he is able to download..", "Title": "very good for the money", "Date": "April 21, 2014"}, {"Author": "riveredgepaints", "ReviewID": "RSH23K0IMB7U1", "Overall": "5.0", "Content": "My grandson just loves it and it's easy for him to use and he knows how to download all the fun apps!", "Title": "Nice tablet", "Date": "April 3, 2014"}, {"Author": "maira", "ReviewID": "R2ICVYT66SJHY9", "Overall": "1.0", "Content": "TranslationI did not like very much because this signal is not very slow and takes a lot for cargase thank you very much but do not buy one with the mark", "Title": "Not happy", "Date": "April 3, 2014"}, {"Author": "Jantzen McNsac", "ReviewID": "R38YF3FBL2RPFL", "Overall": "1.0", "Content": "everything was great until it dropped 3 feet onto some carpet... and now its done for...ill look for something a little more sturdy next purchase.", "Title": "buy a protective cover as soon as you get it...", "Date": "March 30, 2014"}, {"Author": "Andria Bryant", "ReviewID": "R367WXAO2P3ZD6", "Overall": "1.0", "Content": "I was so disappointed with the items. It was delivered to me with cracked screens. I made several attempts to contact y'all but was very unsuccessful. I would really like to return these items", "Title": "I wished it function better for the sake of my kids", "Date": "March 29, 2014"}, {"Author": "logan collins", "ReviewID": "R1HKCZWJR4F27I", "Overall": "1.0", "Content": "It's broke on the second day and I don't know how to return it. I need a number to call", "Title": "it broke the first day I opened it", "Date": "March 15, 2014"}, {"Author": "Majel Dianne Darrah \"diaray\"", "ReviewID": "RYYAMMCGTMSAS", "Overall": "4.0", "Content": "This is a great little tablet, but it does not have the capability to do 4G wifi from my phone.Even though the description said that it is 4G , don't know why they say it when I called the ladysaid that it will not do 4G from a cell phone.  I guess that my search will still be on.", "Title": "Great tablet", "Date": "March 6, 2014"}], "ProductInfo": {"Price": "$99.99", "ProductID": "B00GV0KAK8", "Features": "The DT Y88 featuring the newest powerful and robust Dual Core CPU with DDR3 ram, makes everything run faster than ever. Plus, high-performance Quad Core Mali-400 GPU ensures smooth and dynamic 3D graphics.\nGoogle Android 4.1 (Jelly Bean) OS reveals tons of new adventures to your Dragon Touch tablet. Get access to thousands of useful apps and fun games to download and install on you tablet with Google Play Store pre-installed. Micro SD card slot allows you to add up to 32GB extra space to store songs, videos, photos and other files.\nComparing with A13 Q88 model, Y88 has higher resolution Multi-Touch HD Screen with 1024x600 which makes ebook, photo, video look great.\nWi-Fi (802.11a/b/g/n) keeps you connected on the go. Front-facing camera makes it easy to chat with friends and family, while rear-facing camera allows you to capture the special moments and upload them to facebook and twitter.\nLive customer service and tech support from TabletExpress. Robust warranty, on-time customer service/tech support, frequently updated firmware guarantees customer satisfactory. Feel free to contact us whenever a question pops up in your head, we are always here to help.", "ImgURL": "http://ecx.images-amazon.com/images/I/51h3un6jSdL._SY300_.jpg", "Name": "Dragon Touch® 7'' Green Dual Core Y88 Google Android 4.1 Tablet PC, Dual Camera, HD 1024x600, Google Play Pre-load, HDMI [By TabletExpress]"}}