{"Reviews": [{"Title": "Easy to use", "Author": "EB", "ReviewID": "R2GNBRM7KIG5GS", "Overall": "5.0", "Content": "This was a Christmas gift for my Mother and she loves it and not experienced any problems. Downloads pretty fast. The color is bright very nice.", "Date": "January 13, 2014"}, {"Title": "This table was just what I was looking for without spending a ton of money.", "Author": "B. D. in N.C. \":   )\"", "ReviewID": "R1M14RKQN48L87", "Overall": "3.0", "Content": "I wanted a small tablet but didn't want to spend a fortune on it, so this one was just fine. It is small enough I can slip it in my purse and use the Kindle app to read on the bus or plane. I can read and return emails quickly and easily, surf the web, chat with friends, or play a game if I'm bored.If you are looking for a small 7 inch tablet; compare prices and what each has to offer in the way of memory and features. I'm just fine with my purchase and glad it didn't cost hundreds of dollars. I could have paid more for a tablet but really did not feel the need to. The seller packaged it well and it's held up just fine. I liked the fact that I could add a micro SD disk in the back of the tablet and view all my photos I had stored on it in just a minute.", "Date": "April 11, 2014"}, {"Title": "Tablet", "Author": "brian jones", "ReviewID": "R32NZV5EHB8NN3", "Overall": "4.0", "Content": "Got the Tablet in good time... shipping was fast . (Trinidad and Tobago) great features on tablet...dual core 1gb ram, 4gb internal memory ..bought for my 10 yr. old son who screwed up his other tablet (a Lindsay ? charging port problems with that one) overall a good tablet.Cons though..  charger doesn t hold in it s port..... well it doesn t lock in place so it falls out if moved while charging ?? also the button to the side (not the power) feels like a loose tooth... over all performance though.. 4 ... would buy again.", "Date": "April 10, 2014"}, {"Title": "Was really surpised!", "Author": "FairyFire", "ReviewID": "RF7DIYCNIZY5H", "Overall": "5.0", "Content": "I ordered a different generic tablet at Christmas time and was really disappointed with it (if you read my other reviews it is not the polaroid one, it actually replaced the one I was disappointed with). So when I found I wanted to treat my other two kids to tablets I was not sure about ordering these. These were such a surprise. Let me say first that these tablets are being used by young teens/preteens and are mostly used for reading, listening to music, checking in with Facebook, playing games like fruit ninja, and occasionally watching a video. So what most children would use it for.First I was very surprised at how sturdy these tablets felt. They feel well built and have a little weight to them but not to heavy to use. It makes it feel like they won't fall apart.Second, the screens are crisp and clear. The colors are great and I don't see a lot of lines like I did in the one I bought at Christmas from Light In The Box (unfortunately not on amazon).They also came with 16 gig memory cards so the cost  ended up being about the same as the other one. There has not been any problems with the tablets so far, my kids have had them just about two weeks now. I was also able to go to the store and find cases that fit them so they at least have some protection.Over all I am very please with these tablets, I would definitely recommend them to a friend for their kids or even adults who don't want to do more than read, check email and play games.", "Date": "March 7, 2014"}, {"Title": "Pretty Good Buy", "Author": "D. Henry", "ReviewID": "RFRQWM5IWLO2D", "Overall": "4.0", "Content": "This is my first Tablet. I gave it 4 stars because their MANUAL Translated to English SUCKS! and they do not make screen protectors for it. Overall Im happy with it as for use as a portable take anywhere PC Tablet to check email, read the news online and so forth. I found out real quick non of the apps I could download nor the included apps will play MP3 music files. I would think that should be standard fare! HOWEVER - I am not sure I can blame this on the Tablet but more the APPS not being able to play the MP3s. I played a few AVI movies on it and no problems using the included movie player. Again I am new to the world of Tablets and dont even own an iPhone so being a newb I eventually found my way around the Tablet with the help of friends. AGPtek really needs to hire Professionals To Do The Translations on their Product Manuals. Still - I would recommend this tablet, but if your new to this stuff like myself, be prepared for about a week or two of learning curve.", "Date": "March 6, 2014"}], "ProductInfo": {"Price": "$99.99", "Features": "Google Android 4.2 OS,Simple and fashion design for high quality life\n5 point capacitive touch screen for easy operation\n7 inch TFT display for beautiful pictures\nBuild-in Dual-core GPU SGX540 (2D/3D graphic processor unit),support 3D game perfectly\n1GB DDR3 RAM,microSD expansion up to 32GB", "Name": "AGPtek® 7\" Dual Core Google Android 4.2 Tablet PC, HD 1024x600, Google Play Pre-load, HDMI,1GB DDR3,Wifi,Skype Video Calling, Netflix, 3D Game Supported With 16 GB TF Memory Card", "ImgURL": "http://ecx.images-amazon.com/images/I/511G6pbrweL._SY300_.jpg", "ProductID": "B00GX6F78K"}}