{"Reviews": [{"Title": "Great buy and thanks mom!", "Author": "Niya", "ReviewID": "R3K4S5TVYARGGJ", "Overall": "5.0", "Content": "My mom just brought me one and i love it. I've been on it since I got it on Thanksgiving day!! I love the screen and the webcam helps me tango with my friends, also it is easy to get online and set up!! Good buy and I also have a kindle fire which I love!!", "Date": "December 2, 2013"}, {"Title": "My daughter and I love our new RCA tablet and the webcam", "Author": "s.brown", "ReviewID": "RQ4KYBHNLVD4T", "Overall": "4.0", "Content": "Unlike the previous review, I really like the tablet! The google play store is wonderful and the screen/webcam works well. Downloaded many of my fave games like candy crush, pet sage, ruzzle, nfl live, etc... and they all work fine. You must set it right just like any other tablet in order for it to work well!!", "Date": "December 2, 2013"}, {"Title": "Keeps my son from taking my kindle", "Author": "Cj", "ReviewID": "RYPHJRWI9A28K", "Overall": "5.0", "Content": "My 8 year old son kept using my kindle so much that we needed something for him just so I could have mine back.  This was $50 for Walmart's Black Friday sale and seemed like the perfect solution.  He got it for Christmas (having to wait a whole month to get my kindle back was TORTURE) so we've been using it for a little over a month now.This works great for him.  He only uses it for games, though.  We downloaded the Amazon app onto it and can do most of the things that we could do on the kindle.  Plants vs. Zombies doesn't work on it, though (a major disappointment for him), but Temple Run, Angry Birds, and Minecraft (hallelujah!) work.  Those are the major ones he likes.  I see that it's possible to download kindle books on there, too, but he prefers paper books for now.  I don't see any way to download Amazon music or movies on it.We had a 9 year old boy with ADHD and MR recently move in with us and he has this same tablet, too.  He said he got it for Christmas.  He also only uses it for games.I saw a few reviews saying these things break easily and so I just thought I'd mention that it is possible to get some good ones, too.  These tablets take the abuse of 2 very active boys but we haven't had any of the problems mentioned (yet).  The reason I came looking for this item on Amazon was because I REALLY love that it has the SD slot.  I love that it works more like a computer than the kindle- you can download things off the internet and not just from the Amazon site (and be able to easily access it without having to connect it to a computer to find it) like the kindle.  - I thought maybe I could pawn my kindle off on my husband and I could get one of these babies for myself.  But then I'd have to sacrifice my Amazon movies.  I'm not sure how willing I am to do that.For our purposes as a kid's toy, it's perfect.  We can go to appointments in peace and quiet- and no running off, haircuts are less squirmy- and less whining, it's a nice incentive for finishing homework & chores, plus- the best part- I can still use my own kindle.", "Date": "January 29, 2014"}, {"Title": "Love my RCA Tablet!", "Author": "Daniel E. Ouellette \"Dan Ouellette\"", "ReviewID": "RLPHODUNKT4LC", "Overall": "5.0", "Content": "It does more than I planned on when I purchased it.  What I really wanted to use it for was a remote control for my Google Chromecast, but then I found out I could use it to stream movies to my TV through my wireless home network using Netflix, Hulu Plus, watch my downloaded movies through Plex and a whole lot more.  I never have to watch another commercial again, and I can watch my shows on my schedule!This thing turned out to be more than just a TV remote control!!!", "Date": "April 18, 2014"}, {"Title": "very good for the price", "Author": "Marcela", "ReviewID": "R2SX3GD27D71S9", "Overall": "4.0", "Content": "very good for the price lcd screen isnt very good but you cant expect Ipad quality for $70. loads really fast", "Date": "December 25, 2013"}, {"Title": "Beginner tablet - low quality", "Author": "QW", "ReviewID": "R1BKQPP7HBYPHC", "Overall": "2.0", "Content": "You get what you pay for.  I bought two for my kids (7 and 3) and am thankful it was at the Walmart Black Friday price.  My 3 year old doesn't use her tablet much (as expected)...only for watching movies on the go.  My 7 year old used (yes USED) his tablet more often.  Somewhere between Christmas and early March, the keypad stopped responding to touch.  At first it was just certain letters, then the entire keyboard and screen icons (he couldn't type his name, a password, click on an icon, play games, or anything).  By end of March, it took heavy duty muscle strength just to get it to unlock.  No matter how we swiped the lock icon, it took a lot of pressure over several minutes for it to respond.He doesn't have a lot of games downloaded and there is plenty of space and memory on it. I work in IT and take shifts on a help desk, so I try to be very understanding when I've called them (three times now).  After 20-min holds for each call, they've only wanted to do factory resets and reboots.  They don't try to listen to the problem and one guy just said \"listen to my instructions\" when I tried to tell him we've already tried that (they don't keep a good history of the calls so it's explaining it new each time).  Finally, on the third call we got a real ticket number but we had to pay for shipping back to them for the diagnosis and repair.  So any savings we had are lost to the shipping.So if you don't plan on using it, it works.", "Date": "April 7, 2014"}, {"Title": "great", "Author": "paula", "ReviewID": "R25651LSV0S7NS", "Overall": "5.0", "Content": "Tablet is awesome like a laptop it'll do just as good as kindle HD matter fact it has more features than kindle I love it", "Date": "April 30, 2014"}, {"Title": "Christmas gifts for kids", "Author": "H. S.", "ReviewID": "R3U5Z3KCDBRIO3", "Overall": "4.0", "Content": "We were given two of these tablets for our sons (ages almost-5 and 3) for Christmas, and they work well. I downloaded the \"Kids Place\" app (free) from Google Play along with the \"Kids Place Screen Time\" add-on (also free) to limit their access to the apps I want them to have and the time I want them to have. I locked the system down so that they can only play for an hour a day, and if they shut the tablet off, it will reboot to the app. This basically creates a new desktop that only has a handful of apps, blocks them from the internet (a setting you can choose) and lets them have fun without me worrying about having to pay for unexpected in-app purchases. :)The tablet screen quality is mediocre, and appears grainy to those who're used to a Kindle Fire HD, but the quality is fine for kids who're just going to cover the screen in fingerprints anyway. For $50 (Walmart's Black Friday price), not bad. Walmart still had some of these available for $69, so I bought another for our daughter who's really too young to have one but wants to play some kid apps too. These will come in handy for our long trips. :)The kids love THEIR tablets and *I* love not having to share mine with them. :)", "Date": "January 3, 2014"}, {"Title": "Run Away", "Author": "Jasmine Wiederrick", "ReviewID": "R2MQRWFN4TH9E8", "Overall": "2.0", "Content": "It's a tablet... but can you say SLLLOOOOWWWW. Hope you don't like streaming because even when you're on great Wi-Fi, CONSTANT buffering.", "Date": "May 23, 2014"}, {"Title": "love it", "Author": "Rick Odle", "ReviewID": "RBVOJT4XVHSC8", "Overall": "5.0", "Content": "Product was delivered in good condition works great until i dropprd it and the screen broke .now i have 2 wirh same issue but otherwise was a good pick", "Date": "April 18, 2014"}], "ProductInfo": {"Price": "$99.99", "Features": "4.2 Jelly Bean\ndual core processor\n8gb storage\nwifi certified\nfront facing web came", "Name": "RCA RCT6378W2 7-Inch Tablet (Dual core processor, 8GB in-built memory, Android 4.2 Jelly Bean)", "ImgURL": "http://ecx.images-amazon.com/images/I/51YbkwSIUAL._SY300_.jpg", "ProductID": "B00GZFFZKY"}}