{"Reviews": [{"Author": "Londonnoise \"Robby\"", "ReviewID": "R2HXW1596QTAJL", "Overall": "4.0", "Content": "There are 1001 iPad reviews of varying detail out there and you don't need me to slog you through every little feature. Figuring what you want to know is, \"Is it worth the upgrade?\"Well yes and no.If you are already using an iPad with a retina display (and the display IS pant-wettingly gorgeous), you're going to get a sleeker, lighter, faster version of the same thing. Sure, the camera is a bit improved, but don't you think that people look odd trying to take photos on an iPad? For me, that's not what this is designed for.The first thing you'll notice when you pick it up is how sleek and light it is compared to previous models. It really is a beautifully designed and built tablet. It' also noticeably (but not hugely with the apps I tested) faster. iOS 7 looks fab on the thing.Still, the bottom line is, if you are running a pre-retina iPad and you got the cash, yes, it's worth it (and I use 'worth' as a loose term here, they are bloody expensive). If you are running a newer iPad, sure, this is sleeker and shinier, but I'm afraid it's not going to change your life.To conclude, this thing is beautiful, extremely useful in my life, and I love it like the child I never had :-) Just don't expect it to change your whole life!", "Title": "Simple Review", "Date": "November 9, 2013"}, {"Author": "EvansDJ82", "ReviewID": "R3D3OD7YY7Q22E", "Overall": "5.0", "Content": "Purchased this at a recently run promo at the local Best Buy ($150 in gift cards that I received for the purchase was promptly used to offset it's higher cost).It is a 5-star tablet in everyway.  I'm fully invested in Amazon media and am glad that Amazon saw fit to put all it's services onto the iPad Air via apps so that I can access it seamlessly.  I have both the HDX 8.9 and the Air even though the HDX 8.9 has a better screen, I prefer reading books and magazines on the iPad Air because of the 4:3 aspect ratio.  I also am happy that I got it because it is apparently the only tablet that works on my company's internal network.The HDX 8.9 is better for video watching, particularly if you're watching without headphones.  The speakers on it are amazing.  However, the speakers on the Air aren't bad, they're  just too close together to practically be stereo.That said, both the HDX 8.9 and the Air are 5-star tablets.  They have different strengths and do different things well.  The HDX 8.9 is now my son's and the iPad Air is mine (because of it's work functionality).You really can't go wrong with either tablet.", "Title": "iPad Air was a great buy!  You won't regret it!", "Date": "December 11, 2013"}, {"Author": "J. M. Kahn \"Gizmo Lover\"", "ReviewID": "R3QIG90IQFIVZV", "Overall": "5.0", "Content": "I had first purchased the iPad when it first came out, wasn't impressed and returned it.  Bought the 2nd version, loved it and have had it ever since.  When they came out with the 3rd version I wasn't impressed with the changes so I kept my iPad 2.  Ditto when they came out with the next version.  But I saw the iPad Air in person and had a chance to try it for myself.  I loved the new camera (much more defined pictures) and the screen definition (it's now hi-def).  Beautiful sharp, clear colors.  So I upgraded and bought it (I bought the white one though.)  I was fortunate that the place I bought the iPad Air from accepted my iPad 2 as a trade in so I got it for approximately $200 less (my iPad was in immaculate condition and I still had the box, paperwork and the accessories.)  I do love this iPad.  It's fast, fast, fast and my games are beautiful.  I have both Microsoft and Apple products (although no Apple computers, they're too expensive.)  Both have their merits, but I have to say one thing for the Apple products, upgrading to new devices and transferring all your programs, particularly games, is so much easier.  On Microsoft products, with Windows, you have to reinstall all of your games and programs, and with the games pray that the new operating system will let you play your old games.  In most cases it won't and you have to go through a bunch of iterations to play them (and I say this while typing on an HP Laptop which I use daily and would rather DIE than go without it!)  I don't know why Microsoft, (maybe it's the game developers) won't let you back up your games or the programs like Excel, Word, etc (even though you've already paid for them.)  But with Apple you just attach it to your computer  and sync it (hopefully you backed up your iPad, or whatever, to it) and voila, all your previous games, music, programs are on the Apple product ready to use just where you left off (most of the time anyway.  On a few of the games I had to start from the beginning, but I think that's because of the developer, not the iPad because some of them I did start where I left off.)  Also, set up for programs such as mail is minimal (just put in your user name and password and you're ready to go.)  I wish Microsoft would come out with something like that so I could purchase a new computer without the fear of not being able to play my favorite games.  Anyway, bottom line I LOVE my new iPad Air.  I even found a case that allows me to swivel the stand to either landscape or portrait positions so that I can read the newspaper or books on it and eat at the same time without having to try and prop it up on something (bought the case on Amazon.com, it's a Targus Versavu).", "Title": "iPad lover", "Date": "November 27, 2013"}, {"Author": "Xachary Dinsmore", "ReviewID": "RSJSN0GPTVMU4", "Overall": "5.0", "Content": "I have historically been an Android person, However, this time I decided to give Apple a whirl. In comparison to an Android device it is far less customizable. You don't get to install different keyboards, or load widgets onto 8 different home screens, or install a completely different launcher all together, but this doesn't mean it's all bad. The user interface is very simplistic, but that actually works fairly well on a screen this size. The only thing that really sucks about it is that you can't hide the infrequently used apps quietly off to the side in the app screen like you can with Android. You are staring at all the apps at once from the home screen mo matter what. Even all neatly organized in folders it can still be a little hard to find what you are looking for. This coupled with the lack of information on the home screen(such as you get from a widget) would make me really dislike this on a small phone screen. It does work fairly well with the 10\" screen though, and the multi touch gestures make switching between apps and multi tasking a breeze.  This thing is extremely fast as well, you really can't slow it down. 10 browser tabs open, streaming music, playing a game, and checking your email, all while jumping back and forth between them is completely seamless. It literally feels like you can't feed it input fast enough to make it even stumble a little.  The battery life is also excellent. You will be hard pressed to kill it in a day. You would have to be gaming on it for hours to accomplish a dead battery I would think. I think the battery life is the perfect balance, to increase it any would in my opinion probably mean a sacrifice to either performance or weight and size. I typically get about 2 days of moderate use out of it.  For those of you on the edge between this and an Android device(or the constantly improving world of Windows mobile), the App Store selection is about the same. For the types of apps I use there seems to be very little difference, the are both excellent for social media, media consumption, email, and browsing the web. I do somewhat prefer the BaconReader reddit client app for android over what I have found here, but that is a very minor complaint. There are a few apps that are paid on iOS that you can get for free on Android, but at the same time there are more tablet specific apps on iOS, so I think it's a fair trade off.As far as day to day use goes it has been impeccable and I would recommend it to anyone. It has been reliable, fast, and had great battery life, any complaints are minor and subjective. In case Amazon rolls my review in with all the iPad Air models, which they probably will, I have the 32GB white version. I would also recommend avoiding the 16GB, after everything is all updated and the included free apps installed, you will only have a couple GB left for apps and media.", "Title": "Great, even for an Android fan.", "Date": "March 20, 2014"}, {"Author": "T. Marble \"Movie fan\"", "ReviewID": "R3LCL3HZ6ENZHM", "Overall": "5.0", "Content": "I've had several tablets... Sony Tablet S, nexus 7, ipad mini, and now the ipad air... This is definitely my favorite.  The screen is big enough to allow for relaxing reading, but it's thin and light enough to carry around without it being a chore. Battery life is amazing. I easily get 10 to 15 hours on a single charge with normal use. Build quality is superb. I have an apple ecosystem at home, so it fits perfectly. My Mac mini, iPhone,apple TV, all seamlessly communicate. This works so well, I've decided to no rush into buying a MacBook Air.", "Title": "Best tablet for normal people.", "Date": "December 8, 2013"}, {"Author": "Michael Sullivan", "ReviewID": "R13FGE9ZVT4R5L", "Overall": "5.0", "Content": "The iPad Air is, without exception, the best piece of technology that I have owned, and I have owned nice tablets and computers before.  One of the first things that jumps out about this device, beyond the gorgeous display and excellent speed, is the long lasting battery life.  I have owned this tablet since the day it came out, and I am still averaging about 10 hours of battery life on it.  That is a good thing, too, because if one gets this tablet, they will be using it a lot.  That is, by and large, due to the tremendous versatility that the iPad Air provides it users with.  I have effectively utilized this tablet at both work and in my graduate courses, and by my judgement, my performance has seen a boost by consequence of that.With that in mind, it must be acknowledged that the iPad Air, or more generally, apple products are more expensive.  Critics of the iPad often point to that very fact, but a \"premium\" price boost to a top of the line product is not unique to the iPad - the nicest things are also invariably the most expensive things.  Because this tablet is so well made, there will typically be very little to no frustration associated with it.  It gets the job done across the board, be it for personal or professional use.  It is for that reason that the iPad Air is worth the extra $100-300. As a graduate student, I cringed at my bank account after I purchased this, but at this point, I'm honestly relieved that I got the iPad.  $600 may seem like a lot at first, but by the time a month has gone by, and one realizes how much they actually use this thing, that $600 will start to seem like a small price to pay.  Once a former galaxy tablet loyalist - now firmly in the iPads corner.  Truly, this is such a well made device - it really doesn't get better than the iPad Air right now, and it probably won't until the next IPAs either.", "Title": "A Transcendent Tablet - Apple Delivers This Time", "Date": "November 29, 2013"}, {"Author": "Voenix Rising", "ReviewID": "R11YB5ZRVSQ3BX", "Overall": "3.0", "Content": "While technically ALL iPad Airs are \"unlocked,\" and can be used on most any carrier, I was extremely dismayed to learn that the Air I received from TechGiant arrived with an IMEI (a hardware identity number unique to every device) that was locked to AT&T.; Because of that lock, it's not just a simple matter of swapping out the SIM card to get it on the carrier of your choice. In my case, Verizon had to scan the IMEI of one of their own devices in order to activate one of their own SIMs to use in this Air so that it could be added to my existing account and used on their network. Yes, in the end it worked, but it was a huge hassle and if I'd known beforehand that the device would arrive this way I would not have purchased it from this seller, instead going directly to Apple or Verizon.", "Title": "Buyer Beware", "Date": "December 26, 2013"}, {"Author": "Danamite", "ReviewID": "R34DQA57YUOFR", "Overall": "5.0", "Content": "I managed to avoid 5 generations of ipad purchases (including the 1st generation mini) but this one finally got me. My eye doctor told me if I didn't stop being ridiculous and using my itouch as an ereader (I know, I know but it was so portable!) I could kiss my 20-20 vision goodbye. Basically Apple can thank my optometrist. That being said this thing is gorgeous. It takes beautiful photos and video, the screen is crisp and clear. While I don't run around in public taking photos and video with it I'm happy it has the capability. It's great for watching movies on the go and I've been very happy with the battery life.So why should you buy this one? It's a reasonable size without sacrificing screen size or quality. I think the ipad mini is cute but I have friends who practically have smartphones with a screen that size. It wasn't worth the price for me. We have other ipad products in my family, I've never been motivated enough to go out and buy my own but this one is a good size. It fits in a normal size bag or purse and makes me feel like I'm carrying around a pad of paper rather than a small laptop.I've had several people ask me why I bought a ipad instead of a kindle fire or the like. As I said, we have a lot of iproducts at my house and I'm very happy with itunes. This way I can easily swap movies, tv shows, ebooks, various apps I need on a daily basis around and basically this has turned into a backup laptop for me. The functionality was absolutely worth it to me.I guess if I were to say anything negative it would be 1) I'm never going to live down finally having bought one after saying I wouldn't for so many years and 2) my iphone and itouch now seem incredibly small. I'm hoping the iphone 6 releases soon and has a bigger screen. First world problems to be sure but there you have it.", "Title": "Well Apple you finally got me", "Date": "November 15, 2013"}, {"Author": "J. Nguyen", "ReviewID": "R14KF5GAH6YAJJ", "Overall": "5.0", "Content": "Bought six of them after using one to give to my nieces and nephews. The best iPad to date. We stop using laptops now.", "Title": "Love it", "Date": "December 15, 2013"}, {"Author": "P. Sweeney", "ReviewID": "R3171COVKXJDXS", "Overall": "5.0", "Content": "I am very happy with this new version of iPad Air.  It is not too heavy to use in the living room.  The graphic or picture quality is excellent!", "Title": "Much better than older iPad", "Date": "April 15, 2014"}, {"Author": "Yohan Chang", "ReviewID": "R1KJQPP1GLPHWJ", "Overall": "5.0", "Content": "I used to use iPad 2 (no retina display) for a long time.However, I moved to Galaxy Note 10.1 for writing in my class.(I had two notes 2013, 2014)Obviously, iPad writing function can not overcome Galaxy Note's; since they has Wacom sensor.I used Galaxy Note 10.1 2013 for a year. Exactly a year later, the machine had been broken.So, I had to decide between iPad Air and Galaxy Note 10.1 2014.....Because of my class, I had to but Samsung product again.However, as you guys already well know, there are not many apps on Adroid. Still iTunes has a huge of app store.iPad air is very light and clear.If you are student, I strongly recommend iPad air instead of Galaxy Note 10.1. Of course if your considering is not writing only.There are many apps even school such as library.", "Title": "I got this one very quickly and I'm very satisfying the product", "Date": "April 14, 2014"}, {"Author": "raymond dingler", "ReviewID": "R3CKFVGT1KHJZ3", "Overall": "5.0", "Content": "I bought it for my wife & she loves it.It came faster than she expected it.She gives it an A+ .", "Title": "ipad", "Date": "April 14, 2014"}, {"Author": "mikeyyyownz", "ReviewID": "R29YQ94YM16KPM", "Overall": "5.0", "Content": "I bought this for my wife for Christmas. We have Verizon and I wanted an Ipad for her that was 4g, as well as to upgrade her from the  Ipad 2 she already had. The price was more than going through Verizon, but I needed it quick for Christmas, and I had Amazon gift cards so it came out cheaper for me in my situation.Anyways, I'm not going to go into detail about the Ipad Air. There are countless reviews online. I'm just writing this in case anyone is hesitant to purchase from this specific seller. I got the item quickly and didn't have any problems. The wife was able to connect it to our Verizon account and she uses it all the time.", "Title": "Just what it's supposed to be", "Date": "January 19, 2014"}, {"Author": "Foothill Ranch 14", "ReviewID": "R14KHENAP2N3UU", "Overall": "4.0", "Content": "Good product but not as mobile as I thought. I prefer my kindle to read but this to watch prime or Netflix on. Sometimes I feel like I have to use it to get my money's worth. But it's good for my family and I.", "Title": "Good product.", "Date": "January 18, 2014"}, {"Author": "John R. Sitzman", "ReviewID": "R3GFOB7XNDFQQ1", "Overall": "5.0", "Content": "Actually light as air and very functional. The first Apple product I have owned but I will definitely buy more in the future.", "Title": "A great product", "Date": "January 18, 2014"}, {"Author": "fabian", "ReviewID": "R1POO9PM2B6MFH", "Overall": "5.0", "Content": "I had the samsung galaxy player and now I have just bought this product and I'm totally in love of this, it's fast, beautiful, elegant, lighty, if u can buy it!!!", "Title": "Excellent!", "Date": "May 31, 2014"}, {"Author": "Dean L.", "ReviewID": "RSRUFSVUOOSIA", "Overall": "5.0", "Content": "Easy to use as is most Apple products.  Screen looks like my Apple desktop.  Sometimes a little hard to listen to radio broadcasts.", "Title": "Great technology", "Date": "May 30, 2014"}, {"Author": "David \"David\"", "ReviewID": "RI1EW93KEAPD", "Overall": "5.0", "Content": "I wanted a ipad for years and finally bought one. I wish I would have got one sooner. I have been having a blast using it in work and play.", "Title": "I love my Ipad", "Date": "May 30, 2014"}, {"Author": "BigDInTexas", "ReviewID": "RMI5I4XT13GXH", "Overall": "5.0", "Content": "Bought this iPad Air for my wife for her birthday.  Replaced her 1st generation iPad.  The new iPad is fast, has a beautiful display, is very responsive, and oh yeah, did I mention it's FAST!!!  I could not have made a better purchase.  Oh BTW, we still use the 1st generation iPad as well.  Still alive and kicking.  Let's hope Apple supports the new iPad for a few more years.  Highly recommended.", "Title": "Apple rules!!", "Date": "May 29, 2014"}, {"Author": "JUNGAO", "ReviewID": "R320AE6M64IE0X", "Overall": "5.0", "Content": "This is the first ipad I have ever brought. It is very fast and light. I like it very much.", "Title": "It is easy to use.", "Date": "May 29, 2014"}, {"Author": "Jimmy", "ReviewID": "R1MS58LGUDLPHC", "Overall": "5.0", "Content": "There are thousands of reviews on this product and why arguably the best tablet on the market in 2014, so I'll keep my review to some of the less obvious points I noticed.First, I found the length of the lightning cable a little short, so I can't really move it freely around my desk or on my bed if an outlet is more like two feet away. The total length of the lightning cable is approximately 3.25 feet. Being used to longer cables, I've accidentally yanked this thing a few times but that hasn't done anything to my iPad Air... yet. However, you can probably purchase a longer lightning cable online.Also, I found the rate that the iPad downloads apps is about 5x slower than even an iPhone 4. Apple support told me this is usually because newer devices have a lot more to do like connecting to iCloud for the first time, etc, but I don't buy it. I think it's just because iPad apps are a lot larger than iPhone so I don't expect this to change, but I'll update if it gets any faster. UPDATE: Yes, my iPad does download at fast speeds now after one day, so don't worry if you encounter the same issue at first!While these two points are on the negative side, keep in mind that my overall experience is easily still 5 stars. I would definitely recommend this if you are in the market for a tablet.", "Title": "Premium Product", "Date": "May 29, 2014"}, {"Author": "Brown", "ReviewID": "R2RONGLY7GAXM6", "Overall": "3.0", "Content": "It looks just as pictured. But for some reason the screen shuts off without warning or reason. I will have to trek to the Apple Store find out why this happens.(I was trying to avoid the hustle and bustle of going in the Apple Store that's I made the online purchase in the first place. )", "Title": "Hoping for happier Days.", "Date": "May 28, 2014"}, {"Author": "Peggy W. Yarnall", "ReviewID": "R2CVLOK71CSBAO", "Overall": "5.0", "Content": "I love this ipad air.  It is lightweight and user friendly.  It is everything I expected and more.  I would highly recommend it.", "Title": "Love it!", "Date": "May 27, 2014"}, {"Author": "T. E. Harris-Moyer \"mstiff\"", "ReviewID": "R1ASO9EN2ESR7T", "Overall": "5.0", "Content": "Love love love this IPad. So much I bought one for my husband. Great picture and so easy to use.", "Title": "2nd one", "Date": "May 27, 2014"}, {"Author": "Carll  K  Rich", "ReviewID": "R1KN8CQPXKYXAK", "Overall": "4.0", "Content": "I would never have believed it as I have always been a PC man for many years.  Had them all since my TRS-80 to include Gateway, Toshiba and several Dell's. Frustrated by Windows 8 I finally jumped ship to Apple and could not be more pleased.  Great machine, no complaints.", "Title": "Traded in my Dell", "Date": "May 21, 2014"}, {"Author": "Saikat", "ReviewID": "R2UEXJGUOIAWA5", "Overall": "5.0", "Content": "This is the ultimate Tablet...very simple to use. Sleek interface. It is like having a computer on the go without the bulk!", "Title": "The best Tablet out there", "Date": "May 21, 2014"}, {"Author": "Wayne Stewart", "ReviewID": "R3O2SMBDZAYRI", "Overall": "5.0", "Content": "I finally gave in and bought the iPad. Android lover in the past but I am afraid that is no more. The lack of control and expandability I can deal with since we are all going cloud anyway. Great device with awesome graphics.", "Title": "android lover no more", "Date": "May 21, 2014"}, {"Author": "Agnieszka", "ReviewID": "R1S0GSEL64UAAN", "Overall": "5.0", "Content": "I am just loving my new ipad! It was a great purchase! and I would definitely recommend it to everyone!", "Title": "Love it!", "Date": "May 20, 2014"}, {"Author": "Robert Dunn", "ReviewID": "R27G0OE8HG1XZU", "Overall": "5.0", "Content": "This is a very good product - very versatile and an excellent buy.I will purchase another in the near future", "Title": "Great Product", "Date": "May 20, 2014"}, {"Author": "K. Long \"Datgrl\"", "ReviewID": "RJPEVTB8XN6EL", "Overall": "4.0", "Content": "I got this with the intent of having something I could take to the hospital to stay in touch and keep occupied.  I've downloaded a few games (Horn, Hearthstone) and I'm really enjoying the graphics quality.  I only wish that Apple offered an ap to manage multiple user accounts.", "Title": "Love my iPad", "Date": "May 13, 2014"}, {"Author": "Fernandez Anibal \"Anfer\"", "ReviewID": "R4ERLTPMNQ2X9", "Overall": "5.0", "Content": "Excelent tablet is the best without a doubt. Only Apple can achieve something like.El mejor equipo en su tipo", "Title": "Excelent", "Date": "May 12, 2014"}, {"Author": "Mauricio Mejia", "ReviewID": "R3D5GRHBBNZ8TB", "Overall": "5.0", "Content": "First time I commit to buying a tablet. I am very happy with it. Haven't found anything I do not like, other than using itunes for everything.  But I already saw that coming. It even reads to me sounds sexy too hahaha", "Title": "LOVE IT!", "Date": "May 12, 2014"}, {"Author": "Helen", "ReviewID": "R1V4VQ1TYI90XO", "Overall": "5.0", "Content": "I ordered this item for a college graduation gift and the service was excellent and I received my item exactly when they said I would.  This was important since it was a little more expensive and I didn't want it just sitting on my front porch!  I always go to Amazon first when I need something since I usually find a better price and the whole process is just hassle free!  Keep up the good work!", "Title": "Good job once again!", "Date": "May 12, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3J096XRF8EK8J", "Overall": "5.0", "Content": "I'm loving my iPad Air...every single feature of it is beautiful, extremely fast, easy to use, beautiful case, Internet connectivity is lightning fast, this is my first iPad and I'm glad I got the most recent version. There is nothing I don't love about it.", "Title": "Love it, love it, love it", "Date": "May 11, 2014"}, {"Author": "nandeesh", "ReviewID": "R3CWEUEKKTX3RA", "Overall": "5.0", "Content": "It's Apple Product ! The brand speaks for itself !It's the latest version.Excellent resolution.Very durable. Reliable.Goes well with devices ear.", "Title": "I love it !", "Date": "May 11, 2014"}, {"Author": "Ruben Ruiz Velasquez", "ReviewID": "R12PR383GH6D40", "Overall": "5.0", "Content": "I was expecting a Ipad as light as the air and I found it. It's really fast, and the battery last for a long time. Love apple products", "Title": "Finally i got my ipad", "Date": "May 11, 2014"}, {"Author": "Debbie Elm", "ReviewID": "R13P3A8O2UXRMC", "Overall": "5.0", "Content": "This Ipad is everything I expected and more. I have watched movies, TV shows, played games and searched the internet all with ease. It is so light!. I took it on a recent trip and it made a huge difference carrying it versus my laptop. I absolutely love it,", "Title": "Awesome", "Date": "May 10, 2014"}, {"Author": "Robert J. Curry \"Bob Curry\"", "ReviewID": "R26877TBATD66Q", "Overall": "5.0", "Content": "Have had my air for some time now and has worked flawlessly with no issues what so ever. It's an apple and some times you do get what you pay for.", "Title": "What can you say it's an Apple", "Date": "May 10, 2014"}, {"Author": "fma", "ReviewID": "R2WMX3H84SOFF1", "Overall": "5.0", "Content": "Like it very muchHave not used my desk top since I got thisResearched it for a year then I decided to get this one without cellular dataI'm using it only where I get wifi and save some moneyGo with a bigger memoryThanks", "Title": "Enjoying", "Date": "May 9, 2014"}, {"Author": "jfhnhh \"jfhnhh\"", "ReviewID": "R3GXYGPG5UNOBK", "Overall": "5.0", "Content": "Apple got the right weight and size right on this one.  I have owned the original iPad, and an iPad 3 and this one by far is the best.  Coupled with iOS 7.1.1 it's hard to beat the performance and features of the iPad Air.", "Title": "Latest iPad Worth It", "Date": "May 3, 2014"}, {"Author": "Mark Pfotenhauer", "ReviewID": "RUHEXM56JNBBE", "Overall": "5.0", "Content": "Love it! Fits my needs perfectly! Highly recommended. Fast, graphics are really crisp. Light weight, fits in my hand nicely.", "Title": "Love my Apple IPad Air", "Date": "May 2, 2014"}, {"Author": "Daniel Herrmann", "ReviewID": "R381Z145CY27WO", "Overall": "4.0", "Content": "It is light weight and thinner then the older I pads.  The face time and maps apps are really nice.  Unable to print directly to standard wireless printer need apple air printer.", "Title": "Great little pad.", "Date": "April 29, 2014"}, {"Author": "Katsumoto \"Katsumoto\"", "ReviewID": "R2F7TD31WV94MF", "Overall": "5.0", "Content": "Amazing... getting better and better every round. This is my 4th iPad, and this one is lighter, smaller, faster, etc...", "Title": "Just AMAZING!", "Date": "April 28, 2014"}, {"Author": "Maryp", "ReviewID": "R1YEJEFD0HXVO6", "Overall": "5.0", "Content": "Perfect.I love this iPad Air. It is so easy to use and so streamlined and light.Definitely worth waiting for.", "Title": "Apple iPad Air.", "Date": "April 28, 2014"}, {"Author": "HappyG.", "ReviewID": "R1NULFVKDYLLJG", "Overall": "5.0", "Content": "This iPAD Air is everything you'll ever need!! The Awesome Machine does EVERYTHING and its super fast in downloading apps, songs, etc... Anyone purchasing this tablet is surely, definitely be having an awesome experience!!!!", "Title": "Excellent!!!!", "Date": "April 28, 2014"}, {"Author": "Richard Miller", "ReviewID": "R2JFIE4YCF4TTU", "Overall": "5.0", "Content": "We have used apple computers for many years and this product is quintessential apple quality and functionality.  Love the iPad air.", "Title": "Great product", "Date": "April 19, 2014"}, {"Author": "Ed", "ReviewID": "R1NU8R4BFZ17TF", "Overall": "5.0", "Content": "It is all good.  I use it for teaching.  I lecture 7 hours per day.  My iPad three would get warm and intermittently reboot about 3 times per 7 hours.  The iPad Air runs cooler, but as of now have not gone 7 hours straight.  I like it.", "Title": "Runs cooler", "Date": "April 18, 2014"}, {"Author": "John and Jesse Maddalena", "ReviewID": "R26KBJ2165CPEN", "Overall": "5.0", "Content": "I chose this iPad over the iPad Mini because there isn't much difference in weight but I love the bigger display. The performance is amazing and I've never had an issue with any applications that I run with slowing down. The Retina display is something else. At first I didn't notice a huge difference; that is until I looked at a normal screen again. I just can't go back. Any device that has a retina display now I'll take over another one. It is just amazing with the clarity.This is a great device and of course what would you expect from Apple. I love it and will definitely recommend it.", "Title": "Wow is all I can say", "Date": "April 18, 2014"}, {"Author": "Boomer", "ReviewID": "R2VXEPAYZ1M1BN", "Overall": "5.0", "Content": "Great iPad, takes great pictures and is more clear than the iPad two with better processing power. Would recommend for anyone wanting to upgrade or new to the iPad format", "Title": "Love the new Air!", "Date": "April 18, 2014"}, {"Author": "Josephine Izzo", "ReviewID": "R6QRY98O6OQT8", "Overall": "4.0", "Content": "Bought the iPad for my husband and he likes it so guess it was a good purchase.The iPad is a new item for us so we require a bit more time to make a viabledecision on its proficient usage.", "Title": "Opinion on the Apple iPad Air", "Date": "April 17, 2014"}, {"Author": "ehrenkd \"ehrenkd\"", "ReviewID": "R3LNNWLCQSSGWW", "Overall": "4.0", "Content": "Bought this to use at work and home. Wifi works great at the office, but at home it has difficulty staying connected. Old iPad, iPhone 4, Windows 7 laptop, bluray player, television can all maintain connection, but not the iPad Air. Research on line looks like there is an issue in some instances with iPad Air and some Trendnet routers (which I have and is < 1yr old so not in a hurry to buy a new one).", "Title": "Great except for wifi connectivity at home", "Date": "April 17, 2014"}, {"Author": "Betty J. Imperato \"Bet\"", "ReviewID": "R2I6CR4J02DVQ1", "Overall": "4.0", "Content": "I love it that's so fast to open my emails and SOME the apps.  Sometimes it's pretty tricky to close out of an email without hitting the bottom button and then I have to come in again...but that might just be my newness.  Overfall I'm very happy to have it.", "Title": "Mostly love it!", "Date": "April 17, 2014"}, {"Author": "stone82", "ReviewID": "R348NJ1Z5AWK9E", "Overall": "5.0", "Content": "I love this device. The battery life is way better than any of the Kindles I've possessed. Web browsing is also slightly improved on the iPad Air. I am extremely impressed Amazon/Apple Inc. Bravo!", "Title": "Fantastic", "Date": "April 17, 2014"}, {"Author": "Marlis VanZante", "ReviewID": "RVG6O3RX6BPL3", "Overall": "5.0", "Content": "I purchased this for my 88 year old mother to watch Live Stream Church.  She can manuever through it and can watch church and now send e-mails and it is also light weight.  She never could have used a lap top, they are too cumbersome.  Thanks for the FAST shipment, she was in the hospital and we needed it ASAP!  It arrived by Sunday church service for her enjoyment.", "Title": "EASE in LEARNING", "Date": "April 17, 2014"}, {"Author": "dh johnson", "ReviewID": "R30YSLQMEFHJKQ", "Overall": "4.0", "Content": "nice machine.  the apple systems take some time to get used to if you have not used them before.  good colors,  good definition,  quick.", "Title": "i like it very much", "Date": "April 17, 2014"}, {"Author": "DAVID", "ReviewID": "R3107ZTRKM9312", "Overall": "5.0", "Content": "Don't waste your money on other pads start with this one. I went through three pads in less then two months so I spent a few more dollars and bought this one. There is no comparing the performance between pads! Bottom line, when it comes to this type of product you get what you pay for!", "Title": "Last stop!", "Date": "March 10, 2014"}, {"Author": "Ricardo E. Gayoso", "ReviewID": "R35GFUH1KNK4LE", "Overall": "5.0", "Content": "Apple always makes devices that are a couple or years ahead of all others. This is another example of that.", "Title": "Always top quality from Apple", "Date": "March 10, 2014"}, {"Author": "Todd", "ReviewID": "RSIVDVZ0E3CZB", "Overall": "5.0", "Content": "Seem to work just fine. Have had no issues so far. It is too expensive like all Apple products are.", "Title": "Good product", "Date": "March 10, 2014"}, {"Author": "Mike Hall", "ReviewID": "R3JV68I5X4EYK7", "Overall": "5.0", "Content": "Has really matured into a versatile and functional tablet.  Mine is used heavily for aviation applications, where it has excellent functionality.", "Title": "IPad Air", "Date": "March 10, 2014"}, {"Author": "ClownboyAW", "ReviewID": "R1G34I3PVK2FXR", "Overall": "5.0", "Content": "Amazon is not going to like this review because I really favor the iPad over the kindle fire. Don't get me wrong, the kindle is a fantastic device but as for ability and apps - The Air is awesome! I use to lug a laptop around to work and play but the iPad Air does everything I want in a small, light package. I added the Pelican case to the Air and it's nearly industrcible. It's been dropped numerous times and faced two minor spills with no ill effects.As a note, I am writing this review with the iPad while sitting stationary in my car. It is a very versatile device with too many features to mention in a short review. I can not imagine not owning one now!", "Title": "How did I ever live withou it?", "Date": "March 10, 2014"}, {"Author": "Francine J Oliver", "ReviewID": "RXR9587XGF6S7", "Overall": "5.0", "Content": "I was very happy with this product. I have never used and apple product before and was apprehensive but it was very user friendly.", "Title": "extremely pleased easy to use", "Date": "March 9, 2014"}, {"Author": "John Wojtowicz", "ReviewID": "REOC67CBA3HI3", "Overall": "5.0", "Content": "This is the first tablet I've bought I have not even played around with one. I bought this after checking  out competitor prices and this was the best buy I could find.  I am extremely happy with it. It is much easier than any windows based item I have used.  I did one thing wrong and gave my laptop away. There are sites I'm unable to access some needed downloads to a tablet.", "Title": "Real nice", "Date": "March 9, 2014"}, {"Author": "Pat Bluth", "ReviewID": "R2ZTZNRGROPUC5", "Overall": "5.0", "Content": "This Apple Ipad Air was purchased as a Christmas gift.  The recipient of this gift was very surprised and happy to receive it.  She was taking a trip and found the Ipad easy to pack and did all she needed to do as if it were her computer.  Very pleased with the product.", "Title": "Apple IPad Air", "Date": "March 9, 2014"}, {"Author": "WhiteKnight", "ReviewID": "R2KXW6X1D9U1YQ", "Overall": "5.0", "Content": "This was a Gift to my Mother and she has raved about it ever since.It's easy to use and she enjoying it more each day.Thanks", "Title": "A wonderful product", "Date": "March 1, 2014"}, {"Author": "Pamela L. Forrester", "ReviewID": "R2RTWJ4I8QZVV9", "Overall": "4.0", "Content": "My first tablet purchase. I bought one for my adult daughter also. We both find it extremely useful and rarely go into our laptops now. So light and easy for me to hold as an older person. It was more expensive than many tablets and doesn't combine with my laptop or printer as many other tablets do.", "Title": "iPad Air", "Date": "March 1, 2014"}, {"Author": "Graham Smith", "ReviewID": "R1GRNP53LN5AMG", "Overall": "5.0", "Content": "It's great! Does everything I wanted and more. Facetime is a great way to keep in touch across the Atlantic and see the new grandchild.", "Title": "It's great!", "Date": "March 1, 2014"}, {"Author": "Innocents Abroad \"Anglophile\"", "ReviewID": "R2Y2NSY3EUMX33", "Overall": "5.0", "Content": "Light weight, replacing laptop for travels.  Fits a travel case that also carries Kindles and cords.  Photos are easily taken and forwarded. Internet via hotel wifi very easy. Good battery life.  No surprises.", "Title": "New traveling computer: weighs just a pound.", "Date": "January 26, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3DBX9IECKRAUR", "Overall": "5.0", "Content": "I am a college student and I drag this with me everywhere!  I love it because it is compatible with office note so I can take my notes and they immediately sync so I can access them on my computer at home!  So convenient and light!", "Title": "Great!", "Date": "January 24, 2014"}, {"Author": "Jayaram Narayanan", "ReviewID": "R2AYWTGM471DRI", "Overall": "5.0", "Content": "Do explain why you liked or disliked this product.Do compare to similar products and share how long you've used this product.Do identify specific attributes (e.g. comfort & fit of a shirt or the battery life of a camera) and whether they met your expectations.Don't describe your seller or shipping experience (you can do that at amazon.com/feedback).Don't include promotional content of any kind or reviews written in exchange for compensation", "Title": "Excellent", "Date": "January 24, 2014"}, {"Author": "Cathleen A. Ellers", "ReviewID": "R8MCIPYA3NZNT", "Overall": "5.0", "Content": "I bought this for my parents for Christmas.  My Dad loves it! When he’s not using it at home, he brings it with him to my Grandfather’s doctor appointments to pass the time. My Mom likes to read magazines or look up recipes and enlarge them on the screen to better view them. It works just like any other tablet or a smart phone, although I’m not sure why it’s called an iPad Air. I don’t think it is significantly lighter than the iPad2, especially, after you put a case on it. However, compared to the iPad2, it does have a bigger processor, significantly better camera and, on the downside, costs about $100 more.  I think this is a great product for those on the go, those who can’t see well and need a bigger font or for the tech-reluctant.  It was the perfect gift and worth the money!", "Title": "Great gift for anyone but, especially, the tech-reluctant!", "Date": "January 24, 2014"}, {"Author": "Amazon Junkie \"Ricky\"", "ReviewID": "R20O8GF5CKTCGP", "Overall": "5.0", "Content": "Works as well as my full size and my wife's mini iPad .  I like the fact that it's lighter for when I'm laying on the sofa, but large enough to see without my glasses.", "Title": "It's an iPad...", "Date": "January 24, 2014"}, {"Author": "shaikh mahiedin", "ReviewID": "R1BDTLS6ACKE0I", "Overall": "5.0", "Content": "Its great for serfing the web and family picture album. The display is awesome. Battery Life is great. Very well made.", "Title": "Great product.", "Date": "January 24, 2014"}, {"Author": "JG", "ReviewID": "R32A722SY15A1R", "Overall": "5.0", "Content": "The iPad Air is a wonderful device. It does tasks such as web browsing, checking email, and watching movies with ease. It also has great battery life. Most of the one and two star reviews come from people who either had software problems or had problems because of user error. The software problems are not the fault of the iPad, Apple just needs to get around to updating iOS 7. I would highly recommend this device if you are searching for a tablet in the 10-inch range. The hardware is fantastic and the software can be updated.", "Title": "Great, High Quality Device", "Date": "January 23, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RSTC84C96OOAA", "Overall": "5.0", "Content": "I bought this for my wife. She had the original ipad and used it constantly. It was so heavy to lug around so I decided to upgrade her to the new iPad air. She absolutely loves it, the new retina display is beautiful and it weighs a full pound less. I would highly recommend this device to any one.", "Title": "Great Item", "Date": "January 23, 2014"}, {"Author": "Richard Figueroa", "ReviewID": "R1UV339RXES6UL", "Overall": "5.0", "Content": "Never have been an Apple fan, but I have to admit the IPad is a fun little device. Curse you Candy Crush!", "Title": "IPad is IFun", "Date": "January 23, 2014"}, {"Author": "HowardD", "ReviewID": "R2BEKZP9U3IBLV", "Overall": "5.0", "Content": "No issues whatsoever. We bought two for Christmas. Kids love them. They do what they are supposed to do. We recommend it", "Title": "Love the new Ipad Air", "Date": "January 23, 2014"}, {"Author": "Antonio", "ReviewID": "RF16B60SXC48", "Overall": "4.0", "Content": "I love my new ipad, is just as advertised and it arrive very quick my only complain is that fedex leaved the package on my terrace when I wasn't home, wick really pieced me off", "Title": "great product", "Date": "December 22, 2013"}, {"Author": "Vertigo", "ReviewID": "R1UTMBI6P2JE9W", "Overall": "1.0", "Content": "Apparently, Amazon is sandbagging the reviews here.  My first review of the iPad Air was deleted.  Ergo, I'll repeat my original statement.Nice tablet with a fatally flawed web browser problem. My iPad Air started with Safari crashing right out of the box. I put up with it for a month and then had it replaced by Apple under warranty, however, the problem continued. The experts at the Genius Bar said the problem would be fixed in iOS 7.1. After upgrading to 7.1 today the issue persists. Puffin browser seems more stable but still crashes on occasion. Apple's failure to fix this is unacceptable.", "Title": "Amazon deleted my negative review", "Date": "March 13, 2014"}, {"Author": "Jan", "ReviewID": "R24KH2CVR917CM", "Overall": "1.0", "Content": "I cant get it connected. The instructions don't help a non techie at all. Not an out of the box product.", "Title": "very frustrated that I cant get it to work.", "Date": "February 10, 2014"}, {"Author": "David R. Marcus \"dmarcus1260\"", "ReviewID": "RDUX5RQEHAHJ2", "Overall": "3.0", "Content": "I purchased my iPad Air directly from Apple and then returned it without ever using it.  I was very disappointed to say the least when I learned the stereo speakers were on the bottom of the device.  What was the design team thinking?!!?  Obviously the iPad Air is a rushed product.  My review is not to bash the device.  Heck I love Apple.  I have an iMac, MacBook Pro, Classic iPod, Apple TV, and have owned an iPhone 3, 4 and currently own the iPhone 5.  The thing is I can not justify spending hundreds of $$$ on a product that should have been designed better.  Hopefully in 2014 the next iPad Air model will put the S T E R E O speakers on the FRONT of the device.UPDATE 12/4/2013: I just came back from The Apple Store to make it \"official\" that I have used an iPad Air.  Yes the iPad Air is thinner than previous iPad models and it may be faster.  Honestly I didn't see much of a difference in speed between the iPad Air and the iPad 4 while surfing the web.  That said I still see no reason to get an iPad Air if you already own an iPad 4.", "Title": "Stereo anyone?", "Date": "November 28, 2013"}, {"Author": "MARCIA", "ReviewID": "R2UL04RH6CL3X1", "Overall": "2.0", "Content": "I really, really wanted to like the iPad Air, but It just wasn't for me. I was looking for a replacement for my 2008 white Macbook, which I loved. The iPad Air is NOT, repeat not a laptop replacement. I don't have heavy computing requirements, but the brand new iPad couldn't do a number of BASIC things my 5 and a half year old Macbook does with ease.The most important is multitasking. The iPad can only do one thing at a time. Only one window or app can be open at a time. Seriously? iPad doesn't do flash player, so any number of things (like watching certain youtube videos,etc) can't be done.I found the touch screen to be inconsistent. I was constantly having to enlarge links to be able to click them properly. I was also disappointed with the small amount of included apps.Now the good: If you want a portable device to check email, browse the web, take pictures,etc and you tend to do one thing at a time, the iPad may work for you. The retina display and the fit and finish of the iPad are excellent. It is light, thin, fast, and beautiful. Siri is included and works well.I love Apple products, but I found the iPad to be underpowered and lacking versatility. If you're looking for a laptop replacement, I couldn't recommend it. I ended up returning it and got a Macbook Pro instead.", "Title": "I Really, Really Wanted To Like The iPad Air", "Date": "December 3, 2013"}, {"Author": "Hao Wang", "ReviewID": "RC2HQ6Q43B1F4", "Overall": "1.0", "Content": "How can they get the permission of selling on Amazon?! Can the service be more worse than that? I ordered it a week before the Christmas day, while waiting for more than 2 week without any progress. I contacted the seller several times, but nobody gave any response. Don't order anything from them if you would not want to waste your money.", "Title": "I want to give zero if I could!", "Date": "May 28, 2014"}, {"Author": "David Velte", "ReviewID": "R2350WQV4OCRDW", "Overall": "5.0", "Content": "I bought an Ipad 1 on release day. I loved everything about it except the weight. But. It was still my beast friend. I just purchased a brand new Ipad Air. All I can say is WOW! It is thin, light, beautiful and sexy! The screen is amazing! Apple has a huge success on it's hands. It is lightning fast. The battery life is great. I have had mine either on or on standby for three days now and I still have 25% battery life left. I would recommend this tablet to anyone looking to improve their business and pleasure experience! If I had to do it all over again, I would buy the Ipad Air.", "Title": "I Love It!!!", "Date": "November 13, 2013"}, {"Author": "Mike Schmidt", "ReviewID": "R1SQTW5PLP5I3H", "Overall": "2.0", "Content": "These people with the \"perfect,\" 5 star, ratings are hysterical.  This little thing depreciates faster than a falling brick.  It's a tech fad and you're paying about 300% over value  to fit in.  It's like 1975 and lava lamps craze - with a lot more conformist culture and people into it. Except, Lava lamps aren't anti-social and waste your time. Get an iPad - it has that apple logo that makes everybody realize that you're cool now.", "Title": "spend the money on a year's books & classes at your local J.C. instead", "Date": "November 23, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00G2YD32K", "Features": null, "ImgURL": null, "Name": null}}