{"Reviews": [{"Author": "Deal Hunting Mom", "ReviewID": "RLYUZGMOFN9II", "Overall": "5.0", "Content": "Just received yesterday 2-4 weeks earlier than anticipated. PLEASE BE AWARE THAT THIS COMPANY IS SHIPPING FROM CHINA! Didn't matter much to me because I am not a last minute Christmas shopper, but to take advantage of the free shipping that they offer, I wouldn't order things any later than the first week of December in order to receive by Christmas.Great tablet for kids and adults honestly. It does everything your smart phone can do outside of receiving calls! There are parental controls and access to the google play store. Also a quick feature that allows you to switch between kid and adult mode with ease. Comes with a few apps pre-loaded, but none that my kids really would use outside of cut the rope. I just downloaded all the apps they like, IE; Netflix, PBS Kids, Disney Jr, Nick Jr, Cartoon Network. I actually like that the tablet didn't come preloaded because I am able to personalize it with apps they will actually use. The keyboard is small, but it works for kids. Also should take into account that the case is for a 7\" inch tablet so it is actually size appropriate. Packaged very neat and tight, no room for movement during shipment. I really have no complaints. Also the OTG cable that many people talk about on here not coming with the keyboard case DOES come with this bundle. The tablet can be stored in this case for travel purposes.However if you buy the tablet without the keyboard case, it is very thin and lightweight. Great for adults, maybe not so much for kids. I'd definitely get some type of protective case for it.******UPDATE TO MY PREVIOUS REVIEW: The actual tablet does not have that much memory so I'd suggest at least an 8GB SD memory card. You can get them off Amazon for under 10 bucks. I've noticed the tablet doesn't lag as much since I bought one! I would also suggest purchasing the SQUARE TRADE accident protection warranty because this company is in China. They are wonderful about replacements and such, but the return shipping is so awful. I'm glad I decided to purchase the Square Trade warranty as a precaution. I've unfortunately had to cash in on it already and it was painless!", "Title": "GREAT TABLET!", "Date": "November 20, 2013"}, {"Author": "Alexander Shabanov", "ReviewID": "R1NT5ZIZVLNRK1", "Overall": "1.0", "Content": "This is keyboard only, tablet is not included!There is no clue in the item description that this item doesn't include tablet itself, what is the reason to write in the product description tablet parameters like* Android 4.1 - Full Google Play Store - Tons of Apps to Download* Dual Cameras 0.3MP Front/ 0.3 MP Rear?This seems very much like a fraud - you basically added a nice photo of a tablet plus its description in hope to sell your crappy keyboard.I'm very disappointed.", "Title": "This is a fraud, don't buy it", "Date": "April 25, 2014"}, {"Author": "rose", "ReviewID": "R11LH8NP89XQFN", "Overall": "5.0", "Content": "Didn't bother me that took so long to ship but it arrived before date states so I am happy. Got this for myv9yr old daughter.  So far I love it works great turns on fast. Comes with couple downloaded apps already. Download several others. Wonderful price. Battery life when unplugged is ok but can't complain for the price $69.99. I would recommend to anyone just remember its not a computer. I plan in ordering another one for my other daughter to help her learn abcs&math;", "Title": "great for price", "Date": "March 12, 2014"}, {"Author": "Francine Cano", "ReviewID": "R2QTEDGYSJG1Q0", "Overall": "4.0", "Content": "Not bad for a little girl!  Has lots of basic functions and includes google play store.  Don't like the fact that you have to use an adapter to plug in the keyboard but, for the price it is ok.", "Title": "not bad for a little kid", "Date": "December 7, 2013"}, {"Author": "Ashley", "ReviewID": "R3U4NIS3O8V6E3", "Overall": "5.0", "Content": "I was a bit skeptical about purchasing a child's tablet for my daughter but she absolutely adores it. It came in only a few days (much sooner than expected) and was well packaged. Once I opened it I was so shocked and happy to see it looked even better than the pics! The case is thicker and durable as is the tablet itself. It is quick to turn on and the screen responds to touch very well. The battery life so far is normal, I don't have her on it 24/7 like a lot of parents might but I don't find myself charging it over and over. Absolutely happy with this purchase! Keep in mind, this is a CHILDS tablet not expected to cruise the Internet all the time etc. For the price I may purchase one for my nephew as well :) well worth the money!", "Title": "Perfect for a little girl!", "Date": "March 5, 2014"}, {"Author": "Ronald Watty", "ReviewID": "R3C0TT4SP9DVX0", "Overall": "3.0", "Content": "i really like the bundle. the issue is with the tablet. if the tablet falls it loses buttons. not even a hard fall. i'd love to see the manufacture make a little more sturdy since the common users are kids.", "Title": "fragile", "Date": "May 7, 2014"}, {"Author": "niks", "ReviewID": "R125YRYCHDHT6X", "Overall": "3.0", "Content": "The latches to hold the tablet in place broke off quick n easy and the volume button also fell out from the tablet...not happy about that. BUT in all the tablet works fine, I just wish it was made with more quality.", "Title": "birthday bundle", "Date": "May 5, 2014"}, {"Author": "Kris Holland-Christian", "ReviewID": "RHEAB6GV6OCPB", "Overall": "5.0", "Content": "I was very impressed with my product. And the price was great. I brought the item for my daughter, but I have been enjoying using it for myself.", "Title": "Great Deal", "Date": "April 7, 2014"}, {"Author": "Margaret Cook", "ReviewID": "R14Q523YPHCI2S", "Overall": "3.0", "Content": "I really like the tablet for children, the problem is with the keyboard case.  The tablet does not fit in it properly.", "Title": "Nice tablet", "Date": "March 21, 2014"}, {"Author": "sugars", "ReviewID": "RHBGUBQF2J1TZ", "Overall": "1.0", "Content": "I ordered this for my daughters birthday and it doesn't turn on 99% of the time n if it does I have to keep it plugged into 2 power outlets and it says batter life is 2 minutes and 33 seconds DO NOT PURCHASE it's a waste of money", "Title": "What a waste", "Date": "June 8, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B00GG4OJS8", "Features": null, "ImgURL": null, "Name": null}}